{
  "chapter": "الأحقاف",
  "text": "قل ارءيتم ما تدعون من دون الله ارونى ماذا خلقوا۟ من الارض ام لهم شرك فى السموت ائتونى بكتب من قبل هذا او اثرة من علم ان كنتم صدقين",
  "translations": [
    {
      "translation": "Say: 'Have you thought about those you call upon apart from Allah? Show me what they have created on the earth. Or do they have a partnership in the heavens? Produce a Book for me before this one or a shred of knowledge if you are telling the truth.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Have you thought of those you invoke apart from God? Show me what they have created of the earth, or, do they have a share in the heavens? Bring me an earlier Book than this, or inherited knowledge, if you are truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them, (O Prophet): “Did you consider those whom you call upon beside Allah? Show me, which part of the earth they created? Or do they have any share in creating the heavens? Bring to me any Scripture earlier than this one, or any vestige of knowledge (in support of your belief) if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), ask them, \"Have you thought about what you worship besides God? Show me which part of the earth they have created. Do they have a share in the creation of the heavens? Bring me a Book, revealed before this Quran, or any other proof based on knowledge to support your belief, if indeed you are truthful\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, (O dear Prophet Mohammed – peace and blessings be upon him), “What is your opinion – regarding those whom you worship other than Allah – show me which part of the earth they have created, or do they own any portion of the heavens? Bring to me a Book preceding this (Qur’an), or some remnants of knowledge, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Think you about all that you invoke besides Allah Show me what have they created of the earth Or have they a share in (the creation of) the heavens Bring me a scripture prior to this or some trace of knowledge, if you are truthful!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Have you considered what you call upon besides Allah? Show me what they have created of the earth, or have they a share in the heavens? Bring me a book before this or traces of knowledge, if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Have you considered that you call upon apart from God? Show me what they have created of the earth; or have they a partnership in the heavens? Bring me a Book before this, or some remnant of a knowledge, if you speak truly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (unto them, O Muhammad): Have ye thought on all that ye invoke beside Allah? Show me what they have created of the earth. Or have they any portion in the heavens? Bring me a scripture before this (Scripture), or some vestige of knowledge (in support of what ye say), if ye are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Have you thought about those you call upon apart from God? Show me what they have created on the earth. Or do they have a share in the heavens? Bring me a Book revealed before this or some other vestige of knowledge, if you are telling the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: bethink ye: whatsoever ye call upon beside Allah- show me whatsoever they have created of the earth? Or have they any partnership in the heavens? Bring me a Book before this, Or some trace of knowledges if ye say sooth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Tell me about those you invoke besides Allah. Show me what [part] of the earth have they created. Do they have any share in the heavens? Bring me a scripture [revealed] before this, or some vestige of [divine] knowledge, if you are truthful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Do ye see what it is ye invoke besides Allah? Show me what it is they have created on earth, or have they a share in the heavens bring me a book (revealed) before this, or any remnant of knowledge (ye may have), if ye are telling the truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW to these pagans): \"Think! All that you invoke besides Allah show me! What have they created of the earth? Or have they a share in (the creation of) the heavens? Bring me a Book (revealed before this), or some trace of knowledge (in support of your claims), if you are truthful!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Have you seen those whom you call upon, other than Allah? Show me what they have created from the earth! Or, do they have a partnership in theheavens? Bring me a Book before this or some other remnant of knowledge, if what you say is true'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Have you considered those you worship instead of God? Show me which portion of the earth they have created. Or do they own a share of the heavens? Bring me a scripture prior to this one, or some trace of knowledge, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"Have you considered that which you invoke besides Allah? Show me what they have created of the earth; or did they have partnership in [creation of] the heavens? Bring me a scripture [revealed] before this or a [remaining] trace of knowledge, if you should be truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:4] Say: ‘Have you considered, [say] Inform me [about], what you invoke, [what] you worship, besides God?, namely, the idols (min dūni’Llāhi, constitutes the first object [of the verb]). Show me — inform me — (arūnī, [repeated] for emphasis), what they have created (mādhā khalaqū, the second object) of the earth (mina’lardi, the explication of mā, ‘what [part]’). Or do they have any share, any partnership, in, the creation of, the heavens?, with God? (am, ‘or’, has the significance of the [rhetorical interrogative] hamza of denial). Bring me a scripture, [that has been] revealed, before this, Qur’ān, or some vestige, some remnant, of knowledge, transmitted from the ancients confirming the soundness of your claim that your worship of the idols brings you closer to God, if you are truthful’, in your claim.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ أَرَأَيْتُمْ مَا تَدْعُونَ مِنْ دُونِ اللَّهِ أَرُونِي مَاذَا خَلَقُوا مِنَ الْأَرْضِ أَمْ لَهُمْ شِرْكٌ فِي السَّمَاوَاتِ ائْتُونِي بِكِتَابٍ مِنْ قَبْلِ هَذَا أَوْ أَثَارَةٍ مِنْ عِلْمٍ إِنْ كُنْتُمْ صَادِقِينَ (4(انتقل إلى الاستدلال على بطلان نفي صفة الإلهية عن أصنامهم . فجملة { قل أرأيتم ما تدعون } أمر بإلقاء الدليل على إبطال الإشراك وهو أصل ضلالهم .وجَاء هذا الاستدلالُ بأسلوب المناظرة فجُعل النبي صلى الله عليه وسلم مواجهاً لهم بالاحتجاج ليكون إلجاءً لهم إلى الاعتراف بالعجز عن معارضة حجته ، وكذلك جرى الاحتجاج بعده ثلاث مرات بطريقة أمر التعجيز بقوله : { أروني ماذا خلقوا من الأرض أم لهم شرك في السماوات أيتوني بكتاب } الآية . و { أرأيتم } استفهام تقريري فهو كناية عن معنى : أخبروني ، وقد تقدم في سورة الأنعام ( 40 ( قوله : { قل أرأيتكم إن أتاكم عذاب الله أو أتتكم الساعة أغير الله تدعون }وقوله : أروني } تصريح بما كنى عنه طريق التقرير لقوله : { أرأيتم ما تدعون } وموقع جملة { أروني } في موقع المفعول الثاني لفعل { أرأيتم } .والأمر في { أروني ماذا خلقوا من الأرض } مستعمل في التسخير والتعجيز كناية عن النفي إن لم يخلقوا من الأرض شيئاً فلا تستطيعوا أن تُروني شيئاً خلقوه في الأرض ، وهذا من رؤوس مسائل المناظرة ، وهو مطالبة المدّعي بالدليل على إثبات دعواه . و { ماذا } بمعنى ما الذي خلقوه ، ف ( ما ( استفهامية ، و ( ذا ( بمعنى الذي . وأصله اسم إشارة ناب عن الموصول . وأصل التركيب : ماذا الذي خلقوا ، فاقتصر على اسم الإشارة وحذف اسم الموصول غالباً في الكلام وقد يظهر كما في قوله تعالى : { من ذَا الذي يشفع عنده } \\[ البقرة : 255 \\] . ولهذا قال النحاة : إن ( ذا ( بعد ( ما ( أو ( مَن ( الاستفهاميتين بمنزلة ( مَا ( الموصولة .والاستفهامُ في { ماذا خلقوا } إنكاري . وجملة { ماذا خلقوا } بدل من جملة { أروني } وفعل الرؤية معلق عن العمل بورود { ما } الاستفهامية بعده ، وإذا لم يكن شيء من الأرض مخلوقاً لهم بطل أن يكونوا آلهة لِخروج المخلوقات عن خَلقهم ، وإذا بطل أن يكون لها خلق بطل أن يكون لها تصرف في المخلوقات كما قال تعالى : { أيشركون ما لا يخلق شيئاً وهم يُخلقون ولا يستطيعون لهم نصراً ولا أنفسَهم ينصرون } في سورة الأعراف ( 191 ، 192 ( .وأم } حرف إضراب انتقالي . والاستفهام المقدر بعد { أم } المنقطعة استفهام إنكاري أي ليس لهم شرك مع الله في السماوات . وإنما أوثر انتفاء الشِركة بالنسبة للشركة في السماوات دون انتفاء الخلق كما أوثر انتفاء الخلق بالنسبة إلى الأرض لأن مخلوقات الأرض مشاهدة للناس ظاهر تطورها وحدوثها وأن ليس لما يدعونهم دون الله أدنى عمل في إيجادها ، وأما الموجودات السماوية فهي محجوبة عن العيون لا عهد للناس بظهور وجودها ولا تطورها فلا يحسن الاستدلال بعدم تأثير الأصنام في إيجاد شيء منها ولكن لمّا لم يدّع المشركون تصرفاً للأصنام إلا في أحوال الناس في الأرض من جلب نفع أو دفع ضر اقتصر في نفي تصرفهم في السماوات على الاستدلال بنفي أن يكون للأصنام شركة في أمور السماوات لأن انتفاء ذلك لا ينازعون فيه .وتقدم نظير هذه الآية في سورة فاطر ( 40 ( { قل أرأيتم شركاءكم الذين تدعون من دون الله } الآية فانظر ذلك .ثم انتقل من الاستدلال بالمشاهدة وبالإقرار إلى الاستدلال بالأخبار الصادقة بقوله : ائتوني بكتاب من قبل هذا } فجملة { ائتوني بكتاب } في موقع مفعول ثان لفعل { أرأيتم } ، كرر كما يتعدد خبر المبتدأ . ومناط الاستدلال أنه استدلال على إبطال دعوى المدعي بانعدام الحجة على دعواه ويسمى الإفحام كما تقدم . والمعنى : نفي أن يكون لهم حجة على إلهية الأصنام لا بتأثيرها في المخلوقات ، ولا بأقوال الكتب ، فهذا قريب من قوله في سورة فاطر ( 40 ( { أم آتيناهم كتاباً فهم على بينة منه } والمراد ب ( كتاب ( أيُّ كتاب من الكتب المقروءة . وهذا قاطع لهم فإنهم لا يستطيعون ادعاء أن لأصنامهم في الكتب السابقة ذِكراً غير الإبطال والتحذير من عبادتها ، فلا يوجد في الكتب إلا أحد أمرين : إمّا إبطال عبادة الأصنام كما في الكتب السماوية ، وإمّا عدم ذكرها البتة ويدل على أن المراد ذلك قوله بعده : أو أثارة من علم } .والإتيان مستعار للإحضار ولو كان في مجلسهم على ما تقدم في قوله تعالى : { فأتوا بسورة من مثله } في سورة البقرة ( 23 ( .والإشارة في قوله : من قبل هذا } إلى القرآن لأنه حاضر في أذهان أصحاب المحاجة فإنه يُقرأ عليهم معاودة . ووجه تخصيص الكتاب بوصف أن يكون من قبل القرآن ليسد عليهم باب المعارضة بأن يأتوا بكتاب يُصنع لهم ، كمَا قالوا : { لو نشاء لقلنا مثل هذا إن هذا إلاّ أساطير الأولين } \\[ الأنفال : 31 \\] .و { أثارة } بفتح الهمزة : البقية من الشيء . والمعنى : أو بقية بقيت عندكم تروونها عن أهل العلم السابقين غير مسطورة في الكتب . وهذا توسيع عليهم في أنواع الحجة ليكون عجزهم عن الإتيان بشيء من ذلك أقطع لدعواهم . وفي قوله : { إن كنتم صادقين } إلهاب وإفحام لهم بأنهم غير آتين بحجة لا من جانب العقل ولا من جانب النقل المسطور أو المأثور ، وقد قال تعالى في سورة القصص ( 50 ( { فإن لم يستجيبوا لك فاعلم أنما يتبعون أهواءهم . }\n\n",
      "translations": [
        {
          "translation": "(Say) Muhammad to the people of Mecca: (Have ye thought on) inform me about (all that ye invoke) worship (beside Allah) of idols? (Show me what they have created of the earth) what have they created of that which is in the earth. (Or have they any portion in the heavens) or had they any help in the creation of heavens? (Bring me a Scripture before this (Scripture)) before this Qur'an to substantiate your claim, (or some vestige of knowledge) or a report from the men of knowledge; and it is said: a vestige of knowledge from past prophets ((in support of what you say), if ye are truthful) in what you say.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السائب عن أبي خالد الواسطي عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { أَوْ أَثَارَةٍ مِّنْ عِلْمٍ } معناه بَقيةٌ مِنْ عِلمٍ ويقال: هو الخَطُّ فِي الأَرضِ\n فَكان عِلمُ نَبي من الأَنبياءِ فِيما خَلا\n\n",
      "translations": [
        {
          "translation": "\n\n{Abu Ja'far} told us that {Ali ibn Ahmad} told him\n\n\nHe said: It was narrated to us by 'Ata' ibn al-Sa'ib from Abu Khalid al-Wasiti from Zayd ibn 'Ali, peace be upon them, regarding the words of God Almighty, \"or a stirring up of knowledge\": its meaning is a remnant of knowledge. And it is said: It is the line on the earth.\n\n\nSo the knowledge of the prophet was among the prophets in what was left.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم يا أكمل الرسل بعدما أفرطوا في الإعراض عن الله وعن توحيده وأثبتوا له شركاء ظلماً وزوراً\n مستفهماً على سبيل الإلزام والتبكيت: { أَرَأَيْتُمْ } أي: أخبروني { مَّا تَدْعُونَ مِن دُونِ ٱللَّهِ } وتتخذون آلهة سواه وتعتقدونهم شركاء معه في الأرض { أَرُونِي مَاذَا خَلَقُواْ } أي: أي: شيء أوجدوا { مِنَ ٱلأَرْضِ } حتى اتصفوا بالخالقية واستحقوا بالمعبودية والربوبية\n وأخبروني هل تنحصر شركتهم مع الله بعالم العناصر والمسببات { أَمْ لَهُمْ شِرْكٌ } أيضاً { فِي ٱلسَّمَٰوَٰتِ } وعالم الأسباب { ٱئْتُونِي بِكِتَابٍ } نازل من قبل الحق { مِّن قَبْلِ هَـٰذَآ } القرآن يؤمر فيه باتخاذ هؤلاء الهلكى آلهة سوى الله\n مستحقة بالعبادة { أَوْ أَثَارَةٍ } ائتوني ببقية { مِّنْ عِلْمٍ } دليل عقلي أو نقلي\n قد بقى لكم من أسلافكم\n يدل على إيثارهم واختيارهم آلهة شركاء معه سبحانه في ألهويته\n وبالجملة: ائتوني بسند صحيح أن { كُنتُمْ صَادِقِينَ } [الأحقاف: 4] في دعوى الشركة مع الله المنزه عن التعدد مطلقاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { قل } يا محمد\n توبيخاً وتبكيتاً لهم: { أرأيتم } أخبروني { ماتَدْعون من دون الله } ما تعبدون من الأصنام من دون الله\n { أَرُونِي ماذا خلقوا من الأرض } أيّ شيء خَلقوا في الأرض إن كانوا آلهة؟ { أم لهم شِرْكٌ في السماوات } أي: أم لهم شركة مع الله في خلق السموات\n حتى يتوهم أن تكون لهم شائبة استحقاق للعبادة؟ فإنَّ مَن لا مدخل له في شيء من الأشياء\n بوجه من الوجوه\n بمعزل من ذلك الاستحقاق بأسره\n وإن كان من الأحياء العقلاء\n فما ظنك بالجماد؟ { ائتُوني بكتابٍ مِن قبل هذا } أي: من قبل القرآن\n يعني: أن هذا الكتاب ناطق بالتوحيد\n وإبطال الشرك\n وما من كتاب أنزل مِن قَبله من كتب الله إلا وهو ناطق بمثل ذلك\n فأتوا بكتاب واحد مُنزل مِن قبله\n شاهد بصحة ما أنتم عليه من عبادة غير الله\n { أو أثَارةٍ من عِلم } أو بقيةٍ من علم بقيت عندكم من علوم الأقدمين\n شاهدة باستحقاق الأصنام للعبادة\n { إِن كنتم صادقين } في أن الله أمركم بعبادة الأوثان\n فإن الدعوى لا تصح ما لم يقم عليها برهان عقلي\n ولا سلطان نقلي\n وحيث لم يقم عليها شيء\n بل قامت على خلافها أدلةُ العقل والنقل تبين بطلانها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:40",
      "similarity": 0.5403482481752244
    },
    {
      "verse": "31:11",
      "similarity": 0.489469153641466
    },
    {
      "verse": "74:24",
      "similarity": 0.4511583113495183
    },
    {
      "verse": "79:38",
      "similarity": 0.4318452329962129
    },
    {
      "verse": "87:16",
      "similarity": 0.416725172208127
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/046004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/046004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/46:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}