{
  "chapter": "الأحقاف",
  "text": "ومن اضل ممن يدعوا۟ من دون الله من لا يستجيب له الى يوم القيمة وهم عن دعائهم غفلون",
  "translations": [
    {
      "translation": "Who is more astray than he who calls on those, apart from God, who cannot answer their prayers till the Day of Resurrection, and are even unaware of being called.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is farther strayed from the Right Path than he who calls upon others than Allah that cannot answer his call till the Day of Resurrection, the while they are not even conscious that callers are calling upon them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more astray than one who prays to things besides God; things that would not be able to answer his prayers even if he would wait till the Day of Judgment. They are not even aware of his prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more astray than one who worships those, instead of Allah, who cannot listen to their prayer until* the Day of Resurrection, and who do not even know of their worship! (Will never listen.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more astray than those who invoke besides Allah others who will not answer them until the Day of Resurrection, and who are unaware of their invocations to them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is in greater error than he who calls besides Allah upon those that will not answer him till the day of resurrection and they are heedless of their call?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is further astray than he who calls, apart from God, upon such a one as shall not answer him till the Day of Resurrection? Such as are heedless of their calling,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is further astray than those who, instead of Allah, pray unto such as hear not their prayer until the Day of Resurrection, and are unconscious of their prayer,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more misguided than one who invokes, besides God, such as will not answer him until the Day of Resurrection, and who [in fact] are not even aware of his call,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more astray than he who calleth beside Allah, Unto such as will answer it not till the Day of Resurrection and who are of their call unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more astray than him who invokes besides Allah such [entities] as would not respond to him until the Day of Resurrection, and who are oblivious of their invocation?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more astray than one who invokes besides Allah, such as will not answer him to the Day of Judgment, and who (in fact) are unconscious of their call (to them)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more astray than one who calls (invokes) besides Allah, such as will not answer him till the Day of Resurrection, and who are (even) unaware of their calls (invocations) to them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is further astray than he who calls upon, other than Allah, those who will never answer him till the Day of Resurrection, who are indeed, heedless of their supplication?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more wrong than him who invokes, besides God, those who will not answer him until the Day of Resurrection, and are heedless of their prayers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more astray than he who invokes besides Allah those who will not respond to him until the Day of Resurrection, and they, of their invocation, are unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:5] And who is (man here is interrogative but meant [rhetorically] as a negation: in other words, ‘no one is’) further astray than him who invokes, [him who] worships, besides God, that is to say, other than Him, such as would not respond to him [even] until the Day of Resurrection — these are the idols, who never answer those who worship them in anything that they ask for — and who are heedless of their supplication?, their worship, because they are inanimates that possess no [faculty of] comprehension.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And who is further astray) from the Truth and guidance (than those who, instead of Allah) i.e. the disbeliever, (pray unto) worship (such as hear not their prayer) such as respond not to his supplication (until the Day of Resurrection) i.e. the idols, (and are unconscious of their prayer) and are unaware of the prayers of those who worship them,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { مَنْ أَضَلُّ } طريقاً وأسوأ سبيلاً وأشد سفها وحماقة { مِمَّن يَدْعُواْ مِن دُونِ ٱللَّهِ } السميع العليم البصير الحكيم القدير الخبير، المستقل في تصرفاته بالإرادة والاختيار { مَن لاَّ يَسْتَجِيبُ لَهُ } أي: أصناماً لا يسمع دعاءه، ولا يجيب ولا يعلم بحاله، ولا يدبر له أموره، وإن دعاه وتضرع نحوه { إِلَىٰ يَوْمِ ٱلْقِيَامَةِ } أي: أبداً ما دامت الدنيا بل { وَهُمْ } أي: مبعوداتهم الباطلة { عَن دُعَآئِهِمْ } أي: عن دعاء عابديهم { غَافِلُونَ } [الأحقاف: 5] ذاهلون، لا شعور لهم حتى يفهموا أو يجيبوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}