{
  "chapter": "الأحقاف",
  "text": "واذا حشر الناس كانوا۟ لهم اعداء وكانوا۟ بعبادتهم كفرين",
  "translations": [
    {
      "translation": "When all men are gathered together (on that Day) they will become their enemies and deny their worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When all human beings will be gathered together those who had been called upon will become the enemies to their votaries and will disown their worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When people will be resurrected, such gods will become their enemies and will reject their worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when people are gathered, they will become their enemies, and will reject their worshippers. (The idols will give testimony against the polytheists.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when mankind are gathered, they (false deities) will become their enemies and will deny their worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when men are gathered together they shall be their enemies, and shall be deniers of their worshipping (them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when mankind are mustered, shall be enemies to them, and shall deny their service.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when mankind are gathered (to the Judgment) will become enemies for them, and will become deniers of having been worshipped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when mankind are gathered together, they will become their enemies, and will deny their worship?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when mankind will be gathered they will become Unto them enemies and of their worship they will become deniers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When mankind are mustered [on Judgement’s Day] they will be their enemies, and they will disavow their worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when mankind are gathered together (at the Resurrection), they will be hostile to them and reject their worship (altogether)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when mankind are gathered (on the Day of Resurrection), they (false deities) will become enemies for them and will deny their worshipping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, when mankind are gathered, those will become their enemies and disown their worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when humanity is gathered, they will be enemies to them, and will renounce their worship of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the people are gathered [that Day], they [who were invoked] will be enemies to them, and they will be deniers of their worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:6] And when mankind are gathered, they, the idols, will be enemies to them, to those who had worshipped them, and they will deny, they will disavow, their worship, the worship of those who had worshipped them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when mankind are gathered (to the Judgement) will become) i.e. the idols (enemies for them) i.e. for the people who worshipped them, (and will become) the idols (deniers of having been worshipped) by those ' The actual number is 35 verses. 585 who had worshipped them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وإذا حشر النَّاس كانوا لهم أعدَاء } لأن عبادة أهل الدنيا لسادتهم وخدمتهم إياهم لا تكون إلا لغرض نفساني وكذا استعباد الموالي لخدمهم فإذا ارتفعت الأغراض وزالت العلل والأسباب كانوا لهم أعداء وأنكروا عبادتهم يقولون: ما خدمتمونا ولكن خدمتم أنفسكم، كما قيل في تفسير قوله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } هم قد عبودهم معتقدين نفعهم، ولم يعلموا أنهم { إِذَا حُشِرَ ٱلنَّاسُ } وجمعوا في الحشر للحساب والجزاء { كَانُواْ لَهُمْ أَعْدَآءً } أي: المعبودين للعابدين، بل { وَكَانُواْ } أي: المعبودين { بِعِبَادَتِهِمْ } أي: العابدين لهم { كَافِرِينَ } [الأحقاف: 6] منكرين جاحدين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}