{
  "chapter": "الأحقاف",
  "text": "واذا تتلى عليهم ءايتنا بينت قال الذين كفروا۟ للحق لما جاءهم هذا سحر مبين",
  "translations": [
    {
      "translation": "When Our Clear Signs are recited to them, those who reject say to the truth when it comes to them, 'This is downright magic'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our clear revelations are read out to them, the infidels say of the truth, when it has come to them: \"This is pure magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our Clear Messages are rehearsed to them, the unbelievers exclaim about the Truth when it came to them: “This is plain sorcery.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our enlightening revelations are recited to them, the disbelievers, of the truth which has come to them, say, \"This is plain magic\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear verses are recited to them, the disbelievers say regarding the Truth that has come to them, “This is an obvious magic!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Clear Ayat are recited to them, the disbelievers say of the truth when it reaches them: \"This is plain magic!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear communications are recited to them, those who disbelieve say with regard to the truth when it comes to them: This is clear magic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our signs are recited to them, clear signs, the unbelievers say to the truth when it has come to them, 'This is manifest sorcery.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our clear revelations are recited unto them, those who disbelieve say of the Truth when it reacheth them: This is mere magic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever Our clear revelations are recited to them and the Truth is brought to them, those who deny the truth say, \"This is plain magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our manifest revelations are rehearsed Unto them those who disbelieve say of the truth when it hath come to them: this is magic manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our manifest signs are recited to them, the faithless say of the truth when it comes to them: ‘This is plain magic.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our Clear Signs are rehearsed to them, the Unbelievers say, of the Truth when it comes to them: \"This is evident sorcery!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our Clear Verses are recited to them, the disbelievers say of the truth (this Quran), when it reaches them: \"This is plain magic!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our clear verses are recited to them, the unbelievers say of the truth that came to them: 'This is clear sorcery'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Our revelations are recited to them, plain and clear, those who disbelieve say of the truth when it has come to them, “This is obviously magic.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Our verses are recited to them as clear evidences, those who disbelieve say of the truth when it has come to them, \"This is obvious magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:7] And when Our signs, the Qur’ān, are recited to them, namely, [to] the people of Mecca, being clear signs, manifest [signs] (bayyinātin is a circumstantial qualifier), those who disbelieve, from among them, say of the truth, that is, the Qur’ān, when it comes to them, ‘This is plain sorcery!’, clear and evident [sorcery].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when Our clear revelations) when the clear revelations of the Qur'an which explain the commands and prohibitions (are recited unto them) unto the disbelievers of Mecca, (those who disbelieve) the disbelievers of Mecca (say of the Truth) of the Qur'an (when it reacheth them) when the Prophet (pbuh) came to them: (This is mere magic) this is a manifest lie.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } هم كانوا من شدة غيهم وضلالهم عنا وعن توحيدنا { إِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا } الدالة على وحدة ذاتنا وكمال أسمائنا وصفاتنا مع كونها { بَيِّنَاتٍ } واضحات مبينات، لا يأتيها الباطل من بين يديها ولا من خلفها { قَالَ ٱلَّذِينَ كَفَرُواْ لِلْحَقِّ } الصريح المبين { لَمَّا جَآءَهُمْ } أي: حين جاءهم ليهديهم ويبين لهم طريق الحق وتوحيده { هَـٰذَا } المتلو { سِحْرٌ مُّبِينٌ } [الأحقاف: 7] ظاهر كونه سحراً باطلاً، وهذا التالي ساحر عظيم، إنما قالوا هكذا ونسبوا إلى ما نسبوا؛ لعجزهم عن إتيان مثله، مع إنهم من أرباب اللسن ووفور دواعيهم بالمعارضة معه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:30",
      "similarity": 0.744537197226176
    },
    {
      "verse": "10:76",
      "similarity": 0.707631178292651
    },
    {
      "verse": "27:13",
      "similarity": 0.6687701613084295
    },
    {
      "verse": "2:252",
      "similarity": 0.5397492423748897
    },
    {
      "verse": "10:77",
      "similarity": 0.5360495666313043
    }
  ]
}