{
  "chapter": "الأحقاف",
  "text": "ام يقولون افترىه قل ان افتريته فلا تملكون لى من الله شيـا هو اعلم بما تفيضون فيه كفى به شهيدۢا بينى وبينكم وهو الغفور الرحيم",
  "translations": [
    {
      "translation": "Or do they say, 'He has invented it'? Say: 'If I have invented it, then you possess no power to help me against Allah in any way. He knows best what you hold forth about. He is witness enough between me and you. He is the Ever-Forgiving, the Most Merciful.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they say: \"He has fabricated it?\" Tell them: \"If I have fabricated it, you have no power to save me from God. He knows what you are busy with concerning this. He is sufficient as witness between you and me; yet He is forgiving, ever-merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they claim that the Messenger himself has fabricated it? (If so), tell them: “If I have fabricated it, then you have no power to protect me from Allah's chastisement. He knows well the idle talk in which you indulge. He suffices as a witness between me and you. He is Most Forgiving, Most Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"(Muhammad) has invented it (Quran) by himself.\" Say, \"Had I invented it, you would not have been able to rescue me from God. He knows best what you say about it. He is our witness and He is All-forgiving and All-merciful\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! They dare say, “He has fabricated it”? Say (O dear Prophet Mohammed – peace and blessings be upon him), “If I have fabricated it, then (I know that) you have no power to support me against Allah; He well knows the matters you are involved in; He is Sufficient as a Witness between me and you; and He only is the Oft Forgiving, the Most Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or say they: \"He has fabricated it.\" Say: \"If I have fabricated it, still you have no power to support me against Allah. He knows best of what you say among yourselves concerning it! Sufficient is He as a witness between me and you! And He is the Oft--Forgiving, the Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! they say: He has forged it. Say: If I have forged it, you do not control anything for me from Allah; He knows best what you utter concerning it; He is enough as a witness between me and you, and He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say, 'He has forged it'? Say: 'If I have forged it, you have no power to help me against God. He knows very well what you are pressing upon; He suffices as a witness between me and you; He is the All-forgiving, the All-compassionate.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or say they: He hath invented it? Say (O Muhammad): If I have invented it, still ye have no power to support me against Allah. He is Best Aware of what ye say among yourselves concerning it. He sufficeth for a witness between me and you. And He is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they mean to say that the Messenger himself has fabricated it? Say [O Muhammad], \"If I have fabricated it myself, you will not be able to do anything to save me from God. He knows quite well what talk you indulge in. He is enough as a witness between me and you; and He is the Forgiving, the Merciful One.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say they: he hath fabricated it. Say thou: if I have fabricated it, then ye cannot avail me against Allah in aught. He is the Knower of that which ye utter thereof; He sufficeth as a witness between me and you; and He is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or they say, ‘He has fabricated it.’ Say, ‘Should I have fabricated it, you would not avail me anything against Allah. He best knows what you gossip concerning it. He suffices as a witness between me and you, and He is the All-forgiving, the All-merciful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say, \"He has forged it\"? Say: \"Had I forged it, then can ye obtain no single (blessing) for me from Allah. He knows best of that whereof ye talk (so glibly)! Enough is He for a witness between me and you! And he is Oft-Forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or say they: \"He (Muhammad SAW) has fabricated it.\" Say: \"If I have fabricated it, still you have no power to support me against Allah. He knows best of what you say among yourselves concerning it (i.e. this Quran)! Sufficient is He for a witness between me and you! And He is the Oft-Forgiving, the Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, do they say: 'He has forged it' Say: 'If I have forged it, then you have no power to help me against Allah, He knows what you say. It is sufficient that Heis the Witness between me and you. He is the Forgiving, the Most Merciful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say, “He invented it himself”? Say, “If I invented it myself, there is nothing you can do to protect me from God. He knows well what you are engaged in. He is sufficient witness between me and you. He is the Forgiver, the Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they say, \"He has invented it?\" Say, \"If I have invented it, you will not possess for me [the power of protection] from Allah at all. He is most knowing of that in which you are involved. Sufficient is He as Witness between me and you, and He is the Forgiving the Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:8] Or (am has the significance of bal, ‘nay, but …’ and the [rhetorical interrogative] hamza of denial) do they say, ‘He has invented it?’, that is, the Qur’ān. Say: ‘If I have invented it, hypothetically [speaking], still you would have no power to avail me against God, that is to say, against His chastisement, in any way, in other words, you would not be able to ward it off from me if God chooses to chastise me. He knows best what you delve into [of gossip] concerning it, what you say about the Qur’ān. He, exalted be He, suffices as a witness between me and you. And He is the Forgiving, to the one who repents, the Merciful’, to him, and so He does not hasten to punish you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَمْ يَقُولُونَ افْتَرَاهُ قُلْ إِنِ افْتَرَيْتُهُ فَلَا تَمْلِكُونَ لِي مِنَ اللَّهِ شَيْئًا هُوَ أَعْلَمُ بِمَا تُفِيضُونَ فِيهِ كَفَى بِهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ وَهُوَ الْغَفُورُ الرَّحِيمُ (8(إضراب انتقال إلى نوع آخر من ضَلال أقوالهم . وسلك في الانتقال مسلك الإضراب دون أن يكون بالعطف بالواو لأن الاضراب يفيد أن الغرض الذي سينتقل إليه له مزيد اتصال بما قبله ، وأن المعنى : دَعْ قولهم : { هذا سحر مبين } \\[ الأحقاف : 7 \\] ، واستمع لما هو أعجب وهو قولهم : { افتَراه } ، أي افترى نسبته إلى الله ولم يرد به السحر .والاستفهام الذي يقدر بعد { أم } للإنكار على مقالتهم . والنفي الذي يقتضيه الاستفهام الانكاري يتسلط على سبب الانكار ، أي كون القرآن مفترى وليس متسلطاً على نسبة القول إليهم لأنه صادر منهم وإنما المنفي الافتراء المزعوم .والضمير المنصوب في { افتراه } عائد إلى الحق في قوله : { قال الذين كفروا للحق } \\[ الأحقاف : 7 \\] ، أو إلى القرآن لعلمه من المقام ، أي افترى القرآن فزعم أنه وحي من عند الله .وقد أمِر الرسول صلى الله عليه وسلم بجواب مقالتهم بما يقلعها من جذرها ، فكان قوله تعالى : { قل } جملة جارية مجرى جواب المقاولة لوقوعها في مقابلة حكاية قولهم . وقد تقدم ذلك في قوله : { قالوا أتجعل فيها من يفسد فيها } في أوائل سورة البقرة ( 30 ( .وجعل الافتراء مفروضاً بحرف إن } الذي شأنه أن يكون شرطه نادر الوقوع إشارة إلى أنه مفروض في مقام مشتمل على دلائل تقلع الشرط من أصله .وانتصب { شيئاً } على المفعولية لفعل { تملكون } ، أي شيئاً يملك ، أي يستطاع ، والمراد : شيء من الدّفع فلا تقدرون على أن تردوا عني شيئاً يَرد علي من الله . وتقدم معنى ( لا أملك شيئاً ( عند قوله تعالى : { قل فمن يملك من الله شيئاً إن أراد أن يهلك المسيح ابن مريم } في سورة العقود ( 17 ( .والتقدير : إن افتريته عاقبني الله معاقبة لا تملكون ردها . فقوله : فلا تملكون لي من الله شيئاً } دليل على الجواب المقدر في الكلام بطريق الالتزام ، لأن معنى { لا تملكون لي } لا تقدرون على دفع ضر الله عني ، فاقتضى أن المعنى : إن افتريته عاقبني الله ولا تستطيعون دفع عقابه .واعلم أن الشائع في استعمال ( لا أملك لك شيئاً ( ونحوه أن يسند فعل الملك إلى الذي هو مظنة للدفع عن مدخول اللام المتعلقة بفعل الملك كقوله تعالى : { قل لا أملك لنفسي نفعاً ولا ضراً } \\[ الأعراف : 188 \\] وقوله { وما أملك لك من الله من شيء } \\[ الممتحنة : 4 \\] ، أو أن يسند إلى عامّ نحو { قل فمن يملك من الله شيئاً إن أراد أن يهلك المسيح ابن مريم } ، فإسناد فعل الملك في هذه الآية إلى المخاطبين وهم أعداء النبي صلى الله عليه وسلم وليسوا بمظنة أن يدفعوا عنه ، لأنهم نصبوا أنفسهم في منصب الحُكم على النبي صلى الله عليه وسلم فجزموا بأنه افترى القرآن فحالهم حال من يزعم أنه يستطيع أن يرد مراد الله تعالى على طريقة التهكم .واعلم أن وجه الملازمة بين الشرط وجوابه في قوله : { إن افتريته فلا تملكون لي من الله شيئاً } أن الله لا يقرّ أحداً على أن يبلِّغ إلى الناس شيئاً عن الله لَمْ يأمره بتبليغه ، وقد دلّ القرآن على هذا في قوله تعالى : { ولو تَقَوَّلَ علينا بعض الأقاويل لأخذنا منه باليمين ثم لقطعنا منه الوتين فما منكم من أحد عنه حاجزين } \\[ الحاقة : 44 47 \\] . ولعل حكمة ذلك أن التقول على الله يفضي إلى فساد عظيم يختل به نظام الخلق ، والله يَغار على مخلوقاته وليس ذلك كغيره من المعاصي التي تجلبها المظالمُ والعبث في الأرض لأن ذلك إقدام على ما هو معلوم الفساد لا يخفى على الناس فهم يدفعونه بما يستطيعون من حول وقوة ، أو حيلة ومصانعة . وأما التقول على الله فيوقع الناس في حيرة بماذَا يتلقَّوْنه فلذلك لا يُقره الله ويزيله .وجملة { هم أعلم بما تفيضون فيه } بدل اشتمال من جملة { فلا تملكون لي من الله شيئاً } لأن جملة { فلا تملكون لي } تشتمل على معنى أن الله لا يرضى أن يفتري عليه أحد ، وذلك يقتضي أنه أعلم منهم بحال من يُخير عن الله بأنه أرسله وما يبلغه عن الله . وذلك هو ما يخوضون فيه من الطعن والقدح والوصف بالسحر أو بالافتراء أو بالجنون ، فمَا صْدَقُ ( ما ( الموصولة القرآن الذي دلّ عليه الضمير الظاهر في { افتراه } أو الرسول صلى الله عليه وسلم الذي دل عليه الضمير المستتر في { افتراه } أو مجموع أحوال الرسول صلى الله عليه وسلم التي دل عليها مختلف خوضهم . ومتعلق اسم التفضيل محذوف ، أي هو أعلم منكم . والإفاضة في الحديث : الخوض فيه والإكثار منه وهي منقولة من : فاض الماء؛ إذا سال . ومنه حديث مستفيض مشتهر شائع ، والمعنى : هو أعلم بحال ما تفيضون فيه .وجملة { كفى به شهيداً بيني وبينكم } بدل اشتمال من جملة { هو أعلم بما تفيضون فيه } لأن الاخبار بكونه أعلم منهم بكنه ما يفيضون فيه يشتمل على معنى تفويض الحكم بينه وبينهم إلى الله تعالى . وهذا تهديد لهم وتحذير من الخوض الباطل ووعيد .والشهيد : الشاهد ، أي المخبر بالواقع . والمراد به هنا الحَاكم بما يعلمه من حالنا كما دلّ عليه قوله : { بيني وبينكم } لأن الحكم يكون بين خصمين ولا تكون الشهادة بينهما بل لأحدهما قال تعالى : { وجئنا بك على هؤلاء شهيدا } \\[ النساء : 41 \\] .وإجراء وصفي { الغفور الرحيم } عليه تعالى اقتضاه ما تضمنه قوله : { كفى به شهيداً بيني وبينكم } من التهديد والوعيد ، وهو تعريض بطلب الإقلاع عما هم فيه من الخوض بالباطل .\n\n",
      "translations": [
        {
          "translation": "(Or say they) indeed they say: (He hath invented it) Muhammad has invented the Qur'an? (Say) to them Muhammad (If I have invented it) if I have invented the Qur'an as you claim, (still ye have no power to support me against Allah) against Allah's torment. (He is best aware of what ye say among yourselves concerning it) He is best aware of the lies in which you engage concerning the Qur'an. (He sufficeth) Allah suffices (for a witness between me and you) that I am Allah's Messenger and this Qur'an is His speech. (And He is the Forgiving) He forgives whoever repents amongst you, (the Merciful) towards anyone who dies repentant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمْ يَقُولُونَ ٱفْتَرَاهُ } أي: بل انصرفوا عن سبته إلى السحر إلى أفحش من ذلك\n وهو الافتراء فيقولون: اختلفه هذا المدعي من تلقاء نفسه ونسبه إلى ربه تغريراً وترويجاً { قُلْ } لهم أكمل الرسل بعدما نسبوا كتابك إلى الفرية كلاماً ومفصحاً لهم عن حقيقة الأمر وحقيته لو تأملوا فيه: { إِنِ ٱفْتَرَيْتُهُ } واختلقته من عندي ونسبته إلى الله زوراً وبهتاناً\n فيأخذني العزيز بإثم الافتراء ألبتة\n وإن أخذني { فَلاَ تَمْلِكُونَ } ولا تدفعون { لِي مِنَ ٱللَّهِ شَيْئاً } حين أخذني وانتقم\n وبالجملة: { هُوَ } سبحانه { أَعْلَمُ } بعلمه الحضوري { بِمَا تُفِيضُونَ } وتخوضون { فِيهِ } أي: في كلامه بما يليق به وبشأنه سبحانه من نسبته إلى السحر والافتراء وتكذيبه بأنواع وجوه المراء { كَفَىٰ بِهِ } أي: كفى الله { شَهِيداً بَيْنِي وَبَيْنَكُمْ } أي:بيننا يجازينا على مقتضى علمه وخبرته بي وبكم { وَهُوَ ٱلْغَفُورُ } المبالغ في الستر والعفو لمن استغفر له { ٱلرَّحِيمُ } [الأحقاف: 8] لمن تاب ورجع نحوه نادماً عن ما صدر عنه\n يقبل توبته ويمحو زلته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أم يقولون افتراه } إضراب وانتقال من حكاية شناعتهم السابقة - وهي تسميتهم الآيات سحراً\n إلى حكاية ما أشنع منها\n وهو كون الرسول صلى الله عليه وسلم { افتراه } أي: اختلقه\n وأضافه إلى الله كذباً\n والضمير للحق\n والمراد به الآيات\n { قل إِن افتريته فلا تملكون لي من الله شيئاً } أي: إن افتريته على سبيل الفرض لعاجلني الله بعقوبة الافتراء\n فلا تقدرون على كفه من معاجلتي\n ولا تملكون لي شيئاً مِن دفعه\n فكيف أفتريه وأتعرّض لعقابه الذي لا مناص منه؟! { هو أعلم بما تُفيضون فيه } من القدح في وحي الله تعالى والطعن في آياته\n وتسميته سحراً تارة وفرية أخرى\n { كفى به شهيداً بيني وبينكم } حيث يشهد لي بالصدق والبلاغ\n وعليكم بالكذب والجحود\n وهو وعيد بجزاء إفاضتهم\n { وهو الغفورُ الرحيم } لمَن تاب وآمن\n وهو وعد لمَن آمن بالمغفرة والرحمة\n وترغيب في الإسلام\n الإشارة: رمي أهل الخصوصية بالسحر عادةٌ مستمرة\n وسُنَّة ماضية\n ولقد سمعنا هذا فينا وفي أشياخنا مراراً\n فيقول أهل الخصوصية: إن افترينا على الله كذباً عاجلنا بالعقوبة\n { فلا تملكون لنا من الله شيئاً\n\n\n } الآية\n ثم أمر نبيه بالجواب عما رموه به\n فقال: { قُلْ مَا كُنتُ بِدْعاً مِّنَ ٱلرُّسُلِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:199",
      "similarity": 0.6886113421829336
    },
    {
      "verse": "24:14",
      "similarity": 0.6340921807831127
    },
    {
      "verse": "7:50",
      "similarity": 0.5888348867367956
    },
    {
      "verse": "2:198",
      "similarity": 0.5163131154315277
    },
    {
      "verse": "4:166",
      "similarity": 0.34624289775277023
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/046008.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/046008.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/46:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}