{
  "chapter": "الأحقاف",
  "text": "قل ما كنت بدعا من الرسل وما ادرى ما يفعل بى ولا بكم ان اتبع الا ما يوحى الى وما انا۠ الا نذير مبين",
  "translations": [
    {
      "translation": "Say: 'I am nothing new among the Messengers. I have no idea what will be done with me or you. I only follow what has been revealed to me. I am only a clear warner.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I am not a new Messenger to come, nor do I know what is to be done to me or you. I only follow what is revealed to me. My duty is only to warn you clearly.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: “I am not the first of the Messengers; and I do not know what shall be done with me or with you. I follow only what is revealed to me, and I am nothing but a plain warner.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I am not the first Messenger. I do not know what will be done to me or to you. I follow only what has been revealed to me and my duty is only to give clear warning\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I am not something new* among the Noble Messengers, nor do I know (on my own) what will happen to me** or with you; I only follow that which is divinely revealed to me, and I am purely a Herald of clear warning. (* I am like the earlier ones. ** My knowledge comes due to divine revelations.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I am not a new thing among the Messengers, nor do I know what will be done with me or you. I only follow that which is revealed to me, and I am but a plain warner.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: I am not the first of the apostles, and I do not know what will be done with me or with you: I do not follow anything but that which is revealed to me, and I am nothing but a plain warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I am not an innovation among the Messengers, and I know not what shall be done with me or with you. I only follow what is revealed to me; I am only a clear warner.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: I am no new thing among the messengers (of Allah), nor know I what will be done with me or with you. I do but follow that which is inspired in me, and I am but a plain warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I am not the first of God's messengers, and I do not know what will be done with me or with you: I do not follow anything but what is revealed to me, and I am merely a plain warner.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: I am not an innovator among the apostles, nor I know whatsoever shall be done with me or with you; I only follow that which is revealed Unto me, and am but a warner manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘I am not a novelty among the apostles, nor do I know what will be done with me, or with you. I just follow whatever is revealed to me, and I am just a manifest warner.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I am no bringer of new-fangled doctrine among the messengers, nor do I know what will be done with me or with you. I follow but that which is revealed to me by inspiration; I am but a Warner open and clear.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW):\"I am not a new thing among the Messengers (of Allah) (i.e. I am not the first Messenger) nor do I know what will be done with me or with you. I only follow that which is revealed to me, and I am but a plain warner.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I am not an innovation among the Messengers; nor know what will be done with me or you. I follow only what is revealed to me; I am only a clearwarner'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I am not different from the other messengers; and I do not know what will be done with me, or with you. I only follow what is inspired in me, and I am only a clear warner.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I am not something original among the messengers, nor do I know what will be done with me or with you. I only follow that which is revealed to me, and I am not but a clear warner.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[46:9] Say: ‘I am not a novelty, unprecedented, among the messengers, that is to say, [I am not] the first to be sent [by God as His Messenger]. Already many of them have come before me, so how can you deny me? Nor do I know what will be done with me or with you, in this world: will I be made to leave my [native] land, or will I be slain as was done with [some] prophets before me, or will you stone me to death, or will the earth be made to swallow you as [it did] deniers before you? I only follow what is revealed to me, that is, the Qur’ān, and I do not invent anything myself. And I am only a plain warner’, one whose warning is   plain.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (I am no new thing among the messengers (of Allah)) I am not the first human being to be sent as Messenger, there were many messengers before me, (nor know I what will be done with me or with you) in relation to hardship, comfort and well-being; it is also said that this verse was revealed about some of the Companions of the Prophet (pbuh) who asked him about when to leave Mecca in order to escape from the persecution of the disbelievers. So the Prophet (pbuh) said: \"I do not know what will be done with me or with you; nor whether we should migrate from Mecca or not\". (I do but follow) act upon (that which is inspired in me) that which I am commanded in the Qur'an, (and I am but a plain warner) a warning messenger who addresses you in a language that you understand.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قُلْ مَا كُنتُ بِدْعاً مِّنَ ٱلرُّسُلِ } معناه ما كُنْتَ أَولَهُم\n\n\n\n\nوقوله تعالى: { وَمَآ أَدْرِي مَا يُفْعَلُ بِي وَلاَ بِكُمْ } معناه في الدُّنيا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم يا أكمل الرسل بعدما اقترحوا عليك من الآيات التي تهواها نفوسهم ليلزموك ويعجزوك: { مَا كُنتُ بِدْعاً } رسولاً بديعا { مِّنَ } بين { ٱلرُّسُلِ } مبتدعاً أمراً غريباً مدعياً الإتيان، بل { وَ } الله { مَآ أَدْرِي } وأعلم بحال نفسي { مَا يُفْعَلُ بِي } وكيف يصنع معي { وَلاَ بِكُمْ } أي: وكيف بما يصنع بكم، بل أن { أَتَّبِعُ } أي: ما أتبع { إِلاَّ مَا يُوحَىٰ إِلَيَّ } من قبل ربي ويطلعني عليه { وَ } بالجملة: { مَآ أَنَاْ إِلاَّ نَذِيرٌ } من قبل احق { مُّبِينٌ } [الأحقاف: 9] مبين موضح مظهر لكم بإذنه ما أوحى إلى من وحيه، وما لي إلا التبليغ والإنذار، والتوفيق من الله العليم الحكيم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { قل ما كنتُ بِدعاً } أي: بديعاً، كخف وخفيف، ونصب ونصيب، فالبدع والبديع من الأشياء: ما لم يتقدم مثله، أي: لستُ بأول مرسل فتُنكر نبوتي، بل تقدمت الرسل قبلي، واقترِحتْ عليهم المعجزات، فلم يقدروا على الإتيان بشيء إلا ما أظهره الله على أيديهم، في الوقت الذي يُريد\n قيل: كانت قريش تقترح على رسول الله صلى الله عليه وسلم آيات تظهر لهم، ويسألونه عن الغيبيات، عناداً ومكابرة، فأُمر صلى الله عليه وسلم بأن يقول لهم: ما كنت بِدعاً من الرسل، قادراً ما لم يقدروا عليه، حتى آتيكم بكل ما تقترحونه، وأخبركم بكل ما تسألون عنه من الغيوب، فإنَّ مَن قبلي من الرسل عليم السلام ما كانوا يأتون إلا بما آتاهم الله تعالى من الآيات، ولا يُخبرون إلا بما أوحي إليهم، { وما أدري ما يُفعل بي ولا بكم } أي: لا أدري ما يُصيبنا فيما يستقبل من الزمان من أفعاله تعالى، وماذا يبرز لنا من قضاياه\n وعن الحسن: ما أدري ما يصير إليه أمري وأمركم في الدنيا\n وعن ابن عباس رضي الله عنه: ما يُفعل بي ولا بكم في الآخرة\n وقال: إنه منسوخ بقوله:\n\n[الفتح: 2] قال شيخ شيوخنا الفاسي: وهو بعيد، ولا يصح النسخ لأنه لا يكون في الأخبار، ولأنه لم يزل يعلم أن المؤمن في الجنة، والكافر في النار، من أول ما بعثه الله، لكن محمل قول ابن عباس وغيره على أنه لم تكشف له الخاتمة، فقال: لا أدري، وأما مَن وافى على الإيمان، فقد أعلم بنجاته من أول الرسالة، وإلا فكان للكفار أن يقولوا: وكيف تدعونا إلى ما لا تدري له عاقبة؟ قاله ابن عطية\n هـ\n وقال أبو السعود: والأوفق بمان ذكر من سبب النزول: أن \" ما \" عبارة عما عِلْمُه ليس من وظائف النبوة، من الحوادث الواقعات الدنيوية، دون ما سيقع في الآخرة، فإنَّ العلم بذلك من وظائف النبوة، وقد ورد به الوحي، الناطق بتفاصيل الفعل بالجانبين\n هذا، وقد رُوي عن الكلبي: \" أن أصحاب النبي صلى الله عليه وسلم قالوا له صلى الله عليه وسلم وقد ضجروا من إذاية المشركين: متى نكون على هذا؟ فقال: { ما أدري ما يُفعل بي ولا بكم } أأترَكُ بمكة أو أومر بالخروج إلى أرض ذات نخيل وشجر، قد رفعتْ إليّ ورأيتها\n هـ\n وسأتي في الإشارة تحقيق المسألة إن شاء الله تعالى\n ثم قال: { إِن أتبعُ إِلا ما يُوحَى إِليَّ } أي: ما أفعل إلا الاتباع، على معنى: قصر أفعاله صلى الله عليه وسلم على اتباع الوحي، لا قصر اتباعه على الوحي، كما هو المتبادر، وهو جواب عن اقتراحهم الإخبار بالغيوب، أو عن استعجال المسلمين أن يتخلّصوا من إذاية المشركين، والأول هو الأوفق بقوله: { وما أنا إِلا نذير مبين } أُنذركم عقاب الله تعالى حسبنا يُوحى إليّ من الإنذار بالمعجزات الباهرة\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:117",
      "similarity": 0.8162048261149517
    },
    {
      "verse": "6:101",
      "similarity": 0.7538320598793785
    },
    {
      "verse": "57:27",
      "similarity": 0.36865183260432344
    },
    {
      "verse": "42:52",
      "similarity": 0.23298243503448404
    },
    {
      "verse": "101:10",
      "similarity": 0.19516339899921092
    }
  ]
}