{
  "chapter": "محمد",
  "text": "افلم يسيروا۟ فى الارض فينظروا۟ كيف كان عقبة الذين من قبلهم دمر الله عليهم وللكفرين امثلها",
  "translations": [
    {
      "translation": "Have they not travelled about the earth and seen the final fate of those before them? Allah destroyed them utterly. And those who are kafir will suffer the same fate.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not journeyed in the land and seen the fate of those before them? Destroyed they were utterly by God; and a similar (fate) awaits the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not journeyed through the land to see the end of those who went before them? Allah utterly destroyed them. These unbelievers are doomed to the same end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled through the land and seen the terrible end of those who lived before them? God brought upon them utter destruction and the disbelievers will also faced similar perdition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So did they not travel in the land to see what sort of fate befell those who preceded them? Allah poured ruin upon them; and for the disbelievers are several like it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not traveled through the earth and seen what happened in the end to those before them Allah destroyed them completely, and a similar (awaits) the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not then journeyed in the land and seen how was the end of those before them: Allah brought down destruction upon them, and the unbelievers shall have the like of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, have they not journeyed in the land and beheld how was the end of those before them? God destroyed them; the unbelievers shall have the likes thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled in the land to see the nature of the consequence for those who were before them? Allah wiped them out. And for the disbelievers there will be the like thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled the earth and seen how those before them met their end? God destroyed them utterly: a similar fate awaits those who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled then on the earth so that they might see how hath been the end of those before them! Allah annihilated them. And for the infidels theirs shall be the like fate therefore.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled through the land so that they may observe how was the fate of those who were before them? Allah destroyed them, and a similar [fate] awaits these faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not travel through the earth, and see what was the End of those before them (who did evil)? Allah brought utter destruction on them, and similar (fates await) those who reject Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not travelled through the earth, and seen what was the end of those before them? Allah destroyed them completely and a similar (fate awaits) the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they never journeyed through the land and seen what was the end of those who had gone before them? Allah destroyed them! Likewise it is for theunbelievers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not journeyed through the earth and seen the consequences for those before them? God poured destruction upon them, and for the unbelievers is something comparable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not traveled through the land and seen how was the end of those before them? Allah destroyed [everything] over them, and for the disbelievers is something comparable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:10] Have they not travelled in the land to see the nature of the consequence for those who were before them? God destroyed them — He destroyed them, their children and their possessions; and [a fate] the like thereof will be for the disbelievers, that is to say, the like of the fate of those before them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Have they) i.e. the disbelievers of Mecca (not travelled in the land to see) to reflect upon (the nature of the consequence for) the requital of (those who were before them? Allah wiped them out) Allah destroyed them. (And for the disbelievers) of Mecca (there will be the like thereof) the like of that torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ليصبروا { كَيْفَ كَانَ عَاقِبَةُ } المجرمين { ٱلَّذِينَ } مضوا { مِن قَبْلِهِمْ } مع أنهم ذوو ثروة كبيرة\n ورئاسة عظيمة\n ووجاهة كاملة\n كيف { دَمَّرَ ٱللَّهُ عَلَيْهِمْ } واستأصلهم بحيث لم يبق منهم على وجه الأرض أحد { وَلِلْكَافِرِينَ أَمْثَالُهَا } [محمد: 10] أي: سيؤول ويعود عاقبة هؤلاء الكفرة المعاندين معك يا أكمل الرسل إليها وإلى أمثالها\n بل أفظع وأشد منها ألبتة\n\n\nكل { ذَلِكَ بِأَنَّ ٱللَّهَ } المطلع على ضمائر عباده { مَوْلَى ٱلَّذِينَ آمَنُواْ } بوحدة الحق وتحققوا في مقر توحديه\n لذلك يواليهم وينصرهم على أعاديهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { أفلم يسيروا } أي: أَقعدوا فلم يسيروا { في الأرض } يعني كفار مكة، { فينظروا كيف كان عاقبةُ الذين من قبلهم } من الأمم المكذبة؟ فإنّ آثار ديارهم تنبئ عن أخبارهم، فقد { دَمَّر اللَّهُ عليهم } فالجملة: استئناف مبني على سؤال، كأنه قيل: كيف كان عاقبتهم؟ فقيل: استأصل الله عليهم ما اختص بهم من أنفسهم وأهليهم وأموالهم، يُقال: دمّره أهلَكه، ودمّر عليه: أهلك عليه ما يختص به، قاله أبو السعود\n وفي الصحاح: الدمار: الهلاك، دمّره تدميراً، ودمَّر عليه، بمعنى\n هـ\n فظاهرة: أن معناهما واحد، وفسره في الأساس بالهلاك المستأصل، وقال الطيبي: في دمّر عليهم تضمينُ معنى أطبقَ، فعُدي بعلى، ولذلك استأصل\n هـ\n { وللكافرين } أي: ولهؤلاء الكافرين السائرين بسيرَتِهم { أمثالُها } أي: أمثال تلك الهلكة المفهومة من التدمير، أو أمثال عواقِبهمْ أو عُقوبَاتهم، لكن لا على أنّ لهؤلاء أمثال ما لأولئك وأضعافَه بل مثله، وإنما جمع باعتبار مماثلته لعواقب متعددة، حسبما تعدّد الأمم المعذّبة، ويجوز أن يكون عذابُهم أشدّ من عذاب الأولين فقد قُتلوا وأُسروا بأيدي مَن كانوا يستخفونهم ويستضعفونهم، والقتل بيد المثل أشد ألماً من الهلاك بسبب عام، وقيل: دمَّر اللّهُ عليهم في الدنيا، ولهم في الآخرة أمثالُها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:51",
      "similarity": 0.7310982004735199
    },
    {
      "verse": "26:172",
      "similarity": 0.7011453982858145
    },
    {
      "verse": "37:136",
      "similarity": 0.7011453982858145
    },
    {
      "verse": "25:36",
      "similarity": 0.6674922738835345
    },
    {
      "verse": "46:25",
      "similarity": 0.5770460415039814
    }
  ]
}