{
  "chapter": "محمد",
  "text": "فهل ينظرون الا الساعة ان تاتيهم بغتة فقد جاء اشراطها فانى لهم اذا جاءتهم ذكرىهم",
  "translations": [
    {
      "translation": "What are they awaiting but for the Hour to come upon them suddenly? Its Signs have already come. What good will their Reminder be to them when it does arrive?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they wait for any thing but the Hour (of change), that it may come upon them suddenly? Its signs have already appeared. How then will they be warned when it has come upon them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting, then, for anything else than the Last Hour to suddenly come upon them? Already some of its tokens have come. But when it does actually come upon them, where will any time be left for them to take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting for the Hour of Doom to suddenly approach them? Its signs have already appeared. How will they then come to their senses when the Hour itself will approach them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So what are they waiting for, except that the Last Day suddenly come upon them? For its signs have already appeared; so when it does come, of what use is their realising it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they then await except that the Hour should come upon them suddenly But already there have come (some of) its portents; and when it (actually) is on them, how can they benefit then by their reminder\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they then wait for aught but the hour that it should come to them all of a sudden? Now indeed the tokens of it have (already) come, but how shall they have their reminder when it comes on them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they looking for aught but the Hour, that it shall come upon them suddenly? Already its tokens have come; so, when it has come to them, how shall they have their Reminder?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Await they aught save the Hour, that it should come upon them unawares? And the beginnings thereof have already come. But how, when it hath come upon them, can they take their warning?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they awaiting the Hour of Doom to come upon them suddenly? Its signs have already come. But of what avail will their admonition be to them when it has actually come upon them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Await they but the Hour, that it should come upon them on a sudden? Tokens thereof are already come, so how shall it be with them when there cometh Unto them their admonition!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they await anything except that the Hour should overtake them suddenly? Its portents have already come. When it overtakes them of what avail will the admonitions they were given?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they then only wait for the Hour,- that it should come on them of a sudden? But already have come some tokens thereof, and when it (actually) is on them, how can they benefit then by their admonition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they then await (anything) other than the Hour, that it should come upon them suddenly? But some of its portents (indications and signs) have already come, and when it (actually) is on them, how can they benefit then by their reminder?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they looking except for the Hour to overtake them suddenly? Its signs have come. But how will they be reminded when it has come to them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they just waiting until the Hour comes to them suddenly? Its tokens have already come. But how will they be reminded when it has come to them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then do they await except that the Hour should come upon them unexpectedly? But already there have come [some of] its indications. Then what good to them, when it has come, will be their remembrance?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:18] Do they, then, await, they do not await, namely, the disbelievers of Mecca, anything except that the Hour should come upon them (an ta’tiyahum is an inclusive substitution for al-sā‘ata, ‘the Hour’; in other words, it cannot be other than that it will come upon them […]) suddenly? For already its portents, the signs thereof, have come, among which are the sending of the Prophet (s), the splitting of the Moon [Q. 54:1] and the Smoke [Q. 44:10]. So, when it, the Hour, has come upon them, for what [benefit] will their reminder be?, their remembering; in other words, it will be of no benefit to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَهَلْ يَنْظُرُونَ إِلَّا السَّاعَةَ أَنْ تَأْتِيَهُمْ بَغْتَةً فَقَدْ جَاءَ أَشْرَاطُهَا فَأَنَّى لَهُمْ إِذَا جَاءَتْهُمْ ذِكْرَاهُمْ (18({ }تفريع على ما مضى من وصف أحوال الكافرين من قوله : { أفلم يسيروا في الأرض إلى قوله : واتبعوا أهواءهم >تَقُوَاهُمْ \\* فَهَلْ يَنظُرُونَ إِلاَّ الساعة أَن تَأْتِيَهُمْ } \\[ محمد : 10 16 \\] الشاملة لأحوال الفريقين ففرع عليها أن كلا الفريقين ينتظرون حلول الساعة لينالوا جزاءهم على سوء كفرهم فضمير ينظرون مراد به الكافرون لأن الكلام تهديد ووعيد ، ولأن المؤمنين ينتظرون أموراً أخر مثل النصر والشهادة ، قال تعالى : { قل هل تَربَّصُون بنا إلا إحدى الحُسْنَيْينِ } \\[ التوبة : 52 \\] الآية . والنظر هنا بمعنى الانتظار كما في قوله تعالى : { هل ينظرون إلا أن تأتيهم الملائكة أو يأتي ربك } \\[ الأنعام : 158 \\] الآية .والاستفهام إنكار مشوب بتهكم ، وهو إنكار وتهكم على غائبين ، موجه إلى الرسول صلى الله عليه وسلم أي لا تحسب تأخير مؤاخذتهم إفلاتاً من العقاب ، فإنه مُرجَوْن إلى الساعة .وهذا الاستفهام الإنكاري ناظر إلى قوله آنفاً { والذين كفروا يتمتعون ويأكلون كما تأكل الأنعام والنار مثوى لهم } \\[ محمد : 12 \\] .والقصر الذي أفاده الاستثناء قصر ادعائي ، نُزل انتظارهم ما يأملونه من المرغوبات في الدنيا منزلة العدم لضآلة أمره بعد أن نُزلوا منزلة من ينتظرون فيما ينتظرون الساعة لأنهم لتحقق حلوله عليهم جديرون بأن يكونوا من منتظريها .و { أن تأتيهم } بدل اشتمال من الساعة . و { بغتة } حال من الساعة قال تعالى : { لا تأتيكم إلا بغتة } \\[ الأعراف : 187 \\] . والبغتة : الفجأة ، وهو مصدر بمعنى : المرة ، والمراد به هنا الوصف ، أي مباغتة لهم .ومعنى الكلام : أن الساعة موعدهم وأن الساعة قريبة منهم ، فحالهم كحال من ينتظر شيئاً فإنما يكون الانتظار إذا اقترب موعد الشيء ، هذه الاستعارة تهكمية .والفاء من قوله : { فقد جاء أشراطها } فاء الفصيحة كالتي في قول عباس بن الأحنف :قالوا خراسانُ أقصى ما يراد بنا ... ثم القفول فقد جئنا خراساناوهذه الفصيحة تفيد معنى تعليل قرب مؤاخذتهم .والأشراط : جمع شَرَط بفتحتين ، وهو : العلامة والأمارة على وجود شيء أو على وصفه . وعلامات الساعة هي علامات كونها قريبة . وهذا القرب يتصور بصورتين :إحداهما أن وقت الساعة قريب قرباً نسبياً بالنسبة إلى طول مدة هذا العالم ومن عليه من الخلق .والثانية : أن ابتداء مشاهدة أحوال الساعة يحصل لكل أحد بموته فإن روحه إذا خلصت عن جسده شاهدت مصيرها مشاهدة إجمالية وبه فسر حديث أبي هريرة مرفوعاً « القبر روضة من رياض الجنة أو حفر من حفر النار » رواه الترمذي . وهو ضعيف ويفسره حديث ابن عمر مرفوعاً « إذا مات الميت عرض عليه مقعده بالغداة والعشي فإن كان من أهل الجنة فمن أهل الجنة وإن كان من أهل النار فمن أهل النار ثم يقال : هذا مقعدك حتى يبعثك الله يوم القيامة » ونهاية حياة المرء قريبة وإن طال العمر .والأشراط بالنسبة للصورة الأولى : الحوادث التي أخبر النبي صلى الله عليه وسلم أنها تقع بين يدي الساعة ، وأولها بعثته لأنه آخر الرسل وشريعته آخر الشرائع ثم ما يكون بعد ذلك ، وبالنسبة للصورة الثانية أشراطها الأمراض والشيخوخة .{ أَشْرَاطُهَا فأنى لَهُمْ إِذَا جَآءَتْهُمْ } .تفريع على { فقد جاء أشراطها } . و { أنّى } اسم يدل على الحالة ، ويضمّن معنى الاستفهام كثيراً وهو هنا استفهام إنكاري ، أي كيف يحصل لهم الذكرى إذا جاءتهم الساعة ، والمقصود : إنكار الانتفاع بالذكرى حينئذٍ .و { أنَّى } مبتدأ ثان مقدم لأن الاستفهام له الصدارة . و { ذكراهم } مبتدأ أول و { لهم } خبر عن { أنّى } ، وهذا التركيب مثل قوله تعالى : { أنّى لهم الذكرى } في سورة الدخان ( 13 ( ، وضمير جاءتهم } عائد إلى { الساعة } .\n\n",
      "translations": [
        {
          "translation": "(Await they aught) do the disbelievers of Mecca, if they disbelieve in you, await anything (save the Hour, that it should come upon them unawares) by surprise? (And the beginnings thereof) the signs of the coming of the Hour: the splitting of the moon and the coming of the Prophet (pbuh) with the Qur'an which are of its signs (have already come. But how, when it hath come upon them) i.e. the Hour, (can they take their warning) by repenting?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَقَدْ جَآءَ أَشْرَاطُهَا } قال: أعلامُها\n ويقال: أولُها\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Indeed, the signs of its coming have come\" - He says, {its coming} is its signs.\n It is said: its first",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { فَهَلْ يَنظُرُونَ } وماينتظرون في عموم أوقاتهم وحالاتهم { إِلاَّ ٱلسَّاعَةَ } الموعودة أن { تَأْتِيَهُمْ بَغْتَةً } فجأة\n وكيف لا تأتيهم الساعة { فَقَدْ جَآءَ } وظهر { أَشْرَاطُهَا } أي: بعض علاماتها وأماراتها التي من جملتها: بعثة الرسول الحضرة الختمية المحمدية\n إذ ظهوره متمماً لمكارم الأخلاق\n ومكملاً لأمر التشريع والإرشاد من دلائل انقضاء نشأة الكثرة\n وطلوع شمس الوحدة الذاتية من آفاق ذرائر الكائنات\n وكيف ينتظرون الساعة ولا يهيئون أسبابها قبل حلولها\n وإن تأتهم بغتة { فَأَنَّىٰ لَهُمْ إِذَا جَآءَتْهُمْ ذِكْرَٰهُمْ } [محمد: 18] أي: كيف يفيدهم التذكر والاتعاض وقت إذ جاءت الساعة فجأة؟ ومن أين يحصل لهم التدارك والتلافي حيئنذ؟\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n المعنى: ماذا قال في وقت يقرب من وقتنا؟ و { أن تأتيهم }: بدل اشتمال من الساعة\n يقول الحق جلّ جلاله: { ومنهم مَن يستمعُ إليك } وهم المنافقون\n كانوا يحضرون مجلس رسول الله صلى الله عليه وسلم\n ويسمعون كلامه ولا يَعُونَه\n ولا يُراعونَه حق رعايته\n تهاوناً منهم\n { حتى إِذا خرجوا من عندك قالوا للذين أُوتوا العلم } من الصحابة رضي الله عنهم: { ماذا قال آنفاً } ما الذي قال الساعة؟ على طريقة الاستهزاء\n أو: ما القول الذي ائتنفه الآن قبل انفصالنا عنه؟ وقال مقاتل: كان النبي صلى الله عليه وسلم يخطب\n ويعيب المنافقين\n فسمع المنافقون قوله\n فلما خرجوا من المسجد\n سألوا ابنَ مسعود عما قال النبي صلى الله عليه وسلم استهزاء\n وقال ابن عباس: \" أنا من الذين أُوتوا العلم\n وقد سُئلت فيمن سُئل \"\n ويقال: الناس ثلاثة: سامع عامل\n وسامع غافل\n وسامع تارك\n { أولئك الذين طبع اللّهُ على قلوبهم } لعدم توجهها إلى الخير أصلاً\n { واتبعوا أهواءهم } الباطلة\n فلذلك فعلوا ما فعلوا\n مما لا خير فيه\n { والذين اهتدوا } إلى طريق الحق { زادهم } الله بذلك { هُدىً } علماً وبصيرة\n أو شرْح صدر بالتوفيق والإلهام\n أو: زادهم ما سمعوا من الرسول صلى الله عليه وسلم هدايةً على ما عندهم\n { وآتاهم تقواهم } أعانهم عليها\n أو: آتاهم جزاء تقواهم\n أو: بيَّن لهم ما يتقون\n { فهل ينظرون } أي: ما ينتظرون { إِلا الساعةَ أن تأتيهم بغتةً } أي: تُباغِتهم بغتةً\n وهي الفجاءة\n والمعنى: أنهم لا يتذكرون بأحوال الأمم الخالية\n ولا بالإخبار بإتيان الساعة\n وما فيها من عظائم الأهوال\n وما ينظرون إلا إتيان نفس الساعة بغتة\n { فقد جاء أشراطُها } علاماتهان جمع: شَرَط بالتحريك\n بمعنى: العلامة\n وهي مبعث محمد صلى الله عليه وسلم\n وانشقاق القمر\n والدخان\n على قول\n وقيل: قطع الأرحام\n وقلة الكِرام\n وكثر اللئام\n فقوله تعالى: { فقد جاء أشراطها } تعليل لمفاجأتها\n لا لمطلق إتيانها\n على معنى: أنه لم يبقَ من الأمور الموجبة للتذكير أمر مترقب ينتظرونه سوى إتيان نفس الساعة إذ قد جاء أشراطها\n فلم يرفعوا لها رأساً\n ولم يعدوها من مبادئ إتيانها فيكون إتيانها بطريق المفاجأة لا محالة\n { فأنَّى لهم إِذا جاءتهم ذِكراهم } قال الأخفش: التقدير: فأنَّى لهم ذكراهم إذا جاءتهم\n أي: فمن أين لهم التذكير والاتعاظ إذا جاءتهم الساعة؟ فـ \" ذكراهم \": مبتدأ\n و \" أنَّى \": خبر مقدم\n و \" إذا جاءتهم \": اعتراض\n وسط بينهما\n رمز إلى غاية سرعة مجيئها\n والمقصود: عدم نفع التذكير عند مجيئها\n كقوله تعالى:\n\n[الفجر: 23]\n الإشارة: مجلس الوعظ والتذكير\n إن كان المذكِّر من أهل التنوير\n نهض المستمع له إلى الله قطعاً\n لكن ذلك يتفاوت على قدر سريان النور فيه قطعاً\n فمنهم مَن يصل النور إلى ظاهر قلبه\n ومنهم مَن يصل إلى داخل القلب\n ومنهم مَن يصل إلى روحه\n ومنهم مَن يصل إلى سره\n وذلك على قدر التفرُّع والاستعداد\n فمَن وصل النورُ إلى ظاهر قلبه نهض إلى العمل الظاهر\n وكان بين حب الدنيا والآخرة\n ومَن وصل إلى قلبه نهض بقلبه إلى الله\n ورفض الدنيا وراءه\n ومَن وصل إلى روحه انكشف عنه الحجاب\n ومَن وصل إلى سره تمكن من شهود الحق\n وفي الحِكَم: \" تسبق أنوارُ الحكماء أقوالَهم\n فحيثما سار التنويرُ وصل التعبير \" \n وهذا إن حضر مستفيداً\n وأما إن حضر منتقداً\n فهو قوله تعالى: { ومنهم من يستمع إليك\n\n\n } الآية\n والذين اهتدوا لدخول طريق التربية زادهم هُدىً\n فلا يزالون يزيدون تربيةً وترقيةً إلى أن يصلوا إلى مقام التمكين من الشهود\n قال القشيري: والذين اهتدوا بأنواع المجاهدات زادهم هُدىً لأنوار المشاهداتْ\n واهتدوا بتأمُّل البرهان\n فزادهم هُدىً برَوْح البيان\n أو اهتدوا بعلم اليقين\n فزادهم هُدىً بحق اليقين\n هـ\n ثم ذكر سبب الهداية وأساسها\n فقال: { فَٱعْلَمْ أَنَّهُ لاَ إِلَـٰهَ إِلاَّ ٱللَّهُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:66",
      "similarity": 0.1883761928695157
    },
    {
      "verse": "12:107",
      "similarity": 0.15307378134955105
    },
    {
      "verse": "6:47",
      "similarity": 0.13462673921898013
    },
    {
      "verse": "6:31",
      "similarity": 0.12950848709767038
    },
    {
      "verse": "26:202",
      "similarity": 0.12419396507411268
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/047018.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/047018.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/47:18.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}