{
  "chapter": "محمد",
  "text": "فاعلم انه لا اله الا الله واستغفر لذنۢبك وللمؤمنين والمؤمنت والله يعلم متقلبكم ومثوىكم",
  "translations": [
    {
      "translation": "Know then that there is no god except Allah and ask forgiveness for your wrongdoing, and for the men and women who have iman. Allah knows both your activity and your repose.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know then, therefore, there is no god but He, and ask forgiveness for your sins and those of believing men and women. God knows your wanderings and your destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know, therefore, (O Prophet), that there is no god but Allah, and ask forgiveness for your shortcomings and also for (the shortcomings of) believing men and believing women. Allah knows the places where you move about and where you dwell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that God is the only Lord. Ask forgiveness for your sins and for the sins of the believing men and women. God knows when you move and when you rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore know (O dear Prophet Mohammed – peace and blessings be upon him) that there is none worthy of worship except Allah, and seek the forgiveness of sins of your close ones and for the common believing men and women; and Allah knows your movements during the day and your resting during the night.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So know that La ilaha illallah and ask forgiveness for your sin, and also for (the sin of) believing men and women. And Allah knows well your moving about, and your place of rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So know that there is no god but Allah, and, ask protection for your fault and for the believing men and the believing women; and Allah knows the place of your returning and the place of your abiding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know thou therefore that there is no god but God, and ask forgiveness for thy sin, and for the believers, men and women. God knows your going to and fro, and your lodging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So know (O Muhammad) that there is no Allah save Allah, and ask forgiveness for thy sin and for believing men and believing women. Allah knoweth (both) your place of turmoil and your place of rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know then that there is no god except God. Ask forgiveness for your wrongdoing, and for the men and women who believe. God knows both your movements and your lodging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So know thou that there is no god save Allah, and ask forgiveness for thy fault and for believing men and believing women. And Allah knoweth well your moving about and your place of rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that there is no god except Allah, and plead [to Allah] for forgiveness of your sin and for the faithful, men and women. Allah knows your itinerary and your [final] abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know, therefore, that there is no god but Allah, and ask forgiveness for thy fault, and for the men and women who believe: for Allah knows how ye move about and how ye dwell in your homes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So know (O Muhammad SAW) that La ilaha ill-Allah (none has the right to be worshipped but Allah), and ask forgiveness for your sin, and also for (the sin of) believing men and believing women. And Allah knows well your moving about, and your place of rest (in your homes).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, know that there is no god except Allah and ask for forgiveness of your sins and for the believers, men and women. Allah knows your going to and fro, and your lodging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that there is no god but God, and ask forgiveness for your sin, and for the believing men and believing women. God knows your movements, and your resting-place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So know, [O Muhammad], that there is no deity except Allah and ask forgiveness for your sin and for the believing men and believing women. And Allah knows of your movement and your resting place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:19] Know, then, that there is no god except God, that is to say, adhere, O Muhammad (s), to knowledge of this [fact] that will benefit you at the Resurrection, and ask forgiveness for your sin — this was said to him, despite his infallibility (‘isma), so that his community might emulate him [in this respect]. Indeed he did do this. The Prophet (s) said, ‘Verily I do ask God for forgiveness a hundred times every day’ — and for the believing men and believing women — herein is an honouring for them, by having their Prophet enjoined to ask forgiveness for them. And God knows your going to and fro, your bustle during the day in pursuit of   your business, and your place of rest, when you retire to where you sleep at night. In other words, He has knowledge of all your states, nothing of which can be hidden from Him, so be mindful of Him — the address [in this verse] is meant for believers as well as others.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "592 (So know) Muhammad (that there is no God save Allah) there is none that harms or benefits, gives or withholds, raises or abases except Allah; and it is also said that this means: and know there is nothing that has the merit of \"there is no deity save Allah\", (and ask forgiveness for thy sin) Muhammad, when he beat up Zayd Ibn al-Samin, the Jew (and for believing men and believing women) and seek forgiveness for the sins of the believing men and believing women. (Allah knoweth (both) your place of turmoil) your goings and comings as well as your works in the life of the world (and your place of rest) and He knows your destination and abode in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مُتَقَلَّبَكُمْ } معناه مُتَقَلَّبُ كُلّ غَابةٍ { وَمَثْوَاكُمْ } معناه مَثوى كُلّ دَابةٍ بالليلِ والنَّهارِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {You are rotated} means the rotation of every forest {And your abode} means the abode of every beast by night and day.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فاعلم أنه لا إله إلا الله } أي: حصل علم اليقين في التوحيد ثم اسلك طريقه إذ الاستغفار الذي هو صورة السلوك مسبوق بالإيمان العلمي دون الظني لأن من لم يرزق ثبات الإيمان لم يمكنه السلوك، والثبات لا يكون إلا باليقين إذ الاعتقاد التقليدي يمكن تغيره وكل حجاب ذنب سواء كان بالهيئات البدنية أو الصفات النفسانية أو القلبية أو الأنية كما قيل:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمعتم حال الساعة وحلول الساعة بغتة { فَٱعْلَمْ أَنَّهُ لاَ إِلَـٰهَ إِلاَّ ٱللَّهُ } المؤمنون } أي: فاثبت أنت يا أكمل الرسل على جادة التوحيد الذاتي\n وتمكن على صراط الحق في عموم أوقاتك وحالاتك\n واشهد ظهور شمس الذات على صفائح عموم الذرات\n وشاهد انقهار جميع المظاهر والمجالي في وحدة ذاته\n واهد جميع من تبعك من المؤمنين إلى هذا المشهد العظيم { وَٱسْتَغْفِرْ } في عموم أوقاتك { لِذَنبِكَ } الذي صدر عنك من الالتفات إلى ما سوى الحق والعكوس والإظلال { وَ } استغفر أيضاً { لِلْمُؤْمِنِينَ وَٱلْمُؤْمِنَاتِ } إذا أنت كفيلهم وهاديهم إلى طريق التوحيد { وَ } بالجملة: { ٱللَّهُ } المحيط بعموم أحوالكم ونشأتكم { يَعْلَمُ } بعمله الحضوري { مُتَقَلَّبَكُمْ } أي: موضع تقلبكم وانقلابكم في دار الاختبار ونشأة التلون والاعتبار { وَمَثْوَاكُمْ } [محمد: 19] أي: موضع إقامتكم وتمكنكم في دار الإقامة والقرار\n فعليكم أن تستعدوا لأخراكم في أولاكم وتهيئوا أسباب عقباكم في دنياكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { فاعلم أنه لا إِله إِلا اللّهُ } أي: إذا علمت أن مدار السعادة، والفوز بالنعيم في دار البقاء هو التوحيد والطاعة، ومناط الشقاء والخسران في دار الهوان هو الإشراكُ والعصيان، فاثبت على ما أنت عليه من التوحيد، واعلم أنه لا إله في الوجود إلا الله، فلا يستحق العبادة غيره، { واستغفر لذنبك } وهو ما قد يصدر منه صلى الله عليه وسلم من خلاف الأولى، عبّر عنه بالذنب نظراً إلى منصبه الجليل، كيف لا، وحسنات الأبرار سيئات المقربين؟ فكل مقام له آداب، فإذا أخلّ بشيء من آدابه أُمر بالاستغفار، فلمقام الرسالة آداب، ولمقام الولاية آداب، ولمقام الصلاة آداب، وضعفُ العبودية لا يقوم بجميع حقوق الربوبية، قال تعالى:\n\n[الزمر: 67]\n وبالجملة فالقيام بالآداب مع الله - تعالى - على ما يستحقه - سبحانه - حتى يُحيط العبد بجميع الآداب مع عظمة الربوبية محال عادة، قال صلى الله عليه وسلم مع جلالة منصبه:\n\n \" لا أُحصي ثناء عليك، أنت كما أثنيت على نفسك \" \n\nفكل ما قَرُبَ العبدُ من الحضرة شُدّد عليه في طلب الأدب، فإذا أخذته سِنةٌ أُمر بالاستغفار، ولذلك كان صلى الله عليه وسلم يستغفر في المجلس سبعين مرة، أو مائة، على ما في الأثر\n وقال شيخ شيوخنا، سيدي عبد الرحمن الفاسي، بعد كلام: والحق أن استغفاره صلى الله عليه وسلم طلب ثبات المغفرة والستر من الوقوع، لا طلب العفو بعد الوقوع، وقد أخبره تعالى بأنه فعل\n وقد يُقال: استغفار تعبُّد لا غير\n قال: والذي يظهر لي أن أمره بالاستغفار مع وعد الله بأنه مغفور له إشارة إلى الوقوف مع غيب المشيئة، لا مع الوعد، وذلك حقيقةٌ، والوقوف مع الوعد شريعة\n وقال الطيبي: إذا تيقنت أن الساعة آتية، وقد جاء أشراطها، فخُذ بالأهم فالأهم، والأَولى فالأَولى، فتمسّك بالتوحيد، ونزِّه اللّهَ عما لا ينبغي، ثم طَهِّر نفسك بالاستغفار عما لا يليق بك، مِن ترك الأَولى، فإذا صِرت كاملاً في نفسك فكن مكمِلاً لغيرك، فاستغفر { للمؤمنين والمؤمنات }\n هـ\n أي: استغفر لذنوبهم بالدعاء لهم، وترغيبهم فيما يستدعي غفران ذنوبهم\n وفي إعادة الجار تنبيه على اختلاف معلّقيْه إذ ليس موجبُ استغفاره صلى الله عليه وسلم كموجب استغفارهم، فسيئاته - عليه السلام - فرضاً حسناتهم\n وفي حذف المضاف، وإقامة المضاف إليه مقامه - أي: ولذنب المؤمنين - إشعار بعراقتهم في الذنوب، وفرط افتقارهم إلى الاستغفار\n { واللّهُ يعلم متقلَّبكم ومثواكم } أي: يعلم متقلبكم في الدنيا، فإنها مراحل لا بد من قطعه، ويعلم مثواكم في العقبى فإنها مواطن إقامتكم، فلا يأمركم إلا بما هو خير لكم فيهما، فبادِروا إلى الامتثال لما أمركم به، فإنه المهم لكم، أو: يعلم متقلبكم: في معايشكم ومتاجركم، ومثواكم: حيث تستقروا في منازلكم، أو متقلبكم: في حياتكم، ومثواكم: في القبور، أو: متقلبكم: في أعمالكم الحسنة أو السيئة، ومثواكم: من الجنة أو النار، أو: يعلم جميع أحوالكم فلا يخفى عليه شيء منها، فمثله حقيق بأن يُخشى ويُتقى ويُستغفر\n\n\nالإشارة: قال القشيري: قال تعالى لنبيه صلى الله عليه وسلم: { فاعلم أنه لا إِله إلا الله } وكان عالماً، ولكن أمره باستدامة العلم واستزادته، وذلك في الثاني من حاله في ابتداء العلم، لأن العلم أمر، ولا يجوز البقاء على الأمر الواحد، فكل لحظة يأتي فيها علم\n ويقال: كان له علم اليقين، فأُمِر بعين اليقين، فأُمِر بعين اليقين، أو: كان له عيه اليقين، فأُمر بحق اليقين\n ويقال: قال صلى الله عليه وسلم:\n\n \" أنا أعملكم بالله وأخشاكم له \" \n\nفنزلت الآية، أي: أُمر بالتواضع\n وهنا سؤال: كيف قال: \" فاعلم \" ولم يقل صلى الله عليه وسلم بعدُ: علمتُ، كما قال إبراهيم حين قال له:\n\n[البقرة: 131] ويُجاب: بأن الله تعالى أخبر عنه بقوله:\n\n[البقرة: 285] والإيمان هو العلم، فإخبارُ الحق تعالى عنه أتم من إخباره عن نفسه بقوله: علمته\n ويُقال: إبراهيم عليه السلام لما قال: { أسلمتُ } ابتلي، ونبينا صلى الله عليه وسلم لم يقل علمت، فعُوفي، ويقال: فرق بين موسى، لمَّا احتاج إلى زيادة العلم أُحيل على الخضر، ونبينا صلى الله عليه وسلم قال له:\n\n[طه: 114] فكم بين مَن أُحيل في استزادة العلم على عبد، وبين مَن أُمِر باستزادة العلم من الحق\n ويقال: إنما أمره بقوله: { فاعلم } بالانقطاع إليه من الحظوظ من الخلق، ثم بالانقطاع منه إليه، وإذا قال العبد هذه الكلمة على العادة، والغفلة عن الحقيقة، وهي نصف البيان فليس لهذا القول كبيرُ قيمةٍ، وهذا إذا تعجب من شيء فذكر هذه الكلمة، فليس له قَدْرٌ، وإذا قاله مخلصاً ذاكراً لمعناها، متحققاً بحقيقتها، فإن قاله بنفسه فهو في وطن التفرقة، وعندهم هذا من الشِّرْكِ الخفيِّ، وإن قاله بالحق فهو إخلاص، والعبد أولاً يعلم ربه بدليل وحُجةٍ، فعلمه بنفسه ضروري، وهو أصل الأصول، وعليه ينبني كل علم استدلالي\n ثم تزداد قوةُ علمه بزيادة البيان، وزيادة الحُجج، ويتناقض علمه بنفسه لغَلَبة ذكرِ الله بقلبه عليه، فإذا انتهى لحال المشاهدة، واستيلاء سلطان الحقيقة عليه، صار علمه في تلك الحالة ضرورياً، ويقِل إحساسه بنفسه، حتى يصير علمه بنفسه كالاستدلال، وكأنه غافلٌ عن نفسه، أو ناسٍ لنفسه، ويُقال: الذي في البحر غلب عليه ما يأخذه من الرؤية عن ذكر نفسه، فإذا ركب البحر فرَّ من هذه الحالة، فإذا غرق في البحر فلا إحساس له بشيء سوى ما هو مستغرقٌ فيه مستهلَك\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:32",
      "similarity": 0.599404542247773
    },
    {
      "verse": "29:68",
      "similarity": 0.5450260314298934
    },
    {
      "verse": "16:29",
      "similarity": 0.5044133741180881
    },
    {
      "verse": "40:76",
      "similarity": 0.5025600425308107
    },
    {
      "verse": "39:72",
      "similarity": 0.5012974137505445
    }
  ]
}