{
  "chapter": "محمد",
  "text": "والذين اهتدوا۟ زادهم هدى وءاتىهم تقوىهم",
  "translations": [
    {
      "translation": "He increases in guidance those who are already guided and gives them their taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who are rightly guided will be given greater guidance by Him, and they will have their intrinsic piety.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who were led to the Guidance, Allah increases them in their guidance and causes them to grow in God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will increase the guidance and piety of those who seek guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who attained the right path – Allah increases the guidance for them and bestows their piety to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who accept guidance, He increases them in guidance and bestows on them their Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who follow the right direction, He increases them in guidance and gives them their guarding (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who are guided aright, them He increases in guidance, and gives them their godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "While as for those who walk aright, He addeth to their guidance, and giveth them their protection (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who follow guidance, He adds to their guidance, and shows them the way to righteousness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who are guided He increaseth Unto them guidance, and giveth them their piety.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who are [rightly] guided, He enhances their guidance and invests them with their Godwariness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But to those who receive Guidance, He increases the (light of) Guidance, and bestows on them their Piety and Restraint (from evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "While as for those who accept guidance, He increases their guidance, and bestows on them their piety.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who were guided, He increases their guidance and gives them their protection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who are guided, He increases them in guidance, and He has granted them their righteousness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who are guided - He increases them in guidance and gives them their righteousness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:17] But those who are [rightly] guided, namely, the believers, He, God, enhances their guidance and invests them with fear [of Him], He inspires them to [do] that by which they can be wary of [ending up in] the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(While as for those who walk aright) through faith, (He addeth) by means of your sermon (to their guidance) an insight into the matters of religion and sincerity in their intention, (and giveth them their protection) and inspire them their fearingness by shunning transgression and avoiding unlawful matters; it is also said that this means: and those who are guided by the abrogating revelations, Allah increases their guidance in the abrogated revelations and Allah, glorified and Exalted is He, honours them with the use of both the abrogating and the abrogated.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَآتَاهُمْ تَقْوَاهُمْ } معناه ثَوابُهُمْ فِي الآخرةِ ويقال: بيَّنَ لَهُم ما يَتَّقون\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } المؤمنون { ٱلَّذِينَ ٱهْتَدَوْاْ } بهدايته صلى الله عليه وسلم { زَادَهُمْ } استماع القرآن { هُدًى } على هدى { وَآتَاهُمْ تَقْوَاهُمْ } [محمد: 17] وبين لهم ما يعنيهم على سلوك طريق التوحيد ويجنبهم عما يغويهم عن منهج الحق وصراط التحقيق\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}