{
  "chapter": "محمد",
  "text": "ومنهم من يستمع اليك حتى اذا خرجوا۟ من عندك قالوا۟ للذين اوتوا۟ العلم ماذا قال ءانفا او۟لئك الذين طبع الله على قلوبهم واتبعوا۟ اهواءهم",
  "translations": [
    {
      "translation": "There are some who listen to you; but as soon as they go from you they say to those who were given knowledge: \"What is this he is saying now?\" They are those whose hearts have been sealed by God, and they follow their own lusts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them some give ear to you. But no sooner do they leave your presence than they ask those endowed with knowledge: “What is it that he said just now?” Such are those whose hearts Allah has sealed and who pursue their lusts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), some of them listen to you, but when they leave you they ask those who have received knowledge, \"What did he say a few moments ago?\" God has sealed the hearts of such people who have followed their worldly desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are some who listen to what you say; until when they go away from you, they say to those who have been given knowledge, “What did he say now?”; they are those whose hearts Allah has sealed, and they follow their own desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are some who listen to you till when they go out from you, they say to those who have received knowledge: \"What is it that he has said just now \"Such are men whose hearts Allah has sealed because they followed their lusts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are those of them who seek to listen to you, until when they go forth from you, they say to those who have been given the knowledge: What was it that he said just now? These are they upon whose hearts Allah has set a seal and they follow their low desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some of them there are give ear to thee, till, when they go forth from thee, they say to those who have been given knowledge, 'What said he just now?' Those are they upon whose hearts God has set a seal, and they have followed their caprices.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them are some who give ear unto thee (Muhammad) till, when they go forth from thy presence they say unto those who have been given knowledge: What was that he said just now? Those are they whose hearts Allah hath sealed, and they follow their own lusts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them are those who listen to you, but then, when they leave your presence, say to those who have been given knowledge [Scripture], \"What was that he just said?\" Such are those whose hearts God has sealed, and who follow their own base desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of them are some who listen to thee, until, when they go forth from before thee, they say Unto those who have been vouchsafed knowledge, what is that he hath said just now? Those are they whose hearts Allah hath sealed up and they follow their lusts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some among them who prick up their ears at you. But when they go out from your presence, they say to those who have been given knowledge, ‘What did he say just now?’ They are the ones on whose hearts Allah has set a seal, and they follow their own desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are men who listen to thee, but in the end, when they go out from thee, they say to those who have received Knowledge, \"What is it he said just then?\" Such are men whose hearts Allah has sealed, and who follow their own lusts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are some who listen to you (O Muhammad SAW) till, when they go out from you, they say to those who have received knowledge: \"What has he said just now? Such are men whose hearts Allah has sealed, and they follow their lusts (evil desires).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them listen to you, but no sooner do they leave you they ask those to whom knowledge has been given: 'What did he say just now' Such are those whom Allah has set a seal upon their hearts and who follow their own desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them are those who listen to you, but when they leave your presence, they say to those given knowledge, “What did he say just now?” Those are they whose hearts God has sealed, and they follow their own desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them, [O Muhammad], are those who listen to you, until when they depart from you, they say to those who were given knowledge, \"What has he said just now?\" Those are the ones of whom Allah has sealed over their hearts and who have followed their [own] desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:16] And there are some among them, namely, the disbelievers, who listen to you, during the Friday sermon — and these are the hypocrites; until, when they go forth from you, they say to those who have been given knowledge, that is to say, to the knowledgeable ones among the Companions [of the Prophet], such as [‘Abd Allāh] Ibn Mas‘ūd and [‘Abd Allāh] Ibn ‘Abbās, in derision and mockery: ‘What was he saying just now?’ (read ānifan or anifan, meaning al-sā‘a, ‘just now’). In other words, [they mean to say] ‘we will not go back to [listen to] him again’. Those are the ones on whose hearts God has set a seal, of disbelief, and who follow their own desires, in [acting with] hypocrisy.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Among them) among the hypocrites (are some who give ear unto thee (Muhammad)) who listen to your Friday sermon (till, when they go forth from your presence) until when they disperse, (they) i.e. the hypocrites (say unto those who have been given knowledge) i.e. 'Abdullah Ibn Mas'ud: (What was that he) i.e. Muhammad (pbuh) (said just now) from the pulpit? They asked this question in mockery of what the Prophet (pbuh) had just said. (Those) hypocrites (are they whose hearts Allah hath sealed) such that they do not perceive the Truth or guidance, (and they follow their own lusts) because of their secret disbelief, hypocrisy, treachery and enmity towards the Messenger of Allah (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنْهُمْ } أي: من المستوجبين بخلود النار أبد الآباد { مَّن يَسْتَمِعُ إِلَيْكَ } يا أكمل الرسل حين دعوتك وتذكرك وجلسوا في مجلسك صامتين محبوسين { حَتَّىٰ إِذَا خَرَجُواْ مِنْ عِندِكَ } وانصرفوا عن مجلسك { قَالُواْ } من كمال غفلتهم وذهولهم عنك وعن كلامك وكمالاتك وعدم إدراكهم بما فيها وإصغائهم إليها { لِلَّذِينَ أُوتُواْ ٱلْعِلْمَ } أي: أصحابك المتذكرين عن كلامك، الموفقين على التصديق والإذعان بك وبكتابك: { مَاذَا قَالَ } أي: أي شيء قال صاحبكم { آنِفاً } في هذا المجلس؟ مع أنهم معهم { أُوْلَـٰئِكَ } الأشقياء البعداء عن ساحة عز القبول هم { ٱلَّذِينَ طَبَعَ ٱللَّهُ عَلَىٰ قُلُوبِهِمْ } وختم على سمعهم وأبصارهم { وَ } لهذا { ٱتَّبَعُوۤاْ أَهْوَآءَهُمْ } [محمد: 16] وتركوا إهداءه صلى الله عليه وسلم ولم يقتبسوا النور من مشكاة النبوة، ولم يلتفتوا إلى هداية القرآن، بل استهزءوا معه ومع الرسول صلى الله عليه وسلم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { آنفاً }: قال الزمخشري ومَن تبعه: ظرف، أي: الساعة، وقال أبو حيان: لا أعلم أحداً عدّه من الظروف، وجوَّز \" مَكيّ \" فيه الظرف والحالية\n قال الهروي: \" آنفاً \" مأخذوة من: ائتنفت الشيء: إذا ابتدأته، وروضة أنُفٌ: إذا لم تُرعَ",
      "translations": []
    }
  ]
}