{
  "chapter": "محمد",
  "text": "ان الله يدخل الذين ءامنوا۟ وعملوا۟ الصلحت جنت تجرى من تحتها الانهر والذين كفروا۟ يتمتعون وياكلون كما تاكل الانعم والنار مثوى لهم",
  "translations": [
    {
      "translation": "Allah will admit those who have iman to Gardens with rivers flowing under them. Those who are kafir have their enjoyment, eating as cattle eat, but the Fire will be their final residence.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily God will admit those who believe and do the right into gardens with streams of water running by. But the unbelievers revel and carouse and subsist like beasts, and Hell will be their residence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah shall admit those who believe and do righteous works to the Gardens beneath which rivers flow. As for the unbelievers, they enjoy the pleasures of this transient life and eat as cattle eat. The Fire shall be their resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will admit the righteously striving believers into the gardens wherein streams flow. However, the disbelievers who enjoyed themselves and ate like cattle will have for their dwelling hell fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will indeed admit those who believed and did good deeds into Gardens beneath which rivers flow; and the disbelievers enjoy, and they eat like the cattle eat, and their destination is in the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Allah will admit those who believe and do righteous good deeds, into Gardens under which rivers flow (Paradise); while those who disbelieve enjoy their life and eat as cattle eat; but the Fire will be their abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah will make those who believe and do good enter gardens beneath which rivers flow; and those who disbelieve enjoy themselves and eat as the beasts eat, and the fire is their abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God shall surely admit those who believe and do righteous deeds into gardens underneath which rivers flow. As for the unbelievers, they take their enjoyment and eat as cattle eat; and the Fire shall be their lodging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah will cause those who believe and do good works to enter Gardens underneath which rivers flow; while those who disbelieve take their comfort in this life and eat even as the cattle eat, and the Fire is their habitation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will admit those who believe and do good deeds to Gardens through which rivers flow. Those who deny the truth may take their fill of pleasure in this world, and eat as cattle do, but the Fire will be their ultimate abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah shall cause those who believe and work righteous works to enter Gardens whereunder rivers flow. And those who disbelieve enjoy themselves and eat even as the cattle eat, and the Fire shall be the abode for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah will admit those who have faith and do righteous deeds into gardens with streams running in them. As for the faithless, they enjoy and eat like the cattle do, and the Fire will be their [final] abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah will admit those who believe and do righteous deeds, to Gardens beneath which rivers flow; while those who reject Allah will enjoy (this world) and eat as cattle eat; and the Fire will be their abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly! Allah will admit those who believe (in the Oneness of Allah Islamic Monotheism) and do righteous good deeds, to Gardens under which rivers flow (Paradise), while those who disbelieve enjoy themselves and eat as cattle eat, and the Fire will be their abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will indeed admit those who believe and do good works into Gardens underneath which rivers flow. As for the unbelievers, they take their fill of pleasure and eat as the cattle eat, but the Fire shall be their lodging!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will admit those who believe and do good deeds into gardens beneath which rivers flow. As for those who disbelieve, they enjoy themselves, and eat as cattle eat, and the Fire will be their dwelling.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah will admit those who have believed and done righteous deeds to gardens beneath which rivers flow, but those who disbelieve enjoy themselves and eat as grazing livestock eat, and the Fire will be a residence for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:12] God will surely admit those who believe and perform righteous deeds into gardens underneath which rivers flow. As for those who disbelieve, they take their enjoyment, in this world, and eat as the cattle eat, that is to say, they are only concerned with [filling] their bellies and [satisfying] their private parts, without giving any thought to the Hereafter; and the Fire will be their habitation, their home, their station and their [final] destination.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Allah will cause those who believe) in Muhammad (pbuh) and in the Qur'an (and do good works) and do acts of obedience privately between themselves and their Lord (to enter Gardens beneath which) beneath its trees and houses (rivers) of wine, water, honey and milk (flow; while those who disbelieve) in Muhammad (pbuh) and in the Qur'an: Abu Sufyan and his host (take their comfort in this life and eat) with avidity without sparing a thought for what tomorrow holds (even as the cattle eat, and the Fire is their 591 habitation) in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { إِنَّ ٱللَّهَ } العليم الحكيم { يُدْخِلُ ٱلَّذِينَ آمَنُواْ وَعَمِلُواْ ٱلصَّالِحَاتِ جَنَّاتٍ } منتزهات من المعارف والحقائق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } الجارية من العلوم اللدنية\n المنتشئة من منبع الوحدة الذاتية\n تتلذذون بها تلذذاً معنوياً حقيقياً { وَٱلَّذِينَ كَفَرُواْ } بوحدة الحق وكمالاته المترتبة على شئونه وتجلياته { يَتَمَتَّعُونَ } بالحطام الدنيوية ويتلذذون باللذات البهيمية { وَيَأْكُلُونَ كَمَا تَأْكُلُ ٱلأَنْعَامُ } وتتلذذ بلا شعور لهم باللذة الأخروية { وَ } بالآخرة { ٱلنَّارُ } المعدة المسعرة صارت { مَثْوًى لَّهُمْ } [محمد: 12] ومحل قرارهم واستقرارهم\n\n\n{ وَكَأَيِّن } أي: كثيراً { مِّن قَرْيَةٍ } من القرى الهالكة { هِيَ أَشَدُّ قُوَّةً } أي: أهلها\n وأكثر أموالاً وأولاداً { مِّن } أهل { قَرْيَتِكَ ٱلَّتِيۤ أَخْرَجَتْكَ } أي: أهلها منها { أَهْلَكْنَاهُمْ } واستأصلناهم بسبب إخراجهم رسل الله من بينهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والذين كفروا يتمتعون } في الدنيا بمتاعِها أياماً قلائل\n { ويأكلون } غافلين عن عَواقبهم\n غير متفكرين فيها { كما تأكل الأنعامُ } في مسارحها\n غافلة عما هي بصدده من النحر والذبح\n فالتشبيهُ بالأنعام صادقٌ بالغفلةِ عن تدبير العاقبة\n وعن شكر المنعِم\n وبعدم التمييز للمُضر من غيره\n كأكل الحرام وعدم تَوَقيه\n وكذا كونُه غير مقصورٍ على الحاجة\n ولا على وقتها\n وسيأتي في الإشارة إن شاء الله\n { والنارُ مثوىً لهم } أي: منزلُ ثوَاه وإقامته\n والجملةُ إما حال مقدرةٌ من واو { يأكلون } \n أو استئناف\n الإشارة: تفكُّر الاعتبار يكون في أربعة\n الأول: في سرعة ذهاب الدنيا وانقراضها\n كأضغاث أحلام\n وكيف غرَّت مَن انتشب بها\n وأخذته في شبكتها\n حتى قدِم على الله بلا زاد\n وكيف دَمّر اللّهُ على أهل الطغيان\n واستأصل شأفتهم\n فيُنتج ذلك التشمير والتأهُّب ليوم الجزاء\n الثاني: في دوام دار البقاء\n ودوام نعيمها\n فينتهز الفرصة في العمل الصالح\n\n الثالث: في النِعَم التي أنعم الله بها على عباده\n الدنيوية والأخروية\n الحسية والمعنوية\n قال تعالى:\n\n[إبراهيم: 34] فينْتِج ذلك الشكر\n لتدوم عليه\n الرابع: في نصب هذه العوالم\n على ما هي عليه من الإبداع والإتقان\n فيُثمر ذلك معرفةَ الصانع\n وباهرِ قدرته وحكمته\n وقوله تعالى: { ذلك بأن الله مولى الذين آمنوا\n\n\n } الخ\n قال القشيري: المَوْلَى: المحِبُّ\n فهو محب الذين آمنوا\n والكافرين لا يُحبهم\n ويصح أن يُقال: أرجى آيةٍ في القرآن هذه الآية\n لم يقل مولى الزُهّاد والعُبّاد وأصحاب الأورادِ والاجتهاد: بل قال: { مولى الذين آمنوا } والمؤمن وإن كان عاصياً فهو من جملتهم\n هـ\n والمحبة تتفاوت بقدر زيادة الإيمان والإيقان حتى يصير محبوباً مقرباً\n قوله تعالى: { والذين كفروا يتمتعون ويأكلون كما تأكل الأنعام } وكذلك الغافل\n فالأنعام تأكل بلا تمييز\n من أي موضع وجدت\n كذلك الجاهل\n لا تمييز له من الحلال أو من الحرام\n والأنعام ليس لها وقت لأكلها\n بل تأكل في كل وقت\n وكذلك الغافل والكافر\n فقد ورد\n \" أن الكافر يأكل في سبعة أمعاء\n والمؤمن يجتزئ بما تيسّر \" \n\n كما في الخبر:\n \" ما ملأ آدميٌّ وعاءً شرّاً من بطنٍ \" \nوالأنعام تأكل على الغفلة\n فمَن كان في أكله ناسياً لربه\n فأكلُه كأكل الأنعام\n انظر القشيري\n ولما أمرهم بالنظر فلم يفعلوا\n هددهم بالهلاك\n فقال: { وَكَأَيِّن مِّن قَرْيَةٍ هِيَ أَشَدُّ قُوَّةً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:9",
      "similarity": 0.531223878265857
    },
    {
      "verse": "22:14",
      "similarity": 0.5216496606145066
    },
    {
      "verse": "47:19",
      "similarity": 0.4822964822176552
    },
    {
      "verse": "14:23",
      "similarity": 0.4774763309110614
    },
    {
      "verse": "39:32",
      "similarity": 0.47709746419602483
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/47:12.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/47:12.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/47:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}