{
  "chapter": "محمد",
  "text": "افمن كان على بينة من ربه كمن زين له سوء عمله واتبعوا۟ اهواءهم",
  "translations": [
    {
      "translation": "Is someone on a clear path from his Lord like those whose bad actions have been made to seem good to them and who follow their own desires?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can one who stands on a clear proof from his Lord, be like one enamoured of his evil deeds and follows his inane desires?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, can he, who is on a Clear Guidance from His Lord, be like him whose evil deeds have been embellished to him, and who pursued their lusts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can the one who follows the authority of his Lord be considered equal to the one whose evil deeds are made to seem attractive to him and who follows his own desires?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So will one who is upon on a clear proof from his Lord, ever be like any of those whose evil deeds are made to appear good to them and they follow their own desires?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can then he, who stands on clear evidence from his Lord, be like those for whom their evil deeds are beautified for them, while they follow their own lusts\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! is he who has a clear argument from his Lord like him to whom the evil of his work is made fairseeming: and they follow their low desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, is he who is upon a clear sign from his Lord like unto such a one unto whom his evil deeds have been decked out fair, and they have followed their caprices?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who relieth on a clear proof from his Lord like those for whom the evil that they do is beautified while they follow their own lusts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can then he who takes his stand on clear evidence from his God be likened to those for whom the evil that they do is made to look beautiful, and who follow their own desires?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he then who standeth, on an evidence from his Lord like Unto him whose evil of work is made fair-seeming for him and those who follow their lusts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who stands on a manifest proof from his Lord like those to whom the evil of their conduct is made to seem decorous and who follow their desires?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is then one who is on a clear (Path) from his Lord, no better than one to whom the evil of his conduct seems pleasing, and such as follow their own lusts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who is on a clear proof from his Lord, like those for whom their evil deeds that they do are beautified for them, while they follow their own lusts (evil desires)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who has clear proof from his Lord to be compared to him whose evil deeds are made to seem fair to him, so that they followed their desires?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who stands upon evidence from his Lord, like someone whose evil deed is made to appear good to him? And they follow their own desires?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So is he who is on clear evidence from his Lord like him to whom the evil of his work has been made attractive and they follow their [own] desires?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:14]   Is he who follows a clear sign, a definitive argument and proof, from his Lord, and these are the believers, like those whose evil deeds have been adorned for them, so that they see them as fair [deeds], and these are the disbelievers of Mecca, and who follow their desires?, by worshipping graven images. In other words, there is no similarity between the two.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is he who relieth on a clear proof) and a religion (from his Lord) i.e. Muhammad (pbuh) (like those for whom the evil that they do is beautified) like him whose evil works are beautified, i.e. Abu Jahl (while they follow their own lusts) through the worship of idols?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا ننصرك ونظهر دينك؟ { أَفَمَن كَانَ عَلَىٰ بَيِّنَةٍ } حجة واضحة\n آتية له { مِّن رَّبِّهِ } مبينة له امر دينه { كَمَن زُيِّنَ } أي: حبب وحسن { لَهُ سُوۤءُ عَمَلِهِ } بلا مستند عقلي أو نقلي\n بل { وَٱتَّبَعُوۤاْ أَهْوَاءَهُمْ } [محمد: 14] بمقتضى آرائهم الباطلة وأمانيهم الزائغة الزائلة\n\n\nكلا وحاشا\n بل { مَّثَلُ ٱلْجَنَّةِ } وشأنها العجيبة { ٱلَّتِي وُعِدَ ٱلْمُتَّقُونَ } بها\n المجتنبون عن محارم الله\n المتحرزون عن مساخطه على الوجه الذي بيَّنهم الكتب وبلغهم الرسل\n الممتثلون بجميع ما أمروا من عنده سبحانه إيماناً واحتساباً عند ربهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "101:9",
      "similarity": 0.47636917391053724
    },
    {
      "verse": "25:43",
      "similarity": 0.4701713257368658
    },
    {
      "verse": "30:29",
      "similarity": 0.45560989376071465
    },
    {
      "verse": "54:3",
      "similarity": 0.44649965509588413
    },
    {
      "verse": "2:145",
      "similarity": 0.43878030198659157
    }
  ]
}