{
  "chapter": "محمد",
  "text": "الذين كفروا۟ وصدوا۟ عن سبيل الله اضل اعملهم",
  "translations": [
    {
      "translation": "THOSE WHO DISBELIEVE and obstruct (others) from the way of God will have wasted their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has caused the works of those who disbelieve and hinder people from the way of Allah to go to waste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has made devoid of all virtue the deeds of those who have disbelieved and prevented others from the way of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has destroyed the deeds of those who disbelieved and prevented from Allah’s way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve and hinder (men) from the path of Allah, He will render their deeds vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who disbelieve and turn away from Allah's way, He shall render their works ineffective.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve and bar from God's way, God will send their works astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve and turn (men) from the way of Allah, He rendereth their actions vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will bring to naught all the good deeds of those who are bent on denying the truth and bar [others] from the path of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve and hinder others from the way of Allah, He shall send their works astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are [themselves] faithless and bar [others] from the way of Allah—He has rendered their works fruitless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Allah and hinder (men) from the Path of Allah,- their deeds will Allah render astray (from their mark).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve [in the Oneness of Allah, and in the Message of Prophet Muhammad SAW], and hinder (men) from the Path of Allah (Islamic Monotheism), He will render their deeds vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve and bar from the way of Allah, Allah will cause their deeds go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve and repel from the path of God—He nullifies their works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve and avert [people] from the way of Allah - He will waste their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:1] Those who disbelieve, from among the people of Mecca, and bar, others, from the way of God, that is to say, [from] faith, He will leave their works to waste, such as giving food [to the poor] or being kind to kin, and so they will find no reward for these [works of theirs] in the Hereafter; [but] they are requited for them in this world [purely] out of His bounty, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Those who disbelieve): '(Those who disbelieve) in Muhammad (pbuh) and the Qur'an (and turn (men) from the way of Allah) and prevent people from the religion and obedience of Allah-the reference here is to those who fed the army of the disbelievers on the Day of Badr: 'Utbah and Shaybah the sons of Rabi'ah, Munbih and Nabih the sons of al-Hajjaj, Abu'l-Buhturi Ibn Hisham and Abu Jahl Ibn Hisham and their host-, (He rendereth their actions vain) He thwarts their good deeds and spending on the Day of Badr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nحدّثنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { أَضَلَّ أَعْمَالَهُمْ } معناه لا يَقبَلُ مع الكُفرِ عَملاً\n وقد كانتْ لَهُم أعمالٌ فأضلَها يومَ القِيامةِ، فلا يَقدِرون على شيءٍ مما كَسِبوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلَّذِينَ كَفَرُواْ } بالله وتوحيده، وأنكروا على نبوة حبيبه صلى الله عليه وسلم ورسالته عناداً ومكابرة { وَ } مع كفرهم وانصرافهم بأنفسهم عن الهداية { صَدُّواْ } وصرفوا سائر الناس { عَن سَبِيلِ ٱللَّهِ } وطريق توحيده الذي هدي إليه صلى الله عليه وسلم وبعث لتبيينه، وإرشاد عمود عباد الله نحوه منه حسداً عليه صلى الله عليه وسلم وعلى من تبعه { أَضَلَّ } أحبط وأضاع سبحانه { أَعْمَٰلَهُمْ } [محمد: 1] أي: صوالح أعمالهم التي أتوا بها طمعاً للكرامة والمثوبة من لدنه سبحانه بعدما كفروا به سبحانه وبرسوله صلى الله عليه وسلم؛ إذ لا تثمر الأعمال الصالحة إلا بالإيمن والتصديق بالله وبرسوله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الذين }: مبتدأ، و { أضل }: خبر، و { من ربهم }: من ضمير الحق، وجملة { وهو\n\n",
      "translations": []
    }
  ]
}