{
  "chapter": "محمد",
  "text": "مثل الجنة التى وعد المتقون فيها انهر من ماء غير ءاسن وانهر من لبن لم يتغير طعمه وانهر من خمر لذة للشربين وانهر من عسل مصفى ولهم فيها من كل الثمرت ومغفرة من ربهم كمن هو خلد فى النار وسقوا۟ ماء حميما فقطع امعاءهم",
  "translations": [
    {
      "translation": "An image of the Garden which is promised to those who have taqwa: in it there are rivers of water which will never spoil and rivers of milk whose taste will never change and rivers of wine, delightful to all who drink it, and rivers of honey of undiluted purity; in it they will have fruit of every kind and forgiveness from their Lord. Is that like those who will be in the Fire timelessly, for ever, with boiling water to drink which lacerates their bowels?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The semblance of Paradise promised the pious and devout (is that of a garden) with streams of water that will not go rank, and rivers of milk whose taste will not undergo a change, and rivers of wine delectable to drinkers, and streams of purified honey, and fruits of every kind in them, and forgiveness of their Lord. Are these like those who will live for ever in the Fire and be given boiling water to drink which will cut their intestines to shreds?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Here is the parable of Paradise which the God-fearing have been promised: in it shall be rivers of incorruptible water, rivers of milk unchanging in taste, and rivers of wine, a delight to those that drink; and rivers of pure honey. In it they will have every kind of fruit as well as forgiveness from their Lord. Can such be like those who will abide in the Fire and will be given a boiling water to drink that will tear their bowels apart?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The garden, which is promised to the pious, is like one in which there are streams of unpolluted water, streams of milk of unchangeable taste, streams of delicious wine, and streams of crystal clear honey. Therein they will have all kinds of fruits and forgiveness from their Lord. On the other hand (can these people be considered like), those who will live forever in hell fire and will drink boiling water which will rip their intestines to bits?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A description of the Garden which is promised to the pious; in it are rivers of water which shall never pollute; and rivers of milk the taste of which shall never change; and rivers of wine delicious to drink; and rivers of purified honey; and in it for them are fruits of all kinds, and the forgiveness of their Lord; so will such ever be equal to those who are to stay in the fire for ever and who will be given boiling water to drink so that it tears their guts apart?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The description of Paradise which is promised to those who have Taqwa, (is that) in it are rivers of water that are not Asin, rivers of milk the taste of which never changes, rivers of wine delicious to those who drink it, and rivers of refined honey; and therein for them are all kinds of fruits, and forgiveness from their Lord. Can this be likened to those who abide eternally in the Fire and are given to drink boiling water that severs their intestines\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A parable of the garden which those guarding (against evil) are promised: Therein are rivers of water that does not alter, and rivers of milk the taste whereof does not change, and rivers of drink delicious to those who drink, and rivers of honey clarified and for them therein are all fruits and protection from their Lord. (Are these) like those who abide in the fire and who are made to drink boiling water so it rends their bowels asunder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the similitude of Paradise which the godfearing have been promised: therein are rivers of water unstaling, rivers of milk unchanging in flavour, and rivers of wine -- a delight to the drinkers, rivers, too, of honey purified; and therein for them is every fruit, and forgiveness from their Lord -- Are they as he who dwells forever in the Fire, such as are given to drink boiling water, that tears their bowels asunder?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A similitude of the Garden which those who keep their duty (to Allah) are promised: Therein are rivers of water unpolluted, and rivers of milk whereof the flavour changeth not, and rivers of wine delicious to the drinkers, and rivers of clear-run honey; therein for them is every kind of fruit, with pardon from their Lord. (Are those who enjoy all this) like those who are immortal in the Fire and are given boiling water to drink so that it teareth their bowels?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Here is a description of the Garden promised to the righteous: therein are rivers of water which is forever pure; and rivers of milk of which the taste never changes; and rivers of wine, a delight to those who drink it, and rivers of pure honey. And in it they will have all kinds of fruit, and will receive forgiveness from their Lord. Can those who enjoy such bliss be like those who abide in the Fire and who are given boiling water to drink so that it tears their bowels?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A likeness of the Garden which hath been promised to the God-fearing: therein are rivers of water incorruptible, and rivers of milk whereof the flavour changeth not, and rivers of wine: a joy Unto the drinkers; and rivers of honey clarified. theirs therein shall be every kind of fruit, and forgiveness from their Lord. ShAll Persons enjoying such bliss be like Unto those who are abiders in the Fire and are given to drink boiling water so that it mangleth their entrails?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A description of the paradise promised to the Godwary: therein are streams of unstaling water and streams of milk unchanging in flavour, and streams of wine delicious to the drinkers, and streams of purified honey; there will be every kind of fruit in it for them, and forgiveness from their Lord. [Are such ones] like those who abide in the Fire and are given to drink boiling water which cuts up their bowels?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Here is) a Parable of the Garden which the righteous are promised: in it are rivers of water incorruptible; rivers of milk of which the taste never changes; rivers of wine, a joy to those who drink; and rivers of honey pure and clear. In it there are for them all kinds of fruits; and Grace from their Lord. (Can those in such Bliss) be compared to such as shall dwell for ever in the Fire, and be given, to drink, boiling water, so that it cuts up their bowels (to pieces)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The description of Paradise which the Muttaqun (pious - see V. 2:2) have been promised is that in it are rivers of water the taste and smell of which are not changed; rivers of milk of which the taste never changes; rivers of wine delicious to those who drink; and rivers of clarified honey (clear and pure) therein for them is every kind of fruit; and forgiveness from their Lord. (Are these) like those who shall dwell for ever in the Fire, and be given, to drink, boiling water, so that it cuts up their bowels?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of the Paradise which the cautious have been promised in it, there are rivers of unstaling water, and rivers of milk that never change in flavor, and rivers of wine, delectable to the drinkers, and rivers of pure, filtered honey. They shall have therein of every fruit and forgiveness from their Lord. Are they then like he who shall live in the Fire for ever and given boiling water to drink that tears his bowels apart!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The likeness of the Garden promised to the righteous: in it are rivers of pure water, and rivers of milk forever fresh, and rivers of wine delightful to the drinkers, and rivers of strained honey. And therein they will have of every fruit, and forgiveness from their Lord. Like one abiding in the Fire forever, and are given to drink boiling water, that cuts-up their bowels?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is the description of Paradise, which the righteous are promised, wherein are rivers of water unaltered, rivers of milk the taste of which never changes, rivers of wine delicious to those who drink, and rivers of purified honey, in which they will have from all [kinds of] fruits and forgiveness from their Lord, like [that of] those who abide eternally in the Fire and are given to drink scalding water that will sever their intestines?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:15] A similitude, a description, of the Garden promised to the God-fearing: [the Garden] that is shared equally by all those who enter it (this first clause is the subject, of which the predicate [follows:]) therein are rivers of unstaling water (read āsin or asin, similar [in form] to dārib, ‘striker’, and hadhir, ‘cautious’), that is to say, one that does not change, in contrast to the water of this world, which may change due to some factor; and rivers of milk unchanging in flavour, in contrast to the milk of this world, on account of its issuing from udders, and rivers of wine delicious to the drinkers, in contrast to the wine of this world, which is distasteful to drink; and [also] rivers of purified honey, in contrast to the honey of this world, which when it issues out of the bellies of bees becomes mixed with wax and other elements; and there will be for them therein, varieties [of], every fruit and forgiveness from their Lord, for He is pleased with them, in addition to His beneficence towards them in the way mentioned, in contrast to one who is a master of servants in this world, who while being kind to them may at the same time be wrathful with them. [Is such a one] like him who abides in the Fire? (ka-man huwa khālidun fī’l-nāri, the predicate of an implied subject, which is a-man huwa fī hādha’l-na‘īm, ‘Is one who is amidst such bliss [as him who abides in the Fire]?’). And they will be given to drink boiling water which rips apart their bowels, that is, their entrails, so that these will be excreted from their rears. (Am‘ā’, ‘bowels’, is the plural of mi‘an, its alif being derived from the yā’ of their saying mi‘yān [as an alternative singular to mi‘an]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(A similitude of the Garden) the description of Paradise (which those who keep their duty (to Allah)) which those who ward off disbelief, idolatry and indecencies (are promised: Therein are rivers of water unpolluted) unpolluted in taste or smell, (and rivers of milk whereof the flavour changeth not) into a sour taste and pollen has not cause the offensive smell of its fat to spread, (and rivers of wine delicious to the drinkers) and this wine was not pressed with people's feet, (and rivers of clear run honey) without wax, yet it has not come from the bellies of bees; (therein for them) for the dwellers of Paradise (is every kind of fruit, with pardon from their Lord) of the sins which they committed in the life of the world. ((Are those who enjoy all this) like those who are immortal in the Fire) never to die therein nor leave; in reference here to Abu Jahl (and are given boiling water to drink so that it teareth their bowels?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِّن مَّآءٍ غَيْرِ آسِنٍ } معناه غيرُ مُتغيرٍ ولا مُنتنٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {from water that is not stagnant} means that it is neither changing nor decaying.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ مثل الجنّة } أي: صفة الجنة المطلقة المتناولة للجنان كلها { التي وعَدَ المتّقون } من الأصناف الخمسة المذكورة غير مرة { فيها أنهار من ماء غير آسن } أي: أصناف من العلوم والمعارف الحقيقية التي تحيا بها القلوب وتروى بها الغرائز كما تحيا بالماء الأرض وتروي الأحياء\n { غير آسن } غير متغيِّر بشوائب الوهميات والتشكيكات واختلاف الاعتقادات الفاسدة والعادات وهي للمتقين المجتبين من الصفات النفسانية الواصلين إلى مقام القلب { وأنهار من لبن لم يتغير طعمه } أي: من علوم نافعة متعلقة بالأفعال والأخلاق مخصوصة بالناقصين المستعدّين الصالحين للرياضة والسلوك في منازل النفس قبل الوصول إلى مقام القلب الاتّقاء عن المعاصي والرذائل كعلوم الشرائع والحكمة العملية التي هي بمثابة اللبن المخصوص بالأطفال الناقصين\n { لم يتغير طعمه } بشوب الأهواء والبدع واختلافات أهل المذاهب وتعصبات أهل الملل والنحل { وأنهار من خمر } أي: أصناف من محبة الصفات والذات { لذّة } أي: لذيذة { للشاربين } الكاملين البالغين إلى مقام مشاهدة حسن تجليات الصفات وشهود جمال الذات\n العاشقين المشتاقين إلى الجمال المطلق في مقام الروح والاستغراق في عين الجمع من المتّقين عن صفاتهم وذواتهم { وأنهار من عسل } أي: حلاوات الواردات القدسية والبوارق النورية واللذات الوجدانية في الأحوال والمقامات للسالكين الواجدين للأذواق والمريدين المتوجهين إلى الكمال قبل الوصول إلى مقام المحبة من الذين اتّقوا الفضول\n فإن الآكلين للعسل أكثر من الشاربين للخمر\n وليس كل من ذاق حلاوة العسل ذاق لذّة الخمر دون العكس { ولهم فيها من كل الثمرات } أي: أنواع اللذات من تجليات الأفعال والصفات والذات بأسرها كما قال الشاعر:\nلأن شهود المعذب وتجلي صفات القهر له لذة خاصة بمن ذاقها يعرفها من يعرفها وينكرها من ينكرها { ومَغْفرة من ربّهم } بستر هيئات المعاصي وتكفير سيئات الرذائل لأصحاب الألبان ثم بستر الأفعال أيضاً لأصحاب المياه\n ثم بمحو الصفات لأصحاب العسل وبعض أصحاب الخمر\n ثم بطمس ذنوب الأحوال والمقامات وإفناء البقيات وإخفاء ظهورها بالأنوار والتجليات لأهل الفواكه والثمرات ثم بإفناء الذات بالاستغراق في جمع الأحدية والاستهلاك في عين الهوية لشراب الخمور الصرفة وكلهم أصناف المتّقين { كمن هو خالد } كمن هو في مقابلتهم في دركات جحيم الطبيعة وشرب حميم الهوى",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n هكذا { فِيهَآ أَنْهَارٌ مِّن مَّآءٍ } هي: العلوم اللدنية المجيبة لهم بالحياة الأزلية الأبدية { غَيْرِ ءَاسِنٍ } أي: خالص صافٍ عن كدر التقليدات والتخمينات\n الحادث عن مقتضيات القوى البشرية المنغمسة بالعلائق الجسمانية { وَأَنْهَارٌ مِّن لَّبَنٍ } من المحبة الذوقية الإلهية\n المنتشئة من الفطرية الأصلية التي فطروا عليها في بدء ظهورهم { لَّمْ يَتَغَيَّرْ طَعْمُهُ } وذوقه بالميل إلى الهوى\n ومن مزخرفات الدنيا { وَأَنْهَارٌ مِّنْ خَمْرٍ } جذبة إلهية وشوق مفرط مسكر لهم\n محير لعقولهم من غاية استغراقهم بمطالعة جمال الله وجلاله\n بحيث لا يكتنه لهم وصفه بكونه من الأمور الذوقية { لَّذَّةٍ لِّلشَّارِبِينَ } حسب تفاوت أذواقهم ومواجيدهم { وَأَنْهَارٌ مِّنْ عَسَلٍ } هي: اليقين الحقي الذي لا شيء أحلى منه وألذ عند العرف المتحقق به { مُّصَفًّى } من شوب الإثنينية اللازمة لمرتبتي اليقين العلمي والعيني\n\n\n{ وَ } بالجملة: { لَهُمْ فِيهَا مِن كُلِّ ٱلثَّمَرَاتِ } المستلزمة لأنواع اللذات الروحانية\n وأكبر من الكل أن لهم فيها { وَمَغْفِرَةٌ } ستر ومحو لأنانياتهم الباطلة ناشئة { مِّن رَّبِّهِمْ } الذي رباهم على الكرامة من عنده بعدما جذبهم تحت قباب عزه\n ومكنهم من كنف جواره\n هؤلاء المكرمون بهذه الكرامة العظمى { كَمَنْ هُوَ خَالِدٌ فِي ٱلنَّارِ } أي: كالكافر الطاغي الباغي\n الذي خرج عن ربقة العبودية بمتابعة الأهوية الأمارة وأمانيها\n وظهر على الحق وأهله بأنواع الإنكار والاستكبار\n وبسبب هذا صار مخلداً في نار القطيعة\n مؤبداً فيها لا نجاة له عنها { وَ } هم من شدة عطشهم وحرقة أكبادهم إذا استسقوا { سُقُواْ مَآءً حَمِيماً } حاراً في غاية الحرارة { فَقَطَّعَ أَمْعَآءَهُمْ } [محمد: 15] بعدما شربوا منه\n وذلك لعدم الفهم واعتيادهم بالعلم اللدني وبرد اليقين العلمي والعيني والحقي\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "{ مثل }: مبتدأ حُذف خبره، أي: صفة الجنة ما تسمعون، وقدَّره سيبويه: فيما يُتلى عليكم مثل الجنة، وقيل: المثل زائد، أي: الجنة فيها أنهار... الخ، و { كمَن هو خالد }: خبر لمحذوف، أي: أَمَن هو خالد في هذه الجنة، كمَن هو خالد في النار؟ يقول الحق جلّ جلاله: { مَثلُ الجنةِ } أي: صفتها العجيبة، العظيمة الشأن { التي وُعدَ المتقون } الشركَ والمعاصي، هو ما نذكره لكم، { فيها أنهار من ماء غيرِ آسنٍ } غير متغير الطعم واللون والرائحة، يقال: أسن الماء: إذا تغير، سواء أنتن أم لا، فهو آسن وأسِن، { وأنهار من لبن لم يتغيّر طعمُه } كما تتغير ألبان الدنيا بالحموضة وغيرها، وانظر إذا تمنّاه كذلك مربّباً أو مضروباً. والظاهر: أنه يعطَاه كذلك، إذ فيها ما تشتهيه الأنفس. { وأنهارٌ من خبرٍ لذةٍ للشاربين } أي: لذيذة، ليس فيها كراهة طعم وريح، ولا غائلة سُكْرٍ، وإنما هي تلذُّذ محضٌ. و \" لذة \": إما تأنيث \" لذّ \" بمعنى لذيذ، أو: مصدر نُعت به للمبالغة. { وأنهار من عسل مُصفى } لم يخرج من بطون النحل فيخالطه شمع أو غيره، وفي حديث الترمذي:\n \" إنَّ في الجنة بحرَ الماء، وبحرَ اللبن، وبحرَ العسل، وبحرَ الخمر، ثم تُشَقَّقُ الأنهارُ بعدُ \" \nقال: حسن صحيح. وعن كعب: نهر دجلة من نهر ماء الجنة، والفرات نهر من لبنها، والنيل من نهر خمرها، وسَيْحان من نهر عسلها، والكل يخرج من الكوثر. قلت: ولعل الثالثة لمّا خرجوا إلى الدنيا تغيّر حالُهم، ليبقى الإيمان بالغيب. والله تعالى أعلم. قيل: بُدئ من هذه الأنهار بالماء لأنه لا يُستغنى عنه قط، ثم باللبن لأنه يجري مجرى المطعوم والمشروب في كثير من الأوقات، ثم بالخمر لأنه إذا حصل الريّ المطعومُ تشوقت النفسُ إلى ما يلتذ به، ثم بالعسل لأنه فيه الشفاء في الدنيا مما يعرض من المشروب والمطعوم فهو متأخر في الرتبة. { ولهم فيها } مع ما ذكر من فنون الأنعام { من كل الثمراتٍ } أي: صنف من كل الثمرات. { و } لهم { مغفِرةٌ } عظيمة { من ربهم } أي: كائنة من ربهم، فهو متعلق أي: مغفرة عظيمة من ربهم. وعبّر بعنوان المغفرة دون الرحمة إشعاراً بأن الميل إلى نعيم الأشباح نقص في الدارين يستوجب المغفرة. أيكون هذا { كمَن هو خالد في النار }؟ أو: مثل الجنة كمثل جزاء مَن هو خالد في النار؟ وهو كلام في صورة الإثبات، ومعناه: النفي، لانطوائه تحت حكم كلام مصدّر بحرف الإنكار، ودخوله في حيّزه، وهو قوله:\n[محمد: 14]، وفائدة حذف حرف الإنكار، زيادةُ تصويرٍ لمكابرة مَن يسوّي بين المتمسك بالبيّنة والتابع لهواه، وأنه بمنزلة مَن يُثبت التسوية بين الجنة، التي يجري فيها تلك الأنهار، وبين النار، التي يُسقى أهلها الحميم الحار، المُشار إليه بقوله: { وسُقوا ماءً حميماً } حارّاً في النهاية، إذا دنا منهم شوى وجوههم، ووقعت فروة رؤوسهم { فقَطَّع أمعاءهم } مصارينهم، التي هي مكان تلك الأشربة.\nنسأل الله العافية. الإشارة: مثل جنة المعارف، التي وُعدها المتقون كلَّ ما يشغل عن الله، فيها أنهار من ماء علوم الحقيقة، غير متغير صفاؤها، ولا متكدرة أنوارُها، وأنهار من لبن علوم الشريعة المؤيَّدة بالكتاب والسنّة، لم تتغير حلاوة معاملتها، ولا لذة مناجاتها، وأنهار من خمرة الشهود، لذة للشاربين لها، تذهل حلاوتها العقول، وتفوتُ عن مداركِ النقول، وأنها من عسل حلاوة المكالمة والمسارَرة والمناجاة، صافيات الأوقات، محفوظة من المكدرات، ولهم فيه من طُرف الحِكَم وفواكه العلوم، ما لا تحصيه الطروس، ولا تدركه محافل الدروس. قال القشيري: مثل الجنة أي: صفتها كذا، وللأولياء اليوم، لهم شراب الوفاء، ثم شراب الصفاء، ثم شراب الولاء، ثم شراب في حال اللقاء، ولكل من هذه الأشربة عملٌ، ولصاحبه سُكرٌ وصحوٌ، فمَن تحسّى شراب الوفاء لم ينظر إلى أحد من الخلق في أيام غيبته عن إحساسه، وأنشدوا:\nومَن شرب بكأس الصفا خلص له عن كل شوب بلا كدورة في عهده، فهو في كل وقت ظامئ عن نفسه، خالٍ عن مطالباته، قائم به، بلا شغل في الدنيا ولا في الآخرة، ومَن شرب كأس الولاء عدم فيه القرار، ولم يغب سيرُه لحظة، ليلاً ولا نهاراً، وَمن شرب في حال اللقاء أَنِسَ على الدوام ببقائه فلم يطلب مع بقائه شيئاً آخر، لا من عطائه ولا من لقائه لاستهلاكه في علائه عند سطوات كبريائه. هـ. قلت: أما شراب الوفاء فهو عَقد الإرادة مع الشيخ، أو عقد المحبة والخدمة مع الحق، فيجب الوفاء بكل منهما، وهو كشُرب العطشان من الماء العذب، وأما شراب الصفاء فهو صفاء العلم بالله، وهو كاللبن تتغذى به الأرواح في حال ترقيها إلى الحضرة، وأما شراب الولاء فهو شراب أهل التمكين من الولاية الكبرى، فيشربون من الخمرة الأزلية، فيسكرون، ثم يصحون، وفيها يقول الششتري رضي الله عنه:\nوأما شراب حال اللقاء فالمراد به، أوقات رجوعهم إلى البقاء، فيتفنّنون في علوم الحكمة وحلاوة المعاملة. والله تعالى أعلم. ثم شفع بأضدادهم، فقال: { وَمِنْهُمْ مَّن يَسْتَمِعُ إِلَيْكَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:66",
      "similarity": 0.17490690036468196
    },
    {
      "verse": "37:46",
      "similarity": 0.15147676147764982
    },
    {
      "verse": "43:71",
      "similarity": 0.13320687660134417
    },
    {
      "verse": "12:41",
      "similarity": 0.075685191687338
    },
    {
      "verse": "2:219",
      "similarity": 0.0626303307163049
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/47:15.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/47:15.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/47:15.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}