{
  "chapter": "محمد",
  "text": "ويقول الذين ءامنوا۟ لولا نزلت سورة فاذا انزلت سورة محكمة وذكر فيها القتال رايت الذين فى قلوبهم مرض ينظرون اليك نظر المغشى عليه من الموت فاولى لهم",
  "translations": [
    {
      "translation": "Those who have iman say, 'If only a sura could be sent down.' But when a straightforward sura is sent down and fighting is mentioned in it, you see those with sickness in their hearts looking at you with the look of someone about to faint from fear of death. More fitting for them",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe say: \"How is it no Surah was revealed?\" But when a categorical Surah is revealed that mentions war, you should see those who are sceptical staring at you like a man in the swoon of death. Alas the woe for them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers used to say: “Why is a surah (that would ordain fighting) not revealed?” But when a definitive surah was revealed wherein fighting was mentioned, you saw that those in whose hearts there was a sickness looked at you as though they were about to faint at the approach of death. Pity on them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers say, \"Why is a chapter about jihad - fighting for the cause of God - not revealed?\" But when such a chapter, with clear commands and a mention of jihad is revealed, you will see those whose hearts are sick look at you as if suffering the agony of death. One can expect nothing better from them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Muslims say, “Why was not a chapter sent down?” So when a positive chapter was sent down, and war was commanded in it, you will see those in whose hearts is a disease looking at you with the dazed looks of a dying man; so it would be better for them. –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe say: \"Why is not a Surah sent down (for us)\" But now that a decisive Surah is sent down mentioning fighting, you can see those in whose hearts is disease (of hypocrisy) looking at you with the look of one who is about to faint for fear of death. But it was better for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe say: Why has not a chapter been revealed? But when a decisive chapter is revealed, and fighting is mentioned therein you see those in whose hearts is a disease look to you with the look of one fainting because of death. Woe to them then!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe say, 'Why has a sura not been sent down?' Then, when a clear sura is sent down, and therein fighting is mentioned, thou seest those in whose hearts is sickness looking at thee as one who swoons of death; but better for them would be\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe say: If only a surah were revealed! But when a decisive surah is revealed and war is mentioned therein, thou seest those in whose hearts is a disease looking at thee with the look of men fainting unto death. Therefor woe unto them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe ask why no chapter [about fighting] has been sent down. Yet when a decisive chapter that mentions fighting is sent down, you can see the sick of heart looking at you [Prophet] as if they were under the shadow of death. Therefore, woe to them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe say wherefore hath not a Surah been revealed? Then when there is sent down a Surah firmly constructed, and fighting is mentioned therein, thou seest those in whose hearts is a disease looking at thee with the look of one swooning Unto death. So also for them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithful say, ‘If only a surah were sent down!’ But when a conclusive surah is sent down and war is mentioned in it, you see those in whose hearts is a sickness looking upon you with the look of someone fainting at death. So woe to them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe say, \"Why is not a sura sent down (for us)?\" But when a sura of basic or categorical meaning is revealed, and fighting is mentioned therein, thou wilt see those in whose hearts is a disease looking at thee with a look of one in swoon at the approach of death. But more fitting for them-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe say: \"Why is not a Surah (chapter of the Quran) sent down (for us)? But when a decisive Surah (explaining and ordering things) is sent down, and fighting (Jihad - holy fighting in Allah's Cause) is mentioned (i.e. ordained) therein, you will see those in whose hearts is a disease (of hypocrisy) looking at you with a look of one fainting to death. But it was better for them (hypocrites, to listen to Allah and to obey Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers ask: 'Has a chapter been sent down' But when a clear chapter is sent down and fighting is mentioned in it, you see those in whose hearts is sickness looking towards you as one who swoons at death.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe say, “If only a chapter is sent down.” Yet when a decisive chapter is sent down, and fighting is mentioned in it, you see those in whose hearts is sickness looking at you with the look of someone fainting at death. So woe to them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe say, \"Why has a surah not been sent down? But when a precise surah is revealed and fighting is mentioned therein, you see those in whose hearts is hypocrisy looking at you with a look of one overcome by death. And more appropriate for them [would have been]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:20] And those who believe say, seeking to take part in the struggle: ‘Why has a sūra not been revealed?’, [one] in which there is mention of the [command to participate in the] struggle. But when a definitive sūra is revealed, one in which nothing is abrogated (naskh), and fighting, that is to say, requirement for it, is mentioned in it, you see those in whose hearts is a sickness, that is, doubt — and they are the hypocrites — looking at you with the look of someone fainting at [the point of] death, because of [their] fear of it and [their] aversion to it; in other words, they fear fighting and are averse to it. Yet more fitting for them (faawlā lahum is a subject, the predicate of which [is the following, tā‘atun wa-qawlun ma‘rūfun])\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَيَقُولُ الَّذِينَ آَمَنُوا لَوْلَا نُزِّلَتْ سُورَةٌ فَإِذَا أُنْزِلَتْ سُورَةٌ مُحْكَمَةٌ وَذُكِرَ فِيهَا الْقِتَالُ رَأَيْتَ الَّذِينَ فِي قُلُوبِهِمْ مَرَضٌ يَنْظُرُونَ إِلَيْكَ نَظَرَ الْمَغْشِيِّ عَلَيْهِ مِنَ الْمَوْتِ فَأَوْلَى لَهُمْ (20({ لله وَمَثْوَاكُمْ \\* وَيَقُولُ الذين ءَامَنُواْ لَوْلاَ نُزِّلَتْ سُورَةٌ فَإِذَآ أُنزِلَتْ سُورَةٌ مُّحْكَمَةٌ وَذُكِرَ فِيهَا القتال رَأَيْتَ } { لَهُمْ \\* طَاعَةٌ وَقَوْلٌ مَّعْرُوفٌ فَإِذَا عَزَمَ الامر فَلَوْ صَدَقُواْ الله لَكَانَ خَيْراً لَّهُمْ }قد ذكرنا أن هذه السورة أنزلت بالمدينة وقد بدت قرون نفاق المنافقين ، فلما جرى في هذه السورة وصف حال المنافقين أعقب ذلك بوصف أجلى مظاهر نفاقهم ، وذلك حين يُدعَى المسلمون إلى الجهاد فقد يضيق الأمر بالمنافقين إذ كان تظاهرهم بالإسلام سيلجئهم إلى الخروج للقتال مع المسلمين ، وذلك أمر ليس بالهيّن لأنه تعرض لإتلافهم النفوس دون أن يَرْجُو منه نفعاً في الحياة الأبدية إذ هم لا يصدقون بها فيَصبحوا في حيرة . وكان حالهم هذا مخالفاً لحال الذين آمنوا الذي تمنوا أن يَنزل القرآن بالدعوة إلى القتال ليلاقوا المشركين فيشفوا منهم غليلهم ، فبهذه المناسبة حُكي تمني المؤمنين نزول حكم القتال لأنه يلوح به تمييز حال المنافقين ، ويبدو منه الفرق بين حال الفريقين وقد بين كره القتال لديهم في سورة براءة .فالمقصود من هذه الآية هو قوله : { فإذ أنزلت سورة محكمة وذُكِر فيها القتال رأيتَ الذين في قلوبهم مرض } الآية ، وما قبله توطئة له بذكر سببه ، وأفاد تقديمه أيضاً تنويهاً بشأن الذين آمنوا ، وأفاد ذكره مقابلةً بين حالي الفريقين جريا على سنن هذه السورة . ومقال الذين آمنوا هذا كان سبباً في نزول قوله تعالى : { فإذا لقِيتم الذين كفروا فضَربَ الرقاب } \\[ محمد : 4 \\] ، ولذلك فالمقصود من السورة التي ذكر فيها القتال هذه السورة التي نحن بصددها .ومعلوم أن قول المؤمنين هذا وقع قبل نزول هذه الآية فالتعبير عنه بالفعل المضارع : إمّا لقصد استحضار الحالة مثل { ويصنع الفلك } \\[ هود : 38 \\] ، وإما للدلالة على أنهم مستمرون على هذا القول . وتبعاً لذلك تكون { إذا } في قوله : { فإذا أنزلت سورة } ظرفاً مستعملاً في الزمن الماضي لأن نزول السورة قد وقع ، ونَظرُ المنافقين إلى الرسول صلى الله عليه وسلم هذا النظر قد وقع إذ لا يكون ذمهم وزجرهم قبل حصول ما يوجبه فالمقام دال والقرينة واضحة .و { لولا } حرف مستعمل هنا في التمني ، وأصل معناه التخصيص فأطلق وأريد به التمني لأن التمني يستلزم الحرصَ والحرصُ يدعو إلى التحضيض .وحذف وصف { سورة } في حكاية قولهم : { لولا نزلت سورة } لدلالة ما بعده عليه من قوله : { وذُكِر فيها القتال } لأن قوله { فإذا أنزلت سورة } ، أي كما تمنَّوا اقتضى أن المسؤول سورة يشرع فيها قتال المشركين . فالمعنى : لولا نزلت سورة يذكر فيها القتال وفرضه ، فحُذف الوصف إيجازاً . ووصف السورة ب { محكمة } باعتبار وصف آياتها بالإحكام ، أي عدم التشابه وانتفاء الاحتمال كما دلت عليه مقابلة المحكمات بالمتشابهات في قوله : { منه آيات محكمات هنّ أم الكتاب وأخر متشابهات }في سورة آل عمران ( 7 ( ، أي لا تحتمل آيات تلك السورة المتعلّقةُ بالقتال إلا وجوب القتال وعدم الهوادة فيه مثل قوله : { فإذا لَقِيتم الذين كفروا فضربَ الرقاب } \\[ محمد : 4 \\] الآيات ، فلا جرم أن هذه السورة هي التي نزلت إجابة عن تمنّي الذين آمنوا . وإنما قال : { وذُكِر فيها القتال } لأن السورة ليست كلها متمحضة لذكر القتال فإن سور القرآن ذوات أغراض شتّى .والخطاب في { رأيتَ } للنبيء صلى الله عليه وسلم لأنه لاحِقٌ لقوله تعالى : { ومنهم من يستمع إليك } \\[ الأنعام : 25 \\] .و { الذين في قلوبهم مرض } هم المبطنون للكفر فجعل الكفر الخفيّ كالمرض الذي مقره القلب لا يبدو منه شيء على ظاهر الجسد ، أي رأيت المنافقين على طريق الاستعارة . وقد غلب إطلاق هذه الصلة على المنافقين ، وأن النفاق مرض نفساني معضل لأنه تتفرع منه فروع بيناها في قوله تعالى : { في قلوبهم مرض } في سورة البقرة ( 10 ( .وانتصب نظر المغشي عليه من الموت } على المفعولية المطلقة لبيان صفة النظر من قوله : { ينظرون إليك } فهو على معنى التشبيه البليغ .ووجه الشبه ثبات الحدقة وعدم التحريك ، أي ينظرون إليك نظر المتحيّر بحيث يتجه إلى صوب واحد ولا يشتغل بالمرئيات لأنه في شاغل عن النظر ، وإنما يوجهون أنظارهم إلى النبي صلى الله عليه وسلم إذ كانوا بمجلسه حين نزول السورة ، وكانوا يتظاهرون بالإقبال على تلقي ما ينطق به من الوحي فلما سمعوا ذكر القتال بهتوا ، فالمقصود المشابهة في هذه الصورة . وفي معنى هذه الآية قوله تعالى : { فإذا جاء الخوف رأيتهم ينظرون إليك تدور أعينهم كالذي يُغشى عليه من الموت } في سورة الأحزاب ( 19 ( .ومِن } هنا تعليلية ، أي المغشي عليه لأجل الموت ، أي حضور الموت .وفرّع على هذا قوله : { فأولى لهم طاعة وقول معروف } . وهذا التفريع اعتراض بين جملة { ينظرون إليك نظر المغشي عليه من الموت } وبين جملة { فإذا عزم الأمر } .ولفظ { أوْلى } هنا يجوز أن يكون مستعملاً في ظاهره استعمال التفضيل على شيء غير مذكور يدل عليه ما قبله ، أي أولى لهم مِن ذلك الخوففِ الذي دَل عليه نظرهم كالمغشي عليه من الموت ، أن يطيعوا أمر الله ويقولوا قولاً معروفاً وهو قول { سمعنا وأطعنا } \\[ البقرة : 285 \\] فذلك القول المعروف بين المؤمنين إذا دُعُوا أو أمروا كما قال تعالى : { إنما كان قولَ المؤمنين إذا دُعُوا إلى الله ورسوله ليحكم بينهم أن يقولوا سمعنا وأطعنا } في سورة النور ( 51 ( .وعلى هذا الوجه فتعدية أولى } باللام دون الباء للدلالة على أن ذلك أولى وأنفع ، فكان اجتلاب اللام للدلالة على معنى النفع . فهو مثل قوله تعالى : { ذلك أزكى لهم } \\[ النور : 30 \\] وقوله : { هن أطهر لكم } \\[ هود : 78 \\] . وهو يرتبط بقوله بعده { فلو صدقوا الله لكان خيراً لهم } .ويجوز أن يكون { فأولى لهم } مستعملاً في التهديد والوعيد كما في قوله تعالى : { أوْلى لك فأوْلى ثم أولى لك فأولى }في سورة القيامة ( 34 ، 35 ( ، وهو الذي اقتصرَ الزمخشري عليه . ومعناه : أن الله أخبر عن توعده إياهم . ثم قيل على هذا الوجه إن أولى } مرتبة حروفه على حالها من الوَلْي وهو القرب ، وأن وزنه أفعل . وقال الجرجاني : هو في هذا الاستعمال مشتق من الويل . فأصل أولى : أويِل ، أي أشد ويلا ، فوقع فيه قلب ، ووزنه أفلع . وفي «الصحاح» عن الأصمعي ما يقتضي : أنه يَجعل ( أولى له ( مبتدأ محذوف الخبر . والتّقدير : أقرب ما يُهلكه ، قال ثعلب : ولم يقل أحد في ( أولى له ( أحسن مما قال الأصمعي .\n\n",
      "translations": [
        {
          "translation": "(And those who believe) in Muhammad (pbuh) and in the Qur'an, the sincere ones, (say: If only a surah were revealed) if only Gabriel would bring down a surah! They said this out of longing for the remembrance of Allah and wishing to engage in more acts of obedience. (But when a decisive surah is revealed) explaining the lawful and unlawful, the commands and prohibitions (and war is mentioned therein) and fighting is commanded therein, (thou seest those in whose hearts is a disease) i.e. doubt and hypocrisy (looking at thee) upon mentioning fighting (with the look of men fainting unto death) as people who are suffering the pangs of death because of their dislike of fighting the enemies. (Therefore woe unto them!) This is a threat to them with Allah's chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من معظم زاد يوم المعاد: الجهاد مع جنود أعداء الله في الأنفس والآفاق\n لذلك { يَقُولُ ٱلَّذِينَ آمَنُواْ } من كمال حرصهم وشغفهم على القتال\n وترويج كلمة التوحيد وإعلا دين الإسلام: { لَوْلاَ } وهلا { نُزِّلَتْ سُورَةٌ } مشتملة على الأمر بالجهاد حتى نجاهد في سبيل الله\n ونبذل غاية وسعنا في ترويج دينه { فَإِذَآ أُنزِلَتْ سُورَةٌ مُّحْكَمَةٌ } على مقتضى ما تمناها المخلصون { وَذُكِرَ فِيهَا ٱلْقِتَالُ } أي: أمر فيها على البت\n واستبشر المؤمنون المخلصون بنزولها\n واستعدوا لامتثالها وقبول ما فيها { رَأَيْتَ } يا أكمل الرسل حينئذ المنافقين { ٱلَّذِينَ فِي قُلُوبِهِمْ مَّرَضٌ } راسخ وضعف مستقر مستمر { يَنظُرُونَ إِلَيْكَ } حين تلاوتك وتبليغك إياهم ما يوحى إليك من ربك { نَظَرَ ٱلْمَغْشِيِّ عَلَيْهِ مِنَ ٱلْمَوْتِ } يعني: صاروا حين سمعوا الأمر القتال من كمال نفاقهم وشقاقهم كأنهم أشرفوا على الموت وظهرت عليه أماراته\n وشخصت أبصارهم من أهواله جبناً من القتال وبغضاً عليك { فَأَوْلَىٰ لَهُمْ } [محمد: 20] أي: قرب منهم وحاق بهم ما يكرهون ويخافون منه أولئك الأشقياء المردودون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ويقول الذين آمنوا لولا نُزَّلت سورةٌ } فيها ذِكر الجهاد\n وذلك أنَّ المؤمنين كان حرصُهم على الجهاد يبعثهم على تمني ظهور الإسلام\n وتمني قتال العدو\n فكانوا يأنسوا بالوحي\n ويستوحشون إذا أبطأ\n وكان المنافقون على العكس من ذلك\n { فإِذا أُنزلت سورةٌ } في معنى الجهاد { محكمةٌ } أي: مبيّنة غير متشابهة\n لا تحتمل وجهاً إلا وجوب الجهاد\n وعن قتادة: كل سورة فيها ذِكْر القتال فهي محكمة لأن النسخ لا يَردُّ عليها لأن القتال نسَخَ ما كان قبلُ من الصلح والمهادنة\n وهو غير منسوخ إلى يوم القيامة\n هـ\n { وذُكِر فيها القتالُ } أي: أُمر فيها بالجهاد { رأيتَ الذين في قلوبهم مرض } نفاق\n أي: رأيت المنافقين فيما بينهم يضجرون منها\n { ينظرون إِليك نظرَ المغشيِّ عليه من الموت } أي: تشخص أبصارُهم جُبناً وجَزعاً كما ينظر مَن أصابته الغشيةُ عند الموت\n قال القشيري: كان المسلمون تضيق صدورُهم لتأخر الوحي\n وكانوا يتمنون أن ينزل الوحيُ بسرعةٍ\n والمنافقون إذا ذُكر القتال يكرهون ذلك لما كان يشُق عليهم القتال\n فكانوا بذلك يفتضحون وينظرون إليه نظر المغشيِّ عليه من الموت أي: بغاية الكراهة لذلك\n { فأَوْلَى لهم } تهديد\n أي: الوعيد لهم هـ\n وقيل: المعنى: فويل لهم\n وهو أفعل\n من: الوَلْي\n وهو القرب\n والمعنى: الدعاءُ عليهم بأن يليَهم المكروه\n ويقربَ من ساحتِهم\n وقيل: أصله: أَوْيَل\n فقُلب\n فوزنه: أفلَع\n قال الثعلبي: يقال لمَن همّ بالعطَب ثم أفلت: أولى لك\n أي: قاربت العطَب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:124",
      "similarity": 0.4244825007931553
    },
    {
      "verse": "43:53",
      "similarity": 0.4186334949982842
    },
    {
      "verse": "9:127",
      "similarity": 0.40933778347132765
    },
    {
      "verse": "2:23",
      "similarity": 0.38286059557139607
    },
    {
      "verse": "24:1",
      "similarity": 0.3802052922936537
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/047020.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/047020.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/47:20.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}