{
  "chapter": "محمد",
  "text": "ذلك بانهم اتبعوا۟ ما اسخط الله وكرهوا۟ رضونه فاحبط اعملهم",
  "translations": [
    {
      "translation": "That is because they followed what angers Allah and hated what is pleasing to Him. So He made their actions come to nothing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because they followed what displeases God, and they were averse to pleasing Him. So We nullified their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they have followed a way that angered Allah, and have been averse to His good pleasure. So He reduced all their works to nought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "for their following that which had incurred God's anger, and their hatred to please God. Thus, God has made their deeds devoid of all virtue.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because they followed the matter which displeases Allah, and they disliked what pleases Him – He therefore squandered away all their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they followed that which angered Allah and hated what earns His pleasure, so He rendered their deeds worthless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they follow what is displeasing to Allah and are averse to His pleasure, therefore He has made null their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they have followed what angers God, and have been averse to His good pleasure, so He has made their works to fail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That will be because they followed that which angereth Allah, and hated that which pleaseth Him. Therefor He hath made their actions vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "because they followed the way that made God wrathful, and hated to adopt the way of His pleasure? So He made their actions come to nothing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they followed that which angered Allah and detested His good-will; so He made their works of non-effect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That, because they pursued what displeased Allah, and loathed His pleasure. So He has made their works fail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This because they followed that which called forth the Wrath of Allah, and they hated Allah's good pleasure; so He made their deeds of no effect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they followed that which angered Allah, and hated that which pleased Him. So He made their deeds fruitless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they follow what angers Allah and hate His pleasure, therefore He has annulled their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they pursued what displeases God, and they disliked His approval, so He nullified their works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they followed what angered Allah and disliked [what earns] His pleasure, so He rendered worthless their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:28] That, taking of them away in the state mentioned, is because they followed what angers God, and [because] they were averse to what pleases Him, that is to say, [they were averse to] doing what pleases Him. Therefore He has made their works fail.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That) smiting and punishment (will be because they followed that which angereth Allah) within Judaism, (and hated that which pleaseth Him) they denied His divine Oneness. (Therefore He hath made their actions vain) He annulled the good actions which they performed in their practice of Judaism; and it is also said that the above verses were revealed about the hypocrites who moved from Medina to Mecca because they changed their religion; and it is also said that it was revealed about the hypocrite al-Hakam Ibn Abi al-'As and his host who deliberated on one Friday about taking the leadership of the Muslim community after the Prophet (pbuh) and vowed to spread corruption. They did this while completely ignoring the Prophet who was on the pulpit delivering his sermon. And then, in mockery, asked 'Abdullah Ibn Mas'ud about what the Prophet (pbuh) said in his sermon.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فكيف إذا توفّتهم الملائكة } توفي الملائكة مخصوص بالقاطنين في مقام النفس المنخرطين في سلك الملكوت الأرضية أي: ما حيلتهم أو كيف يعملون إذ توفّتهم الملائكة الأرضية بقبض أرواحهم على الصفة المؤلمة المؤذية من جهتهم بالحجب عن الأنوار القدسية من وجوههم والمنع عما يميلون إليه من اللذات الحسية من أدبارهم إذ وجه النفس هو الجهة التي تلي القلب والضرب فيه هو الإيلام من جهته بالحجب عن أنواره وما فيه قرّة العين من تجليات الصفات والدبر هو الجهة التي تلي البدن والضرب فيه هو التعذيب من جهته بالحجز عن الجهة السفلية واللذات الحسية التي انجذبت إليها بالميل الطبيعي والهوى والحجب عنها بأخذ الآلات الموصلة إليها منهم { ذلِكَ } أي: ذلك الضرب والإيلام من الجهتين { بـ } سبب { أنهم اتّبعوا ما أسخط الله } من الانهماك في المعاصي والشهوات البدنية المبعدة عن جنابه\n فاستحقوا الضرب في الأدبار { وكرهوا رضوانه } الذي هو الانسلاخ عن صفاتهم للاتصاف بصفاته والتوجه إلى جنابه الموجب لمقام الرضا والقرب\n فاستحقوا الضرب في الوجوه\n { أم حسب الذين في قلوبهم مرض } لما كانت سراية هيئات النفس إلى البدن أسرع من تعدي هيئات البدن إلى النفس لكونها من الملكوت التي من شأنها التأثير وكون البدن من عالم الملك الذي من شأنه الانفعال لم يمكن إخفاء الأحوال النفسانية كما ترى من ظهور هيئات الغضب والمساءة والمسرّة على وجوه أصحابها لكن الجهل الذي هو من أصعب أمراض القلوب يغرّ صاحبه ويعميه فيحسب أنّ ما في قلبه من الغلّ والحقد والحسد يخفيه والله يظهرها على صفحات وجهه وفي فلتات لسانه كما قال النبي عليه السلام:\n \" ما أضمر أحد شيئاً إلا وأظهره الله في فلتات لسانه وصفحات وجهه \" \nوذلك معنى قوله: { فلعَرفتهم بسيمَاهم }  { ولتّعرفنهم في لحن القول } ولهذا قيل: لو بات أحد على معصية أو طاعة في مطمورة وراء سبعين باباً مغلقة لأصبح الناس يتقاولون بها لظهورها في سيماه وحركاته وسكناته وشهادة ملكاته بها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَلِكَ } التوفي على وجه العبرة { بِأَنَّهُمُ ٱتَّبَعُواْ مَآ أَسْخَطَ ٱللَّهَ } من الإعراض عن طريق الحق ومتابعة أهله { وَكَرِهُواْ } بمقتضى أهويتهم الفاسدة { رِضْوَٰنَهُ } أي: ما رضي عنه سبحانه من الأوامر والنواهي المنزلة على ألسنة رسله وكتبه بعدما خالفوا أمر الل وأمر رسوله { فَأَحْبَطَ } سبحانه بمقتضى قهره وجلاله { أَعْمَٰلَهُمْ } [محمد: 28] أي: صوالح أعمالهم\n ولم يترتب عليها الجزاء الموعود كما يرتب على صالحات أعمال المطيعين\n\n\n{ أَمْ حَسِبَ ٱلَّذِينَ فِي قُلُوبِهِمْ مَّرَضٌ } مستقر\n وحسد مؤبد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك } التوفِّي الهائل { بأنهم } بسبب أنهم { اتبعوا ما أسخط اللّهَ } من الكفر والمعاصي ومعاونة الكفرة\n { وكَرِهُوا رضوانه } من الطاعة والإيمان ونصر المؤمنين\n { فأَحْبَط } لأجل ذلك { أعمالَهم } التي عمِلوها حال الإيمان وبعد الارتداد\n من أعمال البر\n { أَمْ حَسِبَ الذين في قلوبهم مرضٌ } هم المنافقون الذين فصلت أحوالهم الشينعة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:80",
      "similarity": 0.7255167686306905
    },
    {
      "verse": "3:162",
      "similarity": 0.6814812629210435
    },
    {
      "verse": "9:58",
      "similarity": 0.5406918154133336
    },
    {
      "verse": "47:9",
      "similarity": 0.41753278280313866
    },
    {
      "verse": "6:88",
      "similarity": 0.2958791302733868
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/47:28.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/47:28.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/47:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}