{
  "chapter": "محمد",
  "text": "افلا يتدبرون القرءان ام على قلوب اقفالها",
  "translations": [
    {
      "translation": "Will they not then ponder the Qur'an or are there locks upon their hearts?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not ponder on what the Qur'an says? Or have their hearts been sealed with locks?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they, then, not reflect on the Qur'an? Or are there locks on their hearts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it that they do not think about the Quran or are their hearts sealed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do they not ponder the Qur’an deeply, or are there locks on some of their hearts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will they not then reflect upon the Qur'an, or are there locks upon their hearts\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not then reflect on the Quran? Nay, on the hearts there are locks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, do they not ponder the Koran? Or is it that there are locks upon their hearts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will they then not meditate on the Qur'an, or are there locks on the hearts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will they not, then, ponder over this Quran? Or are there locks upon their hearts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ponder then they not on the Qur'an, or are on the hearts locks thereof?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not contemplate the Quran, or are there locks on the hearts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not then earnestly seek to understand the Qur'an, or are their hearts locked up by them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not then think deeply in the Quran, or are their hearts locked up (from understanding it)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will they not then contemplate on the Koran? Or are there locks upon their hearts!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will they not ponder the Quran? Or are there locks upon their hearts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then do they not reflect upon the Qur'an, or are there locks upon [their] hearts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:24] Do they not contemplate the Qur’ān?, and so recognise the truth. Or (am here is like bal, ‘nay, but’) is it that there are locks on, their, hearts?, so they are unable to comprehend it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Will they then not meditate on the Qur'an) regarding that which has been revealed about them, (or are there locks on the hearts) or are there locks on the hearts of the hypocrites such that they do not understand what is revealed about them?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَ } يصرون أولئك المسرفون على الإعراض والانصراف عن الهدى { فَلاَ يَتَدَبَّرُونَ } ويتصفحون { ٱلْقُرْآنَ } ولا يتأملون ما فيه من المواعظ والتذكيرات المفيدة لهم، الموصلة إلى الهداية والنجاة من أهوال يوم القيامة حتى ينزجروا عن ارتكاب المعاصي، وينصرفوا عن الميل إليها { أَمْ عَلَىٰ قُلُوبٍ } أي: بل مختومة على قلوبهم { أَقْفَالُهَآ } [محمد: 24] مطبوعة عليها، لا تأثر لهم من القرآن ومواعيده، مع أنهم آمنوا له قبل نزوله على ما وجدوا في كتبهم نعته وعرفوا أحكامه، ومع ذلك أنكروا عليه وارتدوا عنه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أفلا يتدبرون القرآن } فيعرفون ما فيه من المواعظ والزواجر، حتى لا يقعوا فيما وقعوا فيه من الموبقات، { أم على قلوبٍ أقفالها } فلا يصل إليها وعظ أصلاً، و \" أم \" منقطعة، وما فيها من معنى \" بل \" للانتقال من التوبيخ على عدم التدبُّر إلى الوبيخ بكون قلوبهم مُقفلة، لا تقبل التدبُّر والتفكُّر، والهمزة للتقرير\n وتنكير \" قلوب \" ، إما لتهويل حالها، وتفظيع شأنها، بإبهام أمرها في الفساد والجهالة، كأنه قيل: قلوب منكرة لا يُعرف حالها، ولا يُقادر قدرُها في القسوة، إما لأنّ المراد بها قلوبُ بعض منهم، وهم المنافقون، وإضافة الأقفال إليها للدلالة على أنها مخصوصة بها، مناسبة لها، غير مجانسة لسائر الأفعال المعهودة\n قال القشيري: إذا تدبروا القرآنَ أفضى بهم إلى حس العرفان، وأزاحهم عن ظلمة التحيرُّ { أم على قلوب أقفالها } أقفَل الحقُّ على قلوب الكفار، فلا يدخلها زواجر التنبيه، ولا تنبسط عليها شعاعُ العلم، ولا يحصل فيهم الخطابُ، والبابُ إذا كان مُقفلاً، فكما لا يدخل فيه شيء لا يخرج ما فيه، كذلك هي قلوب الكفار مقفلة فلا الكفر الذي فيها يخرج، ولا الإيمان الذي يدعَوْن إليه يدخل في قلوبهم\n هـ\n وقال ابن عطية: هو الران الذي منعهم من الإيمان، ثم ذكر حكاية الشاب، وذلك أن وفْد اليمن قدم على النبي صلى الله عليه وسلم وفيهم شاب، فقرأ عليهم النبيُّ صلى الله عليه وسلم هذه الآية، فقال الشابُّ: عليها أقفالها حتى يفتحها الله ويُفْرجَها، قال عمر: فعَظُم في عيني، فما زالت في نفس عمر رضي الله عنه حتى وُلّي الخلافة، فاستعان بذلك الفتى\n هـ\n وفي الحديث:\n\n \" إذا أراد الله بعبد خيراً فتح له قُفل قلبه، وجعل فيه اليقين \"\n \n\nالإشارة: أهل التوجُّه والرياضة يفرحون بما ينزل بهم، مما يثقل على نفوسهم، كالفاقات والأزمات، وتسليط الخلق عليهم، وغير ذلك من النوائب لتموت نفوسهم فتحيا قلوبهم وأرواحهم بمعرفة الله، والذين في قلوبهم مرض كالوساوس والخواطر يفرُّون من ذلك، وينظرون - حين يرون أمارات ذلك - نظر المغشي عليه من الموت، فالأَوْلى لهم الخضوع تحت مجاري الأقدار، والرضا والتسليم لأحكام الواحد القهار، فإذا عزم الأمرُ بالتوجه إلى جهاد النفس، أو بالسفر إلى مَن يُداويها، فلو صدقوا في الطلب، وتوجّهوا للطبيب، لكان خيراً لهم\n\n\nفهل عسيتم إن توليتم وأعرضتم عن ذلك، ولم تُسافروا إلى الطبيب، أن تُفسدوا في الأرض بالمعاصي والغفلة، وتُقطعوا أرحامكم، إذا لا يصل رحِمَه حقيقةً إلا مَن صفا قلبه، ودخله الخوف والهيبة، أولئك الذي أبعدهم اللّهُ عن حضرتِه، فأصمَّهم عن سماع الداعي إلى الله، وأعمى أبصارهم عن رؤية خصوصيته، وأنوار معرفته، أفلا يتدبرون القرآن، فإنَّ فيه علومَ الظاهر والباطن، لكن إذا زالت عن القلوب الأقفال، وحاصلها أربعة: حب الدنيا، وحب الرئاسة، والانهماك في الحظوظ والشهوات، وكثرة العلائق والشواغل، فإن سَلِمَ من هذه صفا قلبُه، وتجلّت فيه أسرارُ معاني الذات والصفات، فيتدبّر القرآن، ويغوص في بحر أسراره، ويستخرج يواقيتَه ودرره\n وبالله التوفيق\n ثم ذكر مَن رجع بعد التوجُّه، فقال: { إِنَّ ٱلَّذِينَ ٱرْتَدُّواْ عَلَىٰ أَدْبَارِهِمْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:82",
      "similarity": 0.06843374765107477
    },
    {
      "verse": "23:68",
      "similarity": 0.06030389407175376
    },
    {
      "verse": "10:31",
      "similarity": 0.0593604149585277
    },
    {
      "verse": "17:46",
      "similarity": 0.059296970098286196
    },
    {
      "verse": "5:21",
      "similarity": 0.050773284457792583
    }
  ]
}