{
  "chapter": "محمد",
  "text": "طاعة وقول معروف فاذا عزم الامر فلو صدقوا۟ الله لكان خيرا لهم",
  "translations": [
    {
      "translation": "would be obedience and honourable words. Once the matter is resolved upon, being true to Allah would be better for them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obedience and modest speech (would have been more becoming). And when the matter has been determined it is best for them to be true to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They keep affirming their) obedience and saying good words. But when a course of action was clearly determined, it would have been better for them if they had proved true to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Since they have (pledged) Us obedience and to speak reasonably, it would be more proper for them, when it is decided (that everyone must take part in the battle), to remain true (in their pledge to God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To obey and speak good; so when the manifest command came – it would have been better for them if they had remained faithful to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obedience and good words. And when the matter is resolved, then if they had been true to Allah, it would have been better for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obedience and a gentle word (was proper); but when the affair becomes settled, then if they remain true to Allah it would certainly be better for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "obedience, and words honourable. Then, when the matter is resolved, if they were true to God, it would be better for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obedience and a civil word. Then, when the matter is determined, if they are loyal to Allah it will be well for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obedience and saying what is just would become them more; when the decision is taken, it would be better for them if they acted sincerely towards God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their obedience and speech are known. Then when the affair is determined, if even then they gave credence Unto Allah, it would have been better for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obedience and upright speech.... So when the matter has been resolved upon [concerning going to war], if they remain true to Allah that will surely be better for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it to obey and say what is just, and when a matter is resolved on, it were best for them if they were true to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obedience (to Allah) and good words (were better for them). And when the matter (preparation for Jihad) is resolved on, then if they had been true to Allah, it would have been better for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet obedience and honorable words (would be better for them). Then, when the matter is decided, if they were true to Allah it would be better for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obedience and upright speech. Then, when the matter is settled, being true to God would have been better for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obedience and good words. And when the matter [of fighting] was determined, if they had been true to Allah, it would have been better for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:21] would be [to offer] obedience and honourable words, that is, [words] that are kind to you. Then, when the matter has been resolved upon, that is to say, [when] fighting has been prescribed, if they are loyal to God, in faith and obedience, it will be better for them (the sentence beginning with law, ‘if’, constitutes the response to idhā, ‘when’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Obedience) He says: for the believers, this is an act of obedience towards Allah and His Messenger, (and a civil word) and kind word; it is also said that this means: the hypocrites' obedience of Allah and His Messenger and kind speech to the Prophet (pbuh) is better for them than transgression, disobedience and hatred; and it is also said this means: show obedience to Allah and say kind words to Muhammad (pbuh). (Then, when the matter is determined) when the matter is resolved, Islam becomes manifest and the Muslims are numerous, (if they) i.e. the hypocrites (are loyal to Allah) through their faith and jihad (it will be well for them) it will be better for them than transgression.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَإِذَا عَزَمَ ٱلأَمْرُ } معناه جَدَّ\n\n\n\n\nوقوله تعالى: { فَلَوْ صَدَقُواْ ٱللَّهَ } معناه ناصَحُوهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd when the matter is decided,\n\n\nAnd His saying, {If they had only believed in Allah}, means that they had been sincere to Him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوالأليق بحالهم في هذه الحالة: { طَاعَةٌ } أي: انقياد وإطاعة { وَقَوْلٌ مَّعْرُوفٌ } قبول مستحسن عند ذوي المروءات والفتوات لو صدر عنهم لكان خيراً لهم وأليق بحالهم لو كانوا مؤمنين، وبالجملة: { فَإِذَا عَزَمَ ٱلأَمْرُ } أي: جد ولزم أمر القتال { فَلَوْ صَدَقُواْ ٱللَّهَ } المطلع بما في ضمائرهم ونياتهم فيما اظهروا من الحرص والجرأة على القتال { لَكَانَ } الصدق والعزيمة { خَيْراً لَّهُمْ } [محمد: 21] في أولاهم وأخراهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله تعالى: { طاعةٌ وقولٌ معروف } استئناف، أي: طاعة لله وللرسول، وقولٌ معروف حسن خيرٌ لهم، أو: يكون حكايةَ قولِ المنافقين، أي: قالوا: أَمْرُنا طاعة وقول معروفٌ، قالوه نفاقاً، فيكون خبراً عن مضمر، وقيل: \" أَوْلَى \": مبتدأ، و \" طاعة \": خبره، وهذا أحسن، وهو المشهور من استعمال \" أَوْلى \" بمعنى: أحق وأصوب، أي: فالطاعة والقول المعروف أَوْلى لهم وأصوب\n { فإِذا عَزَمَ الأمرُ } أي: فإذا جدّ الأمر ولزمهم القتال { فَلَوْ صَدَقوا اللّهَ } في الإيمان والطاعة { لكان } الصدق { خيراً لهم } من كراهة الجهاد، وقيل: جواب \" إذا \" وهو العامل فيها - محذوف، أي: فإذا عزم الأمرُ خالفوا أو تخلّفوا، أو نافقوا، أو كرهوا\n { فهل عسيتم إِن توليتم أن تُفسداو في الأرض وتقطِّعوا أرحامكم } أي: فلعلكم إن أعرضتم عن دين الله وسنّة رسول الله صلى الله عليه وسلم أن ترجعوا إلى ما كنتم عليه في الجاهلية من الإفساد في الأرض، بالتغاور والتناهب، وقطع الأرحام، بمقاتلة بعض الأقارب بعضاً، أو: فهل عسيتم إن توليتم أمور الناس وتأمّرتم عليهم أن تُفسدوا في الأرض، تَفاخراً على الملك، وتهالكاً على الدنيا، فإن أحوالكم شاهدة بذلك من خراب الدين، والحرص على الدنيا\n\n\nقال في الحاشية الفاسية: والأشهر أنه من الولاية، أي: إن وُليتم الحكم، وقد جاء حديث أنهم قريش أخذ الله عليهم إن وُلوا أمر الناس ألا يُفسدوا، ولا يَقطعوا الأرحام، قاله ابن حجر\n هـ\n وخبر \" عسى \": \" أن تُفسدوا \" والشرط اعتراض بين الاسم والخبر، والتقدير: فهل عسيتم أن تُفسدوا في الأرض إن توليتم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:43",
      "similarity": 0.7822217772465637
    },
    {
      "verse": "2:227",
      "similarity": 0.6787302564619481
    },
    {
      "verse": "31:17",
      "similarity": 0.6638650453767349
    },
    {
      "verse": "20:115",
      "similarity": 0.5727119355684217
    },
    {
      "verse": "3:186",
      "similarity": 0.5527363801071398
    }
  ]
}