{
  "chapter": "محمد",
  "text": "ذلك بانهم قالوا۟ للذين كرهوا۟ ما نزل الله سنطيعكم فى بعض الامر والله يعلم اسرارهم",
  "translations": [
    {
      "translation": "This was so because they said to those who disdain what God has revealed: \"We shall obey you in some things.\" But God knows their secret intentions well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This, because they said to those who are averse to the faith that Allah has revealed: “In some matters we shall obey you.” Allah has full knowledge of their secret parleys.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because they have said to those who hate God's revelation, \"We shall obey you in some matters.\" But God knows all their secrets.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because they said to those who dislike what Allah has sent down, “We will obey you regarding one matter*”; and Allah knows their secrets. (* To fight against the Holy Prophet).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they said to those who hate what Allah has sent down: \"We will obey you in part of the matter.\" And Allah knows their secrets.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they say to those who hate what Allah has revealed: We will obey you in some of the affairs; and Allah knows their secrets.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they said to those who were averse to what God sent down, 'We will obey you in some of the affair'; and God knows their secrets.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they say unto those who hate what Allah hath revealed: We will obey you in some matters; and Allah knoweth their secret talk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "because they say to those who abhor what God has revealed, \"We will obey you in some matters.\" God knows their secrets.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they said Unto those who detest that which Allah hath revealed: we shall obey you in part of the affair; and Allah knoweth their talking in secret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they said to those who loathed what Allah had sent down: ‘We shall obey you in some matters,’ and Allah knows their secret dealings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This, because they said to those who hate what Allah has revealed, \"We will obey you in part of (this) matter\"; but Allah knows their (inner) secrets.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because they said to those who hate what Allah has sent down: \"We will obey you in part of the matter,\" but Allah knows their secrets.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they say to those averse to what Allah has sent down 'We shall obey you in some of the matters' Allah knows their secrets.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they said to those who hated what God has revealed, “We will obey you in certain matters.” But God knows their secret thoughts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they said to those who disliked what Allah sent down, \"We will obey you in part of the matter.\" And Allah knows what they conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:26] That, leading of them astray, is because they said to those who were averse to what God revealed, namely, to the idolaters: ‘We will obey you in some matters’, that is to say, by cooperating to maintain enmity against the Prophet (s) and preventing people from participating in the struggle alongside him: they had said as much secretly, but God, exalted be He, exposed it; and God knows their secrets (read asrārahum, as the plural of sirr, ‘a secret’, or isrārahum, ‘their keeping [of things] secret’, as the verbal noun).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "593 (That) reversion to their old religion (is because they) the Jews (say unto those who hate) who disbelieve in secret, i.e. the hypocrites (what Allah hath revealed) what did Allah send with Gabriel to Muhammad (pbuh): (We will obey you) we will help you, hypocrites, (in some matters) in the matter of Muhammad by saying \"there is no deity save Allah\" if he has the upper hand over us; (and Allah knoweth their secret talk) Allah knows the secret talk of the Jews with the hypocrites.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَلِكَ } التسويل والتغرير، وما يترتب عليه من الإعراض والانصراف عن الحق { بِأَنَّهُمْ } أي: بسبب أن اليهود والنصارى { قَالُواْ لِلَّذِينَ كَرِهُواْ } أي: المنافقين الذي كرهوا { مَا نَزَّلَ ٱللَّهُ } من السور المشتملة على أمر القتال؛ حثاً لهم على المخالفة والقعود { سَنُطِيعُكُمْ } ونعاون عليكم { فِي بَعْضِ ٱلأَمْرِ } لو أظهرتم المخالفة؛ يعني: إن أخذواكم وقصدوا الانتقام عنكم نحن نعاونكم، إنما قالوا ما قالوا في خلواتهم { وَٱللَّهُ } المطلع لعموم أحوالهم { يَعْلَمُ إِسْرَارَهُمْ } [محمد: 26] كما يعلم إعلانهم، هذا من جملة ما احتالوا ومكروا مع الله ورسوله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك بأنهم قالوا للذين كَرِهوا ما نزّل اللّهُ } الإشارة إلى ما ذُكر من ارتدادِهم، لا إلى الإملاء، ولا إلى التسويل - كما قيل - إذ ليس شيئاً منهما سبباً في القول الآتي أي: ذلك الارتداد بسبب أنهم - أي المنافقون - قالوا لليهود الذين كرهوا ما نَزَّل الله من القرآن على رسول الله صلى الله عليه وسلم بعدما علموا أنه من عند الله حسداً وطمعاً في نزوله عليهم: { سنُطيعكم في بعض الأمر } أي: عداوة محمد والقعود عن نصْرِ دينه، أو: في نصرهم والدفع عنهم إن نزل بهم شيء، من قِبَلهِ عليه السلام، وهو الذي حكاه عنهم بقوله تعالى:\n\n[الحشر: 11] الآية وهم بنو قريظة والنضير، الذين كانوا يُوالونهم ويُوادونهم، وإنما كانوا يقولون لهم ذلك سرّاً، كما ينبئ عنه قوله تعالى: { والله يعلم أسرارهم } أي: جميع أسرارهم التي من جملتها: قولهم هذا، وقرأ الأخوان وحفص بكسر الهمزة مصدر، أي: إخفاءَهم لما يقولون لليهود",
      "translations": []
    }
  ]
}