{
  "chapter": "محمد",
  "text": "والذين ءامنوا۟ وعملوا۟ الصلحت وءامنوا۟ بما نزل على محمد وهو الحق من ربهم كفر عنهم سيـاتهم واصلح بالهم",
  "translations": [
    {
      "translation": "But as for those who have iman and do right actions and have iman in what has been sent down to condition.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do the right, and believe what has been revealed to Muhammad, which is the truth from their Lord, will have their faults condoned by Him and their state improved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who attained to faith and did righteous works and believed in what was revealed to Muhammad -- which indeed is the Truth from their Lord -- Allah has remitted their evil deeds and has set their condition right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God forgives the sins and reforms the hearts of the righteously striving believers who have faith in what is revealed to Muhammad - which is the Truth from his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who accepted faith and did good deeds and believed in what has been sent down upon Mohammed (peace and blessings be upon him) – and that is the truth from their Lord – Allah has relieved them of some of their evils and refined their condition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do righteous good deeds, and believe in that which is sent down to Muhammad -- for it is the truth from their Lord -- He expiates from them their sins and amends their Bal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who believe and do good, and believe in what has been revealed to Muhammad, and it is the very truth from their Lord, He will remove their evil from them and improve their condition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do righteous deeds and believe in what is sent down to Muhammad -- and it is the truth from their Lord -- He will acquit them of their evil deeds, and dispose their minds aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and do good works and believe in that which is revealed unto Muhammad - and it is the truth from their Lord - He riddeth them of their ill-deeds and improveth their state.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do good deeds and believe in what has been revealed to Muhammad, and it is the truth from their Lord, God will remove their sins from them and set their condition right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and work righteous works and believe in that which hath been revealed Unto Muhammad -and it is the truth from their Lord- He shall expiate their misdeeds from them and shall make good their state.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who have faith and do righteous deeds and believe in what has been sent down to Muhammad—and it is the truth from their Lord—He shall absolve them of their misdeeds and set right their affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and work deeds of righteousness, and believe in the (Revelation) sent down to Muhammad - for it is the Truth from their Lord,- He will remove from them their ills and improve their condition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do righteous good deeds, and believe in that which is sent down to Muhammad (SAW), for it is the truth from their Lord, He will expiate from them their sins, and will make good their state.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the believers who do good works and believe in what is sent down to Muhammad which is the truth from their Lord He will acquit them of their sinsand repair their condition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "While those who believe, and work righteousness, and believe in what was sent down to Muhammad—and it is the truth from their Lord—He remits their sins, and relieves their concerns.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and do righteous deeds and believe in what has been sent down upon Muhammad - and it is the truth from their Lord - He will remove from them their misdeeds and amend their condition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:2] But those who believe, namely, the Helpers (al-Ansār) and others [like them], and perform righteous deeds and believe in what has been revealed to Muhammad, namely, the Qur’ān — and it is the truth from their Lord — He will absolve them of, He will forgive them, their misdeeds and rightly dispose their mind, their state, so that they do not disobey Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who believe) in Allah, Muhammad and the Qur'an (and do good works) acts of obedience, privately between them and their Lord: i.e. the Companions of Muhammad (pbuh) (and believe in that which is revealed unto Muhammad) and believe in that with which Allah sent down Gabriel to Muhammad (pbuh) (and it is) i.e. the Qur'an (the Truth from their Lord. He riddeth them of their ill deeds) i.e. their sins by means of jihad (and improveth their state) and improves their condition, intention and works in the life of he world; and it is said: He makes their matter manifest in Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَصْلَحَ بَالَهُمْ } معناه حَالهُم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - {And He has put right their affairs} - means their state.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ آمَنُواْ } بالله وبرسوله { وَ } مع ذلك { عَمِلُواْ ٱلصَّالِحَاتِ } المقربة لهم إلى الله { وَآمَنُواْ بِمَا نُزِّلَ عَلَىٰ مُحَمَّدٍ } أي: بجميع ما نزل عليه { وَ } صدقوا أن جميع ما نزل به { هُوَ ٱلْحَقُّ } الصدق المطابق للواقع\n النازل { مِن رَّبِّهِمْ } بلا شك وتردد { كَفَّرَ } وأزال { عَنْهُمْ } سبحانه { سَيِّئَاتِهِمْ } أي: وبالها وعذابها { وَأَصْلَحَ } اللاحق المستتبع إياها بها { بَالَهُمْ } [محمد: 2] أي: أحسن حالهم في الدين والدنيا بحسب النشأة الأولى والأخرى\n ويجازيهم أحسن الجزاء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { من ربهم }: من ضمير الحق\n وجملة { وهو\n\n\n } الخ: اعتراضية بين المبتدأ والخبر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "47:5",
      "similarity": 0.9023590063919404
    },
    {
      "verse": "20:51",
      "similarity": 0.8516214481012401
    },
    {
      "verse": "12:50",
      "similarity": 0.7394072674207538
    },
    {
      "verse": "34:6",
      "similarity": 0.13954918623655135
    },
    {
      "verse": "29:7",
      "similarity": 0.13325586015540852
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/47:2.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/47:2.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/47:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}