{
  "chapter": "محمد",
  "text": "فلا تهنوا۟ وتدعوا۟ الى السلم وانتم الاعلون والله معكم ولن يتركم اعملكم",
  "translations": [
    {
      "translation": "Do not become faint-hearted and call for peace when you are uppermost and Allah is with you - He would never cheat you of your deeds.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not become weak-kneed and sue for peace, for you will have the upper hand as God is with you and will not overlook your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, be not faint-hearted and do not cry for peace. You shall prevail. Allah is with you and will not bring your works to nought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be weak hearted and do not appeal for an (unjust) settlement; you have the upper hand. God is with you and He will never reduce the reward for your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore do not relax, nor call towards truce by yourself; and it is you who will dominate; and Allah is with you, and He will never cause a loss in your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not lose heart and beg for peace while you are superior. Allah is with you and He will never deprive you of (the reward of) your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not slack so as to cry for peace and you have the upper hand, and Allah is with you, and He will not bring your deeds to naught.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not faint and call for peace; you shall be the upper ones, and God is with you, and will not deprive you of your works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not falter and cry out for peace when ye (will be) the uppermost, and Allah is with you, and He will not grudge (the reward of) your actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not lose heart or appeal for peace when you have gained the upper hand. God is with you and will never let your works go to waste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore faint not, nor cry out for peace; and ye shall be triumphant. And Allah is with you, and He will not defraud you of your works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not slacken and [do not] call for peace when you have the upper hand and Allah is with you, and He will not stint [the reward of] your works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be not weary and faint-hearted, crying for peace, when ye should be uppermost: for Allah is with you, and will never put you in loss for your (good) deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be not weak and ask not for peace (from the enemies of Islam), while you are having the upper hand. Allah is with you, and will never decrease the reward of your good deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, do not be weakened and call out for peace, you shall be the upper ones, and Allah is with you and will not deprive you of your labors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not waver and call for peace while you have the upper hand. God is with you, and He will not waste your efforts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do not weaken and call for peace while you are superior; and Allah is with you and will never deprive you of [the reward of] your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:35] So do not falter, [do not] be weak, and [do not] call for peace (read salm or silm), that is to say, a truce with the disbelievers should you encounter them, when you have the upper hand (al-a‘lawna: the third letter of the triliteral root, wāw, has been omitted), [when you are] the victors, the vanquishers, and God is with you, helping and assisting, and He will not stint you, diminish you, in [the reward for] your works, that is to   say, of the reward for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So do not falter) do not weaken, believer, upon fighting the disbelievers (and cry out for peace) and it is said this means: for Islam before fighting (when you (will be) the uppermost) when you are the victorious and the ultimate consequence will be in your favour, (and Allah is with you) He helps you to defeat your enemy, (and He will not grudge (the reward of) your actions) and He will not diminish the works in which you engage during jihad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلاَ تَهِنُواْ } معناه تَضعُفوا\n\n\n\n\nوقوله تعالى: { وَلَن يَتِرَكُمْ أَعْمَالَكُمْ } معناه لَنْ يَنقُصْكُم وَلَنْ يَظْلمْكُم\n\n\n\n\nوقوله تعالى: { وَأَنتُمُ ٱلأَعْلَوْنَ } معناه الغَالِبونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Do not weaken\" - its meaning is \"do not be deficient.\"\n And His saying - exalted be He: {And your deeds will not be deprived} [means that] He will neither reduce [the reward of] your deeds nor will He wrong you.\n\n\nAnd His saying, \"You are the most exalted\" - this means that you are the victors.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأخلصتم في إطاعتكم وانقيادكم ثقوا واعتصموا بحبل توفيقه ونصره { فَلاَ تَهِنُواْ } ولا تضعفوا عن الجهاد والمقاتلة { وَ } لا { تَدْعُوۤاْ } وتركنوا { إِلَى ٱلسَّلْمِ } والصلح\n وبالجملة: لا تجنوا { وَأَنتُمُ ٱلأَعْلَوْنَ } الأغلبون\n أيها الموحدون المحمديون\n إذ الحق يعلو ولا يُعلى { وَ } كيف لا تتصفون بصفة العلو والغلبة\n إذ { ٱللَّهُ } المحيط بكم { مَعَكُمْ } لا على وجه المقارنة والاتحادن ولا على سبيل الحلول والامتزاج\n بل على وجه الظهور والبروز وامتداد الأظلال عليكم وانعكاسكم منها { وَ } بعدما صار الحق معكم على الوجه المذكور { لَن يَتِرَكُمْ } ولن يضيع عليكم { أَعْمَالَكُمْ } [محمد: 35] التي جئتم بها مخلصين\n طلباً لمرضاة الله وهرباً عن مساخطه\n إذ الموعد المعتدل دائماً بين الخوف والرجاء\n وكيف لا يكون كذلك\n إذ هو مستوٍ على مستن الصراط المستقيم الذي هو أدق وأرق من كل دقيق ورقيق\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فلا تَهِنُوا } لا تضعفوا عن الجهاد { وتدعوا إِلى السَّلْم } أي: لا تدعوا الكفار إلى الصلح والمسالمة فإن ذلك إعطاء الدنِيَّة - أي: الذلة - في الدين\n ويجوز أن يكون منصوباً بإضمار \" أن \" في جواب النهي أي: لا تهنوا مع إعطاء السلم\n { وأنتم الأَعْلَون } الأغلبون\n { واللّهُ معكم } بالنصر والمعونة\n ومَن كان غالباً ومنصوراً والله معه\n لا يتصور منه إظهار الذلة والضراعة لعدوه\n { ولن يَتِرَكُمْ أعمالكم } لن يضيعها\n من: وترت الرجل: إذا قتلت له قتيلاً\n من ولد أو أخ أو حميم\n فأفردته منه\n حتى صار وتراً\n عبّر عن ترك الإثابة في مقابلة العمل بالوتر\n الذي هو إضاعة شيء معتد به من الأنفس والأموال\n مع أن الأعمال غير موجبة للثواب على قاعدة أهل السُنَّة\n إبرازاً لغاية للطف\n بتصوير الثواب بصورة الحق المستحق\n وتنزيل ترك الإثابة منزلة إضاعة أعظم الحقوق وإتلافها\n سبحانه من رب رحيم!\n { إِنما الحياةُ لعبٌ ولهوٌ } لا ثبات لها\n ولا اعتداد بها\n فلا تُؤثروا حياتها الفانية على الحياة الأبدية بالموت في الجهاد الأصغر أو الأكبر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:3",
      "similarity": 0.7569116844795207
    },
    {
      "verse": "23:44",
      "similarity": 0.722147558639577
    },
    {
      "verse": "3:139",
      "similarity": 0.4162403031160263
    },
    {
      "verse": "8:18",
      "similarity": 0.37333428279620756
    },
    {
      "verse": "4:104",
      "similarity": 0.35648013480354435
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/047035.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/047035.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/47:35.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}