{
  "chapter": "محمد",
  "text": "ولنبلونكم حتى نعلم المجهدين منكم والصبرين ونبلوا۟ اخباركم",
  "translations": [
    {
      "translation": "We will test you until We know the true fighters among you and those who are steadfast and test what is reported of you.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall try you in order to know who are the fighters among you, and who are men of fortitude, and verify your histories.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall certainly test you until We know those of you who truly strive and remain steadfast, and will ascertain about you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall certainly test you until We know those who strive hard for the cause of God and those who exercise patience. We will also examine your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall indeed test you until We make known the warriors and the steadfast among you – and to test your proclamations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will surely, try you until We know those who strive among you and the patient, and We will put to a test all your affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most certainly We will try you until We have known those among you who exert themselves hard, and the patient, and made your case manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall assuredly try you until We know those of you who struggle and are steadfast, and try your tidings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We shall try you till We know those of you who strive hard (for the cause of Allah) and the steadfast, and till We test your record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most certainly We will try you until We have discovered those among you who strive their hardest, and those who are steadfast, and will test your record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of a surety We shall prove you all until We know the strivers among you and the steadfast, and We shall prove your states.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will surely test you until We ascertain those of you who wage jihad and those who are steadfast, and We shall appraise your record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall try you until We test those among you who strive their utmost and persevere in patience; and We shall try your reported (mettle).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely, We shall try you till We test those who strive hard (for the Cause of Allah) and the patient ones, and We shall test your facts (i.e. the one who is a liar, and the one who is truthful).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Without doubt We shall test you until We know those who struggle and are patient among you, and make clear your news.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will certainly test you, until We know those among you who strive, and those who are steadfast, and We will test your reactions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will surely test you until We make evident those who strive among you [for the cause of Allah] and the patient, and We will test your affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:31] And We will assuredly try you, We will assuredly test you by way of [commanding you to participate in] the struggle and in other ways, until We know, with knowledge outwardly manifested, those of you who struggle [for God’s cause] and those who are steadfast, in [adhering to] the struggle and in other ways, and We will appraise, We will reveal, your record, in terms of [whether you acted with] obedience or disobedience in what concerns the struggle (all three verbs may be read with the [third person singular] yā’ or with the [first person plural] nūn).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We shall try you) through fighting (till We know) until We distinguish (those of you) group of hypocrites (who strive hard (for the cause of Allah) and the steadfast) and those of you who are steadfast in war, (and till We test your record) and until We bring to light your secrets, hatred, enmity and contravention against Allah and His Messenger; and it is also said this means: until We bring to light your hypocrisy.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { حَتَّىٰ نَعْلَمَ ٱلْمُجَاهِدِينَ } معناه حتَّى نُميّزَ\n\n",
      "translations": [
        {
          "translation": " The saying of the Most High: {Until we know the Mujahideen} means until we distinguish",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولنبلونكم حتى نعلم } علم الله تعالى قسمان: سابق على معلوماته إجمالاً في لوح القضاء\n وتفصيلاً في لوح القدر\n وتابع إياها في المظاهر التفصيلية من النفوس البشرية والنفوس السماوية الجزئية\n فمعنى { حتى نعلم } حتى يظهر علمنا التفصيلي في المظاهر الملكوتية والإنسية التي يثبت بها الجزاء\n والله أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه مقسماً: { وَ } الله { لَنَبْلُوَنَّكُمْ } ونختبرنكم أيها المجبولون على فطرة الإسلام بالتكاليف الشاقة والأوامر الشديدة { حَتَّىٰ نَعْلَمَ } أي: نفرق ونميِّز { ٱلْمُجَاهِدِينَ } المتجهدين { مِنكُمْ } ببذل الوسع والطاقة على امتثال المأمور\n والصابرين المرابطين قلوبهم بحبل الله وتوحيده\n الموطنين نفوسهم بالرضا بجميع ما جرى عليهم من القضاء { وَٱلصَّابِرِينَ وَنَبْلُوَاْ } أيضاً { أَخْبَارَكُمْ } [محمد: 31] التي صدرت عنكم وقت تكليفنا إياكم\n إذ الأخبار منبئة عن الضمائر والأسرار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ولَنبلونَّكم } أي: والله لَنختبرنَّكم بالأمر بالجهاد\n ونحوه من التكاليف الشاقة\n أي: نعاملكم معاملة المختبر ليكون أبلغ في أظهار العدل\n { حتى نعلمَ المجاهدين منكم والصابرين } على مشاق الجهاد والتكاليف\n عِلماً ظاهراً\n يتعلق به الجزاء بعد تعلُّق العلم به في الأزل\n { ونبلوَ أخبارَكم } أي: ونختبر أسراركم بإظهار ما فيها من خير أو شر\n بالنهوض أو التخلُّف\n وقيل: أراد بأخباركم: أعمالكم\n عبّر بالأخبار عن الأعمال على سبيل الكناية لأن الإخبار تابع لوجود المخبر عنه\n إن كان الخبر حسناً كان المخبر عنه - وهو العمل - حسناً\n وإن كان الخبر قبيحاً فالمخبَر عنه قبيح\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:142",
      "similarity": 0.44481545815321694
    },
    {
      "verse": "24:53",
      "similarity": 0.4322880413180809
    },
    {
      "verse": "23:30",
      "similarity": 0.4304308950395261
    },
    {
      "verse": "37:106",
      "similarity": 0.4274389556300829
    },
    {
      "verse": "44:33",
      "similarity": 0.4261353348526283
    }
  ]
}