{
  "chapter": "محمد",
  "text": "انما الحيوة الدنيا لعب ولهو وان تؤمنوا۟ وتتقوا۟ يؤتكم اجوركم ولا يسـلكم امولكم",
  "translations": [
    {
      "translation": "The life of this world is merely a game and a diversion. If you have iman and taqwa, He will pay you your wages and not ask you for all your wealth.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the life of this world is no more than a sport and frivolity. If you believe and fear God, he will give you your reward, and will not ask for your possessions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is but sport and amusement. If you believe and are God-fearing, He will grant you your reward, and will not ask you for your possessions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The worldly life is only a childish game. If you have faith and piety, you will receive your rewards and God will not ask you to pay for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The worldly life is just a sport and pastime; and if you accept faith and be pious, He will bestow your rewards to you, and not at all ask you for your wealth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This worldly life is only amusement and diversion. And if you believe and have Taqwa of Allah, He will grant you your rewards, and will not ask from you (to sacrifice all of) your possessions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is only idle sport and play, and if you believe and guard (against evil) He will give you your rewards, and will not ask of you your possessions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The present life is naught but a sport and a diversion; and if you believe and are godfearing, He will give you your wages, and will not ask of you your goods.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of the world is but a sport and a pastime. And if ye believe and ward off (evil). He will give you your wages, and will not ask of you your wordly wealth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is only a game, a pastime, but if you believe and are mindful of God, He will recompense you and will not ask you for your wealth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of the world is but a sport and a pastime. And if ye believe and fear, He will give you your hire, and will not require of you your substance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of the world is just play and diversion, but if you are faithful and Godwary, He will give you your rewards, and will not ask your wealth [in return] from you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is but play and amusement: and if ye believe and guard against Evil, He will grant you your recompense, and will not ask you (to give up) your possessions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is but play and pastime, but if you believe (in the Oneness of Allah Islamic Monotheism), and fear Allah, and avoid evil, He will grant you your wages, and will not ask you your wealth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is but play and an amusement. If you believe and are cautious, He will give you your wage, and will not ask for your possessions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this word is nothing but play and pastime. But if you have faith and lead a righteous life, He will grant you your rewards, and He will not ask you for your possessions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This] worldly life is only amusement and diversion. And if you believe and fear Allah, He will give you your rewards and not ask you for your properties.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:36] The life of this world, that is to say, preoccupation [solely] with it, is merely play and diversion; but if you believe and are wary, of God, [both of] which pertain to [the goal of] the Hereafter, He will give you your rewards, and will not ask you your wealth [in return], all of it, rather, only the alms that are required from it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ وَإِنْ تُؤْمِنُوا وَتَتَّقُوا يُؤْتِكُمْ أُجُورَكُمْ وَلَا يَسْأَلْكُمْ أَمْوَالَكُمْ (36({ أعمالكم \\* إِنَّمَا الحياة الدنيا لَعِبٌ وَلَهْوٌ وَإِن تُؤْمِنُواْ وَتَتَّقُواْ يُؤْتِكُمْ أُجُورَكُمْ وَلاَ يَسْھَلْكُمْ } .تعليل لمضمون قوله : { فلا تهنوا وتدعوا إلى السلم } \\[ محمد : 35 \\] الآية ، وافتتاحها ب ( إنّ ( مُغننٍ عن افتتاحها بفاء التسبب على ما بينه في دلائل الإعجاز ، وليس اتصال ( إنّ ( ب ( ما ( الزائدة الكافة بمغيّر موقعها بدون ( ما ( لأنّ اتصالها بها زادها معنى الحصر .والمراد ب { الحياة } أحوال مدة الحياة فهو على حذف مضافَيْن .واللعب : الفعل الذي يريد به فاعله الهزل دون اجتناء فائدة كأفعال الصبيان في مرحهم .واللهو : العمل الذي يعمل لصرف العقل عن تعب الجد في الأمور فيلهو عن ما يهتم له ويكدّ عقله .والإخبار عن الحياة بأنها لعب ولهو على معنى التشبيه البليغ ، شُبهت أحوال الحياة الدنيا باللعب واللهو في عدم ترتب الفائدة عليها لأنها فانية منقضية والآخرة هي دار القرار .وهذا تحذير من أن يحملهم حب لذائذ العيش على الزهادة في مقابلة العدّو ويتلو إلى مسالمته فإن ذلك يغري العدّو بهم .وحبّ الفتى طول الحياة يذله ... وإن كان فيه نخوة وعِزَام{ وَلَهْوٌ وَإِن تُؤْمِنُواْ وَتَتَّقُواْ يُؤْتِكُمْ أُجُورَكُمْ وَلاَ يَسْھَلْكُمْ } { أموالكم \\* ؤإِن يَسْھَلْكُمُوهَا فَيُحْفِكُمْ تَبْخَلُواْ وَيُخْرِجْ أضغانكم } .الأشبه أن هذا عطف على قوله : { فلا تَهِنُوا وتدعُو إلى السلم } \\[ محمد : 35 \\] تذكيراً بأن امتثال هذا النهي هو التقوى المحمودة ، ولأن الدعاء إلى السلم قد يكون الباعث عليه حبّ إبقاء المال الذي ينفَق في الغزو ، فذُكروا هنا بالإيمان والتقوى ليخلعوا عن أنفسهم الوهن لأنهم نُهُوا عنه وعن الدعاء إلى السلم فكان الكف عن ذلك من التقوى ، وعطف عليه أن الله لا يسألهم أموالهم إلا لفائدتهم وإصلاح أمورهم ، ولذلك وقع بعده قوله : { ها أنتم هؤلاء تُدْعَوْن لتنفقوا في سبيل الله إلى قوله : { عن نفسه } \\[ محمد : 38 \\] ، على أن موقع هذه الجملة تعليل النهي المتقدم بقوله : { إنما الحياة الدنيا لعب ولهو } مشير إلى أن الحياة الدنيا إذا عمرت بالإيمان والتقوى كانت سبباً في الخير الدائم .والأجور هنا : أجور الآخرة وهي ثواب الإيمان والتقوى .فالخطاب للمسلمين المخاطبين بقوله : { فلا تهنوا } الآية .والمقصود من الجملة قوله : { وتتقوا } وأما ذكر { تؤمنوا } فللاهتمام بأمر الإيمان . ووقوع { تؤمنوا } في حيز الشرط مع كون إيمانهم حاصلاً يعين صرف معنى التعليق بالشرط فيه إلى إرادة الدوام على الإيمان إذ لا تتقوم حقيقة التقوى إلا مع سبق الإيمان كما قال تعالى : { فَكُّ رقبة أو إطعام إلى قوله : { ثم كان من الذين آمنوا } \\[ البلد : 13 17 \\] الآية .والظاهر أن جملة { يؤتِكم أجوركم } إدماج ، وأن المقصود من جواب الشرط هو جملة { ولا يسألكم أموالكم } . وعطف { ولا يسألكم أموالكم } لمناسبة قوله : { يؤتكم أجوركم } ، أي أن الله يتفضل عليكم بالخيرات ولا يحتاج إلى أموالكم ، وكانت هذه المناسبات أحسن روابط لنظم المقصود من هذه المواعظ لأن البُخل بالمال من بواعث الدعاء إلى السلم كما علمت آنفاً .ومعنى الآية : وإن تؤمنوا وتتقوا باتباع ما نهيتهم عنه يَرض الله منكم بذلك ويكتِف به ولا يسألكم زيادة عليه من أموالكم . فيعلمُ أن ما يعنيه النبي صلى الله عليه وسلم عليهم من الإنفاق في سبيل الله إنما هو بقدر طاقتهم . وهذه الآية في الإنفاق نظيرها قوله تعالى لجماعة من المسلمين في شأن الخروج إلى الجهاد { يا أيها الذين آمنوا ما لكم إذا قيل لكم انفروا في سبيل الله أثَّاقَلْتُم إلى الأرض أرضِيتُم بالحياة الدنيا من الآخرة فما متاع الحياة الدنيا في الآخرة إلا قليل } في سورة براءة ( 38 ( .فقوله : ولا يسألكم أموالكم } يفيد بعمومه وسياقه معنى لا يسألكم جميع أموالكم ، أي إنما يسألكم ما لا يجحِف بكم ، فإضافة أموال وهو جمع إلى ضمير المخاطبين تفيد العموم ، فالمنفي سؤال إنفاق جميع الأموال ، فالكلام من نفي العموم لا من عموم النفي بقرينة السياق ، وما يأتي بعده من قوله : { ها أنتم هؤلاء تُدْعَوْن لتنفقوا في سبيل الله } الآية .ويجوز أن يفيد أيضاً معنى : أنه لا يطالبكم بإعطاء مال لذاته فإنه غني عنكم وإنما يأمركم بإنفاق المال لصالحكم كما قال : { ومن يبخل فإنما يَبْخل عن نفسه والله الغني وأنتم الفقراء } \\[ محمد : 38 \\] . وهذا توطئة لقوله بعده { ها أنتم هؤلاء تُدعون لتنفقوا في سبيل الله إلى قوله : { فإنما يبْخل عن نفسه } \\[ محمد : 38 \\] أي ما يكون طلب بذل المال إلا لمصلحة الأمة ، وأية مصلحة أعظم من دمغها العدّو عن نفسها لئلا يفسد فيها ويستعبدها .وأما تفسير سؤال الأموال المنفي بطلب زكاة الأموال فصرف للآية عن مهيعها فإن الزكاة مفروضة قبل نزول هذه السورة لأن الزكاة فرضت سنة اثنتين من الهجرة على الأصح .\n\n",
      "translations": [
        {
          "translation": "(The life of the world) that which is in the life of the world (is but a sport) vain sport (and a pastime) and exultation which does not last. (And if ye believe) and if you are steadfast in your faith in Allah and His Messenger (and ward off (evil)) disbelief, idolatry and indecencies, (He will give you your wages) He will give you the reward of your works, (and will not ask of you your worldly wealth) all your worldly wealth to give to charity.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمعت صفة صراط ربك يا أكمل الرسل { إِنَّمَا ٱلْحَيَٰوةُ ٱلدُّنْيَا } أي: ما الحياة الدنيا إلا { لَعِبٌ } يعلب بها أبناء بقعة الإمكان وهم غافلون عن حقيقتها { وَلَهْوٌ } يهلى ويحير قلوبهم في تيه الغفلة والضلال\n وهم تائهون فيها ساهون عمَّن ظهر عليها { وَ } بعدما سمعتم نبذاً من أوصاف دنياكم { إِن تُؤْمِنُواْ } بوحدة الحق وبكمالات أسمائه وصفاته الظاهرة آثارها على هياكل الهوايات المستحقة في الكائنات\n وتوكلوا عليه مفوضين أموركم كلها إليه\n واتخذوه وكيلاً واتخذوه كفيلاً\n واعتصموا بحبل توفيقه ثقة واعتماداً { وَتَتَّقُواْ } أي: تحفظوا أنفسكم عن الميل إلى ما سوى الحق من الأماني العاطلة الإمكانية\n العائقة الدنية الدنيوية\n المثمرة لغضب الحق بمقتضى قدرته الجليلة { يُؤْتِكُمْ } بمقتضى إرادته الجليلة الجميلة { أُجُورَكُمْ } التي استوجبتم بصوالح أعمالكم\n ويزيد عليكم تفضلاً وإحساناً ما لا مزيد عليكم من اللذات الروحانية { وَلاَ يَسْأَلْكُمْ } ويطلب منكم بمقابلة ما أفاض عليكم من الكرامات { أَمْوَٰلَكُمْ } [محمد: 36] أي: جميعها\n بل مقدار ما يزكي بها نفوسكم ويطيب لها قلوبكم من الشح المفرط والميل المتبالغ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِن تؤمنوا وتتقوا يؤتكم أجوركم } أي: ثواب إيمانكم وأعمالكم من الباقيات الصالحات\n التي فيها يتنافس المتنافسون\n { ولا يسألكم أموالَكمْ } بحيث يُخل أداؤها بمعايشكم\n وإنما سألكم نزراً يسيراً هو ربع العشر\n تؤدونه إلى فقرائكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:64",
      "similarity": 0.7782840178385813
    },
    {
      "verse": "6:32",
      "similarity": 0.7532476928249432
    },
    {
      "verse": "80:10",
      "similarity": 0.5531546131351887
    },
    {
      "verse": "102:1",
      "similarity": 0.5470494213741016
    },
    {
      "verse": "63:9",
      "similarity": 0.5297285467025156
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/047036.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/047036.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/47:36.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}