{
  "chapter": "محمد",
  "text": "ذلك بان الذين كفروا۟ اتبعوا۟ البطل وان الذين ءامنوا۟ اتبعوا۟ الحق من ربهم كذلك يضرب الله للناس امثلهم",
  "translations": [
    {
      "translation": "That is because those who are kafir follow falsehood whereas those who have iman follow the truth from their Lord. In that way Allah makes comparisons for mankind.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because those who refuse to believe only follow what is false; but those who believe follow the truth from their Lord. That is how God gives men precepts of wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because those who disbelieved followed falsehood whereas those who believed followed the Truth that came to them from their Lord. Thus does Allah set forth to people parables showing their true state.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because the disbelievers have followed falsehood and the believers have followed the Truth from their Lord. Thus God explains to the human being their own prospects.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because the disbelievers followed falsehood and the believers followed the Truth which is from their Lord; this is how Allah illustrates the examples of people to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because those who disbelieve follow falsehood, while those who believe follow the truth from their Lord. Thus does Allah set forth for mankind their parables.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because those who disbelieve follow falsehood, and have given them their dowries, taking (them) in marriage, not fornicating nor taking them for paramours in secret; and whoever denies faith, his work indeed is of no account, and in the hereafter he shall be one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because those who disbelieve follow falsehood, and those who believe follow the truth from their Lord. Even so God strikes their similitudes for men.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because those who disbelieve follow falsehood and because those who believe follow the truth from their Lord. Thus Allah coineth their similitudes for mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because the ones who deny the truth follow falsehood, while those who believe follow the Truth from their Lord. Thus God sets forth comparisons for mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because those who disbelieve follow the falsehood, and those who believe follow the truth from their Lord. And thus Allah propoundeth Unto mankind their similitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because the faithless follow falsehood, and the faithful follow the truth from their Lord. That is how Allah draws comparisons for mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This because those who reject Allah follow vanities, while those who believe follow the Truth from their Lord: Thus does Allah set forth for men their lessons by similitudes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because those who disbelieve follow falsehood, while those who believe follow the truth from their Lord. Thus does Allah set forth their parables for mankind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because the unbelievers follow falsehood while the believers follow the truth from their Lord. As such Allah sets forth for people their examples.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because those who disbelieve follow falsehoods, while those who believe follow the truth from their Lord. God thus cites for the people their examples.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because those who disbelieve follow falsehood, and those who believe follow the truth from their Lord. Thus does Allah present to the people their comparisons.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:3] That, rendering void of their works and the absolution of evil deeds, is because those who disbelieve follow falsehood, Satan, and because those who believe follow the truth, the Qur’ān, from their Lord. Thus, in the same manner of clarification, does God strike for mankind similitudes of themselves, [that is how] He clarifies for them their states, in other words, the disbeliever has his work rendered void while the believer is forgiven.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah explained why He thwarts the works of the disbelievers, saying: (That is because those who disbelieve) in Muhammad (pbuh) and the Qur'an (follow falsehood) i.e. ascribing partners to Allah (and because those who believe) in Muhammad (pbuh) (follow the Truth from their Lord) i.e. the Qur'an. (Thus Allah coineth) thus Allah present (their similitudes) the similitudes of those who came before them: how Allah had destroyed them when they denied the messengers (for mankind) for the community of Muhammad (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱتَّبَعُواْ ٱلْبَاطِلَ } معناه الشّيطانُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Follow the false one\" - meaning Satan.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَلِكَ } أي: إضلال الكفرة وإصلاح المؤمنين { بِأَنَّ ٱلَّذِينَ كَفَرُواْ ٱتَّبَعُواْ ٱلْبَاطِلَ } وتركوا الحق الحقيق بالاتباع { وَأَنَّ ٱلَّذِينَ آمَنُواْ ٱتَّبَعُواْ ٱلْحَقَّ } النازل { مِن رَّبِّهِمْ } لإصلاح حالهم في النشأتين ويرشدهم إلى ما هو خير لهم { كَذَلِكَ } أي: مثل ذلك الذي سمعت من الإضلال والإصلاح بالنسبة إلى كلا الفريقين { يَضْرِبُ ٱللَّهُ لِلنَّاسِ أَمْثَالَهُمْ } [محمد: 3] وبين لهم أحوالهم المتواردة عليهم في أولاهم وأخراهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n } الخ: اعتراضية بين المبتدأ والخبر، و { ذلك }: مبتدأ، و { بأن }: خبر\n يقول الحق جلّ جلاله: { الذين كفروا وصَدوا عن سبيل الله } أي: أعرضوا وامتنعوا عن الدخول في الإسلام، أو صدُّوا غيرهم عنه\n قال الجوهري: صدّ عنه، يَصِدّ، صُدُوداً: أعْرَض، وصدَّهُ عن الأمر صَدّاً، مَنَعَه، وصَرَفه عنه\n هـ\n وهم المطعمون يوم بدر، أو: أهل الكتاب، كانوا يصدون مَن أراد الدخول في الإسلام، منهم ومن غيرهم، أو عام في كل مَن كفر وصدّ، فهؤلاء { أضلَّ أعمالهم } أي: أحبطها وأبطلها، أي: جعلها ضالة ضائعة، ليس لها مَن يتقبلها ويُثيب عليها، كضالة الإبل\n وليس المعنى أنه أبطلها بعد أن لم تكن كذلك، بل بمعنى: أنه حكم ببطلانها وضياعها، فإنَّ ما كانوا يعملونه من أعمال البر، كصِلة الأرحام، وقِرى الضيف، وفك الأسارى، وغيرها من المكارم، ليس لها أثر من أصلها لعدم الإيمان، أو: أبطل ما عملوا من الكيد برسول الله صلى الله عليه وسلم، والصد عن سبيله، بنصر رسوله، وإظهار دينه على الدين كله، وهو الأوفق بقوله:\n\n[محمد: 8]\n { والذين آمنوا وعملوا الصالحات } قيل: هم ناس من قريش، وقيل: من الأنصار، وقيل: مَن آمن مِن أهل الكتاب، والمختار أنه عام، { وآمَنوا بما نُزِّل على محمد } صلى الله عليه وسلم، وهو القرآن، وخُصّ بالذكر من بين ما يجب الإيمان به تنويهاً بشأنه، وتنبيهاً على سُمو مكانه من بين ما يجب الإيمان به، وأنه الأصل في الكل ولذلك أكّده بقوله: { وهو الحق من ربهم } أي: القرآن: لكونه ناسخاً لغيره من الكتب، وقيل: دين محمد صلى الله عليه وسلم إذ لا يرد عليه النسخ، وهو ناسخ لسائر الأديان، { كفَّر عنهم سيئاتهم } أي: ستر بالإيمان والعمل الصالح ما كان منهم من الكفر والمعاصي لرجوعهم عنها بالتوبة { وأصلح بالهم } أي: حالهم وشانهم، بالتوفيق لأمور الدين، وبالتسليط على الدنيا، بما أعطاهم الله من النصرة والعزة والتمكين في البلاد\n { ذلك بأن الذين كفروا اتَّبعوا الباطلَ وأنَّ الذين آمنوا اتَّبعوا الحق من ربهم } أي: ذلك الأمر، وهو إضلال أعمال أهل الكفر، وتفكير سيئات أهل الإيمان، وإصلاح شأنهم كائن بسبب اتباع هؤلاء الباطلَ وهو الشيطان، حيث فعلوا ما فعلوا من الكفر والصد، واتباع هؤلاء الحق، وهو القرآن، أو ما جاء به صلى الله عليه وسلم، أو يراد بالباطل: الزائل الذاهب من الدّين الفاسد، وبالحق: الدين الثابت، أو يراد بالباطل: نفس الكفر والصد، وبالحق: نفس الإيمان والأعمال الصالحة\n { كذلك } أي: مثل الضرب البديع { يضرب اللّهُ } أي: يُبين { للناس أمثالهم } أي: أحوال الفريقين، وأوصافهما، الجارية في الغرابة مجرى الأمثال، وهو اتباع الأولين الباطلَ، وخيبتهم وخسرانهم، واتباع الآخرين الحقَّ، وفوزهم وفلاحهم، والضمير راجع إل الناس، أو إلى المذكورين من الفريقين، على معنى: أنه يضربُ أمثالهم لأجل الناس ليعتبروا بهم، وقد جعل اتباع الباطل مثلاً لعمل الكافرين، واتباع الحق مثلاً لعمل المؤمنين، أو جعل الإضلال مثلاً لخيبة الكفار، وتكفير السيئات مثلاً لفوز الأبرار\n\n\nالإشارة: الذين كفروا بوجود الخصوصية، وصدُّوا الناسَ عنها أبطل سيرهم إليه، فكلما ساروا رجعوا، والذين آمنوا الإيمان الكامل واتعبوا السنّة النبوية، ستر مساوئهم، وأصلح شأنهم، حتى صلحوا لحضرته\n قال القشيري: الذين كفروا: امتنعوا، وصدُّوا: مَنَعوا، فلامتناعهم عن الله استوجبوا العقوبة، ولمنعهم الخلق عن الله استوجبوا الحَجْبَةَ\n ثم قال في قوله: { وأصلح بالهم } فالكفر للأعمال مُحْبطٌ، والإيمان للخلود مُسْقِط، ويقال: الذين اشتغلوا بطاعة الله، ولم يعملوا شيئاً مما خالف اللّهَ - فلا محالة - يقوم الله بكفاية أشغالهم\n هـ\n وقوله تعالى: { ذلك بأنَّ الذين كفروا اتبعوا الباطل\n\n\n } الآية، قال الورتجبي: اتبع الكفرة ما وقع في مخايلهم، من هواجس النفس، ووساوس الشيطان، ولا يقبلون طرائق الرشد من حيث الوحي والإلهام، وأنَّ الذين صدقوا في دين الله، وشاهدوا الله بالله، واتبعوا سنّة رسوله وخطابه، وما يقع في أسرارهم من النور والبيان، والإلهام والكلام، بنعت الإخلاص في طاعته، والأدب في خدمته والإعراض عن غيره، قال ابن عطاء: اتباع الباطل: ارتكاب الشهوات وأمالي النفس، واتباع الحق: اتباع الأوامر والسنن\n هـ\n قال القشيري: اتباع الحق بموافقة السنة، ومتابعة الجد في رعاية الحق وإيثار رضاه، والقيام بالطاعة، واتباع الباطل: الابتداع والعمل بالهوى، وإيثار الحظوظ وارتكاب المعصية\n هـ\n ثم أقرَّ بجهاد مَن كفر وصَدَّ، فقال: { فَإِذَا لَقِيتُمُ ٱلَّذِينَ كَفَرُواْ فَضَرْبَ ٱلرِّقَابِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:58",
      "similarity": 0.7067184616319276
    },
    {
      "verse": "22:62",
      "similarity": 0.4910945152045058
    },
    {
      "verse": "31:30",
      "similarity": 0.4910945152045058
    },
    {
      "verse": "47:33",
      "similarity": 0.48009255467544026
    },
    {
      "verse": "16:74",
      "similarity": 0.47803330439872366
    }
  ]
}