{
  "chapter": "محمد",
  "text": "هانتم هؤلاء تدعون لتنفقوا۟ فى سبيل الله فمنكم من يبخل ومن يبخل فانما يبخل عن نفسه والله الغنى وانتم الفقراء وان تتولوا۟ يستبدل قوما غيركم ثم لا يكونوا۟ امثلكم",
  "translations": [
    {
      "translation": "Here you are then: people who are called upon to spend in the Way of Allah and then some of you are tight-fisted! But whoever is tight-fisted is only tight-fisted to himself. Allah is Rich and you are poor. If you turn away, He will replace you with a people other than yourselves and they will not be like you.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beware! You are called to spend in the way of God, yet some among you close their fists. But he who is niggardly is so for his own self: God is above need, and it is you who are needy. If you turn away then God will bring other people in your place who, moreover, will not be like you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, you are those who are called upon to spend in Allah's Way, but some of you are niggardly. Whoever is niggardly is in fact niggardly to himself. For Allah is All-Sufficient, whereas it is you who are in need of Him. If you turn away, He will replace you by a people other than you, and they will not be like you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is you who are asked to spend for the cause of God, but some of you behave in a niggardly way. Whoever behaves miserly does so against his own soul. God is Self-sufficient and you are poor. If you were to turn away from Him, He would just replace you with another people, who will not be like you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes, undoubtedly it is you who are being called, that you may spend in Allah’s way; so some among you act miserly; and whoever is miserly, is being a miser upon himself; and Allah is the Independent (Wealthy – Not requiring anything), whereas you all are needy; and if you renege, He will replace you with other people – and they will not be like you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Here you are now invited to spend in Allah's cause; but among you are those who withhold (stingily). And whoever acts stingily is but stingy toward himself. For Allah is indeed free of needs, while you are the needy. And if you turn away, He will replace you with other people; then they will not be like you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! you are those who are called upon to spend in Allah's way, but among you are those who are niggardly, and whoever is niggardly is niggardly against his own soul; and Allah is Self-sufficient and you have need (of Him), and if you turn back He will bring in your place another people, then they will not be like you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ha, there you are; you are called upon to expend in God's way, and some of you are niggardly. Whoso is niggardly is niggardly only to his own soul. God is the All-sufficient; you are the needy ones. If you turn away, He will substitute another people instead of you, then they will not be your likes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! ye are those who are called to spend in the way of Allah, yet among you there are some who hoard. And as for him who hoardeth, he hoardeth only from his soul. And Allah is the Rich, and ye are the poor. And if ye turn away He will exchange you for some other folk, and they will not be the likes of you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! You are those who are called upon to spend for God's cause, but among you are those who are niggardly, and whoever stints does so against his own self. Indeed, God is self-sufficient, but you stand in need [of Him], and if you turn back, He will bring in your place another people, who will not be like you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! ye are those who are called to expend in the way of Allah, then there are of you some who are niggardly. And whosoever is niggardly is niggardly only to himself. And Allah is Self-sufficient, and ye are the needy. And if ye turn away, He will substitute for you another people, and then they will not be the likes of you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ah! There you are, being invited to spend in the way of Allah; yet among you there are those who are stingy; and whoever is stingy is stingy only to himself. Allah is the All-sufficient, and you are all-needy, and if you turn away He will replace you with another people, and they will not be like you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, ye are those invited to spend (of your substance) in the Way of Allah: But among you are some that are niggardly. But any who are niggardly are so at the expense of their own souls. But Allah is free of all wants, and it is ye that are needy. If ye turn back (from the Path), He will substitute in your stead another people; then they would not be like you!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! You are those who are called to spend in the Cause of Allah, yet among you are some who are niggardly. And whoever is niggardly, it is only at the expense of his ownself. But Allah is Rich (Free of all wants), and you (mankind) are poor. And if you turn away (from Islam and the obedience of Allah), He will exchange you for some other people, and they will not be your likes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There you are! You are called upon to spend in the Way of Allah. Some of you are mean; yet whoever is mean is mean only to his own soul. Allah is theRich and you are the poor. If you turn away, He will replace you with another nation, and they will not be like you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Here you are, being called to spend in the cause of God. Among you are those who withhold; but whoever withholds is withholding against his own soul. God is the Rich, while you are the needy. And if you turn away, He will replace you with another people, and they will not be like you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Here you are - those invited to spend in the cause of Allah - but among you are those who withhold [out of greed]. And whoever withholds only withholds [benefit] from himself; and Allah is the Free of need, while you are the needy. And if you turn away, He will replace you with another people; then they will not be the likes of you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:38] Lo! there you are, O, those who are being called to expend in the way of God, that which has been prescribed for you; yet among you there are those who are niggardly; and whoever is niggardly is niggardly only to his own soul (one may say bakhila ‘alayhi or [bakhila] ‘anhu [to mean, ‘he was niggardly to someone’]). For God is the Independent One, [without need] of your expending; while you are the needy, of Him. And if you turn away, from obedience to Him, He will replace you with another people, that is to say, He will bring them in your place, and they will not be the likes of you, in turning away from obedience to Him, but [they will be] obedient to Him, Mighty and Majestic [is He]. Medinese: it was revealed on the return from al-Hudaybiyya; it consists of 29 verses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! ye are those who are called to spend in the way of Allah) in obedience of Allah, (yet among you there are some who hoard) there are some who refrain from spending in obedience of Allah. (And as for him who hoardeth) and refrains from spending in obedience of Allah, (he hoardeth only from his soul) he is miserly only insofar as reward for, and honour of, his soul are concerned. (And Allah is the Rich) He has no need for your wealth and charity, (and ye are the poor) for Allah's mercy, Paradise and forgiveness. (And if ye turn away) from obeying Allah and obeying His Messenger regarding that which He commands you of spending (He will exchange you for some other folk) He will make you perish and replace you with others who are better and more obedient than you, (and they will not be the likes of you) in relation to transgression and disobedience; rather, they will be better and more obedient than you. It is also said that from Allah's saying (0 ye who believe) to the end were revealed about the hypocrites of Asad and Ghatafan, and so Allah replaced them with Juhaynah and Muzaynah who were better and more obedient to Allah'. And of the surah in which Victory is mentioned, which is all Medinan, and consists of 29 verses, 560 words and 2,400 letters: Surah 48: Victory (al-Fath) And of the surah in which Victory is mentioned, which is all Medinan, and consists of 29 verses, 560 words and 2,400 letters: 595\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وبعد وصول الدعوة إليكم { فَمِنكُم مَّن يَبْخَلُ } أي: يمنع ولم يعط بل يظهر ما يضمر في نفسه من الضغن والحقد\n\n\n{ وَ } بالجملة: { مَن يَبْخَلْ } من مال بعدما أمر بإنفاقه { فَإِنَّمَا يَبْخَلُ عَن نَّفْسِهِ } إذ نفع الإنفاق وضرر البخل كلاهما عائد إليها { وَٱللَّهُ ٱلْغَنِيُّ } المستغنى بذاته عن هموم صدقاتكم ومطلق طاعاتكم وعباداتكم { وَأَنتُمُ ٱلْفُقَرَآءُ } المقصورون على الفقر والاحتياج الذاتي إلى ما عنده سبحانه من أنواع الإنعام والإحسان { وَ } بعدما بلغت لهم يأكمل الرسل ما بلغت من مقتضيات الوحي والإلهام الإلهي { إِن تَتَوَلَّوْاْ } وتنصرفوا عن الإيمان وامتثال عموم المأمورات { يَسْتَبْدِلْ قَوْماً غَيْرَكُمْ } أي: يهلككم ويقيم بدلكم قوماً يؤمنون ويقيمون بامثتال الأوامر والنواهي { ثُمَّ } لما علموا واعتبروا منكم وشاهدوا مقتكم وهلاككم { لاَ يَكُونُوۤاْ أَمْثَالَكُم } [محمد: 38] كافرين بالله كفاراً لنعمه ولحقوق كرمه\n\nخاتمة السورة\n\nعليك أيها القاصد نحو طريق التوحيد\n العازم على سلوك سبيل الفناء المثمر للبقاء الذاتي - أوصلك الله إلى غاية مبتغاك ونهاية ممتناك - أن تعتدل في عموم أوصافك وأخلاقك\n سيما في أحوالك التي تتعلق بالإنفاق المأمور عليك بمقتضى الحكمة والعدالة الإلهية\n الناشئة من الله عن محض الإرادة والرضا\n وإياك إياك البخل والتقتير\n فإنه الجالب لحلول غضب الله ونزول أنواع سخطه بمقتضى قهره وجلاله\n فعليك الامتثال بالمأمور\n والاتكال على الملك الرحيم الغفور",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { هؤلاء }: موصول بمعنى \" الذين \" \n وصلته: { تُدْعَون } أي: أنتم الذي تُدعون { لتُنفقوا في سبيل الله } هي النفقة في الغزو والزكاة\n كأنه قيل: الدليل على أنه لو أحفاكم لبخلتم أنكم تدعون إلى أداء ربع العشر\n { فمنكم مَن يبخلُ } أي: فمنكم ناس يبخلون به\n { ومَن يبخلْ } بالصدقة وأداء الفريضة { فإِنما يبخلُ على نفسه } فإنَّ كُلاًّ مِن نفع الإنفاق وضرر البخل عائد إليه\n وفي حديث الترمذي:\n \" السخي قريبٌ من الله\n قريب من الجنة\n قريب من الناس\n بعيد من النار\n والبخيل بعيد من الله\n بعيد من الجنة\n بعيد من الناس\n قريب من النار\n ولجاهلٌ سخيٌّ أحبُّ إلى الله من عابدٍ بخيل \" \nوفي رواية:\n \" من عالم بخيل \" \nوالبخيل يتعدّى بـ \" عن \" \n و \" على \" لتضمُّنه معنى: الإمساك والعدي\n { والله الغنيُّ } عن كل ما سواه\n ويفتقر إليه كُلَّ ما عداه\n { وأنتم الفقراءُ } أي: إنه - تعالى - لا يأمر بذلك لحاجته إليه لأنه الغنيُّ عن الحاجات\n ولكن لحاجتكم وفقركم إلى الثواب\n { وإِن تَتولَّوا } أي: وإن تُعرضوا أيها العرب عن طاعته\n وطاعة رسوله\n والإنفاق في سبيله { يستبدل قوماً غيرَكم } يخلف قوماً خيراً منكم وأطوع\n { ثم لا يكونوا أمثالكم } في الطاعة\n بل أطوع\n راغبين فيما يقرب إلى الله ورسوله\n وهم فارس\n وسئل رسول الله صلى الله عليه وسلم عن هؤلاء القوم - وكان سلمان إلى جنبه\n فضرب على فخذه\n فقال: \" هذا وقومه\n والذي نفسي بيده لو كان الإيمان بالثُريا لتناوله رجالٌ من فارس \"\n قلت: صدق الصادق المصدوق\n فكم خرج منهم من جهابذة العلماء\n وأكابر الأولياء\n كالجنيد\n إما الصوفية\n والغزالي\n حَبر هذه الأمة\n وأضرابهما\n وقيل: الملائكة\n وقيل: الأنصار\n وقيل: كندة\n وقيل: الروم\n والأول أشهر\n الإشارة: { يا أيها الذين آمنوا أطيعوا الله وأطيعوا الرسول } أو خليفته\n وهو الداعي إلى الله على بصيرة العيان\n ولا تُبطلوا أعمالكم\n برجوعكم عن السير\n بترك المجاهدة قبل المشاهدة\n إنَّ الذين كفروا بوجود خصوصية التربية\n وصدُّوا الناسَ عنها\n ثم ماتوا على ذلك\n لن يستر اللّهُ مساوئهم\n ولا يُغيّبهم عن شهود نفوسهم التي حجبتهم عن الله\n فلا تهنوا: ولا تضعُفوا\n أيها المترفهون\n عن مجاهدة نفوسكم\n فينقطع سيركم\n وذلك بالرجوع إلى الدنيا\n ولا تدعوا إلى السلم والمصالحة بينكم وبين نفوسكم\n وأنتم الأعلون\n قد أشرفتم على الظفر بها\n والله معكم لقوله:\n[العنكبوت: 69] ولن ينقصكم شيئاً من أعمالكم\n بل يُريكم ثمرتها\n عاجلاً وآجلاً\n ولا يفترنَّكم عن المجاهدة طولُ الأمل\n\nإنما الحياة الدنيا لعب ولهو أي: ساعة من نهار\n وإن تُؤمنوا بكل ما وعدَ اللّهُ\n وتتقوا كل ما يشغل عن الله\n يُؤتكم أجوركم عاجلاً وآجلاً\n ولا يسألكم الداعي إليه جميعَ أموالكم\n إنما يسألكم ما يَخف عليكم\n تُقدموه بين يدي نجواكم\n ولو سألكم جميع أموالكم لبخلتم\n ويُخرج إضغانكم\n وهذا في حق عامة المريدين\n وأما الخاصة الأقوياء\n فلو سُئلوا أرواحَهم لبذلوها\n واستحقروها في جنب ما نالوا من الخصوصية\n وأما أموالهم فأهون عندهم من أن يبخلوا بشيء منها\n ويُقال لعامة الطالبين للوصول: { ها أنتم هؤلاء تُدعون\n\n\n } الآية\n قال القشيري: والله الغني لذاته بذاته\n ومن غنائه: تمكُّنه من تنفيذ مُراده\n واستغناؤه عما سواه\n وأنتم الفقراء إلى الله\n في نعمة الإيجاد\n ونعمة الإمداد\n في الابتداء ليخلقكم\n وفي الوسط ليُربيكم\n وفي الانتهاء يفنيكم عن أنانيتكم\n ويُبقيكم بهويته\n فالله غني عنكم من الأزل إلى الأبد\n وأنتم الفقراء محتاجون إليه من الأزل إلى الأبد\n هـ\n وإن تتولوا عن السير\n وتركنوا إلى الرخص والشهوات قبل التمكين\n يستبدل قوماً غيركم\n يكونوا أحزم منكم\n وأشد مجاهدة\n صادقين في الطلب\n ثابتين القَدم في آداب العبودية\n قد أدركتهم جذباتُ العناية\n وهَبَّتْ عليهم ريحُ الهداية\n ثم لا يكونوا أمثالكم في التولِّي والضعف\n حتى يصلوا إلى مولاهم\n وبالله التوفيق\n وهو الهادي إلى سواء الطريق\n وصلّى لله على سيدنا ومولانا محمد وآله وصحبه وسلّم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "57:24",
      "similarity": 0.652350598796582
    },
    {
      "verse": "92:8",
      "similarity": 0.6398804361579348
    },
    {
      "verse": "9:76",
      "similarity": 0.5983663868333815
    },
    {
      "verse": "4:37",
      "similarity": 0.4550431717071856
    },
    {
      "verse": "35:15",
      "similarity": 0.4137958169962415
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/47:38.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/47:38.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/47:38.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}