{
  "chapter": "محمد",
  "text": "يايها الذين ءامنوا۟ اطيعوا۟ الله واطيعوا۟ الرسول ولا تبطلوا۟ اعملكم",
  "translations": [
    {
      "translation": "You who have iman! obey Allah and obey the Messenger. Do not make your actions of no worth.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, obey God and the Prophet, and do not waste your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, obey Allah and obey the Messenger and do not cause your works to be nullified.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, obey God and the Messenger and do not invalidate your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Obey Allah and obey the Noble Messenger, and do not render your deeds void.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Obey Allah, and obey the Messenger and invalidate not your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! obey Allah and obey the Apostle, and do not make your deeds of no effect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, obey God, and obey the Messenger, and do not make your own works vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Obey Allah and obey the messenger, and render not your actions vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, obey God and obey the Messenger: do not let your deeds go to waste --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye who believe! obey Allah and obey the apostle, and render not Your works vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Obey Allah and obey the Apostle, and do not render your works void.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Obey Allah, and obey the messenger, and make not vain your deeds!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Obey Allah, and obey the Messenger (Muhammad SAW) and render not vain your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, obey Allah and His Messenger and never let your labors go in vain!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! obey God, and obey the Messenger, and do not let your deeds go to waste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, obey Allah and obey the Messenger and do not invalidate your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:33] O you who believe! Obey God and obey the Messenger, and do not render your own works void, by [engaging in] acts of disobedience, for example.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا أَيُّهَا الَّذِينَ آَمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَلَا تُبْطِلُوا أَعْمَالَكُمْ (33(اعتراض بين جملة { إن الذين كفروا وصدوا عن سبيل الله وشاقوا الرسول } \\[ محمد : 32 \\] ، وبين جملة { إن الذين كفروا وصدوا عن سبيل الله ثم ماتُوا وهم كفار } \\[ محمد : 34 \\] وُجه به الخطاب إلى المؤمنين بالأمر بطاعة الله ورسوله صلى الله عليه وسلم وتجنب ما يبطل الأعمال الصالحة اعتباراً بما حكي من حال المشركين في الصد عن سبيل الله ومشاقة الرسول صلى الله عليه وسلمفوصف الإيمان في قوله : { يا أيها الذين آمنوا } مقابل وصف الكفر في قوله : { إن الذين كفروا } \\[ محمد : 32 \\] ، وطاعة الله مقابل الصدّ عن سبيل الله ، وطاعةُ الرسول ضد مشاقة الرسول صلى الله عليه وسلم والنهي عن إبطال الأعمال ضد بطلان أعمال الذين كفروا . فطاعة الرسول صلى الله عليه وسلم التي أمروا بها هي امتثال ما أمَر به ونهَى عنه من أحكام الدين . وأما ما ليس داخلاً تحت التشريع فطاعة أمر الرسول صلى الله عليه وسلم فيه طاعة انتصاح وأدب ، ألا ترى أن بريرة لم تطع رسول الله صلى الله عليه وسلم في مراجعة زوجها مُغيث لما علمتْ أن أمره إياها ليس بعزم .والإبطال : جعل الشيء باطلاً ، أي لا فائدة منه ، فالإبطال تتصف به الأشياء الموجودة .ومعنى النهي عن إبطالهم الأعمالَ : النهي عن أسباب إبطالها ، فهذا مهيع قوله : { ولا تبطلوا أعمالكم } . وتسمح محامِله بأن يشمل النهي والتحذير عن كل ما بيَّن الدِينُ أنه مبطل للعمل كلاًّ أو بعضاً مثل الردة ومثل الرياء في العمل الصالح فإنه يبطل ثوابه . وهو عن ابن عباس قال تعالى : { يا أيها الذين آمنوا لا تبطلوا صدقاتكم بالمن والأذى } \\[ البقرة : 264 \\] . وكان بعض السلف يخشى أن يكون ارتكاب الفواحش مبطلاً لثواب الأعمال الصالحة ويحمل هذه الآية على ذلك ، وقد قالت عائشة لما بلغها أن زيد بن أرقم عقد عقداً تراه عائشة حراماً : أخبروا زيداً أنه أبطل جهاده مع رسول الله صلى الله عليه وسلم إن لم يترك فعله هذا ولعلها أرادت بذلك التحذير وإلا فما وجهُ تخصيص الإحباط بجهاده وإنما علمتْ أنه كان أنفس عمل عنده .وعن الحسن البصري والزهري : لا تبطلوا أعمالكم بالمعاصي الكبائر . ذكر ابن عبد البرّ في «الاستيعاب» : «أن زيد بن أرقم قال غزا رسول الله صلى الله عليه وسلم تسع عشرة غزوة وغزوتُ منها معه سبع عشرة غزوة . وهذه كلها من مختلف الأفهام في المعنيّ بإبطال الأعمال وما يبطلها وأحسن أقوال السلف في ذلك ما رويَ عن ابن عمر قال : «كنا نرى أنه ليس شيء من حسناتنا إلا مقبولاً حتى نزل { ولا تبطلوا أعمالكم } ، فقلنا : ما هذا الذي يبطل أعمالنا؟ فقلنا : الكبائر الموجبات والفواحش حتى نزل { إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء }\\[ النساء : 48 \\] فكففنا عن القول في ذلك وكنا نخاف على من أصاب الكبائر ونرجو لمن لم يصبها» اه . فأبان أن ذلك محامل محتملة لا جزم فيها .وعن مقاتل { لا تبطلوا أعمالكم } بالمنّ وقال : هذا خطاب لقوم من بني أسد أسلموا وقالوا لرسول الله صلى الله عليه وسلم قد آثرناك وجئناك بنفوسنا وأهلنا ، يمنون عليه بذلك فنزلت فيهم هذه الآية ونزل فيهم أيضاً قوله تعالى : { يمنون عليك أن أسلموا قل لا تَمنّوا علي إسلامكم } \\[ الحجرات : 17 \\] .وهذه محامل ناشئة عن الرأي والتوقع ، والذي جاء به القرآن وبينته السنة الصحيحة أن الحسنات يُذهبن السيئات ولم يجىء : أن السيئات يذهبن الحسنات ، وقال : { إن الله لا يظلم مثقال ذرّة وإن تك حسنة يضاعفها ويُؤتتِ من لدنه أجراً عظيماً } \\[ النساء : 40 \\] .وتمسك المعتزلة بهاته الآية فزعموا أن الكبائر تحبط الطاعات . ومن العجب أنهم ينفون عن الله الظلم ولا يسلمون ظاهر قوله : { لا يسأل عما يفعل } \\[ الأنبياء : 23 \\] ، ومع ذلك يجعلون الله يبطل الحسنات إذا ارتكب صاحبها سيئة . ونحن نرى أن كل ذلك مسطور في صحف الحسنات والسيئات وأن الحسنة مضاعفة والسيئة بمقدارها . وهذا أصل تواتر معناه في الكتاب وصحيح الآثار ، فكيف ينبذ بالقيل والقال من أهل الأخبار .وحمل بعض علمائنا قوله تعالى : { ولا تبطلوا أعمالكم } على معنى النهي عن قطع العمل المتقرب به إلى الله تعالى . وإطلاق الإبطال على القطع وعدممِ الإتمام يشبه أنه مجاز ، أي لا تتركوا العمل الصالح بعد الشروع فيه ، فأخذوا منه أن النفل يجب بالشروع لأنه من الأعمال ، وهو قول أبي حنيفة في النوافل مطلقاً . ونسب ابن العربي في الأحكام مثلَه إلى مالك . ومثله القرطبي وابن الفرس . ونقل الشيخ الجد في «حاشيته على المحلّى» عن القرافي في «شرح المحصول» ونقل حلولو في «شرح جمع الجوامع» عن القرافي في «الذخيرة» : أن مالكاً قال بوجوب سبْع نوافل بالشروع ، وهي : الصلاة والصيام والحج والعمرة والاعتكاف والائتمام وطواف التطوع دون غيرها نحو الوضوء والصدقة والوقف والسفر للجهاد ، وزاد حُلولو إلحاق الضحية بالنوافل التي تجب بالشروع ولم أقف على مأخذ القرافي ذلك ولا على مأخذ حلولو في الأخير . ولم ير الشافعي وجوباً بالشروع في شيء من النوافل وهو الظاهر .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe) openly! (Obey Allah and obey the messenger) in private, (and render not your actions vain) through hypocrisy, hatred, enmity and opposition of the Messenger; it is also said that this verse was 594 revealed about true believers. Allah says to them: you who believe in Muhammad (pbuh) and the Qur'an, obey Allah in that which He commands you of obligations and spending, and obey also the Messenger in that which he commands you of the Sunnah, conquest and Jihad; and do not annul your works through ostentation and seeking fame.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n المنعم عليكم بأنواع النعم وأصناف الكرم { وَأَطِيعُواْ ٱلرَّسُولَ } الهادي\n المرشد لكم إلى توحيد الحق وكمالات أسمائه وأوصافه { وَلاَ تُبْطِلُوۤاْ أَعْمَالَكُمْ } [محمد: 33] بالإعراض عن الله\n والانصراف عن متابعة رسوله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الذين آمنوا أطيعوا اللّهَ } فيما يأمركم به من الجهاد وغيره { وأطيعوا الرسولَ } فيما سنَّه لكم\n { ولا تُبطلوا أعمالَكم } بما أبطل به هؤلاء أعمالهم من الكفر والنفاق\n وغير ذلك من مفسدات الأعمال\n كالعجب والرياء\n والمن والأذى\n وليس فيه دليل على إحباط الطاعات بالكبائر\n خلافاً للمعتزلة\n أو: لا تبطلوا أعمالكم بأن تقطعوها قبل تمامها\n وبها احتجَ الفقهاء على وجوب إتمام العمل فأوجبوا على مَن شَرَعَ في نافلة إتمامها\n وأخذُه عن الآية ضعيف لأن السياق إنما هو في إحباط العمل بالكفر\n لقوله قبلُ: { وسيُحبط أعمالهم } ثم قال: { يا أيها الذين آمنوا } لا تكونوا كهؤلاء الذين أحبط الله أعمالهم بكفرهم وصدهم عن سبيل الله\n ومشاقتهم الرسولَ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:62",
      "similarity": 0.4819077779356634
    },
    {
      "verse": "31:30",
      "similarity": 0.4819077779356634
    },
    {
      "verse": "47:3",
      "similarity": 0.48009255467544026
    },
    {
      "verse": "8:20",
      "similarity": 0.47902597051295687
    },
    {
      "verse": "7:118",
      "similarity": 0.47818429534101076
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/047033.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/047033.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/47:33.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}