{
  "chapter": "محمد",
  "text": "ان الذين كفروا۟ وصدوا۟ عن سبيل الله ثم ماتوا۟ وهم كفار فلن يغفر الله لهم",
  "translations": [
    {
      "translation": "Those who are kafir and obstruct the Way of Allah, and then die kafir, Allah will not forgive them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not believe and obstruct others from the way of God, and die disbelieving, will not be pardoned by God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah shall not forgive those who disbelieved and barred others from Allah's Way and clung to their unbelief until their death.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will never forgive the disbelievers who prevent others from the way of God and who die as disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who disbelieved and prevented others from Allah’s way, and then died as disbelievers – so Allah will never forgive them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieved and obstructed others from the path of Allah and then died as disbelievers -- never will Allah not forgive them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who disbelieve and turn away from Allah's way, then they die while they are unbelievers, Allah will by no means forgive them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve and bar from God's way and then die disbelieving, them God will not forgive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who disbelieve and turn from the way of Allah and then die disbelievers, Allah surely will not pardon them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "surely those who reject the truth and bar others from the path of God, then die as deniers of the truth, will not be granted forgiveness by God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who disbelieve and hinder others from the way of Allah and then die as infidels, Allah shall by no means forgive them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who are faithless and bar from the way of Allah and then die faithless, Allah will never forgive them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Allah, and hinder (men) from the Path of Allah, then die rejecting Allah,- Allah will not forgive them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve, and hinder (men) from the Path of Allah (i.e. Islam); then die while they are disbelievers, Allah will not forgive them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve and bar (others) from the Path of Allah and then die as unbelievers? Allah will not forgive them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve, and hinder from God’s path, and then die as disbelievers—God will not forgive them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who disbelieved and averted [people] from the path of Allah and then died while they were disbelievers - never will Allah forgive them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:34] Indeed those who disbelieve and bar from the way of God, His path, namely, guidance, and then die as disbelievers, God will never forgive them — this was revealed regarding the men of the Well (al-qalīb).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who disbelieve) in Muhammad (pbuh) and the Qur'an; this refers to those who sponsored the feeding of the army of disbelievers on the Day of Badr (and turn from the way of Allah) and turn away people from the religion and obedience of Allah (and then die) or killed as (disbelievers) in Allah and His Messenger, (Allah surely will not pardon them) because they are disbelievers in Allah and His Messenger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱلَّذِينَ كَفَرُواْ وَصَدُّواْ عَن سَبِيلِ ٱللَّهِ ثُمَّ مَاتُواْ وَ } الحال أنه { هُمْ كُفَّارٌ } مصرون معاندون على ما هم عليه طول عمرهم { فَلَن يَغْفِرَ ٱللَّهُ } [محمد: 34] أبداً لإشراكهم بالله وخروجهم عن ربقة عبوديته بمتابعة أهويتهم الباطلة وآرائهم الفاسدة\n\n\nوبعدما أطعتم الله ورسوله أيها المؤمنون",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وبها احتجَ الفقهاء على وجوب إتمام العمل فأوجبوا على مَن شَرَعَ في نافلة إتمامها، وأخذُه عن الآية ضعيف لأن السياق إنما هو في إحباط العمل بالكفر، لقوله قبلُ: { وسيُحبط أعمالهم } ثم قال: { يا أيها الذين آمنوا } لا تكونوا كهؤلاء الذين أحبط الله أعمالهم بكفرهم وصدهم عن سبيل الله، ومشاقتهم الرسولَ، ويؤيده أيضاً: قوله تعالى: { إِن الذين كفروا وصَدُّوا عن سبيل الله ثم ماتوا وهم كفار فلن يغفر اللّهُ لهم } هذا عام في كل مَن مات على الكفر، وإن صحّ نزوله في أهل القليب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "47:1",
      "similarity": 0.6721684598132438
    },
    {
      "verse": "4:167",
      "similarity": 0.655257832981439
    },
    {
      "verse": "43:37",
      "similarity": 0.6056878547630874
    },
    {
      "verse": "27:43",
      "similarity": 0.527458003358102
    },
    {
      "verse": "63:2",
      "similarity": 0.5137059304596372
    }
  ]
}