{
  "chapter": "محمد",
  "text": "ولو نشاء لارينكهم فلعرفتهم بسيمهم ولتعرفنهم فى لحن القول والله يعلم اعملكم",
  "translations": [
    {
      "translation": "If We wished, We would show them to you and you would know them by their mark and know them by their ambivalent speech. Allah knows your actions.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We pleased We could have shown them to you that you could know them by their marks, and recognise them from the way they twist their words. Yet God knows all your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We were to so will, We could have shown them to you so that you would recognise them by their faces, and you would certainly know them by the manner of their speech. Allah knows all your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We wanted, We could have made you recognize their faces. You will certainly recognize them by the tone of their speech. God knows all your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We will, We can show them to you so that you may recognise them by their faces; and you will surely recognise them by the way they talk; and Allah knows your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We so willed, We could have shown them clearly to you, so that you would know them by their marks; but you will know them by the tone of their speech! And Allah knows (all) your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We please We would have made you know them so that you would certainly have recognized them by their marks and most certainly you can recognize them by the intent of (their) speech; and Allah knows your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We will, We would show them to thee, then thou wouldst know them by their mark; and thou shalt certainly know them in the twisting of their speech; and God knows your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We would, We could show them unto thee (Muhammad) so that thou shouldst know them surely by their marks. And thou shalt know them by the burden of their talk. And Allah knoweth your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now had We so willed, We could have shown them clearly to you, and then you could have identified them by their marks, but surely you will know them by the tone of their speech! God knows all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We willed, We would surely shew them Unto thee, so that thou shouldst surely know them by their marks. And thou shalt surely know them by the mode of their speech. And Allah knoweth your works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We wish, We will show them to you so that you recognize them by their mark. Yet you will recognize them by their tone of speech, and Allah knows your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We so wiled, We could have shown them up to thee, and thou shouldst have known them by their marks: but surely thou wilt know them by the tone of their speech! And Allah knows all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We willed, We could have shown them to you, and you should have known them by their marks, but surely, you will know them by the tone of their speech! And Allah knows all your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We willed, We would show them to you and you would recognize them by their marks. But you will surely know them by their twisted speech. Allahknows your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We willed, We could have shown them to you, and you would have recognized them by their marks. Yet you will recognize them by their tone of speech. And God knows your actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We willed, We could show them to you, and you would know them by their mark; but you will surely know them by the tone of [their] speech. And Allah knows your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:30] And if We will, We could show them to you, We could have pointed them out to you (the lām is repeated in [the following, fa-la-‘araftahum]), then you would recognise them by their mark. And you will certainly recognise them (wa-la-ta‘rifannahum: the wāw is for an omitted oath, and what follows it [fī lahni’l-qawl] is its response) by [their] tone of speech, that is to say, [by] the meaning thereof when they speak in your presence, alluding [as they do] to what amounts to a scathing attack upon the Muslims; and God knows your deeds.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if We would, We could show them unto thee) Muhammad by singling them out with an evil mark (so that thou shouldst know them surely by their marks. And thou shalt know them by the burden of their talk) by the way they talk and try to find excuses. (And Allah knoweth your deeds) your secrets, enmity and hatred towards Allah and His Messenger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِي لَحْنِ ٱلْقَوْلِ } معناه فِي فَحوى القَولِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"in the pronunciation of the word\" means in the intonation of the word.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لم يعلموا أنَّا { لَوْ نَشَآءُ } تفضيحهم { لأَرَيْنَاكَهُمْ } وأبصرنا عليك يا أكمل الرسل ما أظمروا في نفوسهم { فَلَعَرَفْتَهُم } حينئذٍ { بِسِيمَاهُمْ } بمجرد إبصارك إياهم\n لظهور ما في صدورهم من الغل على وجوههم { وَلَتَعْرِفَنَّهُمْ } ألبتة نفقهم { فِي لَحْنِ ٱلْقَوْلِ } الباطل الذي صدر عنهم مشغوشاً مزخرفاً\n وبعدما نزل هذا لا يتكلم منافق عند النبي صلى الله عليه وسلم إلا عرفهم\n ويستدل بكلامه على فساد ضميره { وَ } بالجملة: { ٱللَّهُ } المطلع بعموم أحوال عباده { يَعْلَمُ أَعْمَالَكُمْ } [محمد: 30] ونياتكم فيها ومقاصدكم عنها\n فيجازيكم على مقتضى علمه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ ولو نشاء لأريناكهم } ودللناك عليهم بأمارات\n حتى تعرفهم بأعينهم\n معرفةً مزاحِمةً للرؤية\n والالتفات لنون العظمة لإبراز العناية بالإرادة\n وفي مسند أحمد\n عن ابن مسعود: خطبنا رسول الله صلى الله عليه وسلم فحمد الله\n وأثنى عليه\n ثم قال:\n \" إن منكم منافقين\n فمَن سميتُ فليقم\n ثم قال: قم يا فلان\n حتى سمّى ستة وثلاثين \" \nانظر الطيبي\n { فَلعَرفتَهم بسِيماهم } بعلامتهم التي نَسِمُهم بها\n وعن ابن عباس رضي الله عنه: ما خَفي عن رسول الله صلى الله عليه وسلم بعد هذه الآية شيء من المنافقين كان يعرفهم بسيماهم\n ولقد كنا في بعض الغزوات وفيها تسعة من المنافقين\n يشْكُرهم الناس فناموا\n فأصبح على وجه كل واحد منهم مكتوب: هذا منافق \" قال ابن زيد: قصد الله إظهارَهم\n وأمرَهم أن يخرجوا من المسجد\n فأبوا إلا أن يتمسّكوا بلا إله إلا الله\n فحُقِنت دماءهم\n ونَكحوا ونُكح منهم بها\n { ولَتعرِفَنَّهم } أي: والله لتعرفنهم { في لحن القول } أي: مجراه وأسلوبه وإمالته عن الاعتدال لما فيه من التذويق والتشديق\n وقد كانت ألسنتهم حادة\n وقلوبهم خاربة\n كما قال تعالى:\n[البقرة: 204] الآية\n مَن في قلبه شيءٌ لا بد أن يظهر على لسانه\n كما قيل: \" ما كمَن فيك ظَهَرَ على فِيك \"\n وهذه الجُمل كلها داخِلة تحت \" لَوْ \" معلقةً بالمشيئة\n واللحن يُطلق على وجهين: صواب وخطأ\n فالفعل من الصواب: لَحِنَ يلْحَنُ لَحْناً\n كفرِح\n فهو لَحِنٌ\n إذا فطنَ للشيء\n ومنه قوله صلى الله عليه وسلم: \" ولعل بعضَكم أن يكون ألحن بحجته من بعض \" أي: لقُوتهِ على تصريف الكلام\n والفعلُ من الخطأ: لَحَنَ يلحَنُ لحْناً\n كجعل\n فهو لاَحِنٌ إذا أخطأ\n والأصل فيه: إزالة الكلام عن جهته\n مأخوذ من: اللحن\n وهو ضد الإعراب\n وهو الذهاب عن الصواب في الكلام\n { والله يعلم أعمالَكم } فيُجازيكم بحسب قصدكم إذا الأعمال بالنيات\n وهذا وعد للمؤمنين\n وإيذانٌ بأن حالهم بخلاف حال المنافقين\n أو: يعلم جميع أعمال العباد\n فيميزُ خيرَها من شرها\n الإشارة: { إن الذين ارتدوا على أدبارهم } أي: رَجعوا عن صحبة المشايخ\n بعدما ظهر لهم أسرارُ خصوصيتهم الشيطانُ سوَّل لهم وأَمْلَى لهم\n وتقدّم عن القشيري: أنه يتخلّف عنهم يوم القيامة\n ولا يلحق بالمقربين\n ولو يشفع فيه ألفُ عارف\n بل من كمال المكر به أن يُلقي شَبَهَه في الآخرة على غيره\n حتى يتوهم عارفوه من أهل المعرفة أنه هو\n فلا يشفع أحد فيه لظنهم أنه معهم\n فإذا ارتفعوا إلى عليين مُحيت صورته\n ورُفع إلى مقام العامة\n انظر معناه في آل عمران\n وقال هنا: الذي طلع فَجرُ قلبه وتلألأ نورُ التوحيد فيه\n ثم ارتدّ قبل طلوع نهار إيمانه انكسفَ شمسُ يومه\n وأظلم نهارُ عرفانه\n ودَجا ليل شَكِّه\n وغابت نجومُ عقله\n فحدَّث عن ظلماتهم ولا حرج\n\nهـ\n ولا سيما إذا تحزّب مع العامة في الإذايَة\n وقال للذين كرهوا ما نَزّل الله على أهل الخصوصية من الأسرار: سنُطيعكم في بعض الأمر من إذايتهم\n والله يعلم أسرارهم\n وباقي الوعيد الذي في الآية ربما يشملهم\n وقوله تعالى: { أم حسب الذين في قلوبهم مرض } أي: عداوةٌ لأولياء الله أن لن يُخرج اللّهُ أضغانهم؟ بل يُخرجها ويُظهر وبالها\n ويفتضحون ولو بعد حين\n وقوله تعالى: { ولتعرفنهم في لحن القول } في قوة الخطاب\n ومفهوم الكلام لأن الأسِرَّة تدلُّ على السريرة\n وما خامر القلوبَ فعلى الوجوه يلوحُ\n وأنشدوا في المعنى:\nالمؤمن ينظر بنور الفراسة\n والعارفُ ينظر بعين التحقيق\n والموحِّدُ ينظر بالله\n ولا يستتر عليه شيء\n هـ\n من القشيري\n ثم ذكر اختباره لأهل الصدق\n فقال: { وَلَنَبْلُوَنَّكُمْ حَتَّىٰ نَعْلَمَ ٱلْمُجَاهِدِينَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:48",
      "similarity": 0.1326959090855762
    },
    {
      "verse": "11:83",
      "similarity": 0.11372221037699382
    },
    {
      "verse": "55:41",
      "similarity": 0.11341179949716283
    },
    {
      "verse": "7:46",
      "similarity": 0.11308653494049827
    },
    {
      "verse": "7:167",
      "similarity": 0.1124490726662101
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/047030.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/047030.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/47:30.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}