{
  "chapter": "محمد",
  "text": "فاذا لقيتم الذين كفروا۟ فضرب الرقاب حتى اذا اثخنتموهم فشدوا۟ الوثاق فاما منۢا بعد واما فداء حتى تضع الحرب اوزارها ذلك ولو يشاء الله لانتصر منهم ولكن ليبلوا۟ بعضكم ببعض والذين قتلوا۟ فى سبيل الله فلن يضل اعملهم",
  "translations": [
    {
      "translation": "Therefore when you meet those who are kafir strike their necks. Then when you have decimated them, tie their bonds tightly and set them free or ransom them, until the war is finally over. That is how it is to be. If Allah willed, He could avenge Himself on them. But it is so that He can test some of you by means of others. As for those who fight in the Way of Allah, He will not let their actions go astray.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when you clash with the unbelievers, smite their necks until you overpower them, then hold them in bondage. Then either free them graciously or after taking a ransom, until war shall have come to end. If God had pleased He could have punished them (Himself), but He wills to test some of you through some others. He will not allow the deeds of those who are killed in the cause of God to go waste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you meet the unbelievers (in battle), smite their necks until you have crushed them, then bind your captives firmly; thereafter (you are entitled to) set them free, either by an act of grace, or against ransom, until the war ends. That is for you to do. If Allah had so willed, He would have Himself exacted retribution from them. (But He did not do so) that He may test some of you by means of others. As for those who are slain in the way of Allah, He shall never let their works go to waste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you encounter the disbelievers in a battle, strike-off their heads. Take them as captives when they are defeated. Then you may set them free as a favor to them, with or without a ransom, when the battle is over. This is the Law. Had God wanted, He could have granted them (unbelievers) victory, but He wants to test you through each other. The deeds of those who are killed for the cause of God will never be without virtuous results.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when you confront the disbelievers, strike at their necks; until when you have slain them in plenty, tie them up firmly; then after that, you may either release them as a favour or take ransom, until the war lays down its ordeal; this is it; and had Allah willed He Himself could have taken revenge from them, but this is to test some of you with others; and Allah will surely never waste the deeds of those who were killed in His way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when you meet those who disbelieve (in battle), smite (their) necks until you have fully defeated them, then tighten their bonds. Thereafter (is the time) either for generosity or ransom, until the war lays down its burden. Thus, and had Allah so willed, He could have taken vengeance against them;--but (He lets you struggle) so as to test with one another. But those who are killed in the way of Allah, He will never let their deeds be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when you meet in battle those who disbelieve, then smite the necks until when you have overcome them, then make (them) prisoners, and afterwards either set them free as a favor or let them ransom (themselves) until the war terminates. That (shall be so); and if Allah had pleased He would certainly have exacted what is due from them, but that He may try some of you by means of others; and (as for) those who are slain in the way of Allah, He will by no means allow their deeds to perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you meet the unbelievers, smite their necks, then, when you have made wide slaughter among them, tie fast the bonds; then set them free, either by grace or ransom, till the war lays down its loads. So it shall be; and if God had willed, He would have avenged Himself upon them; but that He may try some of you by means of others. And those who are slain in the way of God, He will not send their works astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now when ye meet in battle those who disbelieve, then it is smiting of the necks until, when ye have routed them, then making fast of bonds; and afterward either grace or ransom till the war lay down its burdens. That (is the ordinance). And if Allah willed He could have punished them (without you) but (thus it is ordained) that He may try some of you by means of others. And those who are slain in the way of Allah, He rendereth not their actions vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you meet those who deny the truth in battle, strike them in the neck, and once they are defeated, make [them] prisoners, and afterwards either set them free as an act of grace, or let them ransom [themselves] until the war is finally over. Thus you shall do; and if God had pleased, He would certainly have exacted retribution from them, but His purpose is to test some of you by means of others. As for those who are killed in God's cause, He will never let their deeds be in vain;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now when ye meet those who disbelieve, smite their necks until when ye have slain them greatly, then make fast the bonds; then, thereafter let them off either freely or by ransom, until the war layeth down the burthens thereof. That ye shall do. And had Allah willed, He would have vindicated Himself against them, but He ordained fighting in order that He may prove you one by the other. And those who are slain in the way of Allah, He shall not send their works astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you meet the faithless in battle, strike their necks. When you have thoroughly decimated them, bind the captives firmly. Thereafter either oblige them [by setting them free] or take ransom, until the war lays down its burdens. That [is Allah’s ordinance]. Had Allah wished He could have taken vengeance on them, but that He may test some of you by means of others. As for those who were slain in the way of Allah, He will not let their works go fruitless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, when ye meet the Unbelievers (in fight), smite at their necks; At length, when ye have thoroughly subdued them, bind a bond firmly (on them): thereafter (is the time for) either generosity or ransom: Until the war lays down its burdens. Thus (are ye commanded): but if it had been Allah's Will, He could certainly have exacted retribution from them (Himself); but (He lets you fight) in order to test you, some with others. But those who are slain in the Way of Allah,- He will never let their deeds be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when you meet (in fight Jihad in Allah's Cause), those who disbelieve smite at their necks till when you have killed and wounded many of them, then bind a bond firmly (on them, i.e. take them as captives). Thereafter (is the time) either for generosity (i.e. free them without ransom), or ransom (according to what benefits Islam), until the war lays down its burden. Thus [you are ordered by Allah to continue in carrying out Jihad against the disbelievers till they embrace Islam (i.e. are saved from the punishment in the Hell-fire) or at least come under your protection], but if it had been Allah's Will, He Himself could certainly have punished them (without you). But (He lets you fight), in order to test you, some with others. But those who are killed in the Way of Allah, He will never let their deeds be lost,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, when you meet the unbelievers smite their necks, then, when you have killed many of them, tie the bonds. Then, either free them by grace orransom until war shall lay down its loads, in this way, it shall be. Had Allah willed, He would have been victorious over them; except that He might test you, the oneby the means of others. As for those who are killed in the Way of Allah, He will not let their works to go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you encounter those who disbelieve, strike at their necks. Then, when you have routed them, bind them firmly. Then, either release them by grace, or by ransom, until war lays down its burdens. Had God willed, He could have defeated them Himself, but He thus tests some of you by means of others. As for those who are killed in the way of God, He will not let their deeds go to waste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when you meet those who disbelieve [in battle], strike [their] necks until, when you have inflicted slaughter upon them, then secure their bonds, and either [confer] favor afterwards or ransom [them] until the war lays down its burdens. That [is the command]. And if Allah had willed, He could have taken vengeance upon them [Himself], but [He ordered armed struggle] to test some of you by means of others. And those who are killed in the cause of Allah - never will He waste their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:4] So when you encounter [in battle] those who disbelieve, then [attack them with] a striking of the necks (fadarba’l-riqābi is a verbal noun in place of the [full] verbal construction, that is to say, fa’dribū riqābahum, ‘then strike their necks’), in other words, slay them — reference is made to the ‘striking of the necks’ because the predominant cause of being slayed is to be struck in the neck. Then, when you have made thoroughly decimated them, bind, spare them, take them captive and bind firmly, the bonds (al-wathāq is what is used to bind [yūthaqu] a captive). Thereafter either [set them free] by grace (mannan is a verbal noun in place of the [full] verbal construction), that is to say, either show them grace by setting them free unconditionally; or by ransom, ransoming them with payment or with Muslim captives, until the war, that is to say, its participants, lay down its burdens, its heavy loads of weaponry and other things, so that either the disbelievers surrender or enter into a treaty. This [last clause] constitutes the ‘purpose’ of [enjoining the Muslims to] slaying and taking captive. So [shall it be] (dhālika is the predicate of an implied subject, [such as] al-amr, ‘the ordinance’, in other words, ‘the ordinance [of God] regarding them is as mentioned’). And had God willed, He could have [Himself] taken vengeance on them, without any fighting, but, He has commanded you to [do] it, that He may test some of you by means of others, from among them, by way of battle, so that the slain among you will end up in Paradise, while those [slain] among them [will end up] in the Fire. And those who are slain (qutilū: a variant reading has qātalū, ‘those who fight’) — this verse was revealed on the day of [the battle of] Uhud, after the dead and the wounded had become numerous among the Muslims — in the way of God, He will not let their works go to waste, He will [not] render [them] void.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَإِذَا لَقِيتُمُ الَّذِينَ كَفَرُوا فَضَرْبَ الرِّقَابِ حَتَّى إِذَا أَثْخَنْتُمُوهُمْ فَشُدُّوا الْوَثَاقَ فَإِمَّا مَنًّا بَعْدُ وَإِمَّا فِدَاءً حَتَّى تَضَعَ الْحَرْبُ أَوْزَارَهَا ذَلِكَ وَلَوْ يَشَاءُ اللَّهُ لَانْتَصَرَ مِنْهُمْ وَلَكِنْ لِيَبْلُوَ بَعْضَكُمْ بِبَعْضٍ وَالَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ فَلَنْ يُضِلَّ أَعْمَالَهُمْ (4({ أمثالهم \\* فَإِذَا لَقِيتُمُ الذين كَفَرُواْ فَضَرْبَ الرقاب حتى إِذَآ أَثْخَنتُمُوهُمْ فَشُدُّواْ الوثاق فَإِمَّا مَنًّا بَعْدُ وَإِمَّا فِدَآءً حتى تَضَعَ } .لا شك أن هذه الآية نزلت بعد وقعة بدر لأن فيها قوله : { حتى إذا أثخنتموهم فشُدُّوا الوثاق } . وهو الحكم الذي نزل فيه العقاب على ما وقع يوم بدر من فداء الأسرى التي في قوله تعالى : { ما كان لنبيء أن يكون له أسرى حتى يُثْخِن في الأرض } \\[ الأنفال : 67 \\] الآية إذ لم يكن حكم ذلك مقرراً يومئذٍ ، وتقدم في سورة الأنفال .والفاء لتفريع هذا الكلام على ما قبله من إثارة نفوس المسلمين بتشنيع حال المشركين وظهور خيبة أعمالهم وتنويه حال المسلمين وتوفيق آرائهم .والمقصود : تهوين شأنهم في قلوب المسلمين وإغراؤهم بقطع دابرهم ليكون الدين كله لله ، لأن ذلك أعظم من منافع فداء أسراهم بالمال ليعبد المسلمون ربهم آمنين . وذلك ناظر إلى آية سورة الأنفال وإلى ما يفيده التّعليل من قوله : { حتى تضع الحرب أوزارها } .و ( إذ ( ظرف للمستقبل مضمنة معنى الشرط ، وذلك غالب استعمالها وجواب الشرط قوله : { فضَرْب الرقاب } .واللقاء في قوله : { فإذا لقِيتم الذين كفروا } : المقابلة ، وهو إطلاق شهير للقاء ، يقال : يوم اللقاء ، فلا يفهم منه إلا لقاء الحرب ، ويقال : إن لقيت فلاناً لقيت منه أسداً ، وقال النابغة :تجنب بني حُنّ فإن لقاءهم ... كريهٌ وإن لم تلْق إلا بصائرفليس المعنى : إذا لقيتم الكافرين في الطريق ، أو نحو ذلك وبذلك لا يحتاج لذكر مخصص لفعل { لقيتم } . والمعنى : فإذا قاتلتم المشركين في المستقبل فأمعنوا في قتلهم حتى إذا رأيتم أن قد خضّدتم شوكتهم ، فآسروا منهم أسرى .وضرب الرقاب : كناية مشهورة يعبر بها عن القتل سواء كان بالضرب أم بالطعن في القلوب بالرماح أو بالرمي بالسهام ، وأوثرت على كلمة القتل لأن في استعمال الكناية بلاغة ولأن في خصوص هذا اللفظ غلظة وشدة تناسبان مقام التحريض .والضرب هنا بمعنى : القطع بالسيف ، وهو أحد أحوال القتال عندهم لأنّه أدل على شجاعة المحارب لكونه مواجِهَ عدوه وجهاً لوجه . والمعنى : فاقتلوهم سواء كان القتَل بضرب السيف ، أو طعن الرّماح ، أو رشق النبال ، لأن الغاية من ذلك هو الإثخان .والذين كفروا : هم المشركون لأنّ اصطلاح القرآن من تصاريف مادة الكفر ، نحو : الكافرين ، والكفار ، والذين كفروا ، هو الشرك . و { حتى } ابتدائية . ومعنى الغاية معها يؤول إلى معنى التفريع .والإثخان : الغلبة لأنها تترك المغلوب كالشيء المثخن وهو الثقيل الصُلب الذي لا يخف للحركة ويوصف به المائع الذي جمد أو قارب الجمود بحيث لا يسيل بسهولة ، ووصف به الثوب والحبل إذا كثرت طاقاتهما بحيث يعسر تفككها .وغلب إطلاقه على التوهين بالقتل ، وكلا المعنيين في هذه الآية ، فإذا فسر بالغلبة كان المعنى حتى إذا غلبتم منهم من وقعوا في قبضتكم أسرى فشدوا وثاقهم وعليه فجواز المنّ والفداءِ غيرُ مقيّد .وإذا فسّر الإثخان بكثرة القتل فيهم كان المعنى حتى إذا لم يبق من الجيش إلا القليل فأسروا حينئذٍ ، أي أبقوا الأسرى ، وكلا الاحتمالين لا يخلو من تأويل في نظم الآية إلا أن الاحتمال الأول أظهر . وتقدم بيانه في سورة الأنفال في قوله : { حتى يُثخن في الأرض } .وانتصب { ضرب الرقاب } على المفعولية المطلقة على أنه بدل من فِعله ثم أضيف إلى مفعوله ، والتقدير : فاضربوا الرقاب ضرباً ، فلما حذف الفعل اختصاراً قدم المفعول المطلق على المفعول به وناب مناب الفعل في العمل في ذلك المفعول وأضيف إلى المفعول إضافة الأسماء إلى الأسماء لأن المصدر راجح في الاسمية . والشَدّ : قوة الربط ، وقوة الإمساك .والوثاق بفتح الواو : الشيء الذي يوثق به ، ويجوز فيه كسر الواو ولم يقرأ به . وهو هنا كناية عن الأسر لأن الأسر يستلزم الوضع في القيد يشد به الأسير . والمعنى : فاقتلوهم ، فإن أثخنتم منهم فأسروا منهم .وتعريف { الرقاب } و { الوثاق } يجوز أن يكون للعهد الذهني ، ويجوز أن يكون عوضاً عن المضاف إليه ، أي فضربَ رقابِهم وشُدُّوا وثاقهم .والمنُّ : الإنعام . والمراد به : إطلاق الأسير واسترقاقه فإن الاسترقاق منٌّ عليه إذ لم يُقتل ، والفداء : بكسر الفاء ممدوداً تخليص الأسير من الأسر بعوض من مال أو مبادلة بأسرى من المسلمين في يدي العدّو . وقدم المن على الفداء ترجيحاً له لأنه أعون على امتلاك ضمير الممنون عليه ليستعمل بذلك بغضه .وانتصب { منّا } و { فداء } على المفعولية المطلقة بدلاً من عامليهما ، والتقدير : إما تمّنون وإما تُفدونوقوله { بعْدُ } أي بعد الإثخان وهذا تقييد لإباحة المنّ والفداء . وذلك موكول إلى نظر أمير الجيش بحسب ما يراه من المصلحة في أحد الأمرين كما فعل النبي صلى الله عليه وسلم بعد غزوة هوازن . وهذا هو ظاهر الآية والأصل عدم النسخ ، وهذا رأي جمهور أيمة الفقه وأهل النظر . فقوله : { الذين كفروا } عام في كل كافر ، أي مشرك يشمل الرجال وهم المعروف حَربهم ويشمل من حارَب معهم من النساء والصبيان والرهبان والأحبار . وهذه الآية لتحديد أحوال القتال وما بعده ، لا لبيان وقت القتال ولا لبيان من هم الكافرون ، لأن أوقات القتال مبينة في سورة براءة . ومعرفة الكافرين معلومة من اصطلاح القرآن بقوله : { فإذا انسلخ الأشهر الحرم فاقتلوا المشركين حيث وجدتموهم } \\[ التوبة : 5 \\] .ثم يظهر أن هذه الآية نزلت بعد آية { ما كان لنبي أن يكون له أسرى حتى يثخن في الأرض } في سورة الأنفال ( 67 ( . واختلف العلماء في حكم هذه الآية في القتل والمن والفداء والذي ذهب إليه مالك والشافعي والثوري والأوزاعي وهو أحدُ قولين عن أبي حنيفة رواه الطحاوي ، ومِن السلف عبدُ الله بن عمر ، وعطاءُ ، وسعيدُ بن جبير : أن هذه الآية غير منسوخة ، وأنها تقتضي التخيير في أسرى المشركين بين القتل أو المن أو الفداء ، وأمير الجيش مخيّر في ذلك .. ويشبه أن يكون أصحاب هذا القول يرون أن مورد الآية الإذنُ في المنّ أو الفداء فهي ناسخة أو مُنهية لحكم قوله تعالى : ما كانَ لنبي أن يكون له أسرى حتى يثخن في الأرض إلى قوله : { لمسَّكُم فيما أخذتم عذاب عظيم } في سورة الأنفال ( 67 ، 68 ( . وهذا أولى من جعلها ناسخة لقوله تعالى : فاقتلوا المشركين حيث وجدتموهم } لما علمت من أن مورد تلك هو تعيين أوقات المتاركة ، وأوقات المحاربة ، فلذلك لم يقل هؤلاء بحَظْر قتل الأسير في حين أن التخيير هنا وارد بين المنّ والفداء ، ولم يذكر معهما القتل . وقد ثبت في «الصحيح» ثبوتاً مستفيضاً أن رسول الله صلى الله عليه وسلم قَتل من أسرى بدر النضر بنَ الحارث وذلك قبل نزول هذه الآية ، وعقبة بن أبي معيط وقتل أسرى قريظة الذين نزلوا على حكم سعد بن معاذ ، وقتل هلال بن خطل ومقيس بن حبابة يوم فتح مكة ، وقتل بعد أحد أبا عزّة الجمعي الشاعر وذلك كله لا يعارض هذه الآية لأنها جعلت التخيير لولي الأمر . وأيضاً لم يذكر في هذه الآية جواز الاسترقاق ، وهو الأصل في الأسرى ، وهو يدخل في المنّ إذا اعتبر المن شاملاً لترك القتل ، ولأن مقابلة المن بالفداء تقتضي أن الاسترقاق مشروع . وقد روى ابن القاسم وابن وهب عن مالك : أنَّ المنّ من العتق . وقال الحسن وعطاء : التخيير بين المنّ والفداء فقط دون قتل الأسير ، فقتل الأسير يكون محظوراً . وظاهر هذه الآية يعضد ما ذهب إليه الحسن وعطاء . وذهب فريق من أهل العلم إلى أن هذه الآية منسوخة وأنه لا يجوز في الأسير المشرك إلا القتل بقوله تعالى : { فاقتلوا المشركين حيث وجدتموهم } \\[ التوبة : 5 \\] . وهذا قول مجاهد وقتادة والضحاك والسدّي وابن جريج ، ورواه العَوفي عن ابن عباس وهو المشهور عن أبي حنيفة ، وقال أبو يوسف ومحمد من أصحاب أبي حنيفة : لا بأس أن يُفادى أسرى المشركين الذين لم يسلموا بأسرى المسلمين الذين بيد المشركين . وروى الجصّاص أن النبي صلى الله عليه وسلم فدى أسيرين من المسلمين بأسير من المشركين في ثقيف .والغاية المستفادة من { حتى } في قوله : { حتى تضع الحرب أوزارها } للتعليل لا للتقييد ، أي لأجل أن تضع الحرب أوزارها ، أي ليكفّ المشركون عنها فتأمنوا من الحرب عليكم وليست غاية لحكم القتال . والمعنى يستمر هذا الحكم بهذا ليهِن العدوَّ فيتركوا حربكم ، فلا مفهوم لهذه الغاية ، فالتعليل متصل بقوله : { فضرب الرقاب } وما بينهما اعتراض . والتقدير : فضرب الرقاب ، أي لا تتركوا القتل لأجل أن تضع الحرب أوزارها ، فيكون وارداً مورد التعليم والموعظة ، أي فلا تشتغلوا عند اللقاء لا بقتل الذين كفروا لتضع الحرب أوزارها فإذا غلبتموهم فاشتغلوا بالإبقاء على من تغلبونه بالأسر ليكون المنّ بعد ذلك أو الفداء .والأوزار : الأثقال ، ووضع الأوزار تمثيل لانتهاء العمل فشبهت حالة انتهاء القتال بحالة وضع الحمّال أو المسافر أثقاله ، وهذا من مبتكرات القرآن . وأخذ منه عبد ربه السُلمى ، أو سُليم الحنفي قوله :فألقت عصاها واستقرّ بها النوَى ... كما قرّ عينا بالإياب المسافرفشبه حالة المنتهي من كلفة بحالة السائر يلقي عصاه التي استصحبها في سيره .{ أَوْزَارَهَا ذلك وَلَوْ يَشَآءُ اللَّهُ لاَنْتَصَرَ مِنْهُمْ ولكن لِّيَبْلُوَ بَعْضَكُمْ } .أعيد اسم الإشارة بعد قوله آنفاً : { ذلك بأن الذين كفروا اتبعوا الباطل } \\[ محمد : 3 \\] للنكتة التي تقدمت هنالك ، وهو خبر لمبتدأ محذوف أو مبتدأ خبره محذوف . وتقدير المحذوف : الأمر ذلك ، والمشار إليه ما تقدم من قوله : { فضرب الرقاب } إلى هنا ، ويفيد اسم الإشارة تقرير الحكم ورسوخه في النفوس .والجملة من اسم الإشارة والمحذوف معترضة و { لو يشاء الله لانتصر منهم } في موضع الحال من الضمير المرفوع المقدر في المصدر من قوله : { فضَرْبَ الرقاب } ، أي أمرتم بضرب رقابهم ، والحال أن الله لو شاء لاستأصلهم ولم يكلفكم بقتالهم ، ولكن الله ناط المسببات بأسبابها المعتادة وهي أن يبلو بعضكم ببعض .وتعدية ( انتصر ( بحرف ( من ( مع أن حقه أن يعدّى بحرف ( على ( لتضمينه معنى : انتقم . والاستدراك راجع إلى ما في معنى المشيئة من احتمال أن يكون الله ترك الانتقام منهم لسبب غير ما بعدَ الاستدراك .والبَلْوْ حقيقته : الاختبار والتجربة ، وهو هنا مجاز في لازمه وهو ظهور ما أراده الله من رفع درجات المؤمنين ووقع بأسهم في قلوب أعدائهم ومن إهانة الكفار ، وهو أن شأنهم بمرأى ومسمع من الناس .{ }هذا من مظاهر بلوى بعضهم ببعض وهو مقابل ما في قوله : { فضرب الرقاببِبَعْضٍ والذين قُتِلُواْ فِى سَبِيلِ الله فَلَن يُضِلَّ أعمالهم\n\n",
      "translations": [
        {
          "translation": "Allah then encouraged the believers to fight, saying: (Now when ye meet in battle) on the Day of Badr (those who disbelieve, then it is smiting of the necks) they smite their necks (until, when ye have routed them) and taken them prisoners, (then making fast of bonds) keep the prisoners in captivity; (and afterward either grace) either release the prisoners without asking for a ransom (or ransom) or the prisoner ransoms himself (till the war lay down its burdens) until the disbelievers lay down their arms; it is also said that this 590 means: until the disbelievers give up. (That (is the ordinance)) to punish whoever disbelieves in Allah. (And if Allah willed He could have punished them (without you)) if Allah willed He could have punished the disbelievers of Mecca through the angels; it is also said that this means: if Allah willed He could have punished the disbelievers of Mecca without you having to fight them, (but (thus it is ordained) that He may try some of you by means of others) but it is thus that He may test the believers with the disbelievers and the relative with his relative. (And those who are slain in the way of Allah) and those who are killed in obedience of Allah on the Day of Badr, referring here to the prophetic Companions, (He rendereth not their actions vain) Allah will not thwart their good deeds which were performed during jihad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمعتم أيها المؤمنون وخامة عاقبة الكفرة وضياع أعمالهم وإحباطها { فَإِذَا لَقِيتُمُ ٱلَّذِينَ كَفَرُواْ } على أي وجه وأي حال { فَضَرْبَ ٱلرِّقَابِ } أي: فعليكم أن تضربوا رقابهم مهما أمكن\n وأن تقتلوهم بلا مبالاة وبدمائهم { حَتَّىٰ إِذَآ أَثْخَنتُمُوهُمْ } أي: أغلظتم وبالغتم في قتلهم\n فأسروا بقاياهم { فَشُدُّواْ ٱلْوَثَاقَ } والنكال على أسرائهم\n واحفظوهم مقيدين موثقين { فَإِمَّا مَنًّا بَعْدُ وَإِمَّا فِدَآءً } أي: تمنون عليهم منّاً فتطلقونهم\n أو تفدون منهم فداءً على إطلاقهم وتخلون سبيلهم\n وبالجملة: افعلوا أيها المؤمنون مع المشركين كذلك { حَتَّىٰ تَضَعَ ٱلْحَرْبُ أَوْزَارَهَا } أي: تضع أهل الحرب من كلا الجانبين آلات الحراب والقتال\n وذلك لا يحصل إلا بالمؤاخاة والاتئلاف التام\n وتدين الجميع بدين الإسلام { ذَلِكَ } أي: الأمر من الله ذلك\n فافعلوا معهم كذلك\n\n\n{ وَلَوْ يَشَآءُ اللَّهُ } القادر المقتدر على أنواع الانتقام { لاَنْتَصَرَ } وانتقم { مِنْهُمْ } أي: من المشركين بلا اقتتالكم وحرابكم { وَلَـٰكِن } إنما يأمركم سبحانه بالقتال { لِّيَبْلُوَاْ } ويختبر { بَعْضَكُمْ } أيها الناس المؤمنون { بِبَعْضٍ } أي: بقتال بعض منكم\n وهو الكافرون\n لينال المؤمنون بقتالهم وجهادهم الثواب الجزيل والأجر الجميل\n ويستوجب الكافر بمعاداة المؤمن بالعقاب العظيم والعذاب الأليم\n كل بتقدير العليم الحكيم\n ثم قال سبحانه تبشيراً للمؤمنين الذين استشهدوا في سبيل الله: { وَ } اعلموا أيها المؤمنون أن { ٱلَّذِينَ قُتِلُواْ } منكم { فِي سَبِيلِ ٱللَّهِ } باذلين مهجهم في ترويج دينه { فَلَن يُضِلَّ } ويضيع { أَعْمَالَهُمْ } [محمد: 4] التي أتوا بها طلباً لمرضاة الله\n وتثبيتاً لقلوبهم على الإيمان بما نزل من عنده\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { فضَرْب }: مصدر\n نائب عن فعله\n مضاف إلى مفعوله\n و { مَنّاً } و { فِدَاءً }: مصدران لمحذوف\n و { الذين كفروا }: مبتدأ حُذف خبره\n وهو العامل في المصدر\n أي: والذين كفروا فأتعسهم تعساً\n و { أضل أعمالهم }: عطف على الخبر المحذوف\n يقول الحق جلّ جلاله: { فإِذا لقيتم الذين كفروا } في المحاربة { فَضَرْبَ الرقابِ } أصله: فاضربوا الرقاب ضرباً\n فحذف الفعل وناب عن مصدره للاختصار\n مع إعطاء معنى التوكيد\n لدلالة نصبه على مؤكده\n وضرب الرقاب عبارةٌ عن مطلق القتل\n والتعبير به عن القتل تصوير له بأشنع صورة وتهويل لأمره\n وإرشاد للغزاة إلى أيسر ما يكون\n { حتى إِذا أَثخنتموهم } أكثرتم فيه القتل\n وأغلظتموه\n من: الشيء الثخين\n وهو الغليظ\n أو: أثقلتموهم بالجِراح وهزمتموهم\n { فشُدُّوا الوَثاقَ } أي: فأسِروهم\n وشُدوا وثاقهم\n لئلا يتفلتوا\n والوثاق بالفتح والكسر: ما يشد به\n فإذا أسرتموهم فتخيّروا فيهم { وإِما فِدَاءً } أن تفدوا فداءً\n والمعنى: التخيُّر بين الأمرين بعد الأسر\n بين أن يَمُنُّوا عليهم فيطلقوهم\n وبين أن يُفادوهم\n ومذهب مالك: أن الإمام مُخَيَّر في الأسارى بين خمسة\n وهي: المنّ\n والفداء\n والقتل\n والاسترقاق\n وضرب الجزية\n وقيل: لا يجوز المَن ولا الفداء لأن الآية منسوخة بقوله:\n[التوبة: 5] فيتعين قتلهم\n والصحيح أنها محكمة\n ومَذْهَب الشافعي: أن الإمام مُخير بين أربعة: القتل\n والاسترقاق\n والفداء بأسارى المسلمين\n والمنّ\n ولعل الجزية عنده خاصة بأهل الكتاب\n ومذهب أبي حنيفة: التخيير بين القتل والاسترقاق فقط\n قال: والآية منسوخة لأن سورة براءة آخر ما نزل\n وعن مجاهد: ليس اليوم مَنّ ولا فداء\n والمراد بالمنّ في الآية\n أن يمنّ عليهم بترك القتل\n فيسترقوا\n أو يمنّ عليهم بإعطاء الجزية\n هـ\n والمشهور: مذهب مالك لأن النبي صلى الله عليه وسلم قتل عقبةَ بن أبي معيط\n والنضر بن الحارث\n يوم بدر صبراً\n وفادى سائر الأسارى\n ومَنَّ على ثمامة بن أثال الحنفي\n وهو أسير\n وارتق نساء بني قريظة\n فابعهم\n وضرب الجزية على نصارى نجران ومجوس هاجر\n ثم ذكر غاية الحرب فقال: { حتى تضع الحربُ أوزارها } أي: اضربوا رقابهم حتى تضع الحرب أثقالها\n وآلاتها\n التي لا قوم إلا بها\n كالسلاح والكراع\n وذلك حيث لم يبقَ حرب\n بأن تضع أهل الحرب عُدتها\n وقيل: { أوزارها } آثامها\n يعني: حتى يترك أهل الحرب المشركين شركهم\n بأن يُسلموا جميعاً\n والمختار: أن المعنى: أثخنوا المشركين بالقتل والأسر حتى يظهر الإسلام على سائر الأديان\n ويؤمن أهل الكتاب\n طوعاً أو كرهاً\n ويكون الدين كله للّه\n فلا يحتاج إلى قتال\n وقال الحسن: معناه\n: حتى لا يُعبد إلا الله\n وقال ابن عطية: ظاهر اللفظ: أنها استعارة\n يُراد بها التزام الأمر كذلك أبداً\n كما تقول: أنا أفعل ذلك إلى يوم القيامة\n\nهـ\n فالغاية بـ \" حتى \" راجعة إلى الضرب والشد\n وما ترتب عليه من المنّ والفداء\n { ذلك } الأمر ذلك\n أو افعلوا ذلك\n { ولو يشاء اللّهُ لانتصرَ } لانتقم { منهم } بغير قتال بأن ينزل بهم أسباب الهلاك والاستئصال\n كالخسف أو الرجف أو غير ذلك\n { ولكن } أمركم بالقتال { ليَبلُوا بعضَكم ببعض } أي: المؤمنين بالكافرين\n فأمَرَهم بالجهاد ليستوجبوا الثواب العظيم\n وليسلم مَن سبق إسلامه من الكافرين\n { والذين قاتلوا في سبيل الله } لإعلاء كلمة التوحيد\n لا لغرض آخر\n { فلن يُضِلَّ أعمالَهم } فلن يضيعها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:67",
      "similarity": 0.5485128512532899
    },
    {
      "verse": "94:2",
      "similarity": 0.18316562342373507
    },
    {
      "verse": "3:91",
      "similarity": 0.16094881612383904
    },
    {
      "verse": "2:279",
      "similarity": 0.14025241397226126
    },
    {
      "verse": "2:85",
      "similarity": 0.1400297691787588
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/047004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/047004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/47:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}