{
  "chapter": "محمد",
  "text": "فاذا لقيتم الذين كفروا۟ فضرب الرقاب حتى اذا اثخنتموهم فشدوا۟ الوثاق فاما منۢا بعد واما فداء حتى تضع الحرب اوزارها ذلك ولو يشاء الله لانتصر منهم ولكن ليبلوا۟ بعضكم ببعض والذين قتلوا۟ فى سبيل الله فلن يضل اعملهم",
  "translations": [
    {
      "translation": "Therefore when you meet those who are kafir strike their necks. Then when you have decimated them, tie their bonds tightly and set them free or ransom them, until the war is finally over. That is how it is to be. If Allah willed, He could avenge Himself on them. But it is so that He can test some of you by means of others. As for those who fight in the Way of Allah, He will not let their actions go astray.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when you clash with the unbelievers, smite their necks until you overpower them, then hold them in bondage. Then either free them graciously or after taking a ransom, until war shall have come to end. If God had pleased He could have punished them (Himself), but He wills to test some of you through some others. He will not allow the deeds of those who are killed in the cause of God to go waste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you meet the unbelievers (in battle), smite their necks until you have crushed them, then bind your captives firmly; thereafter (you are entitled to) set them free, either by an act of grace, or against ransom, until the war ends. That is for you to do. If Allah had so willed, He would have Himself exacted retribution from them. (But He did not do so) that He may test some of you by means of others. As for those who are slain in the way of Allah, He shall never let their works go to waste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you encounter the disbelievers in a battle, strike-off their heads. Take them as captives when they are defeated. Then you may set them free as a favor to them, with or without a ransom, when the battle is over. This is the Law. Had God wanted, He could have granted them (unbelievers) victory, but He wants to test you through each other. The deeds of those who are killed for the cause of God will never be without virtuous results.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when you confront the disbelievers, strike at their necks; until when you have slain them in plenty, tie them up firmly; then after that, you may either release them as a favour or take ransom, until the war lays down its ordeal; this is it; and had Allah willed He Himself could have taken revenge from them, but this is to test some of you with others; and Allah will surely never waste the deeds of those who were killed in His way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when you meet those who disbelieve (in battle), smite (their) necks until you have fully defeated them, then tighten their bonds. Thereafter (is the time) either for generosity or ransom, until the war lays down its burden. Thus, and had Allah so willed, He could have taken vengeance against them;--but (He lets you struggle) so as to test with one another. But those who are killed in the way of Allah, He will never let their deeds be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when you meet in battle those who disbelieve, then smite the necks until when you have overcome them, then make (them) prisoners, and afterwards either set them free as a favor or let them ransom (themselves) until the war terminates. That (shall be so); and if Allah had pleased He would certainly have exacted what is due from them, but that He may try some of you by means of others; and (as for) those who are slain in the way of Allah, He will by no means allow their deeds to perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you meet the unbelievers, smite their necks, then, when you have made wide slaughter among them, tie fast the bonds; then set them free, either by grace or ransom, till the war lays down its loads. So it shall be; and if God had willed, He would have avenged Himself upon them; but that He may try some of you by means of others. And those who are slain in the way of God, He will not send their works astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now when ye meet in battle those who disbelieve, then it is smiting of the necks until, when ye have routed them, then making fast of bonds; and afterward either grace or ransom till the war lay down its burdens. That (is the ordinance). And if Allah willed He could have punished them (without you) but (thus it is ordained) that He may try some of you by means of others. And those who are slain in the way of Allah, He rendereth not their actions vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you meet those who deny the truth in battle, strike them in the neck, and once they are defeated, make [them] prisoners, and afterwards either set them free as an act of grace, or let them ransom [themselves] until the war is finally over. Thus you shall do; and if God had pleased, He would certainly have exacted retribution from them, but His purpose is to test some of you by means of others. As for those who are killed in God's cause, He will never let their deeds be in vain;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now when ye meet those who disbelieve, smite their necks until when ye have slain them greatly, then make fast the bonds; then, thereafter let them off either freely or by ransom, until the war layeth down the burthens thereof. That ye shall do. And had Allah willed, He would have vindicated Himself against them, but He ordained fighting in order that He may prove you one by the other. And those who are slain in the way of Allah, He shall not send their works astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you meet the faithless in battle, strike their necks. When you have thoroughly decimated them, bind the captives firmly. Thereafter either oblige them [by setting them free] or take ransom, until the war lays down its burdens. That [is Allah’s ordinance]. Had Allah wished He could have taken vengeance on them, but that He may test some of you by means of others. As for those who were slain in the way of Allah, He will not let their works go fruitless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, when ye meet the Unbelievers (in fight), smite at their necks; At length, when ye have thoroughly subdued them, bind a bond firmly (on them): thereafter (is the time for) either generosity or ransom: Until the war lays down its burdens. Thus (are ye commanded): but if it had been Allah's Will, He could certainly have exacted retribution from them (Himself); but (He lets you fight) in order to test you, some with others. But those who are slain in the Way of Allah,- He will never let their deeds be lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when you meet (in fight Jihad in Allah's Cause), those who disbelieve smite at their necks till when you have killed and wounded many of them, then bind a bond firmly (on them, i.e. take them as captives). Thereafter (is the time) either for generosity (i.e. free them without ransom), or ransom (according to what benefits Islam), until the war lays down its burden. Thus [you are ordered by Allah to continue in carrying out Jihad against the disbelievers till they embrace Islam (i.e. are saved from the punishment in the Hell-fire) or at least come under your protection], but if it had been Allah's Will, He Himself could certainly have punished them (without you). But (He lets you fight), in order to test you, some with others. But those who are killed in the Way of Allah, He will never let their deeds be lost,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, when you meet the unbelievers smite their necks, then, when you have killed many of them, tie the bonds. Then, either free them by grace orransom until war shall lay down its loads, in this way, it shall be. Had Allah willed, He would have been victorious over them; except that He might test you, the oneby the means of others. As for those who are killed in the Way of Allah, He will not let their works to go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you encounter those who disbelieve, strike at their necks. Then, when you have routed them, bind them firmly. Then, either release them by grace, or by ransom, until war lays down its burdens. Had God willed, He could have defeated them Himself, but He thus tests some of you by means of others. As for those who are killed in the way of God, He will not let their deeds go to waste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when you meet those who disbelieve [in battle], strike [their] necks until, when you have inflicted slaughter upon them, then secure their bonds, and either [confer] favor afterwards or ransom [them] until the war lays down its burdens. That [is the command]. And if Allah had willed, He could have taken vengeance upon them [Himself], but [He ordered armed struggle] to test some of you by means of others. And those who are killed in the cause of Allah - never will He waste their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[47:4] So when you encounter [in battle] those who disbelieve, then [attack them with] a striking of the necks (fadarba’l-riqābi is a verbal noun in place of the [full] verbal construction, that is to say, fa’dribū riqābahum, ‘then strike their necks’), in other words, slay them — reference is made to the ‘striking of the necks’ because the predominant cause of being slayed is to be struck in the neck. Then, when you have made thoroughly decimated them, bind, spare them, take them captive and bind firmly, the bonds (al-wathāq is what is used to bind [yūthaqu] a captive). Thereafter either [set them free] by grace (mannan is a verbal noun in place of the [full] verbal construction), that is to say, either show them grace by setting them free unconditionally; or by ransom, ransoming them with payment or with Muslim captives, until the war, that is to say, its participants, lay down its burdens, its heavy loads of weaponry and other things, so that either the disbelievers surrender or enter into a treaty. This [last clause] constitutes the ‘purpose’ of [enjoining the Muslims to] slaying and taking captive. So [shall it be] (dhālika is the predicate of an implied subject, [such as] al-amr, ‘the ordinance’, in other words, ‘the ordinance [of God] regarding them is as mentioned’). And had God willed, He could have [Himself] taken vengeance on them, without any fighting, but, He has commanded you to [do] it, that He may test some of you by means of others, from among them, by way of battle, so that the slain among you will end up in Paradise, while those [slain] among them [will end up] in the Fire. And those who are slain (qutilū: a variant reading has qātalū, ‘those who fight’) — this verse was revealed on the day of [the battle of] Uhud, after the dead and the wounded had become numerous among the Muslims — in the way of God, He will not let their works go to waste, He will [not] render [them] void.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then encouraged the believers to fight, saying: (Now when ye meet in battle) on the Day of Badr (those who disbelieve, then it is smiting of the necks) they smite their necks (until, when ye have routed them) and taken them prisoners, (then making fast of bonds) keep the prisoners in captivity; (and afterward either grace) either release the prisoners without asking for a ransom (or ransom) or the prisoner ransoms himself (till the war lay down its burdens) until the disbelievers lay down their arms; it is also said that this 590 means: until the disbelievers give up. (That (is the ordinance)) to punish whoever disbelieves in Allah. (And if Allah willed He could have punished them (without you)) if Allah willed He could have punished the disbelievers of Mecca through the angels; it is also said that this means: if Allah willed He could have punished the disbelievers of Mecca without you having to fight them, (but (thus it is ordained) that He may try some of you by means of others) but it is thus that He may test the believers with the disbelievers and the relative with his relative. (And those who are slain in the way of Allah) and those who are killed in obedience of Allah on the Day of Badr, referring here to the prophetic Companions, (He rendereth not their actions vain) Allah will not thwart their good deeds which were performed during jihad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمعتم أيها المؤمنون وخامة عاقبة الكفرة وضياع أعمالهم وإحباطها { فَإِذَا لَقِيتُمُ ٱلَّذِينَ كَفَرُواْ } على أي وجه وأي حال { فَضَرْبَ ٱلرِّقَابِ } أي: فعليكم أن تضربوا رقابهم مهما أمكن\n وأن تقتلوهم بلا مبالاة وبدمائهم { حَتَّىٰ إِذَآ أَثْخَنتُمُوهُمْ } أي: أغلظتم وبالغتم في قتلهم\n فأسروا بقاياهم { فَشُدُّواْ ٱلْوَثَاقَ } والنكال على أسرائهم\n واحفظوهم مقيدين موثقين { فَإِمَّا مَنًّا بَعْدُ وَإِمَّا فِدَآءً } أي: تمنون عليهم منّاً فتطلقونهم\n أو تفدون منهم فداءً على إطلاقهم وتخلون سبيلهم\n وبالجملة: افعلوا أيها المؤمنون مع المشركين كذلك { حَتَّىٰ تَضَعَ ٱلْحَرْبُ أَوْزَارَهَا } أي: تضع أهل الحرب من كلا الجانبين آلات الحراب والقتال\n وذلك لا يحصل إلا بالمؤاخاة والاتئلاف التام\n وتدين الجميع بدين الإسلام { ذَلِكَ } أي: الأمر من الله ذلك\n فافعلوا معهم كذلك\n\n\n{ وَلَوْ يَشَآءُ اللَّهُ } القادر المقتدر على أنواع الانتقام { لاَنْتَصَرَ } وانتقم { مِنْهُمْ } أي: من المشركين بلا اقتتالكم وحرابكم { وَلَـٰكِن } إنما يأمركم سبحانه بالقتال { لِّيَبْلُوَاْ } ويختبر { بَعْضَكُمْ } أيها الناس المؤمنون { بِبَعْضٍ } أي: بقتال بعض منكم\n وهو الكافرون\n لينال المؤمنون بقتالهم وجهادهم الثواب الجزيل والأجر الجميل\n ويستوجب الكافر بمعاداة المؤمن بالعقاب العظيم والعذاب الأليم\n كل بتقدير العليم الحكيم\n ثم قال سبحانه تبشيراً للمؤمنين الذين استشهدوا في سبيل الله: { وَ } اعلموا أيها المؤمنون أن { ٱلَّذِينَ قُتِلُواْ } منكم { فِي سَبِيلِ ٱللَّهِ } باذلين مهجهم في ترويج دينه { فَلَن يُضِلَّ } ويضيع { أَعْمَالَهُمْ } [محمد: 4] التي أتوا بها طلباً لمرضاة الله\n وتثبيتاً لقلوبهم على الإيمان بما نزل من عنده\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { فضَرْب }: مصدر، نائب عن فعله، مضاف إلى مفعوله، و { مَنّاً } و { فِدَاءً }: مصدران لمحذوف، و { الذين كفروا }: مبتدأ حُذف خبره، وهو العامل في المصدر، أي: والذين كفروا فأتعسهم تعساً، و { أضل أعمالهم }: عطف على الخبر المحذوف\n يقول الحق جلّ جلاله: { فإِذا لقيتم الذين كفروا } في المحاربة { فَضَرْبَ الرقابِ } أصله: فاضربوا الرقاب ضرباً، فحذف الفعل وناب عن مصدره للاختصار، مع إعطاء معنى التوكيد، لدلالة نصبه على مؤكده، وضرب الرقاب عبارةٌ عن مطلق القتل، والتعبير به عن القتل تصوير له بأشنع صورة وتهويل لأمره، وإرشاد للغزاة إلى أيسر ما يكون، { حتى إِذا أَثخنتموهم } أكثرتم فيه القتل، وأغلظتموه، من: الشيء الثخين، وهو الغليظ، أو: أثقلتموهم بالجِراح وهزمتموهم، { فشُدُّوا الوَثاقَ } أي: فأسِروهم، وشُدوا وثاقهم، لئلا يتفلتوا، والوثاق بالفتح والكسر: ما يشد به\n فإذا أسرتموهم فتخيّروا فيهم { وإِما فِدَاءً } أن تفدوا فداءً، والمعنى: التخيُّر بين الأمرين بعد الأسر، بين أن يَمُنُّوا عليهم فيطلقوهم، وبين أن يُفادوهم، ومذهب مالك: أن الإمام مُخَيَّر في الأسارى بين خمسة، وهي: المنّ، والفداء، والقتل، والاسترقاق، وضرب الجزية، وقيل: لا يجوز المَن ولا الفداء لأن الآية منسوخة بقوله:\n\n[التوبة: 5] فيتعين قتلهم، والصحيح أنها محكمة، ومَذْهَب الشافعي: أن الإمام مُخير بين أربعة: القتل، والاسترقاق، والفداء بأسارى المسلمين، والمنّ\n ولعل الجزية عنده خاصة بأهل الكتاب\n ومذهب أبي حنيفة: التخيير بين القتل والاسترقاق فقط، قال: والآية منسوخة لأن سورة براءة آخر ما نزل\n وعن مجاهد: ليس اليوم مَنّ ولا فداء، والمراد بالمنّ في الآية\n أن يمنّ عليهم بترك القتل، فيسترقوا، أو يمنّ عليهم بإعطاء الجزية\n هـ\n والمشهور: مذهب مالك لأن النبي صلى الله عليه وسلم قتل عقبةَ بن أبي معيط، والنضر بن الحارث، يوم بدر صبراً، وفادى سائر الأسارى، ومَنَّ على ثمامة بن أثال الحنفي، وهو أسير، وارتق نساء بني قريظة، فابعهم، وضرب الجزية على نصارى نجران ومجوس هاجر\n ثم ذكر غاية الحرب فقال: { حتى تضع الحربُ أوزارها } أي: اضربوا رقابهم حتى تضع الحرب أثقالها، وآلاتها، التي لا قوم إلا بها، كالسلاح والكراع، وذلك حيث لم يبقَ حرب، بأن تضع أهل الحرب عُدتها، وقيل: { أوزارها } آثامها، يعني: حتى يترك أهل الحرب المشركين شركهم، بأن يُسلموا جميعاً\n والمختار: أن المعنى: أثخنوا المشركين بالقتل والأسر حتى يظهر الإسلام على سائر الأديان، ويؤمن أهل الكتاب، طوعاً أو كرهاً، ويكون الدين كله للّه، فلا يحتاج إلى قتال\n وقال الحسن: معناه،: حتى لا يُعبد إلا الله\n وقال ابن عطية: ظاهر اللفظ: أنها استعارة، يُراد بها التزام الأمر كذلك أبداً، كما تقول: أنا أفعل ذلك إلى يوم القيامة\n\n\nهـ\n فالغاية بـ \" حتى \" راجعة إلى الضرب والشد، وما ترتب عليه من المنّ والفداء\n { ذلك } الأمر ذلك، أو افعلوا ذلك، { ولو يشاء اللّهُ لانتصرَ } لانتقم { منهم } بغير قتال بأن ينزل بهم أسباب الهلاك والاستئصال، كالخسف أو الرجف أو غير ذلك، { ولكن } أمركم بالقتال { ليَبلُوا بعضَكم ببعض } أي: المؤمنين بالكافرين، فأمَرَهم بالجهاد ليستوجبوا الثواب العظيم، وليسلم مَن سبق إسلامه من الكافرين\n { والذين قاتلوا في سبيل الله } لإعلاء كلمة التوحيد، لا لغرض آخر، { فلن يُضِلَّ أعمالَهم } فلن يضيعها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:67",
      "similarity": 0.5485128512532899
    },
    {
      "verse": "94:2",
      "similarity": 0.18316562342373507
    },
    {
      "verse": "3:91",
      "similarity": 0.16094881612383904
    },
    {
      "verse": "2:279",
      "similarity": 0.14025241397226126
    },
    {
      "verse": "2:85",
      "similarity": 0.1400297691787588
    }
  ]
}