{
  "chapter": "الفتح",
  "text": "سيقول المخلفون اذا انطلقتم الى مغانم لتاخذوها ذرونا نتبعكم يريدون ان يبدلوا۟ كلم الله قل لن تتبعونا كذلكم قال الله من قبل فسيقولون بل تحسدوننا بل كانوا۟ لا يفقهون الا قليلا",
  "translations": [
    {
      "translation": "When you go out to get the booty, those who remained behind will say, 'Allow us to follow you,' desiring to alter Allah's words. Say: 'You may not follow us. That is what Allah said before.' They will say, 'It is only because you envy us.' No indeed! How little they have understood!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who had stayed behind will say: \"When you depart for taking the spoils, allow us to follow you.\" They wish to change the word of God. Tell them: \"You will not follow us. That is what God has already said before.\" They will say: \"You are envious of our gain.\" The fact is they understand but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you press forth for the spoils, those who were left behind will say: “Let us accompany you.” They want to change the command of Allah. Say to them (in clear words): “You shall not accompany us. Thus has Allah already said.” Then they will say: “Nay; but you are jealous of us.” The truth is that they understand little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The laggardly Bedouins will say, \"When you leave to collect the spoils, let us follow you.\" They want to alter the command of God (that only the participating believers are entitled to such benefit). Tell them, \"You can never follow us for such a purpose. God has said before and He will say again (what type of people you are). In fact, you are jealous of us.\" The truth is that they understand very little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who had stayed behind will now say, “When you go to receive the war booty, let us also go with you”; they wish to change the Words of Allah; say “You shall never come with us – this is already decreed by Allah”; so they will now say, “But rather you envy us”; in fact they never understood except a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who lagged behind will say, when you set forth to take the spoils, \"Allow us to follow you.\" They want to change Allah's Words. Say: \"You shall not follow us; thus Allah has said beforehand.\" Then they will say: \"Nay, you envy us.\" Nay, but they understand not except a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are left behind will say when you set forth for the gaining of acquisitions: Allow us (that) we may follow you. They desire to change the world of Allah. Say: By no means shall you follow us; thus did Allah say before. But they will say: Nay! you are jealous of us. Nay! they do not understand but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Bedouins who were left behind will say, when you set forth after spoils, to take them, 'Let us follow you,' desiring to change God's words. Say: 'You shall not follow us; so God said before.' Then they will say, 'Nay, but you' are jealous of us.' Nay, but they have not understood except a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were left behind will say, when ye set forth to capture booty: Let us go with you. They fain would change the verdict of Allah. Say (unto them, O Muhammad): Ye shall not go with us. Thus hath Allah said beforehand. Then they will say: Ye are envious of us. Nay, but they understand not, save a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you [believers] set off to gather the spoils, those that stayed behind will say, \"Let us come with you.\" They want to change God's word, but tell them, \"You shall not follow us. God has declared this beforehand.\" Then they will say, \"You are jealous of us.\" But how little they understand!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who lagged behind will presently, When ye march forth to take spoils, leave us, we shall follow say you. They intend to change the word of Allah. Say thou: ye shall by no means follow us; thus hath Allah said afore. Then they will say: Aye! ye envy us. Aye! little it is they are wont to understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[In the near future] when you will set out to capture booty, those who stayed behind [in this journey] will say, : ‘Let us follow you.’ They desire to change the word of Allah. Say, ‘You will never follow us! Allah has said thus beforehand.’ Then they will say, ‘You are envious of us.’ Indeed, they do not understand but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who lagged behind (will say), when ye (are free to) march and take booty (in war): \"Permit us to follow you.\" They wish to change Allah's decree: Say: \"Not thus will ye follow us: Allah has already declared (this) beforehand\": then they will say, \"But ye are jealous of us.\" Nay, but little do they understand (such things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who lagged behind will say, when you set forth to take the spoils, \"Allow us to follow you,\" They want to change Allah's Words. Say: \"You shall not follow us; thus Allah has said beforehand.\" Then they will say: \"Nay, you envy us.\" Nay, but they understand not except a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you set forth to take the spoils, those Bedouins who lagged behind will say: 'Let us follow you' They hope to change the Words of Allah. Say: 'Youshall not follow us. Allah has said so before' They will reply: 'No, you are envious of us' Rather, they have only understood a little!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who lagged behind will say when you depart to collect the gains, “Let us follow you.” They want to change the Word of God. Say, “You will not follow us; God has said so before.” Then they will say, “But you are jealous of us.” In fact, they understand only a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who remained behind will say when you set out toward the war booty to take it, \"Let us follow you.\" They wish to change the words of Allah. Say, \"Never will you follow us. Thus did Allah say before.\" So they will say, \"Rather, you envy us.\" But [in fact] they were not understanding except a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:15] Those, mentioned, who were left behind will say, when you set forth after spoils, namely, the spoils of Khaybar, in order to capture them, ‘Let us follow you’, that we might [also] take a share of it. They desire, thereby, to change the words of God (kalāma’Llāhi: a variant reading has kalima’Llāhi), in other words, His promising of the spoils of Khaybar exclusively for those who were at al-Hudaybiyya. Say: ‘You shall never follow us! Thus has God said beforehand’, that is, prior to our return. Then they will say, ‘Nay, but you are envious of us’, lest we might acquire a share of the spoils, and therefore you say this [that you say]. Nay, but they never understood, anything of religion, [all] except a few, of them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nسَيَقُولُ الْمُخَلَّفُونَ إِذَا انْطَلَقْتُمْ إِلَى مَغَانِمَ لِتَأْخُذُوهَا ذَرُونَا نَتَّبِعْكُمْ يُرِيدُونَ أَنْ يُبَدِّلُوا كَلَامَ اللَّهِ قُلْ لَنْ تَتَّبِعُونَا كَذَلِكُمْ قَالَ اللَّهُ مِنْ قَبْلُ فَسَيَقُولُونَ بَلْ تَحْسُدُونَنَا بَلْ كَانُوا لَا يَفْقَهُونَ إِلَّا قَلِيلًا (15(هذا استئناف ثان بعد قوله : { سيقول لك المخلفون من الأعراب شغلتنا أموالنا وأهلونا } \\[ الفتح : 11 \\] . وهو أيضاً إعلام للنبيء صلى الله عليه وسلم بما سيقوله المخلفون عن الحديبيّة يتعلّق بتخلّفهم عن الحديبية وعذرهم الكاذب ، وأنهم سيندمون على تخلفهم حين يرون اجتناء أهل الحديبيّة ثمرة غزوهم ، ويتضمن تأكيد تكذيبهم في اعتذارهم عن التخلف بأنهم حين يعلمون أن هنالك مغانم من قتال غير شديد يحرصون على الخروج ولا تشغلهم أموالهم ولا أهاليهم ، فلو كان عذرهم حقاً لما حرصوا على الخروج إذا توقعوا المغانم ولأقبلوا على الاشتغال بأموالهم وأهليهم .ولكون هذه المقالة صدرت منهم عن قريحة ورغبة لم يؤت معها بمجرور { لك } كما أُتي به في قوله : { سيقول لك المخلفون } آنفاً لأن هذا قولُ راغب صادق غير مزوِّر لأجل الترويج على النبي صلى الله عليه وسلم كما علمت ذلك فيما تقدم .واستُغني عن وصفهم بأنهم من الأعراب لأن تعريف { المخلفون } تعريف العهد ، أي المخلفون المذكورون .وقوله : { إذا انطلقتم إلى مغانم لتأخذوها } متعلق ب { سيقول المخلَّفون } وليس هو مقول القول . و { إذا } ظرف للمستقبل ، ووقوع فعل المضي بعده دون المضارع مستعار لمعنى التحقيق ، و { إذا } قرينة على ذلك لأنها خاصة بالزمن المستقبل .والمراد بالمغانم في قوله : { إذا انطلقتم إلى مغانم } : الخروج إلى غزوة خيبر فأطلق عليها اسم مغانم مجازا لعلاقة الأوْل مثل إطلاق خَمراً في قوله : { إني أرانِيَ أعصر خمراً } \\[ يوسف : 36 \\] . وفي هذا المجاز إيماء إلى أنهم منصورون في غزوتهم .وأن النبي صلى الله عليه وسلم لما رجَع من الحديبيّة إلى المدينة أقام شهر ذي الحجة سنة وست وأياماً من محرم سنة سبع ثم خرج إلى غزوة خيبر ورام المخلفون عن الحديبيّة أن يخرجوا معه فمنعهم لأن الله جعلَ غزوة خيبر غنيمة لأهل بيعة الرضوان خاصة إذ وعدهم بفتح قريب .وقوله : { لتأخذوها } ترشيح للمجاز وهو إيماء إلى أن المغانم حاصلة لهم لا محالة .وذلك أن الله أخبر نبيئه صلى الله عليه وسلم أنه وعد أهل الحديبيّة أن يعوضهم عن عدم دخول مكة مغانم خبير .و { مغانم } : جمع مغنم وهو اسم مشتق من غَنم إذا أصاب ما فيه نفع له كأنهم سموه مغنماً باعتبار تشبيه الشيء المغنوم بمكان فيه غنم فصيغ له وزن المَفْعَل .وأشعر قوله : { ذَرُونا } بأن النبي صلى الله عليه وسلم سيمنعهم من الخروج معه إلى غزو خيبر لأن الله أمره أن لا يُخرج معه إلى خيبر إلا من حضر الحديبيّة ، وتقدم في قوله تعالى : { وقال فرعون ذروني أقتل موسى } في سورة غافر ( 26 ( .وقوله : نتبعكم } حكاية لمقالتهم وهو يقتضي أنهم قالوا هذه الكلمة استنزالاً لإجابة طلبهم بأن أظهروا أنهم يخرجون إلى غزو خيبر كالأتباع ، أي أنهم راضِون بأن يكونوا في مؤخرة الجيش فيكون حظهم في مغانمه ضعيفاً .وتبديل كلام الله : مخالفة وحيه من الأمر والنهي والوعد كرامة للمجاهدين وتأديباً للمخلفين عن الخروج إلى الحديبيّة . فالمراد بكلام الله ما أوحاه إلى رسوله صلى الله عليه وسلم من وعد أهل الحديبيّة بمغانم خيبر خاصة لهم ، وليس المراد بكلام الله هنا القرآن إذ لم ينزل في ذلك قرآن يومئذٍ . وقد أشرك مع أهل الحديبية من ألحق بهم من أهل هجرة الحبشة الذين أعطاهم النبي صلى الله عليه وسلم بوحي .وأما ما روي عن عبد الله بن زيد بن أسلم أن المراد بكلام الله قوله تعالى : { فقل لن تخرجوا معي أبداً ولن تقاتلوا معي عدواً } \\[ التوبة : 83 \\] فقد رده ابن عطية بأنها نزلت بعد هذه السورة وهؤلاء المخلفون لم يمنعوا منعاً مؤبداً بل منعوا من المشاركة في غزوة خيبر لئلا يشاركوا في مغانمها فلا يلاقي قوله فيها { لن تخرجوا معي أبداً } وينافي قوله في هذه السورة { قُل للمخلَّفين من الأعراب ستُدَعون إلى قوم أولي بأس شديد تقاتلونهم } \\[ الفتح : 16 \\] الآية ، فإنها نزلت في غزوة تبوك وهي بعد الحديبيّة بثلاث سنين .وجملة { يريدون أن يُبدِّلوا كلام الله } في موضع الحال . والإرادة في قوله : { يُريدون أن يُبدلوا كلام الله } على حقيقتها لأنهم سيعلمون حينئذٍ يقولون : { ذرونا نتبعكم } أن الله أوحَى إلى نبيه صلى الله عليه وسلم بمنعهم من المشاركة في فتح خيبر كما دل عليه تنازلهم في قولهم : { ذرونا نتبعكم } فهم يريدون حينئذٍ أن يغيروا ما أمر الله به رسوله حين يقولون { ذرونا نتبعكم } إذ اتباع الجيش والخروج في أوله سواء في المقصود من الخروج .وقرأ الجمهور { كلام الله } . وقرأه حمزة والكسائي وخلف { كَلِم الله } اسم جمع كَلمة . وجيء ب { لن } المفيدة تأكيد النفي لقطع أطماعهم في الإذن لهم باتباع الجيش الخارج إلى خيبر ولذلك حذف متعلق { تتبعونا } للعلم به . و { مِن قبلُ } تقديره : من قبل طلبكم الذي تطلبونه وقد أخبر الله عنهم بما سيقولونه إذ قال : { فسيقولون بل تحسدوننا } ، وقد قالوا ذلك بعد نحو شهر ونصف فلما سمع المسلمون المتأهبون للخروج إلى خيبر مقالتهم قالوا : قد أخبرنا الله في الحديبية بأنهم سيقولون هذا .و { بل } هنا للإضراب عن قول الرسول صلى الله عليه وسلم { لن تتبعونا } وهو إضراب إبطال نشأ عن فورة الغضب المخلوط بالجهالة وسوء النظر ، أي ليس بكم الحفاظ على أمر الله ، بل بكم أن لا نقاسمكم في المغانم حسداً لنا على ما نصيب من المغانم .والحسد : كراهية أن ينال غيرُك خيراً معيَّناً أو مطلقاً سواء كان مع تمني انتقاله إليك أو بدون ذلك ، فالحسد هنا أريد به الحرص على الانفراد بالمغانم وكراهية المشاركة فيها لئلا ينقص سهام الكارهين . وتقدم الحسد عند قوله تعالى :{ بَغياً أن ينزل الله من فضله } \\[ البقرة : 90 \\] وعند قوله : { حسداً من عند أنفسهم } \\[ البقرة : 109 \\] كلاهما في سورة البقرة .وضمير الرفع مراد به أهل الحديبية ، نسبوهم إلى الحسد لأنهم ظنوا أن الجواب بمنعهم لعدم رضى أهل الحديبية بمشاركتهم في المغانم . ولا يظن بهم أن يريدوا بذلك الضميرِ شمولَ النبي صلى الله عليه وسلم لأن المخلفين كانوا مؤمنين لا يتهمون النبي صلى الله عليه وسلم بالحسد ولذلك أبطل الله كلامهم بالإضراب الإبطالي فقال : { بل كانوا لا يفقهون إلا قليلاً } ، أي ليس قولك لهم ذلك لقصد الاستبشار بالمغانم لأهل الحديبية ولكنه أمر الله وحقه لأهل الحديبية وتأديب للمخلفين ليكونوا عبرة لغيرهم فيما يأتي وهم ظنوه تمالؤًا من جيش الحديبية لأنهم لم يفهموا حكمته وسببهم . وإنّما نفى الله عنهم الفهم دون الإيمان لأنهم كانوا مؤمنين ولكنهم كانوا جاهلين بشرائع الإسلام ونظمه .وأفاد قوله : { لا يفقهون } انتفاء الفهم عنهم لأن الفعل في سياق النفي كالنكرة في سياق النفي يعم ، فلذلك استثنى منه بقوله : { إلا قليلاً } أي إلا فهماً قليلاً وإنما قَلّلَهُ لكون فهمهم مقتصراً على الأمور الواضحة من العاديات لا ينفذ إلى المهمات ودقائق المعاني ، ومن ذلك ظنهم حرمانهم من الالتحاق بجيش غزوة خيبر منبعثاً على الحسد . وقد جروا في ظنهم هذا على المعروف من أهل الأنظار القاصرة والنفوس الضئيلة من التوسم في أعمال أهل الكمال بمنظار ما يجدون من دواعي أعمالهم وأعمال خلطائهم .و { قليلاً } وصف للمستثنى المحذوف ، والتقدير : إلا فقهاً قليلاً .\n\n",
      "translations": [
        {
          "translation": "(Those who were left behind) at the conquest of al-Hudaybiyyah, i.e. Banu Ghifar, Aslam, Ashja' and some people from Muzaynah and Juhaynah (will say, when ye set forth to capture booty) the booty of Khaybar: (Let us go with you) to Khaybar. (They fain would change the verdict of Allah) when he said to His Prophet not to let them accompany him to any other conquest after failing to join the conquest of al-Hudaybiyyah. (Say) to Banu 'Amir, Dayl, Aslam, Ashja', and a group from Muzaynah and Juhaynah: (Ye shall not go with us) to Khaybar except as volunteers but you will not have a share of the booty. (Thus) just as we told you (hath Allah said beforehand) in surah Repentance (say unto them: Ye shall never more go out with me nor fight with me against a foe...). Upon hearing this, the hypocrites said to the believers: Allah has not commanded you this, it is rather because you are resentfully envious of us for sharing the booty with you. So Allah said: (Then they will say: Ye are envious of us) regarding the booty. (Nay, but they understand not) the command of Allah, (save a little) neither much nor a little.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { سَيَقُولُ ٱلْمُخَلَّفُونَ } المذكورات وقت { إِذَا ٱنطَلَقْتُمْ إِلَىٰ مَغَانِمَ } الموعودة لكم خاصة { لِتَأْخُذُوهَا } بفضل الله إياكم: { ذَرُونَا نَتَّبِعْكُمْ } بغزوتكم هذه وننصركم\n مع أنهم لا يقصدون الرفاقة والوفاق في نفوسهم ونياتهم\n بل { يُرِيدُونَ } ويقصدون بقولهم هذا أن { يُبَدِّلُواْ } ويغيروا { كَلاَمَ ٱللَّهِ } الدال على تخصيص غنائم خيبر لمن حضر الحديبية بدل غنائم مكة\n\n\n{ قُل } لهم يا أكمل الرسل على وجه التأييد في النفي: { لَّن تَتَّبِعُونَا كَذَٰلِكُمْ } أي: مثلما سمعتم { قَالَ ٱللَّهُ } المطلع على ما في نفوسهم من النفاق والشقاق { مِن قَبْلُ } أي: قبل تهيئاتكم أيها المؤمنون للخروج إلى خيبر { فَسَيَقُولُونَ } بعدما سمعوا النهى على وجه التأييد في نفوسهم: ما أمرهم الله هذا { بَلْ تَحْسُدُونَنَا } على أخذ الغنيمة\n أي: ما حملهم على هذا النهي المؤكد المؤبد إلا الحسد والشح { بَلْ } هم قوم جاهلون { كَانُواْ لاَ يَفْقَهُونَ } ولا يفهمون مراد الله العليم الحكيم عن منعهم هذا { إِلاَّ قَلِيلاً } [الفتح: 15] منهم\n وهم المصدقون بالله ورسوله في سرائرهم ونجواهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { سيقول المخلِّفون } المذكورون آنفاً { إِذا انطلقتم إِلى مغانمَ } أي: مغانم خيبر { تأخذونها } حسبما وعدكم الله بها\n وخصَّكم بها\n عِوض ما فاتكم من مغانم مكة\n و { إذا }: ظرف لما قبله\n لا شرط لما بعده\n أي: سيقولون عند انطلاقكم إلى مغانم خيبر: { ذَرونا نتَّبِعكم } إلى خيبر\n ونشهد معكم قتال أهلها { يريدون إن يُبدِّلوا كلامَ الله } الذي وعد به أهل الحديبية بأن يخصّهم بغنائم خيبر ولا يشاركهم فيها أحد\n فأراد المخلَّفون أن يُشاركوهم ويُبدلوا وعد الله\n وكانت وقعة الحديبية في ذي الحجة سنة ست\n فلما رجع إلى المدينة أقام بها بقية ذي الحجة\n ثم غزا في أول السابعة خيبر\n ففتحها\n وغنم أموالاً كثيرة\n فخصصها بأهل الحديبية\n بأمره تعالى\n { قل } لهم إقناطاً لهم: { لن تتبعونا } إلى خيبر\n وهو نفي بمعنى النهي\n للمبالغة\n أي: لا تتبعونا\n أو: نفي محض\n إخبار من الله تعالى بعدم اتباعهم وألا يبدّل القول لديه\n { كذلكم قال اللّهُ من قبلُ } أي: من قبل انصرافهم إلى الغنيمة\n وأنَّ غنيمة خيبر لَمن شهد الحديبية فقط\n { فسيقولون } للمؤمنين عند سماع هذا النهي: { بل تحسدوننا } أي: ليس ذلك النهي من عند الله\n بل تحسدوننا أن نشارككم في الغنائم\n { بل كانوا لا يفقهون } كلام الله { إِلا قليلاً } شيئاً قليلاً\n يعني: مجرد اللفظ\n أو: لا يفهمون إلا فهماً قليلاً وهو فطنتهم لأمور الدنيا دون الدين\n وهو ردٌّ لقولهم الباطل\n ووصف لهم بسوء الفهم والجهل المفرط\n والفرق بين الإضرابين: أن الأول ردَّ أن يكون حكم الله ألا يتبعوهم وإثبات الحسد\n والثاني إضرابٌ عن وصفهم بإضافة الحسد إلى المؤمنين إلى وصفهم بما هو أعظم منه\n وهو الجهل وقلة الفقه\n { قل للمخلَّفين من الأعراب } وهم الذين تخلّفوا عن الحديبية: { ستُدْعَوْن إِلى قومٍ أُولي بأسٍ شديدٍ } يعني: بني حنيفة\n قوم مسليمة الكذاب\n وأهل الردة الذين حاربهم أبو بكر رضي الله عنه\n لأن المشركين وأهل الردة هم الذين لا يُقبل منهم إلا الإسلام أو السيف\n واستُدل بالآية على حقيّة خلافة أبي بكر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "113:5",
      "similarity": 0.5651760795462555
    },
    {
      "verse": "4:54",
      "similarity": 0.5384929411607607
    },
    {
      "verse": "2:109",
      "similarity": 0.4327151345807471
    },
    {
      "verse": "48:19",
      "similarity": 0.3129550045763636
    },
    {
      "verse": "8:69",
      "similarity": 0.28504997518436653
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/048015.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/048015.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/48:15.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}