{
  "chapter": "الفتح",
  "text": "قل للمخلفين من الاعراب ستدعون الى قوم او۟لى باس شديد تقتلونهم او يسلمون فان تطيعوا۟ يؤتكم الله اجرا حسنا وان تتولوا۟ كما توليتم من قبل يعذبكم عذابا اليما",
  "translations": [
    {
      "translation": "Say to the Arabs who remained behind: 'You will be called up against a people who possess great force whom you must fight unless they submit. If you obey, Allah will give you an excellent reward. But if you turn your backs as you did before, He will punish you with a painful punishment.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the desert Arabs who had stayed behind: \"You will be called against a formidable people. You will fight them till they surrender. If you obey, then He will give you a good reward; but if you turn back, as you had done before, He will punish you with a grievous affliction.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the bedouins who were left behind: “You will be called against those who possess great might and be asked to fight against them unless they surrender. If you obey (the command to fight), Allah will bestow upon you a goodly reward. But if you turn away, as you turned away before, He shall inflict upon you a grievous chastisement.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell the laggardly Bedouins, \"You will be called to face strong people whom you will fight right to the end or who will submit to you. If you obey the Messenger, God will give you a good reward. But if you turn away as you did before, God will make you suffer a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the ignorant who stayed behind, “You will soon be called against a nation of great military strength – to fight against them or that they become Muslims; so if you obey, Allah will give you an excellent reward; and if you turn away, the way you had turned away before, He will mete out a painful punishment to you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the bedouins who lagged behind: \"You shall be called to fight against a people given to great warfare, then you shall fight them, or they shall surrender. Then if you obey, Allah will give you a fair reward; but if you turn away as you did turn away before, He will punish you with a painful torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to those of the dwellers of the desert who were left behind: You shall soon be invited (to fight) against a people possessing mighty prowess; you will fight against them until they submit; then if you obey, Allah will grant you a good reward; and if you turn back as you turned back before, He will punish you with a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the Bedouins who were left behind: 'You shall be called against a people possessed of great might' to fight them, or they surrender. If you obey, God will give you a goodly wage; but if you turn your backs, as you turned your backs before, He will chastise you with a painful chastisement.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say unto those of the wandering Arabs who were left behind: Ye will be called against a folk of mighty prowess, to fight them until they surrender; and if ye obey, Allah will give you a fair reward; but if ye turn away as ye did turn away before, He will punish you with a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the desert Arabs who stayed behind, \"You shall be called against a mighty people; then shall you fight, unless they submit. Then if you prove obedient, God will grant you a good reward, but if You turn back as you did before, He will inflict on you a painful punishment --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou Unto those who lagged behind of the desert Arabs: surely ye shall be summoned against a people endued with exceeding violence then ye will fight them or they will submit. Then if ye obey, Allah will give ye a goodly hire; but if ye turn away even as ye turned away aforetime. He will torment you with a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the Bedouins who stayed behind, ‘[Later on] you will be called against a people of a great might: they will either embrace Islam, or you will fight them. So if you obey, Allah will give you a good reward; but if you turn away like you turned away before, He will punish you with a painful punishment.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the desert Arabs who lagged behind: \"Ye shall be summoned (to fight) against a people given to vehement war: then shall ye fight, or they shall submit. Then if ye show obedience, Allah will grant you a goodly reward, but if ye turn back as ye did before, He will punish you with a grievous Penalty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW) to the bedouins who lagged behind: \"You shall be called to fight against a people given to great warfare, then you shall fight them, or they shall surrender. Then if you obey, Allah will give you a fair reward, but if you turn away as you did turn away before, He will punish you with a painful torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the Arabs who lagged behind: 'You shall be called upon to fight a mighty nation, unless they embrace Islam. If you are obedient you shall receive agood wage from Allah. But, if you turn away, as you turned your backs before, He will punish you with a painful punishment'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the Desert-Arabs who lagged behind, “You will be called against a people of great might; you will fight them, unless they submit. If you obey, God will give you a fine reward. But if you turn away, as you turned away before, He will punish you with a painful punishment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to those who remained behind of the bedouins, \"You will be called to [face] a people of great military might; you may fight them, or they will submit. So if you obey, Allah will give you a good reward; but if you turn away as you turned away before, He will punish you with a painful punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:16] Say to those of the Bedouins, mentioned, who were left behind, to test them: ‘You shall be called against a people possessed of great might — these are said to have been the [tribe of] Banū Hanīfa, the inhabitants of [the region of] al-Yamāma; but it is also said that these were the Persians and the Byzantines — you shall fight them (tuqātilūnahum is a circumstancial qualifier referring to an implied [future] situation, which constitutes that to which the ‘call’ will be made); or they will submit, so that you will not [have to] fight. So if you obey, [the command] to fight them, God will give you a good reward; but if you turn away like you turned away before, He will chastise you with a painful chastisement’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad (unto those of the wandering Arabs who were left behind) Dayl, Ashja', and a group of people from both Muzaynah and Juhaynah: (Ye will be called) after the Prophet (pbuh) (against a folk) to fight a folk (of mighty prowess) who are tough in fighting; the reference here is to the people of al- Yamamah, Banu Hanifah, the folk of Musaylimah the liar, (to fight them) because of religion (until they surrender; and if ye obey) and agree to fight and make your profession of Allah's divine Oneness pure, (Allah will give you a fair reward) in the Garden; (but if ye turn away) from Allah's divine Oneness, repentance, sincerity and acceptance to fight against Musaylimah the liar (as ye did turn away before) at the conquest of al-Hudaybiyyah, (He will punish you with a painful doom).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { سَتُدْعَوْنَ إِلَىٰ قَوْمٍ أُوْلِي بَأْسٍ شَدِيدٍ } معناه إلى أهلِ الأوثانِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {You will be called to a people of severe [implied: physical] force} [refers to] the people of the idols.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُل } يا أكمل الرسل { لِّلْمُخَلَّفِينَ مِنَ ٱلأَعْرَابِ } بعدما أيسوا من الخروج إلى خيبر: { سَتُدْعَوْنَ إِلَىٰ } غزوة { قَوْمٍ أُوْلِي بَأْسٍ شَدِيدٍ } وشوكة عظيمة { تُقَاتِلُونَهُمْ أَوْ يُسْلِمُونَ } أي: مآل أمرهم إمَّا القتل وعزته\n وإمَّا الإسلام لا غير { فَإِن تُطِيعُواْ } حنيئذٍ\n ولم تتخلفوا كما تخلفتم يوم الحديبية { يُؤْتِكُمُ ٱللَّهُ } المطلع بنياتكم { أَجْراً حَسَناً } في الدنيا والآخرة { وَإِن تَتَوَلَّوْاْ } وتنصرفوا { كَمَا تَوَلَّيْتُمْ مِّن قَبْلُ } يوم الحديبية { يُعَذِّبْكُمْ عَذَاباً أَلِيماً } [الفتح: 16] لتضاعف جرمكم\n وشدة شقاقكم ونفاقكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل للمخلَّفين من الأعراب } وهم الذين تخلّفوا عن الحديبية: { ستُدْعَوْن إِلى قومٍ أُولي بأسٍ شديدٍ } يعني: بني حنيفة، قوم مسليمة الكذاب، وأهل الردة الذين حاربهم أبو بكر رضي الله عنه، لأن المشركين وأهل الردة هم الذين لا يُقبل منهم إلا الإسلام أو السيف\n واستُدل بالآية على حقيّة خلافة أبي بكر، وأخذها من القرآن بقوله: { سَتُدعون } فكان الداعي لهؤلاء الأعراب إلى قتال بني حنيفة، وكانوا أولي بأس شديد، هو أبو بكر، بلا خلاف، قاتلوهم ليُسلموا لا ليُعطوا الجزية بأمر الصدّيق، وقيل: هم فارس، والداعي لقتالهم \" عمر \" ، فدلّت على صحة إمامته، وهو يدل على صحة إمامة أبي بكر\n { تُقاتلونهم أو يُسلمون } أي: يكون أحد الأمرين، إما المقاتلة أو الإسلام، ومعنى \" يُسلمون \" على هذا التأويل: ينقادون لأن فارس مجوس، تُقبل منهم الجزية، { فإِن تُطيعوا } مَن دعاكم إلى قتالهم { يُؤتكم اللّهُ أجراً حسناً } هو الغنيمة في الدنيا، والجنة في الآخرة، { وإِن تتولوا } عن الدعوة، كما توليتم من قبل في الحديبية، { يُعذبكم عذاباً أليماً } لتضاعف جُرمكم\n\n\nوقد تضمنت الآية إيجاب طاعة الأمراء بالوعد بالثواب عليها، والوعيد بالعقاب على التولي، وقد تقدّم في النساء\n الإشارة: سيقول المخلِّفون عن السير بترك مجاهة النفوس، التي بها يتحقق سير السائرين: ذرونا نتبعكم في السير إلى الله من غير مجاهدة ولا تجريد، يريدون أن يُبدلوا كلامَ الله، وهو قوله:\n\n[العنكبوت: 69]، فخصّ الهداية إلى الوصول بالمجاهدة، لا بالبقاء مع حظوظ النفوس، قل: لن تتبعونا في السير، ولو فعلتم ما فعلتم بلا مجاهدة، كذلك حكم الحكيم العليم، فإن قالوا: حسدتمونا، حيث لم تسيرونا على ما نحن عليه، فقد دلّ ذلك على جهلهم، وعدم فهمهم، قل للمخلفين على السير، بالبقاء مع حظوظهم: ستُدعون إلى مجاهدة قوم أُولي بأس شديد، وهو النفس، بتحميلها ما يثقل عليها، كالذل، والفقر، والهوى بمخالفته، والدنيا بالزهد فيها ورميها وراء الظهر، والناس بالفرار منهم جملة، إلا مَن يدلّ على الله، تقاتلوهم، أو يُسلمون، بأن ينقادوا لكم، ويصيروا طوع أيديكم، فإن تُطيعوا يؤتكم الله أجراً حسناً، وهو لذة الشهة، ورؤية الملك الودود، عاجلاً وآجلاً، وإن تتولوا كما توليتم في زمان البطالة، وبقيتم مع هوى نفوسكم، يُعذِّبكم عذاباً أليماً، بغم الحجاب وسوء العقاب\n قال القشيري: قوله تعالى { فإن تُطيعوا يؤتكم الله أجراً حسناً } دلت الآية على أنه يجوز أن تكون للعبد بداية غير مُرْضية، ثم تتغير للصلاح، وأنشدوا:\n\nقلت: وجه الاستدلال: أن طاعتهم كانت بعد التخلُّف والعصيان، فقُبلت منهم\n ثم استثنى أهل الأعذار الصحيحة، فقال: { لَّيْسَ عَلَى ٱلأَعْمَىٰ حَرَجٌ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:37",
      "similarity": 0.3822312341759313
    },
    {
      "verse": "41:3",
      "similarity": 0.3476865651540985
    },
    {
      "verse": "9:90",
      "similarity": 0.3401239444063843
    },
    {
      "verse": "43:3",
      "similarity": 0.3372143247133328
    },
    {
      "verse": "12:2",
      "similarity": 0.33638078206608935
    }
  ]
}