{
  "chapter": "الفتح",
  "text": "ولله ملك السموت والارض يغفر لمن يشاء ويعذب من يشاء وكان الله غفورا رحيما",
  "translations": [
    {
      "translation": "The kingdom of the heavens and the earth belongs to Allah. He forgives those He wills and punishes those He wills. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the kingdom of the heavens and the earth; He may forgive whosoever He please, and afflict whosoever He will. Yet God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the kingdom of the heavens and the earth. He forgives whom He pleases and chastises whom He pleases. He is Most Forgiving, Most Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the kingdom of the heavens and the earth. He forgives or punishes whomever He wants. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for Allah only is the kingship of the heavens and the earth; He may forgive whomever He wills, and punish whomever He wills; and Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs the sovereignty of the heavens and the earth. He forgives whom He wills, and punishes whom He wills. And Allah is Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's is the kingdom. of the heavens and the earth; He forgives whom He pleases and punishes whom He pleases, and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the kingdom of the heavens and of the earth; whomsoever He will He forgives, and whomsoever He will He chastises; God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's is the Sovereignty of the heavens and the earth. He forgiveth whom He will, and punisheth whom He will. And Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the kingdom of the heavens and the earth. He forgives whom He pleases, and punishes whom He pleases. And God is most forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's is the dominion of the heavens and the earth. He forgivEth whomsoever He Will and tormenteth whomsoever he will; and Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the kingdom of the heavens and the earth: He forgives whomever He wishes, and punishes whomever He wishes, and Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the dominion of the heavens and the earth: He forgives whom He wills, and He punishes whom He wills: but Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs the sovereignty of the heavens and the earth, He forgives whom He wills, and punishes whom He wills. And Allah is Ever Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the Kingdom of the heavens and the earth. He forgives whom He will and punishes whom He will. Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the kingdom of the heavens and the earth. He forgives whomever He wills, and He punishes whomever He wills. God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs the dominion of the heavens and the earth. He forgives whom He wills and punishes whom He wills. And ever is Allah Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:14] And to God belongs the kingdom of the heavens and the earth: He forgives whomever He will and chastises whomever He will; and God is ever Forgiving, Merciful, that is to say, He is ever possessed of the attributes mentioned.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "597 (And Allah's is the Sovereignty) the stores (of the heavens) rain (and the earth) vegetation. (He forgiveth whom He will) of the believers for committing enormities, out of favour, (and punisheth whom He will) for committing minor sins, in justice; it is also said that this means: He honours whom He will with faith and repentance such that He forgives him and makes die whom He will in a state of disbelief and hypocrisy and then punishes him for it; and it is also said that this means: He forgives whoever deserves to be forgiven and punishes whoever deserves to be punished. (And Allah is ever Forgiving) He always forgives whoever repents of enormous and minor sins, (Merciful) towards whoever dies repentant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا ينتقم عنهم سبحانه مع أنه { لِلَّهِ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } وله التصرف فيهما بالاستقلال والاختيار { يَغْفِرُ لِمَن يَشَآءُ } فضلاً وإنعاماً { وَيُعَذِّبُ مَن يَشَآءُ } عدلاً وانتقاماً { وَكَانَ ٱللَّهُ } المتصف بكمال اللطف والمرحمة { غَفُوراً } لمن تاب وآمن وعمل صالحاً { رَّحِيماً } [الفتح: 14] يقبل توبة التائبين\n ويعفو عن زلاتهم\n\nثم لما سمع المخلفون من الأعراب يوم الحديبية أن الله قد وعد المؤمنين فتح خيبر\n وخص لهم الغنائم\n قصدوا الخروج نحوها طامعين الغنائم\n لذلك أخبر الله سبحانه حبيبه بقصدهم هذا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولله مُلكُ السماوات والأرض } يُدبره تدبير قادر حكيم\n ويتصرف فيهما وفيما بينهما كيف يشاء\n { يغفر لمن يشاء ويُعذِّب من يشاء } بقدرته وحكمته\n من غير دخل لأحد في شيء\n ومن حكمته: مغفرته للمؤمنين وتعذيبه للكافرين\n { وكان الله غفوراً رحيماً } مبالغاً في المغفرة والرحمة لمَن يشاء\n أي: لمَن تقتضي الحكمة مغفرته ممن يؤمن به وبرسوله\n وأما مَن عداه من الكفر فبمعزل من ذلك قطعاً\n الإشارة: هذه الآية تَجُر ذيلها على مَن تخلّف من المريدين عن زيادة المشايخ من غير عُذر بيِّن\n واعتذر بأعذار كاذبة\n يقول بلسانه ما ليس في قلبه\n وما زالت الأشياخ تقول: كل شيء يُسمح فيه إلا القدوم إذ به تحصل التربية والترقية\n وتقول أيضاً: مَن جلس عنا لعذر صحيح عذرناه\n وربما يصل إليه المدد في موضعه\n ومَن جلس لغير عذر لا نُسامح له\n بل يُحرم من زيادة الإمداد\n ومن الترقي في المقامات والأسرار\n وما قطع الناس عن الله إلا أموالهم وأهلوهم اشتغلوا بهم\n وحُرموا السير والوصول\n فكل مريد شغله عن زيادة شيخه أهلُه ومالُه لا يأتي منه شيء\n قل: فمَن يملك لكم من الله شيئاً إن أراد بكم ضرّاً\n بأن قطعكم عنه بعلة الأهل والمال\n أو: أراد بكم نفعاً\n بأن وصلكم إليه\n وغيَّب عنكم أهلكم ومالكم\n بل كان الله بما تعملون خبيراً\n يعلم مَن تخلّف لعذر صحيح\n أو لعذر باطل\n وبالله التوفيق\n ثم قال: { سَيَقُولُ ٱلْمُخَلَّفُونَ إِذَا ٱنطَلَقْتُمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:129",
      "similarity": 0.8459041754015489
    },
    {
      "verse": "5:40",
      "similarity": 0.6523623945944244
    },
    {
      "verse": "3:189",
      "similarity": 0.53419888611124
    },
    {
      "verse": "4:106",
      "similarity": 0.5333587261143022
    },
    {
      "verse": "8:33",
      "similarity": 0.5278983228991491
    }
  ]
}