{
  "chapter": "الفتح",
  "text": "بل ظننتم ان لن ينقلب الرسول والمؤمنون الى اهليهم ابدا وزين ذلك فى قلوبكم وظننتم ظن السوء وكنتم قومۢا بورا",
  "translations": [
    {
      "translation": "No, you thought that the Messenger and the muminun were not going to return to their families, and that seemed pleasing to your hearts and you thought evil thoughts and you were a blighted people.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact you imagined that the Prophet and the faithful would never come back home; and this seemed pleasing to your hearts, and you entertained evil thoughts. You are a people lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(But the truth is not what you say.) You had imagined that the Messenger and the believers would never return to their families, and this notion was embellished in your hearts. You harboured an evil thought, and you are an immensely evil people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You thought the Messenger and the believers would never ever return to their families and this attracted your hearts and caused you to develop evil suspicions. You are a wrong doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Rather you had assumed that the Noble Messenger and the Muslims will never return to their homes, and you thought this as good within your hearts, whereas you had thought evilly; and you were a people about to be ruined.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but you thought that the Messenger and the believers would never return to their families, and that was made fair seeming in your hearts, and you did think an evil thought and you became a Bura.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! you rather thought that the Apostle and the believers would not return to their families ever, and that was made fairseeming to your hearts and you thought an evil thought and you were a people doomed to perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but you thought that the Messenger and the believers would never return to their families, and that was decked out fair in your hearts, and you thought evil thoughts, and you were a people corrupt.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but ye deemed that the messenger and the believers would never return to their own folk, and that was made fairseeming in your hearts, and ye did think an evil thought, and ye were worthless folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No. You thought that the Messenger and the believers would never return to their families; this prospect seemed pleasing to your hearts, and you conceived evil thoughts, and thus were doomed to perish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yea! ye imagined that the apostle and the believers would never return to their households, and that became fair-seeming in your hearts, and ye bethought an evil thought, and ye became a people doomed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather, you thought that the Apostle and the faithful will not ever return to their folks, and that was made to seem decorous to your hearts; you entertained evil thoughts, and you were a ruined lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, ye thought that the Messenger and the Believers would never return to their families; this seemed pleasing in your hearts, and ye conceived an evil thought, for ye are a people lost (in wickedness).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but you thought that the Messenger (SAW) and the believers would never return to their families; and that was made fair-seeming in their hearts, and you did think an evil thought and you became a useless people going for destruction.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No, you thought that the Messenger and the believers would never return to their families, and this was made to seem fair in your hearts so you harbored evil thoughts, and so you are a destroyed nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you thought that the Messenger and the believers will never return to their families, and this seemed fine to your hearts; and you harbored evil thoughts, and were uncivilized people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you thought that the Messenger and the believers would never return to their families, ever, and that was made pleasing in your hearts. And you assumed an assumption of evil and became a people ruined.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:12] Nay (bal in both instances marks a transition from one subject to another), but you thought that the Messenger and the believers would never return to their families, and that [thought] was adorned in your hearts, that is to say, [you thought] that they would be annihilated by being slain and would not return, and you thought evil thoughts, that [just mentioned], and other things, and you were a ruined lot’ (būr is the plural of bā’ir), in other words, [a lot to be] destroyed according to God for [having entertained] such [evil] thoughts.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay, but ye deemed) hypocrites (that the messenger and the believers would never return to their own folk) from al-Hudaybiyyah to Medina, (and that was made fair-seeming in your hearts) and you were so convinced of this that you stayed behind, (and ye did think an evil thought) and you thought that Allah will not help His Prophet, (and ye were worthless folk) and you were ruined folk, with unsound and hardened hearts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَكُنتُمْ قَوْماً بُوراً } معناه هَلكى\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And you were a people destroyed} [means] you have perished.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بَلْ ظَنَنْتُمْ } أيها المتخلفون المثقلون { أَن لَّن يَنقَلِبَ } ويرجع { ٱلرَّسُولُ وَٱلْمُؤْمِنُونَ إِلَىٰ أَهْلِيهِمْ أَبَداً } بل يستأصلهم العدو\n فلن يرجع منهم أحد من سفرهم هذا\n بل { وَزُيِّنَ } أي: حُبب وحُسِّن { ذَلِكَ } الاستئصال وعدم الرجوع\n وتمكن { فِي قُلُوبِكُمْ وَ } قد { ظَنَنتُمْ } بزعمكم هذا { ظَنَّ ٱلسَّوْءِ } بالله ورسوله والمؤمنين { وَ } بالجملة: { كُنتُمْ } أزلاً { قَوْماً بُوراً } [الفتح: 12] هالكين في تيه الجهل والعناد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { بل ظننتم أن لن ينقلب الرسولُ والمؤمنون إِلى أهليهم أبداً } بأن يستأصلهم المشركون بالموت، فخشيتم إن كنتم معهم أن يُصيبكم ذلك، فتخلّفتم لأجل ذلك، لا لما ذكرتم من المعاذيرالباطلة، { وزُيِّنَ ذلك في قلوبكم } زيّنه الشيطانُ وقبلتموه، واشتغلتم بشأن أنفسكم، غير مبالين بهم، { وظننتم ظنَّ السَّوء } والمراد به الظن الأول، والتكرير لتشديد التوبيخ والتسجيل عليه بالسوء، أو ما يعمه وغيره من الظنون الفاسدة، كعلو الكفر، وظهور الفساد، وعدم صحة رسالته صلى الله عليه وسلم، فإن الجازم بصحتها لا يحول حول فكره هذه الظنون الباطلة، { وكنتم قوماً بُوراً } هالكين عند الله، مستوجبين لسخطه وعقابه، جمع: بائر، كعائذ وعُوذ، من بار الشيء: هلك وفسد، أي: كنتم قوماً فاسدين في أنفسكم وقلوبكم ونيّاتكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:28",
      "similarity": 0.6589884341470701
    },
    {
      "verse": "25:18",
      "similarity": 0.6356719914600895
    },
    {
      "verse": "35:10",
      "similarity": 0.5188047162004246
    },
    {
      "verse": "35:29",
      "similarity": 0.5036699854983241
    },
    {
      "verse": "2:95",
      "similarity": 0.1995131488460022
    }
  ]
}