{
  "chapter": "الفتح",
  "text": "انا فتحنا لك فتحا مبينا",
  "translations": [
    {
      "translation": "WE HAVE GIVEN you a splendent victory\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), surely We have granted you a clear victory\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have granted to you, (Muhammad), a manifest victory,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed, for your sake (O dear Prophet Mohammed – peace and blessings be upon him), bestowed a clear victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have given you a manifest victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have given to you a clear victory\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have given thee a manifest victory,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We have given thee (O Muhammad) a signal victory,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, We have granted you a clear victory\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! a victory We have given thee, a manifest victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We have inaugurated for you a clear victory,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We have granted thee a manifest Victory:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have given you (O Muhammad SAW) a manifest victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have opened for you (Prophet Muhammad) a clear opening,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have granted you a conspicuous victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have given you, [O Muhammad], a clear conquest\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:1] Verily We have given you, We have ordained [for you] the conquest (fath) of Mecca, and other places in the future by force, as a result of your struggle, a clear victory, [one that is] plain and manifest;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said in the interpretation of Allah's saying (Lo! We have given thee (0 Muhammad) a signal victory): '(Lo! We have given thee (0 Muhammad) a signal victory) without fighting, and the treaty of al-Hudaybiyyah is part of this victory, except that in al- Hudaybiyyah they threw stones at each other; it is also said that this means: We have enjoined for you a manifest judgement; We honoured you with Islam and prophethood and commanded you to call people to them,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { إِنَّا فَتَحْنَا لَكَ فَتْحاً مُّبِيناً } معناه قَضَينا لَكَ قَضاءً بَيناً، وحكمنا لَكَ حُكماً يُريدُ فَتحَ خَيبر\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنَّا فَتَحنا لكَ فَتْحاً مُبِيناً } فتوح رسول الله صلى الله عليه وسلم ثلاثة: أوّلها: الفتح القريب المشار إليه بقوله:\n\n[الفتح، الآية:27] وهو فتح باب القلب بالترقي عن مقام النفس وذلك بالمكاشفات الغيبية والأنوار اليقينية، وقد شاركه في ذلك أكثر المؤمنين كما أشار إليه بقوله:\n\n[الصف، الآية:13]، وقوله:\n\n[الفتح، الآية:18] ويلزمه البشارة بالأنوار الملكوتية والتجليات الصفاتية كما قال:\n\n[الأحزاب، الآية:47]\n وحصول المعارف اليقينية وكشوف الحقائق القدسية المشار إليها بقوله:\n\n[الفتح، الآية:19]",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّا } من مقام عظيم جودنا { فَتَحْنَا لَكَ } يا أكمل الرسل { فَتْحاً مُّبِيناً } [الفتح: 1] ظاهراً عظيماً بأن ألهمنا عليك، وأوضحنا لك طريق الخروج من مضيق الإمكان إلى فضاء الوجوب، ويسرنا لك الترقي والعروج ومن حضيض الجهل وأودية الضلال على ذروة العلم وأوج الوصال\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنَّا فتحنا لك } الفتح عبارة عن الظفر بالبلدة عنوةً أو صُلحاً، بحرب أو بدون، فإنه ما لم يقع الظفر مُنْغَلِقٌ، مأخوذ من: فتح باب الدار\n وإسناده إلى نون العظمة لإسناد الفعل إلى الله تعالى خلقاً وإيجاداً\n قيل: المراد به فتح مكة، وهو المروي عن أنس رضي الله عنه، بُشِّر به صلى الله عليه وسلم عند انصرافه من الحُديبية\n والتعبير عنه بصيغة الماضي على سَنَن الأخبار الإلهية المحققة الوقوع، للإذيان بتحققه، تأكيداً للتبشير، وتصدير الكلام بحرف التحقيق لذلك، وفيه من الفخامة والدلالة على علو شأن المخبَر به - وهو الفتح - ما لا يخفى\n وقيل: هو فتح الحديبية، وهو الذي عند البخاري عن أنس، وهو الصحيح عند ابن عطية، وعليه الجمهور\n وفيها أُخذت البيعة على الجهاد، وهو كان سبب إظهار الإسلام وفشوه، وذلك أنّ المشركين كانوا ممنوعين من مخالطة أهل الإسلام، للحرب التي كانت بينهم، فلما وقع الصلح اختلط الناسُ بعضهم مع بعض، وجعل الكفارُ يرون أنوارَ الإسلام، ويسمعون القرآن، فأسلم حينئذ بشر كثير قبل فتح مكة\n وقد ورد عنه صلى الله عليه وسلم حين بلغه أن رجلاً قال: ما هذا بفتح، لقد صَدُّونا عن البيت، ومَنعونا، قال:\n\n \" بل هو أعظم الفتوح، وقد رضي المشركون أن يدفعوكم بالراح، ويسألوكم القضية، ويرغبوا إليكم في الأمان، وقد رأوا منكم ما يكرهون \" \n\nوعن الشعبي أنه قال: نزلت سورة الفتح بالحديبية، وأصاب رسولُ الله صلى الله عليه وسلم في تلك الغزوة ما لم يصب في غزوة، حيث بُويع بيعة الرضوان، وغُفر له ما تقدّم من ذنبه وما تأخّر، وبلغ الهَديُ مَحِلَّه، وبُشِّروا بخيبر، وظهرت الروم على فارس، ففرح به المسلمون، وكان في فتح الحديبية آية عظيمة، وهي أنه نزح ماؤها حتى لم يبقَ فيها قطرة، فتمضمض رسولُ الله صلى الله عليه وسلم ثم مجّه فيها، فدرّت بالماء، حتى شرب جميع مَن كان معه، وقيل: جاش بالماء حتى امتلأت ولم ينفد ماؤها بعدُ\n وقيل: هو جميع ما فتح له صلى الله عليه وسلم، من الإسلام، والدعوة، والنبوة، والحجة، والسيف، ولا فتح أبين منه وأعظم، وهو رأس الفتوح كافة إذ لا فتح من فتوح الإسلام إلا هو شعبة من شُعبه، وفرع من فروعه\n وقيل: الفتح: بمعنى القضاء، والمعنى: قضينا لك على أهل مكة أن تدخلها من قابل، وأيّاً ما كان فحذف المفعول للقصد إلى نفس الفعل، والإيذان بأنّ مناط التبشير هو نفس الفتح الصادر عنه سبحانه، لا خصوصية المفتوح\n قاله أبو السعود\n { فتحاً مبيناً } ظاهر الأمر، مكشوف الحال، فارقاً بين الحق والباطل",
      "translations": []
    }
  ]
}