{
  "chapter": "الفتح",
  "text": "لقد رضى الله عن المؤمنين اذ يبايعونك تحت الشجرة فعلم ما فى قلوبهم فانزل السكينة عليهم واثبهم فتحا قريبا",
  "translations": [
    {
      "translation": "Allah was pleased with the muminun when they pledged allegiance to you under the tree. He knew what was in their hearts, and sent down serenity to them and has rewarded them with an imminent victory,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God was pleased with the believers when they swore allegiance to you under the tree, for He knew well what was in their hearts, and sent down tranquility on them, and rewarded them with an expeditious victory\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah was much pleased with the believers when they swore fealty to you under the tree. He knew what was in their hearts. So He bestowed inner peace upon them and rewarded them with a victory near at hand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is pleased with the believers for their pledging obedience to you under the tree. He knew whatever was in their hearts, thus, He granted them confidence and rewarded them with an immediate victory\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah was truly pleased with the believers when they swore allegiance to you beneath the tree – so He knew what was in their hearts – He therefore sent down peace upon them, and rewarded them with an imminent victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah was pleased with the believers when they gave the pledge to you under the tree, He knew what was in their hearts, and He sent down As-Sakinah upon them, and He rewarded them with a near victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Allah was well pleased with the believers when they swore allegiance to you under the tree, and He knew what was in their hearts, so He sent down tranquillity on them and rewarded them with a near victory,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God was well pleased with the believers when they were swearing fealty to thee under the tree, and He knew what was in their hearts, so He sent down the Shechina upon them, and rewarded them with a nigh victory\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah was well pleased with the believers when they swore allegiance unto thee beneath the tree, and He knew what was in their hearts, and He sent down peace of reassurance on them, and hath rewarded them with a near victory;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God was pleased with the believers when they swore allegiance to you [Prophet] under the tree: He knew what was in their hearts and so He sent tranquillity down to them and rewarded them with a victory near at hand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly well-pleased was Allah with the believers when they sware fealty Unto thee under the tree, and he knew that which was in their hearts, wherefore He sent down tranquillity on them, and rewarded them with a victory near at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah was certainly pleased with the faithful when they swore allegiance to you under the tree. He knew what was in their hearts, so He sent down composure on them, and requited them with a victory near at hand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah's Good Pleasure was on the Believers when they swore Fealty to thee under the Tree: He knew what was in their hearts, and He sent down Tranquillity to them; and He rewarded them with a speedy Victory;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah was pleased with the believers when they gave their Bai'a (pledge) to you (O Muhammad SAW) under the tree, He knew what was in their hearts, and He sent down As-Sakinah (calmness and tranquillity) upon them, and He rewarded them with a near victory,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah was pleased with the believers when they swore allegiance to you under the tree and He knew what was in their hearts. Therefore, He sent downtranquility upon them and rewarded them with a victory close by\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God was pleased with the believers, when they pledged allegiance to you under the tree. He knew what was in their hearts, and sent down serenity upon them, and rewarded them with an imminent conquest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly was Allah pleased with the believers when they pledged allegiance to you, [O Muhammad], under the tree, and He knew what was in their hearts, so He sent down tranquillity upon them and rewarded them with an imminent conquest\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:18] Verily God was pleased with the believers when they pledged allegiance to you, at al-Hudaybiyya, under the tree, this was an acacia — they [these believers] numbered 1300 or more; he took an oath of allegiance from them that they would fight against Quraysh and not [attempt to] flee from death. And He, God, knew what was in their hearts, of sincerity and loyalty, so He sent down the spirit of Peace upon them, and rewarded them with a near victory, which was the conquest of Khaybar, following their departure from al-   Hudaybiyya,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned His pleasure with those who swore allegiance at the pledge of Ridwan, saying: (Allah was well pleased with the believers when they swore allegiance unto thee beneath the tree) when they swore allegiance to you at al-Hudaybiyyah under the Samurah tree; they were about 1,500 men who swore allegiance to assist and defend the Prophet and to remain in fighting, if need be, till death, (and He knew what was in their hearts) of truthfulness and loyalty, (and He) Allah Exalted is He (sent down peace of reassurance) tranquillity (on them) and removed zealotry from them, (and hath rewarded them) after this (with a near victory) the conquest of Khaybar, soon after that; 598\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَثَابَهُمْ فَتْحاً قَرِيباً } معناه فَتْحُ خَيبرٍ\n ويقال: الفتوحُ التي تُفتحُ لَهُم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على وجه التحريض والترغيب للمؤمنين: { لَّقَدْ رَضِيَ ٱللَّهُ عَنِ ٱلْمُؤْمِنِينَ } المخلصين في الإطاعة والانقياد { إِذْ يُبَايِعُونَكَ } يا أكمل الرسل { تَحْتَ ٱلشَّجَرَةِ } يوم الحديبية بيعة الرضوان، والشجرة هي: السمرة أو السدرة { فَعَلِمَ } سبحانه بعلمه الحضوري { مَا فِي قُلُوبِهِمْ } من الرغبة والإخلاص { فَأنزَلَ ٱلسَّكِينَةَ } أي: الطمأنينة والوقار { عَلَيْهِمْ وَأَثَابَهُمْ } بعدما أيسوا عن فتح مكة، ورجعوا من الحديبية { فَتْحاً قَرِيباً } [الفتح: 18] هو فتح خيبر بعد رجوعهم منها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { لقد رَضِي اللّهُ عن المؤمنين } وهم الذين ذكر شأن مبايعتهم بقوله: { إن الذين يبايعونك\n\n\n } الآية، وبهذه الآية سميت بيعة الرضوان و \" إذ \" منصوب بـ \" رَضِيَ \" ، وصيغة المضارع لاستحضار الصورة العجيبة، و { تحت الشجرة }: متعلق به، أو: بمحذوف، حال من مفعوله، أي: رَضِيَ عنهم وقت مبايعتهم لك { تحت الشجرة } أو: حاصلاً تحتها\n رُوي: أنه صلى الله عليه وسلم لمّا نزل الحديبية، بعث خِراش بن أمية الخزاعي، رسولاً إلى أهل مكة، فَهَمُّوا به، وأنزلوا عن بعيره، فمنعته الأحابيش، فلما رجع دعا بعُمر ليبعثه، فقال: يا رسول الله إني أخاف قريشاً على نفسي، وليس بمكة من بني عدي أحدٌ يمنعني، ولكن عثمان أعزّ بمكة مني، فبعث عثمان إلى أبي سفيان وأشراف قريش، يخبرهم أنه صلى الله عليه وسلم جاء زائراً إلى البيت، مُعظِّماً لحُرمته، ولم يُرد حرباً، فوقروه، وقالوا: إن شئت أن تطوف بالبيت فافعل، فقال: ما كنت لأطوف قبلَ أن يطوف رسول الله صلى الله عليه وسلم، فاحتبس عندهم، فأُرجِفَ بأنهم قتلوه، فقال صلى الله عليه وسلم:\n\n \" لا نبرح حتى نناجز القوم \" \n\nودعا الناسَ إلى البيعة، فبايعوه تحت الشجرة – وكانت سمرة وقيل: سِدرة – على أن يُقاتلوا قريشاً، ولا يفرُّوا، وأول مَن بايع \" أبو سنان الأسدي \" ، واسمه: وهب بن عبد الله بن محصن، ابن اخي عكاشة بن مِحصن\n وقيل: بايعوه على الموت عنده، فقال لهم رسول الله صلى الله عليه وسلم:\n\n \" أنتم اليوم خير أهل الأرض \" \n\nوقال أيضاً:\n\n \" لا يدخل النارَ أحد ممن بايع تحت الشجرة \" \n\nوكانوا ألفاً وخمسمائة وخمسةً وعشرين، وقيل: ألفاً وأربعمائة\n والحديبية بتخفيف الياء، قاله في المصباح، وهي على عشرة أميال من مكة\n { فعَلِمَ ما في قلوبهم } من الإخلاص، وصدق الضمائر فيما بايعوا عليه\n وقال القشيري: عِلِمَ ما في قلوبهم من الاضطراب والتشكيك، وذلك أنه صلى الله عليه وسلم رأى في منامه أنهم يدخلون المسجد الحرام آمنين، فبشّر أصحابه، فلمام صُدُّوا خامر قلوبَهم شكٌّ، { فأنزل } اللّهُ { السكينةَ عليهم } أي: اليقين والطمأنينة، فذهب عنهم\n ثم قال: وفي الآية دليلٌ على أنه قد يخطر ببال الإنسان خواطر مشكِّكة، وفي الرَّيب مُوقعة، ثم لا عبرة، فإن الله تعالى إذا أراد بعبده خيراً ألزم التوحيد قلبَه، وقارن التحقيق سِرَّه، فلا يضرُّه كيدُ الشيطان\n قال تعالى:\n\n[الأعراف: 201]الآية\n { فأنزل السكينة عليهم } أي: الطمأنينة والأمن، وسكون النفس، بالربط على قلوبهم، { وأثابهم } أي: جازاهم { فتحاً قريباً } وهو فتح خيبر عقب انصرافهم من الحديبية كما تقدّم",
      "translations": []
    }
  ]
}