{
  "chapter": "الفتح",
  "text": "سيقول المخلفون اذا انطلقتم الى مغانم لتاخذوها ذرونا نتبعكم يريدون ان يبدلوا۟ كلم الله قل لن تتبعونا كذلكم قال الله من قبل فسيقولون بل تحسدوننا بل كانوا۟ لا يفقهون الا قليلا",
  "translations": [
    {
      "translation": "When you go out to get the booty, those who remained behind will say, 'Allow us to follow you,' desiring to alter Allah's words. Say: 'You may not follow us. That is what Allah said before.' They will say, 'It is only because you envy us.' No indeed! How little they have understood!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who had stayed behind will say: \"When you depart for taking the spoils, allow us to follow you.\" They wish to change the word of God. Tell them: \"You will not follow us. That is what God has already said before.\" They will say: \"You are envious of our gain.\" The fact is they understand but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you press forth for the spoils, those who were left behind will say: “Let us accompany you.” They want to change the command of Allah. Say to them (in clear words): “You shall not accompany us. Thus has Allah already said.” Then they will say: “Nay; but you are jealous of us.” The truth is that they understand little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The laggardly Bedouins will say, \"When you leave to collect the spoils, let us follow you.\" They want to alter the command of God (that only the participating believers are entitled to such benefit). Tell them, \"You can never follow us for such a purpose. God has said before and He will say again (what type of people you are). In fact, you are jealous of us.\" The truth is that they understand very little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who had stayed behind will now say, “When you go to receive the war booty, let us also go with you”; they wish to change the Words of Allah; say “You shall never come with us – this is already decreed by Allah”; so they will now say, “But rather you envy us”; in fact they never understood except a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who lagged behind will say, when you set forth to take the spoils, \"Allow us to follow you.\" They want to change Allah's Words. Say: \"You shall not follow us; thus Allah has said beforehand.\" Then they will say: \"Nay, you envy us.\" Nay, but they understand not except a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are left behind will say when you set forth for the gaining of acquisitions: Allow us (that) we may follow you. They desire to change the world of Allah. Say: By no means shall you follow us; thus did Allah say before. But they will say: Nay! you are jealous of us. Nay! they do not understand but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Bedouins who were left behind will say, when you set forth after spoils, to take them, 'Let us follow you,' desiring to change God's words. Say: 'You shall not follow us; so God said before.' Then they will say, 'Nay, but you' are jealous of us.' Nay, but they have not understood except a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were left behind will say, when ye set forth to capture booty: Let us go with you. They fain would change the verdict of Allah. Say (unto them, O Muhammad): Ye shall not go with us. Thus hath Allah said beforehand. Then they will say: Ye are envious of us. Nay, but they understand not, save a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you [believers] set off to gather the spoils, those that stayed behind will say, \"Let us come with you.\" They want to change God's word, but tell them, \"You shall not follow us. God has declared this beforehand.\" Then they will say, \"You are jealous of us.\" But how little they understand!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who lagged behind will presently, When ye march forth to take spoils, leave us, we shall follow say you. They intend to change the word of Allah. Say thou: ye shall by no means follow us; thus hath Allah said afore. Then they will say: Aye! ye envy us. Aye! little it is they are wont to understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[In the near future] when you will set out to capture booty, those who stayed behind [in this journey] will say, : ‘Let us follow you.’ They desire to change the word of Allah. Say, ‘You will never follow us! Allah has said thus beforehand.’ Then they will say, ‘You are envious of us.’ Indeed, they do not understand but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who lagged behind (will say), when ye (are free to) march and take booty (in war): \"Permit us to follow you.\" They wish to change Allah's decree: Say: \"Not thus will ye follow us: Allah has already declared (this) beforehand\": then they will say, \"But ye are jealous of us.\" Nay, but little do they understand (such things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who lagged behind will say, when you set forth to take the spoils, \"Allow us to follow you,\" They want to change Allah's Words. Say: \"You shall not follow us; thus Allah has said beforehand.\" Then they will say: \"Nay, you envy us.\" Nay, but they understand not except a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you set forth to take the spoils, those Bedouins who lagged behind will say: 'Let us follow you' They hope to change the Words of Allah. Say: 'Youshall not follow us. Allah has said so before' They will reply: 'No, you are envious of us' Rather, they have only understood a little!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who lagged behind will say when you depart to collect the gains, “Let us follow you.” They want to change the Word of God. Say, “You will not follow us; God has said so before.” Then they will say, “But you are jealous of us.” In fact, they understand only a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who remained behind will say when you set out toward the war booty to take it, \"Let us follow you.\" They wish to change the words of Allah. Say, \"Never will you follow us. Thus did Allah say before.\" So they will say, \"Rather, you envy us.\" But [in fact] they were not understanding except a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:15] Those, mentioned, who were left behind will say, when you set forth after spoils, namely, the spoils of Khaybar, in order to capture them, ‘Let us follow you’, that we might [also] take a share of it. They desire, thereby, to change the words of God (kalāma’Llāhi: a variant reading has kalima’Llāhi), in other words, His promising of the spoils of Khaybar exclusively for those who were at al-Hudaybiyya. Say: ‘You shall never follow us! Thus has God said beforehand’, that is, prior to our return. Then they will say, ‘Nay, but you are envious of us’, lest we might acquire a share of the spoils, and therefore you say this [that you say]. Nay, but they never understood, anything of religion, [all] except a few, of them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who were left behind) at the conquest of al-Hudaybiyyah, i.e. Banu Ghifar, Aslam, Ashja' and some people from Muzaynah and Juhaynah (will say, when ye set forth to capture booty) the booty of Khaybar: (Let us go with you) to Khaybar. (They fain would change the verdict of Allah) when he said to His Prophet not to let them accompany him to any other conquest after failing to join the conquest of al-Hudaybiyyah. (Say) to Banu 'Amir, Dayl, Aslam, Ashja', and a group from Muzaynah and Juhaynah: (Ye shall not go with us) to Khaybar except as volunteers but you will not have a share of the booty. (Thus) just as we told you (hath Allah said beforehand) in surah Repentance (say unto them: Ye shall never more go out with me nor fight with me against a foe...). Upon hearing this, the hypocrites said to the believers: Allah has not commanded you this, it is rather because you are resentfully envious of us for sharing the booty with you. So Allah said: (Then they will say: Ye are envious of us) regarding the booty. (Nay, but they understand not) the command of Allah, (save a little) neither much nor a little.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما سمع المخلفون من الأعراب يوم الحديبية أن الله قد وعد المؤمنين فتح خيبر، وخص لهم الغنائم، قصدوا الخروج نحوها طامعين الغنائم؛ لذلك أخبر الله سبحانه حبيبه بقصدهم هذا، فقال: { سَيَقُولُ ٱلْمُخَلَّفُونَ } المذكورات وقت { إِذَا ٱنطَلَقْتُمْ إِلَىٰ مَغَانِمَ } الموعودة لكم خاصة { لِتَأْخُذُوهَا } بفضل الله إياكم: { ذَرُونَا نَتَّبِعْكُمْ } بغزوتكم هذه وننصركم، مع أنهم لا يقصدون الرفاقة والوفاق في نفوسهم ونياتهم، بل { يُرِيدُونَ } ويقصدون بقولهم هذا أن { يُبَدِّلُواْ } ويغيروا { كَلاَمَ ٱللَّهِ } الدال على تخصيص غنائم خيبر لمن حضر الحديبية بدل غنائم مكة\n\n\n\n\n{ قُل } لهم يا أكمل الرسل على وجه التأييد في النفي: { لَّن تَتَّبِعُونَا كَذَٰلِكُمْ } أي: مثلما سمعتم { قَالَ ٱللَّهُ } المطلع على ما في نفوسهم من النفاق والشقاق { مِن قَبْلُ } أي: قبل تهيئاتكم أيها المؤمنون للخروج إلى خيبر { فَسَيَقُولُونَ } بعدما سمعوا النهى على وجه التأييد في نفوسهم: ما أمرهم الله هذا { بَلْ تَحْسُدُونَنَا } على أخذ الغنيمة؛ أي: ما حملهم على هذا النهي المؤكد المؤبد إلا الحسد والشح { بَلْ } هم قوم جاهلون { كَانُواْ لاَ يَفْقَهُونَ } ولا يفهمون مراد الله العليم الحكيم عن منعهم هذا { إِلاَّ قَلِيلاً } [الفتح: 15] منهم، وهم المصدقون بالله ورسوله في سرائرهم ونجواهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { سيقول المخلِّفون } المذكورون آنفاً { إِذا انطلقتم إِلى مغانمَ } أي: مغانم خيبر { تأخذونها } حسبما وعدكم الله بها، وخصَّكم بها، عِوض ما فاتكم من مغانم مكة\n و { إذا }: ظرف لما قبله، لا شرط لما بعده، أي: سيقولون عند انطلاقكم إلى مغانم خيبر: { ذَرونا نتَّبِعكم } إلى خيبر، ونشهد معكم قتال أهلها { يريدون إن يُبدِّلوا كلامَ الله } الذي وعد به أهل الحديبية بأن يخصّهم بغنائم خيبر ولا يشاركهم فيها أحد، فأراد المخلَّفون أن يُشاركوهم ويُبدلوا وعد الله\n وكانت وقعة الحديبية في ذي الحجة سنة ست، فلما رجع إلى المدينة أقام بها بقية ذي الحجة، ثم غزا في أول السابعة خيبر، ففتحها، وغنم أموالاً كثيرة، فخصصها بأهل الحديبية، بأمره تعالى، { قل } لهم إقناطاً لهم: { لن تتبعونا } إلى خيبر، وهو نفي بمعنى النهي، للمبالغة، أي: لا تتبعونا، أو: نفي محض، إخبار من الله تعالى بعدم اتباعهم وألا يبدّل القول لديه\n { كذلكم قال اللّهُ من قبلُ } أي: من قبل انصرافهم إلى الغنيمة، وأنَّ غنيمة خيبر لَمن شهد الحديبية فقط، { فسيقولون } للمؤمنين عند سماع هذا النهي: { بل تحسدوننا } أي: ليس ذلك النهي من عند الله، بل تحسدوننا أن نشارككم في الغنائم، { بل كانوا لا يفقهون } كلام الله { إِلا قليلاً } شيئاً قليلاً، يعني: مجرد اللفظ، أو: لا يفهمون إلا فهماً قليلاً وهو فطنتهم لأمور الدنيا دون الدين، وهو ردٌّ لقولهم الباطل، ووصف لهم بسوء الفهم والجهل المفرط\n والفرق بين الإضرابين: أن الأول ردَّ أن يكون حكم الله ألا يتبعوهم وإثبات الحسد، والثاني إضرابٌ عن وصفهم بإضافة الحسد إلى المؤمنين إلى وصفهم بما هو أعظم منه، وهو الجهل وقلة الفقه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "113:5",
      "similarity": 0.5651760795462555
    },
    {
      "verse": "4:54",
      "similarity": 0.5384929411607607
    },
    {
      "verse": "2:109",
      "similarity": 0.4327151345807471
    },
    {
      "verse": "48:19",
      "similarity": 0.3129550045763636
    },
    {
      "verse": "8:69",
      "similarity": 0.28504997518436653
    }
  ]
}