{
  "chapter": "الفتح",
  "text": "لقد رضى الله عن المؤمنين اذ يبايعونك تحت الشجرة فعلم ما فى قلوبهم فانزل السكينة عليهم واثبهم فتحا قريبا",
  "translations": [
    {
      "translation": "Allah was pleased with the muminun when they pledged allegiance to you under the tree. He knew what was in their hearts, and sent down serenity to them and has rewarded them with an imminent victory,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God was pleased with the believers when they swore allegiance to you under the tree, for He knew well what was in their hearts, and sent down tranquility on them, and rewarded them with an expeditious victory\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah was much pleased with the believers when they swore fealty to you under the tree. He knew what was in their hearts. So He bestowed inner peace upon them and rewarded them with a victory near at hand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is pleased with the believers for their pledging obedience to you under the tree. He knew whatever was in their hearts, thus, He granted them confidence and rewarded them with an immediate victory\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah was truly pleased with the believers when they swore allegiance to you beneath the tree – so He knew what was in their hearts – He therefore sent down peace upon them, and rewarded them with an imminent victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah was pleased with the believers when they gave the pledge to you under the tree, He knew what was in their hearts, and He sent down As-Sakinah upon them, and He rewarded them with a near victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Allah was well pleased with the believers when they swore allegiance to you under the tree, and He knew what was in their hearts, so He sent down tranquillity on them and rewarded them with a near victory,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God was well pleased with the believers when they were swearing fealty to thee under the tree, and He knew what was in their hearts, so He sent down the Shechina upon them, and rewarded them with a nigh victory\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah was well pleased with the believers when they swore allegiance unto thee beneath the tree, and He knew what was in their hearts, and He sent down peace of reassurance on them, and hath rewarded them with a near victory;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God was pleased with the believers when they swore allegiance to you [Prophet] under the tree: He knew what was in their hearts and so He sent tranquillity down to them and rewarded them with a victory near at hand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly well-pleased was Allah with the believers when they sware fealty Unto thee under the tree, and he knew that which was in their hearts, wherefore He sent down tranquillity on them, and rewarded them with a victory near at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah was certainly pleased with the faithful when they swore allegiance to you under the tree. He knew what was in their hearts, so He sent down composure on them, and requited them with a victory near at hand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah's Good Pleasure was on the Believers when they swore Fealty to thee under the Tree: He knew what was in their hearts, and He sent down Tranquillity to them; and He rewarded them with a speedy Victory;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah was pleased with the believers when they gave their Bai'a (pledge) to you (O Muhammad SAW) under the tree, He knew what was in their hearts, and He sent down As-Sakinah (calmness and tranquillity) upon them, and He rewarded them with a near victory,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah was pleased with the believers when they swore allegiance to you under the tree and He knew what was in their hearts. Therefore, He sent downtranquility upon them and rewarded them with a victory close by\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God was pleased with the believers, when they pledged allegiance to you under the tree. He knew what was in their hearts, and sent down serenity upon them, and rewarded them with an imminent conquest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly was Allah pleased with the believers when they pledged allegiance to you, [O Muhammad], under the tree, and He knew what was in their hearts, so He sent down tranquillity upon them and rewarded them with an imminent conquest\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:18] Verily God was pleased with the believers when they pledged allegiance to you, at al-Hudaybiyya, under the tree, this was an acacia — they [these believers] numbered 1300 or more; he took an oath of allegiance from them that they would fight against Quraysh and not [attempt to] flee from death. And He, God, knew what was in their hearts, of sincerity and loyalty, so He sent down the spirit of Peace upon them, and rewarded them with a near victory, which was the conquest of Khaybar, following their departure from al-   Hudaybiyya,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلَقَدْ رَضِيَ اللَّهُ عَنِ الْمُؤْمِنِينَ إِذْ يُبَايِعُونَكَ تَحْتَ الشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمْ فَأَنْزَلَ السَّكِينَةَ عَلَيْهِمْ وَأَثَابَهُمْ فَتْحًا قَرِيبًا (18(عود إلى تفصيل ما جازى الله به أصحاب بيعة الرضوان المتقدم إجماله في قوله : { إن الذين يبايعونك إنما يبايعون الله } \\[ الفتح : 10 \\] ، فإن كون بيعتهم الرسول صلى الله عليه وسلم تعتبر بيعة لله تعالى أوْمأ إلى أن لهم بتلك المبايعة مكانة رفيعة من خير الدنيا والآخرة ، فلما قطع الاسترسال في ذلك بما كان تحذيراً من النكث وترغيباً في الوفاء ، بمناسبة التضاد وذكر ما هو وسط بين الحالين وهو حال المخلَّفين ، وإبطال اعتذارهم وكشف طويتهم ، وإقصائهم عن الخير الذي أعده الله للمبايعين وأرجائهم إلى خير يسنح من بعدُ إن هم صدقوا التوبة وأخلصوا النية .فقد أنال الله المبايعين رضوانَه وهو أعظم خير في الدنيا والآخرة قال تعالى : { ورضوان من الله أكبر } \\[ التوبة : 72 \\] والشهادة لهم بإخلاص النية ، وإنزاله السكينة قلوبهم ووعدهم بثواب فتح قريب ومغانم كثيرة .وفي قوله : { عن المؤمنين إذ يبايعونك } إيذان بأن من لم يبايع ممن خرج مع النبي صلى الله عليه وسلم ليس حينئذٍ بمؤمن وهو تعريض بالجدّ بن قيس إذ كان يومئذٍ منافقاً ثم حَسن إسلامه .وقد دعيت هذه البيعة بيعةَ الرضوان من قوله تعالى : { لقد رضي الله عن المؤمنين إذ يبايعونك تحت الشجرة } . و { إذ يبايعونك } ظرف متعلّق ب { رضي } ، وفي تعليق هذا الظرف بفعل الرضى ما يفهم أن الرضى مسبب عن مفاد ذلك الظرف الخاص بما أضيف هو إليه ، مع ما يعطيه توقيت الرضى بالظرف المذكور من تعجيل حصول الرضى بحدثان ذلك الوقت ، ومع ما في جعل الجملة المضاف إليها الظرفُ فِعليةً مضارعيّةً من حصول الرضى قبل انقضاء الفعل بل في حال تجدده . فالمضارع في قوله { يبايعونك } مستعمل في الزمان الماضي لاستحضار حالة المبايعة الجليلة ، وكون الرضى حصل عند تجديد المبايعة ولم ينتظر به تمامها ، فقد علمت أن السورة نزلت بعد الانصراف من الحديبية .والتعريف في { الشجرة } تعريف العهد وهي : الشجرة التي عهدها أهل البيعة حين كان النبي صلى الله عليه وسلم جالساً في ظلها ، وهي شجرة من شجر السَّمُر بفتح السين المهملة وضم الميم وهو شجر الطلح . وقد تقدم أن البيعة كانت لما أُرجف بقتل عثمان بن عفان بمكة فعن سلمة بن الأكوع وعبد الله بن عمر ، يزيدُ أحدهما على الآخر «بينما نحن قائلون يوم الحديبية وقد تفرق الناس في ظلال الشجر إذ نادى عمر بن الخطاب : أيّها الناس البيعةَ البيعةَ ، نَزَل روحُ القدُس فاخرُجوا على اسم الله وكان رسول الله صلى الله عليه وسلم هو الذي دعا الناس إلى البيعة فثار الناس إلى رسول الله صلى الله عليه وسلم وهو تحت الشجرة فبايعوه كلهم إلا الجدَّ بن قيس» .وعن جابر بن عبد الله بعدَ أن عمي لو كنت أبصر لأريتكم مكان الشجرة .وتواتر بين المسلمين علم مكان الشجرة بصلاة الناس عند مكانها . وعن سعيد بن المسيب عن أبيه المسيب أنه كان فيمن بايع رسول الله صلى الله عليه وسلم تحت الشجرة قال : فلما خرجنا من العام المقبل أي في عمرة القضية نسيناها فلم نقدر عليها وعن طارق بن عبد الرحمان قال : انطلقت حاجا فمررت بقوم يصلون قلت : ما هذا المسجد؟ قالوا : هذه الشجرة حيث بايع رسولُ الله بيعة الرضوان . فأتيت سعيد بن المسيب فأخبرته فقال سعيد : إن أصحاب محمد صلى الله عليه وسلم لم يعلموها وعلمتموها أنتم أفأنتم أعلم» .والمراد بقول طارق : ما هذا المسجد : مكانُ السجود ، أي الصلاة ، وليس المراد البيت الذي يبني للصلاة لأن البناء على موضع الشجرة وقع بعد ذلك الزمن فهذه الشجرة كانت معروفة للمسلمين وكانوا إذا مروا بها يصلون عندها تيمنا بها إلى أن كانت خلافة عمر فأمر بقطعها خشية أن تكون كذاتتِ أنواط التي كانت في الجاهلية ، ولا معارضة بين ما فعله المسلمون وبين ما رواه سعيد بن المسيب عن أبيه أنه وبعض أصحابه نسوا مكانها لأن الناس متفاوتون في توسُّم الأمكنة واقتفاء الآثار .والمروي أن الذي بنى مسجداً على مكان الشجرة أبو جعفر المنصور الخليفة العباسي ولكن في المسجد المذكور حجر مكتوب فيه «أمر عبد الله أمير المؤمنين أكرمه الله ببناء هذا المسجد مسجد البيعة وأنه بني سنة أربع وأربعين ومائتين ، وهي توافق مدة المتوكّل جعفر بن المعتصم وقد تخرب فجدده المستنصر العباسي سنة 629 ثم جدده السلطان محمود خان العثماني سنة 1254 وهو قائم إلى اليوم .وذكر { تحت الشجرة } لاستحضار تلك الصورة تنويهاً بالمكان فإن لذكر مواضع الحوادث وأزمانها معاني تزيد السامع تصوراً ولما في تلك الحوادث من ذكرى مثل مواقع الحروب والحوادث كقول عبد الله بن عباس «ويوم الخميس وما يوم الخميس اشتد برسول الله صلى الله عليه وسلم وجعه» الحديث . ومواقع المصائب وأيامها .و { إذ } ظرف يتعلق بفعل { رضي } ، أي رضي الله عنهم في ذلك الحين . وهذا رضى خاص ، أي تعلّق رضى الله تعالى عنهم بتلك الحالة .والفاء في قوله : { فعلم ما في قلوبهم } ليست للتعقيب لأن علم الله بما في قلوبهم ليس عقب رضاه عنهم ولا عقب وقوع بيعتهم فتعين أن تكون فاء فصيحة تفصح عن كلام مقدر بعدها . والتقدير : فلما بايعوك علم ما في قلوبهم من الكآبة ، ويجوز أن تكون الفاء لتفريع الأخبار بأن الله علم ما في قلوبهم بعد الإخبار برضى الله عنهم لما في الإخبار بعلمه ما في قلوبهم من إظهار عنايته بهم . ويجوز أن يكون المقصود من التفريع قوله : { فأنزل السكينة عليهم } ويكون قوله : { فعلم ما في قلوبهم } توطئة له على وجه الاعتراض .والمعنى : لقد رضي الله عن المؤمنين من أجل مبايعتهم على نصرك فلما بايعوا وتحفزوا لقتال المشركين ووقع الصلح حصلت لهم كآبة في نفوسهم فأعلمهم الله أنه اطلع على ما في قلوبهم من تلك الكآبة ، وهذا من علمه الأشياء بعد وقوعها وهو من تعلق علم الله بالحوادث بعد حدوثها ، أي علمه بأنها وقعت وهو تعلق حادث مثل التعلقات التنجيزية . والمقصود بإخبارهم بأن الله علم ما حصل في قلوبهم الكآبة عن أنه قَدَر ذلك لهم وشكرهم على حبهم نصر النبي صلى الله عليه وسلم بالفعل ولذلك رتب عليه قوله : { فأنزل السكينة عليهم وأثابهم فتحاً قريباً } .والسكينة هنا هي : الطمأنينة والثقة بتحقيق ما وعدهم الله من الفتح والارتياض على ترقبه دون حسرة فترتب على علمه ما في قلوبهم إنزاله السكينة عليهم ، أي على قلوبهم فعبر بضميرهم عوضاً عن ضمير { قلوبهم } لأن قلوبهم هي نفوسهم .وعطف { أثابهم } على فعل { رضي اللَّه } . ومعنى أثابهم : أعطاهم ثواباً ، أي عوضاً ، كما يقال في هبة الثواب ، أي عوضهم عن المبايعة بفتح قريب . والمراد : أنه وعدهم بثواب هو فتح قريب ومغانم كثيرة ، ففعل { أثابهم } مستعمل في المستقبل . وهذا الفتح هو فتح خيبر فإنه كان خاصاً بأهل الحديبية وكان قريباً من يوم البيعة بنحو شهر ونصف .\n\n",
      "translations": [
        {
          "translation": "Allah then mentioned His pleasure with those who swore allegiance at the pledge of Ridwan, saying: (Allah was well pleased with the believers when they swore allegiance unto thee beneath the tree) when they swore allegiance to you at al-Hudaybiyyah under the Samurah tree; they were about 1,500 men who swore allegiance to assist and defend the Prophet and to remain in fighting, if need be, till death, (and He knew what was in their hearts) of truthfulness and loyalty, (and He) Allah Exalted is He (sent down peace of reassurance) tranquillity (on them) and removed zealotry from them, (and hath rewarded them) after this (with a near victory) the conquest of Khaybar, soon after that; 598\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَثَابَهُمْ فَتْحاً قَرِيباً } معناه فَتْحُ خَيبرٍ\n ويقال: الفتوحُ التي تُفتحُ لَهُم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His words {and bestowed upon them a close victory} mean the opening of Khaybar.\n It is said: The victory that is opened for them",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nولتحقيق هذا الثواب لاطلاع الله تعالى على صفاء فطرتهم قال: { لَقَد رضي الله عن المُؤْمنين إذْ يُبَايعونك تحتَ الشَّجرة فعلم ما في قُلُوبهم } من الصدق والعزيمة على الوفاء بالعهد وحفظ النور المذكور { فأنزلَ السكينَةَ عليهم } بتلألؤ نور التجلي الصفاتي الذي هو نور كمالي على نور ذاتي فحصل لهم اليقين { وأثابهم } الفتح المذكور\n فحصلوا على مقام الرضا ورضوا عنه بما أعطاهم من الثواب",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والشجرة هي: السمرة أو السدرة { فَعَلِمَ } سبحانه بعلمه الحضوري { مَا فِي قُلُوبِهِمْ } من الرغبة والإخلاص { فَأنزَلَ ٱلسَّكِينَةَ } أي: الطمأنينة والوقار { عَلَيْهِمْ وَأَثَابَهُمْ } بعدما أيسوا عن فتح مكة\n ورجعوا من الحديبية { فَتْحاً قَرِيباً } [الفتح: 18] هو فتح خيبر بعد رجوعهم منها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { لقد رَضِي اللّهُ عن المؤمنين } وهم الذين ذكر شأن مبايعتهم بقوله: { إن الذين يبايعونك\n\n\n } الآية\n وبهذه الآية سميت بيعة الرضوان و \" إذ \" منصوب بـ \" رَضِيَ \" \n وصيغة المضارع لاستحضار الصورة العجيبة\n و { تحت الشجرة }: متعلق به\n أو: بمحذوف\n حال من مفعوله\n أي: رَضِيَ عنهم وقت مبايعتهم لك { تحت الشجرة } أو: حاصلاً تحتها\n رُوي: أنه صلى الله عليه وسلم لمّا نزل الحديبية\n بعث خِراش بن أمية الخزاعي\n رسولاً إلى أهل مكة\n فَهَمُّوا به\n وأنزلوا عن بعيره\n فمنعته الأحابيش\n فلما رجع دعا بعُمر ليبعثه\n فقال: يا رسول الله إني أخاف قريشاً على نفسي\n وليس بمكة من بني عدي أحدٌ يمنعني\n ولكن عثمان أعزّ بمكة مني\n فبعث عثمان إلى أبي سفيان وأشراف قريش\n يخبرهم أنه صلى الله عليه وسلم جاء زائراً إلى البيت\n مُعظِّماً لحُرمته\n ولم يُرد حرباً\n فوقروه\n وقالوا: إن شئت أن تطوف بالبيت فافعل\n فقال: ما كنت لأطوف قبلَ أن يطوف رسول الله صلى الله عليه وسلم\n فاحتبس عندهم\n فأُرجِفَ بأنهم قتلوه\n فقال صلى الله عليه وسلم:\n \" لا نبرح حتى نناجز القوم \" \nودعا الناسَ إلى البيعة\n فبايعوه تحت الشجرة – وكانت سمرة وقيل: سِدرة – على أن يُقاتلوا قريشاً\n ولا يفرُّوا\n وأول مَن بايع \" أبو سنان الأسدي \" \n واسمه: وهب بن عبد الله بن محصن\n ابن اخي عكاشة بن مِحصن\n وقيل: بايعوه على الموت عنده\n فقال لهم رسول الله صلى الله عليه وسلم:\n \" أنتم اليوم خير أهل الأرض \" \nوقال أيضاً:\n \" لا يدخل النارَ أحد ممن بايع تحت الشجرة \" \nوكانوا ألفاً وخمسمائة وخمسةً وعشرين\n وقيل: ألفاً وأربعمائة\n والحديبية بتخفيف الياء\n قاله في المصباح\n وهي على عشرة أميال من مكة\n { فعَلِمَ ما في قلوبهم } من الإخلاص\n وصدق الضمائر فيما بايعوا عليه\n وقال القشيري: عِلِمَ ما في قلوبهم من الاضطراب والتشكيك\n وذلك أنه صلى الله عليه وسلم رأى في منامه أنهم يدخلون المسجد الحرام آمنين\n فبشّر أصحابه\n فلمام صُدُّوا خامر قلوبَهم شكٌّ\n { فأنزل } اللّهُ { السكينةَ عليهم } أي: اليقين والطمأنينة\n فذهب عنهم\n ثم قال: وفي الآية دليلٌ على أنه قد يخطر ببال الإنسان خواطر مشكِّكة\n وفي الرَّيب مُوقعة\n ثم لا عبرة\n فإن الله تعالى إذا أراد بعبده خيراً ألزم التوحيد قلبَه\n وقارن التحقيق سِرَّه\n فلا يضرُّه كيدُ الشيطان\n قال تعالى:\n[الأعراف: 201]الآية\n { فأنزل السكينة عليهم } أي: الطمأنينة والأمن\n وسكون النفس\n بالربط على قلوبهم\n { وأثابهم } أي: جازاهم { فتحاً قريباً } وهو فتح خيبر عقب انصرافهم من الحديبية كما تقدّم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "62:9",
      "similarity": 0.3743862587029919
    },
    {
      "verse": "2:254",
      "similarity": 0.34569158064625016
    },
    {
      "verse": "5:85",
      "similarity": 0.3195958906888269
    },
    {
      "verse": "14:31",
      "similarity": 0.3163128794935749
    },
    {
      "verse": "24:37",
      "similarity": 0.3101268740731381
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/048018.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/048018.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/48:18.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}