{
  "chapter": "الفتح",
  "text": "وعدكم الله مغانم كثيرة تاخذونها فعجل لكم هذه وكف ايدى الناس عنكم ولتكون ءاية للمؤمنين ويهديكم صرطا مستقيما",
  "translations": [
    {
      "translation": "Allah has promised you much booty which you will take, and has hastened this for you and held people's hands back from you, so that it might be a Sign to the muminun, and so that He might guide you to a straight path.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God had promised you many spoils that you would capture; so He gave this soon enough to you, and stayed the hands of men from you that it may serve as a sign for believers, and guide you on the straight path;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised you abundant spoils which you shall acquire. He has instantly granted you this (victory) and has restrained the hands of people from you that it may be a Sign for the believers and He may guide you to a Straight Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised that you will receive much booty. He has enabled you to receive this at this time and has protected you from enemies to make it an evidence (of the Truth) for the believers. He will guide you to the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised you plenty of booty which you will take, and has bestowed this to you quickly, and restrained peoples’ hands from you; and in order that it may be a sign for the believers, and to guide you on the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised you abundant spoils that you will capture, and He has hastened for you this, and He has restrained the hands of men from you, that it may be a sign for the believers, and that He may guide you to the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah promised you many acquisitions which you will take, then He hastened on this one for you and held back the hands of men from you, and that it may be a sign for the believers and that He may guide you on a right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised you many spoils to take; these He has hastened to you, and has restrained the hands of men from you, and that it may be a sign to the believers, and to guide you on a straight path,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah promiseth you much booty that ye will capture, and hath given you this in advance, and hath withheld men's hands from you, that it may be a token for the believers, and that He may guide you on a right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised you many future gains, and He has given you these in advance; and He has restrained the hands of men from harming you, so that it may be a sign for the believers, and so that He may guide you to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath promised you abundant spoils that ye shall take, and these He hath hastened to you, and hath restrained the hands of people from you, that it may be a sign Unto the believers, and that He may guide you to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised you abundant spoils, which you will capture. He has expedited this one for you, and withheld men’s hands from you, so that it may be a sign for the faithful, and that He may guide you to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised you many gains that ye shall acquire, and He has given you these beforehand; and He has restrained the hands of men from you; that it may be a Sign for the Believers, and that He may guide you to a Straight Path;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised you abundant spoils that you will capture, and He has hastened for you this, and He has restrained the hands of men from you, that it may be a sign for the believers, and that He may guide you to a Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised that you take many spoils. He has hastened this to you, and restrained the hands of people from you so that He makes it a sign to the believers and to guide you on a Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised you abundant gains, which you will capture. He has expedited this for you, and has restrained people’s hands from you; that it may be a sign to the believers, and that He may guide you on a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised you much booty that you will take [in the future] and has hastened for you this [victory] and withheld the hands of people from you - that it may be a sign for the believers and [that] He may guide you to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:20] God has promised you abundant spoils which you will capture, through the [various] conquests. So He has expedited this one, the spoils of Khaybar, for you, and withheld men’s hands from you, with regard to your families, after you had set off [on the campaign], as the Jews had intended [to plot] against them; but God cast terror into their hearts; so that it, the expedited one (wa-li-takūna is a supplement to an implied verb, that is to say, li-tashkurūhu, ‘that you may give thanks to Him’) may be a sign for the believers, of their being assisted [by God], and that He may guide you on a straight path, that is to say, the way in which you should rely on Him and entrust any affair to Him, exalted be He;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah promiseth you much booty that ye will capture) this is the booty of Persia which they had not captured yet but would capture a few years later, (and hath given you this) i.e. the booty of Khaybar (in advance, and hath withheld men's hands from you) from fighting you; referring here to Asad and Ghatafan who were allies of Khaybar, (that it) the conquest of Khaybar (may be a token) a lesson and sign (for the believers) this is because the believers were about 8,000 in number while Khaybar were about 70,000, (and that He may guide you on a right path) and that He may hold you firm on an established religion with which He is pleased.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإنه { وَعَدَكُمُ ٱللَّهُ } أيها المؤمنون المخلصون في إطاعة الله ورسوله { مَغَانِمَ كَثِيرَةً تَأْخُذُونَهَا } من أيدي الكفرة إلى قيام الساعة\n إذ يظهر دينكم على الأديان كلها { فَعَجَّلَ لَكُمْ هَـٰذِهِ } غنائم خيبر { وَكَفَّ أَيْدِيَ ٱلنَّاسِ عَنْكُمْ } أي: أهل خيبر وأوليائهم\n وكفى مؤنة عموم من قصد السوء على أموالكم وذراريكم { وَ } إنما فعل بكم سبحانه ذلك { لِتَكُونَ } هذه الكفة والغنيمة { آيَةً } علامة وأمارة { لِّلْمُؤْمِنِينَ } الذين يأتون بعدكم\n ويقتفون أثركم بأن المؤمن المخلص في جوار الله وكنف حفظه وحضانته { وَيَهْدِيَكُمْ صِرَاطاً مُّسْتَقِيماً } [الفتح: 20] هو لثقة بالله وبكرامته ونصره لأوليائه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وعَدَكُمْ اللّهُ مغانِمَ كثيرةً تأخذونها } هو ما فتح على المؤمنين، وغنموه مع النبي صلى الله عليه وسلم وبعده إلى يوم القيامة\n والالتفات إلى الخطاب لتشريفهم في مقام الامتنان\n { فعجَّلَ لكم هذه } المغانم، يعني مغانم خيبر، { وكفَّ أيديَ الناس عنكم } أي: أيدي أهل خيبر وحُلفاءهم من أسد وغطفان حين جاءوا لنصرتهم، فقذف الله في قلوبهم الرعب فانصرفوا، وقيل: أيدي أهل مكة بالصلح، { ولِتكون } هذه الكفَّة { آيةً للمؤمنين } وعبرةً يعرفون أنهم من الله بمكان، وأنه ضامن لنصرتهم والفتح عليهم، أو: لتكون آية يعرفون بها صدقَ الرسول صلى الله عليه وسلم من وعده إياهم عند رجوعه من الحديبية بما ذكر من المغانم، ودخول مكة، ودخول المسجد الحرام آمنين\n واللام إما متعلقة بمحذوف مؤخر، أي: وليكون آية لهم فعل ما فعل من التعجيل والكف، وإما يتعلق بعلة أخرى محذوفة من أحد الفعلين، أي: فعجَّل لكم هذه وكفَّ أيدي الناس عنكم لتغنموها ولتكون\n\n\n الخ، { ويهديكم صراطاً مستقيماً } أي: يزيدكم بصيرةً ويقيناً وثقةً بوعد الله حتى تثقوا في أموركم كلها بوعد الله تعالى\n قال الثعلبي، ولمّا فتح النبيُّ صلى الله عليه وسلم حصونَ خيبر سمع أهل فدك ما صنع عليه السلام بأهل خيبر، فأرسلوا له يسألونه أن يُسيرَهم ويحقن دماءهم، ويخلُّوا له الأموال، ففعل، ثم صالح أهلَ خيبر، على أن يعملوا في أموالهم على النصف، على أنه إن شاء أجلاهم متى شاء، ففعلوا، فكانت خيبر فيئاً للمسلمين، وكانت فدك خالصة له صلى الله عليه وسلم، إذ لم يوجف عليها بخيل ولا ركاب، ولما اطمأن صلى الله عليه وسلم بعد فتح خيبر أهدت له زينب الحارث اليهودية شاة مصليَّة مسمومة، أكثرت في ذراعها السم، فأخذ صلى الله عليه وسلم الذراع، فأكل منه، ثم كلّمه، فأمسك، وأكل معه بشر بن البراء بن معرور، فمات من ساعته، وسَلِمَ صلى الله عليه وسلم حتى قام عليه بعد سنتين، فمات به، فجُمع له بين الشهادة والنبوة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "48:19",
      "similarity": 0.5979497382182132
    },
    {
      "verse": "8:69",
      "similarity": 0.4931273967291183
    },
    {
      "verse": "4:94",
      "similarity": 0.4348319008647285
    },
    {
      "verse": "34:28",
      "similarity": 0.4207474245576942
    },
    {
      "verse": "8:41",
      "similarity": 0.34491378290814184
    }
  ]
}