{
  "chapter": "الفتح",
  "text": "هم الذين كفروا۟ وصدوكم عن المسجد الحرام والهدى معكوفا ان يبلغ محله ولولا رجال مؤمنون ونساء مؤمنت لم تعلموهم ان تطـوهم فتصيبكم منهم معرةۢ بغير علم ليدخل الله فى رحمته من يشاء لو تزيلوا۟ لعذبنا الذين كفروا۟ منهم عذابا اليما",
  "translations": [
    {
      "translation": "They are those who were kafir and debarred you from the Masjid al-Haram and prevented the sacrifice from reaching its proper place, and had it not been for some men and women who are muminun, whom you did not know and might trample underfoot, and so unknowingly incur blame on their account - so that Allah distinguishable, We would have punished them with a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It were those who disbelieved who hindered you from (going to) the Holy Mosque, preventing your offerings from arriving at the place of sacrifice. Had it not been for (the presence of) believers, men and women, (among the unbelievers) of whom you were unaware, and whom you might have trampled and thus incurred guilt unknowingly on account of them, (the matter would have been settled). (But this was not done) so that God may admit into His favour whom He willed. If these (believers) had been separated from them, He would have inflicted a grievous punishment on the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who disbelieved and barred you from the Inviolable Mosque and prevented the animals you had designated for sacrifice from reaching the place of their offering. If it had not been for the believing men and believing women (who lived in Makkah and) whom you did not know, and had there not been the fear that you might trample on them and unwittingly incur blame on their account, (then fighting would not have been put to a stop. It was stopped so that) Allah may admit to His Mercy whomsoever He pleases. Had those believers been separated from the rest, We would certainly have inflicted a grievous chastise-ment on those of them [i.e. the Makkans) who disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was the disbelievers who kept you from the Sacred Mosque and prevented your sacrificial offering from reaching its proper place. God would not have kept you from fighting the disbelievers, had there not been believing men and women (among them) whom you did not know and whom you might have unknowingly harmed. God did this because He grants mercy to whomever He wants. Had they been distinguishable from the believers, We would certainly have punished them with a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was these who disbelieved and prevented you from the Sacred Mosque, and stopped the sacrificial animals from reaching their place; and were it not for some Muslim men and Muslim women, whom you do not know – lest you may crush them and unintentionally incur some violation due to them – Allah would have permitted you to slay them; this relief for them, is so that Allah may admit into His mercy whomever He wills; and had they been separated, We would have indeed punished the disbelievers among them with a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those who disbelieved and hindered you from Al-Masjid Al-Haram and detained the sacrificial animals, from reaching their place of sacrifice. Had there not been believing men and believing women whom you did not know, that you may kill and on whose account a sin would have been committed by you without (your) knowledge, that Allah might bring into His mercy whom He wills -- if they had been apart, We verily, would have punished with painful torment those of them who disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who disbelieved and turned you away from the Sacred Mosque and (turned off) the offering withheld from arriving at its destined place; and were it not for the believing men and the believing women, whom, not having known, you might have trodden down, and thus something hateful might have afflicted you on their account without knowledge-- so that Allah may cause to enter into His mercy whomsoever He pleases; had they been widely separated one from another, We would surely have punished those who disbelieved from among them with a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who disbelieved, and barred you from the Holy Mosque and the offering, detained so as not to reach its place of sacrifice. If it had not been for certain men believers and certain women believers whom you knew not, lest you should trample them, and there befall you guilt unwittingly on their account (that God may admit into His mercy whom He will), had they been separated clearly, then We would have chastised the unbelievers among them with a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These it was who disbelieved and debarred you from the Inviolable Place of Worship, and debarred the offering from reaching its goal. And if it had not been for believing men and believing women, whom ye know not - lest ye should tread them under foot and thus incur guilt for them unknowingly; that Allah might bring into His mercy whom He will - If (the believers and the disbelievers) had been clearly separated We verily had punished those of them who disbelieved with painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was they who were bent on denying the truth, and who debarred you from the Sacred Mosque and who prevented your offering from reaching its place of sacrifice. And had it not been for the believing men and believing women [in Makkah] whom you might unwittingly have trampled underfoot, and on whose account you might have, unknowingly, become guilty, [God would have commanded you to fight it out with them; but He ordained it thus] so that He may bring whoever He will into His mercy. If they [the believers] had been clearly separated, We would have punished those who were bent on denying the truth with a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were those who disbelieved and hindered you from the Sacred Mosque and hindered the detained offering that it should arrive at the goal thereof. And had it not been for believing men and believin women whom ye knew not, and that ye might have trampled on them and thus there might have befallen you crime on their account unwittingly. He had not restrained your hands from them. But this He did that He might bring into His mercy whomsoever He will. Had they been distinguished one from another, surely We had tormented those who disbelieved among them with a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who disbelieved and barred you from the Sacred Mosque, and kept the offering from reaching its destination. And were it not for [certain] faithful men and faithful women, whom you did not know—lest you should trample them, and thus the blame for [killing] them should fall on you unawares; [He held you back] so that Allah may admit into His mercy whomever He wishes. Had they been separate, We would have surely punished the faithless among them with a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who denied Revelation and hindered you from the Sacred Mosque and the sacrificial animals, detained from reaching their place of sacrifice. Had there not been believing men and believing women whom ye did not know that ye were trampling down and on whose account a crime would have accrued to you without (your) knowledge, (Allah would have allowed you to force your way, but He held back your hands) that He may admit to His Mercy whom He will. If they had been apart, We should certainly have punished the Unbelievers among them with a grievous Punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who disbelieved (in the Oneness of Allah Islamic Monotheism), and hindered you from Al-Masjid-al-Haram (the sacred mosque of Makkah) and the sacrificial animals, detained from reaching their place of sacrifice. Had there not been believing men and believing women whom you did not know, that you may kill them, and on whose account a sin would have been committed by you without (your) knowledge, that Allah might bring into His Mercy whom He will, if they (the believers and the disbelievers) should have been apart, We verily had punished those of them who disbelieved, with painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those who disbelieved and barred you from the Holy Mosque and the offering detained so as not to reach its place of sacrifice if it had not been for certain believing men and certain believing women whom you did not know, you might have trampled upon them, and so sin reached you because of (killing) them while you did not know. In order that Allah admits into His Mercy whom He will, had they (the believers) been easy to distinguish, We would have punished the unbelievers among them with a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who disbelieved, and barred you from the Sacred Mosque, and prevented the offering from reaching its destination. Were it not for faithful men and faithful women, whom you did not know, you were about to hurt them, and became guilty of an unintentional crime. Thus God admits into His mercy whomever He wills. Had they dispersed, We would have punished those who disbelieved among them with a painful penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who disbelieved and obstructed you from al-Masjid al-Haram while the offering was prevented from reaching its place of sacrifice. And if not for believing men and believing women whom you did not know - that you might trample them and there would befall you because of them dishonor without [your] knowledge - [you would have been permitted to enter Makkah]. [This was so] that Allah might admit to His mercy whom He willed. If they had been apart [from them], We would have punished those who disbelieved among them with painful punishment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:25] They are the ones who disbelieved and barred you from the Sacred Mosque, that is, [barred you] from reaching it, and [prevented] the offering (wa’l-hadya is a supplement to the [suffixed pronoun] –kum, ‘you’ [of saddūkum, ‘they barred you’]), which was detained (ma‘kūfan is a circumstantial qualifier), from reaching its destination, that is, [from] the place at which it is customarily sacrificed, namely, the Sanctuary [itself] (an yablugha mahillahu, is an inclusive substitution). And were it not for [some of] the believing men and believing women, being present at Mecca alongside the disbelievers, whom you did not know, to be believers — lest you should trample them, that is to say, [lest] you should slay them together with the disbelievers, had you been given permission to embark on the conquest (an tata’ūhum is an inclusive substitution for –hum, ‘them’ [of lam ta‘lamūhum, ‘whom you did not know’]), and thus incur sin on account of them without, your, knowing, it … (the third person pronouns in both groups [of people] predominantly   imply males; the response to lawlā, ‘were it not’, has been omitted [through ellipsis], being [something along the lines of] la-udhina lakum fī’l-fathi, ‘you would have been permitted to embark on the conquest’), but permission for this was not given at the time, so that God may admit into His mercy whom He will, such as those believers mentioned. Had they been clearly separated, [had] they [the believers] been distinguishable from the disbelievers, We would have surely chastised the disbelievers among them, of the people of Mecca [immediately] thereat, by permitting you to go ahead with the conquest thereof, with a painful chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(These it was who disbelieved) in Muhammad (pbuh) and the Qur'an, i.e. the people of Mecca (and debarred you from the Inviolable Place of Worship) and prevented you from the Inviolable Place of Worship on the year of al-Hudaybiyyah, (and debarred the offering from reaching its goal) and prevented your sacrifices from reaching the place where they were to be sacrificed. (And if it had not been for believing men) al-Walid and Salamah the sons of Hisham, 'Ayyash Ibn Rabi'ah and Abu Jandal Ibn Suhayl Ibn 'Amr (and believing women) in Mecca, (whom ye know not lest ye should tread them under foot) lest you should kill (and thus incur) because of killing (guilt for them) blood money and the sin of killing them; (unknowingly) without knowing that they were believers, if it were not for that, Allah would have set you on them to kill them; (that Allah might bring into His mercy) that Allah may honour with His religion (whom He will) whoever deserves it. (If (the believers and the disbelievers) had been clearly separated) if the believers had moved out from among the disbelievers (We verily had punished those of them who disbelieved) the disbelievers of Mecca (with painful punishment) with your swords. 599\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَتُصِيبَكُمْ مِّنْهُمْ مَّعَرَّةٌ } معناه جِنايةٌ وَشَرٌ\n\n\n\n\nوقوله تعالى: { تَزَيَّلُواْ } معناه امتازوا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Then you will be afflicted by them with a severe affliction}, means mischief and evil.\n And His saying – be exalted – {Tazayyalū} means ‘distinguish yourselves.’",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا يجازي الكفرة سبحانه بأسوء الجزاء؟ إذ { هُمُ ٱلَّذِينَ كَفَرُواْ } بالله ظلماً وعدواناً { وَ } لم يقتصروا على الكفر فقط، بل { صَدُّوكُمْ } أي: حصوركم وصرفوكم { عَنِ ٱلْمَسْجِدِ ٱلْحَرَامِ } عام الحديبية { وَ } الحال أنه قد صار { ٱلْهَدْيَ } أي: الذبائح والقرابين التي ساقها رسول الله { مَعْكُوفاً } محبوساً قريباً أن { } يَبْلُغَ مَحِلَّهُ أي: مذبحة الذي عينه الله لذبح الضحايا، وهو المنى\n\n\n\n\n{ وَلَوْلاَ رِجَالٌ مُّؤْمِنُونَ وَنِسَآءٌ مُّؤْمِنَاتٌ } في خلالهم، لم يكف سبحانه أيديكم عنهم، بل نصركم عليهم واستأصلتموهم بالمرة، لكن لما كان بينهم من المؤمنين والمؤمنات كف سبحانه أيديكم عنهم مخافة { لَّمْ تَعْلَمُوهُمْ } أي: المؤمنين المخلوطين بهم، ولم يميزوهم من الكفار { أَن تَطَئُوهُمْ } تدوسوهم { فَتُصِيبَكُمْ مِّنْهُمْ } أي: من أجل المؤمنين المخلوطين بالكافرين وجهلهم { مَّعَرَّةٌ } أي: مضرة وكروه من لزوم دية وكفارة، وإثم عظيم وتعيير شديد، وغير ذلك من المنكرات مع أنه إنما صدر عنكم الوطاءة والدوس لو صدر { بِغَيْرِ عِلْمٍ } وخبرة، وإنما كف أيديكم عنهم حين أظفركم عليهم { لِّيُدْخِلَ ٱللَّهُ } المطلع بما في استعدادات عباده من الإيمان والكفر { فِي رَحْمَتِهِ } التي هي التوحيد والإسلام { مَن يَشَآءُ } منهم حتى { لَوْ تَزَيَّلُواْ } وتفرقوا أي: المؤمنين من الكافرين { لَعَذَّبْنَا ٱلَّذِينَ كَفَرُواْ مِنْهُمْ عَذَاباً أَلِيماً } [الفتح: 25] في غاية الإيلام من السبي والجلاء وأنواع المصيبة والبلاء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ووجه المنّة في كفّ أيدي المؤمنين عن الكافرين: ما ذكر بعد من قوله: { ولولا رجال مؤمنون }\n\n\n الآية، أو: ما تطرق بسببه من الصلح وانقيادهم إليه، فإنهم لما رأوا أصحابهم انهزموا أذعنوا للصلح، وقال القشيري: بعد أن اضطرهم المسلمون إلى بيوتهم، أنزل الله هذه الآية يمنُّ عليهم، حيث كفّ أيديَ بعضهم عن بعض، عن قدرة من المسلمين، لا عن عجز، فأما الكفار فكفُّوا أيديهم رُعباً وخوفاً، وأما المسلمون فنهياً من قِبل الله، لما في أصلابهم من المؤمنين\n هـ\n { وكان الله بما تعملون } من مقاتلتهم وهزمهم أولاً، والكفّ عنهم ثانياً، لتعظيم بيته الحرام، وقرأ البصري بياء الغيب، أي: بما يعمل المشركون { بصيراً } فيجازي كُلاًّ بما يستحقه\n\n\n{ هم الذين كفروا وصدُّوكم عن المسجد الحرام }  { و } صدُّوا { الهدْيَ } حال كونه { معكوفاً } أي: محبوساً عن { أن يبلغ مَحِلَّهُ } أي: مكانه الذي يحلّ به نحره، وهو منىً وكان صلى الله عليه وسلم ساق سبعين بدنة، فلما صُدّ، نَحَرَها بموضعه، وبه استدل مَن قال: إنّ المحصَر ينحر هداياه بموضعه، وروي أن خيامه صلى الله عليه وسلم كانت في الحل، ومصلاّه في الحرم، وهناك نحرت هداياه صلى الله عليه وسلم\n والله تعالى أعلم\n الإشارة: يُقال لمَن سبقت لهم العناية، وحَفّت بهم الرعاية: لو قاتلكم الذين كفروا من النفس الأمّارة، والشيطان، والهوى، وسائر القواطع، لَوَلُّوا الأدبار، ثم لا يجدون تسلُّطاً عليكم أبداً، سُنَّة الله التي قد خلت فيمن توجه إليه بصدق الطلب، ودخل تحت تربية الرجال، فإن همتهم دائرة عليه، ولن تجد لسنَّة الله تبيدلاً\n وهو الذي كفّ أيدي الأعداء من القواطع عنكم، وكَفّ أيديكم عنهم، من بعد أن أظفركم عليهم، فإنّ النفس إذا تعذّبت واطمأنت وجب الكفُّ عن مجاهدتها، ووجب البرور بها، وتصديقها فيما تحدثه، وكذا سائر القواطع تجب الغيبة عنها، وعدم الالتفات إليها غيبةً في الله واشتغالاً بشهوده\n وقيل لبعضهم: متى ينتهي سير الطالبين؟ قال: \" الظفر بنفوسهم، فإن ظفروا بها وصلوا \"\n وأيضاً: لا تجتمع المجاهدة مع المشاهدة، فإذا تحققت المشاهدة فلا مجاهدة\n هم الذين كفروا من النفوس المتمردة، والهوى، وصدُّوكم عن مسجد الحضرة، والهديَ معكوفاً، وحبسوكم عن التقرُّب إلى الله بالنفس والمال أن يبلغ محله، بأن تمنعكم من إعطائه، أو تُشِيبُه بما يُفسده من الرياء والعجب، لئلا تبلغ محل الإخلاص\n ثم ذكر حكمة منعهم من دخول مكة عام الحديبية، فقال: {\n\n\n وَلَوْلاَ رِجَالٌ مُّؤْمِنُونَ وَنِسَآءٌ مُّؤْمِنَاتٌ لَّمْ تَعْلَمُوهُمْ أَن تَطَئُوهُمْ فَتُصِيبَكمْ مِّنْهُمْ مَّعَرَّةٌ بِغَيْرِ عِلْمٍ لِّيُدْخِلَ ٱللَّهُ فِي رَحْمَتِهِ مَن يَشَآءُ لَوْ تَزَيَّلُواْ لَعَذَّبْنَا ٱلَّذِينَ كَفَرُواْ مِنْهُمْ عَذَاباً أَلِيماً }  قلت: { أن تطؤوهم }: بدل اشتمال من رجال ونساء، ومن ضمير \" تعلموهم \" وبغير متعلق بتطؤوهم، وجواب \" لولا \" محذوف، أغنى عنه جواب \" لو \" أي: لما كفّ أيديكم عنهم\n يقول الحق جلّ جلاله: { ولولا رجالٌ مؤمنون ونساء مؤمناتٌ } بمكة، ضَعُفوا عن الهجرة { لم تعلموهم } لم تعرفوهم بأعيانهم لاختلاطهم مع المشركين، { أن تطأوهم بغير علمٍ } أي: غير عالِمين بهم { فتُصيبَكم منهم معرَّة } أي: مشقة ومكروه\n وفي تفسير المحلي \" المعرة \" بالإثم نظر، مع فرض عدم العلم، إلا أن يُحمل على صورة الإثم، وهو الخطأ، وفيه الكفارة\n والمعرة: مفعلة من: عراهُ: إذا دهاه ما يكرهه وشقّ عليه، وهو هنا الكفارة إذا قتله خطأ، وسوء مقالة المشركين أنهم فعلو بأهل دينهم مثل ما فعلوا بنا من غير تمييز، والإثم إذا قصد قتله\n والوطء عبارة عن الإيقاع والإبادة\n\n\nوالحاصل أنه كان بمكة قوم مسلمون مختلطون بالمشركين، غير متميّزين منهم، فقيل: ولولا كراهة أن تُهلكوا ناساً من المؤمنين بين ظهراني المشركين وأنتم غير عارفين بهم، فتُصيبكم بإهلاكهم مشقة ومكروه، ولما كففنا أيديكم عنهم، ولسلطانكم عليهم\n وكان ذلك الكفّ { ليُدخل اللّهُ في رحمته } أي: في توفيقه لزيادة الخير والطاعة لمؤمنيهم، أو: ليدخلهم في الإسلام مَن رغب فيه من مشركيهم { مَن يشاء } زيادته أو هدايته، فاللام متعلقة بمحذوف، تعليل لما دلت عليه الآية، وسيقت له، من كفّ الأيدي عن أهل مكة، والمنع من قتلهم، صوناً لما بين أظهرهم من المؤمنين\n { لو تزيّلوا } أي: تفرّقوا وتميّز المسلمون من الكافرين، { لعذَّبنا الذين كفروا منهم عذاباً أليماً } بقتل مقاتلهتم، وسبي ذراريهم\n ويجوز أن يكون: \" لو تزيّلوا \" كالتكرير لـ \" لولا\n\n \" لمرجعهما لمعنى واحد ويكون { لعذَّبنا\n\n\n } الخ، هو جواب \" لولا \" والتقدير: ولولا أن تطؤوا رجالاً مؤمنين ونساء مؤمناتٍ من غير علم، ولو كانوا متميزين لعذبناهم بالسيف\n الإشارة: إذا اختلط أهل الانتقاد مع أهل الاعتقاد، لا يعم البلاء المعدّ لأهل الانتقاد، ولو تزيّلوا لعذبنا المنكرين عذاباً أليماً، وكذلك إذا اختلط الفجّار مع الأبرار، وغلب جمع الأبرار، لا يعم البلاء، ويُصرف عن الجميع، فلو تزيّل الفجّار لعُذبوا عذاباً أليماً\n قال القشيري: قد تكون في النفس أوصاف مستحسنة، تليق بالفيض الألهي، مع أوصاف مذمومة، فلو سلطناكم على إهلاكها بالمرة، لفاتكم ما فيها من الأوصاف الحسنة، فتُصيبكم معرة، ليدخل الله في رحمته بالوصول إلى حضرته من يشاء من النفوس، بتصفية ما فيها من الرذائل\n لو تزيّلوا تميز ما يصلح قلعه، كالكبر، والشر، والحرص والحقد، أو ما يصلح تبديله، كالبخل بالسخاء، والحرص بالقناعة، والغضب بالحلم، والجبن بالشجاعة، والشهوة بالعفة، لعذَّبنا النفوس المتمردة عذاباً أليماً، بإهلاكها بالكلية\n بالمعنى\n ثم وصف أهل الكفر المتقدمين الآن بالحَمية، فقال: { إِذْ جَعَلَ ٱلَّذِينَ كَفَرُواْ فِي قُلُوبِهِمُ ٱلْحَمِيَّةَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:27",
      "similarity": 0.292473047020011
    },
    {
      "verse": "73:6",
      "similarity": 0.2878516914929971
    },
    {
      "verse": "22:36",
      "similarity": 0.2592962319366723
    },
    {
      "verse": "22:25",
      "similarity": 0.2383218782659165
    },
    {
      "verse": "9:37",
      "similarity": 0.23574102973491246
    }
  ]
}