{
  "chapter": "الفتح",
  "text": "لقد صدق الله رسوله الرءيا بالحق لتدخلن المسجد الحرام ان شاء الله ءامنين محلقين رءوسكم ومقصرين لا تخافون فعلم ما لم تعلموا۟ فجعل من دون ذلك فتحا قريبا",
  "translations": [
    {
      "translation": "Allah has confirmed His Messenger's vision with truth: 'You will enter the Masjid al-Haram in safety, Allah willing, shaving your heads and cutting your hair without any fear.' He knew what you did not know and ordained, in place of this, an imminent victory.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has truly made the vision of His Apostle come true: You will surely enter the Holy Mosque in security if God please, without any fear, having shaved your heads and cut your hair. He knew what you did not know, and has vouchsafed you, apart from this, a victory near at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah indeed showed His Messenger the true vision, one fully in accord with reality. If Allah so wills you shall certainly enter the Inviolable Mosque, in full security, you will shave your heads and cut your hair short, and do so without any fear. He knew what you did not know, and He granted you a victory near at hand even before (the fulfilment of the vision).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God made the dream of His Messenger come true for a genuine purpose. (In this he was told), \"If God wills You (believers) will enter the Sacred Mosque, in security, with your heads shaved, nails cut, and without any fear in your hearts.\" He knew what you did not know. Besides this victory, He will give you another immediate victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has indeed made the truthful dream of His Noble Messenger, come true; indeed you will all enter the Sacred Mosque, if Allah wills, in safety – with your heads shaven or hair cut short – without fear; so He knows what you do not know, and has therefore ordained another imminent victory before this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah shall fulfill the true vision which He showed to His Messenger in very truth. Certainly, you shall enter Al-Masjid Al-Haram, if Allah wills, secure, (some) having your heads shaved, and (some) having your hair cut short, having no fear. He knew what you knew not, and He granted besides that a near victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Allah had shown to His Apostle the vision with truth: you shall most certainly enter the Sacred Mosque, if Allah pleases, in security, (some) having their heads shaved and (others) having their hair cut, you shall not fear, but He knows what you do not know, so He brought about a near victory before that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has indeed fulfilled the vision He vouchsafed to His Messenger truly: 'You shall enter the Holy Mosque, if God wills, in security, your heads shaved, your hair cut short, not fearing.' He knew what you knew not, and appointed ere that a nigh victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath fulfilled the vision for His messenger in very truth. Ye shall indeed enter the Inviolable Place of Worship, if Allah will, secure, (having your hair) shaven and cut, not fearing. But He knoweth that which ye know not, and hath given you a near victory beforehand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has in all truth shown His Messenger a true vision in which He said, \"God willing, you will most certainly enter the Sacred Mosque in safety and without fear, shaven-headed or with hair cut short\" -- God knew what you did not; and has given you a victory beforehand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly did Allah shew a true vision to His apostle in very truth; ye shall surely enter the Sacred Mosque, if Allah willeth, secure, having your heads shaven and your hair cut, and ye shall not fear. He knoweth that which ye know not; wherefore He appointed, beside that, a victory near at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Allah has fulfilled His Apostle’s vision in all truth: You will surely enter the Sacred Mosque, God willing, in safety and without any fear, with your heads shaven or hair cropped. So He knew what you did not know, and He assigned [you] besides that a victory near at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly did Allah fulfil the vision for His Messenger: ye shall enter the Sacred Mosque, if Allah wills, with minds secure, heads shaved, hair cut short, and without fear. For He knew what ye knew not, and He granted, besides this, a speedy victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah shall fulfil the true vision which He showed to His Messenger (SAW) [i.e. the Prophet SAW saw a dream that he has entered Makkah along with his companions, having their (head) hair shaved and cut short] in very truth. Certainly, you shall enter Al-Masjid-al-Haram; if Allah wills, secure, (some) having your heads shaved, and (some) having your head hair cut short, having no fear. He knew what you knew not, and He granted besides that a near victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah, in truth, has realized His Messenger's vision. You shall enter the Sacred Mosque in security if Allah wills, with hair shaven or cut short and without fear. He knew what you did not know, and granted you a near victory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has fulfilled His Messenger’s vision in truth: “You will enter the Sacred Mosque, God willing, in security, heads shaven, or hair cut short, not fearing. He knew what you did not know, and has granted besides that an imminent victory.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly has Allah showed to His Messenger the vision in truth. You will surely enter al-Masjid al-Haram, if Allah wills, in safety, with your heads shaved and [hair] shortened, not fearing [anyone]. He knew what you did not know and has arranged before that a conquest near [at hand].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:27] Verily God has fulfilled the vision for His Messenger in all truth: The Messenger of God (s) saw in his sleep, in the year of al-Hudaybiyya before his departure [from Medina], that he would enter Mecca together with his Companions safely, whereafter they would shave [completely] or shorten [their hair]. He informed his Companions of this and they rejoiced. But when they set off with him [from Medina], and the disbelievers impeded them at al-Hudaybiyya such that they had to retreat, which was distressing for them, for some of the hypocrites began to have doubts [about the Prophet’s sincerity], this [verse] was revealed (bi’l-haqqi, ‘in all truth’, is semantically connected to sadaqa, ‘fulfilled’, or it is a circumstantial qualifier referring to al-ru’yā, ‘the vision’, and what comes after it is the explanation thereof): ‘You will assuredly enter the Sacred Mosque, God willing — this is [said] to secure blessings — in safety, to shave your heads, that is, all the hair, or to shorten [it], [to shorten] some of the hair (both muhalliqīna and muqassirīna are implied circumstantial qualifiers), without any fear’, ever. So He knew, [there to be] in the truce, what you did not know, in the way of reconciliation [between the believers and the Meccans], and assigned [you] before that, entry, a near victory, namely, the conquest of Khaybar — the vision was fulfilled in the following year.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah hath fulfilled the vision for His messenger in very truth) truly. This is because the Prophet (pbuh) had told his Companions: (Ye shall indeed enter the Inviolable Place of Worship, if Allah will, secure) from the enemy, ((having your hair) shaven and cut, not fearing) the enemy; and Allah did fulfil what the Prophet (pbuh) had said to his Companions. (But He knoweth that which ye know not) Allah had known that what he promised was not to take place in that year but in the following year, while you did not know this, (and hath given you a near victory beforehand) i.e. the conquest of Khaybar before the fulfilment of this vision.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ ما أريناه ما أريناه إلا بالحق { مُحَلِّقِينَ رُءُوسَكُمْ } على الوجه المتعارف { وَمُقَصِّرِينَ } كما هو عادة الحجاج يحلق بعضهم ويقصر بعضهم\n وبالجملة: { لاَ تَخَافُونَ } بعد ذلك\n إذ الله معكم { فَعَلِمَ مَا لَمْ تَعْلَمُواْ } من أنفسكم\n ولا تستعجلوا إلى الفتح\n إذ هو مرهون بوقته { فَجَعَلَ } لكم { مِن دُونِ ذَلِكَ } أي: فتح مكة { فَتْحاً قَرِيباً } [الفتح: 27] هو فتح خيبر\n ليطمئن به قلوبكم إلى أن يتيسر لكم الفتح الموعود الذي أخبر به نبيكم الصادق المصدوق\n\n\nوكيف لا يصدق سبحانه مع أنه { هُوَ ٱلَّذِيۤ أَرْسَلَ رَسُولَهُ } ملتبساً { بِٱلْهُدَىٰ } والإرشاد إلى سبيل توحيده { وَدِينِ ٱلْحَقِّ } الفاروق بين الباطل والضلال",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { لقد صَدَقَ اللّهُ رسولَه الرؤيا } أي: صدَقه في رؤياه ولم يكذبه - تعالى الله عن الكذب - فحذف الجارَ وأوصل الفعل كقوله:\n\n[الأحزاب: 23] يقال: صدقه الحديث: إذا حققه وبيّنه له، أو: أخبره بصدق رُوي أنه صلى الله عليه وسلم رأى في النوم، قبل خروجه إلى الحديبية، كأنّه وأصحابه قد دخلوا مكة آمنين، وقد حلقوا وقصّروا، فقصّ الرؤيا على أصحابه، ففرحوا، وحسِبوا أنهم داخلوها، وقالوا: إن رؤيا رسول الله حق\n والله تعالى قد أبهم الأمر عليهم لينفرد بالعلم الحقيقي، فلما صُدوا، قال عبد الله بن أُبيّ وغيرُه من المنافقين: والله ما حلقنا ولا قصّرنا، ولا رأينا المسجد الحرام، فنزلت: { لقد صَدَقَ اللّهُ رسوله } فيما أراه، وما كذب عليه، ولكن في الوقت الذي يريد\n وقوله: { بالحق } إما صفة لمصدر محذوف، أي: صدقاً ملتبساً بالحق، أي: بالغرض الصحيح، والحكمة البالغة التي تُميز بين الراسخ في الإيمان، والمتزلزل فيه، أو: حال من الرؤيا، أي: ملتبسة بالحق ليست من قبيل أضغاث الأحلام، ويجوز أن يكون قسَماً، أي: أقسم بالحق { لَتدخُلُنَّ المسجدَ الحرامَ } وعلى الأول: جواب القسم محذوف، أي: والله لتدخلن المسجد الحرام، والجملة القسمية: استنئاف بياني، كأن قائلاً قال: ففيم صَدَقَه؟ فقال: { لتدخلن المسجد إن شاء الله } وهو تعليق للعِدة بالمشيئة لتعليم العبادة\n قال ثعلب: استثنى الله فيما يعلم ليستثني الخلق فيما لا يعلمون\n وقال في القوت: استثنى الله معلماً لعباده ورَادّاً لهم إلى مشيئته، وهو أصدقُ القائلين، وأعلمُ العالمين\n هـ\n أو: للإشعار بأن بعضهم لا يدخلونه، لموت، أو غيبة، أو غير ذلك، أو: هو حكاية لِما قاله ملَك الرؤيا لرسول الله صلى الله عليه وسلم، أو لِما قاله صلى الله عليه وسلم لأصحابه، حين قصّ عليهم، أي: والله لتدخلنها { آمنين } من غائلة العدو، فهو حال من فاعل \" لتدخلن \" والشرط معترض\n { مُحلِّقين رؤوسَكم ومقصِّرين } أي: محلقاً بعضكم، ومقصراً آخرون، { لا تَخافون } بعد ذلك أبداً، فهو حال أيضاً، أو استئناف، { فَعِلمَ ما لم تعلموا } من الحكمة في تأخير فتح مكة إلى العام القابل، { فجعل من دون ذلك } فتح مكة { فتحاً قريباً } وهو فتح خيبر، لتستروح إليه قلوبُ المؤمنين، إلى أن يتيسر الفتح الموعود\n والله تعالى أعلم\n الإشارة: العارف الكامل لا يركن إلى شيء دون الله تعالى، فلا يطمئن إلى وعد، ولا يخاف من وعيد، بل هو عبد بين يدَي سيده، ينظر ما يبرز من زمن عنصر قدرته، فإن بُشِّر بشيء في النوم أو اليقظة، لا يركن إليه، ولا يقف معه لأن غيب المشيئة غامض، وإن خُوّف بشيء في النوم أو غيره، لا يفزع ولا يجزع لأن الغنى بالله والأُنس به غيَّبه عن كل شيء، وفي الله خلف من كل تلف \" ماذا فقد من وجدك؟ \" والله يتولى الصالحين،\n\n\n\n[الطلاق: 2] الآية\n قال في الإبريز: الرؤيا المُحْزِّنة إنما هي اختبار من الله للعبد، هل يبقى مع ربه أو ينقطع عنه، فإن كان العبد متعلقاً به تعالى، ورأى الرؤيا المحزنة، لم يلتفت إليها، ولما يُبال بها لعلمه بأنه منسوب إلى مَن بيده تصاريف الأمور، وأنَّ ما اختاره تعالى سبقت به المشيئة، فلا يهوله أمر الرؤيا، ولا يلقي إليها بالاً، وهذه لا تضره بإذن الله تعالى: وإذا كان العبد غير متعلق بربه، ورأى رؤيا محزنة، جعلها نصب عينيه، وعمّر بها باطنه، وانقطع بها عن ربه، ويُقدِّر أنها لا محالة نازلة به، فهذا هو الذي تضره لأنَّ مَن خاف من شيء سلّطه عليه\n هـ\n وسُئل سهل التستري رضي الله عنه عن الاستثناء في هذه الآية، فقال: تأكيداً في الافتقار إليه، وتأديباً لعباده في كل حال ووقت\n هـ\n أي: أدّبهم لئلاّ يقفوا مع شيء دونه\n ثم ردَّ حميّة الجاهلية في عدم إقرارهم برسالته صلى الله عليه وسلم، فقال: { هُوَ ٱلَّذِيۤ أَرْسَلَ رَسُولَهُ بِٱلْهُدَىٰ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:83",
      "similarity": 0.6813431572489129
    },
    {
      "verse": "2:196",
      "similarity": 0.38013975327344196
    },
    {
      "verse": "25:10",
      "similarity": 0.24651000823177585
    },
    {
      "verse": "4:101",
      "similarity": 0.24492491673773956
    },
    {
      "verse": "7:202",
      "similarity": 0.22597774087188158
    }
  ]
}