{
  "chapter": "الفتح",
  "text": "هو الذى ارسل رسوله بالهدى ودين الحق ليظهره على الدين كله وكفى بالله شهيدا",
  "translations": [
    {
      "translation": "It is He who sent His Messenger with the Guidance and the Deen of Truth to exalt it over every other deen and Allah suffices as a witness.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent His Apostle with the guidance and the true faith, so that He may exalt it over every other creed. God is sufficient as a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sent His Messenger with the True Guidance and the Religion of Truth that He may make it prevail over every religion. Sufficient is Allah as a witness (to this).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent His Messenger with guidance and the true religion to make it prevail over all other religions. God is a Sufficient witness to this Truth\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has sent His Noble Messenger with the guidance and the true religion, in order to make it prevail over all other religions; and Allah is sufficient as a Witness. (The Holy Prophet is a light from Allah.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who has sent His Messenger with guidance and the religion of truth, that He may make it superior to all religions. And All-Sufficient is Allah as a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sent His Apostle with the guidance and the true religion that He may make it prevail over all the religions; and Allah is enough for a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent His Messenger with the guidance and the religion of truth, that He may uplift it above every religion. God suffices as a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who hath sent His messenger with the guidance and the religion of truth, that He may cause it to prevail over all religion. And Allah sufficeth as a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the One who has sent His Messenger with guidance and the true religion, so that He may have it prevail over all [other] religions. God suffices as a witness!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who hath sent His apostle with the guidance and the true religion that He may make it prevail over all other religions, and Allah sufficeth as a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent His Apostle with guidance and the true religion, that He may make it prevail over all religions, and Allah suffices as witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has sent His Messenger with Guidance and the Religion of Truth, to proclaim it over all religion: and enough is Allah for a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who has sent His Messenger (Muhammad SAW) with guidance and the religion of truth (Islam), that He may make it (Islam) superior over all religions. And All-Sufficient is Allah as a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent His Messenger with guidance and the religion of truth, so that He exalts it above all other religions. Allah is the Sufficient Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sent His Messenger with the guidance and the religion of truth, to make it prevail over all religions. God suffices as Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sent His Messenger with guidance and the religion of truth to manifest it over all religion. And sufficient is Allah as Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:28] It is He Who has sent His Messenger with guidance and the religion of truth, that He may make it, that is, the religion of truth, prevail over all religion, over all the other religions. And God suffices as witness, to the fact that you have been sent with what has been mentioned, as God, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is Who hath sent His messenger) Muhammad (pbuh) (with the guidance) with the profession of Allah's divine Oneness; and it is also said this means: with the Qur'an (and the religion of truth) the testification that there is no deity save Allah and that Muhammad is His Slave and Messenger, (that He may cause it to prevail over all religion) such that the Hour will not come until there is none but a Muslim or someone who is in a peace treaty with him. (And Allah sufficeth as a witness) there is no deity except Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا يصدق سبحانه مع أنه { هُوَ ٱلَّذِيۤ أَرْسَلَ رَسُولَهُ } ملتبساً { بِٱلْهُدَىٰ } والإرشاد إلى سبيل توحيده { وَدِينِ ٱلْحَقِّ } الفاروق بين الباطل والضلال، ووعد له { لِيُظْهِرَهُ } أي: دينه { عَلَى ٱلدِّينِ كُلِّهِ } أي: جنس الأديان النازلة من عنده بأن نسخ الجميع به { وَكَفَىٰ بِٱللَّهِ شَهِيداً } [الفتح: 28] على صدقه في رؤياه وفي دعوته ونبوته، وإظهار أنواع المعجزة بيده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { هو الذي أرسل رسولَه بالهُدى } بالتوحيد، أي: ملتبساً به، أو: بسببه، أو: لأجْله، { ودينِ الحق } وبدين الإسلام، وبيان الإيمان والإحسان، وقال الورتجبي: ودين الحق: هو بيان معرفته والأدب بين يديه\n هـ\n { ليُظهره على الدين كله } ليُعْلِيَه على جنس الدين، يريد الأديان كلها من أديان المشركين وأهل الكتاب، وقد حقّق ذلك سبحانه، فإنك لا ترى ديناً قط إلا والإسلام فوقه بالعزة والغلبة، إلا ما كان من النصارى بالجزيرة، حيث فرّط أهل الإسلام، وقيل: هو عند نزول عيسى عليه السلام حين لا يبقى على وجه الأرض كافر\n وقيل: هو إظهاره بالحجج والآيات\n { وكفى بالله شهيداً } على أن ما وعده كائن\n وعن الحسن: شهد على نفسه أنه سيُظهر دينه، أو: كفى به شهيداً على نبوة محمد صلى عليه وسلم وهو تمييز، أو حال",
      "translations": []
    }
  ]
}