{
  "chapter": "الفتح",
  "text": "واخرى لم تقدروا۟ عليها قد احاط الله بها وكان الله على كل شىء قديرا",
  "translations": [
    {
      "translation": "And other booty you do not yet have the power to take - Allah has already encompassed it. Allah has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And other (benefits) which you have not yet obtained, are within the compass of God, for God has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He also promises you other spoils which you have not yet taken, but Allah has encompassed them. Allah has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Besides these, there were other gains which you could not receive, but God has full control over them. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And one more, not within your capacity, is within Allah’s hold; and Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And other (victories) which are not yet within your power; indeed Allah encompasses them. And Allah is Ever Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And others which you have not yet been able to achieve Allah has surely encompassed them, and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and other spoils you were not able to take; God had encompassed them already. God is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And other (gain), which ye have not been able to achieve, Allah will compass it, Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are yet other [gains] which are still beyond your grasp, [but] which God has already encompassed [for you]: for God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He promiseth another victory, over which ye have as yet no power: Allah hath surely encompassed it; and Allah is over everything ever Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And other [spoils as well] which you have not yet captured: Allah has comprehended them, and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And other gains (there are), which are not within your power, but which Allah has compassed: and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And other (victories and much booty there are, He promises you) which are not yet within your power, indeed Allah compasses them, And Allah is Ever Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there were (other spoils) which you were unable to take. Allah has encompassed it already, Allah is powerful over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And other things, of which you were incapable, but God has encompassed them. God is Capable of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [He promises] other [victories] that you were [so far] unable to [realize] which Allah has already encompassed. And ever is Allah, over all things, competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:21] and others (wa-ukhrā is an adjectival qualification of the implied subject maghānima, ‘spoils’) which you were not able to capture — namely, [spoils] from the Persians and the Byzantines; God has verily encompassed these [already], that is to say, He knows that they will be yours. And God has power over all things, that is to say, He is ever possessed of such an attribute.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And other (gain)) and other booty, (which ye have not been able to achieve) yet, (Allah will compass it) Allah knows that it will happen, this is the booty Persia. (Allah is Able to do all things) of conquest, victory and capturing booty.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأُخْرَىٰ لَمْ تَقْدِرُواْ عَلَيْهَا } معناه فارسُ والرومُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And another you were not able to} [means] the Persians and the Romans.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كذا عجل لكم عناية من الله إياكم مغانم { أُخْرَىٰ } مع أنكم { لَمْ تَقْدِرُواْ عَلَيْهَا }  لشوكة الأعداء وكثرة عددهم وعددهم، بل فررتم أنتم منهم مراراً { قَدْ أَحَاطَ ٱللَّهُ بِهَا } وأباحها عليكم بالنصر والغلبة عليهم مع أنكم خائفون وجلون منهم، وهي مغانم هوازن وفارس { وَ } بالجملة: { كَانَ ٱللَّهُ عَلَىٰ كُلِّ شَيْءٍ } دخل في حيطة علمه وإرادته { قَدِيراً } [الفتح: 21] لا يعجز عنه ولا يفتر دونه؛ إذ القدرة من جملة الأوصاف الغالبة الذاتية الإلهية، التي لا تفتر به ولا تضعف بحال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى: { وأُخرى لم تَقْدِروا عليها } أي: وعجّل لكم مغانم أخرى، وهي مغانم هوازن في غزوة حنين\n ووصفها بعدم القدرة عليها لما كان فيها من الجَوْلة\n { قد أحاط اللّهُ بها } قَدَرَ عليها واستولى، وأظهركم عليها، وهي صفة أخرى لـ \" أخرى \" مفيدة لسهولة بأسها بالنسبة إلى قدرته تعالى، بعد بيان صعوبة مَنَالها بالنظر إلى حِذرهم\n ويجوز في \" أُخرى \" النصب بفعل مضمر، يُفسره { قد أحاط الله بها } أي: وقضى الله أخرى، ولا ريب في أن الإخبار بقضاء إياها بعد اندراجها في جملة الغنائم الموعودة بقوله: { وعدكم الله مغانم كثيرة } فيه مزيد فائدة، وإنما الفائدة في بيان تعجيلها وتأخير هذه\n\n\nوقال ابن عباس والحسن ومقاتل: { وأخرى لم تقدروا عليها } هي فارس والروم\n وقال مجاهد: ما فتحوا حتى اليوم\n هـ\n قلت: بل إلى يوم القيامة وهذا أظهر الأقوال أي: لم تقدروا على أخذها الآن وستأخذونها، { وكان الله على كل شيء قديراً } لأن قدرته تعالى عامة التعلُّق، لا تختص بشيء دون شيء\n قال ابن عرفة: مذهبنا أن المستحيل لا يصدق عليه شيء، فيبقى النظر: هل يطلق على الواجب شيء، لقوله تعالى:\n\n[الأنعام: 19] أم لا يطلق عليه شيء؟ فإن قلنا: يصلح الإطلاق وجب التخصيص في الآية، فيكون عامّاً مخصوصاً، وإن قلنا بعدم صحته، فيبقى النظر: هل المراد بالقدرة الإحداث أو الصلاحية، فإن أريد الإحداث فهي مخصوصة، وإن أريد الصلاحية فهو عام غير مخصوص\n هـ\n الأشارة: مشايخ التربية خلفاء الرسول صلى الله عليه وسلم فحين بايعهم على عقد الإرادة فكأنما بايع الرسول، فيقال على طريق الإشارة: لقد رضي الله عن المؤمنين المتوجهين، إذ يبايعونك أيها العارف تحت الشجرة، تحت ظل شجرة همتك، فعَلِمَ ما في قلوبهم من الصدق، فأنزل السكينة عليهم، حتى سكنوا تحت مشاق التربية والرياضة، وأثابهم فتحاً قريباً، وهو الوصول إلى حضرة العيان، ومغانم كثيرة فتوحات ومكاشفات، وأسرار، وترقيات كثيرة، إلى ما لا نهاية له، يأخذونها\n ووعدكم الله مغانم كثيرة تأخذونها بعد الفتح، من الرجوع إلى البقاء وبقاء البقاء، والتوسُّع في المقامات، والترقِّي في معارج المكاشفات، فعَجَّل لكم هذه، هو مقام الفناء، وكفَّ أيدي القواطع عنكم، لتتوجهوا إلى مولاكم، لتكون عبرة للمؤمنين المتخلفين عن السير، يهتدون بهديكم، ويهديكم صراطاً مستقيماً: طريق الوصول إلى حضرة القدس، ومحل الأنس، وأخرى لم تقدروا عليها في الدنيا، ادخرها لكم يوم القيامة، وهو المُقام في مقعد صدق عند مليك مقتدر\n وقال الورتجبي: { لقد رضي الله عن المؤمنين } أي: رَضِيَ عنهم في الأزل، وسابق علم القدم، ويبقى رضاه إلى الأبد لأن رضاه صفة الأزلية الباقية الأبدية، لا تتغير بتغيُّر الحدثان، ولا بالوقت والزمان، ولا بالطاعة والعصيان، فإذا هم في اصطفائيته باقون إلى الأبد، لا يسقطون من درجاتهم بالزلات ولا بالبشرية، ولا بالشهوات، لأن أهل الرضا محروسون برعايته، لا تجري عليهم نعوت أهل البُعد، وصاروا متصفين بوصف رضاه، فرضوا عنه كما رضي عنهم، قال تعالى:\n\n[المائدة: 119] وهذا بعد قذف نور الأنس في قلوبهم بقوله: { فأنزل السكينة عليهم } فسكنت قلوبهم إليه، واطمأنت به لِتنزُّل اليقين\n هـ\n قلت: هذا لمَن تحققت محبوبيته ممن رسخت قدمه في شهود الحق، واطمأن به، وأما قبل هذا فالأمر مُبهم\n قال اللجائي، في كتابه \" قطب العارفين \": وإياك أن تعتقد أنّ في الناس شرّاً منك، وإن كان عاصياً وأنت مطيع، فإنّ الأمر يحدث بعد الأمر، وسِرُّ الله تعالى في خلقه غامض، لا يُدرى مَن يبوء بالشقاوة، ولا مَن يفوز بالسعادة، وقد يتلقى العبدُ رضا الله تعالى بحسنة واحدة، ويتلقى سخطه بذنب واحد، فإنَّ أمر الله خفي في غموض المشيئة\n\n\n الخ\n ثم بشَّرهم بالنصر، فقال: { وَلَوْ قَاتَلَكُمُ ٱلَّذِينَ كفَرُواْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:126",
      "similarity": 0.773703502290506
    },
    {
      "verse": "20:110",
      "similarity": 0.6120165222056876
    },
    {
      "verse": "27:84",
      "similarity": 0.5978705403278457
    },
    {
      "verse": "65:12",
      "similarity": 0.5759617688630182
    },
    {
      "verse": "85:20",
      "similarity": 0.566051425322123
    }
  ]
}