{
  "chapter": "الفتح",
  "text": "سنة الله التى قد خلت من قبل ولن تجد لسنة الله تبديلا",
  "translations": [
    {
      "translation": "That is Allah's pattern which has passed away before. You will not find any changing in the pattern of Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the law of God, effective as before: You will not find any change in the law of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Allah's Way that has come down from the past. Never shall you find any change in the Way of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the tradition of God which existed before, and you will never find any change in His tradition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The tradition of Allah, ongoing since before; and you will not find the tradition of Allah changing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That has been the way of Allah already with those who passed away before. And you will not find any change in the way of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such has been the course of Allah that has indeed run before, and you shall not find a change in Allah's course.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the wont of God, as in the past before, and thou shalt never find any changing the wont of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the law of Allah which hath taken course aforetime. Thou wilt not find for the law of Allah aught of power to change.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "such was the law of God in the past; and you shall find no change in the law of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That hath been the dispensation of Allah with those who passed away aforetime; and thou shalt not find in the dispensation of Allah any change.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[It is] Allah’s precedent that has passed before, and you will never find any change in Allah’s precedent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Such has been) the practice (approved) of Allah already in the past: no change wilt thou find in the practice (approved) of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That has been the Way of Allah already with those who passed away before. And you will not find any change in the Way of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the way of Allah in days gone by, and you shall find no change in the ways of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God’s pattern, ongoing since the past. You will never find any change in God’s pattern.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This is] the established way of Allah which has occurred before. And never will you find in the way of Allah any change.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:23] [That is] the way of God (sunnata’Llāhi is a verbal noun emphasising the import of the preceding sentence about the defeat of the disbelievers and the victory of the believers, that is to say, sanna’Llāhu dhālika sunnatan, ‘God has established this as [His] way [of dealing with believers and disbelievers]’) which has taken its course before, and you will never find in God’s way any change, by Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nسُنَّةَ اللَّهِ الَّتِي قَدْ خَلَتْ مِنْ قَبْلُ وَلَنْ تَجِدَ لِسُنَّةِ اللَّهِ تَبْدِيلًا (23(والسنة : الطريقة والعادة . وانتصب { سنة اللَّه } نِيابة عن المفعول المطلق الآتي بدلاً من فعله لإفادة معنى تأكيد الفعل المحذوف . والمعنى : سن الله ذلك سُنة ، أي جعله عادة له ينصر المؤمنين على الكافرين إذا كانت نية المؤمنين نصر دين الله كما قال تعالى : { يا أيها الذين آمنوا إن تنصروا الله ينصركم ويثبت أقدامكم } \\[ محمد : 7 \\] وقال : { ولينصرن الله من ينصره } \\[ الحج : 40 \\] ، أي أنّ الله ضمن النصر للمؤمنين بأن تكون عاقبة حروبهم نصراً وإن كانوا قد يُغلبون في بعض المواقع كما وقع يوم أحد وقد قال تعالى : { والعاقبة للمتقين } \\[ القصص : 83 \\] وقال : { والعاقبة للتقوى } \\[ طه : 132 \\] .وإنما يكون كمال النصر على حسب ضرورة المؤمنين وعلى حسب الإيمان والتقوى ، ولذلك كان هذا الوعد غالباً للرسُول ومن معه فيكون النصر تاماً في حالة الخطر كما كان يوم بدر ، ويكون سجالاً في حالة السعة كما في وقعة أحد وقد دل على ذلك قول النبي صلى الله عليه وسلم يوم بدر :\" اللهم إن تَهلِك هذه العصابة لا تعبَد في الأرض \" وقال الله تعالى : { قال موسى لقومه استعينوا بالله واصبروا إن الأرض لله يورثها من يشاء من عباده والعاقبة للمتقين } \\[ الأعراف : 128 \\] ، ويكون لمن بعد الرسول صلى الله عليه وسلم من جيوش المسلمين على حسب تمسكهم بوصايا الرسول صلى الله عليه وسلم ففي «صحيح البخاري» عن أبي سعيد الخدري عن النبي صلى الله عليه وسلم \" يأتي زمان يغزُو فآمٌ من الناس فيقال : فيكم من صحب النبي؟ فيقال : نعم ، فيفتحُ عليه ، ثم يأتي زمان فيُقال : فيكم من صحب أصحاب النبي؟ فيقال : نعم فيفتح ثم يأتي زمان فيقال : فيكم من صَحِب من صَاحَبَ النبي؟ فيقال : نعم فيُفتحُ \"ومعنى { خلت } مضت وسبقت من أقدم عصور اجتلاد الحق والباطل ، والمضاف إليه { قبلُ } محذوف نُوِي معناه دون لفظه ، أي ليس في الكلام دال على لفظه ولكن يدل عليه معنى الكلام ، فلذلك بُني { قبلُ } على الضم . وفائدة هذا الوصف الدلالة على اطرادها وثباتها .والمعنى : أن ذلك سنة الله مع الرسل قال تعالى : { كتب الله لأغلِبنّ أنا ورسلي إن الله قوي عزيز } \\[ المجادلة : 21 \\] .ولما وصف تلك السنة بأنها راسخة فيما مضى أعقب ذلك بوصفها بالتحقق في المستقبل تعميماً للأزمنة بقوله : { ولن تجد لسنة اللَّه تبديلاً } لأن اطراد ذلك النصر في مختلف الأمم والعصور وإخبارَ الله تعالى به على لسان رسله وأنبيائه يدل على أن الله أراد تأييد أحزابه فيعلم أنه لا يستطيع كائن أن يحول دون إرادة الله تعالى .\n\n",
      "translations": [
        {
          "translation": "(It is the law of Allah which hath taken course aforetime) regarding past nations that they were exposed to killing and defeat when their rebelled against the prophets of Allah. (Thou wilt not find for the law of Allah) you will not find for the law of Allah of punishing those who rebel against the prophets (aught of power to change) any change.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n[المجادلة: 21] { ولن تجد لسنة الله تبديلاً } تغيُّراً\n { وهو الذي كفَّ أيديَهم عنكم } أي: أيدي كفار أهل مكة { وأَيْدِيَكم عنهم } عن أهل مكة { ببطن مكة من بعد أن أظفركم عليهم } أي: أقدركم وسلَّطكم عليهم\n يعني: قضى بينهم وبينكم المكافَّة والمحاجزة بعدما خوّلكم الظفر عليهم والغلبة\n وذلك أن عكرمة بن أبي جهل خرج في خمسمائة إلى الحديبية\n يطلب غرة بالمسلمين\n فبعث رسولُ الله صلى الله عليه وسلم خالدَ بن الوليد على جند\n فهزمهم\n حتى أدخلهم حيطان مكة\n ثم عاد ثانياً فهمزمه\n ثم عاد فهزمه\n هكذا نقله الثعلبي وغيره\n فانظره مع ما في الاكتفاء للكلاعي: أن خالداً كان مع المشركين في الحديبية\n وإنما أسلم بعد الحديبية قبل الفتح\n وكان في السنة الثامة\n والحديبية في السادسة\n والذي ذكر النسفي أنه عليه السلام بعث مَن هزمهم\n ولم يسمه\n وهزمُ خالد لبعض قريش إنما كان في الفتح\n لا في الحديبية\n فلعل الراوي غلط\n وقال أنس: إن ثمانين رجلاً من أهل مكة هبطوا على النبي صلى الله عليه وسلم وأصحابه من جبل التنعيم عند صلاة الفجر\n عام الحديبية\n ليقاتلوا المسلمين\n فأخذهم النبي صلى الله عليه وسلم سِلْماً\n فأعتقهم\n فنزلت الآية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:62",
      "similarity": 0.9893202065625247
    },
    {
      "verse": "15:13",
      "similarity": 0.7721762165120567
    },
    {
      "verse": "3:137",
      "similarity": 0.626704932878357
    },
    {
      "verse": "17:77",
      "similarity": 0.5929032778203981
    },
    {
      "verse": "4:26",
      "similarity": 0.5479145248958056
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/048023.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/048023.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/48:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}