{
  "chapter": "الفتح",
  "text": "محمد رسول الله والذين معه اشداء على الكفار رحماء بينهم ترىهم ركعا سجدا يبتغون فضلا من الله ورضونا سيماهم فى وجوههم من اثر السجود ذلك مثلهم فى التورىة ومثلهم فى الانجيل كزرع اخرج شطـه فـازره فاستغلظ فاستوى على سوقه يعجب الزراع ليغيظ بهم الكفار وعد الله الذين ءامنوا۟ وعملوا۟ الصلحت منهم مغفرة واجرا عظيمۢا",
  "translations": [
    {
      "translation": "Muhammad is the Prophet of God; and those who are with him are severe with infidels but compassionate among themselves. You may see them kneeling and bowing in reverence, seeking His favour and acceptance. Their mark is on their foreheads from the effect of prostrations. Their likeness in the Torah, and their likeness in the Gospel, is like a seed that sends out a stalk, then makes it firm, and it becomes strong and rises straight upon its stem, gladdening the cultivator's heart, in order to fill the unbelievers with dismay. God has promised those who believe and do the right forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is Allah's Messenger, and those who are with him are firm with the unbelievers but compassionate with one another. You see them occupied in bowing and prostrating and in seeking Allah's bounty and good pleasure. They are distinguished from others by the marks of prostration on their faces. Thus are they described in the Torah. And their parable in the Gospel is that of a tilth that puts forth its shoot, then strengthens it so that it becomes stout and stands firmly on its stem. This is a sight pleasing to the sowers and one by which the unbelievers will be enraged. As for those who believe and do righteous deeds, Allah has promised them forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is the Messenger of God and those with him are stern to the disbelievers yet kind among themselves. You can see them bowing and prostrating before God, seeking His favors and pleasure. Their faces (foreheads) are marked due to the effect of their frequent prostrations. That is their description in the Torah and in the Gospel they are mentioned as the seed which shoots out its stalk then becomes stronger, harder and stands firm on its stumps, attracting the farmers. Thus, God has described the believers to enrage the disbelievers. God has promised forgiveness and a great reward to the righteously striving believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mohammed (peace and blessings be upon him) is the Noble Messenger of Allah; and his companions are stern with the disbelievers and merciful among themselves – you will see them bowing and falling in prostration, seeking Allah’s munificence and His pleasure; their signs are on their faces, from the effects of their prostration; this trait of theirs is mentioned in the Taurat; and their trait is mentioned in the Injeel; like a cultivation that sprouted its shoot, then strengthened it, then thickened and then stood firm upon its stem, pleasing the farmer – in order to enrage the disbelievers with them; Allah has promised forgiveness and a great reward to those among them who have faith and do good deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is the Messenger of Allah. And those who are with him are severe against disbelievers, and merciful among themselves. You see them bowing falling down prostrate, seeking reward from Allah and acceptance. The mark of them is on their faces from the traces of prostration. This is their description in the Tawrah. But their description in the Injil is like a seed which sends forth its shoot, then makes it strong, and becomes thick and it stands straight on its stem, delighting the sowers, that He may enrage the disbelievers with them. Allah has promised those among them who believe and do righteous good deeds, forgiveness and a mighty reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is the Apostle of Allah, and those with him are firm of heart against the unbelievers, compassionate among themselves; you will see them bowing down, prostrating themselves, seeking grace from Allah and pleasure; their marks are in their faces because of the effect of prostration; that is their description in the Taurat and their description in the Injeel; like as seed-produce that puts forth its sprout, then strengthens it, so it becomes stout and stands firmly on its stem, delighting the sowers that He may enrage the unbelievers on account of them; Allah has promised those among them who believe and do good, forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is the Messenger of God, and those who are with him are hard against the unbelievers, merciful one to another. Thou seest them bowing, prostrating, seeking bounty from God and good pleasure. Their mark is on their faces, the trace of prostration. That is their likeness in the Torah, and their likeness in the Gospel: as a seed that puts forth its shoot, and strengthens it, and it grows stout and rises straight upon its stalk, pleasing the sowers, that through them He may enrage the unbelievers. God has promised those of them who believe and do deeds of righteousness forgiveness and a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is the messenger of Allah. And those with him are hard against the disbelievers and merciful among themselves. Thou (O Muhammad) seest them bowing and falling prostrate (in worship), seeking bounty from Allah and (His) acceptance. The mark of them is on their foreheads from the traces of prostration. Such is their likeness in the Torah and their likeness in the Gospel - like as sown corn that sendeth forth its shoot and strengtheneth it and riseth firm upon its stalk, delighting the sowers - that He may enrage the disbelievers with (the sight of) them. Allah hath promised, unto such of them as believe and do good works, forgiveness and immense reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is the Messenger of God. Those who are with him are firm and unyielding towards those who deny the truth, but compassionate towards one another. You see them bowing and prostrating themselves, seeking the grace of God and His good will. Their marks are on their faces, the traces of their prostrations; they are described in the Torah and in the Gospel as being like a seed which sends forth its shoot, then makes it strong; it then becomes thick, and it stands firm on its own stem, delighting the sowers. He seeks to enrage the disbelievers through them. God has promised forgiveness and a great reward to those of them who believe and do good works.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is the apostle of Allah. And those who are with him are stern against the infidels and merciful among themselves; Thou beholdest them bowing down and falling prostrate, seeking grace from Allah and His goodWill Mark of them is on their faces from the effect of prostration: such is their similitude in the Taurat. And their similitude in the lnjil: like Unto a sown corn that putteth forth its shoot and strengtheneth it, and swelieth, and riseth upon the stalk thereof delighting the sowers. Such are the early Muslims described that He may enrage the infidels with them. Allah hath promised Unto those among them who believe and work righteous works, forgiveness and a mighty hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad, the Apostle of Allah, and those who are with him are hard against the faithless and merciful amongst themselves. You see them bowing and prostrating [in worship], seeking Allah’s grace, and [His] pleasure. Their mark is [visible] on their faces, from the effect of prostration. Such is their description in the Torah and their description in the Evangel. Like a tillage that sends out its shoots and builds them up, and they grow stout and settle on their stalks, impressing the sowers, so that He may enrage the faithless by them. Allah has promised those of them who have faith and do righteous deeds forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is the messenger of Allah; and those who are with him are strong against Unbelievers, (but) compassionate amongst each other. Thou wilt see them bow and prostrate themselves (in prayer), seeking Grace from Allah and (His) Good Pleasure. On their faces are their marks, (being) the traces of their prostration. This is their similitude in the Taurat; and their similitude in the Gospel is: like a seed which sends forth its blade, then makes it strong; it then becomes thick, and it stands on its own stem, (filling) the sowers with wonder and delight. As a result, it fills the Unbelievers with rage at them. Allah has promised those among them who believe and do righteous deeds forgiveness, and a great Reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad (SAW) is the Messenger of Allah, and those who are with him are severe against disbelievers, and merciful among themselves. You see them bowing and falling down prostrate (in prayer), seeking Bounty from Allah and (His) Good Pleasure. The mark of them (i.e. of their Faith) is on their faces (foreheads) from the traces of (their) prostration (during prayers). This is their description in the Taurat (Torah). But their description in the Injeel (Gospel) is like a (sown) seed which sends forth its shoot, then makes it strong, it then becomes thick, and it stands straight on its stem, delighting the sowers that He may enrage the disbelievers with them. Allah has promised those among them who believe (i.e. all those who follow Islamic Monotheism, the religion of Prophet Muhammad SAW till the Day of Resurrection) and do righteous good deeds, forgiveness and a mighty reward (i.e. Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is the Messenger of Allah. Those who are with him are harsh against the unbelievers but merciful to one another. You see them bow andprostrate themselves seeking the bounty and pleasure of Allah. Their mark is on their faces from the trace of prostration. That is their likeness in the Torah and their likeness in the Gospel, as the seed which puts forth its shoot and strengthens it, so that it grows stout and rises straight upon its stalk, delighting the sowers, and through them He enrages the unbelievers. Allah has promised those of them who believe and do good deeds, forgiveness and a great wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is the Messenger of God. Those with him are stern against the disbelievers, yet compassionate amongst themselves. You see them kneeling, prostrating, seeking blessings from God and approval. Their marks are on their faces from the effects of prostration. Such is their description in the Torah, and their description in the Gospel: like a plant that sprouts, becomes strong, grows thick, and rests on its stem, impressing the farmers. Through them He enrages the disbelievers. God has promised those among them who believe and do good deeds forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Muhammad is the Messenger of Allah; and those with him are forceful against the disbelievers, merciful among themselves. You see them bowing and prostrating [in prayer], seeking bounty from Allah and [His] pleasure. Their mark is on their faces from the trace of prostration. That is their description in the Torah. And their description in the Gospel is as a plant which produces its offshoots and strengthens them so they grow firm and stand upon their stalks, delighting the sowers - so that Allah may enrage by them the disbelievers. Allah has promised those who believe and do righteous deeds among them forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:29] Muhammad (the subject) is the Messenger of God (its predicate) and those who are with him, that is, his Companions from among the believers (wa’lladhīna ma‘ahu, [another] subject, the predicate of which [is the following, ashiddā’u]) are hard, tough, against the disbelievers, showing them no mercy [but], merciful among themselves (ruhamā’u is a second predicate [of wa’lladhīna ma‘ahu, ‘and those who are with him’]), that is to say, they show mutual sympathy and affection for one another, much like a father and a son. You see, you observe, them bowing, prostrating [in worship] (both rukka‘an and sujjadan are circumstantial qualifiers). They seek (yabtaghūna is the beginning of a new sentence) bounty from God and beatitude. Their mark (sīmāhum is a subject), their distinguishing feature, is on their faces (fī wujūhihim is its   predicate): this is a light and a radiance by which, in the Hereafter, they will be recognised as having been those who used to prostrate in this world, from the effect of prostration (min athari’l-sujūdi is semantically connected to the same thing to which the predicate is semantically connected, that is to say, kā’inatan, ‘[this] being [from the effect of prostration]’; syntactically, it is a circumstantial qualifier referring to the subject [of kā’inatan], which is also the subject of the predicate [sc. wujūhihim, ‘their faces’]). That, mentioned description, is their description (mathaluhum is the subject) in the Torah (fī’l-tawrāti is the predicate thereof); and their description in the Gospel (wa-mathaluhum fī’l-injīli, is a subject, the predicate of which is [what follows]) is as a seed that sends forth its shoot (read shat’ahu or shata’ahu) and strengthens it (read āzarahu or azarahu), nourishing it and assisting it, and it grows stout and rises firmly, becoming strong and upright, upon its stalk, its roots (sūq is the plural of sāq), delighting the sowers, that is to say those who planted it, on account of its fairness. The Companions, may God be pleased with them, are being described in this way, for at the outset they were weak and very few in number; but then their number grew and they acquired strength in the most wholesome way, so that He may enrage the disbelievers by them (li-yaghīza bihimu’l-kuffāra is semantically connected to an omitted clause, which is suggested by what preceded, that is to say, ‘they are likened to this [so that God may enrage the disbelievers]’). God has promised those of them who believe and perform righteous deeds, the Companions (minhum, ‘of them’: min, ‘of’, is an indicator of the genus and not partitive, for they are all possessed of the mentioned attributes) forgiveness and a great reward — Paradise. Both of these [rewards] will also be given to those who will come after them, as is stated in other verses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Muhammad is the Messenger of Allah) and this without the witness of Suhayl Ibn 'Amr. (And those with him) i.e. Abu Bakr, the first who believed in him and called the disbelievers with him to the religion of Allah (are hard against the disbelievers) this refers to 'Umar Ibn al-Khattab who was tough with the enemies of Allah, strong in the religion of Allah and a defender of Allah's Messenger (and merciful among themselves) and dutiful towards each other; this refers to 'Uthman Ibn 'Affan who was very dutiful and merciful towards the Muslims, and spent much of his money on them. (Thou (0 Muhammad) seest them bowing) in prayer (and falling prostrate (in worship)) this refers to 'AM Ibn Abi Talib who abundantly bowed and prostrated in prayer, (seeking bounty) reward (from Allah and (His) acceptance) acceptance of their Lord through jihad; this refers to Talhah and al-Zubayr who were very hard on, and tough with, the disbelievers. (The mark of them is on their foreheads from) the sign of their staying awake is on their faces from (the traces of prostration) from repeated prostration at night; this refers to Salman al-Farisi, Bilal, Suhayb and their fellow believers. (Such is their likeness) their description (in the Torah and their likeness) and their description in (in the Gospel like as sown corn) this is the Prophet (pbuh) (that) Allah (sendeth forth its shoot) i.e. Abu Bakr, the first to believe in him and the first to face the enemies of Allah (and strengtheneth it) and assists him; this is 'Umar who assisted the Prophet (pbuh) with his sword against the enemies of Allah (and riseth firm) He became strong with the wealth of 'Uthman which he used in jihad in the way of Allah (upon its stalk) and spread his message among Quraysh through 'AN Ibn Abi Talib, (delighting the sowers) the Prophet (pbuh) was pleased with Talhah and al-Zubayr (that He may enrage the disbelievers with (the sight of) them) by means of Talhah and al-Zubayr. It is also said that from Allah's saying (Muhammad is the Messenger of Allah...) up to here was revealed in praise of those who took part in the swearing of allegiance at Ridwan and the sincere, obedient prophetic Companions in general. (Allah hath promised, unto such of them as believe) in Muhammad (pbuh) and the Qur'an (and do good works) and do acts of obedience in private between themselves and their Lord, (forgiveness) of their sins in this world and in the Hereafter (and immense reward) and abundant reward in the Garden'. And of the surah in which the Private Apartments are mentioned, which is Medinan, and consists of 18 600 verses, 343 words and 1,476 letters: Surah 49: The Private Apartments (al-Hujurat) And of the surah in which the Private Apartments are mentioned, which is Medinan, and consists of 18 verses, 343 words and 1,476 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { سِيمَاهُمْ فِي وُجُوهِهِمْ } معناه الخِشوعُ\n والسِّيماءُ: العَلامةُ\n\n\n\n\nوقوله تعالى: { كَزَرْعٍ أَخْرَجَ شَطْأَهُ } معناه جَوانبُهُ\n\n\n\n\nوقوله تعالى: { فَآزَرَهُ } معناه سَاواهُ فَصارَ مِثلَ الأُمِّ\n { فَٱسْتَغْلَظَ } معناه غَلُظَ { فَٱسْتَوَىٰ عَلَىٰ سُوقِهِ } قال زيدُ بن علي عليهما السَّلامُ: فالسَّاقُ: حَاملةُ الشَّجرِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإنه قال سبحانه: { مُّحَمَّدٌ رَّسُولُ ٱللَّهِ } حق، مرسل من عنده، مبعوث إلى كافة البرايا؛ ليهديهم إلى توحيده الذاتي { وَٱلَّذِينَ مَعَهُ } من المؤمنين له، المصدقين لدعوته، المتعطشين بزلال مشربه { أَشِدَّآءُ عَلَى ٱلْكُفَّارِ } الساترين بغيوم هوياتهم الباطلة هوية الحق الظاهر في الآفاق والأنفس، يدفعون مؤمنة كثراتهم الوهمية بترويج الحق على الباطل، وإعلاء كلمة التوحيد، وتقويم الدين القويم وإظهاره على سائر الأديان { رُحَمَآءُ بَيْنَهُمْ } متواضعون مع أهل الحق وأرباب التوحيد؛ لذلك { تَرَاهُمْ } في عموم أوقاتهم { رُكَّعاً سُجَّداً } أي: راكعين، ساجدين، متذللين، خاضعين، خاشعين، بلا رعونة ولا رياء ولا سمعة ولا هوىً، بل { يَبْتَغُونَ } ويطلبون بتذللهم هذا { فَضْلاً مِّنَ ٱللَّهِ وَرِضْوَاناً } منه سبحانه، وبالجملة: { سِيمَاهُمْ } أي: سمتهم وعلاماتهم الدالة على نجابة طينتهم وكرامة فطرتهم ظاهرة { فِي وُجُوهِهِمْ مِّنْ أَثَرِ ٱلسُّجُودِ } وكثرة التذلل والخشوع نحو الحق { ذَلِكَ } المذكور من أوصافهم { مَثَلُهُمْ } وصفتهم العجيبة المذكورة { فِي ٱلتَّوْرَاةِ وَمَثَلُهُمْ } هكذا أيضاً { فِي ٱلإِنجِيلِ }\n\n\nوبالجملة: مثلهم في بدء ظهورهم وخروجهم أولاً في غاية الضعف والنحافة، واشتدادهم وغلظهم على الأعداء، ووفور رأفتهم ورحمتهم على الأولياء ثانياً { كَزَرْعٍ } أي: كمثل زرع وقع على الأرض ضعيفاً وبرز منها نحيفاً، ثم ظهر عليها ونبت قوياً يوماً فيوماً إلى حيث { أَخْرَجَ شَطْأَهُ } أي: أفراخه وأغصانه دقيقاً دقيقاً { فَآزَرَهُ } قومه بالمعاونة { فَٱسْتَغْلَظَ } وعاد غليظاً بعدما رباه وأحسن تربيته { فَٱسْتَوَىٰ } واستقام بعد ذلك { عَلَىٰ سُوقِهِ } أي: قصبه وساقه على وجه { يُعْجِبُ ٱلزُّرَّاعَ } عند رؤيته بكمال كثافته وغلظته ونضارته ولطافته\n\n\n\n\nوإنما رباهم سبحانه وقواهم على أبلغ وجه وأحسنه { لِيَغِيظَ } ويتحسر { بِهِمُ ٱلْكُفَّارَ } المخالفون المخاصمون لهم من كمال تشددهم وترقبهم، وبالجملة: { وَعَدَ ٱللَّهُ } المطلع على ما في استعداداتهم عباده من الإخلاص والتفويض { ٱلَّذِينَ آمَنُواْ } بكمال المحبة والتسليم { وَ } مع ذلك { عَمِلُواْ ٱلصَّالِحَاتِ } المقربة لهم إلى الله { مِنْهُم } أي: من جنسهم { مَّغْفِرَةً } ستراً ومحواً لأنانياتهم الباطلة { وَأَجْراً عَظِيماً } [الفتح: 29] هو الفوز بشرف اللقاء، والوصول إلى سدرة المنتهى، وليس وراء الله مرمى\n\n\n\n\nرزقنا الله الوصول إليه، والوقوف بين يديه\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها المحمدي المتوجه نحو توحيد الذات - مكنك الله في مقعد الصدق، ووطنك في مقر التوحيد - أن تعتدل في عموم أوصافك، وأخلاقك وأعمالك، مجتنباً عن كلا طرفي الإفراط والتفريط، معرضاً عن قصور مطلق التخمين والتقليد، مقتصداً في جميع أطوارك وشئونك، مقتفياً في جميع أخلاقكم وأطوارك أثر نبيك الهادي إلى سواء السبيل حتى ينفتخ لك أبواب عموم الكرامات والسعادات، وينغلق دونك مداخل أنواع المكروهات والمنكرات، وإياك إياك أن تختلط مع أهل الغفلة وأصحاب الجهالات المترددين في أودية الغي والضلالات؛ ليتيسر لك التحقق إلى فضائل الوصال؟\n\n\n\nجعلنا الله من زمرة أوليائه المقتصدين، الذين ثبتوا على الصراط المستقيم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { محمد رسولُ الله } أي: ذلك المرسَل بالهدى ودين الحق هو محمد رسول الله، فهو خبر عن مضمر، و \" رسول \": نعت، أو: بدل، أو: بيان، أو: \" محمد \": مبتدأ و \" رسول \": خبر، { والذين معه } مبتدأ، خبره: { أشداءُ على الكفار رُحماءُ بينهم } أو: \" الذين \": عطف على \" محمد \" ، و \" أشداء \": خبر الجميع، أي: غِلاظ شِداد على الكفار في حَرْبهم، رُحماء متعاطفون بينهم، يعني: أنهم كانوا يُظهرون لمَن خالف دينهم الشدة والصلابة، ولمَن وافقَ دينهم الرأفةَ والرحمةَ، وهذا كقوله تعالى:\n\n[المائدة: 54]، وبلغ من تشديدهم على الكفار أنهم كانوا يتَحرّزون من ثيابهم أن تلزق بثياب الكفار، ومن أبدانهم أن تمسّ أبدانهم، وبلغ من تراحمهم فيما بينهم: أنهم كانوا لا يرى مؤمنٌ مؤمناً إلا صافحه وعانقه\n وهذا الوصف الذي مَدَحَ اللّهُ به الصحابةَ رضي الله عنهم مطلوبٌ من جميع المؤمنين، لقوله صلى الله عليه وسلم:\n\n \" ترى المؤمنين في تراحمهم وتوادَّهم وتعاطفهم كالجسد الواحد، إذا اشتكى منه عضو تداعى له سائرُ الجسد بالسهر والحُمَّى \" \n\nرواه البخاري، وقال أيضاً:\n\n \" نَظَرُ الرجل إلى أخيهِ شوقاً خيراُ من اعتكاف سَنَة في مسجدِي هذا \" \n\n، ذكره في الجامع\n { تراهم رُكَّعاً سجداً } أي: تُشاهدُهم حال كونهم راكعين ساجدين لمواظبتهم على الصلوات، أو: على قيام الليل، كما قال مَن شاهد حالهم: رهبان بالليل أُسدٌ بالنهار، وهو استئناف، أو: خبر، { يبتغون فضلاً من الله ورضواناً } أي: ثواباً ورضا وتقريباً { سِيماهم } علامَاتهم { في وجوههم } في جباههم { من أثر السجود } أي: من التأثير الذي يؤثّره كثرة السجود\n وما رُوي عنه عليه السلام:\n\n \" لا تُعلموا صوَركم \" \n\nأي: لا تسمُوها، إنما هو فيمن يتعَمد ذلك باعتماد جبهته على الأرض، ليحدث ذلك فيها، وذلك رياء ونفاق، وأما إن حَدَثَ بغير تعمُّد، فلا ينهى عنه، وقد ظهر على كثير من السلف الصالح غُرة في جباههم مع تحقُّق إخلاصهم\n\n\nوقال منصور: سألت مجاهداً عن قوله: { سيماهم في وجوههم } أهو الأثر يكون بين عيني الرجل؟ قال: لا ربما يكون بين عيني الرجل مِثلُ ركبة البعير، وهو أقسى قلباً من الحجارة، ولكنه نورٌ في وجوهم من الخشوع\n وقال ابن جيرح: هو الوقار والبهاء، وقيل: صفرة الوجوه، وأثر السهر\n وقال الحسن: إذا رأيتهم حسبتهم مرضى، وما هم مرضى\n وقال سفيان وعطاء: استنارت وجوههم من طول ما وصلُّوا بالليل، لقوله عليه السلام:\n\n \" مَن كَثُرت صلاتُه بالليل حَسُن وجْههُ بالنَّهار \" \n\nوقال ابن عطية: إنه من قول شريك لا حديث، فانظره، وقال ابن جبير: في وجوههم يوم القيامة يُعرفون به أنهم سجدوا في الدنيا لله تعالى\n هـ\n { ذلك مَثَلُهم في التوراة } الإشارة إلى ما ذكر من نعوتهم الجليلة، وما فيها من معنى البُعد مع قُرب العهد للإيذان بعلو شأنه، وبُعد منزلته في الفضل، أي: ذلك وصفهم العجيب الجاري في الغرابة مجرى الأمثال، هو نعتهم في التوراة، أي: كونهم أشدّاء على الكفار، رحماء بينهم، سيماهم في وجوههم\n ثم ذكر وَصْفَهم في الإنجيل فقال: { ومَثَلُهم في الإِنجيل كزرعٍ\n\n } الخ، وقيل عطفٌ على ما قبله، بزيادة \" مَثَلَ \" ، أي: ذلك مثلُهم في التوراة والإنجيل، ثم بيَّن المثل فقال: هم كزرع { أخرج شطأه } فِرَاخَه، يقال: أشْطأ الزرع: أفرخ، فهو مُشْطِىءٌ، وفيه لغات: شطأه بالسكون والفتح، وحذف الهمزة، كقضاة\n و \" شطَهُ \" ، بالقصر، { فآزره } فقوّاه، من: المؤازرة، وهي الإعانة، { فاستغلظ } فصار من الرقة إلى الغلظ، { فاستوى على سُوقه } فاستوى على قصبه، جمع: ساق، { يُعجِبُ الزُّرَّاع } يتعجبون من قوّته، وكثافته، وغِلظه، وحُسن نباتِه ومنظره\n وهو مَثَلٌ ضربه الله لأصحابه صلى الله عليه وسلم في بدء الإسلام، ثم كثروا واستحكموا، بتَرَقي أمرُهم يوماً بيوم، بحيث أعجب الناسَ أمرهم، فكان الإسلام يتقوّى كما تقوى الطاقة من الزرع، بما يحتفّ بها مما يتولّد منها\n وقيل: مكتوب في الإنجيل: سيخرج قوم ينبتون نبات الزرع، يأمرون بالمعروف، وينْهون عن المنكر\n وعن عكرمة: أخرج شطأه بأبي بكر، فآرزه بعمر، فاستغلظ بعثمان، فاستوى على سوقه بعليّ\n وحكى النقاش عن ابن عباس، أنه قال: الزرعُ النبي صلى الله عليه وسلم، فآزره عليّ بن أبي طالب، فاسغلظ بأبي بكر، فاستوى على سوقه بعمر\n هـ\n واختار ابن عطية: أن المَثَل شامل للنبي صلى الله عليه وسلم وللصحابة، فإنّ النبي صلى الله عليه وسلم بُعِث وحده، فهو الزرع، حَبّة واحدة، ثم كثُر المسلمون، فهم كالشطْءِ، تَقَوّى بهم صلى الله عليه وسلم\n\n\n{ ليغيظ بهم الكفار } تعليل لما يُعرب عنه الكلامُ من تشبيههم بالزرع في ذكائه واستحكامه، أي: جعلهم كذلك ليغيظ بهم مَن كَفَر بالله\n { وَعَدَ اللّهُ الذين آمنوا وعملوا الصالحات مغفرةً وأجراً عظيماً } استئناف مُبيِّن لما خصَّهم به من الكرامة في الآخرة، بعد بيان ما خصَّهم به في الدنيا، ويجوز أن يرجع لقوله: { ليغيظ بهم\n\n\n } الخ: أي: ليغيظ بهم وعَدهم بالمغفرة والأجر العظيم لأن الكفار إذا سمعوا ما أُعدّ لهم في الآخرة مع ما خصَّهم في الدنيا من العزة والنصر غاظهم ذلك أشد الغيظ، و \" من \" في \" منهم \" للبيان، كقوله:\n\n[الحج: 30] أي: وعد الله الذين آمنوا من هؤلاء\n الإشارة: هو الذي أرسل رسول بالهدى: بيان الشرائع، ودين الحق: بيان الحقائق، فمَن جمع بينهما من أمته ظهر دينُه وطريقته، وهذا هو الوليّ المحمدي، أعني: ظاهره شريعة، وباطنه حقيقة، وما وصَف به سبحانه أصحاب الرسول صلى الله عليه وسلم هو وصْفُ الصوفية، أهل التربية النبوية، خصوصاً طريق الشاذلية، حتى قال بعضهم: مَن حلف أن طريق الشاذلية عليها كانت بواطنُ الصحابة ما حنث\n وقوله تعالى: { يبتغون فضلاً من الله ورضواناً } قال الورتجبي: أي: يطلبون مزيدَ كشف في الذات والدنو والوصالِ والبقاء مع بقائه بلا عتاب ولا حجاب، وهذا محل الرضوان الأكبر\n هـ\n وقوله تعالى: { سيماهم في وجوههم } أي: نورهم في وجوههم، لتوجهِهم نحو الحق، فإنَّ مَن قَرُب من نور الحق ظهرت عليه أنورا المعرفة، وجمالُها وبهاؤها، ولو كان زنجيّاً أو حبشيّاً، وفي ذلك قيل:\n\nويقال: السيما للعارفين، والبَهجة للمحبين، فالسيما هي الطمأنينة، والرزانة، والهيبة، والوقار، كل مَن رآهم بديهةً هابَهم، ومَن خالطهم معرفةً أحبهم، والبهجة: حسن السمت والهَدْي، وغلبة الشوق، والعشقُ، واللهج بالذكر اللساني\n والله تعالى أعلم\n وروى السلمي عن عبد العزيز المكي: ليس السيما النُحولة والصفرة، ولكنه نور يظهر على وجوه العابدين، يبدو من باطنهم على ظاهرهم، يتبين ذلك للمؤمنين، ولو كان ذلك في زنجي أو حبشي\n وعن بعضهم: ترى على وجوههم هيئة لقُرب عهدِهم بمناجاة سيدهم\n وقال ابن عطاء: ترى عليهم طِلع الأنوار لائحة\n وقال الورتجبي: المؤمن وجهٌ لله بلا قفا، مقبلاً عليه، غير معرض عنه، وذلك سيما المؤمن\n هـ\n وبالله التوفيق، وصلى الله على سيدنا محمد وآله وصحبه وسلم\n\n",
      "translations": []
    }
  ]
}