{
  "chapter": "الفتح",
  "text": "اذ جعل الذين كفروا۟ فى قلوبهم الحمية حمية الجهلية فانزل الله سكينته على رسوله وعلى المؤمنين والزمهم كلمة التقوى وكانوا۟ احق بها واهلها وكان الله بكل شىء عليما",
  "translations": [
    {
      "translation": "Those who are kafir filled their hearts with fanatical rage - the fanatical rage of the Time of Ignorance and Allah sent down serenity to His Messenger and to the muminun, and bound them to the expression of taqwa which they had most right to and were most entitled to. Allah has knowledge of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the unbelievers fostered a sense of honour in their hearts, a sense of pagan honour, God sent down a sense of tranquility on His Apostle and the believers, and obliged them to an act of self-restraint, for they were deserving and worthy of it. God is cognisant of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is why) when the unbelievers set in their hearts a fierce bigotry -- the bigotry of ignorance -- Allah bestowed inner peace upon His Messenger and upon the believers and made the word of piety binding on them. They were more deserving and worthier thereof. Allah has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Since the disbelievers held zealous ignorance in their hearts, like that of the pre-Islamic age of darkness, God gave confidence to His Messenger and to the believers, binding them to the principle of piety which they deserve. God has the knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whereas the disbelievers had set up in their hearts an obstinacy – the same obstinacy of the days of ignorance – so Allah sent down His solace upon His Noble Messenger and upon the believers, and decreed upon them the words of piety, and they were more deserving and suitable for it; and Allah is the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who disbelieve had put in their hearts pride and haughtiness -- the pride and haughtiness of the time of ignorance, -- then Allah sent down His calmness and tranquillity upon His Messenger and upon the believers, and made them stick to the word of Taqwa; and they were well entitled to it and worthy of it. And Allah is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who disbelieved harbored in their hearts (feelings of) disdain, the disdain of (the days of) ignorance, but Allah sent down His tranquillity on His Apostle and on the believers, and made them keep the word of guarding (against evil), and they were entitled to it and worthy of it; and Allah is Cognizant of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the unbelievers set in their hearts fierceness, the fierceness of pagandom, then God sent down His Shechina upon His Messenger and the believers, and fastened to them the word of godfearing to which they have better right and are worthy of; and God has' knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who disbelieve had set up in their hearts zealotry, the zealotry of the Age of Ignorance, then Allah sent down His peace of reassurance upon His messenger and upon the believers and imposed on them the word of self-restraint, for they were worthy of it and meet for it. And Allah is Aware of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "While those who deny the truth made it a prestige issue [in their hearts], the bigotry of the days of ignorance, God sent His tranquillity down on to His Messenger and believers and firmly established in them the principle of righteousness, for they were indeed better entitled to it and more worthy of it. God has full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who disbelieve had put in their hearts a zeal, the zeal of Paganism, then Allah sent down His tranquillity upon His apostle and upon the believers, and kept them fixed on the way of piety, and they were worthy thereof and meet therefor; and Allah is of everything ever Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the faithless nourished bigotry in their hearts, the bigotry of pagan ignorance, Allah sent down His composure upon His Apostle and the faithful, and made them abide by the word of Godwariness, for they were the worthiest of it and deserved it, and Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "While the Unbelievers got up in their hearts heat and cant - the heat and cant of ignorance,- Allah sent down His Tranquillity to his Messenger and to the Believers, and made them stick close to the command of self-restraint; and well were they entitled to it and worthy of it. And Allah has full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who disbelieve had put in their hearts pride and haughtiness the pride and haughtiness of the time of ignorance, then Allah sent down His Sakinah (calmness and tranquillity) upon His Messenger (SAW) and upon the believers, and made them stick to the word of piety (i.e. none has the right to be worshipped but Allah), and they were well entitled to it and worthy of it. And Allah is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the unbelievers established in their hearts fierce bigotry, the fierce bigotry of ignorance, Allah sent down His tranquility on His Messenger and the believers and firmly fastened to them the Word of 'taqwa' (there is no god except Allah, and Muhammad is His Messenger, as it is the cause of righteousness) to which they have better right and are worthy of it. Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved filled their hearts with rage—the rage of the days of ignorance. But God sent His serenity down upon His Messenger, and upon the believers, and imposed on them the words of righteousness—of which they were most worthy and deserving. God is aware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who disbelieved had put into their hearts chauvinism - the chauvinism of the time of ignorance. But Allah sent down His tranquillity upon His Messenger and upon the believers and imposed upon them the word of righteousness, and they were more deserving of it and worthy of it. And ever is Allah, of all things, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:26] When those who disbelieve (alladhīna kafarū is the subject [of the following verb ja‘ala]) nourished (idh ja‘ala is semantically connected to ‘adhdhabnā) in their hearts zealotry (al-hamiyya, [means] ‘disdain of something’), the zealotry of pagandom (hamiyyata’l-jāhiliyyati substitutes for al-hamiyyata, ‘zealotry’), namely, their barring of the Prophet and his Companions from [visiting] the Sacred Mosque, [but] then God sent down His spirit of Peace upon His Messenger and the believers, and so they [the disbelievers] made a truce with them on the condition that they [the believers] would [be allowed to] return the following year, and [such] zealotry would not overcome them [the believers] as it did the disbelievers [then] until they would come to fight them [later], and He made them, the believers, abide by the word of God-fearing (kalimata’l-taqwā): ‘there is no god except God, [and] Muhammad is His Messenger’ (it [kalima, ‘word’] is annexed to al-taqwā because it is the cause of it), for they were worthier of it, of the word, than the disbelievers, and deserving of it (wa-ahlahā is an explanatory supplement). And God is ever Knower of all things, that is to say, He is ever possessed of such an attribute, and among the things He knows is that they are worthy of it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِذْ جَعَلَ الَّذِينَ كَفَرُوا فِي قُلُوبِهِمُ الْحَمِيَّةَ حَمِيَّةَ الْجَاهِلِيَّةِ فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَى رَسُولِهِ وَعَلَى الْمُؤْمِنِينَ وَأَلْزَمَهُمْ كَلِمَةَ التَّقْوَى وَكَانُوا أَحَقَّ بِهَا وَأَهْلَهَا وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمًا (26(ظرف متعلق بفعل { صدوكم } \\[ الفتح : 25 \\] أي صدوكم صدًّا لا عذر لهم فيه ولا داعي إليه إلا حميةَ الجاهلية ، وإلا فإن المؤمنين جاءوا مسالمين معظمين حُرمة الكعبة سائقين الهدايا لنفع أهل الحرم فليس من الرشد أن يمنعوا عن العمرة ولكن حمية الجاهلية غطّت على عقولهم فصمّموا على منع المسلمين ، ثم آل النزاع بين الطائفتين إلى المصالحة على أن يرجع المسلمون هذا العام وعلى أن المشركين يمكنوهم من العمرة في القابل وأن العامين سواء عندهم ولكنهم أرادوا التشفي لما في قلوبهم من الإحن على المسلمين .فكان تعليق هذا الظرف بفعل { وصدوكم } مشعراً بتعليل الصَّد بكونه حمية الجاهلية ليفيد أن الحمية مُتَمَكنة منهم تظهر منها آثارها فمنها الصد عن المسجد الحرام .والحمية : الأنفة ، أي الاستنكاف من أمرٍ لأنه يراه غضاضة عليه وأكثر إطلاق ذلك على استكبار لا موجب له فإن كان لموجب فهو إباء الضيم . ولما كان صدهم الناس عن زيارة البيت بلا حق لأن البيت بيت الله لا بيتهم كان داعي المنع مجرد الحمية قال تعالى : { وما كانوا أولياءه } \\[ الأنفال : 34 \\] . و { جعل } بمعنى وضع ، كقول الحريري في المقامة الأخيرة «اجعل الموت نصب عينك» ، وقول الشاعر :وإثمد يجعل في العين ... وضمير { جعل } يجوز أن يكون عائداً إلى اسم الجلالة في قوله : { ليدخل الله في رحمته } \\[ الفتح : 25 \\] من قوله : { لعذبنا الذين كفروا } \\[ الفتح : 25 \\] والعدول عن ضمير المتكلم إلى ضمير الغيبة التفات .و { الذين كفروا } مفعول أول ل { جعل } . و { الحمية } بدل اشتمال من { الذين كفروا } ، و { في قلوبهم } في محل المفعول الثاني ل { جعل } ، أي تخلّقُوا بالحمية فهي دافعة بهم إلى أفعالهم لا يراعون مصلحة ولا مفسدة فكذلك حين صدّوكم عن المسجد الحرام .و { في قلوبهم } متعلق ب { جعل } ، أي وضع الحمية في قلوبهم .وقوله : { حمية الجاهلية } عطف بيان للحمية قُصد من إجماله ثم تفصيله تقريرُ مدلوله وتأكيده مَا يحصل لو قال : { إذ جعل الذين كفروا في قلوبهم حميةَ الجاهلية } .وإضافة الحمية إلى الجاهلية لقصد تحقيرها وتشنيعها فإنها من خلق أهل الجاهلية فإن ذلك انتساب ذم في اصطلاح القرآن كقوله : { يظنون بالله غير الحق ظن الجاهلية } \\[ آل عمران : 154 \\] وقوله : { أفحكم الجاهلية يبغون } \\[ المائدة : 50 \\] .ويعكس ذلك إضافة السكينة إلى ضمير الله تعالى إضافة تشريف لأن السكينة من الأخلاق الفاضلة فهي موهبة إلهاية .وتفريع { فأنزل الله سكينته على رسوله وعلى المؤمنين } ، على { إذ جعل الذين كفروا } ، يؤذن بأن المؤمنين ودُّوا أن يقاتلوا المشركين وأن يدخُلوا مكة للعمرة عنوة غضباً من صدّهم عنها ولكن الله أنزل عليهم السكينة .والمراد بالسكينة : الثبات والأناة ، أي جعل في قلوبهم التأنّي وصرف عنهم العجْلة ، فعصمهم من مقابلة الحَمِية بالغضب والانتقاممِ فقابلوا الحمية بالتعقل والتثبت فكان في ذلك خير كثير .وفي هذه الآية من النكت المعنوية مقابلة { جعل } ب { أنزل } في قوله : { إذ جعل الذين كفروا في قلوبهم الحمية } وقوله : { فأنزل الله سكينته } فدلّ على شرف السكينة على الحمية لأن الإنزال تخييل للرفعة وإضافة الحمية إلى الجاهلية ، وإضافة السكينة إلى اسم ذاته . وعُطف على إنزال الله سكينته { ألزمهم كلمة التقوى } \\[ الفتح : 26 \\] ، أي جعل كلمة التقوى لازمة لهم لا يفارقونها ، أي قرن بينهم وبين كلمة التقوى ليكون ذلك مقابلَ قوله : { وصدوكم عن المسجد الحرام } \\[ الفتح : 25 \\] فإنه لما ربط صدهم المسلمين عن المسجد الحرام بالظرف في قوله : { إذ جعل الذين كفروا في قلوبهم الحمية الجاهلية } رَبْطاً يفيد التعليل كما قدمناه آنفاً رَبَطَ ملازمة المسلمين كلمة التقوى بإنزال السكينة في قلوبهم ، ليكون إنزال السكينة في قلوبهم ، وهو أمر باطني ، مؤثراً فيهم عملاً ظاهرياً وهو ملازمتهم كلمة التقوى كما كانت حمية الجاهلية هي التي دفعت الذين كفروا إلى صد المسلمين عن المسجد الحرام .وضمير النصب في { وألزمهم } عائد إلى { المؤمنين } لأنهم هم الذين عوّض الله غضبهم بالسكينة ولم يكن رسول الله مفارقاً السكينة من قبل .و { كلمة التقوى } إن حملت على ظاهرِ معنى { كلمة } كانت من قبيل الألفاظ وإطلاق الكلمة على الكلام شائع ، قال تعالى : { إنها كلمة هو قائلها } \\[ المؤمنون : 100 \\] ففسرت الكلمة هنا بأنها قول : لا إله إلا الله . وروي هذا عن أُبيّ بن كعب عن النبي صلى الله عليه وسلم فيما رواه الترمذي ، وقال : هو حديث غريب . قلت : في سنده : ثوير ، ويقال : ثور بن أبي فاختة قال فيه الدارقطني : هو متروك ، وقال أبو حاتم : هو ضعيف . وروى ابن مردوية عن أبي هريرة وسلمةَ بن الأكوع مثله مرفوعاً وكلها ضعيفة الأسانيد . وروي تفسيرها بذلك عند عدد كثير من الصحابة ومعنى إلزامه إياهم كلمة التقوى : أنه قدَّر لهم الثبات عليها قولاً بلفظها وعملاً بمدلولها إذ فائدة الكلام حصول معناه ، فإطلاق ( الكلمة ( هنا كإطلاقه في قوله تعالى : { وجعلها كلمة باقية في عقبه } \\[ الزخرف : 28 \\] يعني بها قول إبراهيم لأبيه وقومه { إنني بَراء مما تعبدون إلا الذي فطرني فإنه سيهدين } \\[ الزخرف : 26 ، 27 \\] .وإضافة { كلمة } إلى { التقوى } على هذا التفسير إضافة حقيقية . ومعنى إضافتها : أن كلمة الشهادة أصل التقوى فإن أساس التقوى اجتناب عبادة الأصنام ، ثم تتفرع على ذلك شعب التقوى كلها . ورويت أقوال أخرى في تفسير { كلمة التقوى } بمعنى كلام آخر من الكلم الطيب وهي تفاسير لا تلائم سياق الكلام ولا نظمه . ويجوز أن تحتمل { كلمة } على غير ظاهر معناها فتكون مقحمة وتكون إضافتها إلى التقوى إضافة بيانية ، أي كلمة هي التقوى ، ويكون المعنى : وألزمهم التقوى على حد إقحام لفظ اسم في قول لبيد :إلى الحول ثم اسمُ السلام عليكماومنه قوله تعالى : { تبارك اسمُ ربك } \\[ الرحمن : 78 \\] على أحد التفسيرين فيه . ويدخل في التقوى ابتداءً توحيدُ الله تعالى .ويجوز أن يكون لفظ { كلمة } مطلقاً على حقيقة الشيء . وجُماع معناه كإطلاق الاسم في قول النابغة :نبئت زرعة والسفاهة كاسمِها ... يُهدي إلى غرائب الأشعارويؤيد هذا الوجه ما نقل عن مجاهد أنه قال : كلمة التقوى : الإخلاص . فجعل ( الكلمة ( معنى من التقوى . فالمعنى على هذين التوجهين الأخيرين : أنهم تخلقوا بالتقوى لا يفارقونها فاستعير الإلزام لدوام المقارنة . وهذان الوجهان لا يعارضان تفسير كلمة ( التقوى ( بكلمة ( الشهادة ( المروي عن رسول الله صلى الله عليه وسلم إذ يكون ذلك تفسيراً بجزئي من التقوى هو أهمّ جزئياتها ، أي تفسير مثال .وعن الحسن : أن كلمة { التقوى } الوفاء بالعهد ، فيكون الإلزام على هذا بمعنى الإيجاب ، أي أمرهم بأن يفوا بما عاهدوا عليه للمشركين ولا ينقضوا عهدهم ، فلذلك لم ينقض المسلمون العهد حتى كان المشركون هم الذين ابتدأوا بنقضه .والواو في { وكانوا أحق بها } واو الحال ، والجملة حال من الضمير المنصوب ، أي ألزمهم تلك الكلمة في حال كانوا فيه أحق بها وأهلها ممن لم يلزموها وهم الذين لم يقبلوا التوحيد على نحو قوله تعالى : { وإن كانت لكبيرة إلاّ على الذين هدى الله } \\[ البقرة : 143 \\] . وجيء بفعل كانوا لدلالتها على أن هذه الأحقية راسخة فيهم حاصلة في الزمن الماضي ، أي في قدر الله تعالى .والمعنى : أن نفوس المؤمنين كانت متهيئة لقبول كلمة التقوى والتزامها بما أرشدها الله إليه . والمفضل عليه مقدر دلّ عليه ما تقدم ، أي أحق بها من الذين كفروا والذين جعل الله في قلوبهم الحمية لأن الله قدّر لهم الاستعداد للإيمان دون الذين أصروا على الكفر .وأهل الشيء مستحقُه ، والمعنى أنهم كانوا أهل كلمة التقوى لأنها تناسب ضمائرهم وما انطوت عليه قلوبهم . وهذه الأهلية مثل الأحقية متفاوتة في الناس وكلما اهتدى أحد من المشركين إلى الإسلام دلّ اهتداؤه على أنه حصلت له هذه الأهلية للإسلام .وجملة { وكان اللَّه بكل شيء عليماً } تذييل ، أي وسبق في علم الله ذلك في عموم ما أحاط به علم الله من الأشياء مجرى تكوينه على نحو علمه .\n\n",
      "translations": [
        {
          "translation": "(When those who disbelieve) the disbelievers of Mecca (had set up in their hearts zealotry, the zealotry of the Age of Ignorance) by preventing the Messenger of Allah (pbuh) and his Companions from the House, (then Allah sent down His peace of reassurance) His tranquillity (upon His messenger and upon the believers) and removed zealotry from them (and imposed on them) and inspired them with (the word of self restraint) \"there is no deity save Allah and Muhammad is the Messenger of Allah\", (for they were worthy of it) they were worthy of \"there is no deity save Allah and Muhammad is the Messenger of Allah\", as it was in Allah's beginninglessly eternal knowledge (and meet for it) in the life of this world. (And Allah is Aware of all things) regarding honouring the believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَلْزَمَهُمْ كَلِمَةَ ٱلتَّقْوَىٰ } معناه أن لا إله إلاَّ الله\n\n\n\n\nوقوله تعالى: { إِذْ جَعَلَ ٱلَّذِينَ كَفَرُواْ فِي قُلُوبِهِمُ ٱلْحَمِيَّةَ } معناه العصبيةُ\n\n",
      "translations": [
        {
          "translation": " And His saying - the Most High - {And enjoin upon them al-taqwa}, its meaning is that there is no god but Allah.\n\n\nAnd His saying - Almighty - \"{Those who disbelieve have {the hatred} in their hearts}\": its meaning is [that they have] the hostility.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فهمّ المؤمنون أن يبطشوا { فَأَنزَلَ ٱللَّهُ سَكِينَتَهُ } ووقاره { عَلَىٰ رَسُولِهِ وَعَلَى ٱلْمُؤْمِنِينَ } إذ هم أحقاء بالطمأنينة والوقار وكظم الغيظ وتوطين النفس بالمكاره { وَ } بالجملة { أَلْزَمَهُمْ } سبحانه { كَلِمَةَ ٱلتَّقْوَىٰ } واختار لهم صون النفس عن التهور والغلظة { وَكَانُوۤاْ أَحَقَّ بِهَا } من غيرها { وَأَهْلَهَا } أي: كانوا أهلاً لحفظها ورعايتها { وَ } بالجملة: { كَانَ ٱللَّهُ } المراقب لعموم أحوالهم { بِكُلِّ شَيْءٍ } يليق بهم وينبغي لهم { عَلِيماً } [الفتح: 26] يوفقهم عليه ويسهل عليهم الاتصاف به\n\n\nثم لما رأى صلى الله عليه وسلم في منامه أنه وأصحابه دخلوا مكة أمنين\n وقد حلقوا وقصروا\n فقص صلى الله عليه وسلم الرؤيا على أصحابه\n ففرحوا وظنوا أن ذلك في عامهم هذا\n فلما تأخر بالصلح والمعاهدة\n قال بعضهم: والله ما حلقنا وما قصرنا وما رأينا البيت\n فنزلت: { لَّقَدْ صَدَقَ ٱللَّهُ رَسُولَهُ ٱلرُّءْيَا } أي: جعله سبحانه صادقاً في ما رأة ملتبساً { بِٱلْحَقِّ } والله أيها المؤمنون { لَتَدْخُلُنَّ ٱلْمَسْجِدَ ٱلْحَرَامَ إِن شَآءَ ٱللَّهُ آمِنِينَ } من العدو",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: واذكر { إِذ جعلَ الذين كفروا } من قريش أي: ألقوا { في قلوبهمُ الحميِّة } أي: الأنفَة والتكبُّر، أو: صيّروا الحميةَ راسخة في قلوبهم { حميةَ الجاهليةِ } بدل، أي: حَميّة الملة الجاهلية، أو الحميّة الناشئة من الجاهلية، ووضع الموصول موضع ضميرهم، إذ تقدّم ذكرهم، لذمِّهم بما في حيز الصلة، وتعليل الحكم به. والجعل بمعنى الإلقاء، فلا يتعدّى إلى مفعولين، أوك بمعنى التصيير، فالمفعول الثاني محذوف، كما تقدّم. و \" الذين \": فاعل، على كل حال. { فأنزل اللّهُ سكينتَه على رسوله وعلى المؤمنين } أي: أنزل في قلوبهم الطمأنينة والوقار، فلم يتضعضعوا من الشروط التي شرطت قريش. رُوي: أن رسول الله لمَّا نزل الحديبية بعثت قريشٌ سهيل بن عمرو، وحويطب بن عبد العُزَّى، ومِكْرَز بن حفص، على أن يعرضوا على رسول الله صلى الله عليه وسلم أن يرجع من عامه ذلك، على أن تخلي له قريش مكة من العام القابل ثلاثة أيام، ففعل ذلك، وكتب بينهم كتاباً، فقال صلى الله عليه وسلم لعليّ رضي الله عنه:\n \" اكتب: بسم الله الرحمن الرحيم \" \nفقال سهيل وأصحابه ما نعرف هذا، ولكن اكتب: باسمك اللهم، ثم قال:\n \" اكتب: هذا ما صالح عليه رسولُ الله أهلَ مكة \" \nفقالوا: لو كنا نعلم أنك رسول الله ما صددناك عن البيت وما قاتلناك، ولكن اكتب: هذا ما صالح عليه محمدٌ بن عبد الله أهلَ مكة، فقال صلى الله عليه وسلم:\n \" اكتب ما يريدون، فأنا أشهد أنّي رسول، وأنا محمد بن عبد الله \" \nفهمّ المسلمون أن يأبَوا ذلك، ويبطشوا بهم، فأنزل الله السكينة عليهم، فتوقّروا وحلُموا. وفي رواية البخاري: فكتب عليّ رضي الله عنه:\n \" هذا ما قضى عليه محمد رسول الله \" \nفلما أَبَوا ذلك، قال صلى الله عليه وسلم لعليّ:\n \" امح رسول الله، واكتب: محمد بن عبد الله \" \n، فقال: والله لا أمحوك أبداً، فأخذ صلى الله عليه وسلم الصحيفة وكتب ما أرادوا. قيل: كتب بيده معجزةً، وقيل: أَمَرَ من كتب، وهو الأصح. { وإلزمهم كلمةَ التقوى } شهادة \" لا إله إلا الله \" وقيل: بسم الله الرحمن الرحيم، وقيل: محمد رسول الله، وقيل: الوفاء بالعهد، والثابت عليه. وإضافتها إلى التقوى لأنها سببها وأساسها، وقيل: كلمة أهل التقوى. { وكانوا أحقَّ بها } أي: متصفين بمزيد استحقاق بها، على أن صيغة التفضيل للزيادة مطلقاً، أو: أحق بها من غيرهم من سائر الأمم { و } كانوا أيضاً { أهلها } المتأهلون لها بتأهيل الله إياهم. قال القشيري: كلمة التقوى هي التوحيد عن قلبٍ صادق، وأن يكون مع الكلمة الاتقاءُ الشرْك، وكانوا أحق بها في سابق حكمه، وقديم علمه، وهذا إلزام إكرام ولطف، لا إلزام إكراهٍ وعنف، وإلزامُ بر، لا إلزام جبر.\nهـ. { وكان الله بكل شيء عليماً } فيجري الأمور على مساقها، فيسوق كلاًّ إلى ما يستحقه. الإشارة: لا يصل العبد إلى مولاه حتى تكون نفسه أرضية، وروحه سماوية، يدور مع الحق أينما دار، ويخضع للحق أينما ظهر، ولأهله أينما ظهروا، لم تبقَ فيه حَميّة ولا أَنفة، بل يكون كالأرض يطأها البار والفاجر، ولا تميز بينهما، وأما مَن فيه حمية الجاهلية، فهو من أهل الخذلان، وأما أهل العناية، فأشار إليهم بقوله: { فأنزل الله سكينته على رسوله } فكان متواضعاً سهلاً ليناً، كما قال تعالى:\n[القلم: 4] وعلى المؤمنين فأخبر عنهم بقوله: { أَشِدَّآءُ عَلَى الكُفَّارِ رُحَمآءُ بَيْنَهُمْ } [الفتح: 29] الآية، و \" ألزمهم كلمة التقوى \" ، \" لا إله إلا الله \" لأنها تهذِّب الأخلاق، وتُخرج ما في القلب من الأمراض والنفاق لأن النفي: تنزيه وتخلية، والإثبات: نور وتحلية، فلا يزال النفي يخرج مِنَ القلب ما فيه هي الظلمة والمساوئ، حتى يتطهّر ويتصف بكمال المحاسن. قال في نوادر الأصول، لمّا تكلم على { وألزمهم كلمة التقوى }: هو \" لا إله إلا الله \" ، وجه تسميتها بذلك: أنه اتقى بها ونفى ما أحدث من الشرك، حميةً للتوحيد وعصبيةً وغيرةً، اقتضاها نورُ التوحيد والمحبة، فنفى القلبُ كلَّ رب ادعى العبادُ ربوبيته، وولِهت قلوبهم إليه، فابتدأ هذا القلب - الذي وصفنا - بالنفي لأرباب الأرض، ثم سَما عالياً حتى انتهى إلى الرب الأعلى، فوقف عنده، وتذلّل وخشع له، واطمأن وولِه إليه. وقال لنبيه:\n[الأعلى: 1] أي: إن هذه أرباب متفرقون، والرب الله الواحد القهار، فهداه إلى الرب الأعلى، وقال:\n[النجم: 42]. ثم قال: ألزم قلوبَهم هذه الكلمة بنور المحبة، كما قال:\n[الحجرات: 7]، فبحلاوة الحب، وزينة البهاء، صارت الكلمة لازمةً لقلوبهم.  وأما قوله: { وكانوا أحق بها وأهلها } فإنما صاروا كذلك لأن الله كان ولا شيء، فخلق المقادير، وخلق الخلق في ظلمة، ثم رشّ عليهم من نوره، فمَن أصابه من ذلك النور اهتدى، ومَن أخطأه ضلّ، فقد علم مَن يخطئه ممن يصيبه. ثم ذكر أحاديث، من ذلك: حديث ابن عمرو:\n \" إن الله خلق خلقه، ثم جعلهم في ظلمة، ثم أخذ من نوره ما شاء، فألقاه عليهم، فأصاب النور مَن شاء أن يُصيبه، وأخطأ مَن شاء أن يخطئه... \" \nالحديث. ثم قال بعد كلام طويل: ثم لمّا نفخ الروح في آدم أخرج نَسَمَ بنيه، أهل اليمين، من كتفه الأيمن في صفاء وتلألؤ، وأصحاب الشمال كالحمَّة سُود من كتفه الأيسر، والسابقون أمام الفريقين، المقربون، وهم الرسل والأنبياء والأولياء، فقرّبهم كلهم، وأخذ عليهم ميثاق على الإقرار بالعبودية، وأشهدهم على أنفسهم، وشهد عليهم بذلك. ثم ردّهم إلى الأصلاب ليخرجهم تناسلاً إلى الأرحام. هـ. وقال الجنيد رضي الله عنه في قوله: { وكانوا أحقَّ بها وأهلَها }: مَن أدركه عناية السبق في الأزل جرى عليه عنوان المواصلة، وهو أحق بها، لِما سبق إليه من كرامة الأزل. هـ. والحاصل: أنهم أحق بها بالسبق بالاصطفائية، وبقيت نعوتها وأنوارها في قلوبهم، دون الذي حجبهم الله عن رؤية نورها. قاله في الحاشية. ثم بشَّرهم بفتح مكة، وصدق الرؤيا التي رآها النبي صلى الله عليه وسلم، فقال: { لَّقَدْ صَدَقَ ٱللَّهُ رَسُولَهُ ٱلرُّءْيَا بِٱلْحَقِّ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "101:11",
      "similarity": 0.5498051443546581
    },
    {
      "verse": "20:129",
      "similarity": 0.5348200378408394
    },
    {
      "verse": "88:4",
      "similarity": 0.5211519424592085
    },
    {
      "verse": "11:28",
      "similarity": 0.4985584681718361
    },
    {
      "verse": "17:13",
      "similarity": 0.42797072643071643
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/048026.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/048026.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/48:26.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}