{
  "chapter": "الفتح",
  "text": "وهو الذى كف ايديهم عنكم وايديكم عنهم ببطن مكة منۢ بعد ان اظفركم عليهم وكان الله بما تعملون بصيرا",
  "translations": [
    {
      "translation": "It is He who held their hands back from you, and your hands from them in the valley of Makka, after giving you the upper hand over them. Allah sees what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was He who restrained their hands from you in the heart of Makkah, and your hands from them, after He had given you victory over them, as God sees all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who restrained their hands from you, and your hands from them in the valley of Makkah, even though He had made you victorious against them. Allah was watching all that you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who kept peace between you and the people of the valley of Mecca after having given you a victory over them. God is Well Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who restrained their hands from you, and your hands from them in the valley of Mecca, after having given you control over them; and Allah sees all what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has withheld their hands from you and your hands from them in the midst of Makkah, after He had made you victors over them. And Allah sees what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who held back their hands from you and your hands from them in the valley of Mecca after He had given you victory over them; and Allah is Seeing what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who restrained their hands from you, and your hands from them, in the hollow of Mecca, after that He made you victors over them. God sees the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who hath withheld men's hands from you, and hath withheld your hands from them, in the valley of Mecca, after He had made you victors over them. Allah is Seer of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who withheld their hands from you, and your hands from them in the valley of Makkah, after giving you victory over them. God sees what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who restrained their hands from you and Your hands from them, in the vale of Makka so, after He had made you superior to them; and Allah is of that which ye work ever a Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who withheld their hands from you, and your hands from them, in the valley of Makkah, after He had given you victory over them, and Allah sees best what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who has restrained their hands from you and your hands from them in the midst of Makka, after that He gave you the victory over them. And Allah sees well all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has withheld their hands from you and your hands from them in the midst of Makkah, after He had made you victors over them. And Allah is Ever the All-Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was He who restrained their hands from you and your hands from them in the hollow (Hudaibiah) of Mecca after He had given you victory over them. Allah sees the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who withheld their hands from you, and your hands from them, in the valley of Mecca, after giving you advantage over them. God is Observer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who withheld their hands from you and your hands from them within [the area of] Makkah after He caused you to overcome them. And ever is Allah of what you do, Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:24] And it is He Who withheld their hands from you, and your hands from them, in the valley of Mecca, at alHudaybiyya, after He had made you victors over them: for eighty of them surrounded your camp in order to inflict losses upon you, but they were captured and taken to the Prophet (s), who pardoned them and set them free, and this resulted in the truce. And God is ever Seer of what you do (read ta‘malūna, or ya‘malūna, ‘they do’), that is to say, He is ever possessed of this attribute.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And He it is Who hath withheld men's hands) the hands of the people of Mecca (from you) from fighting you, (and hath withheld your hands from them) from fighting them, (in the valley of Mecca) in the middle of Mecca except that they threw stones at each other, (after He had made you victors over them) for the Companions of the Prophet (pbuh) overwhelmed with stone throwing until they entered Mecca. (Allah is Seer of what ye do) of throwing stones and other things as well.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف تبدل سنة الله وتغير حكمته مع أنه { هُوَ } القادر المقتدر { ٱلَّذِي كَفَّ } وضع { أَيْدِيَهُمْ } أي: أيدي كفار مكة { عَنكُمْ } حين استيلاءهم عليكم { وَأَيْدِيَكُمْ عَنْهُم } حين غلبتم عليهم { بِبَطْنِ مَكَّةَ مِن بَعْدِ أَنْ أَظْفَرَكُمْ } وأظهركم { عَلَيْهِمْ } وذلك أن عكرمة بن أبي جهل خرج مع خمسمائة إلى الحديبة\n فبعث رسول الله صلى الله عليه وسلم خالد بن الوليد على جند\n فهزمهم حتى أدخلهم حيطان مطة\n ثم قال: { وَ } بالجملة: { كَانَ ٱللَّهُ } العليم الحكيم { بِمَا تَعْمَلُونَ } من خير وشر { بَصِيراً } [الفتح: 24] خبيراً\n لا يعزب عنه شيء مما جرى عليكم\n يجازيكم على مقتضى بصارته وخبرته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:146",
      "similarity": 0.2411029324636478
    },
    {
      "verse": "5:11",
      "similarity": 0.08889231002703352
    },
    {
      "verse": "48:20",
      "similarity": 0.08809468958425432
    },
    {
      "verse": "21:39",
      "similarity": 0.08298528741948626
    },
    {
      "verse": "34:28",
      "similarity": 0.08218068108967483
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/48:24.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/48:24.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/48:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}