{
  "chapter": "الفتح",
  "text": "هو الذى انزل السكينة فى قلوب المؤمنين ليزدادوا۟ ايمنا مع ايمنهم ولله جنود السموت والارض وكان الله عليما حكيما",
  "translations": [
    {
      "translation": "It is He who sent down serenity into the hearts of the muminun thereby increasing their iman with more iman - the legions of the heavens and the earth belong to Allah. Allah is All-Knowing, All-Wise -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sent down the sense of security into the hearts of believers so that their faith may increase with belief, -- God's are the armies of the heavens and the earth; and God is all-knowing and all-wise; --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who bestowed inner peace on the hearts of the believers so that they may grow yet more firm in their faith. To Allah belong the legions of the heavens and the earth; Allah is All-Knowing, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who has given confidence to the hearts of the believers to increase and strengthen their faith. To God belongs the armies of the heavens and the earth. He is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who instilled peace in the hearts of the believers, so that it may increase their strength of conviction; and to Allah only belong the armies of the heavens and the earth; and Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sent down As-Sakinah into the hearts of the believers, that they may grow more in faith along with their faith. And to Allah belong the armies of the heavens and the earth, and Allah is Ever All-Knower, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sent down tranquillity into the hearts of the believers that they might have more of faith added to their faith-- and Allah's are the hosts of the heavens and the earth, and Allah is Knowing, Wise--\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sent down the Shechina (tranquillity) into the hearts of the believers, that they might add faith to their faith -- to God belong the hosts of the heavens and the earth; God is All-knowing, All-wise --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sent down peace of reassurance into the hearts of the believers that they might add faith unto their faith. Allah's are the hosts of the heavens and the earth, and Allah is ever Knower, Wise -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was He who sent down tranquillity into the hearts of the believers, to add faith to their faith -- the forces of the heavens and earth belong to Him; He is all knowing and all wise --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sent down tranquillity into the hearts of the believers that they might increase belief Unto their belief. And Allah's are the hosts of the heavens and the earth and Allah is ever Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sent down composure into the hearts of the faithful that they might enhance in their faith. To Allah belong the hosts of the heavens and the earth, and Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who sent down tranquillity into the hearts of the Believers, that they may add faith to their faith;- for to Allah belong the Forces of the heavens and the earth; and Allah is Full of Knowledge and Wisdom;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sent down As-Sakinah (calmness and tranquillity) into the hearts of the believers, that they may grow more in Faith along with their (present) Faith. And to Allah belong the hosts of the heavens and the earth, and Allah is Ever All-Knower, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was He who sent down tranquility into the hearts of the believers so that they might add belief upon belief. To Allah belong the armies of the heavens and the earth. Allah is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sent down tranquility into the hearts of the believers, to add faith to their faith. To God belong the forces of the heavens and the earth. God is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sent down tranquillity into the hearts of the believers that they would increase in faith along with their [present] faith. And to Allah belong the soldiers of the heavens and the earth, and ever is Allah Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:4] He it is Who sent down the spirit of Peace, [Divine] reassurance, into the hearts of the believers, that they might add faith to their faith, by way of [their embracing of] the legal stipulations of religion: for every time He revealed one [of these], they would believe in it — including the [command to] struggle. And to God belong the hosts of the heavens and the earth, and so if He wanted to bring victory to His religion by means of others, He would have done so. And God is ever Knower, of His creatures, Wise, in His actions, in other words, He is ever possessed of such attributes;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is Who sent down peace of reassurance) tranquillity (into the hearts of the believers) into the hearts of true believers on the day of al-Hudaybiyyah (that they might add faith) that they might add certainty, belief and knowledge (unto their faith) in Allah and His Messenger. (Allah's are the hosts of the heavens) the angels (and the earth) the believers and He sets them on whoever He will among His enemies, (and Allah is ever Knower) of what He has done to you: victory, forgiveness, guidance, help and sending down tranquillity into the hearts of the believers, (Wise) regarding that which He has done with you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا ينصرك ربك؟ { هُوَ ٱلَّذِيۤ أَنزَلَ ٱلسَّكِينَةَ } أي: الطمأنينة والوقار { فِي قُلُوبِ ٱلْمُؤْمِنِينَ } مقتبسين من مشكاة نبوتك نور الولاية اللامعة المتشعشعة من شمس الذات { لِيَزْدَادُوۤاْ إِيمَٰناً } بهدايتك وإرشادك { مَّعَ إِيمَٰنِهِمْ } بأنك على الحق المبين { وَ } كيف لا يزدادون إيماناً يا أكمل الرسل، مع أنك فزت بالفوز العظيم من الوحدة الذاتية وصرت مصوناً محفوظاً في كنف الحق وجواره، منصوراً على عموم أعدائه؛ إذ { لِلَّهِ } وفي حيطة قدرته الغالبة { جُنُودُ ٱلسَّمَٰوَٰتِ } أي: مدبرات الأسماء والصفات { وَ } جنود { ٱلأَرْضِ } أي: قوابل الأركان والطبائع التي هي حوامل آثار العلويات المأثورات منها { وَ } بالجملة: { كَانَ ٱللَّهُ } المطلع لعموم ما في استعدادات عباده وقابليتهم { عَلِيماً } بحوائجهم لدى الحاجة { حَكِيماً } [الفتح: 4] في تدبيرات أمورهم على وفق الحكمة المتقنة والمصالحة المستحكمة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { هو الذي أنزل السكينةَ } أي: السكون والطمأنينة، فعلة، من: السكون، كالبهيتة من البهتان، { في قلوب المؤمنين } حتى لم يتضعضعوا من الشروط التي عقدها صلى الله عليه وسلم مع المشركين، مَن رَدّ مَن أسلم منهم، وعدم ردهم مَن رجع إليهم، ومِن دخول مكة قابلاً بلا سلاح، وغير ذلك مما فعله صلى الله عليه وسلم معهم بالوحي، وما صدر عن عمر رضي الله عنه فلشدة قوته وصلابته، وما زال يعتق ويفعل أموراً كفارة لذلك\n وقيل: { السكينة }: الصبر على ما أمر به الله من الشرائع والثقة بوعد الله، والتعظيم لأمر الله، { ليزدادوا إيماناً مع إِيمانهم } أي: يقيناً إلى يقينهم، أو: إيماناً بالشرائع مع إيمانهم بالعقائد\n وعن ابن عباس رضي الله عنه قال: بعث الله نبيه بشهادة \" ألا إله إلا الله \" فلما صدَّقوه فيها، زادهم الصلاة، فلام صدّقوه، زادهم الزكاة، فلما صدّقوه، زادهم الحج، فلما صدّقوا زادهم الجهاد، ثم أكمل لهم دينهم، فذلك قوله: { ليزدادوا إيماناً مع إيمانهم ولله جنودُ السماوات والأرض } يُدبرها كما يريد، يُسلط بعضها على بعض تارة، ويوقع الصلح بينهما أخرى، حسبنا تقتضيه مشيئته المبنية على الحِكَم والمصالح، { وكان الله عليماً } مبالغاً في العلم بجميع الأمور { حكيماً } في تدبيره وتقديره\n { ليُدخل المؤمنين والمؤمنات } اللام متعلق بما يدل عليه ما ذكر من قوله: { ولله جنود السماوات والأرض } من معنى التصرُّف، أي: دَبّر ما دَبَّر من تسليط المؤمنين، ليعرفوا نعمة الله ويشكروها، فيدخلهم { جناتٍ تجري من تحتها الأنهارُ خالدين فيها ويُكَفِّرَ عنهم سيئاتهم } أي: يُغطّي عنهم مساوئهم، فلا يظهرها لهم ولا لغيرهم\n وتقديم الإدخال على التكفير، مع أن الترتيب في الوجود على العكس للمسارعة إلى بيان ما هو المطلب الأعلى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:26",
      "similarity": 0.6255411322035452
    },
    {
      "verse": "48:7",
      "similarity": 0.616932524358248
    },
    {
      "verse": "36:28",
      "similarity": 0.5788336433718202
    },
    {
      "verse": "37:173",
      "similarity": 0.428169046698547
    },
    {
      "verse": "28:39",
      "similarity": 0.42250204427296395
    }
  ]
}