{
  "chapter": "الفتح",
  "text": "ليدخل المؤمنين والمؤمنت جنت تجرى من تحتها الانهر خلدين فيها ويكفر عنهم سيـاتهم وكان ذلك عند الله فوزا عظيما",
  "translations": [
    {
      "translation": "so that He may admit the men and women of the muminun into Gardens with rivers flowina under them, remaining in them timelessly, for ever, and erase their bad actions from them; and in Allah's sight that is a",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He may admit men and women who believe into gardens with rivers running by, to live for ever there, and absolve their evil, -- This, in the sight of God, will be the great fulfilment --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He did this) to admit the believers, both men and women, to Gardens beneath which rivers flow, wherein they shall abide, and to efface their evil deeds from them. That, in Allah's sight, is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that He would admit the believers (both male and female) to the gardens wherein streams flow, to live therein forever. He will redeem them. This is the greatest triumph in the sight of God,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order to admit the believing men and believing women into Gardens beneath which rivers flow, in which they will abide, and to relieve them of their misdeeds; and this, in Allah’s sight, is the greatest success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may admit the believing men and the believing women to Gardens under which rivers flow to abide therein forever, and He may expiate from them their sins; and that is with Allah supreme success,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may cause the believing men and the believing women to enter gardens beneath which rivers flow to abide therein and remove from them their evil; and that is a grand achievement with Allah\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that He may admit the believers, men and women alike, into gardens underneath which rivers flow, therein to dwell forever, and acquit them of their evil deeds; that is in God's sight a mighty triumph;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may bring the believing men and the believing women into Gardens underneath which rivers flow, wherein they will abide, and may remit from them their evil deeds - That, in the sight of Allah, is the supreme triumph -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and so that He might admit the believers, men and women, into Gardens through which rivers flow, to dwell therein forever, and so that He may remove their evils from them, that is, indeed, a supreme triumph in God's eyes,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath ordained war in order that He may cause the believing men and the believing women enter Gardens whereunder rivers flow, as abiders therein, and that He may expiate from them their misdeeds. And that is with Allah ever an achievement mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may admit the faithful, men and women, into gardens with streams running in them, to remain in them [forever], and that He may absolve them of their misdeeds. That is a great success with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may admit the men and women who believe, to Gardens beneath which rivers flow, to dwell therein for aye, and remove their ills from them;- and that is, in the sight of Allah, the highest achievement (for man),-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may admit the believing men and the believing women to Gardens under which rivers flow (i.e. Paradise), to abide therein forever, and to expiate from them their sins, and that is with Allah, a supreme success,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(From His Wisdom) He admits the believers, both men and women, into Gardens underneath which rivers flow, there to live for ever, and acquit them of their sins that with Allah is a mighty triumph\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will admit the believers, male and female, into Gardens beneath which rivers flow, to abide therein forever, and He will remit their sins. That, with God, is a great triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And] that He may admit the believing men and the believing women to gardens beneath which rivers flow to abide therein eternally and remove from them their misdeeds - and ever is that, in the sight of Allah, a great attainment -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:5]   so that He may admit (li-yudkhila is semantically connected to an omitted clause, that is to say, amara bi’ljihād, ‘He has enjoined the struggle [so that He may admit]’) the believing men and believing women into gardens underneath which rivers flow, wherein they will abide, and that He may absolve them of their misdeeds; for that, in God’s sight, is a supreme triumph;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When the true believers heard of the honour that Allah had bestowed upon His Prophet, they said: \"Congratulations, Messenger of Allah, for what Allah has given you of victory, forgiveness and honour; but what do we have with Allah?\" So Allah said: (That He may bring the believing men) the true believing men (and the believing women) and true believing women (into Gardens beneath which) beneath whose trees, houses and rooms (rivers) of wine, water, honey and milk (flow, wherein they will abide) they will abide in the Garden and will never die or leave it, (and may remit from them their evil deeds) which they committed in the life of the world. (That) which I have mentioned which the believers will have, (in the sight of Allah, is the Supreme Triumph) is the greatest safety: they gain Paradise and avoid the Fire and all that which is in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ومن نكبات التعينات وحرص الإضافات { وَكَانَ ذَلِكَ } الإدخال والإيصال والتكفير { عِندَ ٱللَّهِ } المتعزز برداء العظمة والكبرياء { فَوْزاً عَظِيماً } [الفتح: 5] وأجراً جميلاً\n لا فوز أعظم منه وأعلى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكان ذلك } أي: ما ذكر من الإدخال والتكفير { عند الله فوزاً عظمياً } لا يُقادر قدره لأنه منتهى ما امتدت إليه أعناق الهمم من جلب نفع ودفع ضر\n و \" عند الله \": حال من \" فوزاً عظيماً \" لأنه صفته في الأصل، فلما قُدّم عليه صار حالاً، أي: كائناً عند الله في علمه وقضائه\n والجملة اعتراض مقُرِّرٌ لما قبله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:89",
      "similarity": 0.8216945642450352
    },
    {
      "verse": "4:13",
      "similarity": 0.7506062912307181
    },
    {
      "verse": "85:11",
      "similarity": 0.7402866814244887
    },
    {
      "verse": "5:119",
      "similarity": 0.6741335869001936
    },
    {
      "verse": "57:12",
      "similarity": 0.6694675196772937
    }
  ]
}