{
  "chapter": "الفتح",
  "text": "ويعذب المنفقين والمنفقت والمشركين والمشركت الظانين بالله ظن السوء عليهم دائرة السوء وغضب الله عليهم ولعنهم واعد لهم جهنم وساءت مصيرا",
  "translations": [
    {
      "translation": "And so that He might punish the men and women of the hypocrites and the men and women of the idolaters - those who think bad thoughts about Allah. They will suffer an evil turn of fate. Allah is angry with them, and has cursed them and prepared Hell for them. What an evil destination!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He may punish men and women (who are) hypocrites, and idolaters and idolatresses who entertain evil notions of God: It is against them that the wheel of misfortune will turn, and God will be wroth with them, and condemn them. For them He has prepared Hell, an evil destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He also did this) to chastise the hypocrites, both men and women, and those who associate others in His Divinity, both men and women, and who harbour evil thoughts about Allah. They shall be afflicted with misfortune, Allah is wroth with them. He has laid His curse upon them and has prepared for them Hell. What an evil end!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He would punish the hypocrites and the pagans who have evil suspicions about God. It is they who are surrounded by evil and have become subject to the wrath and condemnation of God. He has prepared for them hell, a terrible place to live.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to punish the hypocrite men and hypocrite women, and the polytheist men and polytheist women, who think evilly about Allah; upon them only is the evil cycle of misfortune; and Allah has wreaked anger upon them, and has cursed them, and has prepared hell for them; and what an evil destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He may punish the hypocrites men and women, and also the idolators men and women, who think evil thoughts about Allah, for them is a disgraceful torment. And the anger of Allah is upon them, and He has cursed them and prepared Hell for them and worst indeed is that destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (that) He may punish the hypocritical men and the hypocritical women, and the polytheistic men and the polytheistic women, the entertainers of evil thoughts about Allah. On them is the evil turn, and Allah is wroth with them and has cursed them and prepared hell for them, and evil is the resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that He may chastise the hypocrites, men and women alike, and the idolaters men and women alike, and those who think evil thoughts of God; against them shall be the evil turn of fortune. God is wroth with them, and has cursed them, and has prepared for them Gehenna -- an evil homecoming!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And may punish the hypocritical men and the hypocritical women, and the idolatrous men and the idolatrous women, who think an evil thought concerning Allah. For them is the evil turn of fortune, and Allah is wroth against them and hath cursed them, and hath made ready for them hell, a hapless journey's end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and so that He might punish hypocritical men and women as well as the polytheists men and women who think evil thoughts about God; an evil turn of fortune will fall upon them, for God has become angry with them, and has rejected them and prepared Hell for them. How evil is such a destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He may chastise the hypocritical men and the hypocritical women and the associaters and the associatresses, the thinkers of evil thought concerning Allah. Unto them shall befell the evil turn of fortune, and Allah shall be wroth with them and shall curse them, and He hath gotten ready for them Hell: an ill destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may punish the hypocrites, men and women, and the polytheists, men and women, who entertain a bad opinion of Allah. For them shall be an adverse turn of fortune: Allah is wrathful with them and He has cursed them, and prepared hell for them and it is an evil destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He may punish the Hypocrites, men and women, and the Polytheists men and women, who imagine an evil opinion of Allah. On them is a round of Evil: the Wrath of Allah is on them: He has cursed them and got Hell ready for them: and evil is it for a destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He may punish the Munafiqun (hypocrites), men and women, and also the Mushrikun men and women, who think evil thoughts about Allah, for them is a disgraceful torment, and the Anger of Allah is upon them, and He has cursed them and prepared Hell for them, and worst indeed is that destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that He might punish the hypocrites and the idolaters, both men and women, and those who think evil thoughts of Allah. An evil turn (of fortune) will befall them. The Wrath of Allah is on them, and He has cursed them and prepared for them Gehenna (Hell), an evil arrival!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He will punish the hypocrites, male and female, and the idolaters, male and female, those who harbor evil thoughts about God. They are surrounded by evil; and God is angry with them, and has cursed them, and has prepared for them Hell—a miserable destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [that] He may punish the hypocrite men and hypocrite women, and the polytheist men and polytheist women - those who assume about Allah an assumption of evil nature. Upon them is a misfortune of evil nature; and Allah has become angry with them and has cursed them and prepared for them Hell, and evil it is as a destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:6] and so that He may chastise the hypocrites, men and women, and the idolaters, men and women, and those who make evil assumptions about God (read al-saw’ or al-sū’, ‘evil’, in all three places); they assumed that He will not assist Muhammad (s) and the believers. For them will be an evil turn of fortune, by way of abasement and chastisement; and God is wroth with them, and He has cursed them, He has banished them [far from His mercy], and has prepared for them Hell — and it is an evil destination!, [an evil] place to return to.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When 'Abdullah Ibn Ubayy Ibn Salul heard of the honour Allah had bestowed upon the believers, he went and said to the Prophet (pbuh): \"0 Messenger of Allah! By Allah, we are just like them, so what do we get?\" Allah said: (And may punish the hypocritical men and the hypocritical women, and the idolatrous men and the idolatrous women, who think an evil thought concerning Allah) that He will not help His Messenger against the hypocrites. (For them is the evil turn of fortune) and an evil consequence, (and Allah is wroth against them and hath cursed them) He banished them from all good, (and hath made ready for them) in the Hereafter (hell, a hapless journey's end) what an evil destination they will head for in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ويعذِّب المنافقين والمنافقات } المبطلين لاستعداداتهم\n المكدّرين لصفائها بأفعالهم وملكاتهم { والمُشْركين والمُشْركات } المردودين المطرودين عن جناب الحق من الأشقياء الذين لا يمكنهم موافقة المؤمنين ظاهراً لما بينهم من التضادّ الحقيقي والتباغض الذاتي الأصلي بحسب الفطرة { الظانين بالله ظنّ السوء } لمكان الشك والارتياب وظلمة نفوسهم بالاحتجاب { عليهم دائرة السوء } بالتعذيب في الدنيا بأنواع الوقائع كالقتل والإماتة والإذلال { وغضبَ الله عليهم } بالقهر والحجب { ولعنهم } بالطرد والإبعاد في الآخرة { وأعدّ لهم } أنواع العذاب { ولله جنود السماوات } كررها ليفيد تغليب الجنود الأرضية على السماوية في المنافقين والمشركين بعكس ما فعل بالمؤمنين\n وبدّل عليماً بقوله: عزيز\n ليفيد معنى القهر والقمع لأن العلم من باب اللطف والعزّة من باب القهر\n { إنّ الذين يُبَايعونك } هذه المبايعة هي نتيجة العهد السابق المأخوذ ميثاقه على العباد في بدء الفطرة وإنما كانت مبايعته مبايعة الله لأن النبي قد يفنى عن وجوده ويحقق الله في ذاته وصفاته وأفعاله فكل ما صدر عنه ونسب إليه فقد صدر عن الله ونسب إليه\n فمبايعته مبايعة الله تعالى\n وإنما قلنا إنها نتيجة ميثاق الفطرة إذ لو لم تكن جنسية ومناسبة أصلية بينهم وبينه لما وجدت هذه البيعة لانتفاء الإلفة والمحبة المقتضية لها بانتفاء الجنسية\n فهي دليل سلامة فطرتهم وبقائها على صفائها الأصلي { يد الله } الظاهرة في مظهر رسوله الذي هو اسمه الأعظم { فَوْق أيديهم } أي: قدرته البارزة في يد الرسول فوق قدرتهم البارزة في صورة أيديهم فيضرّهم عند النكث وينفعهم عند الوفاء { فمن نكث } العهد بتكدير صفاء فطرته والاحتجاب بهيئات نشأته وتغليب ظلمة صفات نفسه على نور قلبه الموجب لمخالفة العهد { فإنما ينكث على نفسه } أي: يعود ضرر نكثه عليه دون غيره لسقوطه عن الفطرة الأصلية واحتجابه في الظلمات البدنية وحرمانه على اللذات الروحانية وتعذّبه بالآلام النفسانية\n وهذا هو النفاق الحقيقي { ومن أوْفى } بالمحافظة على نور فطرته { فسيؤتيه أجراً عظيماً } بأنوار تجليات الصفات ولذات المشاهدات ولهذا سميت هذه البيعة بيعة الرضوان\n إذ الرضا هو فناء الإرادة في إرادته تعالى وهو كمال فناء الصفات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كما يدخل سبحانه المؤمنين والمؤمنات في روضات الجنات تفضلاً وإحساناً { يُعَذِّبَ } أيضاً { ٱلْمُنَافِقِينَ وَٱلْمُنَافِقَاتِ } وهم الذي أخرجوا أعناقهم عن عروة العبودية بمتابعة الأهوية الفاسدة والآراء الباطلة\n وأظهروا الإيمان على طرف اللسان بلا إخلاص وإذعان { وَٱلْمُشْرِكِينَ وَٱلْمُشْرِكَاتِ } وهم الذين جحدوا في الله الواحد الأحد الصمد\n المنزَّه عن الشرك مطلقاً\n وأثبتوا له شركاء ظلماً وزوراً { ٱلظَّآنِّينَ بِٱللَّهِ } المستقل بالألوهية والربوبية { ظَنَّ ٱلسَّوْءِ } وهو أنه لا ينصر أولياءه الباذلين مهجهم في طريق توحيدهم\n بل تدور { عَلَيْهِمْ دَآئِرَةُ ٱلسَّوْءِ } ويحيط بهم وَبَال ما تظنونه على أولياء الله\n كيف { وَغَضِبَ ٱللَّهُ } المطلع على ما في ضمائرهم { عَلَيْهِمْ } بل { وَلَعَنَهُمْ } أي: طردهم عن ساحة عز قبوله { وَأَعَدَّ لَهُمْ جَهَنَّمَ } الطرد والحرمان { وَسَآءَتْ } لهم جهنم { مَصِيراً } [الفتح: 6] أي: مقراً ومنقلباً ومرجعاً ومآباً\n\n{ وَ } كيف لا يلعنهم سبحانه ولا يغضب عليهم مع أنهم يظنون بالله ظن السوء\n ويعتقدونه عاجزاً عن نصر أوليائه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ويُعذِّب المنافقين والمنافقات والمشركين والمشركات } لِما أغاظهم من ذلك وكرهوه\n وهو عطف على \" يدخل \" \n وفي تقديم المنافقين على المشركين ما لا يخفى من الدلالة على أنهم أحق منهم بالعذاب\n { الظانين بالله ظَنَّ السَّوءِ } أي: ظن الأمر السَّوء\n وهو ألا ينصر الله رسولَه والمؤمنين\n ولا يُرجعهم إلى مكة\n فالسَّوء عبارة عن رداءة الشيء وفساده\n يقال: فِعْلُ سَوُءٍ\n أي: مسخوط فاسد\n { عليهم دائرةُ السَّوءِ } أي: ما يظنونه ويتربصونه بالمؤمنين\n وهو دائر عليهم وحائق بهم\n\nوفيه لغتان: فتح السين وضمها\n كالكَره والكُره\n والضَّعف والضَّعف\n غير أن المفتوح غلب عليه أن يُضاف إليه ما يُراد ذمّه من كل شيء\n وأما السُوء فجارٍ مجرى الشيء الذي هو نقيض الخير\n أي: الدائرة التي يذمونها ويسخطونها دائرة عليهم\n ولاحقة بهم\n { وغَضِبَ اللّهُ عليهم ولعنهم وأعدَّ لهم جهنم وساءت مصيراً } لهم\n وهو عطف لما استوجبوه في الآخرة على ما استوجبوه في الدنيا\n وعطفَ \" ولعنهم \" وما بعده بالواو\n مع أن حقهما الفاء المفيدة للسببية إيذاناً باستقلال كل واحد منها بالوعيد\n وأصالته\n من غير استتباع بعضها لبعض",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:93",
      "similarity": 0.44768201363519944
    },
    {
      "verse": "9:68",
      "similarity": 0.3702769582687927
    },
    {
      "verse": "67:6",
      "similarity": 0.3694204682145591
    },
    {
      "verse": "1:7",
      "similarity": 0.32271062710451737
    },
    {
      "verse": "33:64",
      "similarity": 0.3122871004782636
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/048006.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/048006.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/48:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}