{
  "chapter": "الفتح",
  "text": "ولله جنود السموت والارض وكان الله عزيزا حكيما",
  "translations": [
    {
      "translation": "For God's are the armies of the heavens and the earth; and God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belong the legions of the heavens and the earth. Allah is Most Mighty, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belong the armies of the heavens and the earth. God is Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah only belong the armies of the heavens and the earth; and Allah is Most Honourable, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belong the armies of the heavens and the earth. And Allah is Ever All-Powerful, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's are the hosts of the heavens and the earth; and Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belong the hosts of the heavens and the earth; God is All-mighty, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah's are the hosts of the heavens and the earth, and Allah is ever Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The forces of heavens and earth belong to God; He is almighty and all wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's are the hosts of the heavens and the earth, and Allah is ever Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belong the hosts of the heavens and the earth, and Allah is all-mighty, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For to Allah belong the Forces of the heavens and the earth; and Allah is Exalted in Power, Full of Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belong the hosts of the heavens and the earth. And Allah is Ever All-Knower, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belong the armies of the heavens and the earth. Allah is the Almighty and the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belong the troops of the heavens and the earth. God is Mighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belong the soldiers of the heavens and the earth. And ever is Allah Exalted in Might and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:7] And to God belong the hosts of the heavens and the earth; and God is ever Mighty, in His kingdom, Wise, in His actions, in other words, He is ever possessed of such attributes.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah's are the hosts of the heavens) the angels (and the earth) the believers; He gives help to whomever He will, (and Allah is ever Mighty) in retribution against the disbelievers and hypocrites, (Wise) in bestowing honour on true believers because of their faith; and it is also said that this means: Allah is ever Mighty in His 596 dominion and sovereignty, Wise in His command, decree and help of His Prophet against his enemies.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا يلعنهم سبحانه ولا يغضب عليهم مع أنهم يظنون بالله ظن السوء، ويعتقدونه عاجزاً عن نصر أوليائه، مع أنه { لِلَّهِ } وفي حيطة قدرته وتحت تصرفه { جُنُودُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } وله أن يأمرهم ما يشاء، ويغلبهم على من يريد إرادةً واختياراً { وَ } الحال أنه قد { كَانَ ٱللَّهُ } المتوحد بالعظمة والكبرياء { عَزِيزاً } غالباً على عموم مراداته ومقدرواته بلا معاونة إحدٍ ومظاهرته { حَكِيماً } [الفتح: 7] في أفعاله المتقنة، يدبرها بالاستقلال وفق حكمته البالغة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولله جنودُ السماوات والأرض } إعادة لما سبق، وفائدتها: التنبيه على أن لله جنود الرحمة وجنود العذاب، كما ينبئ عنه التعرُّض لوصف العزة في قوله: { وكان اللّهُ عزيزاً } أي: غالباً فلا يُردّ بأسمه { حكيماً } فلا يعترض صنعه\n والله تعالى أعلم\n الإشارة: هو الذي أنزل السكينة في قلوب المتوجهين، حتى سكنوا لصدمات تجلِّي الجلال، وأنوار الجمال، وسكنوا تحت مجاري الأقدار، كيفما برزت، بمرارة أو حلاوة، قال القشيري: والسكينةُ: ما يسكن إليه القلبُ من أنوار الإيمان والإيقان، أو العرفان بمشاهدة العيان، بل الاستغراق في بحر العين بلا أين\n هـ\n ليزدادوا إيماناً مع إيمانهم، فيترقُّوا من مقام الإسلام إلى مقام الإيمان، ومن مقام الإيمان إلى مقام الإحسان، أو من علم اليقين إلى عين اليقين، ومن عين اليقين إلى حق اليقين، أو من المراقبة إلى المشاهدة، أو من رؤية الأسباب إلى مسبب الأسباب\n { ولله جنودُ السماوات والأرض } وهي الجنود التي يمد الله بها الروح في محاربتها للنفس، حتى تغلبها وتستولي عليها، وهي اليقين، العلم، والذكر، والفكر، والواردات الإلهية، التي تأتي من حضرة القهّار، فتدمغ كل ما تُصادمه من الأغيار والأكدار، وكان الله عليماً بمَن يستحق هذه الواردات، حكيماً في ترتيبها وتدبيرها، ليُدخل مَن تأيّد بها جنات المعارف، تجري من تحتها أنهار العلوم والحِكَم، ويغطي عنهم مساوئهم حتى يصلوا إليه، بما منه إليهم، لا بما منهم إليه وهذا هو الفوز العظيم، يفوز صاحبه بالنعيم المقيم، في جوار الكريم\n ويُعذب أهل النفاق المنتقدين على أولياء الله، المتوجهين إليه، الظانين بالله ظن السوء، وهو أن خصوصية التربية انقطعت\n { ولله جنود السماوات والأرض } أي: جنود الحجاب، وهو جند النفس، من الهوى والشيطان، والدنيا والناس، يُسلطها على مَن يشاء من عباده، إن يبقى في ظلمة الحجاب، والله غالب على أمره\n ثم شهد لرسوله بالرسالة، بعد بشارته بالفتح والعصمة، فقال: { إِنَّآ أَرْسَلْنَاكَ شَاهِداً وَمُبَشِّراً وَنَذِيراً }\n\n",
      "translations": []
    }
  ]
}