{
  "chapter": "الفتح",
  "text": "لتؤمنوا۟ بالله ورسوله وتعزروه وتوقروه وتسبحوه بكرة واصيلا",
  "translations": [
    {
      "translation": "so that you might all have iman in Allah and His Messenger and honour Him and respect Him and glorify Him in the morning and the evening.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that (men) may believe in God and His Apostle, and honour Him and revere Him, and sing His praises morning and evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that (all of) you may all believe in Allah and His Messenger, and support him, and revere him, and celebrate Allah's glory, morning and evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that you (people) may believe in God and His Messenger, help, and respect God and glorify Him in the morning and the evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that you, O people, may accept faith in Allah and His Noble Messenger, and honour and revere the Noble Messenger; and may say the Purity of Allah, morning and evening. (To honour the Holy Prophet – peace and blessings be upon him – is part of faith. To disrespect him is blasphemy.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that you (O mankind) may believe in Allah and His Messenger and that you Tu`azziruh and Tuwaqqiruh, and Tusabbihuh Bukrah and Asila.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That you may believe in Allah and His Apostle and may aid him and revere him; and (that) you may declare His glory, morning and evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that you may believe in God and His Messenger and succour Him, and reverence Him, and that you may give Him glory at the dawn and in the evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That ye (mankind) may believe in Allah and His messenger, and may honour Him, and may revere Him, and may glorify Him at early dawn and at the close of day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that you may believe in God and His Messenger, and may help him, and honour him, and so that you may glorify God morning and evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That ye may believe in Allah and His apostle, and may assist Him and honour Him, and may hallow Him at dawn and evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that you may have faith in Allah and His Apostle, and that you may support him and revere him, and that you may glorify Him morning and evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that ye (O men) may believe in Allah and His Messenger, that ye may assist and honour Him, and celebrate His praise morning and evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that you (O mankind) may believe in Allah and His Messenger (SAW), and that you assist and honour him (SAW), and (that you) glorify (Allah's) praises morning and afternoon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that you believe in Allah and His Messenger and that you support him, revere him (Prophet Muhammad), and exalt Him (Allah), at the dawn and in theevening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That you may believe in God and His Messenger, and support Him, and honor Him, and praise Him morning and evening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That you [people] may believe in Allah and His Messenger and honor him and respect the Prophet and exalt Allah morning and afternoon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[48:9] that you may believe (li-tu’minū, may also here be read li-yu’minū, ‘that they may believe’; and similarly read either the second person plural or the third person plural in the next three instances) in God and His Messenger, and that you may support Him (tu‘azzirūhu: a variant reading has tu‘azzizūhu) and revere Him (the [third person suffixed] pronoun [-hu, ‘him’] may refer either to God or to His Messenger) and glorify Him, that is, God, morning and evening.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That ye (mankind) may believe in Allah and His messenger) Muhammad (pbuh) (and may honour Him) defend him with the sword against his enemies, (and may revere Him, and may glorify Him) and pray to Allah (at early dawn and at the close of day) in the morning and evening.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَتُعَزِّرُوهُ وَتُوَقِّرُوهُ } معناه تُعظموهُ وتُسودوهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And honor him and make him great} means exalting him and making him great.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكل ذلك { لِّتُؤْمِنُواْ بِٱللَّهِ } وتذعنوا بتوحيده { وَرَسُولِهِ } أي: تصدقوا برسوله الذي أرسل إليهم من عنده سبحانه { وَ } بعد اتصافهم بكمال الإيمان والإذعان { تُعَزِّرُوهُ } سبحانه\n أي: تعتقدوا أن الحول والقوة بالله جميعاً\n لا حول ولا قوة لسواه مطلقاً { وَ } بعدما اعتقدتم كذلكَ { تُوَقِّرُوهُ } وتعظموه حق تعظيمه { وَ } بعدما وقرتموه وعظمتموه كما ينبغي ويليق بشأنه { تُسَبِّحُوهُ } وتنزهوه عما لا يليق بجنابه { بُكْرَةً وَأَصِيلاً } [الفتح: 9] أي: في عموم أوقاتهم وحالاتهم\n إذ لا يتأتى منهم بالنسبة إلى جنابه سبحانه إلا التفويض والتعظيم والتنزيه والتقديس\n وإلا فما للعباد ورب الأرباب أن يتكلموا عن ذاته وصفاته\n سوى أن يخوضوا في لجة بحر توحيده\n ويتيهوا في بيداء ألوهيته حتى يفنوا في فضاء صمديته\n إذ لا إله إلا هو ولا شيء سواه\n[القصص: 88]",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لتؤمنوا بالله ورسوله } والخطاب للرسول والأمة\n { وتُعزِّروه } تقوُّوه بنصر دينه\n { وتُوقِّروه } أي: تُعظِّموه بتعظيم رسوله وسائر حرماته\n { وتُسبِّحوه } تُنزِّهوه\n أو تُصلوا له\n من: السبحة\n { بكرةً وأصيلاً } غدوة وعشية\n قيل: غدوة: صلاة الفجر\n وعشية: الظهر والعصر والمغرب والعشاء\n والضمائر لله تعالى\n ومَن فرّق فجعل الأولين للنبي صلى الله عليه وسلم والأخير لله تعالى\n فقد أبعد\n وقرأ المكي والبصري بالغيب في الأربعة\n والضمائر للناس\n وقرأ ابن السميفع: \" وتُعززوه \" بزاءين\n أي: تنصروه وتُعِزُّوا دينه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:42",
      "similarity": 0.4645843440563446
    },
    {
      "verse": "76:25",
      "similarity": 0.43915056476099235
    },
    {
      "verse": "5:12",
      "similarity": 0.38045449543052823
    },
    {
      "verse": "25:5",
      "similarity": 0.3613083511632626
    },
    {
      "verse": "7:157",
      "similarity": 0.35551878148161514
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/48:9.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/48:9.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/48:9.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}