{
  "chapter": "الحجرات",
  "text": "يايها الناس انا خلقنكم من ذكر وانثى وجعلنكم شعوبا وقبائل لتعارفوا۟ ان اكرمكم عند الله اتقىكم ان الله عليم خبير",
  "translations": [
    {
      "translation": "Mankind! We created you from a male and female, and made you into peoples and tribes so that you is All-Knowing, All-Aware.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, We created you from a male and female, and formed you into nations and tribes that you may recognise each other. He who has more integrity has indeed greater honour with God. Surely God is all-knowing and well-informed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Human beings, We created you all from a male and a female, and made you into nations and tribes so that you may know one another. Verily the noblest of you in the sight of Allah is the most God-fearing of you. Surely Allah is All-Knowing, All-Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, We have created you all male and female and have made you nations and tribes so that you would recognize each other. The most honorable among you in the sight of God is the most pious of you. God is All-knowing and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! We have indeed created you from one man and one woman, and have made you into various nations and tribes so that you may know one another; indeed the more honourable among you, in the sight of Allah, is one who is more pious among you; indeed Allah is All Knowing, All Aware. (Piety is the basis of honour in Allah’s sight.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! We have created you from a male and a female, and made you into nations and tribes that you may know one another. Verily, the most honorable of you with Allah is that (believer) who has At-Taqwa. Verily, Allah is All-Knowing, All-Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you men! surely We have created you of a male and a female, and made you tribes and families that you may know each other; surely the most honorable of you with Allah is the one among you most careful (of his duty); surely Allah is Knowing, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, We have created you male and female, and appointed you races and tribes, that you may know one another. Surely the noblest among you in the sight of God is the most godfearing of you. God is All-knowing, All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Lo! We have created you male and female, and have made you nations and tribes that ye may know one another. Lo! the noblest of you, in the sight of Allah, is the best in conduct. Lo! Allah is Knower, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind! We have created you from a male and female, and made you into peoples and tribes, so that you might come to know each other. The noblest of you in God's sight is the one who fears God most. God is all knowing and all-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Humankind verily We! We have created you Of a male and female, and We have made you nations and tribes that ye might know one another. Verily the noblest of you with Allah is the most God-fearing of you; verily Allah is Knowing, Aware,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Indeed, We created you from a male and a female, and made you nations and tribes that you may identify yourselves with one another. Indeed the noblest of you in the sight of Allah is the most Godwary among you. Indeed Allah is all-knowing, all-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! We created you from a single (pair) of a male and a female, and made you into nations and tribes, that ye may know each other (not that ye may despise (each other). Verily the most honoured of you in the sight of Allah is (he who is) the most righteous of you. And Allah has full knowledge and is well acquainted (with all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! We have created you from a male and a female, and made you into nations and tribes, that you may know one another. Verily, the most honourable of you with Allah is that (believer) who has At-Taqwa [i.e. one of the Muttaqun (pious - see V. 2:2). Verily, Allah is All-Knowing, All-Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, We have created you from a male and a female, and made you into nations and tribes that you might know one another. The noblest of you before Allah is the most righteous of you. Allah is the Knower, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! We created you from a male and a female, and made you races and tribes, that you may know one another. The best among you in the sight of God is the most righteous. God is All-Knowing, Well-Experienced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, indeed We have created you from male and female and made you peoples and tribes that you may know one another. Indeed, the most noble of you in the sight of Allah is the most righteous of you. Indeed, Allah is Knowing and Acquainted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[49:13] O mankind! We have indeed created you from a male and a female, [from] Adam and Eve, and made you nations (shu‘ūb is the plural of sha‘b, which is the broadest category of lineage) and tribes (qabā’il, which are smaller than nations, and are followed by ‘amā’ir, ‘tribal districts’, then butūn, ‘tribal sub-districts’, then afkhādh, ‘sub-tribes’, and finally fasā’il, ‘clans’; for example Khuzayma is the sha‘b, while Kināna is the qabīla, Quraysh is the ‘imāra, Qusayy is the batn, Hāshim is the fakhdh, and ‘Abbās is the fasīla) that you may come to know one another (ta‘ārafū: one of the two tā’ letters [of tata‘ārafū] has been omitted), that you may acquire knowledge of [the customs of] one another and not to boast to one another of [whose is the more] noble lineage, for pride lies only in [the extent to which you have] fear of God. Truly the noblest of you in the sight of God is the most God-fearing among you. Truly God is Knower, of you, Aware, of your inner thoughts.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 mankind!) This was revealed about Thabit Ibn Qays Ibn Shammas who said to a man: \"You are the son of so-and-so\" in reference to his mother; and it is also said that it was revealed about Bilal the muezzin of the Prophet (pbuh). When Bilal gave the call to prayer in Mecca after its conquest, a group of men from Quraysh, among whom were Sahl Ibn 'Amr, al-Harth Ibn Hisham and Abu Sufyan Ibn Harb, said: \"Did Allah and His Messenger not find anyone to call to prayer except this raven\". In response, Allah said: (Lo! We have created you male and female) from Adam and Eve, (and have made you nations and tribes that ye may know one another. Lo! the noblest of you) in the Hereafter, (in the sight of Allah) on the Day of Judgement, (is the best in conduct) in the life of the world; which in this case is Bilal. (Lo! Allah is Knower) of your status and lineage, (Aware) of your works and standing in His sight.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجَعَلْنَاكُمْ شُعُوباً وَقَبَآئِلَ } قال الإِمامُ زيد بن علي عليهما السَّلامُ: فالشُّعوبُ أَكبرُ القَبائِلِ\n\n\n\n\nوقوله تعالى: { لِتَعَارَفُوۤاْ } معناه لِتَعلمُوا\n\n",
      "translations": [
        {
          "translation": "\nAnd the saying of the Most High: {And We have made you into peoples and tribes} Imam Zaid ibn Ali, peace be upon them, said: \"The peoples are the largest of the tribes.\"\n\n\nAnd His saying, \"Get to know one another,\" means that you should learn about one another.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nقوله: { إنّ أكرمكم عند الله أتقاكم } معناه: لا كرامة بالنسب لتساوي الكل في البشرية المنتسبة إلى ذكر وأنثى والامتياز بالشعوب والقبائل إنما يكون لأجل التعارف بالانتساب لا للتفاخر فإنه من الرذائل\n و الكرامة لا تكون إلا بالاجتناب عن الرذائل الذي هو أصل التقوى\n ثم كلما كانت التقوى أزيد رتبة كان صاحبها أكرم عند الله وأجلّ قدراً\n فالمتقي عن المناهي الشرعية التي هي الذنوب في عرف ظاهر الشرع أكرم من الفاجر وعن الرذائل الخلقية كالجهل والبخل والشره والحرص والجبن أكرم من المجتنب عن المعاصي الموصوف بها وعن نسبة التأثير والفعل إلى الغير بالتوكل\n ومشاهدة أفعال الحق أكرم من الفاضل المتدرب بالفضائل الخلقية المعتدّ بتأثير الغير\n المحجوب برؤية أفعال الحق عن تجليات أفعال الحق وعن الحجب الصفاتية بالانسلاخ عنها في مقام الرضا ومحو الصفات أكرم من المتوكل في مقام توحيد الأفعال المحجوب بالصفات عن تجليات صفات الحق وعن وجوده المخصوص أي: أنيته التي هي أصل الذنوب بالفناء أكرم الجميع { إنّ الله عليم } بمراتب تقواكم { خبير } بتفاضلكم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { يٰأَيُّهَا ٱلنَّاسُ } الناسون للمنشأ الأصلي والفطرة الجبلية { إِنَّا خَلَقْنَاكُم } أي: أوجدناك وأخرجناكم جميعاً { مِّن ذَكَرٍ } هو: آدم المصور بصورتنا اللاهوتية\n المجبول على خلافتنا { وَأُنْثَىٰ } هي: حواء المتشعبة من آدم باعتبار ناسوته { وَ } بعدما صيراناهما زوجين ممتزجين\n مزودين من حصة اللاهوت والناسوت { جَعَلْنَاكُمْ شُعُوباً } متكثرة من أصل واحد هو آدم { وَقَبَآئِلَ } مختلفة متجزئة من تلك الشعوب\n\n\nالشعب: هي الجمع المتكثر المنشعب عن أصل واحد\n\n\nوالقبيلة: هي الفرق المخلتفة الحاصلة من الشعب\n\n\nوالعمارة: هي الطائفة المتفرعة من القبيلة\n\n\nوالبطم: الجمع المتفرع على العمارة\n\n\nوالفخذ: جمع متفرع على البطن\n\n\nوالفصيل: على الفخذ\n\n\nفخزيمة مثلاً شعب\n وكنانة قبيلة\n وقريش عمارة\n وقصي بطن\n وهاشم فخذ\n وعباس فصيل\n\n\nوإنما جعلناكم كذلك { لِتَعَارَفُوۤاْ } أي: يعرف بعضكم بعضاً\n وأدى تعارفكم إلى التلاحق في المنشأ لا للتفاخر والتغالب\n إذ لا تفاخر بينكم إلا بالكرامة والنجابة المترتبة على حقية اللاهوت\n وبالجملة: { إِنَّ أَكْرَمَكُمْ عَندَ ٱللَّهِ أَتْقَاكُمْ } عن لوازم الناسوت وشواغل الهيولي { إِنَّ ٱللَّهَ } المطلع على استعدادات عباده { عَلِيمٌ خَبِيرٌ } [الحجرات: 13] بما في ظواهرهم وبواطنهم\n يوفقهم على مقتضى علمه وخبرته\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { يا أيها الناس إِنَّا خلقناكم من ذَكَرٍ وأُنثى } آدم وحوّاء، أو: كل واحد منكم من أبٍ وأم، فما منكم من أحد إلا وهو يُدلي بما يُدلي به الآخر، سواء بسواء، فلا معنى للتفاخر والتفاضل بالنسب. وفي الحديث:\n \" لا فضل لعربي على عجمي، ولا لعجمي على عربي، ولا لأحمر على أسود، ولا لأسود على أحمر إلا بالتقى \" \nوقال أيضاً:\n \" ثلاثة من أمر الجاهلية: الفخر بالأحساب، والطعن في الأنساب، والدعاء بدعاء الجاهلية \" \nأو كما قال صلى الله عليه وسلم. { وجعلناكم شعوباً وقبائلَ } الشعوب: رؤوس القبائل، مثل ربيعة ومضر، والأوس والخزرج،واحدها: شَعب - بفتح الشين - سُمُّوا بذلك لتشعُّبهم كتشعُّب أغصان الشجرة، والقبائل: دون الشعوب، واحدها: قبيلة، كبَكر من ربيعة، وتميم من مضر. ودون القبائل: العمائر، جمع عَمارة بفتح العين، وهم كشيبان من بكر، ودارم من تميم، ودون العمائر: البطون، واحدها: بطن، وهي كبني غالب ولؤي من قريش، ودون البطون: الأفخاذ، واحدها: فَخْذ، كهاشم وأمية من بني لؤي، ثم الفصائل والعشائر، واحدها: فصيلة وعشيرة، فالشعب تجمع القبائل، والقبيلة تجمع العمائر، والعَمارة تجمع البطون، والبطن يجمع الأفخاذ، والفخذ يجمع الفصائل. وقيل: الشعوب من العجم، والقبائل من العرب، والأسباط من بني إسرائيل. { لِتَعارفوا } أي: إنما جعلناكم كذلك ليعرف بعضُكم نسبَ بعض، فلا يتعدّى إلى غير آبائه، لا لتتفاخروا بالأجداد والأنساب. ثم ذكر الخصلة التي يفضل بها الإنسان، ويكتسب الشرفَ والكرمَ عند الله، فقال: { إِنَّ أكرمكم عند الله أتقاكم } أي: لا أنسبكم، فإنَّ مدار كمال النفوس وتفاوت الأشخاص هو التقوى، فمَن رام نيل الدرجات العلا فعليه بالتقوى، قال صلى الله عليه وسلم:\n \" مَن سَرّه أن يكون أكرم الناس فليتقِ الله \" \nورُوي أنه صلى الله عليه وسلم طاف يوم فتح مكة، ثم حمد الله، وأثنى عليه، وقال:\n \" الحمد لله الذي أذهب عُبِّيَّةَ الجاهلية وتكبُّرها يا أيها الناس إنما الناس رجلان: رجل مؤمن تَقيّ كريمٌ على الله، ورجل فاجر شقي هَيِّن على الله \" \nثم قرأ الآية. وعن ابن عباس رضي الله عنهما: كرم الدنيا الغنى، وكرم الآخرة التقى. وقال قتادة: أكرم الكرم التقى، والأمُ اللؤم الفجور، وسُئل عليه السلام عن خير الناس؟ فقال:\n \" آمرُكم بالمعروف، وأنهاكم عن المنكر، وأوصلكم للرحم \" \nوقال عمر رضي الله عنه: \" كرم الرجل: دينه وتقواه، وأصله: عقله، ومروءته: خُلقه، وحَسَبُه: ماله \". وعن يزيد بن شَجَرَةَ: مرّ رسولُ الله صلى الله عليه وسلم في سوق المدينة، فرأى غلاماً أسود، قائماً يُنادَى عليه مَن يزيد في ثمنه، وكان الغلام يقول: مَن اشتراني فعلى شرط ألاَّ يمنعني من الصلوات الخمس خلف رسول الله صلى الله عليه وسلم، فاشتراه بعضهم، فعادَه رسولُ الله صلى الله عليه وسلم، ثم تُوفي، فتولى رسولُ الله صلى الله عليه وسلم غُسله وتكفينَه ودفنَه، فقالت المهاجرون: هاجرنا ديارنا وأموالنا وأهلينا، فما نرى أحداً منا لقي في حياته ولا موته ما لقي هذا الغلام، وقالت الأنصار: آويناه ونصرناه وواسيناه بأموالنا، فآثر علينا عبداً حبشيّاً، فنزلت.\nوقال صلى الله عليه وسلم:\n \" إنَّ الله لا ينظر إلى صُوركم، ولا إلى أموالكم، ولكن ينظر إلى قلوبكم وأعمالكم، وإنما أنتم بنو آدم، أكرمكم عند الله أتقاكم، وأنتم تقولون: فلان ابن فلان، وأنا اليوم أرفَع نسبي وأضع أنسابكم، أين المتقون \" \nوقيل: يا رسول الله، مَن أكرمُ الناس؟ قال:\n \" أتقاهم \" \nهـ. وأنشدوا:\n{ إِنّ الله عليمٌ خبير } عليم بكرم القلوب وتقواها، خيبر بهمم النفوس في هواها. الإشارة: كان سيدنا عليّ رضي الله عنه يقول:\n \" ما لابن آدم والفخر، أوله نُطفة مذرة، وآخره جيفة قذرة، وفيما بينهما يحمل العذرة \" \nوكان يُنشد:\nوقوله: ما لفخر إلا لأهل العلم... الخ، يعني: لو كان الفخر مباحاً ما أُبيح إلاّ لهم، وإلا فهم أولى بالتواضع، اقتداء برسول الله صلى الله عليه وسلم، وقد قال:\n \" مَن تواضع دون قدرِه رفعه الله فوق قدره \" \nفما رفع اللّهُ قدر العلماء إلا بتواضعهم حتى ينالهم الشريفُ والوضيع، الصغيرُ والكبير، والقوي والضعيف، فمَن لم يكن هكذا فليس بعالِم لنّ الخشية تحمل على التواضع، ومَن لم يخشَ فليس لعالم حقيقة. قال تعالى:\n[فاطر: 28]. وقوله تعالى: { إِنَّ أكرمكم عند الله أتقاكم } اعلم أنَّ نصيب كل عبد من الله تعالى على قدر تقواه، وتقواه على قدر توجهه إلى الله، وتوجهه على قدر تفرُّغه من الشواغل، وتفرُّغه على قدر زهده، وزهده، على قدر محبته، ومحبته على قدر علمه بالله، وعلمه على قدر يقينه، ويقينه على قدر كشف الحجاب عنه، وكشف الحجاب على قدر جذب العناية، وجذب العناية على قدر السابقة، وهي سر القدر الذي لم يُكشف في هذه الدار. وسقوط العبد من عين الله على قدر قلة تقواه، وقلة تقواه على قدر ضعف توجهه، وضعف توجهه على قدر تشعُّب همومه، وتشعُّب همومه على قدر حرصه ورغبته في الدنيا، ورغبته في الدنيا على قدر ضعف محبته في الله، وضعف محبته على قدر جهله به، وجهله على قدر ضعف يقينه، وضعف اليقين من كثافة الحجاب، وكثافة الحجاب من عدم جذب العناية، وعدم جذب العناية من علامة الخذلان السابق، الذي هو سر القدر. والله تعالى أعلم. ثم إنَّ أساس التقوى: الإيمان الصادق دون الكاذب، الذي أشار إليه بقوله: { قَالَتِ ٱلأَعْرَابُ آمَنَّا قُل لَّمْ تُؤْمِنُواْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:30",
      "similarity": 0.7952717229588888
    },
    {
      "verse": "92:3",
      "similarity": 0.13884967752130578
    },
    {
      "verse": "53:45",
      "similarity": 0.1359433298699652
    },
    {
      "verse": "75:39",
      "similarity": 0.1334580127408396
    },
    {
      "verse": "42:49",
      "similarity": 0.13118436962031466
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/49:13.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/49:13.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/49:13.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}