{
  "chapter": "الحجرات",
  "text": "يايها الذين ءامنوا۟ لا تقدموا۟ بين يدى الله ورسوله واتقوا۟ الله ان الله سميع عليم",
  "translations": [
    {
      "translation": "You who have iman! do not put yourselves forward in front of Allah and of His Messenger; and have taqwa of Allah. Allah is All-Hearing, All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O YOU WHO believe, do not forestall the judgements of God and His Apostle, and have fear of God. Verily God hears all and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not advance before Allah and His Messenger, and fear Allah. Verily Allah is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not be presumptuous with the Messenger of God (in your deeds and in your words). Have fear of God; He is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not advance ahead of Allah and His Noble Messenger, and fear Allah; indeed Allah is All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Make not (a decision) in advance before Allah and His Messenger, and have Taqwa of Allah. Verily, Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! be not forward in the presence of Allah and His Apostle, and be careful of (your duty to) Allah; surely Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, advance not before God and His Messenger; and fear God. God is All-hearing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Be not forward in the presence of Allah and His messenger, and keep your duty to Allah. Lo! Allah is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not push yourselves forward in the presence of God and His Messenger. Fear God -- God hears all and knows all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! be not forward in the presence of Allah and His apostle, and fear Allah; verily Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not venture ahead of Allah and His Apostle, and be wary of Allah. Indeed Allah is all-hearing, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! Put not yourselves forward before Allah and His Messenger; but fear Allah: for Allah is He Who hears and knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not put (yourselves) forward before Allah and His Messenger (SAW), and fear Allah. Verily! Allah is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers do not advance before Allah and His Messenger. Fear Allah. Allah is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not place your opinions above that of God and His Messenger, and fear God. God is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not put [yourselves] before Allah and His Messenger but fear Allah. Indeed, Allah is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[49:1] O you who believe, do not venture ahead of (tuqaddimū, [derives] from qaddama, with the sense of [the 5th form] taqaddama), that is to say, do not come forward with any [unwarranted] saying or deed [ahead of], God and His Messenger, the one communicating [the Message] from Him, that is to say, without their permission, and fear God. Surely God is Hearer, of your sayings, Knower, of your deeds: this was revealed regarding the dispute between Abū Bakr and ‘Umar, may God be pleased with them both, in the presence of the Prophet (s), over the appointment of al-Aqra‘ b. Hābis or al-Qa‘qā‘ b. Ma‘bad as commander [of his tribe].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا أَيُّهَا الَّذِينَ آَمَنُوا لَا تُقَدِّمُوا بَيْنَ يَدَيِ اللَّهِ وَرَسُولِهِ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ (1(الافتتاح بنداء المؤمنين للتنبيه على أهمية ما يرد بعد ذلك النداء لتترقبه أسماعهم بشوق . ووَصْفُهم ب { الذين آمنوا } جار مجرى اللقب لهم مع ما يؤذِن به أصله من أهليتهم لتلقي هذا النهي بالامتثال .وقد تقدم عند الكلام على أغراض السورة أن الفخر ذكر أن الله أرشد المؤمنين إلى مكارم الأخلاق ، وهي إما في جانب الله أو جانب رسوله صلى الله عليه وسلم أو بجانب الفساق أو بجانب المؤمن الحاضر أو بجانب المؤمن الغائب ، فهذه خمسة أقسام ، فذكر الله في هذه السورة خمس مرات { يا أيها الذين آمنوا } فأرشد في كل مرة إلى مكرمة مع قسم من الأقسام الخمسة إلخ ، فهذا النداء الأول اندرج فيه واجب الأدب مع الله ورسوله صلى الله عليه وسلم تعرض الغفلة عنها . رضي الله عنوالتقدم حقيقته : المشي قبل الغير ، وفعله المجرد : قَدُم من باب نصر قال تعالى : { يَقْدُم قومه يوم القيامة } \\[ هود : 98 \\] . وحق قدم بالتضعيف أن يصير متعدياً إلى مفعولين لكن ذلك لم يرد وإنما يعدّى إلى المفعول الثاني بحرف على .ويقال : قدَّم بمعنى تَقدم كأنه قدّم نفسه ، فهو مضاعف صار غير متعد . فمعنى { لا تقدموا } لا تتقدموا .ففعل { لا تقدموا } مضارع قَدَّم القاصر بمعنى تقدم على غيره وليس لهذا الفعل مفعول ، ومنه اشتقت مقدمة الجيش للجماعة المتقدمة منه وهي ضد الساقة . ومنه سميت مقدمةَ الكتاب الطائفةُ منه المتقدمة على الكتاب . ومادة فَعَّل تجيء بمعنى تفعّل مثل وجّه بمعنى توجّه وبَيَّن بمعنى تبيّن ، ومن أمثالهم بَيّن الصبح لذي عينين .والتركيب تمثيل بتشبيه حال من يفعل فعلاً دون إذن مِن الله ورسوله صلى الله عليه وسلم بحال من يتقدم مُماشِيَه في مَشيه ويتركه خلفه . ووجه الشبه الانفراد عنه في الطريق . والنهي هنا للتحذير إذ لم يسبق صدور فعل من أحد افتياتا على الشرع .ويستروح من هذا أن هذا التقدم المنهي عنه هو ما كان في حالة إمكان الترقب والتمكن من انتظار ما يبرمه الرسول صلى الله عليه وسلم بأمر الله فيومىء إلى أن إبرام الأمر في غيبة الرسول صلى الله عليه وسلم لا حرج فيه .وهذه الآية تؤيد قول الفقهاء : إن المكلف لا يقدِم على فعل حتى يعلم حكم الله فيه . وعدّ الغزالي العلمَ بحكم ما يُقدم عليه المكلف من قسم العلوم التي هي فرض على الأعيان الذين تعرض لهم . والمقصود من الآية النهي عن إبرام شيء دون إذن من رسول الله صلى الله عليه وسلم فذكر قبله اسم الله للتنبيه على أن مراد الله إنما يعرف من قبل الرسول صلى الله عليه وسلم وقد حصل من قوله : { لا تقدموا } الخ معنى اتبعوا الله ورسوله .وسبب نزول هذه الآية ما رواه البخاري في «صحيحه» في قصة وفد بني تميم بسنده إلى ابن الزبير قال «قدم ركب من بني تميم على النبي صلى الله عليه وسلم فقال أبو بكر : أمَّرْ عليهم القعقاع بن معبد بن زُرارة . وقال عُمر : بل أمِّر الأقرعَ بن حابس . قال أبو بكر : ما أردت إلاّ خلافي أو إلَى خلافي قال عمر : ما أردت خِلافك أو إلى خلافك فتماريا حتى ارتفعت أصواتهما في ذلك فنزل { يا أيها الذين آمنوا لا تقدموا بين يدي الله ورسوله واتقوا الله إن الله سميع عليم يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي ولا تجهروا له بالقول كجهر بعضكم لبعض أن تحبط أعمالكم وأنتم لا تشعرون } \\[ الحجرات : 1 ، 2 \\] .فهذه الآية توطئة للنهي عن رفع الأصوات عند رسول الله صلى الله عليه وسلم والجهرِ له بالقول وندائه من وراء الحجرات . وعن الضحاك عن ابن عباس أنها نزلت بسبب بَعث رسول الله صلى الله عليه وسلم سَرية فقتلتْ بنُو عامر رجالَ السرية إلا ثلاثة نَفرٍ نَجَوا فلقُوا رجلين من بين سُليم فسألوهما عن نسبتهما فاعتزيا إلى بني عامر ظنّاً منهما أن هذا الاعتزاء أنجى لهما من شر توقعاه لأن بني عامر أعزُّ من بني سليم ، فقتلوا النفر الثلاثة وسلبوهما ثم أتوا رسول الله صلى الله عليه وسلم فأخبروه فقال : \" بئسما صنعتم كانَا من بني سليم ، والسلَب ما كَسَوْتُهما \" أي عرف ذلك لما رأى السلب فعَرَفه بأنه كساهما إياه وكانت تلك الكسوة علامة على الإسلام لئلا يتعرض لهم المسلمون فوادهما رسول الله صلى الله عليه وسلم ونزلت { يا أيها الذين آمنوا لا تقدموا } الآية ، أي لا تعملوا شيئاً من تلقاء أنفسكم في التصرف من الأمة إلا بعد أن تستأمروا رسول الله صلى الله عليه وسلم وعلى هذه الرواية تكون القصة جرت قبيل قصة بني تميم فقرنت آيتاهما في النزول . وهنالك روايات أخرى في سبب نزولها لا تناسب موقع الآية مع الآيات المتصلة بها . وأيَّا مَّا كان سبب نزولها فهي عامة في النهي عن جميع أحوال التقدم المراد .وجعلت هذه الآية في صدر السورة مقدَّمة على توبيخ وفد بني تميم حين نادوا النبي صلى الله عليه وسلم من وراء الحجرات لأن ما صدر من بني تميم هو من قبيل رفع الصوت عند النبي صلى الله عليه وسلم ولأن مماراة أبي بكر وعمرَ وارتفاع أصواتهما كانت في قضية بني تميم فكانت هذه الآية تمهيداً لقوله : { يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي الآية ، لأن من خصه الله بهذه الحظوة ، أي جعل إبرام العمل بدون أمره كإبرامه بدون أمر الله حقيق بالتهيب والإجلال أن يخفض الصوت لديه .وإنما قدم هذا على توبيخ الذين نادوا النبي لأن هذا أولى بالاعتناء إذ هو تأديب من هو أولى بالتهذيب .وقرأه الجمهور تقدموا } بضم الفوقية وكسر الدال مشددة . وقرأه يعقوب بفتحهما على أن أصله : لا تتقدموا . وقال فخر الدين عند الكلام على قوله تعالى : { يا أيها الذين آمنوا إن جاءكم فاسق بنَبإ فتبيّنوا } \\[ الحجرات : 6 \\] في هذه السورة : إن فيها إرشاد المؤمنين إلى مكارم الأخلاق وهي : إما مع الله أو مع رسوله صلى الله عليه وسلم أو مع غيرهما من أبناء الجنس وهم على صنفين لأنهم : إما أن يكونوا على طريقة المؤمنين من الطاعة ، وإمّا أن يكونوا خارجين عنها بالفسق؛ والداخل في طريقتهم : إما حاضر عندهم ، أو غائب عنهم ، فذكر الله في هذه السورة خمس مرات { يا أيها الذين آمنوا } وأرشد بعد كل مرة إلى مكرمة من قسم من الأقسام الخمسة .فقال أولاً : { يا أيها الذين آمنوا لا تقدموا بي يدي اللَّه ورسوله } وهي تشمل طاعة الله تعالى ، وذُكر الرسول معه للإشارة إلى أن طاعة الله لا تعلم إلا بقول الرسول فهذه طاعة للرسول تابعة لطاعة الله . وقال ثانياً : { يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي } \\[ الحجرات : 2 \\] لبيان الأدب مع النبي صلى الله عليه وسلم لذاته في باب حسن المعاملة . وقال ثالثاً : { يا أيها الذين آمنوا إن جاءكم فاسق بنبإ } الآية للتنبيه على طريقة سلوك المؤمنين في معاملة من يعرف بالخروج عن طريقتهم وهي طريقة الاحتراز منه لأن عمله إفساد في جماعتهم ، وأعقبه بآية { وإن طائفتان من المؤمنين اقتتلوا } \\[ الحجرات : 9 \\] . وقال رابعاً { يا أيها الذين آمنوا لا يسخر قوم من قوم } \\[ الحجرات : 11 \\] إلى قوله : { فأولئك هم الظالمون } \\[ البقرة : 229 \\] فنهى عما يكثر عدم الاحتفاظ فيه من المعاملات اللسانية التي قلّما يقام لها وزن . وقال خامساً : { يا أيها الذين آمنوا اجتنبوا كثيراً من الظن إلى قوله : تواب رحيم } \\[ الحجرات : 12 \\] اه .ويريد : أن الله ذكر مثالاً من كل صنف من أصناف مكارم الأخلاق بحسب ما اقتضته المناسبات في هذه السورة بعد الابتداء بما نزلت السورة لأجله ابتداء ليكون كل مثال منها دالاً على بقية نوعه ومرشداً إلى حكم أمثاله دون كلفة ولا سآمة . وقد سلك القرآن لإقامة أهم حُسن المعاملة طريقَ النهي عن أضدادها من سوء المعاملة لأن درء المفسدة مقدم في النظر العقلي على جلب المصلحة .وعَطْف { واتقوا اللَّه } تكملة للنهي عن التقدم بين يدي الرسول صلى الله عليه وسلم ليدل على أن ترك إبرام شيء دون إذن الرسول صلى الله عليه وسلم من تقوى الله وحده ، أي ضده ليس من التقوى .وجملة { إن اللَّه سميع عليم } في موضع العلة للنهي عن التقدم بين يدي الله ورسوله وللأمر بتقوى الله .والسميع : العليم بالمسموعات ، والعليم أعم وذكرها بين الصفتين كناية عن التحذير من المخالفة ففي ذلك تأكيد للنهي والأمر .\n\n",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (0 ye who believe! Be not forward in the presence of Allah): '(0 ye who believe! Be not forward in the presence of Allah) do not start with any word or action until the Messenger of Allah (pbuh) commands or prohibits you first; it is also said that this means: do not start immolating your sacrifices on the day of immolation (and His messenger) until you receive Allah's command and the command of His Messenger; it is also said that this means: do not oppose the Messenger; and it is said this means: do not contravene the Book of Allah or the practice of His Messenger, (and keep your duty to Allah) fear Allah in relation to saying or doing anything without the command of Allah or of His Messenger, and do not oppose the Book of Allah or the practice of His Messenger. (Lo! Allah is Hearer) of what you say, (Knower) of your works. This was revealed about three prophetic Companions who killed two men from Banu Salim when the Muslims had a peace treaty with them, without being commanded to do so by Allah or by His Messenger. Allah, glorified and Exalted is He, forbade them from engaging in any matter without a command from Allah or His Messenger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال حدّثنا علي بن أحمد\n قال حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قوله تعالى: { لاَ تُقَدِّمُواْ بَيْنَ يَدَيِ ٱللَّهِ وَرَسُولِهِ } معناه لا تُعجِّلوا بالأمرِ والنهي دُونَهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\n{He said:} Ali ibn Ahmad told us\n\n\n\"Do not put yourselves forward in the presence of Allah and His Messenger\" means do not haste in the matter and the prohibition without him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا أيها الذين آمنوا لا تقدّموا بين يدي الله ورسوله } طلب الجمع بين أدبي الظاهر والباطن من أهل الحضور ونهى عن التقدمة المطلقة في الحضرة الإلهية والحضرة النبوية المتناولة للتقدم في الأقوال والأفعال وحديث النفس والظهور بالصفات والذات\n ولحضرة كل اسم من أسماء الله تعالى أدب يجب مراعاته على من تجلى الله له به ولكل مقام وحال أدب يجب على صاحبه محافظته\n فالتقدمة بين يدي الله في مقام الفناء هي الظهور بالأنائية في حضرة الذات\n وفي مقام المحو الظهور بصفة تقابل الصفة التي تشاهد تجليها في حضرة الأسماء كالظهور بإرادته في مقام الرضا\n ومشاهدة الإرادة في حضرة تجلي اسم المريد\n والظهور بعلمه بالاعتراض في مقام التسليم بحضرة العليم وبالتجلّد في مقام العجز\n ومشاهدة القادر وتحديث النفس في مقام المراقبة وشهود المتكلم\n وبالفعل في مقام التوكل والانسلاخ عن الأفعال في حضرة الفعال\n وهذه كلها إخلال بأدب الباطن مع الله تعالى\n وأما الإخلال بأدب الظاهر معه\n فـ: كترك العزائم إلى الرخص والإقدام على الفضول المباحة من الأقوال والأفعال وأمثالها\n وأما التقدمة بين يدي الرسول بإخلال أدب الظاهر فهو: كالتقدم عليه في الكلام\n والمشي\n ورفع الصوت\n والنداء من وراء الحجرات\n والجلوس معه واللبث عنده للاستئناس بالحديث\n والدخول عليه والانصراف عنه بغير الاستئذان وأمثاله\n وأما إخلال أدب الباطن معه فـ: كالطمع في أن يطيعه الرسول في أمر\n وظن السوء في حقه وأمثال ذلك\n وأما المخالفات التي تتعلق بالأوامر والنواهي والإقدام على الشيء قبل معرفة حكم الله تعالى وحكم الرسول فيه فهي من سوء أدب أهل الغيبة لا الحضور الذي نحن فيه\n { واتقوا الله } في هذه التقدمات كلها فإن من اتّقى الله حق تقاته لا يصدر عنه أمثال هذه التقدمات في المواقع المذكورة { إنّ الله سميع } للتقدمات القولية في باب أدب الظاهر\n ولأحاديث النفس في باب أدب الباطن { عليم } بالفعليات والوصفيات وبظهور البقيات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم: مراعاة الأدب مع الله ورسوله\n فعليكم أن { لاَ تُقَدِّمُواْ } ولا تتقدموا في أمر من الأمور وحكم من الأحكام { بَيْنَ يَدَيِ ٱللَّهِ وَرَسُولِهِ } أي: لا تبادروا بإمضاء الأحكام ما لم تشاوروا بكتاب الله وسنة رسوله ولم تعرضوها عليهما { وَٱتَّقُواْ ٱللَّهَ } الغيور المطلع على ما في ضمائركم ونياتكم\n واحذروا عن المسابقة والمبادرة في الأقوال والأحكام بمقتضى أرائكم وأهوائكم { إِنَّ ٱللَّهَ } المراقب عليكم في عموم أحوالكم { سَمِيعٌ } لأقوالكم { عَلِيمٌ } [الحجرات: 1] بنياتكم فيها\n\n\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } من خصائص إيمانكم بالله وبرسوله أن { لاَ تَرْفَعُوۤاْ أَصْوَاتَكُمْ } وقت التكلم مع النبي صلى الله عليه وسلم { فَوْقَ صَوْتِ ٱلنَّبِيِّ } ولا تخلطوا أصواتكم مع صوته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الذين آمنوا } تصدير الخطاب بالنداء\n تنبيهُ المخاطبين على أنَّ في حيّزه أمر خطير يستدعي اعتنائهم بشأنه\n وفرط اهتمامهم بتلقيه ومراعاته\n ووصفهم بالإيمان لتنشيطهم\n والإيذان بأنه داع إلى المحافظة عليه ووازع عن الإخلال به\n { لا تُقدِّموا } أي: لا تفعلوا التقديم\n على ترك المفعول للقصد إلى نفس الفعل من غير اعتبار تعلقه بأمرٍ من الأمور\n على طريقة قولهم: فلان يعطي ويمنع\n أو: لا تُقدّموا أموراً من الأمور\n على حذف المفعول\n للعموم\n أو: يكون التقديم بمعنى التقدُّم\n من \" قدّم \" اللازم\n ومنه: مقدمة الجيش\n للجماعة المتقدَّمة\n ويؤيده قراءة مَن قرأ: لا تَقدَّموا بحذف أحدى التاءين\n أي: لا تتقدموا { بين يدي اللّهِ ورسولهِ }: لا تقطعوا أمراً قبل أن يحكما به\n وحقيقة قولك: جلست بين يدي فلان: أن تجلس بين الجهتين المسامتتين ليمينه وشماله قريباً منه\n فسُميت الجهتان يدين لكونهما على سمت اليدين مع القرب منهما\n توسعاً\n كما يُسمّى الشيء باسم غيره إذا جاوره\n وفي هذه العبارة ضرب من المجاز الذي يُسمى تمثيلاً\n وفيه فائدة جليلة\n وهي: تصوير الهُجْنَةِ والشناعة فيما نُهوا عنه من الإقدام على أمر من الأمور دون الاحتذاء على أمثلة الكتاب والسنة\n ويجوز أن يجري مجرى قولك: سرَّني زيد وحُسْنُ ماله\n فكذلك هنا المعنى: لا تُقدِّموا بين يدي رسول الله صلى الله عليه وسلم: وفائدة هذا الأسلوب: الدلالة على قوة الاختصاص\n ولمَّا كان رسول الله صلى الله عليه وسلم من الله بالمكان الذي لا يخفى سلك به هذا المسلك\n وفي هذا تميهد لما نُقِم منهم من رفع أصواتهم فوق صوته لأن مَن فضَّله الله بهذه الأَثْرة\n واختصه بهذا الاختصاص\n كان أدنى ما يجب له من التهيُّب والإجلال: إن لا يُرفع صوتٌ بين يديه\n ولا يُقطع أمر دونه\n فالتقدمُ عليه تَقَدمٌ على الله لأنه لا ينطلق عن الهوى\n فنبغي الاقتداء بالملائكة حيث قيل فيهم:\n[الأنبياء: 27] الخ\n قال عبد الله بن الزبير: قَدِمَ وفد من تميم على رسول الله صلى الله عليه وسلم فقال أبو بكر: لو أمَّرت عليهم القعقاع بن معبد\n وقال عمر: يا رسول الله بل أَمِّر الأقرعَ بن حابس فقال أبو بكر: ما أردتُ إلا خلافي\n وقال عمر: ما أردتُ خِلافَك\n وارتفعت أصواتهما\n فنزلت\n فعلى هذا يكون المعنى: لا تُقَدِّموا وُلاةً\n والعموم أحسن كما تقدّم\n وعبارة البخاري: \" وقال مجاهد: لا تقُوموا لا تَفْتاتُوا على رسول الله صلى الله عليه وسلم حتى يَقضي اللّهُ - عزّ وجل - على لسانه \"\nوعن الحسن: أن ناساً ذبحوا يوم الأضحى قبل الصلاة\n فنزلت\n فأمرهم رسولُ الله صلى الله عليه وسلم أن يعيدوا\n وعن عائشة: أنها نزلت في النهي عن صوم يوم الشك\n\n{ واتقوا اللّهَ } في كل ما تأتون وتذرون من الأحوال والأفعال\n التي من جملتها ما نحن فيه\n { إِنَّ اللّهَ سميع } لأقوالكم { عليم } بأفعالكم\n فمن حقِّه أن يُتَّقى ويُراقَب\n { يا أيها آمنوا لا ترفعوا أصواتَكم فوقَ صوتِ النبي } شروع في النهي عن التجاوز في كيفية القول عند النبي صلى الله عليه وسلم\n بعد النهي عن التجاوز في نفس القول والفعل\n وإعادة النداء مع قرب العهد للمبالغة في الإيقاظ والتنبيه\n والإشعار باستقلال كل من الكلامين باستدعاء الاعتناء بشأنه أي: لا تبلغوا بأصواتكم وراء حدٍّ يبلغه صوته صلى الله عليه وسلم\n بل يكون كلامه عالياً لكلامكم\n وجهره باهراً لجهركم\n حتى تكون مزيّته عليكم لائحةً\n وسابقته لديكم واضحة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:182",
      "similarity": 0.5528061753422179
    },
    {
      "verse": "8:51",
      "similarity": 0.5528061753422179
    },
    {
      "verse": "22:10",
      "similarity": 0.5528061753422179
    },
    {
      "verse": "28:47",
      "similarity": 0.5158865994330836
    },
    {
      "verse": "15:24",
      "similarity": 0.5137407075647967
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/049001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/049001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/49:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}