{
  "chapter": "الحجرات",
  "text": "يمنون عليك ان اسلموا۟ قل لا تمنوا۟ على اسلمكم بل الله يمن عليكم ان هدىكم للايمن ان كنتم صدقين",
  "translations": [
    {
      "translation": "They think they have done you a favour by becoming Muslims! Say: 'Do not consider your Islam a favour to me. No indeed! It is Allah who has favoured you by guiding you to iman if you are telling the truth.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They impress upon you that they have submitted. Tell them: \"Do not favour me with your submission. In fact God has favoured you by showing you the way to belief, if you are men of truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They count it as a favour to you that they accepted Islam. Say: “Do not regard your (accepting) Islam as a favour to me; rather, Allah has bestowed a favour on you by guiding you to faith, if you are truthful (in your claim to be believers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The bedouins tell you that) you owe them (a great deal) for their embracing Islam. Tell them, \"You are not doing me any favors by embracing Islam. In fact, it is God who has done you a great favor by guiding you to the faith. (Think about this) if you are people of truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They portray that they are doing a great favour to you (O dear Prophet Mohammed – peace and blessings be upon him) by having become Muslims; say, “Do not think that you have done me a favour by accepting Islam; in fact Allah has bestowed a favour upon you, for He guided you to Islam, if you are truthful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They regard as a favor to you that they have embraced Islam. Say: \"Do not count your Islam as a favor to me. Nay, but Allah has conferred a favor upon you that He has guided you to the Faith if you indeed are true. \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They think that they lay you under an obligation by becoming Muslims. Say: Lay me not under obligation by your Islam: rather Allah lays you under an obligation by guiding you to the faith if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They count it as a favour to thee that they have surrendered! Say: 'Do not count your surrendering as a favour to me; nay, but rather God confers a favour upon you, in that He has guided you to belief, if it be that you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They make it a favour unto thee (Muhammad) that they have surrendered (unto Him). Say: Deem not your Surrender a favour unto me; but Allah doth confer a favour on you, inasmuch as He hath led you to the Faith, if ye are earnest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They think they have done you a favour by becoming Muslims! Say, \"Do not consider your Islam a favour to me. No indeed! It is God who bestowed a favour on you by guiding you to the true faith. [Admit this], if you are telling the truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They make it a favour Unto thee that they have surrendered. Say thou: deem not your surrender a favour Unto me; nay! Allah hath conferred a favour Unto you inasmuch as He hath guided you to belief, if ye are sincere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They count it as a favour to you that they have embraced Islam. Say, ‘Do not count your embracing of Islam as a favour to me. No, it is Allah who has done you a favour in that He has guided you to faith, if you are truthful [in your claim].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They impress on thee as a favour that they have embraced Islam. Say, \"Count not your Islam as a favour upon me: Nay, Allah has conferred a favour upon you that He has guided you to the faith, if ye be true and sincere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They regard as favour upon you (O Muhammad SAW) that they have embraced Islam. Say: \"Count not your Islam as a favour upon me. Nay, but Allah has conferred a favour upon you, that He has guided you to the Faith, if you indeed are true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They regard it as a favor to you that they have submitted! Say: 'Do not regard your submission as a favor to me, rather, it is Allah who bestows upon you a favor by guiding you to belief, if you are truthful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They regarded it a favor to you that they have submitted. Say, “Do not consider your submission a favor to me; it is God who has done you a favor by guiding you to the faith, if you are sincere.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They consider it a favor to you that they have accepted Islam. Say, \"Do not consider your Islam a favor to me. Rather, Allah has conferred favor upon you that He has guided you to the faith, if you should be truthful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[49:17] They deem it to be a favour to you that they have submitted, without [the need for any] fighting, unlike [those] others who submitted only after being fought. Say: ‘Do not deem your submission to be a favour to me (islāmakum, ‘your submission’, has dependent accusative status because of the omission of the genitive preposition bi-,which is also read as implicit before the an in both instances). Rather, it is God Who has done you a favour in that He has guided you to faith, if you are being sincere, when you say, ‘We believe’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَمُنُّونَ عَلَيْكَ أَنْ أَسْلَمُوا قُلْ لَا تَمُنُّوا عَلَيَّ إِسْلَامَكُمْ بَلِ اللَّهُ يَمُنُّ عَلَيْكُمْ أَنْ هَدَاكُمْ لِلْإِيمَانِ إِنْ كُنْتُمْ صَادِقِينَ (17(استئناف ابتدائي أريد به إبطال ما أظهره بنو أسد للنبيء صلى الله عليه وسلم من مزيتهم إذ أسلموا من دون إكراه بغزو .والمنّ : ذكر النعمة والإحسان ليراعيَه المحسَن إليه للذاكر ، وهو يكون صريحاً مثل قول سبرة بن عمرو الفقعسي :أتنسى دفاعي عنك إذ أنت مُسلم ... وقد سال من ذل عليك قراقرويكون بالتعريض بأن يذكر المان من معاملته مع الممنون عليه ما هو نافعه مع قرينة تدلّ على أنه لم يرد مجرد الإخبار مثل قول الراعي مخاطباً عبد الملك بن مروان :فآزرت آل أبي خُبيب وافدا ... يوماً أريد لبيعتي تبديلاأبو خبيب : كنية عبد الله بن الزبير .وكانت مقالة بني أسد مشتملة على النوعين من المنّ لأنهم قالوا : ولم نقاتلك كما قاتلك محارب وغَطَفان وهوازن وقالوا : وجئناك بالأثقال والعيال .و { أن أسْلَمُوا } منصوب بنزع الخافض وهو باء التعدية ، يقال : منّ عليه بكذا ، وكذلك قوله : { لا تمنوا على إسلامكم } إلا أن الأول مطرد مع { أنْ } و ( أن ( والثاني سماعي وهو كثير .وهم قالوا للنبيء صلى الله عليه وسلم آمنَّا كما حكاه الله آنفاً ، وسماه هنا إسلاماً لقوله : { ولكن قولوا أسلمنا } \\[ الحجرات : 14 \\] أي أن الذي مَنُّوا به عليك إسلام لا إيمان . وأثبت بحرف { بَل } أن ما مَنُّوا به إن كان إسلاماً حقاً موافقاً للإيمان فالمنّة لله لأنْ هداهم إليه فأسلموا عن طواعية . وسماه الآن إيماناً مجاراة لزعمهم لأن المقام مقام كون المنّة لله فمناسبة مُسَابَرَة زعمهم أنهم آمنوا ، أي لو فرض أنكم آمنتم كما تزعمون فإن إيمانكم نعمة أنعم الله بها عليكم . ولذلك ذيله بقوله : { إن كنتم صادقين } فنفى أولاً أن يكون ما يمنّون به حقاً ، ثم أفاد ثانياً أن يكون الفضل فيما ادعوه لهم لو كانوا صادقين بل هو فضل الله .وقد أضيف إسلام إلى ضميرهم لأنهم أتوا بما يسمى إسلاماً لقوله : { ولكن قولوا أسْلَمْنا } . وأُتي بالإيمان معرّفا بلام الجنس لأنه حقيقة في حدّ ذاته وأنهم ملابسوها .وجيء بالمضارع في { يمنون } مع أن منَّهم بذلك حصل فيما مضى لاستحضار حالة منّهم كيف يمنون بما لم يفعلوا مثل المضارع في قوله تعالى : { ويسخرون من الذين آمنوا } في سورة البقرة ( 212 ( . وجيء بالمضارع في قوله : بل اللَّه يمن عليكم } لأنه مَنّ مفروض لأن الممنون به لمّا يقع . وفيه من الإيذان بأنه سيمنّ عليهم بالإيمان ما في قوله : { ولمَّا يدخُل الإيمان في قلوبكم } \\[ الحجرات : 14 \\] ، وهذا من التفنن البديع في الكلام ليضع السامع كل فنّ منه في قَراره ، ومثلهم من يتفطن لهذه الخصائص .وتقديم المسند إليه على المسند الفعلي لإفادة التقوية مثل : هو يعطي الجزيل ، كما مثَّل به عبد القاهر .\n\n",
      "translations": [
        {
          "translation": "(They make it favour unto thee) Muhammad (that they have surrendered (unto Him)) this is their claim: \"0 Messenger of Allah, feed us and be generous to us, for we have become Muslim\". (Say) to them, Muhammad: (Deem not your Surrender a favour unto me; nay, but Allah doth confer a favour on you, inasmuch as He hath led you) that He has called you (to the Faith) to accept the Faith, (if ye are earnest) in your claim that you are true believers; but you are not.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه تعليماً لحبيبه صلى الله عليه وسلم وإرشاداً: { يَمُنُّونَ عَلَيْكَ } يا أكمل الرسل { أَنْ أَسْلَمُواْ } إسلامهم\n ودخولهم في السلم مع أنهم ليسوا مؤمنين مذعنين { قُل } في جوابهم يا أكمل الرسل إلزاماً وتبكيتاً: { لاَّ تَمُنُّواْ عَلَيَّ إِسْلاَمَكُمْ } أي: بإسلامكم هذا\n ولا تعدوا أنفسكم من جملة الموقنين بمجرد ما تفوهتم بالإيمان { بَلِ ٱللَّهُ } العالم لعموم السرائر والخفايا { يَمُنُّ عَلَيْكُمْ أَنْ هَداكُمْ } أي: يهديكم وأرشدكم { لِلإِيمَانِ } المثمر للعرفان\n المستلزم للتوحيد وعلى العيان { إِن كُنْتُمْ صَادِقِينَ } [الحجرات: 17] في إيمانكم\n موافقين قلوبكم بألسنتكم\n مطابقين لجامع أنكم لستم كذلك\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يمنُّون عليك أنْ أسْلَموا } أي: يعدون إسلامهم مِنّة عليك\n فـ \" أن \" نصب على نزع الخافض\n والمَنُّ: ذكر النعمة في وجه الافتخار\n وقال النسفي: هو ذكر الأيادي تعريضاً للشكر\n ونهينا عنه\n هـ\n فانظره\n { قل لا تمنُّوا عليَّ إِسلامَكم } أي: لا تعدوا إسلامكم منةً عليَّ\n فإنّ نفعَه قاصرٌ عليكم إن صح\n { بل الله يَمُنُّ عليكم } أي: المنة إنما هي لله عليكم { أنْ هداكم للإِيمان } أي: لأن هداكم\n أو: بأن هداكم للإيمان على زعمكم { إِن كنتم صادقين } في ادّعاء الإيمان\n إلاَّ أنكم تزعمون وتدعون ما الله عليم بخلافه\n وجواب الشرط محذوف لدلالة ما قبله عليه أي: إن كنتم صادقين في ادعائكم الإيمان فللّه المنّة عليكم\n وفي سياق النظم الكريم من اللُطف ما لا يخفى فإنهم لمّا سَموا ما في صدورهم إيماناً\n ومَنُّوا به\n نفى تعالى كونه إيماناً\n وسمّاه إسلاماً\n كأنه قيل: يمنون عليك بما هو في الحقيقة إسلام وليس بإيمان\n بل لو صحّ ادّعاؤهم للإيمان فللّه المنّة عليهم بالهداية إليه لا لهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:6",
      "similarity": 0.6715701128782823
    },
    {
      "verse": "68:3",
      "similarity": 0.6178121358833631
    },
    {
      "verse": "41:8",
      "similarity": 0.591011750752477
    },
    {
      "verse": "84:25",
      "similarity": 0.5792131419857507
    },
    {
      "verse": "95:6",
      "similarity": 0.5773675706979157
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/049017.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/049017.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/49:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}