{
  "chapter": "الحجرات",
  "text": "انما المؤمنون اخوة فاصلحوا۟ بين اخويكم واتقوا۟ الله لعلكم ترحمون",
  "translations": [
    {
      "translation": "The muminun are brothers, so make peace between your brothers and have taqwa of Allah so that hopefully you will gain mercy.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithful are surely brothers; so restore friendship among your brothers, and fear God that you may be favoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the believers are none but brothers unto one another, so set things right between your brothers, and have fear of Allah that you may be shown mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers are each other's brothers. Restore peace among your brothers. Have fear of God so that perhaps you will receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Muslims are brothers to each other, therefore make peace between your two brothers and fear Allah, so that you may gain mercy. (The entire Muslim nation is a single brotherhood, without any distinction for caste, creed or colour.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are but a brotherhood. So make reconciliation between your brothers, and have Taqwa of Allah that you may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are but brethren, therefore make peace between your brethren and be careful of (your duty to) Allah that mercy may be had on you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers indeed are brothers; so set things right between your two brothers, and fear God; haply so you will find mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are naught else than brothers. Therefore make peace between your brethren and observe your duty to Allah that haply ye may obtain mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely all believers are brothers. So make peace between your brothers, and fear God, so that mercy may be shown to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are but brethren; wherefore make reconciliation between your brethren and fear Allah, that haply ye may be shewn mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithful are indeed brothers. Therefore, make peace between your brothers and be wary of Allah, so that you may receive [His] mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Believers are but a single Brotherhood: So make peace and reconciliation between your two (contending) brothers; and fear Allah, that ye may receive Mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are nothing else than brothers (in Islamic religion). So make reconciliation between your brothers, and fear Allah, that you may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers are indeed brothers, therefore make things right among your two brothers and fear Allah, so that you will be subject to mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are brothers, so reconcile between your brothers, and remain conscious of God, so that you may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are but brothers, so make settlement between your brothers. And fear Allah that you may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[49:10] The believers are indeed brothers, in religion. Therefore [always] make peace between your brethren, when they fall into dispute with one another (a variant reading [for the dual form akhawaykum, ‘your two brethren’] has ikhwatakum, ‘your brothers’) and fear God, so that perhaps you might receive mercy.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّمَا الْمُؤْمِنُونَ إِخْوَةٌ فَأَصْلِحُوا بَيْنَ أَخَوَيْكُمْ وَاتَّقُوا اللَّهَ لَعَلَّكُمْ تُرْحَمُونَ (10(تعليل لإقامة الإصلاح بين المؤمنين إذا استشرى الحال بينهم ، فالجملة موقعها موقع العلة ، وقد بني هذا التعليل على اعتبار حال المسلمين بعضهم مع بعض كحال الإخوة .وجيء بصيغة القصر المفيدة لحصر حالهم في حال الإخوة مبالغة في تقرير هذا الحكم بين المسلمين فهو قصر ادعائي أو هو قصر إضافي للرد على أصحاب الحالة المفروضة الذين يبغون على غيرهم من المؤمنين ، وأخبر عنهم بأنهم إخوة مجازاً على وجه التشبيه البليغ زيادة لتقرير معنى الأخوة بينهم حتى لا يحق أن يقرن بحرف التشبيه المشعر بضعف صفتهم عن حقيقة الأخُوَّة . وهذه الآية فيها دلالة قوية على تقرر وجوب الأخوة بين المسلمين لأن شأن { إنما } أن تجيء لخبر لا يجهله المخاطب ولا يدفع صحته أو لما يُنَزِّل منزلة ذلك كما قال الشيخ في «دلائل الإعجاز» في الفصل الثاني عشر وساق عليه شواهد كثيرة من القرآن وكلام العرب فلذلك كان قوله تعالى : { إنما المؤمنون إخوة } مفيد أن معنى الأخوة بينهم معلوم مقرر . وقد تقرر ذلك في تضاعيف كلام الله تعالى وكلام رسوله صلى الله عليه وسلم من ذلك قوله تعالى : { يقولون ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان } في سورة الحشر ( 10 ( ، وهي سابقة في النزول على هذه السورة فإنها معدودة الثانية والمائة ، وسورة الحجرات معدودة الثامنة والمائة من السور . وآخى النبي بين المهاجرين والأنصار حين وروده المدينة وذلك مبدأ الإخاء بين المسلمين . وفي الحديث لو كنت متّخذاً خليلاً غيرَ ربي لاتخذت أبا بكر ولكن أخوة الإسلام أفضل .وفي باب تزويج الصغار من الكبار من صحيح البخاري } \" أن النبي صلى الله عليه وسلم خطب عائشة من أبي بكر . فقال له أبو بكر : إنما أنا أخوك فقال : أنتَ أخي في دين الله وكتابِه وهي لي حلال \" وفي حديث «صحيح مسلم» \" المسلم أخو المسلم لا يظلمه ولا يخذله ولا يحقره بحسب امرىء من الشر أن يحقر أخاه المسلم \" وفي الحديث \" لا يؤمن أحدكم حتى يحبَّ لأخيه ما يحب لنفسه \" أي يحب للمسلم ما يحب لنفسه .فأشارت جملة { إنما المؤمنون إخوة } إلى وجه وجوب الإصلاح بين الطائفتين المُتبَاغِيَتَيْن منهم ببيان أن الإيمان قد عَقَد بين أهله من النسب الموحَى ما لا ينقص عن نسب الأخوة الجسدية على نحو قول عمر بن الخطاب للمرأة التي شكت إليه حاجة أولادها وقالت : أنا بنت خُفاف بن أيْمَاء ، وقد شهد أبي مع رسول الله الحديبية فقال عمر «مرحبا بنسب قريب» . ولما كان المتعارف بين الناس أنه إذا نشبت مشاقّة بين الأخوين لزم بقية الإخوة أن يتناهضوا في إزاحتها مشياً بالصلح بينهما فكذلك شأن المسلمين إذا حدث شقاق بين طائفتين منهم أن ينهض سائرهم بالسعي بالصلح بينهما وبثِّ السفراء إلى أن يرقعوا ما وهى ، ويرفعوا ما أصاب ودهَى .وتفريع الأمر بالإصلاح بين الأخوين ، على تحقيق كون المؤمنين إخوة تأكيد لما دلت عليه { إنما } من التعليل فصار الأمر بالإصلاح الواقع ابتداء دون تعليل في قوله : { فأصلحوا بينهما ، وقوله : { فأصلحوا بينهما بالعدل } \\[ الحجرات : 9 \\] قد أردف بالتعليل فحصل تقريره ، ثم عقب بالتفريع فزاده تقريراً .وقد حصل من هذا النَظم ما يشبه الدعوى وهي كمطلوب القياس ، ثم ما يشبه الاستدلال بالقياس ، ثم ما يشبه النتيجة .ولمَّا تقرر معنى الأخوة بين المؤمنين كمالَ التقرّر عُدل عن أن يقول : فأصلحوا بين الطائفتين ، إلى قوله : { بين أخويكم } فهو وصف جديد نشأ عن قوله : { إنما المؤمنون إخوة } ، فتعين إطلاقه على الطائفتين فليس هذا من وضع الظاهر موضع الضمير فتأمل .وأوثرت صيغة التثنية في قوله : { أخويكم } مراعاة لكون الكلام جار على طائفتين من المؤمنين فجعلت كل طائفة كالأخ للأخرى . وقرأ الجمهور { بين أخويكم } بلفظ تثنية الأخ ، أي بين الطائفة والأخرى مراعاة لجريان الحديث على اقتتال طائفتين . وقرأ الجمهور { بين أخويكم } بلفظ تثنية الأخ على تشبيه كل طائفة بأخ . وقرأ يعقوب { فأصلحوا بين إخوَتِكم } بتاء فوقية بعد الواو على أنه جمع أخ باعتبار كل فرد من الطائفتين كالأخ .والمخاطب بقوله : { واتقوا اللَّه لعلكم ترحمون } جميع المؤمنين فيشمل الطائفتين الباغية والمبغي عليها ، ويشمل غيرهما ممن أمروا بالإصلاح بينما ومقاتلة الباغية ، فتقوى كلَ بالوقوف عند ما أمر الله به كُلّا مما يخصه ، وهذا يشبه التذييل . ومعنى { لعلكم ترحمون } : تُرجى لكم الرحمة من الله فتجري أحوالكم على استقامة وصلاح . وإنما اختيرت الرحمة لأن الأمر بالتقوى واقع إثر تقرير حقيقة الأخوة بين المؤمنين وشأن تعامل الإخوة الرحمة فيكون الجزاء عليها من جنسها .\n\n",
      "translations": [
        {
          "translation": "(The believers are naught else than brothers) in religion. (Therefore make peace between your brethren) by means of the Book of Allah (and observe your duty to Allah) and fear Allah regarding that which He commands you regarding making peace (that haply ye may obtain mercy) and not be punished.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n { إِنَّمَا ٱلْمُؤْمِنُونَ } الموقنون بوحدة الحق\n المصدقون لرسوله المبيِّن لطريق توحيده { إِخْوَةٌ } في الدين القويم { فَأَصْلِحُواْ بَيْنَ أَخَوَيْكُمْ } بالعدل والإنصاف { وَٱتَّقُواْ ٱللَّهَ } في صلاحكم هذا عن الميل والانحراف { لَعَلَّكُمْ تُرْحَمُونَ } [الحجرات: 10] لأجل عدالتكم وتقواكم\n\n\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم ترك المراء والاستهزاء بحيث { لاَ يَسْخَرْ قَوْمٌ } منكم أيها الرجال القوامون المقيمون لحدود الله { مِّن قَوْمٍ } أمثالكم في القيام والتقويم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنما المؤمنون إِخوةٌ } أي: منتسبون إلى أصل واحدٍ\n وهو الإيمان المُوجب للحياة الأبدية\n فيجب الاجتهاد في التآلف بينهما لتحقُّق الأخوة\n والفاء في قوله: { فأصْلِحوا بين أخوَيكم } للإيذان بأنّ الأخوة الدينية موجبة للإصلاح\n ووضع المظهر مقامَ المضمر مضافاً إلى المأمورين للمبالغة في تأكيد وجوب الإصلاح والتحضيض عليه\n وتخصيص الاثنين بالذكر لإثبات وجوب الإصلاح فيما فوق ذلك بطريق الأَولى لتضاعف الفتنة والفساد فيه\n وقيل: المراد بالأخَويْن: الأوس والخزرج\n وقرأ يعقوب: \" إخوتكم \" بالجمع\n { واتقوا الله } فيما تأتون وتذرون\n التي من جملتها: الإصلاحُ بين الناس { لعلكم تُرحمون } راجين أن تُرحموا على تقواكم\n لأن التقوى تحملكم على التواصل والائتلاف\n وهو سبب نزول الرحمة\n الإشارة: النفسُ الطبيعية والروح متقابلان\n والحرب بينهما سِجال\n فالنفس تريد السقوط إلى أرض الحظوظ والبقاء مع عوائدها\n والروح تريد العروج إلى سماء المعارف وحضرة الأسرار\n وبينما اتصال والتصاقٌ\n فإن غلَبت النفسُ هبطت بالروح إلى الحضيض الأسفل\n ومنعتها من العلوم اللدنية والأسرار الربانية\n وإن غلبت الروح\n عرجت بالنفس إلى أعلى عليين\n بعد تزكيتها وتصفيتها\n فتكسوها حُلةَ الروحانية\n وينكشِف لها من العلوم والأسرار ما كان للروح\n ولكلٍّ جندٌ تقابل به\n فيقال من طريق الإشارة: وإن طائفتان من المؤمنين اقتتلوا فأصْلِحوا بينهما\n بأن تؤخَذَ النفسُ بالسياسة شيئاً فشيئاً\n يُنقص من حظوظها شيئاً فشيئاً\n حتى تتزكى وتعالَجَ الروحُ لدخول الحضرة\n وعكوف الهم في الذكر شيئاً فشيئاً\n حتى تدخل الحضرة وهي لا تشعر\n ثم تشعُر ويقع الاستغراق\n وأما إن قُطِعت النفسً عن جميع مألوفاتها مرةً واحدة\n أو كُلفت الروحَ الحضورَ في الذكر على الدوام مرةً واحدة\n أفسدتهما\n لقوله صلى الله عليه وسلم:\n \" ادخلوا في هذا الدين برفق\n فما شاد أحدكم الدين إلا غَلَبه \" \nوقال أيضاً:\n \" لا يكن أحدكم كالمُنْبتِّ\n لا أرضاً قطع ولا ظهراً أبقى \" \nفإن بغت إحداهما على الأخرى فقاتِلوا التي تبغي\n بأن تُردع النفس إن طغت\n وتأخذ لجام الروح إن هاجت\n حتى تفيء إلى أمر الله\n وهو الاعتدال\n فيعطي كلّ ذي حق حقه\n ويُوفي كل ذي قسط قسطه\n وقوله تعالى: { إِنما المؤمنون إخوة } قال الورتجبي: افهَم أيها العاقل أن الله سبحانه خلق الأرواحَ المقدسةَ من عالَم الملكوت\n وألبسها أنوارَ الجبروت فمواردُها من قُربه مختلفة\n لكن عينها واحدة\n وخلق هياكلَها وأشباحَها من تربة الأرض التي أخلصها من جملتها\n وزيّنها بنور قدرته\n ونفخ فيها تلك الأرواح\n وجعل من الأرواح والأجسام النفوس الأمّارة التي ليست من قبيل الأرواح\n ولا من قبيل الأجسام\n وجعلها مخالفة للأرواح ومساكِنها\n فأرسل الله عليها جندَ العقول\n يدفع شَرَّها\n فإذا امتحن الله عبادَه المؤمنين هيَّج نفوسهم الأمّارة ليُظهر حقائق درجاتهم من الإيمان\n فأَمَرهم أن يُعينوا العقلَ والروحَ والقلبَ على النفس حتى تنهزم لأن المؤمنين كالبنيان يشُد بعضُهم بعضاً\n\nثم بيَّن أنّ في الإصلاح بين الإخوان الفلاح والنجاة\n إذا كان مقروناً بالتقوى التي تقدسُ البواطن من البغي والحسد بقوله: { واتقوا الله لعلكم تُرحمون } فإذا فهِمت ما ذكرتُ علمتَ أنْ حقيقة الأخوة مصدر الاتحاد\n فإنهم كنفسٍ واحدة لأن مصادرهم مصدر واحد\n وهو آدم\n ومصدر روح آدم نورُ الملكوت\n ومصدرُ جسمه تربة الجنة في بعض الأقوال\n لذلك يصعد الروحُ إلى الملكوت\n والجسم إلى الجنة\n كما قال صلى الله عليه وسلم:\n \" كل شيء يرجع إلى أصل \" \nهـ\n قلت: صعود الروح إلى الملكوت هو شهود معاني الأسرار في دار الجنة\n ونزول الجسم إلى الجنة هو تمتُّعه بنعيم حسها في عالم الأشباح\n وكل ذلك بعد الموت\n وأحسنُ العبارة أن يُقال: لأن مصادرَهم مصدر واحد\n وهو بحر الجبروت\n المتدفق بأنوار الملكوت\n والوجود بأَسْره موجةٌ من بحر الجبروت\n ثم قال الورتجبي: قال أبو بكر النقاش: سألتُ الجنيد عن الأخ الحقيقي؟ فقال: هو أنت في الحقيقة\n غير أنه غيرك في الهيكل\n قلت: يعني أن الناس في الحقيقة ذاتٌ واحدة\n وما افترقوا إلا في الهياكل\n فكلهم أخوة\n وقال أبو عثمان الحيري: أُخُوة الدين أثبت من أخوة النسب\n فإن أخوة النسب تُقطع بمخالفة الدين\n وأخوة الدين لا تقطع بمخالفة النسب\n هـ\n وتقدم لنا شروط الأخوة في قوله تعالى:\n[الزخرف: 67] الآية\n وقال القشيري هنا: ومن حق الأخوة ألا تُلجأه إلى الاعتذار\n بل تُبسط عذرَه أي: تذكر عذره قبل أن يعتذر\n فإن أُشكل عليك وجهه عُدت بالملامة على نفسك في خفاء عذره عليك\n وتتوب عليه إذا أذنب\n وتعوده إذا مرض\n وإذا أشار عليك بشيء فلا تطالبه بالدليل وإيراد الحجة\n كما أنشدوا:\nومن أَوْكد شروطها: التعظيم\n كما أبان ذلك بقوله تعالى: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ لاَ يَسْخَرْ قَوْمٌ مِّن قَوْمٍ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:142",
      "similarity": 0.6471483036191003
    },
    {
      "verse": "43:48",
      "similarity": 0.46453320939173137
    },
    {
      "verse": "36:45",
      "similarity": 0.4615571921259271
    },
    {
      "verse": "7:151",
      "similarity": 0.4432520046779611
    },
    {
      "verse": "70:12",
      "similarity": 0.39881171728184217
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/049010.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/049010.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/49:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}