{
  "chapter": "الحجرات",
  "text": "يايها الذين ءامنوا۟ لا تقدموا۟ بين يدى الله ورسوله واتقوا۟ الله ان الله سميع عليم",
  "translations": [
    {
      "translation": "You who have iman! do not put yourselves forward in front of Allah and of His Messenger; and have taqwa of Allah. Allah is All-Hearing, All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O YOU WHO believe, do not forestall the judgements of God and His Apostle, and have fear of God. Verily God hears all and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not advance before Allah and His Messenger, and fear Allah. Verily Allah is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not be presumptuous with the Messenger of God (in your deeds and in your words). Have fear of God; He is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not advance ahead of Allah and His Noble Messenger, and fear Allah; indeed Allah is All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Make not (a decision) in advance before Allah and His Messenger, and have Taqwa of Allah. Verily, Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! be not forward in the presence of Allah and His Apostle, and be careful of (your duty to) Allah; surely Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, advance not before God and His Messenger; and fear God. God is All-hearing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Be not forward in the presence of Allah and His messenger, and keep your duty to Allah. Lo! Allah is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not push yourselves forward in the presence of God and His Messenger. Fear God -- God hears all and knows all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! be not forward in the presence of Allah and His apostle, and fear Allah; verily Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not venture ahead of Allah and His Apostle, and be wary of Allah. Indeed Allah is all-hearing, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! Put not yourselves forward before Allah and His Messenger; but fear Allah: for Allah is He Who hears and knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not put (yourselves) forward before Allah and His Messenger (SAW), and fear Allah. Verily! Allah is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers do not advance before Allah and His Messenger. Fear Allah. Allah is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not place your opinions above that of God and His Messenger, and fear God. God is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not put [yourselves] before Allah and His Messenger but fear Allah. Indeed, Allah is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[49:1] O you who believe, do not venture ahead of (tuqaddimū, [derives] from qaddama, with the sense of [the 5th form] taqaddama), that is to say, do not come forward with any [unwarranted] saying or deed [ahead of], God and His Messenger, the one communicating [the Message] from Him, that is to say, without their permission, and fear God. Surely God is Hearer, of your sayings, Knower, of your deeds: this was revealed regarding the dispute between Abū Bakr and ‘Umar, may God be pleased with them both, in the presence of the Prophet (s), over the appointment of al-Aqra‘ b. Hābis or al-Qa‘qā‘ b. Ma‘bad as commander [of his tribe].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (0 ye who believe! Be not forward in the presence of Allah): '(0 ye who believe! Be not forward in the presence of Allah) do not start with any word or action until the Messenger of Allah (pbuh) commands or prohibits you first; it is also said that this means: do not start immolating your sacrifices on the day of immolation (and His messenger) until you receive Allah's command and the command of His Messenger; it is also said that this means: do not oppose the Messenger; and it is said this means: do not contravene the Book of Allah or the practice of His Messenger, (and keep your duty to Allah) fear Allah in relation to saying or doing anything without the command of Allah or of His Messenger, and do not oppose the Book of Allah or the practice of His Messenger. (Lo! Allah is Hearer) of what you say, (Knower) of your works. This was revealed about three prophetic Companions who killed two men from Banu Salim when the Muslims had a peace treaty with them, without being commanded to do so by Allah or by His Messenger. Allah, glorified and Exalted is He, forbade them from engaging in any matter without a command from Allah or His Messenger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال حدّثنا علي بن أحمد\n قال حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قوله تعالى: { لاَ تُقَدِّمُواْ بَيْنَ يَدَيِ ٱللَّهِ وَرَسُولِهِ } معناه لا تُعجِّلوا بالأمرِ والنهي دُونَهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم: مراعاة الأدب مع الله ورسوله، فعليكم أن { لاَ تُقَدِّمُواْ } ولا تتقدموا في أمر من الأمور وحكم من الأحكام { بَيْنَ يَدَيِ ٱللَّهِ وَرَسُولِهِ } أي: لا تبادروا بإمضاء الأحكام ما لم تشاوروا بكتاب الله وسنة رسوله ولم تعرضوها عليهما { وَٱتَّقُواْ ٱللَّهَ } الغيور المطلع على ما في ضمائركم ونياتكم، واحذروا عن المسابقة والمبادرة في الأقوال والأحكام بمقتضى أرائكم وأهوائكم { إِنَّ ٱللَّهَ } المراقب عليكم في عموم أحوالكم { سَمِيعٌ } لأقوالكم { عَلِيمٌ } [الحجرات: 1] بنياتكم فيها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الذين آمنوا } تصدير الخطاب بالنداء، تنبيهُ المخاطبين على أنَّ في حيّزه أمر خطير يستدعي اعتنائهم بشأنه، وفرط اهتمامهم بتلقيه ومراعاته، ووصفهم بالإيمان لتنشيطهم، والإيذان بأنه داع إلى المحافظة عليه ووازع عن الإخلال به، { لا تُقدِّموا } أي: لا تفعلوا التقديم، على ترك المفعول للقصد إلى نفس الفعل من غير اعتبار تعلقه بأمرٍ من الأمور، على طريقة قولهم: فلان يعطي ويمنع، أو: لا تُقدّموا أموراً من الأمور، على حذف المفعول، للعموم، أو: يكون التقديم بمعنى التقدُّم، من \" قدّم \" اللازم، ومنه: مقدمة الجيش، للجماعة المتقدَّمة، ويؤيده قراءة مَن قرأ: لا تَقدَّموا بحذف أحدى التاءين، أي: لا تتقدموا { بين يدي اللّهِ ورسولهِ }: لا تقطعوا أمراً قبل أن يحكما به، وحقيقة قولك: جلست بين يدي فلان: أن تجلس بين الجهتين المسامتتين ليمينه وشماله قريباً منه، فسُميت الجهتان يدين لكونهما على سمت اليدين مع القرب منهما، توسعاً، كما يُسمّى الشيء باسم غيره إذا جاوره\n وفي هذه العبارة ضرب من المجاز الذي يُسمى تمثيلاً، وفيه فائدة جليلة، وهي: تصوير الهُجْنَةِ والشناعة فيما نُهوا عنه من الإقدام على أمر من الأمور دون الاحتذاء على أمثلة الكتاب والسنة\n ويجوز أن يجري مجرى قولك: سرَّني زيد وحُسْنُ ماله، فكذلك هنا المعنى: لا تُقدِّموا بين يدي رسول الله صلى الله عليه وسلم: وفائدة هذا الأسلوب: الدلالة على قوة الاختصاص، ولمَّا كان رسول الله صلى الله عليه وسلم من الله بالمكان الذي لا يخفى سلك به هذا المسلك، وفي هذا تميهد لما نُقِم منهم من رفع أصواتهم فوق صوته لأن مَن فضَّله الله بهذه الأَثْرة، واختصه بهذا الاختصاص، كان أدنى ما يجب له من التهيُّب والإجلال: إن لا يُرفع صوتٌ بين يديه، ولا يُقطع أمر دونه، فالتقدمُ عليه تَقَدمٌ على الله لأنه لا ينطلق عن الهوى، فنبغي الاقتداء بالملائكة حيث قيل فيهم:\n\n[الأنبياء: 27] الخ\n قال عبد الله بن الزبير: قَدِمَ وفد من تميم على رسول الله صلى الله عليه وسلم فقال أبو بكر: لو أمَّرت عليهم القعقاع بن معبد، وقال عمر: يا رسول الله بل أَمِّر الأقرعَ بن حابس فقال أبو بكر: ما أردتُ إلا خلافي، وقال عمر: ما أردتُ خِلافَك، وارتفعت أصواتهما، فنزلت\n فعلى هذا يكون المعنى: لا تُقَدِّموا وُلاةً، والعموم أحسن كما تقدّم\n وعبارة البخاري: \" وقال مجاهد: لا تقُوموا لا تَفْتاتُوا على رسول الله صلى الله عليه وسلم حتى يَقضي اللّهُ - عزّ وجل - على لسانه \"\nوعن الحسن: أن ناساً ذبحوا يوم الأضحى قبل الصلاة، فنزلت، فأمرهم رسولُ الله صلى الله عليه وسلم أن يعيدوا، وعن عائشة: أنها نزلت في النهي عن صوم يوم الشك\n\n\n{ واتقوا اللّهَ } في كل ما تأتون وتذرون من الأحوال والأفعال، التي من جملتها ما نحن فيه، { إِنَّ اللّهَ سميع } لأقوالكم { عليم } بأفعالكم، فمن حقِّه أن يُتَّقى ويُراقَب\n { يا أيها آمنوا لا ترفعوا أصواتَكم فوقَ صوتِ النبي } شروع في النهي عن التجاوز في كيفية القول عند النبي صلى الله عليه وسلم، بعد النهي عن التجاوز في نفس القول والفعل، وإعادة النداء مع قرب العهد للمبالغة في الإيقاظ والتنبيه، والإشعار باستقلال كل من الكلامين باستدعاء الاعتناء بشأنه أي: لا تبلغوا بأصواتكم وراء حدٍّ يبلغه صوته صلى الله عليه وسلم، بل يكون كلامه عالياً لكلامكم، وجهره باهراً لجهركم، حتى تكون مزيّته عليكم لائحةً، وسابقته لديكم واضحة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:182",
      "similarity": 0.5528061753422179
    },
    {
      "verse": "8:51",
      "similarity": 0.5528061753422179
    },
    {
      "verse": "22:10",
      "similarity": 0.5528061753422179
    },
    {
      "verse": "28:47",
      "similarity": 0.5158865994330836
    },
    {
      "verse": "15:24",
      "similarity": 0.5137407075647967
    }
  ]
}