{
  "chapter": "الحجرات",
  "text": "قالت الاعراب ءامنا قل لم تؤمنوا۟ ولكن قولوا۟ اسلمنا ولما يدخل الايمن فى قلوبكم وان تطيعوا۟ الله ورسوله لا يلتكم من اعملكم شيـا ان الله غفور رحيم",
  "translations": [
    {
      "translation": "The desert Arabs say, 'We have iman.' Say: 'You do not have iman. Say rather, \"We have become undervalue your actions in any way. Allah is Ever-Forgiving, Most Merciful.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Arabs of the desert say: \"We believe.\" Tell them: \"You do not believe. Better say: 'We submit'; for belief has not yet penetrated your hearts.\" If you begin to obey God and His Apostle, He will not withhold the least (of the recompense) of your labour. Verily God is forgiving and kind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Bedouins say: “We believe.” (O Prophet), say to them: “You do not believe; you should rather say: 'We have submitted'”; for belief has not yet entered your hearts. If you obey Allah and His Messenger, He will not diminish anything from the reward of any of your deeds. Surely Allah is Most Forgiving, Most Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The bedouin Arabs have said, \"We are believers.\" Tell them, \"You are not believers, but you should say that you are Muslims. In fact, belief has not yet entered your hearts. If you obey God and His Messenger, nothing will be reduced from your deeds. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ignorant said, “We have accepted faith”; say, (O dear Prophet Mohammed – peace and blessings be upon him), “You have surely not accepted faith, but you should say ‘We have submitted’, for faith has not yet entered your hearts; and if you obey* Allah and His Noble Messenger, He will not reduce the reward of any of your deeds; indeed Allah is Oft Forgiving, Most Merciful.” (* By accepting faith and then obeying the commands).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The bedouins say: \"We believe.\" Say: \"You do not believe. But say, `We have submitted,' for Faith has not yet entered your hearts. But if you obey Allah and His Messenger, He will not decrease anything in reward for your deeds. Verily, Allah is Forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The dwellers of the desert say: We believe. Say: You do not believe but say, We submit; and faith has not yet entered into your hearts; and if you obey Allah and His Apostle, He will not diminish aught of your deeds; surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Bedouins say, 'We believe.' Say: 'You do not believe; rather say, \"We surrender\"; for belief has not yet entered your hearts. If you obey God and His Messenger, He will not diminish you anything of your works. God is All-forgiving, All-compassionate.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wandering Arabs say: We believe. Say (unto them, O Muhammad): Ye believe not, but rather say \"We submit,\" for the faith hath not yet entered into your hearts. Yet, if ye obey Allah and His messenger, He will not withhold from you aught of (the reward of) your deeds. Lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Arabs of the desert say, \"We have believed.\" Say to them, \"You have not believed yet; say rather, \"We have submitted,\" for faith has not yet entered into your hearts. But if you will obey God and His Messenger, He will not detract anything from your good deeds. God is most forgiving and ever merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The desert Arabs say: we have believed. Say thou: believe not, but rather say: We have submitted; and belief hath not yet entered into your hearts. And if ye obey Allah and His apostle, He shall not diminish from you aught Of you, wOrks verily Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Bedouins say, ‘We have faith.’ Say, ‘You do not have faith yet; rather, say, ‘‘We have embraced Islam,’’ for faith has not yet entered into your hearts. Yet if you obey Allah and His Apostle, He will not stint anything of [the reward of] your works. Indeed Allah is all-forgiving, all-merciful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The desert Arabs say, \"We believe.\" Say, \"Ye have no faith; but ye (only) say, 'We have submitted our wills to Allah,' For not yet has Faith entered your hearts. But if ye obey Allah and His Messenger, He will not belittle aught of your deeds: for Allah is Oft-Forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The bedouins say: \"We believe.\" Say: \"You believe not but you only say, 'We have surrendered (in Islam),' for Faith has not yet entered your hearts. But if you obey Allah and His Messenger (SAW), He will not decrease anything in reward for your deeds. Verily, Allah is Oft-Forgiving, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Arabs declare: 'We believe' Say: 'You do not', rather, say: 'we submit' because belief has not yet found its way into your hearts. If you obey Allah and His Messenger, He will not reduce a thing from of your deeds. Allah is the Forgiving and the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Desert-Arabs say, “We have believed.” Say, “You have not believed; but say, ‘We have submitted,’ for faith has not yet entered into your hearts. But if you obey God and His Messenger, He will not diminish any of your deeds. God is Forgiving and Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The bedouins say, \"We have believed.\" Say, \"You have not [yet] believed; but say [instead], 'We have submitted,' for faith has not yet entered your hearts. And if you obey Allah and His Messenger, He will not deprive you from your deeds of anything. Indeed, Allah is Forgiving and Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[49:14] The Bedouins — a group of men from among the Banū Asad — say, ‘We believe’, we affirm the truth in our hearts. Say, to them: ‘You do not believe; but rather say, “We have submitted”, we are outwardly compliant; for faith has not yet entered into your hearts’, hitherto; however, it is expected of you. Yet if you obey God and His Messenger, by [embracing] faith and in other ways, He will not diminish for you (read ya’litkum or   yalitkum, by making the hamza an alif) anything of your deeds, that is, of the reward for them. God is indeed Forgiving, to believers, Merciful, to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَالَتِ الْأَعْرَابُ آَمَنَّا قُلْ لَمْ تُؤْمِنُوا وَلَكِنْ قُولُوا أَسْلَمْنَا وَلَمَّا يَدْخُلِ الْإِيمَانُ فِي قُلُوبِكُمْ وَإِنْ تُطِيعُوا اللَّهَ وَرَسُولَهُ لَا يَلِتْكُمْ مِنْ أَعْمَالِكُمْ شَيْئًا إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ (14(كان من بين الوفود التي وفدت على رسول الله صلى الله عليه وسلم في سنة تسع المسماة سنةَ الوفود ، وفْدُ بني أسدٍ بننِ خُزيمة وكانوا ينزلون بقرب المدينة ، وكان قدومهم المدينة عقب قدوم وفد بني تميم الذي ذُكر في أول السورة ، ووفَدَ بنُو أسد في عدد كثير وفيهم ضِرار بن الأزْوَر ، وطُلَيْحَة بن عبد الله ( الذي ادعى النبوءة بعد وفاة النبي صلى الله عليه وسلم أيام الردة ( ، وكانت هذه السنة سنة جدب ببلادهم فأسلموا وكانوا يقولون للنبيء صلى الله عليه وسلم أتتك العرب بأنفسها على ظهور رواحلها وجئناك بالأثقال والعيال والذراري ولمْ نقاتلك كما قاتلك محارب خَصَفَةَ وهوازنُ وغَطفانَ . يفدون على رسول الله صلى الله عليه وسلم ويروحون بهذه المقالة ويمنُّون عليه ويريدون أن يَصرف إليهم الصدقات ، فأنزل الله فيهم هذه الآيات إلى آخر السورة لوقوع القصتين قصة وفد بني تميم وقصة وفد بني أسد في أيام متقاربة ، والأغراض المسكوَّة بالجَفاء متناسبة . وقال السدّي : نزلت في الأعراب المذكورين في سورة الفتح ( 11 ( في قوله تعالى : { سيقول لك المخلفون من الأعراب شغلتنا أموالنا وأهلونا } الآية .قالوا آمنا ليأمنوا على أنفسهم وأموالهم فلما استنفروا إلى الحديبية تخلفوا فنزلت هذه الآية .والأعراب : سكان البادية من العَرب . وأحسب أنه لا يطلق على أهل البادية من غير العرب ، وهو اسم جمع لا مفرد له فيكون الواحد منه بياء النسبة أعرابي .وتعريف { الأعراب } تعريف العهد لإعراب معينين وهم بنو أسد فليس هذا الحكم الذي في الآية حاقاً على جميع سكان البوادي ولا قال هذا القول غير بني أسد .وهم قالوا آمنا حين كانوا في شك لم يتمكن الإيمان منهم فأنبأهم الله بما في قلوبهم وأعلمهم أن الإيمان هو التصديق بالقلب لا بمجرد اللسان لقصد أن يخلصوا إيمانهم ويتمكنوا منه كما بينه عقب هذه الآية بقوله : { إنما المؤمنون الذين آمنوا بالله ورسوله } الآية .والاستدراك بحرف ( لكن ( لرفع ما يتوهم من قوله : { لم تؤمنوا } أنهم جاؤوا مضمرين الغدْر بالنبي صلى الله عليه وسلم وإنما قال : { ولكن قولوا أسلمنا } تعليماً لهم بالفرق بين الإيمان والإسلام فإن الإسلام مَقرُّه اللسان والأعمالُ البدنية ، وهي قواعد الإسلام الأربعة : الصلاة والزكاة وصيام رمضان وحج الكعبة الوارد في حديث عمر عن سُؤال جبريل النبي صلى الله عليه وسلم عن الإسلام والإيمان والإحسان والساعة «الإسلام أن تشهد أن لا إله إلا الله محمداً رسول الله وتقيم الصلاة وتأتي الزكاة وتصوم رمضان وتحُجّ البيت إن استطعتَ إليه سبيلا» فهؤلاء الأعراب لما جاءوا مظهرين الإسلام وكانت قلوبهم غير مطمئنة لعقائد الإيمان لأنهم حديثو عهد به كذبهم الله في قولهم { آمنَّا } ليعلموا أنهم لم يخف باطنهم على الله ، وأنه لا يتعدّ بالإسلام إلا إذا قارنه الإيمان ، فلا يغني أحدهما بدون الآخر ، فالإيمان بدون إسلام عناد ، والإسلام بدون إيمان نفاق ، ويجمعهما طاعة الله ورسوله صلى الله عليه وسلموكان مقتضى ظاهر نظم الكلام أن يقال : قل لم تؤمنوا ولكن أسلمتم ، أو أن يقال : قل لا تقولوا آمنا ولكن قولوا أسلمنا ، ليتوافق المستدرك عنه والاستدراك بحسب النظم المتعارف في المجادلات ، فعدل عن الظاهر إلى هذا النظم لأن فيه صراحة بنفي الإيمان عنهم فلا يحسبوا أنهم غالطوا رسول الله صلى الله عليه وسلمواستغني بقوله : { لم تؤمنوا } عن أن يقال : لا تقولوا آمنا ، لاستهجان أن يخاطبوا بلفظ مُؤدّاه النهي عن الإعلان بالإيمان لأنهم مطالبون بأن يؤمنوا ويقولوا آمنا قولا صادقاً لا كاذباً فقيل لهم { لم تؤمنو } تكذيباً لهم مع عدم التصريح بلفظ التكذيب ولكن وقع التعريض لهم بذلك بعد في قوله : { إنما المؤمنون الذين آمنوا بالله ورسوله ثم لم يرتابوا } إلى قوله : { أولئك هم الصادقون } أي لا أنتم ولذلك جيء بالاستدراك محمولاً على المعنى .وعدل عن أن يقال : ولكن أسلمتم إلى { قولوا أسلمنا } تعريضاً بوجوب الصدق في القول ليطابق الواقع ، فهم يشعرون بأن كذبهم قد ظهر ، وذلك مما يُتعير به ، أي الشأن أن تقولوا قولاً صادقاً .وقوله : { ولما يدخل الإيمان في قلوبكم } واقع موقع الحال من ضمير { لم تؤمنوا } وهو مبيّنٌ لمعنى نفي الإيمان عنهم في قوله : { لم تؤمنوا } بأنه ليس انتفاء وجود تصديق باللسان ولكن انتفاء رسوخه وعقد القلب عليه إذ كان فيهم بقية من ارتياب كما أشعر به مقابلته بقوله : { إنما المؤمنون الذين آمنوا بالله ورسوله ثم لم يرتابوا } .واستعير الدخول في قوله : { ولما يدخل الإيمان في قلوبكم } للتمكن وعدم التزلزل لأن الداخل إلى المكان يتمكن ويَسْتقر والخارج عنه يكون سريع المفارقة له مستوفزاً للانصراف عنه .و ( لمّا ( هذه أخت ( لم ( وتدل على أن النفي بها متصل بزمان التكلم وذلك الفارق بينها وبين ( لم ( أختها . وهذه الدلالة على استمرار النفي إلى زمن التكلم تؤذن غالباً ، بأن النمفي بها متوقع الوقوع . قال في «الكشاف» «وما في ( لمّا ( من معنى التوقع دال على أن هؤلاء قد آمنوا فيما بعد» .وهي دلالة من مستتبعات التراكيب . وهذا من دقائق العربية . وخالف فيه أبو حيان والزمخشري حجة في الذوق لا يدانيه أبو حيان ، ولهذا لم يكن قوله : { ولما يدخل الإيمان في قلوبكم } تكريراً مع قوله : { لم يؤمنوا } .وقوله : { وإن تطيعوا الله ورسوله لا يلتكم من أعمالكم شيئاً } إرشاد إلى دواء مرض الحال في قلوبهم من ضعف الإيمان بأنه إن يطيعوا الله ورسوله حَصل إيمانهم فإن مما أمر الله به على لسان رسوله صلى الله عليه وسلم بيان عقائد الإيمان بأن يقبلوا على التعلم من رسول الله صلى الله عليه وسلم مدة إقامتهم بالمدينة عوضاً عن الاشتغال بالمَنّ والتعريض بطلب الصدقات .ومعنى { لا يلتكم } لا يُنقصكم ، يقال : لاته مثل باعه . وهذا في لغة أهل الحجاز وبني أسد ، ويقال : التَه ألَتاً مثل : أمره ، وهي لغة غطفان قال تعالى : { وما ألتناهم من عملهم من شيء } في سورة الطور ( 21 ( .وقرأ بالأولى جمهور القراء وبالثانية أبو عمرو ويعقوب . ولأبي عمرو في تحقيق الهمزة فيها وتخفيفها ألفا روايتان فالدُّوري روى عنه تحقيق الهمزة والسوسي روى عنه تخفيفها .وضمير الرفع في { يلتكم } عائد إلى اسم الله ولم يقل : لا يَلِتَاكم بضمير التثنية لأنّ الله هو متولي الجزاء دون الرسول صلى الله عليه وسلموالمعنى : إن أخلصتم الإيمان كما أمركم الله ورسوله تقبَّل الله أعمالكم التي ذكرتم من أنكم جئتم طائعين للإسلام من غير قتال .وجملة { إن الله غفور رحيم } استئناف تعليم لهم بأن الله يتجاوز عن كذبهم إذا تابوا ، وترغيب في إخلاص الإيمان لأن الغفور كثير المغفرة شديدُها ، ومن فرط مغفرته أنه يجازي على الأعمال الصالحة الواقعة في حالة الكفر غيرَ معتدّ بها فإذا آمن عاملها جوزي عليها بمجرد إيمانه وذلك من فرط رحمته بعباده .وترتيب { رحيم } بعد { غفور } لأن الرحمة أصل للمغفرة وشأن العلة أن تورد بعد المعلل بها .\n\n",
      "translations": [
        {
          "translation": "(The wandering Arabs say: We believe) this was revealed about Banu Asad who had suffered a very hard year and consequently joined Islam and moved with all their families and children to Medina to benefit from the Prophet's donations. But their presence in Medina caused a rise in the price of foodstuffs and the streets of Medina became full of their impurities. In fact, these people were hypocrites who kept reiterating: \"0 Messenger of Allah! We are true believers, so do feed us and be generous with us\". When Allah mentioned their claim, the wandering Arabs of Banu Asad said: \"We are genuine in our faith in Allah and His Messenger\". But Allah said: (Say) to them, Muhammad: (Ye believe not) you are not genuine in your faith in Allah and His Messenger, (but rather say \"We submit\") we submit so that we may be spared from the sword and captivity, (for the faith hath not yet entered into your hearts) for love and sincerity of faith have 603 not entered your hearts. (Yet, if ye obey Allah and His messenger) inwardly as you obey him outwardly and repent of inward disbelief and hypocrisy, (He will not withhold from you aught of (the reward of) your deeds) He will not diminish the reward of your works. (Lo! Allah is Forgiving) He forgives whoever repent of you, (Merciful) towards whoever dies repentant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ يَلِتْكُمْ مِّنْ أَعْمَالِكُمْ شَيْئاً } معناه لا يَنقُصَكُم\n\n\n\n\nوقوله تعالى: { وَلَـٰكِن قُولُوۤاْ أَسْلَمْنَا } معناه اسْتَسلَمنا لِخوفِ القَتلِ والسَّبيِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High - {No fatigue will come to you in your [work for] Us} - its meaning is that nothing of your [good] deeds will be lost.\n\n\nAnd His saying, {But say, \"We have submitted\"}, means that we have submitted out of fear of death and destruction.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن عدم امتثالهم وانقيادهم بأمر التعارف والتلاحق الموصى إليهم من قِبل الحق { قَالَتِ ٱلأَعْرَابُ } التي هي المثل في اللدد والعناد على سبيل التغالب والتفاخر حين قدموا المدينة في سنة جدبة\n وأظهروا الشهادتين لا عن عزيمة خالصةٍ وقصدٍ صادقٍ\n بل عكلى سبيل الخداع والنفاق\n ولهذا كانوا يقولون لرسول الله صلى الله عليه وسلم على سبيل الامتنان: أتيناك بالأحمال والأثقال\n ولم نقاتل معك كما قاتل بنو فلان { آمَنَّا } بك بلا سبق خصومةٍ منا معك\n بالجملة يمنون عليك يا أكمل الرسل بإيمانهم الواهي وصدقاتهم الغير وافية { قُل } لهم يا أكمل الرسل بعدما أظهورا ما أضمروا في ضمائرهم من المنة والغلول المنافي للإخلاص والإيمان { لَّمْ تُؤْمِنُواْ } أيها الأعراب بمجرد قولكم آمنا\n إذ الإيمان إنما هو من أفعال القلوب الصافية عن كدر المن والأذى مطلقاً { وَلَـٰكِن قُولُوۤاْ } بدل قولكم \" آمنَّا \" { أَسْلَمْنَا } أي: دخلنا في السلم\n وصالحنتا على ألاَّ تخاصم بيننا وبينكم ولا نزاع\n وكيف تقولون: آمنَّا { وَ } الحال أنه { لَمَّا يَدْخُلِ ٱلإِيمَانُ } والإذعان { فِي قُلُوبِكُمْ } التي هي وعاؤه وهو من أفعالها { وَ } بالجملة: { إِن تُطِيعُواْ ٱللَّهَ وَرَسُولَهُ } أي: حق إطاعتهما وانقيادهما مخلصين { لاَ يَلِتْكُمْ } ولا ينقصكم { مِّنْ أَعْمَالِكُمْ شَيْئاً } أي: من أجورها وجزائها إن أخلصتم فيها\n وجئتم بها بلا منّ وأذى { إِنَّ ٱللَّهَ } المطلع بنيات عباده { غَفُورٌ } لمن تاب عن فرطاته { رَّحِيمٌ } [الحجرات: 14] يرحم عليه وبقبل توبته\n\n\nوبالجملة: { إِنَّمَا ٱلْمُؤْمِنُونَ } المخلصون هم { ٱلَّذِينَ آمَنُواْ بِٱللَّهِ وَرَسُولِهِ } وأخلصوا في إيمانكم وإذعانهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { قالت الأعرابُ } أي: بعض الأعراب { آمنّا } نزلت في نفر من بني أسد\n قدِموا المدينةَ في سنة جدبة\n فأَظْهَروا الإسلام\n ولم يُؤمنوا في السر\n وأفْسَدوا طُرق المدينة بالعذَرَات\n وأغْلَوا أسعارها\n وكانوا يقولون لرسول الله صلى الله عليه وسلم: أتيناك بالأثقال والعيال\n ولم نُقاتلك كما قتلك بنو فلان\n وهم يريدون الصدقة\n ويقولون: أعطنا\n ويمنّون بإسلامهم\n { قل } لهم: { لم تؤمنوا } لم تُصدّقوا بقلوبكم { ولكن قولوا أسْلَمنا } فالإيمان هو التصديق بالقلب مع الإذعان به\n والإسلام هو الدخول في السِّلْم\n والخروج من أن يكون حرباً للمؤمنين بإظهار الشهادتين ألا ترى إلى قوله: { ولمَّا يَدْخُلِ الإِيمانُ في قلوبكم } فهو يدل على أنَّ مجرد النطق بالشهادتين ليس بإيمان\n فتحصَّل أن ما يكون من الإقرار باللسان من غير مواطأة للقلب فهو إسلام\n وما واطأ فيه القلبُ اللسانَ فهو إيمان\n وهذا من حيث اللغة\n وأما في الشرع فهما متلازمان\n فلا إسلام إلا بعد إيمان\n ولا إيمان إلا بعد النطق بالشهادة إلا لعذر\n والتعبير بـ \" لمّا \" يدل على أن الإيمان متوقَّع من بعضهم وقد وقع\n فإن قلت: مقتضى نظم الكلام أن يقول: قل لا تقولوا آمنا ولكن قولوا أسلمنا\n أو: قل لم تؤمنوا ولكن أسلمتم؟ قلت: أفاد هذا النظم تكذيب دعواهم أولاً\n فقيل: قل لم تؤمنوا\n مع حسن أدب\n فلم يقل: كذبتم صريحاً\n ووضع \" لم تؤمنوا \" الذي هو نفس ما ادَّعوا إثباته موضعه\n واستغنى بقوله: { لم تؤمنوا } عن أن يقال: لا تقولوا آمنا لاستهجان أن يخاطبوا بلفظ مؤداه النهي عن القول بالإيمان\n ولم يقل: ولكن أسلمتم ليكون قولهم خارجاً مخرج الزعم والدعوى\n كما كان قولهم: \" آمنا \" كذلك\n ولو قيل: ولكن أسلمتم لكان كالتسليم\n والاعتداد بقولهم\n وهو غير معتدّ به\n وليس قوله: { ولمّا يدخل الإيمانُ في قلوبكم } تكريراً لمعنى قوله: { لم تؤمنوا } فإنّ فائدة قوله: { لم تؤمنوا } تكذيب دعواهم\n وقوله: { ولمَّا يدخل الإيمان في قلوبكم } توقيت لما أُمروا به أن يقولوه\n كأنه قيل لهم: ولكن قولوا أسلمنا حين لم يثبت مواطأة قلوبكم لألسنتكم لأنه كلام واقع موقع الحال من الضمير في \" قولوا \"\n قاله النسفي\n { وإِن تُطيعوا اللّهَ ورسولَه } بالإخلاص وترك النفاق { لا يَلِتْكُم من أعمالكم شيئاً } من أجورها\n يقال: ألَت يألِتُ\n وألات يُليت\n ولات يلِيت\n بمعنى\n وهو النقص\n { إِنَّ اللّهَ غفور } لما فرط من الذنوب\n { رحيمٌ } يستر العيوب\n { إِنما المؤمنون الذين آمنوا بالله ورسولِه ثم لم يرتابوا } لم يَشُكُّوا\n من: ارتاب\n مضارع رابه: إذا أوقعه في الشك والتُهمة\n والمعنى: أنهم آمنوا ثم لم يقع في إيمانهم شك فيما آمنوا\n ولا اتهام لمَن صدّقوه\n ولمَا كان الإيقان وزوال الريب ملاك الإيمان أُفرد بالذكر بعد تقدُّم الإيمان\n تنبيهاً على عُلو مكانه\n وعُطف على الإيمان بثمّ إشعاراً باستقراره في الأزمنة المتراخية المتطاولة غضّاً جديداً\n\n{ وجاهدوا بأموالهم وأنفسِهم في سبيل الله } أي: جاهَدوا ما ينبغي جهاده في الكفار والأنفس والهوى\n بالإعانة بأموالهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:99",
      "similarity": 0.1082512790327968
    },
    {
      "verse": "48:16",
      "similarity": 0.09923205347005545
    },
    {
      "verse": "13:37",
      "similarity": 0.07819197271326862
    },
    {
      "verse": "46:12",
      "similarity": 0.07803243644216874
    },
    {
      "verse": "43:3",
      "similarity": 0.07621540039094216
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/049014.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/049014.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/49:14.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}