{
  "chapter": "الحجرات",
  "text": "انما المؤمنون الذين ءامنوا۟ بالله ورسوله ثم لم يرتابوا۟ وجهدوا۟ بامولهم وانفسهم فى سبيل الله او۟لئك هم الصدقون",
  "translations": [
    {
      "translation": "The muminun are only those who have had iman in Allah and His Messenger and then have had no doubt and have done jihad with their wealth and themselves in the Way of Allah. They are the ones who are true to their word.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They alone are believers who come to believe in God and His Apostle, then never doubt again, and struggle wealth and soul in the way of God. They are the truthful and sincere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the ones possessed of true faith are those who believed in Allah and His Messenger and then they did not entertain any doubt and strove hard in the Way of Allah with their lives and their possessions. These are the truthful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are those who believe in God and His Messenger, who do not change their belief into doubt and who strive hard for the cause of God with their property and persons. They are the truthful ones\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The true believers are only those who accepted faith in Allah and His Noble Messenger and then did not have any doubt, and fought with their wealth and their lives in Allah’s way; it is they who are the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those are the believers who have believed in Allah and His Messenger, and afterward doubt not but strive with their wealth and their lives for the cause of Allah. Those! They are the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are only those who believe in Allah and His Apostle then they doubt not and struggle hard with their wealth and their lives in the way of Allah; they are the truthful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are those who believe in God and His Messenger, then have not doubted, and have struggled with their possessions and their selves in the way of God; those -- they are the truthful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The (true) believers are those only who believe in Allah and His messenger and afterward doubt not, but strive with their wealth and their lives for the cause of Allah. Such are the sincere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are only those who have faith in God and His Messenger and then doubt not, but strive, hard with their wealth and their persons for the cause of God. Such are the truthful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are only those who believed in Allah and His apostle and thereafter doubted not, and strave with their riches and their persons in the cause of Allah. Those! they are the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithful are only those who have attained faith in Allah and His Apostle and then have never doubted, and who wage jihad with their possessions and their persons in the way of Allah. It is they who are the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those are Believers who have believed in Allah and His Messenger, and have never since doubted, but have striven with their belongings and their persons in the Cause of Allah: Such are the sincere ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only those are the believers who have believed in Allah and His Messenger, and afterward doubt not but strive with their wealth and their lives for the Cause of Allah. Those! They are the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are those who believe in Allah and His Messenger and have not doubted, and who struggled in His Way with their possessions and themselves. Such are those who are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are those who believe in God and His Messenger, and then have not doubted, and strive for God’s cause with their wealth and their persons. These are the sincere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are only the ones who have believed in Allah and His Messenger and then doubt not but strive with their properties and their lives in the cause of Allah. It is those who are the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[49:15] The [true] believers, that is, those who are true in their [affirmation of] faith — as He makes explicit in what follows — are only those who believe in God and His Messenger, and then have not doubted, they have not been uncertain of [their] faith, and who strive with their wealth and their souls for the cause of God, hence their striving manifests the sincerity of their faith. It is they who are sincere, in their faith, not those who say, ‘We believe’, and from whom all that has been forthcoming is their submission [to the religion].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then explained the traits of those who are true in their faith, saying: (The (true) believers) who are sincere in their faith (are those only who believe in Allah and His messenger and afterward doubt not) in their faith, (but strive with their wealth and their lives for the cause of Allah) in obedience to Allah. (Such are the sincere) who are true in their faith and striving.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ لَمْ يَرْتَابُواْ } معناه لَمْ يَشُكُّوا\n\n",
      "translations": [
        {
          "translation": " The meaning of the verse is that they did not doubt.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنما المؤمنون } إلى آخره\n لما فرق بين الإيمان والإسلام وبين أنّ الإيمان باطني قلبي والإسلام ظاهري بدني\n أشار إلى الإيمان المعتبر الحقيقي وهو اليقين الثابت في القلب المستقرّ الذي لا ارتياب معه لا الذي يكون على سبيل الخطرات\n فالمؤمنون هم الموقنون الذين غلبت ملكة اليقين قلوبهم على نفوسهم ونوّرتها بأنوارها فتأصلت فيها ملكة القلوب حتى تأثر بها الجوارح فلم يمكنها إلا الجري بحكمها والتسخر لهيئتها وذلك معنى قوله: { وجاهدوا بأموالهم وأنفسهم في سبيل الله } بعد نفي الارتياب عنهم لان بذل المال والنفس في طريق الحق هو مقتضى اليقين الراسخ وأثره في الظاهر { أولئك هم الصادقون } في الإيمان لظهور أثر الصدق على جوارحهم وتصديق أفعالهم وأقوالهم بخلاف المدّعين المذكورين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ليصلوا إلى مرتبة التوحيد المسقط لعوم الإضافات { ثُمَّ } بعدما آمنوا وآيقوا { لَمْ يَرْتَابُواْ } ولم يشكوا قط فيما آمنوا { وَ } مع ذلك { جَاهَدُواْ بِأَمْوَالِهِمْ وَأَنفُسِهِمْ فِي سَبِيلِ ٱللَّهِ } مع أعداء الله { أُوْلَـٰئِكَ } السعداء المقبولون عند الله { هُمُ ٱلصَّادِقُونَ } الحجرات: 15] المقصورون على الصدق والإخلاص\n الفائزون عند ربهم بأنواع الفوز والفلاح\n المتمكنون في مقعد الصدق عند مليك مقتدر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والمباشرة بأنفسهم في طلب رضى الله: { أولئك هم الصادقون } أي: الذي صدقوا في قلوبهم: آمنا\n لم يُكذِّبوا كما كذَّب أعرابُ بني أسد بل إيمانهم إيمان صِدق وحق\n والله تعالى أعلم\n الإشارة: مذهب الصوفية: أن العمل إذا كان حدّه الجوارح الظاهرة يُسمى مقام الإسلام\n وإذا انتقل لتصفية البواطن بالرياضة والمجاهدة يُسمى مقام الإيمان\n وإذا فتح على العبد بأسرار الحقيقة يُسمى مقام الإحسان\n وقد جعل الساحلي مقامَ الإسلام مُركّباً من ثلاثة: التوبة والتقوى والاستقامة\n والإيمانَ مُركباً من الإخلاص والصدق والطمأنينة\n والإحسانَ مُركّباً من المراقبة والمشاهدة والمعرفة\n ولكلٍّ زمان ورجال تربية واصطلاح في السير\n والمقصد واحد\n وهو المعرفة العيانية\n قال القشيري: الإيمان هو حياة القلوب\n والقلوب لا تحيا إلا بعد ذَبْح النفوس\n ولنفوس لا تموت ولكنها تغيب\n هـ\n أي: المقصود بقتل النفوس: هو الغيبة عنها في نور التجلِّي\n فإذا وقع الفناء في شهود الحق عن شهود الخلق فلا مجاهدة\n وقال القشيري في مختصره: { قالت الأعراب آمنّا\n\n\n } الخ\n يُشير إلى أنّ حقيقة الإيمان ليست مما يتناول باللسان\n بل هو نور يدخل القلوب\n إذا شرح الله صدر العبد للإسلام كما قال تعالى:\n[الزمر: 22]\n وقال عليه السلام في صفة ذلك النور:\n \" إنّ النور إذا وقع في القلب انفسح له واتسع \" \n\n قالوا: يا رسول الله هل لذلك النور من علامة؟ قال:\n \" بلى التجافي عن دار الغرور\n والإنابة إلى دار الخلود\n والاستعداد للموت\n قبل نزوله \" \nلهذا قال تعالى { ولمّا يدخل الإيمانُ في قلوبكم } أي: نور الإيمان\nهـ\n { وإن تطيعوا الله ورسوله } في الأوامر والنواهي بعد ذبح النفوس بسيف الصدق { لا يَلِتكم من أعمالكم شيئاً } بل كل ما تتقربون به إلى الله من مجاهدة النفوس ترون جزاءه عاجلاً\n من كشف غطاء وحلاوة شهود\n إن الله غفور لمَن وقع له فتور\n رحيم بمَن وقع منه نهوض\n { إنما المؤمنون الذين آمنوا بالله } وشاهَدوا أنواره وأسراره\n { ورسولِهِ } حيث عرفوا حقيقته النورانية الأولية\n { ثم لم يرتابوا } لم يخطر على بالهم خواطر سوء\n ولا شكوك فيما وعد الله من الرزق وغيره لأنَّ حجاب نفوسهم قد زال عنهم\n فصار الغيب شهادة\n والخبر عياناً\n والتعبير بـ \" ثم \" يقتضي تأخُّر تربية اليقين شيئاً فشيئاً حتى يحصل التمكين في مقامات اليقين\n مع التمكين في مقام الشهود والعيان\n ثم ذكر سبب إزاحة الشكوك عنهم بقوله: { وجاهَدوا بأموالهم } حيث بذلوها لله { وأنفسِهم } حيث جاهدوها في طلب الله { أولئك هم الصادقون } في طلب الحق\n فظفروا بما أمّلوا\n وربحوا فيما به تجروا\n جعلنا الله منهم بمنِّه وكرمه\n ثم ردّ عليهم مَنْ مَنَّ على الله بدينه\n فقال: { قُلْ أَتُعَلِّمُونَ ٱللَّهَ بِدِينِكُمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "61:11",
      "similarity": 0.6894919611276138
    },
    {
      "verse": "9:44",
      "similarity": 0.5493180910327429
    },
    {
      "verse": "9:88",
      "similarity": 0.514105189190481
    },
    {
      "verse": "29:69",
      "similarity": 0.4642777010678392
    },
    {
      "verse": "29:6",
      "similarity": 0.43781925041449427
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/049015.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/049015.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/49:15.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}