{
  "chapter": "الحجرات",
  "text": "ان الله يعلم غيب السموت والارض والله بصيرۢ بما تعملون",
  "translations": [
    {
      "translation": "Allah knows the unseen things of the heavens and the earth. Allah sees what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily God knows the unknown of the heavens and the earth; and God perceives all you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah knows every hidden thing of the heavens and the earth. Allah sees all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God knows whatever is unseen in the heavens and in the earth. He is Well Aware of what you do\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah knows all the hidden of the heavens and the earth; and Allah is seeing your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah knows the Unseen of the heavens and the earth. And Allah is the All-Seer of what you do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah knows the unseen things of the heavens and the earth; and Allah sees what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God knows the Unseen of the heavens and of the earth; and God sees the things you do.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah knoweth the Unseen of the heavens and the earth. And Allah is Seer of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God knows the unseen things of the heavens and the earth. God sees all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah knoweth the Unseen of the heavens and the earth; and Allah is the Beholder of that which ye work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah knows the Unseen of the heavens and the earth, and Allah watches what you do.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah knows the secrets of the heavens and the earth: and Allah Sees well all that ye do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah knows the unseen of the heavens and the earth. And Allah is the All-Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah knows the Unseen of the heavens and the earth, and Allah is the Seer of what you do'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God knows the secrets of the heavens and the earth, and God is seeing of everything you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah knows the unseen [aspects] of the heavens and the earth. And Allah is Seeing of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[49:18] Truly God knows the Unseen of the heavens and the earth, that is, [He knows] all that is hidden in both, and God is Seer of what you do’ (may be read either as ya‘malūna, ‘they do’, or ta‘malūna, ‘you do’), nothing of which can be concealed from Him. Meccan, except for verse 38, which is Medinese; it consists of 45 verses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّ اللَّهَ يَعْلَمُ غَيْبَ السَّمَاوَاتِ وَالْأَرْضِ وَاللَّهُ بَصِيرٌ بِمَا تَعْمَلُونَ (18(ذُيِّل تقويمُهم على الحق بهذا التذييل ليعلموا أن الله لا يُكتم ، وأنه لا يُكذَب ، لأنه يعلم كُلَّ غائبة في السماء والأرض فإنهم كانوا في الجاهلية لا تخطر ببال كثير منهم أصول الصفات الإلهية . وربما علمها بعضهم مثل زهير في قوله :فلا تكتمُنّ الله ما في نفوسكم ... ليَخفى فَمَهْمَا يُكْتم الله يعلَمولعل ذلك من آثار تنصره .وتأكيد الخبر ب { إن } لأنهم بحال من ينكر أن الله يعلم الغيب فكذبوا على النبي صلى الله عليه وسلم مع علمهم أنه مرسل من الله فكان كذبهم عليه مثل الكذب على الله .وقد أفادت هذه الجملة تأكيد مضمون جملتي { والله يعلم ما في السماوات وما في الأرض ، والله بكل شيء عليم } \\[ الحجرات : 16 \\] ولكن هذه زادت بالتصريح بأنه يعلم الأمور الغائبة لئلا يتوهم متوهم أن العمومين في الجملتين قبلها عمومان عرفيان قياساً على عِلم البشر .وجملة { والله بصير بما تعملون } معطوف على جملة { إن الله يعلم غيب السماوات والأرض } عطف الأخص على الأعم لأنه لما ذكر أنه يعلم الغيب وكان شأن الغائب أن لا يُرى عطف عليه علمه بالمبصرات احتراساً من أن يتوهّموا أن الله يعلم خفايا النفوس وما يجول في الخواطر ولا يعلم المشاهدات نظير قول كَثير من الفلاسفة : إنّ الخالق يعلم الكليات ولا يعلم الجزئيات ، ولهذا أوثر هنا وصف { بصير } . وقرأ الجمهور { بما تعملون } بتاء الخطاب ، وقرأه ابن كثير بياء الغيبة .\n\n",
      "translations": [
        {
          "translation": "(Lo! Allah knoweth the Unseen of the heavens and the earth) He knows the future events that will take place in the heavens and the earth. (And Allah is Seer of what ye do) hypocrites, in your state of hypocrisy and He also knows your punishment if you do not repent'. And of the surah in which Qaf is mentioned which is all Meccan, and consists of 45 verses, 395 words and 1,490 letters: Surah 50: Qaf And of the surah in which Qaf is mentioned which is all Meccan, and consists of 45 verses, 395 words and 1,490 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { إِنَّ اللَّهَ } المطلع في ضمائر عباده من الثقة والإخلاص { يَعْلَمُ } بحضرة علمه الحضوري { غَيْبَ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ وَ } بالجملة: { ٱللَّهُ } المراقب بعموم أحوالكم وأطواركم { بَصِيرٌ بِمَا تَعْمَلُونَ } [الحجرات: 18] من الأعمال خيراً كان أو شراً\n يجازيكم بمقتضى بصارته وعلمه\n\n\nجعلنا الله من زمرة المؤمنين الموقنين المخلصين الذين\n[البقرة: 62]\n\n\nخاتمة السورة\n\nعليك أيها الموحد المحمدي\n المتمكن المتحقق في مقام التوحيد الذاتي - مكنك الله في مقر عزك وتمكينك - أن تترفع بنفسك عن مطلق الزذائل المتعلقة بالأهوية الفاسدة والأماني الكاسدة\n سيما عن المنِّ والأذى في الإنفاق\n ورعونات السمعة والرياء في مطلق الطاعات\n وإياك إياك أن تتفوق على أحد من بني نوعك وإخوانك في عموم حالاتك وأزمانك\n فإنه من شيم أصحاب النخوة والكفران المورث لهم أنواع الخيبة والخسران وأصناف الخذلان والحرمان\n ولك أن تلازم التواضع والانكسار مع عموم المظاهر والمجالي\n والاعتزال عن مطلق أصحاب الجاه والاعتبار\n والقناعة مع الكفاف والعزلة\n\n\nجعلنا الله ممن تنبه على منهج الصدق والصواب\n واجتنب عما ينافيه بتوفيق الحق وتيسيره",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنَّ اللّهَ يعلمُ غيبَ السماوات والأرض } أي: ما غاب فيهما\n { والله بصير بما تعملون } في سِركم وعلانيتكم\n وهذا بيان لكونهم غير صادقين في دعواهم\n يعني: الله تعالى يعلم كل مستتر في العالَم\n ويُبصر كل عمل تعملونه في سِركم وعلانتيكم\n لا يخفى عليه منه شيء\n فكيف يخفى عليه ما في ضمائركم\n قال الورتجبي: ليس لله غيب\n إذ الغيب شيء مستور\n وجميع الغيوب عِيان لله تعالى\n وكيف يغيب عنه وهو موجده؟! يُبصرُ ببصره القديم ما كان وما لم يكن\n وهناك العلم والبصر واحد\n هـ\n قوله:\n \" العلم والبصر واحداً \" \nهذا على مذهب الصوفية في أن بصره يتعلق بالمعدوم\n كما يتعلق به العلم\n ومذهب علماء الكلام: أن متعلق البصر خاص بالموجودات\n فمتعلق العلم أوسع\n وانظر حاشية الفاسي على الصغرى\n الإشارة: كل مَن تمنى أن يعلم الناسُ ما عنده من العلم والسر يُقال له: أتُعلِّمون الله بدينكم\n والله يعلم ما في سموات القلوب والأرواح من السر واليقين\n وما في أرض النفوس من عدم القناعة بعلم الله\n والله بكل شيء عليم\n\nوفي الحكم: \" استشرافك أن يعلم الناس بخصوصيتك دليل على عدم صدقك في عبوديتك \"\n وكل مَن غلب عليه الجهل حتى مَنَّ على شيخِه بصُحبته له\n أو بما أعطاه\n يقال في حقه: { يمنون عليك أن أسلموا\n\n\n } الآية\n وقوله تعالى: { والله بصير بما تعملون } قال القشيري: فمَن لاحَظَ شيئاً من أعماله وأحواله فإن رآها من نفسه كان شِركاً\n وإن رآها لنفسه كان مكراً\n وإن رآها من ربه بربه كان توحيداً\n وفقنا الله لذلك بمنِّه وجوده\n هـ\n وصلّى الله على سيدنا محمد وآله وصحبه وسلّم تسليماً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:75",
      "similarity": 0.678024936857868
    },
    {
      "verse": "82:16",
      "similarity": 0.6397980859710761
    },
    {
      "verse": "53:35",
      "similarity": 0.5610261532831009
    },
    {
      "verse": "35:38",
      "similarity": 0.5541866219719691
    },
    {
      "verse": "59:22",
      "similarity": 0.5496711994789014
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/049018.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/049018.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/49:18.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}