{
  "chapter": "الحجرات",
  "text": "انما المؤمنون اخوة فاصلحوا۟ بين اخويكم واتقوا۟ الله لعلكم ترحمون",
  "translations": [
    {
      "translation": "The muminun are brothers, so make peace between your brothers and have taqwa of Allah so that hopefully you will gain mercy.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithful are surely brothers; so restore friendship among your brothers, and fear God that you may be favoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the believers are none but brothers unto one another, so set things right between your brothers, and have fear of Allah that you may be shown mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers are each other's brothers. Restore peace among your brothers. Have fear of God so that perhaps you will receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Muslims are brothers to each other, therefore make peace between your two brothers and fear Allah, so that you may gain mercy. (The entire Muslim nation is a single brotherhood, without any distinction for caste, creed or colour.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are but a brotherhood. So make reconciliation between your brothers, and have Taqwa of Allah that you may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are but brethren, therefore make peace between your brethren and be careful of (your duty to) Allah that mercy may be had on you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers indeed are brothers; so set things right between your two brothers, and fear God; haply so you will find mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are naught else than brothers. Therefore make peace between your brethren and observe your duty to Allah that haply ye may obtain mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely all believers are brothers. So make peace between your brothers, and fear God, so that mercy may be shown to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are but brethren; wherefore make reconciliation between your brethren and fear Allah, that haply ye may be shewn mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithful are indeed brothers. Therefore, make peace between your brothers and be wary of Allah, so that you may receive [His] mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Believers are but a single Brotherhood: So make peace and reconciliation between your two (contending) brothers; and fear Allah, that ye may receive Mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are nothing else than brothers (in Islamic religion). So make reconciliation between your brothers, and fear Allah, that you may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers are indeed brothers, therefore make things right among your two brothers and fear Allah, so that you will be subject to mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are brothers, so reconcile between your brothers, and remain conscious of God, so that you may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers are but brothers, so make settlement between your brothers. And fear Allah that you may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[49:10] The believers are indeed brothers, in religion. Therefore [always] make peace between your brethren, when they fall into dispute with one another (a variant reading [for the dual form akhawaykum, ‘your two brethren’] has ikhwatakum, ‘your brothers’) and fear God, so that perhaps you might receive mercy.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The believers are naught else than brothers) in religion. (Therefore make peace between your brethren) by means of the Book of Allah (and observe your duty to Allah) and fear Allah regarding that which He commands you regarding making peace (that haply ye may obtain mercy) and not be punished.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا تصلحون بينهما أيها المؤمنون المصلحون؛ { إِنَّمَا ٱلْمُؤْمِنُونَ } الموقنون بوحدة الحق، المصدقون لرسوله المبيِّن لطريق توحيده { إِخْوَةٌ } في الدين القويم { فَأَصْلِحُواْ بَيْنَ أَخَوَيْكُمْ } بالعدل والإنصاف { وَٱتَّقُواْ ٱللَّهَ } في صلاحكم هذا عن الميل والانحراف { لَعَلَّكُمْ تُرْحَمُونَ } [الحجرات: 10] لأجل عدالتكم وتقواكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنما المؤمنون إِخوةٌ } أي: منتسبون إلى أصل واحدٍ، وهو الإيمان المُوجب للحياة الأبدية، فيجب الاجتهاد في التآلف بينهما لتحقُّق الأخوة\n والفاء في قوله: { فأصْلِحوا بين أخوَيكم } للإيذان بأنّ الأخوة الدينية موجبة للإصلاح\n ووضع المظهر مقامَ المضمر مضافاً إلى المأمورين للمبالغة في تأكيد وجوب الإصلاح والتحضيض عليه، وتخصيص الاثنين بالذكر لإثبات وجوب الإصلاح فيما فوق ذلك بطريق الأَولى لتضاعف الفتنة والفساد فيه\n وقيل: المراد بالأخَويْن: الأوس والخزرج\n وقرأ يعقوب: \" إخوتكم \" بالجمع\n { واتقوا الله } فيما تأتون وتذرون، التي من جملتها: الإصلاحُ بين الناس { لعلكم تُرحمون } راجين أن تُرحموا على تقواكم، لأن التقوى تحملكم على التواصل والائتلاف، وهو سبب نزول الرحمة\n الإشارة: النفسُ الطبيعية والروح متقابلان، والحرب بينهما سِجال، فالنفس تريد السقوط إلى أرض الحظوظ والبقاء مع عوائدها، والروح تريد العروج إلى سماء المعارف وحضرة الأسرار، وبينما اتصال والتصاقٌ، فإن غلَبت النفسُ هبطت بالروح إلى الحضيض الأسفل، ومنعتها من العلوم اللدنية والأسرار الربانية، وإن غلبت الروح، عرجت بالنفس إلى أعلى عليين، بعد تزكيتها وتصفيتها، فتكسوها حُلةَ الروحانية، وينكشِف لها من العلوم والأسرار ما كان للروح، ولكلٍّ جندٌ تقابل به، فيقال من طريق الإشارة: وإن طائفتان من المؤمنين اقتتلوا فأصْلِحوا بينهما، بأن تؤخَذَ النفسُ بالسياسة شيئاً فشيئاً، يُنقص من حظوظها شيئاً فشيئاً، حتى تتزكى وتعالَجَ الروحُ لدخول الحضرة، وعكوف الهم في الذكر شيئاً فشيئاً، حتى تدخل الحضرة وهي لا تشعر، ثم تشعُر ويقع الاستغراق\n وأما إن قُطِعت النفسً عن جميع مألوفاتها مرةً واحدة، أو كُلفت الروحَ الحضورَ في الذكر على الدوام مرةً واحدة، أفسدتهما، لقوله صلى الله عليه وسلم:\n\n \" ادخلوا في هذا الدين برفق، فما شاد أحدكم الدين إلا غَلَبه \" \n\nوقال أيضاً:\n\n \" لا يكن أحدكم كالمُنْبتِّ، لا أرضاً قطع ولا ظهراً أبقى \" \n\nفإن بغت إحداهما على الأخرى فقاتِلوا التي تبغي، بأن تُردع النفس إن طغت، وتأخذ لجام الروح إن هاجت، حتى تفيء إلى أمر الله، وهو الاعتدال، فيعطي كلّ ذي حق حقه، ويُوفي كل ذي قسط قسطه\n وقوله تعالى: { إِنما المؤمنون إخوة } قال الورتجبي: افهَم أيها العاقل أن الله سبحانه خلق الأرواحَ المقدسةَ من عالَم الملكوت، وألبسها أنوارَ الجبروت فمواردُها من قُربه مختلفة، لكن عينها واحدة، وخلق هياكلَها وأشباحَها من تربة الأرض التي أخلصها من جملتها، وزيّنها بنور قدرته، ونفخ فيها تلك الأرواح، وجعل من الأرواح والأجسام النفوس الأمّارة التي ليست من قبيل الأرواح، ولا من قبيل الأجسام، وجعلها مخالفة للأرواح ومساكِنها، فأرسل الله عليها جندَ العقول، يدفع شَرَّها، فإذا امتحن الله عبادَه المؤمنين هيَّج نفوسهم الأمّارة ليُظهر حقائق درجاتهم من الإيمان، فأَمَرهم أن يُعينوا العقلَ والروحَ والقلبَ على النفس حتى تنهزم لأن المؤمنين كالبنيان يشُد بعضُهم بعضاً\n\n\nثم بيَّن أنّ في الإصلاح بين الإخوان الفلاح والنجاة، إذا كان مقروناً بالتقوى التي تقدسُ البواطن من البغي والحسد بقوله: { واتقوا الله لعلكم تُرحمون } فإذا فهِمت ما ذكرتُ علمتَ أنْ حقيقة الأخوة مصدر الاتحاد، فإنهم كنفسٍ واحدة لأن مصادرهم مصدر واحد، وهو آدم، ومصدر روح آدم نورُ الملكوت، ومصدرُ جسمه تربة الجنة في بعض الأقوال\n لذلك يصعد الروحُ إلى الملكوت، والجسم إلى الجنة، كما قال صلى الله عليه وسلم:\n\n \" كل شيء يرجع إلى أصل \" \n\nهـ\n قلت: صعود الروح إلى الملكوت هو شهود معاني الأسرار في دار الجنة، ونزول الجسم إلى الجنة هو تمتُّعه بنعيم حسها في عالم الأشباح، وكل ذلك بعد الموت، وأحسنُ العبارة أن يُقال: لأن مصادرَهم مصدر واحد، وهو بحر الجبروت، المتدفق بأنوار الملكوت، والوجود بأَسْره موجةٌ من بحر الجبروت\n ثم قال الورتجبي: قال أبو بكر النقاش: سألتُ الجنيد عن الأخ الحقيقي؟ فقال: هو أنت في الحقيقة، غير أنه غيرك في الهيكل\n قلت: يعني أن الناس في الحقيقة ذاتٌ واحدة، وما افترقوا إلا في الهياكل، فكلهم أخوة\n وقال أبو عثمان الحيري: أُخُوة الدين أثبت من أخوة النسب، فإن أخوة النسب تُقطع بمخالفة الدين، وأخوة الدين لا تقطع بمخالفة النسب\n هـ\n وتقدم لنا شروط الأخوة في قوله تعالى:\n\n[الزخرف: 67] الآية\n وقال القشيري هنا: ومن حق الأخوة ألا تُلجأه إلى الاعتذار، بل تُبسط عذرَه أي: تذكر عذره قبل أن يعتذر، فإن أُشكل عليك وجهه عُدت بالملامة على نفسك في خفاء عذره عليك، وتتوب عليه إذا أذنب، وتعوده إذا مرض، وإذا أشار عليك بشيء فلا تطالبه بالدليل وإيراد الحجة، كما أنشدوا:\n\nومن أَوْكد شروطها: التعظيم، كما أبان ذلك بقوله تعالى: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ لاَ يَسْخَرْ قَوْمٌ مِّن قَوْمٍ }\n\n",
      "translations": []
    }
  ]
}