{
  "chapter": "الحجرات",
  "text": "يايها الذين ءامنوا۟ لا ترفعوا۟ اصوتكم فوق صوت النبى ولا تجهروا۟ له بالقول كجهر بعضكم لبعض ان تحبط اعملكم وانتم لا تشعرون",
  "translations": [
    {
      "translation": "You who have iman! do not raise vour voices above the voice of the ProDhet and do not be as loud when speaking to him as you are when speaking to one another, lest your actions should come to nothing without your realising it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, do not raise your voices above the voice of the Prophet, and do not speak loudly to him as you do with one another lest your deeds are nullified unconsciously.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not raise your voices above the voice of the Prophet and when speaking to him do not speak aloud as you speak aloud to one another, lest all your deeds are reduced to nothing without your even realising it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not raise your voices above the voice of the Prophet, do not be too loud in speaking to him [as you may have been to one another], lest your deeds will be made devoid of all virtue without your realizing it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not raise your voices higher than the voice of the Prophet, nor speak to him loudly the way you shout to one another, lest your deeds go to waste whilst you are unaware. (Faith will go waste due to the slightest disrespect towards the Holy Prophet – peace and blessings be upon him. To honour him is part of faith. To disrespect him is blasphemy.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Raise not your voices above the voice of the Prophet, nor speak aloud to him in talk as you speak aloud to one another, lest your deeds should be thwarted while you perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! do not raise your voices above the voice of the Prophet, and do not speak loud to him as you speak loud to one another, lest your deeds became null while you do not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, raise not your voices above the Prophet's voice, and be not loud in your speech to him, as you are loud one to another, lest your works fail while you are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Lift not up your voices above the voice of the Prophet, nor shout when speaking to him as ye shout one to another, lest your works be rendered vain while ye perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not raise your voices above the voice of the Prophet, and do not speak as loudly when speaking to him as you do when speaking to one another, lest your actions come to nothing without your realizing it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye who believe raise not your voices above the voice of the prophet, nor shout loud Unto him in discourse as ye shout loud Unto one another, lest your works may be rendered of non-effect, while ye perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not raise your voices above the voice of the Prophet, and do not speak aloud to him like you shout to one another, lest your works should fail without your being aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Raise not your voices above the voice of the Prophet, nor speak aloud to him in talk, as ye may speak aloud to one another, lest your deeds become vain and ye perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Raise not your voices above the voice of the Prophet (SAW), nor speak aloud to him in talk as you speak aloud to one another, lest your deeds may be rendered fruitless while you perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not raise your voices above the voice of the Prophet, nor speak loudly to him as you do to one another lest your works should be annulledwithout your knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not raise your voices above the voice of the Prophet, and do not speak loudly to him, as you speak loudly to one another, lest your works be in vain without you realizing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not raise your voices above the voice of the Prophet or be loud to him in speech like the loudness of some of you to others, lest your deeds become worthless while you perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[49:2] The following was revealed regarding those who raised their voices in the presence of the Prophet (s): O you who believe, do not raise your voices — when you [want to] speak — above the voice of the Prophet, when he is speaking, and do not shout words at him, when you [wish to] confide in him, as you shout to one another, but [speak] lower than that, out of reverence for him, lest your works should be invalidated without your being aware, that is to say, for fear of this [happening] as a result of the raising of voices and the shouting mentioned.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe!) This was revealed about Thabit Ibn Qays Ibn Shammas who raised his voice in the presence of the Messenger of Allah (pbuh) upon the visit of the delegation of Banu Tamim. And so Allah forbade him from doing so. Allah said: you who believe in Muhammad (pbuh) and the Qur'an; in reference to Thabit, (Lift not up your voices above the voice of the Prophet) Allah bless him and give him peace, nor insist in talking when the Prophet (pbuh) is talking, (nor shout when speaking to him) nor call him by his first name (as ye shout one to another) as you would do with one another; rather you should reverence and honour him and address him by: \"O Prophet of Allah\" or \"0 Messenger of Allah\" or \"0 Abu'l-Qasim\", (lest your works be rendered vain while ye perceive not) lest your good works be nullified for failing to observe propriety and reverence towards the Prophet (pbuh) while not knowing that your works are nullified.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بل { وَ } عليكم أن { لاَ تَجْهَرُواْ لَهُ } صلى الله عليه وسلم { بِٱلْقَوْلِ } مطلقاً { كَجَهْرِ بَعْضِكُمْ لِبَعْضٍ } إذ الجهر بالقول معه مخل لحرمته وتعظيمه\n وإنما نهاكم سبحانه عنه\n كراهة { أَن تَحْبَطَ } وتضيع { أَعْمَالُكُمْ } أي: الصالحات منها { وَأَنتُمْ لاَ تَشْعُرُونَ } [الحجرات: 2] إحباطها وضياعها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا تجهروا له بالقول } إذا كلّمتموه { كجَهْرِ بعضِكم لبعضٍ } أي: جهراً كائناً كالجهر الجاري فيما بينكم\n بل اجعلوا أصواتكم أخفض من صوته\n واختاروا في مخاطبته القول اللين القريب من الهمس\n كما هو الدأب في مخاطبة المهابِ المُعظّم\n وحافظوا على مراعاة هيبة النبوة وجلالة مقدارها\n وقيل: معنى: { لا تجهروا له بالقول كجهر بعضكم لبعض }: لا تقولوا: يا محمد\n يا أحمد\n بل: يا رسول الله\n يا نبي الله\n ولمّا نزلت هذه الآية ما كلّم رسولَ الله صلى الله عليه وسلم أبو بكر إلا كأخي السِّرار\n وعن ابن عباس رضي الله عنه: أنها نزلت في ثابت بن قيس بن شمَاس\n وكان في أذنيه وَقْر\n وكان جَهْوَريَّ الصوت\n وكان إذا تكلم رفع صوته\n وربما كان يكلّم النبيَّ صلى الله عليه وسلم فيتأذّى من صوته\n هـ\n والصحيح ما تقدّم\n وفي الآية أنهم لم يُنهوا عن الجهر مطلقاً\n وإنما نُهوا عن جهرٍ مخصوص\n أي: الجهر المنعوت بمماثلة ما اعتادوه فيما بينهم\n وهو الخلوّ عن مراعاة هيبة النبوة\n وجلالة مقدارها\n وقوله: { أن تحبط أعمالُكم } مفعول من أجله\n أي: لا تجهروا خشية أن تحبط أعمالكم\n { وأنتم لا تشعرون } فإنَّ سوء الأدب ربنا يؤدي بصاحبه إلى العطب وهو لا يشعر\n ولمّا نزلت الآية جلس ثابت بن قيس في بيته ولم يخرج\n فتَفقَّده صلى الله عليه وسلم\n فدعاه فسأله\n فقال: يا رسول الله لقد أُنزلت عليك هذه الآية\n وإني رجل جهير الصوت\n فأخاف أن يكون عملي قد حبط\n فقال له صلى الله عليه وسلم:\n \" لست هناك\n تعيش بخير\n وتموت بخير\n وإنك من أهل الجنة \"\n \nوأما ما يُروى عن الحسن: أنها نزلت في المنافقين\n الذي كانوا يرفعون أصواتهم فوق صوته صلى الله عليه وسلم فقد قيل: محْمله: أنّ نهيهم مندرج تحت نهي المؤمنين بدليل النص",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "31:19",
      "similarity": 0.3056978267382888
    },
    {
      "verse": "49:3",
      "similarity": 0.2788793131270565
    },
    {
      "verse": "71:8",
      "similarity": 0.25299231964863733
    },
    {
      "verse": "4:148",
      "similarity": 0.25013771187372497
    },
    {
      "verse": "3:22",
      "similarity": 0.24919205951548792
    }
  ]
}