{
  "chapter": "الحجرات",
  "text": "ان الذين يغضون اصوتهم عند رسول الله او۟لئك الذين امتحن الله قلوبهم للتقوى لهم مغفرة واجر عظيم",
  "translations": [
    {
      "translation": "Those who lower their voices when they are with the Messenger of Allah are people whose hearts Allah has tested for taqwa. They will have forgiveness and an immense reward.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They who speak in a low voice in the presence of God's Apostle, have had their hearts tried by God for reverence. There is forgiveness for them and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ones who lower their voices in the presence of the Messenger of Allah are those whose hearts Allah has tested for God-fearing. Theirs shall be forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hearts of those who lower their voices in the presence of the Messenger of God are tested by God through piety. They will have forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who suppress their voices in the presence of Allah’s Noble Messenger, are the ones whose hearts Allah has tested for piety; for them is forgiveness, and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who lower their voices in the presence of Allah's Messenger, they are the ones whose hearts Allah has tested for Taqwa. For them is forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who lower their voices before Allah's Apostle are they whose hearts Allah has proved for guarding (against evil); they shall have forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who lower their voices in the presence of God's Messenger, those are they whose hearts God has tested for godfearing; they shall have forgiveness and a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! they who subdue their voices in the presence of the messenger of Allah, those are they whose hearts Allah hath proven unto righteousness. Theirs will be forgiveness and immense reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who lower their voices in the presence of God's Messenger are men whose hearts God has tested for piety, they shall have forgiveness and a great reward,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who lower their voices in the presence of the apostle of Allah -those are they whose hearts Allah hath disposed Unto piety: theirs will be forgiveness and a mighty hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who lower their voices in the presence of the Apostle of Allah—they are the ones whose hearts Allah has tested for Godwariness. For them will be forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those that lower their voices in the presence of Allah's Messenger,- their hearts has Allah tested for piety: for them is Forgiveness and a great Reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! Those who lower their voices in the presence of Allah's Messenger (SAW), they are the ones whose hearts Allah has tested for piety. For them is forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who lower their voice in the presence of the Messenger of Allah are those whose hearts Allah has tested for warding off (evil). They shall receiveforgiveness and a great wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who lower their voices before God’s Messenger—those are they whose hearts God has tested for piety. They will have forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who lower their voices before the Messenger of Allah - they are the ones whose hearts Allah has tested for righteousness. For them is forgiveness and great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[49:3] The following was revealed regarding those who used to lower their voices in the presence of the Prophet (s), such as Abū Bakr, ‘Umar and others, may God be pleased with [all of] them: Truly those who lower their voices in the presence of God’s Messenger — they are the ones whose hearts God has tested for Godfearing, that is to say, [He has tested them] so that this [fear of God] may manifest itself in them. For them will be forgiveness and a great reward: Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! they who subdue their voices) this also was revealed about Thabit Ibn Qays Ibn Shammas after he was prohibited from raising his voice (in the presence of the Messenger of Allah) Allah bless him and give him peace, praising him for lowering his voice in the presence of the Prophet (pbuh) saying: they who subdue their voice in the presence of the Messenger of Allah (those are they whose hearts Allah hath proven) those are they whose hearts Allah has cleansed and purified (unto righteousness) from sin; it is also said that this means: those are they whose hearts Allah has made sincere to the profession of Allah's divine Oneness. (Theirs will be forgiveness) of their sins in the life of the world (and immense reward) and abundant reward in the Garden.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أُوْلَـٰئِكَ ٱلَّذِينَ ٱمْتَحَنَ ٱللَّهُ قُلُوبَهُمْ لِلتَّقْوَىٰ } معناه اصطَفاهُم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Those are the ones whose hearts Allah has tested for taqwa} - meaning that He has chosen them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { إِنَّ } المؤمنين المحسنين { ٱلَّذِينَ يَغُضُّونَ } ويحفظون { أَصْوَاتَهُمْ عِندَ رَسُولِ ٱللَّهِ } مراعاة لتعظيمه\n وحفظاً للأدب معه { أُوْلَـٰئِكَ } السعداء المقبولون\n هم { ٱلَّذِينَ ٱمْتَحَنَ ٱللَّهُ } المجرب لإخلاص عباده { قُلُوبَهُمْ } التي هي وعاء الإخلاص والإيمان ليجعلها مقراً { لِلتَّقْوَىٰ } المثمرة لأنواع اللذات الروحانية { لَهُم مَّغْفِرَةٌ } ستر وعفو عن مقتضيات بشريتهم { وَأَجْرٌ عَظِيمٌ } [الحجرات: 3] هو تحققهم بمقام الرضا والتسليم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنَّ الذين يَغُضُّون أصواتَهم عند رسول الله } أي: يخفضون أصواتهم في مجلسه\n تعظيماً له\n وانتهاءً عما عنه\n { أولئك الذين امتحن اللّهُ قلوبَهم للتقوى } أي: أخلصها وصفَّاها\n من قولهم: امتحن الذهب وفَتَنه: إذا أذابه\n وفي القاموس: محنَه\n كمنعه: اختبره\n كامتحنه\n ثم قال: وامتحن القول: نَظَرَ فيه ودبّره\n والله قلوبَهم: شرحها ووسّعها\n وفي الأساس: ومن المجاز: محنَ الأديمَ: مدّده حتى وسعه\n وبه فسّر قوله تعالى: { امتحن اللّهُ قلوبَهم للتقوى } أي: شرحها ووسعها\n { لهم مغفرة وأجرٌ عظيمٌ } أي: مغفرة لذنوبهم\n وأجر عظيم: نعيم الجنان\n\nالإشارة: على هذه الآية والتي بعدها اعتمد الصوفية فيما دوَّنوه من آداب المريد مع الشيخ\n وهي كثيرة أُفردت بالتأليف\n وقد جمع شيخنا البوزيدي الحسني رضي الله عنه كتاباً جليلاً جمع فيه من الآداب ما لم يُوجد في غيره\n فيجب على كل مريد طالب للوصول مطالعتُه والعملُ بما فيه\n والذي يُؤخذ من الآية: أنه لا يتقدم بين يدي شيخه بالكلام\n لا سيما إذا سأله أحدٌ\n فمِن الفضول القبيح أن يسبق شيخَه بالجواب\n فإنَّ السائل لا يرضى بجواب غير الشيخ\n مع ما فيه من إظهار علمه\n وإشهار شأنه\n والتقدم على شيخه\n ومن ذلك أيضاً: ألاَّ يقطع أمراً دون مشورته\n ما دام تحت الحجرية\n وألاَّ يتقدم أمامه في المشي إلا بإذنه\n وأن يغضّ صوته عند حضوره\n بل لا يتكلم إلا أن يأذن له في الكلام\n ويكون بخفض صوت وتعظيم\n قلت: وما زالت أشياخنا تأمرنا بالتكلم عند المذاكرة إذ بالكلام تُعرف أحوال الرجال\n وسَمِعتُ شيخ شيخنا\n مولاي العربي الدرقاوي الحسني رضي الله عنه يقول: حُكّونا في المذاكرة ليظهر العلم\n وكونوا معنا كما قال القائل: حك لي نربل لك\n لا كما قال القائل: سَفِّجْ لي نعسل لك\n هـ\n لكن يكون بحثُه مع الشيخ على وجه الاسترشاد والاستعلام\n من غير معارضة ولا جدال\n وإلا وإلا فالسكوت أسلم\n قال القشيري: { لا تُقدّموا بين يَدي الله ورسوله } لا تعملوا في أمر الدين من ذات أنفسكم شيئاً\n وقُفوا حيثما وُقِفْتم\n وافعلوا ما به أُمِرْتُم\n أي: اعملوا بالشرع لا بالطبع في طلب الحق\n وكونوا من أصحاب الاقتداء والاتباع\n لا من أرباب الابتداء أو الابتداع\n وقال في قوله تعالى: { لا ترفعوا أصواتَكم\n\n\n } الآية\n يُشير إلى أنه من شرط المؤمن: ألا يرى رأيَه وعقلَه واختيارَه فوق رأي النبي والشيخ\n ويكون مستسلماً لرأيه\n ويحفظ الأدب في خدمته وصحبته\n { ولا تجهرا له بالقول كجهر بعضكم لبعض } أي: لا تخاطبوه كخطاب بعضكم لبعض\n بل خاطبوه بالتعظيم والتبجيل\n ولا تنظروا إليه بالعين التي تنظرون إلى أمثالكم\n وإنه لحُسْن خُلقه قد يُلاعبكم\n فلا تنبسطوا معه\n متاجسرين عليه بما يُعاشركم من خُلقه\n ولا تَبدأوه بحديث حتى يُفاتحكم\n أن تحبط أعمالكم بسوء أدبكم\n وأنتم لا تشعرون\n إنَّ الذين يغضون أصواتهم عند رسول الله وعند شيخه أولئك الذين امتحن الله قلوبهم للتقوى\n أي: انتزع عنها حبّ الشهوات\n وصفّاها من دنس سوءِ الأخلاق\n وتخلقت بمكارم الأخلاق\n حتى انسلختْ من عادات البشرية\n هـ\n وقال في القوت: الوقاية مقرونة بالنصرة فإذا تولاَّه نَصَره على أعدائه\n وأعْدى عدُوه نفْسُه\n فإذا نَصَره عليها\n أخرج الشهوة منها\n فامتحنَ قلبَه للتقوى\n ومحّض نفسَه\n فخلّصها من الهوى\n هـ\n ثم ذكر مَن لم يستعمل الأدب مع الحضرة النبوية\n فقال: { إِنَّ ٱلَّذِينَ يُنَادُونَكَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "60:10",
      "similarity": 0.5581554461786125
    },
    {
      "verse": "31:19",
      "similarity": 0.48589668889203186
    },
    {
      "verse": "24:30",
      "similarity": 0.3410216654760442
    },
    {
      "verse": "49:2",
      "similarity": 0.2788793131270565
    },
    {
      "verse": "17:64",
      "similarity": 0.1767546079177437
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/049003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/049003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/49:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}