{
  "chapter": "الحجرات",
  "text": "ان الذين ينادونك من وراء الحجرت اكثرهم لا يعقلون",
  "translations": [
    {
      "translation": "Many of those who call you from outside the apartments are not considerate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely most of those who call out to you, (O Prophet), from behind the apartments, are devoid of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most of those who call you from behind the private chambers do not have any understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed most of those who call you from outside the chambers do not have sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who call you from behind the dwellings, most of them have no sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who call out to you from behind the private chambers, surely most of them do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who call unto thee from behind the apartments, the most of them do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who call thee from behind the private apartments, most of them have no sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who call out to you from outside your apartments are lacking in understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who call aloud Unto thee from without the inner apartments, most of them reflect not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who call you from behind the apartments, most of them do not use their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who shout out to thee from without the inner apartments - most of them lack understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! Those who call you from behind the dwellings, most of them have no sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whereas those who call out to you from behind the apartments, most of them lack understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who call you from behind the chambers—most of them do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who call you, [O Muhammad], from behind the chambers - most of them do not use reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[49:4] The following was revealed regarding a group of people who came to see the Prophet (s) during the midday [resting] period while he was in his house, and called out to him: Truly those who call you from behind the apartments, the [private] chambers of his womenfolk (hujurāt is the plural of hujra, which is an area of ground on which stones are laid [yuhjaru ‘alayhi] to form a wall or the like), and it happened that each one   of them called out, in that rough and crude Bedouin manner, from behind one of the apartments, as they did not know in which apartment he was, most of them do not understand, given the way in which they acted, your exalted status and the reverence that befits it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who call thee from behind the private apartment) this was revealed about a folk from Banu 'Anbar, from the Khuza'ah tribe to whom the Prophet (pbuh) sent a military expedition under the leadership of 'Uyaynah Ibn Hisn al-Fazari. When they heard of the advance of this expedition towards them, they fled, leaving behind their wives and children and properties. Their wives and children were taken captive and brought to the Prophet (pbuh). The men who fled went to Medina to ransom their wives and children and entered the city at the time of the siesta. They called: \"0 Muhammad, come out to see us\", while he was 601 sleeping. Allah censured them for doing so, saying: (Lo! those who call you from behind the private apartment most of them) all of them (have no sense) do not understand Allah's command or divine Oneness nor the reverence due to Allah's Messenger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على مقتضى سنته المستمرة: { إِنَّ } المسرفين المسيئين { ٱلَّذِينَ يُنَادُونَكَ } يا أكمل الرسل { مِن وَرَآءِ ٱلْحُجُرَاتِ } حين كنت مستريحاً في خلوتك، فارغاً همَّك عن مقتضيات النبوة، متوجهاً إلى ربك حسب ولايتك { أَكْثَرُهُمْ لاَ يَعْقِلُونَ } [الحجرات: 4] ولا يفهمون منزلتك عند ربك، ولا يتفطنون بخوتك معه واستغراقك بمطالعة وجهه الكريم؛ إذ لو كان لهم عقل يوقظهم من مقام الغفلة ويرشدهم ألبتة إلى مراعاة الأدب معك يا أكمل الرسل\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنَّ الذين يُنادونك من وراء الحجرات } من خارجها، أو: من خلفها، أو: من أمامها، فالوراء: الجهةُ التي تُواري عنك الشخص تُظلّله من خلف أو من قُدّام، و \" مِن \" لابتداء الغاية، وأنّ المناداة نشأت من ذلك المكان، والحجرة: الرقعة من الأرض، المحجورة بحائطٍ يحوط عليها، فعْلة، بمعنى مفعولة، كالقُبْضَة، والجمع: حُجُرات، بضمتين، وبفتح الجيم، والمراد: حجرات النبي صلى الله عليه وسلم، وكان لكل امرأة حُجرة\n نزلت في وفد بني تميم، وكانوا سبعين، وفيهم عينيةُ بن حِصنُ الفزاري، والأقرعُ بن حابس، وفَدوا على النبي صلى الله عليه وسلم وقت الظهيرة، وهو راقد، فنادوا رسولَ الله صلى الله عليه وسلم من وراء حجراته، وقالوا: اخرجْ إلينا يا محمدُ فإنَّ مَدْحَنَا زَيْنٌ، وذمّنا شيْن، فاستيقظ، وخرج عليه السلام وهو يقول:\n\n \" ذلكم الله الذي مدحُه زين، وذمّه شين \" \n\n، فقالا: نحن قوم من بني تميم، جئنا بشاعرنا وخطيبنا، لنُشاعركَ، ونُفاخرك، فقال صلى الله عليه وسلم:\n\n \" ما بالشعر بُعثت، ولا بالفخار أُمرت \" \n\n، ثم أمر صلى الله عليه وسلم خطيبهم فتكلّم، ثم قال لثابت بن قيس بن شماس - وكان خطيب النبي صلى الله عليه وسلم: قم، فقام، فخطب، فأقحم خطيبَهم، ثم قام شاب منهم، فأنشأ يقول:\n\nفقال صلى الله عليه وسلم لحسّان: قم فأجبه، فقال:\n\nثم قال الأقرع شعراً افتخر به، فقال عليه السلام لحسّان: قم فأجبه، فقال حسّان:\n\nفقال صلى الله عليه وسلم:\n\n \" لقد كنتَ غنياً عن هذا يا أخا بني دارم أن يذكر منك ما قد ظننت أن الناس قد نسوه \" \n\n، ثم قال الأقرعُ: تكلم خطيبُنا، فكان خطيبهُم أحسن قِيلاً، وتكلم شاعرُنا فكان شاعِرُهم أشعر\n هـ\n هذا ومناداتُهم من وراء الحجرات إما لأنهم أتَوْها حجرةً حجرة، فنادوه صلى الله عليه وسلم من ورائها، أو: بأنهم تفرقوا على الحجرات متطلبين له صلى الله عليه وسلم، أو: نادوه من وراء الحجرة التي كان فيها، ولكنها جُمعت إجلالاً لرسول الله صلى الله عليه وسلم\n وقيل: الذي ناداه عُيينةُ بن حصن والأقرعُ، وإنما أُسند إلى جميعهم لأنهم راضون بذلك وأَمروا به\n { أكثرُهم لا يعقلون } إذ لو كان لهم عقل لَمَا تجاسروا على هذه العظيمة من سوء الأدب\n\n",
      "translations": []
    }
  ]
}