{
  "chapter": "الحجرات",
  "text": "ولو انهم صبروا۟ حتى تخرج اليهم لكان خيرا لهم والله غفور رحيم",
  "translations": [
    {
      "translation": "If they had only been patient until you came out to them, it would have been better for them. But Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they had waited for you to come out it would have been better for them. But God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they were patient until you went out to them, that would have been better for them. Allah is Most Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had they exercised patience until you had come out, it would have been better for them. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had they been patient until you yourself came out to them, it would be better for them; and Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they had patience till you could come out to them, it would have been better for them. And Allah is Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they wait patiently until you come out to them, it would certainly be better for them, and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they had patience, until thou comest out to them, that would be better for them; and God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they had had patience till thou camest forth unto them, it had been better for them. And Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they waited patiently until you came out to see them, it would be better for them. But God is forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had they had patience till thou camest forth Unto them, it had surely been best for them; and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had they been patient until you came out for them, it would have been better for them, and Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only they had patience until thou couldst come out to them, it would be best for them: but Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they had patience till you could come out to them, it would have been better for them. And Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they had patience until you went out to them, it would have been better for them. But Allah is the Forgiving and the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had they remained patient until you came out to them, it would have been better for them. But God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they had been patient until you [could] come out to them, it would have been better for them. But Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[49:5] And had they been patient (annahum, ‘they’, has independent status, on account of inceptiveness; alternatively, it is said to govern an implied verb such as thabata, ‘had [their patience] been maintained’) until you came out to them, it would have been better for them; and God is Forgiving, Merciful, to those of them who repent.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if they) the Banu 'Anbar (had patience till thou earnest forth unto them) for the prayer, (it had been better for them) he would have freed all their wives and children; instead he freed half of them and agreed the ransom of the remaining half. (And Allah is Forgiving) He forgives whoever repents of them, (Merciful) in that He did not hasten His punishment on them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { لَوْ أَنَّهُمْ صَبَرُواْ } حين احتياجهم إليك وإرادتهم صحبتك { حَتَّىٰ تَخْرُجَ إِلَيْهِمْ } لهدايتهم وإرشادهم بمقتضى شفقة النبوة { لَكَانَ خَيْراً لَّهُمْ } وأولى من مبادرتهم واستعجالهم إلى النداء { وَٱللَّهُ } المطلع بما في ضمائرهم من الإخلاص { غَفُورٌ } يغفر زلتهم إن وقعت منهم أحياناً { رَّحِيمٌ } [الحجرات: 5] يرحمهم إن كانوا من ذوي الإخلاص مع الله ورسوله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ ولو أنهم صبروا } أي: ولو تحقق صبرُهم وانتظارُهم، فمحل { أنهم صبروا } رفعٌ على الفاعلية لأنَّ \" أنْ \" تسبك بالمصدر، لكنها تفيد التحقق والثبوت، للفرق بين قولك: بلغني قيامك، وبلغني أنك قائم، و \" حتى \" تُفيد أن الصبر ينبغي أن يكون مُغَيّاً بخروجه عليه السلام، فإنها مختصة بالغايات\n والصبرُ\n حبسُ النفس على أن تُنازع إلى هواها وقيل: \" الصبر مرٌّ، لا يتجرعه إلا حُرٌّ \"\n أي: لو تأنوا حتى تخرج إليهم بلا مناداة لكان الصبرُ خيراً لهم من الاستعجال، لِما فيه من رعاية حسن الأدب، وتعظيمِ الرسول، الموجبتين للثناء والثواب، والإسعاف بالمسؤول إذ رُوي أنهم وفدوا شافعين في أسارى بني العَنبر، وذلك أنه صلى الله عليه وسلم بعث سريةً إلى حي بني العنبر، وأمّرَ عليهم عُيينة بن حِصن، فهربوا وتركوا عيالهم، فسباهم عُيينة، ثم قَدِم رجالُهم يَفْدون الذراري، فلما رأتهم الذراريُّ أجهشوا إلى آبائهم يَبْكون، فعَجلوا أن يخرج إليهم النبي صلى الله عليه وسلم، فنادَوْه حتى أيقظوه من نومه، فخرج إليهم، فأطلق النصف وفادى النصف، { والله غفور رحيم } بليغ المغفرة والرحمة واسعهما، فلن يضيق ساحتُهما عن هؤلاء إن تابوا وأصلحوا\n الإشارة: من آداب المريد ألاَّ يُوقظ شيخَه من نومه، ولو بقي ألف سنة ينتظره، وألاَّ يطلب خروجَه إليه حتى يخرجَ بنفسه، وألاَّ يقف قُبالة باب حجرته لئلا يرى بعض محارمه\n ومن آدابه أيضاً: ألا يبيت معه في مسكن واحد، وألا يأكل معه، إلا أن يعزم عليه، وألا يجلس على فراشِه أو سجّادته إلا بأمره، وإذا تعارض الأمر والأدب، فهل يُقدّم الأمر أو الأدب؟ خلاف، وقد تقدم في صلاح الحديبية: أن سيدنا عليّاً - كرّم الله وجهه - قدَّم الأدب على الأمر، حين قال له صلى الله عليه وسلم:\n\n \" امح اسم رسول الله من الصحيفة \" \n\n، فأبى، وقال:\n\n \" والله لا أمحوا أبداً \" \n\nوالله تعالى أعلم\n ومن جملة الأدب: التأني في الأمور وعدمُ العَجَلةِ، كما أبان ذلك بقوله تعالى: { يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ إِن جَآءَكُمْ فَاسِقٌ بِنَبَإٍ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:109",
      "similarity": 0.5145680762385523
    },
    {
      "verse": "23:118",
      "similarity": 0.43580072710074724
    },
    {
      "verse": "7:87",
      "similarity": 0.42362207447052874
    },
    {
      "verse": "16:126",
      "similarity": 0.3869756538753646
    },
    {
      "verse": "74:7",
      "similarity": 0.37134669067897996
    }
  ]
}