{
  "chapter": "الحجرات",
  "text": "يايها الذين ءامنوا۟ ان جاءكم فاسقۢ بنبا فتبينوا۟ ان تصيبوا۟ قومۢا بجهلة فتصبحوا۟ على ما فعلتم ندمين",
  "translations": [
    {
      "translation": "You who have iman! if a deviator brings you a report, scrutinize it carefully in case you attack people in ignorance and so come to greatly regret what you have done.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, if a dissolute person brings some news, verify it first lest you attack a people ignorantly and later regret what you had done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when an ungodly person brings to you a piece of news, carefully ascertain its truth, lest you should hurt a people unwittingly and thereafter repent at what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if one who publicly commits sins brings you any news, ascertain its truthfulness carefully, lest you harm people through ignorance and then regret what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! If any miscreant brings you some tidings, verify it, lest you unknowingly cause suffering to some people, and then remain repenting for what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If a rebellious evil person comes to you with a news, verify it, lest you harm people in ignorance, and afterwards you become regretful to what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! if an evil-doer comes to you with a report, look carefully into it, lest you harm a people in ignorance, then be sorry for what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, if an ungodly man comes to you with a tiding, make clear, lest you afflict a people unwittingly, and then repent of what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! If an evil-liver bring you tidings, verify it, lest ye smite some folk in ignorance and afterward repent of what ye did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if an evil-doer brings you news, ascertain the correctness of the report fully, lest you unwittingly harm others, and then regret what you have done,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "ye who believe! if an evil-doer Came Unto you with a report, then inquire strictly, lest ye hurt a people in ignorance and repent thereafter of that which ye have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! If a vicious character brings you some news, verify it, lest you should visit [harm] on some people out of ignorance, and then become regretful for what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! If a wicked person comes to you with any news, ascertain the truth, lest ye harm people unwittingly, and afterwards become full of repentance for what ye have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If a rebellious evil person comes to you with a news, verify it, lest you harm people in ignorance, and afterwards you become regretful to what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if an evildoer brings you a piece of news, inquire first, in case you should unwittingly wrong others and then repent of what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If a troublemaker brings you any news, investigate, lest you harm people out of ignorance, and you become regretful for what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, if there comes to you a disobedient one with information, investigate, lest you harm a people out of ignorance and become, over what you have done, regretful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[49:6] The following was revealed regarding al-Walīd b. ‘Uqba whom the Prophet had sent to the Banū al-Mustaliq in order to ascertain [their loyalty to Islam]. He already feared them on account of an old feud between him and them from the time of pagandom [before Islam], and so [upon seeing them come out to him] he returned and claimed that they had refused to give the voluntary alms and intended to kill him. And just as the Prophet (s) was making plans to raid them, they came to him to disavow what he [al-Walīd] had said about them: O you who believe, if a reprobate should come to you with some tiding, some piece of information, verify [it], [ascertain] his truthfulness from his mendacity (fa-tabayyanū: a variant reading has fa-tathabbatū, from al-thabāt, ‘to ascertain’), lest you injure a folk (an tusībū qawman, an object denoting reason), that is to say, for fear of this [happening], out of ignorance (bi-jahālatin is a circumstantial qualifier referring to the subject [of the verb]), that is to say while you are ignorant; and then become remorseful of what you have perpetrated, erroneously against that folk. After they had returned to their homelands, the Prophet (s) sent Khālid [b. al-Walīd] to them, who observed only obedience and goodness in them and [later] informed the Prophet of this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe! If an evil-liver) this was revealed about al-Walid Ibn 'Uqbah Ibn Ma'it who was sent by the Prophet (pbuh) to Banu'l-Mustaliq to collect their alms; instead he came back claiming that they wanted to kill him. The Prophet (pbuh) and his Companions were about to set forth to conquer them but Allah forbade them from doing so, saying: you who believe in Muhammad (pbuh) and the Qur'an if a hypocrite, al-Walid Ibn 'Uqbah, (bring you tidings) brings you news about Banu'l-Mustaliq, (verify it) check whether the news are true or false, (lest ye smite some folk in ignorance and afterward repent of what ye did) regret killing them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فعليكم { إِن جَآءَكُمْ فَاسِقٌ } منحرف عن عدالة الإيمان والتوحيد { بِنَبَإٍ } وخبر على سبيل الافتراء والمراء { فَتَبَيَّنُوۤاْ } أي: تعرَّفوا وتفحَّصوا واستكشفوا عنه\n ولا تبادروا إلى تصديقه\n كراهة { أَن تُصِيبُواْ قَوْمًا } أذية وسوءاً بمجرد الظن الكاذب\n مع أنكم { بِجَهَالَةٍ } أي: جاهلين بحاله { فَتُصْبِحُواْ } وتصيروا بعدما تصيبوا القوم البريء { عَلَىٰ مَا فَعَلْتُمْ } من أذياتهم { نَادِمِينَ } [الحجرات: 6] محزونين مغتمين\n كلما تذكرتهم تغممتم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الذين آمنوا إِن جاءكم فاسق بنبأٍ } نزلت في الوليد بن عُبة بن أبي مُعَيْط\n وكان من فضلاء الصحابة رضي الله عنهم بعثه النبي صلى الله عليه وسلم إلى بني المُصْطلِق\n بعد الوقعة مصدِّقاً\n وكان بينه وبينهم عداوة في الجاهلية\n فخرجوا يتلقّونه\n تعظيماً النبي صلى الله عليه وسلم\n فظنّ أنهم مقاتلوه فرجع\n وقال لرسول الله صلى الله عليه وسلم: قد ارتدُّوا ومنعوا الزكاة\n فَهمَّ صلى الله عليه وسلم أن يغزوهم\n ثم أتوا النبيَّ صلى الله عليه وسلم وأخبروه أنهم إنما خرجوا يتلقّونه تكرمةً فاتهمهم النبي صلى الله عليه وسلم وبعث إليهم \" خالد بن الوليد \" خفيةً مع عسكر\n وأمره أن يُخفي عليهم قدومَه\n ويتطلعَ عليهم\n فإن رأى ما يدلّ على إيمانهم أخذ زكاتهم ورجع\n وإن رأى غير ذلك استَعمل فيهم ما يُستعمل في الكفار\n فسمع خالدُ فيهم آذان صلاتي المغرب والعشاء\n فأخذ صدقاتهم\n ولم يرَ منهم إلا الطاعة\n فنزلت الآية\n وسُمِّي الوليد فاسقاً لعدم تَثَبُّته فخرج بذلك عن كمال الطاعة\n وفي تسميته بذلك زجرٌ لغيره\n وترغيبٌ له في التوبة\n والله تعالى أعلم بغيبه\n حتى قال بعضهم: إنها من المتشابه\n لِمَا ثبت من تحقُّق إيمان الوليد\n وقال أبو عمر في الاستيعاب: لا يصح أن الآية نزلت في قضية الوليد لأنه كان في زمن النبي صلى الله عليه وسلم من ثمانية أعوام\n أو من عشرة\n فكيف يبعثه رسولاً؟! هـ\n قلت: لا غرابةَ فيه\n وقد كان صلى الله عليه وسلم يُؤَمِّر أسامةَ بن زيد على جيش\n فيه أبو بكر وعمر\n مع حداثة سِنِّه\n كما في البخاري وغيره\n وفي تنكير فاسق و نبأ شِياعٌ في الفُسَّاق والأنباء\n أي: إذا جاءكم فاسقٌ أيّ فاسقٍ كان\n بأيِّ خبر { فتبَيَّنوا } أي: فتوقفوا فيه\n وتطلَّبوا بيان الأمر وانكشافَ الحقيقة\n ولا تعتمدوا قولَ مَن لا يتحرّى الصدق\n ولا يتحامى الكذب\n الذي هو نوع من الفسوق\n وفي الآية دليل على قبول خبر الواحد العَدل لأنا لو توقفنا في خبره لسوّينا بينه وبين الفاسق\n ولخلا التخصيص به عن الفائدة\n وقرأ الأخوان: \" فثبتوا \" والتثبُّت والتبيُّن متقاربان\n وهما: طلبُ الثبات والبيان والتعرُّف\n { أن تُصيبوا } أي: لئلا تصيبوا { قوماً بجهالةٍ } حال\n أي: جاهلين بحقيقة الأمر وكُنه القصة\n { فتُصْبِحوا } فتصيروا { على ما فعلتم نادمين } مغتمِّين على ما فعلتم\n متمنين أنه لم يقع\n والندم: ضرب من الغلم وهو أن يَغتم على ما وقع\n يتمنى أنه لم يقع\n وهو غم يصحبُ الإنسان صحبةً لها دوامٌ في الجملة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:40",
      "similarity": 0.7089115519400868
    },
    {
      "verse": "26:157",
      "similarity": 0.5814948508751044
    },
    {
      "verse": "5:52",
      "similarity": 0.5215048387418172
    },
    {
      "verse": "10:54",
      "similarity": 0.47230050575090043
    },
    {
      "verse": "34:33",
      "similarity": 0.3031286923361641
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/049006.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/049006.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/49:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}