{
  "chapter": "الحجرات",
  "text": "يايها الذين ءامنوا۟ ان جاءكم فاسقۢ بنبا فتبينوا۟ ان تصيبوا۟ قومۢا بجهلة فتصبحوا۟ على ما فعلتم ندمين",
  "translations": [
    {
      "translation": "You who have iman! if a deviator brings you a report, scrutinize it carefully in case you attack people in ignorance and so come to greatly regret what you have done.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, if a dissolute person brings some news, verify it first lest you attack a people ignorantly and later regret what you had done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when an ungodly person brings to you a piece of news, carefully ascertain its truth, lest you should hurt a people unwittingly and thereafter repent at what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if one who publicly commits sins brings you any news, ascertain its truthfulness carefully, lest you harm people through ignorance and then regret what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! If any miscreant brings you some tidings, verify it, lest you unknowingly cause suffering to some people, and then remain repenting for what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If a rebellious evil person comes to you with a news, verify it, lest you harm people in ignorance, and afterwards you become regretful to what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! if an evil-doer comes to you with a report, look carefully into it, lest you harm a people in ignorance, then be sorry for what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, if an ungodly man comes to you with a tiding, make clear, lest you afflict a people unwittingly, and then repent of what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! If an evil-liver bring you tidings, verify it, lest ye smite some folk in ignorance and afterward repent of what ye did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if an evil-doer brings you news, ascertain the correctness of the report fully, lest you unwittingly harm others, and then regret what you have done,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "ye who believe! if an evil-doer Came Unto you with a report, then inquire strictly, lest ye hurt a people in ignorance and repent thereafter of that which ye have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! If a vicious character brings you some news, verify it, lest you should visit [harm] on some people out of ignorance, and then become regretful for what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! If a wicked person comes to you with any news, ascertain the truth, lest ye harm people unwittingly, and afterwards become full of repentance for what ye have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If a rebellious evil person comes to you with a news, verify it, lest you harm people in ignorance, and afterwards you become regretful to what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if an evildoer brings you a piece of news, inquire first, in case you should unwittingly wrong others and then repent of what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! If a troublemaker brings you any news, investigate, lest you harm people out of ignorance, and you become regretful for what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, if there comes to you a disobedient one with information, investigate, lest you harm a people out of ignorance and become, over what you have done, regretful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[49:6] The following was revealed regarding al-Walīd b. ‘Uqba whom the Prophet had sent to the Banū al-Mustaliq in order to ascertain [their loyalty to Islam]. He already feared them on account of an old feud between him and them from the time of pagandom [before Islam], and so [upon seeing them come out to him] he returned and claimed that they had refused to give the voluntary alms and intended to kill him. And just as the Prophet (s) was making plans to raid them, they came to him to disavow what he [al-Walīd] had said about them: O you who believe, if a reprobate should come to you with some tiding, some piece of information, verify [it], [ascertain] his truthfulness from his mendacity (fa-tabayyanū: a variant reading has fa-tathabbatū, from al-thabāt, ‘to ascertain’), lest you injure a folk (an tusībū qawman, an object denoting reason), that is to say, for fear of this [happening], out of ignorance (bi-jahālatin is a circumstantial qualifier referring to the subject [of the verb]), that is to say while you are ignorant; and then become remorseful of what you have perpetrated, erroneously against that folk. After they had returned to their homelands, the Prophet (s) sent Khālid [b. al-Walīd] to them, who observed only obedience and goodness in them and [later] informed the Prophet of this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا أَيُّهَا الَّذِينَ آَمَنُوا إِنْ جَاءَكُمْ فَاسِقٌ بِنَبَإٍ فَتَبَيَّنُوا أَنْ تُصِيبُوا قَوْمًا بِجَهَالَةٍ فَتُصْبِحُوا عَلَى مَا فَعَلْتُمْ نَادِمِينَ (6(هذا نداء ثالث ابتدىء به غرض آخر وهو آداب جماعات المؤمنين بعضهم مع بعض وقد تضافرت الروايات عند المفسرين عن أم سلمة وابن عباس والحارث بن ضرارة الخزاعي أن هذه الآية نزلت عن سبب قضية حدثت . ذلك أن النبي صلى الله عليه وسلم بعث الويد بن عقبة بن أبي مُعيط إلى بني المصطلق من خزاعة ليأتي بصدقاتهم فلمّا بلغهم مجيئه ، أو لمّا استبطأُوا مجيئه ، فإنهم خرجوا لتلقيه أو خرجوا ليبلغوا صدقاتهم بأنفسهم وعَليهم السلاح ، وأن الوليد بلغه أنهم خرجوا إليه بتلك الحالة وهي حالة غير مألوفة في تلقي المصدقين وحدثته نفسه أنهم يريدون قتله ، أو لما رآهم مقبلين كذلك على اختلاف الروايات خاف أن يكونوا أرادوا قتله إذ كانت بينه وبينهم شحناء من زمن الجاهلية فولّى راجعاً إلى المدينة .هذا ما جاء في روايات أربع متفقة في صفة خروجهم إليه مع اختلافها في بيان الباعث لهم على ذلك الخروج وفي أن الوليد أُعلم بخروجهم إليه أو رآهم أو استشعرت نفسه خوفاً وأن الوليد جاء إلى النبي صلى الله عليه وسلم فقال : إن بني المصطلق أرادوا قتلي وأنهم منعوا الزكاة فغضب رسول الله صلى الله عليه وسلم وهمّ أن يبعث إليهم خالدَ بن الوليد لينظر في أمرهم ، وفي رواية أنه بعث خالداً وأمره بأن لا يغزوهم حتى يستثبت أمرهم وأن خالداً لما بلغ ديار القوم بعث عيناً له ينظر حالهم فأخبره أنهم يقيمون الأذان والصلاة فأخبرهم بما بلغ رسولَ الله صلى الله عليه وسلم عنهم وقبض زكاتهم وقفل راجعاً . وفي رواية أخرى أنهم ظنوا من رجوع الوليد أن يُظن بهم منع الصدقات فجاؤوا النبي صلى الله عليه وسلم قبل أن يخرج خالد إليهم متبرئين من منع الزكاة ونية الفتك بالوليد بن عقبة . وفي رواية أنهم لما وصلوا إلى المدينة وجدوا الجيش خارجاً إلى غزوهم . فهذا تلخيص هذه الروايات وهي بأسانيد ليس منها شيء في «الصحيح» .وقد روي أن سبب نزول هذه الآية قضيتان أخريان ، وهذا أشهر . ولنشتغل الآن ببيان وجه المناسبة لموقع هذه الآية عقب التي قبلها فإن الانتقال منها إلى هذه يقتضي مناسبة بينهما ، فالقصتان متشابهتان إذ كان وفد بني تميم النازلةُ فيهم الآية السابقة جاؤوا معتذرين عن ردهم ساعي رسول الله صلى الله عليه وسلم لقبض صدقات بني كعب بن العنبر من تميم كما تقدم ، وبنو المصطلق تبرُّؤوا من أنهم يمنعون الزكاة إلا أن هذا يُناكِده بُعد ما بين الوقتين إلا أن يكون في تعيين سنة وفد بني تميم وَهَم .وإعادة الخطاب ب { يا أيها الذين آمنوا } وفصله بدون عاطف لتخصيص هذا الغرض بالاهتمام كما علمت في قوله تعالى : { يا أيها الذين آمنوا لا ترفعوا أصواتكم فوق صوت النبي } .فالجملة مستأنفة استئنافاً ابتدائياً للمناسبة المتقدم ذكرها .ولا تعلق لهذه الآية بتشريع في قضية بني المصطلق مع الوليد بن عقبة لأنها قضية انقضت وسُويت .والفاسق : المتصف بالفسوق ، وهو فعل ما يحرمه الشرع من الكبائر . وفسر هنا بالكاذب قاله ابن زيد ومقاتل وسهل بن عبد الله .وأوثر في الشرط حرف { إن } الذي الأصل فيه أن يكون للشرط المشكوك في وقوعه للتنبيه على أن شأن فعل الشرط أن يكون نادر الوقوع لا يقدم عليه المسلمون . واعلم أن ليس الآية ما يقتضي وصف الوليد بالفاسق تصريحاً ولا تلويحاً .وقد اتفق المفسرون على أن الوليد ظنّ ذلك كما في «الإصابة» عن ابن عبد البر وليس في الروايات ما يقتضي أنه تعمد الكذب . قال الفخر : «إن إطلاق لفظ الفاسق على الوليد شيء بعيد لأنه توهَّم وظن فأخطأ ، والمخطىء لا يسمى فاسقاً» . قلت : ولو كان الوليد فاسقاً لما ترك النبي صلى الله عليه وسلم تعنيفه واستتابته فإنه روى أنه لم يزد على قوله له «التبيّن من الله والعجلة من الشيطان» ، إذ كان تعجيل الوليد الرجوع عجلة . وقد كان خروج القوم للتعرض إلى الوليد بتلك الهيئة مثار ظنِّه حقاً إذ لم يكن المعروف خروج القبائل لتلقّي السعاة . وأنا أحسب أن عملهم كان حيلة من كبرائهم على انصراف الوليد عن الدخول في حيّهم تعيُّراً منهم في نظر عامتهم من أن يدخل عدوّ لهم إلى ديارهم ويتولى قبض صدقاتهم فتُعيرهم أعداؤهم بذلك يمتعض منهم دهماؤهم ولذلك ذهبوا بصدقاتهم بأنفسهم في رواية أو جاؤوا معتذرين قبل مجيء خالد بن الوليد إليهم في رواية أخرى .ويؤيد هذا ما جاء في بعض روايات هذا الخبر أن الوليد أعلم بخروج القوم إليه ، وسَمع بذلك فلعل ذلك الإعلام موعَز به إليه ليخاف فيرجع . وقد اتفق من ترجموا للوليد بن عقبة على أنه كان شجاعاً جواداً وكان ذا خلق ومروءة . واعلم أن جمهور أهل السنة على اعتبار أصحاب النبي صلى الله عليه وسلم عدولاً وإن كل من رأى النبي صلى الله عليه وسلم وآمن به فهو من أصحابه . وزاد بعضهم شرط أن يروي عنه أو يلازمه ومال إليه المازري . قال في «أماليه» في أصول الفقه «ولسنا نعني بأصْحَاب النبي كل من رآه أو زاره لماماً إنما نريد أصحابه الذين لازموه وعززوه ونصروه واتبعوا النور الذي أنزل معه وأولئك هم المفلحون شهد الله لهم بالفلاح» اه . وإنما تلقف هذه الأخبار الناقمون على عثمان إذ كان من عداد مناقمهم الباطلة أنه أولى الوليد بن عقبة إمارة الكوفة فحملوا الآية على غير وجهها وألصقوا بالوليد وصف الفاسق ، وحاشاه منه لتكون ولايته الإمارة باطلاً .وعلى تسليم أن تكون الآية إشارة إلى فاسق معين فلماذا لا يحمل على إرادة الذي أعلم الوليدَ بأن القوم خرجوا له ليصدّوه عن الوصول إلى ديارهم قصداً لإرجاعه .وفي بعض الروايات أن خالداً وصل إلى ديار بني المصطلق . وفي بعضها أن بني المصطلق وردوا المدينة معتذرين ، واتفقت الروايات على أن بين بني المصطلق وبين الوليد بن عقبة شَحناء من عهد الجاهلية . وفي الرواية أنهم اعتذروا للتسلح بقصد إكرام ضيفهم . وفي السيرة الحلبية أنهم قالوا : خشِينا أن يبادئنا بالذي كان بيننا من شحناء . وهذه الآية أصل في الشهادة والرواية من وجوب البحث عن دخيلة من جُهل حال تقواه . وقد قال عمر بن الخطاب لا يُؤسر أحد في الإسلام بغير العدول ، وهي أيضاً أصل عظيم في تصرفات ولاة الأمور وفي تعامل الناس بعضهم مع بعض من عدم الإصغاء إلى كل ما يروى ويخبر به .والخطاب ب { يا أيها الذين آمنوا } مراد به النبي صلى الله عليه وسلم ومن معه ويشمل الوليد بن عقبة إذ صدق من أخبره بأن بني المصطلق يريد له سوءاً ومن يأتي من حكام المؤمنين وأمرائهم لأن المقصود منه تشريع تعديل من لا يعرف بالصدق والعدالة . ومجيء حرف { إن } في هذا الشرط يومىء إلى أنه مما ينبغي أن لا يقع إلا نادراً .والتبين : قوة الإبانة وهو متعد إلى مفعول بمعنى أبان ، أي تأملوا وأبينوا . والمفعول محذوف دل عليه قوله بنبإ أي تبينوا ما جاء به وإبانة كل شيء بحسبها . والأمر بالتبيّن أصل عظيم في وجوب التثبت في القضاء وأن لا يتتبع الحاكم القيل والقال ولا ينصاع إلى الجولان في الخواطر من الظنون والأوهام .ومعنى { فتبينوا } تبينوا الحق ، أي من غير جهة ذلك الفاسق . فخبر الفاسق يكون داعياً إلى التتبع والتثبت يصلح لأن يكون مستنداً للحكم بحال من الأحوال وقد قال عمر بن الخطاب «لا يؤسر أحد في الإسلام بغير العدول» .وإنما كان الفاسق معرَّضاً خبره للريبة والاختلاق لأن الفاسق ضعيف الوازع الديني في نفسه ، وضعف الوازع يجرئه على الاستخفاف بالمحظور وبما يخبر به في شهادة أو خَبَر يترتب عليهما إضرار بالغير أو بالصالح العام ويقوي جُرأته على ذلك دوماً إذا لم يتب ويندم على ما صدر منه ويقلع عن مثله .والإشراك أشد في ذلك الاجتراء لقلة مراعاة الوازع في أصول الإشراك . وتنكير { فاسق } ، و { نَبإ } ، في سياق الشرط يفيد العموم في الفساق بأي فسق اتصفوا ، وفي الأنباء كيف كانت ، كأنه قيل : أيّ فاسق جاءكم بأيّ نبَإ فتوقفوا فيه وتطلبوا بيان الأمر وانكشافه .وقرأ الجمهور { فتبينوا } بفوقية فموحدة فتحتية فنون من التبيّن ، وقرأ حمزة والكسائي وخلَف فتثبتوا بفوقية فمُثلثَة فموحدة ففوقية من التثبت . والتبيّن : تطلب البيان وهو ظهور الأمر ، والتثبت التحري وتطلب الثبات وهو الصدق .ومآل القراءتين واحد وإن اختلف معناهما . وعن النبي صلى الله عليه وسلم « التثبّتُ من الله والعجلة من الشيطان »وموقع { أن تصيبوا قوماً بجهالة فتصبحوا } الخ نصباً على نزع الخافض وهو لام التعليل محذوفة . ويجوز كونه منصوباً على المفعول لأجله .والمعلل باللام المحذوفة أو المقدرة هو التثبت ، فمعنى تعليله بإصابة يقع إثرها الندم هو التثبت . فمعنى تعليله بإصابة يقع آخرها الندم أن الإصابة علة تحمل على التثبت للتفادي منها فلذلك كان معنى الكلام على انتفاء حصول هذه الإضافة لأن العلة إذا صلحت لإثبات الكف عن فعل تصلح للإتيان بضده لتلازم الضد . وتقدم نظير هذا التعليل في قوله : { أن تحبط أعمالكم } \\[ الحجرات : 2 \\] في هذه السورة .وهذا التحذير من جراء قبول خبر الكاذب يدل على تحذير من يخطر له اختلاق خبر مما يترتب على خبره الكاذب من إصَابة الناس . وهذا بدلالة فحوى الخطاب .والجهالة : تطلق بمعنى ضد العلم ، وتطلق بمعنى ضد الحِلم مثل قولهم : جَهْل كجهل السيف ، فإن كان الأول ، فالباء للملابسة وهو ظرف مستقر في موضع الحال ، أي متلبسين أنتم بعدم العلم بالواقع لتصديقكم الكاذب ، ومتعلق { تصيبوا } على هذا الوجه مَحذوف دل عليه السياق سابقاً ولاحقاً ، أي أن تصيبوهم بضرّ ، وأكثر إطلاق الإصابة على إيصال الضرّ وعلى الإطلاق الثاني الباء للتعدية ، أي أن تصيبوا قوماً بفعل من أثر الجهالة ، أي بفعل من الشدة والإضرار .ومعنى { فتصبحوا } فتصيروا لأن بعض أخوات ( كان ( تستعمل بمعنى الصيرورة . والندم : الأسف على فعل صدر . والمراد به هنا الندم الديني ، أي الندم على التورط في الذنب للتساهل وترك تطلب وجوه الحق .وهذا الخطاب الذي اشتمل عليه قوله : { يا أيها الذين آمنوا إن جاءكم فاسق بنبأ فتبينوا } موجه ابتداء للمؤمنين المخبَرين بفتح الباء كل بحسب أثره بما يبلغ إليه من الأخبار على اختلاف أغراض المخبِرين بكسر الباء . ولكنّ هذا الخطاب لا يترك المخبِرين بكسر الباء بمعزل عن المطالبة بهذا التبيّن فيما يتحملونه من الأخبار وبتوخّي سوء العاقبة فيما يختلقونه من المختلقات ولكن هذا تبيّن وتثبت يخالف تبيُّن الآخر وتثبته ، فهذا تثبت من المتلقي بالتمحيص لما يتلقاه من حكاية أو يطرق سمعه من كلام والآخر تمحيص وتمييز لحال المخبر . واعلم أن هذه الآية تتخرج منها أربع مسائل من الفقه وأصوله :المسألة الأولى : وجوب البحث عن عدالة من كان مجهول الحال في قبول الشهادة أو الرواية عند القاضي وعند الرواة . وهذا صريح الآية وقد أشرنا إليه آنفاً .المسألة الثانية : أنها دالة على قبول خبر الواحد الذي انتفت عنه تهمة الكذب في شهادته أو روايته وهو الموسوم بالعدالة ، وهذا من مدلول مفهوم الشرط في قوله : { إن جاءكم فاسق بنبأ فتبينوا } وهي مسألة أصولية في العمل بخبر الواحد .المسألة الثالثة : قيل إن الآية تدل على أن الأصل في المجهول عدم العدالة ، أي عدم ظن عدالته فيجب الكشف عن مجهول الحال فلا يعمل بشهادته ولا بروايته حتى يبحث عنه وتثبت عدالته .وهذا قول جمهور الفقهاء والمحدثين وهو قول مالك . وقال بعضهم : الأصل في الناس العدالة وينسب إلى أبي حنيفة فيقبل عنده مجهول الباطن ويعبر عنه بمستور الحال . أما المجهول باطنُه وظاهره معاً فحكي الاتفاق على عدم قبول خبره ، وكأنهم نظروا إلى معنى كلمة الأصل العقلي دون الشرعي ، وقد قيل : إن عمر بن الخطاب كان قال : «المسلمون عدول بعضهم عن بعض» وأنه لما بلغه ظهور شهادة الزور رَجع فقال : «لا يؤسر أحد في الإسلام بغير العدول» . ويستثنى من هذا أصحاب النبي صلى الله عليه وسلم فإن الأصل أنهم عدول حتى يثبت خلاف ذلك بوجه لا خلاف فيه في الدين ولا يختلف فيه اجتهاد المجتهدين . وإنما تفيد الآية هذا الأصل إذا حُمل معنى الفاسق على ما يشمل المتهم بالفسق .المسألة الرابعة : دل قوله : { فتصبحوا على ما فعلتم نادمين } أنه تحذير من الوقوع فيما يوجب الندم شرعاً ، أي ما يوجب التوبة من تلك الإصابة ، فكان هذا كناية عن الإثم في تلك الإصابة فحُذر ولاة الأمور من أن يصيبوا أحداً بضر أو عقاب أو حد أو غرم دون تبيّن وتحقق توجه ما يوجب تسليط تلك الإصابة عليه بوجه يوجب اليقين أو غلبة الظن وما دون ذلك فهو تقصير يؤاخذ عليه ، وله مراتب بينها العلماء في حكم خطها القاضي وصِفةِ المخطىء وما ينقض من أحكامه . وتقديم المجرور على متعلَّقه في قوله : { على ما فعلتم نادمين } للاهتمام بذلك الفعل ، وهو الإصابة بدون تثبت والتنبيه على خطر أمره .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe! If an evil-liver) this was revealed about al-Walid Ibn 'Uqbah Ibn Ma'it who was sent by the Prophet (pbuh) to Banu'l-Mustaliq to collect their alms; instead he came back claiming that they wanted to kill him. The Prophet (pbuh) and his Companions were about to set forth to conquer them but Allah forbade them from doing so, saying: you who believe in Muhammad (pbuh) and the Qur'an if a hypocrite, al-Walid Ibn 'Uqbah, (bring you tidings) brings you news about Banu'l-Mustaliq, (verify it) check whether the news are true or false, (lest ye smite some folk in ignorance and afterward repent of what ye did) regret killing them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فعليكم { إِن جَآءَكُمْ فَاسِقٌ } منحرف عن عدالة الإيمان والتوحيد { بِنَبَإٍ } وخبر على سبيل الافتراء والمراء { فَتَبَيَّنُوۤاْ } أي: تعرَّفوا وتفحَّصوا واستكشفوا عنه\n ولا تبادروا إلى تصديقه\n كراهة { أَن تُصِيبُواْ قَوْمًا } أذية وسوءاً بمجرد الظن الكاذب\n مع أنكم { بِجَهَالَةٍ } أي: جاهلين بحاله { فَتُصْبِحُواْ } وتصيروا بعدما تصيبوا القوم البريء { عَلَىٰ مَا فَعَلْتُمْ } من أذياتهم { نَادِمِينَ } [الحجرات: 6] محزونين مغتمين\n كلما تذكرتهم تغممتم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الذين آمنوا إِن جاءكم فاسق بنبأٍ } نزلت في الوليد بن عُبة بن أبي مُعَيْط\n وكان من فضلاء الصحابة رضي الله عنهم بعثه النبي صلى الله عليه وسلم إلى بني المُصْطلِق\n بعد الوقعة مصدِّقاً\n وكان بينه وبينهم عداوة في الجاهلية\n فخرجوا يتلقّونه\n تعظيماً النبي صلى الله عليه وسلم\n فظنّ أنهم مقاتلوه فرجع\n وقال لرسول الله صلى الله عليه وسلم: قد ارتدُّوا ومنعوا الزكاة\n فَهمَّ صلى الله عليه وسلم أن يغزوهم\n ثم أتوا النبيَّ صلى الله عليه وسلم وأخبروه أنهم إنما خرجوا يتلقّونه تكرمةً فاتهمهم النبي صلى الله عليه وسلم وبعث إليهم \" خالد بن الوليد \" خفيةً مع عسكر\n وأمره أن يُخفي عليهم قدومَه\n ويتطلعَ عليهم\n فإن رأى ما يدلّ على إيمانهم أخذ زكاتهم ورجع\n وإن رأى غير ذلك استَعمل فيهم ما يُستعمل في الكفار\n فسمع خالدُ فيهم آذان صلاتي المغرب والعشاء\n فأخذ صدقاتهم\n ولم يرَ منهم إلا الطاعة\n فنزلت الآية\n وسُمِّي الوليد فاسقاً لعدم تَثَبُّته فخرج بذلك عن كمال الطاعة\n وفي تسميته بذلك زجرٌ لغيره\n وترغيبٌ له في التوبة\n والله تعالى أعلم بغيبه\n حتى قال بعضهم: إنها من المتشابه\n لِمَا ثبت من تحقُّق إيمان الوليد\n وقال أبو عمر في الاستيعاب: لا يصح أن الآية نزلت في قضية الوليد لأنه كان في زمن النبي صلى الله عليه وسلم من ثمانية أعوام\n أو من عشرة\n فكيف يبعثه رسولاً؟! هـ\n قلت: لا غرابةَ فيه\n وقد كان صلى الله عليه وسلم يُؤَمِّر أسامةَ بن زيد على جيش\n فيه أبو بكر وعمر\n مع حداثة سِنِّه\n كما في البخاري وغيره\n وفي تنكير فاسق و نبأ شِياعٌ في الفُسَّاق والأنباء\n أي: إذا جاءكم فاسقٌ أيّ فاسقٍ كان\n بأيِّ خبر { فتبَيَّنوا } أي: فتوقفوا فيه\n وتطلَّبوا بيان الأمر وانكشافَ الحقيقة\n ولا تعتمدوا قولَ مَن لا يتحرّى الصدق\n ولا يتحامى الكذب\n الذي هو نوع من الفسوق\n وفي الآية دليل على قبول خبر الواحد العَدل لأنا لو توقفنا في خبره لسوّينا بينه وبين الفاسق\n ولخلا التخصيص به عن الفائدة\n وقرأ الأخوان: \" فثبتوا \" والتثبُّت والتبيُّن متقاربان\n وهما: طلبُ الثبات والبيان والتعرُّف\n { أن تُصيبوا } أي: لئلا تصيبوا { قوماً بجهالةٍ } حال\n أي: جاهلين بحقيقة الأمر وكُنه القصة\n { فتُصْبِحوا } فتصيروا { على ما فعلتم نادمين } مغتمِّين على ما فعلتم\n متمنين أنه لم يقع\n والندم: ضرب من الغلم وهو أن يَغتم على ما وقع\n يتمنى أنه لم يقع\n وهو غم يصحبُ الإنسان صحبةً لها دوامٌ في الجملة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:40",
      "similarity": 0.7089115519400868
    },
    {
      "verse": "26:157",
      "similarity": 0.5814948508751044
    },
    {
      "verse": "5:52",
      "similarity": 0.5215048387418172
    },
    {
      "verse": "10:54",
      "similarity": 0.47230050575090043
    },
    {
      "verse": "34:33",
      "similarity": 0.3031286923361641
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/049006.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/049006.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/49:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}