{
  "chapter": "الحجرات",
  "text": "واعلموا۟ ان فيكم رسول الله لو يطيعكم فى كثير من الامر لعنتم ولكن الله حبب اليكم الايمن وزينه فى قلوبكم وكره اليكم الكفر والفسوق والعصيان او۟لئك هم الرشدون",
  "translations": [
    {
      "translation": "Know that the Messenger of Allah is among you. If he were to obey you in many things, you would suffer for it. However, Allah has given you love of iman and made it pleasing to your hearts, and has made kufr, deviance and disobedience hateful to you. People such as these are rightly guided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that the Apostle of God is among you: If he agreed with you in most matters you would surely come to grief. But God has made faith more desirable to you, and attractive to your hearts, and rendered disbelief and sin and disobedience repugnant. They are those who are well directed\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that Allah's Messenger is among you. Were he to follow you in many an affair, you yourselves would suffer. But Allah has endeared faith to you and has embellished it in your hearts, and has made unbelief and evil-doing and disobedience abhorrent to you. Such are those who are rightly guided,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that the Messenger of God is with you. Had he yielded to you on many of the matters, you would have been in great trouble. But God has endeared the faith to you and has made it attractive to your hearts. He has made disbelief, evil deeds and disobedience hateful to you. Such people will have the right guidance\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that Allah’s Noble Messenger is among you; in most of the affairs, were he to listen to you, you would surely fall into hardship, but Allah has made faith dear to you and has instilled it in your hearts, and has made disbelief and rebellion and disobedience abhorred by you; it is people like these who are on guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that among you there is the Messenger of Allah. If he were to obey you in much of the matter, you would surely be in trouble, but Allah has endeared the faith to you and has beautified it in your hearts, and has made disbelief, Fusuq and `Isyan hateful to you. Such are they who are the rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that among you is Allah's Apostle; should he obey you in many a matter, you would surely fall into distress, but Allah has endeared the faith to you and has made it seemly in your hearts, and He has made hateful to you unbelief and transgression and disobedience; these it is that are the followers of a right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that the Messenger of God is among you. If he obeyed you in much of the affair, you would suffer; but God has endeared to you belief, decking it fair in your hearts, and He has made detestable to you unbelief and ungodliness and disobedience. Those -- they are the right-minded,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that the messenger of Allah is among you. If he were to obey you in much of the government, ye would surely be in trouble; but Allah hath endeared the faith to you and hath beautified it in your hearts, and hath made disbelief and lewdness and rebellion hateful unto you. Such are they who are the rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and know that the Messenger of God is among you. If he were to obey you in many things, you would suffer for it. However, God has endeared the faith to you, and beautified it in your hearts, and has made denial of the truth, wickedness, and disobedience hateful to you. People such as these are rightly guided\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that verily among you is the apostle of Allah. Were he to obey you in many affairs, ye would surely be in trouble but Allah hath endeared belief to you and hath made it fair-seeming in your hearts, and hath rendered detestable Unto you infidelity and wickedness and disobedience. These! they are the men of rectitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that the Apostle of Allah is among you. Should he comply with you in many matters, you would surely suffer. But Allah has endeared faith to you and made it appealing in your hearts, and He has made hateful to you faithlessness, transgression and disobedience. It is such who are the right-minded—\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that among you is Allah's Messenger: were he, in many matters, to follow your (wishes), ye would certainly fall into misfortune: But Allah has endeared the Faith to you, and has made it beautiful in your hearts, and He has made hateful to you Unbelief, wickedness, and rebellion: such indeed are those who walk in righteousness;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that, among you there is the Messenger of Allah (SAW). If he were to obey you (i.e. follow your opinions and desires) in much of the matter, you would surely be in trouble, but Allah has endeared the Faith to you and has beautified it in your hearts, and has made disbelief, wickedness and disobedience (to Allah and His Messenger SAW) hateful to you. These! They are the rightly guided ones,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that the Messenger of Allah is among you. If he were to obey you in many matters, you would surely suffer. But Allah has endeared the Belief to youand beautified it in your hearts, and has made detestable to you disbelief, wrongdoing, and disobedience. Such are those who are righteous\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that among you is the Messenger of God. Had he obeyed you in many things, you would have suffered hardship. But God has given you the love of faith, and adorned it in your hearts, and made disbelief, mischief, and rebellion hateful to you. These are the rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And know that among you is the Messenger of Allah. If he were to obey you in much of the matter, you would be in difficulty, but Allah has endeared to you the faith and has made it pleasing in your hearts and has made hateful to you disbelief, defiance and disobedience. Those are the [rightly] guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[49:7] And know that the Messenger of God is among you, so do not speak falsehood, for God will inform him of the [real] state of affairs. If he were to obey you in many matters, which you communicate contrary to reality, so that the necessary [evil] consequences ensue, you would surely be in trouble, you would earn in addition to that sin, the sin for the consequences that ensue [from your error]. But God has endeared faith to you, adorning your hearts with it, and He has made odious to you disbelief and immorality and disobedience ([an instance of] suppletion with respect to import, as opposed to [lexical] form; for the one to whom ‘faith has been endeared …’ and so forth, will naturally be dissimilar in character to the mentioned [reprobate]). Those (there is here a shift from the second [to the third] person address) — they are the right-minded, the ones firmly established upon [the way of] their religion;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And know) believers (that the Messenger of Allah is among you) is with you. (If he were to obey you in much of the government) in much of what you request, (ye would surely be in trouble) you would surly sin; (but Allah hath endeared the faith) the belief in Allah and His Messenger (to you and hath beautified it in your hearts) and made it seem good in your hearts, (and hath made disbelief) denial of Allah and His Messenger (and lewdness) hypocrisy (and rebellion) and all transgressions (hateful unto you. Such) those who have such traits (are they who are rightly guided.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَعَنِتُّمْ } معناهُ أَصابَكُم العَنتُ، وهو الضَّررُ\n\n",
      "translations": [
        {
          "translation": "\n\nThe phrase {la'anittum} means \"I curse you,\" and it refers to the harm that has come to you.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ واعلموا أن فيكم رسول الله } الآية\n لما كان تمني المؤمنين طاعة الرسول إياه معرباً عن ظهور نفسه بصفاته\n محتجباً عن فضل الرسول وكماله\n وذلك لا يكون إلا لضعف الإيمان وكدورة القلب بهوى النفس\n واستيلاء النفس على القلب بالميل إلى الشهوات واللذات لغلبة الهوى عليها\n أورد لفظة { ولكن } بين قوله: { لو يطيعكم } وبين قوله: { الله حبب إليكم الإيمان } لصفاء الروح وبقاء الفطرة على النور الأصلي { وزينه في قلوبكم } بإشراق أنوار الروح على القلب وتنويرها إياه واستعدادها للإلهامات الملكية المفيدة للاستسلام والانقياد لأحكامه { وكره إليكم الكفر } أي: الاحتجاب عن الدين { والفسوق } أي: الميل إلى اتباع الشهوات بالهوى ومتابعة الشيطان بالعصيان لتنوّر النفس بنور القلب وانقيادها له واستفادتها ملكة العصمة بالاستسلام لأمره\n والعصمة هيئة نورية في النفس يمتنع معها الإقدام على المعاصي كل ذلك لقوة الروح واستيلائه على القلب والنفس بنوره الفطري كما أن أضداد ذلك في الذين تمنوا طاعة الرسول إياهم لقوة النفس واستيلائها على القلب وحجبها إياه عن نور الروح { أولئك } الموصوفون بمحبة الإيمان وتزيينه في قلوبهم وكراهتهم المعاصي { هم الراشدون } الثابتون على الصراط المستقيم دون من يخالفهم { فضلاً من الله } بعنايته بهم في الأزل المقتضية للهداية الروحانية الاستعدادية المستتبعة لهذه الكمالات في الأبد { ونعمة } بتوفيقه إياهم للعمل بمقتضى تلك الهداية الأصلية وإعانته بإفاضة الكمالات المناسبة لاستعداداتهم حتى اكتسبوا ملكة العصمة الموجبة لكراهة المعصية { والله عليم } بأحوال استعداداتهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱعْلَمُوۤاْ } أيها المؤمنون { أَنَّ فِيكُمْ } وبين أظهركم { رَسُولَ ٱللَّهِ } وسنته السنية\n الموروثة له من ربه بعد مماته\n فعليكم الإطاعة والمراجعة إليه حين حياته\n وإلى سننه وشرعه في مطلق الأمور والعرض عليه وعليهما والمشاورة معه\n فعليكم ألاَّ تكفلوه إلى قبول ما حسَّنت لكم نفوسكم من الأمور\n فإنه { لَوْ يُطِيعُكُمْ } ويقبل قولكم { فِي كَثِيرٍ مِّنَ ٱلأَمْرِ لَعَنِتُّمْ } أتممتم وهلكتم في الإثم ألبتة\n واستغرقتم فيه\n إذ من مقتضى إيمانكم وانقيادكم له أن تفوضوا أموركم كلها إليه\n وتستصوبوها منه\n فإن صوَّب بعضها فيها\n وإلا فلا تكلفوه\n إذ منصب النبوة ومقتضى الحكمة يأبَى عن ذلك { وَلَـٰكِنَّ ٱللَّهَ حَبَّبَ إِلَيْكُمُ ٱلإِيمَانَ } يعني: لا تعتذروا في إصابة البريء بمجرد القول الباطل والظن الفاسد بمحبة الإيمان وكراهة الكفر\n فإنه سبحانه وإن حبب إليكم الإيمن { وَزَيَّنَهُ فِي قُلُوبِكُمْ وَكَرَّهَ إِلَيْكُمُ ٱلْكُفْرَ وَٱلْفُسُوقَ } المؤدي إليه { وَٱلْعِصْيَانَ } المستلزم له\n لكنه إنما حبب الإيمان على مقتضى الصدق والعدالة\n وكرَّه الكفر الناشئ عن قصدٍ واختيار\n لا أن ينسب إلى من ينسب عن بهتان وزور\n فإنه سبحانه لا يرضى لعباده أمثاله\n وبالجملة: { أُوْلَـٰئِكَ } المؤمنون\n المجتنبون عن الزور والتهمة { هُمُ ٱلرَّاشِدُونَ } [الحجرات: 7] المقصرون على الرشد والهداية إلى صراط مستقيم\n هو صراط التوحيد المشتمل المعتدل بين كلا طرفي الإفراط والتفريط\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واعلموا انَّ فيكم رسولَ الله } فلا تكْذبوا\n فإن الله يُخبره\n فيهتك سر الكاذب\n أو: فارجعوا إليه واطلبوا رأيه\n ثم استأنف بقوله: { لو يُطيعُكم في كثير من الأمر لعَنتُّم } لوقعتم في العنت وهو الجهد والهلاك\n\nوالتعبيرُ بالمضارع للدلالة على أنّ عَنَتَهم إنما يلزم في استمرار طاعته لهم في كل ما يعرض من الأمور\n وأما طاعته في بعض الأمور استئلافاً لهم\n فلا\n انظر أبا السعود\n وهذا يدل على أنَّ بعض المؤمنين زيّن لرسول الله صلى الله عليه وسلم الإيقاع ببني المصطلق تصديقاً لقول الوليد\n وأنَّ بعضهم كانوا يتصوّنون ويتحرّجون الوقوعَ بهم تأنياً وتثُبتاً في الأمر\n وهم الذين استثناهم الله بقوله:  { ولكنَّ الله حَبَّبَ إِليكم الإِيمانَ } وأسنده إلى الكل تنبيهاً على أن أكثرهم تحرّجوا الوقوعَ بهم وتأنّوا\n وقيل: هم الذين امتحن الله قلوبهم للتقوى\n وهو تجديدٌ للخطاب وتوجيه إلى بعضهم بطريق الاستدراك\n بياناً لِبراءَتهم عن أوصاف الأولين وإحماداً لأفعالهم\n أي: ولكنه - تعالى - جعل الإيمان محبوباً لديكم { وزيَّنه في قلوبكم } حتى رسخ فيها\n ولذلك صدر منكم ما يليق به من التثبُّت والتحرُّج\n وحاصل الآية على هذا: واعلموا أنَّ فيكم رسول الله\n فلا تُقِرُّون معه على خطأ\n لو يطيعكم في كثير من الأمر لَعَنِتُّم\n ولكنَّ الله حبّب إلى بعضكم الإيمان\n فلا يأمر إلا بما هو صواب من التأنِّي وعدم العجلة\n قلت: والأحسن في معنى الاستدراك: أنَّ التقدير: لو يُطيعكم في كثير من الأمر لَعَنِتُّم\n ولكن الله لا يُقره على طاعتكم بل ينزل عليه الوحي بما فيه صلاحُكم وراحتكُم لأنَّ الله حبَّبَ إليكم الإيمان وزيَّنيه في قلوبكم\n فلا يسلك بكم إلا ما يليق بشأنكم من الحِفظ والعصمة\n ثم قال: { وكَرَّهِ إِليكم الكفرَ والفُسوق والعصيان } ولذلك تحرّجتم عمّا لا يليق مما لا خير فيه مما يؤدي إلى عَنَتِكم\n قال ابن عرفة: العطف في هذه الآية تَدَلِّي فالكفر أشدُّها\n والفسوق دونه\n والعصيان أخفّ لصدقه على ترك المندوبات\n حسبنا نقل ذلك البغداديون وحمَلوا عليه\n ومَن لم يُجب الدعوة فقد عصى أبا القاسم\n هـ\n { أولئك هم الراشدون } أي: أولئك المستَثون\n أو: المتَّصِفون بالإيمان\n المزيّن في قلوبهم\n هم السالكون على طريق السّوى\n الموصل إلى الحق\n أي: أصابوا طريقَ الحق\n ولم يَميلوا عن الاستقامة\n والرشدُ: الاستقامةُ على طريق الحق مع تصلُّبٍ فيه\n من: الرشادة\n وهي الصخرة الصماء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:220",
      "similarity": 0.4519954467933088
    },
    {
      "verse": "9:128",
      "similarity": 0.44331529897251337
    },
    {
      "verse": "3:118",
      "similarity": 0.2465405655886993
    },
    {
      "verse": "11:97",
      "similarity": 0.22415080864966597
    },
    {
      "verse": "18:66",
      "similarity": 0.22325738989455735
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/049007.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/049007.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/49:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}