{
  "chapter": "النساء",
  "text": "يايها الناس اتقوا۟ ربكم الذى خلقكم من نفس وحدة وخلق منها زوجها وبث منهما رجالا كثيرا ونساء واتقوا۟ الله الذى تساءلون به والارحام ان الله كان عليكم رقيبا",
  "translations": [
    {
      "translation": "O mankind! have taqwa of your Lord who created you from a single self and created its mate from it and then disseminated many men and women from the two of them. Have taqwa of Allah in whose name you",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O MEN, FEAR your Lord who created you from a single cell, and from it created its mate, and from the two of them dispersed men and women (male and female) in multitudes. So fear God in whose name you ask of one another (the bond of) relationships. God surely keeps watch over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men! Fear your Lord Who created you from a single being and out of it created its mate; and out of the two spread many men and women. Fear Allah in Whose name you plead for rights, and heed the ties of kinship. Surely, Allah is ever watchful over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People, have fear of your Lord who has created you from a single soul. From it He created your spouse and through them He populated the land with many men and women. Have fear of the One by whose Name you swear to settle your differences and have respect for your relatives. God certainly keeps watch over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Fear your Lord Who created you from a single soul and from it created its spouse and from them both has spread the multitude of men and women; fear Allah in Whose name you claim (your rights from one another) and be mindful of your blood relations; indeed Allah is always seeing you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Have Taqwa of your Lord, Who created you from a single person, and from him He created his mate, and from them both He created many men and women, and have Taqwa of Allah through Whom you demand your mutual (rights), and revere the wombs. Surely, Allah is always watching over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! be careful of (your duty to) your Lord, Who created you from a single being and created its mate of the same (kind) and spread from these two, many men and women; and be careful of (your duty to) Allah, by Whom you demand one of another (your rights), and (to) the ties of relationship; surely Allah ever watches over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind, fear your Lord, who created you of a single soul, and from it created its mate, and from the pair of them scattered abroad many men and women; and fear God by whom you demand one of another, and the wombs; surely God ever watches over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Be careful of your duty to your Lord Who created you from a single soul and from it created its mate and from them twain hath spread abroad a multitude of men and women. Be careful of your duty toward Allah in Whom ye claim (your rights) of one another, and toward the wombs (that bare you). Lo! Allah hath been a watcher over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Fear your Lord, who created you from a single soul. He created its mate from it and from the two of them spread countless men and women [throughout the earth]. Fear God, in whose name you appeal to one another, and be mindful of your obligations in respect of ties of kinship. God is always watching over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye mankind! fear your Lord; Who created you of a single soul and He created the reef the spouse thereof, and of the twain He spread abroad men manifold and women. And fear Allah by Whom ye importune one anot her, and the wombs. Verily Allah is ever over you a Watcher.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Be wary of your Lord who created you from a single soul, and created its mate from it, and from the two of them scattered numerous men and women. Be wary of Allah, in whose Name you adjure one another and [of severing ties with] blood relations. Indeed Allah is watchful over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! reverence your Guardian-Lord, who created you from a single person, created, of like nature, His mate, and from them twain scattered (like seeds) countless men and women;- reverence Allah, through whom ye demand your mutual (rights), and (reverence) the wombs (That bore you): for Allah ever watches over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Be dutiful to your Lord, Who created you from a single person (Adam), and from him (Adam) He created his wife [Hawwa (Eve)], and from them both He created many men and women and fear Allah through Whom you demand your mutual (rights), and (do not cut the relations of) the wombs (kinship). Surely, Allah is Ever an All-Watcher over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, fear your Lord, who created you from a single soul. From it He created its spouse, and from both of them scattered many men and women. Fear Allah, by whom you ask one another, and (fear) the wombs (lest you sever its relationship). Allah is ever watching over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! Fear your Lord, who created you from a single soul, and created from it its mate, and propagated from them many men and women. And revere God whom you ask about, and the parents. Surely, God is Watchful over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, fear your Lord, who created you from one soul and created from it its mate and dispersed from both of them many men and women. And fear Allah, through whom you ask one another, and the wombs. Indeed Allah is ever, over you, an Observer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:1] O people, of Mecca, fear your Lord, that is, His punishment by being obedient to Him, Who created you of a single soul, Adam, and from it created its mate, Eve (Hawwā’), from one of his left ribs, and from the pair of them, Adam and Eve, scattered, separated and spread, many men and, many, women; and fear God by whom you claim [your rights] from one another (tassā’alūna: the original tā’ [of tatasā’alūna] has been assimilated with the sīn; a variant reading has tasā’alūna), so that one of you says to the other, ‘I ask you,   by God…’, or ‘For God’s sake…’; and, fear, kinship ties, lest you sever them (a variant reading [of wa’larhāma, ‘and kinship ties’] is wa’l-arhāmi, as a supplement to the pronoun contained in bihi [sc. God]). They used to implore one another by ties of kinship. Surely God has been watchful over you, heedful of your deeds, for which He will requite you, that is to say, He is ever possessed of such an attribute.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And on his authority from Ibn 'Abbas on Allah's saying: (O mankind!) [he said:] This is an expression of general applicability, but it could also be of particular applicability. (Be careful of your duty to your Lord) obey your Lord (Who created you) by means of copulation (from a single soul) from the soul of Adam alone, for the soul of Eve was included in his (and from it) from the soul of Adam (created its mate) Eve (and from them twain has spread abroad) He created through the copulation of Adam and Eve (a multitude of men and women) scores of human beings: male and female. (Be careful of your duty towards Allah) obey Allah (in Whom ye claim (your rights) of one another) your stuff and rights by Allah's right, (and towards the wombs (that bare you)) and also by the right of kinship and filiation; or it could also mean: keep the ties of kinship and do not sever them. (Lo! Allah hath been a Watcher over you) He has been a Protector: He shall ask you about that which He has commanded you of acts of obedience and keeping ties of kinship.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nحدّثنا أَبو جعفر قالَ: حدّثنا عليُّ بن أحمد\n قالَ: حدّثنا عطاءُ بن السائب\n قالَ: حدّثنا أَبو خالد الواسطي عن زيدِ بن علي عليهما السّلامُ في قولهِ تعالى: { إِنَّ ٱللَّهَ كَانَ عَلَيْكُمْ رَقِيباً } معناهُ حَافظٌ\n\n",
      "translations": [
        {
          "translation": "\n\nWe were told by Abu Ja'far that Ali ibn Ahmad told us\n\n\n{Ata ibn al-Saaib} said: \"Tell us, O {Ata ibn al-Saaib}.\"\n\n\nHe said: Abu Khalid al-Wasiti narrated to us from Zayd ibn Ali, peace be upon him, regarding the words of Allah, {Indeed, Allah was watchful over you}, meaning: He is a Preserver.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا أيها الناس اتّقوا ربّكم } احذروه في انتحال صفته عند صدور الخيرات منكم، واتخذوا الصفة وقاية لكم في صدور ما صدر منكم من الخير، وقولوا صدر عن القادر المطلق { الذي خلقكم من نفس واحدة } هي النفس الناطقة الكلية، التي هي قلب العالم، وهو آدم الحقيقيّ { وجعل منها زوجها } أي: النفس الحيوانية الناشئة منها\n وقيل: إنها خلقت من ضلعه الأيسر من الجهة التي تلي عالم الكون، فإنها أضعف من الجهة التي تلي الحق، ولولا زوجها لما أهبط إلى الدنيا\n كما اشتهر أنّ إبليس سوّل لها أولاً فتوسل بإغوائها إلى إغواء آدم ولا شك في أنّ التعلق البدنيّ لا يتهيأ إلا بواسطتها { وبثّ منهما رِجالاً كثِيراً } أي: أصحاب قلوب ينزعون إلى أبيهم { ونساء } أصحاب نفوس وطبائع ينزعون إلى أمّهم { واتّقوا الله } في ذاته عن إثبات وجودكم، واجعلوه وقاية لكم عند ظهور البقية منكم في الفناء في التوحيد حتى لا تحتجبوا برؤية الفناء { الذي تساءَلُونَ به } لا بكم { والأرْحَام } أي: احذروا الأرحام الحقيقية، أي أقربة المبادئ العالية من المفارقات وأرواح الأنبياء والأولياء في قطعها بعدم المحبة، واجعلوها وقاية لكم في حصول سعاداتكم وكمالاتكم، فإنّ قطع الرحم بفقد المحبة، توجه عن الاتصال والوحدة إلى الانفصال والكثرة، وهو المقت الحقيقيّ والبعد الكليّ عن جناب الحق تعالى، ولهذا قال عليه الصلاة والسلام:\n\n \" صلة الرحم تزيد في العمر \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلنَّاسُ } الذين نسوا الموطن الأصلي، والمنزل الحقيقي بزخرفة الدنيا المانعة من الوصول إليه، عليكم الاتقاء من غوائلها، والأجتناب عن مخايلها، حتى لا تنحطوا عن مرتبتكم الأصلية ومكانكم الحقيقي { ٱتَّقُواْ } أي: اجتنبوا والتجئوا { رَبَّكُمُ ٱلَّذِي } رباكم بحسن التربية، بأن { خَلَقَكُمْ } أظهركم وأوجدكم أولاً { مِّن نَّفْسٍ وَاحِدَةٍ } هي المرتبة الفعالى، المحيطة بجميع المراتب الكونية والكيانية، وهي المرابت الجامعة المحمدية، المسماة بالعقل الكلي، والقلم الاعلى؛ تكميلاً لباطنكم وغيبكم\n\n\n\n\n{ وَخَلَقَ مِنْهَا } بالنكاح المعنوي والزواج الحقيقي الواقع بين الأوصاف والأسماء الإلهية { زَوْجَهَا } التي هي الكلية القابلة الفيضان عموم الآثار الصادرة من المبدأ المختار؛ تتميماً لظاهركم وشهادتكم، حتى استحقوا الخلافة والنيةبة بحسب الظاهر والباطن { وَ } بعد جعلهما زوجين كذلك { بَثَّ } بسط ونشر { مِنْهُمَا } أيضاً بتلك النكاح المذكور { رِجَالاً كَثِيراً } فواعل مفيضات { وَنِسَآءً } قوابل مستفيضات كل لنظيرتها، على تفاوت دقائق المناسبات الواقعة بين التجليات الحبية على الوجه الذي بينتها الكتب والرسل\n\n\n\n\nولما كان الرب من الأسماء التي تتفاوت بتفاوت المربوب، صرح بألوهيته المستجمعة لجميع الأوصاف والأسماء بلا تفاوت، تأكيداً ومبالغةً لأمر التقوى، فقال: { وَٱتَّقُواْ ٱللَّهَ } أي: واحذروا عمَّا يشغلكم عنه سباحنه، مع أنه أقرب إليكم من حبل وريدكم؛ إذ هو { ٱلَّذِي تَسَآءَلُونَ } تتساءلون وتتنافسون { بِهِ } وتتوهمون بعده من غاية قربه { وَ } احفظوا { ٱلأَرْحَامَ } المنبئة عن النكاح المعنوي والزواج الحيي على الوجه الذي ذكره { إِنَّ ٱللَّهَ } المحيط بكم وبأحوالكم { كَانَ عَلَيْكُمْ } دائماً { رَقِيباً } [النساء: 1] حفيظاً يحفظكم عمَّا لا يغنيكم إن أخلصتم التوجه\n\n\n\n\nومن جملة الأمور التي يجب المحافظة عليها أيها المأمورون بالتقوى: حقوق اليتامى، فعليكم أيها الأولياء والأوصيا أن تحفظوا مال اليتيم حين موت أبيه أو جده، وتزيدوه بالمرابحة والمعاملة، وتصرفوا بقدر الكفاف\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: من قرأ: { والأرحامَ } بالنصب، فعطف على لفظ الجلالة، أي: اتقوا الأرحام أن تقطعوها، وقرأ حمزه بالخفض على الضمير من { به } كقول الشاعر:\n\nوجمهور البصريين يمنعون العطف على الضمير إلا بإعادة الجار، فيقولون: مررت به وبزيد\n وقال ابن مالك:\n\nوالنثر الصحيح هو ما قرأ به حمزة، وهذا هو التوجيه الصحيح، وأما من جعل الواو للقسم فبعيد\n يقول الحقّ جلّ جلاله: { يا أيها الناس } أي: جميع الخلق، اتقوا ربكم فيما كلفكم به، ثم بيَّن موجب التقوى فقال: { الذي خلقكم من نفس واحدة } يعني آدم، { وخلق منها زوجها } يعني حواء، من ضلع من أضلاعه، { وبث } أي: نشر { منهما رجالاً كثيرًا ونساء } أي: نشر من تلك النفس الواحدة بنين وبنات\n قال البيضاوي: واكتفى بوصف الرجال بالكثرة عن وصف النساء، إذْ الحكمة تقتضي أن يكنَّ أكثر، وذكر: { كثيرًا } حملاً على الجمع، وترتيب الأمر بالتقوى على هذه القصة لما فيها من الدلالة على القدرة القاهرة التي من حقها أن تُخشى والنعمة الباهرة التي توجب طاعة مولاها\n هـ\n { واتقوا الله الذي تساءَلون به } أي: يسأل بعضكم بعضَا فيقول: أسألك بالله العظيم، { والأرحام } أي: واتقوا الأرحام فلا تقطعوها، فمن قطعها قعطه الله، ومن وصلها وصله الله، كما في الحديث\n أو تساءلون به وبالأرحام، فيقول بعضكم لبعض: أسألك بالرحم التي بيني وبينك، أو بالقرابة التي بيني وبينك\n ثم هددهم على ترك ما أُمروا به فقال: { إن الله كان عليكم رقيباً } حافظًا مطلعًا شهيدًا عليكم في كل حال\n الإشارة: درجهم في آخر السورة في مدارج السلوك حتى زجَّهم في حضرة ملك الملوك، وأمرهم أن يتقوا ما يُخرجهم عن مشاهدة ظلمة أنوار الربوبية، ثم دلاهم في أول السورة إلى التنزل لآداب العبودية بشهود آثار القدرة الإلهية، في النشأة الأولية، ليعلَّمهم الجمع بين آداب المراقبة ودوام المشاهدة، أو بين الفناء والبقاء\n وقد تكلم ابن جزي هنا على أحكام المراقبة، فقال: إذا تحقق العبد بهذه الآية وأمثالها، استفاد مقام المراقبة، وهو مقام شريف أصله علم وحال، ثم يثُمر حالين\n أما العلم: فهو معرفة العبد بأن الله مطلع عليه، ناظر إليه في جميع أعماله، ويسمع جميع أقواله، ويعلم كل ما يخطر على باله\n وأما الحال: فهو ملازمة هذا العلم بالقلب، بحيث يغلب عليه ولا يغفل عنه\n ولا يكفي العلم دون هذه الحال، فإذا حصل العلم والحال كانت ثمرتهما عند أصحاب اليمين: الحياء من الله، وهو يوجب بالضرورة ترك المعاصي والجد في الطاعات، وكانت ثمرتهما عند المقربين: المشاهدة، التي توجب التعظيم والإجلال لذي الجلال\n\n\nوإلى هاتين الثمرتين أشار الرسول صلى الله عليه وسلم بقوله\n\n \" أن تعبدَ اللهَ كأنكَ تَراه فإنْ لم تكنْ تَراه فإنه يَراك \" \n\n، فقوله: \" أن تعبد الله كأنك تراه \" إشاره إلى الثمرة الثانية، وهي الموجبة للتعظيم، كمن يشاهد ملكًا عظيمًا فإنه يعظمه إذ ذاك بالضرورة، وقوله: \" فإن لم تكن تراه فإنه يراك \" إشارة إلى الثمرة الأولى، ومعناه: إن لم تكن من أهل المشاهدة ــ التي هي مقام المقربين ــ فاعلم أنه يراك، فكن من أهل الحياء الذي هو مقام أصحاب اليمين، فلما فسر الإحسان أول مرة بالمقام الأعلى، ورأى أن كثيرًا من الناس قد يعجزون عنه، تنزل منه إلى المقام الآخر\n واعلم أن المراقبة لا تستقيم حتى تتقدم قبلها المشارطة والمرابطة، ويتأخر عنها المحاسبة والمعاتبة، فأما المشارطة فهي اشتراط العبد على نفسه التزام الطاعة، وترك المعاصي، وأما المرابطة فهي معاهدة العبد لربه على ذلك، ثم بعد المشارطة والمرابطة في أول الأمر تكون المراقبة\n\n\n الخ\n وبعد ذلك يحاسب العبدُ نفسَه على ما اشترطه وعاهد عليه، فإن وجد نفسه قد وفَّى بما عاهد عليه الله يحمد الله، وإن وجد نفسه قد حلَ عَقد المشارطة ونقض عهد المراقبة، عاقب النفس عقابًا شديدًا بزجرها عن العودة إلى مثل ذلك، ثم عاد إلى المشارطة والمرابطة، وحافظ على المراقبة، ثم اختبر بالمحاسبة، وهكذا يكون إلى أن يلقى الله تعالى\n انتهى كلامه، وهو مقتبس من الإحياء\n والله تعالى أعلم\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:29",
      "similarity": 0.50450563452984
    },
    {
      "verse": "45:4",
      "similarity": 0.4890183220561801
    },
    {
      "verse": "101:4",
      "similarity": 0.41327184603979655
    },
    {
      "verse": "33:52",
      "similarity": 0.3506248447071678
    },
    {
      "verse": "44:59",
      "similarity": 0.314466658310967
    }
  ]
}