{
  "chapter": "النساء",
  "text": "ان الذين ياكلون امول اليتمى ظلما انما ياكلون فى بطونهم نارا وسيصلون سعيرا",
  "translations": [
    {
      "translation": "People who consume the property of orphans wrongfully consume nothing in their bellies except fire. They will roast in a Searing Blaze.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who devour the possessions of the orphans unjustly devour only fire, and will surely burn in Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, those who wrongfully devour the properties of orphans only fill their bellies with fire. Soon they will burn in the Blazing Flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who wrongfully consume the property of orphans are, in fact, consuming fire in their bellies and they will suffer the blazing fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who unjustly devour the wealth of orphans only fill their bellies with fire; and soon they will go into a blazing pit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who unjustly eat up the property of orphans, they eat up only a fire into their bellies, and they will be burnt in the blazing Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who swallow the property of the orphans unjustly, surely they only swallow fire into their bellies and they shall enter burning fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who devour the property of orphans unjustly, devour Fire in their bellies, and shall assuredly roast in a Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Those who devour the wealth of orphans wrongfully, they do but swallow fire into their bellies, and they will be exposed to burning flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who consume the property of orphans unjustly are actually swallowing fire into their own bellies; soon they will burn in the blazing Flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who devour the substance of the orphans wrongously, only devour the fire into their bellies, and anon they shall roast in the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who consume the property of orphans wrongfully, only ingest fire into their bellies, and soon they will enter the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who unjustly eat up the property of orphans, eat up a Fire into their own bodies: They will soon be enduring a Blazing Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who unjustly eat up the property of orphans, they eat up only a fire into their bellies, and they will be burnt in the blazing Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who consume the wealth of orphans wrongfully, only consume fire in their bellies, and they shall roast in the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who consume the wealth of orphans illicitly consume only fire into their bellies; and they will roast in a Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who devour the property of orphans unjustly are only consuming into their bellies fire. And they will be burned in a Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:10] Those who consume the property of orphans unjustly, without any right, are only consuming, the whole of it as, fire in their bellies, because that is where such [action] leads, and they shall be exposed to (read active yaslawna, or passive yuslawna), that is, they shall enter, a blaze, an intense fire, in which they shall burn.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Those who devour the wealth of orphans wrongfully) extortionately, (they do but swallow fire into their bellies) i.e. that which is unlawful; it is also said that this means: Allah will place fire in their bellies on the Day of Judgement (and they will be exposed to burning flame) a blazing fire in the Hereafter. This verse was revealed about Hanzalah Ibn Shamardal.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهي نار البعد والخذلان { وَ } هم فيها { سَيَصْلَوْنَ } أي: سيدخلون { سَعِيراً } [النساء: 10] لا ينجو منها أحد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { ظلمًا }: تمييز، أو مفعول لأجله. يقول الحقّ جلّ جلاله: { إن الذين يأكلون أموال اليتامى ظلمًا } من غير موجب شرعي، { إنما يأكلون في بطونهم نارًا } ، أي: ما يجُر إلى النار ويؤول إليها. وعن أبي برزة أنه صلى الله عليه وسلم قال:\n \" يبعثُ اللهُ أقوامًا من قبورهم تتأججُ أفواههم نارًا \" \n، فقيل: مَنْ هم يا رسول الله؟ قال:\n \" ألم تر أن الله يقول: { إن الذين يأكلون أموال اليتامى ظلمًا إنما يأكلون في بطونهم نارًا وسيصلون سعيرًا } \" \nأي: يحترقون في نار، وأي نار!! والصَّلْى: هو الشيّ، تقول: صليت الشيء: شويته، وأصليته وصليته، وذكر البطون مبالغة وتهجين لحالهم. الإشارة: حذَّر الحق ــ جلّ جلاله ــ أهل الدعوى، الذين نصبوا أنفسهم للشيخوخة، وادعوا مقام التربية، مع كونهم جهالاً بالله، محجوبين عن شهود أسرار التوحيد، أن يأخذوا أموال الضعفاء الذين تعلقوا بهم لأنهم إنما يدفعون لهم ذلك طمعًا في الوصول إلى الله. وهم ليسوا أهلاً لذلك، فإذا أكلوا ذلك فإنما يأكلون في بطونهم نارًا وسيصلون سعيرًا، وهو تكثيف الحجاب، وزيادة العنت والتعب، إن أقبل عليهم الناس فرحوا واستبشروا، وإن أدبروا عنهم حزنوا وغضبوا، فأيُّ عذاب أعظم مِنْ هذا!!. فتحصَّل من أول الآية إلى آخرها، أن الحق ــ تعالىــ أمر أهل الغني الأكبر، وهم الذين أهلَّهم للتربية النبوية، بأن سلكوا الطريق وأشرقت عليهم شموس التحقيق على يد شيخ كامل، بالاستعفاف، ولا يأخذ إلاّ قدر الحاجة، من أموال مّنْ انتسب إليهم، وسد الباب لأهل الدعوى، لإنه مِنْ أكْلِ أموال الناس بالباطل، لأنه يعطى على وجه لم يوجد في المعطى إليه، إلا إذا كان وجه الصدقة المحضة، مع أنه قد يكون غير مستحق لها. والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "84:12",
      "similarity": 0.5910109045528107
    },
    {
      "verse": "54:47",
      "similarity": 0.365998582008638
    },
    {
      "verse": "22:4",
      "similarity": 0.3539336847060098
    },
    {
      "verse": "54:24",
      "similarity": 0.3408450115648671
    },
    {
      "verse": "87:12",
      "similarity": 0.3407037933416312
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/4:10.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/4:10.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}