{
  "chapter": "النساء",
  "text": "ولا تهنوا۟ فى ابتغاء القوم ان تكونوا۟ تالمون فانهم يالمون كما تالمون وترجون من الله ما لا يرجون وكان الله عليما حكيما",
  "translations": [
    {
      "translation": "And do not be chary of pursuing them. If you suffer, they shall also suffer like you. But while you have hope (of success) from God, they have none. Surely God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be faint of heart in pursuing these people: if you happen to suffer harm they too are suffering just as you are, while you may hope from Allah what they cannot hope for. Allah is All-Knowing, All- Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not neglect the pursuit of the enemy. If you have suffered, they too have suffered but you can, at least, expect from God what they can never expect. God is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not relax in pursuit of the disbelievers; if you are suffering, they also suffer as you do; and you expect from Allah what they do not; and Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And don't be weak in the pursuit of the enemy; if you are suffering (hardships) then surely they (too) are suffering (hardships) as you are suffering, but you have a hope from Allah (for the reward, i.e. Paradise) that for which they hope not; and Allah is Ever All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not weak hearted in pursuit of the enemy; if you suffer pain, then surely they (too) suffer pain as you suffer pain, and you hope from Allah what they do not hope; and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Faint not in seeking the heathen; if you are suffering, they are also suffering as you are suffering, and you are hoping from God for that for which they cannot hope; God is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Relent not in pursuit of the enemy. If ye are suffering, lo! they suffer even as ye suffer and ye hope from Allah that for which they cannot hope. Allah is ever Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not relent in the pursuit of the enemy. If you are suffering hardships, they too are suffering similar hardships, but what you can hope for from God, they cannot. God is all knowing and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And slacken not in seeking the enemy people if ye are suffering, then they suffer even as ye suffer, and you hope from Allah that which they hope not; and Allah is ever Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not slacken in the pursuit of these people. If you are suffering, they are also suffering like you, but you expect from Allah what they do not expect, and Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And slacken not in following up the enemy: If ye are suffering hardships, they are suffering similar hardships; but ye have Hope from Allah, while they have none. And Allah is full of knowledge and wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And don't be weak in the pursuit of the enemy; if you are suffering (hardships) then surely, they (too) are suffering (hardships) as you are suffering, but you have a hope from Allah (for the reward, i.e. Paradise) that for which they hope not, and Allah is Ever All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be weak in seeking out the people. If you are suffering, they are also suffering as you are suffering, but you are hoping from Allah that which they do not hope. Allah is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not falter in the pursuit of the enemy. If you are aching, they are aching as you are aching, but you expect from God what they cannot expect. God is Knowledgeable and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not weaken in pursuit of the enemy. If you should be suffering - so are they suffering as you are suffering, but you expect from Allah that which they expect not. And Allah is ever Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:104] After they returned from Uhud, the Prophet (s) dispatched a group to seek out Abū Sufyān and his companions, but they complained about their wounds, and the following was revealed: Be not faint, [be not] weak, in seeking, in pursuing, the enemy, the disbelievers, in order to fight them; if you are suffering, [if] you have pains from a wound, they are also suffering as you are suffering, that is, just like you, yet they do not shrink from fighting you; and you hope from God, in the way of victory and the reward for it, that for which they cannot hope, and since you have this advantage over them, you should be more willing for it than them. God is ever Knower, of all things, Wise, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then encouraged the believers to go in pursuit of Abu Sufyan and his men after the Day of Uhud, saying: (Relent not) do not slacken or weaken (in pursuit of the enemy) Abu Sufyan and his men. (If ye are suffering) from your wounds, (lo! they suffer) from their wounds (even as ye suffer and ye hope from Allah) His reward and fear His torment (that for which they cannot hope. Allah is ever Knower) of your wounds, (Wise) He enjoined upon you to go in pursuit of these people.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ تَهِنُواْ } ولا تضعفوا { فِي ٱبْتِغَآءِ ٱلْقَوْمِ } أي: في وقت طلب الكفار قتالكم، إذ هم مثلكم { إِن تَكُونُواْ تَأْلَمُونَ } أيضاً { فَإِنَّهُمْ يَأْلَمُونَ كَمَا تَأْلَمونَ وَ } فائدة القتال وربحه عائد بكم؛ إذ { تَرْجُونَ مِنَ } فضل { ٱللَّهِ } لانتصاره وإعلا كلمته { مَا لاَ يَرْجُونَ } فما لكم تضعفون وتجنبون عنه { وَكَانَ ٱللَّهُ } الموفق لكم على القتال والأمر به { عَلِيماً } بقوتكم ومقاومتكم { حَكِيماً } [النساء: 104] فيما أمركم ونهى عنكم؟ فاتخذوه سبحانه وقاية لأنفسكم، وفوضوا أموركم كلها إليه، وامتثلوا لجميع ما أمر طائعين راغبين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}