{
  "chapter": "النساء",
  "text": "ولا تجدل عن الذين يختانون انفسهم ان الله لا يحب من كان خوانا اثيما",
  "translations": [
    {
      "translation": "Do not argue for those who harbour deceit in their hearts, for God does not love the treacherous and the iniquitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not plead for those who are dishonest to themselves; Allah does not love him who betrays trust and persists in sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not defend those who deceive themselves; God does not love those who are treacherous and sinful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not plead on behalf of those who deceive themselves; indeed Allah does not like any treacherous, excessive sinner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And argue not on behalf of those who deceive themselves. Verily, Allah does not like anyone who is a betrayer, sinner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not plead on behalf of those who act unfaithfully to their souls; surely Allah does not love him who is treacherous, sinful;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not dispute on behalf of those who betray themselves; surely God loves not the guilty traitor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And plead not on behalf of (people) who deceive themselves. Lo! Allah loveth not one who is treacherous and sinful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not plead on behalf of those who are dishonest to themselves. Surely God does not love one who is treacherous and sinful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And contend thou not for those who defraud their souls verily Allah loveth not one who is a defrauder, sinner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not plead for those who betray themselves; indeed Allah does not like someone who is treacherous and sinful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Contend not on behalf of such as betray their own souls; for Allah loveth not one given to perfidy and crime:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And argue not on behalf of those who deceive themselves. Verily, Allah does not like anyone who is a betrayer of his trust, and indulges in crime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not argue on behalf of those who betray themselves, surely, Allah does not love the sinful traitor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not argue on behalf of those who deceive themselves. God does not love the deceitful sinner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not argue on behalf of those who deceive themselves. Indeed, Allah loves not one who is a habitually sinful deceiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:107] And do not dispute on behalf of those who betray themselves, through acts of disobedience, for the evil consequences of their betrayal shall fall on them; surely God loves not one who is treacherous, frequently betraying, and sinful, that is to say, He will punish him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And plead not on behalf of (people) who deceive themselves) by stealing. (Lo! Allah loveth not one who is treacherous) through stealing (and sinful) by lying in his oath and falsely accusing an innocent person.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ تُجَادِلْ } يا من أرسل على الحق مع المحقين { عَنِ } جانب المبطلين { ٱلَّذِينَ يَخْتَانُونَ أَنْفُسَهُمْ } باقتراف الخياننة وانتسابها إلى الغير افتراء { إِنَّ ٱللَّهَ } المرسل لك على الحق { لاَ يُحِبُّ مَن كَانَ خَوَّاناً } مقترفاً للخياننة { أَثِيماً } [النساء: 107] مفترياً لغيره؛ تنزيهاً لنفسه عند الناس، استخفاء منهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم نهاه عن الذبّ عنهم، فقال: { ولا تجادل عن الذين يختانون أنفسهم } وهم رهط بن أبيرق السارق، قال السهيلي: هم بِشر وبشير ومُبشر وأُسَير، { إن الله لا يحب مَن كان خوّانًا } أي: كثير الخيانة، { أثيمًا } أي: مصرًا عليها، رُوِي أن طعمة هرب إلى مكة، وارتدَّ، ونَقَبَ حائطًا بها ليسرق أهله، فسقط الحائط عليه فقتله، ويستفاد من الآية امتناع الجدال عمن عُلِمَت خيانتُه بالأحرى، أو كان مظنة الخيانة، كالكافر ونحوه\n وكذا قال ابن العربي في أحكام القرآن في هذه الآية: إن النيابة عن المبطل المتهم في الخصومة لا تجوز، بدليل الآية\n هـ",
      "translations": []
    }
  ]
}