{
  "chapter": "النساء",
  "text": "انا انزلنا اليك الكتب بالحق لتحكم بين الناس بما ارىك الله ولا تكن للخائنين خصيما",
  "translations": [
    {
      "translation": "We have sent down the Book to you with the truth so that you can judge between people according to what Allah has shown to you. But do not be an advocate for the treacherous.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down to you the Book containing the truth, in whose light you should judge among the people as God has shown you, and do not be a contender for deceivers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Messenger!) We have revealed to you this Book with the Truth so that you may judge between people in accordance with what Allah has shown you. So do not dispute on behalf of the dishonest,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have revealed to you the Book in all Truth so that you judge among people by the laws of God. However, never defend the treacherous ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed sent down the true Book towards you (O dear Prophet Mohammed – peace and blessings be upon him), so that you may judge between men, in the way Allah may show you; and do not plead on behalf of the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, We have sent down to you (O Muhammad) the Book in truth that you might judge between men by that which Allah has shown you, so be not a pleader for the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have revealed the Book to you with the truth that you may judge between people by means of that which Allah has taught you; and be not an advocate on behalf of the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have sent down to thee the Book with the truth, so that thou mayest judge between the people by that God has shown thee. So be not an advocate for the traitors;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We reveal unto thee the Scripture with the truth, that thou mayst judge between mankind by that which Allah showeth thee. And be not thou a pleader for the treacherous;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent the Book down to you with the truth so that you may judge among mankind by means of what God has shown you. And do not be an advocate for the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We have sent down the Book unto thee With truth that thou mightest judge between people by that which Allah hath shewn thee; and be not thou On behalf of the deceivers a pleader.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We have sent down to you the Book with the truth, so that you may judge between the people by what Allah has shown you; do not be an advocate for the traitors,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down to thee the Book in truth, that thou mightest judge between men, as guided by Allah: so be not (used) as an advocate by those who betray their trust;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, We have sent down to you (O Muhammad SAW) the Book (this Quran) in truth that you might judge between men by that which Allah has shown you (i.e. has taught you through Divine Inspiration), so be not a pleader for the treacherous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, We have sent down to you the Book with the truth, so that you will rule between the people by that Allah has shown you. So do not be an advocate for the traitors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have revealed to you the Scripture, with the truth, so that you judge between people in accordance with what God has shown you. And do not be an advocate for the traitors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have revealed to you, [O Muhammad], the Book in truth so you may judge between the people by that which Allah has shown you. And do not be for the deceitful an advocate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:105] Tu‘ma b. Ubayriq stole a coat of mail and hid it with a Jew. When it was discovered with the latter, Tu‘ma accused him of having stolen it, and swore by God that he [Tu‘ma] had not stolen it, and his clan asked the Prophet (s) to advocate on his behalf and absolve him, whereupon the following was revealed: Surely We have revealed to you the Book, the Qur’ān, with the truth (bi’l-haqq is semantically connected to anzalnā, ‘We have revealed’) so that you may judge between people by that which God has shown you, what God has taught you. And do not be a disputant for traitors, like Tu‘ma, disputing on their behalf.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentioned the story of Tu'mah Ibn Ubayriq who stole the armour and the Jew, Zayd Ibn Samin, who was accused of this theft, saying: (Lo! We reveal unto thee the Scripture) We have sent you Gabriel with the Qur'an (with the Truth) to show what is true and what is false, (that thou mayst judge between mankind) justly: between Tu'mah and Zayd Ibn Samin (by that which Allah showeth thee) by that which Allah hath taught and shown you in the Qur'an. (And be not thou a pleader) a helper (for the treacherous) through their theft, i.e. Tu'mah;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّا أنزلنا عليك الكتاب } أي: علم تفاصيل الصفات وأحكام تجلياتها بالحق ملتبساً بالعدل والصدق أو قائماً بالحق لا بنفسك لتكون حاكماً بين الخلق { بما أراك الله } من عدله { ولا تكن للخائنين } الذين لا يؤدّون أمانة الله التي أودعها عندهم في الأزل بما ركز في استعدادهم من إمكان كمال معرفته وخانوا أنفسهم وغيرهم بنهب حقوقهم وصرفها في غير وجهها { خصيماً } يدفع عنهم العذاب وتسليط الله الخلق عليهم بالإيذاء ويحتج عنهم على غيرهم أو على الله بالاعتراض بأنه لم خذلهم وقهرهم فإنهم الظالمون لا حجة لهم بل الحجة عليهم { واستغفر الله } لنفسك بترك الاعتراض والاحتجاج عنهم لنغفر تلوينك الذي ظهر عليك بوجود قلبك وبصفاته { ولا تجادل } ظهر تأويله من هذا { يستخفون من الناس } بكتمان رذائلهم وصفات نفوسهم التي هي معايبهم عنهم { ولا يستخفون من الله } بإزالتها وقلعها وهو شاهدهم يعلم بواطنهم { إذ يبيتون } أي: يقدّرون في عالم ظلمة النفس والطبيعة { ما لا يرضى من القول } من الوهميات والتخيلات الفاسدة التي يلفقونها في تحصيل أغراضهم من حطام الدنيا ولذاتها { وكان الله بما يعملون محيطاً } يجازيهم بحسب صفاتهم وأعمالهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّآ أَنْزَلْنَا } من مقام جودنا وإحساننا { إِلَيْكَ } يا أكمل الرسل { ٱلْكِتَابَ } الفارق بين الحق والباطل متلبساً بالحق الصريح { بِٱلْحَقِّ لِتَحْكُمَ بَيْنَ ٱلنَّاسِ } بالعدل الذي هو صراط الله الأعدل الأقوم خصوصاً { بِمَآ أَرَاكَ ٱللَّهُ } أي: عرفك وأوصاك به { وَلاَ تَكُنْ لِّلْخَآئِنِينَ } أي: لأجلهم وعاية جانبهم { خَصِيماً } [النساء: 105] لأهل البراءة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: أرى\n هنا عرفانية\n لا علمية\n فلذلك لم تتعد إلى ثلاثة\n يقول الحقّ جلّ جلاله: لنبيّه ـ عليه الصلاة والسلام ـ حين همَّ أن يخاصم عن طُعمَة بن أبَيرِق\n وذلك أنه سرق درعًا من جاره قتادة بن النعمان\n في جراب دقيق\n فجعل الدقيق يسقط من خرق فيه\n وخبَّأها عند يهودي\n فالتمس الدرع عند طعمة\n فلم توجد\n وحلف ما أخذها\n وما له بها علم\n فتركوه واتبعوا أثر الدقيق حتى انتهى إلى منزل اليهودي فأخذوها\n فقال اليهودوي: دَفَعَهَا إليَّ طُعمَة\n وشهد له ناس\n من اليهود\n فقال رهط طعمة من بني ظفر: انطلقوا بنا إلى رسول الله صلى الله عليه وسلم فنسأله أن يجادل عن صاحبنا\n وقالوا: إن لم يفعل هلك وأفتضح\n وبرىء اليهودي\n فهمَّ رسول الله صلى الله عليه وسلم اعتماداً على ظاهر الأمر\n ولم يكن له علم بالواقعة\n فنزلت الآية: { إنا أنزلنا إليكم الكتاب بالحق } أي: ملتبسًا بالحق { لتحكم } بما فيه من الحق { بين الناس } بسبب ما { أراك } أي: عَرَّفك { الله } بالوحي\n أو بالاجتهاد\n ففيه دليل على إثبات القياس\n وبه قال الجمهور\n وفي اجتهاد الأنبياء خلاف\n { ولا تكن للخائنين خصيمًا } أي: عنهم للبرآء\n أو لأجلِهم والذَّبَّ عنهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:27",
      "similarity": 0.6470917146705508
    },
    {
      "verse": "12:52",
      "similarity": 0.5560607367728725
    },
    {
      "verse": "8:71",
      "similarity": 0.5448599974354327
    },
    {
      "verse": "40:19",
      "similarity": 0.5316219121318803
    },
    {
      "verse": "4:107",
      "similarity": 0.5287712915278194
    }
  ]
}