{
  "chapter": "النساء",
  "text": "ومن يهاجر فى سبيل الله يجد فى الارض مرغما كثيرا وسعة ومن يخرج منۢ بيته مهاجرا الى الله ورسوله ثم يدركه الموت فقد وقع اجره على الله وكان الله غفورا رحيما",
  "translations": [
    {
      "translation": "Those who make hijra in the Way of Allah will find many places of refuge on the earth and ample sustenance. If anyone leaves his home, making hijra to Allah and His Messenger, and death catches up with him, it is Allah Who will reward him. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever leaves his country in duty to God will find many places of refuge, and abundance on the earth. And he who leaves his home and becomes an emigre in the way of God and His Messenger, and death overtake him, is sure to receive his reward from God; for God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who emigrates in the way of Allah will find in the earth enough room for refuge and plentiful resources. And he who goes forth from his house as a migrant in the way of Allah and His Messenger, and whom death overtakes, his reward becomes incumbent on Allah. Surely Allah is All-Forgiving, All-Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One who abandons his home for the cause of God will find many places of refuge in the vast land and one who dies, after having abandoned his home to get near to God and His Messenger, will receive his reward from God. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever migrates for Allah's cause will find much shelter and abundant capacity in the earth; and whoever leaves his home, migrating towards Allah and His Noble Messenger, and death seizes him, his reward then lies entrusted with Allah; and Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who emigrates in the cause of Allah, will find on earth many dwelling places and plenty to live by. And whosoever leaves his home as an emigrant unto Allah and His Messenger, and death overtakes him, his reward is then surely incumbent upon Allah. And Allah is Ever Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever flies in Allah's way, he will find in the earth many a place of refuge and abundant resources, and whoever goes forth from his house flying to Allah and His Apostle, and then death overtakes him, his reward is indeed with Allah and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso emigrates in the way of God will find in the earth many refuges and plenty; whoso goes forth from his house an emigrant to God and His Messenger, and then death overtakes him, his wage shall have fallen on God; surely God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso migrateth for the cause of Allah will find much refuge and abundance in the earth, and whoso forsaketh his home, a fugitive unto Allah and His messenger, and death overtaketh him, his reward is then incumbent on Allah. Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever emigrates for the cause of God will find many places of refuge in the land and plentiful provision. Those who leave home for the cause of God and His Messenger; but is then overtaken by death, shall be recompensed by God. God is most forgiving and ever-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever migrateth in the way of Allah, shall find in the earth plentiful refuge and ampleness; and whosoever goes forth from his house as a fugitive unto Allah and His apostle, and death then overtaketh him his hire hath surely devolved upon Allah, and Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever migrates in the way of Allah will find many havens and plenitude in the earth. And whoever leaves his home migrating toward Allah and His Apostle, and is then overtaken by death, his reward shall certainly fall on Allah, and Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who forsakes his home in the cause of Allah, finds in the earth Many a refuge, wide and spacious: Should he die as a refugee from home for Allah and His Messenger, His reward becomes due and sure with Allah: And Allah is Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who emigrates (from his home) in the Cause of Allah, will find on earth many dwelling places and plenty to live by. And whosoever leaves his home as an emigrant unto Allah and His Messenger, and death overtakes him, his reward is then surely incumbent upon Allah. And Allah is Ever Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever emigrates in the way of Allah shall find in the land numerous refuges and abundance. Whosoever leaves his house an immigrant to Allah and His Messenger and then death overtakes him, his wage shall have fallen upon Allah. Allah is the Forgiver, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Anyone who emigrates for the sake of God will find on earth many places of refuge, and plentitude. Anyone who leaves his home, emigrating to God and His Messenger, and then is overtaken by death, his compensation falls on God. God is Forgiver, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever emigrates for the cause of Allah will find on the earth many [alternative] locations and abundance. And whoever leaves his home as an emigrant to Allah and His Messenger and then death overtakes him - his reward has already become incumbent upon Allah. And Allah is ever Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:100] Whoever emigrates in the way of God will find in the earth many refuges, places of emigration, and abundance, of provision; whoever goes forth from his house as an emigrant to God and His Messenger, and then death overtakes him, along the way, as occurred with Junda‘ [or Jundab] b. Damra al-Laythī, his wage is then incumbent upon, fixed [with], God; surely God is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whoso migrateth for the cause of Allah) in obedience of Allah (will find much refuge) and a sanctuary (and abundance) of means of living and safety (in the earth) in Medina. This was revealed about Aktham Ibn Sayfi and again about Jundu' Ibn Damura, an old man who lived in Mecca and who migrated from the latter to Medina but died in al-Tan'im. His reward is the same as the reward of those who made it to Mecca, and so he died with his endeavour highly praised. Allah said in this context: (and whoso forsaketh his home) in Mecca, (a fugitive unto Allah) unto the obedience of Allah (and His messenger) and unto His Messenger in Medina, (and death overtaketh him) at al-Tan'im, (his reward) the reward of his migration (is then incumbent on Allah. Allah is ever Forgiving) of his past idolatry, (Merciful) regarding that which ensued from him in Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَجِدْ فِي ٱلأَرْضِ مُرَٰغَماً } معناهُ مَذْهَبٌ وَمُتحولٌ\n\n\n\n\nوقوله تعالى: { فَقَدْ وَقَعَ أَجْرُهُ عَلىَ ٱللَّهِ } معناهُ ثَوابُهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {He will find in the earth much opposition} [means that] there is a way and a change.\n\n\nAnd His saying - {then has his reward fallen due from Allah } - its meaning is His recompense.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ ومن يُهَاجِر } أي مقارّ النفس المألوفة في سبيل طريق الحق بالعزيمة { يَجد } في أرض استعداده مهاجر ومساكن ومنازل كثيرة فيها رغم أنوف قوى نفسه الوهمية والخيالية والبهيمية والسبعية وإذلالها { وسعَة } وانشراحاً في الصدر عند الخلاص من ضيق صفات النفس وأسر الهوى { ومن يَخْرج } من المقام الذي هو فيه سواء كان مقرّ استعداده الذي جبل عليه أو منزلاً من منازل النفس أو مقاماً من مقامات القلب { مهاجراً إلى الله } بالتوجه إلى توحيد الذات { ورسوله } بالتوجه إلى طلب الاستقامة في توحيد الصفات { ثم يدركه } الانقطاع قبل الوصول { فقد وقع أجره على الله } بحسب ما توجه إليه، فإن المتوجه إلى السلوك له أجر المنزل الذي وصل إليه، أي: المرتبة من الكمال الذي حصل له إن كان، وأجر المقام الذي وقع نظره عليه وقصده. فإنّ ذلك الكمال وإن لم يحصل له بحسب الملك والقدم لكنه اشتاق إليه بحسب القصد والنظر، فعسى أن يؤيده التوفيق بعد ارتفاع الحجب بالوصول إليه { وكان الله غفوراً } يغفر له ما يمنعه عن قصده من الموانع { رحِيماً } يرحمه، بأن يهب له الكمال الذي توجه إليه ووقع نظره عليه.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَن يُهَاجِرْ } عن بقعة الإمكان التي هي أرض الطبيعة سالكاً { فِي سَبِيلِ اللَّهِ } الذي هو الصراط المستقيم الموصل إلى الفناء فيهن\n متوجهاً إلى الفوز ببقائه الأزلي السرمدي { يَجِدْ فِي ٱلأَرْضِ } أرض الطبيعة { مُرَٰغَماً كَثِيراً } أي: بوادي وأودية من اللذات الوهمية\n كثر وقوفه فيها إلى أن ينجو { وَ } يجد أيضاً { سَعَةً } مخرجاً من تلك المضائق حسب إخلاصه في سلوكه إلى أن يفوز بمطلوبه { وَ } بالجملة: أن { مَن يَخْرُجْ مِن بَيْتِهِ } أي: هويته الباطلة في نفسها حال كونه { مُهَاجِراً إِلَى } توحيد { ٱللَّهِ وَ } متابعة { رَسُولِهِ ثُمَّ يُدْرِكْهُ ٱلْمَوْتُ } الإرادي فمات عن لوازم البشرية مطلقاً { فَقَدْ وَقَعَ أَجْرُهُ عَلىَ ٱللَّهِ } كما قال سبحانه في الحديث القدسي:\n \" من أحبني أحببته\n ومن أحببته قتلته\n ومن قتلته فعلي ديته\n ومن علي ديته فأنا ديته \"\n \n \nمن هذا تفطن العارف أن ليس وراء الله مرمى\n وإياك أن تتقيد بهويتك ولوازمها\n ومتى تخلصت عنها وعن لوازمها وصلت\n بل اتصلت { وَكَانَ ٱللَّهُ } المرشد لعباده إلى توحيده { غَفُوراً } لذنوب أنانيتهم وهيتهم { رَّحِيماً } [النساء: 100] لهم يوصلهم إلى ما يتوجهون نحو\n\n\nثم قال سبحانه: { وَإِذَا ضَرَبْتُمْ } سافرتم { فِي ٱلأَرْضِ } لا لمعصية\n بل لمصلحة دينية من تجارة وغزو وحج وصلة وطلب علم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: المراغَم: المهرب والمذهب. قاله في القاموس. وقال البيضاوي: يجد متحولاً، من الرغام وهو التراب. وقيل: طريقًا يراغم قومه بسلوكه فيها، أي: يفارقهم على رغم أنوفهم، وهو أيضًا من الرغام. يقول الحقّ جلّ جلاله: { ومن يهاجر في سبيل الله } لإعلاء كلمة الله وإقامة دينه، { يجد في الأرض } فضاءً كثيرًا، ومتحولاً كبيرًا يتحول إليه، وسعة بدلاً من ضيق ما كان فيه، من قهر العدو ومنعه من إظهار دينه، أو سعةٌ في الرزق، وبسطًا في المعيشة، فلا عذر له في المقام في مكان مُضَيَّقٍ عليه فيه في أمر دينه، { ومن يخرج من بيته مهاجرًا إلى الله ورسوله } وجهادٍ في سبيله، { ثم يُدركه الموت } قبل وصوله فقد ثبت أجرُه، ووجب على الله ـ وجوب امتنان ـ أن يبلغه قصده بعد موته، { وكان الله غفورًا } لما سلف له من عدم المبادرة، { رحيمًا } به، حيث بلَّغه مأمولَه. نزلت في جُندع بن ضَمرة، وكان شيخًا كبيرًا مريضًا، فلما سمع ما نزل في شأن الهجرة قال: والله ما أنا ممن استثنى الله، ولي مال يُبِلغني المدينة، والله لا أبيتُ الليلة بمكة، اخرجُوا بي، فخرجوا به على سريره حتى أتوا به التنعيم، فأدركه الموت بها، فَصفَّق بيمينه على شماله، وقال: اللهم هذه لك وهذه لرسولك، أُبايعك على مَا بَايَعَك عليه رسولك، فمات حَمِيدًا. فقال الصحابة: لو وافَى المدينةَ، كان أتم أجرًا، وضحك المشركون، وقالوا: ما أدرك ما طلب. فنزلت: { ومن يخرج من بيته... } الخ. وقيل: نزلت في خالد بن حزام، فإنه هاجر إلى أرض الحبشة، فنهشته حيَّةٌ في الطريق، فمات قبل أن يصل. والله تعالى أعلم. الإشارة: ومن يهاجر من وطن حظوظه وهواه، طلبًا للوصول إلى حضرة مولاه، يجد في أرض نفسه متسعًا للعلوم، ومفتاحًا لمخازن الفهوم، وسعة الفضاء والشهود، حتى ينطوي في عين بصيرته كلُّ موجود، ويتحقق بشهود واجب الوجود. ومن يخرج من بيت نفسه وسجن هيكله إلى طلب الوصول إلى الله ورسوله، ثم يُدركه الموت قبل التمكين، فقد وقع أجره على الله، وبلَّغه الله ما كان قَصَدَه وتمنُّاه، فيُحشر مع الصديقين أهلِ الرسوخ والتمكين، التي تلي درجتُهم درجةَ النبيين، وكذلك من مات في طلب العلم الظاهر ولم يدركه في حياته، حشِر مع العلماء، قال ـ عليه الصلاة والسلام ـ:\n \" من جاءَه أجله وهو يطلبُ العلمَ لم يكن بينه وبين النبيين إلا درجةٌ واحدة \" \nقلت: وهذه الدرجة التي بينه وبين النبوة هي درجة الصديقين المتقدمة قبله. وكل من مات في طلب شيء من الخير، أدركه بعد موته بحسن نيته، كما في الأحاديث النبوية، قال القشيري: المهاجر في الحقيقة، من هاجر نفسه وهواه، ولا يصح ذلك إلا بانسلاخه عن جميع مراداته وقصوده، فمن قصَده ـ أي قصد الحق تعالى ـ ثم أدركه الأجلُ قبل وصوله، فلا ينزل إلا بساحات وصله، ولا يكون محط رفقته إلا مكان قربه. هـ. وفي بعض الآثار: الهجرة هجرتان: هجرة صُغرى، وهجرة كبرى، فالصغرى: انتقال الأجسام مِن وطنٍ غير مرضي إلى وطن مرضي، والكبرى: انتقال النفوس من مألوفاتها وحظوظها إلى معرفة ربها وحقوقها. هـ.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:145",
      "similarity": 0.13273446199837455
    },
    {
      "verse": "26:61",
      "similarity": 0.12842262953600134
    },
    {
      "verse": "27:66",
      "similarity": 0.12281271489290742
    },
    {
      "verse": "7:38",
      "similarity": 0.12049295541790364
    },
    {
      "verse": "6:103",
      "similarity": 0.11864843719761933
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004100.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004100.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:100.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}