{
  "chapter": "النساء",
  "text": "واذا ضربتم فى الارض فليس عليكم جناح ان تقصروا۟ من الصلوة ان خفتم ان يفتنكم الذين كفروا۟ ان الكفرين كانوا۟ لكم عدوا مبينا",
  "translations": [
    {
      "translation": "When you are travelling in the land, there is nothing wrong in your shortening your salat if you fear that those who are kafir may harass you. The kuffar are your clear-cut enemies.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you travel in the land there is no sin if you curtail your service of prayer if you fear the unbelievers may harass you, for indeed your open enemies are the infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you go forth journeying in the land, there is no blame on you if you shorten the Prayer, (especially) if you fear that the unbelievers might cause you harm. Surely the unbelievers are your open enemies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you are on a journey, it is no sin to shorten your prayers if you are afraid of the mischief of the unbelievers. The unbelievers have always been your sworn enemies\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you travel in the land, it is no sin for you to curtail some of your obligatory prayers; if you fear that disbelievers may cause you harm; undoubtedly the disbelievers are open enemies to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you Darabtum in the land, there is no sin on you if you shorten the Salah if you fear that the disbelievers may put you in trial, verily, the disbelievers are ever unto you open enemies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you journey in the earth, there is no blame on you if you shorten the prayer, if you fear that those who disbelieve will cause you distress, surely the unbelievers are your open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you are journeying in the land there is no fault in you that you shorten the prayer, if you fear the unbelievers may afflict you; the unbelievers are for you a manifest foe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when ye go forth in the land, it is no sin for you to curtail (your) worship if ye fear that those who disbelieve may attack you. In truth the disbelievers are an open enemy to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you [believers] are travelling in the land, you will not be blamed for shortening your prayers, if you fear the disbelievers may harm you. They are your avowed enemies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when ye are journeying in the earth there shall be no fault in you that ye shorten the prayer if ye fear that those who disbelieve shall molest you, verily the infidels are ever unto you an avowed enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you journey in the land, there is no sin upon you in shortening the prayers, if you fear that the faithless may trouble you; indeed the faithless are your manifest enemies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When ye travel through the earth, there is no blame on you if ye shorten your prayers, for fear the Unbelievers May attack you: For the Unbelievers are unto you open enemies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you (Muslims) travel in the land, there is no sin on you if you shorten your Salat (prayer) if you fear that the disbelievers may attack you, verily, the disbelievers are ever unto you open enemies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you are journeying in the land, there is no fault in you that you shorten the prayer if you fear that those who disbelieve will afflict you. Indeed, the unbelievers are a clear enemy for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you travel in the land, there is no blame on you for shortening the prayers, if you fear that the disbelievers may harm you. The disbelievers are your manifest enemies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you travel throughout the land, there is no blame upon you for shortening the prayer, [especially] if you fear that those who disbelieve may disrupt [or attack] you. Indeed, the disbelievers are ever to you a clear enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:101] And when you are going forth, travelling, in the land you would not be at fault if you shorten the prayer, by making it two [genuflexions] instead of four, if you fear that you may be afflicted by those who do not believe, that is, [if you fear] that you may be harmed [by them]: this [fear of affliction at the hands of the disbelievers] is [just intended as] an explication of the reality [of the situation] at that time and the point no longer applies. In the Sunna, it is pointed out that ‘travel’ (safar) means long-distance [travel], which is [approximately] 50 miles. God’s words ‘you would not be at fault’ should be understood as [denoting] a dispensation and not a requirement, and this is the opinion of al-Shāfi‘ī; the disbelievers are a manifest foe to you, their enmity being evident.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when ye go forth in the land) when you travel, (it is no sin for you to curtail (your) worship) curtail the prayer that a sedentary Muslim would usually perform (if ye fear) if you know (that those who disbelieve may attack you) may kill you while in prayer. (In truth the disbelievers are an open enemy to you) this is what is called the prayer of fear (salat al-khawf).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nوإذا سافرتم في أرض الاستعداد بالطريق العلميّ لطلب اليقين { فليس عليكم جُناح أن تقصروا } أي: تنقصوا من الأعمال البدنية وأداء حقوق العبودية من الشكر والحضور\n لقوله عليه الصلاة والسلام:\n \" من أوتي حظه من اليقين فلا يبالي بما انتقص من صلاته وصومه \"\n \n{ إن خفتم أن يَفْتنكُمْ } أي: يغويكم ويضلكم { الذينَ كَفَروا } أي: حجبوا من قوى الوهم والتخيل وشياطين الإنس الضالين المضلين لما علم من قوله صلى الله عليه وسلم:\n \" لَفَقيه واحد أشدّ على الشيطان من ألف عابد \"\n ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وغير ذلك { فَلَيْسَ عَلَيْكُمْ جُنَاحٌ } ضيق وزر { أَن تَقْصُرُواْ مِنَ ٱلصَّلَٰوةِ } الرباعية ركعتين { إِنْ خِفْتُمْ أَن يَفْتِنَكُمُ ٱلَّذِينَ كَفَرُوۤاْ } بالاحتيال والاغتيال { إِنَّ ٱلْكَافِرِينَ كَانُواْ } دائماً { لَكُمْ عَدُوّاً مُّبِيناً } [النساء: 101] ظاهر العداوة مترصدين للفرصة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { وإذا ضربتم في الأرض } ، أي: سافرتم للجهاد أو غيره من السفر المباح، أو المطلوب، { فليس عليكم جناح أن تقصروا من الصلاة } الرباعية إلى ركعتين، ونفيُ الجُناح يقتضي أنها رُخصة، وبه قال الشافعي، ويؤيده أنه ـ عليه الصلاة والسلام ـ أتمّ في السفر وأن عائشة ـ رضي الله عنها ـ قالت: يا رسول الله قَصَرْتَ وأتممْتُ، وصُمْتُ وأفطرتِ؟ فقال\n \" أحسنت يا عائشة \" \nوأوجبه أبو حنيفة لقول عمر رضي الله عنه:  السفر ركعتان تمام غير قصر، على لسان نبيكم. ولقول عائشة: أول ما فرضت الصلاة ركعتان، فأقرت صلاة السفر، وزيدت في الحضر. وقال مالك رضي الله عنه: القصرُ سنة لكونه ـ عليه الصلاة والسلام ـ دام عليه في كل سفر، ولم يتُم إلا مرةً لبيان الجواز. وقوله تعالى: { إن خفتم أن يفتنكم الذين كفروا } طاهرِه أن الخوف شرط في القصر، وبه قالت عائشة وعثمان ـ رضي الله عنهما ـ، والجمهور على عدم شرطه، وإنما ذكره الحق ـ تعالى ـ لكونه غالبًا في ذلك الوقت، فلا يعتبر مفهومه، أو يؤخذ القصر في الأمن من السُّنة. ويؤيد هذا حديثُ يَعلى بن أمِية، قلت لعمر بن الخطاب: إن الله يقول: { إن خفتم } ، وقد أمن الناس؟. فقال: عجبتُ مما تعجبتَ منه. فسألت رسول الله صلى الله عليه وسلم فقال:\n \" صَدقةٌ تصدَّق به الله علَيكم، فاقبلوا صدَقته \" \nوقد ثبت أن النبي صلى الله عليه وسلم قصر الصلاة وهو آمن. وليس في الآية ما يدل على تحديد المسافة التي تُقصَرُ فيها الصلاةُ، بل ذَكَرَ مطلقَ السفر، ولذلك أجاز الظاهرية القصر في كل سفر، طال أو قصر. ومذهب مالك والشافعي: أن المسافة أربعة بُردُ، واحتجوا بآثار عن ابن عمر وابن عباس. وقال أبو حنيفة: ستة بُرُد، وكذلك لم يقيد الحقُّ السفرَ بمباح ولا غيره، ولذلك أجاز أبو حنيفةٍ القصرَ في كل سفر. ومنعه مالك في سفر المعصية. ومنعه ابن حنبل في المعصية والمباح. والمراد بالفتنة في قوله: { إن خفتم أن يفتنكم }: الجهاد والتعرض لما يُكره، وعداوة الكفار معلومة. الإشارة: وإذا ضربتم في ميادين النفوس، وتحقق سيرُكم إلى حضرة القدوس، فلا جناح عليكم أن تقتصروا على المهم من الصلاة الحسية، وتدوموا على الصلاة القلبية، التي هي العكوف في الحضرة القدسية، إن خفتم أن تشغلكم عن الشهود حلاوةُ المعاملة الحسية. قال بعض العارفين: اتقوا حلاوة المعاملة، فإنها سموم قاتلة. وكذلك قال القطب بن مشيش في المقامات كالرضا، والتسليم: أخاف أن تشغلني حلاوتها عن الله. والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:10",
      "similarity": 0.46301931446209227
    },
    {
      "verse": "7:202",
      "similarity": 0.4438626581102563
    },
    {
      "verse": "37:48",
      "similarity": 0.43538580060527204
    },
    {
      "verse": "38:52",
      "similarity": 0.406721999547119
    },
    {
      "verse": "77:32",
      "similarity": 0.3754295856671376
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/4:101.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/4:101.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/4:101.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}