{
  "chapter": "النساء",
  "text": "هانتم هؤلاء جدلتم عنهم فى الحيوة الدنيا فمن يجدل الله عنهم يوم القيمة ام من يكون عليهم وكيلا",
  "translations": [
    {
      "translation": "Here you are arguing on their behalf in this world, but who will argue with Allah on their behalf on the Day of Rising? Who will act as guardian for them then?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Well, you are those who pleaded for them in the life of this world; but who will plead for them on the Day of Resurrection or be their security?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You pleaded on their behalf in this worldly life but who will plead with Allah on their behalf on the Day of Resurrection, or who will be their defender there?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You defend them in this life but who will defend them against God on the Day of Judgment and who will be their attorney?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pay heed! It is you people who argued on their behalf in the life of this world; so who will fight on their behalf with Allah on the Day of Resurrection, or who will be their pleader?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! You are those who have argued for them in the life of this world, but who will argue for them on the Day of Resurrection against Allah, or who will then be their defender\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! you are they who (may) plead for them in this world's life, but who will plead for them with Allah on the resurrection day, or who shall be their protector?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ha, there you are; you have disputed on their behalf in the present life; but who will dispute with God on their behalf on the Resurrection Day, or who will be a guardian for them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ho! ye are they who pleaded for them in the life of the world. But who will plead with Allah for them on the Day of Resurrection, or who will then be their defender?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You might argue on their behalf in the life of this world: but who will argue on their behalf with God on the Day of Resurrection and who will be their defender?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! it is ye who have contended for them in the life of the world; then who will contend for them with Allah on the Day of Resurrection, or who shall be their champion?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aha! There you are, pleading for them in the life of this world! But who will plead for them with Allah on the Day of Resurrection, or will be their defender?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ah! These are the sort of men on whose behalf ye may contend in this world; but who will contend with Allah on their behalf on the Day of Judgment, or who will carry their affairs through?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! You are those who have argued for them in the life of this world, but who will argue for them on the Day of Resurrection against Allah, or who will then be their defender?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There you are, you have argued on their behalf in the worldly life, but who will argue with Allah on their behalf on the Day of Resurrection! Or who will be a guardian for them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There you are, arguing on their behalf in the present life, but who will argue with God on their behalf on the Day of Resurrection? Or who will be their representative?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Here you are - those who argue on their behalf in [this] worldly life - but who will argue with Allah for them on the Day of Resurrection, or who will [then] be their representative?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:109] Ah! There you are (addressing Tu‘ma’s clan) you have contested, you have disputed, on their behalf, that is to say, on behalf of Tu‘ma and his men (a variant reading has ‘anhu, ‘on his behalf’) in the life of this world; but who will contest against God on their behalf on the Day of Resurrection, if He were to punish them, or who will be a guardian for them, and take charge of their affair or defend them? In other words, no one will do such a thing.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! you are) the people of Tu'mah, i.e. the Banu Zufr (they who pleaded) argue (for them) for Tu'mah (in the life of the world. But who will plead) argue (with Allah for them) Tu'mah (on the Day of Resurrection, or who will then be their) Tu'mah's (defender) who will bail him out from Allah's torment? 100\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ هَٰأَنْتُمْ } أيها المجادلون المبطلون { هَـٰؤُلاۤءِ } الخائنون المفترون { جَٰدَلْتُمْ عَنْهُمْ فِي ٱلْحَيَٰوةِ ٱلدُّنْيَا } فسترتم ما عرض بهم من الخيانة والعار في هذه الدار { فَمَن يُجَٰدِلُ ٱللَّهَ } المنتقم { عَنْهُمْ يَوْمَ ٱلْقِيَٰمَةِ } ويستر زلتهم عنه فيها { أَمْ مَّن يَكُونُ عَلَيْهِمْ وَكِيلاً } [النساء: 109] بظاهرهم، وينقذهم من عذاب الله وبطشه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:68",
      "similarity": 0.566983994636146
    },
    {
      "verse": "16:111",
      "similarity": 0.5112516858323471
    },
    {
      "verse": "22:8",
      "similarity": 0.5059171602972623
    },
    {
      "verse": "11:32",
      "similarity": 0.428857231776175
    },
    {
      "verse": "18:54",
      "similarity": 0.41872532028603016
    }
  ]
}