{
  "chapter": "النساء",
  "text": "يستخفون من الناس ولا يستخفون من الله وهو معهم اذ يبيتون ما لا يرضى من القول وكان الله بما يعملون محيطا",
  "translations": [
    {
      "translation": "They try to hide from (men), but they cannot hide from God who is with them at night when they discuss such matters as He does not approve; but what they do is well within the compass of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They can hide (their deeds) from men but they cannot hide (them) from Allah for He is with them even when they hold nightly counsels that are unpleasing to Allah. Allah encompasses all their doings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They hide their sins from other people but they cannot hide themselves from God who is constantly with them, even when they hold nocturnal meetings, a thing which God does not like. God comprehends all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They hide from men and do not hide from Allah, whereas Allah is with them when they plan in their hearts that which displeases Him; and Allah has their deeds encompassed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They may hide (their crimes) from men, but they cannot hide (them) from Allah; for He is with them (by His knowledge), when they plot by night in words that He does not approve. And Allah ever encompasses what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They hide themselves from men and do not hide themselves from Allah, and He is with them when they meditate by night words which please Him not, and Allah encompasses what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They hide themselves from men, but hide not themselves from God; for He is with them while they meditate at night discourse unpleasing to Him; God encompasses the things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They seek to hide from men and seek not to hide from Allah. He is with them when by night they hold discourse displeasing unto Him. Allah ever surroundeth what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They feel ashamed before men but do not feel ashamed before God, despite His being present with them when they plot at night, uttering things of which He does not approve; and indeed God is fully aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They feel ashamed of men and feel not ashamed of Allah, whereas He is Present with them when by night they plan together of discourse which pleaseth Him not; and Allah is of that which they work ever an Encompasser.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They try to hide [their real character] from people, but they do not try to hide from Allah, though He is with them when they conspire overnight with a discourse that He does not approve of. And Allah comprehends whatever they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They may hide (Their crimes) from men, but they cannot hide (Them) from Allah, seeing that He is in their midst when they plot by night, in words that He cannot approve: And Allah Doth compass round all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They may hide (their crimes) from men, but they cannot hide (them) from Allah, for He is with them (by His Knowledge), when they plot by night in words that He does not approve, And Allah ever encompasses what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They seek to hide themselves from the people, but they do not hide themselves from Allah for He is with them when they hide the saying that does not please Him. Allah encompasses what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They hide from the people, but they cannot hide from God. He is with them, as they plot by night with words He does not approve. God comprehends what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They conceal [their evil intentions and deeds] from the people, but they cannot conceal [them] from Allah, and He is with them [in His knowledge] when they spend the night in such as He does not accept of speech. And ever is Allah, of what they do, encompassing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:108] They, the likes of Tu‘ma and his clan, hide themselves, in shame, from people, but they do not hide themselves from God; for He is with them, in His knowledge [of them], while they plot, they conspire, at night with discourse displeasing to Him, in their resolve to swear by God and deny the theft and accuse the Jew of it. God is ever Encompassing, in knowledge, of what they do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They seek to hide from) they are ashamed of (men and seek not to hide from Allah) but they feel no shame towards Allah. (He is with them) He is Aware of them (when by night they hold discourse displeasing unto Him) they utter that which displeases Allah and displeases people. (Allah ever surroundeth what they do) and say.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذْ يُبَيِّتُونَ } معناهُ يَقولونَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوهم من غاية عمههم وجهلهم { يَسْتَخْفُونَ } خيانتهم { مِنَ ٱلنَّاسِ } مع بعدهم عنهم { وَلاَ يَسْتَخْفُونَ مِنَ ٱللَّهِ وَهُوَ مَعَهُمْ } والرقيب عليهم أقرب من وريدهم { إِذْ يُبَيِّتُونَ } يلبسون ويزورون { مَا لاَ يَرْضَىٰ } الله { مِنَ ٱلْقَوْلِ } الكاذب ورمي البرئ وشهادة الزور، والحلف الكاذب وغير ذلك { وَكَانَ ٱللَّهُ } المطلع بسرائرهم وضمائركم { بِمَا يَعْمَلُونَ } من أمثال هذه الأباطيل الزائفة { مُحِيطاً } [النساء: 108] لا يعزب عن عمله شيء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم فَضحَ سرهم، فقال: { يستخفون من الناس } أي: يستترون منهم، { ولا يستخفون من الله } وهو أحق أن يستحيا منه ويُخاف { وهو معهم } لا يخفى عليه شيء، فلا طرق للنجاة إلا تَركُ ما يستُقبح، ويؤاخذ عليه سرًا وجهرًا\n { إذ يُبيتون }  أي: يدبرون ويُزَوِّرُون { ما لا يرضى من القول } من رمي البريء، والحلف الكاذب، وشهادة الزور، { وكان الله بما يعملون محيطًا } لا يفوته شيء، { ها أنتم هؤلاء جادلتم عنهم في الحياة الدنيا } ودفعتم عنهم المعرة، { فَمن يجادل الله عنهم } أي: مَن يُدافُع عنهم عذابه { يوم القيامة أم من يكون عليهم وكيلاً } يحميهم من عقاب الله، حين تُفضَح السرائر، ولا تنفع الأصحاب ولا العشائر\n\n\nالإشارة: في الآية عتاب للقضاة والولاة إذا ظهرت صورة الحق بأمارات وقرائن، ثم تجمدوا على ظاهر الشريعة، حمية أو رشوة، فإن القضاء جُلّة فِراسة، وفيها عتاب لشيوخ التربية، إذا ظهر لهم عيب في المريد ستروه عليه حيَاء أو شفقة، ولذلك قالوا: شيخ التربية لا تليق به الشفقة، غير أنه لا يُعيَّن، بل يذكر في الجملة، وصاحب العيب يفهم نفسه، وفيها عتاب للفقراء إذا راقبوا الناس، وأظهروا لهم ما يُحبون، وأخفوا عنهم ما لا يرضون، لقوله ـ سبحانه ـ: { يستخفون من الناس\n\n\n } الآية، بل ينبغي أن يكونوا بالعكس من هذا، قال بعضهم: إن الذين تكرهون مني، هو الذي يشتهيه قلبي\n والله تعالى أعلم\n\n",
      "translations": []
    }
  ]
}