{
  "chapter": "النساء",
  "text": "لا خير فى كثير من نجوىهم الا من امر بصدقة او معروف او اصلحۭ بين الناس ومن يفعل ذلك ابتغاء مرضات الله فسوف نؤتيه اجرا عظيما",
  "translations": [
    {
      "translation": "There is no good in much of their secret talk, except in the case of those who enjoin sadaqa, or what is right, or putting things right between people. If anyone does that, seeking the pleasure of Allah, We will give him an immense reward.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their confidential counsels are seldom for the good, save of those who talk of charity or goodness or peace among men. Whosoever does so for the pleasure of God, We shall give him an ample reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most of their secret conferrings are devoid of good, unless one secretly enjoins in charity, good deeds, and setting the affairs of men right. We shall grant who ever does that seeking to please Allah a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is nothing good in much of their secret talks except for that which is for charity, justice, or for reconciliation among people to seek thereby the pleasure of God for which We will give a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most of their discussions do not contain any good, except of the one who enjoins charity or goodness or peace-making among people; whoever does that to seek the pleasure of Allah – We shall soon give him a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no good in most of their secret talks save (in) him who orders Sadaqah, or goodness, or conciliation between mankind; and he who does this, seeking the good pleasure of Allah, We shall give him a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no good in most of their secret counsels except (in his) who enjoins charity or goodness or reconciliation between people; and whoever does this seeking Allah's pleasure, We will give him a mighty reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No good is there in much of their conspiring, except for him who bids to freewill offering, or honour, or setting things right between the people. Whoso does that, seeking God's good pleasure, We shall surely give him a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no good in much of their secret conferences save (in) him who enjoineth almsgiving and kindness and peace-making among the people. Whoso doeth that, seeking the good pleasure of Allah, We shall bestow on him a vast reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no good in most of their secret talk, except in the case of those who enjoin charity and kindness, or reconciliation between people. If anyone does that, seeking the pleasure of God, We will give him an immense reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No good is there in much of their whispers except in his who commandeth charity or kindness or reconciliation among mankind; and whosoever doeth this seeking the good-will of Allah, We shall presently give him a mighty hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no good in much of their secret talks, excepting him who enjoins charity or what is right or reconciliation between people, and whoever does that, seeking Allah’s pleasure, soon We shall give him a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In most of their secret talks there is no good: But if one exhorts to a deed of charity or justice or conciliation between men, (Secrecy is permissible): To him who does this, seeking the good pleasure of Allah, We shall soon give a reward of the highest (value).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no good in most of their secret talks save (in) him who orders Sadaqah (charity in Allah's Cause), or Ma'ruf (Islamic Monotheism and all the good and righteous deeds which Allah has ordained), or conciliation between mankind, and he who does this, seeking the good Pleasure of Allah, We shall give him a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no good in much of their confiding, except for he who bids to charity, honor, or reforms between people. Whosoever does that for the sake of the pleasure of Allah, We shall give him a great wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no good in much of their private counsels, except for him who advocates charity, or kindness, or reconciliation between people. Whoever does that, seeking God’s approval, We will give him a great compensation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No good is there in much of their private conversation, except for those who enjoin charity or that which is right or conciliation between people. And whoever does that seeking means to the approval of Allah - then We are going to give him a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:114] There is no good in much of their, that is, of people’s, secret conversations, that is, what they converse and talk secretly about, except for, the secret talk of, he who enjoins to voluntary almsgiving, or kindness, a righteous deed, or setting things right between people. And whoever does that, the aforementioned, desiring, seeking, God’s good pleasure, [and] nothing else of the affairs of this world, We shall surely give him (read nu’tīhi or yu’tīhi, ‘He will give him’, that is, ‘God [will give him]’) a great wage.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(There is no good in much of their) i.e. of the clan of Tu'mah's (secret conferences save (in) him who enjoineth almsgiving) him who encourages the giving of alms to the poor (and kindness) giving a loan to another person (and peace making among the people) reconciliation between Tu'mah and Zayd Ibn Samin, the Jew. (Whoso doeth that) giving alms and lending money, (seeking the good pleasure of Allah) only seeking Allah's contentment, (We shall bestow on him a vast reward) in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَّ خَيْرَ فِي كَثِيرٍ مِّن نَّجْوَاهُمْ } معناهُ مِنْ أَسْرارِهِمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {There is no good in most of their secret talk}, means that their secrets are not good.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إلا من أمر } أي: إلا نجوى من أمر { بصدقة } أي: بفضيلة السخاء التي هي من باب العفة { أو معروف } قوليّ كتعليم علم وحكمة من باب فضيلة الحكمة\n أو فعليّ كإغاثة ملهوف وإعانة مظلوم من باب الشجاعة { أو إصلاح بين الناس } من باب العدالة { ومن يفعل ذلك } أي: يجمع بين الكمالات المذكورة { ابْتِغاء مرضَاتِ الله } لا لطلب المحمدة أو الرياء والسمعة\n فتصير به الفضيلة رذيلة { فسوف نُؤتيه أجْراً عَظِيماً } من جنات الصفات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذا كان شأنك عند الله هذا\n لا تبالك بهم وبمعاونتهم ومصاحبتهم\n إذ { لاَّ خَيْرَ فِي كَثِيرٍ مِّن نَّجْوَاهُمْ } دعائهم ومناجاتهم في خلواتهم { إِلاَّ مَنْ أَمَرَ } نفسه { بِصَدَقَةٍ } على الفقراء موجبة لرحمة الله له { أَوْ مَعْرُوفٍ } مستحسن عقلاً وشرعاً من الأخلاق الحميدة والخصائل المرضية { أَوْ إِصْلاَحٍ بَيْنَ ٱلنَّاسِ } على الوجه الأحسن الأوفق { وَمَن يَفْعَلْ ذٰلِكَ } كل واحد من ذلك { ٱبْتِغَآءَ مَرْضَاتِ ٱللَّهِ } خالصاً لرضاه\n بل تخلل الرياء والسمعة\n وقصد الرئاسة والجاة بين الأنام { فَسَوْفَ نُؤْتِيهِ } من فضلنا وجودنا { أَجْراً عَظِيماً } [النساء: 114] فوق ما يستحقه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: إن كان المراد بالنجوى الكلام الخفي فالاستثناء منقطع، وقد يكون متصلاً على حذف مضاف أي: إلا نجوى مَن أمر... الخ، وإن كان المراد بالنجوى الجماعة المتناجين، بالاستثناء متصل. قاله ابن جزي. يقول الحقّ جلّ جلاله: محرّضًا على الصمت: { لا خير في كثير } مما يتناجون به في شأن السارق أو غيره، بل لا خير في الكلام بأسره { إلا من أمر بصدقة } واجبة أو تطوعية، فله مثل أجره، { أو معروف } وهو: ما يستحسنه الشرع، ويوافقه العقل، كالقرض، وإغاثة الملهوف، وتعليم الجاهل، وإرشاد الضال، وغير ذلك من أنواع المعروف. أو أمر بإصلاح { بين الناس } ، أي: إصلاحات ذات البين، كإصلاح بين طعمة واليهودي وغيرهما. قال مجاهد:  هي عامة للناس، يريد أنه لا خير فيما يتناجى في الناس، ويخوضون فيه من الحديث، إلا ما كان من أعمال الخير. { ومن يفعل ذلك } أي: الصدقة، والمعروف والإصلاح، { ابتغاء مرضات الله } أي: مُخلصًا لله { فسوف نؤتيه أجرًا عظيمًا } وخيرًا جسيمًا. قال البيضاوي: بَنَى الكلامَ على الأمر، ورتَّب الجزاء على الفعل، ليدل على أنه لما دخل الآمر في زمرة الخَيّرين كان الفاعل أدخل فيهم، وأن العمدة والغرض هو الفعل، واعتبار الأمر من حيث إنه وصلة إليه. وقيد الفعل بأن يكون لطلب مرضاة الله لأن الأعمال بالنيات، وإن من فعل خيرًا رياء وسمعة، لم يستحق بها من الله أجرًا، ووصف الأجر بالعظم تنبيهًا على حقارة ما فات في جنبه من أغراض الدنيا. هـ. الإشارة: في الآية حثٌّ على الصمت، وهو ركن قوي في طريق التصوف، وهو أحد الأركان الأربعة التي هي: العزلة والجوع والسهر، فهذه طريق أهل البداية، ومن لا بداية له لا نهاية له، وقالوا: بقدر ما يصمت اللسان يعمر الجنان، وبقدر ما كان يتكلم اللسان يخرب الجنان. وقالوا أيضًا: إذا كثر العلمُ قلَّ الكلام، وإذا قل العلم كثر الكلام، وقالوا أيضًا: من عرف الله كَلَّ لسانهُ. وقيل لبعض العلماء: هل العلم فيما سلف أكثر، أو اليوم أكثر؟ قال: العلم فيما سلف أكثر، والكلامُ اليومَ أكثر. وفي قوله: { ومن يفعل ذلك... } إشارة إلى أن العمل أشرف من العلم بلا عمل. والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "92:21",
      "similarity": 0.4090287187232316
    },
    {
      "verse": "4:152",
      "similarity": 0.34007720225599336
    },
    {
      "verse": "4:74",
      "similarity": 0.3251401528921257
    },
    {
      "verse": "4:146",
      "similarity": 0.3029281539529465
    },
    {
      "verse": "93:5",
      "similarity": 0.2885029543330991
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004114.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004114.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:114.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}