{
  "chapter": "النساء",
  "text": "ومن يكسب خطيـة او اثما ثم يرم به بريـا فقد احتمل بهتنا واثما مبينا",
  "translations": [
    {
      "translation": "Anyone who commits an error or an evil action, and then ascribes it to someone innocent, bears the weight of slander and clear wrongdoing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who commits a mistake or iniquity and ascribes it to one who is innocent, is guilty of calumny and brazen sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who commits either a fault or a sin, and then casts it upon an innocent person, lays upon himself the burden of a false charge and a flagrant sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One who makes a mistake or commits a sin and ascribes it to an innocent person, he only burdens himself with slander and a grave sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever commits a mistake or a sin, then blames it on someone innocent has indeed burdened himself with infamy and a manifest crime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever earns a fault or a sin and then blames it on someone innocent, he has indeed burdened himself with falsehood and a manifest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever commits a fault or a sin, then accuses of it one innocent, he indeed takes upon himself the burden of a calumny and a manifest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever earns a fault or a sin and then casts it upon the innocent, thereby has laid upon himself calumny and manifest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoso committeth a delinquency or crime, then throweth (the blame) thereof upon the innocent, hath burdened himself with falsehood and a flagrant crime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And anyone who commits an offence or a sin, then charges an innocent person with it, shall certainly bear the guilt of a calumny and a manifest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever earnoth a vice or a sin, and thereafter casteth it on an innocent, he hath surely borne a calumny and a manifest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But someone who commits an iniquity or sin and then accuses an innocent person of it, is indeed guilty of calumny and a flagrant sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if any one earns a fault or a sin and throws it on to one that is innocent, He carries (on himself) (Both) a falsehood and a flagrant sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever earns a fault or a sin and then throws it on to someone innocent, he has indeed burdened himself with falsehood and a manifest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever earns a fault or a sin and casts it upon the innocent, indeed, he bears the slander and a clear sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever commits a mistake, or a sin, and then blames it on an innocent person, has taken a slander and a clear sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever earns an offense or a sin and then blames it on an innocent [person] has taken upon himself a slander and manifest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:112] And whoever commits a mistake, a minor sin, or a sin, a grave sin, and then casts it upon the innocent, [one who is innocent] of it, he has thereby burdened himself with calumny, by his false accusation, and a manifest sin, [one which is] evident on account of what he has committed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And whoso commiteth a delinquency) a theft (or crime) and falsely swears by Allah, (then throweth (the blame)) the theft (thereof upon the innocent) Zayd Ibn Samin, (hath burdened himself) has sentenced himself (with falsehood) the punishment of a great falsehood (and a flagrant crime) and the punishment of a flagrant sin.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ومن يكسب خطيئة } بظهور نفسه { أو إثماً } يمحو ما في استعداده وكسب هيئة منافية لكماله { ثم يرم به بريئاً } بأن قال: حملني على ذلك فلان، ومنعني عن طلب الحق فلان، وهذا جريمة فلان، كما هو عادة المتعللين بالأعذار { فقد احْتمل بهتاناً } بنسبة فعله إلى الغير إذ لو لم يكن في نفسه ميل لما يضادّ كماله ومناسبة لمن وافقه وأطاعه لما قبل ذلك منه، فما كان إلا من قبل نفسه كما قال لهم الشيطان:\n",
      "translations": [
        {
          "translation": "\n\nAnd whoever earns a sin by showing himself {or a sin} wipes out what is in preparation for him and earns a body opposed to his perfection {then he is absolved of it completely}. He said: \"Let me be charged with that.\",\n\nAnd I forbid myself from seeking the rights of so-and-so.,\n\nThis is a crime committed by so-and-so.,\nAs is usual for those who excuse themselves { for having erred }, they make their own error a proportion of their total, as if it were not in itself an inclination to what contradicts its perfection and fitness for him who agrees with and follows what came before it from him.,\n\n{It was nothing but} Satan's own doing, {as he said to them}:",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَن يَكْسِبْ } منكم { خَطِيۤئَةً } معصية صادرة عن خطأ لا عن قصد { أَوْ إِثْماً } صادراً عن قصد وعن اختيار { ثُمَّ يَرْمِ بِهِ } منزهاً عند نزاهة نفسه { بَرِيئاً فَقَدِ ٱحْتَمَلَ } وتحمل الرامي { بُهْتَاناً } افتراء { وَإِثْماً مُّبِيناً } [النساء: 112] في إسقاط العدالة واستجلاب العذاب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:58",
      "similarity": 0.5671592856029868
    },
    {
      "verse": "8:17",
      "similarity": 0.44961245155937807
    },
    {
      "verse": "24:6",
      "similarity": 0.4290512010864506
    },
    {
      "verse": "4:156",
      "similarity": 0.4205351129538644
    },
    {
      "verse": "77:32",
      "similarity": 0.40938408376225366
    }
  ]
}