{
  "chapter": "النساء",
  "text": "ان الله لا يغفر ان يشرك به ويغفر ما دون ذلك لمن يشاء ومن يشرك بالله فقد ضل ضللۢا بعيدا",
  "translations": [
    {
      "translation": "Allah does not forgive anything being associated with Him but He forgives whoever He wills for anything other than that. Anyone who associates something with Allah has gone very far astray.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not forgive that compeers be ascribed to Him, and absolves all else whatsoever He will. And he who associates compeers with God has indeed wandered far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly it is only associating others with Allah in His divinity that Allah does not forgive, and forgives anything besides that to whomsoever He wills. Whoever associates others with Allah in His divinity has indeed strayed far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not forgive the sin of considering something equal to Him, but He may forgive the other sins of whomever He wants. One who considers anything equal to God has certainly gone far away from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not forgive (the greatest sin) that partners be ascribed with Him – and He forgives all that is below (lesser sins) it, to whomever He wills; and whoever ascribes partners with Allah has indeed wandered far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah forgives not (the sin of) setting up partners (in worship) with Him, but He forgives whom He wills, sins other than that, and whoever sets up partners in worship with Allah, has indeed strayed far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah does not forgive that anything should be associated with Him, and He forgives what is besides this to whom He pleases; and whoever associates anything with Allah, he indeed strays off into a remote error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God forgives not that aught should be with Him associated; less than that He forgives to whomsoever He will. Whoso associates with God anything, has gone astray into far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah pardoneth not that partners should be ascribed unto Him. He pardoneth all save that to whom He will. Whoso ascribeth partners unto Allah hath wandered far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, God will not forgive the ascribing of partners to Him. He forgives whoever He will for anything other than that. Whoever ascribes partners to God has strayed far indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah shall not forgive that aught be associated with Him, and He will forgive all else unto whomsoever He liketh; and whosoever associateth ought with Allah, hath surely strayed away a far straying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah does not forgive that any partner should be ascribed to Him, but He forgives anything besides that to whomever He wishes. And whoever ascribes partners to Allah has certainly strayed into far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah forgiveth not (The sin of) joining other gods with Him; but He forgiveth whom He pleaseth other sins than this: one who joins other gods with Allah, Hath strayed far, far away (from the right).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! Allah forgives not (the sin of) setting up partners in worship with Him, but He forgives whom he pleases sins other than that, and whoever sets up partners in worship with Allah, has indeed strayed far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not forgive (the sin of inventing an) association with Him, but He forgives other sins to whomsoever He will. Whosoever associates with Allah has gone astray in far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not forgive that partners be associated with Him; but will forgive anything less than that, to whomever He wills. Anyone who ascribes partners to God has strayed into far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah does not forgive association with Him, but He forgives what is less than that for whom He wills. And he who associates others with Allah has certainly gone far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:116] God does not forgive that anything should be associated with Him; He forgives all except that, to whomever He will. Whoever associates anything with God, verily he has strayed far away, from the truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي ، جعل تمهيداً لما بعده من وصف أحوال شركهم . وتعقيب الآية السابقة بهذه مشير إلى أنّ المراد باتّباع غير سبيل المؤمنين اتّباع سبيل الكفر من شرك وغيره ، فعقّبه بالتحذير من الشرك ، وأكّده بأنّ للدلالة على رفع احتمال المبالغة أو المجاز . وتقدّم القول في مثل هذه الآية قريباً . غير أنّ الآية السابقة قال فيها { ومن يشرك بالله فقد افترى إثماً عظيماً } \\[ النساء : 48 \\] وقال في هذه { فقد ضل ضلالاً بعيداً } وإنّما قال في السابقة { فقد افترى إثماً عظيماً } لأنّ المخاطب فيها أهل الكتاب بقوله : { يأيّها الذين أوتوا الكتاب آمنوا بما نزّلنا مصدّقاً لما معكم } \\[ النساء : 47 \\] فنبّهوا على أنّ الشرك من قبيل الافتراء تحذيراً لهم من الافتراء وتفظيعاً لجنسه . وأمّا في هذه الآية فالكلام موجه إلى المسلمين فنبّهوا على أنّ الشرك من الضلال تحذيراً لهم من مشاقة الرسول وأحوال المنافقين فإنها من جنس الضلال . وأكِّدَ الخبر هنا بحرف ( قَدْ ) اهتماماً به لأنّ المواجه بالكلام هنا المؤمنون ، وهم لا يشكّون في تحقّق ذلك .والبعيد أريد به القويّ في نوعه الذي لا يرجى لصاحبه اهتداء ، فاستعير له البعيد لأنّ البعيد يُقصي الكائن فيه عن الرجوع إلى حيث صدر .\n\n",
      "translations": [
        {
          "translation": "(Lo! Allah pardoneth not that partners should be ascribed unto him) if one dies in this state, such as Tu'mah. (He pardoneth all save that) save the ascription of partners to Him (to whom He will) to whoever is fit for it. (Whoso ascribeth partners unto Allah hath wandered far astray) from guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n تسلية للعصاة وترغيباً لهم إلى الإنابة والرجوع: { إِنَّ ٱللَّهَ } المطلع لسرائر عباده { لاَ يَغْفِرُ } ولا يعفو { أَن يُشْرَكَ بِهِ } شيئاً من مصنوعاته في استحقاق العبادة\n وإسناد الحوادث نحوه { وَيَغْفِرُ مَا دُونَ ذٰلِكَ لِمَن يَشَآءُ } وإن استكرهه واستنكره وندم منه\n ولم يصر عليه { وَمَن يُشْرِكْ بِٱللَّهِ } بنسبة الحوادث الكائنة إلى غيره { فَقَدْ ضَلَّ } عن جادة التوحيد { ضَلاَلاً بَعِيداً } [النساء: 116] لا ترجى هدايته أصلا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم نزل في طُعمة لما ارتد مشركًا: { إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء } وقيل: كرر للتأكيد تقبيحًا لشأن الشرك\n وقيل: أتى شيخ إلى رسول الله صلى الله عليه وسلم فقال: إني شيخ منهمك في الذنوب إلا أني لم أشرك بالله شيئًا منذ عرفتُه وآمنتُ به\n ولم أتخذ من دونه وليًا\n ولم أوقع المعاصي جرأة\n وما توهمت طرفة عين أني أُعجز الله هربًا\n وإني لنادم تائب\n فما ترى حالي عند الله؟ فنزلت\n { ومن يشرك بالله فقد ضل } عن الحق { ضلالاً بعيدًا } لإن الشّرك أقبح أنواع الضلالة\n وأبعدها عن الثواب والاستقامة\n وإنما ذكر في الآية الأولى\n { فقد افترى } لأنها متصلة بقصة أهل الكتاب\n ومنشأ شركهم نوع افتراء\n وهو دعوى الشيء على الله\n قاله البيضاوي\n الإشارة: كل من خالف شيخه\n وسلك طريقًا غير طريقة ولاه الله ما تولى\n واستدرجه من حيث لا يشعر\n وقد تؤخر العقوبة عنه فيقول: لو كان هذا فيه سوء أدب مع الله\n لقطع الإمداد وأوجب البعاد\n وقد يقطع عنه من حيث لا يشعر\n ولو لم يكن إلا وتخليته وما يريد\n وبالجملة: فالخروج عن مشايخ التربية والانتقال عنهم\n ولو إلى من هو أكمل في زعمه\n بعد ما ظهر له الفتح والهداية على يديه طردٌ وبعدٌ\n وإفساد لبذرة الإرادة\n فلا نتيجة له أصلاً\n والله تعالى أعلم\n وبالله التوفيق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:48",
      "similarity": 0.4943614205505311
    },
    {
      "verse": "22:12",
      "similarity": 0.41731972004066653
    },
    {
      "verse": "42:46",
      "similarity": 0.4122956851966552
    },
    {
      "verse": "40:74",
      "similarity": 0.39678997555909024
    },
    {
      "verse": "16:86",
      "similarity": 0.37799899191571434
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004116.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004116.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:116.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}