{
  "chapter": "النساء",
  "text": "ومن يعمل سوءا او يظلم نفسه ثم يستغفر الله يجد الله غفورا رحيما",
  "translations": [
    {
      "translation": "Anyone who does evil or wrongs himself and then asks Allah's forgiveness will find Allah Ever-Forgiving,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who does evil or acts against his own interests (by disbelieving), then prays for God's forgiveness, will find God compassionate and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who does either evil or wrongs himself, and then asks for the forgiveness of Allah, will find Allah All-Forgiving, All-Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One who commits a sin or does wrong to himself and then seeks forgiveness from God, will find God All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does evil or wrongs his own soul and then seeks forgiveness from Allah, will find Allah Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does evil or wrongs himself but afterwards seeks Allah's forgiveness, he will find Allah Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does evil or acts unjustly to his soul, then asks forgiveness of Allah, he shall find Allah Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever does evil, or wrongs himself; and then prays God's forgiveness, he shall find God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet whoso doeth evil or wrongeth his own soul, then seeketh pardon of Allah, will find Allah Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet anyone who does evil or wrongs his own soul and then asks God for forgiveness will find God forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever worketh an ill or wrongeth his own soul, and thereafter beggeth forgiveness of Allah shall find Allah Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever commits evil or wrongs himself and then pleads to Allah for forgiveness, will find Allah all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any one does evil or wrongs his own soul but afterwards seeks Allah's forgiveness, he will find Allah Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does evil or wrongs himself but afterwards seeks Allah's Forgiveness, he will find Allah Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who does evil or wrongs himself and then asks forgiveness of Allah will find that Allah is the Forgiver, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever commits evil, or wrongs his soul, then implores God for forgiveness, will find God Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does a wrong or wrongs himself but then seeks forgiveness of Allah will find Allah Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:110] Whoever does evil, [commits] a sin by which another is harmed, as when Tu‘ma falsely accused the Jew, or wrongs himself, committing a sin [the consequences of which are] limited to him, and then prays for God’s forgiveness, for it, that is to say, [and then] he repents, he shall find God is Forgiving, Merciful, to him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Yet whoso doeth evil) whoever steals (or wrongeth his own soul) by lying in his oath or falsely accusing an innocent person, (then seeketh pardon of Allah) and then repents to Allah, (will find Allah Forgiving) of his sins, (Merciful) in that He accepted his repentance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ها أنتم هؤلاء } ظاهر مما مرّ { ومن يعمل سوءاً } بظهور صفة من صفات نفسه { أو يظلم نفسه } بنقص شيء من كمالاته التي هي مقتضى استعداده بتقصير فيه وارتكاب عمل ينافيه ثم يطلب من الله ستر تلك الصفة والهيئة الساترة لكماله بالتوجه إليه والتنصل عن الذنب { يجد الله غفوراً } يستر ذلك السوء والهيئة المظلمة بنور صفته { رحيماً } يهب ما يقتضيه استعداده\n { ومن يكسب خطيئة } بظهور نفسه { أو إثماً } يمحو ما في استعداده وكسب هيئة منافية لكماله { ثم يرم به بريئاً } بأن قال: حملني على ذلك فلان\n ومنعني عن طلب الحق فلان\n وهذا جريمة فلان",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { مَن يَعْمَلْ سُوۤءاً } معصية متعدية ليسوء به غيره رمياً وافتراء { أَوْ يَظْلِمْ نَفْسَهُ } بالخروج عن حدود الله بلا تعدية إلى الغير\n ثم بعدما تفطن بوخامة عاقبته { ثُمَّ يَسْتَغْفِرِ ٱللَّهَ } بالتوبة والندامة الناشئة عن محض الخلوص والتيقظ { يَجِدِ ٱللَّهَ } الموفق له على التوبة { غَفُوراً } يغفر ذنوبه { رَّحِيماً } [النساء: 110] يقبل توبته تفضلاً وامتناناً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { ومن يعمل سوءًا } أي: ذنبًا قبيحًا يسوءُ به غيره، { أو يظلم نفسه } بذنب يختص به، أو من يعمل سوءًا بذنبٍ غيرِ الشرك، أو يظلم نفسه بالشرك، أو من يعمل سوءًا بالكبيرة، أو يظلم نفسه بالصغيرة، { ثم يستغفر الله } بالتوبة { يجد الله غفورًا } لذنوبه { رحيمًا } بقبول توبته، وفيه حث لطُعمَة وقومِه على التوبة والاستغفار. الإشارة: ومن يعمل سوءًا بالميل إلى الهوى، أو يظلم نفسه بالالتفات إلى السوى، أو من يعمل سوءًا بالهفوات والخطرات، أو يظلم نفسه بالغفلات والفترات، أو من يعمل سوءًا بالوقوف مع الكرامات وحلاوة الطاعات، أو يظلم نفسه بالقناعة من الترقي في الدرجات والمقامات، ثم يستغفر الله من حينه يجد الله غفورًا رحيمًا، حيث لم يُخرِجهُ من حضرته، ولم يتركه مع غفلته.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:153",
      "similarity": 0.48809799069118903
    },
    {
      "verse": "28:16",
      "similarity": 0.4847467263444849
    },
    {
      "verse": "41:46",
      "similarity": 0.4630078666847159
    },
    {
      "verse": "45:15",
      "similarity": 0.42678182684171084
    },
    {
      "verse": "4:64",
      "similarity": 0.42519815589958265
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/4:110.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/4:110.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/4:110.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}