{
  "chapter": "النساء",
  "text": "ولاضلنهم ولامنينهم ولءامرنهم فليبتكن ءاذان الانعم ولءامرنهم فليغيرن خلق الله ومن يتخذ الشيطن وليا من دون الله فقد خسر خسرانا مبينا",
  "translations": [
    {
      "translation": "I will lead them astray and fill them with false hopes. I will command them and they will cut off cattle's ears. I will command them and they will change Allah's creation.' Anyone who takes Shaytan as his protector in place of Allah has clearly lost everything.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And mislead them and tempt them, and order them to slit the ears of animals; and order them to alter God's creation.\" He who holds Satan as friend in place of God will assuredly be damned to perdition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and shall lead them astray, and shall engross them in vain desires, and I shall command them and they will cut off the ears of the cattle, and I shall command them and they will disfigure Allah's creation.' He who took Satan rather than Allah for his guardian has indeed suffered a man-ifest loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will lead them astray, induce in their hearts prolonged, worldly desires, command them to pierce the ears of their animals, sacrificed for the idols, and order them to change the religion of God.\" One who accepts Satan as his guardian, instead of God, has certainly incurred a great loss upon himself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And I will surely lead them astray, and I will certainly arouse desires in them, and I will definitely order them so they will pierce animals’ ears, and I will definitely order them so they will alter Allah’s creation”; and whoever chooses the devil for a friend instead of Allah, has indeed suffered a manifest loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, I will mislead them, and surely, I will arouse in them false desires; and certainly, I will order them to slit the ears of cattle, and indeed I will order them to change the nature created by Allah.\" And whoever takes Shaytan as a Wali instead of Allah, has surely suffered a manifest loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most certainly I will lead them astray and excite in them vain desires, and bid them so that they shall slit the ears of the cattle, and most certainly I will bid them so that they shall alter Allah's creation; and whoever takes the Shaitan for a guardian rather than Allah he indeed shall suffer a manifest loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and I will lead them astray, and fill them with fancies and I will command them and they will cut off the cattle's ears; I will command them and they will alter God's creation.' Whoso takes Satan to him for a friend, instead of God, has surely suffered a manifest loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely I will lead them astray, and surely I will arouse desires in them, and surely I will command them and they will cut the cattle' ears, and surely I will command them and they will change Allah's creation. Whoso chooseth Satan for a patron instead of Allah is verily a loser and his loss is manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and shall lead them astray, and fill them with vain desires and order them to slit the ears of cattle. I shall order them to tamper with God's creation. Whoever chooses Satan as a patron instead of God is utterly ruined:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely I will lead them and will fill them with vain desires, and I will command them so that they will slit the ears of the cattle, and I will command them so that they will alter the creation of Allah. And whosoever taketh Satan for a patron, instead of Allah, shall surely suffer a manifest loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and I will lead them astray and give them [false] hopes, and prompt them to slit the ears of cattle, and I will prompt them to alter Allah’s creation.’ Whoever takes Satan as a guardian instead of Allah has certainly incurred a manifest loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will mislead them, and I will create in them false desires; I will order them to slit the ears of cattle, and to deface the (fair) nature created by Allah.\" Whoever, forsaking Allah, takes satan for a friend, hath of a surety suffered a loss that is manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, I will mislead them, and surely, I will arouse in them false desires; and certainly, I will order them to slit the ears of cattle, and indeed I will order them to change the nature created by Allah.\" And whoever takes Shaitan (Satan) as a Wali (protector or helper) instead of Allah, has surely suffered a manifest loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and lead them astray. I shall fill them with fancies and order them to cut off the ears of cattle. I shall order them to alter the creation of Allah' Indeed, whosoever chooses satan for a guide, instead of Allah, has surely suffered a clear loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And I will mislead them, and I will entice them, and I will prompt them to slit the ears of cattle, and I will prompt them to alter the creation of God.” Whoever takes Satan as a lord, instead of God, has surely suffered a profound loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I will mislead them, and I will arouse in them [sinful] desires, and I will command them so they will slit the ears of cattle, and I will command them so they will change the creation of Allah.\" And whoever takes Satan as an ally instead of Allah has certainly sustained a clear loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:119] And I will surely lead them astray, from truth with evil whisperings, and surely I will fill them with desires, I shall cast into their hearts [thoughts] that life will endure, that there will be no resurrection and no reckoning; and surely I will command them and they will cut up the cattle’s ears, and this was done to the [she-camels they called] bahā’ir. And surely I will command them and they will change God’s creation’, [substituting] His religion with unbelief, making lawful what God has made unlawful and making unlawful what God has made lawful. And whoever takes Satan for a patron, following him and obeying him, instead of God, has surely suffered a manifest loss, [one that is] evident, since he will end up in the Fire, made perpetual for him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And surely I will lead them astray) far from guidance, (and surely I will arouse desires in them) such that to them there is hell or Paradise, (and surely I will command them and they will cut the cattle's ears) what is known as the Bahirah, (and surely I will command them and they will change Allah's creation) Allah's Religion. (Whoso chooseth Satan) whoever worships Satan (for a patron) as a Lord (instead of Allah is verily a loser) he has been cheated (and his loss is manifest) by losing this world and the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلَيُبَتِّكُنَّ آذَانَ ٱلأَنْعَٰمِ } معناهُ يُقَطِّعنَّ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allaah: {So let the ears of livestock hear} means that they should be cut off.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلأُضِلَّنَّهُمْ } بأنواع الخدات والوسوسة عن طريق توحيدك { وَلأُمَنِّيَنَّهُمْ } بما يتعلق بمعاشهم في دار الغرور من الحرص وطول الأمل، وسائر مشتهيات النفس ومستلذاتها { وَلأَمُرَنَّهُمْ } بتغيير أوضاعك وتنقيص مصنوعاتك وتخريب مخترعاتك { فَلَيُبَتِّكُنَّ } ليشقن { ءَاذَانَ ٱلأَنْعَٰمِ } وأنوف الخيل، وغير ذلك من الأعمال التي عملوا مع خلقك بلا رخصة شرعية { وَلأَمُرَنَّهُمْ فَلَيُغَيِّرُنَّ خَلْقَ ٱللَّهِ } بموالاتي أياهم، ومواساتي معهم إلى أن يغيروا ما خلق على مقتضى الحكمة من الأمور التي خرج بها عن الفطرة الإلهية وانحرفوا بها عن طريق الأقوم الأعدل { وَ } بالجملة: { مَن يَتَّخِذِ ٱلشَّيْطَٰنَ وَلِيّاً مِّن دُونِ } ولاية { ٱللَّهِ } المولي لجميع أموره { فَقَدْ خَسِرَ } لنفسه { خُسْرَاناً مُّبِيناً } [النساء: 119] ظاهرة الخسارة والحرمانن؛ إذ بدل ولاية الله الهادي بولاية الشيطان المضل، ولا خسران أعظم منه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:123",
      "similarity": 0.10381693673697469
    },
    {
      "verse": "4:120",
      "similarity": 0.10346016835597327
    },
    {
      "verse": "62:6",
      "similarity": 0.0992417982129983
    },
    {
      "verse": "2:94",
      "similarity": 0.09535380540623316
    },
    {
      "verse": "3:143",
      "similarity": 0.09176486411105958
    }
  ]
}