{
  "chapter": "النساء",
  "text": "وان امراة خافت منۢ بعلها نشوزا او اعراضا فلا جناح عليهما ان يصلحا بينهما صلحا والصلح خير واحضرت الانفس الشح وان تحسنوا۟ وتتقوا۟ فان الله كان بما تعملون خبيرا",
  "translations": [
    {
      "translation": "If a woman fears cruelty or aversion on her husband's part, there is nothing wrong in the couple becoming reconciled. Reconciliation is better. But people are prone to selfish greed. If you do good and have taqwa, Allah is aware of what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman fears aversion from her husband, or ill treatment, there is no harm if they make a peaceful settlement; and peace is an excellent thing. But men keep self-interest uppermost. Yet if you do good and fear God, God is cognisant of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman fears either ill-treatment or aversion from her husband it is not wrong for the husband and wife to bring about reconciliation among themselves (by compromising on their rights), for settlement is better. Man's soul is always prone to selfishness, but if you do good and are God-fearing, then surely Allah is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman is afraid of her husband's ill treatment and desertion, it will be no sin for both of them to reach a reconciliation. Reconciliation is good even though men's souls are swayed by greed. If you act righteously and be pious, God is Well Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a woman fears ill treatment from her husband or disinterest, so it is no sin for them if they reach an agreement of peace between themselves; and peace is better; and the heart is trapped in greed; and if you do good and practice piety, then Allah is Well Aware of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a woman fears cruelty or desertion on her husband's part, there is no sin on them both if they make terms of peace between themselves; and making peace is better. And human souls are swayed by greed. But if you do good and have Taqwa, verily, Allah is Ever Well-Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a woman fears ill usage or desertion on the part of her husband, there is no blame on them, if they effect a reconciliation between them, and reconciliation is better, and avarice has been made to be present in the (people's) minds; and if you do good (to others) and guard (against evil), then surely Allah is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman fear rebelliousness or aversion in her husband, there is no fault in them if the couple set things right between them; right settlement is better; and souls are very prone to avarice. If you do good and are godfearing, surely God is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman feareth ill treatment from her husband, or desertion, it is no sin for them twain if they make terms of peace between themselves. Peace is better. But greed hath been made present in the minds (of men). If ye do good and keep from evil, lo! Allah is ever Informed of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman fears ill-treatment or indifference on the part of her husband, it shall be no offence for her to seek a reconciliation, for reconciliation is best. But people are prone to selfish greed. If you do good and fear Him, surely God is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a woman feareth from her husband refractoriness or estrangement, it shall be no blame on the twain if they effect between them a reconciliation; and reconciliation is better. And souls are engrained with greed. And if ye act kindly and fear Him, then verily Allah is ever of that which ye work Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman fears from her husband misconduct or desertion, there is no sin upon the couple if they reach a reconciliation between themselves; and reconcilement is better. The souls are prone to greed; but if you are virtuous and Godwary, Allah is indeed well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a wife fears cruelty or desertion on her husband's part, there is no blame on them if they arrange an amicable settlement between themselves; and such settlement is best; even though men's souls are swayed by greed. But if ye do good and practise self-restraint, Allah is well-acquainted with all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a woman fears cruelty or desertion on her husband's part, there is no sin on them both if they make terms of peace between themselves; and making peace is better. And human inner-selves are swayed by greed. But if you do good and keep away from evil, verily, Allah is Ever Well-Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman fears hatred or aversion from her husband there is no fault in them if the couple set things right between them, for reconciliation is better. Avarice attends the souls, but if you do what is good and are cautious, surely, Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman fears maltreatment or desertion from her husband, there is no fault in them if they reconcile their differences, for reconciliation is best. Souls are prone to avarice; yet if you do what is good, and practice piety—God is Cognizant of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a woman fears from her husband contempt or evasion, there is no sin upon them if they make terms of settlement between them - and settlement is best. And present in [human] souls is stinginess. But if you do good and fear Allah - then indeed Allah is ever, with what you do, Acquainted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:128] And if a woman (wa-in imra’atun is in the nominative because of [it being the subject of] the explicative verb   [that follows]) fears, anticipates, from her husband ill-treatment, if he looks down on her by refraining to sleep with her or by not maintaining her adequately, because he is averse to her and aspires to one more beautiful than her, or rejection, turning his face away from her, they are not at fault if they are reconciled through some agreement, in terms of shares and maintenance expenses, so that she concedes something to him in return for continuing companionship; if she agrees to this [then that is fine], but if [she does] not, then the husband must either give her all her due, or part with her (an yassālahā, ‘they reconcile’: the original tā’ [of yatasālahā] has been assimilated with the sād; a variant reading has an yuslihā, from [the fourth form] aslaha); reconciliation is better, than separation, ill-treatment or rejection. God, exalted be He, in explaining the natural disposition of man, says: But greed has been made present in the souls (al-shuhh is extreme niggardliness), meaning that they have a natural propensity for this, as if they [the souls] are ever in its presence, never absent from it. The meaning is: a woman would scarcely allow [another] to share her husband with her, and a man would scarcely allow her [to enjoy] him if he were to fall in love with another. If you are virtuous, in your conjugal life with women, and fear, being unjust to them, surely God is ever aware of what you do, and He will requite you for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If a woman) i.e. 'Umayrah (feareth) is aware of (ill treatment) i.e. refrains from having sex with her (from her husband) As'ad Ibn al-Rabi', (or desertion) not speaking or sitting with her, (it is no sin for them twain) the man and the woman (if they make terms of peace between themselves) between the husband and wife whereby both of them are made content. (Peace) such that the wife is pleased (is better) than transgression and aversion. (But greed hath been made present in the minds) souls are naturally inclined to be parsimonious, such that the wife withholds the share of her husband; it is also said that this means: her greed drives her to be pleased. (If ye do good) if you are equal in your treatment of the young wife and the elderly wife in the estates and maintenance (and keep from evil) avoid transgression and aversion, (Lo! Allah is ever Informed of what ye do) of transgression and aversion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِنِ ٱمْرَأَةٌ خَافَتْ مِن بَعْلِهَا نُشُوزاً أَوْ إِعْرَاضاً } معناه ذهابٌ عنها، أَو تغير ما\n\n",
      "translations": [
        {
          "translation": " And the saying of Allah: {And if a woman fears from her husband rebellion or aversion} means going away from her or changing what",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِنِ } اضطرت { ٱمْرَأَةٌ } إلى الفرقة والسراح بأن { خَافَتْ مِن بَعْلِهَا } سوء عشرته معها\n وعدم رعاية حقوقها { نُشُوزاً } عنها وميلاً إلى غيرها { أَوْ إِعْرَاضاً } طلاقاً وسراحاً { فَلاَ جُنَاْحَ } أي: لا ضيق\n ولا تعب { عَلَيْهِمَآ } أي: على الزوجين { أَن يُصْلِحَا بَيْنَهُمَا } بأن أسقط كل منهما عما استحق له شيئاً\n أو زاد إلى أن يتصالحا { صُلْحاً } ناشئاً عن التراضي من الجانبين { وَٱلصُّلْحُ } بينهما { خَيْرٌ } من الفرقة والطلاق { وَ } لكن فلما يقع إذا { أُحْضِرَتِ ٱلأنْفُسُ } الأمارة بالسوء من الجانبين { ٱلشُّحَّ } أي: قد صارت الأنفس حينئذ مطبوعة مرغوبة على إحضار الشح والبخل فيما وجب عليها\n فلا يسمح كل منهما من حقه شيئاً\n لذلك لم يرتفع النزاع والخصومة { وَإِن تُحْسِنُواْ } أيها المؤمنون في المعاشرة مع الأزواج { وَتَتَّقُواْ } من غضب الله في الخروج عن مقتضى حدوده { فَإِنَّ ٱللَّهَ } المجازي لعباده { كَانَ بِمَا تَعْمَلُونَ } من الميل إلى المحارم والإعراض عن حدود الله والمخالفة لأمره { خَبِيراً } [النساء: 128] يجازيكم على مقتضى خبرته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { امرأة }: فاعل بفعل يفسره ما بعده، وأصل  يَصَّالِحَا: يتصالحا، فأدغمت، و { صُلحًا } مصدر\n وقرأ الكوفيون: { يُصلحا } من الرباعي، فتنصب { صُلحًا } على المفعول به، أو المصدر، و { بينهما } ظرف، أو حال منه، وجملة { الصلح خير }: معترضة، وكذا: { وأحضرت الأنفس الشح } ، ولذلك اغتفر عدم تجانسهما\n يقول الحقّ جلّ جلاله: { وإن امرأة خافت } وتوقعت من زوجها { نُشُوزًا } أي: ترفعًا عن صحبتها، وتجافيًا عنها، كراهية لها، ومنعًا لحقوقها، { أو إعراضًا } عنها، بأن يترك مجالستها، ومحادثتها، { فلا جناح عليهما } أن يتصالحا { بينهما صلحًا } بإن تحط له مهرها، أو من قسمها مع ضرتها، أو تهب له شيئًا تستميله به\n نزلت في سعد بن الربيع، تزوج على امرأته شابةً، وآثرها عليها\n وقيل: في رجل كبرت امرأته، وله معها أولاد\n فأراد طلاقها ليتزوج، فقالت له: دعني على أولادي، وأقسم لي في كل شهرين أو أكثر، أو لا تقسم\n فذكر ذلك النبي صلى الله عليه وسلم فقال له:\n\n \" قد سمع الله ما تقول، فإن شاء أجابك \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "64:16",
      "similarity": 0.44278674297044646
    },
    {
      "verse": "37:125",
      "similarity": 0.3666976788867496
    },
    {
      "verse": "4:34",
      "similarity": 0.29442776142494065
    },
    {
      "verse": "2:228",
      "similarity": 0.28765418975833984
    },
    {
      "verse": "11:72",
      "similarity": 0.2739938122113727
    }
  ]
}