{
  "chapter": "النساء",
  "text": "ويستفتونك فى النساء قل الله يفتيكم فيهن وما يتلى عليكم فى الكتب فى يتمى النساء التى لا تؤتونهن ما كتب لهن وترغبون ان تنكحوهن والمستضعفين من الولدن وان تقوموا۟ لليتمى بالقسط وما تفعلوا۟ من خير فان الله كان به عليما",
  "translations": [
    {
      "translation": "They will ask you for a fatwa about women. Say, 'Allah gives you a fatwa about them; and also what is recited to you in the Book about orphan girls to whom you do not give the inheritance they are owed, while at the same time desiring to marry them; and also about young children who are denied their rights: that you should act justly with respect to orphans.' Whatever good you do, Allah knows it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you for judgement about women. Tell them: \"God has given you instructions about them. You also read them in the Book concerning orphaned women (in your charge) to whom you deny their ordained rights and yet wish to take them in marriage, as well as in respect of helpless children, that you should be just in the matter of orphans.\" The good you do is known to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you to pronounce laws concerning women, say: 'Allah pronounces to you concerning them, and reminds you of the injunctions which were recited to you in the Book about female orphans whom you do not give what has been ordained for them and whom you wish to marry (out of greed)', and the commandments relating to the children who are weak and helpless. Allah directs you to treat the orphans with justice. Allah is well aware of whatever good you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), they ask you concerning women. Tell them, \"God will instruct you about them, besides that which can be read in the Book, about widows with children, whom you wanted to marry without giving them their due rights and He will instruct you about the rights of the weak and oppressed children. God commands you to maintain justice with the orphans. God knows all about whatever good you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you the decree concerning women; say, “Allah gives you a decree concerning them – and what is recited to you from the Qur’an concerning orphan girls, that you are not giving them which is ordained for them, and you are avoiding marrying them – and concerning the weak children, and that you must firmly establish justice in dealing with the orphans’ rights; and whatever good deeds you do, then Allah is Well Aware of it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask your legal instruction concerning women. Say: \"Allah instructs you about them, and about what is recited unto you in the Book concerning the orphan girls whom you give not what they deserve and yet whom you desire to marry, and the children who are weak and oppressed, and that you stand firm for justice to orphans. And whatever good you do, Allah is Ever All-Aware of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask you a decision about women. Say: Allah makes known to you His decision concerning them, and that which is recited to you in the Book concerning female orphans whom you do not give what is appointed for them while you desire to marry them, and concerning the weak among children, and that you should deal towards orphans with equity; and whatever good you do, Allah surely knows it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will ask thee for a pronouncement concerning women. Say: 'God pronounces to you concerning them, and what is recited to you in the Book concerning the orphan women to whom you give not what is prescribed for them, and yet desire to marry them, and the oppressed children, and that you secure justice for orphans. Whatever good you do, God knows of it.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They consult thee concerning women. Say: Allah giveth you decree concerning them, and the Scripture which hath been recited unto you (giveth decree), concerning female orphans and those unto whom ye give not that which is ordained for them though ye desire to marry them, and (concerning) the weak among children, and that ye should deal justly with orphans. Whatever good ye do, lo! Allah is ever Aware of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They consult you concerning women. Say, \"God has given you directions concerning them. The commandment given to you in the Book concerns the orphan girls to whom you do not give what is prescribed for them, and whom you nevertheless desire to marry, and about helpless children. He has instructed you to deal justly with orphans. God has knowledge of all the good you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they ask thy decree concerning women. Say thou: Allah decreeth unto you concerning them and so do the revelations that have been rehearsed unto you in the Book concerning the orphan women unto whom yes give not that which is prescribed for them and yet desire that ye shall wed them, and concerning the oppressed children, and concerning this, that ye shall deal with the orphans in equity, and whatsoever of good ye de, then verily thereof Allah is ever Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They seek your ruling concerning women. Say, ‘Allah gives you a ruling concerning them and what is announced to you in the Book concerning girl orphans—whom you do not give what has been prescribed for them, and yet you desire to marry them—and about the weak among children: that you should maintain the orphans with justice, and whatever good you do, indeed Allah knows it well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thy instruction concerning the women say: Allah doth instruct you about them: And (remember) what hath been rehearsed unto you in the Book, concerning the orphans of women to whom ye give not the portions prescribed, and yet whom ye desire to marry, as also concerning the children who are weak and oppressed: that ye stand firm for justice to orphans. There is not a good deed which ye do, but Allah is well-acquainted therewith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask your legal instruction concerning women, say: Allah instructs you about them, and about what is recited unto you in the Book concerning the orphan girls whom you give not the prescribed portions (as regards Mahr and inheritance) and yet whom you desire to marry, and (concerning) the children who are weak and oppressed, and that you stand firm for justice to orphans. And whatever good you do, Allah is Ever All-Aware of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will ask you for a verdict concerning women. Say: \"Allah decides for you concerning them, and what has been recited in the Book concerning orphaned women to whom you do not give what is written, and yet desire to marry them, and the abased children, and that you secure justice for orphans. Whatever good you do, Allah has knowledge it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you for a ruling about women. Say, “God gives you a ruling about them, and so does what is stated to you in the Book about widowed women from whom you withhold what is decreed for them, yet you desire to marry them, and about helpless children: that you should treat the orphans fairly.” Whatever good you do, God knows it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they request from you, [O Muhammad], a [legal] ruling concerning women. Say, \"Allah gives you a ruling about them and [about] what has been recited to you in the Book concerning the orphan girls to whom you do not give what is decreed for them - and [yet] you desire to marry them - and concerning the oppressed among children and that you maintain for orphans [their rights] in justice.\" And whatever you do of good - indeed, Allah is ever Knowing of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:127] They will ask you for a pronouncement concerning, the matter of, women, and their inheritance. Say, to them: ‘God pronounces to you concerning them, and what is recited to you in the Book, the Qur’ān, in the ‘inheritance’ verse [Q. 4:11], and He also pronounces to you, concerning the orphan women to whom you do not give what is prescribed, [what] is obligatory, for them, of inheritance, for you, O guardians, [who] desire, not, to marry them, because of their ugliness, and you prevent them from marrying [others], coveting their inheritance: in other words, God pronounces to you not to do this; and, concerning, the oppressed, young, children, that you give them what is their due, and, He also commands you, that you deal justly, equitably, with orphans, with respect to inheritance and dowry. Whatever good you do, God is ever Knower of it’, and He will requite you for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They consult thee concerning women) they ask you about the inheritance of women; the one who asked him was 'Uyaynah. (Say: Allah giveth to you decree) expounds to you the legal ruling (concerning them) concerning their inheritance, (and the Scripture) at the beginning of this surah (which hath been recited unto you (giveth decree), concerning female orphans) the daughters of Umm Kuhhah (unto whom ye give not that which is ordained for them) that which is prescribed for them of inheritance; Allah has already explained this at the beginning of the surah (though you desire to marry them) you refrain from marrying them because they are not attractive, so now give them their wealth so that you may desire to marry them for that which they have, (and (concerning) the weak among children) and He expounds to you the inheritance of children, (and that ye should deal justly with orphans) He explains to you that you should protect justly and fairly the wealth of orphans. (Whatever good ye do) by being kind to them, (lo! Allah is ever Aware of it) as well as of your intentions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { وَيَسْتَفْتُونَكَ فِي } ميراث { ٱلنِّسَآءِ } هل يرثن أم لا؟ { قُلِ } في جوابهم يا أكمل الرسل: { ٱللَّهُ يُفْتِيكُمْ } ويبين لكم { فِيهِنَّ } ميراثهن { وَ } هن { مَا يُتْلَىٰ عَلَيْكُمْ فِي ٱلْكِتَٰبِ } أي: القرآن { فِي } حق { يَتَٰمَى ٱلنِّسَآءِ ٱلَّٰتِي لاَ تُؤْتُونَهُنَّ مَا كُتِبَ لَهُنَّ } وتحرمونهن عن حقوقهن ظلماً { وَ } مع ذلك { تَرْغَبُونَ أَن تَنكِحُوهُنَّ } أو تعضلوهن كرهاً { وَ } أيضاً في حق { ٱلْمُسْتَضْعَفِينَ مِنَ ٱلْوِلْدَٰنِ } إذ هم كانوا لا يورثونهم كما لا يورثون النسوان { وَ } عليكم { أَن تَقُومُواْ لِلْيَتَٰمَىٰ بِٱلْقِسْطِ } وةالعدلا بلا جيف لهم في مالهم وعرضهم { وَمَا تَفْعَلُواْ مِنْ خَيْرٍ فَإِنَّ ٱللَّهَ } الرقيب عليكم { كَانَ بِهِ عَلِيماً } [النساء: 127] فيجازيكم على مقتضى علمه إن خيراً فخير وإن شراً فشر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: و { ما يتلى }: عطف على { الله } ، أي: يفتيكم الله، والمتلو عليكم في الكتاب، أي في القرآن. { وترغبون أن تنكحوهن } حذف الجار، وهو في أو عن، ليصدق النهي بالراغب فيها إذا كانت جميلة، والراغب عنها إذا كانت دميمة، و { المستضعفين } عطف على { يتامى النساء } أي: والذي يتلى في المستضعفين من الولدان، وهو قوله تعالى: { يوصيكم الله... } الخ، أو على الضمير في { فيهن } أي: يفتيكم فيهن وفي المستضعفين، و { أن تقوموا } عطف على { المستضعفين } ، أو منصوب بمحذوف، أي: ويأمركم أن تقوموا...الخ. يقول الحقّ جلّ جلاله: { ويستفتونك } يا محمد { في } شأن { النساء } من الميراث وغيره، { قل الله يفتيكم فيهن } ، فيأمركم أن تعطوهن حقهن من الميراث، { و } يفتيكم أيضًا فيهن { ما يتلى عليكم في الكتاب } في أول السورة إذ قال: { للرجال نصيب مما اكتسبوا وللنساء نصيب مما اكتسبن } ثم بيَّنه في تقسيم الميراث في { يوصيكم الله في أولادكم } ، وقال في اليتامى: { وآتوا اليتامى أموالهم }  { وإن خفتم ألا تقسطوا في اليتامى... } الآية، فقد أفتاكم في اليتامى { اللاتي لا تؤتونهن ما كتب لهن } من الصداق { وترغبون أن تنكحوهن } بدون صداق مثلهن، فأمركم أن تنكحوا غيرهن، ولا تنكحوهن إلا أن تقسطوا لهن في الصداق، إذا كانت جميلة، أو لها مال، أو ترغبون عن نكاحهن إذا كانت دميمة، فتعضلوهن لترثوهن، فلا تفعلوا ذلك، بل تزوجوها أو زوجوها، وكانوا في الجاهلية، إذا كانت اليتيمة ذات مال وجمال، رغبوا فيها وتزوجوها، بدون صداقها، وإن كانت دميمة ولا مال لها رغبوا عنها وعضلوها، أو زوجوها غيرهم، فنهى الله تعالى الفريقين معًا. { و } يفتيكم أيضًا في { المستضعفين من الوِلدَانِ } وهم الصغار، أن تعطوهم حقهم من الميراث مع الكبار، وكانوا لا يورثونهم، رُوِي أن عُيينة بن حصين أتى النبي صلى الله عليه وسلم فقال: أُخبرنا أنك تورث النساء والصبيان، وإنما كنا نورث من يشهد القتال ويحوز الغنيمة؟ فقال له صلى الله عليه سلم\n \" كذا أُمِرتُ \" \nفنزلت الآية. { و } يفتيكم أيضًا ويأمركم { أن تقوموا لليتامى بالقسط } أي: العدل. وهو خطاب للأئمة أن ينظروا لهم بالمصلحة ويستوثقوا حقوقهم، ويحتاطوا لهم في أمورهم كلها، ثم وعدهم بالثواب على ذلك فقال: { وما تفعلوا من خير فإن الله كان به عليمًا } ، فيجازيكم الى قدر إحسانكم. والله تعالى أعلم. الإشارة: يستفتونك عن نساء العلوم الرسمية، وعن يتامى العلوم القلبية، وهن نتائج الأفكار، وهي العلوم اللدنية، والأسرار الربانية التي هي من علوم الحقيقة، ولا تليق إلا بالمستضعفين عند الخليفة، وفي الخبز: \" ألا أُخبِركُم بأهل الجَنَّة؟ هو كل ضَعيفٍ مَتَضعّفَ، لو أقسمَ على اللهِ لأبرَّهُ في قَسمه \". أو كما قال صلى الله عليه وسلم. قل الله يفتيكم فيهن فيأمركم أن تأخذوا من العلوم الرسمية ما تتقنون به عبادة ربكم، وترغبوا في علم الطريقة، التي هي علم القلوب، ما تحققون به عبوديتكم، ومن نتائج الأفكار ما تُشاهدون به عظمة ربكم، ويأمركم أن تقوموا بالعدل في جميع شؤونكم، فتعطوا الشريعة حقها والطريقة حقها، وتحفظوا أسرار الحقيقة عن غير مستحقها، والله لا يضيع أجر المحسنين.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "94:8",
      "similarity": 0.4542404465216937
    },
    {
      "verse": "9:59",
      "similarity": 0.4300105520370067
    },
    {
      "verse": "68:32",
      "similarity": 0.42741262245220285
    },
    {
      "verse": "21:90",
      "similarity": 0.31549749125965887
    },
    {
      "verse": "2:130",
      "similarity": 0.3103162683289265
    }
  ]
}