{
  "chapter": "النساء",
  "text": "ولله ما فى السموت وما فى الارض وكان الله بكل شىء محيطا",
  "translations": [
    {
      "translation": "What is in the heavens and in the earth belongs to Allah. Allah encompasses all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all that is in the heavens and the earth belongs to God; and everything is well within the compass of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and in the earth belongs to Allah; Allah en-compasses everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs all that is in the heavens and the earth and He has control over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah only belongs all whatever is in the heavens and all whatever is in the earth; and Allah has control over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs all that is in the heavens and all that is in the earth. And Allah is Ever Encompassing all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever is in the heavens and whatever is in the earth is Allah's; and Allah encompasses all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs all that is in the heavens and in the earth, and God encompasses everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth. Allah ever surroundeth all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs all that the heavens and earth contain. God has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's is whatsoever is in the heavens and whatsoever is in the earth; and of everything Allah is ever an Encompasser.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs whatever is in the heavens and whatever is on the earth, and Allah comprehends all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But to Allah belong all things in the heavens and on earth: And He it is that Encompasseth all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs all that is in the heavens and all that is in the earth. And Allah is Ever Encompassing all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs all that is in the heavens and the earth. Allah encompasses everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs what is in the heavens and what is on earth, and God encompasses everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs whatever is in the heavens and whatever is on the earth. And ever is Allah, of all things, encompassing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:126] To God belongs all that is in the heavens and in the earth, as possessions, creatures and servants; and God is ever the Encompasser of all things, in knowledge and power, that is, He is ever possessed of such attributes.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth) of created beings and marvels: they are all his bondsmen and bondswomen. (Allah ever surroundeth) has the knowledge of (all things) in relation to the dwellers of the heavens and the earth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولا يظن أنه تخلل فيه على وجه الحلول والاتحاد، بل على التوحيدج الصرف الخالي عن الكثرة مطلقاً؛ إذ { وَللَّهِ } الواحد الأحد الصمد، الذي\n\n[الإخلاص: 3-4] جميع { مَا } ظهر { فِي ٱلسَّمَٰوَٰتِ } أي: العلويات { وَمَا } ظهر { فِي ٱلأَرْضِ } أي: السفليات؛ إذ كل ما ظهر وما بطن فمنه بدأ وإلأيه يعود { وَكَانَ ٱللَّهُ } االمتجلي في الآفاق والأنفس { بِكُلِّ شَيْءٍ } من مظاهره { مُّحِيطاً } [النساء: 126] لا كإحاطة الظرفية بمظروفه، بل كإحاطة الشمس بالأضواء والأضلال، وإحاطة الروح بالجسم\n\n\n\n\nأذقنا بلطفك حلاوة توحيدك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}