{
  "chapter": "النساء",
  "text": "وان امراة خافت منۢ بعلها نشوزا او اعراضا فلا جناح عليهما ان يصلحا بينهما صلحا والصلح خير واحضرت الانفس الشح وان تحسنوا۟ وتتقوا۟ فان الله كان بما تعملون خبيرا",
  "translations": [
    {
      "translation": "If a woman fears cruelty or aversion on her husband's part, there is nothing wrong in the couple becoming reconciled. Reconciliation is better. But people are prone to selfish greed. If you do good and have taqwa, Allah is aware of what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman fears aversion from her husband, or ill treatment, there is no harm if they make a peaceful settlement; and peace is an excellent thing. But men keep self-interest uppermost. Yet if you do good and fear God, God is cognisant of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman fears either ill-treatment or aversion from her husband it is not wrong for the husband and wife to bring about reconciliation among themselves (by compromising on their rights), for settlement is better. Man's soul is always prone to selfishness, but if you do good and are God-fearing, then surely Allah is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman is afraid of her husband's ill treatment and desertion, it will be no sin for both of them to reach a reconciliation. Reconciliation is good even though men's souls are swayed by greed. If you act righteously and be pious, God is Well Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a woman fears ill treatment from her husband or disinterest, so it is no sin for them if they reach an agreement of peace between themselves; and peace is better; and the heart is trapped in greed; and if you do good and practice piety, then Allah is Well Aware of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a woman fears cruelty or desertion on her husband's part, there is no sin on them both if they make terms of peace between themselves; and making peace is better. And human souls are swayed by greed. But if you do good and have Taqwa, verily, Allah is Ever Well-Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a woman fears ill usage or desertion on the part of her husband, there is no blame on them, if they effect a reconciliation between them, and reconciliation is better, and avarice has been made to be present in the (people's) minds; and if you do good (to others) and guard (against evil), then surely Allah is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman fear rebelliousness or aversion in her husband, there is no fault in them if the couple set things right between them; right settlement is better; and souls are very prone to avarice. If you do good and are godfearing, surely God is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman feareth ill treatment from her husband, or desertion, it is no sin for them twain if they make terms of peace between themselves. Peace is better. But greed hath been made present in the minds (of men). If ye do good and keep from evil, lo! Allah is ever Informed of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman fears ill-treatment or indifference on the part of her husband, it shall be no offence for her to seek a reconciliation, for reconciliation is best. But people are prone to selfish greed. If you do good and fear Him, surely God is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a woman feareth from her husband refractoriness or estrangement, it shall be no blame on the twain if they effect between them a reconciliation; and reconciliation is better. And souls are engrained with greed. And if ye act kindly and fear Him, then verily Allah is ever of that which ye work Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman fears from her husband misconduct or desertion, there is no sin upon the couple if they reach a reconciliation between themselves; and reconcilement is better. The souls are prone to greed; but if you are virtuous and Godwary, Allah is indeed well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a wife fears cruelty or desertion on her husband's part, there is no blame on them if they arrange an amicable settlement between themselves; and such settlement is best; even though men's souls are swayed by greed. But if ye do good and practise self-restraint, Allah is well-acquainted with all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a woman fears cruelty or desertion on her husband's part, there is no sin on them both if they make terms of peace between themselves; and making peace is better. And human inner-selves are swayed by greed. But if you do good and keep away from evil, verily, Allah is Ever Well-Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman fears hatred or aversion from her husband there is no fault in them if the couple set things right between them, for reconciliation is better. Avarice attends the souls, but if you do what is good and are cautious, surely, Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a woman fears maltreatment or desertion from her husband, there is no fault in them if they reconcile their differences, for reconciliation is best. Souls are prone to avarice; yet if you do what is good, and practice piety—God is Cognizant of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a woman fears from her husband contempt or evasion, there is no sin upon them if they make terms of settlement between them - and settlement is best. And present in [human] souls is stinginess. But if you do good and fear Allah - then indeed Allah is ever, with what you do, Acquainted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:128] And if a woman (wa-in imra’atun is in the nominative because of [it being the subject of] the explicative verb   [that follows]) fears, anticipates, from her husband ill-treatment, if he looks down on her by refraining to sleep with her or by not maintaining her adequately, because he is averse to her and aspires to one more beautiful than her, or rejection, turning his face away from her, they are not at fault if they are reconciled through some agreement, in terms of shares and maintenance expenses, so that she concedes something to him in return for continuing companionship; if she agrees to this [then that is fine], but if [she does] not, then the husband must either give her all her due, or part with her (an yassālahā, ‘they reconcile’: the original tā’ [of yatasālahā] has been assimilated with the sād; a variant reading has an yuslihā, from [the fourth form] aslaha); reconciliation is better, than separation, ill-treatment or rejection. God, exalted be He, in explaining the natural disposition of man, says: But greed has been made present in the souls (al-shuhh is extreme niggardliness), meaning that they have a natural propensity for this, as if they [the souls] are ever in its presence, never absent from it. The meaning is: a woman would scarcely allow [another] to share her husband with her, and a man would scarcely allow her [to enjoy] him if he were to fall in love with another. If you are virtuous, in your conjugal life with women, and fear, being unjust to them, surely God is ever aware of what you do, and He will requite you for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف لبقية إفتاء الله تعالى . وهذا حكم اختلال المعاشرة بين الزوجين ، وقد تقدّم بعضه في قوله : { واللاتي تخافون نشوزهنّ } \\[ النساء : 34 \\] الآية ، في هذه السورة ، فذلك حكم فصْل القضاء بينهما ، وما هنا حكم الانفصال بالصلح بينهما ، وذلك ذكر فيه نشوز المرأة ، وهنا ذكر نشوز البعْل . والبعل زوج المرأة . وقد تقدّم وجه إطلاق هذا الاسم عليه في قوله { وبعولتهنّ أحقّ بردهنّ في ذلك } في سورة البقرة ( 228 ) .وصيغة { فلا جناح } من صيغ الإباحة ظاهراً ، فدلّ ذلك على الإذن للزوجين في صلح يقع بينهما . وقد علم أنّ الإباحة لا تذكر إلاّ حيث يظنّ المنع ، فالمقصود الإذن في صلح يكون بخلع : أي عوَض مالي تعطيه المرأة ، أو تنازل عن بعض حقوقها ، فيكون مفاد هذه الآية أعمّ من مفاد قوله تعالى : { ولا يحلّ لكم أن تأخذوا ممّا آتيتموهن شيئاً إلاّ أن يخافا أن لا يقيما حدود الله فإن خفتم أن لا يقيما حدود الله فلا جناح عليهما فيما افتدت به } \\[ البقرة : 229 \\] ، فسمّاه هناك افتداء ، وسمّاه هنا صلحاً . وقد شاع في الاستعمال إطلاق الصلح على التراضي بين الخصمين على إسقاط بعض الحقّ ، وهو الأظهر هنا . واصطلح الفقهاء من المالكية : على إطّلاق الافتداء على اختلاع المرأة من زوجها بمال تعطيه ، وإطلاق الخلع على الاختلاع بإسقاطها عنه بقية الصداق ، أو النفقة لها ، أو لأولادها .ويحتمل أن تكون صيغة { لا جناح } مستعملة في التحريض على الصلح ، أي إصلاح أمرهما بالصلح وحسن المعاشرة ، فنفي الجناح من الاستعارة التمليحية؛ شبّه حال من ترك الصلح واستمرّ على النشوز والإعراض بحال من ترك الصلح عن عمد لظنّه أنّ في الصلح جناحاً . فالمراد الصلح بمعنى إصلاح ذات البين ، والأشهر فيه أن يقال الإصلاح . والمقصود الأمر بأسباب الصلح ، وهي : الإغضاء عن الهفوات ، ومقابلة الغلظة باللين ، وهذا أنسب وأليق بما يرد بعده من قوله : { وإن يتفرّقا يغن الله كلاّ من سعته } .وللنشوز والإعراض أحوال كثيرة : تقوى وتضعف ، وتختلف عواقبها ، . باختلاف أحوال الأنفس ، ويجمعها قوله : { خافت من بِعَلها نشوزاً أو إعراضاً } . وللصلح أحوال كثيرة : منها المخالعة ، فيدخل في ذلك ما ورد من الآثار الدالّة على حوادث من هذا القبيل . ففي «صحيح البخاري» ، عن عائشة ، قالت في قوله تعالى : { وإن امرأة خافت من بعلها نشوزاً } قالت : الرجل يكون عنده المرأة ليس بمستكثر منها يريد أن يفارقها ، فتقول له أجعلك من شأني في حلّ . فنزلت هذه الآية . وروى الترمذي ، بسند حسن عن ابن عباس ، أنّ سودة أمّ المؤمنين وهبت يومها لعائشة ، وفي أسباب النزول للواحدي : أنّ ابنة محمد بن مسلمة كانت عند رافع بن خديج فكره منها أمراً ، أيّ كِبَراً فأراد طلاقها ، فقالت له : أمسكني واقْسِم لي ما بدَا لك .فنزلت الآية في ذلك .وقرأ الجمهور : { أن يصّالحا } بتشديد الصاد وفتح اللام وأصله يتصالحا ، فأدغمت التاء في الصاد ، وقرأ عاصم ، وحمزة ، والكسائي ، وخلف : «إن يُصْلِحَا» بضمّ التحتيّة وتخفيف الصاد وكسر اللام أي يُصلح كلّ واحد منهما شأَنهما بما يبدو من وجوه المصالحة .والتعريف في قوله : { والصلح خير } تعريف الجنس وليس تعريف العهد ، لأنّ المقصود إثبات أنّ ماهية الصلح خير للناس ، فهو تذييل للأمر بالصلح والترغيب فيه ، وليس المقصود أنّ الصلح المذكورَ آنفاً ، وهو الخلع ، خير من النزاع بين الزوجين ، لأنّ هذا ، وإنّ صحّ معناه ، ألاّ أنّ فائدة الوجه الأوّل أوفر ، ولأنّ فيه التفادي عن إشكال تفضيل الصلح على النزاع في الخيرية مع أنّ النزاع لا خير فيه أصلاً . ومن جعل الصلح الثاني عين الأوّل غرّته القاعدة المتداولة عند بعض النحاة ، وهي : أنّ لفظ النكرة إذا أعيد معرّفاً باللام فهو عين الأولى . وهذه القاعدة ذكرها ابن هشام الأنصاري في «مغني اللبيب» في الباب السادس ، فقال : يقولون : «النكرة إذا أعيدت نكرة كانت غير الأولى ، وإذا أعيدت معرفة ، أو أعيدت المعرفة معرفة أو نكرة كانت الثانية عين الأولى» ، ثم ذكر أنّ في القرآن آيات تَرُدّ هذه الأحكام الأربعة كقوله تعالى : { الله الذي خلقكم من ضعف ثم جعل من بعد ضعف قوةً ثم جعل من بعد قوة ضعفاً } \\[ الروم : 54 \\] وقوله : { أن يصّالحا بينهما صلحاً والصلح خير } \\[ النساء : 128 \\] { زدناهم عذاباً فوق العذاب } \\[ النحل : 88 \\] والشيء لا يكون فوق نفسه { أن النَّفْس بالنفس } \\[ المائدة : 45 \\] { يسألك أهل الكتاب أن تُنَزّل عليهم كتاباً من السماء } \\[ النساء : 153 \\] ، وأنّ في كلام العرب ما يردّ ذلك أيضاً . والحقّ أنّه لا يختلف في ذلك إذا قامت قرينة على أنّ الكلام لتعريف الجنس لا لتعريف العهد ، كما هنا . وقد تقدّم القول في إعادة المعرفة نكرة عند قوله تعالى : { وقاتلوهم حتّى لا تكون فتنة } في سورة البقرة ( 193 ) . ويأتي عند قوله تعالى : { وقالوا لولا نزّل عليه آية من ربّه } في سورة الأنعام ( 37 ) .وقوله { خير } ليس هو تفضيلاً ولكنّه صفة مشبّهة ، وزنه فَعْل ، كقولهم : سَمْح وسَهْل ، ويجمع على خيور . أو هو مصدر مقابل الشرّ ، فتكون إخباراً بالمصدر . وأمّا المراد به التفضيل فأصل وزنه أفْعَل ، فخفّف بطرح الهمزة ثم قلب حركته وسكونه .جمعه أخيار ، أي والصلح في ذاته خير عظيم . والحمل على كونه تفضيلاً يستدعي أن يكون المفضّل عليه هو النشوز والإعراض . ، وليس فيه كبير معنى .وقد دلّت الآية على شدّة الترغيب في هذا الصلح بمؤكّدات ثلاثة : وهي المصدر المؤكّد في قوله : { صلحاً } ، والإظهارُ في مقام الإضمار في قوله : { والصلح خير } ، والإخبار عنه بالمصدر أو بالصفة المشبهة فإنّها تدلّ على فعللِ سَجية .ومعنى { وأحضرت الأنفس الشحّ } ملازمة الشحّ للنفوس البشرية حتّى كأنّه حاضر لديها . ولكونه من أفعال الجبلّة بُني فعله للمجهول على طريقة العرب في بناء كلّ فعل غير معلوممِ الفاعل للمجهول ، كقولهم : شُغف بفلانة ، واضطُرّ إلى كذا .ف«الشحّ» منصوب على أنّه مفعول ثان ل«أحضرِت» لأنّه من باب أعطَى .وأصل الشحّ في كلام العرب البخل بالمال ، وفي الحديث \" أنْ تَصْدّقَ وأنت صحيح شحيح تخشَى الفقر وتأمل الغنى \" وقال تعالى : { ومن يوق شحّ نفسه فأولئك هم المفلحون } \\[ الحشر : 9 \\] ويطلق على حرص النفس على الحقوق وقلّة التسامح فيها ، ومنه المشاحّة ، وعكسه السماحة في الأمرين .فيجوز أن يكون المراد بالصلح في هذه الآية صلح المال ، وهو الفدية . فالشحّ هو شحّ المال ، وتعقيب قوله : { والصلح خير } بقوله : { وأحضرت الأنفس } على هذا الوجه بمنزلة قولهم بعد الأمر بما فيه مصلحة في موعظة أو نحوها : وما إخالك تفعل ، لقصد التحريض .ويجوز أن يكون المراد من الشحّ ما جبلت عليه النفوس : من المشاحّة ، وعدم التساهل ، وصعوبة الشكائم ، فيكون المراد من الصلح صلح المال وغيره ، فالمقصود من تعقيبه به تحذير الناس من أن يكونوا متلبّسين بهذه المشاحّة الحائلة دون المصالحة . وتقدّم الكلام على البخل عند قوله تعالى : { ولا يحسبنّ الذين يبخلون بما آتاهم الله } في سورة آل عمران ( 180 ) . وقد اشتهر عند العرب ذمّ الشحّ بالمال ، وذمّ من لا سماحة فيه ، فكان هذا التعقيب تنفيراً من العوارض المانعة من السماحة والصلح ، ولذلك ذيّل بقوله : { وإن تحسنوا وتتّقوا فإن الله كان بما تعملون خبيراً } لما فيه من الترغيب في الإحسان والتقوى .\n\n",
      "translations": [
        {
          "translation": "(If a woman) i.e. 'Umayrah (feareth) is aware of (ill treatment) i.e. refrains from having sex with her (from her husband) As'ad Ibn al-Rabi', (or desertion) not speaking or sitting with her, (it is no sin for them twain) the man and the woman (if they make terms of peace between themselves) between the husband and wife whereby both of them are made content. (Peace) such that the wife is pleased (is better) than transgression and aversion. (But greed hath been made present in the minds) souls are naturally inclined to be parsimonious, such that the wife withholds the share of her husband; it is also said that this means: her greed drives her to be pleased. (If ye do good) if you are equal in your treatment of the young wife and the elderly wife in the estates and maintenance (and keep from evil) avoid transgression and aversion, (Lo! Allah is ever Informed of what ye do) of transgression and aversion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِنِ ٱمْرَأَةٌ خَافَتْ مِن بَعْلِهَا نُشُوزاً أَوْ إِعْرَاضاً } معناه ذهابٌ عنها، أَو تغير ما\n\n",
      "translations": [
        {
          "translation": " And the saying of Allah: {And if a woman fears from her husband rebellion or aversion} means going away from her or changing what",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِنِ } اضطرت { ٱمْرَأَةٌ } إلى الفرقة والسراح بأن { خَافَتْ مِن بَعْلِهَا } سوء عشرته معها\n وعدم رعاية حقوقها { نُشُوزاً } عنها وميلاً إلى غيرها { أَوْ إِعْرَاضاً } طلاقاً وسراحاً { فَلاَ جُنَاْحَ } أي: لا ضيق\n ولا تعب { عَلَيْهِمَآ } أي: على الزوجين { أَن يُصْلِحَا بَيْنَهُمَا } بأن أسقط كل منهما عما استحق له شيئاً\n أو زاد إلى أن يتصالحا { صُلْحاً } ناشئاً عن التراضي من الجانبين { وَٱلصُّلْحُ } بينهما { خَيْرٌ } من الفرقة والطلاق { وَ } لكن فلما يقع إذا { أُحْضِرَتِ ٱلأنْفُسُ } الأمارة بالسوء من الجانبين { ٱلشُّحَّ } أي: قد صارت الأنفس حينئذ مطبوعة مرغوبة على إحضار الشح والبخل فيما وجب عليها\n فلا يسمح كل منهما من حقه شيئاً\n لذلك لم يرتفع النزاع والخصومة { وَإِن تُحْسِنُواْ } أيها المؤمنون في المعاشرة مع الأزواج { وَتَتَّقُواْ } من غضب الله في الخروج عن مقتضى حدوده { فَإِنَّ ٱللَّهَ } المجازي لعباده { كَانَ بِمَا تَعْمَلُونَ } من الميل إلى المحارم والإعراض عن حدود الله والمخالفة لأمره { خَبِيراً } [النساء: 128] يجازيكم على مقتضى خبرته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { امرأة }: فاعل بفعل يفسره ما بعده، وأصل  يَصَّالِحَا: يتصالحا، فأدغمت، و { صُلحًا } مصدر. وقرأ الكوفيون: { يُصلحا } من الرباعي، فتنصب { صُلحًا } على المفعول به، أو المصدر، و { بينهما } ظرف، أو حال منه، وجملة { الصلح خير }: معترضة، وكذا: { وأحضرت الأنفس الشح } ، ولذلك اغتفر عدم تجانسهما. يقول الحقّ جلّ جلاله: { وإن امرأة خافت } وتوقعت من زوجها { نُشُوزًا } أي: ترفعًا عن صحبتها، وتجافيًا عنها، كراهية لها، ومنعًا لحقوقها، { أو إعراضًا } عنها، بأن يترك مجالستها، ومحادثتها، { فلا جناح عليهما } أن يتصالحا { بينهما صلحًا } بإن تحط له مهرها، أو من قسمها مع ضرتها، أو تهب له شيئًا تستميله به. نزلت في سعد بن الربيع، تزوج على امرأته شابةً، وآثرها عليها. وقيل: في رجل كبرت امرأته، وله معها أولاد. فأراد طلاقها ليتزوج، فقالت له: دعني على أولادي، وأقسم لي في كل شهرين أو أكثر، أو لا تقسم. فذكر ذلك النبي صلى الله عليه وسلم فقال له:\n \" قد سمع الله ما تقول، فإن شاء أجابك \" \n، فنزلت. وقيل: نزلت في سودة زوج النبي صلى الله عليه وسلم، لما كبرت، أراد ـ عليه الصلاة والسلام ـ أن يُفارقها، فقالت: أمسكني في نسائك ولا تقسم لي، فقد وهبتُ نوبتي لعائشة، فإني أريد أن أُبعث في نسائك. ثم رغَّب في الصلح فقال: { والصلح خير } من المفارقة، أو من سوء العشرة والخصومة، أو خير في نفسه، ولا يكون إلا مع ترك بعض حق النفس من أحد الخصمين، فلذلك ثقل على النفس فشحت به، وإليه أشار بقوله: { وأحضرت الأنفس الشح } أي: جعلته حاضرًا لديها لا يفارقها، لأنها مطبوعة عليه، فالمرأة لا تكاد تسمح للزوج من حقها، ولا تسخو بشيء تعطيه لزوجها، والزوج لا يكاد يصبر على إمساكها وإحسان عشرتها إذا كَرِهها، { وإن تحسنوا } العشرة { وتتقوا } النشوز والإعراض ونقص حق المرأة مع كراهة الطبع لها، { فإن الله كان بما تعملون خبيرًا } لا يخفى عليه إحسانكم ولا نشوزكم، فيجازي كُلاًّ بعمله، وفي بعض الأثر: من صبرعلى أذى زوجته أعطاه الله ثواب أيوب عليه السلام، وكذلك المرأة. والله تعالى أعلم. الإشارة: اعلم أن النفس كالمرأة حين يتزوجها الرجل، فإنها أذا رأت من زوجها الجد في أموره والانقباض عنها، هابته وانقادت لأمره، وإذا رأت منه الليونة والسيولة استخفت بأمره وركبته، وسقطت هيبته من قبلها، فإذا أمرها ونهاها لم تحتفل بأمره، وكذلك النفس إذا رأت من المريد الجد في بدايته والصولة عليها، هابته وانقادت لأمره وكانت له سميعة مطيعة، وإذا رأت منه الرخو والسهولة معها، ركبته وصعب عليه انقيادها وجهادها، فإذا صال عليها وقهرها فأرادت الصلح معه على أن يسامحها في بعض الأمور، وتساعفه فيما يُريد منها، فلا جناح عليهما أن يصالحا بينهما صلحًا، والصلح خير، فإن دوام التشديد قد يفضي إلى الملل، وإن تحسنوا معها بعد معرفتها، وتتقوا الله في سياستها ورياضتها حتى ترد بكم إلى حضرة ربها، فإن الله كان بما تعملون خبيرًا.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "64:16",
      "similarity": 0.44278674297044646
    },
    {
      "verse": "37:125",
      "similarity": 0.3666976788867496
    },
    {
      "verse": "4:34",
      "similarity": 0.29442776142494065
    },
    {
      "verse": "2:228",
      "similarity": 0.28765418975833984
    },
    {
      "verse": "11:72",
      "similarity": 0.2739938122113727
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004128.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004128.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:128.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}