{
  "chapter": "النساء",
  "text": "ولن تستطيعوا۟ ان تعدلوا۟ بين النساء ولو حرصتم فلا تميلوا۟ كل الميل فتذروها كالمعلقة وان تصلحوا۟ وتتقوا۟ فان الله كان غفورا رحيما",
  "translations": [
    {
      "translation": "You will not be able to be completely fair between your wives, however hard you try. But do not be completely partial so as to leave a wife, as it were, suspended in mid-air. And if you make amends and have taqwa, Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Howsoever you may try you will never be able to treat your wives equally. But do not incline (to one) exclusively and leave (the other) suspended (as it were). Yet if you do the right thing and are just, God is verily forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will not be able to treat your wives with absolute justice not even when you keenly desire to do so. (It suffices in order to follow the Law of Allah that) you incline not wholly to one, leaving the other in suspense. If you act rightly and remain God-fearing, surely Allah is All-Forgiving, All-Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will never be able to maintain justice among your wives and love them all equally, no matter how hard you try. Do not give total preference to one of them, leaving the other as if in suspense. If you do bring about reconciliation and maintain piety, God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will never be able to deal equally between women however much you may desire – therefore do not be totally inclined towards one leaving the other in uncertainty; and if you do good and practice piety, then (know that) Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will never be able to do perfect justice between wives even if it is your ardent desire, so do not incline too much to one of them so as to leave the other hanging. And if you do justice, and do all that is right and have Taqwa, then Allah is Ever Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you have it not in your power to do justice between wives, even though you may wish (it), but be not disinclined (from one) with total disinclination, so that you leave her as it were in suspense; and if you effect a reconciliation and guard (against evil), then surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will not be able to be equitable between your wives, be you ever so eager; yet do not be altogether partial so that you leave her as it were suspended. If you set things right, and are godfearing, God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye will not be able to deal equally between (your) wives, however much ye wish (to do so). But turn not altogether away (from one), leaving her as in suspense. If ye do good and keep from evil, lo! Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will never be able to treat your wives with equal fairness, however much you may desire to do so, but do not ignore one wife altogether, leaving her suspended [between marriage and divorce]. And if you make amends and act righteously, surely God is most forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ye are not able to deal evenly between the wives, even though ye long to do so, but incline not an extreme inclining so that ye may leave her as one ahanging. And if ye effect a reconciliation and fear Allah, then Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will not be able to be fair between wives, even if you are eager to do so. Yet do not turn away from one altogether, leaving her as if in a suspense. But if you are conciliatory and Godwary, Allah is indeed all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye are never able to be fair and just as between women, even if it is your ardent desire: But turn not away (from a woman) altogether, so as to leave her (as it were) hanging (in the air). If ye come to a friendly understanding, and practise self-restraint, Allah is Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will never be able to do perfect justice between wives even if it is your ardent desire, so do not incline too much to one of them (by giving her more of your time and provision) so as to leave the other hanging (i.e. neither divorced nor married). And if you do justice, and do all that is right and fear Allah by keeping away from all that is wrong, then Allah is Ever Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will not be able to be just between your women, even though you are eager. Do not be altogether partial so that you leave her as if she were suspended. If you reform and are cautious, Allah is the Forgiver, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will not be able to treat women with equal fairness, no matter how much you desire it. But do not be so biased as to leave another suspended. If you make amends, and act righteously—God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you will never be able to be equal [in feeling] between wives, even if you should strive [to do so]. So do not incline completely [toward one] and leave another hanging. And if you amend [your affairs] and fear Allah - then indeed, Allah is ever Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:129] You will never be able to be just to, to treat equally, your wives, in terms of love, even if you be eager, for this; yet do not turn altogether away, towards the one you love with respect to the shares and maintenance expenses, so that you leave her, the one from whom you turn away, like one suspended, one that is neither a slavegirl nor a woman with a husband. If you set things right, by being just with the shares, and fear, injustice, surely God is ever Forgiving, regarding the inclination in your hearts, Merciful, to you in this respect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Ye will not be able to deal equally between (your) wives) as regards love, (however much ye wish (to do so)) even if you exert your efforts: (But turn not altogether away) with your bodies ((from one)) in favour of the young wife, (leaving her) the other one: the old wife (as in suspense) like a prisoner: neither unmarried nor married. (If ye do good and keep from evil) if you treat them equally and avoid transgression and aversion, (lo! Allah is ever Forgiving) of those who repent of transgression and aversion, (Merciful) towards those who die in a state of repentance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَتَذَرُوهَا كَالْمُعَلَّقَةِ } معناهُ كَالمَسجُونةِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Leave it as an suspended/unresolved matter\" - its meaning is like that of a prisoner.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إن كنتم ذوي أزواج فوق واحدة { لَن تَسْتَطِيعُوۤاْ أَن تَعْدِلُواْ } وتعاشروا بالقسط إلى ألاَّ يقع التفاوت والتفاضل { بَيْنَ ٱلنِّسَآءِ } أصلاً { وَلَوْ حَرَصْتُمْ } بالغتم في رعاية العدل؛ إذ الميل الطبيعي يأبى عن إقامة العدل، لذلك قيل: لا وجود للاعتدال الحقيقي سيما في أمثاله { فَلاَ تَمِيلُواْ } أي: فعليكم ألاَّ تميلوا، وتجانبوا عما تميلوا عنه { كُلَّ ٱلْمَيْلِ فَتَذَرُوهَا } إلى حيث تتركوها { كَٱلْمُعَلَّقَةِ } لا أيماً ولا ذات بعل { وَإِن تُصْلِحُواْ } بعدما أفسدتم { وَتَتَّقُواْ } عن غضب الله في إضاعة حقها { فَإِنَّ ٱللَّهَ } المطلع لجميع ما صدر ويصدر عنكم { كَانَ غَفُوراً } لكم بعد ما تبتم ورجعتم عما صدر عنكم { رَّحِيماً } [النساء: 129] لكم يقبل توبتكم إن أخلصتم فيها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ولن تستطيعوا } ، يا معشر الأزواج، { أن تعدلوا بين النساء } العدل الكامل التام في الأقوال والأفعال والنفقة والكسوة والمحبة، { ولو حرصتم } على ذلك لضعف حالكم، وقد خففت عنكم، وأسقطت الحرج عنكم، فلا يجب العدل في البيت فقط، وكان صلى الله عليه وسلم يَقسِمُ بين نِسَائِه فيعِدلُ ويقُولُ:\n\n \" اللهمَّ هذه قسمتي فِيمَا أملِك، فلا تُؤاخِذني فيمَا لا أملِكُ \" \n\n، يعني: ميل القلب، وكان عمر رضي الله عنه يقول:اللهم قلبي فلا أملكُه، وأما سوى ذلك فإني أرجو أن أعدل، وأما الوطء فلا يجب العدل فيه، إلا أن تتحرك شهوته، فيكف لتتوفر لذته للأخرى\n { فلا تميلوا } إلى المرغوب فيها لجمالها أو شبابها، { كُلَّ الميل } بالنفقة والكسوة والإقبال عليها، وتَدَعُوا الأخرى { كالمعلقة } التي ليست ذات بعل ولا مطلقة، كأنها محبوسة مسجونة، وعن النبي صلى الله عليه وسلم:\n\n \" من كانت له أمَرأتانِ يَميلُ معَ إحدَاهما، جَاء يومَ القِيَامَةِ، وأحَدُ شِقّيه مَائِلٌ \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:27",
      "similarity": 0.5200695398066669
    },
    {
      "verse": "12:103",
      "similarity": 0.389314151673969
    },
    {
      "verse": "16:37",
      "similarity": 0.38180036177130694
    },
    {
      "verse": "96:2",
      "similarity": 0.3291158983123978
    },
    {
      "verse": "75:38",
      "similarity": 0.3269259305188158
    }
  ]
}