{
  "chapter": "النساء",
  "text": "ومن يعمل من الصلحت من ذكر او انثى وهو مؤمن فاو۟لئك يدخلون الجنة ولا يظلمون نقيرا",
  "translations": [
    {
      "translation": "Anyone, male or female, who does right actions and is a mumin, will enter the Garden. They will not be wronged by so much as the tiniest speck.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who performs good deeds, whether man or a woman, and is a believer, will surely enter Paradise, and none shall be deprived even of an iota of his reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever does good and believes -whether he is male or female - such shall enter the Garden, and they shall not be wronged in the slightest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Any believer, male or female, who acts righteously, will enter Paradise and will not suffer the least bit of injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does some good deeds, be it a man or woman, and is a Muslim, will be admitted to Paradise and they will not be wronged even to the extent of one sesame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does righteous good deeds, male or female, and is a believer, such will enter Paradise and not the least injustice, even to the size of a Naqir, will be done to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does good deeds whether male or female and he (or she) is a believer-- these shall enter the garden, and they shall not be dealt with a jot unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever does deeds of righteousness, be it male or female, believing - they shall enter Paradise, and not be wronged a single date-spot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoso doeth good works, whether of male or female, and he (or she) is a believer, such will enter paradise and they will not be wronged the dint in a date-stone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Anyone who performs good deeds, whether it be a man or woman, provided that he is a believer, shall enter Paradise. No one shall suffer the least injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever worketh of righteous works, male or female, and is a believer, these shall enter the Garden and shall not be wronged a speck.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does righteous deeds, whether male or female, should he be faithful—such shall enter paradise and they will not be wronged [so much as] the speck on a date-stone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any do deeds of righteousness,- be they male or female - and have faith, they will enter Heaven, and not the least injustice will be done to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does righteous good deeds, male or female, and is a true believer in the Oneness of Allah (Muslim), such will enter Paradise and not the least injustice, even to the size of a Naqira (speck on the back of a date-stone), will be done to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whosoever does good works of righteousness, whether they be a believing male or female, shall enter Paradise, and not be wronged a pit mark of a date stone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever works righteousness, whether male or female, and is a believer—those will enter Paradise, and will not be wronged a whit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does righteous deeds, whether male or female, while being a believer - those will enter Paradise and will not be wronged, [even as much as] the speck on a date seed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:124] And whoever does, any, righteous deeds, whether male or female, and is a believer — such shall be admitted into (read passive yudkhalūna, or active yadkhulūna, ‘they shall enter’) Paradise, and not be wronged, by as much as, the dint in a date-stone.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And whoso doeth good works) acts of obedience, relating to that which is between him and his Lord, (whether of male or female, and he (or she) is a believer) while being a believer who is genuine in his or her faith, (such will enter Paradise and they will not be wronged the dint in a date stone) their rewards will not be diminished even if it be by the size of the dint in a date stone. 102\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَن يَعْمَلْ مِنَ ٱلصَّٰلِحَٰتِ } المأمورة كلها\n أو بعضها سواء كان { مِن ذَكَرٍ أَوْ أُنْثَىٰ وَ } الحال أنه { هُوَ مُؤْمِنٌ } بتوحيد الله وجميع كتبه ورسله { فَأُوْلَـٰئِكَ } الصالحون الأمناء { يَدْخُلُونَ ٱلْجَنَّةَ } المعدة لأهل الإيمان والصلاح { وَلاَ يُظْلَمُونَ } ينقصون من جزاء ما عملوا { نَقِيراً } [النساء: 124] مقدار نقر النواة\n بل يزدادون عليها ما شاء الله\n لا حول ولا قوة إلا بالله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nالإشارة: { من ذكر أو أنثى }: حال من الضمير في { يعمل } \n وكذا قوله: { وهو مؤمن } و { حنيفًا } ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:8",
      "similarity": 0.8924004972030732
    },
    {
      "verse": "4:53",
      "similarity": 0.8354272848271188
    },
    {
      "verse": "40:40",
      "similarity": 0.2778319982624134
    },
    {
      "verse": "16:97",
      "similarity": 0.2206449672019622
    },
    {
      "verse": "53:21",
      "similarity": 0.18710414273819817
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/4:124.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/4:124.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/4:124.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}