{
  "chapter": "النساء",
  "text": "ليس بامانيكم ولا امانى اهل الكتب من يعمل سوءا يجز به ولا يجد له من دون الله وليا ولا نصيرا",
  "translations": [
    {
      "translation": "It is not a matter of wishful thinking on your part nor of the wishful thinking of the People of the Book. Anyone who does evil will be repaid for it. He will not find any protector or helper besides Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is neither dependent on your wishes, nor the wishes of the people of the Book, (but) whosoever does ill will be punished for it, and will find no protector or friend apart from God;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is neither your fancies nor the fancies of the People of the Book which matter. Whoever does evil shall reap its consequence and will find none to be his protector and helper against Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers and People of the Book, wishes alone can never provide you with salvation. Whoever commits evil will be punished accordingly and no one besides God will be his guardian or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The affair does not rest on your thoughts, nor the cravings of the People given the Book(s); whoever does wrong will get the recompense of it – and will not find, other than Allah, any friend or any supporter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will not be in accordance with your desires, nor those of the People of the Scripture, whosoever works evil, will have the recompense thereof, and he will not find any protector or helper besides Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This) shall not be in accordance with your vain desires nor in accordance with the vain desires of the followers of the Book; whoever does evil, he shall be requited with it, and besides Allah he will find for himself neither a guardian nor a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not your fancies, nor the fancies of the People of the Book. Whosoever does evil shall be recompensed for it, and will not find for him, apart from God, a friend or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will not be in accordance with your desires, nor the desires of the People of the Scripture. He who doeth wrong will have the recompense thereof, and will not find against Allah any protecting friend or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not your desires, nor the desires of the People of the Book, that shall prevail. Anyone who commits evil will be rewarded accordingly. He will not find any protector or patron for himself besides God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not by your vain desires nor by the vain desires of the people of the Book; whosoever worketh an evil, shall be requited therewith, and he will not find beside Allah a patron nor a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be neither after your hopes nor the hopes of the People of the Book: whoever commits evil shall be requited for it, and he will not find for himself any guardian or helper besides Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not your desires, nor those of the People of the Book (can prevail): whoever works evil, will be requited accordingly. Nor will he find, besides Allah, any protector or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will not be in accordance with your desires (Muslims), nor those of the people of the Scripture (Jews and Christians), whosoever works evil, will have the recompense thereof, and he will not find any protector or helper besides Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not by your fancies, nor by the fancies of the People of the Book. Whosoever does evil shall be recompensed for it, and he will not find for himself, other than Allah, a guardian or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not in accordance with your wishes, nor in accordance with the wishes of the People of the Scripture. Whoever works evil will pay for it, and will not find for himself, besides God, any protector or savior.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Paradise is not [obtained] by your wishful thinking nor by that of the People of the Scripture. Whoever does a wrong will be recompensed for it, and he will not find besides Allah a protector or a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:123] When the Muslims and the People of the Scripture began to pride themselves [upon God’s promise] the following was revealed: It, this matter, is not, dependent upon, your desires nor the desires of the People of the Scripture, but upon righteous deeds. Whoever does evil shall be requited for it, either in the Hereafter or in this life through trials and tribulations, as is stated in hadīth; and he will not find besides God, that is, other than Him, any friend, to protect him, or helper, to defend him against Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالأظهر أنّ قوله : { ليس بأمانيكم } استئناف ابتدائي للتنويه بفضائل الأعمال ، والتشويه بمساويها ، وأنّ في ( ليس ) ضميراً عائداً على الجزاء المفهوم من قوله : { يجز به } ، أي ليس الجزاء تابعاً لأماني الناس ومشتهاهم ، بل هو أمر مقدّر من الله تعالى تقديراً بحسب الأعمال ، وممّا يؤيّد أن يكون قوله : { ليس بأمانيكم } استئنافاً ابتدائياً أنّه وقع بعد تذييل مُشعر بالنهاية وهو قوله : { ومن أصْدق من الله قيلاً } \\[ النساء : 122 \\] . ومِمّا يرجّحه أنّ في ذلك الاعتبار إبهاماً في الضمير ، ثم بياناً له بالحملة بعده ، وهي : { من يعمل سوءاً يجز به } ؛ وأنّ فيه تقديم جملة { ليس بأمانيكم } عن موقعها الذي يُترقّب في آخر الكلام ، فكان تقديمها إظهاراً للاهتمام بها ، وتهيئةً لإبهام الضمير . وهذه كلّها خصائص من طرق الإعجاز في النظم . وجملة { من يعمل سوءاً يجز به } استئناف بياني ناشىء عن جملة { ليس بأمانيكم } لأنّ السامع يتساءل عن بيان هذا النفي المجمل . ولهذا الاستئناف موقع من البلاغة وخصوصية تفوت بغير هذا النظم الذي فسّرناه . وجعل صاحب «الكشاف» الضمير المستتر عائداً على وعد الله ، أي ليس وعدّ الله بأمانيّكم؛ فتكون الجملة من تكملة الكلام السابق حالاً من { وعْدَ الله } \\[ النساء : 122 \\] ، وتكون جملة { من يعمل سوءاً يحز به } استئنافاً ابتدائياً محضاً .روي الواحدي في أسباب النزول بسنده إلى أبي صالح ، وروى ابن جرير بسنده إلى مسروق ، وقتادةَ ، والسدّي ، والضحاك ، وبعضُ الروايات يزيد على بعض ، أنّ سبب نزولها : أنّه وقع تحاجّ بين المسلمين وأهل الكتاب : اليهود والنصارى ، كلّ فريق يقول للآخرين : نحن خير منكم ، ويحتجّ لذلك ويقول : لن يدخل الجنة إلاّ من كان على ديننا . فأنزل الله { ليس بأمانيكم ولا أماني أهل الكتاب } الآيات مبين أن كلّ من اتّبع هدى الله فهو من أهل الجنة وكلّ من ضلّ وخالف أمر الله فهو مجازى بسوء عمله ، فالذين آمنوا من اليهود قبل بعثة عيسى وعملوا الصالحات هم من أهل الجنة وإن لم يكونوا على دين عيسى ، فبطل قول النصارى : لن يدخل الجنة إلا من كان على ديننا والذين آمنوا بموسى وعيسى قبل بعثه محمد صلى الله عليه وسلم وعملوا الصالحات يدخلون الجنّة ، فبطل قول المسلمين واليهود : لن يدخل الجنّة إلاّ من كان على ديننا فكانت هذه الآية حكماً فصلاً بين الفرق ، وتعليماً لهم أن ينظروا في توفّر حقيقة الإيمان الصحيح ، وتوفّر العمل الصالح معه ، ولذلك جمع الله أماني الفرق الثلاث بقوله : { ليس بأمانيكم ولا أماني أهل الكتاب } . ثم إنّ الله لَوّح إلى فلج حجّة المسلمين بإشارة قوله : { وهو مؤمن } فإن كان إيمان اختلّ منه بعض ما جاء به الدين الحقّ ، فهو كالعدم ، فعقّب هذه الآية بقوله : { ومن أحسن دينا ممّن أسلم وجهه الله وهو محسن واتّبع ملّة إبراهيم حنيفاً }\\[ النساء : 125 \\] . والمعنى أنّ الفوز في جانب المسلمين ، لا لأنّ أمانيّهم كذلك ، بل لأنّ أسباب الفوز والنجاة متوفّرة في دينهم . وعن عكرمة : قالت اليهود والنصارى : لن يدخل الجنّة إلاّ من كان منّا . وقال المشركون : لا نُبْعث .والباء في قوله : { بأمانيكم } للملابسة ، أي ليس الجزاء حاصلاً حصولاً على حسب أمانيّكم ، وليست هي الباء التي تزاد في خبر ليس لأنّ أمانيّ المخاطبين واقعة لا منفية .والأمانيّ جمع أمنية ، وهي اسم للتمنّي ، أي تقدير غير الواقع واقعاً . والأمنية بوزن أفعولة كالأعجوبة . وقد تقدّم ذلك في تفسير قوله تعالى : { لا يعلمون الكتاب إلاّ أمانيّ } في سورة البقرة ( 78 ) . وكأنَّ ذكر المسلمين في الأماني لقصد التعميم في تفويض الأمور إلى ما حكم الله ووعد ، وأنّ ما كان خلاف ذلك لا يعتدّ به . وما وافقه هو الحقّ ، والمقصد المهمّ هو قوله : { ولا أمانيّ أهل الكتاب } على نحو : { وإنّا أو إيّاكم لعلى هدى أو في ضلال مبين } \\[ سبأ : 24 \\] فإنّ اليهود كانوا في غرور ، يقولون : لن تمسنّا النار إلاّ أيّاماً معدودة . وقد سمّى الله تلك أماني عند ذكره في قوله : { وقالوا لن تمسنّا النار إلاّ أيّاماً معدودة } \\[ البقرة : 80 \\] { تلك أمانيّهم } \\[ البقرة : 111 \\] . أمّا المسلمون فمُحاشون من اعتقاد مثل ذلك .وقيل : الخطاب لكفار العرب ، أي ليس بأمانيّ المشركين ، إذ جعلوا الأصنام شفعاءهم عند الله ، ولا أمانيّ أهل الكتاب الذين زعموا أنّ أنبياءهم وأسلافهم يغنون عنهم من عذاب الله ، وهو محمل للآية .وقوله : { ولا يجد له من دون الله ولياً ولا نصيراً } زيادة تأكيد ، لردّ عقيدة من يتوهّم أنّ أحداً يغني عن عذاب الله .والوليّ هو المولى ، أي المشارك في نسب القبيلة ، والمراد به المدافع عن قريبه ، والنصيرُ الذي إذا استنجدته نصرَك ، أو الحليف ، وكان النصر في الجاهلية بأحد هذين النوعين .\n\n",
      "translations": [
        {
          "translation": "(It will not be in accordance with your desires) it is not as you desire, believers, that no harm shall come to you after you have accepted the faith, (nor the desires of the People of the Scripture) nor is it as the people of the Book desire when they say: \"whatever sins we commit during the day will be forgiven at night, and whatever sins we commit during the night will be forgiven in the day\". (He who doeth wrong) evil (will have the recompense thereof) the believers will be recompensed in this world or after death before entering Paradise, and the unbelievers in the Hereafter before entering hell, (and will not find against Allah) against the torment of Allah (any protecting friend) any relative to benefit him (or helper) to save him from the torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وبالجملة: { مَن يَعْمَلْ } منكم ومنهم { سُوۤءًا } بسوء به نفسه وغيره { يُجْزَ بِهِ } على مقتضى عدل الله عاجلاً وآجلاً { وَلاَ يَجِدْ لَهُ مِن دُونِ ٱللَّهِ وَلِيّاً } ينقذه من عذاب الله { وَلاَ نَصِيراً } [النساء: 123] يحمل بعض عذابه تخفيفاً له",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: اسم ليس ضمير الأمر، أي: ليس الأمر بأمانيكم. يقول الحقّ جلّ جلاله: { ليس } هذا الوعد الذي ذكرت لأهل الإيمان يُنَال { بأمانيكم } أي: تمنيكم أيها المسلمون، ولا بأماني { أهل الكتاب } ، أي: لا يكون ما تتمنون ولا ما يتمنى أهل الكتاب، بل يحكم الله بين عباده ويجازيهم بأعمالهم. رُوِي أن المسلمين وأهل الكتاب تفاخروا، فقال أهل الكتاب: نبينا قبل نبيكم، وكتابنا قبل كتابكم، ونحن أولى بالله منكم، وقال المسلمون: نحن أولى منكم، نبينا خاتم النبيين، وكتابنا يقضي على الكتب المتقدمة، فنزلت. وقيل: الخطاب مع المشركين، وهو قولهم: لا جنة ولا نار، أو قولهم: إن كان الأمر كما يزعم هؤلاء لتكونن خيرًا منهم وأحسن حالاً. وأماني أهل الكتاب: قولهم\n[آل عِمرَان:24]، و\n[البَقَرَة:111]، ثم قرر ذلك فقال: { من يعمل سوءًا يجز به } عاجلاً أو آجلاً لما رُوِي أنه لما نزلت قال أبو بكر: من ينجو مع هذا يا رسول الله، إن كنا مجزيين بكل سوء عملناه؟ فقال له ـ عليه الصلاة والسلام ـ\n \" أما تحزن؟ أما تمرض؟ أما يصيبك اللأواء؟ \" \nقال بلى يا رسول الله، قال:\n \" هو ذلك \" \nفكل من عمل سوءًا جوزي به، { ولا يجد له من دون الله وليًا } يليه ويدفع عنه، { ولا نصيرًا } ينصره ويمعنه من عذاب الله. الإشاره: لا تُنال المراتب بالأماني الكاذبة والدعاوي الفارغة، وإنما تنال بالهمم العالية، والمجاهدات القوية، إنما تنال المقامات العالية بالأعمال الصالحة، والأحوال الصافية، وأنشدوا:\nولما نزل قوله تعالى: { ليس بأمانيكم ولا أماني أهل الكتاب... } الآية. قال أهل الكتاب: نحن وأنتم سواء.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:58",
      "similarity": 0.5633704977778135
    },
    {
      "verse": "53:24",
      "similarity": 0.5521758819026934
    },
    {
      "verse": "2:78",
      "similarity": 0.5357640075766708
    },
    {
      "verse": "3:143",
      "similarity": 0.49691759555242154
    },
    {
      "verse": "53:20",
      "similarity": 0.4811925561770437
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004123.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004123.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:123.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}