{
  "chapter": "النساء",
  "text": "والذين ءامنوا۟ وعملوا۟ الصلحت سندخلهم جنت تجرى من تحتها الانهر خلدين فيها ابدا وعد الله حقا ومن اصدق من الله قيلا",
  "translations": [
    {
      "translation": "But as for those who have iman and do right actions, We will admit them into Gardens with rivers flowing under them, remaining in them timelessly, for ever and ever. Allah's promise is true. Whose speech could be truer than Allah's?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do good deeds We shall admit into gardens with streams of running water where they will abide for ever. True is the promise of God; and whose word could be truer than God's?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do good, We shall cause them to enter the Gardens beneath which rivers flow. Here they will abide for ever. This is Allah's promise in truth and whose word is truer than Allah's?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will admit the righteously striving believers to Paradise wherein streams flow and they will live therein forever. God's promise is true for no one is more truthful than Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed and did good deeds – We shall soon admit them into Gardens beneath which rivers flow, abiding in them for ever and ever; a true promise from Allah; and whose Words are more true than those of Allah? (Allah does not lie.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and do righteous good deeds, We shall admit them to the Gardens under which rivers flow (i.e. in Paradise) to dwell therein forever. Allah's promise is the truth; and whose words can be truer than those of Allah\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who believe and do good, We will make them enter into gardens beneath which rivers flow, to abide therein for ever; (it is) a promise of Allah, true (indeed), and who is truer of word than Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those that believe, and do deeds of righteousness, them We shall admit to gardens underneath which rivers flow, therein dwelling for ever and ever; God's promise in truth; and who is truer in speech than God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who believe and do good works We shall bring them into Gardens underneath which rivers flow, wherein they will abide for ever. It is a promise from Allah in truth; and who can be more truthful than Allah in utterance?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do good works. We shall admit them to Gardens through which rivers flow; wherein they will abide forever. This is a promise from God; and whose word could be truer than God's?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and work righteous works, anon We shall make them enter Gardens whereunder the rivers flow, as abiders therein for ever: promise of Allah, true. And who is more truthful than Allah in speech?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who have faith and do righteous deeds, We will admit them into gardens with streams running in them, to remain in them forever—a true promise of Allah, and who is truer in speech than Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do deeds of righteousness,- we shall soon admit them to gardens, with rivers flowing beneath,-to dwell therein for ever. Allah's promise is the truth, and whose word can be truer than Allah's?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe (in the Oneness of Allah - Islamic Monotheism) and do deeds of righteousness, We shall admit them to the Gardens under which rivers flow (i.e. in Paradise) to dwell therein forever. Allah's Promise is the Truth, and whose words can be truer than those of Allah? (Of course, none).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do good works We shall admit them to Gardens underneath which rivers flow, and there they shall live for ever, the promise of Allah is true. And who is truer in speech than Allah!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who believe and do righteous deeds, We will admit them into gardens beneath which rivers flow, where they will abide forever. The promise of God is true—and who is more truthful in speech than God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the ones who believe and do righteous deeds - We will admit them to gardens beneath which rivers flow, wherein they will abide forever. [It is] the promise of Allah, [which is] truth, and who is more truthful than Allah in statement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:122] But those who believe and perform righteous deeds, We shall admit them to Gardens underneath which rivers flow, abiding therein for ever; God’s promise in truth, that is, God promised them this and fulfilled it in truth; and who, that is, [and] none, is truer in utterance, that is, in statement, than God?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But as for those who believe) in Muhammad and the Qur'an (and do good works) i.e. acts of obedience, in relation to that which binds them to their Lord (We shall bring them into Gardens underneath which) beneath its rooms and habitations (rivers) of wine, water, milk and honey (flow, wherein they will abide) they will abide in Paradise, never to die or be removed (for ever. It is a promise from Allah) regarding Paradise and hell (in truth) which shall truly happen; (and who can be more truthful than Allah in utterance) in promise?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ آمَنُواْ } بولاية الله وتوحيده { وَعَمِلُواْ ٱلصَّالِحَاتِ } على مقتضى ما أمر الله ويسره { سَنُدْخِلُهُمْ } من فضلنا { جَنَّاتٍ } متنزهات من العلم والعين والحق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } أنهار الحقائق والمعارف والكشوفات والشهودات المتجددة بتجددات التجليات المترتبة على الأسماء والصفات الإلهية { خَالِدِينَ فِيهَآ أَبَداً } على هذا المنوال { وَعْدَ ٱللَّهِ } الذي وعده لخلص عباده { حَقّاً } ثابتاً في علمه الحضوري قبل خلقهم بمدة لا يعرفها إلا هو\n فعليكم أيها المؤمنون أن تصدقوا وعده الثابت عنده { وَمَنْ أَصْدَقُ مِنَ ٱللَّهِ قِيلاً } [النساء: 122] فيصدقوه ويثقوا به\n\n\nواعلموا أن ما ينالكم\n ويصل إليكم مما وعد لكم ربكم { لَّيْسَ } وصوله وحصوله { بِأَمَـٰنِيِّكُمْ } أي: بمجرد أماني بلا قدم وسلوك { وَلاۤ أَمَانِيِّ أَهْلِ ٱلْكِتَابِ } أي: ليس ما ييصل إليهم بأمانيههم\n فلا تخالفوا\n وتنازعوا معهم\n بل الأمور كلها إنما هي بمتقضى فضل الله وعدله وحسب توفيقه وتيسيره",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { وعدّ اللهِ } مصدر، مؤكد لنفسه، أي: وعدهم وعدًا، و { حقًا } مؤكد لغيره، أي: لمضمون الجملة قبله. انظر البيضاوي. يقول الحقّ جلّ جلاله: { والذين آمنوا } بالله ووحدوه، { وعملوا } الأعمال { الصالحات } التي كلفوا بها { سندخلهم جنات تجري من تحتها الأنهار خالدين فيها أبدًا } وعدهم بذلك وعدًا حقًا، { ومن أصدق من الله قيلاً } أي: لا أحدَ أصدقُ من الله في قوله. والمقصود من الآية معارضة المواعيد الشيطانية الكاذبة لقرنائه، بوعد الله الصادق لأوليائه، ترغيبًا في تحصيل أسبابه. والله تعالى أعلم. الإشارة: والذين جمعوا بين توحيد عظمة الربوبية والقيام بوظائف العبودية سندخلهم جنةَ المعارف، تجري من تحتها أنها العلوم، خالدين فيها أبدًا، وعدًا حقًا وقولاً صدقًا. ومن أصدق من الله قيلاً؟",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "65:11",
      "similarity": 0.7350111720835286
    },
    {
      "verse": "4:57",
      "similarity": 0.7103855526035184
    },
    {
      "verse": "14:23",
      "similarity": 0.6494259172672777
    },
    {
      "verse": "5:119",
      "similarity": 0.6243087336646607
    },
    {
      "verse": "22:14",
      "similarity": 0.603013578188517
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/4:122.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/4:122.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/4:122.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}