{
  "chapter": "النساء",
  "text": "يعدهم ويمنيهم وما يعدهم الشيطن الا غرورا",
  "translations": [
    {
      "translation": "Whatever the promises he makes, whatever the desires he enkindles, and whatever the hopes Satan rouses in them, are no more than delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan makes promises to them and fills them with vain hopes, but whatever he promises them is merely delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan gives them false promises and tempts them to develop longings which can never be realized.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The devil promises them and arouses desires in them; and the devil does not give them promises except of deceit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Shaytan] makes promises to them, and arouses in them false desires; and Shaytan's promises are nothing but deceptions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He gives them promises and excites vain desires in them; and the Shaitan does not promise them but to deceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He promises them and fills them with fancies, but there is nothing Satan promises them except delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He promiseth them and stirreth up desires in them, and Satan promiseth them only to beguile.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "he holds out promises to them, and fills them with vain desires: but Satan's promises are nothing but delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Satan maketh them promises and filleth them with vain desires. and Satan promiseth them not but delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He makes them promises and gives them [false] hopes, yet Satan does not promise them anything but delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan makes them promises, and creates in them false desires; but satan's promises are nothing but deception.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Shaitan (Satan)] makes promises to them, and arouses in them false desires; and Shaitan's (Satan) promises are nothing but deceptions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "he promises them and fills them with fancies, but what satan promises them is only a delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He promises them, and he raises their expectations, but Satan promises them nothing but delusions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan promises them and arouses desire in them. But Satan does not promise them except delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:120] He promises them, long life, and fills them with desires, of attaining their hopes in this world, and that there   will be neither resurrection nor requital; but what Satan promises them, therewith, is only delusion, falsehood.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He promiseth them) Satan promises them that there is no Paradise or hell (and stirreth up desires in them) he arouses hope in them that this world lasts forever, (and Satan promiseth them only to beguile) he promises them only falsehood and lies.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا يكون ولاية الشيطان خسراناً؛ إذ { يَعِدُهُمْ وَيُمَنِّيهِمْ } ما لا ينالون ويصلون إليه أصلا، كيف يصلون وإلى أي شيء ينالون { وَمَا يَعِدُهُمُ ٱلشَّيْطَانُ إِلاَّ غُرُوراً } [النساء: 120] أوهاماً وخيالات باطلة، لا وجود لها أصلاً لا حالاً ولا مآلاً؟!\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}