{
  "chapter": "النساء",
  "text": "ومن احسن دينا ممن اسلم وجهه لله وهو محسن واتبع ملة ابرهيم حنيفا واتخذ الله ابرهيم خليلا",
  "translations": [
    {
      "translation": "Who could have a better deen than someone who submits himself completely to Allah and is a good- doer, and follows the religion of Ibrahim, a man of pure natural belief? Allah took Ibrahim as an intimate friend.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whose way is better than that of the man who has submitted to God, and does good, and who follows the creed of Abraham the upright? And God chose Abraham as friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whose way of life could be better than that of he who submits his whole being to Allah, does good, and follows exclusively the way of Abraham whom Allah took for a friend?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whose religion is better than that in which one submits himself to God, behaves righteously, and follows the upright religion of Abraham, God's chosen friend?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whose religion is better than one who submits his self to Allah and is virtuous and follows the religion of Ibrahim, who was far removed from all falsehood? And Allah made Ibrahim His close friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who can be better in religion than one who submits his face (himself) to Allah; and he is a Muhsin (a doer of good). And follows the religion of Ibrahim the Hanif (Monotheist). And Allah did take Ibrahim as a Khalil (an intimate friend)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who has a better religion than he who submits himself entirely to Allah? And he is the doer of good (to others) and follows the faith of Ibrahim, the upright one, and Allah took Ibrahim as a friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is there that has a fairer religion than he who submits his will to God being a good-doer, and who follows the creed of Abraham, a man of pure faith? And God took Abraham for a friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is better in religion than he who surrendereth his purpose to Allah while doing good (to men) and followeth the tradition of Abraham, the upright? Allah (Himself) chose Abraham for friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is better in faith than one who submits himself wholly to God, acts righteously, and follows the religion of Abraham, the upright in faith, whom God chose for a friend?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who can be better in religion than he who submitteth his countenance unto Allah, and sincere, and followeth the faith of Ibrahim, the upright And Allah took Ibrahim for a friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has a better religion than him who submits his will to Allah, being virtuous, and follows the creed of Abraham, a Hanif? And Allah took Abraham for a dedicated friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who can be better in religion than one who submits his whole self to Allah, does good, and follows the way of Abraham the true in Faith? For Allah did take Abraham for a friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who can be better in religion than one who submits his face (himself) to Allah (i.e. follows Allah's Religion of Islamic Monotheism); and he is a Muhsin (a good-doer - see V. 2:112). And follows the religion of Ibrahim (Abraham) Hanifa (Islamic Monotheism - to worship none but Allah Alone). And Allah did take Ibrahim (Abraham) as a Khalil (an intimate friend).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is better in religion than he who submits his face to Allah, being a gooddoer, and follows the Creed of Abraham, pure in faith? Allah took Abraham for a close friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is better in religion than he who submits himself wholly to God, and is a doer of good, and follows the faith of Abraham the Monotheist? God has chosen Abraham for a friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is better in religion than one who submits himself to Allah while being a doer of good and follows the religion of Abraham, inclining toward truth? And Allah took Abraham as an intimate friend.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:125] And who, that is, [and] none, is fairer in religion than he who submits his purpose, that is, [than he who] is compliant and offers his deeds sincerely, to God and is virtuous, [and] declares God’s Oneness, and who follows the creed of Abraham, the one that is in accordance with the creed of Islam, as a hanīf? (hanīfan is a circumstantial qualifier), that is to say, [one] inclining away from all religions to the upright religion. And God took Abraham for a close friend, as His elect, one whose love for Him is pure.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who is better in religion) who is firmer in religion and better in speech (than he who surrendereth his purpose to Allah) than him whose Religion and works are sincerely devoted to Allah (while doing good (to men)) good in deed and speech (and follows the tradition of Abraham, the upright) who surrendered completely to Allah? (Allah (Himself) chose Abraham for friend).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَنْ أَحْسَنُ دِيناً } وأقوم سبيلاً { مِمَّنْ أَسْلَمَ } أي: أسلم { وَجْهَهُ } المفاض له من الله { لله } المفيض لوجوه الأشياء الموجودة { وَهُوَ } في حالة التسليم { مُحْسِنٌ } مع الله مستغرق بمطالعة جماله { واتَّبَعَ مِلَّةَ إِبْرَٰهِيمَ } التي هي أقوم الملل وأحسنها\n إذ هو { حَنِيفاً } مائلاً عن الأديان الباطلة\n والآراء الفاسدة مطلقاً { وَ } لذلك { ٱتَّخَذَ ٱللَّهُ } المطلع لضمائر عباده { إِبْرَاهِيمَ خَلِيلاً } [النساء: 125] كأنه تخلل فيه إلى حيث صار سمعه وبصره ويده ورجله على ما نطق به الحديث القدسي\n\n\nولا يظن أنه تخلل فيه على وجه الحلول والاتحاد\n بل على التوحيدج الصرف الخالي عن الكثرة مطلقاً\n إذ { وَللَّهِ } الواحد الأحد الصمد\n الذي\n[الإخلاص: 3-4] جميع { مَا } ظهر { فِي ٱلسَّمَٰوَٰتِ } أي: العلويات { وَمَا } ظهر { فِي ٱلأَرْضِ } أي: السفليات\n إذ كل ما ظهر وما بطن فمنه بدأ وإلأيه يعود { وَكَانَ ٱللَّهُ } االمتجلي في الآفاق والأنفس { بِكُلِّ شَيْءٍ } من مظاهره { مُّحِيطاً } [النساء: 126] لا كإحاطة الظرفية بمظروفه\n بل كإحاطة الشمس بالأضواء والأضلال\n وإحاطة الروح بالجسم\n\n\nأذقنا بلطفك حلاوة توحيدك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n حال من { إبراهيم } لأنه جزء ما أضيف إليه\n يقول الحقّ جلّ جلاله: { ومن يعمل } شيئاً { من } الأعمال { الصالحات } وهو المهم من المكلف به\n إذ لا طاقة للبشر على الإتيان بكلها\n حال كون العامل { من ذكر أو أنثى } إذ النساء شقائق الرجال في طلب الأعمال\n والحالة أن العامل { مؤمن } لأن الإيمان شرط في قبول الأعمال\n فلا ثواب على عمل ليس معه إيمان\n ثم ذكر الجواب فقال { فأولئك يدخلون الجنة } أي: يتصفون بالدخول\n أو يدخلهم الله الجنة\n { ولا يُظلمون } أي: لا ينقصون من ثواب أعماله { نقيرًا } أي: مقداره\n وهو النقرة في ظهر النواة\n قال البيضاوي: وإذا لم ينقص ثواب المطيع فبالأخرى ألا يزيد في عقاب العاصي\n لأن المجازي أرحَمُ الراحمين\n هـ\n { ومَن أحسن دينًا ممّن أسلم وجهه لله } أي: لا أحد أحسن دينًا ممن انقاد بكليته إلى مولاه { وهو محسن } أي: مُوَحَّدٌ أحسَنَ فيما بينه وبين الله\n وفيما بينه وبين عباد الله\n { واتبع ملة إبراهيم حنيفًا } بأن دخل في الدين المحمدي الذي هو موافق لملة إبراهيم بل هو عينه\n فمن ادعى أنه على ملة إبراهيم ولم يدخل فيه فقد كذب\n ثم ذكر ما يحث على اتباع ملته\n فقال: { واتخذ الله إبراهيم خليلاً } أي: اصطفاه وخصه بكرامة تشبه كرامة الخليل عند خليله\n وإنما أعاد ذكره ولم يضمر تفخيمًا له وتنصيصًا على أنه الممدوح\n وسمي خليلاً لأنه قد تخللت محبة الله في جميع أجزائه\n رُوِي أن إبراهيم عليه السلام كان يضيف الناس\n حتى كان يسمى أبا الضيفان\n وكان منزله على ظهر الطريق\n فأصاب الناسَ سَنَةٌ\n جهدوا فيها\n فحشد الناسُ إلى باب إبراهيم\n يطلبون الطعامَ\n وكانت الميرة كل سنة تصله من صديق له بمصر\n فبعث غلمانه بالإبل إلى الخليل الذي له بمصر يسأله الميرة\n فقال لغلمانه: لو كان إبراهيم يريد لنفسه احتملت له ذلك\n ولكنه يريد للأضياف\n وقد أصابنا ما أصاب الناس\n فرجع الرسل إليه\n ومرّوا ببطحاء لينة\n فملؤوا منها الغرائر حياء من الناس\n وأتوا إبراهيم فأخبروه\n فاهتم إبراهيم لمكان الناس ببابه\n فنام\n وكانت سارة نائمة فاستيقظت\n وقالت: سبحان الله! أما جاء الغلمان؟ فقالوا: بلى\n فقامت إلى الغرائر فإذا فيها الحُوَّرَى ـ أي: الخالص من الدقيق ـ فخبزوا وأطعموا؟ فاستيقظ إبراهيم\n وشم رائحة الخبز\n فقال: يا سارة\n من أين هذا؟ فقالت: من عند خليلك المصري\n فقال: هذا من عند خليلي الله ـ عز وجل\n فحينئذ سماه الله خليلاً\n قال الزجاج: ومعنى الخليل: الذي ليس في محبته خَلَ\n أو لأنه ردَّ خلَته\n أي: فقره إلى الله مخلصًا\n\nهـ\n { ولله ما في السماوات وما في الأرض } ملكًا وخلقًا وعبيدًا\n فالملك له\n والعبيد عبيده\n يختار ما يشاء كما يشاء من خلة ومحبة وخدمة\n { وكان الله بكل شيء محيطًا } علمًا وقدرة\n فيجازِي كُلاًّ على قدر سعيه وقصده\n والله تعالى أعلم\n الإشارة: على قدر المجاهدة والمكابدة تكون المعاينة والمشاهدة\n على قدر البدايات تكون النهايات\n من أشرقت بدايته أشرقت نهايته\n والجزاء على العمل يكون على قدر الهمم\n فمن عمل لجنة الزخارف مُتع بها\n ومن عمل لجنة المعارف تنعم بها\n\n[الكهف:49]\n فمن انقاد إلى الله بكلتية إلى مولاه فلا أحد أحسن منه عند الله\n ومن تمسك بالملة الحنيفية\n وهي الانقطاع إلى الله بالكلية ـ فقد استمسك بالعروة الوثقى\n وكان في أعلى ذروة أهل التقى\n من تخلق بخلق الحبيب كان أقرب إلى الله من كل قريب\n وبالله التوفيق\n وهو الهادي إلى سواء الطريق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:95",
      "similarity": 0.7114358108210318
    },
    {
      "verse": "16:123",
      "similarity": 0.6921896600862438
    },
    {
      "verse": "6:161",
      "similarity": 0.6902121413019142
    },
    {
      "verse": "2:135",
      "similarity": 0.6245367995129433
    },
    {
      "verse": "10:105",
      "similarity": 0.5276238846466034
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/4:125.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/4:125.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:125.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}