{
  "chapter": "النساء",
  "text": "من كان يريد ثواب الدنيا فعند الله ثواب الدنيا والءاخرة وكان الله سميعۢا بصيرا",
  "translations": [
    {
      "translation": "If anyone desires the reward of this world, the reward of both this world and the Next World is with Allah. Allah is All-Hearing, All-Seeing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever desires a reward of this world (should remember) that with God are rewards of this world and the next; and God hears all and sees everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who desires the reward of this world, let him know that with Allah is the reward of this world and also of the World to Come. Allah is All-Hearing, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be it known to those who want worldly rewards that God holds the rewards for this life as well as the life to come. God is All-hearing and All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires the reward of this world, then with Allah only lie both – the rewards of this world and of the Hereafter; and Allah is All Hearing, All Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires the rewards of this life, then with Allah is the reward of this worldly life and of the Hereafter. And Allah is Ever All-Hearer, All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires the reward of this world, then with Allah is the reward of this world and the hereafter; and Allah is Hearing, Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso desires the reward of this world, with God is the reward of this world and of the world to come; God is All-hearing, All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso desireth the reward of the world, (let him know that) with Allah is the reward of the world and the Hereafter. Allah is ever Hearer, Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If one desires the rewards of this world [let him remember that] with God are the rewards of [both] this world and the life to come: and God is indeed all hearing, all seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever seeketh the reward of this world, with Allah is the reward of this world and of the Hereafter; and Allah is ever Hearing, Beholding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires the reward of this world, [should know that] with Allah is the reward of this world and the Hereafter, and Allah is all-hearing, all-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any one desires a reward in this life, in Allah's (gift) is the reward (both) of this life and of the hereafter: for Allah is He that heareth and seeth (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires a reward in this life of the world, then with Allah (Alone and none else) is the reward of this worldly life and of the Hereafter. And Allah is Ever All-Hearer, All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever desires the reward of the world, with Allah is the reward of the world and of the Everlasting Life. Allah is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires the reward of this world—with God is the reward of this world and the next. God is All-Hearing, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever desires the reward of this world - then with Allah is the reward of this world and the Hereafter. And ever is Allah Hearing and Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:134] Whoever desires, by his deeds, the reward of this world, then God has the reward of this world and of the Hereafter, for the one who wants it, and no one else has it, so why do any of you demand the lower [reward]? Why do you not seek the higher one, by devoting yourself sincerely to Him, since what [reward]   he seeks can only be found with Him; God is ever Hearer, Seer.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whoso desireth the reward of the world) whoever desires worldly benefit for the works that Allah has obligated upon him, ((let him know that) with Allah is the reward of the world) let him do works for the reward of this world (and the Hereafter) are in Allah's hands. (Allah is ever Hearer) of what you say, (Seer) of your works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ من كان يريد ثَواب الدنيا } بالوقوف مع هوى النفس فما له يطلب أخسّ الأشياء ويقف في أدنى المراتب { فعند الله ثواب } الدارين جميعاً\n بالفناء فيه لأنه الوجود المحيط بالكلّ فلا يفوته شيء { وكان الله سميعاً } بأحاديث نفوسكم { بَصيراً } بنياتكم وإرادتكم بأعمالكم { يا أيها الذين آمنُوا } بالتوحيد العلميّ وإرادة ثواب الدارين { كونُوا } ثابتين في مقام العدالة التي هي أشرف الفضائل { قوامين } بحقوقها بحيث تكون ملكة راسخة فيكم لا يمكن معها صدور جور وميل منكم في شيء\n ولا ظهور صفة نفس لاتباع هوى في جذب نفع دنيوي أو دفع مضرّة\n { يا أيها الذين آمنُوا } بالإيمان التقليديّ { آمِنُوا } بالإيمان التحقيقيّ أو آمنوا بالإيمان العلمي\n أو آمنوا بالإيمان العينيّ\n { إن الذين آمنُوا ثم كفَرُوا } إلى آخره\n أي: تحيروا وتردّدوا بين جهتي الربوبية العلوية والسفلية لشدّة النفاق وغلبة نور الفطرة تارة واستيلاء ظلمة النفس والهوى أخرى\n لاستواء الحالتين فيهم حتى استحكمت الهيئات المظلمة وازدادت الحجب ورسخت العقائد الفاسدة والملكات الكاسدة باستيلاء صفات النفس واستعلائها مطلقاً فرانت على قلوبهم { ما كان الله ليَغْفر لَهم } لمكان الرين الحاجب وفساد جوهر القلب وزوال الاستعداد { ولا ليهديهم سَبيلاً } إلى الحق ولا إلى الكمال ولا إلى الفطرة الأصلية لعدم قبولهم الهداية وصرف عذابهم بالإيلام لمكان استعدادهم في الأصل\n { الذين يتخذون الكافرين أولياء } لمناسبتهم إياهم في الاحتجاب { من دون المُؤْمنين } لعدم الجنسية { أيَبتَغون } التعزز بهم في الدنيا والتقوّي بمالهم وجاههم فلا سبيل إلى ذلك\n وهم قد أخطأوا لأن العزة كلها صفة من صفات الله تعالى منيع القوى والقدر\n له قوة القهر والغلبة للكل فبقدر القرب منه وقبول نوره وقوّته والاتصاف بصفاته تحصل العزة فهي بأهل الإيمان أولى وأهل الحجاب والكفر بالزلة أولى { قاموا كسالى } لعدم شوقهم إلى الحضور ونفورهم عنه لظلمة استعدادهم باستيلاء الهوى",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مَّن كَانَ يُرِيدُ } بالجهاد والقتال وجميع الأعمال المأمورة من عند الله { ثَوَابَ ٱلدُّنْيَا } وما يصل إليها فيها من الغنيمة والرئاسة والتفوق على الأقران\n وعلو المرتبة بين الأنام { فَعِندَ ٱللَّهِ ثَوَابُ ٱلدُّنْيَا } إنجاحاً لمطلوبه { وَٱلآخِرَةِ } تفضلاً وامتناناً { وَكَانَ ٱللَّهُ } المطلع لسرائر عباده { سَمِيعاً } لمناجاتهم { بَصِيراً } [النساء: 134] بحاجاتهم\n يوصلهم إلى غاية متمناهم مع زيادة إنعام وإفضال من عنده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { من }: شرطية، وجوابها محذوف دل عليه الكلام، أي: من كان يريد ثواب الدنيا فيلطلبه منه، فعند الله ثواب الدنيا والآخرة، أو من كان يريد ثواب الدنيا فلا يقتصر عليه خاصة، عند الله ثواب الدنيا والآخرة. يقول الحقّ جلّ جلاله: { من كان يريد ثواب الدينا } والتوسع فيها، فليطلبه منا فعند الله ثواب الدارين، أو من كان يريد ثواب الدنيا، فليطلب مع ذلك ثوابَ الآخرة أيضًا، وليقل:\n[البَقَرَة:201] { فعند الله ثواب الدنيا والآخرة } ، فيعطيهما معًا لمن طلبهما، والثاني أنهض من الأول، وأكملُ منهما من أعرض عنهما وطلب مولاه، { وكان الله سميعًا بصيرًا } ، لا يخفى عليه مقاصد خلقه، فيعطي كُلاًّ على حسب قصده. الإشارة: المهم ثلاثة: همة دنية تعلقت بالدنيا الدنية، وهمة متوسطة تعلقت بنعيم الآخرة، وهمة عاليه تعلقت بالكبير المتعال. والله تعالى يرزق العبد على قدر همته، وبالهمم ترفع المقادير أو تسقط، فمن كانت همته دنية كان دَنيًا خسيسًا، ومن كانت همته متوسطة كان قدره متوسطًا، رحل من كون إلى كون، كحمار الرحا، يسير، والذي ارتحل منه هو الذي عاد إليه، ومن كانت همته عالية كان عالي المقدار، كبير الشأن حاز الكونين بما فيهما، وزاد مشاهدة خالقهما، جعلنا الله منهم بمنِّه وكرمه.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:148",
      "similarity": 0.7047329336879279
    },
    {
      "verse": "2:103",
      "similarity": 0.6539669258525657
    },
    {
      "verse": "83:36",
      "similarity": 0.5811885908566697
    },
    {
      "verse": "3:145",
      "similarity": 0.5593899017004141
    },
    {
      "verse": "74:4",
      "similarity": 0.5266795675896847
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/4:134.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/4:134.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/4:134.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}