{
  "chapter": "النساء",
  "text": "تلك حدود الله ومن يطع الله ورسوله يدخله جنت تجرى من تحتها الانهر خلدين فيها وذلك الفوز العظيم",
  "translations": [
    {
      "translation": "These are Allah's limits. As for those who obey Allah and His Messenger, We will admit them into Gardens with rivers flowing under them, remaining in them timelessly, for ever. That is the Great Victory.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the limits set by God, and those who follow the commandments of God and the Prophet, will indeed be admitted to gardens with streams of water running by, where they will for ever abide; and this will be success supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the bounds set by Allah. Allah will make the man who obeys Allah and His Messenger enter the Gardens beneath which rivers flow. He will abide there for ever. That is the mighty triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the laws of God. Whoever obeys God and His Messenger will be admitted to the gardens wherein streams flow and wherein they will live forever. This is the greatest triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the limits of Allah; and whoever obeys Allah and His Noble Messenger – Allah will admit him into Gardens beneath which rivers flow – abiding in it forever; and this is the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the limits (set by) Allah, and whosoever obeys Allah and His Messenger, will be admitted to Gardens under which rivers flow (in Paradise), to abide therein, and is the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are Allah's limits, and whoever obeys Allah and His Apostle, He will cause him to enter gardens beneath which rivers flow, to abide in them; and this is the great achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are God's bounds. Whoso obeys God and His Messenger, He will admit him to gardens underneath which rivers flow, therein dwelling forever; that is the mighty triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the limits (imposed by) Allah. Whoso obeyeth Allah and His messenger, He will make him enter Gardens underneath which rivers flow, where such will dwell for ever. That will be the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the limits set by God. Anyone who obeys God and His Messenger will be admitted to Gardens through which rivers flow, to live there forever. That will be the supreme achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the statutes of Allah, and whosoever obeyeth Allah and His apostle, him He shall cause to enter the Gardens whereunder rivers flow, as abiders therein; and that is an achievement mighty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are Allah’s bounds, and whoever obeys Allah and His Apostle, He shall admit him to gardens with streams running in them, to remain in them [forever]. That is the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are limits set by Allah: those who obey Allah and His Messenger will be admitted to Gardens with rivers flowing beneath, to abide therein (for ever) and that will be the supreme achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the limits (set by) Allah (or ordainments as regards laws of inheritance), and whosoever obeys Allah and His Messenger (Muhammad SAW) will be admitted to Gardens under which rivers flow (in Paradise), to abide therein, and that will be the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such are the Bounds of Allah. He who obeys Allah and His Messenger, He will admit him to Gardens underneath which rivers flow. That is a great wining.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the bounds set by God. Whoever obeys God and His Messenger, He will admit him into Gardens beneath which rivers flow, to abide therein forever. That is the great attainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the limits [set by] Allah, and whoever obeys Allah and His Messenger will be admitted by Him to gardens [in Paradise] under which rivers flow, abiding eternally therein; and that is the great attainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:13] Those, rulings mentioned with respect to orphans and what followed, are God’s bounds, His laws, which He has delimited for His servants, so that they may act in accordance with them and not infringe them. Whoever obeys God and His Messenger, in what He has ruled, He will admit him (yudkhilhu, or, as a shift [to the first person plural] read nudkhilhu, ‘We will admit him’) to Gardens underneath which rivers flow, abiding therein; that is the great triumph.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(These are the limits (imposed by) Allah) these are the legal rulings and obligations imposed by Allah. (Whoso obeyeth Allah and His messenger) regarding the division of estates, (He will make him enter Gardens beneath which) beneath its habitations and trees (rivers) rivers of wine, water, honey and milk (flow, where such will dwell for ever) dwelling forever in Paradise, never to die or leave it. (That will be the great success) the greatest salvation through entering Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تِلْكَ حُدُودُ ٱللَّهِ } معناهُ فَرَائِضُ الله\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تِلْكَ } المذكورات من الأمور المتعلقة بأحوال الأموات { حُدُودُ ٱللَّهِ } الموضوعة بينكم أيها المؤمنون بالله ورسوله { وَمَن يُطِعِ ٱللَّهَ } في امتثال أوامره واجتناب نواهيه { وَرَسُولَهُ } في جميع ما جاء به من عند ربه من الأمور المتعلقة؛ لتهذيب الظاهر والباطن من الكدورات البشرية والعلائق الدينية { يُدْخِلْهُ } الله بفضله ولطفه { جَنَّاتٍ } منتزهات التوحيد وهي اليقين العلمي والعيني والحقي { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } أنهار المعارف الجزئية من عالم الغيب إلى عالم الشهادة، وهم لا يتحولون عنها، بل صاروا { خَالِدِينَ فِيهَا } أبداً { وَذٰلِكَ } أي: الخلود فيها، هو { ٱلْفَوْزُ ٱلْعَظِيمُ } [النساء: 13] والفضل الكريم، طوبى لمن فاز من الله بالفوز العظيم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "48:5",
      "similarity": 0.750606291230718
    },
    {
      "verse": "9:89",
      "similarity": 0.7102767490399038
    },
    {
      "verse": "85:11",
      "similarity": 0.6225864947378361
    },
    {
      "verse": "57:12",
      "similarity": 0.5868749257544067
    },
    {
      "verse": "5:119",
      "similarity": 0.5862716456304806
    }
  ]
}