{
  "chapter": "النساء",
  "text": "يايها الذين ءامنوا۟ ءامنوا۟ بالله ورسوله والكتب الذى نزل على رسوله والكتب الذى انزل من قبل ومن يكفر بالله وملئكته وكتبه ورسله واليوم الءاخر فقد ضل ضللۢا بعيدا",
  "translations": [
    {
      "translation": "You who have iman! have iman in Allah and His Messenger and in the Book He sent down to His and His Messengers and the Last Day has gone very far astray.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, believe in God and His Messenger and the Book He has revealed to His Apostle, and the Books revealed before. But he who believes not in God and His angels and the Books and the prophets and the Last Day, has wandered far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Believe in Allah and His Messenger and in the Book He has revealed to His Messenger, and in the Book He revealed before. And whoever disbelieves in Allah, in His angels, in His Books, in His Messengers and in the Last Day, has indeed strayed far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, have faith in God and His Messenger, the Book which is revealed to him, and the Bible which has been revealed before. Whoever refuses to believe in God, His angels, Books, Messengers and the Day of Judgment, has gone far away from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Have faith in Allah and His Noble Messenger and the Book He has sent down upon this Noble Messenger of His, and the Book He sent down before; and whoever does not accept faith in Allah and His angels and His Books and His Noble Messengers and the Last Day, has undoubtedly wandered far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Believe in Allah, and His Messenger, and the Book (the Qur'an) which He has sent down to His Messenger, and the Scripture which He sent down to those before; and whosoever disbelieves in Allah, His Angels, His Books, His Messengers, and the Last Day, then indeed he has strayed far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! believe in Allah and His Apostle and the Book which He has revealed to His Apostle and the Book which He revealed before; and whoever disbelieves in Allah and His angels and His apostles and the last day, he indeed strays off into a remote error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, believe in God and His Messenger and the Book He has sent down on His Messenger and the Book which He sent down before. Whoso disbelieves in God and His angels and His Books, and His Messengers, and the Last Day, has surely gone astray into far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Believe in Allah and His messenger and the Scripture which He hath revealed unto His messenger, and the Scripture which He revealed aforetime. Whoso disbelieveth in Allah and His angels and His scriptures and His messengers and the Last Day, he verily hath wandered far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, believe in God and His Messenger and in the Scripture He sent down to His Messenger, as well as what He sent down before. He who denies God, His angels, His Scriptures, His messengers and the Last Day has surely gone far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe believe in Allah's and His apostle and the Book He hath sent down unto His apostle and the Book He sent down aforetime; and whosoever disbelieveth in Allah and His angels and His Books and His Apostles and the Last Day, hath surely strayed away a far straying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Have faith in Allah and His Apostle and the Book that He has sent down to His Apostle and the Book He had sent down earlier. Whoever disbelieves in Allah and His angels, His Books and His apostles and the Last Day, has certainly strayed into far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Believe in Allah and His Messenger, and the scripture which He hath sent to His Messenger and the scripture which He sent to those before (him). Any who denieth Allah, His angels, His Books, His Messengers, and the Day of Judgment, hath gone far, far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Believe in Allah, and His Messenger (Muhammad SAW), and the Book (the Quran) which He has sent down to His Messenger, and the Scripture which He sent down to those before (him), and whosoever disbelieves in Allah, His Angels, His Books, His Messengers, and the Last Day, then indeed he has strayed far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, believe in Allah and His Messenger (Muhammad), in the Book He has sent down to His Messenger, and in the Book He sent down before. Whosoever disbelieves in Allah, His angels, His Books, His Messengers, and the Last Day, has surely gone astray into far error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Believe in God and His messenger, and the Book He sent down to His messenger, and the Book He sent down before. Whoever rejects God, His angels, His Books, His messengers, and the Last Day, has strayed far in error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, believe in Allah and His Messenger and the Book that He sent down upon His Messenger and the Scripture which He sent down before. And whoever disbelieves in Allah, His angels, His books, His messengers, and the Last Day has certainly gone far astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:136] O you who believe, believe, with perseverance, in God and His Messenger and the Book which has been revealed to His Messenger, Muhammad (s), and that is the Qur’ān; and the Book which was revealed before, to the messengers, namely, the scriptures (a variant reading [for nuzzila and unzila, ‘was revealed’] has the active form for both verbs [nazzala and anzala, ‘He revealed’]). And whoever disbelieves in God and His angels and His Books, and His messengers, and the Last Day, verily he has strayed far away, from the truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe) you who believed on the day of the covenant and disbelieved thereafter! (Believe) now (in Allah and His messenger) it is also said that Allah called them by the name of their forefathers who had believed in the past. This verse was revealed regarding 'Abdullah Ibn Salam, Asad and Usayd the sons of Ka'b, Tha'labah Ibn Qays and Salam and Salamah, the nephews of 'Abdullah Ibn Salam, and Yamin Ibn Yamin. These were the believers from among the people of the Torah. It was said about them: you who believe in Moses and the Torah, believe in Allah and His Messenger Muhammad (and the Scripture which He hath revealed unto His messenger) Muhammad, i.e. the Qur'an, (and the Scripture which He revealed aforetime) before Muhammad and the Qur'an upon all past prophets. (Whoso disbelieveth in Allah and His angels and His scriptures and His messengers and the Last Day) resurrection after death, (he verily hath wandered far astray.) When this verse was revealed all the people mentioned above embraced Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَٰأَيُّهَا ٱلَّذِينَ ءَامَنُواْ } أي: الذين يدعون الإيمان، ويجرون كلمة التوحيد على اللسان على وجه التقليد والحسبان، وينكرون طريق أهل التوحيد والعرفان، ونسبون أهله إلى الإيمان والطغيان { ءَامِنُواْ } أيقنوا وأذعنوا { بِٱللَّهِ } المتفرد في ذاته المتوحد في أسمائه وصفاته حتى عوينوا، وكوشفوا بتوحيده { وَرَسُولِهِ } أي: خليفته المصورة بصورته المبعوث على كافة بريته، الجامع لجميع مراتب أوصافه وأسمائه { وَٱلْكِتَٰبِ } المبين لطريق توحيده { ٱلَّذِي نَزَّلَ } من فضله ولطفه { عَلَىٰ رَسُولِهِ } المظهر لتوحيده الذاتي { وَ } جميع { ٱلْكِتَٰبِ ٱلَّذِيۤ أَنزَلَ } من عنده { مِن قَبْلُ } على الرسل الماضين المبعوثين على الأمم الماضية، الظاهرين بتوحيد صفاته وأفعاله { وَمَن يَكْفُرْ بِٱللَّهِ } الأحد الصمد باعتقاد الوجود لغير الله من الأظلال والعكوس { وَمَلآئِكَتِهِ } أوصافه وأسمائه المنتشئة من شئونه وصنوف كمالاته { وَكُتُبِهِ } المنتخبة من شئونه وتصوراته وتنوزلاته على هيئة الصوت الحرف؛ ليبين بها طريق التوحيد على التائهين في بيدان الغفلة، المنهمكين في بحر الضلال { وَرُسُلِهِ } المكاشفين بمقاصد كتبه، المتحققين المتصفين على جميع ما أمر ونهى فيها المأمورين بتبليغها والإرشاد إلى مقاصدها { وَٱلْيَوْمِ ٱلآخِرِ } المعد لجزاء من يتنبه ويتفطن من إنزال الكتب وإرسال الرسل، ومن لم يتنبه ولم يتفطن؛ إذ الحكمة تقتضي التفضل والترحم على من تنبه إلى طريق الحق بعد ورود المنبه والمبين، والانتقام على من لم يتنبه ولم يؤمن، بل ينكر ويكفر، ومن يكفر { فَقَدْ ضَلَّ } عن طريق التوحيد { ضَلاَلاً بَعِيداً } [النساء: 136] إلى حيث لا يتمنى هدايته وفلاحه\n\n\n\n\nمن يضلل الله فلا هادي له، نعوذ بك منك يا أرحم الراحمين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: مخاطبًا من أسلم من اليهود ـ وهو عبدالله بن سَلاَم وأسَد وأسيد ابنا كَعبٍ، وثَعلبة بن قَيسٍ، وسلاَّم ابن أخت عبدالله بن سلام، وسلمة ابن أخية ويامين ـ قالوا يا رسول الله، نؤمن بك وبكتابك وبموسى والتوراة وعُزَّير، ونكفُرُ بما سِوَاهُ من الكُتب؟ فقال النبي صلى الله عليه وسلم\n\n \" آمِنُوا بالله ورسوله محمد صلى الله عليه وسلم وبكتابه القرآن، وبكل كتاب قبله \" \n",
      "translations": []
    }
  ]
}