{
  "chapter": "النساء",
  "text": "يايها الذين ءامنوا۟ كونوا۟ قومين بالقسط شهداء لله ولو على انفسكم او الولدين والاقربين ان يكن غنيا او فقيرا فالله اولى بهما فلا تتبعوا۟ الهوى ان تعدلوا۟ وان تلوا۟ او تعرضوا۟ فان الله كان بما تعملون خبيرا",
  "translations": [
    {
      "translation": "You who have iman! be upholders of justice, bearing witness for Allah alone, even against yourselves or your parents and relatives. Whether they are rich or poor, Allah is well able to look after them. Do not follow your own desires and deviate from the truth. If you twist or turn away, Allah is aware of what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, be custodians of justice (and) witnesses for God, even though against yourselves or your parents or your relatives. Whether a man be rich or poor, God is his greater well-wisher than you. So follow not the behests of lust lest you swerve from justice; and if you prevaricate or avoid (giving evidence), God is cognisant of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Be upholders of justice, and bearers of witness to truth for the sake of Allah, even though it may either be against yourselves or against your parents and kinsmen, or the rich or the poor: for Allah is more concerned with their well-being than you are. Do not, then, follow your own desires lest you keep away from justice. If you twist or turn away from (the truth), know that Allah is well aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, be the supporters of justice and the testify to what you may have witnessed, for the sake of God, even against yourselves, parents, and relatives; whether it be against the rich or the poor. God must be given preference over them. Let not your desires cause you to commit injustice. If you deviate from the truth in your testimony, or decline to give your testimony at all, know that God is Well Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Be firm in establishing justice, giving witness for Allah, even if it is harmful to yourselves or parents or relatives; whether the one you testify against is wealthy or poor, for in any case Allah has the greater right over it; then do not follow your wishes for you may stray from the truth; and if you distort testimony or turn away, then Allah is Well Aware of your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Stand out firmly for justice, as witnesses to Allah, even though it be against yourselves, or your parents, or your kin, be he rich or poor, Allah is a better Protector to both. So follow not the lusts, lest you may avoid justice; and if you Talwu or Tu`ridu, it, verily, Allah is Ever Well-Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! be maintainers of justice, bearers of witness of Allah's sake, though it may be against your own selves or (your) parents or near relatives; if he be rich or poor, Allah is nearer to them both in compassion; therefore do not follow (your) low desires, lest you deviate; and if you swerve or turn aside, then surely Allah is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, be you securers of justice, witnesses for God, even though it be against yourselves, or your parents and kinsmen, whether the man be rich or poor; God stands closest to either. Then follow not caprice, so as to swerve; for if you twist or turn, God is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Be ye staunch in justice, witnesses for Allah, even though it be against yourselves or (your) parents or (your) kindred, whether (the case be of) a rich man or a poor man, for Allah is nearer unto both (them ye are). So follow not passion lest ye lapse (from truth) and if ye lapse or fall away, then lo! Allah is ever Informed of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, be strict in upholding justice and bear witness for the sake of God, even though it be against yourselves, your parents, or your kindred. Be they rich or poor, God knows better about them both. Do not, then, follow your own desires, lest you swerve from justice. If you conceal the truth or evade it, then remember that God is well aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! be ye maintainers of justice, bearers of testimony for Allah's sake, though it be against yourselves or your parents or kindred. Be he rich or poor, Allah is nigher unto either wherefore follow not the passion, lest ye deviate. If ye incline or turn away, then verily of that which ye work Allah is ever Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Be maintainers of justice and witnesses for the sake of Allah, even if it should be against yourselves or [your] parents and near relatives, and whether it be [someone] rich or poor, for Allah has a greater right over them. So do not follow [your] desires, lest you should be unfair, and if you distort [the testimony] or disregard [it], Allah is indeed well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! stand out firmly for justice, as witnesses to Allah, even as against yourselves, or your parents, or your kin, and whether it be (against) rich or poor: for Allah can best protect both. Follow not the lusts (of your hearts), lest ye swerve, and if ye distort (justice) or decline to do justice, verily Allah is well-acquainted with all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Stand out firmly for justice, as witnesses to Allah, even though it be against yourselves, or your parents, or your kin, be he rich or poor, Allah is a Better Protector to both (than you). So follow not the lusts (of your hearts), lest you may avoid justice, and if you distort your witness or refuse to give it, verily, Allah is Ever Well-Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, be maintainers of justice and witnesses for Allah, even though it is against yourselves, your parents, or your kinsmen, whether he is rich or poor, Allah has more rights over both of them. So do not follow desires, so that you are (not) just. If you twist or turn, Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Stand firmly for justice, as witnesses to God, even if against yourselves, or your parents, or your relatives. Whether one is rich or poor, God takes care of both. So do not follow your desires, lest you swerve. If you deviate, or turn away—then God is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, be persistently standing firm in justice, witnesses for Allah, even if it be against yourselves or parents and relatives. Whether one is rich or poor, Allah is more worthy of both. So follow not [personal] inclination, lest you not be just. And if you distort [your testimony] or refuse [to give it], then indeed Allah is ever, with what you do, Acquainted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:135] O you who believe, be upright in justice; witnesses, of the truth, for God, even though it, the witnessing, be against yourselves, so be witness against them [your selves] by affirming the truth and not concealing it; or, against, parents and kinsmen, whether the person, witnessed against, be rich or poor; God is closer to the two, than you and He has better knowledge of what is good for them. So do not follow any whim, in your testimonies by being partial to the rich one, seeking his pleasure, or [by being partial] to the poor one out of compassion for him, lest you swerve, so that you do not incline away from the truth, for if you twist (a variant reading [for talwūw] has talū) [if] you distort your testimony, or refrain, from giving it, surely God is ever aware of what you do, and will requite you accordingly.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe! Be ye staunch in justice, witnesses for Allah, even though it be against yourselves or (your) parents or (your) kindred, whether (the case be of) rich or poor) parents, (for Allah is nearer unto both (than ye are)) Allah has better right to protect them than you do. (So follow not passion lest ye lapse) lest you are not just in testimony (and if you lapse) if you stammer (or fall away) or do not testify in front of judges, (then lo! Allah is ever Informed of what ye do) whether you testify or withhold your testimony. This verse was revealed regarding Miqyas Ibn Sababah who had something to testify against his father.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِن تَلْوُواْ } معناهُ تَمْطِلُوا\n\n",
      "translations": [
        {
          "translation": " And if you {stay} , that means you are delaying",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَٰأَيُّهَا ٱلَّذِينَ آمَنُواْ كُونُواْ قَوَّٰمِينَ } مداومين مواظبين { بِٱلْقِسْطِ } بإقامة العدل والإنصاف بينكم\n وإن كنتم { شُهَدَآءَ } في الوقائع كونوا شهداء مخلصين { للَّهِ } في أدائها بلا ميل وزور وإخفاء { وَلَوْ } كنتم شاهدين { عَلَىۤ أَنْفُسِكُمْ } باعتراف ما على ذمتكم من حقوق الغير { أَوِ } ذمة { ٱلْوَٰلِدَيْنِ وَ } ذمم { ٱلأَقْرَبِينَ } فعليكم إيها الشهداء أن تقسطوا في أداء الشهادة بلا حيف وميل { إِن يَكُنْ } المشهود عليه\n أو المشهود له { غَنِيّاً أَوْ فَقِيراً } يعني: ليس لكم أن تراعوا جانب الفقير وتجانوبا عن الغني\n بل ما عليكم إلا أداء ما عندكم من الشهادة على وجهها { فَٱللَّهُ أَوْلَىٰ بِهِمَا } برعايتهما وإصلاحهما { فَلاَ تَتَّبِعُواْ ٱلْهَوَىٰ } أي: ما تهوى نفوسكم\n وتميل قلوبكم إليه إن أردتم { أَن تَعْدِلُواْ } في أداء الشهادة { وَإِن تَلْوُواْ } تغيروا وتحرفوا ألسنتكم عما ثبت وتحقق عندكم { أَوْ تُعْرِضُواْ } عن أدائها مطلقاً\n ألجموا بلجاممم من نار على ما نطق به الحديث\n صلوات الله على قائله { فَإِنَّ ٱللَّهَ } المجازي لعباده { كَانَ بِمَا تَعْمَلُونَ } من تغيركم وإعراضكم { خَبِيراً } [النساء: 135] يجازيكم على مقتضى خبرتهز\n\n{ يَٰأَيُّهَا ٱلَّذِينَ ءَامَنُواْ } أي: الذين يدعون الإيمان\n ويجرون كلمة التوحيد على اللسان على وجه التقليد والحسبان\n وينكرون طريق أهل التوحيد والعرفان",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { شهداء }: خبر ثاني لكان، أو حال، { فالله أولى }: علة للجواب أي: إن يكن المشهود عليه غنيًا عليه فلا تمتنعوا من الشهادة عليه تعظيمًا له، وإن يكن فقيرًا فلا تمتنعوا من الشهادة عليه إشفاقًا عليه، فإن الله أولى بالغني والفقير منكم، والضمير في { بهما } راجع إلى ما دل عليه المذكور، وهو جنسًا الغني والفقير، لا إليه وإلا لوحّد لأن \" أو \" لأحد الشيئين. و { أن تعدلوا }: مفعول من أجله، ومن قرأ: تلوا ـ بضم اللام ـ فقد نقل ضم الواو إلى اللام وحذف الواوين، وقيل: من الولاية. يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا كونوا قوامين بالقسط } أي: مجتهدين في إقامة العدل مواظبين على الحكم به، وكونوا { شهداء لله بالحق } تقيمون شهادتكم لوجه الله، وابتغاء مرضاته، بلا طمع أجر ولا عرض، وهذا إن تعينت عليه، ولم يكن في تحملها مشقة، وإلا أُبيح له أجر تعبه، فأدوا شهاداتكم { ولو } كانت { على أنفسكم } بأن تقروا بالحق الذي عليها، لأن الشهادة بيان الحق، سواء كان عليها أو على غيرها، { أو } كانت الشهادة على { الوالدين والأقربين } ، فلا تمنعكم الشفقة والتعظيم من إقامة الشهادة عليهما، وأحرى غيرهما من الأجانب، { إن يكن } المشهود عليه { غنيًا أو فقيرًا } فلا تميلوا عن الشهادة بالحق عليهما، تعظيمًا للغني أو شفقة للفقير، فأن { الله أولى بهما } وبالنظر لهما، فلو لم تكن الشهادة عليهما صلاحًا لهما ما شرعها، { فلا تتبعوا الهوى } فتميلوا مع الغني أو الفقير، فقد نهيتكم إرادة { أن تعدلوا } في أحكامكم، فتكونوا عدولاً، أو كراهية أو تعدلوا عن الحق أي: تميلوا، { وإن تلووا } ألسنتكم عن شهادة الحق أو حكومة العدل { أو تعرضوا } عن أدائها فتكتموها { فإن الله كان بما تعملون خبيرًا } ، فيجازي الكاتم والمؤدي. قال صلى الله عليه وسلم عند نزولها:\n \" مَن كانَ يؤمنُ بالله واليوم الآخر فليُقِم شهادتَه على من كانت، ومن كان يؤمن بالله واليوم الآخر، فلا يَجحَد حَقًا هو عليه، وليؤُده عَفوّا، ولا يلجئه إلى السُلطان وخصوُمتِه، ليقتطع بها حقه، وأيما رجل خَاصَمَ إليَّ فقضَيتُ له على أخِيِه بحقٍ ليس له عليه، فلا يأخُذُه، فإنَما أقَطَعُ له قطعةً مِنَ النَارِ \". \nالإشارة: قد أمر الحق تعالى عباده بإقامة العدل في الأمور كلها، ونهى عن مراقبة الخلق في الأشياء كلها، فيتأكد على المريد ألاَّ يراقب أحدًا من الخلق وإنما يراقب الملك الحق، فيكون قويًا في الحق، يقيمه على نفسه وغيره، فلا تجتمع مراقة الحق مع مراقبة الخلق، من راقب الحق غاب عن الناس، ومن راقب الناس غاب عن الحق، وعاش مغمومًا من الخلق، ولله در القائل حيث قال:\nوكان شيخ شيخنا رضي الله عنه يقول  مراقبةُ الخلقِ عند أهل الظاهر شيءٌ كبير، وعدم المراقبة عند الباطن أمر كبير. فإقامة العدل على النفس ألاَّ يتركها تميل إلى الرخص والتأويلات، وإقامته على الوالدين تذكيرهما بالله ودلالتهما على الله بلطف ولين، وإقامته على الأقربين بنصحهم وإرشادهم إلى ما فيه صلاحهم، كانوا أغنياء أو فقراء، وإقامته على الأجانب كذلك. وبالله التوفيق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:78",
      "similarity": 0.5122225507954624
    },
    {
      "verse": "63:5",
      "similarity": 0.484948245853423
    },
    {
      "verse": "3:153",
      "similarity": 0.33334749452061524
    },
    {
      "verse": "35:15",
      "similarity": 0.29883559815388794
    },
    {
      "verse": "5:8",
      "similarity": 0.28779983196503994
    }
  ]
}