{
  "chapter": "النساء",
  "text": "ولله ما فى السموت وما فى الارض ولقد وصينا الذين اوتوا۟ الكتب من قبلكم واياكم ان اتقوا۟ الله وان تكفروا۟ فان لله ما فى السموت وما فى الارض وكان الله غنيا حميدا",
  "translations": [
    {
      "translation": "What is in the heavens and in the earth belongs to Allah. We have instructed those given the Book before you and you yourselves, to have taqwa of Allah, but if you are kafir, what is in the heavens and in the earth belongs to Allah. Allah is Rich Beyond Need, Praiseworthy.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and the earth belongs to God. We had commanded those who received the Book before you, and have commanded you too, to obey the laws of God. Even if you deny, surely all that is in the heavens and the earth belongs to God; and God is self-sufficient and praise-worthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and all that is in the earth belongs to Allah. We enjoined upon those who were given the Book before you, and also yourselves, to have fear of Allah. But if you disbelieve, then bear in mind that all that is in the heavens and all that is in the earth belongs to Allah. Allah is Self-Sufficient, Most Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs all that is in the heavens and the earth. We have told you and the People of the Book to have fear of God. If you all refuse to believe in Him, know that to God belongs all that is in the heavens and the earth. God is Self-sufficient and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah only belongs all whatever is in the heavens and all whatever is in the earth; and indeed We have commanded those who received the Books before you, and commanded you, that keep fearing Allah; and if you disbelieve, undoubtedly to Allah only belongs all whatever is in the heavens and all whatever is in the earth; and Allah is Independent, Worthy Of All Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs all that is in the heavens and all that is in the earth. And verily, We have recommended to the People of the Scripture before you, and to you that you have Taqwa of Allah. But if you disbelieve, then unto Allah belongs all that is in the heavens and all that is in the earth, and Allah is Ever Rich (free of any needs), Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever is in the heavens and whatever is in the earth is Allah's and certainly We enjoined those who were given the Book before you and (We enjoin) you too that you should be careful of (your duty to) Allah; and if you disbelieve, then surely whatever is in the heavens and whatever is in the earth is Allah's and Allah is Self-sufficient, Praise-worthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs all that is in the heavens and in the earth. We have charged those who were given the Book before you, and you, 'Fear God.' If you disbelieve, to God belongs all that is in the heavens and in the earth; God is All-sufficient, All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth. And We charged those who received the Scripture before you, and (We charge) you, that ye keep your duty toward Allah. And if ye disbelieve, lo! unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth, and Allah is ever Absolute, Owner of Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that the heavens and the earth contain belongs to God. We have commanded those who were given the Scripture before you, and We command you to fear God. If you deny Him, know that all that the heavens and the earth contain belongs to God. God is self-sufficient and praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah's is whatsoever is in the heavens and whatsoever is in the earth. And assuredly We enjoined those who were vouchsafed the Book before you and yourselves: fear Allah, and if ye disbelieve then Allah's is whatsoever is in the heavens and whatsoever is in the earth; and Allah is ever Self-Sufficient, Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs whatever is in the heavens and whatever is on the earth. We have certainly enjoined those who were given the Book before you, and you, that you should be wary of Allah. But if you are faithless, [you should know that] to Allah indeed belongs whatever is in the heavens and whatever is on the earth, and Allah is all-sufficient, all-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belong all things in the heavens and on earth. Verily we have directed the People of the Book before you, and you (o Muslims) to fear Allah. But if ye deny Him, lo! unto Allah belong all things in the heavens and on earth, and Allah is free of all wants, worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs all that is in the heavens and all that is in the earth. And verily, We have recommended to the people of the Scripture before you, and to you (O Muslims) that you (all) fear Allah, and keep your duty to Him, But if you disbelieve, then unto Allah belongs all that is in the heavens and all that is in the earth, and Allah is Ever Rich (Free of all wants), Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs all that is in the heavens and earth. We have charged those who were given the Book before you and you to fear Allah. If you disbelieve, to Allah belongs all that is in the heavens and the earth. Allah is Rich, the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs everything in the heavens and everything on earth. We have instructed those who were given the Book before you, and you, to be conscious of God. But if you refuse—to God belongs everything in the heavens and everything on earth. God is in no need, Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belongs whatever is in the heavens and whatever is on the earth. And We have instructed those who were given the Scripture before you and yourselves to fear Allah. But if you disbelieve - then to Allah belongs whatever is in the heavens and whatever is on the earth. And ever is Allah Free of need and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:131] To God belongs all that is in the heavens and in the earth. We have charged those who were given the Scripture, meaning the scriptures, before you, namely, the Jews and Christians, and you, O people of the Qur’ān: ‘Fear God’, fear His punishment, by being obedient to Him. And We said to them and to you: ‘If you disbelieve, in what you have been charged with, then to God belongs all that is in the heavens and in the earth’, as creatures, possessions and servants, and He will not be harmed by your disbelief: God is ever Independent, of the need for His creation or their worship, Praised, praise-worthy for what He does with them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Unto Allah belongeth whatsoever is in the heavens) of stores (and whatsoever is in the earth) of stores and other things. (And We charged those who received the Scripture before you) i.e. the people of the Torah We charged them in the Torah, and the people of the Gospel in the Gospel, and the people of every Scripture in their Scripture, (and (We charge) you) Community of Muhammad in your Book, (that you keep your duty towards Allah) obey Allah. (And if you disbelieve) in Allah, (lo! Unto Allah belongeth whatsoever is in the heavens) of angels as soldiers (and whatsoever is in the earth) of humans, jinn and other creatures as soldiers, (and Allah is ever Absolute) free from the need of your faith, (Owner of Praise) for His actions, He is grateful for whatever little is done for His sake and rewards abundantly for it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وإذا كان الأمر على هذا فعليكم أن تتقوا من الله في السراء والضراء والخصب الرخاء { وَ } اعلموا أنا { لَقَدْ وَصَّيْنَا } من قمام فضلنا وجودنا { ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ مِن قَبْلِكُمْ } أي: اليهود والنصارى\n وجميع من أنزل إليهم الكتاب في كتبهم { وَإِيَّاكُمْ } أيضاً في كتابكم هذا { أَنِ ٱتَّقُواْ ٱللَّهَ } المالك لأزمة الأمور بالاستحقاق\n وأطيعوا أمره وتوجهوا نحوه\n ولا تكفروا به { وَإِن تَكْفُرُواْ } وتعرضوا عن غاية جهلكم وعنادكم عما فرض عليكم أصلاً إصلاحاً لحالكم\n فاعلموا أن الله الغني بذاته لا يبالي بكفركم وإيمانكم { فَإِنَّ للَّهِ } رجوع { مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلأَرْضِ } إرادة وطوعاً { وَ } مع ذلك { كَانَ ٱللَّهُ غَنِيّاً } مستغنياً في ذاته وصفاته عن العالمين\n وعن كفرهم وإيمانهم { حَمِيداً } [النساء: 131] في نفسه حمد أو لم يحمد\n وكيف لا يكون سبحانه غنيّاً في ذاته حميداً في نفسه\n إذ ليس في الوجود غيره ولا شيء سواه ليحمده؟!",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { إياكم }: عطف على الذين\n و { أن اتقوا }: على حذف الجار\n أي: بأن اتقوا\n أو مفسرة لأن التوصية في معنى القول\n و { إن تكفروا } على حذف القول\n أي: وقلنا لهم ولكم: { وإن تكفروا\n\n\n } الخ\n يقول الحقّ جلّ جلاله: { ولقد وصينا } الأمم المتقدمة الذين أنزلنا عليهم { الكتاب من قبلكم } كأهل التوراة والإنجيل والزبور\n وغيرهم من الأمم\n ووصيناكم أنتم { أن اتقوا الله } بإن تمتثلوا أوامره\n وتجتنبوا نواهيَه\n ظاهرًا وباطنًا\n وقلنا لهم ولكم: { وإن تكفروا } فإن الله غني عن كفركم وشكركم فقد استقر له { ما في السماوات وما في الأرض } ملكًا وعبيدًا\n فله فيهما من الملائكة من هو أطوع منكم\n فلا يتضرر بكفركم\n كما لا ينتفع بشكركم وتقواكم\n وإنما أوصاكم رحمًة بكم\n لا لحاجة إليكم\n ثم قرر ذلك بقوله: { وكان الله غنيًا حميدًا } أي: غنيًا عن الخلق وعبادتهم\n محمودًا في ذاته\n حُمِد أو لم يُحمد\n\n{ ولله ما في السماوات وما في الإرض } كرره ثالثًا للدلالة على كونه غنيًا حميدًا\n فإن جميع المخلوقات تدل بحاجتها على غناه\n وبما أفاض عليها من الوجود\n وأنواع الخصائص والكمالات على كونه حميدًا\n قاله البيضاوي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "90:17",
      "similarity": 0.45663715808949185
    },
    {
      "verse": "34:24",
      "similarity": 0.45032488742869203
    },
    {
      "verse": "103:3",
      "similarity": 0.4319599437932505
    },
    {
      "verse": "36:50",
      "similarity": 0.42485324683312986
    },
    {
      "verse": "51:53",
      "similarity": 0.4034138288481842
    }
  ]
}