{
  "chapter": "النساء",
  "text": "وان يتفرقا يغن الله كلا من سعته وكان الله وسعا حكيما",
  "translations": [
    {
      "translation": "If a couple do separate, Allah will enrich each of them from His boundless wealth. Allah is All- Encompassing, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If both (decide to) separate, God in His largesse will provide for them; for God is infinite and all wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if the two separate, out of His plenty Allah will make each dispense with the other. Indeed Allah is All-Bounteous, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the marriage is terminated, God will make each one of them financially independent. God is Munificent and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if the two separate, Allah will make each one independent of the other, with His Capability; and Allah is Most Capable, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they separate (by divorce), Allah will provide abundance for everyone of them from His bounty. And Allah is Ever All-Sufficient for His creatures' needs, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they separate, Allah will render them both free from want out of His ampleness, and Allah is Ample-giving, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they separate, God will enrich each of them of His plenty; God is All-embracing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they separate, Allah will compensate each out of His abundance. Allah is ever All-Embracing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they decide to separate, God will compensate both out of His own abundance: God is bountiful and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if the twain must sunder, Allah shall render the twain independent out of His bounty, and Allah is ever Bountiful, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they separate, Allah will suffice each of them out of His bounty, and Allah is all-bounteous, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they disagree (and must part), Allah will provide abundance for all from His all-reaching bounty: for Allah is He that careth for all and is Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they separate (by divorce), Allah will provide abundance for everyone of them from His Bounty. And Allah is Ever All-Sufficient for His creatures' need, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they separate, Allah will enrich each of them out from His Vastness. He is the Embracer, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they separate, God will enrich each from His abundance. God is Bounteous and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they separate [by divorce], Allah will enrich each [of them] from His abundance. And ever is Allah Encompassing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:130] But if they, the married couple, separate, by way of divorce, God will compensate each of them, [from the need] of the other, out of His plenty, that is, out of His bounty, by giving her another as husband, and giving him another as wife. God is ever Embracing, of His creatures in bounty, Wise, in what He has ordained for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But if they separate) i.e. the man and the woman through divorce, (Allah will compensate each) the man and the woman (out of His abundance) from His provision: the man will be compensated with another wife and the woman with another husband. (Allah is ever All-Embracing) in relation to them as regards marriage, (All-Knowing) of that which He prescribed for them of justice. As'ad Ibn al-Rabi' had another young wife whom he favoured, and Allah forbade him from doing so and commanded that the young and the old wives were treated equally. 103\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِن } يتنازعون حتى { يَتَفَرَّقَا } وارتفع النكاح بينهما { يُغْنِ ٱللَّهُ } بفضله { كُلاًّ } منهما عن الآخر { مِّن سَعَتِهِ } أي: من سعة رحمته وبسطة رزقه وفسحة مملكته { وَكَانَ ٱللَّهُ } المتفضل لعباده { وَاسِعاً } لهم في عطائه { حَكِيماً } [النساء: 130] في إعطاء ما ينبغي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وَإِن يَتَفَرَّقَا يُغْنِ ٱللَّهُ كُلاًّ مِّن سَعَتِهِ وَكَانَ ٱللَّهُ وَاسِعاً حَكِيماً وَللَّهِ مَا فِي ٱلسَّمَاوَاتِ وَمَا فِي ٱلأَرْضِ\n\n\n }  يقول الحقّ جلّ جلاله: { وإن يتفرقا } أي: يفارق كل واحد منهما صاحبه، { يُغن الله } كل واحد منهما عن صاحبه، ببدل أو سُلُو يقوم بأمره من رزق أو غيره، من سعة غناه وكمال قدرته، { وكان الله واسعًا } قدرته { حكيمًا } أي: متقنًا في أحكامه وأفعاله\n ثم بيَّن معنى سعته فقال: { ولله ما في السماوات وما في الأرض } أي: كل ما استقر فيهما فهو تحت حكمه ومشيئته، قائمًا بحفظه وتدبيره، يعطي كل واحد ما يقوم بأمره ويغنيه عن غيره\n والله تعالى أعلم\n الإشارة: اعلم أن الروح ما دامت مسجونة تحت قهر البشرية، محجوبةً عن شهود معاني الربوبية، كانت فقيرة جائعة متعطشة، تتعشق إلى الأكوان وتفتقر إليها، وتقف معها، فإذا فارقت البشرية وانطلقت من سجن هيكلها، وخرجت فكرتها من سجن الأكون، أغناها الله بشهود ذاته، وأفضت إلى سعة فضاء الشهود والعيان، وملكت جميع الأكوان، \" أنت مع الأكوان ما لم تشهد المكون، فإذا شهدت المكون كانت الأكوان معك \" ، وكذلك البشرية يغنيها الله عن تعب الخدمة وتستريح في ظل المعرفة، فلما تفرقا أغنى الله كلاًّ من سعة فضله وجوده، لأنه واسع العطاء والجود، حكيم في تدبير إمداد كل موجود\n وفي قوله: { ولله ما في السماوات وما في الأرض } إشارة إلى أن من كان بالله، ووصل إلى شهود ذاته، ملَّكه الله ما في السماوات وما في الأرض، فيكون خليفة الله في ملكه\n\n[إبراهيم:20]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:98",
      "similarity": 0.6397778093492134
    },
    {
      "verse": "44:4",
      "similarity": 0.4535792825732146
    },
    {
      "verse": "29:56",
      "similarity": 0.4259856174887681
    },
    {
      "verse": "6:80",
      "similarity": 0.396713655593236
    },
    {
      "verse": "6:147",
      "similarity": 0.39603047756003923
    }
  ]
}