{
  "chapter": "النساء",
  "text": "ومن يعص الله ورسوله ويتعد حدوده يدخله نارا خلدا فيها وله عذاب مهين",
  "translations": [
    {
      "translation": "As for him who disobeys Allah and His Messenger and oversteps His limits, We will admit him into a Fire, to remain in it timelessly, for ever. He will have a humiliating punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disobey God and the Prophet and exceed the bounds of law, will be taken to Hell and abide there for ever and shall suffer despicable punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he who disobeys Allah and His Messenger and transgresses the bounds set by Him - him shall Allah cause to enter the Fire. There he will abide. A humiliating chastisement awaits him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever disobeys God and His Messenger and breaks His rules will be admitted to the fire wherein they will live forever, suffering a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever disobeys Allah and His Noble Messenger and crosses all His limits – Allah will put him in the fire (of hell), in which he will remain forever; and for him is a disgraceful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever disobeys Allah and His Messenger, and transgresses His (set) limits, He will cast him into the Fire, to abide therein; and he shall suffer a disgraceful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever disobeys Allah and His Apostle and goes beyond His limits, He will cause him to enter fire to abide in it, and he shall have an abasing chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoso disobeys God, and His Messenger, and transgresses His bounds, him He will admit to a Fire, therein dwelling forever, and for him there awaits a humbling chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoso disobeyeth Allah and His messenger and transgresseth His limits, He will make him enter Fire, where he will dwell for ever; his will be a shameful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But anyone who disobeys God and His Messenger and transgresses His limits shall be cast into a Fire, wherein he will abide forever. And he shall have a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever disobeyeth Allah and His apostle, and transgresseth His statutes, him He shall cause to enter the Fire, as an abider therein; and unto him shall be a torment ignominous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever disobeys Allah and His Apostle and transgresses the bounds set by Allah, He shall make him enter a Fire, to remain in it [forever], and there will be a humiliating punishment for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disobey Allah and His Messenger and transgress His limits will be admitted to a Fire, to abide therein: And they shall have a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever disobeys Allah and His Messenger (Muhammad SAW), and transgresses His limits, He will cast him into the Fire, to abide therein; and he shall have a disgraceful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he who disobeys Allah and His Messenger and transgresses His Bounds, He will admit him to a Fire and shall live in it for ever. For him, there is a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever disobeys God and His Messenger, and oversteps His bounds, He will admit him into a Fire, wherein he abides forever, and he will have a shameful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever disobeys Allah and His Messenger and transgresses His limits - He will put him into the Fire to abide eternally therein, and he will have a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:14] But whoever disobeys God, and His Messenger; and transgresses His bounds, him He will admit ([read] in both ways [as above, yudkhilhu and nudkhilhu]) to a Fire, abiding therein, and for him, in it, there shall be a humbling chastisement, one of humiliation. (In both [of the last] verses, the [singular] person [of the suffixed pronouns and the verbs] accords with the [singular] form of [the particle] man, ‘whoever’, while [the plural person in] khālidīn, ‘abiding’, accords with its [general plural] import.)\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And whoso disobeyeth Allah and His messenger) regarding the division of estates (and transgresseth His limits) contravenes His legal rulings and obligations through deviation and disobedience, (He will make him enter Fire, where such will dwell for ever) continually abiding in the Fire until whenever Allah wills; (his will be a shameful doom) through which he will be humiliated; it is also said that (be a shameful doom) means: a severe torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَن يَعْصِ ٱللَّهَ } بإنكار الأوامر\n والإصرار على النواهي { وَرَسُولَهُ } بالتكذيب والإيذاء وعدم الإطاعة { وَيَتَعَدَّ حُدُودَهُ } الموضوعة بين عباده { يُدْخِلْهُ } الله باسمه المنتقم { نَاراً } هي نار البعد والطرد عن كنفه وجوده\n فصار { خَالِداً فِيهَا } أبداً { وَلَهُ } بعصيانه وإصراره عليه { عَذَابٌ مُّهِينٌ } [النساء: 14] يبعده عن ساحة عن الحضور\n\n\nأدركنا بلطفك يا خفي الألطاف\n\n\nثم لمَّا بيَّن سبحانه أحكام المواريث وأحكام أحوال المتوارثين\n وعين سهامهم وأنصباءهم\n أراد أن يحذر المؤمنين عن الزنا التي هي هتك حرمة الله الموضوعة بين الإزواجات الحبية الإلهية\n واختلاط الأنساب المصححة للأحكام المذكورة\n وبالجملة: هي الخروج عن السنة الإلهية التي سنَّها بين عباده على طريق الحكمة والمصلحة الإلهية الصالحة\n والمصلحة لأصل فطرتهم التي خُلقوا عليها\n هي التوحيد الذاتي\n\n\nوالزنا يتصور بين المرء والمرأة الأجنبية المحرمة\n لذلك قدم سبحانه أمر النساء\n وبيَّن أحكامهن وأحال حكم الرجال على المقايسة\n لقباحتها وشناعتها\n كأنه استبعد سبحانه عن أهل الإيمان أمثال هذه الآثام والجرائم العظام الأخر الناقصات\n ولأنهن في أنفسهن شباك شياطين\n يصطادون بهن ضعفاء المؤمنين وأقوياءهم أيضاً\n على ما نطق به حديث النبي - صلوات الله على قائله -:\n \" ما آيس الشيطان من ابن آدم إلا ويأتيهم من قبل النساء \"\n \n ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن يعص الله } فيما أمر ونهى\n { ورسوله } فيما شرعه\n { ويتعدّ حدوده } التي حدها\n فتجاوز إلى متابعة هواه\n { ندخله نارًا خالدًا فيها وله عذاب مهين }\n وهذا إذا أنكر مشروعيتها فيكون كافرًا\n وإلاَّ كان عاصيًا في حكم المشيئة\n ومذهب أهل السنة أنه لا يخلد\n وحملوا الآية على الكافر\n أو عبارة عن طول المدة\n كما في قاتل النفس\n والله أعلم\n الإشارة: قد حدَّ الحق ـ جل جلاله ـ لأهل الشريعة الظاهرة حدودًا قام ببيانها العلماء\n وحدَّ لأهل الحقيقة ـ وهي سر الولاية ـ حدودًا\n قام بها الأولياء\n فمن قام بحدود الشريعة الظاهرة كان من المؤمنين الصالحين\n ومن تعداها كان من العاصين الظالمين\n ومن قام بحدود الحقيقة الباطنية\n وصحب أهلها كان المحسنين العارفين المقربين\n ودخل جنة المعارف\n ومن تعدَّ حدود الحقيقة\n أو لم يصحب أهلها كان من عوام أهل اليمين\n وله عذاب الحجاب في غم الحساب\n وقال في الحاشية: في حد حدوده إشارة للعبودية\n في إخراج كل عن نظره واختياره\n ثم انقياده وذلته لحكم ربه\n والوقوف عند حدوده\n وقال الورتجبي: قيل: { تلك حدود الله } أي: الإظهار من الأحوال للمريدين على حسب طاقتهم لها\n فإن التعدي فيها يهلكهم\n وقال أبو عثمان: ما هلك امرؤ لزم حده ولم يتعد طوره\n هـ\n وبالله التوفيق\n وهو الهادي إلى سواء الطريق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:63",
      "similarity": 0.4664511512516862
    },
    {
      "verse": "25:69",
      "similarity": 0.4433215388996276
    },
    {
      "verse": "4:13",
      "similarity": 0.43606824668086736
    },
    {
      "verse": "58:20",
      "similarity": 0.40708799022362724
    },
    {
      "verse": "22:57",
      "similarity": 0.38692558557119017
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/4:14.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/4:14.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/4:14.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}