{
  "chapter": "النساء",
  "text": "ان المنفقين فى الدرك الاسفل من النار ولن تجد لهم نصيرا",
  "translations": [
    {
      "translation": "The hypocrites are in the lowest level of the Fire. You will not find any one to help them,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites will be in the lowest depths of Hell, and you will find none to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the hypocrites shall be in the lowest depth of the Fire and you shall find none to come to their help,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites will be placed in the lowest bottom of the fire and none of you will ever find a helper for them, except\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Undoubtedly the hypocrites are in the deepest segment of hell; and you will never find any supporter for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, the hyprocrites will be in the lowest depth (grade) of the Fire; no helper will you find for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the hypocrites are in the lowest stage of the fire and you shall not find a helper for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the hypocrites will be in the lowest reach of the Fire; thou wilt not find for them any helper;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! the hypocrites (will be) in the lowest deep of the Fire, and thou wilt find no helper for them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites shall surely be in the lowest depth of the Fire; and you will find no helper for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the hypocrites shall be in the lowest abyss of the Fire; and thou wilt not find for them a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the hypocrites will be in the lowest reach of the Fire, and you will never find any helper for them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hypocrites will be in the lowest depths of the Fire: no helper wilt thou find for them;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "vVerily, the hyprocrites will be in the lowest depths (grade) of the Fire; no helper will you find for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites will be in the lowest place of the Fire, you will not find a helper for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites will be in the lowest level of the Fire, and you will find no helper for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the hypocrites will be in the lowest depths of the Fire - and never will you find for them a helper -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:145] Verily, the hypocrites will be in the lowest level, place, of the Fire, that is, its bottom; and you will never find a helper for them, anyone to guard them from the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! the hypocrites) 'Abdullah Ibn Ubayy and his followers ((will be) in the lowest deep of the Fire) because of their evil, betrayal and scheming against the Prophet (pbuh) and against his Companions, (and thou wilt find no helper) a protector (for them);\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ ٱلْمُنَافِقِينَ فِي ٱلدَّرْكِ ٱلأَسْفَلِ مِنَ ٱلنَّارِ } فَجَهَنَمُ أَدرَاكٌ معناهُ مَنازِلٌ، وأَطْباقٌ\n ويقالُ: إِنَّها تَوابيتُ مِنْ حَدِيدٍ مُبهمةٍ: معناهُ مُقْفَلةٌ عَلِيهِمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {The hypocrites are in the lowest depths of the Fire} - then Paradise is the abode, and the bowls [of Paradise].\n It is said that it is an atonement from a {hammered} iron: its meaning is that it is locked upon them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱلْمُنَافِقِينَ } المصرين على النفاق { فِي ٱلدَّرْكِ ٱلأَسْفَلِ } والمرتبة الأرذل، الأذل { مِنَ ٱلنَّارِ } المعدّ لجزاء العصاة، الطغاة، الضالين عن طريق الحق وصرطه المستقيم { وَلَن تَجِدَ لَهُمْ نَصِيراً } [النساء: 145] يشفعه لهمن وينجيهم منها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الدَّرَك والدَّرْك لغتان، كالظَّعَن والظَّعْن، والنَّهَر والنَّهْر، والنَّشَر والنَّشْر، وهي الطبقة السفلى، وسميت طبقاتهم دركات لأنها مُتداركة متتابعة، وهي ضد الدرجات، فالدرجات للعلو، والدركات للسفل\n يقول الحقّ جلّ جلاله: { إن المنافقين في الدرك الأسفل من النار } أي: في الطبقة السفلى في قَعر جهنم لإنهم أخبث الكفرة، حيث ضموا إلى الكفر الاستهزاء بالإسلام وخداع المسلمين\n قال ابن مسعود رضي الله عنه: هم في توابيت من النار مقفلة عليهم في النار، مطبقة عليهم\n وعن ابن عمر رضي الله عنه:  إن أشد الناس عذابًا يوم القيامة ثلاثة: المنافقون، وممن كفر من أصحاب المائدة، وآل فرعون لقوله: { إن المنافقين في الدرك الأسفل من النار } وقال في أصحاب المائدة:\n\n[المَائدة:115]\n وقال:\n\n[غافر:46]، { ولن تجد لهم نصيرًا } يمنعهم من ذلك العذاب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "95:5",
      "similarity": 0.5829180883289856
    },
    {
      "verse": "37:98",
      "similarity": 0.5463501300561887
    },
    {
      "verse": "41:29",
      "similarity": 0.5238851278959219
    },
    {
      "verse": "26:61",
      "similarity": 0.485146232593635
    },
    {
      "verse": "27:66",
      "similarity": 0.40534433469610104
    }
  ]
}