{
  "chapter": "النساء",
  "text": "مذبذبين بين ذلك لا الى هؤلاء ولا الى هؤلاء ومن يضلل الله فلن تجد له سبيلا",
  "translations": [
    {
      "translation": "They vacillate between the two - not joining these or joining those. If Allah misguides someone, you will not find any way for him to go.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wavering between the two, neither with these nor with those. For them who are not given the guidance by God, you will never find a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They dangle between the one and the other (faith and disbelief), and belong neither to these nor to those completely. And he whom Allah lets go astray, for him you can find no way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are hesitant people belonging to neither side. You can find no other way for one whom God has caused to go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fluctuating in the middle; neither here (in faith) nor there (in disbelief); and for one whom Allah sends astray, you will not find a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They are) swaying between this and that, belonging neither to these nor to those; and he whom Allah sends astray, you will not find for him a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wavering between that (and this), (belonging) neither to these nor to those; and whomsoever Allah causes to err, you shall not find a way for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "wavering all the time -- not to these, not to those; and whom God leads astray, thou wilt not find for him a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Swaying between this (and that), (belonging) neither to these nor to those. He whom Allah causeth to go astray, thou (O Muhammad) wilt not find a way for him:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They vacillate between the two, belonging neither to one side nor the other. But for him whom God allows to go astray you can never find the way for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wave ring between this and that; neither for this nor for that and whomsoever Allah sendeth astray, for him thou wilt never find a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "wavering in between: neither with these, nor with those. And whomever Allah leads astray, you will never find any way for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They are) distracted in mind even in the midst of it,- being (sincerely) for neither one group nor for another whom Allah leaves straying,- never wilt thou find for him the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They are) swaying between this and that, belonging neither to these nor to those, and he whom Allah sends astray, you will not find for him a way (to the truth - Islam).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "wavering between (belief and disbelief), neither to these nor to those, and whom Allah leads astray, you will not find a way for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wavering in between, neither with these, nor with those. Whomever God sends astray, you will never find for him a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wavering between them, [belonging] neither to the believers nor to the disbelievers. And whoever Allah leaves astray - never will you find for him a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:143] Wavering, hesitant, all the time, between that unbelief and belief — not, belonging, to these, disbelievers, neither to those, believers; and he whom God sends astray, you will never find for him a way, a path [back] to guidance.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Swaying between this (and that)) wavering between faith and disbelief: disbelief in secret and faith in front of people, ((belonging) neither to these) they are not with the believers as far as what is in their heart is 105 concerned, such that that which is obligated upon the believers is obligated upon them (nor to those) nor do they belong to the Jews when they declare their faith in public, such that what is prescribed for the Jews is prescribed for them. (He whom Allah causeth to go astray) from His religion and proof in the depth of his heart, (thou (0 Muhammad) will not find a way for him) you will not find a religion or proof for him as far as the conviction of his heart is concerned:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبل { مُّذَبْذَبِينَ } مردّدين { بَيْنَ ذٰلِكَ } بحيث { لاَ } ينسبون { إِلَىٰ هَـٰؤُلاۤءِ } المؤمنين { وَلاَ إِلَى هَـٰؤُلاۤءِ } الكافرين، هم في أنفسهم ضالين، وعند الله مردودين { وَمَن يُضْلِلِ ٱللَّهُ } ويحليه على الضلال { فَلَن تَجِدَ لَهُ سَبِيلاً } [النساء: 143] إلى الهداية أصلاً\n\n\n\n\nاهدنا بلطفك إلى الصراط المستقيم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وكانوا أيضًا { مذبذبين } أي: مترددين ومتحيرين بين الكفر والإيمان، { لا إلى هؤلاء ولا إلى هؤلاء } أي: لا صائرين إلى المؤمنين ولا إلى الكافرين\n قال قتادة: ماهم بمؤمنين مخلصين، ولا مشركين مُصَرِّحين بالشرك، هكذا سبق في علم الله، { ومن يضلل الله فلن تجد له سبيلاً } أي: طريقًا إلى الهدى، ومثله قوله تعالى:\n\n[النور:40]\n الإشارة: كل من أحب أن يَرى الناسُ محاسنَ أعماله وأحواله، ففيه شعبة من النفاق وشعبة من الرياء، وعلامة المرائي: تزيين ظاهرة وتخريب باطنه، يتزين للناس بحسن أعماله وأحواله، يراقب الناس ولا يراقب الله، وكان بعضُ الحكماء يقول: يقول الله ـ تعالى ـ:\n\n \" يا مُرائي: أمرُ من ترائى بيد من تعصيه \" \n\nفمثل هذا أعماله كلها قليلة، ولو كثرت في الحس كالجبال الرواسي، وأعمال المخلصين كلها كثيرة ولو قلَّت في الحس، وأعمال المرائين كلها قليلة ولو كثرت في الحس\n قال في القوت: وَصَفَ اللهُ تعالى ذكر المنافقين بالقلة، لكونه غير خاص، كما قيل في تفسير قوله تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:52",
      "similarity": 0.04197652735182819
    },
    {
      "verse": "4:88",
      "similarity": 0.03929760821285069
    },
    {
      "verse": "33:62",
      "similarity": 0.0361273025209229
    },
    {
      "verse": "48:23",
      "similarity": 0.03607167466209815
    },
    {
      "verse": "18:27",
      "similarity": 0.03558568236419983
    }
  ]
}