{
  "chapter": "النساء",
  "text": "لا يحب الله الجهر بالسوء من القول الا من ظلم وكان الله سميعا عليما",
  "translations": [
    {
      "translation": "Allah does not like evil words being voiced out loud, except in the case of someone who has been wronged. Allah is All-Hearing, All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not like ill (of others) spoken about, except by him who has been wronged. For God hears all and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not like speaking evil publicly unless one has been wronged. Allah is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not love public accusation unless one is truly wronged. God is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not like disclosure of evil matters except by the oppressed; and Allah is All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not like that the evil should be uttered in public except by him who has been wronged. And Allah is Ever All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not love the public utterance of hurtful speech unless (it be) by one to whom injustice has been done; and Allah is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God likes not the shouting of evil words unless a man has been wronged; God is All-hearing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah loveth not the utterance of harsh speech save by one who hath been wronged. Allah is ever Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not love the utterance of evil words except in the case of someone who has been wronged. God hears all and knows all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah approveth not the publishment of evil speech, unless by one who hath been wronged; and Allah is ever Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not like the disclosure of [anyone’s] evil [conduct] in speech except by someone who has been wronged, and Allah is all-hearing, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah loveth not that evil should be noised abroad in public speech, except where injustice hath been done; for Allah is He who heareth and knoweth all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not like that the evil should be uttered in public except by him who has been wronged. And Allah is Ever All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not love the shouting of evil words, except by he who has been wronged. He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not like the public uttering of bad language, unless someone was wronged. God is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not like the public mention of evil except by one who has been wronged. And ever is Allah Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:148] God does not like the utterance of evil words out loud, by any person, that is to say, He will punish him for it, unless a person has been wronged, in which case He would not punish him for uttering it out loud, when he is informing [others] of the wrong done to him by the wrong-doer or summoning [them] against him. God is ever Hearer, of what is said, Knower, of what is done.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nموقع هذه الآية عقب الآي التي قبلها أنّ الله لما شوّه حال المنافقين وشهّر بفضائحهم تشهيراً طويلاً ، كان الكلام السابق بحيث يثير في نفوس السامعين نفوراً من النفاق وأحواله ، وبغضاً للملموزين به ، وخاصّة بعد أن وصفهم باتّخاذ الكافرين أولياء من دون المؤمنين ، وأنَّهم يستهزئون بالقرآن ، ونَهى المسلمين عن القعود معهم ، فحذّر الله المسلمين من أن يغيظهم ذلك على من يتوسّمون فيه النفاق ، فيجاهِروهم بقول السوء ، ورخَّص لِمن ظُلم من المسلمين أن يجهر لظالمه بالسوء ، لأنّ ذلك دفاع عن نفسه .روى البخاري : أنّ رجالاً اجتمعوا في بيت عِتبان بن مالك لطعام صنعه لرسول الله صلى الله عليه وسلم فقال قائل : أين مالك بن الدّخْشُم ، فقال بعضهم : ذلك منافق لا يحبّ الله ورسوله ، فقال رسول الله : \" لا تقل ذلك ألا تراه قد قال : لا إله إلاّ الله ، يريد بذلك وجهَ الله ، فقال : فإنَّا نرى وجهه ونصيحته إلى المنافقين \" . الحديثَ . فظنّ هذا القائل بمالك أنَّه منافق ، لملازمته للمنافقين ، فوصفه بأنَّه منافق لا يحبّ الله ورسوله . فلعلّ هذه الآية نزلت للصدّ عن المجازفة بظنّ النفاق بمن ليس منافقاً . وأيضاً لمّا كان من أخصّ أوصاف المنافقين إظهار خلاف ما يُبطنون فقد ذكرت نجواهم وذكر رياؤهم في هذه السورة وذكرت أشياء كثيرة من إظهارهم خلاف ما يبطنون في سورة البقرة كان ذلك يثير في النفوس خشية أن يكون إظهار خلاف ما في الباطن نفاقاً فأراد الله تبين الفارق بين الحالين .وجملة { لا يحبّ } مفصولة لأنَّها استئناف ابتدائي لهذا الغرض الذي بينّاه : الجهر بالسوء من القول ، وقد علم المسلمون أنّ المحبّة والكراهية تستحيل حقيقتهما على الله تعالى ، لأنّهما انفعالان للنفس نحو استحسان الحسن ، واستنكار القبيح ، فالمراد لازمهما المناسب للإلهية ، وهما الرضا والغضب .وصيغة { لا يحبّ } ، بحسب قواعد الأصول ، صيغة نفي الإذن . والأصل فيه التحريم . وهذا المراد هنا؛ لأنّ { لا يحبّ } يفيد معنى يكره ، وهو يرجع إلى معنى النهي . وفي «صحيح مسلم» عن أبي هريرة قال رسول الله صلى الله عليه وسلم \" إنّ الله يرضى لكم ثلاثاً ويكره لكم ثلاثاً إلى قوله ويكره لكم قِيل وقال وكثرة السؤال وإضاعة المال \" . فهذه أمور ثلاثة أكثر أحوالها مُحرّم أو مكروه .والمراد بالجهر ما يبلغ إلى أسماع الناس إذ ليس السرّ بالقول في نفس الناطق ممّا ينشأ عنه ضرّ . وتقييده بالقول لأنَّه أضعف أنواع الأذى فيعلم أنّ السوء من الفعل أشدّ تحريماً .واستثنى { مَن ظُلم } فرَخَّص له الجهرَ بالسوء من القول . والمستثنى منه هو فاعلُ المصدر المقدّر الواقع في سياق النفي ، المفيد للعموم ، إذ التقدير : لا يحبّ الله جَهْر أحد بالسوء ، أو يكون المستثنى مضافاً محذوفاً ، أي : إلاّ جَهْرَ من ظلم ، والمقصود ظاهر ، وقد قضي في الكلام حقّ الإيجاز .ورخَّص الله للمظلوم الجهر بالقول السيّىء ليشفي غضبه ، حتّى لا يثوب إلى السيف أو إلى البَطش باليد ، ففي هذا الإذن توسعة على من لا يمسك نفسه عند لحاق الظلم به ، والمقصود من هذا هو الاحتراس في حكم { لا يحبّ الله الجهر بالسوء من القول } . وقد دلَّت الآية على الإذن للمظلوم في جميع أنواع الجهر بالسوء من القول ، وهو مخصوص بما لا يتجاوز حدّ التظلّم فيما بينه وبين ظالمه ، أو شكاية ظلمه : أن يقول له : ظلمتني ، أو أنت ظالم؛ وأن يقول للناس : إنَّه ظالم . ومن ذلك الدعاءُ على الظالم جهراً لأنّ الدعاء عليه إعلان بظلمه وإحالته على عدل الله تعالى ، ونظير هذا المعنى كثير في القرآن ، وذلك مَخصوص بما لا يؤدّي إلى القذف ، فإنّ دلائل النهي عن القذف وصيانة النفس من أن تتعرّض لِحدّ القذف أو تعزيز الغيبة ، قائمة في الشريعة . فهذا الاستثناء مفيد إباحة الجهر بالسوء من القول من جانب المظلوم في جانب ظالمه؛ ومنه ما في الحديث \" مَطْلُ الغنيّ ظلم \" أي فللممطول أن يقول : فلان مماطل وظالم . وفي الحديث \" لَيُّ الواجد يحلّ عرضه وعقوبته \" . وجملة { وكان الله سميعاً عليماً } عطف على { لا يحبّ } ، والمقصود أنَّه عليم بالأقوال الصادرة كلّها ، عليم بالمقاصد والأمور كلّها ، فذِكْرُ «عليماً» بعد «سميعاً» لقصد التعميم في العلم ، تحذيراً من أن يظنّوا أنّ الله غير عالم ببعض ما يصدر منهم .\n\n",
      "translations": [
        {
          "translation": "(Allah loveth not the utterance of harsh speech) verbal abuse (save by one who has been wronged) in this case, he is permitted to make supplications; it is also said that this means: Allah does not love the utterance of harsh speech even from one who has been wronged. (Allah is ever Hearer) of the supplication of the person who has been wronged, (Knower) of the punishment of the transgressor. This verse was revealed about Abu Bakr who was verbally abused by a man.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن متقضيات التوحيد أيها المتوجهون نحوه ألاَّ تظهروا\n وتبثُّوا إلى الله الشكوى في الأمور المتعلقة بالدنيا\n ولا تلحوا في المناجاة والدعاء\n فإن ناقدكم بصير بحاجاتكم\n وعليكم الرضا بما جرى عليكم من القضاء\n ونعم القرين الرضا\n إذ { لاَّ يُحِبُّ ٱللَّهُ } المتجلي باسم الرحمن على ذرائر الأكوان معتدلاً\n مستوياً بلا تفاوت\n ولا يمدح عنده { ٱلْجَهْرَ } والإشاعة { بِٱلسُّوۤءِ } أي: لا يحب أن يجهر بالقبيح\n المستهجين عقلاً وشرعاً\n ويبالي بشأنه\n ويستدعي لأجله\n إذ لا يجري في ملكه إلا العدل والخير\n خصوصاً الجهر { مِنَ ٱلْقَوْلِ إِلاَّ } جهر { مَن ظُلِمَ } فإنه سبحانه يحبه\n ويبادر إلى إجابته\n إذ الظالم خارج عن مقتضى عدل الله وصراطه المستقيم { وَكَانَ ٱللَّهُ } المتجلي على العدل القويم { سَمِيعاً } لجهر المظلوم { عَلِيماً } [النساء: 148] بظلم الظالم\n وبما استحق له من الجزاء\n يجازيه على مقتضى علمه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إلا من ظلم }: استثناء منقطع\n أي: لكن من ظلم فلا بأس أن يشكو بظالمه ويدعو عليه\n وليس المراد أن الله يحب ذلك منه\n إذ العفو أحسن كما يقوله بعد\n وقٌرىء: { إلا من ظَلَم } بالبناء للفاعل\n أي: ولكن الظالم يفعل ما لا يحبه الله\n يقول الحقّ جلَ جلاله: { لا يحب الله الجهر } أي: الإجهار { بالسوء من القول } لأنه مِن فِعل أهل الجفاء والجهل { ألا من ظُلم } فلا بأس أن يجهر بالدعاء على ظالمه\n أو بالشكوى به\n نظيرها:\n[الشّورى:41]\n قال مجاهد: هذا في الضيف النازل إذا لم يُضَف ومُنِع حقه\n أو أُسِيءَ قِراه\n فقد رخص له أن يذكر ما صُنعَ به\n وزَعَم أن ضيفًا تَضَيَّفِ قومًا فأساؤوا قراه\n فاشتكاهم\n فنزلت الآية رخصة في شكواه\n { وكان الله سميعًا } لدعاء المظلوم\n ورده على الظالم\n فلا يحتاج إلى جهره\n { عليمًا } بالظالم فيعاقبه على قدر جرمه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "71:8",
      "similarity": 0.7493571377234048
    },
    {
      "verse": "87:7",
      "similarity": 0.6792158192777082
    },
    {
      "verse": "6:3",
      "similarity": 0.6354433276637712
    },
    {
      "verse": "21:110",
      "similarity": 0.6254605185487577
    },
    {
      "verse": "20:7",
      "similarity": 0.611384834582353
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004148.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004148.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:148.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}