{
  "chapter": "النساء",
  "text": "يايها الذين ءامنوا۟ لا تتخذوا۟ الكفرين اولياء من دون المؤمنين اتريدون ان تجعلوا۟ لله عليكم سلطنا مبينا",
  "translations": [
    {
      "translation": "You who have iman! do not take the kafirun as friends rather than the muminun. Do you want to give Allah clear proof against you?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, do not hold unbelievers as friends in preference to the faithful. Do you want to proffer a clear proof of your own guilt before God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Do not take the unbelievers as your allies in preference to the believers. Do you wish to offer Allah a clear proof of guilt against yourselves?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not make unbelievers your intimate friends and supporters rather than believers. Do you want to establish clear evidence against yourselves before God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not befriend disbelievers in place of Muslims; do you wish to give Allah a clear proof against you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not take disbelievers as friends instead of believers. Do you wish to offer Allah a manifest Sultan against yourselves\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! do not take the unbelievers for friends rather than the believers; do you desire that you should give to Allah a manifest proof against yourselves?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, take not the unbelievers as friends instead of the believers; or do you desire to give God over you a clear authority?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Choose not disbelievers for (your) friends in place of believers. Would ye give Allah a clear warrant against you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not take deniers of the truth [who are at war with you] for your allies in preference to believers. Would you give God a clear proof against yourselves?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! take not infidels for friends, instead of believers. Would ye give Allah against you a manifest warranty!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not take the faithless for friends instead of the faithful. Do you wish to give Allah a clear sanction against yourselves?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Take not for friends unbelievers rather than believers: Do ye wish to offer Allah an open proof against yourselves?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Take not for Auliya' (protectors or helpers or friends) disbelievers instead of believers. Do you wish to offer Allah a manifest proof against yourselves?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not take the unbelievers for guides instead of the believers, or do you desire to give Allah a clear authority over you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not befriend disbelievers rather than believers. Do you want to give God a clear case against you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not take the disbelievers as allies instead of the believers. Do you wish to give Allah against yourselves a clear case?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:144] O you who believe, take not the disbelievers as friends instead of the believers: do you desire to give God over you, by your taking them as friends, a clear warrant?, a manifest proof of your hypocrisy?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe!) only outwardly: 'Abdullah Ibn Ubayy and his followers (Choose not disbelievers) the Jews (for (your) friends) in order to gain power (in place of believers) instead of sincere believers. (Would you) group of hypocrites (give Allah) give Allah's Messenger (a clear warrant against you?) a clear proof and reason to kill you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لا تتخذوا الكافِرين أوليَاء } لئلا يتعدّى إليكم كفرهم واحتجابهم بالصحبة والمخالطة فإنه لا شيء أقوى تأثيراً من الصحبة والميل إلى ولايتهم لا يخلو عن جنسية بينهم لوجود هوى كامن فيهم وضراوة بعادة رديئة تشملهم لا يؤمن عليهم الوقوع في الكفر بغلبة الهوى والنفس\n { سُلطاناً مُبيناً } حجة ظاهرة في عقابكم برسوخ الهيئة التي بها تميلون إلى ولايتهم بصحبتهم ومجالستهم { في الدرَك الأسفل } باعتبار زيادة عذابه وشدّة إيلامه وإحراقه لا باعتبار كونه أدون مرتبة\n إذ تأثير النار في المنافق أشدّ وأكثر إيلاماً لبقية استعداد فيه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَا أَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم { لاَ تَتَّخِذُواْ ٱلْكَافِرِينَ أَوْلِيَآءَ مِن دُونِ ٱلْمُؤْمِنِينَ أَتُرِيدُونَ } بصنيعكم هذا { أَن تَجْعَلُواْ للَّهِ } المحاسب\n المجازي لأعمال عباده { عَلَيْكُمْ } أيها المتخذون { سُلْطَاناً مُّبِيناً } [النساء: 144] حجة واضحة على كفركم ونفاقكم\n إذ من فعلكم هذا يلوح أثر النفاق والشقاق مع المؤمنين\n فعليكم ألاَّ تصحبوهم\n ولا تتخذوهم أولياء\n سيما بعد ورود النهي\n حتى لا تلحقوا بهم\n ولا تحشروا في زمرتهم\n\n\n{ إِنَّ ٱلْمُنَافِقِينَ } المصرين على النفاق { فِي ٱلدَّرْكِ ٱلأَسْفَلِ } والمرتبة الأرذل",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: اتخذ، يتعدّى إلى مفعولين، و { من دون }: حال. يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا } لا تتشبهوا بالمنافقين فتتخذوا { الكافرين أولياء } وأصدقاء { من المؤمنين } لأن الله أعزكم بالإيمان والنصر، فلا تطلبوا العز من أحد سواه، { أتريدون أن تجعلوا لله عليكم سلطانًا مبينًا } أي: حجة واضحة على تعذيبكم وسببًا في عقابكم. الإشارة: قد تقدم في كثير من الإشارات النهي عن موالاة أهل الإنكار على الأولياء، وعن مخالطة أهل الدنيا وصحبتهم، فإن ذلك حجة واضحة على الرجوع إليهم ومصانعتهم، وهو عين النفاق عند المخلصين. والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:100",
      "similarity": 0.5652202697855913
    },
    {
      "verse": "18:15",
      "similarity": 0.5331016670663274
    },
    {
      "verse": "37:156",
      "similarity": 0.5156260571921057
    },
    {
      "verse": "11:96",
      "similarity": 0.5154580663897207
    },
    {
      "verse": "40:23",
      "similarity": 0.5154580663897207
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/4:144.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/4:144.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/4:144.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}