{
  "chapter": "النساء",
  "text": "ان المنفقين يخدعون الله وهو خدعهم واذا قاموا۟ الى الصلوة قاموا۟ كسالى يراءون الناس ولا يذكرون الله الا قليلا",
  "translations": [
    {
      "translation": "The hypocrites think they deceive Allah, but He is deceiving them. When they get up to pray, they get up lazily, showing off to people, and only remembering Allah a very little.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites try to deceive God, but He (leads them to) deceive themselves. When they stand up for performing the service of prayer they do so indolently, only for show, and remember God but little,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, the hypocrites seek to deceive Allah, but it is they who are being deluded by Him. When they rise to Prayer, they rise reluctantly, and only to be seen by men. They remember Allah but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites try to deceive God but He, in fact, deceives them. They stand up in prayer lazily just to show that they pray, but, in truth they remember God very little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Undoubtedly the hypocrites, in their fancy, seek to deceive Allah whereas He will extinguish them while making them oblivious; and when they stand up for prayer, they do it unwillingly and for others to see, and they do not remember Allah except a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, the hypocrites seek to deceive Allah, but it is He Who deceives them. And when they stand up for Salah, they stand with laziness and to be seen of men, and they do not remember Allah but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the hypocrites strive to deceive Allah, and He shall requite their deceit to them, and when they stand up to prayer they stand up sluggishly; they do it only to be seen of men and do not remember Allah save a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites seek to trick God, but God is tricking them. When they stand up to pray they stand up lazily, showing off to the people and not remembering God save a little;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! the hypocrites seek to beguile Allah, but it is He Who beguileth them. When they stand up to worship they perform it languidly and to be seen of men, and are mindful of Allah but little;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites seek to outwit God -- but it is He who outwits them. And when they stand up for prayer, they do so reluctantly and to be seen by others, and they hardly remember God at all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the hypocrites would beguile Allah, whereas it is He who beguileth them,; and when they stand up to prayer, they stand up languidly, making a show to the people, and they remember not Allah but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites indeed seek to deceive Allah, but it is He who outwits them. When they stand up for prayer, they stand up lazily, showing off to the people and not remembering Allah except a little,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hypocrites - they think they are over-reaching Allah, but He will over-reach them: When they stand up to prayer, they stand without earnestness, to be seen of men, but little do they hold Allah in remembrance;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, the hypocrites seek to deceive Allah, but it is He Who deceives them. And when they stand up for As-Salat (the prayer), they stand with laziness and to be seen of men, and they do not remember Allah but little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites seek to deceive Allah, but Allah is deceiving them. When they stand up to pray, they stand up lazily, showing off to the people and do not remember Allah, except a little,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hypocrites try to deceive God, but He is deceiving them. And when they stand for prayer, they stand lazily, showing off in front of people, and remembering God only a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the hypocrites [think to] deceive Allah, but He is deceiving them. And when they stand for prayer, they stand lazily, showing [themselves to] the people and not remembering Allah except a little,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:142] The hypocrites seek to trick God, by manifesting the opposite of what they hide in themselves of unbelief, in order to escape His rulings in this world; but He is tricking them, He will requite them for their trickery, and so they will be disgraced in this world through God apprising His Prophet of what they hide, and punished in the Hereafter. When they stand up to pray, with the believers, they stand up lazily, reluctantly, and, for their prayers, to be seen by people, and they do not remember, pray [to], God save a little, for ostentation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! the hypocrites) 'Abdullah Ibn Ubayy and his followers (seek to beguile Allah) they disbelieve in Him and oppose Him in secret and think that they are deceiving Him, (but it is Allah Who beguileth them) on the Day of Judgement when, on the Bridge over hell, the believers will tell them: go back to the life of the world and seek some light, knowing full well that they cannot do so. (When they stand up to worship) when they go to perform the prayer (they perform it languidly) they perform it sluggishly (and to be seen of men) when they see people, they go to perform the prayer, but when they do see people they do not go, (and are mindful of Allah) they do not perform the prayer for Allah (but little) to show off and be known by others as people who pray;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { إِنَّ ٱلْمُنَافِقِينَ } المصرين على النفاق\n يتخيلون أنهم { يُخَادِعُونَ ٱللَّهَ } ويلبسون عليه\n كخديعهم وتلبيسهم على المؤمنين { وَ } الحال أنه { هُوَ خَادِعُهُمْ } وماكرهم باقتدارهم على هذا الخداع\n إذ يترتب عليه من الجزاء ما لو علموا لهلكوا { وَ } من جملة نفاقهم وشقاقهم أنهم { إِذَا قَامُوۤاْ إِلَى } أداء { ٱلصَّلاَةِ } مع المؤمنين { قَامُواْ كُسَالَىٰ } مبطئين\n متكاسلين\n وليس غرضهم منها سوى أنهم { يُرَآءُونَ ٱلنَّاسَ } حتى يظنوا أنهم مؤمنون\n مخلصون { وَ } مع ذلك { لاَ يَذْكُرُونَ ٱللَّهَ } في الصلاة { إِلاَّ قَلِيلاً } النساء: 142] منهم\n أخلصوا في نفسه\n ولم يظهروا لخوفهم \n والحاصل أن أ÷ل النفاق ليسوا من الكافرين عند الكافرين\n وأيضاً ليسوا من المؤمنين عند المؤمنين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: جملة: { ولا يذكرون الله } حال من واو { يُراءون } ، وكذلك { مذبذبين } أي: يراءون حال كونهم غير ذاكرين مذبذبين، أو منصوب على الذم، والمذبذب المضطرب المتردد\n يقول الحقّ جلّ جلاله: { إن المنافقين يُخادعون الله } بإظهار الإيمان وإخفاء الكفر، { وهو خادعهم } ، أي: مجازيهم على خداعهم بأن يظهر لهم يوم القيامة، نورًا يمشون به على الصراط، كما يعطي المؤمنين، فإذا مضوا به طُفِىءَ نورهم وبقي نور المؤمنين، فينادونهم:\n\n[الحديد:13]، فيتهافتون في النار، فسمي هذه العقوبة خداعًا تسمية للعقوبة باسم الذنب\n وكانوا { إذا قاموا إلى الصلاة قاموا كسالى } أي: متثاقلين، لا يريدون بها وجه الله، فإن رءاهم أحد، صلوا، وإلاَّ انصرفوا، فلم يصلوا، { يُراءون } بأعمالهم { الناس } أي: المؤمنين، { ولا يذكرون الله إلا قليلاً } لأن المرئي لا يذكر إلا بحرة الناس، وهو أقل أحواله، أو لا يذكرونه في صلاتهم إلا قليلاً، لأنهم لا يذكرون إلا التكبير والتسليم، وقال ابن عباس: إنما ذلك لأنهم يفعلونها رياءً وسمعةً، ولو أرادوا بذلك وجه الله تعالى لكان كثيرًا\n وقال قتادة: إنما قل ذكرهم، لأنه لم يُقبل، فكل ما رُدَّ من العمل فهو قليل، وكل ما قُّبل فهو كثير",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:54",
      "similarity": 0.6942471422350374
    },
    {
      "verse": "2:9",
      "similarity": 0.5343507147714678
    },
    {
      "verse": "8:62",
      "similarity": 0.4978867847957063
    },
    {
      "verse": "2:83",
      "similarity": 0.05770542985458764
    },
    {
      "verse": "22:35",
      "similarity": 0.05415972666981686
    }
  ]
}