{
  "chapter": "النساء",
  "text": "الا الذين تابوا۟ واصلحوا۟ واعتصموا۟ بالله واخلصوا۟ دينهم لله فاو۟لئك مع المؤمنين وسوف يؤت الله المؤمنين اجرا عظيما",
  "translations": [
    {
      "translation": "except those who make tawba and put things right and hold fast to Allah and dedicate their deen to Allah alone; they are with the muminun. Allah will give the muminun an immense reward.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who repent and amend, and hold firmly to God, and are sincere and wholly obedient to God, are surely with the faithful; and God will bestow on the faithful a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those who re-pent and mend their ways and hold fast to Allah and make their faith exclusive to Allah. Those people shall be numbered with the believers and Allah will certainly bestow on the believers a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those (hypocrites) who have repented, put their trust in God, and sincerely followed only His religion will live with the believers to whom God will give a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repented and reformed themselves and held fast to Allah’s rope and made their religion sincerely only for Allah – so they are with the Muslims; and Allah will soon bestow upon the believers a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent, do righteous good deeds, depend on Allah, and purify their religion for Allah, then they will be with the believers. And Allah will grant the believers a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent and amend and hold fast to Allah and are sincere in their religion to Allah, these are with the believers, and Allah will grant the believers a mighty reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save such as repent, and make amends, and hold fast to God, and make their religion sincerely God's; those are with the believers, and God will certainly give the believers a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save those who repent and amend and hold fast to Allah and make their religion pure for Allah (only). Those are with the believers. And Allah will bestow on the believers an immense reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who repent and mend their ways, who hold fast to God and are sincere in their worship of God will be joined with the believers; and God will bestow a great reward upon the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who shall yet repent and amend and hold fast by repent Allah and make their religion exclusive for Allah. These then shall be with the believers, and presently Allah shall give the believers a mighty hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except for those who repent and reform, and hold fast to Allah and dedicate their religion [exclusively] to Allah. Those are with the faithful, and soon Allah will give the faithful a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those who repent, mend (their lives) hold fast to Allah, and purify their religion as in Allah's sight: if so they will be (numbered) with the believers. And soon will Allah grant to the believers a reward of immense value.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent (from hypocrisy), do righteous good deeds, hold fast to Allah, and purify their religion for Allah (by worshipping none but Allah, and do good for Allah's sake only, not to show-off), then they will be with the believers. And Allah will grant to the believers a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who repent and mend (their ways), who hold fast to Allah, and make their religion sincerely for Allah they are with the believers, and Allah will certainly give the believers a great wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who repent, and reform, and hold fast to God, and dedicate their religion to God alone. These are with the believers; and God will give the believers a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those who repent, correct themselves, hold fast to Allah, and are sincere in their religion for Allah, for those will be with the believers. And Allah is going to give the believers a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:146] Save those who repent, of hypocrisy, and make amends, in their deeds, and hold fast to, put their trust [in], God and make their religion purely God’s, free from any pretence; those are with the believers, in terms of what they shall be given; and God will certainly give the believers a great wage, in the Hereafter, and that is Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Save those who repent) from hypocrisy and harbouring disbelief secretly (and amend) that which is between them and their Lord with regard to their scheming and treachery (and hold fast to Allah) they hold fast to their belief in Allah's divine Oneness inwardly (and make their religion) their belief in Allah's divine Oneness (pure for Allah (only). Those are with the believers) they are with the believers inwardly; it is also said that this means that they are with them as far as the promise is concerned; and it is also said that this means that they are with the believers both inwardly and outwardly; and it is said that they are with the believers in Paradise. (And Allah will bestow on the believers) sincere believers (an immense reward) an abundant reward in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ ٱلَّذِينَ تَابُواْ } وندموا عمَّا جرى عليهم من النفاق { وَأَصْلَحُواْ } بالتوبة ما أفسدوا بالنفاق من شعائر الإيمان والإسلام { وَٱعْتَصَمُواْ بِٱللَّهِ } وفضله ولطفه حين رجعوا إليه، وتوجهوا نحوه { وَ } بعدما تابوا واعتصموا بالله { أَخْلَصُواْ دِينَهُمْ } إطاعتهم وانقيادهم { للَّهِ } المنزه عن الشريك والنظير، المقدس عن المشير والظهير، ليس كثمله شيء، وهو السميع البصير { فَأُوْلَـٰئِكَ } السعداء، المقبولون عند الله { مَعَ ٱلْمُؤْمِنِينَ } في روح الله وكنف لطفه ورحمته { وَسَوْفَ يُؤْتِ ٱللَّهُ ٱلْمُؤْمِنِينَ } في يوم الجزاء { أَجْراً عَظِيماً } [النساء: 146] هو الفو بشرف اللقاء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إلا الذين تابوا } عن النفاق { وأصلحوا } ما أفسدوا في سرائرهم وأعمالهم في حال النفاق، { واعتصموا بالله } أي: وثقوا به وتمسكوا به، دون أحد سواه، { وأخلصوا دينهم لله } لا يريدون بطاعته إلا وجه الله، ولا رياءً ولا سمعةً { فأولئك مع المؤمنين } في الدين\n قال الفرَّاء: من المؤمنين، وقال العتبي: حاد عن كلامهم غيظًا عليهم، ولم يقل هم المؤمنون\n هـ\n قلت: إنما قال: { مع المؤمنين } ولم يقل: منهم، لأن التخلص من النفاق صعب، ولا يكون من المؤمنين، حتى يتخلص من جميع شعبه، وهو عزيز، وقد قال عليه الصلاة والسلام:\n\n \" ثَلاثٌ مَن كُنَّ فيه فهُوَ مُنَافقٌ، وإن صَامَ وصلَّى وزَعم أنه مُسلمٌ، من إذا حدَّثَ كَذَبَ، وإذَا وعَدَ أخلفَ، وإذا ائُتمِنَ خَانَ \"\n \n\n{ وسوف يُؤت الله المؤمنين } المخلصين { أجرًا عظيمًا } فيساهُمونَهم فيه إن تابوا وأصلحوا، فإن الله غني عن عذابهم، ولذلك قال: { ما يفعل الله بعذابكم إن شكرتم وآمنتم } أي: لا حاجة له في عذابكم، فلا يُشفى به غيظًا ولا يدفع به ضررًا، أو يستجلب به نفعًا لأنه غنيَّ عن المنافع، وإنما يعاقب المصر بكفره، لأن إصراره عليه كسوء المزاج يؤدي إلى مرض فإن زال بالإيمان والشكر، ونقَّى منه قلبه، تخلص من تبعته\n وإنما قدم الشكر لإن الناظر يدرك النعم أولاً فيشكر شكرًا مبهمًا، ثم يمعن النظر حتى يعرف المنعم فيؤمن به\n قاله البيضاوي\n وقال الثعلبي: فيه تقديم تأخير، أي إن آمنتم وشكرتم، لأن الشكر لا ينفع مع عدم الإيمان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:33",
      "similarity": 0.5124081907291184
    },
    {
      "verse": "33:17",
      "similarity": 0.499722562722093
    },
    {
      "verse": "5:67",
      "similarity": 0.49023939996633037
    },
    {
      "verse": "3:101",
      "similarity": 0.4733468654623728
    },
    {
      "verse": "4:175",
      "similarity": 0.46561699278817686
    }
  ]
}