{
  "chapter": "النساء",
  "text": "ان الذين يكفرون بالله ورسله ويريدون ان يفرقوا۟ بين الله ورسله ويقولون نؤمن ببعض ونكفر ببعض ويريدون ان يتخذوا۟ بين ذلك سبيلا",
  "translations": [
    {
      "translation": "Those who reject Allah and His Messengers and desire to cause division between Allah and His",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe not in God and His apostles, and desire to differentiate between God and His messengers, and say: \"We believe in some and not in the others,\" and wish to find a way (between affirmation and denial),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are those who disbelieve in Allah and His Messengers and seek to differentiate between Allah and His Messengers, and say: 'We believe in some and deny others, and seek to strike a way between the two.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve in God and His Messengers try to create differences between God and His Messengers (by rejecting their message). They say, \"We believe in some but not in others.\" Thus, they try to find a middle way\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve in Allah and His Noble Messengers, and seek to cause division between Allah and His Noble Messengers, and say, “We believe in some and disbelieve in others,” and wish to choose a way between faith and disbelief; –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve in Allah and His Messengers and wish to make distinction between Allah and His Messengers saying, \"We believe in some but reject others,\" and wish to adopt a way in between.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who disbelieve in Allah and His apostles and (those who) desire to make a distinction between Allah and His apostles and say: We believe in some and disbelieve in others, and desire to take a course between (this and) that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve in God and His Messengers and desire to make division between God and His Messengers, and say, 'We believe in part, and disbelieve in part,' desiring to take between this and that a way --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who disbelieve in Allah and His messengers, and seek to make distinction between Allah and His messengers, and say: We believe in some and disbelieve in others, and seek to choose a way in between;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny God and His messengers and seek to make a distinction between God and His messengers and say, \"We believe in some messengers and disbelieve in others\", and desire to adopt a position in between.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who disbelieve in Allah and His apostles, and would differentiate between Allah, and His apostles, and say: some we believe in and others we deny; and they would take a way in between this and that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve in Allah and His apostles and seek to separate Allah from His apostles, and say, ‘We believe in some and disbelieve in some’ and seek to take a way in between\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny Allah and His messengers, and (those who) wish to separate Allah from His messengers, saying: \"We believe in some but reject others\": And (those who) wish to take a course midway,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve in Allah and His Messengers and wish to make distinction between Allah and His Messengers (by believing in Allah and disbelieving in His Messengers) saying, \"We believe in some but reject others,\" and wish to adopt a way in between.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve in Allah and His Messengers, and desire to divide between Allah and His Messengers (by believing in Him without them), and say, 'We believe in some (Prophets Moses and Jesus), and disbelieve in some of them (such as Prophet Muhammad)' desiring to take between this (and that) a way (between belief and disbelief)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve in God and His messengers, and want to separate between God and His messengers, and say, “We believe in some, and reject some,” and wish to take a path in between.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who disbelieve in Allah and His messengers and wish to discriminate between Allah and His messengers and say, \"We believe in some and disbelieve in others,\" and wish to adopt a way in between -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:150] Those who disbelieve in God and His messengers and seek to divide between God and His messengers, by believing in Him but not in them, and say, ‘We believe in some, of the messengers, and disbelieve in some’, of the others, and seek to adopt a way, a path, to follow, between them, [between] unbelief and belief.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who disbelieve in Allah and His messengers) meaning Ka'b and his followers, (and seek to make distinction between Allah and His messengers) with regard to prophethood and surrender to Allah, (and say: We believe in some) Scriptures and messengers (and disbelieve in others) in other scriptures and 106 messengers, (and seek to choose a way) a religion (in between) between disbelief and faith;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه { إِنَّ ٱلَّذِينَ يَكْفُرُونَ بِٱللَّهِ } ويشركون له بإثبات الوجود لغيره { وَرُسُلِهِ } أي: يكفرون برسله، ويكذبونهم مع كونهم مبعوثين على الحق من عنده { وَ } مع كفرهم وتكذيبهم { يُرِيدُونَ أَن يُفَرِّقُواْ بَيْنَ ٱللَّهِ } المتوحد، المتفرد بذاته، المستقبل في وجوده { وَرُسُلِهِ } المستخلفين من عنده بظهوره عليهم بجميع أسمائه وصفاته { وَيقُولُونَ } من غاية جهلهم بظهور الله، واستيلائه على مظاهرة: { نُؤْمِنُ بِبَعْضٍ } من الرسل { وَنَكْفُرُ بِبَعْضٍ } آخر، مع أن ظهوره في الكل على السواء بلا تفاوت { وَيُرِيدُونَ } وتوهمون { أَن يَتَّخِذُواْ } ويثبتوا { بَيْنَ ذٰلِكَ } أي: ارتباط الظاهر بالمظهر والمظهر بالظاهر { سَبِيلاً } [النساء: 150] غير سبيل لاحق المطابق للواقع\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:47",
      "similarity": 0.42879073838792464
    },
    {
      "verse": "77:4",
      "similarity": 0.4038252962091943
    },
    {
      "verse": "98:4",
      "similarity": 0.3896118281438676
    },
    {
      "verse": "24:48",
      "similarity": 0.38155730506607544
    },
    {
      "verse": "23:109",
      "similarity": 0.3730784012827884
    }
  ]
}