{
  "chapter": "النساء",
  "text": "ورفعنا فوقهم الطور بميثقهم وقلنا لهم ادخلوا۟ الباب سجدا وقلنا لهم لا تعدوا۟ فى السبت واخذنا منهم ميثقا غليظا",
  "translations": [
    {
      "translation": "We lifted up the Mount above their heads in accordance with the covenant they had made, and We said to them, 'Enter the gate prostrating,' and We said to them, 'Do not break the Sabbath,' and We made a binding covenant with them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We exalted them on the Mount, and they gave a solemn pledge, and We said to them: \"Enter the gates submissively,\" and told them: \"Do not break the Sabbath,\" and took a solemn pledge from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We raised the Mount high above them and took from them a covenant (to obey the commandment), and ordered them: 'Enter the gate in the state of prostration.' And We said to them: 'Do not violate the law of the Sabbath', and took from them a firm covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We raised Mount (Sinai) above them because of Our solemn promise to them. Also, We told them to prostrate themselves when entering the gate (of the holy house) and not to commit transgression on the Sabbath. We made a solemn covenant with them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We then raised the mount (Sinai) above them to take a covenant from them and decreed them that, “Enter the gate while prostrating” and decreed them that, “Do not cross the limits of the Sabbath,” and We took from them a firm covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for their covenant, We raised over them the mount and (on the other occasion) We said: \"Enter the gate prostrating (or bowing) with humility;\" and We commanded them: \"Transgress not on the Sabbath (Saturday).\" And We took from them a firm covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We lifted the mountain (Sainai) over them at (the taking of the covenant) and We said to them: Enter the door making obeisance; and We said to them: Do not exceed the limits of the Sabbath, and We made with them a firm covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We raised above them the Mount, taking compact with them; and We said to them, 'Enter in at the gate, prostrating'; and We said to them, 'Transgress not the Sabbath'; and We took from them a solemn compact.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We caused the Mount to tower above them at (the taking of) their covenant: and We bade them: Enter the gate, prostrate! and We bode them: Transgress not the Sabbath! and We took from them a firm covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We raised above them the Mount, while making a covenant with them, and We said to them. \"Enter the gate humbly,\" and We also commanded them, \"Transgress not in the matter of the Sabbath.\" We took from them a firm covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We raised the Mount over them for their bond. And We said unto them: enter the portal prostrating yourselves. And We said unto them: transgress not in the matter of the Sabbath and We took from them a firm bond.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We raised the Mount above them for the sake of their covenant, and We said to them, ‘Enter the gate prostrating’ and We said to them, ‘Do not violate the Sabbath,’ and We took from them a solemn covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for their covenant we raised over them (the towering height) of Mount (Sinai); and (on another occasion) we said: \"Enter the gate with humility\"; and (once again) we commanded them: \"Transgress not in the matter of the sabbath.\" And we took from them a solemn covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for their covenant, We raised over them the Mount and (on the other occasion) We said: \"Enter the gate prostrating (or bowing) with humility;\" and We commanded them: \"Transgress not (by doing worldly works on) the Sabbath (Saturday).\" And We took from them a firm covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We raised the Mount above them, and took covenant with them, and We said: 'Enter in at the gate, prostrating', and We said to them, 'Do not transgress the Sabbath', and We took from them a solemn covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We raised the Mount above them in accordance with their covenant, and We said to them, “Enter the gate humbly”, and We said to them, “Do not violate the Sabbath”, and We received from them a solemn pledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We raised over them the mount for [refusal of] their covenant; and We said to them, \"Enter the gate bowing humbly\", and We said to them, \"Do not transgress on the sabbath\", and We took from them a solemn covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:154] And We raised above them the Mount, by the covenant with them, that is, on account of the covenant made with them, that they might fear, and so they accepted it; and We said to them, while it cast a shadow [hovering] above them: ‘Enter the gate, the gate of the town, bowing’; and We said to them, ‘Transgress not (a variant reading [of lā ta‘dū] is lā ta‘addū, where the original tā’ [of lā tata‘addū] is assimilated with the dāl, in other words [it is similar in meaning to] lā ta‘tadū, ‘do not act unjustly [in]’) the Sabbath’, by fishing during it, and We took from them a firm covenant, over this, but they broke it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We caused the Mount to tower above them) We uprooted and fixed the Mount above them (at (the taking of) their covenant: and We bade them: Enter the gate) the gate of Jericho, (prostrate!) bowing down (and we bade them: Transgress not the Sabbath!) by taking the fish (and We took from them a firm covenant) regarding Muhammad (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَرَفَعْنَا فَوْقَهُمُ ٱلطُّورَ } معناهُ الجَبلُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"We have raised the mountain above them\" - this means the mountain.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } ذلك أن { رَفَعْنَا فَوْقَهُمُ ٱلطُّورَ } معلقاً { بِمِيثَاقِهِمْ } بسبب أن نأخذ منهم العهد الوثيق\n إذ جاءوا به أزلنا عنهم\n وإن أبوا أسقطنا عليهم { وَقُلْنَا لَهُمُ } أيضاً بعدما أخذنا الميثاق عنهم على لسان موسى عليه السلام: { ٱدْخُلُواْ ٱلْبَابَ } أي: البيت المقدس { سُجَّداً } حال كونكم ساجدين\n واضعين جباهكم على تراب المذلة\n فدخلوا مسرعين ومزحفين\n فنقضوا { وَقُلْنَا لَهُمْ } أيضاً ميثاقاً ومعادة على لسان داود عليه السلام: { لاَ تَعْدُواْ } لا تجاوزوا\n ولا تخرجوا عن حدٍّ\n ولا سيما { فِي ٱلسَّبْتِ } أي: اصطياد الحيتان فيه\n فاحتالوا في اصطيادها\n فنقضوا ما عهدوا { وَ } بعدما { أَخَذْنَا مِنْهُمْ مِّيثَاقاً غَلِيظاً } [النساء: 154] أي: مواثيق غلاظ على إرادة الجنس\n فنقضوا الكل\n وخالفوا الأمر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: من قرأ: { لا تعدوا } بالسكون\n فماضيه: عدا\n ومن قرأ بتشدد الدال\n فماضيه اعتَدى\n وأصله: لا تعتدوا\n فنُقلت حركة التاء إلى العين وأُدغمت التاء في الدال\n ومن قرأ بالاختلاس أشار إلى الأصل\n يقول الحقّ جلّ جلاله: { يسألك أهل الكتاب } \n وهم أحبار اليهود\n { أن تنزل عليهم كتابًا من السماء } جملة واحدة\n كما نزل التوراة\n أو كتابًا بخطَّ سماوي على ألواح كما كانت التوراة\n والسائل هو كعب بن الأشرف وفنحاص بن عازوراء وغيرهم\n قالوا للنبي صلى الله عليه وسلم:  إن كنت نبيًا فأتنا بكتاب من السماء جملةً\n كما أتى به موسى\n قال تعالى في الرد عليهم: { فقد سألوا موسى أكبر من ذلك } وهو رؤية ذات الحقّ ـ تعالى ـ جهرًا حسًا\n والمعنى: إن استعظمت ما سألوا منك فقد وقع منهم ما هو أعظم من ذلك\n وهذا السؤال\n وإن كان من آبائهم\n أُسند إليهم لأنهم كانوا آخذين بمذهبهم تابعين لهديهم\n فما اقترحوا عليكم ليس بأول جهالاتهم وتشغيبهم بل عُرفُهُم راسخٌ في ذلك\n فلا تستغرب ما وقع منهم\n ثم فسر سؤالهم بقوله: { فقالوا أرنا الله جهرة } أي: عيانًا في الحس\n { فأخذتهم الصاعقة } \n بأن جاءت نار من السماء فأهلكتهم\n فماتوا ثم بُعثوا بدعوة موسى عليه السلام وذلك بسبب ظلمهم\n وهو تعنتهم وسؤالهم لما أستحيل في تلك الحال التي كانوا عليها\n وذلك لا يقتضي امتناع الرؤية مطلقًا\n وسيأتي في الإشارة تحرير ذلك\n { ثم اتخذوا العجل من بعد ما جاءتهم البينات } على وحدانيته تعالى\n وهذه جناية أخرى اقترفها أيضًا أوائلهم\n { فعفونا عن ذلك } حيث تابوا\n ولم نعاجلهم بالعقوبة\n { وأتينا موسى سلطانًا مبينًا } أي: تسلطًا ظاهرًا عليهم\n حين أمرهم أن يقتلوا أنفسهم\n توبة من اتخاذهم العجل إلهًا\n وحجة واضحة على نبوته كالآيات التسع\n { ورفعنا فوقهم الطور } حيث امتنعوا من قبول أحكام التوراة\n بسبب ميثاقهم الذي أخذناه عليهم\n وهو التزام أحكام التوراة\n وقلنا لهم على لسان موسى: { ادخلوا الباب سجّدًا } أي: باب بيت المقدس\n فدخلوا يزحفون على استاههم عنادًا واستهزاءً\n وقلنا لهم: { لا تعدوا في السبت } على لسان داود عليه السلام\n فاعتدوا فيه بالاصطياد\n فمسخناهم قردةً وخنازير\n { وأخذنا منهم ميثاقًا غليظًا } على ذلك كله\n فنقضوا جميع ذلك\n أو ميثاقًا غليظًا في التوراة لئن أدركوك ليؤمنن بك\n وليبينن صفتك للناس\n فنقضوا وكتموا\n والله تعالى أعلم\n الإشارة: اقتراح الآيات وطلب الكرامات من الأولياء\n سنة ماضية\n لأنهم على قدم الأنبياء ـ عليهم السلام ـ ما يقال لهم إلا ما قيل للأنبياء قبلهم\n فلا تكاد تجد أحدًا يصدق بولي حتى تظهر عليه الكرامة\n وهو جهل كبير لأن الكرامة قد تظهر على من لم تكمل له استقامة\n وقد تكون استدراجًا ومكرًا\n\nوأيُّ كرامة أعظم من العلوم اللدنية والأخلاق النبوية؟ كما قال شيخنا رضي الله عنه\n وقد ظهرت الكرامات على المتقدمين ولم ينقطع الإنكار عليهم\n واعلم أن طلب الرؤية في الدنيا ليس بممتنع\n وإنما عاقب الله بني إسرائيل على طلبها لأنهم طلبوها قبل إبانها\n طلبوها من غير اتصاف بشروط حصولها\n وهو كمال التهذيب والتطهير من دنس الحس\n فمن كمل تهذيبه وتحقق تطهيره حصل له شهود الحق\n حتى لو كلف أن يشهد غيره لم يستطع\n وذلك حين تستولي البصيرة على البصر\n فيشهد البصر ما كانت تشهده البصيرة\n وذلك بعد كمال فتحها\n ولذلك قال في الحِكَم: \" شعاعُ البصيرة يُشهدك قربَ الحق منك\n وعين البصيرة يشهدك عدمك لوجوده\n وحق البصيرة يشهدك وجود الحق \"\n\n\n الخ كلامه\n وهذه المشاهدة لا تحصل إلا لمن اتصل بشيخ التربية\n وإلا فلا مطمع فيها\n والله تعالى أعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:63",
      "similarity": 0.5252952521685005
    },
    {
      "verse": "2:93",
      "similarity": 0.46083931951103435
    },
    {
      "verse": "16:124",
      "similarity": 0.4386604530154288
    },
    {
      "verse": "78:9",
      "similarity": 0.3849238330431547
    },
    {
      "verse": "25:47",
      "similarity": 0.33145251331196945
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/4:154.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/4:154.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:154.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}