{
  "chapter": "النساء",
  "text": "والذين ءامنوا۟ بالله ورسله ولم يفرقوا۟ بين احد منهم او۟لئك سوف يؤتيهم اجورهم وكان الله غفورا رحيما",
  "translations": [
    {
      "translation": "But those who believe in God and His apostles and make no distinction among any of them, will be given by Him their recompense; for God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who believe in Allah and His Messengers, and do not differentiate between them, We shall certainly give them their reward. Allah is All-Forgiving, All-Compassionate\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe in God and make no distinction between His Messengers, they will receive His reward. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe in Allah and all His Noble Messengers and do not make any distinction in belief between any of them – to them Allah will soon give them their reward; and Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe in Allah and His Messengers and make no distinction between any of them (Messengers), We shall give them their rewards; and Allah is Ever Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe in Allah and His apostles and do not make a distinction between any of them-- Allah will grant them their rewards; and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe in God and His Messengers and make no division between any of them, those -- We shall surely give them their wages; God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe in Allah and His messengers and make no distinction between any of them, unto them Allah will give their wages; and Allah was ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those who believe in God and His messengers, and make no distinction between any of them, to those -- We shall surely give them their rewards. God is most forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe in Allah and His apostles and differentiate not between any of them, anon We shall give them their hire; and Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who have faith in Allah and His apostles and make no distinction between any of them—them He will soon give their rewards, and Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those who believe in Allah and His messengers and make no distinction between any of the messengers, we shall soon give their (due) rewards: for Allah is Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe in Allah and His Messengers and make no distinction between any of them (Messengers), We shall give them their rewards, and Allah is Ever Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe in Allah, and His Messengers and do not divide between any of them; to those, We shall surely give them their wages. Allah is the Forgiver, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe in God and His messengers, and make no distinction between any of them—He will give them their rewards. God is Forgiver and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they who believe in Allah and His messengers and do not discriminate between any of them - to those He is going to give their rewards. And ever is Allah Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:152] And those who believe in God and, all of, His messengers and do not seek to divide between any of them, those — We shall surely give them (nu’tīhim, also read yu’tīhim, ‘He shall surely give them’) their wages, the reward for their deeds. God is ever Forgiving, to His friends, Merciful, to those who obey Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But those who believe in Allah and His messengers) i.e. 'Abdullah Ibn Salam and his followers (and make no distinction between any of them) between the messengers and Allah as far as prophethood and Surrender to Allah are concerned, (unto them Allah will give their wages) their reward in the Hereafter; (and Allah was ever Forgiving) of any one of them who dies, (Merciful) towards anyone who dies in a state of repentance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ آمَنُواْ بِٱللَّهِ } المتفرد في الوجود { وَ } اعترفوا بظهوره في { رُسُلِهِ } بجميع أوصافه وأسمائه { وَلَمْ يُفَرِّقُواْ بَيْنَ أَحَدٍ مِّنْهُمْ } بالإيمان والكفر، بل يؤمنوا بجميعهم على السوية { أُوْلَـٰئِكَ } السعداء، الموفقون بهذه الكرامة في هذه النشأة { سَوْفَ يُؤْتِيهِمْ } تفضلاً عليهم في النشأة الأخرى { أُجُورَهُمْ } بأضعاف ما استحقوا عليه { وَ } لا تستبعدوا من الله أمثال هذا؛ إذ { كَانَ ٱللَّهُ } الموفق لهم على الهداية { غَفُوراً } لذنوبهم المبعدة عن طريق توحيده { رَّحِيماً } [النساء: 152] لهم، يوصلهم إلى ما عينٌ رأت، ولا أذنٌ سمعت، ولا خطر على قلب بشر\n\n\n\n\nهب لنا من لدنك رحمة، إنك أنت الوهاب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { بين }: من الأمور النسبية، فلا بد أن تدخل على متعدد، تقول جلست بين فلان وفلان، وإنما دخلت هنا على { أحد } لأنه يقتضي متعددًا لعمومه، لانه رفع في سياق النفي\n قاله البيضاوي\n يقول الحقّ جلّ جلاله: { والذين آمنوا بالله } وما يجب له من الكمالات، { ورسله } وما يجب لهم كذلك، { ولم يُفرقوا بين أحد منهم } بأن آمنوا بجميعهم، وصدقوا بكل ما جاؤوا به من عند ربهم، { أولئك سوف نؤتيهم أجورهم } الموعودة لهم، بأن نُجِلَّ مقدارهم، ونرفع مقامهم، ونُبوئهم في جنات النعيم\n وتصديره بسوف لتأكيد الوعد والدلالة على أنه كائن لا محالة وإن تأخر وقته، ولمًا كان العبد لا يخلوا من نقص، رفع الخوف عنهم بقوله: { وكان الله غفورًا } لما فرط منهم { رحيمًا } بهم بتضعيف حسناتهم\n الإشارة: والذين صدقوا بأولياء الله، وعظموا جميعهم، واقتبسوا من أنوارهم كلهم، أولئك سوف نؤتيهم أجورهم، بأن أُنعمهم في جنات المعارف في دار الدنيا، فإن ماتوا أسكنَّاهم في الفراذيس العُلَى\n",
      "translations": []
    }
  ]
}