{
  "chapter": "النساء",
  "text": "فبما نقضهم ميثقهم وكفرهم بـايت الله وقتلهم الانۢبياء بغير حق وقولهم قلوبنا غلفۢ بل طبع الله عليها بكفرهم فلا يؤمنون الا قليلا",
  "translations": [
    {
      "translation": "Because of the fact that they broke their covenant, and rejected Allah's Signs, and killed the Prophets without any right to do so and said, 'Our hearts are uncircumcised,' Allah has stamped them with kufr, so they do not have iman except for very few.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So (they were punished) for breaking the covenant and disbelieving the signs of God, and for killing the prophets unjustly, and saying: \"Our hearts are enfolded in covers,\" (though) in fact God had sealed them because of their unbelief; so they do not believe except a few;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They have incurred Allah's wrath) for their breaking the covenant, and their rejection of the signs of Allah, and for slaying Prophets without right, and for saying: 'Our hearts are wrapped up in covers' -even though in fact Allah has sealed their hearts because of their unbelief, so that they scarcely believe\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, because of their disbelief, disregard of their covenant, denial of God's revelations, murdering the Prophets without reason, and their saying that their hearts were covered, We sealed up their hearts. Only a few of them believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah cursed them because of their constantly breaking their covenant – and they disbelieved in the signs of Allah, and they used to wrongfully martyr the Prophets, and because they said, “Our hearts are covered”; in fact Allah has set a seal upon their hearts due to their disbelief, so that they do not accept faith, except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of their breaking the covenant, and their rejecting the Ayat of Allah, and their killing the Prophets unjustly, and their saying: \"Our hearts are Ghulf,\" nay, Allah has set a seal upon their hearts because of their disbelief, so they believe not but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, for their breaking their covenant and their disbelief in the communications of Allah and their killing the prophets wrongfully and their saying: Our hearts are covered; nay! Allah set a seal upon them owing to their unbelief, so they shall not believe except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, for their breaking the compact, and disbelieving in the signs of God, and slaying the Prophets without right, and for their saying, 'Our hearts are uncircumcised' -- nay, but God sealed them for their unbelief, so they believe not, except a few --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then because of their breaking of their covenant, and their disbelieving in the revelations of Allah, and their slaying of the prophets wrongfully, and their saying: Our hearts are hardened - Nay, but Allah set a seal upon them for their disbelief, so that they believe not save a few -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they broke their covenant; and they rejected the signs of God; and put the prophets to death without justification, and said, \"Our hearts are sealed.\" It is God who has sealed their hearts, on account of their denial of the truth. Except for a few of them, they have no faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Accursed are they then for their breach of the bond and their rejecting the commandments of Allah and their slaying the prophets without justification, and their saying: our hearts are uncircumcised. Aye! Allah hath set a seal upon them for their infidelity, wherefore they believe not but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then because of their breaking their covenant, their defiance of Allah’s signs, their killing of the prophets unjustly and for their saying, ‘Our hearts are uncircumcised’… Indeed, Allah has set a seal on them for their unfaith, so they do not have faith except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They have incurred divine displeasure): In that they broke their covenant; that they rejected the signs of Allah; that they slew the Messengers in defiance of right; that they said, \"Our hearts are the wrappings (which preserve Allah's Word; We need no more)\";- Nay, Allah hath set the seal on their hearts for their blasphemy, and little is it they believe;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of their breaking the covenant, and of their rejecting the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah, and of their killing the Prophets unjustly, and of their saying: \"Our hearts are wrapped (with coverings, i.e. we do not understand what the Messengers say)\" - nay, Allah has set a seal upon their hearts because of their disbelief, so they believe not but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, for their breaking of the covenant, and disbelieving the verses of Allah, and killing their Prophets without right and for saying, 'Our hearts are covered' no, but Allah has sealed them for their disbelief, so, except for a few, they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for their violation of their covenant, and their denial of God’s revelations, and their killing of the prophets unjustly, and their saying, “Our minds are closed.” In fact, God has sealed them for their disbelief, so they do not believe, except for a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [We cursed them] for their breaking of the covenant and their disbelief in the signs of Allah and their killing of the prophets without right and their saying, \"Our hearts are wrapped\". Rather, Allah has sealed them because of their disbelief, so they believe not, except for a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:155] So, for their breaking (fa-bi-mā naqdihim: the mā is extra; the bā’ is causative and connected to a missing element [such as sabab, ‘reason’], in other words [it should be understood as] la‘annāhum bi-sabab naqdihim, ‘We cursed them for the reason of their breaking’) their covenant and disbelieving in the signs of God, and slaying the prophets wrongfully, and for their saying, to the Prophet (s): ‘Our hearts are covered up’, and cannot grasp what you say — nay, but God sealed them for their disbelief, and so they cannot heed any admonition; so they do not believe, except for a few, among them, like ‘Abd Allāh b. Salām and his companions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then because of their breaking of their covenant) We did with them that which We have done, (and their disbelieving in the revelations of Allah) and due to their disbelief in Muhammad and the Qur'an the capitation tax was imposed on them, (and their slaying) and because of their slaying (of the Prophets wrongfully) without any right, We destroyed them, (and their saying) and because of their saying: (Our hearts are hardened) our hearts can absorb any kind of knowledge but we cannot understand what you say and the knowledge you have brought (Nay, but Allah hath set a seal upon them) in fact, it is not as they say, but Allah has set a seal on their hearts (for their disbelief) in Muhammad and the Qur'an, (so that they believe not) in Muhammad and the Qur'an (save a few) 'Abdullah Ibn Salam and his followers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { طَبَعَ ٱللَّهُ عَلَيْهَا } معناهُ خَتَمَ عليهَا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَبِمَا نَقْضِهِم مِّيثَاقَهُمْ } فبنقضهم المواثيق الغلاظ والعهود المؤكدة، فعلنا بهم ما فعلنا من الابتلاءات والاختبارات، وتحريم المباحثات وأنواع البليات والأذيات { وَكُفْرِهِم بَآيَاتِ ٱللَّهِ } الدالة على توحيده، والمنزل على خلَّص عبيده { وَقَتْلِهِمُ ٱلأَنْبِيَآءَ } المعصومين عن الجرائم مطلقاً { بِغَيْرِ حَقٍّ } بلا رخصةٍ شرعيةٍ { وَقَوْلِهِمْ } للأنبياء والرسل حين دعتهم للإيمان عتوّاً واستكباراً: { قُلُوبُنَا غُلْفٌ } أوعية مملوءة بالحقائق والمعارف مختومة، لا يسع فيها ما جئتم به، والحال أنهم ليس في قلوبهم ما يتعلق بأمور الدين مقدار خردلةٍ { بَلْ طَبَعَ ٱللَّهُ عَلَيْهَا } باسمه المضل، المذل، وختم عليها { بِكُفْرِهِمْ } أي: بسبب كفرهم وشركهم { فَلاَ يُؤْمِنُونَ } فلا يفقون على الإيمان منهم { إِلاَّ قَلِيلاً } [النساء: 155]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { فبما }: صلة زيدت للتأكيد، و { نقضهم }: مصدر مجرور بالباء، وهي متعلقة بالفعل المحذوف، أي: بسبب نقضهم فَعَلنا بهم ما فعلنا، أو بقوله: { حرَمنا عليهم } ، ويكون { فبظلم } على هذا بدلاً من قوله: { فبما نقضهم } ، فيكون التحريم بسبب النقض، وما عطف عليه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:88",
      "similarity": 0.7837727593903933
    },
    {
      "verse": "13:20",
      "similarity": 0.29752952215016804
    },
    {
      "verse": "2:27",
      "similarity": 0.2548995858633621
    },
    {
      "verse": "13:25",
      "similarity": 0.247020028614463
    },
    {
      "verse": "94:3",
      "similarity": 0.23855856570311393
    }
  ]
}