{
  "chapter": "النساء",
  "text": "والتى ياتين الفحشة من نسائكم فاستشهدوا۟ عليهن اربعة منكم فان شهدوا۟ فامسكوهن فى البيوت حتى يتوفىهن الموت او يجعل الله لهن سبيلا",
  "translations": [
    {
      "translation": "If any of your women commit fornication, four of you must be witnesses against them. If they bear witness, detain them in their homes until death releases them or Allah ordains another procedure for their case.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of your women is guilty of unnatural offence, bring four of your witnesses to give evidence; if they testify against them, retain them in the houses until death overtakes them or God provides some other way for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those of your women who are guilty of immoral conduct, call upon four from amongst you to bear witness against them. And if four men do bear witness, confine those women to their houses until either death takes them away or Allah opens some way for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of your women who commit fornication, let four (Muslim) witness testify to their act. If there is sufficient testimony, confine them to their homes until they die, or until God provides a way for their freedom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And take testimony from four chosen men amongst you, against the women among you who commit adultery; and if they testify, confine those women in the houses until death takes them away or Allah creates a solution for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those of your women who commit illegal sexual intercourse, take the evidence of four witnesses from among you against them; and if they testify, confine them (i.e. women) to houses until death comes to them or Allah ordains for them some (other) way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who are guilty of an indecency from among your women, call to witnesses against them four (witnesses) from among you; then if they bear witness confine them to the houses until death takes them away or Allah opens some way for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such of your women as commit indecency, call four of you to witness against them; and if they witness, then detain them in their houses until death takes them or God appoints for them a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those of your women who are guilty of lewdness, call to witness four of you against them. And if they testify (to the truth of the allegation) then confine them to the houses until death take them or (until) Allah appoint for them a way (through new legislation).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of your women commit fornication, call in four male witnesses from among yourselves against them; if they testify to their guilt, confine them to the house until death releases them or until God gives them another way out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those of your women who may commit whoredom, call against them four witnesses from among them if they testify, confine you them to their houses till death complete their turn of life, or Allah appoint for them some other way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should any of your women commit an indecent act, produce against them four witnesses from yourselves, and if they testify, detain them in [their] houses until death finishes them, or Allah decrees a course for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of your women are guilty of lewdness, Take the evidence of four (Reliable) witnesses from amongst you against them; and if they testify, confine them to houses until death do claim them, or Allah ordain for them some (other) way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those of your women who commit illegal sexual intercourse, take the evidence of four witnesses from amongst you against them; and if they testify, confine them (i.e. women) to houses until death comes to them or Allah ordains for them some (other) way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of your women commit indecency, call in four witnesses from among yourselves against them, if they testify, confine them to their houses till death overtakes them or till Allah makes for them a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of your women who commit lewdness, you must have four witnesses against them, from among you. If they testify, confine them to the homes until death claims them, or God makes a way for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who commit unlawful sexual intercourse of your women - bring against them four [witnesses] from among you. And if they testify, confine the guilty women to houses until death takes them or Allah ordains for them [another] way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:15]   As for those of your women who commit lewdness, adultery, call four, Muslim men, of you to witness against them; and if they witness, against them such [lewdness], then detain them in their houses, and prevent them from mixing with people, until, the angels of, death take them or, until, God appoints for them a way, out of it. This was stipulated for them at the very beginning of Islam, but then a way out was appointed for them through [the stipulation] that the virgin should receive a hundred lashes and be banished for a year, and the married woman be stoned. The prescribed punishment was explained thus in the hadīth, ‘Come listen to me! Come listen to me! God has now made a way out for them’, as reported by Muslim.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(As for those of your women) your free, married women (who are guilty of lewdness) i.e. of fornication, (call to witness) that they were caught red-handed in the act (four of you against them) four of your free men. (And if they testify) to the Truth of the allegation (then confine them to the houses) keep them in prison (until death take them) until they die in prison (or (until) Allah appoint for them a way) out by means of stoning. Imprisoning a free, married woman who commits fornication until she dies in prison was later abrogated by stoning.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱللاَّتِي يَأْتِينَ ٱلْفَٰحِشَةَ } الفعلة القبيحة التي هي الزنا\n وهن { مِن نِّسَآئِكُمْ } وفي حجركم ونكاحكم\n فأُخبرتم بها - العياذ بالله - فعليكم في تلك الحالة ألاَّ تبادروا إلى رميها ورجمها\n بل { فَٱسْتَشْهِدُواْ } اطلبوا الشهداء من المخبر\n ليشهدوا { عَلَيْهِنَّ } بالزنا\n والمعتبر أن يكون { أَرْبَعةً مِّنْكُمْ } أي: من عدول\n رجالكم\n بشرط ألاَّ يسبق منهم تحبسس وترقب\n بل وقع منهم النظر بغتة على سبيل الاتفاق\n فيرون ما يرون\n كالميل في المكحلة\n مستكرهين\n مستعجبين\n\n\n{ فَإِن شَهِدُواْ } هؤلاء الشهود على الوجه المعهود\n فعليكم أيها المؤمنون\n المستحفظون لحدود الله ألاَّ تضطروا\n ولا تستعجلوا في مقتهنَّ وإخراجهنَّ\n بل عليكم الإمساك { فَأَمْسِكُوهُنَّ فِي ٱلْبُيُوتِ } التي أنتم فيها بلا مراودة إليهن\n كيلا يلحق عليكم بالإخراج عار آخر\n بل اتركوهن فيها { حَتَّىٰ يَتَوَفَّاهُنَّ ٱلْمَوْتُ } الطبيعي { أَوْ يَجْعَلَ ٱللَّهُ } أي: يحكم الله { لَهُنَّ } أي: في حقهن { سَبِيلاً } [النساء: 15] حكماً مبرماً\n هذا في بدء الإسلام\n ثم نُسخ بآية الرجم والجلد\n\n\n{ وَٱللَّذَانِ يَأْتِيَانِهَا } أي: الفعلة القبيحة التي هي اللواطة\n وهما الآتي والمأتي { مِنكُمْ } أيها الرجال وهذا أفحش من الزنا\n لخروج كلٍّ منهما عن حد الله\n وانحطاطهما عن كمال الإنسان\n لارتكابهما شئاً لا يقتضيه العقل والشرع بخلاف الزن\n ولشناعها وخباثتها لم يعيِّن لها سبحانه حداً في كتابه المبيِّن لأخلاق الإنسان\n كأن هؤلاء ليسوا من الإنسان\n بل من البهائم\n بل أسوأ حالاً منها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { و } النساء { اللاتي يأتين الفاحشة } أي: الزنى\n سُمِّيَ فاحشة لفُحش قبحه وبشاعة فعله شرعًا\n { من نسائكم } المسلمات\n { فاستشهدوا عليهن } أي: اطلبوا مَنْ رَمَاهُنَّ بذلك أن يُشْهِدوا { عليهن أربعة منكم } \n أي: من عدول المؤمنين يرونهما كالمرود في المكحلة\n وإنما جعلوا أربعة مبالغة في الستر على المؤمن\n أو ليكون على كل حال واحد اثنان\n { فإن شهدوا } عليهن بذلك { فأمسكوهن في البيوت } \n واجعلوه سجنًا لهن { حتى يتوفاهن الموت } أي: يستوفي أجلّهن الموتُ\n أو يتوفاهن ملك الموت\n { أو يجعل الله لهن سبيلاً } كتعيين الحد المخلّص من السجن\n وكان هذا في أول الإسلام ثم نُسخ بما في سورة النور من الحدود\n ويحتمل أن يراد التوصية بإمساكهن بعد أن يُجلدن كي لا يَعُدْن إلى الزنى بسبب الخروج والتعرض للرجال\n واكتفى بذكر حدِّهن\n بما في سورة النور\n وهذا الإمساك كان خاصًا بالنساء بدليل قوله { واللذان يأتيانها منكم } أي: الزاني والزانية منكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:30",
      "similarity": 0.3716442405386904
    },
    {
      "verse": "24:13",
      "similarity": 0.36995573782401736
    },
    {
      "verse": "2:169",
      "similarity": 0.3146609439184711
    },
    {
      "verse": "43:21",
      "similarity": 0.3077711987987279
    },
    {
      "verse": "7:28",
      "similarity": 0.2887050157076708
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/4:15.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/4:15.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:15.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}