{
  "chapter": "النساء",
  "text": "وان من اهل الكتب الا ليؤمنن به قبل موته ويوم القيمة يكون عليهم شهيدا",
  "translations": [
    {
      "translation": "There is not one of the People of the Book who will not believe in him before he dies; and on the Day of Rising he will be a witness against them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not one among the people of the Book who will not believe in it before his death; and he will be a witness over them on the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are none among the People of the Book but will believe in him before his death, and he will be a witness against them on the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will be no one among the People of the Book who will not believe (a belief of no value) in him (Jesus) before their deaths. On the Day of Judgment, (Jesus) will testify against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not one of the People given the Book(s), who will not believe in him (Eisa) before his death; and on the Day of Resurrection he will be a witness against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is none of the People of the Scripture, but must believe in him, before his death. And on the Day of Resurrection, he will be a witness against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is not one of the followers of the Book but most certainly believes in this before his death, and on the day of resurrection he (Isa) shall be a witness against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not one of the People of the Book but will assuredly believe in him before his death, and on the Resurrection Day he will be a witness against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not one of the People of the Scripture but will believe in him before his death, and on the Day of Resurrection he will be a witness against them -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is none among the People of the Book but will believe in it before his death; and on the Day of Resurrection he shall be a witness against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is none among the people of the Book but shall surely believe in him before his death, and on the Day of Judgement he shall be a witness against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is none among the People of the Book but will surely believe in him before his death; and on the Day of Resurrection, he will be a witness against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is none of the People of the Book but must believe in him before his death; and on the Day of Judgment he will be a witness against them;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is none of the people of the Scripture (Jews and Christians), but must believe in him ['Iesa (Jesus), son of Maryam (Mary), as only a Messenger of Allah and a human being], before his ['Iesa (Jesus) or a Jew's or a Christian's] death (at the time of the appearance of the angel of death). And on the Day of Resurrection, he ['Iesa (Jesus)] will be a witness against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not one of the People of the Book but will surely believe in him (Prophet Jesus) before his death, and on the Day of Resurrection he will be a witness against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is none from the People of the Scripture but will believe in him before his death, and on the Day of Resurrection he will be a witness against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is none from the People of the Scripture but that he will surely believe in Jesus before his death. And on the Day of Resurrection he will be against them a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:159] And there is not one of the People of the Scripture but will assuredly believe in him, in Jesus, before his death, that is, [before the death] of one belonging to the People of the Scripture upon seeing the angels of death with his very eyes, at which point his faith will not profit him; or [it means] before the death of Jesus, after he descends at the approach of the Hour, as is stated in hadīth; and on the Day of Resurrection he, Jesus, will be a witness against them, of what they did when he was sent to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(There is not one of the People of the Scripture) the Jews and Christians (but will believe in him) in Jesus, that he was not a sorcerer, Allah, His son or His partner (before his death) after the soul of Jesus expires, that is after he comes down again and then dies after every single Jew in their time, (and on the Day of Resurrection he) Jesus (will be a witness against them) through delivery of the message.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { وَإِن مِّنْ أَهْلِ ٱلْكِتَابِ } أي: ما من جميع من أنزل إليه الكتاب من المسلمين والنصارى واليهود\n وسائر من أنزل إليهم أحدٌ مكلف { إِلاَّ } وقد وجب له ولزم عليه\n إنه { لَيُؤْمِنَنَّ بِهِ } أي: بعيسى - صلوات الله عليه وسلامه - حين نزوله\n لتقوية دين سيدنا محمد صلى الله عليه وسلم\n إذ هو جامع لجميع الأديان\n لإتيانها على التوحيد الذاتي\n\n\nوعند ظهوره صلى الله عليه وسلم اتحدت الأديان كلها\n إلا أن المحجوبون لا يفهمون\n مع أن عيسى - صلوات الله عليه وسلامه - من عجائب صنع الله\n وبدائع مبدعاته\n وغرائب مخترعاته\n ومن أعزة أنبيائه وأجلَّة رسله\n فلا بد أن يكون الإيمان به { قَبْلَ مَوْتِهِ } إذ حُكي في الحديث النبوي: إنه ينزل من السماء\n ويعيش في الأرض زماناً\n ويؤمن له جميع من في الأرض\n ثم يموت قريب الساعة { وَيَوْمَ ٱلْقِيَامَةِ يَكُونُ عَلَيْهِمْ } أي: على جميع من آمن له\n واتبع هداه { شَهِيداً } [النساء: 159] يشهد لهم بالإيمان عند الله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { وإن من أهل الكتاب } أي: ما من يهودي ولا نصراني، أي: الموجودين حيث نزوله { إلا ليؤمِنَنّ } بعيسى { قبل موته } أي: عيسى، وذلك حين نزوله من السماء، رُوِيَ أنه ينزل من السماء حين يخرج الدجال فيهلكه، ولا يبقى أحد من أهل الكتاب إلا ويؤمن به، حتى تكون الملة واحدة، وهي ملة الإسلام، وتقع الأمنة حتى يرتع الأسود مع الإبل، والنمور مع البقر، والذئاب مع الغنم، ويلعب الصبيان بالحيات، ويلبث في الأرض أربعين سنة، ثم يتوفّى ويصلى عليه المسلمون ويدفنونه. وقيل الضمير فيه { به } إلى عيسى، وفي { موته } إلى الكتابي، أي: وإن من أهل الكتاب أحد إلا ليؤمنن بعيسى بأنه عبد الله ورسوله، { قبل موته } أي: قبل خروج نفس ذلك الكتابي إذا عاين الملك، فلا ينفعه حينئٍذ إيمانه، لأن كل من نزل به الموت لم تخرج نفسه حتى يتبين له الحق من الباطل، ويؤيد هذا قراءة من قرأ:  ليُؤمنُنَّ به قبل موتهم بضم النون، لأن أحدًا في معنى الجمع، وهذا كالوعيد لهم والتحريض على معالجة الإيمان به من قبل أن يُضطر إليه ولم ينفعه إيمانه، { ويوم القيامة يكون عليه شهيدًا } يشهد على اليهود بالتكذيب، وعلى النصارى بأنهم دعوه ابن الله. والله تعالى أعلم. الإشارة: عند الموت تتحقق الحقائق، ويتميز الحق من الباطل، ويحصل الندم ولا ينفع حين تزل القدم، فالمطلوب المبادرة بتحقيق الإيمان، وتحصيل مقام العرفان، قبل أن يسقط إلى جنبه، فينفرد رهينًا في قبره بذنبه، والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:70",
      "similarity": 0.5633893649915029
    },
    {
      "verse": "3:98",
      "similarity": 0.5511654105169059
    },
    {
      "verse": "70:33",
      "similarity": 0.3631777537880776
    },
    {
      "verse": "3:102",
      "similarity": 0.35560846035634164
    },
    {
      "verse": "100:7",
      "similarity": 0.34811012489998416
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004159.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004159.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:159.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}