{
  "chapter": "النساء",
  "text": "يسـلك اهل الكتب ان تنزل عليهم كتبا من السماء فقد سالوا۟ موسى اكبر من ذلك فقالوا۟ ارنا الله جهرة فاخذتهم الصعقة بظلمهم ثم اتخذوا۟ العجل منۢ بعد ما جاءتهم البينت فعفونا عن ذلك وءاتينا موسى سلطنا مبينا",
  "translations": [
    {
      "translation": "The People of the Book will ask you to bring down a Book from heaven to them. They asked Musa for even more than that. They said, 'Let us see Allah with our own eyes.' So the lightning-bolt struck them down for their wrongdoing. Then they adopted the Calf after the Clear Signs had come to them, but We pardoned them for that and gave Musa clear authority.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of the Book demand of you to bring for them a book from heaven. But of Moses they had asked a bigger thing, and demanded: \"Show us God face to face.\" They were struck by lightning then as punishment for their wickedness. Even then they made the calf, when clear signs had reached them. Still We forgave them and gave Moses clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The People of the Book now ask of you to have a Book come down on them from heaven; indeed they asked of Moses even greater things than this, for they said: 'Make us see Allah with our own eyes' - whereupon the thunderbolt suddenly smote them for their wickedness. Then they took to worshipping the calf after clear signs had come to them. Still, We forgave them, and conferred a manifest commandment upon Moses,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), the People of the Book ask you to make a Book descend to them from the heavens. However, they had asked Moses for things much harder to do than this, by saying, \"Show us God in person.\" Thunder and lightning struck them because of their unjust demands. Despite all the evidence that had come to them, they started to worship the calf, but We forgave them for their sins and gave Moses clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O dear Prophet (Mohammed – peace and blessings be upon him) the People given the Book(s) ask you, to cause a Book to be sent down on them from heaven – so they had asked something even greater from Moosa, for they said, “Show Allah to us, clearly” – so the thunder seized them on account of their sins; then they chose the calf (for worship) after clear signs had come to them, then We forgave this; and We bestowed Moosa with a clear dominance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The People of the Scripture (Jews) ask you to cause a book to descend upon them from heaven. Indeed, they asked Musa for even greater than that, when they said: \"Show us Allah in public,\" but they were struck with a bolt of lightning for their wickedness. Then they worshipped the calf even after Al-Bayyinat had come to them. (Even) so We forgave them. And We gave Musa a clear proof of authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The followers of the Book ask you to bring down to them a book from heaven; so indeed they demanded of Musa a greater thing than that, for they said: Show us Allah manifestly; so the lightning overtook them on account of their injustice. Then they took the calf (for a god), after clear signs had come to them, but We pardoned this; and We gave to Musa clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The People of the Book will ask thee to bring down upon them a Book from heaven; and they asked Moses for greater than that, for they said, 'Show us God openly.' And the thunderbolt took them for their evildoing. Then they took to themselves the Calf, after the clear signs had come to them; yet We pardoned them that, and We bestowed upon Moses a clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of the Scripture ask of thee that thou shouldst cause an (actual) Book to descend upon them from heaven. They asked a greater thing of Moses aforetime, for they said: Show us Allah plainly. The storm of lightning seized them for their wickedness. Then (even) after that) they chose the calf (for worship) after clear proofs (of Allah's Sovereignty) had come unto them. And We forgave them that! And We bestowed on Moses evident authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The People of the Book ask you to bring down for them a book from heaven. Of Moses they demanded a greater thing than that. They said to him: \"Show us God face to face.\" A thunderbolt struck them for their wickedness. After that, they took to worshipping the [golden] calf, after all evidence of the truth had come to them! Yet We pardoned even that and bestowed on Moses clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of the Book ask thee to bring down a Book to them from the heaven. But surely they asked Musa a thing greater than that; they said: shew us God manifestly; whencefore the thunderbolt overtook them for their wrong-doing. Then they took a calf after there had come unto them the evidences. Even so We pardoned that, and We gave Musa a manifest authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The People of the Book ask you to bring down for them a Book from the sky. Certainly they asked Moses for [something] greater than that, for they said, ‘Show us Allah visibly,’ whereat a thunderbolt seized them for their wrongdoing. Then they took up the Calf [for worship], after all the manifest proofs that had come to them. Yet We excused that, and We gave Moses a manifest authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of the Book ask thee to cause a book to descend to them from heaven: Indeed they asked Moses for an even greater (miracle), for they said: \"Show us Allah in public,\" but they were dazed for their presumption, with thunder and lightning. Yet they worshipped the calf even after clear signs had come to them; even so we forgave them; and gave Moses manifest proofs of authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of the Scripture (Jews) ask you to cause a book to descend upon them from heaven. Indeed they asked Musa (Moses) for even greater than that, when they said: \"Show us Allah in public,\" but they were struck with thunder clap and lightning for their wickedness. Then they worshipped the calf even after clear proofs, evidences, and signs had come to them. (Even) so We forgave them. And We gave Musa (Moses) a clear proof of authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The People of the Book ask you to bring down upon them a Book from heaven. Of Moses they asked greater than that, they said to him: 'Show us Allah openly' And a thunderbolt took them for their evil doing. Then they took to themselves the calf, after the clear proofs had come to them, yet We forgave that and We gave Moses clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The People of the Scripture challenge you to bring down to them a book from the sky. They had asked Moses for something even greater. They said, “Show us God plainly.” The thunderbolt struck them for their wickedness. Then they took the calf for worship, even after the clear proofs had come to them. Yet We pardoned that, and We gave Moses a clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The People of the Scripture ask you to bring down to them a book from the heaven. But they had asked of Moses [even] greater than that and said, \"Show us Allah outright,\" so the thunderbolt struck them for their wrongdoing. Then they took the calf [for worship] after clear evidences had come to them, and We pardoned that. And We gave Moses a clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:153] The People of the Scripture, the Jews, will ask of you, O Muhammad (s), to cause a Book to be revealed to them from the heaven, all at once, as was revealed to Moses, merely to harass [you]. If you consider this shocking, then [know that], they, their forefathers, asked Moses for something greater than that, for they said, ‘Show us God openly’, before our eyes; so the thunderbolt, death, seized them, as punishment for them, for their evildoing, when they harassed him [Moses] with this demand. They then took to themselves the [golden] calf, for a god, after clear proofs, the miracles testifying to God’s Oneness, had come to them; yet We pardoned that, and did not annihilate them; and We bestowed upon Moses clear authority, evident and manifest sway over them, for when he commanded them to slay themselves in repentance, they obeyed him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلمَّا ذكر معاذير أهل الكتابين في إنكارهم رسالة محمد صلى الله عليه وسلم أعقبها بذكر شيء من اقتراحهم مجيء المعجزات على وفق مطالبهم . والجملة استئناف ابتدائي .ومجيء المضارع هنا : إمّا لقصد استحضار حالتهم العجيبة في هذا السؤال حتّى كأنّ السامع يراهم كقوله : { ويَصْنَعُ الفُلْك } \\[ هود : 38 \\] ، وقوله : { بل عَجِبْتَ وَيَسْخَرُون } \\[ الصافات : 12 \\] ، وقوله : { الله الذي أرسل الرياح فتثير سحاباً } \\[ فاطر : 9 \\] . وإمَّا للدلالة على تكرار السؤال وتجدّده المرّة بعد الأخرى بأن يكونوا ألَحّوا في هذا السؤال لِقصد الإعنات ، كقول طريف بن تميم العنبري :بعثوا إليّ عَريفَهم يَتَوَسَّمُ ... أي يكرّر التوسّم . والمقصود على كلا الاحتمالين التعجيب من هذا السؤال ، ولذلك قال بعده : { فقد سألوا موسى } . والسَّائلُون هم اليهود ، سألوا معجزة مثلَ معجزة موسى بأن ينزل عليه مثل ما أنزلت الألواح فيها الكلمات العشر على موسى ، ولم يريدوا جميع التوراة كما توهّمه بعض المفسّرين فإنّ كتاب التوراة لم ينزل دفعة واحدة . فالمراد بأهل الكتاب هنا خصوص اليهود .والكتاب هنا إمَّا اسم للشيء المكتوب كما نزلت ألواح موسى ، وإمّا اسم لقطعة ملتئمة من أوراق مكتوبة ، فيكونون قد سألوا معجزة تغاير معجزة موسى .والفاء في قوله : { فقد سألوا موسى } فاء الفصيحة دالّة على مقدّر دلّت عليه صيغة المضارع المراد منها التعجيب ، أي فلا تعجب من هذا فإنّ ذلك شنشنة قديمة لأسلافهم مع رسولهم إذ سألوه معجزة أعظم من هذا ، والاستدلال على حالتهم بحالة أسلافهم من قبيل الاستدلال بأخلاق الأمم والقبائل على أحوال العشائر منهم ، وقد تقدّم بيان كثير منه في سورة البقرة .وفي هذا الكلام تسلية للنبيء صلى الله عليه وسلم ودلالة على جراءتهم ، وإظهارُ أنّ الرسل لا تجيء بإجابة مقترحات الأمم في طلب المعجزات بل تأتي المعجزات بإرادة الله تعالى عند تحدّي الأنبياء ، ولو أجاب الله المقترحين إلى ما يقترحون من المعجزات لجعل رسله بمنزلة المشعوذين وأصحاب الخنقطرات والسيمياء ، إذ يتلقّون مقترحات الناس في المحافل والمجامع العامَّة والخاصّة ، وهذا ممَّا يحُطّ من مقدار الرسالة .وفي إنجيل متَّى : أنّ قوماً قالوا للمسيح : نريد أن نرى منك آية فقال : «جِيل شِرّير يطلب آية ولا تعطى له آية» . وتكرّر ذلك في واقعة أخرى . وقد يُقبل ذلك من المؤمنين ، كما حكى الله عن عيسى : { إذ قال الحواريون يا عيسى ابن مريم هل يستطيع ربّك أن يُنزّل علينا مائدة من السماء قال اتّقوا الله إن كنتم مؤمنين قالوا نريد أن نأكل منها وتطمئنّ قلوبنا ونعلم أن قد صدقتنا ونكون عليها من الشاهدين إلى قوله قال الله إنّي منزّلها عليكم فمن يكفر بعد منكم فإنِّي أعذّبه عذاباً لا أعذّبه أحداً من العالمين } \\[ المائدة : 112 ، 115 \\] ، وقال تعالى : { وما منعنا أن نُرسل بالآيات إلاّ أن كذّب بها الأوّلون وآتينا ثمودَ الناقةَ مُبصرةً فظلموا بها وما نرسل بالآيات إلاّ تَخْوِيفاً }\\[ الإسراء : 59 \\] .وهم لمّا سألوا موسى أن يريهم الله جهرة ما أرادوا التيمّن بالله ، ولا التنعّم بالمشاهدة ، ولكنَّهم أرادوا عَجَباً ينظرونه ، فلذلك قالوا : { أرِنا الله جهرة } ، ولم يقولوا : ليتنا نرى ربّنا . { وجَهْرَة } ضدّ خُفية ، أي عَلَناً ، فيجوز أن يكون صفة للرؤية المستفادة من ( أرنا ) ، ويجوز أن يكون حالاً من المرفوع في ( أرنا ) : أي حال كونك مجاهراً لنا في رؤيته غير مخف رؤيته .واستطرد هنا ما لحقهم من جرّاء سؤالهم هذه الرؤية وما ترتّب عليه فقال : { فأخذتهم الصاعقة بظلمهم } ، وهو ما حكاه تعالى في سورة البقرة ( 55 ) بقوله : { فأخذتكم الصاعقة وأنتم تنظرون . وكان ذلك إرهاباً لهم وزجراً ، ولذلك قال : بظلمهم } والظلم هو المحكي في سورة البقرة من امتناعهم من تصديق موسى إلى أن يروا الله جهرة ، وليس الظلم لمجرّد طلب الرؤية؛ لأنّ موسى قد سأل مثل سؤالهم مرّة أخرى : حكاه الله عنه بقوله : { ولمّا جاء موسى لميقاتنا وكلّمه ربّه قال ربّ أرني أنظر إليك } الآية في سورة الأعراف ( 143 ) . وبيّن أنّهم لم يردعهم ذلك فاتَّخذوا العجل إلهاً من بعد ما جاءتهم البيّنات الدالّة على وحْدانية الله ونفي الشريك وعطفت جملة اتّخاذهم العجل بحرف ( ثمّ ) المفيد في عطفه الجمل معنى التراخي الرتبى . فإنّ اتّخاذهم العجل إلهاً أعظم جرماً ممّا حكي قبله ، ومع ذلك عفا الله عنهم وآتى موسى سلطاناً مبيناً ، أي حجّة واضحة عليهم في تمرّدهم ، فصار يزجرهم ويؤنّبهم . ومن سلطانه المبين أن أحرق لهم العجل الذي اتّخذوه إلهاً .\n\n",
      "translations": [
        {
          "translation": "(The People of the Scripture) Ka'b and his followers (ask of thee that thou shouldst cause an (actual) Book to descend upon them from heaven) in one bulk just as the Torah was sent down; it is also said that this means: they ask you to bring down for them a book that contains all that is good for them and all that is bad for them, their rewards and punishments. (They asked a greater thing of Moses aforetime) greater than what they have asked you, (for they said: Show us Allah plainly) such that they could see Him with their own eyes. (The storm of lightning seized them) the Fire burnt them (for their wickedness) for their rejection of Moses and their boldness vis-a-vis Allah. (Then (even after that) they chose the calf) they worshipped the calf (after clear proofs) commands and prohibitions (had come unto them. And We forgave them that!) We left them and did not exterminate them. (And We bestowed on Moses evident authority) evident proof: the staff and the white hand.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَرِنَا ٱللَّهَ جَهْرَةً } معناه عَلانِيةٌ\n\n\n\n\nوقوله تعالى: { فَأَخَذَتْهُمُ ٱلصَّاعِقَةُ بِظُلْمِهِمْ } معناهُ بكُفرِهِمْ وتَوهمِهِم إِدْرَاكَ الله تَعالى جَهْرَةً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Let us see Allah plainly} means an open declaration.\n\n\nAnd the saying of Allah {But the lightning seized them with injustice} means their disbelief and their false assumption that Allah is not aware of them openly.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَسْأَلُكَ أَهْلُ ٱلْكِتَابِ } من غاية جهلهم بالله\n ونهاية غفلتهم عنه { أَن تُنَزِّلَ عَلَيْهِمْ كِتَاباً مِّنَ ٱلسَّمَآءِ } على مقتضى ما تهوى نفوسهم\n وترضى عقولهم\n ولا تستكبر منهم هذا { فَقَدْ سَأَلُواْ مُوسَىٰ أَكْبَرَ مِن ذٰلِكَ } وأشد بعداً واستحالةً { فَقَالُوۤاْ } من غاية بعدهم عن الله\n ونهاية حجابهم عن مطالعة جماله: { أَرِنَا ٱللَّهَ } الذي تدعونا إليه\n وترشدنا نحوه { جَهْرَةً } ظاهرة معاينة كالموجودات الأخر\n وما قدروا الله حق قدره\n لذلك أرادوا أن يحصروا\n ويحيطوا به\n مع أنه سبحانه أجلُّ من أن يشار إليه\n ويحاط به\n ويدرك على ما هو عليه\n إذ الإشارة والإحاطة والإدراك إنما هو منه وبه وفيه وإليه\n ومن هذا شأنه كيف يدرك ويحس؟\n\n\nونهاية حال الواصلين إليه أنهم انخلعوا عن هوياتهم الباطلة بالمرة\n وفنوا في هويته واضمحلوا\n لا إليه إلا هو\n كل شيء هالك إلا وجهه { فَأَخَذَتْهُمُ ٱلصَّاعِقَةُ } النازلة من السماء { بِظُلْمِهِمْ } هذا فهلكوا { ثُمَّ } بعدما تابوا\n ورجعوا إلى الله واستشفع لهم موسى صلوات الله عليه { ٱتَّخَذُواْ ٱلْعِجْلَ } إلهاً\n وحصروا الألوهية فيه حين لبَّس عليهم السامري وخادعهم به\n مع أن اتخاذهم هذا { مِن بَعْدِ مَا جَآءَتْهُمُ ٱلْبَيِّنَاتُ } الواضحة\n الدالة على توحيد الله وتقديسه من الحصر والإحاطة { فَعَفَوْنَا عَن ذٰلِكَ } أيضاً بعدما رجعوا إلينا والتجئوا نحونا متذللين { وَآتَيْنَا } بعد ذلك { مُوسَىٰ سُلْطَاناً مُّبِيناً } [النساء: 153] حجة واضحة\n ومعجزرة ملجئة لهم إلى الإيمان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:55",
      "similarity": 0.6759618997496066
    },
    {
      "verse": "52:45",
      "similarity": 0.42784224528614545
    },
    {
      "verse": "41:13",
      "similarity": 0.3931022276628652
    },
    {
      "verse": "51:44",
      "similarity": 0.3834206572643115
    },
    {
      "verse": "39:68",
      "similarity": 0.37655880887461063
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004153.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004153.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:153.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}