{
  "chapter": "النساء",
  "text": "وقولهم انا قتلنا المسيح عيسى ابن مريم رسول الله وما قتلوه وما صلبوه ولكن شبه لهم وان الذين اختلفوا۟ فيه لفى شك منه ما لهم به من علم الا اتباع الظن وما قتلوه يقينۢا",
  "translations": [
    {
      "translation": "and their saying, 'We killed the Messiah, 'Isa son of Maryam, Messenger of Allah.' They did not kill him and they did not crucify him but it was made to seem so to them. Those who argue about him are in doubt about it. They have no real knowledge of it, just conjecture. But they certainly did not kill him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for saying: \"We killed the Christ, Jesus, son of Mary, who was an apostle of God;\" but they neither killed nor crucified him, though it so appeared to them. Those who disagree in the matter are only lost in doubt. They have no knowledge about it other than conjecture, for surely they did not kill him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and their saying: 'We slew the Messiah, Jesus, son of Mary', the Messenger of Allah - whereas in fact they had neither slain him nor crucified him but the matter was made dubious to them - and those who differed about it too were in a state of doubt! They have no definite knowledge of it, but merely follow conjecture; and they surely slew him not,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and their statement that they murdered Jesus, son of Mary, the Messenger of God, when, in fact, they could not have murdered him or crucified him. They, in fact, murdered someone else by mistake. Even those who disputed (the question of whether or not Jesus was murdered) did not have a shred of evidence. All that they knew about it was mere conjecture. They certainly could not have murdered Jesus.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And because they said, “We have killed the Messiah, Eisa the son of Maryam, the Messenger of Allah”; they did not slay him nor did they crucify him, but a look-alike was created for them; and those who disagree concerning it are in doubt about it; they know nothing of it, except the following of assumptions; and without doubt, they did not kill him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And because of their saying, \"We killed Al-Masih `Isa, son of Maryam, the Messenger of Allah,\" but they killed him not, nor crucified him, but it appeared as that to them, and those who differ therein are full of doubts. They have no (certain) knowledge, they follow nothing but conjecture. For surely; they killed him not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their saying: Surely we have killed the Messiah, Isa son of Marium, the apostle of Allah; and they did not kill him nor did they crucify him, but it appeared to them so (like Isa) and most surely those who differ therein are only in a doubt about it; they have no knowledge respecting it, but only follow a conjecture, and they killed him not for sure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and for their saying, 'We slew the Messiah, Jesus son of Mary, the Messenger of God' -- yet they did not slay him, neither crucified him, only a likeness of that was shown to them. Those who are at variance concerning him surely are in doubt regarding him; they have no knowledge of him, except the following of surmise; and they slew him not of a certainty -- no indeed;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And because of their saying: We slew the Messiah, Jesus son of Mary, Allah's messenger - they slew him not nor crucified him, but it appeared so unto them; and lo! those who disagree concerning it are in doubt thereof; they have no knowledge thereof save pursuit of a conjecture; they slew him not for certain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They declared, \"We have put to death the Messiah, Jesus, son of Mary, the Messenger of God.\" They did not kill him, nor did they crucify him, but it only seemed to them [as if it had been so]. And those who differ in this matter are in doubt concerning it. They have no definite knowledge about it, but only follow mere conjecture. But they certainly did not kill him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for their saying: verily We have slain the Messiah 'Isa son of Maryam, an apostle of Allah, whereas they slew him not, nor they crucified him but it was made dubious unto them. And verily those who differ therein are in doubt thereof, they have no knowledge thereof; they but follow an opinion; and surely they slew him not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and for their saying, ‘We killed the Messiah, Jesus son of Mary, the apostle of Allah’—though they did not kill him nor did they crucify him, but so it was made to appear to them. Indeed those who differ concerning him are surely in doubt about him: they do not have any knowledge of that beyond following conjectures, and certainly, they did not kill him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they said (in boast), \"We killed Christ Jesus the son of Mary, the Messenger of Allah\";- but they killed him not, nor crucified him, but so it was made to appear to them, and those who differ therein are full of doubts, with no (certain) knowledge, but only conjecture to follow, for of a surety they killed him not:-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And because of their saying (in boast), \"We killed Messiah 'Iesa (Jesus), son of Maryam (Mary), the Messenger of Allah,\" - but they killed him not, nor crucified him, but the resemblance of 'Iesa (Jesus) was put over another man (and they killed that man), and those who differ therein are full of doubts. They have no (certain) knowledge, they follow nothing but conjecture. For surely; they killed him not [i.e. 'Iesa (Jesus), son of Maryam (Mary)]:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and for their saying, 'We killed the Messiah, Jesus the son of Mary, the Messenger (and Prophet) of Allah' They did not kill him, nor did they crucify him, but to them, he (the crucified) had been given the look (of Prophet Jesus). Those who differ concerning him (Prophet Jesus) are surely in doubt regarding him, they have no knowledge of him, except the following of supposition, and (it is) a certainty they did not kill him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for their saying, “We have killed the Messiah, Jesus, the son of Mary, the Messenger of God.” In fact, they did not kill him, nor did they crucify him, but it appeared to them as if they did. Indeed, those who differ about him are in doubt about it. They have no knowledge of it, except the following of assumptions. Certainly, they did not kill him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [for] their saying, \"Indeed, we have killed the Messiah, Jesus, the son of Mary, the messenger of Allah.\" And they did not kill him, nor did they crucify him; but [another] was made to resemble him to them. And indeed, those who differ over it are in doubt about it. They have no knowledge of it except the following of assumption. And they did not kill him, for certain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:157]   And for their saying, boastfully, ‘We slew the Messiah, Jesus son of Mary, the Messenger of God’, as they claim: in other words, for all of these [reasons] We have punished them. God, exalted be He, says, in repudiating their claim to have killed him: And yet they did not slay him nor did they crucify him, but he, the one slain and crucified, who was an associate of theirs [the Jews], was given the resemblance, of Jesus. In other words, God cast his [Jesus’s] likeness to him and so they thought it was him [Jesus]. And those who disagree concerning him, that is, concerning Jesus, are surely in doubt regarding, the slaying of, him, for some of them said, when they saw the slain man: the face is that of Jesus, but the body is not his, and so it is not he; and others said: no, it is he. They do not have any knowledge of, the slaying of, him, only the pursuit of conjecture (illā ittibā‘a l-zann, is a discontinuous exception) in other words: ‘instead, they follow conjecture regarding him, that which they imagined [they saw]’; and they did not slay him for certain (yaqīnan, a circumstantial qualifier emphasising the denial of the slaying).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأمّا قولهم إنّا قتلنا المسيح عيسى ابن مريم ، فَمحلّ المؤاخذة عليهم منه : هو أنّهم قصدوا أن يعدّوا هذا الإثم في مفاخر أسلافهم الراجعة إلى الإخلاف بالعهد المبيّن في سبيل نصر الدين .والمسيح كان لَقباً لعيسى عليه السلام لقَّبه به اليهود تهكّماً عليه : لأنّ معنى المسيح في اللغة العبرية بمعنى المَلِك ، كما تقدّم في قوله تعالى : { اسمه المسيح عيسى ابن مريم } في سورة آل عمران ( 45 ) ، وهو لقب قصدوا منه التهكّم ، فصار لقباً له بينهم . وقلب الله قصدهم تحقيره فجعله تعظيماً له . ونظيره ما كان يطلق بعض المشركين على النبي محمّد اسم مذمَّم ، قالت امرأة أبي لهب : مذمَّماً عصينا ، وأمره أبينا . فقال النبي ألا تعجبون كيف يصرف الله عنّي شتم قريش ولعنهم ، يشتمون ويلعنون مذمّماً وأنا محمد .وقوله : رسول الله } إن كان من الحكاية : فالمقصود منه الثناء عليه والإيمان إلى أنّ الذين يتبجّحون بقتله أحرياء بما رتّب لهم على قولهم ذلك ، فيكون نصبُ { رسول الله } على المدح ، وإن كان من المحكي : فوصفهم إيّاه مقصود منه التهكّم ، كقول المشركين للنبيء صلى الله عليه وسلم { يَأيّها الذي نُزّل عَلَيْهِ الذكر إنَّكَ لمجْنون } \\[ الحجر : 6 \\] وقول أهل مدين لشعيب{ أصلواتك تأمرك أن نترك ما يعبد آباؤنا أو أن نفعل في أموالنا ما نشاء إنَّك لأنْتَ الحليمُ الرشيد } \\[ هود : 87 \\] فيكون نصب «رسول الله» على النعت للمسيح .وقوله { وما قتلوه } الخ الظاهر أنّ الواو فيه للحال ، أي قولهم ذلك في حال أنّهم ما قتلوه ، وليس خبراً عن نفي القتل لأنَّه لو كان خبراً لاقتضى الحال تأكيده بمؤكّدات قويَّة ، ولكنَّه لمّا كان حالاً من فاعل القول المعطوف على أسباب لعنهم ومؤاخذتهم كانت تلك الأسباب مفيدة ثبوت كذبهم ، على أنّه يجوز كونه خبراً معطوفاً على الجمل المخبر بها عنهم ، ويكون تجريده من المؤكّدات : إمَّا لاعتبار أنّ المخاطب به هم المؤمنون ، وإمَّا لاعتبار هذا الخبر غنيّاً عن التأكيد ، فيكون ترك التأكيد تخريجاً على خلاف مقتضى الظاهر ، وإمّا لكونه لم يُتلقّ إلاّ من الله العالم بخفيّات الأمور فكان أعظم من أن يؤكّد .وعطف { وما صلبوه } لأنّ الصلب قد يكون دون القتل ، فقد كانوا ربما صلبوا الجاني تعذيباً له ثم عفوا عنه ، وقال تعالى : { إنَّما جزاء الذين يحاربون الله ورسوله . . . أن يُقتَّلوا أو يصلَّبوا } \\[ المائدة : 33 \\] . والمشهور في الاستعمال : أنّ الصلب هو أن يوثق المعدود للقتل على خشبة بحيث لا يستطيع التحرّك ثم يطعن بالرمح أو يرمى بسهم ، وكذلك كانوا يزعمون أنّ عيسى صلب ثم طعن برمح في قلبه .وجملة { ولكن شبَّه لهم } استدراك ، والمستدرك هو ما أفاده { وما قتلوه } من كون هذا القول لا شبهة فيه . وأنَّه اختلاق محض ، فبيّن بالاستدراك أنّ أصل ظنّهم أنّهم قتلوه أنّهم توهّموا أنّهم قتلوه ، وهي شبهة أوهمت اليهود أنّهم قتلوا المسيح ، وهي ما رَأوه ظاهراً من وقوع قتل وصلْب على ذات يعتقدونها ذات المسيح ، وبهذا وردت الآثار في تأويل كيفيَّة معنى الشبه .وقوله : { شبّه لهم } يحتمل أن يكون معناه : أنّ اليهود الَّذِين زعموا قتْلَهم المسيحَ في زمانهم قد شُبّه لهم مُشبَّه بالمسيح فقتلوه ، وَنجَّى الله المسيح من إهانة القتل ، فيكون قوله : { شبِّه } فعلاً مبْنيّاً للمجهول ، مشتقّاً من الشبه ، وهو المماثلة في الصورة . وحذف المفعول الذي حقّه أن يكون نائب فاعل ( شبّه ) للدلالة فعل ( شبّه ) عليه؛ فالتقدير : شبِّه مشبَّه فيكون «لهم» نائباً عن الفاعل . وضمير ( لهم ) على هذا الوجه عائد إلى الذين قالوا : { إنا قتلنا المسيح عيسى ابن مريم } وهم يهود زمانه ، أي وقعت لهم المشابهة ، واللام على هذا بمعنى عند كما تقول : حصل لي ظنّ بكذا . والاستدراك بيِّن على هذا الاحتمال . ويحتمل أن يكون المعنى ولكن شبّه لليهود الأولين والآخرين خبر صلب المسيح ، أي اشتبه عليهم الكذب بالصدق ، فيكون من باب قول العرب : خُيِّل إليك ، واختُلِط على فلان . وليس ثمّة شبيه بعيسى ولكن الكذب في خبره شبيه بالصدق ، واللام على هذا لام الأجل : أي لُبس الخبرُ كذبُه بالصدق لأجْلهم ، أي لتضليلهم ، أي أنّ كبراءهم اختلقوه لهم ليبردوا غليلهم من الحَنَق على عيسى إذ جاء بإبطال ضلالاتهم .أو تكون اللام بمعنى على للاستعلاء المجازي ، كقوله تعالى : { وإن أسأتم فلها } \\[ الإسراء : 7 \\] . ونكتة العدول عن حرف على تضمين فعل شُبّه معنى صُنع ، أي صنع الأحبار هذا الخبر لأجل إدخال الشبهة على عامّتهم .وفي الأخبار أنّ ( يهوذا الاسخريوطي ) أحد أصحاب المسيح ، وكان قد ضلّ ونافق ، هو الذي وشى بعيسى عليه السلام وهُو الذي ألْقَى الله عليه شبهَ عيسى ، وأنَّه الذي صُلب ، وهذا أصله في إنجيل برنابي أحد تلاميذ الحواريين ، وهذا يلائم الاحتمال الأول .ويقال : إنّ ( بيلاطس ) ، وَاليَ فلسطين ، سئل في رومة عن قضية قتل عيسى وَصَلبه فأجاب بأنّه لا عِلم له بشيء من هذه القضية ، فتأيّد بذلك اضطراب النّاس في وقوع قتله وصلبه ، ولم يقع ، وإنَّما اختلق اليهود خبره ، وهذا يلائم الاحتمال الثاني .والّذي يجب اعتقاده بنصّ القرآن : أنّ المسيح لم يُقتل ، ولا صُلب ، وأنّ الله رَفَعَه إليه ونجّاه من طالبيه ، وأمَّا ما عدا ذلك فالأمر فيه محتمل . وقد تقدّم الكلام في رفعه في قوله تعالى : { إنّي متوفّيك ورافعك إلَيّ } في سورة آل عمران \\[ 55 \\] وقوله : وإن الذين اختلفوا فيه لفي شك منه } يدلّ على وقوع خلاف في شأن قتل المسيح . والخلافُ فيه موجود بين المسيحيين : فجمهورهم يقولون : قتلته اليهود ، وبعضهم يقول : لم يقتله اليهود ، ولكن قتلوا يهوذا الاسخريوطي الذي شبّه لهم بالمسيح ، وهذا الاعتقاد مسطور في إنجيل برنابي الذي تعتبره الكنيسية اليوم كتاباً محرّفاً فالمعنى أنّ معظم النّصارى المختلفين في شأنه غير مؤمنين بصلبه ، بل يخالج أنفسهم الشكّ ، ويتظاهرون باليقين ، وما هو باليقين ، فما لهم به من علم قاطع إلاّ اتّباع الظنّ . فالمراد بالظنّ هنا : معنى الشكّ ، وقد أطلق الظنّ على هذا في مواضع كثيرة من كلام العرب ، وفي القرآن { إنّ بعض الظنّ إثم } \\[ الحجرات : 12 \\] ، وفي الحديث الصحيح : « إيَّاكم والظنّ فإنّ الظنّ أكْذَبُ الحديث » فالاستثناء في قوله { إلاّ اتّباع الظنّ } مُنقطع ، كقول النابغة :حَلفت يميناً غير ذي مثنوية ... ولا عِلْمَ إلاّ حُسنَ ظنّ بصَاحبيجوزُ أن يكون معطوفاً على قوله : { وما قتلوه وما صلبوه } ويجُوز أن يعطف على قوله : { مالهم به من علم } .واليقين : العلم الجازم الذي لا يحتمل الشكّ ، فهو اسمُ مصدر ، والمصدر اليَقَن بِالتحريك ، يقال : يَقِن كفرح يَيْقَن يَقَنا ، وهو مصدر قليل الاستعمال ، ويقال : أيقن يُوقن إيقاناً ، وهو الشائع .وقوله { يقيناً } يجوز أن يكون نصب على النيابة عن المفعول المطلق المؤكِّد لمضمون جملة قبله : لأنّ مضمون : { وما قتلوه يقينا } بعد قوله : { وقولهم إنّا قتلنا المسيح } إلى قوله { وما قتلوه وما صلبوه ولكنّ شبّه لهم } يدلّ على أنّ انتفاء قتلهم إيّاه أمر متيقّن ، فصحّ أن يكون يقيناً مؤكّداً لهذا المضمون .ويصحّ أن يكون في موضع الحال من الواو في { قتلوه } ، أي ما قتلوه متيقّنين قتْلَه ، ويكون النفي منصبّاً على القيد والمقيّد معاً ، بقرينة قوله قبله { ومَا قتلوه وما صلبوه } ، أي : هم في زعمهم قتْله ليسوا بمُوقنين بذلك للاضطراب الذي حصل في شخصه حينَ إمساك من أمسكوه ، وعلى هذا الوجه فالقتل مستعمل في حقيقته . وضمير النصب في { قتلوه } عائد إلى عيسى ابن مريم عليه السلام .ويجوز أن يكون القتل مستعملاً مجازاً في التمكّن من الشيء والتغلّب عليه كقولهم : قَتَلَ الخمرَ إذا مزجها حتّى أزال قُوّتَها ، وقولهم : قَتَل أرضاً عالِمُها ، ومن شعر «الحماسة» في بَاب الهجاء :يَروعك من سعدِ ابن عمرو جُسومها ... وتزهَد فيها حين تقتلُهَا خُبْراًوقول الشاعر :كذلِكَ تخبر عنهَا العالمات بها ... وقد قَتَلْتُ بعلمي ذلكم يَقَناوقول الآخر :قتلتني الأيام حين قتلتها ... خبُرا فأبْصِرْ قَاتلاً مقتولاًوضمير النصب في { قتلوه } عائد إلى العلم من قوله تعالى { ما لهم به من علم } ، فيكون { يقيناً } على هذا تمييزاً لنسبة ( قتلوه ) .\n\n",
      "translations": [
        {
          "translation": "(And because of their saying: We slew the Messiah Jesus son of Mary, Allah's messenger) Allah destroyed their man Tatianos. (They slew him not nor crucified, but it appeared so unto them) Allah made Tatianos look like Jesus and so they killed him instead of him; (and lo! those who disagree concerning it) concerning 107 his killing (are in doubt thereof) in doubt about his killing; (they have no knowledge thereof save pursuit of a conjecture) not even conjecture; (they slew him not for certain) i.e. certainly they did not kill him,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَوْلِهِمْ } أيضاً إرجافاً وإسماعاً وتبجحاً: { إِنَّا قَتَلْنَا ٱلْمَسِيحَ عِيسَى ٱبْنَ مَرْيَمَ } مع كونه { رَسُولَ ٱللَّهِ } وكلمته وروحاً منه { وَ } الحال أنه { مَا قَتَلُوهُ وَمَا صَلَبُوهُ } لأنه في حمى الله وفوق سمائه { وَلَـٰكِن شُبِّهَ لَهُمْ } رجل منهم\n أي: ألقى الله شبهه على حارس منهم يحرسه\n ليظفروا عليه\n فرفع المشبه به فبقي المشبه\n فقُتل وصُلب\n ثم اختلفوا فقالوا: إن كان هذا عيسى\n فأين صاحبنا؟ وإن كان صاحبنا\n فأين هو عيسى؟ { وَإِنَّ ٱلَّذِينَ ٱخْتَلَفُواْ فِيهِ } في قتله وصلبه ورفعه إلى السماء { لَفِي شَكٍّ مِّنْهُ } ترددٍ وارتيابٍ { مَا لَهُمْ بِهِ } وبأمره { مِنْ عِلْمٍ } تصديقٍ ويقينٍ { إِلاَّ ٱتِّبَاعَ ٱلظَّنِّ } والظن لا يغني عن الحق شيئاً { وَ } الحق أنه { مَا قَتَلُوهُ يَقِيناً } النساء: 157] كما زعموا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والاستثناء في قوله: { إلا اتباع الظن } منقطع إذ العلم يناقض الظن\n يقول الحقّ جلّ جلاله: فلما أخذنا على بني إسرائيل العهد والميثاق خالفوا ونقضوا\n ففعلنا بهم ما فعلنا\n بسبب نقضهم ميثاقهم\n أو بسبب نقضهم وكفرهم { حرمنا عليهم طيبات أُحِلّت لهم } \n وبسبب كفرهم أيضًا { بآيات الله } القرآن\n أو بما في كتبهم\n { وقتلهم الأنبياء بغير حق وقولهم غلف } أي: مغلفة لا تفقه ما تقول\n قال تعالى في الرد عليهم: { بل طبع الله عليها بكفرهم } \n فجعلها محجوبة عن العلم\n بأن خذلها ومنعها التوفيق للتدبر في الآيات والتذكر بالمواعظ\n { فلا يؤمنون إلا قليلاً } منهم كعبد الله بن سلام وأصحابه\n أو إيمانًا قليلاً لا عبرة به لنقصانه\n { وبكفرهم } أيضًا بعيسى عاقبناهم وطبعنا على قلوبهم\n { وقولهم على مريم بهتانًا عظيمًا } أي: نسبتها للزنى وبقولهم: { إن قتلنا المسيح عيسى ابن مريم رسول الله } أي بزعمه\n ويحتمل أنهم قالوه استهزاء\n ونظيره:\n[الشُّعَرَاء:27]\n أو يكون استئنافًا من الله بمدحه\n أو وضعًا للذكر الحسن موضع قولهم القبيح\n قاله البيضاوي\n ثم رد الله تعالى عليهم فقال: { وما قتلوه وما صلبوه ولكن شُبه لهم } رُوِي أن رهطًا من اليهود سبوه هو وأمه\n فدعا عليهم\n فمُسخوا قردة وخنازير\n فاجتمعت اليهود على قتله\n فقال لهم: يا معشر اليهود\n إن الله يبغضكم\n فغضبوا وثاروا ليقتلوه\n فبعث الله تعالى جبريل فأدخله خُوجة فيها كُوة في سقفها\n ورفعه الله إلى السماء من تلك الكوة\n فأمر اليهود رجلاً منهم يقال له: طيطانوس\n أن يدخل الخوخة ويقتله\n فما دخل الخوخة\n لم ير عيسى\n فألقى الله تعالى شبه عيسى عليه\n فلما أبطأ عليهم دخلوا عليه\n فطنوه عيسى\n فقتلوه وصلبوه\n وقال قتادة: ذكر لنا أن عيسى عليه السلام قال لأصحابه: أيكم يقذف عليه شبهي فيقتل؟ فقال رجل: أنا يا رسول الله\n فقتل ذلك الرجل\n ورفع عيسى عليه السلام\n وكساه الريش وألبسه النور\n وقطع عنه ذلة المطعم والمشرب وصار مع الملائكة\n فهو معهم في السماء إنسيًا ملكيًا\n أرضيًا سماويًا\n { وإن الذين اختلفوا فيه لفي شكٍّ منه } فقال بعض اليهود: إن كان هذا عيسى فأين صاحبنا؟ وإن كان صاحبنا فأين عيسى؟ ويقال: إن الله تعالى ألقى شبه وجه عيسى على صاحبهم\n ولم يلق عليه شبه جسده\n فلما قتلوه ونظروا إليه\n فقالوا: الوجه وجه عيسى والجسد جسد صاحبنا\n { ما لهم به من علم إلا اتباع الظن } أي: لا علم لهم بقتله\n لكن يتبعون الظن فقط\n\n{ وما قتلوه } قتلاً { يقينًا } كما زعموا بقولهم: إن قتلنا المسيح",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:45",
      "similarity": 0.41523318681718135
    },
    {
      "verse": "2:118",
      "similarity": 0.3901048922509369
    },
    {
      "verse": "7:124",
      "similarity": 0.35254285262837765
    },
    {
      "verse": "86:7",
      "similarity": 0.3400821005349368
    },
    {
      "verse": "26:49",
      "similarity": 0.33357291682424567
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004157.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004157.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:157.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}