{
  "chapter": "النساء",
  "text": "فبظلم من الذين هادوا۟ حرمنا عليهم طيبت احلت لهم وبصدهم عن سبيل الله كثيرا",
  "translations": [
    {
      "translation": "Because of wrongdoing on the part of the Jews, We made haram for them some good things which had previously been halal for them; and because of their obstructing many people from the Way of Allah,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of the wickedness of some among the Jews, and because they obstructed people from the way of God, We forbade them many things which were lawful for them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus, We forbade them many clean things which had earlier been made lawful for them, for the wrong-doing of those who became Jews, for their barring many from the way of Allah,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made unlawful for the Jews certain pure things which had been lawful for them before, because of the injustice which they had committed, their obstructing many people from the way of God,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So due to the great injustices committed by the Jews, We forbade them some of the good things which were earlier lawful for them, and because they prevented many people from Allah’s way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the wrongdoing of the Jews, We made unlawful for them certain good foods which had been lawful for themـand for their hindering many from Allah's way;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore for the iniquity of those who are Jews did We disallow to them the good things which had been made lawful for them and for their hindering many (people) from Allah's way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for the evildoing of those of Jewry, We have forbidden them certain good things that were permitted to them, and for their barring from God's way many,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of the wrongdoing of the Jews We forbade them good things which were (before) made lawful unto them, and because of their much hindering from Allah's way,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of the wrongdoings of the Jews, We forbade them certain good things that had been allowed to them before; for having frequently debarred others from God's path;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore because of the wrongdoing on the part of those who are Judaised We forbade unto them the clean things that had been allowed unto them, and also because of their keeping away many from Allah's way;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Due to the wrongdoing of the Jews, We prohibited them certain good things that were permitted to them [earlier], and for their barring many [people] from the way of Allah,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the iniquity of the Jews We made unlawful for them certain (foods) good and wholesome which had been lawful for them;- in that they hindered many from Allah's Way;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the wrong-doing of the Jews, We made unlawful to them certain good foods which has been lawful to them, and for their hindering many from Allah's Way;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for the harmdoing of those of Jewry, We have forbidden them the good things that were permitted to them, and also for their barring many from the way of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Due to wrongdoing on the part of the Jews, We forbade them good things that used to be lawful for them; and for deterring many from God’s path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For wrongdoing on the part of the Jews, We made unlawful for them [certain] good foods which had been lawful to them, and for their averting from the way of Allah many [people],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:160] And because of the evildoing (fa-bi-zulmin is [to be understood as] fa-bi-sababi zulmin, ‘and for the reason of the evildoing’) of some of those of Jewry, the Jews, We have forbidden them certain good things that were lawful for them, those things [mentioned] where God says [And to those of Jewry] We have forbidden every beast with claws [Q. 6:146]; and because of their barring, of people, from God’s way, [from] His religion, many, a time.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإن كان متعلَّق قوله : { فبما نقضهم } النساء : 155 ) محذوفاً على أحد الوجهين المتقدّمين كان قوله : { فبظلم } مفرّعاً على مجموع جرائمهم السالفة . فيكون المراد بظلمهم ظلماً آخر غير ما عُدّد من قبل ، وإن كان قوله : { فبما نقضهم } \\[ النساء : 155 \\] متعلّقاً بقوله : { حرّمنا عليهم } فقوله : { فبظلم } الخ بَدَل مطابق من جملة { فبما نقضهم ميثاقهم } \\[ النساء : 155 \\] بإعادة العامل في البدل منه لطول الفصل . وفائدة الإتيان به أن يظهر تعلّقه بقوله : { حرّمنا عليهم طيّبات } إذ بَعُد ما بينه وبين متعلّقه ، وهو قوله : { فبما نقضهم ميثاقهم } \\[ النساء : 155 \\] ليقوى ارتباط الكلام . وأتي في جملة البدل بلفظ جامع للمبدل منه وما عطف عليه : لأنّ نقض الميثاق ، والكفر ، وقتل الأنبياء ، وقولهم قلوبنا غلف ، وقولهم على مريم بهتاناً ، وقولهم قتلنا عيسى : كلّ ذلك ظلم . فكانت الجملة الأخيرة بمنزلة الفذلكة لما تقدّم ، كأنَّه قيل : فبذلك كلّه حرّمنا عليهم ، لكن عدل إلى لفظ الظلم لأنّه أحسن تفنّناً ، وأكثر فائدة من الإتيان باسم الإشارة . وقد مرّ بيان ذلك قريباً عند قوله تعالى : { فبما نقضهم } \\[ النساء : 155 \\] . ويجوز أن يكون ظلماً آخر أجْملَهُ القرآن .وتنكير ( ظلم ) للتعظيم ، والعدولُ عن أن يقول «فبظلمهم» ، حتّى تأتي الضمائر متتابعة من قوله : { فبما نقضهم ميثاقهم وكفرهم } إلى آخره ، إلى الاسم الظاهر وهو { الَّذين هادوا } لأجل بعد الضمير في الجملة المبدل منها : وهي { فبما نقضهم } \\[ النساء : 155 \\] . ولأنّ في الموصول وصلته ما يقتضي التنزّه عن الظلم لو كانوا كما وصفوا أنفسهم ، فقالوا : { إنّا هدنا إليك } \\[ الأعراف : 156 \\] ؛ فصدور الظلم عن الذين هادوا محلّ استغراب .والآية اقتضت : أنّ تحريم ما حرّم عليهم إنَّما كان عقاباً لهم ، وأنّ تلك المحرّمات ليس فيها من المفاسد ما يتقضي تحريم تناولها ، وإلاّ لحُرمّت عليهم من أوّل مجيء الشريعة . وقد قيل : إنّ المراد بهذه الطيّبات هو ما ذكر في قوله تعالى : { وعلى الذين هادوا حرّمنا كلّ ذي ظُفر ومن البقر والغنم حرّمنا عليهم شحومهما إلى قوله ذلك جزيناهم ببغيهم } في سورة الأنعام ( 146 ) ، فهذا هو الجزاء على ظلمهم .نقل الفخر في آية سورة الأنعام عن عبد الجبّار أنَّه قال : نفس التحريم لا يجوز أن يكون عقوبة على جرم صدر منهم لأنّ التكليف تعريض للثواب ، والتعريض للثواب إحسان ، فلم يُجِز أن يكون التكليف جزاء على الجرم . قال الفخر : والجواب أنّ المنع من الانتفاع يمكن أن يكون لقصد استحقاق الثواب ويمكن أن يكون للجرم .وهذا الجواب مصادرة على أنّ ممّا يقوّي الإشكال أنّ العقوبة حقّها أن تُخصّ بالمجرمين ثُمّ تنسخ . فالذي يظهر لي في الجواب : إمَّا أن يكون سبب تحريم تلك الطيّبات أنّ ما سرى في طباعهم بسبب بغيهم وظلمهم من القساوَة صار ذلك طبعاً في أمزجتهم فاقتضى أن يلطِّف الله طباعهم بتحريم مأكولات من طبعها تغليظ الطباع ، ولذلك لمّا جاءهم عيسى أحلّ الله لهم بعض ما حرّم عليهم من ذلك لزوال موجب التحريم ، وإمّا أن يكون تحريم ما حرّم عليهم عقاباً للذين ظلموا وبغوا ثُمّ بقي ذلك على من جاء بعدهم ليكون لهم ذِكْرى ويكون للأوّلين سُوء ذِكر من باب قوله :{ واتَّقوا فتنة لا تصيبنّ الذين ظلموا منكم خاصّة } \\[ الأنفال : 25 \\] ، وقول النبي صلى الله عليه وسلم « ما من نفس تُقتل ظلماً إلاّ كان على ابن آدم الأوللِ كِفْل من دمها » . ذلك لأنّه أوّل من سَنّ القتل . وإمّا لأنّ هذا التحريم عقوبة دنيوية راجعة إلى الحرمان من الطيّبات فلا نظر إلى ما يعرض لهذا التحريم تارة من الثواب على نيّة الامتثال للنهي ، لندرة حصول هذه النيّة في التّرك .وصَدّهم عن سبيل الله : إن كان مصدرَ صَدّ القاصر الذي مضارعه يصِدّ بكسر الصاد فالعنى بإعراضهم عن سبيل الله؛ وإن كان مصدر المتعدّي الذي قِياس مضارعه بضمّ الصاد ، فلعلّهم كانوا يصدّون النّاس عن التقوى ، ويقولون : سيغفر لنا ، من زمن موسى قبل أن يحرّم عليهم بعض الطيّبات . أمّا بعد موسى فقد صدّوا النّاس كثيراً ، وعاندوا الأنبياء ، وحاولوهم على كتم المواعظ ، وكذّبوا عيسى ، وعارضوا دعوة محمّد صلى الله عليه وسلم وسوّلوا لكثير من النّاس ، جهراً أو نفاقاً ، البقاء على الجاهليّة ، كما تقدّم في قوله : { ألم تر إلى الذين أوتوا نصيباً من الكتاب يؤمنون بالجبت والطاغوت } \\[ النساء : 51 \\] الآيات . ولذلك وصف ب { كثيراً } حالاً منه .\n\n",
      "translations": [
        {
          "translation": "(Because of the wrong-doing of the Jews We forbade them good things which were (before) made lawful unto them, and because of their much hindering from Allah's way) and because of their hindering the mention of Allah's Religion,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فبظلم } عظيم { من الذين هَادوا } أي: بعباداتهم عجل النفس واتخاذه إلهاً وامتناعهم عن دخول القرية التي هي حضرة الروح واعتدائهم في السبت بمخالفة الشرع والاحتجاب عن كشف توحيد الأفعال ونقضهم ميثاق الله واحتجابهم عن تجليات الصفات الذي هو كفرهم بآيات الله والانغماس في الرذائل كلها\n كقتل الأنبياء والافتراء على الله بكون قلوبهم غلفاً أي: مغشاة بحجب خلقية لا سبيل إلى رفعها وبهتانهم على مريم\n وادعائهم قتل عيسى عليه السلام من الخصال التي اجتماعها ظلم لا يعرف كنهه { حرّمنا عليهم طيبات } جنات النعيم من تجليات الأفعال والصفات وشهود الذات التي هي طيبات لا يعرف كنهها { أُحِلت لهم } بحسب قابلية استعدادهم لولا هذه الموانع { وبصدهم } الناس بصحبتهم ومرافقتهم ودعوتهم إلى الضلال أو بصدّ قواهم الروحانية { عن سبيل الله وأخذهم } ربا فضول العلوم كالخلاف والجدل واللذات البدنية والحظوظ التي نهوا عنها { وأكْلهم أموال الناس بالباطل } برذيل الحرص والطبع كأخذ الرشا وأجر التزويرات والتلبيسات أو استعمال علوم القوى الروحانية بين الفكر والعقل النظريّ والعلميّ في تحصيل المآكل والمشارب وكسب الحطام\n وتحصيل اللذات والشهوات الحسيّة والمآرب السبعية والبهيمية عذاباً مؤلماً لوجود استعدادهم\n  { لكن الراسِخون في العِلم } أي: المحققون { منهم والمؤمنون } بالإيمان التقليدي المطابق الثابت { يؤمنون بما أنزل إليك } إلى آخره\n أي: يتّصفون بالتزكية والتحلية { والمُؤمِنون } الموحدون بالتوحيد العيانيّ { واليوم الآخر } المعاينون لأحوال المعاد على ما هو عليه { أجراً عَظِيماً } من حظوظ تجليات الصفات وجناتها\n { رُسُلاً مبشرين } بتجليات صفات اللطف { ومُنذرين } بتجليات صفات القهر { لئلا يكون للناس على الله حجة } ظهور وسلطنة بوجود صفة ما بعد رفعها ومحوها بإمداد الرسل { وكانَ الله عزيزاً } قوياً يقهرهم بمحو صفاتهم وإفناء ذواتهم { حكيماً } لا يفعل ذلك إلا بحكمة اتصافهم بصفاته أو بقائهم بذاته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَبِظُلْمٍ } خروج عن حدود الله\n ونقض لعهوده صدر وظهر { مِّنَ ٱلَّذِينَ هَادُواْ حَرَّمْنَا عَلَيْهِمْ } في كتابهم { طَيِّبَاتٍ أُحِلَّتْ لَهُمْ } فيما مضى { وَ } أيضاً { بِصَدِّهِمْ عَن سَبِيلِ ٱللَّهِ } أي: إعراضهم عن طريق الحق إعراضاً { كَثِيراً } [النساء: 160]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: فبسبب ظلم { من الذين هادوا } وهو نقضهم الميثاق\n وكفرهم بآيات الله\n وقتلهم الأنبياء\n { حرَمنا عليهم طيبات } كانت { أُحِلّت لهم } كالشحوم\n وكل ذي ظفر\n وغير ذلك من لذيذ الطيبات\n وكانوا كلما ارتكبوا كبيرة حرّم عليهم شيئًا من الطيّبات\n وحرّمنا ذلك أيضًا عليهم { بصدّهم } عن طريق { الله } صدًّا { كثيرًا } \n أي: بإعراضهم عنه إعراضًا كثيرًا\n أو بصدهم عنه ناسًا كثيرًا كانوا يُخَذِّلونَهُم عن الدخول في دين الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:87",
      "similarity": 0.5212095007386303
    },
    {
      "verse": "5:88",
      "similarity": 0.4459867487361504
    },
    {
      "verse": "16:118",
      "similarity": 0.43254703900437314
    },
    {
      "verse": "8:34",
      "similarity": 0.4224108370736636
    },
    {
      "verse": "47:1",
      "similarity": 0.3703933400182106
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004160.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004160.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:160.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}