{
  "chapter": "النساء",
  "text": "والذان ياتينها منكم فـاذوهما فان تابا واصلحا فاعرضوا۟ عنهما ان الله كان توابا رحيما",
  "translations": [
    {
      "translation": "If two men commit a like abomination, punish them. If they make tawba and reform, leave them alone. Allah is Ever-Returning, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If two (men) among you are guilty of such acts then punish both of them. But if they repent and reform, let them be, for God accepts repentance and is merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Punish both of those among you who are guilty of this sin, then if they repent and mend their ways, leave them alone. For Allah is always ready to accept repentance. He is All-Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any two people commit fornication, punish them. If they repent and reform, let them go. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And punish them both, the man and the woman, whoever are guilty of it (adultery); then if they repent and become pious, leave them; indeed Allah is the Most Acceptor Of Repentance, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the two persons among you who commit illegal sexual intercourse, punish them both. And if they repent and do righteous good deeds, leave them alone. Surely, Allah is Ever the One Who accepts repentance, (and He is) Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the two who are guilty of indecency from among you, give them both a punishment; then if they repent and amend, turn aside from them; surely Allah is Oft-returning (to mercy), the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when two of you commit indecency, punish them both; but if they repent and make amends, then suffer them to be; God turns, and is All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for the two of you who are guilty thereof, punish them both. And if they repent and improve, then let them be. Lo! Allah is ever relenting, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If two men commit a like abomination, punish them both. If they repent and mend their ways, leave them alone. God is forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those twain of you who commit it, hurt them both; then, if they repent and amend, turn away from them; verily Allah is Relenting, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should two among you commit it, chastise them both; but if they repent and reform, let them alone. Indeed Allah is all-clement, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If two men among you are guilty of lewdness, punish them both. If they repent and amend, Leave them alone; for Allah is Oft-returning, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the two persons (man and woman) among you who commit illegal sexual intercourse, punish them both. And if they repent (promise Allah that they will never repeat, i.e. commit illegal sexual intercourse and other similar sins) and do righteous good deeds, leave them alone. Surely, Allah is Ever the One Who accepts repentance, (and He is) Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If two among you commit it punish them both. If they repent and make amends, leave them alone. Allah is the Relenter, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If two men among you commit it, punish them both. But if they repent and reform, leave them alone. God is Redeemer, Full of Mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the two who commit it among you, dishonor them both. But if they repent and correct themselves, leave them alone. Indeed, Allah is ever Accepting of repentance and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:16] And when two of you (read wa’lladhāni or wa’lladhānni) men, commit it, that is, a lewd act, adultery or homosexual intercourse, punish them both, with insults and beatings with sandals; but if they repent, of this [lewd act], and make amends, through [good] action, then leave them be, and do not harm them. God ever turns [relenting], to those who repent, and is Merciful, to them. This [verse] is abrogated by the prescribed punishment if adultery is meant [by the lewd act], and similarly if homosexual intercourse is meant, according to al-Shāfi‘ī; but according to him, the person who is the object of the [penetrative] act is not stoned, even if he be married; rather, he is flogged and banished. Judging by the dual person pronoun, it seems more obvious that homosexual fornication is meant [by this verse], even though the former [sc. alShāfi‘ī] was of the opinion that it referred to an adulterer and an adulteress; but this [opinion of his] may be countered by the fact that [the reference to] the two [men] becomes clear on account of the particle min being attached to a masculine pronoun [minkum, ‘of you’], and by the fact that they suffer the same punishment, [both effect the action of] repentance and [are both granted] that they be left alone [thereafter], [all of] which applies specifically to men, given that for women detention is stipulated, as was stated before.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And as for the two of you) of your free people, i.e. any unmarried man or woman (who are guilty thereof) who are guilty of adultery, (punish them both) by maligning and upbraiding them. (And if they repent) after this (and improve) in relation to that which is between them and Allah, (then let them be) refrain from maligning and upbraiding them. (Lo! Allah is Relenting) He overlooks sins, (Merciful). Maligning and upbraiding the unmarried person who commits adultery was later abrogated and replaced by one hundred lashes for both parties. 84\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱللَّذَانِ يَأْتِيَانِهَا } أي: الفعلة القبيحة التي هي اللواطة، وهما الآتي والمأتي { مِنكُمْ } أيها الرجال وهذا أفحش من الزنا؛ لخروج كلٍّ منهما عن حد الله، وانحطاطهما عن كمال الإنسان؛ لارتكابهما شئاً لا يقتضيه العقل والشرع بخلاف الزن، ولشناعها وخباثتها لم يعيِّن لها سبحانه حداً في كتابه المبيِّن لأخلاق الإنسان، كأن هؤلاء ليسوا من الإنسان، بل من البهائم، بل أسوأ حالاً منها، لذلك قال: { فَآذُوهُمَا } إيذاءً بليغاً، وتعزيزاً شديداً حتى يمتنعوا { فَإِن تَابَا } وامتنعا { وَأَصْلَحَا } ما أفسد بالتوبة والندامة { فَأَعْرِضُواْ عَنْهُمَآ } متغفرين لهما من الله، مستشفعين عنهما، غير موبخين ومقرعين عليهما { إِنَّ ٱللَّهَ } المطلع لأحوال عباده المذنبين { كَانَ تَوَّاباً } لهم، يرجعهم عمَّا صدر عنهم نادمين { رَّحِيماً } [النساء: 16] يعفو عنهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:61",
      "similarity": 0.5402624823723426
    },
    {
      "verse": "14:12",
      "similarity": 0.5003868614020058
    },
    {
      "verse": "33:69",
      "similarity": 0.4502139210473195
    },
    {
      "verse": "3:111",
      "similarity": 0.4383233641176776
    },
    {
      "verse": "6:34",
      "similarity": 0.426804220819172
    }
  ]
}