{
  "chapter": "النساء",
  "text": "لكن الله يشهد بما انزل اليك انزله بعلمه والملئكة يشهدون وكفى بالله شهيدا",
  "translations": [
    {
      "translation": "But Allah bears witness to what He has sent down to you. He has sent it down with His knowledge. The angels bear witness as well. And Allah suffices as a Witness.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is Himself witness to what has been revealed to you, and revealed with His knowledge, and the angels are witness; and God is sufficient as witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Whether people believe or not) Allah bears witness that whatever He has revealed to you, He has revealed with His knowledge, and the angels bear witness to it too, though the witness of Allah is sufficient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God testifies that whatever He has revealed to you (Muhammad) He has revealed it on purpose and the angels also testify to it but God's testimony alone is Sufficient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah is the Witness of what He has sent down upon you – He has sent it down by His knowledge; and the angels are witnesses; and sufficient is Allah’s testimony.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah bears witness to that which He has sent down unto you; He has sent it down with His knowledge, and the angels bear witness. And Allah is All-Sufficient as a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah bears witness by what He has revealed to you that He has revealed it with His knowledge, and the angels bear witness (also); and Allah is sufficient as a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But God bears witness to that He has sent down to thee; He has sent it down with His knowledge; and the angels also bear witness; and God suffices for a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah (Himself) testifieth concerning that which He hath revealeth unto thee; in His knowledge hath He revealed it; and the angels also testify. And Allah is sufficient Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But God bears witness to what He has sent down to you. He has sent it down with His knowledge. The angels too bear witness. And God suffices as a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How be it Allah beareth witness by that which He hath sent down unto thee He sent it down with His own knowledge and the angels also bear witness; and sufficieth Allah as a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah bears witness to what He has sent down to you—He sent it down with His knowledge—and the angels bear witness [too], and Allah quite suffices as witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah beareth witness that what He hath sent unto thee He hath sent from His (own) knowledge, and the angels bear witness: But enough is Allah for a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah bears witness to that which He has sent down (the Quran) unto you (O Muhammad SAW), He has sent it down with His Knowledge, and the angels bear witness. And Allah is All-Sufficient as a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah bears witness for that which He has sent down to you. He has sent it down with His Knowledge, and the angels bear witness, it is sufficient that Allah is the Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But God bears witness to what He revealed to you. He revealed it with His knowledge. And the angels bear witness. Though God is a sufficient witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah bears witness to that which He has revealed to you. He has sent it down with His knowledge, and the angels bear witness [as well]. And sufficient is Allah as Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:166] When the Jews were asked about his [Muhammad’s] prophethood (s) and they denied him, the following was revealed: But God bears witness, He makes clear [the truth of] your prophethood, with what He has revealed to you, of the miraculous Qur’ān; He has revealed it, enveloped, through His knowledge, that is, [He has revealed it] knowing it fully, or [He has revealed it] with His knowledge therein; and the angels also bear witness, to you; and God suffices as a Witness, to this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah revealed about the people of Mecca when they said to the Prophet: we have asked the people of the Book about you and none of them testifies that you are a prophet sent by Allah, by saying: (But Allah (Himself) testifieth) even if no one else testifies (concerning that which He hath revealed unto thee) the Qur'an that Gabriel brought you; (in His knowledge) by His command (hath He revealed it; and the Angels also testify) testify to this. (And Allah is sufficient Witness) even if no one else besides Him testifies.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لكن الله يشهد بما أنزل إليك } لكونك في مقام الجمع وهم محجوبون لا يقرّون به بل هو يشهد { أنزَله بِعِلمه } ملتبساً بعلمه\n أي: في حالة كونه عالماً به بحيث إنه علمه الخاص لا علمك ولا علم غيرك من غيره\n { والملائِكَة يَشْهدون } لكونك مراعياً للتفصيل في غير الجمع فهو الشاهد بذاته وبأسمائه وصفاته { وكفى بالله شهيداً } أي: الذات مع الصفات تكفي في الشهادة إذ لا موجود غيره { كفروا } حجبوا عن الحق لكون ضلالهم بعيداً { إنّ الذين كفَروا } حجبوا عن الدين { وظَلموا } منعوا استعداداتهم عن حقوقها من الكمال بارتكاب الرذائل وتسليط صفات النفس على قلوبهم { لم يكُن الله ليَغفِر لهم } لرسوخ هيئات الرذائل فيهم وبطلان الاستعداد { ولا ليهديهم طريقاً } لجهلهم المركب واعتقادهم الفاسد وعدم علمهم بطريق ما من طرق الكمال { إلا طريق جهنم } نيران أشواق نفوسهم إلى ملاذها مع حرمانهم عنها { وكان ذلك } سهلاً على الله لانجذابهم إليها بالطبيعة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن غاية جدالهم ونزاعهم يجادلون غالباً معك في رسالتك وكتابك\n ولا يشهدون لك وبحقية كتابك\n وبصدقك في رسالتك\n مع كونك مشهوداً في كتبهم وعلى لسان رسلهم\n مكابرةً وعناداً\n لا تبال بهم وبشهادتهم\n { لَّـٰكِنِ ٱللَّهُ } المطلع للسرائر والخفيات { يَشْهَدُ بِمَآ أَنزَلَ إِلَيْكَ } أي: بحقيته\n وصدقك فيه\n وبأنه { أَنزَلَهُ } إليك ملتبساً { بِعِلْمِهِ } المتعلق بتأليف كلماته\n وكيفية ترتيبه ونظمه على وجهٍ يعجز عنه جميع من تحدى وتعارض معه { وَٱلْمَلاۤئِكَةُ } أيضاً { يَشْهَدُونَ } بأنه مُنزل من الحق على الحق { وَكَفَىٰ بِٱللَّهِ شَهِيداً } [النساء: 166] سواء شهدوا\n أو لم يشهدوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { لكن }: حرف استدراك، وهو عن مفهوم ما تقدم، وكأنه قال: إنهم لا يشهدون بوحينا إليك. لكن الله يشهد بذلك. يقول الحقّ جلَ جلاله: في الرد على اليهود لما قالوا للنبي صلى الله عليه وسلم: لا نشهد لك بما أوحي إليكم. فقال تعالى: { لكن الله يشهد بما أنزل إليك } إن لم يشهدوا به، { أنزله بعلمه } أي: متلبسًا بعلمه الخاص به، وهو العلم بتأليفه على نظم يعجز عنه كل بليغ. أو متلبسًا بعلمه الذي يحتاج الناس إليه في معاشهم ومعادهم. أو بعلمه المتعلق بمن يستأهل نزول الكتب إليه، { والملائكة } أيضًا يشهدون بذلك. وفيه تنبيه على أن الملائكة يودُّون أن يعلم الناس صحة دعوى النبوة، على وجه يستغني عن النظر والتأمل، وهذا النوع من خواص الملك، ولا سبيل للإنسان إلى العلم بأمثال ذلك، سوى التفكر والنظر، فلو أتى هؤلاء بالنظر الصحيح لعرفوا نبوتك، وشهدوا بها كما عرفت الملائكة وشهدوا. قاله البيضاوي، وقد يخلق الله العلم في قلب الإنسان من غير تفكر ولا نظر، بل هداية من المالك القدير. { وكفى بالله شهيدًا } لرسوله عن شهادة غيره. الإشارة: كما شهد الحق تعالى لرسوله بالنبوة والرسالة، شهد لمن كان على قدمه من ورثته الخاصة بالولاية والخصوصية، وهم الأولياء العارفون بالله، وشهادته لهم بما أظهر عليهم من العلوم اللدنية والأسرار الربانية، وبما أتحفهم به من الأخلاق النبوية والمحاسن البهية، وبما أظهر على أيديهم من الكرامات الظاهرة مع الاستقامة الشرعية، لكن لا يدرك هذه الشهادة إلا من سبقت له العناية، وكان له حظ من الولاية. \" سبحان من لم يجعل الدليل على أوليائه إلا من حيث الدليل عليه! ولم يوصل إليه إلا من أراد أن يوصله إليه \" وبالله التوفيق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:43",
      "similarity": 0.6363744241057632
    },
    {
      "verse": "4:70",
      "similarity": 0.6314644299119162
    },
    {
      "verse": "17:96",
      "similarity": 0.5948200531026131
    },
    {
      "verse": "33:3",
      "similarity": 0.5854630744769124
    },
    {
      "verse": "4:79",
      "similarity": 0.5783591060805799
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/4:166.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/4:166.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/4:166.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}