{
  "chapter": "النساء",
  "text": "فبظلم من الذين هادوا۟ حرمنا عليهم طيبت احلت لهم وبصدهم عن سبيل الله كثيرا",
  "translations": [
    {
      "translation": "Because of wrongdoing on the part of the Jews, We made haram for them some good things which had previously been halal for them; and because of their obstructing many people from the Way of Allah,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of the wickedness of some among the Jews, and because they obstructed people from the way of God, We forbade them many things which were lawful for them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus, We forbade them many clean things which had earlier been made lawful for them, for the wrong-doing of those who became Jews, for their barring many from the way of Allah,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made unlawful for the Jews certain pure things which had been lawful for them before, because of the injustice which they had committed, their obstructing many people from the way of God,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So due to the great injustices committed by the Jews, We forbade them some of the good things which were earlier lawful for them, and because they prevented many people from Allah’s way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the wrongdoing of the Jews, We made unlawful for them certain good foods which had been lawful for themـand for their hindering many from Allah's way;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore for the iniquity of those who are Jews did We disallow to them the good things which had been made lawful for them and for their hindering many (people) from Allah's way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for the evildoing of those of Jewry, We have forbidden them certain good things that were permitted to them, and for their barring from God's way many,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of the wrongdoing of the Jews We forbade them good things which were (before) made lawful unto them, and because of their much hindering from Allah's way,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of the wrongdoings of the Jews, We forbade them certain good things that had been allowed to them before; for having frequently debarred others from God's path;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore because of the wrongdoing on the part of those who are Judaised We forbade unto them the clean things that had been allowed unto them, and also because of their keeping away many from Allah's way;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Due to the wrongdoing of the Jews, We prohibited them certain good things that were permitted to them [earlier], and for their barring many [people] from the way of Allah,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the iniquity of the Jews We made unlawful for them certain (foods) good and wholesome which had been lawful for them;- in that they hindered many from Allah's Way;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the wrong-doing of the Jews, We made unlawful to them certain good foods which has been lawful to them, and for their hindering many from Allah's Way;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for the harmdoing of those of Jewry, We have forbidden them the good things that were permitted to them, and also for their barring many from the way of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Due to wrongdoing on the part of the Jews, We forbade them good things that used to be lawful for them; and for deterring many from God’s path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For wrongdoing on the part of the Jews, We made unlawful for them [certain] good foods which had been lawful to them, and for their averting from the way of Allah many [people],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:160] And because of the evildoing (fa-bi-zulmin is [to be understood as] fa-bi-sababi zulmin, ‘and for the reason of the evildoing’) of some of those of Jewry, the Jews, We have forbidden them certain good things that were lawful for them, those things [mentioned] where God says [And to those of Jewry] We have forbidden every beast with claws [Q. 6:146]; and because of their barring, of people, from God’s way, [from] His religion, many, a time.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Because of the wrong-doing of the Jews We forbade them good things which were (before) made lawful unto them, and because of their much hindering from Allah's way) and because of their hindering the mention of Allah's Religion,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَبِظُلْمٍ } خروج عن حدود الله، ونقض لعهوده صدر وظهر { مِّنَ ٱلَّذِينَ هَادُواْ حَرَّمْنَا عَلَيْهِمْ } في كتابهم { طَيِّبَاتٍ أُحِلَّتْ لَهُمْ } فيما مضى { وَ } أيضاً { بِصَدِّهِمْ عَن سَبِيلِ ٱللَّهِ } أي: إعراضهم عن طريق الحق إعراضاً { كَثِيراً } [النساء: 160]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:87",
      "similarity": 0.5212095007386303
    },
    {
      "verse": "5:88",
      "similarity": 0.4459867487361504
    },
    {
      "verse": "16:118",
      "similarity": 0.43254703900437314
    },
    {
      "verse": "8:34",
      "similarity": 0.4224108370736636
    },
    {
      "verse": "47:1",
      "similarity": 0.3703933400182106
    }
  ]
}