{
  "chapter": "النساء",
  "text": "لكن الرسخون فى العلم منهم والمؤمنون يؤمنون بما انزل اليك وما انزل من قبلك والمقيمين الصلوة والمؤتون الزكوة والمؤمنون بالله واليوم الءاخر او۟لئك سنؤتيهم اجرا عظيما",
  "translations": [
    {
      "translation": "But those of them who are firmly rooted in knowledge, and the muminun, have iman in what has been sent down to you and what was sent down before you: those who establish salat and pay zakat, and have iman in Allah and the Last Day - We will pay such people an immense wage.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But to the learned among them, and the believers who affirm what has been revealed to you and was revealed to those before you, and to those who fulfil their devotional obligations, who pay the zakat and believe in God and the Last Day, We shall give a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those among them who are firmly rooted in knowledge and the believers, such do believe in what has been revealed to you and what was revealed before you. (Those who truly believe) establish the Prayer and pay Zakah, those who firmly believe in Allah and in the Last Day, to them We shall indeed pay a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, the learned among them (the Jews) and the faithful believe in what God has revealed to you (Muhammad) and to the others before you and those who are steadfast in prayer, pay their religious tax, and believe in God and the Day of Judgment. They all will receive a great reward from Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those among them who are firm in knowledge and who have faith, believe in what is sent down upon you (O dear Prophet Mohammed – peace and blessings be upon him), and what was sent down before you, and those who keep the prayer established and those who pay the charity, and those who believe in Allah and the Last Day; to such, We shall soon bestow a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those among them who are well-grounded in knowledge, and the believers, believe in what has been sent down to you and what was sent down before you; and those who perform the Salah, and give Zakah and believe in Allah and in the Last Day, it is they to whom We shall give a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the firm in knowledge among them and the believers believe in what has been revealed to. you and what was revealed before you, and those who keep up prayers and those who give the poor-rate and the believers in Allah and the last day, these it is whom We will give a mighty reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those of them that are firmly rooted in knowledge, and the believers believing in what has been sent down to thee, and what was sent down before thee, that perform the prayer and pay the alms, and those who believe in God and the Last Day - them We shall surely give a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those of them who are firm in knowledge and the believers believe in that which is revealed unto thee, and that which was revealed before thee, especially the diligent in prayer and those who pay the poor-due, the believers in Allah and the Last Day. Upon these We shall bestow immense reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But to those of them, who are firmly grounded in knowledge, and the believers, who truly believe in what is revealed to you, and what was revealed before you. To those who pray regularly and pay the zakat [prescribed alms] and believe in God and the Last Day, We will surely give a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But of them those well-grounded in the Knowledge and the believers believe in that which hath been sent down unto thee and that which hath been sent down before thee, and the establishers of prayer and the givers of the poor-rate and the believers in Allah and the Last Day- those: unto them anon We shall give a mighty hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who are firmly grounded in knowledge from among them, and the faithful, they believe in what has been sent down to you, and what was sent down before you—those who maintain the prayer, give the zakat, and believe in Allah and the Last Day—them We shall give a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those among them who are well-grounded in knowledge, and the believers, believe in what hath been revealed to thee and what was revealed before thee: And (especially) those who establish regular prayer and practise regular charity and believe in Allah and in the Last Day: To them shall We soon give a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those among them who are well-grounded in knowledge, and the believers, believe in what has been sent down to you (Muhammad SAW) and what was sent down before you, and those who perform As-Salat (Iqamat-as-Salat), and give Zakat and believe in Allah and in the Last Day, it is they to whom We shall give a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those of them that are firmly rooted in knowledge, and the believers believing in what has been sent down to you (Prophet Muhammad), and what was sent down before you, and those who establish the prayer and pay the obligatory charity, and those who believe in Allah and the Last Day to those, We surely give a great wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those among them firmly rooted in knowledge, and the believers, believe in what was revealed to you, and in what was revealed before you; and the observers of prayers, and the givers of charity, and the believers in God and the Last Day—upon these We will bestow an immense reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those firm in knowledge among them and the believers believe in what has been revealed to you, [O Muhammad], and what was revealed before you. And the establishers of prayer [especially] and the givers of zakah and the believers in Allah and the Last Day - those We will give a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:162] But those of them who are firmly rooted, established, in knowledge, like ‘Abd Allāh b. Salām, and the believers, the Emigrants and the Helpers, believing in what has revealed to you, and what was revealed before you, of scriptures, and those who observe the prayer (wa’l-muqīmīna l-salāta is in the accusative because it is a laudative; it is also read in the nominative [wa’l-muqīmūna l-salāta]); and pay the alms, and those who believe in God and the Last Day — to them We shall surely give (nu’tīhim, is also read yu’tīhim, ‘He shall surely give’) a great wage, namely, Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But those of them) of the people of the Book: 'Abdullah Ibn Salam and his followers who believe in the Qur'an and all Scripture even if the Jews did not believe in the former (who are firm in knowledge) knowledge of the Torah (and the believers) all the believers (believe in that which is revealed unto thee) of the Qur'an, (and that which was revealed before thee) unto all the prophets, (especially the diligent in prayer) those who perfect their five daily prayers (and those who pay the poor-due) from their wealth also believe in the Qur'an and all the Scriptures, (the believers in Allah and the Last Day) the believers in resurrection after death also believe in the Qur'an and all Scriptures. All these believe in the Qur'an and all Scriptures even if the Jews do not believe in them. Allah then explained their reward, saying: (Upon these We shall bestow immense reward) an abundant reward in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إيماناً واحتساباً { وَٱلْمُقِيمِينَ ٱلصَّلاَةَ } وهم الذين يديمون الميل بجميع الإعضاء والجوارح\n إطاعةً وانقياداً\n إذ رجوع الكل إليه { وَٱلْمُؤْتُونَ ٱلزَّكَاةَ } وهم الذين يؤتون ما نسب إليهم من زخرفات الدنيا\n طلباً لمرضات الله\n وهرباً عن التعلق بغيره { وَٱلْمُؤْمِنُونَ بِٱللَّهِ } أي: الذين يوقنون بتوحيد الله { وَٱلْيَوْمِ ٱلآخِرِ } المعدّ لثمرة الأعمال الصالحة في طريقه { أُوْلَـٰئِكَ } السعداء\n الأمناء\n الموحدون\n المخلصون { سَنُؤْتِيهِمْ } من لدنا { أَجْراً عَظِيماً } [النساء: 162] هو الفوز بشرف اللقاء\n\n\nربنا آتنا من لدنك رحمةً\n إنك أنت الوهاب\n\n\nورسوخ الراسخين إنما يحصل من إلهامنا ووحينا وإعلامنا\n وإيقاظنا إياهم من سَنَة الغفلة ونعاس النسيان\n وإرشادنا لهم بإرسال الرسل وإنزال الكتب عليهم من عندنا وذلك سنتنا المستمرة\n وعادتنا القديمة\n لا يحتاج فيها للإلحاح والاقتراح",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { والمؤمنون } عطف على الراسخين، و { يؤمنون }: حال منهم\n و { المقيمين }: نصب على المدح، لأن العرب إذا تطاولت في مدح شيء أو ذمه خالفوا بين إعراب أوله وأوسطه، نظيره:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:7",
      "similarity": 0.6782702333828338
    },
    {
      "verse": "2:277",
      "similarity": 0.1302250086792676
    },
    {
      "verse": "9:71",
      "similarity": 0.12106636755330978
    },
    {
      "verse": "9:18",
      "similarity": 0.11418278732803885
    },
    {
      "verse": "27:3",
      "similarity": 0.11395305204879477
    }
  ]
}