{
  "chapter": "النساء",
  "text": "واخذهم الربوا۟ وقد نهوا۟ عنه واكلهم امول الناس بالبطل واعتدنا للكفرين منهم عذابا اليما",
  "translations": [
    {
      "translation": "and because of their practising usury when they were forbidden to do it, and because of their consuming people's wealth by wrongful means, We have prepared for the kafirun among them a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And because they practised usury although it had been forbidden them; and for using others' wealth unjustly. For those who are unbelievers among them We have reserved a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and for their taking interest which had been prohibited to them, and for their consuming the wealth of others wrongfully. And for the un believers among them We have prepared a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "their taking usury which was prohibited for them, and their consuming people's property unjustly. For the unbelievers among them, We have prepared a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And because they used to take usury whereas they were forbidden from it, and they used to wrongfully devour people’s wealth; and for the disbelievers among them, We have kept prepared a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their taking of Riba though they were forbidden from taking it, and their devouring men's substance wrongfully. And We have prepared for the disbelievers among them a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their taking usury though indeed they were forbidden it and their devouring the property of people falsely, and We have prepared for the unbelievers from among them a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and for their taking usury, that they were prohibited, and consuming the wealth of the people in vanity; and We have prepared for the unbelievers among them a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of their taking usury when they were forbidden it, and of their devouring people's wealth by false pretences, We have prepared for those of them who disbelieve a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "for taking usury, when they had been forbidden to do so. And because of their devouring people's wealth wrongfully. We have prepared a painful punishment for those of them who [continue to] deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And also because of their taking usury whereas they were prohibited therefrom, and also because of their devouring the riches of men unlawfully. And for the infidels among them We have gotten ready a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and for their taking usury—though they had been forbidden from it—and for eating up the wealth of the people wrongfully. And We have prepared for the faithless among them a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That they took usury, though they were forbidden; and that they devoured men's substance wrongfully;- we have prepared for those among them who reject faith a grievous punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And their taking of Riba (usury) though they were forbidden from taking it and their devouring of men's substance wrongfully (bribery, etc.). And We have prepared for the disbelievers among them a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for their taking of usury, that they were prohibited, and consuming the wealth of people in falsehood, for the unbelievers among them We have prepared a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for their taking usury, although they were forbidden it; and for their consuming people's wealth dishonestly. We have prepared for the faithless among them a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [for] their taking of usury while they had been forbidden from it, and their consuming of the people's wealth unjustly. And we have prepared for the disbelievers among them a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:161] And because of their taking usury when they had been forbidden it, in the Torah, and their consuming people’s wealth through falsehood, through bribes in adjudications, and We have prepared for the disbelievers among them a painful chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of their taking usury) of their making usury lawful (when they were forbidden it) in the Torah, (and of their devouring) and because of their consumption of (people's wealth by false pretences) through transgression and bribery, We forbade them the fat which covers the stomach and bowels and the meat and milk of camels, which were before lawful for them. (We have prepared for those of them who disbelieve) among the Jews (a painful doom) the pain of which will reach to their hearts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَخْذِهِمُ ٱلرِّبَا } من المضطرين أضعافاً مضاعفة { وَ } الحال أنه { قَدْ نُهُواْ عَنْهُ } في دينهم وكتابهم { وَأَكْلِهِمْ أَمْوَالَ ٱلنَّاسِ بِٱلْبَاطِلِ } بلا رخصة شرعية\n مثل: السرقة\n والغضب\n والربا\n والرشوة\n وحيل الفقهاء\n وتزويراتهم التي ينسبونها إلى الشرع الشريف افتراءً\n وتلبيسات أهل التشييخ والتدليس من هذا القبيل\n ومن عِظَم جُرم هؤلاء أسند سبحانه انتقامهم إلى نفسه بقوله: { وَأَعْتَدْنَا } صيَّرها وهيَّأنا { لِلْكَافِرِينَ } الساترين طريق الحق { مِنْهُمْ عَذَاباً } بعيداً\n وطرداً { أَلِيماً } [النساء: 161] مؤلماً\n لتحسرهم على مرتبة أهل القرب والعناية\n\n\n{ لَّـٰكِنِ ٱلرَّاسِخُونَ فِي ٱلْعِلْمِ مِنْهُمْ } وهم الذين يرتقون من مرتبة العلم إلى العين الحق { وَٱلْمُؤْمِنُونَ } المصدقون الذين { يُؤْمِنُونَ بِمَآ أُنزِلَ إِلَيكَ وَمَآ أُنزِلَ مِن قَبْلِكَ } بلا تفريقٍ وتفاوتٍ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وبأخذهم الربا { وقد نُهوا عنه } \n فهو محرم عليهم وعلى الأمة المحمدية\n وبأكلهم { أموال الناس بالباطل } كالرشوة وما كانوا يأخذونه من عوامهم\n { وأعتدنا للكافرين منهم } بمحمد صلى الله عليه وسلم { عذابًا أليمًا } \n دون من تاب وآمن به\n الإشارة: اعلم أن كل غفلة ومعصية وسوء أدب يحرم مرتكبه بسببه من لذيذ الطاعات وحلاوة المشاهدات على قدره\n شعر أو لم يشعر\n وقد يبعده من الحضرة\n وهو لا يشعر\n مكرًا واستدراجًا\n فإذا أصر عليه سلب من مقام الولاية بالكلية\n ولا يزال ينص إيمانه شيئًا فشيئًا\n حتى يتفلت منه\n والعياذ بالله\n وإذا بادر بالتوبة رجى قبوله\n وكل يقظة وطاعة وحسن أدب يوجب لصاحبه الزلفى والقرب من الحضرة\n ويزيده في حلاوة المعاملة والمشاهدة على قدره\n فلا يزال يتقرب إليه بنوافل الخيرات\n حتى يحبه فيتولاه\n فيكون سمعه وبصره\n كما في الحديث\n وبالله التوفيق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:10",
      "similarity": 0.5015427513504721
    },
    {
      "verse": "30:39",
      "similarity": 0.4286759330888485
    },
    {
      "verse": "69:10",
      "similarity": 0.41845499264928093
    },
    {
      "verse": "25:37",
      "similarity": 0.4105990705162808
    },
    {
      "verse": "3:130",
      "similarity": 0.40657897931615467
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/4:161.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/4:161.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:161.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}