{
  "chapter": "النساء",
  "text": "رسلا مبشرين ومنذرين لئلا يكون للناس على الله حجةۢ بعد الرسل وكان الله عزيزا حكيما",
  "translations": [
    {
      "translation": "Messengers bringing good news and giving warning, so that people will have no argument against Allah after the coming of the Messengers. Allah is Almighty, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All these apostles of good news and admonition were sent so that after the apostles men may have no argument against God. God is all-powerful and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These Messengers were sent as bearers of glad tidings and as warners so that after sending the Messengers people may have no plea against Allah. Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messengers were sent to give people the glad news (of God's mercy) and warn them (of His punishment) so that the human being would not have any objections against God, after the coming of the Messengers, (that they did not have any knowledge of His mercy and punishment). God is Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noble Messengers giving glad tidings and declaring warnings, in order that people may not have any argument against Allah, after the (advent of) Noble Messengers; and Allah is Almighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messengers as bearers of good news and warning, in order that mankind should have no plea against Allah after the (coming of) Messengers. And Allah is Ever All-Powerful, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We sent) apostles as the givers of good news and as warners, so that people should not have a plea against Allah after the (coming of) apostles; and Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messengers bearing good tidings, and warning, so that mankind might have no argument against God, after the Messengers; God is All-mighty, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messengers of good cheer and of warning, in order that mankind might have no argument against Allah after the messengers. Allah was ever Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were messengers, bearing good news and giving warning, so that mankind would have no excuse before God, after the coming of the messengers. God is mighty, wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent all these apostles as bearers of glad tidings and warners in order that there be no plea for mankind against Allah, after the apostle; and Allah is ever Mighty Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "apostles, as bearers of good news and warners, so that mankind may not have any argument against Allah, after the [sending of the] apostles; and Allah is all-mighty, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messengers who gave good news as well as warning, that mankind, after (the coming) of the messengers, should have no plea against Allah: For Allah is Exalted in Power, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messengers as bearers of good news as well as of warning in order that mankind should have no plea against Allah after the Messengers. And Allah is Ever All-Powerful, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messengers bearing glad tidings and warning, so that the people will have no argument against Allah, after the Messengers. Allah is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messengers delivering good news, and bringing warnings; so that people may have no excuse before God after the coming of the messengers. God is Powerful and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[We sent] messengers as bringers of good tidings and warners so that mankind will have no argument against Allah after the messengers. And ever is Allah Exalted in Might and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:165] messengers (rusulan, substitutes for the previous rusulan, ‘messengers’) bearing good tidings, of reward for those that believe, and warning, of punishment for those that disbelieve; We sent them, so that people might have no argument, to make, against God after, the sending of, the messengers, to them, and say: Our Lord, why did you not send a messenger to us so that we might follow Your signs and be among the believers [Q. 28:47]; thus We sent them to pre-empt such excuses. God is ever Mighty, in His kingdom, Wise, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Messengers) We have sent all these messengers (of good cheer) giving the good news of Paradise for 108 those who believe (and of warning) of hell for those who disbelieve in Allah, (in order that mankind might have no argument) on the Day of Judgement (against Allah after the messengers) after sending the messengers, such that they cannot say: You have not sent us any messenger. (Allah was ever Mighty) in His vengeance against those who do not believe in His messenger, (Wise) He decreed that they should believe in the messengers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنما أرسلنا { رُّسُلاً } وأنزلنا معهم كتباً؛ ليكونوا { مُّبَشِّرِينَ } للناس بالتوحيد وسائر المأمورات الواردة في طريقه، المؤدية إليه { وَمُنذِرِينَ } لهم عن الشرك المنافي له وعن جميع المحرمات المفضية إليه { لِئَلاَّ يَكُونَ لِلنَّاسِ } المجبولين على الجدال والنزاع { عَلَى ٱللَّهِ } المنزه عن المجادلة والمراء { حُجَّةٌ } متمسك وغلبة حين أخذهم بالانتقام يوم الجزاء إذ لا يبقى لهم مجادلة ومرءا { بَعْدَ } إرسال { ٱلرُّسُلِ } لإهدائهم إلى طريق الحق وسبيل التوحيد مع كونهم مؤيدين بإنزال الكتب من عنده { وَكَانَ ٱللَّهُ } المستقل في الألوهية { عَزِيزاً } غالباً في أوامره ونواهيه { حَكِيماً } [النساء: 165] في تدبيراته المتعلقة بها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ذكر حكمة إرسال الرسل فقال: أرسلنا { رسُلاً مبشرين ومنذرين لئلا يكون للناس على الله حجة بعد } بعث { الرسل } فيقولون: لولا أرسلت إلينا رسولاً ينبهنا ويعلمنا ما جهلنا من أمر توحيدك والقيام بعبوديتك، فقطع عذر العباد ببعث الرسل، وقامت الحجة عليهم، وفي الحديث عنه ـ عليه الصلاة والسلام ـ:\n\n\n\n \" مَا أحدٌ أغيرَ مِنَ الله، ولذلكَ حرَّم الفواحِشَ ما ظَهَرَ مِنهَا وما بَطَنَ، وما أحدٌ أحبَّ إليهِ المدحُ من الله، ولذلكَ مدَحَ نفسَهُ، وما أحَدٌ أحبَّ إليهِ العذرُ مِنَ الله تعالى، ولذلِكَ أرسَلَ الرَّسلِ وأنزَلَ الكُتبَ \"\n \n\n{ وكان الله عزيزًا } لا يغلب، فلا يجب عليه شيء، { حكيمًا } فيما دبر من النبوة، وخص كل نبي بنوع من الوحي والإعجاز على ما يليق به في زمانه\n والله تعالى أعلم\n الإشارة: علماءُ هذه الأمة كأنبياء بني إسرائيل، العارفون منهم كالرسل منهم، قال ابن الفارض رضي الله عنه:\n\nفإنهم يشاركونهم في وحي الإلهام، ويحصل لهم المكالمة مع المشاهدة، فيسمعون من الحق كما ينطقون به\n كما قال الششتري:\n\nفتارة يسمعون كلامه بالوسائط، وتارة من غير الوسائط، يعرف هذا أهل الفن من أهل الذوق، وشأن من لم يَبلُغ مقامهم: التسليم\n\n\nوفي الورتجبي: وإن الله تعالى إذا أراد أن يُسمع كلامه أحدًا من الأنبياء والأولياء يعطيه سمعًا من أسماعه، فيسمع به كلامه، كما حكى ـ عليه الصلاة والسلام ـ عنه ـ تعالى ـ، قال:\n\n \" فإذا أحببته كنت معه\n\n\n \" \n\n، الحديث\n أسمعه كلامه، وليس هناك الحروف والأصوات، بل أسمعه بحرف القدرة وصوت الأزلية، الذي هو منزه عن همهمة الأنفاس وخطرات الوسواس، وليس في ولاية الأزل من رسوم أهل الآجال شيء، حتى هناك السامع والمسمع واحد من حيث المحبة، لا من حيث الجمع والتفرقة\n انتهى كلامه\n واعلم أن أهل الجمع لا يشهدون إلا متكلمًا واحدًا، قد انتفى من نظرهم التعدد والاثنينية، غير أنهم يفرقون بين كلام القدرة وكلام الحكمة، كلام القدرة يبرز من غير اختبار، بل يكون المتكلم به مأخوذًا عنه، غائبًا عن اختياره، وكلام الحكمة معه ضرب من الاختبار، وقد يسمعون كلام القدرة من الهواتف الغيبية، ومن الجمادات على وجه الكرامة، وكله بحرف وصوت\n نعم ما يقع من الهواتف القلبية والتجليات الباطنية، قد يكون بلا حرف ولا صوت، وقد تحصل لهم المكالمة بالإشارة بلا صوت ولا حرف، فقوله: بل أسمعه بحرف القدرة وصوت الأزلية\n\n\n الخ\n إن أراد به التجليات الباطنية فمسلَّم، لكن ظاهره أن كلام الحق الذي يُسمعه لأنبيائه وأوليائه محصور في ذلك، وأنه لا يكون إلا بلا حرف ولا صوت\n وليس كذلك\n وقوله: وليس في ولاية الأزل من رسوم أهل الآجال شيء الخ، معناه: لم يبق في ولاية أهل مشاهدة الأزل من رسوم الحوادث شيء\n قلت: لكنهم يثبتونها حكمةً، ويمحونها قدرةً ومشاهدة، ولا يلزم من محوها عدم صدور الكلام منها بالحرف والصوت فإن البشرية لا تطيق سماع كلام الحق بلا واسطة الحكمة، كما هو معلوم\n والله تعالى أعلم\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:66",
      "similarity": 0.567551126420779
    },
    {
      "verse": "6:149",
      "similarity": 0.5043720685263477
    },
    {
      "verse": "2:139",
      "similarity": 0.48258631222322346
    },
    {
      "verse": "45:25",
      "similarity": 0.4745442503627153
    },
    {
      "verse": "3:97",
      "similarity": 0.41303792008539925
    }
  ]
}