{
  "chapter": "النساء",
  "text": "ورسلا قد قصصنهم عليك من قبل ورسلا لم نقصصهم عليك وكلم الله موسى تكليما",
  "translations": [
    {
      "translation": "There are Messengers We have already told you about and Messengers We have not told you about; and Allah spoke directly to Musa -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to many an apostle We have mentioned before, and to many other apostles We have not mentioned to you; and to Moses God spoke directly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We revealed to the Messengers We have already told you of, and to the Messengers We have not told you of; and to Moses Allah spoke directly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We sent revelations to) the Messengers mentioned to you before and also to Messengers who have not been mentioned to you. God spoke to Moses in words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to the Noble Messengers whom We have mentioned to you before, and to the Noble Messengers We have not mentioned to you; and Allah really did speak to Moosa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Messengers We have mentioned to you before, and Messengers We have not mentioned to you, and to Musa Allah spoke directly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (We sent) apostles We have mentioned to you before and apostles we have not mentioned to you; and to Musa, Allah addressed His Word, speaking (to him):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and Messengers We have already told thee of before, and Messengers We have not told thee of; and unto Moses God spoke directly --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And messengers We have mentioned unto thee before and messengers We have not mentioned unto thee; and Allah spake directly unto Moses;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have told you about some messengers sent previously, while We have not yet told you about others. God spoke to Moses directly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We Revealed unto apostles of some of whom We have narrated unto thee aforetime and of others of whom We have not narrated unto thee; and unto Musa Allah spake directly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and apostles We have recounted to you earlier and apostles We have not recounted to you—and to Moses Allah spoke directly—\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of some messengers We have already told thee the story; of others We have not;- and to Moses Allah spoke direct;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Messengers We have mentioned to you before, and Messengers We have not mentioned to you, - and to Musa (Moses) Allah spoke directly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Messengers of whom We have narrated to you before, and Messengers of whom We did not narrate to you. Certainly, Allah talked to Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some messengers We have already told you about, while some messengers We have not told you about. And God spoke to Moses directly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [We sent] messengers about whom We have related [their stories] to you before and messengers about whom We have not related to you. And Allah spoke to Moses with [direct] speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:164] And, We sent, messengers We have told you of before, and messengers We have not told you of: it is related that God sent eight thousand prophets [in total], four thousand [of them] from [the Children of] Israel, and [the remaining] four thousand from other peoples, as stated by the Shaykh [Jalāl al-Dīn alMahallī] in [his commentary on] sūrat Ghāfir [Q. 40:78]; and God spoke directly, without mediation, to Moses,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And messengers We have mentioned unto thee) by name (before and messengers We have not mentioned) by name (unto thee; and Allah spake directly unto Moses);\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كما أرسلنا هؤلاء المذكورين، أرسلنا أيضاً { رُسُلاً قَدْ قَصَصْنَاهُمْ عَلَيْكَ } في كتابك { مِن قَبْلُ وَرُسُلاً لَّمْ نَقْصُصْهُمْ عَلَيْكَ وَ } كمل أمر الوحي في موسى؛ إذ { كَلَّمَ ٱللَّهُ } المرسل للرسل، المنزل للكتب { مُوسَىٰ } المتحقق بمقام القرب والوصول { تَكْلِيماً } [النساء: 164] لا يدرك كيفيته، ولا يكتنه لميته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n، { وكلم الله موسى تكليمًا } حقيقيًا، خُصَّ به من بين الأنبياء، وزاد نبينا محمد صلى الله عليه وسلم بالرؤية مع الكلام\n قال الورتجبي: بادر موسى عليه السلام من بين الأنبياء لسؤال الرؤية، فأوقفه الحق في مقام سماع كلامه، ومنعه من مشاهدة رؤيته صرفًا، وتحمل نبينا محمد صلى الله عليه وسلم أثقال السر بمطايا أسراره، ولم يسأل مشاهدة الحق جهرًا بالانبساط، فأوصله الله إلى مقام مشاهدته، ثم أسمعه كلامه بلا واسطة ولا حجاب\n قال تعالى:\n\n[النجم:10،11]\n هـ\n وقال ابن عطية: كلامه تعالى لموسى دون تكييف ولا تحديد، وكما أن الله تعالى موجود لا كالموجودات معلوم لا كالمعلومات، فكذلك كلامه لا كالكلام\n هـ",
      "translations": []
    }
  ]
}