{
  "chapter": "النساء",
  "text": "ورسلا قد قصصنهم عليك من قبل ورسلا لم نقصصهم عليك وكلم الله موسى تكليما",
  "translations": [
    {
      "translation": "There are Messengers We have already told you about and Messengers We have not told you about; and Allah spoke directly to Musa -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to many an apostle We have mentioned before, and to many other apostles We have not mentioned to you; and to Moses God spoke directly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We revealed to the Messengers We have already told you of, and to the Messengers We have not told you of; and to Moses Allah spoke directly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We sent revelations to) the Messengers mentioned to you before and also to Messengers who have not been mentioned to you. God spoke to Moses in words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to the Noble Messengers whom We have mentioned to you before, and to the Noble Messengers We have not mentioned to you; and Allah really did speak to Moosa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Messengers We have mentioned to you before, and Messengers We have not mentioned to you, and to Musa Allah spoke directly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (We sent) apostles We have mentioned to you before and apostles we have not mentioned to you; and to Musa, Allah addressed His Word, speaking (to him):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and Messengers We have already told thee of before, and Messengers We have not told thee of; and unto Moses God spoke directly --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And messengers We have mentioned unto thee before and messengers We have not mentioned unto thee; and Allah spake directly unto Moses;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have told you about some messengers sent previously, while We have not yet told you about others. God spoke to Moses directly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We Revealed unto apostles of some of whom We have narrated unto thee aforetime and of others of whom We have not narrated unto thee; and unto Musa Allah spake directly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and apostles We have recounted to you earlier and apostles We have not recounted to you—and to Moses Allah spoke directly—\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of some messengers We have already told thee the story; of others We have not;- and to Moses Allah spoke direct;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Messengers We have mentioned to you before, and Messengers We have not mentioned to you, - and to Musa (Moses) Allah spoke directly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Messengers of whom We have narrated to you before, and Messengers of whom We did not narrate to you. Certainly, Allah talked to Moses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some messengers We have already told you about, while some messengers We have not told you about. And God spoke to Moses directly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [We sent] messengers about whom We have related [their stories] to you before and messengers about whom We have not related to you. And Allah spoke to Moses with [direct] speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:164] And, We sent, messengers We have told you of before, and messengers We have not told you of: it is related that God sent eight thousand prophets [in total], four thousand [of them] from [the Children of] Israel, and [the remaining] four thousand from other peoples, as stated by the Shaykh [Jalāl al-Dīn alMahallī] in [his commentary on] sūrat Ghāfir [Q. 40:78]; and God spoke directly, without mediation, to Moses,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله : { ورُسلا قد قصصناهم عليك من قبل } يعني في آي القرآن مثل : هود ، وصالح ، وشعيب ، وزكرياء ، ويحيى ، وإلياس ، والْيسع ، ولوط ، وتبّع . ومعنى قوله : { ورسلاً لم نقصصهم عليك } لم يذكرهم الله تعالى في القرآن ، فمنهم من لم يرد ذكره في السنّة : مثل حنظلة بن صفوان نبيء أصحاب الرسّ ، ومثل بعض حكماء اليونان عند بعض علماء الحكمة .قال السهروردي في «حكمة الإشراق» : «منهم أهل السفارة» . ومنهم من ذكرته السنّة : مثل خالد بن سنَان العبسي .وإنَّما ذكر الله تعالى هنا الأنبياء الذين اشتهروا عند بني إسرائيل لأنّ المقصود محاجّتهم . وإنَّما ترك الله أن يقصّ على النّبيء صلى الله عليه وسلم أسماء كثير من الرسل للاكتفاء بمن قصّهم عليه ، لأنّ المذكورين هم أعظم الرسل والأنبياء قصصاً ذات عبر .وقوله : { وكلم الله موسى تكليما } غُيّر الأسلوب فعُدل عن العطف إلى ذكر فعل آخر ، لأنّ لهذا النّوع من الوحي مزيد أهمّيّة ، وهو مع تلك المزيّة ليس إنزال كتاب من السماء ، فإذا لم تكن عبرة إلاّ بإنزال كتاب من السماء حسب اقتراحهم ، فقد بطل أيضاً ما عدا الكلمات العشر المنزّلة في الألواح على موسى عليه السّلام .وكلام الله تعالى صفة مستقلّة عندنا ، وهي المتعلّقة بإبلاغ مراد الله إلى الملائكة والرسللِ ، وقد تواتر ذلك في كلام الأنبياء والرسل تواترا ثبت عند جميع المِلّيِّين ، فكلام الله صفة له ثبتت بالشرع لا يدلّ عليها الدليل العقليّ على التحقيق إذ لا تدلّ الأدلّة العقلية على أنّ الله يجب له إبلاغ مراده الناس بل يجوز أن يُوجد الموجودات ثم يتركها وشأنَها ، فلا يتعلّق علمه بحملها على ارتكاب حَسَن الأفعال وتجنّب قبائحها . ألا ترى أنّه خلق العجماوات فما أمرها ولا نهى ، فلو ترك النّاس فوضى كالحيوان لما ستحال ذلك . وأنّه إذا أراد حمل المخلوقات على شيء يريده فطرها على ذلك فانساقت إليه بجبلاّتها ، كما فطر النحل على إنتاج العسل ، والشجر على الإثمار . ولو شاء لحمل النّاس أيضاً على جِبِلّة لا يعدونها ، غير أنَّنا إذ قد علمنا أنَّه عالم ، وأنّه حكيم ، والعلم يقتضي انكشاف حقائق الأشياء على ما هي عليه عنده ، فهو إذ يعلم حسن الأفعال وقبحها ، يريد حصول المنافع وانتفاء المضارّ ، ويرضى بالأولى ، ويكره الثّانية ، وإذْ اقتضت حكمته وإرادته أن جعل البشر قابلاً للتعلّم والصلاح ، وجعل عقول البشر صالحة لبلوغ غايات الخير ، وغايات الشرّ ، والتفنّن فيهما ، بخلاف الحيوان الذي يبلغ فيما جبل عليه من خير أو شرّ إلى غاية فطر عليها لا يعدوها ، فكان من المتوقّع طغيان الشرّ على الخير بعمل فريق الأشرار من البشر كان من مقتضى الحكمة أن يحمل النّاس على فعل الخير الذي يرضاه ، وترككِ الشرّ الذي يكرهه ، وحملُهم على هذا قد يحصل بخلق أفاضل النّاس وجبْلهم على الصلاح والخير ، فيكونون دعاة للبشر ، لكنّ حكمة الله وفضله اقتضى أن يخلق الصالحين القابلين للخير ، وأن يعينهم على بلوغ ما جُبلوا عليه بإرشاده وهديه ، فخلق النّفوس القابلة للنبوّة والرسالة وأمدّها بالإرشاد الدالّ على مراده المعبّر عنه بالوحي ، كما اقتضاه قوله تعالى : { الله أعلم حيثُ يجعل رسالاته } \\[ الأنعام : 124 \\] فأثبت رسالة وتهيئة المرسَل لقبولها ومن هنا ثبتَت صفة الكلام .فعلمنا بأخبار الشريعة المتواترة أنّ الله أراد من البشر الصلاح وأمرهم به ، وأن أمره بذلك بلغ إلى البشر في عصور ، كثيرة وذلك يدلّ على أنّ الله يرضى بعض أعمال البشر ولا يرضى بعضها وأنّ ذلك يسمّى كلاماً نفسياً ، وهو أزلي .ثُمّ إنّ حقيقة صفة الكلام يحتمل أن تكون من متعلَّقات صفة العلم ، أو من متعلَّقات صفة الإرادة ، أو صفة مستقلّة متميّزة عن الصفتين الأخريين؛ فمنهم من يقول : عَلم حاجة النّاس إلى الإرشاد فأرشدهم ، أو أرادَ هَدي الناس فأرشدهم . ونحن نقول : إنّ الإلهية تقتضي ثبوت صفات الكمال الّتي منها الرضا والكراهيّة والأمر والنهي للبشر أو الملائكة ، فثبتت صفة مستقلّة هي صفة الكلام النفسي؛ وكلّ ذلك متقارب ، وتفصيله في علم الكلام .أمّا تكليم الله تعالى بعض عباده من الملائكة أو البشر فهو إيجاد ما يعرِف منه الملَك أو الرسول أنّ الله يأمر أوْ ينهَى أو يخبر . فالتكليم تعلُّق لصفة الكلام بالمخاطب على جَعْل الكلام صفة مستقِلّة ، أو تعلّق العِلم بإيصال المعلوم إلى المخاطب ، أو تعلّق الإرادة بإبلاغ المراد إلى المخاطب . فالأشاعرة قالوا : تكليم الله عبده هو أن يخلق للعبد إدراكاً من جهة السمع يتحصّل به العلم بكلام الله دون حروف ولا أصوات . وقد ورد تمثيله بأنّ موسى سمع مِثْل الرعد عَلِم منه مدلول الكلام النفسي . قلت : وقد مثّله النبي صلى الله عليه وسلم في الحديث الصحيح عن أبي هريرة \" أنّ الله تعالى إذا قضى الأمر في السماء ضرَبَتْ الملائكة بأجنحتها خُضْعَاناً لقولِهِ كأنَّه سِلْسِلَة على صَفْوَاننٍ فإذا فُزّع عن قلوبهم قالوا : ماذا قال ربّكم ، قالوا للّذي قالَ «الحقّ وهو العليّ الكبير \" فعلى هذا القول لا يلزم أن يكون المسموع للرسول أو الملك حروفاً وأصواتاً بل هو علم يحصل له من جهة سمعه يتّصل بكلام الله ، وهو تعلّق من تعلّقات صفة الكلام النفسي بالمكلِّم فيما لا يَزال ، فذلك التعلّق حادث لا محالة كتعلّق الإرادة . وقالت المعتزلة : يخلق الله حروفاً وأصواتاً بلغة الرسول فيسمعها الرسول ، فيعلم أنّ ذلك من عند الله ، بعلم يجده في نفسه ، يعلم به أنّ ذلك ورد إليه من قِبَل الله ، إلاّ أنَّه ليس بواسطة الملك ، فهم يفسّرونه بمثل ما نفسّر به نحن نزول القرآن؛ فإسناد الكلام إلى الله مجاز في الإسناد ، على قولهم ، لأنّ الله منزّه عن الحروف والأصوات . والكلام حقيقة حروف وأصوات ، وهذه سفسطة في الدليل لأنّه لا يقول أحد بأنّ الحروف والأصوات تتّصف بها الذات العليّة . وهو عندنا وعندهم غير الوحي الذي يقع في قلب الرسول ، وغير التبليغ الذي يكون بواسطة جبريل ، وهو المشار إليه بقوله تعالى : { أوْ مِنْ وراء حِجاب } \\[ الشورى : 51 \\] .أمّا كلام الله الواردُ للرسول بواسطة الملَك وهو المعبّر عنه بالقرآن وبالتّوراة والإنجيل وبالزّبور : فتلك ألفاظ وحروف وأصوات يعلِّمها الله للملك بكيفية لا نعلمها ، يَعلَم بها الملَكُ أنّ الله يَدلّ ، بالألفاظ المخصوصة الملقاةِ للملَك ، على مدلولاتتِ تلك الألفاظ فيلقيها الملَك على الرسول كما هي قال تعالى :{ أو يرسلُ رسولاً فيوحي بإذنه ما يشاء } \\[ الشورى : 51 \\] وقال : { نزل به الروح الأمين على قبلك لتكون من المنذِرين بلسان عربيّ مُبين } \\[ الشعراء : 193 195 \\] . وهذا لا يمتري في حدوثه من له نصيب من العلم في الدّين . ولكن أمسك بعض أيمّة الإسلام عن التصريح بحدوثه ، أو بكونه مخلوقاً ، في مجالس المناظرة التي غشيتْها العامَّة ، أو ظُلمة المكابرة ، والتحفّز إلى النبز والأذَى : دفعاً للإيهام ، وإبقاء على النسبة إلى الإسلام ، وتنصّلاً من غوغاء الطغام ، فَرَحم الله نفوساً فُتنت ، وأجسَاداً أوجعت ، وأفواهاً سكتت ، والخير أرادوا ، سواء اقتصدوا أم زادوا . والله حسيب الذين ألّبوا عليهم وجمعوا ، وأغروا بهم وبئس ما صنعوا .وقوله { تكليماً } مصدر للتوكيد . والتوكيد بالمصدر يرجع إلى تأكيد النسْبة وتحقيقها مثل ( قَدْ ) و ( إنّ ) ، ولا يقصد به رفع احتمال المجاز ، ولذلك أكّدت العرب بالمصدر أفعالاً لم تستعمل إلاّ مجازاً كقوله تعالى : { إنَّما يريد الله ليذهب عنكم الرجس أهل البيت ويطهّركم تطهيراً } فإنَّه أراد أنّه يطهّرهم الطهارة المعنوية ، أي الكمال النفسي ، فلم يفد التأكيد رفع المجاز . وقالت هند بنت النعمان بن بشير تذمّ زوجها رَوْح بن زِنْباع :بَكَى الخَزّ من رَوْح وأنْكَرَ جِلْده ... وعجَّتْ عجيجاً من جُذَامَ المَطَارفوليس العجيج إلاّ مجازاً ، فالمصدر يؤكِّد ، أي يُحقِّق حصول الفعْل الموكَّد على ما هو عليه من المعنى قبل التَّأكيد .فمعنى قوله : { تكليماً } هنا : أنّ موسى سمع كلاماً من عند الله ، بحيث لا يحتمل أنّ الله أرسل إليه جبريل بكلام ، أو أوحى إليه في نفسه . وأمّا كيفية صدور هذا الكلام عن جانب الله فغرض آخر هو مجال للنظر بين الفِرق ، ولذلك فاحتجاج كثير من الأشاعرة بهذه الآية على كون الكلام الَّذي سمعه موسى الصفة الذاتية القائمة بالله تعالى احتجاج ضعيف . وقد حكى ابن عرفة أنّ المازري قال في «شرح التلقين» : إنّ هذه الآية حجّة على المعتزلة في قولهم : إنّ الله لم يكلّم موسى مباشرة بل بواسطة خَلق الكلام لأنَّه أكَّده بالمصدر ، وأنّ ابن عبد السلام التّونسي ، شيخ ابن عرفة ، ردّه بأنّ التأكيد بالمصدر لإزالة الشكّ عن الحديث لا عن المحدّث عنه . وتعقّبه ابن عرفة بما يؤول إلى تأييد ردّ ابن عبد السلام .\n\n",
      "translations": [
        {
          "translation": "(And messengers We have mentioned unto thee) by name (before and messengers We have not mentioned) by name (unto thee; and Allah spake directly unto Moses);\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أرسلنا أيضاً { رُسُلاً قَدْ قَصَصْنَاهُمْ عَلَيْكَ } في كتابك { مِن قَبْلُ وَرُسُلاً لَّمْ نَقْصُصْهُمْ عَلَيْكَ وَ } كمل أمر الوحي في موسى\n إذ { كَلَّمَ ٱللَّهُ } المرسل للرسل\n المنزل للكتب { مُوسَىٰ } المتحقق بمقام القرب والوصول { تَكْلِيماً } [النساء: 164] لا يدرك كيفيته\n ولا يكتنه لميته\n\n\nوإنما أرسلنا { رُّسُلاً } وأنزلنا معهم كتباً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { رسلاً }: منصوب بمحذوف دل عليه\n { أوحينا } \n أي: أرسلنا رسلاً\n أو يفسره ما بعده\n أي: قصصنا عليك رسلاً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:62",
      "similarity": 0.5854586851178927
    },
    {
      "verse": "7:7",
      "similarity": 0.5762055185208348
    },
    {
      "verse": "16:118",
      "similarity": 0.48392341956012547
    },
    {
      "verse": "12:3",
      "similarity": 0.4758030335531843
    },
    {
      "verse": "27:76",
      "similarity": 0.45362688259523615
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004164.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004164.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:164.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}