{
  "chapter": "النساء",
  "text": "يايها الناس قد جاءكم الرسول بالحق من ربكم فـامنوا۟ خيرا لكم وان تكفروا۟ فان لله ما فى السموت والارض وكان الله عليما حكيما",
  "translations": [
    {
      "translation": "Mankind! the Messenger has brought you the truth from your Lord, so it is better for you to have iman. But if you are kafir, everything in the heavens and the earth belongs to Allah. Allah is All-Knowing, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, the Apostle has now come to you, bringing the truth from your Lord; so believe for your own good; but if you deny (then remember) that all that is in the heavens and the earth belongs to God; and God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men! Now that the Messenger has come to you bearing the Truth from your Lord, believe in him; it will be good for you. If you reject, know well that to Allah belongs all that is in the heavens and the earth. Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind, the Messenger has come to you from your Lord in all Truth. It is for your own good to believe in him, but if you disbelieve, know that to God belongs all that is in the heavens and the earth. God is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! This Noble Messenger (Prophet Mohammed – peace and blessings be upon him) has come to you with the truth from your Lord, so accept faith for your own good; and if you disbelieve, then undoubtedly to Allah only belongs all whatever is in the heavens and in the earth; and Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Verily, there has come to you the Messenger with the truth from your Lord. So believe in him, it is better for you. But if you disbelieve, then certainly to Allah belongs all that is in the heavens and the earth. And Allah is Ever All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! surely the Apostle has come to you with the truth from your Lord, therefore believe, (it shall be) good for you and If you disbelieve, then surely whatever is in the heavens and the earth is Allah's; and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O men, the Messenger has now come to you with the truth from your Lord; so believe; better is it for you. And if you disbelieve, to God belongs all that is in the heavens and in the earth; and God is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! The messenger hath come unto you with the Truth from your Lord. Therefor believe; (it is) better for you. But if ye disbelieve, still, lo! unto Allah belongeth whatsoever is in the heavens and the earth. Allah is ever Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mankind! The Messenger has brought you the truth from your Lord, so believe for your own good. And if you deny the truth, know that to God belongs all that the heavens and the earth contain. God is all knowing and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye mankind! assuredly there hath come unto you the Prophet with the truth from your Lord wherefore believe that it may be well for you. And if ye disbelieve, then verily Allah's is whatsoever is in the heavens and the earth; and Allah is ever Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! The Apostle has certainly brought you the truth from your Lord. So have faith! That is better for you. And if you are faithless, [you should know that] to Allah indeed belongs whatever is in the heavens and the earth, and Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Mankind! The Messenger hath come to you in truth from Allah: believe in him: It is best for you. But if ye reject Faith, to Allah belong all things in the heavens and on earth: And Allah is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind! Verily, there has come to you the Messenger (Muhammad SAW) with the truth from your Lord, so believe in him, it is better for you. But if you disbelieve, then certainly to Allah belongs all that is in the heavens and the earth. And Allah is Ever All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people, the Messenger (Prophet Muhammad) has come to you with the truth from your Lord, so believe, it is better for you. If you disbelieve, to Allah belongs all that is in the heavens and the earth. And Allah is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people! The Messenger has come to you with the truth from your Lord, so believe—that is best for you. But if you disbelieve, to God belongs everything in the heavens and the earth. God is Omniscient and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Mankind, the Messenger has come to you with the truth from your Lord, so believe; it is better for you. But if you disbelieve - then indeed, to Allah belongs whatever is in the heavens and earth. And ever is Allah Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:170] O people, of Mecca, the Messenger, Muhammad (s), has now come to you with the truth from your Lord; so believe, in him and seek what, it is better for you, than that which you are presently seeking. And if you disbelieve, in him, then surely to God belongs all that is in the heavens and in the earth, as possessions, creatures and servants, and your disbelief will not harm Him; and God is ever Knowing, of His creation, Wise, in what He does with them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 mankind!) people of Mecca (The messenger) Muhammad (hath come unto you with the Truth) with the declaration of Allah's divine Oneness and the Qur'an (from your Lord. Therefore believe) in Muhammad and the Qur'an; ((it is) better for you) than that which you are in now. (But if ye disbelieve) in Muhammad and the Qur'an, (still, lo! Unto Allah belongeth whatsoever is in the heavens and the earth) they are all His bondsmen and bondswomen. (Allah is ever Knower) of those who believe and those who do not, (Wise) in that He ordained that they should not worship other than Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما بيَّن سبحانه حقيَّة الرسول صلى الله عليه وسلم، وصدقه في دعواه، وأوعد على من كذبه وخالف كتابه ما أوعد، أراد أن ينبه على عامة أهل التكليف من أرباب الملل وغيرهم أن يؤمنوا له، وما جاء به من عنده، فقال منادياً؛ ليقبلوا عليه: { يٰأَيُّهَا ٱلنَّاسُ } المجبولون على النيسان والغفلة { قَدْ جَآءَكُمُ ٱلرَّسُولُ } أي: المبعوث إلى كافة الخلق ملتبساً { بِٱلْحَقِّ } المطابق للواقع { مِن رَّبِّكُمْ } الذي رباكم بنعمة العقل الذي هو مناط جميع التكاليف، وبه الوصول إلى الإيمان والتوحيد\n\n\n\n\n{ فَآمِنُواْ خَيْراً لَّكُمْ } أي: فإن آمنوا به بعد ما ظهر كان خيراً لكم عند ركبم، يوصلكم إلى توحيده، { وَإِن تَكْفُرُواْ } به عناداً، ولم تؤمنوا به مكابرة، لا يبالي الله بكفركم، ولا بإيمانكم { فَإِنَّ للَّهِ } أي: يسجد ويخضع له جميع { مَا فِي ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } إرادة وطوعاً { وَكَانَ ٱللَّهُ } المكلف لأمر عباده { عَلِيماً } بقابلياتهم { حَكِيماً } [النساء: 170] فيما أمرهم به وكلفهم عليه؛ ليفوزوا من عنده فوزاً عظيماً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { فآمنوا خيرًا لكم } ، و { انتهوا خيرًا لكم }: قال سيبويه: هو منصوب بفعل مضمر، تقديره: وائتوا خيرًا لكم، وقال الخليل: منصوب بآمنوا وبانتهوا على المعنى\n أي: اقصدوا\n وقال الفراء صفة لمصدر، أي: آمنوا إيمانًا خيرًا لكم\n وقال بعض الكوفيين: هو خبر كان المحذوفة، وتقديره: ليكن الإيمان خيرًا لكم\n قلت: وهو أظهر من جهة المعنى، وإن منعه البصريون، قالوا: لأنَّ { كان } لا تحذف مع اسمها إلا في مواضع مخصوصة، قال ابن مالك:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:108",
      "similarity": 0.4640253863179639
    },
    {
      "verse": "29:44",
      "similarity": 0.4299981766173967
    },
    {
      "verse": "43:84",
      "similarity": 0.4207571575607386
    },
    {
      "verse": "33:1",
      "similarity": 0.3604565691798267
    },
    {
      "verse": "4:136",
      "similarity": 0.3442133774000593
    }
  ]
}