{
  "chapter": "النساء",
  "text": "انما التوبة على الله للذين يعملون السوء بجهلة ثم يتوبون من قريب فاو۟لئك يتوب الله عليهم وكان الله عليما حكيما",
  "translations": [
    {
      "translation": "God does accept repentance, but only of those who are guilty of an evil out of ignorance yet quickly repent, and God turns to them again, for God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remember that) Allah's acceptance of repentance is only for those who commit evil out of ignorance and then soon repent. It is towards such persons that Allah turns graciously. Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will only accept the repentance of those who commit evil in ignorance, if they repent immediately. God is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Undoubtedly the repentance which Allah has by His grace made obligatory upon Himself to accept, is only the repentance of those who commit sin in folly and then soon repent – towards them does Allah incline in mercy; and Allah is the All Knowing, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah accepts only the repentance of those who do evil in ignorance and foolishness and repent soon [afterwards]; it is they to whom Allah will forgive and Allah is Ever All-Knower, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Repentance with Allah is only for those who do evil in ignorance, then turn (to Allah) soon, so these it is to whom Allah turns (mercifully), and Allah is ever Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God shall turn only towards those who do evil in ignorance, then shortly repent; God will return towards those; God is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forgiveness is only incumbent on Allah toward those who do evil in ignorance (and) then turn quickly (in repentance) to Allah. These are they toward whom Allah relenteth. Allah is ever Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But God undertakes to accept repentance only from those who do evil out of ignorance and those who repent soon after. God turns towards such people with mercy; He is all knowing and all wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With Allah is the repentance of those alone who do an evil foolishly and thereafter repent speedily, surely it is they unto whom Allah shall relent. And Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Acceptance of] repentance by Allah is only for those who commit evil out of ignorance and then repent promptly. It is such whose repentance Allah will accept, and Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah accept the repentance of those who do evil in ignorance and repent soon afterwards; to them will Allah turn in mercy: For Allah is full of knowledge and wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah accepts only the repentance of those who do evil in ignorance and foolishness and repent soon afterwards; it is they to whom Allah will forgive and Allah is Ever All-Knower, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah accepts) the repentance from only those who commit evil in ignorance and then quickly turn to Him in repentance. Allah will relent towards them. Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Repentance is available from God for those who commit evil out of ignorance, and then repent soon after. These—God will relent towards them. God is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The repentance accepted by Allah is only for those who do wrong in ignorance [or carelessness] and then repent soon after. It is those to whom Allah will turn in forgiveness, and Allah is ever Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:17] The repentance that God accepts, that is, the one which He has prescribed for Himself to accept, out of His bounty, is only of those who do evil, an act of disobedience, in ignorance (bi-jahālatin, a circumstantial qualifier, in other words, ‘they are ignorant’ while they are disobeying their Lord); then repent shortly thereafter, before the last gasps of death; God will relent to those, He will accept their repentance. And God is ever Knowing, of His creatures, Wise, in what He does with them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah accepteth the repentance of those who do evil in ignorance) even if they do so purposefully while being ignorant of its respective punishment ((and) then turn quickly (in repentance) to Allah) before being led away for punishment or at the moment of suffering from the pangs of death. (These are they towards whom Allah relenteth) Allah overlooks the sins of these. (Allah is ever Knower) of your repentance, (Wise) by accepting your repentance before death, while does not accept it when one is suffering from the pangs of death or after one dies.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لِلَّذِينَ يَعْمَلُونَ ٱلسُّوۤءَ بِجَهَالَةٍ } [معناهُ] بِعَمْدٍ\n ويقالُ بِعَمْدٍ وَبِغَيْرِ عَمْدٍ\n\n\n\n\nوقوله تعالى: { ثُمَّ يَتُوبُونَ مِن قَرِيبٍ } قالَ زيدُ بن علي عليهما السلامُ: كُلُّ شَيءٍ دُونَ المَوتِ؛ فَهْوَ قَريبٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { إِنَّمَا ٱلتَّوْبَةُ } أي: ما التوبة المبرورة المقبولة إلا التوبة الناشئة من محض الندامة المتفرعة على تنبيه القلب عن قبيح المعصية، وهي المصححة، الباعثة { عَلَى } قبول { ٱللَّهِ } إياها، النافعة { لِلَّذِينَ } أي: للمؤمنين الذين { يَعْمَلُونَ ٱلسُّوۤءَ } الفعلة الذميمة لا عن قصد وروية، بل { بِجَهَالَةٍ } عن قبحه ووخامة عاقبته { ثُمَّ } لمَّا تأملوا وأدركوا قبحها { يَتُوبُونَ } يبادرون إلى التوبة والرجوع { مِن } زمانٍ { قَرِيبٍ } أي: قبل الانتهاء إلى وقت الإلجاء { فَأُوْلَـٰئِكَ } التائبون، المبادرون على التوبة قبل حلول الأجل { يَتُوبُ ٱللَّهُ عَلَيْهِمْ } أي: يقبل توبتهم بعدما وفقهم عليها، ولقنهم بها { وَكَانَ ٱللَّهُ } المطلع على ضمائرهم { عَلِيماً } بمعاصيهم في سابق علمه { حَكِيماً } [النساء: 17] في إلزام التوبة عليهم ليجبروا بها ما انكسروا على نفوسهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { إنما التوبة } التي يُستحق { على الله } قبولُها فضلاً وإحسانًا هي { للذين يعملون السوء } أي: المعاصي متلبسين { بجهالة } أي: سفاهة وجهل وسوء أدب، فكل من اشتغل بالمعصية فهو جاهل بالله، قد انتزع منه الإيمان حتى يفرغ، وإن كان عالمًا بكونها معصية، { ثم يتوبون } بعد تلك المعصية { من قريب } أي: من زمن قريب، وهو قبل حضور الموت لقوله بعدُ: { حتى إذا حضر أحدهم الموت } ، وقوله ـ عليه الصلاة والسلام ـ:\n\n \" إن الله يقبلُ توبةَّ العبْدِ مَا لمْ يُغَرْغِرُ \" \n\nوإنما جعله قريبًا لأن الدنيا سريعة الزوال، متاعها قليل وزمانها قريب، { فأولئك يتوب الله عليهم } تصديقاً لوعده المتقدم، { وكان الله عليمًا } بإخلاصهم التوبة، { حكيمًا } في ترك معاقبة التائب، إذ الحكمة هي وضع الشيء في محله\n وعن الحسن: قال: قال النبي صلى الله عليه وسلم\n\n \" لما أُهبط إبليسُ قال: وعزتك وعظمتك لا أفارق ابنَ آدم حتى تفارقَ روحُه جسدَه، قال الله تعالى: وعزتي وعظمتي لا أحجب التوبة عن عبدي حتى يغرغر بها \" \n\nوعن أبي سعيد الخدري أن النبي صلى الله عليه وسلم قال:\n\n \" إنّ الشيطانَ قال: وعزتِك لا أبرح أُغوى عبادكَ، ما دامتْ أرواحهم في أجسادهم\n قال الله تعالى: وعزتي وجلالي وارتفاع مكاني لا أزال أغفر لهم ما استغفروني \"\n \n\nقال ابن جزي: وإذا تاب العبد توبة صحيحة بشروطها، فيُقطع بقبول توبت عند جمهور العلماء\n وقال أبو المعالي: يَغُلِب ذلك على الظن ولا يقعطع\n هـ",
      "translations": []
    }
  ]
}