{
  "chapter": "النساء",
  "text": "يستفتونك قل الله يفتيكم فى الكللة ان امرؤا۟ هلك ليس له ولد وله اخت فلها نصف ما ترك وهو يرثها ان لم يكن لها ولد فان كانتا اثنتين فلهما الثلثان مما ترك وان كانوا۟ اخوة رجالا ونساء فللذكر مثل حظ الانثيين يبين الله لكم ان تضلوا۟ والله بكل شىء عليمۢ",
  "translations": [
    {
      "translation": "They will ask you for a fatwa. Say: 'Allah gives you a fatwa about people who die without direct heirs: If a man dies childless but has a sister she receives half of what he leaves, and he is her heir if she dies childless. If there are two sisters they receive two-thirds of what he leaves. If there are brothers and sisters the knowledge of all things.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you for judgement about 'Kalalah' (a man who dies childless). Say: \"God has given a decision in the matter of inheritance.\" If a man dies and leaves no child behind but have a sister, she will get a half of what he owned, as he would have done the whole of what she possessed if she had died a childless person. In ease he has two sisters then they will get two-thirds of the heritage. But if he has both brothers and sisters, the male will inherit a share equal to that of two females. God makes this manifest to you lest you wander astray, for God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People ask you to pronounce a ruling concerning inheritance from those who have left behind no lineal heirs (kalalah). Say: 'Allah pronounces for you the ruling: should a man die childless but have a sister, she shall have one half of what he has left behind; and should the sister die childless, his brother shall inherit her. And if the heirs are two sisters, they shall have two-thirds of what he has left behind. And if the heirs are sisters and brothers, then the male shall have the share of two females. Allah makes (His commandments) clear to you lest you go astray. Allah has full knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), they seek your verdict. Tell them, \"God commands this concerning your kindred: If a man dies childless but has a sister, she will receive half of the legacy. If a woman dies childless, her brother will receive the whole legacy. If a childless man leaves only two sisters, both will receive two-thirds of the legacy. If the heirs are both sisters and brothers, the share of a male will be twice as much as the share of the female. God explains His Laws to you so that you will not go astray. God knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O dear Prophet (Mohammed – peace and blessings be upon him), they ask you for a decree; say, “Allah decrees you concerning the solitary person (without parents or children); if a man dies childless and has a sister, for her is half the inheritance; and the man is his sister’s heir if the sister dies childless; and if there are two sisters, for them is two-thirds of the inheritance; so if there are brothers and sisters, both men and women, the male’s share is equal to that of two females; and Allah explains clearly to you, so that you do not go astray; and Allah knows all things.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you for a legal verdict. Say: \"Allah directs (thus) about Al-Kalalah. If it is a man that dies leaving a sister, but no child, she shall have half the inheritance, and [in her case] he will be her heir if she has no children. If there are two sisters, they shall have two-thirds of the inheritance; if there are brothers and sisters, the male will have twice the share of the female. (Thus) does Allah make clear to you (His Law) lest you go astray. And Allah is the All-Knower of everything.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you for a decision of the law. Say: Allah gives you a decision concerning the person who has neither parents nor offspring; if a man dies (and) he has no son and he has a sister, she shall have half of what he leaves, and he shall be her heir she has no son; but if there be two (sisters), they shall have two-thirds of what he leaves; and if there are brethren, men and women, then the male shall have the like of the portion of two females; Allah makes clear to you, lest you err; and Allah knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will ask thee for a pronouncement. Say: 'God pronounces to you concerning the indirect heirs. If a man perishes having no children, but he has a sister, she shall receive a half of what he leaves, and he is her heir if she has no children. If there be two sisters, they shall receive two-thirds of what he leaves; if there be brothers and sisters, the male shall receive the portion of two females. God makes clear to you, lest you go astray; God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee for a pronouncement. Say: Allah hath pronounced for you concerning distant kindred. If a man die childless and he have a sister, hers is half the heritage, and he would have inherited from her had she died childless. And if there be two sisters, then theirs are two-thirds of the heritage, and if they be brethren, men and women, unto the male is the equivalent of the share of two females. Allah expoundeth unto you, so that ye err not. Allah is Knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you for instruction. Say, \"God instructs you concerning the indirect heirs. If a person dies childless but has a sister, she receives half of what he leaves, and he is her heir if she dies childless. If there are two sisters, they receive two-thirds of what he leaves. If there are brothers and sisters, the share of each male shall be that of two females. God makes things clear to you, so that you will not go astray. God has knowledge of all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee for pronouncement. Say thou: Allah pronounceth thus in the matter of one without father or child: if a person perisheth and hath no child, but hath a sister, hers shall be the half of that which he hath left: and he shall be her heir if she hath no child, if there be two sisters, then theirs shall be two-third of that which he hath left; and if there be both brothers and sisters, then male shall have as much as the portion of two females. Allah expoundeth unto you, lest ye err; and Allah is of everything Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you for a ruling. Say, ‘Allah gives you a ruling concerning the kalalah: If a man dies and has no children [or parents], but has a sister, for her shall be a half of what he leaves, and he shall inherit from her if she has no children. If there be two sisters, then they shall receive two-thirds of what he leaves. But if there be [several] brothers and sisters, then for the male shall be the like of the share of two females. Allah explains [the laws] for you lest you should go astray, and Allah has knowledge of all things.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee for a legal decision. Say: Allah directs (thus) about those who leave no descendants or ascendants as heirs. If it is a man that dies, leaving a sister but no child, she shall have half the inheritance: If (such a deceased was) a woman, who left no child, Her brother takes her inheritance: If there are two sisters, they shall have two-thirds of the inheritance (between them): if there are brothers and sisters, (they share), the male having twice the share of the female. Thus doth Allah make clear to you (His law), lest ye err. And Allah hath knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you for a legal verdict. Say: \"Allah directs (thus) about Al-Kalalah (those who leave neither descendants nor ascendants as heirs). If it is a man that dies, leaving a sister, but no child, she shall have half the inheritance. If (such a deceased was) a woman, who left no child, her brother takes her inheritance. If there are two sisters, they shall have two-thirds of the inheritance; if there are brothers and sisters, the male will have twice the share of the female. (Thus) does Allah makes clear to you (His Law) lest you go astray. And Allah is the All-Knower of everything.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will ask you for a verdict. Say: 'Allah rules for you concerning the indirect heir (alkalalah which is), if a person dies, having no children, but he has a sister, she shall receive half of what he leaves, and he is her heir if she has no children. If there are two sisters, they shall receive twothirds of what he leaves, if there are siblings, men and women, for a male like the share of two females. Allah clarifies to you, lest you go astray, Allah is Knowledgeable of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you for a ruling. Say, “God gives you a ruling concerning the person who has neither parents nor children.” If a man dies, and leaves no children, and he had a sister, she receives one-half of what he leaves. And he inherits from her if she leaves no children. But if there are two sisters, they receive two-thirds of what he leaves. If the siblings are men and women, the male receives the share of two females.” God makes things clear for you, lest you err. God is Aware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They request from you a [legal] ruling. Say, \"Allah gives you a ruling concerning one having neither descendants nor ascendants [as heirs].\" If a man dies, leaving no child but [only] a sister, she will have half of what he left. And he inherits from her if she [dies and] has no child. But if there are two sisters [or more], they will have two-thirds of what he left. If there are both brothers and sisters, the male will have the share of two females. Allah makes clear to you [His law], lest you go astray. And Allah is Knowing of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:176] They will ask you for a pronouncement, concerning indirect heirs. Say: ‘God pronounces to you concerning indirect heirs. If a man (in imru’un is in the nominative because of the verb [halaka, ‘perishes’] that explains it) perishes, dies, having no children, and no parent, and this is the one referred to as an indirect heir (kalāla), but he has a sister, from both parents or from one, hers is half of what he leaves, and he, a brother, similarly, is her heir, in all that she leaves, if she has no children: but if she has a son, then he [the maternal uncle] receives nothing, and if a daughter, then whatever is left after her share; if the brother and sister be from the same mother, then the one receives a sixth, as was stipulated at the beginning of the sūra [Q. 4:11]. If there be two sisters, or more — for this was revealed regarding Jābir [b. ‘Abd Allāh], who died and was survived by sisters —, theirs are two-thirds of what he, the brother, leaves; if there be, among the inheritors, siblings, men and women, then the male, among them, shall receive the equivalent of the portion of two females. God makes clear to you, the stipulations of your religion, lest you go astray; and God has knowledge of all things’, including [matters of] inheritance: it is reported by the two Shaykhs [Bukhārī and Muslim] that al-Barā’ [b. ‘Āzib] said that this was the last of the ‘duty’ verses to be revealed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They ask thee for a pronouncement) Muhammad. This verse was revealed about Jabir Ibn 'Abdullah al- Ansari who asked the Prophet (pbuh): I have a sister. What do I inherit from her if she dies? So Allah said: they ask you, Muhammad, about the inheritance of al-Kalalah (Say: Allah hath pronounced for you) Allah clarifies for you (concerning distant kindred) concerning the inheritance of al-Kalalah which is anyone other than the father and the son. He said: (If a man dies childless) and his father is also deceased (and he has a sister) a full sister, or half sister from his father's side, (hers is half the heritage) left by the deceased person, (and he would have inherited from her had she died childless) without sons or daughters. (And if there be two sisters) full sisters or half sisters from the father's side, (then theirs are two-thirds of the heritage) that the deceased person has left behind, (and if they be brethren, men and women) male or female, full siblings or half siblings from the father, (unto the male is the equivalent of the share of two females. Allah expoundeth unto you) the division of estates, (so that ye err not) in the division of estates. (Allah is Knower of all things) of the divisions of estates and other things'. And of the surah in which the Table Spread is mentioned, which is Medinan in its entirety: (Al-Ma'idah)\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَسْتَفْتُونَكَ } يا أكمل الرسل عن ميراث الكلالة: كيف يُقسم؟ { قُلِ } لهم: { ٱللَّهُ يُفْتِيكُمْ فِي ٱلْكَلاَلَةِ } في أوائل السورة، ويعيد في آخرها، تأكيداً أو مبالغةً، وهي آخر ما نزلت في الأحكام { إِن ٱمْرُؤٌ هَلَكَ } وحين هَلَك { لَيْسَ لَهُ وَلَدٌ } لا ذكر ولا أنثى { وَ } الحال أن { لَهُ أُخْتٌ } من الأبوين أو الأب { فَلَهَا نِصْفُ مَا تَرَكَ } الهالك { وَ } ذا هلكت الأخت { هُوَ يَرِثُهَآ } جميع مالها { إِن لَّمْ يَكُنْ لَّهَآ وَلَدٌ } لا ذكر ولا أنثى\n\n\n\n\n{ فَإِن كَانَتَا } الأختان { ٱثْنَتَيْنِ فَلَهُمَا ٱلثُّلُثَانِ مِمَّا تَرَكَ } أخوهما { وَإِن كَانُوۤاْ } أي: الوارثون { إِخْوَةً } وأخواتٍ مختلطين { رِّجَالاً وَنِسَآءً فَلِلذَّكَرِ مِثْلُ حَظِّ ٱلأُنثَيَيْنِ } من متروكات أخيهم، وإنمَّا { يُبَيِّنُ ٱللَّهُ لَكُمْ } حكم الكلالة هاهنا، مع أنه بيَّنه في ما مضى؛ كراهة { أَن تَضِلُّواْ } وتغفلوا عنها { وَٱللَّهُ } المدبر لأموركم { بِكُلِّ شَيْءٍ } من حوائجكم المتعلقة بحياتكم ومماتكم { عَلِيمٌ } [النساء: 176] يعلمكم، وينبهكم عليه حتى لا تذهلوا وتنصفوا به\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها الطالب لتحقيق الحق، القاصد نحو توحيده - أوصلك الله إلى أقصى مرامك - أن تتمسك بالبرهان الواضح الذي وصل إليك من الرسول صلى الله عليه وسلم، الدال على توحيد الحق، وتستنير بنور القرآن الفارق بين الحق والباطل، الواقع في طريقه، وتمتثل بما فيه من الأوامر المؤدية إليه، وتجنب عن نواهيه المضلة، المبعدة عنه، وتتخلق بعزائمه المكنونة في ضمن الأحكام والقصص المذكورة فيه؛ لتتحقق بما رمز فيه من غوامض سر التوحيد، وسريان الوحدة في ملابس الكثرة، وتتمكن في مقر الوحدة الذاتية، المفنية للهويات الباطلة، الزائلة في أنفسها\n\n\n\n\nولا يتيسر لك هذا إلا بطول خدمة المرشد الكامل، المكمل الذي يرشدك إلى الله امتداد حبل الله الممدود من أزل الذات إلى أبد الأسماء والصفات، ألا وهو القرآن المنزل على خير الأنام كما قال صلى الله عليه وسلم:\n\n \" القرآن حبل الله، ممدود من السماء إلى الأرض \"\n \n\n \n\nفمن أراد أن يغوص في لحجج بحار القرآن، لاستخراج فرائد اليقين والعرفان، فعليه أن يتمسك أولاً بالأحكام الشرعية الفرعية التي استنبطها أرباب العزائم الصحيحة عن ظواهر كلم القرآن؛ ليكون مهذباً لظواهر أصحاب اليقظة من أهل الطلب والإرادة حتى تستعد بها نفوسهم، وتتصفى بواطنهم لأن يفيض عليها رشحات بحر التوحيد، ويصبر قابلاً لأن ينزل عليها سلطان العشق والمحبة؛ إذ الوقاية للب التوحيد إنما هي أحكام الشريعة، وآداب الطريقة للسالكين، القاصدين نحو الحقيقة بالسلوك والمجاهدة\n\n\n\n\nوأم البدلاء المستغرقون في بحر الذات، الهائمون بمطالعة جماله، الفانون فيه مطلقاً، فهم هو، وهو هم، ما لنا ومالهم حتى تتكلم عنهم، جعلنا الله من خدَّام وتراب أقدامهم\n\n\n\n\nفعليك أيها المريد، العازم لسلوك طريق الفناء، الجازم، الحازم في هذا العزم أن تصفي أولاً سرك وسريرتك عن التوجه إلى غير الحق، وتجعل مطلبك ومقصودك الاستغراق والفناء في بحر الوحدة\n\n\n\n\nلا يتيسر لك هذا إلا بعد كسر سفينة هويتك الباطلة، ولا يتيسر كسرها إلا بالرياضاتت الشاقة من الجوع والعطش والسهر المفرط، والانقطاع عن اللذات الحسية والمشتهيات النفسية بالتلذذ بالمودة والفناء، والصبر على البلاء، والرضا على ما جرى عليه القضاء، ومتى تحققت هذه الأمور فيك، وَهَن هويتك، وضعف سفينتك، وحينئذٍ يمكنك كسرها إن وفقت بها\n\n\n\n\nزين بلطفك ظواهرنا بشريعتك، وبواطننا بحقيقتك، وأسرارنا بمشاهدتك وأرواحنا بمعاينتك، إنك على ما تشاء قدير، وبرجاء المؤمنين جدير\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:11",
      "similarity": 0.6125273126551065
    },
    {
      "verse": "4:12",
      "similarity": 0.41772736071016336
    },
    {
      "verse": "41:35",
      "similarity": 0.34250519537480506
    },
    {
      "verse": "3:176",
      "similarity": 0.32007034565804743
    },
    {
      "verse": "73:3",
      "similarity": 0.3110079487608599
    }
  ]
}