{
  "chapter": "النساء",
  "text": "ياهل الكتب لا تغلوا۟ فى دينكم ولا تقولوا۟ على الله الا الحق انما المسيح عيسى ابن مريم رسول الله وكلمته القىها الى مريم وروح منه فـامنوا۟ بالله ورسله ولا تقولوا۟ ثلثة انتهوا۟ خيرا لكم انما الله اله وحد سبحنه ان يكون له ولد له ما فى السموت وما فى الارض وكفى بالله وكيلا",
  "translations": [
    {
      "translation": "People of the Book! do not go to excess in your deen. Say nothing but the truth about Allah. The and a Spirit from Him. So have iman in Allah and His Messengers. Do not say, 'Three.' It is better that you stop. Allah is only One God. He is too Glorious to have a son! Everything in the heavens and in the earth belongs to Him. Allah suffices as a Guardian.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people of the Book, do not be fanatical in your faith, and say nothing but the truth about God. The Messiah who is Jesus, son of Mary, was only an apostle of God, and a command of His which He sent to Mary, as a mercy from Him. So believe in God and His apostles, and do not call Him 'Trinity'. Abstain from this for your own good; for God is only one God, and far from His glory is it to beget a son. All that is in the heavens and the earth belongs to Him; and sufficient is God for all help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People of the Book! Do not exceed the limits in your religion, and attribute to Allah nothing except the truth. The Messiah, Jesus, son of Mary, was only a Messenger of Allah, and His command that He conveyed unto Mary, and a spirit from Him (which led to Mary's conception). So believe in Allah and in His Messengers, and do not say: (Allah is a) trinity. Give up this assertion; it would be better for you. Allah is indeed just one God. Far be it from His glory that He should have a son. To Him belongs all that is in the heavens and in the earth. Allah is sufficient for a guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People of the Book, do not exceed the limits of devotion in your religion or say anything about God which is not the Truth. Jesus, son of Mary, is only a Messenger of God, His Word, and a spirit from Him whom He conveyed to Mary. So have faith in God and His Messengers. Do not say that there are three gods. It is better for you to stop believing in the Trinity. There is only One God. He is too glorious to give birth to a son. To God belongs all that is in the heavens and the earth. God alone is a Sufficient Guardian for all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People given the Book(s)! Do not exaggerate in your religion nor say anything concerning Allah, but the truth; the Messiah, Eisa the son of Maryam, is purely a Noble Messenger of Allah, and His Word; which He sent towards Maryam, and a Spirit from Him; so believe in Allah and His Noble Messengers; and do not say “Three”; desist, for your own good; undoubtedly Allah is the only One God; Purity is to Him from begetting a child; to Him only belongs all whatever is in the heavens and all whatever is in the earth; and Allah is a Sufficient Trustee (of affairs).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People of the Scripture! Do not exceed the limits in your religion, nor say of Allah except the truth. Al-Masih `Isa, son of Maryam, was (no more than) a Messenger of Allah and His Word, which He bestowed on Maryam and a spirit from [created by] Him; so believe in Allah and His Messengers. Say not: \"Three!\" Cease! (it is) better for you. For Allah is (the only) One God, hallowed be He above having a son. To Him belongs all that is in the heavens and all that is in the earth. And Allah is All-Sufficient as a Disposer of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O followers of the Book! do not exceed the limits in your religion, and do not speak (lies) against Allah, but (speak) the truth; the Messiah, Isa son of Marium is only an apostle of Allah and His Word which He communicated to Marium and a spirit from Him; believe therefore in Allah and His apostles, and say not, Three. Desist, it is better for you; Allah is only one Allah; far be It from His glory that He should have a son, whatever is in the heavens and whatever is in the earth is His, and Allah is sufficient for a Protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People of the Book, go not beyond the bounds in your religion, and say not as to God but the truth. The Messiah, Jesus son of Mary, was only the Messenger of God, and His Word that He committed to Mary, and a Spirit from Him. So believe in God and His Messengers, and say not, 'Three.' Refrain; better is it for you. God is only One God. Glory be to Him -- That He should have a son! To Him belongs all that is in the heavens and in the earth; God suffices for a guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People of the Scripture! Do not exaggerate in your religion nor utter aught concerning Allah save the truth. The Messiah, Jesus son of Mary, was only a messenger of Allah, and His word which He conveyed unto Mary, and a spirit from Him. So believe in Allah and His messengers, and say not \"Three\" - Cease! (it is) better for you! - Allah is only One Allah. Far is it removed from His Transcendent Majesty that He should have a son. His is all that is in the heavens and all that is in the earth. And Allah is sufficient as Defender.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People of the Book! Do not go to extremes in your religion. Say nothing but the truth about God. The Christ Jesus, son of Mary, was only a messenger of God and His word, conveyed to Mary, a spirit from Him. So believe in God and His messengers and do not say: \"There are three [gods].\" Desist, it will be better for you. Indeed, God is the one and only God. His Holiness is far above having a son. To Him belongs whatever is in the heavens and whatever is on the earth. And God is sufficient as a guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye people of the Book; exceed not the bounds in Your religion, and say not of Allah save that which is the truth. The Messiah 'Isa, son of Maryam, is but an apostle of Allah and His word --He cast it upon Maryam-- and a spirit from Him. Believe wherefore in Allah and His apostles, and say not: three. Desist, that it may be well for you. Allah is but the One God: hallowed be He that there should be unto Him a son! His is whatsoever is in the heavens and the earth, and sufficeth Allah as a Trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People of the Book! Do not exceed the bounds in your religion, and do not attribute anything to Allah except the truth. The Messiah, Jesus son of Mary, was only an apostle of Allah, and His Word that He cast toward Mary and a spirit from Him. So have faith in Allah and His apostles, and do not say, ‘[God is] a trinity.’ Relinquish [such a creed]! That is better for you. Allah is but the One God. He is far too immaculate to have any son. To Him belongs whatever is in the heavens and whatever is on the earth, and Allah suffices as trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People of the Book! Commit no excesses in your religion: Nor say of Allah aught but the truth. Christ Jesus the son of Mary was (no more than) a messenger of Allah, and His Word, which He bestowed on Mary, and a spirit proceeding from Him: so believe in Allah and His messengers. Say not \"Trinity\": desist: it will be better for you: for Allah is one Allah: Glory be to Him: (far exalted is He) above having a son. To Him belong all things in the heavens and on earth. And enough is Allah as a Disposer of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people of the Scripture (Jews and Christians)! Do not exceed the limits in your religion, nor say of Allah aught but the truth. The Messiah 'Iesa (Jesus), son of Maryam (Mary), was (no more than) a Messenger of Allah and His Word, (\"Be!\" - and he was) which He bestowed on Maryam (Mary) and a spirit (Ruh) created by Him; so believe in Allah and His Messengers. Say not: \"Three (trinity)!\" Cease! (it is) better for you. For Allah is (the only) One Ilah (God), Glory be to Him (Far Exalted is He) above having a son. To Him belongs all that is in the heavens and all that is in the earth. And Allah is All-Sufficient as a Disposer of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People of the Book, do not exaggerate your religion. Do not say about Allah except the truth. Indeed, the Messiah, Jesus son of Mary, is only a Messenger (and Prophet) of Allah, and His Word (Be) which He gave to Mary, and a (created) spirit by Him. So believe in Allah and His Messengers and do not say: 'Trinity. 'Refrain, it is better for you. Allah is only One God. Exaltations to Him that He should have son! To Him belongs all that is in the heavens and in the earth, it is sufficient that Allah is the Guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People of the Scripture! Do not exaggerate in your religion, and do not say about God except the truth. The Messiah, Jesus, the son of Mary, is the Messenger of God, and His Word that He conveyed to Mary, and a Spirit from Him. So believe in God and His messengers, and do not say, “Three.” Refrain—it is better for you. God is only one God. Glory be to Him—that He should have a son. To Him belongs everything in the heavens and the earth, and God is a sufficient Protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People of the Scripture, do not commit excess in your religion or say about Allah except the truth. The Messiah, Jesus, the son of Mary, was but a messenger of Allah and His word which He directed to Mary and a soul [created at a command] from Him. So believe in Allah and His messengers. And do not say, \"Three\"; desist - it is better for you. Indeed, Allah is but one God. Exalted is He above having a son. To Him belongs whatever is in the heavens and whatever is on the earth. And sufficient is Allah as Disposer of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:171] O People of the Scripture, the Gospel, do not go to extremes, do not go beyond the bounds, in your religion and do not say about God except, the saying of, the truth, such as exalting Him above any associations with a partner or a child: the Messiah, Jesus the son of Mary, was only the Messenger of God, and His Word which He cast to, [which] He conveyed to, Mary, and a spirit, that is, one whose spirit is, from Him: he [Jesus] is here attached to God, exalted be He, as an honouring for him, and not as you claim, that he is the   son of God, or a god alongside Him, or one of three, because one that possesses a spirit is compound, while God transcends being compound and the attribution of compounds to Him. So believe in God and His messengers, and do not say, that the gods are, ‘Three’, God, Jesus and his mother. Refrain, from this and say what, it is better for you, [to say], which is the profession of His Oneness. Verily, God is but One God. Glory be to Him, transcending [the possibility], that He should have a son! To Him belongs all that is in the heavens and in the earth, as possessions, creatures and servants, and such sovereignty is not compatible with [that] prophethood [of Jesus]. God suffices as a Guardian, a Witness to this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then revealed about the Nestorian Christians of Najran who claimed that Jesus was the son of Allah and that Jesus and the Lord are partners, saying: (0 People of the Scripture! Do not exaggerate) do not be extreme (in your religion) for this is not the right course (nor utter aught concerning Allah save the Truth. The Messiah, Jesus son of Mary, was only a messenger of Allah, and His word which He conveyed unto Mary) and through His word he became a created being, (and a spirit from Him) and through His command, Jesus became a son without a father. (So believe in Allah and His messengers) all the messengers including Jesus, (and say not \"Three\") a son, father and wife. (Cease!) from making such a claim and repent ((it is) better for you!) than such a claim. (Allah is only One God) without a son or partner. (Far is it removed from His Transcendent Majesty that he should have a son. His is all that is in the heavens and all that is in the earth) are His servants. (And Allah is sufficient as Defender) as Lord of all created beings and He is witness of what He says about Jesus.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ تَغْلُواْ فِي دِينِكُمْ } معناهُ لاَ تُجَاوزُوا القَدَرَ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Do not exceed in your religion} means do not exceed the bounds.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا أهل الكتاب لا تَغلوا في دِينكم } أما اليهود فبالتعمق في الظاهر ونفي البواطن وحط عيسى عن درجة النبوّة ومقام الاتصاف بصفات الربوبية\n وأما النصارى فبالتعمق في البواطن ونفي الظواهر ورفع عيسى إلى مقام الألوهية { ولا تقولوا على الله إلا الحقّ } بالجمع بين الظواهر والبواطن والجمع والتفصيل كما هو عليه التوحيد المحمديّ\n والقول: بكون عيسى مظهر الصفات الإلهية\n حيا بحياته داعياً إلى مقام توحيد الأوصاف و { كلمته } نفساً مجرّدة هي كلمة من كلمات الله\n أي: حقيقة من حقائقه الروحانية وروحاً من أرواح { فآمنوا بالله ورُسله } بالجمع والتفصيل { ولا تقُولوا ثلاثة } بزيادة الحياة والعلم على الذات\n فيكون الإله ثلاثة اشياء ويكون عيسى جزء من حياته بالنفخ أو بالتفرقة بين ذات الحق وعالم النور وعالم الظلمة\n فيكون عيسى متولداً من نوره\n بل قولوا بالكل من حيث هو كلّ فيكون العلم والحياة عين الذات وكذا عالم النور والظلمة\n ويكون عيسى فانياً فيه موجوداً بوجوده\n حيّاً بحياته\n عالماً بعلمه\n وذلك وحدته الذاتية المعبر عنها بقوله { إنما الله إلهٌ واحدٌ سُبْحانه } نزّهه عن أن يكون موجود غيره\n فيتولّد منه وينفصل ويجانسه بأنه موجود مثله\n بل هو الموجود من حيث هو وجود\n { له ما في السموات } الأرواح { والأرض } الأجساد بكونها أسماءه وظاهره وباطنه { وكِيلاً } يقوم مقام الخلق في أفعالهم وصفاتهم وذواتهم عند فنائهم في التوحيد\n كما قال أمير المؤمنين عليّ عليه السلام: \" لا إله إلاّ الله بعد فناء الخلق \"",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَهْلَ ٱلْكِتَابِ } أي: الإنجيل المبالغين في أمر عيسى عليه السلام إلى حيث ينتهي إلى الغلو المذموم عقلاً وشرعاً { لاَ تَغْلُواْ فِي دِينِكُمْ } ونبيكم\n ولا تبالغوا في الإغراء في وصفه { وَ } عليكم أن { لاَ تَقُولُواْ عَلَى ٱللَّهِ } الواحد\n الأحد\n الصمد الذي لم يتخذ صاحبةً ولا ولداً { إِلاَّ ٱلْحَقَّ } الحقيق اللائق بجناية { إِنَّمَا ٱلْمَسِيحُ عِيسَى ٱبْنُ مَرْيَمَ رَسُولُ ٱللَّهِ } كسائر رسله { وَ } غاية أمره { كَلِمَتُهُ } أي: يحصل\n ويتكون من كلمته التي { أَلْقَاهَا إِلَىٰ مَرْيَمَ }  { وَ } هو { رُوحٌ } يتجلَّى { مِّنْهُ } سبحانه\n ويظهر فيه عليه السلام كظهوره في سائر الأشخاص إلا أن لا هوتيته غلبت على ناسوتيته\n لذلك ظهر منه من الخوارق ما خلت عنها الأنبياء { فَآمِنُواْ بِٱللَّهِ } المنزه في ذاته عن الأهل والولد { وَرُسُلِهِ } المؤيدين من عنده\n لتبليغ حكمه وأحكامه\n\n\nومن جملتهم عيسى عليه السلام { وَلاَ تَقُولُواْ } على الله المنزه عن التعدد مطلقاً ما لا يليق بجنابه بأنه { ثَلاَثَةٌ } الله والمسيح ومريم { ٱنتَهُواْ } عن التثليث\n بل عن التعدد مطلقاً\n فإن انتهاءكم عنه يكون { خَيْراً لَّكُمْ } يرشدكم إلى سبيل التوحيد { إِنَّمَا ٱللَّهُ } المتجلي في الآفاق والاستحقاق { إِلَـٰهٌ وَاحِدٌ } أي: موجود واحد\n لا يمكن التعدد فيه أصلاً { سُبْحَانَهُ } بذاته\n وتعالى عن { أَن يَكُونَ لَهُ وَلَدٌ } كما يقول الظالمون { لَّهُ } باعتبار تجلياته على صفحات الإعدام بجميع أوصافه وأسمائه مظاهر { مَا فِي ٱلسَّمَٰوَٰتِ } من جنود الله ومرايا أوصاف جماله وجلاله { وَمَا فِي ٱلأَرْضِ } أيضاً منها\n وكذا فيما شاء الله\n وما يعلم جنود ربك إلا هو { وَكَفَىٰ بِٱللَّهِ وَكِيلاً } [النساء: 171] أي: كفى الله المتجلي بجميع أوصافه وأسمائه وكيلاً على مظاهره\n مولياً لأمورهم أصالة واستقلالاً\n\n\nومن غاية إغراء النصارى في وصف المسيح\n ونهاية غلوهم في حقه استنكفوا واستكبروا عن كونه عبد الله\n ونسبوه إليه بالنبوة\n وعبدوا له كعبادة الله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: أصل الغلو: مجاوزة الحد في كل شيء، يقال: غلا بالجارية لحمها وعظمها، إذا أسرعت إلى الشباب فجاوزت لداتها أي: أقرانها، تغلو غلوًا. يقول الحقّ جلّ جلاله: في عتاب النصارى ـ بدليل ما بعده: { يا أهل الكتاب } الإنجيل { لا تغلوا في دينكم } فتجاوزوا الحد فيه باعتقادكم في عيسى أنه الله، أو ابن الله، قصدوا تعظيمه فغلوا وأفرطوا، { ولا تقولوا على الله إلا الحق } ، وهو تنزيه عن الصاحبه والولد. ثم بيَّن الحق فيه فقال: { إنما المسيح عيسى ابن مريم رسول الله } ، لا كما قالت اليهود: ليس برسول، ولا كما قالت النصارى: إنه الله، أو ابن الله، وإنما هو عبد الله ورسوله، { وكلمته ألقاها إلى مريم } أي: أوصلها إليها وحصلها فيها، وهي كلمة: كن. فَتَكَوّنَ بها في رحم أمه فسمى بها، { وروح منه } وهو نفخ جبريل في جيبها فحملت بذلك النفخ، وسمي النفخ روحًا لأنه ريح يخرج عن الروح، فكانت روحه صادرة من روح القدس، كما قال في آدم:\n[الحِجر:29]، وقد قال:\n[آل عِمرَان:59]، فنفخ جبريل في الحقيقة لما كان بأمر الله صار هو نفخ الحق لأن الواسطة محذوفة عند المحققين، فلذلك أضاف روحه إليه كروح آدم عليه السلام. { فأمنوا بالله ورسوله } أي: وحدوا الله في إلوهيته، { ولا تقولوا ثلاثة } أي: الآلهة ثلاثة: الله، والمسيح، ومريم، { انتهوا } عن التثليث يكن { خيرًا لكم إنما الله إله واحد } في ذاته وصفاته وأفعاله، { سبحانه } أي: تنزيهًا له أن يكون له ولد، لأنه لا يجانس ولا يتطرقه الفناء، { له ما في السماوات وما في الأرض } ، ملكًا وخلقًا وعبيدًا، والعبودية تنافي البُنوة، { وكفى بالله وكيلاً } فلا يحتاج إلى ولد لأن الولد يكون وكيلاً عن أبيه وخليفته، والله تعالى قائم بحفظ الأشياء كافٍ لها، مستغن عمن يعينه أو يخلفه لوجوب بقائه وغناه. واعلم أن النصارى انقسموا على أربع فرق: نسطورية، ويعقوبية، وملكانية، ومرقوسية، ومنهم نصارى نجران، فالنسطورية، قالوا في عيسى هو ابن الله، واليعقوبية والملكانية، قالوا هو الله، والمرقوسية قالوا: هو ثالث ثلاثة، وكلهم ضالون. الإشارة: الغلو كله مذموم، وخير الأمور أوساطها، وقد قال ـ عليه الصلاة والسلام ـ:\n \" لا تُطرُونِي كما أطرَت النَّصَارَى عيسى ابنَ مَريم، ولكن قولوا: عَبدُ اللهِ وَرَسُوله \" \n، ويرخص للفقير أن يتغالى في مدح شيخه، ما لم يخرجه عن طوره، أو ينتقص غيره بمدحه، وفي الإشارة حيث على حفظ مقام التوحيد، وتنزيهه تعالى عن الأضداد والأنداد. وفي ذلك يقول الشاعر:\nفإثبات العبودية مستقلة تضاد الربوبية، ولذلك أنكرها الشاعر، أي: أثبت ربًا وعبدًا، وأنت تقول بنفي الضد عنه وفي الحِكَم: \" الأكوان ثابتة بإثباته ممحوة بأحدية ذاته \". ولما قالت نصارى نجران للنبي صلى الله عليه وسلم: إنك تعيب صاحبنا؟ فقال ـ عليه الصلاة والسلام ـ\n \" ومن صاحبكم؟ \" \nقالوا: عيسى. قال\n \" وأي شيء أقول؟ \" \nقالوا: تقول إنه عبد الله. قال لهم ـ عليه الصلاة والسلام ـ:\n \" ليس بعارٍ أن يكون عيسى عبدًا \" ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:77",
      "similarity": 0.7039929817949852
    },
    {
      "verse": "3:45",
      "similarity": 0.3259771951341446
    },
    {
      "verse": "5:17",
      "similarity": 0.24239570747974726
    },
    {
      "verse": "4:157",
      "similarity": 0.23419783164924643
    },
    {
      "verse": "9:31",
      "similarity": 0.23002341365685633
    }
  ]
}