{
  "chapter": "النساء",
  "text": "لن يستنكف المسيح ان يكون عبدا لله ولا الملئكة المقربون ومن يستنكف عن عبادته ويستكبر فسيحشرهم اليه جميعا",
  "translations": [
    {
      "translation": "The Christ will never disdain to be a votary of God, nor will the angels close to Him. And those who disdain to serve Him and are proud (should remember) that they will all go back to Him in the end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah neither did disdain to be a servant of Allah nor do the angels who are stationed near to Him; and whoever disdains to serve Him, and waxes arrogant, Allah will certainly muster them all to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jesus never disdained the worship of God nor did the nearest angels to God. Whoever, out of pride, disdains the worship of God should know that everyone will be brought before Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah does not at all hate being a bondman of Allah, and nor do the close angels; and whoever hates worshipping Him and is conceited – so very soon He will gather them all towards Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Al-Masih will never be too proud to be a servant of Allah, nor the angels who are the near (to Allah). And whosoever rejects His worship and is proud, then He will gather them all together unto Himself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah does by no means disdain that he should be a servant of Allah, nor do the angels who are near to Him, and whoever disdains His service and is proud, He will gather them all together to Himself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah will not disdain to be a servant of God, neither the angels who are near stationed to Him. Whosoever disdains to serve Him, and waxes proud, He will assuredly muster them to Him, all of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah will never scorn to be a slave unto Allah, nor will the favoured angels. Whoso scorneth His service and is proud, all such will He assemble unto Him;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, the Messiah would never disdain to be accounted a servant of God. Nor would the angels who are nearest to Him. If any do disdain to worship Him, and grow arrogant, He will in any case gather them all before Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah disdaineth not that he should be a bondman of Allah, nor do the angels brought near. And whosoever disdaineth serving Him and stiff-necked, anon He shall gather them all unto Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah would never disdain being a servant of Allah, nor would the angels brought near [to Him]. And whoever disdains His worship and is arrogant, He will gather them all toward Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Christ disdaineth nor to serve and worship Allah, nor do the angels, those nearest (to Allah): those who disdain His worship and are arrogant,-He will gather them all together unto Himself to (answer).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah will never be proud to reject to be a slave to Allah, nor the angels who are near (to Allah). And whosoever rejects His worship and is proud, then He will gather them all together unto Himself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah would not despise being a worshiper of Allah, nor would the angels who are near. Whosoever despises worshipping Him, and becomes proud, He will surely assemble them all to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah does not disdain to be a servant of God, nor do the favored angels. Whoever disdains His worship, and is too arrogant—He will round them up to Himself altogether.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never would the Messiah disdain to be a servant of Allah, nor would the angels near [to Him]. And whoever disdains His worship and is arrogant - He will gather them to Himself all together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:172] The Messiah, whom you claim is a god, would never disdain, [would never] scorn or reject haughtily, to be a servant of God, neither would the angels who are nigh, to God, disdain to be servants: this is a splendid digression [to the matter of the angels], and it is mentioned as a refutation of those who claim that they [the angels] are gods or the daughters of God, just as He refuted, with what was stated before, the Christians who claim that which is the subject of the address to them [above]. Whoever disdains to worship Him, and waxes proud, He will assuredly muster them to Him, all of them, in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The Messiah will never scorn to be a slave unto Allah) he will never not acknowledge his servitude to Allah. 109 This was revealed in respect of the Christians saying to the Prophet: \"0 Muhammad, what you say of Jesus is shameful\". Allah said to them: it is not shameful that Jesus be the servant of Allah, (nor will the favoured angels) nor would the favoured angels, the carriers of the Throne, ever not acknowledge that they are servants of Allah. (Whoso scorneth His service) whoever scorns to acknowledge that being his servant (and is proud) is too proud to believe in Allah, (all such) believers and unbelievers (will He assemble unto Him) on the Day of Judgement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَّن يَسْتَنكِفَ ٱلْمَسِيحُ } معناهُ لَنْ يَأْنَفَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { لن يسْتَنكف المسيح أن يكون عبداً لله } في مقام التفصيل، إذ باعتبار الجمع لا وجود للمسيح ولا لغيره فلا ممكن أصلاً\n وأما باعتبار التفصيل فكلّ ما ظهر بتعين فهو ممكن، والممكن لا وجود له بنفسه فضلاً عن شيء غيره فيكون عبداً محتاجاً ذليلاً مفتقراً غير مستنكف عن ذلّة العبودية وإن كان غنيّاً عن تعلق الأجسام بالتجرّد المحض والتقدّس عن دنس الطبائع كالملائكة المقرّبين الذين هم الأرواح المجرّدة والأنوار المحضة { ومن يَسْتَنْكف عن عبادته } بظهور أنيته { ويستكبر } بطغيانه في الظهور بصفاته { فسيحشرهم إليه جميعاً } بظهور نور وجهه وتجليه بصفة قاهريته حتى يفنوا بالكلية في عين الجمع، كما قال تعالى:\n\n[غافر، الآية: 16]، وقال النبي صلى الله عليه وسلم:\n\n \" إنّ لله تعالى سبعين ألف حجاب من نور وظلمة، لو كشفها لأحرقت سبحات وجهه ما انتهى إليه بصره من خلقه \"\n \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن غاية إغراء النصارى في وصف المسيح، ونهاية غلوهم في حقه استنكفوا واستكبروا عن كونه عبد الله، ونسبوه إليه بالنبوة، وعبدوا له كعبادة الله، لذلك رد عليهم بقولهم: { لَّن يَسْتَنكِفَ } ويستكبر { ٱلْمَسِيحُ } وإن ترقَّى إلى السماء بقوة لاهوتية { أَن يَكُونَ عَبْداً للَّهِ وَلاَ ٱلْمَلاۤئِكَةُ ٱلْمُقَرَّبُونَ } عند الله، المترقون من السماء أيضاً؛ إذ لا ناسوتية لهم أصلاً، { وَ } كيف يستنكر، ويستنكف عن عبادته أحد من مظاهره ومخلوقاته؛ إذ { مَن يَسْتَنْكِفْ عَنْ عِبَادَتِهِ وَيَسْتَكْبِرْ فَسَيَحْشُرُهُمْ } الله { إِلَيهِ جَمِيعاً } [النساء: 172] ويحاسبهم بما صنعوا، ويجازيهم على مقتضى حسابهم بأشد العذاب، وأسوء النكال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: أصل الاستنكاف: التنحية، من قولهم: نكفت الدمع إذا نحيته بإصبعك كي لا يُرى أثره عليك، ثم أُطلق على الأنفة، والاستكبار دون الاستنكاف، ولذا عطف عليه لأن الاستنكاف، لا يستعمل إلا حيث لا استحقاق، بخلاف الاستكبار فإنه يكون باستحقاق\n قاله البيضاوي\n يقول الحقّ جلّ جلاله: في الرد على النصارى: { لن يستنكف } أي: لن يأنف { المسيح أن يكون عبدًا لله } فإن عبوديته لله شرف يتباهى بها، وإنما المذلة والاستنكاف في عبوديته لغيره، { ولا الملائكة المقربون } لا يستنكفون أيضًا أن يكونوا عبيدًا لله، بل ما كانوا مكرمين إلا بعبوديتهم لله، واحتج بالآية مَن فَضَّل الملائكة على الأنبياء، لأن المعطوف يقتضي أن يكون أرفع درجة من المعطوف عليه، حتى يكون عدم استنكاف الملائكة كالدليل على عدم استنكاف المسيح\n والجواب: أن عطف الملائكة إنما أريد به التكثير والمبالغة، كقولهم: أصبح الأمير اليوم لا يخالفه رئيس ولا مرؤوس، والرئيس أفضل من المرؤوس، والتحقيق في المسألة أن الأنبياء والرسل أفضل من خواص الملائكة كالمقربين، وخواص الملائكة ـ وهم المقربون ـ أفضل من خواص البشر كالأولياء، وخواص البشر أفضل من عوام الملائكة، وعوام الملائكة أفضل من عوام البشر، ولذلك قيل: من غلب عقله على هواه كان كالملائكة أو أفضل، ومن غلب هواه على عقله، كان كالبهائم أو أضل\n والله تعالى أعلم",
      "translations": []
    }
  ]
}