{
  "chapter": "النساء",
  "text": "يايها الذين ءامنوا۟ لا يحل لكم ان ترثوا۟ النساء كرها ولا تعضلوهن لتذهبوا۟ ببعض ما ءاتيتموهن الا ان ياتين بفحشة مبينة وعاشروهن بالمعروف فان كرهتموهن فعسى ان تكرهوا۟ شيـا ويجعل الله فيه خيرا كثيرا",
  "translations": [
    {
      "translation": "You who have iman! it is not halal for you to inherit women by force. Nor may you treat them harshly so that you can make off with part of what you have given them, unless they commit an act of flagrant indecency. Live together with them correctly and courteously. If you dislike them, it may well be that you dislike something in which Allah has placed a lot of good.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, you are not allowed to take perforce the women (of dead relatives) into your heritage, or tyrannise over them in order to deprive them of what you have given them, unless they are guilty of open adultery. Live with them with tolerance and justice even if you do not care for them. For it may well be you may not like a thing, yet God may have endued it with much goodness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! It is not lawful for you to become heirs to women against their will. It is not lawful that you should put constraint upon them that you may take away anything of what you have given them; (you may not put constraint upon them) unless they are guilty of brazenly immoral conduct. Live with your wives in a good manner. If you dislike them in any manner, it may be that you dislike something in which Allah has placed much good for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, it is not lawful for you to inherit women against their will as part of the legacy. Do not create difficulties for your wives in order to force them to give-up part of what you had given to them to set themselves free from the bond of marriage, unless they have clearly committed adultery. Always treat them reasonably. If you dislike them, you could be disliking that which God has filled with abundant good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! It is not lawful for you to forcibly become the women’s heirs; and do not restrain women with the intention of taking away a part of bridal money you gave them, unless they openly commit the shameful; and deal kindly with them; and if you do not like them, so it is possible that you dislike a thing in which Allah has placed abundant good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! You are not permitted to inherit women against their will, nor to prevent them from marriage in order to get part of (the dowry) what you have given them, unless they commit open Fahishah. And live with them honorably. If you dislike them, it may be that you dislike a thing and Allah brings through it a great deal of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! it is not lawful for you that you should take women as heritage against (their) will, and do not straiten them in order that you may take part of what you have given them, unless they are guilty of manifest indecency, and treat them kindly; then if you hate them, it may be that you dislike a thing while Allah has placed abundant good in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, it is not lawful for you to inherit women against their will; neither debar them, that you may go off with part of what you have given them, except when they commit a flagrant indecency Consort with them honourably; or if you are averse to them, it is possible you may be averse to a thing, and God set in it much good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! It is not lawful for you forcibly to inherit the women (of your deceased kinsmen), nor (that) ye should put constraint upon them that ye may take away a part of that which ye have given them, unless they be guilty of flagrant lewdness. But consort with them in kindness, for if ye hate them it may happen that ye hate a thing wherein Allah hath placed much good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, it is not lawful for you to inherit women against their will, nor should you detain them wrongfully, so that you may take away a part of what you have given them, unless they are guilty of something clearly outrageous. Live with them in accordance with what is fair and kind; if you dislike them, it may be that you dislike something which God might make a source of abundant good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! it is not allowed unto you that ye may heir the women forcibly; nor shut them up that ye may take away from them part of that which ye had given them, except when they be guilty of manifest enormity. And live with them reputably if ye detest them, belike ye detest a thing and yet Allah hath placed therein abundant good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! It is not lawful for you to inherit women forcibly, and do not press them to take away part of what you have given them, unless they commit a gross indecency. Consort with them in an honourable manner; and should you dislike them, maybe you dislike something while Allah invests it with an abundant good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Ye are forbidden to inherit women against their will. Nor should ye treat them with harshness, that ye may Take away part of the dower ye have given them,-except where they have been guilty of open lewdness; on the contrary live with them on a footing of kindness and equity. If ye take a dislike to them it may be that ye dislike a thing, and Allah brings about through it a great deal of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! You are forbidden to inherit women against their will, and you should not treat them with harshness, that you may take away part of the Mahr you have given them, unless they commit open illegal sexual intercourse. And live with them honourably. If you dislike them, it may be that you dislike a thing and Allah brings through it a great deal of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, it is unlawful for you to inherit women forcefully, neither bar them, in order that you go off with part of what you have given them, except when they commit a clear indecency. Live with them honorably. If you hate them, it may be that you hate something which Allah has set in it much good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! It is not permitted for you to inherit women against their will. And do not coerce them in order to take away some of what you had given them, unless they commit a proven adultery. And live with them in kindness. If you dislike them, it may be that you dislike something in which God has placed much good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, it is not lawful for you to inherit women by compulsion. And do not make difficulties for them in order to take [back] part of what you gave them unless they commit a clear immorality. And live with them in kindness. For if you dislike them - perhaps you dislike a thing and Allah makes therein much good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:19] O you who believe, it is not lawful for you to inherit women against their will (read either karhan or kurhan, as alternative forms) that is to say, coercing them into this. In pre-Islamic times, they used to inherit women from their kin, and if they so wished they could marry [a woman] without a dowry, or marry her off and take the dowry for themselves, or prevent her [from marriage] until she gave up what she had inherited, or until she died and they could inherit from her. They were thus forbidden such practices; neither debar them, your [former] wives from marrying others by retaining them while you have no desire for them yourselves, only to harm them; so that you may go off with part of what you have given them, of the dowry, except when they commit flagrant (read mubayyina, ‘making it clear’, or mubayyana, ‘clear’) lewdness, such as adultery or rebellion, then you have the right to coerce them until they redeem themselves to you or forfeit [their dowries]. Consort with them in kindness, that is, being decent in speaking [to them], with regard to [their] expenditure and lodging; for if you hate them, then be patient; it may happen that you hate a thing wherein God has set much good, that is to say, perhaps He does this when He provides you with a righteous child   through them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe! It is not lawful for you forcibly) coercively (to inherit the women (of your deceased kinsmen)) the women of your fathers, (nor (that) ye should put constraint upon them) by preventing them from marrying again. This verse was revealed about Kabshah Bint Ma'an al-Ansariyyah and Muhsin Ibn Abi Qays al-Ansari; for before the advent of Islam, they used to inherit the women of their fathers (that ye may take away a part of that which ye have given them) take away part of that which your fathers gave them, (unless they be guilty of flagrant lewdness) unless they are guilty of fornication by the testimony of witnesses in which case they should be imprisoned. However, imprisoning fornicators was abrogated by the verse on stoning. In the pre-Islamic period, men used to inherit the wives of their fathers in the same way as they inherited their properties. The wife of a deceased father used to be inherited by the eldest son. If the woman was rich and beautiful, the eldest son would marry her without giving her any dowry. If, however, she was neither rich, young nor beautiful, he would not marry her but instead leave her untouched until she ransomed herself with her own money. Allah forbade them from indulging in such a practice. Then He showed them how one must treat women, saying: (But consort with them) keep their company (in kindness) with beneficence and goodness, (for if ye hate them) i.e. hate their company (it may happen that ye hate a thing) their company (wherein Allah hath placed much good) Allah may provide you with righteous children from them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n نبَّه سبحانه على المؤمنين ألاَّ تصدر عنهم أمثال هذا فقال: { يَٰأَيُّهَا ٱلَّذِينَ ءَامَنُواْ } بالله ورسوله اتركوا جميع ما كان عليكم في جاهليتكم قبل الإيمان\n سيما إيراث النساء\n واعلموا أنه { لاَ يَحِلُّ لَكُمْ } في دينكم وشرعكم { أَن تَرِثُواْ ٱلنِّسَآءَ } أي: نساء أقاربكم ومورثكم\n وتزوجوهن أو تفدوا منهن { كَرْهاً } حال كونكم مكرهين\n أو هن كارهات لتزويجكم\n\n\n{ وَ } أيضاً من الحدود المتعلقة بأمور النساء أن { لاَ تَعْضُلُوهُنَّ } مطلقاً\n أي: لا يحل أن تضيقوا على نسائكم حين انتقضت محبتكم إياهن\n وقلَّ وقعن عندكم إلى أن تلجئوهن بالفدية والخلع { لِتَذْهَبُواْ } حين الطلاق { بِبَعْضِ مَآ ءَاتَيْتُمُوهُنَّ } أو كلها حين النكاح { إِلاَّ أَن يَأْتِينَ } - العياذ بالله تعالى - { بِفَٰحِشَةٍ } فعلةٍ قبيحةٍ\n محرمةٍ عقلاً وشرعاً { مُّبَيِّنَةٍ } ثابتةٍ ظاهرةٍ { وَ } إن لم يأتين بشيءٍ من الفواحش { عَاشِرُوهُنَّ بِٱلْمَعْرُوفِ } المستحسن عقلاً وشرعاً { فَإِن كَرِهْتُمُوهُنَّ } طبعاً عليكم أن تكذبوا طباعكم المخالفة للعقل والشرع\n إذ هي من طغيان القوة البهيمية\n لا تبالوا بها وبمقتضاها { فَعَسَىٰ أَن تَكْرَهُواْ شَيْئاً } بمقتضى طبعكم { وَ } لا تعلمون أن { يَجْعَلَ ٱللَّهُ فِيهِ } بمقتضى حكمته ومصلحته { خَيْراً كَثِيراً } [النساء: 19] نافعاً لكم ولغيركم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ يَا أَيُّهَا ألَّذِينَ آمَنُواْ لاَ يَحِلُّ لَكُمْ أَن تَرِثُواْ النِّسَآءَ كَرْهاً وَلاَ تَعْضُلُوهُنَّ ُلِتَذْهَبُواْ بِبَعْضِ مَآ آتَيْتُمُوهُنَّ إِلاَّ أَن يَأْتِينَ بِفَاحِشَةٍ مُّبَيِّنَةٍ\n\n\n }  قلت: أصل العضل: التضييق، يقال: عضلَت الدجاجة ببيضها إذا ضاقت، ثم أُطلق عُرفًا على منع المرأة من التزوج\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا } لا يحل لكم أن تمنعوا النساء من النكاح لترثوا ما لهن { كرهًا }\n قال ابن عباس: كانوا في الجاهلية إذا مات الرجل، وله امرأة كان قريبه من عصبته أحق بها من نفسها ومن غيره، فإن شاء تزوجها من غير صداق، إلا الصداق الأول الذي أصدقها الميت، وإن شاء زوّجها غيره وأخذ صداقها ولم يُعطها شيئًا، وإن شاء عَضَلهَا وضيَّق عليها لتفتدى منه بما ورثت من الميت، أو تموت فيرثُها، وإن ذهبت إلى أهلها قبل أن يُلقِيَ وليُّ زوجها ثوبَه عليها فهي أحق بنفسها\n فكانوا على ذلك في أول الإسلام، حتى توفي أبو قَيس بن الأَسْلتَ الأنصاري، وترك امرأته \" كبشة بنت معن الأنصارية \" ، فقام ابنٌ له من غيرها فطرح ثوبه عليها، تم تركها ولم يقربها، ولم ينفق عليها، يضارّها لتفتدى منه، فأتت إلى النبي صلى الله عليه وسلم فقالت: يا رسول الله إن أبا قيس تُوفي ووَرِثَ نكاحي ابنُه، وقد أضرَّ بي وطوّل عليّ، فلا هو ينفق عليّ ولا يدخل بي، ولا يخلي سبيلي، فقال لها النبي صلى الله عليه وسلم:\n\n \" اقعدي في بيتك حتى يأتَي فيك أمرُ الله \" \n\nقالت: فانصرفتُ وسمعت بذلك النساءُ في المدينة فأتين النبي صلى الله عليه وسلم وهو في مسجد الفضيخ، فقلن: يا رسول الله: ما نحن إلا كهيئة كبشة، غير أنه لا ينكحنا الأبناء، ونكَحَنا أبناء العَم، فنزلت الآية\n فمعنى الآية على هذا: لا يحل لكم أن تجعلوا النساء يُورثن عن الرجال كما يُورث المال\n وقيل: الخطاب للأزواج الذين يمسكون المرأة في العصمة ليرثوا مالها، من غير غبطة بها، وإنما يمسكها انتظارًا لموتها، وقيل: الخطاب للأولياء الذين يمنعون ولياتهم من التزوج ليرثوهن دون الزوج\n { ولا } يحل لكم أيضًا أيها الأزواج أن { تعضلوهن } ، أي: تحبسوهن من غير حاجة لكم فيهن { لتذهبوا ببعض ما آتيتموهن } من الصداق افتداء فيه بإضراره\n قال ابن عباس رضي الله عنه: هي أيضًا في الأزواج الذين يمسكون المرأة ويُسيئُون عشرتها حتى تفتدى بصداقها، { إلا أن يأتين بفاحشة مبينة } ، كالنشوز وسوء العشرة وعدم العفة، فيحل له حينئِذ حبسها حتى تفتدى منه بصداقها، فيأخذه خلعًا على مذهب مالك\n والله تعالى أعلم\n الإشارة: لا يحل للمريد أن يُضيق على نفسه تضييقاً يُفضي إلى العطب، فالنفس كالبهيمة: علفها واستخدامها، وقد قال عليه الصلاة والسلام:\n\n\n\n \" لا يكن أحدُكُم كالمنبت، لا أرضًا قطع ولا ظهرًا أبقى \"\n \n\nفبعض الناس يسمعون أن من ضيَّق على نفسه أورثته العلوم، فيضيق عليها تضييقًا فاحشًا ليرث ذلك منها كرهًا، وإنما يمنعها من شهواتها الزائدة على قيام البنية، إلا أن تأتي بفاحشة مبينة، بحيث تطغى عليها، فيضيق عليها بما لا يُفضي إلى الهلاك، وهذا كله إنما ينفعه إذا صح مِلْكُه لها بالعقد الصحيح من الشيخ الكامل، وإلاَّ كان تعبه باطلاً، كمن يريد أن يرى امرأة غيره أو دابة غيره\n والله تعالى أعلم\n ثم أمر الحق تعالى بحسن العشرة مع النساء، فقال: { وَعَاشِرُوهُنَّ بِالْمَعْرُوفِ فَإِن كَرِهْتُمُوهُنَّ فَعَسَى أَن تَكْرَهُواْ شَيْئاً وَيَجْعَلَ اللَّهُ فِيهِ خَيْراً كَثِيراً }  يقول الحقّ جلّ جلاله: وعاشروا النساء { بالمعروف } بأن تلاطفوهن في المقال وتجملوا معهن في الفعال، أو يَتَزَيَّنُ لها كما تتزين له\n قال الورتجبي: كونوا في معاشرتهن في مقام الأنس وروح المحبة، وفرح العشق حيث أنتم مخصوصون بالتمكين والاستقامة والولاية، فإن معاشرة النساء لا تليق إلا في المستأنس بالله، كالنبي صلى الله عليه وسلم وجميع المستأنسين من الأولياء والأبدال، حيث أخبر صلى الله عليه وسلم عن كمال مقام أُنْسِه بالله ورؤيته لجمال مشاهدته حيث قال:\n\n \" حُبِّبَ إليّ من دنياكم ثَلاث: الطيب، والنساء، وجُعلت قرة عيني في الصلاة \"\n \n\nثم قال: عن ذي النون: المستأنس بالله يستأنس بكل شيء مليح ووجه صبيح، وبكل صوت طيب وبكل رائحة طيبة، ثم قال: عن ابن المبارك: العشرة الصحيحة: ما لا يورثك الندم عاجلاً ولا آجلاً، وقال أبو حفص: المعاشرة بالمعروف: حسن الخلق مع العيال فيما ساءك\n هـ\n { فإن كرهتموهن } فاصبروا { فعسى أن تكرهوا شيئًا ويجعل الله فيه خيرًا كثيرًا } إما ولدًا صالحًا أو عاقبة حسنة في الدين\n قال ابن عمر: إن الرجل يستخير الله فيخار له فيسخط على ربه، فلا يلبث أن ينظر في العاقبة فإذا هو قد خير له\n هـ\n حكى أن أبا الإمام مالك رضي الله عنه تزوج امرأة فدخل عليها فوجدها سوداء، فبقي متفكرًا ولم يقربها، فقالت له: هل استخرت ربك؟ فقال: نعم، فقالت: أتَتَّهمُ ربك، فدخل بها، فحملت بالإمام مالك صاحب المذهب\n وقال صلى الله عليه وسلم:\n\n \" لا يَفْرك مؤمنٌ مَؤمنة ـ أي: لا يُبْغِضها ـ إن سخط منها خُلقَا رضي منها آخر \" \n\nقال الورتجبي: قيل: غيب عنك العواقب لئلا تسكن إلى مألوف، ولا تفر من مكروه\n الإشارة: إذا طهرت النفس من البقايا، وكملت فيها المزايا، وانقادت بكليتها إلى مولاها، وجب الإحسان إليها والصلح معها ومعاشرتها بالمعروف، فإنما تجب مجاهدتها ما دامت كافرة فإذا أسلمت وانقادت وجب محبتها والإحسان إليها\n فإن كرهتها في حال اعوجاجها فجاهدتها ورضتها حتى استقامت كان في عاقبة ذلك خيرٌ كثير، وعادت تأتي إليك بالعلوم اللدنية تشاهد فيها أسرارًا ربانية\n قال الورتجبي: كل أمر من الله ـ سبحانه ـ جاء على مخالفة النفس امتحانًا واختبارًا، والنفس كارهة في العبودية فإذا ألزمت عليها حقوق الله بنعت الرياضة والمجاهدة واستقامت في عبودية الله، أول ما يطلع على قلبك أنوار جنان القرب والمشاهدة، قال الله تعالى:\n\n[النازعات:40،41]، وفي أجواب ظلام المجاهدة للعارفين شموس المجاهدات وأقمار المكاشفات\n هـ\n المراد منه\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:232",
      "similarity": 0.6705077508780487
    },
    {
      "verse": "2:216",
      "similarity": 0.16132145815961446
    },
    {
      "verse": "33:30",
      "similarity": 0.152887314778723
    },
    {
      "verse": "4:15",
      "similarity": 0.13873958790225369
    },
    {
      "verse": "65:1",
      "similarity": 0.12898673993654458
    }
  ]
}