{
  "chapter": "النساء",
  "text": "وءاتوا۟ اليتمى امولهم ولا تتبدلوا۟ الخبيث بالطيب ولا تاكلوا۟ امولهم الى امولكم انه كان حوبا كبيرا",
  "translations": [
    {
      "translation": "Give orphans their property, and do not substitute bad things for good. Do not assimilate their property into your own. Doing that is a serious crime.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give to the orphans their possessions, and do not replace things of your own which are bad with things which are good among theirs, and do not intermix their goods with your own and make use of them, for this is a grievous crime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give orphans their property, and do not exchange the bad for the good, and do not eat up their property by mixing it with your own. This surely is a mighty sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give to the orphans their property. Do not exchange the pure for the filthy and do not spend the property of orphans along with your own; this would be a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give the orphans their wealth and do not exchange the pure for the foul; and do not devour (or use up) their wealth, mixing it with your own; this is indeed a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give unto orphans their property and do not exchange (your) bad things for (their) good ones; and devour not their substance (by adding it) to your substance. Surely, this is a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give to the orphans their property, and do not substitute worthless (things) for (their) good (ones), and do not devour their property (as an addition) to your own property; this is surely a great crime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give the orphans their property, and do not exchange the corrupt for the good; and devour not their property with your property; surely that is a great crime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give unto orphans their wealth. Exchange not the good for the bad (in your management thereof) nor absorb their wealth into your own wealth. Lo! that would be a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give the orphans the possessions that belong to them, do not exchange good things with bad and do not consume their property, adding it to your own. Surely, this is a great crime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give unto the orphans their substance, and substitute not the bad for the good; and devour not their substance by adding it to your substance; verily that is a great crime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give the orphans their property, and do not replace the good with the bad, and do not eat up their property [by mingling it] with your own property, for that is indeed a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To orphans restore their property (When they reach their age), nor substitute (your) worthless things for (their) good ones; and devour not their substance (by mixing it up) with your own. For this is indeed a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give unto orphans their property and do not exchange (your) bad things for (their) good ones; and devour not their substance (by adding it) to your substance. Surely, this is a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give the orphans their wealth. Do not exchange the evil for the good, nor consume their wealth with your wealth. Surely, that is a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give orphans their properties, and do not substitute the bad for the good. And do not consume their properties by combining them with yours, for that would be a serious sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give to the orphans their properties and do not substitute the defective [of your own] for the good [of theirs]. And do not consume their properties into your own. Indeed, that is ever a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:2] The following was revealed regarding an orphan who demanded his property from his guardian but was refused it: Give the orphans, the under-age ones that have no father, their property, when they have reached maturity, and do not exchange the evil, the unlawful, for the good, the lawful, that is, taking the one in place of the other, as you do when you take what is good from the orphan’s property, and leave him your faulty property instead; and absorb not their property, [by] adding it, into your property; surely that, the absorbing of it, is a great crime, a serious sin. When this was revealed they found it difficult to maintain guardianship over orphans, and some of them had ten or eight wives under their care, and did not treat them all equally, and so the following was revealed:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمناسبة عطف الأمر على ماقبله أنّه من فروع تقوى الله في حقوق الأرحام ، لأنّ المتصرّفين في أموال اليتامى في غالب الأحوال هم أهل قرابتهم ، أو من فروع تقوى الله الذي يتساءلون به وبالأرحام فيجعلون للأرحام من الحظّ ما جعلهم يقسمون بها كما يقسمون بالله . وشيء هذا شأنه حقيق بأن تُراعى أواصره ووشائجه وهم لم يرقبوا ذلك . وهذا ممَّا أشار إليه قوله تعالى : { وبث منهما رجالاً كثيراً ونساء . . . } \\[ النساء : 1 \\] .والإيتاء حقيقته الدفع والإعطاء الحسي ، ويطلق على تخصيص الشيء بالشيء وجعله حقّاً له ، مثل إطلاق الإعطاء في قوله تعالى : { إنا أعطيناك الكوثر } \\[ الكوثر : 1 \\] وفي الحديث : « رجل آتاه الله مالاً فسلطه على هَلَكَتِه في الحقّ ورجل آتاه الله الحكمة فهو يقضي بها » . واليتامى جمع يتيم وجمع يتيمة ، فإذا جمعت به يتيمة فهو فعائل أصله يَتَائِم ، فوقع فيه قلب مَكَانِيّ فقالوا يَتَامِىءُ ثم خفّفوا الهمزة فصارت ألفاً وحرّكت الميم بالفتح ، وإذا جمع به يتيم فهو إمّا جَمْع الجمع بأن جمع أوّلاً على يَتْمَى ، كما قالوا : أسير وأسْرى ، ثم جمع على يتامى مثل أسارى بفتح الهمزة ، أو جمع فعيل على فعائل لكونه صار اسماً مثل أفيل وأفائل ، ثم صنع به من القلب ما ذكرناه آنفاً . وقد نطقت العرب بجمع يتيمة على يتائم ، وبجمع فعيل على فعائل في قول بشر النجدي :أأطْلالَ حُسْن في البِراق اليَتَائِم ... سَلام على أطلالِكُنّ القَدَائِمواشتقاق اليتيم من الإنفراد ، ومنه الدرّة اليتيمة أي المنفردة بالحسن ، وفعله من باب ضرب وهو قاصر ، وأطلقه العرب على من فُقد أبوه في حال صغره كأنّه بقي منفرداً لا يجد من يدفع عنه ، ولم يعتدّ العرب بفقد الأمّ في إطلاق وصف اليتيم إذ لا يعدم الولد كافلة ، ولكنّه يعدم بفقد أبيه من يدافع عنه وينفقه . وقد ظهر ممّا راعَوه في الاشتقاق أنّ الذي يبلغ مبلغ الرجال لا يستحقّ أن يسمّى يتيماً إذ قد بلغ مبلغ الدفع عن نفسه ، وذلك هو إطلاق الشريعة لا سم اليتيم ، والأصل عدم النقل .وقيل : هو في اللغة من فُقد أبوه ، ولو كان كبيراً ، أو كان صغيراً وكَبر ، ولا أحسب هذا الإطلاق صحيحاً . وقد أريد باليتامى هنا ما يشمل الذكور والإناث وغُلب في ضمير التذكير في قوله : { أموالهم } .وظاهر الآية الأمر بدفع المال لليتيم ، ولا يجوز في حكم الشرع أن يدفع المال له ما دام مطلقاً عليه اسم اليتيم ، إذ اليتيم خاصّ بمن لم يبلغ ، وهو حينئذ غير صالح للتصرّف في ماله ، فتعيّن تأويل الآية إمّا بتأويل لفظ الإيتاء أو بتأويل اليتيم ، فلنا أن نؤوّل { آتوا } بغير معنى ادفعوا . وذلك بما نقل عن جابر بن زيد أنّه قال : نزلت هذه الآية في الذين لا يُورّثون الصغار مع وجود الكبار في الجاهلية ، فيكون { آتوا } بمعنى عيّنوا لهم حقوقهم ، وليكون هذا الأمر وما يذكر بعده تأسيسات أحكام ، لا تأكيد بعضها لبعض ، أو تقييد بعضها لبعض .وقال صاحب «الكشاف» : «يراد بإيتائهم أموالهم أن لا يطمع فيها الأولياء والأوصياء وولاة السوء وقضاته ويكفّوا عنها أيديهم الخاطفة حتّى تأتي اليتامى إذا بلغوا سالمة» فهو تأويل للإيتاء بلازمه وهو الحفظ الذي يترتّب عليه الإيتاء كناية بإطلاق اللازم وإرادة الملزوم ، أو مجاز بالمآل إذ الحفظ يؤول إلى الإيتاء ، وعليه فيكون هو معنى قوله تعالى : { ولا تأكلوا أموالهم إلى أموالكم } . وعلى هذين الوجهين فالمراد هنا الأمر بحفظ حقوق اليتامى من الإضاعة لا تسليم المال إليهم وهو الظاهر من الآية إذ سيجيء في قوله : { وابتلوا اليتامى } \\[ النساء : 6 \\] الآية . ولنا أن نؤوّل اليتامى بالذين جاوزوا حدّ اليُتْم ويبقى الإيتاء بمعنى الدفع ، ويكون التعبير عنهم باليتامى للإشارة إلى وجوب دفع أموالهم إليهم في فور خروجهم من حدّ اليتيم ، أو يبقى على حاله ويكون هذا الإطلاق مقيّداً بقوله الآتي : { حتى إذا بلغوا النكاح فإن آنستم منهم رشداً فادفعوا إليهم أموالهم } \\[ النساء : 6 \\] . ومن الناس من قال : اليتيم يطلق على الصغير والكبير لأنّه مشتقّ من معنى الانفراد أي انفراده عن أبيه ، ولا يخفى أنّ هذا القول جمود على توهّم أنّ الانفراد حقيقيّ وإنّما وضع اللفظ للانفراد المجازي ، وهو انعدام الأب المنزّل منزلة بقاء الولد منفرداً وما هو بمنفرد فإنّ له أمّا وقوماً .قيل : نزلت هذه الآية في رجل من غطفان كان له ابن أخ في حجره ، فلمّا بلغ طلب ماله ، فمنعه عمّه ، فنزلت هذه الآية ، فرَدّ المال لابن أخيه ، وعلى هذا فهو المراد من قوله تعالى : { ولا تأكلوا أموالهم } .وقوله : { ولا تتبدلوا الخبيث بالطيب } أي لا تأخذوا الخبيث وتعطوا الطيّب . والقول في تعدية فعل تبدّل ونظائره مضى عند قوله تعالى في سورة فالبقرة ( 61 ) قال : { أتستبدلون الذي هو أدنى بالذي هو خير } وعلى ما تقرّر هناك يتعيّن أن يكون الخبيث هو المأخوذ ، والطيّب هو المتروك .والخبيث والطيّب أريد بهما الوصف المعنوي دون الحسي ، وهما استعارتان؛ فالخبيث المذموم أو الحرام ، والطيّب عكسه وهو الحلال : وتقدّم في قوله تعالى : { يأيها الناس كلوا مما في الأرض حلالاً طيباً } في البقرة ( 168 ) . فالمعنى : ولا تكسبوا المال الحرام وتتركوا الحلال أي لو اهتممتم بإنتاج أموالكم وتوفيرها بالعمل والتجر لكان لكم من خلالها ما فيه غنية عن الحرام ، فالمنهي عنه هنا هو ضدّ المأمور به من قبل تأكيداً للأمر ، ولكنّ النهي بيَّن ما فيه من الشناعة إذا لم يمتثل الأمر ، وهذا الوجه ينبىء عن جعل التبدّل مجازاً والخبيث والطيّب كذلك ، ولا ينبغي حمل الآية على غير هذا المعنى وهذا الاستعمال . وعن السديّ ما يقتضي خلاف هذا المعنى وهو غير مرضي .وقوله : ولا تأكلوا أموالهم إلى أموالكم } نهي ثالث عن أخذ أموال اليتامى وضمّها إلى أموال أوليائهم ، فينتسق في الآية أمر ونهيان : أمروا أن لا يمنعوا اليتامى من مواريثهم ثم نهوا عن اكتساب الحرام ، ثم نهوا عن الاستيلاء على أموالهم أو بعضها ، والنهي والأمر الأخير تأكيدان للأمر الأول .والأكل استعارة للانتفاع المانع من انتفاع الغير وهو الملك التامّ ، لأنّ الأكل هو أقوى أحوال الاختصاص بالشيء لأنّه يحرزه في داخل جسده ، ولا مطمع في إرجاعه ، وضمّن ( تأكلوا ) معنى تضمّوا فلذلك عدي بإلى أي : لا تأكلوها بأن تضمّوها إلى أموالكم .وليس قيد { إلى أموالكم } محطّ النهي ، بل النهي واقع على أكل أموالهم مطلقاً سواء كان للآكل مال يَضُمّ إليه مالَ يتيمه أم لم يكن ، ولكن لمّا كان الغالب وجود أموال للأوصياء ، وأنّهم يريدون من أكل أموال اليتامى التكثّر ، ذكر هذا القيد رعياً للغالب ، ولأنّه أدخل في النهي لما فيه من التشنيع عليهم حيث يأكلون حقوق الناس مع أنّهم أغنياء؛ على أنّ التضمين ليس من التقييد بل هو قائم مقام نهيين ، ولذلك روي : أنّ المسلمين تجنّبوا بعد هذه الآية مخالطة أموال اليتامى فنزلت آية البقرة ( 220 ) : { وإن تخالطوهم فإخوانكم } فقد فهموا أنّ ضمّ مال اليتيم إلى مال الوصيّ حرام ، مع علمهم بأنّ ذلك ليس مشمولاً للنهي عن الأكل ولكن للنهي عن الضمّ . وهما في فهم العرب نهيان ، وليس هو نهياً عن أكل الأغنياء أموال اليتامى حتى يكون النهي عن أكل الفقراء ثابتاً بالقياس لا بمفهوم الموافقة إذ ليس الأدْوَنُ بصالح لأن يكون مفهوم موافقة .والحُوب بضمّ الحاء لغة الحجاز ، و بفتحها لغة تميم ، وقيل : هي حبشية ، ومعناه الإثم ، والجملة تعليل للنهي : لموقع إنّ منها ، أي نهاكم الله عن أكل أموالهم لأنّه إثم عظيم . ولكون إنّ في مثله لمجرد الاهتمام لتفيد التعليل أكِّد الخبر بكان الزائدة .\n\n",
      "translations": [
        {
          "translation": "(Give unto orphans their wealth) which is with you when they reach the legal age. (Exchange not the good for the bad (in your management)) do not consume their wealth which is prohibited for you while leaving 81 your own wealth which is lawful for you (nor absorb their wealth into your own wealth) by mixing them. (Lo! That) wrongfully consuming the wealth of the orphan (would be a great sin) which will be met by Allah's punishment. This was revealed about a man from Ghatafan who had in his possession a great amount of wealth that belonged to his orphaned nephew. When this verse was revealed he decided to separate the wealth of his nephew from his own for fear of committing a sin. Allah then revealed the following:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تَتَبَدَّلُواْ ٱلْخَبِيثَ بِٱلطَّيِّبِ } فالخَبيثُ: الحَرَامُ والطَّيبُ الحَلالُ\n\n\n\n\nوقوله تعالى: { كَانَ حُوباً كَبِيراً } معناهُ إِثمٌ كَبيرٌ\n ويقالُ حُوَبَاً وَحَوَباً\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And do not exchange the bad for the good.} So the bad is the forbidden and the good is the permissible.\n\n\nAnd His saying - { kāna ḥūbāan kabīrāan } - means a great sin.\n\n\nAnd it is said {huwaabaan wa hawaabaan},\n\nwhich means \"he is gone and gone.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وآتوا اليتامى } يتامى قواكم الروحانية\n المنقطعين عن تربية الروح القدسيّ الذي هو أبوهم { أموالهم } أي: معلوماتهم وكمالاتهم\n وربوهم بها { ولا تتبدّلوا الخبيث } من المحسوسات والخياليات والوساوس ودواعي الوهم وسائر قوى النفس التي هي أموالها { بالطيب } من أموالهم { ولا تأكلوا أمْوَالهم إلى أموالكم } أي: لا تخلطوها بها\n فيشتبه الحق بالباطل وتستعملوها في تحصيل لذاتكم الحسيّة وكمالاتكم النفسية\n فتنتفعوا بها في مطالبكم الخسيسة الدنيوية وتجعلوها غذاء نفوسكم { إنه كان حُوباً كبيراً } حجبة وحرماناً",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعد البلوغ { آتُواْ ٱلْيَتَامَىٰ } قبل البلوغ\n إذ لا يتم بعد البلوغ { أَمْوَالَهُمْ } المحفوظة\n الموروثة من آبائهم { وَ } عليكم حين الأداء أن { لاَ تَتَبَدَّلُواْ ٱلْخَبِيثَ } الرديء من أموالكم { بِٱلطَّيِّبِ } الجيِّد من أموالهم { وَ } أيضاً\n عليكمإن أردتم التصرف في أموالهم مقدار معاشهم أن { لاَ تَأْكُلُوۤاْ أَمْوَالَهُمْ إِلَىٰ أَمْوَالِكُمْ } أي: مع أموالكم مختلطين { إِنَّهُ } أي: التصرف في أموالهم بلا رعاية غبطتهم { كَانَ حُوباً كَبِيراً } [النساء: 2] إثماً عظيماً\n مُسقطاً للمروءة بالمرة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: اليتيم: مَنْ فقدَ أباه، ولا يقال فيه اليتيم عُرفا إلا قبل البلوغ، وهو هنا مجاز، أي: من كان يتيمًا، والحوبُ: الإثم، ويقال فيه: حوبا، بالضم والفتح، مع الواو والألف، مصدر حاب حوبًا وحوَبا وحابا. يقول الحقْ جلّ جلاله: { وآتوا } أي أعطوا { اليتامى أموالهم } إذا بلغوا، وأُنِس منهم الرشد، وسمَّاهم يتامى بعد البلوغ اتساعًا لقرب عهدهم بالصغر. حثًا على أن يُدفع إليهم أموالهم أول بلوغهم، قبل أن يزول عنهم هذا الاسم إذا أنِسَ فيهم الرشد، ويدل على هذا ما قيل في سبب نزول الآية، وهو أن رجلآ من غطفان كان معه مال كثير لابن أخ له، فلما بلغ طلب مال أبيه، فمنعه، فنزلت الآية، فلما سمعها العم قال: أطعنا الله ورسوله، ونعوذ بالله من الحُوب الكبير. وقيل: إن العرب كانت لا تورِّث الصغار مع الكبار، فأُمِرُوا أن يورثوهم، وعلى هذا يكون اليتيم على حقيقته، فعلى الأول: الخطاب للأوصياء، وعلى الثاني: للعرب التي كانت لا تورث الصغار. ثم قال: { ولا تتبدلوا الخبيث بالطيب } أي: لا تتبدلوا الحرام من أموالهم بالحلال من أموالكم، أو: لا تأخذوا الرفيع من أموالهم وتُعطوا الخبيث مكانها من أموالكم. كان بعضهم يبدل الشاة السمينة من مال اليتيم بالمهزولة من ماله، والدرهم الطيب بالزائف. { ولا تأكلوا أموالهم } مضمومًا { إلى أموالكم } فتنفقونها معًا، مع أن اليتيم لا يأكل كالكبير، إلا إذا كان المنفَق قدَّر أكله، أو لمصلحة. { إنه } أي: الأكل، { كان حُوبًا كبيرًا } أي: إثمًا عظيمًا. الإشارة: أمر الحقّ جلّ جلاله أغنياء القلوب، وهم أكابر الأولياء الراسخون في علم الغيوب، أن يَمنحوا من تعلق بهم من الفقراء والضعفاء، من الغني بالله الذي منحهم الله، حتى لا يلتفتوا إلى سواه، وأن يَقبلوا كل من أتى إليهم من العباد، سواء كان من أهل المحبة والوداد، أو من أهل المخالفة والعناد، ولا يتبدلوا الخبيث بالطيب، بحيث يَقبلون من وجدوه طيب الأخلاق، ويردون من وجدوه خبيث الأخلاق، فإن هذا ليس من شأن أهل التربية النبوية، بل من شأنهم أن يقبلوا الناس على السوية، ويقلبوا فيهم الأعيان، فيقبلون العاصي طائعًا، والكافر مؤمنًا، والغافل ذاكرًا، والشحيح سخيًّا، والخبيث طيبًا، والمسيء محسنًا، والجاهل عارفًا، وهكذا لما عندهم من الإكسير، وهي الخمرة الأزلية، أي: التي من شأنها أن تقلب الأعيان، كما قال ابن الفارض رضي الله عنه في وصفها:\nوقوله: { ولا تأكلوا أموالهم إلى أموالكم } يعني: حتى تتحققوا بوصول الغني إلى قلوبهم، فإن تحققتم فخذوا ما بذلوا لكم من أموالهم. والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:26",
      "similarity": 0.17155338982218743
    },
    {
      "verse": "5:100",
      "similarity": 0.16103721645879476
    },
    {
      "verse": "21:74",
      "similarity": 0.1444417919870855
    },
    {
      "verse": "3:179",
      "similarity": 0.13581679558748824
    },
    {
      "verse": "8:37",
      "similarity": 0.12280386546692784
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004002.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004002.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}