{
  "chapter": "النساء",
  "text": "وءاتوا۟ اليتمى امولهم ولا تتبدلوا۟ الخبيث بالطيب ولا تاكلوا۟ امولهم الى امولكم انه كان حوبا كبيرا",
  "translations": [
    {
      "translation": "Give to the orphans their possessions, and do not replace things of your own which are bad with things which are good among theirs, and do not intermix their goods with your own and make use of them, for this is a grievous crime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give orphans their property, and do not exchange the bad for the good, and do not eat up their property by mixing it with your own. This surely is a mighty sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give to the orphans their property. Do not exchange the pure for the filthy and do not spend the property of orphans along with your own; this would be a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give the orphans their wealth and do not exchange the pure for the foul; and do not devour (or use up) their wealth, mixing it with your own; this is indeed a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give unto orphans their property and do not exchange (your) bad things for (their) good ones; and devour not their substance (by adding it) to your substance. Surely, this is a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give to the orphans their property, and do not substitute worthless (things) for (their) good (ones), and do not devour their property (as an addition) to your own property; this is surely a great crime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give the orphans their property, and do not exchange the corrupt for the good; and devour not their property with your property; surely that is a great crime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give unto orphans their wealth. Exchange not the good for the bad (in your management thereof) nor absorb their wealth into your own wealth. Lo! that would be a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give the orphans the possessions that belong to them, do not exchange good things with bad and do not consume their property, adding it to your own. Surely, this is a great crime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give unto the orphans their substance, and substitute not the bad for the good; and devour not their substance by adding it to your substance; verily that is a great crime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give the orphans their property, and do not replace the good with the bad, and do not eat up their property [by mingling it] with your own property, for that is indeed a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To orphans restore their property (When they reach their age), nor substitute (your) worthless things for (their) good ones; and devour not their substance (by mixing it up) with your own. For this is indeed a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give unto orphans their property and do not exchange (your) bad things for (their) good ones; and devour not their substance (by adding it) to your substance. Surely, this is a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give the orphans their wealth. Do not exchange the evil for the good, nor consume their wealth with your wealth. Surely, that is a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give orphans their properties, and do not substitute the bad for the good. And do not consume their properties by combining them with yours, for that would be a serious sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give to the orphans their properties and do not substitute the defective [of your own] for the good [of theirs]. And do not consume their properties into your own. Indeed, that is ever a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:2] The following was revealed regarding an orphan who demanded his property from his guardian but was refused it: Give the orphans, the under-age ones that have no father, their property, when they have reached maturity, and do not exchange the evil, the unlawful, for the good, the lawful, that is, taking the one in place of the other, as you do when you take what is good from the orphan’s property, and leave him your faulty property instead; and absorb not their property, [by] adding it, into your property; surely that, the absorbing of it, is a great crime, a serious sin. When this was revealed they found it difficult to maintain guardianship over orphans, and some of them had ten or eight wives under their care, and did not treat them all equally, and so the following was revealed:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Give unto orphans their wealth) which is with you when they reach the legal age. (Exchange not the good for the bad (in your management)) do not consume their wealth which is prohibited for you while leaving 81 your own wealth which is lawful for you (nor absorb their wealth into your own wealth) by mixing them. (Lo! That) wrongfully consuming the wealth of the orphan (would be a great sin) which will be met by Allah's punishment. This was revealed about a man from Ghatafan who had in his possession a great amount of wealth that belonged to his orphaned nephew. When this verse was revealed he decided to separate the wealth of his nephew from his own for fear of committing a sin. Allah then revealed the following:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تَتَبَدَّلُواْ ٱلْخَبِيثَ بِٱلطَّيِّبِ } فالخَبيثُ: الحَرَامُ والطَّيبُ الحَلالُ\n\n\n\n\nوقوله تعالى: { كَانَ حُوباً كَبِيراً } معناهُ إِثمٌ كَبيرٌ\n ويقالُ حُوَبَاً وَحَوَباً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعد البلوغ { آتُواْ ٱلْيَتَامَىٰ } قبل البلوغ؛ إذ لا يتم بعد البلوغ { أَمْوَالَهُمْ } المحفوظة، الموروثة من آبائهم { وَ } عليكم حين الأداء أن { لاَ تَتَبَدَّلُواْ ٱلْخَبِيثَ } الرديء من أموالكم { بِٱلطَّيِّبِ } الجيِّد من أموالهم { وَ } أيضاً، عليكمإن أردتم التصرف في أموالهم مقدار معاشهم أن { لاَ تَأْكُلُوۤاْ أَمْوَالَهُمْ إِلَىٰ أَمْوَالِكُمْ } أي: مع أموالكم مختلطين { إِنَّهُ } أي: التصرف في أموالهم بلا رعاية غبطتهم { كَانَ حُوباً كَبِيراً } [النساء: 2] إثماً عظيماً، مُسقطاً للمروءة بالمرة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: اليتيم: مَنْ فقدَ أباه، ولا يقال فيه اليتيم عُرفا إلا قبل البلوغ، وهو هنا مجاز، أي: من كان يتيمًا، والحوبُ: الإثم، ويقال فيه: حوبا، بالضم والفتح، مع الواو والألف، مصدر حاب حوبًا وحوَبا وحابا\n يقول الحقْ جلّ جلاله: { وآتوا } أي أعطوا { اليتامى أموالهم } إذا بلغوا، وأُنِس منهم الرشد، وسمَّاهم يتامى بعد البلوغ اتساعًا لقرب عهدهم بالصغر\n حثًا على أن يُدفع إليهم أموالهم أول بلوغهم، قبل أن يزول عنهم هذا الاسم إذا أنِسَ فيهم الرشد، ويدل على هذا ما قيل في سبب نزول الآية، وهو أن رجلآ من غطفان كان معه مال كثير لابن أخ له، فلما بلغ طلب مال أبيه، فمنعه، فنزلت الآية، فلما سمعها العم قال: أطعنا الله ورسوله، ونعوذ بالله من الحُوب الكبير\n وقيل: إن العرب كانت لا تورِّث الصغار مع الكبار، فأُمِرُوا أن يورثوهم، وعلى هذا يكون اليتيم على حقيقته، فعلى الأول: الخطاب للأوصياء، وعلى الثاني: للعرب التي كانت لا تورث الصغار\n ثم قال: { ولا تتبدلوا الخبيث بالطيب } أي: لا تتبدلوا الحرام من أموالهم بالحلال من أموالكم، أو: لا تأخذوا الرفيع من أموالهم وتُعطوا الخبيث مكانها من أموالكم\n كان بعضهم يبدل الشاة السمينة من مال اليتيم بالمهزولة من ماله، والدرهم الطيب بالزائف\n { ولا تأكلوا أموالهم } مضمومًا { إلى أموالكم } فتنفقونها معًا، مع أن اليتيم لا يأكل كالكبير، إلا إذا كان المنفَق قدَّر أكله، أو لمصلحة\n { إنه } أي: الأكل، { كان حُوبًا كبيرًا } أي: إثمًا عظيمًا\n الإشارة: أمر الحقّ جلّ جلاله أغنياء القلوب، وهم أكابر الأولياء الراسخون في علم الغيوب، أن يَمنحوا من تعلق بهم من الفقراء والضعفاء، من الغني بالله الذي منحهم الله، حتى لا يلتفتوا إلى سواه، وأن يَقبلوا كل من أتى إليهم من العباد، سواء كان من أهل المحبة والوداد، أو من أهل المخالفة والعناد، ولا يتبدلوا الخبيث بالطيب، بحيث يَقبلون من وجدوه طيب الأخلاق، ويردون من وجدوه خبيث الأخلاق، فإن هذا ليس من شأن أهل التربية النبوية، بل من شأنهم أن يقبلوا الناس على السوية، ويقلبوا فيهم الأعيان، فيقبلون العاصي طائعًا، والكافر مؤمنًا، والغافل ذاكرًا، والشحيح سخيًّا، والخبيث طيبًا، والمسيء محسنًا، والجاهل عارفًا، وهكذا لما عندهم من الإكسير، وهي الخمرة الأزلية، أي: التي من شأنها أن تقلب الأعيان، كما قال ابن الفارض رضي الله عنه في وصفها:\n",
      "translations": []
    }
  ]
}