{
  "chapter": "النساء",
  "text": "وان اردتم استبدال زوج مكان زوج وءاتيتم احدىهن قنطارا فلا تاخذوا۟ منه شيـا اتاخذونه بهتنا واثما مبينا",
  "translations": [
    {
      "translation": "If you desire to exchange one wife for another and have given your original wife a large amount, do not take any of it. Would you take it by means of slander and outright crime?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you want to take another wife in place of the one you are married to, then even if you have given her a talent of gold, do not take back a thing. Would you take it away by slandering and using unjust means?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you decide to dispense with a wife in order to take another, do not take away anything of what you might have given the first one, even if you had given her a heap of gold. Would you take it back by slandering her and committing a manifest wrong?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you want to divorce a woman so that you can marry another, do not take back the dowry which you had paid even if what you paid was a large amount of gold. To do this is a slanderous act and a manifest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you wish to change one wife for another and you have given her heaps of treasure, do not take back anything from it; will you take it back by slander and open sin?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you intend to replace a wife by another and you have given one of them a Qintar, take not the least bit of it back; would you take it wrongfully without a right and (with) a manifest sin\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you wish to have (one) wife in place of another and you have given one of them a heap of gold, then take not from it anything; would you take it by slandering (her) and (doing her) manifest wrong?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you desire to exchange a wife in place of another, and you have given to one a hundredweight, take of it nothing. What, will you take it by way of calumny and manifest sin?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye wish to exchange one wife for another and ye have given unto one of them a sum of money (however great), take nothing from it. Would ye take it by the way of calumny and open wrong?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you desire to replace one wife with another, do not take any part of her dower back: even if you have given her a treasure. Would you take it by slandering her and with manifest sinfulness?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye intend to replace a wife by anot her, and ye have given the one of them a talent, take not back aught therefrom. Would ye take it back by slander and manifest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you desire to take a wife in place of another, and you have given one of them a quintal [of gold], do not take anything away from it. Would you take it by way of calumny and flagrant sin?!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if ye decide to take one wife in place of another, even if ye had given the latter a whole treasure for dower, Take not the least bit of it back: Would ye take it by slander and manifest wrong?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you intend to replace a wife by another and you have given one of them a Cantar (of gold i.e. a great amount) as Mahr, take not the least bit of it back; would you take it wrongfully without a right and (with) a manifest sin?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you wish to take a wife in the place of another wife, and you have given to one a Qintar (98, 841. 6 lbs.) so do not take from it anything. What, will you take it by way of calumny and a clear sin!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you wish to replace one wife with another, and you have given one of them a fortune, take nothing back from it. Would you take it back fraudulently and sinfully?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you want to replace one wife with another and you have given one of them a great amount [in gifts], do not take [back] from it anything. Would you take it in injustice and manifest sin?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:20] And if you desire to exchange a wife in place of another, by divorcing the one, and you have given to one, of the spouses, a hundredweight, that is, a large sum as dowry, take of it nothing. Would you take it by way of calumny, injustice, and manifest sin? (buhtānan, ‘calumny’, and ithman, ‘sin’, end in the accusative because they are circumstantial qualifiers); the interrogative here is meant as a rebuke, and as a disavowal where He says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if ye wish to exchange one wife for another) He says: If you wish to marry a woman and divorce one you are already married to, or marry a woman in addition to the one you are already married to (and ye have given unto one of them a sum of money (however great)) a dowry, (take nothing from it) from the dowry. (Would ye take it) the dowry (by the way of calumny) as an unlawful possession (and open wrong?) a clear transgression.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِنْ } غلب عليكم بمقتضى طبعكم { أَرَدْتُّمُ ٱسْتِبْدَالَ زَوْجٍ } منكوحةٍ جديدةٍ { مَّكَانَ زَوْجٍ } قديمةٍ أردتم تطليقها\n فعلكيم في دينكم ألاَّ تأخذوا من المطلقة شيئاً { وَ } إن { آتَيْتُمْ } حالة النكاح { إِحْدَاهُنَّ } أي: كل واحدةٍ منهم إن كن أكثر من واحدةٍ { قِنْطَاراً } مالاً كثيراً منضداً\n مخزوناً { فَلاَ تَأْخُذُواْ مِنْهُ } من القنطار { شَيْئاً } قليلاً نزاً يسيراً { أَتَأْخُذُونَهُ } أي: من مهورهن أيها المفرطون في متابعة الطبيعة { بُهْتَاناً } تفترونه عليهن { وَ } تكسبون به { إِثْماً مُّبِيناً } [النساء: 20] عظيماً عند الله وعند المؤمنين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { بهتانًا }: حال\n أو على إسقاط الخافض\n يقول الحقّ جلّ جلاله: { وإن أردتم } أن تبدلوا زوجًا { مكان زوج } أخرى بأن تُطلقوا الأولى وتتزوجوا غيرها\n وقد كنتم أعطيتم { إحداهن قنطارًا } أو أقل أو أكثر\n { فلا تأخذوا منه شيئًا } بل أدوه لها كاملاً\n ثم وبَّخهم على ما كانوا يفعلون في الجاهلية\n فقال: { أتأخذونه بهتانًا وإثمًا مبينًا } \n أي: مباهتين وآثمين\n أو بالبهتان والإثم الظاهر\n والبهتان: الكذب الذي يبهت المكذوب عليه\n رُوي أن الرجل كان إذا أراد أن يتزوج امرأة جديدة\n بهت التي عنده بفاحشة حتى يلجئها إلى الافتداء منه بما أعطاها ليصرفه في تزوج الجديدة\n فَنُهُوا عن ذلك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:14",
      "similarity": 0.4341402431465424
    },
    {
      "verse": "33:58",
      "similarity": 0.3772604040580838
    },
    {
      "verse": "4:156",
      "similarity": 0.34445932864903783
    },
    {
      "verse": "24:16",
      "similarity": 0.3376809459195471
    },
    {
      "verse": "21:40",
      "similarity": 0.31895626945853217
    }
  ]
}