{
  "chapter": "النساء",
  "text": "وكيف تاخذونه وقد افضى بعضكم الى بعض واخذن منكم ميثقا غليظا",
  "translations": [
    {
      "translation": "How could you take it when you have been intimate with one another and they have made a binding contract with you?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How could you do that having slept with one another, and when they had taken a solemn pledge from you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can you take it away after each one has enjoyed the other, and they have taken a firm covenant from you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can you take it back when you have had intimate relations and made a solemn agreement with each other?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how will you take it back whereas you have become unveiled before each other, and they have taken a strong pledge from you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how could you take it (back) while you have gone in unto each other, and they have taken from you a firm and strong covenant\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how can you take it when one of you has already gone in to the other and they have made with you a firm covenant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How shall you take it, when each of you has been privily with the other, and they have taken from you a solemn compact?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can ye take it (back) after one of you hath gone in unto the other, and they have taken a strong pledge from you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can you take it when you have been intimate with one another, and she has taken a solemn pledge from you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how can ye take it back when one of you hath gone in unto the other, and they have obtained from you a rigid bond!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How could you take it back, when you have known each other, and they have taken from you a solemn covenant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how could ye take it when ye have gone in unto each other, and they have Taken from you a solemn covenant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how could you take it (back) while you have gone in unto each other, and they have taken from you a firm and strong covenant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can you take it back when you have reached one another (sexually) and they have taken from you a strong covenant!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how can you take it back, when you have been intimate with one another, and they have received from you a solid commitment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how could you take it while you have gone in unto each other and they have taken from you a solemn covenant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:21] How shall you take it, that is, by what right, when each of you has been privily with the other, through sexual intercourse, which validates the dowry, and they have taken from you a solemn covenant, a binding pledge, and that is what God commanded, namely, that they should be retained honourably or set free virtuously.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(How can ye take it (back)) how can you take the dowry back as a lawful possession, (after one of you hath gone in unto the other) when you have come together under one cover as a result of this dowry and marriage, (and they have taken) He says: Allah has taken from you upon marrying women (a strong pledge from you?) a firm pledge that you either keep them in goodness or release them in kindness. Then Allah forbade them from marrying the wives of their fathers, since this is what they did in the pre-Islamic era.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَقَدْ أَفْضَىٰ بَعْضُكُمْ إِلَىٰ بَعْضٍ } معناهُ جَامَعَ\n\n\n\n\nوقوله تعالى: { وَأَخَذْنَ مِنكُم مِّيثَاقاً غَلِيظاً } قالَ زيدُ بن علي عليهما السلامُ: المِيثَاقُ الغَلِيظُ: إِمْسَاكٌ بِمَعْرُوفٍ أَوْ تَسرِيحٌ بِإِحسانٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Some of you have gone too far in relation to others\" - this means that He has brought them all together.\n\nAnd His saying, {And take from among you a firm covenant} - Zayd ibn `Ali, peace be upon them both, said: The firm covenant is to refrain from what is evil or to show kindness.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَيْفَ تَأْخُذُونَهُ } ولا تعلمون { وَ } تستحضرون أنه { قَدْ أَفْضَىٰ } وصل بالمهر { بَعْضُكُمْ } ذكوركم { إِلَىٰ بَعْضٍ } إناثكم { وَأَخَذْنَ } عهدهن { مِنكُم } من أجلكم ورعاية غبطتكم { مِّيثَٰقاً غَلِيظاً } [النساء: 21] عهداً وثيقاً لا ينفصم أصلاً\n وهو ألاَّ يأتين بفاحشةٍ\n ولا يبيدن زينتهن إلا لبعولتهن\n وأن يقصرن نظرهن عليكم\n ويخدمن ويحسن المعاشرة\n إلى غير ذلك من الحدود والحقوق\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم استعظم ذلك فقال: { وكيف تأخذونه وقد أفضى بعضكم إلى بعض } بالمماسة والجماع حتى تقرر الصداق واستحقته بذلك، وقد { أخذن منكم ميثاقاً غليظًا } وهو حسن الصحبة، أو الإمساك بالمعروف والتسريح بالإحسان، أو تمكينها نفسها منه، فإنها ما مكنته إلا لوفاء العهد في الصداق ودوام العشرة\n والله تعالى أعلم\n الإشارة: إذا كان العبد مشتغلاً بجمع دنياه، عاكفًا على حظوظه وهواه، ثم استبدل مكان ذلك الانقطاع إلى مولاه والاشتغال بذكر الله، حتى أفضى إلى شهود أنوار قدسه وسناه، فلا ينبغي أن يرجع إلى شيء خرج عنه لله، ولا يلتفت إلى ما ترك من أمر دنياه، فإن الرجوع في الشيء من شيم اللئام وليس من شأن الكرام، وتأمل ما قاله الشاعر:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:7",
      "similarity": 0.1663683448278972
    },
    {
      "verse": "4:154",
      "similarity": 0.142494090886178
    },
    {
      "verse": "31:24",
      "similarity": 0.12338580400836432
    },
    {
      "verse": "9:123",
      "similarity": 0.1220357037250999
    },
    {
      "verse": "11:58",
      "similarity": 0.11936349560318302
    }
  ]
}