{
  "chapter": "النساء",
  "text": "ولا تنكحوا۟ ما نكح ءاباؤكم من النساء الا ما قد سلف انه كان فحشة ومقتا وساء سبيلا",
  "translations": [
    {
      "translation": "Do not marry any women your fathers married - except for what may have already taken place. That is an indecent act, a loathsome thing and an evil path.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not wed the women your fathers had wed. What happened in the past is now past: It was lewd and abhorrent, and only the way of evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not marry the women whom your fathers married, although what is past is past. This indeed was a shameful deed, a hateful thing, and an evil way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not marry, from now on, the ex-wives of your fathers for that custom was sinful, loathsome, and abominable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not marry the women who were wedded to your fathers (and grand fathers), except what has already passed; that is indeed an act of shame and great wrong; and an evil way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And marry not women whom your fathers married, except what has already passed; indeed it was shameful and Maqtan, and an evil way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And marry not woman whom your fathers married, except what has already passed; this surely is indecent and hateful, and it is an evil way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not marry women that your fathers married, unless it be a thing of the past; surely that is indecent and hateful; an evil way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And marry not those women whom your fathers married, except what hath already happened (of that nature) in the past. Lo! it was ever lewdness and abomination, and an evil way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not marry women whom your fathers married, except for what has already taken place in the past. This is indeed a shameful deed, a loathsome thing and an evil practice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And wed not of women those whom your fathers had wedded, except that which hath already passed. Verily it hath been an indecency and an abomination and an evil way:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not marry any of the women whom your fathers had married, excluding what is already past. That is indeed an indecency, an outrage and an evil course.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And marry not women whom your fathers married,- except what is past: It was shameful and odious,- an abominable custom indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And marry not women whom your fathers married, except what has already passed; indeed it was shameful and most hateful, and an evil way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not marry women your fathers married unless it is a thing of the past surely that was an indecency, hated, and a way of evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not marry women whom your fathers married, except what is already past. That is improper, indecent, and a bad custom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not marry those [women] whom your fathers married, except what has already occurred. Indeed, it was an immorality and hateful [to Allah] and was evil as a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:22] And do not marry women whom (mā means man) your fathers married, unless it be a thing of the past, which is forgiven you; surely that, marrying them, is obscene, vile, and abominable (maqtan, means it results in maqt, ‘severe hate’, from God), an evil way, [an evil] path is this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "He said: (And marry not those women whom your fathers married, except what hath already happened (of 85 that nature) in the past) in the pre-Islamic era. (Lo! It) i.e. marrying the wives of one's father (was ever lewdness) a transgression (and abomination) antagonism, (and an evil way) the worst way to follow. This was revealed about Muhsin Ibn Abi Qays al-Ansari. Allah then showed them the women who are unlawful for them to marry.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّهُ كَانَ فَاحِشَةً وَمَقْتاً وَسَآءَ سَبِيلاً } فالمَقْتُ: أَنْ يَتزوجَ الرَّجلُ امرأةَ أَبيهِ بَعْدَهُ\n وسَاءَ سَبِيلا\n معناهُ بِئسَ السَّبيلُ\n والسَّبِيلُ: الطَّريقَةُ والمَسْلَكَةُ\n والسَّبِيلُ\n الجَلْدُ والرّجْمُ!\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"Indeed, he was a wicked and evil man, and a bad way to go,\" the wickedness is that a man marries his father's wife after him.\n\n\nIt is an evil path.\n The worst way\n\n\nThe term \"sabil\" refers to the means or method by which one performs an action.\n\n\nAnd the way\n\n\n{The skin and the whip!}",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً من الحدود المتعلقة بأمر النساء أن { لاَ تَنكِحُواْ } أي: لا تطئوا ولا تجامعوا أيها المؤمنون { مَا نَكَحَ } ما وطئ { ءَابَآؤُكُمْ } أسلافكم سواء كانوا مؤمنين أو كفاراً { مِّنَ ٱلنِّسَآءِ } سواءً كن أمهاتكم أم لا\n حرائر ورقيقات لاستهجان هذا الأمر عقلاً وشرعاً ومروءةً بل طبعاً\n بناء على ما حكي عن بعض الحيوانات أنه لا يجامع مع أمه لتبة كالفرس النجيب وغيره\n ومن أتى ما نهي عنه فقد استحق مقت الله وطرده { إِلاَّ مَا قَدْ سَلَفَ } سبق من وقوعه قبل ورورد النهي { إِنَّهُ } أي نكاح منكوحة الأسلاف { كَانَ } صار { فَاحِشَةً } عظيمة من الفواحش التي منعها الشرع { وَ } مع ذلك { مَقْتاً } حرماناً وطرداً عن مربتة الإنسانية\n لذلك سمى العرب من حصل منه: المقتى { وَسَآءَ سَبِيلاً } [النساء: 22] لمن أتى به سبيل البعد والخذلان عن ساحة الحضور\n\n\nعصمنا الله من شرور أنفسنا وسيئات أعمالنا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: أوقع { ما } على ما يعقل لقلة عقل النساء، كما تقدم، أو مصدرية، والاستثناء منقطع أو متصل على وجه المبالغه في التحريم، أي لا تنكحوا ما نكح آباؤكم إلا ما قد سلف لآبائكم إن قدرتم عليه، فهو كقول الشاعر:\nيقول الحقّ جلّ جلاله: ولا تتزوجوا ما تزوج به { آباؤكم من النساء } بالعقد في الحرائر والوطء في الإماء، { إلا ما قد سلف } فإن الله قد عفا عنكم بعد فسخه وردَّه، { إنه كان فاحشة } عظيمة عند الله، ما أحله لأحد من الأمم قبلكم، { ومقتًا } أي: ممقوتًا فاعله عند الله عند ذوي المروءات من عباد الله، وكان يسمى ولد الرجل من امرأة أبيه مَقيتًا ومقتيًا. { وساء سبيلاً } ، وبئس طريقًا لمن يريد أن يسلكه بعد التحريم. فالمراد بالنكاح في الآية: العقد، فعلى هذا لا تحرم المرأة على الولد إذا زنا بها أبوه على المشهور، قال في الرسالة: ولا يحرم بالزنا حلال. هـ. الإشارة: ما جرى في آباء البشرية يجري في آباء الروحانية من طريق الأدب لا من طريق الشرع، فلا ينبغي للمريد أن يتزوج بامرأة شيخه، مات عنها أو طلقها، فإن ذلك قبيح ومقت عند أرباب الأدب، وأما بنت الشيخ فإن قدر على القيام بتعظيمها فلا بأس، وقد تزوج سيدنا علي ـ كرم الله وجهه ـ بنت سيدنا رسول الله صلى الله عليه وسلم، لكن السلامة في الترك أكثر. وهنا إشارة أخرى أرق، وهي أن يشير بالنساء إلى الأحوال، فلا ينبغي للفقير أن يتعاطى أحوال الشيخ، ويفعل مثله. فإن الشيخ في مقام وهو في مقام، فإذا رجع الشيخ إلى الأسباب وتعاطى العلويات، فلا يقتدى به. إلا أن يدرك مقامه، وكان شيخ شيخنا يقول: لا تقتدوا بالأشياخ في أفعالهم، وإنما اقتدوا بهم في أقوالهم، فإن أقوالهم لكم ولهم، وأفعالهم خاصة بهم. إلا ما قد سلف لهم من الأحوال في حال سيرهم، فخذوها وسيروا من حيث ساروا، حتى تدركوا ما أدركوا، وافعلوا ما شئتم. والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "61:3",
      "similarity": 0.5789017461671556
    },
    {
      "verse": "40:10",
      "similarity": 0.5605728756508426
    },
    {
      "verse": "35:39",
      "similarity": 0.5550353582512543
    },
    {
      "verse": "40:35",
      "similarity": 0.41472010351214167
    },
    {
      "verse": "43:56",
      "similarity": 0.41103545709584505
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004022.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004022.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}