{
  "chapter": "النساء",
  "text": "حرمت عليكم امهتكم وبناتكم واخوتكم وعمتكم وخلتكم وبنات الاخ وبنات الاخت وامهتكم التى ارضعنكم واخوتكم من الرضعة وامهت نسائكم وربئبكم التى فى حجوركم من نسائكم التى دخلتم بهن فان لم تكونوا۟ دخلتم بهن فلا جناح عليكم وحلئل ابنائكم الذين من اصلبكم وان تجمعوا۟ بين الاختين الا ما قد سلف ان الله كان غفورا رحيما",
  "translations": [
    {
      "translation": "Haram for you are: your mothers and your daughters and your sisters, your maternal aunts and your paternal aunts, your brothers' daughters and your sisters' daughters, your foster mothers who have suckled you, your foster sisters by suckling, your wives' mothers, your stepdaughters who are under your protection: the daughters of your wives whom you have had sexual relations with (though if you have not had sexual relations with them there is nothing blameworthy for you in it then), the wives of your sons whom you have fathered, and marrying two sisters at the same time - except for what may have already taken place. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unlawful are your mothers and daughters and your sisters to you, and the sisters of your fathers and your mothers, and the daughters of your brothers and sisters, and foster mothers, foster sisters, and the mothers of your wives, and the daughters of the wives you have slept with who are under your charge; but in case you have not slept with them there is no offence (if you marry their daughters); and the wives of your own begotten sons; and marrying two sisters is unlawful. What happened in the past (is now past): God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden to you are your mothers, your daughters, your sisters, your father's sisters and your mother's sisters, your brother's daughters and your sister's daughters, your milk-mothers, your milk-sisters, the mothers of your wives, and the stepdaughters - who are your foster-children, born of your wives with whom you have consummated the marriage; but if you have not consummated the marriage with them, there will be no blame upon you (if you marry their daughters). It is also forbidden for you to take the wives of the sons who have sprung from your loins and to take two sisters together in marriage, although what is past is past. Surely Allah is All-Forgiving, All-Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are forbidden to marry your mothers, daughters, sisters, paternal aunts, maternal aunts, nieces, your foster-mothers, your foster-sisters, your mothers-in-law, your step-daughters whom you have brought up and with whose mothers you have had carnal relations. It would not be a sin to marry her if you did not have carnal relations with her mother. You are forbidden to marry the wives of your own sons and to marry two sisters at the same time without any adverse affect to the such relations of the past. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden for you are your mothers, and your daughters, and your sisters, and your father’s sisters, and your mother’s sisters, and your brothers’ daughters and your sisters’ daughters, and your foster-mothers (who breast-fed you), and their daughters (your foster-sisters), and your wives’ mothers (mothers-in-law), and your wives’ daughters who are under your protection – born of the women with whom you have cohabited; and if you have not cohabited with them, then it is no sin for you to marry their daughters; and (forbidden are) the wives of your own sons (and foster-sons and grandsons) and the keeping of two sisters together in marriage, except what has already passed; indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden to you (for marriage) are: your mothers, your daughters, your sisters, your father's sisters, your mother's sisters, your brother's daughters, your sister's daughters, your foster mothers who suckled you, your foster milk suckling sisters, your wives' mothers, your stepdaughters under your guardianship, born of your wives unto whom you have gone in -- but there is no sin on you if you have not gone in unto them (to marry their daughters), -- the wives of your sons who (spring) from your own loins, and two sisters in wedlock at the same time, except for what has already passed; verily, Allah is Oft- Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden to you are your mothers and your daughters and your sisters and your paternal aunts and your maternal aunts and brothers' daughters and sisters' daughters and your mothers that have suckled you and your foster-sisters and mothers of your wives and your step-daughters who are in your guardianship, (born) of your wives to whom you have gone in, but if you have not gone in to them, there is no blame on you (in marrying them), and the wives of your sons who are of your own loins and that you should have two sisters together, except what has already passed; surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden to you are your mothers and daughters, your sisters, your aunts paternal and maternal, your brother's daughters, your sister's daughters, your mothers who have given suck to you, your suckling sisters, your wives' mothers, your stepdaughters who are in your care being born of your wives you have been in to -- but if you have not yet been in to them it is no fault in you - and the spouses of your sons who are of your loins, and that you should take to you two sisters together, unless it be a thing of the past; God is All-forgiving, All-compassionate;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden unto you are your mothers, and your daughters, and your sisters, and your father's sisters, and your mother's sisters, and your brother's daughters and your sister's daughters, and your foster-mothers, and your foster-sisters, and your mothers-in-law, and your step-daughters who are under your protection (born) of your women unto whom ye have gone in - but if ye have not gone in unto them, then it is no sin for you (to marry their daughters) - and the wives of your sons who (spring) from your own loins. And (it is forbidden unto you) that ye should have two sisters together, except what hath already happened (of that nature) in the past. Lo! Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are forbidden to take as wives your mothers, daughters, sisters, paternal and maternal aunts, your brothers' daughters and your sisters' daughters, your foster mothers and foster sisters, your wives' mothers and stepdaughters in your protection and the daughters of your wives with whom you have consummated your marriage; but if you have not consummated your marriage then you will not be blamed [if you marry their daughters.] You are also forbidden to marry the spouses of your sons or two sisters together, except what has already passed. Surely, God is ever-forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden unto you are your mothers and your daughters and your sisters and your father's sisters and your mother's sisters, and your brother's daughters and your sister's daughters. and your foster mothers and your foster sisters, and the mothers of your wives and your step-daughters, that are your wards, born of your wives unto whom ye have gone in, but if ye have not gone in unto them, no sin shall be on you, and the wives of your sons that are from your own loins, and, also that ye should have two sisters together, except that which hath already passed; verily Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden to you are your mothers, your daughters and your sisters, your paternal aunts and your maternal aunts, your brother’s daughters and your sister’s daughters, your [foster-]mothers who have suckled you and your sisters through fosterage, your wives’ mothers, and your stepdaughters who are under your care [born] of the wives whom you have gone into—but if you have not gone into them there is no sin upon you—and the wives of your sons who are from your own loins, and that you should marry two sisters at one time—excluding what is already past; indeed Allah is all-forgiving, all-merciful—\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prohibited to you (For marriage) are:- Your mothers, daughters, sisters; father's sisters, Mother's sisters; brother's daughters, sister's daughters; foster-mothers (Who gave you suck), foster-sisters; your wives' mothers; your step-daughters under your guardianship, born of your wives to whom ye have gone in,- no prohibition if ye have not gone in;- (Those who have been) wives of your sons proceeding from your loins; and two sisters in wedlock at one and the same time, except for what is past; for Allah is Oft-forgiving, Most Merciful;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden to you (for marriage) are: your mothers, your daughters, your sisters, your father's sisters, your mother's sisters, your brother's daughters, your sister's daughters, your foster mother who gave you suck, your foster milk suckling sisters, your wives' mothers, your step daughters under your guardianship, born of your wives to whom you have gone in - but there is no sin on you if you have not gone in them (to marry their daughters), - the wives of your sons who (spring) from your own loins, and two sisters in wedlock at the same time, except for what has already passed; verily, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden to you are your mothers, your daughters, your sisters, your paternal aunts and maternal aunts, your brother's daughters, your sister's daughters, your mothers who have given suck to you, your suckling sisters, your wives mothers, and your stepdaughters who are in your care from your wives with whom you have lain, but if you have never lain with them it is no fault in you. (Also forbidden to you) are the wives of your sons who are of your loins, and to take to you two sisters together unless it is a thing of the past. Allah is the Forgiver and the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden for you are your mothers, your daughters, your sisters, your paternal aunts, your maternal aunts, your brother's daughters, your sister's daughters, your foster-mothers who nursed you, your sisters through nursing, your wives' mothers, and your stepdaughters in your guardianship—born of wives you have gone into—but if you have not gone into them, there is no blame on you. And the wives of your genetic sons, and marrying two sisters simultaneously. Except what is past. God is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prohibited to you [for marriage] are your mothers, your daughters, your sisters, your father's sisters, your mother's sisters, your brother's daughters, your sister's daughters, your [milk] mothers who nursed you, your sisters through nursing, your wives' mothers, and your step-daughters under your guardianship [born] of your wives unto whom you have gone in. But if you have not gone in unto them, there is no sin upon you. And [also prohibited are] the wives of your sons who are from your [own] loins, and that you take [in marriage] two sisters simultaneously, except for what has already occurred. Indeed, Allah is ever Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:23] Forbidden to you are your mothers, in marriage, and this includes the paternal and maternal grandmothers; and daughters, including their children, if they should lower themselves [to such standards]; your sisters, from your fathers and mothers; your paternal aunts, that is, the sisters of your fathers and grandfathers; and maternal aunts, that is, the sisters of your mothers and grandmothers; your brother’s daughters, your sister’s daughters, including the children of these daughters; your foster mothers who have given you milk, five times within the first two years, as pointed out in a hadīth; your foster sisters, and, according to the Sunna, the daughters of these; and these foster-sisters include those suckled by a woman with whom the man has had intercourse, those suckled by the man’s paternal aunts, or maternal aunts, or those suckled by his brother’s daughters, or his sister’s daughters, on account of the [Prophet’s] hadīth that, ‘What kinship makes unlawful suckling also makes unlawful’, as reported by al-Bukhārī and Muslim; your mothers-in-law, your step-daughters (rabā’ib, plural of rabība, the daughter of one’s wife from another husband), who are, being brought up, in your care (allātī fī hujūrikum is an adjectival qualifier, reiterating the obvious, without any additional import); being born of your wives you have been in to, in sexual intercourse — but if you have not yet been in to them you are not at fault, if you leave them, to then marry their daughters — and the spouses of your sons who are of your loins, as opposed to those whom you have adopted, whose spouses, in contrast, you may marry; and that you should take to you, in marriage, two sisters together, [sisters] by kinship or by suckling: the Sunna adds that you may not marry her together with her paternal or maternal aunt; it is permissible to marry each of these separately or to own them [as handmaidens] together, but only have sexual intercourse with one of them; unless it be a thing of the past, from preIslamic times, when you may have married in one of the ways mentioned: you are not at fault. God is ever Forgiving, of what you have done in the past, prior to this prohibition, Merciful, to you in this matter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتخلّص إلى ذكر المحرّمات بمناسبة ذكر تحريم نكاح ما نكح الآباء وغُيِّر أسلوب النهي فيه لأنّ ( لا تفعل ) نهي عن المضارع الدالّ على زمن الحال فيؤذن بالتلبّس بالمنهي ، أو إمكان التلبّس به ، بخلاف { حرمت } فيدلّ على أنّ تحريمه أمر مقرّر ، ولذلك قال ابن عباس : «كان أهل الجاهلية يحرّمون ما يحرّم الإسلام إلا امرأة الأب والجمعَ بين الأختين» فمن أجل هذا أيضاً نجد حكم الجمع بين الأختين عُبّر فيه بلفظ الفعل المضارع فقيل : { وأن تجمعوا بين الأختين } .وتعلُّقُ التحريم بأسماء الذوات يُحمل على تحريم ما يُقصد من تلك الذات غالباً فنحو { حرمت عليكم الميتة } إلخ معناه حُرّم أكلها ، ونحو : حرّم الله الخمر ، أي شربها ، وفي { حرمت عليكم أمهاتكم } معناه تزوجهنّ .والأمّهات جمع أُمَّةٍ أو أُمَّهةٍ ، والعرب أماتوا أمَّهة وأمَّه وأبقوا جمعه ، كما أبْقوا أُمّ وأماتوا جمعه ، فلم يسم منهم الأمَّا ، وورد أُمَّة نادراً في قول قول شاعر أنشده ابن كيسان :تقبلتَها عن أمَّةٍ لكَ طَالما ... تُنوزعَ في الأسواق منها خمارُهاوورد أمهة نادراً في بيت يُعزى إلى قصي بن كلاب :عند تناديهم بهَاللٍ وهَبي ... أمَّهَتي خِندفُ وإليَاسُ أبيوجاء في الجمع أمَّهات بكثرة ، وجاء أمَّات قليلاً في قول جرير :لقد ولدَ الأخيطلَ أمُّ سوء ... مقلَّدة من الأمَّات عاراوقيل : إنّ أمَّات خاصّ بما لا يعقل ، قال الراعي :كانت نَجَائبُ مُنْذِر ومُحَرّق ... أمَّاتهنّ وطرقُهُنّ فَحيلافيحتمل أنّ أصل أم أمَّا أو أمَّها فوقع فيه الحذف ثمّ أرجعوها في الجمع .ومن غريب الاتّفاق أنّ أسماء أعضاء العائلة لم تجر على قياس مثل أب ، إذ كان على حرفين ، وأخ ، وابن ، وابنة ، وأحسب أنّ ذلك من أثر أنّها من اللُّغة القديمة التي نطق بها البشر قبل تهذيب اللغة ، ثمّ تطوّرت اللُّغةُ عليها وهي هي . والمراد من الأمهات وما عطف عليها الدنيا وما فوقها ، وهؤلاء المحرّمات من النسب ، وقد أثبت الله تعالى تحريم مَنْ ذكَرَهنّ ، وقد كنّ محرّمات عند العرب في جاهليتها ، تأكيداً لذلك التحريم وتغليظاً له ، إذ قد استقرّ ذلك في الناس من قبل ، فقد قالوا ما كانت الأمّ حلالا لابنها قطّ من عهد آدم عليه السلام ، وكانت الأخت التوأمة حراماً وغيرُ التوامة حلالا ، ثمّ حرّم الله الأخوات مطلقاً من عهد نوح عليه السلام ، ثم حرّمت بنات الأخ ، ويوجد تحريمهنّ في شريعة موسى عليه السلام ، وبقي بنات الأخت حلالا في شريعة موسى ، وثبت تحريمهنّ عند العرب في جاهليتها فيما روى ابن عطية في تفسيره ، عن ابن عباس : أنّ المحرّمات المذكورات هنا كانت مُحرّمة في الجاهلية ، إلاّ امرأة الأب ، والجمعَ بين الأختين . ومثله نقله القرطبي عن محمد بن الحسن صاحب أبي حنيفة مع زيادة توجيه ذكر الاستثناء بقوله : { إلا ما قد سلف } في هذبن خاصة ، وأحسب أن هذا كلّه توطئة لتأويل الاستثناء في قول { إلا ما قد سلف } بأنّ معناه : إلاّ ما سلف منكم في الجاهلية فلا إثم عليكم فيه ، كما سيأتي ، وكيف يستقيم ذلك فقد ذكر فيهنّ تحريم الربائب والأخوات من الرضاعة ، ولا أحسبهنّ كنّ محرّمات في الجاهلية .واعلم أنّ شريعة الإسلام قد نوّهت ببيان القرابة القريبة ، فغرست لها في النفوس وقارا ينزّه عن شوائب الاستعمال في اللَّهو والرفث ، إذ الزواج ، وإن كانّ غرضاً صالحاً باعتبار غايته ، إلاّ أنّه لا يفارق الخاطرَ الأوّل الباعث عليه ، وهو خاطر اللهو والتلذّذ .فوقار الولادة ، أصلا وفرعا ، مانع من محاولة اللهو بالوالدة أو المولودة ، ولذلك اتّفقت الشرائع على تحريمه ، ثم تلاحق ذلك في بنات الإخوة وبنات الأخوات ، وكيف يسري الوقار إلى فرع الأخوات ولا يثبت للأصل ، وكذلك سرى وَقار الآباء إلى أخوات الآباء ، وهنّ العمّات ، ووقار الأمّهات إلى أخواتهنّ وهنّ الخالات ، فمرجع تحريم هؤلاء المحرّمات إلى قاعدة المروءة التابعة لكليّة حفظ العِرض ، من قسم المناسب الضروري ، وذلك من أوائل مظاهر الرقي البشري . و ( ال ) في قوله : { وبنات الأخ وبنات الأخت } عوض عن المضاف إليه أي بنات أخيكم وبنات أختكم .وقوله : { وأمهاتكم اللاتي أرضعنكم } سمّى المراضع أمهّات جريا على لغة العرب ، وما هنّ بأمّهات حقيقة . ولكنهنّ تنزّلن منزلة الأمّهات لأنّ بلبانهنّ تغذّت الأطفال ، ولما في فطرة الأطفال من محبّة لمرضعاتهم محبّة أمّهاتهم الوالدات ، ولزيادة تقرير هذا الإطلاق الذي اعتبره العرب ثم ألحق ذلك بقوله : { الاتي أرضعنكم } دفعاً لتوهّم أنّ المراد الأمّهات إذ لو لا قصد إرادة المرضعات لما كان لهذا الوصف جدوى .وقد أجملت هنا صفةُ الإرضاع ومدّتُه وعدَده إيكالا للناس إلى متعارفهم . وملاك القول في ذلك : أنّ الرضاع إنّما اعتبرت له هذه الحرمة لمعنى فيه وهو أنّه الغذاء الذي لا غذاء غيره للطفل يعيش به ، فكان له من الأثر في دوام حياة الطفل ما يماثل أثَر الأمّ في أصل حياة طفلها . فلا يعتبر الرضاع سبباً في حرمة المرضع على رضيعها إلاّ ما استوفى هذا المعنى من حصول تغذية الطفل وهو ما كان في مدّة عدم استغناء الطفل عنه ، ولذلك قال النبي صلى الله عليه وسلم « إنّما الرضاعة من المجاعة » . وقد حدّدت مدّة الحاجة إلى الرضاع بالحولين لقوله تعالى : { والوالدات يرضعن أولادهن حولين كاملين } وقد تقدّم في سورة البقرة ( 233 ) . ولا اعتداد بالرضاع الحاصل بعد مضي تجاوز الطفل حولين من عمره ، بذلك قال عمر بن الخطاب ، وابن مسعود ، وابن عباس ، والزهري ، ومالك ، والشافعي ، وأحمد ، والأوزاعي ، والثوري ، وأبو يوسف ، وقال أبو حنيفة : المدّة حولان وستّة أشهر . وروى ابن عبد الحكم عن مالك : حولان وأيّام يسيرة . وروى ابن القاسم عنه : حولان وشهران . وروى عنه الوليدُ بن مسلم : والشهران والثلاثة .والأصحّ هو القول الأوّل؛ ولا اعتداد برضاع فيما فوق ذلك ، وما روي أنّ النبي أمر سَهْلَة بنتَ سُهيل زوجةَ أبي حُذيفة أن ترضع سالماً مولى أبي حذيفة لمّا نزلت آية { وما جعل أدعياءكم أبناءكم } \\[ الأحزاب : 4 \\] إذ كان يدخل عليها كما يدخل الأبناء على أمّهاتهم ، فتلك خصوصيّة لها ، وكانت عائشة أمّ المؤمنين إذا أرادت أن يدخل عليها أحد الحجابَ أرضعتْه ، تأوّلت ذلك من إذن النبي صلى الله عليه وسلم لِسَهْلة زوج أبي حذيفة ، وهو رأي لم يوافقها عليه أمّهات المؤمنين ، وأبَيْن أن يدخل أحد عليهنّ بذلك ، وقال به الليث بن سعد ، بإعمال رضاع الكبير . وقد رجع عنه أبو موسى الأشعري بعد أن أفتى به .وأمَّا مقدار الرضاع الذي يحصل به التحريم ، فهو ما يصدق عليه اسم الرضاع وهو ما وصل إلى جوف الرضيع في الحولين ولو مصَّة واحدة عند أغلب الفقهاء ، وقد كان الحكم في أوّل أمر التحريم أن لا تقع الحرمة إلاّ بعشر رضعات ثمّ نسخن بخمس ، لحديث عائشة «كان فيما أنزل الله عشرُ رضعات معلومات يحرّمْن ثمّ نسخن بخمس معلومات فتوفيّ رسول الله وهي فيما يقرأ من القرآن» وبه أخذ الشافعي . وقال الجمهور : هو منسوخ ، وردّوا قولها ( فتوفّي رسول الله وهي فيما يُقرأ ) بنسبة الراوي إلى قلّة الضبط لأنّ هذه الجملة مسترابة إذ أجمع المسلمون على أنها لا تقرأ ولا نسخ بعد وفاة رسول الله صلى الله عليه وسلم وإذا فطم الرضيع قبل الحولين فظاما استغنى بعده عن لبن المرضع بالطعام والشراب لم تحرم عليه من أرضعته بعد ذلك .وقوله تعالى : { وأخواتكم من الرضاعة } إطلاق اسم الأخت على التي رضعت من ثدي مرضعة من أضيفت أخت إليه جرى على لغة العرب ، كما تقدّم في إطلاق الأمّ على المرضع . والرضاعة بفتح الراء اسم مصدر رضع ، ويجوز كسر الراء ولم يقرأ به . ومحلّ { من الرضاعة } حال من { أخواتكم } و ( من ) فيه للتعليل والسببية ، فلا تعتبر أخوَّة الرضاعة إلاّ برضاعة البنت من المرأة التي أرضعت الولد .وقوله : { وأمهات نسائكم } هؤلاء المذكورات إلى قوله : { وأن تجمعوا بين الأختين } هنّ المحرّمات بسبب الصِّهر ، ولا أحسب أنّ أهل الجاهلية كانوا يحرّمون شيئاً منها ، كيف وقد أباحوا أزواج الآباء وهنّ أعظم حرمة من جميع نساء الصهر ، فكيف يظنّ أنهم يحرّمون أمّهات النساء والربائب وقد أشيع أنّ النبي صلى الله عليه وسلم يريد أن يتزوّج دُرّةَ بنتَ أبي سَلَمة وهي ربيبته إذ هي بنت أمّ سلمة ، فسألته إحدى أمّهات المؤمنين فقال : \" لو لم تكن ربيبتي لما حلّت لي إنها ابنة أخي من الرضاعة أرضعتني وأبَا سَلَمة ثويبة \" وكذلك حلائل الأبناء إذ هنّ أبعدُ من حلائل الآباء ، فأرى أنّ هذا من تحريم الإسلام وأنّ ما حكى ابن عطية عن ابن عباس ليس على إطلاقه .وتحريم هؤلاء حكمته تسهيل الخلطة ، وقطع الغيرة ، بين قريب القرابة حتّى لا تفضي إلى حزازات وعداوات ، قال الفخر : «لو لم يدخل على المرأة أبو الرجل وابنه ، ولم تدخل على الرجل امرأتُه وابنتها ، لبقيت المرأة كالمحبوسة . ولتعطّل على الزوج والزوجة أكثر المصالح ، ولو كان الإذن في دخول هؤلاء دون حكم المحرمية فقد تمتدّ عين البعض إلى البعض وتشتدّ الرغبة فتحصل النفرة الشديدة بينهنّ ، والإيذاء من الأقارب أشدّ إيلاماً ، ويترتّب عليه التطليق ، أمّا إذا حصلت المحرمية انقطعت الأطماع ، وانحبست الشهوة ، فلا يحصل ذلك الضرر ، فيبقى النكاح بين الزوجين سليماً عن هذه المفسدة» قلت : وعليه فَتحريم هؤلاء من قسم الحاجيّ من المناسب .والربائب جمع ربيبة ، وهي فعلية بمعنى مفعولة ، من ربَّه إذا كفله ودبّر شؤونه ، فزوج الأمّ رابٌّ وابنتها مربوبة له ، لذلك قيل لها ربيبة .والحُجور جمع حِجْر بفتح الحاء وكسرها مع سكون الجيم وهو ما يحويه مجتمع الرّجلين للجالس المتربّع . والمراد به هنا معنى مجازي وهو الحضانة والكفالة ، لأنّ أوّل كفالة الطفل تكون بوضعه في الحَجر ، كما سمّيت حضانة ، لأنّ أوّلها وضع الطفل في الحضن .وظاهر الآية أنّ الربيبة لا تحرم على زوج أمّها إلاّ إذا كانت في كفالته ، لأن قوله { اللاتي في حجوركم } وصف والأصل فيه إرادة التقييد كما أريد من قوله : { وأمهاتكم اللاتي أرضعنكم } فظاهر هذا أنّها لو كانت بعيدة عن حضانته لم تحرم . ونسب الأخذ بهذا الظاهر إلى علي بن أبي طالب ، رواه ابن عطية ، وأنكر ابن المنذر والطحاوي صحّة سند النقل عن علي ، وقال ابن العربي : إنّه نَقْل باطل . وجزم ابن حزم في المحلَّى بصحّة نسبة ذلك إلى علي بن أبي طالب وعمرَ بن الخطاب . وقال بذلك الظاهرية ، وكأنّهم نظروا إلى أنّ علّة تحريمها مركّبة من كونها ربيبة وما حدث من الوقار بينها وبين حاجرها إذا كانت في حجره وأمّا جمهور أهل العلم فجعلوا هذا الوصف بيانا للواقع خارجاً مخرج الغالب ، وجعلوا الربيبة حراماً على زوج أمّها ، ولو لم تكن هي في حجره . وكأنّ الذي دعاهم إلى ذلك هو النظر إلى علّة تحريم المحرّمات بالصهر ، وهي التي أشار إليها كلام الفخر المتقدّم . وعندي أنّ الأظهر أنّ يكون الوصف هنا خرج مخرج التعليل : أي لأنهنّ في حجوركم ، وهو تعليل بالمظنّة فلا يقتضي اطّراد العلّة في جميع مواقع الحكم .وقوله : { من نسائكم اللاتي دخلتم بهن } ذكر قوله : { من نسائكم } ليُبنى عليه { اللاتي دخلتم بهن } وهو قيد في تحريم الربائب بحيث لا تحرم الربيبة إلاّ إذا وقع البناء بأمّها ، ولا يحرّمها مجرّد العقد على أمّها ، وهذا القيد جرى هنا ولم يجر على قوله : { وأمهات نسائكم } بل أطلق الحكم هناك ، فقال الجمهور هناك : أمّهات نسائكم معناه أمّهات أزواجكم ، فأمّ الزوجة تحرم بمجرد عقد الرجل على ابنتها لأنّ العقد يصيرّها امرأته ، ولا يلزم الدخول ولم يحْمِلوا المطلق منه على المقيَّد بعده ، ولا جعلوا الصفة راجعة للمتعاطفات لأنّها جرت على موصوف مُتعيِّننٍ تعلّقه بأحد المتعاطفات ، وهو قوله : { من نسائكم } المتعلق بقوله : وربائبكم ولا يصلح تعلّقه ب { أمّهات نسائكم } .وقال علي بن أبي طالب ، وزيدُ بن ثابت ، وابنُ عمر ، وعبد الله بن عبّاس ، ومجاهد ، وجابر ، وابن الزبير : لا تحرم أمّ المرأة على زوج ابنتها حتّى يدخل بابنتها حملا للمطلق على المقيّد ، وهو الأصحّ مَحملاً . ولم يستطع الجمهور أن بوجّهوا مذهبهم بعلّة بيّنة ، ولا أن يستظهروا عليه بأثر . وعلّة تحريم المرأة على زوج ابنتها تساوي علّة تحريم ربيبة الرجل عليه ، ويظهر أنّ الله ذكر أمّهات النساء قبل أن يذكر الربائب ، فلو أراد اشتراط الدخول بالأمّهات في تحريمهنّ على أزواج بناتهنّ لذكره في أوّل الكلام قبل أن يذكره مع الربائب .وهنالك رواية عن زيد بن ثابت أنّه قال : إذا طلّق الأمّ قبل البناء فله التزوّج بابنتها ، وإذا ماتت حَرُمت عليه ابنتُها . وكأنّه نظر إلى أنّ الطلاق عدول عن العقد ، والموت أمر قاهر ، فكأنّه كان ناوياً الدخول بها ، ولا حظّ لهذا القول .وقوله : { وحلائل أبنائكم } الحلائل جمع الحليلة فعيلة بمعنى فاعلة ، وهي الزوجة ، لأنّها تحِلّ معه ، وقال الزجّاج : هي فعيلة بمعنى مفعولة ، أي محلّلة إذ أباحها أهلها له ، فيكون من مجيء فعيل للمفعول من الرباعي في قولهم حكيم ، والعدول عن أن يقال : ومَا نكح أبناؤكم أو ونساء أبنائكم إلى قوله : { وحلائل أبنائكم } تفنّن لتجنّب تكرير أحد اللفظين السابقين وإلاّ فلا فرق في الإطلاق بين الألفاظ الثلاثة .وقد سُمي الزوج أيضاً بالحليل وهو يحتمل الوجهين كذلك . وتحريم حليلة الابن واضح العلّة ، كتحريم حليلة الأب .وقوله : { الذين من أصلابكم } تأكيد لمعنى الأبناء لدفع احتمال المجاز ، إذ كانت العرب تسمّي المتبنَّى ابناً ، وتجعل له ما للابن ، حتّى أبطل الإسلام ذلك وقوله تعالى : { ادعوهم لآبائهم } \\[ الأحزاب : 5 \\] فما دُعي أحد لمتبنّيه بعدُ ، إلاّ المقداد بن الأسود وعُدّت خصوصيّة . وأكّد الله ذلك بالتشريع الفعلي بالإذن لرسوله صلى الله عليه وسلم بتزوّج زينب ابنة جحش ، بعد أن طلّقها زيد بن حارثة الذي كان تبنّاه ، وكان يُدعى زيد بن محمد . وابن الابن وابن البنت ، وإن سفلا ، أبناء من الأصلاب لأنّ للجدّ عليهم ولادة لا محالة .وقوله : { وأن تجمعوا بين الأختين } هذا تحريم للجمع بين الأختين فحكمته دفع الغيرة عمّن يريد الشرع بقاء تمام المودّة بينهما ، وقد علم أنّ المراد الجمع بينهما فيما فيه غيرة ، وهو النكاح أصالة ، ويلحق به الجمع بينهما في التسرّي بملك اليمين ، إذ العلّة واحدة فقوله تعالى : { وأحل لكم ما وراء ذلكم أن تبتغوا بأموالكم } وقوله :{ إلا ما ملكت أيمانكم } \\[ النساء : 24 \\] يخصّ بغير المذكورات . وروي عن عثمان بن عفّان : أنّه سئل عن الجمع بين الأختين في التسري فقال : «أحلتهما» آية يعني قوله تعالى : { وأحل لكم ما وراء ذلكم } وحرّمتهما آية يعني هذه الآية ، أي فهو متوقّف . وروي مثله عن علي ، وعن جمع من الصحابة ، أنّ الجمع بينهما في التسرّي حرام ، وهو قول مالك . قال مالك «فإن تسرّى بإحدى الأختين ثمّ أراد التسرّي بالأخرى وقف حتى يحرّم الأولى بما تحرم به من بيع أو كتابة أو عتق ولا يحدّ إذا جمع بينهما» . وقال الظاهرية : يجوز الجمع بين الأختين في التسرّي لأنّ الآية واردة في أحكام النكاح ، أمّا الجمع بين الأختين في مجرَّد الملك فلا حظر فيه .وقوله : { إلا ما قد سلف } هو كنظيره السابق ، والبيان فيه كالبيان هناك ، بيد أنّ القرطبي قال هنا : ويحتمل معنى زائداً وهو جواز ما سلف وأنّه إذا جرى الجمع في الجاهلية كان النكاح صحيحاً وإذا جرى الجمع في الإسلام خيّر بين الأختين من غير إجراء عقود الكفّار على مقتضى الإسلام ، ولم يعزُ القول بذلك لأحد من الفقهاء .وقوله : { إن الله كان غفوراً رحيماً } يناسب أن يكون معنى { إلا ما قد سلف } تقرير ما عقدوه من ذلك في عهد الجاهلية ، فالمغفرة للتجاوز عن الاستمرار عليه ، والرحمة لبيان سبب ذلك التجاوز .\n\n",
      "translations": [
        {
          "translation": "He said: (Forbidden unto you are your mothers) your blood mothers, (and your daughters) your blood daughters, (and your sisters) your blood sisters, whether from both parents or from either one of them, (and your father's sisters, and your mother's sisters, and your brother's daughters) the daughters of your blood brother whether he is a full brother or half brother from the father or the mother (and your sister's daughters) and the daughters of your sister whether she is a full sister or half sister from the father or mother, (and your foster mothers) who suckled you within the first two years, (and your foster sisters, and your mothers-in-law) whether you have consummated the marriage with their daughters or not: in both cases you are forbidden from marrying them, (and your stepdaughters who are under your protection) who are brought up in your homes ((born) of your women unto whom ye have gone in) with whom you are married and consummated this marriage (but if ye have not gone in unto them) if you have not have consummated the marriage with their mothers, (then it is no sin for you) to marry their daughters after you divorce their mothers (and the wives of your sons who (spring) from your own loins) your sons who are born in wedlock. (And (it is forbidden unto you) that ye should have two sisters together) whether they are free or slave sisters, (except what hath already happened (of that nature) in the past) before Islam. (Lo! Allah is ever Forgiving) of that which ensued from you in the pre-Islamic era, (Merciful) regarding that which ensues from you in Islam, provided that you repent.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَرَبَائِبُكُمُ ٱلَّٰتِي فِي حُجُورِكُمْ } فربيبةُ الرّجلِ: بنتُ امرأتِهِ\n وفِي حُجُورِكُمْ معناه فِي بيوتِكُمْ\n\n\n\n\nوقوله تعالى: { وَحَلَٰئِلُ أَبْنَائِكُمُ } معناهُ أَزْواجُهُمْ والواحدةُ: حَلِيلةٌ\n\n\n\n\nوقوله تعالى: { فَلاَ جُنَاحَ عَلَيْكُمْ } معناهُ لا إِثْمَ عَلَيكُمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {And your wives are your rabībāt, those whom you possess} [Qur'an 4:24], the wife of a man is his rabībah.\n\n\nAnd in your homes is your meaning.\n\nAnd His saying - the Most High - {And the spouses of your sons} means their wives, and the single [woman] is a haliylah.\n\n\nAnd His saying, \"There is no sin on you,\" means there is no sin on you.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "ومن شدة سناعته وعظيم قبحه عند الله، قدمه سبحانه على جميع المحرمات ثم فرعها عليه بقوله: { حُرِّمَتْ عَلَيْكُمْ } في دينكم { أُمَّهَٰتُكُمْ } أي: نكاحها مطلقاً { وَبَنَٰتُكُمْ } أيضاً كذلك { وَأَخَوَٰتُكُمْ } مع من يتفرع عليهن { وَعَمَّٰتُكُمْ } أنفسهن { وَخَالَٰتُكُمْ } أيضاً كذلك { وَبَنَاتُ ٱلأَخِ } من الأبوين أو من الأب أو من الأم { وَبَنَاتُ ٱلأُخْتِ } أيضاً كذلك { وَ } أيضاً حرمت عليكم { أُمَّهَٰتُكُمُ } من الأجنبيات { الَّٰتِي أَرْضَعْنَكُمْ } مصة أو مصتين { وَ } حرمت أيضاً { أَخَوَٰتُكُم مِّنَ ٱلرَّضَٰعَةِ } إذ يحرم من الرضاع ما يحرم من النسب غالباً { وَ } كذا حرمت عليكم { أُمَّهَٰتُ نِسَآئِكُمْ } لحرمة المصاهرة { وَ } أيضاً حرمت عليكم { رَبَائِبُكُمُ ٱلَّٰتِي فِي حُجُورِكُمْ } حال كون تلك الربائب { مِّن نِّسَآئِكُمُ ٱلَّٰتِي دَخَلْتُمْ بِهِنَّ فَإِن لَّمْ تَكُونُواْ دَخَلْتُمْ بِهِنَّ فَلاَ جُنَاحَ } أي: لا ضيق { عَلَيْكُمْ } في تزويجهن { وَ } كذا حرمت عليكم في دينكم { حَلَٰئِلُ أَبْنَائِكُمُ ٱلَّذِينَ } حصلوا { مِنْ أَصْلَٰبِكُمْ وَ } كذا حرمت عليكم { أَن تَجْمَعُواْ بَيْنَ ٱلأُخْتَيْنِ } في زمانٍ واحد { إِلاَّ مَا قَدْ سَلَفَ } أمثال هذا منكم قبل إيمانكم فإنكم لا تؤخذون عليه { إِنَّ ٱللَّهَ } المصلح لأحوالكم { كَانَ غَفُوراً } لذنوبكم بعد إنابتك واستغفاركم { رَّحِيماً } [النساء: 23] لكم يقبل توبتكم وإن عظمت زلتكم.\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ حُرِّمَتْ عَلَيْكُمْ أُمَّهَاتُكُمْ وَبَنَاتُكُمْ وَأَخَوَاتُكُمْ وَعَمَّاتُكُمْ وَخَالاَتُكُمْ وَبَنَاتُ الأَخِ وَبَنَاتُ الأُخْتِ وَأُمَّهَاتُكُمُ اللاَّتِي أَرْضَعْنَكُمْ وَأَخَوَاتُكُم مِّنَ الرَّضَاعَةِ وَأُمَّهَاتُ نِسَآئِكُمْ وَرَبَائِبُكُمُ اللاَّتِي فِي حُجُورِكُمْ مِّن نِّسَآئِكُمُ اللاَّتِي دَخَلْتُمْ بِهِنَّ فَإِن لَّمْ تَكُونُواْ دَخَلْتُمْ بِهِنَّ فَلاَ جُنَاحَ عَلَيْكُمْ وَحَلاَئِلُ أَبْنَائِكُمُ الَّذِينَ مِنْ أَصْلاَبِكُمْ وَأَن تَجْمَعُواْ بَيْنَ الأُخْتَيْنِ إَلاَّ مَا قَدْ سَلَفَ إِنَّ اللَّهَ كَانَ غَفُوراً رَّحِيماً والْمُحْصَنَاتُ مِنَ النِّسَآءِ إِلاَّ مَا مَلَكْتَ أَيْمَانُكُمْ كِتَابَ اللَّهِ عَلَيْكُمْ\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:61",
      "similarity": 0.4814094899954369
    },
    {
      "verse": "33:50",
      "similarity": 0.45746482192368176
    },
    {
      "verse": "39:49",
      "similarity": 0.24366647308469744
    },
    {
      "verse": "28:7",
      "similarity": 0.24128299193565148
    },
    {
      "verse": "28:12",
      "similarity": 0.21851155713462536
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004023.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004023.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}