{
  "chapter": "النساء",
  "text": "والمحصنت من النساء الا ما ملكت ايمنكم كتب الله عليكم واحل لكم ما وراء ذلكم ان تبتغوا۟ بامولكم محصنين غير مسفحين فما استمتعتم به منهن فـاتوهن اجورهن فريضة ولا جناح عليكم فيما ترضيتم به منۢ بعد الفريضة ان الله كان عليما حكيما",
  "translations": [
    {
      "translation": "And also married women, except for those you have taken in war as slaves. This is what Allah has prescribed for you. Apart from that He has made all other women halal for you provided you seek them with your wealth in marriage and not in fornication. When you consummate your marriage with them give them their prescribed dowry. There is nothing wrong in any further agreement you might come to after the dowry has been given. Allah is All-Knowing, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also forbidden are married women unless they are captives (of war). Such is the decree of God. Lawful for you are women besides these if you seek them with your wealth for wedlock and not for debauchery. Then give those of these women you have enjoyed, the agreed dower. It will not be sinful if you agree to something (else) by mutual consent after having settled the dowry. God is certainly all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And also forbidden to you are all married women (muhsanat) except those women whom your right hands have come to possess (as a result of war). This is Allah's decree and it is binding upon you. But it is lawful for you to seek out all women except these, offering them your wealth and the protection of wedlock rather than using them for the unfettered satisfaction of lust. And in exchange of what you enjoy by marrying them pay their bridal-due as an obligation. But there is no blame on you if you mutually agree to alter the settlement after it has been made. Surely Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are forbidden to marry married women except your slave-girls. This is the decree of God. Besides these, it is lawful for you to marry other women if you pay their dower, maintain chastity and do not commit indecency. If you marry them for the appointed time you must pay their dowries. There is no harm if you reach an understanding among yourselves about the dowry, God is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all married women are forbidden for you except the wives of disbelievers who come into your possession as bondwomen; this is Allah’s decree for you; and other than these, all women are lawful for you so that you seek them in exchange of your wealth in proper wedlock, not adultery; therefore give the women you wish to marry, their appointed bridal money; and after the appointment (of bridal money) there is no sin on you if you come to a mutual agreement; indeed Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also (forbidden are) women already married, except those (slaves) whom your right hands possess. Thus has Allah ordained for you. All others are lawful, provided you seek them (with a dowry) from your property, desiring chastity, not fornication. So with those among them whom you have enjoyed, give them their required due, but if you agree mutually (to give more) after the requirement (has been determined), there is no sin on you. Surely, Allah is Ever All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all married women except those whom your right hands possess (this is) Allah's ordinance to you, and lawful for you are (all women) besides those, provided that you seek (them) with your property, taking (them) in marriage not committing fornication. Then as to those whom you profit by, give them their dowries as appointed; and there is no blame on you about what you mutually agree after what is appointed; surely Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and wedded women, save what your right hands own. So God prescribes for you. Lawful for you, beyond all that, is that you may seek, using your wealth, in wedlock and not in licence. Such wives as you enjoy thereby, give them their wages apportionate; it is no fault in you in your agreeing together, after the due apportionate. God is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all married women (are forbidden unto you) save those (captives) whom your right hands possess. It is a decree of Allah for you. Lawful unto you are all beyond those mentioned, so that ye seek them with your wealth in honest wedlock, not debauchery. And those of whom ye seek content (by marrying them), give unto them their portions as a duty. And there is no sin for you in what ye do by mutual agreement after the duty (hath been done). Lo! Allah is ever Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also forbidden are married women, except those who have passed into your hands as prisoners of war. This is a commandment of God to you. All women other than these are lawful to you, provided you seek them with your wealth in honest wedlock, not in fornication. When you consummate your marriage with them, give the dowers due to them. And there is no sin for you in what you do by mutual agreement after the fixing of the dower. God is all knowing and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And also forbidden are the wedded among women, save those whom your right hands own Allah's rescript for you. And allowed unto you is whatsoever is beyond that, so that ye may seek them with your substances as properly wedded men, not as fornicators. Then whomsoever of them ye have enjoyed, give them their dowers stipulated. And there will be no blame on you in regard to aught on which ye mutually agree after the stipulation; verily Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and married women, excepting your slave-women. This is Allah’s ordinance for you. As to others than these, it is lawful for you to seek [temporary union with them] with your wealth, in wedlock, not in license. For the enjoyment you have had from them thereby, give them their dowries, by way of settlement, and there is no sin upon you in what you may agree upon after the settlement. Indeed Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also (prohibited are) women already married, except those whom your right hands possess: Thus hath Allah ordained (Prohibitions) against you: Except for these, all others are lawful, provided ye seek (them in marriage) with gifts from your property,- desiring chastity, not lust, seeing that ye derive benefit from them, give them their dowers (at least) as prescribed; but if, after a dower is prescribed, agree Mutually (to vary it), there is no blame on you, and Allah is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also (forbidden are) women already married, except those (captives and slaves) whom your right hands possess. Thus has Allah ordained for you. All others are lawful, provided you seek (them in marriage) with Mahr (bridal money given by the husband to his wife at the time of marriage) from your property, desiring chastity, not committing illegal sexual intercourse, so with those of whom you have enjoyed sexual relations, give them their Mahr as prescribed; but if after a Mahr is prescribed, you agree mutually (to give more), there is no sin on you. Surely, Allah is Ever All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (forbidden to you) are married women, except those whom your right hand owns. Such Allah has written for you. Lawful to you beyond all that, is that you can seek using your wealth in marriage and not fornication. So whatever you have enjoyed from them give them their obligated wage. And there is no fault in you in what ever you mutually agree after the obligation. Allah is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all married women, except those you rightfully possess. This is God’s decree, binding upon you. Permitted for you are those that lie outside these limits, provided you seek them in legal marriage, with gifts from your property, seeking wedlock, not prostitution. If you wish to enjoy them, then give them their dowry—a legal obligation. You commit no error by agreeing to any change to the dowry. God is All-Knowing, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [also prohibited to you are all] married women except those your right hands possess. [This is] the decree of Allah upon you. And lawful to you are [all others] beyond these, [provided] that you seek them [in marriage] with [gifts from] your property, desiring chastity, not unlawful sexual intercourse. So for whatever you enjoy [of marriage] from them, give them their due compensation as an obligation. And there is no blame upon you for what you mutually agree to beyond the obligation. Indeed, Allah is ever Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:24] And, forbidden to you are, wedded women, those with spouses, that you should marry them before they have left their spouses, be they Muslim free women or not; save what your right hands own, of captured [slave] girls, whom you may have sexual intercourse with, even if they should have spouses among the enemy camp, but only after they have been absolved of the possibility of pregnancy [after the completion of one menstrual cycle]; this is what God has prescribed for you (kitāba is in the accusative because it is the verbal noun). Lawful for you (read passive wa-uhilla, or active wa-ahalla), beyond all that, that is, except what He has forbidden you of women, is that you seek, women, using your wealth, by way of a dowry or a   price, in wedlock and not, fornicating, in illicitly. Such wives as you enjoy thereby, and have had sexual intercourse with, give them their wages, the dowries that you have assigned them, as an obligation; you are not at fault in agreeing together, you and they, after the obligation, is waived, decreased or increased. God is ever Knowing, of His creatures, Wise, in what He has ordained for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ والمحصنات مِنَ النسآء إِلاَّ مَا مَلَكْتَ أيمانكم كتاب الله عَلَيْكُمْ } .عطف على { وأن تجمعوا } \\[ النساء : 23 \\] والتقدير : وحُرّمت عليكم المحصنات من النساء إلخ . . . فهذا الصنف من المحرّمات لعارض نظيرَ الجمع بين الأختين .والمحصنات بفتح الصاد من أحصنها الرجل إذا حفظها واستقّل بها عن غيره ، ويقال : امرأة محصنة بكسر الصاد أحصنت نفسها عن غير زوجها ، ولم يقرأ قوله : { والمحصنات } في هذه الآية إلاَّ بالفتح .ويقال أحصَنَ الرجُلُ فهو محصِن بكسر الصاد لا غير ، ولا يقال محصَن : ولذلك لم يقرأ أحد : محصَنين غير مسافحين بفتح الصاد ، وقريء قوله : { ومحصنات } بالفتح والكسر وقوله : { فإذا أحصن } \\[ النساء : 25 \\] بضم الهمزة وكسر الصاد ، وبفتح الهمزة وفتح الصاد . والمراد هنا المعنى الأول ، أي وحرّمت عليكم ذوات الأزواج ما دُمن في عصمة أزواجهنّ ، فالمقصود تحريم اشتراك رجلين فأكثر في عصمة امرأة ، وذلك إبطال لنوع من النكاح كان في الجاهلية يسمّى الضِّمَاد ، ولنوع آخر ورد ذكره في حديث عائشة : أن يشترك الرجال في المرأة وهم دون العشرة ، فإذا حملت ووضعت حملها أرسلت إليهم فلا يستطيع أحد منهم أن يمتنع ، فتقول لهم : قد عرفتم الذي كان من أمركم وقد ولدت فهو ابنك يا فلان ، تسمّي من أحبّت باسمه فيلحق به . ونوع آخر يسمّى نكاح الاستبضاع؛ وهو أن يقول الزوج لامرأته إذا طَهرت من حيضها : أرسلي إلى فلان ، فاستبضعي منه ، ويعتزلها زوجها ولا يمسّها حتّى يتبيّن حملها من ذلك الرجل الذي تستبضع منه ، فإذا تبيّن حملها أصابها زوجها . قالت عائشة : وإنما يفعل هذا رغبة في نجابة الولد ، وأحسب أنّ هذا كان يقع بتراض بين الرجلين ، والمقصد لا ينحصر في نجابة الولد ، فقد يكون لبذل مال أو صحبة . فدَلّت الآية على تحريم كلّ عقد على نكاح ذات الزوج ، أي تحريم أن يكون للمرأة أكثر من زوج واحد . وأفادت الآية تعميم حرمتهنّ ولو كان أزواجهنّ مشركين ، ولذلك لزم الاستثناء بقوله : { إلا ما ملكت أيمانكم } أي إلاّ اللائي سبَيتُموهنّ في الحرب ، لأنّ اليمين في كلام العرب كناية عن اليد حين تمسك السيف .وقد جعل الله السبي هادما للنكاح تقريراً لمعتاد الأمم في الحروب ، وتخويفاً أن لا يناصبوا الإسلام لأنّهم لو رفع عنهم السبي لتكالبوا على قتال المسلمين ، إذ لا شيء يحذره العربي من الحرب أشدّ من سبي نسوته ، ثم من أسره ، كما قال النابغة :حِذاراً على أن لا تُنال مقادتي ... ولاَ نسوتي حتّى يمُتْن حَرائراًواتّفق المسلمون على أنّ سبي المرأة دون زوجها يهدم النكاح ، ويُحلّها لمن وقعت في قسمته عند قسمة المغانم . واختلفوا في التي تسبَى مع زوجها : فالجمهور على أنّ سبيها يهدم نكاحها ، وهذا إغضاء من الحكمة التي شرع لأجلها إبقاء حكم الاسترقاق بالأسر .وأومأت إليها الصلة بقوله : { ملكت أيمانكم } وإلاّ لقال : إلاّ ما تركت أزواجهنّ .ومن العلماء من قال : إنّ دخول الأمة ذاتتِ الزوج في ملك جديد غير ملك الذي زوَّجها من ذلك الزوج يسوّغ لمالكها الجديد إبطال عقد الزوجية بينها وبين زوجها ، كالتي تباع أو توهب أو تورث ، فانتقال الملك عندهم طلاق . وهذا قول ابن مسعود ، وأبَي بن كعب ، وجابر بن عبد الله ، وابن عباس ، وسعيد ، والحسن البصري ، وهو شذوذ؛ فإنّ مالكها الثاني إنّما اشتراها عالماً بأنّها ذات زوج ، وكأنَّ الحامل لهم على ذلك تصحيح معنى الاستثناء ، وإبقاء صيغة المضيّ على ظاهرها في قوله : { ملكت } أي ما كن مملوكات لهم من قبل . والجواب عن ذلك أن المراد بقوله : { ملكت } ما تجدّد ملكها بعد أن كانت حرّة ذات زوج . فالفعل مستعمل في معنى التجدّد .وقد نقل عن ابن عباس أنّه تحيّر في تفسير هذه الآية ، وقال : «لو أعلم أحداً يعلم تفسيرها لضربت إليه أكباد الإبل» . ولعلّه يعني من يعلم تفسيرها عن النبي صلى الله عليه وسلم وقد كان بعض المسلمين في الزمن الأول يتوهّم أنّ أمة الرجل إذا زوَّجها من زوج لا يحرم على السيّد قِربانها ، مع كونها ذات زوج . وقد رأيت منقولاً عن مالك : أنّ رجلا من ثقيف كان فعل ذلك في زمان عُمر ، وأنّ عمر سأله عن أمته التي زوجّها وهل يطَؤها ، فأنكر ، فقال له : لو اعترفتَ لجعلتُكَ نَكَالاً .وقوله : { كتاب الله عليكم } تذييل ، وهو تحريض على وجوب الوقوف عند كتاب الله ، ف { عليكم } نائب مناب ( الزَمُوا ) ، وهو مُصيَّر بمعنى اسم الفعل ، وذلك كثير في الظروف والمجرورات المنزَّلة منزلة أسماء الأفعال بالقرينة ، كقولهم : إليك ، ودُونك ، وعَليك . و { كتاب الله } مفعوله مُقدّم عليه عند الكوفيين ، أو يجعل منصوباً ب ( عليكم ) محذوفاً دلّ عليه المذكور بعده ، على أنّه تأكيد له ، تخريجاً على تأويل سيبويه في قول الراجز :يأيُّها المائِحُ دلوي دُونك ... إنّي رأيت الناس يحمدونكويجوز أن يكون { كتاب } مصدراً نائباً مناب فعلِه ، أي كَتَب الله ذلك كتاباً ، و { عليكم } متعلّقاً به .عطف على قوله : { حرمت عليكم أمهاتكم } \\[ النساء : 23 \\] وما بعدَه ، وبذلك تلتئم الجمل الثلاث في الخبرية المراد بها الإنشاء ، وفي الفعلية والماضوية .وقرأ الجمهور : { وأحل لكم } بالبناء للفاعل ، والضمير المستتر عائد إلى اسم الجلالة من قوله : { كتاب الله عليكم } .وأسند التحليل إلى الله تعالى إظهاراً للمنّة ، ولِذلك خالف طريقة إسناد التحريم إلى المجهول في قوله : { حرمت عليكم أمهاتكم } لأنّ التحريم مشقّة فليس المقام فيه مقام منّة .وقرأ حمزة ، والكسائي ، وحفص عن عاصم ، وأبو جعفر : { وأحل } بضم الهمزة وكسر الحاء على البناء للنائب على طريقة { حرمت عليكم أمهاتكم } .والوراء هنا بمعنى غير ودُون ، كقول النابغة :وليسَ وراءَ اللَّه للمرءِ مذهب ... وهو مجاز؛ لأنّ الوراء هو الجهة التي هي جهة ظهر ما يضاف إليه . والكلام تمثيل لحال المخاطبين بحال السائر يَترك ما وراءه ويتجاوزه .والمعنى : أحلّ لكم ما عَدا أولئكم المحرّمات ، وهذا أنزِل قبل تحريم ما حرّمته السُّنة نحو ( لا تنكح المرأة على عمتها ولا على خالتها ) ، ونحو ( يحرم من الرضاع ما يحرم من النسب ) .وقوله : { أن تبتغوا بأموالكم } يجوز أن يكون بدل اشتمال من ( ما ) باعتبار كون الموصول مفعولا ل ( أحَلَّ ) ، والتقدير : أن تبتغوهنّ بأموالكم فإنّ النساء المبَاحات لا تحلّ إلاّ بعد العقد وإعطاء المهور ، فالعقد هو مدلول ( تبتغوا ) ، وبذل المهر هو مدلول ( بأموالكم ) ، ورابط الجملة محذوف : تقديره أن تبتغوه ، والاشتمال هنا كالاشتمال في قول النابغة :مخافة عمرو أن تكون جياده ... يقدن إلينا بين حاف وناعلويجوز أن يجعل { أن تبتغوا } معمولا للام التعليل محذوفةٍ ، أي أحَلَّهُن لتبتغوهنّ بأموالكم ، والمقصود هو عين ما قرّر في الوجه الأول .و { محصنِين } حال من فاعل ( تبتغوا ) أي محصنين أنفسكم من الزنى ، والمراد متزوّجين على الوجه المعروف . { غير مسافحين } حال ثانية ، والمسافح الزاني ، لأنّ الزنى يسمّى السفاح ، مشتقّا من السفح ، وهو أن يهراق الماء دون حَبْس ، يقال : سَفَح الماءُ . وذلك أنّ الرجل والمرأة يبذل كلّ منهما للآخر ما رامه منه دون قيد ولا رضَى وليّ ، فكأنّهم اشتقّوه من معنى البذل بلا تقيّد بأمرٍ معروف؛ لأنّ المِعطاء يطلق عليه السَّفَّاح . وكان الرجل إذا أراد من المرأة الفاحشة يقول لها : سافحيني ، فرجع معنى السفاح إلى التباذل وإطلاق العنان ، وقيل : لأنّه بلا عقد ، فكأنّه سَفَح سفحاً ، أي صبّا لا يحجبه شيء ، وغير هذا في اشتقاقه لا يَصحّ ، لأنّه لا يختصّ بالزنى .تفريع على { أن تبتغوا بأموالكم } وهو تفريع لفظي لبيان حقّ المرأة في المهر وأنّه في مقابلة الاستمتاع تأكيداً لما سبقه من قوله تعالى : { وآتوا النساء صدقاتهن نحلة } \\[ النساء : 4 \\] سواء عند الجمهور الذين يجعلون الصداق ركنا للنكاح ، أو عند أبي حنيفة الذي يجعله مجرّد حقّ للزوجة أن تطالب به؛ ولذلك فالظاهر أن تجعل ( ما ) اسم شرط صادقاً على الاستمتاع ، لبيان أنّه لا يجوز إخلاء النكاح عن المهر ، لأنّه الفارق بينه وبين السفاح ، ولذلك قرن الخبر بالفاء في قوله : { فأتوهن أجزرهن فريضة } لأنّه اعتبر جواباً للشرط .والاستمتاع : الانتفاع ، والسين والتاء فيه للمبالغة ، وسمَّى الله النكاح استمتاعاً لأنّه منفعة دنيوية ، وجميع منافع الدنيا متاع ، قال تعالى : { وما الحياة الدنيا في الآخرة إلا متاع } \\[ الرعد : 26 \\] .والضمير المجرور بالباء عائد على ( مَا ) . و ( مِنْ ) تبعيضية ، أي : فإن استمتعتم بشيء منهن فآتوهنّ؛ فلا يجوز استمتاع بهنّ دون مهر .أو يكون ( مَا ) صادقة على النساء ، والمجرور بالباء عائداً إلى الاستمتاع المأخوذ من استمتعتم و ( من ) بيانية ، أي فأي امرأة استمتعتم بها فآتوها .ويجوز أن تجعل ( مَا ) موصولة ، ويكون دخول الفاء في خبرها لمعاملتها معاملة الشرط ، وجيء حينئذ ب ( ما ) ولم يعبر ب ( مَن ) لأنّ المراد جنس النساء لا القصد إلى امرأة واحدة ، على أنّ ( ما ) تجيء للعاقل كثيراً ولا عكس : و { فريضةً } حال من { أجورهن } أي مفروضة ، أي مقدرة بينكم .والمقصد من ذلك قطع الخصومات في أعظم معاملة يقصد منها الوثاق وحسن السمعة .وأمّا نكاح التفويض : وهو أن ينعقد النكاح مع السكوت عن المهر ، وهو جائز عند جميع الفقهاء؛ فجوازه مبني على أنّهم لا يفوّضون إلاّ وهم يعلمون معتاد أمثالهم ، ويكون ( فريضة ) بمعنى تقديراً ، ولذلك قال : { ولا جناح عليكم فيما تراضيتم به من بعد الفريضة } ، أي فيما زدتم لهنّ أو أسقطن لكم عن طيب نفس . فهذا معنى الآية بيّنا لا غبار عليه .وذهب جمع : منهم ابن عباس ، وأُبيّ بن كعب ، وابن جبير : أنّها نزلت في نكاح المتعة لما وقع فيها من قوله : { فما استمتعتم به منهن } . ونكاح المتعة : هو الذي تعاقد الزوجان على أن تكون العصمة بينهما مؤجّلة بزمان أو بحالة ، فإذا انقضى ذلك الأجل ارتفعت العصمة ، وهو نكاح قد أبيح في الإسلام لا محالة ، ووقع النهي عنه يوم خيبر ، أو يوم حنين على الأصحّ . والذين قالوا : حُرّم يوم خيبر قالوا : ثم أبيح في غزوة الفتح ، ثم نهي عنه في اليوم الثالث من يوم الفتح . وقيل : نهي عنه في حجّة الوداع ، قال أبو داود : وهو أصحّ . والذي استخلصناه أنّ الروايات فيها مضطربة اضطراباً كبيراً .وقد اختلف العلماء في الأخير من شأنه : فذهب الجمهور إلى أنّ الأمر استقرّ على تحريمه ، فمنهم من قال : نسخته آية المواريث لأنّ فيها { ولكم نصف ما ترك أزواجكم ولهن الربع مما تركتم } \\[ النساء : 12 \\] فجعل للأزواج حَظّا من الميراث ، وقد كانت المتعة لا ميراث فيها . وقيل : نسخها ما رواه مسلم عن سَبْرة الجهني ، أنه رأى رسول الله صلى الله عليه وسلم مسنداً ظهره إلى الكعبة ثالث يوم من الفتح يقول : \" أيها الناس إن كنت أذنت لكم في الاستمتاع من هذه النساء إلا أن الله حرم ذلك إلى يوم القيامة \" . وانفراد سبرة به في مِثل ذلك اليوم مغمز في روايته ، على أنّه ثبت أنّ الناس استمتعوا . وعن علي بن أبي طالب ، وعمران بن حصين ، وابن عباس ، وجماعة من التابعين والصحابة أنّهم قالوا بجوازه . قيل : مطْلقاً ، وهو قول الإمَامية ، وقيل : في حال الضرورة عند أصحاب ابن عباس من أهل مكة واليمن .وروي عن ابن عباس أنّه قال : لولا أنّ عُمر نهى عن المتعة ما زنى إلاَّ شَفى . وعن عمران بن حصين في «الصحيح» أنه قال : «نزلت آية المتعة في كتاب الله ولم ينزل بعدَها آية تنسخها ، وأمرنا بها رسول الله صلى الله عليه وسلم ثم قال رجلٌ برأيه ما شَاء» يعني عُمر بن الخطاب حين نهى عنها في زمن من خلافته بعد أن عملوا بها في معظم خلافته ، وكان ابن عباس يفتي بها ، فلمّا قال له سعيد بن جبير : أتدري ما صنعتَ بفتواك فقد سارت بها الركبان حتّى قال القائل :قد قلتُ للركب إذْ طال الثَّواءُ بنا ... يا صاح هل لك في فتوى ابن عبّاسفي بَضَّةِ رخصةِ الأطراف ناعمةٍ ... تَكُونُ مثواكَ حتّى مَرْجععِ الناسأمسك عن الفتوى وقال : إنّما أحللت مثل ما أحلّ الله الميتة والدم ، يريد عند الضرورة . واختلف العلماء في ثبات علي على إباحتها ، وفي رجوعه . والذي عليه علماؤنا أنّه رجع عن إباحتها . أمّا عمران بن حصين فثبت على الإباحة . وكذلك ابن عباس على «الصحيح» . وقال مالك : يُفسخ نكاح المتعة قبل البناء وبعد البناء ، وفسخه بغير طلاق ، وقيل : بطلاق ، ولا حدَّ فيه على الصحيح من المذهب ، وأرجح الأقوال أنّها رخصة للمسافر ونحوه من أحوال الضرورات ، ووجه مخالفتها للمقصد من النكاح ما فيها من التأجيل . وللنظر في ذلك مجال .والذي يُستخلص من مختلف الأخبار أنّ المتعة أذن فيها رسول الله صلى الله عليه وسلم مرتين ، ونهى عنها مرتين ، والذي يفهم من ذلك أن ليس ذلك بنسخ مكرّر ولكنّه إناطة إباحتها بحال الاضطرار ، فاشتبه على الرواة تحقيق عذر الرخصة بأنّه نسخ . وقد ثبت أنّ الناس استمتعوا في زمن أبي بكر ، وعمر ، ثم نهى عنها عمر في آخر خلافته . والذي استخلصناه في حكم نكاح المتعة أنّه جائز عند الضرورة الداعية إلى تأجيل مدّة العصمة ، مثل الغربة في سفر أو غزو إذا لم تكن مع الرجل زوجهُ . ويشترط فيه ما يشترط في النكاح من صداق وإشهاد ووليّ حيث يُشترط ، وأنّها تبين منه عند انتهاء الأجل ، وأنّها لا ميراث فيها بين الرجل والمرأة ، إذا مات أحدهما في مدة الاستمتاع ، وأنّ عدّتها حيضة واحدة ، وأنّ الأولاد لاَحقون بأبيهم المستمتِع . وشذّ النحّاس فزعم أنّه لا يلحق الولد بأبيه في نكاح المتعة . ونحن نرى أنّ هذه الآية بمعزل عن أن تكون نازلة في نكاح المتعة ، وليس سياقها سامحا بذلك ، ولكنّها صالحة لاندراج المتعة في عموم { ما استمتعتم } فيُرجع في مشروعية نكاح المتعة إلى ما سمعتَ آنفاً .\n\n",
      "translations": [
        {
          "translation": "(And all married women (are forbidden unto you save those (captives) whom your right hands possess) of captives, even if they have husbands in the Abode of War, after ascertaining that they are not pregnant, by waiting for the lapse of one period of menstruation. (It is a decree of Allah for you) that which I have mentioned to you is unlawful in Allah's Book. (Lawful unto you are all beyond those mentioned) as unlawful, (so that ye seek them) marry (with your wealth) up to four wives; it is also said that this means: so that you buy with your wealth captives; and it is also said that this means: so that you should seek with your money marrying women for an agreed period of time (zawaj al-mut'ah) but the lawfulness of this practice was later abrogated, (in honest wedlock) He says: be with them as legitimate husbands, (not debauchery) not indulging in adultery without having a proper marriage. (And those of whom) after marriage (ye seek content) from whom you derive benefit, (give unto them their portions) give to them their full dowry (as a duty) as an obligation upon you from Allah to give the dowry in full. (And there is no sin for you) there is no harm for you (in what ye do by mutual agreement) in increasing or decreasing the amount of the dowry by mutual agreement (after the duty hath been done) after the first obligation to which you have aspired. (Lo! Allah is ever Knower) in relation to making lawful to you marriage for an agreed, limited period of time, (Wise) in later making this practice unlawful; it is also said that this means: Allah is ever Knower of your compulsion for marriage for an agreed, limited period of time, Wise in making such marriage unlawful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مُّحْصِنِينَ غَيْرَ مُسَٰفِحِينَ } فالمُحْصَنُ: العَفِيفَ\n والمُسَافِحُ: الزَّانِيُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {those who are muHSinin are those who are not muSafiHin} - the muHSan is the 'afif.\n The adulterer is the one who commits zina.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "{ وَ } حرمت أيضاً عليكم { ٱلْمُحْصَنَٰتُ مِنَ ٱلنِّسَآءِ } الأجنبيات اللاتي أحصنهن أزواجهن { إِلاَّ مَا مَلَكْتَ أَيْمَٰنُكُمْ } من المسبيات اللاتي لهن أزواج كفار؛ إذ بالسبي يرتفع النكاح، فصار تلك المحرمات { كِتَٰبَ ٱللَّهِ عَلَيْكُمْ } أي: من الأمور التي حرمه الله عليكم حتماً مقتضياً { وَأُحِلَّ لَكُمْ مَّا وَرَاءَ ذَٰلِكُمْ } أي: ما سوى المحرمات المذكورة، وإنما أحل لكم ما أحل { أَن تَبْتَغُواْ } أي: لأن تطلبوا { بِأَمْوَٰلِكُمْ } أزواجاً حلائل مصلحات لدينكم، صالحات لإبقاء نوعكم حال كونكم { مُّحْصِنِينَ } بهن دينكم { غَيْرَ مُسَٰفِحِينَ } أي: مجتنبين عن الزنا المؤدي إلى إبطال حكمة الله وإفساد مصلحته { فَمَا ٱسْتَمْتَعْتُمْ } أي: فمن انتفعتم واجتمعتم { بِهِ } بسبب المهر حين العقد { مِنْهُنَّ } أي: من النساء اللاتي أحلهن الله لكم أيها المؤمنون { فَآتُوهُنَّ } أي: فعليكم أن تدفعوا إليهن { أُجُورَهُنَّ } مهورهن معتقدين أداءها { فَرِيضَةً } أي: مما فرض الله لكم في دينكم واجبة الأداء شرعاً وعقلاً؛ إذ الإفضاء إنما هو بسببه كما هر، هذا إذا كانت المرأة طالبة كمال مهرها.\n\n{ وَلاَ جُنَاحَ } أي: لا مواخذة { عَلَيْكُمْ فِيمَا تَرَٰضَيْتُمْ بِهِ } من الأخذ والترك والزيادة والنقصان بعدما حصل التراضي من الجانبين { مِن بَعْدِ ٱلْفَرِيضَةِ } المقدرة الواجبة الأداء، هذا الحكم مما يقبل التغيير بعد المراضاة { إِنَّ ٱللَّهَ } المصلح لأحوال عباده { كَانَ عَلِيماً } في سابق علمه بصلحهم ومراضاتهم { حَكِيماً } [النساء: 24] في إصدارها عنهم إصلاحاً لمعاشهم.\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n }  قلت: { كتاب الله عليكم }: مصدر مؤكد\n أي: كتب الله ذلك كتاباً\n أو على الإغراء\n يقول الحقّ جلّ جلاله: { حرمت عليكم } من النساء أصنافٌ: منها بالنسب ومنها بالرضاع ومنها بالمصاهرة: فأما التي تحرم بالنسب فهي { أمهاتكم } \n وهي الأم\n والجدة من الأم ومن الأب ما عَلَوْن\n { وبناتكم } وهي البنت وبنت الابن\n وبنت البنت ما سفلن\n { وأخواتكم } وهي الأخت الشقيقة والتي للأب والأخت للأم\n { وعماتكم } وهي أخت الوالد وأخت الجد ما علت\n شقيقة أو لأب أو لأم\n { خالاتكم } وهي أخت الأم وأخت الجدة ما علت\n شقيقة أو لأب أو لأم\n { وبنات الأخ } الشقيق\n أو للأب\n وما تناسل منهم\n { وبنات الأخت } \n فيدخل كل ما تناسل من الأخت الشقيقه أو للأب أو للأم\n والضابط في ذلك: أنه يحرم على الرجل أصوله وإن علت\n وفصوله وإن سفلت\n وفصول أبويه ما سفلت\n وأول فصل من كل أصل متقدم على أبويه\n ثم ذكر ما يحرم بالرضاع\n فقال: { وأمهاتكم اللاتي أرضعنكم وأخواتكم من الرضاعة } ذلك تعالى صنفين\n وحرمت السُّنَّةُ كل ما يحرم من النسب\n قال صلى الله عليه وسلم\n \" يَحْرُمُ مِنَ الرَّضَاعِ مَا يَحْرُمُ مِنَ النَّسَبِ \" \nفيدخل الأصناف السبعة\n وهي الأم من الرضاع والبنت والأخت والعمة والخالة وبن الأخ وبنت الأخت\n ثم ذكر ما يحرم بالمصاهرة\n فقال: { وأمهات نسائكم } \n وتقدمت زوجة الأب\n وسيأتي حليلة الابن\n { وربائبكم اللاتي في حجوركم من نسائكم } لا مفهوم لهذا القيد\n لكنه جرى مجرى الغالب\n فهي محرمة\n كانت في حجره أم لا\n على قول الجمهور\n ورُوي عن علي رضي الله عنه أنه أجاز نكاحها إن لم تكن في حجره\n وأما قوله: { اللاتي دخلتم بهن } فهو معتبر إجماعًا\n فلو عقد على المرأة ولم يدخل بها\n فله طلاقها ويأخذ ابنتها\n ولذلك قال: { فإن لم تكونوا دخلتم بهن فلا جناح عليكم } أن تنكحوهن\n { وحلائل أبنائكم } وهي التي عقد عليها الابن فحلت له\n فتحرم على الأب بمجرد العقد\n والحاصل: أن زوجة الأب وزوجة الابن وأم الزوجة يحرمن بالعقد\n وأما بنت المرأة فلا تحرم إلا بالدخول بأمها\n فالعقد على البنات يُحرم الأمهات\n والدخول بالأمهات يُحرم البنات\n وقوله تعالى: { الذين من أصلابكم } احترز به من زوجة المتبنِّي فلا تحرم حليلته\n كقضية زيد مع رسول الله صلى الله عليه وسلم\n\n{ وأن تجمعوا بين الأختين } \n شقيقتين أو للأب أو للأم\n وهذا في النكاح\n وأما في الملك دون الوطء فلا بأس\n أما في الوطء فمنعه مالك والشافعي وأبو حنيفة\n وأجازه الظاهرية\n { إلا ما قد سلف } أي: في الجاهلية\n فقد عفا عنكم\n { إن الله كان غفورًا رحيمًا } \n قال ابن عباس:  كانت العرب تُحرم كل ما حرمت الشريعة إلا امرأة الأب والجمع بين الأختين\n فلذلك ذكر الحق تعالى: { إلا ما قد سلف } فيهما\n { و } حَرم الله ـ تعالى ـ { المحصنات من النساء } وهُنَّ اللاتي في عصمة أزواجهن\n فلا يحل نكاحهن ما دُمْنَ في عصمة الزوج\n { إلا ما ملكت أيمانكم } من الغنيمة\n فإذا سُبيت الكافرة\n ولها زوج\n جاز لمن ملكها أن يطأها بالملك بعد الاستبراء\n قال في المختصر: وهدم السبيْ النكاحَ\n إلا أن تُسبى وتُسلْم في عدتها فهو أحق بها\n وقد بعث رسول الله صلى الله عليه وسلم جيشًا إلى أَوْطَاس\n فأصابوا سبيًا من العدو\n ولهن أزواج من المشركين فتأثموا من غشيانهن\n فنزلت الآية مُبيحة لذلك\n { كتاب الله عليكم } أي: كتب الله ذلك عليكم كتاباً\n وهو ما حرّم في الآية من النساء\n الإشارة: اعلم أن الإنسان لا يصير كاملاً عارفًا حتى يولد ثلاث مرات بعد الأم الحسية\n أولها: خروجه من بطن حب الدنيا الدنية\n ثم من الغفلة والشهوات الجسمانية\n ثم من ضيق الأكوان الظلمانية\n إلى فضاء المشاهدة والمعاينة\n وقال بعض الأولياء:  ليس منا من لم يولد مرتين: فاعتبر الأولى والثالثة\n فإذا خرج الإنسان من هذه البطون حرَّم الله عليه نكاحها والرجوع إليها\n وكذا يحرم عليه الرجوع إلى ما تولد منه من الزلات\n والأحوال الظلمانية\n وما كان ألفه وتواخى معه من البطالات والمألوفات\n وما وجد عليه أسلافه من التعصبات والحميات والرئاسات\n ولا فرق بين ما واجهه من ذلك من قبل الآباء والأمهات\n وكذلك ما ارتضع من ثدي الشهوات من لِبان الغفلة\n وتراكم الأَكِنَّات\n فليبادر إلى تحريمها\n وفطام نفسه عنها\n قبل تحكمها\n كما قال البوصيري رضي الله عنه:\nوكذا يحرم عليه\n صحبة من ارتضع معه في هذا الثدي قبل الفطام من الأخوة والأخوات\n وكذا أمهات الخطايا\n وهي حب الدنيا والرياسة والجاه\n وكذلك حرمت عليكم ربائب العلائق والعوائق\n لتدخلوا بلاد الحقائق\n فإن لم تكونوا من أهل الحقائق فلا جناح عليكم إذ كنتم من عوام الخلائق\n وكذلك يحرم عليكم ما حل لأبناء جنسكم من تعاطي الأسباب والاشتغال بها عن خدمة رب الأرباب\n وأن تجمعوا بين حب الدنيا ومحبة المولى\n قال الشافعي رضي الله عنه: من ادَّعى أنه جمَعَ بين حب الدنيا وحب خالقها\n فقد كذب\n إلا ما قد سلف في أيام البطالة\n وكذا يحرم على المريد المتجرد المستشرف على المعاني تعاطى العلوم الظاهرة\n التي دخل بها أهل الظاهر وأفتضوا بكارتها ـ إلا ما ملكه قبل التجريد\n فلا يضره إن غاب عنها في أسرار التوحيد\n والله تعالى أعلم بأسرار غيبه\n\nثم ذكر الحق تعالى ما يحلّ من النساء\n فقال: {\n\n\nوَأُحِلَّ لَكُمْ مَّا وَرَاءَ ذَلِكُمْ أَن تَبْتَغُواْ بِأَمْوَالِكُمْ مُّحْصِنِينَ غَيْرَ مُسَافِحِينَ فَمَا اسْتَمْتَعْتُمْ بِهِ مِنْهُنَّ فَآتُوهُنَّ أُجُورَهُنَّ فَرِيضَةً وَلاَ جُنَاحَ عَلَيْكُمْ فِيمَا تَرَاضَيْتُمْ بِهِ مِن بَعْدِ الْفَرِيضَةِ إِنَّ اللَّهَ كَانَ عَلِيماً حَكِيماً }  قلت: { وأُحِلَّ } عطف على الفعل العامل في \" كتاب الله عليكم \" أي: كتب الله عليكم تحريم ما ذكر\n وأحل ما سوى ذلك\n ومن قرأ بالبناء للمفعول فعطف على \" حُرمت \"\n و { أن تبتغوا } مفعول لأجله\n أي: إرادة أن تبتغوا\n أو بدل من { وراء ذلكم } \n و { محصنين } حال من الواو\n والسفاح: الزنا\n من السفح وهو الصب\n لأنه يصب المنيّ في غير محله\n يقول الحقّ جلّ جلاله: { وأُحل لكم } أن تتزوجوا من النساء ما سوى ذلكم المحرمات\n وما سوى ما حرمته السنة بالرضاع\n كما تقدم\n والجمع بين المرأة وعمتها\n وبين المرأة وخالتها\n فقد حرَمتْه السُنة\n وإنما أحل لكم نكاح النساء إرادة أن تطلبوا بأموالكم الحلال\n فتصرفوها في مهور النساء\n\n\n حال كونكم { مُحصنين } أي: أعفة متحصنين بها من الحرام\n { غير مسافحين } أي: غير زناة\n تصبون الماء في غير موضعه\n { فما استمتعتم به منهن } أي: من تمتعتم به من المنكوحات { فآتوهن أجورهن } أي: مهورهن\n لأن المهر في مقابلة الاستمتاع { فريضة } \n أي: مفروضة مقدرة\n لا جَهْلَ فيها ولا إبهام\n { ولا جناح عليكم فيما تراضيتم به } من زيادة على المهر المشروط\n أو نقص منه\n { من بعد الفريضة } \n التي وقع العقد عليها\n { إن الله كان عليمًا } بمصالح خلقه\n { حكيمًا } فيما شرع من الأحكام\n وقيل قوله: { فما استمتعتم به\n\n\n } إلى آخره\n نزل في نكاح المتعة\n التي كانت ثلاثة أيام في فتح مكة\n ثم نُسِخَ بما رُوي عنه ـ عليه الصلاة والسلام ـ أنه أباحه\n ثم أصبح يقول:\n \" أيُّهَا النَّاسِ\n إِنِّي كُنْتُ أمرتكم بالاسِتْمْتَاعِ مِنَ هذه النَّساء\n ألا إنَّ اللهَ حَرَمَ ذَلِكَ إلىَ يَوْمِ القِيَامةِ \" \nوهو النكاح المؤقت بوقت معلوم\n سُمي به لأن الغرض منه مجرد الاستمتاع\n وتمتعها بما يُعطى لها\n وجوَّزه ابن عباس رضي الله عنه ثم رجع عنه\n والله تعالى أعلم\n الإشارة: يقول الحق جل جلاله من طريق الإشارة: إذا خرجتم من بطن الشهوات\n ورفضتم ما كنتم عليه من العوائد والمألوفات\n وزهدتم فيما يشغل فكرتكم من العلوم الرسميات\n حل لكم ما وراء ذلكم من العلوم اللدنية والأسرار الربانية\n التي هي وراء طور العقول ولا تدرك بالطروس ولا بالنقول\n وإليها أشار ابن الفارض رضي الله عنه حيث قال:\nأردنا منكم أن تبتغوا ببذل أموالكم ومُهجكم تلك العلوم المقدسة\n والأسرار المطهرة\n متحصنين من دنس الحس والهوى\n غير مباشرين لنجاسة الدنيا\n ولا مصطحبين مع أهلها\n لتتمتعوا بشهود أسرارنا\n وأنوار قدسنا\n فما استمتعتم به من ذلك\n فصونوه من غير أهله\n ولا جناح عليكم فيما تراضيتم به من إعطائه لأهله\n من بعد حفظه عمن لا يستحقه\n والله تعالى أعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:5",
      "similarity": 0.45977256855878634
    },
    {
      "verse": "4:25",
      "similarity": 0.34403596712661433
    },
    {
      "verse": "6:145",
      "similarity": 0.3204474857106043
    },
    {
      "verse": "66:2",
      "similarity": 0.31332196258246425
    },
    {
      "verse": "2:236",
      "similarity": 0.2533684609363248
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004024.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004024.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}