{
  "chapter": "النساء",
  "text": "ومن لم يستطع منكم طولا ان ينكح المحصنت المؤمنت فمن ما ملكت ايمنكم من فتيتكم المؤمنت والله اعلم بايمنكم بعضكم منۢ بعض فانكحوهن باذن اهلهن وءاتوهن اجورهن بالمعروف محصنت غير مسفحت ولا متخذت اخدان فاذا احصن فان اتين بفحشة فعليهن نصف ما على المحصنت من العذاب ذلك لمن خشى العنت منكم وان تصبروا۟ خير لكم والله غفور رحيم",
  "translations": [
    {
      "translation": "If any of you do not have the means to marry free women who are muminun, you may marry slavegirls who are muminun. Allah knows best about your iman; you are all the same in that respect. Marry them with their owners' permission and give them their dowries correctly and courteously as married women, not in fornication or taking them as lovers. When they are married, if they commit fornication they should receive half the punishment of free women. This is for those of you who are afraid of committing fornication. But being patient is better for you. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If one of you cannot afford to marry a believing gentlewoman (let him marry) a maid who is a believer. God is aware of your faith: The one of you is of the other; so marry them with the consent of their people, and give them an appropriate dowry. They are women (seeking) wedlock, and not lechery, nor secretly looking for paramours. But if they are married and guilty of adultery, inflict on them half the punishment (enjoined) for gentlewomen. This is for those who are afraid of doing wrong. In case they can wait, it is better for them. God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those of you who cannot afford to marry free, believing women (muhsanat), then marry such believing women whom your right hands possess. Allah knows all about your faith. All of you belong to one another. Marry them, then, with the leave of their guardians, and give them their bridal-due in a fair manner that they may live in the protection of wedlock rather than be either mere objects of unfettered lust or given to secret love affairs. Then if they become guilty of immoral conduct after they have entered into wedlock, they shall be liable to half the penalty to which free women (muhsanat) are liable. This relaxation is for those of you who fear to fall into sin by remaining unmarried. But if you persevere, it is better for you. Allah is All-Forgiving, All-Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of you do not have the means to marry a chaste believing woman, marry your believing slave-girls. God knows best about your faith. You have the same faith. Marry them with the permission of their masters and if they are chaste and have avoided fornication and amorous activities, give them their just dowries. If after marriage they commit adultery, they should receive half of the punishment of a free woman who has committed the same crime. This is for those who fear falling into evil. It is better for you to have self-control. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever among you does not have in marriage free, believing women due to poverty, should marry from the believing bondwomen you own; and Allah knows well your faith; you are from one another; therefore marry them with the permission of their masters, and give them their bridal money according to custom, they becoming (faithful) wives, not committing mischief or secretly making friends; so when they are married and commit the shameful, for them is half the punishment prescribed for free women; this is for one among you who fears falling into adultery; and to practice patience is better for you; and Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever of you have not the means wherewith to wed free believing women, they may wed believing girls from among those whom your right hands possess, and Allah has full knowledge about your faith, you are one from another. Wed them with the permission of their own folk (guardians) and give them their due in a good manner; they should be chaste, not fornicators, nor promiscuous. And after they have been taken in wedlock, if they commit Fahishah, their punishment is half that for free (unmarried) women. This is for him among you who is afraid of being harmed in his religion or in his body; but it is better for you that you practice self-restraint, and Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever among you has not within his power ampleness of means to marry free believing women, then (he may marry) of those whom your right hands possess from among your believing maidens; and Allah knows best your faith: you are (sprung) the one from the other; so marry them with the permission of their masters, and give them their dowries justly, they being chaste, not fornicating, nor receiving paramours; and when they are taken in marriage, then if they are guilty of indecency, they shall suffer half the punishment which is (inflicted) upon free women. This is for him among you who fears falling into evil; and that you abstain is better for you, and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Any one of you who has not the affluence to be able to marry believing freewomen in wedlock, let him take believing handmaids that your right hands own; God knows very well your faith; the one of you is as the other. So marry them, with their people's leave, and give them their wages honourably as women in wedlock, not as in licence or taking lovers. But when they are in wedlock, if they commit indecency, they shall be liable to half the chastisement of freewomen. That provision is for those of you who fear fornication; yet it is better for you to be patient. God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoso is not able to afford to marry free, believing women, let them marry from the believing maids whom your right hands possess. Allah knoweth best (concerning) your faith. Ye (proceed) one from another; so wed them by permission of their folk, and give unto them their portions in kindness, they being honest, not debauched nor of loose conduct. And if when they are honourably married they commit lewdness they shall incur the half of the punishment (prescribed) for free women (in that case). This is for him among you who feareth to commit sin. But to have patience would be better for you. Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of you cannot afford to marry a free believing woman let him marry one of his believing maids whom he possesses. God best knows your faith. You are one of another. So marry them with their owner's permission, and give them their dower according to what is fair, neither committing fornication nor taking secret paramours. And if, after they are married, they commit adultery they shall have half the punishment prescribed for a free woman. This is for those of you who fear lest he should fall into sin. But that it is better for you to practise self restraint. God is most forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever of you has not ampleness of means that he may wed free believing women, let him wed such of the believing bondswomen as the right hands of you people own. And Allah noweth well your belief, ye are one from the other. O Ye may wed them then, with the leave of their owners, and give them their dowers reputably as properly wedded women, not as fornicateresses, nor as those taking to themselves secret paramours. And when they have been wedded, if they commit an indecency, on them the punishment shall be a moiety of that for free wedded women. This is for him among you, who dreameth perdition; and that ye should abstain is better for you, and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those of you who cannot afford to marry faithful free women, then [let them marry] from what you own, from among your faithful slave-women. Your faith is best known [only] to Allah; you are all [on a] similar [footing]. So marry them with their masters’ permission, and give them their dowries in an honourable manner—[such of them] as are chaste women, not licentious ones or those who take paramours. But should they commit an indecent act on marrying, there shall be for them [only] half the punishment for free women. This is for those of you who fear falling into fornication; but it is better that you be continent, and Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of you have not the means wherewith to wed free believing women, they may wed believing girls from among those whom your right hands possess: And Allah hath full knowledge about your faith. Ye are one from another: Wed them with the leave of their owners, and give them their dowers, according to what is reasonable: They should be chaste, not lustful, nor taking paramours: when they are taken in wedlock, if they fall into shame, their punishment is half that for free women. This (permission) is for those among you who fear sin; but it is better for you that ye practise self-restraint. And Allah is Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever of you have not the means wherewith to wed free, believing women, they may wed believing girls from among those (captives and slaves) whom your right hands possess, and Allah has full knowledge about your Faith, you are one from another. Wed them with the permission of their own folk (guardians, Auliya' or masters) and give them their Mahr according to what is reasonable; they (the above said captive and slave-girls) should be chaste, not adulterous, nor taking boy-friends. And after they have been taken in wedlock, if they commit illegal sexual intercourse, their punishment is half that for free (unmarried) women. This is for him among you who is afraid of being harmed in his religion or in his body; but it is better for you that you practise self-restraint, and Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any one of you do not have the affluence to be able marry free believing women, (let him marry) from among the believing women that your right hand owns. Allah knows best your belief, you are from each other. Marry them with the permission of their people and give them their wages (dowry) honorably being women in marriage and chaste, not taking lovers. If, after marriage they commit adultery, they shall be liable to half the punishment of a married (free) woman. That is for those of you who fear fornication, but it is better for you to be patient. Allah is the Forgiver, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of you lack the means to marry free believing women, he may marry one of the believing maids under your control. God is well aware of your faith. You are from one another. Marry them with the permission of their guardians, and give them their recompense fairly—to be protected—neither committing adultery, nor taking secret lovers. When they are married, if they commit adultery, their punishment shall be half that of free women. That is for those among you who fear falling into decadence. But to practice self-restraint is better for you. God is Most Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever among you cannot [find] the means to marry free, believing women, then [he may marry] from those whom your right hands possess of believing slave girls. And Allah is most knowing about your faith. You [believers] are of one another. So marry them with the permission of their people and give them their due compensation according to what is acceptable. [They should be] chaste, neither [of] those who commit unlawful intercourse randomly nor those who take [secret] lovers. But once they are sheltered in marriage, if they should commit adultery, then for them is half the punishment for free [unmarried] women. This [allowance] is for him among you who fears sin, but to be patient is better for you. And Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:25] And whoever has not the means wherewith, [whoever] is not wealthy enough, to be able to marry believing (al-mu’mināt, ‘believing’, is in accordance with the prevalent practice, and does not add to the import), free, women in wedlock, let him take, in marriage, believing maids whom your right hands own. God knows very well your faith, so suffice yourself with its outward manifestation and leave the innermost matters to Him, for He is the One to know her [true] merit: many a slavegirl may be more excellent [in faith] than a free woman, and this is meant to encourage marriage with slavegirls; the one of you is as the other, being equal in religion, so do not disdain to marry with them. So marry them, with the permission of their folk, their guardians, and give them their wages, their dowries, honourably, without procrastination or diminution, as women in wedlock (muhsanāt, a circumstantial qualifier), in decency, not illicitly, openly fornicating, or taking lovers, companions fornicating in secret. But when they are given in wedlock, [when] they are married off (a variant reading [for the passive uhsinna, ‘they are given in wedlock’] has the active ahsanna, ‘they enter into wedlock’), if they commit lewdness, such as adultery, they shall be liable to half the chastisement, the legal punishment, of married, free, virgin, women, who commit adultery, and are thus given fifty lashes and banished for half a year; [male] slaves by analogy are liable to the same punishment. Here, God has not made wedlock the precondition for the prescribed punishment to show that stoning does not apply in their case [sc. slavegirls]. That, marrying of slavegirls on account of insufficient means, is for those of you who fear the distress of sin, fornication (al-‘anat originally means distress, but is used to mean zinā, ‘fornication’, because of the distress that it causes in the way of the punishment in this world and in the Hereafter), as opposed to those of you who might not have such a fear [of distress] with regard to their free women and for whom it is unlawful to marry her [the slavegirl]; likewise for one who has sufficient means to marry a free woman [it is unlawful for him to marry a slavegirl instead]: this is the opinion of alShāfi‘ī. Moreover, God’s words ‘believing maids’ precludes unbelieving women, whom it is unlawful to marry, even if one should find no believing women and fear [the distress of fornication]; yet it is better for you to be patient, and abstain from marrying slavegirls, lest the child should become enslaved also. God is Forgiving, Merciful, by allowing room for manoeuvre in these matters.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف قوله : { ومن لم يستطع منكم طولاً } على قوله : { وأحل لكم ما وراء ذلكم } \\[ النساء : 24 \\] تخصيصاً لعمومه بغير الإماء ، وتقييداً لإطلاقه باستطاعة الطَّول .والطَّول بفتح الطاء وسكون الواو القدرة ، وهو مصدر طال المجازي بمعنى قدر ، وذلك أنّ الطُّول يستلزم المقدرة على المناولة؛ فلذلك يقولون : تطاول لكذا ، أي تمطَّى ليأخذه ، ثم قالوا : تطاول ، بمعنى تكلّف المقدرة «وأين الثريا من يد المتطاول» فجعلوا لطال الحقيقي مصدراً بضم الطاء وجعلوا لطال المجازي مصدراً بفتح الطاء وهو ممّا فرّقت فيه العرب بين المعنيين المشتركين .{ والمحصنات } \\[ النساء : 24 \\] قرأه الجمهور بفتح الصاد وقرأه الكسائي بكسر الصاد على اختلاف معنيي ( أحصن ) كما تقدّم آنفاً ، أي اللاَّتي أحصنّ أنفسهنّ ، أو أحصنهنّ أولياؤهن ، فالمراد العفيفات . والمحصنات هنا وصف خرج مخرج الغالب ، لأنّ المسلم لا يقصد إلاّ إلى نكاح امرأة عفيفة ، قال تعالى : { والزانية لا ينكحها إلا زان أو مشرك } \\[ النور : 30 \\] أي بحسب خلق الإسلام ، وقد قيل : إنّ الإحصان يطلق على الحرية ، وأنّ المراد بالمحصنات الحرائر ، ولا داعي إليه ، واللغة لا تساعد عليه .وظاهر الآية أنّ الطوْل هنا هو القدرة على بذل مهر لامرأة حرّة احتاج لتزوّجها : أولى ، أو ثانية ، أو ثالثةً ، أو رابعة ، لأنّ الله ذكر عدم استطاعة الطوْل في مقابلة قوله : { أن تبتغوا بأموالكم } \\[ النساء : 24 \\] { فأتوهن أجورهن فريضة } \\[ النساء : 24 \\] ولذلك كان هذا الأصحّ في تفسير الطوْل . وهو قول مالك ، وقاله ابن عباس ، ومجاهد ، وابن جبير ، والسدّي ، وجابر بن زيد . وذهب أبو حنيفة إلى أنّ من كانت له زوجة واحدة فهي طَوْل فلا يباح له تزوّج الإماء؛ لأنّه طالب شهوة إذْ كانت عنده امرأة تعفّه عن الزنا . ووقع لمالك ما يقرب من هذا في كتاب محمد بن الموّاز ، وهو قول ابن حبيب ، واستحسنه اللخمي والطبري ، وهو تضييق لا يناسب يسر الإسلام على أنّ الحاجة إلى امرأة ثانية قد لا يكون لشهوة بل لحاجة لا تسدّها امرأة واحدة ، فتعيّن الرجوع إلى طلب التزوّج ، ووجودِ المقدرة . وقال ربيعة ، والنخعي ، وقتادة ، وعطاء ، والثوري ، الطوْل : الصبر والجلَد على نكاح الحرائر .ووقع لمالك في كتاب محمد : أنّ الذي يجد مهر حرّة ولا يقدر على نفقتها ، لا يجوز له أن يتزوّج أمة ، وهذا ليس لكون النفقة من الطوْل ولكن لأنّ وجود المهر طول ، والنفقة لا محيص عنها في كليهما ، وقال أصبغ : يجوز لهذا أن يتزوّج أمة لأنّ نفقة الأمة على أهلها إن لم يضمَّها الزوج إليه ، وظاهرٌ أنّ الخلاف في حاللٍ . وقوله : { أن ينكح } معمول ( طَوْلا ) بحذف ( اللاَّم ) أو ( على ) إذ لا يتعدّى هذا المصدر بنفسه .ومعنى { أن ينكح المحصنات } أي ينكح النساء الحرائر أبكاراً أو ثيّبات ، دلّ عليه قوله : { فمما ملكت أيمانكم من فتياتكم المؤمنات } .وإطلاق المحصنات على النساء اللاتي يتزوجهنّ الرجال إطلاق مجازي بعلاقة المآل ، أي اللائي يَصِرن محصنات بذلك النكاح إن كنّ أبكاراً ، كقوله تعالى : { قال أحدهما إني أراني أعصر خمراً } \\[ يوسف : 36 \\] أي عنباً آيلا إلى خمر؛ أو بعلاقة ما كان ، إن كنّ ثيّبات كقوله : { وآتوا اليتامى أموالهم } \\[ النساء : 2 \\] وهذا بيِّن ، وفيه غنية عن تأويل المحصنات بمعنى الحرائر ، فإنّه إطلاق لا تساعد عليه اللغة ، لا على الحقيقة ولا على المجاز ، وقد تساهل المفسّرون في القول بذلك .وقد وُصف المحصنات هنا بالمؤمنات ، جريا على الغالب ، ومُعظم علماء الإسلام على أنّ هذا الوصف خرج للغالب ولعلّ الذي حملهم على ذلك أنّ استطاعة نكاح الحرائر الكتابيات طول ، إذْ لم تكن إباحة نكاحهنّ مشروطة بالعجز عن الحرائر المسلمات ، وكان نكاح الإماء المسلمات مشروطاً بالعجز عن الحرائر المسلمات ، فحصل من ذلك أن يكون مشروطاً بالعجز عن الكتابيات أيضاً بقاعدة قياس المساواة . وعلّة ذلك أنّ نكاح الأمة يُعرّض الأولاد للرقّ ، بخلاف نكاح الكتابية ، فتعطيل مفهوم قوله : { المؤمنات } مع { المحصنات } حصل بأدلّة أخرى ، فلذلك ألغَوْا الوصف هنا ، وأعملوه في قوله : { من فتياتكم المؤمنات } . وشذّ بعض الشافعية ، فاعتبروا رخصة نكاح الأمة المسلمة مشروطة بالعجز عن الحرّة المسلمة ، ولو مع القدرة على نكاح الكتابية ، وكأنَّ فائدة ذكر وصف المؤمنات هنا أنّ الشارع لم يكترث عند التشريع بذكر غير الغالب المعتبر عنده ، فصار المؤمنات هنا كاللَّقب في نحو ( لا يلدغ المؤمن من جحر مرتين ) .والفتيات جمع فتاة ، وهي في الأصل الشابّة كالفتى ، والمراد بها هنا الأمة أطلق عليها الفتاة كما أطلق عليها الجَارية ، وعلى العبد الغلام ، وهو مجاز بعلاقة اللزوم ، لأنّ العبد والأمة يعاملان معاملة الصغير في الخدمة ، وقلّة المبالاة . ووصف المؤمنات عقب الفتيات مقصود للتقييد عند كافّة السلف ، وجمهور أيّمة الفقه ، لأنّ الأصل أن يكون له مفهوم ، ولا دليل يدلّ على تعطيله ، فلا يجوز عندهم نكاح أمة كتابية . والحكمة في ذلك أنّ اجتماع الرقّ والكفر يُباعد المرأة عن الحرمة في اعتبار المسلم ، فيقلّ الوفاق بينهما ، بخلاف أحد الوصفين . ويظهر أثر ذلك في الأبناء إذ يكونون أرقّاء مع مشاهدة أحوال الدّين المخالف فيمتدّ البون بينهم وبين أبيهم . وقال أبو حنيفة : موقع وصف المؤمنات هنا كموقعه مع قوله : { المحصنات المؤمنات } ، فلم يشترط في نكاح الأمة كونها مؤمنة ، قال أبو عُمر بن عبد البرّ : ولا أعرف هذا القول لأحد من السلف إلاّ لعَمْرو بن شرحبيل وهو تابعيّ قديم روى عن عمر بن الخطاب وعلي بن أبي طالب؛ ولأنَّ أبا حنيفة لا يرى إعمال المفهوم .وتقدّم آنفاً معنى { ملكت أيمانكم } .والإضافة في قوله : { أيمانكم } وقوله : { من فتياتكم } للتقريب وإزالة ما بقي في نفوس العرب من احتقار العبيد والإماء والترفّع عن نكاحهم وإنكاحهم ، وكذلك وصف المؤمنات ، وإن كنّا نراه للتقيد فهو لا يخلو مع ذلك من فائدة التقريب ، إذ الكفاءة عند مالك تعتمد الدين أوَّلاً .وقوله : { والله أعلم بإيمانكم } اعتراض جمع معاني شتّى ، أنّه أمر ، وقيدٌ للأمر في قوله تعالى : { ومن لم يستطع منكم طولاً } إلخ؛ وقد تَحول الشهوة والعجلة دون تحقيق شروط الله تعالى ، فأحالهم على إيمانهم المطلّع عليه ربّهم . ومن تلك المعاني أنّه تعالى أمر بنكاح الإماء عند العجز عن الحرائر ، وكانوا في الجاهلية لا يرضون بنكاح الأمة وجعْلَها حليلة ، ولكن يقضون منهنّ شهواتهم بالبغاء ، فأراد الله إكرام الإماء المؤمنات ، جزاء على إيمانهنّ ، وإشعاراً بأنّ وحدة الإيمان قرّبت الأحرار من العبيد ، فلمَّا شَرَع ذلك كلّه ذيّله بقوله : { والله أعلم بإيمانكم } ، أي بقوّته ، فلمّا كان الإيمان ، هو الذي رفع المؤمنين عند الله درجات كان إيمان الإماء مُقنعا للأحرار بترك الاستنكاف عن تزوجهنّ ، ولأنّه رُبّ أمةٍ يكون إيمانها خيراً من إيمان رجل حرّ ، وهذا كقوله { إن أكرمكم عند الله أتقاكم } \\[ الحجرات : 13 \\] . وقد أشار إلى هذا الأخير صاحب «الكشاف» ، وابن عطية .وقوله : { بعضكم من بعض } تذييل ثان أكّد به المعنى الثاني المراد من قوله : { والله أعلم بإيمانكم } فإنّه بعد أن قرّب إليهم الإماء من جانب الوحدة الدينية قرّبهنّ إليهم من جانب الوحدة النوعية ، وهو أنّ الأحرار والعبيد كلّهم من بني آدم ف ( مِن ) اتّصالية .وفرّع عن الأمر بنكاح الإماء بيان كيفية ذلك فقال : { فأنكحوهن بإذن أهلهن } وشرط الإذن لئلاّ يكون سرّا وزني ، ولأنّ نكاحهنّ دون ذلك اعتداء على حقوق أهل الإماء .والأهْل هنا بمعنى السَّادة المالكين ، وهو إطلاق شائع على سادة العبيد في كلام الإسلام . وأحسب أنّه من مصطلحات القرآن تلطّفا بالعبيد ، كما وقع النهي أن يقول العبد لسيّده : سيّدي ، بل يقول : مولاي . ووقع في حديث بريرة «أنّ أهلها أبوا إلاّ أن يكون الولاء لهم» .والآية دليل على ولاية السيّد لأمته ، وأنّه إذا نَكحت الأمة بدون إذن السيّد فالنكاح مفسوخ ، ولو أجازه سيّدها . واختلف في العبد : فقال الشعبي : والأوزاعي ، وداود : هو كالأمة . وقال مالك ، وأبو حنيفة ، وجماعة من التابعين : إذا أجازه السيد جاز ، ويُحتجّ بها لاشتراط أصل الولاية في المرأة ، احتجاجاً ضعيفاً ، واحتجّ بها الحنفية على عكس ذلك ، إذ سمّى الله ذلك إذناً ولم يسمّه عقداً ، وهو احتجاج ضعيف ، لأنّ الإذن يطلق على العقد لا سيما بعد أن دخلت عليه باء السببية المتعلّقة ب ( انكحوهنّ ) .والقول في الأجور والمعروف تقدّم قريباً . غير أنّ قوله : { وأتوهن } وإضافة الأجور إليهنّ ، دليل على أنّ الأمة أحقّ بمهرها من سيّدها . ولذلك قال مالك في كتاب الرهون ، من المدونة : إنّ على سيّدها أن يجهّزها بمهرها . ووقع في كتاب النكاح الثاني منها : إنّ لسيّدها أن يأخذ مَهرها ، فقيل : هو اختلاف من قول مالك ، وقيل : إنّ قوله في كتاب النكاح : إذا لم تُبَوَّأ أو إذا جهّزها من عنده قبل ذلك ، ومعنى تُبَوَّأ إذا جعل سكناها مع زوجها في بيت سيّدها .وقوله : { محصنات } حال من ضمير الإماء ، والإحصان التزوّج الصحيح ، فهي حال مقدّرة ، أي ليصرن محصنات .وقوله : { غير مسافحات } صفة للحال ، وكذلك { ولا متخذات أخدان } قصد منها تفظيع ما كانت ترتكبه الإماء في الجاهلية بإذن مواليهنّ لاكتساب المَال بالبغاء ونحوه ، وكان الناس يومئذ قريبا عصرهم بالجاهلية .والمسافحات الزواني مع غير معيّن . ومتّخذاتُ الأخذَان هنّ متّخذات أخلاّء تتّخذ الواحدة خليلاً تختصّ به لا تألف غيره . وهذا وإن كان يشبه النكاح من جهة عدم التعدّد ، إلاّ أنّه يخالفه من جهة التستّر وجهل النسب وخلع برقع المروءة ، ولذلك عطفه على قوله : { غير مسافحات } سدّ المداخل الزني كلّها . وتقدّم الكلام على أنواع المعاشرة التي كان عليها أهل الجاهلية في أول هذه السورة .وقرأه الكسائي بكسر الصاد وقرأه الجمهور بفتح الصاد .وقوله : { فإذا أُحْصنّ } أي أحصنهنّ أزواجُهن ، أي فإذا تزوجن . فالآية تقتضي أنّ التزوّج شرط في إقامة حدّ الزنا على الإماء ، وأنّ الحدّ هو الجلد المعيّن لأنّه الذي يمكن فيه التنصيف بالعدد . واعلم أنّا إذا جرينا على ما حقّقناه ممّا تقدّم في معنى الآية الماضية تعيّن أن تكون هذه الآية نزلت بعد شرع حدّ الجلد للزانية والزاني بآية سورة النور . فتكون مخصّصة لعموم الزانية بغير الأمة ، ويكون وضع هذه الآية في هذا الموضع ممّا ألحق بهذه السورة إكمالا للأحكام المتعلّقة بالإماء كما هو و اقع في نظائر عديدة ، كما تقدّم في المقدّمة الثامنة من مقدّمات هذا التفسير . وهذه الآية تحيّر فيها المتأوّلون لاقتضائها أن لا تحدّ الأمة في الزنى إلاّ إذا كانت متزوّجة ، فتأوّلها عمر بن الخطاب ، وابن مسعود ، وابن عُمَر بأنّ الإحصان هنا الإسلام ، ورأوا أنّ الأمة تحدّ في الزنا سواء كانت متزوّجة أم عزبى ، وإليه ذهب الأيّمة الأربعة . ولا أظنّ أنّ دليل الأيّمة الأربعة هو حمل الإحصان هنا على معنى الإسلام ، بل ما ثبت في «الصحيحين» أنّ رسول الله صلى الله عليه وسلم سئل عن الأمة إذا زنت ولم تحصن؛ فأوجب عليها الحدّ . قال ابن شهاب فالأمة المتزوّجة محدودة بالقرآن ، والأمة غير المتزوّجة محدودة بالسنّة . ونِعْم هذا الكلام . قال القاضي إسماعيل بن إسحاق : في حمل الإحصان في الآية على الإسلام بُعد؛ لأنّ ذكر إيمانهن قد تقدّم في قوله : { من فتياتكم المؤمنات } وهو تدقيق ، وإن أباه ابن عطية .وقد دلّت الآية على أنّ حدّ الأمة الجلد ، ولم تذكر الرجم ، فإذا كان الرجم مشروعاً قبل نزولها دلّت على أنّ الأمة لا رجم عليها ، وهو مذهب الجمهور ، وتوقّف أبو ثور في ذلك ، وإن كان الرجم قد شرع بعد ذلك فلا تدلّ الآية على نفي رجم الأمة ، غير أنّ قصد التنصيف في حدّها يدلّ على أنّها لا يبلغ بها حدّ الحرّة ، فالرجم ينتفي لأنّه لا يقبل التجزئة ، وهو ما ذَهِل عنه أبو ثور .وقد روي عن عمر بن الخطاب : أنّه سئل عن حدّ الأمة فقال : «الأمة ألقت فَروة رأسها من وراء الدار» أي ألقت في بيت أهلها قناعها ، أي أنّها تخرج إلى كلّ موضع يرسلها أهلها إليه لا تقدر على الامتناع من ذلك ، فتصير إلى حيث لا تقدر على الامتناع من الفجور ، قالوا : فكان يرى أن لا حدّ عليها إذا فجرت ما لم تتزوّج ، وكأنّه رأى أنّها إذا تزوّجت فقد منعها زوجها . وقولُه هذا وإن كان غير المشهور عنه ، ولكنّنا ذكرناه لأنّ فيه للمتبصّر بتصريف الشريعة عبرة في تغليظ العقوبة بمقدار قوّة الخيانة وضعف المعذرة .وقرأ نافع ، وابن كثير ، وابن عامر ، وحفص عن عاصم ، وأبو جعفر ، ويعقوب : { أحصن } بضمّ الهمزة وكسر الصاد مبنيّا للنائب ، وهو بمعنى مُحْصَنات المفتوح الصاد . وقرأه حمزة ، والكسائي وأبو بكر عن عاصم ، وخلَف : بفتح الهمزة وفتح الصاد ، وهو معنى محصِنات بكسر الصاد .وقوله : { ذلك لمن خشى العنت منكم } إشارة إلى الحكم الصالح لأن يتقيّد بخشية العنت ، وذلك الحكم هو نكاح الإماء .والعنت : المشقّة ، قال تعالى : { ولو شاء الله لأعنتكم } \\[ البقرة : 220 \\] وأريد به هنا مشقّة العُزبة التي تكون ذريعة إلى الزنا ، فلذلك قال بعضهم : أريد العَنت الزنا .وقوله : { وأن تصبروا خير لكم } أي إذا استطعتم الصبر مع المشقّة إلى أن يتيسّر له نكاح الحرّة فذلك خير ، لئلا يوقع أبناءه في ذلّ العبودية المكروهة للشارع لولا الضرورة ، ولئلا يوقع نفسه في مذّلة تصرّف الناس في زوجه .وقوله : { والله غفور رحيم } أي إن خفتم العَنت ولم تصبروا عليه ، وتزوّجتم الإماء ، وعليه فهو مؤكّد لمعنى الإباحة . مؤذن بأنّ إباحة ذلك لأجل رفع الحرج ، لأنّ الله رحيم بعباده . غفور فالمغفرة هنا بمعنى التجاوز عمّا ما يقتضي مقصدُ الشريعة تحريمَه ، فليس هنا ذنب حتّى يغفر .\n\n",
      "translations": [
        {
          "translation": "(And whoso is not able to afford to marry free, believing women, let them marry from the believing maids whom your right hands possess) who are in the hands of the believers. (Allah knoweth best (concerning) your faith) He knows best that your hearts are firm in faith. (Ye (proceed) one from another) You are all the children of Adam; it is also said that this means: some of you follow the religion of others; and it is also said that this means: you are strengthened by one another; (so wed them) marry the maids (by permission of their folk) their owners, (and give unto them) the maids (their portions) their dowry (in kindness) on top of the price given to the prostitute for providing sex, (they being honest) He says: marry those maids who are chaste, (not debauched) not those who commit adultery in the open (nor of loose conduct) nor those who have lovers who commit adultery with them in secret. (And if when they are honourably married) if when they marry maids (they commit lewdness) fornication (they) the maids (shall incur the half of the punishment (prescribed)) lashing (for free women (in that case). This is) marrying maids is lawful (for him 86 among you who feareth to commit sin) adultery and debauchery. (But to have patience) and refrain from marrying maids (would be better for you) in that your children would be free. (Allah is Forgiving) of the adultery you might commit, (Merciful) when He gave you a legal dispensation to marry captives in cases of necessity.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَإِذَآ أُحْصِنَّ } معناهُ أَسْلَمْنَّ\n\n\n\n\nوقوله تعالى: { ذَلِكَ لِمَنْ خَشِيَ ٱلْعَنَتَ مِنْكُمْ } يعني الزّنا\n\n\n\n\nوقوله تعالى: { وَأَن تَصْبِرُواْ خَيْرٌ لَّكُمْ } معناهُ وأَن تَصبِرُوا عَنْ نِكَاحِ الأَمةِ\n\n\n\n\nوقوله تعالى: { وَمَن لَّمْ يَسْتَطِعْ مِنكُمْ طَوْلاً } أي غِنَاءٌ وسِعَةً\n\n\n\n\nوقوله تعالى: { وَلاَ مُتَّخِذَٰتِ أَخْدَانٍ } معناهُ أَخدِنَةٌ واحدُها خِدنٌ\n\n\n\n\nوقوله تعالى: { آتُوهُنَّ أُجُورَهُنَّ } معناه مُهُورُهُنَّ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Then when they are {in isolation}\" - its meaning is that they have submitted.\n\n\nThis is for those of you who fear the punishment of adultery.\n\n\nAnd the saying of Allah, \"And be patient; for indeed the best of outcomes is for those who are patient.\" (Quran, 3:186) means that you should be patient about the marriage of the nation.\n\n\nAnd the saying of Allah: {And whoever among you cannot afford} a measure of wealth.\n\n\nAnd His statement, {And let not those who take protecting allies from among others than you}, its meaning is two allies, one of them is a Khadin.\n And His saying - the Most High - {Pay them their wages} means [the payment of] their dowries.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَن لَّمْ يَسْتَطِعْ مِنكُمْ طَوْلاً } اقتداراً وغنى { أَن يَنكِحَ } به { ٱلْمُحْصَنَٰتِ } المتعففات الحرائر { ٱلْمُؤْمِنَٰتِ فَمِنْ مَّا مَلَكَتْ أَيْمَٰنُكُم } أي: فعليكم أن تنكحوا { مِّن فَتَيَٰتِكُمُ } أي: إمائكم { ٱلْمُؤْمِنَٰتِ } المقرات بكلمتي الشهادة ظاهراً { وَٱللَّهُ } المطلع بضمائر عباده { أَعْلَمُ بِإِيمَٰنِكُمْ } وإيمانهن وكفرهن وكلكم في أنفسكم أمثال أكفاء\n إذ { بَعْضُكُمْ } يا بني آدم قد حصل { مِّن بَعْضٍ } والتفاضل بينكم إنما هو في علم الله\n وإن اضطررتم إلى نكاح الإماء { فَٱنكِحُوهُنَّ بِإِذْنِ أَهْلِهِنَّ } أربابهن { وَآتُوهُنَّ أُجُورَهُنَّ } أي: أعطوهن أجور مهورهن المسماة لهن بإذن أهلهن { بِٱلْمَعْرُوفِ } إعطاء مستحسناً عقلاً وشرعاً بلا مطلٍ وتسويفٍ واضطرارٍ وتنقيصٍ حال كونهن { مُحْصَنَٰتٍ } عفائف { غَيْرَ مُسَٰفِحَٰتٍ } زانياتٍ مجاهراتٍ غير حاجزاتٍ { وَلاَ مُتَّخِذَٰتِ أَخْدَانٍ } وأخلانٍ\n\n\n{ فَإِذَآ أُحْصِنَّ } وأنكحن بعد وجود الشرائط المذكورة المستحسنة عند الله وعند المؤمنين { فَإِنْ أَتَيْنَ } بعدما أحصن { بِفَٰحِشَةٍ فَعَلَيْهِنَّ نِصْفُ مَا عَلَى ٱلْمُحْصَنَٰتِ } الحرائر { مِنَ ٱلْعَذَابِ } أي: الذي حد الله لهن في كتابه سوى الرجم\n إذ لا يجري التنصيف فيه لذلك لم يشرع في حد الرقيق { ذَلِكَ } أي: نكاح الإماء إنما يرخص { لِمَنْ خَشِيَ ٱلْعَنَتَ مِنْكُمْ } أي: الوقوع في الزنا أيها المؤمنون المجتنبون عن المحرمات { وَأَن تَصْبِرُواْ } أيها الفاقدون المؤمنون لوجه المعاش وترتاضوا نفوسكم بتقليل الأغذية المستمنية المثيرة للقوة الشهوية الموقعة للمهالك\n وتدفعوا أمارة إثارتكم بالقاطع العقلي والواضح الشرعي\n وتترنوا على عفة العزومة\n وتسكنوا نار الطبيعة بقطع النطر والاتقاء عن المخاطر فهو { خَيْرٌ لَّكُمْ } من نكاح الإماء بل من نكاح أكثر الحرائر أيضاً سيما في هذا الزمن { وَٱللَّهُ } المطلع لضمائر عباده { غَفُورٌ } لذنوب من صبر ولم ينكح لقلة معاشهم { رَّحِيمٌ } [النساء: 25] له بحفظه عن الفرطات والعثرات في أمر المعاش\n\n\nعصمنا الله من المهالك المتعلقة بالمعاش بفضله وطوله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وَمَن لَّمْ يَسْتَطِعْ مِنكُمْ طَوْلاً أَن يَنكِحَ الْمُحْصَنَاتِ الْمُؤْمِنَاتِ فَمِنْ مَّا مَلَكَتْ أَيْمَانُكُم مِّن فَتَيَاتِكُمُ الْمُؤْمِنَاتِ وَاللَّهُ أَعْلَمُ بِإِيمَانِكُمْ بَعْضُكُمْ مِّن بَعْضٍ فَإنكِحُوهُنَّ بِإِذْنِ أَهْلِهِنَّ وَآتُوهُنَّ أُجُورَهُنَّ بِالْمَعْرُوفِ مُحْصَنَاتٍ غَيْرَ مُسَافِحَاتٍ وَلاَ مُتَّخِذَاتِ أَخْدَانٍ\n\n\n }  قلت: الطول: الغنى والسعة\n ويطلق على العلو\n مصدر طال طَوْلاً\n وهو مفعول { يستطع } \n أو مصدر له ـ لتقارب معناهما\n و { أن ينكح } بدل منه على الأول\n أو مفعول به على الثاني\n أي: لأن ينكح\n و { محصنات غير مسافحات } \n حالان\n والعامل فيه: { أنكحوهن } \n والخدن: الخليل\n يقول الحقّ جلّ جلاله: { ومن لم يستطع منكم طَوْلاً } أي: لم يجد غني يقدر به على نكاح { المحصنات } \n أي: الحرائر { المؤمنات } \n فليتزوج من ما ملكت أيمانكم\n من الإماء المؤمنات دون الكافرات\n فإن أظهرت الإيمان فاكتفوا بذلك\n وعلم الباطن لا يعلمه إلا الله\n { والله أعلم بإيمانكم } فلا يمنعكم من نكاحهن خوف المعرة\n فإنما أنتم جنس واحد\n ودينكم واحد\n { بعضكم من بعض } فلا تستنكفوا من نكاحهن\n { فانكحوهن بإذن أهلهن } \n أي أربابهن\n حتى يعقدوا لكم نكاحهن\n { وآتوهن أجورهن }: أي: مهورهن\n وهن أحق به دون ساداتهن\n على مذهب مالك\n { بالمعروف } من غير مطل\n ولا نقص\n على ما تقتضيه السنة\n حال كونهن { محصنات } أي: عفيفات { غير مسافحات } أي: غير زانيات { ولا متخذات أخدان } \n أي: أصحاب يزنون بهن\n وكان في الجاهلية مِن النساء مَنْ تتخذ صاحبًا واحدًا تزني معه خاصة\n ومنها من لا ترد يد لامس\n قال ابنُ جزي: مذهب مالك وأكثر أصحابه أنه لا يجوز للحر نكاح الأمة إلا بشرطين: أحداهما: عدم الطول وهو ألاَّ يجد ما يتزوج به حُرة\n والآخر: خوف العنت وهو الزنا\n لقوله بعد هذا: { ذلك لمن خشي العنت منكم } \n وأجاز ابن القاسم نكاحهن دون الشرطين\n على القول بأن دليل الخطاب لا يُعتبر\n واتفقوا على اشتراط الإسلام في الأمة\n لقوله: { من فتياتكم المؤمنات } إلا أهل العراق فلم يشترطوه\nهـ\n الإشارة: فمن لم يستطع أن ينكح أبكار الحقائق\n لكونه لم يقدر أن يدفع عن قلبه الشواغل والعلائق\n فليتنزل لنكاح العلوم الرسمية والأعمال الحسية\n بأخذها من أربابها\n ويحصنها بالإخلاص في أخذها\n ويقوم بحقها بقدر الإمكان\n وهو بذلها لأهلها والصبر على نشرها\n والله لا يضيع أجر من أحسن عملاً\n فإن صح قصده\n وخلص عمله\n قيض الله له وليًا من أوليائه يغنيه بالله\n حتى يصير من الأغنياء به\n فيتأهل لنكاح الحرائر\n ويلتحق بأولياء الله الأكابر\n\n[إبراهيم:20]\n قال الشيخ أبو الحسن الشاذلي رضي الله عنه لما تكلم على ثمرات المحبة ـ قال: فترى النفس مائلة لطاعته\n والعقل متحصنًا بمعرفته\n والروح مأخوذة في حضرته\n والسر مغمورًا في مشاهدته\n والعبد يستزيد من حبه فيُزاد ويفاتح بما هو أعذب من لذيذ مناجاته\n فيكسى حُلل التقريب على بساط القُربة\n ويمس أبكار الحقائق وثيبات العلوم\n\nهـ\n فعلم الحقائق أبكار\n وما يوصل إليه من علوم الطريقة ثيبات حرائر\n وما سواها من علوم الرسوم إماء بالنسبة إلى غيرها\n والله تعالى أعلم\n ثم ذكر حدَّ الأمَةِ إذا زنت\n فقالت: {\n\n\nفَإِذَآ أُحْصِنَّ فَإِنْ أَتَيْنَ بِفَاحِشَةٍ فَعَلَيْهِنَّ نِصْفُ مَا عَلَى الْمُحْصَنَاتِ مِنَ الْعَذَابِ\n\n\n }  قلت: أحصن الرجل ـ بفتح الهمزة وضمها ـ: صار محصنًا بالفتح والكسر\n وهذا مما اتحد فيه البناء للفاعل والمفعول\n وقيل بالفتح\n معناه: أسلم\n وبالضم: تزوج\n يقول الحقّ جلّ جلاله: إن الإماء إذا تزوجن { فإن أتين بفاحشة } \n وهو الزنا\n فعليهن نصف ما على الحرة من الحد\n وهو خمسون\n لأن حد البكر مائة\n ويفهم منه أنها لا ترجم لأن الرجم لا يتبعض\n وكذلك الذكور من العبيد عليهم نصف الحدود كلها\n ولا رجم عليهم\n وسمَى الحد عذابًا\n كقوله:\n[النور:2]\n الإشارة: بقدر ما يعلو المقام يُشدد العقاب\n وبقدر ما يحصل من القرب يُطلَب الآداب\n فليست المعصية في البعد كالمعصية في القرب\n وليس يُطلب من البعيد ما يُطلب من القريب\n وانظر إلى أزواج النبي صلى الله عليه وسلم حيث قال تعالى لهن:\n[الأحزاب:30]\n وما ذلك إلا لحظوتهن وشدة قربهن من الله\n ولذلك كان لا يدخل الحضرة إلا أهل الآداب والتهذيب\n بعد التدريج والتدريب\n وتأمل قضيةَ الجنيد\n حيث قيل له في المنام: مثلُك لا يُرضى منه هذا\n حيث خطر على قلبه الاعتراض على السائل\n غير أن المقربين يعاتبون\n ويردون إلى الحضرة\n وأهلُ البُعد يزيدون بُعداً\n ولكن لا يشعرون\n والله تعالى أعلم\n ثم ذكر شرط تزوج الأمة لعادم الطَوْل\n فقال:  {\n\n\nذَلِكَ لِمَنْ خَشِيَ الْعَنَتَ مِنْكُمْ وَأَن تَصْبِرُواْ خَيْرٌ لَّكُمْ وَاللَّهُ غَفُورٌ رَّحِيمٌ يُرِيدُ اللَّهُ لِيُبَيِّنَ لَكُمْ وَيَهْدِيَكُمْ سُنَنَ الَّذِينَ مِن قَبْلِكُمْ وَيَتُوبَ عَلَيْكُمْ وَاللَّهُ عَلِيمٌ حَكِيمٌ وَاللَّهُ يُرِيدُ أَن يَتُوبَ عَلَيْكُمْ وَيُرِيدُ الَّذِينَ يَتَّبِعُونَ الشَّهَوَاتِ أَن تَمِيلُواْ مَيْلاً عَظِيماً يُرِيدُ اللَّهُ أَن يُخَفِّفَ عَنْكُمْ وَخُلِقَ الإِنسَانُ ضَعِيفاً }  قلت: العنت: المشقة والضرر\n ولا ضرر أعظم من مواقعة الإثم\n ولا سيما بأفحش الفواحش وهو الزنا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:5",
      "similarity": 0.6570408411374238
    },
    {
      "verse": "4:24",
      "similarity": 0.3440359671266143
    },
    {
      "verse": "49:7",
      "similarity": 0.21406148305733186
    },
    {
      "verse": "24:33",
      "similarity": 0.20933446682207726
    },
    {
      "verse": "6:145",
      "similarity": 0.20143005365709785
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004025.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004025.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:25.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}