{
  "chapter": "النساء",
  "text": "يريد الله ليبين لكم ويهديكم سنن الذين من قبلكم ويتوب عليكم والله عليم حكيم",
  "translations": [
    {
      "translation": "Allah desires to make things clear to you and to guide you to the correct practices of those before you and to turn towards you. Allah is All-Knowing, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God wishes to make it clear to you and guide you through the example of earlier people, and to forgive you, for God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah wants to make all this clear to you, and to guide you to the ways which the righteous have followed in the past. He will turn graciously towards you. Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God wants to guide you, explain to you the customs of those who lived before you, and grant you forgiveness. He is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah wills to explain His commands to you and show you the ways of those before you, and to incline towards you with His mercy; and Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah wishes to make clear (what is lawful and what is unlawful) to you, and to show you the ways of those before you, and accept your repentance, and Allah is All-Knower, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah desires to explain to you, and to guide you into the ways of those before you, and to turn to you (mercifully), and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God desires to make clear to you, and to guide you in the institutions of those before you, and to turn towards you; God is All-knowing, All-wise;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah would explain to you and guide you by the examples of those who were before you, and would turn to you in mercy. Allah is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God wishes to explain things to you and guide you to the ways of those who have gone before you and to turn to you in mercy. God is all knowing and all wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah intendeth to expound unto you and to guide you into the dispensations of those before you and relent toward you. And Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah desires to explain [the laws] to you, and to guide you to the customs of those who were before you, and to turn toward you clemently, and Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah doth wish to make clear to you and to show you the ordinances of those before you; and (He doth wish to) turn to you (In Mercy): And Allah is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah wishes to make clear (what is lawful and what is unlawful) to you, and to show you the ways of those before you, and accept your repentance, and Allah is All-Knower, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah wishes to make this clear to you and to guide you along the ways of those who have gone before you, and turns towards you. And Allah is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God intends to make things clear to you, and to guide you in the ways of those before you, and to redeem you. God is Most Knowing, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah wants to make clear to you [the lawful from the unlawful] and guide you to the [good] practices of those before you and to accept your repentance. And Allah is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:26] God desires to make clear to you, the laws of your religion and what is in your best interests, and to guide you in the ways, the paths, of those, prophets, before you, in the way of what is lawful and what is unlawful, so that you might follow them, and to turn [in forgiveness] towards you, bringing you back from the disobedience which you practised, to obedience to Him; God is Knowing, of you, Wise, in what He has ordained for you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah wishes to explain to you) that which is lawful for you; it is also said that this means: Allah would explain to you that having patience and refraining from marrying captives is better for you than marrying them (and guide you) expound to you (by the examples of those who were before you) among the people of the Book who were forbidden from marrying captives, (and would turn to you in mercy) He will forgive you that which ensued from you in pre-Islamic times. (Allah is Knower) that you have a dire need for marriage, (Wise) when He prohibited you to marry them except upon necessity.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإنما { يُرِيدُ ٱللَّهُ } بتعيين المحرمات وبتبيين المحللات { لِيُبَيِّنَ لَكُمْ } أيها المؤمنون طريق الرشد والغي والهداية والضلالة { وَيَهْدِيَكُمْ } أي: يشرشدكم ويوصلكم { سُنَنَ ٱلَّذِينَ } مضوا { مِن قَبْلِكُمْ } من أرباب الولاء والمكاشفات بسر التوحيد { وَيَتُوبَ عَلَيْكُمْ } يرجعكم عن ميل المزخرفات الدنية الدنيوية\n ليصولكم إلى المراتب العلية الأخروية { وَٱللَّهُ } الهادي لعباده إلى توحيده { عَلِيمٌ } بمصالحهم الموصلة إليه { حَكِيمٌ } [النساء: 26] في إلقائها إليهم في ضمن العظة والعبر والقصص والتواريخ والرموز والإشارات ليرتاضوا بها نفوسهم حتى تستعد قلوبهم لنزول سلطان التوحيد المفني للغير والسوى مطلقاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nذَلِكَ لِمَنْ خَشِيَ الْعَنَتَ مِنْكُمْ وَأَن تَصْبِرُواْ خَيْرٌ لَّكُمْ وَاللَّهُ غَفُورٌ رَّحِيمٌ يُرِيدُ اللَّهُ لِيُبَيِّنَ لَكُمْ وَيَهْدِيَكُمْ سُنَنَ الَّذِينَ مِن قَبْلِكُمْ وَيَتُوبَ عَلَيْكُمْ وَاللَّهُ عَلِيمٌ حَكِيمٌ وَاللَّهُ يُرِيدُ أَن يَتُوبَ عَلَيْكُمْ وَيُرِيدُ الَّذِينَ يَتَّبِعُونَ الشَّهَوَاتِ أَن تَمِيلُواْ مَيْلاً عَظِيماً يُرِيدُ اللَّهُ أَن يُخَفِّفَ عَنْكُمْ وَخُلِقَ الإِنسَانُ ضَعِيفاً }  قلت: العنت: المشقة والضرر، ولا ضرر أعظم من مواقعة الإثم، ولا سيما بأفحش الفواحش وهو الزنا، { يريد الله ليبين لكم } ، أي: لأن يُبين، واللام زائدة في المفعول، لتأكيد معنى الاستقبال اللازم للإدارة\n يقول الحقّ جلّ جلاله: { ذلك } أي: نكاح الإماء إنما أبَحْتُهُ لمن خشي الوقوع في الزنا، الذي هو أقبح الفواحش، فنكاح الأمةُ، وإرقاق الولد يباع في الأسواق أخف من الزنا\n { وأن تصبروا } عن نكاحهن، مع التعفف عن الزنا، { خير لكم } لئلا يرق أولادكم\n وعن أنس قال: سمعت النبي صلى الله عليه وسلم يقول:\n\n \" مَنْ أرادَ أنْ يَلْقَى اللهَ طَاهِرًا مُطَهَّرًا فَلْيَتَزَوَّج الْحَرائِر \" \n\n \n\nوقال أبو هريرة: سمعته صلى الله عليه وسلم يقول:\n\n \" الحَرَائِر صَلاحُ البَيْتَ، والإمَاءُ هَلاكُ البَيت \"\n \n\n{ والله غفور } لكم فيما سلف من المخالفة، { رحيم } بكم، حيث رخَّص لكم عند خوف الإثم نكاحَ الأمَة، { يريد الله ليبين لكم } شرائع دينكم، ومصالح أموركم، { ويهديكم سنن الذين من قبلكم } أي: مناهج مَنْ تقدمكم من أهل الرشد، كالأنبياء والصالحين، لتسلكوا مناهجهم، كحفظ الأموال والأنساب، وتحريم الأمهات والبنات والأخوات، فإنهن محرمات على من قبلكم، { ويتوب عليكم } أي: يغفر ذنوبكم الماضية، أو يرشدكم إلى التوبة، أو يمنعكم من المعاصي بالعصمة\n { والله عليم } بما أسلفتم وما تستقبلونه من أفعالكم، { حكيم } بما دبر وأبرم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:77",
      "similarity": 0.6038463759325675
    },
    {
      "verse": "15:13",
      "similarity": 0.593754197875721
    },
    {
      "verse": "33:62",
      "similarity": 0.5517586654556499
    },
    {
      "verse": "48:23",
      "similarity": 0.5479145248958056
    },
    {
      "verse": "18:55",
      "similarity": 0.5269358742748252
    }
  ]
}