{
  "chapter": "النساء",
  "text": "والله يريد ان يتوب عليكم ويريد الذين يتبعون الشهوت ان تميلوا۟ ميلا عظيما",
  "translations": [
    {
      "translation": "God likes to turn to you, but those who are lost in the pleasures of the flesh wish to turn you astray, far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah indeed wants to turn graciously towards you; but those who follow their lusts would want you to drift far away from the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God wants to be merciful to you but those who follow their evil desires seek to lead you astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah wills to incline towards you with His mercy; and those who pursue their own pleasures wish that you be far separated from the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah wishes to accept your repentance, but those who follow their lusts, wish that you (believers) should deviate tremendously away (from the right path)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah desires that He should turn to you (mercifully), and those who follow (their) lusts desire that you should deviate (with) a great deviation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and God desires to turn towards you, but those who follow their lusts desire you to swerve away mightily.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah would turn to you in mercy; but those who follow vain desires would have you go tremendously astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He wishes to turn towards you in mercy, but those who follow their own passions want you to drift far away from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah intendeth to relent toward you, and those that follow lusts intend that ye shall incline a mighty inclining.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah desires to turn toward you clemently, but those who pursue their [base] appetites desire that you fall into gross waywardness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah doth wish to Turn to you, but the wish of those who follow their lusts is that ye should turn away (from Him),- far, far away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah wishes to accept your repentance, but those who follow their lusts, wish that you (believers) should deviate tremendously away from the Right Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah wishes to turn towards you, but those who follow their lower desires wish you to greatly swerve away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God intends to redeem you, but those who follow their desires want you to turn away utterly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah wants to accept your repentance, but those who follow [their] passions want you to digress [into] a great deviation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:27] And God desires to turn [forgivingly] towards you (He repeats this in order to expand upon it), but those who follow their passions, the Jews and Christians, or the Magians and adulterers, desire that you deviate with a terrible deviation, transgressing what is right by committing what has been forbidden you, so that you might be like them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And Allah wishes to turn to you in mercy) He wishes to overlook your transgression when He made adultery and marrying your sisters, from the father's side, forbidden for you; (but those who follow vain desires) i.e. adultery and marrying their sisters from their fathers' side, namely, the Jews (would have you go tremendously astray) commit a serious error by marrying your sisters, from the father's side, by claiming that it is lawful in their Scripture.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيُرِيدُ ٱلَّذِينَ يَتَّبِعُونَ ٱلشَّهَوَاتِ } معناهُ الزِّنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم كرر سبحانه ذكر التوبة والرجوع عن المزخرفات الباطلة المانعة من الوصول إلى دار السرور حثاً للمؤمنين إليها؛ ليفوزوا بمرتبة التوحيد بقوله: { وَٱللَّهُ } المرشد لكم إلى توحيده الذاتي { يُرِيدُ أَن يَتُوبَ عَلَيْكُمْ } أي: يفوقكم على التوبة التي هي الرجوع عما سوى الحق مطلقاً، ومتى انفتح عليكم باب التوبة انفتح باب الطلب المستلزم للترقي والتقرب نحو المطلوب، إلى أن يتولد من الشوق المزعج إلى المحبة المفنية لغير المحبوب مطلقاً، بل نفس المحبة بل نفس المحبوب أيضاً، كما حكي عن مجنون العامري أنه وله يوماً من الأيام واستغرق في بحر المحبة إلى أن اضمحلت عن بصره غشاوة التعيينات مطلقاً، بل ارتفع حجب الاثنينية رأساً، وفي تلك الحالة السريعة الزوال تمثل ليلى قائمة على رأسها فصاحت عليه صيحة: عمن اشتغلت يا مجنون؟ فقال: طاب وقته وعنى على حالٍ فإن حبك شغلني عنك وعني\n\n\n\n\nثم قال سبحانه: { وَيُرِيدُ ٱلَّذِينَ } يضلونكم عن طريق التوحيد المسقط لجميع الرسوم والعادات بوضع طرقٍ غير طريق الشرع مبتدعاً أو منسوباً إلى مبتدع، وعينوا فيه اللباس والكسوة المعنية، ومع ذلك { يَتَّبِعُونَ ٱلشَّهَوَاتِ } ويبيحون المحرمات، ويرتكبون المنهيات إرادة { أَن تَمِيلُواْ } وتنحرفوا عن جادة التوحيد بأمثال هذه الخرافات والهذيانات { مَيْلاً عَظِيماً } [النساء: 27] وانحرافاً بليغاً لا يستقيم لهم أصلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والله يريد أن يتوب عليكم } كرره توطئة لقوله: { ويريد الذين يتبعون الشهوات أن تميلوا } عن الحق { ميلاً عظيمًا } بموافقتهم على اتباع الشهوات واستحلال المحرمات، وكأنه تعالى يقول: إنا نريد توبتكم ورشدكم، والذين يتبعون الشهوات يريدون ميلكم وإضلالكم، والمراد بهم الزناة لأنهم يودون أن يكون الناس كلهم زناة، وأمَّا من تعاطى شهوة النكاح في الحلال، فإنه متبع للحق لا لهم، وقد قال ـ عليه الصلاة والسلام ـ:\n\n \" تَنَاكَحُوا تَنَاسَلُوا فَإنِّي مُبَاهِ بِكُمُ الأممَ يَوم القِيَامة \" \n\nوقد كان سيدنا علي ـ كرم الله وجهه ـ أزهدَ الصحابة، وكان له أربع حرائر وسبعُ جواري سُرِّيَّاتٍ، وقيل: سبع عشرة، وقيل: المراد بهم اليهود والنصارى، لأن اليهود يُحلون الأقارب من الأب وبنات الأخ وبنات الأخت\n وقيل: المجوس",
      "translations": []
    }
  ]
}