{
  "chapter": "النساء",
  "text": "يريد الله ان يخفف عنكم وخلق الانسن ضعيفا",
  "translations": [
    {
      "translation": "God would like to lighten your burden, for man was created weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah wants to lighten your burdens, for man was created weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God wants to relieve you of your burden; all human beings were created weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah wills to lessen your burden; and man was created weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah wishes to lighten (the burden) for you; and man was created weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah desires that He should make light your burdens, and man is created weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God desires to lighten things for you, for man was created a weakling.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah would make the burden light for you, for man was created weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God wishes to lighten your burdens, for, man has been created weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah intendeth that he shall lighten unto you, and man hath been created weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah desires to lighten your burden, for man was created weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah doth wish to lighten your (difficulties): For man was created Weak (in flesh).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah wishes to lighten (the burden) for you; and man was created weak (cannot be patient to leave sexual intercourse with woman).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah wishes to lighten for you (the jurisprudence), and humans are created weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God intends to lighten your burden, for the human being was created weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah wants to lighten for you [your difficulties]; and mankind was created weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:28] God desires to lighten things for you, and make the rulings of the Law easier for you; for man was created weak, unable to abstain from women and passions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah would make the burden light for you) He wishes to make things easy for you by marrying captives in case of necessity, (for man was created weak) in that he cannot do without women.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يُرِيدُ ٱللَّهُ } المدبر لأحوالكم { أَن يُخَفِّفَ عَنْكُمْ } أيها المؤمنون أثقالكم التي هي سبب احتياجاكم وإمكانكم { وَ } الحال أنه قد { خُلِقَ ٱلإِنسَانُ } في مبدأ الفطرة { ضَعِيفاً } [النساء: 28] لا يحتمل تحمل أثقال الإمكان مثل الحيوانات الأخر\n\n\n\n\nخفض عنا بفضلك ثقل الأوزار، واصرف عنا شر الأشرار بمقتضى جودك وارزقنا عيشة الأبرار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يريد الله أن يخفّف عنكم } فلذلك شرع لكم الشريعة الحنيفية السمحة السهلة، ورخص لكم عند المضايق في نكاح الأمة\n { وخُلق الإنسانُ ضعيفًا } في كل شيء، لأنه خُلق من ضعف، ويؤول إلى ضعف، أسير جَوعة، صريع شبعة، وخصوصًا عن شهوة النساء، فإنه لا يصبر عن الجماع، ولا يكون في شيء أضعفَ منه في أمر النساء، وعن عبادة بن الصامت رضي الله عنه أنه قال: ألا تروني أني لا أقوم إلا رفدًا، ولا آكل إلا ما لُيِّن لي، وقد مات صاحبي ـ يعني ذكره ـ منذ زمان، وما يسرني أني خلوت بامرأة لا تحل لي، وأن لي ما تطلع عليه الشمس، مخافة أن يأتيني الشيطان فيحركه، على أنه لا سمع ولا بصر\n قال ابن عباس: ثماني آيات في سورة النساء، هي خير لهذه الأمة مما طلعت عليه الشمس وغربت، { يُرِيدُ اللهُ لِيُبَيّنَ لَكُمْ } [النساء:26]، { وَاللهُ يُرِيدُ أَن يَتُوبَ عَلَيْكُمْ } [النساء:27]، { يُرِيدُ اللهُ أَن يُخَفِّفَ عَنكُمْ } [النساء:28]،\n\n[النساء:31] الآية،\n\n[النساء:48] الآية،\n\n[النساء:40]،\n\n[النساء:110] الآية،\n\n[النساء:147] الآية\nهـ\n الأشارة: إنما ينزل المريد إلى العلوم الرسمية، أو الأعمال الحسية، إذا خشي الانمحاق أو الاصطلام في بحر الحقائق، وإن صبر وتماسك، حتى يتقوى على حمل أعبائها، فهو خير له، لأن الرجوع إلى الحس، لا يؤمن من الحبس، والله غفور لمن تنزل لعلة ما تقدم، رحيم حين جعل له الرخصة، { يريد الله ليبين لكم } سلوك الطريق إلى عين التحقيق، ويهديكم طرق الوصول، كما هدى مَنْ قبلكم، ويتوب فيما خطر ببالكم، من الفترة أو الوقفة، والله يريد أن يتعطف عليكم، لترجعوا إليه بكليتكم\n\n\nوأهل الغفلة المنهمكون في الشهوات، يريدون ميلكم عن طريق الوصول إلى حضرة ربكم، يرد الله أن يخفف عنكم، فلا يُحملكم من الواردات إلا ما تطيقه طاقتكم، لأنكم ضعفاء إلا إن قوَّاكُم\n اللهم قونا على ما نريد، وأيدنا فيما تريد، إنك على كل شيء قدير\n ولمّا ذكر ما يتعلق بحفظ أموال اليتامى وأموال النساء، وانجر الكلام إلى ما يتعلق بهن من حدودهن، وما يحل وما يحرم منهن، ذكر ما بقي من حفظ أموال الرجال\n\n",
      "translations": []
    }
  ]
}