{
  "chapter": "النساء",
  "text": "يايها الذين ءامنوا۟ لا تاكلوا۟ امولكم بينكم بالبطل الا ان تكون تجرة عن تراض منكم ولا تقتلوا۟ انفسكم ان الله كان بكم رحيما",
  "translations": [
    {
      "translation": "You who have iman! do not consume one another's property by false means, but only by means of",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, you should not usurp unjustly the wealth of each other, but trade by mutual consent; and do not destroy yourselves. God is merciful to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Do not devour one another's possessions wrongfully; rather than that, let there be trading by mutual consent. You shall not kill yourselves. Surely Allah is ever Compassionate to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not exchange your property in wrongful ways unless it is in trade by mutual agreement. Do not kill one another. God is All-merciful to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not unjustly devour the property of each other, except through trade by mutual agreement; and do not kill one another; indeed Allah is Most Merciful upon you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Eat not up your property among yourselves unjustly except it be a trade amongst you, by mutual consent. And do not kill yourselves (nor kill one another). Surely, Allah is Most Merciful to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! do not devour your property among yourselves falsely, except that it be trading by your mutual consent; and do not kill your people; surely Allah is Merciful to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, consume not your goods between you in vanity, except there be trading, by your agreeing together. And kill not one another. Surely God is compassionate to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Squander not your wealth among yourselves in vanity, except it be a trade by mutual consent, and kill not one another. Lo! Allah is ever Merciful unto you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not wrongfully consume each other's wealth, but trade with it by mutual consent. Do not kill one another, for God is most merciful to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! devour not your substance among yourselves unlawfully, but let it be a trading among you by mutual agreement. And slay not yourselves, verily Allah is unto you ever Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not eat up your wealth among yourselves unrightfully, but it should be trade by mutual consent. And do not kill yourselves. Indeed Allah is most merciful to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Eat not up your property among yourselves in vanities: But let there be amongst you Traffic and trade by mutual good-will: Nor kill (or destroy) yourselves: for verily Allah hath been to you Most Merciful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Eat not up your property among yourselves unjustly except it be a trade amongst you, by mutual consent. And do not kill yourselves (nor kill one another). Surely, Allah is Most Merciful to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not consume your wealth among yourselves in falsehood, except there be trading by your mutual agreement. And do not kill yourselves. Allah is the Most Merciful to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not consume each other’s wealth illicitly, but trade by mutual consent. And do not kill yourselves, for God is Merciful towards you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not consume one another's wealth unjustly but only [in lawful] business by mutual consent. And do not kill yourselves [or one another]. Indeed, Allah is to you ever Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:29] O you who believe, consume not your goods between you wrongly, unlawfully according to the Law, through   usury or usurpation, except it be trading (tijāratan, also read tijāratun), so that the goods be from trade effected, through mutual agreement, through mutual good-will: such [goods] you may consume. And kill not yourselves, by committing what leads towards destruction on account of some affiliation, be it in this world or the Hereafter. Surely God is ever Merciful to you, when He forbids you such things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe! Squander not your wealth among yourselves in vanity) through transgression, usurpation, false testimony, lying in oath or through other unlawful means, (except it be a trade by mutual consent) except if there is mutual agreement between you in the course of buying and selling or in abating the price in selling (Muhabat), (and kill not one another) without justified right. (Lo! Allah is ever Merciful unto you) when He forbade you to kill one another without such a justification.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم نبه سبحانه على المؤمنين بما يتعلق بأمور معاشهم مع بني نوعهم؛ ليهذبوا به ظاهرهم، فقال منادياً لهم ليهتموا باستماعها وامتثالها: { يَٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } بالله ورسله وكتبه عليكم أن { لاَ تَأْكُلُوۤاْ أَمْوَٰلَكُمْ بَيْنَكُمْ } أي: بعضكم مال بعض بلا رخصةٍ شرعية بل { بِٱلْبَٰطِلِ } ظلماً وزوراً سواء كانت سرقةً أو غصباً، أو حيلةً منسوبة إلى الشرع افتراءً أو رباً أو تلبيساً وتشيخاً كما يفعله المتشيخة، ويأخذون بسببها حطاماً كثيرة من ضعفاء المؤمنين، واعلموا أيها المؤمنون أن مال المؤمن على المؤمن في غير العقود المتبرعة حرام { إِلاَّ أَن تَكُونَ تِجَٰرَةً } معاملة ومعاوضة حاصلة { عَن تَرَاضٍ } مراضاة { مِّنْكُمْ } منبعثة عن اطمئنان نفوسكم عليها بلا اضطرار وغرر\n\n\n\n\n{ وَلاَ تَقْتُلُوۤاْ أَنْفُسَكُمْ } ولا تلقوها بأيديكم في المهالك التي جرت بين أرباب المعاملات من الربا والخداع والتغرير والتلبيس وغير ذلك من أنواع الحيل؛ حتى لا تنحطوا عن مرتبتكم الأصلية ومنزلتكم الحقيقية التي هي مرتبة العدالة؛ إذ لا خسران أعظم من الحرمان منها - أدركنا بلطفك يا خفي الألطاف - { إِنَّ ٱللَّهَ } المنبه عليكم بأمثال هذه التدبيرات الصادرة عن محض الحكمة والمصلحة { كَانَ بِكُمْ رَحِيماً } [النساء: 29] مشفقاً عليكم، مريداً إيصالكم إلى ما خلقكم لأجله وأوجدكم لحصوله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ يَاأَيُّهَا الَّذِينَ آمَنُواْ لاَ تَأْكُلُواْ أَمْوَالَكُمْ بَيْنَكُمْ بِالْبَاطِلِ إِلاَّ أَن تَكُونَ تِجَارَةً عَن تَرَاضٍ مِّنْكُمْ\n\n\n }  قلت: الاستثناء منقطع، وكان تامة لمن رفَع، وناقصه لمن نصب، واسمها: ضمير الأموال، على حذف مضاف، إلاَّ أن تكون الأموال أموالَ تجارة\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا لا تأكلوا أموالكم بينكم بالباطل } الذي لا تُجوزه الشريعة، كالربا والقمار، والغصب والسرقة، والخيانة والكهانة والسحر وغير ذلك { إلا أن تكون } ، أي: لكن إن وجدت { تجارة } صحيحة { عن تراضٍ منكم } أي: اتفاق منكم على البيع، وبه استدلت المالكية على انعقاد البيع بالعقد ولو لم يحصل تفرق بالأبدان\n وقال الشافعي: إنما يتم بالتفرق بالأبدان، لقوله ـ عليه الصلاة والسلام ـ:\n\n \" البَيِّعَان بالخِيَار مَا لَمْ يتَفَرَّقَا \" \n\nوحمله مالك على التفرق بالكلام، وقال أكثر المفسرين: التخيير، هو أن يُخير كلُ واحد منهما صاحبة بعد عقد البيع، وقد ابتاع عمرو بن جرير فرسًا، ثم خَيَّر صاحبه بعد البيع، ثم قال: سمعت أبا هريرة يقول: البيع عن تراض\n قال البيضاوي: وتخصيص التجارة من الوجوه التي يحل بها انتقال مال الغير، لأنها أغلب وأوفق لذوي المروءات، ويجوز أن يُراد بها الانتقال مطلقًا\n وقيل: المقصود بالنهي: صرف المال فيما لا يرضاه الله تعالى، وبالتجارة: صرفه فيما يرضى\n هـ\n الإشارة: لا تصرفوا أموالكم ولا أحوالكم في غير ما يُقربكم إلى الحق فإن ما سوى الحق كله باطل، كما قال الشاعر:\n\nإلا أن يكون صرفه في تجارة رابحة، تقربكم من الحبيب، وتجلبُكم إلى حضرة القريب، فتلك تجارة رابحة وصفقة نافعة\n والله تعالى أعلم\n ثم تكلم على بعض ما يتعلق بحفظ الأبدان، وسيأتي تمامه في قوله:\n\n[النساء:92] إلى آخر الآيات، فقال: {\n\n\nوَلاَ تَقْتُلُواْ أَنْفُسَكُمْ إِنَّ اللَّهَ كَانَ بِكُمْ رَحِيماً وَمَن يَفْعَلْ ذلِكَ عُدْوَاناً وَظُلْماً فَسَوْفَ نُصْلِيهِ نَاراً وَكَانَ ذلِكَ عَلَى اللَّهِ يَسِيراً }  يقول الحقّ جلّ جلاله: { ولا تقتلوا أنفسكم } ، بالخنق أو بالنخع أو بالجرح، الذي يؤدي إلى الموت، أو بالإلقاء إلى التهلكة\n وعن عمرو بن العاص رضي الله عنه قال:  بعثني رسول الله صلى الله عليه وسلم في غَزوة ذَات السَّلاَسِلِ، فأجنَبتُ في لَيْلَة بَارِدَة، فَأشْفَقْتُ على نفسي وصَليْتُ بأصحَابِي صَلاة الصُبح بالتيمم\n فلَمّا قَدِمتُ ذَكَرتُ ذلك لرسول الله صلى الله عليه وسلم، فقال:\n\n \" يا عَمرُو صلَّيتَ بأصحَابِكَ وأنت جُنُب؟ \" \n\nقلت: نعم يا رسول الله، أشفيتُ إن اغتسلتُ أن أهلك، فذكرت قوله تعالى: { لا تقتلوا أنفسكم إن الله كان بكم رحيمًا } ، فضحك النبي صلى الله عليه وسلم، ولم يقل شيئاً\n أو: ولا تقتلوا إخوانكم في الإسلام، فإن المؤمنين كنفس واحدة\n\n\nقال البيضاوي: جمع في التوصية بين حفظ النفس والمال ـ الذي هو شقيقها من حيث إنه سبب قوامها ـ استبقاء لهم\n هـ\n وإنما نهاكم عن قتل أنفسكم رأفة، ورحمة بكم، { إن الله كان بكم رحيمًا } ، فقد أمر بني إسرائيل بقتل أنفسهم، وأنتم نهاكم عنه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "61:10",
      "similarity": 0.5074915175992118
    },
    {
      "verse": "24:37",
      "similarity": 0.4363324123760703
    },
    {
      "verse": "62:11",
      "similarity": 0.42538033128938235
    },
    {
      "verse": "35:29",
      "similarity": 0.34394371351627295
    },
    {
      "verse": "47:33",
      "similarity": 0.28453515673373286
    }
  ]
}