{
  "chapter": "النساء",
  "text": "ومن يفعل ذلك عدونا وظلما فسوف نصليه نارا وكان ذلك على الله يسيرا",
  "translations": [
    {
      "translation": "As for anyone who does that out of enmity and wrongdoing, We will roast him in a Fire. That is an easy",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If someone does so through oppression or injustice, We shall cast him into Hell: This is how (the Law of) God works inevitably.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does this by way of transgression and injustice him shall We surely cast into the Fire; that indeed is quite easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever commits murder out of animosity and injustice will be burnt in hell fire. This is a very easy thing for God to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does that through injustice and oppression, We shall soon put him in the fire; and this is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever commits that through aggression and injustice, We shall cast him into the Fire, and that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does this aggressively and unjustly, We will soon cast him into fire; and this is easy to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whosoever does that in transgression and wrongfully, him We shall certainly roast at a Fire; and that for God is an easy matter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso doeth that through aggression and injustice, we shall cast him into Fire, and that is ever easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If anyone does these things through transgression and injustice, We shall cast him into the Fire; and that is easy for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever doth that in transgression- and wrong, presently We shall roast him in Fire; and with Allah that is ever easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does that in aggression and injustice, We will soon make him enter the Fire, and that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any do that in rancour and injustice,- soon shall We cast them into the Fire: And easy it is for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever commits that through aggression and injustice, We shall cast him into the Fire, and that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whosoever does that in transgression and wrongfully We shall roast him in the Fire. That is an easy matter for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever does that, out of hostility and wrongdoing, We will cast him into a Fire. And that would be easy for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever does that in aggression and injustice - then We will drive him into a Fire. And that, for Allah, is [always] easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:30] And whoever does that, which he has been forbidden, through aggression (‘udwānan, a circumstantial qualifier), transgressing what is lawful, and injustice (zulman, [reiterated] for emphasis), him We shall certainly expose, admit, to a fire, wherein he shall burn; and that for God is an easy matter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whoso doeth that) killing another or wrongfully taking another person's property (through aggression and injustice, We shall cast him into Fire) in the Hereafter; this is a threat to such a person, (and that) casting him into the Fire and tormenting him (is ever easy for Allah).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَن يَفْعَلْ ذٰلِكَ } أي: ما يحذر عنه من المهالك ويمقت نفسه بالعرض عليها لا عن جهل ساذج بل عن جهل مركب اعتقدها حقاً { عُدْوَاناً } مجاوزاً مائلاً عن الحق إصراراً { وَظُلْماً } خروجاً وميلاً عن طريق الشرع الموضح سبيل التوحيد { فَسَوْفَ } ننتقم عنه يوم الجزاء { نُصْلِيهِ } ندخله { نَاراً } حرماناً دائماً عن ساحة عز الحضور وطرداً سرمدياً عن فضاء السرور، بك نعتصم يا ذا القوة المتين { وَ } لا تغفلوا أيها المنهمكون للاقتحام في المهالك المتعلقة لأمر المعاش عن انتقام الله القادر القدير الغيور إياكم، ولا تعتقدوا عسره بالنسبة إليه؛ إذ { كَانَ ذٰلِكَ } الانتقام عن تلك الآثام { عَلَى ٱللَّهِ } الميسر لكل عسير { يَسِيراً } [النساء: 30] وإن استعسرتم في نفوسكم؛ إذ لا راد لإرادته ولا معقب لحكمه، يفعل ما يشاء ويحكم ما يريد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن يفعل ذلك } القتل\n أو جميع ما سبق من المحرمات { عدوانًا وظلمًا } ، أي: إفراطًا في التجاوز عن الحد، وإتيانًا بما لا يستحق، أو تعديًا على الغير وظلمًا على النفس، بتعريضها للعقاب، { فسوف نصليه نارًا } أي: نحرقه ونشويه فيها\n { وكان ذلك على الله يسيرًا }\n وفي الحديث عنه صلى الله عليه وسلم:\n\n \" مَن قَتَل نفسَهُ بِشَيءٍ عُذِبَ في نَارِ جَهَنَّمَ خَالِدًا مُخَلَّدًا فِيهَا \" \n\nوهو تغليظ، أو لمن استحل ذلك\n وهذا الوعيد الذي ذكره الحق هنا في قتل الإنسان بيده، أهون مما ذكره في قتل الغير، الذي يأتي، لأنه زاد هناك الغصب واللعنة والعذاب العظيم، أما قول ابن عطية: إنه أجمع المفسرون أن هذه الآية في قتل بعضهم بعضًا، فليس بصحيح، والله تعالى أعلم\n الإشارة: ولا تقتلوا أنفسكم باتباع الشهوات وتراكم الغفلات، فإنه يفوتها الحياة الحقيقية، وقال الفضيل بن عياض رضي الله عنه:  لا تغفلوا عن حظ أنفسكم، فمن غفل عن حظ نفسه، فكأنما قتلها\n وحظ النفس هو تزكيتها وتحليتها بالكمالات، أو قُوتها من العلم اليقين، والمعرفة وصحة التمكين، والمراد بالنفس هذا الروح، وأما ما اصطلحت عليه الصوفية من أن النفس يجب قتلها، فإن مرادهم بذلك النفس الأمارة، فإن الروح ما دامت مُظلمة بالمعاصي والهوى سميت نفسًا، فإذا تطهرت وتزكت سميت روحًا\n وهو المراد هنا\n سماها نفسًا باعتبار ما كانت عليه\n والله تعالى أعلم\n\n",
      "translations": []
    }
  ]
}