{
  "chapter": "النساء",
  "text": "ان تجتنبوا۟ كبائر ما تنهون عنه نكفر عنكم سيـاتكم وندخلكم مدخلا كريما",
  "translations": [
    {
      "translation": "If you avoid the serious wrong actions you have been forbidden, We will erase your bad actions from you and admit you by a Gate of Honour.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you keep away from the deadly sins that have been forbidden, We shall efface your faults, and lead you to a place of honour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if you avoid the major sins which you have been forbidden, We shall remit your (trivial) offences, and cause you to enter an honourable abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you avoid violating that which has been prohibited, your (lesser) sins will be forgiven and you will be admitted into an exalted dwelling.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you keep avoiding the cardinal sins that are forbidden to you, We will forgive you your other (lesser) sins and admit you into a noble place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you avoid the great sins which you are forbidden to do, We shall remit from you your (small) sins, and admit you to a Noble Entrance (i.e. Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you shun the great sins which you are forbidden, We will do away with your small sins and cause you to enter an honorable place of entering.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you avoid the heinous sins that are forbidden you, We will acquit you of your evil deeds, and admit you by the gate of honour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye avoid the great (things) which ye are forbidden, We will remit from you your evil deeds and make you enter at a noble gate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you shun the great sins you have been forbidden, We shall cancel out your minor misdeeds and admit you to a place of honour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye shun the grievous sins from which ye are prohibited, We shall expiate from you your misdeeds, and make you enter a noble Entrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you avoid the major sins that you are forbidden, We will absolve you of your misdeeds and admit you to a noble abode.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye (but) eschew the most heinous of the things which ye are forbidden to do, We shall expel out of you all the evil in you, and admit you to a gate of great honour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you avoid the great sins which you are forbidden to do, We shall remit from you your (small) sins, and admit you to a Noble Entrance (i.e. Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you avoid the major sins that are forbidden to you, We shall pardon your evil deeds and admit you by an entrance of honor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you avoid the worst of what you are forbidden, We will remit your sins, and admit you by a Gate of Honor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you avoid the major sins which you are forbidden, We will remove from you your lesser sins and admit you to a noble entrance [into Paradise].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:31] If you avoid the grave sins that are forbidden you, those for which the threat of punishment has been prescribed, like murder, fornication or theft — according to Ibn ‘Abbās, these number as much as seven hundred — We will absolve you of your, minor, evil deeds, on account of your acts of obedience, and admit you by an honourable gate (read mudkhalan or madkhalan), that is, [by an honourable] admittance or location, namely, Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاعتراض ناسب ذكره بعد ذكر ذنبين كبيرين : وهما قتل النفس ، وأكل المال بالباطل ، على عادة القرآن في التفنّن من أسلوب إلى أسلوب ، وفي انتهاز الفرص في إلقاء التشريع عقب المواعظ وعكسه .وقد دلّت إضافة { كبائر } إلى { ما تنهون عنه } على أنّ المنهيات قسمان : كبائر ، ودونها؛ وهي التي تسمّى الصغائر ، وصفا بطريق المقابلة ، وقد سمّيت هنا سيّئات . ووعد بأنّه يغفر السيّئات للذين يجتنبون كبائر المنهيات ، وقال في آية النجم ( 32 ) { الذين يجتنبون كبائر الإثم والفواحش إلا اللّمم } فسمّى الكبائر فواحشَ وسمّى مقابلها اللَّمم ، فثبت بذلك أنّ المعاصي عند الله قسمان : معاص كبيرة فاحشة ، ومعاص دون ذلك يكثر أن يُلمّ المؤمن بها ، ولذلك اختلف السلف في تعيين الكبائر . فعن علي : هي سبع الإشراك بالله ، وقتل النفس ، وقذف المحصنات ، وأكل مال اليتيم ، والفرار يوم الزحف ، والتعرّب بعد الهجرة . واستدلّ لجميعها بما في القرآن من أدلّة جازِمِ النهي عنها . وفي حديث البخاري عن النبي صلى الله عليه وسلم « اتّقوا السبع الموبقات . . . » فذكر التي ذكرها عليّ إلاّ أنّه جعل السحر عوض التعرّب . وقال عبد الله بن عمر : هي تسع بزيادة الإلحاد في المسجد الحرام ، وعقوق الوالدين . وقال ابن مسعود : هي ما نُهي عنه من أول سورة النساء إلى هنا . وعن ابن عبّاس : كلّ ما ورد عليه وعيد نار أو عذاب أو لعنة فهو كبيرة . وعن ابن عباس : الكبائر ما نهى الله عنه في كتابه . وأحسن ضبطِ الكبيرة قول إمام الحرمين : هي كلّ جريمة تؤذن بقلّة اكتراث مرتكبها بالدين وبضعف ديانته . ومن السلف من قال : الذنوب كلّها سواء إن كانت عن عمد . وعن أبي إسحاق الإسفرائيني أنّ الذنوب كلّها سواء مطلقاً ، ونفَى الصغائر . وهذان القولان واهيان لأنّ الأدلّة شاهدة بتقسيم الذنوب إلى قسمين ، ولأنّ ما تشتمل عليه الذنوب من المفاسد متفاوت أيضاً ، وفي الأحاديث الصحيحة إثبات نوع الكبائر وأكبر الكبائر .ويترتّب على إثبات الكبائر والصغائر أحكام تكليفية : منها المخاطبة بتجنّب الكبيرة تجنّبا شديداً ، ومنها وجوب التوبة منها عند اقترابها ، ومنها أنّ ترك الكبائر يعتبر توبة من الصغائر ، ومنها سلب العدالة عن مرتكب الكبائر ، ومنها نقض حكم القاضي المتلبّس بها ، ومنها جواز هجران المتجاهر بها ، ومنها تغيير المنكر على المتلبّس بها . وتترتّب عليها مسائل في أصول الدين : منها تكفير مرتكب الكبيرة عند طائفة من الخوارج ، التي تَفرّق بين المعاصي الكبائر والصغائر؛ واعتباره منزلة بين الكفر والإسلام عند المعتزلة ، خلافاً لجمهور علماء الإسلام . فمن العجائب أن يقول قائل : إنّ الله لم يميّز الكبائر عن الصغائر ليكون ذلك زاجراً للناس عن الإقدام على كلّ ذنب ، ونظير ذلك إخفاء الصلاة الوسطى في الصلوات ، وليلة القدر في ليالي رمضان ، وساعة الإجابة في ساعات الجمعة ، هكذا حكاه الفخر في التفسير ، وقد تبيّن ذهول هذا القائل ، وذهول الفخر عن ردّه ، لأنّ الأشياء التي نظَّروا بها ترجع إلى فضائل الأعمال التي لا يتعلّق بها تكليف؛ فإخفاؤها يقصد منه الترغيب في توخّي مَظانّها ليكثر الناس من فعل الخير ، ولكن إخفاء الأمر المكلّف به إيقاع في الضلالة ، فلا يقع ذلك من الشارع .والمدخل بفتح الميم اسم مَكان الدخول ، ويجوز أن يكون مصدراً ميمياً . والمعنى : ندخلكم مكانا كريماً ، أو ندخلكم دخولاً كريماً . والكريم هو النفيس في نوعه . فالمراد إمّا الجنة وإمّا الدخول إليها ، والمراد به الجَنّة . والمُدخل بصمّ الميم كذلك مكانُ أو مَصدرُ أدْخل . وقرأ نافع ، وأبو جعفر : مَدْخلا بفتح الميم وقرأ بقية العشرة بضمّ الميم .\n\n",
      "translations": [
        {
          "translation": "(If you avoid the great (things) which ye are forbidden) in this surah, (We will remit from you your evil deeds) We will forgive you your sins which are not included among the enormities: the minor sins committed between the period separating a congregational prayer from another, those sins committed in the period separating one Friday Prayer from another, as well as those sins committed in the period separating one month of Ramadan from another, (and make you enter) in the Hereafter (at a noble gate) Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنْ تَجْتنبوا كبائرَ ما تُنْهَون عنه } من إثبات الغير في الوجود الذي هو الشرك ذاتاً وصفة وفعلاً\n فإن أكبر الكبائر إثبات وجود غير وجوده تعالى كما قيل:\nثم إثبات الإثنينية في الذات بإثبات زيادة الصفات عليها\n كما قال أمير المؤمنين عليه السلام\n وكما قال: \" الإخلاص له نفي الصفات عنه \"\n { نكفر عنكم سيئاتكم } بظهور النفس والقلب بصفة من صفاتها أحياناً\n فإنها بعد ظهور نور التوحيد لا تثبت { ونُدْخِلكم مدْخلاً كَرِيماً } أي: حضرة عين الجمع لا كرم إلا فيها { ولا تتمنوا ما فضّل الله به بعضكُم على بَعض } من الكمالات المرتبة بحسب الاستعدادات الأولية\n فإن كل استعداد يقتضي بهويته في الأزل كمالاً وسعادة تناسبه\n وحصول ذلك الكمال الخاصّ لغيره محال",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه امتناناً على المؤمنين\n تفضلاً وإشفاقاً وجذباً من جانبه: { إِن تَجْتَنِبُواْ } وتجوزوا أيها المحبوسون في مهادي الإمكان ومضيق الحدثان { كَبَآئِرَ } أعاظم { مَا تُنْهَوْنَ عَنْهُ } وهي الشرك بالله بأنواعه من إثبات الوجود لغيره\n وإسناد الحوادث إلى الأسباب وغير ذلك { نُكَفِّرْ } نمحو ونتجاوز { عَنْكُمْ } تفضلاً عليكم { سَيِّئَـٰتِكُمْ } خطاياكم اللاحقة لنفوسكم من لوازم بشريتكم ومقتضى طبيعتكم { وَ } بعدما غفرناكم { نُدْخِلْكُمْ } بمحض جودنا ولطفنا { مُّدْخَلاً كَرِيماً } [النساء: 31] هو فضاء التوحيد الذي ليس فيه هوةاء ولا ماء ولا غدو ولا مساء\n بل فيها إفناء وبقاء ولقاء\n لا يذوقون فيها الموت إلا الموتة الأولى\n\n\nوفقنا بكرمك وجودك لما تحبه عنا وترضى\n\n\n{ وَ } من مقتضى إيمانكم أيها المؤمنون المحمديون المتوجهونن نحو توحيد الذات من محجة الفناء والرضا بما نفذ عليه القضاء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: المدخل ـ بالضم: مصدر، بمعنى الإدخال، وبالفتح: المكان، ويحتمل المصدر. يقول الحقّ جلّ جلاله: إن تجتنبوا كبائر الذنوب التي تُنهون عنها { نكفر عنكم سيئاتكم } الصغائر { وندخلكم مُدْخلاً كريمًا } وهو الجنة، أو إدخالاً مصحوبًا بالكرامة والتعظيم، واختلف في الكبائر، هل تعرف بالعد أو بالحد؟ فقيل: سبع، وقيل: سبعون، وقيل: سبعمائة، وقيل: كل معصية فهي كبيرة. عنه صلى الله عليه وسلم أنه قال\n \" اجتَنِبُوا السَّبعَ المُوبِقَاتِ: الإشراك باللهِ، والسَّحرَ، وقَتلَ النَّفس بغير حقها، وأكلَ الرَبّا، وأكلَ مَالِ اليَتِيمِ، والفرار مِن الزَّحفِ، ورَمي المُحصنَاتٍ الغَافِلاتِ المُؤمِنَاتِ \". \nقال ابن جزي: لا شك أن هذه مِنَ الكبائر لنص الشارع عليها، وزاد بعضهم عليها أشياء ورد النص عليها في الحديث أنها من الكبائر، منها عقوق الوالدين، وشهادة الزور، واليمين الغموس، والزنا، والسرقة، وشرب الخمر، والنهبة، والقنوط من رحمة الله، والأمن من مكر الله، ومنع ابن السبيل الماء، والإلحاد في البيت الحرام، والنميمة، وترك التحرّز من البول، والغلول، واستطالة الرجل في عرض أخيه، والجور في الحكم. وقيل في حدّها: كل جريمة تؤذن بقلة الدين ورقة الديانة، وقيل: ذنوب الظاهر صغائر، وذنوب الباطن كبائر. وقيل: كل ما فيه حق الغير فهو كبائر، وما كان بينك وبين الله تعالى صغائر، واحتج هذا بقوله ـ عليه الصلاة والسلام ـ:\n \" يُنَادِي يومَ القيامة مناد من بُطنان العرش: يا أمّة أحمد، إنّ الله تعالى يقول: أمَّا ما كان لي قِبلَكُمُ فقد وهبتهُ لكم، وبقيت التباعات، فَتواهبُوها، وادخلوا الجنة \". \nالأشارة: كل ما يُبعد العبد عن حضرة ربه فهو من أكبر الكبائر، فمن اجتنب ذلك واتقى كل ما يشغله عن الله أدخله الله مدخلاً كريمًا، وهو حضرة الشهود والتلذذ برؤية المعبود، والترقي في أسرار الحبيب الودود. قال الورتجبي: قال أبو تراب: أمر الله باجتناب الكبائر، وهي الدعاوى الفاسدة، والإشارات الباطلة، وإطلاق اللفظ بغير الحقيقة. هـ.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "92:17",
      "similarity": 0.44477886044013126
    },
    {
      "verse": "69:40",
      "similarity": 0.3528384661659831
    },
    {
      "verse": "81:19",
      "similarity": 0.3528384661659831
    },
    {
      "verse": "82:11",
      "similarity": 0.3455935155925959
    },
    {
      "verse": "70:35",
      "similarity": 0.3367878403535632
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004031.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004031.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:31.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}