{
  "chapter": "النساء",
  "text": "ولا تتمنوا۟ ما فضل الله به بعضكم على بعض للرجال نصيب مما اكتسبوا۟ وللنساء نصيب مما اكتسبن وسـلوا۟ الله من فضله ان الله كان بكل شىء عليما",
  "translations": [
    {
      "translation": "Do not covet what God has favoured some with more than He has some others. Men have a share in what they earn, and women have theirs in what they earn. Ask God for His favours. Surely God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not covet what Allah has conferred more abundantly on some of you than others. Men shall have a share according to what they have earned, and women shall have a share according to what they have earned. Do ask of Allah His bounty. Allah has full knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not envy the favors which God has granted to some of you. Men and women will both be rewarded according to their deeds, rather pray to God for His favors. God knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not long for things by which Allah has given superiority to some of you over others; for men is the share of what they earn; and for women the share from what they earn; and seek from Allah His munificence; indeed Allah knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And wish not for the things in which Allah has made some of you to excel others. For men there is reward for what they have earned, (and likewise) for women there is reward for what they have earned, and ask Allah of His bounty. Surely, Allah is Ever All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not covet that by which Allah has made some of you excel others; men shall have the benefit of what they earn and women shall have the benefit of what they earn; and ask Allah of His grace; surely Allah knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not covet that whereby God in bounty has preferred one of you above another. To the men a share from what they have earned, and to the women a share from what they have earned. And ask God of His bounty; God knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And covet not the thing in which Allah hath made some of you excel others. Unto men a fortune from that which they have earned, and unto women a fortune from that which they have earned. (Envy not one another) but ask Allah of His bounty. Lo! Allah is ever Knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not covet the bounties which God has bestowed more abundantly on some of you than on others. Men shall be rewarded according to their deeds, and women shall be rewarded according to their deeds. You should rather ask God for His bounty. God has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And long not for that wherewith Allah hath preferred one of you above anot her Unto men shall be the portion of that which they earn, and unto women shall be the portion of that which they earn. And ask Allah for some of His grace, verily Allah is of everything Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not covet the advantage, which Allah has given some of you over others. To men belongs a share of what they have earned, and to women a share of what they have earned. And ask Allah for His bounty. Indeed Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in no wise covet those things in which Allah Hath bestowed His gifts More freely on some of you than on others: To men is allotted what they earn, and to women what they earn: But ask Allah of His bounty. For Allah hath full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And wish not for the things in which Allah has made some of you to excel others. For men there is reward for what they have earned, (and likewise) for women there is reward for what they have earned, and ask Allah of His Bounty. Surely, Allah is Ever All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not wish for the bounty which Allah has preferred one of you above another. For men is a share of what they earn, and for women is a share of what they earn. Ask Allah of His Bounty. Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not covet what God has given to some of you in preference to others. For men is a share of what they have earned, and for women is a share of what they have earned. And ask God of his bounty. God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not wish for that by which Allah has made some of you exceed others. For men is a share of what they have earned, and for women is a share of what they have earned. And ask Allah of his bounty. Indeed Allah is ever, of all things, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:32] Do not covet that in which God has preferred some of you above others, in the way of worldly affairs or religion, lest it lead to mutual envy and hatred. To men a share from, a reward for, what they have earned, for their acts in the struggle and so on, and to women a share from what they have earned, by way of being obedient to their spouses and guarding their private parts: this was revealed when Umm Salama said: ‘Would that we were men, so that we could join the struggle and receive the reward they receive!’ And ask (read wa-s’alū or wa-salū) God of His bounty, what you need and He will give it to you; God is ever Knower of all things, including where merit is deserved and that for which you ask.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And covet not the thing in which Allah hath made some of you excel others) Allah says: a man should not covet the wealth, mount or wife of his brother nor, in fact, anything that his brother may possess. Rather you should ask of Allah abundant bounty and say: \"0 Allah provide us with the like of, or better than, what you have provided him with\", while consigning the matter to Allah. It is also said that this verse was revealed about Umm Salamah, the wife of the Prophet (pbuh) because she said to him: \"if only it is 87 prescribed unto us as it is prescribed unto men so that we get rewarded as men do\". Allah prohibited such talk, saying: covet not the thing in which Allah has made a group of you excel over others, such as praying in congregation, attending the Friday Prayer, participating in military expeditions, jihad, enjoining good and forbidding evil. In this verse (some of you) and (others) refers to men and women. Allah then explained the reward that men and women earn for their works, saying: (Unto men a fortune) a reward (from that which they have earned) of works of goodness, (and unto women a fortune) a reward (from that which they have earned) of works of goodness in their homes. (But ask Allah of His bounty) Ask Allah to give you success and protection. (Lo! Allah is ever Knower of all things) good and bad, reward and punishment, success and otherwise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ولذلك ذكر بلفظ التمني الذي هو طلب ما يمتنع حصوله للطالب لامتناع سببه { للرّجال } أي: الأفراد الواصلين { نصيبٌ مما اكْتسبوا } بنور استعدادهم الأصليّ { وللنساء } أي: الناقصين القاصرين عن الوصول { نصيبٌ مما اكْتَسبن } بقدر استعدادهنّ { واسْألوا الله من فَضْله } أي: اطلبوا منه إفاضة كمال يقتضيه استعدادكم بالتزكية والتصفية حتى لا يحول بينكم وبينه فتحتجبوا وتتعذبوا بنيران الحرمان منه { إنّ الله كان بكل شيءٍ } مما يخفى عليكم، كامناً في استعدادكم بالقوّة { عَلِيماً } فيجيبكم بما يليق بكم كما قال:\n\n[إبراهيم، الآية: 34] أي: بلسان الاستعداد الذي ما دعاه أحد به إلاّ أجاب، كما قال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من مقتضى إيمانكم أيها المؤمنون المحمديون المتوجهونن نحو توحيد الذات من محجة الفناء والرضا بما نفذ عليه القضاء، فعليكم أن { لاَ تَتَمَنَّوْاْ } تمني المتحسر المتأسف حصول { مَا فَضَّلَ ٱللَّهُ بِهِ } في النشأة الأولى { بَعْضَكُمْ عَلَىٰ بَعْضٍ } من الجاه ولمال والمكانة الرفيعة في عالم الصورة؛ إذ هي ابتلاء واختبار لهم وفتنة تبعدهم عن طريق الفناء، وتوقعهم في التكثر والتشتت، والموحدون المحمديون لا بد له أن يقتفوا أثر نبيهم صلى الله عليه وسلم في ترك الدنيا وعدم الالتفات نحوها إلا ستر عورة وسد جوعة؛ إذ الإضافة والتمليك مطلقاً مخل بالتوحيد، والغنى المطغي جالب للعذاب الأخروي\n\n\n\n\nربنا اصرف عنا عذاب جهنم إن عذاباها كان غراماً\n\n\n\n\nواعملوا أيها المحمديون السالكون سبيل الفناء لتفوزوا بجنة البقاء أن لكم عند ربكم درجات ومداخل متفاوتة بتفاوت استعداداتكم المترتبة على ترتيب الأسماء والصفات الإلهية؛ إذ { لِّلرِّجَالِ } أي: للذكور الكمل لكل منكم على تفاوت طبقاتهم { نَصِيبٌ } حظ من التوحيد الذاتي هو مقرهم وغاية مقصدهم حاصل لهم { مِّمَّا ٱكْتَسَبُواْ } من الرياضات والمجاهدات المعدة لفيضان المكاشفات والمشاهدات { وَ } كذا { لِلنِّسَآءِ } منكم مع تفاوت طبقاتهن { نَصِيبٌ مِّمَّا ٱكْتَسَبْنَ } في تلك الطريق؛ إذ كل ميسر لما خلق له وعليكم التوجه نحو مقصدكم { وَٱسْأَلُواْ ٱللَّهَ مِن فَضْلِهِ } يا عباده لييسر لكم ما يعينكم ويجنبكم عما لا يعنيكم ويغويكم { إِنَّ ٱللَّهَ } الميسر لأمور عباده { كَانَ بِكُلِّ شَيْءٍ } مما صدر عنهم من صلاح وفساد { عَلِيماً } [النساء: 2] بعلمه الحضروري، يصلح لهم وييسر عليهم الهدى بقدر استعداداتهم وقابلياتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ولا تتمنوا ما فضَّل الله به } من الميراث { بعضكم على بعض } ، كتضعيف الذكر على الأنثى، فللرجال { نصيب مما اكتسبوا } أي: مما أصابوا وأحرزوا في القسمة، { وللنساء نصيب مما اكتسبن } منه، قلَّ أو كثر، فلتقنع بما قسم الله لها، ولا تعترض على أحكام الشريعة، ولكن { اسألوا الله من فضله } يُعطكم من غير الميراث، هكذا فسرها ابن عباس\n وقال مجاهد: قالت أُم سلمة: يغزو الرجال ولا نغزو، فليتنا رجال نغزو، ونبلغ ما يبلغ الرجال\n فنزلت\n فيكون المعنى: ولا تتمنوا ما فضل اللهُ به الرجال على النساء كالغزو وغيره، فللرجال نصيب مما اكتسبوا من ثواب الجهاد وسائر أعمالهم، { وللنساء نصيب مما اكتسبن } من طاعة أزواجهن وحفظ فروجهم وسائر بقية أعمالهن\n والتحقيق أنها عامة في جميع المراتب الدينية والدنيويه لأن ذلك ذريعة إلى التحاسد والتعادي، ومعربة عن عدم الرضا بما قسم الله له، وإلى التشهي لحصول الشيء له من غير طلب، وهو مذموم لأن تمنّي ما لم يقدر له، معارضة لحِكمة القدر، وتمنّي ما قدر له بكسب، بطالة وتضييع حظ، وتمنّي ما قدر له بغير كسب، ضياع ومحال، قاله البيضاوي\n فللرجال نصيب من أجل ما اكتسبوا من الأعمال، وتحملوا من المشاق، فيعطيهم الله على قدر ما اكتسبوا { وللنساء نصيب مما اكتسبن } كذلك، فلا فائدة في تمني ما للناس، ولكن { اسألوا الله من فضله } يُعطكم مثله، أو أكثر من خزائنه التي لا تنفذ\n { إن الله كان بكل شيءٍ عليمًا } وهو يعلم ما يستحقه كل إنسان، فيُفَضِّل من شاء بما شاء عن علم وبيان، ومناسبة الآية حينئِذ لما قبلها: أن تجنب الكبائر فضل من الله ونعمة، وهو أفضل ممن يقع فيها، لكن لا ينبغي تمني ذلك من غير عمل، ولكن يسأل الله من فضله حتى يُلحقه بأهل العصمة\n وبالله التوفيق\n الإشارة: قد وقع التفضيل في مقامات الأولياء كالأنبياء، لكن لا ينبغي تعيين الفاضل من المفضول، لِما يؤدي إليه من التنقيص فيؤدي إلى الغيبة، والتفضيل يقع بزيادة اليقين وصحة التمكين، والترقي في أنوار التوحيد وأسرار التفريد\n يكون أيضًا بهداية الخلق على يده، وظهور إحسانه ورفده، فإذا رأى العبدُ أنه لم يبلغ إلى مقام غيره فلا يتمنى ذلك المقام بعينه، فقد يكون مقامه عند الله في عمله أعظم، وقد يكون أدون، فيُسيء الأدب، فالخير كله في العبودية والرضى بأحكام الربوبية، فللأقوياء نصيب مما اكتسبوا بالقوة والمجاهدة التي خلق الله فيهم، حكمةً وفضلاً، وللضعفاء نصيب مما اكتسبوا قسمة وعدلاً، ولكن يسأل الله من فضله العظيم، فإن الله بكل شيء عليم، فقد يُعطى بلا سبب ويُبَلِّغ بلا تعب\n وفي الحديث عنه صلى الله عليه وسلم أنه قال:\n\n \" سَلُوا الله مِن فَضلِهِ فَإنَّ اللهَ يُحِبُ أن يُسألَ \" \n\nوفي حديث أخر:\n\n \" مَن لَم يَسألِ اللهَ يَغضَب عَلَيهِ \" \n",
      "translations": []
    }
  ]
}