{
  "chapter": "النساء",
  "text": "ولكل جعلنا مولى مما ترك الولدان والاقربون والذين عقدت ايمنكم فـاتوهم نصيبهم ان الله كان على كل شىء شهيدا",
  "translations": [
    {
      "translation": "We have appointed heirs for everything that parents and relatives leave. If you have a bond with people, give them their share. Allah is a witness of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For each We have appointed heirs to what parents and relatives leave behind. And to those you have given your pledge in marriage give their share, for God is witness to everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to everyone We have appointed rightful heirs to what the parents and near of kin might leave behind. As to those with whom you have made a solemn covenant, give them their share. Allah watches over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have chosen heirs for every legacy that parents and relatives may leave. Let those who have been promised a bequest receive their share of the legacy. God is Omnipresent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for all, We have appointed heirs – from whatever the parents and near relatives leave behind; and to those with whom you have made an agreement, give them their dues; indeed all things are present before Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to everyone, We have appointed Mawali of that left by parents and relatives. To those also with whom you have made a pledge (brotherhood), give them their due portion (by wills). Truly, Allah is Ever a Witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to every one We have appointed heirs of what parents and near relatives leave; and as to those with whom your rights hands have ratified agreements, give them their portion; surely Allah is a witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To everyone We have appointed heirs of that which parents and kinsmen leave, and those with whom you have sworn compact. So give to them their share; God is witness over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto each We have appointed heirs of that which parents and near kindred leave; and as for those with whom your right hands have made a covenant, give them their due. Lo! Allah is ever Witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have appointed heirs for everything that parents and close relatives leave behind. As for those with whom you have entered into agreements, let them, too, have their due. God is witness to all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto each We have appointed inheritors of that which the parents or the near of kin leave behind, and unto those with whom ye have made your pledges give their portion. Verily Allah is ever of everything a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For everyone We have appointed heirs to what the parents and near relatives leave, as well as those with whom you have made a compact; so give them their share [of the heritage]. Indeed Allah is witness to all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To (benefit) every one, We have appointed shares and heirs to property left by parents and relatives. To those, also, to whom your right hand was pledged, give their due portion. For truly Allah is witness to all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to everyone, We have appointed heirs of that (property) left by parents and relatives. To those also with whom you have made a pledge (brotherhood), give them their due portion (by Wasiya - wills, etc.). Truly, Allah is Ever a Witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To everyone we have made heirs of that which parents and kinsmen leave, and those with whom you have sworn an agreement, so give to them their share. Allah is Witness over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To everyone We have assigned beneficiaries in what is left by parents and relatives. Those with whom you have made an agreement, give them their share. God is Witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for all, We have made heirs to what is left by parents and relatives. And to those whom your oaths have bound [to you] - give them their share. Indeed Allah is ever, over all things, a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:33] To each, man and woman, We have appointed heirs, relations to be given, of that, property, which parents and kinsmen leave, for them, and to those to whom your right hands (aymān, plural of yamīn, meaning ‘oath’ or ‘hand’) were pledged (read ‘āqadat or ‘aqadat), that is, those allies with whom before the coming of Islam you made covenants of mutual assitance and inheritance. So give them, now, their share, their portions of the inheritance, which is a sixth. God is ever Witness over everything, [ever] aware [of it], including your circumstances: this verse was abrogated by His words, But those related by blood are nearer to one another [Q. 8:75 and 33:6].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالجملة معطوفة على جملة { ولا تتمنوا ما فضل الله به بعضكم على بعض } \\[ النساء : 32 \\] باعتبار كونه جامعاً لمعنى النهي عن الطمع في مال صاحب المال ، قُصد منها استكمال تبيين من لهم حقّ في المال .وشأنُ ( كُلّ ) إذا حذف ما تضاف إليه أن يعوّض التنوين عن المحذوف ، فإن جرى في الكلام ما يدلّ على المضاف إليه المحذوف قُدّر المحذوف من لفظه أو معناه ، كما تقدم في قوله تعالى : { ولكل وجهة } في سورة البقرة ( 148 ) ، وكذلك هنا فيجوز أن يكون المحذوف ممّا دلّ عليه قوله - قبله - { للرجال نصيب وللنساء نصيب } \\[ النساء : 7 \\] فيقدّر : ولكلّ الرجال والنساء جعلنا موالَي ، أو لكلّ تارككٍ جعلنا موالي .ويجوز أن يقدّر : ولكلّ أحد أو شيء جعلنا موالي .والجعل من قوله : { جعلنا } هو الجعل التشريعي أي شَرعْنا لكلّ موالي لهم حقّ في ماله كما في قوله تعالى : { فقد جعلنا لوليه سلطانا } \\[ الإسراء : 33 \\] .والموالي جمعُ مَولى وهو محلّ الوَلْيِ ، أي القرب ، وهو مَحلّ مجازي وقرب مجازي . والولاء اسم المصدر للوَلْي المجازي .وفي نظم الآية تقادير جديرة بالاعتبار ، وجامعة لمعان من التشريع :الأوّل : ولِكلّ تارككٍ ، أي تارك مالا جعلنا موالي ، أي أهل ولاء له ، أي قرب ، أي ورثة . ويتعلّق { مما ترك } بما في موالي من معنى يَلُونه ، أي يرثونه ، ومِن للتبعيض ، أي يرثون ممّا ترك . وما صدق ( ما ) الموصولة هو المال ، والصلة قرينة على كون المراد بالموالي الميراث ، وكون المضاف إليه ( كلّ ) هو الهالك أو التارك . { ولكل } متعلّق ب ( جعلنا ) ، قدّم على متعلّقه للاهتمام .وقوله : { الوالدان } استئناف بياني بيّن به المراد في ( موالي ) ، ويصلح أن يبيّن به كلّ المقدّر له مضاف . تقديره : لكلّ تارك . وتبيين كلا اللفظين سواءٌ في المعنى ، لأنّ التارك : والد أو قريب ، والموالي : والدون أو قرابة . وفي ذِكر { الوالدان } غنية عن ذكر الأبناء لتلازمهما ، فإن كان الوالدان من الورثة فالهالك ولد وإلاّ فالهالك والد . والتعريف في { الوالدان والأقربون } عوض عن مضاف إليه أي : والداهِم وأقربوهم ، والمضاف إليه المحذوفُ يدلّ عليه الموالي ، وهذا التقدير يناسب أن يكون ناشئاً عن قوله : { للرجال نصيب مما اكتسبوا } \\[ النساء : 32 \\] ، أي ولكلّ من الصنفين جعلنا موالي يرثونه ، وهو الجَعل الذي في آيات المواريث .والتقدير الثاني : ولكلّ شيء ممّا تركه الوالدان والأقربون جعلنا موالي ، أي قوماً يلونه بالإرث ، أي يرثونه ، أي يكون تراثاً لهم ، فيكون المضاف إليه المحذوف اسماً نكرة عامّا يبيّن نوعه المقام ، ويكون { مما ترك } بيانا لما في تنوين ( كلّ ) من الإبهام ، ويكون { والأقربون } فاعلا ( لتَرَك ) .وهذا التقدير يناسب أن يكون ناشئاً عن قوله : { ما فضل الله به بعضكم على بعض } \\[ النساء : 32 \\] أي في الأموال ، أي ولكلّ من الذين فضّلنا بعضهم على بعض جعلنا موالي يؤول إليهم المال ، فلا تتمنّوا ما ليس لكم فيه حقّ في حياة أصحابه ، ولا ما جعلناه للموالي بعد موت أصحابه .التقدير الثالث : ولكلّ منكم جعلنا موالي ، أي عاصبين من الذين تركهم الوالدان ، مثل الأعمام والأجداد والأخواللِ ، فإنّهم قرباء الأبوين ، وممّا تركهم الأقربون مثل أبناء الأعمام وأبنائهم وإن تعدّدوا ، وأبناء الأخوات كذلك ، فإنّهم قرباء الأقربين ، فتكون الآية مشيرة إلى إرجاع الأموال إلى العصبة عند الجمهور ، وإلى ذوي الأرحام عند بعض الفقهاء ، وذلك إذا انعدم الورثة الذين في آية المواريث السابقة ، وهو حكم مجمل بيّنه قول النبي صلى الله عليه وسلم « ألْحِقوا الفرائض بأهلها فما بقي فلأوْلى رجللٍ ذكر » وقوله : « ابن أخت القوم منهم أو من أنفسهم » رواه أبو داود والنسائي ، وقوله : « الخال وارثُ من لا وارث له » أخرجه أبو داود والترمذي ، وقوله تعالى : { وأولوا الأرحام بعضهم أولى ببعض في كتاب الله } \\[ الأنفال : 75 \\] ، وبذلك أخذ أبو حنيفة ، وأحمد ، وعليه ف ( ما ) الموصولة في قوله : { مما ترك } بمعنى ( من ) الموصولة ، ولا بدع في ذلك . وهذا التقدير يناسب أن يكون ناشئاً عن قوله تعالى بعد آية المواريث { تلك حدود الله } \\[ البقرة : 187 \\] فتكون تكملة لآية المواريث .التقدير الرابع : ولكلّ منكم أيّها المخاطبون بقولنا : { ولا تتمنوا ما فضل الله به بعضكم على بعض } \\[ النساء : 32 \\] جعلنا موالي ، أي شَرَعْنا أحكام الولاء لمن هم موال لكم ، فحكم الولاء الذي تركه لكم أهاليكم : الوالدان والأقربون ، أي أهل الولاء القديم في القبيلة المنجرّ من حلف قديم ، أو بحكم الولاء الذي عاقدتْه الأيمان ، أي الأحلاف بينكم وبينهم أيّها المخاطبون ، وهو الولاء الجديد الشامل للتبنّي المحدث ، وللحلف المحدث ، مثل المؤاخاة التي فرضها النبي صلى الله عليه وسلم بين المهاجرين والأنصار . فإنّ الولاء منه ولاء قديم في القبائل ، ومنه ما يتعاقد عليه الحاضرون ، كما اشار إليه أبو تمّام .أعطيت لي دية القتيل وليس لي ... عقل ولا حلف هناك قَدِيمُوعلى هذا التقدير يكون { والذين عاقدت أيمانكم } معطوفة على { الوالدان والأقربون } وهذا التقدير يناسب أن يكون ناشئاً عن قوله تعالى : { تلك حدود الله } \\[ البقرة : 187 \\] فتكون هذه الآية تكملة لآيات المواريث .وللمفسّرين تقادير أخرى لا تلائم بعض أجزاء النظم إلا بتعسّف فلا ينبغي التعريج عليها .وقوله : { والذين عاقدت أيمانكم } قيل معطوف على قوله : { الوالدان والأقربون } ، وقيل هو جملة مستأنفة استئنافاً بيانياً ، كأنّه قيل : من هم الموالي؟ فقيل : { الوالدان والأقربون } الخ ، على أنّ قوله : { فأتاهم نصيبهم } خبر عن قوله : { والذين عاقدت } . وأدخلت الفاء في الخبر لتضمّن الموصول معنى الشرط ، ورجّح هذا بأنّ المشهور أنّ الوقت على قوله : { والأقربون } وليس على قوله : { أيمانكم } . والمعاقدة : حصول العقد من الجانبين ، أي الذين تعاقدتم معهم على أن يكونوا بمنزلة الأبناء أو بمنزلة الإخْوَة أو بمنزلة أبناء العمّ .والأيمان جمع يَمين : إمّا بمعنى اليد ، أسند العقد إلى الأيدي مجازاً لأنّها تقارن المتعاقديِن لأنّهم يضعون أيدي بعضهم في أيدي الآخرين ، علامة على انبرام العقد ، ومن أجل ذلك سمّي العقد صَفقة أيضاً؛ لأنّه يصفّق فيه اليَدُ على اليد ، فيكون من باب { أو ما ملكت أيمانكم } \\[ النساء : 3 \\] ؛ وإمَّا بمعنى القَسَم لأنّ ذلك كان يَصحبه قَسَم ، ومن أجل ذلك سمّي حِلْفا ، وصاحبه حَليفاً . وإسناد العقد إلى الأيمان بهذا المعنى مجاز أيضاً؛ لأنّ القسم هو سبب انعقاد الحلف .والمراد ب { الذين عاقَدَتْ أيمانكم } : قيل موالي الحلف الذي كان العرب يفعلونه في الجاهلية ، وهو أن يَحالف الرجل الآخر فيقول له «دمي دَمُك وهَدْمي هَدْمُك أي إسقاط أحدهما للدم الذي يستحقّه يمضي على الآخر وثَأرِي ثَأرُكَ وحَرْبي حَرْبُك وسلْمي سلْمُك وترثني وأرثك وتطلب بي وأطلب بك وتعقل عنّي وأعقل عنك» . وقد جمع هذين الصنفين من الموالي الحُصَين بن الحُمَاممِ من شعراء الحماسة في قوله :مواليكمُ مولَى الوِلاَدَةِ منكمُ ... ومولَى اليمين حَابِس قد تُقِسِّمَاقيل : كانوا جعلوا للمولى السدس في تركة الميت ، فأقرّته هذه الآية ، ثم نسختها آية الأنفال : { وأولو الأرحام بعضهم أولى ببعض في كتاب الله } \\[ الأنفال : 75 \\] قاله ابن عباس ، والحسن ، وقتادة ، وابن جبير ، ولعلّ مرادهم أنّ المسلمين جعلوا للمولَى السدس وصية لأنّ أهل الجاهلية لم تكن عندهم مواريث معيّنة . وقيل : نزلت هذه الآية في ميراث الإخوة الذين آخى النبي صلى الله عليه وسلم بينهم من المهاجرين والأنصار في أول الهجرة ، فكانوا يتوارثون بذلك دون ذوي الأرحام ، ثم نسخ الله ذلك بآية الأنفال ، فتكون هذه الآية منسوخة . وفي أسباب النزول للواحدي ، عن سعيد بن المسيّب ، أنّها نزلت في التبنّي الذي كان في الجاهلية ، فكان المتبنَّي يرث المتبنِّي ( بالكسر ) مثل تبنّي النبي صلى الله عليه وسلم زيد بن حارثة الكلبي ، وتبنّي الأسود بن عبد يغوث المقداد الكَندي ، المشهور بالمقداد بن الأسود ، وتبنّي الخطاب بن نُفَيل عامراً بنَ ربيعة ، وتبنّي أبي حُذيفة بن عتبة بن ربيعة سالماً بن معقل الأصطخري ، المشهور بسالممٍ مولى أبي حذيفة ، ثم نسخ بالمواريث . وعلى القول بأنّ { والذين عاقدت أيمانكم } جملة مستأنفة فالآية غير منسوخة؛ فقال ابن عباس في رواية ابن جبير عنه في «البخاري» هي ناسخة لتوريث المتآخِين من المهاجرين والأنصار ، لأنّ قوله : { مما ترك الوالدان والأقربون } حَصَر الميراث في القرابة ، فتعيّن على هذا أنّ قوله : { فأتوهم نصيبهم } أي نصيب الذين عاقدت أيمانُكم من النصر والمعونة ، أو فآتوهم نصيبهم بالوصية ، وقد ذهب الميراث . وقال سعيد بن المسيّب : نزلت في التبنّي أمراً بالوصية للمتبنَّى . وعن الحسن أنّها في شأن الموصَى له إذا مات قبل موت المُوصي أن تجعل الوصية لأقاربه لزوماً .وقرأ الجمهور : { عاقدت } بألف بعد العين . وقرأه حمزة ، وعاصم ، والكسائي ، وخلف : { عَقَدَتْ بدون ألف ومع تخفيف القاف .والفاءُ في قوله : فأتوهم نصيبهم } فاءُ الفصيحةِ على جعل قوله : { والذين عاقدت أيمانكم } معطوفاً على { الوالدان والأقربون } ، أو هي زائدة في الخبر إن جعل { والذين عقدت } مبتدأً على تضمين الموصول معنى الشرطية . والأمر في الضمير المجرور على الوجهين ظاهر .\n\n",
      "translations": [
        {
          "translation": "(And unto each) He says: to each one of you (We have appointed heirs) so that they inherit (of that which parents and near kindred leave) of property; (and as for those with whom your right hands have made a covenant) your stipulation, (give them their due) give them their stipulation. But this is now abrogated. In the pre-Islamic era, they used to adopt men and youth and allocate for them a portion of their wealth, just as they would do with their own children. Allah abrogated such a practice. However, it is not abrogated if he gives them their portion from a third of his wealth. (Lo! Allah is ever witness over) Allah knows (all things) relating to your works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلِكُلٍّ جَعَلْنَا مَوَٰلِيَ } معناهُ وَرَثةٌ\n والمَولى: ابن العَم\n والمَولى: المُنْعِمُ المُعتِقُ\n والمَولى: المُعتَقُ\n والمَولى: الحَلِيفُ والنَّاصِرُ\n والمولى: الوَلِي\n والمَولى: المُسْلِمُ على يَدَيهِ\n والمَولى: المسلم على يد الرَّجلِ!\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah: {And to everyone We have appointed heirs} means that everyone has an inheritance.\n\n\nAnd the master: the son of the uncle\n\n\nAnd the Wali (Protector or Guardian): The One who is Most Munim (Bountiful) and Mu'tiq (Liberator)\n\n\nAnd the guardian: the one who frees (slaves/prisoners)\n\n\n{And the protector: the ally and the supporter}\n\n\nAnd the Patron: The Patron\n\n\nAnd the guardian: the Muslim is on his own hands.\n\n\nAnd the next of kin: the Muslim man on the man's hand!",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: التنوين في \" كل \": للعوض، و { مما ترك } بيان للمعوض منه، أي: ولكل مال مما ترك الوالدان والأقربون جعلنا موالي: أي: ورثة، وهم الذرية والعصبة يرثون من ذلك المال، والوالدان على هذا فاعل، ويحتمل أن يكون مبتدأ والتنوين عوض عن الميت الموروث، أي: ولكل ميت جعلنا ورثة يرثون مما ترك ذلك الميت، وهم الوالدان والأقربون فيوقف على { ترك } ، و { مما } يتعلق بمحذوف، و { الذين } مبتدأ، و { فآتوهم } خبر، دخلت الفاء لما في المبتدأ من العموم. يقول الحقّ جلّ جلاله: ولكل ميت جعلنا وَرَثَة يرثون { مما ترك } ذلك الميت، وهم { الوالدان والأقربون } ، أو لكل تركة جعلنا لها { موالي } أي: ورثة يرثون مما ترك الوالدان والأقربون، { والذين عقدت أيمانكم } وهم موالي الحِلف، كانوا يتحالفون في الجاهلية على النصرة والمؤازرة، يقول الرجل لآخر: دمي دمك، وهدمي هدمك، وثأري ثأرك. فيضرب بعضهم على يد الآخر في عقد ذلك الحلف. فلذلك قال: { عقدت أيمانكم } فكان في أول الإسلام يرث من حليفه السدس، وإليه أشار بقوله: { فآتوهم نصيبهم } ، ثم نسخ. وقيل: نزلت في المؤاخاة التي آخى رسول الله صلى الله عليه وسلم بين المهاجرين والأنصار، فكان يرث السدس، ثم نُسخ بقوله\n[الأنفال:75]. وعن أبي حنيفة: لو أسلم رجل على يد رجل وتعاقدا على أن يتعاقلا ويتوارثا صح وورث. وقال ابن عباس: آتوهم نصيبهم من النصرة التي تعاقدوا عليه، فيُوفي لهم بها، فلا نسخ. { إن الله كان على كل شيء شهيدًا } ، هو تهديد لم تعدى الحدود، ونقض العهود. والله تعالى أعلم. الإشارة: ولكل زمان جعلنا أولياء كبراء، يرثون مما ترك أشياخهم من خصوصية الولاية وسر العناية، إلى يوم القيامة فالأرض لا تخلو ممن يقوم بالحجة ويظهر المحجة، فيقال لهم: والذين عقدت أيمانكم في الصحبة معكم، فظهر صدقهم، وبانت خدمتهم، فآتوهم نصيبهم مما خصكم الله به من سر الولاية ولطف العناية، { إن الله كان على كل شيء شهيدًا } ، لا يخفى عليه من يستحق الخلافة ويرث سرَ الولاية. والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:27",
      "similarity": 0.5961884664954142
    },
    {
      "verse": "2:237",
      "similarity": 0.3613830894881962
    },
    {
      "verse": "4:7",
      "similarity": 0.3544765297324712
    },
    {
      "verse": "2:235",
      "similarity": 0.27858731064273473
    },
    {
      "verse": "5:1",
      "similarity": 0.2769781257899447
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004033.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004033.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:33.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}