{
  "chapter": "النساء",
  "text": "ولكل جعلنا مولى مما ترك الولدان والاقربون والذين عقدت ايمنكم فـاتوهم نصيبهم ان الله كان على كل شىء شهيدا",
  "translations": [
    {
      "translation": "We have appointed heirs for everything that parents and relatives leave. If you have a bond with people, give them their share. Allah is a witness of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For each We have appointed heirs to what parents and relatives leave behind. And to those you have given your pledge in marriage give their share, for God is witness to everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to everyone We have appointed rightful heirs to what the parents and near of kin might leave behind. As to those with whom you have made a solemn covenant, give them their share. Allah watches over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have chosen heirs for every legacy that parents and relatives may leave. Let those who have been promised a bequest receive their share of the legacy. God is Omnipresent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for all, We have appointed heirs – from whatever the parents and near relatives leave behind; and to those with whom you have made an agreement, give them their dues; indeed all things are present before Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to everyone, We have appointed Mawali of that left by parents and relatives. To those also with whom you have made a pledge (brotherhood), give them their due portion (by wills). Truly, Allah is Ever a Witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to every one We have appointed heirs of what parents and near relatives leave; and as to those with whom your rights hands have ratified agreements, give them their portion; surely Allah is a witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To everyone We have appointed heirs of that which parents and kinsmen leave, and those with whom you have sworn compact. So give to them their share; God is witness over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto each We have appointed heirs of that which parents and near kindred leave; and as for those with whom your right hands have made a covenant, give them their due. Lo! Allah is ever Witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have appointed heirs for everything that parents and close relatives leave behind. As for those with whom you have entered into agreements, let them, too, have their due. God is witness to all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto each We have appointed inheritors of that which the parents or the near of kin leave behind, and unto those with whom ye have made your pledges give their portion. Verily Allah is ever of everything a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For everyone We have appointed heirs to what the parents and near relatives leave, as well as those with whom you have made a compact; so give them their share [of the heritage]. Indeed Allah is witness to all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To (benefit) every one, We have appointed shares and heirs to property left by parents and relatives. To those, also, to whom your right hand was pledged, give their due portion. For truly Allah is witness to all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to everyone, We have appointed heirs of that (property) left by parents and relatives. To those also with whom you have made a pledge (brotherhood), give them their due portion (by Wasiya - wills, etc.). Truly, Allah is Ever a Witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To everyone we have made heirs of that which parents and kinsmen leave, and those with whom you have sworn an agreement, so give to them their share. Allah is Witness over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To everyone We have assigned beneficiaries in what is left by parents and relatives. Those with whom you have made an agreement, give them their share. God is Witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for all, We have made heirs to what is left by parents and relatives. And to those whom your oaths have bound [to you] - give them their share. Indeed Allah is ever, over all things, a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:33] To each, man and woman, We have appointed heirs, relations to be given, of that, property, which parents and kinsmen leave, for them, and to those to whom your right hands (aymān, plural of yamīn, meaning ‘oath’ or ‘hand’) were pledged (read ‘āqadat or ‘aqadat), that is, those allies with whom before the coming of Islam you made covenants of mutual assitance and inheritance. So give them, now, their share, their portions of the inheritance, which is a sixth. God is ever Witness over everything, [ever] aware [of it], including your circumstances: this verse was abrogated by His words, But those related by blood are nearer to one another [Q. 8:75 and 33:6].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And unto each) He says: to each one of you (We have appointed heirs) so that they inherit (of that which parents and near kindred leave) of property; (and as for those with whom your right hands have made a covenant) your stipulation, (give them their due) give them their stipulation. But this is now abrogated. In the pre-Islamic era, they used to adopt men and youth and allocate for them a portion of their wealth, just as they would do with their own children. Allah abrogated such a practice. However, it is not abrogated if he gives them their portion from a third of his wealth. (Lo! Allah is ever witness over) Allah knows (all things) relating to your works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلِكُلٍّ جَعَلْنَا مَوَٰلِيَ } معناهُ وَرَثةٌ\n والمَولى: ابن العَم\n والمَولى: المُنْعِمُ المُعتِقُ\n والمَولى: المُعتَقُ\n والمَولى: الحَلِيفُ والنَّاصِرُ\n والمولى: الوَلِي\n والمَولى: المُسْلِمُ على يَدَيهِ\n والمَولى: المسلم على يد الرَّجلِ!\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah: {And to everyone We have appointed heirs} means that everyone has an inheritance.\n\n\nAnd the master: the son of the uncle\n\n\nAnd the Wali (Protector or Guardian): The One who is Most Munim (Bountiful) and Mu'tiq (Liberator)\n\n\nAnd the guardian: the one who frees (slaves/prisoners)\n\n\n{And the protector: the ally and the supporter}\n\n\nAnd the Patron: The Patron\n\n\nAnd the guardian: the Muslim is on his own hands.\n\n\nAnd the next of kin: the Muslim man on the man's hand!",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: التنوين في \" كل \": للعوض، و { مما ترك } بيان للمعوض منه، أي: ولكل مال مما ترك الوالدان والأقربون جعلنا موالي: أي: ورثة، وهم الذرية والعصبة يرثون من ذلك المال، والوالدان على هذا فاعل، ويحتمل أن يكون مبتدأ والتنوين عوض عن الميت الموروث، أي: ولكل ميت جعلنا ورثة يرثون مما ترك ذلك الميت، وهم الوالدان والأقربون فيوقف على { ترك } ، و { مما } يتعلق بمحذوف، و { الذين } مبتدأ، و { فآتوهم } خبر، دخلت الفاء لما في المبتدأ من العموم. يقول الحقّ جلّ جلاله: ولكل ميت جعلنا وَرَثَة يرثون { مما ترك } ذلك الميت، وهم { الوالدان والأقربون } ، أو لكل تركة جعلنا لها { موالي } أي: ورثة يرثون مما ترك الوالدان والأقربون، { والذين عقدت أيمانكم } وهم موالي الحِلف، كانوا يتحالفون في الجاهلية على النصرة والمؤازرة، يقول الرجل لآخر: دمي دمك، وهدمي هدمك، وثأري ثأرك. فيضرب بعضهم على يد الآخر في عقد ذلك الحلف. فلذلك قال: { عقدت أيمانكم } فكان في أول الإسلام يرث من حليفه السدس، وإليه أشار بقوله: { فآتوهم نصيبهم } ، ثم نسخ. وقيل: نزلت في المؤاخاة التي آخى رسول الله صلى الله عليه وسلم بين المهاجرين والأنصار، فكان يرث السدس، ثم نُسخ بقوله\n[الأنفال:75]. وعن أبي حنيفة: لو أسلم رجل على يد رجل وتعاقدا على أن يتعاقلا ويتوارثا صح وورث. وقال ابن عباس: آتوهم نصيبهم من النصرة التي تعاقدوا عليه، فيُوفي لهم بها، فلا نسخ. { إن الله كان على كل شيء شهيدًا } ، هو تهديد لم تعدى الحدود، ونقض العهود. والله تعالى أعلم. الإشارة: ولكل زمان جعلنا أولياء كبراء، يرثون مما ترك أشياخهم من خصوصية الولاية وسر العناية، إلى يوم القيامة فالأرض لا تخلو ممن يقوم بالحجة ويظهر المحجة، فيقال لهم: والذين عقدت أيمانكم في الصحبة معكم، فظهر صدقهم، وبانت خدمتهم، فآتوهم نصيبهم مما خصكم الله به من سر الولاية ولطف العناية، { إن الله كان على كل شيء شهيدًا } ، لا يخفى عليه من يستحق الخلافة ويرث سرَ الولاية. والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:27",
      "similarity": 0.5961884664954142
    },
    {
      "verse": "2:237",
      "similarity": 0.3613830894881962
    },
    {
      "verse": "4:7",
      "similarity": 0.3544765297324712
    },
    {
      "verse": "2:235",
      "similarity": 0.27858731064273473
    },
    {
      "verse": "5:1",
      "similarity": 0.2769781257899447
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004033.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004033.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:33.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}