{
  "chapter": "النساء",
  "text": "الرجال قومون على النساء بما فضل الله بعضهم على بعض وبما انفقوا۟ من امولهم فالصلحت قنتت حفظت للغيب بما حفظ الله والتى تخافون نشوزهن فعظوهن واهجروهن فى المضاجع واضربوهن فان اطعنكم فلا تبغوا۟ عليهن سبيلا ان الله كان عليا كبيرا",
  "translations": [
    {
      "translation": "Men have charge of women because Allah has preferred the one above the other and because they spend their wealth on them. Right-acting women are obedient, safeguarding their husbands' interests in their absence as Allah has guarded them. If there are women whose disobedience you fear, you may admonish them, refuse to sleep with them, and then beat them. But if they obey you, do not look for a way to punish them. Allah is All-High, Most Great.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are the support of women as God gives some more means than others, and because they spend of their wealth (to provide for them). So women who are virtuous are obedient to God and guard the hidden as God has guarded it. As for women you feel are averse, talk to them suasively; then leave them alone in bed (without molesting them) and go to bed with them (when they are willing). If they open out to you, do not seek an excuse for blaming them. Surely God is sublime and great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are the protec-tors and maintainers of women because Allah has made one of them excel over the other, and because they spend out of their possessions (to support them). Thus righteous women are obedient and guard the rights of men in their absence under Allah's protection. As for women of whom you fear rebellion, admonish them, and remain apart from them in beds, and beat them. Then if they obey you, do not seek ways to harm them. Allah is Exalted, Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are the protectors of women because of the greater preference that God has given to some of them and because they financially support them. Among virtuous women are those who are steadfast in prayer and dependable in keeping the secrets that God has protected. Admonish women who disobey (God's laws), do not sleep with them and beat them. If they obey (the laws of God), do not try to find fault in them. God is High and Supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are in charge of women, as Allah has made one of them superior to the other, and because men spend their wealth for the women; so virtuous women are the reverent ones, guarding behind their husbands the way Allah has decreed guarding; and the women from whom you fear disobedience, (at first) advise them and (then) do not cohabit with them, and (lastly) beat them; then if they obey you, do not seek to do injustice to them; indeed Allah is Supreme, Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are the protectors and maintainers of women, because Allah has made one of them to excel the other, and because they spend (to support them) from their means. Therefore the righteous women are Qanitat, and guard in the husband's absence what Allah orders them to guard. As to those women on whose part you see ill conduct, admonish them, and abandon them in their beds, and beat them, but if they return to obedience, do not seek a means against them. Surely, Allah is Ever Most High, Most Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are the maintainers of women because Allah has made some of them to excel others and because they spend out of their property; the good women are therefore obedient, guarding the unseen as Allah has guarded; and (as to) those on whose part you fear desertion, admonish them, and leave them alone in the sleeping-places and beat them; then if they obey you, do not seek a way against them; surely Allah is High, Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are the managers of the affairs of women for that God has preferred in bounty one of them over another, and for that they have expended of their property. Righteous women are therefore obedient, guarding the secret for God's guarding. And those you fear may be rebellious admonish; banish them to their couches, and beat them. If they then obey you, look not for any way against them; God is All-high, All-great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are in charge of women, because Allah hath made the one of them to excel the other, and because they spend of their property (for the support of women). So good women are the obedient, guarding in secret that which Allah hath guarded. As for those from whom ye fear rebellion, admonish them and banish them to beds apart, and scourge them. Then if they obey you, seek not a way against them. Lo! Allah is ever High, Exalted, Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are protectors of women, because God has made some of them excel others and because they spend their wealth on them. So virtuous women are obedient and guard in the husband's absence what God would have them guard. As for those from whom you apprehend infidelity, admonish them, then refuse to share their beds, and finally hit them [lightly]. Then if they obey you, take no further action against them. For God is High, Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are overseers over women, by reason of that wherewith Allah hath made one of them excel over anot her, and by reason of that which they expend of their substance. Wherefore righteous women are obedient, and are watchers in husbands absence by the aid and protection of Allah. And those wives whose refractoriness ye fear, exhort them, and avoid them in beds, and beat them; but if they obey you, seek not a way against them; verily Allah is ever Lofty, Grand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are the managers of women, because of the advantage Allah has granted some of them over others, and by virtue of their spending out of their wealth. Righteous women are obedient and watchful in the absence [of their husbands] in guarding what Allah has enjoined [them] to guard. As for those [wives] whose misconduct you fear, [first] advise them, and [if ineffective] keep away from them in the bed, and [as the last resort] beat them. Then if they obey you, do not seek any course [of action] against them. Indeed Allah is all-exalted, all-great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are the protectors and maintainers of women, because Allah has given the one more (strength) than the other, and because they support them from their means. Therefore the righteous women are devoutly obedient, and guard in (the husband's) absence what Allah would have them guard. As to those women on whose part ye fear disloyalty and ill-conduct, admonish them (first), (Next), refuse to share their beds, (And last) beat them (lightly); but if they return to obedience, seek not against them Means (of annoyance): For Allah is Most High, great (above you all).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are the protectors and maintainers of women, because Allah has made one of them to excel the other, and because they spend (to support them) from their means. Therefore the righteous women are devoutly obedient (to Allah and to their husbands), and guard in the husband's absence what Allah orders them to guard (e.g. their chastity, their husband's property, etc.). As to those women on whose part you see ill-conduct, admonish them (first), (next), refuse to share their beds, (and last) beat them (lightly, if it is useful), but if they return to obedience, seek not against them means (of annoyance). Surely, Allah is Ever Most High, Most Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are the maintainers of women for that Allah has preferred in bounty one of them over another, and for that they have spent of their wealth. Righteous women are obedient, guarding in secret that which Allah has guarded. Those from whom you fear rebelliousness, admonish them and desert them in the bed and smack them (without harshness). Then, if they obey you, do not look for any way against them. Allah is High, Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are the protectors and maintainers of women, as God has given some of them an advantage over others, and because they spend out of their wealth. The good women are obedient, guarding what God would have them guard. As for those from whom you fear disloyalty, admonish them, and abandon them in their beds, then strike them. But if they obey you, seek no way against them. God is Sublime, Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men are in charge of women by [right of] what Allah has given one over the other and what they spend [for maintenance] from their wealth. So righteous women are devoutly obedient, guarding in [the husband's] absence what Allah would have them guard. But those [wives] from whom you fear arrogance - [first] advise them; [then if they persist], forsake them in bed; and [finally], strike them. But if they obey you [once more], seek no means against them. Indeed, Allah is ever Exalted and Grand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:34] Men are in charge of, they have authority over, women, disciplining them and keeping them in check, because of that with which God has preferred the one over the other, that is, because God has given them the advantage over women, in knowledge, reason, authority and otherwise, and because of what they expend, on them [the women], of their property. Therefore righteous women, among them, are obedient, to their husbands, guarding in the unseen, that is, [guarding] their private parts and otherwise during their spouses’ absence, because of what God has guarded, for them, when He enjoined their male spouses to look after them well. And those you fear may be rebellious, disobedient to you, when such signs appear, admonish them, make them fear God, and share not beds with them, retire to other beds if they manifest such disobedience, and strike them, but not violently, if they refuse to desist [from their rebellion] after leaving them [in separate beds]. If they then obey you, in what is desired from them, do not seek a way against them, a reason to strike them unjustly. God is ever High, Great, so beware of Him, lest He punish you for treating them unjustly.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي لذكر تشريع في حقوق الرجال وحقوق النساء والمجتمع العائلي . وقد ذُكر عقب ما قبلَه لمناسبة الأحكام الراجعة إلى نظام العائلة ، لا سيما أحكام النساء ، فقوله : { الرجال قوامون على النساء } أصل تشريعي كُلِّيّ تتفرّع عنه الأحكام التي في الآيات بعده ، فهو كالمقدّمة .وقوله : { فالصالحات } تفريع عنه مع مناسبته لما ذكر من سبب نزول { ولا تتمنوا ما فضل الله به بعضكم على بعض } \\[ النساء : 32 \\] فيما تقدّم .والحكم الذي في هذه الآية حكم عامّ جيء به لتعليل شرع خاصّ .فلذلك فالتعريف في { الرجال } و { النساء } للاستغراق ، وهو استغراق عرفي مبني على النظر إلى الحقيقة ، كالتعريف في قول الناس «الرجل خير من المرأة» ، يؤول إلى الاستغراق العرفي ، لأنّ الأحكام المستقراة للحقائق أحكام أغلبية ، فإذا بني عليها استغراق فهو استغراق عرفي . والكلام خبر مستعمل في الأمر كشأن الكثير من الأخبار الشرعية .والقَوَّام : الذي يقوم على شأن شيءٍ ويليه ويصلحه ، يقال : قَوَّام وقَيَّام وقَيُّوم وقَيِّم ، وكلّها مشتقّة من القيام المجازي الذي هو مجاز مرسل أو استعارة تمثيلية ، لأنّ شأن الذي يهتمّ بالأمر ويعتني به أن يقف ليدير أمره ، فأطلق على الاهتمام القيامُ بعلاقة اللزوم . أو شُبِّه المهتم بالقائم للأمر على طريقة التمثيل . فالمراد من الرجال من كان من أفراد حقيقة الرجل ، أي الصنف المعروف من النوع الإنساني ، وهو صنف الذكور ، وكذلك المراد من النساء صنف الإناث من النوع الإنساني ، وليس المراد الرجال جمعَ الرجل بمعنى رَجُل المرأة ، أي زوجها؛ لعدم استعماله في هذا المعنى ، بخلاف قولهم : امرأةُ فلان ، ولا المراد من النساء الجمعُ الذي يطلق على الأزواج الإناث وإن كان ذلك قد استعمل في بعض المواضع مثل قوله تعالى : { من نسائكم اللاتي دخلتم بهن } ، بل المراد ما يدلّ عليه اللفظ بأصل الوضع كما في قوله تعالى : { وللنساء نصيب مما اكتسبن } \\[ النساء : 32 \\] ، وقول النابغة :ولا نِسْوَتِي حَتَّى يَمُتْنَ حَرَائِرا ... يريد أزواجه وبناته وولاياه .فموقع { الرجال قوامون على النساء } موقُع المقدّمة للحكم بتقديم دليله للاهتمام بالدليل ، إذ قد يقع فيه سوء تأويل ، أو قد وقع بالفعل ، فقد روي أنّ سبب نزول الآية قول النساء «ليتنا استوينا مع الرجال في الميراث وشَرَكْناهم في الغزو» .وقيام الرجال على النساء هو قيام الحفظ والدفاع ، وقيام الاكتساب والإنتاج المالي ، ولذلك قال : { بما فضل الله بعضهم على بعض وبما أنفقوا من أموالهم } أي : بتفضيل الله بعْضهم على بعض وبإنفاقهم من أموالهم ، إن كانت ( ما ) في الجملتين مصدرية ، أو بالذي فضّل الله به بعضهم ، وبالذي أنفقوه من أموالهم ، إن كانت ( ما ) فيهما موصولة ، فالعائدان من الصلتين محذوفان : أمّا المجرور فلأنّ اسم الموصول مجرور بحرف مثل الذي جُرَّ به الضمير المحذوف ، وأمّا العائد المنصوب من صلة { وبما أنفقوا } فلأنَّ العائد المنصوب يكثر حذفه من الصلة .والمراد بالبعض في قوله تعالى : { فضل الله بعضهم } هو فريق الرجال كما هو ظاهر من العطف في قوله : { وبما أنفقوا من أموالهم } فإنّ الضميرين للرجال .فالتفضيل هو المزايا الجبلية التي تقتضي حاجة المرأة إلى الرجل في الذبّ عنها وحراستها لبقاء ذاتها ، كما قال عَمرو بن كلثوم :يَقُتْنَ جيادَنا ويقُلْن لستم ... بُعُولتنا إذا لَمْ تمنعونافهذا التفضيل ظهرت آثاره على مرّ العصور والأجيال ، فصار حقّا مكتسبا للرجال ، وهذه حجّة بُرهانية على كون الرجال قوّامين على النساء فإنّ حاجة النساء إلى الرجال من هذه الناحية مستمرّة وإن كانت تقوى وتضعف .وقوله : { وبما أنفقوا } جيء بصيغة الماضي للإيماء إلى أنّ ذلك أمر قد تقرّر في المجتمعات الإنسانية منذ القدم ، فالرجال هم العائلون لنساء العائلة من أزواج وبنات . وأضيفت الأموال إلى ضمير الرجال لأنّ الاكتساب من شأن الرجال ، فقد كان في عصور البداوة بالصيد وبالغارة وبالغنائم والحرث ، وذلك من عمل الرجال ، وزاد اكتساب الرجال في عصور الحضارة بالغرس والتجارة والإجارَة والأبنية ، ونحو ذلك ، وهذه حجّة خَطابية لأنّها ترجع إلى مصطلَح غالب البشر ، لا سيما العرب . ويَنْدُر أن تتولّى النساء مساعي من الاكتساب ، لكن ذلك نادر بالنسبة إلى عمل الرجل مثل استئجار الظئر نفسَها وتنمية المرأة مالاً ورثتْه من قرابتها .ومن بديع الإعجاز صوغ قوله : { بما فضل الله بعضهم على بعض وبما أنفقوا من أموالهم } في قالب صالح للمصدرية وللموصولية ، فالمصدرية مشعرة بأنّ القيامية سببها تفضيل من الله وإنفاق ، والموصولية مشعرة بأنّ سببها ما يعلمه الناس من فضل الرجال ومن إنفاقهم ليصلح الخطاب للفريقين : عالمهم وجاهلهم ، كقول السموأل أو الحارثي :سَلِي إن جَهِلْتتِ الناس عنّا وعنهم ... فليس سواء عالم وجهولولأنّ في الإتيان ب ( بما ) مع الفعل على تقدير احتمال المصدرية جَزَالةً لا توجد في قولنا : بتفضيل الله وبالإنفاققِ ، لأنّ العرب يرجّحون الأفعال على الأسماء في طرق التعْبير .وقد روي في سبب نزول الآية : أنّها قول النساء ، ومنهن أمّ سلمة أمّ المؤمنين : « أتغزو الرجال ولا نغزو وإنّما لنا نصف الميراث » فنزل قوله تعالى : { ولا تتمنوا ما فضل الله به بعضكم على بعض } \\[ النساء : 32 \\] إلى هذه الآية ، فتكون هذه الآية إكمالا لما يرتبط بذلك التمنّي . وقيل : نزلت هذه الآية بسبب سعد بن الربيع الأنصاري : نشزت منه زوجه حبيبة بنت زيد بن أبي زهير فلطمها فشكاه أبوها إلى النبي صلى الله عليه وسلم فأمرها أن تلطمه كما لطمها ، فنزلت الآية في فور ذلك ، فقال النبي صلى الله عليه وسلم أردتُ شيئاً وأراد الله غيره ، ونقض حكمه الأول ، وليس في هذا السبب الثاني حديث صحيح ولا مرفوع إلى النبي صلى الله عليه وسلم ولكنّه ممّا رُوي عن الحسن ، والسدّي ، وقتادة .والفاء في قوله : { فالصالحات } للفصيحة ، أي إذا كان الرجال قوّامين على النساء فمن المهمّ تفصيل أحوال الأزواج منهنّ ومعاشرتهنّ أزواجهنّ وهو المقصود ، فوصف الله الصالحات منهن وصفا يفيد رضاه تعالى ، فهو في معنى التشريع ، أي ليَكُنَّ صالحات . والقانتات : المطيعات لله . والقنوت : عبادة الله ، وقدّمه هنا وإن لم يكن من سياق الكلام للدلالة على تلازم خوفهنّ الله وحفظ حقّ أزواجهنّ ، ولذلك قال : { حافظات للغيب } ، أي حافظات أزواجهنّ عند غيبتهم . وعلّق الغيب بالحفظ على سبيل المجاز العقلي لأنّه وقته . والغيب مصدر غاب ضدّ حضر . والمقصود غيبة أزواجهنّ ، واللام للتعدية لضعف العامل ، إذ هو غير فِعل ، فالغيب في معنى المفعول ، وقد جعل مفعولا للحفظ على التوسّع لأنّه في الحقيقة ظرف للحفظ ، فأقيم مقام المفعول ليشمل كلّ ما هو مظنّة تخلّف الحفظ في مدّته : من كلّ ما شأنه أن يحرسه الزوج الحاضر من أحوال امرأته في عرضه وماله ، فإنّه إذا حضر يكون من حضوره وازعان : يزعها بنفسه ويَزعها أيضاً اشتغالها بزوجها ، أمّا حال الغيبة فهو حال نسيان واستخفاف ، فيمكن أن يبدو فيه من المرأة ما لا يرضي زوجها إن كانت غير صالحة أو سفيهة الرأي ، فحصل بإنابة الظرف عن المفعول إيجاز بديع ، وقد تبعه بشّار إذ قال :ويصُون غَيْبَكُم وإن نَزَحا ... والباء في { بما حفظ الله } للملابسة ، أي حفظا ملابساً لما حفظ الله ، و ( ما ) مصدرية أي بحفظِ اللَّهِ ، وحفظُ اللَّه هو أمره بالحفظ ، فالمراد الحفظ التكليفي ، ومعنى الملابسة أنهنّ يحفظن أزواجهنّ حفظاً مطابقاً لأمر الله تعالى ، وأمرُ الله يرجع إلى ما فيه حقّ للأزواج وحدهم أو مع حقّ الله ، فشمل ما يكرهه الزوج إذا لم يكن فيه حرج على المرأة ، ويخرج عن ذلك ما أذن الله للنساء فيه ، كما أذن النبي صلى الله عليه وسلم هندا بنت عتبة : أن تأخذ من مال أبي سفيان ما يكفيها وولدَها بالمعروف . لذلك قال مالك : إنّ للمرأة أن تُدْخِل الشهود إلى بيت زوجها في غيبته وتشهدهم بما تريد وكما أذن لهن النبي أن يخرجن إلى المساجد ودعوة المسلمين .وقوله : { والتي تخافون نشوزهن } هذه بعض الأحوال المضادّة للصلاح وهو النشوز ، أي الكراهية للزوج ، فقد يكون ذلك لسوء خلق المرأة ، وقد يكون لأنّ لها رغبة في التزوّج بآخر ، وقد يكون لقسوة في خُلق الزوج ، وذلك كثير . والنشوز في اللغة الترفّع والنهوض ، وما يرجع إلى معنى الاضطراب والتباعد ، ومنه نَشَزُ الأرض ، وهو المرتفع منها .قال جمهور الفقهاء : النشوز عصيان المرأة زوجها والترفّع عليه وإظهار كراهيته ، أي إظهار كراهية لم تكن معتادة منها ، أي بعد أن عاشرته ، كقوله : «وإن امرأة خافت من بعلها نشوزا أو إعراضا» . وجعلوا الإذن بالموعظة والهجر والضرب مرتّبا على هذا العصيان ، واحتجّوا بما ورد في بعض الآثار من الإذن للزوج في ضرب زوجته الناشز ، وما ورد من الأخبار عن بعض الصحابة أنّهم فعلوا ذلك في غير ظهور الفاحشة .وعندي أنّ تلك الآثار والأخبار مَحْمَل الأباحة فيها أنّها قد روعي فيها عرف بعض الطبقات من الناس ، أو بعض القبائل ، فإنّ الناس متفاوتون في ذلك ، وأهل البدو منهم لا يعُدّون ضرب المرأة اعتداء ، ولا تعدّه النساء أيضاً اعتداء ، قال عامر بن الحارث النمري الملقّب بجِرَاننِ العَوْد .عَمِدْتُ لِعَوْدٍ فَالْتَحَيْتُ جِرَانَهُ ... ولَلْكَيْسُ أمضى في الأمور وأنجحخُذا حَذراً يا خُلَّتيَّ فإنّني ... رأيتُ جران العَوْد قد كاد يصلحوالتحيْت : قشرّت ، أي قددت ، بمعنى : أنّه أخذ جلداً من باطن عنق بعير وعمله سوطا ليضرب به امرأتيه ، يهدّدهما بأنّ السوط قد جَفّ وصلح لأن يضرب به .وقد ثبت في «الصحيح» أنّ عمر بن الخطاب قال : ( كنا معشر المهاجرين قوما نغلب نساءنا فإذا الأنصار قوم تغلبهم نساؤهم فأخذ نساؤنا يتأدّبن بأدب نساء الأنصار ) . فإذا كان الضرب مأذونا فيه للأزواج دون وُلاة الأمور ، وكان سببه مجرّد العصيان والكراهِية دون الفاحشة ، فلا جرم أنّه أذن فيه لقوم لا يعُدّون صدوره من الأزواج إضراراً ولا عارا ولا بدعا من المعاملة في العائلة ، ولا تشعر نساؤهم بمقدار غضبهم إلاّ بشيء من ذلك .وقوله : { فعظوهن واهجروهن في المضاجع واضربوهن } مقصود منه الترتيب كما يقتضيه ترتيب ذكرها مع ظهور أنّه لا يراد الجمع بين الثلاثة ، والترتيب هو الأصل والمتبادر في العطف بالواو ، قال سعيد بن جبير : يعظها ، فإن قبلت ، وإلاّ هجرها ، فإن هي قبلت ، وإلاّ ضربها ، ونُقل مثله عن علي .واعلم أنّ الواو هنا مراد بها التقسيم باعتبار أقسام النساء في النشوز .وقوله : { فإن أطعنكم فلا تبغوا عليهن سبيلاً } احتمال ضمير الخطاب فيه يجري على نحوما تقدّم في ضمائر { تخافون } وما بعده ، والمراد الطاعة بعد النشوز ، أي إن رجعن عن النشوز إلى الطاعة المعروفة . ومعنى : { فلا تبغوا عليهن سبيلاً } فلا تطلبوا طريقاً لإجراء تلك الزواجر عليهنّ ، والخطاب صالح لكلّ من جعل له سبيل على الزوجات في حالة النشوز على ما تقدّم .والسبيل حقيقتُه الطريق ، وأطلق هنا مجازاً على التوسّل والتسبّب والتذرّع إلى أخذ الحقّ ، وسيجيء عند قوله تعالى : { ما على المحسنين من سبيل } في سورة براءة ( 91 ) ، وانظر قوله الآتي { وألقوا إليكم السلم فما جعل الله لكم عليهم سبيلاً } .و { عليهنّ } متعلّق ب ( سبيلا ) لأنّه ضمّن معنى الحكم والسلطان ، كقوله تعالى : { ما على المحسنين من سبيل } \\[ التوبة : 91 \\] .وقوله : { إن الله كان علياً كبيراً } تذييل للتهديد ، أي إنّ الله عليٌّ عليكم ، حاكم فيكم ، فهو يعدل بينكم ، وهو كبير ، أي قويّ قادر ، فبوصف العلوّ يتعيّن امتثال أمره ونهيه ، وبوصف القدرة يُحذر بطشه عند عصيان أمره ونهيه .ومعنى { تخافون نشوزهن } تخافون عواقبه السيّئة . فالمعنى أنّه قد حصل النشوز مع مخائل قصد العصيان والتصميم عليه لا مطلق المغاضبة أو عدم الامتثال ، فإنّ ذلك قلّما يخلو عنه حال الزوجين ، لأنّ المغاضبة والتعاصي يعرضان للنساء والرجال ، ويزولان ، وبذلك يبقى معنى الخوف على حقيقته من توقّع حصول ما يضرّ ، ويكون الأمر بالوعظ والهجر والضرب مراتبَ بمقدار الخوف من هذا النشوز والتباسه بالعدوان وسوء النية .والمخاطب بضمير { تخافون } إمَّا الأزواج ، فتكون تعْدية ( خاف ) إليه على أصل تعدية الفعل إلى مفعوله ، نحو { فلا تخافوهم وخافون } \\[ آل عمران : 175 \\] ويكون إسناد { فعظوهن واهجروهن واضربوهن } على حقيقته .13 ) : { تؤمنون بالله ورسوله } إلى قوله : { وبشر المؤمنين } فإنّه جعل ( وبشّر ) عطفاً على ( تؤمنون ) أي فهو خطاب للجميع لكنّه لمّا كان لا يتأتّى إلاّ من الرسول خصّ به . وبهذا التأويل أخذ عطاء إذ قال : لا يضرب الزوج امرأته ولكن يغضب عليها . قال ابن العربي : هذا من فقه عطاء وفهمه الشريعة ووقوفه على مظانّ الاجتهاد علم أنّ الأمر بالضرب هنا أمر إباحة ، ووقف على الكراهية من طريق أخرى كقول النبي \" ولن يضرب خياركم \" . وأنا أرى لعطاء نظرا أوسع ممّا رآه له ابن العربي : وهو أنّه وضع هاته الأشياء مواضعها بحسب القرائن ، ووافقه على ذلك جمع من العلماء ، قال ابن الفرس : وأنكروا الأحاديث المرويَّة بالضرب . وأقول : أو تأوّلوها . والظاهر أنّ الإذن بالضرب لمراعاة أحوال دقيقة بين الزوجين فأذن للزوج بضرب امرأته ضرب إصلاح لقصد إقامة المعاشرة بينهما؛ فإن تجاوز ما تقتضيه حالة نشوزها كان معتديا .ولذلك يكون المعنى واللاتي تخافون نشوزهن } أي تخافون سوء مغبّة نشوزهنّ ، ويقتضي ذلك بالنسبة لولاة الأمور أنّ النشوز رفع إليهم بشكاية الأزواج ، وأنّ إسناد { فعظوهن } على حقيقته ، وأمّا إسناد { واهجروهن في المضاجع } فعلى معنى إذن الأزواج بهجرانهنّ ، وإسناد { واضربوهن } كما علمت .وضمير المخاطب في قوله : { فإن أطعنكم } يجري على التوزيع ، وكذلك ضمير { فلا تبغوا عليهن سبيلاً } .والحاصل أنّه لا يجوز الهجر والضرب بمجرّد توقّع النشوز قبل حصوله اتّفاقاً ، وإذا كان المخاطب الأزواج كان إذنا لهم بمعاملة أزواجهم النواشز بواحدة من هذه الخصال الثلاث ، وكان الأزواج مؤتمنين على توخّي مواقع هذه الخصال بحسب قوّة النشوز وقدره في الفساد ، فأمّا الوعظ فلا حدّ له ، وأمّا الهجر فشرطه أن لا يخرج إلى حدّ الإضرار بما تجده المرأة من الكمد ، وقد قدّر بعضهم أقصاه بشهر .وأمّا الضرب فهو خطير وتحديده عسير ، ولكنّه أذن فيه في حالة ظهور الفساد؛ لأنّ المرأة اعتدَتْ حينئذ ، ولكن يجب تعيين حدّ في ذلك ، يبيّن في الفقه ، لأنّه لو أطلق للأزواج أن يتولّوه ، وهم حينئذ يشْفُون غضبهم ، لكان ذلك مظنّة تجاوز الحدّ ، إذ قلّ من يعاقب على قدر الذنب ، على أن أصل قواعد الشريعة لا تسمح بأن يقضي أحد لنفسه لولا الضرورة . بيد أنّ الجمهور قيّدوا ذلك بالسلامة من الإضرار ، وبصدوره ممّن لا يعدّ الضرب بينهم إهانة وإضراراً . فنقول : يجوز لولاة الأمور إذا علموا أنّ الأزواج لا يحسنون وضع العقوبات الشرعية مواضعَها ، ولا الوقوفَ عند حدودها أن يضربوا على أيديهم استعمال هذه العقوبة ، ويعلنوا لهم أنّ من ضرب امرأته عوقب ، كيلا يتفاقم أمر الإضرار بين الأزواج ، لا سيما عند ضعف الوازع .\n\n",
      "translations": [
        {
          "translation": "(Men are in charge of women) they are in charge of overseeing the proper conduct of women, (because Allah hath made the one of them) the men through reason and the division of booty and estates (to excel the other) the women, (and because they spend of their property (for the support of women)) through paying the dowry and spending on them, which the women are not required to do. (So good women) He says: those wives who are kind to their husbands (are the obedient) they are obedient to Allah regarding their husbands, (guarding) their own persons and the wealth of their husbands (in secret) when their husbands are not present (that which Allah hath guarded) through Allah's protection of them in that He gave them the success to do so. (As for those from whom ye fear) know (rebellion) their disobedience to you in bed, (admonish them) by means of sacred knowledge and the Qur'an (and banish them to beds apart) turn your faces away from them in bed, (and scourge them) in a mild, unexaggerated manner. (Then if they obey you) in bed, (seek not a way against them) as regards love. (Lo! Allah is ever High Exalted) above every single thing, (Great) greater than every single thing. Allah has not burdened you with that which you cannot bear, so do not burden women with that which they cannot bear of affection.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلاَ تَبْغُواْ عَلَيْهِنَّ سَبِيلاً } يعني لا تَعْلَّوا عَليهنَّ بالذِنُوبِ\n\n",
      "translations": [
        {
          "translation": " And His saying, {So do not oppress them} means do not wrong them with sins.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم نبه سبحانه على تفضيل { ٱلرِّجَالُ } المعتدلة المزاج المستقيمة العقول { قَوَّٰمُونَ } حافظون { عَلَى ٱلنِّسَآءِ } إذ لا بد لهن لضعفهن من حفيظ يرقبهن عما يشتهين\n صيانة لعفتهن { بِمَا فَضَّلَ ٱللَّهُ } به { بَعْضَهُمْ عَلَىٰ بَعْضٍ } أي: بعض بني آدم على بعض\n وهو الحمية المنبعثة من كمال العقل { وَبِمَآ أَنْفَقُواْ } لهن { مِنْ أَمْوَٰلِهِمْ } التي حصلت لهم من مكاسبهم { فَٱلصَّٰلِحَٰتُ } العفائف من النساء { قَٰنِتَٰتٌ } مطيعات لأزواجهن\n خادمات لهم ظاهراً { حَٰفِظَٰتٌ لِّلْغَيْبِ } أي: لحقوقهم المخفية الباطنة عنهم\n تابعات ممتثلات { بِمَا حَفِظَ ٱللَّهُ } لهن من رعاية أزواجهن وعدم الخيانة في حقوقهم\n\n\n{ وَ } النساء { ٱلَّٰتِي تَخَافُونَ نُشُوزَهُنَّ } عصيانهن وعدم خفظهن بحقوق الزواج من أمارات ظهرت منهن { فَعِظُوهُنَّ } أي: فعليكم أيها الأزواج أن تعظوهن رفقاً بما وعظ الله لهن من رعاية حقوق الله وحقوق الأزواج لعلهن يفطن ويتركن ما عليهن { وَ } إن لم يتركن { ٱهْجُرُوهُنَّ } اتركوهن { فِي ٱلْمَضَاجِعِ } وحدية فلا ترجعوا إليه\n بل اعتزلوا عنهن لعلهن يتأثرن بها { وَ } إن لم يتأثرن بها أيضاً { ٱضْرِبُوهُنَّ } ضرباً مؤلماً غير متجاوز عن الحد { فَإِنْ أَطَعْنَكُمْ } بامتثال هذه التأديبات { فَلاَ تَبْغُواْ } لا تطلبوا { عَلَيْهِنَّ } لطلاقهن وإخراجهن { سَبِيلاً } استعلاء وترفعاً { إِنَّ ٱللَّهَ } المصلح لأحوال عباده { كَانَ عَلِيّاً } في شأنه { كَبِيراً } [النساء: 34] في أحكامه\n لا ينازع في حكمه\n ولا يُسأل عن أمره\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { فالصالحات } مبتدأ، وما بعده إخبار عنه، وأتى بالفاء المؤذنة بالنسببية والتفريع، وكأنه تعالى يقول: الرجال قوامون على النساء، فمن كانت صالحة قام عليها بما تستحقه من حسن المعاشرة، ومن كانت ناشزة عاملها بما تستحقه من الوعظ وغيره. وكل ما هنا من لفظ ما فهي مصدرية. إلا ما قرأ به أبو جعفر: [بما حفظ الله] بالنصب، فهي عنده موصولة اسمية، أي: بالأمر الذي حفظ الله وهو طاعتها لله فحفظها بذلك، وقيل إنها مصدرية. انظر الثعلبي. يقول الحقّ جلّ جلاله: { الرجال قوّامون على النساء } أي: قائمون عليهن قيام الولاة على الرعية، في التأديب والإنفاق والتعليم، ذلك لأمرين: أحدهما وهبي، والآخر كسبي فالوهبي: هو تفضيل الله لهم على النساء بكمال العقل وحسن التدبير ومزيد القوة في الأعمال والطاعات، ولذلك خُصوا بالنبوة، والإمامة، والولاية، وإقامة الشعائر، والشهادة، في مجامع القضايا، ووجوب الجهاد والجمعة ونحوهما، والتعصيب، وزيادة السهم في الميراث، والاستبداد بالطلاق. والكسبي هو: { بما أنفقوا من أموالهم } في مهورهن، ونفقتهن، وكسوتهن. فيجب على الزوج أن يقوم العدل في أمر نسائه، فالمرأة الصالحة القانتة، أي: المطيعة لزوجها ولله تعالى، الحافظة للغيب، أي: لما غاب عن زوجها من مال بيته وفرجها وسر زوجها، حفظت ذلك بحفظ الله، أي: بما جعل الله فيها من الأمانة والحفظ، وبما ربط على قلبها من الديانة، أو بحفظها حق الله، فلما حفظت حقوق الله حفظها الله بعصمته، لقوله ـ عليه الصلاة والسلام ـ:\n \" احفَظَ اللهَ يَحفَظكَ \" \nفمن كانت على هذا الوصف من النساء فيجب على الزوج حُسن القيام بها، ومقابلتها في القيام بما قابلته من الإحسان، وعنه صلى الله عليه وسلم أنه قال\n \" خير النساء أمرأةٌ إن نَظَرتَ إلَيهَا سَرَّتكَ، وإن أمرتها أطَاعَتكَ، وإن غِبتَ حفظتك في مَالِها ونَفسِهَا \" \nوتلا هذه الآية. وأما النساء التي { تخافون } أي: تتيقنون { نشوزهن } أي: ترفعهن عن طاعة أزواجهن وعصيانهن، { فعظوهن } بالقول، فإن لم ينفع فاهجروهن في المضاجع، أي: لا تدخلوا معهن في لحاف، أو لا تجامعوهن، فإن لم ينفع فاضربوهن ضربًا غير مؤلم ولا شائن. قال صلى الله عليه وسلم:\n \" عَلِّق السَّوطَ حَيثُ يَرَاهُ أهلُ البيت \" \nوعن أسماء بنت أبي بكر ـ رضي الله عنهما ـ قالت:  كنتُ رابعَ نسوة عند الزبير بن العوام، فإذا غضب على إحدانا، ضربها بعود المِشجب، حتى ينكسر. والمشجب: أعواد مركبة يجعل عليها الثياب. { فإن أطعنكم } يا معشر الأزواج، أو عقدن التوبة مما مضى، { فلا تبغوا عليهن سبيلاً } أي: لا تطلبوا عليهن طريقًا تجعلونه سبيلاً لإيذائهن، بل اجعلوا ما كان منها من النشوز كأن لم يكن،  فإنَّ التَّائِبَ مِن الذَّنبِ كَمَن لا ذَنَب لَهُ.\nوقال ابن عُيَيْنَة: أي لا تكلفوهن بحبكم. هـ. وقال الورتجبي: إذا حصل منهن صورة طاعة الرجال فلا يطلب منهن موافقة الطباع، فإن ذلك منازعة للقدر. قال تعالى:\n[الرُّوم:30]، وذكر حديث\n \" الأروَاح جُنودٌ مُجنَّدةٌ \". \nثم هدد الأزواج فقال: { إن الله كان عليًّا كبيراً } فاحذروه، فإنه أقدر عليكم منكم على من تحت ولايتكم، أو: إنه على علو شأنه، يتجاوز عن سيئاتكم، فأنتم أولى بالعفو عن نسائكم، أو: أنه يتعالى ويَكبر أن يظلم أحدًا أو يُنقص حقه. وسبب نزول الآية: أن سَعدَ بنَ الرَّبِيع، وَكَانَ مِن النُقَبَاءِ، لَطَمَ امرأته حَبيبَةَ بِنتَ زَيدِ بن أبي زُهَيرِ، وكانت نَشَزَتَ عَليهِ، فَانطَلَقَ أبُوُها معَهَا إلى رسولِ الله صلى الله عليه وسلم فقال: أفرَشتُهُ كَرِيمَتِي فَلَطَمَها، فقال ـ عليه الصلاة والسلام ـ:\n \" لِتقتَصَّ مِنهُ، \" \nفَانصرَفَت لتقتصّ منه فقال صلى الله عليه وسلم:\n \" ارجعوا، هذا جِبرِيلُ أتَاني وأنزَلَ الله هَذِهِ الآية: { الرجال قوامون على النساء } \" \nإلى آخرها، فقال عليه الصلاة والسلام:\n \" أَرَدنَا أمرًا، وأرَادَ اللهُ أمرًا، والَّذِي أرَاد اللهُ خَير \" \nفرفع القِصَاص. وقيل: نزلت في غيره ممن وقع له مثل هذا من النشوز. والله تعالى أعلم. الإشارة: الرجال الأقوياء قوامون على نفوسهم قهارون لها، بفضل القوة التي مكنهم الله منها، وبما أنفقوا عليها من المجاهدات والرياضات، فهم ينظرون إليها ويتهمونها في كل حين، فإن صلحت وأطاعت وانقادت لما يراد منها من أحكام العبودية، والقيام بوظائف الربوبية، عاملوها بالإكرام والإجمال، ورفعوا عنها الآداب والنكال، وإن نشزت وترفعت أدبوها وهجروها عن مواطن شهواتها ومضاجع نومها، وضربوها على قدر لجاجها وغفلتها.  وكان الشيخ أبو يزيد يأخذ قبضة من القضبان ويذهب إلى خلوته، فكلما غفلت ضربها، حتى يكسرها كلها، وكان بعض أصحابنا يأخذ خشبة ويذهب إلى خلوته، فكلما غفل ضرب رأسه به، حتى يأتي رأسُه كلَّه مفلول، وبلغني أن بعض أصحابنا كان يُدخل في لحمة رجله سكيناً كلما غفل قلبه، وهذا إغراق، وخير الأمور أوسطها. وبالله التوفيق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:128",
      "similarity": 0.29442776142494065
    },
    {
      "verse": "32:16",
      "similarity": 0.2905728275551667
    },
    {
      "verse": "3:154",
      "similarity": 0.2192058114369218
    },
    {
      "verse": "3:17",
      "similarity": 0.17575187629368552
    },
    {
      "verse": "2:238",
      "similarity": 0.17367337879832892
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004034.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004034.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:34.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}