{
  "chapter": "النساء",
  "text": "وان خفتم شقاق بينهما فابعثوا۟ حكما من اهله وحكما من اهلها ان يريدا اصلحا يوفق الله بينهما ان الله كان عليما خبيرا",
  "translations": [
    {
      "translation": "If you fear a breach between a couple, send an arbiter from his people and an arbiter from her people. If the couple desire to put things right, Allah will bring about a reconciliation between them. Allah is All-Knowing, All-Aware.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you fear a breach between them, appoint one arbiter from the people of the man and one from the people of the woman. If they wish to have a settlement then God will reconcile them, for God is all-knowing and cognisant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you fear a breach between the two, appoint an arbitrator from his people and an arbitrator from her people. If they both want to set things right, Allah will bring about reconciliation between them. Allah knows all, is well aware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If there appears to be discord between a wife and her husband and if they desire reconciliation choose arbiters from the families of both sides. God will bring them together; God is All-knowing and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you fear a dispute between husband and wife, send an arbitrator from the man’s family and an arbitrator from the woman’s family; if these two wish conciliation, Allah will unite them; indeed Allah is All Knowing, Well Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you fear a breach between the two, appoint (two) arbitrators, one from his family and the other from her's; if they both wish for peace, Allah will cause their reconciliation. Indeed Allah is Ever All-Knower, Well-Acquainted with all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you fear a breach between the two, then appoint judge from his people and a judge from her people; if they both desire agreement, Allah will effect harmony between them, surely Allah is Knowing, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you fear a breach between the two, bring forth an arbiter from his people and from her people an arbiter, if they desire to set things right; God will compose their differences; surely God is All-knowing, All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye fear a breach between them twain (the man and wife), appoint an arbiter from his folk and an arbiter from her folk. If they desire amendment Allah will make them of one mind. Lo! Allah is ever Knower, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you fear any breach between a man and his wife, appoint one arbiter from his family and one arbiter from her family. If they both want to set things right, God will bring about a reconciliation between them: He is all knowing and all aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye fear a divergence between the twain, set up an arbiter from his household and an arbiter from her household; then if the twain desire rectification Allah shall bring harmony between the twain; verily Allah is ever Knowing, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you fear a split between the two of them, then appoint an arbiter from his relatives and an arbiter from her relatives. If they desire reconcilement, Allah shall reconcile them. Indeed Allah is all-knowing, all-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye fear a breach between them twain, appoint (two) arbiters, one from his family, and the other from hers; if they wish for peace, Allah will cause their reconciliation: For Allah hath full knowledge, and is acquainted with all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you fear a breach between them twain (the man and his wife), appoint (two) arbitrators, one from his family and the other from her's; if they both wish for peace, Allah will cause their reconciliation. Indeed Allah is Ever All-Knower, Well-Acquainted with all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you fear a breach between them send for an arbiter from his people and an arbiter from her people. If both wish reconciliation, Allah will bring success between them. Allah is the Knower, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you fear a breach between the two, appoint an arbiter from his family and an arbiter from her family. If they wish to reconcile, God will bring them together. God is Knowledgeable, Expert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you fear dissension between the two, send an arbitrator from his people and an arbitrator from her people. If they both desire reconciliation, Allah will cause it between them. Indeed, Allah is ever Knowing and Acquainted [with all things].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:35]   And if you fear, become aware of, a breach, a dispute, between the two, the married couple (the genitive construction shiqāqa baynihimā, ‘[any] breach between the two’, is for a range [of alternatives], in other words: shiqāqan baynihimā [is the normal construction]) send forth, for them with their consent, an arbiter, a just man, from his folk, his kinsmen, and an arbiter from her folk: the husband delegates to his arbiter the [matter of] divorce or the acceptance of compensation in its place, while she delegates to her arbiter the [matter of] separation. The two arbiters do their best and bid the one guilty of the injustice to desist, or they suggest separation if they see fit. God, exalted be He, says, if they, the two arbiters, desire to set things right, God will grant them, the married couple, success, determining for them what constitutes [an act of] obedience, be it reconciliation or separation. Surely God is ever Knower, of everything, Aware, of what is hidden and what is manifested.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على جملة \" والتي تخافون نشوزهن \" \\[ النساء : 34 \\] وهذا حكم أحوال أخرى تعرض بين الزوجين ، وهي أحوال الشقاق من مخاصمة ومغاضبة وعصيان ، ونحو ذلك من أسباب الشقاق ، أي دون نشوز من المرأة .والمخاطب هنا وُلاَة الأمور لا محالة ، وذلك يرجّح أن يكونوا هم المخاطبين في الآية التي قبلها .والشِّقَاق مصدرٌ كَالمُشَاقّة ، وهو مشتقّ من الشِّق بكسر الشين أي الناحية . لأنّ كلّ واحد يصير في ناحية ، على طريقة التخييل ، كما قالوا في اشتقاق العدوّ : إنّه مشتقّ من عدوة الوادي . وعندي أنّه مشتقّ من الشَّقّ بفتح الشين وهو الصدع والتفرّع ، ومنه قولهم : شقّ عصا الطاعة ، والخلاف شقاق . وتقدّم في سورة البقرة ( 137 ) عند قوله تعالى : { وإن تولوا فإنما هم في شقاق } وأضاف الشقاق إلى ( بين ) . إمّا لإخراج لفظ ( بين ) عن الظرفية إلى معنى البعد الذي يتباعده الشيئان ، أي شقاقَ تباعد ، أي تجَاف ، وإمّا على وجه التوسّع ، كقوله بل مكر اليل وقول الشاعر :يا سارق الليلة أهلَ الدار ... ومن يقول بوقوع الإضافة على تقدير ( في ) يجعل هذا شاهداً له كقوله : { هذا فراق بيني وبينك } \\[ الكهف : 78 \\] ، والعرب يتوسّعون في هذا الظرف كثيراً ، وفي القرآن من ذلك شيء كثير ، ومنه قوله : { لقد تقطع بينكم } \\[ الأنعام : 94 \\] في قراءة الرفع .وضمير { بينهما } عائد إلى الزوجين المفهومين من سياق الكلام ابتداء من قوله : { الرجال قوامون على النساء } \\[ النساء : 4 \\] .والحكم بفتحتين الحاكم الذي يُرضى للحكومة بغير ولاية سابقة ، وهو صفة مشبّهة مشتقّة من قولهم : حكّموه فحكُم ، وهو اسم قديم في العربية ، كانوا لا ينصبون القضاة ، ولا يتحاكمون إلاّ إلى السيف ، ولكنّهم قد يرضون بأحد عقلائهم يجعلونه حكماً في بعض حوادثهم ، وقد تحاكم عامر بن الطُّفيل وعلقمة بن عُلاَثَةَ لدى هَرِم بن سنان العبسي ، وهي المحاكمة التي ذكرها الأعشى في قصيدته الرائية القائل فيها :عَلْقَمَ ما أنتَ إلى عامر ... الناقضِ الأوتارِ والواتروتحاكم أبناء نزار بن معدّ بن عدنان إلى الأفعى الجُرهمي ، كما تقدّم في هذه السورة .والضميران في قوله : { من أهله } و { من أهلها } عائدان على مفهومين من الكلام : وهما الزوج والزوجة ، واشترط في الحكمين أن يكون أحدهما من أهل الرجل والآخر من أهل المرأة ليكونا أعلم بدخلية أمرهما وأبصر في شأن ما يرجى من حالهما ، ومعلوم أنّه يشترط فيهما الصفات التي تخوّلهما الحكم في الخلاف بين الزوجين . قال ملك : إذا تعذّر وجود حكمين من أهلهما فيبعث من الأجانب ، قال ابن الفرس : «فإذا بعث الحاكم أجنبيّين مع وجود الأهل فيشبه أن يقال ينتقض الحكم لمخالفة النصّ ، ويشبه أن يقال ماض بمنزلة ما لو تحاكموا إليهما» . قلت : والوجه الأوّل أظهر . وعند الشافعية كونهما من أهلهما مستحبّ فلو بعثا من الأجانب مع وجود الأقارب صحّ .والآية دالّة على وجوب بعث الحكمين عند نزاع الزوجين النزاعَ المستمرّ المعبّر عنه بالشقاق ، وظاهرها أنّ الباعث هو الحاكم ووليّ الأمر ، لا الزوجان ، لأنّ فعل { ابعثوا } مؤذن بتوجيههما إلى الزوجين ، فلو كانا معيّنين من الزوجين لما كان لفعل البعث معنى . وصريح الآية : أنّ المبعوثين حكمان لا وكيلان ، وبذلك قال أيمّة العلماء من الصحابة والتابعين . وقضى به عمر بن الخطاب ، وعثمان بن عفّان ، وعلي بن أبي طالب ، وقاله ابن عباس ، والنخعي ، والشعبي ، ومالك ، والأوزاعي ، والشافعي ، وإسحاق . وعلى قول جمهور العلماء فما قضى به الحكمان من فرقة أو بقاء أو مخالعة يمضي ، ولا مقال للزوجين في ذلك لأنّ ذلك معنى التحكيم ، نعم لا يَمنع هؤلاء من أن يوكّل الزوجان رجلين على النظر في شؤونهما ، ولا من أن يحكّما حكمين على نحو تحكيم القاضي . وخالف في ذلك ربيعة فقال : لا يحكم إلاّ القاضي دون الزوجين ، وفي كيفية حكمهما وشروطه تفصيل في كتب الفقه .وتأوّلت طائفة قليلة هذه الآية على أنّ المقصود بعث حكمين للإصلاح بين الزوجين وتعيين وسائل الزجر للظالم منهما ، كقطع النفقة عن المرأة مّدة حتّى يصلح حالها ، وأنّه ليس للحكمين التطليق إلاّ برضا الزوجين ، فيصيران وكيلين ، وبذلك قال أبو حنيفة ، وهو قولٌ للشافعي ، فيريد أنّهما بمنزلة الوكيل الذي يقيمه القاضي عَن الغائب . وهذا صرف للفظ الحكمين عن ظاهره ، فهو من التأويل . والباعث على تأويله عند أبي حنيفة : أنّ الأصل أنّ التطليق بيد الزوج ، فلو رأى الحكمان التطليق عليه وهو كاره كان ذلك مخالفة لدليل الأصل فاقتضى تأويل معنى الحكمين ، وهذا تأويل بعيد؛ لأنّ التطليق لا يَطَّرِد كونه بيد الزوج؛ فإنّ القاضي يطلّق عند وجود سبب يقتضيه .وقوله تعالى : { إن يريداً إصلاحاً } الظاهر أنّه عائد إلى الحكمين لأنّهما المسوق لهما الكلام ، واقتصر على إرادة الإصلاح لأنّها التي يجب أن تكون المقصد لولاة الأمور والحكمين ، فواجبُ الحكمين أن ينظرا في أمر الزوجين نظراً منبعثاً عن نية الإصلاح ، فإن تيسّر الإصلاح فذلك وإلاّ صارا إلى التفريق ، وقد وعدهما الله بأن يوفّق بينهما إذا نويا الإصلاح ، ومعنى التوفيق بينهما إرشادهما إلى مصادفة الحقّ والواقععِ ، فإنّ الاتّفاق أطمَن لهما في حكمهما بخلاف الاختلاف ، وليس في الآية ما يدلّ على أنّ الله قصر الحَكَمين على إرادة الإصلاح حتّى يكون سنداً لتأويل أبي حنيفة أنّ الحكمين رسولان للإصلاح لا للتفريق ، لأنّ الله تعالى ما زاد على أن أخبر بأنّ نية الإصلاح تكون سبباً في التوفيق بينهما في حكمهما ، ولو فهم أحد غير هذا المعنى لكان متطوّحا عن مفاد التركيب .وقيل : الضمير عائد على الزوجين ، وهذا تأويل مَن قالوا : إنّ الحكمين يبعثهما الزوجان وكيلين عنهما ، أي إن يُرد الزوجان من بعث الحكمين إصلاح أمرهما يوفّق الله بينهما ، بمعنى تيسير عَوْد معاشرتهما إلى أحسن حالها . وليس فيها على هذا التأويل أيضاً حجّة على قصر الحكمين على السعي في الجمع بين الزوجين دون التفريق : لأنّ الشرط لم يدلّ إلاّ على أنّ إرادة الزوجين الإصلاح تحقّقه ، وإرادتهما الشقاق والشغب تزيدهما ، وأين هذا من تعيين خطّة الحكمين في نظر الشرع .وهذه الآية أصل في جواز التحكيم في سائر الحقوق ، ومسألة التحكيم مذكورة في الفقه .\n\n",
      "translations": [
        {
          "translation": "(And if ye fear) if you know (a breech between them twain (the man and wife)) a dispute between the man and woman and you cannot establish who is at fault, (appoint an arbiter from his folk) from the man's folk to the man so that he can hear what he has to say and therefore establish whether he is in the right or wrong (and an arbiter from her folk) from the woman's folk to the woman in order to hear what she has to say and therefore establish whether she is in the right or wrong. (If they) the arbiters (desire amendment) between the man and the woman, (Allah will make them of one mind) i.e. the arbiters, the man and the woman. (Lo! Allah is ever Knower) of the agreement and disagreement of the arbiters, (Aware) of the doing of the woman and the man. The verses from Allah's saying: (Men are in charge of women, because Allah hath made the one of them to excel the other...) to His saying: (If they desire amendment Allah will make them of one mind. Lo! Allah is ever Knower, Aware) were revealed about the daughter of Muhammad Ibn Salamah. Her husband, As'ad Ibn al-Rabi' had slapped her because she refused to sleep with him. Consequently, she went to the Prophet (pbuh) to seek retaliation against her husband, but Allah prohibited her from doing so.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِنْ خِفْتُمْ شِقَاقَ بَيْنِهِمَا } معناهُ أَيْقَنتُم تباعدَ ما بِينَهِمَا\n والشِّقَاقُ: العَدَاوةُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd if you fear division between them, {then be assured that} you will have peace between them.\n\n\nAnd the conflict: the hatred.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِنْ } تطالوت الخصومة والنزاع بينهما حتى { خِفْتُمْ } وظننتم أيها الحكام { شِقَاقَ بَيْنِهِمَا } وآيستم عن المصالحة والوفاق { فَٱبْعَثُواْ } أي: فعليكم أيها الحكام أن بعثوا { حَكَماً } مصلحاً ذا رأي { مِّنْ أَهْلِهِ } أي: من أقاربه { وَحَكَماً } مثل ذلك { مِّنْ أَهْلِهَآ } ليصيرا وكيلين عنهما يصلحا صلاحاً وطلاقاً وخلعاً وفداء\n ثم { إِن يُرِيدَآ } أي: الحكمان { إِصْلَٰحاً } لأمرهما ورفعاً لنزاعهما { يُوَفِّقِ ٱللَّهُ بَيْنَهُمَآ } إن رضيا بمصالحتهما وإلا فليرفعا عقد النكاح بينهما على أي طريق كان { إِنَّ ٱللَّهَ } المطلع لضمائر عباده { كَانَ عَلِيماً } بنزاعهما { خَبِيراً } [النساء: 35] بما يؤول إليه النزاع",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: الشقاق: المخالفة والمساورة، وأضيف إلى الظرف توسعًا كقوله:\n[سَبَأ:32]، والأصل: شقاقًا بينهما، والضمير في { يُريدا } للحكمين، وفي { بينهما } للزوجين، وقيل: للحكمين معًا، وقيل: للزوجين معًا. يقول الحقّ جلّ جلاله: { وإن خفتم } يا معشر الحكام، أي علمتم خلافَا بين الزوجين ومشاررة، ولم تدروا الظالم من المظلوم، { فابعثوا } رجلين أمينين يحكمان بينهما، يكون أحداهما من أهله والآخر من أهلها، لأن الأقارب أعرف ببواطن الأحوال، وأطلب للإصلاح، فإن بعثهما الحاكمُ أجنبيين صح، وكذا إن أقامهما الزوجان. وما اتفق عليه الحكمان لزم الزوجين من خُلع أو طلاق أو وفاق. وقال أبو حنيفة: ليس لهما التطليق إلاَّ أن يجعل لهما، وإذا اختلفا لم يلزم شيء، ويستأنفان الحكم، قال ابن جُزَي: ومشهور مذهب مالك: أن الحاكم هو الذي يبعث الحكمين، وقيل: الزوجان، وجرت عادة القضاء أن يبعثوا امرأة أمينة ولا يبعثوا الحكمين، قال بعض العلماء: هو تغيير القرآن والسنة الجارية. هـ. فإن بُعِث الحكمان، فإن أرادا إصلاحًا بين الزوجين، واتفقا عليه، وفق الله بينهما ببركة قصدهما، وفيه تنبيه على أن من أصلح نيته فيما يتحراه أصلح الله مبتغاه. { إن الله كان عليمًا خبيرًا } بما في الظواهر والبواطن، فيعلم كيف يرفع الشقاق ويوقع الوفاق. الإشارة: وإن خفتم، أيها الشيوخ، على صاحبكم منازعة النفس والروح فكانت النفس تجمح به إلى أسفل سافلين، بمتابعة هواها وعصيان مولاها، والروح تجنح به إلى أعلى عليين، بجهاد هواها ومشاهدة مولاها، فابعثوا له واردين قويين، إما شوق مقلق يرحل الروح إلى مولاها، أو خوف مزعج يزجر النفس عن هواها. فإن أراد الله بذلك العبد إصلاحًا لحاله أرسلهما معًا متفقين على تخليصه وارتفاعه، فيتقدم الخوف المزعج ويستدركه الشوق المقلق، فيلتحق بأهل التحقيق من أهل التوفيق، وما ذلك على الله بعزيز، وفي الحكم: \" لا يُخرِج الشهوةَ من القلب إلا خوف مزعج، أو شوق مقلق \". والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:26",
      "similarity": 0.7970040483210619
    },
    {
      "verse": "11:88",
      "similarity": 0.6893503321752646
    },
    {
      "verse": "4:62",
      "similarity": 0.6589438904553451
    },
    {
      "verse": "84:1",
      "similarity": 0.19338255270817412
    },
    {
      "verse": "80:26",
      "similarity": 0.19323499846293948
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004035.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004035.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:35.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}