{
  "chapter": "النساء",
  "text": "واعبدوا۟ الله ولا تشركوا۟ به شيـا وبالولدين احسنا وبذى القربى واليتمى والمسكين والجار ذى القربى والجار الجنب والصاحب بالجنۢب وابن السبيل وما ملكت ايمنكم ان الله لا يحب من كان مختالا فخورا",
  "translations": [
    {
      "translation": "Worship Allah and do not associate anything with Him. Be good to your parents and relatives and to orphans and the very poor, and to neighbours who are related to you and neighbours who are not related to you, and to companions and travellers and your slaves. Allah does not love anyone vain or boastful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pay homage to God, and make none His compeer, and be good to your parents and relatives, the orphans and the needy and the neighbours who are your relatives, and the neighbours who are strangers, and the friend by your side, the traveller and your servants and subordinates. God does not surely love those who are arrogant and boastful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Serve Allah and ascribe no partner to Him. Do good to your parents, to near of kin, to orphans, and to the needy, and to the neighbour who is of kin and to the neighbour who is a stranger, and to the companion by your side, and to the wayfarer, and to those whom your right hands possess. Allah does not love the arrogant and the boastful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worship God and consider no one equal to Him. Be kind to your parents, relatives, orphans, the destitute, your near and distant neighbors, your companions, wayfarers, and your slaves. God does not love the proud and boastful ones,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And worship Allah and do not ascribe any partner to Him, and be good to parents, and to relatives, and orphans, and the needy, and the related neighbour and the unrelated neighbour, and the close companion and the traveller; and your bondwomen; indeed Allah does not like any boastful, proud person. –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worship Allah and join none with Him in worship, and do good to parents, kinsfolk, orphans, the poor, the neighbor who is near of kin, the neighbor who is a stranger, the companion by your side, the wayfarer (you meet), and those (slaves) whom your right hands possess. Verily, Allah does not like such as are proud and boastful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And serve Allah and do not associate any thing with Him and be good to the parents and to the near of kin and the orphans and the needy and the neighbor of (your) kin and the alien neighbor, and the companion in a journey and the wayfarer and those whom your right hands possess; surely Allah does not love him who is proud, boastful;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Serve God, and associate naught with Him. Be kind to parents, and the near kinsman, and to orphans, and to the needy, and to the neighbour who is of kin, and to the neighbour who is a stranger, and to the companion at your side, and to the traveller, and to that your right hands own. Surely God loves not the proud and boastful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And serve Allah. Ascribe no thing as partner unto Him. (Show) kindness unto parents, and unto near kindred, and orphans, and the needy, and unto the neighbour who is of kin (unto you) and the neighbour who is not of kin, and the fellow-traveller and the wayfarer and (the slaves) whom your right hands possess. Lo! Allah loveth not such as are proud and boastful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worship God: and do not associate partners with Him. Be good to your parents, to relatives, to orphans, to the needy, and the neighbour who is a kinsman, and the neighbour who is not related to you and your companions and the wayfarers and those whom you rightfully possess. God does not like arrogant, boastful people,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And worship Allah and associate not aught with Him; and unto parents show kindness, and also unto kindred and orphans and the needy and the near neighbour and the distant neighbour and the companion by your side and the wayfarer and those whom your right hands own Verily Allah loveth not one who is vainglorious, boaster-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worship Allah and do not ascribe any partners to Him, and be good to parents, the relatives, the orphans, the needy, the near neighbour and the distant neighbour, the companion at your side, the traveller, and your slaves. Indeed Allah does not like those who are arrogant and boastful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Serve Allah, and join not any partners with Him; and do good- to parents, kinsfolk, orphans, those in need, neighbours who are near, neighbours who are strangers, the companion by your side, the wayfarer (ye meet), and what your right hands possess: For Allah loveth not the arrogant, the vainglorious;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worship Allah and join none with Him in worship, and do good to parents, kinsfolk, orphans, Al-Masakin (the poor), the neighbour who is near of kin, the neighbour who is a stranger, the companion by your side, the wayfarer (you meet), and those (slaves) whom your right hands possess. Verily, Allah does not like such as are proud and boastful;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worship Allah and do not associate anything with Him. Be kind to parents and near kinsmen, to the orphans and to the needy, to your neighbor who is your kindred, and to the neighbor at your far side, and the companion at your side, and to the destitute traveler, and to that which your right hands owns. Allah does not love he who is proud and struts,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worship God, and ascribe no partners to Him, and be good to the parents, and the relatives, and the orphans, and the poor, and the neighbor next door, and the distant neighbor, and the close associate, and the traveler, and your servants. God does not love the arrogant showoff.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Worship Allah and associate nothing with Him, and to parents do good, and to relatives, orphans, the needy, the near neighbor, the neighbor farther away, the companion at your side, the traveler, and those whom your right hands possess. Indeed, Allah does not like those who are self-deluding and boastful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:36] And worship God, declare His Oneness, and associate nothing with Him. Be kind to parents, being dutiful and gentle-mannered, and near kindred, and to orphans, and to the needy, and to the neighbour who is near, to you in terms of [physical] vicinity or kinship, and to the neighbour who is a stranger, the one far from you in terms of [physical] vicinity or kinship; and to the friend at your side, a travelling companion, or a colleague at work, and, it is also said, one’s wife; and to the wayfarer, the one cut off during a journey, and to what your right hands own, of bondsmen. Surely God loves not the conceited, the arrogant, and the boastful, [the one who boasts] before people of what he has been given.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And serve Allah) acknowledge His divine Oneness. (Ascribe no thing) no idol (as partner unto Him. (Show) kindness unto parents) be dutiful to parents, (and unto near kindred) Allah commands you to keep ties with 88 your kin, (and orphans) He commands that you show kindness to orphans, and to protect their wealth, etc, (and the needy) and He enjoins giving alms to the needy, (and unto the neighbour who is of kin (unto you)) the neighbour who also happen to be your relative has three rights over you: the right of kinship, the right of Islam, and the right of being a neighbour (and the neighbour who is not of kin) the neighbour who is not a relative has two rights: the right of Islam and the right of being a neighbour (and the fellow traveller) a fellow traveller has two rights: the right of Islam and the right of companionship; it is also said that this refers to one's wife at home. Allah commands kindness towards her (and the wayfarer) Allah commands the honouring of guests. Honouring a guest for three days is the guest's right. The honour bestowed on the guest after the third day is considered a charity on the part of the host; (and (the slaves) whom your right hands possess) Allah commands kindness towards slaves, males and females. (Lo! Allah loveth not such as are proud) in their walking (and boastful) about the bounties of Allah, showing nothing but wantonness and arrogance towards Allah's servants,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱلْجَارِ ذِي ٱلْقُرْبَىٰ } معناهُ القَريبُ القَرابةِ { وَٱلْجَارِ ٱلْجُنُبِ } الغَريبُ\n والجنَابَةُ: الغُرْبَةُ والبُعْدُ\n\n\n\n\nوقوله تعالى: { وَٱلصَّاحِبِ بِٱلجَنْبِ } معناهُ المَرأةُ\n ويقالُ: الرَّفِيقُ فِي السَّفرِ يَنزلُ إِلى جَنْبِهِ\n وابن السَّبيلِ: الغَريبُ\n\n\n\n\nوقوله تعالى: { مُخْتَالاً فَخُوراً } فالمُخْتَالُ: ذُو الخُيَلاءِ والتَّكبُرِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"And the nearest neighbor,\" means the nearest neighbor, \"and the neighbor of the neighbor,\" the stranger.\n\n\nThe janabah is the west and the distance.\n\n\nAnd His saying - the Most High - {And the companion by the side}, its meaning is the woman.\n It is said: \"Your companion on a journey is like your shadow.\"\n The stranger\n\n\nAnd His saying, {Mukhtalan fakhura}, the Mukhtal is the one with many horses and arrogance.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما هذبتم ظواهركم أيها المؤمنون بهذه الأخلاق { ٱعْبُدُواْ ٱللَّهَ } الموحد في ذاته ووجوده\n المستقل في أفعاله وآثاره المترتبة على أوصافه الذاتية { وَلاَ تُشْرِكُواْ بِهِ شَيْئاً } من مصنوعاته\n أي: لا تثبتوا الوجود والأثر لغيره\n إذ الأغيار مطلقاً معدومة في أنفسها مستهلكة في ذاته سبحانه { وَ } افعلوا { بِٱلْوَٰلِدَيْنِ } اللذين هما سبب ظهوركم عادة { إِحْسَاناً } قولاً وفعلاً { وَ } أيضاً { بِذِي ٱلْقُرْبَىٰ } المنتمين إليهما بواستطهما { وَ } أيضاً { ٱلْيَتَٰمَىٰ } الذين لا متعهد لهم من الرجال { وَٱلْمَسَٰكِينِ } الذين أسكنهم الفقر في زاوية الهوان { وَٱلْجَارِ ذِي ٱلْقُرْبَىٰ } هم الذين لهم قرابة جوار بحيث يقع الملاقاة في كل يوم مرتين { وَٱلْجَارِ ٱلْجُنُبِ } هم الذين لهم بعد جوار\n بحث لا يقع التلاقي إلا بعد يوم أو يومين أو ثلاثة\n\n\n{ وَ } عليكم رعاية { ٱلصَّاحِبِ بِٱلجَنْبِ } أي: الذي معكم وفي جنبكم في السراء والضراء يصاحبكم ويعينكم { وَٱبْنِ ٱلسَّبِيلِ } المتباعدين عن الأهل والواطن لمصالح دينية\n مثل طلب العلم وصلة الرحم وحج البيت وغير ذلك { وَ } أيضاً من أهم المأمورات لكم رعاية { مَا مَلَكَتْ أَيْمَٰنُكُمْ } من العبيد والإماء والحيوانات المسنوبة إليكم\n وعليكم ألاَّ تتكبروا على هؤلاء المستحقين حين الإحسان\n ولا تتفوقوا عليهم بالامتنان { إِنَّ ٱللَّهَ } المتعزز برداء العظمة والكبرياء { لاَ يُحِبُّ مَن كَانَ مُخْتَالاً } متكبراً يمشي على الناس خيلاء { فَخُوراً } [النساء: 36] بفضله وماله أو نسبه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: الجُنب ـ بالضم ـ: البعيد، يقال فيه: جُنُب وأجنب وأجنبي، وسمي الجُنبُ جُنُبًا لأنه يبعد من المسجد وعن الصلاة وعن التلاوة، ومختال أسم فاعل، وأصله: مختيل، بالكسر، من الخُيَلاَء وهو التكبر. يقول الحقّ جلّ جلاله: { واعبدوا الله } أي: وَحِّدُوه وأطيعوه { ولا تشركوا به شيئًا } جليًا أو خفيًا في اعتقادكم أو في عبادتكم، فمن قصد الحج والتجارة، فقد أشرك مع الله في عبادته، وأحسنوا بالوالدين إحسانًا حسنًا، وهو برهما والقيام بحقهما، { وبذي القربى } ، أي: القرابة في النسب، أو الدين { واليتامى } لضعف حالهم، { والمساكين } لقلة ما بيدهم، وقد شكى بعض الناس قساوة قلبه، فقال له عليه الصلاة والسلام:\n \" إن أردتَ أن يلين قلبُك، فأطعم والمسكين وامسح رأس اليتيم، وأطعمه \". \n{ والجار ذي القربى } الذي قّرُب جواره أو نسبه، { والجار الجُنب } الذي بَعُد مكانه أو نسبه، وحَدَّد بعضُهم الجوار بأربعين دارًا من كل ناحية. وقال ابن عباس: الجار ذي القربى: الجار الذي بينك وبينه قرابة، والجار الجنب: الجار من قوم آخرين. هـ. قيل يا رسول الله: ما حق الجار على الجار قال:\n \" إن دعاك أجبتَه، وإن أصابته فاقةٌ عُدتَ عليه، وإن استقرضك أقرضته، وإن أصابه خير هنأته، وإن مرض عُدْتَه، وإن أصابته مصيبة عزيته، وإن توفي شهدت جنازته، ولا تستعل عليه بالبنيان لتحجب عنه الريح إلا بإذنه، ولا تؤذه بقُتار قدرك ـ أي: بخارها ـ إلا أن تغرف له منها، وإن ابتعت فاكهة فأهد له منها، فإن لم تفعل فأدخلها سرًا، ولا يخرج ولدك منها بشيء فيغيظ ولده، \" \nثم قال:\n \" الجيران ثلاثة: فَجَارٌ له ثلاثة حقوق: حق الجوَارِ، وحق القرابة، وحق الإسلام، وجار له حقان: حق الجِوَار، وحق الإسلام، وجَارٌ له حق واحد: وهو المشرك من أهل الكتاب \". \n{ والصاحب بالجنب } ، وهي الرفيق في أمر حسن، كتعلم وتصرف وصناعة وسفر، فإنه صحبك بجنبك، وعن علي ـ كرم الله وجهه ـ  أنها الزّوجة، فيتأكد في حقها الإحسان زيادة على المعاشرة بالمعروف، قال بعضهم: أول قدم في الولاية كفّ الأذى وحمل الجفا، ومعيار ذلك حسن معاشرة الأهل والولد، وقال ـ عليه الصلاة والسلام ـ:\n \" خَيرُكُمْ خَيْرُكُمْ لِنسَائِه، وأنَا خَيْرُكُمْ لِنسَائِي \" \n{ وابن السبيل } ، وهو الضيف أو المسافر لغرابته، { وما ملكت أيمانكم } ، من الإماء والعبيد، وكَانَ آخِرُ كلامِ النّبُي ـ عليه الصلاة والسلام ـ:\n \" الصلاةَ الصَلاةَ وَمَا مَلَكتْ أيمانُكُمْ \". \n{ إن الله لا يحب مَن كان مختالاً } أي: متكبراً، يأنف عن أقاربه وجيرانه وأصحابه ولا يلتفت إليهم، { فخورا } يتفاخر عليهم بماله وجاهه، وما خوله الله من نعمه، فهو جدير أن تسلب منه.\nالإشارة: واعبدوا الله، أي: بالقيام بوظائف العبودية، ومشاهدة عظمة الربوبية، وقال بعض الحكماء: العبودية: ترك الاختيار، وملازمة الذل والافتقار. وقيل: العبودية أربعة أشياء: الوفاء بالعهود، والحفظ للحدود، والرضا بالموجود، والصبر على المفقود، وعنوان ذلك صفاء التوحيد، ولذلك قال: { ولا تشركوا به شيئًا } أي: لا تَرَوْا معه غيره، كما قال القائل:\nوقال آخر:  لو كُلفت أن أرى غيره، لم أستطع، فإنه لا غير معه حتى أشهده. فإذا حصلت العبودية في الظاهر، وتحقق التوحيد في الباطن، ظهرت عليه مكارم الأخلاق فيُحسن إلى الأقارب والأجانب، ويجود عليهم بالحس والمعنى، لأن الفتوة من شأن أهل التوحيد، ومن شيم أهل التجريد، كما هو معلوم من حالهم، نفعنا الله بذكرهم، وخرطنا في سلكهم. آمين. قال الورتجبي: \" الوالدين \": مشايخ المعرفة. ثم نقل عن الجنيد، أنه قال: أمرني أبي أمرًا، وأمرني السري أمرًا. فقدمت أمر السري على أمر أبي، وكل ما وجدت فهو من بركاته. هـ. وذوو القربى هم الأخوة في الشيخ، { واليتامى }: من قصدهم من المتفقرة الجاهلة، { والمساكين }: ضعفاء اليقين من العامة، أمر الله تعالى أهل الخصوصية بالإحسان إليهم والبرور بهم، وهو أن يقرهم في طريقهم، وبحوشهم إلى ربهم. { والجار ذي القربى } وهو جارك في السكنى وأخوك في النسبة، فيستحق عليك زيادة الإحسان. { والجار الجنب }: من جاورك من العوام فتنصحه وترشده، { والصاحب بالجنب }: من رافقك في أمر من العوام، كَسَفَرٍ وغيره، { وابن السبيل }: من نزل بأهل الخصوصية من الأضياف، فلهم حق الضيافة عليهم حسًّا ومعنًى، { وما ملكت أيمانكم }: ما لكم تصرف عليهم الأهل والبنين والإماء والعبيد، فتقربونهم إلى حضرة الملك المجيد. ثم أمرهم بالتواضع والإقبال على الخاص والعام. فقال: { إن الله لا يحب مَن كان مختالاً فخورًا }. والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "57:23",
      "similarity": 0.42649855574158074
    },
    {
      "verse": "11:10",
      "similarity": 0.3767593857530747
    },
    {
      "verse": "55:14",
      "similarity": 0.3313009057757011
    },
    {
      "verse": "23:88",
      "similarity": 0.31334456649635983
    },
    {
      "verse": "9:6",
      "similarity": 0.29167745183429045
    }
  ]
}