{
  "chapter": "النساء",
  "text": "الذين يبخلون ويامرون الناس بالبخل ويكتمون ما ءاتىهم الله من فضله واعتدنا للكفرين عذابا مهينا",
  "translations": [
    {
      "translation": "Who are miserly and bid others to be so, and hide what God has given them in His largesse. We have prepared for unbelievers a shameful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who are niggardly and bid others to be niggardly and conceal the bounty which Allah has bestowed upon them. We have kept in readiness a humiliating chastisement for such deniers (of Allah's bounty).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the stingy ones who try to make others stingy or those who hide the favors that God has bestowed on them. We have prepared a humiliating torment for the disbelievers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are misers and preach miserliness to others, and hide what Allah has bestowed upon them from His munificence; and We have kept ready a disgraceful punishment for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are stingy and encourage people to be stingy and hide what Allah has bestowed upon them of His bounties. And We have prepared for the disbelievers a disgraceful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are niggardly and bid people to be niggardly and hide what Allah has given them out of His grace; and We have prepared for the unbelievers a disgraceful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "such as are niggardly, and bid other men to be niggardly, and themselves conceal the bounty that God has given them. We have prepared for the unbelievers a humbling chastisement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hoard their wealth and enjoin avarice on others, and hide that which Allah hath bestowed upon them of His bounty. For disbelievers We prepare a shameful doom;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who are miserly and enjoin others to be the same and conceal the riches which God has given them of His bounty. We have prepared a humiliating punishment for those who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are niggardly and command mankind to niggardliness and hide that which Allah hath vouchsafed unto them of His grace; and We, have gotten ready for the infidels a torment ignominous;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—Those who are [themselves] stingy and bid [other] people to be stingy, and conceal whatever Allah has given them out of His bounty; and We have prepared for the faithless a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Nor) those who are niggardly or enjoin niggardliness on others, or hide the bounties which Allah hath bestowed on them; for We have prepared, for those who resist Faith, a punishment that steeps them in contempt;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are miserly and enjoin miserliness on other men and hide what Allah has bestowed upon them of His Bounties. And We have prepared for the disbelievers a disgraceful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(or) those who are greedy and order other people to be greedy, who themselves conceal the bounty that Allah has given them. And We have prepared a humiliating punishment for the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are stingy, and exhort people to stinginess, and conceal what God has given them from His bounty. We have prepared for the disbelievers a disgraceful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who are stingy and enjoin upon [other] people stinginess and conceal what Allah has given them of His bounty - and We have prepared for the disbelievers a humiliating punishment -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:37] Those (alladhīna, the subject) who are niggardly, in their duty, and bid other people to be niggardly, in the same, and conceal what God has bestowed upon them of His bounty, in the way of knowledge and property: these are the Jews (the predicate of the [said] subject is [an implied] lahum wa‘īdun shadīd, ‘for them there is a promise of severe punishment’). And We have prepared for those that disbelieve, in this and other matters, a humbling chastisement, one of humiliation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who are avaricious) by concealing the traits and description of Muhammad as mentioned in their Scripture. These are Ka'b Ibn al-Ashraf and his companions (and enjoin avarice) concealment (on others, and hide that which Allah hath bestowed upon them) they hide that which Allah exposited to them in their Scripture (of His bounty) of the traits and description of Muhammad. (For disbelievers) for the Jews (We prepare a shameful doom) through which they will be humiliated;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوهم: { ٱلَّذِينَ يَبْخَلُونَ } من أموالهم التي استخلفهم الله عليها، معليين بأنا لم نجد فقيراً متديناً يستحق الصدقة { وَ } مع بخلهم في أنفسهم { يَأْمُرُونَ ٱلنَّاسَ } أيضاً { بِٱلْبُخْلِ } لئلا يلحق العار عليهم خاصة { وَ } مع ذلك { يَكْتُمُونَ } من الحكام والعملة { مَآ آتَاهُمُ ٱللَّهُ مِن فَضْلِهِ } من الأموال؛ خوفاً من إخراج الزكاة والصدقات، ومن عظم جرم هؤلاء الخيلاء البخلاء أسند سبحانه انتقامهم إلى نفسه غير الأسلوب، فقال: { وَأَعْتَدْنَا } أي: هيأنا من غاية قهرنا وانتقامنا { لِلْكَافِرِينَ } لنعمنا كفراناً ناشئاً عن محض النفاق والشقاق { عَذَاباً } طرداً وحرماناً مؤلماً، وتخذيلاً وإذلالاً { مُّهِيناً } [النساء: 37]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}