{
  "chapter": "النساء",
  "text": "وءاتوا۟ النساء صدقتهن نحلة فان طبن لكم عن شىء منه نفسا فكلوه هنيـا مريـا",
  "translations": [
    {
      "translation": "Give women their dowry as an outright gift. But if they are happy to give you some of it, make use of it with pleasure and goodwill.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give to women their dowers willingly, but if they forego part of it themselves, then use it to your advantage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give women their bridal-due in good cheer (considering it a duty); but if they willingly remit any part of it, consume it with good pleasure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pay the women their dowry as though it were a gift. However, if they allow you to keep a part of it as a favor to you, you may spend it with pleasure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give the women their bridal money willingly; then if they willingly give you a part of it, eat (use) it with joy and fruition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give to the women (whom you marry) their Saduqat (or dowry) Nihlah (with a good heart), but if they, of their own good pleasure, remit any part of it to you, take it, and enjoy it without fear of any harm.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give women their dowries as a free gift, but if they of themselves be pleased to give up to you a portion of it, then eat it with enjoyment and with wholesome result.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give the women their dowries as a gift spontaneous; but if they are pleased to offer you any of it, consume it with wholesome appetite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give unto the women (whom ye marry) free gift of their marriage portions; but if they of their own accord remit unto you a part thereof, then ye are welcome to absorb it (in your wealth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give the women their dowers willingly, but if they, of their own accord, remit any part of it to you, you may make use of it with pleasure and goodwill.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give unto women dowries as a gift, and if of themselves they give up aught thereof unto you, then eat it in pleasure and profit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give women their dowries, handing it over to them; but if they remit anything of it of their own accord, then consume it as [something] lawful and wholesome.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give the women (on marriage) their dower as a free gift; but if they, of their own good pleasure, remit any part of it to you, Take it and enjoy it with right good cheer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give to the women (whom you marry) their Mahr (obligatory bridal money given by the husband to his wife at the time of marriage) with a good heart, but if they, of their own good pleasure, remit any part of it to you, take it, and enjoy it without fear of any harm (as Allah has made it lawful).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give women their dowries freely, but if they are pleased to offer you any of it, consume it good and smooth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give women their dowries graciously. But if they willingly forego some of it, then consume it with enjoyment and pleasure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give the women [upon marriage] their [bridal] gifts graciously. But if they give up willingly to you anything of it, then take it in satisfaction and ease.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:4] And give women their dowries (saduqāt, plural of sudqa), their bridal money (mahr, muhūr), as a free gift (nihlatan, is a verbal noun), a present given out of the kindness of one’s heart; but if they are pleased to offer you any of it of their own accord (nafsan, ‘of their own accord’, is for specification and is taken from the subject of the verb [thus, it refers back to ‘they’, the women]), meaning, [if] their own selves are pleased that you should have something of the dowry and they give it to you then, consume it with, good, wholesome appetite, a praiseworthy consequence, with no harm therein for you with regard to the Hereafter: this was revealed in response to those who were opposed to this [consumption].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And give unto the women, (whom ye marry) free gift) as an obligation from Allah upon you (of their marriage portions) their dowries; (but if they of their own accord remit unto you a part thereof) if they make lawful for you to take some of the dowry, (then ye are welcome to absorb it (in your wealth)) there is no blame or sin on you if you do so. Before Islam, men used to marry without giving any dowry to their wives.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَآتُواْ ٱلنِّسَآءَ صَدُقَٰتِهِنَّ نِحْلَةً } معناهُ أَعْطُوا وصَدُقَاتُهِنَّ: مُهُورُهنَّ\n ونِحْلَةٌ\n عَنْ طِيبِ نَفْسٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And give the women their due dowries}, means give their due dowries: what is customary for them.\n\n\n{wanihlatun}\n\nThis word refers to a type of unguent or ointment.\n From a pure soul",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إذا أردتم النكاح أيها المسلمون { ءَاتُواْ ٱلنِّسَآءَ } الحرائر، والإماء لغيركم { صَدُقَٰتِهِنَّ } أي: مهورهن { نِحْلَةً } بَتةً مؤبداً بلا حيلة وخديعة { فَإِن طِبْنَ } هن { لَكُمْ } لإفراط محبتكم في قلوبهن { عَن شَيْءٍ } كلٍ أو بعضٍ { مِّنْهُ } أي: من المهر { نَفْساً } رغبةً ورضاً، لا كرهاً واستحياء { فَكُلُوهُ } أي: الشيء الموهوب من المهر { هَنِيئاً } حلالاً { مَّرِيئاً } [النساء: 4] طيباً؛ تقويماً لمزاجكم؛ لإقامة القسط والعدل الذي هو من حدود الله المتعلقة بالقتوى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:68",
      "similarity": 0.7367789376545653
    },
    {
      "verse": "52:19",
      "similarity": 0.30307428560302174
    },
    {
      "verse": "77:43",
      "similarity": 0.30307428560302174
    },
    {
      "verse": "26:146",
      "similarity": 0.28376797994371455
    },
    {
      "verse": "69:35",
      "similarity": 0.2757481802905717
    }
  ]
}