{
  "chapter": "النساء",
  "text": "ان الله لا يظلم مثقال ذرة وان تك حسنة يضعفها ويؤت من لدنه اجرا عظيما",
  "translations": [
    {
      "translation": "Allah does not wrong anyone by so much as the smallest speck. And if there is a good deed Allah will",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not wrong any one, not even the equal of an atom; and if men do good He multiplies it by two, and adds a great reward of His own.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah wrongs none, not even as much as an atom's weight. Whenever a man does good, He multiplies it two-fold, and bestows out of His grace a mighty reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not do even an atom's weight of injustice. A good deed is multiplied by God and richly rewarded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not commit even the least injustice; and if there is a good deed, He doubles it and gives from Himself a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely! Allah wrongs not even of the weight of a speck of dust, but if there is any good (done), He doubles it, and gives from Him a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah does not do injustice to the weight of an atom, and if it is a good deed He multiplies it and gives from Himself a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely God shall not wrong so much as the weight of an ant; and if it be a good deed He will double it, and give from Himself a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah wrongeth not even of the weight of an ant; and if there is a good deed, He will double it and will give (the doer) from His presence an immense reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not wrong anyone by as much as a grain's weight. If there be a good deed, He will repay twofold, and will bestow out of His own bounty an immense reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah wrongeth not any one a grain's weight, and if there is a virtue He shall multiply it and give from His presence a mighty hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah does not wrong [anyone] [even to the extent of] an atom’s weight, and if it be a good deed He doubles it[s reward], and gives from Himself a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is never unjust in the least degree: If there is any good (done), He doubleth it, and giveth from His own presence a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely! Allah wrongs not even of the weight of an atom (or a small ant), but if there is any good (done), He doubles it, and gives from Him a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, Allah shall not harm so much as the weight of an atom, and if it is a good deed He will double it, and give from His Own a great wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not commit an atom's weight of injustice; and if there is a good deed, He doubles it, and gives from His Presence a sublime compensation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah does not do injustice, [even] as much as an atom's weight; while if there is a good deed, He multiplies it and gives from Himself a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:40] Surely God shall not wrong, anyone, so much as the weight of an atom, [the weight of] the smallest ant, by diminishing thereby a person’s good deeds or increase thereby his evil deeds; and if it, the atom, be a good deed (in taku hasanatan, ‘if it be a good deed’, is also read in taku hasanatun, in which case the kāna [construction] is [syntactically] complete), from a believer, He will double it (yudā‘ifuhā, also read yuda‘‘ifuhā), from ten times up to more than seven hundred times, and give from Himself, in addition to the doubling, a great wage, that no one can estimate.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Allah wrongeth not even of the weight of an ant) He will not leave of the works of the unbeliever even the weight of an ant to benefit him in the Hereafter or to restore the wrongs committed against his antagonists; (and if there is a good deed) for the sincere believer after restoring the wrongs committed against his antagonists, (He will double it) from one to ten times (and will give (the doer) from His presence an immense reward) an abundant reward in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِثْقَالَ ذَرَّةٍ } معناهُ زِنَةُ ذَرَّةٍ\n والذَّرةُ: النَّملَةُ الصَّغِيرةُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱللَّهَ } المجازي لأعمالهم { لاَ يَظْلِمُ } عليهم ولا ينقص من أجورهم { مِثْقَالَ } مقدار أجر { ذَرَّةٍ } صغيرة قريبة من العدم جداً { وَإِن تَكُ } تلك الذرة { حَسَنَةً } صادرة عنهم مقارنة بالإخلاص { يُضَٰعِفْهَا } حسب فضله وطوله إلى سبعة بل إلى سبعين بل إلى ما شاء الله { وَ } مع تضعيفها { يُؤْتِ } للمخلصين { مِن لَّدُنْهُ } امتناناً عليهم وتفضيلاً { أَجْراً عَظِيماً } [النساء: 40] هو الفوز بمقام الكشف والشهود\n\n\n\n\nآتنا من لدنك رحمة إنك أنت الوهاب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الذرة: النملة الصغيرة الحمراء\n وتطلق على جزء من أجزاء الهباء\n ومن نَصَب { حسنة } فَخَبَرُ كان\n وأُنث الضمير باعتبار الخبر\n أو لإضافة مثقال إلى ذرة، فاكتسب التأنيث، ومن رفع فهي تامة، وحذف نونها على غير قياس، تشبيهًا لها بحروف العلة\n وضاعف وضّعف بمعنى واحد\n يقول الحقّ جلّ جلاله: { إن الله لا يظلم } أحدًا بحيث ينقص من ثواب عمله، أو يزيد في عقبا ما يستحقه، ولو مثقال ذرة\n بل يجازي كلاً على قدر عمله\n فإن كان صالحًا، ولو صغر قدره، عظُم أجره\n { فإن تك حسنة يُضاعفها } بعشر أمثالها إلى سبعمائة إلى أضعاف كثيرة، بحسب الإخلاص\n قال أبو هريرة رضي الله عنه: سمعت النبي صلى الله عليه وسلم يقول:\n\n \" إنَّ اللهَ يُعْطِي المُؤمنَ عَلى الحَسَنة ألفي ألف حَسَنة \" \n\n، ثم تلا { إن الله لا يظلم مثقال ذرة } الآية\n { ويؤت من لدنه أجرًا عظيمًا } ، وخيرًا جسيمًا، فضلاً منه وإحسانًا\n قال صلى الله عليه وسلم:\n\n \" إنَّ اللهَ لا يظلم المُؤمنَ حَسنةً، بل يُثاب عليها الرزق في الدُنيَا ويجزيه بها في الآخِرَةِ\n والكَافِر يعطيه بها في الدُّنيَا، فإذا كان يوم القيامة لم يكُن لَهُ حَسَنةٌ \"\n \n",
      "translations": []
    }
  ]
}