{
  "chapter": "النساء",
  "text": "يومئذ يود الذين كفروا۟ وعصوا۟ الرسول لو تسوى بهم الارض ولا يكتمون الله حديثا",
  "translations": [
    {
      "translation": "On that day those who were kafir and disobeyed the Messenger will wish that they were one with the level earth. They will not be able to hide a single circumstance from Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day those who disbelieved and disobeyed the Prophet, shall wish they were levelled with the dust, and shall not be able to conceal a thing from God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved and disobeyed the Messenger will wish on that Day that the earth were levelled with them. They will not be able to conceal anything from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At that time the disbelievers who disobeyed the Messenger will wish that they could be turned into dust and they will be able to hide nothing from God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day, those who disbelieved and disobeyed the Noble Messenger will wish that they be buried and the ground levelled above them; and they will not be able to hide anything from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day those who disbelieved and disobeyed the Messenger will wish that they were buried in the earth, but they will never be able to hide a single fact from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day will those who disbelieve and disobey the Apostle desire that the earth were levelled with them, and they shall not hide any word from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon that day the unbelievers, those who have disobeyed the Messenger, will wish that the earth might be levelled with them; and they will not conceal from God one tiding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day those who disbelieved and disobeyed the messenger will wish that they were level with the ground, and they can hide no fact from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, those who were bent on denying the truth and disobeyed the Messenger will wish that the earth were made level above them. They will not be able to hide anything from God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Day those who had disbelieved and disobeyed the apostle would fain that the earth would be levelled over them, and from Allah they will not be able to hide any discourse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day those who were faithless and [who] disobeyed the Apostle will wish the earth were levelled with them, and they will not conceal any matter from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day those who reject Faith and disobey the messenger will wish that the earth Were made one with them: But never will they hide a single fact from Allah!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day those who disbelieved and disobeyed the Messenger (Muhammad SAW) will wish that they were buried in the earth, but they will never be able to hide a single fact from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day those who disbelieved, and have disobeyed the Messenger (Muhammad) will wish that the earth might be leveled with them, and they will not conceal a statement from Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, those who disbelieved and disobeyed the Messenger will wish that the earth were leveled over them. They will conceal nothing from God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Day, those who disbelieved and disobeyed the Messenger will wish they could be covered by the earth. And they will not conceal from Allah a [single] statement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:42] Upon that day, the day of bringing forward; the disbelievers, those who have disobeyed the Messenger, will wish that (law, ‘if’, means an, ‘that’) the earth might be levelled with them (read passive tusawwā, or active tasawwā, or tassawwā), so that like it they might also become dust, [and this is] because of the terror of that day, as is stated in another verse: The disbeliever shall say, ‘O would that I were dust!’ [Q. 78:40]. And they will not hide from God any talk, of what they did, although at another stage they do actually hide it and say, ‘By God, our Lord, we never associated anything with You’ [Q. 6:23].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On that day) on the Day of Resurrection (those who disbelieved) in Allah (and disobeyed the messenger) by denying his message (will wish that they were level with the ground) they will wish that they become dust 89 with the beasts, (and they can hide no fact from Allah) they will not say: Allah, our Lord! We did not associate any partner with you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَوْ تُسَوَّىٰ بِهِمُ ٱلأَرْضُ } معناهُ يدْخِلُونَ فِيهَا، فَتَعْلُوهُمْ الأَرضُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {if the earth were to be filled with them} means that they enter it, then the earth would be filled with them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يومئذٍ يَود الذين كَفَروا } بالاحتجاب عن الحق { وعصُوا الرسول } بالاحتجاب عن الدين { لو تُسوّى بهم } أرض الاستعداد\n فتنطمس نفوسهم أو تصير ساذجة لا نقش فيها من العقائد الفاسدة والرذائل الموبقة { ولا يَكْتمون الله حَدِيثاً } أي: لا يقدرون على كتم حديث من تلك النقوش حتى لا يتعذبون بعقابه\n { يا أيها الذينَ آمنُوا } بالإيمان العلميّ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَوْمَئِذٍ } أي: يوم إذ جئنا بك شهيداً على المؤمنين { يَوَدُّ } يحب ويتمنى { ٱلَّذِينَ كَفَرُواْ } بالله { وَعَصَوُاْ ٱلرَّسُولَ } الأمي المبعوث إلى كافة الأنام بدين الإسلام أن { لَوْ تُسَوَّىٰ } تغطى { بِهِمُ ٱلأَرْضُ } في تلك الساعة\n وصاروا نسياً منسياً لكان خيراً لهم من المذلة التي عرضت لهم في تلك الحالة { وَلاَ يَكْتُمُونَ ٱللَّهَ حَدِيثاً } [النساء: 42] أي: لا يمكن كتمان حديث نفوسهم بهذا من الله في تلك الحالة\n فكيف كتمان أعمالهم الصادرة عنهم؟!\n\nثم لما حضر بعض لمؤمنين المسجد لأداء الصلاة سكارى حين إباحة الخمر\n وغفلوا عن أداء بعض أركاناها وتعديلها\n وغلطوا في القراءة وحفظ الترتيب\n نبه سبحانه عليهم ونهاهم ألاَّ تبادروا إلى المساجد قبل أن تفيقوا\n فقال منادياً ليقبلوا: { يَا أَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم حفظ الأدب",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أي: كيف يستقر الأمر أو يكون إذا جئنا؟ ومن قرأ { تَسوّى } بالشد\n فأصله تتسوى\n أدغمت الأولى في الثانية\n ومن قرأ { لو تُسوّى } بالبناء للمفعول فحذف الثانية\n يقول الحقّ جلّ جلاله: { فكيف } يكون حال هؤلاء الكفرة واليهود { إذا } قامت القيامة و { جئنا من كل أمة بشهيد } يشهد عليها بخيرها وشرها\n وهو نبيهم الذي أرسل اليهم\n { وجئنا بك } أنت يا محمد { على هؤلاء } الأمة التي بعثت إليهم { شهيدًا } عليهم\n أو على صدق هؤلاء الشهداء شهيدًا\n تشهد على صدق رسالتهم وتبليغهم؟ لعلمك بعقائدهم واستجماع شرعك مجامع قواعدهم\n وقيل: { وعلى هؤلاء } الكفرة المستفهم عن حالهم\n وقيل: على المؤمنين لقوله:\n[البقرة:143]\n { يومئذ يود الذين كفروا وعصوا الرسول } أي: الذين جمعوا بين الكفر والعصيان يتمنون أن { تسوى بهم الأرض } فيكونون ترابًا لما يرون من هول المطلع\n فإذا شهدت عليهم الرسل بالكفر قالوا:\n[الأنعَام:23]\n فيُنطق ألسنتهم وأيديهم وأرجلهم بشركهم فيفتضحون { ولا يكتمون الله حديثاً } واحدًا\n لأنهم كلما هموا بالكتمان شهدت عليهم جوارحهم بالكفر والعصيان\n وقيل: إن القيامة مواطن\n في موطن لا يتكلمون ولا تسمع إلا همسًا\n وفي موطن يتكلمون ويقولون: والله ربنا ما كنا مشركين\n إلى غير ذلك من اختلاف أحوالهم\n والله تعالى أعلم\n الإشارة: لا بد أن يحصل الندم لمن فاته صحبة أهل الخصوصية\n حتى مات محجوبًا عن مشاهدة أسرار الربوبية\n لا سيما إذا انضم إليهم كفرهم بخصوصيتهم والإنكار عليهم\n وذلك حين يكشف له عن مقامهم البهي وحالهم السني\n مصاحبين للمقربين في جوار الأنبياء والمرسلين\n وهو في مقام أهل اليمين\n ثم يعاقب على ما أسر عليه من الكبائر\n وهي معاصي القلوب والضمائر\n وهذا إذا مات على الإسلام\n وإلا فالإنكار على الأولياء شُؤمُه سوء الخاتمة\n والعياذ بالله من ذلك\n وقد تقدم أن العارفين بالله يشهدون على العلماء\n والعلماء يشهدون على العموم\n ونبينا ـ عليه الصلاة والسلام ـ يزكي من يحتاج إلى التزكية\n والله تعالى أعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:61",
      "similarity": 0.4115683581231725
    },
    {
      "verse": "5:99",
      "similarity": 0.3755225777756286
    },
    {
      "verse": "2:159",
      "similarity": 0.36700793576539215
    },
    {
      "verse": "2:146",
      "similarity": 0.36190117548434764
    },
    {
      "verse": "21:110",
      "similarity": 0.3378306931350812
    }
  ]
}