{
  "chapter": "النساء",
  "text": "يايها الذين ءامنوا۟ لا تقربوا۟ الصلوة وانتم سكرى حتى تعلموا۟ ما تقولون ولا جنبا الا عابرى سبيل حتى تغتسلوا۟ وان كنتم مرضى او على سفر او جاء احد منكم من الغائط او لمستم النساء فلم تجدوا۟ ماء فتيمموا۟ صعيدا طيبا فامسحوا۟ بوجوهكم وايديكم ان الله كان عفوا غفورا",
  "translations": [
    {
      "translation": "You who have iman! do not approach the prayer when you are drunk, so that you will know what you are saying, nor in a state of major impurity - unless you are travelling - until you have washed yourselves completely. If you are ill or on a journey, or any of you have come from the lavatory or touched women, and you cannot find any water, then do tayammum with pure earth, wiping your faces and your hands. Allah is Ever-Pardoning, Ever-Forgiving.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, do not perform your service of prayer when you are intoxicated until you are sure of what you are saying, nor when in a state of seminal pollution, until you have taken a bath, except when you are travelling. But in case you are ill or are travelling, or you have relieved yourself of nature's call, or cohabited with a woman, and cannot find water, then take wholesome dust and pass it over your face and hands: God is benign and forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Do not draw near to the Prayer while you are intoxicated until you know what you are saying nor while you are defiled - save when you are travelling - until you have washed yourselves. If you are either ill or travelling or have satisfied a want of nature or have had contact with women and can find no water, then betake yourselves to pure earth, passing with it lightly over your face and your hands. Surely Allah is All-Relenting, All-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not pray when you are drunk, but, instead, wait until you can understand what you say. Also, do not pray when you have experienced a seminal discharge until after you have taken a bath, unless you are on a journey. If, while sick or on a journey, you can find no water after having defecated or after having had carnal relations, perform tayammum by touching your palms on the pure earth and wipe the (upper part of) your face and the backs of your hands. God is Gracious and All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not approach the prayer when you are intoxicated until you have the sense to understand what you say, nor in the state of impurity until you have bathed except while travelling; and if you are ill or on a journey or one of you returns from answering the call of nature or you have cohabited with women, and you do not find water, then cleanse (yourself) with clean soil – therefore stroke your faces and your hands with it; indeed Allah is Most Pardoning, Oft Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not approach Salah while you are in a druken state until you know what you are saying, nor while Junub (sexually impure), except while passing through, until you bathe (your entire body), and if you are ill, or on a journey, or one of you comes from the Gha'it (toilet), or from Lamastum (touching) women, but you do not find water, then perform Tayammum with clean earth, rubbing your faces and hands. Truly, Allah is Ever Oft-Pardoning, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! do not go near prayer when you are Intoxicated until you know (well) what you say, nor when you are under an obligation to perform a bath-- unless (you are) travelling on the road-- until you have washed yourselves; and if you are sick, or on a journey, or one of you come from the privy or you have touched the women, and you cannot find water, betake yourselves to pure earth, then wipe your faces and your hands; surely Allah is Pardoning, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, draw not near to prayer when you are drunken until you know what you are saying, or defiled -- unless you are traversing a way -- until you have washed yourselves; but if you are sick, or on a journey, or if any of you comes from the privy, or you have touched women, and you can find no water, then have recourse to wholesome dust and wipe your faces and your hands; God is All-pardoning, All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Draw not near unto prayer when ye are drunken, till ye know that which ye utter, nor when ye are polluted, save when journeying upon the road, till ye have bathed. And if ye be ill, or on a journey, or one of you cometh from the closet, or ye have touched women, and ye find not water, then go to high clean soil and rub your faces and your hands (therewith). Lo! Allah is Benign, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not approach your prayers when you are drunk, until you understand what you say, nor when you are in a state of impurity, -- except when you are on a journey -- till you have bathed. And if you are ill, or on a journey or have relieved yourselves or when you have consorted with women and you cannot find any water, then find some clean sand and wipe your face and your hands with it. God is gracious and forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! approach not prayer while ye are intoxicated until ye know that which ye say, nor yet while ye are polluted, save when ye be way faring, until ye have washed your selves. And if ye be ailing or on a journey, or one of you cometh from the privy have touched women, or ye and ye find not water, then betake your selves to clean earth and wipe your faces and your hands therewith; verily Allah is ever Pardoning, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not approach prayer when you are intoxicated, [not] until you know what you are saying, nor [enter mosques] in the state of ritual impurity until you have washed yourselves, except while passing through. But if you are sick or on a journey, or any of you has come from the toilet, or you have touched women, and you cannot find water, then make your ablution on clean ground and wipe a part of your faces and your hands. Indeed Allah is all-excusing, all-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Approach not prayers with a mind befogged, until ye can understand all that ye say,- nor in a state of ceremonial impurity (Except when travelling on the road), until after washing your whole body. If ye are ill, or on a journey, or one of you cometh from offices of nature, or ye have been in contact with women, and ye find no water, then take for yourselves clean sand or earth, and rub therewith your faces and hands. For Allah doth blot out sins and forgive again and again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Approach not As-Salat (the prayer) when you are in a drunken state until you know (the meaning) of what you utter, nor when you are in a state of Janaba, (i.e. in a state of sexual impurity and have not yet taken a bath) except when travelling on the road (without enough water, or just passing through a mosque), till you wash your whole body. And if you are ill, or on a journey, or one of you comes after answering the call of nature, or you have been in contact with women (by sexual relations) and you find no water, perform Tayammum with clean earth and rub therewith your faces and hands (Tayammum). Truly, Allah is Ever Oft-Pardoning, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not come close to prayer when you are drunk, until you know what you are saying, nor when you are in a state of impurity, unless you are crossing through the way (prayer area) until you have bathed yourselves. If you are ill or on a journey, or if any of you comes from the toilet or you have touchedwomen, and you cannot find water, so touch pure dust and wipe your faces and your hands. Allah is the Pardoner, the Forgiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not approach the prayer while you are drunk, so that you know what you say; nor after sexual orgasm—unless you are travelling—until you have bathed. If you are sick, or traveling, or one of you comes from the toilet, or you have had intercourse with women, and cannot find water, find clean sand and wipe your faces and your hands with it. God is Pardoning and Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not approach prayer while you are intoxicated until you know what you are saying or in a state of janabah, except those passing through [a place of prayer], until you have washed [your whole body]. And if you are ill or on a journey or one of you comes from the place of relieving himself or you have contacted women and find no water, then seek clean earth and wipe over your faces and your hands [with it]. Indeed, Allah is ever Pardoning and Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:43] O you who believe, draw not near to prayer, that is, do not perform prayer, whilst you are inebriated, by a drink: this was revealed concerning being drunk during the congregational prayer; until you know what you are saying, when you have sobered up; nor whilst you are defiled, as a result of [sexual] penetration or ejaculation (junuban, ‘defiled’, is in the accusative because it is a circumstantial qualifier, and may be used to refer to the singular or plural) — unless you are traversing, crossing, a way, a route, that is, [unless] you are travelling — until you have washed yourselves, in which case you may perform prayer: a proviso is made for the traveller because a different stipulation applies to him, as will follow. It is said that the purpose [of this verse] is to prohibit the approach to places of prayer, that is, mosques, the exception being if one were merely passing through and not staying. But if you are sick, with an illness made worse by [contact with] water, or on a journey, that is, [or] travelling whilst you are [ritually] defiled or impure, or if any of you comes from the privy (al-ghā’it), a place designated for relieving nature, that is to say, [or if any of you] have defecated, or you have touched women (lāmastum, a variant reading has lamastum: both mean lams, that is, ‘touching with the hand’, as stated by Ibn ‘Umar; this is also the opinion of al-Shāfi‘ī, and it extends to touching with other parts of the skin; according to Ibn ‘Abbās, however, it is [referring to] sexual intercourse); and you can find no water, with which to purify yourselves for prayer, having made the effort to seek it out and search for it — the sick being exempt in this case — then resort to, seek, when the time [for the prayer] has commenced, wholesome soil, clean earth, strike it twice, and wipe your faces and your hands, with it, up to the elbows (the verb masaha, ‘to wipe’, may stand on its own with a direct object or take a particle [before the direct object, sc. masaha bi-]). God is ever Pardoning, Forgiving.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah revealed the following about the Companions of Muhammad prior to the prohibition of intoxicants: (0 ye who believe!) in Muhammad and the Qur'an (Draw not near unto prayer) in the Mosque of the Prophet (pbuh) with the Prophet (pbuh) (when ye are drunken, till ye know that which ye utter) so that you know what the prayer leader recites during the prayer, (nor when ye are polluted) nor when you are in a state of major ritual impurity, (save when journeying upon the road) except when passing through when you have to, (till ye have bathed) to purify yourselves from major ritual impurity. (And if ye be ill) wounded, (or on a journey, or one of you cometh from the closet, or ye have touched women) made love to them, (and ye find not water, then go to high clean soil and rub your faces) with the first clap (and your hands (therewith)) with the second clap. (Lo! Allah is Benign) Allah is Generous for the abundance He has given you, (Forgiving) of any shortcoming that may ensue from you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْ لَٰمَسْتُمُ ٱلنِّسَآءَ } والمُلاَمَسَةُ: الجمَاعُ\n\n\n\n\nوقوله تعالى: { فَتَيَمَّمُواْ صَعِيداً طَيِّباً } فالتَّيمّمُ: التعمدُ\n والصَّعِيدُ: وَجهُ الأَرضِ\n والطِّيبُ: النَّظيفُ\n\n\n\n\nوقوله تعالى: { أَوْ جَآءَ أَحَدٌ مِّنْكُمْ مِّن ٱلْغَآئِطِ } فالغَائِطُ: الفَتحُ مِنَ الأَرضِ المُتصوِّبُ: أَي المُتَحَدِرُ\n وأَرادَ بِهِ لكنايَةُ عَنْ حَاجَةِ ذِي البَطنِ\n\n",
      "translations": [
        {
          "translation": "\nOr have you touched women? And touching: intercourse\n\n\nAnd His saying, {So perfect your work} - that is, do it deliberately.\n\n\nAnd the ground: the face of the earth.\n\n\nAnd the pure (al-ṭayyib) is the clean (al-naṣīf).\n\n\nAnd the saying of Allah {or one of you comes from the depths} the depths: the opening from the earth that is inclined, that is, the one who is turned around.\n\n\nAnd he wanted to do it secretly, out of need for the one with the belly.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما حضر بعض لمؤمنين المسجد لأداء الصلاة سكارى حين إباحة الخمر، وغفلوا عن أداء بعض أركاناها وتعديلها، وغلطوا في القراءة وحفظ الترتيب، نبه سبحانه عليهم ونهاهم ألاَّ تبادروا إلى المساجد قبل أن تفيقوا، فقال منادياً ليقبلوا: { يَا أَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم حفظ الأدب، سيما عند التوجه نحو الحق فعليكم أن { لاَ تَقْرَبُواْ } ولا تتوجهوا { ٱلصَّلَٰوةَ } أي: لأداء الصلاة، هي عبارةعن التوجه نحو الذات الإلهية بجميع الأعضاء والجوارج، المقارن بالخضوع والخشوع، المنبئ عن الاعتراف بالعبودية والإذلال، المشعر عن المعجز والتقصير، فلا بد لأدائها من فراغ الهم وخلاء الخاطر عن أدناس الطبيعة مطلقاً { وَ } خصوصاً { أَنْتُمْ } في أدائها { سُكَٰرَىٰ } لا تعلمون ما تفعلون وما تقرأون بل اصبروا { حَتَّىٰ } تفيقوا { تَعْلَمُواْ مَا تَقُولُونَ } وما تفعلون في أدائها من محافظة الأركان والأبعاض والأركان والهيئات وغير ذلك\n\n\n\n\n{ وَ } عليكم أيضاً أن { لاَ } تقربوا الصلاة { جُنُباً } حالة كونكم مجنبين بأي طريق كان؛ إذ استفراغ المني إنما هو من استيلاء القوة الشهوية التي هي أقوى القوى الحيوانية وأبعدها عن مرتبة الإيمان والتوحيد، وحين استيلائها تسري خباثتها إلى جميع الأعضاء الحاملة للقوى الدراكة وتعطلها عن مقتضياتها بالمرة، فحينئذ تتحير الأمزجة وتضطرب لانحرافها عن اعتدال الفطرة الأصلية بعروض الخباثة السارية، فتكون الخباثة أيضاً كالسكر من مخللات العقل، فعليكم ألاَّ تقربوها معه { إِلاَّ } إذا كنتم { عَابِرِي سَبِيلٍ } أي: على متن سفر ليس لكم قدرة استعمال الماء؛ لفقده أو لوجود المانع، فعليكم أن تتيمووا وتصلوا جنباً { حَتَّىٰ تَغْتَسِلُواْ } وتتمكنوا من استعماله\n\n\n\n\n{ وَ } كذا { إِنْ كُنْتُمْ } مقيمين { مَّرْضَىٰ } تخافون من شدة المرض في استعماله { أَوْ } راكبين { عَلَىٰ } متن { سَفَرٍ أَوْ جَآءَ أَحَدٌ مِّنْكُمْ مِّن ٱلْغَآئِطِ } أي: من الخلاء محدثين { أَوْ لَٰمَسْتُمُ ٱلنِّسَآءَ } أي: جامعتم معهن أو لعبتم بهن بالملامسة والمساس { فَلَمْ تَجِدُواْ } في هذه الصورة { مَآءً } لإزالة ما عرض عليكم من الجنابة { فَتَيَمَّمُواْ صَعِيداً طَيِّباً } أي: فعليكم أن تقصدوا عند عروض هذه الحالات بالتراب الطيب من صعيد الأرض بأن تضربوا أيديكم عليها، وبعدها ضربتم { فَٱمْسَحُواْ } باليدين المغبرتين { بِوُجُوهِكُمْ } مقدار ما يغسل { وَأَيْدِيكُمْ } أيضاً كذلك؛ جبراً لما فوتم من الغسل بالماء؛ إذ التراب من المطهرات خصوصاً من الصعيد المرتفع { إِنَّ ٱللَّهَ } المصلح لأحوالكم { كَانَ عَفُوّاً } لكم مجاوزاً عن أمثاله { غَفُوراً } [النساء: 43] يستر عنكم ولا يؤاخذكم عليها إن كنتم مضطرين فيها، بل يجازيكم خيراً تفضلاً وامتناناً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: جملة { وأنتم سكارى }: حال، وسكارى: جمع سكران، ويجمع على سُكارى بالفتح وسكْرى بالسكون، و { لا جُنُبًا } عطف على جملة الحال، و { جُنب } يستوي فيه الواحد والاثنان والجماعة والمذكر والمؤنث، لأنه يجري مجرى المصدر فلا يُثنى ولا يُجمع\n و { إلا عابري } مستثنى من عام الأحوال، وأصل الغائط: الموضع المنخفض من الأرض، ثم أطلق على الواقع فيه مما يخرج من الإنسان\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى }: لا تقوموا إليها وأنتم سكارى من خمر، أو غلبة نوم، أو شدة غفلة، { حتى تعلموا ما تقولون } في صلاتكم، وتتدبروا ما تقرأون فيها، فالصلاة من غير حضور خاوية، وعند الخصوص باطلة، رُوِي أن عبد الرحمن بن عَوف صنَع مأدبة، ودَعَا إليها نفرًا من الصحابة، حين كانت الخمر مباحة، فأكلوا وشربوا حتى ثَمِلُوا، وجاء وقت صلاة المغرب، فتقدم أحدهم ليصلي بهم، فقرأ: أعبد ما تعبدون ـ من غير نفي ـ فنزلت الآية قبل تحريم الخمر، ثم حرمت بآية المائدة\n ولا تقربوها حالة جنابتكم في آي حال كان، { إلا عابري سبيل } أي: في وقت سفركم، حيث لم تجدوا ماءً، بدليل ما يأتي، فيتيمم ويقرب الصلاة وهو جنب، وفيه دليل أن التيمم لا يرفع الحدث، قيل المراد بالصلاة مواضعها، وهي المساجد فلا يدخلها الجنب إلا مارًا، وبه قال الشافعي ـ رضي الله عنه ـ وقال أبو حنيفة: لا يجوز المرور، إلاَّ إذا كان فيه الماء والطريق\n وقال مالك: لا يدخل إلا بالتيمم ولا يمر به أصلاً\n فلا تقربوا الصلاة وأنتم جنب { حتى تغتسلوا }\n { وإن كنتم مرضى } تخافون ضرر الماء، أو زيادته، أو تأخر برء، أو منع الوصول إلى الماء، { أو على سفر } لم تجدوه فيه، { أو } كنتم في الحضر مُحدِثِين حيث { جاء أحد منكم من الغائط } ، أو البول، أو بغيره من الأحداث، { أو لامستم النساء } أي: مست بشرتكم بشرتهن، بقصد اللذة أو عند وجدانها، وبه قال مالك\n وقال الشافعي: ينقض مطلقًا، قصد أم لا، وجد أم لا، ولو بميتة، وقال أبو حنيفة: إن كانت ملامسه فاحشة بحيث يحصل الانتشار نقضت، وإلا فلا\n وقال ابن عباس والحسن البصري ومحمد بن الحسن: لا تنقض الملامسة مطلقًا، ويقاس على اللمس سائر نواقض الأسباب، فتحصَّل أن \" أو \" تبقى على أصلها من التقسيم، فتكون الآية نصًا في تيمم الحاضر الصحيح، وبه قال مالك، ولا يعيد\n وقال الشافعي: يُصلي بالتيمم ويُعيد، وقال أبو حنيفة: لا يُصلي حتى يجد الماء، ومن قال: \" أو \" بمعنى الواو فخروج عن الأصل بلا داع\n ثم قيّد التيمم في هذه الأحوال بفقد الماء، فقال: { فلم تجدوا ماء } كافيًا، أو لم تقدروا على استعماله، { فتيمموا } أي: اقصدوا { صعيداً طيبًا } أي: ظاهرًا، وهو ما صعد على وجه الأرض من جنسها كتراب، وهو الأفضل، وثلج وخضخاض وحجر ومدر، لا شجر وحشيش ومعدن ذهب وفضة، وما التحق بالعقاقير، كشب، وملح، وكبريت، وغاسول وشبهه، فلا يجوز\n\n\nوقال أبو حنيفة: بكل شيء من الأرض وما اتصل بها كشجر وكُحل، وزنيخ، وشب ونورة، وجص، وجوهر، إلا منخالة الذهب والفضة والرصاص\n وقال الشافعي: لا يجوز إلا بالتراب المنبت خاصة، وبه فسر الطيب، واشترط علوق التراب بيده، ولم يشترطه غيره\n ثم علّم الكيفية فقال: { فامسحوا بوجوهكم وأيديكم }\n قال مالك: اليد اسم للكف بدليل قطع السارق منه، فجعل المسح إلى المرفق سنة\n وقال الشافعي: فرض، قياسًا على الوضوء، { إن الله كان عفوًّا غفورًا } فلذلك يسَّر عليكم ورخص لكم في التيمم\n الإشاره: يا أيها الذين آمنوا لا تقربوا صلاة الحضرة القدسية، وأنتم سكارى بحب الدنيا الدنية، حتى يذهب عنكم سُكر حبها، وتعلموا ما تقولون في مناجاة خالقها، ولا جنبًا من جنابة الغفلة، إلا ما يمر بالخواطر على سبيل الندرة والقلة، حتى تغتسلوا بماء الغيب، الذي يحصل به طهارة الجنان، ويغيب المتطهر به عن رؤية الأكوان\n وإليه أشار ابن العربي الحاتمي: كما في طبقات الشعراني، ونسبها غيرُه للجنيد ـ رضي الله عنهم أجمعين ـ وهو الأصح بقوله:\n\nأي: إن لم تقدر على الطهارة الأصلية وهي الغيبة عن الأحداث الكونية، فاقصد العبادة الحسية، وقَّدم الشريعة أو من قام بها من أهل التربية النبوية أمامك، بعد أن كان يطلبك من قبل أن تعرفه، وأجمع ظُهر الشريعة لعصر الحقيقة، فهذه صلاة العارفين، فإن كنت منهم فانضح بَرَّ ظاهرك بحقيقة باطنك، فما كمن في غيب السرائر ظهر في شهادة الظواهر\n لهذا أشار تعالى بقوله: { وإن كنتم مرضى } بحب الهوى، { أو على سفر } في عجلة شغل الدنيا، أو جاء أحد منكم من غائط الحس، أو لامستم العلوم الرسمية، وانطبع صُورُ خيالها في قلوبكم، ولم تجدوا من يسقيكم ماء الغيب، وهي الخمرة الآزلية، فاقصدوا الأعمال الحسية، فلعلها توصلكم إلى الأعمال الباطنية، { إن الله كان عفوًا غفورًا } ، وفي الحِكَم: \" كيف يشرق قلبٌ صورُ الأكوان منطبعة في مرآته؟ أم كيف يرحل إلى الله وهو مكبل بشهواته، أم كيف يطمع أن يدخل حضرة الله وهو لم يتطهر من جنابة غفلاته؟ أم كيف يرجو أن يفهم دقائق الأسرار وهو لم يتب من هفواته؟ \"\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:6",
      "similarity": 0.7367608274078523
    },
    {
      "verse": "69:36",
      "similarity": 0.23384122642398858
    },
    {
      "verse": "38:42",
      "similarity": 0.18607148066032222
    },
    {
      "verse": "6:7",
      "similarity": 0.1644285415831347
    },
    {
      "verse": "15:15",
      "similarity": 0.1612131313000968
    }
  ]
}