{
  "chapter": "النساء",
  "text": "يايها الذين ءامنوا۟ لا تقربوا۟ الصلوة وانتم سكرى حتى تعلموا۟ ما تقولون ولا جنبا الا عابرى سبيل حتى تغتسلوا۟ وان كنتم مرضى او على سفر او جاء احد منكم من الغائط او لمستم النساء فلم تجدوا۟ ماء فتيمموا۟ صعيدا طيبا فامسحوا۟ بوجوهكم وايديكم ان الله كان عفوا غفورا",
  "translations": [
    {
      "translation": "You who have iman! do not approach the prayer when you are drunk, so that you will know what you are saying, nor in a state of major impurity - unless you are travelling - until you have washed yourselves completely. If you are ill or on a journey, or any of you have come from the lavatory or touched women, and you cannot find any water, then do tayammum with pure earth, wiping your faces and your hands. Allah is Ever-Pardoning, Ever-Forgiving.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, do not perform your service of prayer when you are intoxicated until you are sure of what you are saying, nor when in a state of seminal pollution, until you have taken a bath, except when you are travelling. But in case you are ill or are travelling, or you have relieved yourself of nature's call, or cohabited with a woman, and cannot find water, then take wholesome dust and pass it over your face and hands: God is benign and forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Do not draw near to the Prayer while you are intoxicated until you know what you are saying nor while you are defiled - save when you are travelling - until you have washed yourselves. If you are either ill or travelling or have satisfied a want of nature or have had contact with women and can find no water, then betake yourselves to pure earth, passing with it lightly over your face and your hands. Surely Allah is All-Relenting, All-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not pray when you are drunk, but, instead, wait until you can understand what you say. Also, do not pray when you have experienced a seminal discharge until after you have taken a bath, unless you are on a journey. If, while sick or on a journey, you can find no water after having defecated or after having had carnal relations, perform tayammum by touching your palms on the pure earth and wipe the (upper part of) your face and the backs of your hands. God is Gracious and All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not approach the prayer when you are intoxicated until you have the sense to understand what you say, nor in the state of impurity until you have bathed except while travelling; and if you are ill or on a journey or one of you returns from answering the call of nature or you have cohabited with women, and you do not find water, then cleanse (yourself) with clean soil – therefore stroke your faces and your hands with it; indeed Allah is Most Pardoning, Oft Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not approach Salah while you are in a druken state until you know what you are saying, nor while Junub (sexually impure), except while passing through, until you bathe (your entire body), and if you are ill, or on a journey, or one of you comes from the Gha'it (toilet), or from Lamastum (touching) women, but you do not find water, then perform Tayammum with clean earth, rubbing your faces and hands. Truly, Allah is Ever Oft-Pardoning, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! do not go near prayer when you are Intoxicated until you know (well) what you say, nor when you are under an obligation to perform a bath-- unless (you are) travelling on the road-- until you have washed yourselves; and if you are sick, or on a journey, or one of you come from the privy or you have touched the women, and you cannot find water, betake yourselves to pure earth, then wipe your faces and your hands; surely Allah is Pardoning, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, draw not near to prayer when you are drunken until you know what you are saying, or defiled -- unless you are traversing a way -- until you have washed yourselves; but if you are sick, or on a journey, or if any of you comes from the privy, or you have touched women, and you can find no water, then have recourse to wholesome dust and wipe your faces and your hands; God is All-pardoning, All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Draw not near unto prayer when ye are drunken, till ye know that which ye utter, nor when ye are polluted, save when journeying upon the road, till ye have bathed. And if ye be ill, or on a journey, or one of you cometh from the closet, or ye have touched women, and ye find not water, then go to high clean soil and rub your faces and your hands (therewith). Lo! Allah is Benign, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not approach your prayers when you are drunk, until you understand what you say, nor when you are in a state of impurity, -- except when you are on a journey -- till you have bathed. And if you are ill, or on a journey or have relieved yourselves or when you have consorted with women and you cannot find any water, then find some clean sand and wipe your face and your hands with it. God is gracious and forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! approach not prayer while ye are intoxicated until ye know that which ye say, nor yet while ye are polluted, save when ye be way faring, until ye have washed your selves. And if ye be ailing or on a journey, or one of you cometh from the privy have touched women, or ye and ye find not water, then betake your selves to clean earth and wipe your faces and your hands therewith; verily Allah is ever Pardoning, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not approach prayer when you are intoxicated, [not] until you know what you are saying, nor [enter mosques] in the state of ritual impurity until you have washed yourselves, except while passing through. But if you are sick or on a journey, or any of you has come from the toilet, or you have touched women, and you cannot find water, then make your ablution on clean ground and wipe a part of your faces and your hands. Indeed Allah is all-excusing, all-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Approach not prayers with a mind befogged, until ye can understand all that ye say,- nor in a state of ceremonial impurity (Except when travelling on the road), until after washing your whole body. If ye are ill, or on a journey, or one of you cometh from offices of nature, or ye have been in contact with women, and ye find no water, then take for yourselves clean sand or earth, and rub therewith your faces and hands. For Allah doth blot out sins and forgive again and again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Approach not As-Salat (the prayer) when you are in a drunken state until you know (the meaning) of what you utter, nor when you are in a state of Janaba, (i.e. in a state of sexual impurity and have not yet taken a bath) except when travelling on the road (without enough water, or just passing through a mosque), till you wash your whole body. And if you are ill, or on a journey, or one of you comes after answering the call of nature, or you have been in contact with women (by sexual relations) and you find no water, perform Tayammum with clean earth and rub therewith your faces and hands (Tayammum). Truly, Allah is Ever Oft-Pardoning, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not come close to prayer when you are drunk, until you know what you are saying, nor when you are in a state of impurity, unless you are crossing through the way (prayer area) until you have bathed yourselves. If you are ill or on a journey, or if any of you comes from the toilet or you have touchedwomen, and you cannot find water, so touch pure dust and wipe your faces and your hands. Allah is the Pardoner, the Forgiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not approach the prayer while you are drunk, so that you know what you say; nor after sexual orgasm—unless you are travelling—until you have bathed. If you are sick, or traveling, or one of you comes from the toilet, or you have had intercourse with women, and cannot find water, find clean sand and wipe your faces and your hands with it. God is Pardoning and Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not approach prayer while you are intoxicated until you know what you are saying or in a state of janabah, except those passing through [a place of prayer], until you have washed [your whole body]. And if you are ill or on a journey or one of you comes from the place of relieving himself or you have contacted women and find no water, then seek clean earth and wipe over your faces and your hands [with it]. Indeed, Allah is ever Pardoning and Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:43] O you who believe, draw not near to prayer, that is, do not perform prayer, whilst you are inebriated, by a drink: this was revealed concerning being drunk during the congregational prayer; until you know what you are saying, when you have sobered up; nor whilst you are defiled, as a result of [sexual] penetration or ejaculation (junuban, ‘defiled’, is in the accusative because it is a circumstantial qualifier, and may be used to refer to the singular or plural) — unless you are traversing, crossing, a way, a route, that is, [unless] you are travelling — until you have washed yourselves, in which case you may perform prayer: a proviso is made for the traveller because a different stipulation applies to him, as will follow. It is said that the purpose [of this verse] is to prohibit the approach to places of prayer, that is, mosques, the exception being if one were merely passing through and not staying. But if you are sick, with an illness made worse by [contact with] water, or on a journey, that is, [or] travelling whilst you are [ritually] defiled or impure, or if any of you comes from the privy (al-ghā’it), a place designated for relieving nature, that is to say, [or if any of you] have defecated, or you have touched women (lāmastum, a variant reading has lamastum: both mean lams, that is, ‘touching with the hand’, as stated by Ibn ‘Umar; this is also the opinion of al-Shāfi‘ī, and it extends to touching with other parts of the skin; according to Ibn ‘Abbās, however, it is [referring to] sexual intercourse); and you can find no water, with which to purify yourselves for prayer, having made the effort to seek it out and search for it — the sick being exempt in this case — then resort to, seek, when the time [for the prayer] has commenced, wholesome soil, clean earth, strike it twice, and wipe your faces and your hands, with it, up to the elbows (the verb masaha, ‘to wipe’, may stand on its own with a direct object or take a particle [before the direct object, sc. masaha bi-]). God is ever Pardoning, Forgiving.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ ياأيها الذين ءَامَنُواْ لاَ تَقْرَبُواْ الصلاة وَأَنتُمْ سكارى حتى تَعْلَمُواْ مَا تَقُولُونَ } .هذه الآية استئناف لبيان حكمين يتعلّقان بالصلاة ، دعا إلى نزولها عقب الآيات الماضية أنّه آن الأوان لتشريع هذا الحكم في الخمر حينئذ ، وإلى قَرنه بحكم مقرّر يتعلّق بالصلاة أيضاً . ويظهر أنّ سبب نزولها طرأ في أثناء نزول الآيات التي قبلها والتي بعدها ، فوقعت في موقععِ وقت نزولها وجاءت كالمعترضة بين تلك الآيات . تضمّنت حكماً أوَّلَ يتعلّق بالصلاة ابتداء ، وهو مقصود في ذاته أيضاً بحسب الغاية ، وهو قوله : { لا تقربوا الصلاة وأنتم سكارى } ، ذلك أنّ الخمر كانت حَلالا لم يحرّمها الله تعالى ، فبقيت على الإباحة الأصلية ، وفي المسلمين من يشربها . ونزل قوله تعالى : { يسألونك عن الخمر والميسر قل فيهما إثم كبير ومنافع للناس } \\[ البقرة : 219 \\] في أول مدّة الهجرة فقال فريق من المسلمين : نحن نشربها لمنافعها لا لإثْمها ، وقد علموا أنّ المراد من الإثم الحرج والمضرّة والمفسدة ، وتلك الآية كانت إيذانا لهم بأنّ الخمر يوشك أن تكون حراماً لأنّ ما يشتمل على الإثم مُتّصف بوصف مناسب للتحريم ، ولكن الله أبقى إباحتها رحمة لهم في معتادهم ، مع تهيئة النفوس إلى قبول تحريمها ، فحدث بعد ثلاث سنين ما رواه الترمذي عن علي بن أبي طالب قال : صنع لنا عبد الرحمن بن عوف طعاماً فدعانا وسقانا خمراً وحضرت الصلاة فقدّموني فقرأتُ : قل يأيها الكافرون لا أعبد ما تعبدون ونحن نعبد ما تعبدون ، فأنزل الله تعالى : { يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى } . قال أبو عيسى : هذا حديث حسن صحيح .والقرب هنا مستعمل في معناه المجازي وهو التلبّس بالفعل ، لأنّ ( قَرُب ) حقيقة في الدنوّ من المكان أو الذات يقال : قرب منه بضم الراء وقرِبه بكسر الراء وهما بمعنى ، ومن الناس من زعم أنّ مكسور الراء للقرب المجازي خاصّة ، ولا يصحّ .وإنّما اختير هذا الفعل دون لا تُصَلُّوا ونحوه للإشارة إلى أنّ تلك حالة منافية للصلاة ، وصاحبُها جدير بالابتعاد عن أفضل عمل في الإسلام ، ومن هنا كانت مؤذنة بتغيّر شأن الخمر ، والتنفير منها ، لأنّ المخاطبين يومئذ هم أكمل الناس إيماناً وأعلقهم بالصلاة ، فلا يرمُقون شيئاً يمنعهم من الصلاة إلاّ بعَين الاحتقار . ومن المفسّرين مَن تأوّل الصلاة هنا بالمسجد من إطلاق اسم الحالّ على المحلّ كما في قوله تعالى : { وصلوات ومساجد } \\[ الحج : 40 \\] ، ونقل عن ابن عباس ، وابن مسعود ، والحسن قالوا : كان جماعة من الصحابة يشربون الخمر ثم يأتون المسجد للصلاة مع رسول الله فنهاهم الله عن ذلك ولا يخفى بعده ومخالفته لمشهور الآثار .وقوله : { حتى تعلموا ما تقولون } غاية للنهي وإيماء إلى علّته ، واكتفى بقوله ( تقولون ) عن { تفعلون } لظهور أنّ ذلك الحدّ من السكر قد يفضي إلى اختلال أعمال الصلاة ، إذ العمل يسرع إليه الاختلال باختلال العقل قبل اختلال القول .وفي الآية إيذان بأنّ السكر الخفيف لا يمنع الصلاة يومئذ؛ أو أريد من الغاية أنّها حالة انتهاء السكر فتبقى بعدها النشوة . وسكارى جمع سكران ، والسكران من أخَذ عقله في الانغلاق ، مشتقّ من السَّكْر ، وهو الغلق ، ومنه سكْر الحوض وسكْر الباب { وسكرت أبصارنا } \\[ الحجر : 15 \\] .ولمّا نزلت هذه الآية اجتنب المسلمون شرب الخمر في أوقات الصلوات فكانوا لا يشربون إلاّ بعد صلاة العشاء وبعد صلاة الصبح ، لبعد ما بين هاتين الصلاتين وبين ما تليانهما ، ثم أكمل مع تحريم قربان الصلاة في حالة السكر تحريم قربانها بدون طهارة .عطف على جملة { وأنتم سكارى } لأنّا في محلّ الحال ، وهذا النصب بعد العطف دليل بيِّنٌ على أنّ جملة الحال معَتبرة في محلّ نصب .والجنُب فُعُل ، قيل : مصدر ، وقيل : وصف مثل أُجُد ، وقد تقدّم الكلام فيه آنفاً عند قوله : { والجار الجنب } \\[ النساء : 36 \\] ، والمراد به المباعد للعبادةِ من الصلاة إذا قارف امرأته حتى يغتسل .ووصفُ جنُب وصفٌ بالمصدر فلذلك لم يجمع إذْ أخبر به عن جمع ، مِن قوله : { وأنتم سكارى } . وإطلاق الجنابة على هذا المعنى من عهد الجاهلية ، فإنّ الاغتسال من الجنابة كان معروفاً عندهم ، ولعلّه من بقايا الحنيفية ، أو ممّا أخذوه عن اليهود ، فقد جاء الأمر بغسل الجنابة في «الاصحاح» 15 من سفر اللاويين من التوراة . وذكر ابن إسحاق في «السيرة» أنّ أبا سفيان ، لما رجع مهزوماً من بدر ، حلف أن لا يمسّ رأسَه غسلٌ من جنابة حتّى يغزوَ محمّداً . ولم أقف على شيء من كلام العرب يدلّ على ذكر غسل الجنابة .والمعنى لا تُصَلُّوا في حال الجنابة حتّى تغتسلوا إلخ . والمقصود من قوله : { ولا جنباً } التمهيد للتخلّص إلى شرع التَّيمّم ، فإنّ حكم غسل الجنابة مقرّر من قبل ، فذكره هنا إدماج . والتيمّم شرع في غزوة المُرَيْسيع على الصحيح ، وكانت سنة ستّ أو سنة خمسسٍ على الأصحّ . وظاهر حديث مالك عن عائشة أنّ الآية التي نزلت في غزوة المرَيْسيع هي آية التيمّم ، فيظهر أن تكون هذه الآية التي في سورة النساء لأنّها لم يذكر منها إلاّ التيمّم . ووقع في حديث عمرو عن عائشة أنّ الآية التي نزلت هي قوله : { يأيها الذين آمنوا إذا قمتم إلى الصلاة } التي في سورة المائدة ( 6 ) ، أخرجه البخاري وقد جزم القرطبي بأنّ الآية التي نزلت في غزوة المريسيع هي آية سورة النساء ، قال : لأنّ آية سورة المائدة تسمّى آية الوضوء . وكذلك الواحدي أورد في أسباب النزول حديث عائشة في سبب نزول آية سورة النساء . وقال ابن العربي هذه معضلة ما وجدت لدائها من دواء لا نعلم أيّ الآيتين عنت عائشة .وسورة المائدة قيل : نزلت قبل سورة النساء ، وقيل بعدها ، والخطب سهل ، والأصحّ أنّ سورة النساء نزلت قبل سورة المائدة .والاستثناء في قوله : إلا عابري سبيل } استثناء من عموم الأحوال المستفادِ من وقوع ( جنبا ) ، وهو حال نكرة ، في سياق النفي . وعابر السبيل ، في كلام العرب : المسافر حين سيره في سفره ، مشتقّ من العبر وهو القطع والاجتياز ، يقال : عبر النهر وعبر الطريق . ومن العلماء من فسّر { عابري سبيل } بمارّين في طريق ، وقال : المراد منه طريق المسجد ، بناء على تفسير الصلاة في قوله : { لا تقربوا الصلاة } بالمسجد ، وجعلوا الآية رخصة في مرور الجنب في المسجد إذا كان قصده المرور لا المكث ، قاله الذين تأوّلوا الصلاة بالمسجد . ونسب أيضاً إلى أنس بن مالك ، وأبي عبيدة ، وابن المسّيب ، والضحّاك ، وعطاء ، ومجاهد ، ومسروق ، والنخعي ، وزيد بن أسْلم ، وعمرو بن دينار ، وعكرمة ، وابن شهاب ، وقتادة ، قالوا : كان ذلك أيام كان لكثير من المهاجرين والأنصار أبواب دُور في المسجد ، ثم نسخ ذلك بعدَ سدّ الأبواب كلّها إلاّ خوخة أبي بكر ، فكان المرور كذلك رخصة للنبيء صلى الله عليه وسلم ولأبي بكر ، وفي رواية ولعلي ، وقيل : أبقيت خوخة بنت عليّ في المسجد ، ولم يصحّ .وفائدة هذا الاستثناء عند من فسّر { تقربوا الصلاة } بدخول المسجد ، وفسّر { عابري سبيل } بالمارّين في المسجد ظاهرة ، وهو استثناء حقيقي من عموم أحوال الجنب باستثناء عابري السبيل . وعابرُ السبيل المأخوذ من الاستثناء مطلق ، وهو عند أصحاب هذا المحمل باق على إطلاقه لا تقييد فيه ، وأمّا عند الجمهور الذين حملوا الآية على ظاهرها في معنى تقربوا الصلاة ، وفي معنى عابري السبيل فلا تظهر له فائدة ، للاستغناء عنه بقوله بعده { أو على سفر } ولأنّ في عموم الحصر تخصيصاً ، فالذي يظهر لي أنّه إنّما قدّم هنا لأنّه غالب الأحوال التي تحول بين المرء وبين الاغتسال من جهة حاجة المسافر استبقاءَ الماء . ولندور عروض المرض . والاستثناء على محمل الجمهور يحتمل أنْ يكون متّصلا عند من يرى المتيمّم جنباً ، ويرى التيمّم غير رافع للحدث ، ولكنّه مبيح للصلاة للضرورة في الوقت ، وهذا قول الشافعي ، فهو عنده بدل ضروري يقدّر بقدر الضرورة ، ودَليله ظاهر الاستثناء ، ويحتمل أن يكون منقطعاً عند من يرى المتيمّم غير جنب ، ويرى التيمّم رافعاً للحدث حتّى ينتقض بناقض ويزول سببه . وهذا قول أبي حنيفة ، فلذلك إذا تيمّم الجنب وصلّى وصار منه حدث ناقض للوضوء يتوضّأ لأنّ تيمّمه بدل عن الغسل مطلقاً ، وهذا هو الظاهر بحسب المعنى وليس في السنّة ما يقتضي خلافه . وعن مالك في ذلك قولان : فالمشهور من رواية ابن القاسم أنّ التيمّم مبيح للصلاة وليس رافعاً للحدث ، فلذلك لا يصلّي المتيمّم به إلاّ فرضاً واحداً ، ولو تيمّم لجنابة لعذر يمنع من الغسل وانتقض وضوءه تيمّم عن الوضوء .وعن مالك ، في رواية البغداديين : أنّ المريض الذي لا يقدر على مسّ الماء يتيمّم ويصلّي أكثر من صلاة ، حتّى ينتقض تيمّمه بناقض الوضوء ، وكذلك فيمن ذكر فوائت يصلّيها بتيمّم واحد ، فعلى هذا ليس تجديد التيمّم لغيرهما إلاّ لأنَّه لا يدري لعلّه يجد الماء فكانت نيّة التيمّم غيرَ جازمة في بقائه ، ولم ينقل عن مالك قول بأنّ المتيمّم للجنابة بعذر مانع من الغسل إذا انتقض وضوءه يتوضأ .وفي مفهوم هذا الاستثناء ، عند القائلين بالمفاهيم من الجمهور ، على هذا المحمل تفصيل . فعابر السبيل مُطلق قيده قوله : { فلم تجوا ماء فتيمموا } وبقي عموم قوله { ولا جنباً } في غير عابر السبيل ، لأنّ العامّ المخصوص يبقى عامّا فيما عدا ما خُصّص ، فخَصَّصه الشرط تخصيصاً ثانياً في قوله : { وإن كنتم مرضى } . ثم إن كان قد تقرّر عند المسلمين أنّ الصلاة تقع بدون طهارة يبق قوله : { إلا عابري سبيل } مجملاً لأنّهم يترقّبون بيانَ الحكم في قربان الصلاة على غير طهارة للمسافر ، فيكون في قوله : { وإن كنتم مرضى أو على سفر } بيان لهذا الإجمال ، وإن كان ذلك لم يخطر ببالهم فلا إجمال ، ويكون قوله : { وإن كنتم مرضى أو على سفر } استئنافا لأحكام التيمّم .وتقديم المُستثنى في قوله : { إلا عابري سبيل } قبل تمام الكلام المقصود قصره بقوله : { حتى تغتسلوا } للاهتمام وهو جار على استعمال قليل ، كقول موسى بن جابر الحنفي أموي :لاَ أشتهي يا قوم إلاَّ كارها ... بابَ الأمير ولا دفاع الحاجبوقوله : { حتى تَغْتَسِلُواْ } غاية للنهي عن الصلاة إذا كانوا جنباً ، فهو تشريع للغسل من الجنابة وإيجاب له ، لأنّ وجوب الصلاة لا يسقط بحال ، فلمّا نهوا عن اقترابها بدون الغسل علم من ذلك فرض الغسل . والحكمة في مشروعية الغسل النظافة ، ونيطَ ذلك بأداء الصلاة ليكون المصلّي في حالة كمال الجسد ، كما كان حينئذ في حال كمال الباطن بالمناجاة والخضوع . ومن أبدع الحِكم الشرعية أنّها لم تنط وجوب التنظّف بحال الوسخ لأنّ مقدار الحال من الوسخ الذي يستدعي الاغتسال والتنظف ممّا تختلف فيه مدارك البشر في عوائدهم وأحوالهم ، فنيطَ وجوب الغسل بحالة لا تنفكّ عن القوة البشرية في مدّة متعَارف أعمار البشر ، وهي حالة دفع فواضل القوة البشرية ، وحيث كان بَيْن تلك الحالة وبين شدّة القوّة تناسب تامّ ، إذ بمقدار القوة تندفع فضلاتها ، وكان أيضاً بين شدّة القوة وبين ظهور الفضلات على ظاهر البدن المعبّر عنها بالوسخ تناسبٌ تامّ ، كان نوْط الاغتسال بالجنابة إناطة بوصف ظاهر منضبط فجُعل هو العلّة أو السبب ، وكان مع ذلك محصّلا للمناسبة المقتضية للتشريع ، وهي إزالة الأوساخ عند بلوغها مقدارا يناسب أن يزال مع جعل ذلك مرتبطاً بأعظم عبادة وهي الصلاة ، فصارت الطهارة عبادة كذلك ، وكذلك القول في مشروعية الوضوء ، على أنّ في الاغتسال من الجنابة حكمة أخرى ، وهي تجديد نشاط المجموع العصبي الذي يعتريه فتورٌ باستفراغ القوة المأخوذة من زبد الدم ، حسبما تفطّن لذلك الأطباء فقُضيت بهذا الانضباط حِكَمٌ عظيمة .ودلّ إسناد الاغتسال إلى الذوات في قوله : { حتى تغتسلوا } على أنّ الاغتسال هو إحاطة البدن بالماء ، وهذا متّفق عليه ، واختلف في وجوب الدلك أي إمرار اليد على أجزاء البدن : فشرطه مالك رحمه الله بناء على أنّه المعروف من معنى الغسل في «لسان العرب» ، ولأنّ الوضوء لا يجزىء بدون ذلك باتّفاق ، فكذلك الغسل .وقال جمهور العلماء : يجزىء في الغسل إحاطة البدن بالماء بالصبّ أو الانغماس؛ واحتجّوا بحديث ميمونة وعائشة رضي الله عنهما في غسل النبي صلى الله عليه وسلم أنّه أفاض الماء على جسده ، ولا حجّة فيه لأنّهما لم تذكرا أنّه لم يتدلّك ، ولكنّهما سكتتا عنه ، فيجوز أن يكون سكوتهما لعلمهما بأنّه المتبادر ، وهذا أيضاً رواية عن مالك رواها عنه أبو الفرج ، ومروان بن محمد الطاطري ، وهي ضعيفة .وقوله : { وإن كنتم مرضى } إلخ ذكرُ حالةِ الرخصة في ترك الاغتسال وترك الوضوء الذي لم يذكر في هذه السورة ، وذُكر في سورة المائدة ، وهي نازلة قبل هذه السورة . فالمقصود بيان حكم التيمّم بحذافره . وفي جمع هذه الأشياء في نسق حصل هذا المقصود ، وحصل أيضاً تخصيص لعموم قوله : { ولا جنباً } كما تقدّم .وقوله : { أو على سفر } بيان للإجمال الواقع في قوله : { إلا عابرب سبيل } إن كان فيه إجمال ، وإلاّ فهو استئناف حكم جديد كما تقدّم .وقوله : { أو جاء أحد منكم من الغائط } زيادة على حكم التيمّم الواقع بدلا من الغسل ، بذكر التيمّم الواقع بدلا عن الوضوء إيعاباً لنوعَي التيمّم . وغير ذلك من أسبابه يؤخذ بالقياس على المذكور . فالمريض أريد به الذي اختلّ نظام صحتِه بحيث صار الاغتسال يضرّه أو يزيد عِلَّتَه . { أو جاء . . . من الغائط } كناية عن قضاء الحاجة البشرية ، شاع في كلامهم التكنّي بذلك لبشاعة الصريح .والغائط : المنخفض من الأرض ، وما غاب عن البصر ، يقال : غَاط في الأرض إذا غاب يغوط ، فهمزته منقلبة عن الواو ، وكانت العرب يذهبون عند قضاء الحاجة إلى مكان منخفض من جهة الحي بعيد عن بيوت سكناهم ، فيكنون عنه : يقولون ذهب إلى الغائط أو تغوّط ، فكانت كناية لطيفة ثم استعملها الناس بعد ذلك كثيراً حتّى ساوت الحقيقة فسمَجَت ، فصار الفقهاء يطلقونه على نفس الحدث ويعلّقونه بأفعال تناسب ذلك .وقوله : { أو لامستم النساء } قرىء ( لامستم ) بصيغة المفاعلة ، وقرىء ( لمستم ) بصيغة الفعل كما سيأتي ، وهما بمعنى واحد على التحقيق . ومن حاول التفصيل لم يأت بما فيه تحصيل . وأصل اللّمس المباشرة باليد أو بشيء من الجسد ، وقد أطلق مجازاً وكناية على الافتقاد ، قال تعالى :{ وأنا لمسنا السماء } \\[ الجن : 8 \\] وعلى النزول ، قال النابغة :ليَلْتَمِسَنْ بالجيش دارَ المحارب ... وعلى قربان النساء ، لأنّه مرادف المسّ ، ومنه قولهم : «فلانة لا تردّ يد لامس» ، ونظيره { وإن طلقتموهن من قبل أن تمسوهن } \\[ البقرة : 237 \\] . والملامسة هنا يحتمل أن يكون المراد منها ظاهرها ، وهو الملامسة بمباشرة اليد أو بعضضِ الجسد جسدَ المرأة ، فيكون ذكر سببا ثانياً من أسباب الوضوء التي توجب التيمّم عند فقد الماء ، وبذلك فسّره الشافعي ، فجعل لمس الرجل بيده جسد امرأته موجباً للوضوء ، وهو محمل بعيد ، إذ لا يكون لمس الجسد موجباً للوضوء وإنَّما الوضوء ممّا يخرج خروجاً معتاداً . فالمحمل الصحيح أنّ الملامسة كناية عن الجماع . وتعديد هذه الأسباب لجمع ما يغلب من موجبات الطهارة الصغرى والطهارة الكبرى ، وإنّما لم يستغن عن { لمستم النساء } بقوله آنفاً { ولا جنباً } لأنّ ذلك ذكر في معرض الأمر بالاغتسال ، وهذا ذكر في معرض الإذن بالتيمّم الرخصة . والمقام مقام تشريع يناسبه عدم الاكتفاء بدلالة الالتزام ، وبذلك يكون وجه لذكره وجيه . وأمّا على تأويل الشافعي ومن تابعه فلا يكون لذكر سبب ثان من أسباب الوضوء كبير أهمية . وإلى هذا مال الجمهور فلذلك لم يجب عند مالك وأبي حنيفة الوضوء من لمس الرجل امرأته ما لم يخرج منه شيء ، إلاّ أنّ مالكاً قال : إذا التذ اللامس أو قَصَد اللذّة انتقض وضوءه ، وحمل الملامسة في هذه الآية على معنييها الكنائي والصريح ، لكن هذا بشرط الالتذاذ ، وبه قال جمع من السلف ، وأرى مالكاً اعتمد في هذا على الآثار المروية عن أيّمة السلف ، ولا أراه جعله المراد من الآية .وقرأ الجمهور { لامستم } بصيغة المفاعلة؛ وقرأه حمزة والكسائي وخلف { لمستم } بدون ألف .وقوله : { فلم تجدوا ماء } عطف على فعل الشرط ، وهو قيد في المسافر ، ومن جاء من الغائط ، ومن لامس النساء ، أمّا المريض فلا يتقيّد تَيمّمه بعدم وجدان الماء لأنّه يتيمّم مطلقاً ، وذلك معلوم بدلالة معنى المرض ، فمفهوم القيد بالنسبة إليه معطّل بدلالة المعنى ، ولا يكون المقصود من المريض الزمن ، إذ لا يعدم الزمن مناوِلاً يُناوله الماء إلاّ نادرا .وقوله { فتيمموا } جواب الشرط والتيمّم القصد والصعيد وجه الأرض ، قال ذو الرمّة يصف خشفا من بقر الوحش نائماً في الشمس لا يكاد يفيق :كأنَّه بالضحى تَرْمِي الصعيدَ به ... دَبَّابَةٌ في عظام الرأس خُرطوموالطيّب : الطاهر الذي لم تلوّثه نجاسة ولا قذر ، فيشمل الصعيدُ الترابَ والرملَ والحجارة ، وإنّما عبّر بالصعيد ليصرف المسلمين عن هوس أن يتطلّبوا التراب أو الرمل ممّا تحت وجه الأرض غلوّا في تحقيق طهارته .وقد شُرع بهذه الآية حكم التيمّم أو قرّر شرعه السابق في سورة المائدة على الأصحّ ، وكان شرع التيمم سنة ستّ في غزوة المريسيع ، وسبب شرعه ما في «الصحيح» عن عائشة قالت : خرجنا مع رسول الله في بعض أسفاره حتى إذا كنّا بالبيداء أو بذات الجيش انقطع عقد لي فأقام رسول الله على التماسه وأقام الناس معه وليسوا على ماء وليس معهم ماء فأتى الناسُ إلى أبي بكر الصديق فقالوا : ألا ترى إلى ما صنعت عائشة أقامت برسول الله والناسسِ وليسوا على ماء وليس معهم ماء .فجاء أبو بكر ورسول الله واضع رأسه على فخذي قد نام ، فقال : حَبَسْتتِ رسول الله والناسَ وليسوا على ماء وليس معهم ماء ، فعاتَبني أبو بكر وقال ما شاء الله أن يقول وجعل يطعنني بيده في خاصرتي فلا يمنعني من التحرّك إلا مَكانُ رسول الله على فَخِذي ، فقام رسول الله حين أصبح على غير ماء ، فأنزل الله تعالى آية التيمّم . فقال أسَيْد بنُ الحُضَيْر : ما هي بأوّللِ بركتكم يا آلَ أبي بكر ، فوالله ما نَزل بككِ أمْر تكرهينَه إلاّ جعل الله ذلك لككِ وللمسلمين فيه خيراً . قالت : فبعثْنَا البعيرَ الذي كنتُ عليه فأصبنا العِقْد تحته .والتيمّم من خصائص شريعة الإسلام كما في حديث جابر أنّ النبي صلى الله عليه وسلم قال : « أعْطِيتُ خمسا لَمْ يُعْطَهُنَّ أحد قبلي فذكر منها وجُعِلت لي الأرض مسجداً وطَهوراً » . والتيمّم بدل جعله الشرع عن الطهارة ، ولم أر لأحد من العلماء بيانا في حكمة جعل التيمّم عوضاً عن الطهارة بالماء وكان ذلك من همّي زمنا طويلاً وقت الطلب ثم انفتح لي حكمة ذلك .وأحسب أنّ حكمة تشريعه تقرير لزوم الطهارة في نفوس المؤمنين ، وتقرير حُرمة الصلاة ، وترفيع شأنها في نفوسهم ، فلم تُترك لهم حالة يعدّون فيها أنفسهم مُصلّين بدون طهارة تعظيماً لمناجاة الله تعالى ، فلذلك شَرع لهم عملا يشبه الإيماء إلى الطهارة ليستشعروا أنفسهم متطهّرين ، وجعل ذلك بمباشرة اليدين صَعيدَ الأرض التي هي منبع الماء ، ولأنّ التراب مستعمل في تطهير الآنية ونحوها ، ينظّفون به ما علق لهم من الأقذار في ثيابهم وأبدانهم وماعونهم ، وما الاستجمار إلاّ ضرب من ذلك ، مع ما في ذلك من تجديد طلب الماء لفاقده وتذكيره بأنّه مطالب به عند زوال مانعه ، وإذ قد كان التيمّم طهارة رمزية اقتنعت الشريعة فيه بالوجه والكفين في الطهارتين الصغرى والكبرى ، كما دلّ عليه حديث عمّار بن ياسِر ، ويؤيّد هذا المقصد أنّ المسلمين لما عَدِموا الماء في غزوة المريسيع صلَّوْا بدون وضوء فنزلت آية التيمّم . هذا منتهى ما عرض لي من حكمة مشروعيّة التيمّم بعد طول البحث والتأمّل في حكمة مقنعة في النظر ، وكنت أعدّ التيمّم هو النوع الوحيد بين الأحكام الشرعية في معنى التعبّدِ بنَوعه ، وأمّا التعبّد ببعض الكيفيات والمقادير من أنواع عبادات أخرى فكثير ، مثل عدد الركعات في الصلوات ، وكأنَّ الشافعي لمّا اشترط أن يكون التيمّم بالتراب خاصّة وأن ينقل المتيمّم منه إلى وجهه ويديه ، راعى فيه معنى التنظيف كما في الاستجمار ، إلاّ أنّ هذا القول لم ينقل عن أحد من السلف ، وهو ما سبق إلى خاطر عَمّار بن ياسر حين تمرّغ في التراب لمّا تعذّر عليه الاغتسال ، فقال له النبي صلى الله عليه وسلم\" يكفيك من ذلك الوجهُ والكفَّان \" . ولأجل هذا أيضاً اختلف السلف في حكم التيمّم ، فقال عُمر وابن مسعود : لا يقع التيمّم بدلا إلاّ عن الوضوء دون الغسل ، وأنّ الجنب لا يصلّي حتّى يَغتسل سواء كان ذلك في الحضر أم في السفر . وقد تناظر في ذلك أبو موسى الأشعري وعبد الله بن مسعود : روى البخاري في كتاب التيمّم قال أبو موسى لا بن مسعود : أرأيتَ إذا أجنب فلم يجد الماء كيف يصنع؟ قال عبدُ اللَّه : لا يُصلّي حتّى يجد الماء . فقال أبو موسى : فكيف تصنع بقول عمّار حين قال له النبي : كان يكفيك هكذا ، فضرب بكفّيه الأرض ثم مسح بهما وجهه وكفّيه ، قال ابن مسعود : ألم تر عُمَرَ لم يقنَعْ منه بذلك ، قال أبو موسى . فدَعْنَا من قول عمّار ، كيف تصنع بهذه الآية { وإن كنتم مرضى أو على سفر } فما درى عبد الله ما يقول ، فقال : إنَّا لو رخَّصْنا لهم في هذا لأوْشَكَ إذا بَرَد على أحدهم الماءُ أن يدَعَه ويتيمّم ، ولا شك أنّ عمر ، وابن مسعود ، تأوّلا آية النساء فجعلا قوله : { إلا عابري سبيل } رخصة لمرور المسجد ، وجعلا { أو لامستم النساء } مراداً به اللّمس الناقض للوضوء على نحو تأويل الشافعي ، وخالف جميعُ علماء الأمّة عمرَ وابنَ مسعود في هذا ، فقال الجمهور : يتيمّم فاقد الماء ومن يخاف على نفسه الهلاك أو المرض أو زيادة المرض ولو نَزْلَة أو حمّى . وقال الشافعي : لا يتيمّم إلاّ فاقد الماء أو من يخاف على نفسه التلف دون المرض أو زيادته ، لأنّ زيادة المرض غير محقّقة ، ويردّه أنّ كلا الأمرين غير محقّق الحصول ، وأنّ الله لم يكلّف الخلق بما فيه مشقّة . وقد تيمّم عَمْرو بن العاص رضي الله عنه في ليلة باردة في غزوة ذات السلاسل وصلّى بالناس ، «فذكروا ذلك للنبيء صلى الله عليه وسلم فسأله فقال عمرو : إني سمعت الله يقول : { ولا تقتلوا أنفسكم إن الله كان بكم رحيماً } \\[ النساء : 29 \\] فضحك النبي عليه الصلاة والسلام ولم ينكر عليه .وقوله : { فامسحوا بوجوهكم وأيديكم } جعل التيمّم قاصرا على مسح الوجه واليدين ، وأسقط مسح ما سواهما من أعضاء الوضوء بَلْهَ أعضاء الغسل ، إذ ليس المقصود منه تطهيراً حسيَّا ، ولا تجديد النشاط ، ولكن مجرّد استحضار استكمال الحالة للصلاة ، وقد ظنّ بعض الصحابة أنّ هذا تيمّم بدل عن الوضوء ، وأنّ التيمّم البدل عن الغسل لا يجزىء منه إلاّ مسح سائر الجسد بالصعيد ، فعلّمه النبي صلى الله عليه وسلم أن التيمّم للجنابة مثل التيمّم للوضوء ، فقد ثبت في «الصحيح» عن عمّار بن ياسر ، قال : كنت في سفر فأجنبت فتمعَّكْت في التَراب ( أيْ تمرّغت ) وصلّيت فأتيت النبي فذكرت ذلك فقال «يكفيك الوجه والكفان» وقد تقدّم آنفاً .والباء للتأكيد مثل : «وهزّي إليك بجذع النخلة» وقول النابغة يرثي النعمان بن المنذر :لكَ الخيرُ إن وارتْ بك الأرضُ واحدا ... وأصْبَحَ جَدُّ الناس يظْلَعَ عَاثِراأراد إن وارتْك الأرض مواراة الدفن . والمعنى : فامسحوا وجوهكم وأيديكم ، وقد ذُكرت هذه الباء مع الممسوح في الوضوء ومع التيمّم للدلالة على تمكّن المسح لئلا تزيد رخصةٌ على رخصة .وقوله : { إن الله كان عفواً غفوراً } تذييل لحكم الرخصة إذ عفا عن المسلمين فلم يكلّفهم الغسل أو الوضوء عند المرض ، ولا ترقّبَ وجود الماء عند عدمه ، حتّى تكثر عليهم الصلوات فيعسر عليهم القضاء .\n\n",
      "translations": [
        {
          "translation": "Allah revealed the following about the Companions of Muhammad prior to the prohibition of intoxicants: (0 ye who believe!) in Muhammad and the Qur'an (Draw not near unto prayer) in the Mosque of the Prophet (pbuh) with the Prophet (pbuh) (when ye are drunken, till ye know that which ye utter) so that you know what the prayer leader recites during the prayer, (nor when ye are polluted) nor when you are in a state of major ritual impurity, (save when journeying upon the road) except when passing through when you have to, (till ye have bathed) to purify yourselves from major ritual impurity. (And if ye be ill) wounded, (or on a journey, or one of you cometh from the closet, or ye have touched women) made love to them, (and ye find not water, then go to high clean soil and rub your faces) with the first clap (and your hands (therewith)) with the second clap. (Lo! Allah is Benign) Allah is Generous for the abundance He has given you, (Forgiving) of any shortcoming that may ensue from you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْ لَٰمَسْتُمُ ٱلنِّسَآءَ } والمُلاَمَسَةُ: الجمَاعُ\n\n\n\n\nوقوله تعالى: { فَتَيَمَّمُواْ صَعِيداً طَيِّباً } فالتَّيمّمُ: التعمدُ\n والصَّعِيدُ: وَجهُ الأَرضِ\n والطِّيبُ: النَّظيفُ\n\n\n\n\nوقوله تعالى: { أَوْ جَآءَ أَحَدٌ مِّنْكُمْ مِّن ٱلْغَآئِطِ } فالغَائِطُ: الفَتحُ مِنَ الأَرضِ المُتصوِّبُ: أَي المُتَحَدِرُ\n وأَرادَ بِهِ لكنايَةُ عَنْ حَاجَةِ ذِي البَطنِ\n\n",
      "translations": [
        {
          "translation": "\nOr have you touched women? And touching: intercourse\n\n\nAnd His saying, {So perfect your work} - that is, do it deliberately.\n\n\nAnd the ground: the face of the earth.\n\n\nAnd the pure (al-ṭayyib) is the clean (al-naṣīf).\n\n\nAnd the saying of Allah {or one of you comes from the depths} the depths: the opening from the earth that is inclined, that is, the one who is turned around.\n\n\nAnd he wanted to do it secretly, out of need for the one with the belly.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فإن المؤمن بالإيمان العيني لا يكون في صلاته غافلاً { لا تَقْرَبوا الصلاة } أي: لا تقربوا مقام الحضور والمناجاة مع الله في حال كونكم { سُكَارى } من نوم الغفلة\n أو من خمور الهوى ومحبة الدنيا { حتى تعلموا ما تقولون } في مناجاتكم ولا تشتغل قلوبكم بأشغال الدنيا ووساوسها فتذهلوا عنه\n ولا في حال كونكم بعداء عن الحق بشدّة الميل إلى النفس ومباشرة لذاتها وشهواتها وحظوظها والركون إليها { إلاّ عابري سبيل } أي: مارّين عليها\n سالكي طريق من طرق تمتعاتها بقدر الضرورة والمصلحة كعبور طريق الاغتذاء بالمطعم والمشرب لسدّ الرمق وحفظ القوة\n والاكتساء لدفع الحرّ والبرد وستر العورة\n والمباشرة لحفظ النسل لا منجذبين إليها بالكلية بمجرّد الهوى فتنطبع فيكم فلا يمكن زوالها أو يتعذر { حتى تغتسلوا } أي: تتطهروا عن تلك الهيئة الحاصلة من الانجذاب إلى الجهة السفلية بماء التوبة والاستغفار وعيون التنصل والاعتذار { وإن كنتم مرضى } القلوب\n فاقدي سلامتها بأمراض العقائد الفاسدة والرذائل المهلكة { أو على سفر } في تَيْه الجهل والحيرة لطلب لذّة النفس ومادة الرجس بالحرص { أو جاء أحد منكم } من الاشتغال بلوث المال وكسب الحطام ملوّثاً بهيئة محبته وميله راسخة فيه تلك الهيئة { أو لامستم النساء } لازمتم النفوس وباشرتموها في لذاتها وشهواتها { فلم تجدوا ماء } علماً يهديكم إلى التفصي منها ويهذبكم بالتطهّر عنها { فتيمموا صعيداً طيباً } فتوجهوا صعيد استعدادكم الطيب\n واقصدوه وارجعوا إلى أصل الاستعداد الفطريّ { فامْسَحوا } من نوره { بِوجُوهكم وأيديكُم } أي: ذواتكم الموجودة وصفاتكم بالنزول ومحو هيئات العلق بها\n والتصرّف فيها\n فإن ذلك التراب يمحو آثارها ويذرها صافية كما كانت { إنّ الله كان عفوّاً } يعفو عن تلك الهيئات المظلمة ورسوخ تلك الملكات الحاجبة بتركها والإعراض عنها\n فيزيلها بالكلية فيصفو استعدادكم وتستعدّوا للقائه ومناجاته { غَفُوراً } يستر صفاتكم وذواتكم بصفاته وذاته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n سيما عند التوجه نحو الحق فعليكم أن { لاَ تَقْرَبُواْ } ولا تتوجهوا { ٱلصَّلَٰوةَ } أي: لأداء الصلاة\n هي عبارةعن التوجه نحو الذات الإلهية بجميع الأعضاء والجوارج\n المقارن بالخضوع والخشوع\n المنبئ عن الاعتراف بالعبودية والإذلال\n المشعر عن المعجز والتقصير\n فلا بد لأدائها من فراغ الهم وخلاء الخاطر عن أدناس الطبيعة مطلقاً { وَ } خصوصاً { أَنْتُمْ } في أدائها { سُكَٰرَىٰ } لا تعلمون ما تفعلون وما تقرأون بل اصبروا { حَتَّىٰ } تفيقوا { تَعْلَمُواْ مَا تَقُولُونَ } وما تفعلون في أدائها من محافظة الأركان والأبعاض والأركان والهيئات وغير ذلك\n\n\n{ وَ } عليكم أيضاً أن { لاَ } تقربوا الصلاة { جُنُباً } حالة كونكم مجنبين بأي طريق كان\n إذ استفراغ المني إنما هو من استيلاء القوة الشهوية التي هي أقوى القوى الحيوانية وأبعدها عن مرتبة الإيمان والتوحيد\n وحين استيلائها تسري خباثتها إلى جميع الأعضاء الحاملة للقوى الدراكة وتعطلها عن مقتضياتها بالمرة\n فحينئذ تتحير الأمزجة وتضطرب لانحرافها عن اعتدال الفطرة الأصلية بعروض الخباثة السارية\n فتكون الخباثة أيضاً كالسكر من مخللات العقل\n فعليكم ألاَّ تقربوها معه { إِلاَّ } إذا كنتم { عَابِرِي سَبِيلٍ } أي: على متن سفر ليس لكم قدرة استعمال الماء\n لفقده أو لوجود المانع\n فعليكم أن تتيمووا وتصلوا جنباً { حَتَّىٰ تَغْتَسِلُواْ } وتتمكنوا من استعماله\n\n\n{ وَ } كذا { إِنْ كُنْتُمْ } مقيمين { مَّرْضَىٰ } تخافون من شدة المرض في استعماله { أَوْ } راكبين { عَلَىٰ } متن { سَفَرٍ أَوْ جَآءَ أَحَدٌ مِّنْكُمْ مِّن ٱلْغَآئِطِ } أي: من الخلاء محدثين { أَوْ لَٰمَسْتُمُ ٱلنِّسَآءَ } أي: جامعتم معهن أو لعبتم بهن بالملامسة والمساس { فَلَمْ تَجِدُواْ } في هذه الصورة { مَآءً } لإزالة ما عرض عليكم من الجنابة { فَتَيَمَّمُواْ صَعِيداً طَيِّباً } أي: فعليكم أن تقصدوا عند عروض هذه الحالات بالتراب الطيب من صعيد الأرض بأن تضربوا أيديكم عليها\n وبعدها ضربتم { فَٱمْسَحُواْ } باليدين المغبرتين { بِوُجُوهِكُمْ } مقدار ما يغسل { وَأَيْدِيكُمْ } أيضاً كذلك\n جبراً لما فوتم من الغسل بالماء\n إذ التراب من المطهرات خصوصاً من الصعيد المرتفع { إِنَّ ٱللَّهَ } المصلح لأحوالكم { كَانَ عَفُوّاً } لكم مجاوزاً عن أمثاله { غَفُوراً } [النساء: 43] يستر عنكم ولا يؤاخذكم عليها إن كنتم مضطرين فيها\n بل يجازيكم خيراً تفضلاً وامتناناً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: جملة { وأنتم سكارى }: حال، وسكارى: جمع سكران، ويجمع على سُكارى بالفتح وسكْرى بالسكون، و { لا جُنُبًا } عطف على جملة الحال، و { جُنب } يستوي فيه الواحد والاثنان والجماعة والمذكر والمؤنث، لأنه يجري مجرى المصدر فلا يُثنى ولا يُجمع. و { إلا عابري } مستثنى من عام الأحوال، وأصل الغائط: الموضع المنخفض من الأرض، ثم أطلق على الواقع فيه مما يخرج من الإنسان. يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا لا تقربوا الصلاة وأنتم سكارى }: لا تقوموا إليها وأنتم سكارى من خمر، أو غلبة نوم، أو شدة غفلة، { حتى تعلموا ما تقولون } في صلاتكم، وتتدبروا ما تقرأون فيها، فالصلاة من غير حضور خاوية، وعند الخصوص باطلة، رُوِي أن عبد الرحمن بن عَوف صنَع مأدبة، ودَعَا إليها نفرًا من الصحابة، حين كانت الخمر مباحة، فأكلوا وشربوا حتى ثَمِلُوا، وجاء وقت صلاة المغرب، فتقدم أحدهم ليصلي بهم، فقرأ: أعبد ما تعبدون ـ من غير نفي ـ فنزلت الآية قبل تحريم الخمر، ثم حرمت بآية المائدة. ولا تقربوها حالة جنابتكم في آي حال كان، { إلا عابري سبيل } أي: في وقت سفركم، حيث لم تجدوا ماءً، بدليل ما يأتي، فيتيمم ويقرب الصلاة وهو جنب، وفيه دليل أن التيمم لا يرفع الحدث، قيل المراد بالصلاة مواضعها، وهي المساجد فلا يدخلها الجنب إلا مارًا، وبه قال الشافعي ـ رضي الله عنه ـ وقال أبو حنيفة: لا يجوز المرور، إلاَّ إذا كان فيه الماء والطريق. وقال مالك: لا يدخل إلا بالتيمم ولا يمر به أصلاً. فلا تقربوا الصلاة وأنتم جنب { حتى تغتسلوا }. { وإن كنتم مرضى } تخافون ضرر الماء، أو زيادته، أو تأخر برء، أو منع الوصول إلى الماء، { أو على سفر } لم تجدوه فيه، { أو } كنتم في الحضر مُحدِثِين حيث { جاء أحد منكم من الغائط } ، أو البول، أو بغيره من الأحداث، { أو لامستم النساء } أي: مست بشرتكم بشرتهن، بقصد اللذة أو عند وجدانها، وبه قال مالك. وقال الشافعي: ينقض مطلقًا، قصد أم لا، وجد أم لا، ولو بميتة، وقال أبو حنيفة: إن كانت ملامسه فاحشة بحيث يحصل الانتشار نقضت، وإلا فلا. وقال ابن عباس والحسن البصري ومحمد بن الحسن: لا تنقض الملامسة مطلقًا، ويقاس على اللمس سائر نواقض الأسباب، فتحصَّل أن \" أو \" تبقى على أصلها من التقسيم، فتكون الآية نصًا في تيمم الحاضر الصحيح، وبه قال مالك، ولا يعيد. وقال الشافعي: يُصلي بالتيمم ويُعيد، وقال أبو حنيفة: لا يُصلي حتى يجد الماء، ومن قال: \" أو \" بمعنى الواو فخروج عن الأصل بلا داع. ثم قيّد التيمم في هذه الأحوال بفقد الماء، فقال: { فلم تجدوا ماء } كافيًا، أو لم تقدروا على استعماله، { فتيمموا } أي: اقصدوا { صعيداً طيبًا } أي: ظاهرًا، وهو ما صعد على وجه الأرض من جنسها كتراب، وهو الأفضل، وثلج وخضخاض وحجر ومدر، لا شجر وحشيش ومعدن ذهب وفضة، وما التحق بالعقاقير، كشب، وملح، وكبريت، وغاسول وشبهه، فلا يجوز.\nوقال أبو حنيفة: بكل شيء من الأرض وما اتصل بها كشجر وكُحل، وزنيخ، وشب ونورة، وجص، وجوهر، إلا منخالة الذهب والفضة والرصاص. وقال الشافعي: لا يجوز إلا بالتراب المنبت خاصة، وبه فسر الطيب، واشترط علوق التراب بيده، ولم يشترطه غيره. ثم علّم الكيفية فقال: { فامسحوا بوجوهكم وأيديكم }. قال مالك: اليد اسم للكف بدليل قطع السارق منه، فجعل المسح إلى المرفق سنة. وقال الشافعي: فرض، قياسًا على الوضوء، { إن الله كان عفوًّا غفورًا } فلذلك يسَّر عليكم ورخص لكم في التيمم. الإشاره: يا أيها الذين آمنوا لا تقربوا صلاة الحضرة القدسية، وأنتم سكارى بحب الدنيا الدنية، حتى يذهب عنكم سُكر حبها، وتعلموا ما تقولون في مناجاة خالقها، ولا جنبًا من جنابة الغفلة، إلا ما يمر بالخواطر على سبيل الندرة والقلة، حتى تغتسلوا بماء الغيب، الذي يحصل به طهارة الجنان، ويغيب المتطهر به عن رؤية الأكوان. وإليه أشار ابن العربي الحاتمي: كما في طبقات الشعراني، ونسبها غيرُه للجنيد ـ رضي الله عنهم أجمعين ـ وهو الأصح بقوله:\nأي: إن لم تقدر على الطهارة الأصلية وهي الغيبة عن الأحداث الكونية، فاقصد العبادة الحسية، وقَّدم الشريعة أو من قام بها من أهل التربية النبوية أمامك، بعد أن كان يطلبك من قبل أن تعرفه، وأجمع ظُهر الشريعة لعصر الحقيقة، فهذه صلاة العارفين، فإن كنت منهم فانضح بَرَّ ظاهرك بحقيقة باطنك، فما كمن في غيب السرائر ظهر في شهادة الظواهر. لهذا أشار تعالى بقوله: { وإن كنتم مرضى } بحب الهوى، { أو على سفر } في عجلة شغل الدنيا، أو جاء أحد منكم من غائط الحس، أو لامستم العلوم الرسمية، وانطبع صُورُ خيالها في قلوبكم، ولم تجدوا من يسقيكم ماء الغيب، وهي الخمرة الآزلية، فاقصدوا الأعمال الحسية، فلعلها توصلكم إلى الأعمال الباطنية، { إن الله كان عفوًا غفورًا } ، وفي الحِكَم: \" كيف يشرق قلبٌ صورُ الأكوان منطبعة في مرآته؟ أم كيف يرحل إلى الله وهو مكبل بشهواته، أم كيف يطمع أن يدخل حضرة الله وهو لم يتطهر من جنابة غفلاته؟ أم كيف يرجو أن يفهم دقائق الأسرار وهو لم يتب من هفواته؟ \".",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:6",
      "similarity": 0.7367608274078523
    },
    {
      "verse": "69:36",
      "similarity": 0.23384122642398858
    },
    {
      "verse": "38:42",
      "similarity": 0.18607148066032222
    },
    {
      "verse": "6:7",
      "similarity": 0.1644285415831347
    },
    {
      "verse": "15:15",
      "similarity": 0.1612131313000968
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004043.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004043.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:43.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}