{
  "chapter": "النساء",
  "text": "الم تر الى الذين اوتوا۟ نصيبا من الكتب يشترون الضللة ويريدون ان تضلوا۟ السبيل",
  "translations": [
    {
      "translation": "Do you not see those who were given a portion of the Book trading in misguidance and wanting you to be",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen the people who were given a share of the Book, but who purchased only error, and wish that you also go astray?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those to whom a portion of the Book was given? They purchased error for themselves, and wish that you too lose the right way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you seen those who had received a portion of the Book trade misguidance and try to make you, too, go astray?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see those who received a portion of the Book, that they purchase error and wish that you too go astray from the right path?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those (the Jews) who were given a portion of the Book, purchasing the wrong path, and wishing that you should go astray from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered those to whom a portion of the Book has been given? They buy error and desire that you should go astray from the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not regarded those who were given a share of the Book purchasing error, and desiring that you should also err from the way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seest thou not those unto whom a portion of the Scripture hath been given, how they purchase error, and seek to make you (Muslims) err from the right way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know of those who were in possession of a portion of the Book? They buy up error and want you to lose your way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Observest thou not those unto whom was vouchsafed a portion of the book purchasing error, and desiring that ye would err as regards the way!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded those who were given a share of the Book, who purchase error and desire that you [too] should lose the way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not turned Thy vision to those who were given a portion of the Book? they traffic in error, and wish that ye should lose the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who were given a portion of the book (the Jews), purchasing the wrong path, and wish that you should go astray from the Right Path?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those to whom a portion of the Book was given purchasing error and wishing that you should err from the Path?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered those who were given a share of the Book? They buy error, and wish you would lose the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who were given a portion of the Scripture, purchasing error [in exchange for it] and wishing you would lose the way?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:44] Have you not seen those who were given a share, a portion, of the Book, namely, the Jews, purchasing error, with guidance, and desiring that you should err from the way?, that you should stray from the path of truth and be like them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Seest thou not) have you not been informed in the Scripture about (those unto whom a portion of the Scripture hath been given) those who were given knowledge of the Torah, (how they purchase error?) they choose Judaism, (and seek to make you (Muslims) err from the right way) i.e. abandon Islam. This was revealed about al-Yasa' and Rafi' the sons of Harmalah, two Jewish Rabbis, who invited 'Abdullah Ibn Ubayy and his friends to embrace their religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ألَمْ تر إلى الذين أُوتُوا نَصِيباً منَ الكتاب } أي: بعضاً هو اعترافهم بالحق مع احتجابهم عن الدين { يَشْترونَ الضلالَة } يستبدلون الاحتجاب عن الدين الذي هو طريق الحق بنور هداية استعدادهم ويريدون بكم ذلك أيضاً وهم أعداؤكم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه مستفهماً مخاطباً لمن يتأتى منه الرؤية عن حرمان بعض المعاندين عن هداية القرآن: { أَلَمْ تَرَ } أيها الرائي { إِلَى } قبح صنيع القوم { ٱلَّذِينَ أُوتُواْ نَصِيباً } حظاً { مِّنَ ٱلْكِتَٰبِ } الجامع لجميع الكتب\n الهادي للكل لكونهم موجودين عند نزوله\n سامعين الدعوة\n فممن أنزل إليه صلى الله عليه وسلم كيف يحرمون أنفسهمم عن الهادية إلى حيث { يَشْتَرُونَ } يختارون لأنفسهم { ٱلضَّلَٰلَةَ } بدل هدايته { وَ } مع ذلك لا يقتصرون عليه بل { يُرِيدُونَ أَن تَضِلُّواْ } ترتدوا ويظلموا عليكم أيها المؤمنون { ٱلسَّبِيلَ } [النساء: 44] الواضح الموصل إلى زلال الهداية بإلقاء الشبه الزائفة في قلوب ضعفائكم\n وإظهار التكذيب وادعاء المخالفة بينك وبين الكتب المتقدمة\n\n\nولا تغتروا أيها المؤمنون بودادتهم وتلمقهم ولا تتخذوهم أولياء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:175",
      "similarity": 0.5087268037021163
    },
    {
      "verse": "3:23",
      "similarity": 0.47147364078176135
    },
    {
      "verse": "88:3",
      "similarity": 0.4463373579475826
    },
    {
      "verse": "3:177",
      "similarity": 0.4256888470675678
    },
    {
      "verse": "15:48",
      "similarity": 0.3933873326867882
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/4:44.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/4:44.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:44.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}