{
  "chapter": "النساء",
  "text": "من الذين هادوا۟ يحرفون الكلم عن مواضعه ويقولون سمعنا وعصينا واسمع غير مسمع ورعنا ليۢا بالسنتهم وطعنا فى الدين ولو انهم قالوا۟ سمعنا واطعنا واسمع وانظرنا لكان خيرا لهم واقوم ولكن لعنهم الله بكفرهم فلا يؤمنون الا قليلا",
  "translations": [
    {
      "translation": "Some of the Jews distort the true meaning of words, saying, 'We hear and disobey,' and 'Listen without listening,' and 'Ra'ina!' twisting them with their tongues, disparaging the deen. If they had said, 'We hear and we obey,' and 'Listen,' and, 'Undhurna!' that would have been better for them and more upright. But Allah has cursed them for their kufr. Very few of them have iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some among the Jews distort the words out of context and say (in place of the right words): \"We have heard and do not obey;\" and, \"hear without hearing,\" and \"listen to us,\" twisting their tongues and reviling the faith. But if they had said: \"We have heard and obey,\" and, \"hear and regard us,\" it would have been better for them and more appropriate. But God has disgraced them for their lack of belief; and so only a few of them believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among those who have become Jews there are some who alter the words from their context, and make a malicious play with their tongues and seek to revile the true faith. They say: 'We have heard and we disobey' (sami'na wa 'asayna), 'Do hear us, may you turn dumb' (isma' ghayr musma') and 'Hearken to us' (ra'ina). It would indeed have been better for them and more upright if they had said: 'We have heard and we obey' (sami'na wa ata'na) and: 'Do listen to us, and look at us (with kindness)' (wa isma' wa unzurna). But Allah has cursed them because of their disbelief. Scarcely do they believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some Jews take certain words out of context and by twisting their tongues to make a jest out of the true religion, say, \"We heard and (in our hearts) disobeyed. (Muhammad) ra`ina (be kind to us) but they intend thereby (the meaning in their own language): \"Listen! May God turn you deaf.\" They should have said, \"We heard and obeyed. (Muhammad) listen and consider our question.\" This would have been better for them and more righteous. God has condemned them for their disbelief, thus, no one, except a few among them, will have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the Jews interchange the words from their places and say, “We hear and disobey” – and they say “Hear- may you not be able to hear” – and they say “Raena (Be considerate towards us)” distorting it with their tongues and in order to slander religion; had they said, “We hear and we obey” and “Kindly listen to us, O dear Prophet,” and “Look mercifully upon us, O dear Prophet”, it would have been much better for them and more just – but Allah has cursed them for their disbelief; so they do not believe except a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among those who are Jews, there are some who displace words from (their) right places and say: \"We hear your word and disobey,\" and \"Hear and let you hear nothing.\" And Ra`ina with a twist of their tongues and as a mockery of the religion. And if only they had said: \"We hear and obey\", and \"Do make us understand,\" it would have been better for them, and more proper; but Allah has cursed them for their disbelief, so they believe not except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of those who are Jews (there are those who) alter words from their places and say: We have heard and we disobey and: Hear, may you not be made to hear! and: Raina, distorting (the word) with their tongues and taunting about religion; and if they had said (instead): We have heard and we obey, and hearken, and unzurna it would have been better for them and more upright; but Allah has cursed them on account of their unbelief, so they do not believe but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the Jews pervert words from their meanings saying, 'We have heard and we disobey' and 'Hear, and be thou not given to hear' and 'Observe us,' twisting with their tongues and traducing religion. If they had said, 'We have heard and obey' and 'Hear' and 'Regard us,' it would have been better for them, and more upright; but God has cursed them for their unbelief so they believe not except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of those who are Jews change words from their context and say: \"We hear and disobey; hear thou as one who heareth not\" and \"Listen to us!\" distorting with their tongues and slandering religion. If they had said: \"We hear and we obey: hear thou, and look at us\" it had been better for them, and more upright. But Allah hath cursed them for their disbelief, so they believe not, save a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some Jews take words out of their context and say, \"We have heard, but we disobey,\" or \"Hear without listening.\" And they say \"Look at us,\" twisting the phrase with their tongues so as to disparage religion. But if they had said, \"We hear and we obey,\" and \"Listen to us and look at us with favour,\" that would have been better and more proper for them. God has rejected them for their defiance so that they shall not believe, except a few of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of those who are Judaised, are they who pervert Words from their meanings and say: We hear and we disobey, and: hear thou without being made to hear, and RA'INA, twisting their tongues and scoffing at the faith! And had they said: we hear and obey, and: hear thou, and: UNZURNA, it had surely been better for them and more upright. But Allah hath cursed them for their infidelity, wherefore they shall not believe, save a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the Jews are those who pervert words from their meanings and say, ‘We hear and disobey’ and ‘Hear without listening!’ and ‘Ra’ina,’ twisting their tongues and reviling the faith. But had they said, ‘We hear and obey’ and ‘Listen’ and ‘Unzurna,’ it would have been better for them and more upright. But Allah has cursed them for their faithlessness, so they will not believe except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of the Jews there are those who displace words from their (right) places, and say: \"We hear and we disobey\"; and \"Hear what is not Heard\"; and \"Ra'ina\"; with a twist of their tongues and a slander to Faith. If only they had said: \"What hear and we obey\"; and \"Do hear\"; and \"Do look at us\"; it would have been better for them, and more proper; but Allah hath cursed them for their Unbelief; and but few of them will believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among those who are Jews, there are some who displace words from (their) right places and say: \"We hear your word (O Muhammad SAW) and disobey,\" and \"Hear and let you (O Muhammad SAW) hear nothing.\" And Ra'ina with a twist of their tongues and as a mockery of the religion (Islam). And if only they had said: \"We hear and obey\", and \"Do make us understand,\" it would have been better for them, and more proper, but Allah has cursed them for their disbelief, so they believe not except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some Jews tampered with the words (altering) their places saying: 'We have heard and we disobey' and 'Hear, without hearing' and 'Observe us (Ra'ina, in Hebrew means evil) ', twisting with their tongues traducing religion. But if they had said: 'We have heard and obey' and 'Hear' and 'Regard us' it would have been better for them, and more upright; but Allah has cursed them for their disbelief, so they do not believe, except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the Jews are some who take words out of context, and say, “We hear and we disobey”, and “Hear without listening”, and “Observe us,” twisting with their tongues and slandering the religion. Had they said, “We hear and we obey”, and “Listen”, and “Give us your attention,” it would have been better for them, and more upright. But God has cursed them for their disbelief; they do not believe except a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the Jews are those who distort words from their [proper] usages and say, \"We hear and disobey\" and \"Hear but be not heard\" and \"Ra'ina,\" twisting their tongues and defaming the religion. And if they had said [instead], \"We hear and obey\" and \"Wait for us [to understand],\" it would have been better for them and more suitable. But Allah has cursed them for their disbelief, so they believe not, except for a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:46] Some, group, from among the Jews distort, alter, the words, that God revealed in the Torah pertaining to the descriptions of Muhammad (s), from their contexts, those [contexts] in which they were placed, and they say, to the Prophet (s), when he commands them something, ‘We have heard, your words, and we disobey, your command; and hear as one who does not hear’ (wa’sma‘ ghayr musma‘in is a circumstantial qualifier, functioning as an invocation, in other words, ‘And may you not hear!’) and, they say to him, ‘Mind us’ (rā‘inā), [a term] with which it had been forbidden to address him, being a curse word in their language; twisting, distorting, with their tongues and slandering, defaming, religion, Islam. If they had said, ‘We have   heard and obey’, instead of ‘And we disobey’, and, only, ‘Hear’, and ‘Consider us,’ (unzur ilaynā) instead of rā‘inā, it would have been better for them, than what they said, and more upright, more just than that, but God has cursed them, removing them from His mercy, for their unbelief, so they believe not except a few, among them, such as ‘Abd Allāh b. Salām and his companions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Some of those who are Jews) Malik Ibn al-Sayf and his friends (change words from their context) they change the traits and description of Muhammad after these were exposited upon in the Torah, and then come to Muhammad (and say: \"We hear) your words, Muhammad (and disobey) your command, when he is not around them; and we (hear thou) Muhammad (as one who heareth not\" and \"Listen to us!\" distorting with their tongues and slandering religion. If they had said: \"We hear) your saying, Muhammad (and we obey) your command; (hear you) hear from us, (and look at us\" it had been better for them) than their insults and defamation, (and more upright) and more correct. (But Allah hath cursed them) punishes them by making them pay the capitation tax (for their disbelief) as a punishment for their disbelief, (so they believe not, save a few) among them who have accepted Islam such as 'Abdullah Ibn Salam and his friends.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُحَرِّفُونَ ٱلْكَلِمَ } معناهُ يُقلِّبونَ ويُغَيِّرونَ الكلمَ والكَلمُ جَماعَةُ كَلِمةٍ\n\n\n\n\nوقوله تعالى: { سَمِعْنَا وَعَصَيْنَا } معناهُ سَمِعْنَا قَولَكَ، وَعَصَينَا أَمْرَكَ\n { وَٱسْمَعْ غَيْرَ مُسْمَعٍ } معناه غَيرُ مَقْبُولٍ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High: {They change the word} its meaning is that they change and alter the word, and the word is a group of words.\n\n\nAnd His saying, \"We have heard and disobeyed\" - we have heard your command and disobeyed it.\n\n\nAnd listen to that which is not heard - meaning that which is not acceptable.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مِّنَ ٱلَّذِينَ هَادُواْ } نسبوا إلى اليهودية وسموا به\n وهم من غاية بغضهم مع الرسول صلى الله عليه وسلم يدعون مخالفة القرآن بجميع الكتب السالفة\n لذلك { يُحَرِّفُونَ } ويغيرون { ٱلْكَلِمَ } المنزلة في التوراة في شأن القرآن وشأن بعثة سيدنا محمد صلى الله عليه وسلم { عَن مَّوَاضِعِهِ } التي وضعها الحق سبحانه\n بل يستبدلونها لفظاً ومعنى مراء ومجادلة { وَيَقُولُونَ } حين دعاهم الرسول إلى الإيمان: { سَمِعْنَا } قولك { وَعَصَيْنَا } أمرك { وَٱسْمَعْ } منا في أمرن الدين كلاماً { غَيْرَ مُسْمَعٍ } لك من أحد { وَرَٰعِنَا } لتستفيد منا\n وإنما يقصدون بأمثال هذه المزخرفات الباطلة { لَيّاً } إعراضاً وصرفاً للمؤمنين { بِأَلْسِنَتِهِمْ } عما توجهوا نحوه من التوحيد الإيمان إلى ما تشتهيه نفوسهم\n\n\n{ وَ } يريدون أن توقعوا بها { طَعْناً فِي ٱلدِّينِ } القويم والشرع المستقيم { وَلَوْ أَنَّهُمْ } من أهل الهداية ولهم نصيب منها { قَالُواْ } حين دعاهم الرسول صلى الله عليه وسلم إلى الإسلام: { سَمِعْنَا } قولك { وَأَطَعْنَا } أمرك { وَٱسْمَعْ } من ربك من الأحكمام\n واسمع إيانا { وَٱنْظُرْنَا } بنظر الشفقة والمرحمة حتى نسترشد منك ونستهدي { لَكَانَ خَيْراً لَّهُمْ } في أولاهم وأخراهم { وَأَقْوَمَ } أي: أعدل سبيلاً إلى التوحيد والإيمان { وَلَكِن لَّعَنَهُمُ ٱللَّهُ } أي: طردهم عن عز حضوره في سابق علمه { بِكُفْرِهِمْ } المركوز في جبلتهم { فَلاَ يُؤْمِنُونَ } منهم { إِلاَّ قَلِيلاً } [النساء: 46] استثناهم الله سبحانه في سابق علمه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:12",
      "similarity": 0.5077575233025575
    },
    {
      "verse": "3:78",
      "similarity": 0.3166428608869522
    },
    {
      "verse": "5:41",
      "similarity": 0.28784443051439845
    },
    {
      "verse": "63:5",
      "similarity": 0.2556386667403938
    },
    {
      "verse": "2:75",
      "similarity": 0.24261548456258358
    }
  ]
}