{
  "chapter": "النساء",
  "text": "من الذين هادوا۟ يحرفون الكلم عن مواضعه ويقولون سمعنا وعصينا واسمع غير مسمع ورعنا ليۢا بالسنتهم وطعنا فى الدين ولو انهم قالوا۟ سمعنا واطعنا واسمع وانظرنا لكان خيرا لهم واقوم ولكن لعنهم الله بكفرهم فلا يؤمنون الا قليلا",
  "translations": [
    {
      "translation": "Some of the Jews distort the true meaning of words, saying, 'We hear and disobey,' and 'Listen without listening,' and 'Ra'ina!' twisting them with their tongues, disparaging the deen. If they had said, 'We hear and we obey,' and 'Listen,' and, 'Undhurna!' that would have been better for them and more upright. But Allah has cursed them for their kufr. Very few of them have iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some among the Jews distort the words out of context and say (in place of the right words): \"We have heard and do not obey;\" and, \"hear without hearing,\" and \"listen to us,\" twisting their tongues and reviling the faith. But if they had said: \"We have heard and obey,\" and, \"hear and regard us,\" it would have been better for them and more appropriate. But God has disgraced them for their lack of belief; and so only a few of them believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among those who have become Jews there are some who alter the words from their context, and make a malicious play with their tongues and seek to revile the true faith. They say: 'We have heard and we disobey' (sami'na wa 'asayna), 'Do hear us, may you turn dumb' (isma' ghayr musma') and 'Hearken to us' (ra'ina). It would indeed have been better for them and more upright if they had said: 'We have heard and we obey' (sami'na wa ata'na) and: 'Do listen to us, and look at us (with kindness)' (wa isma' wa unzurna). But Allah has cursed them because of their disbelief. Scarcely do they believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some Jews take certain words out of context and by twisting their tongues to make a jest out of the true religion, say, \"We heard and (in our hearts) disobeyed. (Muhammad) ra`ina (be kind to us) but they intend thereby (the meaning in their own language): \"Listen! May God turn you deaf.\" They should have said, \"We heard and obeyed. (Muhammad) listen and consider our question.\" This would have been better for them and more righteous. God has condemned them for their disbelief, thus, no one, except a few among them, will have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the Jews interchange the words from their places and say, “We hear and disobey” – and they say “Hear- may you not be able to hear” – and they say “Raena (Be considerate towards us)” distorting it with their tongues and in order to slander religion; had they said, “We hear and we obey” and “Kindly listen to us, O dear Prophet,” and “Look mercifully upon us, O dear Prophet”, it would have been much better for them and more just – but Allah has cursed them for their disbelief; so they do not believe except a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among those who are Jews, there are some who displace words from (their) right places and say: \"We hear your word and disobey,\" and \"Hear and let you hear nothing.\" And Ra`ina with a twist of their tongues and as a mockery of the religion. And if only they had said: \"We hear and obey\", and \"Do make us understand,\" it would have been better for them, and more proper; but Allah has cursed them for their disbelief, so they believe not except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of those who are Jews (there are those who) alter words from their places and say: We have heard and we disobey and: Hear, may you not be made to hear! and: Raina, distorting (the word) with their tongues and taunting about religion; and if they had said (instead): We have heard and we obey, and hearken, and unzurna it would have been better for them and more upright; but Allah has cursed them on account of their unbelief, so they do not believe but a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the Jews pervert words from their meanings saying, 'We have heard and we disobey' and 'Hear, and be thou not given to hear' and 'Observe us,' twisting with their tongues and traducing religion. If they had said, 'We have heard and obey' and 'Hear' and 'Regard us,' it would have been better for them, and more upright; but God has cursed them for their unbelief so they believe not except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of those who are Jews change words from their context and say: \"We hear and disobey; hear thou as one who heareth not\" and \"Listen to us!\" distorting with their tongues and slandering religion. If they had said: \"We hear and we obey: hear thou, and look at us\" it had been better for them, and more upright. But Allah hath cursed them for their disbelief, so they believe not, save a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some Jews take words out of their context and say, \"We have heard, but we disobey,\" or \"Hear without listening.\" And they say \"Look at us,\" twisting the phrase with their tongues so as to disparage religion. But if they had said, \"We hear and we obey,\" and \"Listen to us and look at us with favour,\" that would have been better and more proper for them. God has rejected them for their defiance so that they shall not believe, except a few of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of those who are Judaised, are they who pervert Words from their meanings and say: We hear and we disobey, and: hear thou without being made to hear, and RA'INA, twisting their tongues and scoffing at the faith! And had they said: we hear and obey, and: hear thou, and: UNZURNA, it had surely been better for them and more upright. But Allah hath cursed them for their infidelity, wherefore they shall not believe, save a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the Jews are those who pervert words from their meanings and say, ‘We hear and disobey’ and ‘Hear without listening!’ and ‘Ra’ina,’ twisting their tongues and reviling the faith. But had they said, ‘We hear and obey’ and ‘Listen’ and ‘Unzurna,’ it would have been better for them and more upright. But Allah has cursed them for their faithlessness, so they will not believe except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of the Jews there are those who displace words from their (right) places, and say: \"We hear and we disobey\"; and \"Hear what is not Heard\"; and \"Ra'ina\"; with a twist of their tongues and a slander to Faith. If only they had said: \"What hear and we obey\"; and \"Do hear\"; and \"Do look at us\"; it would have been better for them, and more proper; but Allah hath cursed them for their Unbelief; and but few of them will believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among those who are Jews, there are some who displace words from (their) right places and say: \"We hear your word (O Muhammad SAW) and disobey,\" and \"Hear and let you (O Muhammad SAW) hear nothing.\" And Ra'ina with a twist of their tongues and as a mockery of the religion (Islam). And if only they had said: \"We hear and obey\", and \"Do make us understand,\" it would have been better for them, and more proper, but Allah has cursed them for their disbelief, so they believe not except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some Jews tampered with the words (altering) their places saying: 'We have heard and we disobey' and 'Hear, without hearing' and 'Observe us (Ra'ina, in Hebrew means evil) ', twisting with their tongues traducing religion. But if they had said: 'We have heard and obey' and 'Hear' and 'Regard us' it would have been better for them, and more upright; but Allah has cursed them for their disbelief, so they do not believe, except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the Jews are some who take words out of context, and say, “We hear and we disobey”, and “Hear without listening”, and “Observe us,” twisting with their tongues and slandering the religion. Had they said, “We hear and we obey”, and “Listen”, and “Give us your attention,” it would have been better for them, and more upright. But God has cursed them for their disbelief; they do not believe except a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the Jews are those who distort words from their [proper] usages and say, \"We hear and disobey\" and \"Hear but be not heard\" and \"Ra'ina,\" twisting their tongues and defaming the religion. And if they had said [instead], \"We hear and obey\" and \"Wait for us [to understand],\" it would have been better for them and more suitable. But Allah has cursed them for their disbelief, so they believe not, except for a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:46] Some, group, from among the Jews distort, alter, the words, that God revealed in the Torah pertaining to the descriptions of Muhammad (s), from their contexts, those [contexts] in which they were placed, and they say, to the Prophet (s), when he commands them something, ‘We have heard, your words, and we disobey, your command; and hear as one who does not hear’ (wa’sma‘ ghayr musma‘in is a circumstantial qualifier, functioning as an invocation, in other words, ‘And may you not hear!’) and, they say to him, ‘Mind us’ (rā‘inā), [a term] with which it had been forbidden to address him, being a curse word in their language; twisting, distorting, with their tongues and slandering, defaming, religion, Islam. If they had said, ‘We have   heard and obey’, instead of ‘And we disobey’, and, only, ‘Hear’, and ‘Consider us,’ (unzur ilaynā) instead of rā‘inā, it would have been better for them, than what they said, and more upright, more just than that, but God has cursed them, removing them from His mercy, for their unbelief, so they believe not except a few, among them, such as ‘Abd Allāh b. Salām and his companions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيجوز أن يكون هذا كلاماً مستأنفاً .و { مِنْ } تبعيضية ، وهي خبر لمبتدإ محذوف دلّت عليه صفته وهي جملة { يحرّفون } والتقدير : قوم يحرّفون الكلَم .وحَذْفُ المبتدإ في مثل هذا شائع في كلام العرب اجتزاء بالصفة عن الموصوف وذلك إذا كان المبتدأ موصوفاً بجملة أوْ ظرف ، وكان بعضَ اسم مجرور بحرف { من } ، وذلك الاسم مقدّم على المبتدإ . ومن كلمات العرب المأثورة قولهم : «مِنَّا ظعنَ ومنّا أقام» أي منّا فريق ظعن ومنّا فريق أقام . ومنه قول ذي الرمّة :فظَلّوا ومنهم دَمْعُهُ غالبٌ له ... وآخرُ يذري دمْعة العين بالهَمْلأي ومنهم فريق ، بدليل قوله في العطف وآخر . وقولُ تميم بن مُقْبِل :ومَا الدَّهْر إلاّ تَارتان فمنهمَا ... أمُوتُ وأخْرى أبتغي العَيشَ أكْدَحوقد دلّ ضمير الجمع في قوله { يحرّفون } أنّ هذا صنيع فريق منهم ، وقد قيل : إنّ المراد به رفاعة بن زيد بن التَّابوت من اليهود ، ولعلّ قائل هذا يعني أنّه من جملة هؤلاء الفريق ، إذ لا يجوز أن يكون المراد واحداً ويؤتى بضمير الجماعة ، وليس المقام مقام إخفاء حتّى يكون على حدّ قوله عليه السلام : \" ما بال أقوام يشترطون \" الخ .ويجوز أن يكون { من الذين هاوا } صفة للذين أوتوا نصيباً من الكتاب ، وتكون { مِن } بيانيّة أي هم الذين هادوا ، فَتكون جملة { يحرّفون } حالاً من قوله : { الذين هادوا } . وعلى الوجهين فقد أثبتت لهم أوصاف التحريف والضلالة ومحبّة ضلال المسلمين . والتحريف : الميل بالشيء إلى الحرف وهو جانب الشيء وحافته ، وسيأتي عند قوله تعالى : { يحرقون الكلم عن مواضعه } في سورة المائدة ( 13 ) ، وهو هنا مستعمل في الميل عن سواء المعنى وصريحه إلى التأويل الباطل ، كما يقال : تنكَّب عن الصراط ، وعن الطريق ، إذا أخطأ الصواب وصار إلى سوء الفهم أو التضليل ، فهو على هذا تحريفُ مراد الله في التوراة إلى تأويلات باطلة ، كما يفعل أهل الأهواء في تحريف معاني القرآن بالتأويلات الفاسدة . ويجوز أن يكون التحريف مشقّاً من الحرف وهو الكلمة والكتابة ، فيكون مراداً به تغيير كلمات التوراة وتبديلها بكلمات أخرى لتُوافِق أهواء أهل الشهوات في تأييد ما هم عليه من فاسد الأعمال . والظاهر أنّ كلا الأمرين قد ارتكبه اليهود في كتابهم . وما ينقل عن ابن عبّاس أنّ التحريف فساد التأويل ولا يعمد قوم على تغيير كتابهم ، ناظرٌ إلى غالب أحوالهم ، فعلى الاحتمال الأول يَكون استعمال عن } في قوله : { عن مواضعه } مجازاً ، ولا مجاوزة ولا مواضِعَ ، وعلى الثاني يكون حقيقة إذ التحريف حينئذٍ نقل وإزالة .وقوله : { ويقولون } عطف على { يحرّفون } ذُكر سوء أفعالهم وسوء أقوالهم ، وهي أقوالهم التي يواجهون بها الرسول عليه الصلاة والسلام : يقولون سمِعْنا دعوتَك وعصيناك ، وذلك إظهار لتمسّكهم بدينهم ليزول طمع الرسول في إيمانهم ، ولذلك لم يَرَوا في قولهم هذا أذى للرسول فأعقبوه بقولهم له : { واسمع غير مسمع } إظهار للتأدب معه .ومعنى { اسمع غير مُسمع } أنّهم يقولون للرسول صلى الله عليه وسلم عند مراجعته في أمر الإسلام : اسمع منّا ، ويعقّبون ذلك بقولهم : { غير مسمع } يوهمون أنّهم قصدوا الظاهر المتبادر من قولهم : غير مُسمع ، أي غير مأمور بأن تسمع ، في معنى قول العرب : ( افعَلْ غيرَ مَأمُور ) . وقيل معناه : غير مُسْمَع مَكروهاً ، فلعلّ العرب كانوا يقولون : أسْمَعَه بمعنى سَبَّه . والحاصل أنّ هذه الكلمة كانت معروفة الإطلاق بين العرب في معنى الكرامة والتلطّف . إطلاقاً متعارفاً ، ولكنّهم لمّا قالوها للرسول أرادوا بها معنى آخر انتحلوه لها من شيء يسمَح به تركيبها الوضعي ، أي أن لا يسمع صوتاً من متكلّم . لأن يصير أصمّ ، أو أن لا يُستجاب دعاؤه . والذي دلّ على أنّهم أرادوا ذلك قوله بعد : { ولو أنهم قالوا } إلى قوله : { اسمع وانظرنا } فأزال لهم كلمة ( غير مسمع ) . وقصدُهم من إيراد كلام ذي وجهين أن يُرضوا الرسول والمؤمنين ويُرضوا أنفسهم بسوء نيتهم مع الرسول عليه السلام ويرضوا قومهم ، فلا يجدوا عليهم حجّة .وقولهم : { وراعنا } أتوا بلفظ ظاهره طلب المُراعاة ، أي الرفق ، والمراعاة مفاعلة مستعملة في المبالغة في الرعي على وجه الكناية الشائعة التي ساوت الأصل ، ذلك لأنّ الرعي من لوازمه الرفقُ بالمرعِيّ ، وطلب الخصب له ، ودفع العادية عنه . وهم يريدون ب { راعنا } كلمة في العبرانية تدلّ على ما تدلّ عليه كلمة الرعونة في العَربية ، وقد روي أنّها كلمة { رَاعُونا } وأنّ معناها الرعونة فلعلّهم كانوا يأتون بها ، يوهمون أنّهم يعظّمون النبي صلى الله عليه وسلم بضمير الجماعة ، ويدلّ لذلك أنّ الله نهى المسلمين عن متابعتهم إيّاهم في ذلك اغتراراً فقال في سورة البقرة ( 104 ) : { يأيها الذين آمنوا لا تَقولوا رَاعنا وقولوا انظُرْنا } واللَّيُّ أصله الانعطاف والانثناء ، ومنه ولا تَلْوُون على أحد } ، وهو يحتمل الحقيقة في كلتا الكلمتين : اللّي ، والألسنة ، أي أنّهم يثنون ألسنتهم ليكون الكلام مشبهاً لغتين بأن يشبعوا حركات ، أو يقصروا مُشْبَعات ، أو يفخّموا مرقّقا ، أو يرقّقوا مفخما ، ليعطي اللفظ في السمع صورة تشبِه صورة كلمة أخرى ، فإنّه قد تخرج كلمة من زنة إلى زنة ، ومن لغة إلى لغة بمثل هذا . ويحتمل أن يراد بلفظ ( الليّ ) مجازُه ، وب ( الألسنة ) مجازه : فالليّ بمعنى تغيير الكلمة ، والألسنة مجاز على الكلام ، أي يأتون في كلامهم بما هو غير متمحّض لمعنى الخير .وانتصب «ليّاً» على المفعول المطلق ل { يقولون } ، لأنّ الليّ كيفية من كيفيات القَول .وانتصب { طعناً في الدين } على المفعول لأجله ، فهو من عطف بعض المفاعيل على بعض آخر ، ولا ضير فيه ، ولك أن تجعلهما معاً مفعولين مطلقين أو مفعولين لأجلهما ، وإنما كان قولهم ( طعناً في الدين ) ، لأنّهم أضمروا في كلامهم قصداً خبيثاً فكانوا يقولون لإخوانهم ، ومن يليهم من حديثي العهد بالإيمان : لو كان محمّد رسولاً لعلم ما أردنا بقولنا ، فلذلك فضحهم الله بهذه الآية ونظائرها .وقوله : { ولو أنهم قالوا سمعنا وأطعنا } أي لو قالوا ما هو قبول للإسلام لكان خيراً . وقوله : { سمعنا وأطعنا } يشبه أنّه ممّا جرى مجرى المثل بقول من أمر بشيء وامتثله «سَمّعٌ وطاعة» ، أي شأني سمع وطاعة ، وهو ممّا التزم فيه حذف المبتدإ لأنّه جرى مجرى المثل ، وسيجيء في سورة النور ( 51 ) قولُه تعالى : { إنّما كان قولَ المؤمنين إذا دعوا إلى الله ورسوله ليحكم بينهم أن يقولوا سمعنا وأطعنا } وقوله : وأقوم تفضيل مشتقّ من القيام الذي هو بمعنى الوضوح والظهور ، كقولهم : قام الدليلُ على كذا ، وقامت حجّة فلان . وإنّما كان أقومَ لأنّه دالّ على معنى لا احتمال فيه ، بخلاف قولهم .والاستدراك في قوله : { ولكن لعنهم الله بكفرهم } ناشىء عن قوله : { لكان خيراً لهم } ، أي ولكن أثر اللَّعْنَة حاق بهم فحرموا ما هو خير فلا ترشَحُ نفوسهم إلاّ بآثار ما هو كمين فيها من فعل سيّىءٍ وقول بَذَاءٍ لا يستطيعون صرف أنفسهم عن ذلك .ومعنى { فلا يؤمنون إلا قليلاً } أنهم لا يؤمنون أبداً فهو من تأكيد الشيء بما يشبه ضدّه ، وأطلق القلّة على العدم . وفسّر به قول تَأبّط شرّاً :قليلُ التشكّي للمُهِمّ يصيبُه ... كثيرُ الهَوى شَتَّى النَّوَى والمَسالكقال الجاحظ في «كتاب البيان» عند قول عون بن عبد الله بن عتبة بن مسعود يصف أرض نصيبين «كثيرة العقارب قليلة الأقارب» ، يضعون ( قليلاً ) في موضع ( ليس ) ، كقولهم : فلان قليل الحياء . ليس مرادهم أن هناك حياء وإن قَلَّ» . قلت : ومنه قول العرب : قَلَّ رجل يقولُ ذلك ، يريدون أنّه غير موجود . وقال صاحب «الكشاف» عند قوله تعالى : «أإله مع الله قليلاً ما تذكّرون» «والمعنى نفي التذكير . والقلّة مستعمل في معنى النفي» . وإنّما استعملت العرب القلّة عوضاً عن النفي لضرب من الاحتراز والاقتصاد ، فكأنَّ المتكلّم يخشى أن يُتلقّى عموم نفيه بالإنكار فيتنازل عنه إلى إثبات قليل وهو يريد النفي .\n\n",
      "translations": [
        {
          "translation": "(Some of those who are Jews) Malik Ibn al-Sayf and his friends (change words from their context) they change the traits and description of Muhammad after these were exposited upon in the Torah, and then come to Muhammad (and say: \"We hear) your words, Muhammad (and disobey) your command, when he is not around them; and we (hear thou) Muhammad (as one who heareth not\" and \"Listen to us!\" distorting with their tongues and slandering religion. If they had said: \"We hear) your saying, Muhammad (and we obey) your command; (hear you) hear from us, (and look at us\" it had been better for them) than their insults and defamation, (and more upright) and more correct. (But Allah hath cursed them) punishes them by making them pay the capitation tax (for their disbelief) as a punishment for their disbelief, (so they believe not, save a few) among them who have accepted Islam such as 'Abdullah Ibn Salam and his friends.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُحَرِّفُونَ ٱلْكَلِمَ } معناهُ يُقلِّبونَ ويُغَيِّرونَ الكلمَ والكَلمُ جَماعَةُ كَلِمةٍ\n\n\n\n\nوقوله تعالى: { سَمِعْنَا وَعَصَيْنَا } معناهُ سَمِعْنَا قَولَكَ، وَعَصَينَا أَمْرَكَ\n { وَٱسْمَعْ غَيْرَ مُسْمَعٍ } معناه غَيرُ مَقْبُولٍ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High: {They change the word} its meaning is that they change and alter the word, and the word is a group of words.\n\n\nAnd His saying, \"We have heard and disobeyed\" - we have heard your command and disobeyed it.\n\n\nAnd listen to that which is not heard - meaning that which is not acceptable.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مِّنَ ٱلَّذِينَ هَادُواْ } نسبوا إلى اليهودية وسموا به\n وهم من غاية بغضهم مع الرسول صلى الله عليه وسلم يدعون مخالفة القرآن بجميع الكتب السالفة\n لذلك { يُحَرِّفُونَ } ويغيرون { ٱلْكَلِمَ } المنزلة في التوراة في شأن القرآن وشأن بعثة سيدنا محمد صلى الله عليه وسلم { عَن مَّوَاضِعِهِ } التي وضعها الحق سبحانه\n بل يستبدلونها لفظاً ومعنى مراء ومجادلة { وَيَقُولُونَ } حين دعاهم الرسول إلى الإيمان: { سَمِعْنَا } قولك { وَعَصَيْنَا } أمرك { وَٱسْمَعْ } منا في أمرن الدين كلاماً { غَيْرَ مُسْمَعٍ } لك من أحد { وَرَٰعِنَا } لتستفيد منا\n وإنما يقصدون بأمثال هذه المزخرفات الباطلة { لَيّاً } إعراضاً وصرفاً للمؤمنين { بِأَلْسِنَتِهِمْ } عما توجهوا نحوه من التوحيد الإيمان إلى ما تشتهيه نفوسهم\n\n\n{ وَ } يريدون أن توقعوا بها { طَعْناً فِي ٱلدِّينِ } القويم والشرع المستقيم { وَلَوْ أَنَّهُمْ } من أهل الهداية ولهم نصيب منها { قَالُواْ } حين دعاهم الرسول صلى الله عليه وسلم إلى الإسلام: { سَمِعْنَا } قولك { وَأَطَعْنَا } أمرك { وَٱسْمَعْ } من ربك من الأحكمام\n واسمع إيانا { وَٱنْظُرْنَا } بنظر الشفقة والمرحمة حتى نسترشد منك ونستهدي { لَكَانَ خَيْراً لَّهُمْ } في أولاهم وأخراهم { وَأَقْوَمَ } أي: أعدل سبيلاً إلى التوحيد والإيمان { وَلَكِن لَّعَنَهُمُ ٱللَّهُ } أي: طردهم عن عز حضوره في سابق علمه { بِكُفْرِهِمْ } المركوز في جبلتهم { فَلاَ يُؤْمِنُونَ } منهم { إِلاَّ قَلِيلاً } [النساء: 46] استثناهم الله سبحانه في سابق علمه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { من الذين هادوا }: خبر عن محذوف، أي: منهم قوم يحرفون، أو بيان للذين قبله، أو متعلق بأعدائكم. يقول الحقّ جلّ جلاله: من اليهود قوم تمردوا في الكفر وهم أحبارهم، { يُحرّفون الكلم } وهو التوراة { عن مواضعه } أي: يميلونه عن مواضعه التي وضعه الله فيها، بإزالة لفظه أو تأويله. وقال ابن عباس: لا يقدر أحد أن يُحرّف كلام الله ولكن يفسرونه على غير وجهه، { ويقولون } لمن دعاهم إليه، وهو الرسول صلى الله عليه وسلم: { سمعنا } قولك، { وعصينا } أمرك، { واسمع } منا { غير مسمع } قولك، أي: لا نلتفت إليه، أو دعاء بالصمم: أي: لا سمعت، أو غير مسمع منا مكروهًا، نفاقًا، ويقولون له مكان انظرنا: { راعنا } قاصدين بذلك الشتم والسخرية، من الرعونة، وقد كان الصحابة يخاطبون به الرسول ـ عليه الصلاة والسلام ـ ومعناه: انظرنا. أو راعنا بقلبك، فوجد اليهود بها سبيلاً إلى الشتم، فنهاهم الله عن ذلك، وبقيت اليهود تقولها شتماً واستهزاءً { ليًّا بألسنتهم } ، أي: فَتلاً لها عن معناها، من الانتظار إلى ما قصدوا من رَميِه بالرُّعُونة، { وطعنًا في الدين } أي: استهزاء به، { ولو أنهم قالوا سمعنا وأطعنا } مكان سمعنا وعصينا، { واسمع } منا فقط، مكان: واسمع غير مسمع، { وانظرنا } مكان راعنا، { لَكَانَ } قولهم ذلك { خيرًا لهم وأقوم } وأعدل، { ولكن لعنهم الله } أي: طردهم وأبعدهم بسبب كفرهم، { فلا يؤمنون إلا } إيمانًا { قليلاً } لا يعبأ به وهو الإيمان بالبعض والكفر بالبعض من الآيات والرسل. والله تعالى أعلم. الإشارة: والله ما ربح من ربح، إلا بالأدب والتعظيم، وما خسر من خسر إلا من فقدهما. قال بعضهم: \" اجعل عملك ملحًا، وأدبك دقيقًا \". وآداب الظاهر عنوان آداب الباطن، ويظهر الأدب في حسن الخطاب، ورد الجواب، وفي حسن الأفعال، وظهور محاسن الخلال. والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:12",
      "similarity": 0.5077575233025575
    },
    {
      "verse": "3:78",
      "similarity": 0.3166428608869522
    },
    {
      "verse": "5:41",
      "similarity": 0.28784443051439845
    },
    {
      "verse": "63:5",
      "similarity": 0.2556386667403938
    },
    {
      "verse": "2:75",
      "similarity": 0.24261548456258358
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004046.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004046.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:46.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}