{
  "chapter": "النساء",
  "text": "يايها الذين اوتوا۟ الكتب ءامنوا۟ بما نزلنا مصدقا لما معكم من قبل ان نطمس وجوها فنردها على ادبارها او نلعنهم كما لعنا اصحب السبت وكان امر الله مفعولا",
  "translations": [
    {
      "translation": "You who have been given the Book! have iman in what We have sent down confirming what is with you, before We obliterate faces, turning them inside out, or We curse you as We cursed the Companions of the Sabbath. Allah's command is always carried out.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O people of the Book, believe in what We have revealed, which confirms what is already with you before We disfigure your visages and turn your faces about and curse you, as We did with those who had broken the Sabbath; and what God decrees comes to pass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have been granted the Book! Do believe in what We have (now) revealed, which confirms the revelation which you already possess. Do this before We alter countenances, turning them backwards, or lay a curse upon them as We cursed the Sabbath-men. Bear in mind that Allah's command is done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People of the Book, have faith in the Quran that We have revealed to confirm your Book, before certain faces are changed and turned back. We shall condemn them as We did the people of the Sabbath about whom God's decree had decisively been ordained.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People given the Book(s)! Believe in what We have sent down confirming the Book which you possess, before We transform some faces so turning them towards their backs, or curse them like We had cursed the people of Sabth; and (know that) the Allah’s command is always carried out!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have been given the Scripture (Jews and Christians)! Believe in what We have revealed confirming what is with you, before We efface faces and turn them backwards or curse them as We cursed the people of the Sabbath. And the commandment of Allah is always executed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have been given the Book! believe that which We have revealed, verifying what you have, before We alter faces then turn them on their backs, or curse them as We cursed the violaters of the Sabbath, and the command of Allah shall be executed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You who have been given the Book, believe in what We have sent down, confirming what is with you, before We obliterate faces, and turn them upon their backs, or curse them as We cursed the Sabbath-men, and God's command is done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye unto whom the Scripture hath been given! Believe in what We have revealed confirming that which ye possess, before We destroy countenances so as to confound them, or curse them as We cursed the Sabbath-breakers (of old time). The commandment of Allah is always executed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People of the Book, believe in what We have sent down, fulfilling [the predictions] that is with you, before We destroy [your sense of] direction, so as to confound or reject you, as We rejected those who broke the Sabbath: God's command is always carried out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who are vouchsafed the Book believe in that which We have sent down confirming that which is with you, ere We alter countenances and turn them into their hinder parts, or We might curse them even as We cursed the fellows of the Sabt; and Allah's command is ever fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who were given the Book! Believe in what We have sent down confirming what is with you, before We blot out the faces and turn them backwards, or curse them as We cursed the People of the Sabbath, and Allah’s command is bound to be fulfilled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye People of the Book! believe in what We have (now) revealed, confirming what was (already) with you, before We change the face and fame of some (of you) beyond all recognition, and turn them hindwards, or curse them as We cursed the Sabbath-breakers, for the decision of Allah Must be carried out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have been given the Scripture (Jews and Christians)! Believe in what We have revealed (to Muhammad SAW) confirming what is (already) with you, before We efface faces (by making them like the back of necks; without nose, mouth, eyes, etc.) and turn them hindwards, or curse them as We cursed the Sabbath-breakers. And the Commandment of Allah is always executed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You, to whom the Book was given, believe in that which We have sent down confirming that which you have, before We obliterate faces and turn them on their backs, or curse them as We cursed the people of the Sabbath. And the command of Allah is done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who were given the Book! Believe in what We sent down, confirming what you have, before We obliterate faces and turn them inside out, or curse them as We cursed the Sabbath-breakers. The command of God is always done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who were given the Scripture, believe in what We have sent down [to Muhammad], confirming that which is with you, before We obliterate faces and turn them toward their backs or curse them as We cursed the sabbath-breakers. And ever is the decree of Allah accomplished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:47] O you who have been given the Scripture, believe in what We have revealed, of the Qur’ān, confirming what is with you, of the Torah, before We obliterate faces, erasing the eyes, noses and eyebrows in them, and turn them inside out, and make them like the napes of the neck, a flat plate, or curse them, by transforming them into apes, as We cursed, [as] We transformed, those of the Sabbath, among them, and God’s command, His decree, is done: after this was revealed, ‘Abd Allāh b. Salām converted to Islam, and so it was said that this had been a conditional threat of punishment, so that when some of them converted to Islam, it [the threat] was lifted. It is also said that obliteration and transformation will take place before the rising of the Hour.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye unto whom the Scripture hath been given!) you to whom knowledge of the traits and description of Muhammad in the Torah has been given. (Believe in what We have revealed) the Qur'an (concerning that which) confirms what (ye possess) in terms of Allah's divine Oneness and the traits and description of Muhammad (pbuh) (before We destroy countenances) before We change your hearts (so as to confound them) so as to turn them away from the lights of guidance and transform their faces to the back of their heads, (or curse them) turn them into animals (as We cursed the Sab bath -breakers (of old time)) by turning them into apes. (And the commandment of Allah is always executed) after the revelation of this verse 'Abdullah Ibn Salam and his companions embraced Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِّن قَبْلِ أَن نَّطْمِسَ وُجُوهاً فَنَرُدَّهَا } معناهُ نُسَوّيها حتّى تَعودَ كأقْفَائِهمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {before We touch their faces and turn them} means that We will make them perfect so that they will return as they were.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ يا أيها الذين أوتُوا الكتاب } كتاب الاستعداد { آمنُوا } إيماناً حقيقياً عيانياً بإخراج ما في كتاب استعدادكم إلى الفعل من توحيد الذات { من قَبل أنْ نطمس وجُوهاً } بإزالة استعدادها ومحوه { فنردها على أدبارها } التي هي أسفل سافلي عالم الجسم الذي هو خلف كل عالم { أو نَلْعَنهم } نعذبهم بالمسخ كما مسخنا { أصحاب السبتِ }  { وكان أمر الله مفعولاً } أي: مقضياً إلى الأبد، لا يغيّره أحد ولا ينقضه.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم ناداهم سبحانه وأوعدهم رجاء أن يتبنهوا بقوله: { يَا أَيُّهَآ ٱلَّذِينَ أُوتُواْ ٱلْكِتَٰبَ } أي: التوراة { ءَامِنُواْ بِمَا } أي: بالكتاب الجامع الذي { نَزَّلْنَا } من غاية فضلنا وجودنا على محمد صلى الله عليه وسلم مع كونه { مُصَدِّقاً لِّمَا مَعَكُمْ } أي: لكتابكم { مِّن قَبْلِ أَن نَّطْمِسَ وُجُوهاً } أي: تمحو وتضمحل مراتب إنسانيتكم وإدراككم مطلقاً { فَنَرُدَّهَا عَلَىٰ أَدْبَارِهَآ } قهقرى إلى المراتب الأنزل الأرذل قبل وصولكم إلى مرتبة الكمال { أَوْ نَلْعَنَهُمْ } نطردهم عن ساحة عز الوجوب إلى مضيق الإمكان { كَمَا لَعَنَّآ } مسخنا { أَصْحَٰبَ ٱلسَّبْتِ } لمخالفتهم الأمر الوجوبي بافتراء الحيلة عن لوازم الإنسانية مطلقاً\n ورددناهم إلى أخس المراتب { وَ } لا تستبعدوا من الله القادر المقتدر على جميع ما يشاء أمثال هذا الطرد والإدبار\n إذ { كَانَ أَمْرُ ٱللَّهِ } أي: إرادته المتعلقة بتكموين أمره { مَفْعُولاً } [النساء: 47] مقتضياً البتة لا تخفف\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { ياأيها الذين أوتوا الكتاب } من اليهود { آمنوا بما نزلنا } من القرآن { مصدقًا لما معكم } من التوراة { من قبل أن نطمس وُجُوهاً } أي: نغير صُورها ونمحو تخطيط أشكالها، فلا تبقى عين ولا أنف ولا حاجب، { فنرُدها على } هيئة { أدبارها } من الأقفاء، أو ننكسها إلى ورائها في الدنيا، { أو نلعنهم } أي: نخزيهم بالمسخ، { كما لعنَّا أصحاب السبت } ، فمسخناهم قردة وخنازير، { وكان أمر الله مفعولاً } ، لا مرد له، ولعله كان مشروطاً بعدم إيمان بعضهم، أو يراد بطمس الوجوه ما يكسوها من الذلة والصغار. ويراد باللعن حقيقته، أي: نلعنهم على لسانك كما لُعنوا على لسان داود وعيسى ابن مريم. وهذه الآية كانت سبب إسلام كعب الأحبار، سمعها من بعض الصحابة فأسلم في زمن عمر بن الخطاب رضي الله عنه. والمسخ جائز على هذه الأمة، كما وقع الأمم السابقة، بدليل ما في كتاب الأشربة من البخاري أن النبي صلى الله عليه وسلم قال:\n \" ليكوننَّ من أمَّتي أقوام يَستحلُّون الحِر والحَريرَ، والخمر والمعازف، ولينزلنَّ أقوام إلى جَنِب علَمِ، يَروحُ عليهم بسارحة لهم يأتيهم لحاجة، فيقولون: ارجع إلينا غَدًا، فيُبيَّتُهم الله، ويضع عليهم العَلَم، ويَمسَخُ آخرين قِردَة وخنازيرَ إلى يوم القيامة \". \nالإشارة: حملة الشريعة يخاطبون بالإيمان بأهل الحقيقة، لأنها لبها وصفاؤها، فإن امتنعوا من الإيمان بها ومن الإذعان لأهلها، طمس الله وجوه قلوبهم، وملأها خوفًا وجزعًا وحبًا للدنيا، وردها على أدبارها، فلا تفهم أسرارَ الكتاب ولا تفقه إشارة الخطاب، فإن قصّروا عن حقوق الشريعة، وغيَّروا أحكامها مُسخوا قردة وخنازير. وفي نوادر الأصول بسنده إلى رسول الله صلى الله عليه وسلم قال:\n \" تَكُونُ فِي أُمَّتي قزَعةٌ، فَيَصيرُ النَّاسُ إلى عُلَمَائِهِمْ، فإذا هُم قِردَةٌ وخَنَازِيرُ \". \nقال الترمذي الحكيم: فالمسخ: تغيير الخلقة عن جهتها، فإنما حل بهم المسخ لأنهم غيَّروا الحق عن جهته، وحرفوا الكلم عن مواضعه، فمسخوا عن أعين الخلق، وقلوبُهم عن رؤية الحق. فمسخ الله صورهم وبدَّل خِلقتهم، كما بدلوا الحق باطلاً. هـ. وبالله التوفيق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:8",
      "similarity": 0.5143618315676852
    },
    {
      "verse": "36:66",
      "similarity": 0.4932946482200511
    },
    {
      "verse": "10:88",
      "similarity": 0.475224614227484
    },
    {
      "verse": "16:124",
      "similarity": 0.4361809969682547
    },
    {
      "verse": "54:37",
      "similarity": 0.4345495083701008
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/4:47.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/4:47.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/4:47.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}