{
  "chapter": "النساء",
  "text": "ان الله لا يغفر ان يشرك به ويغفر ما دون ذلك لمن يشاء ومن يشرك بالله فقد افترى اثما عظيما",
  "translations": [
    {
      "translation": "Allah does not forgive anything being associated with Him but He forgives whoever He wills for anything other than that. Anyone who associates something with Allah has committed a terrible crime.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not forgive that compeers be ascribed to Him, though He may forgive aught else if He please. And he who ascribes compeers to God is guilty of the gravest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah does not forgive that a partner be ascribed to Him, although He forgives any other sins for whomever He wills. He who associates anyone with Allah in His divinity has indeed forged a mighty lie and committed an awesome sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not forgive the sin of considering others equal to Him, but He may choose to forgive other sins. Whoever believes in other gods besides Him has indulged in a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Undoubtedly Allah does not forgive (the sin of) disbelieving in Him and forgives anything lower than it to whomever He wills; and whoever ascribes partners to Allah has invented a tremendous sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah forgives not that partners should be set up with Him (in worship), but He forgives except that to whom He wills; and whoever sets up partners with Allah in worship, he has indeed invented a tremendous sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah does not forgive that anything should be associated with Him, and forgives what is besides that to whomsoever He pleases; and whoever associates anything with Allah, he devises indeed a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God forgives not that aught should be with Him associated; less than that He forgives to whomsoever He will. Whoso associates with God anything, has indeed forged a mighty sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah forgiveth not that a partner should be ascribed unto Him. He forgiveth (all) save that to whom He will. Whoso ascribeth partners to Allah, he hath indeed invented a tremendous sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not forgive anyone for associating something with Him, while He will forgive whoever He wishes for anything besides that. Whoever ascribes partners to God is guilty of a monstrous sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah shall not Forgive that aught be associated with Him, and He will forgive all else unto whomsoever He listeth. And whosoever associateth aught with Allah, he hath of a surety fabricated a mighty sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah does not forgive that partners should be ascribed to Him, but He forgives anything besides that to whomever He wishes. Whoever ascribes partners to Allah has indeed fabricated [a lie] in great sinfulness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah forgiveth not that partners should be set up with Him; but He forgiveth anything else, to whom He pleaseth; to set up partners with Allah is to devise a sin Most heinous indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah forgives not that partners should be set up with him in worship, but He forgives except that (anything else) to whom He pleases, and whoever sets up partners with Allah in worship, he has indeed invented a tremendous sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not forgive (the sin of inventing an) association with Him, but He forgives other (sins) to whomsoever He will. He who associates with Allah has invented a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not forgive association with Him, but He forgives anything less than that to whomever He wills. Whoever associates anything with God has devised a monstrous sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah does not forgive association with Him, but He forgives what is less than that for whom He wills. And he who associates others with Allah has certainly fabricated a tremendous sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:48] God forgives not that anything should be associated with Him. But He forgives other than, save, that, of sins, to whomever He wills, forgiveness for, by admitting him into Paradise without punishment. And whomever He wills of the believers He punishes for their sins, and then admits them into Paradise. Whoever associates anything with God, then he has indeed invented a tremendous, a great, sin.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Allah forgiveth not that a partner should be ascribed unto Him) if one dies in such a state. He forgiveth (all) save that to whom He will) to whomever repents. (Whoso ascribeth partners to Allah, he hath indeed 90 invented a tremendous sin) a tremendous lie. This verse was revealed about Wahshiyy, the murderer of Hamzah, the uncle of the Prophet (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّ الله لا يغفر أن يُشْرك به } إشارة إلى أنّ الشقاوة العلمية الاعتقادية مخلّدة لا تتدارك أبداً دون العملية، أي: لا يستر بوجوده ولا يفني بذاته من يثبت غيره في الوجود وكيف وأنه يناوبه بوجوده",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { إِنَّ ٱللَّهَ } المتعزز برداء العظمة والكبرياء، المتفرد بالمجد والبهاء { لاَ يَغْفِرُ أَن يُشْرَكَ بِهِ } أي: لا يستر ولا يعفو عن انتقام الشرك به بإثبات الوجود لغيره { وَيَغْفِرُ مَا دُونَ ذَلِكَ } من الكبائر والصغائر { لِمَن يَشَآءُ } من التائبين وغيرهم، ثم قال سبحانه تأكيداً وتحقيقاً: { وَمَن يُشْرِكْ بِٱللَّهِ } الواحد الأحد الذي\n\n[الاخلاص: 3-4] شيئاً من مظاهره بادعاء الوجود له أصالة استقلالاً { فَقَدِ ٱفْتَرَىٰ } على الله واكتسب لنفسه { إِثْماً عَظِيماً } [النساء: 48] لا مخلص له عنه\n\n\n\n\nنعوذ بك ونستغفرك من أن نشرك بك شيئاً ونحن نعلم، ونستغفرك لما لا نعلم، إنك أنت علام الغيوب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:116",
      "similarity": 0.4943614205505309
    },
    {
      "verse": "4:50",
      "similarity": 0.4756368523139186
    },
    {
      "verse": "16:105",
      "similarity": 0.40724494343789236
    },
    {
      "verse": "83:12",
      "similarity": 0.40186996037167516
    },
    {
      "verse": "4:111",
      "similarity": 0.3899640812656788
    }
  ]
}