{
  "chapter": "النساء",
  "text": "ان الله لا يغفر ان يشرك به ويغفر ما دون ذلك لمن يشاء ومن يشرك بالله فقد افترى اثما عظيما",
  "translations": [
    {
      "translation": "Allah does not forgive anything being associated with Him but He forgives whoever He wills for anything other than that. Anyone who associates something with Allah has committed a terrible crime.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not forgive that compeers be ascribed to Him, though He may forgive aught else if He please. And he who ascribes compeers to God is guilty of the gravest sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah does not forgive that a partner be ascribed to Him, although He forgives any other sins for whomever He wills. He who associates anyone with Allah in His divinity has indeed forged a mighty lie and committed an awesome sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not forgive the sin of considering others equal to Him, but He may choose to forgive other sins. Whoever believes in other gods besides Him has indulged in a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Undoubtedly Allah does not forgive (the sin of) disbelieving in Him and forgives anything lower than it to whomever He wills; and whoever ascribes partners to Allah has invented a tremendous sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah forgives not that partners should be set up with Him (in worship), but He forgives except that to whom He wills; and whoever sets up partners with Allah in worship, he has indeed invented a tremendous sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah does not forgive that anything should be associated with Him, and forgives what is besides that to whomsoever He pleases; and whoever associates anything with Allah, he devises indeed a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God forgives not that aught should be with Him associated; less than that He forgives to whomsoever He will. Whoso associates with God anything, has indeed forged a mighty sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah forgiveth not that a partner should be ascribed unto Him. He forgiveth (all) save that to whom He will. Whoso ascribeth partners to Allah, he hath indeed invented a tremendous sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not forgive anyone for associating something with Him, while He will forgive whoever He wishes for anything besides that. Whoever ascribes partners to God is guilty of a monstrous sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah shall not Forgive that aught be associated with Him, and He will forgive all else unto whomsoever He listeth. And whosoever associateth aught with Allah, he hath of a surety fabricated a mighty sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah does not forgive that partners should be ascribed to Him, but He forgives anything besides that to whomever He wishes. Whoever ascribes partners to Allah has indeed fabricated [a lie] in great sinfulness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah forgiveth not that partners should be set up with Him; but He forgiveth anything else, to whom He pleaseth; to set up partners with Allah is to devise a sin Most heinous indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah forgives not that partners should be set up with him in worship, but He forgives except that (anything else) to whom He pleases, and whoever sets up partners with Allah in worship, he has indeed invented a tremendous sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not forgive (the sin of inventing an) association with Him, but He forgives other (sins) to whomsoever He will. He who associates with Allah has invented a great sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not forgive association with Him, but He forgives anything less than that to whomever He wills. Whoever associates anything with God has devised a monstrous sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah does not forgive association with Him, but He forgives what is less than that for whom He wills. And he who associates others with Allah has certainly fabricated a tremendous sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:48] God forgives not that anything should be associated with Him. But He forgives other than, save, that, of sins, to whomever He wills, forgiveness for, by admitting him into Paradise without punishment. And whomever He wills of the believers He punishes for their sins, and then admits them into Paradise. Whoever associates anything with God, then he has indeed invented a tremendous, a great, sin.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيجوز أن تكون هذه الجملة متعلقة بما قبلها من تهديد اليهود بعقاب في الدنيا ، فالكلام مَسوق لترغيب اليهود في الإسلام ، وإعلامهم بأنّهم بحيث يتجاوز الله عنهم عند حصول إيمانهم ، ولو كان عذابُ الطمس نازلاً عليهم ، فالمراد بالغفران التجاوز في الدنيا عن المؤاخذة لهم بعظم كفرهم وذنوبهم ، أي يرفع العذاب عنهم . وتتضمّن الآية تهديداً للمشركين بعذاب الدنيا يحلّ بهم فلا ينفعهم الإيمان بعد حلول العذاب ، كما قال تعالى : { فلولا كانت قرية آمنت فنفعها إيمانها إلاّ قوم يونس } \\[ يونس : 98 \\] الآية . وعلى هذا الوجه يكون حرف ( إنّ ) في موقع التعليل والتسبّب ، أي آمنوا بالقرآن من قبل أن ينزل بكم العذاب ، لأنّ الله يغفر ما دون الإشراك به ، كقوله : { وما كان الله ليعذبّهم وأنت فيهم } \\[ الأنفال : 33 \\] ، أي ليعذّبهم عذاب الدنيا ، ثم قال : { ومالهم أن لا يعذّبهم الله } \\[ الأنفال : 34 \\] ، أي في الدنيا ، وهو عذابل الجوع والسيف . وقوله : { فارتقب يوم تأتي السماء بدخان مبين يغشى الناس هذا عذاب أليم } \\[ الدخان : 10 ، 11 \\] ، أي دخانٌ عامَ المجاعة في قريش . ثم قال : { إنّا كاشفوا العذاب قليلاً إنّكم عائدُون يوم نبطش البطشة الكبرى إنّا منتقمون } \\[ الدخان : 15 ، 16 \\] أي بطشة يوم بدر؛ أو يكون المراد بالغفران التسامح ، فإنّ الإسلام قَبِل من أهل الكتابين الدخول تحت ذمَّة الإسلام دون الدخول في دين الإسلام ، وذلك حكم الجزية ، ولم يرض من المشركين إلاّ بالإيمان دون الجزية ، لقوله تعالى : { فاقتلوا المشركين حيث وجدتموهم } إلى قوله { فإن تابوا وأقاموا الصلاة وآتوا الزكاة فخلّوا سبيلهم } \\[ التوبة : 5 \\] . وقال في شأن أهل الكتاب { قاتلوا الذين لا يؤمنون بالله ولا باليوم الآخر ولا يُحرّمون ما حرّم الله ورسولُه ولا يدينون دينَ الحقّ من الذين أوتوا الكتَاب حتّى يُعطوا الجزية عن يدٍ وهُم صاغرون } \\[ التوبة : 29 \\] .ويجوز أن تكون الجملة مستأنَفة ، وقعت اعتراضاً بين قوارع أهل الكتاب ومواعظهم ، فيكون حرفُ ( إنَّ ) لتوكيد الخبر لقصد دفع احتمال المجاز أو المبالغة في الوَعيد ، وهو إمّا تمهيد لما بعده لتشنيع جرم الشرك بالله ليكون تمهيداً لتشنيع حال الذين فَضَّلوا الشرك على الإيمان ، وإظهاراً لمقدار التعجيب من شأنهم الآتي في قوله : { ألم ترى إلى الذين أوتوا نصيباً من الكتاب يؤمنون بالجبت والطاغوت ويقولون للذين كفروا هؤلاء أهدى من الذين آمنوا سبيلاً } \\[ النساء : 51 \\] ، أي فكيف ترضون بحال من لا يرضى الله عنه . والمغفرة على هذا الوجه يصحّ حملها على معنى التجاوز الدنيوي ، وعلى معنى التجاوز في الآخرة على وجه الإجمال .وإمّا أن يكون استئنافَ تعليممِ حكم في مغفرة ذنوب العصاة : ابتدىء بمُحْكَم وهو قوله : { لا يغفر أن يشرك به } ، وذُيِّل بمتشابه وهو قوله : { ويغفر ما دون ذلك لمن يشاء } ؛ فالمغفرة مراد منها التجاوز في الآخرة .قال القرطبي «فهذا من المتشابه الذي تكلّم العلماء فيه» وهو يريد أنّ ظاهرها يقتضي أموراً مشكلة :الأول : أنّ يقتضي أنّ الله قد يغفر الكفر الذي ليس بشرك ككفر اليهود .الثاني : أنّه يغفر لمرتكب الذنوب ولو لم يتب .الثالث : أنّه قد لا يغفر للكافر بعد إيمانه وللمذنب بعد توبته ، لأنّه وَكَل الغفران إلى المشيئة ، وهي تلاقي الوقوع والانتفاء . وكلّ هذه الثلاثة قد جاءت الأدلّة المتظافرة على خلافها ، واتّفقت الأمّة على مخالفة ظاهرها ، فكانت الآية من المتشابه عند جميع المسلمين . قال ابن عطية : «وهذه الآية هي الحاكمة ببيان ما تعارض من آيات الوعد والوعيد . وتلخيصُ الكلام فيها أن يقال : الناس أربعة أصناف : كافر مات على كفره ، فهذا مخلّد في النار بإجماع ، ومؤمن محسن لم يذنب قط ومات على ذلك فهو في الجنة محتوم عليه حسب الوعد في الله بإجماع وتائب مات على توبته فهذا عند أهل السنّة وجمهور فقهاء الأمّة لا حق بالمؤمن المحسن ، ومُذنب مات قبل توبته فهذا هو موضع الخلاف : فقالت المرجئة : هو في الجنّة بإيمانه ولا تضره سيّئاته ، وجعلوا آيات الوعيد كلّها مخصّصة بالكفار وآيات الوعد عامّة في المؤمنين؛ وقالت المعتزلة : إذا كان صاحب كبيرة فهو في النار لا محالة؛ وقالت الخوارج : إذا كان صاحب كبيرة أو صغيرة فهو في النار مخلّد ولا إيمان له ، وجعلوا آيات الوعد كلّها مخصّصة بالمؤمن المحسن والمؤمن التائب ، وجعلوا آيات الوعيد عامّة في العصاة كفاراً أو مؤمنين؛ وقال أهل السنّة : آيات الوعد ظاهرة العموم ولا يصحّ نفوذ كلّها لوجهه بسبب تعارضها كقوله تعالى : { لا يصلاها إلاّ الأشقى الذي كذّب وتولّى } \\[ الليل : 15 ، 16 \\] وقوله : { ومن يعص الله ورسوله فإنّ له نار جهنّم } \\[ الجن : 23 \\] ، فلا بدّ أن نقول : إنّ آيات الوعد لفظها لفظ العموم ، والمراد به الخصوص : في المؤمن المحسن ، وفيمن سبق في علم الله تعالى العفو عنه دون تعذيب من العصاة ، وأنّ آيات الوعيد لفظها عموم والمراد به الخصوص في الكفرة ، وفيمن سبق علمه تعالى أنّه يعذّبه من العصاة . وآية { إنّ الله لا يغفر أنّ يشرك به } جَلت الشكّ وذلك أنّ قوله : { ويغفر ما دون ذلك } مبطل للمعتزلة ، وقوله : { لمن يشاء } رادّ على المرجئة دالّ على أنّ غفران ما دون الشرك لقوم دون قوم . ولعلّه بنى كلامه على تأويل الشرك به بما يشمل الكفر كلّه ، أو بناه على أنّ اليهود أشركوا فقالوا : عزير ابن الله ، والنصارى أشركوا فقالوا : المسيح ابن الله ، وهو تأويل الشافعي فيما نسبه إليه فخر الدين ، وهو تأويل بعيد . فالإشراك له معناه في الشريعة ، والكفر دونه له معناه .والمعتزلة تأوّلوا الآية بما أشار إليه في «الكشّاف» : بأنّ قوله { لمن يشاء } معمول يتنازعه { لا يغفر } المنفي { ويغفرُ } المثبت . وتحقيق كلامه أن يكون المعنى عليه : إنّ الله لا يغفر الشرك لمن يشاء ويغفر ما دون الشرك لمن يشاء ، ويصير معنى لا يغفر لمن يشاء أنّه لا يشاء المغفرة له إذ لو شاء المغفرة له لغفر له ، لأنّ مشيئة الله المُمْكنَ لا يمنعها شيء ، وهي لا تتعلّق بالمستحيل ، فلمّا قال : { لا يغفر } علمنا أنّ ( من يشاء ) معناه لا يشاء أن يغفر ، فيكون الكلام من قبيل الكناية ، مثل قولهم : لا أعرفنَّك تفعل كذا ، أي لا تفعلْ فأعرفَك فاعلاً ، وهذا التأويل تعسّف بيّن .وأحسب أنّ تأويل الخوارج قريب من هذا . وأمّا المرجئة فتأوّلوا بما نقله عنهم ابن عطية : أنّ مفعول { من يشاء } محذوف دلّ عليه قوله : { أن يشرك به } ، أي ويغفر ما دون الشرك لمن يشاء الإيمان ، أي لمن آمن ، وهي تعسّفات تُكْرِه القرآننِ على خدمة مذاهبهم . وعندي أنّ هذه الآية ، إن كانت مراداً بها الإعلام بأحوال مغفرة الذنوب فهي آية اقتصر فيها على بيان المقصود ، وهو تهويل شأن الإشراك ، وأجمل ما عداه إجمالاً عجيباً ، بأن أدخلت صورهُ كلّها في قوله : { لمن يشاء } المقتضي مغفرةً لفريق مبْهم ومؤاخذة لِفريق مبهم . والحوالة في بيان هذا المجمل على الأدّلة الأخرى المستقرَاة من الكتاب والسنّة ، ولو كانت هذه الآية ممّا نزل في أوّل البعثة لأمكن أن يقال : إنّ ما بعدها من الآيات نسخ ما تضمّنته ، ولا يهولنا أنّها خبَر لأنّها خبر مقصود منه حكم تكليفي ، ولكنّها نزلت بعدَ معظم القرآن ، فتعيّن أنّها تنظر إلى كلّ ما تقدّمها ، وبذلك يستغني جميعُ طوائف المسلمين عن التعسّف في تأويلها كلّ بما يساعد نحلته ، وتصبح صالحة لمحامل الجميع ، والمرجع في تأويلها إلى الأدّلة المبيّنة ، وعلى هذا يتعيّن حمل الإشراك على معناه المتعارف في القرآن والشريعة المخالف لمعنى التوحيد ، خلافَ تأويل الشافعي الإشراك بما يشمل اليهودية والنصرانية ، ولعلّه نظر فيه إلى قول ابن عمر في تحريم تزوّج اليهودية والنصرانية بأنّهما مشركتان . . وقال : أيّ شرك أعظم من أن يدعى الله ابن .وأدّلة الشريعة صريحة في اختلاف مفهوم هذين الوصفين ، وكونُ طائفة من اليهود قالوا : عزير ابن الله ، والنصارى قالوا : المسيح ابن الله ، لا يقتضي جعلهم مشركين إذ لم يدّعوا مع ذلك لهذين إلهية تشارك الله تعالى ، واختلاف الأحكام التكليفية بين الكُفرين دليل على أن لا يراد بهذا اللفظ مفهوم مطلق الكفر ، على أنه ماذا يغني هذا التأويل إذا كان بعض الكفرة لا يقول بإلهية غير الله مثل معظم اليهود .وقد اتّفق المسلمون كلّهم على أنّ التوبة من الكفر ، أي الإيمانَ ، يوجب مغفرته سواء كان كفر إشراك أم كفراً بالإسلام ، لا شكّ في ذلك ، إمّا بوعد الله عند أهل السنّة ، أو بالوجوب العقلي عند المعتزلة؛ وأنّ الموت على الكفر مطلقاً لا يغفر بلا شكّ . إمّا بوعيد الله ، أو بالوجوب العقلي؛ وأنّ المذنب إذا تاب يغفر ذنبه قطعاً ، إمّا بوعد الله أو بالوجوب العقلي .واختلف في المذنب إذا مات على ذنبه ولم يتب أو لم يكن له من الحسنات ما يغطّي على ذنوبه ، فقال أهل السنّة : يعاقب ولا يخلّد في العذاب بنصّ الشريعة ، لا بالوجوب ، وهو معنى المشيئة ، فقد شاء الله ذلك وعَرَّفنَا مشيئته بأدلّة الكتاب والسنّة .وقال المعتزلة والخوارج : هو في النار خالداً بالوجوب العقلي . وقال المرجئة : لا يعاقب بحال ، وكلّ هاته الأقسام داخل في إجمال { لمن يشاء } .وقوله : { ومن يشرك بالله فقد افترى إثماً عظيماً } زيادة في تشنيع حال الشرك . والافتراءُ : الكذب الذي لا شبهة للكاذب فيه . لأنّه مشتقّ من القرى ، وهو قطع الجلد . وهذا مثل ما أطلقوا عليه لفظ الاختلاق من الخَلْق . وهو قطع الجلد ، وتقدّم عند قوله تعالى : { قال كذلك الله يخلق ما يشاء في سورة آل عمران . والإثم العظيم : الفاحشة الشديدة .\n\n",
      "translations": [
        {
          "translation": "(Lo! Allah forgiveth not that a partner should be ascribed unto Him) if one dies in such a state. He forgiveth (all) save that to whom He will) to whomever repents. (Whoso ascribeth partners to Allah, he hath indeed 90 invented a tremendous sin) a tremendous lie. This verse was revealed about Wahshiyy, the murderer of Hamzah, the uncle of the Prophet (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّ الله لا يغفر أن يُشْرك به } إشارة إلى أنّ الشقاوة العلمية الاعتقادية مخلّدة لا تتدارك أبداً دون العملية\n أي: لا يستر بوجوده ولا يفني بذاته من يثبت غيره في الوجود وكيف وأنه يناوبه بوجوده",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { إِنَّ ٱللَّهَ } المتعزز برداء العظمة والكبرياء\n المتفرد بالمجد والبهاء { لاَ يَغْفِرُ أَن يُشْرَكَ بِهِ } أي: لا يستر ولا يعفو عن انتقام الشرك به بإثبات الوجود لغيره { وَيَغْفِرُ مَا دُونَ ذَلِكَ } من الكبائر والصغائر { لِمَن يَشَآءُ } من التائبين وغيرهم\n ثم قال سبحانه تأكيداً وتحقيقاً: { وَمَن يُشْرِكْ بِٱللَّهِ } الواحد الأحد الذي\n[الاخلاص: 3-4] شيئاً من مظاهره بادعاء الوجود له أصالة استقلالاً { فَقَدِ ٱفْتَرَىٰ } على الله واكتسب لنفسه { إِثْماً عَظِيماً } [النساء: 48] لا مخلص له عنه\n\n\nنعوذ بك ونستغفرك من أن نشرك بك شيئاً ونحن نعلم\n ونستغفرك لما لا نعلم\n إنك أنت علام الغيوب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { إن الله لا يغفر أن يشرك به } لأنه بتَّ الحكم على خلود عذابه، لأن الله تعالى غيور لا أحد أغير منه. كما في الحديث، ومن عادة الملوك إذا خرج أحدٌ من رعيته ونصر غيره لا يقبل منه إلا الرجوع أو الموت. ولا شفاعة تنفع في غير الرجوع عنه. { ويغفر ما دون ذلك } الشرك { لمن يشاء } من الكبائر والصغائر. تاب أم لا. فالعصاة أذا لم يتوبوا في مشيئة الله، { ومن يُشرك بالله فقد افترى إثمًا عظيمًا } ارتكب ما تستحقر دونه الآثام. وهو إشارة إلى المعنى الفارق بينه وبين سائر الذنوب، والله تعالى أعلم. الإشارة: ولما رأت الصوفية أن الشرك لا يُغفر، ولا يُسمح في شيء منه، جليًا أو خفيًا، حققوا إخلاصهم، ودققوا معاملتهم مع ربهم، وفتشوا على قلوبهم، هل بقي فيها شيء من محبة غير مولاهم، أو خوفٌ من شيء دونه، وطهروا توحيدهم من نسبة التأثير لشيء من الكائنات، فتوجهوا إلى الله في إزالة ذلك عنهم. قال بعضهم: شربتُ لبنًا فأصابني انتفاخ، فقلت ضرني ذلك اللبن، فلما كنت ذات يوم أتلو، هذه الآية قلت: يا رب أنا لا أشرك بك شيئًا، فقال لي هاتفٌ: ولا يوم اللبن، فبادرت إلى التوبة. اهـ. بالمعنى. والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:116",
      "similarity": 0.4943614205505309
    },
    {
      "verse": "4:50",
      "similarity": 0.4756368523139186
    },
    {
      "verse": "16:105",
      "similarity": 0.40724494343789236
    },
    {
      "verse": "83:12",
      "similarity": 0.40186996037167516
    },
    {
      "verse": "4:111",
      "similarity": 0.3899640812656788
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004048.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004048.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:48.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}