{
  "chapter": "النساء",
  "text": "الم تر الى الذين يزكون انفسهم بل الله يزكى من يشاء ولا يظلمون فتيلا",
  "translations": [
    {
      "translation": "Do you not see those who claim to be purified? No, Allah purifies whoever He wills. They will not be wronged by so much as the smallest speck.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen the people who call themselves pure? Yet God purifies whom He pleases, and none shall be wronged even the breadth of a thread.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who boast of their righteousness, even though it is Allah Who grants righteousness to whomsoever He wills? They are not wronged even as much as the husk of a date-stone (if they do not receive righteousness).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), have you seen those who try to purify themselves? They should know that God only purifies whomever He wants and that the slightest wrong will not be done to such people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see those who proclaim their piety (cleanliness of deeds)? In fact Allah purifies whomever He wills, and no injustice, even equal to the hair upon a date seed will be done to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who claim sanctity for themselves Nay, but Allah sanctifies whom He wills, and they will not be dealt with injustice even equal to the extent of a Fatil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered those who attribute purity to themselves? Nay, Allah purifies whom He pleases; and they shall not be wronged the husk of a date stone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not regarded those who purify themselves? Nay; only God purifies whom He will; and they shall not be wronged a single date-thread.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen those who praise themselves for purity? Nay, Allah purifieth whom He will, and they will not be wronged even the hair upon a date-stone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who consider themselves pure? It is indeed God who purifies whoever He pleases and none shall be wronged by as much as a hair's breadth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not observed those who hold themselves purified Nay! Allah purifieth whomsoever He will, and they shall not be wronged a whit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded those who style themselves as pure? Indeed, it is Allah who purifies whomever He wishes, and they will not be wronged [so much as] a single date-thread.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not turned Thy vision to those who claim sanctity for themselves? Nay-but Allah Doth sanctify whom He pleaseth. But never will they fail to receive justice in the least little thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who claim sanctity for themselves. Nay - but Allah sanctifies whom He pleases, and they will not be dealt with injustice even equal to the extent of a Fatila (A scalish thread in the long slit of a date-stone).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who exalt themselves? Rather, Allah purifies whom He will and they shall not be wronged a single tissue that covers a date stone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered those who claim purity for themselves? Rather, God purifies whom He wills, and they will not be wronged a whit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who claim themselves to be pure? Rather, Allah purifies whom He wills, and injustice is not done to them, [even] as much as a thread [inside a date seed].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:49] Have you not seen those who praise themselves for purity? namely, the Jews, when they say, ‘We are God’s children and His beloved’, in other words, it is not a matter of their purifying themselves. Nay, God purifies whom He will, through faith, and they shall not be wronged, they shall not be diminished of their deeds, a single date-thread, as much as the peel on a date-stone.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hast thou not seen) have you not been informed in the Scripture about (those who praise themselves for purity?) those who absolve themselves from transgression. The reference here is to Buhayr Ibn 'Amr and Marhab Ibn Zayd. (Nay, Allah purifieth) absolves from sins (whom He will) whoever is fit for it, (and they will not be wronged even the hair upon a date stone) their sins will not be diminished even by the hair upon a date stone.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَلَمْ تَرَ } معناهُ أَلمْ تَعْلَمْ\n\n\n\n\nوقوله تعالى: { وَلاَ يُظْلَمُونَ فَتِيلاً } معناهُ لا يُنْقَصُونَ ولا يُظْلَمونَ نَقِيرا\n فالفَتيلُ الَّذِي في شِقِّ النَواةِ\n والفَتِيلُ: مَا يَخرُجُ بينَ الإِصْبِعيَنِ إِذا فَتَلَتْهَا السَّبَابَةُ والإِبْهَامُ\n والنَّقَيرُ: التي فِي ظَهرِ النَّواةِ التي تنبتُ مِنْهَا النَّخْلَةُ، والنَّقيرُ: أَنْ تَضعَ طَرَفَ الإِبْهامِ عَلى طَرفِ السَّبابَةِ ثُمَّ تَنْقرَها\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Did you not know?\" means, \"Did you not know?\"\n\n\nAnd His saying, \"They will not be wronged a {fetil}\" - meaning they will not be deprived or wronged in any way.\n\n\nThe camel that is in the split of the date palm.\n\n\nThe {fatila} is what comes out between the {isba'iyat} when the {sabbabah} and the {ibham} strike it.\n\n\nAnd the naqir (camel) is the one that is in the back of the camel that gives birth to the palm tree, and the naqir (camel) is to put the tip of the thumb on the top of the sabbah (pot), then to knock it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ألم تر إلى الذين يزكون أنفسهم } أي: يزيلون صفات نفوسهم بنفوسهم\n وذلك غير ممكن كما لا يمكن لأحدنا حمل نفسه إذ هي لوازم النفس باقية لازمة لها\n ولهذا قال تعالى:\n[الحشر\n الآية: 9]\n إذ الرذائل معجونة فيها\n باقية ببقائها\n وقال عليه الصلاة والسلام:\n \" شرّ الناس من قامت عليه القيامة وهو حيّ \" \nأي: يقف على علم التوحيد ونفسه لم تمت بالفناء حتى تحيى بالله\n فإنه حينئذ زنديق قائل بالإباحة في الأشياء\n { بل الله يُزكي من يَشاء } بمحو صفاته وإزالتها بصفاته تعالى { ولا يظلمون فتيلاً } أي: لا ينقصون شيئاً حقيراً من صفاتهم وحقوقها فإنّ الله لا يأخذ شيئاً منها مع ضعفها وسرعة انقضائها حتى يعطي بدله من صفاته مع قوتها ودوامها { انْظُر كيف يَفْتَرون على الله الكَذب } بادعاء تزكية نفوسهم من صفاتها وما تزكّت\n أو بانتحال صفات الله إلى أنفسهم لوجود نفوسهم\n { ألم تَرَ } إلى آخره",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَرَ } أيها الرائي { إِلَى ٱلَّذِينَ يُزَكُّونَ أَنْفُسَهُمْ } بألسنتهم وألبستهم\n رياء وسمعة ويفتخرون بها ويباهون عليها\n كيف وظنوا أنفسهم بهذا المزخرف الباطل ولم يتفطنوا أن العبد قل ما بخلوا عن الشرك الجلي فضلاً عن الخفي\n ولا تليق التزكية للعبد مطلقاً سواء يزكي نفسه أو غيره { بَلِ ٱللَّهُ } المطلع لأحوال عباده { يُزَكِّي } بفضله { مَن يَشَآءُ } من عباده\n والمراءون المزكون لنفوسهم قولاً بلا توافق أحوالهم وأعمالهم على مقالهم يعاقبون عليها { وَلاَ يُظْلَمُونَ فَتِيلاً } [النساء: 49] أي: لا يزاد على انتقام ما اقترحوا مقدار حبل النواة\n وهو مثل في الصغر والحقارة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ألم تر } يا محمد { إلى الذين يزكون أنفسهم } \n وهم اليهود\n قالوا: نَحنُ أبنَاءُ اللهِ وَأحبَّاؤُه\n وقيل: طائفة منهم\n أتَوا بأطفَالِهِم إلىَ رسول اللهِ صلى الله عليه وسلم فقالوا: هَل عَلَى هؤُلآءِ ذَنبٌ\n قال: \" لآ \"\n قَالوُا: واللهِ مَا نَحنُ إلا كَهَيئَتِهِم\n مَا عَمِلنَا بالنّهَارِ يُكَفَّر عَنَّا باللَّيلِ\n وما عملنا باللَّيلِ يُكَفَّر عَنَّا بالنّهَارِ\n فنزلت فيهم الآية\n وفي معناهم: من زكى نفسه وأثنى عليها قبل معرفتها\n { بل الله يُزكي من يشاء } لأنه العالم بخفيات النفوس وكمائنها\n وما انطوت عليه من قبيح أو حسن\n فيزكي من يستحق التزكية\n ويفضح المُدَّعِين\n { ولا يُظلمون فتيلاً } \n وهو الخيط الذي في شق النواة\n يضرب مثلاً لحقارة الشيء\n فأن الله لا يظلم مثقال ذرة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:71",
      "similarity": 0.8682357950886926
    },
    {
      "verse": "4:77",
      "similarity": 0.7153366573113822
    },
    {
      "verse": "2:151",
      "similarity": 0.09764377985873597
    },
    {
      "verse": "2:110",
      "similarity": 0.09589162704131331
    },
    {
      "verse": "41:7",
      "similarity": 0.09581368197517916
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/4:49.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/4:49.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/4:49.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}