{
  "chapter": "النساء",
  "text": "ولا تؤتوا۟ السفهاء امولكم التى جعل الله لكم قيما وارزقوهم فيها واكسوهم وقولوا۟ لهم قولا معروفا",
  "translations": [
    {
      "translation": "Do not hand over to the simple-minded any property of theirs for which Allah has made you responsible, but provide for them and clothe them out of it, and speak to them correctly and courteously.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not entrust (their) property God has given you to maintain (On trust), to those who are immature; but feed them and clothe them from it, and speak to them with kindness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not entrust your properties - which Allah hasmade a means of support for you - to the weak of understanding, but maintain and clothe them out of it, and say to them a kind word of admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not give to people weak of understanding your property for which God has made you to supervise. Feed and clothe such people and speak to them in a reasonable way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not give the foolish their wealth which is in your custody – those for whom Allah has put you in charge to maintain (look after) – and feed and clothe them from it, and speak kindly to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give not unto the unwise your wealth which Allah has made a means of support for you, but feed and clothe them therewith, and speak to them words of kindness and justice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not give away your property which Allah has made for you a (means of) support to the weak of understanding, and maintain them out of (the profits of) it, and clothe them and speak to them words of honest advice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But do not give to fools their property that God has assigned to you to manage; provide for them and clothe them out of it, and speak to them honourable words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give not unto the foolish (what is in) your (keeping of their) wealth, which Allah hath given you to maintain; but feed and clothe them from it, and speak kindly unto them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not give those who are of immature mind your property which God has granted you as a means of support: make provision for them out of it, and clothe them, and give them good advice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give not unto the weak-witted the substance which Allah made a stay for you, but feed them there out, Sand clothe them, and say unto them a reputable saying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not give the feeble-minded your property, which Allah has assigned you to manage: provide for them out of it and clothe them, and speak to them honourable words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those weak of understanding Make not over your property, which Allah hath made a means of support for you, but feed and clothe them therewith, and speak to them words of kindness and justice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give not unto the foolish your property which Allah has made a means of support for you, but feed and clothe them therewith, and speak to them words of kindness and justice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not give the (orphaned) fools your wealth with which Allah has entrusted you for (their) support, and provide for them and clothe them from it, and speak to them with kind words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not give the immature your money which God has assigned to you for support. But provide for them from it, and clothe them, and speak to them with kind words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not give the weak-minded your property, which Allah has made a means of sustenance for you, but provide for them with it and clothe them and speak to them words of appropriate kindness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:5] But do not, O guardians, give to the foolish, the squanderers from among men, women and children, your property, that is, the property that is theirs but held by you, which God has assigned to you as maintenance (qiyāman, ‘maintenance’, is the verbal noun from qāma; a variant reading has qiyaman, the plural of qīma, ‘value’, that is, that with which property is valued), meaning that the property which sustains your livelihoods and the well-being of your children, lest they expend it improperly; provide for them thereof, that is, feed them from it, and clothe them, and speak to them decent words, prepare for them a kind reception, by giving them their property when they reach maturity.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Give not unto the foolish) do not give to those who are ignorant of the rights of women and children (your wealth which Allah hath given you to maintain) as a means of living; (but feed and clothe them from it) be yourselves responsible for feeding and clothing them, for you know better than them the right thing to do concerning sustenance and alms giving, (and speak kindly unto them) if you do not have anything to give them, promise them that you will clothe them and give to them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تُؤْتُواْ ٱلسُّفَهَآءَ أَمْوَالَكُمُ } معناهُ النِّساءُ والصِّبيَانُ\n\n",
      "translations": [
        {
          "translation": "\nAnd the saying of Allah: {And do not give foolish people your wealth} means the women and children.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً من جملة الحقوق المتعلقة بالتقوى أيها الأولياء أن { لاَ تُؤْتُواْ ٱلسُّفَهَآءَ } سواء كانوا من أصلابكم وما ينتمي إليكم، وهم الذين خرجوا عن طور العقل ومرتبة التدبير والتكليف { أَمْوَالَكُمُ ٱلَّتِي جَعَلَ ٱللَّهُ } ملكاً { لَكُمْ } أيها العقلاء المكلفون { قِيَٰماً } سبباً لقيامكم على الطاعة والعبادة { وَ } لكن { ٱرْزُقُوهُمْ } أي: اجعلوا طعامهم وسائر حوائجهم في مدة أعمالهم { فِيهَا } في ربحها ونمائها { وَٱكْسُوهُمْ } أيضاً منها { وَ } إن كان منهم له أدنى شعور بأمر الإضافة والتمليك، ولكن لا ينتهي إلى التدبير والتصرف المشروع { قُولُواْ لَهُمْ } لهؤلاء المخطئين من مرتبة العقلاء { قَوْلاً مَّعْرُوفاً } [النساء: 5] مستحسناً عقلاً وشرعاً؛ لئلا ينكسر قلوبهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { قيمًا }: مصدر قام قيامًا وقيما، وأصله: قوامًا، قلبت الواو ياء\n يقول الحقّ جلّ جلاله: للأوصياء: { ولا تؤتوا السفهاء } التي تحت حضانتكم { أموالكم } أي: أموالهم التي في أيديكم، وإنما أضاف أموال اليتامى لهم حثًا على حفظها وتنميتها كأنها مال من أموالهم، أي: ولا تمكنوا السفهاء من أموالهم التي جعلها الله في أيديكم { قيمًا } لمعاشهم، تقومون بها عليهم، ولكن احفظوها، واتجروا فيها، واجعلوا رزقهم وكسوتهم فيها باعتبار العادة، فإن طلبوها منكم فعدوهم وعدًا جميلاً، { وقولوا لهم قولاً معروفًا } أي: كلامًا لينًا بأن يقول له: حتى تكبر وترشد لتصلح للتصرف فيها\n وشبه ذلك\n وإنما قال: { وارزقوهم فيها } دون \" منها \" لأن \" فيها \" يقتضي بقاءها بالتنمية والتجارة حتى تكون محلاً للرزق والكسوة دون \" منها \" ، وقيل: الخطاب للأزواج، نهاهم أن يعمدوا إلى ما خولهم الله من المال فيعطوه إلى نسائهم وأولادهم، ثم ينظرون إلى أيديهم\n وإنما سمَّاهن سفهاء استخفافًا بعقلهن، كما عبر عنهن بـ \" ما \" التي لغير العاقل\n وروى أبو أمامة عن النبي صلى الله عليه وسلم أنه قال\n\n \" إنما خُلقتْ النارُ للسفهاء ــ قالها ثلاثًا ــ ألا وإن السفهاءَ النساء إلا امرأة أطاعت قيِّمَها \"\n \n\nوقالت أمرأة: يا رسول الله: سميتنا السفهاء! فقال:\n\n \" الله تعالى سماكن في كتابه \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:67",
      "similarity": 0.4286428595613713
    },
    {
      "verse": "7:66",
      "similarity": 0.41364625961169094
    },
    {
      "verse": "2:13",
      "similarity": 0.4063261360080253
    },
    {
      "verse": "6:140",
      "similarity": 0.40064276860485565
    },
    {
      "verse": "2:142",
      "similarity": 0.334002022415789
    }
  ]
}