{
  "chapter": "النساء",
  "text": "الم تر الى الذين اوتوا۟ نصيبا من الكتب يؤمنون بالجبت والطغوت ويقولون للذين كفروا۟ هؤلاء اهدى من الذين ءامنوا۟ سبيلا",
  "translations": [
    {
      "translation": "Do you not see those who were given a portion of the Book having iman in idols and false gods and saying to those who are kafir, 'These people are better guided on their path than the muminun'?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who were given a portion of the Book, who believe in false deities and evil powers, and say of unbelievers: \"These are better guided than those who believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those to whom a portion of the Book was given? They believe in baseless superstitions and taghut (false deities), and say about the unbelievers that they are better guided than those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you seen how those who had been given a share of the Book believe in idols and Satan and who say, \"The disbelievers are better guided than the believers\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see those who received a portion of the Book, that they believe in idols and the devil, and say regarding the disbelievers that they are more rightly guided than the Muslims?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who were given a portion of the Scripture They believe in Jibt and Taghut and say to those who disbelieve, \"These people are better guided on the way, \" than the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those to whom a portion of the Book has been given? They believe in idols and false deities and say of those who disbelieve: These are better guided in the path than those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not regarded those who were given a share of the Book believing in demons and idols, and saying to the unbelievers, 'These are more rightly guided on the way than the believers'?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen those unto whom a portion of the Scripture hath been given, how they believe in idols and false deities, and how they say of those (idolaters) who disbelieve: \"These are more rightly guided than those who believe\"?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who were in possession of a portion of the Book? They believe in idols and devils. They say of those who deny the truth, \"They are more rightly guided than the believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not observed those unto whom is vouchsafed a portion of the Book testifying to idols and devils, and saying of those who have disbelieved: these are better guided as regards the way than the believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded those who were given a share of the Book, believing in idols and fake deities and saying of the pagans: ‘These are better guided on the way than the faithful’?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not turned Thy vision to those who were given a portion of the Book? they believe in sorcery and Evil, and say to the Unbelievers that they are better guided in the (right) way Than the believers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who were given a portion of the Scripture? They believe in Jibt and Taghut and say to the disbelievers that they are better guided as regards the way than the believers (Muslims).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those to whom a portion of the Book was given believing in (the two statutes of Mecca) jibt and taghout and say to those who disbelieve: 'Those are more guided on the way than those who believe.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered those who were given a share of the Book? They believe in superstition and evil powers, and say of those who disbelieve, “These are better guided on the way than the believers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who were given a portion of the Scripture, who believe in superstition and false objects of worship and say about the disbelievers, \"These are better guided than the believers as to the way\"?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:51] The following was revealed regarding Ka‘b b. al-Ashraf and other such scholars from among the Jews, when they came to Mecca and saw those killed at Badr, and began to incite the idolaters to avenge them [their dead] by waging war against the Prophet (s): Have you not seen those who were given a share of the Book, how they believe in al-Jibt and al-Tāghūt, two idols belonging to Quraysh, and say to the disbelievers, to Abū Sufyān and his companions, when they [the latter] said to them: ‘Are we, who are the guardians of the House, who give drink to the pilgrim, offer hospitality to the guest, set free the captive, and do such and such … not more rightly guided than Muhammad, he who has contravened the religion of his forefathers, severed the ties of kinship, and abandoned the Sanctuary?’, ‘These, in other words, you, are more rightly guided, upon a more upright way, than the believers’?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hast thou not seen) have you not been informed, Muhammad, about (those unto whom a portion of the Scripture has been given) those who have been given knowledge of the Torah in relation to your trait and attribute, the verse of stoning [married people who commit fornication], and similar other issue, namely. Malik Ibn al-Sayf and his friends who were about seventy people, (how they believe in idols) this is Huyayy Ibn Akhtab (and false deities) Ka'b Ibn Ashraf, (and bow they say of those (idolaters) who disbelieve) the unbelievers of Mecca: (\"These are more rightly guided) they have a better religion (than those who believe?\") in the Qur'an and in Muhammad and his Religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بِٱلْجِبْتِ وَٱلطَّٰغُوتِ } قالَ زيدُ بن علي عليهما السلامُ: فالجِّبتُ: السِّحرُ\n والجِّبتُ: الكَاهِنُ\n والطَّاغوتُ: الشَّيطانُ: ويقالُ: الجِّبتُ، والطَّاغُوتُ: كُلُّ مَعبُودٍ مِنْ حَجرٍ أَوْ مَدَرٍ أَوْ صُورةٍ أَو شَيطانٍ\n\n\n\n\nوقوله تعالى: { أَهْدَىٰ مِنَ ٱلَّذِينَ آمَنُواْ سَبِيلاً } معناهُ أَقومُ طَرِيقَةً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَرَ } أيها الرائي { إِلَى ٱلَّذِينَ } يدعون أنهم { أُوتُواْ نَصِيباً مِّنَ } علم { ٱلْكِتَٰبِ } أي: التوراة المبين لطريق التوحيد الموضح لسبيله كيف { يُؤْمِنُونَ بِٱلْجِبْتِ } أي: الصنم الذي لا خير يرجى منه ولا شر، ولا نفع ولا ضر { وَٱلطَّٰغُوتِ } التي هي الآراء البالطة والأهوية الفاسدة المؤدية إلى الكفر والزندقة والإلحاد عن طريق الرشاد، ولو أنهم في أهل التوحيد ولهم نصيب من اكتساب النازل من عند الله لتبيينه وتعليم طريقه، لما آمنوا بالأباطيل الزائفة الفاسدة المضلة عن طريق الحق والصراط المستقيم، ومع ضلالهم في أنفسهم يريدون إضلال غيرهم { وَيَقُولُونَ لِلَّذِينَ كَفَرُواْ } أي: في حق ضعفائهم وأتباعهم: { هَٰؤُلاءِ } الضعفاء من إخواننا { أَهْدَىٰ } وأقوى { مِنَ } السفهاء { ٱلَّذِينَ آمَنُواْ } بمحمد صلى الله عليه وسلم { سَبِيلاً } [النساء: 51] وإنما يقولون أمثال هذا؛ استخفافاً للنبي صلى الله عليه وسلم وطعناً وقدحاً في الإسلام\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الجبت في الأصل: اسم صنم، فاستعمل في كل ما عُبد من دون الله، { والطاغوت }: كل باطل من معبود أو غيره، أو الجبت: السحر، { والطاغوت }: الساحر، وبالجملة: هو كل ما عُبد أو أطيع من دون الله، وقال الجوهري: الجبت: اسم لكل صنم ولكل عاصٍ ولكل ساحر وكل مُضِلّ، { والطاغوت }: الشيطان، وأصله: طغيوت، فعلوت، من الطغيان، ثم قلب فصار طيَغوت، ثم قلبت الياء ألفًا\n يقول الحقّ جلّ جلاله: { ألم تر إلى الذين أوتوا نصيبًا من } علم { الكتاب } ، وهم أحبار اليهود { يُؤمنون بالجبت والطاغوت } يقرون بصحة عبادتهما، { ويقولون للذين كفروا هؤلاء } الكفرة { أهدى من الذين آمنوا } طريقًا، نزلت في اليهود - لعنهم الله -: كانوا يقولون: إن عبادة الأصنام أرضى عند الله مما يدعو إليه محمد صلى الله عليه وسلم، وقيل: في حُيي بن أخطب وكعب بن الأشرف، خرجا في سبعين راكبًا إلى مكة يُحالفون قريشًا على محاربة رسول الله صلى الله عليه وسلم بعد وقعة أُحد، وينقضون العهد الذي كان بينهم وبين رسول الله صلى الله عليه وسلم، فنزل كَعبُ على أبي سفيان، فأحسن مثواه، ونزلت اليهود في دور قريش\n فقال أهل مكة: أنتم أهل كتاب، ومحمدٌ صاحب كتاب، ولا نأمن أن يكون هذا مكيدة منكم\n فإن أردتم أن نخرج معكم فاسجدوا لهذين الصنمين، وآمنوا بهما، ففعلوا، فذلك قوله تعالى: { يؤمنون بالجبت والطاغوت }\n ثم قال أبو سفيان لكعب: إنك امرؤ تقرأ الكتاب وتعلم، ونحن أميون لا نعلم، فأيُّنا أهدى سبيلاً وأقرب إلى الحق، نحن أو محمد؟ قال كعب: اعرضوا عليَّ دينَكم، فقال أبو سفيان: نحن ننحر للحجيج الكومَاءَ ـ أي: العظيمة ـ من النوق ـ ونسقي الماء، ونَقري الضيف، ونفك العاني، ونصل الرحم، ونعمر بيت ربنا، ونطوف به، ونحن أهل الحرم، ومحمدٌ فارقَ دينَ أبائه، وقطع الرحم وفارق الحرم، فقال كعب: أنتم والله أهدى سبيلاً\n هـ",
      "translations": []
    }
  ]
}