{
  "chapter": "النساء",
  "text": "ام يحسدون الناس على ما ءاتىهم الله من فضله فقد ءاتينا ءال ابرهيم الكتب والحكمة وءاتينهم ملكا عظيما",
  "translations": [
    {
      "translation": "Or do they in fact envy other people for the bounty Allah has granted them? We gave the family of Ibrahim the Book and Wisdom, and We gave them an immense kingdom.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they so envious of others for what God has given them of His bounty? So We had given the Book and the Law to Abraham's family, and given them great dominion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they envy others for the bounty that Allah has bestowed upon them? (Let them bear in mind that) We bestowed upon the house of Abraham the Book and Wis-dom, and We bestowed upon them a mighty dominion,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they jealous of the favors that God has done to some people? We have given to the family of Abraham the Book, Wisdom, and a great Kingdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they envy people due to what Allah has given them from His grace? In that case, We bestowed the Book and the wisdom upon the family of Ibrahim (Abraham), and We gave them a great kingdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they envy men for what Allah has given them of His bounty Then, We have already given the family of Ibrahim the Book and Al-Hikmah, and conferred upon them a great kingdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they envy the people for what Allah has given them of His grace? But indeed We have given to Ibrahim's children the Book and the wisdom, and We have given them a grand kingdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or are they jealous of the people for the bounty that God has given them? Yet We gave the people of Abraham the Book and the Wisdom, and We gave them a mighty kingdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or are they jealous of mankind because of that which Allah of His bounty hath bestowed upon them? For We bestowed upon the house of Abraham (of old) the Scripture and wisdom, and We bestowed on them a mighty kingdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they envy others because of what God has given them out of His bounty? We granted the House of Abraham the Book and wisdom and We granted them a great kingdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or envy they the people on account of that which Allah hath vouchsafed unto them out of His grace! so, surely We vouchsafed unto the house of Ibrahim the Book and the wisdom and We vouchsafed unto them a mighty dominion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they envy those people for what Allah has given them out of His bounty? We have certainly given the progeny of Abraham the Book and wisdom, and We have given them a great sovereignty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they envy mankind for what Allah hath given them of his bounty? but We had already given the people of Abraham the Book and Wisdom, and conferred upon them a great kingdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they envy men (Muhammad SAW and his followers) for what Allah has given them of His Bounty? Then We had already given the family of Ibrahim (Abraham) the Book and Al-Hikmah (As-Sunnah - Divine Inspiration to those Prophets not written in the form of a book), and conferred upon them a great kingdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they envy people for the Bounty Allah has given them? We gave the family of Abraham the Book and Wisdom, and a great kingdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they envy the people for what God has given them of His grace? We have given the family of Abraham the Book and wisdom, and We have given them a great kingdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they envy people for what Allah has given them of His bounty? But we had already given the family of Abraham the Scripture and wisdom and conferred upon them a great kingdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:54] Or, nay, are they jealous of people, namely, of the Prophet (s), for the bounty that God has bestowed upon them, in the way of prophethood and abundance of women? In other words, they wish that he be deprived of such things, saying, ‘If he were truly a prophet, he would not be concerned with women’. For We gave the House of Abraham, his forefather, the likes of Moses, David and Solomon, the Book and wisdom, and prophethood, and We gave them a mighty kingdom: David had ninety–nine women, and Solomon had a thousand, free women and slavegirls.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or are they jealous) nay, they are jealous (of mankind) of Muhammad and his Companions (because of that which Allah of His bounty hath bestowed upon them?) the Scripture, prophethood and marrying many wives. (For We bestowed upon the house of Abraham) David and Solomon ((of old) the Scripture and Wisdom) knowledge, understanding and prophethood, (and We bestowed on them a mighty kingdom) We honoured them with prophethood and Islam and bestowed upon them sovereignty over the Children of Israel. David had 100 legitimate wives, and Solomon had 300 legitimate wives plus 700 concubines.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ومن غاية حسدهم يكذبونهم وكتابهم عناداً وإذا أرادت أن ترى أيها الرائي من لهم نصيب من الكتاب والملك { فَقَدْ آتَيْنَآ } من محض جودنا وفضلنا { آلَ إِبْرَٰهِيمَ } وذريته الذي من جملتهم وصفوتهم محمد صلى الله عليه وسلم { ٱلْكِتَٰبَ } المبين للشرائع و الأحكام { وَٱلْحِكْمَةَ } السرائر المقتضية تشريعها { وَ } مع ذلك { آتَيْنَاهُمْ } في الدنيا { مُّلْكاً عَظِيماً } [النساء: 54] استيلاء بسطة ممتدة إلى يوم القيامة\n\n\n{ فَمِنْهُمْ مَّنْ آمَنَ بِهِ } بنوبتهم وعظمتهم وبسطتهم { وَمِنْهُمْ مَّن صَدَّ عَنْهُ } أي: أعرض ولم يؤمن عتواً وعناداً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أم } بمعنى بل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "113:5",
      "similarity": 0.818100929080515
    },
    {
      "verse": "2:109",
      "similarity": 0.5865844240101094
    },
    {
      "verse": "48:15",
      "similarity": 0.5384929411607607
    },
    {
      "verse": "57:29",
      "similarity": 0.13587546142485774
    },
    {
      "verse": "23:24",
      "similarity": 0.1253764441992357
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004054.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004054.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:54.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}