{
  "chapter": "النساء",
  "text": "فمنهم من ءامن به ومنهم من صد عنه وكفى بجهنم سعيرا",
  "translations": [
    {
      "translation": "Some of them have iman in him, and some bar access to him. Hell will suffice as a Searing Blaze!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then some of them believed in it, and some turned away from it; yet sufficient is Hell, the flaming Fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whereupon some of them believed, and others turned away. (Those who turn away), Hell suffices for a blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some have believed, others have disbelieved and tried to prevent people from believing. For these people, only the intense fire of hell is a sufficient punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So some of them believed in it and some of them turned away from it; and sufficient is hell, a blazing fire!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of them were (some) who believed in it, and of them were (some) who rejected it; and enough is Hell for burning (them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So of them is he who believes in him, and of them is he who turns away from him, and hell is sufficient to burn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some of them there are that believe, and some of them that bar from it; Gehenna suffices for a Blaze!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them were (some) who believed therein and of them were (some) who turned away from it. Hell is sufficient for (their) burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them believed in it and some held back from it. Hell will suffice as a blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then of them were some who believed therein, and of them were some who turned aside therefrom, and Hell -will suffice as a Flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of them are some who believe in him, and of them are some who deter [others] from him; and hell suffices for a blaze!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them believed, and some of them averted their faces from him: And enough is Hell for a burning fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of them were (some) who believed in him (Muhammad SAW), and of them were (some) who averted their faces from him (Muhammad SAW); and enough is Hell for burning (them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some of them who believed in him (Prophet Muhammad), and some of them that bar from it, and Gehenna (Hell) is sufficient for a Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them are those who believed in it, and among them are those who held back from it. Hell is a sufficient Inferno.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some among them believed in it, and some among them were averse to it. And sufficient is Hell as a blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:55] And there are some of them who believe in him, in Muhammad (s), and some of them who bar from him, [who] reject [him] and do not believe. Hell suffices for a blaze, as a chastisement for those who do not believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of them) of the Jews (were (some) who believed therein) believed in the Scripture of David and Solomon (and of them were (some) who disbelieved therein. Hell is sufficient for (their) burning) i.e. Ka'b and his followers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَكَفَىٰ بِجَهَنَّمَ سَعِيراً } معناهُ وقُودٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - {And Hell is sufficient as a blaze} - its meaning is a fire.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فلا تعجل يا أكمل الرسل بانتقامهم وعقوبتهم { وَكَفَىٰ بِجَهَنَّمَ سَعِيراً } [النساء: 55] أي: كفى جهنم المسعورة المعدة لانتقامهم وتعذيبهم منتقماً عنهم على أقبح وجه وأشد تعذيب",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أم } بمعنى بل، و { سعيرًا } تمييز\n يقول الحقّ جلّ جلاله: توبيخًا لليهود على الحسد: { أم يحسدون الناس } ، أي: العرب حيث انتقلت النبوة إليهم، وقد كانت في أسلافهم، { على ما آتاهم الله من فضله } ، وهو ظهور النبوة فيهم، أو رسول الله صلى الله عليه وسلم لأنه اجتمع فيه ما افترق في سائر الناس، حسدوه على ما آتاه الله من فضله، من النبوة وغيرها، وقالوا ـ لعنهم الله ـ: ما له همٌّ إلا النساء ولو كان نبيًا لشغله أمر النبوة عن النساء\n فكَّذبهم الله ـ تعالى ـ وردَّ عليهم بقوله: { فقد آتينا آل إبراهيم } وهم: يوسف وداود وسليمان، { الكتاب والحكمة } أي: النبوّة، { وآتيناهم مُلكّاً عظيمًا }\n فقد اجتمع لداود عليه السلام مائة امرأة\n ولسليمان ـ عليه السلام ـ ألف امرأة: ثلاثمائة مهيرة، ـ أي بالمهرـ وسبعمائة سرية، فقال لهم ـ عليه الصلاة والسلام ـ حين نزلت الآية: ألف امرأة عن رجل، ومائة امرأة عند آخر، أكثر من تسع نسوة، فسكتوا\n { فمنهم } أي: اليهود، { من آمن به } أي: بمحمد ـ عليه الصلاة والسلام ـ كعبد الله بن سلام وأصحابة، { ومنهم من صدّ عنه } أي: أعرض عنه، أو: من آل إبراهيم من آمن بإبراهيم، { ومنهم من صدّ عنه } ، ولم يكن في ذلك توهين لقدر إبراهيم، فكذلك لا يُوهن كفرُ هؤلاء أمرَك، أو: من أسلافهم من آمن بما أُوتي آل إبراهيم من الكتاب والحكمة والمُلك، { ومنهم مَن صدّ عنه } ، كما فعلوا مع سليمان وغيره\n { وكفى بجهنم سعيرًا } لمن كفر بما جاء به أحد من الرسل، أي: فإن لم يُعاجَلوا بالعقوبة فقد كفاهم ما أعد لهم من سعير جهنم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:4",
      "similarity": 0.5232272837635218
    },
    {
      "verse": "54:47",
      "similarity": 0.5227078961004262
    },
    {
      "verse": "54:24",
      "similarity": 0.48231026653942716
    },
    {
      "verse": "84:12",
      "similarity": 0.4816489472752088
    },
    {
      "verse": "81:12",
      "similarity": 0.4791744667217118
    }
  ]
}