{
  "chapter": "النساء",
  "text": "ان الذين كفروا۟ بـايتنا سوف نصليهم نارا كلما نضجت جلودهم بدلنهم جلودا غيرها ليذوقوا۟ العذاب ان الله كان عزيزا حكيما",
  "translations": [
    {
      "translation": "As for those who reject Our Signs, We will roast them in a Fire. Every time their skins are burned off, We will replace them with new skins so that they can taste the punishment. Allah is Almighty, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve Our revelations shall be cast into Hell; and when their skin is burnt up and singed, We shall give them a new coat that they may go on tasting the agony of punishment, for God is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We shall cast those who reject Our signs into the Fire; and as often as their skins are burnt out, We shall give them other skins in exchange that they may fully taste the chastisement. Surely Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will make the rejectors of Our revelations suffer in hell fire. As soon as the fire destroys their skins, We will give them new skins so that they may suffer more of the torment. God is Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall soon put those who disbelieve in Our signs into the fire; whenever their skins are cooked (fully burnt) We shall change them for new skins so they may taste the punishment (again and again); indeed Allah is Almighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, those who disbelieved in Our Ayat, We shall burn them in Fire. As often as their skins are roasted through, We shall change them for other skins that they may taste the punishment. Truly, Allah is Ever Most Powerful, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who disbelieve in Our communications, We shall make them enter fire; so oft as their skins are thoroughly burned, We will change them for other skins, that they may taste the chastisement; surely Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who disbelieve in Our signs -- We shall certainly roast them at a Fire; as often as their skins are wholly burned, We shall give them in exchange other skins, that they may taste the chastisement. Surely God is All-mighty, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Those who disbelieve Our revelations, We shall expose them to the Fire. As often as their skins are consumed We shall exchange them for fresh skins that they may taste the torment. Lo! Allah is ever Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall send those who reject Our revelations to the Fire. When their skins are burnt up, We shall replace them with new ones so that they may continue to taste the punishment. God is mighty and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who disbelieve in Our revelations, presently We shall roast them into Fire. So oft as their skins are cooked We shall change them for other skins, so that they may keep on tasting the torment verily Allah is ever Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We shall soon make those who deny Our signs enter a Fire: as often as their skins become scorched, We shall replace them with other skins, so that they may taste the punishment. Indeed Allah is all-mighty, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject our Signs, We shall soon cast into the Fire: as often as their skins are roasted through, We shall change them for fresh skins, that they may taste the penalty: for Allah is Exalted in Power, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely! Those who disbelieved in Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) We shall burn them in Fire. As often as their skins are roasted through, We shall change them for other skins that they may taste the punishment. Truly, Allah is Ever Most Powerful, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve Our verses We will roast them in a Fire! As often as their skins are cooked, We exchange their skin with another, in order that they taste the punishment. Surely, Allah is Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Our revelations—We will scorch them in a Fire. Every time their skins are cooked, We will replace them with other skins, so they will experience the suffering. God is Most Powerful, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who disbelieve in Our verses - We will drive them into a Fire. Every time their skins are roasted through We will replace them with other skins so they may taste the punishment. Indeed, Allah is ever Exalted in Might and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:56] Surely those who disbelieve in Our signs — We shall expose them, We shall admit them, to a Fire, wherein they shall burn; as often as their skins are consumed, burnt, We shall replace them with other skins, restoring them to their initial unburnt state, that they may taste the chastisement, that they may suffer its severity. Surely God is ever Mighty, nothing being beyond His power, Wise, in His creation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Those who disbelieve Our revelations) Muhammad and the Qur'an, (We shall expose them to the Fire) 91 in the Hereafter. This is a threat to them. (As often as their skins are consumed) by the Fire (We shall exchange them for fresh skins that they may taste the torment) so that they feel the torment. (Lo! Allah is ever Mighty) by taking vengeance on them, (Wise) He ruled that burnt skins be exchanged for fresh ones.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { سَوْفَ نُصْلِيهِمْ نَاراً } معناهُ نَشوِيهِمْ بالنّارِ ونَنضِجُهُمْ بِهَا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقل للمؤمنين يا أكمل الرسل نيابة عنا، إخباراً لهم عن وخامة عاقبة هؤلاء المعرضين: { إِنَّ ٱلَّذِينَ كَفَرُواْ بِآيَٰتِنَا } كهؤلاء المدبرين { سَوْفَ نُصْلِيهِمْ } وندخلهم { نَاراً } معدة لجزاء الغواة بحيث { كُلَّمَا نَضِجَتْ } تفانت واضمحلت { جُلُودُهُمْ } بإحراق نار الخذلان { بَدَّلْنَٰهُمْ } من غاية قهرنا وانتقامنا { جُلُوداً غَيْرَهَا } مماثلة لما احترقت منها { لِيَذُوقُواْ ٱلْعَذَابَ } أي: ليدوم لهم ذوقه وخذلانه { إِنَّ ٱللَّهَ } المنتقم منهم { كَانَ عَزِيزاً } غالباً على الانتقام حسب المرام { حَكِيماً } [النساء: 56] عادلاً لا يظلم بالزيادة ولا يهمل بنقصان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم بيَّن مآل من كفر، فقال: { إن الذين كفروا بآياتنا } المنزلة على رسلنا، أو الدالة على وحدانيتنا، { سوف نصليهم نارًا } أي: نحرقهم بها ونشويهم، { كلما نضجت جلودهم } أي: لانت واحترقت { بدّلناهم جلودًا غيرها } ، قال صلى الله عليه وسلم:\n\n \" تُبدَّلُ في ساعةٍ مائةَ مَرَّة \" \n\nوقال الحسن:  تأكلهم النارُ في كل يوم سبعين ألف مرة، كلما أكلتهم وأنضجتهم قيل لهم: عودوا فيعودوان كما كانوا\n وقال مجاهد:  ما بين جلده ولحمه دود، لها جلبة ـ أي حركة ـ وهرير كجلبة حمر الوحش\n رَوى أبو هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال:\n\n \" غلظٌ جِلدِ الكَافِرِ اثنَانٍ وأربعَونَ ذرَاعًا، وضِرسه مِثلُ أحُد \"\n \n\nوإنما بدلت جلودهم { ليذوقوا } ألم { العذاب } ، أي: يدوم لهم ذلك بخلق جلد آخر مكانه، والعذاب في الحقيقة للنفس العاصية لا لآلة إدراكها، فلا محذور، { إن الله كان عزيزًا } لا يمتنع عليه ما يريد، { حكيمًا } يعاقب على قدر حكمته\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:20",
      "similarity": 0.1597224119293284
    },
    {
      "verse": "41:21",
      "similarity": 0.15103704515927416
    },
    {
      "verse": "24:2",
      "similarity": 0.12801948900624385
    },
    {
      "verse": "41:22",
      "similarity": 0.12756190358759903
    },
    {
      "verse": "24:4",
      "similarity": 0.12754244526830477
    }
  ]
}