{
  "chapter": "النساء",
  "text": "والذين ءامنوا۟ وعملوا۟ الصلحت سندخلهم جنت تجرى من تحتها الانهر خلدين فيها ابدا لهم فيها ازوج مطهرة وندخلهم ظلا ظليلا",
  "translations": [
    {
      "translation": "But as for those who have iman and do right actions, We will admit them into Gardens with rivers flowing under them, remaining in them timelessly, for ever and ever. In them they will have spouses of perfect purity and We will admit them into cool, refreshing shade.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do good deeds We shall admit into gardens with streams of running water, where they will abide for ever, with fairest of companions and coolest of shades.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and do good deeds, We shall cause them to enter the Gardens beneath which rivers flow. There they shall abide for ever. There they shall have spouses purified and there We shall cause them to enter a shelter with plenteous shade.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will admit the righteously striving believers into the gardens wherein streams flow. They will live therein forever in a cool shade with their pure spouses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed and did good deeds, We shall soon admit them into Gardens beneath which rivers flow – abiding in it forever; in it for them are pure wives – and We shall admit them into places of plentiful shade.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do deeds of righteousness, We shall admit them to Gardens under which rivers flow (Paradise), abiding therein forever. Therein they shall have Azwajun Mutahharatun (purified mates), and We shall admit them to shades, wide and ever deepening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who believe and do good deeds, We will make them enter gardens beneath which rivers flow, to abide in them for ever; they shall have therein pure mates, and We shall make them enter a dense shade.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those that believe, and do deeds of righteousness, them We shall admit to gardens underneath which rivers flow, therein dwelling forever and ever; therein for them shall be spouses purified, and We shall admit them to a shelter of plenteous shade.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who believe and do good works, We shall make them enter Gardens underneath which rivers flow - to dwell therein for ever; there for them are pure companions - and We shall make them enter plenteous shade.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do good works, We shall make them enter Gardens through which rivers flow, to dwell therein forever; therein they shall have pure spouses, and We shall admit them into a dense shade.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and work righteous works, anon We shall cause them to enter the Gardens whereunder rivers flow as abiders therein for ever. For them shall be spouses purified, and We shall cause them to enter a sheltering shade.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who have faith and do righteous deeds, We shall admit them into gardens with streams running in them, to remain in them forever. In it, there will be chaste mates for them, and We shall admit them into a deep shade.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do deeds of righteousness, We shall soon admit to Gardens, with rivers flowing beneath,- their eternal home: Therein shall they have companions pure and holy: We shall admit them to shades, cool and ever deepening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe (in the Oneness of Allah - Islamic Monotheism) and do deeds of righteousness, We shall admit them to Gardens under which rivers flow (Paradise), abiding therein forever. Therein they shall have Azwajun Mutahharatun [purified mates or wives (having no menses, stools, urine, etc.)] and We shall admit them to shades wide and ever deepening (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do good works, We shall admit them to Gardens underneath which rivers flow, they are there for eternity, and for them purified spouses. And We shall admit them into plenteous shade.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do good deeds, We will admit them into Gardens beneath which rivers flow, abiding therein forever. They will have purified spouses therein, and We will admit them into a shady shade.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and do righteous deeds - We will admit them to gardens beneath which rivers flow, wherein they abide forever. For them therein are purified spouses, and We will admit them to deepening shade.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:57] And those that believe, and perform righteous deeds, We shall admit them to Gardens underneath which rivers flow, wherein they abide: they shall have therein spouses purified, of menstruation and every impurity, and We shall admit them to plenteous shade, that is everlasting [shade], never replaced by any sun, and this is the shade of Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah said about the believers: (And as for those who believe) in Muhammad, the Qur'an and in all Scriptures and messengers (and do good works) acts of obedience, i.e. they sincerely perform that which is between them and their Lord, (We shall make them enter) in the Hereafter (Gardens beneath which) beneath its trees and walls (rivers) rivers of wine, milk, honey and water (flow to dwell therein for ever) dwelling in Paradise, never to die or be removed; (there for them) in Paradise (are pure companions) they are pure from menstruation and filth (and We shall make them enter plenteous shade) a protected retreat; and it is also said that this means: an extended shade.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n والأزواج ههنا الأرواح المقدّسة التي هي مظاهر الصفات الإلهية المطهرة بالهيئات البدنية { وندخلهم ظلاً ظليلاً } أي: ظلّ الصفات الإلهية الدائم روحها بمحو الصفات البشرية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لذلك { خَالِدِينَ فِيهَآ أَبَداً } بلا انقطاع وانصرام\n ومع ذلك { لَّهُمْ فِيهَآ أَزْوَاجٌ } صواحب من الصفات والأسماء يؤانسهم { مُّطَهَّرَةٌ } عن أدناس الطبيعة مطلقاً { وَ } بالجملة: { نُدْخِلُهُمْ } من غاية لطفنا إياهم { ظِـلاًّ } مروحاً لقلوبهم { ظَلِيلاً } [النساء: 57] ممدوداً لا يزول أصلاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:122",
      "similarity": 0.7103855526035184
    },
    {
      "verse": "65:11",
      "similarity": 0.6118929227616103
    },
    {
      "verse": "3:15",
      "similarity": 0.6088277821533005
    },
    {
      "verse": "14:23",
      "similarity": 0.5186096329965248
    },
    {
      "verse": "5:119",
      "similarity": 0.48671688931751156
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/4:57.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/4:57.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:57.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}