{
  "chapter": "النساء",
  "text": "ان الله يامركم ان تؤدوا۟ الامنت الى اهلها واذا حكمتم بين الناس ان تحكموا۟ بالعدل ان الله نعما يعظكم به ان الله كان سميعۢا بصيرا",
  "translations": [
    {
      "translation": "Allah commands you to return to their owners the things you hold on trust and, when you judge between people, to judge with justice. How excellent is what Allah exhorts you to do! Allah is All-Hearing, All-Seeing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God enjoins that you render to the owners what is held in trust with you, and that when you judge among the people do so equitably. Noble are the counsels of God, and God hears all and sees everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah commands you to deliver trusts to those worthy of them; and when you judge between people, to judge with justice. Excellent is the admonition Allah gives you. Allah is All-Hearing, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God commands you to return that which had been entrusted to you to the rightful owners. Be just when passing judgment among people. God's advice is the most noble. He sees and hears everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah commands you to hand over whatever you hold in trust, to their owners – and that whenever you judge between people, judge with fairness; undoubtedly Allah gives you an excellent advice; indeed Allah is All Hearing, All Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah commands that you should render back the trusts to those, to whom they are due; and that when you judge between men, you judge with justice. Verily, how excellent is the teaching which He (Allah) gives you! Truly, Allah is Ever All-Hearer, All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah commands you to make over trusts to their owners and that when you judge between people you judge with justice; surely Allah admonishes you with what is excellent; surely Allah is Seeing, Hearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God commands you to deliver trusts back to their owners; and when you judge between the people, that you judge with justice. Good is the admonition God gives you; God is All-hearing, All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah commandeth you that ye restore deposits to their owners, and, if ye judge between mankind, that ye judge justly. Lo! comely is this which Allah admonisheth you. Lo! Allah is ever Hearer, Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God commands you to hand back your trusts to their rightful owners, and when you judge between people, to judge with fairness. God's instructions to you are excellent. God hears and sees all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah commandeth you that ye shall render dues unto the owners thereof, and that, when ye judge between men, judge with justice. Verily excel lent is that wherewith Allah exhorteth you verily Allah is ever Hearing, Beholding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah commands you to deliver the trusts to their [rightful] owners, and to judge with fairness when you judge between people. Excellent indeed is what Allah advises you. Indeed Allah is all-hearing, all-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah doth command you to render back your Trusts to those to whom they are due; And when ye judge between man and man, that ye judge with justice: Verily how excellent is the teaching which He giveth you! For Allah is He Who heareth and seeth all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! Allah commands that you should render back the trusts to those, to whom they are due; and that when you judge between men, you judge with justice. Verily, how excellent is the teaching which He (Allah) gives you! Truly, Allah is Ever All-Hearer, All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah orders you all to hand back trusts to their owners, and when you judge between people you judge with justice. Indeed, the best is the exhortation with which Allah exhorts you. Allah is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God instructs you to give back things entrusted to you to their owners. And when you judge between people, judge with justice. God’s instructions to you are excellent. God is All-Hearing, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah commands you to render trusts to whom they are due and when you judge between people to judge with justice. Excellent is that which Allah instructs you. Indeed, Allah is ever Hearing and Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:58] Verily, God commands you to restore trusts, that is, the rights entrusted [to you by others], back to their owners: this was revealed when ‘Alī, may God be pleased with him, took the key of the Ka‘ba from its keeper, ‘Uthmān b. Talha al-Hajabī, by force, upon the arrival of the Prophet (s) in Mecca in the year of the Conquest, after he [‘Uthmān] had tried to prevent him [‘Alī from taking it] saying, ‘If I had known that he was the Messenger of God, I would not have prevented him’. The Messenger of God (s) then ordered him [‘Alī] to give it back to him [‘Uthmān] saying to him, ‘Here you are, [it is yours] now and always’. He [‘Uthmān] was amazed by this, whereupon ‘Alī recited to him this verse, and he accepted Islam. Upon his death, he [‘Uthmān] gave it [the key] to his brother, Shayba, and thus it remained in [the keep of] his descendants. Although the verse was revealed regarding a specific occasion, it holds true in general on account of the plural person [to which it is addressed]. And when you judge between people, He commands, that you judge with justice. Excellent is (ni‘immā, the mīm of ni‘ima has been assimilated with the indefinite particle mā, which is the object described, in other words, na‘ima shay’an, ‘an excellent thing [is]’) the admonition God gives you, to restore a trust and to judge with justice. God is ever Hearer, of what is said, Seer, of what is done.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Regarding the key that the Prophet (pbuh) took from 'Uthman Ibn Talhah as a deposit, Allah commanded His Messenger to give back deposits to their owner, saying: (Lo! Allah commandeth you that ye restore deposits) to give back the key (to their owners) to 'Uthman Ibn Talhah, (and, if ye judge between mankind) between 'Uthman Ibn Talhah and 'Abbas Ibn 'Abd al-Muttalib, (that you judge justly) that you give back to 'Uthman and the providing of water (siqaya) to al-'Abbas. (Lo! comely is this which Allah admonisheth you) comely is this which Allah commands you, of giving back deposits to their owners and judging justly. (Lo! Allah is ever Hearer) when al-'Abbas said: Messenger of Allah! give me both the key and the providing of water, (Seer) of what 'Uthman Ibn Talhah did when he refused to give the key and said: By Allah's trust! Give me my right, Messenger of Allah!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nواعلموا أيها المبشرون بهذه البشارة العظمى { إِنَّ ٱللَّهَ } المبشر بأمثاله { يَأْمُرُكُمْ أَن تُؤدُّواْ } وتدفعوا { ٱلأَمَانَاتِ } من الأحوال والشهادات وسائر حقوق العباد { إِلَىۤ أَهْلِهَا وَ } يأمركم أيضاً { إِذَا حَكَمْتُمْ بَيْنَ ٱلنَّاسِ } المتخاصمين في الوقائع { أَن تَحْكُمُواْ بِٱلْعَدْلِ } بالإنصاف والسوية بلا ميل إلى جانب أحد من المتخاصمين { إِنَّ ٱللَّهَ } المصلح لأحوالكم { نِعِمَّا } نعم شيئاً { يَعِظُكُمْ بِهِ } ويأمركم بامتثاله { إِنَّ ٱللَّهَ } المطلع على جميع حالاتكم { كَانَ سَمِيعاً } لجميع أقوالكم { بَصِيراً } [النساء: 58] لنياتكم وأفعالكم فيها، لا يعزب عنه مثال ذرة في الأرض ولا في السماء ولا أصغر من ذلك ولا أكبر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:18",
      "similarity": 0.7468060500614458
    },
    {
      "verse": "2:178",
      "similarity": 0.4490774200711771
    },
    {
      "verse": "2:283",
      "similarity": 0.3324480738613323
    },
    {
      "verse": "16:90",
      "similarity": 0.3166579647035731
    },
    {
      "verse": "65:2",
      "similarity": 0.30966918503481905
    }
  ]
}