{
  "chapter": "النساء",
  "text": "ان الله يامركم ان تؤدوا۟ الامنت الى اهلها واذا حكمتم بين الناس ان تحكموا۟ بالعدل ان الله نعما يعظكم به ان الله كان سميعۢا بصيرا",
  "translations": [
    {
      "translation": "Allah commands you to return to their owners the things you hold on trust and, when you judge between people, to judge with justice. How excellent is what Allah exhorts you to do! Allah is All-Hearing, All-Seeing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God enjoins that you render to the owners what is held in trust with you, and that when you judge among the people do so equitably. Noble are the counsels of God, and God hears all and sees everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah commands you to deliver trusts to those worthy of them; and when you judge between people, to judge with justice. Excellent is the admonition Allah gives you. Allah is All-Hearing, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God commands you to return that which had been entrusted to you to the rightful owners. Be just when passing judgment among people. God's advice is the most noble. He sees and hears everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah commands you to hand over whatever you hold in trust, to their owners – and that whenever you judge between people, judge with fairness; undoubtedly Allah gives you an excellent advice; indeed Allah is All Hearing, All Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah commands that you should render back the trusts to those, to whom they are due; and that when you judge between men, you judge with justice. Verily, how excellent is the teaching which He (Allah) gives you! Truly, Allah is Ever All-Hearer, All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah commands you to make over trusts to their owners and that when you judge between people you judge with justice; surely Allah admonishes you with what is excellent; surely Allah is Seeing, Hearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God commands you to deliver trusts back to their owners; and when you judge between the people, that you judge with justice. Good is the admonition God gives you; God is All-hearing, All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah commandeth you that ye restore deposits to their owners, and, if ye judge between mankind, that ye judge justly. Lo! comely is this which Allah admonisheth you. Lo! Allah is ever Hearer, Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God commands you to hand back your trusts to their rightful owners, and when you judge between people, to judge with fairness. God's instructions to you are excellent. God hears and sees all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah commandeth you that ye shall render dues unto the owners thereof, and that, when ye judge between men, judge with justice. Verily excel lent is that wherewith Allah exhorteth you verily Allah is ever Hearing, Beholding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah commands you to deliver the trusts to their [rightful] owners, and to judge with fairness when you judge between people. Excellent indeed is what Allah advises you. Indeed Allah is all-hearing, all-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah doth command you to render back your Trusts to those to whom they are due; And when ye judge between man and man, that ye judge with justice: Verily how excellent is the teaching which He giveth you! For Allah is He Who heareth and seeth all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! Allah commands that you should render back the trusts to those, to whom they are due; and that when you judge between men, you judge with justice. Verily, how excellent is the teaching which He (Allah) gives you! Truly, Allah is Ever All-Hearer, All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah orders you all to hand back trusts to their owners, and when you judge between people you judge with justice. Indeed, the best is the exhortation with which Allah exhorts you. Allah is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God instructs you to give back things entrusted to you to their owners. And when you judge between people, judge with justice. God’s instructions to you are excellent. God is All-Hearing, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah commands you to render trusts to whom they are due and when you judge between people to judge with justice. Excellent is that which Allah instructs you. Indeed, Allah is ever Hearing and Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:58] Verily, God commands you to restore trusts, that is, the rights entrusted [to you by others], back to their owners: this was revealed when ‘Alī, may God be pleased with him, took the key of the Ka‘ba from its keeper, ‘Uthmān b. Talha al-Hajabī, by force, upon the arrival of the Prophet (s) in Mecca in the year of the Conquest, after he [‘Uthmān] had tried to prevent him [‘Alī from taking it] saying, ‘If I had known that he was the Messenger of God, I would not have prevented him’. The Messenger of God (s) then ordered him [‘Alī] to give it back to him [‘Uthmān] saying to him, ‘Here you are, [it is yours] now and always’. He [‘Uthmān] was amazed by this, whereupon ‘Alī recited to him this verse, and he accepted Islam. Upon his death, he [‘Uthmān] gave it [the key] to his brother, Shayba, and thus it remained in [the keep of] his descendants. Although the verse was revealed regarding a specific occasion, it holds true in general on account of the plural person [to which it is addressed]. And when you judge between people, He commands, that you judge with justice. Excellent is (ni‘immā, the mīm of ni‘ima has been assimilated with the indefinite particle mā, which is the object described, in other words, na‘ima shay’an, ‘an excellent thing [is]’) the admonition God gives you, to restore a trust and to judge with justice. God is ever Hearer, of what is said, Seer, of what is done.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي قصد منه الإفاضة في بيان شرائع العدل والحكم ، ونظام الطاعة ، وذلك من الأغراض التشريعية الكبرى التي تضمّنتها هذه السورة ، ولا يتعيّن تطلّب المناسبة بينه وبين ما سبقه ، فالمناسبة هي الانتقال من أحكام تشريعية إلى أحكام أخرى في أغراض أخرى . وهنا مناسبة ، وهي أنّ ما استطرد من ذكر أحوال أهل الكتاب في تحريفهم الكلم عن مواضعه ، وليّهم ألسنتهم بكلمات فيها توجيه من السبّ ، وافترائهم على الله الكذب ، وحسدهم بإنكار فضل الله إذ آتاه الرسول والمؤمنين ، كلّ ذلك يشتمل على خيانة أمانة الدين ، والعلم ، والحقّ ، والنعمة ، وهي أمانات معنويّة ، فناسب أن يعقب ذلك بالأمر بأداء الأمانة الحسيّة إلى أهلها ويتخلّص إلى هذا التشريع .وجملة { إنّ الله يأمركم } صريحة في الأمر والوجوب ، مثل صراحة النهي في قوله في الحديث « إنّ الله ينهاكم أن تحلفوا بآبائكم » . ( وإنّ ) فيها لمجرد الاهتمام بالخبَر لظهور أنّ مثل هذا الخبر لا يقبل الشكّ حتّى يؤكّد لأنّه إخبار عن إيجاد شيء لا عن وجوده ، فهو والإنشاء سواء .والخطاب لكلّ من يصلح لتلقّي هذا الخطاب والعمل به من كلّ مؤتمن على شيء ، ومن كلّ من تولّى الحكم بين الناس في الحقوق .والأداء حقيقة في تسليم ذات لمن يستحقّها ، يقال : أدّى إليْه كذا ، أي دفعه وسلّمه ، ومنه أداء الدَّين . وتقدّم في قوله تعالى : { من إن تأمنّه بقنطار يؤدّه إليك } في سورة آل عمران ( 75 ) . وأصل أدَّى أن يكون مضاعفَ أدَى بالتخفيف بمعنى أوصل ، لكنّهم أهمْلوا أدى المخفّف واستغنوا عنه بالمضاعف .ويطلق الأداء مجازاً على الاعتراف والوفاء بشيء . وعلى هذا فيطلق أداء الأمانة على قَول الحقّ والاعتراف به وتبليغ العلم والشريعة على حقّها ، والمراد هنا هو الأوّل من المعنيين ، ويعرف حكم غيره منهما أو من أحدهما بالقياس عليه قياس الأدْوَن .والأمانة : الشيء الذي يجعله صاحبه عند شخص ليحفظه إلى أن يطلبه منه ، وقد تقدّم الكلام عليها عند قوله تعالى { فليؤدّ الذي ائتمن أمانَتهُ } في سورة البقرة ( 283 ) . وتطلق الأمانة مجازاً على ما يجب على المكلّف إبلاغه إلى أربابه ومُستحقيه من الخاصّة والعامّة كالدّين والعلم والعهود والجوار والنصيحة ونحوها ، وضدّها الخيانة في الإطلاقين . والأمر للوجوب .والأمانات من صيغ العموم ، فلذلك قال جمهور العلماء فيمن ائتمنه رجل على شيء وكان للأمين حقّ عند المؤتَمَن جحدهُ إيّاه : إنّه لا يجوز له أخذ الأمانة عوض حقّه لأنّ ذلك خيانة ، ومنعه مالك في المدوّنة ، وعن ابن عبد الحكم : أنه يجوز له أن يجحده بمقدار ما عليه له ، وهو قول الشافعي . قال الطبري عن ابن عباس ، وزيد بن أسلم ، وشَهْر بن حَوشب ، ومكحول : أنّ المخاطب ولاة الأمور ، أمرهم أن يؤدّوا الأمانات إلى أهلها .وقيل : نزلت في أمر عثمان بن طلحة بن أبي طلحة .وأهل الأمانة هم مستحقّوها ، يقال : أهل الدار ، أي أصحابها . وذكر الواحدي في أسباب النزول ، بسند ضعيف : أنّ الآية نزلت يوم فتح مكة إذ سَلَّم عثمان بن طلحة ابننِ أبي طلحة العبدري الحَجَبي مفتاحَ الكعبة للنبيء صلى الله عليه وسلم وكانت سدانة الكعبة بيده ، وهو من بني عبد الدار وكانت السدانةُ فيهم ، فسأل العباس بن عبد المطلب من رسول الله أن يجعل له سدانة الكعبة يضمها مع السقاية وكانت السقاية بيده ، وهي في بني هاشم ، فدعا رسول الله صلى الله عليه وسلم عثمان بن طلحة وابنَ عمّه شيبة بن عثمان بن أبي طلحة ، فدفع لهما مفتاح الكعبة وتلا هذه الآية ، قال عمر بن الخطاب : وما كنت سمعتُها منه قبلَ ذلك ، وقال النبي صلى الله عليه وسلم لعثمان بن طلحة « خذوها خالدة تالدة لا ينتزعها منكم إلاّ ظالم » ولم يكن أخْذ النبي صلى الله عليه وسلم مفتاح الكعبة من عثمان بن طلحة أخذَ انتزاع ، ولكنّه أخذه ينتظر الوحي في شأنه ، لأنّ كون المفتاح بيد عثمان بن طلحة مستصحَب من قبل الإسلام ، ولم يغيّر الإسلامُ حوزه إيّاه ، فلمّا نزلت الآية تقرّر حقّ بني عبد الدار فيه بحكم الإسلام ، فبقيت سدانة الكعبة في بني عبد الدار ، ونزل عثمان بن طلحة عنها لابن عمّه شيبةَ بننِ عثمان ، وكانت السدانة من مناصب قريش في الجاهلية فأبطل النبي صلى الله عليه وسلم بعضها في خطبة يوممِ الفتح أو حجّةِ الوداع ، ما عدا السقاية والسدانة .فإطلاق اسم الأمانة في الآية حقيقة ، لأنّ عثمان سلّم مفتاح الكعبة للنبيء عليه الصلاة والسلام دون أن يُسقط حقّه .والأداء حينئذٍ مستعمل في معناه الحقيقي ، لأنّ الحقّ هنا ذات يمكن إيصالها بالفعل لمستحقّها ، فتكون الآية آمرة بجميع أنواع الإيصال والوفاءات ، ومن جملة ذلك دفع الأمانات الحقيقية ، فلا مجاز في لفظ ( تؤدّوا ) .وقوله : { وإذا حكمتم بين الناس أن تحكموا بالعدل } عطف { أن تحكموا } على { أن تؤدّوا } وفصل بين العاطف والمعطوف الظرف ، وهو جائز ، مثل قوله : { وفي الآخرة حسنة } \\[ البقرة : 201 \\] وكذلك في عطف الأفعال على الصحيح : مثل { وتتّخذون مصانع لعلّكم تخلدون وإذا بطشتم بطشتم جبّارين } \\[ الشعراء : 129 ، 130 \\] .والحكم مصدر حكم بين المتنازعين ، أي اعتنى بإظهار المحقّ منهما من المبطل ، أو إظهار الحقّ لأحدهما وصرَّح بذلك ، وهو مشتقّ من الحُكْم بفتح الحاء وهو الردْع عن فعللِ ما لا ينبغي ، ومنه سميّت حَكَمَة اللِّجام ، وهي الحديدة التي تجعل في فم الفرس ، ويقال : أحْكِمْ فُلاناً ، أي أمْسِكْه .والعدل : ضدّ الجور ، فهو في اللغة التسوية ، يقال : عَدَل كذا بكذا ، أي سوّاه به ووازنه عدلاً { ثمّ الذين كفروا بربّهم يعدلون } \\[ الأنعام : 1 \\] ، ثمّ شاع إطلاقه على إيصال الحقّ إلى أهله ، ودفع المعتدي على الحقّ عن مستحقّه ، إطلاقاً ناشئاً عمّا اعتاده الناس أنّ الجور يصدر من الطغاة الذين لا يَعدّون أنفسهم سواء مع عموم الناس ، فهم إن شاءوا عدلوا وأنصفوا ، وإن شاءوا جاروا وظلموا ، قال لبيد :ومقسم يعطي العشيرة حقّها ... ومُغذمر لحقوقها هَضَّامهافأطلق لفظ العدل الذي هو التسوية على تسوية نافعة يحصل بها الصلاح والأمن ، وذلك فك الشيء من يد المعتدي ، لأنّه تظهر فيه التسوية بين المتنازعين ، فهو كناية غالبة . ومَظهر ذلك هو الحكم لصاحب الحقّ بأخذ حقّه ممّن اعتدى عليه ، ولذلك قال تعالى هنا : { إذا حكمتم بين الناس أن تحكموا بالعدل } ، ثم توسّعوا في هذا الإطلاق حتّى صار يطلق على إبلاغ الحقّ إلى ربّه ولو لم يحصل اعتداء ولا نزاع .والعدل : مساواة بين الناس أو بين أفراد أمّة : في تعيين الأشياء لمستحقّها ، وفي تمكين كلّ ذي حقّ من حقّه ، بدون تأخير ، فهو مساواة في استحقاق الأشياء وفي وسائل تمكينها بأيدي أربابها ، فالأوّل هو العدل في تعيين الحقوق ، والثاني هو العدل في التنفيذ ، وليس العدل في توزيع الأشياء بين الناس سواء بدون استحقاق .فالعدل وسط بين طرفين ، هما : الإفراط في تخويل ذي الحقّ حقّه ، أي بإعطائه أكثر من حقّه ، والتفريط في ذلك ، أي بالإجحاف له من حقّه ، وكلا الطرفين يسمّى جوراً ، وكذلك الإفراط والتفريط في تنفيذ الإعطاء بتقديمه على وقته ، كإعطاء المال بيد السفيه ، أو تأخيره كإبقاء المال بيد الوصي بعد الرشد ، ولذلك قال تعالى : { ولا تؤتوا السفهاء أموالكم إلى قوله : فإن آنستم منهم رشداً فادفعوا إليهم أموالهم } \\[ النساء : 5 ، 6 \\] ؛ فالعدل يدخل في جميع المعاملات . وهو حسن في الفطرة لأنّه كما يصدُّ المعتدي عن اعتدائه ، كذلك يصدّ غيره عن الاعتداء عليه ، كما قال تعالى : { لا تَظْلِمُون ولا تُظلمون } \\[ البقرة : 279 \\] . وإذ قد كان العدل بهذه الاعتبارات تجول في تحديده أفهام مخطئة تعيّن أن تسَنّ الشرائع لضبطه على حسب مدارك المشرّعين ومصطلحات المشَرَّع لهم ، على أنّها معظمها لم يسلم من تحريف لحقيقة العدل في بعض الْاحوال ، فإنّ بعض القوانين أسّست بدافعة الغضب والأنانية ، فتضمّنت أخطاء فاحشة مثل القوانين التي يمليها الثوار بدافع الغضب على من كانوا متَولين الأمور قبلهم ، وبعض القوانين المتفرّعة عن تخيّلات وأوهام ، كقوانين أهل الجاهلية والأمم العريقة في الوثنية .ونجد القوانين التي سنّها الحكماء أمكن في تحقيق منافع العدل مثل قوانين أثينة وإسبَرطة ، وأعلى القوانين هي الشرائع الألهية لمناسبتها لحال من شرعت لأجلهم ، وأعظمها شريعةُ الإسلام لابتنائها على أساس المصالح الخالصة أو الراجحة ، وإعراضها عن أهواء الأمم والعوائد الضالّة ، فإنّها لا تعبأ بالأنانية والهوى ، ولا بعوائد الفساد ، ولأنّها لا تبنى على مصالح قبيلة خاصّة ، أو بلد خاصّ ، بل تبتنى على مصالح النوع البشري وتقويمه وهديه إلى سواء السبيل ، ومن أجل هذا لم يزل الصالحون من القادة يدوّنون بيان الحقوق حفظاً للعدل بقدر الإمكان وخاصّة الشرائع الإلهية ، قال تعالى :{ لقد أرسلنا رُسُلَنا بالبيّنات وأنزلنا معهم الكتابَ والميزان ليقوم الناس بالقسط } \\[ الحديد : 25 \\] أي العدل . فمنها المنصوص عليه على لسان رسول البشرية ومنها ما استنبطه علماء تلك الشريعة فهو مدرج فيها وملحق بها .وإنّما قيّد الأمر بالعدل بحالة التصدّي للحكم بين الناس ، وأُطلق الأمر بردّ الأمانات إلى أهلها عن التقييد : لأنّ كلّ أحد لا يخلو من أن تقع بيده أمانة لغيره لا سيما على اعتبار تعميم المراد بالأمانات الشامل لما يجب على المرء إبلاغه لمستحقّه كما تقدّم ، بخلاف العدل فإنّما يؤمر به ولاة الحكم بين الناس ، وليس كلّ أحد أهلاً لتولّي ذلك . فتلك نكتة قوله : { وإذا حكمتم بين الناس } . قال الفخر : قوله : { وإذا حكمتم } هو كالتصريح بأنّه ليس لجميع الناس أن يشرّعوا في الحكم بل ذلك لبعضهم ، فالآية مجملة في أنّه بأي طريق يصير حاكماً ولمّا دلّت الدلائل على أنّه لا بد للأمّة من إمام وأنّه ينصب القضاة والولاة صارت تلك الدلائل كالبيان لهذه الآية .وجملة { إنّ الله نعمّا يعظكم به } واقعة موقع التحريض على امتثال الأمر ، فكانت بمنزلة التعليل ، وأغنت ( إنَّ ) في صدر الجملة عن ذكر فَاء التعقيب ، كما هو الشأن إذا جاءت ( إنَّ ) للاهتمام بالخبر دون التأكيد .و ( نعمّا ) أصله ( نعْمَ ما ) رُكّبت ( نعم ) مع ( ما ) بعد طرححِ حركة الميم الأولى وتنزيلها منزلة الكلمة الواحدة ، وأدغم الميمان وحرّكت العين الساكنة بالكسر للتخلّص من التقاء الساكنين .و ( ما ) جَوّز النحاة أن تكون اسم موصول ، أو نكرة موصوفة ، أو نكرة تامّة والجملة التي بعد ( ما ) تجري على ما يناسب معنى ( مَا ) ، وقيل : إنّ ( ما ) زائدة كافّةٌ ( نعمَ ) عن العمل .والوعظ : التذكير والنصح ، وقد يكون فيه زجر وتخويف .وجملة { إنّ الله كان سميعاً بصيراً } أي عليماً بما تفعلون وما تقولون ، وهذه بشارة ونذارة .\n\n",
      "translations": [
        {
          "translation": "Regarding the key that the Prophet (pbuh) took from 'Uthman Ibn Talhah as a deposit, Allah commanded His Messenger to give back deposits to their owner, saying: (Lo! Allah commandeth you that ye restore deposits) to give back the key (to their owners) to 'Uthman Ibn Talhah, (and, if ye judge between mankind) between 'Uthman Ibn Talhah and 'Abbas Ibn 'Abd al-Muttalib, (that you judge justly) that you give back to 'Uthman and the providing of water (siqaya) to al-'Abbas. (Lo! comely is this which Allah admonisheth you) comely is this which Allah commands you, of giving back deposits to their owners and judging justly. (Lo! Allah is ever Hearer) when al-'Abbas said: Messenger of Allah! give me both the key and the providing of water, (Seer) of what 'Uthman Ibn Talhah did when he refused to give the key and said: By Allah's trust! Give me my right, Messenger of Allah!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إنّ الله يأمركم أن تؤدّوا الأمانات إلى أهلها } أي: حق كلّ ذي حق إليه بتوفية حق الاستعداد أولاً\n ثم بتوفية حقوق القوى كلها من كمالاتها التي تقتضيها\n ثم بتوفية حق الله تعالى من أداء الصفات إليه\n ثم أداء الوجود فتكونوا فانين في التوحيد\n فإذا رجعتم إلى البقاء بعد الفناء\n وحكمتم بين الناس\n كنتم قائمين في الأشياء بالله\n قوّامين بالقسط\n متصفين بعدل الله بحيث لا يمكن صدور الجور منكم\n وأقلّ الدرجات في العدل هو المحو في الصفات\n إذ القائم بالنفس لا يقدر على العدل أبداً { إنّ الله كان سمِيعاً } بأقوالكم فيما بين الناس من المحاكمات\n هل هي صائبة بالحق أم فاسدة بالنفس؟ { بَصِيراً } بأعمالكم\n هل تصدر من صفات نفوسكم أو من صفات الحق؟",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nواعلموا أيها المبشرون بهذه البشارة العظمى { إِنَّ ٱللَّهَ } المبشر بأمثاله { يَأْمُرُكُمْ أَن تُؤدُّواْ } وتدفعوا { ٱلأَمَانَاتِ } من الأحوال والشهادات وسائر حقوق العباد { إِلَىۤ أَهْلِهَا وَ } يأمركم أيضاً { إِذَا حَكَمْتُمْ بَيْنَ ٱلنَّاسِ } المتخاصمين في الوقائع { أَن تَحْكُمُواْ بِٱلْعَدْلِ } بالإنصاف والسوية بلا ميل إلى جانب أحد من المتخاصمين { إِنَّ ٱللَّهَ } المصلح لأحوالكم { نِعِمَّا } نعم شيئاً { يَعِظُكُمْ بِهِ } ويأمركم بامتثاله { إِنَّ ٱللَّهَ } المطلع على جميع حالاتكم { كَانَ سَمِيعاً } لجميع أقوالكم { بَصِيراً } [النساء: 58] لنياتكم وأفعالكم فيها\n لا يعزب عنه مثال ذرة في الأرض ولا في السماء ولا أصغر من ذلك ولا أكبر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: \" ما \" في { نِعِمَّا } تمميز أو فاعل، والمخصوص محذوف، أي نعم شيئًا شيء يعظكم به، أو نعم الذي يعظكم به ذلك الأمر، وهو رد الأمانات والعدل في الحكومات. قال زيد بن أسلم وشهر بن حوشب: نزلت الآية في شأن الأمراء. هـ. قلت: وأن نزلت في شأن عثمان بن طلحة ـ سَادِن الكَعبَةِ فهي عامة. والمخاطب بذلك أولاً الرسول صلى الله عليه وسلم وهو سيد الأمراء، أمره الحق ـ تعالى ـ أن يرد المفاتح إلى عثمان، وذلك أن عثمان أغلق باب الكعبة يوم فتح مكة وأبى أن يدفعها إلى رسول الله صلى الله عليه وسلم ليدخل الكعبة، وقال: لو عَلمِتُ أنه رَسُول الله ما منعتُهُ، فَلَوى عَلِيَّ يده، وأخذّها مِنهُ، فدخل رسول الله صلى عليه وسلم وصَلّى رَكعَتينِ، فلما خَرَجَ سألُه العباس أن يُعطيه المفتَاح، وَيَجمَعَ له السِّدَانَةَ والسِّقَايةَ، فأمره اللهُ ـ تعالى ـ أن يرده إليه، فأمر عَلِيًّا بأن يَرُدَّه وَيَعتَذِر إليه، وكان ذلك سببًا لإسلام عثمان، ونزل الأمر بأن السِّدَانَة في أولاده أبدًا. يقول الحقّ جلّ جلاله: { إن الله يأمركم } ، يا معشر الأمراء، أن تردوا { الأمانات إلى أهلها } من أنفسكم، أو من رعيتكم فتُنصفوا المظلوم من الظالم، حتى يؤدي ما ائتُمن عليه من دَينٍ، أو وديعة، أو غصب، أو سرقة، أو غير ذلك من حقوق العباد، بعضهم من بعض، وأن تؤدوا الزكاة إلى من يستحقها، وتصرفوا بيت المال فيمن يستحقه، لا تظلموا أهلها، ولا تضيعوا منها شيئاً في غير مستحقها. { و } يأمركم { إذا حكمتم بين الناس أن تحكموا بالعدل } في من يَنفُذُ عليه حكمُكُم، { إن الله نعمًا يعظكم به } أي: إن الله يعظكم بأمر نعم ما هو، { إن الله كان سميعًا بصيرًا } لا يخفى عليه أحكامكم، ولا ما أخفيتم من أمانات غيركم. الإشارة: أمر الحقّ ـ جلّ جلاله ـ شيوخ التربية أن يؤدوا السر إلى من يستحقه من الفقراء، إذا تحققوا أهليتهم له، بحيث تخلوا عن الرذائل، كالحسد والكبر وغيرهما، وتحلوا بالفضائل، كسلامة الصدر وسخاوة النفوس وحسن الخلق، وغير ذلك من أوصاف الكمال، فإن تحققوا بالتخلية والتحلية، استحقوا الاطلاع على أسرار الربوبية، التي هي أمانات عند أهل الخصوصية، وأمرهم أن يحكموا بين الفقراء بالعدل، فيمدوا كلاً على قدر صِدقِه وخِدمَتِه، والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:18",
      "similarity": 0.7468060500614458
    },
    {
      "verse": "2:178",
      "similarity": 0.4490774200711771
    },
    {
      "verse": "2:283",
      "similarity": 0.3324480738613323
    },
    {
      "verse": "16:90",
      "similarity": 0.3166579647035731
    },
    {
      "verse": "65:2",
      "similarity": 0.30966918503481905
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004058.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004058.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:58.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}