{
  "chapter": "النساء",
  "text": "واذا قيل لهم تعالوا۟ الى ما انزل الله والى الرسول رايت المنفقين يصدون عنك صدودا",
  "translations": [
    {
      "translation": "When they are told, 'Come to what Allah has sent down and to the Messenger,' you see the hypocrites turning away from you completely.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told: \"Come to that which God has revealed, and to the Prophet,\" you should see the hypocrites, how they hesitate and turn their faces away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told: 'Come to that which Allah has revealed, and come to the Messenger', you will notice the hypocrites turning away from you in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the (hypocrites) are told to refer to God's revelations and to the Messenger, they try to find excuses to stay away from you (Muhammad).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are told, “Come towards the Book sent down by Allah and to the Noble Messenger,” you will see that the hypocrites turn their faces away from you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"Come to what Allah has sent down and to the Messenger,\" you see the hypocrites turn away from you with aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: Come to what Allah has revealed and to the Apostle, you will see the hypocrites turning away from you with (utter) aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, 'Come now to what God has sent down, and the Messenger,' then thou seest the hypocrites barring the way to thee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said unto them: Come unto that which Allah hath revealed and unto the messenger, thou seest the hypocrites turn from thee with aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, \"Come to what God has sent down and to the Messenger,\" you see the hypocrites turn away from you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it said unto them come unto that which Allah hath sent down and unto the apostle, thou wilt see the hypocrites hang back far from thee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, ‘Come to what Allah has sent down and [come] to the Apostle,’ you see the hypocrites keep away from you aversely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: \"Come to what Allah hath revealed, and to the Messenger\": Thou seest the Hypocrites avert their faces from thee in disgust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"Come to what Allah has sent down and to the Messenger (Muhammad SAW),\" you (Muhammad SAW) see the hypocrites turn away from you (Muhammad SAW) with aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: 'Come to what Allah has sent down and to the Messenger' you see the hypocrites completely barring the way to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Come to what God has revealed, and to the Messenger,” you see the hypocrites shunning you completely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, \"Come to what Allah has revealed and to the Messenger,\" you see the hypocrites turning away from you in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:61] And when it is said to them, ‘Come to what God has revealed, as regards rulings in the Qur’ān, and the Messenger’, that he may judge between you, you see the hypocrites turn away from you vehemently, to others.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله { وإذا قيل لهم تعالوا } الآية أي إذا قيل لهم احضُروا أو إيتوا . فإنّ ( تعال ) كلمة تدلّ على الأمر بالحضور والإقبال ، فمفادها مفاد حرف النداء إلاّ أنّها لا تنبيه فيها . وقد اختلف أيمّة العربية في أنّه فعل أو اسمُ فعللٍ ، والأصحّ أنّه فعل لأنّه مشتقّ من مادّة العلوّ ، ولذلك قال الجوهري في «الصحاح» «والتعالي الارتفاع» ، تقول منه ، إذا أمرت : «تعال يا رجل» ، ومثله في «القاموس» ، ولأنّه تتّصل به ضمائر الرفع ، وهو فعل مبني على الفتح على غير سنّة فِعل الأمر ، فذلك البناء هو الذي حدا فريقاً من أهل العربية على القول بأنّه اسم فعل ، وليس ذلك القول ببعيد ، ولم يَرِد عن العرب غير فتح اللام ، فلذلك كان كسر اللام في قول أبي فِراس :أيا جارتَا ما أنصف الدهر بيننا ... تعالي أقاسمك الهموم تَعاليبكسر لام القافية المكسورة ، معدوداً لحناً .وفي «الكشّاف» أنّ أهل مكة أي في زمان الزمخشري يقولون تعالِي للمرأة . فذلك من اللحن الذي دخل في اللغة العربية بسبب انتشار الدُّخلاء بينهم .ووجه اشتقاق تعالَ من مادّة العلوّ أنّهم تخيّلوا المنادي في علوّ والمنادي ( بالفتح ) في سفل ، لأنّهم كانوا يجعلون بيوتهم في المرتفعات لأنّها أحصن لهم ، ولذلك كان أصله أن يدلّ على طلب حضور لنفع . قال ابن عطية في تفسير في قوله تعالى : { وإذا قيل لهم تعالوا إلى ما أنزل الله وإلى الرسول قالوا حسبنا ما وجدنا عليه آباءنا } في سورة المائدة ( 104 ) : «تعال نداء ببرّ ، هذا أصله ، ثم استعمل حيث البرّ وحيث ضدّه» . وقال في تفسير آية النساء : «وهي لفظة مأخوذة من العلوّ لمّا استعملت في دعاء الإنسان وجلبه صيغت من العلوّ تحسيناً للأدب كما تقول : ارتفع إلى الحقّ ونحوه» . وأعلم أنّ تعال لمّا كانت فعلاً جامداً لم يصحّ أن يصاغ منه غير الأمر ، فلا تقول : تعاليت بمعنى حضرت ، ولا تنهى عنه فتقول : لا تتعال . قال في «الصحاح» «ولا يجوز أن يقال منه تعاليت ولا ينهى عنه» . وفي «الصحاح» عقبه «وتقول : قد تعاليت وإلى أي شيء أتعالى» يعني أنّه يتصرّف في خصوص جواب الطلب لمن قال لك تعال ، وتبعه في هذا صاحب «اللسان» وأغفل العبَارة التي قبله ، وأمّا صاحب «تاج العروس» فربما أخطأ إذ قال : «قال الجوهري : ولا يجوز أن يقال منه : تعاليت وإلى أي شيء أتعالى» ولعلّ النسخة قد وقع فيها نقص أو خطأ من الناسخ لظنّه في العبارة تكريراً ، وإنّما نبّهت على هذا لئلاّ تقع في أخطاء وحيرة .و ( تعالوا ) مستعمل هنا مجازاً ، إذ ليس ثمّة حضور وإتيان ، فهو مجاز في تحكيم كتاب الله وتحكيم الرسول في حضوره ، ولذلك قال : { إلى ما أنزل الله } إذ لا يحكم الله إلاّ بواسطة كلامه ، وأمّا تحكيم الرسول فأريد به تحكيم ذاته لأنّ القوم المخبر عنهم كانوا من المنافقين وهم بالمدينة في حياة الرسول صلى الله عليه وسلم و ( صدودا ) مفعول مطلق للتوكيد ، ولقصد التوصّل بتنوين { صدودا } لإفادة أنّه تنوين تعظيم .\n\n",
      "translations": [
        {
          "translation": "(And then it is said unto them) to Hatib Ibn Abi Balta'ah, the hypocrite, who had a dispute with al-Zubayr Ibn al-'Awwam, the cousin of the Prophet (pbuh): (Come unto that which Allah hath revealed) come to the ruling which Allah has revealed in the Qur'an (and unto the messenger) and to the judgement of the messenger, (thou seest the hypocrites) Hatib Ibn Abi Balta'ah (turn from you with aversion) turn away from your judgement in complete rejection.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِذَا قِيلَ لَهُمْ } إمحاضاً للنصح { تَعَالَوْاْ } هلموا { إِلَىٰ مَآ أَنزَلَ ٱللَّهُ } من الكتاب الجامع لجميع الكتب المبينة لطريق الحق\n الهادية إلى توحيده { وَإِلَى } متابعة { ٱلرَّسُولِ } المبلغ الكاشف لكم أحكامه { رَأَيْتَ ٱلْمُنَٰفِقِينَ } والذين في قلوبهم مرض { يَصُدُّونَ } يعرضون { عَنكَ } وعن عظتك وتذكيرك { صُدُوداً } [النساء: 61] إعراضاً نائشاً عن محض القساوة والفساد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { رأيت المنافقين } \n وضع الظاهر موضع المضمر تسجيلاً عليهم بالنفاق وذمًا لهم به\n وكان القياس: رأيتهم\n و { صدودًا }: مصدر\n أو اسم مصدر الذي هو الصد\n والفرق بينه وبين المصدر: أن المصدر اسم للمعنى الذي هو الحدث\n واسم المصدر اسم للفظ المحسوس",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:87",
      "similarity": 0.4988492636099075
    },
    {
      "verse": "47:1",
      "similarity": 0.47889888321658863
    },
    {
      "verse": "43:37",
      "similarity": 0.46664516490843666
    },
    {
      "verse": "4:167",
      "similarity": 0.4613035815851323
    },
    {
      "verse": "27:43",
      "similarity": 0.4605171178872982
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004061.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004061.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:61.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}