{
  "chapter": "النساء",
  "text": "واذا قيل لهم تعالوا۟ الى ما انزل الله والى الرسول رايت المنفقين يصدون عنك صدودا",
  "translations": [
    {
      "translation": "When they are told, 'Come to what Allah has sent down and to the Messenger,' you see the hypocrites turning away from you completely.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told: \"Come to that which God has revealed, and to the Prophet,\" you should see the hypocrites, how they hesitate and turn their faces away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told: 'Come to that which Allah has revealed, and come to the Messenger', you will notice the hypocrites turning away from you in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the (hypocrites) are told to refer to God's revelations and to the Messenger, they try to find excuses to stay away from you (Muhammad).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they are told, “Come towards the Book sent down by Allah and to the Noble Messenger,” you will see that the hypocrites turn their faces away from you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"Come to what Allah has sent down and to the Messenger,\" you see the hypocrites turn away from you with aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: Come to what Allah has revealed and to the Apostle, you will see the hypocrites turning away from you with (utter) aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, 'Come now to what God has sent down, and the Messenger,' then thou seest the hypocrites barring the way to thee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said unto them: Come unto that which Allah hath revealed and unto the messenger, thou seest the hypocrites turn from thee with aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, \"Come to what God has sent down and to the Messenger,\" you see the hypocrites turn away from you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it said unto them come unto that which Allah hath sent down and unto the apostle, thou wilt see the hypocrites hang back far from thee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, ‘Come to what Allah has sent down and [come] to the Apostle,’ you see the hypocrites keep away from you aversely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: \"Come to what Allah hath revealed, and to the Messenger\": Thou seest the Hypocrites avert their faces from thee in disgust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"Come to what Allah has sent down and to the Messenger (Muhammad SAW),\" you (Muhammad SAW) see the hypocrites turn away from you (Muhammad SAW) with aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: 'Come to what Allah has sent down and to the Messenger' you see the hypocrites completely barring the way to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Come to what God has revealed, and to the Messenger,” you see the hypocrites shunning you completely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, \"Come to what Allah has revealed and to the Messenger,\" you see the hypocrites turning away from you in aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:61] And when it is said to them, ‘Come to what God has revealed, as regards rulings in the Qur’ān, and the Messenger’, that he may judge between you, you see the hypocrites turn away from you vehemently, to others.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And then it is said unto them) to Hatib Ibn Abi Balta'ah, the hypocrite, who had a dispute with al-Zubayr Ibn al-'Awwam, the cousin of the Prophet (pbuh): (Come unto that which Allah hath revealed) come to the ruling which Allah has revealed in the Qur'an (and unto the messenger) and to the judgement of the messenger, (thou seest the hypocrites) Hatib Ibn Abi Balta'ah (turn from you with aversion) turn away from your judgement in complete rejection.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِذَا قِيلَ لَهُمْ } إمحاضاً للنصح { تَعَالَوْاْ } هلموا { إِلَىٰ مَآ أَنزَلَ ٱللَّهُ } من الكتاب الجامع لجميع الكتب المبينة لطريق الحق، الهادية إلى توحيده { وَإِلَى } متابعة { ٱلرَّسُولِ } المبلغ الكاشف لكم أحكامه { رَأَيْتَ ٱلْمُنَٰفِقِينَ } والذين في قلوبهم مرض { يَصُدُّونَ } يعرضون { عَنكَ } وعن عظتك وتذكيرك { صُدُوداً } [النساء: 61] إعراضاً نائشاً عن محض القساوة والفساد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { رأيت المنافقين } ، وضع الظاهر موضع المضمر تسجيلاً عليهم بالنفاق وذمًا لهم به\n وكان القياس: رأيتهم، و { صدودًا }: مصدر، أو اسم مصدر الذي هو الصد، والفرق بينه وبين المصدر: أن المصدر اسم للمعنى الذي هو الحدث، واسم المصدر اسم للفظ المحسوس، و { يحلفون } حال\n و { في أنفسهم } يتعلق بقُل، وقيل ببليغًا\n وهو ضعيف لأن الصفات لا يتقدم عليها معمولها، اللهم إلا أن يتوسع في الظروف\n يقول الحقّ جلّ جلاله: { ألم تر } يا محمد { إلى الذين يزعمون أنهم آمنوا بما أنزل إليك وما أنزل من قبلك } وهم المنافقون، { يريدون أن يتحاكموا إلى الطاغوت } ، كعب بن الأشرف لفرط طغيانه\n وفي معناه كل من يحكم بالباطل، { وقد أُمروا أن يكفروا به } ، ويؤمنوا بالله ويرضوا بحكمه\n { ويريد الشيطان أن يضلهم ضلالاً بعيدًا } ، بأن يصرفهم عن حكم الله ورسوله\n قال ابن عباس: إنَّ منافقًا خَاصَمَ يَهُودِيًّا فَدَعَاهُ اليَهُوديُّ إلى النَّبِيَّ صلى الله عليه وسلم، ودعاه المنافق إلى كعب بن الأشرف، ثم اختصما إلى رسول الله صلى الله عليه وسلم، فحكم لليهودي بالحق فلم يرض المنافق، وقال: نتحاكم إلى عُمَر، فقال اليهودي: نعم فذهبا إلى عمر رضي الله عنه فقال اليهودي: قضى لي رسول الله صلى الله عليه وسلم فلم يرضى بقضائه وخاصم إليك، فقال عمر للمنافق: أكذلك؟\n قال: نعم، فقال: على رسلكما حتى أخرج إليكما، فدخل وأخذ سيفه فخرج، فضرب به عنق المنافق حتى برد، وقال: هكذا أقضي لمن لم يرضَ بقضاء الله ورسوله، فنزلت الآية\n\n وقال جبريل رضي الله عنه: إن عمر فرّق بين الحق والباطل\n فسُمي الفاروق\n { وإذا قيل لهم تعالوا إلى ما أنزل الله وإلى الرسول رأيت المنافقين } أي: بعضَهم، { يصدون عنك } غير راضين بحكمك { صدودًا } عظيمًا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:87",
      "similarity": 0.4988492636099075
    },
    {
      "verse": "47:1",
      "similarity": 0.47889888321658863
    },
    {
      "verse": "43:37",
      "similarity": 0.46664516490843666
    },
    {
      "verse": "4:167",
      "similarity": 0.4613035815851323
    },
    {
      "verse": "27:43",
      "similarity": 0.4605171178872982
    }
  ]
}