{
  "chapter": "النساء",
  "text": "فكيف اذا اصبتهم مصيبةۢ بما قدمت ايديهم ثم جاءوك يحلفون بالله ان اردنا الا احسنا وتوفيقا",
  "translations": [
    {
      "translation": "How will it be when a disaster strikes them because of what they have done, and then they come to you swearing by Allah: 'We desired nothing but good and reconciliation'?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How shall it be when they suffer misfortunes for their own misdeeds? Then they will come to you swearing by God and saying: \"We wish for nothing but good and amity.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But what happens when some misfortune visits them because of their own misdeeds? Then, they come to you swearing by Allah, saying: 'We wanted nothing but to do good and to bring about conciliation (between the two parties)'.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What would happen if they were to be afflicted by a disaster brought about by their own hands? They would then come to you swearing by God, \"We only wanted to bring about friendship and reconciliation.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What will be their state, if some calamity befalls them as a result of what their own hands have sent before them – and then they come to you (O dear Prophet Mohammed – peace and blessings be upon him), swearing by Allah that, “Our goal was only to do good and create harmony\"?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How then, when a catastrophe befalls them because of what their hands have sent forth, they come to you swearing by Allah, \"We meant no more than goodwill and conciliation!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But how will it be when misfortune befalls them on account of what their hands have sent before? Then they will come to you swearing by Allah: We did not desire (anything) but good and concord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How shall it be, when they are visited by an affliction for what their own hands have forwarded, then they come to thee swearing by God, 'We sought only kindness and conciliation'?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How would it be if a misfortune smote them because of that which their own hands have sent before (them)? Then would they come unto thee, swearing by Allah that they were seeking naught but harmony and kindness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How will it be when an affliction befalls them because of what they themselves have done? They will come to you, swearing by God, saying that they were seeking nothing but goodwill and conciliation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How then, when some ill befalleth them because of that which their hands have sent forth and then they come to thee swearing by Allah: we meant naught save kindness and concord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But how will it be when an affliction visits them because of what their hands have sent ahead? Then they will come to you, swearing by Allah, ‘We desired nothing but to do good and to bring about comity.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How then, when they are seized by misfortune, because of the deeds which they hands have sent forth? Then their come to thee, swearing by Allah: \"We meant no more than good-will and conciliation!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How then, when a catastrophe befalls them because of what their hands have sent forth, they come to you swearing by Allah, \"We meant no more than goodwill and conciliation!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How would it be if some affliction hit them for what their hands have forwarded? Then, they would come to you swearing by Allah, 'We sought only kindness and conciliation'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How about when a disaster strikes them because what their hands have put forward, and then they come to you swearing by God: “We only intended goodwill and reconciliation”?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So how [will it be] when disaster strikes them because of what their hands have put forth and then they come to you swearing by Allah, \"We intended nothing but good conduct and accommodation.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:62] How would it be, [what] would they do, when an affliction, a punishment, befalls them for what their own hands have sent before them, of unbelief and acts of disobedience, that is to say, would they then be able to turn away and escape it? No! They then come to you (thumma jā’ūka, a supplement to yasuddūn, ‘they turn away’ [of the previous verse]), swearing by God that, in turning to other than you for arbitration, ‘We sought only virtue, settlement, and harmony’, reconciliation between the disputing parties by [any] approximate judgement without regard for the painful truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(How would it be) what shall they do (if a misfortune) a punishment (smote them because of that which 92 their own hands have sent before (them)) because of turning away (they come unto you) after that, (swearing by Allah) i.e. Hatib swearing by Allah (that they were seeking naught) when they turned away (but harmony) in speech (and kindness) correctness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَكَيْفَ } لا يكونون منافقين إنهم { إِذَآ أَصَٰبَتْهُمْ مُّصِيبَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ } من نفاقهم مع المؤمنين وتحاكمهم إلى الطاغوت\n وعدم الرضا بحكمك وقضائك { ثُمَّ } بعدما أصابوا { جَآءُوكَ } معتذرين لك { يَحْلِفُونَ بِٱللَّهِ إِنْ أَرَدْنَآ } أي: ما قصدنا { إِلاَّ إِحْسَٰناً } طلباً للخير من الله لإخواننا المؤمنين { وَتَوْفِيقاً } [النساء: 62] بينهم\n\n\nعن ابن عباس رضي الله عنهما: أن منافقاً نازع يهودياً\n فدعاه اليهودي إلى رسول الله صلى الله عليه وسلم والمنافق إلى كعب بن الأشرف\n ثم بعد النزاع والجدال احتكما إلى رسول الله صلى الله عليه وسلم\n فحكم لليهودي فلم يرضى المنافق بقضائه\n فقال: نتحاكم إلى عمر رضي الله عنه\n فحضروا عنده فقال اليهودي لعمر رضي الله عنه: قضى لي رسول الله صلى الله عليه وسلم فلم يرض\n فخاصم إليك\n فقال عمر للمنافق: أهكذا\n قال: نعم\n فقال: مكانكما حتى أخرج\n فدخل بيته\n وأخذ سيفه\n فخرج فضرب به عنق المنافق\n فقال: هكذا أقضي لمن لم يرض بقضاء الله وقضاء رسوله\n فنزل جبريل وقال: إن عمر رضي الله عنه قد فرق بين الحق والباطل\n فسمي الفاروق\n\n\n{ أُولَـٰئِكَ } المنهمكون في الغي والضلال هم { ٱلَّذِينَ يَعْلَمُ ٱللَّهُ مَا فِي قُلُوبِهِمْ } من النفاق والشقاق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { يحلفون } حال\n و { في أنفسهم } يتعلق بقُل\n وقيل ببليغًا\n وهو ضعيف لأن الصفات لا يتقدم عليها معمولها\n اللهم إلا أن يتوسع في الظروف\n يقول الحقّ جلّ جلاله: { ألم تر } يا محمد { إلى الذين يزعمون أنهم آمنوا بما أنزل إليك وما أنزل من قبلك } وهم المنافقون\n { يريدون أن يتحاكموا إلى الطاغوت } \n كعب بن الأشرف لفرط طغيانه\n وفي معناه كل من يحكم بالباطل\n { وقد أُمروا أن يكفروا به } \n ويؤمنوا بالله ويرضوا بحكمه\n { ويريد الشيطان أن يضلهم ضلالاً بعيدًا } \n بأن يصرفهم عن حكم الله ورسوله\n قال ابن عباس: إنَّ منافقًا خَاصَمَ يَهُودِيًّا فَدَعَاهُ اليَهُوديُّ إلى النَّبِيَّ صلى الله عليه وسلم\n ودعاه المنافق إلى كعب بن الأشرف\n ثم اختصما إلى رسول الله صلى الله عليه وسلم\n فحكم لليهودي بالحق فلم يرض المنافق\n وقال: نتحاكم إلى عُمَر\n فقال اليهودي: نعم فذهبا إلى عمر رضي الله عنه فقال اليهودي: قضى لي رسول الله صلى الله عليه وسلم فلم يرضى بقضائه وخاصم إليك\n فقال عمر للمنافق: أكذلك؟\n قال: نعم\n فقال: على رسلكما حتى أخرج إليكما\n فدخل وأخذ سيفه فخرج\n فضرب به عنق المنافق حتى برد\n وقال: هكذا أقضي لمن لم يرضَ بقضاء الله ورسوله\n فنزلت الآية\n\n وقال جبريل رضي الله عنه: إن عمر فرّق بين الحق والباطل\n فسُمي الفاروق\n { وإذا قيل لهم تعالوا إلى ما أنزل الله وإلى الرسول رأيت المنافقين } أي: بعضَهم\n { يصدون عنك } غير راضين بحكمك { صدودًا } عظيمًا\n { فكيف } يكون حالهم { إذا أصابتهم مصيبة } كقتل عمر المنافقَ\n بسبب ما قدمت { أيديهم } من عدم الرضى بحكم الله\n { ثم جاؤوك } يطلبون ديّة صاحبهم\n { يحلفون بالله إن أردنا } بالإنصراف إلى عمر { إلا أحسانًا } منه بالخصمين\n { وتوفيقاً } بينهما\n قطعًا للنزاع بينهما\n قال تعالى: { أولئك الذين يعلم الله ما في قلوبهم } من النفاق\n فلا يغني عنهم الكتمان والحلف الكاذب من الله شيئًا\n أو يعلم الله ما في قلوبهم من الطمع في الدية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:26",
      "similarity": 0.7349238179313049
    },
    {
      "verse": "4:35",
      "similarity": 0.6589438904553452
    },
    {
      "verse": "11:88",
      "similarity": 0.6432454638188145
    },
    {
      "verse": "9:56",
      "similarity": 0.3219048561366647
    },
    {
      "verse": "9:62",
      "similarity": 0.32011767352832277
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/4:62.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/4:62.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:62.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}