{
  "chapter": "النساء",
  "text": "وما ارسلنا من رسول الا ليطاع باذن الله ولو انهم اذ ظلموا۟ انفسهم جاءوك فاستغفروا۟ الله واستغفر لهم الرسول لوجدوا۟ الله توابا رحيما",
  "translations": [
    {
      "translation": "We sent no Messenger except to be obeyed by Allah's permission. If only when they wronged themselves they had come to you and asked Allah's forgiveness and the Messenger had asked forgiveness for them they would have found Allah Ever-Returning, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent no apostle but that he should be obeyed by the will of God. If they had come to you after wronging themselves and asked forgiveness of God, and you had also asked forgiveness for them, they would surely have found God forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And tell them that) We never sent a Messenger but that he should be obeyed by the leave of Allah. If whenever they wronged themselves they had come to you praying to Allah for forgiveness, and had the Messenger prayed for their forgiveness, they would indeed have found Allah All-Forgiving, All-Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not send any Messengers for any reason other than to be obeyed because of the will of God. If they ever do injustice to themselves and come to you (Muhammad) asking for God's forgiveness and if the Messenger also was to ask God to forgive them, they would certainly find God All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not send any Noble Messenger except that he be obeyed by Allah’s command; and if they, when they have wronged their own souls, come humbly to you (O dear Prophet Mohammed – peace and blessings be upon him) and seek forgiveness from Allah, and the Noble Messenger intercedes for them, they will certainly find Allah as the Most Acceptor Of Repentance, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent no Messenger, but to be obeyed by Allah's leave. If they, when they were unjust to themselves, had come to you and begged Allah's forgiveness, and the Messenger had begged forgiveness for them, indeed, they would have found Allah All-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not send any apostle but that he should be obeyed by Allah's permission; and had they, when they were unjust to themselves, come to you and asked forgiveness of Allah and the Apostle had (also) asked forgiveness for them, they would have found Allah Oft-returning (to mercy), Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent not ever any Messenger, but that he should he obeyed, by the leave of God. If; when they wronged themselves, they had come to thee, and prayed forgiveness of God, and the Messenger had prayed forgiveness for them, they would have found God turns, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent no messenger save that he should be obeyed by Allah's leave. And if, when they had wronged themselves, they had but come unto thee and asked forgiveness of Allah, and asked forgiveness of the messenger, they would have found Allah Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All the messengers We sent were meant to be obeyed by God's leave. If they had come to you and sought forgiveness from God whenever they wronged themselves, and the Messenger had prayed for forgiveness for them, they would have found that God is ever-forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And not an apostle We have sent but to be obeyed by Allah's command. And if they, when they had wronged their souls, had come unto thee and begged forgiveness of Allah, and the apostle had begged forgiveness for them they would surely have found Allah Relentant, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not send any apostle but to be obeyed by Allah’s leave. Had they, when they wronged themselves, come to you and pleaded to Allah for forgiveness, and the Apostle had pleaded for them [to Allah]for forgiveness, they would have surely found Allah all-clement, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent not a messenger, but to be obeyed, in accordance with the will of Allah. If they had only, when they were unjust to themselves, come unto thee and asked Allah's forgiveness, and the Messenger had asked forgiveness for them, they would have found Allah indeed Oft-returning, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent no Messenger, but to be obeyed by Allah's Leave. If they (hypocrites), when they had been unjust to themselves, had come to you (Muhammad SAW) and begged Allah's Forgiveness, and the Messenger had begged forgiveness for them: indeed, they would have found Allah All-Forgiving (One Who accepts repentance), Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not send a Messenger except that he should be obeyed, by the permission of Allah. If, when they wronged themselves, they had come to you and asked Allah for forgiveness, and the Messenger had asked for forgiveness for them, they would have found Allah the Turner, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did not send any messenger except to be obeyed by God’s leave. Had they, when they wronged themselves, come to you, and prayed for God's forgiveness, and the Messenger had prayed for their forgiveness, they would have found God Relenting and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We did not send any messenger except to be obeyed by permission of Allah. And if, when they wronged themselves, they had come to you, [O Muhammad], and asked forgiveness of Allah and the Messenger had asked forgiveness for them, they would have found Allah Accepting of repentance and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:64] We never sent any Messenger, but that he should be obeyed, in what he commands and judges, by the leave, by the command, of God, and not that he should be disobeyed or opposed. If, when they had wronged themselves, by seeking the judgement of the false idol, they had come to you, repentant, and asked forgiveness from God, and the Messenger had asked forgiveness for them (there is a shift from the second [to the third] person in this address, in deference to his [the Prophet’s (s)] status); they would have found God Relenting, to them, Merciful, to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We sent no messenger save that he) that the messenger (should be obeyed by Allah's leave) by Allah's command; We do not send him so that he is opposed or has his judgement rejected by turning away from him. (And if, when they) those who built the counter mosque and Hatib (had wronged themselves) by so building it and turning away from you, (they had but come unto thee) to repent (and asked forgiveness of Allah) repented to Allah for their actions (and asked forgiveness of the messenger) and the Messenger prayed for them, (they would have found Allah Forgiving) He overlooks their transgressions, (Merciful) He is after repentance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وما أرسلنا من رسول إلا ليطاع بإذن الله } الآية\n الفرق بين الرسول والنبي هو: أن الرسالة\n باعتبار تبليغ الأحكام:\n[المائدة\n الآية: 67] والنبوّة باعتبار الإخبار عن المعارف والحقائق التي تتعلق بتفاصيل الصفات والأفعال\n فإنّ النبوّة ظاهر الولاية التي هي الاستغراق في عين الجمع والفناء في الذات\n فعلمها علم توحيد الذات ومحو الأفعال والصفات\n فكل رسول نبيّ\n وكل نبيّ وليّ\n وليس كل وليّ نبياً\n ولا كلّ نبي مرسلاً\n وإن كانت رتبة الولاية أشرف من النبوّة\n والنبوّة من الرسالة كما قيل:\nفلا يرسل الرسول إلا للطاعة\n إذ حكمه حكم الله باعتبار التبليغ فيجب أن يُطاع\n ولا يُطاع إلا بإذنه\n فإن من حجب عنه بقصور الاستعداد كالكافر الأصليّ والشقيّ الحقيقي\n أو بالرين ومحو الاستعداد كالمنافق ليس بمأذون له في الطاعة في الحقيقة\n { ولو أنهم إذ ظَلَموا أنفسهم } بمنعها عن حقوقها التي هي كمالاتها الثابتة فيها بالقوة\n وتكدير الاستعداد بالتوجه إلى طلب اللذّات الحسيّة والأغراض الفانية { جَاؤوك } بالإرادة التي هي مقتضى استعدادهم { فاسْتغفروا الله } طلبوا من الله ستر صفات نفوسهم التي هي مصادر تلك الأفعال الحاجبة لما في استعدادهم بنور صفاته { واستغفرَ لهم الرسول } بإمدادهم بنور صفاته التي هي صفات الله عز وجل لرابطة الجنسية التي بينهم وبين نفسه\n ومكان الإرادة والمحبة التي تستلزم قربهم منه وامتزاجهم به { لوجدوا الله توّاباً } مطهراً\n مصفياً لاستعدادهم بنوره\n إذ قبول التوبة هو إلقاء نور الصفات عليهم\n وتنوير بواطنهم بهيئة نورية تعصمهم من الخطأ في الأفعال لبعد النور عن الظلمة { رحيماً } يفيض عليهم رحمة الكمال اللائق بهم من الإيقان العلميّ أو العينيّ أو الحقيّ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { مَآ أَرْسَلْنَا مِن رَّسُولٍ } إلى أمة من الأممم الماضية { إِلاَّ لِيُطَاعَ } ويؤمن به ويمتثل بأمره إلا { بِإِذْنِ ٱللَّهِ } وتعلق إرادته بإطاعتهم له وإيمانهم به { وَلَوْ أَنَّهُمْ } من غاية جهلهم ونفاقهم { إِذ ظَّلَمُوۤاْ أَنْفُسَهُمْ } بالخروج عن إطاعتك وانقيادك عنا { جَآءُوكَ } تائبين معتذرين مما صدر عنهم { فَٱسْتَغْفَرُواْ ٱللَّهَ } مخلصين نادمين { وَٱسْتَغْفَرَ لَهُمُ ٱلرَّسُولُ } أيضاً بالاستشفاع والاستدعاء من الله بالقبول بعدما جاءوا معتذرين { لَوَجَدُواْ ٱللَّهَ } وصادقوه مفضلاً كريماً { تَوَّاباً } يثل توبتهم { رَّحِيماً } [النساء: 64] لهم يوفقهم عليها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { توابًا رحيمًا } مفعولاً وَجَدَ أن كانت علمية\n أو { توابًا } حال\n و { رحيمًا } بدل منه\n أو حال من ضميره إن فسرت بصادف\n يقول الحقّ جلّ جلاله: { وما أرسلنا من رسول } من لدن آدم إلى زمانك\n { إلا ليُطاع بإذن الله } وأمره بطاعته\n فمن لم يطعه ولم يرض بأحكامه فهو كافر به\n { ولو أنهم } أي: المنافقون حين { ظلموا أنفسهم } بالترافع إلى غيرك\n والتحاكم إلى الطاغوت { جاؤوك } تائبين { فاستغفروا الله } بالتوبة\n { واستغفر لهم الرسول } حين اعتذروا إليه حتى انتصب لهم شفيعًا\n { لوجدوا الله } أي: تحققوا كونه { توابًا رحيمًا } \n قابلاً لتوبتهم متفضلاً عليهم بالرحمة والغفران\n وإنما عدل عن الخطاب في قوله: { واستغفر لهم الرسولُ } ولم يقل: واستغفرت لهم\n تفخيمًا لشأنه\n وتنبيهًا على أن من حق الرسول أن يقبل اعتذار التائبين\n وإن عَظُم جُرمُهم\n ويشفع لهم\n ومن جلالة منصبه أن يشفع في عظائم الذنوب وكبائرها\n ثم أقسم بربوبيته على نفي إيمان من لم يرض بحكم رسوله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:39",
      "similarity": 0.4619193034623698
    },
    {
      "verse": "5:34",
      "similarity": 0.44030864430579253
    },
    {
      "verse": "3:89",
      "similarity": 0.43969195041007747
    },
    {
      "verse": "24:5",
      "similarity": 0.43969195041007747
    },
    {
      "verse": "5:74",
      "similarity": 0.4387578968745168
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/4:64.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/4:64.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:64.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}