{
  "chapter": "النساء",
  "text": "فلا وربك لا يؤمنون حتى يحكموك فيما شجر بينهم ثم لا يجدوا۟ فى انفسهم حرجا مما قضيت ويسلموا۟ تسليما",
  "translations": [
    {
      "translation": "No, by your Lord, they are not muminun until they make you their judge in the disputes that break out between them, and then find no resistance within themselves to what you decide and submit themselves completely.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, by your Lord, they will not believe till they make you adjudge in their disputes and find no constraint in their minds about your decisions and accept them with full acquiescence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no, by your Lord, they cannot become true be-lievers until they seek your arbitration in all matters on which they disagree among themselves, and then find not the least vexation in their hearts over what you have decided, and accept it in willing submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I swear by your Lord that they will not be considered believers until they let you judge their disputes and then they will find nothing in their souls to prevent them from accepting your judgment, thus, submitting themselves to the will of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So O dear Prophet (Mohammed – peace and blessings be upon him), by oath of your Lord, they will not be Muslims until they appoint you a judge for the disputes between them – and then whatever you have decided, they should not find opposition to it within their hearts, and they must accept it wholeheartedly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no, by your Lord, they can have no faith, until they make you judge in all disputes between them, and find in themselves no resistance against your decisions, and accept (them) with full submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no! by your Lord! they do not believe (in reality) until they make you a judge of that which has become a matter of disagreement among them, and then do not find any straitness in their hearts as to what you have decided and submit with entire submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no, by thy Lord! they will not believe till they make thee the judge regarding the disagreement between them, then they shall find in themselves no impediment touching thy verdict, but shall surrender in full submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But nay, by thy Lord, they will not believe (in truth) until they make thee judge of what is in dispute between them and find within themselves no dislike of that which thou decidest, and submit with full submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By your Lord, they will not be true believers until they seek your arbitration in their disputes and find within themselves no doubt about what you decide and accept it wholeheartedly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! by thy Lord, they shall not believe until they have made thee judge of that which is disputed among them, and then find no vexation in their hearts with that which thou hast decreed, and they submit with full submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no, by your Lord! They will not believe until they make you a judge in their disputes, then do not find within their hearts any dissent to your verdict and submit in full submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no, by the Lord, they can have no (real) Faith, until they make thee judge in all disputes between them, and find in their souls no resistance against Thy decisions, but accept them with the fullest conviction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no, by your Lord, they can have no Faith, until they make you (O Muhammad SAW) judge in all disputes between them, and find in themselves no resistance against your decisions, and accept (them) with full submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no, by your Lord, they will not believe you until they make you the judge regarding the disagreement between them, then, they will not find in themselves any discomfort concerning your verdict, and will surrender to you in full submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no, by your Lord, they will not believe until they call you to arbitrate in their disputes, and then find within themselves no resentment regarding your decisions, and submit themselves completely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no, by your Lord, they will not [truly] believe until they make you, [O Muhammad], judge concerning that over which they dispute among themselves and then find within themselves no discomfort from what you have judged and submit in [full, willing] submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:65] But no, (fa-lā, the lā is extra) by your Lord! They will not believe until they make you judge over what has broken out, has become mixed up, between them and find in themselves no inhibition, [no] constraint or doubt, regarding what you decide, but submit, [but] comply with your ruling, in full submission, without objection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But nay, by your lord) Allah swore by Himself and by the age of Muhammad, (they will not believe) in secret nor deserve to be called believers when alone (until they make thee judge of what is in dispute between them and find within themselves) in their hearts (no dislike) no doubt (of that which thou decidest) between them, (and submit with full submission) totally submit to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِيمَا شَجَرَ بَيْنَهُمْ } ومعناهُ اخْتَلَطَ\n\n\n\n\nوقوله تعالى: { لاَ يَجِدُواْ فِيۤ أَنْفُسِهِمْ حَرَجاً } معناهُ ضيقٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"In what [way] have they become mixed?\" - meaning, they have become confused.\n\n\nAnd His saying, {They will not find in themselves any discomfort} [means] difficulty.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلاَ وَرَبِّكَ } أي: فوربك وعظم شأنه وسطوع برهانه { لاَ يُؤْمِنُونَ } بالله وبكتبه ورسله { حَتَّىٰ يُحَكِّمُوكَ } أيها لمبعوث لكل { فِيمَا شَجَرَ } وحدث { بَيْنَهُمْ } من الوقائع التي اختلفوا فيها { ثُمَّ } بعدما حكموك { لاَ يَجِدُواْ } حين راجعوا وجدانهم { فِيۤ أَنْفُسِهِمْ حَرَجاً } ضيقاً واضطراباً وشكاً { مِّمَّا قَضَيْتَ } حكمت به { وَيُسَلِّمُواْ } حكمك وقضاءك { تَسْلِيماً } [النساء: 65] ناشئاً عن محض الإطاعة والانقياد\n ظاهراً وباطناً\n إذ طاعتك عين إطاعتنا وانقيادنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم أقسم بربوبيته على نفي إيمان من لم يرض بحكم رسوله، فقال: { فلا وربك لا يؤمنون } إيمانًا حقيقيًا { حتى يحكموك } أي: يترافعوا إليك، راضين بحكمك، { فيما شَجَر بينهم } أي: اختلط بينهم واختلفوا فيه { ثم لا يجدوا في أنفسهم حرجًا } أي: ضيقًا وشكًا { مما قضيت } ، بل تنشرح صدورهم لحكمك لأنه حق من عند الله\n { ويُسلموا } لأمرك { تسليمًا }\n أي ينقادوا لأمرك ظاهرًا وباطنًا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:2",
      "similarity": 0.5693073767076423
    },
    {
      "verse": "9:91",
      "similarity": 0.4100573635791034
    },
    {
      "verse": "33:38",
      "similarity": 0.38282032807315003
    },
    {
      "verse": "48:17",
      "similarity": 0.31976457158734317
    },
    {
      "verse": "22:78",
      "similarity": 0.3005905625223419
    }
  ]
}