{
  "chapter": "النساء",
  "text": "ولو انا كتبنا عليهم ان اقتلوا۟ انفسكم او اخرجوا۟ من ديركم ما فعلوه الا قليل منهم ولو انهم فعلوا۟ ما يوعظون به لكان خيرا لهم واشد تثبيتا",
  "translations": [
    {
      "translation": "If We had directed them to kill themselves or leave their homes, they would not have done so, except for a very few. But if they had done what they were urged to do, it would have been better for them and far more strengthening.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We had commanded them to lay down their lives and to go forth from their homes, only a few would have obeyed; though had they followed what they had been commanded it would surely have been good for them and the strengthening of their faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We enjoined upon them: 'Slay yourselves', or 'Leave your habitations', very few of them would have done it; yet if they had done as they were admonished, it would have been better for them and would have strengthened them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We commanded them to kill themselves or abandon their homes, only a few of them would have done it. If they had done what they had been advised to do, it would have strengthened their faith,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We decreed for them to slay themselves or to leave their homes and families, only a few of them would have done it; and if they did what they are advised to, it would be good for them, and would have strengthened faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had ordered them (saying), \"Kill yourselves (i.e. the innnocent ones kill the guilty ones) or leave your homes,\" very few of them would have done it; but if they had done what they were told, it would have been better for them, and would have strengthened their conviction;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had prescribed for them: Lay down your lives or go forth from your homes, they would not have done it except a few of them; and if they had done what they were admonished, it would have certainly been better for them and best in strengthening (them);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But had We prescribed for them, saying, 'Slay yourselves' or 'Leave your habitations,' they would not have done it, save a few of them; yet if they had done as they were admonished it would have been better for them, and stronger confirming them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had decreed for them: Lay down your lives or go forth from your dwellings, but few of them would have done it; though if they did what they are exhorted to do it would be better for them, and more strengthening;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We had commanded them, \"Lay down your lives or leave your dwellings,\" they would have not done it, save a few of them. If they had done what they were instructed to do, it would have been better for them, as well as more strengthening [for their faith],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We prescribed unto them: slay yourselves or go forth from your dwellings, they had not done it, save a few of them. And did they do that which they are exhorted to do, it would be for them better and more strengthening.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We prescribed for them, [commanding]: ‘Slay [the guilty among] your folks or leave your habitations,’ they would not have done it except a few of them. And if they had done as they were advised, it would have been better for them and stronger in confirming [their faith].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We had ordered them to sacrifice their lives or to leave their homes, very few of them would have done it: But if they had done what they were (actually) told, it would have been best for them, and would have gone farthest to strengthen their (faith);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had ordered them (saying), \"Kill yourselves (i.e. the innnocent ones kill the guilty ones) or leave your homes,\" very few of them would have done it; but if they had done what they were told, it would have been better for them, and would have strengthened their (Faith);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We written for them, saying, 'Slay yourselves' or 'Emerge from your houses' they would not have done so, except a few of them. Yet, if they had done as they were exhorted, it would have been better for them, and stronger in firmness,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We decreed for them: “Kill yourselves,” or “Leave your homes,” they would not have done it, except for a few of them. But had they done what they were instructed to do, it would have been better for them, and a firmer confirmation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had decreed upon them, \"Kill yourselves\" or \"Leave your homes,\" they would not have done it, except for a few of them. But if they had done what they were instructed, it would have been better for them and a firmer position [for them in faith].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:66] And had We prescribed for them: (the particle an, ‘that’, is explicative) ‘Slay yourselves’ or ‘Leave your habitations’, as We did for the Children of Israel, they would not have done it, that is, what has been prescribed for them, save a few (read nominative qalīlun, as a substitution; or read accusative qalīlan, as an   exceptive clause) of them; yet if they had done what they were admonished to do, of obedience to the Messenger (s), it would have been better for them, and stronger in establishing, [a stronger] confirmation of their faith.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if We had decreed for them) as We decreed for the Children of Israel: (Lay down your lives or go forth from your dwellings) empty handed, (but few of them) among the sincere ones, i.e. their leader Thabit Ibn Qays Ibn Shammas al-Ansari (would have done it) with a good disposition of the soul; (though if they) the hypocrites (did what they are exhorted) commanded (to do) of repentance and sincerity (it would be better for them) in the Hereafter than the condition they are in secret, (and more strengthening) and more real in this world;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَوْ أَنَّا كَتَبْنَا عَلَيْهِمْ } معناهُ قَضَينَا عَلَيهِمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd if We had decreed upon them, {We would have written it} [i.e. the punishment] against them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولو أنّا كتبنا } أي: فرضنا { عليهم أن اقْتلوا أَنْفُسكم } بقمع الهوى الذي هو حياتها وإفناء صفاتها { أو اخرجوا من دِيَاركم } مقاماتكم التي هي الصبر والتوكل والرضا وأمثالها\n لكونها حاجبة عن التوحيد كما قال الحسين بن منصور قدّس الله روحه لإبراهيم بن أدهم رحمه الله\n لما سأله عن حاله\n وأجابه بقوله: أدور في الصحاري\n وأطوف في البراري\n حيث لا ماء ولا شجر ولا روض ولا مطر\n هل يصح حالي في التوكل أم لا؟\n فقال: إذا أفنيت عمرك في عمران بطنك فأين الفناء في التوحيد؟\n { ما فَعَلوه إلا قليلٌ منهم } وهم: المحبون المستعدّون للقائه\n الأكثرون قدر الأقلون عدداً كما قال تعالى:\n[ص\n الآية: 24]\n { لكان خيراً لهم } بحسب كمالهم الحاصل لهم عند رفع حجب صفات النفس بالاتصاف بصفات الحق أو بالوصول إلى عين الجمع { وأشدّ تثبيتاً } بالاستقامة في الدين عند البقاء بعد الفناء { وإذاً لآتَيْنَاهم من لدُنا أجراً عظيماً } من تجليات الصفات عند قتل النفس { ولهديناهم صِراطاً مُستقيماً } عند الخروج عن الديار\n أي: منازل النفس والمقامات\n وهو طريق الوحدة والاستقامة في التوحيد { ومن يُطِع الله } بسلوك طرق التوحيد والجمع { والرسول } بمراعاة التفصيل { فأولئكَ مع الذينَ أنعم الله عليهم } بالهداية { من النبيّين والصديقين } الذين صدقوا بنسبة الأفعال والصفات إلى الله\n بالانخلاع عن صفاتهم والاتصاف بصفاته ولو ظهروا بصفات نفوسهم لكانوا كاذبين { والشهداء } اي: أهل الحضور { والصالحين } أي: أهل الاستقامة في الدين\n { ذلك الفَضل } أي: التوفيق لتحصيل الكمال الذي ناسبوا به النبيين ومن معهم فرافقوهم\n { عليماً } يعلم ما في استعدادهم من الكمال فيظهره عليهم { خذوا حذركم } أي: ما تحذرون من إلقاء الشيطان ووساوسه وإهلاكه إياكم بالإغواء\n ومن ظهور صفات نفوسكم واستيلائها عليكم\n فإنها أعدى عدوّكم { فانْفروا ثبات } اسلكوا في سبيل الله جماعات\n كلّ فرقة على طريقة شيخ كامل عالم { أو انْفروا جميعاً } في طريق التوحيد والإسلام على متابعة النبيّ { وإنْ تصبهم حسنة يقولوا هذه من عند الله } إلى آخره\n ثبت أنهم قدريون يضيفون الخيرات إلى الله والشرور إلى الناس\n يتشبهون بالمجوس في الثبات\n مؤثرين مستقلين في الوجود\n وإضافتهم الشرور إلى الرسول لا إلى أنفسهم كانت لأنه باعثهم ومحرّضهم على ما يلقون بسببه الشرّ عندهم\n فأمر الرسول صلى الله عليه وسلم بدعوتهم إلى توحيد الأفعال ونفي التأثير عن الأغيار والإقرار بكونه فاعل الخير والشرّ بقوله: { قل كلّ من عند الله فَمالِ هؤلاء القَوم لا يكَادُون يَفْقهون حَديثاً } لاحتجابهم بصفات النفوس وارتجاج آذان قلوبهم التي هي أوعية السماع والوعي\n ثم بيّن أنّ لله فضلاً وعدلاً\n فالخيرات والكمالات كلها من فضله\n والشرور من عدله\n أي: يقدرها علينا ويفعلها بنا لاستعداد واستحقاق فينا يقتضي ذلك\n\nوذلك الاستحقاق إنما يحدث من ظهور النفس بصفاتها وارتكابها المعاصي والذنوب الموجبة للعقاب لا بفعل آخر كما نسبوا ما أصابهم من الشرّ إلى الرسول\n لأن الاستحقاق مرتب على الاستعداد\n ولا يعرض ما يقتضيه استعداد أحد لغيره\n كما قال تعالى:\n[الأنعام\n الآية: 164]\n فكذّبهم وخطّأهم في قدريتهم بإثبات أنّ: السبب الفاعليّ للخير والشرّ ليس إلا لله وحده بمقتضى فضله وعدله\n وأما السبب القابلي فهو وإن كان أيضاً منه في الحقيقة إلا أن قابلية الخير هو من الاستعداد الأصلي الذي هو من الفيض الأقدس الذي لا مدخل لفعلنا واختيارنا فيه\n وقابلية الشرّ من الاستعداد الحادث بسبب ظهور النفس بالصفات والأفعال الحاجبة للقلب\n المكدّرة لجوهره\n حتى احتاج إلى الصقل بالرزايا والمصائب والبلايا والنوائب لا من قِبَل الرسول أو غيره",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَوْ أَنَّا كَتَبْنَا } فرضنا وأمرنا { عَلَيْهِمْ أَنِ ٱقْتُلُوۤاْ أَنْفُسَكُمْ } في سبيلنا { أَوِ ٱخْرُجُواْ مِن دِيَارِكُمْ } المألوفة التي هي بقعة الإمكان { مَّا فَعَلُوهُ } أي: المأمور به { إِلاَّ قَلِيلٌ مِّنْهُمْ } وهم المخلصون المبادرون إلى الفناء في الله\n ليفوزوا بشرف بقائه { وَلَوْ أَنَّهُمْ } من غاية تشوقهم وتعطشهم بمرتبة الفناء فيه { فَعَلُواْ مَا يُوعَظُونَ بِهِ لَكَانَ خَيْراً لَّهُمْ } في أولادهم وأخراهم { وَأَشَدَّ تَثْبِيتاً } [النساء: 66] لقدمهم في طريق التوحيد والعرفان\n\n\n{ وَإِذاً } أي: حين ثبتوا على طريق التوحيد أشد تثبيت { لأَتَيْنَٰهُم مِّن لَّدُنَّـآ } بلا صنع منهم { أَجْراً عَظِيماً } [النساء: 67] هو الفوز بمرتبة الكشف والشهود\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولو أنا كتبنا عليهم أن اقتلوا أنفسكم } \n توبة من ذنوبكم\n كما كتبناه على بني إسرائيل\n أو في الجهاد في سبيل الله\n { أو اخرجوا من دياركم } كما خرج بنو إسرائيل حين أمرناهم بالهجرة من مصر\n { ما فعلوه إلا قليل منهم } وهم المخلصون\n قال أبو بكر الصديق رضي الله عنه: لو كتب ذلك علينا أنا أول خارج\n قال ثابت بن قيس بن شماس:  لو أمرني رسول الله صلى الله عليه وسلم أن أقتل نفسي لفعلت\n وكذلك قال عُمر وعمارُ بن ياسر وابنُ مسعود وناس من أصحاب رسول الله صلى الله عليه وسلم: لو أمرنا لفعلنا\n فبلغ ذلك النبيُ صلى الله عليه وسلم فقال:\n \" إنَّ مِن أُمَّتِي رِجَالاً: الإيمَانُ في قُلُوبِهِم أثبَتُ مِنَ الجِبَالِ الرَّوَاسِي \" \nفهؤلاء من القليل\n وسبب نزول قوله: { فلا وربك\n\n\n } الخ: قضية الزُّبَيرِ مع حَاطِب في شرَاج الحَرَّة\n كَانَا يسقيانِ به النّخل\n فتخاصما إلى رسول الله صلى الله عليه وسلم فقال عليه السلام:\n \" اسقِ يا زُبيرُ وأرسِل إلى جارِكَ \" \nفقال حَاطبُ: لأن كَان ابن عمتك\n فقال ـ عليه الصلاة والسلام ـ:\n \" اسقِ يا زُبيرُ\n واحِبِس الماءَ حتَّى يبلغ الجدر واستوف حقك \" \nوقيل: نزلت في اليهودي مع المنافق المتقدم\n وهو أليق بالسياق\n { ولو أنهم فعلوا ما يوعظون به } من طاعة الرسول\n والرضى بحكمه\n { لكان خيرًا لهم } في آجلهم وعاجلهم\n { وأشد تثبيتًا } في دينهم وقوة في إيمانهم\n أو تثبيتًا لثواب أعمالهم\n { وإذًا } لو فعلوا ذلك { لآتيناهم من لدنا أجرًا عظيمًا ولهديناهم صراطًا مستقيمًا } يصلون بسلوكه إلى حضرة القدس\n ودوام الأنس\n ويفتح لهم أسرار العلوم\n ومخازن الفهوم\n قال صلى الله عليه وسلم:\n\n \" من عَمِلَ بما عِلَمَ أورثه الله علمَ ما لم يعلم \" \nوالله تعالى أعلم\n الإشارة: كما أمر الله بطاعة رسوله صلى الله عليه وسلم في حياته\n أمر بطاعة ورثته بعد مماته\n وهم العلماء الأتقياء الذين يعدلون في الأحكام\n والأولياء العارفون الذين يحكمون بوحي الإلهام\n فالعلماء حُكَّام على العموم\n والأولياء حكام على الخصوص\n أعني من تعلق بهم من أهل الإرادة\n فمن لم يرض بحكم العلماء\n ووجد في نفسه حرجًا مما قضوا به عليه\n ففيه شُبعة من النفاق\n وخصلة من المنافقين\n ومن لم يرض بحكم الأولياء فقد خرج من دائرتهم\n ومن عُش تربيتهم\n لأن حكم الرسول ـ عليه الصلاة والسلام ـ وحكم ورثته هو حكم الله\n ومن لم يرض بحكم الله خرج عن دائرة الإيمان\n فلا يكمل إيمان العبد حتى لا يجد في نفسه حرجًا من أحكام الله\n القهرية والتكليفية\n ويسلم لما يبرز من عنصر القدرة الأزلية\n كيفما كان\n فقرًا أو غنى\n ذلاً أو عزًا\n منعًا أو عطاء\n قبضًا أو بسطًا\n مرضًا أو صحة\n إلى غير ذلك من اختلاف المقادير\n ويرضى بذلك ظاهرَا وباطنًا\n وينسلخ من تدبيره واختياره إلى اختيار مولاه فهو أعلم بمصالحه\n وأرحم به من أمه وأبيه: وبالله التوفيق\n وهو الهادي إلى سواء الطريق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:30",
      "similarity": 0.5104563122549903
    },
    {
      "verse": "11:120",
      "similarity": 0.4746288660140151
    },
    {
      "verse": "14:27",
      "similarity": 0.4650927232171573
    },
    {
      "verse": "47:7",
      "similarity": 0.40169459906331234
    },
    {
      "verse": "3:147",
      "similarity": 0.33948318662092336
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/4:66.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/4:66.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:66.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}