{
  "chapter": "النساء",
  "text": "للرجال نصيب مما ترك الولدان والاقربون وللنساء نصيب مما ترك الولدان والاقربون مما قل منه او كثر نصيبا مفروضا",
  "translations": [
    {
      "translation": "Men receive a share of what their parents and relatives leave and women receive a share of what their parents and relatives leave, a fixed share, no matter whether it is a little or a lot.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men have a share in what the parents and relatives leave behind at death; and women have a share in what the parents and relatives leave behind. Be it large or small a legal share is fixed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Just as there is a share for men in what their parents and kinsfolk leave behind, so there is a share for women in what their parents and kinsfolk leave behind - be it little or much - a share ordained (by Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Male and female are entitled to their legal share in the legacy of their parents and relatives, whether it be small or large.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For men is a share from what the parents and near relatives leave behind, and for women is a share from what the parents and near relatives leave behind, whether the wealth (inheritance) is small or large; the share is a fixed one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a share for men and a share for women from what is left by parents and those nearest in relation, whether the property be small or large -- a legal share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men shall have a portion of what the parents and the near relatives leave, and women shall have a portion of what the parents and the near relatives leave, whether there is little or much of it; a stated portion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the men a share of what parents and kinsmen leave, and to the women a share of what parents and kinsmen leave, whether it be little or much, a share apportioned;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto the men (of a family) belongeth a share of that which parents and near kindred leave, and unto the women a share of that which parents and near kindred leave, whether it be little or much - a legal share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men shall have a share in what parents and relatives leave behind, and women shall have a share in what parents and relatives leave behind, whether it be little or much. This is ordained [by God].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto males shall be a portion of that which their parents and others near of kin may leave; and unto females shall be a portion of that which their parents and other near of kin may leave, whether it be small or large, a portion allotted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men have a share in the heritage left by parents and near relatives, and women have a share in the heritage left by parents and near relatives, whether it be little or much, a share ordained [by Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From what is left by parents and those nearest related there is a share for men and a share for women, whether the property be small or large,-a determinate share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a share for men and a share for women from what is left by parents and those nearest related, whether, the property be small or large - a legal share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men shall have a share in what their parents and kinsmen leave, and women shall have a share in what their parents and kinsmen leave, whether it is little or abundant, it is an obligated share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men receive a share of what their parents and relatives leave, and women receive a share of what their parents and relatives leave; be it little or much—a legal share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For men is a share of what the parents and close relatives leave, and for women is a share of what the parents and close relatives leave, be it little or much - an obligatory share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:7] The following was revealed as a repudiation of pre-Islamic practices in which women and children were not given any inheritance: To the men, young ones and kin, belongs a share, a portion, of what, deceased, parents and kinsmen leave, and to the women belongs a share of what parents and kinsmen leave, whether it, the property, be little or much. God has made it, an obligatory share, apportioned, to be given to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي ، وهو جار مجرى النتيجة لحكم إيتاء أموال اليتامى ، ومجرى المقدّمة لأحكام المواريث التي في قوله تعالى : { يوصيكم الله في أولادكم } \\[ النساء : 11 \\] .ومناسبة تعقيب الآي السابقة بها : أنّهم كانوا قد اعتادوا إيثار الأقوياء والأشدّاء بالأموال ، وحرمان الضعفاء ، وإبقاءهم عالة على أشدّائهم حتّى يكونوا في مقادتهم ، فكان الأولياء يمنعون عن محاجيرهم أموالهم ، وكان أكبر العائلة يَحرم إخوته من الميراث معه فكان أولئك لضعفهم يصبرون على الحرمان ، ويقنعون بالعيش في ظلال أقاربهم ، لأنّهم إن نازعوهم أطردوهم وحرموهم ، فصاروا عالة على الناس .وأخصّ الناس بذلك النساءُ فإنّهن يجدن ضعفاً من أنفسهنّ ، ويخشين عار الضيعة ، ويتّقين انحراف الأزواج ، فيتّخذن رضى أوليائهُنّ عدّة لهنّ من حوادث الدهر ، فلمّا أمرهم الله أن يؤتوا اليتامى أموالهم ، أمر عقبه بأمرهم بأن يجعلوا للرجال والنساء نصيباً ممّا ترك الوالدان والأقربون .فإيتاء مال اليتيم تحقيق لإيصال نصيبه ممّا ترك له الوالدان والأقربون ، وتوريث القرابة إثبات لنصيبهم ممّا ترك الوالدان والأقربون ، وذُكر النساءُ هناك تمهيداً لشرع الميراث ، وقد تأيّد ذلك بقوله : { وإذا حضر القسمة أولو القربى واليتامى } \\[ النساء : 8 \\] فإنّ ذلك يناسب الميراث ، ولا يناسب إيتاءَ أموال اليتامى .ولا جرم أنّ من أهمّ شرائع الإسلام شرع الميراث ، فقد كان العرب في الجاهلية يجعلون أموالهم بالوصيّة لعظماء القبائل ومن تلحقهم بالانتساب إليهم حسن الأحدوثة ، وتجمعهم بهم صلات الحلف أو الاعتزاز والودّ ، وكانوا إذا لم يوصوا أو تركوا بعض مالهم بلا وصية يُصرف لأبْناء الميّت الذكور ، فإن لم يكن له ذكور فقد حكي أنّهم يصرفونه إلى عصبته من إخوة وأبناء عمّ ، ولا تعطى بناته شيئاً ، أمّا الزوجات فكنّ موروثات لا وارثات .وكانوا في الجاهلية لا يورثون بالبنوّة إلاّ إذا كان الأبناء ذكوراً ، فلا ميراث للنساء لأنّهم كانوا يقولون إنّما يرث أموالنا من طاعن بالرمح ، وضرب بالسيف . فإن لم تكن الأبناءُ الذكورُ وَرِث أقربُ العصبة : الأبُ ثمّ الأخُ ثمّ العمّ وهكذا ، وكانوا يورثون بالتبنيّ وهو أن يتّخذ الرجل ابن غيره ابنا له فتنعقد بين المتبنِّي والمتبنَّى جميع أحكام الأبوّة .ويورثون أيضاً بالحلف وهو أن يرغب رجلان في الخلّة بينهما فيتعاقدا على أنّ دمهما واحد ويتوارثا ، فلمّا جاء الإسلام لم يقع في مكّة تغيير لأحكام الميراث بين المسلمين لتعذّر تنفيذ ما يُخالف أحكام سكّانها ، ثمّ لمّا هاجر رسول الله صلى الله عليه وسلم وبقي معظم أقارب المهاجرين المشركون بمكّة صار التوريث : بالهجرة ، فالمهاجر يرث المهاجر ، وبالحلف ، وبالمعاقدة ، وبالأخوّة التي آخاها الرسول عليه الصلاة والسلام بين المهاجرين والأنصار ، ونزل في ذلك قوله تعالى : { ولكل جعلنا موالي مما ترك الوالدان والأقربون } \\[ النساء : 33 \\] الآية من هاته السورة . وشرع الله وجوب الوصية للوالدين والأقربين بآية سورة البقرة ، ثم توالد المسلمون ولحق بهم آباؤهم وأبناؤهم مؤمنين ، فشرع الله الميراث بالقرابة ، وجعل للنساء حظوظاً في ذلك فأتمّ الكلمة ، وأسبغ النعمة ، وأومأ إلى أنّ حكمة الميراث صرف المال إلى القرابة بالولادة وما دونها .وقد كان قوله تعالى : { وللنساء نصيب مما ترك الوالدان والأقربون } أوّل إعطاء لحقّ الإرث للنساء في العرب .ولكون هذه الآية كالمقدّمة جاءت بإجمال الحقّ والنصيب في الميراث وتلاه تفصيله ، لقصد تهيئة النفوس ، وحكمة هذا الإجمال حكمةُ ورود الأحكام المراد نسخها إلى أثقلَ لتسكن النفوس إليها بالتدريج .روى الواحدي ، في أسباب النزول ، والطبري ، عن عكرمة ، وأحَدُهما يزيد على الآخر ما حاصله : إنّ أوس بن ثابت الأنصاري توفي وترك امرأة يقال لها أم كُحَّة فجاءت رسول الله صلى الله عليه وسلم فقالت : «إنّ زوجي قُتِل معك يوم أُحد وهاتان بنتاه وقد استوفى عمّهما مالَهما فما ترى يا رسول الله؟ فواللَّهِ ما تَنْكحان أبداً إلاّ ولهما مال» فقال رسول الله صلى الله عليه وسلم \" يقضي الله في ذلك \" . فنزلت سورة النساء وفيها : { يوصيكم الله في أولادكم } \\[ النساء : 11 \\] . قال جابر بن عبد الله : فقال رسول الله \" ادع لي المرأة وصاحبَها \" فقال لعمتهما \" أعطهما الثلثين وأعط أمّهما الثمن وما بقي فلَك \" . ويروى : أنّ ابني عمّه سويد وعرفطة ، وروى أنّهما قتادة وعرفجة ، وروي أنّ النبي صلى الله عليه وسلم لمّا دعا العَمّ أو ابني العمّ قال ، أو قالا له «يا رسول الله لا نعطي من لا يركب فرساً ولا يحمل كَلا ولا يَنكي عدوّا» فقال \" انصرف أوْ انصرفا ، حتّى أنظرَ ما يحدث الله فيهنّ \" فنزلت آية { للرجال نصيب } الآية . وروي أنّه لمّا نزلت هاته الآية أرسل النبي صلى الله عليه وسلم إلى وليّ البنتين فقال : \" لا تفرّق من مال أبيهما شيئاً فإنّ الله قد جعل لهنّ نصيباً \" والنصيب تقدّم عند قوله : { ألم تر إلى الذين أوتوا نصيباً من الكتاب } في سورة آل عمران ( 23 ) .وقوله : بيان لمما ترك } لقصد تعميم ما ترك الوالدان والأقربون وتنصيص على أنّ الحقّ متعلّق بكلّ جزء من المال ، حتّى لا يستأثر بعضهم بشيء ، وقد كان الرجل في الجاهلية يعطي أبناءه من ماله على قدر ميله كما أوصى نزار بن مَعِّد بن عدنان لأبنائه : مضر ، وربيعة ، وإياد ، وأنْمارِ ، فجعل لمضر الحمراء كلّها ، وجعل لربيعة الفرسَ ، وجعل لإياد الخادم ، وجعل لأنمار الحمار ، ووكَلهم في إلحاق بقية ماله بهاته الأصناف الأربعة إلى الأفعى الجُرْهُمي في نَجْران ، فانصرفوا إليه ، فقسم بينهم ، وهو الذي أرسل المثَل : إنّ العَصَا من العُصَيَّة .وقوله : { نصيباً مفروضاً } حال من ( نصيب ) في قوله : { للرجال نصيب } { وللنساء نصيب } وحيث أريد بنصيب الجنس جاء الحال منه مفرداً ولم يراع تعدّده ، فلم يُقَل : نصيبين مفروضين ، على اعتبار كون المذكور نصيبين ، ولا قيل : أنصباء مفروضة ، على اعتبار كون المذكور موزّعا للرجال وللنساء ، بل روعي الجنس فجيء بالحال مفرداً و { مفروضا } وصف ، ومعنى كونه مفروضاً أنّه معيّن المقدار لكلّ صنف من الرجال والنساء ، كما قال تعالى في الآية الآتية { فريضة من الله } \\[ النساء : 11 \\] . وهذا أوضح دليل على أنّ المقصود بهذه الآية تشريع المواريث .\n\n",
      "translations": [
        {
          "translation": "Allah then mentioned the share of men and women in inheritance-because they were not in the habit of 82 giving any inheritance to women and children-saying: (Unto the men (of a family) belongeth a share of that which parents and near kindred leave, and unto the women a share of that which parents and near kindred leave, whether it is a little or much) whether the inheritance is much or little (a legal share) a determined share whether it is much or little, but He did not specify these shares. Allah did expound consequently on the exact value of these shares. This verse was revealed about Umm Kuhhah and her daughters who had an uncle who did not give them anything from their inheritance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لمَّا أمر أولاً سبحانه عباده بالتقوى على وجه المبالغة والتأكيد\n وقَرَنَ عليه حفظ الأرحام ومراعاة الأيتام\n ومواساة السفهاء المنحطين عن درجة العقلاء\n أراد أن يبين أحوال المواريث والمتوارثين مطلقاً\n حتى لا يقع التغالب والتظالم فيها كما في الجاهلية الأولى\n إذ روي أنهم لا يرثون النساء معللين بأنهن لا يحضرن الوغى ولا يدفعون العدو\n\n\nرد الله عليهم وعيَّن لكل واحد من الفريقين نصيباً مفروزاً مفروظاً\n فقال: { لِّلرِّجَالِ } سواء كانوا بالغين أم لا\n عقلاء أم سفهاء { نَصيِبٌ } بينهم مفروض مقدر { مِّمَّا تَرَكَ ٱلْوَالِدَانِ وَٱلأَقْرَبُونَ وَلِلنِّسَآءِ } أيضاً بالغات\n عاقلات أم لا { نَصِيبٌ } مقدر { مِّمَّا تَرَكَ ٱلْوَالِدَانِ وَٱلأَقْرَبُونَ مِمَّا قَلَّ مِنْهُ } المتروك { أَوْ كَثُرَ نَصِيباً مَّفْرُوضاً } [النساء: 7] مقدراً في كتاب الله\n كما يجيء بيانه وتعيينه من قريب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: جملة { مما قل.. } الخ، بدل { مما ترك } ، و { نصيبًا }: مصدر مؤكد كقوله:\n[النساء:11] أي: نصب لهم نصيبًا مقطوعًا، أو حال، أو على الاختصاص، أعني: نصيبًا مقطوعًا. يقول الحقّ جلّ جلاله: وإذا مات ميت وترك مالاً فللرجال نصيب مما ترك آباءهم وأقاربهم، وللنساء نصيب مما ترك والدهن وأقاربهن كالإخوة والأخوات، مما ترك ذلك الميت قل أو كثر، { نصيبًا مفروضًا } واجبًا محتمًا. رُوِيَ أنَّ أَوْسَ بنَ ثَابتِ الأنْصَارِيَّ تُوفِيَّ، وتَركَ امرأة يقال لها: أم كَحَّة وثلاثّ بناتٍ، فأخذ ابْنَا عَمّ الميتِ المَالَ، ولم يُعْطيا المرأَة ولا بَنَاتِه شيئًا، وكان أَهلُ الجَاهلِيَّة لا يُورِّثُون النِّسَاءَ ولا الصغيرَ ولو كان ذكرًا، ويقولون: إنما يَرث مَنْ يُحارب ويَذب عن الموروث، فجاءت أمُ كحة إلى رسول الله صلى الله عليه وسلم وهو في مسجد الفضيخ، فقالت: يا رسول الله إن أوس بن ثابت مات، وترك بنات ثلاثًا، وأنا اِمْرأته، ولَيْس عِنْدِي مال أُنْفقُه عَليهنّ، وقد تَرَك أبُوهُن مالاً حسنًا، وهو عند سُويْدٍ وعَرْفَجَة، فَدَعاهُما النبيُّ صلى الله عليه وسلم، فقالا: يا رسُولَ الله ولَدُها لا يَركُب فَرسًا، ولا يَحْمِل سِلاَحًا، لا ينُكأ عَدُوًّا، فقال النبي صلى الله عليه وسلم:\n \" انْصَرِفُوا حتى أرى ما يُحدِثُ الله تعالى \" \n، فانْصرَفُوا. فنزلت الآية. فأثبت الله لهن في الآية حقًا، ولم يُبِّين كم هو ــ فأرسل النبي صلى الله عليه وسلم إلى سُويد وعَرفجَة:\n \" لا تُفرقا مِنْ مَال أوْسٍ شَيئًا، فَإنّ الله تعالى جَعَل لِبنَاتِه نَصِيبًا، ولم يبَّين كم هو حتى أنظُرَ ما يُنزل الله تعالى \" \n، فأنزل الله تعالى بعدُ:\n[النساء: 11]... إلى قوله...\n[النساء: 13]. فأرسل إليهما:\n \" أن ادفعا إلى أم كحة الثُّمْن، وإلى بناته الثُّلثين، ولكما باقي المال \". \nالإشارة: كما جعل الله للنساء نصيبًا من الميراث الحسي جعل لهن نصيبًا من الميراث المعنوي، وهو السر، إن صحبتْ أهل السر، وكان لها أبو الروحانية، وهو الشيخ، فللرجال نصيب مما ترك لهم أشياخهم من سر الولاية، وللنساء كذلك على قدر ما سبق في القسمة الأزلية، قليلة كانت أو كثيرة، نصيبًا مفروضًا معينًا في علم الله وقدره، وقد سواهن الله تعالى مع الرجال في آية السير، فقال:\n[الأحزَاب:35] إلى آخر الآية، فمَنْ صار منهن مع الرجال أدرك ما أدركوا. وبالله التوفيق.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:118",
      "similarity": 0.5843808470881464
    },
    {
      "verse": "66:2",
      "similarity": 0.42166931609274644
    },
    {
      "verse": "28:85",
      "similarity": 0.40299590048971173
    },
    {
      "verse": "24:1",
      "similarity": 0.38618675791144497
    },
    {
      "verse": "4:33",
      "similarity": 0.3544765297324712
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004007.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004007.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}