{
  "chapter": "النساء",
  "text": "للرجال نصيب مما ترك الولدان والاقربون وللنساء نصيب مما ترك الولدان والاقربون مما قل منه او كثر نصيبا مفروضا",
  "translations": [
    {
      "translation": "Men receive a share of what their parents and relatives leave and women receive a share of what their parents and relatives leave, a fixed share, no matter whether it is a little or a lot.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men have a share in what the parents and relatives leave behind at death; and women have a share in what the parents and relatives leave behind. Be it large or small a legal share is fixed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Just as there is a share for men in what their parents and kinsfolk leave behind, so there is a share for women in what their parents and kinsfolk leave behind - be it little or much - a share ordained (by Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Male and female are entitled to their legal share in the legacy of their parents and relatives, whether it be small or large.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For men is a share from what the parents and near relatives leave behind, and for women is a share from what the parents and near relatives leave behind, whether the wealth (inheritance) is small or large; the share is a fixed one.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a share for men and a share for women from what is left by parents and those nearest in relation, whether the property be small or large -- a legal share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men shall have a portion of what the parents and the near relatives leave, and women shall have a portion of what the parents and the near relatives leave, whether there is little or much of it; a stated portion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the men a share of what parents and kinsmen leave, and to the women a share of what parents and kinsmen leave, whether it be little or much, a share apportioned;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto the men (of a family) belongeth a share of that which parents and near kindred leave, and unto the women a share of that which parents and near kindred leave, whether it be little or much - a legal share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men shall have a share in what parents and relatives leave behind, and women shall have a share in what parents and relatives leave behind, whether it be little or much. This is ordained [by God].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto males shall be a portion of that which their parents and others near of kin may leave; and unto females shall be a portion of that which their parents and other near of kin may leave, whether it be small or large, a portion allotted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men have a share in the heritage left by parents and near relatives, and women have a share in the heritage left by parents and near relatives, whether it be little or much, a share ordained [by Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From what is left by parents and those nearest related there is a share for men and a share for women, whether the property be small or large,-a determinate share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a share for men and a share for women from what is left by parents and those nearest related, whether, the property be small or large - a legal share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men shall have a share in what their parents and kinsmen leave, and women shall have a share in what their parents and kinsmen leave, whether it is little or abundant, it is an obligated share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Men receive a share of what their parents and relatives leave, and women receive a share of what their parents and relatives leave; be it little or much—a legal share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For men is a share of what the parents and close relatives leave, and for women is a share of what the parents and close relatives leave, be it little or much - an obligatory share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:7] The following was revealed as a repudiation of pre-Islamic practices in which women and children were not given any inheritance: To the men, young ones and kin, belongs a share, a portion, of what, deceased, parents and kinsmen leave, and to the women belongs a share of what parents and kinsmen leave, whether it, the property, be little or much. God has made it, an obligatory share, apportioned, to be given to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned the share of men and women in inheritance-because they were not in the habit of 82 giving any inheritance to women and children-saying: (Unto the men (of a family) belongeth a share of that which parents and near kindred leave, and unto the women a share of that which parents and near kindred leave, whether it is a little or much) whether the inheritance is much or little (a legal share) a determined share whether it is much or little, but He did not specify these shares. Allah did expound consequently on the exact value of these shares. This verse was revealed about Umm Kuhhah and her daughters who had an uncle who did not give them anything from their inheritance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لمَّا أمر أولاً سبحانه عباده بالتقوى على وجه المبالغة والتأكيد، وقَرَنَ عليه حفظ الأرحام ومراعاة الأيتام، ومواساة السفهاء المنحطين عن درجة العقلاء، أراد أن يبين أحوال المواريث والمتوارثين مطلقاً، حتى لا يقع التغالب والتظالم فيها كما في الجاهلية الأولى؛ إذ روي أنهم لا يرثون النساء معللين بأنهن لا يحضرن الوغى ولا يدفعون العدو\n\n\n\n\nرد الله عليهم وعيَّن لكل واحد من الفريقين نصيباً مفروزاً مفروظاً، فقال: { لِّلرِّجَالِ } سواء كانوا بالغين أم لا، عقلاء أم سفهاء { نَصيِبٌ } بينهم مفروض مقدر { مِّمَّا تَرَكَ ٱلْوَالِدَانِ وَٱلأَقْرَبُونَ وَلِلنِّسَآءِ } أيضاً بالغات، عاقلات أم لا { نَصِيبٌ } مقدر { مِّمَّا تَرَكَ ٱلْوَالِدَانِ وَٱلأَقْرَبُونَ مِمَّا قَلَّ مِنْهُ } المتروك { أَوْ كَثُرَ نَصِيباً مَّفْرُوضاً } [النساء: 7] مقدراً في كتاب الله، كما يجيء بيانه وتعيينه من قريب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: جملة { مما قل\n\n } الخ، بدل { مما ترك } ، و { نصيبًا }: مصدر مؤكد كقوله:\n\n[النساء:11] أي: نصب لهم نصيبًا مقطوعًا، أو حال، أو على الاختصاص، أعني: نصيبًا مقطوعًا\n يقول الحقّ جلّ جلاله: وإذا مات ميت وترك مالاً فللرجال نصيب مما ترك آباءهم وأقاربهم، وللنساء نصيب مما ترك والدهن وأقاربهن كالإخوة والأخوات، مما ترك ذلك الميت قل أو كثر، { نصيبًا مفروضًا } واجبًا محتمًا\n رُوِيَ أنَّ أَوْسَ بنَ ثَابتِ الأنْصَارِيَّ تُوفِيَّ، وتَركَ امرأة يقال لها: أم كَحَّة وثلاثّ بناتٍ، فأخذ ابْنَا عَمّ الميتِ المَالَ، ولم يُعْطيا المرأَة ولا بَنَاتِه شيئًا، وكان أَهلُ الجَاهلِيَّة لا يُورِّثُون النِّسَاءَ ولا الصغيرَ ولو كان ذكرًا، ويقولون: إنما يَرث مَنْ يُحارب ويَذب عن الموروث، فجاءت أمُ كحة إلى رسول الله صلى الله عليه وسلم وهو في مسجد الفضيخ، فقالت: يا رسول الله إن أوس بن ثابت مات، وترك بنات ثلاثًا، وأنا اِمْرأته، ولَيْس عِنْدِي مال أُنْفقُه عَليهنّ، وقد تَرَك أبُوهُن مالاً حسنًا، وهو عند سُويْدٍ وعَرْفَجَة، فَدَعاهُما النبيُّ صلى الله عليه وسلم، فقالا: يا رسُولَ الله ولَدُها لا يَركُب فَرسًا، ولا يَحْمِل سِلاَحًا، لا ينُكأ عَدُوًّا، فقال النبي صلى الله عليه وسلم:\n\n \" انْصَرِفُوا حتى أرى ما يُحدِثُ الله تعالى \" \n\n، فانْصرَفُوا\n فنزلت الآية\n فأثبت الله لهن في الآية حقًا، ولم يُبِّين كم هو ــ فأرسل النبي صلى الله عليه وسلم إلى سُويد وعَرفجَة:\n\n \" لا تُفرقا مِنْ مَال أوْسٍ شَيئًا، فَإنّ الله تعالى جَعَل لِبنَاتِه نَصِيبًا، ولم يبَّين كم هو حتى أنظُرَ ما يُنزل الله تعالى \" \n\n، فأنزل الله تعالى بعدُ:\n\n[النساء: 11]\n\n\n إلى قوله\n\n\n\n\n[النساء: 13]\n فأرسل إليهما:\n\n \" أن ادفعا إلى أم كحة الثُّمْن، وإلى بناته الثُّلثين، ولكما باقي المال \"\n \n\nالإشارة: كما جعل الله للنساء نصيبًا من الميراث الحسي جعل لهن نصيبًا من الميراث المعنوي، وهو السر، إن صحبتْ أهل السر، وكان لها أبو الروحانية، وهو الشيخ، فللرجال نصيب مما ترك لهم أشياخهم من سر الولاية، وللنساء كذلك على قدر ما سبق في القسمة الأزلية، قليلة كانت أو كثيرة، نصيبًا مفروضًا معينًا في علم الله وقدره، وقد سواهن الله تعالى مع الرجال في آية السير، فقال:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:118",
      "similarity": 0.5843808470881464
    },
    {
      "verse": "66:2",
      "similarity": 0.42166931609274644
    },
    {
      "verse": "28:85",
      "similarity": 0.40299590048971173
    },
    {
      "verse": "24:1",
      "similarity": 0.38618675791144497
    },
    {
      "verse": "4:33",
      "similarity": 0.3544765297324712
    }
  ]
}