{
  "chapter": "النساء",
  "text": "ذلك الفضل من الله وكفى بالله عليما",
  "translations": [
    {
      "translation": "That is favour from Allah. Allah suffices as a Knower.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a favour from God; and sufficient is God, the all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is a bounty from Allah, and Allah suffices to know the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The favors of God are such, and He knows very well (how to reward you).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is Allah’s munificence; and Allah is Sufficient, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the bounty from Allah, and Allah is sufficient as All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is grace from Allah, and sufficient is Allah as the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the bounty from God; God suffices as One who knows.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is bounty from Allah, and Allah sufficeth as Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is God's favour. Sufficient is God's infinite knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the grace from Allah, and sufficeth Allah as Knower!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the grace of Allah, and Allah suffices as knower [of His creatures].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the bounty from Allah: And sufficient is it that Allah knoweth all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the Bounty from Allah, and Allah is Sufficient as All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Bounty of Allah. It is sufficient that Allah is the Knowledgeable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the grace from God. God suffices as Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the bounty from Allah, and sufficient is Allah as Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:70] That, namely, their being with those mentioned (dhālika, ‘that’, is the subject, the predicate of which is [the following]) is bounty from God, with which He has favoured them, and not because they have earned it through their obedience. God suffices as Knower, of the reward of the Hereafter, in other words, trust in what He has told you: None can tell you like One Who is aware [Q. 35:14].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Such) keeping the company of the prophets, saints, martyrs and righteous (is the bounty of Allah) a favour from Allah, (and Allah sufficeth as knower) of the love of Thawban and the honour and reward bestowed upon him in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذٰلِكَ ٱلْفَضْلُ } والهداية والرفاقة مع هؤلاء العظماء وللإنعام تفضلاً { مِنَ ٱللَّهِ } وامتناناً منه لا صنع للعبد فيه، ولا علم لأحد في كيفيته وكيمته { وَكَفَىٰ بِٱللَّهِ عَلِيماً } [النساء: 70] في مقدوراته وهوهوبته\n\n\n\n\nهب لنا من لدنك رحمة إنك أنت الوهاب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك الفضل من الله } إشارة إلى ما للمطيعين من الأجور، ومزيد القرب والحضور، وأنه فضل تفضل على عباده، { وكفى بالله عليمًا } بمقادير الأعمال والمقامات\n فيُجازى كُلاًّ على حسب مقامه\n والله تعالى أعلم\n الإشارة: اعلم أن الطاعة التي توجب المعية الحسية في النعيم الحسي الجسماني هي الطاعة الظاهرة الحسية\n والطاعة التي توجب المعية المعنوية في النعيم الروحاني هي الطاعة الباطنية القلبية\n فالمعية الحسية صاحبها مفروق، والمعية المعنوية صاحبها مجموع، لا يغيب عن حبيبه لحظة\n هؤلاء هم الصديقون المقربون\n وفوقهم الأنبياء، وتحتهم الشهداء والصالحون\n وبيان ذلك أن العلم بالله تعالى: إما أن يكون عن كشف الحجاب وانقشاع السحاب، أعني سحاب الأثر، وهم أهل الشهود والعيان\n وإما أن يكون من وراء الحجاب، يأخذون أجرهم من وراء الباب، يستدلون بالآثار على المؤثر\n وهم أهل الدليل والبرهان\n والأولون إما أن يرتقوا إلى مكافحة الوحي ورؤية الملائكة الكرام\n وهم الأنبياء والرسل ـ عليه الصلاة والسلام -، وإما أن يقصروا عن درجة الوحي ويكون لهم وحي إلهام، وهم الصديقون أهل الحال والمقام، فقد اشتركوا في مقام العيانِ\n لكن مقام الحضرة فضاؤه واسع، والترقي في معارج أسرار التوحيد غير متناهٍ، فحيث انتهى قدم الولي ابتدأ ترقي النبي، وأما أهل الحجاب فإما أن يكون علمهم بالله بالبراهين القطعية والدلائل السمعية، وهم العلماء الراسخون، وهو مقام الشهداء، وإما أن يكون علمهم بالرياضات والمجاهدات وتواتر الكرامات، وهم العباد والزهاد\n وهو مقام الصالحين، ويلتحق بهم عوام المسلمين، لأن كل مقام من هذه المقامات في درجات ومقامات لا يحصرها إلا العالم بها\n والله تعالى أعلم\n\n",
      "translations": []
    }
  ]
}