{
  "chapter": "النساء",
  "text": "وان منكم لمن ليبطئن فان اصبتكم مصيبة قال قد انعم الله على اذ لم اكن معهم شهيدا",
  "translations": [
    {
      "translation": "Among you there are people who hang back and if you encounter a setback then they say, 'Allah has blessed me in that I was not there with them.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Someone among you will surely lag behind, and if calamity should befall you, will say: \"God was gracious to me that I was not among them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among you there is such who lags behind, then if some affliction strikes you, he says: 'Indeed Allah bestowed His favour upon me that I was not present with them.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some among you who lag behind (in battle) and if you were to experience hardship, they would say, \"It was certainly due to God's favors to us that we were not present with them,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed among you is one who will certainly loiter behind; then if some disaster were to befall you, he would say, “It was Allah’s grace upon me that I was not present with them!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is certainly among you he who would linger behind. If a misfortune befalls you, he says, \"Indeed Allah has favored me in that I was not present among them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely among you is he who would certainly hang back! If then a misfortune befalls you he says: Surely Allah conferred a benefit on me that I was not present with them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of you there are that are dilatory; then, if an affliction visits you, he says, 'God has blessed me, in that I was not a martyr with them.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! among you there is he who loitereth; and if disaster overtook you, he would say: Allah hath been gracious unto me since I was not present with them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among you are some who lag behind and if you encounter a setback, they say, \"God has been gracious to me; I was not present with them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily there Is among you he who laggeth behind, and if an ill befalleth you, he saith: surely Allah hath bestowed favour on me in that I was not Present with them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among you is indeed he who drags his feet, and should an affliction visit you, he says, ‘It was certainly Allah’s blessing that I did not accompany them!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are certainly among you men who would tarry behind: If a misfortune befalls you, they say: \"Allah did favour us in that we were not present among them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is certainly among you he who would linger behind (from fighting in Allah's Cause). If a misfortune befalls you, he says, \"Indeed Allah has favoured me in that I was not present among them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, there are among you, he who lingers, then, if an affliction hits you, he would say: 'Allah has favored me, that I was not a martyr with them'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among you is he who lags behind. Then, when a calamity befalls you, he says, “God has favored me, that I was not martyred with them.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, there is among you he who lingers behind; and if disaster strikes you, he says, \"Allah has favored me in that I was not present with them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:72] Verily, there are some of you who tarry, who indeed hesitate to join the fighting, such as ‘Abd Allāh b. Ubayy, the hypocrite, and his companions — counting him [the one who tarries] as one of them [the Muslims] is from the perspective of outward appearances — (the lām in the verb [la-yubatti’anna, ‘verily … who tarry’] is for oaths); then, if an affliction befalls you, such as slaughter or defeat, he says, ‘God has been gracious to me, for I was not a witness with them’, present [at the fighting], lest I should be hurt.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله : { وإنَّ مِنكم لمن ليبطّئنّ } أي من جماعتكم وعدادكم ، والخبر الوارد فيهم ظاهر منه أنَّهم ليسوا بمؤمنين في خلوتهم ، لأنّ المؤمن إن أبطأ عن الجهاد لا يقول : «قد أنعم الله عليَّ إذ لم أكن معهم شهيداً» ، فهؤلاء منافقون ، وقد أخبر الله عنهم بمثل هذا صراحة في آخر هذه السورة بقوله : { بشّر المنافقين بأنّ لهم عذاباً أليماً } إلى قوله : { الذين يتربّصون بكم فإن كان لكم فتح من الله قالوا ألم نكن معكم وإن كان للكافرين نصيب قالوا ألم نستحوذ عليكم ونمنعكم من المؤمنين } \\[ النساء : 138 141 \\] . وعلى كون المراد ب { من ليبطّئنّ } المنافقين حمَل الآية مجاهد ، وقتادة ، وابن جريج . وقيل : أريد بهم ضعفة المؤمنين يتثاقلون عن الخروج إلى أن يتّضح أمر النصر . قال الفخر «وهذا اختيار جماعة من المفسرين» وعلى هذا فمعنى و { منكم } أي من أهل دينكم . وعلى كلا القولين فقد أكّد الخبر بأقوى المؤكّدات لأنّ هذا الخبر من شأنه أن يتلقى بالاستغراب . وبَطَّأ بالتضعيف قاصر ، بمعنى تثاقل في نفسه عن أمر ، وهو الإبطاء عن الخروج إبطاء بداعي النفاق أو الجبْن . والإخبار بذلك يستتبع الإنكار عليه ، والتعريض به ، مع كون الخبر باقياً على حقيقته لأنّ مستتبعات التراكيب لا توصف بالمجاز .وقوله : { فإن أصابتكم مصيبة } تفريع عن { ليَبطّئنّ } ، إذ هذا الإبطاء تارة يجرّ له الابتهاج بالسلامة ، وتارة يجرّ له الحسرة والندامة .و ( المصيبَة ) اسم لما أصاب الإنسان من شرّ ، والمراد هنا مصيبة الحرب أعني الهزيمة من قتل وأسر .ومعنى { أنعم الله عليّ } الإنعام بالسلامة : فإن كان من المنافقين فوصف ذلك بالنعمة ظاهر؛ لأنّ القتل عندهم مصيبة محْضة إذ لا يرجون منه ثواباً؛ وإن كان من ضعفة المؤمنين فهو قد عَدَّ نعمة البقاء أولى من نعمة فضل الشهادة لشدّة الجبن ، وهذا من تغليب الداعي الجبليّ على الداعي الشرعي .والشهيد على الوجه الأوّل : إمّا بمعنى الحاضر المشاهد للقتال ، وإمّا تهكّم منه على المؤمنين مثل قوله : { هم الذين يقولون لا تنفقوا على مَنْ عندَ رسول الله } \\[ المنافقون : 7 \\] ؛ وعلى الوجه الثاني الشهيد بمعناه الشرعي وهو القتيل في الجهاد .\n\n",
      "translations": [
        {
          "translation": "(Lo! among you) group of believers (there is he who loitereth) there is him who cannot bring himself to go out in the way of Allah-meaning 'Abdullah Ibn Ubayy-but rather waits to see what happens to you on your expedition; (and if) on your expedition (disaster) death, defeat or hardship (overtook you, he) 'Abdullah Ibn Ubayy (would say: Allah hath been gracious unto me) by my staying back (since I was not present with them) on that expedition.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِنَّ مِنْكُمْ لَمَن لَّيُبَطِّئَنَّ } أي: وإن أناساً منكم والله ليتكاسلن\n ويتثاقلن لنفاقهم ومرض قلوبهم { فَإِنْ أَصَٰبَتْكُمْ مُّصِيبَةٌ } قتل وهزيمة { قَالَ } المنافق المتكاسل { قَدْ أَنْعَمَ ٱللَّهُ عَلَيَّ } بسبب هذا البطء والتأخير { إِذْ لَمْ أَكُنْ مَّعَهُمْ شَهِيداً } النساء: 72] حاضراً فيصيبني ما أصابهم\n\n\n{ وَلَئِنْ أَصَٰبَكُمْ فَضْلٌ مِنَ الله لَيَقُولَنَّ } متمنياً من فرط تحسره وتحسده بكم { كَأَن لَّمْ تَكُنْ بَيْنَكُمْ وَبَيْنَهُ مَوَدَّةٌ } أي: كتحسر الأعداء للأعداء: { يٰلَيتَنِي كُنتُ مَعَهُمْ فَأَفُوزَ فَوْزاً عَظِيماً } [النساء: 73] مثل ما فازوا\n\n\nوإن أبطأ المنافقون في أمر القتال\n وتكاسلوا نفاقاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { لَمَن ليبطئن } اللام الأولى للابتداء\n والثانية للقسم\n أي: وإنَّ منكم ـ أُقسم بالله ـ لمن ليبطئن\n وجملة: { كأن لم يكن }: اعتراضية بين القول والمقول\n تنبيهًا على ضعف عقيدتهم\n وأن قولهم هذا قولُ من لا مواصلة بينكم وبينه\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا } تأهبوا واستعدوا لجهاد الأعداء\n و { خذوا حذركم } منهم بالعُدَّةِ والعَدَد\n ولا تلقوا بأيديكم إلى التهلكة\n ولا حجة فيه للقدرية لأن هذا من الأسباب التي ستر الله بها أسرار القدرة\n وقد قال لنبيِّه ـ عليه الصلاة والسلام ـ:\n[التوبة:51] وقال ـ عليه الصلاة والسلام ـ:\n \" اعقلها وتوكل \" \nوفي ذلك طمأنينة للقلوب التي لم تطمئن وتشريعًا للضعفاء\n فإذا تأهبتم واستعددتم { فأنفروا } أي: اخرجوا إلى الجهاد { ثُباتٍ } أي: جماعات متفرقة\n سرية بعد سرية\n { أو انفروا جميعًا } أي: مجتمعين مع نبيكم\n أو مع أميركم\n { وإن منكم } يا معشر المسلمين { لمن ليبطئن } الناس عن الجهاد\n أول ليتثاقلن ويتخلفن عنه\n وهو عبدالله بن أُبُيّ المنافق\n وأشباهه من المنافقين\n { فإن أصابتكم مصيبة } كقتل أو هزيمة { قال قد أنعم الله عليّ } حين تخلفت { إذا لم أكن معهم شهيدًا } فيصيبني ما أصابهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:73",
      "similarity": 0.053156329089395056
    },
    {
      "verse": "4:79",
      "similarity": 0.04898938956616806
    },
    {
      "verse": "7:131",
      "similarity": 0.045344622686331756
    },
    {
      "verse": "9:52",
      "similarity": 0.04422630805504538
    },
    {
      "verse": "59:11",
      "similarity": 0.041985833046687134
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004072.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004072.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:72.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}