{
  "chapter": "النساء",
  "text": "ولئن اصبكم فضل من الله ليقولن كان لم تكنۢ بينكم وبينه مودة يليتنى كنت معهم فافوز فوزا عظيما",
  "translations": [
    {
      "translation": "But if success comes to you from God he will say, as though no love existed between you and him: \"I wish I were with them, for I would have certainly met with great success.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a bounty from Allah is given you, he says - and says as if there never was any affection between you and him - 'Oh, would that I had been with them, I would have come by a great gain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but if you were to receive a favor from God, they would certainly say, \"(We have been ignored) as if there was no friendship among us. Would that we had been there with them for we would have had a great success.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And were you to receive Allah’s munificence (a bounty), he would surely say – as if there had been no friendship between you and him – “Alas – if only I had been with them, I would have achieved a great success!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if a bounty comes to you from Allah, he would surely say ـ as if there had never been ties of affection between you and him, \"Oh! I wish I had been with them; then I would have achieved a great success.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if grace from Allah come to you, he would certainly cry out, as if there had not been any friendship between you and him: Would that I had been with them, then I should have attained a mighty good fortune.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if a bounty from God visits you, he will surely say, as if there had never been any affection between you and him, 'Would that I had been with them, to attain a mighty triumph!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a bounty from Allah befell you, he would surely cry, as if there had been no love between you and him: Oh, would that I had been with them, then should I have achieved a great success!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if, by God's grace, good fortune should be your lot, they will say, \"If only I had been with them I should have achieved a great success,\" as if no affection had existed between you and them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there betideth you grace from Allah, then, as though there had been no tenderness between you and him, he saith: would that I had been with them! then I would have achieved a mighty achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But should a bounty from Allah come to you, he will say—as if there were no [tie of friendship and] affection between you and him—‘I wish I were with them so that I had achieved a great success!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if good fortune comes to you from Allah, they would be sure to say - as if there had never been Ties of affection between you and them - \"Oh! I wish I had been with them; a fine thing should I then have made of it!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if a bounty (victory and booty) comes to you from Allah, he would surely say - as if there had never been ties of affection between you and him - \"Oh! I wish I had been with them; then I would have achieved a great success (a good share of booty).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But, if the Bounty of Allah reaches you, he would surely say as if there had never been any affection between you and him: 'Would that I had been with them! I should have indeed won a great triumph'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when some bounty from God comes to you, he says—as if no affection existed between you and him—“If only I had been with them, I would have achieved a great victory.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if bounty comes to you from Allah, he will surely say, as if there had never been between you and him any affection. \"Oh, I wish I had been with them so I could have attained a great attainment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:73] But if (wa-la-in, the lām is for oaths) a bounty from God befalls you, such as a conquest or booty, he will surely cry, in regret, as if (ka’an is softened, its subject having been omitted, in other words [it should be] ka’annahu) there had never been (read lam yakun, or lam takun) any affection, any acquaintance or friendship, between you and him: this [statement] refers back to the words [in the previous verse] ‘God has been gracious to me’, and comes as a parenthesis between the statement ‘that he will cry’ and the very words he cries, which are: ‘Oh (yā, is for exclamation), would that I had been with them, so that I might have won a great triumph!’, that is, [that] I might have taken a good share of the booty.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if) on that expedition (a bounty) conquest and booty (from Allah befell you, he) 'Abdullah Ibn Ubayy (would surely cry, as if there had been no love between you and him:) a bond of Religion and acquaintance due to keeping each other's company between you (Oh, would that I had been with them!) on the expedition, (then should I have achieved a great success) I would have gained abundant booty and a great share.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَئِنْ أَصَٰبَكُمْ فَضْلٌ مِنَ الله لَيَقُولَنَّ } متمنياً من فرط تحسره وتحسده بكم { كَأَن لَّمْ تَكُنْ بَيْنَكُمْ وَبَيْنَهُ مَوَدَّةٌ } أي: كتحسر الأعداء للأعداء: { يٰلَيتَنِي كُنتُ مَعَهُمْ فَأَفُوزَ فَوْزاً عَظِيماً } [النساء: 73] مثل ما فازوا\n\n\n\n\nوإن أبطأ المنافقون في أمر القتال، وتكاسلوا نفاقاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}