{
  "chapter": "النساء",
  "text": "فليقتل فى سبيل الله الذين يشرون الحيوة الدنيا بالءاخرة ومن يقتل فى سبيل الله فيقتل او يغلب فسوف نؤتيه اجرا عظيما",
  "translations": [
    {
      "translation": "So let those who sell the life of this world for the Next World fight in the Way of Allah. If someone fights in the Way of Allah, whether he is killed or is victorious, We will pay him an immense reward.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who barter the life of this world for the next should fight in the way of God. And We shall bestow on him who fights in the way of God, whether he is killed or is victorious, a glorious reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let those who seek the life of the Next World in exchange for the life of this world fight in the way of Allah. We shall grant a mighty reward to whoever fights in the way of Allah, whether he is slain or comes out victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who want to buy the life hereafter with this life should fight for the cause of God. We will give them a great reward whether they are killed or whether they are victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So those who sell the life of this world for the Hereafter, must fight in Allah's cause; and We shall bestow a great reward upon whoever fights in Allah's cause, whether he is martyred or is victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So fight those who trade the life of this world with the Hereafter, in the cause of Allah, and whoever fights in the cause of Allah, and is killed or gets victory, We shall bestow on him a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore let those fight in the way of Allah, who sell this world's life for the hereafter; and whoever fights in the way of Allah, then be he slain or be he victorious, We shall grant him a mighty reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let them fight in the way of God who sell the present life for the world to come; and whosoever fights in the way of God and is slain, or conquers, We shall bring him a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let those fight in the way of Allah who sell the life of this world for the other. Whoso fighteth in the way of Allah, be he slain or be he victorious, on him We shall bestow a vast reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let those who would exchange the life of this world for the Hereafter, fight for the cause of God; whoever fights for the cause of God, whether he is slain or is victorious, to him We shall give a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let them wherefore fight in the way of Allah those who have purchased the life of this world for the Hereafter: And whosoever fighteth in the way of Allah, and is then slain or overcometh, We shall vouchsafe unto him a mighty hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let those who sell the life of this world for the Hereafter fight in the way of Allah; and whoever fights in the way of Allah, and then is slain, or he subdues [the enemy], We shall soon give him a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let those fight in the cause of Allah Who sell the life of this world for the hereafter. To him who fighteth in the cause of Allah,- whether he is slain or gets victory - Soon shall We give him a reward of great (value).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let those (believers) who sell the life of this world for the Hereafter fight in the Cause of Allah, and whoso fights in the Cause of Allah, and is killed or gets victory, We shall bestow on him a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let those who sell the worldly life for the Everlasting Life fight in the way of Allah, whoever fights in the way of Allah, and is killed or conquers, We shall give him a great wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let those who sell the life of this world for the Hereafter fight in the cause of God. Whoever fights in the cause of God, and then is killed, or achieves victory, We will grant him a great compensation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let those fight in the cause of Allah who sell the life of this world for the Hereafter. And he who fights in the cause of Allah and is killed or achieves victory - We will bestow upon him a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:74]   God, exalted be He, says: So let them fight in the way of God, to elevate His religion, those who sell the life of this world for the Hereafter; and whoever fights in the way of God and is slain, dies a martyr, or conquers, overcomes his enemy, We shall give him a great wage, a plentiful reward.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then commanded them to fight in the way of Allah, if they happened to be hypocrites, saying: (Let those fight in the way of Allah) in obedience of Allah (who sell the life of this world for the other) those who prefer this world over the next; it is also said that this verse was revealed about sincere believers, telling them: let those who prefer the Hereafter over this world fight in the way of Allah. Then Allah mentioned their reward, saying: (Whoso fighteth in the way of Allah) in obedience of Allah, (be he slain) martyred (or be he victorious) triumphant over the enemy, (on him We shall bestow) in both cases (a vast reward) an abundant reward in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلْيُقَاتِلْ } المخلصون المبادرون إلى الفناء { فِي سَبِيلِ ٱللَّهِ } مع المشركين { ٱلَّذِينَ يَشْرُونَ } ويختارون { ٱلْحَيَاةَ ٱلدُّنْيَا بِٱلآخِرَةِ } أي: بدلها، ويبيعونها بها { وَمَن يُقَاتِلْ فِي سَبِيلِ ٱللَّهِ } ترويجاً لتوحيده مع هؤلاء المشركون المصرين على الشرك { فَيُقْتَلْ } في أيديهم { أَو يَغْلِبْ } عليهم { فَسَوْفَ نُؤْتِيهِ } من لدنا { أَجْراً عَظِيماً } [النساء: 74] لا كأجر الدنيا ولا كأجر الآخرة المتربتة على الأعمال الصالحة، بل الشهداء منهم أحياء عند الله يرزقون، فرحين بما آتاهم الله من فضله، والغزاة فهم في حمى الله وكنف حفظه وجواره\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:86",
      "similarity": 0.42294134213597245
    },
    {
      "verse": "30:3",
      "similarity": 0.40147029140166857
    },
    {
      "verse": "4:44",
      "similarity": 0.3791788300616467
    },
    {
      "verse": "7:113",
      "similarity": 0.3750748692489494
    },
    {
      "verse": "2:175",
      "similarity": 0.37113847886013074
    }
  ]
}