{
  "chapter": "النساء",
  "text": "وما لكم لا تقتلون فى سبيل الله والمستضعفين من الرجال والنساء والولدن الذين يقولون ربنا اخرجنا من هذه القرية الظالم اهلها واجعل لنا من لدنك وليا واجعل لنا من لدنك نصيرا",
  "translations": [
    {
      "translation": "What has come upon you that you fight not in the cause of God and for the oppressed, men, women and children, who pray: \"Get us out of this city, O Lord, whose people are oppressors; so send us a friend by Your will, and send us a helper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How is it that you do not fight in the way of Allah and in support of the helpless - men, women and children -who pray: 'Our Lord, bring us out of this land whose people are oppressors and appoint for us from Yourself, a protector, and appoint for us from Yourself a helper'?.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why do you not fight for the cause of God or save the helpless men, women, and children who cry out, \"Lord, set us free from this town of wrong doers and send us a guardian and a helper?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what is the matter with you, that you should not fight in Allah’s cause and for the feeble men, and women, and children, who invoke, “Our Lord! Liberate us from this town, the people of which are unjust; and give us a protector from Yourself; and give us a supporter from Yourself.” (Allah has created many supporters for the believers.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what is wrong with you that you fight not in the cause of Allah, and for those weak, ill-treated and oppressed among men, women, and children, whose cry is: \"Our Lord! Rescue us from this town whose people are oppressors; and raise for us from You one who will protect, and raise for us from You one who will help.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what reason have you that you should not fight in the way of Allah and of the weak among the men and the women and the children, (of) those who say: Our Lord! cause us to go forth from this town, whose people are oppressors, and give us from Thee a guardian and give us from Thee a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How is it with you, that you do not fight in the way of God, and for the men, women, and children who, being abased, say, 'Our Lord, bring us forth from this city whose people are evildoers, and appoint t us a protector from Thee, and appoint to us from Thee a helper'?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How should ye not fight for the cause of Allah and of the feeble among men and of the women and the children who are crying: Our Lord! Bring us forth from out this town of which the people are oppressors! Oh, give us from thy presence some protecting friend! Oh, give us from Thy presence some defender!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how should you not fight for the cause of God, and for the helpless old men, women, and children who say, \"Deliver us, Lord, from this city of wrongdoers, grant us a protector out of Your grace and grant us a supporter out of Your grace?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what aileth you that ye fight not in the way of Allah and for the oppressed among men and women and Children who say: our Lord! take US forth from this town whereof the people are Wrong-doing, and appoint us from before Thee a patron, and appoint us from before Thee a helper!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should you not fight in the way of Allah and the oppressed men, women, and children, who say, ‘Our Lord, bring us out of this town whose people are oppressors, and appoint for us a guardian from Yourself, and appoint for us a helper from Yourself’?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should ye not fight in the cause of Allah and of those who, being weak, are ill-treated (and oppressed)?- Men, women, and children, whose cry is: \"Our Lord! Rescue us from this town, whose people are oppressors; and raise for us from Thee one who will protect; and raise for us from Thee one who will help!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what is wrong with you that you fight not in the Cause of Allah, and for those weak, ill-treated and oppressed among men, women, and children, whose cry is: \"Our Lord! Rescue us from this town whose people are oppressors; and raise for us from You one who will protect, and raise for us from You one who will help.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So why is it, that you do not fight in the way of Allah, and for the abased among men, women, and children who say: 'Our Lord, bring us out from this village whose people are harmdoers, and give to us a guardian from You, and give to us a helper from You.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why would you not fight in the cause of God, and the helpless men, and women, and children, cry out, “Our Lord, deliver us from this town whose people are oppressive, and appoint for us from Your Presence a Protector, and appoint for us from Your Presence a Victor.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what is [the matter] with you that you fight not in the cause of Allah and [for] the oppressed among men, women, and children who say, \"Our Lord, take us out of this city of oppressive people and appoint for us from Yourself a protector and appoint for us from Yourself a helper?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:75] What is wrong with you, that you do not fight: this is an interrogative of rebuke, in other words, there is nothing to prevent you from fighting, in the way of God, and for, the deliverance of, the oppressed men, women, and children, whom the disbelievers persecuted and prevented from emigrating. Ibn ‘Abbās, may God be pleased with him and his father, said, ‘My mother and I were among them’; who say, supplicating, ‘O, our Lord, bring us forth from this town, Mecca, whose people are evildoers, through unbelief, and appoint for us a protector from You, to take charge of our affair, and appoint for us from You a helper’, to defend us against them. God responded to their supplication and facilitated escape for some of them, while others remained behind until Mecca was conquered — in charge of them the Prophet (s) placed ‘Attāb b. Asīd, who proceeded to seek justice for the wronged from those that had wronged them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned their dislike of fighting in the way of Allah, saying: (How should ye) group of believers (not fight for the cause of Allah) in obedience of Allah against the people of Mecca (and of the feeble among men and of the women and the children who are crying) in Mecca: (Our Lord!) our Lord! (Bring us forth from out this town) i.e. Mecca (of which the people are oppressors!) whose people are idolaters (Oh, give us from Thy presence) from You (some protecting friend!) a protector, meaning: 'Itab Ibn Usayd. (Oh, give us from Thy presence) from You (some defender!) who would prevent us from suffering. Allah answered their prayers and made the Prophet (pbuh) their defender and 'Itab their protecting friend. 94\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا } عرض ولحق { لَكُمْ } أيها المؤمنون المبشرون بهذه البشارة العظمى { لاَ تُقَٰتِلُونَ فِي سَبِيلِ ٱللَّهِ } مع أعداء الله { وَ } لا تنقذون { ٱلْمُسْتَضْعَفِينَ } منكم من أيديهم { مِنَ ٱلرِّجَالِ وَٱلنِّسَآءِ وَٱلْوِلْدَٰنِ } الذين بقوا في مكة بعد الهجرة، فآذوهم واستذلوهم إلى أن استعبدوهم، وهم { ٱلَّذِينَ يَقُولُونَ } من غاية حزوننهم، ونهاية مذلتهم متضرعاً إلى الله مستشكياً إليه: { رَبَّنَآ أَخْرِجْنَا مِنْ هَـٰذِهِ ٱلْقَرْيَةِ ٱلظَّالِمِ أَهْلُهَا } إذ لا طقاة لنا بظلمهم { وَٱجْعَلْ لَّنَا مِن لَّدُنْكَ وَلِيّاً } يولي أمرنا، وينقذنا من أيديهم، ويخرجنا من بينهم { وَٱجْعَلْ لَّنَا مِن لَّدُنْكَ نَصِيراً } [النساء: 75] ينصرنا عليهم لينتقم عنهم، فاستجاب الله دعاءهم بأن ألحق بعضهم إلى المهاجرين، ونصر بعضهم بالنبي والمؤمنين حين فتحوا مكة - شرفها الله - فوصلوا إلى ما طلبوا من الله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ما } مبتدأ\n و { لكم } خبر\n و { لا تقاتلون } حال، و { المستضعفين } عطف على اسم الجلالة، أي: أيَ شيء حصل لكم حال كونكم غير مجاهدين في سبيل الله وفي تخليص المستضعفين؟ و { الظالم } نعت للقرية، وإنما ذُكَّر ولم يؤنث، لأنه أسند إلى المذكر، واسم الفاعل إذا جرى على غير مَن هُوَ لَهُ أجرى مجرى الفعل، فيذكر ويؤنث باعتبار الفاعل\n يقول الحقّ جلّ جلاله: { وما لكم } يا معشر المسلمين { لا تقاتلون في سبيل الله } ، وفي تخليص إخوانكم { المستضعفين } بمكة، الذين حبسهم العدو أو أسرهم ومنعهم من الهجرة { من الرجال والنساء والولدان } ، فهم في أيديهم مغللون ممتحنون\n قال البيضاوي: وإنما ذكر الولدان مبالغة في الحث وتنبيهًا على تناهي ظلم المشركين بحيث بلغ أذاهم الصبيان، وأن دعوتهم أجيبت بسبب مشاركتهم في الدعاء، حتى تشاركوا في استنزال الرحمة واستدفاع البلية\n هـ\n ثم ذكر دعاءهم فقال: { الذين يقولون ربنا أخرجنا من هذه القرية } أي: مكة { الظالم أهلها } بالشرك والطغيان حتى تعدى إلى النساء والصبيان\n { واجعل لنا من لدنك وليًّا } يصوننا عن أذاهم، { ونصيرًا } يمنعنا من التخلف عن الهجرة إلى رسولك صلى الله عليه وسلم، فاستجاب الله دعاءهم بأن يسَّر لبعضهم الخروج إلى المدينة، وجعل لمن بقي منهم أعظم ولي وناصر، بفتح مكة على نبيه صلى الله عليه وسلم، فتولاهم ونصرهم، واستعمل عليهم عتَّاب بن أسيد، فحماهم وأعزهم حتى صارو أعزاء أهلها، كما هي عادته سبحانه في إجابة دعاء المضطرين\n الإشارة: ما لكم يا معشر العِباد، وخصوصًا المريدين من أهل الجد والاجتهاد، لا تجاهدون نفوسكم في طريق الوصول إلى الله، كي تنالوا بذلك مشاهدة جماله وسناه، وتخلصوا ما كمن في نفوسكم من الأسرار، وما احتوت عليه من العلوم والأنوار\n فإن قرية البشرية قد احتوت عليها وأسرتها بظلمات شهواتها، واستضعفتها بتراكم غفلتها وتكثيف حجاب حسها\n فمن جاهدها استخلص جواهر تلك العلوم والأسرار مِن صَدَفِها\n وفي ذلك يقول ابن البنا في مباحثه:\n\nوقال أيضًا:\n",
      "translations": []
    }
  ]
}