{
  "chapter": "النساء",
  "text": "الذين ءامنوا۟ يقتلون فى سبيل الله والذين كفروا۟ يقتلون فى سبيل الطغوت فقتلوا۟ اولياء الشيطن ان كيد الشيطن كان ضعيفا",
  "translations": [
    {
      "translation": "Those who have iman fight in the Way of Allah. Those who are kafir fight in the way of false gods. So fight the friends of Shaytan! Shaytan's scheming is always feeble.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe fight in the way of God; and those who do not, only fight for the powers of evil; so you should fight the allies of Satan. Surely the stratagem of Satan is ineffective.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have faith fight in the way of Allah, while those who disbelieve fight in the way of taghut (Satan). Fight, then, against the fellows of Satan. Surely Satan's strategy is weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers fight for the cause of God. The unbelievers fight for the cause of the Satan. So fight against the friends of Satan for the evil plans of Satan are certainly weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers fight for Allah’s cause; and the disbelievers fight for the devil’s cause – so fight against the friends of the devil; undoubtedly the devil’s conspiracy is weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, fight in the cause of Allah, and those who disbelieve, fight in the cause of the Taghut. So fight against the friends of Shaytan; ever feeble indeed is the plot of Shaytan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe fight in the way of Allah, and those who disbelieve fight in the way of the Shaitan. Fight therefore against the friends of the Shaitan; surely the strategy of the Shaitan is weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers fight in the way of God, and the unbelievers fight in the idols' way. Fight you therefore against the friends of Satan; surely the guile of Satan is ever feeble.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe do battle for the cause of Allah; and those who disbelieve do battle for the cause of idols. So fight the minions of the devil. Lo! the devil's strategy is ever weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers fight for the cause of God, while those who reject faith fight for Satan. Then fight the allies of Satan: Satan's scheming is truly weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These who believe fight in the way of Allah and those who disbelieve fight in the way of the devil. Fight then against the friends of Satan; verily the craft of Satan is ever feeble.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have faith fight in the way of Allah, and those who are faithless fight in the way of fake gods. So fight the friends of Satan; indeed the stratagems of Satan are always flimsy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe fight in the cause of Allah, and those who reject Faith Fight in the cause of Evil: So fight ye against the friends of Satan: feeble indeed is the cunning of Satan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, fight in the Cause of Allah, and those who disbelieve, fight in the cause of Taghut (Satan, etc.). So fight you against the friends of Shaitan (Satan); Ever feeble indeed is the plot of Shaitan (Satan).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe fight in the way of Allah, but those who disbelieve fight in the way of the idol. Therefore, fight against those guided by satan. Indeed, satan's guile is always weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe fight in the cause of God, while those who disbelieve fight in the cause of Evil. So fight the allies of the Devil. Surely the strategy of the Devil is weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe fight in the cause of Allah, and those who disbelieve fight in the cause of Taghut. So fight against the allies of Satan. Indeed, the plot of Satan has ever been weak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:76] Those who believe fight in the way of God, and those who disbelieve fight in the way of a false deity, Satan. Fight therefore against the friends of Satan, the supporters of his religion and you will defeat them with the strength you draw from God; surely the plotting of Satan, against believers, is ever feeble, of no substance, and cannot stand up to God’s plotting against the disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوأشارت الآية إلى أنّ الله استجاب دعوتهم وهيّأ لهم النصر بيد المؤمنين فقال : { الذين آمنوا يقاتلون في سبيل الله والذين كفروا يقاتلون في سبيل الطاغوت } ، أي فجنّد الله لهم عاقبة النصر ، ولذلك فرّع عليه الأمر بقوله : { فقاتلوا أولياء الشيطان إنّ كيد الشيطان كان ضعيفاً } .والطاغوت : الأصنام . وتقدّم تفسيره في قوله تعالى : { ألم تر إلى الذين أوتوا نصيباً من الكتاب يؤمنون بالجبتتِ والطاغوت } في هذه السورة \\[ النساء : 5 \\] ، وقوله : { يريدون أن يتحاكموا إلى الطاغوت } \\[ النساء : 60 \\] .والمراد بكيد الشيطان تدبيره . وهو ما يظهر على أنصاره من الكيد للمسلمين والتدبير لتأليب الناس عليهم ، وأكّد الجملة بمؤكّدين ( إنّ ) ( وكان ) الزائدة الدالة على تقرّر وصف الضعف لكيد الشيطان .\n\n",
      "translations": [
        {
          "translation": "Then Allah mentioned their fighting in the way of Allah, saying: (Those who believe) Muhammad and his Companions (do battle for the cause of Allah; and those who disbelieve) Abu Sufyan and his companions (do battle for the cause of idols) in obedience of Satan. (So fight the minions of the devil) the soldiers of the devil. (Lo! the devil's strategy) the devil's work and stratagem (is ever weak) in that he will let them down as he did on the Day of Badr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وسبيل الهداية إلى متابعة الشيطان وموالاته { فَقَٰتِلُوۤاْ } أيها المؤمنون المخلصون { أَوْلِيَاءَ ٱلشَّيْطَٰنِ } ولا تبالوا بعددهم وعددهم { إِنَّ كَيْدَ ٱلشَّيْطَٰنِ } بالنسبة إلى كيد الله ومكره { كَانَ ضَعِيفاً } [النساء: 76] لا عبرة له ولا تأثير",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: في مدح المخلصين: { الذين آمنوا يُقاتلون في سبيل الله } ، وابتغاء مرضات الله، وإعلاء كلمة الله، { والذين كفروا } ، من أهل مكة وغيرهم، { يُقاتلون في سبيل الطاغوت } وهو الشيطان، { فقاتلوا } يا أولياء الله { أولياء الشيطان } ولا يهولكم كيده { إن كيد الشيطان كان ضعيفًا } ، وكيد الله للكافرين كان قويًا متينًا، فلا تخافوا أولياءه، فأنهم اعتمدوا على أضعف شيء وأوهنه، وأنتم اعتمدتم على أقوى شيء وأمتَنِه. الإشارة: كل ما سوى الله طاغوت، فمن قصد بجهاده أو عمله رضى الله والوصول إلى حضرته دون شيء سواه، كان من أولياء الله، ومن قصد بجهاده أو أعماله حظًا دنيويًا أو أخرويًا خرج من دائرة الولاية، فإما أن يكون مع عامة أهل الإيمان، أو من أولياء الشيطان. قال صلى الله عليه وسلم\n \" إنَّما الأعمَالُ بالنيات، وإنما لكلِّ امرىءٍ مَا نَوَى، فمن كانَت هجرَتُه إلى الله ورسولِه فهجرتُه إلى اللهْ ورسولِه، ومن كانت هجرتُه إلى دُنيا يُصيبهُا أو امرأةٍ ينكِحُها، فهجرتُه إلى ما هَاجَرَ إليه \" \nوقال في الحِكَم:\n \" لا ترحل من كَونٍ إلى كَونٍ، فتكون كحمار الرحى، يسير والذي ارتحل منه هو الذي ارتحل إليه، ولكن أرحل من الأكوانِ إلى المُكَوِّنِ، { وَأَنَّ إِلَى رَبِّكَ الْمُنتَهَى } [النُجُم:42] \". ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:39",
      "similarity": 0.45682499717746294
    },
    {
      "verse": "86:15",
      "similarity": 0.44497052680626925
    },
    {
      "verse": "86:16",
      "similarity": 0.4420547183690284
    },
    {
      "verse": "52:42",
      "similarity": 0.4312128222278511
    },
    {
      "verse": "20:60",
      "similarity": 0.4185758812351811
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004076.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004076.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:76.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}