{
  "chapter": "النساء",
  "text": "الم تر الى الذين قيل لهم كفوا۟ ايديكم واقيموا۟ الصلوة وءاتوا۟ الزكوة فلما كتب عليهم القتال اذا فريق منهم يخشون الناس كخشية الله او اشد خشية وقالوا۟ ربنا لم كتبت علينا القتال لولا اخرتنا الى اجل قريب قل متع الدنيا قليل والءاخرة خير لمن اتقى ولا تظلمون فتيلا",
  "translations": [
    {
      "translation": "Do you not see those who were told: 'Hold back from fighting but establish salat and pay zakat'? Then when fighting is prescribed for them, a group of them fear people as Allah should be feared, or even more than that. They say, 'Our Lord, why have you prescribed fighting for us? If only You would give us just a little You will not be wronged by so much as the smallest speck.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen the people who were told: \"Hold back your hands (from attacking), observe your devotional obligations and pay the zakat?\" But when they were commanded to fight, behold, a section among them were filled with fear of men as though it were the fear of God and even more, and said: \"O Lord, why did you make war compulsory for us? Why did you not allow us to live a little more?\" Say to them: \"How short-lived is the commerce of this world; but that of the next is best for those who fear God; and you will not be wronged the breadth of a thread.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who were told: 'Restrain you hands, and establish the Prayer, and pay the Zakah'? But when fighting was enjoined upon them some of them feared men as one should fear Allah, or even more, and said: 'Our Lord, why have You ordained fighting for us? Why did You not grant us a little more respite?' Say to them: 'There is little enjoyment in this world. The World to Come is much better for the God-fearing. And you shall not be wronged even to the extent of the husk of a date-stone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who were told to stop fighting, to say their prayers, and pay the religious tax? When they were ordered to fight, some of them feared other men as much as or more than they feared God and so they said, \"Lord, why have you ordered us to fight? If only you would give us a little time.\" (Muhammad), tell them, \"The pleasures of the worldly life are trivial. The life hereafter is best for the pious ones. You will not be treated the slightest bit unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see those to whom it was said, “Restrain your hands, keep the prayer established and pay the charity”; but when fighting was ordained for them, some of them started fearing people, the way they feared Allah – or even greater! And they said, “Our Lord! Why have You ordained fighting for us? If only You would have let us live some more!” Say (O dear Prophet Mohammed – peace and blessings be upon him), “The usage of this world is meagre; and the Hereafter is better for the pious; and you will not be wronged even (the weight of) a single thread.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who were told to hold back their hands (from fighting) and perform Salah and give Zakah, but when the fighting was ordained for them, behold! a section of them fear men as they fear Allah or even more. They say: \"Our Lord! Why have You ordained for us fighting Would that You granted us respite for a short period\" Say: \"Short is the enjoyment of this world. The Hereafter is (far) better for him who fears Allah, and you shall not be dealt with unjustly even equal to the Fatil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those to whom it was said: Withhold your hands, and keep up prayer and pay the poor-rate; but when fighting is prescribed for them, lo! a party of them fear men as they ought to have feared Allah, or (even) with a greater fear, and say: Our Lord! why hast Thou ordained fighting for us? Wherefore didst Thou not grant us a delay to a near end? Say: The provision of this world is short, and the hereafter is better for him who guards (against evil); and you shall not be wronged the husk of a date stone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not regarded those to whom it was said, 'Restrain your hands, and perform the prayer, and pay the alms'? Then, as soon as fighting is prescribed for them, there is a party of them fearing the people as they would fear God, or with a greater fear, and they say, 'Our Lord, why hast thou prescribed fighting for us? Why not defer us to a near term?' Say: 'The enjoyment of this world is little; the world to come is better for him who fears God; you shall not be wronged a single date-thread.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not seen those unto whom it was said: Withhold your hands, establish worship and pay the poordue, but when fighting was prescribed for them behold! a party of them fear mankind even as their fear of Allah or with greater fear, and say: Our Lord! Why hast Thou ordained fighting for us? If only Thou wouldst give us respite yet a while! Say (unto them, O Muhammad): The comfort of this world is scant; the Hereafter will be better for him who wardeth off (evil); and ye will not be wronged the down upon a date-stone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those to whom it was said, \"Restrain your hands, say your prayers and pay the prescribed alms?\" And when they have been ordered to fight, some of them have felt afraid of human beings just as they should be afraid of God, or they are even more afraid. They say, \"Our Lord, why have You ordered us to fight? If You would only postpone it for a little while longer!\" Say, \"The benefits of this world are negligible and the Hereafter will be better for one who fears God; and you shall not be wronged in the slightest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not observed those unto whom it was said;. withhold your hands, and establish prayer and give the poor-rate; but when thereafter fighting was prescribed unto them, lo! there is a party of them dreading men as with the dread of Allah, or with greater dread; and they say: our Lord! why hast Thou prescribed unto us fighting! Wouldst that Thou hadst let us tarry a term nearby! Say thou: the enjoyment of the world is little, and the Hereafter is better for him who feareth God; and ye shall not be wronged a whit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded those who were told, ‘Keep your hands off [from warfare], and maintain the prayer and give the zakat’? But when fighting was prescribed for them, behold, a part of them feared the people as if fearing Allah, or were even more afraid, and they said, ‘Our Lord! Why did You prescribe fighting for us? Why did You not respite us for a short time?!’ Say, ‘The enjoyments of this world are trifle and the Hereafter is better for the Godwary, and you will not be wronged so much as a single date-thread.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not turned Thy vision to those who were told to hold back their hands (from fight) but establish regular prayers and spend in regular charity? When (at length) the order for fighting was issued to them, behold! a section of them feared men as - or even more than - they should have feared Allah: They said: \"Our Lord! Why hast Thou ordered us to fight? Wouldst Thou not Grant us respite to our (natural) term, near (enough)?\" Say: \"Short is the enjoyment of this world: the Hereafter is the best for those who do right: Never will ye be dealt with unjustly in the very least!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who were told to hold back their hands (from fighting) and perform As-Salat (Iqamat-as-Salat), and give Zakat, but when the fighting was ordained for them, behold! a section of them fear men as they fear Allah or even more. They say: \"Our Lord! Why have you ordained for us fighting? Would that you had granted us respite for a short period?\" Say: \"Short is the enjoyment of this world. The Hereafter is (far) better for him who fears Allah, and you shall not be dealt with unjustly even equal to the Fatila (a scalish thread in the long slit of a date-stone).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those to whom it has been said: 'Restrain your hands, establish your prayers and pay the obligatory charity' Then, as soon as fighting is written for them, there is a party of them fearing people as they would fear Allah, or with stronger fear. And they say: 'Our Lord, why have You written fighting for us, why not postpone us to a near term' Say: 'The pleasure of this life is little. The Everlasting Life is better for the cautious. You shall not be wronged a single tissue (of the fine skin that covers a date stone).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered those who were told, “Restrain your hands, and perform your prayers, and spend in regular charity”? But when fighting was ordained for them, a faction of them feared the people as God is ought to be feared, or even more. And they said, “Our Lord, why did You ordain fighting for us? If only You would postpone it for us for a short while.” Say, “The enjoyments of this life are brief, but the Hereafter is better for the righteous, and you will not be wronged one bit.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who were told, \"Restrain your hands [from fighting] and establish prayer and give zakah\"? But then when fighting was ordained for them, at once a party of them feared men as they fear Allah or with [even] greater fear. They said, \"Our Lord, why have You decreed upon us fighting? If only You had postponed [it for] us for a short time.\" Say, The enjoyment of this world is little, and the Hereafter is better for he who fears Allah. And injustice will not be done to you, [even] as much as a thread [inside a date seed].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:77] Have you not seen those to whom it was said, ‘Restrain your hands, from fighting the disbelievers when they desired it at Mecca, because of the harm the disbelievers had inflicted upon them — and these were a group from among the Companions — and establish the prayer, and pay the alms’? Then, as soon as fighting was prescribed, was made obligatory, for them, lo, a party of them fear people, the disbelievers, that is, [they fear] punishment at their hands through death, as they would fear, the punishment of, God, or with more fear, than their fear of Him (ashadda, ‘more’, is in the accusative because it is a circumstantial qualifier; the response to the lammā, ‘as soon as’, is indicated by idhā, ‘lo’, and what follows), in other words, they are taken aback by fear, and they said, frightened of death, ‘Our Lord, why have You prescribed fighting for us? Why not (lawlā is [to be understood as] hallā) defer us to a near term?’ Say, to them: ‘The enjoyment of this world, that which is enjoyed therein, or enjoying it [the world], is trifling, it will end up by perishing; and the Hereafter, Paradise, is better for him who fears God’s punishment by avoiding disobedience to Him; and you shall not be wronged (lā tuzlamūna, may also be read lā yuzlamūna, ‘they shall not be wronged’) you shall not be diminished of your deeds, a single date-thread, as much as the peel on a date-stone, so struggle [in the way of God].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned their dislike of joining the Prophet on the lesser Badr, saying: (Hast thou not seen) have you not been informed, Muhammad, about (those unto whom it was said) those to whom you said in Mecca, referring to 'Abd al-Rahman Ibn 'Awf al-Zuhri, Sa'd Ibn Abi Waqqas al-Zuhri, Qudamah Ibn Maz'un al-Jumahi, Miqdad Ibn al-Aswad al-Kindi and Talhah Ibn 'Abdullah al-Tamimi: (Withhold your hands) from killing and beating, for I have not ordered the initiation of fighting, (establish worship) establish the five daily prayers in full with their bowings and prostrations and that which is obligated therein of their appointed times (and pay the poor-due) give the poor their due from your wealth, (but when fighting) jihad in the way of Allah (was prescribed) obligated (for them) in Medina (behold, a party of them) among them Talhah Ibn 'Abdullah (fear mankind) the people of Mecca (even as their fear of Allah or with greater fear, and say: Our Lord!) our Lord! (Why hast Thou ordained fighting for us?) why have You obligated on us jihad in Your way? (If only Thou wouldst give us respite yet a while!) if only You would keep us safe for a short while before death. (Say) to them, Muhammad: (The comfort of this world) the benefit of this world (is scant) in the Hereafter; (the Hereafter) the reward of the Hereafter (will be better for him who wardeth off (evil)) who ward off disbelief, idolatry and indecencies; (and ye will not be wronged the down upon a date stone) their good deeds will not be diminished even if it be as much as the down on a date stone.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لِمَ كَتَبْتَ عَلَيْنَا ٱلْقِتَالَ } معناهُ لِمَ فَرَضْتَـ[ـهُ] عَلَينَا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Why have you not fought us} [means], why have you not decreed fighting us?",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَرَ إِلَى } المؤمنين { ٱلَّذِينَ قِيلَ لَهُمْ } عند ضعفهم\n وثاثة حالهم حين كانوا في مكةك قبل الهجرة يريدون أن يقاتلوا: { كُفُّوۤاْ أَيْدِيَكُمْ } عن القتال إلى أن يأذن الله لكم به ويرد الأمر عليه { وَأَقِيمُواْ } أديموا { ٱلصَّلَٰوةَ } المقرب لكم نحوه بجميع الأعضاء والجوارح { وَآتُواْ ٱلزَّكَٰوةَ } المصفية لنفوسكم عن الميل إلى زخرفة الدنيا\n وانتظروا إلى أن يأمركم الله بالقتال والجهاد { فَلَمَّا كُتِبَ عَلَيْهِمُ ٱلْقِتَالُ } بعدما قوَّي حالهم\n وزال ضعفهم { إِذَا فَرِيقٌ مِّنْهُمْ } بضعف يقينهم\n وقلة وثوقهم بنصر الله وتأييده { يَخْشَوْنَ ٱلنَّاسَ } أي: يخالفون من الكفار { كَخَشْيَةِ ٱللَّهِ } مثل خوفهم من الله { أَوْ } بل { أَشَدَّ خَشْيَةً } لوهن اعتقادهم\n واعتمادهم على الله\n إذ هم في أوائل ظهور الإسلام حين كانوا متزلزلين\n لا يصفوا يقينهم بالتوحيد { وَقَالُواْ } حين سمعوا نزول أمر القتال مسوفين متأخرين: { رَبَّنَا لِمَ كَتَبْتَ عَلَيْنَا ٱلْقِتَالَ } مع أنا على ضعفنا { لَوْلاۤ أَخَّرْتَنَا إِلَىٰ أَجَلٍ قَرِيبٍ } يزداد فيه قوتنا وشوكتنا وعدتنا\n وإنما قالوه خوفاً من الموت وفوات المال { قُلْ } لهم يا أكمل الرسل تذكيراً وتنبيهاً: { مَتَاعُ ٱلدُّنْيَا قَلِيلٌ } عمل قصير بالنسبة إلى عطاء الله\n وشرف لقائه { وَٱلآخِرَةُ } المعدة لجزيل العطاء وشرف اللقاء { خَيْرٌ لِّمَنِ ٱتَّقَىٰ } عما يشغلهم عنه وعن عطائه { وَ } اعلموا أيها المؤمنون أنكم { لاَ تُظْلَمُونَ } لا تنقصون ولا تهملون مما قدر لكم في القضاء { فَتِيلاً } [النساء: 77] مقدر فتيل النواة\n\n\nواعلموا أيضاً أن تسويفكم وتأخيركم لا يفيدكم نفعاً في أمر الموت\n بل وقته مبهم وأمره مبرم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ أَلَمْ تَرَ إِلَى الَّذِينَ قِيلَ لَهُمْ كُفُّواْ أَيْدِيَكُمْ وَأَقِيمُواْ الصَّلاَةَ وَآتُواْ الزَّكَاةَ فَلَمَّا كُتِبَ عَلَيْهِمُ الْقِتَالُ إِذَا فَرِيقٌ مِّنْهُمْ يَخْشَوْنَ النَّاسَ كَخَشْيَةِ اللَّهِ أَوْ أَشَدَّ خَشْيَةً وَقَالُواْ رَبَّنَا لِمَ كَتَبْتَ عَلَيْنَا الْقِتَالَ لَوْلا أَخَّرْتَنَا إِلَى أَجَلٍ قَرِيبٍ قُلْ مَتَاعُ الدُّنْيَا قَلِيلٌ وَالآخِرَةُ خَيْرٌ لِّمَنِ اتَّقَى وَلاَ تُظْلَمُونَ فَتِيلاً أَيْنَمَا تَكُونُواْ يُدْرِككُّمُ الْمَوْتُ وَلَوْ كُنتُمْ فِي بُرُوجٍ مُّشَيَّدَةٍ\n\n\n }  قلت: { أو أشد } عطف على الكاف النائبة عن المصدر\n أي: خشيةً مثل خشية الله أو أشد\n وهو من إضافة المصدر إلى المفعول\n أي: مثل خشيتهم الله\n يقول الحقّ جلّ جلاله: { ألم تر } يا محمد { إلى الذين } طلبوا منك فرضَ الجهاد حرصًا على أن يجاهدوا\n فقيل لهم على لسان الرسل: { كُفّوا أيديكم } عنه إلى أوَانِ فَرضِه\n واشتغلوا بما أُمِرتم به من إقامة الصلاة وإيتاء الزكاة\n { فلما كُتب عليهم القتال } دخلهم الخوف { إذا فريق منهم يخشون الناس } أي: الكفار\n أن يقتلوهم مثل خشية عقاب { الله } أو أشد خشية منه\n { وقالوا ربنا لم كتبت علينا القتال } في هذا الوقت { لولا }: هلاّ { أخّرتنا إلى أجل قريب } نتمتع فيه بحياتنا أو إلى أن نموت بآجالنا\n قلت: والظاهر أنهم قالوا ذلك في نفوسهم\n خواطر خطرت لهم\n ولم يفوهوا به\n إن نزلت في الصحابة ـ رضي الله عنهم ـ\n وإن كانت في المنافقين فيمكن أن ينطقوا بها\n { قل متاع الدنيا قليل } وعيشها ذليل\n وأجلها قريب\n { والآخرة خير لمن اتقى } \n وحياتها خير وأبقى\n وسَتَقدُمون على مولاكم\n فيكرم مثواكم\n ويوفيكم جزاء أعمالكم\n { ولا تظلمون فتيلاً } من ثواب أعمالكم\n ولا تنقصون من أيام أعماركم\n جاهدتم أو قعدتم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:49",
      "similarity": 0.7153366573113822
    },
    {
      "verse": "17:71",
      "similarity": 0.6662115275666287
    },
    {
      "verse": "9:122",
      "similarity": 0.2178786651591991
    },
    {
      "verse": "34:28",
      "similarity": 0.2022135612798916
    },
    {
      "verse": "9:36",
      "similarity": 0.1962041435771381
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/4:77.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/4:77.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:77.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}