{
  "chapter": "النساء",
  "text": "اينما تكونوا۟ يدرككم الموت ولو كنتم فى بروج مشيدة وان تصبهم حسنة يقولوا۟ هذه من عند الله وان تصبهم سيئة يقولوا۟ هذه من عندك قل كل من عند الله فمال هؤلاء القوم لا يكادون يفقهون حديثا",
  "translations": [
    {
      "translation": "Wherever you are, death will catch up with you, even if you are in impregnable fortresses. If a good thing happens to them, they say, 'This has come from Allah.' But if a bad thing happens to them, they say, 'This has come from you.' Say, 'Everything comes from Allah.' What is the matter with these people that they scarcely understand a single word?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Death will overtake you wheresoever you be, even in the mightiest of towers. Yet if some good comes their way they say: \"It is from God;\" and if it is evil that befalls them, they say: \"It is indeed from you.\" Say to them: \"Every thing is from God.\" O, what has come upon the people that even this they fail to understand!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherever you might be, death will overtake you even though you be in massive towers. And when some good happens to them, they say: 'This is from Allah'; whereas when some misfortune befalls them, they say: 'This is because of you'. Say: 'All is from Allah.' What has happened to this people that they seem to understand nothing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherever you are, death will find you even if you hide yourselves in firmly constructed towers. Whenever people experience good fortune, they say that it is from God but whenever they experience misfortune, they say it is because of you, (Muhammad). Tell them, \"Everything is from God.\" What is wrong with these people that they do not even try to understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Death will come to you wherever you may be, even if you were in strong fortresses; if some good reaches them they say, “This is from Allah”; and if any misfortune reaches them, they say, “This is from you”; say, “Everything is from Allah”; what is wrong with these people, that they do not seem to understand anything?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wheresoever you may be, death will overtake you even if you are in fortresses built up strong and high!\" And if some good reaches them, they say, \"This is from Allah,\" but if some evil befalls them, they say, \"This is from you.\" Say: \"All things are from Allah,\" so what is wrong with these people that they fail to understand any word\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherever you are, death will overtake you, though you are in lofty towers, and if a benefit comes to them, they say: This is from Allah; and if a misfortune befalls them, they say: This is from you. Say: All is from Allah, but what is the matter with these people that they do not make approach to understanding what is told (them)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherever you may be, death will overtake you, though you should be in raised-up towers. And if a good thing visits them, they say, 'This is from God'; but if an evil thing visits them, they say, 'This is from thee.' Say: 'Everything is from God.' How is it with this people? They scarcely understand any tiding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wheresoever ye may be, death will overtake you, even though ye were in lofty towers. Yet if a happy thing befalleth them they say: This is from Allah; and if an evil thing befalleth them they say: This is of thy doing (O Muhammad). Say (unto them): All is from Allah. What is amiss with these people that they come not nigh to understand a happening?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherever you may be, death will overtake you, even if you be in strongly built towers.\" If some good befalls them, they say, \"This is from God,\" and if ill befalls them, they say, \"This is from you.\" Tell them, \"All is from God.\" But what is wrong with these people that they fail to understand anything?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wheresoever ye may be, death shall overtake you, even though ye be in fortresses plastered. And if there betideth them some good, they say: this is from God. And if there betideth them some ill, they say: this is because of thee. Say thou: everything is from Allah. What aileth then this people, that well-nigh they understand not any speech\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherever you may be death will overtake you, even if you were in fortified towers.’ If any good befalls them, they say, ‘This is from Allah;’ and when an ill befalls them, they say, ‘This is from you.’ Say, ‘All is from Allah.’ What is the matter with these people that they would not understand any matter?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherever ye are, death will find you out, even if ye are in towers built up strong and high!\" If some good befalls them, they say, \"This is from Allah\"; but if evil, they say, \"This is from thee\" (O Prophet). Say: \"All things are from Allah.\" But what hath come to these people, that they fail to understand a single fact?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wheresoever you may be, death will overtake you even if you are in fortresses built up strong and high!\" And if some good reaches them, they say, \"This is from Allah,\" but if some evil befalls them, they say, \"This is from you (O Muhammad SAW).\" Say: \"All things are from Allah,\" so what is wrong with these people that they fail to understand any word?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherever you are, death will overtake you, even if you shall be in the fortified, high towers' If bounty reaches them, they say: 'This is from Allah' but when evil hits them, they say: 'This is from you' Say to them: 'All is from Allah' What is the matter with this people that they scarcely understand any statement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherever you may be, death will catch up with you, even if you were in fortified towers. When a good fortune comes their way, they say, “This is from God.” But when a misfortune befalls them, they say, “This is from you.” Say, “All is from God.” So what is the matter with these people, that they hardly understand a thing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherever you may be, death will overtake you, even if you should be within towers of lofty construction. But if good comes to them, they say, \"This is from Allah \"; and if evil befalls them, they say, \"This is from you.\" Say, \"All [things] are from Allah.\" So what is [the matter] with those people that they can hardly understand any statement?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:78] Wherever you may be, death will overtake you, though you should be in raised-up, lofty, towers’, forts, so do not shrink from fighting for fear of death. And if a good thing, such as fertility and abundance, befalls them, the Jews, they say, ‘This is from God’; but if an evil thing, such as drought or misfortune, befalls them, as it did with them when the Prophet (s) arrived in Medina, they say, ‘This is from you’, O Muhammad (s), that is, from the bad luck [you bring]. Say, to them: ‘Everything, good and evil, is from God.’ What is wrong with this people that they do not understand, that is, they do not come close to comprehending, any words, delivered to them (the mā, ‘what’ [of mā li-hā’ūlā’, ‘what is wrong with these’] is an interrogative intended to provoke amazement at their extreme ignorance; to state that one cannot even come close to doing something is [rhetorically] more intense than saying that he cannot do it).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Wheresoever ye may be) sincere believers, on land or on the sea, in settlement or travelling, (death will overtake you, even though ye were in lofty towers) in fortified towers. Allah then mentioned the saying of the Jews and hypocrites: \"since Muhammad and his Companions came to us, our harvests and fields have kept ever decreasing\", saying: (Yet if a happy thing) land fertility, lower prices and continuous rain throughout the year (befalleth them) the Jews and hypocrites (they say: This is from Allah) for He knew that we were good; (and if an evil thing) drought, dearth, hardship and high prices (befalleth them they say: This is of your doing) this is because of the ill-omen of Muhammad and his Companions. (Say (unto them)) unto the Jews and hypocrites, Muhammad: (All) hardship and blessing (is from Allah. What is amiss with these people) the Jews and hypocrites (that they come not nigh to understand a happening?) that both hardship and bounty are from Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِي بُرُوجٍ مُّشَيَّدَةٍ } معناهُ فِي حِصُونٍ، واحِدُهَا بُرجٌ\n والمُشيَّدَةُ: المُطَّولةُ\n والمُشيَّدُ: المُزَينُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَيْنَمَا تَكُونُواْ يُدْرِككُّمُ ٱلْمَوْتُ } عند حلول الأجل المقدر له من عده { وَلَوْ كُنتُمْ } متحصنين { فِي بُرُوجٍ } قلاع وحصون { مُّشَيَّدَةٍ } بأنواع التشييدات والتحصنات؛ إذ لا مرد من قضاء الله ولا معقب لحكمه، يفعل ما يشاء ويحكم ما يريد { وَ } هم أيضاً من غاية تزلزلهم وتذبذهم، وعدم رسوخهم في جادة التوحيد { إِن تُصِبْهُمْ } حَسَنَةٌ فتح وغنيمة تفرح بها نفوسهم وتنبسط { يَقُولُواْ هَـٰذِهِ مِنْ عِندِ ٱللَّهِ } تفضلاً علينا، وامتناناً { وَإِن تُصِبْهُمْ سَيِّئَةٌ } بلية واختبار تنقبض بها نفوسهم { يَقُولُواْ هَـٰذِهِ مِنْ عِندِكَ } أي: اضافوها إليك مشتائمين بك، كما تشاءمت اليهود حيث قالت: منذ دخل محمد المدينة نقصت ثمارها وغلبت أسعارها { قُلْ } لهم كلاماً ناشئاً عن محض الحكمة والإيقان: { كُلٌّ } من الحوادث الكائنة سواء كانت مفرحة أو مملة، مقبضة أو مبسطة نازل { مِّنْ عِندِ ٱللَّهِ } حسب قدرته وإرادته، لا يسأل عن فعله ولا في أمره، بل له التصرف مطلقاً { فَمَالِ } عرض { هَـٰؤُلاۤءِ ٱلْقَوْمِ } المنحطين عن درجة التوحيد والعرفان { لاَ يَكَادُونَ يَفْقَهُونَ } ويفهمون { حَدِيثا } [النساء: 78] يخلصهم عن التزلزل، وتردد المرتبة على الإضافات المنافية للتوحيد، ولو أنهم من أهل التدبير والتأمل في سرائر كلام الله ومرموزاته لفتح عليهم مما يخلصهم عن دغدغة الكثرة مطلقاً، فكيف إضافة الحسنة والسيئة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أينما تكونوا يدرككم الموت } عند انقضاء آجالكم، { ولو كنتم في بروج مشيدة } عالية محصنة\n فإن كان الموت لا بد منه ففي الجهاد أفضل، لأنه حياة لا موتَ بعده\n قال الكلبي: نزلت في قوم من الصحابة، منهم: عبد الرحمن بن عوف، والمِقدادُ وقٌدامة بن مَظعون وغيرهم، كانوا يُؤذَونَ بمكة، ويستأذنون النبي صلى الله عليه وسلم في القتال، فيقول لهم: كفوا أيديكم حتى يُؤذن فيه لكم، فلما هاجروا إلى المدينة وأُمروا به، كرهه بعضهم كراهية الطبع البشري، فخطر ببالهم شيءٌ مما حكى الله عنهم\n فلما كانوا في عين العناية ومحل القرب والهداية عوقبوا على تلك الخواطر، ولو كان غيرهم من أهل البُعد لسُومح له في ذلك، وقيل: نزلت في قوم من المؤمنين أُمروا بالجهاد فنافقوا من الجُبن، وتخلفوا عن الجهاد، وهذا أليق بما بعده من قوله: { إن تصبهم حسنة }\n والله تعالى أعلم\n الإشارة: نرى بعض الفقراء يبطشون إلى مقام التجريد ومجاهدة نفوسهم قبل كمال يقينهم، فإذا أُمِروا بذلك، ورأوا ميادين الحروب واشتعال نيران قتل النفوس، وأمروا بالصبر على المكاره، من مواجهة الإنكار ولحوق الذل والافتقار، جبنوا وكلَّوا ورجعوا القهقرى، فيقال لهم: متاعُ الدنيا قليل وعزيزها ذليل، وغنيها فقير، وكبيرها حقير، وما تنالون من الله في جزاء مجاهدتكم خيرٌ وأبقى، ولا تُظلمون فتيلاً من مجاهدتكم لنفوسكم، فلو صبرتم لفزتم بالوصول إلى حضرة ربكم، فلما جبُنتُم ورجعتم، كان جزاؤكم الحرمان، عما ظفر به أهل العرفان\n\n\nوفي مثل هؤلاء يقول ابن الفارض رضي الله عنه:\n\nثم حكى مقالتهم الدالة على نفاقهم، فقال: {\n\n\nوَإِن تُصِبْهُمْ حَسَنَةٌ يَقُولُواْ هَـٰذِهِ مِنْ عِندِ ٱللَّهِ وَإِن تُصِبْهُمْ سَيِّئَةٌ يَقُولُواْ هَـٰذِهِ مِنْ عِندِكَ قُلْ كُلٌّ مِّنْ عِندِ ٱللَّهِ فَمَا لِهَـٰؤُلاۤءِ ٱلْقَوْمِ لاَ يَكَادُونَ يَفْقَهُونَ حَدِيثاً مَّآ أَصَابَكَ مِنْ حَسَنَةٍ فَمِنَ ٱللَّهِ وَمَآ أَصَابَكَ مِن سَيِّئَةٍ فَمِن نَّفْسِكَ\n\n\n }  يقول الحقّ جلّ جلاله: في وصف أهل النفاق: وإنهم إن { تصبهم حسنة } كخصب ورخاء ونعمة ظاهرة، قالو: { هذه من عند الله } ، ونسبوها إلى الله بلا واسطة، { وإن تصبهم سيئة } كقحط وجوع وموت وقتل، قالوا للرسول ـ عليه الصلاة والسلام ـ: { هذه من عندك } بشؤم قدومك أنت وأصحابك، كما قالت اليهود ـ لعنهم الله ـ: منذ دخل محمدٌ المدينة نقصت ثمارها وغلت أسعارها\n قلت: بل زكت ثمارها، ورخصت أسعارها، وأشرقت أنوارها، ولاحت أسرارها، وقد دعا صلى الله عليه وسلم للمدنية بمثل ما دعا إبراهيمُ لمكة، وأضعاف ذلك، فما زالت الخيرات تترادف إليها حسًا ومعنى إلى يوم القيامة، وهذه المقالة قد صدرت ممن كان قبلهم فقد قالوا لسيدنا صالح عليه السلام:\n\n[النَّمل:47]، وقال تعالى:\n\n[الأعراف:131]،\n\n[فُصّلَت:43]\n قال تعالى مكذبًا لهم: { قل كلٌّ من عند الله } الحسنة بفضله، والسيئة بعدله\n ثم عيرهم بالجهل فقال: { فمالِ هؤلاء القوم لا يكادون يفقهون حديثًا } فهُم كالبهائم أو أضل سبيلاً، أو لا يفقهون القرآن ويتدبرون حديثه، ولو تدبروا لعلموا أن الكل من عند الله، وأنه خالق كل شيء، المقدَّر لكل شيء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:45",
      "similarity": 0.28664378389591644
    },
    {
      "verse": "85:1",
      "similarity": 0.28614907714192617
    },
    {
      "verse": "15:16",
      "similarity": 0.28032688238091863
    },
    {
      "verse": "33:33",
      "similarity": 0.2316093095529431
    },
    {
      "verse": "25:61",
      "similarity": 0.22508781316259574
    }
  ]
}