{
  "chapter": "النساء",
  "text": "واذا حضر القسمة او۟لوا۟ القربى واليتمى والمسكين فارزقوهم منه وقولوا۟ لهم قولا معروفا",
  "translations": [
    {
      "translation": "If other relatives or orphans or poor people attend the sharing-out. provide for them out of it and speak to them correctly and courteously.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the relatives and orphans and the needy collect at the time of the division (of property) provide for them too, and talk kindly to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If other near of kin orphans and needy are pre sent at the time of division of inheritance give them some thing of it and speak to them kindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If relatives, orphans or destitute people, are present at the distribution of the legacy, give them something and speak kindly to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if relatives and orphans and the needy are present at the time of disbursement, give them something from it and speak to them with kindness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the relatives, and the orphans, and the poor are present at the time of division, give them from the property, and speak to them words of kindness and justice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there are present at the division the relatives and the orphans and the needy, give them (something) out of it and speak to them kind words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when the division is attended by kinsmen and orphans and the poor, make provision for them out of it, and speak to them honourable words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when kinsfolk and orphans and the needy are present at the division (of the heritage), bestow on them therefrom and speak kindly unto them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If other relatives, orphans or needy people are present at the time of the division, then provide for them out of it, and speak kindly to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those of kin are Present at the division and the orphans and the needy, provide for them thereout, and say unto them a reputable saying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the division is attended by relatives, the orphans and the needy, provide for them out of it, and speak to them honourable words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if at the time of division other relatives, or orphans or poor, are present, feed them out of the (property), and speak to them words of kindness and justice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the relatives and the orphans and Al-Masakin (the poor) are present at the time of division, give them out of the property, and speak to them words of kindness and justice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If relatives, orphans, or the needy are present at the division (of the inheritance), provide for them out of it, and speak to them in kind words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the distribution is attended by the relatives, and the orphans, and the needy, give them something out of it, and speak to them kindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when [other] relatives and orphans and the needy are present at the [time of] division, then provide for them [something] out of the estate and speak to them words of appropriate kindness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:8] And when the division, of the inheritance, is attended by kinsmen, those of kinship who cannot inherit, and orphans and the poor, grant them, something, out of it, before the division [is effected]; and, if the inheritors are young, speak to them, O guardians, honourable words, kindly, by apologising to them that it is not your possession [to divide as you wish], but that it is for the young [inheritors]. Some say that this [stipulation] was abrogated; others say that it was not, only that people were all too readily neglecting it, since it was encouraged [but not prescribed]. According to Ibn ‘Abbās, however, it is a duty.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجملة معطوفة على جملة { للرجال نصيب } \\[ النساء : 7 \\] إلى آخرها . وهذا أمر بعطية تعطى من الأموال الموروثة : أمر الورثة أن يسهموا لمن يحضر القسمة من ذوي قرابتهم غير الذين لهم حقّ في الإرث ، ممّن شأنهم أن يحضروا مجالس الفصل بين الأقرباء .وقوله : { للرجال نصيب } \\[ النساء : 7 \\] وقوله : { وللنساء نصيب } \\[ النساء : 7 \\] يقتضيان مقسوماً ، فالتعريف في قوله : { القسمة } تعريف العهد الذِكري .والأمر في قوله : { فارزقوهم منه } محمول عند جمهور أهل العلم على الندب من أوّل الأمر ، إذ ليس في الصدقات الواجبة غير الزكاة ، لأنّ النبي صلى الله عليه وسلم قال للأعرابي لمّا قال له : هل عليّ غيرها؟ «لا إلاّ أنّ تطَّوّع» وبهذا قال مالك وأبو حنيفة وفقهاء الأمصار ، وجعلوا المخاطب بقوله : { فارزقوهم } الورثة المالكين أمر أنفسهم ، والآية عند هؤلاء محكمة غير منسوخة ، وذهب فريق من أهل العلم إلى حمل الأمر بقوله : { فارزقوهم } على الوجوب ، فعن ابن عباس ، وعكرمة ، ومجاهد ، والزهري ، وعطاء ، والحسن ، والشعبي : أن ذلك حقّ واجب على الورثة المالكين أمر أنفسهم فهم المخاطبون بقوله : { فارزقوهم } .وعن ابن عباس ، وأبي موسى الأشعري وسعيد بن المسيّب ، وأبي صالح : أنّ ذلك كان فرضا قبل نزول آية المواريث ، ثم نسخ بآية المواريث ، ومآل هذا القول إلى موافقة قول جمهور أهل العلم .عن ابن عباس أيضاً . وزيد بن أسلم : أنّ الأمر موجّه إلى صاحب المال في الوصيّة التي كانت مفروضة قبل شرع الميراث واجب عليه أن يجعل في وصيّنه شيئاً لمن يحضر وصيّته من أولى القربى واليتامى والمساكين غير الذين أوصى لهم ، وأنّ ذلك نسخ تَبعا لنسخ وجوب الوصية ، وهذا يقتضي تأويل قوله : { القسمة } بمعنى تعيين ما لكل موصى له من مقدار .وعن سعيد بن جبير : أنّ الآية في نفس الميراث وأنّ المقصود منها هو قوله : { وقولوا لهم قولاً معروفاً } قال : فقوله : { فارزقوهم منه } هو الميراث نفسه .وقوله : { وقولوا لهم قولاً معروفاً } أي قولوا لغير الورثة بأن يقال لهم إنّ الله قسم المواريث .وقد علمت أنّ موقع الآية تمهيد لتفصيل الفرائض ، وأنّ ما ذهب إليه جمهور أهل العلم هو التأويل الصحيح للآية ، وكفاك باضطراب الرواية عن ابن عباس في تأويلها توهينا لتأويلاتهم .والأمر بأن يقولوا لهم قولاً معروفاً أي قولاً حسناً وهو ضدّ المنكر تسلية لبعضهم على مَا حرموا منه من مال الميّت كما كانوا في الجاهلية .\n\n",
      "translations": [
        {
          "translation": "(And when kinsfolk) who are not entitled to receive a share of the inheritance (and orphans) the orphans of believers before the division of the inheritance (and the needy) the needy among believers (are present at the division) of the heritage, (bestow on them there from) give them something of the inheritance before you proceed to divide it upon those who are entitled to receive it (and speak kindly unto them) if the inheritor has not yet reached the age of puberty, by promising them to speak to the inheritor about giving them something.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة الأمور المترتبة على التقوى: تصدق الوارثين من المتروك { إِذَا حَضَرَ ٱلْقِسْمَةَ } أي: وقتها { أُوْلُواْ ٱلْقُرْبَىٰ } المقلين\n المحجوبين عن الإرث { وَٱلْيَتَامَىٰ } الذين لا مال لهم ولا متعهد لهم { وَٱلْمَسَاكِينُ } الفاقدين وجه المعاش { فَٱرْزُقُوهُمْ مِّنْهُ } أي: فاعطوهم أيها الوارثون من المقسم المتروك مقدار ما لا يؤدي إلى تحريم الورثة { وَقُولُواْ لَهُمْ } حين الإعطاء { قَوْلاً مَّعْرُوفاً } [النساء: 8] خالياً عن وصمة المنِّ والأذى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: الضمير في { منه }: يعود على المقسوم المفهوم من القسمة. يقول الحقّ جلّ جلاله: { وإذا حضر } معكم في قسمة التركة ذَوو القرابة مِمَّنْ لا يرث، كالأخوال والخالات والعمات، { واليتامى والمساكين فارزقوهم } أي: فأعطوهم شيئًا من المال المقسوم تطييبًا لقلوبهم. فإن كان المال لغيركم، أو كان الورثة غيرَ بالغين، فقولوا لهم { قولاً معروفًا } ، بأن تُعلموهم أن المال لغيرنا، ولو كان لنا لأعطيانكم، والله يرزقنا وإياكم. واختلف في هذا الأمر، هل للندب ــ وهو المشهور ــ أو للوجوب ونسخ بآية المواريث؟ وقيل: لم يُنسخ، وهي مما تهاون الناس بها. والله تعالى أعلم. الإشارة: يقول الحق جل جلاله لخواص أحبابه: إذا دارت الكؤوس بخمرة الملك القدوس، وتعاطيتهم قسمتها بين أرواحكم حتى امتلأت جميعُ أشباحكم، وروت منها عُروقكم، وحضر معكم من ليس من أبناء جنسكم، ممن لا يُحل شرْب خمرتكم، فإن كان من أهل المحبة والوداد، أو من له بكم قرابة واستناد، فلا تحرموه من شراب خمرتكم، ولا من نفحات نسمتكم، فإنكم قوم لا يشقى جليسكم، فارزقوه من ثمار علومكم، واسقوه من شراب خمرتكم، وذكَّروه بالله، وقولوا له ما يدله على الله، ويوصله إلى حضرة الله، وهذا هو القول المعروف، الذي هو بالنصح موصوف. رُوِي أن أبا هريرة رضي الله عنه نادى في سوق المدينة: يا معشر التجار، اذهبوا إلى المسجد، فأنَّ تركة مُحمدٍ تقسم فيه، لتأخذوا حقكم منها مع الناس قبل أن تنفد، فذهب التُجَّارُ إلى المسجد النبوي، فوجدوه معمورًا بالناس، بعضهم يُصلي، وبعضهم يتلو، وبعضهم يذكر، وبعضهم يعلم العلم، فقالوا: يا أبا هريرة، ليس هنا ما ذكرت من قسم التركة‍‍! فقال لهم: هذه تركة محمد صلى الله عليه وسلم، لا ما أنتم عليه من جمع الأموال أو كما قال رضي الله عنه.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "90:15",
      "similarity": 0.5188885079476663
    },
    {
      "verse": "54:28",
      "similarity": 0.4658893149155017
    },
    {
      "verse": "2:215",
      "similarity": 0.4142256942409097
    },
    {
      "verse": "2:180",
      "similarity": 0.3728410093342827
    },
    {
      "verse": "2:83",
      "similarity": 0.37267833967636965
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004008.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004008.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}