{
  "chapter": "النساء",
  "text": "من يطع الرسول فقد اطاع الله ومن تولى فما ارسلنك عليهم حفيظا",
  "translations": [
    {
      "translation": "Whoever obeys the Messenger has obeyed Allah. If anyone turns away, We did not send you to them as their keeper.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who obeys the Apostle obeys God; and if some turn away (remember) We have not sent you as warden over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who obeys the Messenger thereby obeys Allah; as for he who turns away, We have not sent you as a keeper over them!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One who obeys the Messenger has certainly obeyed God. You have not been sent to watch over those who turn away from you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever obeys the Noble Messenger has indeed obeyed Allah; and for those who turn away – We have not sent you as their saviour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who obeys the Messenger, has indeed obeyed Allah, but he who turns away, then We have not sent you as a watcher over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever obeys the Apostle, he indeed obeys Allah, and whoever turns back, so We have not sent you as a keeper over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever obeys the Messenger, thereby obeys God; and whosoever turns his back - We have not sent thee to be a watcher over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso obeyeth the messenger hath obeyed Allah, and whoso turneth away: We have not sent thee as a warder over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who obeys the Messenger obeys God. As for those who turn away, know that We have not sent you to be their keeper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever obeyeth the apostle hath indeed obeyed Allah, and whosoever turnoth away -We have not sent thee over them as a keeper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever obeys the Apostle certainly obeys Allah; and as for those who turn their backs [on you]; We have not sent you to keep watch over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who obeys the Messenger, obeys Allah: But if any turn away, We have not sent thee to watch over their (evil deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who obeys the Messenger (Muhammad SAW), has indeed obeyed Allah, but he who turns away, then we have not sent you (O Muhammad SAW) as a watcher over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever obeys the Messenger, indeed he has obeyed Allah. As for those who turn away, We have not sent you to be their protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever obeys the Messenger is obeying God. And whoever turns away—We did not send you as a watcher over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who obeys the Messenger has obeyed Allah; but those who turn away - We have not sent you over them as a guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:80] Whoever obeys the Messenger, verily obeys God; and whoever turns his back, [whoever] avoids obedience to you, do not be concerned with them: We have not sent you as a watcher over them, to keep watch over their deeds, but as a warner. Their affair is Ours [to deal with] and We will requite them. This [statement] was before the command to fight [them was revealed].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When the verse (We sent no messenger save that he should be obeyed by Allah's leave) was revealed, 'Abdullah Ibn Ubayy said: \"Muhammad commands us to obey him instead of obeying Allah\", so Allah revealed the following: (Whoso obeyeth the messenger) in that which he commands (obeys Allah) because the Messenger never commands anything unless Allah has commanded it, (and whoso turneth away) from obeying the messenger: (We have not sent thee as a warder) a custodian (over them).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَمَآ أَرْسَلْنَاكَ عَلَيْهِمْ حَفِيظاً } معناهُ مُحَاسبٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { مَّنْ يُطِعِ ٱلرَّسُولَ } ويؤمن به ويصدقه بما جاء من عند ربه { فَقَدْ أَطَاعَ ٱللَّهَ } لأنه المظهر الجامع لجميع أوصافه وأسمائه، وللمظهر حكم الظاهر فيه { وَمَن تَوَلَّىٰ } أعرض عن إطاعتك أعرض عنهم، ولا تلتفت نحوهم { فَمَآ أَرْسَلْنَاكَ عَلَيْهِمْ حَفِيظاً } [النساء: 80] تحفظهم عما يشينهم، بل مبلغاً داعياً لهم إلى طريق الحق وصراط مستقيم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وَأَرْسَلْنَاكَ لِلنَّاسِ رَسُولاً وَكَفَىٰ بِٱللَّهِ شَهِيداً مَّنْ يُطِعِ ٱلرَّسُولَ فَقَدْ أَطَاعَ ٱللَّهَ وَمَن تَوَلَّىٰ فَمَآ أَرْسَلْنَاكَ عَلَيْهِمْ حَفِيظاً }  قلت: إن تعلق الجار بالفعل كان { رسولاً } حال مؤكدة، وإن تعلق بالاسم كان حالاً مؤسسة تفيد العموم أي أرسلناك رسولاً للناس جميعًا، و { حفيظًا } حال من الكاف\n يقول الحقّ جلّ جلاله: { وأرسلناك } يا محمد { للناس رسولاً } تعلمهم التوحيد وتدلهم على الأدب، فالتوحيد محله البواطن، فلا يرى الفعل إلا من الله، والأدب محله الظواهر فينسب بلسانه النقص إلى نفسه وهواه\n وإذا شهد الحق ـ جل جلاله ـ لرسوله بالرسالة أغْنَى عن غيره، { وكفى بالله شهيدًا }\n وشهادة الحق له بالمعجزات والواضحات، والبراهين القطعيات، والدلائل السمعيات، فإذا ثبتت رسالته وجب على الناس طاعته، ولذلك قال: { من يطع الرسول فقد أطاع الله } لأنه مُبلغ عن الله لا ينطق عن الهوى\n رُوِي أنه صلى الله عليه وسلم قال:\n\n \" مَن أطَاعَنِي فَقَد أطَاعَ الله، ومَن أحبَني فقَد أحبَ الله \" \n\nفقال بعض المنافقين: ما يريد هذا الرجل إلا أن نتخذه ربًّا، كما اتخذت النصارى عيسى\n فنزل: { من يطع الرسول فقد أطاع الله ومن تولى } وأعرض { فما أرسلناك عليهم حفيظًا } تَحفَظُ عليهم أعمالهم، وتحاسبهم عليها، إنما عليك البلاغ وعلينا الحساب\n\n\nالإشارة: كما شهد الحق ـ جل جلاله ـ لرسله بالرسالة، بما أظهر لهم من المعجزات، شهد لأوليائه بالولاية بما منحهم من الكرامات\n والمراد بالكرامة: هي تحقيق العرفان، ومعرفة الذوق والوجدان، واستقامة الظواهر والبواطن، وتهذيب الأخلاق وهداية الناس على يديه إلى العليم الخلاق، فهذه الكرامة المعتبرة عند المحققين، فمن أطاعهم فقد أطاع الله، ومن أعرض عنهم فقد أعرض عن معرفة الله، ومن أحبهم فقد أحب الله، ومن أبغضهم فقد أبغض الله لأنهم نور من أنوار الله، وعين من عيون الله، إذا لم يبق فيهم بقية مما سوى الله، أقدامهم عرى قدم رسول الله،\n\n[الفتح:10] فافهم، والله تعالى أعلم\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "83:33",
      "similarity": 0.7589182025119533
    },
    {
      "verse": "82:10",
      "similarity": 0.6994773015416221
    },
    {
      "verse": "15:9",
      "similarity": 0.620744766924699
    },
    {
      "verse": "23:9",
      "similarity": 0.6054920451783984
    },
    {
      "verse": "70:34",
      "similarity": 0.6054920451783984
    }
  ]
}