{
  "chapter": "النساء",
  "text": "ويقولون طاعة فاذا برزوا۟ من عندك بيت طائفة منهم غير الذى تقول والله يكتب ما يبيتون فاعرض عنهم وتوكل على الله وكفى بالله وكيلا",
  "translations": [
    {
      "translation": "They have the word, 'Obedience!' on their tongues but when they leave your presence, a group of them spend the night plotting to do other than what you say. Allah is recording their nocturnal plotting. So let them be and put your trust in Allah. Allah suffices as a Guardian.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"We obey;\" but when they leave your company, a section of them discuss at night other things than you had said; but God takes note of what they discuss. So turn aside from them and trust in God; and God is sufficient as protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say (in your presence): 'We obey', but when they leave your presence a party of them meets by night to plan against what you have said. Allah takes note of all their plots. So, let them alone, and put your trust in Allah. Allah is sufficient as a guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They proclaim obedience to you but as soon as they leave at night, a group of them make secret plans to do the contrary of what you have told them to do. God keeps the record of their nocturnal plans. Therefore, leave them alone and put your trust in God; He is Sufficient for you as your Guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “We have obeyed”; and when they go away from you, a group of them spend the night conspiring against what they had said; and Allah records what they conspired by night; therefore O dear Prophet (Mohammed – peace and blessings be upon him) avoid them and rely upon Allah; and Allah is Sufficient as a Trustee (of affairs).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"We are obedient,\" but when they leave you, a section of them spends all night in planning other than what you say. But Allah records their nightly (plots). So turn aside from them (do not punish them), and put your trust in Allah. And Allah is Ever All-Sufficient as a Disposer of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Obedience. But when they go out from your presence, a party of them decide by night upon doing otherwise than what you say; and Allah writes down what they decide by night, therefore turn aside from them and trust in Allah, and Allah is sufficient as a protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, 'Obedience'; but when they sally forth from thee, a party of them meditate all night on other than what thou sayest. God writes down their meditations; so turn away from them, and put thy trust in God; God suffices for a guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: (It is) obedience; but when they have gone forth from thee a party of them spend the night in planning other than what thou sayest. Allah recordeth what they plan by night. So oppose them and put thy trust in Allah. Allah is sufficient as Trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"We obey you,\" but as soon as they leave you, a group of them plan together by night against what you say. God records whatever they scheme. So ignore them, and put your trust in God. God is sufficient as a trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Obedience. Then when they so forth from before thee, a part of them plan together by night other than they had said: and Allah writeth down that which they plan by night. Wherefore turn thou from them and trust in Allah and sufficeth Allah as a Trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They profess obedience [to you], but when they go out from your presence, a group of them conspire overnight [to do] something other than what you say. But Allah records what they conspire overnight. So disregard them and put your trust in Allah, for Allah suffices as trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have \"Obedience\" on their lips; but when they leave thee, a section of them Meditate all night on things very different from what thou tellest them. But Allah records their nightly (plots): So keep clear of them, and put thy trust in Allah, and enough is Allah as a disposer of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"We are obedient,\" but when they leave you (Muhammad SAW), a section of them spend all night in planning other than what you say. But Allah records their nightly (plots). So turn aside from them (do not punish them), and put your trust in Allah. And Allah is Ever All-Sufficient as a Disposer of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, 'Obedience' but as soon as they leave you, a party of them hide other than what they said. Allah writes down what they hide. So turn away from them, and rely on Allah. Allah is sufficient for a Guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They profess obedience, but when they leave your presence, some of them conspire something contrary to what you said. But God writes down what they conspire. So avoid them, and put your trust in God. God is Guardian enough.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"[We pledge] obedience.\" But when they leave you, a group of them spend the night determining to do other than what you say. But Allah records what they plan by night. So leave them alone and rely upon Allah. And sufficient is Allah as Disposer of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:81] They say, that is, the hypocrites [say] when they come to you, ‘Our affair is [all about] Obedience, to you’; but when they sally forth, [when] they depart, from you, a party of them harbour (the [final] tā’ [of the feminine-ending in bayyatat, ‘harbour’] can either be elided with the following tā’ [of tā’ifa, ‘a party’] or simply omitted) they entertain secretly [feelings], other than what they say, to you in your presence in the way of [their] obedience, in other words, [they hide] disobedience to you. God writes down, He commands that it be written, what they harbour, in their scrolls [of deeds], so that they will be requited for it. So turn away from them, in forgiveness, rely on God, put your trust in Him, for He will suffice you; and God suffices as a Guardian, to Whom matters are entrusted.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they say) i.e. the hypocrites 'Abdullah Ibn Ubayy and his followers: ((It is) obedience) your command is obeyed, Muhammad. Command us with whatever you will and we shall comply; (but when they have gone forth from thee a party of them) of the hypocrites (spend the night in planning other than what thou sayest) what you command. (Allah recordeth what they plan by night) He records their planning to change your command. (So oppose them) but do not punish them (and put thy trust in Allah) rely on Allah regarding that which they are good for. (Allah is sufficient as Trustee) He is sufficient to give you triumph and sovereignty over them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بَيَّتَ طَآئِفَةٌ مِّنْهُمْ } معناهُ قَدَّرُوا ذَلِكَ لَيلاً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His statement, \"a group of them stay up [in prayer] at night\" - this means they value that [prayer] at night.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } ممن يحوم حولك من المنافقين قوم إذا أمرتهم بامتثال أمر الله { يَقُولُونَ } في جوابك: { طَاعَةٌ } أي: منا امتثال وإطاعة لما أمرت { فَإِذَا بَرَزُواْ } خرجوا { مِنْ عِندِكَ بَيَّتَ طَآئِفَةٌ مِّنْهُمْ } زورت وافترت ولبست { غَيْرَ ٱلَّذِي تَقُولُ } تلك الطائفة لك\n وقلت لها { وَٱللَّهُ } المجازي لهم والمحاسب أعمالهم { يَكْتُبُ } في صحائفهم\n ويجازي عليهم بها { مَا يُبَيِّتُونَ } ويزورون { فَأَعْرِضْ عَنْهُمْ } ولا تبال بإطاعتهم وقبولهم { وَتَوَكَّلْ عَلَى ٱللَّهِ } في جميع الأمور\n واتخذه ولياً ونصيراً { وَكَفَىٰ بِٱللَّهِ وَكِيلاً } [النساء: 81] يكفيك مؤونة ضررهم وشرورهم\n وينتقم لك عنهم\n\n\nومن جملة نفاقهم وشقاقهم أنهم يطعنون في القرآن بأنواع المطاعن\n تارة ينسبونه إلى غير الله وتارة يكذبونه\n وتارة يقولون: هو من أساطير الأولين\n أيترددون في أمره ويطعنون في شأنه؟\n\n\n{ أَفَلاَ يَتَدَبَّرُونَ } ويتأملون { ٱلْقُرْآنَ } لفظاً ومعى\n ظهراً وبطناً\n دلالة وحكماً\n اقتضاءً ونصاً إشارةً وإيماءً\n تلويحاً ورمزاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { طاعة }: خبر، أي: أمرنا طاعة، وأصله النصب على المصدر، ورُفِعَ للدلاله على الثبوت، وبيِّتَ الشيء، دبَّره ليلاً وأضمره في نفسه. يقول الحقّ جلّ جلاله: في شأن المنافقين: { ويقولون } لك إذا حضروا معك: أمرنا وشأننا { طاعةٌ } لك فيما تأمرنا به، { فإذا برزوا } أي: خرجوا { من عندك بيَّت طائفة منهم } أي: دبرَّت ليلاً وأخفت من النفاق { غير الذي تقول } لك من قبول الإيمان وإظهار الطاعة، أو زوَّرت خلاف ما قلتَ لها من الأمر بالطاعة، { والله يكتب ما يبيتون } أي: يُثبِتُه في صحائفهم فيجازهم عليه، { فأعرض عنهم } ولا تبال بهم، { وتوكل على الله } يكفك شرهم، { وكفى بالله وكيلاً } عليهم، فسينتقم لك منهم. الإشارة: هذه الخصلة موجودة في بعض العوام إذا حضروا مع أهل الخصوصية أظهروا الطاعة والإقرار، وإذا خرجوا عنهم بيَّتوا الانتقاد والإنكار، فلا يليق إلا الإعراض عنهم، والغيبة في الله عنهم، فإن الله يكفي شرهم بكفالته وحفظه. والله تعالى أعلم.\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "79:36",
      "similarity": 0.5477508106829028
    },
    {
      "verse": "26:91",
      "similarity": 0.48433571127370945
    },
    {
      "verse": "14:48",
      "similarity": 0.45621993966332064
    },
    {
      "verse": "40:16",
      "similarity": 0.4300502987041395
    },
    {
      "verse": "33:3",
      "similarity": 0.3279363625203826
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004081.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004081.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:81.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}