{
  "chapter": "النساء",
  "text": "افلا يتدبرون القرءان ولو كان من عند غير الله لوجدوا۟ فيه اختلفا كثيرا",
  "translations": [
    {
      "translation": "Do they not ponder over the Qur'an? Had it been the word of any other but God they would surely have found a good deal of variation in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not ponder about the Qur'an? Had it been from any other than Allah, they would surely have found in it much inconsistency.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will they not ponder on the Quran? Had it not come from someone other than God, they would have certainly found therein many contradictions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do they not ponder about the Qur’an? And had it been from anyone besides Allah, they would certainly find much contradiction in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not then consider the Qur'an carefully Had it been from other than Allah, they would surely, have found therein contradictions in abundance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not then meditate on the Quran? And if it were from any other than Allah, they would have found in it many a discrepancy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, do they not ponder the Koran? If it had been from other than God surely they would have found in it much inconsistency.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will they not then ponder on the Qur'an? If it had been from other than Allah they would have found therein much incongruity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not ponder on the Quran? If it had been from anyone other than God, they would have found much inconsistency in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ponder then they not on the Qur'an? Were it from other than Allah they would surely find therein many a contradiction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not contemplate the Quran? Had it been from [someone] other than Allah, they would have surely found much discrepancy in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not consider the Qur'an (with care)? Had it been from other Than Allah, they would surely have found therein Much discrepancy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not then consider the Quran carefully? Had it been from other than Allah, they would surely have found therein much contradictions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will they not contemplate upon the Koran? If it had been from other than Allah, they would surely have found in it many contradictions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not ponder the Quran? Had it been from any other than God, they would have found in it much discrepancy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then do they not reflect upon the Qur'an? If it had been from [any] other than Allah, they would have found within it much contradiction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:82] What, do they not ponder, do they [not] contemplate, the Qur’ān?, and the marvellous truths contained in it. If it had been from other than God surely they would have found therein much inconsistency, [much] contradiction in meaning and irregularity in arrangement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Will they not then ponder on the Qur'an?) do they not reflect on the Qur'an that its different parts are harmonious and support each other and it further contains that which the Prophet (pbuh) commands them? (If it had been from other than Allah) if this Qur'an had come from anyone other than Allah (they would have found therein much incongruity) much contradictions whereby its different parts are not harmonious.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَفَلاَ يَتَدَبَّرُونَ } ويتأملون { ٱلْقُرْآنَ } لفظاً ومعى، ظهراً وبطناً، دلالة وحكماً، اقتضاءً ونصاً إشارةً وإيماءً، تلويحاً ورمزاً، حتى يتفطنوا أنه ما هو من كلام البشر { وَلَوْ كَانَ مِنْ عِندِ غَيْرِ ٱللَّهِ } أي: من جنس كلام البشر { لَوَجَدُواْ فِيهِ } البتة { ٱخْتِلاَفاً كَثِيراً } [النساء: 82] حسب تفاوت درجات أشخاص البشر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}