{
  "chapter": "النساء",
  "text": "واذا جاءهم امر من الامن او الخوف اذاعوا۟ به ولو ردوه الى الرسول والى او۟لى الامر منهم لعلمه الذين يستنۢبطونه منهم ولولا فضل الله عليكم ورحمته لاتبعتم الشيطن الا قليلا",
  "translations": [
    {
      "translation": "When news of any matter reaches them they spread it about, whether it is of a reassuring or disquieting nature. If they had only referred it to the Messenger and those in command among them, those among them able to discern the truth about it would have had proper knowledge of it. If it were not for Allah's favour to you and His mercy, all but a very few of you would have followed Shaytan.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when any tidings of peace or war come to them they spread the news around. Had they gone to the Prophet or those in authority among them, then those who check and scrutinize would have known it, And but for the favour of God and His mercy you would certainly have followed Satan, except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever they come upon any news bearing upon either security or causing consternation they go about spreading it, whereas if they were to convey it to either the Messenger or to those from among them who are entrusted with authority, it would come to the knowledge of those who are competent to investigate it. But for Allah's bounty and mercy upon you, (weak as you were) all but a few of you would surely have followed Satan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they receive any news of peace or war, they announce it in public. Had they told it to the Messenger or to their (qualified) leaders, they could have used that information more properly. Were it not for the favor and mercy of God, all but a few of them would have followed Satan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when any news of safety or fear comes to them, they speak of it publicly; and had they referred it to the Noble Messenger and to those among them having authority, those among them who are able to infer would certainly learn the truth of the matter from them; and were it not for Allah’s munificence upon you, and His mercy, all of you would have certainly followed Satan – except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When there comes to them some matter touching (public) safety or fear, they make it known (among the people); if only they had referred it to the Messenger or to those charged with authority among them, the proper investigators would have understood it from them (directly). Had it not been for the grace and mercy of Allah upon you, you would have followed Shaytan, except a few of you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there comes to them news of security or fear they spread it abroad; and if they had referred it to the Apostle and to those in authority among them, those among them who can search out the knowledge of it would have known it, and were it not for the grace of Allah upon you and His mercy, you would have certainly followed the Shaitan save a few\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When there comes to them a matter, be it of security or fear, they broadcast it; if they had referred it to the Messenger and to those in authority among them, those of them whose task it is to investigate would have known the matter. And but for the bounty of God to you, and His mercy, you would surely have followed Satan, except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any tidings, whether of safety or fear, come unto them, they noise it abroad, whereas if they had referred it to the messenger and to such of them as are in authority, those among them who are able to think out the matter would have known it. If it had not been for the grace of Allah upon you and His mercy ye would have followed Satan, save a few (of you).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they hear any news, whether of peace or of something fearful, they spread it about; whereas if they referred it to the Messenger and to the men in charge, those of them who would have investigated it and could have arrived at the truth of the matter. But for God's grace and mercy, all but a few of you would have followed Satan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there cometh unto them aught of security aught of alarm, they bruit it; abroad: whereas had they referred it to the apostle and those in authority among them, then those of them who can think it out would have known it. And had there not been Allah's grace upon you and His mercy, ye would surely have followed Satan, save a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a report of safety or alarm comes to them, they immediately broadcast it; but had they referred it to the Apostle or to those vested with authority among them, those of them who investigate would have ascertained it. And were it not for Allah’s grace upon you and His mercy, you would have surely followed Satan, [all] except a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When there comes to them some matter touching (Public) safety or fear, they divulge it. If they had only referred it to the Messenger, or to those charged with authority among them, the proper investigators would have Tested it from them (direct). Were it not for the Grace and Mercy of Allah unto you, all but a few of you would have fallen into the clutches of Satan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When there comes to them some matter touching (public) safety or fear, they make it known (among the people), if only they had referred it to the Messenger or to those charged with authority among them, the proper investigators would have understood it from them (directly). Had it not been for the Grace and Mercy of Allah upon you, you would have followed Shaitan (Satan), save a few of you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a matter comes to them, be it of security or fear, they broadcast it, whereas if they returned it to the Messenger and to those in authority among them, those of them whose task is to research it would have known it. If it was not for the Bounty of Allah and His Mercy, all but a few of you would have followed satan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When some news of security or alarm comes their way, they broadcast it. But had they referred it to the Messenger, and to those in authority among them, those who can draw conclusions from it would have comprehended it. Were it not for God’s blessing and mercy upon you, you would have followed the Devil, except for a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there comes to them information about [public] security or fear, they spread it around. But if they had referred it back to the Messenger or to those of authority among them, then the ones who [can] draw correct conclusions from it would have known about it. And if not for the favor of Allah upon you and His mercy, you would have followed Satan, except for a few.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:83] And when there comes to them an issue, [news] concerning the raiding parties sent by the Prophet (s) and what has happened to them, be it of security, through victory, or of fear, through defeat, they broadcast it, they make it widely-known: this was revealed regarding a group from among the hypocrites, or from among the feeble believers, who used to do this, and so the hearts of the believers would lose courage and the Prophet (s) would become distressed. If they had referred it, the news, to the Messenger and to those in authority among them, that is, the judicious elders among the Companions, in other words, if they had kept quiet about it until they were fully informed; those among them who are able to think it out, [those who] follow it up and seek knowledge of it, the ones who broadcast it, would have known it, and whether it is a matter that ought be broadcast or not, from them, from the Prophet (s) and those of authority. And but for the bounty of God to you, through Islam, and His mercy, to you through the Qur’ān, you would surely have followed Satan, in the abominations to which he commands you, except a few [of you].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then mentioned the betrayal of the hypocrites, saying: (And if any tidings whether of safety) any news about the army, conquest or booty, they insist on it out of resentful envy (or fear) and when they receive any news about the army, killings or defeat, (come unto them, they noise it abroad) they divulge it, (whereas if they had referred it) the news of the army (to the messenger) until the messenger informs them (and such of them as are in authority) those possessed of reason and understanding, i.e. Abu Bakr and his companions, (those among them who are able to think out the matter would have known it) i.e. the precise news. (If it had not been for the grace of Allah and His mercy) by means of His given success and protection (you would have followed Satan) all of you, (save a few (of you)) who would not divulge the news.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَعَلِمَهُ ٱلَّذِينَ يَسْتَنْبِطُونَهُ مِنْهُمْ } قالَ زيدُ بن علي عليهما السلامُ: معناهُ يَستَخْرِجُونَهُ مِنْهُمْ\n\n\n\n\nوقوله تعالى: { أَذَاعُواْ بِهِ } معناهُ أَفْشُوهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High: {So that those who are given knowledge from among them may know it} - said Zayd ibn `Ali, peace be upon him: its meaning is that they take it out from among them.\n\n\nAnd His saying, \"Spread it [i.e., the news of the divorce]\" - its meaning is that you should make it known.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من ضعفه المسلمين قوم { إِذَا جَآءَهُمْ أَمْرٌ مِّنَ } موجبات { ٱلأَمْنِ أَوِ ٱلْخَوْفِ أَذَاعُواْ بِهِ } أي: فشوه ونشروه سواء كان واقعاً أما أراجيف\n ولحق للمسلمين بسبب تلك الإذاعة والأشاعة ما لايليق بهم { وَلَوْ } أنهم حين سمعوا الخبر { رَدُّوهُ إِلَى ٱلرَّسُولِ وَإِلَىٰ أُوْلِي ٱلأَمْرِ } أصحاب الرأي والتدبير { مِنْهُمْ } ليتأملوا فيه ويتبصروا { لَعَلِمَهُ } واستخرجه البتة المجتهدون { ٱلَّذِينَ يَسْتَنْبِطُونَهُ } وأمثاله { مِنْهُمْ } وجهاً موجباً للإفشاء أو الإسرار\n ولا تغتروا أيها المؤمنون بعقولكم\n ولا تستبدوا برأيكم { وَ } اعلموا أنه { لَوْلاَ فَضْلُ ٱللَّهِ عَلَيْكُمْ } بإرسال الرسول فيكم\n وإنزال الكتب علكيم { وَرَحْمَتُهُ } الشاملة بكم بتوفيقكم على الإيمان\n ومتابعة الرسول صلى الله عليه وسلم { لاَتَّبَعْتُمُ } بأجمعكم { ٱلشَّيْطَانَ } المضل عن طريق الحق { إِلاَّ قَلِيلاً } [النساء: 83] منكم\n وهم الذين استثناهم الله سبحانه في سابق عمله تفضلاً عليهم وامتناناً\n وإن انصرفوا عنك بالمرة وانتشروا من حولك\n\n\n{ فَقَاتِلْ } بنفسك يا أكمل الرسل { فِي سَبِيلِ ٱللَّهِ } إذ { لاَ تُكَلَّفُ إِلاَّ نَفْسَكَ } ولا تحمل أعباء الرسالة إلا عليك\n فعليك أن تشعر ذيلك لأمر الجهاد\n لا تبال بإعانتهم وانتصارهم\n ولا بتقاعدهم وانتشارهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "{ وَإِذَا جَآءَهُمْ أَمْرٌ مِّنَ ٱلأَمْنِ أَوِ ٱلْخَوْفِ أَذَاعُواْ بِهِ وَلَوْ رَدُّوهُ إِلَى ٱلرَّسُولِ وَإِلَىٰ أُوْلِي ٱلأَمْرِ مِنْهُمْ لَعَلِمَهُ ٱلَّذِينَ يَسْتَنْبِطُونَهُ مِنْهُمْ... }  قلت: استنبط الشيء: استخرجه من غيره، وأصل الاستنباط: إخراج النبط، وهو الماء، يخرج من البئر أول ما يحفر، والجار في { منهم }: إما بيان للموصول، أي: لعلم المستنبطون الذين هم أولو الأمر، أو يتعلق بعلم، أي: لعلمه الذين يستخرجونه إلى الناس من أولي الأمر. يقول الحقّ جلّ جلاله: في ذمّ المنافقين أو ضعفة المسلمين: { وإذا جاءهم أمرٌ } أي: خبر عن السرايا الذين توجهوا للغزو، من نصر وغنيمة وأمن أو خوف، وقتل وهزيمة، { أذاعوا به } أي: تحدثوا به، وأشهروه، وأرجفوا به قبل أن يصل إلى الرسول ـ عليه الصلاة والسلام ـ وأكابر الصحابة، الذين هم أولو الأمر وأهل البصائر، فيعرفون كيف يتحدثون به، ولو ردوا ذلك { إلى الرسول } وأخبروه به سرًا، أو سكتوا حتى يصل إليه، أو يردوه { إلى أولي الأمر } من أكابر الصحابة، لعلمه الذين يستخرجونه إلى الناس { منهم } فينقلونه على وجهه، ويعرفون كيف يتحدثون به من غير إرجاف ولا تخويف، أو { لعَلمَه الذين يستنبطونه } وهم أولو الأمر أولاً، ثم يعلم الناس، فلا يكون فيه إرجاف ولا سوء أدب. أو: وإذا جاءهم أمر من وحي السماء: من تخويف أو تأمين، أذاعوا به قبل أن يظهره الرسول ـ عليه الصلاة والسلام ـ، ولو سكتوا وردوا ذلك إلى الرسول حتى يتحدث به للناس، ويظهره أولو الأمر من أكابر أصحابه، لعلمه الذين يستخرجون ذلك الوحي من أصله، وهو الرسول ـ عليه الصلاة والسلام ـ وأكابر أصحابه، كما فعل عمر رضي الله عنه: إذ سمع أن رسول الله صلى الله عليه وسلم طلق نساءه، فدخل عليه فقال: أطلقت نساءك؟ قال:\n \" لا \" \nفقال على باب المسجد، فقال: إن رسول الله صلى عليه وسلم لم يطلق نساءه، فأنزل الله هذه القصة، قال: وأنا الذي استنبطته. والله تعالى أعلم. الإشارة: قالت الحكماء: قلوب الأحرار قبور الأسرار، وهذه الخصلة التي ذمَّها الله تعالى توجد في كثير من العوام مهما سمعوا خبرًا: خيرًا أو شرًا، بادروا إلى إفشائه، ولا سيما إذا سمعوه على أهل النسبة أو أهل الخصوصية، وقد تُوجد في بعض الفقراء، وهي غفلة ونوع من الفضول، فالفقير الصادق غائب عن أخبار الزمان وأهله، وقد ترك الناسَ وما هم فيه، وقد تغلب عليه الغيبة في الله حتى تغيب عنه الأيام، وأما الفقير الذي يتسمع الأخبار ويبحث عنها فلا نسبة له في الفقر، إلا اسم بلا مسمى، وقد ترى بعض الفقراء، يُبلِّغُ مساوِىءَ إخوانه إلى المشايخ، وهو سبب الطرف، والعياذ بالله.\nوقد كان صلى الله عليه وسلم يقول:\n \" لا تبلغوني مساوىء أصحابي \" \nلأن ذلك يسؤوهم، والخير كله في إدخال السرور على قلوب المشايخ. وتنسحب الآية على مَن يُفشِيِ أسرار الربوبية، ويُطلع الفقراء علَى الحقيقة، ولو ردوا ذلك إلى شيخهم حتى يكون هو الذي يطلعهم لكان أحسن، لأن الحقيقة إذا أُخِذَت من الشيخ كان فيها سر كبير، بخلاف ما إذا أُخِذّت من غيره، إلاَّ إذا كان مأذونًا في ذلك فكأنه هو. والله تعالى أعلم. وقال الورتجبي: قال أبو سيعد الخراز: إن له عبادًا يدخل عليهم الخلل، ولولا ذلك لفسدوا وتعطلوا، وذلك أنهم بَلَغُوا من العلم غاية، صاروا إلى علم المجهول، الذي لم ينصُّه كتاب، ولا جاء به خبر، لكن العقلاء العارفون، يحتجون له من الكتاب والسنة، بحسن استنباطهم ومعرفتهم، قال تعالى: { لعلمه الذين يستنبطونه منهم }.هـ. قلت: ومعنى كلامه: أن الله ـ تعالى ـ أشغل علماء الظاهر بتقرير علم الفرق، ولولا اشتغالهم بذلك لتعطلوا وتبطلوا، إذ لا قدرة لهم على عمل القلوب من الفكرة والنظرة، لكن العارفون يقرون لهم ذلك، ويحتجون لهم بما في نشر العلم من الأجور، من الكتاب والسنة، لأنهم قاموا بنظام عمل الحكمة ورفعوا علم الشريعة، ولولا قيامهم بذلك لتعين على أهل الباطن، فتتشوش عليهم قلوبهم، وكان شيخ شيوخنا سيدي علي الجمل العمراني رضي الله عنه يقول: جزاهم الله عنا خيرًا رفعوا لنا علم الشريعة، نحن نغرق في البحر، ثم نرفع رأسنا فنرى العلم قائمًا، ثم نرجع إلى البحر. هـ. بالمعنى، والله تعالى أعلم. ثم إن الهداية بيد الله، قوم أقامهم في الفرق، وقوم هداهم إلى الجمع، كما قال تعالى: {... وَلَوْلاَ فَضْلُ ٱللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ لاَتَّبَعْتُمُ ٱلشَّيْطَانَ إِلاَّ قَلِيلاً }  يقول الحقّ جلّ جلاله: لولا أن الله تفضل عليكم ورحمكم بنبي الرحمة، وأنقذكم من متابعة الشيطان وعبادة الأوثان، لبقيتم على كفركم وضلالكم، ولاتبعتم الشيطان فيما يأمركم به من الكفر والعصيان، إلا قليلاً ممن اهتدى قبل بعثته، كقس بن ساعدة، وزيد بن نفيل، وورقة بن نوفل، رزقهم الله كمال العقل فنظروا وتفكروا بعقولهم فوجدوا الله واعتزلوا ما كان يعبد آباؤهم وإخوانهم. أما قس فاعتزل قومه، وعبد الله وحده، وكان يخطب على الناس ويأمرهم بالتوحيد، ويعيب عليهم عبادة الأصنام. وعاش سبعمائة عام. وأما زيدٌ فتعلق بالحنيفية، دين إبراهيم، حتى مات قبل البعثة. وأما ورقة ـ فأخذ بدين النصرانية التي لم تُغَيَّر، وأدرك أول البعثة، وآمن بالرسول قبل أن يُؤمر بالإنذار، قال ـ عليه الصلاة والسلام ـ:\n \" رأيتُه في الجنة عليه ثيابُ خُضر \" \nوالله تعالى أعلم. الإشارة: لولا فضل الله عليكم بأن بعث لكم مَن يدلكم على الله ويعرفكم بالله، ورحمته بأن أخرجكم من ضيق الفرق، إلى فضاء الجمع، لاتبعتم الفرق علمًا وعملاً، لكن الله تعالى بفضله ورحمته غيبكم عن شهود الفرق بشهود الملك الحق. إلاّ فرقًا قليلاً تقيمون به رسم العبودية، وتظهرون به الآداب مع الربوبية. قال الورتجبي: الفضل والرحمة منه للعموم، ومحبته للخصوص، الذين هم مستثنون بقوله: \" إلا قليلاً \". هـ. قال القشيري: { ولولا فضل الله } مع أوليائه لهاموا في كل وادٍ من الفرقة كأشكالهم في الوقت. هـ. فَخَصَّ الإشارة بالأولياء، وعليه فقوله: { إلا قليلاً } أي: إلا تفرقة قليلة تعرض لهم، تربيةً لهم، وإبقاء لرسمهم ومناطِ تكليفهم. والله تعالى أعلم. قاله في الحاشية.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:21",
      "similarity": 0.04429275096000413
    },
    {
      "verse": "5:54",
      "similarity": 0.03606430757568211
    },
    {
      "verse": "11:116",
      "similarity": 0.035430217165752564
    },
    {
      "verse": "4:59",
      "similarity": 0.03281645495148019
    },
    {
      "verse": "10:107",
      "similarity": 0.031064303145374197
    }
  ]
}