{
  "chapter": "النساء",
  "text": "واذا حييتم بتحية فحيوا۟ باحسن منها او ردوها ان الله كان على كل شىء حسيبا",
  "translations": [
    {
      "translation": "When you are greeted with a greeting, return the greeting or improve on it. Allah takes account of everything.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you are greeted with a greeting, then greet with one fairer, or repeat the same greeting. For God takes account of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you are greeted with a salutation then return it with a better one, or at least the same. Surely Allah takes good count of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Answer a greeting in kinder words than those said to you in the greeting or at least as kind. God keeps account of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you are greeted with some words, greet back with words better than it or with the same; indeed Allah will take account of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you are greeted with a greeting, greet in return with what is better than it, or (at least) return it equally. Certainly, Allah is Ever a Careful Account Taker of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you are greeted with a greeting, greet with a better (greeting) than it or return it; surely Allah takes account of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you are greeted with a greeting greet with a fairer than it, or return it; surely God keeps a watchful count over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When ye are greeted with a greeting, greet ye with a better than it or return it. Lo! Allah taketh count of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you are greeted by anyone, respond with a better greeting or at least return it; God takes account of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when ye are greeted with a greeting, then greet back with one better than that or return that; verily Allah is of everything the Reckoner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you are greeted with a salute, greet with a better one than it, or return it; indeed Allah takes account of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a (courteous) greeting is offered you, meet it with a greeting still more courteous, or (at least) of equal courtesy. Allah takes careful account of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you are greeted with a greeting, greet in return with what is better than it, or (at least) return it equally. Certainly, Allah is Ever a Careful Account Taker of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you are greeted with a greeting, greet with better than it, or return it. Allah is the Reckoner of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you are greeted with a greeting, respond with a better greeting, or return it. God keeps count of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you are greeted with a greeting, greet [in return] with one better than it or [at least] return it [in a like manner]. Indeed, Allah is ever, over all things, an Accountant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:86] And when you are greeted with a greeting, as when it is said to you, ‘Peace be upon you’, greet, the one that greeted you, with better than it, by responding to him with, ‘Peace be upon you, and God’s mercy and blessings’, or return it, by saying back to him what he said; in other words, it is a duty to greet in one of these two ways, the former being the preferred one. Surely God keeps count of, He holds [you] accountable for, all things, and requites accordingly, including things such as returning a greeting. The Sunna specifies that one should not return the greeting of an disbeliever, an innovator, a wicked person, and of the one that greets a person who is in the act of relieving himself, or one in the bath, or one eating — indeed it is actually disapproved with the exception of the last. To the disbeliever [who says ‘peace be upon you’] one should simply say, ‘And upon you’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When ye are greeted with a greeting) when someone greets you with a greeting, (greet ye with a better than it) this is for those of your Religion and belief by adding to the formula of greeting (or return it) or return the exact greeting, if the one who greets you happens to be of another religion. (Lo! Allah taketh count of all things) of greeting and the return of greetings, just as He is a witness and will reward all. This verse was revealed about a group of people who refrained from returning greetings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { عَلَىٰ كُلِّ شَيْءٍ حَسِيباً } أَي كَافِياً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Everything will be accounted for,\" is enough.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِذَا حُيِّيتُم } أيها المؤمنون { بِتَحِيَّةٍ } ناشئة من أخيكم المسلم { فَحَيُّواْ بِأَحْسَنَ مِنْهَآ } أي: زيدوا عليها\n وفاء لحق المبادرة { أَوْ رُدُّوهَآ } كمثلها بلا نقصان شيء منها\n وفاء لحق المؤاخاة { إِنَّ ٱللَّهَ } المراقب لجميع حالاتكم { كَانَ عَلَىٰ كُلِّ شَيْءٍ } صدر عنكم من خير وشر ونفع وضر { حَسِيباً } [النساء: 86] يحاسبكم بلا فوت شيء\n ويجازيكم على مقتضى حسابه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n لذلك ذكره الحق في سلك الدلالة على الخير فقال: { وإذا حُييتم بتحية فحيوا بأحسن منها } بأن تقولوا: وعليكم السلام والرحمة والبركة\n { أو ردوها } بأن تقولوا: وعليكم السلام\n وفي الخبر: \" مَن قَالَ لأخيه المسلم: السَّلامُ علَيكُم\n كتب الله له عَشرُ حَسنات\n فإن قال: السَّلامُ عليكُم ورحمَةُ الله\n كتب الله له عِشرين حَسنة\n فإن قال: وَبَرَكَاتُه\n كتب الله ثَلاثين \" \n وكذلك لمن ردّ\n فإن اقتصر على السلام\n فعشر\n وهكذا\n\n فإن ذكرَ المسلم الرحمةَ والبركةَ\n قال الرادُّ: وعليكم\n فقط\n إذ لم يبق ما يزاد\n ورد السلام واجب على الكفاية\n حيث يكون مشروعًا\n فلا يرد في الخطبة\n وقراءة القرآن\n والذكر والتفكر\n والاعتبار\n ونظرة الشهود والاستبصار\n لأنه يفتر ويشوش\n وفي الحمام إذا كانوا عراة\n وفي حال الجماع والأكل والشرب وغيرها من المسائل المستثناة\n\nوقد نظمه بعضهم\n فقال:\nوالسلام من تحية أهل الإسلام\n خاصٌّ بهم\n لذلك استغرب الخضر ـ عليه السلام ـ سلام سَيدنا موسى عليه السلام فقال له: \" وأنَّى بأرضِكَ السَّلامُ\n وكذلك خليل الله إبراهيم عليه السلام\n إنما أنكر الملائكة حيث سلموا عليه بتحية أهل الإسلام لأنه كان بين أظهر قوم كفار\n أما سلام أبي ذر على النبي صلى الله عليه وسلم بتحية أهل الإسلام\n قبل أن يسلم\n فلعله سمعه من بعض الصحابة قبل أن يسلم\n أو إلهام من الله\n والله تعالى أعلم\n { إن الله كان على كل شيء حسيبًا } يحاسبكم على التحية وغيرها\n وبالله التوفيق\n الإشارة: فجاهد أيها الإنسان نفسك في سبيل الله\n لا تكلف إلا إصلاحها وتزكيتها\n وحرض من يسمع قولك من المؤمنين على جهاد أنفسهم\n عسى الله أن يكف عنهم القواطع والعلائق\n فيتأهلون لإشراق قلوبهم بأنوار الحقائق\n فإن الله لا يغلبه شيء\n فمن ذكّر عبادَ الله\n ودسهم إلى حضرة الله كان حظه كبيرًا عند الله\n ومن دلهم على غير الله فقد غشهم وكان مُهانًا عند الله\n وإذا وقع السلام على الفقراء فإن كانوا سالكين غير مشتغلين بالذكر وجب عليهم الرد بأحسن\n وإذا كانوا ذاكرين أو متفكرين أو سكارى في شهود الحبيب سقط عنهم السلام\n وكذلك إذا سلم عليهم اختبارًا وتعنيتًا لم يجب الرد\n والله تعالى أعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:62",
      "similarity": 0.31930508387305706
    },
    {
      "verse": "88:26",
      "similarity": 0.31904111756572234
    },
    {
      "verse": "3:100",
      "similarity": 0.3098660868754088
    },
    {
      "verse": "9:105",
      "similarity": 0.308180530283628
    },
    {
      "verse": "4:59",
      "similarity": 0.3047780570591687
    }
  ]
}