{
  "chapter": "النساء",
  "text": "الله لا اله الا هو ليجمعنكم الى يوم القيمة لا ريب فيه ومن اصدق من الله حديثا",
  "translations": [
    {
      "translation": "Allah, there is no god but Him. He will gather you to the Day of Rising about which there is no doubt. And whose speech could be truer than Allah's?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God: There is no god but He. He will gather you together on the Day of Resurrection which is certain to come; and whose word is truer than God's?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no god but Allah. He will certainly gather you all together on the Day of Resurrection - the Day regarding which there can be no doubt. Whose word can be truer than Allah's?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God exists. He is the only Lord. He will gather you all together on the Day of Judgment which will certainly come. Who is more truthful than God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! There is none worthy of worship except Him; He will surely gather you all on the Day of Resurrection in which there is no doubt; and whose Words are more true than those of Allah? (Allah does not lie.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! None has the right to be worshipped but He. Surely, He will gather you together on the Day of Resurrection about which there is no doubt. And who is truer in statement than Allah\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, there is no god but He-- He will most certainly gather you together on the resurrection day, there is no doubt in it; and who is more true in word than Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God -- there is no god but He. He will surely gather you to the Resurrection Day, no doubt of it. And who is truer in tidings than God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! There is no Allah save Him. He gathereth you all unto a Day of Resurrection whereof there is no doubt. Who is more true in statement than Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God: there is no deity other than Him. He will gather you all together on the Day of Resurrection, there is no doubt about it. Whose word can be truer than God's?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! there is no god but he. Surely He shall gather you together on the Day of Resurrecticn, whereof there is no doubt; and who is more truthful than Allah in discourse?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah—there is no god except Him—will surely gather you on the Day of Resurrection, in which there is no doubt; and who is more truthful in speech than Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! There is no god but He: of a surety He will gather you together against the Day of Judgment, about which there is no doubt. And whose word can be truer than Allah's?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! La ilaha illa Huwa (none has the right to be worshipped but He). Surely, He will gather you together on the Day of Resurrection about which there is no doubt. And who is truer in statement than Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, there is no god except He. He will gather you to the Resurrection Day, there is no doubt in it. And who is truer in statement than Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God—there is no god except He. He will gather you to the Day of Resurrection, in which there is no doubt. And who speaks more truly than God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah - there is no deity except Him. He will surely assemble you for [account on] the Day of Resurrection, about which there is no doubt. And who is more truthful than Allah in statement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:87] God — there is no god except Him, and by God, He will surely gather you, from your graves, to, on, the Day of Resurrection whereof there is no doubt, no uncertainty. And who is truer in statement, in speech, than God?, that is, no one is.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then declared His divine Oneness, saying: (Allah! There is no God save Him. He gathers you all unto a Day of Resurrection) on the Day of Judgement (whereof there is no doubt. Who is more true in statement) in words (than Allah?).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱللَّهُ } الجامع لجميع مراتب الأسماء الموجودة المريبة لمسمياتكم وهوياتكم { لاۤ إِلَـٰهَ } لا موجودة ولا مربي لكم في الوجود { إِلاَّ هُوَ } الحي القيوم الذي لا يعرض له التغيير مطلقاً { لَيَجْمَعَنَّكُمْ } وليحشرنكم من قبور تعيناتكم { إِلَىٰ يَوْمِ ٱلْقِيَامَةِ } التي عرضوا فيها إلى الله، وحشروا نحوه مسنلخين عن هوياتكم الباطلة { لاَ رَيْبَ فِيهِ } وفي جمعه، فلكم بعدما أخبرتم أن تصدقوه { وَمَنْ أَصْدَقُ مِنَ ٱللَّهِ حَدِيثاً } [النساء: 87] حتى تصدقوا حديثه وتؤمنوا، فعلكيم ألاَّ تخالفوا حكم الله وأمره بعد وروده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:12",
      "similarity": 0.5798520707739083
    },
    {
      "verse": "3:9",
      "similarity": 0.5558075768470135
    },
    {
      "verse": "45:26",
      "similarity": 0.5341836864590598
    },
    {
      "verse": "52:34",
      "similarity": 0.5263189474449511
    },
    {
      "verse": "32:2",
      "similarity": 0.48086121023637074
    }
  ]
}