{
  "chapter": "النساء",
  "text": "فما لكم فى المنفقين فئتين والله اركسهم بما كسبوا۟ اتريدون ان تهدوا۟ من اضل الله ومن يضلل الله فلن تجد له سبيلا",
  "translations": [
    {
      "translation": "How is it that you have become two parties regarding the hypocrites, when Allah has returned them to kufr for what they did? Do you desire to guide people Allah has misguided? When Allah misguides someone, you will find no way for him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How is it that you are divided in two factions about the hypocrites? God has routed them for what they were doing. Do you wish to guide him to the path whom God has allowed to go astray? As for him whom God allows to go astray you will not find a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What has happened to you that you have two minds about the hypocrites even though Allah has reverted them, owing to the sins that they earned? Do you want to lead those to the right way whom Allah let go astray? And he whom Allah lets go astray, for him you can never find a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why are you divided into two different parties concerning the hypocrites, when God Himself has turned them to disbelief because of their misdeeds. Do you want to guide those whom God has caused to go astray? You cannot find guidance for those whom God has made to err.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So what is the matter with you that you got divided into two groups concerning the hypocrites, whereas Allah has inverted them because of their misdeeds? Do you wish to guide one whom Allah has sent astray? And for one whom Allah sends astray, you will not find a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then what is the matter with you that you are divided into two parties about the hypocrites Allah has cast them back because of what they have earned. Do you want to guide him whom Allah has made to go astray And he whom Allah has made to go astray, you will never find for him a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is the matter with you, then, that you have become two parties about the hypocrites, while Allah has made them return (to unbelief) for what they have earned? Do you wish to guide him whom Allah has caused to err? And whomsoever Allah causes to err, you shall by no means find a way for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How is it with you, that you are two parties touching the hypocrites, and God has overthrown them for what they earned? What, do you desire to guide him whom God has led astray? Whom God leads astray, thou wilt not find for him a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What aileth you that ye are become two parties regarding the hypocrites, when Allah cast them back (to disbelief) because of what they earned? Seek ye to guide him whom Allah hath sent astray? He whom Allah sendeth astray, for him thou (O MUhammad) canst not find a road.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How is it that you are divided into two groups regarding the hypocrites, when God Himself cast them back [to disbelief] because of their misdeeds? Do you seek to guide those whom God allows to go astray? You cannot guide those whom God allows to go astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What aileth you then, that ye are two parties regarding the hypocrites? whereas Allah hath reverted them because of that which they have earned. Would ye lead aright those whom Allah hath sent astray? And whomsoever Allah sendeth astray, for him thou shalt not find a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should you be two groups concerning the hypocrites, while Allah has made them relapse [into unfaith] because of their deeds? Do you desire to guide someone Allah has led astray? Whomever Allah leads astray, you will never find any way for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should ye be divided into two parties about the Hypocrites? Allah hath upset them for their (evil) deeds. Would ye guide those whom Allah hath thrown out of the Way? For those whom Allah hath thrown out of the Way, never shalt thou find the Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then what is the matter with you that you are divided into two parties about the hypocrites? Allah has cast them back (to disbelief) because of what they have earned. Do you want to guide him whom Allah has made to go astray? And he whom Allah has made to go astray, you will never find for him any way (of guidance).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is the matter with you that you are two parties concerning the hypocrites when Allah has overthrown them for what they earned? Would you desire to guide those whom Allah has caused to be led astray? Whosoever Allah leads astray, you will not find for him a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is the matter with you, divided into two factions regarding the hypocrites, when God Himself has overwhelmed them on account of what they did? Do you want to guide those whom God has led astray? Whomever God leads astray—you will never find for him a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is [the matter] with you [that you are] two groups concerning the hypocrites, while Allah has made them fall back [into error and disbelief] for what they earned. Do you wish to guide those whom Allah has sent astray? And he whom Allah sends astray - never will you find for him a way [of guidance].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:88] When a group retreated from Uhud, people were at variance over their status. Some said, ‘Let us slay them’, while others said, ‘No!’ So the following was revealed: What is wrong with you, what is the matter with you, that you have become two parties, two groups, regarding the hypocrites, when God has overthrown them, He has turned them back [to disbelief], for what they earned?, in the way of disbelief and acts of disobedience. What, do you desire to guide him whom God has sent astray?, that is, to count them among the guided (the interrogative in both places is for disapproval). And he whom God sends astray, you will never find for him a way, a path to guidance.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "The following was revealed about ten hypocrites who left Islam and Medina for Mecca: (What aileth you) group of believers (that you are become two parties) one party of the view that the hypocrites' wealth and blood are lawful and a party holding the opposite view (regarding the hypocrites) who abandoned Islam, (when Allah cast them back (to disbelief) because of what they earned) because of their hypocrisy and evil intentions? (Seek you to guide) to the religion of Allah (him whom Allah hath sent astray) from His religion? (He whom Allah sendeth astray) from His religion, (for him thou (0 Muhammad) canst not find a road) you cannot find a religion or argument in their favour.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱللَّهُ أَرْكَسَهُمْ } معناهُ نَكَّسَهُمْ وَرَدَّهُمْ فِيهِ ويقالُ: أَهْلَكهُمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd God says: {And Allah will destroy them} This means that He will destroy them and return them to Him. And it is said: He will destroy them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذا كان الأمر على هذا { فَمَا } أي شيء عرض ولحق { لَكُمْ } أيها المؤمنون { فِي } أمر { ٱلْمُنَافِقِينَ } حتى تكونوا { فِئَتَيْنِ } فرقتين\n ولم تتفقوا على كفرهم وشركهم { وَٱللَّهُ أَرْكَسَهُمْ } الحال أنه سبحانه قلبهم وردهم إلى كفرهم { بِمَا كَسَبُوۤاْ } لأنفسهم من الشرك بالله - العياذ بالله - والبغض مع رسوله والنفاق مع المؤمنين { أَتُرِيدُونَ } بهذا التفرق والتردد في أمرهم { أَن تَهْدُواْ مَنْ أَضَلَّ ٱللَّهُ } وتخالفوا كلمه\n كأنكم لم تصدقوه { وَ } اعلم أيها الكامل في أمر الرسالة { مَن يُضْلِلِ ٱللَّهُ } عن نور الإيمان والهداية { فَلَن تَجِدَ } أنت مع كونك ممن أذن بالكشف عنه { لَهُ سَبِيلاً } [النساء: 88] إلى الهداية فضلاً عن أن يجده غيرك\n وهم من غاية بغضهم معكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ فَمَا لَكُمْ فِي ٱلْمُنَافِقِينَ فِئَتَيْنِ وَٱللَّهُ أَرْكَسَهُمْ بِمَا كَسَبُوۤاْ أَتُرِيدُونَ أَن تَهْدُواْ مَنْ أَضَلَّ ٱللَّهُ وَمَن يُضْلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُ سَبِيلاً وَدُّواْ لَوْ تَكْفُرُونَ كَمَا كَفَرُواْ فَتَكُونُونَ سَوَآءً\n\n\n }  قلت: { فئتين }: حال، والعامل فيه: الاستقرار في الجر، وأركس الشيء نكَّسه\n يقول الحقّ جلّ جلاله: معاتبًا الصحابة حين اختلفوا في إسلام بعض المنافقين، فقال: { فما لكم } افترقتم { في } شأن { المنافقين } فرقتين، ولم تتفقوا على كفرهم، والحالة أن الله ـ تعالى ـ { أركسهم } ، أي: نكَّسهم وردهم إلى الكفر بعد أن أظهروا الإسلام بسبب ما كسبوا من الآثام\n { أتريدون أن تهدموا من أضل الله } ، وسبق لهم الشقاء في علم الله؟ ومن يضلل الله فلن تجد له طريقاً إلى الهدى\n قال ابن عباس ـ رضي الله عنهماـ:  نزلت في قومِ كانوا بمكة من المشركين، فزعموا أنهم آمنوا ولم يهاجروا، ثم سافر قوم منهم بتجارات إلى الشام، فاختلف المسلمون، هل يقتلونهم ليغنموا تجارتهم، لأنهم لم يهاجروا، أو يتركونهم لأنهم مؤمنون؟\n وقيل: في قوم أسلموا ثم اجتَوَوا المدينة، واستأذنوا رسول الله صلى عليه وسلم في الخروج إلى البدو، فلما خَرَجُوا لم يزالُوا راحلين مَرحلةٌ حتى لحقُوا بالمُشركين، فاختلف المسلمون في إسلامهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:91",
      "similarity": 0.6094276370659998
    },
    {
      "verse": "18:43",
      "similarity": 0.2752248260807793
    },
    {
      "verse": "8:19",
      "similarity": 0.26662628585667747
    },
    {
      "verse": "8:45",
      "similarity": 0.2432107229273231
    },
    {
      "verse": "28:81",
      "similarity": 0.23668497993399487
    }
  ]
}