{
  "chapter": "النساء",
  "text": "ودوا۟ لو تكفرون كما كفروا۟ فتكونون سواء فلا تتخذوا۟ منهم اولياء حتى يهاجروا۟ فى سبيل الله فان تولوا۟ فخذوهم واقتلوهم حيث وجدتموهم ولا تتخذوا۟ منهم وليا ولا نصيرا",
  "translations": [
    {
      "translation": "They wish you to become disbelievers as they are, so that you should become like them. Therefore hold them not as friends until they go out of their homes in the way of God. If they do not, seize them wherever they are and do away with them. Do not make them your friends or allies,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wish that you should disbelieve just as they disbelieved so that you may all be alike. Do not, therefore, take from them allies until they emigrate in the way of Allah, but if they turn their backs (on emigration), seize them and slay them wherever you come upon them. Take none of them for your ally or helper, This is the verdict on those hypocritical confessors of faith who belong to a belligerent, non-Muslim nation and actually participate in acts of hostility against the Islamic state.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wish you to become unbelievers as they themselves are. Do not establish friendship with them until they have abandoned their homes for the cause of God. If they betray you, seize them and slay them wherever you find them. Do not establish friendship with them or seek their help\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wish that you too should turn disbelievers the way they did, so that you all may become equal – so do not befriend any of them until they forsake their homes and families in Allah’s cause; then if they turn back, seize them and kill them wherever you find them; and do not take any of them as a friend nor as a supporter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wish that you reject faith, as they have rejected, and thus that you all become equal (like one another). So take not Awliya' from them, till they emigrate in the way of Allah. But if they turn back, take (hold of) them and kill them wherever you find them, and take neither Awliya' nor helpers from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They desire that you should disbelieve as they have disbelieved, so that you might be (all) alike; therefore take not from among them friends until they fly (their homes) in Allah's way; but if they turn back, then seize them and kill them wherever you find them, and take not from among them a friend or a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wish that you should disbelieve as they disbelieve, and then you would be equal; therefore take not to yourselves friends of them, until they emigrate in the way of God; then, if they turn their backs, take them, and slay them wherever you find them; take not to yourselves any one of them as friend or helper\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They long that ye should disbelieve even as they disbelieve, that ye may be upon a level (with them). So choose not friends from them till they forsake their homes in the way of Allah; if they turn back (to enmity) then take them and kill them wherever ye find them, and choose no friend nor helper from among them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They want you to deny the Truth, so that you may become all alike. Do not take them as your allies until they emigrate in the way of God. If they turn back (to enmity), seize them and kill them wherever you may find them; and take no friend or helper from among them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fain would they that ye disbelieved even as they have disbelieved, so that ye may be all alike. Wherefore take not friends from among them until they migrate for the sake of Allah; and if they turn away, then lay hold of them and slay them, wheresoever ye find them, and take not from among them a friend or a helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are eager that you should disbelieve like they have disbelieved, so that you all become alike. So do not make friends [with anyone] from among them, until they migrate in the way of Allah. But if they turn their backs, seize them and kill them wherever you find them, and do not take from among them friends or helpers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They but wish that ye should reject Faith, as they do, and thus be on the same footing (as they): But take not friends from their ranks until they flee in the way of Allah (From what is forbidden). But if they turn renegades, seize them and slay them wherever ye find them; and (in any case) take no friends or helpers from their ranks;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wish that you reject Faith, as they have rejected (Faith), and thus that you all become equal (like one another). So take not Auliya' (protectors or friends) from them, till they emigrate in the Way of Allah (to Muhammad SAW). But if they turn back (from Islam), take (hold) of them and kill them wherever you find them, and take neither Auliya' (protectors or friends) nor helpers from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wish that you would disbelieve as they disbelieve, and then you would be equal. Therefore, do not take a guide from them until they emigrate in the way of Allah. Then, if they turn back take them and kill them wherever you find them. Do not take them for guides or helpers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They would love to see you disbelieve, just as they disbelieve, so you would become equal. So do not befriend any of them, unless they emigrate in the way of God. If they turn away, seize them and execute them wherever you may find them; and do not take from among them allies or supporters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They wish you would disbelieve as they disbelieved so you would be alike. So do not take from among them allies until they emigrate for the cause of Allah. But if they turn away, then seize them and kill them wherever you find them and take not from among them any ally or helper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:89] They long, they wish, that you should disbelieve as they disbelieve, so then you, and they, would be equal, in unbelief; therefore do not take friends from among them, associating with them, even if they should [outwardly] manifest belief, until they emigrate in the way of God, a proper emigration that would confirm their belief; then, if they turn away, and remain upon their ways, take them, as captives, and slay them wherever you find them; and do not take any of them as a patron, to associate with, or as a helper, to assist you against your enemy.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They long that you should disbelieve) in Muhammad and the Qur'an (even as they disbelieve, that ye may be upon a level (with them)) in following idolatry. (So choose not friends from them) in religion or for seeking assistance and backing (till they forsake their homes) until they believe again and migrate (in the way of Allah) in obedience of Allah; (if they turn back) from faith and migration (then take them) as prisoners (and kill them wherever you find them) in the Sacred Precinct or anywhere else, (and choose no friend) in religion or for seeking assistance and backing (nor helper) a protector (from among them),\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَدُّواْ لَوْ تَكْفُرُونَ } أي: تمنوا أن تكفروا { كَمَا كَفَرُواْ فَتَكُونُونَ } معهم { سَوَآءً } في الكفر والضلال والبعد من جوار الله وكنفه، وإذا كان الأمر على هذه { فَلاَ تَتَّخِذُواْ مِنْهُمْ } أي: أعداءكم { أَوْلِيَآءَ } توالونهم وتوادونهم { حَتَّىٰ يُهَاجِرُواْ } أي: إلى أن يسلموا ويهاجروا { فِي سَبِيلِ ٱللَّهِ } ويبعدوا عن ديارهم وعشائرهم؛ تقرباً إلى الله وتوجهاً إلى رسوله { فَإِنْ تَوَلَّوْاْ } أي: أعرضوا عن الإسلام والتقرب إلى الله بعدما هاجروا عن ديارهم { فَخُذُوهُمْ وَٱقْتُلُوهُمْ حَيْثُ وَجَدتُّمُوهُمْ } كسائر المشركين { وَلاَ تَتَّخِذُواْ مِنْهُمْ } أي: من هؤلاء المهاجرين المصرين على شركهم وكفره { وَلِيّاً } توالونه { وَلاَ نَصِيراً } [النساء: 89] تنصرونه، فعليكم أن تجانبوهم وتتركوا ولايتهم وودادهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم حكم بكفرهم فقال { ودّوا لم تكفرون } أي: يتمنون كفركم { كما كفروا فتكونون } معهم { سواء } في الضلال والكفر\n الإشارة: من دخل في طريق المخصوصين الأبرار، ثم لم تساعده رياح الأقدار، فلا ينبغي الكلام فيه، ولا الخوض في شأنه، لأن أمره بيد ربه،  من يهده الله فلا مضل له، ومن يضلل فلا ناصر له\n وبالله التوفيق، وهو الهادي إلى سواء الطريق\n ثم نهى عن مُوَالاَتهم، فقال: {\n\n",
      "translations": []
    }
  ]
}