{
  "chapter": "النساء",
  "text": "وليخش الذين لو تركوا۟ من خلفهم ذرية ضعفا خافوا۟ عليهم فليتقوا۟ الله وليقولوا۟ قولا سديدا",
  "translations": [
    {
      "translation": "People should show concern in the same way that they would fear for small children if they were to die leaving them behind. They should have taqwa of Allah and say words that are appropriate.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let people fear the day when they leave small children behind them unprovided, and how concerned they would be for them. So fear God and say the right things to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let them fear, those who, if they would themselves leave behind helpless offspring, they would surely have been fearful on their account. Let them, then, fear Allah and make the right statement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are concerned about the welfare of their own children after their death, should have fear of God (when dealing with the orphans) and guide them properly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those people must fear, who if they die leaving behind them young children would be afraid for them; so they must fear Allah and speak with fairness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let those (executors and guardians) have the same fear in their minds as they would have for their own, if they had left weak offspring behind. So, let them have Taqwa of Allah and speak truthfully.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let those fear who, should they leave behind them weakly offspring, would fear on their account, so let them be careful of (their duty to) Allah, and let them speak right words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let those fear who, if they left behind them weak seed, would be afraid on their account, and let them fear God, and speak words hitting the mark.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let those fear (in their behaviour toward orphans) who if they left behind them weak offspring would be afraid for them. So let them mind their duty to Allah, and speak justly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are concerned about the fate of their own helpless children if they should die and leave them behind should show the same concern for orphans. Let them fear God and uphold justice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let them beware who, should they leave behind them a weakly progeny, would be afraid on their account; let them, wherefore, fear Allah, and says a proper saying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let those fear [the result of mistreating orphans] who, were they to leave behind weak offspring, would be concerned on their account. So let them be wary of Allah, and let them speak upright words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let those (disposing of an estate) have the same fear in their minds as they would have for their own if they had left a helpless family behind: Let them fear Allah, and speak words of appropriate (comfort).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let those (executors and guardians) have the same fear in their minds as they would have for their own, if they had left weak offspring behind. So let them fear Allah and speak right words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let them fear, who, if they themselves left behind weak offspring, would be afraid for them, and let them fear Allah and speak exactly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are concerned about the fate of their weak children, in case they leave them behind, should fear God, and speak appropriate words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let those [executors and guardians] fear [injustice] as if they [themselves] had left weak offspring behind and feared for them. So let them fear Allah and speak words of appropriate justice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:9] And let them fear, let them be concerned for the orphans, those who, if they, are about to, leave behind them, that is, after their death, weak offspring, young children, would be afraid for them; that they be ruined; let them fear God, in the matter concerning orphans, and let them give what they would love for their own offspring after their death; and speak, to the one approached by death, pertinent words, the right [words], by enjoining him to give as voluntary almsgiving no more than the third [of the inheritance], and leave the remainder for the ones inheriting, so that they do not end up as dependants.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And let those) who visit a sick person and enjoin him to bequeath more than a third of his inheritance (fear (in their behaviour toward orphans)) the ruin of the children of this sick person after he dies (who if they left behind them) after they die (weak offspring) unable to fend for themselves (would be afraid for them) to face ruin. Just as they would fear ruin for their own children, they ought to fear ruin for the children of any deceased person; it is also said that this means: enjoin the person who is on his deathbed that which you would enjoin yourself; and fear for the loss of his children if he were to die, as you would fear for the loss of your own children if you were to die. This is because they were in the habit of visiting people who were on their deathbeds and enjoining them to give their property to this and that person until nothing was left for their own children, so Allah prohibited them from so doing. Then Allah said: (So let them mind their duty to Allah) let them fear Allah regarding the bequeathing of more than a third of the inheritance to those who are not entitled to inheritance, (and speak) to the person who is sick [expecting to die] Qustly) about his will.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلْيَقُولُواْ قَوْلاً سَدِيداً } معناهُ قَولٌ صَادِقٌ\n\n",
      "translations": [
        {
          "translation": " And His saying, {And let them say a word of truth}, its meaning is a true word.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلْيَخْشَ } من سخط الله وغضبه الأوصياء أو الحضَّار { ٱلَّذِينَ } حضروا عند من أشرف على الموت أن يلقنوا له التصدق من ماله على وجه يؤدي إلى تحريم الورثة\n وعلى الحضَّار أن يفرضوا { لَوْ } ماتوا أو { تَرَكُواْ مِنْ خَلْفِهِمْ ذُرِّيَّةً } أخلافاً { ضِعَافاً } بلا مال ولا متعهد { خَافُواْ عَلَيْهِمْ } البتة ألاَّ يضيعوا\n فيكف لا يخافون على أولئك الضعاف الضياع؟! بل المؤمن لا بد أن يحب لأخيه ما يحب لنفسه بل أولى منه { فَلْيَتَّقُواْ ٱللَّهَ } أولئك الحضَّار أو الأوصياء عن التلقين المخلّ لنصيب الورثة { وَلْيَقُولُواْ } له ويلقنوا عليه { قَوْلاً سَدِيداً } [النساء: 9] معتدلاً بين طرفي الإفراط والتفريط\n رعاية للجانبين\n وحفظاً للغبطتين\n\n\nثم قال سبحانه توبيخاً وتقريعاً على الظالمين المولعين في أكل أموال اليتامى من الحكام والأوصياء والمتغلبة من الورثة: { إِنَّ ٱلَّذِينَ يَأْكُلُونَ أَمْوَالَ ٱلْيَتَٰمَىٰ ظُلْماً } بلا رخصة شرعية { إِنَّمَا يَأْكُلُونَ } ويدخرون { فِي بُطُونِهِمْ نَاراً } معنوياً في النشأة الأولى\n مستتبعاً النار الصوري في النشأة الأخرى",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: ــ هنا ــ شرطية، تخلص للاستقبال، وجوابها: { خافوا } ، وحذف مفعول { يخشى } للعموم، فيصدق بخشية العذاب وخشية العتاب وخشية البعد عن الأحباب، على حساب حال المخاطبين بهذه الخشية. يقول الحقّ جلّ جلاله: للأوصياء الذين في ولايتهم أولاد الناس: { وليخش } الذين يتولون يتامى الناس، فليحفظوا مالهم، وليحسنوا تنميته لهم ولا يضيعوه، وليخافوا عليهم الضيعة، كما يخافون على أولادهم، فإنهم لو ماتوا وتركوا { ذرية ضعافًا خافوا عليهم } ، فكما يخافون على أولادهم بعدهم كذلك يخافون على أولاد الناس، { فليتقوا الله } في شأنهم، وليحفظوا عليهم أموالهم، وليرفقوا بهم ويلاطفوهم في الكلام، كما يُحبون أن يلاطف بأولادهم، { وليقولوا } لهم { قولاً سديدًا } أي: عدلاً صوابًا بالشفقة وحسن الأدب. وقيل: الخطاب لمن حضر المريض عند الإيصاء فيقولون له: قدم لنفسك، أعتق، تصدق، أعط كذا، حتى يستغرق ماله، فنهاهم الحق ــ تعالى ــ عن ذلك، وقال لهم: كما تخافون الضيعة على أولادكم بعدكم خافوا على أولاد الناس، فليتقوا الله في أمر المريض بإعطاء ماله كله، { وليقولوا قولاً سديدًا }: عدلاً، وهو الثلث، وقيل: للمؤمنين كلهم عند موتهم، بأن ينظروا للورثة، فلا يسرفوا في الوصية بمجاوزة الثلث. والله تعالى أعلم. الإشارة: أمر الحق ــ جل جلاله ــ أهل التربية النبوية إذا خافوا على أولادهم الروحانيين أن ينقطعوا بعد موتهم، أن يمدوهم بالمدد الأبهر، ويدلوهم على الغني الأكبر، حتى يتركوهم أغنياء بالله، قد اكتفوا عن كل أحد سواه، مخافة أن يسقطوا بعد موتهم في يد من يلعب بهم، فليتقوا الله في شأنهم، وليدلوهم على ربهم، وهو القول السديد. وينسحب حكمها على أولاد البشرية، فمن خاف على أولاده بعد موته، فليتق الله وليكثر من طاعة الله، وليحسن إلى عباد الله، في أشباحهم وأرواحهم أما أشباحهم فيُطعمهم مما خوله الله، ففي بعض الأثر عنه عليه الصلاة والسلام:\n \" ما أحْسَنَ عَبْدٌ الصَّدَقَةَ في مَاله إلا أحْسَنَ اللهُ الخِلافَةَ عَلَى تَرِكَته \" \nوأما الإحسان إلى أرواحهم، فيدلهم على الله، ويرشدهم إلى طاعة الله، ويعلمهم أحكام دين الله. فمن فعل هذا تولى الله حفظ ذريته من بعده، فيعيشون في حفظ ورعاية وعز ونصر، كما هو مشاهد في أولاد الصالحين، قال تعالى:\n[الأعرَاف:196]، وتذكر قوله تعالى:\n[الكهف:82]. وقال القشيري في هذه الآية: إن الذي ينبغي للمسلم أن يدخر لعياله التقوى والصلاح، لا المال، لأنه لم يقل فليجمعوا لهم المال، وليكثروا لهم العقار والأسباب، وليخلفوا العبيد والأثاث، بل قال: { فليتقوا الله } فإنه يتولى الصالحين. هـ المراد منه.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:70",
      "similarity": 0.7536211854331856
    },
    {
      "verse": "36:9",
      "similarity": 0.6943480735760704
    },
    {
      "verse": "18:93",
      "similarity": 0.598939421577209
    },
    {
      "verse": "18:94",
      "similarity": 0.24948091751348933
    },
    {
      "verse": "4:40",
      "similarity": 0.19936528218373173
    }
  ]
}