{
  "chapter": "النساء",
  "text": "الا الذين يصلون الى قومۭ بينكم وبينهم ميثق او جاءوكم حصرت صدورهم ان يقتلوكم او يقتلوا۟ قومهم ولو شاء الله لسلطهم عليكم فلقتلوكم فان اعتزلوكم فلم يقتلوكم والقوا۟ اليكم السلم فما جعل الله لكم عليهم سبيلا",
  "translations": [
    {
      "translation": "except for those who seek shelter with people with whom you have a treaty, or who come to you greatly perturbed at the prospect of fighting either you or their own people. If Allah had willed, He could have given them the upper hand over you and then they would have fought you. If they keep away from you and do not fight you and submit to you, Allah has not given you any way against such people.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who take refuge with a people allied to you, or those who, weary of fighting you or their people, come over to you. If God had so willed He would surely have given them power over you, and they would have fought you. If they keep aloof and do not fight, and offer peace, God has left you no reason to fight them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "unless it be such of them who seek refuge with a people who are joined with you by a covenant, or those who come to you because their hearts shrink from fighting either against you or against their own people. Had Allah so willed, He would certainly have given them power over you and they would have fought against you. If they leave you alone and do not fight against you and offer you peace,, then Allah does not permit you to harm them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except with those who attach themselves to your allies or come to you with no desire to fight you or their own people. God could have given them power to fight you. Thus, if they retreat, stop fighting and come forward expressing faith in Islam God will not allow you to fight them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who are related to the people between whom and you is a treaty, or who come to you with their hearts no longer having the will to fight you or to fight their own people; had Allah willed, He would certainly have given them power over you so that they would have surely fought you; then if they avoid you and do not wage war against you and make an offer of peace – then Allah has not kept for you a way against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who join a group, between you and whom there is a treaty (of peace), or those who approach you with their breasts restraining from fighting you as well as fighting their own people. Had Allah willed, indeed He would have given them power over you, and they would have fought you. So, if they withdraw from you, and fight not against you, and offer you peace, then Allah has made no way for you against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who reach a people between whom and you there is an alliance, or who come to you, their hearts shrinking from fighting you or fighting their own people; and if Allah had pleased, He would have given them power over you, so that they should have certainly fought you; therefore if they withdraw from you and do not fight you and offer you peace, then Allah has not given you a way against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those that betake themselves to a people who are joined with you by a compact, or come to you with breasts constricted from fighting with you or fighting their people. Had God willed, He would have given them authority over you, and then certainly they would have fought you. If they withdraw from you, and do not fight you, and offer you peace, then God assigns not any way to you against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who seek refuge with a people between whom and you there is a covenant, or (those who) come unto you because their hearts forbid them to make war on you or make war on their own folk. Had Allah willed He could have given them power over you so that assuredly they would have fought you. So, if they hold aloof from you and wage not war against you and offer you peace, Allah alloweth you no way against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But make an exception of those who seek refuge with people with whom you have a treaty, or who come over to you because their hearts forbid them to fight against you or against their own people. Had God pleased, He would have given them power over you, so that they would have taken up arms against you. Therefore, if they keep away from you and cease their hostility and propose peace to you, God does not allow you to harm them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Excepting those who join a people between whom and you there is a bond or who come to you with their breasts straitened that they should fight you or fight their own people. And had Allah so willed, He would have surely set them upon you. If then they withdraw from you, and fight not against you and offer you peace, then Allah openoth not for you against them a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "excepting those who join a people between whom and you there is a treaty, or such as come to you with hearts reluctant to fight you, or to fight their own people. Had Allah wished, He would have imposed them upon you, and then they would have surely fought you. So if they keep out of your way and do not fight you, and offer you peace, then Allah does not allow you any course [of action] against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who join a group between whom and you there is a treaty (of peace), or those who approach you with hearts restraining them from fighting you as well as fighting their own people. If Allah had pleased, He could have given them power over you, and they would have fought you: Therefore if they withdraw from you but fight you not, and (instead) send you (Guarantees of) peace, then Allah Hath opened no way for you (to war against them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who join a group, between you and whom there is a treaty (of peace), or those who approach you with their breasts restraining from fighting you as well as fighting their own people. Had Allah willed, indeed He would have given them power over you, and they would have fought you. So if they withdraw from you, and fight not against you, and offer you peace, then Allah has opened no way for you against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except those who join to a nation in which there is between you and them a treaty, or they come to you with their chests constricted from fighting you or fighting their nation. Had Allah willed, He would have given them power over you, and then they would have certainly fought you. Therefore, if they keep away from you and do not fight you, offering you peace, then Allah does not make any way for you against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who join people with whom you have a treaty, or those who come to you reluctant to fight you or fight their own people. Had God willed, He would have given them power over you, and they would have fought you. If they withdraw from you, and do not fight you, and offer you peace, then God assigns no excuse for you against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for those who take refuge with a people between yourselves and whom is a treaty or those who come to you, their hearts strained at [the prospect of] fighting you or fighting their own people. And if Allah had willed, He could have given them power over you, and they would have fought you. So if they remove themselves from you and do not fight you and offer you peace, then Allah has not made for you a cause [for fighting] against them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:90] Except those who attach themselves to, [who] seek refuge with, a people between whom and you there is a covenant, a pledge of security for them and for whoever attaches himself to them, in the manner of the Prophet’s (s) covenant with Hilāl b. ‘Uwaymir al-Aslamī; or, those who, come to you with their breasts constricted, dejected, about the prospect of fighting you, [being] on the side of their people, or fighting their people, siding with you, in other words, [those who come to you] refraining from fighting either you or them, then do not interfere with them, neither taking them as captives nor slaying them: this statement and what follows was abrogated by the ‘sword’ verse. Had God willed, to give them sway over you, He would have given them sway over you, by strengthening their hearts, so that assuredly they would have fought you: but God did not will it and so He cast terror into their hearts. And so if they stay away from you and do not fight you, and offer you peace, reconciliation, that is, [if] they submit, then God does not allow you any way against them, [He does not allow you] a means to take them captive or to slay them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then made an exception, saying: (Except those) among the ten men who fled to Mecca (who seek refuge with a people) i.e. the people of Hilal Ibn 'Uwaymir al-Aslami (between whom and you there is a covenant) a pact and peace, (or (those who)) the people of Hilal (come unto you because their hearts forbid them to make war) they come to you because they are annoyed at the huge cost they have to pay due to this pact (on you or make war on their own folk) due to their ties of kinship. (Had Allah willed He could have given them power over you) i.e. the people of Hilal Ibn 'Uwaymir (so that assuredly they would have fought you) together with their people upon the conquest of Mecca. (So, if they hold aloof from you and wage not war against you) upon the conquest of Mecca (and offer you peace) they submit to you through peace and honouring the pact they made, (Allah alloweth you no way against them) He does not give you any excuse for killing them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْ جَآءُوكُمْ حَصِرَتْ صُدُورُهُمْ } معناهُ ضَاقَتْ صُدُورُهُمْ\n\n",
      "translations": [
        {
          "translation": " Or have they come to you with {their hearts constrained} meaning their hearts have become tight/constricted.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ } المهاجرين { ٱلَّذِينَ يَصِلُونَ إِلَىٰ قَوْمٍ بَيْنَكُمْ وَبَيْنَهُمْ مِّيثَٰقٌ } عهد وثيق على ألاَّ تستعينوا منهم ولا تعينوا عليهم\n والمواصلون إليهم في حكمهم وعلى عهدهم\n فلا تأخذوهم ولا تقتلوهم حتى لا تنقضوا الميثاق { أَوْ جَآءُوكُمْ } حال كونهم قد { حَصِرَتْ } ضاقت وانقضت { صُدُورُهُمْ } من الرعب\n من المهابة\n وحين كره ولم يؤذن { أَن يُقَٰتِلُوكُمْ أَوْ يُقَٰتِلُواْ قَوْمَهُمْ } لأن المروءة تأبى عن ذلك\n إذ هم ليسوا على عدة القتال\n فعليكم ألاَّ تبادروا إليه\n إذ القتال إنما فرض مع المقاتلين المجترئين { وَلَوْ شَآءَ ٱللَّهُ } قتالكم { لَسَلَّطَهُمْ } لجرأهم { عَلَيْكُمْ } وأزال رعبهم عنكم { فَلَقَٰتَلُوكُمْ } ولم ينصرفوا عنكم { فَإِنِ ٱعْتَزَلُوكُمْ } وانصرفوا عنكم { فَلَمْ يُقَٰتِلُوكُمْ } ولم يتعرضوا لكم { وَ } مع ذلك { أَلْقَوْاْ إِلَيْكُمُ ٱلسَّلَمَ } أي: الاستسلام والانقياد { فَمَا جَعَلَ ٱللَّهُ } الميسر { لَكُمْ } جميع أموركم { عَلَيْهِمْ } أي: على قتلهم وأسرهم { سَبِيلاً } [النساء: 90] بل اصبروا حتى يأذدن الله لكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nفَلاَ تَتَّخِذُواْ مِنْهُمْ أَوْلِيَآءَ حَتَّىٰ يُهَاجِرُواْ فِي سَبِيلِ ٱللَّهِ فَإِنْ تَوَلَّوْاْ فَخُذُوهُمْ وَٱقْتُلُوهُمْ حَيْثُ وَجَدتُّمُوهُمْ وَلاَ تَتَّخِذُواْ مِنْهُمْ وَلِيّاً وَلاَ نَصِيراً إِلاَّ ٱلَّذِينَ يَصِلُونَ إِلَىٰ قَوْمٍ بَيْنَكُمْ وَبَيْنَهُمْ مِّيثَاقٌ أَوْ جَآءُوكُمْ حَصِرَتْ صُدُورُهُمْ أَن يُقَاتِلُونَكُمْ أَوْ يُقَاتِلُواْ قَوْمَهُمْ وَلَوْ شَآءَ ٱللَّهُ لَسَلَّطَهُمْ عَلَيْكُمْ فَلَقَاتَلُوكُمْ فَإِنِ ٱعْتَزَلُوكُمْ فَلَمْ يُقَاتِلُوكُمْ وَأَلْقَوْاْ إِلَيْكُمُ ٱلسَّلَمَ فَمَا جَعَلَ ٱللَّهُ لَكُمْ عَلَيْهِمْ سَبِيلاً }  قلت: { حَصِرت }: أي: ضاقت\n والجملة حال من الواو\n بدليل قراءة يعقوب حَصِرَةً\n يقول الحقّ جلّ جلاله: { فلا تتخذوا } من هؤلاء الكفرة { أولياء } وأصدقاء حتى يتحقق إيمانهم\n بأن يهاجروا من دار الكفرإلى دار الإسلام { في سبيل الله } وابتغاء مرضات الله\n لا لحرف دنيوي\n { فإن تولوا } عن إظهار الإيمان بالهجرة { في سبيل الله } \n { فخذوهم } أسارى { واقتلوهم حيث وجدتموهم } كسائر الكفرة\n وجانبوهم { ولا تتخذوا منهم وليًا ولا نصيرًا } أي: لا تستعينوا بهم في جهادكم\n { إلاَّ الذين يصلون إلى قوم بينكم وبينهم } عهد\n و { ميثاق } أي: مهاندة\n فلهم حكم المُعَاهَدِين الذين وصلوا إليهم\n ودخلوا معهم في الصلح\n فلا تقتلوهم ولا تأسروهم\n\nوكانت خزاعة وادعت النبي صلى الله عليه وسلم وعقدت معه الصلح\n فجاء بنو مدلج فدخلوا معهم في الصلح\n فنهى الله عن قتالهم ما داموا معهم\n فالقوم الذين بين المسلمين وبينهم ميثاق هم خزاعة\n والذي وصلوا إليهم هم بنو مدلج\n فالاستثناء على هذا منقطع\n لأن بني مدلج حينئٍذ كانت مظهرة للكفر لا منافقة\n ويحتمل أن يكون متصلاً\n أي: إلا الذين يصلون منهم\n\n\nالخ\n فتأمل\n وكان هذا في أول الإسلام\n ثم نُسِخ بقوله:\n[التّوبَة:5] الآية\n ثم ذكر قومًا آخرين نهى عن قتالهم\n فقال: { أو جاءوكم } أي: إلاَّ قومًا جاؤوكم\n قد { حصرت صدورهم } أي: ضاقت عن { أن يُقاتلوكم أو يُقاتلوا قومهم } يعني أنهم كرهوا قتالهم\n وكرهوا قتال قومهم الكفار\n فلا تقتلوهم أيضًا\n لأن الله كفَّ شرهم عنكم\n { ولو شاء الله لسلّطهم عليكم } بأن قوَّى قلوبهم وأزال رعبهم { فَلَقَاتَلُكم } ولم يكفّوا عنكم\n { فإن اعتزلوكم } ولم يتعرّضوا لكم { وألقوا إليكم السلم } أي: الاستسلام والانقياد { فما جعل الله لكم عليهم سبيلاً } أي: طريقًا إلى قتالهم\n الإشارة: نهى الله تعالى عن مساكنة النفوس وموالاتها\n حتى تهاجر عن مواطن شهواتها إلى حضرة ربها\n فإن تولت عن الهجرة وألِفَت البطالةَ والغفلة فليأخذها ليقتلها حيثما ظهرت صورتها\n ولا يسكن إليها أبدًا أو يواليها\n إلاَّ إن وصلت إلى حضرة الشيخ\n وأمره بالرفق بها\n أو كفت عن طغيانها\n أو كفى الله أمرها بجذبٍ أخرجها عن عوائدها\n أو واردٍ قوَّى دفع شهواتها\n فإنه يأتي من حضرة قهار\n لا يصادم شيئاً إلا دمغه\n وهذه عناية من الرحمن\n ولو شاء تعالى لسلطها على الإنسان يرخى لها العنان\n فتجمح به في ضَحضَاح النيران\n فإن كفت النفس عن شهواتها\n وانقادت إلى حضرة ربها\n فما لأحدٍ عليها من سبيل\n وقد دخلت في حمى الملك الجليل\n والله تعالى أعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:8",
      "similarity": 0.4540542812425042
    },
    {
      "verse": "3:39",
      "similarity": 0.3512922949095057
    },
    {
      "verse": "44:21",
      "similarity": 0.3370713453544828
    },
    {
      "verse": "26:212",
      "similarity": 0.3239325097433948
    },
    {
      "verse": "28:51",
      "similarity": 0.31980021231672195
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004090.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004090.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:90.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}