{
  "chapter": "النساء",
  "text": "وما كان لمؤمن ان يقتل مؤمنا الا خطـا ومن قتل مؤمنا خطـا فتحرير رقبة مؤمنة ودية مسلمة الى اهله الا ان يصدقوا۟ فان كان من قوم عدو لكم وهو مؤمن فتحرير رقبة مؤمنة وان كان من قومۭ بينكم وبينهم ميثق فدية مسلمة الى اهله وتحرير رقبة مؤمنة فمن لم يجد فصيام شهرين متتابعين توبة من الله وكان الله عليما حكيما",
  "translations": [
    {
      "translation": "A mumin should never kill another mumin unless it is by mistake. Anyone who kills a mumin by mistake should free a mumin slave and pay blood-money to his family unless they forgo it as a sadaqa. If he is from a people who are your enemies and is a mumin, you should free a mumin slave. If he is from a people you have a treaty with, blood money should be paid to his family and you should free a mumin slave. Anyone who cannot find the means should fast two consecutive months. This is a concession from Allah. Allah is All- Knowing, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a believer to take a believer's life except by mistake; and he who kills a believer by mistake should free a slave who is a believer, and pay blood-money to the victim's family unless they forego it as an act of charity. If he belonged to a community hostile to you but was himself a believer, then a slave who is a believer should be freed. In case he belonged to a people with whom you have a treaty, then give blood-money to his family and free a believing slave. But he who has no means (to do so) should fast for a period of two months continuously to have his sins forgiven by God, and God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a believer to slay another believer unless by mistake. And he who has slain a believer by mistake, his atonement is to set free from bondage a believing person and to pay blood-money to his heirs, unless they forgo it by way of charity. And if the slain belonged to a hostile people, but was a believer, then the atonement is to set free from bondage a believing person. And if the slain belonged to a (non-Muslim) people with whom you have a covenant, then the atonement is to pay the blood-money to his heirs, and to set free from bondage a believing person. But he who cannot (free a slave) should fast for two consecutive months. This is the penance ordained by Allah. Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A believer cannot slay another believer except by mistake for which the retaliation is to set free a believing slave and pay the appointed blood money to the relatives of the deceased unless the relatives wave aside the payment. If the person slain is from your enemies but himself is a believer, the penalty is to set free a believing slave. If the person slain is one of those with whom you have a peace treaty, the penalty is the same as that for a slain believer. If this is not possible, the defendant has to fast for two consecutive months, asking God to accept his repentance. He is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not rightful for a Muslim to kill another Muslim, unless it occurs by mistake; and the one who mistakenly kills a Muslim must set free a Muslim slave and pay blood-money to the family of the slain, except if they forego it; and if the victim is of a people who are hostile to you, and the killer is a Muslim, then only the setting free of a Muslim slave (is obligatory); and if the victim is from a people between whom and you there is a treaty, then blood-money must be paid to his family and the setting free of a Muslim slave; therefore one who has no means must fast for two consecutive months; this is his penance before Allah; and Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a believer to kill a believer except by mistake; and whosoever kills a believer by mistake, he must set free a believing slave and submit compensation (blood money) to the deceased's family unless they remit it. If the deceased belonged to a people at war with you and he was a believer, the freeing of a believing slave (is prescribed); and if he belonged to a people with whom you have a treaty of mutual alliance, then compensation (blood money) must be paid to his family, and a believing slave must be freed. And whoso finds this beyond his means, he must fast for two consecutive months in order to seek repentance from Allah. And Allah is Ever All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it does not behoove a believer to kill a believer except by mistake, and whoever kills a believer by mistake, he should free a believing slave, and blood-money should be paid to his people unless they remit it as alms; but if he be from a tribe hostile to you and he is a believer, the freeing of a believing slave (suffices), and if he is from a tribe between whom and you there is a convenant, the blood-money should be paid to his people along with the freeing of a believing slave; but he who cannot find (a slave) should fast for two months successively: a penance from Allah, and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It belongs not to a believer to slay a believer, except it be by error. If any slays a believer by error, then let him set free a believing slave, and bloodwit is to be paid to his family unless they forgo it as a freewill offering. If he belong to a people at enmity with you and is a believer, let the slayer set free a believing slave. If he belong to a people joined with you by a compact, then bloodwit is to be paid to his family and the slayer shall set free a believing slave. But if he finds not the means, let him fast two successive months -- God's turning; God is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a believer to kill a believer unless (it be) by mistake. He who hath killed a believer by mistake must set free a believing slave, and pay the blood-money to the family of the slain, unless they remit it as a charity. If he (the victim) be of a people hostile unto you, and he is a believer, then (the penance is) to set free a believing slave. And if he cometh of a folk between whom and you there is a covenant, then the blood-money must be paid unto his folk and (also) a believing slave must be set free. And whoso hath not the wherewithal must fast two consecutive months. A penance from Allah. Allah is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No believer should kill another believer, unless it be by mistake. Anyone who kills a believer by mistake should free a believing slave and pay blood money to the victim's relatives unless they forego it as an act of charity. If the victim belongs to a people at war with you, but is a believer, then the compensation is to free a believing slave. If he belongs to a people with whom you have a treaty, then blood-money should be handed over to his relatives and a believing slave set free. Anyone who lacks the means must fast for two consecutive months. Such is the penance imposed by God. God is all knowing and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a believer to slay a believer except by a mischance; and whosoever slayeth a believer by mischance on him is the setting free of a believing bondman and blood-wit to be delivered to his family except that they forego. Then if he be of a people hostile unto you and is himself a believer, then the setting free of a believing bondman; and if he be of a people between man whom and you is a bond, then the bloodwit to be delivered to his family and the setting free of a believing bondman. Then whosoever findeth not the wherewithal, on him is the fasting for two months in succession: a penance from Allah. And Allah is ever Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A believer may not kill another believer, unless it is by mistake. Anyone who kills a believer by mistake should set free a believing slave, and pay blood-money to his family, unless they remit it in charity. If he belongs to a people that are hostile to you but is a believer, then a believing slave is to be set free. And if he belongs to a people with whom you have a treaty, the blood-money is to be paid to his family and a believing slave is to be set free. He who cannot afford [to pay the blood-money], must fast two successive months as a penance from Allah, and Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never should a believer kill a believer; but (If it so happens) by mistake, (Compensation is due): If one (so) kills a believer, it is ordained that he should free a believing slave, and pay compensation to the deceased's family, unless they remit it freely. If the deceased belonged to a people at war with you, and he was a believer, the freeing of a believing slave (Is enough). If he belonged to a people with whom ye have treaty of Mutual alliance, compensation should be paid to his family, and a believing slave be freed. For those who find this beyond their means, (is prescribed) a fast for two months running: by way of repentance to Allah: for Allah hath all knowledge and all wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a believer to kill a believer except (that it be) by mistake, and whosoever kills a believer by mistake, (it is ordained that) he must set free a believing slave and a compensation (blood money, i.e. Diya) be given to the deceased's family, unless they remit it. If the deceased belonged to a people at war with you and he was a believer; the freeing of a believing slave (is prescribed), and if he belonged to a people with whom you have a treaty of mutual alliance, compensation (blood money - Diya) must be paid to his family, and a believing slave must be freed. And whoso finds this (the penance of freeing a slave) beyond his means, he must fast for two consecutive months in order to seek repentance from Allah. And Allah is Ever All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is not for a believer to kill another believer, except that it is by error. Whosoever kills a believer in error, let him free a believing slave, and ransom is to be handed to his family, unless they forgo being charitable. If he belonged to a people who are your enemies and is a believer then, the setting free of a believing slave. If he belonged to a people in which there is between you and them a treaty, then a ransom is to be handed to his family and the setting free of a believing slave. But, if he does not find (the means) let him fast two consecutive months in repentance to Allah. And Allah is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never should a believer kill another believer, unless by error. Anyone who kills a believer by error must set free a believing slave, and pay compensation to the victim’s family, unless they remit it as charity. If the victim belonged to a people who are hostile to you, but is a believer, then the compensation is to free a believing slave. If he belonged to a people with whom you have a treaty, then compensation should be handed over to his family, and a believing slave set free. Anyone who lacks the means must fast for two consecutive months, by way of repentance to God. God is All-Knowing, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never is it for a believer to kill a believer except by mistake. And whoever kills a believer by mistake - then the freeing of a believing slave and a compensation payment presented to the deceased's family [is required] unless they give [up their right as] charity. But if the deceased was from a people at war with you and he was a believer - then [only] the freeing of a believing slave; and if he was from a people with whom you have a treaty - then a compensation payment presented to his family and the freeing of a believing slave. And whoever does not find [one or cannot afford to buy one] - then [instead], a fast for two months consecutively, [seeking] acceptance of repentance from Allah. And Allah is ever Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:92] It is not for a believer to slay a believer, in other words, no such slaying should result at his hands, except by mistake, killing him by mistake, unintentionally. He who slays a believer by mistake, when he meant to strike some other thing, as in the case of hunting or [shooting at] trees, but then happens to strike him with what in most cases would not kill, then let him set free, let him emancipate, a believing slave (raqaba denotes nasama, ‘a person’), an obligation on him, and blood-money is to be submitted, to be paid, to his family, that is, the slain person’s inheritors, unless they remit it as a charity, to him by waiving [their claim to] it. In the Sunna this [blood-money] is explained as being equivalent to one hundred camels: twenty pregnant, twenty female sucklings, twenty male sucklings, twenty mature ones and twenty young ones [not more than five years old]; and [the Sunna stipulates] that it is incumbent upon the killer’s clan, namely, his paternal relations [and not other relatives]. They share this [burden of the blood-money] over three years; the rich among them pays half a dinar, while the one of moderate means [pays] a quarter of a dinar each year; if they still cannot meet this, then it can be taken from the treasury, and if this is not possible, then from the killer himself. If he, the slain, belongs to a people at enmity, at war, with you and is a believer, then the setting free of a believing slave, is incumbent upon the slayer, as a redemption, but no bloodmoney is to be paid to his family, since they are at war [with you]. If he, the slain, belongs to a people between whom and you there is a covenant, a treaty, as is the case with the Protected People (ahl al-dhimma), then the blood-money, for him, must be paid to his family, and it constitutes a third of the blood-money for a believer, if the slain be a Jew or a Christian, and two thirds of a tenth of it, if he be a Magian; and the setting free of a believing slave, is incumbent upon the slayer. But if he has not the wherewithal, for [setting free] a slave, failing to find one, or the means to obtain one, then the fasting of two successive months, is incumbent upon him as a redemption: here God does not mention the transition to [an alternative to fasting which is] giving food [to the needy], as in the case of [repudiating one’s wife by] zihār, something which alShāfi‘ī advocates in the more correct of two opinions of his; a relenting from God (tawbatan, ‘relenting’, is the verbal noun, and is in the accusative because of the implied verb). And God is ever Knowing, of His creation, Wise, in what He has ordained for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It is not for a believer) it is not allowed for a believer, meaning here 'Ayyash Ibn Abi Rabi'ah (to kill a believer) Harith Ibn Zayd ((unless (it be) by mistake) even if it be by mistake. (He who hath killed a believer by mistake must set free a believing slave) a slave who believes in Allah and His Messenger, (and pay the blood money) in full (to the family of the slain) to the next of kin of the victim who have the right to demand retaliation, (unless they remit it as a charity) unless the next of kin of the victim remit the blood money to the killer as a charity. (If he) the victim (be of a people hostile unto you) who are at war with you, (and he) i.e. the victim (is a believer, then (the penance is) to set free a believing slave) the killer should set free a slave who believes in Allah and His Messenger and so does not have to pay the blood money. Harith belonged to a people who were at war with the Messenger of Allah (pbuh). (And if he) the victim (cometh of a folk between whom and you there is a covenant) a treaty and peace, (then the blood money must be paid) in full (unto his folk) to the next of kin of the victim (and (also) a believing slave must be set free) a slave who believes in the divine Oneness of Allah. (And whoso hath not the wherewithal) to set free a believing slave (must fast two consecutive months) continuously. (A penance from Allah) if he does this, Allah will forgive him for killing a believer by mistake. (Allah is Knower) of him who kills by mistake, (Wise) in that which he ought to do.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ليكون كفارة مسقطة لحق الله { وَ } لزم عليه أيضاً { دِيَةٌ } كاملة { مُّسَلَّمَةٌ إِلَىٰ أَهْلِهِ } ورثته الذين يرثون منه حفظاً لحقوقهم\n وجبراً لما انكسر من قلوبهم { إِلاَّ أَن يَصَّدَّقُواْ } أي: يسقطوا حقوقهم متصدقين { فَإِن كَانَ } المقتول { مِن } عداد { قَوْمٍ عَدُوٍّ لَّكُمْ } عداوة بينة { وَهُوَ } أي: المقتول { مُؤْمِنٌ فَتَحْرِيرُ رَقَبَةٍ مُّؤْمِنَةٍ } أي: فالواجب على القاتل تحرير رقبة مؤمنة فقط\n إذ لا مواساة مع أهله\n ولا وراثة لهم منه { وَإِن كَانَ } المؤمن المقتول { مِن قَوْمٍ } ذوي ذمة { بَيْنَكُمْ وَبَيْنَهُمْ مِّيثَاقٌ } عهد وثيق { فَدِيَةٌ } أي: فاللازم حينئذ دية كاملة { مُّسَلَّمَةٌ إِلَىۤ أَهْلِهِ } حفظاً للميثاق ومواساة معهم رجاء أن يؤمنوا\n إذ سر المواثيق والعهود الواقعة بين أهل الإيمان والكفر إنما هو المواسة والمداراة معهم ملاطفة\n رجاء أن يرغبوا بالإيما طوعاً { وَتَحْرِيرُ رَقَبَةٍ مُّؤْمِنَةٍ } لإسقاط حق الله وجبر ما انكسر من حدوده { فَمَن لَّمْ يَجِدْ } رقبة مملوكة ولا ما يتوصل به إلأيها { فَصِيَامُ شَهْرَيْنِ مُتَتَابِعَيْنِ } فعليه أن يصوم شهرين كاملين على التوالي بلا فصل كسراً لما جرأه على هذا الخطأ\n وليكون { تَوْبَةً } مقبولة عند الله مكفرة لخطئه ناشئة { مِّنَ } خوف { ٱللَّهِ } وخشيته لاجترائه على تخريب بيته { وَكَانَ ٱللَّهُ } المطلع بصمائر عباده { عَلِيماً } بحاله وقت إنابته ورجوعه { حَكِيماً } [النساء: 92] فيما أمره وحكم عليه لإزالة ما عليه وما صدر عنه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { وما كان لمؤمن } النفي هذا بمعنى النهي، كقوله:\n[الأحزَاب:53]، و { إلا خطًأ }: استثناء منقطع، و { خطأ }: حال، أو مفعول من أجله، أو صفة لمصدر محذوف، أي: لا يحل له أن يقتل مؤمنًا في حال من الأحوال، لكن إن وقع خطّأ فحكمه ما يأتي، وقيل: متصل. انظر ابن جزي: أو: إلا قتلا خطّأ، و { إلا أن يصدقوا }: حال، أي: إلا حال تصدقهم، و { توبة }: مفعول من أجله، أي: شرع ذلك لأجل التوبة. أو، مصدر، أي: تاب عليكم توبة. يقول الحقّ جلّ جلاله: { وما كان } ينبغي { لمؤمن أن يقتل مؤمنًا } مثله، أي: هو حرام عليه، { إلاَّ } أن يقتله { خطًأ } بأن ظنه كافرًا، أو رمى غيرَه فصادفه. والآية نزلت بسب قتل عياش بن ربيعة للحارث بن زيد، وكان الحارث يعذبه على الإسلام، ثم أسلم الحارث، وهاجر، ولم يعلم عياشُ بإسلامه، فقتله. ثم ذكر حُكمه فقال: { ومن قتل مؤمنًا خطًأ فتحرير رقبة } أي: فعليه تحرير رقبة { مؤمنة } سالمة من العيوب، ليس فيها شوب حرية، تكون من مال القاتل، { ودِيَةٌ مُسلَّمة } أي: مدفوعة { إلى أهله } وهي على العاقلة كما بيَّن الرسول ـ عليه الصلاة والسلام ـ، وهي عند مالك: مائة من الإبل، وألف دينار شرعية على أهل الذهب، وأثنا عشر ألف درهم، على أهل الوَرِق، مقسطة على ثلاث سنين، فإن لم تكن العاقلة فعلى بيت المال، وتقسم على أهله، على حسب المواريث، إلا أن يتصدقوا بالدية على القاتل فتسقط، أي: تسمع فيها الورثة أو القتيل قبل موته. { فإن كان } المقتول { من قوم عدو لكم } أي: محاربين لكم، { وهو } أي: المقتول { مؤمن } فعلى القاتل { تحرير رقبة مؤمنة } ولا دية لأنهم محاربون فيتقووا بها على المسلمين، ورأى مالك أن الدية في هذا واجبة لبيت المال، { وإن كان } المقتول مؤمنًا وهو { من قوم بينكم وبينهم ميثاق } أي: عقد الصلح أو الذمة، فعلى القاتل { دية مُسَلَّمة إلى أهله } ، وعليه أيضًا { تحرير رقبة مؤمنة } كفارة لخطئه. فإن كان غير مؤمن فلا كفارة فيه. وفيه نصف دية المسلم، { فمن لم يجد } الرقبة، أو لم يقدر عليها فعليه { صيام شهرين متتابعين } عوضًا من العتق، جعل الله ذلك { توبة من الله } على القاتل لتفريطه. { وكان الله عليمًا } بما فرض، { حكيمًا } فيما قدَّر ودبَّر. والله تعالى أعلم. الإشارة: اعلم أن الحقّ ـ جلّ جلاله ـ قد رغَّب في إحياء النفوس، حسًا ومعنًى، ونهى عن قتلها حسًا ومعنًى، وما ذلك إلى لخصوص محبة له فيها، ومزيد اعتناء له بشأنها فليس في الوجود أعز من الله من مظهر هذا الآدمي إن استقام في العبودية لربه، فهو قلب الوجود، ومن أجله ظهر كل موجود، وهو المنظور إليه من هذا العالم السفلي، والمقصود بالخطاب التكليفي: جزئي وكلي، فهو المقصود من بيت القصيد، وهو المحبوب إليه، دون سائر العبيد، قال تعالى:\n\n[طه:41]. ومعنى إحيائها حسًّا: إنقاذها من الهلاك الحسّي، ومعنى إحيائها معنّى: إنقاذها من الهلاك المعنوي كالجهل والغفلة، حتى تحيا بالعلم والإيمان واليقظة، ومعنى قتلها حسًا: إهلاكها، ومعنى قتلها معنًى: إيقاعها في المعاصي والكفر وحملها على ذلك، وكذلك إهانتها وذلها، ولذلك قال ـ عليه الصلاة والسلام ـ:\n \" لَعنُ المُؤمن كَقَتَلهِ \" \nفأمر من قتله خطًأ أن يُحيي نفسًا أخرى من مقابلتها بإخراجها من موت إهانة الرق، فإن لم يقدر، فليحيي نفسه بقتل صولتها بالجوع حتى تنكسر، فتحيا بالتوبة واليقظة، ويُجبر كسر أهل المقتول بالدية المُسَلَّمة.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "58:4",
      "similarity": 0.34641912061775804
    },
    {
      "verse": "58:3",
      "similarity": 0.33939876092202526
    },
    {
      "verse": "5:89",
      "similarity": 0.29560031243326956
    },
    {
      "verse": "2:183",
      "similarity": 0.27129184198457007
    },
    {
      "verse": "76:12",
      "similarity": 0.26976062998444195
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/4:92.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/4:92.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/4:92.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}