{
  "chapter": "النساء",
  "text": "ومن يقتل مؤمنا متعمدا فجزاؤه جهنم خلدا فيها وغضب الله عليه ولعنه واعد له عذابا عظيما",
  "translations": [
    {
      "translation": "As for anyone who kills a mumin deliberately, his repayment is Hell, remaining in it for ever. Allah is angry with him and has cursed him, and has prepared for him a terrible punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Any one who kills a believer intentionally will be cast into Hell to abide there for ever, and suffer God's anger and damnation. For him a greater punishment awaits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he who slays a believer wilfully his reward is Hell, where he will abide. Allah's wrath is against him and He has cast His curse upon him, and has prepared for him a great chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The punishment for one who purposely slays a believer will be to live in hell fire forever. God is angry with him and has condemned him. He has prepared for him a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever slays a Muslim on purpose, his reward will be hell – to remain in it for ages – and Allah has wreaked wrath upon him and has cursed him and kept prepared a terrible punishment for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever kills a believer intentionally, his recompense is Hell to abide therein; and the wrath and the curse of Allah are upon him, and a great punishment is prepared for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever kills a believer intentionally, his punishment is hell; he shall abide in it, and Allah will send His wrath on him and curse him and prepare for him a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoso slays a believer wilfully, his recompense is Gehenna, therein dwelling forever, and God will be wroth with him and will curse him, and prepare for him a mighty chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso slayeth a believer of set purpose, his reward is hell for ever. Allah is wroth against him and He hath cursed him and prepared for him an awful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If anyone kills a believer deliberately, his reward shall be eternal Hell. God will condemn him and reject him, and prepare for him a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whosoever slayeth a believer intentionally, His meed is Hell, as an abider therein; and Allah shall be wroth with him and shall curse him, and shall get ready for him a torment terrible.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should anyone kill a believer intentionally, his requital shall be hell, to remain in it [forever]; Allah shall be wrathful at him and curse him and He shall prepare for him a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a man kills a believer intentionally, his recompense is Hell, to abide therein (For ever): And the wrath and the curse of Allah are upon him, and a dreadful penalty is prepared for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever kills a believer intentionally, his recompense is Hell to abide therein, and the Wrath and the Curse of Allah are upon him, and a great punishment is prepared for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The recompense for he who kills a believer deliberately is Gehenna (Hell), he is eternal there. Allah will be angry with him and will curse him and prepare for him a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever kills a believer deliberately, the penalty for him is Hell, where he will remain forever. And God will be angry with him, and will curse him, and will prepare for him a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whoever kills a believer intentionally - his recompense is Hell, wherein he will abide eternally, and Allah has become angry with him and has cursed him and has prepared for him a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:93] And whoever slays a believer deliberately, intending to kill him, with something that is lethal, aware of the fact that he [the slain] is a believer, his requital is Hell, abiding therein, and God is wroth with him and has cursed him, He has removed him from His mercy, and has prepared for him a mighty chastisement, in the Fire: this may be explained as [referring to] the person that deems such [killing] licit, or as being his requital if he were to be requited, but it would not be anything new if this threat [of punishment] were to be forgone, because of what He says: Other than that [that is, idolatry] He forgives whomever He will [Q. 4:48]. It is reported from Ibn ‘Abbās that it [the verse] should be understood as it stands, abrogating other verses of ‘forgiveness’. The verse in [sūrat] al-Baqara [Q. 2:178] clearly indicates that the one who kills deliberately should be killed in return, or if he is pardoned then he has to pay the blood-money, the value of which has already been mentioned. It is made clear in the Sunna that between the intentional and the unintentional, there is a type of killing that is identified as [being with] quasi-deliberate intent (shibh al‘amd), where the killer has slain with what in most cases is not [a] lethal [implement]. In such a case, there is no [right to] retaliation and blood-money is paid instead, so that it [this type of killing] is described as intentional, but [considered] unintentional in [that there applies] the fixing of the period [for payment] and the sharing of the burden [by the killer’s clan]; in this [case] and that of intentional killing redemption is more urgent than in unintentional killing.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah revealed about Miqyas Ibn Sababah, the killer of al-Fihri, the emissary of Allah's Messenger (pbuh) who, after taking the blood money for the killing of his brother Hisham Ibn Sababah, left Islam and fled to Mecca, saying: (Whoso slayeth a believer of set purpose, his reward is hell) for this wilful killing (for ever) due to his idolatry. (Allah is wroth against him) for taking the blood money (and He hath cursed him) because he killed a person who did not kill his brother (and prepared for him an awful doom) because of his boldness towards Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَن يَقْتُلْ مُؤْمِناً مُّتَعَمِّداً } مباشراً على قتله إرادة واختياراً\n والعمد على الوجه من إمارات الاستحلال { فَجَزَآؤُهُ } أي: جزاء المستحل ووبال وزره لا يسقط عنه لا بالتحرير ولا بالدية\n ولا بالصوم والصدقة\n بل جزاؤه { جَهَنَّمُ } البعد عن جوار الله يصير { خَٰلِداً فِيهَا } مؤبداً إلى ما شاء الله { وَ } مع خلوده في نار الخذلان والحرمان { غَضِبَ ٱللَّهُ عَلَيْهِ } أي: أخذه وأخزاه بأنواع الخزي والمذلة { وَلَعَنَهُ } طرده عن حضوره\n وأسقطه عن مرتبة خلافته { وَأَعَدَّ لَهُ } أي: هيأ له { عَذَاباً عَظِيماً } [النساء: 93] بحيث لا يصغو معه\n ولا ينظر إليه أبداً\n\n\nنعوذ بك من غضبك وسخطك يا أرحم الراحمين\n\n\nومن عظم أمر القتل عند الله\n وإزالة الحياة التي حصل من نفخ الروح الذي أضافه لنفسه\n أمر سبحانه على المؤمنين الذين يقصدون بالقتال والجهاد رضاء الله وإعلاء دينه ترويج توحيده بالتبيين والتفتيش فيه على وجه المبالغة\n حتى لا يؤدي إلى تخريب بنائه وإبطال صنيعه\n فقال منادياً: { يَٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم { إِذَا ضَرَبْتُمْ } سافرتم للجهاد { فِي سَبِيلِ ٱللَّهِ } لإعلاء كلمة توحيده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { ومن يقتل مؤمنًا متعمدًا } مستحلاً لقتله { فجزاؤه جهنم خالدًا فيها وغَضِبَ الله عليه ولعنه } أي: طرده { وأعد له عذابًا عظيمًا } ، وقولُنا: مستحلاً لقتله، هو أحد الأجوبة عن شبهة المعتزلة القائلين بتخليد عصاة المؤمنين في النار. ومن جُملتهم: قاتل النفس. ومذهب أهل السنة: أنه لا يخلد إلا الكافر، ويؤيد هذا الجواب سبب نزول الآية، لأنها نزلت في كافر، وهو  مَقِيس بن ضُبَابة الكناني وَجَدَ أخَاه هشامًا قَتَيلاً في بني النجر ـ وكان مُسلمًا ـ فذكر ذلك النبي صلى الله عليه وسلم فأرسَل مَعهُ رجلاً من بني فهرِ، وقال له:\n \" ائت بني النّجار، وقُل لهم: إن عَلمتُم قاتِل هِشَامٍ فادفَعُوهُ لمقيس يَقتَصُّ مِنه، وإن لِمَ تَعلمُوا فادفَعُوا إليه الدَّيةَ \" \nفقالوا: سمعًا وطاعة، لم نَعلَم قاتِله، فجمعوا مائة من الإبل، فأخذها، ثم انصرفا راجعَين إلى المدينة، فوسوس إليه الشيطان، وقال: أيَّ شيء صَنَعتَ؟ تَقبلُ ديةَ أخيكَ فتكونُ عليك سُبَّة، اقتل الرجلَ الذِي مَعكَ فتكُونَ نفسٌ مكانَ نَفسٍ وفَضلُ الدِّيَة، فَقَتَلَه وأخذ الدِّية، فنزلت فيه الآية. أو يكون الخلود عبارة عن طول المكث، والجمهور على قبول توبته، خلافًا لابن عباس، ونُقِل عنه أيضًا قبولها، ولعله تعالى استغنى عن ذكر التوبة هنا اكتفاء بذكرها في الفرقان، حيث قال:\n[الفُرقان:68]، ثم قال:\n[مريَم:60]. وأما من قال: إن تلك منسوخة بهذه فليس بصحيح لأن النسخ لا يكون في الأخبار. أو فجزاؤه إن جُوزِي، ولا بِدع في خلف الوعيد لقوله:\n[النَّساء:48] لأن الوعيد مشروط بعدم العفو، لدلائل منفصلة اقتضت ذلك كما هو مشروط بعدم التوبة أيضًا، والحاصل: أن الوعد لا يخلف لأنه من باب الامتنان، والوعيد يصح إخلافه، بالعفو والغفران، كما في بعض الأخبار عن رسول الله صلى الله عليه وسلم قال:\n \" مَن وَعَدَه الله ـ عز وجل ـ على عملٍ ثوابًا فهو منجزه له لا محالة، ومَن أوعَدَه على عمل عقابًا فهو بالخيار، إن شاءَ عَفَا عنه، وإن شاء عَاقَبه \" \nهـ. ذكره في القوت. فَتَحَصَّل أن القاتل لا يُخلَّد على المشهور إلاَّ إذا كان مستحلاً، وهذا أيضًا ما لم يقتص منه، وأما إذا اقتُص منه فالصحيح أنه يسقط عنه العقاب لقول النبي صلى الله عليه وسلم:\n \" مَن أصَابَ ذَنبًا فعُوقِبَ بِه في الدنيا فَهُوَ له كَفَّارَةٌ \" \nوبه قال الجمهور، وكذلك إذا سَامَحَهُ ورثةُ الدم: لأنه حق ورثوه. والله تعالى أعلم. الإشارة: الإيمان محلة القلوب، فالقلب هو المتصف بالإيمان حقيقة. فالمؤمن الحقيقي هو القلب، فمن قتله بتتبع الشهوات، وتراكم الغفلات، فجزاؤه نار القطيعة في سجن الأكوان، والبعد عن عرفان الشهود والعيان، وفي الحِكَم: \" سبب العذاب وجود الحجاب، وإتمام النعيم بالنظر إلى وجهة الكريم \". والله تعالى أعلم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "104:9",
      "similarity": 0.6057474467580886
    },
    {
      "verse": "48:6",
      "similarity": 0.4476820136351994
    },
    {
      "verse": "33:5",
      "similarity": 0.4428509121966103
    },
    {
      "verse": "13:2",
      "similarity": 0.37155363400195945
    },
    {
      "verse": "9:68",
      "similarity": 0.29176700355248036
    }
  ]
}