{
  "chapter": "النساء",
  "text": "يايها الذين ءامنوا۟ اذا ضربتم فى سبيل الله فتبينوا۟ ولا تقولوا۟ لمن القى اليكم السلم لست مؤمنا تبتغون عرض الحيوة الدنيا فعند الله مغانم كثيرة كذلك كنتم من قبل فمن الله عليكم فتبينوا۟ ان الله كان بما تعملون خبيرا",
  "translations": [
    {
      "translation": "You who have iman! when you go out to fight in the Way of Allah verify things carefully. Do not say, 'You are not a mumin', to someone who greets you as a Muslim, simply out of desire for the goods of this world. With Allah there is booty in abundance. That is the way you were before but Allah has been kind to you. So verify things carefully. Allah is aware of what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, when you go out on a journey in the way of God, be discreet and do not say to anyone who greets you in peace: \"You are not a believer.\" You desire the gain of earthly life, but there are prizes in plenty with God. You were also like him (an unbeliever) in the past, but God has been gracious to you. So be careful and discreet, for God is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! When you go forth in the way of Allah, discern (between friend and foe), and do not say to him who offers you the greeting of peace: 'You are not a believer.' If you seek the good of this worldly life, there lies with Allah abundant gain. After all, you too were such before, and then Allah was gracious to you. Discern, then, for Allah is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you march with arms for the cause of God, make sure that you know whom to fight. Do not accuse anyone who claims himself to be a Muslim of disbelief just for worldly gains. There is abundant bounty with God. Before, you were also like them, but God bestowed His favors upon you. Thus, make sure that you know whom to fight. God is Well Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! When you go forth to fight in holy war, make a proper study, and do not say to the one who greets you, “You are not a Muslim,” – you seek the means of this worldly life; so with Allah are the bounties in plenty; you too were like this before, then Allah bestowed His favour on you, therefore you must make a proper study; indeed Allah knows whatever you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you go (to fight) in the cause of Allah, verify (the truth), and say not to anyone who greets you: \"You are not a believer;\" seeking the perishable goods of the worldly life. There is much more benefit with Allah. Even as he is now, so were you yourselves before, till Allah conferred on you His Favors, therefore, be cautious in discrimination. Allah is Ever Well-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! when you go to war in Allah's way, make investigation, and do not say to any one who offers you peace: You are not a believer. Do you seek goods of this world's life! But with Allah there are abundant gains; you too were such before, then Allah conferred a benefit on you; therefore make investigation; surely Allah is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, when you are journeying in the path of God, be discriminating, and do not say to him who offers you a greeting, 'Thou art not a believer,' seeking the chance goods of the present life. With God are spoils abundant. So you were aforetime; but God has been gracious to you. So be discriminating; surely God is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! When ye go forth (to fight) in the way of Allah, be careful to discriminate, and say not unto one who offereth you peace: \"Thou art not a believer,\" seeking the chance profits of this life (so that ye may despoil him). With Allah are plenteous spoils. Even thus (as he now is) were ye before; but Allah hath since then been gracious unto you. Therefore take care to discriminate. Allah is ever Informed of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when you go forth in the cause of God, make due investigation and do not say to those who offer you the greeting of peace, \"You are no believer!\" because you seek the good things of this life. With God there are good things in plenty. You yourself were in the same position before, but God conferred His special favour on you. Therefore, take care to investigate. Surely God is well-aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! when ye march forth in the way of Allah, make things clear and say not unto one who giveth you a salutation: thou art none of a believer, seeking the perishable goods of the life of the world; for with Allah are spoils abundant. Even Thus were ye aforetime, then Allah favoured you. So make things clear; verily Allah is of that which ye work ever Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! When you issue forth in the way of Allah, try to ascertain: do not say to someone who offers you peace, ‘You are not a believer,’ seeking the transitory wares of the life of this world. Yet with Allah are plenteous gains. You too were such earlier, but Allah did you a favour. Therefore, do ascertain. Allah is indeed well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! When ye go abroad in the cause of Allah, investigate carefully, and say not to any one who offers you a salutation: \"Thou art none of a believer!\" Coveting the perishable goods of this life: with Allah are profits and spoils abundant. Even thus were ye yourselves before, till Allah conferred on you His favours: Therefore carefully investigate. For Allah is well aware of all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you go (to fight) in the Cause of Allah, verify (the truth), and say not to anyone who greets you (by embracing Islam): \"You are not a believer\"; seeking the perishable goods of the worldly life. There are much more profits and booties with Allah. Even as he is now, so were you yourselves before till Allah conferred on you His Favours (i.e. guided you to Islam), therefore, be cautious in discrimination. Allah is Ever Well-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you are journeying in the way of Allah, do not say to those who offer you peace, until it has been clarified: 'You are not believers' seeking the enjoyment of the worldly life, with Allah there are many spoils. You were like that before, and Allah has been gracious to you. Therefore let it be clarified. Surely, Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you journey in the way of God, investigate, and do not say to him who offers you peace, “You are not a believer,” aspiring for the goods of this world. With God are abundant riches. You yourselves were like this before, and God bestowed favor on you; so investigate. God is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, when you go forth [to fight] in the cause of Allah, investigate; and do not say to one who gives you [a greeting of] peace \"You are not a believer,\" aspiring for the goods of worldly life; for with Allah are many acquisitions. You [yourselves] were like that before; then Allah conferred His favor upon you, so investigate. Indeed Allah is ever, with what you do, Acquainted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:94] The following was revealed when a group from among the Companions passed by a man from the Banū Sulaym driving his flock of sheep, and he offered them a greeting of peace. But they said, ‘He only greeted us dissimulating, out of fear’. So they killed him and took away his flock: O you who believe, when you are going forth, travelling in order to struggle, in the way of God, be discriminating (fa-tabayyanū; a variant reading has fa-tathabbatū, ‘ascertain’, here and further below); and do not say to him who offers you peace (read al-salām or al-salam), that is, the greeting, or [offers you] submission, declaring the profession of faith (shahāda), which is an indication of being a Muslim: ‘You are not a believer: you are only saying this to dissimulate for fear of your life and property’, so that you then end up killing him, desiring, seeking by this, the transient goods of the life of this world, that is, its enjoyment, in the way of spoils. With God are plenteous spoils, rendering you free of the need to kill such a person for his property. So you were formerly, when your lives and property were protected simply upon your professing the faith; but God has been gracious to you, making you known for your faith and uprightness. So be discriminating, lest you kill a believer and treat those entering the religion as you were treated [formerly]. Surely God is ever Aware of what you do, and will requite you for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah revealed about Usamah Ibn Zayd who killed Mirdas Ibn Nuhayk al-Farari, a fellow believer, saying: (0 ye who believe! When ye go forth (to fight) in the way of Allah) in jihad, (be careful to discriminate) between who is a believer and who is an unbeliever, (and say not unto one who offereth you peace) he who greets you and says to you \"there is no god but Allah, Muhammad is the Messenger of Allah\": (\"Thou art not a believer\";) and then kill him (seeking the chance profits of this life) so that you may despoil him. (With Allah are plenteous spoils) He has with Him a tremendous reward for him who avoids killing a fellow believer. (Even thus (as he now is) were ye before) with your people feeling safe with the believers and with Muhammad (pbuh) and his Companions because of the attestation of \"there is no god but Allah and Muhammad is the Messenger of Allah\", before the Emigration; (but Allah hath since then been gracious unto you) by migrating from the unbelievers. (Therefore take care to discriminate) such that you do not kill believers. (Allah is ever informed of what ye do) whether it is killing someone or other things.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَلْقَىۤ إِلَيْكُمُ ٱلسَّلاَمَ } معناهُ المَقادَةُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Peace be upon you,\" means greeting you.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن عظم أمر القتل عند الله، وإزالة الحياة التي حصل من نفخ الروح الذي أضافه لنفسه، أمر سبحانه على المؤمنين الذين يقصدون بالقتال والجهاد رضاء الله وإعلاء دينه ترويج توحيده بالتبيين والتفتيش فيه على وجه المبالغة؛ حتى لا يؤدي إلى تخريب بنائه وإبطال صنيعه، فقال منادياً: { يَٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم { إِذَا ضَرَبْتُمْ } سافرتم للجهاد { فِي سَبِيلِ ٱللَّهِ } لإعلاء كلمة توحيده، وانتصار دين نبيه { فَتَبَيَّنُواْ } فاطلبوا بيان الأمر والحال من كل من استقبل عليكم، ولا تبادروا إلى قتل بلا تفتيش حالة { وَ } خصوصاً { لاَ تَقُولُواْ لِمَنْ أَلْقَىۤ إِلَيْكُمُ ٱلسَّلاَمَ } الإطاعة والانقياد { لَسْتَ مُؤْمِناً } بل كافراً مداهناً خائفاً تبادر علينا بالإطاعة حفظاً لدمك ومالك حال كونكم { تَبْتَغُونَ } تطلبون بهذا القول { عَرَضَ ٱلْحَيَٰوةِ ٱلدُّنْيَا } أي: متاعها التي هي حطام زائلة، وأثاث باطلة { فَعِنْدَ ٱللَّهِ } لكم إن امتثلتم لأمره ورضيتم { مَغَانِمُ كَثِيرَةٌ } مما تتلذذ به نفوسكم يغنيكم عن حطام الدنيا ومزخرفاتها، بادروا إليها، ولا تميلوا إلى لذاتها الفانية\n\n\n\n\n{ كَذٰلِكَ } أي: مثل ما ألقى إليكم السلم { كُنْتُمْ مِّن قَبْلُ } أي: قبل رسوخكم على الإيمان واطمئنانكم على شعائر الإسلام تفوهتم بكلمتي الشهادة، وأظهرتم الإيمان والإطاعة لحفظ دمائكم وأموالكم { فَمَنَّ ٱللَّهُ عَلَيْكُمْ } بالتمكن والاطمئنان والعزيمة الصحيحة والاستقامة في شعائر الإسلام، { فَتَبَيَّنُواْ } أيضاً عن حالهم، واقبلوا منهم قالوا كما قبل الله منكم من قبل؛ رجاء أن ينكشفوا بما انكشفتم { إِنَّ ٱللَّهَ } المطلع بسرائركم وضمائركم { كَانَ } في سباق علمه { بِمَا تَعْمَلُونَ } من الأغراض المؤدية إلى الحطام الدنيوية { خَبِيراً } [النساء: 94] علمياً لا يعزب عن علمه وخبرته شيء\n\n\n\n\nروي أن سرية من أصحاب رسول الله غزت أهل فدك، فهربوا وبقي لها مرداس اعتماداً على إسلامه، فلما رأى الخيل ألجأ عنمه إلى شعب الجبل وصعد عليه، فلما تلاحقوا كبَّروا وكبَّر أيضاً، ونزل وقال: لا إله إلى الله محمد رسول الله السلام عليكم يا أصحاب رسول الله، مرحباً بكم وبقدومكم فقتله أسامة، واستاق غنمه، فنزلت\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { السَّلم } بالقصر: الانقياد والاستسلام، وبالمد: التحية\n وجملة { تبتغون }: حال من الواو، مشعرة بما هو الحامل على العجلة\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا إذا ضربتم } أي: سافرتم وسرتم تجاهدون { في سبيل الله } ، { فتبينوا } الأمور وتثبتوا فيها ولا تعجلوا، فإن العجلة من الشيطان، { ولا تقولوا لمن ألقى إليكم السلم } أي: الانقياد والاستسلام، أو سلَّم عليكم تحية الإسلام، { لست مؤمنًا } إنما فعلت ذلك متعوذًا خائفًا، فتقتلونه طمعًا في ماله، { تبتغون عرض الحياة الدنيا } وحطامها الفاني، { فعند الله مغانمُ كثيرة } وَعَدَكُم بها، لم تقدروا الآن عليه، فاصبروا وازهدوا فيما تَشُكُّون فيه حتى يأتيكم ما لا شهبةَ فيه، { كذلك كنتم من قبل } هذه الحال، كنتم تخفون إسلامكم خوفًا من قومكم، { فمنَّ الله عليكم } بالعز والنصر والاشتهار { فتبينوا } وتثبتوا ولا تعَجلَوا، وافعلوا بالداخلين في الإسلام كما فعل اللهُ بكم، حيث حفظكم وعصمكم، ولا تبادروا إلى قتلهم ظنًا بأنهم إنما دخلوا فيه اتقاء وخوفًا، فإن إبقاء ألف كافر أهون عند الله من قتل مؤمن، وتكريره تأكيد لتعظيم الأمر\n ثم هدَّدهم بقوله { إن الله كان بما تعملون خبيرًا } مطلعًا على قصدكم، فلا تتهافتوا في القتل، واحتاطوا فيه\n رُوِي أن سريةً لرسول الله صلى الله عليه وسلم غزت أهل فَدَك فهربوا، وبقي مرداسُ ثقًة بإسلامه، لأنه كان مسلمًا وحده، فلما رأى الخيلَ ألجأ غَنَمه إلى عاقول من الجبل، وصعد عليه، فلما تلاحقوا وكَبَّروا، كَبَّر ونزل يقول: لا إله إلا الله محمد رسول الله، السلام عليكم، فقتله أسامةُ، واستاق غنمه، فنزلت الآية\n فلما أُخبر ـ عليه الصلاة والسلام ـ وَجِدَ وجدًا شديدًا، وقال لأسامة:\n\n \" كيف بلا إله إلا الله، إذا جاءت يوم القيامة؟! \" \n\nقالها ثلاثًا، حتى قال أسامة: ليتني لم أكن أسلمتُ إلا يومئٍذ، ثم استغفرَ له بعدُ، وقال له:\n\n \" اعتق رقبة \" \n\nوقيل: نزلت في المقداد، مرَّ برجل في غنمه فأراد قتله، فقال: لا إله إلا الله، فقتله وظفر بأهله وماله، وقيل: القاتل: مُحلِّم بن جَثَامة، والمقتول: عامرُ بن الأضبط\n والله تعالى أعلم\n الإشارة: يستقاد من الآية: الترغيب في خَصلتين ممدوحتين وخصوصًا عند الصوفية: الأولى: التأني في الأمور والرزانة والطمأنينة، وعدم العجلة والخفة والطيش\n وفي الحديث:\n\n \" من تَأنَّى أصابَ أو كادَ، ومَن استعجَّلَ أخطَأ أو كَادَ \" \n\nولا يُقدم على أمر حتى يعلم حكم الله فيه، ويفهم عن الله أنه مراد الله في ذلك الوقت\n والثانية: حُسْن الظن بعباد الله كافة، واعتقاد الخير فيهم، وعدم البحث عما اشتمل عليه بواطنهم، فقد قال عليه الصلاة والسلام:\n\n \" أُمِرتُ أن أحكم بالظواهر والله يتولى السرائر \" \n\nوقال لأسامة:\n\n \" هلاّ شققت عن قلبه \" \n\n، حين قَتَلَ من قال: لا إله إلا الله، أو لغيره\n وفي الحديث:\n\n \" خصلتان ليس فوقهما شيء من الخير: حُسن الظن بالله، وحُسن الظنِّ بعباد الله، وخصلتان ليس فوقهما من الشر شيء: سوء الظن بالله، وسوء الظن بعباد الله \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "48:19",
      "similarity": 0.5362409592703195
    },
    {
      "verse": "8:69",
      "similarity": 0.4666610587590554
    },
    {
      "verse": "48:20",
      "similarity": 0.43483190086472834
    },
    {
      "verse": "8:41",
      "similarity": 0.3757897607088217
    },
    {
      "verse": "6:53",
      "similarity": 0.3096081713041374
    }
  ]
}