{
  "chapter": "النساء",
  "text": "لا يستوى القعدون من المؤمنين غير او۟لى الضرر والمجهدون فى سبيل الله بامولهم وانفسهم فضل الله المجهدين بامولهم وانفسهم على القعدين درجة وكلا وعد الله الحسنى وفضل الله المجهدين على القعدين اجرا عظيما",
  "translations": [
    {
      "translation": "Those muminun who stay behind - other than those forced to by necessity - are not the same as those who do jihad in the Way of Allah, sacrificing their wealth and themselves. Allah has given those who do jihad with their wealth and themselves a higher rank than those who stay behind. Allah has promised the Best to both, but Allah has preferred those who do jihad over those who stay behind by an immense reward:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithful who sit idle, other than those who are disabled, are not equal to those who fight in the way of God with their wealth and lives. God has exalted those in rank who fight for the faith with their wealth and souls over those who sit idle. Though God's promise of good is for all, He has granted His favour of the highest reward to those who struggle in preference to those who sit at home.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those believers who sit at home, unless they do so out of a disabling injury, are not the equals of those who strive in the way of Allah with their possessions and their lives. Allah has exalted in rank those who strive with their possessions and their lives over those who sit at home; and though to each Allah has promised some good reward, He has preferred those who strive (in the way of Allah) over those who sit at home for a mighty reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the believers, those who stay at home without a good reason are not equal to those who strive for the cause of God in person or with their property. To those who strive for His cause in person or with their property, God has granted a higher rank than to those who stay at home. God has promised that everyone will receive his proper share of the reward but He will grant a much greater reward to those striving for His cause than to those who stay home (for no reason).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Muslims who stay back from holy war without proper excuse, are not equal to the Muslims who fight in Allah's cause with their wealth and lives; Allah has bestowed higher ranks to the warriors who strive with their wealth and lives, than those who stay back; and Allah has promised good to all; and Allah has favoured the warriors upon those who stay back, with a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not equal are those of the believers who sit (at home), except those who are disabled, and those who strive hard and fight in the cause of Allah with their wealth and their lives. Allah has preferred in grades those who strive hard and fight with their wealth and their lives above those who sit (at home). Unto each, Allah has promised good (Paradise), but Allah has preferred those who strive hard and fight, above those who sit (at home), by a huge reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The holders back from among the believers, not having any injury, and those who strive hard in Allah's way with their property and their persons are not equal; Allah has made the strivers with their property and their persons to excel the holders back a (high) degree, and to each (class) Allah has promised good; and Allah shall grant to the strivers above the holders back a mighty reward:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such believers as sit at home -- unless they have an injury -- are not the equals of those who struggle in the path of God with their possessions and their selves. God has preferred in rank those who struggle with their possessions and their selves over the ones who sit at home; yet to each God has promised the reward most fair; and God has preferred those who struggle over the ones who sit at home for the bounty of a mighty wage,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of the believers who sit still, other than those who have a (disabling) hurt, are not on an equality with those who strive in the way of Allah with their wealth and lives. Allah hath conferred on those who strive with their wealth and lives a rank above the sedentary. Unto each Allah hath promised good, but He hath bestowed on those who strive a great reward above the sedentary;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those believers who stay behind, apart from those forced by necessity, are not equal to those who strive hard in God's cause with their possessions and their persons. God has given those who strive with their goods and their persons a higher rank than those who stayed behind. God has promised all a good reward; but far greater is the recompense of those who strive for Him --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not equal are the holders back among the believers, save those who are disabled, and the strivers in the way of Allah with their- riches and their lives. Allah hath preferred in rank the strivers with their riches and their lives above the holders-back, and unto all Allah hath promised good. And Allah hath preferred the strivers above the holdersback with a mighty hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not equal are those of the faithful who sit back—excepting those who suffer from some disability—and those who wage jihad in the way of Allah with their possession and their persons. Allah has graced those who wage jihad with their possessions and their persons by a degree over those who sit back; yet to each Allah has promised the best reward, and Allah has graced those who wage jihad over those who sit back with a great reward:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not equal are those believers who sit (at home) and receive no hurt, and those who strive and fight in the cause of Allah with their goods and their persons. Allah hath granted a grade higher to those who strive and fight with their goods and persons than to those who sit (at home). Unto all (in Faith) Hath Allah promised good: But those who strive and fight Hath He distinguished above those who sit (at home) by a special reward,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not equal are those of the believers who sit (at home), except those who are disabled (by injury or are blind or lame, etc.), and those who strive hard and fight in the Cause of Allah with their wealth and their lives. Allah has preferred in grades those who strive hard and fight with their wealth and their lives above those who sit (at home). Unto each, Allah has promised good (Paradise), but Allah has preferred those who strive hard and fight, above those who sit (at home) by a huge reward;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers who stay behind, having no injury, are not equal to those who fight in the way of Allah with their wealth and their souls. Allah has preferred those who fight with their wealth and their souls a degree above those who stay behind (because of sickness). Yet to each, Allah has promised the most excellent (Paradise). And Allah has preferred those who fought over those who stayed behind with a great wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not equal are the inactive among the believers—except the disabled—and the strivers in the cause of God with their possessions and their persons. God prefers the strivers with their possessions and their persons above the inactive, by a degree. But God has promised goodness to both. Yet God favors the strivers, over the inactive, with a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not equal are those believers remaining [at home] - other than the disabled - and the mujahideen, [who strive and fight] in the cause of Allah with their wealth and their lives. Allah has preferred the mujahideen through their wealth and their lives over those who remain [behind], by degrees. And to both Allah has promised the best [reward]. But Allah has preferred the mujahideen over those who remain [behind] with a great reward -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:95] The believers who sit at home, away from the struggle, other than those who have an injury, such as a chronic illness or blindness or the like (read in the nominative, ghayru ūlī l-darar, ‘other than those who have an injury’, as an adjectival clause; or in the accusative, ghayra ūlī l-darar, as an exceptive clause) are not the equals of those who struggle in the way of God with their possessions and their lives. God has preferred those who struggle with their possessions and their lives over the ones who sit at home, on account of some injury, by a degree, by [a degree of] merit, since both have the same intention, but the extra degree is given to those who have carried out the struggle; yet to each, of the two groups, God has promised the goodly reward, Paradise, and God has preferred those who struggle over the ones who sit at home, without any injury, with a great reward (ajran ‘azīman, is substituted by [the following, darajātin minhu]),\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then explained the reward of those who fight in the way of Allah, saying: (Those of the believers who sit still) although they do not suffer from any disabling hurt, and do not participate in jihad, (other than those who have a (disabling) hurt) if they were to participate in jihad, i.e. either they are weak in their bodies or have lost their sight, as with 'Abdullah Ibn Umm Maktum and 'Abdullah Ibn Jahsh al-Asdi, (are not on an equality with those who strive in the way of Allah with their wealth) by spending their money (and lives. Allah hath conferred on those who strive with their wealth and lives a rank) a merit (above the sedentary) who do not have any disabling hurt. (Unto each) those who engage in jihad and those who do not (Allah hath promised good) Paradise due to their faith, (but He hath bestowed on those who strive) those who engage in jihad in his way (a great reward) an abundant reward in Paradise (above the sedentary) who do not have any disabling hurt;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { لاَّ يَسْتَوِي ٱلْقَٰعِدُونَ } عن الحرب { مِنَ ٱلْمُؤْمِنِينَ } حال كونكم { غَيْرُ أُوْلِي ٱلضَّرَرِ } من الدم والمرض الذمامة وغيرها { وَٱلْمُجَٰهِدُونَ فِي سَبِيلِ ٱللَّهِ بِأَمْوَٰلِهِمْ وَأَنْفُسِهِمْ } ابتغاء لوجه الله وطلباً لمرضاته { فَضَّلَ ٱللَّهُ ٱلْمُجَٰهِدِينَ بِأَمْوَٰلِهِمْ وَأَنْفُسِهِمْ عَلَى ٱلْقَٰعِدِينَ دَرَجَةً } عظيمة وفاء لحق ما اجتهدوا في سبيه { وَ } إن كان { كُـلاًّ } منهم ممن { وَعَدَ ٱللَّهُ } لهم المثوبة { ٱلْحُسْنَىٰ } والمراتب العظمى والدرجة العليا { وَفَضَّلَ ٱللَّهُ ٱلْمُجَٰهِدِينَ } زيادة { عَلَى ٱلْقَٰعِدِينَ أَجْراً عَظِيماً } [النساء: 95] هو الفوز بمرتبة الشهادة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { من المؤمنين }: حال من { القاعدين } \n و { غير } بالرفع: صفة للقاعدين\n وبالنصب: حال\n وبالجر: بدل من المؤمنين\n و { درجة }: نصب على إسقاط الخافض\n أو على المصدر\n لأنه متضمن معنى التفضيل\n أو على الحال\n أي: ذوي درجة\n و { أجرًا عظيمًا }: مصدر لفضَّل\n لأنه بمعنى أجرًا\n أو مفعول ثان لفضَّل\n لأنه بمعنى أعطى\n أي: أعطاهم زيادة على القاعدين أجرًا عظيمًا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:20",
      "similarity": 0.5283298964709655
    },
    {
      "verse": "57:10",
      "similarity": 0.43194243175716307
    },
    {
      "verse": "17:21",
      "similarity": 0.3711574803527373
    },
    {
      "verse": "61:11",
      "similarity": 0.36230249222116856
    },
    {
      "verse": "46:19",
      "similarity": 0.3531221917412653
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004095.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004095.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:95.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}