{
  "chapter": "النساء",
  "text": "درجت منه ومغفرة ورحمة وكان الله غفورا رحيما",
  "translations": [
    {
      "translation": "high ranks conferred by Him as well as forgiveness and mercy. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them are higher ranks with God, and forgiveness and grace; and God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them are ranks, forgiveness, and favours from Him. Allah is All-Forgiving, All-Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will grant those who strive high ranks, forgiveness, and mercy. He is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ranks (of honour) from Him, and forgiveness, and mercy; and Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Degrees of (higher) grades from Him, and forgiveness and mercy. And Allah is Ever Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(High) degrees from Him and protection and mercy, and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in ranks standing before Him, forgiveness and mercy; surely God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Degrees of rank from Him, and forgiveness and mercy. Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "high ranks conferred by Him as well as forgiveness and mercy. God is forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ranks from Him and forgiveness and mercy; and Allah is ever Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "ranks from Him, forgiveness, and mercy, and Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ranks specially bestowed by Him, and Forgiveness and Mercy. For Allah is Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Degrees of (higher) grades from Him, and Forgiveness and Mercy. And Allah is Ever Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ranks from Him, forgiveness and mercy. Allah is the Forgiver, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Degrees from Him, and forgiveness, and mercy. God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Degrees [of high position] from Him and forgiveness and mercy. And Allah is ever Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:96] degrees, that is, stations one higher than the other in honour, from Him, and forgiveness and mercy (maghfiratan and rahmatan are in the accusative because [they constitute an object] of the implied verb [faddala, ‘He has preferred’]). Surely God is ever Forgiving, to His friends, Merciful, to those that obey Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "98 (Degrees of rank from Him) merits from Allah in bestowing different ranks, (and forgiveness) of sins (and mercy) that saves one from torment. (Allah is ever Forgiving) of those who repent of staying back and who goes out on jihad, (Merciful) towards him who dies in a state of repentance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوفضل الله لهم في تلك المرتبة { دَرَجَاتٍ مِّنْهُ } بعضها قريب، وبعضها أقرب إلى ما يشاء الله { وَمَغْفِرَةً } لذنوبهم بالمرة كيوم الولادة { وَرَحْمَةً } خاصة لهم بأن يكونوا عند ربهم يرزقون، فرحين بما آتاهم الله من فضله { وَكَانَ ٱللَّهُ } المراقب لأحوال عباده { غَفُوراً } لذنوبهم { رَّحِيماً } [النساء: 96] لهم يرحمهم حسب فضله وطوله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}