{
  "chapter": "النساء",
  "text": "ان الذين توفىهم الملئكة ظالمى انفسهم قالوا۟ فيم كنتم قالوا۟ كنا مستضعفين فى الارض قالوا۟ الم تكن ارض الله وسعة فتهاجروا۟ فيها فاو۟لئك ماوىهم جهنم وساءت مصيرا",
  "translations": [
    {
      "translation": "The angels ask those they take while they are wronging themselves, 'What were your circumstances?' They reply, 'We were oppressed on earth.' They say, 'Was Allah's earth not wide enough for you to have",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those whose souls are taken by the angels (at death) while in a state of unbelief, they will be asked by the angels: \"What (state) were you in?\" They will answer: \"We were oppressed in the land.\" And the angels will say: \"Was not God's earth large enough for you to migrate?\" Their abode will be Hell, and what an evil destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "While taking the souls of those who were engaged in wronging themselves, the angels asked: 'In what circumstances were you?' They replied: 'We were too weak and helpless in the land.' The angels said: 'Was not the earth of Allah wide enough for you to emigrate in it?' For such men their refuge is Hell - an evil destination indeed;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the angels take away from their bodies the souls of those who have wronged themselves, they will ask them, \"How did you live?\" They will reply, \"We lived on earth in weakness and oppression.\" The angels will say, \"Was not God's land vast enough for you to go wherever you could live in peace?\" The dwelling of these people will be hell fire, a terrible destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels ask the people whose souls they remove while they were wronging themselves, “What were you engaged in?” They reply, “We were powerless in the land”; the angels say, “Was Allah’s earth not spacious enough for you to have migrated in it?” The destination for such is hell; and a very wretched place to return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, as for those whom the angels take (in death) while they are wronging themselves, they (angels) say (to them): \"In what (condition) were you\" They reply: \"We were weak and oppressed on the earth.\" They (angels) say: \"Was not the earth of Allah spacious enough for you to emigrate therein\" Such men will find their abode in Hell - what an evil destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely (as for) those whom the angels cause to die while they are unjust to their souls, they shall say: In what state were you? They shall say: We were weak in the earth. They shall say: Was not Allah's earth spacious, so that you should have migrated therein? So these it is whose abode is hell, and it is an evil resort\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those the angels take, while still they are wronging themselves -- the angels will say, 'In what circumstances were you?' They will say, 'We were abased in the earth.' The angels will say, 'But was not God's earth wide, so that you might have emigrated in it?' Such men, their refuge shall be Gehenna -- an evil homecoming! --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! as for those whom the angels take (in death) while they wrong themselves, (the angels) will ask: In what were ye engaged? They will say: We were oppressed in the land. (The angels) will say: Was not Allah's earth spacious that ye could have migrated therein? As for such, their habitation will be hell, an evil journey's end;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the angels take the souls of those who have wronged themselves, they will ask, \"What was wrong with you?\" They will answer, \"We were too weak on earth.\" The angels will say, \"Was God's earth not spacious enough for you to have migrated to some other place?\" These are the ones whose abode shall be Hell, an evil destination --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily unto those whom the angels carry off in death, while they are yet oppressors of their souls, they will say: what were ye in? They will say: Weakened were we in the land. They Will say: was not Allah's land wide so that ye could migrate thereto. These: their resort is hell an evil retreat! -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those whom the angels take away while they are wronging themselves, they ask, ‘What state were you in?’ They reply, ‘We were oppressed in the land.’ They say, ‘Was not Allah’s earth vast enough so that you might migrate in it?’ The refuge of such shall be hell, and it is an evil destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When angels take the souls of those who die in sin against their souls, they say: \"In what (plight) Were ye?\" They reply: \"Weak and oppressed Were we in the earth.\" They say: \"Was not the earth of Allah spacious enough for you to move yourselves away (From evil)?\" Such men will find their abode in Hell,- What an evil refuge! -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! As for those whom the angels take (in death) while they are wronging themselves (as they stayed among the disbelievers even though emigration was obligatory for them), they (angels) say (to them): \"In what (condition) were you?\" They reply: \"We were weak and oppressed on earth.\" They (angels) say: \"Was not the earth of Allah spacious enough for you to emigrate therein?\" Such men will find their abode in Hell - What an evil destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the angels who take those who wronged themselves will say: 'In what condition were you' They will reply 'We were oppressed in the land' They (the angels) will say: 'Was not the earth of Allah wide enough for you in order that you migrate in it' Those, their shelter will be Gehenna (Hell), an evil arrival.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "While the angels are removing the souls of those who have wronged themselves, they will say, “What was the matter with you?” They will say, “We were oppressed in the land.” They will say, “Was God’s earth not vast enough for you to emigrate in it?” These—their refuge is Hell. What a wretched retreat!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those whom the angels take [in death] while wronging themselves - [the angels] will say, \"In what [condition] were you?\" They will say, \"We were oppressed in the land.\" The angels will say, \"Was not the earth of Allah spacious [enough] for you to emigrate therein?\" For those, their refuge is Hell - and evil it is as a destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:97] The following was revealed regarding a group of people who submitted to Islam but did not emigrate and were then slain in the battle of Badr alongside the disbelievers: And those whom the angels take [in death], while they are wronging their souls, having remained among the disbelievers and neglected to emigrate, the angels will say, to them in rebuke: ‘What was your predicament?’, in other words, ‘in what circumstances were you with regard to your religion’. They will say, giving excuses, ‘We were oppressed, unable to establish religion, in the land’, the land of Mecca. The angels will say, to them in rebuke: ‘But was not God’s earth spacious that you might have emigrated therein?’, from the land of unbelief to another land, as others did? God, exalted be He, says: as for such, their abode shall be Hell — an evil journey’s end, it is!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then, Allah revealed the following about the 50 people who had left Islam and were all killed during the Battle of Badr, saying: (Lo! as for those whom the angels take (in death)) at the Battle of Badr (while they wrong themselves) by being idolaters, ((the angels) will ask) upon taking their souls: (In what were you engaged) what were you doing in Mecca? (They will say: We were oppressed) and humiliated (in the land) in Mecca at the hands of the unbelievers. ((The angels) will say: Was not Allah's earth) Medina (spacious) safe (that ye could have migrated therein? As for such) group of people, (their habitation) their dwelling (will be hell, an evil journey's end) they will come to;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إن الذين توفاهم الملائكة } إلى آخره، التوفي هو: استيفاء الروح من البدن بقبضها عنه، وهو على ثلاثة أوجه: توفي الملائكة، وتوفي ملك الموت، وتوفي الله\n أما توفي الملائكة فهو لأصحاب النفوس وهم إما سعداء أهل الخير والصفات الحميدة والأخلاق الحسنة من الصالحين المتّقين\n\n[النحل، الآية: 32] فمعادهم إلى جنة الأفعال\n وإما أشقياء أهل الشرّ والصفات الرديئة والأخلاق السيئة فلا يقبض أرواحهم إلا القوى الملكوتية التي هي للعالم بمثابة قواهم التي هم في مقامها، محتجبون بصفات النفس ولذّات القوى الخيالية والوهمية والسبعية والبهيمية من الكافرين:\n\n[النحل، الآية: 28] فمعادهم إلى النار\n وأما توفي ملك الموت فهو لأرباب القلوب الذين برزوا عن حجاب النفس إلى مقام القلب، ورجعوا إلى الفطرة، فتنوّروا بنورها، فتقْبض أرواحهم النفس الناطقة الكلية التي هي قلب العالم باتصالهم بها، هذا إذا قبض أرواحهم ملك الموت بنفسه، أما إذا قبض بأعوانه وقواهم فهم الفريق الأول\n وقد يقبض بنفسه ويذرهم في ملكوت العذاب حتى يحاسبوا ويعاقبوا بحسب رذائلهم ويتخلصوا، وذلك للكمال العلميّ والنقصان العلميّ كما خلص من الجهل والشرك وتحلّى بالعلم والتوحيد، ولكن تراكمت على قلبه الهيئات المظلمة والملكات الرديئة بسبب الأعمال السيئة والأخلاق الذميمة\n وللعلم بالتوحيد والجهل بالمعاد كالموحد المنكر للجزاء، فينهمك في المعاصي كما قال تعالى:\n\n[السجدة، الآية: 11]\n وأما توفي الله تعالى، فهو للموحدين الذين عرجوا عن مقام القلب إلى محل الشهود فلم يبق بينهم وبين ربّهم حجاب، فهو يتولى قبض أرواحهم بنفسه ويحشرهم إلى نفسه\n\n[مريم، الآية: 85]، كما قال تعالى:\n\n[الزمر: 42]\n  { ظالِمي أنْفسهم } بمنعها عن حقوقها التي اقتضتها استعداداتهم من الكمالات المودعة فيها { فِيمَ كُنْتم } حيث قصرتم في السعي لما قدرتم وفرّطتم في جنب الله، وقصرتم عن بلوغ كمالكم الذي هيئ لكم وندبتم إليه { قالوا كنا مُسْتَضْعَفِين } في أرض الاستعداد الذي جبلنا عليه باستيلاء قوى النفس الأمّارة وغلبة سلطان الهوى بشيطان الوهم، أسرونا في قيودهم، وجبرونا على دينهم، وأكرهونا على كفرهم\n { قالوا ألم تكن أرض الله واسعة } ألم تكن سعة استعدادكم بحيث تهاجروا فيها من مبدأ فطرتكم خطوات يسيرة، بحيث إذا ارتفعت عنكم بعض الحجب انطلقتم عن أسر القوى وتخلصتم عن قيود الهوى، وتقوّيتم بإمداد أعوانكم القوى الروحانية، ونصرتم بأنوار القلب، فخرجتم عن القرية، الظالم أهلها، التي هي مدينة النفس إلى بلد القلب الطيبة، فتداركتكم رحمة ربكم الغفور { فأولئِكَ مأوَاهُم جهنم } نفوسهم الشديدة التوقان مع حصول الحرمان { وساءت مصِيراً إلا المُسْتضعفين من الرجَال } أي: أقوياء الاستعداد الذين قويت قواهم الشهوية والغضبية مع قوّة استعدادهم فلم يقدروا على قمعها في سلوك طريق الحق ولم يذهبوا لقواهم الوهمية والخيالية، فيبطلوا استعداداتهم بالعقائد الفاسدة فبقوا في أسر قواهم البدنية مع تنوّر استعدادهم بنور العلم وعجزهم عن السلوك برفع القيود { والنساء } أي: القاصرين الاستعداد عن درك الكمال العلمي، وسلوك طريق التحقيق، الضعفاء القوى والأحلام، الذين قال في حقهم: \" أكثر أهل الجنة البله \"\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { إِنَّ ٱلَّذِينَ تَوَفَّاهُمُ ٱلْمَلاۤئِكَةُ } وهم الذين بقوا في مكة\n ولم يهاجروا مع رسول الله ولا بعده\n فاستزلهم العدو\n وأخرجوهم إلى قتال رسول الله يوم بدر\n فقتلهم الملائكة حين إمدادهم لرسول الله صلى الله عليه وسلم { ظَالِمِيۤ أَنْفُسِهِمْ } بتوطينها بين العدو مع القدرة على الهجرة\n مع أنه حينئذ لا يقبل منهم الإيمان بلا هجرة\n ثم نسخ بعد الفتح لذلك قال عليه السلام:\n \" لا هجرة بعد الفتح \" \n{ قَالُواْ } أي: الملائكة لهم حين أظهروا الإيمان بمحمد صلى الله عليه وسلم { فِيمَ كُنتُمْ } في أي أمر وشأن من دينكم مع كونكم بين أعداء الله ورسوله؟ { قَالُواْ } في جوابهم معتذرين: { كُنَّا مُسْتَضْعَفِينَ } محبوسين { فِي ٱلأَرْضِ } أرض العدو حين استزلونا وأخرجونا إلى قتال رسول الله { قَالْوۤاْ } أي: الملائكة موبخين لهم مقرعين تبكيتاً والزاماً: { أَلَمْ تَكُنْ أَرْضُ ٱللَّهِ وَاسِعَةً فَتُهَاجِرُواْ فِيهَا } مع كونكم غير ملجئين على القعود { فَأُوْلَـٰئِكَ } البعداء المداهنون مع الأعداء المظاهرين لهم { مَأْوَاهُمْ } ومثواهم { جَهَنَّمُ } البعد عن جوار الله وسعة رحمته { وَسَآءَتْ } جهنم { مَصِيراً } [النساء: 97] مآباً ومتقلباً لهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { إن الذين } تتوفاهم { الملائكة } أي: مَلَك الموت وأعوانه، يعني: تَقبِضُ أرواحهم، { ظالمي أنفسهم } بترك الهجرة ومرافقة الكفرة، { قالوا } أي: الملائكة في توبيخهم: { فِيمَ كنتم } أي: في أي شيء كنتم من أمر دينكم: أعلى الشك أو اليقين؟ أو: في أي بلد كنتم: في دار الكفر أو الإسلام؟ { قالوا كنا مستضعفين في الأرض } فعجزنا عن الهجرة وإظهار الدين خوفًا من المشركين، { قالوا } أي: الملائكة تكذيبًا لهم وتبكيتًا: { ألم تكن أرض الله واسعة فتهاجروا فيها } إلى قطر آخر، كما فعل المهاجرين إلى الحبشة والمدينة، لكن حبستكم أموالُكم، وعزَّت عليكم أنفسكم، { فأولئك مأواهم جهنم } لتركهم الهجرة الواجبة في ذلك الوقت، ومساعدتهم الكفار على غزو المسلمين، { وساءت مصيرًا } أي: قبحت مصيرًا جهنم التي يصيرون إليها\n نزلت في ناس من أهل مكة تكلموا بالإسلام ولم يُهاجروا، فخرجوا يوم بدر مع المشركين فرأوا قلةَ المسلمين، فقالوا: غرَّ هؤلاء دينُهم، فقُتِلوا، فضربت الملائكة وجوهم وأدبارهم، كما يأتي، فلا تجوز الإقامة تحت حكم الكفر مع الاستطاعة، بل تجب الهجرة، ولا عذر في المقام، وإن منعه مانعٌ فلا يكون راضيًا بحاله مطمئنَ النفس بذلك، وإلا عمَّهُ البلاءُ، كما وقع لأهل الأندلس، حتى صار أولادُهم كفارًا والعياذ بالله، وكذلك لا تجوز الإقامة في موضعٍ تغلبُ فيه المعاصي وترك الدين\n  قال البيضاوي: في الآية دليل على وجوب الهجرة من موضع لا يتمكن في الرجل من إقامة دينه، وعن النبي صلى الله عليه وسلم:\n\n \" من فرَّ بدينه من أرض، ولو كان شبرًا من الأرض، استَوجَبَ الجنة، وكان رفيقَ إبراهيم ومحمد ـ عليهما الصلاة والسلام \" \n\nقلت: ويدخل فيه ـ على طريق الخصوص ـ من فرّ من موضع تكثر فيه الشهوات والعوائد، أو تكثر فيه العلائق والشواغل، إلى موضع يقلُّ فيه ذلك، طلبًا لصفاء قلبه ومعرفة ربه، بل هو أولى، ويكون رفيقاً لهما في حضرة القدس عند مليك مقتدر\n والله تعالى أعلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:74",
      "similarity": 0.37099328832011436
    },
    {
      "verse": "24:57",
      "similarity": 0.36702108131321953
    },
    {
      "verse": "8:72",
      "similarity": 0.34896220444243875
    },
    {
      "verse": "9:73",
      "similarity": 0.3438221618453241
    },
    {
      "verse": "66:9",
      "similarity": 0.3438221618453241
    }
  ]
}