{
  "chapter": "النساء",
  "text": "الا المستضعفين من الرجال والنساء والولدن لا يستطيعون حيلة ولا يهتدون سبيلا",
  "translations": [
    {
      "translation": "Except for those men, women and children who really are oppressed and do not have any other possibility and are not guided to any way.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who are helpless, men, women and children, who can neither contrive a plan nor do they know the way,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except the men, women, and children who were indeed too feeble to be able to seek the means of escape and did not know where to go.-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the really weak and oppressed men, women, and children who were not able to find any means of obtaining their freedom or of having the right guidance,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who were forcibly subdued among men, and the women and children, unable to devise a plan and unaware of the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except the weak ones among men, women and children who cannot devise a plan, nor are they able to direct their way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except the weak from among the men and the children who have not in their power the means nor can they find a way (to escape);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except the men, women, and children who, being abased, can devise nothing and are not guided to a way;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except the feeble among men, and the women, and the children, who are unable to devise a plan and are not shown a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except such weak ones among men, women and children, as are incapable of adopting any plan or of finding any way out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Excepting the weak ones among men, women and children, unable to find a stratagem and not guided to a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except the oppressed among men, women and children, who have neither access to any means nor are guided to any way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except those who are (really) weak and oppressed - men, women, and children - who have no means in their power, nor (a guide-post) to their way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except the weak ones among men, women and children who cannot devise a plan, nor are they able to direct their way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except the men, women, and children, who, being abased have no means and they are unable to guide themselves to a way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for the weak among men, and women, and children who have no means to act, and no means to find a way out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for the oppressed among men, women and children who cannot devise a plan nor are they directed to a way -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:98] Except the oppressed among the men, women, and children who are unable to devise a plan, having no strength to emigrate and no substance, and are not guided to a way, a means [of going] to the land of emigration.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then showed who had an excuse, saying: (Except the feeble among men) the elderly and the weak, (and the women, and the children, who are unable to devise a plan) for leaving Mecca (and are not shown a way) they do not know how to leave.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ والوِلْدان } أي: الناقصين القاصرين عن بلوغ درجة الكمال لغيرة تلحقهم من قبل صفات النفس { لا يستطيعون حيلة } لعدم قدرتهم وعجزهم عن كسر صفات النفس وقمع الهوى بالرياضة { ولا يَهْتَدون سبيلاً } لعدم علمهم بكيفية السلوك وحرمانهم عن نور الهداية الشرعية { فأولئِكَ عسى الله أنْ يَعْفو عَنهم } بمحو تلك الهيئات المظلمة لعدم رسوخها وسلامة عقائدهم { وكان الله عفوّاً } العفو عن الذنوب ما دامت الفطرة لم تتغير { غَفُوراً } يستر بنور صفاته صفات نفوسهم\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ ٱلْمُسْتَضْعَفِينَ مِنَ ٱلرِّجَالِ } الذين استضعهم المرض أو الهرم أو عدم المكنة { وَٱلنِّسَآءِ } لأنهن لسن متكلفات بالهجرة إلا مع أزواجهن { وَٱلْوِلْدَانِ } وهم ليسوا من أهل التكليف، وبالجملة: المستضعفون هم الذين { لاَ يَسْتَطِيعُونَ حِيلَةً } أي: لا يقدرون على إحداث حيلة تنجيهم عن أعدائهم { وَلاَ يَهْتَدُونَ سَبِيلاً } [النساء: 98] يوصلهم إلى أوليائهم حتى يهاجروا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم استثنى مَن تَحَقَّق إسلامُه وحبسه العذر، فقال: { إلا المستضعفين من الرجال والنساء والولدان } أي: المماليك والصبيان، وفيه إشعار بأنهم على صدد وجوب الهجرة، فإنهم إذا بلغوا وقدروا على الهجرة، فلا محيص عنها، وأن قومهم يجب أن يهاجروا بهم متى أمكنت الهجرة\n قال ابن عباس ـ رضي الله عنهماـ: \" كنتُ أنا أبي وأُمي ممن استثنى الله بهذه الآية \"\n ثم وصفهم بقوله { لا يستطيعون حيلة } أي: قوة على ما يتوقف عليه السفر، من ركوب أو غيره، { ولا يهتدون سبيلاً } أي: لا يعرفون طريقًا، ولا يجدون دليلاً، { فأولئك عسى الله أن يعفو عنهم }\n وعبَّر بحرف الرجاء إيذانًا بأنّ تركَ الهجرة أمرٌ خطير، حتى إن المضطر من حقه أن لا يأمن، ويترصد الفرصة، ويُعلِّقُ بها قلبه، { وكان الله غفورًا رحيمًا } فيعفو ويغفر لمن غلبه العذر\n\n\nوبالله التوفيق\n الإشارة: كل من لم يتغلغل في علم الباطن، مات ظالمًا لنفسه، أي: باخسًا لها لما فوَّتها من لذيذ الشهود، ومعرفة الملك المعبود، ولا يخلو باطنه من الإصرار على أمراض القلوب، التي هي من أكبر الذنوب، فإذا توفته الملائكة على هذه الحالة، قالت له: فيم كنتَ حتَّى لم تهاجر إلى من يُطهرك من العيوب، ويوصلك إلى حضرة علام الغيوب؟ فيقول: كنتُ من المستضعفين في علم اليقين، ولم أقدر على صحبة أهل عين اليقين وحق اليقين حَبَسَنَي عنهم حُبُّ الأوطان، ومرافقة النساء والولدان\n فيقال لهُ: ألم تكن أرض الله واسعة فتهاجر فيها إلى من يخلصك من الحجاب، وينفي عنك الشك والارتياب؟ فلا جرم أن مأواه سجن الأكوان، وحرمان الشهود والعيان، إلاَّ من أقر بوجود ضعفه، واضطر إلى مولاه في تخليصه من نفسه، فعسى ربه أن يعطف عليه، فيوصله إلى عارف من أوليائه، حتى يلتحق بأحبابه وأصفيائه، وما ذلك على الله بعزيز\n\n",
      "translations": []
    }
  ]
}