{
  "chapter": "النساء",
  "text": "فاو۟لئك عسى الله ان يعفو عنهم وكان الله عفوا غفورا",
  "translations": [
    {
      "translation": "It may well be that Allah will pardon them. Allah is Ever-Pardoning, Ever-Forgiving.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "May well hope for the mercy of God; and God is full of mercy and grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "maybe Allah shall pardon these, for Allah is All-Pardoning, All-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "perhaps God will forgive them; He is All-merciful and All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So for such, it is likely that Allah will pardon them; and Allah is Most Pardoning, Oft Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they whom Allah is likely to forgive them, and Allah is Ever Oft-Pardoning, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So these, it may be, Allah will pardon them, and Allah is Pardoning, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "haply them God will yet pardon, for God is All-pardoning, All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for such, it may be that Allah will pardon them. Allah is ever Clement, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God may well pardon them. God is ever-pardoning and ever forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These: belike Allah will pardon them, and Allah is ever Pardoning, Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Maybe Allah will excuse them, for Allah is all-excusing, all-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For these, there is hope that Allah will forgive: For Allah doth blot out (sins) and forgive again and again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For these there is hope that Allah will forgive them, and Allah is Ever Oft Pardoning, Oft-Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those, Allah may pardon them, He is the Pardoner, the Forgiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These—God may well pardon them. God is Pardoning and Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those it is expected that Allah will pardon them, and Allah is ever Pardoning and Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[4:99] As for such, perhaps God will pardon them, for God is ever Pardoning, Forgiving.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوجملة { فأولئك عسى الله أن يعفو عنهم } الفاء فيها للفصيحة ، والإتيان بالإشارة للتنبيه على أنّهم جديرون بالحكم المذكور من المغفرة .وفعل { عسى } في قوله : { فأولئك عسى الله أن يعفو عنهم } يقتضي أنّ الله يرجو أن يعفو عنهم ، وإذْ كان الله هو فاعل العفو وهو عالم بأنّه يعفو عنهم أو عن بعضهم بالتعيين تعيّن أن يكون معنى الرجاء المستفاد من { عسى } هنا معنى مجازياً بأنّ عفوه عن ذنبهم عفوٌ عزيز المنال ، فمُثِّل حال العفو عنهم بحال من لا يُقطع بحصول العفو عنه ، والمقصود من ذلك تضييق تحقق عذرهم ، لئلاّ يتساهلوا في شروطه اعتماداً على عفو الله ، فإنّ عذر الله لهم باستضعافهم رخصة وتوسعة من الله تعالى ، لأنّ البقاء على إظهار الشرك أمر عظيم ، وكان الواجب العزيمةُ أن يكلّفوا بإعلان الإيمان بين ظهراني المشركين ولو جلب لهم التعذيب والهلاك ، كما فعلت سُمَيَّة أمُّ عمّارٍ بن ياسر .وهذا الاستعمال هو محمل موارد { عسى } و ( لعلّ ) إذا أسندا إلى اسم الله تعالى كما تقدّم عند قوله تعالى : { وإذْ آتينا موسى الكتاب والفرقان لعلّكم تهتدون } في سورة البقرة ( 53 ) ، وهو معنى قول أبي عبيدة : «عسى من الله إيجاب» وقول كثير من العلماء : أنّ عسى ولعلّ في القرآن لليقين ، ومرادهم إذا أسند إلى الله تعالى بخلاف نحو قوله : { وقل عَسَى أن يهديني ربّي لأقرب من هذا رشداً } \\[ الكهف : 24 \\] .ومثل هذا ما قالوه في وقوع حرَف ( إنْ ) الشرطية في كلام الله تعالى ، مع أنّ أصلها أن تكون للشرط المشكوك في حصوله .وقد اتّفق العلماء على أنّ حكم هذه الآية انقضى يوم فتح مكة لأنّ الهجرة كانت واجبةً لمفارقة أهل الشرك وأعداء الدين ، وللتمكّن من عبادة الله دون حائل يحول عن ذلك ، فلمّا صارت مكة دار إسلام ساوت غيرها ، ويؤيّده حديث : \" لا هجرة بعد الفتح ولكنْ جِهَادٌ ونيَّة \" فكان المؤمنون يبقون في أوطانهم إلاّ المهاجرين يحرم عليهم الرجوع إلى مكة . وفي الحديث : \" أللهمّ أمْضضِ لأصحابي هجرتهم ولا تَرُدُّهْم على أعقابهم \" قاله بعدَ أن فتحت مكة . غير أنّ القياس على حكم هذه الآية يفتح للمجتهدين نظراً في أحكام وجوب الخروج من البلد الذي يفتن فيه المؤمن في دينه ، وهذه أحكام يجمعها ستّة أحوال :الحالة الأولى : أن يكون المؤمن ببلد يُفتن فيه في إيمانه فيُرغَم على الكفر وهو يستطيع الخروج ، فهذا حكمَه حكم الذين نزلت فيهم الآية ، وقد هاجر مسلمون من الأندلس حين أكرههم النصارى على التنصرّ ، فخرجوا على وجوههم في كلّ واد تاركين أموالهم وديارهم ناجين بأنفسهم وإيمانِهم ، وهلك فريق منهم في الطريق وذلك في سنة 902 وما بعدها إلى أن كان الجلاء الأخير سنة 1016 .الحالة الثانية : أن يكون ببلدِ الكفر غيرَ مفتون في إيمانه ولكن يكون عرضة للإصابة في نفسه أو ماله بأسر أو قتل أو مصادرة مال ، فهذا قد عرض نفسه للضرّ وهو حرام بلا نزاع ، وهذا مسمَّى الإقامةِ ببلد الحرب المفسّرة بأرض العدوّ .الحالة الثالثة : أن يكون ببلد غلب عليه غير المسلمين إلاّ أنّهم لم يفتِنوا الناسَ في إيمانهم ولا في عباداتهم ولا في أنفسهم وأموالهم وأعراضهم ، ولكنّه بإقامته تجري عليه أحكام غير المسلمين إذا عرض له حادث مع واحد من أهل ذلك البلد الذين هم غير مسلمين ، وهذا مثل الذي يقيم اليوم ببلاد أوروبا النصرانية ، وظاهر قول مالك أنّ المقام في مثل ذلك مكسروه كراهة شديدة من أجل أنّه تجري عليه أحكام غير المسلمين ، وهو ظاهر المدوّنة في كتاب التجارة إلى أرض الحرب والعتبية ، كذلك تأوّل قولَ مالك فقهاء القيروان ، وهو ظاهر الرسالة ، وصريح كلام اللخمي في طالعة كتاب التجارة إلى أرض الحرب من تبصرته ، وارتضاه ابن محرز وعبد الحقّ ، وتأوّله سحنون وابن حبيب على الحرمة وكذلك عبد الحميد الصائغ والمازري ، وزاد سحنون فقال : إنّ مقامه جرحة في عدالته ، ووافقه المازري وعبد الحميد ، وعلى هذا يجري الكلام في السفر في سفن النصارى إلى الحجّ وغيره . وقال البرزلي عن ابن عرفة : إن كان أمير تونس قويّاً على النصارى جاز السفر ، وإلاّ لم يجز ، لأنّهم يهينون المسلمين .الحالة الرابعة : أن يتغلّب الكفّار على بلدٍ أهلُه مسلمون ولا يفتنوهم في دينهم ولا في عبادتهم ولا في أموالهم ، ولكنّهم يكون لهم حكم القوة عليهم فقط ، وتجري الأحكام بينهم على مقتضى شريعة الإسلام كما وقع في صقلية حين استولى عليها رجير النرمندي . وكما وقع في بلاد غرناطة حين استولى عليها طاغية الجلالقة على شروط منها احترام دينهم ، فإنّ أهلها أقاموا بها مدّة وأقام منهم علماؤهم وكانوا يلون القضاء والفتوى والعدالة والأمانة ونحو ذلك ، وهاجر فريق منهم فلم يَعِب المهاجر على القاطن ، ولا القاطنُ على المهاجر .الحالة الخامسة : أن يكون لغير المسلمين نفوذ وسلطان على بعض بلاد الإسلام ، مع بقاء ملوك الإسلام فيها ، واستمرار تصرّفهم في قومهم ، وولاية حُكَّامهم منهم ، واحترام أديانهم وسائر شعائرهم ، ولكنّ تصرف الأمراء تحت نظر غير المسلمين وبموافقتهم ، وهو ما يسمّى بالحماية والاحتلال والوصاية والانتداب ، كما وقع في مصر مدّة احتلال جيش الفرنسيس بها ، ثم مدّة احتلال الأنقليز ، وكما وقع بتونس والمغرب الأقصى من حماية فرانسا ، وكما وقع في سوريا والعراق أيّام الانتدَاب وهذه لا شبهة في عدم وجوب الهجرة منها .الحالة السادسة : البلد الذي تكثر فيه المناكر والبدع ، وتجري فيه أحكام كثيرة على خلاف صريح الإسلام بحيث يخلِط عملاً صالحاً وآخرَ سَيّئاً ولا يجبر المسلم فيها على ارتكابه خلاف الشرع ، ولكنه لا يستطيع تغييرها إلاّ بالقول ، أو لا يستطيع ذلك أصلاً وهذه رُوي عن مالك وجوب الخروج منها ، رواه ابن القاسم ، غير أنّ ذلك قد حدث في القيروان أيّام بني عبيد فلم يُحفظ أنّ أحداً من فقهائها الصالحين دعا الناس إلى الهجرة . وحسبك بإقامة الشيخ أبي محمد بن أبي زيد وأمثاله . وحدث في مصر مدّة الفاطميين أيضاً فلم يغادرها أحد من علمائها الصالحين . ودون هذه الأحوال الستّة أحوال كثيرة هي أولى بجواز الإقامة ، وأنّها مراتب ، وإنّ لبقاء المسلمين في أوطانهم إذا لم يفتنوا في دينهم مصلحة كبرى للجامعة الإسلامية .\n\n",
      "translations": [
        {
          "translation": "(As for such, it may be) it is a requisite (that Allah will pardon them) that which ensues from them. (Allah is ever Clement) towards the likes of these, (Forgiving) of those who repent amongst them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَأُوْلَـٰئِكَ } المضطربون في أمر الهجرة المستضعفون في يد العدو { عَسَى ٱللَّهُ أَن يَعْفُوَ عَنْهُمْ } أي: يمحو عن صحائف أعمالهم زلتهم الاضطرارية\n ويغفر ذنوبهم كسائر المؤمنين إن كانوا مخلصين في الإيمان { وَكَانَ ٱللَّهُ } المطلع لسرائر عباده ونيابتهم { عَفُوّاً } لمن أخلص { غَفُوراً } [النساء: 99] لمن تاب ورجع",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأولئك عسى الله أن يعفو عنهم }\n وعبَّر بحرف الرجاء إيذانًا بأنّ تركَ الهجرة أمرٌ خطير\n حتى إن المضطر من حقه أن لا يأمن\n ويترصد الفرصة\n ويُعلِّقُ بها قلبه\n { وكان الله غفورًا رحيمًا } فيعفو ويغفر لمن غلبه العذر\n\nوبالله التوفيق\n الإشارة: كل من لم يتغلغل في علم الباطن\n مات ظالمًا لنفسه\n أي: باخسًا لها لما فوَّتها من لذيذ الشهود\n ومعرفة الملك المعبود\n ولا يخلو باطنه من الإصرار على أمراض القلوب\n التي هي من أكبر الذنوب\n فإذا توفته الملائكة على هذه الحالة\n قالت له: فيم كنتَ حتَّى لم تهاجر إلى من يُطهرك من العيوب\n ويوصلك إلى حضرة علام الغيوب؟ فيقول: كنتُ من المستضعفين في علم اليقين\n ولم أقدر على صحبة أهل عين اليقين وحق اليقين حَبَسَنَي عنهم حُبُّ الأوطان\n ومرافقة النساء والولدان\n فيقال لهُ: ألم تكن أرض الله واسعة فتهاجر فيها إلى من يخلصك من الحجاب\n وينفي عنك الشك والارتياب؟ فلا جرم أن مأواه سجن الأكوان\n وحرمان الشهود والعيان\n إلاَّ من أقر بوجود ضعفه\n واضطر إلى مولاه في تخليصه من نفسه\n فعسى ربه أن يعطف عليه\n فيوصله إلى عارف من أوليائه\n حتى يلتحق بأحبابه وأصفيائه\n وما ذلك على الله بعزيز",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:52",
      "similarity": 0.4877185931890316
    },
    {
      "verse": "9:43",
      "similarity": 0.47264531212734096
    },
    {
      "verse": "22:60",
      "similarity": 0.4615398355423037
    },
    {
      "verse": "60:7",
      "similarity": 0.45624686499091277
    },
    {
      "verse": "42:25",
      "similarity": 0.44712212055099193
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/004099.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/004099.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/4:99.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}