{
  "chapter": "ق",
  "text": "رزقا للعباد واحيينا به بلدة ميتا كذلك الخروج",
  "translations": [
    {
      "translation": "as provision for Our slaves; by it We brought a dead land to life. That is how the Emergence will take place.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As a provision for men, and enlivened a region that was dead. Even thus will be the life after death.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "all this as sustenance for Our servants. And thus We do bring the dead land back to life with water. Such shall be the coming forth (of human beings from the earth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as sustenance for My servants. With this We have brought the dead land back to life. Thus, will also be your resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As sustenance for the bondmen; and with it We revived a dead city; this is how you will be raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A provision for the servants. And We give life therewith to a dead land. Thus will be the Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A sustenance for the servants, and We give life thereby to a dead land; thus is the rising.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "a provision for the servants, and thereby We revived a land that was dead. Even so is the coming forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Provision (made) for men; and therewith We quicken a dead land. Even so will be the resurrection of the dead.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as a provision for human beings; and by [all] this We bring dead land to life. Such shall be the Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As a provision for our bondmen; and therewith We have quickened a dead land. Even so will be the coming forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as a provision for Our servants, and with it We revive a dead country. Likewise will be the rising [from the dead].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As sustenance for (Allah's) Servants;- and We give (new) life therewith to land that is dead: Thus will be the Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A provision for (Allah's) slaves. And We give life therewith to a dead land. Thus will be the resurrection (of the dead).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as a provision for the worshipers; thereby We revived a land that was dead. Such shall be the emerging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As sustenance for the servants. And We revive thereby a dead town. Likewise is the resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As provision for the servants, and We have given life thereby to a dead land. Thus is the resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:11] as provision for [Our] servants (rizqan li’l-‘ibādi, is a direct object denoting reason); and with it We revive a dead land (baldatan may be followed equally by the masculine [maytan] or the feminine [adjective, maytatan]). So, like that manner of reviving, shall be the rising, from the graves: so how can you deny it? (the interrogative is meant as an affirmative; the meaning then is that they have indeed observed [all of these things] and are aware of what has been mentioned [yet they disbelieve]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Provision (made) for men) food for people, i.e. the grains; (and therewith) i.e. through water (We quicken a dead land) a land with no vegetation. (Even so will be the resurrection of the dead) this is how they will be brought back to life and raised forth from the graves through water on the Day of Judgement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كَذَلِكَ ٱلْخُرُوجُ } معناهُ يومُ القِيامةُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنما أنبتا ما أنبتنا؛ ليكون { رِّزْقاً لِّلْعِبَادِ } يرتزقون بها ويشكرون منعهما ومبدعها { وَ } بالجملة: { أَحْيَيْنَا بِهِ } أي: بالماء المنزل من السماء { بَلْدَةً مَّيْتاً } يابسة جدبة، لا كلأ فيها ولا نماء { كَذَلِكَ ٱلْخُرُوجُ } [ق: 11] أي: خروجهم من قبورهم أحياء بقدرتنا مثل ذلك، فمن أين ينكرون ويستبعدون أولئك الحمقى الجاهلون بقدرة العليم الحكيم؟!\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وفيه تنبيه على أن الواجب على العبد أن يكون انتفاعه بما ذكر من حيث التذكُّر والتبصُّر الذي هو رزق الروح أهم وأقدم من تمتُّعه من حيث الرزق الحسي، { وأحيينا به } بذلك الماء { بلدةً ميتاً } أرضاً جدبة، لا نماء فيها أصلاً، فلما أنزلنا عليه الماء رب واهتزت بالنبات والأزهار، بعدما كانت جامدة\n\n\nوضمَّن البلدة معنى البلد فذَكَّر الوصف\n { كذلك الخروجُ } من القبور، فكما حييت هذه البلدة الميتة كذلك تُخرجون أحياء بعد موتكم، لأن إحياء الموت كإحياء الأموات\n وقدّم الخبر للقصد إلى القصر\n والإشارة في \" كذلك \" إلى الحياة المستفادة من الإحياء، وما فيه من معنى البُعد للإشعار ببُعد رتبها، أي: مثل ذلك الحياة البديعة حياتكم بالبعث من القبور، لا شيء مخالف لها\n وفي التعبير عن إخراج النبات من الأرض بالإحياء، وعن حياة الأموات بالخروج تفخيم لشأن النبات، وتهوين لأمر البعث، وتحقيق للمماثلة لتوضيح منهاج القياس، وتقريبه إلى أفهام الناس\n الإشارة: { قۤ } أيها القريب المقرَّب، وحق القرآن المجيد، إنك لحبيب مجيد، رسول من عند الله الملك المجيد، وإن كنت بشراً فنسبتك من البشر كياقوتة بين الحجر، فالبشرية لا تُنافي الخصوصية، بل تجامعها مِنَّةً منه تعالى وفضلاً، على مَن شاء من عباده، فاستبعاد الكفار مجامعة الخصوصية للبشرية كاستبعاد إبليس تفضيل آدم لكونه بشراً من طين، وذلك قياس فاسد، مضاد للنص، وكما استَبعدت الكفرة وجود خصوصية النبوة في البشر، استبعدت الجهلُ خصوصية التربية بالإصطلاح في البشر، بل عجِبوا أن جاءهم منذر منهم، يدل على الله، ويُبين الطريق إليه، قالوا: هذا شيء عجيب: { أئذا متنا } بأن ماتت قلوبنا بالغفلة، { وكنا تراباً } أرضيين بشريين، تحيى أرواحنا بمعرفة العيان؟! ذلك رجع بعيد\n قال تعالى: { قد علمنا ما تنقص الأرض منهم } أرض النفوس من أرواحهم، وتهوي بها إلى الحضيض الأسفل، فيجذبها إلى أعلى عليين، إن سبقت عنايتنا، وعندنا كتاب حفيظ يحفظ المراتب والمقامات، فيلتحق كل واحد بما سبق له\n بل كذّبوا بالحق، وهو الداعي إلى الحق، لمّا جاءهم في كل زمان، فهم في أمر مريج، تارة يُقرون وجود التربية بالهمّة والحال، وينكرون الاصطلاح، وتارة يُقرون بالجميع، وينكرون تعيينه، أفلم ينظروا إلى سماء القلوب والأرواح، كيف بنيناها، أي: رفعنا قدرها بالعلوم والمعارف، وزيَّنَّاها بأنوار الإيمان والإحسان، وليس فيها خلل، وأرض النفوس مددناها: جعلناها بساطاً للعبودية، وألقينا فيها رواسي أرسيناها بالعقول الصافية الثابتة، لئلا تضطرب عند زلزلات الامتحان، وأنبتنا فيها من كل صنف بهيج، من فنون علم الحكمة والتشريع، تبصرةً وتذكيراً لكل عبدٍ منيبٍ، راجع إلى مولاه، قاصدٍ لمعرفته\n قال القشيري: تبصرةً وذكرى لمَن رجع إلينا في شهود أفعالنا إلى رؤية صفاتنا، ومن شهود صفاتنا إلى شهود ذاتنا\n هـ\n ونزَّلنا من السماء ماء العلوم اللدينة، كثير البركة والنفع، فأنبتنا به جنات المعارف وحب الحصيد، وهو حب المحبة لأنه يحصد من القلب محبة ما سوى الله\n والنخل باسقات، أي: شجرة المعرفة الكاملة لها طلع نضيد: ثمرة المعرفة وحلاوة الشهود، رزقاً لأرواح العباد، وأحيينا به نفساً ميتة بالغفلة والجهل، كذلك الخروج من ظلمة الجهل إلى نور العلم، أي: مثل هذا الخروج البديع يكون الخروج، وإلا فلا\n ثم هدَّدهم بما جرى على مَن قبلهم، فقال: { كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ }\n\n",
      "translations": []
    }
  ]
}