{
  "chapter": "ق",
  "text": "ولقد خلقنا الانسن ونعلم ما توسوس به نفسه ونحن اقرب اليه من حبل الوريد",
  "translations": [
    {
      "translation": "We created man and We know what his own self whispers to him. We are nearer to him than his jugular vein.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created man and surely know what misdoubts arise in their hearts; for We are closer to him than his jugular vein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have created man, and We know the promptings of his heart, and We are nearer to him than even his jugular vein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We swear that We have created the human being and We know what his soul whispers to him. We are closer to him than even his jugular vein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have created man and We know what his soul instils in him; and We are nearer to him than the hearts artery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have created man, and We know what his self whispers to him. And We are nearer to him than his jugular vein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We created man, and We know what his mind suggests to him, and We are nearer to him than his life-vein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We indeed created man; and We know what his soul whispers within him, and We are nearer to him than the jugular vein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We verily created man and We know what his soul whispereth to him, and We are nearer to him than his jugular vein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created man -- We know the promptings of his soul, and are closer to him than his jugular vein --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have created man and We know whatsoever his soul whispereth Unto him, and We are nigher Unto him than his jugular vein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We have created man and We know to what his soul tempts him, and We are nearer to him than his jugular vein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was We Who created man, and We know what dark suggestions his soul makes to him: for We are nearer to him than (his) jugular vein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have created man, and We know what his ownself whispers to him. And We are nearer to him than his jugular vein (by Our Knowledge).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We created the human. We know the whisperings of his soul, and are closer to him than the jugular vein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created the human being, and We know what his soul whispers to him. We are nearer to him than his jugular vein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have already created man and know what his soul whispers to him, and We are closer to him than [his] jugular vein\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:16] And verily We created man and We know (wa-na‘lamu is a circumstantial qualifier with an implicit [preceding] nahnu) what (mā relates to the verbal action) his soul whispers to him, [what] it speaks [to him] (the bi- [of bihi, ‘him’] is extra, or it is [required] for the intransitive verb to become transitive [and take a direct object]; the [suffixed] personal pronoun [in bihi, ‘him’] refers to man); and We are nearer to him, in knowing [him], than his jugular vein (habli’l-warīdi: the genitive annexation is explicative; al-warīdān are two [principal] veins on either side of the neck).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We verily created a man) the child of Adam; and it is said this means: Abu Jahl (and We know what his soul whispereth to him, and We are nearer to him) We are more aware of him and have more power over him (than his jugular vein) and there is nothing closer to man than this jugular vein.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَنَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ ٱلْوَرِيدِ } قال الإِمامُ زيد بن علي عليهما السّلامُ\n فالحَبلُ: حَبلُ العَاتقِ\n والوريدُ: العِرقُ الذي في الحَلقِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة { لَقَدْ خَلَقْنَا ٱلإِنسَانَ } وأظهرناه من كتم العدم { وَ } نحن { نَعْلَمُ } منه حنيئذ { مَا تُوَسْوِسُ } وتحدث { بِهِ نَفْسُهُ } وتخطر بباله الآن من أمثال هذه الأوهام والخيالات الباطلة، والمترتبة على حصة ناسوته، المقيدة بسلاسلا الرسوم وأغلال العادات الموروثة له من العقل الفضول، الممتزج بالوهم بسلاسل الرسوم وأغلال العادات الموروثة له من العقل الفضول، الممتزج بالوهم الجهول { وَ } كيف لا نعم من هواجس نفسه؛ إذ { نَحْنُ أَقْرَبُ إِلَيْهِ مِنْ حَبْلِ ٱلْوَرِيدِ } [ق: 16] أي: وريده، وهو مثل من القرب المفرط، كما قال: الموت أدنى لي من الوريد، وإضافة الحبل إليه للبيان، وبالجلمة: نحن أقرب إليه منه\n\n\n\n\nالوريدان: هما العرقان المنبثان من مقدم الرأس، المتنازلان من طرفي العنق، المتلاصقان عند القفا، المنتهيان إلى آخر البدن، وهما قوام البدن ومداره عليهما؛ إذ هما أقوى عالم هيكل الإنسان\n\n\n\n\nوبالجملة: نحن حسب روحنا المنفوخ فيه من عالم اللاهوت أقرب إليه من ناسوته، لا على توهم المساففةن ولا على طريق التركب والاتحاد والحلول والامتزاج، بل على وجه الظلية والانعكاس، ومع غاية قرب الحق إليه وكمال إحاطته إياه، وكَّل عليه الحفظة من الملائكة؛ ليراقبوا أحواله إلزاماً للحجة عليه لدى الحاجة يوم القيامة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ولقد خلقنا الإِنسانَ ونعلمُ ما تُوسْوسُ به نفسُه } أي: ما تُحدِّثه نفسُه ويهجس في ضميره من خير وشر\n والوسوسة: الصوت الخفي، ووسوسة النفس: ما يخطر بالبال\n والضمير في \" به \" لـ \" ما \" إن جعلتها موصولةً، والباء كما في: صَوَّت بكذا، أو: للإنسان، إن جعلتها مصدرية\n والباء حينئذ للتعددية\n { ونحن أقربُ إِليه } أي: أعلم بحاله مما كان أقرب إليه { مِن حبل الوريد } والحبل: العرق، وإضافته بيانية والوريدان: عرقان مكتفان بصفحتي العنق في مقدمه متصلان بالوتين، والوتين: عرق في القلب إذا انقطع مات صاحبه\n قاله في القاموس، يَرِدان من الرأس إليه، وقيل: سُمي وريد لأن الماء يرده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "114:5",
      "similarity": 0.5525884254233981
    },
    {
      "verse": "7:20",
      "similarity": 0.4553661790004668
    },
    {
      "verse": "20:120",
      "similarity": 0.4086807098678528
    },
    {
      "verse": "26:44",
      "similarity": 0.40601944616424257
    },
    {
      "verse": "20:66",
      "similarity": 0.3574971047464525
    }
  ]
}