{
  "chapter": "ق",
  "text": "افعيينا بالخلق الاول بل هم فى لبس من خلق جديد",
  "translations": [
    {
      "translation": "Were We exhausted by the first creation? Yet they are dubious about the new creation.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were We exhausted by the act of the first creation? And yet they are confused about a new creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We, then, become worn out by the first creation? Not at all; but they are in doubt about a fresh creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We fail to accomplish the first creation? Of course, We did not; We have all power over all things. Yet they are confused about a new creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So did We tire by creating the first time? Rather they doubt being created again.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were We then tired with the first creation Nay, they are in confused doubt about a new creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were We then fatigued with the first creation? Yet are they in doubt with regard to a new creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, were We wearied by the first creation? No indeed; but they are in uncertainty as to the new creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were We then worn out by the first creation? Yet they are in doubt about a new creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were We then worn out by the first creation? Yet they are in doubt about a second creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are We then wearied with the first creation? Aye! they are in dubiety regarding a new creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have We been exhausted by the first creation? No, they are in doubt about a new creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were We then weary with the first Creation, that they should be in confused doubt about a new Creation?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were We then tired with the first creation? Nay, They are in confused doubt about a new creation (i.e. Resurrection)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, were We wearied by the first creation? No, indeed; yet they are in doubt about a new creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were We fatigued by the first creation? But they are in doubt of a new creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We fail in the first creation? But they are in confusion over a new creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:15] Were We then wearied by the first creation?, that is to say, We were not wearied by it, and likewise We will not be wearied by restoring it. Nay, yet they are in doubt about a new creation, which will be [at] the Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Were We then worn out by the first creation) such that We will be worn out by their second creation when We create them for resurrection after death? (Yet they) i.e. the Quraysh (are in doubt about a new creation) after death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بَلْ هُمْ فِي لَبْسٍ مِّنْ خَلْقٍ جَدِيدٍ } معناه من إحياءٍ بعدَ المَوتِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {But they are in clothing of new creation} means from resurrection after death.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nوبقوله: { أفعيينا بالخلق الأول } أي: إما اهتدينا إلى إبداع الحقائق وإيجاد الأشياء الأولية كالأرواح والسموات وأمثالها\n بل اعترفوا بذلك إنما هم في شبهة والتباس من خلق حادث يتجدد كل وقت\n لبس عليهم الشيطان حتى قالوا:\n[الجاثية\n الآية:24] ونسبوا التأثير إلى الزمان واحتجبوا عن معنى قوله:\n[الرحمن\n الآية:29]\n ولو عرفوا الله حق معرفته وكان اعترافهم بإيجاده للخلق الأول عن علم ويقين لشاهدوا الخلق الجديد في كل آن فلم ينكروا البعث وكانوا عباداً مخلصين ليس للشيطان عليهم سلطان",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على سبيل الإنكار والاستبعاد على المنكرين المستعبدين بالحشر والبعث: { أَفَعَيِينَا } أي: ينكرون قدرتنا على الإعادة\n وتظنون أن صرنا عاجزين { بِٱلْخَلْقِ ٱلأَوَّلِ } أي: الإبداء الإبداعي عن الخلق الثاني الإعادي\n ويزعمون أن قدرتنا تفتر وتضعف عند الخلق الأول\n بل ينتهي دونه\n ولم يعلموا أن قدرتنا لكل مقدور من المقدورات في كل آن من الآناء على شأنٍ من الشئون الكمالية\n بحيث لم يمض مثله\n ولا يتأتى شبهه { بَلْ } يتفطن بمقتضى الفطرة الأصلية أن { هُمْ } في أنفسهم دائما { فِي لَبْسٍ } وخلع { مِّنْ } توارد { خَلْقٍ جَدِيدٍ } [ق: 15] منا\n وإيجادٍ متجدد من قبلنا في كل آن وزمان حسب قدرتنا واختيارنا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أفَعيِينَا بالخلق الأول } استئناف مقرر لصحة البعث\n الذي حكيت أحوال المنكرين له من الأمم المهلكة\n والعَيُّ بالأمر: العجز عنه\n يقال: عيى بالأمر: إذا لم يهتدِ لوجه عمله\n والهمزة للإنكار\n والفاء: عطف على مقدر\n ينبئ عنه المقام\n كأنه قيل: أقصدنا الخلق الأول فعجزنا عنه حتى يتوهم عجزنا عن الإعادة؟ { بل هم في لَبْسِ من خَلقٍ جديدٍ } أي: بل هم في لبس وخلط وشُبهة\n قد لبس عليهم الشيطان وحيّرهم\n حيث سؤَّل لهم أن إحياء الموتى خارج عن العادة\n فتركوا لذلك الاستدلال الصحيح\n وهو: أن مَن قدر على الإنشاء كان على الإعادة أقدر\n\nوهو معطوف على مقدر يدل عليه ما قبله\n كأنه قيل: هم غير منكرين لقدرتنا على الخلق الأول\n بل هم في خلط وشبهة من خلق مستأنف جديد\n وتنكير \" خلق \" لتفخيم شأنه\n والإشعار بخروجه عن حدود العادة\n والإيذان بأنه حقيق بأن يبحث عنه ويهتم بمعرفته\n الإشارة: قال القشيري: الإشارة في الآية إلى أنَّ الغالب في كل زمان غلبة الهوى والطبيعة الحيوانية واستيلاء الحس على الناس\n نفوسهم متمردة\n بعيدة من الحق\n قريبة من الباطل\n كلما جاء إليهم رسول كذّبوه\n وعلى ما جاء به قاتلوه\n فحقَّ عليهم عذابُ ربهم\n لَمَّا كفروا نِعَمَه\n فما أعياه إهلاكهم\n هـ\n قلت: وكذلك جرى في كل زمان\n كل مَن أَمَر الناس بإخراجهم عن عوائدهم\n ومخالفة أهوائهم\n رفضوه وعادوه\n فقلَّ بسبب ذلك المخلصون\n وكثر المخلطون\n فإذا قالوا: لا يمكن الإخراج عن العوائد\n قلنا: القدرة صالحة\n قال تعالى: { أفعيينا بالخلق الأول بل هم في لبس من خلق جديد } وهو إحياء القلب الميت\n فيجدّد إيمانه\n وتحيا روحه حياة سرمدية\n وبالله التوفيق\n ثم إنَّ عادته تعالى في التنزيل: أنه مهما ذكر دلائل قدرته ذكر بإثره شأن علمه\n أو بالعكس\n إشارة إلى إسناد كل المقدورات إليه تعالى\n ردًّا على الطبائعيين لأنّ الفاعل بالطبيعة لا يتوفق على العلم\n ولذلك قال تعالى: { وَلَقَدْ خَلَقْنَا ٱلإِنسَانَ وَنَعْلَمُ مَا تُوَسْوِسُ بِهِ نَفْسُهُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "46:33",
      "similarity": 0.7987513716538269
    },
    {
      "verse": "32:10",
      "similarity": 0.2856719117290037
    },
    {
      "verse": "35:16",
      "similarity": 0.2615754392904833
    },
    {
      "verse": "14:19",
      "similarity": 0.26108113979363484
    },
    {
      "verse": "72:3",
      "similarity": 0.24326234624709692
    }
  ]
}