{
  "chapter": "ق",
  "text": "ما يلفظ من قول الا لديه رقيب عتيد",
  "translations": [
    {
      "translation": "He does not utter a single word, without a watcher by him, pen in hand!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not a word he utters but an observer is ready (to make note of it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He utters not a word, but there is a vigilant watcher at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The human being will certainly experience the agony of death\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He does not utter a single word, without a ready recorder seated next to him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not a word does he (or she) utter but there is a watcher by him ready (to record it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He utters not a word but there is by him a watcher at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "not a word he utters, but by him is an observer ready.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He uttereth no word but there is with him an observer ready.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "each word he utters shall be noted down by a vigilant guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not a word he uttereth but there is with him a watcher ready.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "he says no word but that there is a ready observer beside him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not a word does he utter but there is a sentinel by him, ready (to note it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not a word does he (or she) utter, but there is a watcher by him ready (to record it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whatever phrase he utters, an observer is present.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not a word does he utter, but there is a watcher by him, ready.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Man does not utter any word except that with him is an observer prepared [to record].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:18] he does not utter a word but that there is beside him a watcher, a guardian, [who is] ready, present (both [raqībun, ‘watcher’, and ‘atīdun, ‘ready’] are meant to indicate the dual).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He uttereth no word) the slave utters no good or evil word (but there is with him an observer ready) to record either that which is in his advantage or disadvantage.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { رَقِيبٌ عَتِيدٌ } معناه حافظٌ\n عتيدٌ: أي حَاضرٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر يا أكمل الرسل: { إِذْ يَتَلَقَّى } ويتحفظ { ٱلْمُتَلَقِّيَانِ } الموكلان عليه { عَنِ ٱلْيَمِينِ وَعَنِ ٱلشِّمَالِ قَعِيدٌ } [ق: 17] أي: قاعد كل من الموكلين عن يمنه وشماله، مترقبين على أحواله وأعماله وأقواله، بحيث { مَّا يَلْفِظُ } ويتلفظ { مِن قَوْلٍ } يرميه من فيه { إِلاَّ لَدَيْهِ رَقِيبٌ } حفيظ عليه { عَتِيدٌ } [ق: 18] مهيأ، معد، حاضر عنده، غير مغيب على وجه لا يفوت عنه شيئاً من ملتقطاته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ما يلفظ مِن قولٍ } أي: ما يتكلم به وما يَرْمي به من فِيه { إِلا لديه رقيبٌ } حافظ { عتيدٌ } حاضر لازم، أو معد مهيأ لكتابة ما أمر به من الخير والشر، وقال أبو أمامة عنه صلى الله عليه وسلم:\n\n \" كاتب الحسنات عن يمين الرجل وكاتب السيئات عن يساره، وكاتب الحسنات أمين على كاتب السيئات، فإذا عمل حسنةً كتبها صاحبُ اليمين عشراً، وإذا عمل سيئة قال صاحبُ اليمين لصاحب الشمال: دعه سبع ساعات، لعله يُسبِّح أو يستغفِر \"\n \n\nقال الحسن: إنّ الملكين يجتنبان العبد عند غائطه، وعند جماعه، ويكتبان عليه كل شيء، حتى أنينه في مرضه\n وقال عكرمة: لا يكتبان عليه إلا ما يؤجر عليه أو يؤزر\n وعنه عليه السلام:\n\n \" ما من حافظين يرفعان إلى الله ما حفظا، فيرى الله تعالى في أول الصحيفة خيراً وفي آخرها خيراً، إلا قال للملائكة: اشهدوا أني قد غفرت لعبدي ما بين طرفي الصحيفة \" \n\n \n\nوالحفظة أربعة: اثنان بالليل، واثنان بالنهار، فإذا مات العبد قاموا على قبره يُكبران ويُهللان ويُكتب ذلك للعبد المؤمن\n ولمَّا ذكر إنكارهم للبعث، واحتج عليهم بعموم قدرته وعِلمه، أعلمهم أن ما أنكروه هم لاقوه بعد الموت، ونبّه على اقتراب ذلك بأن عبّر عنه بلفظ الماضي فقال: { وجاءت سكرةُ الموت بالحق\n\n } الخ\n وقال ابن عطية: هو عندي عطف على \" إذ يتلقى \" والتقدير: وإذ تجيءُ سكرة الموت، يعني فهو كقوله:\n\n[الواقعة: 85] الآية\n هـ",
      "translations": []
    }
  ]
}