{
  "chapter": "ق",
  "text": "وجاءت كل نفس معها سائق وشهيد",
  "translations": [
    {
      "translation": "Every self will come together with a driver and a witness:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each soul will come with a driver and a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everyone has come, each attended by one who will drive him on, and another who will bear witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every soul will be accompanied (by an angel) behind him and another as a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every soul came, along with a herder and a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every person will come forth along with a Sa'iq and a Shahid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every soul shall come, with it a driver and a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every soul shall come, and with it a driver and a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every soul cometh, along with it a driver and a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each person will arrive attended by an [angel] to drive him on and another to bear witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there shall come every soul therewith shall be a driver and a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every soul will come accompanied by [two angels], a driver, and a witness:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there will come forth every soul: with each will be an (angel) to drive, and an (angel) to bear witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every person will come forth along with an (angel) to drive (him), and an (angel) to bear witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each soul shall come with a driver, and a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every soul will come forward, accompanied by a driver and a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every soul will come, with it a driver and a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:21] And, thereat, every soul will come, to the site for the Gathering, accompanied by a driver, an angel to drive it there, and a witness, to testify to its deeds, namely, the hands and the feet and others; and it will be said to the disbeliever:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And every soul cometh, along with it a driver) leading it to its Lord; this driver is the angel who recorded the evil deeds it had committed (and a witness) before its Lord; this is the angels who recorded its good deeds; and it is also said that this witness is man's works. 606\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجَآءَتْ كُلُّ نَفْسٍ مَّعَهَا سَآئِقٌ وَشَهِيدٌ } قال الإِمامُ زيد بن علي عليهما السَّلامُ: فالسَّائقُ: الذي يَسوقُها إلى أَمرِ الله تعالى\n والشَّهيدُ: الذي يَشهدُ عليها بمَا عَملتْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {And every soul will come with it a driver and a witness} - Imam Zayd ibn Ali said: So the driver is the one who will take it to the command of Allah.\n The witness: the one who testifies against her for what she did.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وجاءت كل نفس معها سائق } من علمه { وشهيد } من عمله لأن كل أحد ينجذب إلى محل نظره وما اختاره بعلمه\n والميل الذي يسوقه إلى ذلك الشيء إنما نشأ من شعوره بذلك الشيء وحكمه بملائمته له سواء كان أمراً سفلياً جسمانياً بعثه عليه هواه وأغراه عليه وهمه وقواه\n أو أمراً علوياً روحانياً بعثه عليه عقله ومحبته الروحانية وحرّضه عليه قلبه وفطرته الأصلية\n فالعلم الغالب عليه سائقه إلى معلومه\n وشاهده بالميل الغالب عليه والحب الراسخ فيه والعمل المكتوب في صحيفته يشهد عليه بظهوره على صور أعضائه وجوارحه وينطق عليه كتابه بالحق وجوارحه بهيئات أعضائه المتشكلة بأعماله\n { لقد كنت في غفلة من هذا } لاحتجابك بالحس والمحسوسات وذهولك عنه لاشتغالك بالظاهر عن الباطن { فكشفنا عنك } بالموت { غطاءك } المادي الجسماني الذي احتجبت به { فبصرك اليوم حديد } أي: إدراكك لما ذهلت عنه ولم تصدق بوجوده يقيناً قوي تعاينه { وقال قرينه } من شيطان الوهم الذي غرّه بالظواهر وحجبه عن البواطن { هذا ما لديّ } مهيأ لجهنم\n أي: ظهر تسخير الوهم إياه في التوجه إلى الجهة السفلية وإنه ملكه واستعبده في طلب اللذات البدنية حتى هيأه لجهنم في قعر الطبيعة\n { ألقيا في جهنم } الخطاب للسائق والشهيد اللذين يوبقانه ويلقيانه ويهلكانه في أسفل غياهب مهواة الهيولى الجسمانية وغيابة جب الطبيعة الظلمانية في نيران الحرمان أو لمالك\n والمراد بتثنية الفاعل تكرار الفعل كأنما قال: ألق\n لاستيلائه عليهم في الإبعاد والإلقاء إلى الجهة السفلية\n ويقوّي الأول أنه عدد الرذائل الموبقة التي أوجبت استحقاقهم لعذاب جهنم ووقوعهم في نيران الجحيم وبين أنها من باب العلم والعمل والكفران ومنع الخير كلاهما من إفراط القوة البهيمية الشهوانية لانهماكها في لذاتها واستعمالها نِعَم الله تعالى في غير مواضعها من المعاصي والاحتجاب عن المنعم بها ومن حقها أن تذكره وتبعث على شكره وشدّة حرصها ومكالبتها عليها لفرط ولوعها بها فتمنعها عن مستحقيها\n وذكرهما على بناء المبالغة ليدل على رسوخ الرذيلتين فيه وغلبتهما عليه وتعمقه فيهما الموجب للسقوط عن رتبة الفطرة في قعر بئر الطبيعة\n والعتود والاعتداء كلاهما من إفراط القوة الغضبية واستيلائها لفرط الشيطنة والخروج عن حد العدالة\n والأربعة من باب فساد العمل والريب والشرك كلاهما من نقصان القوة النطقية وسقوطها عن الفطرة بتفريطها في جنب الله وقصورها عن حدة القوة العاقلة وذلك من باب فساد العلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما بعث الأموات من أجداثهم للحشر والجزاء { جَآءَتْ } وحضرت { كُلُّ نَفْسٍ } من النفوس الطيبة والخبيثة { مَّعَهَا سَآئِقٌ } موكل\n يسوقها إلى المحشر للعرض والجزاء { وَشَهِيدٌ } [ق: 21] من حفظة أعمالها وأحوالها\n يشهد لها وعليها\n\n\nوبعدما حضر كل منهم بين يدي الله\n قيل لكل منهم من قِبل الحق على سبيل الخطاب والعتاب: { لَّقَدْ كُنتَ } أيها المغرور { فِي غَفْلَةٍ مِّنْ هَـٰذَا } اليوم\n وانكسار عظيم من وقوعه\n لذلك كذبت بالرسل والكتب\n واستهزأت بالهداة الثقات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولذلك بدأ ببيان حال الكفرة بقوله: { وجاءت كُلُّ نَفْسٍ } من النفوس البرّة والفاجرة { معها سائق وشهيد } أي: ملكان\n أحدهما يسوقه إلى المحشر\n والآخر يشهد عليه بعمله\n قيل: السائق: كاتب الحسنات\n والشاهد: كاتب السيئات\n ويقال لها: { لقد كنتَ في غفلة من هذا } النازل بك اليوم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:30",
      "similarity": 0.7874951124808295
    },
    {
      "verse": "68:42",
      "similarity": 0.535464423650559
    },
    {
      "verse": "8:6",
      "similarity": 0.49971365980401655
    },
    {
      "verse": "25:7",
      "similarity": 0.4883997869725519
    },
    {
      "verse": "19:86",
      "similarity": 0.43027944968772386
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/50:21.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/50:21.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/50:21.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}