{
  "chapter": "ق",
  "text": "بل عجبوا۟ ان جاءهم منذر منهم فقال الكفرون هذا شىء عجيب",
  "translations": [
    {
      "translation": "Nonetheless they are amazed that a warner should have come to them from among themselves and those who are kafir say, 'What an extraordinary thing!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are rather surprised that a warner from among themselves has come to them. So the unbelievers say: \"This is astonishing:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay; they wondered that a warner should have come to them from among themselves. The unbelievers said: “This indeed is a strange thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, it seems odd (to the pagans) that a warner from their own people has come to them. The disbelievers have said, \"It is very strange\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather they were shocked that a Herald of Warning came to them from among themselves, so the disbelievers said, “This is something really strange.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, they wonder that there has come to them a warner from among themselves. So the disbelievers say: \"This is a strange thing!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! they wonder that there has come to them a warner from among themselves, so the unbelievers say: This is a wonderful thing:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but they marvel that a warner has come to them from among them; and the unbelievers say, 'This is a marvellous thing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but they marvel that a warner of their own hath come unto them; and the disbelievers say: This is a strange thing:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, they are astonished that a warner should have come to them from among themselves. So these deniers of the truth say, \"This is indeed a strange thing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! they marvel that there hath come Unto them a warner from among themselves; so the infidels Say: this is a thing wondrous!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed they consider it odd that a warner from among themselves should have come to them. So the faithless say, ‘This is an odd thing.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they wonder that there has come to them a Warner from among themselves. So the Unbelievers say: \"This is a wonderful thing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, they wonder that there has come to them a warner (Muhammad SAW) from among themselves. So the disbelievers say: \"This is a strange thing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No, but they marvel that from among themselves a warner has come to them. The unbelievers say (in mockery): 'This is a marvelous thing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They marveled that a warner has come to them from among them. The disbelievers say, “This is something strange.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they wonder that there has come to them a warner from among themselves, and the disbelievers say, \"This is an amazing thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:2] Nay, but they consider it odd that there should have come to them a warner from among themselves, a messenger who is one of them, to threaten them with [the punishment of] the Fire after resurrection. So the disbelievers say, ‘This, warning, is an odd thing!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay, but they marvel) i.e. the Quraysh; and it is because they marvelled that Allah made this oath: they marvelled when they were told they will be resurrected after death; He said: in fact the Quraysh, among whom Ubayy and Umayyah the sons of Khalaf, Munbih and Nabih the son of Hajjaj, marvelled (that a warner) a warning messenger (of their own) from their own lineage (hath come unto them; and the disbelievers) the disbelievers of Mecca: Ubayy, Umayyah, Munbih and Nabih (say: This) which Muhammad (pbuh) says, i.e. that they will be resurrected after death, (is a strange thing) for he says: 604\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بَلْ عَجِبُوۤاْ } واستبعدوا أولئك الحمقى الجاهلون { أَن جَآءَهُمْ مُّنذِرٌ مِّنْهُمْ } أي: بعث إليهم رسول من جنسهم وبني نوعهم، ينذرهم عن أهوال يوم القيامة وأفزاعها مع أنهم منكرون للحشر وإرسال البشر جميعاً { فَقَالَ ٱلْكَافِرُونَ } المستبكرون بعدما سمعوا منك الدعو والإنذار من شدة إنكارهم واستبعادهم: { هَـٰذَا } أي: إرسال البشر إلى البشر، والإنذار من الحشر المحال كلامها { شَيْءٌ عَجِيبٌ } [ق: 2] وأمر بديع، ما سمعنا بهذا في آبائنا الأولين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n } الخ، أو: إنا أنزلناه إليك لِتُنذر به فلم يؤمنوا، { بل عَجِبوا أن جاءهم } أي: لأن جاءهم { مُنذر منهم } من جنسهم، لا من جنس الملائكة، أو: من جلدتهم، وهو إنكار لتعجّبهم مما ليس بعجب، وهو أن يُخوفهم من غضب الله رجلٌ منهم قد عرفوا عدالته وأمانته، ومَن كان كذلك لم يكن إلا ناصحاً لقومه، خائفاً أن ينالهم مكروه وإذا علم أن مخوفاً أظلهم لزمه أن ينذرهم، فكيف بما هو غاية المخاوف؟ أو إنكار لتعجُّبهم مما أنذرَهم به من البعث مع علمهم بقدرة الله تعالى على خلق السموات والأرض وما بينهما، وإقرارهم بالنشأة الأولى، مع شهادة العقل بأنه لا بدّ من الجزاء، وإلا كان إنشاء الخلق عبثاً، ثم بيَّن تعجُّبهم بقوله: { فقال الكافرون هذا شيءٌ عجيبٌ } أي: هذا الذي يقوله محمد من البعث بعد الموت شيءٌ عجيب، أو: كون محمد منذراً بالقرآن شيءٌ يُتعجب منه\n ووضع \" الكافرون \" موضع الضمير للدلالة على أنهم في قولهم هذا مُقدِمون على كفر عظيم",
      "translations": []
    }
  ]
}