{
  "chapter": "ق",
  "text": "ما يبدل القول لدى وما انا۠ بظلم للعبيد",
  "translations": [
    {
      "translation": "My Word, once given, is not subject to change and I do not wrong My slaves.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no changing of My word, nor am I unjust to My creatures.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Word is not changed; and never do I inflict the least wrong upon My servants.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No word is to be exchanged in My presence. I am not unjust to My servants\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“With Me, the decree does not change, and nor do I oppress the bondmen.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sentence that comes from Me cannot be changed, and I am not unjust to the servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My word shall not be changed, nor am I in the least unjust to the servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Word is not changed with Me; I wrong not My servants.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sentence that cometh from Me cannot be changed, and I am in no wise a tyrant unto the slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and My word shall not be changed, nor am I unjust to My servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Word will not be changed in My presence, nor am an oppressor at all Unto My bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The word [of judgement] is unalterable with Me, and I am not tyrannical to My servants.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Word changes not before Me, and I do not the least injustice to My Servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Sentence that comes from Me cannot be changed, and I am not unjust (to the least) to the slaves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Word cannot be changed with Me; I do not wrong My worshipers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The decree from Me will not be changed, and I am not unjust to the servants.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The word will not be changed with Me, and never will I be unjust to the servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:29] The word [that comes] from Me, in this respect, cannot be altered, and I am not unjust to servants’, that I should chastise them without any guilt [on their part] (zallām means dhū zulm, ‘one of injustice’, because of His words, There will be no injustice today [Q. 40:17]);\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The sentence that cometh from Me cannot be changed) My words cannot be changed through lying; and it is also said that this means: My decree concerning My salves will not be changed this Day; and it is also said that this means: words cannot be twisted in My presence, (and I am in nowise a tyrant unto the slaves) such that I would punish them without them having committed a crime.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وقد ثبت وصح تقديم الوعيد حيث أمكن انتفاعكم به لسلامة الآلات وبقاء الاستعداد، فلم تنتفعوا به ولم ترفعوا لذلك رأساً حتى ترسخت الهيئات المظلمةفي نفوسكم ورانت على قلوبكم وتحقق الحجاب وحق القول بالعذاب، فـ { ما يبدّل القول لدي } حينئذ لوجوب العذاب حال وقوعه { وما أنا بظلاّم } حيث وهبت الاستعداد وأنبأت على الكمال المناسب له وهديتكم إلى طريق اكستابه، بل أنتم الظلامون أنفسكم باكتساب ما ينافيه وإضاعة الاستعداد بوضع النور في الظلمة واستبدال ما يفنى بما يبقى",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ما يُبدّلُ القولُ لَدَيَّ } أي: لا تطمعوا أن يُبدل قولي ووعيدي بإدخال الكفار في النار، { وما أنا بظَلاَّمٍ للعبيد } فلا أُعذب عبداً بغير ذنب مِن قِبلَه، بل بما صدر منه من الجنايات، حسبنا أشير إليه آنفاً\n والتعبير عن بالظلم مع أن تعذيبهم بغير ذنب ليس بظلم على ما تقرر من قاعدة أهل السنة، فضلاً عن كونه ظلماً مفرطاً لتأكيد هذا المعنى، بإبراز ما ذكر من التعذيب بغير ذنب في معرض المبالغة في الظلم، وقيل: هو لرعاية جميعة العبيد، من قولهم: فلان ظالم لعبده وظلاّم لعبيده، وقيل: ظلاّم بمعنى: ذي ظلم، كلبّان لذي اللبن\n والله تعالى أعلم\n الإشارة: قرين الإنسان نَفْسُه الأمّارة ورُوحه المطمئنة، فإذا غلبت النفسُ على الروح وصرّفت صاحبها في الهوى، تقول يوم القيامة: هذا ما لديّ عتيد، مهيَّا للعتاب، فيقال لهما: ألقيا في نار القطيعة كلَّ كفّار للنعم، جحود لوجود الطبيب، منّاع للخير، فلم يصرفه فيما يخلصه من نفسه، معتدٍ على الله بتكبُّره، وعدم حط رأسه للداعي إلى الله، مُريب، قد لعبت به الشكوك والأوهام والخواطر، أو: شاك في وجود الطبيب، الذي جعل مع الله إلهاً آخر، يُحبه ويخضع له، من الهوى والدنيا، وكل ما أشركه مع الله في المحبة، فألقياه في العذاب الشديد: الحجب عن الله، وعدم اللحوق بأولياء الله، أو العذاب الحسي\n قال قرينه - روحه التي كانت سماوية، فصيّرها أرضية، بمتابعة هواه: ربنا ما أطغيته، فإنه ليس الإغواء والإطغاء من شأني، ولكن كان في ضلال بعيد، حيث أطاع نفسه وهواه، ورماني في مزابل الشهوات والغفلة، قال تعالى: { لا تختصموا لَدَيَّ } اليوم، قد قدمت إليكم بالوعيد، حيث قلت:\n\n[يوسف: 53]\n\n[الشمس: 9، 10] وقلت في شأن مَن جاهد نفسه، وردها لأصلها:\n\n[الفجر: 27] الآية، { ما يُبدلّ القولُ لَدَيَّ } فإني وعدت أهل المجاهدة بالوصول إلى حضرتي، والتنعُّم برؤيتي بقولي: { وَالَّذِينَ جَاهَدُواْ فِينَا\n\n\n } [العنكبوت: 69] الآية، وأهلَ الغفلة بالحجاب، بقولي:\n\n[المطففين: 14، 15]، وما ظلمت أحداً قط، لأن الظلم ليس من شأني، ولا يليق بمُلكي\n ثم ذكر اليوم الذي يظهر الوعد الوعيد، فقال: { يَوْمَ نَقُولُ لِجَهَنَّمَ هَلِ ٱمْتَلأَتِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:35",
      "similarity": 0.6442111617158738
    },
    {
      "verse": "43:4",
      "similarity": 0.5864635121117407
    },
    {
      "verse": "36:32",
      "similarity": 0.5075767097103071
    },
    {
      "verse": "18:91",
      "similarity": 0.5040574140068603
    },
    {
      "verse": "50:28",
      "similarity": 0.44002690699976793
    }
  ]
}