{
  "chapter": "ق",
  "text": "لقد كنت فى غفلة من هذا فكشفنا عنك غطاءك فبصرك اليوم حديد",
  "translations": [
    {
      "translation": "'You were heedless of this so We have stripped you of your covering and today your sight is sharp.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And the driver will say:) \"You were oblivious of this, so we have removed the veil, and how keen is your sight today!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You were heedless of this. Now We have removed your veil and so your vision today is sharp.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He will be told), \"You were completely heedless of this day. We have removed the veil from your eyes and your vision will now be sharp and strong\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“You were indeed neglectful of this, so We have removed the veil for you, and your eyesight is sharp this day.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It will be said to the sinners): \"Indeed you were heedless of this. Now We have removed from you, your covering, and sharp is your sight this Day!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly you were heedless of it, but now We have removed from you your veil, so your sight today is sharp.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou wast heedless of this; therefore We have now removed from thee thy covering, and so thy sight today is piercing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And unto the evil-doer it is said): Thou wast in heedlessness of this. Now We have removed from thee thy covering, and piercing is thy sight this day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You were heedless of this, but now We have removed your veil, so your sight today is sharp.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly thou wast in neglect thereof; now We have removed from off thee thy veil, so thy sight Today is piercing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[he will be told] ‘You were certainly oblivious of this. We have removed your veil from you, and so today your eyesight is acute.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It will be said:) \"Thou wast heedless of this; now have We removed thy veil, and sharp is thy sight this Day!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It will be said to the sinners): \"Indeed you were heedless of this, now We have removed your covering, and sharp is your sight this Day!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It will be said): 'Of this you have been heedless. Therefore, we have now removed your covering. Today your sight is sharp'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“You were in neglect of this, so We lifted your screen from you, and your vision today is keen.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[It will be said], \"You were certainly in unmindfulness of this, and We have removed from you your cover, so your sight, this Day, is sharp.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:22] ‘Verily, in the world, you were oblivious of this, that has befallen you on this day; So [now] We have   removed from you your covering, We have done away with your oblivion by what you witness on this day, and so your sight on this day is acute’, [it is] sharp, able to perceive what you used to reject in the world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thou wast) child of Adam (in heedlessness) in ignorance and oblivion (of this) Day. (Now We have removed from thee your covering) your works, that which was concealed from you in the life of the world, (and piercing is your sight this day) and it is also said that this means: your knowledge is thorough this day.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما حضر كل منهم بين يدي الله، قيل لكل منهم من قِبل الحق على سبيل الخطاب والعتاب: { لَّقَدْ كُنتَ } أيها المغرور { فِي غَفْلَةٍ مِّنْ هَـٰذَا } اليوم، وانكسار عظيم من وقوعه؛ لذلك كذبت بالرسل والكتب، واستهزأت بالهداة الثقات، واستكبرت عليهم { فَكَشَفْنَا } اليوم { عَنكَ غِطَآءَكَ } الذي هو سبب غفلتك وإنكارك، وتعاميك عن الآيات والنذر، وهو ألفك بالمحسوسات العادية وإنكارك على الأمور الغيبية الخارجة عن حيازة حواسك وقواك { فَبَصَرُكَ ٱلْيَوْمَ حَدِيدٌ } [ق: 22] أي: صار بصرك بعد انكشافك بهذا اليوم حاداً حديداً نافذاً، إلا أنه لا ينفعك حينئذ حدة بصرك واكشافك بعد انقراض نشأة الاختبار والاعتبار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قيل: السائق: كاتب الحسنات، والشاهد: كاتب السيئات، ويقال لها: { لقد كنتَ في غفلة من هذا } النازل بك اليوم، { فكشفنا عنك غِطاءك } فأزلنا غفلتك، وهو الوقوف مع المحسوسات والإلْف، والانهماك في الحظوظ، وقصر النظر عليها، فشاهدت اليومَ ما كنتَ غافلاً عنه { فبصرُكَ اليومَ حديدٌ } نافذة لزوال المانع\n جعلت الغفلة كأنها غطاء غطّى به جسده، أو غشاوة غطّى بها عينيه فهو لا يبصر شيئاً، فإذا كان يوم القيامة سقط، وزالت عنه الغفلة، وكشف غطاؤه، فبصر ما يبصره من الحق، ورجح بصره الكليل حديداً، لتيقُّظه حين لم ينفع التيفظ\n وبالله التوفيق\n الإشارة: هذه الآية وأشباهها أصل في مقام المراقبة القلبية، فينبغي للعبد أن يستحيي من الله أن يُحدِّث في نفسه بشيء يتسحيي أن يظهره، يعني الاسترسال معه، وإلا فالخواطر العارضة لا قدرة على دفعها\n قال القشيري: { ما توسوس به نفسُه } من شهوة تطلب استيفاءها، أو تصنُّع مع الخَلْق، أو سوء خُلُق، أو اعتقاد فاسد، أو غير ذلك من أوصاف النفس، توسوس بذلك لتشَوِّش عليه قلبه ووقته، وكيف لا نعلم ذلك وكُلُّ ذلك مما خلقناه وقدرناه\n هـ\n وقوله تعالى: { ونحن أقربُ إليه من حبل الوريد } أي: أنا أقرب إلى كل أحد من عروق قلبه، وهذا لأن قيام الفعل بالصفات، والصفات لا تُفارق الذات، فالقرب بالعلم والقدرة، وتستلزم القرب الذات، وقرب الحق من خلقه هو قرب المعاني من الأواني، إذ هي كليتها وقائمة بها، فافهم\n\n\nقال القشيري: وفي هذه الآية هَيْبَةٌ وفَزَعٌ لقوم، ورَوْحٌ وأُنْسٌ وسُكونُ قلبٍ لقوم\n هـ\n وقوله تعالى: { إذ يَتَلقى المتقليان\n\n\n } الخ، كأنّه تعالى يقول: مَن لم يعرف قدر قُربي منه، بأن يَعده وهمُه وجهلُه، فإني أوكل عليه رقيبين يحفظان أعماله لعله ينزجر\n وقوله تعالى: { ما يلفظ من قول\n\n\n } الخ، وأما عمل القلوب فاختص الله تعالى بعلمها، وهي محض الإخلاص\n قال بعضهم: الإخلاص: إخفاء العمل بحيث لم يطلع عليه ملك فيكتبه، ولا شيطان فيُفسده، فالعارفون جُلّ أعمالهم قلبية، نظرة أو فكرة\n رُوي أن بعض العارفين قال له حفظتُه: يا سيدي أظهر لنا شيئاً من أعمالك نفرح به عند الله، فقال لهم: يكفيكم الصلوات الخمس\n هـ\n قال القشيري: وفيه أيضاً إشارة إلى كمال عنايته في حق عباده، إذ جعل على كل واحد رقيبين من الملائكة ليحفظوه بالليل والنهار، إذا كان قاعداً فواحد عن يمينه وواحد عن شماله، وإذا قام فواحد عند رأسه، وواحدٌ عند قَدَمِه، وإذا كان ماشياً فواحدٌ بين يديه وواحد خَلْفه\n انظر بقيته\n هـ\n وهذان غير الملكين الموكلين بحفظ الأعمال\n والله أعلم\n وقال في قوله: { وجاءت سكرةُ الموت بالحق }: إذا أشرفت النفسُ على الخروج من الدنيا، فأحوالهم تختلف، فمنهم مَن يزداد في ذلك الوقت خوفُه، ولا يتبيّنُ حاله إلا عند ذهاب الروح، ومنهم مَن يُكَاشف قبلَ خروجه فتَسُكُن روحُه، يُحفظ عليه عَقْلُه، ويتم له حضورُه وتمييزُه، فسلَّم الروحَ على مَهَلٍ من غير استكراهٍ وعبوس منهم\n وفي معناه يقول بعضهم:\n\n{ ونُفخ في الصور ذلك يوم الوعيد } لكل نفس ما وعدها الله، بحسب سيرها من أول العمر إلى يوم البعث، { وجاءت كل نفس معها سائق } وهو الذي ساقها في مبدأ الوجود، إما سوقاً باللطف، أو سوقاً بالعنف عند قوله:\n\n \" هؤلاء إلى الجنة ولا أبالي وهؤلاء إلى النار ولا أبالي \" \n\n، وشهيد يشهد عليها بما جرى لها من الأحكام الأزلية { لقد كنتَ في غفلة من هذا } قال القشيري: يُشير إلى أن الإنسان، وإن خُلق من عالم الغيب والشهادة، فالغالب عليه في البداية الشهادة، وهو العالم الحسي، فيرى بالحواس الظاهرة العالَم المحسوس مع اختلاف أجناسه، وهو بمعزل عن إدراك عالم الغيب، فمن الناس يكشف له غطاؤه عن بصره بصيرته، فيجعل حديداً، يبصر رشده، ويحذر شره، وهم المؤمنون من أهل السعادة، ومنهم مَن يكشف له غطاء عن بصر بصيرته يوم القيامة يوم { لا ينفع نفساً إيمانها\n\n } الآية، وهم الكفار من أهل الشقاوة\n هـ\n ثم ذكر أحوالهم بعد البعث، فقال: { وَقَالَ قَرِينُهُ هَـٰذَا مَا لَدَيَّ عَتِيدٌ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:101",
      "similarity": 0.8474810564301822
    },
    {
      "verse": "44:12",
      "similarity": 0.14864718885227585
    },
    {
      "verse": "16:54",
      "similarity": 0.14208239287001612
    },
    {
      "verse": "53:58",
      "similarity": 0.1410891076583968
    },
    {
      "verse": "68:42",
      "similarity": 0.13911373516030515
    }
  ]
}