{
  "chapter": "ق",
  "text": "ما يبدل القول لدى وما انا۠ بظلم للعبيد",
  "translations": [
    {
      "translation": "My Word, once given, is not subject to change and I do not wrong My slaves.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no changing of My word, nor am I unjust to My creatures.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Word is not changed; and never do I inflict the least wrong upon My servants.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No word is to be exchanged in My presence. I am not unjust to My servants\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“With Me, the decree does not change, and nor do I oppress the bondmen.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sentence that comes from Me cannot be changed, and I am not unjust to the servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My word shall not be changed, nor am I in the least unjust to the servants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Word is not changed with Me; I wrong not My servants.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sentence that cometh from Me cannot be changed, and I am in no wise a tyrant unto the slaves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and My word shall not be changed, nor am I unjust to My servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Word will not be changed in My presence, nor am an oppressor at all Unto My bondmen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The word [of judgement] is unalterable with Me, and I am not tyrannical to My servants.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Word changes not before Me, and I do not the least injustice to My Servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Sentence that comes from Me cannot be changed, and I am not unjust (to the least) to the slaves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Word cannot be changed with Me; I do not wrong My worshipers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The decree from Me will not be changed, and I am not unjust to the servants.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The word will not be changed with Me, and never will I be unjust to the servants.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:29] The word [that comes] from Me, in this respect, cannot be altered, and I am not unjust to servants’, that I should chastise them without any guilt [on their part] (zallām means dhū zulm, ‘one of injustice’, because of His words, There will be no injustice today [Q. 40:17]);\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمَا يُبَدَّلُ الْقَوْلُ لَدَيَّ وَمَا أَنَا بِظَلَّامٍ لِلْعَبِيدِ (29(هذا حكاية كلام يصدر يومئذٍ من جانب الله تعالى للفريقين الذي اتَّبعوا والذين اتُّبعوا ، فالضمير عائد على غير مذكور في الكلام يدل عليه قوله : { فكشفنا عنكَ غطاءك } \\[ ق : 22 \\] .وعدم عطف فعل { قال } على ما قبله لوقوعه في معرض المقاولة ، والتعبير بصيغة الماضي لتحقق وقوعه فقد صارت المقاولة بين ثلاثةِ جوانب .والاختصام : المخاصمة وهو مصدر بصيغة الافتعال التي الأصل فيها أنها لمطاوعة بعض الأفعال فاستعملت للتفاعل مثل : اجتوروا واعتوروا واختصموا .والنهي عن المخاصمة بينهم يقتضي أن النفوس الكافرة ادعت أن قرناءها أطْغَوْها ، وأن القرناء تنصلوا من ذلك وأن النفوس أعادت رَمي قرنائها بذلك فصار خصاماً فلذلك قال الله تعالى : { لا تختصموا لدى } وطوي ذكره لدلالة { لا تختصموا } عليه إيثارا لحق الإيجاز في الكلام . والنهي عن الاختصام بعد وقوعه بتأويل النهي عن الدوام عليه ، أي كفوا عن الخصام .ومعنى النهي أن الخصام في ذلك لا جدوى له لأن استواء الفريقين في الكفر كاففٍ في مؤاخذة كليهما على السواء كما قال تعالى : { قالت أخراهم لأولاهم ربنا هؤلاء أضلونا فآتهم عذاباً ضعفاً من النار قال لكل ضعف ولكن لا تعلمون } \\[ الأعراف : 38 \\] ، وذلك كناية عن أن حكم الله عليهم قد تقرر فلا يفيدهم التخاصم لإلقاء التبعة على أحد الفريقين .ووجه استوائهما في العذاب أن الداعي إلى إضلاله قائم بما اشتهته نفسه من ترويج الباطل دون نظر في الدلائل الوزاعة عنه وأن متلقّي الباطل ممن دعاه إليه قائم بما اشتهته نفسه من الطاعة لأيمة الضلال فاستويا في الداعي وترتُّب أثره .والواو في { وقد قدمت } واو الحال . والجملة حال من ضمير { تختصموا } وهي حال معللة للنهي عن الاختصام .والمعنى : لا تطمعوا في أنّ تدافعكم في إلقاء التَبعة ينجيكم من العقاب بعد حال إنذاركم بالوعيد من وقت حياتكم فما اكترثتم بالوعيد فلا تلوموا إلا أنفسكم لأن من أنذر فقد أعذر .فقوله : { وقد قدمت إليكم بالوعيد } كناية عن عدم الانتفاع بالخصام كون العقاب عدلاً من الله . والباء في { بالوعيد } مزيدة للتأكيد كقوله : { وامسحوا برؤوسكم } \\[ المائدة : 6 \\] . والمعنى : وقد قدمت إليكم الوعيد قبل اليوم .والتقديم : جَعْل الشيء قدام غيره .والمراد به هنا : كونه سابقاً على المؤاخذة بالشرك لأن الله توعدهم بواسطة الرسول صلى الله عليه وسلم فالمعنى الأول المكنّى عنه بُيِّن بجملة { ما يبدل القول لدى } ، أي لست مبطلاً ذلك الوعيد ، وهو القول ، إذ الوعيد من نوع القول ، والتعريف للعهد ، أي فما أوعدتكم واقع لا محالة لأن الله تعهد أن لا يغفر لمن يشرك به ويموت على ذلك . والمعنى الثاني المكنَّى عنه بُين بجملة { وما أنا بظلام للعبيد } ، أي فلذلك قدمت إليكم الوعيد .والمبالغة التي في وصف { ظلاّم } راجعة إلى تأكيد النفي .والمراد : لا أظلم شيئاً من الظلم ، وليس المعنى : ما أنا بشديد الظلم كما قد يستفاد من توجُّه النفي إلى المقيّد يفيد أن يتوجه إلى القيد لأن ذلك أغلبي . والأكثر في نفي أمثلة المبالغة أن يقصد بالمبالغة مبالغة النفي ، قال طرفة :ولسْتُ بحَلاَّل التلاع مخافة ... ولكن متى يسترفد القوم أرفِدفإنه لا يريد نفي كثرة حلوله التلاع وإنما أراد كثرة النفي .وذكر الشيخ في «دلائل الإعجاز» توجه نفي الشيْء المقيد إلى خصوص القيد كتوجّه الإثبات سواء ، ولكن كلام التفتزاني في كتاب «المقاصد في أصول الدين» في مبحث رؤية الله تعالى أشار إلى استعمالين في ذلك ، فالأكثرُ أن النفي يتوجه إلى القيد فيكون المنفي القيد ، وقد يعتبر القيد قيداً للنفي وهذا هو التحقيق . على أني أرى أن عَدّ مثل صيغة المبالغة في عِداد القيود محل نظر فإن المعتبر من القيود هو ما كان لفظاً زائداً على اللفظ المنفي من صفة أو حال أو نحو ذلك ، ألا ترى أنه لا يحسن أن يقال : لست ظَلاّماً ، ولكن أظلم ، ويحسن أن يقال لا آتيك محارباً ولكن مسالماً .وقد أشار في «الكشاف» إلى أن إيثار وصف { ظَلاّم } هنا إيماء إلى أن المنفي لو كان غير منفي لكان ظلماً شديداً فيفهم منه أنه لو أخذ الجاني قبلَ أن يَعرَّف أن عمله جناية لكانت مؤاخذته بها ظلماً شديداً . ولعل صاحب «الكشاف» يرمي إلى مذهبه من استواء السيئات ، والتعبير بالعبيد دون التعبير بالناس ونحوه لزيادة تقرير معنى الظلم في نفوس الأمة ، أي لا أظلم ولو كان المظلوم عبدي فإذا كان الله الذي خلق العباد قد جعل مؤاخذة من لم يسبق له تشريع ظلماً فما بالك بمؤاخذة الناس بعضهم بعضاً بالتبعات دون تقدّم إليهم بالنهي من قبل ، ولذلك يقال : لا عقوبة إلا على عمل فيه قانون سابق قبل فعله .\n\n",
      "translations": [
        {
          "translation": "(The sentence that cometh from Me cannot be changed) My words cannot be changed through lying; and it is also said that this means: My decree concerning My salves will not be changed this Day; and it is also said that this means: words cannot be twisted in My presence, (and I am in nowise a tyrant unto the slaves) such that I would punish them without them having committed a crime.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما أنا بظَلاَّمٍ للعبيد } فلا أُعذب عبداً بغير ذنب مِن قِبلَه\n بل بما صدر منه من الجنايات\n حسبنا أشير إليه آنفاً\n والتعبير عن بالظلم مع أن تعذيبهم بغير ذنب ليس بظلم على ما تقرر من قاعدة أهل السنة\n فضلاً عن كونه ظلماً مفرطاً لتأكيد هذا المعنى\n بإبراز ما ذكر من التعذيب بغير ذنب في معرض المبالغة في الظلم\n وقيل: هو لرعاية جميعة العبيد\n من قولهم: فلان ظالم لعبده وظلاّم لعبيده\n وقيل: ظلاّم بمعنى: ذي ظلم\n كلبّان لذي اللبن\n والله تعالى أعلم\n الإشارة: قرين الإنسان نَفْسُه الأمّارة ورُوحه المطمئنة\n فإذا غلبت النفسُ على الروح وصرّفت صاحبها في الهوى\n تقول يوم القيامة: هذا ما لديّ عتيد\n مهيَّا للعتاب\n فيقال لهما: ألقيا في نار القطيعة كلَّ كفّار للنعم\n جحود لوجود الطبيب\n منّاع للخير\n فلم يصرفه فيما يخلصه من نفسه\n معتدٍ على الله بتكبُّره\n وعدم حط رأسه للداعي إلى الله\n مُريب\n قد لعبت به الشكوك والأوهام والخواطر\n أو: شاك في وجود الطبيب\n الذي جعل مع الله إلهاً آخر\n يُحبه ويخضع له\n من الهوى والدنيا\n وكل ما أشركه مع الله في المحبة\n فألقياه في العذاب الشديد: الحجب عن الله\n وعدم اللحوق بأولياء الله\n أو العذاب الحسي\n قال قرينه - روحه التي كانت سماوية\n فصيّرها أرضية\n بمتابعة هواه: ربنا ما أطغيته\n فإنه ليس الإغواء والإطغاء من شأني\n ولكن كان في ضلال بعيد\n حيث أطاع نفسه وهواه\n ورماني في مزابل الشهوات والغفلة\n قال تعالى: { لا تختصموا لَدَيَّ } اليوم\n قد قدمت إليكم بالوعيد\n حيث قلت:\n[يوسف: 53]\n[الشمس: 9\n 10] وقلت في شأن مَن جاهد نفسه\n وردها لأصلها:\n[الفجر: 27] الآية\n { ما يُبدلّ القولُ لَدَيَّ } فإني وعدت أهل المجاهدة بالوصول إلى حضرتي\n والتنعُّم برؤيتي بقولي: { وَالَّذِينَ جَاهَدُواْ فِينَا\n\n\n } [العنكبوت: 69] الآية\n وأهلَ الغفلة بالحجاب\n بقولي:\n[المطففين: 14\n 15]\n وما ظلمت أحداً قط\n لأن الظلم ليس من شأني\n ولا يليق بمُلكي\n ثم ذكر اليوم الذي يظهر الوعد الوعيد\n فقال: { يَوْمَ نَقُولُ لِجَهَنَّمَ هَلِ ٱمْتَلأَتِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:35",
      "similarity": 0.6442111617158738
    },
    {
      "verse": "43:4",
      "similarity": 0.5864635121117407
    },
    {
      "verse": "36:32",
      "similarity": 0.5075767097103071
    },
    {
      "verse": "18:91",
      "similarity": 0.5040574140068603
    },
    {
      "verse": "50:28",
      "similarity": 0.44002690699976793
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/050029.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/050029.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/50:29.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}