{
  "chapter": "ق",
  "text": "قال لا تختصموا۟ لدى وقد قدمت اليكم بالوعيد",
  "translations": [
    {
      "translation": "He will say, 'Do not argue in My presence when I gave you advance warning of the Threat.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not argue in My presence. I had announced the promise of doom in advance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It was said): “Do not remonstrate in My presence. I had warned you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord will say, \"Do not argue in My presence; I had certainly sent you a warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say, “Do not dispute before Me – I had already warned you of the punishment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) will say: \"Dispute not in front of Me, I had already in advance sent you the threat.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: Do not quarrel in My presence, and indeed I gave you the threatening beforehand:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He shall say, 'Dispute not before Me! For I sent you beforehand -- the threat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He saith: Contend not in My presence, when I had already proffered unto you the warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will say, \"Do not quarrel in My presence. I gave you the warning beforehand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will say: wrangle not in My presence, and had already proferred Unto you the threat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say, ‘Do not wrangle in My presence, for I had already warned you in advance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: \"Dispute not with each other in My Presence: I had already in advance sent you Warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will say: \"Dispute not in front of Me, I had already, in advance, sent you the threat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Allah) will say: 'Do not dispute before Me. I sent you a warning beforehand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say, “Do not feud in My presence—I had warned you in advance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah] will say, \"Do not dispute before Me, while I had already presented to you the warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:28] He, exalted be He, will say, ‘Do not dispute in My presence, in other words, disputing is of no use here, for I had already given you, in [the life of] the world, the threat, of chastisement in the Hereafter should you not believe, and so it is [now] inevitable.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَالَ لَا تَخْتَصِمُوا لَدَيَّ وَقَدْ قَدَّمْتُ إِلَيْكُمْ بِالْوَعِيدِ (28(\n\n",
      "translations": [
        {
          "translation": "(He saith) Allah says to them: (Contend not in My presence, when I had already proffered unto you the warning) I have informed you in the Scripture with which the Messenger was sent about this Day.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ولهذا قال: { لا تختصموا }\n ولما كان الأمران في وجوده هما العقلية والوهمية كان أصل التخاصم بينهما وكذا يقع التخاصم بين كل متحاورين متخاوضين في أمر لتوقع نفع أو لذة يتوافقان ما دام مطلوبهما حاصلاً\n فإذا حرما أو وقعا بسعيهما في خسران وعذاب\n تدارءا أو نسب كل منهما التسبب في ذلك إلى الآخر لاحتجابهما عن التوحيد وتبرىء كل منهما عن ذنبه لمحبة نفسه\n ولذلك قال حارثة رضي الله عنه للنبي صلى الله عليه وسلم: \" ورأيت أهل لنار يتعاورون \"\n وصوّب عليه السلام قوله وقول الشيطان: { ما أطغيته ولكن كان في ضلال بعيدٍ } \n كقوله:\n[ق\n الآية:22] لأنه لو لم يكن في ضلال عن طريق التوحيد بعيد عن الفطرة الأصلية بالتوجه إلى الجهة السفلية والتغشي بالغواشي المظلمة الطبيعية لم يقبل وسوسة الشيطان وقبل إلهام الملك\n فالذنب إنما يكون عليه بالاحتجاب عن نور الفطرة وكتساب الجنسية مع الشيطان في الظلمة\n والنهي عن الاختصام ليس المراد به انتهاؤهما بل عدم فائدته والاستماع إليه كأنه قال: لا اختصام مسموع عندي\n وقد ثبت وصح تقديم الوعيد حيث أمكن انتفاعكم به لسلامة الآلات وبقاء الاستعداد\n فلم تنتفعوا به ولم ترفعوا لذلك رأساً حتى ترسخت الهيئات المظلمةفي نفوسكم ورانت على قلوبكم وتحقق الحجاب وحق القول بالعذاب\n فـ { ما يبدّل القول لدي } حينئذ لوجوب العذاب حال وقوعه { وما أنا بظلاّم } حيث وهبت الاستعداد وأنبأت على الكمال المناسب له وهديتكم إلى طريق اكستابه\n بل أنتم الظلامون أنفسكم باكتساب ما ينافيه وإضاعة الاستعداد بوضع النور في الظلمة واستبدال ما يفنى بما يبقى",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n كأن قائلاً قال: فماذا قال الله تعالى لهم؟ قال: لا تختصموا عندي { وقد قَدَّمتُ إِليكم بالوعيد } في دار الكسب على ألسنة رسلي\n فلا تطمعوا في الخلاص منه بما أنتم فيه من التعلُّل بالمعاذير الباطلة\n والجملة فيها تعليل للنهي\n على معنى: لا تختصموا وقد صحّ عندكم أني قدمت إليكم بالوعيد حيث قالت: \" لأملأن جهنم\n\n\n \" الخ\n فاتبعتموه معرضين عن الحق\n فلا وجه للاختصام في هذا الوقت\n والباء إما مزيدة كما في قوله:\n[البقرة: 195] أو معدية على أن \" قَدَّم \" مضارع تقدم\n { ما يُبدّلُ القولُ لَدَيَّ } أي: لا تطمعوا أن يُبدل قولي ووعيدي بإدخال الكفار في النار",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:96",
      "similarity": 0.5915533161887093
    },
    {
      "verse": "39:31",
      "similarity": 0.5498072737458382
    },
    {
      "verse": "38:64",
      "similarity": 0.535931458337374
    },
    {
      "verse": "38:69",
      "similarity": 0.48090437500905464
    },
    {
      "verse": "50:35",
      "similarity": 0.4551488881059076
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/050028.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/050028.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/50:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}