{
  "chapter": "ق",
  "text": "قال قرينه ربنا ما اطغيته ولكن كان فى ضللۭ بعيد",
  "translations": [
    {
      "translation": "His inseparable comrade will say, 'Our Lord, I did not make him overstep the limits. He was, in any case, far astray.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion will say: \"O Lord, I did not lead him to wickedness, but he was himself far astray.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion said: “I did not incite him to rebel; he was far gone into error of his own accord.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His satanic companion will say, \"Our Lord, I did not mislead him, but he himself went astray\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His accompanying devil said, “Our Lord! I did not cause him to rebel, but he himself was in extreme error.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion (devil) will say: \"Our Lord! I did not push him to transgression, but he was himself in error far astray.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion will say: Our Lord! I did not lead him into inordinacy but he himself was in a great error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his comrade shall say, 'Our Lord, I made him not insolent, but he was in far error.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His comrade saith: Our Lord! I did not cause him to rebel, but he was (himself) far gone in error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and his associate [Satan] will say, \"Lord, I did not make him transgress, he had already gone far astray himself.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion will say: O our Lord! caused him not to transgress but he was himself in error far off.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion [devil] will say, ‘Our Lord! I did not incite him to rebel [against You], but he was [himself] in extreme error.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His Companion will say: \"Our Lord! I did not make him transgress, but he was (himself) far astray.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His companion (Satan devil)] will say: \"Our Lord! I did not push him to transgress, (in disbelief, oppression, and evil deeds) but he was himself in error far astray.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his companion shall say: 'Our Lord, I did not make him insolent, he was far astray'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His escort will say, “Our Lord, I did not make him rebel, but he was far astray.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His [devil] companion will say, \"Our Lord, I did not make him transgress, but he [himself] was in extreme error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:27] And his companion, Satan, will say, ‘Our Lord! I did not make him a rebel, I did [not] lead him astray, but he [himself] was in extreme error’, and so when I invited him [to disobedience] he heeded my call — for this one had said, ‘he [Satan] made me a rebel’, by way of his [Satan’s] invitation to him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(His comrade) the angel who recorded his evil deeds (saith: Our Lord! I did not cause him to rebel) \"I did not hasten to record his evil deeds nor did I record that which he has never said or done\"; this will be said when the disbeliever will claim that the angel hastened to write his evil deeds and recorded that which he never said or did. it is also said that his comrade is his devil who will plead with Allah that he did not cause him to rebel or err (but be was (himself) far gone in error) far from the Truth and guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قال قرينه ربّنا ما أطغيته } هذه المقاولات كلها معنوية مثلت على سبيل التخييل والتصوير لاستحكام المعنى في القلب عند ارتسام مثاله في الخيال، فادعاء الكافر الإطغاء على الشيطان وإنكار الشيطان إياه عبارة عن التنازع والتجاذب الواقع بين قوتيه الوهمية والعقلية، بل بين كل اثنتين متضادتين من قواه كالغضبية والشهوية مثلاً، ولهذا قال: { لا تختصموا }\n ولما كان الأمران في وجوده هما العقلية والوهمية كان أصل التخاصم بينهما وكذا يقع التخاصم بين كل متحاورين متخاوضين في أمر لتوقع نفع أو لذة يتوافقان ما دام مطلوبهما حاصلاً، فإذا حرما أو وقعا بسعيهما في خسران وعذاب، تدارءا أو نسب كل منهما التسبب في ذلك إلى الآخر لاحتجابهما عن التوحيد وتبرىء كل منهما عن ذنبه لمحبة نفسه، ولذلك قال حارثة رضي الله عنه للنبي صلى الله عليه وسلم: \" ورأيت أهل لنار يتعاورون \"\n وصوّب عليه السلام قوله وقول الشيطان: { ما أطغيته ولكن كان في ضلال بعيدٍ } ، كقوله:\n\n[ق، الآية:22] لأنه لو لم يكن في ضلال عن طريق التوحيد بعيد عن الفطرة الأصلية بالتوجه إلى الجهة السفلية والتغشي بالغواشي المظلمة الطبيعية لم يقبل وسوسة الشيطان وقبل إلهام الملك، فالذنب إنما يكون عليه بالاحتجاب عن نور الفطرة وكتساب الجنسية مع الشيطان في الظلمة، والنهي عن الاختصام ليس المراد به انتهاؤهما بل عدم فائدته والاستماع إليه كأنه قال: لا اختصام مسموع عندي",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أراد الموكلان أن يبطشا به ويجراه نحو النار، أخذ يصرخ ونسيب شركه وضلاله إلى الشيطان المضل المغوي، وهو حاضر عنده، وبعدما سمع الشيطان منه ما سمع { قَالَ } له حينئذ { قرِينُهُ } أي: الشيطان، متضرعاً إلى الله، مناجياً معه: { رَبَّنَا مَآ أَطْغَيْتُهُ } وأضللته { وَلَـٰكِن كَانَ } في نفسه { فِي ضَلاَلٍ بَعِيدٍ } [ق: 27] بمراحل عن الهداية بمقتضى أهويته وأمانيه الفاسدة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال قرينُه } أي: شيطانه الذي قُرن به، وهذا يؤيد أن المراد بالمتقدم جنس القرين، وإنما أُخليت هذه الجملة من الواو دون الأولى لأن الأولى واجب عطفها للدلالة على الجمع بين معناها ومعنى ما قبلها في الحصول، أي: مجيء كل نفس مع ملكين وقول قرينه ما قال له، وأما هذه فهي مستأنفة، كما تستأنف الجمل الواقعة في حكاية التقاول، كما في مقاولة موسى وفرعون في وقوله:\n\n[الشعراء: 23 - 31] إلى آخر الآيات، فكأن الكافر قال: هو أطغاني، فأجابه قرينُه بتكذيبه فقال: { ربنا ما أطغيتُه ولكن كان في ضلال بعيد } عن الحق، أي: ما أوقعته في الطغيان بالقهر، ولكن طغى واختار الضلالة على الهدى، وهذا كقوله:\n\n[إبراهيم: 22]، فالوسوسة والتزيين حاصل منه، والاختيار من الكافر، والفعل لله، لا يُسأل عما يفعل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:51",
      "similarity": 0.5645948830707067
    },
    {
      "verse": "23:31",
      "similarity": 0.42571405029033327
    },
    {
      "verse": "23:42",
      "similarity": 0.42571405029033327
    },
    {
      "verse": "79:37",
      "similarity": 0.414849391294912
    },
    {
      "verse": "68:31",
      "similarity": 0.4051201659794486
    }
  ]
}