{
  "chapter": "ق",
  "text": "اءذا متنا وكنا ترابا ذلك رجعۢ بعيد",
  "translations": [
    {
      "translation": "When we are dead and turned to dust . . . ? That would be a most unlikely return!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When we are dead and turned to dust, this returning (to life) is most far-fetched.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! When we are dead and reduced to mere dust, (shall we be raised to life)? Such a return is far-fetched.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that after we die and become dust, we shall be brought back to life again. This seems far from reality\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“When we are dead and have turned to dust, will we be raised again? That return is impossible!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When we are dead and have become dust. (Shall we be resurrected) That is a far return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! when we are dead and have become dust? That is afar (from probable) return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, when we are dead and become dust? That is a far returning!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When we are dead and have become dust (shall we be brought back again)? That would be a far return!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to come back to life after we have died and become dust? That is most improbable!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shell We be brought back when we are dead and have become dust? That is a return remote!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘What! When we are dead and have become dust, [shall we be raised again]? That is a far-fetched return!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! When we die and become dust, (shall we live again?) That is a (sort of) return far (from our understanding).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When we are dead and have become dust (shall we be resurrected?) That is a far return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, when we are dead and turned to dust? That indeed would be an unlikely return'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When we have died and become dust? This is a farfetched return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When we have died and have become dust, [we will return to life]? That is a distant return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:3] What! (read a-idhā pronouncing both hamzas, or not pronouncing the second, but inserting an alif between the two in both cases) When we are dead and have become dust?, shall we return [to life]? That is a farfetched return!’, [an event that is] extremely remote.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When we are dead and have become dust (shall we be brought back again)? That) which Muhammad claims (would be a far return!) will never happen; thus denying resurrection after death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ذَلِكَ رَجْعٌ بَعِيدٌ } معناه رَدٌّ بَعيدٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم فصَّلوا ما أجملوا على سبيل التعجب والإنكار، فقالوا مستفهمين، ومستفيدين فيما بينهم، مستعيذين: { أَءِذَا مِتْنَا } أي: أنرجع ونعود أحياء كما كنا إذا متنا { وَكُنَّا تُرَاباً } وهباء منبثاً { ذَلِكَ } العود والرجوع { رَجْعٌ بَعِيدٌ } [ق: 3] عن الوقوع وقبول العقول\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قالوا: { أئِذا متنا وكنا تُراباً } أي: أنُبعث حين نموت ونصير تراباً كما يقوله هذا النذير؟ { ذلك رجع بعيد } أي: ذلك البعث بعد هذه الحالة رجوع مستبعَد، منكَر، بعيد من الوهم والعادة\n فالعامل في \" إذا \" محذوف مفهوم من الكلام كما قدرنا\n قال تعالى: { قد عَلِما ما تنقصُ الأرضُ منهم } وهو ردّ لاستبعادهم فإنَّ مَن عمّ علمه ولطفه حتى ينتهي إلى حيث علم ما تنقص الأرضُ من أجساد الموتى، وتأكل من لحومهم وعظمهم، كيف يستبعد رجعه إياهم أحياء كما كانوا؟! عن النبي صلى الله عليه وسلم:\n\n \" كلُّ ابن آدم يأكله التراب إلا عَجْبُ الذَّنَب، ومنه خُلق، وفيه يُرَكَّب \" \n\n \n\nوهو العُصْعص، وقال في المصباح: العَجْب - كفلْس - من كل دابة: ما انضم عليه الورِك من أصل الذَّنَب\n هـ\n وهو عَظم صغير قدر الحمصة، لا تأكله الأرض، كما لا تأكل أجساد الأنبياء والأولياء والشهداء\n قال ابن عطية: حفظ ما تنقص الأرض إنما هو لِيعود بعينه يوم القيامة، وهذا هو الحق\n وذهب بعض الأصوليين إلى أن الأجساد المبعوثة يجوز أن تكون غير هذه، هذا عندي خلاف ظاهر كتاب الله، ولو كانت غيرها كيف كانت تشهد الجلود والأيدي ولأرجل على الكفرة؟ إلى غير ذلك مما يقتضي أن أسجاد الدنيا هي التي تعود\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:53",
      "similarity": 0.7688304365679297
    },
    {
      "verse": "23:35",
      "similarity": 0.7497505761541646
    },
    {
      "verse": "37:16",
      "similarity": 0.7484770781903498
    },
    {
      "verse": "23:82",
      "similarity": 0.7450246443803977
    },
    {
      "verse": "56:47",
      "similarity": 0.7450246443803977
    }
  ]
}