{
  "chapter": "ق",
  "text": "لهم ما يشاءون فيها ولدينا مزيد",
  "translations": [
    {
      "translation": "Theirs will be whatsoever they wish: And with Us there is more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein they shall get whatever they desire; and with Us there is even more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have therein whatever they want and will receive from Us more rewards\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In it for them is all that they may desire, and with Us is more than it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There they will have all that they desire -- and We have more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have therein what they wish and with Us is more yet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein they shall have whatever they will; and with Us there is yet more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There they have all that they desire, and there is more with Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There they shall have all that they desire, and there is even more with Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Theirs therein will be whatsoever they list; and with Us will be yet more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There they will have whatever they wish, and with Us there is yet more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will be for them therein all that they wish,- and more besides in Our Presence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There they will have all that they desire, and We have more (for them, i.e. a glance at the All-Mighty, All-Majestic).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There they have all that they desire, and with Us is much more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein they will have whatever they desire—and We have even more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have whatever they wish therein, and with Us is more.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:35] Therein they will have whatever they wish; and with Us there is yet more, as extra for what they did and for what they will request.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(There) in Paradise (they have all that they desire, and there is more with Us) i.e. beholding Allah's Countenance; and it is said that this means: in every hour and in every day, they have with Us an increase in honour and reward.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَهُم مَّا يَشَآءُونَ فِيهَا وَلَدَيْنَا مَزِيدٌ } قال الإِمام زيد بن علي عليهما السَّلامُ: إِنَّ الرَّجلَ يَسكنُ فِي الجَنةِ سَبعينَ سَنةً قَبلَ أَنْ يَتحولَ، ثُمَّ تأتيهِ امرأةٌ فتَضرِبُ عَلى مَنكبِهِ، وَتَنظرُ فَي وَجهِهِ، فَخدُها أَضاءَ من المِرآةِ! وإِنَّ أَدنى لُؤلؤةٍ عَلَيها تُضِيءُ ما بينَ المَشرقِ والمَغربِ\n فتسلمُ عَليهِ، فيرُدُ عليها السَّلامُ\n ويسألُها مَنْ أَنتِ، فتقولُ أنا من المَزيدِ\n ويكونَ عَلَيها سَبعونَ ثَوباً أَدناها مِثل شَقائقِ النُّعمانِ مَن طُوبى يَنفذُها بَصرُهُ حتَّى يَرى مُخَّ سَاقِها من وراءِ ذَلكَ\n وإنَّ عَلَيها لَتيجاناً أَدنى لؤلؤةٍ مِنها تُضيءُ ما بينَ المَشرقِ والمَغربِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { لَهُم مَّا يَشَآءُونَ فِيهَا } من اللذات الحسية والعقلية المحاطة بمداركهم وآلاتهم، بل { وَلَدَيْنَا مَزِيدٌ } [ق: 35] على ما يسألون حسب استعداداتهم، مما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقيل: إن السحاب تمر باهل الجنة فتمطر عليهم الحور، فتقول: نحن المزيد الذي قال تعالى: { ولدينا مزيد } قلت: مزيد كل واحد على قدر همته وشهوته\n والله تعالى أعلم\n الإشارة: يوم يقول لجهنم: هل امتلأت؟ وتقول: هل من مزيد، كذلك النفس، نار شهوّاتها مشتعلة كلما أعطيتها شيئاً من حظوظها طلب المزيد، ولا يملأ جوف ابن آدم إلا التراب، ويتوب الله على مَن تاب، وفي الحديث:\n\n \" اثنان لا يشبعان: طالب الدنيا وطالب علم، طالب الدنيا يزداد من الله بُعداً، وطالب العلم يزداد من الله رضاً وقُرباً \" \n\nأو كما قال صلى الله عليه وسلم\n واعلم أن الروح إذا عشقت شيئاً فإن كان من الدنيا يُسمى حرصاً، وإن كان في جانب الحق سُمي محبة وشوقاً، وفي الحقيقة ما هي إلا محبة واحدة، إلا أنها لما تاهت انقلبت محبتها للفروقات الحسية، وغابت عن المعاني الأزلية، وكلما زاد في الحرص نقص في المحبة، وما نقص من الحرص زاد في المحبة\n ويقال: كلما زادت محبة الحس نقصت المعنى، وبالعكس، وإذا اشتعلت نار المحبة فلا تسكن بما يلقى فيها من الأمور الحسية، كانت حظوظاً أو حقوقاً، بل كلما ألقي فيها تقول: هل من مزيد، حتى يضع الجبار قدمه، وهو قذف نور معرفته في القلب، فحينئذ يحصل الفناء وتقول: قط قط\n\n\nثم أخبر عن حال المؤمنين بقوله: { وأُزلفت الجنة للمتقين } أي: قربت جنة المعارف إلى قلوب خواص المتقين، الذي اتقوا ما سوى الله، فقربت منهم، ودَخَلوها في الدنيا، فإذا كان يوم القيامة قربت إليهم الجنة الحسية في المحشر، فيركبون في قصورها وغرفها، وتطير بهم إلى الجنة، فلا يسحون بالصراط ولا بالنار، وفيهم قال تعالى:\n\n[الأنبياء: 102] والناس على ثلاثة أصناف: قوم يُحشرون إلى الجنة مشاة، وهم الذين قال الله فيهم:\n\n[الزمر: 73] وهم عوام المؤمنين، وقوم يُحشرون إلى الجنة ركباناً على طاعتهم، المصورة لهم على صورة المراكب، وهؤلاء الخواص من العباد والزهّاد والعلماء والصالحين، وأما خواص الخواص، وهم العارفون ومَن تعلق بهم، فهم الذين قال الله فيهم: { وأزلفت الجنة للمتقين } تُقرب منهم، فيركبون فيها، ويسرحون إلى الجنة\n انظر القشيري\n وقوله تعالى: { هذا ما توعدون } الإشارة إلى مقعد صدق، ولو كان إلى الجنة لقال \" هذه \"\n قال القشيري\n ثم وصف أهل هذا المقام بقوله: { لكل أواب حفيظ } أي: راجع إلى الله في جميع أموره، لا يعرف غيره، ولا يلتجئ إلا إليه، حفيظ لأنفاسه مع الله، لا يصرفها إلا في طلب الله، مَنْ خَشِيَ الرحمنَ بالغيب، أي: بنور الغيب يشاهد شواهد الحق، فيخشى بُعده أو حجبه\n قال القشيري: والخشية تكون مقرونة بالأُنس، ولذلك لم يقل: مَن خشي الجبار\n ثم قال: والخشية من الرحمن خشية الفراق، ويقال: هو مقتضى علمه بأنه يفعل ما يشاء، لا يُسأل عما يفعل، ويقال: الخشية ألطف من الخوف، فكأنها قريبة من الهيبة\n هـ { وجاء بقلب منيب } مقبل على الله بكليته، معرض عما سواه، { ادخلوها } جنة المعارف { بسلام } من العيوب، آمنين من السلب والرجوع، وهذا قوله { ذلك يوم الخلود } فيها، لهم ما يشاؤون من فنون المكاشفات، ولذيذ المشاهدات، ولدينا مزيد، زيادة ترقي أبداً سرمداً، جعلنا الله من هذا القبيل في الرعيل الأول، آمين\n ثم رجع إلى تهديد الكفرة، فقال: { وَكَمْ أَهْلَكْنَا قَبْلَهُمْ مِّن قَرْنٍ }\n\n",
      "translations": []
    }
  ]
}