{
  "chapter": "ق",
  "text": "ان فى ذلك لذكرى لمن كان له قلب او القى السمع وهو شهيد",
  "translations": [
    {
      "translation": "There is a reminder in that for anyone who has a heart, or who listens well, having seen the evidence.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely there is a reminder in this for whosoever has a heart (to feel), or takes heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily there is a lesson in this for everyone who has a (sound) heart and who listens with an attentive mind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a reminder for everyone who understands, listens, and sees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in this is an advice for anyone who keeps a heart, or listens attentively.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, therein is indeed a reminder for him who has a heart or gives ear while he is heedful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely there is a reminder in this for him who has a heart or he gives ear and is a witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely in that there is a reminder to him who has a heart, or will give ear with a present mind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! therein verily is a reminder for him who hath a heart, or giveth ear with full intelligence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is truly a reminder in this for whoever has a heart, whoever listens attentively.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily herein is an admonition Unto him who hath a heart, or giveth ear while he is heedful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is indeed an admonition in that for one who has a heart, or gives ear, being attentive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily in this is a Message for any that has a heart and understanding or who gives ear and earnestly witnesses (the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, therein is indeed a reminder for him who has a heart or gives ear while he is heedful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, in this there is a Reminder for he who has a heart or listens attentively while witnessing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that is a reminder for whoever possesses a heart, or cares to listen and witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in that is a reminder for whoever has a heart or who listens while he is present [in mind].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:37] Assuredly there is in that, which is mentioned, a reminder, an admonition, for him who has a heart, a mind, or gives ear, [or] listens to admonitions, in [full] witness, present in heart [and mind].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Therein) in that which was done with them (verily is a reminder) for your folk (for him who hath a heart) a living heart, (or giveth ear) or listens to the Qur'an (with full intelligence) with focus and not absentmindedly.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ فِي ذَلِكَ لَذِكْرَىٰ لِمَن كَانَ لَهُ قَلْبٌ } أي عَقلٌ\n\n\n\n\nوقوله تعالى: { أَوْ أَلْقَى ٱلسَّمْعَ } معناه استمعَ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Indeed in that is a reminder for whoever has a heart} [means] whoever has a mind.\n\n\nAnd His saying, \"Or he has given hearing,\" its meaning is \"listened.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n الذي نزل عليك يا أكمل الرسل { لَذِكْرَىٰ } عظة وتذكيراً وعبرة وتنبيهاً { لِمَن كَانَ لَهُ قَلْبٌ } يتفطن من تقلبات الأحوال وتطوراتها إلى شئون الحق وتجلياته الجمالية والجلالية حسب اقتضاء الذات بالإدارة والاختيار\n وكمالات الأسماء والصفات { أَوْ أَلْقَى ٱلسَّمْعَ } أي: يكون من أرباب الإرادة الصادقة الخالصة عن شوب السمعة ورعونات الرياء\n ألقى سمعه إلى استماع كلمة الحق من أهله { وَهُوَ } حينئذ { شَهِيدٌ } [ق: 37] حاضر القلب\n فارغ الهم\n حديد الفطنة\n صحيح الإرادة\n خالص العزيمة\n\n\nثم لما قال اليهود: إن الله خلق العالم في ستة أيام من الأسبوع\n وبعدما عيّ من الخلق والإيجاد استلقى على العرش في يوم الست للاستراحة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنَّ في ذلك } أي: فيما ذكر من قصصهم، أو: فيما ذكر في السورة { لَذِكرى } لتذكرة وعظة { لمَن كان له قلبٌ } سليم واعٍ يُدرك كنه ما يشاهده من الأمور، ويتفكّر فيها، ليعلم أن مدار دمارهم هو الكفر، فيرتدع عنه بمجرد مشاهدة الآثار من غير تذكير، { أو أَلقى السمعَ } أي: أصغى بقلبه إلى ما يتلى عليه من الوحي الناطق بما جرى عليهم، فإن مَن فعله يقف على كنه الأمر، فينزجر عما يؤدي إليه من الكفر والمعاصي، يقال: ألق إليَّ سمعَك، أي: استمع، فـ \" أو \" لمنع الخلو، لا لمنع الجمع، فإن إلقاء السمع لا يجدي بدون سلامة القلب عما ذكر من الصفات، للإذان بأن مَن عَرَى قلبه عنهما كمَن لا قلب له أصلاً\n وقوله تعالى: { وهو شهيد } حال، أي: والحال أنه حاضر القلب لا يغفل أو: شاهد على ما يقرأ من كتاب الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:5",
      "similarity": 0.4328308681989766
    },
    {
      "verse": "26:223",
      "similarity": 0.43083413744272686
    },
    {
      "verse": "100:7",
      "similarity": 0.3941625913623764
    },
    {
      "verse": "85:3",
      "similarity": 0.33874651936804523
    },
    {
      "verse": "70:33",
      "similarity": 0.3192876947744958
    }
  ]
}