{
  "chapter": "ق",
  "text": "وكم اهلكنا قبلهم من قرن هم اشد منهم بطشا فنقبوا۟ فى البلد هل من محيص",
  "translations": [
    {
      "translation": "How many generations before them We destroyed who had greater force than them and scoured many lands! Did they find any way of escape?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations have We destroyed before them who were mightier in power than they. Then they searched throughout the land to see if there was a way of escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a nation did We destroy before them that were stronger in prowess than these. They searched about the lands of the world. But could they find a refuge?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many an ancient town who were much stronger than them (unbelievers) did We destroy. (In vain), they wandered through the land in search of a place of refuge from Our torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many a generation We did destroy before them, who exceeded them in strength, therefore venturing in the cities! Is there a place to escape?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a generation We have destroyed before them who were stronger in power than they. And they went about the land! Could they find any place of refuge\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a generation did We destroy before them who were mightier in prowess than they, so they went about and about in the lands. Is there a place of refuge?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a generation We destroyed before them that was stronger in valour than they, then they searched about in the land; was there any asylum?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a generation We destroyed before them, who were mightier than these in prowess so that they overran the lands! Had they any place of refuge (when the judgment came)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a generation, far greater in prowess, have We destroyed before them! They searched the entire land: but could they find a refuge?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a generation have We destroyed before them, who were mightier in power than they, and they traversed the cities! No place of refuge could they find.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations We have destroyed before them, who were stronger than these, insomuch that they ransacked the towns?! So, is there any escape [from Allah’s punishment]?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But how many generations before them did We destroy (for their sins),- stronger in power than they? Then did they wander through the land: was there any place of escape (for them)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a generation We have destroyed before them, who were stronger in power than them, and (when Our Torment came) they ran for a refuge in the land! Could they find any place of refuge (for them to save themselves from destruction)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations, stronger in might than they have We destroyed before them! They searched the land, could they find any asylum?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many generations before them, who were more powerful than they, did We destroy? They explored the lands—was there any escape?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a generation before them did We destroy who were greater than them in [striking] power and had explored throughout the lands. Is there any place of escape?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:36] And how many a generation We destroyed before them, that is, before the disbelievers of Quraysh We destroyed many generations of disbelievers, who were mightier than these in prowess, and [who] then searched throughout the land [wondering]: is there any escape?, for them and others from death, but they found none.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And how many a generation) past generation (We destroyed before them) before your folk, (who were mightier than these) than your folk (in prowess) in physical strength (so that they overran the lands!) they moved about and travelled for their trade (Had they any place of refuge) or escape from Our chastisement? And it is also said this means: is there anyone of them left?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَنَقَّبُواْ فِي ٱلْبِلاَدِ } معناه تَباعدُوا فيهِ\n\n\n\n\nوقوله تعالى: { هَلْ مِن مَّحِيصٍ } أي هل منَ مَعدلٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"So roam the land,\" means that you should keep away from it.\n\n\nAnd His saying, {Is there any [city] that is safe?} [i.e. Is there any city that is not subject to destruction?]",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه تهديداً على من أعرض عن دينه ونبيه: { وَكَمْ أَهْلَكْنَا قَبْلَهُمْ } أي: قبل قومك يا أكمل الرسل { مِّن قَرْنٍ } أي: أهله\n مع أنه { هُمْ أَشَدُّ مِنْهُم بَطْشاً } قوة وقدرة\n وأكثر أموالاً وأولاداً\n كعاد وثمود وفرعون وغيرهم { فَنَقَّبُواْ } أي: انصرفوا وانقبلوا وساروا { فِي ٱلْبِلاَدِ } متمنين { هَلْ } يجدون { مِن مَّحِيصٍ } [ق: 36] مهرب ومخلص من بطش الله وحلول عذابه عليهم\n فلم يجدوا بعدما استحقوا التعذيب والإهلاك\n وبالآخرة هلكوا واستؤصلوا حتماً\n فكذا هؤلاء المسرفون المعاندون سيهلكون كما هلكوا\n وبالجملة: { إِنَّ فِي ذَلِكَ } القرآن العظيم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وكم أهلكنا قبلهم } قبل قومك { من قَرْنٍ } من القرون الذين كذَّبوا رسلهم { هم أشدُّ منهم } من قومك { بطشاً } قوة وسطوة\n { فنَقَّبوا في البلاد } أي: خرّبوا وطافوا وتصرّفوا في أقطارها\n وجالوا في أكناف الأرض كل مجال حذرا من الموت { هل } وجدوا { من مَحيص } أي: مهرب منها؟ بل لَحِقَتهم ودقت أعناقهم\n أو: هل وجدوا من مهرب من أمر الله وقضائه؟ وأصل التنقيب والنقب: البحث والطلب\n قال امرؤ القيس:\nودخلت الفاء للتسبُّب عن قوله: { هم أشد منهم بطشاً } أي: شدة بطشهم\n أي: قدرتهم على التنقيب في البلاد\n ويجوز أن يعود الضمير إلى أهل مكة\n أي: ساروا في أسفارهم ومسايرهم في بلد القرون\n فهل روأوا لهم محيصاً حتى يُؤملوا مثله أنفسهم؟ ويؤيدهم قراءة مَن قرأ فنَقِّبوا على صيغة الأمر\n { إِنَّ في ذلك } أي: فيما ذكر من قصصهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:97",
      "similarity": 0.5599814053483769
    },
    {
      "verse": "41:48",
      "similarity": 0.38231816168229305
    },
    {
      "verse": "42:35",
      "similarity": 0.3749302361975973
    },
    {
      "verse": "4:121",
      "similarity": 0.3687055292618187
    },
    {
      "verse": "5:12",
      "similarity": 0.34033747904462947
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/50:36.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/50:36.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/50:36.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}