{
  "chapter": "ق",
  "text": "من خشى الرحمن بالغيب وجاء بقلب منيب",
  "translations": [
    {
      "translation": "those who fear the All-Merciful in the Unseen and come with a contrite heart.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who feared Ar-Rahman in secret, and came with a penitent heart:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to everyone who feared the Merciful One though He is beyond the reach of perception, to everyone who has come with a heart ever wont to turn (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "feared the Beneficent God in secret, and turned to Him with a repenting heart\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who fears the Most Gracious without seeing, and came with a heart that inclines.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who feared Ar-Rahman unseen and brought a heart turned in repentance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who fears the Beneficent Allah in secret and comes with a penitent heart:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever fears the All-merciful in the Unseen, and comes with a penitent heart:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who feareth the Beneficent in secret and cometh with a contrite heart.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who fears the Compassionate One, though He is unseen, and comes to Him with a penitent heart;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That feareth the Compassionate in the unseen and cometh to Him with a heart penitent:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who fears the All-beneficent in secret and comes with a penitent heart.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who feared (Allah) Most Gracious Unseen, and brought a heart turned in devotion (to Him):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who feared the Most Beneficent (Allah) in the Ghaib (unseen): (i.e. in this worldly life before seeing and meeting Him), and brought a heart turned in repentance (to Him - and absolutely free from each and every kind of polytheism),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever fears the Merciful in the Unseen, and comes with a contrite heart.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who inwardly feared the Most Gracious, and came with a repentant heart.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who feared the Most Merciful unseen and came with a heart returning [in repentance].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:33] who fears the Compassionate One [while He is] in the Unseen, [the one who] fears Him without having seen Him, and comes with a penitent heart’, [a heart] eagerly applying itself to obedience of Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who feareth the Beneficent in secret) who strives for the Beneficent even he has not seen Him (and cometh with a contrite heart) sincere in his worship and profession of Allah's divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { مَّنْ خَشِيَ ٱلرَّحْمَـٰنَ بِٱلْغَيْبِ } واجتنب عن محارمه منهياته، خائفاً من سخطه، راجياً من سعة رحمته في نشأة الاعتبار والاختيار قبل انكشاف السرائر والأستار وحلول النشأة الأخرى، ورضي بالتكاليف الإلهية، ووطن نفسه بامتثال عموم الأوامر والنواهي ومطلق الأحكام الجارية على ألسنة الرسل والكتب { وَجَآءَ بِقَلْبٍ مُّنِيبٍ } [ق: 33] إلى الله، مخلصاً في إطاعة الله وإطاعة رسوله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله تعالى: { بالغيب } حال من فاعل \" خشي \" ، أو من مفعوله، أو صفة لمصدره، أي: خشية ملتبسة بالغيب، حيث خشي عقابه وهو غائب عنه، وخشي الرحمن وهو غائب عن الأعين في رداء الكبرياء، لا تراه الأعين الحسية الحادثة، والتعرُّض لعنوان الرحمن للثناء البليغ على الخاشي، حيث خشيَه مع علمه بسعة رحمته، فلم يصدهم علمهم بسعة رحمته عن خوفه تعالى، أو: للإشعار بأنهم مع خشيتهم عقابه راجون رحمته\n { وجاء بقلب منيب } راجع إلى الله، أو سريرةٍ مَرضيةٍ، وعقيدةٍ صحيحة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:8",
      "similarity": 0.5988913273619314
    },
    {
      "verse": "30:31",
      "similarity": 0.5758670701020994
    },
    {
      "verse": "40:13",
      "similarity": 0.5728012559447078
    },
    {
      "verse": "39:54",
      "similarity": 0.5617031477085628
    },
    {
      "verse": "13:27",
      "similarity": 0.5406000085203067
    }
  ]
}