{
  "chapter": "ق",
  "text": "نحن اعلم بما يقولون وما انت عليهم بجبار فذكر بالقرءان من يخاف وعيد",
  "translations": [
    {
      "translation": "We are cognisant of what they say; but it is not for you to compel them. So keep on reminding through the Qur'an whoever fears My warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), We are well aware of what they say; and you are not required to force things on them. So exhort with the Qur'an all those who fear My warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know best what they say and you cannot compel them. Remind, by way of the Quran, those who have fear of My warnings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We well know what they say (O dear Prophet Mohammed – peace and blessings be upon him), and you are not one to use force over them; therefore advise him with the Qur’an, whoever fears My threat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know best what they say. And you are not the one to force them. But warn by the Qur'an; him who fears My threat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know best what they say, and you are not one to compel them; therefore remind him by means of the Quran who fears My threat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know very well what they say; thou art not a tyrant over them. Therefore remind by the Koran him who fears My threat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are Best Aware of what they say, and thou (O Muhammad) art in no wise a compeller over them. But warn by the Qur'an him who feareth My threat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know best what those who deny the truth say. You are not there to force them: so remind, with this Quran, those who fear My warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are the best Knower of that which they say, and thou art not over them over them tyrant. Wherefore admonish thou by the Qur'an him who feareth My threat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know well what they say, and you are not there to compel them. So admonish by the Quran those who fear My threat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know best what they say; and thou art not one to overawe them by force. So admonish with the Qur'an such as fear My Warning!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know of best what they say; and you (O Muhammad SAW) are not a tyrant over them (to force them to Belief). But warn by the Quran, him who fears My Threat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We know what they say. You (Prophet Muhammad) are not a tyrant over them. Therefore, remind by the Koran whosoever fears (My) threat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are fully aware of what they say, and you are not a dictator over them. So remind by the Quran whoever fears My warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are most knowing of what they say, and you are not over them a tyrant. But remind by the Qur'an whoever fears My threat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:45] We know best what they, the disbelievers of the Quraysh, say, and you are not [to be] a coercer of them, so as to coerce them to [embrace] faith — but this was [revealed] before the command to struggle [against these disbelievers]. So admonish by the Qur’ān those who fear My threat, namely, believers. (Adh-Dhâriyât ) By the scatterers, the winds that scatter dust and other things, that scatter (dharwan is a verbal noun; one may also say, tadhrīhi dharyan, ‘it blows it [sweeping it] away’);\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "We are best aware of what they say) concerning the resurrection; and it is said: of what they say in the life of the world, (and thou) O Muhammad (art in nowise a compeller over them) such that you force them to accept faith; but later on Allah commanded him to fight them. (But warn) admonish (by the Qur'an him who feareth My threat) for only he who fears My chastisement in the Hereafter will accept your admonition'. And of the surah in which the Winnowing Winds are mentioned, which is all Meccan and consists of 60 verses, 360 words and 1,287 letters: Surah 51: The Winnowing Winds (al-Dhariyat) And of the surah in which the Winnowing Winds are mentioned, which is all Meccan and consists of 60 verses, 360 words and 1,287 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nلا تستبعدوا ولا تستعسروا عن قدرتنا الكاملة أمثال هذا: إذ { نَّحْنُ أَعْلَمُ } وأحفظ { بِمَا يَقُولُونَ } أي: المنكرون، المشركون في سرائرهم ونجواهم { وَمَآ أَنتَ عَلَيْهِمْ } يا أكمل الرسل { بِجَبَّارٍ } تردعهم وتزجرهم عما هم عليه من الإنكار والإصرار، بل ما أنت إلا مذكر\n\n\n\n\n{ فَذَكِّرْ بِٱلْقُرْآنِ } أي: بوعيداته وإنذاراته { مَن يَخَافُ وَعِيدِ } [ق: 45] إذ لا ينفع تذكيرك إلا للخائف منهم، ومن لم يخف ليس لك عليهم سلطان ليزعجهم إلى الإيمان، ويلجئهم إلى قبول الإسلام؛ إذ ما عليك إلا البلاغ والتذكير، والتوفيق من الله العليم الخبير\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها المحمدي المترقب لتوفيق الحق في عموم أحوالك - وفقك الله على سلوط طريق توحيده - أن تفرغ همك عما سوى الحق، وتصفي سرك عن مطلق الشواغل المنافية لصرافة الواحدة الذاتية، وكن في نفسك خائفاً من غضب ربك، راجياً من عفوه وغفرانه في عموم أعمالك التي جئت بها تقرباً إليه، مفوضاً أمورك كلها إلى مشيئته، وبالجملة: عليك أن تتذكر بوعيدات القرآن ومواعيده المستلزمة لصلاح الدارين، وفلاح النشأتين\n\n\n\n\nوإياك الإعراض عن الحق وأهله، والانصراف عن معالم الدين المنزل من عنده سبحانه، لتبيين مسالك توحيده\n\n\n\n\nجعلنا الله من زمرة الراسخين، المتمكنين في معالم الدين القويم بمنِّه وجوده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { نحن أعلم بما يقولون } من نفي البعث وتكذيب الآيات، وغير ذلك مما لا خير فيه، وهو تهديد لهم، وتسلية لرسول الله صلى الله عليه وسلم، { وما أنت عليهم بجبَّار } أي: ما أنت بمسلَّط عليهم، إنما أنت داع، كقوله:\n\n\n\n[الغاشية: 22] من: جبره على الأمر: قهره، أي: ما أنت بوالٍ عليهم تجبرهم على الإيمان، وهذا قبل الأمر بالقتال، { فذَكِّر بالقرآن من يخاف وعيدِ } لأنه هو الذي يتأثر بالوعظ، كقوله:\n\n[النازعات: 45] وأما مَن عداهم، فنحن نفعل بهم ما توجبه أقوالهم، وتستدعيه أعمالهم من أنواع العقاب وفنون العذاب\n الإشارة: فاصبر أيها المُتوجِّه على ما تسمع من الأذى، وغب عن ذلك بذكر ربك قبل طلوع شمس البسط، وقبل غروبها، أي: اشتغل بالله في القبض والبسط، أو: قبل طلوع شمس المعرفة، في حال السير، وقبل الغروب حين تطلع، ومن ليل القبض أو القطيعة فسبِّح حتى يطلع نهار البسط أو المعرفة، وأدبار السجود، أي: عقب سجود القلب في الحضرة، فلا يرفع رأسه أبداً، واستمع يوم ينادِ المنادي، وهي الهواتف الغيبية، والواردات الإلهية، والإلهامات الصادقة، من مكان قريب، هو القلب، يوم يسمعون الصيحة، أي: تسمع النفوس صيحة الداعي إلى الحق بالحق، فتجيب وتخضع إن سبقت لها العناية، ذلك يوم الخروج، خروج العوائد والشهوات من القلب، فتحيي الروح، وتُبعث بعد موتها بالغفلة والجهل، بإذن الله، إنا نحن نُحيي نفوساً بمعرفتنا، ونُميت نفوساً بقهريتنا، وإلينا المصير، أي: الرجوع إنما هو إلينا، فمَن رجع إلينا اختياراً أكرمناه ونعّمناه، وفي حضرة القدس أسكنّاه، ومَن رجع قهراً بالموت عاتبناه أو سامحناه، وفي مقام البُعد أقمناه\n { يوم تشقق الأرضُ عنهم }: أرض الحشر في حق العامة، وأرض الوجود في حق الخاصة، أي: يذهب حس الكائنات، وتضمحل الرسوم، وتُبدل الأرض والسموات، ذلك حشر علينا يسير، أي: جمعكم إلينا، بإفناء وجودكم، وإبقائكم بوجودنا، يسير على قدرتنا، وجذبِ عنايتنا\n ويُقال لكل داع إلى الله، في كل زمان، حين يُدبر الناس عنه، وينالون منه: نحن أعلم بما يقولون، وما أنت عليهم بجبّار، إنما أنت داع: خليفة الرسول، فذكِّر بالقرآن، وادع إلى الله مَن يخاف وعيدِ إذ هو الذي يتأثر بالوعظ والتذكير، وبالله التوفيق، وهو الهادي إلى سواء الطريق، وصلّى الله على سيدنا محمد وآله وصحبه، وسلمّ\n\n",
      "translations": []
    }
  ]
}