{
  "chapter": "ق",
  "text": "واستمع يوم يناد المناد من مكان قريب",
  "translations": [
    {
      "translation": "Listen out for the Day when the Summoner shall call out from a nearby place.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take heed that the day the crier calls from a place close (to every one),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hearken on the Day when the caller will call from a place nearby,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wait for the day when the trumpet will be sounded from a nearby place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And listen attentively on the day when an announcer will proclaim from a place nearby.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And listen on the Day when the caller will call from a near place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And listen on the day when the crier shall cry from a near place\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And listen thou for the day when the caller shall call from a near place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And listen on the day when the crier crieth from a near place,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hearken! The Day when the caller will call from near.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hearken thou: the Day whereon the caller will call from a place quite near.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be on the alert for the day when the caller calls from a close quarter,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And listen for the Day when the Caller will call out from a place quiet near,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And listen on the Day when the caller will call from a near place,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Listen for the Day when the Caller will call from a nearby place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And listen for the Day when the caller calls from a nearby place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And listen on the Day when the Caller will call out from a place that is near -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:41] And listen — O addressee to My words — on the day when the caller, namely, [the archangel] Isrāfīl, calls out from a place that is near, to the heaven: this is the Rock of the Holy House [of Jerusalem], the place on earth that is the nearest to the heaven. He [Isrāfīl] will say: ‘O withered bones, severed limbs, torn flesh and scattered hairs! God verily commands you to come together for the passing of judgement’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And listen on) Muhammad, so that you can hear the description of it; it is also said that this means: strive, Muhammad, for the day when the angel blows the Trumpet (the day when the crier crieth from a near place) close to heaven, from the dome of Jerusalem, which is the closest spot on earth to heaven by about 12 miles; and it is also said this means: from a close distance from which they can hear from beneath their feet.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه آمراً لحبيبه صلى الله عليه وسلم { وَٱسْتَمِعْ } يا أكمل الرسل النداء والهائل { يَوْمَ يُنَادِ ٱلْمُنَادِ } من قب الحق؛ لقيام الساعة والبعث { مِن مَّكَانٍ قَرِيبٍ } [ق: 41] بكل أحد، بحيث يسمعه بلاك كلفة وشبهة، فيقول: أيتها العظام البالية واللحوم المتمزقة والشعور المتفرقة، إن الله يأمركن أن تجتمعن للحساب والجزاء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واسْتَمِع } أي: لِما يُوحى إليك من أحوال القيامة، وفيه تهويل وتفظيع للمخبر به، { يوم يُنادي المنادِ } أي: إسرافيل عليه السلام، فيقول: أيتها العظام البالية، واللحوم المتمزقة، والشعور المتفرقة إن الله يأمركن أن تجتمعن لفصل القضاء، وقيل: إسرافيل ينفخ، وجبريل ينادي بالمحشر، { من مكانٍ قريبٍ } بحيث يصل نداؤه إلى الكل، على سواء، وقيل: من حجرة بيت المقدس، وهو أقرب مكان من الأرض إلى السماء باثني عشر ميلاً، وهي وسط الأرض، وقيل: من تحت أقدامهم، وقيل: من منابت شعورهم، فيسمع من كل شعرة\n \" ويوم \" منصوب بما دلّ عليه \" يوم الخروج \" أي: يوم ينادِ المنادِ يخرجون من القبور، فيوقف على \" واستمع \" وقيل: تقديره: واستمع حديث يوم ينادِ المنادي\n و { يوم يسمعون الصحيةَ }: بدل من \" يوم ينادِ \" أي: واستمع يوم ينادِ المنادي، وذلك اليوم هو يوم يسمعون الصيحة، وهي النفخة الثانية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "96:17",
      "similarity": 0.5931776530614881
    },
    {
      "verse": "40:32",
      "similarity": 0.5787244705628631
    },
    {
      "verse": "37:104",
      "similarity": 0.49789269143218096
    },
    {
      "verse": "26:10",
      "similarity": 0.49778053400992656
    },
    {
      "verse": "20:11",
      "similarity": 0.49625564162329616
    }
  ]
}