{
  "chapter": "ق",
  "text": "قد علمنا ما تنقص الارض منهم وعندنا كتب حفيظۢ",
  "translations": [
    {
      "translation": "We know exactly how the earth eats them away. We possess an all-preserving Book.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know what the earth consumes of them, for We have the Book that preserves everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Thus do they imagine, although) We know well what the earth takes away from them. With Us is a Record that preserves everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We already know how much of them (of their bodies) the earth will consume. With Us there is a Book that contains all records.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know all what the earth decreases from them; and with Us is a Book that retains.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know that which the earth takes of them, and with Us is a Book preserved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know indeed what the earth diminishes of them, and with Us is a writing that preserves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know what the earth diminishes of them; with Us is a book recording.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know that which the earth taketh of them, and with Us is a recording Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know very well what the earth takes away from them: We hold a book which records all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We know that which the earth consumeth of them, and with Us is, Book preserved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know what the earth diminishes from them, and with Us is a preserving Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We already know how much of them the earth takes away: With Us is a record guarding (the full account).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know that which the earth takes of them (their dead bodies), and with Us is a Book preserved (i.e. the Book of Decrees).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know all that the earth takes away of them, and a Book of Records is with Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know what the earth consumes of them, and with Us is a comprehensive book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know what the earth diminishes of them, and with Us is a retaining record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:4] We know what the earth diminishes, consumes, of them, and with Us is a preserving Book, namely, the Preserved Tablet (al-lawh al-mahfūz), which contains everything that has been ordained [by God].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَدْ عَلِمْنَا مَا تَنْقُصُ الْأَرْضُ مِنْهُمْ وَعِنْدَنَا كِتَابٌ حَفِيظٌ (4(ردٌّ لقولهم : { ذلك رجع بعيد } \\[ ق : 3 \\] فإن إحالتهم البعث ناشئة عن عدة شبه منها : أن تفرق أجزاء الأجساد في مناحِي الأرض ومهابّ الرياح لا تُبقي أملا في إمكان جمعها إذ لا يحيط بها محيط وأنها لو علمت مواقعها لتعذر التقاطها وجمعها ، ولو جمعت كيف تعود إلى صورها التي كانت مشكَّلة بها ، وأنها لو عادت كيف تعود إليها ، فاقتصر في إقلاع شبههم على إقلاع أصلها وهو عدم العلم بمواقع تلك الأجزاء وذرّاتها .وفُصِلت الجملة بدون عطف لأنها ابتداء كلام لرد كلامهم ، وهذا هو الأليق بنظم الكلام . وقيل هي جواب القسم كما علمته آنفا وأيًّا مَّا كان فهو رد لقولهم { ذلك رجع بعيد } .والمعنى : أن جمع أجزاء الأجسام ممكن لا يعزب عن علم الله ، وإذا كان عالماً بتلك الأجزاء كما هو مقتضى عموم العلم الإلهي وكان قد أراد إحياء أصحابها كما أخبر به ، فلا يعظم على قدرته جمعها وتركيبها أجساماً كأجسام أصحابها حين فارقوا الحياة فقوله : { قد علمنا ما تنقص الأرض منهم } إيماء إلى دليل الإمكان لأن مرجعه إلى عموم العلم كما قلنا . فأساس مبنى الرد هو عموم علم الله تعالى لأن يجمع إبطال الاحتمالات التي تنشأ عن شبهتهم فلو قال ، نحن قادرون على إرجاع ما تنقص الأرض منهم لخطر في وساوس نفوسهم شبهة أن الله وإن سلمنا أنه قادر فإن أجزاء الأجساد إذا تفرقت لا يعلمها الله حتى تتسلط على جمعها قدرتُه فكان البناء على عموم العلم أقطع لاحتمالاتهم .واعلم أن هذا الكلام بيان للإمكان رعيا لما تضمنه كلامهم من الإحالة لأن ثبوت الإمكان يَقلع اعتقاد الاستحالة من نفوسهم وهو كاف لإبطال تكذيبهم ولاستدعائهم للنظر في الدعوة ، ثم يبقى النظر في كيفية الإعادة ، وهي أمر لم نكلف بالبحث عنه وقد اختلف فيها أيمة أهل السنة فقال جمهور أهل السنة والمعتزلة تعاد الأجسام بعد عدمها . ومعنى إعادتها . إعادة أمثالها بأن يخلق الله أجساداً مثل الأولى تودع فيها الأرواح التي كانت في الدنيا حالّة في الأجساد المعدومة الآن فيصير ذلك الجسم لصاحب الروح في الدنيا وبذلك يحق أن يقال : إن هذا هو فلان الذي عرفناه في الدنيا إذ الإنسان كان إنساناً بالعقل والنطق ، وهما مَظهر الروح . وأما الجسد فإنه يتغير بتغيرات كثيرة ابتداء من وقت كونه جنينا ، ثم من وقت الطفولة ثم ما بعدها من الأطوَار فتخلف أجزاؤُه المتجددة أجزاءَه المتقضيّة ، وبرهان ذلك مبيّن في علم الطّبيعيات ، لكن ذلك التغير لم يمنع من اعتبار الذات ذاتا واحدة لأن هُوية الذات حاصلة من الحقيقة النوعية والمشخصات المشاهدة التي تتجدد بدون شعور مَن يشاهدها . فلذا كانت حقيقة الشخص هي الروح وهي التي تُكتسَى عند البعث جسد صاحبها في الدنيا ، فإن الناس الذين يموتون قبل قيام الساعة بزمن قليل لا تَبلى في مثله أجسامهم تُرجَّع أرواحهم إلى أجسادهم الباقية دون تجديدِ خلقها ، ولذلك فتسمية هذا الإيجاد معاداً أو رجْعاً أو بعثاً إنما هي تسمية باعتبار حال الأرواح ، وبهذا الاعتبار أيضاً تشهد على الكفار ألسنتهم وأيديهم وأرجلهم بما كانوا يعملون لأن الشاهد في الحقيقية هو ما به إدراك الأعمال من الروح المبثوثة في الأعضاء .وأدلة الكتاب أكثرها ظاهر في تأييد هذا الرأي كقوله تعالى : { كما بدأنا أول خلق نعيده } \\[ الأنبياء : 104 \\] ، وفي معناه قوله تعالى : { كُلّما نضِجت جلودهم بدّلْنَاهم جلوداً غيرها ليذوقوا العذاب } \\[ النساء : 56 \\] .وقال شذوذ : تُعاد الأجسام بجمع الأجزاء المتفرقة يجمعها الله العليم بها ويركبها كما كانت يوم الوفاة . وهذا بعيد لأن أجزاء الجسم الإنساني إذا تفرقت دخلت في أجزاء من أجسام أخرى من مختلف الموجودات ومنها أجسام أناس آخرين . وورد في الآثار \" أن كل ابن آدم يفنى إلاّ عجْب الذنب منه خُلق ومنهُ يركب \" رواه مسلم . وعلى هذا تكون نسبة الأجساد المعادة كنسبة النخلة من النواة . وهذا واسطة بين القول بأن الإعادة عن عدم والقول بأنها عن تفرق . ولا قائل من العقلاء بأن المعدوم يعاد بعينه وإنما المراد ما ذكرنا وما عداه مجازفة في التعبير .وذكر الجلال الدواني في «شرح العقيدة العضدية» أن أبَيَّ بن خلف لما سمع ما في القرآن من الإعادة جاء إلى النبي صلى الله عليه وسلم وبيده عظم قد رمَّ ففتته بيده وقال : يا محمد أتُرَى يحييني بعد أن أصير كهذا العظم؟ فقال له النبي صلى الله عليه وسلم \" نعم ويبعثك ويدخلك النار \" . وفيه نزل قوله تعالى : { وضرب لنا مثلاً ونسي خلقه قال من يُحْيي العظام وهي رميم } \\[ يس : 78 \\] .وعُبر ب { تنقص الأرض } دون التعبير بالإعدام لأن للأجساد درجات من الاضمحلال تَدخل تحت حقيقة النقص فقد يفنى بعض أجزاء الجسد ويبقى بعضه ، وقد يأتي الفناء على جميع أجزائه ، على أنه إذا صح أن عَجْب الذنب لا يفني كان فناء الأجساد نقصاً لا انعداماً .وعطف على قوله : { قد علمنا ما تنقص الأرض منهم } قوله : { وعندنا كتاب حفيظ } عطف الأعم على الأخص ، وهو بمعنى تذييل لجملة { قد علمنا ما تنقص الأرض منهم } أي وعندنا علمٌ بكل شيء علماً ثابتاً فتنكير { كتاب } للتعظيم ، وهو تعظيم التعميم ، أي عندنا كتاب كل شيء .و { حفيظ } فعيل : إما بمعنى فاعل ، أي حافظ لما جعل لإحصائه من أسماء الذوات ومصائرها . وتعيين جميع الأرواح لذواتها التي كانت مودعَة فيها بحيث لا يفوت واحد منها عن الملائكة الموكلين بالبعث وإعادة الأجساد وبث الأرواح فيها . وإمّا بمعنى مفعول ، أي محفوظ ما فيه مما قد يعتري الكتب المألوفة من المحو والتغيير والزيادة والتشطيب ونحو ذلك .والكتاب : المكتوب ، ويطلق على مجموع الصحائف . ثم يجوز أن يكون الكتاب حقيقة بأن جعل الله كتباً وأودعها إلى ملائكة يسجّلون فيها الناس حين وفياتهم ومواضع أجسادهم ومقارّ أرواحهم وانتساب كل روح إلى جسدها المعيّن الذي كانت حالّة فيه حال الحياة الدنيا صادقاً بكتب عديدة لكل إنسان كتابُه ، وتكون مثل صحائف الأعمال الذي جاء فيه قوله تعالى : { إذ يتلقى المتلقيان عن اليمين وعن الشمال قعيد ما يلفظ من قول إلا لديه رقيب عتيد } \\[ ق : 17 ، 18 \\] ، وقوله : { ونخرج له يوم القيامة كتاباً يلقاه منشوراً اقرأ كتابك كفَى بنفسك اليوم عليك حسيبا } \\[ الإسراء : 13 ، 14 \\] . ويجوز أن يكون مجموع قوله : { وعندنا كتاب } تمثيلاً لعلم الله تعالى بحال علم من عنده كتاب حفيظ يعلم به جميع أعمال الناس .والعندية في قوله : { وعندنا كتاب } مستعارة للحياطة والحفظ من أن يتطرق إليه ما يغيّر ما فيه أو من يبطل ما عيّن له .\n\n",
      "translations": [
        {
          "translation": "Allah, Exalted is He, said: (We know that which the earth taketh of them) We know that which the earth devours of their flesh after they die and that which it leaves, (and with Us is a recording Book) and with Us is a Book preserved from Satan. This is the Guarded Tablet wherein is recorded their death, stay in the grave and resurrection on the Day of Judgement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه ردعاً لهم وردّاً عليهم: وكيف تستبعدون وتنكرون عنا قدرتنا على بعث الموتى وإعادتهم أحياء كما كانوا؟! مع أنا { قَدْ عَلِمْنَا } على التفصيل والتحقيق { مَا تَنقُصُ } تأكل وتضمحل { ٱلأَرْضُ مِنْهُمْ } أي: من أجزائهم وأوصالهم\n وكيف لا نعلم { وَعِندَنَا كِتَابٌ حَفِيظٌ } [ق: 4] حاصر لتفاصيل الأشياء\n حافظ لها\n ألا وهو حضرة علمنا الحضوري ولوح قضائنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وعندنا كتابٌ حفيظ } لتفاصيل الأشياء\n أو: محفوظ من التغيير\n وهو اللوح المحفوظ\n أو: حافظاً لما أودعه وكتب فيه\n أو: يريد علمه تعالى\n فيكون تمثيلاً لعلمه تعالى بكليات الأشياء وجزيئاتها\n بعلم مَنْ عنده كتاب حفيظ يتلقى منه كل شيء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:130",
      "similarity": 0.5454945487735351
    },
    {
      "verse": "11:109",
      "similarity": 0.5317642563786924
    },
    {
      "verse": "73:3",
      "similarity": 0.4997492982120449
    },
    {
      "verse": "13:41",
      "similarity": 0.4912274366088637
    },
    {
      "verse": "9:4",
      "similarity": 0.479029505867021
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/050004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/050004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/50:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}