{
  "chapter": "ق",
  "text": "ومن اليل فسبحه وادبر السجود",
  "translations": [
    {
      "translation": "And glorify Him for some portion of the night, and additional adorations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and in the night, too, celebrate His glory, in the wake of prostration.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorify Him during the night and also glorify Him after prostration.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And say His Purity during the night, and after the customary prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And during a part of the night (also) glorify His praises and (so likewise) after the prostrations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And glorify Him in the night and after the prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and proclaim thy Lord's praise in the night, and at the ends of the prostrations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the night-time hymn His praise, and after the (prescribed) prostrations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "proclaim His praise in the night and at the end of every prayer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the night-time hallow Him, and also after the prescribed prostration.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and glorify Him through part of the night and after the prostrations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And during part of the night, (also,) celebrate His praises, and (so likewise) after the postures of adoration.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And during a part of the night (also), glorify His praises (i.e. Maghrib and 'Isha prayers), and (so likewise) after the prayers [As-Sunnah, Nawafil optional and additional prayers, and also glorify, praise and magnify Allah - Subhan Allah, Alhamdu lillah, Allahu-Akbar].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And exalt Him in the night, and at the ends of the prostrations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And glorify Him during the night, and at the end of devotions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [in part] of the night exalt Him and after prostration.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:40] and glorify Him at [some part of the] night, that is to say, perform the two evening prayers, and after prostrations (read adbār, as the plural of dubur, or idbār as the verbal noun from adbara, ‘to pass’), in other words, perform supererogatory prayers as prescribed by the Sunna after the obligatory ones; it is also said to mean the actual uttering of glorifications at these times, with continuous praise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "608 (And in the night time hymn His praise) pray for Him the prayers of Maghrib and 'Isha' or the prayer of tahajjud: (And after the (prescribed) prostrations) two units of prayer after the Maghrib.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَدْبَارَ ٱلسُّجُودِ } معناه رُكعتانِ بَعدَ المَغربِ\n\n[الطور: 49] الرُّكعتانِ قَبلَ صَلاةِ الفَجرِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنَ ٱللَّيْلِ فَسَبِّحْهُ } في خلال تهجداتك { وَ } بالجملة: سبِّحه { أَدْبَارَ ٱلسُّجُودِ } [ق: 40] أي: عقب كل صلاة ذات ركوع وسجود\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن الليل فسبِّحه } أي: وسبّشحه في بعض الليل { وأدبارَ السجود } أي: أعقاب الصلوات، جمع: دبر، ومَن قرأ بالكسر، فمصدر، من: أدبرت الصلاة: انقضت، ومعناه: وقت انقضاء الصلاة، وقيل: المراد بالتسبيح: الصلوات الخمس، فالمراد بما قبل الطلوع: صلاة الفجر، وبما قبل الغروب: الظهر والعصر، وبما من الليل: المغرب والعشاء والتهجُّد، وبأدبار السجود: النوافل بعد المكتوبات",
      "translations": []
    }
  ]
}