{
  "chapter": "ق",
  "text": "يوم تشقق الارض عنهم سراعا ذلك حشر علينا يسير",
  "translations": [
    {
      "translation": "The day the earth will split asunder they will come out hurriedly. This gathering together is easy for Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on the Day when the earth will be rent asunder and people, rising from it, will hasten forth. To assemble them all will be easy for Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the earth is rent asunder, they will quickly come out of their graves. This is how easy it is for Us to bring about the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the earth will split for them, so they will come out in haste; this is the gathering – easy for Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the earth shall be cleft, from off them (they will come out) hastening forth. That will be a gathering, quite easy for Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day on which the earth shall cleave asunder under them, they will make haste; that is a gathering together easy to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day when the earth is split asunder from about them as they hasten forth; that is a mustering easy for Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the earth splitteth asunder from them, hastening forth (they come). That is a gathering easy for Us (to make).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on the Day the earth will be rent asunder over them, and from it they shall emerge in haste. To assemble them all is easy enough  for Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That shall be the Day whereon the earth will be cleft from off them as they hasten forth. That shall be a gathering Unto Us easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day the earth is split open for [disentombing] them, [they will come out] hastening. That mustering is easy for Us [to carry out].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when the Earth will be rent asunder, from (men) hurrying out: that will be a gathering together,- quite easy for Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the earth shall be cleft, from off them, (they will come out) hastening forth. That will be a gathering, quite easy for Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon that Day the earth will be rent asunder from around them as they hurry forth that is an easy gathering for Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when the earth will crack for them at once. That is an easy gathering for Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day the earth breaks away from them [and they emerge] rapidly; that is a gathering easy for Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:44] On the day when (yawma substitutes for the previous yawma, with the intervening [statement] being a parenthetical) the earth is split asunder (read tashaqqaqu, or tashshaqqaqu, where the original second tā’ [of tatashaqqaqu] has been assimilated with it [the shīn]) from them, [they will come] hastening forth (sirā‘an: [sirā‘] the plural of sarī‘, a circumstantial qualifier referring to an implied clause, that is to say [together they would read] fa-yakhrujūna musri‘īna, ‘they come forth hastening’). That is an easy gathering for Us (dhālika hashrun ‘alaynā yasīr: there is here a separation of the noun from its adjective by what is semantically connected to it, for the purpose of specification — which is [rhetorically] unobjectionable; dhālika, ‘that’, is meant to point out the signification of the ‘gathering’, which itself is [also] predicated by this [demonstrative particle], and this signification is the bringing back to life after extinction and the assembly for the exposition and the reckoning [before God]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the day when the earth spliteth asunder from them, hastening forth (they come)) out of the graves. (That is a gathering easy for Us (to make).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { يوم تشقق } أرض البدن { عنهم سراعاً } إلى ما يجانسهم من الخلق { ذلك حشر علينا يسير } نحشرهم مع من يتوّلونه بالمحبة بانجذابهم إليه دفعة بلا كلفة من أحد { نحن أعلم بما يقولون } لإحاطة علمنا بهم وتقدمه عليهم وعلى أقوالهم { وما أنت عليهم بجبّار } تجبرهم على خلاف ما اقتضى استعدادهم وحالهم التي هم عليها،\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر يا أكمل الرسل لمن أنكر الحشر والميعاد { يَوْمَ تَشَقَّقُ } أي: تنشق وتتخرق { ٱلأَرْضُ عَنْهُمْ } ويخرجون منها { سِرَاعاً } مسرعين { ذَلِكَ } أي: إخراجهم وخروجهم كذلك { حَشْرٌ } وبعث وجمع { عَلَيْنَا يَسِيرٌ } [ق: 44] سهل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وذلك { يومَ تشقق } أصله: تتشقق، فأدغم، وقرأ الكوفيون والبصري بالتخفيف، بحذف إحدى التاءين، أي: تتصدع، { الأرضُ عنهم سِراعاً } فيخرج المؤمنون من صدوعها مسرعين، { ذلك حشرٌ } أي: بعث { علينا يسيرٌ } هَيْنٌ، وهو معادل لقول الكفرة: { ذلك رجع بعيد } ، وتقديم الجار والمجرور لتخصيص اليسر به تعالى",
      "translations": []
    }
  ]
}