{
  "chapter": "ق",
  "text": "بل كذبوا۟ بالحق لما جاءهم فهم فى امر مريج",
  "translations": [
    {
      "translation": "But they denied the truth when it came to them. They are, therefore, in a very muddled state.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no! They called the truth a lie when it came to them; so they are in a confused state.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They gave the lie to the Truth when it came to them. So they are now in a state of great perplexity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, they have rejected the truth that has come to them, thus, they live in confusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact they denied the Truth when it came to them, so they are now in a dilemma.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but they have denied the truth when it has come to them, so they are in a Marij state.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, they rejected the truth when it came to them, so they are (now) in a state of confusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but they cried lies to the truth when it came to them, and so they are in a case confused.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but they have denied the truth when it came unto them, therefor they are now in troubled case.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they denied the truth when it came to them, so they are in a state of confusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! they belie the truth when it cometh Unto them; wherefore they are in an affair confused.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, they denied the truth when it came to them; so they are now in a perplexed state of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they deny the Truth when it comes to them: so they are in a confused state.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but they have denied the truth (this Quran) when it has come to them, so they are in a confused state (can not differentiate between right and wrong).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather, they belied the truth when it came to them, and now they are in a state of confusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they denied the truth when it has come to them, so they are in a confused state.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they denied the truth when it came to them, so they are in a confused condition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[50:5] Nay, but they denied the truth, the Qur’ān, when it came to them and so they, with regard to the Prophet (s) and the Qur’ān, are [now] in a confounded situation, a troubled [one]. [For] on one occasion they said [that he was], ‘A sorcerer!’ [cf. Q. 38:4] and [that his statements were] ‘[Nothing but manifest] sorcery!’ [cf. Q. 37:15], on another, ‘A poet!’ [cf. Q. 21:5] and ‘Poetry!’ [cf. Q. 36:69], and still on another, ‘A soothsayer!’ [cf. Q. 52:29] and [that his statements were nothing more than] soothsaying [cf. Q. 69:42].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay, but they) the Quraysh (have denied the Truth) Muhammad (pbuh) and the Qur'an (when it came unto them) this is the second clause of the oath, i.e. by the noble and glorious Qur'an, Muhammad (pbuh) has brought them the Qur'an, (therefore they are now in troubled case) they are in error; it is also said that this means: they are confused; and it is also said this means: they are in disagreement, some of them believe while others do not.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِيۤ أَمْرٍ مَّرِيجٍ } معناه مُختلطٌ\n ويقال: الشيءُ المُتغيرُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بَلْ } هو من غاية عمههم وسكرتهم، وكمال غيرهم وغفلتهم { كَذَّبُواْ بِٱلْحَقِّ } الصدق المطابق للواقع، المؤيد بالبرهان الساطع والدليل القاطع، وهو نبوة محمد صلى الله عليه وسلم { لَمَّا جَآءَهُمْ } وحين بعث إليهم على الحق؛ لتبيين الحق وتمييزه عن الباطل؛ لذلك أنكروا البعث الذي جاء لتبيينه وللإنذار بما فيه من أنواع العقاب والعقوبات، وبالجملة: { فَهُمْ } بمقتضى أحلامهم السخيفة مغمورون { فِيۤ أَمْرٍ مَّرِيجٍ } [ق: 5] مضطرب، مخلوط، يلتبس عليهم حقيته صلى الله عليه وسلم وحقيّة ما جاء به من عند ربه؛ لذلك يضطربون في شأنه ويقولون تارة: إنه شاعر، وتارة: إنه ساحر وكاهن، وتارة: إنه مجنون مخبط، مختل العقل، يتكلم بكلام المجانين، إلى غير ذلك من المفتريات الباطلة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { بل كذّبوا بالحق } إضراب وانتقال من بيان شناعتهم السابقة، وتكذيب البعث، إلى ما أشنع منه وأفظع، وهو تكذيبهم للنبوة الثابتة بالمعجزات الباهرة، { لَمَّا جاءهم } من غير تأمُّل وتفكُّر، وقيل: الحق: القرآن، أو: الإخبار بالبعث، { فهم في أمر مَرِيج } مضطرب، لا قرار له، يقال: مرج الخاتم في أصبعه إذا اضطرب من سعته، فيقولون تارة: مجنون، وطوراً: ساحر، ومرة: كاهن، ولا يثبتون على قول\n أو: مختلط، يقال: مرج أمر الناس: اختلط\n أو: ملبِس، قال قتادة: مَن ترك الحق مرج عليه أمره، وألبس عليه دينه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:15",
      "similarity": 0.8731265249270719
    },
    {
      "verse": "55:19",
      "similarity": 0.8373013232142472
    },
    {
      "verse": "55:22",
      "similarity": 0.6182702151182344
    },
    {
      "verse": "55:58",
      "similarity": 0.23827694151638382
    },
    {
      "verse": "25:53",
      "similarity": 0.1703622007636404
    }
  ]
}