{
  "chapter": "الذاريات",
  "text": "ءاخذين ما ءاتىهم ربهم انهم كانوا۟ قبل ذلك محسنين",
  "translations": [
    {
      "translation": "receiving what their Lord has given them. Certainly before that they were good-doers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Receiving what is given them by their Lord. They were surely the virtuous before this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "joyously receiving what their Lord will have granted them. Verily they did good works before (the coming of this Day):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "receiving their reward from their Lord. They had been righteous people before the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Accepting the rewards given by their Lord; they were indeed virtuous before this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Taking joy in the things which their Lord has given them. Verily, they were before this doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Taking what their Lord gives them; surely they were before that, the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "taking whatsoever their Lord has given them; they were good-doers before that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Taking that which their Lord giveth them; for lo! aforetime they were doers of good;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall receive what their Lord will bestow on them. They have done good works in the past,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Taking that which their Lord will vouchsafe Unto hem. Verily they have been before that well-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "receiving what their Lord has given them, for they had been virtuous aforetime.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Taking joy in the things which their Lord gives them, because, before then, they lived a good life.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Taking joy in the things which their Lord has given them. Verily, they were before this Muhsinun (good-doers - see V. 2:112).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "receiving what their Lord will give them because before this they were gooddoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Receiving what their Lord has given them. They were virtuous before that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Accepting what their Lord has given them. Indeed, they were before that doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[51:16] receiving (ākhidhīna is a circumstantial qualifier referring to the person of the predicate of inna, ‘truly’) what their Lord has given them, of reward, for indeed formerly, [before] their entering Paradise, they had been virtuous, in the world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Taking) content and pleased with (that which their Lord giveth them) in the Garden and it is also said that this means: they act upon that which their Lord commands them in the life of the world; (for lo! aforetime) before they were given this reward and honour (they were doers of good) they were good in their speech and action in the life of the world;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { آخِذِينَ مَآ آتَاهُمْ رَبُّهُمْ إِنَّهُمْ } معناه الفَرائضُ\n\n\n\n\nوقوله تعالى: { كَانُواْ قَبْلَ ذَلِكَ مُحْسِنِينَ } أي قَبلَ أن تُنّزلَ الفرائضُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّ المتّقين } الذين تجرّدوا عن هيئات الطبيعة وصفات النفس في جنات الصفات وعلومها { آخذين } أي: قابلين { ما آتاهم ربّهم } من أنوار تجليات الصفات راضين بها { إنهم كانوا قبل ذلك } أي: قبل الوصول إلى مقام تجليات الصفات { مُحْسنين } بشهود الأفعال في مقام العبادات والمعاملات كما قال عليه السلام:\n\n \" الإحسان أن تعبد الله كأنك تراه \"\n \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ آخِذِينَ مَآ آتَاهُمْ } وأعطاهم { رَبُّهُمْ } تفضلاً عليهم، وتكريماً على وجه الرضاء بجميع ما جرى عليهم من مقتضيات قضائه { إِنَّهُمْ كَانُواْ قَبْلَ ذَلِكَ } الفضل واللطف من النشأة الأولى { مُحْسِنِينَ } [الذاريات: 16] الأدب مع الله ورسله، وخُلَّص عباده العاكفين ببابهز\n\n\n\nومن جملة إحسانهم: إنهم { كَانُواْ } في دار الابتلاء { قَلِيلاً مِّن ٱللَّيْلِ مَا يَهْجَعُونَ } [الذاريات: 17] أي: يرقدون قليلاً من ساعات الليل، وذلك أيضاً بسبب ألا يعرضهم الكلال العائق من المواظبة على الطاعات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنَّ المتقين في جناتٍ وعيون } عظيمة، لا يبلغ كُنهها، ولا يُقادر قدرها، ولعل المراد بها الأنهار الجارية، بحيث يرونها، ويقع عليها أبصارهم، لا أنهم فيها، { آخذين ما آتاهم ربهم } أي: نائلين ما أعطاهم راضين به، بمعنى أنَّ كلَّ ما يأتهم حسَنٌ مرضي، يتلقى بحسن القبول، { إِنهم كانوا قبل ذلك } في الدنيا { محسنين } متقنين لأعمالهم الصالحة، آتين بها على ما ينبغي، فلذلك نالوا ما نالوا من الفوز العظيم، ومعنى الإحسان ما فسره به عليه الصلاة والسلام:\n\n \" أن تعبد الله كأنك تراه \" \n\nالحديث\n ومن جملته ما أشار إليه بقوله:  { كانوا قليلاً من الليل ما يَهْجعون } أي: كانوا يهجعون، أي: ينامون في طائفة قليلة من الليل، على أن \" قليلاً \" ظرف أو كانوا يهجعون هجوعاً قليلاً، على أنه صفة لمصدر، و \" ما \" مزيدة في الوجهين، ويجوز أن تكون مصدرية مرتفعة بـ \" قليلاً \" على الفاعل، أي: كانوا قليلاً من الليل هجوعهم\n وقال النسفي: يرتفع هجوعهم على البدل من الواو في \" كانوا \": لا بقليلاً لأنه صار موصوفاً بقوله: { من الليل } فبعد من شبه الفعل وعمله، ولا يجوز أن تكون \" ما \" نافية على معنى: أنهم لا يهجعون من الليل قليلاً ويُحْيُونه كله\n هـ\n أو كانوا ناساً قليلاً ما يهجعون من الله لأن \" ما \" النافية لا يعمل ما بعدها فيما قبلها، ولأن المحسنسن وهم السابقون كانوا كثيراً في الصدر الأول، وموجودون في كل زمان ومكان، فلا معنى لقلتهم، خلافاً لوقف الهبطي، وأيضاً: فمدحهم بإيحاء الليل كله مخالف لحالته صلى الله عليه وسلم، وما كان يأمر به",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:34",
      "similarity": 0.3841674514800738
    },
    {
      "verse": "20:8",
      "similarity": 0.37689294070593854
    },
    {
      "verse": "37:80",
      "similarity": 0.37383143367372107
    },
    {
      "verse": "37:121",
      "similarity": 0.37383143367372107
    },
    {
      "verse": "37:131",
      "similarity": 0.37383143367372107
    }
  ]
}