{
  "chapter": "الذاريات",
  "text": "ذوقوا۟ فتنتكم هذا الذى كنتم به تستعجلون",
  "translations": [
    {
      "translation": "(And told:) \"Taste your punishment. This is what you were trying to hasten.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(and be told): “Taste your ordeal! This is what you were seeking to hasten.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and will be told, \"Suffer the torment which you wanted to experience immediately\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it will be said to them, “Taste your own roasting; this is what you were impatient for.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Taste you your trial! This is what you used to ask to be hastened!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Taste your persecution! this is what you would hasten on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Taste your trial! This is that you were seeking to hasten.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And it will be said unto them): Taste your torment (which ye inflicted). This is what ye sought to hasten.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Taste your trial. This is what you sought to hasten.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Taste your burning: this is that which ye sought to be hastened.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[and will be told]: ‘Taste your torment. This is what you used to hasten.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Taste ye your trial! This is what ye used to ask to be hastened!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Taste you your trial (burning)! This is what you used to ask to be hastened!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Taste your trial. This is what you have sought to hasten'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Taste your ordeal. This is what you used to challenge.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And will be told], \"Taste your torment. This is that for which you were impatient.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[51:14] ‘Taste this torment of yours, this chastisement of yours. This, chastisement, is what you sought to hasten on!’, in the world in derision.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "610 The angels of the Fire will say to them: (Taste your torment. This) chastisement (is what ye sought to hasten) in the life of the world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nويقول لهم الموكلون حين طرحهم فيها توبيخاً وتقريعاً: { ذُوقُواْ } أيها المجرمون المسرفون { فِتْنَتَكُمْ } التي أنتم تستعجلون بها في دار الدنيا على سبل الاستهزاء والمراء، وبالجملة: { هَـٰذَا ٱلَّذِي } وقعتم فيه، وحبستم عليه الآن من العذاب { كُنتُمْ بِهِ تَسْتَعْجِلُونَ } [الذاريات: 14] في سالف الزمان على سبيل الإنكار والاستكبار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذُوقوا فِتْنتكم } أي: وتقول لهم خزنة النار: ذوقوا عذابكم وإحراقكم بالنار، { هذا الذي كنتم به تستعجلون } أي: هذا العذاب هو الذي كنتم تستعجلونه في الدنيا، بقولكم:\n\n[الأعراف: 70] فـ \" هذا \": مبتدأ، و \" الذي\n\n\n \" الخ: خبر، ويجوز أن يكون \" هذا \" بدلاً من فتنتكم، و \" الذي \": صفته\n\n\nالإشارة: أقسم الله تعالى بسماء الحقائق، وتُسمى سماء الأرواح لأن أهل الحقائق روحانيون سماويون، ترقَّوا من أرض الأشباح إلى سماء الأرواح، حيث غلبت روحانيتهم، على بشريتهم، كما أن أهل الشرائع اليابسة أرضيين بشريين، حيث غلبت بشريتهم الطينية على روحانيتهم السماوية، ولكل واحدٍ طُرق، فطُرق سماء الحقائق هي المسالك التي تُوصل إليها، وهي قَطْع المقامات والمنازل، وخَرق الحُجب النفسانية، حتى يُفضوا إلى مقام العيان \" في مقعد صدق عند مليك مقتدر \" وطُرق أرض الشرائع هي المذاهب التي سلكها الأولون، واقتدى بهم الآخرون، يفضوا أهلها إلى رضا الله ونعيمه\n وكان الشيخ الشاذلي رضي الله عنه يقول في تلميذه المرسي: إن أبا العباس أعرف بطُرق السماء منه بطُرق الأرض، أي: أعرف بمسالك الحقائق منه بمذاهب الشرائع، وهذا إشارة قوله: { ذات الحُبك } أي: الطُرق\n إن أهل الجهل بالله لفي قولٍ مُختلفٍ مضطرب، لا تجد قلوبهم تأتلف على شيء، قلوبهم متشعبة، ونياتهم مختلفة، وهممهم دنية، وأقوالهم مضطربة، بخلاف أهل الحقائق العارفين بالله، قلوبهم مجتمعة على محبة واحدة، وقصدٍ واحد، وهو الله، بدايتهم في السلوك مختلفة، ونهايتهم متفقة، وهو الوصول إلى حضرة العيان، ولله در ابن البنا، حيث قال:\n\nوقال الشاعر:\n\nيُؤفك عن هذا الاختلاف مَن صُرف في سابق العناية، أو مَن صُرف من عالم الأشباح إلى عالم الأرواح\n قُتل الخراصُون المعتمدون على ظنهم وحدسهم، فعلومهم جُلها مظنونة، وإيمانهم غيبي، وتوحيدهم دليلي من وراء الحجاب، لا يَسلم من طوارق الاضطراب، الذين هم في غمرة أي: في غفلة وجهل وضلالة - ساهون عما أُمروا به من جهاد النفوس، والسيرإلى حضرة القدوس، أو ساهون غائبون عن مراتب الرجال، لا يعرفون أين ساروا، وفي أيّ بحار سَبَحوا وغاصوا، كما قال شاعرهم:\n\n{ يسألون أيّان يومُ الدين } لطول أملهم، أو يسألون أيَّان يوم الجزاء على المجاهدة\n قال تعالى: هو { يوم هم } أي: أهل الغفلة - على نار القطيعة أو الشهوة يُفتنون بالدنيا وأهوالها، والعارفون منزَّهون في جنات المعارف\n ويقال للغافلين: ذُوقوا وبال فتنتكم، وهو الحجاب وسوء الحساب، هذا الذي كنتم به تستعجلون، بإنكاركم على أهل الدعوة الربانيين، فتستعجلون الفتح من غير مفتاح، تطلبون مقام المشاهدة من غير مجاهدة، وهو محال في عالم الحكمة\n وبالله التوفيق\n ثم ذكر أضدادهم، فقال: { إِنَّ ٱلْمُتَّقِينَ فِي جَنَّاتٍ وَعُيُونٍ }\n\n",
      "translations": []
    }
  ]
}