{
  "chapter": "الذاريات",
  "text": "وفى امولهم حق للسائل والمحروم",
  "translations": [
    {
      "translation": "And beggars and the destitute received a due share of their wealth.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In whose wealth the suppliant and the deprived had a share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and in their wealth there was a rightful share for him who would ask and for the destitute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They assigned a share of their property for the needy and the destitute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the beggar and the destitute had a share in their wealth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in their wealth there was the right of the Sa'il and the Mahrum.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in their property was a portion due to him who begs and to him who is denied (good).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the beggar and the outcast had a share in their wealth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in their wealth the beggar and the outcast had due share.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and sharing their possessions with the beggars and the deprived.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in their substance was the right of the beggar and non- beggar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and there was a share in their wealth for the beggar and the deprived.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in their wealth and possessions (was remembered) the right of the (needy,) him who asked, and him who (for some reason) was prevented (from asking).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in their properties there was the right of the beggar, and the Mahrum (the poor who does not ask the others).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and in their wealth was a share for whosoever asked and for whosoever was prevented.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in their wealth, there was a share for the beggar and the deprived.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from their properties was [given] the right of the [needy] petitioner and the deprived.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[51:19] and there was a share in their wealth [assigned] for the beggar and the deprived, [the latter being] the one who does not beg, because of his self-restraint.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And in their wealth the beggar) who asks from people (the outcast) he who does not beg from people nor is he given and nor do people realise he is in need; it is also said that the outcast means: the one whose wage and spoils are denied; and it is said that this means: the one who has a trade but whose life is hard and cannot earn his day's sufficiency (had due share) had an acknowledged right.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَفِيۤ أَمْوَالِهِمْ حَقٌّ لَّلسَّآئِلِ وَٱلْمَحْرُومِ } قال زيد بن علي عليهما السّلامُ: معنى السَّائل: الذي يسألُ بكفهِ\n والمَحرومُ: الذي لا يَسألُ الناسَ شيئاً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {And in their wealth is a right for the asker and the deprived}, Zayd ibn Ali said: The meaning of the asker is the one who asks with his own effort.\n\n\nThe needy person is one who does not ask others for anything.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كان { فِيۤ أَمْوَالِهِمْ } وأرزاقهم المسروقة إليهم من قبل الحق { حَقٌّ } حظ ونصيب مفروض مقدر، يستوجبونه على أنفسهم { لَّلسَّآئِلِ } السائر في سبيل الله، المتعرض للسؤال مقدار ما يحتاج إليه { وَٱلْمَحْرُومِ } [الذاريات: 19] المتعفف عن ذلِّ السؤال، المتمكن في زايوة التوكل والتفويض\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وفي أموالهم حقُّ } أي: نصيب وافر، يُوجبونه على أنفسهم، تقرُّباً إلى الله تعالى وإشفاقاً على الناس، { للسائلِ والمحروم } أي: لمَن يُصرح بالسؤال لحاجة، وللمتعفف الذي يتعرّض ولا يسأل حياءً وتعففاً، يحسبه الناس غنيّاً فيحرم نفسه من الصدقة\n وقد تكلم في نوادر الأصول على مَن سأل بالله، أي: قال: أعطني لوجه الله، هل يجب إعطاؤه أم لا؟ وفي الحديث:\n\n \" مَن سألكم بالله فأعطوه \" \n\nقال: وهو مُقيد بما إذا سأل بحق: أي: لحاجة، وأما إذا سأل بباطل - أي: لغير حاجة - فإنما سأل بالشيطان لأن وجه الله حق\n ثم ذكركلام عليّ شاهداً، ثم حديث معاذ:\n\n\n\n \" مَن سألكم بألله فأعطوه، فإن شئتم فدعوه \" \n\n، قال معاذ: وذلك أن تعرف أنه غير مستحق، وإذا عرفتم أنه مستحق، وسأل فلم تعطوه فأنتم ظَلَمة\n وأُلحِقَ بغير المستحق مَن اشتبه حاله لتعليق الظلم على معرفة الاستحقاق خاصة\n وقال النووي في الأذكار: يُكره منع مَن سأل بالله، وتشفَّع به لحديث:\n\n \" مَن سأل بالله فأعطوه \" \n\nقال: ويكره أن يسأل بوجه الله عير الجنة\n هـ\n وفي حديث المنذري:\n\n \" ملعونٌ مَن سأل بوجه الله، وملعونٌ مَن سُئل بوجه الله، ثم مَنَعَ سَائِلَهُ ما لم يَسْأَلْ هُجْراً \" \n\nوقال في كتابه \" الأخبار \" على قوله عليه الصلاة والسلام:\n\n \" مَن سألكم بالله فأعطوه \" \n\nإجلالاً لله تعالى، وتعظيماً، وإيجاباً لحقه\n ثم قال: إذ ليس يجب إعطاء السائل إذا كان في معصية أو فضول، فمَن سأل بالله فيما ليس عليه ولا عليك فرضه، فإعطاؤك إياه لإجلال حق الله وتعظيمه، وليس عليك بفرض ولا حتم\n انظر تمامه في الحاشية الفاسية\n الإشارة: إنَّ المتقين ما سوى الله في جنات المعارف، وعيون العلوم والأسرار\n قال القشيري: في عاجلهم في جنة الوصول، وفي آجلهم في جنة الفضل، فغداً نجاة ودرجات، واليوم قربات ومناجاة\n هـ\n { آخذين ما آتاهم ربهم } من فنون المواهب والأسرار، وغداً من فنون التقريب والإبرار، راضين بالقسمة، قليلاً أو كثيرة\n إنهم كانوا قبل ذلك: قبل الإعطاء، محسنين، يعبدون الله على الإخلاص، يأخذون من الله، ويدفعون به، وله، ولا يردون ما أعطاهم، ولو كان أمثال الجبال، ولا يسألون ما لم يعطهم، اكتفاء بعلم ربهم\n قال القشيري: كانوا قبل وجودهم محسنين، وإحسانهم: كانوا يُحبون الله بالله، يحبهم ويحبونه وهم في العدم، ولمَّا حصلوا في الوجود، كانوا قليلاً من الليل ما يهجعون، كأنَّ نومهم عبادة، لقوله عليه الصلاة والسلام:\n\n \" نوم العالم عبادة \" \n\nفمن َيكون في العبادة لا يكون نائماً، وهجوع القلب: غفلته، وقلوبهم في الحضرة، ناموا أو استيقظوا، فغفلتهم بالنسبة إلى حضورهم قليلة\n وقال سهل رضي الله عنه: أي: كانوا لا يغفلون عن الذكر في حال، يعني هجروا النوم لوجود الأُنس في الذكر، والمراد بالنوم: نوم القلب بالغفلة\n { وبالأسحار هم يستغفرون } ، قال القشيري: أخبر عن تهجدهم، وقلة دعاويهم، وتنزُّلهم بالأسحار، منزلةَ العاصين، تصغيراً لقدرهم، واحتقاراً لفعلهم\n ثم قال: والسهر لهم في لياليهم دائم، إما لفرط لهف، أو شدة أسف، وإما لاشتياق، أو للفراق، كما قالوا:\n\nوإما لكمال أُنس، وطيب روح، كما قالوا:\n\nهـ\n { وفي أموالهم حق للسائل والمحروم } أي: هم يُواسون مَنْ قصدهم بالحس والمعنى، فيبذلون ما خوّلهم الله من الأموال، للسائل والمتعفف، وما خوّلهم الله من العلوم، للطالب والمعرض، وهو المحروم، فيقصدونه بالدواء بما أمكن فإنهم أطباء، والطبيب يقصد المريض أينما وجده، شفقةً ورحمة، ونُصحاً للعباد\n وبالله التوفيق\n ثم ذكر دلائل قدرته على ما أقسم عليه من البعث، فقال: { آخِذِينَ مَآ آتَاهُمْ رَبُّهُمْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:25",
      "similarity": 0.7329766019286863
    },
    {
      "verse": "70:24",
      "similarity": 0.5766722813885893
    },
    {
      "verse": "56:67",
      "similarity": 0.44879831790003905
    },
    {
      "verse": "68:27",
      "similarity": 0.44879831790003905
    },
    {
      "verse": "68:14",
      "similarity": 0.3704662748450969
    }
  ]
}