{
  "chapter": "الذاريات",
  "text": "فورب السماء والارض انه لحق مثل ما انكم تنطقون",
  "translations": [
    {
      "translation": "By the Lord of heaven and earth, it is certainly the truth, just as you have speech.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the Lord of the heavens and the earth, this is certainly true even as you speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, by the Lord of the heaven and the earth, this is certainly true, as true as the fact of your speaking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This, by the Lord of the heavens and the earth is as certain as your ability to speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So by oath of the Lord of the heavens and the earth, this Qur’an is the Truth, in the same language that you speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then by the Lord of the heaven and the earth, it is the truth, just as you can speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And by the Lord of the heavens and the earth! it is most surely the truth, just as you do speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So by the Lord of heaven and earth, it is as surely true as that you have speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And by the Lord of the heavens and the earth, it is the truth, even as (it is true) that ye speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the Lord of the heaven and the earth, it is certainly the truth. It is as true as your ability to speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the Lord of the heaven and the earth it is sure, even as it is a fact that ye are speaking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the Lord of the sky and the earth, it is indeed the truth, just as [it is a fact that] you speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, by the Lord of heaven and earth, this is the very Truth, as much as the fact that ye can speak intelligently to each other.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, by the Lord of the heaven and the earth, it is the truth (i.e. what has been promised to you), just as it is the truth that you can speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So by the Lord of heaven and earth, it is as true as your speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the Lord of the heaven and the earth, it is as true as the fact that you speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then by the Lord of the heaven and earth, indeed, it is truth - just as [sure as] it is that you are speaking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[51:23] So by the Lord of the heaven and the earth, it, that which you are promised, is as assuredly true as [the fact] that you have [power of] speech (read mithlu, in the nominative, as an adjective, with the mā being extra; or read mithla, in the accusative, as being a compound with mā), that is to say: [it is as true] as your speech is in reality, that is, in your knowing it to be [true] necessarily by its issuing from you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And by the Lord of the heavens and the earth) Allah swore by Himself, (it) that which I have related to you concerning provision (is the Truth) it will surely happen, (even as (it is true) that ye speak) even as you say: there is no deity except Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أقسم سبحانه تأكيداً لما أومأ، فقال: { فَوَرَبِّ ٱلسَّمَآءِ وَٱلأَرْضِ } أي: وحق موجدهما، ومربيهما على هذا النمط البديع والنظم الغريب { إِنَّهُ } أي: ما يستدل بإيجادهما، وإظهارهما على وجوده سبحانه وكمال قدرته، ووفور حكمته، ومتانة حكمه { لَحَقٌّ } ثابت محقق حقيق بالحقية، وحيد بالقيومية، فريد بالديمومية، لا يعرضها زمان، ولا يعتريها كلال\n\n\n\n\nوهو في حقيته وتحققه { مِّثْلَ مَآ أَنَّكُمْ تَنطِقُونَ } [الذاريات: 23] أي: كمال لا شبهة لكم في تنطقكم، وتلفظكم بالكمالات المنطوقة، كذلك لا شبهة في حقية الحق وظهوره، بل هو أظهر من كل شيء ظاهر، وأجلى من كل جلي، بل الكل إنما يظهر به وبظهوره، إلا إنكم بغيوم تعيناتكم الباطلة وظلام هوياتكم العاطلة، تسترون شمس الحق الظاهر في الآفاق بكمال الكرامة والاستحقاق\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nفهو مضمون عند الله في سماء غيبه، ستر ذلك بسر الحكمة، وهو الأسباب، { وما تُوعدون } أي: وفي السماء ما تُوعدون من الثواب لأن الجنة في السماء السابعة، سقفها العرش، أو: أراد: إنما تُوعدونه من الرزق في الدنيا وما تُوعدونه في العقبى كله مقدّر ومكتوب في السماء، وقيل: إنه مبتدأ وخبره: { فَوَرَبُّ السماءِ والأرض إِنه لَحقٌّ } أي: ما توعدون من البعث وما بعده، أو: ما توعدونه من الرزق المقسوم، فَوَرَبِّ العالم العلوي والسفلي { إِنه لحقٌّ مثل ما أنكم تنطقون } أي: مثل نطقكم، شبّه ما وعد به من الرزق وغيره بتحقُّق نطق الآدمي لأنه ضروري، يعرفه من نفسه كلُّ أحد\n قال الطيبي: وإنما خصّ النطق دون سائر الأعمال الضرورية، لكونه أبقى وأظهر، ومن الاحتمال أبعد، فإنّ النطق يُفصح عن كل شيء، ويجلي كل شبهة\n هـ\n فَضمان الرزق وإنجاز وعده ضروري، كنطق الناطق\n رُوي عن الأصمعي أنه قال: أقبلتُ من جامع البصرة، فطلع أعرابي على قَعود، فقال: مَنْ الرجل؟ فقلت: من بني أصمع، فقال: من أين أقبلت؟ فقلت: من موضع يتلى فيه كلام الله، قال: اتل عليَّ، فتلوت: { والذاريات\n\n\n } فلما بلغت قوله: { وفي السماء رزقكم } قال: حسبك، فقام إلى ناقته فنحرها، ووزعها على مَن أقبل وأدبر، وعمد إلى سيفه وقوسه فكسّرهما، وولّى، فلما حججت مع الرشيد، وطُفت، فإذا أنا بصوت رقيق يهتف بي، فالتفتّ، فإذا أنا بالأعرابي قد نحل واصفرّ، فسلّم عليَّ، واستقرأ السورة، فلما بلغتُ الآية، صاح، وقال: قد وجدنا ما وعدنا ربنا حقّاً، ثم قال: وهل غير هذا؟ فقرأتُ: { فَوَرَبِّ السماء والأرض إِنه لَحقٌّ } فقال: سبحان الله! مَن الذي أغضب الجليل حتى حلف؟ لم يُصدقوه بقوله حتى حلف، قالها ثلاثاً، وخرجت معها نَفْسُه\n هـ\n من النسفي\n قلت: وقد سمعت حكاية أخرى، فيها عبرة، وذلك أن رجلاً سمع قارئاً يقرأ هذه الآية، فدخل بيته، ولزم زاوية منه يذكر فيها، ويتبتل، فجاءت امرأته تنقم عليه، وتأمره بالخدمة، فقال لها: قال تعالى: { وفي السماء رزقكم } ، فلما أيست منه ذهبت تحفر شيئاً، فوجدت آنية مملوءة دنانير، فجاءت إليه، وقالت: قد أتانا رزقنا، قم تحرفه معي، هو في موضع كذا، فقال: إنما قال تعالى: { في السماء } ولم يقل في الأرض، فامتنع فذهبت إلى أخٍ لها تستعين به، فلما فتحتها وجدتها مملوءة عقارب، فقالت: والله لأطرحنها عليه لنستريح منه، ففتحت كوة من السقف، وطرحتها عليه، فسقطت دنانير، فقال: الآن نعم، قد آتاني من حيث قال ربي: { وفي السماء رزقكم }\n هـ\n وذكر في التنوير: أن الملائكة لمّا نزلت هذه الآية ضجّت في السماء، وقالت: ما أضعف بني آدم حتى أحوجوا ربهم إلى الحلف\n الإشارة: وفي أرض نفوس العارفين آيات، منها: أن الأرض تحمل كل شيء، ولا تستثقل شيئاً، فكذلك نفس العارف، تحمل كُلَّ كَلٍّ وثقيل، ومَن استثقل حملاً، أو تبرّم من أحد، أو من شيء، ساقته القدرة إليه، فلغيبته عن الحق، ومطالعته الخلق بعين التفرقة، وأهل الحقائق لا يتصفون بهذه الصفة\n\n\nومنها: أنها يلقى عليها كل قذارة وقمامة فتُنبت كل زهر ونَور وورد، فكذلك العارف يُلقى عليه كل جفاء، ولا يظهر منه إلا الصفاء\n ومنها أن الأرض الطيبة تُنبت الطيب، وينصع نباتها، والأرض السبخة لا تُنبت شيئاً، كذلك القلوب الطيبة تُنبت كل ما يلقى فيها من الخير، والقلوب الخبيثة لا تعي شيئاً، ولا ينبت فيها إلا الخبيث\n وقوله تعالى: { وفي أنفسكم\n\n } قال القشيري: يُشير إلى أن النفس مرآة جميع صفات الحق، لهذا قال عليه الصلاة والسلام:\n\n \" مَن عرف نفسه فقد عرف ربه \" \n\nفلا يعرف أحد نفسه إلا بعد كمالها، وكمالُها: أن تصير مرآةً كاملةً تامة مصقولة، قابلة لتجلِّي صفات الحق لها، فيعرف نسفه بالمرآتية، ويعرف ربه بالتجلِّي فيها، كما قال تعالى:\n\n[فصلت: 53] الآية\n هـ\n قلت: حديث:\n\n \" مَن عرف نفسه \" \n\nأنكره النووي، وقال إنه من كلام يحيى بن معاذ وقد اشتهر عند الصوفية حديثاً، ومعناه حق فإنَّ مَن عرف حقيقة نفسه، وأنها مظهر من مظاهر الحق، وغاب عن حس وجوده الوهم، فقد عرف ربه وشَهِدَه، فاطلب المعرفة في نفسك، ولا تطلبها في غيرك، فليس الأمر عنك خارجاً، ولله در الششتري في بعض أزجاله، حيث قال:\n\nوقال أيضاً:\n\nوقوله تعالى: { وفي السماء رزقكم } قال الورتجبي: وفي سماء صفاتي رزق أرواحكم، من مشاهدة النور، وغذاء العلم الرباني، وما توعدون من مشاهدة الذات وكشف عيانه\n هـ\n قلت: هذا قوت الأرواح، أمّا قوت الأشباح فتجب الغيبة عنه، ثقةً بالله، وتوكلاً عليه\n قال في قطب العارفين: اعلم أنه عزّ وجل قسَّم الأرزاق في الأزل، وجزّأه على عمر العبد، ووقَّت أوقاته، وحدَّ للعبد ما يأتيه منه في السنة، والشهر، واليوم، والساعة، فكل ما حدّ لك أن تناله من رزقك عند صلاة العصر، مثلاً، لا تناله عند صلاة الصبح، ولو طلبته بكل حِيلة في السموات والأرض، فإن الطلب لا يجمع، والتوكل لا يمنع\n هـ\n وقال فيه أيضاً: العارف يجد في نفسه الاعتماد على الله، وإن كانت السماء لا تُمطر، والأرض لا تُنبت\n\n\nالخ كلامه، ومثله قول ذي النون: لو كانت السماء من زجاج، والأرض من نحاس لا تُنبت شيئاً، ومصر كلها عيالي، ما اهتممتُ لهم برزقٍ لأنَّ مَن خلقهم هو الذي تكفّل برزقهم\n هـ\n وقال في القطب أيضاً: ومن علامة جهل قلب العالم: خوف شدائد السنيين الآتيات، والاستعداد لها قبل مجيئها، بمصاحبة الاضطراب، وفقد الطمأنينة القسمة السابقة، فمَن اتصف بهذه الصفة فقد نازع الربوبية، وانسلخ من العبودية\n هـ\n ثم سرد قصص الأمم السالفة، وما جرى عليها لأنَّ فيها آيات، فتنخرط في سلك الآيات المتقدمة، فقال: { هَلْ أَتَاكَ حَدِيثُ ضَيْفِ إِبْرَاهِيمَ }\n\n",
      "translations": []
    }
  ]
}