{
  "chapter": "الذاريات",
  "text": "وفى الارض ءايت للموقنين",
  "translations": [
    {
      "translation": "There are signs in the earth for those who are firm in their faith,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are many Signs on earth for those of sure faith,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the earth there is evidence (of the Truth) for those who have strong faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the earth are signs for those who are certain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the earth are signs for those who have faith with certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the earth there are signs for those who are sure,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the earth are signs for those having sure faith;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the earth are portents for those whose faith is sure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the earth, and in yourselves,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the earth there are signs for those who would be convinced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the earth are signs for those who have conviction,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the earth are signs for those of assured Faith,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the earth are signs for those who have Faith with certainty,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those with sure belief there are signs in the earth,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on earth are signs for the convinced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the earth are signs for the certain [in faith]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[51:20] And in the earth, in the way of mountains, seas, trees, fruits, plants and other things, there are signs, indications of God’s power, glory be to Him, exalted be He, and of His Oneness, for those who know with certainty,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And in the earth are portents) signs and lessons, like the trees, beasts, mountains and seas (for those whose faith is sure) for those who have certainty in Muhammad (pbuh) and the Qur'an,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أشار سبحانه إلى حيطة وحدته الذاتية، وشمولها على عموم ما ظهر وبطن في الآفاق والأنفس بالاستقلال والانفراد، وسر سريان هويته الذاتية على ذرائر الكائنات، تنبيهاً للمريد المستبصر، وإيقاضاً لهم عن سنة الغفلة ونعاس النسيان، فقال: { وَفِي ٱلأَرْضِ } أي: عالم المسببات، والاستعدادات المعبرة بالآفاق المعدة لظهور آثار القدرة الكاملة الإلهية من العجائب والغرائب، المتفرعة على كمال العلم، ووفور الحكمة المتقنة آيَاتٌ دلائل واضحات وشواهد لائحات دالة على قدرة الصانع الحكيم، ووحدة ذاته، واختياره في مطلق تصرفاته، واستقلاله في حكمه ومصالحه { لِّلْمُوقِنِينَ } [الذاريات: 20] المنكشفين باليقين العلمي والعيني والحق\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وفي الأرض آياتٌ } دالة على كامل قدرته على البعث وغيره، من حيث أنها مدحوة كالبساط الممهد، وفيها مسالك وفجاج للمتقلبين في أقطارها، والسالكين في مناكبها، وفيها سهل وجبل، وبحر وبر، وقِطع متجاورات، وعيونٌ متفجرات، ومعادن مقنية، ودواب منبثة، مختلفة الصور والأشكال، متباينة الهيئات والأفعال، وهي مع كبر شكلها مبسوطة على الماء، المرفوع فوق الهواء، فالقدرة فيها ظاهرة، والحكمة فيها باهرة، ففي ذلك عبرة { للمُوقنين } الموحِّدين، الذين ينظرون بعين الأعتبار، ويُشاهدون صانعها ببصير الاستبصار\n { وفي أنفسكم } آيات وعجائب القدرة إذ ليس شيء في العالم إلا وفي الأنفس له نظير، مع ما فيه من الهيئات النابعة والمصادر البهية، والترتيبات العجيبة، خَلَقَه نطفة، ثم علقة، ثم مضغة، ثم فصلها إلى العظم والعصب والعروق، فالعظام عمود الجسد، ضمّ بعضها إلى بعض بمفاصل وأقفال رُبطت بها، ولم تكن عظماً واحداً لأنه إذا ذاك يكون كالخشبة، ولا يقوم ولا يجلس، ولا يركع ولا يسجد لخالقه، ثم خلق تعالى المخ في العظام في غاية الرطوبة ليرطب يُبس العظام، ويتقوّى به، ثم خلق سبحانه اللحمَ وعباه على العظام، وسدّ به خلل الجسد، واعتدلت هيئته، ثم خلق سبحانه العروق في جميع الجسد جداول، يجري الغذاء منها إلى أركان الجسد، لكل موضع من الجسد عدد معلوم، ثم أجرى الدم في العروق سيالاً خاثراً، ولو كان يابساً، أو اكتفى مما هو فيه، لم يجرِ في العروق، ثم كسى سبحانه اللحمَ بالجلد كالوعاء له، ولولا ذلك لكان قشراً أحمر، وفي ذلك هلاكه، ثم كساه الشعر وقايةً وزينةً، وليّن أصوله، ولم تكن يابسة مثل رؤوس الإبر، وإلا لم يهنه عيش، وجعل الحواجب والأشفار وقاية للعين ولولا ذلك لأهلكهما الغبار والسقط، وجعلها سبحانه طوع يده، يتمكن من رَفْعِها عند قصد النظر، ومِن إرخائها على جميع العين عند إرادة إمساك النظر عما يضر دِيناً ودُنيا، وجعل شعرها صفّاً واحد لينظر من خللها، ثم خلق سبحانه سفتين ينطبقان على الفم يصونان الحلقَ والفمَ من الرياح والغبار، ولما فيهما من كمال الزينة، ثم خلق الله سبحانه الأسنان ليتمكن من اقطع مأكوله وطحنه، ولم تكن له في أول خلِقته لئلا يذي أمه، وجعلها ثلاثة أصناف: قسم يصلح للكسر، كالأنياب، وقسم يصلح للقطع، كالرباعية، وقسم يصلح للطحن، كالأضراس\n\n\n إلى غير ذلك مما في الإنسان من عجائب الصنع وبدائع التركيب",
      "translations": []
    }
  ]
}