{
  "chapter": "الذاريات",
  "text": "فاخذنه وجنوده فنبذنهم فى اليم وهو مليم",
  "translations": [
    {
      "translation": "So We seized him and his armies, and threw them into the sea, for he was worthy of blame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We seized him and his hosts, and cast them into the sea. He became an object of much blame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We seized him and his army and threw them into the sea. He himself was to be blamed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We therefore seized him and his army and threw them into the sea, while he was blaming himself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We took him and his armies, and dumped them into the sea (Yamm), for he was blameworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We seized him and his hosts and hurled them into the sea and he was blamable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We seized him and his hosts, and We cast them into the sea, and he blameworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We seized him and his hosts and flung them in the sea, for he was reprobate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We seized him and his army and cast them all into the sea: he himself [Pharaoh] was to blame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We laid hold of him and his hosts and flung them into the sea, and he was reproachable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We seized him and his hosts, and cast them into the sea, while he was blameworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We took him and his forces, and threw them into the sea; and his was the blame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We took him and his hosts, and dumped them into the sea, while he was to be blamed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We seized him and his hosts and cast them into the sea. Indeed, he was blameworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We seized him and his troops, and threw them into the sea, and He was to blame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We took him and his soldiers and cast them into the sea, and he was blameworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[51:40] So We seized him and his hosts and cast, flung, them into the waters, the sea, and so they drowned, for he, that is, Pharaoh, was blameworthy, guilty of what is blameworthy, such as denying the messengers and claiming divinity.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So We seized him and his hosts and flung them) and drowned them (in the sea, for he was reprobate) blameworthy in the sight of Allah, and he will also blame himself.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: كذبه، وأنكر عليه ونسب معجزاته إلى السحر وأعمال الجن { فَأَخَذْنَاهُ } غيرة منَّا وتقوية لرسولنا { وَجُنُودَهُ } المظاهرين له { فَنَبَذْنَاهُمْ } وإغرقناهم { فِي ٱلْيَمِّ وَهُوَ } حينئذ { مُلِيمٌ } [الذاريات: 40] نفسه بما يلام عليه من الكفر والعناد وأنواع العتو والفساد، نادم عن جميع ما صدر عنه وما ينفعه من الندم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأخذناه وجنودَه فنبذناهم في اليمِّ } وفيه من الدلالة على عِظَمِ شأن القدرة الربانية، ونهاية حماقة فرعون ما لا يخفى، { وهو مُليمٌ } آتٍ بما يُلام عليه من الكفر والطغيان\n { وفي عادٍ إِذ أرسلنا عليهم الريحَ العقيمَ } وُصفت بالعقيم لأنها أهلكتهم، وقطعت دابرهم، أو: لأنها لم تتضمن خيراً مَّا، من إنشاء مطرٍ، أو إلقاح شجرٍ، وهي الدَّبور، على المشهور، لقوله عليه السلام:\n\n \" نُصرتُ بالصَّبَا، وأُهلكت عادٌ بالدَّبور \" \n",
      "translations": []
    }
  ]
}