{
  "chapter": "الذاريات",
  "text": "وما خلقت الجن والانس الا ليعبدون",
  "translations": [
    {
      "translation": "I only created jinn and man to worship Me.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have not created the jinns and men but to worship Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I created the jinn and humans for nothing else but that they may serve Me;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created jinn and human beings only that they might worship Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I created the jinns and men, only for them to worship Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I created not the Jinn and mankind except that they should worship Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I have not created the jinn and the men except that they should serve Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have not created jinn and mankind except to serve Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I created the jinn and humankind only that they might worship Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I created the jinn and mankind only so that they might worship Me:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And have not created the Jinn and mankind but that they should worship Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I did not create the jinn and the humans except that they may worship Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have only created Jinns and men, that they may serve Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I (Allah) created not the jinns and humans except they should worship Me (Alone).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have not created mankind and jinn except to worship Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I did not create the jinn and the humans except to worship Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I did not create the jinn and mankind except to worship Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[51:56] And I did not create the jinn and mankind except that they may worship Me: the fact that disbelievers do not worship [God] does not contradict this [statement], since a purpose does not have to be realised [in an   act, for it to be valid], as when you may say: ‘I sharpened this pencil in order to write with it’, even though you might not actually write with it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(I created the jinn and humankind only that they might worship Me) to worship me; this concerns only His obedient servants; and it is also said: had Allah created them for worship, they would not have disobeyed him for a blink of an eye. 'AN Ibn Abi Talib said: I have not created them except to command them and entrust them with legal responsibility; and it is also said that this means: I created the jinn and humankind only that they might declare My divine Oneness and worship Me.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا خَلَقْتُ ٱلْجِنَّ وَٱلإِنسَ إِلاَّ لِيَعْبُدُونِ } معناه الا لِيُقرّوا بالوحدانيةِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلم أني { مَا خَلَقْتُ ٱلْجِنَّ وَٱلإِنسَ } وما أظهرت أشباحهم وأظلالهم على هذه الهياكل والهويات، وما صوَّرتهم على هذه الصور البديعة، ما أودعت فيهم ما أودعت من جوهر العقل المفاض { إِلاَّ لِيَعْبُدُونِ } [الذاريات: 56] ويعرفوني، ويتحققوا بوحدتي واستقلالي في وجودي، وفي عموم تصرفاتي، وباستحقاقي للإطاعة والعبودية مطلقاً بلا شوب شركة ومظاهرة من أحد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وما خلقتُ الجنَّ والإِنس إِلا ليعبدون } أي: إلا لنأمرهم بالعبادة والخضوع لربوبيتي، لا لنستعين بهم على شأن من شؤوني، كما هي عادة السادات في كسب العبيد، ليستعينوا بهم على أمر الرزق والمعاش، ويدلّ على هذا التأويل: قوله تعالى { وما أريد منهم من رزق\n\n\n } الخ، قال ابن المنير، إلا لأمرهم بعبادته، لا لطلب رزقٍ لأنفسهم، ولا إطعام لي، كما هو حال السادات من الخلق مع عبيدهم، بل الله هو الذي يرزق، وإنما على عباده العبادة له لأنهم مُكلَّفون، ابتلاءً وامتحاناً، أما الإرادة فكما تعلقت بالعبادة تعلقت بما يخالفها، لقوله:\n\n[الأعراف: 179]\n هـ\n وقيل المعنى: ما خلقهم إلا مستعدين للعبادة، متمكنين منها أتم استعداد، وأكمل تمكُّن، فمنهم مَن أطاع، ومنهم مَن كفر، وهو كقولهم: البقرة مخلوقة للحرث، أي: قابلة لذلك، وقد يكون فيها مَن لا يحرث\n والحاصل: أنه لا يلزم من كون الشيء مُعدّاً لشيءٍ أن يقع منه جميع ذلك\n أو: ما خلقتهم إلا ليتذللوا لي، ولقدرتي، وإن لم يكن ذلك على قواعد شرع، وهذا عام في الكل، طوعاً أو كرهاً إذ كل ما خلق مُنقاد لقدرته وقهريته، عابد له بهذا المعنى\n وفي البخاري: وما خلقت أهل السعادة من الفريقين إلا ليُوحِّدون\n وقال بعضهم: خلقهم ليفْعلوا، ففعل بعضٌ وترك بعضٌ\n وليس فيه حجة لأهل القدر\n هـ\n منه، والمراد بأهل القدر: المعتزلة، القائلون بأن الله تعالى لم يُرد الكفر والمعاصي، وهو باطل، وسيأتي في الإشارة بقية تحقيق إن شاء الله",
      "translations": []
    }
  ]
}