{
  "chapter": "الذاريات",
  "text": "كذلك ما اتى الذين من قبلهم من رسول الا قالوا۟ ساحر او مجنون",
  "translations": [
    {
      "translation": "Equally, no Messenger came to those before them without their saying, 'A magician or a madman!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even thus no apostle came to those before them but they said: \"He is a sorcerer or a mad man.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus has it been (in the past): never did a Messenger come to the nations that preceded them but they said: “(He is) a sorcerer, or a mad-man.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the same way no Messenger came to those who lived before them without his people calling him a magician or an insane person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Similarly, whenever a Noble Messenger came to those before them they always said, “He is a magician or a madman.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise, no Messenger came to those before them but they said: \"A sorcerer or a madman!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus there did not come to those before them an apostle but they said: A magician or a mad man.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even so not a Messenger came to those before them but they said, 'A sorcerer, or a man possessed!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even so there came no messenger unto those before them but they said: A wizard or a madman!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise, there came no messenger to those before them, but they said, \"He is a sorcerer or a madman.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise, there came not an apostle Unto those before them but they said: a magician or a madman!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it was that there did not come any apostle to those who were before them but they said, ‘A magician,’ or ‘A crazy man!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Similarly, no messenger came to the Peoples before them, but they said (of him) in like manner, \"A sorcerer, or one possessed\"!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise, no Messenger came to those before them, but they said: \"A sorcerer or a madman!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Similarly, no Messenger came to those before them but they said: 'Sorcerer, or mad'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise, no messenger came to those before them, but they said, “A sorcerer or a madman.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Similarly, there came not to those before them any messenger except that they said, \"A magician or a madman.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[51:52] Thus there did not come to those who were before them any messenger but they said, that he was: ‘A sorcerer, or a madman!’, in other words, their denial of you, by saying that you are a sorcerer or a madman, was like the denial of communities before them of their messengers by saying that [same thing].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Even so) just as your own people accused you of being a wizard and madman (there came no messenger) calling to Allah (unto those before them) before your people (but they said) to that messenger: (A wizard or a madman!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كَذَلِكَ } أي: الأمر والحكم مثل ذلك أنذرهم، وبلغهم بلا مبالاة بإعراضهم واستهزائهم؛ إذ { مَآ أَتَى } الضالين المسرفين { ٱلَّذِينَ } مضوا { مِن قَبْلِهِمْ مِّن رَّسُولٍ } من الرسل الكرام { إِلاَّ قَالُواْ } حين دعوتهم إلى الإيمان والتوحيد { سَاحِرٌ أَوْ مَجْنُونٌ } [الذاريات: 52] مثل ما يقول هؤلاء الحمقى في شأنك يا أكمل الرسل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { كذلك } أي: الأمر ما ذكر من تكذيبهم الرسول، وتسميتهم له ساحراً أو مجنوناً، ثم فسر ما أجمل بقوله: { ما أتي الذين مِن قبلهم } من قبل قومك { مِن رسولٍ } من رسل الله { إلا قالوا } في حقه: هو { ساحرٌ أو مجنون } فرموهم بالسحر والجنون لجهلهم، { أتَواصَوا به } الضمير للقول، أي: أتواصى الأولون والآخرون بهذا القول، حتى قالوه جميعاً متفقين عليه، { بل هم قومً طاغون } أي: لم يتواصوا به لأنهم لم يتلاقوا في زمان واحد، بل جمعتهم العلة الواحدة، وهي الطغيان، { فتولَّ عنهم } أي: أعرِضْ عن الذين كرّرت عليهم الدعوة، فلم يجيبوا عناداً، { فما أنت بملومٍ } فلا لوم عليك في إعراضك بعدما بلّغت الرسالة، وبذلت مجهودك في البلاغ والدعوة\n { وذَكِّرْ } وَعِظ بالقرآن { فإِنَّ الذكرى تنفعُ المؤمنين } الذي قدّر الله سبحانه وتعالى إيمانهم، أو آمنوا بالفعل، فإنها تزيدهم بصيرة وقوة في اليقين والعلم\n وبالله التوفيق\n الإشارة: الفرار إلى الله يكون من خمسة أشياء: من الكفر إلى الإيمان، ومن المعصية إلى الطاعة بالتوبة، ومن الغفلة إلى اليقظة بدوام الذكر، ومن المقام مع العوائد والحظوظ إلى الزهد بالمجاهدة وخرق العوائد، ومن شهود الحس إلى شهود المعنى، وهو مقام الشهود\n وفي القوت: { ومن كل شيء خلقنا زوجين لعلكم تذكرون } الفَرْد، { ففروا إلى الله } أي: من الأشكال والأضداد إلى الواحد الفرد\n وفي البخاري: \" معناه: من الله إليه \"\n قال القشيري: ارجعوا إلى الله، والإشارة إلى حالتين، إما رغبة في شيء، أو رهبة من شيء، أو حالي خوف ورجاء، أو طلب نفع أو دفع ضر، وينبغي أن يفر من الجهل إلى العلم، ومن الهوى إلى التقوى، ومن الشك إلى اليقين، ومن الشيطان إلى الله، ومِن فعله الذي هو بلاؤه إلى فعله الذي هو كفايته، ومن وصفه الذي هو سخطه، إلى وصفه الذي هو رحمته، ومن نفسه، حيث قال:\n\n\n\n[آل عمران: 28] إلى نفسه، حيث قال: { ففروا إلى الله }\n هـ\n ونقل الورتجبي عن الخراز، فقال: أظهر معنى الربوبية والوحدانية، بأن خلق الأزواج فتخلُص له الفردانية، فلما تبين أن أشكال الأشياء تواقع علة الفناء دعا العباد إلى نفسه لأنه الباقي، وغيره فانٍ، بقوله: { ففروا إلى الله } أي: ففروا مِن وجودكم، ومِن الأشياء كلها، إلى الله بنعت الشوق والمحبة والتجريد عما سواه\nهـ\n ولمَّا أمرهم بالفرار إليه، أَعْلَم أنه ما خلقهم إلا لذلك، فقال: { وَمَا خَلَقْتُ ٱلْجِنَّ وَٱلإِنسَ }\n\n",
      "translations": []
    }
  ]
}