{
  "chapter": "الذاريات",
  "text": "ففروا۟ الى الله انى لكم منه نذير مبين",
  "translations": [
    {
      "translation": "So flee to Allah. Truly I bring you a clear warning from Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So turn to God. I give you a clear warning from Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Flee, therefore, to Allah. Surely I am a clear warner to you from Him;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them,\"Seek refuge in God. I have been sent from Him to plainly warn you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Therefore rush towards Allah; indeed I am from Him, a clear Herald of Warning towards you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, flee to Allah. Verily, I am a plain warner to you from Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore fly to Allah, surely I am a plain warner to you from Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore flee unto God! I am a clear warner from Him to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefor flee unto Allah; lo! I am a plain warner unto you from him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore hasten to God; truly, I am sent by Him to give you clear warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Flee therefore Unto Allah; verily I am Unto you from Him a warner manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘So flee toward Allah. Indeed, I am from Him a manifest warner to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hasten ye then (at once) to Allah: I am from Him a Warner to you, clear and open!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So flee to Allah (from His Torment to His Mercy Islamic Monotheism), verily, I (Muhammad SAW) am a plain warner to you from Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, flee to Allah. I am a clear warner to you from Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“So flee towards God. I am to you from Him a clear warner.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So flee to Allah. Indeed, I am to you from Him a clear warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[51:50] So flee unto God, that is to say, away from His punishment toward His reward by being obedient to Him and not disobeying Him. Truly I am a clear warner to you from Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therefore flee unto Allah) flee from Allah unto Allah; it is also said that this means: flee from contravening against Allah to obeying Him; (lo! I am a plain warner unto you from Him) I am a warning messenger who explains matters to you in a language you understand.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما ثبت أن ظهور الكل منه ورجوعه إليه سبحانه: { فَفِرُّوۤاْ } أيها العارفون الموحدون { إِلَى ٱللَّهِ } المسقط لعموم الإضافات من مقتضيات عالم الناسوت\n وانخلعوا عن لوازم هوياتكم الباطلة وأنانياتكم العاطلة { إِنِّي لَكُمْ مِّنْهُ } بمقتضى وحيه وإلهامه { نَذِيرٌ } أنذركم عما يعوقكم من سلوك طريق توحيده { مُّبِينٌ } [الذاريات: 50] مظهر لكم آداب الطريقة الموصلة إلى مقصد الحقيقة\n التي هي الوحدة الذاتية الإلهية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { فَفِرُّوا إِلى الله } الفاء لترتيب ما بعدها على ما قبلها، أي: إذا كان الأمر كما ذكر من شؤونه تعالى في إهلاك مَن تعدى الحدود، ففِروا إلى الله بالإيمان والطاعة، كي تنجوا من غضبه، وتفوزوا بثواب، أو: ففِرُّوا من الكفر إلى الإيمان، ومن المعصية إلى الطاعة، أو: من طاعة الشيطان إلى طاعة الرحمن، { إِني لكم منه نذير مبين } تعليل للأمر بالفرار إلأيه تعالى، فإنَّ كونه صلى الله عليه وسلم منذراً منه تعالى، لا من تلقاء نفسه، موجب للفرار، وفيه وعد كرمي بنجاتهم من الهروب، وفوزهم بالمطلوب، { ولا تجعلوا مع الله إلهاً آخر } هو نهي موجبٌ للفرار من سبب العقاب، بعد الأمر بالفرار من نفس العقاب، كما يُشعر به قوله تعالى: { إِني لكم منه } أي: من الجعل المنهي عنه { نذير مبين } كأنه قيل: ففرُّوا إلى الله من عقابه، ومن سببه، وهو جعلكم مع الله إلهاً آخر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "71:6",
      "similarity": 0.8292217092376488
    },
    {
      "verse": "80:34",
      "similarity": 0.780830497845077
    },
    {
      "verse": "75:10",
      "similarity": 0.7215259048891228
    },
    {
      "verse": "62:8",
      "similarity": 0.7023328498580077
    },
    {
      "verse": "26:21",
      "similarity": 0.6997647655680262
    }
  ]
}