{
  "chapter": "الذاريات",
  "text": "فان للذين ظلموا۟ ذنوبا مثل ذنوب اصحبهم فلا يستعجلون",
  "translations": [
    {
      "translation": "Those who do wrong will have their due, the same as that of their friends. So they should not hurry Me!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do wrong will indeed come to the same end as their fellows (of old). So let them not ask Me to hasten (the punishment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wrong-doers shall receive a portion of the chastisements as their fellows (of yore). So let them not rush Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unjust will bear a burden like that of their unjust predecessors. Let them not make Me bring immediate punishment upon them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed for these unjust is also a turn of punishment, like that of their companions – so they must not ask Me to hasten.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, for those who do wrong, there is a portion of torment like to the evil portion of torment (which came for) their likes (of old); so let them not ask Me to hasten on!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So surely those who are unjust shall have a portion like the portion of their companions, therefore let them not ask Me to hasten on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The evildoers shall have their portion, like the portion of their fellows; so let them not hasten Me!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! for those who (now) do wrong there is an evil day like unto the evil day (which came for) their likes (of old); so let them not ask Me to hasten on (that day).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wrongdoers will meet the same fate as their predecessors, let them not ask Me to hasten on [the punishment],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So verily Unto those who do wrong there is a portion like Unto the portion of their fellows; wherefore let them not ask Me to hasten on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the lot of those who do wrong [now] will be like the lot of their [earlier] counterparts. So let them not ask Me to hasten on [that fate].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the Wrong-doers, their portion is like unto the portion of their fellows (of earlier generations): then let them not ask Me to hasten (that portion)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, for those who do wrong, there is a portion of torment like to the evil portion of torment (which came for) their likes (of old), so let them not ask Me to hasten on!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The evildoers shall have for their portion, a portion like their companions (who were destroyed before them). Therefore, they should not ask Us to hasten!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do wrong will have their turn, like the turn of their counterparts, so let them not rush Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, for those who have wronged is a portion [of punishment] like the portion of their predecessors, so let them not impatiently urge Me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[51:59] And for those who have wronged, their souls through disbelief, from among the people of Mecca and others, there will assuredly be a lot, a share of chastisement, like the lot, the share, of their counterparts, who perished before them. So let them not ask Me to hasten on, the chastisement, should I give them respite until the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And lo! for those who (now) do wrong) the disbelievers of Mecca (there is an evil day) torment after torment (like unto the evil day (which came for) their likes (of old)) like the torment which befell the nations who came before them; (so let them not ask Me to hasten) chastisement and destruction (on (that day).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَإِنَّ لِلَّذِينَ ظَلَمُواْ ذَنُوباً مِّثْلَ ذَنُوبِ أَصْحَابِهِمْ } معناه نَصيبٌ\n وقال: سَجيلٌ\n وقال: سبيلٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { فَإِنَّ لِلَّذِينَ ظَلَمُواْ } على الرسول صلى الله عليه وسلم بأنواع التكذيب والإنكار والاستهزاء والاستحقار { ذَنُوباً } حظاً وافراً ونصيباً كاملاً من العذاب الآجل العاجل { مِّثْلَ ذَنُوبِ أَصْحَابِهِمْ } أي: مثل نصيب أسلافهم من الكفرة المكذبين للرسل الماضين، وسليحقهم مثل ما لحقهم، بل بأضعافه وآلافه { فَلاَ يَسْتَعْجِلُونِ } [الذاريات: 59] لحوقه وحلوله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإِنَّ للذين ظلموا } أنفسهم، بتعريضها للعذاب، حيث كذّبوا الرسولَ صلى الله عليه وسلم، أو: وضعوا التكذيب مكان التصديق، وهم أهل مكة، { ذنوباً } أي: نصيباً وافراً من العذاب، { مثل ذنوب أصحابهم } مثل عذاب نظائرهم من الأمم المحكية\n\n\nقال الزجاج: الذَنوب في اللغة، النصيب، مأخوذ من مقاسمة السُقاة الماءَ بالذنوب، وهو الدلو العظيم المملوء\n { فلا يستعجلون } ذلك النصيب، فإنه لاحق بهم، وهذا جواب النضر وأصحابه حين استعجلوا العذاب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "81:9",
      "similarity": 0.48417650486177755
    },
    {
      "verse": "3:16",
      "similarity": 0.4670557430814327
    },
    {
      "verse": "26:14",
      "similarity": 0.45884552970938985
    },
    {
      "verse": "26:204",
      "similarity": 0.4507548624171378
    },
    {
      "verse": "37:176",
      "similarity": 0.4507548624171378
    }
  ]
}