{
  "chapter": "الذاريات",
  "text": "فويل للذين كفروا۟ من يومهم الذى يوعدون",
  "translations": [
    {
      "translation": "Woe then to those who are kafir on account of the Day they have been promised!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alas the woe for those who refuse to believe in the Day which has been promised them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe, then, betide those who disbelieved in that Day of theirs which they are being asked to hold in dread.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe to the disbelievers when the day with which they have been threatened comes!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So ruin is for disbelievers, from their day – which they are promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then woe to those who disbelieve from their Day which they have been promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore woe to those who disbelieve because of their day which they are threatened with.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So woe to the unbelievers, for that day of theirs that they are promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And woe unto those who disbelieve, from (that) their day which they are promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "woe, then, to those who are bent on denying the truth, when the Day arrives which they have been promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe, then, Unto those who disbelieve in their Day which they are promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe to the faithless for the day they are promised!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe, then, to the Unbelievers, on account of that Day of theirs which they have been promised!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, woe to those who disbelieve (in Allah and His Oneness Islamic Monotheism) from (that) their Day which they have been promised (for their punishment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe then to the unbelievers for their Day which they were promised!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So woe to those who disbelieve because of that Day of theirs which they are promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And woe to those who have disbelieved from their Day which they are promised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[51:60] For woe, a terrible chastisement [will come], to those who disbelieve, from, upon, that day of theirs which they are promised, that is, the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And woe) severe punishment (unto those who disbelieve) in Muhammad (pbuh) and the Qur'an, (from (that) their day which they are promised) from the torment with which they are threatened and which was explained in surah the Mount (al-Tur)'. And of the surah in which the Mount is mentioned, which is all Meccan and consists of 49 verses, 812 words and 1,500 letters: Surah 52: The Mount (al-Tur) And of the surah in which the Mount is mentioned, which is all Meccan and consists of 49 verses, 812 words and 1,500 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { فَوَيْلٌ } عظيم، وعذاب شديد هائل نازل { لِّلَّذِينَ كَفَرُواْ } ستروا الحق، وأعرضوا عنه، وأظهروا الباطل، وأصروا عليه { مِن يَوْمِهِمُ } الفظيع الفجيع { ٱلَّذِي يُوعَدُونَ } [الذاريات: 60] في النشأة الأخرى، وهو يوم القيامة المعدة لتعذيب العصاة والغواة وتفضيحهم فيه\n\n\nجعلنا الله من الآمنين فيه، الناجين من عذاب بفضله ولطفه\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها الموحد المجبول على فطرة المعرفة واليقين، أن تتفكر في حكمة ظهورك ومصلحة بروزك من كتم العدم في معرفة نفسك في عموم أحوالك؛ لينكشف لك من التأمل فيها الإطلاع على موجدها ومظهرها واتصافه بالأوصاف الكاملة والأسماء الشاملة\n\n\n\n\nثم منها إلى توحيده واستقلاله في الوجود، وعموم الآثار المترتبة عليها، حتى تفوز إلى غاية قصواك ومبتغاك من اليقين والإيمان، ونهاية ما يترتب على ظهورك من التوحيد والعرفان، والله المستعان وعليه التكلان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فويلٌ للذين كفروا } وضع الموصول موضع ضميرهم تسجيلاً عليهم بالكفر، أي: فويلٌ لهم { من يومهِمُ الذي يُوعَدون } أي: من يوم القيامة، أو يوم بدر، والأول أنسب لما في صدر السورة الآتية\n الإشارة: اعلم أن الحق - جلّ جلاله - إنما بعث الرسلَ بإظهار الشرائع، ليحوّشوا العباد إلى الله، ويدعوهم إليه كافة، ويأمروهم بالتبتُّل والانقطاع، من غير التفات لمَن سبق له السعادة والشقاء لأن ذلك من سر القدر، وغيب المشيئة لا يجوز كشفه في حالة الدعوة، فقوله تعالى: { وما خلقتُ الجن والإنس إلا ليعبدون } هذا ما يمكن الأمر به في ظاهر الأمر، ويُؤمر بإظهاره في حالة الدعوة، وكون الحق الحق تبارك وتعالى أراد من قوم الكفر والمعاصي من غيب المشيئة، وسر القدر لا يقدح في عموم الدعوة التي تعلقت بالظواهر لأنه من قبيل الحقيقة، وما جاءت الرسل إلا بالشريعة، فالدعاة إلى الله يُعممون الدعوة، ويُحرِّضون على التبتُّل والأنقطاع إلى الله، وينظرون إلى ما يبرز من غيب المشيئة\n وقال الورتجبي: عن جعفر الصادق { وما خلقت الجن والإنس إلا ليعبدون } أي: ليعرفوني\n هـ\n ومداره قوله صلى الله عليه وسلم فيما يحكيه عن رب العزة:\n\n \" كنت كنزاً مخفياً لم أُعرف، فأحببتُ أن أُعرف، فخلقت الخلق لأُعرف \" \n\nأي: ما أظهرت الخلق إلا لأُعرف بهم، فتجليت بهم في قوالب العبودية، لتظهر ربوبيتي في قوالب العبودية، فتظهر قدرتي وحكمتي، فسبحان الحكيم العليم\n قال أبو السعود: ولعل السر في التعبير عن المعرفة بالعبادة للتبيه على أن المعتَبر هي المعرفة الحاصلة بعبادته تعالى، لا ما يحصل بغيرها، كمعرفة الفلاسفة\n هـ\n قلت: وكل معرفة وحقيقة لا تصحبها شريعة لا عبرة بها، بل هي زندقة أو دعوى\n وبالله التوفيق\n وقوله تعالى: { إِن الله هو الرزّاقُ ذو القوة المتين } هذه الآية وأمثالها هي التي غسلت الأمراض والشكوك من قلوب الصدِّيقين، حتى حصل لهم اليقين الكبير، فسكنت نفوسُهم، واطمأنت قلوبهم، فهم في روح وريحان\n والأحاديث في ضمان الرزق كثيرة، وأقوال السلف كذلك، وفي حديث أبي سعيد الخدري عنه صلى الله عليه وسلم قال:\n\n \" لو فَرَّ أحدُكم من رِزْقه لتبعه كما يَتْبعه الموتُ \" \n\nوقال أيضاً عن الله عزّ وجل: \" يقول:\n\n \" يا ابن آدم تفرَّغْ لعبادتي، املأ صدرك غِنىً، وأسُد فقرك، وإلا تفعل ملأت يدك شُغلاً \" \n\n، وقال صلى الله عليه وسلم:\n\n \" مَن كانت الآخرة هَمَّه، جعل الله غناه في قلبه، وجمع له شَمْلَه، وأتته الدنيا وهي صاغرة، ومَن كانت الدنيا همه جعل الله فقرّه بين عينيه، وفرَّق عليه شملَه، ولم يأته من الدنيا إلا ما قُدِّر له \"\n \n\n \n\nوقال المحاسبي: قلت لشيخنا: من أين وقع الاضطراب في القلوب، وقد جاء الضمان من الله عزّ وجل؟ قال: من وجهين: من قلة المعرفة وقلة حسن الظن\n ثم قال: قلت: شيء غيره؟ قال: نعم، إن الله عزّ وجل وَعَدَ الأرزاق وضمِنها، وغيّب الأوقات، ليختبر أهل العقول، ولولا ذلك لكان كل المؤمنين راضين، صابرين، متوكلين، لكن الله - عزّ وجل - أعلمهم أنه رازقهم، وحلف لهم، وغيّب عنهم أوقات العطاء، فمِن هنا عُرف الخاص من العام، وتفاوت العباد، فمنهم ساكن، ومنهم متحرك، ومنهم ساخط، ومنهم جازع، فعلى قدر ما تفاوتوا في المعرفة تفاوتوا في اليقين\n هـ\n مختصراً\n وبالله التوفيق\n وصلّى الله على سيدنا محمد وآله وصحبه وسلّم\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "52:11",
      "similarity": 0.7595119409518241
    },
    {
      "verse": "77:15",
      "similarity": 0.7520481362146496
    },
    {
      "verse": "77:19",
      "similarity": 0.7520481362146496
    },
    {
      "verse": "77:24",
      "similarity": 0.7520481362146496
    },
    {
      "verse": "77:28",
      "similarity": 0.7520481362146496
    }
  ]
}