{
  "chapter": "الطور",
  "text": "فذكر فما انت بنعمت ربك بكاهن ولا مجنون",
  "translations": [
    {
      "translation": "Remind them then! For, by the blessing of your Lord, you are neither a soothsayer nor a madman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remind them, therefore, that by the grace of your Lord you are neither a soothsayer nor possessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So exhort (them, O Prophet), for by your Lord's Grace, you are neither a soothsayer nor a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), remind them, by the Grace of your Lord, that you are neither a soothsayer or an insane person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore (O dear Prophet Mohammed – peace and blessings be upon him), enlighten, for by the munificence of your Lord, you are neither a soothsayer nor a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, remind. By the grace of Allah, you are neither a Kahin nor a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore continue to remind, for by the grace of your Lord, you are not a soothsayer, or a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore remind! by thy Lord's blessing thou art not a soothsayer neither possessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefor warn (men, O Muhammad). By the grace of Allah thou art neither soothsayer nor madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore continue to give warning, for by the grace of your Lord, you are not a soothsayer or a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore admonish thou! thou art not, by the grace of thy Lord, a soothsayer or a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So admonish. By your Lord’s blessing, you are not a soothsayer, nor mad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore proclaim thou the praises (of thy Lord): for by the Grace of thy Lord, thou art no (vulgar) soothsayer, nor art thou one possessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, remind and preach (mankind, O Muhammad SAW of Islamic Monotheism). By the Grace of Allah, you are neither a soothsayer, nor a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, remind. By the Favor of Allah, you are neither a soothsayer, nor mad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So remind. By the grace of your Lord, you are neither a soothsayer, nor a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So remind [O Muhammad], for you are not, by the favor of your Lord, a soothsayer or a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[52:29] So remind, persist in reminding the idolaters and do not desist [from this] even if they say to you that you are a soothsayer or a madman. For by the grace of your Lord, by His bestowal of grace on you, you are neither soothsayer (bi-kāhinin is the predicate of mā) nor madman (wa-lā majnūnin, a supplement to it).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therefore warn) therefore, admonish by means of the Qur'an, Muhammad. (By the grace of Allah) prophethood and Islam (thou art neither soothsayer) foretelling the future (nor madman) bewitched.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمعت يا أكمل الرسل ما سمعت من فضل الله، ولطفه، وسعة رحمته، وجوده مع أوليائه { فَذَكِّرْ } واثبت على العظة والتكذير لعموم عباد الله، ولا تبالِ بقولهم الباطل في حقك { فَمَآ أَنتَ بِنِعْمَةِ رَبِّكَ } التي هي الآيات المنزلة إليك، الملهمة من ربك { بِكَاهِنٍ } مبتدع مفتر مجترئ على الإخبار عن المغيبات بلا روحي من قبل الحق وإلهام من جانبه { وَلاَ مَجْنُونٍ } [الطور: 29] مختل العقل، مخبط الرأي كما يزعم في شأنك المسرفون المتفرون",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { فذكِّرْ } أي: فاثبت على ما أنت عليه من تذكير الناس وموعظتهم، { فما أنت بنعمتِ ربك } أي: بحمده وإنعامه عليك بالنبوة ورجاحة العقل { بكاهنٍ ولا مجنونٍ } كما زعموا، قاتلهم الله أنَّى يؤفكون، { أم يقولون شاعرٌ نتربصُ به رَيْبَ المَنونِ } أي: حوادث الدهر، أي: ننتظر به نوائب الزمان حتى يهلك كما هلك الشعراء من قبله، زهير والنابغة\n و \" أم \" في هذه الآي منقطعة بمعنى \" بل \"\n { قل تربصوا فإِني معكم من المتربصين } أتربّص هلاككم، كما تتربصون هلاكي\n وفيه عِدة كريمة بإهلاكهم، وقد جرب أنّ مَن تربص موت أحد لِينال رئاسته، أو ما عنده، لا يموت إلا قبله\n { أم تأمرهم أحلامُهم } أي: عقولهم { بهذا } التناقض في المقالات، فإنَّ الكاهن يكون ذا فطنة ودقة نظر في الأمور، والمجنون مُغطى عقله، مختل فكره، والشاعر يقول ما لا يفعل، فكيف يجتمع أوصاف هؤلاء في واحد؟ وكانت قريش يُدْعَون أهل الأحلام والنُهي، فكذبهم ما صدر منهم من هذه المقالات المضطربة، { أم هم قوم طاغُون } يجُازون الحدودَ في المكابرة والعناد، ولا يحومون حول الرشد والسداد\n وإسناد الأمر إلى الأحلام مجاز\n { أم يقولون تَقوَّله } اختلقته من تلقاء نفسه، { بل لا يؤمنون } ردّ عليهم، أي: ليس الأمر كما زعموا، بل لكفرهم وعنادهم يقذفون بهذه الأباطيل، التي لا يخفى بطلانها على أحد، فكيف يقدر البشر أن يأتي بما عجز عنه كافة الأمم من العرب والعجم، { فليأتوا بحديثٍ مِثْلِه } أي: مثل القرآن في البلاغة والإعجاز { إِن كانوا صادقين } في أن محمداً تقوّله من تلقاء نفسه لأنه بلغاتهم، وهم فصحاء، مشاركون له صلى الله عليه وسلم في العربية والبلاغة، مع ما لهم من طُول الممارسة للخطب والأشعار، وكثرة المقاولة للنظم والثر، والمبالغة في حفظ الوقائع والأيام، ولا ريب في أن القدرة على الشيء من موجبات الإتيان به مع دواعي الأمر بذلك من تعجيزهم وإفحامهم وطلب معارضتهم\n { أم خُلقوا من غير شيءٍ } أي: أم أُحدثوا وقُدّروا هذا التقدير البديع، الذي عليه فطرتهم، من غير محدث ومقدّر\n أو: أم خُلقوا من غير شيء من الحكمة، بأن خُلقوا عبثاً، فلا يتوجه عليهم حساب ولا عقاب؟ { أم هم الخالقون } المُوجدون لأنفسهم؟ فيلزم عليه الدور، وهو تقدُّم الشيء على نفسه وتأخُّره عنها، { أم خَلقوا السماوات والأرض } فلا يعبدون خالقِهما { بل لا يُوقنون } لا يتدبرون في الآيات، فيعلمون خالقهم، وخالق السموات والأرض، فيُفردونه بالعبادة\n { أم عندهم خزائنُ ربك } من النبوة والرزق وغيرهما، فيخصُّوا بما شاؤوا مَن شاؤوا، { أم هم المصَيْطِرون } أي: الأرباب الغالبون، المُسلَّطون على الأمور يدبرونها كيف شاؤوا، حتى يُدبروا أمر الربوبية، ويبنوا الأمور على إرادتهم ومشيئتهم\n\n\nوقرأ المكي والشامي بالسين على الأصل\n { أم لهم سُلَّمٌ } منصوب يرتقون به إلى السماء، { يستمعون فيه } كلامَ الملائكة، وما يُوحى إليهم من علم الغيب، حتى يعلموا أن ما هم عليه حق، وما عليه غيرهم باطل، أو ما هو كائن من الأمور التي يتفوّهون بها رجماً بالغيب، ويعلّقون بها أطماعهم الفارغة من هلاكه صلى الله عليه وسلم قبلهم، وانفرادهم بالرئاسة\n و \" في \": سببية، أي: يستمعون بسبب حصولهم فيه، أو: ضمّن \" يستمعون \" يعرجون\n وقال الزجاج: { يستمعون فيه } أي: عليه، { فليأت مُستمعهم بسلطانٍ مبين } بحجة واضحة، تصدق استماع مستمعهم\n ثم سفَّه أحلامهم بقوله: { أم له البناتُ ولكم البنونَ } حيث اختاروا لله ما يكروهون وهم حكماء في زعمهم، { أم تسألُهم أجراً } على التبليغ والإنذار { فهم } لأجل ذلك { من مَغْرَم مُثقلون } أي: من التزام غرامة فادحة محمّلون الثقل، فلذلك لا يتبعونك\n والمغرم: أن يُلزم الإنسان ما ليس عليه\n { أم عندهم الغيبُ } أي: اللوح المحفوظ، المكتوب فيه الغيوب، { فهم يكتبون } ما فيه، حتى يتكلمون في ذلك بنفي أو إثبات\n { أم يُريدون كيداً } هو كيدهم برسول الله صلى الله عليه وسلم في دار الندوة، { فالذين كفروا } وهم المذكورون، ووضع الموصول موضع ضميرهم للتسجيل عليهم بالكفر، أي: فـ { هم المكِيدُونَ } الذين يحيق بهم كيدّهم، ويعود عليه وبالُه، لا مَن أرادوا أن يكيدوه وهو ما أصابهم يوم بدر وغيره\n { أَم لهم إِلهٌ غيرُ الله } يمنعهم من عذابه، { سبحان الله عما يُشركون } أي: تنزيهاً له عن إشراكهم، أو: عن شركة ما يُشركونه به\n وحاصل ما ذكر الحق وتعالى من الإضرابات: أحد عشر، ثمانية طعنوا بها في جانب النبوة، وثلاثة في جانب الربوبية، وهو قوله: { أم خُلقوا من غير شيء } ، { أم خَلقوا السماوات والأرض } ، { أم لهم إله غير الله } ذكرها الحق تعالى تسلية لرسول الله صلى الله عليه وسلم أي: كما طعنوا في جنابك طعنوا في جانبي، فاصبر حتى نأخذهم\n الإشارة: فذكِّر أيها الخليفة للرسول، فما أنت بحمد الله بكاهنٍ ولا مجنونٍ، وإن رموك بشيء من ذلك\n قال القشيري: قد علموا أنه صلى الله عليه وسلم بريء من الكهانة والجنون، ولكنهم قالوه على جهة الاشتفاء، كالسفيه إذا بسط لسانه فيمن يشنأُه، بما يعلم أنه بريء مما يقوله\n هـ\n وكل ما قيل في جانب النبوة يُقال مثله في جانب الولاية، سُنَّة ماضية\nقال القشيري: طبع الإنسان متنفرة من حقيقة الدين، مجبولة على حب الدنيا والحظوظ، لا يمكن الخروج منها إلا بجهد جهيد، على قانون الشريعة، ومتابعة الرسول عليه السلام وخلفائه، وهم العلماء الربانيون، الراسخون في العلم بالله، من المشايخ المُسلِّكين في كل زمان، والخلق مع دعوى إسلامهم يُنكرون على سيرهم في الأغلب، ويستبعدون ترك الدنيا والعزلة، والانقطاع عن الخلق، والتبتُّل إلى الله، وطلب الأمن\n\n\nكتب الله في قلوبهم الإيمان، وأيَّدهم بروح منه، وهو الصدق في الطلب، وحسن الإرادة المنتجَة من بذر { يُحبهم ويُحبونه } وذلك فضل الله يؤتيه من يشاء\n هـ\n مختصراً\n وقوله تعالى: { قل تربصوا\n\n\n } الآية، قال القشيري: ولا ينبغي لأحد أن يتمنى نفاق سوقه بموت أحد، لتنتهي النوبة إليه، قَلَّ ما تكون هذه صفته إلا سَبَقَته منيتُه، ولا يدرك ما تمناه\n هـ\n وقال في مختصره: الآية تُشير إلى التصبُّر في الأمور، ودعوة الخلق إلى الله، والتوكُّل على الله فيما يجري على يد عباده، والتسليم لأحكامه في المقبولين والمردودين\n هـ\n وقوله: { أم تأمرهم أحلامُهم بهذا }\n\n\n إلى قوله: { عما يشركون } هذه صفة أهل الانتقاد على أهل الخصوصية في كل زمان، وهي تدلّ على غاية حمقهم وسفههم، نجانا الله من جميع ذلك\n ثم هدّدهم بعد تبيين عنادهم، فقال: { وَإِن يَرَوْاْ كِسْفاً مِّنَ ٱلسَّمَآءِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "69:42",
      "similarity": 0.9725776049423935
    },
    {
      "verse": "68:2",
      "similarity": 0.05568141222950572
    },
    {
      "verse": "9:21",
      "similarity": 0.05158161554585172
    },
    {
      "verse": "68:34",
      "similarity": 0.05077461267534796
    },
    {
      "verse": "10:9",
      "similarity": 0.04882291883140743
    }
  ]
}