{
  "chapter": "الطور",
  "text": "فذكر فما انت بنعمت ربك بكاهن ولا مجنون",
  "translations": [
    {
      "translation": "Remind them then! For, by the blessing of your Lord, you are neither a soothsayer nor a madman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remind them, therefore, that by the grace of your Lord you are neither a soothsayer nor possessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So exhort (them, O Prophet), for by your Lord's Grace, you are neither a soothsayer nor a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), remind them, by the Grace of your Lord, that you are neither a soothsayer or an insane person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore (O dear Prophet Mohammed – peace and blessings be upon him), enlighten, for by the munificence of your Lord, you are neither a soothsayer nor a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, remind. By the grace of Allah, you are neither a Kahin nor a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore continue to remind, for by the grace of your Lord, you are not a soothsayer, or a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore remind! by thy Lord's blessing thou art not a soothsayer neither possessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefor warn (men, O Muhammad). By the grace of Allah thou art neither soothsayer nor madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore continue to give warning, for by the grace of your Lord, you are not a soothsayer or a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore admonish thou! thou art not, by the grace of thy Lord, a soothsayer or a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So admonish. By your Lord’s blessing, you are not a soothsayer, nor mad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore proclaim thou the praises (of thy Lord): for by the Grace of thy Lord, thou art no (vulgar) soothsayer, nor art thou one possessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, remind and preach (mankind, O Muhammad SAW of Islamic Monotheism). By the Grace of Allah, you are neither a soothsayer, nor a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, remind. By the Favor of Allah, you are neither a soothsayer, nor mad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So remind. By the grace of your Lord, you are neither a soothsayer, nor a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So remind [O Muhammad], for you are not, by the favor of your Lord, a soothsayer or a madman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[52:29] So remind, persist in reminding the idolaters and do not desist [from this] even if they say to you that you are a soothsayer or a madman. For by the grace of your Lord, by His bestowal of grace on you, you are neither soothsayer (bi-kāhinin is the predicate of mā) nor madman (wa-lā majnūnin, a supplement to it).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَذَكِّرْ فَمَا أَنْتَ بِنِعْمَةِ رَبِّكَ بِكَاهِنٍ وَلَا مَجْنُونٍ (29(تفريع على ما تقدم كله من قوله : { إن عذاب ربك لواقع } \\[ الطور : 7 \\] لأنه تضمن تسلية الرسول صلى الله عليه وسلم عن تكذيب المكذبين والافتراء عليه ، وعقب بهذا لأن من الناس مؤمنين به متيقنين أن الله أرسله مع ما أعد لكلا الفريقين فكان ما تضمنه ذلك يقتضي أن في استمرار التذكير حكمة أرادها الله ، وهي ارعواء بعض المكذبين عن تكذيبهم وازدياد المصدقين توغلاً في إيمانهم ، ففرع على ذلك أن أمر الله رسول صلى الله عليه وسلم بالدوام على التذكير .فالأمر مستعمل في طلب الدوام مثل { يا أيها الذين آمنوا آمنوا باللَّه ورسوله } \\[ النساء : 136 \\] . ولما كان أثر التذكير أَهمَّ بالنسبة إلى فريق المكذبين ليهتدي من شرح قلبه للإِيمان رُوعي ما يَزيد النبي صلى الله عليه وسلم ثباتاً على التذكير من تبرئته مما يواجهونه من قولهم له : هو كاهن أو هو مجنون ، فربط الله جَأش رسوله صلى الله عليه وسلم وأعلمه بأن براءته من ذلك نعمة أنعم بها عليه ربه تعالى ففرع هذا الخبر على الأمر بالتذكير بقوله : { فما أنت بنعمت ربك بكاهن ولا مجنون } . والباء في { بنعمت ربك } للملابسة وهي في موضع الحال من ضمير { أنت } .ونفي هاذين الوصفين عنه في خطاب أمثاله ممن يستحق الوصف بصفات الكمال يدل على أن المراد من النفي غرض آخر وهو هنا إبطال نسبة من نسبه إلى ذلك كما في قوله تعالى : { وما صاحبكم بمجنون } \\[ التكوير : 22 \\] ، ولذلك حسن تعقيبه بقوله : { أم يقولون شاعر } \\[ الطور : 30 \\] مصرحاً فيه ببعض أقوالهم ، فعلم أن المنفي عنه فيما قبله مقالة من مقالهم .وقد اشتملت هاته الكلمة الطيبة على خصائص تناسب تعظيم من وجهت إليه وهي أنها صيغت في نظم الجملة الاسمية فقيل فيها «ما أنت بكاهن» دون : فلست بكاهن ، لتدل على ثبات مضمون هذا الخبر .وقدم فيها المسند إليه مع أن مقتضى الظاهر أن يقدم المسند وهو { كاهن } أو { مجنون } لأن المقام يقتضي الاهتمام بالمسند ولكن الاهتمام بالضمير المسند إليه كان أرجح هنا لما فيه من استحضار معاده المشعر بأنه شيء عظيم وأفاد مع ذلك أن المقصود أنه متصف بالخبر لا نفس الإِخبار عنه بالخبر كقولنا : الرسول يأكل الطعام ويتزوج النساء . وأفاد أيضاً قصراً إضافياً بقرينة المقام لقلب ما يقولونه أو يعتقدونه من قولهم : هو كاهن أو مجنون ، على طريقة قوله تعالى : { وما أنت علينا بعزيز } \\[ هود : 91 \\] .وقرن الخبر المنفي بالباء الزائدة لتحقيق النفي فحصل في الكلام تقويتان ، وجيء بالحال قبل الخبر ، أو بالجملة المعترضة بين المبتدأ والخبر ، لتعجيل المسرة وإظهار أن الله أنعم عليه بالبراءة من هذين الوصفين .وعدل عن استحضار الجلالة بالاسم العلم إلى تعريفه بالإِضافة وبوصفه الرب لإِفادة لطفه تعالى برسوله صلى الله عليه وسلم لأنه ربه فهو يربُّه ويدبر نفعه ، ولتفيد الإضافة تشريف المضاف إليه .وقوله تعالى : { فما أنت بنعمت ربك بكاهن ولا مجنون } ردّ على مقالة شَيبة بن ربيعة قال في رسول الله صلى الله عليه وسلم هو كاهن ، وعلى عقبة بن أبي معيط إذ قال : هو مجنون ، ويدل لكونه رداً على مقالة سبقت أنه أتبعه بقوله : { أم يقولون شاعر } \\[ الطور : 30 \\] ما سيكون وما خفي مما هو كائن .والكاهن : الذي ينتحل معرفة ما سيحدث من الأمور وما خفي مما هو كائن ويخبر به بكلام ذي أسْجاع قصيرة . وكان أصل الكلمة موضوعة لهذا المعنى غير مشتقة ، ونظيرها في العبرية ( الكوهين ( وهو حافظ الشريعة والمفتي بها ، وهو من بني ( لاوي ( ، وتقدم ذكر الكهانة عند قوله تعالى : { وما تنزلت به الشياطين } في سورة الشعراء ( 210 ( .وقد اكتُفي في إبطال كونه كاهناً أو مجنوناً بمجرد النفي دون استدلال عليه ، لأن مجرد التأمل في حال النبي صلى الله عليه وسلم كاففٍ في تحقق انتفاء ذينك الوصفين عنه فلا يحتاج في إبطال اتصافه بهما إلى أكثر من الإِخبار بنفيهما لأن دليله المشاهدة .\n\n",
      "translations": [
        {
          "translation": "(Therefore warn) therefore, admonish by means of the Qur'an, Muhammad. (By the grace of Allah) prophethood and Islam (thou art neither soothsayer) foretelling the future (nor madman) bewitched.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وجوده مع أوليائه { فَذَكِّرْ } واثبت على العظة والتكذير لعموم عباد الله\n ولا تبالِ بقولهم الباطل في حقك { فَمَآ أَنتَ بِنِعْمَةِ رَبِّكَ } التي هي الآيات المنزلة إليك\n الملهمة من ربك { بِكَاهِنٍ } مبتدع مفتر مجترئ على الإخبار عن المغيبات بلا روحي من قبل الحق وإلهام من جانبه { وَلاَ مَجْنُونٍ } [الطور: 29] مختل العقل\n مخبط الرأي كما يزعم في شأنك المسرفون المتفرون",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { فذكِّرْ } أي: فاثبت على ما أنت عليه من تذكير الناس وموعظتهم\n { فما أنت بنعمتِ ربك } أي: بحمده وإنعامه عليك بالنبوة ورجاحة العقل { بكاهنٍ ولا مجنونٍ } كما زعموا\n قاتلهم الله أنَّى يؤفكون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "69:42",
      "similarity": 0.9725776049423935
    },
    {
      "verse": "68:2",
      "similarity": 0.05568141222950572
    },
    {
      "verse": "9:21",
      "similarity": 0.05158161554585172
    },
    {
      "verse": "68:34",
      "similarity": 0.05077461267534796
    },
    {
      "verse": "10:9",
      "similarity": 0.04882291883140743
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/052029.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/052029.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/52:29.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}