{
  "chapter": "الطور",
  "text": "انا كنا من قبل ندعوه انه هو البر الرحيم",
  "translations": [
    {
      "translation": "Beforehand we certainly used to call on Him because He is the All-Good, the Most Merciful.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We used to pray to Him erstwhile; He is the just and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Formerly we had always prayed to Him. Surely He is Most Benign, Most Compassionate.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had prayed to Him; He is Kind and All-merciful\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Indeed we used to worship Him in our previous life; indeed He only is the Benign, the Most Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We used to invoke Him before. Verily, He is the Most Subtle, the Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely we called upon Him before: Surely He is the Benign, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "we were before ever calling upon Him; surely He is the All-benign, the All-compassionate.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! we used to pray unto Him of old. Lo! He is the Benign, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "before this, we used to pray to Him. Surely, He is the Beneficent, the Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily we were wont to pray Unto Him aforetime; verily He! it is He, the Benign, the Merciful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We used to supplicate Him aforetime. Indeed He is the All-benign, the All-merciful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, we did call unto Him from of old: truly it is He, the Beneficent, the Merciful!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We used to invoke Him (Alone and none else) before. Verily, He is Al-Barr (the Most Subtle, Kind, Courteous, and Generous), the Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before, we were supplicating to Him. He is the Giving, the Most Merciful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before this, we used to pray to Him. He is the Good, the Compassionate.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, we used to supplicate Him before. Indeed, it is He who is the Beneficent, the Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[52:28] indeed before, that is, in the world, we used to call on Him, worship Him, affirming His Oneness. Verily He is (read innahu as the beginning of a new [independent] sentence, even if it introduces the reason in terms of its import; or read annahu as a reason in terms of the [syntactical] order of the words) the Benign, the Beneficent, the True to His promise, the Merciful, One of tremendous mercy.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! we used to pray unto Him) we used to worship Him and declare His divine Oneness (of old) before this forgiveness, mercy and entry into the Garden. (Lo! He is the Benign) He is Truthful in His word regarding that which He promised us, (the Merciful) towards His believing slaves, since He hath shown mercy towards us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّا كُنَّا مِن قَبْلُ } في دار الدنيا قبل حلول الساعة وقيام القيامة { نَدْعُوهُ } سبحانه، ونسأل منه الحفظ والوقاية من عذابه ونكاله في هذا اليوم الموعود، وكيف لا نسأ منه؟! إنه سبحانه { هُوَ ٱلْبَرُّ } المحسن المخصوص المنحصر على الإحسان والإنعام { ٱلرَّحِيمُ } [الطور: 28] كثير الرحمة والامتنان على السائلين المؤمنين المستحقين، فاستحاب سبحانه بلطفه سؤالنا، وأنجح آمالنا بمقتضى سعة جوده ورحمته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "82:13",
      "similarity": 0.7548812583315822
    },
    {
      "verse": "83:22",
      "similarity": 0.7548812583315822
    },
    {
      "verse": "80:16",
      "similarity": 0.6494992652203286
    },
    {
      "verse": "83:18",
      "similarity": 0.5226911698988246
    },
    {
      "verse": "2:224",
      "similarity": 0.47899490090449226
    }
  ]
}