{
  "chapter": "الطور",
  "text": "والذين ءامنوا۟ واتبعتهم ذريتهم بايمن الحقنا بهم ذريتهم وما التنهم من عملهم من شىء كل امرئۭ بما كسب رهين",
  "translations": [
    {
      "translation": "And We will unite those who had iman with their offspring, who followed them in iman, and We will not undervalue their own actions in any way. Every man is in pledge for what he earned.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed, and whose progeny also followed them in their faith, will be united with their offspring. We will not deprive them of their labour in the least. Every man is bound to what he does.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall unite the believers with those descendants of theirs who followed them in their faith, and shall not deny them any part of the reward for their good deeds. Every person is pledged to what he did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The offspring of the believers will also follow them to Paradise. So shall We join their offspring to them because of their faith. We shall reduce nothing from their deeds. Everyone will be responsible for his own actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who accepted faith, and whose descendants followed them with faith – We have joined their descendants with them, and have not reduced anything for them from their deeds; every soul is trapped in its own deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and whose offspring follow them in faith, -- to them shall We join their offspring, and We shall not decrease the reward of their deeds in anything. Every person is a pledge for that which he has earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who believe and their offspring follow them in faith, We will unite with them their offspring and We will not diminish to them aught of their work; every man is responsible for what he shall have wrought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed, and their seed followed them in belief, We shall join their seed with them, and We shall not defraud them of aught of their work; every man shall be pledged for what he earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they who believe and whose seed follow them in faith, We cause their seed to join them (there), and We deprive them of nought of their (life's) work. Every man is a pledge for that which he hath earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those who have attained to faith We shall unite their offspring who have also followed them in faith, and We shall not let any of their good deeds go unrewarded; every human being is a pledge for whatever he has earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and whose progeny follow them in belief. We shall cause their progeny to join them, and We shall not diminish Unto them aught of their own work. Every man is for that which he hath earned a pledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithful and their descendants who followed them in faith—We will make their descendants join them, and We will not stint anything from [the reward of] their deeds. Every person is hostage to what he has earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and whose families follow them in Faith,- to them shall We join their families: Nor shall We deprive them (of the fruit) of aught of their works: (Yet) is each individual in pledge for his deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and whose offspring follow them in Faith, to them shall We join their offspring, and We shall not decrease the reward of their deeds in anything. Every person is a pledge for that which he has earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and whose descendants follow in belief, We will join their descendants to them. And We will not reduce them of anything of their deeds. Every one is pledged for what he has earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believed and their offspring followed them in faith—We will unite them with their offspring, and We will not deprive them of any of their works. Every person is hostage to what he has earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed and whose descendants followed them in faith - We will join with them their descendants, and We will not deprive them of anything of their deeds. Every person, for what he earned, is retained.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[52:21] And those who believed (wa’lladhīna āmanū, the subject) and whom We made to be followed (waatba‘nāhum: a variant reading has wa’ttaba‘athum, ‘and there followed them’, as a supplement to āmanū, ‘who believed’) by their descendants (dhurrīyātihim: a variant reading [for this plural] has dhurrīyatuhum), young and old, in faith, on the part of the older ones and on the part of the parents in [their] young ones (the predicate [of the subject above] is [the following, alhaqnā bihim), We will make their, mentioned, descendants join them, in Paradise, so that they are in the same degree [of reward], even though they might not have performed the same [meritorious] deeds as them [to deserve this equal status], a way of honouring the parents by having their children join them [again]; and We will not deprive them (read alatnāhum or alitnāhum), [We will not] diminish [them], of anything (min shay’in: min is extra) of their deeds, in order to add it to the deeds of their children. Every man is subject to what he has earned, of good or evil deeds, and will be requited for evil and rewarded for good.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَالَّذِينَ آَمَنُوا وَاتَّبَعَتْهُمْ ذُرِّيَّتُهُمْ بِإِيمَانٍ أَلْحَقْنَا بِهِمْ ذُرِّيَّتَهُمْ وَمَا أَلَتْنَاهُمْ مِنْ عَمَلِهِمْ مِنْ شَيْءٍ كُلُّ امْرِئٍ بِمَا كَسَبَ رَهِينٌ (21({ والذين ءَامَنُواْ واتبعتهم ذُرِّيَّتُهُم بإيمان أَلْحَقْنَا بِهِمْ } .اعتراض بين ذِكر كرامات المؤمنين ، والواو اعتراضية .والتعبير بالموصول إظهار في مقام الإِضمار لتكون الصلة إيماء إلى أن وجه بناء الخبر الوارد بعدها ، أي أن سبب إلحاق ذرياتهم بهم في نعيم الجنة هو إيمانهم وكونُ الذريات آمنوا بسبب إيمان آبائهم لأن الآباء المؤمنين يلقِّنون أبناءهم الإِيمان .والمعنى : والمؤمنون الذين لهم ذرياتٌ مؤمنون ألحقنا بهم ذرياتهم .وقد قال تعالى : { يا أيها الذين آمنوا قوا أنفسكم وأهليكم ناراً } \\[ التحريم : 6 \\] ، وهل يستطيع أحد أن يقي النار غيره إلا بالإِرشاد . ولعل ما في الآية من إلحاق ذرياتهم من شفاعة المؤمن الصالح لأهله وذريته .والتنكير في قوله : { بإيمان } يحتمل أن يكون للتعظيم ، أي بإيمان عظيم ، وعظمتُه بكثرة الأعمال الصالحة ، فيكون ذلك شرطاً في إلحاقهم بآبائهم وتكون النعمة في جعلهم في مكان واحد .ويحتمل أن يكون للنوعية ، أي بما يصدق عليه حقيقة الإِيمان .وقرأ الجمهور { واتبعتهم } بهمزة وصل وبتشديد التاء الأولى وبتاء بعد العين هي تاء تأنيث ضمير الفعل . وقرأه أبو عمرو وحده { وأتبعناهم } بهمزة قطع وسكون التاء .وقوله : { ذريتهم } الأول قرأه الجمهور بصيغة الإِفراد . وقرأه أبو عمرو { ذرياتهم } بصيغة جمع ذرية فهو مفعول { أتبعناهم } . وقرأه ابن عامر ويعقوب بصيغة الجمع أيضاً لكن مرفوعاً على أنه فاعل { أتبعتهم } ، فيكون الإِنعام على آبائهم بإلحاق ذرياتهم بهم وإن لم يعملوا مثل عملهم .وقد روى جماعة منهم الطبري والبزار وابن عديّ وأبو نعيم وابن مردويه حديثاً مسنداً إلى ابن عباس عن النبي صلى الله عليه وسلم قال : \" إن الله يرفع ذرية المؤمن في درجته وإن كانوا دونه ( أي في العمل كما صرح به في رواية القرطبي ( لتقرّ بهم عينُه ثم قرأ : { والذين آمنوا واتبعتهم ذريتهم بإيمان } إلى قوله : { من شيء } \" . وعلى الاحتمالين هو نعمة جمع الله بها للمؤمنين أنواع المسرّة بسعادتهم بمزاوجة الحور وبمؤانسة الإِخوان المؤمنين وباجتماع أولادهم ونسلهم بهم ، وذلك أن في طبع الإنسان التأنس بأولاده وحبه اتصالهم به .وقد وصف ذلك محمد بن عبد الرفيع الجعفري المُرسي الأندلسي نزيل تونس سنة 1013 ثلاث عشرة وألف في كتاب له سمّاه «الأنوار النبوية في آباء خير البرية» قال في خاتمة الكتاب «قد أطلعني الله تعالى على دين الإِسلام بواسطة والدي وأنا ابن ستة أعوام مع أني كنت إذاك أروح إلى مكتب النصارى لأقرأ دينهم ثم أرجعُ إلى بيتي فيعلمني والدِي دينَ الإِسلام فكنت أتعلم فيهما ( كذا ( معاً وسني حين حُملت إلى مكتَبهم أربعة أعوام فأخذ والدي لوحاً من عود الجوز كأني انظر الآن إليه مملّساً من غير طَفَل ( اسم لطين يابس وهو طين لزج وليست بعربية وعربيتُه طُفَال كغراب ( ، فكتب لي فيه حروف الهجاء وهو يسألني عن حروف النصارى حرفاً حرفاً تدريباً وتقريباً فإذا سميتُ له حرفاً أعجمياً يكتب لي حرفاً عربياً حتى استوفى جميع حروف الهجاء وأوصاني أن أكتم ذلك حتى عن والدتي وعَمِّي وأخي مع أنه رحمه الله قد ألقى نفسه للهلاك لإِمكان أن أخبر بذلك عنه فيُحْرَق لا محالة وقد كان يُلقِّنني ما أقوله عند رؤيتي الأصنام ، فلما تحقق والدي أني أكتم أمور دين الإِسلام أمرني أن أتكلم بإفشائه لوالدتي وبعض الأصدقاء من أصحابه وسافرت الأسفار من جِيَّان لأجتمع بالمسلمين الأخيار إلى غرناطة وإشبيلية وطليطلة وغيرها من مدن الجزيرة الخضراء ، فتخلص لي من معرفتهم أني ميزت منهم سبعة رجال كانوا يحدثونني بأحوال غرناطة وما كان بها في الإِسلام وقد مروا كلهم على شيخ من مشائخ غرناطة يقال له الفقيه الأوطوري .. . » الخ .وإيثار فعل { ألحقنا } دون أن يقال : أدخلنا معهم ، أو جعلنا معهم لعله لما في معنى الإِلحاق من الصلاحية للفَور والتأخير ، فقد يكون ذلك الإِلحاق بعد إجراء عقاب على بعض الذرية استحقوه بسيئاتهم على ما في الأعمال من تفاوت في استحقاق العقاب والله أعلم بمراده من عباده . وفعل الإِلحاق يقتضي أن الذريات صاروا في درجات آبائهم . وفي المخالفة بين الصيغتين تفنن لدفع إعادة اللفظ .و { ألتناهم } نقصناهم ، يقال : آلته حقه ، إذا نقصه إياه ، وهو من باب ضرب ومن باب علم .فقرأه الجمهور بفتح لام { ألتناهم } . وقرأه ابن كثير بكسر لام { ألِتناهم } ، وتقدم عند قوله تعالى : { لا يلتكم من أعمالكم شيئاً } في سورة الحجرات ( 14 ( . والواو للحال وضمير الغيبة عائد إلى { الذين آمنوا } .والمعنى : أن الله ألحق بهم ذرياتهم في الدرجة في الجنة فضلاً منه على الذين آمنوا دون عوض احتراساً من أن يحسبوا أن إلحاق ذرياتهم بهم بعد عطاء نصيب من حسناتهم لذرياتهم ليدخلوا به الجنة على ما هو متعارف عندهم في فك الأسير ، وحَمالة الديات ، وخلاص الغارمين ، وعلى ما هو معروف في الانتصاف من المظلوم للظالم بالأخذ من حسناته وإعطائها للمظلوم ، وهو كناية عن عدم انتقاص حظوظهم من الجزاء على الأعمال الصالحة .و { من عملهم } متعلق ب { ما ألتناهم } و ( من ( للتبعيض ، و ( من ( التي في قوله : { من شيء } لتوكيد النفي وإفادة الإِحاطة والشمول للنكرة .{ كُلُّ امرىء بِمَا كَسَبَ رَهِينٌ } .جملة معترضة بين جملة { وما ألتناهم من عملهم } وبين جملة { وأمددناهم بفاكهة } \\[ الطور : 22 \\] ، قصد منها تعليل الجملة التي قبلها وهي بما فيها من العموم صالحة للتذييل مع التعليل ، و { كل امرىء } يعمّ أهل الآخرة كلهم . وليس المراد كل امرىء من المتقين خاصة .والمعنى : انتفى إنقاصُنا إياهم شيئاً من عملهم لأن كل أحد مقرون بما كسب ومرتهَن عنده والمتقون لمّا كَسَبوا العمل الصالح كان لازماً لهم مقترناً بهم لا يُسلبون منه شيئاً ، والمراد بما كسبوا : جزاء ما كسبوا لأنه الذي يقترن بصاحب العمل وأما نفس العمل نفسه فقد انقضى في إبانه .وفي هذا التعليل كنايتان : إحداهما : أن أهل الكفر مقرونون بجزاء أعمالهم ، وثانيتهما : أن ذريات المؤمنين الذين ألحقوا بآبائهم في النعيم ألحقوا بالجنة كرامة لآبائهم ولولا تلك الكرامة لكانت معاملتهم على حسب أعمالهم . وبهذا كان لهذه الجملة هنا وقع أشد حسناً مما سواه مع أنها صارت من حسن التتميم .والكسب : يطلق على ما يحصله المرء بعمله لإِرادة نفع نفسه .ورهين : فعيل بمعنى مفعول من الرهن وهو الحبس .\n\n",
      "translations": [
        {
          "translation": "And they who believe) in Muhammad (pbuh) and the Qur'an and are true in their faith (and whose seed follow them in faith) in the life of the world, (We cause their seed to join them (there)) in the Hereafter, enjoying the same rank as that of their fathers; it is also said that this means: and those who believe in Muhammad (pbuh) and the Qur'an, We will enter them into the Garden along with their young children, thus enjoying the same rank, because these offspring had already believed on the Day of the Primordial Covenant. We made their fathers follow them. It is also said that this means: We make the offspring attain to the same rank as that of the fathers, if the ranks of the fathers are higher, (and We deprive them of naught of their (life's) work) He says: We do not diminish the reward of the fathers at all upon making their offspring join them. (Every man is a pledge) such that Allah does with him as He will (for that which he hath earned) of sins.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱلَّذِينَ آمَنُواْ وَٱتَّبَعَتْهُمْ ذُرِّيَّتُهُم بِإِيمَانٍ أَلْحَقْنَا بِهِمْ ذُرِّيَّتَهُمْ } معناه أَعطينا الأَبناءَ ما أَعطينا الأَباءَ في المماثلةِ من الكَرامةِ\n\n\n\n\nوقوله تعالى: { وَمَآ أَلَتْنَاهُمْ مِّنْ عَمَلِهِم مِّن شَيْءٍ } معناه ما نَقَصناهم\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High: {And those who believed and followed their offspring with belief - We will join their offspring with them} meaning We will give their offspring what We gave their parents in terms of honor.\n And His saying - the Most High - {And we have not deprived them of their deeds of anything} means that we have not deprived them of anything of their deeds.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وانكشفوا بتوحيده { وَٱتَّبَعَتْهُمْ } ولحقتهم معهم { ذُرِّيَّتُهُم } أي: جميع ما انشعب\n وتفرع منهم من أولادهم وأعمالهم الصادرة عنهم حال كونهم متصفين { بِإِيمَانٍ } يقين علمي وتصديق قلبي وصولهم إلى اليقين العيني والحقي\n بل { أَلْحَقْنَا بِهِمْ } أيضاً { ذُرِّيَّتَهُمْ } أي: مشاهداتهم\n ومكاشفاتهم الواردة عليهم حسب مقاماتهم وحالاتهم بعد اتصافهم باليقين العيني والحقي\n\n\n{ وَ } بالجملة: { مَآ أَلَتْنَاهُمْ } ونقصنا عليهم { مِّنْ عَمَلِهِم } الناشئ منهم في طريق الهداية والرشاد { مِّن شَيْءٍ } نزر يسير\n بل وفينا ووفرنا عليهم جزاء الكل مع مزيد عليها تفضلاً منَّا وإحساناً\n إذ { كُلُّ ٱمْرِىءٍ } ذي هوية شخصية مجبولة لحكمة المعرفة\n ومصلحة التوحيد { بِمَا كَسَبَ } من الأسباب { رَهَينٌ } [الطور: 21] مرهون مقرون لا ينفصل عنها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واتَّبعتهم ذريتُهم } عطف على { آمنوا } \n و { بإِيمان } متعلق بالاتباع\n والخبر: { ألحقنا بهم ذرياتهم } أي: تلحق الأولاد بدرجات الآباء إذ شاركوهم في الإيمان\n وإن قصرت أعمال الذرية عن أعمال الآباء\n وكذلك الآباء تلحق بدرجة الأبناء لتقرّ بذلك أعينهم\n فيلحق بعضهم ببعض\n إذا اجتمعوا في الإيمان من غير أن ينقص أجر مَنْ هو أحسن عملاً شيئاً\n بزيادته في درجة الأنقص\n ولا فرق بين مَنْ بلغ مِن الذرية\n أو لم يبلغ\n إذا كان الآباء مؤمنين\n انظر الثعلبي\n وفي حديث ابن عباس:\n \" إذا دخل أهلُ الجنة الجنة\n يسأل الرجلُ عن أبويه\n وزوجته\n وولده\n فيُقال: إنهم لم يُدركوا ما أدركتَ\n فيقول: لقد عملتُ لي ولهم أجمعين\n فيؤمر بإلحاقهم به \" \nقال القشيري: ليكمل عليهم سرورهم بذلك فإنّ الانفراد بالنعمة والقلب مشتغل بالأهل والذرية ينغص العيش\n وكذلك مَن يلاحظ قلباً من صديق وقريب ووليّ وخادم\n قال تعالى في قصة يوسف:\n[يوسف: 93]\nهـ\n قال في الحاشية: وربما يستأنس بما ذُكر في الجملة بقوله:\n[النساء: 69] الآية\n وما قيل في سبب نزولها\n وكذلك حديث:\n \" المرء مع مَن أحب \" \n\n وحال الجنة مما لا يخطر على بال\n فيجوز أن يكون الأدنى مع الأعلى بمنازلته معه\n مع مباينته له بحقيقته\n كما أنّ حَيطة الحق تعالى شاملة للكل\n وكل يتعرّف له على قدره\n فالكل معه بمطلق التعرُّف\n مع تحقُّق التفاوت\n وأهل الجنة فيها على حكم الأرواح\n وأحكامها لا تكيف\n واعتبر بالفروع مع الأصول\n مع تفاوتها\n\nوالله أعلم\n هـ\n والحاصل: أنهم يلحقون بهم في الطبقة\n ويتفاوتون في نعيم الأرواح والأشباح\n وفي الرؤية والزيادة\n والله تعالى أعلم\n { وما أَلتناهم } أي: ما نقصنا الآباء بهذا الإلحاق { مِن عملهم } من ثواب عملهم { من شيءٍ } بأن أعطينا بعض مثوباتهم لأبنائهم\n فتنقص مثوبتهم\n وتنحط درجتهم\n وإنما رفعناهم إلى منزلتهم بمحض التفضُّل والإحسان\n والألت: البخس\n وقرأ المكي: أَلِتناهم بكسر اللام\n من: ألِت يألَت\n كعلم يعلم\n و \" مِن \" الأولى متعلقة بـ \" ألتناهم \" \n والثانية زائدة لتأكيد النفي\n { كُلُّ امرئ بما كسب رهينٌ } أي: كل امرئ مرهون عند الله بعمله\n فإن كان صالحاً فله\n وإلا أهلكه\n والجملة: استئناف بياني\n كأنه لمّا قال: ما نقصناهم من عملهم شيئاً نعطيه الأبناء حتى يلحقو بهم على سبيل التفضُّل\n قيل: لِمَ كان الإلحاق تفضُّلاً؟ قال: لأن كل امرىءٍ بما كسب رهين\n وهؤلاء لم يكن لهم عمل يلحقوا بسببه بهم\n فأُلحقوا تفضُّلاً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:38",
      "similarity": 0.3634270774128929
    },
    {
      "verse": "2:283",
      "similarity": 0.27402253786284564
    },
    {
      "verse": "62:3",
      "similarity": 0.1882853466281408
    },
    {
      "verse": "34:27",
      "similarity": 0.1844821348216683
    },
    {
      "verse": "26:83",
      "similarity": 0.18440835422319954
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/052021.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/052021.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/52:21.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}