{
  "chapter": "الطور",
  "text": "يتنزعون فيها كاسا لا لغو فيها ولا تاثيم",
  "translations": [
    {
      "translation": "They will exchange cups of wine free of (incitement to) pleasantry or sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall pass on to one another a cup that will incite neither levity nor sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will pass cups of un-intoxicating and unsinful wine to one another.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In it, they accept cups from each other, in which is neither any lewdness nor any sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There they shall pass from hand to hand a cup, free from any idle talk, and free from sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall pass therein from one to another a cup wherein there shall be nothing vain nor any sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "while they pass therein a cup one to another wherein is no idle talk, no cause of sin,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There they pass from hand to hand a cup wherein is neither vanity nor cause of sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There, they shall pass from hand to hand a cup which does not lead to any idle talk or sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will therein snatch from one another a cup; therein will be neither vain babble nor sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There they will pass from hand to hand a cup wherein there will be neither any vain talk nor sinful speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall there exchange, one with another, a (loving) cup free of frivolity, free of all taint of ill.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There they shall pass from hand to hand a (wine) cup, free from any Laghw (dirty, false, evil vague talk between them), and free from sin (because it will be legal for them to drink).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There they will pass a goblet to one another with neither idle talk nor sin,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will exchange therein a cup; wherein is neither harm, nor sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will exchange with one another a cup [of wine] wherein [results] no ill speech or commission of sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[52:23] They will pass from one to another therein, in Paradise, a cup, [of] wine, wherein is neither vain talk, which might come about between them as a result of drinking it, nor cause for sin, thereby, that might befall them — in contrast to [the case with] the wine of this world.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "There) in the Garden (they pass from hand to hand a cup) of wine (wherein is neither vanity) stomach-ache because of drinking it (nor cause of sin) from drinking it; it is also said that \"vanity\" means: falsehood and oaths, and \"cause of sin\" means: abusing and lying to each other, which means: in the Garden there is neither falsehood and oaths nor abuse and lying. 617\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَتَنَازَعُونَ فِيهَا } معناه يَتَعاطُون فِيها { كَأْساً } معناه خمرٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَتَنَازَعُونَ } ويتجاذبون { فِيهَا كَأْساً } من رحيق التحقيق، مع أنه { لاَّ لَغْوٌ فِيهَا } من ضول الكلام { وَلاَ تَأْثِيمٌ } [الطور: 23] من قبح الأفعال المستلزمة للآثام كما هو عادة الشاربين في الدنيا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يتنازعون فيها كأساً } أي: يتعاطون ويتعاورون هم وجلساؤهم من أقربائهم كأساً فيها خمر، يتناول هذا الكأسَ من يد هذا، وهذا من يد هذا، بكمال رغبة واشتياق، { لا لغوٌ فيها } أي: في شربها، فلا يتكلمون في أثناء الشراب إلا بكلام طيب، فلا يجري بينهم باطل، { ولا تأثيمٌ } أي: لا يفعلون ما يُوجب إثماً لصاحبه لو فعله في دار التكليف، كما هو شأن المُنادمين في الدنيا، وإنما يتكلمون بالحِكَم واحاسِن الكلام، ويفعلون ما يفعله الكرام\n قال القشيري: { لا لغوٌ فيها ولا تأثيم } لا يجري بينهم باطل ولا ما فيه لوم، كما يجري من الشَّرْب اليوم في الدنيا، ولا تذهب عقولهم، فيجري بينهم ما يُخرج عن حدّ الأدب والاستقامة، وكيف لا يكون مجلسهم بهذه الصفة، على المعلوم مَن يسقيهم بمشهد من مجلوسهم، وعلى رؤية من شربهم، والقوم عن الدار وعن ما فيها مختطفون باستيلاء ما يستغرقهم، فالشراب يؤنسهم، ولكن لا يمر بحاستهم\n هـ\n وقرأ المكي والبصري بالفتح فيها على إعمال \" لا \" النافية للجنس\n الإشارة: إنَّ المتقين ما سوى الله في جنات المعارف عاجلاً، وجنات الزخارف والمعارف آجلاً، ونعيم المشاهدات والمكاشفات والمناجاة، فاكهين، معجبين، متلذذين بما آتاهم ربهم من أصناف ألطافه، وتقريبه، ووقاهم ربُّهم عذابَ الجحيم، أي: نار شهوة نفوسهم، فبردت عنهم، وسَلِموا منها، كُلوا من طعام المشاهدات، واشربوا من أمداد الزيادات والترقيات، هنيئاً بما كنتم تعملون من المجاهدات والمكابدات، متكئين على سُرر المقامات، والدرجات، مصفوفة في منازل العبودية، وزوجناهم بحُورٍ عين من أبكار الحقائق، وثيبات العلوم، والذين آمنوا بهذه الطريق وسلكوها، واتبعتهم ذريتهم ومَنْ تعلق بهم من طلاب الحق، ألحقنا بهم ذريتهم ومَنْ تعلق بهم، وإن لم يبلغوا صفاء مشربهم من الوصال والاتصال، فيكونون معهم في الدرجة، مع تفاوتهم في نعيم المشاهدة، وما ألتناهم من عملهم من شيء، بل ألحقناهم بهم فضلاً وكرماً، مع توفُّر ثواب عمل الملحق بهم، كل امرئ بما كسب رهين، لا يزيد نعيم روحه على سعيه في الدنيا ومجاهدته، وإن تساوى في الدرجة مع غيره\n\n\nوأمددناهم بفاكهةٍ من حلاوة المعاملة، ولحم مما يشتهون من لذائذ المشاهدة، يتنازعون فيها في جنة المعارف، كأس خمر المحبةً والفناء، فيفنون عن وجودهم في شهود محبوبهم\n يتناولون ذلك من أشياخهم واحداً بعد واحد، وقد يجتمعون في كأس واحدة، لا لغو فيها، أي: لا حديث للنفس في حال شربها، بل الهم كله مجموع يها، كما قال القائل:\n\nفالخمرة التي يشوبها شيء من حديث النفْس ليس بصافية من الأكدار\n ولا تأثيم بنزوع الروح إلى طبع النفس، وإذا نزلت إلى سماء الحقوق، أو أرض الحظوظ، بل تكون في ذلك بالله، ومن الله، وإلى الله، تنزل بالإذن والتمكين، والرسوخ في اليقين، جلعنا الله من ذلك القبيل بمنّه وكرمه\n وقال الورتجبي: { يتنازعون\n\n\n } الآية: وصفهم الله في شربهم كاسات شراب الوصلة بالمسارعة والشوق إلى مزيد القُربة، ثم وصف شرابَهم أنه يورثهم التمكين والاستقامة في السُكْر، لا يزول حالهم إلى الشطح والعربدة، وما يتكلم به سكارى المعرفة في الدنيا عند الخلق، ولا يشابِهُ حالُ أهل الحضرة حالَ أهل الدنيا من جميع المعاني\n هـ\n ثم قال تعالى: { وَيَطُوفُ عَلَيْهِمْ غِلْمَانٌ }\n\n",
      "translations": []
    }
  ]
}