{
  "chapter": "الطور",
  "text": "ام لهم سلم يستمعون فيه فليات مستمعهم بسلطن مبين",
  "translations": [
    {
      "translation": "Or do they have a ladder (climbing which) they can hear (the secrets of heaven)? Let one who has heard then bring a clear proof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they have a ladder whereon they can climb and attempt to listen (to what is transpiring in the Higher Realm)? Then, let any of them who has listened to it produce a clear proof of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they have a ladder (by which they can climb up to the heavens) and listen (to the angels) and come back to the rest of the people with clear authority?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they have any stairs, climbing upon which they eavesdrop? So their eavesdropper should bring some clear proof!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they a stairway (to heaven), by means of which they listen Then let their listener produce some manifest proof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they the means by which they listen? Then let their listener bring a clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they a ladder whereon they listen? Then let any of them that has listened bring a clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they any stairway (unto heaven) by means of which they overhear (decrees). Then let their listener produce some warrant manifest!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they a ladder up to heaven by means of which they can overhear? Then let their listeners bring a clear proof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they a stairway whereby they overhear? Then let their listener bring an authority manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they have a ladder [leading up to heaven] whereby they eavesdrop? If so, let their eavesdropper produce a manifest authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they a ladder, by which they can (climb up to heaven and) listen (to its secrets)? Then let (such a) listener of theirs produce a manifest proof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they a stairway (to heaven), by means of which they listen (to the talks of the angels)? Then let their listener produce some manifest proof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, do they have a ladder on which they listen? Then let any of them that has listened bring a clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they have a stairway by means of which they listen? Then let their listener produce a clear proof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they a stairway [into the heaven] upon which they listen? Then let their listener produce a clear authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[52:38] Or do they have a ladder, a means of ascension into the heaven, whereby they eavesdrop?, that is, at the top of which [they listen in], on the conversations of the angels, so that they are then able to dispute with the Prophet, as they claim. If that is what they assert: Then let their eavesdropper, [let] the one claiming to be able to listen [in on their conversations] on top of this [ladder], produce a manifest warrant, a plain and evident proof. Now, on account of the similarity of this assertion to their assertion that the angels are the daughters of God, He, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Or have they any stairway (unto heaven) by means of which they overhear (decrees). Then let their listener produce warrant manifest) let their listener produce a clear proof for what they say!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمْ } ادعوا علم الغيب بالاستماع من الملأ الأعلى؟! إذ { لَهُمْ سُلَّمٌ } مرقاة يصعدون بها إلى مكان من السماء { يَسْتَمِعُونَ فِيهِ } من الملائكة ما يظهرون من تكذيب الرسل، وقدح القرآن { فَلْيَأْتِ مُسْتَمِعُهُم بِسُلْطَانٍ مُّبِينٍ } [الطور: 38] أي: بحجة واضحة ومعجزة ساطعة، كما أتى بها الرسول صلى الله عليه وسلم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}