{
  "chapter": "الطور",
  "text": "ومن اليل فسبحه وادبر النجوم",
  "translations": [
    {
      "translation": "And glorify Him in the night and when the stars fade out.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And glorify Him in the night and when the stars begin to wane.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and also celebrate His praise at night, and at the retreat of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and glorify Him after the setting of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And proclaim His Purity during the night, and when the stars turn back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the nighttime also glorify His praises and at the setting of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the night, give Him glory too, and at the setting of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and proclaim the praise of thy Lord in the night, and at the declining of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the night-time also hymn His praise, and at the setting of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Extol His glory at night, and at the setting of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the night also hallow Him, and at the setting of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and also glorify Him during the night and at the receding of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for part of the night also praise thou Him,- and at the retreat of the stars!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the night time, also glorify His Praises, and at the setting of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and exalt Him in the night and at the declining of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And glorify Him during the night, and at the receding of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in a part of the night exalt Him and after [the setting of] the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[52:49] and glorify Him at night — also in actual [utterance] — and at the receding of the stars (idbāra is a verbal noun), that is to say, also glorify Him after these have set; or [it means] in the case of the former, perform the two evening prayers, and in the case of the latter, the two units (rak‘a) of the dawn prayer, or — it is said — the morning prayer. Meccan, except for verse 32, which is Medinese; it consists of 62 verses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمِنَ اللَّيْلِ فَسَبِّحْهُ وَإِدْبَارَ النُّجُومِ (49({وقيل : التسبيح قوله : «سبحان الله» ، والقيام : الاستعداد للصلاة أو الهبوب من النوم . وروي ذلك عن عوف بن مالك وابن زيد والضحاك على تقارب بين أقوالهم ، أي يقول القائم : «سبحان الله وبحمده» أو يقول : «سبحانك اللهم ربّنا وبحمدك ولا إله غيرك» .وعن عوف بن مالك وابن مسعود وجماعة : أن المراد بالقيام القيام من المجلس لما روى الترمذي عن أبي هريرة أن النبي صلى الله عليه وسلم قال : \" من جلس مجلساً فكثر فيه لَغَظُه فقال قبل أن يقوم من مجلسه ذلك : سبحانك اللهم وبحمدك أشهد أن لا إله إلا أنت أستغفرك وأتوب إليك ، إلا غفر له ما كان في مجلسه ذلك \" ولم يذكر أنه قرأ هذه الآية .و { من الليل } أي زمناً هو بعض الليل ، فيشمل وقت النهي للنوم وفيه تتوارد على الإنسان ذكريات مهماته ، ويشمل وقت التهجد في الليل .وقوله : { فسبحه } اكتفاء ، أي واحمده .وانتصب { وإدبار النجوم } على الظرفية لأنه على تقدير : ووقت إدبار النجوم .والإِدبار : رجوع الشيء من حيث جاء لأنه ينقلب إلى جهة الدُبر ، أي الظهر .وإدبار النجوم : سقوط طوالعها ، فإطلاق الإِدبار هنا مجاز في المفارقة والمزايلة ، أي عند احتجاب النجوم . وفي الحديث : \" إذا أقبل الليل من ههنا ( الإِشارة إلى المشرق ( وأدْبر النهار من ههنا ( الإِشارة إلى جهة المغرب ( فقد أفطر الصائم \" . وسقوط طوالعها التي تطلع : أنها تسقط في جهة المغرب عند الفجر إذا أضاء عليها ابتداء ظهور شعاع الشمس ، فإدبار النجوم : وقت السحر ، وهو وقت يستوفي فيه الإِنسان حظه من النوم ، ويبقى فيه ميل إلى استصحاب الدَّعَة ، فأمر بالتسبيح فيه ليفصل بين النوم المحتاج إليه وبين التناوم الناشىء عن التكاسل ، ثم إن وجد في نفسه بعد التسبيح حاجة إلى غفوة من النوم اضطجع قليلاً إلى أن يحين وقت صلاة الصبح ، كما كان رسول الله صلى الله عليه وسلم يضطجع بعد صلاة الفجر حتى يأتيه المؤذن بصلاة الصبح .والنجوم : جمع نجم وهو الكوكب الذي يضيء في الليل غير القمر ، وتقدم عند قوله تعالى : { وسخر لكم الليل والنهار والشمس والقمر والنجوم } في سورة النحل ( 12 ( .والآية تشير إلى أوقات الرغائب من النوافل وهي صلاة الفجر والأشفاع بعد العشاء وقيام آخر الليل . وقيل : إشارت إلى الصلوات الخمس بوجه الإِجمال وبيّنتهُ السنة .\n\n",
      "translations": [
        {
          "translation": "(And in the night time) upon the advent of the night (also hymn His praise) pray for Him the prayer of Zuhr, 'Asr, Maghrib and 'Isha', (and at the setting of the stars) two units of prayers after Fajr, and the setting of the star when it goes down'. And of the surah in which the Star is mentioned, which is all Meccan-except for the verse which was revealed about 'Uthman and 'Abdullah Ibn Sa'd Ibn Abi Sarh which is Medinan-and consists of 60 verses, 300 words and 1,405 letters: Surah 53: The Star (al-Najm) And of the surah in which the Star is mentioned, which is all Meccan — except for the verse which was revealed about 'Uthman and 'Abdullah Ibn Sa'd Ibn Abi Sarh which is Medinan — and consists of 60 verses, 300 words and 1,405 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ليكون ذكرك حينئذ توصية منك بمتخليلتك وإرشاداًلها وتعليماً إياها { وَ } سبحه أيضاً { إِدْبَارَ ٱلنُّجُومِ } [الطور: 49] وقت دبور النجوم\n وظهور ضياء الشمس\n فإن كلا الوقتين وقت فراغ البال عن مطلق التشتت والأشغال العائقة عن التوجه\n جعلنا الله ممن خلفف أثقاله وقلل آماله بمنِّه وجوده\n\nخاتمة السورة\n\nعليك أيها المحمدي المتوجه نحو المقام المحمود الذي هو مرتبة الكشف والشهود - هداك الله إلى سواء السبيل\n ووقاك عن مطلق التغيير والتبديل - أن تخلي خلدك عن الركون إلى ما سوى الحق\n والالتفات إلى عموم ما يشغلك عن التوجه إليه\n والتحنن نحوه\n\n\nولك الاشتغال بالتسبيح والتقديس في جميع أوقاتك\n وحالاتك سيما في أثناء صلواتك في خلال خلواتك\n إياك إياك الميل إلى مزخرفات الدنيا ولذاتها وشهواتها\n والاختلاط مع أبنائها المنغمسين بقاذوراتها\n فإن التلطخ بمزخرفات الدنيا بكلُّ الأبصار ويعمي القلوب التي في الصدور\n\n\nخفف عنَّا بلطفك ثقل الأوزار\n وأرزقنا بفضلك عيشة الأبرار\n واصرف عنا بكرمك شر الأشرار",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِدبار النجوم } أي: وقت إدبارها\n أي: غيبتها بضوء الصبح\n والمراد: آخر الليل\n وقيل: التسبيح من الليل: صلاة العشاء\n وإدبار النجوم: صلاة الفجر\n وقرأ زيدٌ عن يعقوب بفتح الهمز\n أي: أعقابها إذا غربت\n الإشارة: في هذه تسلية لأهل البلاء والجلال\n فإنّ مَن عَلِمَ أن ما أصابه إنما هو حُكم ربه\n الذي يقوم به ويحفظه\n وهو بمرئً منه ومسمَعٍ\n لا يهوله ما نزل\n بل يزيده غبطةً وسروراً لعلمه بأنه ما أنزله به إلا لرفعة قدره\n وتشحير ذهب نفسه\n وقطع البقايا منه\n فهو في الحقيقة نعمة لا نقمة\n وفي الحِكَم: \" مَن ظنّ انفكاك لطف الله عن قدره\n فذلك لقصور نظره \"\n قال القشيري: أي: اصبر لما حكم به في الأزل\n فإنه لا يتغير حكمنا الأول إن صبرت وإن لم تصبر\n لكن إن صبرت على قضائي جزيت ثواب الصابرين بغير حساب\n وفيه إشارة أخرى\n أي: اصبر فإنك بأعيينا نعينك على الصبر لأحكامنا الأزلية\n كما قال تعالى:\n[النحل: 127]\n هـ\n وقيل المعنى: فإنك من جُملة أعيننا\n وأعيان الحق الكُمل من الأنبياء\n والرسل\n والملائكة\n وأكابر أوليائه\n فإنهم أعيان تجلياته\n ولذلك الإشارة بقوله عمر رضي الله عنه في شأن عليّ - كرّم الله وجهه - حين ضرب شخصاً فشكاه: \" أصابته عين من عيون الله \" \n وذلك لما تمكنوا من سر الحقيقة\n صاروا عين العين\n ومن ذلك قولهم: ليس الشأن أن تعرف الاسم\n إنما الشأن أن تكون عين الاسم\n أي: عين المُسمّى\n وهو سر التصرُّف بالهوية عند التمكين فيها\n وتمكُّن غيبة الشهود في الملك المعبود\n وقوله تعالى: { وسبح بحمد ربك\n\n\n } الخ\n فيه إشارة إلى مداومة الذكر\n والاستغراق فيه\n ودوام التنزيه لله تعالى عن رؤية شيء معه\n وبالله التوفيق\n وصلّى الله على سيدنا محمد وآله وصحبه وسلّم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:16",
      "similarity": 0.7447294592150496
    },
    {
      "verse": "37:88",
      "similarity": 0.732815759876198
    },
    {
      "verse": "53:1",
      "similarity": 0.6681445552818787
    },
    {
      "verse": "55:6",
      "similarity": 0.6117552940982062
    },
    {
      "verse": "56:75",
      "similarity": 0.5516334076970884
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/052049.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/052049.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/52:49.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}