{
  "chapter": "الطور",
  "text": "يوم لا يغنى عنهم كيدهم شيـا ولا هم ينصرون",
  "translations": [
    {
      "translation": "Their deception will not avail them in the least on that day, nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when their stratagem shall be of no avail to them, nor shall they be succoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when their evil plans will be of no benefit to them nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A day on which their scheming will not benefit them at all, nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when their plotting shall not avail them at all, nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day on which their struggle shall not avail them aught, nor shall they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the day when their guile shall avail them naught, and they shall not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A day in which their guile will naught avail them, nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Day when none of their scheming will be of the least avail to them, and they will receive no succour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Day whereon their plotting will avail them not at all, nor will they be succoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the day when their guile will not avail them in any way, nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when their plotting will avail them nothing and no help shall be given them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when their plotting shall not avail them at all nor will they be helped (i.e. they will receive their torment in Hell).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when their guile shall not relieve them a thing, and they shall not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when their ploys will avail them nothing; and they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day their plan will not avail them at all, nor will they be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[52:46] the day when their guile will avail them nothing (yawma lā yughnī is a substitution for yawmahumu, ‘that   day of theirs’) and they will not be helped, they will [not] be protected from the chastisement in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(A day) which is the Day of Judgement (in which their guile will naught avail them) the doing of Abu Jahl and his host will not benefit them at all against Allah's chastisement, (nor will they be helped) nor will they be prevented from what is wanted with them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَوْمَ } أي: يومئذ { لاَ يُغْنِي } ولا يدفع { عَنْهُمْ كَيْدُهُمْ } الذي أتوا به في دار الندوة والابتلاء { شَيْئاً } من الدفع والإغناء في رد عذاب الله { وَلاَ هُمْ يُنصَرُونَ } [الطور: 46] ويمنعون حينئذ من بطشه وعذابه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}