{
  "chapter": "الطور",
  "text": "ام يريدون كيدا فالذين كفروا۟ هم المكيدون",
  "translations": [
    {
      "translation": "Or do they desire to dupe you? But the duped ones are those who are kafir.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they want to stage a deception? -- Then only those who do not believe will be the ones who will be tricked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or are they contriving a stratagem against you? If so, that stratagem will rebound against the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they design evil plans? The disbelievers themselves will be snared by their evil plots.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or are they planning a conspiracy? So the conspiracy will befall only upon the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they intend a plot But those who disbelieve are themselves plotted against!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they desire a war? But those who disbelieve shall be the vanquished ones in war.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or desire they to outwit? The unbelievers, they are the outwitted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or seek they to ensnare (the messenger)? But those who disbelieve, they are the ensnared!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they want to hatch some plot? Those who deny the truth will be the victims of the plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seek they to lay a plot? Then those who disbelieve it is they who shall be plotted against.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they seek to outmaneuver [Allah]? But it is the faithless who are the outmaneuvered ones!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they intend a plot (against thee)? But those who defy Allah are themselves involved in a Plot!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they intend a plot (against you O Muhammad SAW)? But those who disbelieve (in the Oneness of Allah Islamic Monotheism) are themselves in a plot!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, do they desire to outwit? The unbelievers are the outwitted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or are they planning a conspiracy? The conspiracy will befall the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do they intend a plan? But those who disbelieve - they are the object of a plan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[52:42] Or do they desire to outmanoeuvre?, you and have you killed, at the Assembly Council. But those who disbelieve, they are the outmanoeuvred ones!, the vanquished and the ones destroyed. God preserved him from them and then destroyed them at Badr.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَمْ يُرِيدُونَ كَيْدًا فَالَّذِينَ كَفَرُوا هُمُ الْمَكِيدُونَ (42(انتقال من نقض أقوالهم وإبطال مزاعمهم إلى إبطال نواياهم وعزائمهم من التبيت للرسول صلى الله عليه وسلم وللمؤمنين ولدعوة الإِسلام من الإِضرار والإِخفاق وفي هذا كشف لسرائرهم وتنبيه للمؤمنين للحذر من كيدهم .وحذف متعلِّق { كيداً } ليعم كل ما يستطيعون أن يكيدوه فكانت هذه الجملة بمنزلة التتميم لنقض غزلهم والتّذييل بما يعم كل عزم يجري في الأغراض التي جرت فيها مقالاتهم .والكيد والمكر متقاربان وكلاهما إظهار إخفاء الضر بوجوه الإِخفاء تغريراً بالمقصودِ له الضُرُّ .وعدل عن الإِضمار إلى الإِظهار في قوله : { فالذين كفروا هم المكيدون } وكان مقتضى الظاهر أن يقال فهم المكيدون لِما تؤذن به الصلة من وجه حلول الكيد بهم لأنهم كفروا بالله ، فالله يدافع عن رسوله صلى الله عليه وسلم وعن المؤمنين وعن دينه كيدهم ويوقعهم فيما نووا إيقاعهم فيه .وضمير الفصل أفاد القصر ، أي الذين كفروا المكيدون دون من أرادوا الكيد به .وإطلاق اسم الكيد على ما يجازيهم الله به عن كيدهم من نقض غزلهم إطلاقٌ على وجه المشاكلة بتشبيه إمهال الله إياهم في نعمة إلى أن يقع بهم العذاب بفعل الكائد لغيره ، وهذا تهديد صريح لهم ، وقد تقدم قوله : { ويمكرون ويمكر اللَّه واللَّه خير الماكرين } في سورة الأنفال ( 30 ( . ومن مظاهر هذا التهديد ما حلّ بهم يوم بدر على غير ترقب منهم .والقول في تفريع { فالذين كفروا هم المكيدون } كالقول في تفريع قوله : { فهم من مغرم مثقلون } \\[ الطور : 40 \\] .\n\n",
      "translations": [
        {
          "translation": "(Or seek they) indeed they seek (to ensnare (the messenger)) to kill you, Muhammad? (But those who disbelieve) the disbelievers of Mecca: Abu Jahl and his host who planned to kill the Prophet (pbuh) (they are the ensnared!) they are the ones who will be killed on the Day of Badr!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمْ يُرِيدُونَ } ويقصدون { كَيْداً } لرسول الله صلى الله عليه وسلم في دار الندوة { فَٱلَّذِينَ كَفَرُواْ } مكروا عليه { هُمُ ٱلْمَكِيدُونَ } [الطور: 42] المقصورون على كيدهم\n لا يتعدى عنهم وباله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أم يُريدون كيداً } هو كيدهم برسول الله صلى الله عليه وسلم في دار الندوة\n { فالذين كفروا } وهم المذكورون\n ووضع الموصول موضع ضميرهم للتسجيل عليهم بالكفر\n أي: فـ { هم المكِيدُونَ } الذين يحيق بهم كيدّهم\n ويعود عليه وبالُه\n لا مَن أرادوا أن يكيدوه وهو ما أصابهم يوم بدر وغيره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "86:16",
      "similarity": 0.7721840847983827
    },
    {
      "verse": "86:15",
      "similarity": 0.7696469791930605
    },
    {
      "verse": "77:39",
      "similarity": 0.7657234553009431
    },
    {
      "verse": "21:70",
      "similarity": 0.7329598059334087
    },
    {
      "verse": "105:2",
      "similarity": 0.662732026228865
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/052042.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/052042.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/52:42.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}