{
  "chapter": "الطور",
  "text": "ومن اليل فسبحه وادبر النجوم",
  "translations": [
    {
      "translation": "And glorify Him in the night and when the stars fade out.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And glorify Him in the night and when the stars begin to wane.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and also celebrate His praise at night, and at the retreat of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and glorify Him after the setting of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And proclaim His Purity during the night, and when the stars turn back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the nighttime also glorify His praises and at the setting of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the night, give Him glory too, and at the setting of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and proclaim the praise of thy Lord in the night, and at the declining of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the night-time also hymn His praise, and at the setting of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Extol His glory at night, and at the setting of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the night also hallow Him, and at the setting of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and also glorify Him during the night and at the receding of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for part of the night also praise thou Him,- and at the retreat of the stars!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the night time, also glorify His Praises, and at the setting of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and exalt Him in the night and at the declining of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And glorify Him during the night, and at the receding of the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in a part of the night exalt Him and after [the setting of] the stars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[52:49] and glorify Him at night — also in actual [utterance] — and at the receding of the stars (idbāra is a verbal noun), that is to say, also glorify Him after these have set; or [it means] in the case of the former, perform the two evening prayers, and in the case of the latter, the two units (rak‘a) of the dawn prayer, or — it is said — the morning prayer. Meccan, except for verse 32, which is Medinese; it consists of 62 verses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And in the night time) upon the advent of the night (also hymn His praise) pray for Him the prayer of Zuhr, 'Asr, Maghrib and 'Isha', (and at the setting of the stars) two units of prayers after Fajr, and the setting of the star when it goes down'. And of the surah in which the Star is mentioned, which is all Meccan-except for the verse which was revealed about 'Uthman and 'Abdullah Ibn Sa'd Ibn Abi Sarh which is Medinan-and consists of 60 verses, 300 words and 1,405 letters: Surah 53: The Star (al-Najm) And of the surah in which the Star is mentioned, which is all Meccan — except for the verse which was revealed about 'Uthman and 'Abdullah Ibn Sa'd Ibn Abi Sarh which is Medinan — and consists of 60 verses, 300 words and 1,405 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنَ ٱللَّيْلِ } حين تستريح فيه للنوم { فَسَبِّحْهُ } لتكون على ذكر من ربك حين رقودك وغفلتك عن حواسك؛ ليكون ذكرك حينئذ توصية منك بمتخليلتك وإرشاداًلها وتعليماً إياها { وَ } سبحه أيضاً { إِدْبَارَ ٱلنُّجُومِ } [الطور: 49] وقت دبور النجوم، وظهور ضياء الشمس، فإن كلا الوقتين وقت فراغ البال عن مطلق التشتت والأشغال العائقة عن التوجه، جعلنا الله ممن خلفف أثقاله وقلل آماله بمنِّه وجوده\n\n\nخاتمة السورة\n\n\n\nعليك أيها المحمدي المتوجه نحو المقام المحمود الذي هو مرتبة الكشف والشهود - هداك الله إلى سواء السبيل، ووقاك عن مطلق التغيير والتبديل - أن تخلي خلدك عن الركون إلى ما سوى الحق، والالتفات إلى عموم ما يشغلك عن التوجه إليه، والتحنن نحوه\n\n\n\n\nولك الاشتغال بالتسبيح والتقديس في جميع أوقاتك، وحالاتك سيما في أثناء صلواتك في خلال خلواتك، إياك إياك الميل إلى مزخرفات الدنيا ولذاتها وشهواتها، والاختلاط مع أبنائها المنغمسين بقاذوراتها، فإن التلطخ بمزخرفات الدنيا بكلُّ الأبصار ويعمي القلوب التي في الصدور\n\n\n\n\nخفف عنَّا بلطفك ثقل الأوزار، وأرزقنا بفضلك عيشة الأبرار، واصرف عنا بكرمك شر الأشرار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن الليل فسبِّحه } أي: في بعض الليل وأفراده لأن العبادة فيه أشق على النفس، وأبعد من الرياء، كما يلوح به تقدميه على الفعل، والمراد إما الصلة في الليل، أو التسبيح باللسان سبحان الله وبحمده، { وإِدبار النجوم } أي: وقت إدبارها، أي: غيبتها بضوء الصبح، والمراد: آخر الليل، وقيل: التسبيح من الليل: صلاة العشاء، وإدبار النجوم: صلاة الفجر\n وقرأ زيدٌ عن يعقوب بفتح الهمز، أي: أعقابها إذا غربت\n الإشارة: في هذه تسلية لأهل البلاء والجلال، فإنّ مَن عَلِمَ أن ما أصابه إنما هو حُكم ربه، الذي يقوم به ويحفظه، وهو بمرئً منه ومسمَعٍ، لا يهوله ما نزل، بل يزيده غبطةً وسروراً لعلمه بأنه ما أنزله به إلا لرفعة قدره، وتشحير ذهب نفسه، وقطع البقايا منه، فهو في الحقيقة نعمة لا نقمة، وفي الحِكَم: \" مَن ظنّ انفكاك لطف الله عن قدره، فذلك لقصور نظره \"\n قال القشيري: أي: اصبر لما حكم به في الأزل، فإنه لا يتغير حكمنا الأول إن صبرت وإن لم تصبر، لكن إن صبرت على قضائي جزيت ثواب الصابرين بغير حساب، وفيه إشارة أخرى، أي: اصبر فإنك بأعيينا نعينك على الصبر لأحكامنا الأزلية، كما قال تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:16",
      "similarity": 0.7447294592150496
    },
    {
      "verse": "37:88",
      "similarity": 0.732815759876198
    },
    {
      "verse": "53:1",
      "similarity": 0.6681445552818787
    },
    {
      "verse": "55:6",
      "similarity": 0.6117552940982062
    },
    {
      "verse": "56:75",
      "similarity": 0.5516334076970884
    }
  ]
}