{
  "chapter": "الطور",
  "text": "واصبر لحكم ربك فانك باعيننا وسبح بحمد ربك حين تقوم",
  "translations": [
    {
      "translation": "So wait steadfastly for the judgement of your Lord - you are certainly before Our eyes. And glorify and praise your Lord when you get up.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Await the judgement of your Lord, for you are always before Our eyes, and glorify your Lord with praises when you rise,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient, then, (O Prophet), until the judgement of your Lord comes. For surely you are before Our eyes. And celebrate the praise of your Lord when you rise,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wait patiently for the command of your Lord. We are watching over you. Glorify your Lord when you rise during the night\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be patient upon your Lord’s command, (O dear Prophet Mohammed – peace and blessings be upon him), for you are indeed in Our sight; and proclaim the Purity of your Lord while praising Him, whenever you stand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So wait patiently for the decision of your Lord, for verily, you are under Our Eyes; and glorify the praises of your Lord when you get up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And wait patiently for the judgment of your Lord, for surely you are before Our eyes, and sing the praise of your Lord when you rise;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be thou patient under the judgment of thy Lord; surely thou art before Our eyes. And proclaim the praise of thy Lord when thou arisest,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So wait patiently (O Muhammad) for thy Lord's decree, for surely thou art in Our sight; and hymn the praise of thy Lord when thou uprisest,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So wait patiently for the Judgement of your Lord -- you are certainly under Our watchful eye. And glorify and celebrate the praises of your Lord when you rise up [from your sleep].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And wait thou patiently the judgment of thy Lord; verily thou art before Our eyes; and hallow the praise of thy Lord when thou uprisest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So submit patiently to the judgement of your Lord, for indeed you fare before Our eyes. And celebrate the praise of your Lord when you rise [at dawn],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now await in patience the command of thy Lord: for verily thou art in Our eyes: and celebrate the praises of thy Lord the while thou standest forth,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So wait patiently (O Muhammad SAW) for the Decision of your Lord, for verily, you are under Our Eyes, and glorify the Praises of your Lord when you get up from sleep.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be patient under the Judgement of your Lord, surely, you are before Our Eyes. And exalt with the praise of your Lord when you arise,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So patiently await the decision of your Lord, for you are before Our Eyes; and proclaim the praises of your Lord when you arise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be patient, [O Muhammad], for the decision of your Lord, for indeed, you are in Our eyes. And exalt [Allah] with praise of your Lord when you arise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[52:48] And submit patiently to the judgement of your Lord, that they be reprieved, and do not be grieved, for surely you fare before Our eyes, [you are] in Our sight, We see you and preserve you. And glorify, continuously, with praise of your Lord, that is to say, say subhāna’Llāhi wa bi-hamdihi, ‘Glory, and praise, be to God!’, when you rise, from your sleeping-place or your sitting-place,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَاصْبِرْ لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنَا وَسَبِّحْ بِحَمْدِ رَبِّكَ حِينَ تَقُومُ (48(واصبر لِحُكْمِ رَبِّكَ فَإِنَّكَ بِأَعْيُنِنَا } .عطف على جملة { فذرهم حتى يلاقوا يومهم } \\[ الطور : 45 \\] الخ ، وما بينهما اعتراض وكان مفتتح السورة خطاباً للنبيء صلى الله عليه وسلم ابتداء من قوله تعالى : { إن عذاب ربك لواقع } \\[ الطور : 7 \\] المسوق مساق التسلية له ، وكان في معظم ما في السورة من الأخبار ما يخالطه في نفسه صلى الله عليه وسلم من الكدر والأسف على ضلال قومه وبعدهم عما جاءهم به من الهدى ختمَت السورة بأمره بالصبر تسلية له وبأمره بالتسبيح وحمدِ الله شكراً له على تفضيله بالرسالة .والمراد ب { حكم ربك } ما حكم به وقدره من انتفاء إجابَة بعضهم ومن إبطاء إجابة أكثرهم .فاللام في قوله : { لحكم ربك } يجوز أن تكون بمعنى ( على ( فيكون لتعدية فعل { اصبر } كقوله تعالى : { واصبر على ما يقولون } \\[ المزمل : 10 \\] . ويجوز فيها معنى ( إلى ( أي اصبر إلى أن يحكم الله بينك وبينهم فيكون في معنى قوله : { واصبر حتى يحكم اللَّه } \\[ يونس : 109 \\] ويجوز أن تكون للتعليل فيكون { لحكم ربك } هو ما حكَم به من إرساله إلى الناس ، أي اصبر لأنك تقوم بما وجب عليك .فلللام في هذا المكان موقع جامع لا يفيد غيرُ اللام مثلَه .والتفريع في قوله : { فإنك بأعيننا } تفريع العلة على المعلول { اصبر } لأنك بأعيننا ، أي بمحل العناية والكلاءة منا ، نحن نعلم ما تلاقيه وما يريدونه بك فنحن نجازيك على ما تلقاه ونحرسك من شرهم وننتقم لك منهم ، وقد وفى بهذا كله التمثيلُ في قوله : { فإنك بأعيننا } ، فإن الباء للإِلصاق المجَازي ، أي لا نغفل عنك ، يقال : هو بمرأى مني ومسمع ، أي لا يخفى عليّ شأنه . وذكر العين تمثيل لشدة الملاحظة وهذا التمثيل كناية عن لازم الملاحظة من النصر والجزاء والحفظ .وقد آذن بذلك قوله : { لحكم ربك } دون أن يقول : واصبر لحكمنا ، أو لحكم الله ، فإن المربوبية تؤذن بالعناية بالمربوب .وجمعُ الأعين : إما مبالغة في التمثيل كأنَّ الملاحظة بأعين عديدة كقوله : { واصنع الفلك بأعيننا } \\[ هود : 37 \\] وهو من قبيل { والسماء بنيناها بأييد } \\[ الذاريات : 47 \\] .ولك أن تجعل الجمع باعتبار تعدد متعلَّقات الملاحظة فملاحظةٌ للذب عنه ، وملاحظة لتوجيه الثواب ورفع الدرجة ، وملاحظة لجزاء أعدائه بما يستحقونه ، وملاحظة لنصره عليهم بعموم الإيمان به ، وهذا الجمع على نحو قوله تعالى في قصة نوح : { وحملناه على ذات ألواح ودسر تجري بأعيننا } \\[ القمر : 13 ، 14 \\] لأن عناية الله بأهل السفينة تتعلّق بإجرائها وتجنيب الغرق عنها وسلامة ركابها واختيار الوقت لإِرسائها وسلامة الركاب في هبوطهم ، وذلك خلاف قوله في قصة موسى { ولتصنع على عيني } \\[ طه : 39 \\] فإنه تعلق واحد بمشي أخته إلى آل فرعون وقولها : { هل أدلكم على من يكفله } \\[ طه : 40 \\] .{ وَسَبِّحْ بِحَمْدِ رَبِّكَ حِينَ تَقُومُ \\* وَمِنَ اليل فَسَبِّحْهُ وإدبار النجوم } .التسبيح : التنزيه ، والمراد ما يدل عليه من قول ، وأشهر ذلك هو قول : «سبحان الله» وما يرادفه من الألفاظ ، ولذلك كثر إطلاق التسبيح وما يشتق منه على الصلوات في آيات كثيرة وآثار .والباء في قوله : { بحمد ربك } للمصاحبة جمعاً بين تعظيم الله بالتنزيه عن النقائص وبين الثناء عليه بأوصاف الكمال .و { حين تقوم } وقت الهبوب من النوم ، وهو وقت استقبال أعمال اليوم وعنده تتجدد الأسباب التي من أجلها أُمر بالصبر والتسبيح والحمد .فالتسبيح مراد به : الصلاة ، والقيام : جعل وقت للصلوات : إمّا للنوافل ، وإما لصلاة الفريضة وهي الصبح .\n\n",
      "translations": [
        {
          "translation": "(So wait patiently (0 Muhammad) for your Lord's decree) upon conveying the message of your Lord; and it is said this means: be content with the decree of your Lord regarding that which befalls you in the course of obeying your Lord, (for surely thou art in Our sight; and hymn the praise of thy Lord) pray by the command of your Lord (when thou uprisest) from your bed for the Fajr prayer.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بِأَعْيُنِنَا } معناه بحفظِنا وكلائتِنا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"With Our eyes\" - this means that We will preserve and protect them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { ٱصْبِرْ } يا أكمل الرسل { لِحُكْمِ رَبِّكَ } بإمهالهمم إلى قيام الساعة\n وإبقائك فيما بينهم بأنواع التعب والعناء\n ولا تستعجل لمقتهم وهلاكهم\n ولا تخف من مكرهم معك وغدرهم عليك { فَإِنَّكَ بِأَعْيُنِنَا } وكنف حفظنا وحوزة حراستنا وحضانتنا\n نكفيك نكف عنك مؤنة شرورهم\n ولا تلتفت إليهم\n ولا تبالِ بمكرهم وكيدهم\n ولا تشتغل عنا بهمم وبمخاصمتهم { وَسَبِّحْ } أي: نزه ربك عن أن يعجز عن أخذهم وا نتقامهم أو عن إنجاز ما وعد لك من عذابهم ملتبساً { بِحَمْدِ رَبِّكَ } في جميع حلااتك وأوقاتك سيما { حِينَ تَقُومُ } [الطور: 48] من منامك\n\n\n{ وَمِنَ ٱللَّيْلِ } حين تستريح فيه للنوم { فَسَبِّحْهُ } لتكون على ذكر من ربك حين رقودك وغفلتك عن حواسك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: لنبيه صلى الله عليه وسلم ولمَن كان على قدمه: { واصبرْ لحُكم ربك } بإمهالهم إلى اليوم الموعود مع مقاساتك آذاهم\n أو: واصبر لِمَا حكم به عليك من شدائد الوقت\n وإذاية الخلق\n { فإِنك بأعيُننا } أي: حفظنا وحمايتنا\n بحيث نراقبك ونكلؤك\n والمراد بالحُكم: القضاء السابق\n أي: لما قُضي به عليك\n وفي إضافة الحُكم إلى عُنوان الربوبية تهييج على الصبر\n وحل عليه\n أي: إنما هو حُكم سيدك الذي يُربيك ويقوم بأمورك وحفظك\n فما فيه إلا نفعك ورفعة قدرك\n وجمع العين والضمير للإيذان بغاية الاعتناء بالحفظ والرعاية\n { وسبِّح بحمد ربك } أي: نزِّهه ملتبساً بحمده على نعمائه الفائتة للحصر\n { حين تقومُ } أي: من أيّ مكان قمت\n أو: من منامك\n وقال سعيد بن جبير: حين تقوم من مجلسك تقوم: سبحانك اللهم وبحمدك\n وقال الضحاك والربيع: إذا قمت إلى الصلاة فقل: سبحانك اللهم وبحمدك وتبارك اسمك\n وتعالى جَدُّكَ\n ولا إله غيرك\n هـ\n { ومن الليل فسبِّحه } أي: في بعض الليل وأفراده لأن العبادة فيه أشق على النفس\n وأبعد من الرياء\n كما يلوح به تقدميه على الفعل\n والمراد إما الصلة في الليل\n أو التسبيح باللسان سبحان الله وبحمده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:218",
      "similarity": 0.4922712733198665
    },
    {
      "verse": "56:84",
      "similarity": 0.45904259498484073
    },
    {
      "verse": "37:174",
      "similarity": 0.44234754138845067
    },
    {
      "verse": "37:178",
      "similarity": 0.43963512144579914
    },
    {
      "verse": "38:88",
      "similarity": 0.43389150429716344
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/052048.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/052048.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/52:48.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}