{
  "chapter": "النجم",
  "text": "والنجم اذا هوى",
  "translations": [
    {
      "translation": "By the star when it descends,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I CALL TO witness the star of the pleiades when it has dipped\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the star when it sets:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the declining star,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By oath of the beloved shining star Mohammed (peace and blessings be upon him), when he returned from the Ascent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the star when it goes down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I swear by the star when it goes down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the Star when it plunges,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the Star when it setteth,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the setting star,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the star when it setteth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the star when it sets:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the Star when it goes down,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the star when it goes down, (or vanishes).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the star when it plunges,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the star as it goes down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the star when it descends,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[53:1] By the Star — the constellation Pleiades (al-thurayya) — when it sets, [when] it disappears,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (By the Najm when it setteth): '(By the Najm when it setteth) He says: Allah swears by the Qur'an when Gabriel takes it down to Muhammad in instalments (nujuman): one, two, three or four verses at a time. There was a 20 years interval between the first and last verses. When this verse was revealed, 'Utbah Ibn Abi Lahab heard that the Prophet (pbuh) swore by the revelation of the Qur'an in instalment and so he said: \"Tell Muhammad that I disbelieve in the instalments of the Qur'an\". When the Prophet (pbuh) was informed of this, he prayed: \"O Allah! Set on him one of Your wild beasts\". Later, Allah set on him a lion near Harran that snatched him from among his friends and took him to a place nearby. It tore him apart from head to foot but did not eat him because of his impurity, just as the Prophet (pbuh) had prayed against him. It is also said here Allah swore by the stars when they set, 620\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { وَٱلنَّجْمِ إِذَا هَوَىٰ } معناه نُجومُ القُرآنِ كان يَنزلُ بِهِ جبريل عليهِ السّلامُ على النبي صلى الله عليهِ وعلى آلهِ وسلَّمَ خمسَ آياتٍ أو أكثرَ أو أقلَّ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\nHe said: \"Ali ibn Ahmad told us...\"\n\n\nIt was narrated from Zayd ibn Ali that he said regarding the words of Allah, {And the star when it falls} [Quran 53:1], \"The stars of the Quran are those which Gabriel would bring down to the Prophet Muhammad (peace and blessings of Allah be upon him) five verses at a time, or more or less.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ والنَّجم إذا هوى } أقسم بالنفس المحمدية إذا فنيت وغربت عن محل الظهور وسقطت عن درجة الاعتبار في الظهور والحضور { ما ضلّ صاحبكم } بالوقوف مع النفس والانحراف عن المقصد الأقصى بالميل لها { وما غوى } بالاحتجاب بالصفات والوقوف معها في مقام القلب { وما ينطق عن الهوى } بظهور صفة النفس في التلوين { إن هو إلاَّ وحي يوحى } إليه من وقت وصوله إلى أفق القلب الذي هو سماء الروح إلى انتهائه إلى الأفق الأعلى الذي هو نهاية مقام الروح المبين { علّمه } روح القدس الذي هو { شديد القوى } قاهر لما تحته من المراتب مؤثر فيها تأثيراً قوياً { ذو مرّة } ذو متانة وإحكام في علمه لا يمكن تغيره ونسيانه { فاسْتوى } فاستقام على صورته الذاتية والنبي بالأفق الأعلى لأنه حين كون النبي بالأفق المبين لا ينزل على صورته لاستحالة تشكل الروح المجرد في مقام القلب إلا بصورة تناسب الصور المتمثلة في مقامه ولهذا كان يتمثل بصورة دحية الكلبي وكان من أحسن الناس صورة وأحبهم إلى رسول الله صلى الله عليه وسلم\n إذ لو لم يتمثل بصورة يمكن انطباعها في الصدر لم يفهم القلب كلامه ولم ير صورته\n وأما صورته الحقيقية التي جبل عليها فلم تظهر للنبي عليه السلام إلا مرتين عند عروجه إلى الحضرة الأحدية ووصوله بمقام الروح في الترقي وعند نزوله عنها ورجوعه إلى المقام الأول عند سدرة المنتهى في التدلي\n { ثم دنا } رسول الله صلى الله عليه وسلم إلى الله وترقى عن مقام جبريل بالفناء في الوحدة والترقي عن مقام الروح\n وفي هذا المقام قال جبريل عليه السلام: \" لو دنوت أنملة لاحترقت \" \n إذ وراء مقامه ليس إلا الفناء في الذات والاحتراق بالسبحات { فتدلى } أي: مال إلى الجهة الإنسية بالرجوع من الحق إلى الخلق حال البقاء بعد الفناء والوجود الموهوب الحقاني { فكان قاب قوسين } أي: كان عليه السلام مقدار دائرة الوجود الشاملة للكل المنقسمة بخط موهوم إلى قوسين باعتبار الحق والخلق\n والاعتبار هو الخط الموهوم القاسم للدائرة إلى نصفين\n فباعتبار البداية والتداني يكون الخلق هو القوس الأول الحاجب للهوية في أعيان المخلوقات وصورها والحق هو النصف الأخير الذي يقرب منه شيئاً فشيئاً وينمحي ويفنى فيه\n وباعتبار النهاية والتدلي فالحق هو القوس الأول الثابت على حاله أزلاً وأبداً والخلق هو القوس الأخير الذي يحدث بعد الفناء بالوجود الجديد الذي وهب له { أو أدنى } من مقدار القوسين بارتفاع الإثنينية الفاصلة الموهمة لاتصال أحد القوسين بالآخرة وتحقق الوحدة الحقيقية في عين الكثرة بحيث تضمحل الكثرة فيها وتبقى الدائرة غير منقسمه بالحقيقة أحدية الذات والصفات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلنَّجْمِ إِذَا هَوَىٰ } [النجم: 1] أي: وحق النجوم الثواقل الهاوية\n النازلة بقلوب أرباب الإدارة من عالم اللاهوت\n ليهتدوا بها في ظلمات التعينات إلى فضاء التوحيد وشمس الوحدة الذاتية الحقيقية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { والنجم } أي: الثريا\n أو: جنس النجم { إِذا هَوَى } إذا غرب\n أو: انتثر يوم القيامة\n أو طلع\n يقال: هَوَى هَوِياً\n بوزن \" قَيول \" إذا غرب\n وهَوى هُوياً\n بوزن دُخول: إذا طلع\n والعامل في { إذا } فعل القسم\n أي: أقسم بالنجم وقت غروبه أو طلوعه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:16",
      "similarity": 0.8152048862023996
    },
    {
      "verse": "37:88",
      "similarity": 0.7959397178811707
    },
    {
      "verse": "52:49",
      "similarity": 0.6681445552818785
    },
    {
      "verse": "55:6",
      "similarity": 0.6585201050873789
    },
    {
      "verse": "56:75",
      "similarity": 0.5857315928093186
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/053001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/053001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/53:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}