{
  "chapter": "النجم",
  "text": "ما زاغ البصر وما طغى",
  "translations": [
    {
      "translation": "Neither did sight falter nor exceed the bounds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His eye did not waver, nor did it stray,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad's) eyes did not deceive him, nor did they lead him to falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sight did not shift, nor did it cross the limits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sight turned not aside, nor it transgressed beyond the limit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The eye did not turn aside, nor did it exceed the limit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "his eye swerved not; nor swept astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The eye turned not aside nor yet was overbold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His sight did not waver nor was it unduly bold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sight turned not aside, nor it exceeded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His gaze did not swerve, nor did it overstep the bounds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(His) sight never swerved, nor did it go wrong!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sight (of Prophet Muhammad SAW) turned not aside (right or left), nor it transgressed beyond (the) limit (ordained for it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "his eyes did not swerve, nor did they stray\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sight did not waver, nor did it exceed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sight [of the Prophet] did not swerve, nor did it transgress [its limit].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[53:17] The eye did not swerve, on the part of the Prophet (s), nor did it go beyond [the bounds], that is to say, his gaze did not turn away from the object of vision designated for it, nor did it go beyond that [object] on that night.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The eye turned not aside) the sight of Muhammad (pbuh) did not turn right or left because of what he saw (nor yet was overbold) due to what he saw; he saw that Gabriel had 600 wings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَا زَاغَ ٱلْبَصَرُ } معناه ما عَدَلَ\n\n\n\n\nوقوله تعالى: { وَمَا طَغَىٰ } معناه ما جَارَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { مَا زَاغَ ٱلْبَصَرُ } أي: ما مال وانحرف بصر رسول الله صلى الله عليه وسلم عند تعاقب التجليات الإلهية، وترادف شئونه الغيبية، وتطوراته الجمالية والجلالية حسب أسمائه وصفاته العلية، عن وحدة ذاته، وما يشغله شيء منه عنه سبحانه { وَمَا طَغَىٰ } [النجم: 17] خرج نفسه صلى الله عليه وسلم عند رؤية ما رأى من العجائب والغرائب عن ربقة الرقية صلى الله عليه وسلم، وعروة العبودية، بل التزم حينئذ بقيام ما لزم من آداب العبودية ولوازم الإطاعة والانقياد أكثر مما التزمها قبل انكشافه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ما زاغ البصرُ } أي: بصر محمدٍ صلى الله عليه وسلم، أي: ما عدل عن رؤية العجائب التي مُكِّنَ من رؤيتها، { وما طغى } وما جاوز ما أمر برؤيته، { لقد رأى من آيات ربه الكبرى } أي: والله لقد رأى من عجائب الملكوت وأسرار الجبروت وما لا يفي به نطاق العبارة وقد دُوِّنَتْ هنا كُتبٌ في عجائب ما رآه صلى الله عليه وسلم ليلة المعراج\n الإشارة: أقسم اللّهُ تعالى بنجم العلم إذا طلع في أفق سماء القلوب الصاحية، إنَّ هذا القلب الذي طلع فيه نجم العلم بالله، وأشرقت عليه شمسُ الحقائق، لا يَضل صاحبُه ولا يغوى، وما ينطق عن الهوى لأنه مستغرق في شهود الحق، لا يتجلى فيه إلا الحق، { إن هو } أي: ما يتجلى فيه إلا وحي يُوحى من قِبل الإلهام الإلهي، علّمه شديدُ القوى، وهو الوارد الرباني، ذو مِرةٍ وشدة لأنه من حضرة قهّار، ولا يُصادم شيئاً إلا دفعه، فاستوى وهو بالأفق الإعلى على من سماء الغيوب، ثم دنا من القلب فتدلّى، فكان من القلب قاب قوسين أو أدنى، فأوحى اللّهُ تعالى بواسطة ذلك الوارد إلى عبده ما أوحى من علوم الحقائق والأسرار، ومن مكاشفات غيوب الأقدار، ما كذب الفؤادُ فيما رأى لأنه حق، لكن قهرية العبودية غيَّبت عنه تعيين وقت وقوعه\n ولقد رآه، أي: رأى القلبُ أسرارَ ذات الحق، نزلةً أخرى في عالم الجبروت، الخارج عن دائرة التجليات الكونية، وهي الأسرار اللطيفة، المحيطة في الأنوار الملكوتية والملكية، عند سِدرة المنتهى، وهي شجرة القبضة المحمدية، التي انتهى إليها علم العلماء، وأرواح الشهداء، إذ لا يخرج عن دائرتها أفكار العارفين\n عندها جنة المأوى التي يأوي إليها أفكار العارفين وأسرار الراسخين، إذا يغشى السدرة - أي: شجرة الكون - ما يغشى من الفناء والتلاشي عند سطوع شمس الحقائق، ما زاغ بصرُ البصيرة عن شهود تلك الأسرار، وما حجبه عنها أرض، ولا سماء، ولا عرش، ولا كرسي لتلطُّف تلك العوالم في نظر العارف، وما طغى: وما جاوز العبودية حتى يطمع في الإحاطة بعظمة كنه الربوبية، فإنَّ الإحاطة لا تُمكن، لا في هذه الدار، ولا في تلك الدار، بل يبقى الترقي في الكشوفات، والمزيد من حلاوة الشهود أبداً سرمداً، لقد رأى هذا القلب الصافي من عجائب ربه الكبرى، حيث وسع مَن لم تسعه أرضه ولا سماؤه\n\n\nوقال الروتجبي بعد كلام: في هذه الآية بيان كمال شرف حبيبه، إذ رآه نزلةً أخرى، عند سدرة المنتهى، ظنَّ صلى الله عليه وسلم أنَّ ما رآه في الأول لا يكون في الكون - أي: في مظهر الكون - لكمال علمه بتنزيه الحق، فلما رآه ثانياً علم أنه لا يحجبه شيء من الحدثان، وعادة الكُبراء إذا زارهم أحد يأتون معه إلى باب الدار إذا كان عليهم كريمً، فهذا منه سبحانه إظهار كمال حُبه لحبيبه\n وحقيقة الإشارة: أنه سبحانه أراد أن يعرف حبيبه مقام الالتباس، فلبس الأمر، وظهرَ المكرُ، وبان الحقُّ من شجرة سدرة المنتهى، كما بان من شجرة العِناب لموسى، ليعرفَهُ حبيبُه بكمال المعرفة، إذ ليس بعارف مَن لم يعرف حبيبه في لباس مختلفة، وبيان ذلك في قوله: { إذ يغشى السدرة ما يغشى } وأبهم ما غشيه لأن العقول لا تُدرك حقائق ما يغشاها، وكيف يغشاها، والقِدم منزّه عن الحلول في الأماكن؟! كان ولا شجرة، وكانت الشجرة مرآه لظهوره سبحانه، ما ألطف ظهوره، لا يعلم تأويله إلا الله، والراسخون في العلم يؤمنون به بعد عرفانهم به\n هـ\n ولمّا فرغ من ذكر عظمة الله وكبريائه، ذكر حقارة مَنْ عُبد مِن دونه، ترهيباً وترغيباً، فقال: { أَفَرَأَيْتُمُ ٱللاَّتَ وَٱلْعُزَّىٰ }\n\n",
      "translations": []
    }
  ]
}