{
  "chapter": "النجم",
  "text": "ان هى الا اسماء سميتموها انتم وءاباؤكم ما انزل الله بها من سلطن ان يتبعون الا الظن وما تهوى الانفس ولقد جاءهم من ربهم الهدى",
  "translations": [
    {
      "translation": "They are nothing but names which you yourselves have given, you and your forefathers. Allah has sent down no authority for them. They are following nothing but conjecture and what their own selves desire. And that when guidance has reached them from their Lord!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are only names which you and your fathers have invented. No authority was sent down by God for them. They only follow conjecture and wish-fulfilment, even though guidance had come to them already from their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are nothing but names that you and your forefathers have invented, for which Allah has sent down no authority. They are merely following their conjectures and their carnal desires although guidance has come to them from their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are only names given by yourselves and your fathers. God has not given them any authority. They, (unbelievers), only follow mere conjecture and the desires of their souls, even though guidance has already come to them from their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are nothing but some names that you have coined, you and your forefathers – Allah has not sent any proof for them; they follow only guesses and their own desires; whereas the guidance from their Lord has come to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are but names which you have named - you and your fathers - for which Allah has sent down no authority. They follow but a guess and that which they themselves desire, whereas there has surely come to them the guidance from their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are naught but names which you have named, you and your fathers; Allah has not sent for them any authority. They follow naught but conjecture and the low desires which (their) souls incline to; and certainly the guidance has come to them from their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are naught but names yourselves have named, and your fathers; God has sent down no authority touching them. They follow only surmise, and what the souls desire; and yet guidance has come to them from their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are but names which ye have named, ye and your fathers, for which Allah hath revealed no warrant. They follow but a guess and that which (they) themselves desire. And now the guidance from their Lord hath come unto them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "these are nothing but names which you yourselves have devised, you and your forefathers. God has sent down no authority for them. They follow nothing but conjecture and what their own selves desire, even though guidance has already come to them from their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are but names which ye have named, ye and your fathers, for which Allah hath sent down no authority. They follow but their fancy, and that which pleaseth their souls; whereas assuredly there hath come Unto them from their Lord the guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are but names, which you have coined—you and your fathers—for which Allah has not sent down any authority. They follow nothing but conjectures and the desires of the [lower] soul, while there has already come to them the guidance from their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are nothing but names which ye have devised,- ye and your fathers,- for which Allah has sent down no authority (whatever). They follow nothing but conjecture and what their own souls desire!- Even though there has already come to them Guidance from their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are but names which you have named, you and your fathers, for which Allah has sent down no authority. They follow but a guess and that which they themselves desire, whereas there has surely come to them the Guidance from their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are but names, named by you and your fathers. Allah has not sent down any authority for them. They follow conjecture and their soul's desire, eventhough the guidance of their Lord has come to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are nothing but names, which you have devised, you and your ancestors, for which God sent down no authority. They follow nothing but assumptions, and what the ego desires, even though guidance has come to them from their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are not but [mere] names you have named them - you and your forefathers - for which Allah has sent down no authority. They follow not except assumption and what [their] souls desire, and there has already come to them from their Lord guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[53:23] These, that is, the mentioned [deities], are nothing but names which you have named, by which you have named, you and your fathers, idols that you worship. God has not revealed any warrant, [any] proof or evidence, for them, that is to say, [for] the worship of them. They follow nothing but conjecture, in their worship of them, and that which [ignoble] souls desire, of that which Satan adorned for them, that they may intercede for them before God, exalted be He, even though guidance has already come to them from their Lord, by the tongue of the Prophet (s), with definitive proof; yet they do not desist from their ways.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "They are) i.e. al-Lat, al-'Uzza and Manat (but names) idols (which ye have named ye and your fathers) you have appointed them as deities; it is also said that this means: you and your forefathers have made them, (for which Allah hath revealed) regarding their worship or naming (no warrant) no Scripture wherein is found your proof. (They follow) they do not worship al-Lat, al-'Uzza and Manat or that which they call deities (but a guess) except through surmise and have no certainty about their worship (and that which (they) themselves desire) and they also worship them because they follow their own desires. (And now the guidance from their Lord) the explanation in the Qur'an that Allah has no son or partner (hath come unto them) to the people of Mecca.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَّآ أَنزَلَ ٱللَّهُ بِهَا مِن سُلْطَانٍ } معناه من حُجةٍ\n\n\n\n\nوقوله تعالى: { وَلَقَدْ جَآءَهُم مِّن رَّبِّهِمُ ٱلْهُدَىٰ } معناه البيانُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { إِنْ هِيَ } أي: ما آلهتكم التي أنتم أثبتموها، واعتقدتم شركتها مع الله { إِلاَّ أَسْمَآءٌ } لا مسيمات لها أصلاً بل { سَمَّيْتُمُوهَآ أَنتُمْ } تبعاً { وَآبَآؤُكُم } أصالة من تلقاء أنفسكم؛ إذ { مَّآ أَنزَلَ ٱللَّهُ بِهَا مِن سُلْطَانٍ } برهان واضح، وحجة قاطعة بل { إِن يَتَّبِعُونَ } أي: ما يتبع أسلافكم الحمقى { إِلاَّ ٱلظَّنَّ } والخيال الناشئ من أوهامهم وأحلامهم السخيفة أمثالكم أيها الجاهلون { وَمَا تَهْوَى ٱلأَنفُسُ } أي: ما تهويه وتشتهيه نفوسهم { وَلَقَدْ جَآءَهُم } ونزل عليهم حينئذ أيضاً على ألسنة رسلهم { مِّن رَّبِّهِمُ ٱلْهُدَىٰ } [النجم: 23] المصول إلى مرتبة التوحيد، فتركوها ظلماً وعدواناً، ولم يتبعوها أمثالكم أيها الحمقى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنْ هي } أي: هذه الأصنام { إِلاَّ أسماءٌ } وليس تحتها في الحقيقة مسميات لأنكم تدّعون لها الألوهية، وهي أبعد شيء منها، { سميتموها } آلهة، أو: سميتم بها هذه الأصنام، واعتقدتم أنها آلهة، بمقتضى أهوائكم الباطلة، { أنتم وآباؤكم ما أنزل اللّهُ بها } بعبادتها { من سلطان } من حجة\n { إِن يتبعونَ } فيما ذكر من التسمية والعمل بموجبها { إلاَّ الظنَّ }: إلا توهم أنَّ ما هم عليه حق، توهُّماً باطلاً، { وما تهوى الأنفُسُ } أي: ما تشتهيه أنفسهم الأمّارة، { ولقد جاءهم من ربهم الهدى } الرسول والكتاب فتركوه",
      "translations": []
    }
  ]
}