{
  "chapter": "النجم",
  "text": "فلله الءاخرة والاولى",
  "translations": [
    {
      "translation": "The last and the first belong to Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belong the End and the Beginning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belong both the Next World and the present.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the life to come and all that is in this life belongs only to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So (know that) Allah only is the Owner of all – the Hereafter and this world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But to Allah belongs the last (Hereafter) and the first (the world).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! for Allah is the hereafter and the former (life).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to God belongs the First and the Last.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But unto Allah belongeth the after (life), and the former.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But it is to God that the Hereafter and this world belong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah's is the last and the first.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet to Allah belong this world and the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But it is to Allah that the End and the Beginning (of all things) belong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But to Allah belongs the last (Hereafter) and the first (the world).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the Eternal life and the first life.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belong the Last and the First.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather, to Allah belongs the Hereafter and the first [life].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[53:25] Yet to God belong the Hereafter and the former [life], that is to say, [the life of] the world, and so nothing comes to pass in them except what He, exalted, wills.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But Unto Allah belongeth the after (life)) through the bestowal of reward, honour and intercession, (and the former) by giving knowledge and success.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n[فصلت: 50]، وكَتَمَنِّي بعضُهم أن يكون هو النبي، { فللّه الآخرةُ والأُولى } أي: الدنيا والآخرة، هو مالكهما والحاكم فيهما، يُعطي الشفاعة والنبوة مَن شاء، لا مَن تمناها بمجرد الهوى، وهو تعليل لانتفاء أن يكون للإنسان ما تمنّى، فإنَّ ختصاص أمور الآخرة والأُولى به تعالى مقتضٍ لانتفاء أن يكون للإنسان شيء مما تمنى إلا ان يشاء ويرضى\n الإشارة: هذه الأصنام موجودة في كل إنسان، فاللات: حب اللذات والشهوات الجسمانية الفانية، فمَن كان حريصاً عليها، جامعاً لأسبابها، فهو عابد لها، والعُزى: حب العز والجاه والرئاسة وسائر الشهوات القلبية، فمَن طلبها فهو عبد لها، ومناة: تمني البقاء في الدنيا الدنية الحقيرة، وطول الأمل فيها، وكراهية الموت، فمَن كان هذا وصفه فهو عبد الدنيا، كاره لقاء الله، فيكره اللّهُ لقاءه، فتوجه لهؤلاء العتاب بقوله تعالى: { أفرأيتم اللات والعزى ومناة الثالثة الأخرى ألكم الذكر } حيث تُحبون ما هو كمال لأنفسكم، { وله الأنثى }؟ حيث جعلتم هذه الأشياء الحقيرة شريكة لله في استحقاق العبادة والمحبة، تلك إذاً قسمة ضِيزى جائرة، ما هي إلا أسماء ليس تحتها طائل، تفنى ويبقى عليها العذاب والعتاب، سميتموها واعتنيتم بشأنها والانكباب عليها، أنتم وآباؤكم، ما أنزل الله بمتابعتها والحرص على تحصيلها من سلطان ولا برهان، إن يتبعون في ابتاعها والحرص عليها إلا الظن، ظنوا أنها كانت مباحة في ظاهر الشرع لا تَضُر القلبَ ولا تحجبه عن شهود الرب، وهو رأي فاسد إذ ليس للقلب إلا وجهة واحدة، إن توجه لطلب الحظوظ أعرض عن الله قطعاً، وإن توجه لله أعرض عما سواه، وراجع ما تقدم في قوله:\n\n[الأحقاف: 20] الآية\n ويتبعون أيضاً ما تهوى الأنفُس الأمَّارة لأنها لا تهوى إلا ما فيه حظها وهواها، ولقد جاءهم من ربهم الهُدى، أي: مَن يهدي إلى طريق السلوك، بقطع العلائق النفسانية والقلبية، وهم خلفاء الرسول عليه السلام، الدعوان إلى الله، من شيوخ التربية في كل زمان، أم للإنسان ما تمنى، ليس له ما يتمنى إلا بسابق العناية، فلا يُدرك العبدُ من الدنيا والآخرة، ومن الله تعالى، إلا ما سبق به القدر، كما قال الشاعر:\n\n\n\nفلله الآخرة والأولى، قال القشيري: يُشير إلى قَهْرمَانيةِ الحق تعالى على العالم كله، ملكه وملكوته، الأخروي والدنيوي، فلا يملك الإنسان من أمر الدارين شيئاً، بل ملك الآخرة تحت تصرف يده اليمنى، المتقضية لموجبات حصول الآخرة من الأعمال الصالحة والأفعال الحسنة، يهبه باسمه الواهب لمَن شاء أن يكون مظهراً للطفه وجماله، وملك الدنيا تحت تصرف يده اليسرى، المقتضية لأسباب حصول الدنيا، من حب الدنيا الدنية، المنتجة للخطيئة ومتابعة النفس الخبيثة، وموافقة الطبيعة اللئيمة، باسمه المقسط، لمَن شاء أن يكون مظهر قهرِه وجلاله، وليس ذلك يزيد في ملكه، ولا هذا ينقص من ملكه، وكلتا يديه ملأى سحّاء، أي: فيّاضة\n هـ\n ثم نفى الشفاعة عَمَّن يستحقها من الملائكة الكرام، فضلاً عمن لا يستحقها من الأصنام اللئام، فقال: { وَكَمْ مِّن مَّلَكٍ فِي ٱلسَّمَاوَاتِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "92:13",
      "similarity": 0.9464482966735706
    },
    {
      "verse": "56:49",
      "similarity": 0.9094076217280089
    },
    {
      "verse": "93:4",
      "similarity": 0.7922720571402914
    },
    {
      "verse": "37:126",
      "similarity": 0.5447393648171839
    },
    {
      "verse": "26:137",
      "similarity": 0.5241270095049964
    }
  ]
}