{
  "chapter": "النجم",
  "text": "وما لهم به من علم ان يتبعون الا الظن وان الظن لا يغنى من الحق شيـا",
  "translations": [
    {
      "translation": "They have no knowledge of this. They are only following conjecture. Conjecture is of no avail whatever against the truth.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they have no knowledge of this, and follow nothing but conjecture, but conjecture cannot replace the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "although they have no knowledge regarding that. They only follow their conjecture and conjecture can never take the place of the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They only follow mere conjecture which can never sufficiently replace the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they do not have any knowledge of it; they just follow assumption; and indeed assumption does not serve any purpose in place of the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they have no knowledge thereof. They follow but conjecture, and verily, conjecture is no substitute for the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have no knowledge of it; they do not follow anything but conjecture, and surely conjecture does not avail against the truth at all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have not any knowledge thereof; they follow only surmise, and surmise avails naught against truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have no knowledge thereof. They follow but a guess, and lo! a guess can never take the place of the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have no knowledge to base this on. They merely indulge in guess-work which can never replace the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have no knowledge thereof; they follow but a vain opinion, and verily a vain opinion attaineth not aught of the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not have any knowledge of that. They follow nothing but conjectures, and conjecture is no substitute for the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they have no knowledge therein. They follow nothing but conjecture; and conjecture avails nothing against Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "While they have no knowledge thereof. They follow but a guess, and verily, guess is no substitute for the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet of this they have no knowledge, they follow mere conjecture, and conjecture does not help against truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have no knowledge of that. They only follow assumptions, and assumptions are no substitute for the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have thereof no knowledge. They follow not except assumption, and indeed, assumption avails not against the truth at all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[53:28] But they do not have any knowledge thereof, of this claim. They follow, in this [respect], nothing but conjecture, which they have conjured up, and indeed conjecture can never substitute for the truth, that is to say, when it comes to acquiring knowledge of that which one is required to have knowledge of.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they have no knowledge thereof) they have no proof or elucidation about what they say. (They follow but a guess) they lie out of surmise and do not have any certainty, (and lo! a guess) and worship based on guess and claims based on guess (can never take the place of the Truth) cannot spare one from Allah's chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } الحال أنه { مَا لَهُم بِهِ } أي: بقولهم هذا { مِنْ عِلْمٍ } لا يقين ولا ظن، ولا سند من عقل ونقل، بل { إِن يَتَّبِعُونَ } أي: ما يتبعون في قولهم هذا { إِلاَّ ٱلظَّنَّ } والتخمين الناشئ من تقليد آبائهم، المنتسبين إلى الجهل والعناد { وَإِنَّ ٱلظَّنَّ } المستند إلى الجهل والتقليد { لاَ يُغْنِي } ويفيد { مِنَ ٱلْحَقِّ } الحقيق بالاتباع { شَيْئاً } [النجم: 28] من الإغناء والإفادة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما لهم به من علم } أي: بما يقولون\n وقرىء \" بها \" أي \" بالتسمية، أو بالملائكة\n { إِن يتبعونَ إِلا الظن } وهو تقليد الآباء، { وإن الظن } أي: جنس الظن، ولذلك أظهر في موضع الإضمار، { لا يُغني من الحق شيئاً } من الإغناء لأن الحق عبارة عن حقيقة الشيء، وهو لا يُدرك إلا بالعلم، والظن لا اعتداد به في باب المعارف الحقيقية، وإنما يُعتد به في العمليات وما يؤدي إليها\n { فأعْرِضْ عَمَّن تولى عن ذِكْرِنا } أي: عنهم، ووضع الموصول موضع ضميرهم للتوصل إلى وصفهم بما في حيز الصلة من الأوصاف القبيحة، ولتعليل الحكم، أي: فأعرض عمن تولى عن ذكرنا المفيد للعلم اليقيني، وهو القرآن المنطوي على علوم الأولين والآخرين، المذكِّر بالأمور الآخرة، أو: عن ذكرنا كما ينبغي، فإن ذلك يستتبع ذكر الآخرة وما فيها من الأمور المرغوب فيها والمرهوب عنها، قال الطيبي: أعرِضْ عن دعوة مَن تدعوه إلى لقاء ربه والدار الآخرة، وهو يقول: { ماهي إلا حياتنا الدنيا\n\n\n } الخ، { ولم يُرِدْ إِلاَّ الحياةَ الدنيا } وزخارفها، قاصراً نظره إليها، والمراد بالإعراض عنه: إهماله والغيبة عنه، فإنَّ مَن أعرض عن الذكر، وانهمك في الدنيا، بحيث كانت هي منتهى همته، وقصارى سعيه، لا تزيده الدعوة إلى خلافها إلا عناداً، وإصراراً على الباطل",
      "translations": []
    }
  ]
}