{
  "chapter": "النجم",
  "text": "وكم من ملك فى السموت لا تغنى شفعتهم شيـا الا منۢ بعد ان ياذن الله لمن يشاء ويرضى",
  "translations": [
    {
      "translation": "And how many angels there are in the heavens whose intercession is of no benefit at all until Allah has authorised those He wills and is pleased with them!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many as the angels be in heaven their intercession will not avail in the least without God's permission for whomsoever He please and approve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Numerous are the angels in the heavens; yet their intercession shall be of no avail, except in regard to those whom He grants the leave of intercession and whose plea He is pleased to accept.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are many angels in the heavens whose intercession will be of no benefit unless God grants such permission to whichever of them He wants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many an angel is in the heavens, whose intercession does not benefit the least unless Allah gives permission for whomever He wills, and whom He likes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are many angels in the heavens, whose intercession will avail nothing, except after Allah has given leave for whom He wills and is pleased with.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many an angel is there in the heavens whose intercession does not avail at all except after Allah has given permission to whom He pleases and chooses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many an angel there is in the heavens whose intercession avails not anything, save after that God gives leave to whomsoever He wills and is well-pleased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many angels are in the heavens whose intercession availeth naught save after Allah giveth leave to whom He chooseth and accepteth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There may be countless angels in heaven, but their intercession will be of no avail until God has given permission to those whom he chooses and accepts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many soever are angels in the heavens whose intercession shall not avail at all save after Allah hath given leave for whomsoever He listeth and pleaseth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many an angel there is in the heavens whose intercession is of not any avail, except after Allah permits whomever He wishes and approves of!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many-so-ever be the angels in the heavens, their intercession will avail nothing except after Allah has given leave for whom He pleases and that he is acceptable to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are many angels in the heavens, whose intercession will avail nothing except after Allah has given leave for whom He wills and pleases.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many an angel is there in the heavens whose intercession shall not benefit until Allah gives permission to whom He will and is pleased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many an angel is there in the heavens whose intercession avails nothing, except after God gives permission to whomever He wills, and approves?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many angels there are in the heavens whose intercession will not avail at all except [only] after Allah has permitted [it] to whom He wills and approves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[53:26] And how many an angel, that is to say, many an angel, there is in the heavens, and how honoured they are in God’s sight [but], whose intercession cannot avail in any way except after God gives permission, to them for this [intercession], for whomever He wills, of His servants, and, with whom, He is satisfied, because of His saying: and they do not intercede except for him with whom He is satisfied [Q. 21:28]. It is also wellknown that it [intercession] cannot be forthcoming from them except after permission for it has been granted: who is there that shall intercede with Him save with His leave [Q. 2:255].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَكَمْ مِنْ مَلَكٍ فِي السَّمَاوَاتِ لَا تُغْنِي شَفَاعَتُهُمْ شَيْئًا إِلَّا مِنْ بَعْدِ أَنْ يَأْذَنَ اللَّهُ لِمَنْ يَشَاءُ وَيَرْضَى (26(لما بين الله أن أمور الدارين بيد الله تعالى وأن ليس للإِنسان ما تمنّى ، ضَرب لذلك مِثالاً من الأماني التي هي أعظم أمانيّ المشركين وهي قولهم في الأصنام { ما نعبدهم إلا ليقربونا إلى اللَّه زلفى } \\[ الزمر : 3 \\] ، وقولهم : { هؤلاء شفعاؤنا عند اللَّه } \\[ يونس : 18 \\] ، فبينّ إبطال قولهم بطريق فحوى الخطاب وهو أن الملائكة الذين لهم شرف المنزلة لأن الملائكة من سكان السماوات ( فهم لا يستطيعون إنكار أنهم أشرف من الأصنام ( لا يملكون الشفاعة إلا إذا أذن الله أن يشفع إذا شاء أن يقبل الشفاعة في المشفوع له ، فكيف يكون للمشركين ما تمنوا من شفاعة الأصنام للمشركين الذين يقولون { هؤلاء شفعاؤنا عند اللَّه } وهي حجارة في الأرض وليست ملائكة في السماوات ، فثبت أن لا شفاعة إلا لمن شاء الله ، وقد نفي الله شفاعة الأصنام فبطل اعتقاد المشركين أنهم شفعاؤهم ، فهذه مناسبة عطف هذه الجملة على جملة { أم للإنسان ما تمنى } \\[ النجم : 24 \\] . وليس هذا الانتقال اقتضاباً لبيان عظم أمر الشفاعة .و { كم } اسم يدل على كثرة العدد وهو مبتدأ والخبر { لا تغني شفاعتهم } .وقد تقدم الكلام على { كم } في قوله تعالى : { سل بني إسرائيل كم آتيناهم من آية بينة } في سورة البقرة ( 211 ( ، وقوله : { وكم من قرية أهلكناها } في الأعراف ( 4 ( .وفي { السموات } صفة ل { ملك } . والمقصود منها بيان شرفهم بشرف العالم الذي هم أهله ، وهو عالم الفضائل ومنازل الأسرار .وجملة { لا تغني شفاعتهم } الخ ، خبر عن { كم } ، أي لا تغني شفاعة أحدهم فهو عام لوقوع الفعل في سياق النفي ، ولإِضافة شفاعة إلى ضميرهم ، أي جميع الملائكة على كثرتهم وعلوّ مقدارهم لا تغني شفاعة واحد منهم .و { شيئاً } مفعول مطلق للتعميم ، أي شيئاً من الإِغناء لزيادة التنصيص على عموم نفي إغناء شفاعتهم .ولما كان ظاهر قوله : { لا تغني شفاعتهم } يوهم أنهم قد يشفعون فلا تقبل شفاعتهم ، وليس ذلك مراداً لأن المراد أنهم لا يجْرَأون على الشفاعة عند الله فلذلك عقب بالاستثناء بقوله : { إلا من بعد أن يأذن الله لمن يشاء ويرضى } ، وذلك ما اقتضاه قوله : { ولا يشفعون إلا لمن ارتضى } \\[ الأنبياء : 28 \\] وقوله : { من ذا الذي يشفع عنده إلا بإذنه } \\[ البقرة : 225 \\] أي إلا من بعد أن يأذن الله لأحدهم في الشفاعة ويرضى بقبولها في المشفوع له .فالمراد ب { لمن يشاء } من يشاؤه الله منهم ، أي فإذا أذن لأحدهم قبلت شفاعته . واللام في قوله : { لمن يشاء } هي اللام التي تدخل بعد مادة الشفاعة على المشفوع له فهي متعلقة بشفاعتهم على حد قوله تعالى : { ولا يشفعون إلا لمن ارتضى } ، وليست اللامُ متعلقة ب { يأذن الله } . ومفعول { يأذن } محذوف دل عليه قوله : { لا تغني شفاعتهم } ، وتقديره : أن يأذنهم الله .ويجوز أن تكون اللام لتعدية { يأذن } إذا أريد به معنى يستمع ، أي أن يُظهر لمن يشاء منهم أنه يقبل منه .ومعنى ذلك أن الملائكة لا يزالون يتقربون بطلب إلحاق المؤمنين بالمراتب العليا كما دل عليه قوله تعالى : { ويستغفرون للذين آمنوا } \\[ غافر : 7 \\] وقوله : { ويستغفرون لمن في الأرض } \\[ الشورى : 5 \\] فإن الاستغفار دعاء والشفاعة توجه أَعلى ، فالملائكة يعلمون إذا أراد الله استجابة دعوتهم في بعض المؤمنين أذن لأحدهم أن يشفع له عند الله فيشفع فتقبل شفاعته ، فهذا تقريب كيفية الشفاعة . ونظيره ما ورد في حديث شفاعة محمد صلى الله عليه وسلم في موقف الحشر .وعُطف { ويرضى } على { لمن يشاء } للإِشارة إلى أن إذن الله بالشفاعة يجري على حسب إرادته إذا كان المشفوع له أهلاً لأن يُشفع له . وفي هذا الإِبهام تحريض للؤمنين أن يجتهدوا في التعرض لرضَى الله عنهم ليكونوا أهلاً للعفو عما فرطوا فيه من الأعمال .\n\n",
      "translations": [
        {
          "translation": "(And how many angels are in the heavens) whom you claim are Allah's daughters (whose intercession availeth naught) who intercede for no one (save after Allah giveth leave) except after Allah commands them to intercede (to whom He chooseth) to whoever deserves it from among the believers (and accepteth) them through the profession of Allah's divine Oneness!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { كم }: خبرية\n تفيد التكثير\n ومحلها: رفع بالابتداء\n والجملة المنفية: خبر\n وجمع الضمير في { شفاعتهم } لأن النكرة المنفية نعم\n يقول الحق جلّ جلاله: { وكم من ملكٍ في السماوات } أي: كثير من الملائكة { لا تُغني شفاعتُهم } عند الله تعالى { شيئاً } من الإغناء في وقت من الأوقات\n { إِلا مِن بعد أن يأذن اللّهُ } لهم في الشفاعة { لمَن يشاء } أن يشفعوا له\n { ويرضَى } ويراه أهلاً للشفاعة من أهل التوحيد والإيمان\n وأما مَنْ عداهم من أهل الكفر والطغيان فيهم عن إذن الله بمعزلٍ\n وعن الشفاعة بألف معزلٍ\n فإذا كان حال الملائكة في باب الشفاعة كما ذكر\n فما ظنهم بحال الأصنام؟! ثم شنَّع عليهم في اعتقادهم الفاسد في الملائكة\n فقال: { إِنَّ الذين لا يؤمنون بالآخرة } وما فيها من العقاب على ما يتعاطونه من الكفر والمعاصي { ليُسمُّون الملائكةَ } المنزّهين عن سمات النقص { تسميةَ الأنثى } فإن قولهم: الملائكة بنات الله\n قول منهم بأن كُلاً منهم بنته - سبحانه\n وهي التسمية بالأنثى\n وفي تعليقها بعدم الإيمان بالآخرة إشعار بأنهم في الشناعة واستتباع العقوبة بحيث لا يجترئ عليها إلا مَن لا يؤمن رأساً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:109",
      "similarity": 0.558498986441219
    },
    {
      "verse": "43:6",
      "similarity": 0.4594697070581133
    },
    {
      "verse": "39:44",
      "similarity": 0.4330143132097748
    },
    {
      "verse": "43:86",
      "similarity": 0.4237615719009954
    },
    {
      "verse": "26:100",
      "similarity": 0.41744378285267486
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/053026.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/053026.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/53:26.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}