{
  "chapter": "النجم",
  "text": "ان هى الا اسماء سميتموها انتم وءاباؤكم ما انزل الله بها من سلطن ان يتبعون الا الظن وما تهوى الانفس ولقد جاءهم من ربهم الهدى",
  "translations": [
    {
      "translation": "They are nothing but names which you yourselves have given, you and your forefathers. Allah has sent down no authority for them. They are following nothing but conjecture and what their own selves desire. And that when guidance has reached them from their Lord!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are only names which you and your fathers have invented. No authority was sent down by God for them. They only follow conjecture and wish-fulfilment, even though guidance had come to them already from their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are nothing but names that you and your forefathers have invented, for which Allah has sent down no authority. They are merely following their conjectures and their carnal desires although guidance has come to them from their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are only names given by yourselves and your fathers. God has not given them any authority. They, (unbelievers), only follow mere conjecture and the desires of their souls, even though guidance has already come to them from their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are nothing but some names that you have coined, you and your forefathers – Allah has not sent any proof for them; they follow only guesses and their own desires; whereas the guidance from their Lord has come to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are but names which you have named - you and your fathers - for which Allah has sent down no authority. They follow but a guess and that which they themselves desire, whereas there has surely come to them the guidance from their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are naught but names which you have named, you and your fathers; Allah has not sent for them any authority. They follow naught but conjecture and the low desires which (their) souls incline to; and certainly the guidance has come to them from their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are naught but names yourselves have named, and your fathers; God has sent down no authority touching them. They follow only surmise, and what the souls desire; and yet guidance has come to them from their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are but names which ye have named, ye and your fathers, for which Allah hath revealed no warrant. They follow but a guess and that which (they) themselves desire. And now the guidance from their Lord hath come unto them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "these are nothing but names which you yourselves have devised, you and your forefathers. God has sent down no authority for them. They follow nothing but conjecture and what their own selves desire, even though guidance has already come to them from their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are but names which ye have named, ye and your fathers, for which Allah hath sent down no authority. They follow but their fancy, and that which pleaseth their souls; whereas assuredly there hath come Unto them from their Lord the guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are but names, which you have coined—you and your fathers—for which Allah has not sent down any authority. They follow nothing but conjectures and the desires of the [lower] soul, while there has already come to them the guidance from their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are nothing but names which ye have devised,- ye and your fathers,- for which Allah has sent down no authority (whatever). They follow nothing but conjecture and what their own souls desire!- Even though there has already come to them Guidance from their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are but names which you have named, you and your fathers, for which Allah has sent down no authority. They follow but a guess and that which they themselves desire, whereas there has surely come to them the Guidance from their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are but names, named by you and your fathers. Allah has not sent down any authority for them. They follow conjecture and their soul's desire, eventhough the guidance of their Lord has come to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are nothing but names, which you have devised, you and your ancestors, for which God sent down no authority. They follow nothing but assumptions, and what the ego desires, even though guidance has come to them from their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are not but [mere] names you have named them - you and your forefathers - for which Allah has sent down no authority. They follow not except assumption and what [their] souls desire, and there has already come to them from their Lord guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[53:23] These, that is, the mentioned [deities], are nothing but names which you have named, by which you have named, you and your fathers, idols that you worship. God has not revealed any warrant, [any] proof or evidence, for them, that is to say, [for] the worship of them. They follow nothing but conjecture, in their worship of them, and that which [ignoble] souls desire, of that which Satan adorned for them, that they may intercede for them before God, exalted be He, even though guidance has already come to them from their Lord, by the tongue of the Prophet (s), with definitive proof; yet they do not desist from their ways.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنْ هِيَ إِلَّا أَسْمَاءٌ سَمَّيْتُمُوهَا أَنْتُمْ وَآَبَاؤُكُمْ مَا أَنْزَلَ اللَّهُ بِهَا مِنْ سُلْطَانٍ إِنْ يَتَّبِعُونَ إِلَّا الظَّنَّ وَمَا تَهْوَى الْأَنْفُسُ وَلَقَدْ جَاءَهُمْ مِنْ رَبِّهِمُ الْهُدَى (23({وكون العزَّى ومناة عندهم انثتين ظاهر من صيغة اسميهما ، وأما اللات فبقطع النظر عن اعتبار التاء في الاسم علامة تأثيث أو أصلاً من الكلمة فهم كانوا يتوهمون اللات أنثى ، ولذلك قال أبو بكر رضي الله عنه لعُروة بن مسعود الثقفي يوم الحُديبية «امصُصْ أو اعضُضْ بَظْرَ اللات» .وتقديم المجرورين في { ألكم الذكر وله الأنثى } للاهتمام بالاختصاص الذي أفادته اللام اهتماماً في مقام التهكم والتسفيه على أن في تقديم { وله الأنثى } «إفادة الاختصاص» أي دون الذكر .وجملة { تلك إذا قسمة ضيزى } تعليل للإنكار والتهكم المفاد من الاستفهام في { ألكم الذكر وله الأنثى } ، أي قد جرتُم في القسمة وما عدلتم فأنتم أحقاء بالإِنكار .والإِشارة ب { تلك } إلى المذكور باعتبار الإِخبار عنه بلفظ { قسمة } فإنه مؤنث اللفظ .و { إذن } حرف جواب أريد به جواب الاستفهام الإِنكاري ، أي ترتب على ما زعمتم أن ذلك قسمة ضِيزى ، أي قسمتم قسمة جائرة .و { ضيزى } : وزنه فُعْلى بضم الفاء من ضازة حَقَّه ، إذا نقصه ، وأصل عين ضاز همزة ، يقال : ضَأَزه حقه كمنعه ثم كثر في كلامهم تخفيف الهمزة فقالوا : ضَازهُ بالألف . ويجوز في مضارعه أن يكون يائي العين أو واويها قال الكسائي : يجوز ضَاز يضِيز ، وضَاز يضُوز . وكأنه يريد أن لك الخيار في المهموز العين إذا خفف أن تُلحقه بالواو أو الياء ، لكن الأكثر في كلامهم اعتبار العين ياء فقالوا : ضَازه حقه ضَيْزاً ولم يقولوا ضَوْزاً لأن الضوز لوك التمر في الفم ، فأرادوا التفرقة بين المصدرين ، وهذا من محاسن الاستعمال وعن المؤرّج السَّدُوسي كرهوا ضم الضاد في ضوزى فقالوا : ضيزى . كأنه يريد استثقلوا ضم الضاد ، أي في أول الكلمة مع أن لهم مندوحة عنه بالزنة الأخرى .ووزن { ضيزى } : فُعْلى اسم تفضيل ( مثل كُبْرى وطُوبى ( أي شديدة الضيز فلما وقعت الياء الساكنة بعد الضمة حرّكوه بالكسر محافظة على الياء لئلا يقلبوها واواً فتصير ضوزى وهو ما كرهوه كما قال المؤرج . وهذا كما فعلوا في بيض جمع أبيض ولو اعتبروه تفضيلاً من ضاز يضوز لقالوا : ضُوزى ولكنهم أهملوه .وقيل : وزن { ضِيزى } فِعلى بكسر الفاء على أنه اسم مثل دِفلى وشِعْرى ، ويبعِّد هذا أنه مشتق فهو بالوصفية أجدر . قال سيبويه : لا يوجد فِعلَى بكسر الفاء في الصفات ، أو على أنه مصدر مثل ذِكرى وعلى الوجهين كسرته أصلية .وقرأ الجمهور { ضيزى } بياء ساكنة بعد الضاد . وقرأه ابن كثير بهمزة ساكنة بعد الضاد مراعاة لأصل الفعل كما تقدم آنفاً . وهذا وسم لهم بالجور زيادة على الكفر لأن التفكير في الجور كفعله فإن تخيلات الإِنسان ومعتقداته عنوان على أفكاره وتصرفاته .وجملة { إن هي إلا أسماء سميتموها } استئناف يكر بالإِبطال على معتقدهم من أصله بعد إبطاله بما هو من لوازمه على مجاراتهم فيه لإِظهار اختلال معتقدهم وفي هذه الجملة احتراس لئلا يتوهم مُتَوَهم إنكار نسبتهم البنات لله إنه إنكار لتخصيصهم الله بالبنات وأن له أولاداً ذكوراً وإناثاً أو أن مصب الإِنكار على زعمهم أنها بنات وليست ببنات فيكون كالإِنكار عليهم في زعمهم الملائكة بنات . والضمير { هي } عائد إلى اللات والعزى ومناةَ . وَمَا صدق الضمير الذات والحقيقة ، أي ليست هذه الأصنام إلا أسماءُ لا مسمّياتتٍ لها ولا حقائق ثابتة وهذا كقوله تعالى : { ما تعبدون من دونه إلا أسماء سميتموها } \\[ يوسف : 40 \\] .والقصر إضافي ، أي هي أسماء لا حقائق عاقِلة متصرفة كما تزعمون ، وليس القصر حقيقياً لأنّ لهاته الأصنام مسميات وهي الحجارة أو البيوت التي يقصدونها بالعبادة ويجعلون لها سدنة .وجملة { ما أنزل الله بها من سلطان } تعليل لمعنى القصر بطريقة الاكتفاء لأن كونها لا حقائق لها في عالم الشهادة أمر محسوس إذ ليست إلا حجارة .وأما كونها لا حقائق لها من عالم الغيب فلأن عالم الغيب لا طريق إلى إثبات ما يحتويه إلا بإعلام من عالم الغيب سبحانه ، أو بدليل العقل كدلالة العالم على وجود الصانع وبعض صفاته والله لم يخبر أحداً من رسله بأن للأصنام أرواحاً أو ملائكة ، مثل ما أخبر عن حقائق الملائكة والجن والشياطين .والسلطان : الحجة ، وإنزالها من الله : الإِخبار بها ، وهذا كناية عن انتفاء أن تكون عليها حجة لأن وجود الحجة يستلزم ظهورها ، فنفي إنزال الحجة بها من باب :على لاحب لا يهتدي بمناره ... أي لا منار له فيهتدى به .وعبر عن الإِخبار الموحَى به بفعل ( أنزل ( لأنه إخبار يَرد من العالم العلوي فشُبّه بإدلاء جسم من أعلى إلى أسفل .وكذلك عُبّر عن إقامة دلائل الوجود بالإِنزال لأن النظر الفكري من خلق الله فشبه بالإِنزال كقوله : { هو الذي أنزل السكينة في قلوب المؤمنين } \\[ الفتح : 4 \\] ، فاستعمال { ما أنزل الله بها من سلطان } من استعمال اللفظ في معنييه المجازيَيْن . وفي معنى هذه الآية قوله تعالى : { ويعبدون من دون اللَّه ما لم ينزل به سلطاناً وما ليس لهم به علم } في سورة الحج ( 71 ( ، وتقدم في سورة يوسف ( 40 ( قوله : { ما تعبدون من دونه إلا أسماء سميتموها أنتم وآباؤكم ما أنزل اللَّه بها من سلطان } وأكد نفي إنزال السلطان بحرف ( من ( الزائدة لتوكيد نفي الجنس .{ إِن يَتَّبِعُونَ إِلاَّ الظن وَمَا تَهْوَى الانفس وَلَقَدْ جَآءَهُم مِّن رَّبِّهِمُ الهُدَى } .هذا تحويل عن خطاب المشركين الذي كان ابتداؤه من أول السورة وهو من ضروب الالتفات ، وهو استئناف بياني فضمير { يتبعون } عائد إلى الذين كان الخطاب موجهاً إليهم .أعقب نفي أن تكون لهم حجة على الخصائص التي يزعمونها لأصنافهم أو على أن الله سماهم بتلك الأسماء بإثبات أنهم استندوا فيما يزعمونه إلى الأوهام وما تحبه نفوسهم من عبادة الأصنام ومحبة سدنتها ومواكب زيارتها ، وغرورهم بأنها تسعى في الوساطة لهم عند الله تعالى بما يرغبونه في حياتهم فتلك أوهام وأمانيَّ محبوبة لهم يعيشون في غرورها .وجيء بالمضارع في { يتبعون } للدلالة على أنهم سيسمرُّون على اتباع الظن وما تهواه نفوسهم وذلك يدل على أنهم اتبعوا ذلك من قبل بدلالة لحن الخطاب أو فحواه .وأصل الظن الاعتقاد غير الجازم ، ويطلق على العلم الجازم إذا كان متعلقاً بالمغيبات كما في قوله تعالى : { الذين يظنون أنهم ملاقوا ربهم } في سورة البقرة ( 46 ( ، وكثر إطلاقه في القرآن على الاعتقاد الباطل كقوله تعالى : { إن يتبعون إلا الظن وإن هم إلا يخرصون }في سورة الأنعام ( 116 ( ، ومنه قول النبي : إياكم والظن فإن الظن أكذب الحديث وهو المراد هنا بقرينة عطف وما تهوى الأنفس } عليه كما عطف { وإن هم إلا يخرصون } على نظيره في سورة الأنعام ، وهو كناية عن الخطأ باعتبار لزومه له غالباً كما قال تعالى : { يأيها الذين آمنوا اجتنبوا كثيراً من الظن إن بعض الظن إثم } \\[ الحجرات : 12 \\] .وهذا التفنن في معاني الظن في القرآن يشير إلى وجوب النظر في الأمر المظنون حتى يلحقه المسلم بما يناسبه من حُسن أو ذم على حسب الأدلة ، ولذلك استنبط علماؤنا أن الظن لا يغني في إثبات أصول الاعتقاد وأن الظن الصائب تناط به تفاريع الشريعة .والمراد ب { ما تهوى الأنفس } : ما لا باعث عليه إلا الميل الشهواني ، دون الأدلة فإن كان الشيء المحبوب قد دلت الأدلة على حقيقته فلا يزيده حُبه إلا قبولاً كما قال النبي صلى الله عليه وسلم « ورجلان تحابَّا في الله اجتمعا عليه وافترقا عليه ، ورجل قلبه معلق بالمساجد » وقال : « وجعلت قُرّة عيني في الصلاة » . فمناط الذم في هذه الآية هو قصر اتباعهم على ما تهواه أنفسهم .ثم إن للظن في المعاملات بين الناس والأخلاق النفسانية أحكاماً ومراتب غير ما له في الديانات أصولها وفروعها ، فمنه محمود ومنه مذموم ، كما قال تعالى : { إن بعض الظن إثم } وقيل : الحزم سوء الظن بالناس .والتعريف في { الأنفس } عوض عن المضاف إليه ، أي وما تهواه أنفسهم و { ما } موصولة .وعطف { وما تهوى الأنفس } على الظن عطف العلة على المعلول ، أي الظن الذي يبعثهم على إتباعه أنه موافق لهداهم وإلفهم .وجملة { ولقد جاءهم من ربهم الهدى } حالية مقررة للتعجيب من حالهم ، أي يستمرون على اتباع الظن والهوى في حال أن الله أرسل إليهم رسولاً بالهدى .ولام القسم لتأكيد الخبر للمبالغة فيما يتضمنه من التعجيب من حالهم كأن المخاطب يشك في أنه جاءهم ما فيه هدى مقنع لهم من جهة استمرارهم على ضلالهم استمراراً لا يظن مثله بعاقل .والتعبير عن الجلالة بعنوان { ربهم } لزيادة التعجيب من تصاممهم عن سماع الهدى مع أنه ممن تجب طاعته فكان ضلالهم مخلوطاً بالعصيان والتمرد على خالقهم .والتعريف في { الهدى } للدلالة على معنى الكمال ، أي الهدى الواضح .\n\n",
      "translations": [
        {
          "translation": "They are) i.e. al-Lat, al-'Uzza and Manat (but names) idols (which ye have named ye and your fathers) you have appointed them as deities; it is also said that this means: you and your forefathers have made them, (for which Allah hath revealed) regarding their worship or naming (no warrant) no Scripture wherein is found your proof. (They follow) they do not worship al-Lat, al-'Uzza and Manat or that which they call deities (but a guess) except through surmise and have no certainty about their worship (and that which (they) themselves desire) and they also worship them because they follow their own desires. (And now the guidance from their Lord) the explanation in the Qur'an that Allah has no son or partner (hath come unto them) to the people of Mecca.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَّآ أَنزَلَ ٱللَّهُ بِهَا مِن سُلْطَانٍ } معناه من حُجةٍ\n\n\n\n\nوقوله تعالى: { وَلَقَدْ جَآءَهُم مِّن رَّبِّهِمُ ٱلْهُدَىٰ } معناه البيانُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Allah has not sent down any authority with it\" [means that] it is not from a proof.\n\n\nAnd His Lord has certainly come to them with guidance.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { سميتموها } آلهة\n أو: سميتم بها هذه الأصنام\n واعتقدتم أنها آلهة\n بمقتضى أهوائكم الباطلة\n { أنتم وآباؤكم ما أنزل اللّهُ بها } بعبادتها { من سلطان } من حجة\n { إِن يتبعونَ } فيما ذكر من التسمية والعمل بموجبها { إلاَّ الظنَّ }: إلا توهم أنَّ ما هم عليه حق\n توهُّماً باطلاً\n { وما تهوى الأنفُسُ } أي: ما تشتهيه أنفسهم الأمّارة\n { ولقد جاءهم من ربهم الهدى } الرسول والكتاب فتركوه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:29",
      "similarity": 0.42437080043704434
    },
    {
      "verse": "2:145",
      "similarity": 0.4193272382984839
    },
    {
      "verse": "6:56",
      "similarity": 0.41727803313885914
    },
    {
      "verse": "28:50",
      "similarity": 0.3993758031612895
    },
    {
      "verse": "13:37",
      "similarity": 0.3848406587362469
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/053023.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/053023.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/53:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}