{
  "chapter": "النجم",
  "text": "ذلك مبلغهم من العلم ان ربك هو اعلم بمن ضل عن سبيله وهو اعلم بمن اهتدى",
  "translations": [
    {
      "translation": "That is as far as their knowledge extends. Your Lord knows best those who are misguided from His Way and He knows best those who are guided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the farthest limit of their knowledge. Surely your Lord alone knows best who has strayed away from the path and who has come to guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that being the utmost of their knowledge. Surely your Lord fully knows those who have strayed away from His Path and He also fully knows those who are rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is what the extent of their knowledge amounts to. Your Lord knows best who has gone astray from His path and who has been rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the extent of their knowledge; indeed your Lord well knows one who has strayed from His path, and He well knows one who has attained guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is what they could reach of knowledge. Verily, your Lord is He, Who knows best him who goes astray from His path, and He knows best him who receives guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is their goal of knowledge; surely your Lord knows best him who goes astray from His path and He knows best him who follows the right direction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is their attainment of knowledge. Surely thy Lord knows very well those who have gone astray from His way, and He knows very well those who are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is their sum of knowledge. Lo! thy Lord is Best Aware of him who strayeth, and He is Best Aware of him whom goeth right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the ultimate extent of their knowledge. Surely your Lord knows best those who stray from His path and He knows best those who follow His guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is their highest point of knowledge. Verily thine Lord! it is He Who is the Best Knower of him who strayeth from His way, and He is the Best Knower of him who letteth himself be guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the ultimate reach of their knowledge. Indeed your Lord knows best those who stray from His way, and He knows best those who are [rightly] guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is as far as knowledge will reach them. Verily thy Lord knoweth best those who stray from His Path, and He knoweth best those who receive guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is what they could reach of knowledge. Verily, your Lord it is He Who knows best him who goes astray from His Path, and He knows best him who receives guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is all they have of knowledge. Your Lord knows best who has strayed from His Path, and those who are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the extent of their knowledge. Your Lord knows best who has strayed from His path, and He knows best who has accepted guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is their sum of knowledge. Indeed, your Lord is most knowing of who strays from His way, and He is most knowing of who is guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[53:30] That, namely, the desire of this world, is the full extent of their knowledge, that is, the limit of their knowledge, namely, that they have preferred this life to [that of] the Hereafter. Truly your Lord knows best those who have strayed from His way, and He knows best those who are [rightly] guided: He has knowledge of both and will requite both.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nذَلِكَ مَبْلَغُهُمْ مِنَ الْعِلْمِ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَنْ ضَلَّ عَنْ سَبِيلِهِ وَهُوَ أَعْلَمُ بِمَنِ اهْتَدَى (30(مراعاة للفظ { مَن } ألا ترى قوله : { ذلك مبلغهم } بضمير الجمع .وجيء بالاسم الظاهر في مقام الإِضمار فقيل { فأعرض عن من تولى عن ذكرنا } دون : فأعرض عنهم لما تؤذن به صلة الموصول من علة الأمر بالإِعراض عنهم ومن ترتب توليهم عن ذكر الله على ما سبق وصفه من ضلالهم إذ لم يتقدم وصفهم بالتولّي عن الذكر وإنما تقدم وصف أسبابه .والذكر المضاف إلى ضمير الجلالة هو القرآن .ومعنى { ولم يرد إلا الحياة الدنيا } كناية عن عدم الإِيمان بالحياة الآخرة كما دل عليه قوله : { ذلك مبلغهم من العلم } لأنهم لو آمنوا بها على حقيقتها لأرادُوها ولو ببعض أعمالهم .وجملة { ذلك مبلغهم من العلم } اعتراض وهو استئناف بياني بيِّن به سبب جهلهم بوجود الحياة الآخرة لأنه لغرابته مما يسأل عنه السائل وفيه تحقير لهم وازدراء بهم بقصور معلوماتهم .وهذا الاستئناف وقع معترضاً بين الجمل وعلتها في قوله : { إن ربك هو أعلم بمن ضل عن سبيله } الآية .وأعني حاصل قوله : { ولم يرد إلا الحياة الدنيا } .وقوله : { ذلك } إشارة إلى المذكور في الكلام السابق من قوله : { ولم يرد إلا الحياة الدنيا } استعير للشيء الذي لم يعلموه اسم الحد الذي يبلغ إليه السائر فلا يعلم ما بعده من البلاد .{ إِنَّ رَبَّكَ هُوَ أَعْلَمُ بِمَن ضَلَّ عَن سَبِيلِهِ وَهُوَ أَعْلَمُ بِمَنِ اهْتَدَى } .تعليل لجملة { فأعرض عن من تولى } وهو تسلية للنبيء صلى الله عليه وسلم والخبر مستعمل في معنى أنه متولي حسابهم وجزائهم على طريقة الكناية ، وفيه وعيد للضالّين . والتوكيد المفاد ب { إنَّ } وبضمير الفصل راجع إلى المعنى الكنائي ، وأما كونه تعالى أعلم بذلك فلا مقتضى لتأكيدها لما كان المخاطب به النبي صلى الله عليه وسلم والمعنى : هو أعلم منك بحالهم .وضمير الفصل مفيد القصر وهو قصر حقيقي . والمعنى : أنت لا تعلم دخائلهم فلا تتحسر عليهم .وجملة { وهو أعلم بمن اهتدى } تتميم ، وفيه وعد للمؤمنين وبشارة للنبي صلى الله عليه وسلم والباء في ب { من ضل } وفي ب { من اهتدى } لتعدية صفتي { أعلم } وهي للملابسة ، أي هو أشد علماً ملابساً لمن ضل عن سبيله ، أي ملابساً لحال ضلاله ، وتقديم ذكر { من ضل } على ذكر { من اهتدى } لأن الضالّين أهمّ في هذا المقام ، وأما ذكر المهتدين فتتميمِ .\n\n",
      "translations": [
        {
          "translation": "(Such is their sum of knowledge) such is the extent at which their knowledge, intellect and opinion end, since they claimed that the angels are Allah's daughters and that there is no Hereafter. (Lo! thy Lord) Muhammad (is best aware of him who strayeth) from His religion, in reference here to Abu Jahl, (and He is best aware of him who goeth right) to His religion, in reference here to Abu Bakr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَلِكَ } الذي سمعت يا أكمل الرسل من ميلهم إلى الدنيا { مَبْلَغُهُمْ مِّنَ ٱلْعِلْمِ } اللذني الفائض لهم من حضرة العلم الإلهي\n فعليك يا أكمل الرسل أن تعرض عنهم وعن دعوتهم وإرشادهم\n بعدما أمرت به حسب العقل الفطري الموهوب لهم من المبدأ الفياض\n وبالغت في تبليغ المأمور\n\n\nوبالجملة: { إِنَّ رَبَّكَ } الذي رباك بكمال كرامته\n واصطفاط لرسالته ونيابته { عَن سَبِيلِهِ } بعلمه الحضوري { هُوَ أَعْلَمُ } وانحرف { بِمَن ضَلَّ } من عباده\n ومال عن جادة توحيده { وَهُوَ أَعْلَمُ } أيضاً { بِمَنِ ٱهْتَدَىٰ } [النجم: 30] منهم بهدايتك وإرشادك\n\n\n{ وَ } كيف لا يعلم سبحانه المضلين والمهتدين من عباده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك } أي: ما هم فيه من التولِّي\n وقصر الإرادة على الحياة الدنيا هو { مبلغُهم من العلم } أي: منتهى علمهم\n لا يكادون يُجاوزونه إلى غيره\n فلا تُجدي فيهم الدعوة والإرشاد شيئاً\n وجمع الضمير بعد أن أفرده باعتبار معنى \" مَن \" ولفظها\n والمراد بالعلم: مطلق الإدراك الشامل للظن الفاسد\n\n{ إِنَّ ربك هو أعلم بمَن ضلّ عن سبيله وهو أعلم بمَن اهتدى } أي: هو أعلم بالضال والمهتدي ومجازاتهما\n وهو تعليل الأمر بالإعراض\n وتكرير \" هو أعلم \" لزيادة التقرير\n وللإيذان بكمال تباين المعلومين\n أي: هو المبالغ في العلم بمَن لا يرعوي عن الضلال\n ومَن يَقبل الاهتداء في الجملة\n فلا تتعب نفسك في دعوتهم\n فإنهم من القبيل الأول\n الإشارة: شفاعة كل أحد على قدر جاهه وتمكُّنه من الله\n فقد يشفع الوليّ في أهل زمانه\n كما تقدّم في مريم\n والاعتقاد في الملائكة: أنهم أنوار لطيفة من تجليات الحق\n اللطافة فيهم أغلب\n لا يتصفون بذكورة ولا أنوثة\n يتشكلون كيف شاؤوا\n وقوله تعالى: { فأعْرِض عن من تولى عن ذكرنا\n\n\n } الآية\n فيه تحذير من مخالطة الغافلين والصحبة لهم\n فإنَّ صُحبتهم سُم قاتل\n والجلوس معهم تضييع وبطالة\n إلا أن يستولي نورُ مَن يصحبهم على ظلمتهم\n فيجرّهم إلى الله\n فهذا جلوسه معهم كمال\n وقال بعضهم: الوحدة أفضل من الجلوس مع العامة\n والجلوس مع الخاصة أفضل من العزلة\n إلا مَن تحقق كماله\n فلا كلام معه\n إشارة أخرى: { وكم من ملك\n\n\n } الخ\n أي: كثير من الأرواح الصافية السماوية لا تُغني شفاعتها في الأنفس الظلمانية الطبيعية\n لتنقلها من عالم الأشباح إلى عالم الأرواح\n إلا مِن بعد أنْ يأذن اللّهُ لمَن يشاء انتقاله وعروجه إلى سماء الأرواح\n ويرضى أن يُسكنه في الحضرة القدسية\n إن الذين لا يؤمنون بالحالة الآخرة\n هي الانتقال من عالم الأشباح إلى عالم الأرواح\n ويُنكرون على مَن يُوصل إليها\n لَيُسَمُّون الخواطر القلبية بتسمية الخواطر النفسانية\n أي: لا يُميِّزون بينهما\n لجهلهم بأحوال القلوب\n ما لهم به - أي: بهذا التمييز - من علم\n إن يتبعون في جُلّ اعتقاداتهم إلا الظن القوي\n وإنَّ الظن لا يُغني عن الحق شيئاً\n فلا ينفع مقام الإيمان إلا الجزم عن دليل وبرهان\n ولا في مقام الإحسان إلا شهود الحق بالعيان\n فمَن لم يحصل هذا فهو غافل عن ذكر الله الحقيقي\n يجب الإعراض عنه\n قال تعالى: { فأعْرِضْ عن من تولى عن ذكرنا ولم يُرد إلا الحياة الدنيا } وزخارفها\n ذلك مبلغهم من العلم\n يعلمون ظاهراً من الحياة الدنيا\n وهم عن الآخرة هم غافلون\n وقال اللجائي\n في قطبه: وإياك أن تكون دنياك إرادة قلبك تبعاً لشهوات نفسك\n أو تكون دنياك أحب إليك من آخرتك\n وقلبك من ذكر مولاك خالياً معرضاَ\n فإنها صفة الهالكين\n وإليه الإشارة بقوله تعالى: { فأعْرِض عن من تولى عن ذكرنا\n\n\n } الآية\n وقيل لأبي الحسن الشاذلي: يا سيدي\n بمَ فُقْتَ أهلَ عصرك\n ولم نرَ كل كبير عمل؟ فقال: بخصلة\n أمر الله بها نبيه صلى الله عليه وسلم\n وتمسكتُ بها أنا\n وهي الإعراض عنكم وعن دنياكم\n هـ\n إن ربك هو أعلم بمَن ضَلَّ عن طريق الوصول إليه\n وهو أعلم بمن اهتدى إليها\n فيُعينه\n ويجذبه إلى حضرته\n فإن الأمر كله بيده\n كما قال تعالى: { وَلِلَّهِ مَا فِي ٱلسَّمَاوَاتِ وَمَا فِي ٱلأَرْضِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:117",
      "similarity": 0.7488640164525666
    },
    {
      "verse": "68:7",
      "similarity": 0.7488640164525666
    },
    {
      "verse": "21:106",
      "similarity": 0.5052250095002534
    },
    {
      "verse": "36:17",
      "similarity": 0.49684058609544
    },
    {
      "verse": "16:82",
      "similarity": 0.47357651012496454
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/053030.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/053030.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/53:30.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}