{
  "chapter": "النجم",
  "text": "ام لم ينبا بما فى صحف موسى",
  "translations": [
    {
      "translation": "Or has he not been informed what is in the texts of Musa",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he not heard what is contained in the Book of Moses,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he not been informed of what is in the Scrolls of Moses,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not he been informed of the contents of the Book of Moses\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did not the news reach him, of that which is mentioned in the Books of Moosa?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or is he not informed with what is in the Suhuf of Musa,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, has he not been informed of what is in the scriptures of Musa?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or has he not been told of what is in the scrolls of Moses,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or hath he not had news of what is in the books of Moses\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he not been made acquainted with what was written in the scriptures of Moses?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath he not been told of that which is in the writs of Musa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he not been informed of what is in the scriptures of Moses,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, is he not acquainted with what is in the Books of Moses-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or is he not informed with what is in the Pages (Scripture) of Musa (Moses),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, has he not been told of that which is in the Scrolls of Moses\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or was he not informed of what is in the Scrolls of Moses?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or has he not been informed of what was in the scriptures of Moses\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[53:36] Or (am means bal) has he not been informed of what is in the scrolls of Moses, the books of the Torah, or scrolls before it,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَمْ لَمْ يُنَبَّأْ بِمَا فِي صُحُفِ مُوسَى (36({ أم } لإِضراب الانتقال إلى متعجَّب منه وإنكارٍ عليه آخَر وهو جهله بما عليه أن يعلمه الذين يخشون الله تعالى من عِلم ما جاء على ألسنة الرسل الأولين فإن كان هو لا يؤمن بمحمد صلى الله عليه وسلم فهلاّ تطلب ما أخبرت به رسل من قبلُ ، طالما ذكَر هو وقومه أسماءهم وشرائعهم في الجملة ، وطالما سأل هو وقومه أهل الكتاب عن أخبار موسى ، فهلاّ سأل عمّا جاء عنهم في هذا الغرض الذي يسعى إليه وهو طلب النجاة من عذاب الله فينبئه العالمون ، فإن مآثر شريعة إبراهيم مأثور بعضها عند العرب ، وشريعة موسى معلومة عند اليهود . فالاستفهام المقدر بعد { أم } إنكار مثل الاستفهام المذكور قبلها في قوله : { أعنده علم الغيب } والتقدير : بل ألم ينبأ بما في صحف موسى الخ .و { صحف موسى } : هي التوراة ، وصحف { إبراهيم } : صحفٌ سُجِّل فيها ما أوحَى الله إليه ، وهي المذكورة في سورة الأعلى ( 18 ، 19 ( { إن هذا لفي الصحف الأولى صحف إبراهيم وموسى } روى ابن حبّان والحاكم عن أبي ذر أنه سأل النبي عن الكتب التي أنزلت على الأنبياء فذكر له منها عشرة صحائف أنزلت على إبراهيم ، أي أنزل عليه ما هو مكتوب فيها .وإنما خص هذه الصحف بالذكر لأن العرب يعرفون إبراهيم وشريعته ويسمونها الحنيفية وربما ادّعى بعضهم أنه على إثارة منها مثل : زيد بن عَمرو بن نُفيل .وأما صحف موسى فهي مشتهرة عند أهل الكتاب ، والعربُ يخالطون اليهود في خيبر وقريظة والنضير وتَيما ، ويخالطون نصارى نجران ، وقد قال الله تعالى : { فلما جاءهم الحق من عندنا قالوا لولا أوتي مثلَ ما أُوتي موسى } \\[ القصص : 48 \\] .وتقديم { صحف موسى } لأنها اشتهرت بسعة ما فيها من الهدى والشريعة ، وأما صحف إبراهيم فكان المأثور منها أشياء قليلة . وقدّرت بعشر صحف ، أي مقدار عشر ورقات بالخط القديم ، تسَع الورقة قُرابة أربع آيات من آي القرآن بحيث يكون مجموع ملفي صحف إبراهيم مقدار أربعين أية .وإنما قدم في سورة الأعلى صحف إبراهيم على صحف موسى مراعاةً لوقوعهما بَدلاً من الصحف الأولى فقدم في الذكر أقدمهما .وعندي أن تأخير ذكر صحف إبراهيم ليقع ما بعدها هنا جامعاً لما احتوت عليه صحف إبراهيم فتكون صحف إبراهيم هي الكلمات التي ابتلَى الله بها إبراهيم المذكورةُ في قوله في سورة البقرة ( 124 ( : { وإذا ابتلى إبراهيم ربه بكلمات فأتمهن أي بلغهن إلى قومه ومن آمن به ، ويكون قوله هنا الذي وفى } في معنى قوله : { فأتمهن } في سورة البقرة ( 124 ( .ووصفُ إبراهيم بذلك تسجيل على المشركين بأن إبراهيم بلَّغ ما أوحي إليه إلى قومه وذريته ولكن العرب أهملوا ذلك واعتاضوا عن الحنيفية بالإِشراك .وحُذف متعلِّق وفى } ليشمل توفيات كثيرة منها ما في قوله تعالى : { وإذ ابتلى إبراهيم ربه بكلمات فأتمهن } وما في قوله تعالى :{ قد صدقت الرؤيا } \\[ الصافات : 105 \\] وقوله : { ألا تزر وازرة وزر أخرى } يجوز أن يكون بدلاً من ما في صحف موسى وإبراهيم بدلَ مفصَّل من مجمل ، فتكون ( أنْ ( مخففة من الثقيلة . والتقدير : أم لم ينبَّأ بأنه لا تزر وازرة وزر أخرى .ويجوز أن تكون ( أَن ( تفسيرية فَسَّرت ما في صحف موسى وإبراهيم لأن ما من الصحف شيء مكتوب والكتابة فيها معنى القَول دون حروفه فصلَح «ما في صحف موسى» لأن تفسره ( أنْ ( التفسيرية . وقد ذكر القرطبي عند تفسير قوله تعالى : { هذا نذير من النذر الأولى } \\[ النجم : 56 \\] في هذه السورة عن السدّي عن أبي صالح قال : هذه الحروف التي ذَكر الله تعالى من قوله : { أم لم ينبأ بما في صحف موسى وإبراهيم } إلى قوله : { هذا نذير من النذر الأولى } \\[ النجم : 56 \\] كل هذه في صحف إبراهيم وموسى\n\n",
      "translations": [
        {
          "translation": "(Or hath he not had news) has he not been informed in the Qur'an (of what is in the books of Moses) He says: in the Torah and the scrolls of Abraham.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "87:19",
      "similarity": 0.869324078272648
    },
    {
      "verse": "87:18",
      "similarity": 0.8507056688145511
    },
    {
      "verse": "80:13",
      "similarity": 0.8225878709939294
    },
    {
      "verse": "20:133",
      "similarity": 0.8078540402825007
    },
    {
      "verse": "81:10",
      "similarity": 0.734974219780058
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/053036.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/053036.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/53:36.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}