{
  "chapter": "النجم",
  "text": "الذين يجتنبون كبئر الاثم والفوحش الا اللمم ان ربك وسع المغفرة هو اعلم بكم اذ انشاكم من الارض واذ انتم اجنة فى بطون امهتكم فلا تزكوا۟ انفسكم هو اعلم بمن اتقى",
  "translations": [
    {
      "translation": "To whoever avoids the major wrong actions and indecencies - except for minor lapses - truly your Lord is vast in forgiveness. He has most knowledge of you when He first produced you from the earth, and when you were embryos in your mothers' wombs. So do not claim purity for yourselves. He knows best those who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who avoid the greater sins and shameful acts, except minor trespasses, your Lord's forgiveness surely has great amplitude. He is fully knowledgeable of you as He produced you from the earth, and since you were a foetus in your mother's womb. So do not assert your goodness; he is better who takes heed and preserves himself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on those who avoid grave sins and shameful deeds, even if they may sometimes stumble into lesser offences. Surely your Lord is abounding in His Forgiveness. Very well is He aware of you since He produced you from the earth, and while you were still in your mothers' wombs and not yet born. So do not boastfully claim yourselves to be purified. He fully knows those that are truly Godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who stay away from grave sins and indecency (should know that) for their trivial sins your Lord's forgiveness is vast. He knows best about you. When He created you from the earth and when you were embryos in your mother's wombs. Do not consider yourselves very great. God knows best who is the most righteous person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who avoid the cardinal sins and lewdness, except that they approached it and refrained; indeed your Lord’s mercy is limitless; He knows you very well – since He has created you from clay, and when you were foetuses in your mothers’ wombs; therefore do not, on your own, claim yourselves to be clean; He well knows who are the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who avoid great sins and Al-Fawahish (immoral sins) except Al-Lamam -- verily, your Lord is of vast forgiveness. He knows you well when He created you from the earth (Adam), and when you were fetuses in your mothers' wombs. So, ascribe not purity to yourselves. He knows best him who has Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who keep aloof from the great sins and the indecencies but the passing idea; surely your Lord is liberal in forgiving. He knows you best when He brings you forth from the earth and when you are embryos in the wombs of your mothers; therefore do not attribute purity to your souls; He knows him best who guards (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who avoid the heinous sins and indecencies, save lesser offences surely thy Lord is wide in His forgiveness. Very well He knows you, when He produced you from the earth, and when you were yet unborn in your mothers' wombs; therefore hold not yourselves purified; God knows very well him who is godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who avoid enormities of sin and abominations, save the unwilled offences - (for them) lo! thy Lord is of vast mercy. He is Best Aware of you (from the time) when He created you from the earth, and when ye were hidden in the bellies of your mothers. Therefor ascribe not purity unto yourselves. He is Best Aware of him who wardeth off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who refrain from committing grave sins and indecent acts, though they may commit minor offences, your Lord is unstinting in His forgiveness. He knows you when He brings you out of the earth, and when you were embryos in the wombs of your mothers; so do not make claims to be pure. He knows best who is truly righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those who avoid enormities of sin and abominations save the minor offences. Verily thy Lord is of vast for giveness: He is Best Knower of you when He produced you out Of the earth, and when ye were embryos in the bellies of your mothers. So justify not yourselves; He is the Best Knower of him who feareth Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who avoid major sins and indecencies, apart from [minor and occasional] lapses. Indeed your Lord is expansive in [His] forgiveness. He knows you best since [the time] He produced you from the earth and since you were foetuses in the bellies of your mothers. So do not flaunt your piety: He knows best those who are Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who avoid great sins and shameful deeds, only (falling into) small faults,- verily thy Lord is ample in forgiveness. He knows you well when He brings you out of the earth, And when ye are hidden in your mothers' wombs. Therefore justify not yourselves: He knows best who it is that guards against evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who avoid great sins (see the Quran, Verses: 6:152, 153) and Al-Fawahish (illegal sexual intercourse, etc.) except the small faults, verily, your Lord is of vast forgiveness. He knows you well when He created you from the earth (Adam), and when you were fetuses in your mothers' wombs. So ascribe not purity to yourselves. He knows best him who fears Allah and keep his duty to Him [i.e. those who are Al-Muttaqun (pious - see V. 2:2)].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who avoid the major sin and indecencies except the small sins, indeed your Lord is of immense forgiveness and He is more knowledgeable of you when He created you from the earth and when you were still unborn in your mothers' wombs. Do not praise yourself. Allah knows the cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who avoid gross sins and indecencies—except for minor lapses—your Lord is of Vast Forgiveness. He knows you well, ever since He created you from the earth, and ever since you were embryos in your mothers’ wombs. So do not acclaim your own virtue; He is fully aware of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who avoid the major sins and immoralities, only [committing] slight ones. Indeed, your Lord is vast in forgiveness. He was most knowing of you when He produced you from the earth and when you were fetuses in the wombs of your mothers. So do not claim yourselves to be pure; He is most knowing of who fears Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[53:32] Those who avoid grave sins and abominations, excepting lesser offences, that is, minor sins, such as a look, a kiss or a touch (this constitutes a discontinuous exception, in other words the meaning is: but lesser offences are forgiven by the avoidance of grave sins). Truly your Lord is of vast forgiveness, for such [lesser sins] and for accepting repentance. The following was revealed regarding those who used to say, ‘[What of] our prayers, our fasting, and our pilgrimage!’. He knows you best [from the time] when He produced you from the earth, that is to say, [when] He created your father Adam from dust, and when you were hidden [fetuses] (ajinna is the plural of janīn) in the bellies of your mothers. So do not claim purity for yourselves, do not praise yourselves, that is, in admiration; but [if it is done] in recognition of [God’s] grace, then that is fine. He knows best those who are God-fearing.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then showed their works in the life of the world, saying: (Those who avoid enormities of sin) i.e. idolatry and the major sins (and abominations) adultery and transgressions, (save the unwilled offences) except a furtive look, a taunt, a censure which they then blame themselves for committing and repent of doing; it is also said that this means: except marrying ((for them) lo! thy Lord is of vast mercy) towards he who repents of major and minor sins. (He is best aware of you) than your own selves (when He created you from the earth) He created you from Adam and Adam is from dust and dust is from the earth, (and when ye were) small (hidden in the bellies of your mothers) Allah knew in these circumstances what will ensue from you. (Therefore ascribe not purity unto yourselves) do not absolve yourselves from committing sins. (He is best aware of him who wardeth off (evil)) transgression and does good.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلَّذِينَ يَجْتَنِبُونَ كَبَائِرَ ٱلإِثْمِ وَٱلْفَوَاحِشَ إِلاَّ ٱللَّمَمَ } معناه أن يَلمَ بالذَّنبِ ثم يتوبَ منهُ\n\n\n\n\nوقوله تعالى: { وَإِذْ أَنتُمْ أَجِنَّةٌ فِي بُطُونِ أُمَّهَاتِكُمْ } معناه أولادٌ في بطونِهُنَّ\n واحدُها جَنينٌ\n\n\n\n\nوقوله تعالى: { فَلاَ تُزَكُّوۤاْ أَنفُسَكُمْ } معناه لا تُبرِّئوها\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {those who avoid the major sins and immoralities, except for the occasional lapse}, means that he should be remorseful for his sin and then repent from it.\n\n\nAnd the saying of Allah, \"And you were embryos in your mothers' wombs,\" means that you were children in their wombs.\n\n\nOne of them is a fetus.\n And His saying, {So do not purify yourselves}, its meaning is do not declare them pure.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوالمحسنون هم: { ٱلَّذِينَ يَجْتَنِبُونَ كَبَائِرَ ٱلإِثْمِ } أي: يحترزون عن الآثام الكبيرة\n المستجلبة لغضب الله\n المستتبعة لعذابه ونكاله في النشأة الأخرى\n المستلزمة للحدود والكفارات بحسب الشرع الشريف { وَٱلْفَوَاحِشَ } أي: يحفظون نفوسهم أيضاً عن الفواحش المسقطة للمروءات الجالبة لأنواع النكبات\n والوعيدات الهائلة الإلهية المقتضية للخلود في دركات النيران { إِلاَّ ٱللَّمَمَ } الطارئ عليهم من صغائر الذنوب هفوة\n فجبروه بالتوبة دفعة\n فإنه معفو عن مجتنبي الكبائر والفواحش\n قبل التوبة أيضاً\n\n\nوكيف لا يغفر سبحانه لأصحاب اللمم { إِنَّ رَبَّكَ } يا أكمل الرسل { وَاسِعُ ٱلْمَغْفِرَةِ } سريع العفو\n شامل الرحمة { هُوَ }  سبحانه { أَعْلَمُ بِكُمْ } منكم\n وبعموم أحوالكم وأطواركم أيها المجبولون على فطرة التكليف\n وكيف لا يعلم سبحانه أحوالكم! { إِذْ أَنشَأَكُمْ } وأظهركم { مِّنَ ٱلأَرْضِ } بمقتضى سعة علمه وجوده { وَإِذْ أَنتُمْ أَجِنَّةٌ } لا شعور لكم محبوسون { فِي بُطُونِ أُمَّهَاتِكُمْ } يعلم سبحانه منكم جميع أحوالكم\n وأطواركم وعمو حوائجكم الماضية والآتية\n وبالجملة: { فَلاَ تُزَكُّوۤاْ } ولا تنزهوا وتطهروا { أَنفُسَكُمْ } إذ لا علم لكم بتفاصيل أحوالكم وأعمالكم مطلقاً\n بل { هُوَ } سبحانه { أَعْلَمُ بِمَنِ ٱتَّقَىٰ } [النجم: 32] وحفظ نفسه عن مساخطه سبحانه\n واحترز عن منهياته\n\nثم قال سبحانه عبرة على المستبصرين وتوبيخاً على المستكبرين: { أَفَرَأَيْتَ } أيها المعتبر الرائي الطاغي { ٱلَّذِي تَوَلَّىٰ } [النجم: 33] وأعرض عن اتباع الحق\n وأصر على الباطل عناداً ومكابرةً\n بعدما وعد الحق التصدق من ماله كفارة لذنوبه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { الذين يجتنبون كبائِرَ الإثم }: بدل من الموصول الثاني\n أو: رفع على المدح\n أي: هم الذين يجتنبون\n والتعبير بالمضارع للدلالة على تجدُّد الاجتناب واستمراره\n وكبائر الإثم: ما يكبر عقابه من الذنوب\n وهو ما رتّب عليه الوعيد بخصوصه\n قال ابن عطية: وتحرير القول في الكبائر: إنها كل معصية يُوجد فيها حَدّ في الدنيا\n أو توعّد عليها بنار في الآخرة\n أو بلَعنةٍ ونحوها\n وقرأ الأخوان: كبير الإثم على إرادة الجنس\n أو الشرك\n { و } يجتنبون { الفواحشَ } وهو ما فَحُشَ من الكبائر\n كأنه قيل: يجتنبون الكبائر وما فحش منها خصوصاً\n فيحتمل أن يريد بالكبائر: ما فيه حق الله وحده\n والفواحش منها: ما فيه حق الله وحق عباده\n { إِلا اللممَ } أي: إلا ما قَلَّ وصَغُر\n فإنه مغفور لمَن يجتنب الكبائر\n وقيل: هي النظرة والغمزة والقُبلة\n وقيل: الخطرة من الذنب\n وقيل: كل ذنب لم يجعل الله فيه حَدّاً ولا عذاباً\n والاستثناء منقطع لأنه ليس من الكبائر ولا من الفواحش\n { إِنَّ ربك واسِعُ المغفرة } حيث يغفر الصغائر باجتناب الكبائر\n أو: حيث يغفر ما يشاء من الذنوب من غير توبة\n وهذا أحسن\n { هو أعلم بكم إِذا أنشأكم } في ضمن إنشاء أبيكم آدم عليه السلام { من الأرض } إنشاءً إجمالياً\n حسبما مرّ تحقيقه مراراً\n { وإِذا أنتم أَجِنةٌ } أي: يعلم وقت كونكم أجنّة { في بُطون أمهاتكم } على أطوار مختلفة\n لا يخفى عليه حالٌ مِن أحوالكم\n ولا عمل من أعمالكم\n { فلا تُزكُّوا أنفسكم } فلا تنسبوها إلى زكاء الأعمال\n وزيادة الخير والطاعات\n أو: إلى الزكاة والطهارة من المساوئ\n ولا تُثنوا عليها\n واهضموها\n فقد علم اللّهُ الزكيَّ منكم والتقِيّ\n قبل أن يُخرجكم من صُلب آدم\n وقبل أن تخرجوا من بطون أمهاتكم\n\nوقيل: كان ناس يعملون أعمالاً حسنة\n ثم يقولون: صلاتنا وصيامنا وحجّنا\n فنزلت\n وهذا إذا كان على سبيل الإعجاب أو الرياء\n لا على سبيل الاعتراف بالنعمة\n والتحدُّث بها\n فإنه جائز لأن المسرة بالطاعة طاعة\n وذكرها شكرها\n والأحسن في إيراد الاعتراف والشكر أن يُقدم ذكر نقصه\n فيقول مثلاً: كنا جُهالاً فعلَّمنا الله\n وكنا ضُلاَّلاً فهدانا الله\n وكنا غافلين فأيقظنا الله\n وهكذا نحن اليوم كذا وكذا\n قال ابن عطية: ويُحتمل أن يكون نهياً عن أن يُزَكِّي بعضُ الناس بعضاً\n وإذا كان هذا\n فإنما ينهى عن تزكية السَّمع\n أو القطع بالتزكية\n ومن ذلك الحديث في \" عثمان بن مظعون \" عند موته\n وأما تزكية القدوة أو الإمام\n أو أحداً\n ليؤتم به أو لِيَتَهَمَّمَ الناس بالخير\n فجائز\n وقد زكَّى رسولُ الله صلى الله عليه وسلم أبا بكر وغيره\n وكذلك تزكية الشهود في الحقوق جائزة؟ للضرورة إليها\n وأصل التزكية: التقوى\n والله تعالى أعلم بتقوى الناس منكم\n هـ\n وقال في القوت: هذه الذنوب تدخل على النفوس من معاني صفاتها\n وغرائز جبلاتها\n وأول إنشائها من نبات الأرض\n وتركيب الأطوار في الأرحام\n خَلْقٍ مِن بعد خلقٍ\n ومن اختلاط الامشاج بعضها مع بعض\n ولذلك عقبه بقوله: { هو أعلم بكم إذ أنشأكم\n\n\n } الآية\n هـ\n ثم قال تعالى: { هو أعلم بمن اتقى } فاكتفوا بعلمه عن علم الناس\n وبجزائه عن ثناء الناس\n وبالله التوفيق\n الإشارة: ولله ما في سموات الأرواح من أنوار الشهود\n وما في أرض النفوس من آداب العبودية\n رتَّب ذلك ليجزي الذين أساؤوا بوقوفهم مع أرض النفوس في العالم المحسوس\n ويجزي الذين آمنوا بترقيهم إلى مقام الإحسان\n بالحسنى\n وهي المعرفة\n حيث ترقّوا من أرض الأشباح إلى عالم سماء الأرواح\n\n وهم الذين يجتنبون كبائر الإثم وهو شهود وجودهم مع وجود الحق محبوبهم\n ووقوفهم مع عالم الحس\n والفواحش\n وهو اعتراضهم على الله فيما يبرز من عُنصر قدرته\n وتصغيرهم شيئاً مما عظَّم الله\n إلا اللمم خواطر تخطر ولا تثبت\n قال القشيري: كبائر الإثم ثلاث: محبة النفس الأمّارة\n ومحبة الهوى النافخ في نيران النفس\n ومحبة الدنيا\n التي هي رأس كل خطيئة\n ولكل واحدة من هذه الثلاث فاحشة لازمة لها\n أما فاحشة محبة النفس: فموافقة الطبيعة ومخالفة الشريعة\n وأما فاحشة محبة الهوى: فحُب الدنيا وشهواتها\n وأما فاحشة محبة الدنيا فالإعراض عن الله\n والإقبال على ما سواه\n وقوله { إلا اللمم } أي: الميل اليسير إلى الهوى والنفس والدنيا\n بحسب ضرورته البشرية مِن استراحة البدن\n ونيل قليل من حظوظ الدنيا\n بحسب الحقوق\n لا بحسب الحظوظ\n فإنَّ مباشر الحقوق مغفور\n ومباشر الحظوظ مغرور\n هـ\n { إِنَّ ربك واسعُ المغفرة } يستر العيوب\n ويُوصل إلى حضرة الغيوب\n هو أعلم بكم إذ أنشأكم من أرض البشرية\n ورقّاكم إلى عالم الروحانية\n وإذ أنتم أَجنة في أول بدايتكم في بطون أمهاتكم\n في بطون الهوى والغفلة\n ودائرة الكون\n فأخرجكم منها بمحض فضله\n فلا تُزكُّوا أنفسكم\n فتنظروا إليها بعين الرضا\n أو تنسبوا إليها شيئاً من الكمالات قبل صفائها\n قال القشيري: تزيكة المرء نفسه علامة كونه محجوباً لأنَّ المجذوب عن بقائه\n المستغرق في شهود ربِّه\n لا يُزكِّي نفسه\n هـ\n قلت: هذا ما دام في السير\n وأما إن حصل له الوصول فلا نفس له\n وإنما يُزكّي ربه إذا زكّاها\n هو أعلم بمَن اتقى ما سواه\n ثم ذكر وبال مَن زكى نفسه\n فقال: { أَفَرَأَيْتَ ٱلَّذِي تَوَلَّىٰ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:19",
      "similarity": 0.7582640459505869
    },
    {
      "verse": "42:37",
      "similarity": 0.23814337809774697
    },
    {
      "verse": "7:33",
      "similarity": 0.22734461576366707
    },
    {
      "verse": "2:268",
      "similarity": 0.17596807704991438
    },
    {
      "verse": "7:156",
      "similarity": 0.12793837540317393
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/053032.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/053032.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/53:32.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}