{
  "chapter": "النجم",
  "text": "اعنده علم الغيب فهو يرى",
  "translations": [
    {
      "translation": "Has he knowledge of the Unknown that he perceives everything?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does he have any knowledge of the world beyond the ken of sense-perception, and therefore, clearly sees (the Truth)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does he possess the knowledge of the unseen, thus, he sees (all things)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does he have knowledge of the hidden, so he can foresee?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is with him the knowledge of the Unseen so that he sees\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he the knowledge of the unseen so that he can see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does he possess the knowledge of the Unseen, and therefore he sees?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath he knowledge of the Unseen so that he seeth?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he knowledge of the unseen, so that he sees?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is with him knowledge of the unseen so that he seeth?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does he have the knowledge of the Unseen so that he sees?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Has he knowledge of the Unseen so that he can see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is with him the knowledge of the unseen so that he sees?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, does he possess knowledge of the Unseen, and can therefore see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does he possess knowledge of the unseen, and can therefore foresee?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does he have knowledge of the unseen, so he sees?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[53:35] Does he possess knowledge of the Unseen so that he sees?, [and therefore] from among such [knowledge] he is able to know that another person may bear the chastisement of the Hereafter for him? No! This was alWalīd b. al-Mughīra, or someone else (the sentence beginning with a-‘indahu, ‘does he possess’, is the second object of the a-ra’ayta, ‘have you seen’, which has the significance of ‘inform Me!’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hath he knowledge of the Unseen) the Guarded Tablet (so that he seeth) his doing in it that it is indeed as he did? This verse was revealed about 'Uthman Ibn 'Affan who was of the habit of spending a great deal on, and gives alms to, the Companions of the Prophet (pbuh) but then he met 'Abdullah Ibn Sa'd Ibn Abi Sarh. The latter said to him: \"I see that you spend a great deal on these, and I fear that you may be left with nothing\". 'Uthman said to him: \"I have faults and sins which I want to expiate and I also want to obtain Allah's good pleasure\". 'Abdullah said: \"Give me the halter of your camel and I will bear your sins and faults in this life and in the Hereafter\". As a result, he gave him the halter of his camel and confided himself to spending on him. It is because of this that this verse was revealed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nعيره سبحانه بقوله: { أَعِندَهُ عِلْمُ ٱلْغَيْبِ فَهُوَ يَرَىٰ } [النجم: 35] بأن التصدق وتحمل الغير وتضمنه يدفع عنه العذاب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أعنده علْمُ الغيبِ فهو يَرى } أي: يعلم هذا المغرور أنَّ له حق؟ { أم لم يُنَبَّأُ } يُخْبَر { بما في صُحف موسى } أي: التوراة، { وإِبراهيمَ } أي: وما في صحف إبراهيم { الذي وفَّى } أي: أكمل وأتمّ ما ابتلي به من الكلمات، أو: ما أُمر به، أو بالغ في الوفاء بما عاهد اللّهَ عليه\n وعن الحسن: ما أمره الله بشيء إلا وفّى به\n وعن عطاء بن السائب: عهد ألاَّ يسأل مخلوقاً، فلما قذف في النار قال له جبريل: ألك حاجة؟ فقال: أما إليك فلا\n وقال الشيخ المرسي: وفَى بمقتضى قوله: { حسبي الله } وعن النبي صلى الله عليه وسلم:\n\n \" وَفَّى عمله كل يوم بأربع ركعات في صدر النهار \" \n\nوهي صلاة الضحى\n وروي: \" ألا أخبركم لم سمّى خليلَه \" الذي وفَّى \" كان يقول إذا أصبح وإذا أمسى: { فسبحان الله حين تُمسون\n\n\n } إلى { تُظهرون } وقيل: وفَّى سهام الإسلام، وهي ثلاثون، عشرة في التوبة:\n\n[التوبة: 112] الخ، وعشرة في الأحزاب:\n\n[الأحزاب: 35] وعشرة في المؤمنين: { قد أفلح المؤمنون }\n وقيل: وفي حيث أسلم بدنه للنيران، وولده للقربان، وطعامه للضيفان\n ورُوي: أنه كان يوم يضيف ضيفاً، فإن وافقه أكرمه، وإلاَّ نوى الصوم، وتقديم موسى لأنَّ صحفه وهي التوراة أكثر وأشهر\n ثم فسّر ما في تلك الصُحف فقال: { ألاَّ تَزِرُ وَازرةٌ وِزْرَ أخرى } أي: أنه لا تحمل نفس وازرة وزر نفس أخرى، بل كل نفس تستقل بحمل وزرها، يقال: وزر يزر إذا اكتسب وِزراً، و \" أن \" مخففة، وكأنّ قائلاً قال: ما في صحف موسى وإبراهيم؟ فقال: ألاَّ تحمل نفس مثقلة بوزرها وِزرَ نفس أخرى\n { وأن ليس للإِنسان إِلا ما سَعَى } هو أيضاً مما في صحف موسى وإبراهيم، وهو بيان لعدم انتفاع الإنسان بعمل غيره، إثر بيان عدم انتفاعه من حيث رفع الضرر عنه به، وأما ما صحّ من الأخبار في الصدقة عن الميت والحج عنه، فلأنه لمَّا نواه عنه كان كالوكيل عنه، فهو نائب عنه\n\n\nقال ابن عطية: الجمهور أنّ قوله: { وأن ليس للإِنسان إِلا ما سعى } مُحْكَمٌ لا نسخ فيه، وهو لفظ عام مخصّص\n هـ يعني: أن المراد: الكافر، وهكذا استقرئ من لفظ \" الإنسان \" في القرآن، وأما المؤمن فجاءت نصوص تقتضي انتفاعه بعمل غيره، إذا وهب له من صدقة ودعاء وشفاعة واستغفار، ونحو ذلك، وإلاَّ لم يكن فائدة لمشروعية ذلك، فيتصور التخصيص في لفظ \" الإنسان \": وفي السعي، بأن يخص الإنسان بالكافر، أو السعي بالصلاة، ونحو ذلك مما لا يقبل النيابة مثلاً\n والحاصل: أن الإيمان سعي يستتبع الانتفاع بسعي الغير، بخلاف من ليس له الإيمان\n هـ قاله الفاسي: وكان عز الدين يحتج بهذه الآية في عدم وصول ثواب القراءة للميت، فلما مات رؤي في النوم، فقال: وجدنا الأمر خلاف ذلك\n قلت: أما في الأجور فيحصل الانتفاع بسعي الغير، إن نواه له، وأما في رفع الستور، وكشف الحجب، والترقي إلى مقام المقربين، فالآية صريحة فيه، لا تخصيص فيها إذ ليس للإنسان من حلاوة المشاهدة والقُرب إلا بقدر ما سعى من المجاهدة\n والله تعالى أعلم\n ثم قال: { وأنَّ سَعْيَه سوف يُرى } أي: يعرض عليه، ويكشف له يوم القيامة في صحيفته وميزانه، { ثم يُجزاه } أي: يجزى العبد سعيه، يقال: جزاه اللّهُ عملَه، وجزاه عليه، بحذف الجار وإيصال الفعل، ويجوز أن يكون الضمير للجزاء، ثم فسّره بقوله: { الجزاءَ الأوفى } أو: أبدله منه، أي: الجزاء الأكمل بحيث يزيده ولا ينقصه\n الإشارة: أفرأيتَ الذي تولى عن طريق السلوك، بعد أن أعطى نفسه وفلْسَه، وتوجه إلى حضرة مولاه، ثم منَّته نفسُه، وغرّته أنه يصل بلا عطاء ولا مجاهدة، فقطع ذلك واشتغل بنفسه، أو غرّه أحدٌ حتى ردَّه، وضمن له الوصول، بلا ذلك، أعنده عِلمُ الغيب حتى عَلِمَ أنه يصل بلا واسطة ولا مجاهدة؟ فهو يرى عاقبة ما هو سائر إليه\n وتصدُقُ الإشارة بمن صَحِبَ شيخاً، وأعطاء بعض ماله أو نفسه، ثم رجع ومال إلى غيره، فلا يأتي منه شيء، أعنده علم الغيب، وأنّ فتحه على يد ذلك الشخصن فهو يرى ما فيه صلاح وفساده؟ وهذا إن كان شيخه أهلاً للتربية، وإلاَّ فلا\n أم لم يُنبأ هذا المنقطِع بما في صُحف موسى وإبراهيم، أنه لا يتحمّل أحدٌ عن أحدٍ مجاهدة النفوس ورياضتها؟ وأن ليس للإنسان من لذة الشهود والعيان إلا ما سعى فيه بالمجاهدة، وبذل النفس والفلس، وأنَّ سعيه سوف يُرى؟ أي: يَظهر أثره من الأخلاق الحسنة، والرزانة والطمأنينة، وبهجة المحبين، وسيما العارفين\n وقسَّم القشيري السعي على أربعة أقسام: الأول: السعي في تزكية النفس وتطهيرها، ونتيجته: النهوض للعمل الصالح، الذي يستوجب صاحبه نعيمَ الجنان\n الثاني: السعي في تصفية القلب من صَداء ظلمات البشرية، وغطاء عورات الطبيعية، ونتيجته: صحته من الأمراض القلبية، كحب الدنيا والرئاسة والحسد، وغير ذلك، ليتهيأ لدخول الواردات الإلهية\n الثالث: السعي في تزكية الروح، بمنعها من طلب الحظوظ الروحانية، كطلب الكرامات، والوقوف مع المقامات، وحلاوة المعاملات، لتتهيأ بذلك للاستشراف على مقام المشاهدات، وحمل أعباء أسرار الذات\n الرابع: السعي في تزكية السر بتحليته بالصفات الإلهية، والأخلاق الربانية ليتحقق بمقام الفناء والبقاء، وهو منتهى السعي وكماله\n هـ\n بالمعنى\n وإلى هذا الأنتهاء أشار تعالى بقوله: { وَأَنَّ إِلَىٰ رَبِّكَ ٱلْمُنتَهَىٰ }\n\n",
      "translations": []
    }
  ]
}