{
  "chapter": "النجم",
  "text": "اعنده علم الغيب فهو يرى",
  "translations": [
    {
      "translation": "Does he have knowledge of the Unseen, enabling him to see?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he knowledge of the Unknown that he perceives everything?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does he have any knowledge of the world beyond the ken of sense-perception, and therefore, clearly sees (the Truth)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does he possess the knowledge of the unseen, thus, he sees (all things)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does he have knowledge of the hidden, so he can foresee?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is with him the knowledge of the Unseen so that he sees\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he the knowledge of the unseen so that he can see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does he possess the knowledge of the Unseen, and therefore he sees?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath he knowledge of the Unseen so that he seeth?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has he knowledge of the unseen, so that he sees?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is with him knowledge of the unseen so that he seeth?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does he have the knowledge of the Unseen so that he sees?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Has he knowledge of the Unseen so that he can see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is with him the knowledge of the unseen so that he sees?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, does he possess knowledge of the Unseen, and can therefore see?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does he possess knowledge of the unseen, and can therefore foresee?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does he have knowledge of the unseen, so he sees?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[53:35] Does he possess knowledge of the Unseen so that he sees?, [and therefore] from among such [knowledge] he is able to know that another person may bear the chastisement of the Hereafter for him? No! This was alWalīd b. al-Mughīra, or someone else (the sentence beginning with a-‘indahu, ‘does he possess’, is the second object of the a-ra’ayta, ‘have you seen’, which has the significance of ‘inform Me!’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَعِنْدَهُ عِلْمُ الْغَيْبِ فَهُوَ يَرَى (35(والاستفهام في ( أعنده علم الغيب ( إنكاري على توهمه أن استئجار أحد ليتحمل عنه عذاب الله ينجيه من العذاب أي ما عنده علم الغيب . وهذا الخبر كناية عن خطئه فيما توهمهوالجملة استئناف بياني للاستفهام التعجيبي من قوله ( أفرأيت الذي تولى ( الخوتقديم ( عنده ( وهو مسند على ( علم الغيب ( وهو مسند إليه للاهتمام بهذه العندية العجيب ادعاؤها والإشارة إلى بعده عن هذه المنزلةوعلم الغيب : معرفة العوالم المغيبة أي العلم لاصل من أدلة فكأنه شاهد الغيب بقرينة قوله ( فهو يرى (وفرع على هذا التعجيب قوله ( فهو يرى ( أي فهو يشاهد أمور الغيب بحيث عاقد على التعارض في حقوقها . والرؤية في قوله ( فهو يرى ( بصرية ومفعولها محذوف والتقدير : فهو يرى الغيبوالمعنى : أنه آمن نفسه من تبعة التولي عن الإسلام ببذل شيء لمن تحمل عنه تبعة توليه كأنه يعلم الغيب ويشاهد أن ذلك يدفع عنه العقاب فقد كان فعله ضغثا على إبالة لأنه ظن أن التولي جريمة وما بذل المال إلا لأنه توهم أن الجرائم تقبل الحمالة في الآخرةوتقديم الضمير المسند إليه على فعله المسند دون أن يقول : فيرى لإفادة تقوي الحكم نحو : هو يعطي الجزيل . وهذا التقوي بناء على ما أظهر من اليقين بالصفقة التي عاقد عليها وهو أدخل في التعجيب من حاله\n\n",
      "translations": [
        {
          "translation": "(Hath he knowledge of the Unseen) the Guarded Tablet (so that he seeth) his doing in it that it is indeed as he did? This verse was revealed about 'Uthman Ibn 'Affan who was of the habit of spending a great deal on, and gives alms to, the Companions of the Prophet (pbuh) but then he met 'Abdullah Ibn Sa'd Ibn Abi Sarh. The latter said to him: \"I see that you spend a great deal on these, and I fear that you may be left with nothing\". 'Uthman said to him: \"I have faults and sins which I want to expiate and I also want to obtain Allah's good pleasure\". 'Abdullah said: \"Give me the halter of your camel and I will bear your sins and faults in this life and in the Hereafter\". As a result, he gave him the halter of his camel and confided himself to spending on him. It is because of this that this verse was revealed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nعيره سبحانه بقوله: { أَعِندَهُ عِلْمُ ٱلْغَيْبِ فَهُوَ يَرَىٰ } [النجم: 35] بأن التصدق وتحمل الغير وتضمنه يدفع عنه العذاب\n\n\n{ أَمْ لَمْ يُنَبَّأْ } ولم يخبر { بِمَا فِي صُحُفِ مُوسَىٰ } [النجم: 36] وهي ألواح التوراة المنصوصة فيه بخلاف ذلك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "52:41",
      "similarity": 0.7121968796574676
    },
    {
      "verse": "68:47",
      "similarity": 0.7121968796574676
    },
    {
      "verse": "82:16",
      "similarity": 0.6727014788972039
    },
    {
      "verse": "59:22",
      "similarity": 0.5832228585546296
    },
    {
      "verse": "49:18",
      "similarity": 0.5610261532831009
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/053035.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/053035.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/53:35.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}