{
  "chapter": "النجم",
  "text": "وانه هو اضحك وابكى",
  "translations": [
    {
      "translation": "that it is He Who brings about both laughter and tears;",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That it is He who makes you happy and morose,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that He it is Who causes people to laugh and to cry,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who causes laughter and weeping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that it is He Who made (you) laugh and made (you) cry?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that it is He Who makes laugh, and makes weep.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He it is Who makes (men) laugh and makes (them) weep;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that it is He who makes to laugh, and that makes to weep,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He it is who maketh laugh, and maketh weep,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that it is He who brings laughter and tears;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that it is He Who causeth to laugh and causeth to weep.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that it is He who makes [men] laugh, and weep,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That it is He Who granteth Laughter and Tears;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that it is He (Allah) Who makes (whom He wills) laugh, and makes (whom He wills) weep;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that it is He who causes to laugh and causes to weep.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that it is He who causes laughter and weeping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that it is He who makes [one] laugh and weep\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[53:43] and that it is He Who makes to laugh, whomever He will He makes joyous, and makes to weep, whomever He will He makes him sorrowful,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And that He it is Who maketh laugh) the people of the Garden when they see what pleases them in terms of the honour that is bestowed upon them, (and maketh weep) the people of the Fire when they see what grieves them in terms of humiliation,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَنَّهُ هُوَ أَضْحَكَ } من أضحك { وَأَبْكَىٰ } [النجم: 43] من أبكى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nأي: كُنه الذات، وسيأتي في الإشارة: { وأنه هو أضحكَ وأبكى } أي: خلق الضحك والبكاء، أو: خلق الفرح والحزن، أو: أضحك المؤمنين في الأخرة، وأبكى الكافرين، أو: أضحك المؤمنين في العُقبى بالمواهب وأبكاهم في الدنيا بالنوائب، { وأنه هو أمات وأحيا } أي: أمات الآباء وأحياء الأبناء، أو: أمات بالكفر وأحيا بالإيمان\n { وأنه خلق الزوجين الذكرَ والأنثى من نُطفةٍ إذا تُمنَى }: إذ تدفق وتُدفع في الرحم\n يقال: منى وأمنى، { وأنَّ عليه النشأةَ الأخرى } الإحياء بعد الموت، { وأنه هو أغنَى } أي: صيّر الفقير غنيّاً { وأَقْنَى } أي: أَعطى القِنْيَة، وهو المال الذي تأثّلته، وعزمت ألاَّ تُخرجه من يدك\n { وأنه هو رَبُّ الشِّعْرى } وهو كوكب يطلع بعد الجوزاء في شدة الحر، وكانت خزاعة تعبدها\n سنّ لهم ذلك \" ابن أبي كبشة \" رجل من أشرافهم، قال: لأن النجوم تقطع السماء عرضاً، والشعرى طولاً، ويقال لها: شعرى العبور\n انظر الثعلبي\n وكانت قريش تقول لرسول الله صلى الله عليه وسلم: ابن أبي كبشة، تشبيهاً له صلى الله عليه وسلم به، لمخالفته إياهم في دينهم، فأخبر تعالى أنه ربّ معبودهم، فهو أحق بالعبادة وحده\n { وأنه أهلك عاداً الأُولى } وهم قوم هود، وعاد الأخرى: عاد إرم، وقيل: معنى الأولى العدمي لأنهم أولى الأمم هلاكاً بعد قوم نوح، وقال الطبري وغيره: سميت \" أُولى \" لأن ثُمَّ عاداً آخرة، وهي قبلية كانت بمكة مع العماليق، وهم بنو لُقَيم بن هَزّال\n والله أعلم\n هـ\n { قلت }: والتحقيق: أن عاداً الأولى هي عاد إرم، وهي قبيلة هود التي هلكت بالريح، ثم بقيت منهم بقايا، فكثروا وعمّروا بعدهم، فقيل لهم عاد الأخيرة، وانظر أبا السعود في سورة الفجر\n وها هنا قراءات، وجَّهناها في كتاب الدرر\n { وثَموداً } أي: وأهلك ثموداً، وهم قوم صالح، { فما أبقَى } أحداً منهم، { وقمَ نوحٍ من قبلُ } وأهلك قوم نوح من قبل عاد وثمود، { إِنهم كانوا أظلمَ وأطغى } مِن عاد وثمود لأنهم كانوا يضربونه حتى لا يكون به حِراك، وينفرون منه حتى كانوا يُحذّرون صبيانهم أن يسمعوا منه، { والمؤتفكةَ } أي: والقرى التي ائتفكت، أي: انقلبت بأهلها، وهم قوم لوط\n يقال: أَفَكه فائتفك، أي: قَلَبَه فانقلب، { والمؤتفكة } منصوب بـ { أَهْوَى } أي: رفعها إلى السماء على جناح جبريل، ثم أهواها إلى الأرض، أي: أسقطها، { فَغَشَّاها } ألبسها من فنون العذاب { ما غَشَّى } وفيه تهويل لما صبَّ عليها من العذاب، وأمطر عليها من الصخر المنضود\n\n\n{ فبأي آلاءِ ربك } أيها المخاطب { تتمارَى } أي: تتشكك؟ أي: فبأي نِعَمٍ من نِعَم مولاك تجحد ولا تشكر؟ فكم أولاك من النِعم، ودفع عنك من النِقم، وتسمية الأمور المتعددة قبلُ نِعماً مع أن بعضها نقم لأنها أيضاً نِعَم من حيث إنها نصرة الأنبياء والمرسَلين، وعظة وعبرة للمعتبرين\n { هذا نذيرٌ } أي: محمد مُنذِّر { من النُذُرِ الأولى } من المنذِّرين الأولين، وقال: \" الأُولى \" على تأويل الجماعة، أو: هذا القرآن نذير من النذر الأولى، أي: إنذار من جنس الإنذارات الأولى التي إنذِر بها من قبلكم\n { أَزِفَتِ الآزفةُ } أي: قربت الساعة الموصوفة بالقرب من قوله:\n\n[القمر: 1]، وفي ذكرها بعد إنذارهم إشعار بأنَّ تعذيبهم مؤخر إلى يوم القيامة، { ليس لها من دون الله كاشِفةٌ } أي: ليس لها نَفْس مبيّنة وقت قيامها إلاّ الله تعالى، وهذا كقوله:\n\n[الأعراف: 187] أو: ليس لها نفس قادرة على كشف أهوالها إذا وقعت إلا الله تعالى، فيكشفها عمن شاء، ويُعذِّب بها مَن شاء\n ولمَّا استهزؤوا بالقرآن، الناطق بأهوال القيامة، نزل قوله تعالى: { أفمن هذا الحديث تعجبون } إنكاراً، { وتضحكون } استهزاءً، { ولا تبكون } خشوعاً، { وأنتم سامدون } غافلون، أو: لاهون لاعبون، وكانوا إذا سمعوا القرآن عارضوه بالغناء، ليشغلوا الناس عن استماعه، { فاسجدوا لله واعبدوا } ولا تعبدوا معه غيره، من اللات والعزى ومناة والشعْرَى، وغيرها من الأصنام، أي: اعبدوا رب الأرباب، وسارعوا له، رجاء في رحمته\n والفاء لترتيب الأمر بالسجود على بطلان مقابلة القرآن بالإنكار والاستهزاء، ووجوب تلقيه بالإيمان والخضوع والخشوع، أي: إذا كان الأمر كذلك فساجدوا لله الذي أنزله واعبدوه\n الإشارة: { وأنَّ إلى ربك المنتهى } انتهى سير السائرين إلى الوصول إلى الله، والعكوف في حضرته\n ومعنى في حضرته\n ومعنى الوصول إلى الله: العلم بأحدية وجوده، فيمتحي وجود العبد في وجود الرب، وتضمحل الكائنات في وجود المكوِّن، فتسقط شفيعة الأثر، وتثبت وترية المؤثِّر، كما قال القائل:\n\nوقال الآخر:\n\nإلى غير ذلك مما غَنَّوا به من أذواقهم ووجدانهم\n ثم قال تعالى: { وأنه هو أضحك وأبكى } أي: قبض وبسط، أو: أنه أضحك أرواحاً بكشف الحجاب، وأبكى نفوساً بذُل الحجاب، أو: أضحك إذا تجلّى بصف الجمال، وأبكى إذا تجلّى بصفة الجلال، وأنه هو أمات قلوباً بالجهل والغفلة، بمقتضى اسمه القهّار، وأحيا قلوباً بالعلم والمعرفة، بمقتضى اسمه الغفّار، أو: أمات نفوساً عن شهواتها الفانية، وأحيا سبب ذلك أرواحاً بكمال المعرفة فاتصفت بالأوصاف الربانية، أو: أمات أرواحاً بغلبة ظلمة النفس واتسيلائها عليها، وأحيا نفوساً باستيلاء الأرواح عليها، وغلبة ونورها، فحييت وانقلبت روحاً\n\n\nوأنه خلق الزوجين، أي: الصنفين: الذكر والأنثى، الحس والمعنى، الحقيقية والشريعة، القدرة والحكمة، كما تقدم\n وقال القشيري: الروح كأنه ذَكَر موصوفة بصفة الفاعلية، والنفْس أنثى موصوفة بصفة القابلية، لتحصل نتيجة القلب، بحصول المطالب الدنيوية والأخروية\n هـ\n مختصراً\n وقال بعضهم: والشيطان كالذَكَر، والنفس كالأنثى، يتولّد بينهما المعصية\n هـ\n { وأنَّ عليه النشأة الأخرى } وهو بعث الأرواح من موت الغفلة، وحشرها إلى موقف المراقبة والمحاسبة، ثم إدخالها جنة المعارف، فلا تتشاق إلى جنة الزخارف أبداً، أو: { النشأة الأخرى }: الجذب بعد السلوك، والفناء بعد البقاء، ثم البقاء بعد الفناء، البقاء الأول بوجود النفس، والثاني بالله\n وأنه هو أغنى به بوصول العبد إلى مشاهدته، وأفنَى بأن مكَّنه منه فزاد غناه\n وطبّل على ماله، { وأنه هو رَبُّ الشِّعرى } ، وهو كل ما عُبد من الهوى والدنيا، فكيف يعبد المربوب اللئيم، ويترك الرب الكريم؟! وأنه أهلك عاداً الأولى النفوس المتفرعنة، والأهوية المُغوية، أرسل عليهم ريحَ الهداية القوية، حتى اضمحلت وخضعت لمولاها، وثمودَ الخواطر، فما أبقى منها إلا خواطر الخير، التي تأمر بالخير، وقوم نوح من القواطع الأربعة: النفس، والشيطان، والناس، والدنيا، فطعنهم عن المتوجه من قَبلُ، أي: مِن قبل أن يتوجه إلينا، لِما سبق في علمنا أنهم كانوا هم أظلم وأطغى من بقية العلائق، والنفس المؤتفكة، أي: المنقلبة عن التوجُّه، أهوى بها في أسفل سافلين، باعتبار أهل عليين، فغشَّاها من الدنيا ومن الخواطر والهموم والغموم، ما غشَّى\n فإذا سَلِمتَ أيها العبد من هؤلاء القواطع والعلائق، وتوجهتَ إلى مولاك، { فبأي آلاء ربك تتمارى؟ } بل الواجب عليك أن تشكر الله آناء الليل والنهار\n هذا الذي أخذ بيدك نذيرٌ من النُذُر الأولى، المتقدمين الداعين إلى الله في كل زمان، أزفت الآزفة، أي: قربت ساعة الفتح حين توجهت وانقطعت عنك العلائق، ووجدتَ مَن يُدخلك بحرَ الحقائق، ليس لها من دون الله كاشفة، لا يكشف لك هذه الحقائق إلا الذي منَّ عليك بصحبة مَن يدلك عليه\n قال القشيري: أزفت الآزفة: قَرُبَت الحقيقة بالقرب والدنو، وأنت أيها السالك في عينها، وما لك بها شعور، لفنائك في أوصافك النفسانية، هـ مختصراً\n أفمن هذا الحديث العجيب، والغزل الرقيق الغريب، تعجبون، إنكاراً، وتضحكون استهزاءً؟ قلت: وقد رأيت كثيراً ممن يُنكر الإشارة، ويستهزئ بها، ويتنكّب مطالعتها، وقد قيل: مَن كَرِهَ شيئاً عاداه\n ولا تبكون على أنفسكم، حيث حُرمتْ من هذه المواهب، وأنتم سامدون غافلون لاهون، للدنيا طالبون، فاسجدوا لله واعبدوا، وتضرّعوا إليه، حتى يُخرجكم من سجن هواكم ونفوسكم\n وبالله التوفيق، وهو الهادي إلى سواء الطريق، وصلّى الله عليه سيدنا محمد وآله وصحبه وسلّم\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "53:60",
      "similarity": 0.9959058047673877
    },
    {
      "verse": "9:82",
      "similarity": 0.9076107594543072
    },
    {
      "verse": "44:29",
      "similarity": 0.708067093551188
    },
    {
      "verse": "12:16",
      "similarity": 0.605958694791646
    },
    {
      "verse": "83:34",
      "similarity": 0.5681432863113212
    }
  ]
}