{
  "chapter": "النجم",
  "text": "ذو مرة فاستوى",
  "translations": [
    {
      "translation": "Lord of power and wisdom. So he acquired poise and balance,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "one endowed with immense wisdom. He came forth and stood poised,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "by the great mighty one (Gabriel),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Strong; then the Spectacle inclined towards him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Dhu Mirrah then he Istawa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord of Strength; so he attained completion,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "very strong; he stood poised,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One vigorous; and he grew clear to view\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and endowed with wisdom; who in time manifested himself;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One strong of make. Then he stood straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "possessed of sound judgement. He settled,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Endued with Wisdom: for he appeared (in stately form);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Dhu Mirrah (free from any defect in body and mind), Fastawa [then he (Jibrael - Gabriel) rose and became stable]. [Tafsir At-Tabari].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of might, he (Gabriel) stood firm\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The one of vigor. He settled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One of soundness. And he rose to [his] true form\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[53:6] possessed of vigour, of strength and might (or [alternatively it, dhū mirratin, means] possessed of a beautiful appearance), namely, Gabriel, peace be upon him; and he stood upright, he settled,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(One vigorous) one strong; it is also said this means: one mighty, for his strength was such that he put his hand under the townships of Lot and pulled them out, raised them to the sky and threw them upside down to the ground. His strength was also such that he seized the sides of the gate of Antioch and cried one cry that killed all the living creatures in it. It is also said that his strength was such that he spread one of his feathers on a hill in Jerusalem and struck with it Iblis who was at the farthest corner of India; (and he grew clear to view) Gabriel appeared in the form in which Allah created it him; and it is also said: he appeared in a beautiful form.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ذُو مِرَّةٍ فَٱسْتَوَىٰ } معناه قوةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nهو سبحانه { ذُو مِرَّةٍ } قوة وقدرة ذاتية محيطة لعموم ما ظهر وبطن من المظاهر، وبعد تعليم الحق إياه صلى الله عليه وسلم وتقويته وتأييده { فَٱسْتَوَىٰ } [النجم: 6] تمكن واعتدل صلى الله عليه وسلم على صراط العدالة، وتمكن على مرتبة الخلافة والنيابة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذو مِرَّةٍ } أي: ذو خصابة في عقله، ورزانة ومتانة في دينه\n وأصل المِرة: الشدّة، من مراير الحبل، وهو فتله فتلاً شديداً، أو: ذو حُسن في منظره، { فاستوى }: عطفٌ على \" علَّمه \" بطريق التفسير، فإنه إلى قوله: { ما أوحى } بيان لكيفية التعليم، أو: فاستقام على صورته التي خلقه الله عليها، دون الصورة التي كان يتمثّل بها كلما هبط بالوحي، وذلك أنّ رسول الله صلى الله عليه وسلم أحبّ أن يراه في الصورة التي خلقه اللّهُ عليها، وكان صلى الله عليه وسلم بحراء، فطلع له جبريلُ من المشرق، وسدّ الأرض من المغرب، وملأ الأفق، فخرَّ رسولُ الله صلى الله عليه وسلم، فنزل في صورة الأدمي، فضمّه إلى نفسه، وجعل يمسح الغبار عن وجهه\n\n\nقيل: ما رآه أحد من الأنبياء في صورته الأصلية إلا النبي صلى الله عليه وسلم فإنه رآه فيها مرتين مرة في الأرض، ومرة في السماء، وقيل: استوى بقوته على ما جعل له من الأمر",
      "translations": []
    }
  ]
}