{
  "chapter": "القمر",
  "text": "اقتربت الساعة وانشق القمر",
  "translations": [
    {
      "translation": "The Hour has drawn near and the moon has split.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "THE HOUR HAS come and split is the moon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour of Resurrection drew near and the moon split asunder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour of Doom is drawing near and the moon is rent asunder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Last Day came near, and the moon split apart.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour has drawn near, and the moon has been cleft asunder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hour drew nigh and the moon did rend asunder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour has drawn nigh: the moon is split.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The hour drew nigh and the moon was rent in twain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Last Hour draws near and the moon is split asunder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour hath drawn nigh, and the moon hath been rent in sunder.. And if they behold a sign, they turn away and say: magic continuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour has drawn near and the moon is split.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour (of Judgment) is nigh, and the moon is cleft asunder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour has drawn near, and the moon has been cleft asunder (the people of Makkah requested Prophet Muhammad SAW to show them a miracle, so he showed them the splitting of the moon).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour is drawing near, and the moon is split (in two).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour has drawn near, and the moon has split.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Hour has come near, and the moon has split [in two].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[54:1] The Hour has drawn near, the Resurrection is close at hand, and the moon has split, it broke in two at [Mount] Abū Qubays and Qu‘ayqa‘ān, as a sign for the Prophet (s), for it had been demanded of him, and [when it took place] he said, ‘Bear witness [now]!’ — as reported by the two Shaykhs [al-Bukhārī and Muslim].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said in the interpretation of Allah's saying (The hour drew nigh): '(The hour drew nigh) He says: the coming of the Hour drew nigh by the advent of Muhammad (pbuh) and the coming down of the smock (and the moon was rent in twain) this is also another sign of the closeness of the Day of Judgement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السّائب عن أبي خالد الواسطي، عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { ٱقْتَرَبَتِ ٱلسَّاعَةُ وَٱنشَقَّ ٱلْقَمَرُ } قال: فانشقَّ القَمرُ على عَهدِ النَّبي صلى الله عليه وآلهِ وسلمَ حتّى صارَ فِرقتينَ والنَّاسُ ينظرونَ\n فقالتْ اليَهودُ سُحرَ القَمرُ\n فأنزلَ الله تعالى: { ٱقْتَرَبَتِ ٱلسَّاعَةُ وَٱنشَقَّ ٱلْقَمَرُ وَإِن يَرَوْاْ آيَةً يُعْرِضُواْ وَيَقُولُواْ سِحْرٌ مُّسْتَمِرٌّ } والمُستمرُ: الشَّديدُ\n ويقال: يَشبهُ بعضُهُ بعضاً\n ويقال: الذَّاهبُ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\nHe said: Ali ibn Ahmad narrated to us\n\n\nIt was narrated that Zayd ibn Ali said, regarding the words of Allah, {The Hour has drawn near, and the moon has split}: \"The moon split during the lifetime of the Prophet (peace be upon him), until there were two pieces, and people were looking on.\"\n\n\nThe Jews said, \"The moon is bewitched.\"\n\n\nThen Allah, the Most High, revealed: {The Hour has drawn near, and the moon has been cleft in two. And if they see a sign, they turn away and say, \"This is ongoing magic.\"} And the ongoing one is the strong one.\n It is said that some of them resemble each other.\n The one who goes",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ اقْتربت الساعة وانْشقَّ القمر } إنما كان انشقاق القمر آية قرب القيامة الكبرى\n لأن القمر إشارة إلى القلب لكونه ذا وجهين: وجه مظلم يلي النفس\n وآخر منوّر يلي الروح\n ولاستفادته النور من الروح كاستفادة القمر النور من الشمس وانفلاقه بتأثير نور الروح فيه وظهور شمسه من مغربها أي: بروزها من حجاب القلب بعد كونها فيه علامة قرب الفناء في الوحدة لكونه مقام المشاهدة المؤدية إلى الشهود الذاتي وإن حملت على دور الظهور الذي هو زمان المهدي المبعوث في نسمها\n فانشقاق القمر انفلاقه عن ظهور محمد عليه السلام لظهوره في دور القمر وإن حملت على الصغرى فالقمر هو البدن لاستفادته نور الشعور والحياة من شمس الروح وظلمته في نفسه ويقويه قوله: { يوم يدع الداع } أي: يظهر مقتضى الموت ويدعو موجبه إلى شيء منكر فظيع تكرهه النفوس\n { خشعاً أبصارهم } من الذلّة والعجز والمسكنة والحرمان { يخرجون } من أجداث الأبدان { كأنهم جراد منتشر } شبهها بالجراد لكثرة النفوس المفارقة وذلتها وضعفها وحرصها وتهالكها على حضرة الذات الحسية والشهوات الطبيعية وميلها إلى الجهة السفلية كما شبهها بالفراش لتهالكها إلى نور الحياة\n وعلى الأول يوم يدعو داعي الروح والقلب النفوس إلى شيء منكر عندها من ترك الحظوظ العاجلة واللذات البدنية والحسيّة الذي هو الموت الإرادي بالرياضة ومشايعة السرّ في التوجه إلى جناب الحق { خشعاً أبصارهم } \n ذليلة منكسرة لقهر الداعي لها واستيلائه عليها يخرجون من أجداث الأبدان بالتجرد والانخلاع عنها كأنهم جراد لضعفها وطيرانها في شعاع نور شمس الروح",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱقْتَرَبَتِ ٱلسَّاعَةُ } ودنت القيامة الموعودة قيامها\n ومن علاماتها: انشقاق القمر { وَ } قد { ٱنشَقَّ ٱلْقَمَرُ } [القمر: 1] بإشارة الحضرة الختمية المحمدية صلى الله عليه وسلم\n هذا وتواتر وقوعه\n\n\n{ وَ } المنكرون المصرون على الإنكار والتكذيب\n المقيدون بعقال العقل الفضولي\n المغلولون بأغلال الأحلام المشوبة بالخيالات والأوهام { إِن يَرَوْاْ آيَةً } معاينة دالة على كمال قدرة الصانع الحكيم\n والقادر العليم\n يُعْرِضُوا عنها\n لعدم مطابقتها بعاداتهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جل جلاله: { اقتربت الساعةُ } قربت القيامة\n قال القشيري: ومعنى قربها: أنّ ما بقي من الزمان إلى القيامة قليلٌ بالإضافة إلى ما مضى\n هـ\n قال ابن عطية: وأمرها مجهول التحديد\n وكل ما يُروى من التحديد في عمر الدنيا فضعيف\n هـ\n { وانشقَّ القمرُ } نصفين\n وقرئ: و \" قد انشقَّ القمر \" \n أي: اقتربت الساعة وقد حصل من آيات اقترابها أنَّ القمر قد انشقًَّ\n كما تقول: أقبل الأميرُ\n وقد جاء البشير بقدومه\n قال ابن مسعود رضي الله عنه: انشق القمر على عهد النبي صلى الله عليه وسلم فرقتين\n فكانت أحداهما فوق الجبل\n والأخرى أسفل من الجبل\n فقال صلى الله عليه وسلم:\n \" اشهدوا \" \nقال ابن عباس: إنَّ المشركين قالوا للنبي صلى الله عليه وسلم: إن كنت صادقاً فشُق لنا القمر فلقتين\n فقال:\n \" إن فعلتُ أتؤمنون؟ \" \nفقالوا: نعم\n وكانت ليلة بدر\n فسأل صلى الله عليه وسلم ربه فانشق فرقتين\n نصف على أبي قُبيس\n ونصف على قُعَيْقِعان\n وقيل: سألوا آية مجملة\n فأراهم انشقاق القمر\n قال ابن عطية: وعليه الجمهور\n يعني عدم التعيين\n وفي صحيح مسلم: أنه انشق مرتين وصرح في شرح مرتين وصرح في شرح المواقف بأن انشقاقه متواتر\n هـ\n وقيل: معناه: انشق\n أي: ينشق يوم القيامة\n وهو ضعيف\n ولا يُقال: لو انشقَّ لما خفي على أهل الأقطار\n ولو ظهر عندهم لنقل متواتراً لأن الطباع جبلت على نشر العجائب\n لأنه يجوز أن يحجبه اللّهُ عنهم بغيم أو غيره\n مع أنه كان ليلاً\n وجُلّ الناس نائمون\n وأيضاً: عادة الله تعالى في معجزاته أنه لا يراها إلاَّ مَن ظهرت لأجله في الغالب\n تنبيه: قال القسطلاني في المواهب اللدنية: ما يذكره بعض القصَّاص أن القمر دخل في جيب النبي صلى الله عليه وسلم وخرج من كمه\n ليس له أصل\n كما حكاه الزركشي عن شيخه العِماد ابن كثير\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "84:1",
      "similarity": 0.5089207044089583
    },
    {
      "verse": "80:26",
      "similarity": 0.5079062454483868
    },
    {
      "verse": "38:2",
      "similarity": 0.4640131785925478
    },
    {
      "verse": "91:2",
      "similarity": 0.45691875379447044
    },
    {
      "verse": "13:34",
      "similarity": 0.4475610807584206
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/54:1.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/54:1.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/54:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}