{
  "chapter": "القمر",
  "text": "تجرى باعيننا جزاء لمن كان كفر",
  "translations": [
    {
      "translation": "Which sailed right under Our eyes: A recompense for him who had been denied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "which sailed on under Our supervision: a reward for him who had been shown ingratitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "which floated on the water before Our very eyes. The flood was a recompense for the deeds of the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sailing in front of Our sight; as a reward for the sake of one who was rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Floating under Our Eyes, a reward for him who had been rejected!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sailing, before Our eyes, a reward for him who was denied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "running before Our eyes-a recompense for him denied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That ran (upon the waters) in Our sight, as a reward for him who was rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "floated on under Our eyes: a vindication of him who had been rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moving forward under Our eyes: a requital for him who had been rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "which sailed [over the flood waters] in Our sight, as a retribution for him who was met with disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "She floats under our eyes (and care): a recompense to one who had been rejected (with scorn)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Floating under Our Eyes, a reward for him who had been rejected!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that ran on under Our Eyes, a recompense for him because he had been disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sailing before Our eyes; a reward for him who was rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sailing under Our observation as reward for he who had been denied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[54:14] sailing before Our eyes, that is, in Our sights, in other words, [it was being] protected, as retaliation (jazā’an is in the accusative because of the implied verbal clause, that is to say, ‘they were drowned by way of revenge’) for [the sake of] him who was rejected, namely, Noah, peace be upon him (a variant reading [for passive kufira] has kafara, ‘him who disbelieved’, in other words, they were drowned as a punishment for them).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That ran (upon the waters) in Our sight) under Our protection, (as a reward for him who was rejected) He says: this is as a reward for the folk of Noah as a result of their disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تَجْرِي بِأَعْيُنِنَا } معناه بحفظِنا وبكلائتِنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنما فعلنا مع نوح وقومه ما فعلنا؛ ليكون { جَزَآءً } حسناً له ولمن آمن به، وسيئاً { لِّمَن كَانَ كُفِرَ } [القمر: 14] بنعمة هدايته وإرشاده، ولم يؤمن بدينه، ولم يصدقه في تبليغه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { تجري بأعيننا } أي بمرأىً منا، أو: بحفظنا، وهو حال من فاعل \" تجري \" ، أي: تجري محفوظة { جزاءً } مفعول له، أي: فعلنا ذلك جزاءً { لمن كان كُفِرَ } وهو نوح عليه السلام، وجعله مكفوراً لأن النبي نعمة من الله ورحمة، فكان نوح نعمة مكفورة\n\n\nوقرأ مجاهد بفتح الكاف، أي: عقاباً لمَن كَفَرَ بالله\n قيل: ما نجا من الغرق إلاَّ عُوج بن عُنُق، كان الماء إلى حجزته، وسبب نجاته: أنّ نوحاً احتاج إلى خشب الساج للسفية، فلم يمكنه نقلها، فحمل عُوج تلك الخشب إليه من الشام، فشكر الله له ذلك، ونجّاه من الغرق\n قال الثعلبي\n قلت: وقد تقدّم إبطاله في سورة العقود، وأنه من وضع الزنادقة\n ذكره القسطلاني",
      "translations": []
    }
  ]
}