{
  "chapter": "القمر",
  "text": "ولقد يسرنا القرءان للذكر فهل من مدكر",
  "translations": [
    {
      "translation": "Easy have We made the Qur'an to understand: So is there any one who will pay heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made the Qur'an easy to derive lessons from. Is there, then, any who will take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made the Quran easy to understand, but is there anyone who would pay attention?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have indeed made the Qur’an easy to memorise, so is there one who would remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have indeed made the Qur'an easy to understand and remember; then is there any that will remember\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We have made the Quran easy for remembrance, but is there anyone who will mind?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now We have made the Koran easy for Remembrance. Is there any that will remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in truth We have made the Qur'an easy to remember; but is there any that remembereth?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made it easy to learn lessons from the Quran: is there anyone who would receive admonition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have made the Qur'an easy for admonition; is therethen any one who would be admonished!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We have made the Quran simple for the sake of admonishment. So is there anyone who will be admonished?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We have indeed made the Qur'an easy to understand and remember: then is there any that will receive admonition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have indeed made the Quran easy to understand and remember, then is there any that will remember (or receive admonition)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made the Koran easy to remember, is there any that will remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made the Quran easy to remember. Is there anyone who would remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have certainly made the Qur'an easy for remembrance, so is there any who will remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[54:22] And verily We have made the Qur’ān easy to remember. So is there anyone who will remember?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And in truth We have made the Qur'an easy to remember) and to recite; (but is there any that remembereth) is there any that takes admonition from what was done to the people of Hud and therefore abstain from transgression?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } الله { لَقَدْ يَسَّرْنَا } أي: سهلنا وأنزلنا { ٱلْقُرْآنَ } المعجز { لِلذِّكْرِ } والاتعاض { فَهَلْ مِن مُّدَّكِرٍ } [القمر: 22] متذكر، يتعظ به\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}