{
  "chapter": "القمر",
  "text": "ولقد رودوه عن ضيفه فطمسنا اعينهم فذوقوا۟ عذابى ونذر",
  "translations": [
    {
      "translation": "They lusted after his guests, so We put out their eyes (and said): \"Taste My punishment and My commination.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they even solicited his guests from him, whereupon We blotted out their eyes, (telling them): “Now have a taste of My chastisement and My warnings.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They demanded that he turn over his guests to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they tried to persuade him regarding his guests – We therefore blinded their eyes, “So taste My punishment, and My warnings.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they indeed sought to shame his guests. So, We blinded their eyes (saying), \"Then taste you My torment and My warnings.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly they endeavored to turn him from his guests, but We blinded their eyes; so taste My chastisement and My warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even his guests they had solicited of him; so We obliterated their eyes, saying, 'Taste now My chastisement and My warnings!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They even asked of him his guests for an ill purpose. Then We blinded their eyes (and said): Taste now My punishment after My warnings!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they even wanted to seduce his guests -- but We blinded them, and said, \"Taste My punishment now that you have scorned My warnings!\" --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly they solicited him for his guests: then We wiped out their eyes: taste then My torment and My warnings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They even solicited of him his guests, whereat We blotted out their eyes, [saying,] ‘Taste My punishment and My warnings!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they even sought to snatch away his guests from him, but We blinded their eyes. (They heard:) \"Now taste ye My Wrath and My Warning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they indeed sought to shame his guest (by asking to commit sodomy with them). So We blinded their eyes, \"Then taste you My Torment and My Warnings.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They even solicited of him his guests, but We obliterated their eyes: 'Now, taste My punishment and My warnings'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They even lusted for his guest, so We obliterated their eyes. “So taste My punishment and My warnings.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they had demanded from him his guests, but We obliterated their eyes, [saying], \"Taste My punishment and warning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[54:37] And they had even solicited of him his guests, that he should let them have their own way with those who had come to him as guests, that they may do wicked things with them — and these [guests] were angels. So We blotted out their eyes, We blinded them and made them without slits [so that they were continuous folds of skin] like the rest of the face, by having Gabriel smack them with his wing. ‘So taste [now], so We said to them: taste, My chastisement and My warnings’, that is to say, [taste] the effects and the substance of My warning and My threat.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They even asked of him his guests for an ill purpose) they wanted his guests, Gabriel and the angels who were with him, for their abominable deed. (Then We blinded their eyes) Gabriel blinded their eyes ((and said): Taste now My punishment after My warnings!) And I said to them: taste now My punishment and the warning of My warners!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من شدة مرائهم معه، واجترائهم { لَقَدْ رَاوَدُوهُ عَن ضَيْفِهِ } وترددوا حول بيته، وقصدوا فجور أضيافه، ويمموا على تفضيحهم { فَطَمَسْنَآ أَعْيُنَهُمْ } ومسخناها، وصيرناها مستوية مع وجوههم، فصاروا ممسوحي العيون\n\n\n\n\nرُوي أنهم لما دخلوا عنوة في داره، صفقهم جبريل صفقة، فأعماهم دفعة { فَذُوقُواْ } أي: فقلنا لهم حينئذٍ: ذوقوا { عَذَابِي وَنُذُرِ } [القمر: 37] المنذر به على لسان نبينا لوط عليه السلام\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}