{
  "chapter": "القمر",
  "text": "وكذبوا۟ واتبعوا۟ اهواءهم وكل امر مستقر",
  "translations": [
    {
      "translation": "They have denied the truth and followed their whims and desires, but everything has its time.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And deny, and follow their own vain desires; but every matter is determined at its time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They also gave the lie to (the splitting asunder of the moon) and only followed their desires. Yet everything is destined to reach an end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have rejected it and have followed their own desires, but all matters will be settled (by God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they denied and followed their own desires, whereas each matter has been decided!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They denied and followed their own lusts. And every matter will be settled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they call (it) a lie, and follow their low desires; and every affair has its appointed term.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have cried lies, and followed their caprices; but every matter is settled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They denied (the Truth) and followed their own lusts. Yet everything will come to a decision\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They deny the truth and follow their own whims, every matter has its appointed time,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they belied, and they followed their lusts; and every affair cometh to a final goal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They denied and followed their own desires, and every matter has a setting [appropriate to it].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They reject (the warning) and follow their (own) lusts but every matter has its appointed time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They belied (the Verses of Allah, this Quran), and followed their own lusts. And every matter will be settled [according to the kind of deeds (for the doer of good deeds, his deeds will take him to Paradise, and similarly evil deeds will take their doers to Hell)].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have belied, and follow their own fancies. But, every issue will be settled!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They lied, and followed their opinions, but everything has its time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they denied and followed their inclinations. But for every matter is a [time of] settlement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[54:3] And they denied, the Prophet (s), and followed their own desires, as regards [their] falsehood; and every matter, that is good or evil, will be settled, with that person [who is responsible for it], either [by his ending up] in Paradise or in the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They denied) the sign and the coming of the Hour (and followed their own lusts) in denying the sign, the coming of the Hour and worshipping idols. (Yet everything will come to a decision) every word from Allah or His Messenger regarding promise, threat, tidings of Paradise or hell, mercy or punishment is true, some of this will happen in the life of the world, for all to see, and some of it will happen in the Hereafter and everything there will be manifest. It is also said that this means: every action and word that ensue from the slaves has a reality and this reality is in the heart.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { كَذَّبُواْ } الآية الخارقة للعادة { وَٱتَّبَعُوۤاْ أَهْوَآءَهُمْ } المعتادة الفاسدة، وآراءهم الباطلة الكاسدة { وَ } هكذا { كُلُّ أَمْرٍ } رسخ، تمكن في نفوسهم، سواء كان خيراً أو شراً، طاعة أو معصية، ولاية أو عداوة { مُّسْتَقِرٌّ } [القمر: 3] ثابت في مكانه بعدما تقرر وتمرن، لا يتعداه أصلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكذّبوا واتَّبعوا أهواءَهم } الباطلة، وما زيَّن لهم الشيطان من دفع الحق بعد ظهوره، حتى قالوا: سحرَ القمر، أو: سَحَرَ أعيننا، { وكلُّ أمرٍ }  وعدهم الله به { مستقِرٌ } كائن في وقته، أو: كل أمر قُدِّرَ واقع لا محالة يستقر في وقته، أو: كل أمر من الخير والشر يقع بأهله من الثواب والعقاب، وقُرئ \" مستقرٍ \" بالجر، فيعطف على \" الساعة \" ، أي: اقتربت الساعة وكل أمرٍ مستقر، يعني: أشراطها\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:66",
      "similarity": 0.5055417262553379
    },
    {
      "verse": "75:12",
      "similarity": 0.5031225021048573
    },
    {
      "verse": "101:9",
      "similarity": 0.4982530142817371
    },
    {
      "verse": "2:145",
      "similarity": 0.48680515229627347
    },
    {
      "verse": "30:29",
      "similarity": 0.46066491049843045
    }
  ]
}