{
  "chapter": "القمر",
  "text": "انا ارسلنا عليهم صيحة وحدة فكانوا۟ كهشيم المحتظر",
  "translations": [
    {
      "translation": "We sent a single Blast against them and they were just like a thatcher's reeds.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent a single blast against them, and they were reduced to husks of a decayed fence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, We sent a single Blast against them, and they became like the trampled twigs of a sheep pen-builder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent upon them a single blast of sound and they were left like hay to be used by the cattle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We sent upon them a single Scream – thereupon they became like the barrier builder’s residual dry trampled hay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We sent against them a single Sayhah, and they became like straw Al-Muhtazir.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We sent upon them a single cry, so they were like the dry fragments of trees which the maker of an enclosure collects.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We loosed against them one Cry, and they were as the wattles of a pen-builder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We sent upon them one Shout, and they became as the dry twigs (rejected by) the builder of a cattle-fold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent a single blast against them and they became like dry stubble which has been trampled upon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We We sent upon them one shout, and they became as the stubble of a fold-builder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent against them a single Cry, and they became like the dry sticks of a corral builder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For We sent against them a single Mighty Blast, and they became like the dry stubble used by one who pens cattle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We sent against them a single Saihah (torment - awful cry, etc.), and they became like the dry stubble of a fold-builder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent against them one Shout and they became like the trampled twigs of the (sheep) penbuilder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent against them a single Scream, and they became like crushed hay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We sent upon them one blast from the sky, and they became like the dry twig fragments of an [animal] pen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[54:31] Indeed We unleashed upon them a single Cry, and they became like the chaff of a corral builder (almuhtazir is one who makes a pen from dried tree-branches and thorns for his sheep, to protect them from wolves and beasts of prey; the fallen parts which they tread are called hashīm).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! We sent upon them one Shout) the shout of Gabriel three days after the killing of the she-camel, (and they became as the dry twigs (rejected by) the builder of a cattle fold) they became like the things in the cattle fold on which the cattle step.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كَهَشِيمِ ٱلْمُحْتَظِرِ } فالهَشِيمُ: ما تَكسرَ من الشَّجرِ والمُحتظرُ: الحَظيرةُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {As the debris of a destroyed house} - so the debris of a destroyed house is that which is broken off from the tree, and the destroyed house is the wall.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { إِنَّآ } بمقتضى قهرنا وغضبنا { أَرْسَلْنَا عَلَيْهِمْ صَيْحَةً وَاحِدَةً } هائلة مهولة { فَكَانُواْ } إثر سماع تلك الصيحة الهائلة { كَهَشِيمِ ٱلْمُحْتَظِرِ } [القمر: 31] أي: مثل الأشجار اليابسة البالية في حظائر الأموات، تتناثر أجسامهم كالتراب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فكيف كان عذابي ونُذُر إِنَّا أرسلنا عليهم } في اليوم الرابع مِن عَقْرها، { صَيحةً واحدة } صاح بهم جبريل عليه السلام { فكانوا } فصاروا { كهشيمِ المحتظِر } كالشجر اليابس الذي يجده مَن يعمل الحظيرة، فالهشيم: الشجرة اليابس المتكسر، الذي يبس من طول الزمان، وتتوطّؤه البهائم فيتحطّم ويتهشّم، والمحتظر: الذي يعمل الحظيرة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:20",
      "similarity": 0.5797600419616157
    },
    {
      "verse": "18:45",
      "similarity": 0.41488232766063515
    },
    {
      "verse": "38:15",
      "similarity": 0.1490916169353604
    },
    {
      "verse": "36:49",
      "similarity": 0.14502450916337747
    },
    {
      "verse": "36:53",
      "similarity": 0.1447566682735062
    }
  ]
}