{
  "chapter": "القمر",
  "text": "ولقد يسرنا القرءان للذكر فهل من مدكر",
  "translations": [
    {
      "translation": "Easy have We made the Qur'an to understand: So is there any one who will be warned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have made this Qur'an easy as a reminder. Is there, then, any who will take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made the Quran easy to understand, but is there anyone who would take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have indeed made the Qur’an easy to memorise, so is there one who would remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We have made the Qur'an easy to understand and remember; then is there any that will remember\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We have made the Quran easy for remembrance, but is there anyone who will mind?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now We have made the Koran easy for Remembrance. Is there any that will remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in truth We have made the Qur'an easy to remember; but is there any that remembereth?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have made the Quran easy to learn lessons from. Is there anyone who would receive admonition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have made the Qur'an eary for admanirion: is there then any one who would be admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We have made the Quran simple for the sake of admonishment. So is there anyone who will be admonished?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have indeed made the Qur'an easy to understand and remember: then is there any that will receive admonition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We have made the Quran easy to understand and remember, then is there any that will remember (or receive admonition)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made the Koran an easy Remembrance, is there any that will remember!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made the Quran easy to understand. Is there anyone who would understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have certainly made the Qur'an easy for remembrance, so is there any who will remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[54:32] And verily We have made the Qur’ān easy to remember. So is there anyone who will remember?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And in truth We have made the Qur'an easy to remember) easy to take admonition from, and easy to memorise and recite; (but is there any that remembers) but is there any that takes admonition from what was done to the folk of Salih and, as a result, desist from transgression? It is also said that this means: is there any that seeks knowledge such that he is helped to acquire it?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { لَقَد يَسَّرْنَا ٱلْقُرْآنَ } المشتمل على أنواع الرشد والهداية { لِلذِّكْرِ } والعظة { فَهَلْ مِن مُّدَّكِرٍ } [القمر: 32] يتذكر ويتهدي بهدايته وتذكيره\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال ابن عباس: \" هو الرجل يجعل لغنمه حظيرة من الشجر والشوك، فما يسقط من ذلك ودرسته الغنم فهو هشيم \" شبههم في تبدُّدهم، وتفرُّق أوصالهم، بالشوك الساقط على الأرض، { ولقد يَسَّرْنا القرآن للذكر فهل من مُدَّكِرٍ } فيتعظ بما يسمع من هذه القصص\n\n\nالإشارة: سبب إنكار الناس على أهل الخصوصية ظهور وصف البشرية عليهم، ولا يلزم من وجود الخصوصية عدم وصف البشرية، ووصف البشرية على قسمين: قسم لازم، لا تنفك العبودية عنه، كالأكل والشرب والنوم والنكاح، وغيرها من الأوصاف الضرورية، وهذه هي التي تجامع الخصوصية، وبها سترت، واحتجبت حتى أنكرت، فوجودها في العبد كمال لإنها صِوان لسر الخصوصية\n قال في الحكم: \" سبحان مَن ستر سر الخصوصية بظهور وصف البشرية، وظهر بعظمة الربوبية في إظهار العبودية \"\n وقسم عارض يمكن زواله وهي الأوصاف المذمومة، كالكبر والحسد والحقد، وحب الدنيا والرياسة، وغير ذلك، فهذا لا تجامعه الخصوصية، ولا بد من التطهير منه في وجودها\n وللقشيري إشارة أخرى، وحاصلها: كذبت ثمود النفسُ الأمّارة وجنودُها: صالح القلب حين دعاها إلى الخروج عن عوائدها، والتطهُّر من أوصافها المذمومة، فقالت النفسُ وجنودها: أنتبع واحداً منا، لأنه مخلوق مثلنا، ونحن عُصبة؟ إنا إذاً لفي ضلال سُعر، أأُلقي الذكر الإلهامي عليه مِن بيننا؟ بل هذ كذَّاب أشر، سيعلمون غداً، حين يقع لهم الرحيل من عالمهم، مَنِ الكذابُ الأشر، أثمود النفس وجنودها، أم صالح القلب؟\n إنّا مرسل ناقة النفس فتنة لهم، ابتلاءً ليظهر الخصوص من العموم، فارتقبهم، لعلهم يرجعون إلى أصلهم من النزاهة والطهارة، واصطبر في مجاهدتهم، ونبئهم أنَّ ماء الحياة - وهي الخمرة الأزلية - قسمة بينهم، مَن شَرِبَ منها، صفا، ومَن تنكّب عنها أظلم، كُل شِرْب يحضره مَن يتأهل له\n فنادوا صاحبهم - وهو الهوى - فتعاطى ناقة النفس، التي أرادت العروج إلى وطن الروح، فعقرها وردها إلى وطنها الخسيس، فكيف كان عذابي لها وإنذاري إياها؟ إنَّا أرسلنا عليهم صيحةَ القهر، فسقطوا إلى الحضيض الأسفل، فكانا كهشيم المحتظر صاروا أرضيين بعد أن كانوا سماويين\n هـ\n بالمعنى مع تخالف له\n ثم قال القشيري: اعلم أن النفس حقيقة واحدة، غير متعددة، لكن بحسب توارد الصفات المتباينة تعددت أسماؤها، فإذا توجهت إلى الحق توجهاً كليّاً سميت مطمئنة، وإذا توجهت إلى الطبيعة البشرية توجهاً كليّاً سميت أمّارة، وإذا توجهت إلى الحق تارة، وإلى الطبيعة أخرى سميت لوّامة\n هـ مختصراً\n ثم ذكر قصة لوط، فقال: { كَذَّبَتْ قَوْمُ لُوطٍ بِٱلنُّذُرِ }\n\n",
      "translations": []
    }
  ]
}