{
  "chapter": "القمر",
  "text": "انا كل شىء خلقنه بقدر",
  "translations": [
    {
      "translation": "We have indeed created all things by measure;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created everything in a determined measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created everything to fulfill a certain purpose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed created all things by a proper measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have created all things with Qadar.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have created everything according to a measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have created everything in measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We have created every thing by measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created everything in due measure;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Veriiy everything! We have created it by a measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We have created everything in a measure,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, all things have We created in proportion and measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have created all things with Qadar (Divine Preordainments of all things before their creation, as written in the Book of Decrees Al-Lauh Al-Mahfuz).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have created all things according to a measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everything We created is precisely measured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, all things We created with predestination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[54:49] Truly everything (read inna kulla shay’in is [in the accusative as a] dependent clause because of a verb governing it) have We created in a measure, by ordainment (bi-qadarin, ‘in a measure’, is a circumstantial qualifier referring to kulla, ‘every’, in other words, ‘[already] predetermined’; a variant reading [for kulla] has [nominative] kullu as the subject, the predicate of which is khalaqnāhu, ‘We have created’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! We have created every thing) of your works (by measure) by you rejected this. This verse was revealed about those who argued about destiny.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا نُدخل المجرمين في دار القطيعة، ولا نسحبهم نحوها مهانين، فإنهم قد خرجوا عن مقتضى تدبيرنا وأوضاعنا الناشئة منا على مقتضى الحكمة المتقنة البالغة المعتدلة؟! { إِنَّا } بمقتضى كمال علمنا، وشمول قدرتنا وإرادتنا المقتضية للحكم والمصالح، خلقنا وأظهرنا { كُلَّ شَيْءٍ خَلَقْنَاهُ } وأظهرناه من كتم العدو مقروناً { بِقَدَرٍ } [القمر: 49] أي: بمقدار نقدره في حضرة علمنا، ولوح قضائنا، ونرتب على المقدار المقدر وجود المقدور المخلوق، فنظهره على وفقه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنَّا كُلَّ شيءٍ خلقناه بقدرٍ } أي: بتقدير سابق في اللوح قبل وقوعه، قد علمنا حالَه وزمانه قبل ظهوره، أو: خلقناه كل شيء مقدّراً محكماً مرتباً على حسب ما اقتضته الحكمة، و \" كل \": منصوب بفعل يُفسره الظاهر\n وقرئ بالرفع شاذّاً، والنصب ألأولى لأنه لو رفع لأمكن أن يكون \" خلقنا \" صفة لشيء، ويكون الخبر مقدراً، أي: إنا كل شيء مخلوق لنا حاصل بقدر، فيكون حجة للمعتزلة، باعتبار المفهوم، وأن أفعال العباد غير مخلوقة لله\n فلم يسبق لها قدر، تعالى الله عن قولهم، المفهوم، وأن أفعال العباد غير مخلوقة لله\n فلم سبق لها قدر، تعالى الله عن قولهم، ويجوز أن يكون الخبر: \" خلقناه \" ، فلا حجة فيه، ولا يجوز في النصب أن يكون \" خلقنا \" صفة لشيء لأنه يفسر الناصب، والصفة لا تعمل في الموصوف، وما لا يعمل لا يفسر عاملاً\n قال أبو هريرة: جاء مشركو قريش إلى النبي صلى الله عليه وسلم يُخاصمونه في القدر، فنزلت الآية، وكان عمر يحلف أنها نزلت في القدرية، أي: على طريق الإخبار بالغيب",
      "translations": []
    }
  ]
}