{
  "chapter": "القمر",
  "text": "اكفاركم خير من او۟لئكم ام لكم براءة فى الزبر",
  "translations": [
    {
      "translation": "Are your kuffar better than those peoples'? Or have you been given exemption in the Books?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are the unbelievers among you any better than they? Or is there immunity for you in the Scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your unbelievers (of Makkah) any better than they? Or have you been granted any immunity in the Scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you disbelievers mightier than those of the nations which We destroyed before or have you received amnesty through the ancient Scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your disbelievers better than they were, or have you been given exemption in the Books?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your disbelievers better than these Or have you immunity in the Divine Scriptures\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are the unbelievers of yours better than these, or is there an exemption for you in the scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, are your unbelievers better than those? Or have you an immunity in the Scrolls?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your disbelievers better than those, or have ye some immunity in the scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your people who deny the truth better than those? Or have you been given immunity in the Scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your infidels better than these? Or is there an immunity for you in the Writs?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your faithless better than those? Have you [been granted] [some sort of] immunity in the scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your Unbelievers, (O Quraish), better than they? Or have ye an immunity in the Sacred Books?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your disbelievers (O Quraish!) better than these [nations of Nuh (Noah), Lout (Lot), Salih (Saleh), and the people of Fir'aun (Pharaoh), etc., who were destroyed)? Or have you an immunity (against Our Torment) in the Divine Scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What then, are your unbelievers better than those? Or do you have an immunity (written) in the Scrolls?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your unbelievers better than all those? Or do you have immunity in the scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your disbelievers better than those [former ones], or have you immunity in the scripture?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[54:43] Are your disbelievers, O Quraysh, better than those?, mentioned [beginning] from the people of Noah to those of Pharaoh, which is why they have not been chastised? Or have you, O disbelievers of Quraysh, [been granted] some immunity, from chastisement, in the Scriptures?, the Books? (the interrogative in both instances is meant as a denial, in other words: it is not so).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَكُفَّارُكُمْ خَيْرٌ مِنْ أُولَئِكُمْ أَمْ لَكُمْ بَرَاءَةٌ فِي الزُّبُرِ (43(هذه الجملة كالنتيجة لحاصل القصص عن الأمم التي كذبت الرسل من قوم نوح فمن ذكر بعدهم ولذلك فُصِلت ولم تعطف .وقد غير أسلوب الكلام من كونه موجَّهاً للرسول صلى الله عليه وسلم إلى توجيهه للمشركين ليُنتقل عن التعريض إلى التصريح اعتناء بمقام الإِنذار والإِبلاغ .والاستفهام في قوله : { أكفاركم خير من أولائكم } يجوز أن يكون على حقيقته ، ويكون من المحسن البديعي الذي سماه السكاكي «سوْقَ المعلوم مساق غيره» . وسماه أهل الأدب من قبله ب «تجاهل العارف» . وعدل السكاكي عن تلك التسمية وقال لوقوعه في كلام الله تعالى نحو قوله : { وإنا أو إياكم لعلى هدى أو في ضلال مبين } \\[ سبأ : 24 \\] وهو هنا للتوبيخ كما في قول ليلى ابنة طريف الخارجية ترثي أخاها الوليد بن طريف الشيباني :أبا شَجر الخابُورِ ما لكَ مُورِقَا ... كأنَّك لَم تَجْزَع على ابننِ طريفالشاهد في قولها : كأنك لم تجزع الخ .والتوبيخ عن تخطئتهم في عدم العذاب الذي حَلَّ بأمثالهم حتى كأنهم يحسبون كفّارهم خيراً من الكفّار الماضين المتحدَّث عن قصصهم ، أي ليس لهم خاصية تربأ بهم عن أن يلحقهم ما لَحق الكفار الماضين . والمعنى : أنكم في عدم اكتراثكم بالموعظة بأحوال المكذبين السابقين لا تخلون عن أن أحد الأمرين الذي طمأنكم من أن يصيبكم مثل ما أصابهم .و { أم } للإِضراب الانتقالي . وما يقدر بعدها من استفهام مستعمل في الإِنكار . والتقدير : بل ما لكم براءة في الزبر حتى تكونوا آمنين من العقاب .وضمير { كفاركم } لأهل مكة وهم أنفُسُهم الكفارُ ، فإضافة لفظ ( كفار ( إلى ضميرهم إضافة بيانية لأن المضاف صنف من جنس من أضيف هو إليه فهو على تقدير { مِن } البيانية . والمعنى : الكفارُ منكم خير من الكفار السالفين ، أي أأنتم الكفار خير من أولئك الكفار .والمراد بالأَخْيَرية انتفاء الكفر ، أي خير عند الله الانتقام الإِلهي وادعاء فارق بينهم وبين أولئك .والبراءة : الخلاص والسلامة مما يضرّ أو يشقّ أو يكلّف كلفة . والمراد هنا : الخلاص من المؤاخذة والمعاقبة .و { الزّبر } : جمع زبور ، وهو الكتاب ، وزبور بمعنى مزبور ، أي براءة كتبت في كتب الله السالفة .والمعنى : ألكم براءة في الزبر أن كفاركم لا ينالهم العقاب الذي نال أمثالهم من الأمم السالفة .و { في الزبر } صفة { براءة } ، أي كائنة في الزبر ، أي مكتوبة في صحائف الكتب .وأفاد هذا الكلام ترديد النجاة من العذاب بين الأمرين : إما الاتصاف بالخيْر الإِلهي المشار إليه بقوله تعالى : { إن أكرمكم عند الله أتقاكم } \\[ الحجرات : 13 \\] ، وإما المسامحة والعفو عما يقترفه المرء من السيئات المشار إليه بقول النبي صلى الله عليه وسلم \" لعل الله أطّلع على أهل بدر فقال : اعملوا ما شئتم فقد غفرت لكم \" . والمعنى انتفاء كلا الأمرين عن المخاطبين فلا مَأْمَنَ لهم من حلول العذاب بهم كما حلّ بأمثالهم .والآية تُوذن بارتقاب عذاب ينال المشركين في الدنيا دون العذاب الأكبر ، وذلك عذاب الجوع الذي في قوله تعالى : { فارتقب يوم تأتي السماء بدخان مبين } \\[ الدخان : 10 \\] كما تقدم ، وعذاب السيف يوم بدر الذي في قوله تعالى : { يوم نبطش البطشة الكبرى إنا منتقمون } \\[ الدخان : 16 \\] .\n\n",
      "translations": [
        {
          "translation": "(Are your disbelievers) Muhammad; and it is said: people of Mecca (better than those) We related to you, (or have ye some immunity in the Scriptures) from punishment?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَمْ لَكُم بَرَآءَةٌ فِي ٱلزُّبُرِ } وهي الكُتبُ\n واحدُها زَبورٌ\n\n",
      "translations": [
        {
          "translation": " Or is there for you any exemption in the Scripture?\n\n\nThe first one is the Zabur.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { أَكُفَّٰرُكُمْ } يا معشر العرب { خَيْرٌ } وأضل مطلقاً { مِّنْ أُوْلَٰئِكُمْ } الكفار المعدودين المذكورين وجاهة وثروة\n مالاً ومظاهرة\n مكنة ومكانة\n ثمَّ إنكم لستم أمثالهم\n وهم من شدة قوتهم وشوكتهم\n ما نجوا من عذاب الله\n أتنجون أنتم { أَمْ } نزل { لَكُم بَرَآءَةٌ فِي ٱلزُّبُرِ } [القمر: 43] السماوية والكتب الإلهية\n إن من كفر منكم\n وخرج عن مقتضى الحدود الإلهية\n فهو ناج من عذاب الله\n بريء عن انتقامه؟!\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { أكُفاركم } يا معشر العرب: أو: يا أهل مكة { خيرٌ من أُولئِكم } الكفار المعدودين في السورة قوم نوح وهود وصالح ولوط وآل فرعون\n والمعنى: أنه أصابهم ما أصابهم مع ظهور خيريتهم منكم قوةً وآلةً ومكانةً في الدنيا\n أو: كانوا أقلّ منكم كفراً وعناداً\n فهل تطمعون ألاَّ يُصيبكم مثل ما أصابهم\n وأنتم شر منهم مكانةً\n وأسوأ حالاً؟ { أم لكم براءةٌ في الزُبُر } أم نزلت عليكم يا أهل مكة براءة في الكتب المتقدمة: أنَّ مَن كفر منكم وكذّب الرسول كان آمناً مِن عذاب الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:196",
      "similarity": 0.7416179524442921
    },
    {
      "verse": "54:52",
      "similarity": 0.7225703197037179
    },
    {
      "verse": "3:184",
      "similarity": 0.68228905072872
    },
    {
      "verse": "35:25",
      "similarity": 0.6802529158332853
    },
    {
      "verse": "21:105",
      "similarity": 0.6228769681814789
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/054043.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/054043.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/54:43.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}