{
  "chapter": "القمر",
  "text": "اكفاركم خير من او۟لئكم ام لكم براءة فى الزبر",
  "translations": [
    {
      "translation": "Are the unbelievers among you any better than they? Or is there immunity for you in the Scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your unbelievers (of Makkah) any better than they? Or have you been granted any immunity in the Scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you disbelievers mightier than those of the nations which We destroyed before or have you received amnesty through the ancient Scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your disbelievers better than they were, or have you been given exemption in the Books?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your disbelievers better than these Or have you immunity in the Divine Scriptures\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are the unbelievers of yours better than these, or is there an exemption for you in the scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, are your unbelievers better than those? Or have you an immunity in the Scrolls?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your disbelievers better than those, or have ye some immunity in the scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your people who deny the truth better than those? Or have you been given immunity in the Scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your infidels better than these? Or is there an immunity for you in the Writs?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your faithless better than those? Have you [been granted] [some sort of] immunity in the scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your Unbelievers, (O Quraish), better than they? Or have ye an immunity in the Sacred Books?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your disbelievers (O Quraish!) better than these [nations of Nuh (Noah), Lout (Lot), Salih (Saleh), and the people of Fir'aun (Pharaoh), etc., who were destroyed)? Or have you an immunity (against Our Torment) in the Divine Scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What then, are your unbelievers better than those? Or do you have an immunity (written) in the Scrolls?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your unbelievers better than all those? Or do you have immunity in the scriptures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are your disbelievers better than those [former ones], or have you immunity in the scripture?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[54:43] Are your disbelievers, O Quraysh, better than those?, mentioned [beginning] from the people of Noah to those of Pharaoh, which is why they have not been chastised? Or have you, O disbelievers of Quraysh, [been granted] some immunity, from chastisement, in the Scriptures?, the Books? (the interrogative in both instances is meant as a denial, in other words: it is not so).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Are your disbelievers) Muhammad; and it is said: people of Mecca (better than those) We related to you, (or have ye some immunity in the Scriptures) from punishment?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَمْ لَكُم بَرَآءَةٌ فِي ٱلزُّبُرِ } وهي الكُتبُ\n واحدُها زَبورٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ خاطب سبحانه كفار مكة على سبيل التوبيخ والتهديد، فقال: { أَكُفَّٰرُكُمْ } يا معشر العرب { خَيْرٌ } وأضل مطلقاً { مِّنْ أُوْلَٰئِكُمْ } الكفار المعدودين المذكورين وجاهة وثروة، مالاً ومظاهرة، مكنة ومكانة، ثمَّ إنكم لستم أمثالهم، وهم من شدة قوتهم وشوكتهم، ما نجوا من عذاب الله، أتنجون أنتم { أَمْ } نزل { لَكُم بَرَآءَةٌ فِي ٱلزُّبُرِ } [القمر: 43] السماوية والكتب الإلهية، إن من كفر منكم، وخرج عن مقتضى الحدود الإلهية، فهو ناج من عذاب الله، بريء عن انتقامه؟!\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}