{
  "chapter": "القمر",
  "text": "ولقد اهلكنا اشياعكم فهل من مدكر",
  "translations": [
    {
      "translation": "We destroyed those of your kind in the past. But is there any rememberer there?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have destroyed the likes of you in the past: So is there any one who will be warned?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We did indeed destroy many like you. Is there, then, any who will heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We destroyed many people like you (disbelievers) but is there anyone who would take heed (of Our warning)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have indeed destroyed your kind, so is there one who would ponder?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We have destroyed your likes; then is there any that will remember\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We have already destroyed the likes of you, but is there anyone who will mind?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have destroyed the likes of you; is there any that will remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We have destroyed your fellows; but is there any that remembereth?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed destroyed many a people like you. Is there anyone who would receive admonition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have destroyed your likes; so is there any one who shall be admonished?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We have destroyed your likes. So is there anyone who will be admonished?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (oft) in the past, have We destroyed gangs like unto you: then is there any that will receive admonition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We have destroyed your likes, then is there any that will remember (or receive admonition)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We destroyed those like you, is there any that will remember!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have destroyed your likes. Is there anyone who would ponder?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have already destroyed your kinds, so is there any who will remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[54:51] And verily We have destroyed the likes of you, the likes of you in terms of disbelief, from among past communities. So is there anyone who will remember? (this is an interrogative meant as an imperative, that is to say, ‘Remember and be admonished!’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We have destroyed your fellows) We have destroyed the like of you and those who followed your religion, people of Mecca; (but is there any that remembereth) is there any that takes admonition from what was done with them and, thus, desist from transgression?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على سبيل الوعيد والتهديد: وكيف لا تخافون أيها المسرفون المفرطون عن شدة بطشنا وانتقامنا { وَلَقَدْ أَهْلَكْنَآ } واستأصلنا { أَشْيَاعَكُمْ } أشباهكم وأمثالكم في الكفر والعناد، وأنواع الفسوق والفساد، بأصناف العقوبات والبليات الهائلة { فَهَلْ مِن مُّدَّكِرٍ } [القمر: 51] متذك، يتعظ بأهلاكهم وبما جرى عليهم من الشدائد؟!\n\n\n\n{ وَ } كما عذبناهم بجرائمهم وآثامهم في النشأة الأولى كذلك، بل بأضعافها وآلافها، نعذبهم في النشأة الأخرى أيضاً بها؛ إذ { كُلُّ شَيْءٍ فَعَلُوهُ } فيما مضى، وصدر عنهم في النشأة الأولى محفوظ مثبت { فِي ٱلزُّبُرِ } [القمر: 52] أي: في مكاتب الحفظة المراقبين عليهم في عموم أحوالهم وأطوارهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولقد أهلكنا أشياعكم } أي: أشباهكم في الكفر من الأمم، وقيل: أتباعكم، { فهل من مُدَّكِر } من متعظ بذلك { وكلُّ شيءٍ فعلوه } من الكفر والمعاصي مكتوب على التفصيل { في الزُبرِ } في ديوان الحفظة، { وكل صغيرٍ وكبيرٍ } مِن الأعمال، ومِن كل ما هو كائن { مُسْتَطَرٌ } مسطور في اللوح بتفاصيله\n ولمَّا بيَّن سوء حال الكفرة بقوله: { إن المجرمين\n\n\n } الخ، بيَّن حُسن حال المؤمنين، جمعاً بين الترهيب والترغيب فقال: { إِنَّ المتقين } أي: الكفر والمعاصي { في جناتٍ } عظيمة { ونَهَرٍ } أي: أنهار كذلك، والإفراد للاكتفاء بذكر الجنس، مراعاة للفواصل، وقرئ: \" ونُهُر \" جمع \" نَهَر \" ، كأَسَد وأُسُد\n { في مقعد صدقٍ } في مكان مرضيّ، وقرئ \" فيمقاعد صدق \" ، { عند مليكٍ مقتدرٍ } أي: مقربين عند مليك قادر لا يُقادَر قدر ملكه وسلطانه، فلا شيء إلا وهو تحت ملكوته، سبحانه، ما أعظم شأنه\n والعندية: عندية منزلة وكرامة وزلفى، لا مسافة ولا محاسّة\n الإشارة: هذه الآية وأشباهها هي التي غسلت القلوب من الأحزان والأغيار، وأراحت العبد من كدّ التدبير والاختيار لأنّ العاقل إذا علمَ عِلم يقين أن شؤونه وأحواله، وكل ما ينزل به، قد عمّه القدر، لا يتقدّم شيء عن وقته ولا يتأخر، فوَّض أمره إلى الله، واستسلم لأحكام مولاه، وتلقى ما ينزل به من النوازل بالرضا والقبول، خيراً كان أو شرّاً، كما قال الشاعر:\n\n\n\nوقال آخر:\n\nوقوله تعالى: { وما أَمْرُنا إِلا واحدةٌ\n\n } الخ، هذا في عالمَ الأمر، ويُسمى عالم القدرة، وأما في عالم الخلق، ويسمى عالَم الحكمة، فجُلّه بالتدريج والترتيب، ستراً لأسرار الربوبية، وصوناً لسر القدرة الإلهية، ليبقى الإيمان بالغيب، فتظهر مزية المؤمن؟ ويُقال لأهل العناد المُتجبرة: ولقد أهلكنا أشياعكم إما بالهلاك الحسي، أو المعنوي، كالطرد والبُعد، فهل من متعظٍ، يرجع عن عناده؟ وكل شيء فعلوه في ديوان صحائفهم، وكل صغير وكبير من أعمال العباد مسطورة في العلم القديم\n إنَّ المتقين ما سوى الله، في جنات المعارف، وأنهار العلوم والحِكَم، في مقعد صدق، هو حضرة القدس، ومحل الأنس، عند مليك مقتدر\n قال الورتجبي: مقامات العندية جنانها زفارف الأنس، وأنهارها أنوار القدس، أجلسهم الله في بساط الزلفة والمداناة، التي لا يتغير صاحبها بعلة القهر، ولا يزول عنها بالتستُّر والحجاب لذلك سماه \" مقعد صدق \" أي: محل كرامة دائمة، ومزية قائمة، ومواصلة سرمدية، والله مقدّر قادر\n انظر تمام كلامه\n وبالله التوفيق، وهو الهادي إلى سواء الطريق، وصلّى الله على سيدنا محمد وآله وصحبه وسلم\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:10",
      "similarity": 0.8020681149824469
    },
    {
      "verse": "37:83",
      "similarity": 0.7850038451442523
    },
    {
      "verse": "6:159",
      "similarity": 0.6351852138304097
    },
    {
      "verse": "24:19",
      "similarity": 0.5926277035680223
    },
    {
      "verse": "30:32",
      "similarity": 0.4535437953045717
    }
  ]
}