{
  "chapter": "القمر",
  "text": "مهطعين الى الداع يقول الكفرون هذا يوم عسر",
  "translations": [
    {
      "translation": "They will hasten forward to the caller, gazes fixed. And the unbelievers will say: \"This is the day of untold woe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall be hurrying forth towards the caller, and the unbelievers (who had once denied this Day), will say: “This is a woeful Day.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These disbelievers will say, \"This is a hard day\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rushing towards the caller; the disbelievers will say, “This is a tough day.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hastening towards the caller. The disbelievers will say: \"This is a hard Day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hastening to the inviter. The unbelievers shall say: This is a hard day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "running with outstretched necks to the Caller. The unbelievers shall say, 'This is a hard day!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hastening toward the summoner; the disbelievers say: This is a hard day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "hastening towards the Crier. Those who deny the truth will cry, \"This is such a hard day!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hastening toward the summoner. The infidels will say: this is a day diffrcult.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "scrambling toward the summoner. The faithless will say, ‘This is a hard day!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hastening, with eyes transfixed, towards the Caller!- \"Hard is this Day!\", the Unbelievers will say.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hastening towards the caller, the disbelievers will say: \"This is a hard Day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "running (with their necks extended) to the Caller. The unbelievers will say: 'This is indeed a harsh Day'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Scrambling towards the Caller, the disbelievers will say, “This is a difficult Day.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Racing ahead toward the Caller. The disbelievers will say, \"This is a difficult Day.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[54:8] scrambling, hastening with their necks stretched out, toward the Summoner. The disbelievers, among them, will say: ‘This is a hard day!’, a difficult one for disbelievers — as is stated in [sūrat] al-Muddaththir, a day of hardship for the disbelievers [Q. 74:9-10].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hastening towards the Summoner) to find out about what he is going to command them; (the disbelievers say) on the Day of Judgement: (This is a hard day) on them, that is. 627\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مُّهْطِعِينَ إِلَى ٱلدَّاعِ } معناه مُسرعون\n ويقال بَارِعون\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ مهطعين إلى الداع } على كلا التأويلين لانقيادها طوعاً وكرهاً { يقول الكافرون } أي: المحجبون عن الدين أو الحق { هذا يوم عسر } لنزوعهم إلى اللذات والشهوات الحسيّة وشوقهم إليها وضراوتهم بها، فأما غير المحجوب فأيسر شيء عليه الموت الطبيعي والإرادي جميعاً\n { ففتحنا أبواب } سماء العقل بعلم منصب إلى العالم السفلي بقوة، أي: نكسنا عقولهم بالميل إلى الدنيا والاشتغال بتدابير الأمور الجزئية وترتيب اللذات الحسية والانهماك في أمر المعاش وصرف عملها فيه ووقوفها معها واحتجابها بها عن الأمور الأخروية المؤدّي إلى هلاكهم، فهو كقوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفيتوجهون { مُّهْطِعِينَ } مسرعين { إِلَى ٱلدَّاعِ } المنادي، مادين أعناقهم نحوه، ومن شدة خوفهم وهولهم، ليعلموا لما يدعوهم، ومن شدة تلك الساعة، ونهاية أهوالها وفظاعتها { يَقُولُ ٱلْكَافِرُونَ } في نجواهم، وهواجس نفوسهم: { هَـٰذَا يَوْمٌ عَسِرٌ } [القمر: 8] صعب في غاية الصعوبة والفظاعة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم وصف خروجهم من القبور، فقال: { مهطِعين إِلى الداعِ } مسرعين مَادِّي أعناقهم إليه، أو ناظرين إليه، { يقول الكافرون } استئناف بياني، وقع جواباً عما نشأ من وصف اليوم بالأهوال، وأهله بسوء الحال، كأنّ قائلاً قال: فماذا يكون حينئذ؟ فقال: { يقول الكافرون هذا يوم عِسِرٌ } صعب شديد\n وفي إسناد هذا القول إلى الكفار تلويح بأنّ المؤمنين ليسوا في تلك المرتبة\n والله تعالى أعلم\n الإشارة: اقتربت ساعة الفتح لمَن جَدّ في السير، ولازم صحبةَ أهل القرب، قال القشيري: الساعة ساعتان: كبرى، وهي عامة، وصغرى، وهي خاصة بالنسبة إلى السالك إلى الله، برفع الأوصاف البشرية، وقطع العلائق الطبيعية\n\n\nقال: وإليه الإشارة بقوله صلى الله عليه وسلم:\n\n \" مَن مات فقد قامت قيامته \" \n\nراجعة إلى الساعة الصغرى\n هـ\n أي: مَن مات عن رؤية نفسه قامت قيامته بلقاء ربه وشهوده\n وقوله تعالى: { وانشق القمر } أي: قمر الإيمان فإنه إذا أشرقت عليه شمس العيان، لم يبقَ لنوره أثر، ليس الخبر كالعيان، وإن يَرَوا - أي: أهل الغفلة والحجاب - آيةً تدل على طلوع شمس العيان على العبد المخصوص، يُعرضوا منكرين، ويقولوا: { هذا سحر مستمر\n\n\n } الآية، وكل أمر قدّره الحق - تعالى في الأزل، من أوقات الفتح أو غيره، مستقر، يستقر ويقع في وقته، لا يتقدّم ولا يتأخّر، فلا ينبغي للمريد أن يستعجل الفتح قبل إبانه، فربما عُوقب بحرمانه، ولقد جاءهم من الأخبار عن منكري أهل الخصوصية، وما لحق أهلَ الانتقاد من الهلاك أو الطرد والبُعد ما فيه مزدجر، كما فعل بابن البراء وأمثاله، حكمة من الله بالغة، وسنة ماضية، يقول:\n\n \" من آذى لي وليّاً فقد آذن بالحرب \" \n\nفما تُغن النُذر إذا سبق الخذلان، فتولّ أيها السالك عنهم، وعن خوضهم، واشتغل بالله عنهم { فسيكفيكهم الله وهو السميع العليم } واذكر الموت وما بعده، فإنه حينئذ يظهر عز الأولياء، وذل الأغبياء، يقولون: هذا يوم عسر على مَن طغى وتجبّر\n ثم سَرَدَ قصص الأنبياء، تسليةً لرسوله صلى الله عليه وسلم وتفسيراً لقوله: { ولقد جاءهم من الأنباءِ } فقال: { كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ }\n\n",
      "translations": []
    }
  ]
}