{
  "chapter": "القمر",
  "text": "كذبت قبلهم قوم نوح فكذبوا۟ عبدنا وقالوا۟ مجنون وازدجر",
  "translations": [
    {
      "translation": "The people of Noah had denied before them, and had called Our votary a liar, and said: \"He is possessed,\" and repulsed him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before them Noah's people also gave the lie (to his Message). They rejected Our servant as a liar, saying: “He is a madman”; and he was rebuffed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Noah, who lived before them, had also rejected (Our guidance). They rejected Our servant and said, \"He is an insane person so let us drive him away\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before these, the people of Nooh denied and they belied Our bondman and said, “He is a madman” and rebuffed him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Nuh denied (their Messenger) before them. They rejected Our servant and said: \"A madman!\" Wazdujir.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before them the people of Nuh rejected, so they rejected Our servant and called (him) mad, and he was driven away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Noah cried lies before them; they cried lies to Our servant, and said, 'A man possessed!' And he was rejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The folk of Noah denied before them, yea, they denied Our slave and said: A madman; and he was repulsed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Noah denied [the truth] before them. They belied Our messenger saying, \"He is mad!\" He was rebuffed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There belied before them the people of Nuh. So they belied Our bondman Nuh and said: `a madman;' and moreover he was reproven.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Noah impugned before them. So they impugned Our servant and said, ‘A crazy man,’ and he was reviled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before them the People of Noah rejected (their messenger): they rejected Our servant, and said, \"Here is one possessed!\", and he was driven out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Nuh (Noah) denied (their Messenger) before them, they rejected Our slave, and said: \"A madman!\" and he was insolently rebuked and threatened.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Long) before them the nation of Noah belied. They belied Our worshiper saying: 'Mad' and he was reprimanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Before them the people of Noah disbelieved. They rejected Our servant, and said, “Crazy,” and he was rebuked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Noah denied before them, and they denied Our servant and said, \"A madman,\" and he was repelled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[54:9] The people of Noah denied (kadhdhabat has feminine inflection on account of the import [referring to a feminine noun], qawm, ‘tribe’) before them, before Quraysh. Thus they denied Our servant, Noah, and said, ‘A madman!’, and he was reviled: they repulsed him with insults and in other ways.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The folk of Noah denied) Noah (before them) before your folk, Muhammad, (yea, they denied Our slave) Noah (and said: A madman) bewitched; (and he was repulsed) he was deterred from what he brought to them, crying in his face: \"you have lost your mind!\".\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَقَالُواْ مَجْنُونٌ وَٱزْدُجِرَ } معناه أَسفرَ جنونهُ\n ويقال: استطر\n والمُزدجرُ: المُنتهى المُتعظُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه تسليةً لحبيبه صلى الله عليه وسلم حين كذبه قومه، حاكياً إياه صلى الله عليه وسلم عن أحوال الماضين تسليةً وإزالةً لحزنه: { كَذَّبَتْ قَبْلَهُمْ } أي: قبل قومك { قَوْمُ نُوحٍ } أي: لا تحزن يا أكمل الرسل من تكذيب هؤلاء المكذبين بك، ولا تغتم من أذياتهم؛ إذ ما هي ببدع منهم بالنسبة إليك، بل تذكر تكذيب قوم نوح { فَكَذَّبُواْ عَبْدَنَا } أي: كيف كذبوا أخاك نوحاً { وَقَالُواْ } له حين دعوتهم إلى الإيمان: هو { مَجْنُونٌ } مخبط، مختل العقل والرأي { وَٱزْدُجِرَ } [القمر: 9] وزجر؟ لأجل دعوته وتبليغه إياهم إلى حيث لطمه كلُّ من يصل إليه، ورماه بالحجارة كل من يمر عليه، فصبر على أذاهم، وبالغ في دعوته إياهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { كذبت قبلهم } أي: قبل أهل مكة { قومُ نوح فكذَّبوا عبدنا } نوحاً عليه السلام\n ومعنى تكرار التكذيب: أنهم كذَّبوا تكذيباً عقب تكذيب، كلما خلا منهم قرن مكذِّب، جاء عقبه قرن آخر مكذِّب مثله، وقيل: كذبت قوم نوح الرسل، { فكذَّبوا عبدنا } لأنه من جملتهم\n وفي ذكره عليه السلام بعنوان العبودية مع إضافته لنون العظمة تفخيم له عليه السلام ورفع لمحله، وزيادة تشينع لمكذِّبيه، { وقالوا مجنون } أي: لم يقتصروا على مجرد التكذيب، بل نسبوه للجنون، { وازْدُجِرْ } أي: زجر عن أداء الرسالة بالشتم، وهدّد بالقتل، أو: هو من جملة قولهم، أي: قالوا: هو مجنون وقد ازدجرته الجن، أي: تخبّطته وذهبت بلُبه",
      "translations": []
    }
  ]
}