{
  "chapter": "الرحمن",
  "text": "فباى ءالاء ربكما تكذبان",
  "translations": [
    {
      "translation": "How many favours of your Lord will then both of you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which of the bounties of your Lord will you twain – you men and jinn – then deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Jinn and mankind) - which of the favors of your Lord do you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So O men and jinns! Which favour of your Lord will you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then which of the blessings of your Lord will you both deny\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which then of the bounties of your Lord will you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O which of your Lord's bounties will you and you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which is it, of the favours of your Lord, that ye deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which of your Lord's wonders would you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which, then, of the benefits of your Lord, will ye twain belie?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So which of your Lord’s bounties will you both deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then which of the favours of your Lord will ye deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then which of the Blessings of your Lord will you both (jinns and men) deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which favors of your Lord will you both (humans and jinn) belie?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So which of your Lord’s marvels will you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So which of the favors of your Lord would you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[55:13] So which of your Lord’s favours, graces, will you deny? (tukadhdhibān is mentioned thirty one times; the interrogative is meant [to be understood] as an affirmative, judging by what al-Hākim [al-Naysābūrī] reported [by way of an isnād] from Jābir [b. ‘Abd Allāh al-Ansārī], who said, ‘The Messenger of God (s) was reciting surāt al-Rahmān to us, and when he completed it, he said, “What is wrong with you that you have been silent [throughout]? Verily the jinn are more responsive than you. Not once did I recite this verse to them — So which of your Lord’s favours will you deny? — but that they said, ‘Not one of your graces, our Lord, do we deny, for [all] praise belongs to You’ ”).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Which is it, of the favours of your Lord, that ye deny) and claim that they are not from Allah, jinn and humans? This is addressed to all human beings except Muhammad (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لما عدَّ سبحانه نبذاً من نعمه الشاملة على عموم الأنام، خاطب المكلفين منهم على سبيل الامتنان، وهم الثقلان المجبولان على فطرة التوحيد، واستعداد الإيمان والعرفان، فقال: { فَبِأَيِّ آلاۤءِ رَبِّكُمَا } ونعماء موجدكما ومربيكما { تُكَذِّبَانِ } [الرحمن: 13] أيها المغموران في نعمه، المستغرقان في بحار جوده وكرمه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فَبأيّ آلاءِ رِّبكما } أي: نِعَمَه التي عَدَّدها من أول السورة، { تُكَذِّبان } والخطاب للثقلين المدلول عليهما بقوله تعالى: { للأنام } وينطق به قوله: { أيه الثقلان } والفاء لترتيب الإنكار والتوبيخ على ما فصّل من فنون النعماء، وصنوف الآلاء، الموجبة للإيمان والشكر، والتعرُّض لعنوان الربوبية المنبئة عن المالكية والتربية، مع الإضافة إلى ضميرهم لتأكيد النكير وتشديد التوبيخ\n ومعنى تكذيبهم آلائه تعالى: كفرهم بها، وإمّا بإنكار كونه نعمة في نفسه، كتعليم القرآن وما يستند إليه من النعم الدينية، وإمّا بإنكاره كونه من الله تعالى مع الاعتراف بكونه نعمة في نفسه، كالنعم الدنيوية الواصلة إليهم بإسناده إلى غيره تعالى، اشتراكاً أو استقلالاً، صريحاً أو دلالة، فإنَّ إشراكهم لآلهتهم معه تعالى في العبادة من دواعي إشراكهم لها به تعالى\n انظر أبا السعود\n أي: إذا كان الأمر كما فصّل فبأيّ فرد من أفراد نعمه تعالى تُكذِّبان، مع أنّ كُلاًّ منها ناطق بالحق، شاهد بالصدق؟ والله تعالى أعلم\n الإشارة: اعلم أنَّ \" الرحمن \" من الأسماء الخاصة بالذات العلية، لا يُوصف به غيره تعالى، لا حقيقة ولا مجازاً لأنها مقتضية لنعمة الإيجاد، ولا يصح مِن غيره، بخلاف \" الرحيم \" فإنه مقتضٍ لنعمة الإمداد، وقد يصح من غيره تعالى مجازاً، فلذلك يجوز أن يُوصف العبد بالرحيم، ولا يوصف بالرحمن، ثم إنَّ الرحمة المشتمل عليها الرحمن على قسمين: رحمة ذاتية لا تُفارق الذات، ورحمة صفاتية يقع بها الإمداد للخلق، فيرحَم بها مَنْ يشاء من عباده، وتسمى الرحمة الذاتية رحمانية، ولمَّا كانت لا تُفارق الذات وقع التعبير بها في الاستواء، فقال تعالى:\n\n[طه: 5]،\n\n[الفرقان: 59]، وإليه أشار في الحِكَم بقوله: يا مَن استوى برحمانيته على عرشه، فصار العرش غيباً في رحمانيته\n\n\n الخ\n وأما الرحمة الصفاتية، وهي التي يقع بها الإمداد، فتتنوع بتنوُّع الأسماء الحسنى، وهي تسعة وتسعون\n أمّا الأسماء الجمالية فالرحمة فيها ظاهرة، وأمّا الأسماء الجلالية فالرحمة فيها: عدم انفكاك لطف الله عن قدره، والرحمة الذاتية هي المُوفية مائة، ولذلك قال صلى الله عليه وسلم:\n\n \" إنّ اللّهَ تعالى خَلَقَ مائةَ رحمة، أَمسك عنده تسعةً وتسعين، وأنزل واحدةً إلى الدنيا، بها يتراحم الخلقُ \" \n\nالحديث، أو كما قال عليه السلام\n ولمَّا كان القرآن من أجلّ النِعَم عبّر عن تعليمه بالرحمانية، التي هي من الصفات الخاصة لأنّ القرآن مُظهر لأوصاف الذات وأسرارها وأفعالها، وكاشف لحقائقها، عند مَن فُتحت بصيرته\n وقوله تعالى: { خَلَقَ الإِنسانَ } أي: أظهره من سر اللطافة إلى مظهر الكثافة جاهلاً به من جهة الجسمانية، ثم { علَّمه البيان } أي: بيان السير إلى معرفته، بأن ركّب فيه العقل المميز، ونَصَبَ له مظاهر يتعرّف بها، وبعث له دالاًّ يدله، ويُعلمه أسرار الربوبية وآداب العبودية، فلا يزال يُحاذيه، ويسير به حتى يستنير قمر توحيده، وتُشرق شمس عرفانه، وإليه الإشارة بقوله: { الشمس والقمر بُحسبان } أي: يجريان بحسب معلوم، في زيادة نور التوحيد ونقصانه، على حسب استعداد العبد وتوجهه\n\n\nقال القشيري بعد كلام: وكذلك شموس المعارف، وأقمار العلوم - في طلوعها في أوْج القلوبِ والأسرار - في حكم الله تعالى وتقديره حسابٌ معلومٌ، يُجْريهما على ما سبق به الحُكْمُ\n هـ\n والنجم والشجر يسجدان، أي: ونجم نور العقل الطبيعي، وشجر الفكر الاعتباري يخضعان ويضمحلان عند سطوع شمس نهار العرفان، وأمَا نور العقل الوهبي، والفكر الاستبصاري، فيطويان الكونَ طيّاً لانَّ نورهما مستمد من العقل الأكبر، وهو أول الفيض الإلهي، المتدفق من بحر الجبروت، وسماء الأرواح، رَفَعَا عن لوث عالم الأشباح، وهو محل شهود أسرار الذات وأنوار الصفات، وتجليات الأنبياء والرسل، فمَن ترقّى إليه لا تغيب عنه أرواح الأنبياء وذواتهم، فالمتجلي واحد\n ووضع الميزان على النفوس الظلمانية، ألاَّ تَطْغَوا في الميزان، بتعديّ حدود الرياضة والمجاهدة، وأقيموا عليها الوزن بالقسط، ولا تُخسروا الميزان بإهمالها في هواها وحظوظها\n والأرض، أي: أرض البشرية وضعها لقيام وظائف العبودية، التي رتّبها للأنام، فيها فاكهة العلوم الوهبية إن صفت، ونَخْل علوم الشريعة ذات الأكمام، وهي البراهين التي تستخرج بها مسائلها، فمَن وقف مع قشر الأكمام كان مقلِّداً\n ومَن نفذ إلى لُبها كان مجتهداً منِ نِحريراً\n وقال القشيري: { والنخلُ ذات الأكمام } من فواكه الوحدانيات المستورة عن الأغيار، المستورة عن غير أهلها\n ثم قال: { والحب ذو العصف } من حبة المحبة الذاتية، غير القابلة للتغيُّر والاستبدلال، المشتملة على الأرزاق المكتنفة بالمعارف والحاقئق والحِكِم\n هـ\n والريحان هو قوت الأرواح من اليقين، أو نسيم الأذواق والوجدان، { فبأي آلاء ربكما تُكذّبان } أيها الثقلان، أو أيها النفس والروح إذ كل منهما فاز بأمنيته، ووصل إلى نهاية ما اشتهاه، إذا عمل بما تقدّم، وأصغى بأُذن قلبه إلى ما عددناه\n وبالله التوفيق\n ثم ذكر أو نشأة الثقلين، فقال: { خَلَقَ ٱلإِنسَانَ مِن صَلْصَالٍ كَٱلْفَخَّارِ }\n\n",
      "translations": []
    }
  ]
}