{
  "chapter": "الرحمن",
  "text": "فباى ءالاء ربكما تكذبان",
  "translations": [
    {
      "translation": "So which of your Lord's blessings do you both then deny?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many favours of your Lord will then both of you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which of the bounties of your Lord will you twain – you men and jinn – then deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Jinn and mankind) - which of the favors of your Lord do you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So O men and jinns! Which favour of your Lord will you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then which of the blessings of your Lord will you both deny\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which then of the bounties of your Lord will you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O which of your Lord's bounties will you and you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which is it, of the favours of your Lord, that ye deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which of your Lord's wonders would you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which, then, of the benefits of your Lord, will ye twain belie?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So which of your Lord’s bounties will you both deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then which of the favours of your Lord will ye deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then which of the Blessings of your Lord will you both (jinns and men) deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which favors of your Lord will you both (humans and jinn) belie?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So which of your Lord’s marvels will you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So which of the favors of your Lord would you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[55:13] So which of your Lord’s favours, graces, will you deny? (tukadhdhibān is mentioned thirty one times; the interrogative is meant [to be understood] as an affirmative, judging by what al-Hākim [al-Naysābūrī] reported [by way of an isnād] from Jābir [b. ‘Abd Allāh al-Ansārī], who said, ‘The Messenger of God (s) was reciting surāt al-Rahmān to us, and when he completed it, he said, “What is wrong with you that you have been silent [throughout]? Verily the jinn are more responsive than you. Not once did I recite this verse to them — So which of your Lord’s favours will you deny? — but that they said, ‘Not one of your graces, our Lord, do we deny, for [all] praise belongs to You’ ”).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَبِأَيِّ آَلَاءِ رَبِّكُمَا تُكَذِّبَانِ (13(الفاء للتفريع على ما تقدم من المنن المدمجة مع دلائل صدق الرسول صلى الله عليه وسلم وحقّية وَحي القرآن ، ودلائل عظمة الله تعالى وحكمته باستفهام عن تعيين نعمة من نعم الله يتأتى لهم إنكارها ، وهو تذييل لما قبله .و ( أيِّ ( استفهام عن تعيين واحد من الجنس الذي تضاف إليه وهي هنا مستعملة في التقرير بذكر ضِدّ ما يقربه مثل قوله : { ألم نشرح لك صدرك } \\[ الشرح : 1 \\] . وقد بينته عند قوله تعالى : { يا معشر الجن والإنس ألم يأتكم رسل منكم } في سورة الأنعام ( 130 ( ، أي لا يستطيع أحد منكم أن يجحد نعم الله .والآلاء : النعم جمع : إلْي بكسر الهمزة وسكون اللام ، وأَلْي بفتح الهمزة وسكون اللام وياء في آخره ويقال أَلْوُ بواو عوض الياء وهو النعمة .وضمير المثنى في ربكما تكذبان } خطاب لفريقين من المخاطبين بالقرآن . والوجه عندي أنه خطاب للمؤمنين والكافرين الذين ينقسم إليهما جنس الإِنسان المذكور في قوله : { خلق الإنسان } \\[ الرحمن : 3 \\] وهم المخاطبون بقوله : { ألا تطغوا في الميزان } \\[ الرحمن : 8 \\] الآية والمنقسم إليهما الأنام المتقدم ذكره ، أي أن نعم الله على الناس لا يجحدها كافر بَلْهَ المؤمن ، وكل فريق يتوجه إليه الاستفهام بالمعنى الذي يناسب حاله .والمقصود الأصلي : التعريض بالمشركين وتوبيخهم على أن أشركوا في العبادة مع المنعِم غيرَ المنعِم ، والشهادةُ عليهم بتوحيد المؤمنين ، والتكذيب مستعمل في الجحود والإِنكار .وقيل التثنية جرت على طريقة في الكلام العربي أن يخاطبوا الواحد بصيغة المثنى كقوله تعالى : { ألقيا في جهنم كل كفار عنيد } \\[ ق : 24 \\] ذكر ذلك الطبري والنسفي .ويجوز أن تكون التثنية قائمة مقام تكرير اللفظ لتأكيد المعنى مثل : لَبيك وسعديك ، ومعنى هذا أن الخطاب لواحد وهو الإنسان .وقال جمهور المفسرين : هو خطاب للإنس والجن ، وهذا بعيد لأن القرآن نزل لخطاب الناس ووعظهم ولم يأت لخطاب الجن ، فلا يتعرض القرآن لخطابهم ، وما ورد في القرآن من وقوع اهتداء نفر من الجن بالقرآن في سورة الأحقاف وفي سورة الجن يحمل على أن الله كلّف الجن باتباع ما يتبين لهم في إدراكهم ، وقد يُكلف الله أصنافاً بما هم أهل له دون غيرهم ، كما كلّف أهل العلم بالنظر في العقائد وكما كلّفهم بالاجتهاد في الفروع ولم يكلف العامة بذلك ، فما جاء في القرآن من ذكر الجن فهو في سياق الحكاية عن تصرفات الله فيهم وليس لتوجيه العمل بالشريعة .وأما ما رواه الترمذي عن جابر بن عبد الله الأنصاري «أن النبي صلى الله عليه وسلم خرج على أصحابه فقرأ عليهم سورة الرحمن وهم ساكتون فقال لهم \" لقد قرأتُها على الجن ليلةَ الجن فكانوا أحسن مردوداً منكم ، كنت كلما أتيت على قوله : { فبأي ألاء ربكما تكذبان } قالوا : لا بشيء من نعمك ربنا نكذب فلك الحمد \" . قال الترمذي : هو حديث غريب وفي سنده زهير بن محمد وقد ضعفه البخاري وأحمد بن حنبل .وهذا الحديث لو صح فليس تفسيراً لضمير التثنية لأن الجن سمعوا ذلك بعد نزوله فلا يقتضي أنهم المخاطبون به وإنما كانوا مقتدين بالذين خاطبهم الله ، وقيل الخطاب للذكور والإِناث وهو بعيد .والتكذيب مستعمل في معنى الجحد والإِنكار مجازاً لتشنيع هذا الجحد .وتكذيب الآلاء كناية عن الإِشراك بالله في الإِلهية . والمعنى : فبأي نعمة من نعم الله عليكم تنكرون أنها نعمة عليكم فأشركتم فيها غيره بَلْه إنكار جميع نعمه إذ تعبدون غيره دواماً .\n\n",
      "translations": [
        {
          "translation": "(Which is it, of the favours of your Lord, that ye deny) and claim that they are not from Allah, jinn and humans? This is addressed to all human beings except Muhammad (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:16",
      "similarity": 1.0
    },
    {
      "verse": "55:18",
      "similarity": 1.0
    },
    {
      "verse": "55:21",
      "similarity": 1.0
    },
    {
      "verse": "55:23",
      "similarity": 1.0
    },
    {
      "verse": "55:25",
      "similarity": 1.0
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/055013.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/055013.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/55:13.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}