{
  "chapter": "الرحمن",
  "text": "مرج البحرين يلتقيان",
  "translations": [
    {
      "translation": "He has let loose the two seas, converging together,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has set two seas in motion that flow side by side together,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He unleashed the two seas so that they merge together,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has made the two oceans meet each other,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has set flowing two seas that appear to meet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has Maraja the two seas meeting together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has made the two seas to flow freely (so that) they meet together:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He let forth the two seas that meet together,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath loosed the two seas. They meet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has set the two oceans in motion, converging together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He hath let loose the two seas.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He merged the two seas, meeting each other.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has let free the two bodies of flowing water, meeting together:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has let loosed the two seas (the salt water and the sweet) meeting together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has let forth the two seas, they meet together,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He merged the two seas, converging together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He released the two seas, meeting [side by side];\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[55:19] He has loosed the two waters, the sweet and the salty; [and so] they meet, in the perception of the eye.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمَرَجَ الْبَحْرَيْنِ يَلْتَقِيَانِ (19(خبر آخر عن { الرحمن } \\[ الرحمن : 1 \\] قصد منه العبرة بخلق البحار والأنهار ، وذلك خلق عجيب دال على عظمة قدرة الله وعلمه وحكمته .ومناسبة ذكره عقب ما قبله أنه لما ذُكر أنه سبحانه رب المشرقين ورب المغربين وكانت الأبحر والأنهار في جهات الأرض ناسب الانتقال إلى الاعتبار بخلقهما والامتنان بما أودعهما من منافع الناس .والمرج : له معان كثيرة ، وأولاها في هذا الكلام إنه الإِرسال من قولهم : «مرج الدابة» إذا أرسلها ترعى في المَرج ، وهو الأرض الواسعة ذات الكلأ الذي لا مالك له ، أي : تركها تذهب حيث تشاء .والمعنى : أرسل البحرين لا يحبس ماءهما عن الجري حاجز . وهذا تهيئة لقوله بعد { يلتقيان بينهما برزخ لا يبغيان } .والمراد : أنه خَلَقهما ومرَجَهما ، لأنه ما مَرَجَهما إلا عقب أن خلقهما .ويلتقيان : يتصلان بحيث يصب أحدهما في الآخر .والبحر : الماء الغامر جزءاً عظيماً من الأرض يطلق على المالح والعذب .والمراد تثنية نوعي البحر وهما البحر الملح والبحر العذب . كما في قوله تعالى : { وما يستوي البحران هذا عذب فرات سائغ شرابه وهذا ملح أجاج } \\[ فاطر : 12 \\] والتعريف تعريف العهد الجنسي .فالمقصود ما يعرفه العرب من هذين النوعين وهما نهر الفرات وبحر العجم المسمّى اليوم بالخليج الفارسي . والتقاؤهما انصباب ماء الفُرات في الخليج الفارسي . في شاطىء البَصرة ، والبلادُ التي على الشاطىء العربي من الخليج الفارسي تعرف عند العرب ببلاد البَحْريْن لذلك .والمراد بالبرزخ الذي بينهما : الفاصل بين الماءين الحلو والملح بحيث لا يغير أحد البحرين طعم الآخر بجواره . وذلك بما في كل ماء منهما من خصائص تدفع عنه اختلاط الآخر به . وهذا من مسائل الثقل النوعي . وذكر البرزخ تشبيه بليغ ، أي بينهما مثل البرزخ وهو معنى { لا يبغيان } ، أي لا يبغي أحدهما على الآخر ، أي لا يغلب عليه فيُفسدَ طعمه فاستعير لهذه الغلبة لفظ البغي الذي حقيقته الاعتداء والتظلم .ويجوز أن تكون التثنية تثنية بحرَيْن ملحين معينين ، والتعريف حينئذٍ تعريف العهد الحضوري ، فالمراد : بحران معروفان للعرب . فالأظهر أن المراد : البحر الأحمر الذي عليه شطوط تهامة مثل : جُدّة ويُنبع النخل ، وبحر عُمان وهو بحر العرب الذي عليه حَضْرموت وعَدَن من بلاد اليمن .\n\n",
      "translations": [
        {
          "translation": "He hath loosed the two seas) the sweet and the salty. (They meet) without mixing.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَرَجَ ٱلْبَحْرَيْنِ يَلْتَقِيَانِ بَيْنَهُمَا بَرْزَخٌ لاَّ يَبْغِيَانِ } ، { يَخْرُجُ مِنْهُمَا الُّلؤْلُؤُ وَالمَرْجَانُ } معناه المخَلِيُّ: من الماءِ يلتقيان من العذبِ والمالحِ، وبينهما حاجزٌ من الله تعالى، فلا يَختلطان، لا يَبغي الملحُ على العذبِ، ولا العذبُ على الملحِ\n واللؤلُؤ: العظامُ\n والمَرجانُ: الصِّغارُ من اللؤلؤ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {the two seas meet but are separated by a barrier that they cannot cross} - {from them emerge pearls and coral} - means that the water from the fresh and the salt meet but are separated by a barrier from Allah, so they do not mix, the salt does not yearn for the fresh, and the fresh does not yearn for the salt.\n\n\nAnd the pearls: the bones.\n\n\nAnd pearls: the small ones among the pearls.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ مرج البحرين } بحر الهيولى الجسمانية الذي هو الملح الأجاج وبحر الروح المجرد الذي هو العذاب الفرات { يلتقيان } في الوجود الإنساني { بينهما برزخ } هو النفس الحيوانية التي ليست في صفاء الأرواح المجردة ولطافتها ولا في كدورة الأجساد الهيولانية وكثافتها { لا يبغيان } لا يتجاوز حدّهما حدّه فيغلب على الآخر بخاصيته فلا الروح يجرّد البدن ويمزج به ويجعله من جنسه ولا البدن يجمد الروح ويجعله مادياً\n سبحان خالق الخلق القادر على ما يشاء\n { يخرج منهما } بتركيبهما والتقائهما لؤلؤ العلوم الكلية ومرجان العلوم الجزئية\n أي: لؤلؤ الحقائق والمعارف ومرجان العلوم النافعة كالأخلاق والشرائع\n { وله الجوار } أي: أوضاع الشريعة ومقامات الطريقة التي يركبها السالكون\n السائرون إلى الله في لجّة هذا البحر المريح\n فينجون ويعبرون إلى المقصد\n وتشبيهها بالأعلام إشارة إلى شهرتها وكونه معروفة كما تسمى شعائر الله ومعالم الدين\n { المنشآت } أي: المرفوعات الشرع وشرعها الأشواق والإرادات التي تجري عند ارتفاعها وتعلقها بالعالم العلوي بقوة رياح النفحات الإلهية سفينة الشريعة والطريقة براكبها إلى مقصد الكمال الحقيقي الذي هو الفناء في الله\n ولهذا قال عقيبه: { كل من عليها فان } أي: كل من على الجواري السائرة واصل إلى الحق بالفناء فيه\n أو كل من على أرض الجسد من الأعيان المفصلة كالروح والعقل والقلب والنفس ومنازلها ومقاماتها ومراتبها\n فانٍ عند الوصول إلى المقصود { ويبقى وجه ربّك } الباقي بعد فناء الخلق\n أي: ذاته مع جميع صفاته { ذو الجلال } أي: العظمة والعلوّ بالاحتجاب بالحجب النورانية والظلمانية والظهور بصفة القهر والسلطنة { والإكرام } بالقرب والدنو في صور تجليات الصفات وعند ظهورالذات بصفة اللطف والرحمة\n { يسأله من في السموات } من أهل الملكوت والجبروت { ومن في الأرض } من الجنّ والإنس\n والمراد: يسأله كل شيء فغلب العقلاء وأتى بلفظ من أي كل شيء يسأله بلسان الاستعداد والافتقار دائماً\n { كل يوم هو في شأن } بإفاضة ما يناسب كل استعداد ويستحقه فله كل وقت في كل خلق شأن بإفاضة ما يستحقه ويستأهله باستعداده\n فمن استعدّ بالتصفية والتزكية للكمالات الخيرية والأنوار يفيضها عليه مع حصول الاستعداد\n ومن استعدّ بتكدير جوهر نفسه بالهيئات المظلمة والرذائل ولوث العقائد الفاسدة\n والخبائث للشرور والمكاره وأنواع الآلام والمصائب والعذاب والوبال يفيضها عليه مع حصول الاستعداد\n وهذا معنى قوله: { سنفرغ لكم أيُّه الثقلان } لأنه تهديد وزجر عن الأمور التي بها يستحق العقاب\n وسميا ثقلين لكونهما سفليين مائلين إلى أرض الجسم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ هو بمقتضى قدرته { مَرَجَ ٱلْبَحْرَيْنِ } أي: أرسل وأطلق بحر الوجود والعدم إلى حيث { يَلْتَقِيَانِ } [الرحمن: 19] أي: يتمازجان ويختلطان\n بحيث لا يتمايزان عند المحجوب الفاقد عن الكشف والشهود؟!\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { مَرَجَ البحرين يلتقيان } أي: أرسل البحر الملح والبحر العذب متجاورين متلاقيين\n لا فصل بين الماءين بإسماك أحدهما عن الآخر في مرأى العين\n قال في الحاشية: ويُقرب ما ذكره ما هو مشهود في الريف مع الماء\n فاعتبر به\n وبالأبيض من البيضة مع الأصفر منها\n وقيل: أرسل بحري فارس والروم يلتقيان في المحيط لانهما خلجان يتشعبان منه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:15",
      "similarity": 0.873243712563195
    },
    {
      "verse": "50:5",
      "similarity": 0.8373013232142473
    },
    {
      "verse": "55:22",
      "similarity": 0.618328973126556
    },
    {
      "verse": "55:58",
      "similarity": 0.23828566819704147
    },
    {
      "verse": "42:32",
      "similarity": 0.2032987590853653
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/055019.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/055019.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/55:19.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}