{
  "chapter": "الرحمن",
  "text": "يرسل عليكما شواظ من نار ونحاس فلا تنتصران",
  "translations": [
    {
      "translation": "He will pursue you with a piercing flame and fiery smoke, and you will not be helped.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let loose at you will be smokeless flames of fire so that you will not be able to defend yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(If you so venture) a flame of fire and smoke shall be lashed at you, which you shall be unable to withstand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Flames of fire and molten brass will be released against you and you will not be able to protect yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Flames of smokeless fire and black smoke without flames, will be let loose on you, so you will not be able to retaliate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will be sent against you both, Shuwaz of fire and Nuhas, and you will not be able to defend yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The flames of fire and smoke will be sent on you two, then you will not be able to defend yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Against you shall be loosed a flame of fire, and molten brass; and you shall not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will be sent, against you both, heat of fire and flash of brass, and ye will not escape.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Flames of fire and molten brass shall be sent against both of you, and you will not be able to defend yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There shall be sent against you both flame of fire and smoke, and ye shall not be able to defend yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will be unleashed upon you a flash of fire and a smoke; then you will not be able to help one another.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On you will be sent (O ye evil ones twain!) a flame of fire (to burn) and a smoke (to choke): no defence will ye have:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will be sent against you both, smokeless flames of fire and (molten) brass, and you will not be able to defend yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Flames of fire and molten copper shall be loosed against you, and you shall not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will be bombarded with flares of fire and brass, and you will not succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will be sent upon you a flame of fire and smoke, and you will not defend yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[55:35] Against you will be unleashed a heat of fire (shuwāz, can either mean that the flame thereof has no smoke or [that it does have it] with it) and a flash of brass, without any flame, and you will not be able to seek help, you will not be able to defend yourselves against this, nay, it will drive you to the site of the Gathering.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "There will be sent, against you both) when you emerge from the graves, humans and jinn, (heat of fire) of smokeless fire (and flash of brass) and smoke which will lead you to the place of assembly, (and ye will not escape) you will not refuse to be led.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُرْسَلُ عَلَيْكُمَا شُوَاظٌ مِّن نَّارٍ [وَنُحَاسٌ] } معناه نارٌ تأججُ ولا دُخان لَها\n والنُّحاسُ: الدُّخانُ\n\n",
      "translations": [
        {
          "translation": "\n\nThe verse says, \"There will be sent against you a {fire [and smoke]}.\" This means a fire that burns and has no smoke.\n\n\nAnd the copper: the smoke.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { يرسل عليكما شواظ من نار } أي: يمنعكما عن النفوذ من أقطارهما والترقي من أطوارهما لهب صاف عن ممازجة الدخان، أي: سلطان الوهم وأحكامه ومدركاته بإرساله الوهميات إلى حيز العقل والقلب وممانعته إياهما عن الترقي دائماً { ونحاس } دخان، أي: هيئة ظلمانية ترسلها النفس الحيوانية بالميل إلى الهوى والشهوات، فالشواظ مانع من جهة العلم والنحاس من جهة العمل { فلا تنتصران } فلا تمتنعان عنهما وتغلبان عليهما فتنفذان إلا بتوفيق الله وسلطان التوحيد",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف تنفذون وتفرون من حيطة قدرته وجلاله؛ إذ { يُرْسَلُ عَلَيْكُمَا } في النشأة الأخرى جزاءً لأعمالكم { شُوَاظٌ } لهب مشتعل { مِّن نَّارٍ } موقدة مسعرة { وَنُحَاسٌ } أي: دخان مظلم حاصل منها، وبالجملة: { فَلاَ تَنتَصِرَانِ } [الرحمن: 35] ولا تمتنعان عنهما، ولا تدفعانهما بحولكما إلاَّ بعناية ناشئة من الله، وفضل يدرككم من لدنه\n\n\n\n\n{ فَبِأَيِّ آلاۤءِ رَبِّكُمَا تُكَذِّبَانِ } [الرحمن: 36] وعليكم أن تشركوا آلاء الله، وتواظبوا على أداء حقوق نعمائه قبل حلول يوم الجزاء وبعده يوم الحشر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "54:19",
      "similarity": 0.3243071336082553
    },
    {
      "verse": "41:16",
      "similarity": 0.3239166232731133
    },
    {
      "verse": "28:41",
      "similarity": 0.020221576264940873
    },
    {
      "verse": "3:192",
      "similarity": 0.019820146394608766
    },
    {
      "verse": "45:34",
      "similarity": 0.018992676086435192
    }
  ]
}