{
  "chapter": "الرحمن",
  "text": "سنفرغ لكم ايه الثقلان",
  "translations": [
    {
      "translation": "We shall soon be free to turn to you, O weary caravans,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you twain, who are a burden (on the earth), We shall attend to you and call you to account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jinn and mankind, We shall certainly settle your accounts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Disposing all works quickly We tend towards your account, O you two large groups!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall attend to you, O Thaqalan!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon will We apply Ourselves to you, O you two armies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall surely attend to you at leisure, you weight and you weight!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall dispose of you, O ye two dependents (man and jinn).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon We shall attend to you -- two big groups [of jinn and mankind].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Anon We shall direct Our selves to you, O ye two classes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon We shall make Ourselves unoccupied for you, O you notable two!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon shall We settle your affairs, O both ye worlds!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall attend to you, O you two classes (jinns and men)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall surely aim, O both burdened.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will attend to you, O prominent two.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will attend to you, O prominent beings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[55:31] We will attend to you, We shall turn to reckon with you, O you two heavy ones!, mankind and jinn.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "We shall dispose of you) We shall record the works that you do in the life of the world and take you to task for them on the Day of Judgement, (0 ye two dependents) human beings and the jinn.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { سَنَفْرُغُ لَكُمْ أَيُّهَ ٱلثَّقَلاَنِ } معناه سَيُحاسبُكُم والثَّقلانُ: الجن والإِنسُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لما عدَّ سبحانه على عموم المكلفين نبذاً من نعمه العظام، على سبيل التنبيه والامتنان، أراد ، يشير إليه، ويبينه عليهم بالقيام على أداء حقوقها، ومواظبة شكرها؛ لئلا يغفلوا من الله، ولا يستحيوا عند الحساب في يوم الحشر والجزاء، فقال: { سَنَفْرُغُ لَكُمْ } نتجرد ونخلو لحسابكم، وتنقيد أعمالكم وجزائكم على مقتضاها { أَيُّهَ ٱلثَّقَلاَنِ } [الرحمن: 31] المثقلان بشكر نعمنا، وأداء حقوق كرمنا، ومتى سألناكما عن أعمالكما\n\n\n\n\n{ فَبِأَيِّ آلاۤءِ رَبِّكُمَا تُكَذِّبَانِ } [الرحمن: 32] وتنكران، مع أنَّا ما خفي علينا شيء من أعمالكم مطلقاً، لام من كفرانكم وعصيانكم، ولا من شكركم وإيمانكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله تعالى: { سنفرغ لكم أيه الثقلان } فسّر القشيري الثقلين بالروح وصفاتها الحميدة، وبالنفس وصفاتها الذميمة، أي: سنفرغ لإكرامكم، ورفع أقداركم يا معشر الأرواح المطهرة، بأن أتجلّى لكم، فتُشاهدوني في كل وقت وحين، وسنفرغ لكم أيتها النفوس الظلمانية بأنواع الامتحان بصُنوف المحن، فلا تدخلوا جنتي حتى تتهذبوا وتصفوا من كدرات الأغيار، ولا أتجلّى لكم إلاّ في وقت الاحتياج والاضطرار\n والحاصل: أنَّ المدار كله على هذه الدار، فمَن صفا هنا صُفي له ثَمّ، ومَن كدر هنا كدر عليه هناك\n ويُقال لأهل النفوس الظلمانية: { يا معشر الجن والإنس إن استطعتم أن تنفذوا من أقطار السماوات والأرض } بفكرة بصائركم فانفذوا، ولا قدرة لكم على ذلك لسجن أرواحكم في هياكل ذواتكم، وإحاطة دائرة الكون بكم، لا تنفذون إلاّ بسلطانٍ: إلاّ بقوة سلطان أرواحكم على نفوسكم، فتجذبها إلى عالم الروحانية، بصحبة طبيب ماهر، فحيئذ تنفذ بصيرتكم عن دائرة الأكوان، وتُفضوا إلى فضاء العيان، وإذا كان يوم القيامة خرقت أرواحُهم بأشباحهم محيطاتِ الأكوان، وأَفضوا في الهوى إلى سعة الجنان، قال تعالى:\n\n\n\n[الشعراء: 90]، وقد تقدّم معناه\n { يُرسل عليكم شُواظ من نار ونُحاس\n\n\n } الخ، قال القشيري: يُخاطب معشر جن النفس بإرسال لهب البُعد والقطيعة عليهم، بواسطة انغماسهم وانهماكهم في استيفاء اللذات الجسمانية، والشهوات الحيوانية، على الدوام والاستمرار، ويُخاطب معشر إنس الروح بصب الصُفر المذاب على رؤوسهم، بسبب انحطاطهم من المقام الروحي العلوي، إلى المقام النفس السفلي بالتراجع، ولا يقدر أحدهما على نصرة الآخر\n { فبأي آلاء ربكما تُكذّبان } فإنَّ تعذيب مستحق العذاب، وتنعيم متسحق النعيم، والتمييز بين جن النفس العاصي، وبين إنس الروح، من الآلاء العظيمة\n هـ\n فإذا انشقت السماء الحسية، أي: ذابت وتلاشت بذكر اسم الله عليها من العارف، فكانت وردةً يهب بنسيم المعاني من أكنافها، كالدهان: كالزيت المُذاب، حين تذوب بالفكرة الصافية، والحاصل: أنَّ سائر الكائنات، تذوب وتتلطّف حين تستولي عليها المعاني القائمة بها، { فبأي آلاء ربكما تُكذِّبان } مع ظهور هذه النعمة العظيمة، التي خَفِيَتْ عن جُلّ الناس، { فيومئذ لا يُسأل عن ذنبه إنس ولا جان } ممن بلغ منهم إلى هذه المرتبة العظيمة، فأهل العيان لم يبقَ في حقهم طاعة ولا عصيان، فلا يتوجه إليهم سؤال ولا عتاب، وفي مناجاة الحق لسيدنا موسى عليه السلام: لا يا موسى إنما يُطيعني ويعصيني أهل الحجاب، وأما مَن لا حجاب بيني وبينه فلا طاعة في حقه ولا معصية\n وقال الشيخ أبو الحسن رضي الله عنه: يبلغ الوليّ مبلغاً يُقال له: افعل ما شئت، أصحبناك السلام، وأسقطنا عنك الملامة\n هـ\n وهذا بعد محق أوصاف النفس، وبعد التحقق بالفناء والبقاء\n والله تعالى أعلم\n ثم ذكر ما أعدّ لأهل الانتقام، فقال: { يُعْرَفُ ٱلْمُجْرِمُونَ بِسِيمَاهُمْ فَيُؤْخَذُ }\n\n",
      "translations": []
    }
  ]
}