{
  "chapter": "الرحمن",
  "text": "فباى ءالاء ربكما تكذبان",
  "translations": [
    {
      "translation": "So which of your Lord's blessings do you both then deny?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many favours of your Lord will you then deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which of your Lord's laudable attributes will you twain – you men and jinn – then deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Jinn and mankind) - which of the favors of your Lord do you then deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So O men and jinns! Which favour of your Lord will you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then which of the blessings of your Lord will you both deny\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which then of the bounties of your Lord will you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O which of your Lord's bounties will you and you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which is it, of the favours of your Lord, that ye deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which of your Lord's wonders would you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which, then, of the benefits of your Lord will ye twain belie?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So which of your Lord’s bounties will you both deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then which of the favours of your Lord will ye deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then which of the Blessings of your Lord will you both (jinns and men) deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which favors of your Lord will you both belie?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So which of your Lord’s marvels will you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So which of the favors of your Lord would you deny?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[55:30] So which of your Lord’s favours will you deny?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Which is it, of the favours of your Lord, that ye deny?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { سَنَفْرُغ لكم أيه الثقلانِ } سنتجرّد لحسابكم وجزائكم، مستعار من قول الرجل لمَن يتهدّده: سأفرغ لك، أي: سأتجرد للإيقاع بك من كل ما يشغلني عنك، ويجوز أن يُراد: ستنتهي الدنيا ويبلغ آخرها، وينتهي عند ذلك شؤون الخلق، التي أرادها بقوله: { كل يوم هو في شأن } فلا يبقى إلاَّ شأن واحد، وهو جزاؤكم، فجعل ذلك فراغاً لهم على طريق المثل، و \" الثقلان \": الجن والإنس، سُمّيا بذلك لثقلهما على الأرض، أو: لرزانة آرائهما، أو: لأنهما مُثقلان بالتكليف، { فبأي آلاء ربكما } التي من جملتها: التنبيه على ما يلقونه يوم القيامة، للتحذير عما يؤدي إلى سوء الحساب، { تُكذِّبان } بأقوالكما أو بأعمالكما\n { يا معشرَ الجنِّ والإِنس } هو كالترجمة لقوله: \" أيه الثقلان \" { إِن استطعتم أن تنفذوا من أقطار السماوات والأرضِ } بأن تهربوا من قضائي، وتخرجوا من ملكوتي، ومن أقطار سماواتي وأرضي، { فانفذوا } وخلِّصوا أنفسكم من عقابي، { لا تنفُذون } لا تقدرون على النفوذ { إِلاَّ بسلطانٍ } إِلاّ بقوةٍ وقهرٍ، وأنتم من ذلك بمعزل بعيد\n قيل: يُقال لهم هذا يوم القيامة، حين تُحدق بهم الملائكة، فإذا رآهم الجن والإنس هربوا، فلا يأتون وجهاً إلاّ وجدوا الملائكة أحاطت به\n { فبأي آلاء ربكما تُكَذِّبان } التي من جملتها: التنبيه والتحذير ليقع التأهُّب لتلك الأهوال\n { يُرْسَلُ عليكم شُواظ من نارٍ } أي: لهب خالص منها\n وفيه لغتان: ضم الشين وكسرها، { ونُحاسٌ } أي: دخان، مَن رفعه عطفه على \" شواظ \" ومَن جرّه فعلى \" نار \" ، والمعنى، إذا خرجتم من قبوركم يُرسل عليكم لهب خالص من النار، ودخان يسوقكم إلى المحشر، { فلا تنتصرانِ } فلا تمنعان منهما، { فبأي آلاء ربكما تُكَذِّبان } فإنَّ بيان العواقب لُطفٌ ونعمةٌ لمَن ينتبه\n { فإِذا انشقت السماءُ } أي: انصدعت يوم القيامة { فكانت وَرْدَةً } فصارت كلون الورد الأحمر { كالدِّهان } كدهن الزيت، كما قال:\n\n[المعارج: 8] وهو دُردِيّ الزيت، وهو جمع دهن، وقيل: الدهان: الأديم الأحمر\n وجواب \" إذا \" محذوف، أي: يكون من الأهوال والأحوال ما لا يحيط به دائرة المقال\n قلت: وهذا الانشقاق يحصل للسموات والناسُ في المحشر، ثم تدنو الشمس من الخلائق، فيعظم الخطب والهول، إلاّ ما استثني في حديث السبعة\n وقيل: يحصل قبل البعث، كما في البدور السافرة\n والله أعلم بحقيقة الأمر\n { فبأي آلاء ربكما تُكَذِّبان } مع عِظم شأنها، { فيومئذ لا يُسأل عن ذنبه إِنس ولا جانٌّ } لأنهم يُعرفون بسيماهم وذلك أول ما يخرجون من القبور، ويُحشرون إلى الموقف أفواجاً على اختلاف مراتبهم، وأمّا قوله تعالى:\n\n\n\n[الحجر: 92] ونحوه ففي موقف المناقشة والحساب، فيوم القيامة يوم طويل، وفيه مواطن، يُسألون في موطن، ولا يُسألون في آخر\n وقال قتادة: قد كانت مسألة، ثم ختم على أفواه القوم\n وقيل: لا يُسأل ليَعلم من جهته، ولكن يُسأل للتوبيخ\n وضمير { ذنبه } للإنس لتقدُّمه رتبة، وإفراده لأنّ المراد فرد من الإنس، والمراد بالجان الجن، فوضع الجان - الذي هو أبو الجن موضع الجن، كأنه قيل: لا يُسأل عن ذنبه أنسي ولا جني، { فبأي آلاء ربكما تُكذِّبان } مع كثر منافعها فإنَّ الإخبار بما ذكر يزجركم عن الشر المؤدي إليه\n الإشارة: يسأله مَن في سماوات الأرواح ما يليق بروحانيته، من كشف الأسرار، وتوالي الأنوار، فهو دائم سائل مفتقر، لا يزول اضطراره، ولا يكون مع غير الله قراره، وسؤاله إما بلسان حاله أو مقاله، ويسأله مَن في أرض البشرية ممن لم يترقّ إلى عالم الروحانية ما يليق بضعف بشريته، من القوت الحسي، وما يلائمه من ضرورية البشرية، أو يكون سبب نجاته ونعيمه يوم القيامة، من الاستقامة الظاهرة\n وأشار بقوله: { كل يوم هو في شأن } إلى اختلاف تجلياته في كل لحظة، فيتجلّى في ساعة واحدة بقبض قوم وبسط آخرين، ورفع قوم وذلّ آخرين، وإعطاء قوم ومنع آخرين، وترقية قوم وخفض آخرين، إلى ما لا نهاية له، ولذلك تختلف الواردات على قلوب العارفين، ينسخ بعضها بعضاً، ولذلك أيضاً تجد العارفين لا يسكنون إلى شيء، ولا يقفون مع شيء ولا يُعولون على شيء، بل ينظرون ما يبرز من عنصر القدرة، فيسيرون معه، إذا أصبحوا نظروا ما يفعل الله بهم، وإذا أمسوا كذلك، قد هدمت المعرفة أركانَ عزائمهم، وحلّت عقدهم، فهم في عموم أوقاتهم لا يُريدون ولا يختارون ولا يُدبّرون لعِلمهم أن الأمر بيد غيرهم، ليس لهم من الأمر شيء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:13",
      "similarity": 1.0
    },
    {
      "verse": "55:16",
      "similarity": 1.0
    },
    {
      "verse": "55:18",
      "similarity": 1.0
    },
    {
      "verse": "55:21",
      "similarity": 1.0
    },
    {
      "verse": "55:23",
      "similarity": 1.0
    }
  ]
}