{
  "chapter": "الرحمن",
  "text": "يمعشر الجن والانس ان استطعتم ان تنفذوا۟ من اقطار السموت والارض فانفذوا۟ لا تنفذون الا بسلطن",
  "translations": [
    {
      "translation": "Company of jinn and men, if you are able to pierce through the confines of the heavens and earth, pierce through them. You will not pierce through except with a clear authority.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O society of jinns and men, cross the bounds of the heavens and the earth if you have the ability, then pass beyond them; but you cannot unless you acquire the law.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O company of jinn and men, if you have the power to go beyond the bounds of the heavens and the earth, go beyond them! Yet you will be unable to go beyond them for that requires infinite power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jinn and mankind, if you can penetrate the diameters of the heavens and the earth, do so, but you cannot do so without power and authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O the groups of jinns and men, if you can cross the boundaries of the heavens and the earth, then cross them; wherever you may go, His is the kingdom!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O assembly of Jinn and men! If you are able to pass beyond the zones of the heavens and the earth, then pass beyond (them)! But you will never be able to pass them, except with authority (from Allah)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O assembly of the jinn and the men! If you are able to pass through the regions of the heavens and the earth, then pass through; you cannot pass through but with authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O tribe of jinn and of men, if you are able to pass through the confines of heaven and earth, pass through them! You shall not pass through except with an authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O company of jinn and men, if ye have power to penetrate (all) regions of the heavens and the earth, then penetrate (them)! Ye will never penetrate them save with (Our) sanction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O company of jinn and men! If you have the power to go beyond the realms of the heavens and the earth, pass beyond them: you cannot pass out but with [Our] authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O assembly of Jinn and man! if ye be able to pass out of the regions of the heavens and the earth, then pass out; ye can not pass out except with authority.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O company of jinn and humans! If you can pass through the confines of the heavens and the earth, then do pass through. But you will not pass through except by an authority [from Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye assembly of Jinns and men! If it be ye can pass beyond the zones of the heavens and the earth, pass ye! not without authority shall ye be able to pass!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O assembly of jinns and men! If you have power to pass beyond the zones of the heavens and the earth, then pass (them)! But you will never be able to pass them, except with authority (from Allah)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tribe of jinn and of human, if you are able to penetrate the provinces of heaven and earth, pass through them! But you shall not pass through except with a power!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O society of jinn and humans! If you can pass through the bounds of the heavens and the earth, go ahead and pass. But you will not pass except with authorization.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O company of jinn and mankind, if you are able to pass beyond the regions of the heavens and the earth, then pass. You will not pass except by authority [from Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[55:33] O company of jinn and humans, if you are able to pass through, to exit from, the confines, the regions, of the heavens and the earth, then pass through! — a command [meant] to challenge them to what they are incapable of [doing]. You will not pass through except with a sanction, [except] with some power, and you have no power for such a thing.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "company of jinn and men, if ye have power) if you are able (to penetrate (all)) to break free from (regions) the extremities (of the heavens and the earth) and from the rows of angels; (then penetrate (them)) then break free and flee! (You will never penetrate them) you will not be able to break free (save with (Our) sanction) save with a reason and proof.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنِ ٱسْتَطَعْتُمْ أَن تَنفُذُواْ مِنْ أَقْطَارِ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } فأَقطارُها: جَوانِبُها\n وتَنفُذُوا: معناه تَفوتُوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا معشر الجنّ والإنس } أي: الباطنيين و الظاهريين { إن استطعتم ان تنفذوا من أقطار السموات والأرض } بالتجرّد عن الهيئات الجسمانية والتعلقات البدنية { فانْفذوا } لتنخرطوا في سلك النفوس الملكية والأرواح الجبروتية، وتصلوا إلى الحضرة الإلهية { لا تنفذون إلا بسلطان } بحجة بينة هي التوحيد والتجريد والتفريد بالعلم والعمل والفناء في الله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحاه منادياً لهم على وجه التوعيد والتوبيخ والتهديد: { يٰمَعْشَرَ ٱلْجِنِّ وَٱلإِنسِ } المجبولين على فطرة التكليف بمقتضى الحكمة البالغة، عليكم أن تنقادوا وتطيعوا بعموم ما كلفتم به، والمثمر لحكمة المعرفة واليقين، إلاَّ { إِنِ ٱسْتَطَعْتُمْ } وقدرتهم { أَن تَنفُذُواْ } وتخرجوا فارين عن مقتضيات قهرنا وغضبنا { مِنْ أَقْطَارِ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: من جهة العلويات والسفليات { فَٱنفُذُواْ } واخرجوا، مع أنكم { لاَ تَنفُذُونَ } ولا تقدرون على الخروج { إِلاَّ بِسُلْطَانٍ } [الرحمن: 33] أي: بقدرة واقتدار موهوبة لكم من قِبَل ربكم؛ إذ لا يصدر منكم مطلق الأفعال الحركات إلاَّ بإقدار وتمكينه سبحانه\n\n\n\n\n{ فَبِأَيِّ آلاۤءِ رَبِّكُمَا تُكَذِّبَانِ } [الرحمن: 34]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:14",
      "similarity": 0.2527153751711289
    },
    {
      "verse": "14:50",
      "similarity": 0.19558447852283103
    },
    {
      "verse": "34:12",
      "similarity": 0.18077825930686023
    },
    {
      "verse": "18:96",
      "similarity": 0.17971691210508045
    },
    {
      "verse": "6:130",
      "similarity": 0.0689170168310519
    }
  ]
}