{
  "chapter": "الرحمن",
  "text": "فيومئذ لا يسـل عن ذنۢبه انس ولا جان",
  "translations": [
    {
      "translation": "That Day no man or jinn will be asked about his sin.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither man nor jinn will be questioned on that day about his sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day there will be no need to ask either men or jinn about their sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day there will be no need to ask mankind or jinn about his sin\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day no sinner will be questioned about his sins, from men or from jinns.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, on that Day he will not be questioned about his sin, (neither) human nor Jinn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So on that day neither man nor jinni shall be asked about his sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on that day none shall be questioned about his sin, neither man nor jinn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day neither man nor jinni will be questioned of his sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For, on that Day, neither man nor jinn will be questioned about his sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of his sin will be questioned that Day neither man nor jinn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day neither humans will be questioned about their sins nor jinn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day no question will be asked of man or Jinn as to his sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So on that Day no question will be asked of man or jinn as to his sin, (because they have already been known from their faces either white or black).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, neither human nor jinn shall be asked about his sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, no human and no jinn will be asked about his sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then on that Day none will be asked about his sin among men or jinn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[55:39] Thus on that day no man will be questioned about his sin, nor any jinn, about his sin; but they are questioned on some other occasion: By your Lord, We shall question them all [Q.15:92] (al-jānn in this instance and in what will follow denotes the jinn, and also in both cases al-ins denotes human beings).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "On that day) which is the Day of Judgement; after the end of reckoning (neither man nor jinn will be questioned of his sin) his works; the believer will be known with his blooming, white face; it is also said that this means: the sins of human beings and the jinn will not be asked about.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَيَوْمَئِذٍ لاَّ يُسْأَلُ عَن ذَنبِهِ إِنسٌ وَلاَ جَآنٌّ } معناه لا يُسألُ أحدٌ عن ذنبٍ أحدٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"On that day, no one will be asked about his sin\" means that no one will be asked about the sin of anyone else.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { فيومئذ لا يسئل عن ذنبه إنس } من الظاهريين { ولا جان } من الباطنيين لانجذاب كل إلى مقرّه ومركزه وموطنه الذي يقتضيه حاله وما هو الغالب عليه باستعداده الأصلي أو العارضي الراسخ الغالب\n وأما الوقف والسؤال المشار إليه في قوله:\n\n[الصافات، الآية:24] ونظائره، ففي مواطن أخر من اليوم الطويل الذي كان مقداره خمسين ألف سنة وهو في حال عدم غلبة إحدى الجهتين واستيلاء أحد الأمرين، ففي زمان غلبة النور الأصلي وبقاء الاستعداد الفطري أو حصول الكمال والترقي في الصفات، وفي وقت استيلاء الهيئات الظلمانية وترسخ الغواشي الجسمانية وزوال الاستعداد الأصلي بحصول الرين لا يسئلون، وفي وقت عدم رسوخ تلك الهيئات إلى حدّ الرين وبقائها في القلب مانعة، حاجزة إياها عن الرجوع إلى مقرّها، يوقفون ويسئلون حتى يعذبوا بحسب سيئاتهم على قدر رسوخها، وقد يكون هذا الموطن قبل الموطن الأول في ذلك اليوم على الأمر الأكثر كما ذكر وقد يكون بعده، وذلك عند حبط الأعمال وغلبة الأمر العارضي و استيلائه على الذاتي إلى حد إبطال الاستعداد بالكلية فيدافعه الاستعداد الأصلي قليلاً قليلاً ويتجلى بصور التعذّبات والبليّات شيئاً فشيئاً، حتى يتساوى الأمران كتبرّد الماء المسخّن حين بلوغه إلى كونه فاتراً، فهذا الشخص مطرود في أول الأمر عند قرب الاستعداد إلى الزوال ثم قد يوقف ويسئل عند قرب رجوع الاستعداد إلى الحالة الأولى وإمكان اتصاله بالملكوت\n وأما الأشقياء المردودون، المخلّدون في العذاب، والسعداء المقرّبون الذين يدخلون الجنة بغير حساب، فلا يسئلون قط ولا يوقفون للسؤال\n فقوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبل { فَيَوْمَئِذٍ } أي: حين انشقاق السماء { لاَّ يُسْأَلُ عَن ذَنبِهِ إِنسٌ وَلاَ جَآنٌّ } [الرحمن: 39] أي: لا يُسأل حينئذ لا عن ذنب الإنس ولا على ذنب الجان، ولا يتلفت إلى أعمالهما وأفعالهما، بل يبعثون من قبورهم، ويساقون نحو المحشر حيارى تائهئين للحساب والجزاء، فاعتنى سبحانه بشأنكم، ونبهكم على إعداد الزاد قبل يوم المعاد\n\n\n\n\n{ فَبِأَيِّ آلاۤءِ رَبِّكُمَا تُكَذِّبَانِ } [الرحمن: 40] وكيف لا تعتادون، ولا تتزودون ليومكم هذا؟!\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "81:9",
      "similarity": 0.5948570516197261
    },
    {
      "verse": "26:14",
      "similarity": 0.550919845110003
    },
    {
      "verse": "3:16",
      "similarity": 0.5323186368461743
    },
    {
      "verse": "3:31",
      "similarity": 0.5026320191855793
    },
    {
      "verse": "51:59",
      "similarity": 0.4435931038359088
    }
  ]
}