{
  "chapter": "الرحمن",
  "text": "ولمن خاف مقام ربه جنتان",
  "translations": [
    {
      "translation": "But for him who lived in awe of the sublimity of his Lord, there will be two gardens --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For any who fears to stand before his Lord are two Gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who fear their Lord will have two gardens\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for one who fears to stand before his Lord, are two Gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for him who fears the standing before his Lord, there will be two Gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for him who fears to stand before his Lord are two gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But such as fears the Station of his Lord, for them shall be two gardens --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for him who feareth the standing before his Lord there are two gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are two gardens for one who fears standing before his Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for him who dreadeth the standing before his Lord will be two Gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For him who stands in awe of his Lord will be two gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for such as fear the time when they will stand before (the Judgment Seat of) their Lord, there will be two Gardens-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for him who [the true believer of Islamic Monotheism who performs all the duties ordained by Allah and His Messenger Muhammad SAW, and keeps away (abstain) from all kinds of sin and evil deeds prohibited in Islam and] fears the standing before his Lord, there will be two Gardens (i.e. in Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for he who fears the standing (before) his Lord there are two Gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for him who feared the standing of his Lord are two gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But for he who has feared the position of his Lord are two gardens -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[55:46] But for those who feared, that is, for every one of them, or for all of them together, the station of their Lord, the standing before Him for the Reckoning and therefore refrained from being disobedient to Him, there will be two gardens.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But for him who feareth the standing before his Lord) but he who fears standing before his Lord upon being on the verge of committing a transgression and thus desists from it (there are two Gardens) the Garden of Eden and the Firdaws.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على مقتضى سنته المستمرة في كتابه من تعقيب الوعيد بالوعد: { وَلِمَنْ خَافَ } من كلا الفريقين؛ أي: مكلفي الجن والإنس وفي النشأة الأولى { مَقَامَ رَبِّهِ } أي: خاف عن قيامه بين يدي ربه في النشأة الأخرى للعرض والجزاء، واشتغل في هذه النشأة إعداد ذلك اليوم، وتهيئة أسبابه من اكتساب الحسنات و ترك السيئات من الأخلاق والاعتقادات، وصوالح العبادات والطاعات المقبولة يومئذ عند الله على مقتضى ما أمرهم الحق، ونهاهم عنه بإرسال الرسل وإنزال الكتب { جَنَّتَانِ } [الرحمن: 46] معدتان لكل خائف عند ربه جنة جسمانية، يتلذذ فيها بدل ما ترك من اللذات الدنيوية وشهواتها الفانية اتقاء عن الله، وجنة روحانية عناية من الله وفضلاً من\n\n \" ما لا عين رأت ولا أذن سمعت\n\n\n الحديث \"\n \n\n \n\nوبالجملة: { فَبِأَيِّ آلاۤءِ رَبِّكُمَا تُكَذِّبَانِ } [الرحمن: 47] أيها المكلفان!\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ولِمَنْ خافَ مقامَ ربه } أي: قيامه بين يديه للحساب { يوم يقوم الناس لرب العالمين } أو: قيامه تعالى على أحواله، من: قام عليه، إذا راقبه، كقوله:\n\n[الرعد: 33]\n قال مجاهد: هو الرجل يهم بالمعصية، فيذكر الله تعالى، فيدعها من خوفه\n قال السدي: شيئا، مفقودان: الخوف المزعج، والشوق المقلق\n هـ\n أي: للخائف { جنتانِ } أي: بستانان من الياقوت الأحمر والزبرجد الأخضر، مسيرة كل بستان: مائة سنة\n وقال صلى الله عليه وسلم:\n\n \" هل تدرون ما هاتان الجنتان؟ هما بستانان في بستانين، قرارهما لابث، وفرعهما ثابت، وشجرهما نابت \" \n\n، أَكْرَم بهما المؤمن ليتكامل سروره بالتنقُّل من جنة إلى جنة، وقيل: جنة لخوفه وجنة لتركه شهوته، أو: جنة لعقيدته وجنة لعمله، أو: جنة لفعل الطاعة وجنة لتركه المعصية، أو: جنة يُثاب بها وجنة يُتفضل عليه بها، أو: روحانية وجسمانية، أو: جنة للسابقين وجنة لأهل اليمين، أو: جنة للإنس وجنة للجن لأنّ الخطاب للثقلين، كأنه قيل: لكل خائف منكما جنتان\n والأول أرجح، وسيأتي في الإشارة بقيته، { فبأي آلاء ربكما تُكَذِّبان }",
      "translations": []
    }
  ]
}