{
  "chapter": "الرحمن",
  "text": "يعرف المجرمون بسيمهم فيؤخذ بالنوصى والاقدام",
  "translations": [
    {
      "translation": "The evildoers will be recognised by their mark and seized by their forelocks and their feet.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sinners will be recognised by their marks, and seized by the forelock and their feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The culprits shall be known by their marks, and shall be seized by their forelocks and their feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The guilty ones will be recognized by their faces and will be seized by their forelocks and feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The criminals will be recognised from their faces, so will be caught by their forelocks and feet, and thrown into hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The criminals will be known by their marks, and they will be seized by their foreheads and feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The guilty shall be recognized by their marks, so they shall be seized by the forelocks and the feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sinners shall be known by their mark, and they shall be seized by their forelocks and their feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The guilty will be known by their marks, and will be taken by the forelocks and the feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The guilty shall be recognized by their marks so they shall be seized by their forelocks and their feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The culprits will be recognised by their marks, and will be lain hold of by the forelocks and the feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The guilty will be recognized by their mark; so they will be seized by their forelocks and feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(For) the sinners will be known by their marks: and they will be seized by their forelocks and their feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Mujrimun (polytheists, criminals, sinners, etc.) will be known by their marks (black faces), and they will be seized by their forelocks and their feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sinners shall be known by their mark, they shall be seized by their forelocks and their feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The guilty will be recognized by their marks; they will be taken by the forelocks and the feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The criminals will be known by their marks, and they will be seized by the forelocks and the feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[55:41] The guilty will be recognised by their mark: blackened faces and bruised eyes; so they will be seized by the forelocks and the feet.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "The guilty will be known by their marks) the idolaters will be known by their dark faces and bluish eyes, (and will be taken by the forelocks and the feet) and cast in the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُعْرَفُ ٱلْمُجْرِمُونَ بِسِيمَاهُمْ } معناه بعلاماتِهِم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah: {The criminals are known by their marks} means by their signs.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يعرف المجرمون } الذين غلبت عليهم الهيئات الجرمانية باكتساب الرذائل ورسوخها { بسيماهم } أي: بعلامات تلك الهيئات الظاهرة الغالبة عليهم { فيؤخذ بالنواصي } فيعذبون من فوق ويحجبون ويحبسون مقيدين أسراء من جهة رذيلة الجهل المركب ورسوخ الاعتقادات الفاسدة { والأقدام } أي: يعذبون من أسفل، ويجرّون ويسحبون على وجوههم، ويردّون إلى قعر جهنم كما قيل: يهوي أحدهم فيها سبعين خريفاً لرسوخ الهيئات البدنية والرذائل العملية من إفراط الحرص والشره والبخل والطمع وارتكاب الفواحش والآثام من قبيل الشهوة والغضب",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ { يُعْرَفُ } ويعلم يومئذ { ٱلْمُجْرِمُونَ } المهملون لأمر الزاد، المتصفون بالجرائم المستلزمة للانتقام { بِسِيمَاهُمْ } إذ يظهر حينئذ آثار الكآبة والحزن على وجوههم { فَيُؤْخَذُ } بعد الخطاب والحساب { بِٱلنَّوَاصِي وَٱلأَقْدَامِ } [الرحمن: 41] أي: يشد أعناقم مع أرجلهم بالسلاسل، ثم يطرحون في النار بأنواع الهوان والصغار، فيخبركم ربكم بالخلاص عنها قبل حلول أوانها، { فَبِأَيِّ آلاۤءِ رَبِّكُمَا تُكَذِّبَانِ } [الرحمن: 42]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "96:16",
      "similarity": 0.7372418396734436
    },
    {
      "verse": "11:56",
      "similarity": 0.6975898267442875
    },
    {
      "verse": "7:48",
      "similarity": 0.31095037609953535
    },
    {
      "verse": "96:15",
      "similarity": 0.2981571442957531
    },
    {
      "verse": "11:83",
      "similarity": 0.2959238708635843
    }
  ]
}