{
  "chapter": "الرحمن",
  "text": "متكـين على فرشۭ بطائنها من استبرق وجنى الجنتين دان",
  "translations": [
    {
      "translation": "They will be reclining on couches lined with rich brocade, the fruits of the Gardens hanging close to hand.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining there on carpets lined with brocade, fruits of the garden hanging low within reach.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall recline on couches lined with brocade, and within reach shall hang the fruits of the two Gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The dwellers of Paradise) will recline on couches lined with silk brocade and it will be easy to reach the ripe fruits from the two gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining upon thrones that are lined with brocade, with the fruit of both Gardens close enough to be picked from under.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining upon the couches lined with Istabraq, and the fruits of the two Gardens will be near at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining on beds, the inner coverings of which are of silk brocade; and the fruits of the two gardens shall be within reach.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "reclining upon couches lined with brocade, the fruits of the gardens nigh to gather --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining upon couches lined with silk brocade, the fruit of both the gardens near to hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will recline upon carpets lined with rich brocade; and the fruits of both these gardens will be within easy reach.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining on carpets whereof the linings will be of brocade; and the fruit of the two Gardens shall be near at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[They will be] reclining on beds lined with green silk. And the fruit of the two gardens will be near at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will recline on Carpets, whose inner linings will be of rich brocade: the Fruit of the Gardens will be near (and easy of reach).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining upon the couches lined with silk brocade, and the fruits of the two Gardens will be near at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They shall) recline on couches lined with brocade, and the fruits of the Gardens will be near at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining on furnishings lined with brocade, and the fruits of the two gardens are near at hand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[They are] reclining on beds whose linings are of silk brocade, and the fruit of the two gardens is hanging low.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[55:54] [They will be] reclining (muttaki’īna is a circumstantial qualifier operated by an omitted [verb], that is to say, yatana‘‘amūna, they will enjoy bliss [while reclining]’) upon couches lined with [heavy] silk brocade, (istabraq) thick or coarse silk, the outer lining being of fine silk (sundus). And the fruits of both gardens will be near, so that it may be reached by the one standing up, the one sitting down or the one lying down.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمُتَّكِئِينَ عَلَى فُرُشٍ بَطَائِنُهَا مِنْ إِسْتَبْرَقٍ وَجَنَى الْجَنَّتَيْنِ دَانٍ (54(حال من { لمن خاف مقام ربه } وجيء بالحال صيغةَ جمع باعتبار معنى صاحب الحال وصلاحية لفظه للواحد والمتعدد ، لا باعتبار وقوع صلته بصيغة الإِفراد فإن ذلك اعتبار بكون ( مَن ( مفردة اللفظ .والمعنى : أُعطوا الجنان واستقرُّوا بها واتكأوا على فرش .والاتكاء : افتعال من الوَكْءِ مهموز اللام وهو الاعتماد ، فصار الاتكاء اسماً لاعتمادِ الجالس ومرفقه إلى الأرض وجنبه إلى الأرض وهي هيئة بين الاضطجاع على الجنب والقعودِ ، وتقدم في قوله : { وأعتدت لهن متكئاً } في سورة يوسف ( 31 ( ، وتقدم أيضاً في سورة الصافات .وفُرش : جمع فراش ككتاب وكُتب . والفِراش أصله ما يفرش ، أي يبسط على الأرض للنوم والاضطجاع .ثم أطلق الفراش على السرير المرتفع على الأرض بسُوققٍ لأنه يوضع عليه ما شأنه أن يفرش على الأرض تسمية باسم ما جعل فيه ، ولذلك ورد ذكره في سورة الواقعة ( 15 ، 16 ( في قوله : { على سرر موضونة متكئين عليها متقابلين } وفي سورة الصافات ( 44 ( على سرر متقابلين .والمعبر عنه في هذه الآيات واحد يدلّ على أن المراد بالفرش في هذه الآية السرر التي عليها الفرش .والاتكاء : جِلسة أهل الترف المخدومين لأنها جلسة راحة وعدم احتياج إلى النهوض للتناول نحوه وتقدم في سورة الكهف .والبطائن : جمع بِطانة بكسر الباء وهي مشتقة من البطن ضد الظهر من كل شيء ، وهو هنا مجاز عن الأسفل . يقال للجهة السفلى : بطن ، وللجهة العليا ظهر ، فيقال : بَطَّنْت ثوبي بآخر إذا جعل تحت ثوبه آخرَ ، فبطانة الثوب داخله وما لا يَبدو منه ، وضد البطانة الظِّهارة بكسر الظاء ، ومن كلامهم : أفرشني ظهر أمره وبطنه ، أي علانيته وسِرّه ، شبهت العلانية بظهر الفراش والسِرّ ببطن الفراش وهما الظِهارة والبطانة ، ولذلك أتبع هذا التشبيه باستعارة فعل : أفرشني . فالبطانة : هي الثوب الذي يجعل على الفراش والظهارة : الثوب الذي يجعل فوق البطانة ليظهر لرؤية الداخل للبيت فتكون الظهارة أحسن من البطانة في الفراش الواحد .والعرب كانوا يجعلون الفراش حَشية ، أي شيئاً محشواً بصوف أو قطن أو ليف ليكون أوثر للجنب ، قال عنترة يصف تنعم عَبلة :تُمسي وتُصبح فوق ظهر حشِيّةٍ ... وأَبِيتُ فوقَ سَراة أدهم مُلجمفإذا وضعوا على الحشية ثوباً أو خاطوها بثوب فهو البطانة ، وإذا غطوا ذلك بثوب أحسن منه فهو الظِهارة .فالمعنى هنا : أن بطائن فرش الجنة من استبرق فلا تَسأل عن ظهائرها فإنها أجود من ذلك ، ولا ثوب في الثياب المعروفة عند الناس في الدنيا أنفس من الاستبرق البطائن بالذكر كناية عن نفاسة وصف ظهائر الفرش .والاستبرق : صنف رفيع من الديباج الغليظ . والديباجُ : نسيج غليظ من حرير والاستبرق ينسج بخيوط الذهب . قال الفخر : وهو معرب عن الفارسية عن كلمة ( سْتبرك ( بكاف في آخره علامة تصغير ( ستبر ( بمعنى ثخين ، وقد تقدم في سورة الكهف ( 31 ( ، فأبدلوا الكاف قافاً خشية اشتباه الكاف بكاف الخطاب ، والذي في القاموس } : الإِستبرق : الديباج الغليظ معرب ( اسْتَرْوَه ( ، وقد تبين أن الإِستبرق : صنف من الديباج ، والديباج : ثوب منسوج من الحرير منقوش وهو أجود أنواع الثياب .ومن { جنى الجنتين } : ما يجنى من ثمارهما ، وهو بفتح الجيم ما يقطف من الثمر . والمعنى : أن ثمر الجنة داننٍ منهم وهم على فرشهم فمتى شاءوا اقتطفوا منه .\n\n",
      "translations": [
        {
          "translation": "Reclining upon couches) sitting in comfort upon couches (lined with silk brocade) their outside is made of thick silk brocade while their inside is of soft silk brocade, (the fruit of both Gardens near to hand.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مُتَّكِئِينَ عَلَى فُرُشٍ بَطَآئِنُهَا مِنْ إِسْتَبْرَقٍ } فالبَطائنُ: الظّواهرُ\n والإِستبرقُ ليس في صفاقةِ الدِّيباجِ ولا خفة الفَريدِ\n\n\n\n\nوقوله تعالى: { وَجَنَى ٱلْجَنَّتَيْنِ دَانٍ } فالجَنى: الثمارُ التي تُجنى والدَّاني: القَريبُ الذي لا يَعي الجَاني\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, { those who recline on their couches, secure in their homes } - the \"batin\" here are the apparent things.\n\n\nAnd the isbriq (a type of horse) is not in the safaqah (group of horses) of the diabaj (a type of horse), nor is it in the khafah (group of horses) of the farid (a type of horse).\n\n\nAnd the saying of Allah, \"He has made the two gardens of Paradise equal in size.\" The janna is the fruit that is harvested, and the dani is the close one who does not see the janna.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وجنى الجنتين } ثمراتها ومدركاتها { دانٍ } قريب",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { على فُرُش بطائنُها من إِستبرقٍ } من ديباج ثخين\n وحيث كانت بطائنها كذلك فما ظنك بظاهرها؟ وقيل: ظاهرها سُندس\n وقيل: من نور\n وقيل: لا يعلمها إلاّ الله\n والبطائن: جمع بطانة\n وهو: ما يلي الأرض\n والإستبرق معرَّب\n { وجَنَى الجنتين دانٍ } أي: ما يجتنى من أشجارها من الثمار قريب\n يناله القائم والقاعد والمضطجع\n قال ابن عباس رضي الله عنه: تدنو الشجيرة حتى يجنيها وليُّ الله\n إن شاء قائماً\n وإن شاء قاعداً\n وإن شاء مضطجعاً\n قال القشيري: وفي الخبر المسند: \" مَن قال سبحان الله\n والحمد لله\n ولا إله إلا الله\n والله أكبر\n غرس له بها ألف شجرة في الجنة\n أصلها الذهب\n وفرعها الدر\n وطلعها كثدي الأبكار\n ألين من الزبد\n وأحلى من العسل\n كلما أُخذ منها شيء عاد كما كان\n وذاك قوله تعالى: { وجَنَى الجنتين دانٍ } إذا أرادوه أتى إلى أفواههم\n حتى يتناولون من غير مشقة\n ويقال: ينالها القائم والقاعد والنائم\n\nهـ\n { فبأي آلاء ربكما تُكَذِّبان } ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:25",
      "similarity": 0.3614513945626529
    },
    {
      "verse": "44:53",
      "similarity": 0.2948921993078626
    },
    {
      "verse": "56:34",
      "similarity": 0.2641539538576252
    },
    {
      "verse": "18:31",
      "similarity": 0.25710357913251974
    },
    {
      "verse": "51:48",
      "similarity": 0.2558857614010527
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/055054.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/055054.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/55:54.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}