{
  "chapter": "الرحمن",
  "text": "فيهن قصرت الطرف لم يطمثهن انس قبلهم ولا جان",
  "translations": [
    {
      "translation": "In them are maidens with eyes for them alone, untouched before them by either man or jinn.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In them maidens with averted glances, undeflowered by man or by jinn before them, --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the midst of these shall be maidens with modest, restrained glances; maidens whom no man or jinn has ever touched before.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will be bashful maidens untouched by mankind or jinn before.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon thrones are the women who do not gaze at men except their husbands, and before them, are untouched by any man or jinn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherein both will be Qasirat At-Tarf, whom never deflowered a human before nor Jinn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In them shall be those who restrained their eyes; before them neither man nor jinni shall have touched them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "therein maidens restraining their glances, untouched before them by any man or jinn --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein are those of modest gaze, whom neither man nor jinni will have touched before them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein are maidens of modest gaze, whom neither a man nor a jinn had ever touched before them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein shall be those of refraining looks whom before them hath deflowered neither man nor jinn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In them are maidens of restrained glances, whom no human has touched before, nor jinn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In them will be (Maidens), chaste, restraining their glances, whom no man or Jinn before them has touched;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherein both will be those (maidens) restraining their glances upon their husbands, whom no man or jinn yatmithhunna (has opened their hymens with sexual intercourse) before them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therein are maidens who restrain their glances, whom neither human nor jinn have touched before.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In them are maidens restraining their glances, untouched before by any man or jinn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In them are women limiting [their] glances, untouched before them by man or jinni -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[55:56] In them, in the two gardens and what they comprise of upper chambers and palaces, are maidens of restrained glances, [restricting] their eyes to those spouses of theirs from among [either] the men or the jinn who are reclining, [maidens] who have not been touched, [who] have not been deflowered — and these [maidens] are [either] houris or women of this world who [will] have been created [anew], by any man or jinn before them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therein are those of modest gaze) modest maiden who are content with their husbands and who do not look at other than their own husbands, (whom neither man nor jinn will have touched before them) before their husbands,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قَاصِرَاتُ ٱلطَّرْفِ } معناه لا تَطمَحُ أبصارهنَّ إِلى غَيرِ أزواجهنَّ\n\n\n\n\nوقوله تعالى: { لَمْ يَطْمِثْهُنَّ } معناه لم يَمسْهُنَّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فِيهِنَّ } أي: في الجنان المعدة لأرباب العناية والامتنان، مخدرات المعارف الحقائق الواردة على قلوبهم حسب استعداداتهم المتفاوتة { قَاصِرَاتُ ٱلطَّرْفِ } أي: كل منهم منحصرة الطرف، مقصورة النظرة على كل من هي ترد عليه؛ بحيث لا تتعدى إلى غيره؛ لا ختلاف قابلياتهم حسب الفطرة الأصلية بمقتضى اختلاف تجليات الحق وشئونه بحيث { لَمْ يَطْمِثْهُنَّ } ولم يتلذذ معهن { إِنسٌ قَبْلَهُمْ } ولا بعدهم { وَلاَ جَآنٌّ } [الرحمن: 56] كذلك؛ إذ مراتب الشهود على مقتضى تجليا الوجود وتطوراته، فكما لا تكرر ولا اتحاد بين اثنين في التجليات الإلهية، كذلك في مراتب أرباب الشهود القابلة لها، المستعدة إياها، { فَبِأَيِّ آلاۤءِ رَبِّكُمَا تُكَذِّبَانِ } [الرحمن: 57]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فبأي آلاء ربكما تُكَذِّبان } ، { فيهن } أي: الجنتين لاشتمالها على أماكن وقصور ومجالس، أو: في هذه الآلاء المعدودة، من الجنتين والعينين والفاكهة والغرس والجَنْي، { قاصراتُ الطَّرْفِ } جَوار قَصَرْنَ أبصارَهنّ على أزواجهن، لا ينظرن إلى غيرهم، { لم يَطْمِثْهُنَّ إِنسٌ قبلهم ولا جانٌّ } أي: لم يمس الإنسيات أحدٌ من الإنس، ولا الجنيات أحدٌ من الجن\n والطمث: الجماع بالتدمية\n وفي الآية دليل على أنّ الجن يطمثون كما يطمث الإنس",
      "translations": []
    }
  ]
}