{
  "chapter": "الرحمن",
  "text": "ومن دونهما جنتان",
  "translations": [
    {
      "translation": "As well as those two there will be two other Gardens.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And besides these two other gardens --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And besides these two there shall be two other Gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Besides this, there will be two other gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And besides them, there are two more Gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And below these two, there are two other Gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And besides these two are two (other) gardens:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And besides these shall be two gardens --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And beside them are two other gardens,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Besides those two there shall be two other gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And beside the two there will be two other Gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beside these two, there will be two [other] gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And besides these two, there are two other Gardens,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And besides these two, there are two other Gardens (i.e. in Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And beside these there shall be two Gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And beneath them are two gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And below them both [in excellence] are two [other] gardens -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[55:62]   And beside these, two mentioned gardens, there will be two [other] gardens, in addition, for those who feared the standing before their Lord.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And beside them) besides the gardens mentioned earlier (are two other Gardens) which are less than the first two and which are: the Garden of Comfort (jannat al-na'im) and the Garden of Refuge (jannat al- 637 ma'wa),\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ومن دونهما } أي: من ورائهما من مكان قريب منهما كما تقول: دونك الأسد، لا من دونهما بالنسبة إلى أصحابهما فيكون بمعنى قدّامهما بل بمعنى بعدهما أو من غيرهما، كقوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوهاتان الجنتان المذكوران مع ما فيهما من المقامات العلية والدرجات السنية للخائفين من الله، ومن سطوة قهره وجلاله في عموم أحوالهم وأطوارهم، المفوضين المتوكلين عليه سبحانه عموم أمورهم في مطلق شئونهم وتقليداتهم، الراجين منه رضاه عنهم بمتقضى لطفه وجماله { وَمِن دُونِهِمَا } أي: من دون الجنتين المذكورتين، وأدون منهما وأنزل رتبة { جَنَّتَانِ } [الرحمن: 62] أخريان أيضاً للأبرار المسحنين بالأخلاق وال عمال المشتبثين بأذيال الأماني والآمال حيث الحوائج والأغراض، { فَبِأَيِّ آلاۤءِ رَبِّكُمَا تُكَذِّبَانِ } [الرحمن: 63]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ومِن دونهما جنتانِ } أي: ومن دون تَيْنِك الجنتين الموعودتين للمقربين { جنتان } أخريان لِمن دونهم من أصحاب اليمين، ويؤيده حديث أبي موسى، قال في هذه الآية\n { ولمن خاف مقام ربه } قال: \" جنتان من ذهب للسابقين، وجنتان من وَرِق لأصحاب اليمين \" ورَفَعه، ولا شك أنَّ الذهب أرفع من الوَرِق، فلا يلتفت إلى الفضة مَن له الذهب، خلافاً لمن قال: يلزم حرمان أهل الطبقة الأولى - وهم السابقون - ما ذكر في الحديث من الفضة، واختار في نوادر الأصول أنَّ قوله: { ومن دونهما } أي: في القُرب إلى العرش، وأنَّ هذه أعلى وَصْفاً مما ذكر قبلُ، إلى العرش، وبَسَطَ القول في ذلك، ومثله ذكره ابن عطية عن ابن عباس، واحتج لذلك، ولكن الأكثرعلى خلاف ذلك، وسيأتي بيانه إن شاء الله\n { فبأي آلاء ربكما تُكّذِبان مُدْهامَّتان } خضراوان تميلان إلى السواد، من شدة الخضرة، وفيه إشعار بأنَّ الغالب على هاتين الجنتين النبات والرياحين المنبسطة على وجه الأرض، وعلى الأُوليين الأشجار والفواكه، ومَن اشتهى فيها شيئاً يُعطاه، { فبأي آلاء ربكما تُكَذِّبان } كرر التوبيخ مع ذكر الموصوف ومع صفته تنبيهاً على أنّ تكذيب كل من الموصوف والصفة حقيق بالإنكار، { فيهما عينان نَضَّاختان } فوّارتان بالماء، والنضخ أكثر من النضح - بالمهملة - وهو الرش، { فبأي آلاء ربكما تُكذِّبان }\n { فيهما فاكهةُ ونخلٌ ورمانٌ } عطف الأخيرين على الفاكهة عطف خاص على عام لفضلهما، فإنَّ ثمر النخل فاكهة وغذاء، والرمان فاكهة ودواء\n قال أبو حنيفة: مَن حَلَفَ لا يأكل فاكهة فأكل رُماناً أو رطباً لم يحنث، وقوفاً مع ظاهر العطف، وعندنا الأَيمان مبنية على الأعراف، وهي تختلف باختلاف الأقطار\n { فبأي آلاء ربكما تُكَذِّبان } ولا شيء منها يقبل الإنكار\n { فيهنَّ خَيْراتٌ حِسَانٌ } أي: في الجنتين المشتملتين على قصور ومساكن نساء { خيرات } أي: فاضلات الخُلُق، حِسان الخَلْق، وهو مخفف من \" خير \" بالتشديد، وقرئ خيِّرات على الأصل، { فبأي آلاء ربكما تُكَذِّبان }\n { حُورٌ } بدل من \" خيرات \" { مَقصوراتٌ في الخيام } قُصِرن في خدورهن\n يقال: امرأة قصيرة وقَصُورة، ومقصورة، أي مخدّرة، أو: مقصورات الطرف على أزواجهن ساكنة في الخيام\n قال القشيري: قصرن أنفسَهن وقلوبَهن وأبصارَهن على أزواجهن\n هـ\n يقلن: نحن الناعماتُ فلا نبأس، الخالداتُ فلا نَبيدُ، الراضيات فلا نَسْخَط\n وفي خبر: أن عائشة قالت: \" إنَّ المؤمنات أجَبْنَهُنَّ، نحن المُصلِّياتُ وما صلَّيْتُنَّ، نحن الصائمات وما صُمتُنَّ، نحن المتصدِّقاتُ وما تصدَّقْتنَّ، قالت عائشة: فغلبنهن \"\n والخيام من الدر المجوف، { فبأي آلاء ربكنما تُكَذِّبان }\n { لم يَطْمِثْهُن إِنسٌ قبلهم ولا جانٌّ فبأي آلاء ربكما تُكَذِّبان }\n { متكئين } نصب على الاختصاص، { على رَفْرَفٍ }  هو كل ثوب عريض، وقيل: هو الوسائد، والأظهر من الحديث أنه سرير مفروش بثياب خُضر، يركب فيه أهل الجنة، ويسير بهم حيث شاؤوا، وقوله: { خُضْرٍ } ، وصف لرفرف لأنه مُحلّى بثيابٍ خُضر، والرفرف: إما اسم جنس، أو اسم جمع، واحده: رفرفة\n\n\n{ وعبقريٍّ حِسَانٍ } أي: طنافس، وهي جياد البُسط، كالزرابي وشبهها\n والعبقري: منسوب إلى عبقر، تزعم العرب أنه اسم بلد الجن، يسبون إليه كل شيء عجيب\n وقال أبو عبيد: هو منسوب إلى أرض يُعمل فيها الوَشي، فينسب إليها كل مبالغ في الوصف، وقال الخليل: كل جليل فاضل نفيس فاخر من الرجال وغيرهم عند العرب عبْقري، ومنه\n\n \" قوله صلى الله عليه وسلم في عمر: \" فلم أرَ عَبْقريّاً من الناس يَفْرِي فَرْيَه \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "114:6",
      "similarity": 0.5225796901034769
    },
    {
      "verse": "19:81",
      "similarity": 0.4399894482952861
    },
    {
      "verse": "16:20",
      "similarity": 0.43950698336766675
    },
    {
      "verse": "26:27",
      "similarity": 0.4230677145960884
    },
    {
      "verse": "89:30",
      "similarity": 0.3930404729156213
    }
  ]
}