{
  "chapter": "الرحمن",
  "text": "هل جزاء الاحسن الا الاحسن",
  "translations": [
    {
      "translation": "Will the reward for doing good be anything other than good?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should the reward of goodness be aught else but goodness? --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can the reward of goodness be any other than goodness?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can any thing else be a response to a favor but a favor?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is the reward of virtue except virtue (in return)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is there any reward for good other than good\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is the reward of goodness aught but goodness?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall the recompense of goodness be other than goodness?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is the reward of goodness aught save goodness?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The reward of goodness shall be nothing but goodness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall the recompense of kindness be aught save kindness?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is the requital of goodness anything but goodness?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is there any Reward for Good - other than Good?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is there any reward for good other than good?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall the recompense of goodness be anything other than goodness?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is the reward of goodness anything but goodness?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is the reward for good [anything] but good?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[55:60] Is the reward of goodness, [manifested] through obedience, anything but goodness?, [granted] through bliss?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Is the reward of goodness aught save goodness?) He says: is the reward of he whom We have blessed with the profession of Allah's divine Oneness anything but the Garden?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { هَلْ جَزَآءُ ٱلإِحْسَانِ إِلاَّ ٱلإِحْسَانُ } قال الإِمامُ زيد بن علي عليهما السّلامُ\n فالإِحسانُ الأَولُ: هو الإيمانُ والتوحيدُ، والإِحسانُ الثاني: هو الجَنةُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {Is the reward for goodness anything but goodness?} Imam Zaid ibn Ali said, peace be upon him\n\n\nThe first kind of goodness is faith and unity, and the second kind is paradise.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ هل جزاء الإحسان } في العمل وهو العبادة مع الحضور { إلاَّ الإحسان } في الثواب بحصول الكمال والوصول إلى الجنّتين المذكورتين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { هل جزاءُ الإِحسان إِلاَّ الإِحسانُ } هو استئناف مقرر لما فصّل قبله، أي: ما جزاء الإحسانِ في العمل إلاّ الإحسانُ في الثواب، قال أنس: قرأها النبي صلى الله عليه وسلم فقال:\n\n \" هل تدرون ماذا قال ربكم؟ قال: هل جزاءُ مَن أنعمتُ عليه بالتوحيد إلاّ الجنة \" \n\nوفي لفظ آخر:\n\n \" هل جزاء مَن أنعمت عليه بتوحيدي ومعرفتي إلاّ أن أُسكنه جنتي وحظيرة قدسي برحمتي \" \n\nأو: هل جزاء مَن قال \" لا إله إلا الله \" إلاَّ الجنة\n قال السدي: هل جزاء الذين أطاعوا في الدنيا إلاّ الكرامة في الآخرة\n وقال جعفر الصادق: هل جزاء مَن أحسنتُ إليه في الأزل إلاَّ حفظ الإحسان عليه في الأبد\n قال الحسن: هي مسجلة - أي مطلقة - للبر والفاجر، للفاجر في دنياه، وللبَر في عُقباه\n هـ\n { فبأي آلاء ربكما تُكذِّبان }\n الإشارة: { ولمن خاف مَقام ربه } فرَاقَبه، ثم شاهَده، { جنتان } جنة المعارف مُعجّلة، وجنة الزخارف معها مُؤجلة، أو: جنة المعارف لأرواحهم، وجنة الزخارف لأشباحهم\n قال القشيري: جنتان: جنة مُعَجَّلة من حلاوة الطاعة ورَوْح القرب، ومؤجَّلة في الآخرة، وهي جنة الثواب، وهم مختلفون في جنان الدنيا على قدر تفاوت مقادير أحوالهم، كما يختلفون في الآخرة في درجاتهم\n هـ\n فجنة حلاوة الطاعة لأهل اليمين، وجنة روح القرب للمقربين\n قال الورتجبي: جنتان: جنة المشاهدة وجنة المكالمة، جنة المحبة وجنة المكاشفة، جنة المعرفة وجنة التوحيد، جنة المقامات وجنة الحالات، جنة القلب وجنة الروح، جنة الكرامات وجنة المداناة\n هـ\n أو: جنة الوصال وجنة الكمال، أو: جنة الكمال وجنة التكميل، أو جنة الفناء وجنة البقاء، أو جنة البقاء وجنة الترقِّي إلى غير انتهاء\n وقوله تعالى: { ذواتا أفنان } يُشير إلى ما في هاتين الجنتين من فنون العلوم والأذواق، والأسرار والأنوار، وتفنُّن الأفكار في بحار الأسرار، فيهما لكل واحدٍ عينان تجريان، إحداهما بعلوم الشريعة والمعاملة وآداب العبودية، وأخرى بعلوم الحقيقة والطريقة والتوحيد الخاص، فيهما من كل فاكهةٍ من فواكه الأذواق صنفان: صنف حاصل، وصنف يتجدّد بتجدُّد الأنفاس، أو: صنف لعالم الحكمة، وصنف لعالم القدرة، أو: صنف للذات وصنف للصفات، أو: صنف لحلاوة المشاهدة وصنف لآداب المعاملة\n\n\nمتكئين على فُرش الأُنس، بطائنها من استبرق الروح والفَرح ودوام البِسط، وجنا الجنتين دانٍ لمَن تمكّن من الشهود لأنّ ثمار المعارف من حلاوة الشهود والأُنس صارت طوع يده، فشُهوده دائم، وقُربه للحبيب لازم، فمهما أجال فكرته غاصت في بحار الأحدية، واستخرجت من يواقيت الحِكَم، وجواهر العلوم، ما لا يُحيط به المفهوم، بخلاف غير المتمكن، تعب الفكرة ينقص له من لذة الشهود\n قال القشيري: إذ لا لذة في أوائل المشاهدة، وإليه الإشارة بقوله صلى الله عليه وسلم:\n\n \" اللهم ارزقني لذةَ النظر إلى وجهك والشوق إلى لقائك، في غير ضرّاء مضرة\n\n\n \" \n\nالحديث\n هـ\n فِيهن قاصرات الطرف، أي: أبكار الحقائق خاصة بهم لا تنكشف لغيرهم\n لم يطمثهن إنس قبلهم ولا جان لم يمس تلك الحقائق غيرهم، لأنها خاصة بأهل الأذواق، وكل واحد يمس من الحقائق ما لا يمس غيره، وينكشف له ما لا ينكشف لغيره، لأنها على حسب الاستعداد\n كأنهن - أي: تلك الحقائق - الياقوتُ في صفاء معناها، والمرجان في حسن مبناها، هذا جزاء أهل مقام الإحسان\n { هل جزاء الإحسان إلاّ الإحسان } أي: هل جزاء أهل مقام الإحسان إلاَّ الإحسان والتقريب والتخصيص بهذه العلوم والحقائق، أو: هل جزاء الإحسان معنا إلا الإحسان بكشف ذاتنا، أو: هل جزاء الإحسان إلى عبادي إلاّ الإحسانُ بقربي وولايتي\n قال ابن جزي: ويحتمل أن يكون الإحسان هنا هو الذي سأل عنه جبريل عليه السلام\n\n \" أن تعبد الله كأنك تراه \" \n\nفجعل جزاء ذلك الإحسان بهاتين الجنتين، ويُقوي ذلك: انه جعل هاتين الجنتين الموصوفتين هنا لأهل المقام العَلي وجعل جنتين وجعل جنتين دونهما لمَن كان دون ذلك، فالجنتان المذكورتان أولاً للسابقين، والمذكورتان بعد ذلك لأصحاب اليمين، حسبما ورد في الواقعة\n انظر تمامه\n وإلى جنتي أهل اليمين أشار تعالى بقوله: { وَمِن دُونِهِمَا جَنَّتَانِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:17",
      "similarity": 0.8097719551571865
    },
    {
      "verse": "37:110",
      "similarity": 0.6266290684284929
    },
    {
      "verse": "37:80",
      "similarity": 0.6199774340690885
    },
    {
      "verse": "37:121",
      "similarity": 0.6199774340690885
    },
    {
      "verse": "37:131",
      "similarity": 0.6199774340690885
    }
  ]
}