{
  "chapter": "الرحمن",
  "text": "تبرك اسم ربك ذى الجلل والاكرام",
  "translations": [
    {
      "translation": "Blessed be the name of your Lord, Master of Majesty and Generosity.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be the name of your Lord, full of majesty and beneficience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be the name of your Lord, the Lord of Majesty and Glory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is the Name of your Lord, the Lord of Glory and Grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most Auspicious is the name of your Lord, the Most Majestic and the Most Honourable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be the Name of your Lord, Dhil-Jalali wal-Ikram.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be the name of your Lord, the Lord of Glory and Honor!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be the Name of thy Lord, majestic, splendid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be the name of thy Lord, Mighty and glorious!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be your Lord's name, full of glory and majesty!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blest be the name of thine Lord, Owner Of Majesty and Beneficence!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is the Name of your Lord, the Majestic and the Munificent!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be the name of thy Lord, full of Majesty, Bounty and Honour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be the Name of your Lord (Allah), the Owner of Majesty and Honour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be the Name of your Lord, Majestic, Splendid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be the name of your Lord, Full of Majesty and Splendor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is the name of your Lord, Owner of Majesty and Honor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[55:78] Blessed be the Name of your Lord, He of Majesty and Munificence (as [explained] above; the word ism is extra). Meccan, except for verses 81 and 82, which are Medinese; it consists of 96, 97 or 99 verses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Blessed be the Name of thy Lord) your Lord is the Possessor of grace and Mercy; and it is said: Allah exonerates Himself from having a son or partner, (Mighty) the Possessor of might and sovereignty (and Glorious) and the Possessor of forgiveness and beneficence upon the advent of the Day of Judgement!' And of the surah in which the Event is mentioned, which is all Meccan to the exception of Allah's saying (Is it this Statement that ye scorn. And make denial thereof your livelihood?) and His saying (A multitude of those of old. And a multitude of those of later time)-which were revealed to the Prophet (pbuh) on his way to Medina-, and it consists of 99 verses, 878 words and 1903 letters: Surah 56: The Event (al-Waqi'ah) And of the surah in which the Event is mentioned, which is all Meccan to the exception of Allah's saying (Is it this Statement that ye scorn. And make denial thereof your livelihood?) and His saying (A multitude of those of old. And a multitude of those of later time)— which were revealed to the Prophet (pbuh) on his way to Medina—, and it consists of 99 verses, 878 words and 1903 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { تبارك } أي: تعالى وتعاظم { اسم ربّك } أي: الاسم الأعظم الذي به تزيد وترتقي مرتبة السالكين من البداية إلى النهاية حتى الوصول إليه والفوز به { ذو الجلال والإكرام } أي: الجلال في صورة الجمال والجمال في صورة الجلال اللذان لا يحجب أحدهما عن الآخر عند البقاء بعد الفناء للمحبوبين المحبين السابقين إلى غاية الدرجات بخلاف الجلال والإكرام المذكورين قبل\nفإنهما هناك يحجب أحدهما عن الآخر لعدم تحقق الفاني بالوجود الحقاني والرجوع إلى تفاصيل الصفات وشهودها في عين الجمع",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:27",
      "similarity": 0.9171404705088454
    },
    {
      "verse": "38:29",
      "similarity": 0.10959643109886942
    },
    {
      "verse": "23:29",
      "similarity": 0.1082231321020057
    },
    {
      "verse": "43:85",
      "similarity": 0.10619081316967433
    },
    {
      "verse": "67:1",
      "similarity": 0.10136565916223818
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/055078.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/055078.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/55:78.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}