{
  "chapter": "الواقعة",
  "text": "وفكهة مما يتخيرون",
  "translations": [
    {
      "translation": "And any fruit they specify",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And such fruits as they fancy,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they will also go about them with the fruits of which they may choose,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also, they will be served with the fruits of their choice\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fruits that they may like.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And with fruit that they may choose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fruits such as they choose,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and such fruits as they shall choose,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fruit that they prefer\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "along with fruits of their choice;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And with fruit from that which they choose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and such fruits as they prefer\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And with fruits, any that they may select:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fruit; that they may choose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "with fruits of their own choice\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fruits of their choice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And fruit of what they select\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[56:20] and such fruits as they prefer,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And fruit) different kinds of fruit (that they prefer) that they desire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَفَاكِهَةٍ } كثيرة { مِّمَّا يَتَخَيَّرُونَ } [الواقعة: 20] أي: يختارون وينتخبون لأنفسهم من أنواع المعارف والحقائق والأحوال والمقامات التي تتلذذها أرواحهم من آثار الأسماء والصفات الإلهية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وفاكهةٍ مما يتَخيَّرون } أي: يختارونه ويأخذون خيره وأفضله، يجنونه بأيديهم، وهو أشد نعيماً وسروراً من أخذه مجنياً، { ولحم طيرٍ مما يشتهون } مما يتمنون مشوياً أو مطبوخاً، { وحُورٌ عِينٌ } أي: وفيها حور عين، أو: لهم حور عين، ويجوز أن يعطف على \" ولدان \" أي: وتخدمهم حُور عين، زيادة في التعظيم، ومَن قرأ بالخفض عطفه على \" جنات النعيم \" كأنه قيل: هم في جنات النعيم وفاكهة ولحم طير وحور { كأمثالِ اللؤلؤ المكنونِ } في الصفاء والنقاء\n\n\nوالمكنون: المصون في صَدفه\n وقال الزجاج: كأمثال الدُرِّ حين يخرج من صدفه، لم يُغيرّه الزمان واختلاف الأيدي عليه، { جزاء بما كانوا يعملون } مفعول له، أي: يفعل بهم ذلك لجزاء أعمالهم الصالحة أو: مصدر، أي: يُجزَون جزاء، فنفس الدخول للجنة بمحض الرحمة، وكثرة النعيم والغُرف بالعمل، والترقي باليقين والمعرفة - والله تعالى أعلم - فلا تعارض\n { لا يَسْمَعون فيها } في الجنة { لَغواً } باطلاً { ولا تأثيماً } هذياناً، أو: ما يُؤهم صاحبه لو كف، { إِلاَّ قِيلا } أي: قولاً { سلاماً سلاماً } أي: ذا سلامة\n والاستثناء منقطع، و \" سلاماً \" بدل من \" قيلاً \" أو: مفعول به لـ \" قيلاً \" ، أي: لا يسمعون فيها إلا أن يقولوا سلاماً سلاماً، والمعنى: أنهم يُفشون السلام فيُسَلِّمون سلاماً بعد سلام، أو: لا يسمع كلٌّ من المسلِّم والمسلِّم عليه إلا سلام الآخر بدءاً ورداً\n والله تعالى أعلم\n الإشارة: أخبر تعالى أنّ المقربين في الصدر الأول أكثر من الزمان الأخير، وهو كذلك من جهة الكمية، وأما من جهة الكيفية فالمقربون في آخر الزمان أعظم رتبةً، وأوسع علماً وتحقيقاً لأنهم نهضوا في زمان الغفلة، وجدُّوا في زمان الفترة، لم يجدوا من أهل الجدّ إلا قليلاً، ولا من أهل الحق إلا نذراً يسيراً، فحيث نهضوا وحدهم عوّضهم الله مرتبة لم يعطها لغيرهم، ويشهد لهذا قوله عليه السلام:\n\n \" اشتقت إلى إخواني \" قال أصحابه، نحن إخوانك يا رسول الله؟ قال: \" أنتم أصحابي، إخواني قوم يأتون بعدي، مِن نعتهم كذا وكذا \" ثم قال: \" يعدل عمل واحد منهم سبعين منكم \" قالوا: يا رسول الله منهم؟ قال: \" منكم \" قيل: بماذا يا رسول الله؟ قال: \" إنكم وجدتم على الخير أعواناً، وهم لم يجدوا عليه أعواناً \" \n\nوفي حديث آخر، رواته ثقات:\n\n \" قالوا: يا رسول الله هل أحد خير منا؟ قال: \" قوم يجيئون بعدكم، فيجدون كتاباً بين لوحين، يؤمنون بما فيه، ويؤمنون بي، ولم يروني، ويُصَدِّقون بما جئتُ به، ويعملون به، فهم خير منكم \" \n\n، ولا يلزم من تفضيلهم مِن جهةٍ تفضيلهم مطلقاً\n ثم وصف المقرّبين بكونهم على سُرر الهداية، منسوجة بالعِز والعناية، محفوفة بالنصر والرعاية، متكئين عليها، راسخين فيها، متقابلين في المقامات والأخلاق، أي: يواجه بعضهم بعضاً بقلوبهم وأسرارهم، لا تَباغض بينهم ولا تحاسد، تطوف عليهم الأكوان وتخدمهم، \" أنت مع الأكوان ما لم تشهد المُكوّن، فإذا شهدت المُكوِّن كانت الأكوان معك \": يُسقون بأكوابٍ وأباريق من علم الطريق، وكأس من خمر الحقيقة، فلا يتصدّعون من أجلها إذ ليست كخمر الدوالي، ولا يُنزفون: لا يسكرون سُكْر اصطلام، وإنما يسكرون سُكراً مشوباً بصَحْوٍ، إذا كان الساقي عارفاً ماهراً\n\n\nوفاكهة حلاوة الشهود، مما يتخيرون، إن شاؤوا بالفكرة والنظرة، وإن شاؤوا بالذِكر والمذاكرة، وكان بعض أشياخنا يقول: خمرة الناس في الحضرة، وخمرتنا في الهدرة، أي: المذاكرة\n ولحم طير من علوم الطريقة والشريعة، مما يشتهون منها، وحُورق عِين من أبكار الحقائق، مصونة عن غير أهلها، كأمثال اللؤلؤ المكنون، جزاء على مجاهدتهم ومكابدتهم\n لا يسمعون في جنة المعارف لغواً ولا تأثيماً لتهذيب أخلاق أهلها، كما قال ابن الفارض رضي الله عنه:\n\nفلا تسمع من الصوفية إِلا قيلاً سلاماً سلاماً، كما قيل في حقيقة التصوُّف: أخلاقٌ كرام، ظهرت من قوم كرام، في زمن كريم\nهـ\n ثم ذكر أصحاب اليمين، فقال: { وَأَصْحَابُ ٱلْيَمِينِ مَآ أَصْحَابُ ٱلْيَمِينِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:57",
      "similarity": 0.8945236155108657
    },
    {
      "verse": "56:32",
      "similarity": 0.8925542859403713
    },
    {
      "verse": "44:27",
      "similarity": 0.8706009652225415
    },
    {
      "verse": "44:55",
      "similarity": 0.8558580671627131
    },
    {
      "verse": "43:73",
      "similarity": 0.8183087487104768
    }
  ]
}