{
  "chapter": "الواقعة",
  "text": "ثم انكم ايها الضالون المكذبون",
  "translations": [
    {
      "translation": "Then you, the erring and the deniers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then you, the erring ones and those that gave the lie to the Truth,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then you people who had gone astray and rejected the Truth\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then indeed you, the astray, the deniers –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then verily, --- you the erring -- ones, the deniers!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then shall you, O you who err and call it a lie!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then you erring ones, you that cried lies,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then lo! ye, the erring, the deniers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then you, you misguided ones, who deny the truth,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then verily ye, O ye erring, denying people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then indeed, you, astray deniers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then will ye truly,- O ye that go wrong, and treat (Truth) as Falsehood!-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then moreover, verily, you the erring-ones, the deniers (of Resurrection)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then you went astray, you that belied,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then you, you misguided, who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then indeed you, O those astray [who are] deniers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[56:51] Then indeed you, the erring, the deniers,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then lo! ye, the erring) from faith and guidance, (the deniers) of Allah, His Messenger and Scripture. This refers to Abu Jahl and his host,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ إِنَّكُمْ } بعد اجتماعكم وحشركم { أَيُّهَا ٱلضِّآلُّونَ ٱلْمُكَذِّبُونَ } [الواقعة: 51] المصرون على التكذيب والإنكار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم إِنكم أيها الضالون } عن الهدى { المكذِّبون } بالبعث، والخطاب لأهل مكة وأضرابهم، { لآكلون } بعد البعث والجمع ودخول جهنم { مِن شجرٍ مِن زقوم } \" مِن \" الأولى: لابتداء الغاية، والثانية: لبيان الشجر\n { فمالئُون منها البطونَ } أي: بطونكم من شدة الجوع، { فشاربون عليه } عقب ذلك بلا ريث { من الحميم } الماء الحار\n\n\nأنّث ضمير الشجر على المعنى، وذكَّره على اللفظ في \" منها \" و \" عليه \"\n { فشاربون شُرْبَ الهِيم } وهي الإبل التي بها الهُيَام، وهو داء يُصيبها فتشرب ولا تروَى، أي: لا يكون شربكم شراباً معتاداً، بل يكون مثل شرب الإبل الهيم، واحدها: \" هيماء وأَهْيَم \" وحاصل الآية: أنه يُسلط عليهم من الجوع ما يضطرون معه إلى أكل الزقوم، الذي هو كالمهل، وإذا ملأوا منه البطون يُسلّط عليهم ما يضطرّهم إلى شرب الحميم، الذي يُقَطِّع أمعاءهم، فيشربونه شرب الهِيم، وإنما صحّ عطف الشاربين على الشاربين، وهما لذوات متّفقة، لأنَّ كونهم شاربين الحميم مع ما هو عليه من تناهي الحرارة، وقطع الأمعاء، أمر عجيب، وشربهم له على ذلك كشرب الهِيم الماء أمر عجيب أيضاً، فكانت صفتين مختلفتين\n { هذا نُزلُهم } النُزل: هو الرزق الذي يُعدّ للنازل تكرمةً له، { يَوْمَ الدَّينِ } يوم الجزاء، فإذا كان نُزلهم هذا، فما ظنك بعدما استقر بهم القرار، واطمأنت بهم الدار في النار؟ وفيه من التهكُّم ما لا يخفى\n { نحن خلَقناكم فلولا } فلاّ { تُصَدِّقُونَ } تحضيض على التصديق، إمَّا بالخَلق لأنهم وإن كانوا مصدّقين به إلاّ أنه لمّا كان مذهبهم خلاف ما يقتضيه التصديق فكأنهم مكذّبون به، وإمّا بالعبث لأنّ مَن خلَق أولاً لم يمتنع عليه أن يَخلق ثانياً\n الإشارة: أصحاب الشمال هم أهل الخذلان من العصاة والجُهال، في سَموم الجهل والبُعُد، ينفذ في مسام أرواحهم وقلوبهم، وحميم الحرص والتعب، والجزع والهلع، وظِلٍّ من يحموم، وهو التدبير والاختيار، لا بارد ولا كريم، أي: ليس كظل الرضا وبرد التسليم، بل هو ظل مشؤوم، حاجب عن شمس العيان، مُوقع في ظل الذل والطمع والهوان\n إنهم كانوا قبل ذلك قبل وقت وصول العارفين مُترفين متنعمين في الحظوظ، منهمكين في الشهوات، وكانوا يُصِرُّون على الحنث العظيم، وهو حب الدنيا، الذي هو رأس كل خطيئة، وكانوا يُنكرون بعث الأرواح من الجهل إلى العرفان، ويقولون: { أئذا متنا وكنا تراباً } ، أي: أرضيين بشريين، وعظاماً يابسين بالقسوة والبُعد، { أئنا لمبعوثون } من هذه الموتة إلى حياة أرواحنا بالعلم والمعرفة؟ والحاصل: أنهم كانوا ينكرون وجود أهل التربية الذي يُحيي اللّهُ بهم القلوبَ والأرواحَ الميتة بالجهل والغفلة\n قل إنَّ الأولين منكم الذين كانوا على هذا الوصف، والآخرين إلى يوم القيامة، لمجموعون إلى الحضرة، إذا صَحِبوا أهل التربية، فيفتح الله عليهم إلى ميقات يوم معلوم، وهو الحد الذي سبق لفتحهم",
      "translations": []
    }
  ]
}