{
  "chapter": "الواقعة",
  "text": "لو نشاء لجعلنه حطما فظلتم تفكهون",
  "translations": [
    {
      "translation": "We could turn it, if We pleased, into straw; then you would rue the day,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We so wished, We could have reduced your harvest to rubble, and you would have been left wonder-struck to exclaim:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We wanted, We could have crushed it to bits and you would have been left to lament,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We will We can make it like dry trampled hay, so you would keep crying out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it Our will, We could crumble it to dry pieces, and you would be Tafakkahun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We pleased, We should have certainly made it broken down into pieces, then would you begin to lament:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did We will, We would make it broken orts, and you would remain bitterly jesting --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We willed, We verily could make it chaff, then would ye cease not to exclaim:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We so pleased, We could turn your harvest into chaff. Then you would start lamenting,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We willed, surely We would make it chaff, so that ye would be left wondering.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We wish, We turn it into chaff, whereat you are left stunned [saying to yourselves,]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it Our Will, We could crumble it to dry powder, and ye would be left in wonderment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it Our Will, We could crumble it to dry pieces, and you would be regretful (or left in wonderment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We will, We would make it broken stubble and you would remain wondering,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We will, We can turn it into rubble; then you will lament.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If We willed, We could make it [dry] debris, and you would remain in wonder,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[56:65] If We will, We could surely turn it into chaff, dried vegetation producing no seed, and you would remain (zaltum is actually zaliltum, the lām having a kasra inflection; but it has been omitted to soften it), that is to say, you spend all day, bemused (tafakkahūna: one of the original tā’ [tatafakkahūna] letters has been omitted), surprised by this, and you would say:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If We willed, We verily could make it) the cultivation (chaff) and dry after being green, (then would ye cease not to exclaim) then you would wonder at its dryness and destruction, and exclaim:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَوْ نَشَآءُ لَجَعَلْنَاهُ حُطَاماً } معناه رُفاتٌ\n\n\n\n\nوقوله تعالى: { فَظَلْتُمْ تَفَكَّهُونَ } معناه تَتَعجبون\n ويقال تَتَلاومون\n ويقال: تندمون وهي لغة لعُكلٍ وتميم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nمع أنا { لَوْ نَشَآءُ } ونختار عدم إنباتها ونمائها { لَجَعَلْنَاهُ حُطَاماً } أي: الزرع الثابت حطاماً يابساً، هباء هشيما { فَظَلْتُمْ تَفَكَّهُونَ } [الواقعة: 65] أي: صرتم حينئذ تتعجبون وتتأسفون من يبسها وضياعها، وليس لكم سوى الحسرة والأسف شيء، بل تقولون حينئذ من شدة التضجر والتحزن\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ لو نشاء لجعلناه حُطاماً } هشيماً منكسِراً قبل إدراكه، { فَظَلْتم } بسبب ذلك { تَفَكَّهُون } تتعجَّبُون من سوء حاله إثر ما شهدتموه على أحسن ما يكون، أو: تندمون على تعبكم فيه وإنفاقكم عليه، أو: على ما اقترفتم من المعاصي التي أُصبتم لذلك من أجلها، و \" تفكه \" من أفعال الإزالة، كتخرّج، وتأثّم، أي: أزال الفُكَاهة، وهي المسرة، فتحصل الندامة، { إِنَّا لمُغْرَمُونَ } أي: قائلين: إنّا لملزمون غرامةَ ما أنفقنا فيها، أو: لمهلَكون لِهلاك قوتنا، من: الغرام، وهو الهلاك، { بل نحن محرومون } حُرمنا ما رزقنا بشؤم تفريطنا، فالمحروم هو الممنوع الرزق\n قال ابن عباس: \" هو المحارَف \" الذي انحرف عنه رزقه\n { أفرأيتم الماءَ الذي تشربون } أي: الماء العذب الصالح للشرب، { أأنتم أنزلتموه من المُزنِ } السحاب الأبيض، وهو أعذب ماءٍ، أو مطلق السحاب، واحدها \" مزنة \" ، { أم نحن المنزلون } بقدرتنا، فأسكناه في الأرض، ثم أخرجناه عيوناً وأنهاراً؟ { لو نشاء جعلناه أُجَاجاً } أي: ملحاً، أو مُرّاً لا يُقْدَر على شربه، { فلولا } فهلاَّ { تشكرون } تحضيض على شكر الكل، وحذف اللام هنا مع إثباتها في الشرطية الأولى لأنّ هذه اللام تُفيد معنى التأكيد، فأُدخلت في آية المطعوم دون المشروب للدلالة على أن أمر المطعوم متقدم على أمر المشروب، وأنْ الوعيد بفقده أشد وأصعب، مِن قِبَل أنّ المشروب إنما يُحتاج إليه تبعاً للمطعوم، ولهذا قُدِّمت آية المطعوم على آية المشروب، وقيل غير ذلك في حكمة إدخالها\n { أفرأيتم النارَ التي تُورون } أي: تقدحونها وتستخرجونها من الزناد، والعرب كانت تقدح بعودين، تحك أحدهما على الآخر، ويُسمون الأعلى: الزند، والسفلى: الزندة، شبّهوهما بالفحل والطروقة\n { أأنتم أنشأتم شجرتَهَا } التي بها الزناد، وهي المرْخ والعَفَار، { أم نحن المنشئون } الخالقون لها ابتداءً بقدرتنا؟ والتعبير عن خلقها بالنشأ، المنبئ عن بديع الصنع، المُعْرِب عن كمال القدرة والحكمة لِما فيه من الغرابة الفارقة بينهما وبين سائر الأشجار، التي لا تخلو عن النار، حتى قيل: في كل شجر نار واستمجد المرخ والعَفَار، كما أنّ التعبير عن نفخ الروح بالإنشاء في قوله:\n\n[المؤمنون: 14] كذلك\n ثم بيَّن منافعها، فقال: { نحن جعلناها تذكرةً } تذكيراً لنار جهنم، لينظروا إليها، ويذكروا ما وُعدوا به من نار جهنم، أو: تذكرة وأنموذجاً، لما رُوي عن النبي صلى الله عليه وسلم أنه قال:\n\n \" نارُكم هذه التي يُوقدها بنو آدم هي جزءٌ من سبعين جزءاً من حَرِّ جهنم \" \n\nوقيل: تبصرة في أمر البعث فإنه ليس أبدع من إخراج النار من الشيء الرطب، { ومتاعاً للمُقْوين } منفعة للمقوين المسافرين الذي ينزلون القِواء، وهو القفر\n وفي القاموس: القِيُّ: فقر الأرض، كالِقواء - بالكسر والمد: القفر\n هـ\n وتخصيصهم بذلك لأنهم أحوج إليها فإنّ المقيمين والنازلين بقرب منازلهم ليسوا بمضطرين إلى الاقتداح بالزناد، أو: للذين خلت بطونهم ومزاودهم من الطعام، من قولهم: أَقْوت الدار: إذا خلت من ساكنها\n\n\nوالأول أحسن\n بدأ أولاً بنعمة الإيجاد، ثم بإمداد الطعام، ثم بالشراب، وما يُعجن به من الطعام، ثم بما يطبخ به فلا يؤكل الطعام إلاّ بعد هذه الثلاث، ولا يستغني عنه الجسد ما دام حيّاً في حكم العادة\n ولمَّا ذكر دلائل توحيده وقدرته، أمر بتنزيهه عمَّا لا يليق بحاله لأنّ العقل إذا أدرك الصانع سما إلى درك كنهه، فربما يقع في التشبيه أو التجسيم أو التعطيل، فقال: { فَسَبِّح باسم ربك } أي: فنزّه ربك عما لا يليق به أيها المستمع المستدل، فأراد بالاسم المسمى، والباء صلة، أي: نزَّه ربك { العظيم } أو: نزّه ربك ملتبساً بذكر اسمه\n والعظيم: صفة للرب، أو للاسم، لأن المراد به المسمى\n والله تعالى أعلم\n الإشارة: أفرأيتم أيها المشايخ ما تُمْنون من نُطف الإرادة في قلوب المريدين، أأنتم تخلقونه في قلوبهم حتى تنبت فيها بذرة الإرادة، وتهيج شجرة المحبة، فتُثمر بالمعرفة، أم نحن الخالقون؟ نحن قدّرنا بينكم الموت، فمنكم مَن يموت الموت الحسي أو المعنوي قبل الوصول، ومنكم مَن يموت بعد الوصول، والموت المعنوي: هو الرجوع عن السير، ولا يكون إلاَّ قبل الوصول، وما نحن بمسبوقين على أن نُبدل أمثالكم، ونُغيّر صفاتكم، فإنّ القلوب بيد الله، وننشئكم فيما لا تعلمون من الجهل والبُعد\n ولقد علمتم النشأة الأولى، التي كنتم عليها حال الغفلة والبطالة قبل ملاقاة الرجال، أفلا تذكرون فتشكرون على نعمة اليقظة والمعرفة\n أفرأيتم ما تحرثون من الأعمال والأحوال والمجاهدات والرياضات، أأنتم تزرعونه، أي: تُنبتونه حتى يُقبل منكم، وتجنون ثماره، أم نحن الزارعون؟ لو نشاء لأبطلناه ورددناه فنجعله هباءً منثوراً، فظلتم تندمون على ما فات منكم من المشاق، حيث لم تجنوا ثمرتها، تقولون: إنّا لمغرمون، حيث افتقرنا ودفعنا أموالنا في حال الجذبة الأولى، بل نحن محرمون من ثمار مجاهدتنا وطاعتنا، أفرأيتم الماء الذي تشربون، وهو ماء الحياة الذي تحيا به القلوب، تشربونه بوسائط المشايخ، يزقّه الشيخُ لروح المريد، كما يزق الطيرُ أفراخه، وبذلك تحيا روحه، فتغيب عن عوالم حسها، أأنتم أنزلتموه من سحاب الهداية والعناية، أم نحن المنزِلون؟ لو نشاء جعلناه أُجاجاً فَتَمجه الروحُ بعد شربها، أو تمتنع من شربه، فالأول للداخلين إذا لم تسعفهم رياح المقادير، فتنكسر سفينة سيرهم بعد الركوب، والثاني للطالبين المحرومين من أرزاق المعرفة\n فلولا تشكرون هذه النعم، حيث وفقكم لشرب الخمر، ودمتم حتى سكرتم وصحوتم، وحييت بها أرواحكم وأشباحكم\n أفرأيتم النار نار الشهوة التي تُورون تقدحونها في نفوسكم، أأنتم أنشأتم شجرتها، وهي النفس الطبيعية، أم نحن المنشئون؟ نحن جعلناها تذكرة، أي: إيقاظاً توقظ صاحبها ليتلجئ إلى مولاه، وفي الحِكَم: \" وحرَّك عليك النفس ليُديم إقبالك عليه \": وجعلناها متاعاً للسائرين إذ بجهادها يتحقق سيرهم، وبتصفيتها يتحقق كمالهم، وبفنائها يتحقق وصولهم، وكان شيخ شيخنا حين يشتكي له أحد له بنفسه، يقول: أما أنا فجزاها علي خيراً، ما ربحت إلاّ منها\n\n\nوقال القشيري: { أفرأيتم النار\n\n\n } الخ، يشير إلى نار المحبة المشتعلة الموقدة، بمقدح الطلب في حراقة قلب المحب الصادق في سلوكه وشجرتها هي العناية الإلهية، يدل على هذا قول العارف أبي الحسن المنصور - قدّس الله سره - حين سُئل عن حقيقة المحبة، فقال: هي العناية الإلهية السرميدة، لولاها ما كنت تدري ما الكتاب ولا الإيمان، فنحن جلعناها تذكرة لأرباب النفوس البشرية، ليهدتوا بها إلى سلوك طريق الحق، ومتاعاً للمُوقين، أي غذاء أرواح المحبين، الطاوين أياماً وليالي من الطعام والشراب، كا رُوي عن سهل التستري: أنه كان يطوي ثلاثين يوماً، وعن أبي عقيل المغربي: أنه ما أكل ستين سنة وهو مجاور بمكة، وعن كثيرين من السالكين المرتاضين\n هـ\n وقوله تعالى: { فسبِّح باسم ربك العظيم } قال الورتجبي: أَمَرَه أن ينزهه لا بنفسه بل بربه، ثم قال: والاسم والمسمى واحد، أي: قدسني بي فإني أعظم من أن تُقدسني بنفسك، أو بشيء دوني، ألا ترى إشارة قوله: { العظيم } أي: عظم جلاله أن يبلغ إلى أن تمدحه الخليقة، وأن تصِفة البرية\n هـ\n ثم أقسم على حقيّة القرآن المنزَّل بهذه الأخبار الغيبية، من العبث وغيره، فقال: { فَلاَ أُقْسِمُ بِمَوَاقِعِ ٱلنُّجُومِ }\n\n",
      "translations": []
    }
  ]
}