{
  "chapter": "الواقعة",
  "text": "نحن قدرنا بينكم الموت وما نحن بمسبوقين",
  "translations": [
    {
      "translation": "We have decreed death for you and We will not be forestalled",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have incorporated death in your constitution, and We shall not be hindered\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is We Who ordained death upon you and We are not to be frustrated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have destined death for you and no one can challenge Us\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is We Who have ordained death among you, and We have not been beaten –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have decreed death to you all, and We are not outstripped,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have ordained death among you and We are not to be overcome,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have decreed among you Death; We shall not be outstripped;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We mete out death among you, and We are not to be outrun,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is We who have ordained death for all of you; and We cannot be prevented\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We! it is We Who have decreed death Unto you all. And We are not to be outrun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have ordained death among you, and We are not to be outmaneuvered\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have decreed Death to be your common lot, and We are not to be frustrated\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have decreed death to you all, and We are not unable,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was We who decreed death among you. We will not be surpassed\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have decreed death among you, and We will not be outstripped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have decreed death among you, and We are not to be outdone\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[56:60] We have ordained (read qaddarnā or qadarnā) death among you, and We are not to be outmanoeuvred from, We are not incapable [of],\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We mete out death among you) We made you equal as far as death is concerned, such that all of you will die; it is also said that this means: We apportioned between you your lifespan until you die. Some of you will live to 100 years, others to 80, some to 50, some to more and others to less, (and We are not to be outrun) and We are capable of doing so,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nمع أنا { نَحْنُ } بمقتضى علمنا وقدرتنا { قَدَّرْنَا بَيْنَكُمُ ٱلْمَوْتَ } والأجل بأن عينَّا لموت كل أحد منكم وقتاً معيناً، وأجلاً معهوداً، بحيث لا يسع لكم وقت حلوله لا التقديم منه، ولا التأخير { وَ } مع ذلك { مَا نَحْنُ بِمَسْبُوقِينَ } [الواقعة: 60] مغلوبين من أحد منكم أصلاً، بأن يغلب علينا أحد بتقديم الأجل المعين المقدر من عندنا، أو تأخيره\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { نحن قدَّرنا بينكم الموتَ } أي: قسمناه ووقّتنا موت كل أحد بوقت معين، حسبما تقتضيه قسمتنا، المبنية على الحِكَم البالغة\n قال القشيري: فيكون في الوقت الذي نريده، منكم مَنْ يموت طفلاً، ومنكم مَن يموت شابّاً، وكهلاً وشيخاً، وبعللٍ مختلفة، وبأسباب متفاوتة، وأوقاتٍ مختلفة\n هـ\n { وما نحن بمسبوقين } بعاجزين { على أن نُبَدَّلَ أمثالَكم } بل نحن قادرون على ذلك، لا تسبقونني ولا تغلبونني على أن نُذهبكم، ونأتي مكانكم بأشباهكم من الخلق، والتبديل يكون بالذات أو بالصفات، { ونُنشِئَكم فيما لا تعلمون } ونخلقكم بعد التبديل في صورة لا تعهدونها\n قال الحسن: نجعلكم قردةً وخنازير، يعني: إنَّا نقدر على الأمرين جميعاً، أي: خلق ما يماثلكم وما لا يماثلكم فكيف نعجز عن إعادتكم",
      "translations": []
    }
  ]
}