{
  "chapter": "الواقعة",
  "text": "على ان نبدل امثلكم وننشئكم فى ما لا تعلمون",
  "translations": [
    {
      "translation": "in replacing you with others the same as you and re-forming you in a way you know nothing about.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From replacing you with others or raising you in a way you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We so wished, nothing could have hindered Us from replacing you by others like yourselves, or transforming you into beings you know nothing about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in replacing you with another creation like you, changing you into a form which you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the matter of exchanging you for others, and to transform you into what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To transfigure you and create you in (forms) that you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that We may bring in your place the likes of you and make you grow into what you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that We may exchange the likes of you, and make you to grow again in a fashion you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We may transfigure you and make you what ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "from replacing you by others like yourselves or changing your forms and re-creating you in forms that you know nothing of.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We may substitute others like Unto you and produce you into that which ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "from replacing you with your likes and recreating you in [a realm] you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "from changing your Forms and creating you (again) in (forms) that ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To transfigure you and create you in (forms) that you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that We will change you and cause you to grow again in a way you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In replacing you with your likes, and transforming you into what you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In that We will change your likenesses and produce you in that [form] which you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[56:61] replacing [you with], [We are not incapable of] appointing, your likes, in your place, and making you, creating you, in what you do not know, in the way of forms, such as apes or swine.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That We may transfigure you) that We may destroy you and bring instead other people who are better and more obedient than you (and make you) and create you on the Day of Judgement in (what ye know not) in a form that you know not: with dark faces and bluish eyes; it is also said that this means: in the form of apes and swine; and it is also said that this means: We shall place your spirits in the Fire which you do not believe in.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَنُنشِئَكُمْ } أي نُبدّلُكُم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذا قدرنا على تقدير الأجل للموت على الوجه المذكور قدرنا أيضاً { عَلَىٰ أَن نُّبَدِّلَ } ونحيى { أَمْثَـٰلَكُمْ } أي: أسلافكم الذين ماتوا وانقرضوا أحياء أمثالكم من العدم؛ يعني: كما قدرنا على إنشاءكم من العدم إنشاء إبداعياً قدرنا أيضاً على إحياء أسلافكم من القبور بعدما ماتوا على سبيل إعادة، بل إعادة أهون من الإبداع { وَ } بالجملة: قدرنا على أن { نُنشِئَكُمْ } بعد موتكم فِي { فِي مَا لاَ تَعْلَمُونَ } [الواقعة: 61] أي: في نشأة وعالم، لا يحيطون به علماً ولا تفهمونه لخروجه عن طور عقولكم ومقتضاه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و { أمثال } إمّا جمع \" مِثْل \" بالسكون - وهو التبديل بالذات، أو: \" مَثَل \" بالفتح، وهو التبديل في الصفات، أي: على أن نُبدّل ونُغيّر صفاتكم التي أنتم عليها، وننشِئَكم في صفات لا تعلمونها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "53:47",
      "similarity": 0.6813324733879327
    },
    {
      "verse": "56:35",
      "similarity": 0.6780091618792156
    },
    {
      "verse": "56:62",
      "similarity": 0.560516046791894
    },
    {
      "verse": "55:24",
      "similarity": 0.514026568531231
    },
    {
      "verse": "23:31",
      "similarity": 0.5024904692835117
    }
  ]
}