{
  "chapter": "الواقعة",
  "text": "وانه لقسم لو تعلمون عظيم",
  "translations": [
    {
      "translation": "and that is a mighty oath if you only knew -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this surely is great evidence if you can understand --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and this is indeed a mighty oath, if only you knew –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "- which is indeed a great oath if only you knew it -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that is indeed a tremendous oath, if you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily that is indeed a great oath, if you but know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most surely it is a very great oath if you only knew;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(and that is indeed a mighty oath, did you but know it)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! that verily is a tremendous oath, if ye but knew -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and, indeed, that is a most mighty oath, if you only knew --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily that is a mighty oath, if ye but knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed it is a great oath, should you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that is indeed a mighty adjuration if ye but knew,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, that is indeed a great oath, if you but know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that is a mighty oath, if you but knew\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is an oath, if you only knew, that is tremendous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, it is an oath - if you could know - [most] great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[56:76] And indeed it, the swearing by these [setting-places of stars], is a tremendous oath, if you only knew — if you were people of [deep] knowledge, you would realise the magnitude of this oath.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And lo! That) i.e. the Qur'an (verily is a tremendous oath, if ye but knew) if you but believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقرأ الأخَوان \" بموقع \" على الإفراد، وتخصيصها بالقَسَم لِمَا في غروبها من زوال أثرها، والدلالة على وجود مؤثر دائم لا يتغير، أو: لأنّ ذلك وقت قيام المجتهدين والمبتهلين إليه تعالى، وأوان نزول الرحمة والرضوان عليها، واستعظم ذلك بقوله: { وإنه لقَسَم لو تعلمون عظيمٌ } وهو اعتراض في اعتراض، لأنه اعتراض بين القسم والمقسَم عليه بقوله: { إِنه لقرآن كريمٌ } أي: حسن مرضيّ، أو نفّاع جمّ المنافع لاشتماله على أصول العلوم المهمة في صلاح المعاش والمعاد، أو: كريم على الله تعالى، واعترض بين الموصوف وصفته بـ { لو تعلمون } وجواب \" لو \" متروك، أريد به نفي علمهم، أو: محذوف، ثقةً، والتقدير: وإنه لقسم لو تعلمون ذلك، لكن لا تعلمون كُنه ذلك، أو: لو تعلمون ذلك لعظمتموه، أو: لعملتم بموجبه، { في كتابٍ مكنون } مَصون من غير المقربين من الملائكة، لا يطلع عليه مَن سواهم، وهو اللوح المحفوظ\n { لا يَمسُّه إِلاَّ المُطَهَّرون } أي: الملائكة المنزّهون عن الكدرات الجسمانية، وأوضار الذنوب\n هذا إن جعلته صفة لكتاب مكنون، وهو اللوح، وإن جعلته صفة للقرآن فالمعنى: لا ينبغي أن يمسّه إلاَّ مَن هو على الطهارة مِن الناس، والمراد: المكتوب منه\n قال ابن جزي: فإن قلنا إنَّ الكتاب المكنون هو الصحف التي بأيدي الملائكة، فالمطهَّرون يُراد به الملائكة لأنهم مُطهَّرون من الذنوب والعيوب، وإن قلنا أنَّ الكتاب المكنون هو الصحف التي بأيدي الناس فيحتمل أن يريد بالمطهرين: المسلمين لأنهم مُطَهرون من الكفر، أو يريد: المطهرين من الحدث الأكبر، وهو الجنابة والحيض، فالطهارة على هذا: الاغتسال\n أو: المطهرين من الحدث الأصغر، فالطهارة على هذا: الوضوء، ويحتمل أن يكون قوله: { لا يمسُّه } خبراً أو نهياً، على أنه قد أنكر بعضهم أن يكون نهياً، وقال: لو كان نهياً لكان بفتح السين\n والتحقيق: أن النهي يصح مع ضم السين لأن الفعل المضاعف إذا كان مجزوماً واتصل به ضمير المفرد المذكر ضُم عند التقاء الساكنين، اتباعاً لحركة الضمير، وإذا جعلته خبر فيحتمل أن يُراد به مجرد الإخبار، أو: يكون خبراً بمعنى النهي، وإذا كان لمجرد الإخبار، فالمعنى: لا ينبغي أن يمسه إلاَّ المطهرون، أي: هذا حقه، وإن وقع خلاف ذلك\n واختلف الفقهاء فيمن يجوز له مَسّ المصحف على حسب الاحتمالات في الآية، فأجمعوا على أنه لا يمسه كافر، واختلفوا فيما سواه على أقوال فقال بعضهم: لا يجوز أن يمسه الجُنب ولا الحائض ولا المحدِث الحدثَ الأصغر، وهذا قول مالك وأصحابه، ومَنعوا أيضاً أن يحمله بعلاقة أو وسادة، وحجتهم: الآية، على أن يُراد بالمطهرين الطهارة من الحدث الأصغر والأكبر، وقد احتج مالك في الموطأ بالآية، ومن حجتهم أيضاً: كتاب رسول الله صلى الله عليه وسلم إلى عَمرو بن حزم ألاَّ يمسَّ القرآن إلا طاهرٌ\n\n\nالقول الثاني: أنه يجوز مسه للجنب والحائض والمحدِث حدثاً أصغر، وهو مذهب أحمد بن حنبل والظاهرية، وحملوا \" المطهرين \" على أنهم المسلمون أو الملائكة\n والقول الثالث: أنه يجوز مسه بالحدث الأصغر دون الأكبر، وحمل صاحب هذا القول \" المطهرين \" على أن يُراد من الحدث: الأكبر، ورخَّص مالك في مسِّه على غير وضوء لمُعلِّم الصبيان لأجل المشقة\n واختلفوا في قراءة الجنب للقرآن، فمنعه الشافعي وأبو حنيفة مطلقاً، وأجازه الظاهرية مطلقاً، وأجاز مالك قراءة الآيات اليسيرة، أي: لتعوُّذ ونحوه\n واختلفوا في قراءة الحائض والنفساء للقرآن عن ظاهر قلب، فعن مالك روايتان، وفرّق بعضهم بين الكثير واليسير\n هـ\n قلت: المشهور في الحائض والنفساء جواز القراءة مطلقاً\n وقال الكواشي عن ابن عطاء: لا يفهم إشارات القراءة إلاَّ مَن طَهَّر سره من الأكوان\n هـ\n وفي آخر البخاري \" لا يمسه \": لا يجد طعمه ونَفْعَه إلاَّ مَن آمن بالقرآن، ولا يحمله بحقه إلاَّ المؤمنُ لقوله:\n\n[الجمعة: 5]\n هـ\n { تنزيلٌ من رب العالمين }: صفة رابعة للقرآن، أي: نزل من رب العالمين، وُصف بالمصدر لأنه نزل منجّماً من بين سائر الكتب، فكأنه في نفسه تنزيل، { أفبهذا الحديثِ } أي: القرآن { أنتم مُّدْهِنون } متهاونون به، كمَن يُدهن في بعض الأمر، أي: يلين جانبه، فلا يتصلّب فيه تهاوناً به\n قال ابن عطية: قال ابن عباس: المداهنة هي المهاودة فيما لا يحل، والمداراة: المهادوة فيما يحل\n هـ\n { وتجعلون رزقَكم أنكم تُكذِّبون } أي: وتجعلون شكر رزقكم التكذيب، أي: وضعتم التكذيب موضع الشكر\n وفي قراءة عليّ رضي الله عنه، وهي مروية عن رسول الله صلى الله عليه وسلم: \" وتجعلون شكركم أنكم تكذِّبون \" أي: وتجعلون شكركم لنعمة القرآن التكذيب\n وقيل: نزلت في الأنواء ونسبة الأمطار إليها، أي: وتجعلون شكر ما رزقكم الله من الغيث أنكم تكذّبون كونَه من الله، حيث تنسبونه إلى النجوم، وتقولون: مُطرنا بنوء كذا، والمنهي إنما هو اعتقاد التأثير للنجوم، لا من بابا العلامة وقيل: مطلقاً، سدّاً للذريعة، وهو مقتضى كلام ابن رشد، وعزاه لسحنون\n والمسألة خلافية، وقد قال صلى الله عليه وسلم:\n\n \" إذا ذُكرت النجوم فأمْسِكوا \" \n\n، ومنهم مَن فصّل في المسألة، فقال: يجوز إضافة الأفعال السيئة إليها لقوله صلى الله عليه وسلم:\n\n \" تعوّذوا بالله من شر هذا، فإنه الغاسق إذا وقب \" \n\n \n\nوأشار إلى القمر\n وأما الحسنة فالشكر يقتضي إضافتها إلى الله، وكذا الأدب\n والله تعالى أعلم\n الإشارة: مواقع النجوم هي أسرار العارفين لأنه يغرق في بحارها كل ما سوى الله، وتغيب فيها نجوم العلم العقلي والنقلي، وأقمار التوحيد البرهاني لأنه إذا أشرقت في قلوبهم شمس العرفان، لم يبقَ لنور النجوم والقمر أثر، وقد قلت في قصيدتي العينية:\n\nقال شيخ شيوخنا، سيدي عبد الرحمن الفاسي: كنتُ أعرف أربعة عشر علماً، فلما تعلمتُ علم الحقيقة شرطت ذلك كله\n هـ\n يعني: وقع الاستغناء عنها، فالكنز الذي ظفر به من العلم بالله، على نعت العيان، فلم يبقَ للروح التفات إلى شيء قط\n \" ماذا فقد من وجدك \"؟ وليس المراد أنها ذهبت معرفتها عنه، بل لو رجع إليها لوجدها تشحرت واتسعت أمدادها، ولكن ظفر بعلم يُعد الاشتغال بغيره بطالة، كما قال الغزالي لابن العربي المعافري: كنتَ الصاحِبَ في زمن البطالة، يعني: قبل ملاقاته بالشيخ\n وإنما كان القسم به عظيماً لأنه ليس عند الله أعظم من قلوب الواصلين وأسرار العارفين، لأنها وسعت الرب تعالى علماً وتجلياً،\n\n \" لم يسعني أرضي ولا سمائي، ووسعني قلب عبدي المؤمن \"\n \n\nفالقَسم عظيم، والمُقسَم به أعظم، والمُقسَم عليه أعظم، وهو القرآن الكريم، { لا يسمّه إلاّ المطهرون } قال الجنيد: لا يمسّه إلاّ العارفون بالله، المطهرون سرهم عما سوى الله\n هـ\n أي: لا يمس أبكار حقائقه ودقائق إشارته إلاّ القلوب المطهَرة من الأكدار والأغيار، وهي قلوب العارفين: { تنزيل من رب العالمين } على سيد المرسلين، ثم غرفت أسرارَه قلوبُ خلفائه العارفين\n أفبهذا الحديث أنتم مدهنون\n قال القشيري: أي: أنتم تتهاونون في قبول مثل هذا الكلام الحق، وتعجبون من مثل هذه الحقيقيات والتدقيقات\n هـ\n والعتاب لمَن يتهاون بعلم الإشارة ويُنكرها\n ويتنكّب مطالعتها\n وتجعلون شكر رزقكم إياها - حيث استخرجها بواسطة قلوب العارفين - التكذيب بها والإنكار على أربابها\n ثم أظهر عجزهم عند نزول قهرية الموت، فقال: { فَلَوْلاَ إِذَا بَلَغَتِ ٱلْحُلْقُومَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "51:4",
      "similarity": 0.7570051201335839
    },
    {
      "verse": "75:1",
      "similarity": 0.7536476513931681
    },
    {
      "verse": "15:90",
      "similarity": 0.7225931441890022
    },
    {
      "verse": "69:38",
      "similarity": 0.7200622236266401
    },
    {
      "verse": "90:1",
      "similarity": 0.4691919233004207
    }
  ]
}