{
  "chapter": "الواقعة",
  "text": "فلولا اذا بلغت الحلقوم",
  "translations": [
    {
      "translation": "Why then, when death reaches his throat",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then how is it that when the (dying) breath is withdrawn into the throat (and rattles),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, then, when the soul leaps up to the throat,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why can you not help a soul dying\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So why was it not, when the soul reaches up to the throat, –\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then why do you not (intervene) when it reaches Al-Hulqum\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why is it not then that when it (soul) comes up to the throat,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, but when the soul leaps to the throat of the dying\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, then, when (the soul) cometh up to the throat (of the dying)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, then, when the soul of the dying man reaches the throat,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore then - when the soul cometh up to the wind-pipe -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when it reaches the throat [of the dying person],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then why do ye not (intervene) when (the soul of the dying man) reaches the throat,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then why do you not (intervene) when (the soul of a dying person) reaches the throat?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, then, when the soul leaps up to the throat of the dying\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when it has reached the throat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then why, when the soul at death reaches the throat\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[56:83] Why then, when it, the spirit, during the throes [of death], reaches the [dying person’s] throat (hulqūm is the passage for food)\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Why, then, when (the soul) cometh up to the throat (of the dying)\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَوْلاَ } تتذكرون، وهلا تتعظون به، أما تخافون وقت { إِذَا بَلَغَتِ } النفس { ٱلْحُلْقُومَ } [الواقعة: 83] أي: لكل منكم بأمر الله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله لمَّا وبَّخهم على تكذيبهم بالقرآن الناطق بقوله:\n\n[الواقعة: 75]، ثم أوقفهم على أنهم تحت قهر ملكوته، من حيث طعامهم وشرابهم وسائر أسباب معاشهم، عجزهم بقهرية الموت، فقال: { فلولا } أي: هلاَّ { إِذا بلغتْ } الروح عند الموت { الحلقومَ } وهو ممرّ الطعام والشراب، وتداعت للخروج { وأنتم حينئذٍ } أيها الحاضرون حول صاحبها { تنظرون } إلى ما هو فيه من الغمرات، { ونحن أقربُ إِليه } علماً وقدرة وإحاطة { منكم } حيث لا تعرفون من حاله إلاَّ ما تُشاهدون من أثر الشدة، من غير أن تقفوا على كنهها وكيفيتها وأسبابها، ولا أن تقدروا على دفع أدنى شيء منها، ونحن المتولون لتفاصيل أحواله، { ولكن لا تُبصرون } لا تدركون ذلك لجهلكم بشؤوننا، { فلولا إِن كنتم غير مَدِينينَ } غير مربوبين مقهورين، من: دان السطلان رعيته: إذا ساسهم واستعبدهم، والمحضَض عليه قوله: { ترجعونها } تردون الروح إلى الجسد بعد بلوغ الحلقوم { إِن كنتم صادقين } أنكم غير مربوبين مقهورين\n وترتيب الآية: فلولا إذا بلغت الروحُ الحلقومَ، وأنتم تنظرون إليه، يُعالج سكرات الموت، ترجعونها إلى الجسد إن كنتم غير مربوبين، فـ \" لولا \" الثانية مكررة للأولى للتأكيد، والمعنى: إنكم في عموم جحودكم إن أنزلت عليكم كتاباً قلتم: سحرٌ وافتراءٌ، وإن أرسلتُ إليكم رسولاً صادقاً قلتم: ساحرٌ كذابٌ، وإن رزقتكم مطراً يُحييكم قلتم: صدق نوء كذا، على مذهب التعطيل، فما لكم لا ترجعون الروح إلى البدن إذا بلغ الحلقوم، إن كنتم صادقين في تعطيلكم وكفركم بالمُحيي المييت، المبدئ المعيد، وأنكم غير مربوبين مقهورين؟!\n ثم ذكر أحوال الأرواح عبد الموت في البرزخ، فقال: { فأمّا إِن كان } المتوفى { من المقرَّبين } من السابقين، من الأزواج الثلاثة المذكورة أول السورة، عبّر عنهم هنا بأجلّ أوصافهم، وهو شدة القرب، بعد أن عبّر عنهم أولاً بالسبق، فالسابقون هم المقربون، وهم العارفون بالله معرفة العيان، أهل الفناء في الذات، لقوله صلى الله عليه وسلم:\n\n \" سبق المُفَرِّدون، قيل: ومَن المُفَرِّدون يا رسول الله؟ قال: المسْتَهترون بذكر الله \" \n\nالحديث\n فالسابقون هم المولعون بذكر الله، حتى امتزج مع لحمهم ودمهم، فحصل لهم القرب من الحق\n { فَرَوْحٌ } أي: فلهم روح، أي: راحة للروح لأرواحهم من هموم الدنيا وغمومها، ومن ضيق عالم الأشباح إلى خالص عالم الأرواح، مع أن هذا حاصل لهم قبل الموت، لكن يتسع ميدانه بعد الموت، أو: رحمة تخصهم، أو: نسيم يهب عليهم\n وفي القاموس: الرَّوح - بالفتح: الراحة والرحمة ونعيم الريح\n هـ\n وقرئ بالضم، وهي مروية عنه صلى الله عليه وسلم، أي: الحياة والبقاء، أو: فله حياة طيبة دائمة لا موت فيها { وريحانٌ } أي: رزق، بلغة حِمْير، والمراد: رزق أرواحهم من العلوم والأسرار، أو: أشباحهم، فإنّ أرواحهم تتطور على شكر صاحبها، فتأكل من ثمار الجنة، وتشرب من أنهارها\n\n\nكما في حديث الشهداء، والصديقون أعظم منهم، أو: جنة، أو: هو الريحان الذي يُشمّ\n قال أبو العالية: \" لا يُفارق أحدٌ من المقربين الدنيا حتى يؤتى ببعض من ريحان الجنة فيشمه، فتفيض روحه \" ، { وجنةُ نعيم } تتنعّم فيها روحه في عالم البرزخ، ثم جسمه وروحه بعد البعث، وهذا يقتضي أنّ الأرواح تدخل الجنة قبل البعث، وهو خاص بالشهداء والصدِّيقين\n { وأمّا إِن كان مِن أصحاب اليمين فسلامٌ لك من أصحاب اليمين } أي: فسلام لك يا صاحب اليمين من إخوانك أصحاب اليمين، أي: يسلّمون عليك فإنّ الروح إذا سُئلت في القبر عُرج بها إلى أرواح أهلها، فيتلقونه ويُسلّمون عليه، ويهنُّونه بالخروج من سجن الدنيا، أو: سلامة لك يا محمد من أصحاب اليمين، فلا ترى فيهم إلاَّ السلامة\n { وأمّا إِن كان من المكذّبين الضالين } هم الصنف الثالث من الأزواج الثلالثة، وهم الذين قبل لهم: { ثم إنكم إيها الضالون المكذِّبون }\n\n\n الخ، { فَنُزُلٌ من حَميم } أي: فله نُزل من حميم يشربه، { وتَصْلِيهُ جحيمِ } إدخال في النار، ومقاساة ألوانِ عذابها\n وهذا يدل على أنّ الكافر بمجرد موته يدخل النار\n وقيل: معنى ذلك: ما يجده في القبر من سموم النار ودخانها\n ويحتمل: أن الآية لا تختص بعالم البرزخ، بل تعم البرزخ وما بعده\n وقد تكلم الناسُ عن الأرواح في عالم البرزخ، وحاصل ما ظهر لنا من الأحاديث والأخبار: أنّ أرواح الصدّيقين، وهم المقربون، تتشكل على صورة أجسامهم، وتذهب حيث شاءت في الجنان وغيرها\n وأرواح الشهداء تدخل في حواصل طيور خُضر، تسرح في الجنة حيث شاءت، لمّا كانت أرواحهم في الدنيا مسجونة في هيكل ذاتهم، سُجنت في حواصل الطيور، بخلاف العارفين لّمَا سرحت أفكارهم في الملكوت والجبروت أُطلقت أرواحهم بعد الموت، وأرواح الصالحين الأبرار وعامة المؤمنين، ممن لم ينفذ فيه الوعيد متفرقة في البرزخ، فمنهم في ظل شجرة المنتهَى، ومنهم في السموات، على قدر سعيهم في الدنيا\n وكل صنف يُجمع مع صنفه جماعةً، فالعلماء مع صنفهم، والقراء كذلك، والصالحون كذلك، والأولياء كذلك، والمنهمكون في الدنيا إذا سلموا من العذاب تكون أرواحهم كالنائم المستغرق، لا يشعر بمرور الأيام، حتى يستيقظ بنفخة البعث، وأما مَن نفذ فيهم الوعيد، فهم يُعذبون بأنواع من العذاب، وتذكَّر حديث البخاري في الرؤيا التي رآها صلى الله عليه وسلم في شأن الزناة وأكل الربا، وغيرهم\n وفي ابن حجر: أن أرواح المؤمنين في عليين، وأرواح الكافر في سجين، ولكل روح بجسدها اتصال معنوي، لا يُشبه الاتصال في الحيلة الدنيا، بل أشبه شيء به حال النائم، وإن كان هو أشد من حال النائم اتصالاً قال: وبهذا يُجمع بين ما ورد أن مقرها في عليين أو سجين، وبين ما نقل ابن عبد البر عن الجمهور: أنها عند أَفْنية قبورها\n\n\nقال: ومع ذلك فهي مأذون لها في التصرُّف، وتأوي إلى محلها من عليين أو سجين، وإذا نقل الميت من قبر إلى قبر، فالاتصال المذكور متصل، وكذا إذا تفرقت الأجزاء\n هـ\n وفي الأصل الرابع والخمسين من نوادر الأصول: إذا قَدِمَ المؤمنُ على ربه لقاه رَوحاً وريحاناً وبشرى على ألسنة الرسل، وهو قوله:\n\n[فصلت: 30]، ثم يأمر له في قبره بكسوة من فِراش ودِثار ورياحين، وهو قوله:\n\n{ الروم: 44]، ويُنور له في مضجعه، ويُؤنسه بملائكته الكرام، إلى أن يلقاه عرصة القيامة، فيبعثه إلى الموطن الذي هيأ له نزلاً\n هـ\n وقال في الأصل السبعين: إنّ الشهداء يُعجّل لهم تعالى اللقاء، ويحييهم قبل نفخة الصور، ويكلمهم كِفاحاً، كما لأهل الجنة، وليس لمَن دونهم من الأموات هذه الدرجة إلاّ للصدّيقين، فهم أجدر بذلك لبذلهم نفوسهم لله تعالى مدة أعمارهم، والشهداء بذلوها في طاعة الله ساعة، فظهر أن للشهيد حياة خاصة على مَن دونه، وأحرى منه الصدّيق\n هـ\n وبالجملة: فالأرواح منها في البرزخ تجول وتُبصر أحوال أهل الدنيا، ومنها تحت العرش، ومنها طيّارة في الجنان وإلى حيث شاءت، على أقدارهم من السعي إلى الله أيام الحياة، ومنها ما تسرح وتتردد إلى جثتها تزورها، ومنها ما يلقى أرواح المقبوضين\n وعن سَلمان: إنّ الأرواح المؤمنين - أي:الكُمل - تذهب في برازخ من الأرض حيث شاءت، بين السماء والأرض، حتى يردها الله إلى جسدها، فإذا ترددت هذه الأرواح علمت بأحوال الأحياء، وإذا ورد عليهم من الأحياء ميت، التفُّوا وتساءلوا عن الأخبار\n هـ\n قلت: وهذه أرواح العارفين دون غيرهم\n والله تعالى أعلم\n وفي بعض الأثر: إذا مات العارف قبل لروحه: جُل حيث شئتِ\n { إِنَّ هذا } أي: الذي ذكر في السورة الكريمة { لهو حقُّ اليقين } أي: الحق الثابت من اليقين، أو: حق الخبر اليقين، { فسبِّح باسم ربك العظيم } الفاء لترتيب التسبيح، أو الأمر به على ما قبلها، فإنّ حقيّة ما فصل في تضاعيف السورة الكريمة مما يوجب تنزيهه تعالى عما لا يليق بشأنه الجليل من الأمور التي من جملتها الإشراك والتكذيب بآياته الناطقة بالحق\n الإشارة: فأمّا إن كان من المقربين فرَوْح الوصال، وريحان الجمال، ومِنّة الكمال، أو: فرَوْح الفضاء، وريحان العطاء، وجنة البقاء، أو: فروح الفناء، وريحان البقاء، وجنة الترقي أبداً سرمداً، أو: فرَوْح الأنس لقلبه، وريحان القدس لروحه، وجنة الفردوس لنفسه، { وأمّا إِن كان مِن أصحاب اليمين فسلامٌ لك } أي: فسلام عليك يا محمد { من أًصحاب اليمين } فهم يسلمون عليك، ويشتاقون إلى لقائك، ويرتاحون للقدوم عليك وصحبتك\n والحاصل: أنَّ المقرَّب راحته ونعيمه في وصاله بربه، وصاحب اليمين اشتياقه لرسوله، وراحته ونعيمه في حصبته وجواره، فالمُقرَّب فانٍ في ذات الحق، وصاحب اليمين فانٍ في رسوله صلى الله عليه وسلم سيد الخلق، فأهل الفناء في الذات هم المقربون، وأهل الفناء في النبي صلى الله عليه وسلم هم أصحاب اليمين، فحاصل الآية: { فأمّا إِن كان مِن المقربين } فهو لي، وأُجازيه برَوْح وريحان وجنة نعيم، وأما إن كان من أصحاب اليمين فمُسلم لك، وهو من أصحاب اليمين، هذا حاصل ما حرره شيخ شيوخنا الفاسي في حاشيته\n\n\nوفي الإحياء ما حاصله: أنَّ المقرَّب له الوصال إلى سعادة الملك، وصاحب اليمين له النجاة، وهو سالك، والمقرَّب واصل، والمعرِض عن الله له الجحيم\n والخبر عن ذلك كله حق يقين عند العارف بالله لأنه أدرك ذلك كله مشاهدةً\n وفي القوت بعد كلام: وأيضاً للمقربين من كل هولٍ رَوح به لشهادتهم القريب، وفي كل كربٍ ريحان لقرب الحبيب، كما لأهل اليمين من كل ذلك سلامة\n هـ\n قال النسفي: رُوي أنَّ عثمان بن عفان رضي الله عنه دخل على ابن مسعود رضي الله عنه في مرض موته، فقال: ما تشتكي؟ فقال: ذنوبي، فقال: ما تشتهي؟ فقال: رحمة ربي - وفي رواية: ما يقضي ربي - فقال: أفلا تدعوا الطبيب؟ فقال: الطبيب أمرضني، فقال: ألا نأمر لك بعطاء؟ فقال: لا حاجة لي فيه، قال: ندفعه إلى بناتك، قال: لا حاجة لهن فيه، قد أمرتهنّ بأن يقرأن سورة الواقعة، فإني سمعت رسول الله صلى الله عليه وسلم يقول:\n\n \" مَن قرأ سورة الواقعة كل ليلة لم تُصبه فاقة أبداً \" \n\nوليس في هذه السور الثلاث ذكر لفظ \" الله \" اقتربت، والرحمن، والواقعة\n هـ\n وبالله التوفيق، ولا حول ولا قوة إلا بالله العلي العظيم، وصلّى الله على سيدنا محمد وصحبه وسلّم\n\n",
      "translations": []
    }
  ]
}