{
  "chapter": "الواقعة",
  "text": "تنزيل من رب العلمين",
  "translations": [
    {
      "translation": "Revelation sent down from the Lord of all the worlds.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It has been revealed by the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "a revelation from the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This Quran) is a revelation from the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sent down by the Lord Of The Creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A revelation from the Lord of all that exists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A revelation by the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "a sending down from the Lord of all Being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A revelation from the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is a revelation sent down from the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is a revelation from the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "sent down gradually from the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Revelation from the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Revelation (this Quran) from the Lord of the 'Alamin (mankind, jinns and all that exists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "a sending down from the Lord of all the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A revelation from the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[It is] a revelation from the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[56:80] a revelation, revealed, by the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتَنْزِيلٌ مِنْ رَبِّ الْعَالَمِينَ (80(وجملة { تنزيل من رب العالمين } مبينة لجملة { في كتاب مكنون لا يمسه إلا المطهرون } فهي تابعة لصفة القرآن ، أي فبلوغه إليكم كان بتنزيل من الله ، أي نزل به الملائكة .وفي معنى نظم هذه الآية قوله تعالى : { وما هو بقول شاعر قليلاً ما تؤمنون ولا بقول كاهن قليلاً ما تذكرون تنزيل من رب العالمين } \\[ الحاقة : 41 43 \\] .وإذ قد ثبتت هذه المرتبة الشريفة للقرآن كان حقيقاً بأن تعظم تلاوته وكتابته ، ولذلك كان من المأمور به أن لا يمَس مكتوبَ القرآن إلا المتطهِّرُ تشبهاً بحال الملائكة في تناول القرآن بحيث يكون ممسك القرآن على حالة تطهر ديني وهو المعنى الذي تومىء إليه مشروعية الطهارة لمن يريد الصلاة نظير ما في الحديث \" المصلي يناجي ربه \" . وقد دلت آثار على هذا أوضحها ما رواه مالك في «الموطأ» مرسلاً «أن في الكتاب الذي كتبه رسول الله صلى الله عليه وسلم إلى أقيال ذي رعين وقعافر وهمذان وبعثها به مع عمرو بن حزم \" أن لا يمس القرآن إلا طاهر \" . وروى الطبراني عن عبد الله بن عُمر قال رسول الله صلى الله عليه وسلم لا يمس القرآن إلا طاهر» ، قال المناوي : وسنده صحيح وجعله السيوطي في مرتبة الحسن .وفي كتب السيرة أن عمر بن الخطاب قبل أن يُسلم دخل على اخته وهي امرأة سعيد بن زيد فوجدها تقرأ القرآن من صحيفة مكتوب فيها سورة طه فدعا بالصحيفة ليقرأها فقالت له : لا يمسه إلا المطهّرون فقام فاغتسل وقرأ السورة فأسلم ، فهذه الآية ليست دليلاً لحكم مسّ القرآن بأيدي الناس ولكن ذكر الله إياها لا يخلو من إرادة أن يقاس الناسُ على الملائكة في أنهم لا يمسّون القرآن إلا إذا كانوا طاهرين كالملائكة ، أي بقدر الإِمكان من طهارة الآدميين .فثبت بهذا أن الأمر بالتطهر لمن يمسك مكتوباً من القرآن قد تقرر بين المسلمين من صدر الإِسلام في مكة .وإنما اختلف الفقهاء في مقتضى هذا الأمر من وجوب أو ندب ، فالجمهور رأوا وجوب أن يكون ممسك مكتوب القرآن على وضوء وهو قول علي وابن مسعود وسعد وسعيد وعطاء والزهري ومالك والشافعي ، وهو رواية عن أبي حنيفة ، وقال فريق : إن هذا أمر ندب وهو قول ابن عباس والشعبي ، وروي عن أبي حنيفة وهو قول أحمد وداود الظاهري .قال مالك في «الموطأ» \" ولا يحمل أحد المصحف لا بعلاقته ولا على وسادة إلا وهو طاهر إكراماً للقرآن وتعظيماً له \" . وفي سماع ابن القاسم من كتاب الوضوء من «العتبية» في المسألة السادسة «سئل مالك عن اللوح فيه القرآن أيمس على غير وضوء؟ فقال : أما للصبيان الذين يتعلمون فلا رأى به بأساً ، فقيل له : فالرجل يتعلم فيه؟ قال : أرجو أن يكون خفيفاً ، فقيل لابن القاسم : فالمُعلِّمُ يشكِّل ألواح الصبيان وهو على غير وضوء ، قال : أرى ذلك خفيفاً» .قال ابن رشد في «البيان والتحصيل» : «لما يلحقه في ذلك من المشقة فيكون ذلك سبباً إلى المنع من تعلمه . وهذه هي العلة في تخفيف ذلك للصبيان . وأشار الباجي في «المنتقى» إلى أن إباحة مسّ القرآن للمتعلم والمعلم هي لأجل ضرورة التعلم .وقد اعتبروا هذا حكماً لما كتب فيه القرآن بقصد كونه مصحفاً أو جزءاً من مصحف أو لَوحاً للقرآن ولم يعتبروه لما يكتب من آي القرآن على وجه الاقتباس أو التضمين أو الاحتجاج ومن ذلك ما يكتب على الدنانير والدراهم وفي الخواتيم .والمراد بالطهارة عند القائلين بوجوبها الطهارة الصغرى ، أي الوضوء ، وقال ابن عباس والشعبي : يجوز مسّ القرآن بالطهارة الكبرى وإن لم تكن الصغرى .ومما يلتحق بهذه المسألة مسألة قراءة غير المتطهّر القرآن وليست مما شملته الآية ظاهراً ولكن لمّا كان النهي عن أن يمسّ المصحف غير متطهّر لعله أن المس ملابسة لمكتوب القرآن فقد يكون النهي عن تلاوة ألفاظ القرآن حاصلاً بمفهوم الموافقة المساوي أو الأحرى ، إذ النطق ملابسة كملابسة إمساك المكتوب منه أو أشد وأحسب أن ذلك مثار اختلافهم في تلاوة القرآن لغير المتطهّر . وإجماع العلماء على أن غير المتوضىء يقرأ القرآن مع اختلافهم في مسّ المصحف لغير المتوضىء يشعر بأن مس المصحف في نظرهم أشدُّ ملابسة من النطق بآيات القرآن .قال مالك وأبو حنيفة والشافعي : لا يجوز للجنب قراءة القرآن ويجوز لغير المتوضىء . وقلت : شاع بين المسلمين من عهد الصحابة العمل بأن لا يتلو القرآن من كان جنباً ولم يُوثر عنهم إفتاء بذلك . وقال أحمد وداود : تجوز قراءة القرآن للجنب . ورخص مالك في قراءة اليسير منه كالآية والآيتين ، ولم يشترط أحد من أهل العلم الوضوء على قارىء القرآن .واختلف في قراءته للحائض والنفساء . وعن مالك في ذلك روايتان ، وأحسب أن رواية الجواز مراعى فيها أن انتقاض طهارتهما تطول مدته فكان ذلك سبباً في الترخيص .\n\n",
      "translations": [
        {
          "translation": "(A revelation) a speech (from the Lord of the Worlds) unto Muhammad (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "69:43",
      "similarity": 1.0
    },
    {
      "verse": "26:192",
      "similarity": 0.8997061902790419
    },
    {
      "verse": "41:2",
      "similarity": 0.6129525898846206
    },
    {
      "verse": "40:2",
      "similarity": 0.46073929113563133
    },
    {
      "verse": "7:121",
      "similarity": 0.4444741842469889
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/056080.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/056080.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/56:80.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}