{
  "chapter": "الحديد",
  "text": "من ذا الذى يقرض الله قرضا حسنا فيضعفه له وله اجر كريم",
  "translations": [
    {
      "translation": "Who will give a goodly loan to God which He will double for him, and be for him a splendid reward?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it that will give Allah a beautiful loan? A loan that Allah will repay after increasing it many times and grant him a generous reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever gives a virtuous loan to God will receive double from Him in addition to an honorable reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who will lend a handsome loan to Allah so that He may double it for him? And for such is an honourable reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he that will lend Allah a handsome loan: then He will increase it manifold to his credit, and he will have a honorable reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is there that will offer to Allah a good gift so He will double it for him, and he shall have an excellent reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he that will lend to God a good loan, and He will multiply it for him, and his shall be a generous wage?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he that will lend unto Allah a goodly loan, that He may double it for him and his may be a rich reward?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who will offer God a generous loan? He will double it for him and give him a rich reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he that will lend Allah a goodly loan, so that He may multiply it for him, and his shall be a hire honourable?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it that will lend Allah a good loan, that He may multiply it for him and [that] there may be a noble reward for him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he that will Loan to Allah a beautiful loan? for (Allah) will increase it manifold to his credit, and he will have (besides) a liberal Reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he that will lend to Allah a goodly loan, then (Allah) will increase it manifold to his credit (in repaying), and he will have (besides) a good reward (i.e. Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who will lend a generous loan to Allah? He will multiply it for him and he shall receive a generous wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he who will lend God a loan of goodness, that He may double it for him, and will have a generous reward?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it that would loan Allah a goodly loan so He will multiply it for him and he will have a noble reward?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:11] Who is it that will lend God, by expending his wealth in the way of God, a goodly loan, [goodly] by virtue of his expending it for God’s sake, so that He may multiply it (fa-yudā‘ifahu, may also be read fa-yuda‘‘ifahu) for him, from tenfold up to more than seven hundredfold —as stated in sūrat al-Baqara [Q. 2:261], and [so that] there may be for him, in addition to the multiplied [reward], a generous reward, coupled with satisfaction and prosperity.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who is he that will lend unto Allah) by giving alms (a goodly loan) sincerely from his heart, intending no one but Allah, (that He may double it for him) that Allah may accept it from Him and increase his reward from seven to 70 up to 700 and one million folds, and up to whatever folds Allah wills, (and his may be a rich reward) an abundant reward in the Garden? This verse was revealed about Abu'l-Dahdah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على سبيل الحث والترغيب: { مَّن ذَا ٱلَّذِي يُقْرِضُ ٱللَّهَ } وينفق في سبيله من أكرم أمواله { قَرْضاً حَسَناً } بلا شوب المنّ والأذى، وشين السمعة والرياء طلباً لمرضاته سبحانه { فَيُضَاعِفَهُ لَهُ } أي: يضاعف له إخلافه وإعواضه في الدنيا كرامةً عليه، وفضلاً { وَ } مع ذلك { لَهُ } في الآخرة { أَجْرٌ كَرِيمٌ } [الحديد: 11] وفوز عظيم لا فوز أعظم منه وأكرم، وهو التحقيق بمقام الرضا والتسليم، والاستغراق بمطالعة وجه الله الكريم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وحسن الإنفاق بالإخلاص فيه، وتحري أكرم المال، وأفضل الجهات، { فيُضاعِفه له } أي: يعطيه أجره على إنفاقه مضاعفاً أضعافاً كثيرة من فضله، { وله أجرٌ كريمٌ } وذلك الأجر المضموم إليه الأَضعاف كريمٌ في نفسه، حقيقٌ بأن يُتنافس فيه وإن لم يُضاعف، فكيف وقد ضُوعف أضعافاً كثيرة! ومن نصب فعلى جواب الاستفهام\n الإشارة: أَمَرَ الحقُّ تعالى مشايخَ التربية، والعلماءَ الأتقيا، أن يؤمنوا إيمان شهود وعيان، أو إيمان تحقيق وبرهان، فالأول للأولياء، والثاني للعلماء، ثم قال: { وأنفقوا مما جعلكم مستخلفين فيه } من العلوم الوهبية، أو الرسمية، فالذين آمنوا منكم كما تقدّم، مما عندهم سعة العلوم الوهبية، أو مِن ضيق العلوم الرسمية، لهم أجر كبير: سكنى الحضرة، في مقعد صدق، أو بُحْبُوحة الجنة في نعيم الأشباح\n وما لكم لا تؤمنون بالله، أي: تُجددوا إيمانكم كل ساعة، بفكرة الاستبصار والاعتبار، والرسولُ يدعوكم لتُجددوا إيمانكم، وقد أخذ ميثاقكم في عالم الذر، ثم جدّده ببعث الرسل وخلفائهم من شيوخ التربية، الداعين إلى الله، إن كنتم مؤمنين بهذا الميثاق\n هو الذي يُنزِّل على عبده آيات بينات، وهو القرآن، يَنزل على رسوله صلى الله عليه وسلم ليُخرجكم من الظلمات إلى النور، من ظلمة المعاصي إلى نور التوبة والاستقامة، ومن ظلمة الغفلة إلى نور اليقظة، ومن ظلمة الهوى والحظوظ إلى نور الزهد والعِفة، ومن ظلمة الحس إلى نور المعنى، ومن ظلمة الجهل إلى نور العلم بالله\n وما لكم ألاَّ تنفقوا مُهجكم وأرواحكم في سبيل الله، ببذلها في مرضاة الله، ولله ميراث السموات والأرض، فيرثكم بأشباحكم وأرواحكم، فمَن بذلها عوّضه دوام الشهود، ومَن بخل بها عقبه حسرة الحجاب، لا يستوي منكم مَن أنفق نفسه وقاتلها قبل ظهور الطريق، مع مَن أنفق وجاهد بعد ظهورها، فالسابقون لم يجدوا أعواناً، والمتأخرون وجدوا أعواناً، وكُلاًّ وعد الله الحسنى الجنة الحسية، وزاد السابقين الجنة المعنوية، جنةَ المعارف\n\n\nوالله بما تعملون خبير، لا يخفى عليه مَن تقدم ممن تأخر\n { من ذا الذي يُقرض الله قرضاً حسناً } ، قال القشيري: هو أن يُقرض وينقطع عن قلبه حُبّ الدارين، ففي الخبر: \" خير الصدقة ما كان عن ظهر غنىً \"\n هـ\n فيضاعفه له بالترفي إلى ما لا نهاية له، وله أجر كريم، وهو مقعد صدق عند مليك مقتدر\n ثم ذكر ثمرة الإيمان، الذي أمر به، فقال: { يَوْمَ تَرَى ٱلْمُؤْمِنِينَ وَٱلْمُؤْمِنَاتِ }\n\n",
      "translations": []
    }
  ]
}