{
  "chapter": "الحديد",
  "text": "يوم ترى المؤمنين والمؤمنت يسعى نورهم بين ايديهم وبايمنهم بشرىكم اليوم جنت تجرى من تحتها الانهر خلدين فيها ذلك هو الفوز العظيم",
  "translations": [
    {
      "translation": "On the Day you see the men and women of the muminun, with their light streaming out in front of them, and to their right: 'Good news for you today of Gardens with rivers flowing under them, remaining in them timelessly, for ever. That is the Great Victory.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day you see the believers, men and women, with their light advancing ahead and to the right of them, (they will be told:) \"There is good news for you this day, of gardens with rivers flowing by where you will live for ever.\" This will be the great attainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day you will see believing men and women that their light will be running before them and on their right hands. (They will be told): “A good tiding to you today.” There shall be Gardens beneath which rivers flow; therein they shall abide. That indeed is the great triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Judgment you will see the believers with their light shining in front of them and to their right. They will be told, \"Paradise wherein streams flow is the glad news for you today. You will live therein forever. This is the greatest triumph\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when you will see the believing men and believing women, that their light runs before them and on their right – it being said to them, “This day, the best tidings for you are the Gardens beneath which rivers flow – abide in it forever; this is the greatest success.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day you shall see the believing men and the believing women -- their light running forward before them and in their right hands. Glad tidings for you this Day! Gardens under which rivers flow (Paradise), to dwell therein forever! Truly, this is the great success!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day you will see the faithful men and the faithful women-- their light running before them and on their right hand-- good news for you today: gardens beneath which rivers flow, to abide therein, that is the grand achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day when thou seest the believers, men and women, their light running before them, and on their right hands. 'Good tidings for you today! Gardens underneath which rivers flow, therein to dwell for ever; that is indeed the mighty triumph.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when thou (Muhammad) wilt see the believers, men and women, their light shining forth before them and on their right hands, (and wilt hear it said unto them): Glad news for you this day: Gardens underneath which rivers flow, wherein ye are immortal. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the  Day, you [Prophet] shall see the faithful, both men and women, with their light streaming out before them and on their right hands, [and you shall hear a voice saying to them:] \"Glad tidings for you today! You shall enter gardens with rivers flowing through them wherein you shall forever dwell. That is the supreme triumph.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mention the Day whereon thou shalt see the believing men and believing women, their light running before them and on their right hands: glad tidings Unto you To-day: Gardens whereunder rivers flow, abiders therein they will be. That! it is the mighty achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day you will see the faithful, men and women, with their light moving swiftly in front of them and on their right, [and they are greeted with the words:] ‘There is good news for you today! Gardens with streams running in them, to remain in them [forever]. That is the great success.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One Day shalt thou see the believing men and the believing women- how their Light runs forward before them and by their right hands: (their greeting will be): \"Good News for you this Day! Gardens beneath which flow rivers! to dwell therein for aye! This is indeed the highest Achievement!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day you shall see the believing men and the believing women their light running forward before them and by their right hands. Glad tidings for you this Day! Gardens under which rivers flow (Paradise), to dwell therein forever! Truly, this is the great success!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day (will surely come) when you shall see believing men and women with their light running before them on their right hands, (it will be said to them):'Glad tidings for you this Day. You shall live for ever in Gardens underneath which rivers flow! That is indeed the mighty triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when you see the believing men and believing women—their light radiating ahead of them, and to their right: “Good news for you today: gardens beneath which rivers flow, dwelling therein forever. That is the great triumph.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day you see the believing men and believing women, their light proceeding before them and on their right, [it will be said], \"Your good tidings today are [of] gardens beneath which rivers flow, wherein you will abide eternally.\" That is what is the great attainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:12] Mention, the day when you will see the believing men and believing women with their light shining forth before them, in front of them, and, it will [also] be, on their right, and it will be said to them: ‘Good tidings for you on this day: Gardens, that is to say, enter them, underneath which rivers flow, wherein you will   abide. That is the great success’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the day) which is the Day of Judgement (when thou) Muhammad (will see the believers) the true believers, (men and women, their light shining forth before them and on their right hands) on the Bridge over hell, the angels will say to them on the Bridge over hell: (Glad news for you this day: Gardens beneath which) beneath its trees and habitations (rivers flow) rivers of wine, water, honey and milk flow, (wherein ye are immortal) they will abide in Paradise, never to die or leave. (That is the Supreme Triumph) they earned Paradise and that which is therein and are saved from hell and that which it contains.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر يا أكرم الرسل على سبيل التبشير { يَوْمَ تَرَى } أيها المعتبر الرائي { ٱلْمُؤْمِنِينَ } الموحدين الموقنين\n المخلصين { وَٱلْمُؤْمِنَاتِ } أيضاً كذلك { يَسْعَىٰ نُورُهُم } أي: نور يقينهم وعرفانهم { بَيْنَ أَيْدِيهِمْ } أي: أمامهم وقدامهم { وَبِأَيْمَانِهِم } إذ إتيان الكرامة إنما هو من هاتين الجهتين\n فيقول لهم حينئذٍ من يتلقاهم من الملائكة: { بُشْرَاكُمُ ٱلْيَوْمَ } دخول { جَنَّاتٌ } متنزهات العلم والعين والحق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } أي: أنههار المعارف والحقائق لا بحسب وقت دون وقت\n بل { خَالِدِينَ فِيهَا } دائمين { ذَلِكَ } أي: الخلود في الجنة الموعودة { هُوَ ٱلْفَوْزُ ٱلْعَظِيمُ } [الحديد: 12] لا فوز أعظم منه عند المكاشفين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: واذكر { يومَ ترى } أو: لهم أجر كبير { يومَ ترى المؤمنين والمؤمنات يسعى نُورُهم } وهو نور الإيمان في الدنيا، يكون هناك حسيّاً يسعى { بين أيديهم وبأَيمانهم } وقيل: هو القرآن، وعن ابن مسعود رضي الله عنه: يؤتون نورهم على قدر أعمالهم، فمنهم مَن يؤتى نوره كالنخلة، ومنهك كالرجل القائم، وأدناهم نوراً مَنْ نوره على إبهام رجله، يطفأ تارة ويلمع تارة\n قلت: ومنهم مَن نُوره كالقمر ليلة البدر، ومنهم مَن نوره كالشمس الضاحية، يُضيء خمسمائة عام، كما في أحاديث أخرى، وذلك على قدر إيمانهم وعرفانهم\n قال الحسن: يستضيئون به على الصراط، وهم متفاوتون في السرعة، قال أبو نصر الهمداني: أمة محمد صلى الله عليه وسلم على سبعة أنواع: الصدِّيقون، والعلماء، والبُدلاء، والشهداء، والحُجاج، والمطيعون، والعاصون، فالصدِّيقون يمرُّون كالبرق، والعلماء، أي: العاملون، كالريح العاصف، والبدلاء كالطير في ساعة، والشهداء كالجواد المسرع، يمرُّون في نصف يوم، والحجاج يمرُّون يومٍ كامل، والمطيعون في شهر، والعاصون يضعون أقدامهم على الصراط، وأوزارهم على ظهرهم، فيعثرون، فتقصد جهنم أن تحرقهم، فترى نور الإيمان في قلوبهم، فتقول: جز يا مؤمن، فإنَّ نورك قد أطفا لهبي\n هـ\n قلت: الصدِّيقون على قسمين، أما أهل الاقتداء، الدالُّون على الله، المسلِّكون، فتقرب الغُرف لهم، فيركبونها، ويمرُّون، وأما الأفراد فيطيرون كالبرق\n والله تعالى أعلم\n وقال مقاتل: يكون هذا النور لهم دليلاً إلى الجنة، وتخصيص الجهتين لأنّ السعداء يُؤتون صحائف أعمالهم من هاتين الجهتين { من بين أيديهم وعن إيمانهم } كما أنَّ الأشقياء يؤتون صحائفهم من شمائلهم ووراء ظهورهم، فجَعَل النور في الجهتين إشعاراً لهم بأنهم بحسناتهم وبصحائفهم البيض أفلحوا\n وتقول لهم الملائكة: { بُشراكم اليومَ جناتٌ } أي: دخول جنات لأنّ البشارة تقع بالإجداث دون الجُثث، { تجري من تحتها الأنهار خالدين فيها ذلك هو الفوز العظيم }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:89",
      "similarity": 0.675860726437613
    },
    {
      "verse": "48:5",
      "similarity": 0.6694675196772938
    },
    {
      "verse": "85:11",
      "similarity": 0.6024219647427086
    },
    {
      "verse": "4:13",
      "similarity": 0.5868749257544068
    },
    {
      "verse": "5:119",
      "similarity": 0.5739038372728492
    }
  ]
}