{
  "chapter": "الحديد",
  "text": "ان المصدقين والمصدقت واقرضوا۟ الله قرضا حسنا يضعف لهم ولهم اجر كريم",
  "translations": [
    {
      "translation": "The men and women who give sadaqa and make a good loan to Allah will have it increased for them and they will have a generous reward.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the men and women who spend in charity and give a goodly loan to God, will have it doubled for them and will receive a generous reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who give alms -- be they men or women, -- and give Allah a beautiful loan shall be repaid after increasing it many times; and theirs shall be a generous reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The charitable men and women who give a virtuous loan to God will receive double from Him in addition to their honorable reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the charity-giving men and women, and those who lend an excellent loan to Allah – for them is double, and for them is an honourable reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who give Sadaqat, men and women, and lend Allah handsome loan, it shall be increased manifold (to their credit), and theirs shall be an honorable good reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely (as for) the charitable men and the charitable women and (those who) set apart for Allah a goodly portion, it shall be doubled for them and they shall have a noble reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those, the men and the women, who make freewill offerings and have lent to God a good loan, it shall be multiplied for them, and theirs shall be a generous wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who give alms, both men and women, and lend unto Allah a goodly loan, it will be doubled for them, and theirs will be a rich reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alms-givers, both men and women, who give a generous loan to God, shall have it multiplied and shall have an honourable reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the alms-giving men and alms-giving women--and they are lending unto Allah a goodly lone--it shall be multiplied for them and theirs shall be a hire honourable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the charitable men and women and those who lend Allah a good loan—it shall be multiplied for them, and there will be a noble reward for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who give in Charity, men and women, and loan to Allah a Beautiful Loan, it shall be increased manifold (to their credit), and they shall have (besides) a liberal reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who give Sadaqat (i.e. Zakat and alms, etc.), men and women, and lend to Allah a goodly loan, it shall be increased manifold (to their credit), and theirs shall be an honourable good reward (i.e. Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who give in charity, be they men or women, and those who lend a good loan to Allah, shall be repaid in multiples. They shall receive agenerous wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The charitable men and charitable women, who have loaned God a loan of righteousness—it will be multiplied for them, and for them is a generous reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the men who practice charity and the women who practice charity and [they who] have loaned Allah a goodly loan - it will be multiplied for them, and they will have a noble reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:18] Indeed men who give voluntary alms (al-mussaddiqīna, derives from the [infinitive] al-tasadduq, ‘to give voluntary alms’; the tā’ [of the original mutasaddiqīna] has been assimilated with the sād) and women who give voluntary alms (a variant reading for both has the softened form [with a single sād, musaddiqīna and musaddiqāti], which derives from al-tasdīq, ‘to affirm the truth of’, ‘to believe in’) and [those of them] who have lent God a goodly loan (this refers back to both the men and women with [the masculine plural of] predominance; the supplementing of a verb [aqradū, ‘who lent’] to a noun [of action, al-mussaddiqāt] at [the point of] the relative clause of the al-, is because in that position it [the noun] functions as a verb; the mention of the ‘loan’ together with its qualification [‘goodly’] after [the mention of] ‘the giving of voluntary alms’ is intended to define it), it will be multiplied (yudā‘afu, is also read as yuda‘‘afu), namely, their loan [will multiplied], for them and they will have a generous reward.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who give alms, both men and women) because of their faith, (and lend unto Allah) through giving alms (a goodly loan) sincerely from their heart in seeking only Allah's pleasure, (it will be doubled for them) it will be accepted from them and increased from seven folds to 70 and up to 700 folds and two million folds, and even more as Allah wills, (and theirs will be a rich reward) a goodly reward in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن علامات تعقلكم واتعاظكم: الصدق بمزخرفات الدنيا، والتقرب بها نحو المولى { إِنَّ ٱلْمُصَّدِّقِينَ } أي: المتصدقين { وَٱلْمُصَّدِّقَاتِ } أي: المتصدقات { وَ } هم الذين { أَقْرَضُواْ ٱللَّهَ قَرْضاً حَسَناً } خالصاً عن شوب المن والأذى، طالباً لمرضاته سبحانه { يُضَاعَفُ لَهُمْ } صدقاتهم في النشأة الأولى { وَلَهُمْ أَجْرٌ كَرِيمٌ } [الحديد: 18] في النشأة الأخرى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { المصدقين } مَن قرأ بالتشديد فيهما فاسم فاعل، من: تصدّق، أدغمت التاء في الصاد، ومَن قرأ بتخفيف الصاد فاسم فاعل صدّق\n و { أقرضوا }: عطف على الصلة، أي: إن الذين تصدّقوا وأقرضوا\n يقول الحق جلّ جلاله: { إِنَّ المصدِّقين والمصدِّقات } أي: المتصدقين بأموالهم والمتصدقات أو: المصدقين بالله ورسوله والمصدقات، { وأقرضوا اللّهَ قرضاً حسناً } وهو أن تتصدّق من كسبٍ طيبٍ، بقلب طيب، { يُضاعف لهم } بأضعاف كثيرة إلى سبعمائة، { ولهم أجرٌ كريمٌ } الجنة وما فيها\n وقد ورد في الصدقات أحاديث، منها: أنها تدفع سبعين باباً من السوء، وتزيد البركة في العمر\n رُوي أن شابّاً وشابة دخلا على سليمان عليه السلام فعقد لهما النكاح، وخرجا من عنده مسرورين، وحضر ملك الموت، فقال: لا تعجب من سرورهما، فقد أُمرت أن أقبض روح هذا الشاب بعد خمسة أيام، فجعل سليمانُ يراعي حالَ الشاب، حتى ذهبت ستة أيام، ثم خمسة أشهر، فعجب من ذلك، فدخل عليه ملك الموت، فسأله عن ذلك، فقال: إني أُمرت أن أقبض روحه كما ذكرتُ لك، فلما خرج من عندك لقيه سائل، فدفع له درهماً، فدعا له بالبقاء، فأُمرت بتأخير الأمر عنه ببركة صدقته\n هـ\n وانظر عند قوله:\n\n[الرعد: 38]، ومثله قضية الرجل الذي آذى جيرانَه، فدعا موسى عليه السلام عليه، ثم تصدَّق صبيحة اليوم برغيف، فنزل الثعبان، فلقيته الصدقة فسقط ميتاً على حزمة حطبه",
      "translations": []
    }
  ]
}