{
  "chapter": "الحديد",
  "text": "اعلموا۟ ان الله يحى الارض بعد موتها قد بينا لكم الءايت لعلكم تعقلون",
  "translations": [
    {
      "translation": "Know that Allah brings the earth to life after it was dead. We have made the Signs clear to you so that hopefully you will use your intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that God enlivens the earth even after it has died. We have explained to you clearly Our signs that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know well that Allah revives the earth after it becomes lifeless. We have clearly shown Our Signs to you, perchance you will use your reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that God brings the dead earth back to life. We have explained Our revelations to you so that you may perhaps have understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that it is Allah Who revives the earth after its death; We have indeed illustrated the signs for you, for you to understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that Allah gives life to the earth after its death! Indeed We have made clear the Ayat to you, if you but understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that Allah gives life to the earth after its death; indeed, We have made the communications clear to you that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that God revives the earth after it was dead. We have indeed made clear for you the signs, that haply you will understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that Allah quickeneth the earth after its death. We have made clear Our revelations for you, that haply ye may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember that God brings the earth back to life after its death. We have made Our signs clear to you, so that you may fully understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that Allah quickeneth earth after the death thereof. Surely We have propounded unto you the signs, that haply ye may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that Allah revives the earth after its death. We have certainly made the signs clear for you, so that you may exercise your reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know ye (all) that Allah giveth life to the earth after its death! already have We shown the Signs plainly to you, that ye may learn wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that Allah gives life to the earth after its death! Indeed We have made clear the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) to you, if you but understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that Allah revives the earth after it was dead. We have made plain to you the signs in order that you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that God revives the earth after its death. We thus explain the revelations for you, so that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that Allah gives life to the earth after its lifelessness. We have made clear to you the signs; perhaps you will understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:17] Know — an address to the believers [just] mentioned — that God revives the earth after its death, by [bringing forth] vegetation, and likewise He is able to do with your hearts, restoring them to humbleness. We have certainly made clear for you the signs, that testify to Our power with this [mentioned example] and others, that perhaps you may understand.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Know that Allah quickeneth the earth) through rain (after its death) after being exposed to dryness and drought; and similarly Allah will bring the dead back to life through rain. (We have made clear Our revelations) bringing the dead back to life (for you, that haply ye may understand) that haply you may believe in resurrection after death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱعْلَمُوۤاْ } أيها المؤمنون الموحدون { أَنَّ ٱللَّهَ } المطلع على قابليات عباده واستعداداتهم الفطرية { يُحْيِـي ٱلأَرْضَ } أي: أراضي استعداداتكم بماء المعارف الحقائق، والمكاشفات والمشاهدات { بَعْدَ مَوْتِهَا } بالجهل والغفلة الناشئة من ظلمات الطبيعة والهيولى، وبالجملة: { قَدْ بَيَّنَّا } وأوضحنا { لَكُمُ ٱلآيَاتِ } الدالة على هدايتكم وتكميلكم في القرآن العظيم { لَعَلَّكُمْ تَعْقِلُونَ } [الحديد: 17] رجاء أن تتأملوا فيها، وتتعظوا بها، وتفهموا إشاراتها، وتعتبروا منها، وتتفطنوا بما فيها من السرائر المرموزة والحكم المكنونة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وهذه الآية { اعلموا أنَّ الله يُحيي الأرضَ بعد موتها } قيل: هذا تمثيل لأثر الذكر في القلوب، وأنه يُحييها كما يُحيي الغيثُ الأرض، وفيه إرشاد إلى أنَّ طريق زوال القسوة ليس إلاَّ الالتجاء إلى الله، ونفى الحول والقوة لأنه تعالى القادر وحده على ذلك، كما أنه وحده يُحيي الأرض، { قد بيّنا لكم الآيات } التي من جملتها هذه الآية، { لعلكم تعقلون } كي تعقلوا ما فيها، وتعملوا بموجبها، فتفوزوا بسعادة الدارين\n والله تعالى أعلم\n الإشارة: خشوع القلب لذكر الله هو ذهوله وغيبته عند سطوع أنوار المذكور، فيغيب الذاكر في المذكور، وهو الفناء، والخشوع لسماع ما نزل من الحق: أن يسمعه من الحق، لا من الخلق، وهو أقصى درجات المقربين\n ثم نهى تعالى الخواص أن يتشبّهوا بأهل العلوم الرسمية اللسانية لأنه طال بهم الأمل، وتنافسوا في الرئاسة، وتهالكوا في الحظوظ العاجلة، حتى قست قلوبهم، وخرجوا عن الإرادة بالكلية، قال القشيري: وقسوة القلب إنما تحصل من اتباع الشهوة فإن الشهوة والصفوة لا يجتمعان، وموجِبُ القسوة: انحرافُ القلب عن مراقبة الربِّ، ويقال: موجب القسوة أوله خطرة، فإنْ لم تتدارَكْ صارت فكرة، وإن لم تتدارَكْ صارت عزيمة، فإن لم تتدارَكْ صارت مخالفة، فإن لم تتلافَ صارت قسوةً، وبعد ذلك طبع ودين\n هـ\n وحينئذ لا ينفع الوعظ والتذكير، كما قال:\n\nاعلموا أن الله يُحيي أرض القلوب بالعلم والمعرفة، بعد موتها بالغفلة والجهل، قد بيَّنَّا الآيات لمَن يتدبّر ويعقل\n ثم رغَّب في الصدقة، فقال: { إِنَّ ٱلْمُصَّدِّقِينَ وَٱلْمُصَّدِّقَاتِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:242",
      "similarity": 0.6896625395459426
    },
    {
      "verse": "2:73",
      "similarity": 0.6205355075349335
    },
    {
      "verse": "23:80",
      "similarity": 0.5334881698879982
    },
    {
      "verse": "29:63",
      "similarity": 0.4860286676398521
    },
    {
      "verse": "29:35",
      "similarity": 0.4750084711749794
    }
  ]
}