{
  "chapter": "الحديد",
  "text": "يوم يقول المنفقون والمنفقت للذين ءامنوا۟ انظرونا نقتبس من نوركم قيل ارجعوا۟ وراءكم فالتمسوا۟ نورا فضرب بينهم بسور له بابۢ باطنه فيه الرحمة وظهره من قبله العذاب",
  "translations": [
    {
      "translation": "That Day the men and women of the hypocrites will say to those who have iman, 'Wait for us so that we can borrow some of your light.' They will be told, 'Go back and look for light!' And a wall will be erected between them with a gate in it, on the inside of which there will be mercy but before whose exterior lies the punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day the hypocrites, men and women, will say to the believers: \"Wait for us that we may borrow a little light from your light,\" they will be told: \"Go back, and look for your light.\" A wall shall be raised between them in which there will be a door. Within it will be benevolence and retribution without.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day the hypocrites, both men and women, shall say to the believers: “Look at us that we may extract some light from your light.” They will be told: “Go back and seek light for yourselves elsewhere.” Then a wall shall be erected between them with a door in it. On the inside of it there will be mercy, and on the outside of it there will be chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day the hypocrites will say to the believers, \"Please look at us so that we might benefit from your light.\" They will be told, \"Go back and search for your own light.\" A barrier with a door will be placed between them. Inside it there will be mercy but outside of it there will be torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when hypocrite men and hypocrite women will say to the Muslims, “Look mercifully towards us, so that we may gain some of your light!”; it will be said to them, “Turn back, search light over there!”; so they will turn around, whereupon a wall will be erected between them, in which is a gate; inside the gate is mercy, and on the outer side is the punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the hypocrites men and women will say to the believers: \"Wait for us! Let us get something from your light!\" It will be said: \"Go back to your rear! Then seek a light!\" So, a wall will be put up between them, with a gate therein. Inside it will be mercy, and outside it will be torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the hypocritical men and the hypocritical women will say to those who believe: Wait for us, that we may have light from your light; it shall be said: Turn back and seek a light. Then separation would be brought about between them, with a wall having a door in it; (as for) the inside of it, there shall be mercy in it, and (as for) the outside of it, before it there shall be punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day when the hypocrites, men and women, shall say to those who have believed, 'Wait for us, so that we may borrow your light!' It shall be said, 'Return you back behind, and seek for a light!' And a wall shall be set up between them, having a door in the inward whereof is mercy, and against the outward thereof is chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the hypocritical men and the hypocritical women will say unto those who believe: Look on us that we may borrow from your light! it will be said: Go back and seek for light! Then there will separate them a wall wherein is a gate, the inner side whereof containeth mercy, while the outer side thereof is toward the doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, the hypocrites, both men and women, will say to the faithful, \"Wait a while for us, so that we may have some of your light.\" They will be told, \"Turn back and look for a light elsewhere.\" A wall will then be raised between them. It will have a gate on the inside of which will be grace and mercy and on the outside of which will be punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall be the Day whereon the hypocritical men and hypocritical women will say Unto those who believe: wait for us that we may borrow some of your light. Then betwixt them there will be set a high wall, wherein will be a door, the inside whereof hath mercy, while the outside thereof is toward the torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day the hypocrites, men and women, will say to the faithful, ‘Please wait, that we may glean something from your light!’ They will be told: ‘Go back and grope for light!’ Then there will be set up between them a wall with a gate, with mercy within and punishment without.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One Day will the Hypocrites- men and women - say to the Believers: \"Wait for us! Let us borrow (a Light) from your Light!\" It will be said: \"Turn ye back to your rear! then seek a Light (where ye can)!\" So a wall will be put up betwixt them, with a gate therein. Within it will be Mercy throughout, and without it, all alongside, will be (Wrath and) Punishment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the hypocrites men and women will say to the believers: \"Wait for us! Let us get something from your light!\" It will be said: \"Go back to your rear! Then seek a light!\" So a wall will be put up between them, with a gate therein. Inside it will be mercy, and outside it will be torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day the hypocrites, both men and women, will say to the believers: 'Wait for us so that we can take from your light' But they will be answered: 'Go back and seek a light' And a wall with a door shall be between them. Inside it there is mercy, and outside will be the punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the hypocritical men and hypocritical women will say to those who believed, “Wait for us; let us absorb some of your light.” It will be said, “Go back behind you, and seek light.” A wall will be raised between them, in which is a door; within it is mercy, and outside it is agony.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the [same] Day the hypocrite men and hypocrite women will say to those who believed, \"Wait for us that we may acquire some of your light.\" It will be said, \"Go back behind you and seek light.\" And a wall will be placed between them with a door, its interior containing mercy, but on the outside of it is torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:13] The day when the hypocrites, men and women, will say to those who believe, ‘Look at us (unzurūnā: a variant reading has anzirūnā, meaning ‘Give us a chance’) that we may glean something of your light!’ It will be said, to them in mockery of them: ‘Step back and seek light!’ So they step back, then there will be set up between them, and the believers, a wall — this is said to be the wall of ‘the Heights’ [cf. Q. 7:46] — with a gate, the inner side of which contains mercy, the side of the believers, and the outer side of which, the side of the hypocrites, faces toward the chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the day) i.e. the Day of Judgement (when the hypocritical men and the hypocritical women will say) while on the Bridge over hell (unto those who believe) the true believers: (Look on us) and wait for us, group of believers, (that we may borrow from your light) that we use your light to see and cross the Bridge over hell! (it will be said) the believers will say to them; and it is said: the angels will say to them; and it is said Allah will say to them: (Go back) to the life of the world; and it is said this means: go back to the stopping-place where we were given light (and seek for light!) This is said to the hypocrites out of mockery by Allah; and it is also said that this is said by the believers; and so the hypocrites will go back seeking light. (Then there will separate them) i.e. the believers and the hypocrites (a wall wherein is a gate, the inner side whereof containeth mercy) Paradise, (while the outer side thereof is towards the doom) towards hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يوم يقول المنافقون والمنافقات } أي: المستعدّون الأقوياء الاستعداد والضعفاء المحجوبون بصفات النفوس وهيئات الأبدان\n المنغمسون في ظلمات الطبائع وغسق الآثام الذين قد بقي فيهم مسكة من نور الفطرة ولم تنظف بالكلية يشتاقون به إلى نور الكمال الحاصل لفريق المؤمنين ويلتمسونه ويطلبونه في حسرات وزفرات عند بروزهم عن حجاب البدن بالموت وظهور الحرمان محبوسين واقفين في حضيض النقصان\n متندّمين عند تبين الخسران والمؤمنون يمرّون كالبرق الخاطف لا يلفتون إليهم\n { انظرونا نقتبس من نوركم } بجنسية الاستعداد وظاهر الإسلام { قيل ارجعوا وراءكم } إلى الدنيا ومحل الكسب\n فإن النور إنما يكتسب بالآلات البدنية والقوى الجسمانية من الحواس الظاهرة والباطنة بالأعمال الحسنة والعلوم الحقة { فضرب بينهم بسور } هو البرزخ الهيولاني الذي يحتجبون به على حسب اقتضاء هيئاتهم الظلمانية { له باب } هو القلب\n إذ لا يطلع من عالم القدس على عالم الرجس إلا من طريق القلب { باطنه } وهو عالم القدس { فيه الرحمة } أي: النور والروح والريحان وجنة النعيم من المراتب المذكورة { وظاهره } الذي يلي النفس وهو عالم الرجس ومقرّ تلك النفوس المظلمة من الأشقياء { من قبله } أي: من جهته { العذاب } الذي يستحقونه بحسب هيئاتهم وتنوّعها وهذا الباب لا مفتح له من جهة ظاهره الذي إلى الأشقياء بل هو مسدود مغلق لا ينفتح أبداً\n وأما من جهة باطنه فكلما شاء أهل الجنة من السابقين انفتح لهم فاطلعوا على أهل النار وتعذّباتهم ويدخلون عليهم فينطفىء لهب النار من نورهم بل يحرق نورهم النار بالنسبة إليهم دون الجهنميين فتقول جهنم: جز يا مؤمن فإن نورك أطفأ لهبي",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ عقب سبحانه وعد المؤمنين بوعيد المنافقين فقال أيضاً على وجه التذكير: { يَوْمَ يَقُولُ ٱلْمُنَافِقُونَ } المبطلون المستمرون على النفاق مع أهل الحق { وَٱلْمُنَافِقَاتُ } أيضاً كذلك { لِلَّذِينَ آمَنُواْ } حين يرونهم { يَسْعَىٰ نُورُهُم بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِم } [الحديد: 12] { ٱنظُرُونَا } أيها السعداء المحقون\n والتفتوا نحونا { نَقْتَبِسْ مِن نُّورِكُمْ } إذ نحن في ظلمة شديدة { قِيلَ } لهم حينئذٍ من قِبَل الحق على سبيل التوبيخ والتقريع: { ٱرْجِعُواْ وَرَآءَكُمْ } أي: إلى دار الاعتبار والاختبار { فَٱلْتَمِسُواْ نُوراً } واقتبسوا من مشكاة النبوة والولاية بامتثال الأوامر والنواهي الموردة من عنده سبحانه على رسله\n وبالحكم والأسرار والصادرة من ألسنة أولي العزائم الصحيحة\n والمنجذبين نحو الحق من طريق الفناء فيه بالموت الأرادي\n واعلموا أن اقترافه واقتباسه إنما هو في دار العبرة والغرور\n لا في دار الحضور والسرور\n\n\nوبعدما جرى ما جرى { فَضُرِبَ } وحيل حينئذٍ { بَيْنَهُم } أي: بين المؤمنين والمنافقين { بِسُورٍ } حائط حائل { لَّهُ } أي: للسور { بَابٌ } مفتوح يدخل منه المؤمنون { بَاطِنُهُ } أي: باطن الباب { فِيهِ ٱلرَّحْمَةُ } النازلة من قِبَل الحق بمقتضى اسم الرحمن على أهل الإيمان والعرفان { وَظَاهِرُهُ } أي: ظاهر الباب { مِن قِبَلِهِ } سبحانه بمقتضى اسمه المنتقم { ٱلْعَذَابُ } [الحديد: 13] النازل على أهل النفاق والطغيان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أي: التفتوا إلينا وأَبْصِرونا { نَقتبس مِن نوركم } لأنَّ نورهم بين أيديهم\n فيُقال طرداً لهم وتهكُّماً بهم من جهة المؤمنين أو الملائكة: { ارجعوا وراءكم } أي: إلى الموقف\n إلى حيث أُعطينا هذا النور { فالتمِسوا نوراً } فإنّا هناك اقتبسناه\n أو: التفتوا وراءكم\n فيلتفتون فيُحال بينهم\n { فضُرِبَ } حينئذ { بينهم } بين الفريقين { بسُورٍ } بحائطٍ حائل بين شق الجنة وشق النار\n { له باب } يلي المنافقين\n ليروا ما فيه من المؤمنون من الأنوار والرحمة\n فيزدادون حسرة\n { باطِنُه } أي: باطن ذلك السور\n وهو الجهة التي تلي المؤمنين { فيه الرحمةُ وظاهرهُ } الذي يلي المنافقين { مِن قِبَلِه العذابُ } أي: العذاب حاصل من قِبَلِه\n\nفالعذاب: مبتدأ\n و { مِن قِبَلِه }: خبر\n أي: ظاهر السور تليه جهنم أو الظلمة\n فيقابله العذاب\n فهم بين النار والسور",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:10",
      "similarity": 0.5122302035553201
    },
    {
      "verse": "27:7",
      "similarity": 0.470980943425879
    },
    {
      "verse": "6:7",
      "similarity": 0.26501619318617603
    },
    {
      "verse": "72:8",
      "similarity": 0.17845757089413442
    },
    {
      "verse": "9:64",
      "similarity": 0.1544272751729097
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/57:13.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/57:13.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/57:13.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}