{
  "chapter": "الحديد",
  "text": "وما لكم الا تنفقوا۟ فى سبيل الله ولله ميرث السموت والارض لا يستوى منكم من انفق من قبل الفتح وقتل او۟لئك اعظم درجة من الذين انفقوا۟ منۢ بعد وقتلوا۟ وكلا وعد الله الحسنى والله بما تعملون خبير",
  "translations": [
    {
      "translation": "And how is it with you that you do not give in the Way of Allah, when the inheritance of the heavens and the earth belongs to Allah? Those of you who gave and fought before the Victory are not the same as those who gave and fought afterwards. They are higher in rank. But to each of them Allah has promised the Best. Allah is aware of what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What has come upon you that you do not spend in the way of God, when the heritage of the heavens and the earth belongs to God? Those of you who spent before the victory and fought, are not equal (to those who did not). They are higher in position than those who spent after (the victory) and fought. To each one God has made the promise of excellence, for God is aware of all you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How is it that you do not expend in the Way of Allah when to Allah belongs the inheritance of the heavens and the earth? Those who spent their wealth and took part in fighting before the Victory cannot be equated (with those who spent their wealth and took part in fighting afterwards). They are higher in rank than those who spent and fought afterwards. But to each Allah has promised a good reward. Allah is well aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why do you not spend for the cause of God when to Him belongs the heritage of the heavens and the earth? Those who spend for the cause of God and fight before victory will have higher positions than those who spend for the cause of God and fight after victory. However, to both parties God has promised good rewards. God is Well Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what is the matter with you that you should not spend in Allah’s cause, whereas Allah is the Inheritor of all that is in the heavens and in the earth? Those among you who spent and fought before the conquest of Mecca are not equal to others; they are greater in rank than those who spent and fought after the conquest; and Allah has promised Paradise to all of them; and Allah well knows what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what is the matter with you that you spend not in the cause of Allah And to Allah belongs the heritage of the heavens and the earth. Not equal among you are those who spent and fought before the conquering. Such are higher in degree than those who spent and fought afterwards. But to all Allah has promised the best. And Allah is All-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what reason have you that you should not spend in Allah's way? And Allah's is the inheritance of the heavens and the earth, not alike among you are those who spent before the victory and fought (and those who did not): they are more exalted in rank than those who spent and fought afterwards; and Allah has promised good to all; and Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How is it with you, that you expend not in the way of God, and to God belongs the inheritance of the heavens and the earth? Not equal is he among you who spent, and who fought before the victory; those are mightier in rank than they who spent and fought afterwards; and unto each God has promised the reward most fair; and God is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what aileth you that ye spend not in the way of Allah when unto Allah belongeth the inheritance of the heavens and the earth? Those who spent and fought before the victory are not upon a level (with the rest of you). Such are greater in rank than those who spent and fought afterwards. Unto each hath Allah promised good. And Allah is Informed of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should you not spend for the cause of God, when God alone holds the heritage of the heavens and the earth? Those of you who spent and fought before the victory will be higher in rank than those who spent and fought afterwards. Yet God has promised you all a good reward. He is aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what aileth you that ye expend not in the way of Allah, when Allah's shall be the inheritance of the heavens and the earth! Those among you who expended and fought before the victory shall not be held equal They are mightier in rank than those who expended and fought afterwards; Unto each hath Allah promised good; and Allah is of whatsoever ye work Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should you not spend in the way of Allah, when to Allah belongs the heritage of the heavens and the earth? Those of you who spent [their means] and fought before the victory are not equal [to others]. They are greater in rank than those who have spent and fought afterwards. Yet Allah has promised the best reward to each and Allah is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what cause have ye why ye should not spend in the cause of Allah?- For to Allah belongs the heritage of the heavens and the earth. Not equal among you are those who spent (freely) and fought, before the Victory, (with those who did so later). Those are higher in rank than those who spent (freely) and fought afterwards. But to all has Allah promised a goodly (reward). And Allah is well acquainted with all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what is the matter with you that you spend not in the Cause of Allah? And to Allah belongs the heritage of the heavens and the earth. Not equal among you are those who spent and fought before the conquering (of Makkah) (with those among you who did so later). Such are higher in degree than those who spent and fought afterwards. But to all, Allah has promised the best (reward). And Allah is All-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why is it that you do not spend in the Way of Allah, when the inheritance of the heavens and earth belong to Allah alone? Those who spent before the victory and took part in the fighting are mightier in rank and are not equal to those who spent and fought thereafter. Yet, Allah has promised each a fine reward, and Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why is it that you do not spend in the cause of God, when to God belongs the inheritance of the heavens and the earth? Not equal among you are those who contributed before the conquest, and fought. Those are higher in rank than those who contributed afterwards, and fought. But God promises both a good reward. God is Well Experienced in what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why do you not spend in the cause of Allah while to Allah belongs the heritage of the heavens and the earth? Not equal among you are those who spent before the conquest [of Makkah] and fought [and those who did so after it]. Those are greater in degree than they who spent afterwards and fought. But to all Allah has promised the best [reward]. And Allah, with what you do, is Acquainted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:10] And why should you, after having embraced faith, not (allā: the nūn of an [an-lā] has been assimilated here with the lām of lā) expend in the way of God when to God belongs the heritage of the heavens and the earth, with all that they comprise, so that He will [eventually] receive all your wealth but without the reward for having expended [of it for His cause], as opposed to if you had expended and had hence been rewarded. Not equal [to the rest of you] are those of you who expended and fought before the victory, at Mecca. Such are greater in rank than those who expended and fought afterwards. Yet to each, of the two groups (a variant reading [for wa-kullan, ‘yet to each’] has nominative wa-kullun as a subject) God has promised the best reward, Paradise. And God is Aware of what you do, and will requite you for it [accordingly].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَا لَكُمْ أَلَّا تُنْفِقُوا فِي سَبِيلِ اللَّهِ وَلِلَّهِ مِيرَاثُ السَّمَاوَاتِ وَالْأَرْضِ لَا يَسْتَوِي مِنْكُمْ مَنْ أَنْفَقَ مِنْ قَبْلِ الْفَتْحِ وَقَاتَلَ أُولَئِكَ أَعْظَمُ دَرَجَةً مِنَ الَّذِينَ أَنْفَقُوا مِنْ بَعْدُ وَقَاتَلُوا وَكُلًّا وَعَدَ اللَّهُ الْحُسْنَى وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ (10){ وَمَا لَكُمْ أَلاَّ تُنفِقُواْ فِى سَبِيلِ الله وَلِلَّهِ مِيرَاثُ السماوات والارض } .الإِنفاق في سبيل الله بمعناه المشهور وهو الإِنفاق في عتاد الجهاد لم يكن إلا بعد الهجرة فإن سبيل الله غلب في القرآن إطلاقه على الجهاد ويؤيده قوله عقبه : { لا يستوي منكم من أنفق من قبل الفتح } ، لأن الأصل أن يكون ذلك متصلاً نزوله مع هذا ولو حمل الإِنفاق على معنى الصدقات لكان مقتضياً أنها مدنية لأن الإِنفاق بهذا المعنى لا يطلق إلا على الصدقة على المؤمنين فلا يُلام المشركون على تركه .وعليه فالخطاب موجّه للمؤمنين ، فقد أعيد الخطاب بلون غير الذي ابتدىء به .ومن لطائفه أنه موجه إلى المنافقين الذين ظَاهِرُهم أنهم مسلمون وهم في الباطن مشركون فهم الذين شحّوا بالإِنفاق .ووجه إلحاق هذه الآية وهي مدنيّة بالمكيّ من السورة مناسبة استيعاب أحوال الممسكين عن الإِنفاق من الكفار والمؤمنين تعريضاً بالتحذير من خصال أهل الكفر إذ قد سبقها قوله : { وأنفقوا مما جعلكم مستخلفين فيه } \\[ الحديد : 7 \\] .و { ما } استفهامية مستعملة في اللوم والتوبيخ على عدم إنفاقهم في سبيل الله .و ( أَنْ ) مصدرية ، والمصدر المنسبك منها والفعل المنصوب بها في محل جر باللام ، أو ب ( في ) محذوف ، والتقدير : ما حصل لكم في عدم إنفاقكم ، أي ذلك الحاصل أمر منكر .وعن الأخفش أنَّ ( أَنْ ) زائدة فيكون بمنزلة قوله : { وما لكم لا تؤمنون بالله } \\[ الحديد : 8 \\] . وليس نصبها الفعل الذي بعدها بمانع من اعتبارها زائدة لأن الحرف الزائد قد يعمل مثلَ حرف الجر الزائد ، وقد تقدم ذلك عند قوله تعالى : { قالوا وما لنا أن لا نقاتل في سبيل الله } في سورة البقرة ( 246 ) .والواو في { ولله ميراث السموات والأرض } واو الحال وهو حال من ضمير { تنفقوا } باعتبار أن عموم السماوات والأرض يشمل ما فيهما فيشمل المخاطبين فذلك العموم هو الرابط . والتقدير : لله ميراث ما في السماوات والأرض ، ويشمل ميراثُه إياكم .والمعنى : إنكار عدم إنفاق أموالهم فيما دعاهم الله إلى الإِنفاق فيه وهم سيهلكون ويتركون أموالهم لمن قدَّر الله مصيرها إليه فلو أنفقوا بعض أموالهم فيما أمرهم الله لنالوا رضى الله وانتفعوا بمال هو صائر إلى من يرثهم .وإضافة ميراث إلى السماوات والأرض من إضافة المصدر إلى المفعول وهو على حذف مضاف ، تقديره : أهلها ، وليس المراد ميراث ذات السماوات والأرض لأن ذلك إنما يحصل بعد انقراض الناس فلا يؤثر في المقصود من حثهم على الإنفاق .{ لاَ يَسْتَوِى مِنكُم مَّنْ أَنفَقَ مِن قَبْلِ الفتح وقاتل أولئك أَعْظَمُ دَرَجَةً مِّنَ الذين أَنفَقُواْ مِن بَعْدُ وقاتلوا وَكُلاًّ وَعَدَ الله الحسنى والله بِمَا تَعْمَلُونَ خَبِير } .استئناف بياني ناشىء عمّا يجول في خواطر كثير من السامعين من أنهم تأخروا عن الإنفاق غير ناوين تركه ولكنهم سيتداركونه .وأدمج فيه تفضيل جهاد بعض المجاهدين على بعض لمناسبة كون الإِنفاق في سبيل الله يشمل إنفاق المجاهد على نفسه في العُدة والزاد وإنفاقَه على غَيْرِهِ ممن لم يستكمل عُدته ولا زاده ، ولأن من المسلمين من يستطيع الجهاد ولا يستطيع الإِنفاق ، فأريد أن لا يغفل ذكره في عداد هذه الفضيلة إذ الإِنفاق فيها وسيلة لها .وظاهر لفظ الفتح أنه فتح مكة فإن هذا الجنس المعرّف صار علماً بالغلبة على فتح مكة ، وهذا قول جمهور المفسرين .وإنما كان المنفقون قبل الفتح والمجاهدون قبله أعظم درجة في إنفاقهم وجهادهم لأن الزمان الذي قبل فتح مكة كان زمان ضعف المسلمين لأن أهل الكفر كانوا أكثرَ العرب فلما فُتحت مكة دَخلت سائر قريش والعرب في الإسلام فكان الإنفاق والجهاد فيما قبل الفتح أشَقَّ على نفوس المسلمين لقلة ذات أيديهم وقلة جمعهم قبالة جمع العدوّ ، ألا ترى أنه كان عليهم أن يثبتوا أمام العدوّ إذا كان عدد العدوّ عشرة أضعاف عدد المسلمين في القتال قال تعالى : { إن يكن منكم عشرون صابرون يغلبوا مائتين } \\[ الأنفال : 65 \\] .وقيل المراد بالفتح : صلح الحديبية ، وهذا قول أبي سعيد الخدري رضي الله عنه والزهري ، والشعبي ، وعامر بن سعد بن أبي وقاص ، واختاره الطبري . ويؤيده ما رواه الطبري عن أبي سعيد الخدري «أن رسول الله صلى الله عليه وسلم تلا هذه الآية عام الحديبية» وهو الملائم لكون هذه السورة بعضها مكي وبعضها مدنيّ فيقتضي أن مدنيّها قريب عهد من مدة إقامتهم بمكة ، وإطلاق الفتح على صلح الحديبية وَاردٌ في قوله تعالى : { إنا فتحنا لك فتحاً مبيناً } \\[ الفتح : 1 \\] .و { مَن أنفق } عامٌّ يشمل كلّ من أنفق . وقيل : أريد به أبو بكر الصديق فإنه أنفق ماله كله من أول ظهور الإسلام .ونفي التسوية مراد به نفيها في الفضيلة والثواب فإن نفي التسوية في وصف يقتضي ثبوت أصل ذلك الوصف لجميع من نفيت عنهم التسوية ، فنفي التسوية كناية عن تفضيل أحد جانبين وتنقيص الجانب الآخر نقصاً متفاوتاً .ويعرف الجانب الفاضل والجانب المفضول بالقرينة أو التصريح في الكلام ، وليس تقديم أحد الجانبين في الذكر بعد نفي التسوية بمقتض أنه هو المفضل فقد قال الله تعالى : { لا يستوي القاعدون من المؤمنين غير أولي الضرر والمجاهدون في سبيل الله بأموالهم وأنفسهم } \\[ النساء : 95 \\] وقدم هذه الآية الجانب المفضَّل ، وكذا الذي في قول السموأل :فليس سواءً عالم وَجَهول ... وقد أكد هذا الاقتضاء بقوله : { أولئك أعظم درجة من الذين أنفقوا من بعد وقاتلوا } ، أي أنفقوا من بعد الفتح وقاتلوا من بعد الفتح ، فإن اسم التفضيل يدل على المشاركة فيما اشتق منه اسم التفضيل وزيادة من أخبر عنه باسم التفضيل في الوصف المشتق منه ، أي فكلا الفريقين له درجة عظيمة .وحُذف قسم من أنفق من قبل الفتح إيجازاً لدلالة فعل التسوية عليه لا محالة .والتقدير : لا يستوي من أنفق من قبل الفتح ومن أنفق بعده .والدرجة : مستعارة للفضل لأن الدرجة تستلزم الارتقاء ، فوصف الارتقاء ملاحظ فيها ، ثم يشبَّه الفضل والشرف بالارتقاء فعبر عنه بالدرجة ، فالدرجة من أسماء الأجناس التي لوحظت فيها صفات أوصاف مثل اسم الأسد بصفة الشجاعة في قول الخارجي :أسد علي وفي الحروب نعامة ... وقوله : { وكلاًّ وعد الله الحسنى } احتراس من أن يتوهم متوهم أن اسم التفضيل مسلوب المفاضلة للمبالغة مثل ما في قول : { قال رب السجن أحب إلي مما يدعونني إليه } \\[ يوسف : 33 \\] ، أي حبيب إليّ دون ما يدعونني إليه من المعصية .وعبر ب { الحسنى } لبيان أن الدرجة هي درجة الحسنى ليكون للاحتراس معنى زائد على التأكيد وهو ما فيه من البيان .والحسنى : لقب قرآني إسلامي يدل على خيرات الآخرة ، قال تعالى : { للذين أحسنوا الحسنى وزيادة } \\[ يونس : 26 \\] .وقوله : { منكم } حال من { من أنفق } أصله نعت قُدّم للاهتمام تعجيلاً بهذا الوصف .وجيء باسم الإِشارة في قوله : { أولئك أعظم درجة } دون الضمير لما تؤذن به الإِشارة من التنويه والتعظيم ، وللتنبيه على أن المشار إليهم جديرون بما يذكر بعد اسم الإِشارة ، لأجل ما ذُكر قبله من الإِخبار ومثله قوله : { أولئك على هدًى من ربهم } \\[ البقرة : 4 \\] بعد قوله : { هدى للمتقين الذين يؤمنون بالغيب } \\[ البقرة : 3 \\] الخ .وقرأ الجمهور { وكلاً وعد الله الحسنى } بنصب { كلاًّ } على أنه مفعول أول مقدم على فعله على طريقة الاشتغال بالضمير المحذوف اختصاراً . وقرأه ابن عامر بالرفع على الابتداء وهما وجهان في الاشتغال متساويان .وهذه الآية أصل في تفاضل أهل الفضل فيما فُضلوا فيه ، وأن الفضل ثابت للذين أسلموا بعد الفتح من أهل مكة وغيرهم . وبئس ما يقوله بعض المؤرخين من عبارات تؤذن بتنقيص من أسلموا بعد الفتح من قريش مثل كلمة «الطلقاء» وإنما ذلك من أجل حزازات في النفوس قبلية أو حزبية ، والله يقول : { ولا تلمزوا أنفسكم ولا تنابزوا بالألقاب بئس الاسم الفسوق بعد الإيمان ومن لم يتب فأولئك هم الظالمون } \\[ الحجرات : 11 \\] .وجملة { والله بما تعملون خبير } تذييل ، والواو اعتراضية ، والمعنى : أن الله يعلم أسباب الإِنفاق وأوقاته وأعذاره ، ويعلم أحوال الجهاد ونوايا المجاهدين فيعطي كل عامل على نية عمله .\n\n",
      "translations": [
        {
          "translation": "(And what aileth you) believers (that ye spend not in the way of Allah) in obedience of Allah, (when Unto Allah belongeth the inheritance of the heavens and the earth) the inhabitants of the heavens and the earth will all perish, and only Him will remain, and the results of all things will go back to Him? (Those) of you, believers (who spent and fought) the enemy along with the Prophet (pbuh) (before the victory) before the conquest of Mecca (are not upon a level (with the rest of you)) are not equal in the sight of Allah in terms of merit and obedience. (Such) the people who have this trait (are greater in rank) in merit and standing in the sight of Allah through their obedience and reward-this refers to Abu Bakr al-Siddiq-(than those who spent and fought afterwards) than those who spend after the conquest of Mecca and fight the enemies along with the Prophet (pbuh) thereafter. (Unto each hath Allah promised good) i.e. the Garden through faith. (And Allah is Informed of what ye do) of what you spend.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وأما { الذين أنفقوا من بعد } فلضعف استعداداتهم وقلّة نوريتها احتاجوا إلى قوة تأثيره فيهم وإخراج كمالاتهم إلى الفعل { وكلاًّ وعد الله } المثوبة { الحسنى } لحصول اليقين وظهور الكمال كيف كان مع تفاوت الدرجات بما لا تحصى\n إذ الآخرون هم الذين حازوا الكمال الخلقي في مقام النفس الذين أقرضوا الله أموالهم رغبة في الإضعاف من الثواب وكرامة الأجر",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا لَكُمْ أَلاَّ تُنفِقُواْ } أي: أيّ شيء يمنعكم عن الإنفاق { فِي سَبِيلِ ٱللَّهِ } تقرباً إليه\n وطلباً لمرضاته\n وامتثالاً لأوامره { وَلِلَّهِ } الغني بذاته\n المستغني عن مطلق مظاهره ومصنوعاته { مِيرَاثُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: العلويات والسفليات والممتزجات\n وهو في ذاته غني عن إنفاقكم وبذلكم\n إلاَّ أنه { لاَ يَسْتَوِي مِنكُم مَّنْ أَنفَقَ مِن قَبْلِ ٱلْفَتْحِ } أي: أنفق قبل فتح مكة ممتثلاً لأمر الله\n مجهداً في تقوية دين الإسلام وترويجه وظهوره على الأديان الباطلة\n وتكثير أهل الحق وتغليبه { وَ } مع إنفاقه على المقاتلين في سبيل الله\n لإعلاء كلمة توحيده { قَاتَلَ } أيضاً بنفسه\n وسعى ببذل المال والروح في طريق الحق وترويجه { أُوْلَـٰئِكَ } السعداء المنفقون المقاتلون لهم { أَعْظَمُ دَرَجَةً } وأكرم مثوبة ومقاماً عند الله { مِّنَ } المؤمنين { ٱلَّذِينَ أَنفَقُواْ مِن بَعْدُ } أي: بعد فتح مكة وغلبة المسلمين\n وظهور دين الإسلام { وَقَاتَلُواْ } بعده مع كثرة المقاتلين\n\n\n{ وَ } بالجملة: { كُلاًّ وَعَدَ ٱللَّهُ ٱلْحُسْنَىٰ } أي: وعد الله كلاًًّ من المسلمين المبادرين\n أو المبطئين الوعد الحسنى\n والدرجة العليا\n والمثوبة العظمة حسب سعيهم واجتهادهم في تقوية الشرع\n وترويج الدين القويم { وَ } بالجملة: { ٱللَّهُ } المطلع بسرائر عباده { بِمَا تَعْمَلُونَ } أي: بعموم أعمالكم وأحوالكم خالصها ومشوبها\n صالحها وفسادها { خَبِيرٌ } [الحديد: 10] بصير لا يعزب عن حضرته شيء منها\n يجازيكم على مقتضى خبرته\n\n\nثمَّ قال سبحانه على سبيل الحث والترغيب: { مَّن ذَا ٱلَّذِي يُقْرِضُ ٱللَّهَ } وينفق في سبيله من أكرم أمواله { قَرْضاً حَسَناً } بلا شوب المنّ والأذى",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وإنما أنتم خلفاؤه في صرفه إلى ما عيّنه من المصارف؟ { ولله ميراثُ السماوات والأرض } يرث كل شيء فيهما\n لا يبقى لأحد شيء من ذلك\n وإذا كان كذلك فأيّ عذر لكم في ترك إنفاقه { في سبيل الله } والله مُهلككم\n فوارث أموالكم؟ فتقديمها لله أولى\n وهي أبلغ آية في الحث على الصدقة\n وإظهار اسم الجليل في موضع الإضمار في \" لله \" لزيادة التقرير\n وتربية المهابة\n ثم بيّن التفاوت بين المنفِقين منهم باعتبار الزمان\n فقال: { لا يستوي منكم مَن أنفق مِن قبل الفتح وقاتلَ } مع مَن أنفق بعد الفتح وقاتل\n حذفه لدلالة ما بعده عليه من قوله: { أولئك أعظم درجة\n\n\n\n } الخ\n والمراد: فتح مكة\n أي: لا يستوي مَن أنفق قبل عز الإسلام وظهوره\n مع مَن أنفق بعد لك\n { أولئك } الذين أنفقوا قبل الفتح وقاتلوا\n وهم السابقون الأولون من المهاجرين والأنصار\n الذين قال فيهم النبي صلى الله عليه وسلم:\n \" لو أنفق أحدكم مثل أُحُدٍ ذهباً ما بَلَغَ مُدَّ أَحَدِهِمْ\n ولا نِصفه \" \n\n فهم { أعظمُ درجةً من الذين أنفقوا من بعدُ وقاتلَوا } لأنّ مَن أنفق وقت الحاجة والاضطرار\n أعظم ممن أنفق في حال السعة والبسط\n { وكُلاًّ } أي: كل واحد من الفريقين { وَعَدَ اللّهُ الحسنى } وهي الجنة مع تفاوت الدرجات\n وقرأ الشامي بالرفع\n مبتدأ\n أي: وعده الله الحسنى\n { والله بما تعملون خبير } فيُجازيكم على قدر أعمالكم\n { من ذا الذي يُقْرِضُ اللّهَ قرضاً حسناً } هو ندب بليغ من الله تعالى إلى الإنفاق في سبيله\n بعد الأمر به\n والتوبيخ على تركه\n وبيان درجات المنفقين\n أي: مَن ذا الذي يُنفق ماله في سبيل الله رجاء أن يعوضه مثل ذلك وأكثر\n فإنه كمن يُقرضه\n وحسن الإنفاق بالإخلاص فيه\n وتحري أكرم المال\n وأفضل الجهات",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:95",
      "similarity": 0.43194243175716307
    },
    {
      "verse": "46:19",
      "similarity": 0.398635135342909
    },
    {
      "verse": "3:163",
      "similarity": 0.3893310154430325
    },
    {
      "verse": "6:132",
      "similarity": 0.38032291926750267
    },
    {
      "verse": "20:75",
      "similarity": 0.3725671303899854
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/057010.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/057010.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/57:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}