{
  "chapter": "الحديد",
  "text": "سبح لله ما فى السموت والارض وهو العزيز الحكيم",
  "translations": [
    {
      "translation": "Everything in the heavens and the earth glorifies Allah. He is the Almighty, the All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "WHATSOEVER IS IN the heavens and the earth sings the praises of God. He is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and the earth extols the glory of Allah. He is the Most Mighty, the Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and the earth glorify God. He is Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All whatever is in the heavens and in the earth proclaims the Purity of Allah; and He only is the Most Honourable, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and the earth glorifies Allah -- and He is the Almighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and the earth declares the glory of Allah, and He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and the earth magnifies God; He is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and the earth glorifieth Allah; and He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everything in the heavens and earth glorifies God -- He is the Mighty, the Wise One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever is in the heavens and the earth halloweth Allah; and He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever there is in the heavens and [whatever there is on] the earth glorifies Allah and He is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and on earth,- let it declare the Praises and Glory of Allah: for He is the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever is in the heavens and the earth glorifies Allah, and He is the All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and earth exalt Allah. He is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glorifying God is everything in the heavens and the earth. He is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and earth exalts Allah, and He is the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:1] All that is in the heavens and the earth glorifies God, that is to say, all things exalt Him as being transcendent (thus, the lām [of li’Llāhi] is extra; mā, ‘[all] that’, is used instead of min, ‘[all] who’, in order to indicate what is the predominant [sc. non-rational beings]); and He is the Mighty, in His kingdom, the Wise, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's ' There is difference of opinion among Muslim scholars about whether this surah is Meccan or Medinan. 647 saying's (All that is in the heavens and the earth glorifieth Allah): 'He says: (All that is in the heavens) of creation (and the earth) of created beings (glorifieth Allah) pray to Allah; and it is said this means: makes remembrance of Allah, (and He is the Mighty) in retribution against those who disbelieve in Him, (the Wise) in His command and decree: He commanded that none should be worshipped save Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السّائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { سَبَّحَ للَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } معناه خَضعَ وذَلَّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ سَبَّحَ للَّهِ } الواحد الأحد الصمد، المستقل بالبقاء والقيومية، المتفرد بالتحقق والثبوت على وجه الديمومية، الحي الحقيق بالألوهية والربوبية، مظاهر { مَا فِي ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } من الكوائن العلوية والسفلية، الغيبية والشهادية، ونزهه عن مطلق النقائص المنافية لصرافة وحدته الذاتية بعدما اعترفت ألسنة استعدادات الكل بربوبيته طوعاً، واشتغلوا بلوازم عبوديته رغبةً { وَ } كيف لا يسبحونه ولا يعظمونه، والحال أنه { هُوَ ٱلْعَزِيزُ } الغالب المقتدر على وجوه الإنعام والانتقام { ٱلْحَكِيمُ } [الحديد: 1] المتقن في إيجادها وإظهارها على وفق الإرادة والاختيار؟!\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: وقعت مادة التسبيح في القرآن بلفظ الماضي والمضارع والأمر والمصدر استيفاء لهذه المادة، فقال هنا: { سَبَّحَ } وفي الجمعة:\n\n[الجمعة: 1] و\n\n[الأعلى: 1] و\n\n[الإسراء: 1]\n وهذا الفعل قد عُدّي باللام تارة، وبنفسه أخرى في قوله:\n\n[الأحزاب: 42]، وأصله: التعدي بنفسه لأنّ معنى سبَّحته: بعّدته من السوء، من: سَبَح: إذا ذهب وبَعُد، فاللام إما أن تكون مثل اللام في: نصحته ونصحت له، وإما أن يراد بـ \" سبَّح لله \": اكتسب التسبيح لأجل الله ولوجهه خالصاً\n قاله النسفي\n يقول الحق جلّ جلاله: { سَبَّح لله } أي: نَزَّه اللّهَ عما لا يليق بجلاله، اعتقاداً، أو قولاً وعملاً، مَن استقر { في السماوات والأرض } مِن الملائكة والجن والإنس والجمادات، بلسان الحال والمقال، فإنَّ كل فرد من أفراد الموجودات يدلّ بإمكانه وحدوثه على الصانع القديم، الواجب الوجود، المتصف بالكمال، المنزَّه عن النقائص، وهو المراد بقوله تعالى:\n\n[الإسراء: 44] قيل: إنما استغنى عن إعادة الموصل في خصوص هذه السورة لتكرر ذكر الأرض هنا في أربعة مواضع\n هـ\n { وهو العزيزُ } المنتقِم ممن لم يُسبِّح له عناداً، { الحكيمُ } في مجازاة مَن سبَّح له انقياداً\n { وله مُلك السماواتِ والأرض } أي: التصرُّف الكلي فيهما وفيما فيهما من الموجودات، مِن نعت الإيجاد والإعدام وسائر التصرفات\n قال الورتجبي: ذكر الله سبحانه ملكه على قدر أفهام الخليقة، وإلاّ فأين السموات والأرض من ملكه، والسموات والأرضون في ميادين مملكته أقل من خردلة! لمّا علم عجز خلقه عن إدراك ما فوق رؤيتهم، ذكر أنَّ مُلك السموات والأرض مِلكُ قدرته الواسعة، التي إذا أراد الله إيجاد شيء يقول كن فيكون بقدرته، وليس لقدرته نهاية، ولا لإرادته منتهى\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "59:1",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "61:1",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "45:37",
      "similarity": 0.6822041955188959
    },
    {
      "verse": "2:32",
      "similarity": 0.6396364558061136
    },
    {
      "verse": "37:166",
      "similarity": 0.5365534467358908
    }
  ]
}