{
  "chapter": "الحديد",
  "text": "والذين ءامنوا۟ بالله ورسله او۟لئك هم الصديقون والشهداء عند ربهم لهم اجرهم ونورهم والذين كفروا۟ وكذبوا۟ بـايتنا او۟لئك اصحب الجحيم",
  "translations": [
    {
      "translation": "Those who have iman in Allah and His Messengers - such people are the truly sincere - and the martyrs who are with their Lord will receive their wages and their light. But those who are kafir and deny Our Signs, will be Companions of the Blazing Fire.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in God and His apostles are true of word and deed; and by their Lord are considered testifiers of the truth. They have their guerdon and their light. As for those who do not believe and reject Our revelations, are the people of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In Allah's sight only those who truly believe in Allah and His Messengers are utterly truthful and true bearers of witness (for the sake of Allah). For them is their reward and their light. As for those who gave the lie to Our Signs, they are the people of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in God and His Messenger are the truthful ones and are witness (to the deeds of others) before their Lord. They will have their reward and their light. Those who disbelieve and reject Our revelations shall be the dwellers of hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe in Allah and all His Noble Messengers, are the truly sincere; and are witness upon others, before their Lord; for them is their reward, and their light; and those who disbelieved and denied Our signs, are the people of hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe in Allah and His Messengers. they are the Siddiqun (true believers) and the martyrs with their Lord. They shall have their reward and their light. But those who disbelieve and deny Our Ayat -- they shall be the dwellers of the blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who believe in Allah and His apostles, these it is that are the truthful and the faithful ones in the sight of their Lord: they shall have their reward and their light, and (as for) those who disbelieve and reject Our communications, these are the inmates of the hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe in God and His Messengers -- they are the just men and the martyrs in their Lord's sight; they have their wage, and their light. But the unbelievers, who have cried lies to Our signs, they are the inhabitants of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe in Allah and His messengers, they are the loyal, and the martyrs are with their Lord; they have their reward and their light; while as for those who disbelieve and deny Our revelations, they are owners of hell-fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in God and His messengers are the truthful ones and the witnesses in the sight of their Lord. They shall have their reward and their light. But those who are bent on denying the truth and reject Our signs shall be destined for Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe in Allah and His apostles - those! they are the saints and martyrs in the sight of their Lord; theirs will be their full hire and their light. And those who disbelieved and belied Our signs--they shall be the fellows of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have faith in Allah and His apostles—it is they who are the truthful and witnesses with their Lord; they shall have their reward and their light. But as for those who are faithless and deny Our signs, they shall be the inmates of hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe in Allah and His messengers- they are the Sincere (lovers of Truth), and the witnesses (who testify), in the eyes of their Lord: They shall have their Reward and their Light. But those who reject Allah and deny Our Signs,- they are the Companions of Hell-Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe in (the Oneness of) Allah and His Messengers, they are the Siddiqun (i.e. those followers of the Prophets who were first and foremost to believe in them), and the martyrs with their Lord, they shall have their reward and their light. But those who disbelieve (in the Oneness of Allah - Islamic Monotheism) and deny Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), they shall be the dwellers of the blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in Allah and His Messengers are the sincere and the martyrs before their Lord, they shall have their reward and their light. But those that disbelieve and belied Our verses are the inhabitants of Gehenna (Hell).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe in God and His messengers—these are the sincere and the witnesses with their Lord; they will have their reward and their light. But as for those who disbelieve and deny Our revelations—these are the inmates of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who have believed in Allah and His messengers - those are [in the ranks of] the supporters of truth and the martyrs, with their Lord. For them is their reward and their light. But those who have disbelieved and denied Our verses - those are the companions of Hellfire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:19] And those who believe in God and His messengers — they are the truthful, (al-siddīqūna) those who go to the greatest lengths to be truthful, and the witnesses with their Lord, against the deniers of [all] communities; they will have their reward and their light. But those who disbelieve and deny Our signs, those [signs] that testify to [the truth of] Our Oneness — they will be the inhabitants of Hell-fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who believe in Allah and His messengers) from among all nations, (they are the loyal) in their faith; (and the martyrs are with their Lord; they have their reward and their light) at the Bridge over hell; and it is also said this means that the martyrs mentioned above refer to the witnesses who will testify in favour of the prophets against their respective peoples; and it is said that they refer to those who were killed while fighting for the sake of Allah: all these have the reward of the prophets in the course of conveying their message and will also have their light at the Bridge over hell to see their way while crossing it; (while as for those who disbelieve and deny Our revelations) i.e. the Scripture and Messenger, (they are owners of hellfire) they are the dwellers of the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n أي: ليسوا من أهل الإيمان بالغيب ولا من أهل الإيقان { أولئك أصحاب } جحيم الطبيعة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأكدوه بصوالح أعمالهم وإحسانهم { أُوْلَـٰئِكَ } السعداء المقبولون { هُمُ ٱلصِّدِّيقُونَ } المتبالغون في الصدق\n والمقصورون على الإخلاص\n المتمكنون في منهج حق اليقين { وَٱلشُّهَدَآءُ } الكشافون المشاهدون\n الحاضرون { عِندَ رَبِّهِمْ } المستغرقون بمطالعة لقائه { لَهُمْ } في النشأة الأخرى { أَجْرُهُمْ وَنُورُهُمْ } الموعود لهم من قِبل الحق على وجه لا مزيد عليه { وَ } المسرفون المفرطون { ٱلَّذِينَ كَفَرُواْ } بوحدة ذاتنا { وَكَذَّبُواْ بِآيَاتِنَآ } الدالة على استقلالنا في تصرفاتنا عتواً وعناداً { أُوْلَـٰئِكَ } الأشقياء المردودون هم { أَصْحَابُ ٱلْجَحِيمِ } [الحديد: 19] أي: ملازموها وملاصقوها\n لا نجاة لهم منها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { و } هم أيضاً { الشهداءُ عند ربهم } وظاهره: أن كل مَن آمن بالله ورسله ينال درجة الصدّيقين\n الذين درجتهم دون درجة الأنبياء\n وفوق درجة الخواص\n وأنَّ كل مَن آمن ينال درجة الشهداء\n وليس كذلك\n فينبغي حمل قوله: { آمَنوا } على خصوص إيمان وكماله\n وهم الذين لم يشكّوا في الرسل حين أخبَروهم\n ولم يتوقفوا ساعة\n أي: سبقوا إلى الإيمان\n واستشهدوا في سبيل الله\n وسيأتي في الإشارة حقيقة الصدّيق\n وقيل: كل مَن آمن بالله ورسله مطلق الإيمان فهو صدّيق وشهيد\n أي: ملحق بهما\n وإن لم يتساووا في النعيم\n كقوله:\n[النساء: 69]\n والحاصل على هذه العبارة: الترغيب في الإيمان والحث عليه\n وهو وارد في كلام العرب في مبالغة التشبيه\n تقول: فلان هو حاتم بعينه\n إذا شابهه في الجود\n ويؤيد هذا حديث البراء بن عازب: أن النبي صلى الله عليه وسلم قال:\n \" مؤمنو أمتي شهداء \" \nقال مجاهد: كل مؤمن صدّيق وشهيد\n أي: على ما تقدّم\n وإنما خصّ النبي صلى الله عليه وسلم ذكرَ الشهداء السبعة تشريفاً على رتب الشهداء غيرهم\n ألا ترى أنَّ المقتول في سبيل الله مخصوص أيضاً بتشريف ينفرد به\n وقال بعضهم: معنى الشهداء هنا: أنهم يشهدون على الأمم\n\nقال ابن عباس ومسروق والضحاك: الكلام تام في قوله: \" الصدّيقون \" \n وقوله: \" الشهداء \" استئناف كلام\n أي: والشهداء حاضرون عند ربهم\n أو: والشهداء { لهم أجرهم ونورهم } عند ربهم\n قال أبو حيان: والظاهر: أن \" الشهداء \" مبتدأ\n خبره ما بعده\n هـ\n قلت: الظاهر: أنَّ الآية متصلة\n فكل مؤمن حقيقي صدّيق وشهيد\n أي: يلحق بهم\n وقوله: { لهم أجرهم ونورهم } أي: لهم أجر الصدّيقين ونورهم\n على التشبيه\n ولا يبلغ المشبَّه درجة المشبَّه به\n وإذا قيّدنا الإيمان بالسبق\n فالمعنى لهم أجرهم كامل ونورهم تام\n ويؤيد عدم التقييد: ذكر ضده عقبه\n كما هو عادة التنزيل\n بقوله: { والذين كفروا وكذّبوا بآياتنا أولئك أصحاب الجحيم }\n الإشارة: إنَّ المصدّقين والمصدّقات\n وهم الذين بذلوا مهجهم وأرواحهم في مرضاة الله - ومَن كان في الله تلفه كان على الله خَلَفَه - وأقرضوا الله قرضاً حسناً\n أي: قطعوا قلوبهم عن محبة ما سواه\n وحصروه في حضرة الله\n يُضاعف لهم أنوارهم وأسرارهم\n ولهم أجر كريم\n شهود الذات الأقدس\n وهؤلاء هم الصدِّيقون المشار إليهم بقوله: { والذين آمنوا بالله ورسله أولئك هم الصدّيقون } فهذا الإيمان عند الصوفية مقيد\n قال الورتجبي: هم الذين شاهدوا الله بالله بنعت المعرفة والمحبة\n وتبعوا رسولَه بنعت المحبة والمعرفة بشرفه وفضله\n والانقياد بين يدي أمره ونهيه\n فأولئك هم الصدّيقون لأنهم معادن الإخلاص واليقين\n وتصديق الله في قوله بعد أن شاهدوه مشاهدة الصديقية\n التي لا اضطراب فيها من جهة معارضة النفس والشيطان\n وهم شهداء الله المقتولون بسيوف محبته\n مطروحون في بحر وصلته\n يَحْيون بجماله\n يَشهدون على وجودهم بفنائه في الله\n وبفناء الكون في عظمة الله\n وهم قوم يستشرفون على هموم الخلائق بنور الله\n يشهدون لهم وعليهم لِصدق الفراسة لأنهم أمناء الله\n خصَّهم الله بالصديقية والسعادة والولاية والخلافة\nهـ\n وقال القشيري: الصدّيق مَن استوى ظاهرُه وباطنُه\n ويقال: هو الذي يحمل الأمرَ على الأشَق\n لا يَنْزلُ إلى الرُّخَصِ\n ولا يجنح إلى التأويلات\n والشهداء: الذين يشهدون بقلوبهم مواطن الوصلة\n ويعتكفون بأسرارهم في أوطان القُربة\n ونُورهم: ما كحل الحق به بصائرهم من أنوار التوحيد\n هـ\n ولمّا كان الزهد شرطاً في هذا المقام ذكر تحقير الدنيا ليقع الزهد فيها\n فقال: { ٱعْلَمُوۤاْ أَنَّمَا ٱلْحَيَاةُ ٱلدُّنْيَا }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:10",
      "similarity": 0.7420310496815278
    },
    {
      "verse": "5:86",
      "similarity": 0.7420310496815278
    },
    {
      "verse": "2:119",
      "similarity": 0.5629282792309849
    },
    {
      "verse": "102:6",
      "similarity": 0.520984331591371
    },
    {
      "verse": "9:113",
      "similarity": 0.5109413490800264
    }
  ]
}