{
  "chapter": "الحديد",
  "text": "فاليوم لا يؤخذ منكم فدية ولا من الذين كفروا۟ ماوىكم النار هى مولىكم وبئس المصير",
  "translations": [
    {
      "translation": "So today no ransom will be accepted from you or from those who were kafir. Your refuge is the Fire. It is your master. What an evil destination!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So no ransom will be accepted of you on this day, or of those who refused to believe. Hell will be your refuge and the only friend -- and how evil a destination!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So no ransom shall be accepted from you today, nor from those who disbelieved. You are destined for the Fire. That will be your guardian. And that indeed is a grievous destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So on this day no ransom will be accepted from you nor from the disbelievers. Your dwelling will be fire. It will be your friend and a terrible end\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“So this day no ransom is to be taken from you nor from the declared disbelievers; your destination is the fire; that is your companion; and what a wretched outcome!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, this Day no ransom shall be taken from you, nor of those who disbelieved. Your abode is the Fire. That is your protector, and worst indeed is that destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So today ransom shall not be accepted from you nor from those who disbelieved; your abode is the fire; it is your friend and evil is the resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore today no ransom shall be taken from you, neither from those who disbelieved. Your refuge is the Fire, that is your master -- an evil homecoming!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So this day no ransom can be taken from you nor from those who disbelieved. Your home is the Fire; that is your patron, and a hapless journey's end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So this Day no ransom can be taken from you nor from those who were bent on denying the truth. Your home is the fire; that is your companion, and a hapless journey's end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To-day therefore no ransom will be accepted of you nor of those who openly disbelieved; your abode is the Fire; that is your companion; a hapless destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So today no ransom shall be taken from you or the faithless. The Fire will be your abode: it is your [ultimate] refuge and an evil destination.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Day shall no ransom be accepted of you, nor of those who rejected Allah.\" Your abode is the Fire: that is the proper place to claim you: and an evil refuge it is!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So this Day no ransom shall be taken from you (hypocrites), nor of those who disbelieved, (in the Oneness of Allah Islamic Monotheism). Your abode is the Fire, that is the proper place for you, and worst indeed is that destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Today no ransom shall be accepted from you or from the unbelievers. Your shelter is the Fire, that is your sponsor, the worst arrival'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Therefore, today no ransom will be accepted from you, nor from those who disbelieved. The Fire is your refuge. It is your companion—what an evil fate!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So today no ransom will be taken from you or from those who disbelieved. Your refuge is the Fire. It is most worthy of you, and wretched is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:15] So on this day no ransom will be taken from you (read tu’khadhu or yu’khadhu) nor from those who disbelieved. Your abode will be the Fire: it will be your guardian, it is [the place truly] deserving of you, and an evil destination!’, it is.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَالْيَوْمَ لَا يُؤْخَذُ مِنْكُمْ فِدْيَةٌ وَلَا مِنَ الَّذِينَ كَفَرُوا مَأْوَاكُمُ النَّارُ هِيَ مَوْلَاكُمْ وَبِئْسَ الْمَصِيرُ (15)يجوز أن يكون هذا الكلام من تتمة خطاب المؤمنين للمنافقين استمراراً في التوبيخ والتنديم . وهذا ما جرى عليه المفسرون ، فموقع فاء التفريع بينّ والعلم للمؤمنين بأن لا تؤخذ فدية من المنافقين والذين كفروا حاصل مما يسمعون في ذلك اليوم من الأقضية الإِلهية بين الخلق بحيث صار معلوماً لأهل المحشر ، أو هو علم متقرر في نفوسهم مما علموه في الدنيا من أخبار القرآن وكلام النبي صلى الله عليه وسلم وذلك موجب عطف { ولا من الذين كفروا } تعبيراً عما علموه بأسره وهو عطف معترض جَرَّته المناسبة .ويجوز أن يكون كلاماً صادراً من جانب الله تعالى للمنافقين تأييساً لهم من الطمع في نوال حظ من نور المؤمنين ، فيكون الفاء من عطف التلقين عاطفة كلام أحد على كلام غيره لأجل اتحاد مكان المخاطبة على نحو قوله تعالى قال : { ومن ذريتي } \\[ إبراهيم : 40 \\] .ويكون عطف { ولا من الذين كفروا } جمعاً للفريقين في توبيخ وتنديم واحد لاتحادهما في الكفر .وإقحام كلمة { فاليوم } لتذكيرهم بما كانوا يضمرونه في الدنيا حين ينفقون مع المؤمنين ريَاء وتقيّة . وهو ما حكاه الله عنهم بقوله : { ومن الأعراب من يتخذ ما ينفق مغرماً ويتربص بكم الدوائر } \\[ التوبة : 98 \\] .وقرأ الجمهور { لا يؤخذ } بياء الغائب المذكر لأن تأنيث { فدية } غير حقيقي ، وقد فُصل بين الفعل وفاعله بالظرف فحصل مسوغان لترك اقتران الفعل بعلامة المؤنث . وقرأه ابن عامر وأبو جعفر ويعقوب بمثناة فوقية جرياً على تأنيث الفاعل في اللفظ ، والقراءتان سواء .وكني بنفي أخذ الفدية عن تحقق جزائهم على الكفر ، وإلا فإنهم لم يبذلوا فدية ، ولا كان النفاق من أنواع الفدية ولكن الكلام جرى على الكناية لما هو مشهور من أن الأسير والجاني قد يتخلصان من المؤاخذة بفدية تبذل عنهما .فعطف { ولا من الذين كفروا } قُصد منه تعليل أن لا محيص لهم من عذاب الكفر ، مثل الذين كفروا ، أي الذين أعلنوا الكفر حتى كان حالةً يعرفون بها . وهذا يقتضي أن المنافقين كانوا هم والكافرون في صعيد واحد عندَ أبواببِ جهنم ، ففيه احتراس من أن يتوهم الكافرون الصرحاء من ضمير { لا يؤخذ منكم فدية } أن ذلك حكم خاص بالمنافقين تعلقاً بأقل طمع ، فليس ذكر { ولا من الذين كفروا } مجرد استطراد .والمأوى : المكان الذي يُؤَوى إليه ، أي يصَار إليه ويُرجع ، وكني به عن الاستمرار والخلود .وأكد ذلك بالصريح بجملة { مأواكم النار هي مولاكم } أي ترجعون إليها كما يرجع المستنصر إلى مولاه لينصره أو يفادي عنه ، فاستعير المولى للمَقَرَّ على طريقة التهكم .ويجوز مع ذلك أن يجعل المولى اسم مكان الوَلْي ، وهو القرب والدنوّ ، أي مقركم ، كقول لبيد :فغدتْ كلا الفرجينْ تحسب أنه ... مَولَى المخافة خلْفُها وأمَامُهاأي مكان المخافة ومقرها .و { بئس المصير } تذييل يشمل جميع ما يصيرون إليه من العذاب . وقد يحصل العلم للمؤمنين بما أجابوا به أهل النفاق لأنهم صاروا إلى دار الحقائق .\n\n",
      "translations": [
        {
          "translation": "(So this day) which is the Day of Judgement (no ransom can be taken from you) group of hypocrites (nor from those who disbelieved) in Muhammad (pbuh) and the Qur'an. (Your home is the Fire) your destination is the Fire; (that is your patron) it has better right over you, (and a hapless journey's end) they will come to: their companions being the satans, their neighbours the disbelievers, their food the Zaqqum, their drink boiling water, their clothes pieces of fire and their visitors snakes and scorpions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { هِيَ مَوْلاَكُمْ } معناه أَولى بكُمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"She is your mother,\" - it is with the foremost of your [rights] upon her.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما وقع ما وقع { فَٱلْيَوْمَ } الذي تبلى السرائر فيه { لاَ يُؤْخَذُ مِنكُمْ } أيها المنافقون المخادعون { فِدْيَةٌ } تفدون بها\n لتخليصكم من العذاب لا منكم أيها المنافقون { وَلاَ مِنَ } إخوانكم { ٱلَّذِينَ كَفَرُواْ } مجاهرين مصرين على ما هم عليه بلا مبالاة إلى الدين والدعوة\n وبالجملة: { مَأْوَاكُمُ } أي: محل رجوعكم وقراركم اليوم جميعاً\n أي: { ٱلنَّارُ } المعدة المسعرة لكم أيها المنافقون بالكفر\n والمجاهرون به { هِيَ مَوْلاَكُمْ } أي: النار أولى بكم\n وأليق بحالكم { وَ } بالجملة: { بِئْسَ ٱلْمَصِيرُ } [الحديد: 15] والمرجع النار المعدة للكفار الأشرار",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فاليومَ لا يُؤخذ منكم فديةٌ } فداء { ولا من الذين كفروا } جهراً\n { مأواكم النارُ } أي: مرجعكم\n لا تبرحون عنها أبداً { هي مولاكم } أي: المتصرفة فيكم تصرُّف المولى في ملكه\n أو: هي أولى بكم\n وحقيقة مكانكم الذي يقال فيه هو أولى بكم\n أو: ناصركم\n على طريق:\nفيكون تهكُّماً بهم\n { وبئس المصيرُ } أي: النار\n الإشارة: يوم ترى المؤمنين والمؤمنات\n الكاملين في الإيمان\n الطالبين الوصول\n يسعى نورُهم\n وهو نور التوجُّه بين أيديهم وبأيمانهم\n فيهتدون إلى أنوار المواجهة\n وهي المشاهدة\n فيقال لهم: بُشراكم اليوم جنات المعارف\n تجري من تحتها أنهار العلوم\n خالدين فيها\n ذلك هو الفوز العظيم\n قال القشيري: قوله تعالى: { يسعى نورهم\n\n\n } الخ كما أنَّ لهم في العرصة هذا النور فاليومَ لهم نورٌ في قلوبهم وبواطنهم\n يمشون في نورهم\n ويهتدون به في جميع أحوالهم\n قال صلى الله عليه وسلم:\n \" المؤمن ينظر بنور الله \" \n\n وقال تعالى:\n[الزمر: 22]\n وربما سقط ذلك النورُ على مَنْ يَقْربُ إليهم\n وربما يقع من ذلك على القلوب\n فلا محالة لأوليائه هذه الخصوصية\n هـ\n قال الورتجبي: ونورُ الحق الذي ألبس العارف تخضع له الأكوان ومَن فيها\n ومثله لسهل\n فانظره مسْتوفٍ\n يوم يقول المنافقون والمنافقات\n وهم الذين اعتنوا بتزيين الظواهر\n وغفلوا عن البواطن\n فصارت خراباً من النور\n يقولون في الدنيا: انظُرونا والتفتوا إلينا\n نقتبس من نوركم\n قيل: ارجعوا وراءكم\n إلى دنياكم وحظوظكم\n فاتلمسوا نوراً\n تهكُّماً بهم\n فضُرب بينهم بسورٍ معنوي\n وهو خرق العوائد\n وتخريب الظواهر إذ لا يقدرون على ارتكابه\n له باب ليدخل معهم مَن أراد نورهم\n باطن ذلك السور فيه الرحمة\n وهي الراحة\n والطمأنينة\n والبسط\n وبهجة المعارف\n وظاهره الذي يلي العامة من قِبَلِه العذاب\n وهو ما هم فيه من الحرص\n والتعب\n والجزع\n والهلع\n والقبض\n ينادونهم: ألم نكن معكم في عالم الحس؟ وهو عالم الأشباح\n قالوا: بلى\n ولكنكم لم ترتقوا إلى عالم المعاني\n وهو عالم الأرواح\n الذي هو محل الراحة والهنا والسرور\n بل فَتنتم أنفسكم بأشغال الدنيا\n واشتغلتم بطلب حظوظها وجاهها\n ورئاستها وطيب مأكلها\n ومشربها وملبسها\n وتربصتم بأهل التوجه الدوائر\n أو الرجوع إلى ما أنتم فيه\n وارتبتم في وجود خصوصية التربية\n وغَرَّتكم الأماني: المطامع الكاذبة\n وأنكم تنالون الخصوصية بغير صحبة ولا مجاهدة\n وغرّكم طولُ الأمل والتسويف\n عن التوبة والتوجُّه\n وغرّك بحلمه الغرور\n فزيَّن لكم القعود والتخلُّف عن مقامات الرجال\n فاليوم\n أي: حين ظهرت مقامات الرجال في الدنيا والآخرة\n لا يؤخذ منكم فدية في التخلُّص من غم الحجاب\n ولا من الذين كفروا\n مأواكم نار القطيعة\n هي مولاكم ومنسحبة عليكم\n وبئس المصير\n\nثم وبَّخهم على التقعُّد عن النهوض إليه\n فقال: { أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوۤاْ أَن تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ ٱللَّهِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:57",
      "similarity": 0.5397750040981245
    },
    {
      "verse": "5:36",
      "similarity": 0.5301816798017541
    },
    {
      "verse": "13:18",
      "similarity": 0.5235789397719935
    },
    {
      "verse": "70:11",
      "similarity": 0.48012193124057523
    },
    {
      "verse": "39:47",
      "similarity": 0.4594178909969235
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/057015.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/057015.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/57:15.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}