{
  "chapter": "الحديد",
  "text": "فاليوم لا يؤخذ منكم فدية ولا من الذين كفروا۟ ماوىكم النار هى مولىكم وبئس المصير",
  "translations": [
    {
      "translation": "So no ransom will be accepted of you on this day, or of those who refused to believe. Hell will be your refuge and the only friend -- and how evil a destination!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So no ransom shall be accepted from you today, nor from those who disbelieved. You are destined for the Fire. That will be your guardian. And that indeed is a grievous destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So on this day no ransom will be accepted from you nor from the disbelievers. Your dwelling will be fire. It will be your friend and a terrible end\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“So this day no ransom is to be taken from you nor from the declared disbelievers; your destination is the fire; that is your companion; and what a wretched outcome!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, this Day no ransom shall be taken from you, nor of those who disbelieved. Your abode is the Fire. That is your protector, and worst indeed is that destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So today ransom shall not be accepted from you nor from those who disbelieved; your abode is the fire; it is your friend and evil is the resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore today no ransom shall be taken from you, neither from those who disbelieved. Your refuge is the Fire, that is your master -- an evil homecoming!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So this day no ransom can be taken from you nor from those who disbelieved. Your home is the Fire; that is your patron, and a hapless journey's end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So this Day no ransom can be taken from you nor from those who were bent on denying the truth. Your home is the fire; that is your companion, and a hapless journey's end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To-day therefore no ransom will be accepted of you nor of those who openly disbelieved; your abode is the Fire; that is your companion; a hapless destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So today no ransom shall be taken from you or the faithless. The Fire will be your abode: it is your [ultimate] refuge and an evil destination.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Day shall no ransom be accepted of you, nor of those who rejected Allah.\" Your abode is the Fire: that is the proper place to claim you: and an evil refuge it is!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So this Day no ransom shall be taken from you (hypocrites), nor of those who disbelieved, (in the Oneness of Allah Islamic Monotheism). Your abode is the Fire, that is the proper place for you, and worst indeed is that destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Today no ransom shall be accepted from you or from the unbelievers. Your shelter is the Fire, that is your sponsor, the worst arrival'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Therefore, today no ransom will be accepted from you, nor from those who disbelieved. The Fire is your refuge. It is your companion—what an evil fate!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So today no ransom will be taken from you or from those who disbelieved. Your refuge is the Fire. It is most worthy of you, and wretched is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:15] So on this day no ransom will be taken from you (read tu’khadhu or yu’khadhu) nor from those who disbelieved. Your abode will be the Fire: it will be your guardian, it is [the place truly] deserving of you, and an evil destination!’, it is.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So this day) which is the Day of Judgement (no ransom can be taken from you) group of hypocrites (nor from those who disbelieved) in Muhammad (pbuh) and the Qur'an. (Your home is the Fire) your destination is the Fire; (that is your patron) it has better right over you, (and a hapless journey's end) they will come to: their companions being the satans, their neighbours the disbelievers, their food the Zaqqum, their drink boiling water, their clothes pieces of fire and their visitors snakes and scorpions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { هِيَ مَوْلاَكُمْ } معناه أَولى بكُمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما وقع ما وقع { فَٱلْيَوْمَ } الذي تبلى السرائر فيه { لاَ يُؤْخَذُ مِنكُمْ } أيها المنافقون المخادعون { فِدْيَةٌ } تفدون بها؛ لتخليصكم من العذاب لا منكم أيها المنافقون { وَلاَ مِنَ } إخوانكم { ٱلَّذِينَ كَفَرُواْ } مجاهرين مصرين على ما هم عليه بلا مبالاة إلى الدين والدعوة، وبالجملة: { مَأْوَاكُمُ } أي: محل رجوعكم وقراركم اليوم جميعاً؛ أي: { ٱلنَّارُ } المعدة المسعرة لكم أيها المنافقون بالكفر، والمجاهرون به { هِيَ مَوْلاَكُمْ } أي: النار أولى بكم، وأليق بحالكم { وَ } بالجملة: { بِئْسَ ٱلْمَصِيرُ } [الحديد: 15] والمرجع النار المعدة للكفار الأشرار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فاليومَ لا يُؤخذ منكم فديةٌ } فداء { ولا من الذين كفروا } جهراً، { مأواكم النارُ } أي: مرجعكم، لا تبرحون عنها أبداً { هي مولاكم } أي: المتصرفة فيكم تصرُّف المولى في ملكه، أو: هي أولى بكم، وحقيقة مكانكم الذي يقال فيه هو أولى بكم، أو: ناصركم، على طريق:\n\nفيكون تهكُّماً بهم، { وبئس المصيرُ } أي: النار\n الإشارة: يوم ترى المؤمنين والمؤمنات، الكاملين في الإيمان، الطالبين الوصول، يسعى نورُهم، وهو نور التوجُّه بين أيديهم وبأيمانهم، فيهتدون إلى أنوار المواجهة، وهي المشاهدة، فيقال لهم: بُشراكم اليوم جنات المعارف، تجري من تحتها أنهار العلوم، خالدين فيها، ذلك هو الفوز العظيم\n قال القشيري: قوله تعالى: { يسعى نورهم\n\n\n } الخ كما أنَّ لهم في العرصة هذا النور فاليومَ لهم نورٌ في قلوبهم وبواطنهم، يمشون في نورهم، ويهتدون به في جميع أحوالهم، قال صلى الله عليه وسلم:\n\n \" المؤمن ينظر بنور الله \" \n\n، وقال تعالى:\n\n[الزمر: 22]\n وربما سقط ذلك النورُ على مَنْ يَقْربُ إليهم، وربما يقع من ذلك على القلوب، فلا محالة لأوليائه هذه الخصوصية\n هـ\n قال الورتجبي: ونورُ الحق الذي ألبس العارف تخضع له الأكوان ومَن فيها، ومثله لسهل\n فانظره مسْتوفٍ\n يوم يقول المنافقون والمنافقات، وهم الذين اعتنوا بتزيين الظواهر، وغفلوا عن البواطن، فصارت خراباً من النور، يقولون في الدنيا: انظُرونا والتفتوا إلينا، نقتبس من نوركم، قيل: ارجعوا وراءكم، إلى دنياكم وحظوظكم، فاتلمسوا نوراً، تهكُّماً بهم، فضُرب بينهم بسورٍ معنوي، وهو خرق العوائد، وتخريب الظواهر إذ لا يقدرون على ارتكابه، له باب ليدخل معهم مَن أراد نورهم، باطن ذلك السور فيه الرحمة، وهي الراحة، والطمأنينة، والبسط، وبهجة المعارف، وظاهره الذي يلي العامة من قِبَلِه العذاب، وهو ما هم فيه من الحرص، والتعب، والجزع، والهلع، والقبض\n ينادونهم: ألم نكن معكم في عالم الحس؟ وهو عالم الأشباح، قالوا: بلى، ولكنكم لم ترتقوا إلى عالم المعاني، وهو عالم الأرواح، الذي هو محل الراحة والهنا والسرور، بل فَتنتم أنفسكم بأشغال الدنيا، واشتغلتم بطلب حظوظها وجاهها، ورئاستها وطيب مأكلها، ومشربها وملبسها، وتربصتم بأهل التوجه الدوائر، أو الرجوع إلى ما أنتم فيه، وارتبتم في وجود خصوصية التربية، وغَرَّتكم الأماني: المطامع الكاذبة، وأنكم تنالون الخصوصية بغير صحبة ولا مجاهدة، وغرّكم طولُ الأمل والتسويف، عن التوبة والتوجُّه، وغرّك بحلمه الغرور، فزيَّن لكم القعود والتخلُّف عن مقامات الرجال، فاليوم، أي: حين ظهرت مقامات الرجال في الدنيا والآخرة، لا يؤخذ منكم فدية في التخلُّص من غم الحجاب، ولا من الذين كفروا، مأواكم نار القطيعة، هي مولاكم ومنسحبة عليكم، وبئس المصير\n\n\nثم وبَّخهم على التقعُّد عن النهوض إليه، فقال: { أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوۤاْ أَن تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ ٱللَّهِ }\n\n",
      "translations": []
    }
  ]
}