{
  "chapter": "الحديد",
  "text": "الم يان للذين ءامنوا۟ ان تخشع قلوبهم لذكر الله وما نزل من الحق ولا يكونوا۟ كالذين اوتوا۟ الكتب من قبل فطال عليهم الامد فقست قلوبهم وكثير منهم فسقون",
  "translations": [
    {
      "translation": "Has the time not arrived for the hearts of those who have iman to yield to the remembrance of Allah and to the truth He has sent down, so they are not like those who were given the Book before for whom the time seemed over long so that their hearts became hard? Many of them are deviators.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the moment not yet come when the hearts of believers should be moved by the thought of God and the truth that has been sent down, so that they should not be like those who received the Book before them but whose hearts were hardened after a lapse of time, and many of them turned disobedient?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is the time not come that the hearts of the believers should be humbled to Allah's remembrance and to the Truth that He has revealed, and that they should not be like those who were vouchsafed the Book and then a long time elapsed so that their hearts were hardened? A great many of them are now evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not time for the hearts of the believers to become humbled by the remembrance of God and by the Truth which has been revealed so that they will not be like the followers of the Bible who lived before them and whose hearts have become hard like stone through the long years. Many of them are evil doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the time come for the believers to surrender their hearts to Allah’s remembrance and to this truth that has come down? And do not be like those who were earlier given the Book(s) and when a long term passed over them, their hearts became hardened; and many of them are sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the time yet come for the believers that their hearts should be humble for the remembrance of Allah And that which has been revealed of the truth, lest they become as those who received the Scripture before, and the term was prolonged for them and so their hearts were hardened And many of them were rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the time yet come for those who believe that their hearts should be humble for the remembrance of Allah and what has come down of the truth? And that they should not be like those who were given the Book before, but the time became prolonged to them, so their hearts hardened, and most of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not time that the hearts of those who believe should be humbled to the Remembrance of God and the Truth which He has sent down, and that they should not be as those to whom the Book was given aforetime, and the term seemed over long to them, so that their hearts have become hard, and many of them are ungodly?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not the time ripe for the hearts of those who believe to submit to Allah's reminder and to the truth which is revealed, that they become not as those who received the scripture of old but the term was prolonged for them and so their hearts were hardened, and many of them are evil-livers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the time not come for the faithful when their hearts in all humility should engage in the remembrance of God and of the revelation of truth, so that they should not become like those who were given the Book before them, whose hearts with the passage of time became hardened and many of whom were disobedient?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not the time yet come unto those who believe, that their hearts should humble themselves to the admonition of Allah and to the truth which hath come down, and that they become not as those who were vouchsafed the Book aforetime, and the time become extended unto them, and so their hearts became hard? And many of them are transgressors\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not time yet for those who have faith that their hearts should be humbled for Allah’s remembrance and toward the truth which has come down [to them], and to be not like those who were given the Book before? Time took its toll on them and so their hearts were hardened, and many of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the Time arrived for the Believers that their hearts in all humility should engage in the remembrance of Allah and of the Truth which has been revealed (to them), and that they should not become like those to whom was given Revelation aforetime, but long ages passed over them and their hearts grew hard? For many among them are rebellious transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the time come for the hearts of those who believe (in the Oneness of Allah - Islamic Monotheism) to be affected by Allah's Reminder (this Quran), and that which has been revealed of the truth, lest they become as those who received the Scripture [the Taurat (Torah) and the Injeel (Gospel)] before (i.e. Jews and Christians), and the term was prolonged for them and so their hearts were hardened? And many of them were Fasiqun (rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not time that the hearts of the believers be humbled to the Remembrance of Allah and the truth which He has sent down? They should not be like those who were given the Book before this, whose time became very long so that their hearts became hardened. Many of them were impious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not time for those who believe to surrender their hearts to the remembrance of God, and to the truth that has come down, and not be like those who were given the Book previously, but time became prolonged for them, so their hearts hardened, and many of them are sinners?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the time not come for those who have believed that their hearts should become humbly submissive at the remembrance of Allah and what has come down of the truth? And let them not be like those who were given the Scripture before, and a long period passed over them, so their hearts hardened; and many of them are defiantly disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:16] Is it not time for those who believe — this was revealed concerning the matter of the Companions [of the Prophet] who had been overindulging in jest, that their hearts should be humbled to the remembrance of God and [to] what has been revealed (read as nuzzila; or read nazala, ‘[what] has come down’) of the truth, the Qur’ān, and that they should not be (lā yakūnū is a supplement to takhsha‘a, ‘be humbled’) like those who were given the Scripture before?, namely, the Jews and the Christians. For the stretch of time, the interval [extending] from them [back] to [the time of the sending of the last of] their prophets, was too long for them and so their hearts became hardened, unyielding to the remembrance of God, and many of them are immoral.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah mentioned the state of their hearts when they were in the life of the world, saying: (Is not the time ripe for the hearts of those who believe) outwardly (to submit) to soften, abase itself and be sincere (to Allah's reminder) to Allah's promises and threats; it is also said this means: to Allah's divine Oneness (and to the Truth which is revealed) to the commands and prohibitions, the lawful and unlawful contained in the Qur'an, (that they become not as those who received the Scripture) that they became like those who were given the knowledge of the Torah (of old) before the advent of Muhammad (pbuh) and so they are the folk of the Torah (but the term was prolonged for them and so their hearts were hardened) regarding faith; these are the ones who went against the religion of Moses, (and many of them) of the folk of the Torah (are evil-livers) disbelievers who do not believe in Allah as it is in Allah's foreknowledge.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوۤاْ } معناه ألم يدركْ\n\n\n\n\nوقوله تعالى: { فَطَالَ عَلَيْهِمُ ٱلأَمَدُ } معناه الغَايةُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Has it not been} for those who believed, means, \"Have they not understood?\"\n\n\nAnd His saying, {So the period [of waiting] for them is [that of] the duration.} [Means] the end.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على سبيل الحث والترغيب\n والتمنن والتشويق: { أَلَمْ يَأْنِ } أي: لم يقرب الوقت\n ولم يحضر الأوان { لِلَّذِينَ آمَنُوۤاْ } بوحدة الحق\n وبكمالات أسمائه وصفاته { أَن تَخْشَعَ } وتخضع وتلين وترق { قُلُوبُهُمْ } التي هي وعاء الإيمان والعرفان { لِذِكْرِ ٱللَّهِ } المستجمع لعموم الأسماء والصفات\n المسقط لجميع الإضافات { وَمَا نَزَلَ } سبحانه في كتابه المبين لطريق توحيده { مِنَ ٱلْحَقِّ } الحقيق بالامتثال والاتباع من الأوامر والنواهي الموردة فيه\n المتعلقة لتهذيب الظاهر والباطن\n والرموز الإشارات المصفية للسر عن التفات إلى ما سوى الحق\n\n\n{ وَ } بالجملة: { لاَ يَكُونُواْ } - التفسير جرى على رواية رويس - (وَلاَ تَكُوْنُوْا) أيها المؤمنون في الإعراض عن كتاب الله\n والانصراف عما فيه من الحكم والمصالح { كَٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ مِن قَبْلُ } وهم اليهود والنصارى { فَطَالَ عَلَيْهِمُ ٱلأَمَدُ } أي: مضى الزمان بينهم وبين أنبيائهم { فَقَسَتْ قُلُوبُهُمْ } عن الإيمان\n مع أن الكتب بين أظهرهم { وَكَثِيرٌ مِّنْهُمْ فَاسِقُونَ } [الحديد: 16] خارجون عن دينهم\n تاركون ما في كتابهم من الأحكامم من فرط قساوتهم وغفلتهم\n فلكم ألاَّ تكونوا أمثالهم مع نبيكم ودينكم وكتابكم\n\n\n{ ٱعْلَمُوۤاْ } أيها المؤمنون الموحدون { أَنَّ ٱللَّهَ } المطلع على قابليات عباده واستعداداتهم الفطرية { يُحْيِـي ٱلأَرْضَ } أي: أراضي استعداداتكم بماء المعارف الحقائق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ألم يأن }: مجزوم بحذف الياء، من: أَنَى يأنِي، كمَضَى يمضي: إذا حان وقرب\n و { أن تخشع }: فاعل\n و { لا يكونوا }: عطف على \" تخشع \" ، وقرأ رويس عن يعقوب بالخطاب، فيكون التفاتاً للاعتناء بالتحذير، أو نهياً\n يقول الحق جلّ جلاله: { ألم يَأْنِ } ألم يحضر، أو يقرب { للذين آمنوا أن تخشع قُلوبُهم لذكر الله } أو: ألم يجيء وقت خشوع قلوب المؤمنين لذكر الله تعالى، وتطمئن به، ويسارعون إلى طاعته، بالامثال لأوامره والاجتناب لنواهيه\n قيل: كانوا مجدبين بمكة، فلما هاجروا وأصابوا الرزق والنعمة، ففتروا عما كانوا عليه، فنزلت\n وبه تعلم أنَّ الشدة هي عين الرخاء، وأنَّ الجلال هو الجمال، وأين هو حبيبك ثَمَّ هو عدوك\n وعن ابن مسعود رضي الله عنه: ما كان بين إسلامنا وبين أن عوتبنا بهذه الآية إلا أربعُ سنين\n وعن ابن عباس رضي الله عنه: استبطأ قلوب المؤمنين فعاتبهم على رأس ثلاث عشرة سنة من نزول القرآن\n وعن أبي بكر رضي الله عنه: إنَّ هذه الآية قُرئت بين يديه، وعنده قوم من أهل اليمامة، فبكوا بكاءً شديداً، فنظر إليهم فقال: \" هكذا كنا حتى قست قلوبنا \"\n قلت: مراده بالقسوة: التصلُّب والتثبُّت للورادات، وذلك أنَّ القلب في البدايات يكون رطباً مغلوباً للأحوال والواردات، يتأثر بأدنى شيء، فإذا استمر مع الأنوار والواردات استأنس بها وتصلّب واشتد، فلا تؤثر فيه الواردات، فيكون مالكاً للأحوال، لا مملوكاً، وهذا أمر ذَوقْي، يرتفع البكاء عن العارفين، ويظهر على الصالحين والطالبين\n وهذه الآية أيضاً كانت سبب توبة الفُضيل، كان صاعداً لجارية، فسمع قارئاً يقرأها، فقال: قد آن الخشوع والرجوع، فتاب\n والمراد بذكر الله ذكر اسمه تعالى على أي لفظ كان، كقوله:\n\n[الأنفال: 2] الآية، أو: القرآن، فيكون قوله: { وما نَزَلَ من الحق } عطف تفسير، أو لتغاير العنوانين، فإنه ذِكْرٌ وموعظة، كما أنه حقٌّ نازل من السماء\n والمراد بالخشوع: الإنابة والخضوع، ومتابعة الأمر والنهي\n { ولا يكونوا كالذين أُوتوا الكتاب من قبلُ } أي: اليهود والنصارى، { فطال عليهم الأمدُ } الزمن بينهم وبين أنبيائهم، { فقست قلوبُهم } باتباع الشهوات، وذلك أنَّ بني إسرائيل كان الحقُّ يحول بينهم وبين شهواتهم، وإذا سمِعوا التوراة خشعوا له، ورقَّت قلوبهم، فلما طال عليهم الزمان غلب عليهم الجفاء والقسوة، واختلفوا\n قال ابن مسعود: إن بني إسرائيل لمّا طال عليهم الأمد قست قلوبُهم، فاخترعوا كتاباً من عند أنفسهم، استحلته أنفُسِهم، وكان الحق يحول بينهم وبين كثيرٍ من شهواتهم، حتى نبذوا كتابَ الله وراء ظهورهم، كأنهم لا يعلمون، ثم قالوا: اعْرِضوا هذا الكتاب على بني إسرائيل، فإن تابعوكم فاتركوهم، وإلاَّ فاقتلوهم\n\n\nثم اتفقوا أن يرسلوه إلى عالمٍ من علمائهم، [وقالوا]: إن هو تابعنا لم يخالفنا أحد، وإلاَّ قتلتموه، فلا يختلف علينا بعده أحد، فأرسلوا إليه، فكتب كتاب الله في ورقة، وجعلها في قرن، وعلقها في عنقه، ثم لبس عليه ثيابه، وأتاهم، فعرضوا عليه كتابهم، وقالوا: أتؤمن بهذا؟ فأومئ إلى صدره، وقال: آمنتُ بهذا - يعني المعلَّق على صدره - فافترقت بنو إسرائيل على بضع وسبعين ملة\n هـ\n قال تعالى: { وكثيرُ منهم فاسقون } خارجون عن دينهم، رافضون لما في الكتابين، أي: وقليل منهم مؤمنون، فنهى الله تعالى المؤمنين أن يكونوا مثلهم\n وقال ابن عطية: الإشارة بقوله: { أوتوا الكتاب } إلى بني إسرائيل المعاصرين لموسى عليه السلام، ولذلك قال: { من قبل } ، وإنما شبّه أهل عصر نبي بأهل عصر نبي، وقوله: { فطال عليهم الأمدُ } قيل: أمد الحياة، وقيل: أمد انتظار القيامة\n هـ\n وقال مقاتل: { الأمد } هنا: الأمل، أي: لما طالت آمالهم لا جرم قست قلوبهم\n هـ\n قيل: إن الصحابة ملُّوا ملالة، فقالوا: حدِّثنا، فنزل:\n\n[يوسف: 3]، وبعد مدة قالوا: لو ذَكَّرتَنا، فنزلت هذه السورة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "72:25",
      "similarity": 0.4622788360958797
    },
    {
      "verse": "18:12",
      "similarity": 0.40723065285440796
    },
    {
      "verse": "3:30",
      "similarity": 0.39474423570841777
    },
    {
      "verse": "22:53",
      "similarity": 0.32398972165699563
    },
    {
      "verse": "6:43",
      "similarity": 0.30403216506532316
    }
  ]
}