{
  "chapter": "الحديد",
  "text": "ان المصدقين والمصدقت واقرضوا۟ الله قرضا حسنا يضعف لهم ولهم اجر كريم",
  "translations": [
    {
      "translation": "The men and women who give sadaqa and make a good loan to Allah will have it increased for them and they will have a generous reward.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the men and women who spend in charity and give a goodly loan to God, will have it doubled for them and will receive a generous reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who give alms -- be they men or women, -- and give Allah a beautiful loan shall be repaid after increasing it many times; and theirs shall be a generous reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The charitable men and women who give a virtuous loan to God will receive double from Him in addition to their honorable reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the charity-giving men and women, and those who lend an excellent loan to Allah – for them is double, and for them is an honourable reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who give Sadaqat, men and women, and lend Allah handsome loan, it shall be increased manifold (to their credit), and theirs shall be an honorable good reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely (as for) the charitable men and the charitable women and (those who) set apart for Allah a goodly portion, it shall be doubled for them and they shall have a noble reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those, the men and the women, who make freewill offerings and have lent to God a good loan, it shall be multiplied for them, and theirs shall be a generous wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who give alms, both men and women, and lend unto Allah a goodly loan, it will be doubled for them, and theirs will be a rich reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alms-givers, both men and women, who give a generous loan to God, shall have it multiplied and shall have an honourable reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the alms-giving men and alms-giving women--and they are lending unto Allah a goodly lone--it shall be multiplied for them and theirs shall be a hire honourable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the charitable men and women and those who lend Allah a good loan—it shall be multiplied for them, and there will be a noble reward for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who give in Charity, men and women, and loan to Allah a Beautiful Loan, it shall be increased manifold (to their credit), and they shall have (besides) a liberal reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who give Sadaqat (i.e. Zakat and alms, etc.), men and women, and lend to Allah a goodly loan, it shall be increased manifold (to their credit), and theirs shall be an honourable good reward (i.e. Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who give in charity, be they men or women, and those who lend a good loan to Allah, shall be repaid in multiples. They shall receive agenerous wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The charitable men and charitable women, who have loaned God a loan of righteousness—it will be multiplied for them, and for them is a generous reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the men who practice charity and the women who practice charity and [they who] have loaned Allah a goodly loan - it will be multiplied for them, and they will have a noble reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:18] Indeed men who give voluntary alms (al-mussaddiqīna, derives from the [infinitive] al-tasadduq, ‘to give voluntary alms’; the tā’ [of the original mutasaddiqīna] has been assimilated with the sād) and women who give voluntary alms (a variant reading for both has the softened form [with a single sād, musaddiqīna and musaddiqāti], which derives from al-tasdīq, ‘to affirm the truth of’, ‘to believe in’) and [those of them] who have lent God a goodly loan (this refers back to both the men and women with [the masculine plural of] predominance; the supplementing of a verb [aqradū, ‘who lent’] to a noun [of action, al-mussaddiqāt] at [the point of] the relative clause of the al-, is because in that position it [the noun] functions as a verb; the mention of the ‘loan’ together with its qualification [‘goodly’] after [the mention of] ‘the giving of voluntary alms’ is intended to define it), it will be multiplied (yudā‘afu, is also read as yuda‘‘afu), namely, their loan [will multiplied], for them and they will have a generous reward.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّ الْمُصَّدِّقِينَ وَالْمُصَّدِّقَاتِ وَأَقْرَضُوا اللَّهَ قَرْضًا حَسَنًا يُضَاعَفُ لَهُمْ وَلَهُمْ أَجْرٌ كَرِيمٌ (18)يشبه أن تكون هذه الآية من المدني وأن تكون متصلة المعنى بقوله تعالى : { من ذا الذي يقرض الله قرضاً حسناً فيضاعفه له وله أجر كريم } \\[ الحديد : 11 \\] وأن آية { ألم يأن للذين آمنوا } \\[ الحديد : 16 \\] وما بعدها معترض . وقد تخلل المكي والمدني كل مع الآخر في هذه السورة ألاَ ترى أن ألفاظ الآيتين متماثلة إذ أريد أن يعاد ما سبق من التحريض على الإِنفاق فيُؤتى به في صورة الصلة التي عُرف بها الممتثلون لذلك التحريض .وعطف { والمصدقات } كما تقدم في قوله : { يوم ترى المؤمنين والمؤمنات } \\[ الحديد : 12 \\] ، ولأن الشُحَّ يكثر في النساء كما دلت عليه أشعار العرب .وقرأ الجمهور { والمصّدقين } بتشديد الصاد على أن أصله المتصدقين فأدغمت التاء في الصاد بعد قَلْبِهَا صاداً لقرب مخرجيهما تطلباً لخفة الإِدغام ، فقوله : { واقرضوا الله قرضاً حسناً } من عطف المرادف في المعنى لما في المعطوف من تشبيه فِعلهم بقرض لله تنويهاً بالصدقات .وقرأه ابن كثير وأبو بكر عن عاصم بتخفيف الصاد على أنه من التصديق ، أي الذين صدَّقوا الرسول صلى الله عليه وسلم أي آمنوا وامتثلوا أمره فأقرضوا الله قرضاً حسناً .وقرأ الجمهور { يضاعف لهم } بألف بعد الضاد . وقرأه ابن كثير وابن عامر وأبو جعفر ويعقوب { يضعّف } بدون ألف وبتشديد العين .وعطف { واقرضوا } وهو جملة على { المصدقين } وهو مفرد لأن المفرد في حكم الفعل حيث كانت اللام في معنى الموصول فقوة الكلام : إن الذين اصَّدَّقوا واللائي تصدقْنَ وأقرضوا ، على التغليب ولا فَصْلَ بأجنبي على أن الفصل لا يمنع إذا لم يفسد المعنى .ووجه العدول عن تماثل الصلتين فلم يقل : إن المصدقين والمقرضين ، هو تصوير معنى كون التصدق إقراضاً لله .وتقدم معنى { يضاعف لهم ولهم أجر كريم } في قوله : { من ذا الذي يقرض الله قرضاً حسناً فيضاعفه له } \\[ الحديد : 11 \\] الآية .\n\n",
      "translations": [
        {
          "translation": "(Lo! those who give alms, both men and women) because of their faith, (and lend unto Allah) through giving alms (a goodly loan) sincerely from their heart in seeking only Allah's pleasure, (it will be doubled for them) it will be accepted from them and increased from seven folds to 70 and up to 700 folds and two million folds, and even more as Allah wills, (and theirs will be a rich reward) a goodly reward in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّ المصدّقين والمصدّقات } من المؤمنين بالغيب في مقام النفس لقوله: { ولهم أجر كريم * والذين آمنوا بالله ورسله } من أهل الإيقان في مقام القلب لقوله: { لهم أجرُهُم } أي: من جنة النفس ونورهم من جنة القلب بتجلي الصفات { أولئك هم الصدّيقون } بقوة اليقين { والشهداء } أهل الحضور والمراقبة والذين حجبوا عن الذات والصفات في مقابلتهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والتقرب بها نحو المولى { إِنَّ ٱلْمُصَّدِّقِينَ } أي: المتصدقين { وَٱلْمُصَّدِّقَاتِ } أي: المتصدقات { وَ } هم الذين { أَقْرَضُواْ ٱللَّهَ قَرْضاً حَسَناً } خالصاً عن شوب المن والأذى\n طالباً لمرضاته سبحانه { يُضَاعَفُ لَهُمْ } صدقاتهم في النشأة الأولى { وَلَهُمْ أَجْرٌ كَرِيمٌ } [الحديد: 18] في النشأة الأخرى\n\n\n{ وَ } بالجملة: { ٱلَّذِينَ آمَنُواْ بِٱللَّهِ وَرُسُلِهِ } وأخلصوا في إيمانهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { المصدقين } مَن قرأ بالتشديد فيهما فاسم فاعل\n من: تصدّق\n أدغمت التاء في الصاد\n ومَن قرأ بتخفيف الصاد فاسم فاعل صدّق\n و { أقرضوا }: عطف على الصلة\n أي: إن الذين تصدّقوا وأقرضوا\n يقول الحق جلّ جلاله: { إِنَّ المصدِّقين والمصدِّقات } أي: المتصدقين بأموالهم والمتصدقات أو: المصدقين بالله ورسوله والمصدقات\n { وأقرضوا اللّهَ قرضاً حسناً } وهو أن تتصدّق من كسبٍ طيبٍ\n بقلب طيب\n { يُضاعف لهم } بأضعاف كثيرة إلى سبعمائة\n { ولهم أجرٌ كريمٌ } الجنة وما فيها\n وقد ورد في الصدقات أحاديث\n منها: أنها تدفع سبعين باباً من السوء\n وتزيد البركة في العمر\n رُوي أن شابّاً وشابة دخلا على سليمان عليه السلام فعقد لهما النكاح\n وخرجا من عنده مسرورين\n وحضر ملك الموت\n فقال: لا تعجب من سرورهما\n فقد أُمرت أن أقبض روح هذا الشاب بعد خمسة أيام\n فجعل سليمانُ يراعي حالَ الشاب\n حتى ذهبت ستة أيام\n ثم خمسة أشهر\n فعجب من ذلك\n فدخل عليه ملك الموت\n فسأله عن ذلك\n فقال: إني أُمرت أن أقبض روحه كما ذكرتُ لك\n فلما خرج من عندك لقيه سائل\n فدفع له درهماً\n فدعا له بالبقاء\n فأُمرت بتأخير الأمر عنه ببركة صدقته\n هـ\n وانظر عند قوله:\n[الرعد: 38]\n ومثله قضية الرجل الذي آذى جيرانَه\n فدعا موسى عليه السلام عليه\n ثم تصدَّق صبيحة اليوم برغيف\n فنزل الثعبان\n فلقيته الصدقة فسقط ميتاً على حزمة حطبه\n { والذين آمنوا بالله ورسله أولئك هم الصدّيقون } المبالغون في التصديق\n أو الصدق\n وهو أولى لأنّ وزن المبالغة لا يساغ من غير الثلاثي في الأكثر إلا نادراً\n كمسّيك من أمسك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "57:11",
      "similarity": 0.9751028039092937
    },
    {
      "verse": "64:17",
      "similarity": 0.7606424493874638
    },
    {
      "verse": "2:245",
      "similarity": 0.5828329608582559
    },
    {
      "verse": "73:20",
      "similarity": 0.32334814705716713
    },
    {
      "verse": "33:44",
      "similarity": 0.22559511411911545
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/057018.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/057018.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/57:18.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}