{
  "chapter": "الحديد",
  "text": "ثم قفينا على ءاثرهم برسلنا وقفينا بعيسى ابن مريم وءاتينه الانجيل وجعلنا فى قلوب الذين اتبعوه رافة ورحمة ورهبانية ابتدعوها ما كتبنها عليهم الا ابتغاء رضون الله فما رعوها حق رعايتها فـاتينا الذين ءامنوا۟ منهم اجرهم وكثير منهم فسقون",
  "translations": [
    {
      "translation": "Then We sent Our Messengers following in their footsteps and sent 'Isa son of Maryam after them, giving him the Gospel. We put compassion and mercy in the hearts of those who followed him. They invented they did not observe it as it should have been observed. To those of them who had iman We gave their reward but many of them are deviators.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then in their train We sent Our apostles, and succeeding them Jesus, son of Mary, and gave him the Gospel, and put into the hearts of his followers compassion and kindness. But they created monasticism which had not been prescribed for them by Us except for seeking the pleasure of God; yet they did not observe it as it should have been rightly observed. So We gave those among them who were believers their reward; but most of them are disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their wake, We sent a succession of Our Messengers, and raised Jesus, son of Mary, after all of them, and bestowed upon him the Evangel, and We set tenderness and mercy in the hearts of those that followed him. As for monasticism, it is they who invented it; We did not prescribe it for them. They themselves invented it in pursuit of Allah's good pleasure, and then they did not observe it as it ought to have been observed. So We gave their reward to those of them that believed. But many of them are wicked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent Our other Messengers to follow their traditions. After them We sent Jesus, the son of Mary, to whom We gave the Gospel. In the hearts of his followers We placed compassion and mercy. We did not command them to lead the monastic life. This was their own method of seeking the pleasure of God. Despite this intention, they did not properly observe it (the monastic life). To the believers among them, We gave their reward but many of them are evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We then sent Our other Noble Messengers after them following their footsteps, and after them We sent Eisa, the son of Maryam, and bestowed the Injeel to him; and We instilled compassion and mercy in the hearts of his followers; and they invented monasticism which We had not ordained upon them only to seek Allah’s pleasure, then did not properly abide by it as it should have been rightfully abided; We therefore gave the believers among them their reward; and many of them are sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, We sent after them Our Messengers, and We sent `Isa the son of Maryam, and gave him the Injil. And We ordained in the hearts of those who followed him, compassion and mercy. But the monasticism which they invented for themselves, We did not prescribe for them, but (they sought it) only to please Allah therewith, but that they did not observe it with the right observance. So, We gave those among them who believed, their (due) reward; but many of them are rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We made Our apostles to follow in their footsteps, and We sent Isa son of Marium afterwards, and We gave him the Injeel, and We put in the hearts of those who followed him kindness and mercy; and (as for) monkery, they innovated it-- We did not prescribe it to them-- only to seek Allah's pleasure, but they did not observe it with its due observance; so We gave to those of them who believed their reward, and most of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent, following in their footsteps, Our Messengers; and We sent, following, Jesus son of Mary, and gave unto him the Gospel. And We set in the hearts of those who followed him tenderness and mercy. And monasticism they invented -- We did not prescribe it for them -- only seeking the good pleasure of God; but they observed it not as it should be observed. So We gave those of them who believed their wage; and many of them are ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We caused Our messengers to follow in their footsteps; and We caused Jesus, son of Mary, to follow, and gave him the Gospel, and placed compassion and mercy in the hearts of those who followed him. But monasticism they invented - We ordained it not for them - only seeking Allah's pleasure, and they observed it not with right observance. So We give those of them who believe their reward, but many of them are evil-livers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, in their wake, We followed them up with [others of] Our messengers and after them Jesus, son of Mary. We gave him the Gospel and imbued the hearts of those who followed him with compassion and mercy. But We did not prescribe monasticism for them: that was their own innovation by which they sought to please God. But then, they did not observe it in the way that it should have been observed. So We rewarded only those who were truly faithful, for many of them were disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter in their footsteps We caused Our apostles to follow, and We caused lsa, son Of Maryam, to follow them, and We vouchsafed Unto him the Injil, and We placed In the hearts of those who followed him tenderness and mercy. And asceticism! they innovated it- We prescribed it not for them Only seeking Allah's pleasure yet they tended it not with tendence due thereto. So We vouchsafed Unto such of them as believed their hire, and many of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We followed them up with Our apostles and We followed [them] with Jesus son of Mary, and We gave him the Evangel, and We put kindness and mercy into the hearts of those who followed him. But as for monasticism, they innovated it—We had not prescribed it for them—only seeking Allah’s pleasure. Yet they did not observe it with due observance. So We gave to the faithful among them their [due] reward, but many of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, in their wake, We followed them up with (others of) Our messengers: We sent after them Jesus the son of Mary, and bestowed on him the Gospel; and We ordained in the hearts of those who followed him Compassion and Mercy. But the Monasticism which they invented for themselves, We did not prescribe for them: (We commanded) only the seeking for the Good Pleasure of Allah; but that they did not foster as they should have done. Yet We bestowed, on those among them who believed, their (due) reward, but many of them are rebellious transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, We sent after them, Our Messengers, and We sent 'Iesa (Jesus) - son of Maryam (Mary), and gave him the Injeel (Gospel). And We ordained in the hearts of those who followed him, compassion and mercy. But the Monasticism which they invented for themselves, We did not prescribe for them, but (they sought it) only to please Allah therewith, but that they did not observe it with the right observance. So We gave those among them who believed, their (due) reward, but many of them are Fasiqun (rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Following them We sent Our (other) Messengers, and We sent following in their footsteps, (Prophet) Jesus, the son of Mary and gave him the Gospel, and put tenderness and mercy in the hearts of his followers. As for monasticism, they invented it thereby seeking the pleasure of Allah. We did not write it for them, and they did not observe it as it should be observed. We gave to those of them who believed their wage, but many of them are impious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent in their wake Our messengers, and followed up with Jesus son of Mary, and We gave him the Gospel, and instilled in the hearts of those who followed him compassion and mercy. But as for the monasticism which they invented—We did not ordain it for them—only to seek God’s approval. But they did not observe it with its due observance. So We gave those of them who believed their reward, but many of them are sinful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent following their footsteps Our messengers and followed [them] with Jesus, the son of Mary, and gave him the Gospel. And We placed in the hearts of those who followed him compassion and mercy and monasticism, which they innovated; We did not prescribe it for them except [that they did so] seeking the approval of Allah. But they did not observe it with due observance. So We gave the ones who believed among them their reward, but many of them are defiantly disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:27] Then We sent to follow in their footsteps Our messengers, and We sent to follow, Jesus son of Mary, and We gave him the Gospel, and We placed in the hearts of those who followed him kindness and mercy. But [as for] monasticism, namely, abstention from women and seclusion in monasteries, they invented it, [an innovation] on their part — We had not prescribed it for them, We did not enjoin them to it; but they took it on — only seeking God’s beatitude. Yet they did not observe it with due observance, for many of them abandoned it and rejected the religion of Jesus and embraced the religion of their [then] king. However, many of them did remain upon the religion of Jesus and they believed in our Prophet [when he came]. So We gave those of them who believed, in him, their reward; but many of them are immoral.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then We caused Our messengers) one after the other (to follow in their footsteps) to follow Noah and Abraham from their respective offspring; (and We caused Jesus, son of Mary, to follow) these Messenger, i.e. messengers other than the Prophet Muhammad (pbuh) (and gave him the Gospel, and placed compassion and mercy) towards each other (in the hearts of those who followed him) i.e. who followed the religion of Jesus. (But monasticism they invented) they built monasteries and cloisters to escape the sedition of Paul, the Jew. (We ordained it not for them) We did not enjoin monasticism upon them. (Only seeking Allah's pleasure) they did not invent it except to seek Allah's good pleasure, (and) had We enjoined it upon them (they observed it not with right observance) they would not have given it its right due. (So We give those of them who believe) among the monks (their reward) double for their faith and worship; these are the ones who did not contravene against the religion of Jesus. 24 among these were in the Yemen and when they heard of the Prophet (pbuh) they believed in him and joined his religion, (but many of them) of the monks (are evil-livers) disbelievers, these are the ones who went against the religion of Jesus.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ قَفَّيْنَا عَلَىٰ آثَارِهِم بِرُسُلِنَا } معناه أَتبعنا\n\n\n\n\nوقوله تعالى: { مَا كَتَبْنَاهَا عَلَيْهِمْ } معناه ما أمرناهم بهَا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {then We followed their tracks with Our messengers}, means that We followed them\n\nAnd His saying, {We have not imposed upon them} [means] that We have not commanded them with it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتدينوا بدينه { رَأْفَةً } عطفاً وليناً إلى حيث يعفون عن القاتل\n ولا يضربون الشاتم والضارب { وَرَحْمَةً } يترحمون بها عموم عباد الله\n\n\n{ وَ } من شدة محبتهم ومودتهم بالنسبة إلى الله ابتدعوا { رَهْبَانِيَّةً } يبالغون بها في العبادات إلى حيث لا يطعمون\n ولا يشربون إياماً\n ولا ينكحون قط\n ولا يختلطون مع الناس\n بل يوطنون نفوسهم في شعب الجبال والكهوف\n وإنما { ٱبتَدَعُوهَا } من تلقاء أنفسهم بلا رخصة منَّا إياهم\n إذ { مَا كَتَبْنَاهَا } أي: الرهبانية\n وما فرضناها وقدرناها { عَلَيْهِمْ } في دينهم وكتابهم\n بل ما اختاروها { إِلاَّ ٱبْتِغَآءَ رِضْوَانِ ٱللَّهِ } وطلباً لمرضاته\n ومع ذلك { فَمَا رَعَوْهَا حَقَّ رِعَايَتِهَا } أي: ما وافقت رهبانيتهم بدينهم وكتابهم\n إذ كفرا بمحمد صلى الله عليه وسلم\n وهو من أعظم معتقدات دينهم وكتابهم فتركوه\n وأنكروا عليه جهلاً وعناداً { فَآتَيْنَا ٱلَّذِينَ آمَنُواْ } بمحمد صلى الله عليه وسلم { مِنْهُمْ أَجْرَهُمْ } أي: أجر إيمانهم وأعمالهم بأضعاف ما استحقوا بأعمالهم { وَكَثِيرٌ مِّنْهُمْ فَاسِقُونَ } [الحديد: 27] خارجون عن مقتضى دينهم وكتابهم بإنكار محمد صلى الله عليه وسلم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم قَفِّينا على آثارهم } أي: نوح وإبراهيم، ومَن مضى من الأنبياء، أو: مَن عاصروهم من الرسل، { برسلنا وقَفِّينا بعيسى ابن مريم } أي: أرسلنا رسولاً بعد رسول حتى انتهى إلى عيسى ابن مريم\n\n\nوالتقفية: من القفا، كأنّ كل واحد جاء في قفا صاحبه من ورائه، { وآتيناه } أي: عيسى { الإِنجيلَ } وفيه لغتان كسر الهمزة وفتحه، وهو عجمي لا يلزم فيه أبنية العرب، { وجعلنا في قلوب الذين ابتَعوه } وهم النصارى { رأفةً } مودةً وليناً، { ورحمةً } تعطُّفاً على إخوانهم، وهذا ظاهر في النصارى دون اليهود، فأتباع عيسى أولاً كانوا الحواريين، وطائفة من اليهود، وكفرت به الطائفة الباقية، فالنصارى أشياع الحواريين، فما زالت الرحمة فيهم، وأما اليهود فقلوبهم أقسى من الحجر\n { ورهبانيةً ابتدعوها } من باب الاشتغال، أي: وابتدعوا رهبانية ابتدعوها من عند أنفسهم\n أو: معطوفة على ما قبلها، أي: وجعلنا في قلوبهم رهبانيةً مبتدَعةً مِن عندهم، أي: وقفيناهم للتراحم بينهم ولابتداع الرهابنية واستحداثها، وهي: المبالغة في الرهبة بالعبادة، والانقطاع عن الناس، وهي منسوبة إلى الرَهْبان، وهو الخائف، فعلان من: رَهَبَ، كخشيان، من خشي\n وقرئ بضم الراء، نسبة إلى الرُّهْبان جمع راهب، كراكب وركبان\n وسبب ابتداعهم إياها: أنَّ الجبابرة ظهروا على المؤمنين بعد رفع عيسى عليه السلام، فقاتلوهم ثلاث مرات، فقُتل المؤمنون حتى لم يبقَ منهم إلاَّ القليل، فخافوا أن يفتونهم في دينهم، فاختاروا الرهبانية في قُلَل الجبال، فارين بدينهم، مختلِّصين أنفسهم\n انظر الثعلبي فقد نقله حديثاً\n { ما كتبناها عليهم } أي: لم نفرضها عليهم، ولكن نذروها على أنفسهم\n ما فعلوا ذلك { إِلاَّ ابتغاءَ رِضْوانِ الله } عليهم، قيل: الاستثناء منقطع، أي: ما كتبناها عليهم لكن فعلوها ابتغاء رضوان الله، وقيل: متصل من أعم الأحوال، أي: ما كتبناها عليهم في حال من الأحوال إلاّ ابتغاء الرضوان، { فما رَعَوْها حقَّ رعايتها } كما يجب على الناذر رعاية نذره لأنه عهد مع الله، لا يحلّ نكثه، وقيل: في حق مَن أدرك البعثة فلم يؤمن بالنبي صلى الله عليه وسلم أي: فما رَعَوا تلك الرهبانية حقها، حيث لم يؤمنوا بالنبي صلى الله عليه وسلم، ويؤيده قوله تعالى: { فآتينا الذين آمنوا منهم } إيماناً صحيحاً، وهو الإيمان بالنبي صلى الله عليه وسلم { أجرَهم } ما يخصهم من الأجر، { وكثيرٌ منهم فاسقون } خارجون عن حد الاتباع، كافرون بالله ورسوله\n الإشارة: كل زمان يبعث اللّهُ رُسلاً يدعون إلى الله، وهم الأولياء العارفون، خلفاء الرسل، بالبينات الواضحة على ولايتهم، لمَن سبقت له العناية، وأنزلنا معهم الكتاب، أي: الواردات الإلهية، والميزان، وهو إلهام اصطلاح التربية المناسبة لذلك الزمان، فيزن بها أحوالَ المريدين، ويعطي كل واحد ما يناسبه من الأوراد، والأعمال، والأحوال، ليقوم الناس في أنفسهم بالقسط، من غير إفراط ولا تفريط، وأنزلنا الحديد، إشارة إلى الجذب، الذي في قلوب العارفين، فيه بأس شديد، يذهب العقول، ومنافع للناس، لأنه هو النور الذي يمشي به الوليّ في الناس، إذ بذلك الجذب يجذب قلوبَ المريدين، ومَن لم يكن له ذلك الجذب، فلا يصلح للتربية لأنه ظاهري محض، ولا بُد لهذا الجذب أن يصحبه سلوك في الظاهر، وإلاَّ فلا يصلح أيضاً للتربية كالمصطلمين\n\n\nخصّ هذا النور بأوليائه لِيعلم مَن ينصُر دينَه وسنةَ رسوله منهم، بالغيب، أي: مع غيب المشيئة عنهم، فهم يجتهدون في نصر الدين، وينظرون ما يفعل الله، وما سبق به القدر، وأمّا أمر الربوبية فهم في مقام العيان منها، إنَّ الله قوي، يُقوي قلوب المتوجهين، عزيز يُعز من يجتهد في نصر الدين\n ولقد أرسلنا نوحاً وإبراهيم، خصّ هذين الرسولين لأنّ نوحاً عليه السلام كان في غاية القوة والشدة، وإبراهيم كان في غاية الليونة، وهكذا أولياء كل زمان، بعضهم يميل للقوة جدّاً، وبعضهم يميل للرطوبة، فإذا أراد الله أن يُظهر طريقةً أ مِلةً جعل فيها هذين الضدين، من الأولياء مَنْ يميل لليونة ومَنْ يميل للقوة، ليعتدل الأمر في الوجود، فإن انفرد صاحبُ القوة احترق الوجود، أو غرق، كما جرى في زمان نوح عليه السلام، حين انفرد بالقوة، وإن انفرد صاحب الليونة وقعت برودة في الدين، كما وقع في زمن إبراهيم عليه السلام إذ لم تكن أمته كثيرة، ولمّا اجتمعا في زمان موسى كثرت أتباعه لأنَّ موسى عليه السلام كان قوياً، وهارون كان ليناً، فكثرت أتباعه\n وعظمت هذه المة المحمدية لدوام اجتماعهما في أمته، فكان عليه الصلاة والسلام سهلاً ليناً، وكان في مقابلته عمر من وزرائه قوياً صلباً في دين الله، ثم استخلف أبو بكر على قدم الرسول صلى الله عليه وسلم فقابله عمر رضي الله عنه، فلما استخلف عمر ولان قابله عليّ رضي الله عنه، وهكذا كل طائفة كثرت أتباعها تجد فيها هذين الضدين\n سبحان المدبِّر الحكيم، الجامع للأضداد\n وقوله تعالى: { وجعلنا في قلوب الذين اتبعوه رأفةً ورحمةً } هي صفة المريدين المتوجهين، ورهبانيةُ هذه الأمة: المساجد والزوايا، كما في الحديث\n وليس من شأن العارفين الانفراد في الجبال والفيافي، إنما شأنهم خلط الناس وإرشادهم\n قال الورتجبي: وصف الله تعالى هنا أهل السنة وأهل البدعة، أهل السنة: أهل الرحمة والرأفة، وأهل البدعة: أهل الرهبانية المبتدعة من أنفسهم\n وصف الله قلوب المتمسكين بسنّة الأنبياء بالمودة والشفقة في دينه ومتابعة رسله، فتلك المودة من مودة الله إياهم، وتلك الرحمة من رحمة الله عليهم، حيث اختارهم في الأزل لأنهم خلفاء الأنبياء، وقادة الأمة، ووصف المتكلفين الذي ابتدعوا رهبانية من أنفسهم، مثل ترك أكل اللحم، والجلوس في الزوايا للأربعين، عن الإتيان إلى الجمعة والجماعات، لأجل قبول العامة، فإنهم ليسوا على الطريق المستقيم، بل هم يتبعون شياطينهم، الذي غوتهم في دينهم، بل زيّنوا في قلوبهم المحالات والمزخافات، وما كتبنا عليهم إلا ابتغاء رضوان الله، ورضوان الله هو في الشريعة والطريقة الأحمدية صلى الله عليه وسلم\n هـ\n وقوله: \" الأربعين \" كان العبّاد ينذرون خُلوة أربعين يوماً، فيتخلّفون عن الجمعة والجماعة، والأمر كما قيل: إذا ثبت عدالة المرء فليترك وما فعل، فهو أسلم\n والله تعالى أعلم\n ثم أمر أهلَ الكتاب بالدخول في الإسلام، أو: أهل الإيمان بدوامه، فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ ٱتَّقُواْ ٱللَّهَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:46",
      "similarity": 0.5517004805679143
    },
    {
      "verse": "2:87",
      "similarity": 0.3931275075636236
    },
    {
      "verse": "46:9",
      "similarity": 0.3686518326043234
    },
    {
      "verse": "2:117",
      "similarity": 0.36758604111137216
    },
    {
      "verse": "6:101",
      "similarity": 0.35445417119860767
    }
  ]
}