{
  "chapter": "الحديد",
  "text": "الذين يبخلون ويامرون الناس بالبخل ومن يتول فان الله هو الغنى الحميد",
  "translations": [
    {
      "translation": "those who are tight-fisted and tell others to be tight-fisted. If anyone turns away, Allah is the Rich Beyond Need, the Praiseworthy.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hold back what they possess and enjoin stinginess on others. Whoever turns away (from God, should remember) that God is self-sufficient, worthy of praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who are niggardly and bid others to be niggardly. And he who turns away, (should know that) Allah is Self-Sufficient, Immensely Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who turn away (from guidance) should know that God is Self-sufficient and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who practice miserliness, and exhort others to miserliness; and whoever turns away, then (know that) Allah is the Independent, the Most Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are misers and enjoin miserliness upon people. And whosoever turns away, then Allah is Rich, Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are niggardly and enjoin niggardliness on men; and whoever turns back, then surely Allah is He Who is the Selfsufficient, the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "such as are niggardly, and bid men to be niggardly. And whosoever turns away, God is the All-sufficient, the All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hoard and who enjoin upon the people avarice. And whosoever turneth away, still Allah is the Absolute, the Owner of Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "nor those who, being miserly themselves, urge others to be miserly. He who turns his back should remember that God alone is self-sufficient and worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ihey who are niggardly and command mankind to niggardliness. And whosoever turneth away, then verily Allah! He is the Self-sufficient, the praise-worthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such as are [themselves] stingy and bid [other] people to be stingy. And whoever refuses to comply [should know that] indeed Allah is the All-sufficient, the All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such persons as are covetous and commend covetousness to men. And if any turn back (from Allah's Way), verily Allah is Free of all Needs, Worthy of all Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are misers and enjoin upon people miserliness (Allah is not in need of their charity). And whosoever turns away (from Faith Allah's Monotheism), then Allah is Rich (Free of all wants), Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "nor those who are mean, and encourage others to be mean. And he that turns away, (know) that Allah is Rich and Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are stingy, and induce people to be stingy. Whoever turns away—God is the Independent, the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Those] who are stingy and enjoin upon people stinginess. And whoever turns away - then indeed, Allah is the Free of need, the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:24] such as are niggardly, in their duties, and bid people to be niggardly, in these [too]: against such there is a severe threat of chastisement. And whoever turns away, from what is his duty, still God, He is indeed (huwa, ‘He’, is a separating pronoun; a variant reading drops it) the Independent, [without need] of anyone other than Him, the Praiser, of His friends.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who hoard) who conceal the traits and description of the Prophet (pbuh) in the Torah (and who enjoin upon the people avarice) in the Torah by concealing the traits and description of the Prophet (pbuh). (And whosoever turneth away) from faith, (still Allah is the Absolute) He is free of the need for his faith, (the Owner of Praise) for he who declares His divine Oneness; and it is said the Owner of Praise with regard to His acts, for He gives thanks for very little and rewards it abundantly.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوالمختالو المفتخرون هم { ٱلَّذِينَ يَبْخَلُونَ } ويمسكون أنفسهم عن التصدق والإنفاق، ويجمعون من حطام الدنيا مقدار ما يفتخرون بها، ويتفوقون على أقرانهم بسببها { وَ } من غاية بخلهم وإمساكهم: { يَأْمُرُونَ ٱلنَّاسَ } أيضاً { بِٱلْبُخْلِ } لئلا يلحق العار عليهم خاصة؛ وليعرضوا ويصرفوا ضعفاء الأنام عن امتثال أمر الله بالإنفاق؛ حتى لا ينالوا بالمثوبة العظمى، والكرامة الكبرى في النشأة الأخرى من عنده سبحانه { وَ } بالجملة: { مَن يَتَوَلَّ } ويعرض عنه الله، ولم يشكر لنعمه، ولم يواظب على أداء حقوق كرمه فلا يضره سبحانه، ولا ينقص من علو شأنه وسمو برهانه { فَإِنَّ ٱللَّهَ } المتعزز برداء العظمة والكبرياء { هُوَ ٱلْغَنِيُّ } بذاته عن إطاعة عباده، وإنفاقهم وشكرهم وكفرانهم { ٱلْحَمِيدُ } [الحديد: 24] حسب أسمائه وصفاته الذاتية بلا افتقار له إلى محامد مظاهره ومصنوعاته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم أبدل من \" كل مختال \" تفسيراً له فقال: { الذين يبخلون ويأمرون الناسَ بالبخل } أي: لا يُحب الذين يفرحون الفرحَ المُطغي إذا رُزقوا مالاً أو حظّاً من الدنيا، فلأجل فرحهم به عزّ في نفوسهم، فبخلوا به، وأَمروا غيرهم بإمساكه، ويحضُّونهم على البخل والادخار، { ومَن يتولَ } يُعرض عن الإنفاق، أو عن أوامر الله تعالى ونواهيه، ولم ينتهِ عما نهى عنه من الأسى على الفائت، والفرح بالآتي، { فإِنَّ الله هو الغنيُّ الحميدُ } أي: غني عنه وعن أنفاقه، محمودٌ في ذاته، لا يضره إعراضُ مَن أعرض عن شكره، بالتقرُّب إليه بشيء من نعمه\n\n\nوفيه تهديد وإشعار بأنَّ الأمر بالإنفاق إنما هلو لمصحلة المنفق فقط\n وقرأ المدنيان وابن عامر بغير \" هو \" الذي يفيد الحصر، اكتفاء عنها بتعريف الجُزأين، مع تأكيد \" إنّ \" ، وقرأ الباقون بزيادتها للتنصيص على الحصر والتأكيد، وهو ضمير فصل عن البصريين، أي: الفرق لأنه يفرق بين الخبر والصفة، وعماد عند الكوفيين، ورابطة عند المنطقيين\n الإشارة: ما أصاب من مصيبة في أرض البشرية، من غلبة الطبع، والميل إلى الحظوظ النفسانية، ولا في أنفسكم ولا في باطن أنفسكم، مما يُصيب القلبَ من الأمراض، كالعجب والرياء والكبر والحسد، وغيرها، وما يُصيب الروح من الوقوف مع المقامات، أو الكرامات، أو الكشوفات، إلاَّ في كتاب سابق، وهو العلم القديم، والقضاء المحتوم، فمَن وافقته رياح القضاء نهض رغماً عن أنفه، ومَن انتكبته نكس على عقبيه، أو وقف عن سيره، فالرجوع إلى الله واجب في الحالتين، عبودية وأدباً، فعلنا ذلك لكيلا تأسَوا على ما فاتكم\n فمَن تحقّق بالعبودية لا يفوته شيء، ولا تفرحوا بما آتاكم مما شأنه يزول\n قال القشيري: هذه صفة المتحررين من رِقِّ النفس، وقيمة الرجال إنما تتبين بتغيُّرهم، فمَن لم يتغير بما يَرِدُ عليه مما لا يريده من جفاءٍ أو مكروهٍ أو محبةٍ فهو كامل، ومَن لم يتغير بالمضار، ولا يَسُرُّه الوجد، كما لا يُحْزِنْه العَدَم، فهو سَيِّد وقته\n هـ\n قلت: وهذه كانت سيرة الصحابة رضي الله عنهم كما قال كعب بن زهير في وصفهم:\n\nثم قال: ويُقال: إذا أردْتَ أن تعرفَ الرجلَ فاطلبْه عند الموارد، والتغيراتُ من علامات بقاء النفْس بأيّ وجهٍ كان\n هـ\n وقال الورتجبي عن الواسطي: العارف مستهلك في كُنه المعروف، فإذا حصل بمقام المعرفة لا يبقى عليه قصد فرح ولا أسى، قال الله تعالى: { لِكَيلا تأسوا\n\n\n } الآية\n هـ\n قلت: وإليه أشار في الحِكَم بقوله: \" ما تجده القلوب من الأحزان فلِما منعت من الشهود والعيان \" ، وقال ابن الفارض، في شان الخمرة إذا دخلت القلب:\n\nأوحى الله تعالى إلى داود عليه السلام: \" يا داود، قُل للصدِّيقين: بي فليفرحوا، وبذكري فليتنعموا \"\n واحتجّ الغزالي بهذه الآية على أن الرزق لا يزيد بالطلب، ولا ينقص بتركه، ولو كان يزيد بالطلب وينقص بالترك لكان للأسى والفرح موضع، إذ هو قصَّر وتوانى حتى فاته، وشمَّر وجدّ حتى حصَّله، وقد قال صلى الله عليه وسلم للسائل:\n\n \" ما لك، لو لم تأتها لأتتك \" \n\n، ثم أورد كون الثواب والعقاب مكتوبيْن، ويزيد بالطلب وينقص بتركه، ثم فرّق بأنّ المكتوب قسمان: قسم مكتوب مطلقاً، من غير شرط وتعليقٍ بفعل العبد، وهو الأرزاق والآجال، وقسم معلّق بفعل العبد، وهو الثواب والعقاب\n\n\nهـ\n قلت: في تفريقه نظر، والحق: التفصيل في النظر، فمَن نظر لعالم الحكمة، وهو عالم التشريع، وجدهما معاً مقيدين بفعل العبد، أمّا الرزق الحسي فيأتي بسبب الفعل، إن توجه للأسباب ونقص من التقوى، وبغير سبب إن تجرّد من الأسباب، وحصل مقام التقوى لقوله تعالى:\n\n[الطلاق: 2] الآية، فالمُتَّقِي المنقطع إلى الله ناب اللّهُ عنه في الفعل، ومَن نظر لعالم القدرة، وهو عالم الحقيقة، وجد الفعل كله من الله بلا واسطة { لا يُسأل عما يفعل وهم يُسألون } وكذلك أمر الرزق المعنوي، وهو الطاعة واليقين، التي يتربت عليهما الثواب والعقاب، فمَن نظر لعالَم الحكمة وجده مقيداً بسبب العبد واجتهاده، وبها جاءت الشريعة، ومَن نظر لعالَم القدرة امتحى العبد ووجوده، فضلاً عن فعله وتسبُّبه، فتأمّله\n قوله تعالى: { والله لا يُحب كل مختال فخور } قال القشيري: لأنّ الاختيال من بقاء النفس، والفخر رؤية خطر ما به يفتخر\n هـ\n { الذين يبخلون } بما عندهم من الأرزاق الحسية والمعنوية، والبخل بها علامة الفرح بها، والوقوف معها، وأمّا مَن وصل إلى شهود مُعطيهما ومُجريها فلا يبخل بشيء لغناه بالله عن كل شيء، ومَن يتولّ عن هذا كله، فإِنَّ الله الغني عنه وعن جميع الخلق، المحمود قبل وجود الخلق\n والله تعالى أعلم\n ثم ذكر مِنَّةَ الواسطة إذ لا تُعرف هذه الأحكام إلاَّ من جهتها، فقال: { لَقَدْ أَرْسَلْنَا رُسُلَنَا بِٱلْبَيِّنَاتِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "92:8",
      "similarity": 0.862019947280778
    },
    {
      "verse": "9:76",
      "similarity": 0.8056888440124428
    },
    {
      "verse": "47:38",
      "similarity": 0.6523505987965821
    },
    {
      "verse": "4:37",
      "similarity": 0.5992056481372822
    },
    {
      "verse": "3:180",
      "similarity": 0.39880184863719803
    }
  ]
}