{
  "chapter": "الحديد",
  "text": "لكيلا تاسوا۟ على ما فاتكم ولا تفرحوا۟ بما ءاتىكم والله لا يحب كل مختال فخور",
  "translations": [
    {
      "translation": "That is so that you will not be grieved about the things that pass you by or exult about the things that come to you. Allah does not love any vain or boastful man:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest you grieve for what you missed, or rejoice at what you received. God does not love the egoist and the braggart,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(We do so) that you may not grieve over the loss you suffer, nor exult over what He gave you. Allah does not love the vainglorious, the boastful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that you would not grieve over what you have lost nor become too happy about what God has granted to you. God does not love the arrogant boastful ones who are niggardly and who try to make other people also niggardly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that you may not be saddened upon losing something, nor rejoice upon what you are given; and Allah does not like any boastful, conceited person.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that you may not grieve at the things over that you fail to get, nor rejoice over that which has been given to you. And Allah likes not prideful boasters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that you may not grieve for what has escaped you, nor be exultant at what He has given you; and Allah does not love any arrogant boaster:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that you may not grieve for what escapes you, nor rejoice in what has come to you; God loves not any man proud and boastful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That ye grieve not for the sake of that which hath escaped you, nor yet exult because of that which hath been given. Allah loveth not all prideful boasters,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that you may not grieve for what has escaped you, nor be exultant over what you have gained. God loves neither the conceited nor the boastful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is announced lest ye sorrow for the sake of that which hath escaped you, or exult over that which He hath vouchsafed Unto you: And Allah loveth not any vainglorious boaster:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that you may not grieve for what escapes you, nor boast for what comes your way, and Allah does not like any swaggering braggart.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that ye may not despair over matters that pass you by, nor exult over favours bestowed upon you. For Allah loveth not any vainglorious boaster,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that you may not be sad over matters that you fail to get, nor rejoice because of that which has been given to you. And Allah likes not prideful boasters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that you will not be saddened for whatever does not come to you, nor be overjoyed in what has come to you. Allah does not love those who are proudand boastful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That you may not sorrow over what eludes you, nor exult over what He has given you. God does not love the proud snob.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order that you not despair over what has eluded you and not exult [in pride] over what He has given you. And Allah does not like everyone self-deluded and boastful -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:23] so that you may not (kay-lā: kay makes a verb subjunctive, with the same sense as an [as in an-lā, ‘so that … not’]), that is to say, God informs [you] of this so that you may not, grieve for what escapes you, nor exult, with a wanton exultation, rather an exultation that is [followed by] a thanksgiving for the grace, at what He has given you (read [thus] as ātākum; or read as atākum, meaning, ‘[at] what has come to you from Him’). For God does not like any swaggering braggart, [swaggering] in arrogance because of what he has been given, [boastful] of it to people;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That ye grieve not for the sake of that which hath escaped you) of provision and well-being and say it has not been decreed for us, (nor yet exult because of that which hath been given) and say: He has given this to us. (Allah loveth not all prideful) in their walk (boasters) regarding the bounties of Allah; it is also said that this means: Allah loves not all prideful people about their disbelief and boasters about their idolatry; this is in reference to the Jews,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لِّكَيْلاَ تَأْسَوْاْ عَلَىٰ مَا فَاتَكُمْ } أي لا تَحزَنوا { وَلاَ تَفْرَحُواْ بِمَآ آتَاكُمْ } ليس من أحدٍ إلاّ ويَحزنُ ويَفرحُ\n ولكن من أصابهُ خيرٌ فليجعلهُ شكراً\n ومن أصابتهُ مصيبةٌ فَليَجْعَلْها صبراً\n\n\n\n\nوقوله تعالى: { لاَ يُحِبُّ كُلَّ مُخْتَالٍ فَخُورٍ } معناه مُتكبرٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, \"So that you {do not despair} over what has eluded you, nor {exult} over what He has given you.\" For no one despairs over what has eluded him, nor does anyone exult over what he has been given, except that\n\n\nBut if he is blessed with good fortune, let him give thanks.\n\n\nAnd whoever is afflicted with a misfortune should bear it patiently.\n\n\nAnd His saying, \"He does not love every arrogant, boastful person,\" means that He is a proud, boastful person.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وفقراء الإسلام { وَ } بالجملة: { ٱللَّهُ } المطلع على ما في استعدادات عباده من النخوة والاستكبار { لاَ يُحِبُّ كُلَّ مُخْتَالٍ } ذو كبر وخيلاء منهم { فَخُورٍ } [الحديد: 23] مخافر مباهٍ\n بسبب المال والجاه والثروة\n والسيادة على أقرانه وأبناء زمانه\n\n\nوإذا كان الأمر كذلك فلا تسندوا الأمور إلى أنفسكم\n بل فوضوا أموركم كلها إلى الله\n وأسندوها إليه سبحانه بالأصالة\n فلا تفرحوا ولا تحزنوا\n بل افنوا في الله وابقوا\n لتتمكنوا\n[القمر: 55]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقد يدلّ عليها قوله تعالى: { لِكَيْلا تأسَوا } أي: أخبرناكم بذلك لِكيلا تحزنوا { على ما فاتكم } من الدنيا حزناً يقنطكم\n { ولا تفرحوا } فرح المختال الفخور { بما آتاكم } من الدنيا وسعتها\n ومن العافية وصحتها\n فإنَّ مَنْ عَلِمَ أنَّ الكل مقدر\n يفوت ما قدر فواته\n ويأتي ما قدّر إتيانه\n لا محالة\n لا يعظم جزعه على ما فات\n ولا فرحه بما هو آت\n ومع هذا كل ما ينزل بالنفس من المصائب زيادة في درجاته\n وتطهير من سيئاته\n ففي صحيح مسلم: أن رسول الله صلى الله عليه وسلم قال:\n \" ما يُصيب المسلم من وَصَبٍ\n ولا نَصَب\n ولا سقم\n ولا حَزَنٍ\n حتى الهمَّ يَهُمُّه\n إلاَّ كفّر به من سيئاته \" \nوقال أيضاً صلى الله عليه وسلم:\n \" عجبت لقضاء الله تعالى للمؤمن: إن قضى له بالسراء رضي وكان خيراً\n وإن قضى له بالضراء ورضي كان خيراً له \" \n\n وقال أيضاً:\n \" ما من مسلم يُشاكُ بشوكةٍ فما فوقها\n إلاَّ كُتبتْ له درجةٌ\n ومُحيتْ عنه بها خَطيئةٌ \"\n \nوليس أحد إلاَّ وهو يفرح بمنفعةٍ تُصيبه\n ويحزن عند مضرةٍ تنزل به\n لأنه طبع بشري\n ولذلك كان عمر رضي الله عنه إذا أوتي بغنيمة أو خير يقول: اللهم إنا لا نستيطع إلاَّ أن نفرح بما آتيتنا\n ولكن ينبغي أن يكون الفرح شكراً\n والحزن صبراً\n وإنما يُذم مِن الحزن الجزع المنافي للصبر\n ومن الفرح الأشر المُطغي المُلهي عن الشكر\n والمؤدّي إلى الفخر\n { واللّهُ لا يُحب كلَّ مختال فخور } فإنَّ مَن فرح بحظوظ الدنيا\n وعظمت في نفسه\n اختال وافتخر بها\n لا محالة\n وفي تخصيص التنزيل الذم بالفرح المذكور إيذان بأنه أقبح من الأسى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:36",
      "similarity": 0.42649855574158074
    },
    {
      "verse": "11:10",
      "similarity": 0.3915901193961772
    },
    {
      "verse": "60:11",
      "similarity": 0.3810314658055751
    },
    {
      "verse": "3:153",
      "similarity": 0.3704412774728727
    },
    {
      "verse": "34:51",
      "similarity": 0.33917596708309067
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/057023.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/057023.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/57:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}