{
  "chapter": "الحديد",
  "text": "سابقوا۟ الى مغفرة من ربكم وجنة عرضها كعرض السماء والارض اعدت للذين ءامنوا۟ بالله ورسله ذلك فضل الله يؤتيه من يشاء والله ذو الفضل العظيم",
  "translations": [
    {
      "translation": "Race each other to forgiveness from your Lord and to a Garden, whose breadth is like that of heaven and earth combined, made ready for those who have iman in Allah and His Messengers. That is Allah's favour which He gives to those He wills. Allah's favour is indeed immense.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hasten for the forgiveness of your Lord and Paradise whose expanse is as wide as that of the heavens and the earth, which has been prepared for those who believe in God and His apostles. This is the bounty of God which He bestows on whosoever He please; and the bounty of God is infinite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So vie with one another in seeking to attain your Lord's forgiveness and a Garden whose width is as the width of the heaven and the earth, one which has been prepared for those who believe in Allah and His Messengers. That is Allah's bounty which He bestows upon those whom He pleases. Allah is the Lord of abounding bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Compete with one another to achieve forgiveness from your Lord and to reach Paradise, which is as vast as the heavens and the earth, and is prepared for those who believe in God and His Messenger. This is the blessing of God and He grants it to whomever He wants. The blessings of God are great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rush towards the forgiveness of your Lord and a Paradise wide as the expanse of the heavens and the earth – made for those who believe in Allah and all His Noble Messengers; this is Allah’s munificence, He may bestow it to whomever He wills; and Allah is Extremely Munificent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Race with one another in hastening towards forgiveness from your Lord, and Paradise the width whereof is as the width of the heaven and the earth, prepared for those who believe in Allah and His Messengers. That is the grace of Allah which He bestows on whom He is pleased with. And Allah is the Owner of great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hasten to forgiveness from your Lord and to a garden the extensiveness of which is as the extensiveness of the heaven and the earth; it is prepared for those who believe in Allah and His apostles; that is the grace of Allah: He gives it to whom He pleases, and Allah is the Lord of mighty grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Race to forgiveness from your Lord, and a Garden the breadth whereof is as the breadth of heaven and earth, made ready for those who believe in God and His Messengers. That is the bounty of God; He gives it unto whomsoever He will; and God is of bounty abounding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Race one with another for forgiveness from your Lord and a Garden whereof the breadth is as the breadth of the heavens and the earth, which is in store for those who believe in Allah and His messengers. Such is the bounty of Allah, which He bestoweth upon whom He will, and Allah is of Infinite Bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vie with one another for your Lord's forgiveness and for a Paradise as vast as heaven and earth, which has been made ready for those who believe in God and His messengers. Such is God's grace. He bestows it upon whoever He pleases. There is no limit to God's bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Strive with one another in hastening toward forgiveness from your Lord and toward a Garden whereof the width is as the width of the heavens and the earth, gotten ready for those who beiieve in Allah and His apostles. This is the grace of Allah; He vouchsafeth It Unto whomsoever He will; and Allah is Owner of mighty grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take the lead towards forgiveness from your Lord and a paradise as vast as the heavens and the earth, prepared for those who have faith in Allah and His apostles. That is Allah’s grace, which He grants to whomever He wishes, and Allah is dispenser of a great grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be ye foremost (in seeking) Forgiveness from your Lord, and a Garden (of Bliss), the width whereof is as the width of heaven and earth, prepared for those who believe in Allah and His messengers: that is the Grace of Allah, which He bestows on whom he pleases: and Allah is the Lord of Grace abounding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Race one with another in hastening towards Forgiveness from your Lord (Allah), and towards Paradise, the width whereof is as the width of heaven and earth, prepared for those who believe in Allah and His Messengers. That is the Grace of Allah which He bestows on whom He pleases. And Allah is the Owner of Great Bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, race for forgiveness from your Lord, and for a Garden as wide as heaven and earth, prepared for those who believe in Allah and His Messengers. Such is the Favor of Allah; He gives it to whom He will. Allah is the Owner of great favor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Race towards forgiveness from your Lord; and a Garden as vast as the heavens and the earth, prepared for those who believe in God and His messengers. That is the grace of God; He bestows it on whomever He wills. God is the Possessor of Immense Grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Race toward forgiveness from your Lord and a Garden whose width is like the width of the heavens and earth, prepared for those who believed in Allah and His messengers. That is the bounty of Allah which He gives to whom He wills, and Allah is the possessor of great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:21] Vie with one another for forgiveness from your Lord and a garden the breadth of which is as the breadth of the heaven and the earth, if one were placed at the end of the other, prepared for those who believe in God and His messengers. That is the bounty of God, which He gives to whomever He will, and God is [dispenser] of tremendous bounty.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then said to all created beings: (Race) in relation to repentance of your sins (one with another for forgiveness from your Lord and a Garden) and for a Garden by means of righteous works (whereof the breadth is as the breadth of the heavens and the earth) where they to be joined with each other, (which is in store) which is created and prepared (for those who believe in Allah and His messengers) from among all nations. (Such) forgiveness, Allah's good pleasure and the Garden (is the bounty of Allah) are all bounties from Allah, (which He bestoweth upon whom He will) upon whoever deserves it, (and Allah is of Infinite Bounty) in bestowing Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ سابقوا إلى مغفرة من ربّكم } لما حقّر الحياة الحسية النفسية الفانية وصوّرها في صورة الخضراء السريعة الانقضاء دعاهم إلى الحياة العقلية القلبية الباقية فقال: { سابقوا إلى مغفرة من ربكم } أي: تستر صفات النفس بنور القلب { وجنّة عرضها } العالم الجسماني بأسره لإحاطة القلب به وبصوره أو نفرهم عن الحياة البشرية ودعاهم إلى الحياة الإلهية أي: سابقوا إلى مغفرة تستر ذواتكم ووجوداتكم التي هي أصل الذنب العظيم بنور ذاته وجنّة عرضها سموات الأرواح وأرض الأجساد بأسرها\n أي: الوجود المطلق كله الشامل للوجودات الإضافية بأجمعها { أعدّت للذين آمنوا بالله ورسوله } الإيمان العلمي اليقيني على الأول والإيمان العيني والحقي على الثاني\n { ما أصاب من مصيبة } من الحوادث الخارجية والبدنية والنفسانية { إلا في كتاب } هو القلب الكلي المسمى باللوح المحفوظ\n لتعلموا علماً يقيناً أنه ليس من لكسبكم وحفظكم وحذركم وحراستكم فيما آتاكم مدخل وتأثير\n ولا لعجزكم وإهمالكم وغفلتكم وقلّة حيلتكم وعدم احترازكم واحتفاظكم فيما فاتكم مدخل\n فلا تحزنوا على فوات خير ونزول شر ولا تفرحوا بوصول خير وزوال شرّ إذ كلها مقدّرة { إنّ الله لا يحب كل مختال } أي: متبختر من شدّة الفرح بما آتاه { فخور } به لعدم يقينه وبعده عن الحق بحب الدنيا وانجذابه إلى الجهة السفلية بمنافاته للحضرة الإلهية واحتجابه بالظلمات عن النور\n { الذين يبخلون } لشدّة محبة المال { ويأمرون الناس بالبخل } لاستيلاء الرذيلة عليهم { ومن يتول } أي: يعرض عن الله بالتوجه إلى العالم السفلي والجوهر الغاسق الظلماني { فإنّ الله هو الغنيّ } عنه لاستغنائه بذاته { الحميد } لاستقلاله بكماله\n أي: يخذله ويمهله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وحال العقبى وما يترتب عليها { سَابِقُوۤاْ } سارعوا\n وبادروا بوفور الرغبة والرضا { إِلَىٰ } تحصيل أسباب { مَغْفِرَةٍ } مرجوة { مِّن رَّبِّكُمْ } الذي ربَّاكم على فطرة الهداية والتوحيد { وَ } وسائل دخول { جَنَّةٍ } وسيعه فسيحة { عَرْضُهَا كَعَرْضِ ٱلسَّمَآءِ وَٱلأَرْضِ } بحسب متفاهم العرف\n وإلاَّ فلا يكاد سعة الجنة وعرش الرحمن قلب الإنسان الكامل\n كما يشهد به قلب العارف المحقق\n المتحقق بمقام القلب الذي هو وعاء الحق\n المنزه عن مطلق المقادير والتقادير { أُعِدَّتْ لِلَّذِينَ آمَنُواْ بِٱللَّهِ وَرُسُلِهِ } على وجه الإخلاص\n وأكدوا إيمانهم وإخلاصهم بالرضا والتسليم بعموم ما جرى عليهم من القضاء\n وفوضوا أمورهم كلها إلى المولى حتى صار علمهم منتهياً إلى العين\n وعينهم إلى الحق\n\n\n{ ذَلِكَ } التحقق والانتهاء { فَضْلُ ٱللَّهِ } بلا سبق شيء يوجبه ويجبله\n وعبودية يستحقه\n بل { يُؤْتِيهِ مَن يَشَآءُ } عنايةً منه سبحانه\n وإحساناً ناشئاً عن محض الإرادة والاختيار\n وكيف { وَٱللَّهُ } الغني في ذاته\n المستغني مطلقاً عن عبادة مظاهره وأظلاله { ذُو ٱلْفَضْلِ ٱلْعَظِيمِ } [الحديد: 21] والكرم العميم\n يمن على من يشاء من عباده بمقتضى سعة رحمته وجوده حسب علمه المحيط باستعداداتكم وقابلياتهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { سابِقوا } بالأعمال الصالحة { إِلى مغفرة من ربكم } أو: سارِعوا مسارعة السابقين لأقرانهم في المضمار\n { وجنةٍ عرضها كعرض السماء والأرض } أي: كعرض سبع سموات\n وسبع أرضين\n إذا مدت إحداها حَذْو الأخرى\n وذَكَر العرض دون الطول لأنّ كل ما له عرض وطول فعَرضه أقلّ من طوله\n فإذا وصف عَرضه بالبسط عُرف أن طوله أبسط\n وهذا تقريب لأفهام العرب\n وإلاَّ فالجنة أعظم من ذلك مراراً\n كيف لا والمؤمن الواحد يُعطي قدر الدنيا عشر مرات! { أُعِدَّتْ } تلك الجنة { للذين آمنوا بالله ورسله } وهو دليل أنها مخلوقة\n { ذلك فضلُ الله يؤتيه من يشاء } وهم المؤمنون\n وفيه دليل أنه\n\n \" لا يدخل الجنة أحدٌ بعمله \" \nكما في الحديث: { والله ذو الفضل العظيم } وبذلك يؤتي من شاء ذلك الفضل\n الذي لا غاية وراءه\n الإشارة: قد شبّه بعضُ الحكماء الدنيا بسبعة أشياء\n شبّهها بالماء المالح\n يغرق ولا يروي\n ويضر ولا ينفع\n وشبهها بظل الغمام\n يغر ويخذل\n وشببها بالبرق الخاطف في سرعة الذهاب والإضرار\n وبسحاب الصيف\n يضر ولا ينفع\n وبزهر الربيع\n يغر بزهرته\n ثم يصفر فتراه هَشيماً\n بأحلام النائم\n يرى السرورَ في منامه\n فإذا استيقظ لم يجد في يديه شيئاً إلاّ الحسرة\n وبالعسل المشوب بالسم الرعاف\n يغر ويقتل\n هـ\n قال حفيده: فتأملت هذه الحروف سبعين سنة\n ثم زِدتُ فيها حرفاً واحداً فشبهتها بالغول التي تهلك مَن أجابها\n وتترك مَن أعرض عنها\n هـ\n وفي كتاب قطب العارفين\n لسيدي عبد الرحمن اللجائي\n قال: فأول درجة الذاهبين إلى الله تعالى: بغض الدنيا\n التي هي ظلمة القلوب\n وحجاب لوائح الغيوب\n والحاجزة بين المحب والمحبوب\n فبقدر رفضها يستعد للسفر\n ويصح للقلوب النظر\n فإن كانت الدنيا من قلب العبد مرفوضة\n حتى لا تعدل عنده جناح بعوضة\n فقد وضع قدمه في أول درجة من درجات المريدين\n فينظر العبد بعد ذلك ما قدّمت دنياه\n ويقبل على أخراه\n هـ\n وذكر القشيري في إشارة الآية: أنها إشارة إلى أطوار النفس والقلب والروح والسر\n فقال بعد كلام: وأيضاً يُشير إلى تعب صِبا النفس الأمّارة بملاعب المخالفات الشرعية\n والموافقات الطبيعية\n وإلى لهو شاب القلب بالصفات القلبية\n مثل الزهد\n والورع\n والتوكُّل والتقيُّيد بها\n وإلى زينة كهل السر بالأحوال السرية\n والمنازلات الغيبية\n مثل الكشوفات والمشاهدات والمعاينات\n وإلى تفاخر شيخ الروح بإنبات التجليات والتنزلات\n وإلى تكاثر سر السر بالفناء عن ناسوتيته\n والبقاء بلاهوتيته الجامع\n هـ\n إلاّ أنه قدّم السر على الروح\n والمعهود العكس\n فانظره\n قوله: { سابِقوا\n\n\n } الآية\n فيه إغراء على النهوض إلى الله\n وسرعة السير إلى الحق تعالى\n التنافس في السبق\n كما قال الشاعر:\nحُكي عن أبي خالد القيرواني\n وكان من العُبّاد\n المجتهدين: أنه رأى خيلاً يسابقَ بها\n فتقدمها فَرَسان\n ثم تقدم أحدهما الآخر\n ثم جدّ الثاني حتى سبق الأول\n فتخلّل أبو خالد\n حتى وصلَ إلى الفرس السابق\n فجعل يُقبّله\n ويقول: بارك الله فيك\n صبرت فظفرت\n ثم سقط مغشيّاً\n\nهـ\n قال الورتجبي: دعا المريدين إلى مغفرته بنعت الإسراع\n يعني في قوله: { سارِعوا } ودعا المشتاقين إلى جماله بنعت الاشتياق\n وقد دخل الكل في مظنة الخطاب لأنّ الكل قد وقعوا في بحار الذنوب\n حين لم يعرفوه حقّ معرفته\n فدعاهم إلى التطهير برحمته من الغرور بأنهم عرفوه\n هـ\n أي: دعاهم إلى التطهير من الاغترار بمعرفته\n وهي لم تحصل\n والله تعالى أعلم\n ثم سلَّى عباده عما يصيبهم\n ومن جملة ذلك: الاغترار بالدنيا\n فقال: { مَآ أَصَابَ مِن مُّصِيبَةٍ فِي ٱلأَرْضِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:133",
      "similarity": 0.47641829608908515
    },
    {
      "verse": "62:4",
      "similarity": 0.4229004352776983
    },
    {
      "verse": "56:10",
      "similarity": 0.3854584538956914
    },
    {
      "verse": "79:4",
      "similarity": 0.38190413849571475
    },
    {
      "verse": "21:101",
      "similarity": 0.3782476482141533
    }
  ]
}