{
  "chapter": "الحديد",
  "text": "اعلموا۟ انما الحيوة الدنيا لعب ولهو وزينة وتفاخرۢ بينكم وتكاثر فى الامول والاولد كمثل غيث اعجب الكفار نباته ثم يهيج فترىه مصفرا ثم يكون حطما وفى الءاخرة عذاب شديد ومغفرة من الله ورضون وما الحيوة الدنيا الا متع الغرور",
  "translations": [
    {
      "translation": "Know that the life of this world is merely a game and a diversion and ostentation and a cause of boasting among yourselves and trying to outdo one another in wealth and children: like the plant-growth after rain which delights the cultivators, but then it withers and you see it turning yellow, and then it becomes broken stubble. In the Next World there is terrible punishment but also forgiveness from Allah and His good pleasure. The life of this world is nothing but the enjoyment of delusion.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that the life of this world is only a frolic and mummery, an ornamentation, boasting and bragging among yourselves, and lust for multiplying wealth and children. It is like rain so pleasing to the cultivator for his vegetation which sprouts and swells, and then begins to wither, and you see it turn to yellow and reduced to chaff. There is severe punishment in the Hereafter, but also forgiveness from God, and acceptance. As for the life of this world, it is no more than merchandise of vanity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know well that the life of this world is merely sport and diversion and adornment and an object of your boasting with one another, and a rivalry in the multiplication of riches and children. Its likeness is that of rain: when it produces vegetation it delights the tillers. But then it withers and you see it turn yellow, and then it crumbles away. In the Hereafter there is (either) grievous chastisement (or) forgiveness from Allah and (His) good pleasure. The life of this world is nothing but delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that the worldly life is only a game, a temporary attraction, a means of boastfulness among yourselves and a place for multiplying your wealth and children. It is like the rain which produces plants that are attractive to the unbelievers. These plants flourish, turn yellow, and then become crushed bits of straw. In the life hereafter there will be severe torment or forgiveness and mercy from God. The worldly life is only an illusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that the life of this world is nothing but play and pastime, and adornment, and boasting amongst yourselves, and the desire to surpass each other in wealth and children; like the rain the produce of which pleased the farmer, then dried so you see it yellow, and then turned into dry trampled hay; and in the Hereafter is a severe punishment, and the forgiveness from Allah and His pleasure; and the life of this world is nothing but counterfeit wealth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that the life of this world is only play and amusement, pomp and mutual boasting among you, and rivalry in respect of wealth and children. (It is) like a rain (Ghayth), thereof the growth is pleasing to the tiller; afterwards it dries up and you see it turning yellow; then it becomes straw. But in the Hereafter (there is) a severe torment, and (there is) forgiveness from Allah and (His) pleasure. And the life of this world is only a deceiving enjoyment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that this world's life is only sport and play and gaiety and boasting among yourselves, and a vying in the multiplication of wealth and children, like the rain, whose causing the vegetation to grow, pleases the husbandmen, then it withers away so that you will see it become yellow, then it becomes dried up and broken down; and in the hereafter is a severe chastisement and (also) forgiveness from Allah and (His) pleasure; and this world's life is naught but means of deception.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that the present life is but a sport and a diversion, an adornment and a cause for boasting among you, and a rivalry in wealth and children. It is as a rain whose vegetation pleases the unbelievers; then it withers, and thou seest it turning yellow, then it becomes broken orts. And in the world to come there is a terrible chastisement, and forgiveness from God and good pleasure; and the present life is but the joy of delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that the life of the world is only play, and idle talk, and pageantry, and boasting among you, and rivalry in respect of wealth and children; as the likeness of vegetation after rain, whereof the growth is pleasing to the husbandman, but afterward it drieth up and thou seest it turning yellow, then it becometh straw. And in the Hereafter there is grievous punishment, and (also) forgiveness from Allah and His good pleasure, whereas the life of the world is but matter of illusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never forget that the life of this world is only a game and a passing delight, a show, and mutual boasting and trying to outrival each other in riches and children. It is like the growth of vegetation after the rain, which delights the planter, but which then withers away, turns yellow and becomes worthless stubble. In the life to come there will be a terrible punishment, or God's forgiveness and approval: the life of this world is nothing but means of deception.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that the life of the world is but a play and a pastime, and an adornment and a self-glorification among you and vying in respect of riches and children; as the likeness of vegetation after rains whereof the growth pleaseth the husbandmen, then it withereth and thou seest it becoming yellow, then it becometh chaff. And in the Hereafter there is both a grievous torment and forgiveness from Allah and His pleasure, and the life of the world is but a vain bauble.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that the life of this world is mere diversion and play, glamour and mutual vainglory among you and rivalry for wealth and children—like rain, whose growth impresses the farmer. Then it withers and you see it turn yellow, then it becomes chaff. Whereas in the Hereafter there is forgiveness from Allah and His approval and a severe punishment. The life of this world is nothing but the wares of delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know ye (all), that the life of this world is but play and amusement, pomp and mutual boasting and multiplying, (in rivalry) among yourselves, riches and children. Here is a similitude: How rain and the growth which it brings forth, delight (the hearts of) the tillers; soon it withers; thou wilt see it grow yellow; then it becomes dry and crumbles away. But in the Hereafter is a Penalty severe (for the devotees of wrong). And Forgiveness from Allah and (His) Good Pleasure (for the devotees of Allah). And what is the life of this world, but goods and chattels of deception?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that the life of this world is only play and amusement, pomp and mutual boasting among you, and rivalry in respect of wealth and children, as the likeness of vegetation after rain, thereof the growth is pleasing to the tiller; afterwards it dries up and you see it turning yellow; then it becomes straw. But in the Hereafter (there is) a severe torment (for the disbelievers, evil-doers), and (there is) Forgiveness from Allah and (His) Good Pleasure (for the believers, good-doers), whereas the life of this world is only a deceiving enjoyment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that the life of this world is but play and an amusement, and adornment, and a cause for boasting among you, a rivalry for greater riches and children. It is like rain whose vegetation pleases the unbelievers, but then it withers and turns yellow, becoming broken stubble. In the Everlasting Life is a terrible punishment, forgiveness, and great pleasure from Allah. The life of this world is nothing except the joy of delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that the worldly life is only play, and distraction, and glitter, and boasting among you, and rivalry in wealth and children. It is like a rainfall that produces plants, and delights the disbelievers. But then it withers, and you see it yellowing, and then it becomes debris. While in the Hereafter there is severe agony, and forgiveness from God, and acceptance. The life of this world is nothing but enjoyment of vanity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know that the life of this world is but amusement and diversion and adornment and boasting to one another and competition in increase of wealth and children - like the example of a rain whose [resulting] plant growth pleases the tillers; then it dries and you see it turned yellow; then it becomes [scattered] debris. And in the Hereafter is severe punishment and forgiveness from Allah and approval. And what is the worldly life except the enjoyment of delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:20] Know that the life of this world is merely play and diversion and glitter, the frequent adornment [of oneself], and mutual vainglory in respect of wealth and children, that is, preoccupation with such things — but as for acts of obedience and incentives thereto, these are the concerns of the Hereafter; as the likeness of, that is to say, it, in the manner in which you admire it and in the manner in which it will disappear, is as the likeness of, rain whose vegetation, which results from this [rain], the disbelievers, the sowers, admire; [but] then it withers, it becomes dried-up, and you see it turn yellow, then it becomes chaff, scatters vanishing with the winds. And in the Hereafter there is a severe chastisement, for those who prefer this world to it, and forgiveness from God and beatitude, for those who have not preferred this world to it; and the life of this world, that is to say, the comfort [enjoyed] in it, is but the comfort of delusion.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاعْلَمُوا أَنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ وَزِينَةٌ وَتَفَاخُرٌ بَيْنَكُمْ وَتَكَاثُرٌ فِي الْأَمْوَالِ وَالْأَوْلَادِ كَمَثَلِ غَيْثٍ أَعْجَبَ الْكُفَّارَ نَبَاتُهُ ثُمَّ يَهِيجُ فَتَرَاهُ مُصْفَرًّا ثُمَّ يَكُونُ حُطَامًا وَفِي الْآَخِرَةِ عَذَابٌ شَدِيدٌ وَمَغْفِرَةٌ مِنَ اللَّهِ وَرِضْوَانٌ وَمَا الْحَيَاةُ الدُّنْيَا إِلَّا مَتَاعُ الْغُرُورِ (20){ اعلموا أَنَّمَا الحياة الدنيا لَعِبٌ وَلَهْوٌ وَزِينَةٌ وَتَفَاخُرٌ بَيْنَكُمْ وَتَكَاثُرٌ فِى الاموال والاولاد } .أعقب التحريض على الصدقات والإِنفاققِ بالإِشارة إلى دحض سبب الشح أنه الحرص على استبقاء المال لإِنْفَاقَه في لذائذ الحياة الدنيا ، فضُرب لهم مثلُ الحياة الدنيا بحاللٍ محقَّرة على أنها زائلة تحقيراً لحاصلها وتزهيداً فيها لأن التعلق بها يعوق عن الفَلاَح قال تعالى : { ومن يوق شح نفسه فأولئك هم المفلحون } \\[ الحشر : 9 \\] ، وقال : { وأحضرت الأنفس الشح وإن تحسنوا وتتقوا فإن الله كان بما تعملون خبيراً } \\[ النساء : 128 \\] .كل ذلك في سياق الحث على الإنفاق الواجب وغيره ، وأشير إلى أنها ينبغي أن تتخذ الحياة وسيلة للنعيم الدائم في الآخرة ، ووقاية من العذاب الشديد ، وما عدا ذلك من أحوال الحياة فهو متاع قليل ، ولذلك أعقب مثل الحياة الدنيا بالإِخبار عن الآخرة بقوله : «في الآخرة عذاب» الخ .وافتتاح هذا بقوله تعالى : { اعلموا } للوجه الذي بيناه آنفاً في قوله : { اعلموا أن الله يحيي الأرض بعد موتها } \\[ الحديد : 17 \\] .و { أَنَّمَا } المفتوحةُ الهمزة أخت ( إنما ) المكسورة الهمزة في إفادة الحصر ، وحصر الحياة الدنيا في الأخبار الجارية عليها هو قصر أحوال الناس في الحياة على هذه الأمور الستة باعتبار غالب الناس ، فهو قصر ادعائي بالنظر إلى ما تنصرف إليه همم غالب الناس من شؤون الحياة الدنيا ، والتي إن سلم بعضهم من بعضها لا يخلو من ملابسة بعض آخر إلا الذين عصمهم الله تعالى فجعل أعمالهم في الحياة كلها لوجه الله ، وإلا فإن الحياة قد يكون فيها أعمال التقى والمنافع والإحسان والتأييد للحق وتعليم الفضائل وتشريع القوانين .وقد ذكر هنا من شؤون الحياة ما هو الغالب على الناس وما لا يخلو من مقارفة تضييع الغايات الشريفة أو اقتحام مساوٍ ذميمة ، وهي أصول أحوال المجتمع في الحياة ، وهي أيضاً أصول أطوار آحاد الناس في تطور كل واحد منهم ، فإن اللعب طور سِنّ الطفولة والصبا ، واللهوَ طور الشباب ، والزينة طور الفتوة ، والتفاخرَ طور الكهولة ، والتكاثر طور الشيخوخة . وذكر هنا خمسة أشياء :فاللعب : اسم لقول أو فعل يراد به المزح والهزل لتمضية الوقت أو إزالة وحشة الوحدة ، أو السكون ، أو السكوت ، أو لجلب فرح ومسرة للنفس ، أو يجلب مثل ذلك للحبيب ، أو يجلب ضده للبغيض ، كإعمال الأعضاء وتحريكها دفعاً لوحشة السكون ، والهذيان المقصود لدفع وحشة السكوت ، ومنه العبث ، وكالمزح مع المرأة لاجتلاب إقبالها ومع الطفل تحبباً أو إرضاء له .واللعب : هو الغالب على أعمال الأطفال والصبيان فطور الطفولة طور اللعب ويتفاوت غيرهم في الإِتيان منه فيقل ويكثر بحسب تفاوت الناس في الأطوار الأولى من الإِنسان وفي رجاحة العقول وضعفها . والإِفراط فيه من غير أصحاب طوره يؤذن بخسة العقل ، ولذلك قال قوم إبراهيم له :{ أجئتنا بالحق أم أنت من اللاعبين } \\[ الأنبياء : 55 \\] . واللعب يكثر في أحوال الناس في الدنيا فهو جزء عظيم من أحوالها وحسبك أنه يَعمُر معظم أحوال الصبا .واللهو : اسم لفعل أو قول يقصد منه التذاذ النفس به وصرفها عن ألم حاصل من تعب الجسد أو الحزن أو الكمد ، يقال : لها عن الشيء ، أي تشاغل عنه . قال امرؤ القيس :وبيضة خدر لا يرام خِباؤها ... تمتعتُ من لَهْو بها غيرَ معجَلوقال النابغة يذكر حجه :حيَّاككِ ربي فإنا لا يحل لنا ... لَهْوُ النساء وإن الدِّين قد عَزَماويغلب اللهو على أحوال الشباب فطور الشباب طوره ، ويكثر اللهو في أحوال الدنيا من تطلب اللذات والطرب .والزينة : تحسين الذات أو المكان بما يجعل وقعه عند ناظره مُسراً له ، وفي طباع الناس الرغبة في أن تكون مناظرهم حسنة في عين ناظريهم وذلك في طباع النساء أشد ، وربّما كان من أسباب شدته فيهن كثرةُ إغراء الرجال لهن بذلك .ويكثر التزين في طور الفتوة لأن الرجل يشعر بابتداء زوال محاسن شبابه ، والمرأة التي كانت غانية تحب أن تكون حالِيَة ، وليس ذلك لأجل تعرضها للرجال كما يتوهمه الرجال فيهن غروراً بأنفسهم بل ذلك لتكون حسنة في الناس من الرجال والنساء .ويغلب التزين على أحوال الحياة فإن معظم المساكن والملابس يراد منه الزينة ، وهي ذاتية ومعنوية ، ومن المعنوية ما يسمى في أصول الفقه بالتحسيني .والتفاخر : الكلام الذي يفخر به ، والفخر : حديث المرء عن محامده والصفات المحمودة منها فيه بالحق أو الباطل . وصيغ منه زنة التفاعل لأن شأن الفخر أن يقع بين جانبين كما أنبأ به تقييده بظرف { بينكم } .والناس يتفاخرون بالصفات المحمودة في عصورهم وأجيالهم وعاداتهم ، فمن الصفات ما الفخر به غير باطل . وهو الصفات التي حقائقها محمودة في العقل أو الشرع . ومنها ما الفخر به باطل من الصفات والأعمال التي اصطلح قوم على التمدح بها وليست حقيقة بالمدح مثل التفاخر بالإِغلاء في ثمن الخمور وفي الميسر والزنى والفخر بقتل النفوس والغارة على الأموال في غير حق .وأغلب التفاخر في طور الكهولة واكتمال الاشُدَّ لأنه زمن الإِقبال على الأفعال التي يقصد منها الفخر .والتفاخر كثير في أحوال الناس في الدنيا ، ومنه التباهي والعُجب ، وعنه ينشأ الحسد .والتكاثر : تفاعل من الكثرة ، وصيغة التفاعل هنا للمبالغة في الفعل بحيث ينزل منزلة من يغالب غيره في كثرة شيء ، فإنه يكون أحرص على أن يكون الأكثر منه عنده فكان المرء ينظر في الكثرة من الأمر المحبوب إلى امرىء آخر له الكثرة منه ، ألا ترى إلى قول طرفة :فلو شاء ربي كنت قيس بن عاصم ... ولو شاء ربي كنت عمرو بن مَرثدفأصبحت ذا مال كثير وطافَ بي ... بنونَ كرامٌ سَادة لمسوَّدثم شاع إطلاق صيغة التكاثر فصارت تستعمل في الحرص على تحصيل الكثير من غير مراعاة مغالبة الغير ممن حصل عليه ، قال تعالى :{ ألهاكم التكاثر } \\[ التكاثر : 1 \\] .و { في } من قوله : { في الأموال والأولاد } : إما مستعملة في التعليل ، وإما هي الظرفية المجازية ، فإن جُعلت الأموال كالظرف يحصل تكاثر الناس عنده كمن ينزع في بئر .والمعنى : أن الله أقام نظام أحوال الناس في الحياة الدنيا على حكمة أن تكون الحياة وسيلة لبلوغ النفوس إلى ما هيّأَها الله له من العروج إلى سمو المَلَكِيَّة كما دل عليه قوله : { إني جاعل في الأرض خليفة } \\[ البقرة : 30 \\] ، فكان نظام هذه الحياة على أن تجري أمور الناس فيها على حسب تعاليم الهدى للفوز بالحياة الأبدية في النعيم الحق بعد الممات والبعث ، فإذا الناسُ قد حرفوها عن مهيعها ، وقد تضمن ذلك قوله تعالى : { من عمل صالحاً من ذكر أو أنثى وهو مؤمن فلنحيينه حياة طيبة ولنجزينهم أجرهم بأحسن ما كانوا يعملون } \\[ النحل : 97 \\] .{ والاولاد كَمَثَلِ غَيْثٍ أَعْجَبَ الكفار نَبَاتُهُ ثُمَّ يَهِيجُ فَتَرَاهُ مُصْفَرّاً ثُمَّ يَكُونُ } .يجوز أن يكون في موضع خبر من مبتدأ محذوف ، أي هي كمثللِ غيث فتكون الجملة استئنافاً ، وحَذفُ المسند إليه من النوع الذي سماه السكاكي «متابعةَ الاستعمال» .ويجوز أن يكون الكاف في موضع الحال و { كمثل } معناه كحال ، أي حال الحياة الدنيا كحال غيث الخ ، فشبهت هيئة أهل الدنيا في أحوالهم الغالبة عليهم والمشار إلى تنويعها بقوله : { لعب ولهو } إلى آخره بهيئة غيث أنبت زرعاً فأينع ثم اصفر ثم اضمحلّ وتحطم ، أي تشبيه هيئة هذه الأحوال الغالبة على الناس في الحياة في كونها محبوبة للناس مزهية لهم وفي سرعة تقضيها بهيئةِ نبات جديد أنبته غيث فاستوى واكتمل وأُعجب به من رآه فمضت عليه مدة فيبس وتحطم .والمقصود بالتمثيل هو النبات ، وإنما ابتدىء بغيث تصويراً للهيئة من مبادئِها لإِظهار مواقع الحسن فيها لأن ذلك يكتسب منه المشبه حُسناً كما فعل كعب بن زهير في تحسين أوصاف الماء الذي مُزجت به الراح في قوله :شُجت بذي شَيم من ماء مَحنية ... صاففٍ بأبطحَ أضحَى وهو مشمولتَنفي الرياحُ القَذى عنه وأفرطَه ... من صَوْب ساريةٍ بيضٌ يعاليلوعن ابن مسعود «أن الكفار : الزُرَّاع ، جمع كافر وهو الزارع لأنه يَكفر الزريعة بتراب الأرض ، والكفر بفتح الكاف الستر ، أي ستر الزريعة ، وإنما أوثر هذا الاسم هنا وقد قال تعالى في سورة \\[ الفتح : 29 \\] : { يعجب الزراع } ، قصدا هنا للتورية بالكفار الذين هم الكافرون بالله لأنهم أشد إعجاباً بمتاع الدنيا إذ لا أمل لهم في شيء بعده . وقال جمع من المفسرين : الكفار جمع الكافر بالله لأنهم قصروا إعجابهم على الأعمال ذات الغايات الدنيا دون الأعمال الدينية ، فذكر الكفار تلويح إلى أن المثل مسوق إلى جانبهم أوّلاً .والنبات : اسم مصدر نَبت قال تعالى : { والله أنبتكم من الأرض نباتاً } \\[ نوح : 17 \\] ، وهو هنا أطلق على النابت من إطلاق المصدر على الفاعل وهو كثير ، وأصله أن يراد به المبالغة ، وقد يشيع فيزول قصد المبالغة به .وقوله : { ثم يهيج } تضافرت كلمات المفسرين على تفسير يهيج ب ( ييبس ) أو يجف ، ولم يستظهروا بشاهد من كلام العرب يدل على أن من معاني الهياج الجفاف ، وقد قال الراغب : يقال : هاج البقل ، إذا اصفَرّ وطاب ، وفي «الأساس» : من المجاز هاج البقل ، إذا أخذ في اليبس . وهذان الإِمامان لم يجعلا ( هاج ) بمعنى ( يبس ) وكيف لفظ الآية { ثم يهيج فتراه مصفراً } ، فالوجه أن الهياج : الغلظ ومقاربة اليبس ، لأن مادة الهياج تدل على الاضطراب والثوران وسميت الحرب الهيجاء ، وقال النابغة :أهاجك من سُعداك مغنى المعاهد ... والزرع إذا غلظ يكون لحركته صوت فكأنه هائج ، أي ثائر وذلك ابتداء جفافه ، وذلك كقوله تعالى : { كزرع أخرج شطأه فئازره فاستغلظ فاستوى على سوقه يعجب الزراع } في سورة \\[ الفتح : 29 \\] .وعطفت جملة يهيج } ب ( ثم ) لإِفادة التراخي الرتبي لأن اصفرار النبات أعظم دلالة على التهيّؤ للزوال ، وهذا هو الأهم في مقام التزهيد في متاع الدنيا .وعطف { فتراه مصفراً } بالفاء لأن اصفرار النبت مقارب ليبسه ، وعطف { ثم يكون حطاماً } ب ( ثم ) كعطف { ثم يهيج } .والحُطام : بضم الحاء ما حطم ، أي كُسر قطعاً .فضرب مثل الحياة الدنيا لأطوار ما فيها من شباب وكهولة وهرم ففناء ، ومن جدة وتبذّل وبلى ، ومن إقبال الأمور في زمن إقبالها ثم إدبارها بعد ذلك ، بأطوار الزرع . وكلُّهَا أعراض زائلة وآخرها فناء .وتندرج فيها أطوار المرء في الحياة المذكورة في قوله : { لعب ولهو } إلى { والأولاد } كما يظهر بالتأمل .وهذا التمثيل مع كونه تشبيه هيئة مركّبة بهيئةٍ مثلها هو صالح للتفريق ومقابلة أجزاء الهيئة المشبهة بأجزاء الهيئة المشبه بها ، فيشبَّه أول أطوار الحياة وإقبالها بالنبات عقب المطر ، ويشبّه الناس المنتفعون بإقبال الدنيا بناس زُراع ، ويشبّه اكتمال أحوال الحياة وقوة الكهولة بهياج الزرع ، ويشبّه ابتداء الشخوخة ثم الهرم وابتداء ضعف عمل العامل وتجارة التاجر وفلاحة الفلاح باصفرار الزرع وتهيئه للفناء ، ويشبه زوال ما كان للمرء من قوة ومال بتحطم الزرع .ويفهم من هذا أن ما كان من أحوال الحياة مقصوداً لوجه الله فإنه من شؤون الآخرة فلا يدخل تحت هذا التمثيل إلا ظاهراً . فأعمال البِر ودراسة العلم ونحو ذلك لا يعتريها نقصٌ ما دام صاحبها مقبلاً عليها ، وبعضها يزداد نماء بطول المدة ، وتقدم نظير هذه الآية في سورة الزمر .ه4س57ش20ن25/ن38-->حُطَاماً وَفِى الاخرة عَذَابٌ شَدِيدٌ وَمَغْفِرَةٌ مِّنَ الله ورضوان وَمَا الحياة الدنيآ إِلاَّ متاع } .كان ذكر حال الحياة الدنيا مقتضياً ذكر مقابلة على عادة القرآن ، والخبرُ مستعمل في التحذير والتحريض بقرينة السياق ، ولذلك لم يبين أصحاب العذاب وأصحاب المغفرة والرضوان لظهور ذلك .وكنِيَ عن النعيم بمغفرة من الله ورضوان لأن النعيم قسمان مادي وروحاني ، فالمغفرةَ والرضوان أصل النعيم الروحاني كما قال تعالى :{ ورضوان من الله أكبر } \\[ التوبة : 72 \\] وهما يقتضيان النعيم الجسماني لأن أهل الجنة لما ركبت ذواتهم من أجسام وأودعت فيها الأرواح كان النعيمان مناسبين لهم تكثيراً للذات ، وما لذة الأجسام إلا صائرة إلى الأرواح لأنها المدركة اللذات ، وكان رضوان الله يقتضي إعطائهم منتهى ما به التذاذهم ، ومغفرته مقتضية الصفح عما قد يعوق عن بعض ذلك .وعطف { وما الحياة الدنيا إلاَّ متاع الغرور } على { وفي الآخرة عذاب شديد } للمقابلة بين الحالين زيادة في الترغيب والتنفير .والكلام على تقدير مضاف ، أي وما أحوال الحياة الدنيا إلا متاع الغرور .والحصر ادعائي باعتبار غالب أحوال الدنيا بالنسبة إلى غالب طالبيها ، فكونها متاعاً أمر مطرد وكون المتاع مضافاً إلى الغرور أمر غالب بالنسبة لما عدا الأعمال العائدة على المرء بالفوز في الآخرة .والغُرور : الخديعة ، أي إظهار الأمر الضار الذي من شأنه أن يحترز العاقل منه في صورة النافع الذي يرغب فيه .وإضافة { متاع } إلى { الغرور } على معنى لام العاقبة ، أي متاع صائر لأجل الغرور به ، أي آيل إلى أنه يغرّ الناظرين إليه فيسرعون في التعلق به .\n\n",
      "translations": [
        {
          "translation": "650 (Know that the life of this world) that which is in the life of this world (is only play) exultation, (and idle talk) falsehood, (and pageantry) an appearance, (and boasting among you) regarding status and lineage, (and rivalry about wealth and children) which will vanish and not last; (as the likeness of vegetation after rain, whereof the growth is pleasing to the husbandman, but afterward it drieth up and thou seest it turning yellow) after having been green (then it becometh straw) in the same vein, the life of the world will not last just as this vegetation did not. (And in the Hereafter there is grievous punishment) for he who abstains from obeying Allah and withholds the right of Allah, (and (also) forgiveness from Allah and His good pleasure) in the Hereafter, for he who obeys Allah and fulfils Allah's right over his wealth, (whereas the life of the world) i.e. concerning its lastingness and evanescence (is but matter of illusion) like the illusion surrounding the utilities of the house such as plates and bowls.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ يَهِيجُ } معناه ييبسُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Then it will fade away\" - its meaning is that it will fade away.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱعْلَمُوۤاْ } أيها المكلفون المعتبرون { أَنَّمَا ٱلْحَيَٰوةُ ٱلدُّنْيَا } أي: ما الحياة المستعارة الدنيوية\n وما حاصلها وجلّ متاعها إلاَّ { لَعِبٌ } مزخرف باطل في نفسها\n يلعب بها أهل الغفلة والحجاب\n ويتعبون بها أنفسهم بلا طائل { وَلَهْوٌ } يلهيهم عما يهمهم ويعينهم من الحياة الأزلية الأبدية ولوازمها { وَزِينَةٌ } زيَّنها لهم شياطين قواهم وأمانيهم من المطاعم الشهية\n والملابس البهية\n واللذات الوهمية\n والشهوات البهيمية { وَتَفَاخُرٌ بَيْنَكُمْ } بالمال والجاه والثروة\n والسيادة بالأنساب والأحساب { وَتَكَاثُرٌ فِي ٱلأَمْوَٰلِ وَٱلأَوْلَٰدِ } بالمظاهرة والمعاونة\n وتكثير العدد والعدَدد والعُدد\n والعقارات والتجارات\n والمواشي والزراعات إلى غير ذلك من المزخرفات الفانية التي لا قراره لها ولا مدار\n بل مَثَلُها { كَمَثَلِ غَيْثٍ } نزل وأنبت إنباتاً { أَعْجَبَ ٱلْكُفَّارَ } أي: الزرَّاع { نَبَاتُهُ } من كثرته ونضارته وكثفاته { ثُمَّ يَهِيجُ } يجف وييبس بآفة وعاهة { فَتَرَٰهُ مُصْفَرّاً } بعدما كان مخضراً في كمال البهجة والنضارة { ثُمَّ يَكُونُ حُطَٰماً } هشيماً تذروه الرياح حيث شاءت بلا فائدة ولا عائدة\n\n\n{ وَ } مع هذه الخسارة الحرمان في النشأة الأولى لأهل الغفلة والخذلان يكون لهم { فِي ٱلآخِرَةِ } المعدة للجزاء { عَذَابٌ شَدِيدٌ } لاشتغالهم بالدنيا وما فيها { وَ } بالجملة: { مَغْفِرَةٌ } سترٌ ومحوٌ لذنوب أصحاب المعاملات\n ناشئة { مِّنَ ٱللَّهِ } الغفور الرحيم بمقتضى لطفه\n وسعة رحمته وجوده { وَرِضْوَٰنٌ } منه سبحانه لأرباب القلوب والمكاشفات خير من الدنيا وما فيها بأضعافها وآلافها عند من تحقق تربية الإنسان\n وسعة قلبه المصور على صور عرش الرحمن { وَ } بالجملة: { مَا ٱلْحَيَٰوةُ ٱلدُّنْيَآ } عند الأحرار البالغين بدرجة الاعتبار والاستبصار { إِلاَّ مَتَٰعُ ٱلْغُرُورِ } [الحديد: 20] ومخائل الخديعة والزور\n ومن اغتر بها ولعب بما فيها فقد استحق الويل والثبور\n وحرم عليه الحضور والسرور\n\n\nومتى سمعتم أيها المؤمنون المعتبرون حال الدنيا ومآلها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { اعْلَموا أنما الحياةُ الدنيا لَعِبٌ } كلعب الصبيان\n { وَلَهوٌ } كلهو الفتيان\n { وزِينَةٌ } كزينة النسوان\n { وتفاخر بينكم } كتفاخر الأقران\n { وتكاثرٌ } كتكاثر الدهقان - أي الفلاحين - { في الأموال والأولاد } أي: مباهاة بهما\n والتكاثر: الاستكثار\n والحاصل: أنها من محقرات الأمور التي لا يركن إليها العقلاء\n فضلاً عن الاطمئنان بها\n وأنها مع ذلك سريعة الزوال\n وشيكة الاضمحلال\n ولذلك قال: { كَمَثَل غيثٍ أعجَبَ الكفَّارَ } أي: الحُرّاث\n من: كَفَرَ الحبَ: ستره\n ويقال: كفرت الغمامُ النجومَ: سترتها\n أي: أعجب الزراع { نباتُه } أي: النبات الحاصل منه\n { ثم يَهيجُ } أي: يجف بعد خضرته ونضارته\n { فتراه مُصْفراً } بعد ما رأيته ناضراً مونِعاً\n وإنما لم يقل: ثم تراه إيذاناً بأنّ اصفراره مقارن لجفافه\n { ثم يكون حُطاماً } متفتتاً متكسراً\n شبَّه حالَ الدنيا وسرعة تقضّيها مع قلة جدواها بنباتٍ أنبته الغيث\n فاستوى وقوي\n وأعجب به حُرّاثه\n أو: الكفار الجاحدون لنعمة الله تعالى فيما رزقهم من الغيث والنبات\n فبعث عليه العاهة\n فهاج\n واصفرّ وصار حطاماً\n وهذا المثل هو لمَن اشتغل بالدنيا\n والجري عليها\n وأمّا ما كان منها في طاعة الله\n أو في الضرورات التي تُقيم الأولاد\n وتُعين الطاعات\n فلا يدخل في هذا المثل\n وهذا مثال للإنسان ينشأ شابّاً قويّاً\n حَسن المنظر والهيئة\n ثم يأخذ في النقص والهرم\n ثم يموت\n ويضمحل أمره\n وتصير الأموال لغيره\n قال القشيري: الدنيا حقيرة\n وأحقرُ منها قَدْراً: طالبُها\n وأقلُّ منها خَطَراً: المُزاحِم فيها\n فما هي إلاّ جيفة\n وطلاب الجيفةِ ليس لهم خطر\n وأخسُّهم مَن يبخل بها\n وهذه الدنيا المذمومة هي ما شَغَل العبد عن الآخرة\n فكل ما شغله عن الآخرة فهي الدنيا\n هـ\n { وفي الآخرةِ عذابٌ شديدٌ } لمَن أعرض عن الله\n { ومغفرةٌ من الله ورضوانٌ } لمَن أقبل على الله\n وزهد فيما سواه\n والحاصل: أنّ الدنيا ليست إلاَّ محقراتٍ من الأمور\n وهي اللعب\n واللهو\n والزينة\n والتفاخر\n والتكاثر\n وأمّا الآخرة فما هي إلا أمورٌ عِظام\n وهي العذاب الشديد\n والمغفرة\n والرضوان من الله الحميد\n والكاف في \" كَمَثَلِ \" في محل رفع\n خبر بعد خبر\n { وما الحياةُ الدنيا إِلا متاعُ الغُرور } لمَن ركن إليها\n واعتمد عليها\n ومتاع الغرور: هو الذي يظهر ما حسن منه\n ويبطن ما قبح\n يفعله مَن يغر الناس ويغشهم\n وكذلك الدنيا تُظهر لطلابها حلاوةً ووَلُوعاً\n وتزداد عليهم شيئاً فشيئاً\n فينهمكون في حلاوة شهواتها وبهجتها\n ويغفلون عن الاستعداد\n والعمر يفنى من يدهم في البطالة\n فهي تغرهم وتخدعهم حتى تسوقهم إلى الموت مفلسين\n قال ذو النون: يا معشر المريدين لا تطلبوا الدنيا\n وإن طلبتموها فلا تحبوها\n فإنّ الزاد منها\n والمَقيل في غيرها\n ولمَّا حقَّر الدنيا\n وصغّ أمرها\n وعظّم أمر الآخرة\n حَثَّ عبادَه على المسارعة إلى نيل ما وَعَد من ذلك\n وهي المغفرة والرضوان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:21",
      "similarity": 0.501836048908292
    },
    {
      "verse": "31:34",
      "similarity": 0.23475031619192271
    },
    {
      "verse": "42:28",
      "similarity": 0.23017471564687272
    },
    {
      "verse": "12:49",
      "similarity": 0.22235564264099664
    },
    {
      "verse": "30:51",
      "similarity": 0.21192796911360948
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/057020.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/057020.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/57:20.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}