{
  "chapter": "الحديد",
  "text": "ما اصاب من مصيبة فى الارض ولا فى انفسكم الا فى كتب من قبل ان نبراها ان ذلك على الله يسير",
  "translations": [
    {
      "translation": "Nothing occurs, either in the earth or in yourselves, without its being in a Book before We make it happen. That is something easy for Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no calamity that befalls the earth or your own selves but in accordance with the law (of causation) before We make it evident. This is indeed how the law of God works inevitably.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No misfortune ever befalls on earth, nor on yourselves but We have inscribed it in the Book before We make it manifest. Surely that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever hardships you face on earth and in your souls were written in the Book before the creation of the souls. This is certainly easy for God\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no misfortune that reaches in the earth or in your selves but is mentioned in a Book, before We initiate it; indeed this is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No calamity occurs in the earth nor in yourselves but it is inscribed in the Book of Decrees before We bring it into existence. Verily, that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No evil befalls on the earth nor in your own souls, but it is in a book before We bring it into existence; surely that is easy to Allah:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No affliction befalls in the earth or in yourselves, but it is in a Book, before We create it; that is easy for God;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Naught of disaster befalleth in the earth or in yourselves but it is in a Book before we bring it into being - Lo! that is easy for Allah -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No misfortune can affect the earth or your own selves without its first having been recorded in a book, before We bring it into being. That is easy for God to do;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Naught of distress befalleth the earth or your persons but it is inscribed in the Book even before We have created them. Verily with Allahs that is easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No affliction visits the land or yourselves but it is in a Book before We bring it about—that is indeed easy for Allah—\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No misfortune can happen on earth or in your souls but is recorded in a decree before We bring it into existence: That is truly easy for Allah:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No calamity befalls on the earth or in yourselves but is inscribed in the Book of Decrees (Al-Lauh Al-Mahfuz), before We bring it into existence. Verily, that is easy for Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No affliction can befall either the earth, or yourself, except that it is (written) in a Book before We created it. That is easy for Allah;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No calamity occurs on earth, or in your souls, but it is in a Book, even before We make it happen. That is easy for God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No disaster strikes upon the earth or among yourselves except that it is in a register before We bring it into being - indeed that, for Allah, is easy -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:22] No affliction befalls in the earth, by way of drought [for example], or in yourselves, such as illness, or the loss of a child, but it is in a Book, meaning, the Preserved Tablet (al-lawh al-mahfūz), before We bring it about, [before] We create it — the same is said [to be true] of [God’s] graces — that is indeed easy for God,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمَا أَصَابَ مِنْ مُصِيبَةٍ فِي الْأَرْضِ وَلَا فِي أَنْفُسِكُمْ إِلَّا فِي كِتَابٍ مِنْ قَبْلِ أَنْ نَبْرَأَهَا إِنَّ ذَلِكَ عَلَى اللَّهِ يَسِيرٌ (22) لما جرى ذكر الجهاد آنفاً بقوله : { لا يستوى منكم من أنفق من قبل الفتح وقاتل } \\[ الحديد : 10 \\] وقوله : { والشهداء عند ربهم لهم أجرهم ونورهم } \\[ الحديد : 19 \\] على الوجهين المتقدمين هنالك ، وجرى ذكر الدنيا في قوله : { وما الحياة الدنيا إلا متاع الغروب } \\[ الحديد : 20 \\] وكان ذلك كله مما تحدُث فيه المصائب من قتل وقطع وأسر في الجهاد ، ومن كوارث تعرض في الحياة من فقد وألم واحتياج ، وجرى مَثَل الحياة الدنيا بالنّبات ، وكان ذلك ما يعرض له القحط والجوائح ، أُتبع ذلك بتسلية المسلمين على ما يصيبهم لأن المسلمين كانوا قد تخلقوا بآداب الدنيا من قبلُ فربما لحقهم ضر أو رزء خارج عن نطاق قدرتهم وَكسبهم فأعلموا أن ذلك مما اقتضاه ارتباط أسباب الحوادث بعضها ببعض على ما سيرها عليه نظام جميع الكائنات في هذا العالم كما أشار إليه قوله تعالى : { إلا في كتاب من قبل أن نبرأها } \\[ الحديد : 22 \\] كما ستعلمه ، فلم يملكهم الغم والحزن ، وانتقلوا عن ذلك إلى الإقبال على ما يهمهم من الأمور ولم يلهمهم التحرق على ما فات على نحو ما وقع في قوله : { ولا تقولوا لمن يقتل في سبيل الله أموات بل أحياء ولكن لا تشعرون ولنبلونكم بشيء من الخوف والجوع ونقص من الأموال والأنفس والثمرات وبشر الصابرين الذين إذا أصابتهم مصيبة قالوا إنا لله وإنا إليه راجعون } \\[ البقرة : 154 156 \\] ، ولعل المسلمين قد أصابتهم شدة في إحدى المغازي أو حبس مطر أو نحو ذلكم مما كان سبب نزول هذه الآية .و ( ما ) نافية و ( من ) زائدة في النفي للدلالة على نفي الجنس قصداً للعموم .ومفعول { أصاب } محذوف تقديره : ما أصابكم أو ما أصاب أحداً .وقوله : { في الأرض } إشارة إلى المصائب العامة كالقحط وفيضان السيول وموتان الأنعام وتلف الأموال .وقوله : { ولا في أنفسكم } إشارة إلى المصائب اللاحقة لذوات الناس من الأمراض وقطع الأعضاء والأسر في الحرب وموت الأحباب وموت المرء نفسه فقد سماه الله مصيبة في قوله : { فأصابتكم مصيبة الموت } \\[ المائدة : 106 \\] . وتكرير حرف النفي في المعطوف على المنفي في قوله : { ولا في أنفسكم } لقصد الاهتمام بذلك المذكور بخصوصه فإن المصائب الخاصة بالنفس أشد وقعاً على المصاب ، فإن المصائب العامة إذا اخْطأَتْه فإنما يتأثر لها تأثراً بالتعقل لا بالحسّ فلا تدوم ملاحظة النفس إياه .والاستثناء في قوله : { إلا في كتاب } استثناء من أحوال منفية ب ( ما ) ، إذ التقدير : ما أصاب من مصيبة في الأرض كائنة في حال إلا في حال كونها مكتوبة في كتاب ، أي مثبتة فيه .والكتاب : مجاز عن علم الله تعالى ووجه المشابهة عدم قبوله التبديل والتغيير والتخلف ، قال الحارث بن حلزة: ... حذر الجور والتطاخي وهلينْقض ما في المهارق الأهواء ... ومن ذلك علمه وتقديره لأسباب حصولها ووقت خلقها وترتب آثارها والقصر المفاد ب ( إلاّ ) قصر موصوف على صفة وهو قصر إضافي ، أي إلا في حال كونها في كتاب دون عدم سبق تقديرها في علم الله ردّاً على اعتقاد المشركين والمنافقين المذكور في قوله تعالى :{ وقالوا لإخوانهم إذا ضربوا في الأرض أو كانوا غزى لو كانوا عندنا ما ماتوا وما قتلوا } \\[ آل عمران : 156 \\] وقوله : { الذين قالوا لإخوانهم وقعدوا لو أطاعونا ما قتلوا } \\[ آل عمران : 168 \\] . وهذا الكلام يجمع الإِشارة إلى ما قدمناه من أن الله تعالى وضع نظام هذا العالم على أن تترتب المسببات على أسبابها ، وقدر ذلك وعلمه ، وهذا مثل قوله : { وما يعمر من معمر ولا ينقص من عمره إلا في كتاب } \\[ فاطر : 11 \\] ونحو ذلك .والبرءُ : بفتح الباء : الخَلْق ومن أسمائه تعالى البارىء ، وضمير النصب في { نبرأها } عائد إلى الأرض أو إلى الأنفس .وجملة { إن ذلك على الله يسير } ردّ على أهل الضلال من المشركين وبعض أهل الكتاب الذين لا يثبتون لله عموم العلم ويجوّزون عليه البَداء وتمشّي الحِيَل ، ولأجل قصد الرد على المنكرين أكد الخبر ب ( إنّ ) .\n\n",
      "translations": [
        {
          "translation": "(Naught of disaster befalleth in the earth) such as drought, dryness of land, rise in prices and continuous hunger (or in yourselves) such as sicknesses, pains, misfortunes, the death of one's family members and children and loss of wealth (but it is in a Book) He says: all this is decreed upon you and recorded in the Guarded Tablet (before We bring it into being) before they befall the earth or your own selves. (Lo! That) the recording of that (is easy for Allah) even without a record, but everything is recorded.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِّن قَبْلِ أَن نَّبْرَأَهَآ } معناه نَخلُقُها\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - Exalted is He: {Before We bring it into existence} - His meaning is that We create it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ { مَآ أَصَابَ مِن مُّصِيبَةٍ } أي: ما حدث من حادثة مفرحة أو موحشة\n كائنة { فِي ٱلأَرْضِ } أي: في أقطار الآفاق من الخصب والرخاء\n والزلزلة والوباء إلى غير ذلك من المفرحات والموحشات الحادثة في الأنحاء والأرجاء { وَلاَ } كائنة { فِيۤ أَنفُسِكُمْ } من العوارض المسرة\n والشهوات الملذة\n أو من الأمراض والملمات المؤلمة { إِلاَّ } ثبت حدوثها في ساعة كذا\n في آن كذا\n على وجه كذا { فِي كِتَٰبٍ } أي: في حضرة العلم الإلهي ولوح قضائه على اختلاف العبارات { مِّن قَبْلِ أَن نَّبْرَأَهَآ } نخلقها ونظهرها\n أي: ثبت حدوث الحادثة في وقتها في كتابنا قبل أن تخلق الحادثة بزمان لا يعلم أحد مقداره إلاَّ نحن\n ولا تستبعدوا من قدرتنا أمثال هذا { إِنَّ ذَٰلِكَ } الثبت والتقدير السابق\n وإن كان عندكم عسير { عَلَى ٱللَّهِ } القادر المقتدر\n الغالب على عموم المقدورات { يَسِيرٌ } [الحديد: 22] سهل في جانب قدرته وإرادته\n\n\nوالسر في ثبتها قبل خلقها: { لِّكَيْلاَ تَأْسَوْاْ } ولا تحزنوا أيها المجبولون على فطرة الكفران { عَلَىٰ مَا فَاتَكُمْ } من اللذات والشهوات المرغوبة { وَلاَ تَفْرَحُواْ بِمَآ آتَاكُمْ } منها\n ليكون فرحكم سبباً لكبركم وخيلائكم على ضعفاء الأنام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { في الأرض }: نعت لمصيبة\n أي: كائنة في الأرض\n وفي كتاب: حال\n يقول الحق جلّ جلاله: { ما أصاب من مصيبةٍ في الأرض } من الجدب وآفات الزروع والفواكه\n { ولا في أنفُسِكُم } من الأمراض والأوصاب وموت الأولاد { إِلاَّ } مكتوب { في كتابٍ } اللوح { من قبل أن نبرأها } أي: مِن قبل أن تخلق الأنفس أو المصائب\n { إِنّ ذلك على الله يسير } أي: إن إثباتها في اللوح سهل على قدرته كلحظة\n وكما كُتبت المصائب\n كُتبت المسرات والمواهب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:53",
      "similarity": 0.5220394657320142
    },
    {
      "verse": "10:41",
      "similarity": 0.5142616358442994
    },
    {
      "verse": "22:70",
      "similarity": 0.5041291046275788
    },
    {
      "verse": "98:7",
      "similarity": 0.48570314481099774
    },
    {
      "verse": "43:26",
      "similarity": 0.4342156238505793
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/057022.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/057022.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/57:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}