{
  "chapter": "الحديد",
  "text": "لئلا يعلم اهل الكتب الا يقدرون على شىء من فضل الله وان الفضل بيد الله يؤتيه من يشاء والله ذو الفضل العظيم",
  "translations": [
    {
      "translation": "So that the People of the Book may know that they have no power at all over any of Allah's favour and that all favour is in the Hand of Allah. He gives it to anyone He wills. Allah's favour is indeed immense.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that the people of the Book may know that they have not the least power over the bounty of God, and that the bounty is wholly in the hands of God to give whosoever He please, for God is the master of infinite bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(You should do this) so that the People of the Book know that they have no control over Allah's Bounty, and that all bounty is in Allah's Hand; He bestows it on whomsoever He pleases. Allah is the Lord of abounding bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Have fear of God and believe in His Messenger) so that the followers of the Bible will know that they can receive no reward from God. They should know that all favors are in the hands of God. He grants them to whomever He wants. The favors of God are great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is so that the disbelievers among People given the Book(s) may know that they do not have any control over Allah’s munificence, and that the munificence is in Allah’s Hand (control) – He bestows to whomever He wills; and Allah is Extremely Munificent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that the People of the Scriptures may know that they have no power whatsoever over the grace of Allah, and that (His) grace is in His Hand to bestow it on whomsoever He wills. And Allah is the Owner of great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that the followers of the Book may know that they do not control aught of the grace of Allah, and that grace is in Allah's hand, He gives it to whom He pleases; and Allah is the Lord of mighty grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that the People of the Book may know that they have no power over anything of God's bounty, and that bounty is in the hand of God; He gives it unto whomsoever He will; and God is of bounty abounding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That the People of the Scripture may know that they control naught of the bounty of Allah, but that the bounty is in Allah's hand to give to whom He will. And Allah is of Infinite Bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The People of the Book should know that they have no power whatsoever over God's grace. His grace is entirely in His hand and He bestows it upon whoever He wills. God is truly infinite in His bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This He will award that the people of the Book may know that they control naught of the grace of Allah, and that the grace is in Allah's hand; He vouchsafeth it Unto whomsoever He wilt, And Allah is Owner of mighty grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that the People of the Book may know that they do not control Allah grace in any wise and that in Allah’s hand is all grace, which He grants to whomever He wishes and Allah is dispenser of a mighty grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That the People of the Book may know that they have no power whatever over the Grace of Allah, that (His) Grace is (entirely) in His Hand, to bestow it on whomsoever He wills. For Allah is the Lord of Grace abounding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that the people of the Scripture (Jews and Christians) may know that they have no power whatsoever over the Grace of Allah, and that (His) Grace is (entirely) in His Hand to bestow it on whomsoever He wills. And Allah is the Owner of Great Bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that the People of the Book may know that they have no power over any of the favors of Allah; that the favors are in the Hand of Allah; He gives it towhom He will. The Favor of Allah is the Great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That the People of the Book may know that they have no power whatsoever over God’s grace, and that all grace is in God’s hand; He gives it to whomever He wills. God is Possessor of Great Grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This is] so that the People of the Scripture may know that they are not able [to obtain] anything from the bounty of Allah and that [all] bounty is in the hand of Allah; He gives it to whom He wills. And Allah is the possessor of great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:29] So that the People of the Scripture, the Torah — those who did not believe in Muhammad (s) — may know, in other words, I inform you of this so that they [the People of the Scripture] may know, that (a [of a-llā] is softened in place of the hardened form [an-lā], its subject being the pronoun of the matter, that is to say, [understand it as being] annahum) they have no power over anything of God’s bounty, contrary to their claims that they are God’s beloved and those who deserve His beatitude, and that [all] bounty is in God’s hand; He gives it to whomever He will, and hence He has given the believers [in the Prophet] among them their reward twofold, as stated above; and God is [dispenser] of tremendous bounty.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلِئَلَّا يَعْلَمَ أَهْلُ الْكِتَابِ أَلَّا يَقْدِرُونَ عَلَى شَيْءٍ مِنْ فَضْلِ اللَّهِ وَأَنَّ الْفَضْلَ بِيَدِ اللَّهِ يُؤْتِيهِ مَنْ يَشَاءُ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ (29)اسم { أهل الكتاب } لقب في القرآن لليهود والنصارى الذين لم يتديّنوا بالإِسلام لأن المراد بالكتاب التوراة والإِنجيل إذا أضيف إليه ( أهل ) ، فلا يطلق على المسلمين : أهل الكتاب ، وإن كان لهم كتاب ، فمن صار مسلماً من اليهود والنصارى لا يوصف بأنه من أهل الكتاب في اصطلاح القرآن ، ولذلك لما وصف عبد الله بن سلام في القرآن وصف بقوله : { ومن عنده علم الكتاب } \\[ الرعد : 43 \\] وقوله : { وشهد شاهد من بني إسرائيل على مثله } \\[ الأحقاف : 10 \\] ، فلما كان المتحدث عنهم آنفاً صاروا مؤمنين بمحمد صلى الله عليه وسلم فقد انسلخ عنهم وصف أهل الكتاب ، فبقي الوصف بذلك خاصاً باليهود والنصارى ، فلما دعا الله الذين اتبعوا المسيح إلى الإيمان برسوله محمد صلى الله عليه وسلم ووعدهم بمضاعفة ثواب ذلك الإِيمان ، أعلمهم أن إيمانهم يُبطل ما ينتحلُه أتباع المسيحية بعد ذلك من الفضل والشرف لأنفسهم بدوامهم على متابعة عيسى عليه السلام فيغالطوا الناس بأنهم إن فاتهم فضل الإِسلام لم يفتهم شيء من الفضل باتباع عيسى مع كونهم لم يغيروا دينهم .وقد أفاد هذا المعنى قوله تعالى : { لئلا يعلم أهل الكتاب ألا يقدرون على شيء من فضل الله } .قال الفخر : قال الواحدي : هذه آية مشكلة وليس للمفسرين كلام واضح في اتصالها بما قبلها اه أي هل هي متصلة بقوله : { يؤتكم كفلين من رحمته } \\[ الحديد : 28 \\] الآية ، أو متصلة { فآتينا الذين آمنوا منهم أجرهم } إلى قوله : { والله ذو الفضل غفور رحيم } \\[ الحديد : 27 ، 28 \\] . يريد الواحدي أن اتصال الآية بما قبلها ينبني عليه معنى قوله تعالى : { لئلا يعلم أهل الكتاب ألا يقدرون على شيء من فضل الله } .فاللام في قوله : { لئلا يعلم أهل الكتاب } يحتمل أن تكون تعليلية فيكون ما بعدها معلولاً بما قبلها ، وعليه فحرف ( لا ) يجوز أن يكون زائداً للتأكيد والتقوية .والمعلَّل هو ما يرجع إلى فضل الله لا محالة وذلك ما تضمنه قوله : { يؤتكم كفلين من رحمته ويجعل لكم نوراً تمشون به ويغفر لكم } أو قوله : { فآتينا الذين آمنوا منهم أجرهم إلى غفور رحيم } \\[ الحديد : 27 ، 28 \\] .وذهب جمهور المفسرين إلى جعل ( لا ) زائدة . وأن المعنى على الإِثبات ، أي لأن يعلم ، وهو قول ابن عباس وقرأ { ليعلم } ، وقرأ أيضاً { لكي يعلم } ( وقراءته تفسير ) . وهذا قول الفرّاء والأخفش ، ودرج عليه الزمخشري في «الكشاف» وابن عطية وابن هشام في «مغني اللبيب» ، وهو بناء على أن ( لا ) قد تقع زائدة وهو ما أثبته الأخفش ، ومنه قوله تعالى : { ما منعك إذ رأيتهم ضلوا أن لا تتبعني } \\[ طه : 92 ، 93 \\] وقوله : { ما منعك أن لا تسجد إذ أمرتك } \\[ الأعراف : 12 \\] وقوله : { فلا أقسم بمواقع النجوم } \\[ الواقعة : 75 \\] ونحو ذلك وقوله : { وحرام على قرية أهلكناها أنهم لا يرجعون } \\[ الأنبياء : 95 \\] على أحد تأويلات ، وروي أن العرب جعلتها حشواً في قول الشاعر أنشده أبو عمرو بن العلاء :أَبَى جُودُه لا البخلَ واستعجلت به«نعم» من فتى لا يمنع الجود قائلُهفي رواية بنصب ( البخل ) ، البخل وأن العرب فسروا البيتَ بمعنى أبَى جودُه البخلَ .والمعنى : على هذا الوجه أن المعلَّل هو تبليغ هذا الخبر إلى أهل الكتاب ليعلموا أن فضل الله أُعطيَ غيرهم فلا يتبجحوا بأنهم على فضل لا ينقص عن فضل غيرهم إذا كان لغيرهم فضل وهو الموافق لتفسير مجاهد وقتادة .وعندي : أنه لا يعطي معنى لأن إخبار القرآن بأن للمسلمين أجرين لا يصدِّق به أهل الكتاب فلا يستقر به علمهم بأنهم لا فضل لهم فكيف يعلل إخبار الله به بأنه يُزيل علم أهل الكتاب بفضل أنفسهم فيعلمون أنهم لا فضل لهم .وذهب أبو مسلم الأصفهاني وتبعه جماعة إلى أن ( لا ) نافية ، وقرره الفخر بأن ضمير { يقدرون } عائد إلى رسول الله صلى الله عليه وسلم والذين آمنوا به ( أي على طريق الالتفات من الخطاب إلى الغيبة وأصله أن لا تقدروا ) وإذا انتفى علم أهل الكتاب بأن الرسول صلى الله عليه وسلم والمسلمين لا يقدرون على شيء من فضل الله ثبت ضد ذلك في علمهم أي كيف أن الرسول صلى الله عليه وسلم والمسلمين يقدرون على فضل الله ، ويكون { يقدرون } مستعاراً لمعنى : ينالون ، وأن الفضل بيد الله ، فهو الذي فضلهم ، ويكون ذلك كناية عن انتفاء الفضل عن أهل الكتاب الذين لم يؤمنوا بالرسول صلى الله عليه وسلمويرد على هذا التفسير ما ورد على الذي قبله لأن علم أهل الكتاب لا يحصل بإخبار القرآن لأنهم يكذبون به .وأنا أرى أن دعوى زيادة ( لا ) لا داعي إليها ، وأن بقاءها على أصل معناها وهو النفي متعينّ ، وتجعل اللام للعاقبة ، أي أعطيناكم هذا الفضل وحرم منه أهل الكتاب ، فبقي أهل الكتاب في جهلهم وغرورهم بأن لهم الفضل المستمر ولا يحصل لهم علم بانتفاء أن يكونوا يملكون فضل الله ولا أن الله قد أعطى الفضل قوماً آخرين وحَرمَهَم إيّاه فينسون أن الفضل بيد الله ، وليس أحد يستحقه بالذات .وبهذا الغرور استمروا على التمسك بدينهم القديم ، ومعلوم أن لام العاقبة أصلها التعليل المجازي كما علمته في تفسير قوله تعالى : { فالتقطه آل فرعون ليكون لهم عدواً وحزناً } في سورة \\[ القصص : 8 \\] .وقوله : { أهل الكتاب } يجوز أن يكون صادقاً على اليهود خاصة إن جعل التعليل تعليلاً لمجموع قوله : { فآتينا الذين آمنوا منهم أجرهم } \\[ الحديد : 27 \\] وقوله : { يؤتكم كفلين من رحمته } \\[ الحديد : 28 \\] .ويجوز أن يكون صادقاً على اليهود والنصارى إن جعل لام التعليل علة لقوله : { يؤتكم كفلين من رحمته } .و ( أن ) من قوله : { أن لا يقدرون } مخفّفة من ( أنَّ ) واسمها ضمير شأن محذوف .والمعنى : لا تكترثوا بعدم علم أهل الكتاب بأنهم لا يقدرون على شيء من فضل الله وبأن الفضل بيد الله يؤتيه من يشاء ، أي لا تكترثوا بجهلهم المركب في استمرارهم على الاغترار بأن لهم منزلة عند الله تعالى فإن الله عالم بذلك وهو خلقهم فهم لا يقلعون عنه ، وهذا مثل قوله تعالى : { ختم الله على قلوبهم } في سورة \\[ البقرة : 7 \\] .وجملة والله ذو الفضل العظيم } تذييل يعمّ الفضلَ الذي آتاه الله أهل الكتاب المؤمنين بمحمد صلى الله عليه وسلم وغيرَه من الفضل .\n\n",
      "translations": [
        {
          "translation": "(That the People of the Scripture) 'Abdullah Ibn Salam and his followers (may know that they control naught of the bounty of Allah) of the reward of Allah, (but that the bounty) reward and honour (is in Allah's hand to give to whom He will) whoever deserves it. (And Allah is of Infinite Bounty) in relation to the believers in that He bestows upon them reward and honours them. The last two verses were revealed about 'Abdullah Ibn Salam when he boasted to Ubayy Ibn Ka'b and his friends that they had two rewards while others had only one'. And of the surah in which Dispute is mentioned, which is all Medinan-to the exception of Allah's saying (There is no secret conference of three but He is their fourth) which is Meccan-and it consists of 22 verses, 473 words and 1,992 letters: Surah 58: Dispute (al-Mujadilah) And of the surah in which Dispute is mentioned, which is all Medinan — to the exception of Allah's saying (There is no secret conference of three but He is their fourth) which is Meccan — and it consists of 22 verses, 473 words and 1,992 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لِّئَلاَّ يَعْلَمَ } معناه ليعلمَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \" {Lilla yaa'lam } \" means \"that he may know.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بأن يجلبوه بإيمانهم وأعمالهم لو لم يرد سبحانه إتيانه إياهم تفضلاً وإحساناً { وَ } يعلمون أيضاً يقيناً { أَنَّ ٱلْفَضْلَ } المطلق والإنعام والإحسان الكامل { بِيَدِ ٱللَّهِ } وفي قبضة قدرته\n وتحت حكمه وحكمته { يُؤْتِيهِ مَن يَشَآءُ } من عباده إرادةً واختياراً { وَٱللَّهُ } المتعزز برداء العظمة والكبرياء { ذُو ٱلْفَضْلِ ٱلْعَظِيمِ } [الحديد: 29] والطول العميم\n والكرم الجسيم على أرباب العناية من عباده\n\n\nجعلنا الله من تفضل علينا بمقتضى كرمه وجوده\n\n\nخاتمة السورة\n\nعليك أيها المحمدي المترقب للفضل الإلهي وسعة لطفه وجوده أن تلازم على أداء ما افترض عليك من الطاعات والعبادات\n وتداوم على الاتصاف بالآداب السنية والأخلاق المرضية المقتبسة من كتاب الله المنزل من عنده\n لإرشاد منهج الرشاد وعموم السعادات\n ومن سنن سيد السادات\n وسند أرباب الولاية والكرامات\n وتقتفي بآثار السلف المجتازين في مضمار المعارف والمكاشفات المشاهدات\n وإياك إياك الالتفات إلى مزخرفات الدنيا وما فيها من اللذات والشهوات العائقة عن التوجه إلى المولى والوصول إلى سدرة المنتهى { وَأَنَّ ٱلْفَضْلَ بِيَدِ ٱللَّهِ يُؤْتِيهِ مَن يَشَآءُ } [الحديد: 29]",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { و } ليعلموا أيضاً { أنَّ الفضلَ بيد الله } في ملكه وتصرفه\n { يُؤتيه من يشاء } من عباده { واللّهُ ذو الفضل العظيم } لا نهاية لفضله\n وعلى أنَّ الخطاب لأهل الكتاب يكون قوله: { لئلا يعلم أهل الكتاب } أي: مَن لم يؤمن منهم\n فيكون راجعاً لمضمون الجملة الطلبية\n المتضمنة لمعنى الشرط\n أي: { يا أيها الذين آمنوا } بموسى وعيسى { اتقوا الله وآمنوا برسوله } فإن فعلتم ذلك { يُؤتكم كفلين من رحمته\n\n\n } الخ\n وإنما جَعلتُ هذا لمَن آمن بمحمد صلى الله عليه وسلم\n ليعلم أهل الكتاب الذين لم يؤمنوا به أنهم لا يملكون من فضل الله شيئاً\n وأنَّ الفضل بيد الله\n\n\n الخ\n الإشارة: تنسحب هذه الآية من طريق الإشارة على مَن كانت في أسلافه خصوصية ولاية\n أو صلاح\n أو شرف علم أو رئاسة مَّا\n ثم ظهرت التربية الحقيقية في غير أسلافه\n فإن حطّ رأسه وصَدّق بالخصوصية لغيره أعطي أجره مرتين\n وعظم قدره في مقام الولاية\n وإنما كانت تنتقل دولة الولاية ليعلم أهلُ الخصوصية المتقدمة أنّ الفضل بيد الله\n يُؤتيه مَن يشاء\n والله ذو الفضل العظيم\n والله الموفق\n ولا حول ولا قوة إلا بالله العلي العظيم\n وصلّى الله على سيدنا محمد\n وآله وصحبه\n وسلّم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "62:4",
      "similarity": 0.6430178129489763
    },
    {
      "verse": "8:29",
      "similarity": 0.38252750949044023
    },
    {
      "verse": "3:174",
      "similarity": 0.34788631501083334
    },
    {
      "verse": "57:21",
      "similarity": 0.3429342015945022
    },
    {
      "verse": "27:73",
      "similarity": 0.3379554554628256
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/057029.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/057029.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/57:29.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}