{
  "chapter": "الحديد",
  "text": "ولقد ارسلنا نوحا وابرهيم وجعلنا فى ذريتهما النبوة والكتب فمنهم مهتد وكثير منهم فسقون",
  "translations": [
    {
      "translation": "We sent Noah and Abraham, and gave prophethood to their progeny and the Book, and some of them are well-directed, but many of them are disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We sent forth Noah and Abraham and established in their line Prophecy and the Book. Then some of them embraced the guidance and many of them are wicked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah and Abraham and placed prophethood and the Book among their offsprings, some of whom have the right guidance. However, most of them are evil doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We sent Nooh and Ibrahim, and placed Prophethood and the Book among their descendants, so some among them took to guidance; and many of them are sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We sent Nuh and Ibrahim, and placed in their offspring prophethood and Scripture. And among them there are some who are guided; but many of them are rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We sent Nuh and Ibrahim and We gave to their offspring the (gift of) prophecy and the Book; so there are among them those who go aright, and most of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Noah, and Abraham, and We appointed the Prophecy and the Book to be among their seed; and some of them are guided, and many of them are ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We verily sent Noah and Abraham and placed the prophethood and the scripture among their seed, and among them there is he who goeth right, but many of them are evil-livers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent forth Noah and Abraham and bestowed upon their offspring prophethood and the Book. Some of them were rightly guided, but many others were transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We sent Nuh and Ibrahim, and We placed in the posterity of the twain the prophecy and the Book. Then of them some are guided ones, and many of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We sent Noah and Abraham and We ordained among their descendants prophethood and the Book. Some of them are [rightly] guided, and many of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Noah and Abraham, and established in their line Prophethood and Revelation: and some of them were on right guidance. But many of them became rebellious transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, We sent Nuh (Noah) and Ibrahim (Abraham), and placed in their offspring Prophethood and Scripture, and among them there is he who is guided, but many of them are Fasiqun (rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent forth Noah and Abraham, and appointed the Prophethood and the Book to be given to their descendants. Some were guided, but many wereimpious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah and Abraham, and established in their line Prophethood and the Scripture. Some of them are guided, but many of them are sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have already sent Noah and Abraham and placed in their descendants prophethood and scripture; and among them is he who is guided, but many of them are defiantly disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:26] And verily We sent Noah and Abraham and We ordained among their seed prophethood and the Scripture, meaning the four Books: the Torah, the Gospel, the Psalms and the Furqān, all of which have been [revealed] among the seed of Abraham; and some of them are [rightly] guided, and many of them are immoral.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We verily sent Noah) to his folk, 800 years after Adam, and he remained with them for 950 years, but they refused to believe and Allah destroyed them with the flood (and Abraham) and We have sent Abraham to his folk, 1240 years after Noah (and placed the prophethood and the Scripture) they had among them prophets and scriptures (among their seed) the seed of Noah and Abraham, (and among them there is he who goeth right) a believer in the Scripture and Messenger, (but many of them are evil-livers) disbelievers in the Scripture and Messenger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على سبيل التخصيص بعد التعميم؛ للاعتناء والاهتمام بشأن المذكورين: { وَلَقَدْ أَرْسَلْنَا نُوحاً } إلى قومه حين فشا الجدال والمراء بينهم، وشاع انحرافهم عن المنهج القويم { وَإِبْرَاهِيمَ } حين ظهر الشرك وعبادة الأوثان والأصنام بين قومه { وَ } من كمال تعظيمنا وتكريمنا إياهما: { جَعَلْنَا فِي ذُرِّيَّتِهِمَا ٱلنُّبُوَّةَ وَٱلْكِتَابَ } أبداً { فَمِنْهُمْ } أي: بعض قليل من ذريتهما { مُّهْتَدٍ وَ } بعض { كَثِيرٌ مِّنْهُمْ فَاسِقُونَ } [الحديد: 26] خارجون عن جادة العدالة والقسط الإلهي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولقد أرسلنا نوحاً وإِبراهيم } خُصّا بالذكر لأنهما أبوان للأنبياء عليهم السلام { وجعلنا في ذريتهما } أولادهما { النبوةَ } الوحي { والكتابَ } جنس الكتاب\n وعن ابن عباس: \" الخطّ بالقلم \"\n يقال: كتب كتاباً وكتابة\n { فمنهم } من الذرية، أو: مِن المرسَل إليهم، المدلول عليه من الإرسال، { مُهتدٍ } إلى الحق، { وكثيرٌ منهم فاسقون } خارجون عن الطريق المستقيم، والعدول عن سبيل المقابلة للمبالغة في الذم، والإيذان بكثرة الضلاّل والفسّاق",
      "translations": []
    }
  ]
}