{
  "chapter": "الحديد",
  "text": "له ملك السموت والارض يحى ويميت وهو على كل شىء قدير",
  "translations": [
    {
      "translation": "The kingdom of the heavens and the earth belongs to Him. He gives life and causes to die. He has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is the kingdom of the heavens and the earth, He is the giver of life and death, and He has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is the dominion of the heavens and the earth. He gives life and causes death, and He has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs the Kingdom of the heavens and the earth. He gives life and causes things to die. He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For Him only is the kingship of the heavens and the earth; He gives life and causes death; and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is the kingdom of the heavens and the earth. It is He Who gives life and causes death; and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is the kingdom of the heavens and the earth; He gives life and causes death; and He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs the Kingdom of the heavens and the earth; He gives life, and He makes to die, and He is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is the Sovereignty of the heavens and the earth; He quickeneth and He giveth death; and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has sovereign control over the heavens and the earth. He gives life and brings death. He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is the dominion of the heavens and the earth; He giveth life and He causeth to die; and He is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs the kingdom of the heavens and the earth: He gives life and brings death, and He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs the dominion of the heavens and the earth: It is He Who gives Life and Death; and He has Power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is the kingdom of the heavens and the earth, It is He Who gives life and causes death; and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs the Kingdom in the heavens and earth. It is He who revives and causes to die, and He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs the kingdom of the heavens and the earth. He gives life and causes death, and He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is the dominion of the heavens and earth. He gives life and causes death, and He is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:2] To Him belongs the kingdom of the heavens and the earth; He gives life, through [His act of] creation, and He brings death, thereafter, and He has power over all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(His is the Sovereignty) His are the stores (of the heavens) i.e. rain (and the earth) i.e. vegetation; (He quickeneth) for the resurrection (and He giveth death) in the life of the world; (and He is Able to do things) of giving life and death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَهُ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: مؤثرات الأسماء والصفات العلوية، المعتبرة بالأعيان الثابتة ومتأثرات القوابل السفلية، واستعدادات الطبائع والهيولى المنفعلة منها؛ إذ هو سبحانه باستقلاله وتوحده { يُحْيِـي وَيُمِيتُ } أي: يتصرف فيها بالإحياء والإماتة، والخلع واللبس حسب إرادته ومشيئته بالاختيار، وبالجملة: { وَهُوَ عَلَىٰ كُلِّ شَيْءٍ } دخل في حيطة حضرة علمه، ولوح قضائه { قَدِيرٌ } [الحديد: 2] بالقدرة التامة الكاملة، مع أنه لا يعزب عن حيطة علمه الحضوري ذرة مما لمع عليه برق وجوده الوحداني الفرداني\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يُحيي ويميت } استئناف مُبيِّن لبعض أحكام المُلك، أي: هو يُحيي الموتى ويُميت الأحياء، { وهو على كل شيءٍ } من الأشياء، التي من جملتها الإحياء والإماتة { قدير } لا يعجزه شيء",
      "translations": []
    }
  ]
}