{
  "chapter": "الحديد",
  "text": "هو الاول والءاخر والظهر والباطن وهو بكل شىء عليم",
  "translations": [
    {
      "translation": "He is the First and the Last, the Outward and the Inward. He has knowledge of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the first and He the last, the transcendent and the immanent; and He has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, and the Manifest and the Hidden, and He has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First, the Last, the Manifest, and the Unseen and He knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He only is the First and He only the Last, and He only is the Evident and He only the Concealed; and it is He Who knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Al-Awwal and Al-Akhir, Az-Zahir and Al-Batin. And He is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last and the Ascendant (over all) and the Knower of hidden things, and He is Cognizant of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, the Outward and the Inward; He has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, and the Outward and the Inward; and He is Knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, the Outward and the Inward. He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, and the OutWard and the inward, and He is of everything the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, the Manifest and the Hidden, and He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, the Evident and the Immanent: and He has full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First (nothing is before Him) and the Last (nothing is after Him), the Most High (nothing is above Him) and the Most Near (nothing is nearer than Him). And He is the All-Knower of every thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, the Clear and the Hidden. He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, and the Outer and the Inner, and He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, the Ascendant and the Intimate, and He is, of all things, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:3] He is the First, preceding everything [but] without [His] having any beginning, and the Last, succeeding everything [but] without [His] having any end, and the Manifest, through the proofs for Him, and the Hidden, from the perception of the senses, and He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He is the First) before the appearance of all things, (and the Last) after the disappearance of all things, (and the Outward) above all things (and the Inward) in all things; (and He is Knower of all things) that is to say, He is the First means: He is the Living, the preeternal; He was before all that which Allah gave life to; the Last means: He is the Living and Eternally subsistent and will remains after He takes life from all that which Allah has given life to; the Outward means: He is the Conqueror and there is none that can conquer Him; while the Inward means: He is the One Who has knowledge of the inward and outward without there being anyone to inform Him; and it is also said that this means: He is the One Who puts ahead any that is first and the One Who puts last any that is last, before He created any creation; and He will subsist after the annihilation of everything He created, and He is the Living, the Subsistent Who will never die or be annihilated, and He is Aware of all things from first to last, inward or outward.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { هُوَ ٱلأَوَّلُ وَٱلآخِرُ وَٱلظَّاهِرُ وَٱلْبَاطِنُ } فالأولُ: الذي كان ولا شيء غَيرهُ\n والأَخِرُ: الذي يكون ولا شيء مَعهُ\n والظَّاهرُ: الذي ليس ما ظَهرَ من الأَشياءِ بأقرب إليهِ مما بَطَنَ\n والبَاطنُ: الذي ليس ما بَطنَ من الأَشياءِ بأبعد عنهُ مما ظَهرَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"He is the First and the Last, and the Outer and the Inner\" - so the First is He who was and nothing else was.\n\n\nAnd the last one: that which is and nothing else with it.\n\n\nThe apparent: that which is not what appears of things, nearest to it than what is hidden.\n\n\nAnd the baṭan (innermost) is that which is not baṭan (hidden) of things, furthest from what is dhahir (apparent).",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n المستمر فيه بمقتضى الجود حق { وَٱلظَّاهِرُ } المتحقق في العيان { وَٱلْبَاطِنُ } المكنون في عموم الأكوان\n فانظر أيها المعتبر الناظر\n هل بقي لغيره وجود ولسواه عين وشهود؟! { وَ } بالجملة: { هُوَ } بذاته { بِكُلِّ شَيْءٍ } ظهر من امتداد أظلاله وانعكاس أشعة نور وجوده { عَلِيمٌ } [الحديد: 3] بذاته وحضوره\n غير مغيب عنه مطلقاً\n\n\nومن كمال علمه وإرادته\n ووفور حكمته وقدرته { هُوَ ٱلَّذِي خَلَقَ } وقدر ظهور { ٱلسَّمَٰوَٰتِ } المتطابعة المتعلقة { وَٱلأَرْضَ } المفترشة الممهدة { فِي سِتَّةِ أَيَّامٍ } حسب الأقطار والجهات الست { ثُمَّ } بعدما كمل الكل { ٱسْتَوَىٰ } وتمكن { عَلَى ٱلْعَرْشِ } أي: على عروش مطلق المظاهر بالاستيلاء التام\n والاستقلال الكامل\n بحيث { يَعْلَمُ مَا يَلِجُ } ويدخل { فِي ٱلأَرْضِ } من الحبات أو في أراضي الاستعدادات ومن بذور المعارف والحقائق { وَمَا يَخْرُجُ مِنْهَا } من أنواع النباتات أو المكاشفات والمشاهدات المترتبة على بذور المعارف",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وهو الأولُ } القديم قبل كل شيء، { والآخرُ } الذي يَبقى بعد فناء كل شيء، { والظاهرُ } الذي ظهر بكل شيء، { والباطنُ } الذي اختفى بعد ظهوره في كل شيء، وقد جاء في الحديث:\n\n \" اللهم أنت الأول، فليس قبلك شيء، وأنت الآخر، فليس بعدك شيء، وأنت الظاهر فليس فوقك شيء، وأنت الباطن، فليس دونك شيء \" \n\nقال الطيبي: فالمعنيّ بالظاهر على التفسير النبوي: الغالب الذي يَغلب ولا يُغلب، فيتصرف في المكونات على سبيل الغلبة والاستيلاء إذ ليس فوقه أحدٌ يمنعه، وبالباطن ألاّ ملجأ ولا منجا دونه، يُنجي ملتجئاً له\n هـ\n وسيأتي في الإشارة تحقيقه إن شاء الله\n { وهو بكل شيءٍ عليم } لا يعزب عن علمه شيء من الظاهر والخفيِّ\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:53",
      "similarity": 0.5605523069312143
    },
    {
      "verse": "37:66",
      "similarity": 0.5214320345871375
    },
    {
      "verse": "37:144",
      "similarity": 0.45698391606037614
    },
    {
      "verse": "7:33",
      "similarity": 0.41776978448843777
    },
    {
      "verse": "16:78",
      "similarity": 0.35990252674456097
    }
  ]
}