{
  "chapter": "الحديد",
  "text": "هو الاول والءاخر والظهر والباطن وهو بكل شىء عليم",
  "translations": [
    {
      "translation": "He is the First and the Last, the Outward and the Inward. He has knowledge of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the first and He the last, the transcendent and the immanent; and He has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, and the Manifest and the Hidden, and He has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First, the Last, the Manifest, and the Unseen and He knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He only is the First and He only the Last, and He only is the Evident and He only the Concealed; and it is He Who knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Al-Awwal and Al-Akhir, Az-Zahir and Al-Batin. And He is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last and the Ascendant (over all) and the Knower of hidden things, and He is Cognizant of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, the Outward and the Inward; He has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, and the Outward and the Inward; and He is Knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, the Outward and the Inward. He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, and the OutWard and the inward, and He is of everything the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, the Manifest and the Hidden, and He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, the Evident and the Immanent: and He has full knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First (nothing is before Him) and the Last (nothing is after Him), the Most High (nothing is above Him) and the Most Near (nothing is nearer than Him). And He is the All-Knower of every thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, the Clear and the Hidden. He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, and the Outer and the Inner, and He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the First and the Last, the Ascendant and the Intimate, and He is, of all things, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:3] He is the First, preceding everything [but] without [His] having any beginning, and the Last, succeeding everything [but] without [His] having any end, and the Manifest, through the proofs for Him, and the Hidden, from the perception of the senses, and He has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهُوَ الْأَوَّلُ وَالْآَخِرُ وَالظَّاهِرُ وَالْبَاطِنُ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ (3){ هُوَ الاول والاخر والظاهر والباطن وَهُوَ بِكُلِّ شَىْءٍ عَلِيمٌ } .استئناف في سياق تبْيين أن له ملك السماوات والأرض ، بأن مُلكه دائم في عموم الأزمان وتصرف فيهما في كل الأحوال ، إذ هو الأول الأزلي ، وأنه مستمر من قبل وجود كل محدث ومن بعد فنائه إذ الله هو الباقي بعد فناء ما في السماوات والأرض ، وذلك يظهر من دلالة الآثار على المؤثِر فإن دلائل تصرفه ظاهرة للمتبصر بالعقل وهو معنى { الظاهر } كما يأتي ، وأن كيفيات تصرفاته محجوبة عن الحس وذلك معنى { الباطن } تعالى كما سيأتي .فضمير { هو } ليس ضمير فصل ولكنه ضمير يعبر عن اسم الجلالة لاعتبارنا الجملة مستأنفة ، ولو جعلته ضمير فصل لكانت أوصاف { الأول والأخر والظاهر والباطن } أخباراً عن ضمير { هو العزيز الحكيم } \\[ الحديد : 1 \\] .وقد اشتملت هذه الجملة على أربعة أَخبار هي صفات لله تعالى .فأما وصف { الأول } فأصل معناه الذي حصُل قبل غيره في حالة تُبينُها إضافة هذا الوصف إلى ما يدل على الحالة من زمان أو مكان ، فقد يقع مع وصف ( أول ) لفظُ يدل على الحالة التي كان فيها السبق ، وقد يستدل على تلك الحالة من سياق الكلام ، فوصف { الأول } لا يتبين معناه إلا بما يتصل به من الكلام ولا يتصور إلا بالنسبة إلى موصوف آخر هو متأخر عن الموصوف ب ( أول ) في حالة مَّا .فقول امرىء القيس :ومُهلهل الشعراء ذَاك الأول ... يفيد أنه مهلهل سابق غيره من الشعراء في الشعر ، وقوله تعالى : { قل إني أمرت أن أكون أول من أسلم } \\[ الأنعام : 14 \\] أي أولهم في اتباع الإِسلام ، وقوله : { ولا تكونوا أول كافر به } \\[ البقرة : 41 \\] ، أي أولهم كُفراً وقوله : { وقالت أولاهم لأخراهم } \\[ الأعراف : 39 \\] ، أي أُولاهم في الدخول إلى النار .وأشهر معاني الأوَّلية هو السبق في الوجود ، أي في ضد العدم ، ألا ترى أن جميع الأحوال التي يسبق صاحبُها غيره فيها هي وجودات من الكيفيات ، فوصف الله بأنه { الأول } معناه : أنه السابق وُجوده على كل موجود وُجد أو سيوجد ، دون تخصيص جنس ولا نوع ولا صنف ، ولكنه وصف نسبي غير ذاتي .ولهذا لم يذكر لهذا الوصف هنا متعلِّق بكسر اللام ، ولا ما يدل على متعلِّق لأن المقصود أنه الأول بدون تقييد .ويرادف هذا الوصفَ في اصطلاح المتكلمين صفةُ القدم .واعلم أن هذا الوصف يستلزم صفة الغِنَى المطلق ، وهي عدم الاحتياج إلى المخصِّص ، أي مخصص يخصصه بالوجود بدلاً عن العدم ، لأن الأول هنا معناه الموجود لِذاته دون سبق عدم ، وعدم الاحتياج إلى محل يقوم به قيام العرض بالجوهر .ويستلزم ذلك انفراده تعالى بصفة الوجود لأنه لو كان غيرُ الله واجباً وجودُه لما كان الله موصوفاً بالأولية ، فالموجودات غير الله ممكنة ، والممكن لا يتصف بالأولية المطلقة ، فلذلك تثبت له الوحدانية ، ثم هذه الأولية في الوجود تقتضي أن تثبت لله جميع صفات الكمال اقتضاء عقلياً بطريق الالتزام البينّ بالمعنى الأعمّ وهو الذي يلزم من تصور ملزومه وتصوُّره الجزم بالملازمة بينهما .وأما وصف { الآخر } فهو ضد الأول ، فأصله : هو المسبوق بموصوف بصفة متحدث عنها في الكلام أو مشار إليها فيه بما يذكر من متعلق به ، أو تمييزه ، على نحو ما تقدم في قوله : { هو الأول } كقوله تعالى : { حتى إذا اداركوا فيها جميعاً قالت أخراهم لأولاهم } \\[ الأعراف : 38 \\] أي أخراهم في الإدِّرَاك في النار ، وقول النبي صلى الله عليه وسلم \" آخر أهل الجنة دخولاً الجنة . . . \" الخ ، وقول الحريري في المقامة الثانية «وجلس في أُخريات الناس» ، أي الجماعات الأخريات في الجلوس ، وهو وصف نسبيّ .ووصف الله تعالى بأنه { الآخر } بعد وصفه بأنه { الأول } مع كون الوصفين متضادّين يقتضي انفكاك جهتي الأولية والآخرية ، فلما تقرر أن كونه الأول متعلق بوجود الموجودات اقتضى أن يكون وصفه ب { الآخر } متعلقاً بانتقاض ذلك الوجود ، أي هو الآخر بعد جميع موجودات السماء والأرض ، وهو معنى قوله تعالى : { نرث الأرض ومن عليها } \\[ مريم : 40 \\] وقوله : { كل شيء هالك إلا وجهه } \\[ القصص : 88 \\] .فتقدير المعنى : والآخِر في ذلك أي في استمرار الوجود الذي تقرر بوصفه بأنه الأول . وليس في هذا إشعار بأنه زائل ينتابه العدم ، إذ لا يشعر وصف الآخِر بالزوال لا مطابقة ولا التزاماً ، وهذا هو صفة البقاء في اصطلاح المتكلمين . فآل معنى { الآخر } إلى معنى «الباقي» ، وإنما أوثر وصف { الآخر } بالذكر لأنه مقتضى البلاغة ليتم الطباق بين الوصفين المتضادين ، وقد عُلم عند المتكلمين أن البقاء غير مختص بالله تعالى وأنه لا ينافي الحُدوث على خلاف في تعيين الحوادث الباقية ، بخلاف وصف القدم فإنه مختص بالله تعالى ومتناففٍ مع الحدوث .واعلم أن في قوله : { هو الأول والأخر } دلالة قصر من طريق تعريف جزأي الجملة .فأما قصر الأولية على الله تعالى في صفة الوجود فظاهر ، وأما قصر الآخرية عليه في ذلك وهو معنى البقاء ، فإن أريد به البقاء في العالم الدنيوي عرض إشكال المتعارض بما ورد من بقاء الأرواح ، وحديث \" أن عَجْب الذَّنب لا يفنى وأن الإِنسان منه يعادُ \" . ورفع هذا الإشكال أن يجعل القصر ادعائياً لعدم الاعتداد ببقاء غيره تعالى لأنه بقاء غير واجب بل هو بجعل الله تعالى .والجمع بين وصفي { الأول والأخر } فيه محسّن الطباق .و { الظاهر } الأرجح أنه مشتق من الظُّهور الذي هو ضد الخفاء فيكون وصفه تعالى به مجازاً عقلياً ، فإن إسناد الظهور في الحقيقة هو ظهور أدلة صفاته الذاتية لأهل النظر والاستدلال والتدبر في آيات العالم فيكون الوصف جامعاً لصفته النفسية ، وهي الوجود ، إذ أدلة وجوده بيّنة واضحة ولصفاته الأخرى مما دل عليها فعله من قدرة وعلم وحياة وإرادة ، وصفات الأفعال من الخلق والرزق والإِحياء والإِماتة كما علمت في قوله : { هو الأول } عن النقص أو ما دل عليها تنزيهه عن النقص كصفة الوحدانية والقدم والبقاء والغنى المطلق ومخالفة الحوادث ، وهذا المعنى هو الذي يناسبه المقابلة بالباطن .ويجوز أن يكون مشتقاً من الظهور ، أي الغلبة كالذي في قوله تعالى : { إنهم إن يظهروا عليكم يرجموكم } \\[ الكهف : 20 \\] ، فمعنى وصفه تعالى ب { الظاهر } أنه الغالب .وهذا لا يناسب مقابلته ب { الباطن } إلا على اعتبار محسِّن الإِيهام ، وما وقع في حديث أبي هريرة في «صحيح مسلم» من قول رسول الله صلى الله عليه وسلم \" وأنت الظاهر فليس فوقك شيء \" فمعنى فاء التفريع فيه أن ظهوره تعالى سبب في انتفاء أن يكون شيء فوق الله في الظهور ، أي في دلالة الأدلة على وجوده واتصافه بصفات الكمال ، فدلالة الفاء تفريع لا تفسير .و { الباطن } الخفي يقال : بطن ، إذا خفي ومصدره بُطُون .ومعنى وصفه تعالى بباطن وصف ذاته وكنهه لأنه محجوب عن إدراك الحواس الظاهرة قال تعالى : { لا تدركه الأبصار } \\[ الأنعام : 103 \\] .والقصر في قوله : { والظاهر والباطن } قصر ادعائي لأن ظهور الله تعالى بالمعنيين ظهور لا يدانيه ظهور غيره ، وبطونه تعالى لا يشبهه بطون الأشياء الخفية إذ لا مطمع لأحد في إدراك ذاته ولا في معرفة تفاصيل تصرفاته .والجمع بين وصفه ب { الظاهر } بالمعنى الراجح و { الباطن } كالجمع بين وصفه ب { الأول والآخر } كما علمته آنفاً . وفي الجمع بينهما محسن المطابقة .وفائدة إجراء الوصفين المتضادين على اسم الله تعالى هنا التنبيه على عظم شأن الله تعالى ليتدبر العالمون في مواقعها .واعلم أن الواوات الثلاثة الواقعة بين هذه الصفات الأربع متحدة المعنى تقتضي كل واحدة منها عطف صفة .وقال الزمخشري : «الواو الأولى معناها الدلالة على أنه الجامع بين مجموع الصفتين الأوّلية والآخريَّة . والثالثة على أنه الجامع بين الظهور والخفاء ، وأما الوسطى فعلى أنه الجامع بين مجموع الصفتين الأوليين ومجموع الصفتين الأخريين» اه . وهو تشبث لا داعي إليه ولا دليل عليه ولو أريد ذلك لقال : هو الأول الآخر ، والظاهر الباطن ، بحذف واوين . والمعنى الذي حاوله الزمخشري : تقتضيه معاني هاته الصفات بدون اختلاف معاني الواوات .{ وَهُوَ بِكُلِّ شَىْءٍ عَلِيم } .عطف على جملة { هو الأول والآخر } الخ عطفت صفة علمه على صفة ذاته ، وتقدم نظير هذه الجملة في أوائل سورة البقرة .هُوَ الَّذِي خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ فِي سِتَّةِ أَيَّامٍ ثُمَّ اسْتَوَى عَلَى الْعَرْشِ يَعْلَمُ مَا يَلِجُ فِي الْأَرْضِ وَمَا يَخْرُجُ\n\n",
      "translations": [
        {
          "translation": "(He is the First) before the appearance of all things, (and the Last) after the disappearance of all things, (and the Outward) above all things (and the Inward) in all things; (and He is Knower of all things) that is to say, He is the First means: He is the Living, the preeternal; He was before all that which Allah gave life to; the Last means: He is the Living and Eternally subsistent and will remains after He takes life from all that which Allah has given life to; the Outward means: He is the Conqueror and there is none that can conquer Him; while the Inward means: He is the One Who has knowledge of the inward and outward without there being anyone to inform Him; and it is also said that this means: He is the One Who puts ahead any that is first and the One Who puts last any that is last, before He created any creation; and He will subsist after the annihilation of everything He created, and He is the Living, the Subsistent Who will never die or be annihilated, and He is Aware of all things from first to last, inward or outward.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { هُوَ ٱلأَوَّلُ وَٱلآخِرُ وَٱلظَّاهِرُ وَٱلْبَاطِنُ } فالأولُ: الذي كان ولا شيء غَيرهُ\n والأَخِرُ: الذي يكون ولا شيء مَعهُ\n والظَّاهرُ: الذي ليس ما ظَهرَ من الأَشياءِ بأقرب إليهِ مما بَطَنَ\n والبَاطنُ: الذي ليس ما بَطنَ من الأَشياءِ بأبعد عنهُ مما ظَهرَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"He is the First and the Last, and the Outer and the Inner\" - so the First is He who was and nothing else was.\n\n\nAnd the last one: that which is and nothing else with it.\n\n\nThe apparent: that which is not what appears of things, nearest to it than what is hidden.\n\n\nAnd the baṭan (innermost) is that which is not baṭan (hidden) of things, furthest from what is dhahir (apparent).",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n المستمر فيه بمقتضى الجود حق { وَٱلظَّاهِرُ } المتحقق في العيان { وَٱلْبَاطِنُ } المكنون في عموم الأكوان\n فانظر أيها المعتبر الناظر\n هل بقي لغيره وجود ولسواه عين وشهود؟! { وَ } بالجملة: { هُوَ } بذاته { بِكُلِّ شَيْءٍ } ظهر من امتداد أظلاله وانعكاس أشعة نور وجوده { عَلِيمٌ } [الحديد: 3] بذاته وحضوره\n غير مغيب عنه مطلقاً\n\n\nومن كمال علمه وإرادته\n ووفور حكمته وقدرته { هُوَ ٱلَّذِي خَلَقَ } وقدر ظهور { ٱلسَّمَٰوَٰتِ } المتطابعة المتعلقة { وَٱلأَرْضَ } المفترشة الممهدة { فِي سِتَّةِ أَيَّامٍ } حسب الأقطار والجهات الست { ثُمَّ } بعدما كمل الكل { ٱسْتَوَىٰ } وتمكن { عَلَى ٱلْعَرْشِ } أي: على عروش مطلق المظاهر بالاستيلاء التام\n والاستقلال الكامل\n بحيث { يَعْلَمُ مَا يَلِجُ } ويدخل { فِي ٱلأَرْضِ } من الحبات أو في أراضي الاستعدادات ومن بذور المعارف والحقائق { وَمَا يَخْرُجُ مِنْهَا } من أنواع النباتات أو المكاشفات والمشاهدات المترتبة على بذور المعارف",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وهو الأولُ } القديم قبل كل شيء\n { والآخرُ } الذي يَبقى بعد فناء كل شيء\n { والظاهرُ } الذي ظهر بكل شيء\n { والباطنُ } الذي اختفى بعد ظهوره في كل شيء\n وقد جاء في الحديث:\n \" اللهم أنت الأول\n فليس قبلك شيء\n وأنت الآخر\n فليس بعدك شيء\n وأنت الظاهر فليس فوقك شيء\n وأنت الباطن\n فليس دونك شيء \" \nقال الطيبي: فالمعنيّ بالظاهر على التفسير النبوي: الغالب الذي يَغلب ولا يُغلب\n فيتصرف في المكونات على سبيل الغلبة والاستيلاء إذ ليس فوقه أحدٌ يمنعه\n وبالباطن ألاّ ملجأ ولا منجا دونه\n يُنجي ملتجئاً له\n هـ\n وسيأتي في الإشارة تحقيقه إن شاء الله\n { وهو بكل شيءٍ عليم } لا يعزب عن علمه شيء من الظاهر والخفيِّ\n\n{ هو الذي خلق السماوات والأرضَ في ستة أيام } من أيام الدنيا\n ولو أراد أن يخلقها في طرفة عين لفعل\n ولكن جعل الست أصلاً ليكون عليها المدار\n وتعليماً للتأني",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:53",
      "similarity": 0.5605523069312143
    },
    {
      "verse": "37:66",
      "similarity": 0.5214320345871375
    },
    {
      "verse": "37:144",
      "similarity": 0.45698391606037614
    },
    {
      "verse": "7:33",
      "similarity": 0.41776978448843777
    },
    {
      "verse": "16:78",
      "similarity": 0.35990252674456097
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/057003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/057003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/57:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}