{
  "chapter": "الحديد",
  "text": "هو الذى خلق السموت والارض فى ستة ايام ثم استوى على العرش يعلم ما يلج فى الارض وما يخرج منها وما ينزل من السماء وما يعرج فيها وهو معكم اين ما كنتم والله بما تعملون بصير",
  "translations": [
    {
      "translation": "It is He Who created the heavens and the earth in six days, then established Himself firmly on the Throne. He knows what goes into the earth and what comes out of it, what comes down from heaven and what goes up into it. He is with you wherever you are - Allah sees what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the heavens and the earth in six stages, then assumed the throne. He knows whatsoever enters the earth, and whatsoever comes out of it, and what comes down from the sky and what goes up to it; and He is with you wheresoever you may be, and He perceives whatsoever you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who created the heavens and the earth in six days and then established Himself on the Throne. He knows all that enters the earth and all that comes forth from it, and all that comes down from the heaven and all that goes up to it. He is with you wherever you are. Allah sees all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the heavens and the earth in six days and then established His Dominion over the Throne. He knows whatever enters into the earth, what comes out of it, what descends from the sky, and what ascends to it. He is with you wherever you may be and He is Well Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who created the heavens and the earth in six days, then ascended the Throne (of Control), in a manner befitting His Majesty; He knows all what goes into the earth and all what comes out of it, and all what descends from the sky and all that rises in it; and He is with you, wherever you may be; and Allah is seeing your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who created the heavens and the earth in six Days and then rose (Istawa) over the Throne. He knows what goes into the earth and what comes forth from it, and what descends from the heaven and what ascends thereto. And He is with you wheresoever you may be. And Allah is the All-Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is who created the heavens and the earth in six periods, and He is firm in power; He knows that which goes deep down into the earth and that which comes forth out of it, and that which comes down from the heaven and that which goes up into it, and He is with you wherever you are; and Allah sees what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He that created the heavens and the earth in six days then seated Himself upon the Throne. He knows what penetrates into the earth, and what comes forth from it, -- what comes down from heaven, and what goes up unto it. He is with you wherever you are; and God sees the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who created the heavens and the earth in six Days; then He mounted the Throne. He knoweth all that entereth the earth and all that emergeth therefrom and all that cometh down from the sky and all that ascendeth therein; and He is with you wheresoever ye may be. And Allah is Seer of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was He who created the heavens and earth in six Days [periods] and then ascended the throne. He knows what enters the earth and what comes out of it; what descends from the sky and what ascends to it. He is with you wherever you are; He sees all that you do;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who created the heavens and the earth in six days; then He established Himself on the Throne. He knoweth whatsoever plungeth into the earth and whatsoever cometh forth therefrom, and whatsoever descendeth from the heaven and whatsoever ascendeth thereto; and He is with you wheresoever ye be. And Allah is of whatsoever ye work a Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the heavens and the earth in six days; then settled on the Throne. He knows whatever enters the earth and whatever emerges from it and whatever descends from the sky and whatever ascends to it, and He is with you wherever you may be, and Allah watches what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who created the heavens and the earth in Six Days, and is moreover firmly established on the Throne (of Authority). He knows what enters within the earth and what comes forth out of it, what comes down from heaven and what mounts up to it. And He is with you wheresoever ye may be. And Allah sees well all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who created the heavens and the earth in six Days and then Istawa (rose over) the Throne (in a manner that suits His Majesty). He knows what goes into the earth and what comes forth from it, what descends from the heaven and what ascends thereto. And He is with you (by His Knowledge) wheresoever you may be. And Allah is the All-Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created the heavens and the earth in six days, and willed to the Throne. He knows what penetrates the earth and all that emerges from it; all that descends from heaven and all that ascends to it. He is with you wherever you are. Allah sees the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the heavens and the earth in six days, then settled over the Throne. He knows what penetrates into the earth, and what comes out of it, and what descends from the sky, and what ascends to it. And He is with you wherever you may be. God is Seeing of everything you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the heavens and earth in six days and then established Himself above the Throne. He knows what penetrates into the earth and what emerges from it and what descends from the heaven and what ascends therein; and He is with you wherever you are. And Allah, of what you do, is Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:4] It is He Who created the heavens and the earth in six days, of the days of this world, the first of which being Sunday, and the last of which, Friday, then presided upon the Throne (‘arsh: [denotes] the kursī), a presiding [that was] befitting of Him. He knows what enters the earth, of rain and dead creatures, and what issues from it, of vegetation and minerals, and what comes down from the heaven, in the way of mercy and chastisement, and what ascends in it, of righteous deeds and evil ones. And He is with you, by [virtue of] His knowledge, wherever you may be; and God is Seer of what you do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is Who created the heavens and the earth in six Days) of the days of the beginning of the life of the world whereby one day is 1,000 years of the days we know, the first day being Sunday and the last Friday; (then He mounted the Throne) He established Himself on the Throne and it is said He filled it. Before He created the heavens and the earth, Allah was established on the Throne without any modality (bila-kayf). (He knoweth all that entereth the earth) of rain, treasures and dead created beings, (and all that emergeth therefrom) from the earth of dead created beings, vegetation, water and treasures (and all that cometh down from the sky) of provision, rain, angels and misfortunes (and all that ascendeth therein) of angels, the angels who record people's actions and works; (and He is with you) and He is Aware of you (wheresoever ye may be) on land or at sea. (And Allah is Seer of what ye do) of good or evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ خلق السموات والأرض في ستة أيام } من الأيام الإلهية أي: الآلات الستة التي هي من زمان آدم إلى زمان محمد عليهما السلام جميع مدّة دور الخفاء\n أي: احتجب بها فظهر الخلق دونه إذ الخلق احتجاب الحق بالأشياء وهذا الزمان زمان الاحتجاب كما ذكر في الأعراف\n { ثم استوى } على عرش القلب المحمدي بالظهور في جميع الصفات غير محتجب بعضها ببعض ولا الذات بالصفات ولا الصفات بالذات\n بل استوت كلها في الظهور في اليوم السابع أو في صور المراتب الستّ من الجواهر والأعراض المذكورة في ق\n ثم استوى على عرش الروح الأعظم بالتأثير في جميع الأشياء في الصورة الرحمانية بالسوية والظهور باسم الرحمن { يعلم ما يلج في } أرض العالم الجسماني من الصور النوعية لأنها صورة معلوماته { وما يخرج منها } من الأرواح التي تفارقها والصور التي تزايلها عند الفناء والفساد وهي التي تنزل من السماء وتعرج فيها\n أو ما ينزل من سماء الروح من العلوم والأنوار الفائضة على القلب وما يعرج فيها من الكليات المنتزعة من الجزئيات المحسوسة وهيئات الأعمال المزكية { وهو معكم أينما كنتم } لوجودكم به وظهوره في مظاهركم { والله بما تعملون بصير } لسبق علمه به وكونه منقوشاً في أربعة ألواح في عالم ملكوته بحضرته { يولج } ليل الغفلة في نهار الحضور { ويولج } نهار الحضور في ليل الغفلة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والأعمال الصالحات { وَمَا يَنزِلُ مِنَ ٱلسَّمَآءِ } أي: عالم الأسباب من الأمطار\n أو من سماء الأسماء من مياه العلوم اللدنية والإدراكات المحيية لأراضي الاستعدادات { وَمَا يَعْرُجُ فِيهَا } من الأبخرة والأدخنة\n أو الكلمات الطيبة الصاعدة الجالبة لفيضان اليقين والعرفان من المبدأ الفياض\n\n\n{ وَ } بالجملة: { هُوَ } سبحانه بذاته { مَعَكُمْ } أيتها المظاهر { أَيْنَ مَا كُنتُمْ } لا معية ذاتية ولا زمانية\n ولا بطريق المقارنة والمخالطة\n ولا بطريق الحلول والاتحاد\n بل بطريق الظهور والظلية\n والحضور ورش النور { وَ } بالجملة: { ٱللَّهُ } المحيط بكم\n المظهر لأشباحكم بمد ظله عليكم { بِمَا تَعْمَلُونَ } من مطلق الأعمال { بَصِيرٌ } [الحديد: 4] فيجازيكم عليها على مقتضى بصارته وعلمه في يوم الجزاء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم استوى } أي: استولى { على العرش } حتى صار العرش وما احتوى عليه غيباً في عظمة أسرار ذاته\n { يعلم ما يَلِجُ في الأرض } ما يدخل فيها\n من البذر\n والقطر\n والكنوز\n والأمطار\n { وما يعرجُ فيها } من الملائكة والأموات والأعمال\n { وهو معكم أينما كنتم } بالعلم والقدرة والإحاطة الذاتية\n وما ادعاه ابنُ عطية من الإجماع أنه بالعلم\n فإن كان مراده من أهل الظاهر فمسلّم\n وأمّا أهل الباطن فمجمِعون على خلافه\n انظر الإشارة\n { والله بما تعملون بصير } فيُجازي كلاًّ بعمله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:2",
      "similarity": 0.6496631310399752
    },
    {
      "verse": "25:59",
      "similarity": 0.5261423099478969
    },
    {
      "verse": "32:4",
      "similarity": 0.5080785739886623
    },
    {
      "verse": "10:3",
      "similarity": 0.4839913989719473
    },
    {
      "verse": "11:7",
      "similarity": 0.4493271268839334
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/57:4.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/57:4.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/57:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}