{
  "chapter": "الحديد",
  "text": "يولج اليل فى النهار ويولج النهار فى اليل وهو عليمۢ بذات الصدور",
  "translations": [
    {
      "translation": "He turns night into day, and turns day into night; and He knows whatsoever is in your hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He causes the night to pass into the day, and causes the day to pass into the night, and He fully knows all that is hidden in the breasts of people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He causes night to enter into day and day into night. He knows best what all hearts contain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brings the night in a part of the day, and brings the day in a part of the night; and He knows what lies within the hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He merges night into day, and merges day into night, and He has full knowledge of whatsoever is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He causes the night to enter in upon the day, and causes the day to enter in upon the night, and He is Cognizant of what is in the hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He makes the night to enter into the day and makes the day to enter into the night. He knows the thoughts within the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He causeth the night to pass into the day, and He causeth the day to pass into the night, and He is knower of all that is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He causes the night to pass into the day and the day to pass into the night. And He knows all that is in the hearts of men.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He plungeth the night into the day, and plungeth the day into the night, and He is the Knower of whatsoever is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He makes the night pass into the day and makes the day pass into the night, and He knows best what is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He merges Night into Day, and He merges Day into Night; and He has full knowledge of the secrets of (all) hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He merges night into day (i.e. the decrease in the hours of the night is added into the hours of the day), and merges day into night (i.e. the decrease in the hours of the day is added into the hours of the night), and He has full knowledge of whatsoever is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He causes the night to enter into the day and the day to enter into the night. He has knowledge of the thoughts of the innermost of the chests.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He merges the night into the day, and He merges the day into the night; and He knows what the hearts contains.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He causes the night to enter the day and causes the day to enter the night, and he is Knowing of that within the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:6] He makes the night pass into, He makes it enter, the day, so that it increases while the night diminishes, and makes the day pass into the night, so that it increases while the day diminishes. And He is Knower of what is in the breasts, of what it contains of secrets and convictions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He causeth the night to pass into) and increase in duration over (the day, and He causeth the day to pass into) and increase in duration over (the night, and He is Knower of all that is in the breasts) He knows what is in the hearts of good and evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن تصرفاته المتقنة في ملكه على وفق حكمته أنه { يُولِجُ } ويدخل { ٱلْلَّيْلَ } أي: بعض أجزائه { فِي ٱلنَّهَارِ } في فصل الربيع والصيف { وَيُولِجُ ٱلنَّهَارَ } أي: بعض أجزائه { فِي ٱلْلَّيْلِ } في فصل الخريف والشتاء؛ مصلحةً لمعاش عموم الحيوانات، ومحافظةً لها من كلا طرفي الإفراط والتفريط { وَ } بالجملة: { هُوَ عَلِيمٌ بِذَاتِ ٱلصُّدُورِ } [الحديد: 6] أي: بمكنونات ضمائركم، ومقتضيات استعداداتكم\n\n\n\n\nوبعدما علم واطلع سبحانه منكم ومن استعداداتكم وقابلياتكم\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}