{
  "chapter": "الحديد",
  "text": "ءامنوا۟ بالله ورسوله وانفقوا۟ مما جعلكم مستخلفين فيه فالذين ءامنوا۟ منكم وانفقوا۟ لهم اجر كبير",
  "translations": [
    {
      "translation": "Have iman in Allah and His Messenger and give of that to which He has made you successors. Those of you who have iman and give will have an immense reward.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believe in God and His Apostle, and spend of what He has given you as His trustee. And those of you who believe and spend in charity will have a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believe in Allah and in His Messenger and expend of what He has entrusted to you. A great reward awaits those of you who believe and spend their wealth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have faith in God and His Messenger and spend for His cause out of what is entrusted to you. Those who believe and spend for the cause of God will have a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Accept faith in Allah and His Noble Messenger, and spend in His cause from what He has made you the heirs of; so for those among you who accepted faith and spent in His cause, is a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believe in Allah and His Messenger, and spend of that whereof He has made you trustees. And such of you as believe and spend, theirs will be a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believe in Allah and His Apostle, and spend out of what He has made you to be successors of; for those of you who believe and spend shall have a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believe in God and His Messenger, and expend of that unto which He has made you successors. And those of you who believe and expend shall have a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believe in Allah and His messenger, and spend of that whereof He hath made you trustees; and such of you as believe and spend (aright), theirs will be a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have faith in God and His Messenger and spend in charity from that of which He has made you trustees: those of you who believe and give alms shall be richly rewarded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believe in Allah and His apostle, and expend of that whereof He hath made you successors to. Those of you who believe and expend - theirs shall be a great hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have faith in Allah and His Apostle, and spend out of that of which He has made you heirs. There is a great reward for those of you who have faith and spend [in Allah’s way].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believe in Allah and His messenger, and spend (in charity) out of the (substance) whereof He has made you heirs. For, those of you who believe and spend (in charity),- for them is a great Reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believe in Allah and His Messenger (Muhammad SAW), and spend of that whereof He has made you trustees. And such of you as believe and spend (in Allah's Way), theirs will be a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believe in Allah and His Messenger and spend (in charity) of that which He has made you successors. Whosoever of you believes and spends shall have amighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believe in God and His Messenger, and spend from what He made you inherit. Those among you who believe and give will have a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believe in Allah and His Messenger and spend out of that in which He has made you successors. For those who have believed among you and spent, there will be a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:7] Believe, adhere to belief, in God and His Messenger, and expend, in the way of God, out of that over which He has made you successors, out of the wealth of those mentioned [whom you have succeeded], for you will be succeeded in this [wealth] by those who will come after you: this was revealed at the time of the ‘hardship’ campaign, the campaign of Tabūk. For those of you who believe and expend — an allusion to ‘Uthmān [b. ‘Affān], may God be pleased with him — will have a great reward.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Believe in Allah) people of Mecca (and His messenger) Muhammad (pbuh) (and spend of that whereof He hath made you trustees) and spend in the way of Allah of that which He has made you owners; (and such of you as believe) people of Mecca (and spend (aright)) and spend their wealth in the way of Allah, (theirs will be a great reward) in the Garden because of their faith and spending of their wealth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ آمنوا بالله } الإيمان اليقيني بتوحيد الأفعال { ورسوله } أي: لا تحتجبوا بأفعال الحق في إيمانكم بتوحيد الأفعال عن أفعال الخلق فتقعوا في الجبر وحرمان الأجر\n بل شاهدوا أفعال الحق بالإيمان به جمعاً في مظاهر التفاصيل بحكم الشرع ليحصل لكم التوكل ويسهل عليكم الإنفاق من مال الله الذي هو في أيديكم وجعلكم مستخلفين فيه بتمكينكم وإقداركم على التصرّف فيه بحكم الشرع إذ الأموال كلها لله واختصاص نسبة التصرّف إنما هو بحكمه في شريعته\n { فالّذِين آمنوا منكم } بشهود الأفعال { وأنفقوا } عن مقام التوكل { لهم أجر كبير } في جنة الأفعال",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n { آمِنُواْ } أي: أنقادوا وأطيعوا { بِٱللَّهِ } المطلع على عموم مصالحكم { وَرَسُولِهِ } النائب عنه\n المبعوث من لدنه\n لإرشادكم وتكميلكم { وَأَنفِقُواْ } بمقتضى الأمر الإلهي المنبئ عن محض الحكمة والمصلحة { مِمَّا جَعَلَكُم مُّسْتَخْلَفِينَ فِيهِ } أي: من أموالكم التي استخلفكم الله عليها\n إذ هي كلها لله حقيقة\n لا لكم كما زعمتم\n\n\nفعليكم أن تمتثلوا بأوامر الله سبحانه بالإنفاق والإيثار الذي يزكي أنفسكم من الميل إلى مزخرفات الدنيا\n العائقة عن الوصول إلى جنة المأوى التي هي مقام التسليم والرضا { فَٱلَّذِينَ آمَنُواْ مِنكُمْ } وأكدوا إيمانهم بالإخلاص في عموم الأعمال والأفعال والأخلاق { وَأَنفَقُواْ } بلا شوب المنّ والأذى\n وشين السمعة والرياء { لَهُمْ } سبب إيمانهم وإنفاقهم على وجه الإخلاص { أَجْرٌ كَبِيرٌ } [الحديد: 7] لا أجر أكبر منه وأعلى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { آمِنوا بالله ورسوله } أي: دُوموا على إيمانكم\n إن كان خطاباً للمؤمنين\n فيكون توطئة لدعائهم إلى ما بعده من الإنفاق وغيره لأنهم أهل لهذه الرُتب الرفيعة\n أو: أَحْدِثوا الإيمان\n إن كان خطاباً للكفار\n { وأَنفِقوا } أي: تصدّقوا\n فيشمل الزكاة وغيرها\n { مما جعلكم مستخلفين فيه } أي: جعلكم خلفاء في التصرُّف فيه من غير أن تملكوه حقيقةً\n وما أنتم فيه إلاّ بمنزلة الوكلاء والنُواب\n فأنفِقوا منها في حقوق الله تعالى\n وَلْيَهُنْ عليكم الإنفاق منها\n كما يهون على الرجل الإنفاق من مال غيره إذا أَذِنَ له\n أو: جعلكم مستخلفين ممن كان قبلكم فيما كان في أيديهم بتوريثكم إياه\n وسينقله منكم إلى غيركم\n فاعتبِروا بحالهم ولا تبخلوا به\n { فالذين آمنوا } بالله ورسوله { منكم وأنفَقوا لهم أجرٌ كبير } لا يُقادر قدره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:11",
      "similarity": 0.4255683557338482
    },
    {
      "verse": "9:77",
      "similarity": 0.4036936621542261
    },
    {
      "verse": "35:7",
      "similarity": 0.3988365621631315
    },
    {
      "verse": "11:11",
      "similarity": 0.38282067495573485
    },
    {
      "verse": "17:9",
      "similarity": 0.35746947293841363
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/57:7.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/57:7.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/57:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}