{
  "chapter": "الحديد",
  "text": "وما لكم لا تؤمنون بالله والرسول يدعوكم لتؤمنوا۟ بربكم وقد اخذ ميثقكم ان كنتم مؤمنين",
  "translations": [
    {
      "translation": "And what is the matter with you with you that you do not have iman in Allah, when the Messenger calls you to have iman in your Lord, and He has made a covenant with you if you are muminun?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What has come upon you that you believe not in God, though the Prophet is calling you to believe in your Lord? And He has already taken your pledge, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How is it that you do not believe in Allah when the Messenger calls you to believe in your Lord and although he has taken a covenant from you, if indeed you are believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you are true indeed to this covenant, why do you not believe in God, when His Messenger invites you to believe in your Lord with whom you have made a solemn covenant?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what is the matter with you, that you should not accept faith in Allah? Whereas this Noble Messenger is calling you to believe in your Lord, and Allah has indeed already taken a covenant from you, if you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what is the matter with you that you believe not in Allah! While the Messenger invites you to believe in your Lord; and He has indeed taken your covenant, if you are real believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what reason have you that you should not believe in Allah? And the Apostle calls on you that you may believe in your Lord, and indeed He has made a covenant with you if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How is it with you, that you believe not in God seeing that the Messenger is calling you to believe in your Lord, and He has taken compact with you, if you are believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What aileth you that ye believe not in Allah, when the messenger calleth you to believe in your Lord, and He hath already made a covenant with you, if ye are believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What could be your reason for not believing in God, when the Messenger calls on you to have faith in your Lord and He has already made a covenant with you, if indeed you are true believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what aileth you that ye believe not in Allah whereas the apostle is calling you to believe in your Lord, and He hath already taken your bond, if ye are going to be believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should you not have faith in Allah when the Apostle invites you to have faith in your Lord, and He has certainly made a covenant with you, if you are [genuinely] faithful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What cause have ye why ye should not believe in Allah?- and the Messenger invites you to believe in your Lord, and has indeed taken your Covenant, if ye are men of Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what is the matter with you that you believe not in Allah! While the Messenger (Muhammad SAW) invites you to believe in your Lord (Allah), and He (Allah) has indeed taken your covenant, if you are real believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why is it that you do not believe in Allah, when the Messenger calls on you to believe in your Lord, and He has made a covenant with you if you arebelievers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is the matter with you that you do not believe in God, when the Messenger calls you to believe in your Lord, and He has received a pledge from you, if you are believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why do you not believe in Allah while the Messenger invites you to believe in your Lord and He has taken your covenant, if you should [truly] be believers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:8] And why should you not believe — an address to the disbelievers — in other words, there is nothing to prevent you from believing, in God when the Messenger is calling you to believe in your Lord, and a pledge has been taken from you (reading [it as] ukhidha mīthāqukum; otherwise akhadha mīthāqakum, ‘He has taken a pledge from you’) concerning it — that is to say, God took this [pledge from you] in the world of atoms when He made them bear witness against themselves: ‘Am I not your Lord?’ They said, ‘Yea, indeed’ [Q. 7:172] — if you are believers?, that is to say, if your intention is to believe in Him, then apply yourselves to this [duty of faith].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "648 (What aileth you) people of Mecca (that ye believe not in Allah) that you deny Allah's divine Oneness, (when the messenger) Muhammad (pbuh) (calls you to believe in your Lord) to profess your Lord's divine Oneness, (and He hath already made a covenant with you) and He has already taken your declaration of Allah's divine Oneness, (if ye are believers) on the Day of Covenant?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وما لكم لا تؤمنون بالله } وقد اعتضد السببان الداخلي والخارجي الموجب اجتماعهما للإيمان إيجاباً ذاتياً\n أما الخارجي فدعوة الرسول الذي هو السبب الفاعلي، وأما الداخل فأخذ الميثاق الأزلي وهو الاستعداد الفطري الذي هو السبب القابلي وقوة الاستدلال { إن كنتم مؤمنين } بالقوة، أي: إن بقي نور الفطرة والإيمان الأزلي فيكم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال على طريق الحث والإلزام المشعر بالوعيد: { وَمَا لَكُمْ } أي: أيّ شيء عرض لكم\n وطرأ عليكم { لاَ تُؤْمِنُونَ بِٱللَّهِ } الواحد الأحد الصمد\n المستحق للإطاعة والإيمان { وَ } لا سيما { ٱلرَّسُولُ } المبلغ الكامل في الهداية والتكميل { يَدْعُوكُمْ } بمقتضى الوحي الإلهي المنزل من عنده { لِتُؤْمِنُواْ بِرَبِّكُمْ } مع تأييده بالمعجزات الساطعة\n والحجج القاطعة الدالة على صدقه في دعوته للإيمان\n ورسالته إلى كافة الأنام { وَ } الحال أنه { قَدْ أَخَذَ } الله العليم العلام باستعداداتكم { مِيثَاقَكُمْ } وعهدكم بالإيمان والعرفان في مبدأ فطرتكم\n ومنشأ جبلتكم\n مع أنه جبلكم حين قدر خلقكم\n وأنشأ فطرتكم على جبلة التوحيد والإيمان\n فماذا يمنعكم عنه { إِن كُنتُمْ مُّؤْمِنِينَ } [الحديد: 8] بسبب وموجب\n فهذا موجب لا مزيد عليه؟!\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما لكم لا تؤمنون بالله } هو حال، أي: أيّ شيء حصل لكم غير مؤمنين، وهو توبيخ على ترك الإيمان حسبما أُمروا به، بإنكار أن يكون لهم عذر مّا في الجملة، { والرسولُ يدعوكم } ويُنبهكم عيله، ويُقيم لكم الحجج على ذلك، { لتؤمنوا بربكم وقد أخذ } قبل ذلك عليكم ميثاقه في عالم الذر، على الإقرار بالربوبية، والتصديق بالداعي، بعد أن رَكّب فيكم العقول، فلم يبق لكم عذر في ترك الإيمان، أو: أخذ ميثاقه بنصب الأدلة والتمكين من النظر، فانظروا واعتبروا وآمنوا، { إِن كنتم مؤمنين } بأخذ هذا الميثاق، أو: بموجبٍ ما، فإنَّ هذا موجب لا موجب وراءه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:26",
      "similarity": 0.6839208631114782
    },
    {
      "verse": "5:70",
      "similarity": 0.4610119201324576
    },
    {
      "verse": "5:7",
      "similarity": 0.4563557807770949
    },
    {
      "verse": "12:66",
      "similarity": 0.40595478663279116
    },
    {
      "verse": "13:20",
      "similarity": 0.2964359388730924
    }
  ]
}