{
  "chapter": "الحديد",
  "text": "هو الذى ينزل على عبده ءايتۭ بينت ليخرجكم من الظلمت الى النور وان الله بكم لرءوف رحيم",
  "translations": [
    {
      "translation": "It is He who sends down splendent revelations to His votary that he may take you out of darkness into light; for surely God is gracious and kind to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sends down Clear Signs to His servant so as to bring you out from darkness into light. Surely Allah is Most Kind and Most Compassionate to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends illustrious revelations to His servant to take you out of darkness to light. God is Compassionate and All-merciful to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who sends down clear verses upon His chosen bondman, in order to take you out from the realms of darkness towards light; and indeed Allah is Most Compassionate, Most Merciful upon you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who sends down manifest Ayat to His servant that He may bring you out from darkness into light. And verily, Allah is to you full of kindness, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is who sends down clear communications upon His servant, that he may bring you forth from utter darkness into light; and most surely Allah is Kind, Merciful to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down upon His servant signs, clear signs, that He may bring you forth from the shadows into the light. Surely God is to you All-gentle, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sendeth down clear revelations unto His slave, that He may bring you forth from darkness unto light; and lo! for you, Allah is Full of Pity, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down to His Servant clear revelations, so that He may lead you out of darkness into light. God is indeed compassionate and merciful to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sendeth down Unto His bondman manifest signs that He may bring you forth from darknesses into the light; and verily Allah is Unto you Tender, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down manifest signs to His servant that He may bring you out of darkness into light, and indeed Allah is most kind and merciful to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the One Who sends to His Servant Manifest Signs, that He may lead you from the depths of Darkness into the Light and verily Allah is to you most kind and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who sends down manifest Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) to His slave (Muhammad SAW) that He may bring you out from darkness into light. And verily, Allah is to you full of kindness, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down clear verses to His worshiper, so that He brings you out of the darkness into the light. Indeed, Allah is the Gentle, the Most Merciful to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down upon His servant clear revelations, to bring you out of darkness into the light. God is Gentle towards you, Most Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down upon His Servant [Muhammad] verses of clear evidence that He may bring you out from darknesses into the light. And indeed, Allah is to you Kind and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[57:9] It is He Who sends down upon His servant clear signs, the signs of the Qur’ān, that He may bring you forth from the darkness, [from] disbelief, to the light, [to] faith. For truly God is Kind, Merciful to you, in bringing you forth from disbelief to faith.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is Who sendeth down clear revelations) he sends down Gabriel with clear revelations, expositing commands and prohibitions, the lawful and unlawful (unto His slave) Muhammad (pbuh) (that He may bring you forth) through the Qur'an and the call of Muhammad (pbuh) (from darkness unto light) from disbelief into faith; and it is also said that this means: He has indeed brought you forth from disbelief into faith; (and lo! for you) believers, (Allah is Full of Pity, Merciful) for bringing you forth from disbelief into faith.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { هو الذي ينزِّل على عبده آيات بينات } من بيان تجليات الأفعال والصفات والذات { ليخرجكم } من ظلمات صفات النفس والهيئات البدنية المستفادة من الحس إلى تنوّر القلب ومن ظلمات صفات القلب إلى نور الروح ومن ظلمات وجوداتكم وإنباتكم إلى نور الدين، وهي الظلمات المشار إليها بقوله:\n\n[النور، الآية:40] { وإنّ الله بكم لرؤوف رحيم } يدفع آفة النقصان عنكم بهبة الاستعداد وتوفيق الهداية إلى إزالة الحجب ببعث الرسول وتعليمه إياكم، رحيم بإفاضة الكمالات مع حصول القبول بتزكية النفوس وتصفية الاستعدادات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ { هُوَ } سبحانه الحكيم العليم { ٱلَّذِي يُنَزِّلُ } من مقام فضله وجوده { عَلَىٰ عَبْدِهِ } محمد صلى الله عليه وسلم { آيَاتٍ بَيِّنَاتٍ } مبينات واضحات { لِّيُخْرِجَكُمْ } الله ورسوله { مِّنَ ٱلظُّلُمَاتِ } المتراكمة المتكاثفة من لوازم الطبيعة، ولواحق الحصول { إِلَى ٱلنُّورِ } أي: نور الوجود البحت، الخالص عن مطلق القيود { وَ } اعلموا أيها المكلفون { إِنَّ ٱللَّهَ بِكُمْ } بإرادة إخراجكم من ظلمات الجهل إلى نور اليقين { لَرَءُوفٌ } مشفق عطوف { رَّحِيمٌ } [الحديد: 9] متناهٍ في الرحمة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { هو الذي يُنَزِّلُ على عبده } محمد صلى الله عليه وسلم { آيات بيناتٍ } واضحاتٍ، يعني القرآن، { ليُخرجَكم } أي: الله تعالى، أو العبد { من الظلمات } أي: من ظلمات الكفر والمعاصي والغفلة، إلى نور الإيمان والتوبة واليقظة، { وإنَّ الله بكم لرؤوف رحيم } حيث يهديكم إلى سعادة الدارين، بإرسال الرسول، وتنزيل الآيات، بعد نصب الحُجج العقلية",
      "translations": []
    }
  ]
}