{
  "chapter": "المجادلة",
  "text": "ءاشفقتم ان تقدموا۟ بين يدى نجوىكم صدقت فاذ لم تفعلوا۟ وتاب الله عليكم فاقيموا۟ الصلوة وءاتوا۟ الزكوة واطيعوا۟ الله ورسوله والله خبيرۢ بما تعملون",
  "translations": [
    {
      "translation": "Are you afraid to give gifts of sadaqa before your private consultation? If you do not and Allah turns to you, at least establish salat and pay zakat, and obey Allah and His Messenger. Allah is aware of what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you afraid of giving alms before confering? Then, if you cannot do this, and God forgives you, be constant in your devotional obligations and pay the due share of your wealth for the welfare of others, and obey God and His Prophet. God is aware of all you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you afraid that you will have to offer charity when you hold private conversation with the Prophet? But if you are unable to do so and Allah pardons you, then establish Prayer and pay Zakah, and obey Allah and His Messenger. Allah is well aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were you afraid that giving in charity before your consultation would make you poor? Since you did not offer such charity, God forgave you for this. At least be steadfast in prayer, pay the religious tax, and obey God and His Messenger. God is Well Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were you afraid to offer charity before you consult? So when you did not do this, and Allah has inclined towards you with His mercy, keep the prayers established and pay the obligatory charity and obey Allah and His Noble Messenger; and Allah is Aware of your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you afraid of spending in charity before your private consultation (with him) If then you do it not, and Allah has forgiven you, then perform Salah and give Zakah and obey Allah and His Messenger. And Allah is All-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you fear that you will not (be able to) give in charity before your consultation? So when you do not do it and Allah has turned to you (mercifully), then keep up prayer and pay the poor-rate and obey Allah and His Apostle; and Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you afraid, before your conspiring, to advance freewill offerings? If you do not so, and God turns again unto you, then perform the prayer, and pay the alms, and obey God and His Messenger. God is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fear ye to offer alms before your conference? Then, when ye do it not and Allah hath forgiven you, establish worship and pay the poor-due and obey Allah and His messenger. And Allah is Aware of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you fear that you will not [be able to] give in charity before your consultation? Then if you are unable to do so, [know that] God has turned to you in His mercy; then observe your prayers and pay the prescribed alms and obey God and His Messenger. God is aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shrink ye at your offering the alms before your whispering! Then, when ye could do it not, and Allah relented toward you, establish prayer and pay the poor-rate and obey Allah and His apostle. And Allah is Aware of that which ye work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were you dismayed by having to offer charities before your private talks? Since you did not do it, and Allah has excused you [for not be able to comply], now maintain the prayer and pay the zakat, and obey Allah and His Apostle. Allah is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it that ye are afraid of spending sums in charity before your private consultation (with him)? If, then, ye do not so, and Allah forgives you, then (at least) establish regular prayer; practise regular charity; and obey Allah and His Messenger. And Allah is well-acquainted with all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you afraid of spending in charity before your private consultation (with him)? If then you do it not, and Allah has forgiven you, then (at least) perform As-Salat (Iqamat-as-Salat) and give Zakat and obey Allah (i.e. do all what Allah and His Prophet SAW order you to do). And Allah is All-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you afraid to offer a freewill offering before your consultation? But if you do not, Allah will turn to you again, then establish the prayer and pay theobligatory charity, and be obedient to Allah and His Messenger. Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you reluctant to offer charity before your conversation? If you do not do so, and God pardons you, then perform the prayer, and give alms, and obey God and His Messenger. God is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you feared to present before your consultation charities? Then when you do not and Allah has forgiven you, then [at least] establish prayer and give zakah and obey Allah and His Messenger. And Allah is Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[58:13] Do you fear (read a-ashfaqtum, either pronouncing both hamzas fully, or by replacing the second one with an alif, or not pronouncing it, but inserting an alif between the one not unpronounced and the other one, or without [this insertion]), poverty [when you fear], to offer [voluntary] alms before your secret talks. So, as you did not do this, giving of voluntary alms, and God relented to you, waiving this [requirement] for you, maintain prayer and pay the alms and obey God and His Messenger, that is to say, observe these [duties] regularly. For God is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When they stopped speaking with the Prophet (pbuh) because of the required almsgiving involved, Allah reproached them for doing so, saying: (Fear ye) are you miserly, well off people, (to offer alms before your conference) to offer alms to the poor before speaking with the Prophet (pbuh)? (Then, when ye do it not) when you do not give alms (and Allah hath forgiven you) the question of giving alms, (establish worship) perform the five daily prayers (and pay the poor-due) from your wealth (and obey Allah) in that which He commands you (and His messenger) in that which he commands you. (And Allah is Aware of what ye do) whether it is good or evil. But no one gave alms for speaking with the Prophet (pbuh) except 'Ali Ibn Abi Talib who gave to alms a golden piece which he sold for ten silver pieces, and then asked the Prophet (pbuh) a question often words.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على سبيل الرخصة: { ءَأَشْفَقْتُمْ } وخفتم الفقر والفاقة من { أَن تُقَدِّمُواْ } وتصدقوا { بَيْنَ يَدَيْ نَجْوَاكُمْ } أي: قدام مناجاتكم مع رسول الله صلى الله عليه وسلم { صَدَقَاتٍ } أي: لكل نجوى صدقات ولو كملة طيبة منبئة عن كمال المحبة والوداد { فَإِذْ لَمْ تَفْعَلُواْ } ولم تصدقوا؛ بسبب الإشفاق عن الفقر { وَتَابَ ٱللَّهُ عَلَيْكُمْ } أي: قبل منكم توبتكم إن صدرت عنكم على وجه الندم والإخلاص عن جريمة الإشفاق والتحسر على ما فوتم، وبالجملة: عفا الله عنكم، وتجاوز عن جريمتكم { فَأَقِيمُواْ ٱلصَّلاَةَ } المؤقتة المكتوبة { وَآتُواْ ٱلزَّكَاةَ } المفروضة المقدرة { وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُ } في عموم الأوامر والنواهي على وجه الإخلاص { وَٱللَّهُ } المطلع على ضمائركم ونياتكم { خَبِيرٌ بِمَا تَعْمَلُونَ } [المجادلة: 13] أي: بعموم أعمالكم وإخلاصكم فيها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أأشفقتم أن تُقَدِّموا بين يَدَيْ نجواكم صدقاتٍ } أي: أَخِفْتُم الفقرَ مِن تقديم الصدقات، أو: أَخِفْتُم من هذا الأمر لِما فيه من الإنفاق الذي تكرهه النفوس، { فإِذ لم تفعلوا } ما أُمرتم به وشقّ عليكم، { وتاب اللهُ عليكم } أي: خفّف عنكم، وأزال عنكم المؤاخذة بترك تقديم الصدقة على المناجاة، كما أزال المؤاخذة بالذنب عن التائب عنه، { فأقيموا الصلاةَ وآتُوا الزكاة } أي: فإذا فرَّطتم فيما أُمرتم به من تقديم الصدقات، فتداركوه بالمثابرة على إقام الصلاة وإيتاء الزكاة، { وأطيعوا اللهَ ورسولَه } في سائر الأوامر، فإنَّ القيام بها كالجابر لِما وقع في ذلك من التفريط، { واللهُ خبير بما تعملون } ظاهراً وباطناً، وهو وعدٌ ووعيد\n الإشارة: إذا أردتم مناجاة المشايخ في زيارتكم، فقدِّموا بين يدي نجواكم صدقة، تُدفع للشيخ، أو لأهل داره، فإنها مفتاح لفيض المواهب، مثالها كالدلو، لا يمكن رفع الماء إلاَّ به، ذلك خير لكم، وأطهر لقلوبكم من رذيلة من البخل، فإن لم تجدوا شيئاً فإن الله غفور رحيم\n أأشفقتم أن تُقدِّموا بين يدي نجواكم صدقات لِثَقَلِ ذلك على النفس؟ فإذ لم تفعلوا وزُرتم بلا صدقة، وقد تاب الله عليكم من هذا التفريط، فأقيموا صلاة القلوب، وهو التعظيم، ودوام العكوف في حضرة علاّم الغيوب، وآتوا زكاة أبدانكم، بإجهادها في خدمة المشايخ والإخوان، وأطيعوا الله ورسوله وخلفاءه فيما يأمرونكم به وينهونكم عنه، { والله خبير بما تعملون }\n ثم رجع إلى عتاب المنافقين، فقال: { أَلَمْ تَرَ إِلَى ٱلَّذِينَ تَوَلَّوْاْ قَوْماً }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:27",
      "similarity": 0.5310719741262184
    },
    {
      "verse": "52:26",
      "similarity": 0.5160053871203715
    },
    {
      "verse": "23:57",
      "similarity": 0.49743231353262246
    },
    {
      "verse": "84:16",
      "similarity": 0.4954966411132219
    },
    {
      "verse": "21:28",
      "similarity": 0.46593430905213823
    }
  ]
}