{
  "chapter": "المجادلة",
  "text": "يوم يبعثهم الله جميعا فيحلفون له كما يحلفون لكم ويحسبون انهم على شىء الا انهم هم الكذبون",
  "translations": [
    {
      "translation": "On the Day Allah raises up all of them them together they will swear to Him just as they have sworn to you and imagine they have something to stand upon. No indeed! It is they who are the liars.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day that God will raise them together, they will swear before Him as they swear before you, and imagine they are on the right path. Is it not they who are liars?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when Allah will raise them all from the dead they will swear before Him as they swear before you today, thinking that this will avail them. Behold, they are utter liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when God will resurrect them all together, they will swear to Him as they swore to you and they will think that they have a good case but they are certainly liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when Allah will raise them all, they will swear in His presence the way they now swear in front of you, and they will assume that they have achieved something; pay heed! Indeed it is they who are the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when Allah will resurrect them all together; then they will swear to Him as they swear to you. And they think that they have something. Verily, they are liars!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day that Allah will raise them up all, then they will swear to Him as they swear to you, and they think that they have something; now surely they are the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day when God shall raise them up all together, and they will swear to Him, as they swear to you, and think they are on something. Surely, they are the liars!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when Allah will raise them all together, then will they swear unto Him as they (now) swear unto you, and they will fancy that they have some standing. Lo! is it not they who are the liars?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day God raises them all up from the dead, they will swear to Him just as they have sworn to you, thinking that they are on firm ground. But surely they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This shall befall on a Day whereon Allah shall raise them all together; then they will swear Unto Him even as they swear Unto you, deeming themselves up on aught. Lo! verily they! they are the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when Allah will raise them all together, they will swear to Him, just like they swear to you [now], supposing that they stand on something. Look! They are indeed liars!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One day will Allah raise them all up (for Judgment): then will they swear to Him as they swear to you: And they think that they have something (to stand upon). No, indeed! they are but liars!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when Allah will resurrect them all together (for their account), then they will swear to Him as they swear to you (O Muslims). And they think that they have something (to stand upon). Verily, they are liars!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when Allah shall raise them all up, they will swear to Him as they now swear to you thinking that they are upon something. Indeed, they are the liars!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when God will resurrect them altogether—they will swear to Him, as they swear to you, thinking that they are upon something. Indeed, they themselves are the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day Allah will resurrect them all, and they will swear to Him as they swear to you and think that they are [standing] on something. Unquestionably, it is they who are the liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[58:18] Mention, the day when God will raise them all together, whereupon they will swear to Him, that they are believers, just as they swear to you [now], and suppose that they are [standing] on something, beneficial by swearing in Hereafter just as [they supposed it to have been beneficial for them] in this world. Yet assuredly it is they who are the liars!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَوْمَ يَبْعَثُهُمُ اللَّهُ جَمِيعًا فَيَحْلِفُونَ لَهُ كَمَا يَحْلِفُونَ لَكُمْ وَيَحْسَبُونَ أَنَّهُمْ عَلَى شَيْءٍ أَلَا إِنَّهُمْ هُمُ الْكَاذِبُونَ (18)هذا متصل بقوله : { ويحلفون على الكذب } إلى قوله : { اتخذوا أيمانهم جنة } \\[ المجادلة : 14 - 16 \\] وتقدم الكلام على نظير قوله : { يوم يبعثهم الله جميعاً فينبئهم بما عملوا } \\[ المجادلة : 6 \\] . كما سبق آنفاً في هذه السورة ، أي اذكر يوم يبعثهم الله .وحلفهم لله في الآخرة إشارة إلى ما حكاه الله عنهم في قوله : { ثم لم تكن فتنتهم إلا أن قالوا والله ربنا ما كنا مشركين } \\[ الأنعام : 23 \\] .والتشبيه في قوله : { كما يحلفون لكم } في صفة الحلف ، وهي قولهم : إنهم غير مشركين ، وفي كونه حلفاً على الكذب ، وهم يعلمون ، ولذلك سماه تعالى فتنة في آية \\[ الأنعام : 23 \\] بقوله تعالى : { ثم لم تكن فتنتهم إلا أن قالوا والله ربنا ما كنا مشركين . } ومعنى ويحسبون أنهم على شيء } يظنون يومئذٍ أن حلفهم يفيدهم تصديقَهم عند الله فيحسبون أنهم حصّلوا شيئاً عظيماً ، أي نافعاً .و { على } للاستعلاء المجازي وهو شدة التلبس بالوصف ونحوِه كقوله : { أولئك على هدى من ربهم } في سورة \\[ البقرة : 5 \\] .وحذفت صفة شيء } لظهور معناها من المقام ، أي على شيء نافع ، كقوله تعالى : { قل يا أهل الكتاب لستم على شيء حتى تقيموا التوراة والإنجيل } \\[ المائدة : 68 \\] . وقول النبي صلى الله عليه وسلم لَمّا سُئِل عن الكُهّان «ليسوا بشيء» .وهذا يقتضي توغّلَهم في النفاق ومرونتهم عليه وأنه باققٍ في أرواحهم بعد بعثهم لأن نفوسهم خرجت من عالم الدنيا متخلّقة به ، فإن النفوس إنما تكتسب تزكية أو خبثاً في عالم التكليف . وحكمة إيجاد النفوس في الدنيا هي تزكيتها وتصفية أكدارها لتخلص إلى عالم الخلود طاهرة ، فإن هي سلكت مسلك التزكية تخلصت إلى عالم الخلود زكية ويزيدها الله زكاء وارتياضاً يوم البعث . وإن انغمست مدة الحياة في حمأة النقائص وصلصال الرذائل جاءت يوم القيامة على ما كانت عليه تشويهاً لحالها لتكون مهزلة لأهل المحشر . وقد تبقى في النفوس الزكية خَلائق لا تنافي الفضيلة ولا تناقض عالم الحقيقة مثل الشهوات المباحة ولقاء الأحبة قال تعالى : { الأخلاء يومئذٍ بعضهم لبعض عدو إلا المتقين يا عبادي لا خوف عليكم ولا أنتم تحزنون الذين آمنوا بآياتنا وكانوا مسلمين ادخلوا الجنة أنتم وأزواجكم تحبرون } \\[ الزخرف : 67 70 \\] . وفي الحديث : أن النبي صلى الله عليه وسلم قال : \" إن رجلاً من أهل الجنة يستأذن ربه أن يزرع ، فيقول الله : أو لستَ فيما شئتَ قال : بلى ولكن أحب أن أزرع ، فأسْرع وبذر فيبادر الطرفَ نباتُه واستواؤه واستحصاده وتكويره أمثالَ الجبال . وكان رجل من أهل البادية عند النبي صلى الله عليه وسلم فقال : يا رسول الله لا نجد هذا إلا قرشياً أو أنصارياً فإنهم أصحاب زَرع فأما نحن فلسنا بأصحاب زرع ، فضحك النبي صلى الله عليه وسلم إقراراً لما فهمه الأعرابي \"وفي حديث جابر بن عبد الله عن مسلم أن النبي صلى الله عليه وسلم قال : \" يُبعَث كل عبد على ما مَات عليه \" قال عياض في «الإِكمال» : هو عام في كل حالة مات عليها المرء . قال السيوطي : يبعث الزمار بمزماره . وشارب الخمر بقدحه ا ه . قلت : ثم تتجلى لهم الحقائق على ما هي عليه إذ تصير العلوم على الحقيقة .وختم هذا الكلام بقوله تعالى : { ألا إنهم هم الكاذبون } وهو تذييل جامع لحال كذبهم الذي ذكره الله بقوله : { ويحلفون على الكذب } \\[ المجادلة : 14 \\] . فالمراد أن كذبهم عليكم لا يماثله كذب ، حتى قُصرت صفة الكاذب عليهم بضمير الفصل في قوله : { إنهم هم الكاذبون } وهو قصر ادعائي للمبالغة لعدم الاعتداد بكذب غيرهم . وأكد ذلك بحرف التوكيد توكيداً لمفاد الحصر الادعائي ، وهو أن كذب غيرهم كلا كذب في جانب كذبهم ، وبأداة الاستفتاح المقتضية استمالة السمع لخبرهم لتحقيق تمكن صفة الكذب منهم حتى أنهم يلازمهم يوم البعث .\n\n",
      "translations": [
        {
          "translation": "(On the day) the Day of Judgement (when Allah will raise them all together) the hypocrites and the Jews, (then will they swear unto Him) we were never hypocrites or disbelievers (as they (now) swear unto you) in the life of the world, (and they will fancy that they have some standing) with regard to religion. (Lo! is it not they who are the liars) in their oaths before Allah?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر لهم يا أكمل الرسل على سبيل التوبيخ والتقريع { يَوْمَ يَبْعَثُهُمُ ٱللَّهُ } القادر المقتدر على الإحياء والإماتة في الإبداء والإعادة { جَمِيعاً } مجتمعين\n فيعاتبهم بما صدر عنهم\n مثلما عاتبهم رسول الله صلى الله عليه وسلم { فَيَحْلِفُونَ لَهُ } أي: لله حينئذٍ على أنهم مسلمون مؤمنون { كَمَا يَحْلِفُونَ لَكُمْ } الآن أيها المؤمنون { وَيَحْسَبُونَ } حينئذٍ أيضاً { أَنَّهُمْ عَلَىٰ شَيْءٍ } نفع ودفع حاصل من حلفهم الكاذب\n فيخيلون أنهم يروجون بالحلف الكاذب ما يدعون من الكذب على الله\n كما يروجون عليكم اليوم\n ولم يعلموا أن الناقد حينئذٍ بصير\n والترويج إليه عيسر\n\n\n{ أَلاَ } تنبهوا أيها المؤمنون المخلصون { إِنَّهُمْ } أي: المنافقين { هُمُ ٱلْكَاذِبُونَ } [المجادلة: 18] المقصورون على الكذب والزور\n والتلبيس والغرور\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يومَ يبعثهم اللهُ جميعاً فيحلِفون له } أي: لله تعالى في الآخرة أنهم كانوا مُخلِصين غير منافقين\n { كما يحلفون لكم } في الدنيا على ذلك\n { ويَحْسَبون أنهم } في الدنيا { على شيءٍ } من النفع\n أو: يحسبون في الآخرة أنهم على شيءٍ من النفع\n مِن جلب منفعة أو دفع مضرة\n كما كانوا في الدنيا\n حيث كانوا يدفعون بها عن أزواجهم وأموالهم\n { ألا إِنهم هم الكاذبون } البالغون في الكذب إلى غايةٍ لا مطمح وراءها\n حيث تجاسروا على الكذب بين يدي علاّم الغيوب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:62",
      "similarity": 0.6290053561208045
    },
    {
      "verse": "9:56",
      "similarity": 0.6230986820258468
    },
    {
      "verse": "9:96",
      "similarity": 0.5939224787839871
    },
    {
      "verse": "58:14",
      "similarity": 0.5591088904946979
    },
    {
      "verse": "9:95",
      "similarity": 0.3708044051273973
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/058018.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/058018.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/58:18.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}