{
  "chapter": "المجادلة",
  "text": "قد سمع الله قول التى تجدلك فى زوجها وتشتكى الى الله والله يسمع تحاوركما ان الله سميعۢ بصير",
  "translations": [
    {
      "translation": "Allah has heard the words of the woman who disputes with you about her husband and lays her complaint before Allah. Allah hears the two of you talking together. Allah is All-Hearing, All-Seeing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "GOD CERTAINLY HEARD what the woman who argued with you about her husband, said, and complained to God; and God heard your interrogation. Verily God hears all, and sees everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has surely heard the words of her who contends with you concerning her husband and complains to Allah. Allah hears what both of you say. Verily Allah is All- Hearing, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has certainly heard the words of the woman who disputed with you about her husband and who (after not having received a favorable response from you) complained to God. God was listening to your argument. He is All-hearing and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has indeed heard the speech of the woman who is arguing with you (O dear Prophet Mohammed – peace and blessings be upon him) concerning her husband, and is complaining to Allah; and Allah hears the conversation of you both; indeed Allah is All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah has heard the statement of her that disputes with you concerning her husband, and complains to Allah. And Allah hears the argument between you both. Verily, Allah is All-Hearer, All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah indeed knows the plea of her who pleads with you about her husband and complains to Allah, and Allah knows the contentions of both of you; surely Allah is Hearing, Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has heard the words of her that disputes with thee concerning her husband, and makes complaint unto God. God hears the two of you conversing together; surely God is All-hearing, All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath heard the saying of her that disputeth with thee (Muhammad) concerning her husband, and complaineth unto Allah. And Allah heareth your colloquy. Lo! Allah is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has indeed heard the words of the woman who pleads with you about her husband and lays her complaint before God: God hears what the two of you have to say. God is all hearing, all seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of a surety Allah hath heard the saying of her that disputed with thee concerning her husband and bewailed Unto Allah; and Allah hath heard your mutual discourse. Verlly Allah Is Hearing, Beholding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has certainly heard the speech of her who pleads with you about her husband and complains to Allah. Allah hears the conversation between the two of you. Indeed Allah is all-hearing, all-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has indeed heard (and accepted) the statement of the woman who pleads with thee concerning her husband and carries her complaint (in prayer) to Allah: and Allah (always) hears the arguments between both sides among you: for Allah hears and sees (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah has heard the statement of her (Khaulah bint Tha'labah) that disputes with you (O Muhammad SAW) concerning her husband (Aus bin As-Samit), and complains to Allah. And Allah hears the argument between you both. Verily, Allah is All-Hearer, All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has heard the words of her that reasons with you (Prophet Muhammad) concerning her husband and made her complaint to Allah. Allah has heard both of you discussing with one another. Indeed, Allah is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has heard the statement of she who argued with you concerning her husband, as she complained to God. God heard your conversation. God is Hearing and Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly has Allah heard the speech of the one who argues with you, [O Muhammad], concerning her husband and directs her complaint to Allah. And Allah hears your dialogue; indeed, Allah is Hearing and Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[58:1] God has certainly heard the words of her who disputes with you, [her who] consults you, O Prophet, concerning her husband, who has repudiated her by zihār — he had said to her, ‘You are to me [as untouchable] as the back of my mother’. She asked the Prophet (s) about this and he told her that she was [thenceforth] forbidden to him, as was customary among them [at the time of Jāhiliyya], namely, that repudiation by zihār results in permanent separation. She was Khawla bt. Tha‘laba and he was Aws b. alSāmit — and complains to God, of her being alone and of her impoverishment while having young children, whom if she were to leave with him, they would go astray, but whom, if they remained with her, would go hungry. And God hears your conversation, your consulting. Assuredly God is Hearer, Seer, [He is] Knower.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَدْ سَمِعَ اللَّهُ قَوْلَ الَّتِي تُجَادِلُكَ فِي زَوْجِهَا وَتَشْتَكِي إِلَى اللَّهِ وَاللَّهُ يَسْمَعُ تَحَاوُرَكُمَا إِنَّ اللَّهَ سَمِيعٌ بَصِيرٌ (1)افتتحت آيات أحكام الظهار بذكر سبب نزولها تنويهاً بالمرأة التي وجَّهت شَكواها إلى الله تعالى بأنها لم تقصّر في طلب العدل في حقها وحق بَنِيها . ولم ترضَ بعُنجهية زوجها وابتداره إلى ما ينثر عقد عائلته دون تبصّر ولا روية ، وتعليماً لنساء الأمة الإِسلامية ورجالها واجب الذود عن مصالحها .تلك هي قضية المرأة خولة أو خُويلة مصغراً أو جميلة بنت مالك بن ثعلبة أو بنت دُلَيْج ( مصغراً ) العَوْفية . وربما قالوا : الخزرجية ، وهي من بني عوف بن مالك بن الخزرج ، من بطون الأنصار مع زوجها أوس بن الصامت الخزرجي أخي عُبادة بن الصامت .قيل : إن سبب حدوث هذه القضية أن زوجها رآها وهي تصلي وكانت حسنة الجسم ، فلما سلمت أرادها فأبت فغضب وكان قد ساء خلقه فقال لها : أنتتِ عليّ كظهر أمي .قال ابن عباس : وكان هذا في الجاهلية تحريماً للمرأة مؤبَّداً ( أي وعمل به المسلمون في المدينة بعلم من النبي صلى الله عليه وسلم وإقراره الناس عليه فاستقرّ مشروعاً ) فجاءت خولة رسول الله صلى الله عليه وسلم وذكرت له ذلك ، فقال لها : حَرُمتتِ عليه ، فقالت للرسول صلى الله عليه وسلم إن لي صبية صغاراً إن ضممتهم إليه ضاعوا وإن ضممتهم إليّ جاعوا ، فقال : «ما عندي في أمرككِ شيء» ، فقالت : يا رسول الله ما ذكَر طلاقاً . وإنما هو أبو وَلَدِي وأحب الناس إليّ فقال : «حَرُمتتِ عليه» . فقالت : أشكو إلى الله فاقتي ووجدي . كلما قال رسول الله صلى الله عليه وسلم «حَرُمتتِ عليه» هتفت وشكت إلى الله ، فأنزل الله هذه الآيات .وهذا الحديث رواه داود في كتاب الظهار مجملاً بسند صحيح . وأما تفصيل قصته فمن روايات أهل التفسير وأسباب النزول يزيد بعضها على بعض ، وقد استقصاها الطبري بأسانيده عن ابن عباس وقتادة وأبي العالية ومحمد بن كعب القرظي وكلها متفقة على أن المرأة المجادِلة خولة أو خويلة أو جميلة ، وعلى أن زوجها أَوس بن الصامت .وروى الترمذي وأبو داود حديثاً في الظهار في قصة أخرى منسوبة إلى سَلمة بن صخر البَيَاضي تشبه قصة خولة أنه ظاهرَ من امرأته ظهاراً موقناً برمضان ثم غلبته نفسهُ فَوطئها واستفتى في ذلك رسول الله صلى الله عليه وسلم إلى آخر القصة ، إلاّ أنهما لم يذكرا أن الآية نزلت في ذلك .وإنما نسب ابنُ عطية إلى النقاش أن الآية نزلت بسبب قصة سلمة ولا يعرف هذا لغيره . وَأحسب أن ذلك اختلاط بين القصتين وكيف يصح ذلك وصريح الآية أن السائلة امرأة والذي في حديث سلمة بن صخر أنه هو السائل .و { قد } أصله حرف تحقيق للخبر ، فهو من حروف توكيد الخبر ولكن الخطاب هنا للنبيء صلى الله عليه وسلم وهو لا يخامره تردد في أن الله يعلم ما قالته المرأة التي جادلت في زوجها .فتعيّن أن حرف { قد } هنا مستعمل في التوقع ، أي الإِشعار بحصول ما يتوقعه السامع . قال في «الكشاف» : لأن رسول الله صلى الله عليه وسلم والمجادِلة كانا يتوقعان أن يسمع الله لمجادلتها وشكواها وينزل في ذلك ما يفرج عنها ا ه .ومعنى التوقع الذي يؤذن به حرف { قد } في مثل هذا يؤول إلى تنزيل الذي يَتوقع حصول أمر لشدة استشرافه له منزلةَ المتردد الطالب فتحقيق الخبر من تخريج الكلام على خلاف مقتضى الظاهر لنكتة كما قالوا في تأكيد الخبر ب ( إنَّ ) في قوله تعالى : { ولا تخاطبني في الذين ظلموا إنهم مغرقون } \\[ المؤمنون : 27 \\] إنه جُعل غير السائل كالسائل حيث قُدم إليه ما يلوِّح إليه بالخبر فيستشرف له استشراف الطالب المتردد . ولهذا جزم الرضيّ في «شرح الكافية» بأن { قَد } لا بدّ فيها من معنى التحقيق . ثم يضاف إليه في بعض المواضع معان أخرى .والسماع في قوله : { سمع } معناه الاستجابة للمطلوب وقبُوله بقرينة دخول { قد } التوقعية عليه فإن المتوقَّع هو استجابة شكواها .وقد استُحضرت المرأة بعنوان الصلة تنويهاً بمجادلتها وشكواها لأنها دلت على توكلها الصادق على رحمة ربها بها وبأبنائها وبزوجها .والمجادلة : الاحتجاج والاستدلال ، وتقدمت في قوله : { يجادلونك في الحق بعد ما تبين } في سورة \\[ الأنفال : 6 \\] .والاشتكاء : مبالغة في الشكوى وهي ذكر ما آذاه ، يقال : شكا وتشكى واشتكى وأكثرها مبالغة . اشتكى ، والأكثر أن تكون الشكاية لقصد طلب إزالة الضرّ الذي يشتكي منه بحكم أو نصر أو إشارة بحيلةِ خلاص .وتعلق فعل التجادل بالكون في زوجها على نية مضاف معلوم من المقام في مثل هذا بكثرة : أي في شأن زوجها وقضيته كقوله تعالى : { يجادلنا في قوم لوط } \\[ هود : 74 \\] ، وقوله : { ولا تخاطبني في الذين ظلموا } \\[ المؤمنون : 27 \\] وهو من المسألة الملقبة في «أصول الفقه» بإضافة التحليل والتحريم إلى الأعْيان في نحو { حرمت عليكم الميتة } \\[ المائدة : 3 \\] .والتحاور تفاعل من حار إذا أجاب . فالتحاور حصول الجواب من جانبين ، فاقتضت مراجعةً بين شخصين .والسماع في قوله : { والله يسمع تحاوركما } مستعمل في معناه الحقيقي المناسب لصفات الله إذ لا صارف يصرف عن الحقيقة . وكون الله تعالى عالماً بما جرى من المحاورة معلوم لا يراد من الإِخبار به إفادة الحكم ، فتعيّن صرف الخبر إلى إرادة الاعتناء بذلك التحاور والتنويه به وبعظيم منزلته لاشتماله على ترقّب النبي صلى الله عليه وسلم ما ينزله عليه من وحي ، وترقب المرأة الرحمةَ ، وإلا فإن المسلمين يعلمون أن الله عالم بتحاورهما .وجملة { والله يسمع تحاوركما } في موضع الحال من ضمير { تجادلك } . وجيء بصيغة المضارع لاستحضار حالة مقارنة علم الله لتحاورهما زيادة في التنويه بشأن ذلك التحاور .وجملة { الله سميع بصير } تذييل لجملة { والله يسمع تحاوركما } أي : أن الله عالم بكل صوت وبكل مرئيّ . ومن ذلك محاورة المجادلة ووقوعها عند النبي صلى الله عليه وسلم وتكرير اسم الجلالة في موضع إضماره ثلاث مرات لتربية المهابة وإثارة تعظيم منته تعالى ودواعي شكره .\n\n",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said concerning the interpretation of Allah's 652 saying (Allah hath heard): '(Allah hath heard) He says: Allah heard before He informed you, Muhammad, (the saying of her that disputeth) that speaks to and argues (with thee (Muhammad) concerning her husband, and complaineth unto Allah) and entreats Allah, Exalted is He, to explain her matter. (And Allah heareth your colloquy) and Allah hears your conversation and exchange of words. (Lo! Allah is Hearer) of your conversation, (Knower) of her matter. The story is that Khawlah Bint Tha'labah Ibn Malik Ibn al- Dakhshim al-Ansariyyah was married to Aws Ibn al-Samit al-Ansari and the latter, who was touched by the jinn, wanted to have sexual intercourse with her while in her period. When she refused, he became angry and said: \"if you leave the house before I have sexual intercourse with you, you are unlawful to me just as my mother is\".\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يوم يبعثهم الله } بإقامتهم عن مراقد الأبدان { فينبئهم بما عملوا } لانتقاش صور أعمالهم في ألواح نفوسهم { أحصاه الله } بإثباته في الكتب الأربعة المذكورة { ونسوه } لذهولهم عنه باشتغالهم باللذات الحسية وانهماكهم في الشواغل البدنية { والله على كل شيء شهيد } حاضر معه رقيب { ما يكون من نجوى ثلاثة إلاَّ هو رابعهم } لا بالعدد والمقارنة بل بامتيازهم عنه بتعيناتهم واحتجابهم عنه بماهياتهم وأنياتهم وافتراقهم منه بالإمكان اللازم لماهياتهم وهوياتهم وتحققهم بوجوبه اللازم لذاته واتصاله بهم بهويته المندرجة في هوياتهم وظهوره في مظاهرهم وتستره بماهياتهم ووجوداتهم المشخصة وإقامتها بعين وجوده وإيجابهم بوجوبه\n فبهذه الاعتبارات هو رابع معهم\n ولو اعتبرت الحقيقة لكان عينهم ولهذا قيل: لولا الاعتبارات لارتفعت الحكمة\n وقال أمير المؤمنين عليه السلام: \" العلم نقطة كثرها الجاهلون \"",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَدْ سَمِعَ ٱللَّهُ } السميع المجيب لمناجاة خُلَّص عباده\n العليم بحاجاتهم { قَوْلَ ٱلَّتِي } أي: دعاء المرأة التي { تُجَادِلُكَ } يا أكمل الرسل { فِي } حق { زَوْجِهَا } حين وقع بينهما ظهار\n\n\nرُوي أن خولة بنت ثعلبة ظاهر عنها أوس بن الصامت\n وكان الظهار والإيلاء حينئذٍ من عداد الطلاق\n فاستفتت رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم:\n \" حرمت عليه \" \nفكررها\n فأجاب صلى الله عليه وسلم كذكل { وَ } بعدما أيست أخذت { تَشْتَكِيۤ إِلَى ٱللَّهِ } متضرعة خاشعة فجيعة\n إذ لها أولاد صغار\n ولا متعهد لهم سواها\n فقالت مناجية إلى الله مشتكية: اللهم إني أشكو إليك\n وأتضرع نحوك\n فأنْزِل على نبيك ما يؤلف بيني وبين زوجي\n وترحم على أولادي المعصومين\n وهي على هذا فأوحى سبحانه إلى رسول الله صلى الله عليه وسلم: { قَدْ سَمِعَ ٱللَّهُ\n\n\n } \n { وَٱللَّهُ } على ما جرى بينكما { يَسْمَعُ تَحَاوُرَكُمآ } وتراجعكما في الكلام\n وكيف لا { إِنَّ ٱللَّهَ } العلم بالسرائر والخفايا { سَمِيعٌ } لأقوال عباده { بَصِيرٌ } [المجادلة: 1] بأحوالهم ونياتهم؟!\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { قد سَمِعَ اللّهُ قولَ التي تُجادِلُك } وهي خولة، { في زوجها } أوس، أي: تُراجعك الكلام في شانه، وفيما صدر منه صدر منه في حقها مِن الظِّهار، أو تسألك وتستفيتك. وقال الكواشي: \" قد سمع \" أي: عَلِمَ وأجاب قولها، أي: دعاءها. وفي \" قد \" هنا معنى التوقُّ لأنّ رسول الله صلى الله عليه وسلم والمرأة كانا يتوقعان أن يُنزل اللّهُ في مجادلتهما ما يفرج الله به عنهما. هـ. وقال الفخر: هذه الواقعة تدل على أنّ مَن انقطع رجاؤه من الخلق، ولم يبقَ له في مُهمه أحدٌ إلاَّ الخالق، كفاه الله ذلك المُهم. وقال القشيري: لمّا صدقت في شكواها إلى الله، وأيِسَتْ مِن كشف ضُرِّها من غير الله، أنزل الله في شأنها: { قد سمع الله... } ويقال: صارت قصتها فرجةً ورحمةً للمؤمنين إلى يوم القيامة، في قضية الظهار، ليعلم العالمون أنه لا يخسر على الله أحد. هـ. ولمّا نزلت السورة بإثر الشكوى، قالت عائشة رضي الله عنها: \" ما أسمع الله \" تعجُّباً من سرعة نزولها. { وتشتكي إلى اللهِ } أي: تتضرع إليه، وتُظهر ما بها من الكرب، { واللهُ يسمع تحاورَكما } مراجعتكما الكلام، من: حاور إذا رجع. وصيغة المضارع للدلالة على استمرار السمع، حسب استمرار التحاور وتجدُّده، وفي نظمها في سلك الخطاب تشريفٌ لها. والجملة استئناف، جار مجرى التعليل لِمَا قبله، فإنّ إلحافَها في المسألة، ومبالغتها في التضرُّع إلى الله تعالى، ومدافعته صلى الله عليه وسلم إياها، منبئٌ عن التوقف وترقُّب الوحي، وعلمه تعالى بحالهما من دواعي الإجابة، أي: قد سمع قول المرأة وأجاب طلبتها لأنه يسمع تحاوركما. وقيل: هو حال، وهو بعيد. { إِنَّ الله سميع بصير } تعليل لِما قبله، أي: مُبالغ في العلم بالمسموعات والمبصرات، ومِن قضيته: أن يسمع تحاوركما، ويرى ما يقارنه من الهيئات، التي مِن جملتها: رفع رأسها إلى السماء، وإثارة التضرُّع، وإظهار الاسم الجليل في الموضعين لتربية المهابة، وتعليل الحكم بوصف الألوهية، وتأكيد الجملتين. الإشارة: قد سمع الله قولَ الروح، التي تُجادل في شأن القلب لأنه مقرها ومسكنها، إن صلح صلحت، وإن فسد بحب الدنيا ومتابعة الهوى، فسدت، فهي تُجادل رسولَ الإلهام وتشتكي إلى الله من القلب الفاسد، والله يسمع تحاورهما وتضرعَها إن صدقت في طلب الحق، فيُجيب دعاءها، ويُقيض لها طبيباً يُعالجه، حتى ترجع لأصلها منه، إنّ الله سميعٌ بصير. ثم عاتبهم على استعمال الظِهار، وذَكَر حُكمه، فقال: { ٱلَّذِينَ يُظَاهِرُونَ مِنكُمْ مِّن نِّسَآئِهِمْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:86",
      "similarity": 0.6992929950135892
    },
    {
      "verse": "44:54",
      "similarity": 0.32082346941347967
    },
    {
      "verse": "56:22",
      "similarity": 0.2842063651046287
    },
    {
      "verse": "5:111",
      "similarity": 0.2795887217973445
    },
    {
      "verse": "84:14",
      "similarity": 0.27895199342945864
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/058001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/058001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/58:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}