{
  "chapter": "المجادلة",
  "text": "يايها الذين ءامنوا۟ اذا قيل لكم تفسحوا۟ فى المجلس فافسحوا۟ يفسح الله لكم واذا قيل انشزوا۟ فانشزوا۟ يرفع الله الذين ءامنوا۟ منكم والذين اوتوا۟ العلم درجت والله بما تعملون خبير",
  "translations": [
    {
      "translation": "You who have iman! when you are told: 'Make room in the gathering,' then make room and Allah will and those who have been given knowledge. Allah is aware of what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, when you are told to make room in the assemblies, then make room; God will give you more room to spread. When you are told to rise, then rise; God will raise those of you who believe, and those who have knowledge, in position. God is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when you are told: “Make room for one another in your assemblies,” then make room; Allah will bestow amplitude on you. And when it is said: “Rise up,” then rise up; Allah will raise to high ranks those of you who believe and are endowed with knowledge. Allah is well aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when you are told to make room in a meeting for others, do so. God will then make room for you. When you are told to disperse, do so. God will raise the position of the believers and of those who have received knowledge. God is Well-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! When you are told to give room in the assemblies, then do give room – Allah will give you room (in His mercy); and when it is said, “Stand up in reverence”, then do stand up – Allah will raise the believers among you, and those given knowledge, to high ranks; and Allah is Aware of your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you are told to make room in the assemblies, make room. Allah will give you room. And when you are told to rise up, then rise up. Allah will exalt in degress those of you who believe, and those who have been granted knowledge. And Allah is Well-Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! when it is said to you, Make room in (your) assemblies, then make ample room, Allah will give you ample, and when it is said: Rise up, then rise up. Allah will exalt those of you who believe, and those who are given knowledge, in high degrees; and Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, when it is said to you 'Make room in the assemblies', then make room, and God will make room for you; and when it is said, 'Move up', move up, and God will raise up in rank those of you who believe and have been given knowledge. And God is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! when it is said unto you, Make room! in assemblies, then make room; Allah will make way for you (hereafter). And when it is said, Come up higher! go up higher; Allah will exalt those who believe among you, and those who have knowledge, to high ranks. Allah is Informed of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you are told to make room for one another in your assemblies, then do so, and God will make room for you, and if you are told to rise up, do so: God will raise in rank those of you who believe and those who have been given knowledge: He is fully aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! when it is said Unto you: make room in your assemblies, then make room; Allah will make room for you. And when it is said: rise up, then rise up; Allah will exalt those who believe among you and those who are vouchsafed knowledge, in degrees. And Allah is of whatsoever ye work Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! When you are told, ‘Make room,’ in sittings, then do make room; Allah will make room for you. And when you are told, ‘Rise up!’ Do rise up. Allah will raise in rank those of you who have faith and those who have been given knowledge, and Allah is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! When ye are told to make room in the assemblies, (spread out and) make room: (ample) room will Allah provide for you. And when ye are told to rise up, rise up Allah will rise up, to (suitable) ranks (and degrees), those of you who believe and who have been granted (mystic) Knowledge. And Allah is well-acquainted with all ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you are told to make room in the assemblies, (spread out and) make room. Allah will give you (ample) room (from His Mercy). And when you are told to rise up [for prayers, Jihad (holy fighting in Allah's Cause), or for any other good deed], rise up. Allah will exalt in degree those of you who believe, and those who have been granted knowledge. And Allah is Well-Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, make room in your sitting places when it is asked of you, and Allah will make room for you. When you are asked to move, so move, and Allahwill raise up in ranks those who believed among you and those who have been given knowledge. Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you are told to make room in your gatherings, make room; God will make room for you. And when you are told to disperse, disperse. God elevates those among you who believe, and those given knowledge, many steps. God is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, when you are told, \"Space yourselves\" in assemblies, then make space; Allah will make space for you. And when you are told, \"Arise,\" then arise; Allah will raise those who have believed among you and those who were given knowledge, by degrees. And Allah is Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[58:11] O you who believe, when it is said to you, ‘Make room’ during the assembly, during the assembly [convened] with the Prophet (s) or for remembrance, so that those arriving to [join] you may [find room to] sit (al-majlis, ‘assembly’, may also be read [in the plural] al-majālis) then make room; God will make room for you, in Paradise. And when it is said, ‘Rise up’, stand up for prayer or for other good deeds, do rise up (a variant reading [for unshuzū fa’nshuzū] has anshizū in both instances [sc. anshizū fa’nshizū]); God will raise those of you who have faith, [thereby] obeying this [command], and, He will raise, those who have been given knowledge by degrees, in Paradise. And God is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا أَيُّهَا الَّذِينَ آَمَنُوا إِذَا قِيلَ لَكُمْ تَفَسَّحُوا فِي الْمَجَالِسِ فَافْسَحُوا يَفْسَحِ اللَّهُ لَكُمْ وَإِذَا قِيلَ انْشُزُوا فَانْشُزُوا يَرْفَعِ اللَّهُ الَّذِينَ آَمَنُوا مِنْكُمْ وَالَّذِينَ أُوتُوا الْعِلْمَ دَرَجَاتٍ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ (11)فصل بين آيات الأحكام المتعلقة بالنجوى بهذه الآية مراعاة لاتحاد الموضوع بين مضمون هذه الآية ومضمون التي بعدها في أنهما يجمعهما غرض التأدب مع الرسول صلى الله عليه وسلم وتلك المراعاة أولى من مراعاة اتحاد سياق الأحكام .ففي هذه الآية أدب في مجلس الرسول صلى الله عليه وسلم والآية التي بعدها تتعلق بالأدب في مناجاة الرسول صلى الله عليه وسلم وأخرت تلك عن آيات النجوى العامة إيذاناً بفضلها دون النجوى التي تضمنتها الآيات السابقة ، فاتحاد الجنس في النجوى هو مسوغ الانتقال من النوع الأول إلى النوع الثاني ، والإِيماءُ إلى تميزها بالفضل هو الذي اقتضى الفصل بين النوعين بآية أدب المجلس النبوي .وأيضاً قد كان للمنافقين نية مكر في قضية المجلس كما كان لهم نية مكر في النجوى ، وهذا مما أنشأ مناسبة الانتقال من الكلام على النجوى إلى ذكر التفسح في المجلس النبوي الشريف .روي عن مقاتل أنه قال : كان النبي صلى الله عليه وسلم في الصُفّة ، وكان في المكان ضيق في يوم الجمعة فجاء ناس من أهل بدر فيهم ثابت بن قيس بن شَماس قد سُبقوا في المجلس فقاموا على أرجلهم ينتظرون أن يفسح لهم وكان النبي صلى الله عليه وسلم يكرم أهل بدر فقال لمن حوله : قم يا فلان بعَدد الواقفين من أهل بدر فشقّ ذلك على الذين أقيموا ، وغمز المنافقون وقالوا : ما أُنْصِف هؤلاء ، وقد أحبّوا القرب من نبيئهم فسَبَقوا إلى مجلسه فأنزل الله هذه الآية تطييباً لخاطر الذين أقيموا ، وتعليماً للأمة بواجب رعي فضيلة أصحاب الفضيلة منها ، وواجببِ الاعتراف بمزية أهل المزايا ، قال الله تعالى : { ولا تتمنوا ما فضل الله به بعضكم على بعض } \\[ النساء : 32 \\] ، وقال : { لا يستوي منكم من أنفق من قبل الفتح وقاتل أولئك أعظم درجة من الذين أنفقوا من بعد وقاتلوا وكلاً وعد الله الحسنى } \\[ الحديد : 10 \\] .والخطاب ب { يأيها الذين آمنوا } خطاب لجميع المؤمنين يعم من حضروا المجلس الذي وقعت فيه حادثة سبب النزول وغيرَهم ممن عسى أن يحضر مجلس الرسول صلى الله عليه وسلموابتدئت الآية بالأمر بالتفسح لأن إقامة الذين أقيموا إنما كانت لطلب التفسيح فإناطة الحكم إيماء إلى علة الحكم .والتفسح : التوسع وهو تفعل من فسح له بفتح السين مخففة إذا أوجد له فُسحة في مكان ، وفسُح المكان من باب كرُم إذا صار فسيحاً . ومادة التفعل هنا للتكلف ، أي يكلف أن يجعل فسحة في المكان وذلك بمضايقة مع الجُلاّس .وتعريف { المجلس } يجوز أن يكون تعريف العهد ، وهو مجلس النبي صلى الله عليه وسلم أي إذا قال النبي صلى الله عليه وسلم لكم ذلك لأن أمره لا يكون إلا لمراعاة حق راجح على غيره والمجلس مكان الجلوس .وكان مجلس النبي صلى الله عليه وسلم بمسجده والأكثر أن يكون جلوسه المكان المسمّى بالروضة وهو ما بين منبر النبي صلى الله عليه وسلم وبيته .ويجوز أن يكون تعريف { المجلس } تعريف الجنس . وقوله : { يفسح الله لكم } مجزوم في جواب قوله : { فافسحوا } ، وهو وعد بالجزاء على الامتثال لأمر التفسح من جنس الفعل إذ جعلت توسعة الله على الممتثل جزاءً على امتثاله الذي هو إفساحه لغيره فضمير { لكم } عائد على { الذين آمنوا } باعتبار أن الذين يفسحون هم من جملة المؤمنين لأن الحكم مشاع بين جميع الأمة وإنما الجزاء للذين تعلق بهم الأمر تعلقاً إلزامياً .وحذف متعلق { يفسح الله لكم } ليعم كل ما يتطلب الناس الإِفساح فيه بحقيقته ومجازه في الدنيا والآخرة من مكان ورزق أو جنة عرضها السماوات والأرض على حسب النيات ، وتقديرُه الجزاء موكول إلى إرادة الله تعالى .وحذف فاعل القول لظهوره ، أي إذا قال لكم الرسول : تفسحوا فافسحوا ، فإن الله يثيبكم على ذلك .فالآية لا تدلّ إلاّ على الأمر بالتفسح إذا أمر به النبي صلى الله عليه وسلم ولكن يستفاد منها أن تفسح المسلمين بعضهم لبعض في المجالس محمود مأمور به وجوباً أو ندباً لأنه من المكارمة والإِرفاق . فهو من مكملات واجب التحابّ بين المسلمين وإن كان فيه كلفة على صاحب البقعة يُضايقه فيها غيره . فهي كلفة غير معتبرة إذا قوبلت بمصلحة التحابّ وفوائده ، وذلك ما لم يفض إلى شدة مضايقة ومضرة أو إلى تفويت مصلحة من سماع أو نحوه مثل مجالس العلم والحديث وصفوففِ الصلاة . وذلك قياس على مجلس النبي صلى الله عليه وسلم في أنه مجلس خير . وروي عن النبي صلى الله عليه وسلم \" أحبكم إليّ ألْيَنُكم مناكب في الصلاة \" قال مالك : ما أرى الحكم إلا يطرد في مجالس العلم ونحوها غابرَ الدهر . يريد أن هذا الحكم وإن نزل في مجلس النبي صلى الله عليه وسلم فهو شامل لمجالس المسلمين من مجالس الخير لأن هذا أدب ومؤاساة ، فليس فيه قرينة الخصوصية بالمجالس النبوية ، وأراد مالك ب«نحوها» كل مجلس فيه أمر مهمّ في شؤون الدين فمن حق المسلمين أن يحرصوا على إعانة بعضهم بعضاً على حضوره . وهذا قياس على مجلس النبي صلى الله عليه وسلم وعلته هي التعاون على المصالح .وأفهم لفظ التفسح أنه تجنب للمضايقة والمراصة بحيث يفوت المقصود من حضور ذلك المجلس أو يحصل ألم للجالسين .وقد أرخص مالك في التخلف عن دعوة الوليمة إذا كثر الزحام فيها .وقرأ الجمهور { في المجلس } وقرأه عاصم بصيغة الجمع { في المجالس } وعلى كلتا القراءتين يجوز كون اللام للعهد وكونها للجنس وأن يكون المقصود مجالس النبي صلى الله عليه وسلم كلما تكررت أو ما يشمل جميع مجالس المسلمين ، وعلى كلتا القراءتين يصح أن يكون الأمر في قوله تعالى : { فافسحوا } للوجوب أو للندب .وقوله : { وإذا قيل انشزوا فانشزوا } الآية عطف على { إذا قيل لكم تفسحوا في المجلس } .و { انشزوا } أمر من نَشَز إذا نهض من مكانه يقال : نَشُزَ يَنشِزُ من باب قَعد وضرَب إذا ارتفع لأن النهوض ارتفاع من المكان الذي استقرّ فيه ومنه نشوز المرأة من زوجها مجازاً عن بعدها عن مضجعها . والنشوز : أخص من التفسيح من وجه فهو من عطف الأخص : من وجهٍ على الأعم منه للاهتمام بالمعطوف لأن القيام من المجلس أقوى من التفسيح من قعود . فذكر النشوز لئلا يتوهم وأن التفسيح المأمور به تفسيح من قعود لا سيما وقد كان سبب النزول بنشوز ، وهو المقصود من نزول الآية على ذلك القول . ومن المفسرين من فسر النشوز بمطلق القيام من مجلس الرسول صلى الله عليه وسلم سواء كان لأجل التفسيح أو لغير ذلك مما يؤمر بالقيام لأجله . روي عن ابن عباس وقتادة والحسن «إذا قيل انشزوا إلى الخير وإلى الصلاة فانشزوا» .وقال ابن زيد : إذا قيل انشزوا عن بيت رسول الله صلى الله عليه وسلم فارتفعوا فإن للنبيء صلى الله عليه وسلم حوائج ، وكانوا إذا كانوا في بيته أحبّ كل واحد منهم أن يكون آخر عهده برسول الله صلى الله عليه وسلم وسبب النزول لا يخصص العام ولا يقيد المطلق .وهذا الحكم إذا عسر التفسيح واشتد الزحام والتراصّ فإن لأصحاب المقاعد الحقّ المستقر في أن يستمرّوا قاعدين لا يقام أحد لغيره وذلك إذا كان المقوّم لأجله أولى بالمكان من الذي أقيم له بسبب من أسباب الأوّلية كما فعل النبي صلى الله عليه وسلم في إقامة نفر لإِعطاء مقاعدهم للبدريين . ومنه أولوية طلبة العلم بمجالس الدرس ، وأولوية الناس في مقاعد المساجد بالسبق ، ونحو ذلك ، فإن لم يكن أحد أولى من غيره فقد نهى النبي صلى الله عليه وسلم عن أن يقيم الرجل من مجلسه ثم يجلس فيه .وللرجل أن يرسل إلى المسجد ببساطه أو طنفسته أو سجادته لتبسط له في مكان من المسجد حتى يأتي فيجلس عليها فإن ذلك حوز لذلك المكان في ذلك الوقت . وكان ابن سيرين يرسل غلامه إلى المسجد يوم الجمعة فيجلس له فيه فإذا جاء ابن سرين قام الغلام له منه .وفي «الموطأ» عن مالك بن أبي عامر قال : كنت أرى طنفسة لعقيل بن أبي طالب يوم الجمعة تطرح إلى جدار المسجد الغربي فإذا غشي الطنفسة كلها ظِلُّ الجدار خرج عمر بن الخطاب فصلّى الجمعة . فالطنفسة ونحوها حوز المكان لصاحب البساط .فيجوز لأحد أن يأمر أحداً يبكر إلى المسجد فيأخذ مكاناً يقعد فيه حتى إذا جاء الذي أرسل ترك له البقعة لأن ذلك من قبيل النيابة في حوز الحق .وقرأ نافع وابن عامر وعاصم وأبو جعفر { انشزوا فانشزوا } بضم الشين فيهما . وقرأه الباقون بكسر الشين . وهما لغتان في مضارع نشز .وقوله : { يرفع الله الذين آمنوا منكم والذين أوتوا العلم درجات } جواب الأمر في قوله : { فانشزوا } فقد أجمع القراء على جزم فعل { يرفعْ } فهو جواب الأمر بهذا . وعد بالجزاء على الامتثال للأمر الشرعي فيما فيه أمر أو لما يقتضي الأمر من علّة يقاس بها على المأمور به أمثالُه مما فيه علة الحكم كما تقدم في قوله تعالى : { فافسحوا } .ولما كان النشوز ارتفاعاً عن المكان الذي كان به كان جزاؤه من جنسه .وتنكير { درجات } للإِشارة إلى أنواعها من درجات الدنيا ودرجات الآخرة .وضمير { منكم } خطاب للذين نودوا ب { يأيها الذين آمنوا } .و ( من ) تبعيضية ، أي يرفع الله درجات الذين امتثلوا . وقرينة هذا التقدير هي جعل الفعل جزاء للأمر فإن الجزاء مسبب عما رتب عليه بقوله : { منكم } صفة للذين آمنوا . أي الذين آمنوا من المؤمنين والتغايُر بين معنى الوصف ومعنى الموصوف بتغاير المقدَّر وإن كان لفظ الوصف ولفظ الموصوف مترادفين في الظاهر . فآل الكلام إلى تقدير : يرفع الله الذين استجابوا للأمر بالنشوز إذا كانوا من المؤمنين ، أي دون من يضمه المجلس من المنافقين . فكان مقتضى الظاهر أن يقال : يرفع الله الناشزين منكم فاستحضروا بالموصول بصلة الإِيمان لما تؤذن به الصلة من الإِيماء إلى علة رفع الدرجات لأجل امتثالهم أمرَ القائل { انشزوا } وهو الرسول صلى الله عليه وسلم إن كان لإِيمانهم وأن ذلك الامتثال من إيمانهم ليس لنفاق أو لصاحبه امتعاض .وعطف «الذين أوتوا العلم منهم» عطف الخاص على العام لأن غشيان مجلس الرسول صلى الله عليه وسلم إنما هو لطلب العلم من مواعظه وتعليمه ، أي والذين أوتوا العلم منكم أيها المؤمنون ، لأن الذين أوتوا العلم قد يكون الأمر لأحد بالقيام من المجلس لأجلهم ، أي لأجل إجلاسهم ، وذلك رفع لدرجاتهم في الدنيا ، ولأنهم إذا تمكنوا من مجلس الرسول صلى الله عليه وسلم كان تمكنهم أجمع للفهم وأنفى للملل ، وذلك أدعى لإطالتهم الجلوس وازديادهم التلقي وتوفير مستنبطات أفهامهم فيما يلقى إليهم من العلم ، فإقامة الجالسين في المجلس لأجل إجلاس الذين أوتوا العلم من رفع درجاتهم في الدنيا .ولعل البدريين الذين نزلت الآية بسبب قصتهم كانوا من الصحابة الذين أوتوا العلم .ويجوز أن بعضاً من الذين أمروا بالقيام كان من أهل العلم فأقيم لأجل رجحان فضيلة البدريين عليه ، فيكون في الوعد للذي أقيم من مكانه برفع الدرجات استئناس له بأن الله رافع درجته .هذا تأويل نظم الآية الذي اقتضاه قوة إيجازه . وقد ذهب المفسرون في الإفصاح عن استفادة المعنى من هذا النظم البديع مذاهب كثيرة وما سلكناه أوضح منها .وانتصب { درجات } ، على أنه ظرف مكان يتعلق ب { يرفع } أي : يرفع الله الذين آمنوا رفعاً كائناً في درجات .ويجوز أن يكون نائباً عن المفعول المطلق ل { يرفع } لأنها درجات من الرفع ، أي مرافع .والدرجات مستعارة للكرامة فإن الرفع في الآية رفعاً مجازياً ، وهو التفضيل والكرامة وجيء للاستعارة بترشيحها بكون الرفع درجات . وهذا الترشيح هو أيضاً استعارة مثل الترشيح في قوله تعالى : { ينقضون عهد الله من بعد ميثاقه } \\[ الرعد : 25 \\] وهذا أحسن الترشيح . وقد تقدم نظيره في قوله تعالى في سورة \\[ الأنعام : 83 \\] { نرفع درجات من نشاء . } وقال عبد الله بن مسعود وجماعة من أهل التفسير : إن قوله : والذين أوتوا العلم درجات } كلام مستأنف وتَم الكلام عند قوله : { منكم } قال ابن عطية : ونصب بفعل مُضمر ولعله يعني : نُصب { درجات } بفعل هو الخبر عن المبتدأ ، والتقدير : جعلهم .وجملة { والله بما تعملون خبير } تذييل ، أي الله عليم بأعمالكم ومختلف نياتكم من الامتثال كقول النبي صلى الله عليه وسلم « لا يُكلَمُ أحد في سبيل الله . والله أعلم بمن يكلَم في سبيله » الحديث .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe! When it is said) when the Prophet (pbuh) says: (Make room in assemblies, then make room; Allah will make way for you (Hereafter)) in the Hereafter. This was revealed about Thabit Ibn Qays Ibn Shammas whose story is mentioned in the Surah of the Private Apartments. It is also said it was revealed about a group of people from Badr, among whom were Thabit Ibn Qays Ibn Shammas. These people went to the Prophet (pbuh) on a Friday when he was staying in the apartment of his wife Safiyyah. When they could not find a place where to sit, they stood at the beginning of the assembly. So the Prophet (pbuh) addressed some people who were not among those who participated in the Battle of Badr: so-and-so and so-and-so and so-and-so let those who took part in the Battle of Badr sit in your places. This is because the Prophet (pbuh) used to honour all those who fought at the battle of Badr. But when he did that, he noticed that those who were made to give up their seats resented it, and so Allah revealed about them this verse. (And when it is said, Come up higher!) in prayer, jihad or remembrance (go up higher; Allah will exalt those who believe) in secret and openly (among you) in ranks, (and those who have knowledge) along with faith, (to high ranks) merits in Paradise, more than the merits given to those who have faith but have no knowledge. This is because a believer who is knowledgeable is better than a believer who is not. (Allah is informed of what ye do) of good or evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ إِذَا قِيلَ لَكُمْ تَفَسَّحُواْ فِي ٱلْمَجَالِسِ فَٱفْسَحُواْ يَفْسَحِ ٱللَّهُ لَكُمْ } معناه أوسِعُوا\n\n\n\n\nوقوله تعالى: { وَإِذَا قِيلَ ٱنشُزُواْ فَانشُزُواْ } معناه إذا قِيلَ لَكُم قُوموا فَقوموا\n\n",
      "translations": [
        {
          "translation": " The meaning of the verse is \"Oh you who have believed, when it is said to you, 'Make room in the assemblies,' then make room; Allah will make room for you.\"\n\n\nAnd when it is said to them, \"Get up,\" they get up.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n الموروثة لكم عن إيمانكم وعرفانكم: { إِذَا قِيلَ لَكُمْ } وقت تضيقكم وتحسبكم: { تَفَسَّحُواْ } وتوسعوا { فِي ٱلْمَجَالِسِ } أي: مطلق المجالس المحافل { فَٱفْسَحُواْ } ووسعوا مبادرين بلا مدل وتخرج وتضجر { يَفْسَحِ ٱللَّهُ لَكُمْ } ويوسع عليكم في عموم ما تريدون الوسعة فيه\n بل { وَإِذَا قِيلَ } لكم: { ٱنشُزُواْ } وانهضوا\n واخرجوا من المضائق والمجالس { فَانشُزُواْ } طائعين راغبين\n مريدين الثواب من الله بتوسيعكم على إخوانكم\n ولا تتوهموا الإذلال بالنشوز\n بل { يَرْفَعِ ٱللَّهُ } القادر المقتدر على وجه الإنعام { ٱلَّذِينَ آمَنُواْ مِنكُمْ } ونشزوا عن المضائق\n لمصلحة إخوانه طوعاً درجات من القرب والمكانة\n إذ المؤمن العارف المتمكن في مرتبة اليقين الحقي لا يتفاوت عنده المدح والذم\n والإعزاز والإذلال\n والمضرة والسمرة\n والمنح والمحن مطلقاً\n\n\n{ وَ } بالجملة: { ٱلَّذِينَ أُوتُواْ ٱلْعِلْمَ } من حضرة العلم الإلهي { دَرَجَاتٍ } لا يكتنه وصفها ولا حصرها { وَ } بالجملة: { ٱللَّهُ } المطلع بضمائركم { بِمَا تَعْمَلُونَ } من الاستكبار والاستكراه\n وتوهم الإذلال والاستنكاف عن الامتثال { خَبِيرٌ } [المجادلة: 11] يجازيكم على مقتضى خبرته\n\n\nثمَّ أشار سبحانه إلى تعظيم رسوله صلى الله عليه وسلم\n وتأديب من تبعه من المؤمنين المسترشدين منه فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم بالله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { يا أيها الذينَ آمنوا إذا قيل لكم تفسحوا في المجلس } [المجادلة: 11] أي: توسَعوا فيه، وقيل: \" في المجلس \" متعلق بقيل، أي: إذا قيل لكم في المجلس تفسّحوا فافسحوا، والمراد: مجلس الرسول صلى الله عليه وسلم، وكانوا يتضامُّون فيه تنافساً فيه صلى الله عليه وسلم وحرصاً على استماع كلامه. وقرأ عاصم \" مجالس \" أي: في مجالس الرسول التي تجلسونها. وقيل: المراد: مجالس القتال، وهي مراكز الغزاة، كقوله تعالى:\n[آل عمران: 121] قيل: كان الرجل يأتي الصف، فيقول: تفَسَّحوا، فيأبَوا، لحرصهم. والأول أنسب بذكر النجوى أولاً وثانياً. فإن امتثلتم وتفسحتم { يَفْسَحِ اللهُ لكم } في كل ما تريدون التفسُّح فيه، من الرزق، والدار، والصدر، والقبر، والجنة، والعلم، والمعرفة. { وإِذا قيل انشُزُوا } أي: ارتفعوا من مجلسه، وانهضوا للصلاة، أو الجهاد، أو غيرهما من أعمال البر، أو: انشزوا للتوسعة في المجلس على المقبِلين، { فانشُزُوا } أي: فانهضوا ولا تُبطِئوا، وقيل: كانوا يُطيلون الجلوس معه صلى الله عليه وسلم وربما جلس قوم حتى يؤمروا بالقيام، فأُمروا بالقيام وعدم التثقيل. وفي مضارع \" نشز \" لغتان الضم والكسر، والأمر تابع له. { يَرْفَعِ اللّهُ الذين آمنوا منكم } بامتثال أوامره وأَمْرِ رسوله، بالنصر وحسن الذكر في الدنيا، والإيواء إلى غرف الجنان في الآخرة. { و } يرفع { الذين أُوتوا العلمَ } خصوصاً { درجاتٍ } عالية، بما جمعوا من أثريْ العلم والعمل، فإنّ العلم مع علو رتبته يزيد مع العمل رفعةً لا يُدرك شأوها، بخلاف العلم العاري عن العمل، وإن كان له شرف في الجملة، ولذلك يُقتدى بالعالِم في أفعاله فقط. وفي هذه الدرجات قولان، أحدهما: في الدنيا، في الرتبة والشرف والتعظيم، والآخر: في الآخرة، وهو أرجح. وعن ابن عباس رضي الله عنهما: \" يرفع العالم فوق المؤمن سبعمائة درجة، بين كل درجة كما بين السماء والأرض \" ، ومثل هذا لا يُقال بالرأي. وتقدير الآية: يرفع الله الذي آمنوا منكم درجةً، والذين أُوتوا العلم درجات، وقيل: \" درجات \" يرجع لهما معاً، وتفضيل أهل العلم يؤخذ من خارج. وعن ابن مسعود رضي الله عنه، أنه كان إذا قرأها قال: \" يا أيها الناس افهموا هذه الآية، ولترغبكم في العلم \". وعن النبي صلى الله عليه وسلم:\n \" فضل العالم على العابد كفضل القمر ليلة البدرعلى سائر الكواكب \" \n، وعنه صلى الله عليه وسلم:\n \" عبادة العالم يوماً واحداً تعدل عبادة العابد أربعين سنة \" \nيعني الجاهل، وعنه صلى الله عليه وسلم:\n \" يشفعُ يومَ القيامة ثلاثةٌ: الأنبياء، ثم العلماء، ثم الشهداء \" \n، فأَعْظِم بمرتبةٍ هي واسطة بين النبوة والشهادة، بشهادة رسول الله صلى الله عليه وسلم، ويشمل الحديث العلماء بالله وبأحكام الله، وعن ابن عباس رضي الله عنهما: خُيّر سليمان عليه السلام بين العلم والمال والمُلك، فاخترا العلم، فأعطى المالَ والمُلكَ معه.\nوقال صلى الله عليه وسلم:\n \" أوحى اللّهُ إلى إبراهيم عليه السلام: يا إبراهيم إني عليم، أُحب كل عليم \" \nوعن بعض الحكماء: ليت شعري أيّ شيءٍ أدرك مَن فاته العلم؟ وأيّ شيءٍ فات مَن أدرك العلم؟ والعلوم أنواع، وشرفها باعتبار المعلوم، فأفضل العلوم: العلم بالذات العلية، على نعت الكشف والعيان، ثم العلم بالصفات والأسماء، ثم العلم بالأحكام، ثم العلم بالآلات الموصلة إليه. { واللهُ بما تعملون خبير } تهديد لمَن لم يمتثل الأمر. والله تعالى أعلم. الإشارة: ما قيل في مجلس العِلم يُقال في مجلس الوعظ، بل هو عينه لأنه العلم النافع، فإذا قَدِمَ واحدٌ من الفقراء أو غيرهم لمجلس الشيخ، فوجد فُرجة جلس فيها، وإلاّ جلس خلف الحلقة، ولو مع النعال، فلا يُزاحم ولا يُقم أحداً ليجلس، إلاّ أن يأمره الشيخ بالتقدُّم لمنفعة فيه في إعانة الشيخ، فليتقدّم برفق ولطافة وأدب. وإذا قيل لأهل المجلس: تفسَّحوا فليتفسَّحوا، يفسح الله لهم في العلم والعرفان، والأخلاق والوجدان، والمقامات، وسائر ما يطلب التوسُّع فيه. وإذا قيل: انشُزُوا لصلاة أو خدمة أو ملاقاة، فانشُزُوا، يرفع الله الذين آمنوا منكم، وليس فيهم أهلية لصريح المعرفة درجةً عن العامة، حيث صَحِبُوا العارفين للتبرُّك والحُرمة. ويرفع الذين أُتوا العلم بالذات، على سبيل الكشف والعيان، درجات، سبعمائة درجة، على العالم صاحب الدليل والبرهان، فيرفع العالِم فوق الجاهل سبعمائة درجة، ويرفع العارف فوق العالِم سبعمائة. فالناس أربع طبقات: الطبعة العيا الأولياء والعارفون بالله، ثم العلماء، ثم الصالحون، ثم عامة المؤمنين. والمراد بالأولياء مَن منَّ اللّهُ عليه بملاقاة شيخ التربية، حتى دخل مقام الفناء والبقاء، زاح عنه حجاب الكائنات، وأفضى إلى شهود المكوِّن، فهؤلاء هم المقرَّبون الصدِّيقون، والمراد بالعلماء العاملون المخلِصون. قال في \" لطائف المنن \": وحيثما وقع العِلم في كتاب الله عزّ وجل، وكلام رسول الله صلى الله عليه وسلم فإنما المراد به النافع، المخمِد للهوى، القامع للنفس، الذي تكتنفه الخشية، وتكون معه الإنابة، قال الله تعالى:\n[فاطر: 28]، فلم يجعل عِلم مَن لم يخشَ من العلماء علماً، فشاهد العلم الذي هو مطلوب الله: الخشية، وشاهد الخشية: موافقة الأمر، وأمّا عِلم مَن يكوم معه الرغبة في الدنيا، والتملُّق لأربابها، وصرف الهمة لاكتسابها، والجمع والإدخار، والمباهاة والاستكثار، وطول الأمل ونسيان الآخرة، فما أبعد مَن هذا وصفه من أن يكون من ورثة الأنبياء عليهم السلام، وهل ينتقل الشيء الموروث إلى الوارث إلاّ بالصفة التي كان بها عند الموروث، ومثَلُ من هذه الأوصاف وصفُه كمَثَل الشمعة تُضيء على غيرها وهي تحرق نفسها، جعل الله عِلمَ مَن هذا وصفه حجة عليه، وسبباً في تكثير العقوبة لديه، ولا يغرنك أن يكون به انتفاع للبادي والحاضر، فقد قال صلى الله عليه وسلم:\n\n \" إنَّ الله يؤيدُ هذا الدين بالرجل الفاجر \" \n، ومثَلُ مَن تعلّم العلم لاكتساب الدنيا، وتحصيل الرفعة بها، كمثل مَن رفع العذرة بملعقة من ياقوت، فما أشرف الوسيلة، وما أخس المتوسل إليه! ومثَلُ مَن قطع الأوقات في طلب العلم، فمكث أربعين سنة يتعلّم العلم ولا يعمل به، كمثل مَن قعد هذه المدة يتطهّر ويُجدد الطهارة، ولم يُصلِّ صلاةً واحدة، إذ مقصود العلم العمل، كما أنَّ المقصود بالطهارة وجود الصلاة، ولقد سأل رجلٌ الحسنَ البصري عن مسألة، فأفتاه فيها، فقال الرجل للحسن: قد خالفك الفقهاءُ، فزجره الحسن، وقال: ويحك، وهل رأيت فقيهاً، إنما الفقيه مَن فقه عن الله أمْرَه ونهيه. وسمعتُ شيخنا أبا العباس رضي الله عنه يقول: الفقيه مَن انفقأ الحجاب عن عينيْ قلبه، فشاهد ملكوت ربه. انتهى كلامه. فالعلماء المخلِصون الذين عرفوا الله من طريق البرهان، تلي درجتهم درجةَ الأولياء الذين هم أهل الشهود والعيان، ثم الصالحون الأبرار، ثم عامة المؤمنين، ومَن قال خلاف هذا فهو جاهل بمرتبة الولاية، قال صلى الله عليه وسلم:\n \" عامة أهل الجنة البُله \" \nوعِلِّيُون لذوي الألباب، وذووا الألباب هم أهل البصائر، الذين فتح الله بصيرتَهم، وتطهّرت سريرتهم بالمجاهدة والرياضة، حتى شاهدوا الحق وعرفوه، وقال تعالى:\n[الزمر: 17، 18]، وراجع ما تقدّم في تفسيرها، وكل مَن كان محجوباً عن الله، يتسدل بغيره عليه، فهو من البُله، إلاّ أنّ صاحب الاستدلال أربع من المقلِّد، أي: سَلِمَ من الوسواس، وإلاّ فالمقلِّد أحسن منه. ولمّا تكلم في الإحياء على درجات التوحيد، قال: \" والدرجة العليا في ذلك للأنبياء، ثم للأوياء العارفين، ثم للعلماء الراسخين، ثم الصالحين \" ، فقدَّم الأولياء على العلماء. وقال الأستاذ القشيري في أول رسالته: فقد جعل الله هذه الطائفة صفوة أوليائه، وفضَّلهم على الكافة من عباده بعد رسله وأنبيائه. هـ. سُئل ابن رشد - رحمه الله - عن قول الغزالي والقشيري بتفضيل الأولياء على العلماء، فقال: أمّا تفضيل العارفين بالله على العارفين بأحكام الله فقول الأستاذ أبي حامد متفق عليه، ولا يشك عاقل أنّ العارفين بما يجب لله من أوصاف الجلال ونعوت الكمال أفضل من العارفين بالأحكام، بل العارفون بالله أفضل من أهل الأصول والفروع لأنّ العلم يشرف بشرف المعلوم. ثم أطال الكلام في الاستدلال على ذلك، فانظر. ذكره في المعيار. وقال بعضهم في تفضيل العارف على العالِم: إنّ العارف فوق ما يقول، والعالِم دون ما يقول، يعني: أن العارف إذا تكلم في مقام من مقامات اليقين، كان قَدَمُه فوق ما وصف، لأنه يسلكه دوماً ثم يصفه، والعالم إنما يصفه بالنعت، وأيضاً: العالِم يدلك على العمل، والعارف يُخرجك عن شهود العمل، العالِم يحملك حِمل التكليف، والعارف يروحك بشهود التعريف، العالِم يَدُلك على علم الرسوم، والعارف يُعرّفك بذات الحي القيوم، العالِمَ يَدُلك على الأسباب، والعارف يدلك على مُسبِّب الأسباب، العالِم يَدُلك على شهود الوسائط، والعارف يَدُلك على محرك الوسائط، العالِم يُحذّرك من الوقوف مع الأغيار، والعارف يُحذّرك من الوقوف مع الأنوار، ويزج بك في حضرة الأسرار، العالِم يُحذّرك من الشرك الجلي، والعارف يُخلِّصك من الشرك الخفي، إلى غير من الفروقات بين العارف والعالم.\nومن اصطلاحات الصوفية، أنَّ العالِم بالأحكام يسمى عالماً، والعالِم بالذات عياناً وكشفاً يسمى عارفاً، كما في القوت. وبالله التوفيق. ثم ذكر آداب مناجاة الرسول صلى الله عليه وسلم، فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ إِذَا نَاجَيْتُمُ ٱلرَّسُولَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:128",
      "similarity": 0.16897301791806177
    },
    {
      "verse": "4:34",
      "similarity": 0.1529119319087962
    },
    {
      "verse": "2:259",
      "similarity": 0.10436057207294162
    },
    {
      "verse": "6:83",
      "similarity": 0.07019562832331193
    },
    {
      "verse": "6:165",
      "similarity": 0.06850470840206888
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/058011.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/058011.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/58:11.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}