{
  "chapter": "المجادلة",
  "text": "استحوذ عليهم الشيطن فانسىهم ذكر الله او۟لئك حزب الشيطن الا ان حزب الشيطن هم الخسرون",
  "translations": [
    {
      "translation": "Shaytan has gained mastery over them and made them forget the remembrance of Allah. Such people are the party of Shaytan. No indeed! It is the party of Shaytan who are the losers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan has got the better of them. and made them forget to remember God. Indeed they belong to Satan's faction. Will not Satan's faction perish?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan has gained mastery over them and has made them neglect remembering Allah. They are the party of Satan. Behold, the party of Satan will be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan has dominated them and has made them forget the guidance of God. They are Satan's party and the party of Satan will certainly suffer a great loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The devil has overpowered them, so they forgot the remembrance of Allah; they are the devil’s group; pay heed! Indeed it is the devil’s group who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Shaytan has overpowered them. So he has made them forget the remembrance of Allah. They are the party of Shaytan. Verily, it is the party of Shaytan that will be the losers!.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Shaitan has gained the mastery over them, so he has made them forget the remembrance of Allah; they are the Shaitan's party; now surely the Shaitan's party are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan has gained the mastery over them, and caused them to forget God's Remembrance. Those are Satan's party; why, Satan's party, surely, they are the losers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The devil hath engrossed them and so hath caused them to forget remembrance of Allah. They are the devil's party. Lo! is it not the devil's party who will be the losers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan has got the better of them and has caused them to forget the remembrance of God. They have gone over to the side of the devil, and it is as the devil's partisans that they shall be the losers:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Satan hath overpowered them, and so hath caused them to forget the remembrance of Allah. These are the band of the Satan. Lo! verily it is the Satan's band that shall be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan has prevailed upon them, so he has caused them to forget the remembrance of Allah. They are Satan’s confederates. Look! Indeed, it is Satan’s confederates who are the losers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Evil One has got the better of them: so he has made them lose the remembrance of Allah. They are the Party of the Evil One. Truly, it is the Party of the Evil One that will perish!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shaitan (Satan) has overtaken them. So he has made them forget the remembrance of Allah. They are the party of Shaitan (Satan). Verily, it is the party of Shaitan (Satan) that will be the losers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "satan has mastered them and caused them to forget the Remembrance of Allah. Those are satan's party; and satan's party shall assuredly be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan has taken hold of them, and so has caused them to forget the remembrance of God. These are the partisans of Satan. Indeed, it is Satan’s partisans who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan has overcome them and made them forget the remembrance of Allah. Those are the party of Satan. Unquestionably, the party of Satan - they will be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[58:19] Satan has prevailed upon them, by their obedience of him, and so he has caused them to forget the remembrance of God. Those are Satan’s confederates, his followers. Yet it is indeed Satan’s confederates who are the losers!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The devil hath engrossed them) Satan has conquered them and commanded them to obey him, and they did, (and so hath caused them to forget remembrance of Allah) until they left obeying Allah in private. (They) i.e. the hypocrites and the Jews (are the devil's party) the army of the devil. (Lo! is it not the devil's party) the devil's army (who will be the losers) of the life of the world and the Hereafter?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱسْتَحْوَذَ عَلَيْهِمُ ٱلشَّيْطَانُ } معناه غَلَبَ عليهِم وحازَهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ { ٱسْتَحْوَذَ } أي: غلب واستولى { عَلَيْهِمُ ٱلشَّيْطَانُ } المضل المغوي { فَأَنسَاهُمْ ذِكْرَ ٱللَّهِ } المنقذ عن الضلال، المرشد إلى الهداية، وبالجملة: { أُوْلَـٰئِكَ } الأشقياء المطرودون { حِزْبُ الشَّيْطَانِ } أي: جنوده وأتباعه { أَلاَ إِنَّ حِزْبَ الشَّيْطَانِ هُمُ الخَاسِرُونَ } [المجادلة: 19] المقصورون على الخسران المؤبد، والحرمان المخلد عن ربح المعرفة واليقين؟!\n\n\n\nأعذانا الله وعموم عباده من متابعة الشيطان المضل المغوي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { استحوذَ عليهم الشيطانُ } استولى عليهم ومَلَكَهم، { فأنساهم ذكرَ الله } بحيث لم يذكروه بقلوبهم ولا بألسنتهم، { أولئك حزبُ الشيطان } أي: جنوده وأتباعه، { ألا إِنّ حزبَ الشيطان هم الخاسرون } أي: الموصوفون بالخسران الذي لا غياية وراءه، حيث فوّتوا على أنفسهم النعيم المقيم، وأخذوا بدله العذاب الأليم، وفي تصدير الجمة بحرفي التنبيه والتحقيق، وإظهار الشيطان معاً في موضع الإضمارِ، وتوسيط ضمير الفصل، من فنون التأكيد ما لا يخفى\n الإشارة: منافقون الصوفية هم الذين يُقرُّون أهلَ الظاهر وينصرونهم، ويُنكرون على أهل الباطن، فإذا لقوهم أظهروا لهم المودّة والوفاق، وادَّعوا أنهم منهم، فهم مذبذبون بين ذلك، لا إلى هؤلاء، ولا إلى هؤلاء، ليسوا من أهل الظاهر المحض، ولا من أهل الباطن، لعدم تحققهم به، تجر الآية ذيلَها عليهم\n\n\nوالعذاب المعدّ لهم غم الحجاب، وتخلُّفهم عن درجات المقربين\n قوله تعالى: { اتخذوا أَيمانهم جُنة } قال القشيري: مَن استتر بحُجة طاعته لأجل دنياه انكشف لسهام التقدير من حيث لا يشعر، ثم لا دينُه يبقى، ولا دنياه تَسْلَم\n قال تعالى: { لن تُغني عنهم أموالُهم ولا أولادهم من الله شيئاً } الآية\n هـ\n يوم يبعثهم الله جميعاً فيتحاشون إلى المقربين، ويحلفون بلسان حالهم: أنهم كانوا منهم، كما يحلفون اليوم، ويظنون أنهم من أهل الباطن، ويحسبون أنهم على شيء، فيبدوا لهم من الله ما لم يكونوا يحتسبون، وذلك لعدم صُحبتهم للعارفين المخلِصين، حصل لهم الغلظ، فوقفوا مع حُسبانهم الضال، ولو دامت صُحبتُهم لأهل التوحيد الخاص لتنبّهوا لغلطهم\n استحوذ عليهم الشيطانُ، فزيّن لهم الوقوفَ مع ما هم فيه، فأنساهم ذكرَ العيان، فكانوا من حزب الشيطان في الجملة، بالنسبة إلى مَن فوقهم\n قال شاة الكرماني: علامة استحواذ الشيطان على العبد: أن يشغله بعمارة ظاهره، من المأكل والملبس، ويشغل قلبه عن التفكُّر في آلاء الله ونعمائه، والقيام بشكرها، ويشغل لسانه عن ذكر ربه، بالكذب والغيبة والبهتان، ويشغل قلبه عن التفكُّر والمراقبة بتدبير الدنيا وجمعها\n هـ\n ثم ذكر مآل حزب الشيطان، فقال: { إِنَّ الَّذِينَ يُحَآدُّونَ ٱللَّهَ وَرَسُولَهُ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:141",
      "similarity": 0.7122009393340657
    },
    {
      "verse": "35:6",
      "similarity": 0.17958414648344045
    },
    {
      "verse": "40:30",
      "similarity": 0.1637353393407306
    },
    {
      "verse": "5:56",
      "similarity": 0.15972382897848877
    },
    {
      "verse": "33:22",
      "similarity": 0.1572496304919258
    }
  ]
}