{
  "chapter": "المجادلة",
  "text": "لن تغنى عنهم امولهم ولا اولدهم من الله شيـا او۟لئك اصحب النار هم فيها خلدون",
  "translations": [
    {
      "translation": "Neither their wealth nor their children will help them at all against Allah. Such people are the Companions of the Fire, remaining in it timelessly, for ever.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither their wealth nor children will avail them against God. They are the people of Hell, and there will abide for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither their possessions nor their offspring will be of any avail to them against Allah. They are the people of the Fire; therein they shall abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither their wealth nor their children will be able to protect them against God. They will be the dwellers of hell fire wherein they will live forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their wealth and their children will be of no use to them before Allah; they are the people of hell; they are to remain in it forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their children and their wealth will avail them nothing against Allah. They will be the dwellers of the Fire to dwell therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither their wealth nor their children shall avail them aught against Allah; they are the inmates of the fire, therein they shall abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither their riches nor their children shall avail them anything against God; those -- they are the inhabitants of the Fire, therein dwelling forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their wealth and their children will avail them naught against Allah. Such are rightful owners of the Fire; they will abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither their wealth nor their children will be of the least avail [in protecting them] against God -- they are the inheritors of Hell, and there they shall remain forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will not avail them against Allah their riches or their children at all. Th are the fellows of the Fire; therein they will be abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their possessions and children will not avail them in any way against Allah. They shall be the inmates of the Fire and they shall remain in it [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of no profit whatever to them, against Allah, will be their riches nor their sons: they will be Companions of the Fire, to dwell therein (for aye)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their children and their wealth will avail them nothing against Allah. They will be (the) dwellers of the Fire, to dwell therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither their wealth nor their children shall help them a thing against Allah. They are the inhabitants of the Fire, and there they shall live for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither their possessions nor their children will avail them anything against God. These are the inhabitants of the Fire, dwelling therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never will their wealth or their children avail them against Allah at all. Those are the companions of the Fire; they will abide therein eternally\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[58:17] Neither their possessions nor their children will avail them in any way against God, against His chastisement. Those — they are the inhabitants of the Fire, wherein they will abide.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلَنْ تُغْنِيَ عَنْهُمْ أَمْوَالُهُمْ وَلَا أَوْلَادُهُمْ مِنَ اللَّهِ شَيْئًا أُولَئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ (17)مناسب لقوله : { اتخذوا أيمانهم جنة } \\[ المجادلة : 16 \\] فكما لم تَقِهم أيمانهم العذابَ لم تُغن عنهم أموالهم ولا أنصارهم شيئاً يوم القيامة .وكان المنافقون من أهل الثراء بالمدينة ، وكان ثراؤهم من أسباب إعراضهم عن قبول الإِسلام لأنهم كانوا أهل سيادة فلم يرضوا أن يصيروا في طبقة عموم الناس . وكان عبد الله بنُ أُبيّ ابن سلول مهيّأً لأن يملكوه على المدينة قبيل إسلام الأنصار ، فكانوا يفخرون على المسلمين بوفرة الأموال وكثرة العشائر وذلك في السنة الأولى من الهجرة ، ومن ذلك قول عبدِ الله بن أُبيّ ابن سلول «لئن رجعنا إلى المدينة ليُخرجن الأعزّ منها الأذل» يريد بالأعز فريقه وبالأذل فريق المسلمين فآذنهم الله بأن أموالهم وأولادهم لا تغني عنهم مما توعدهم الله به من المذلة في الدنيا والعذاب في الآخرة قال تعالى : { لئن لم ينته المنافقون والذين في قلوبهم مرض والمرجفون في المدينة لنغرينك بهم ثم لا يجاورونك فيها إلا قليلاً ملعونين أينما ثقفوا أخذوا وقتلوا تقتيلاً } \\[ الأحزاب : 60 ، 61 \\] . وإذا لم تغن عنهم من الله في الدنيا فإنها أجدر بأن لا تغني عنهم من عذاب الآخرة شيئاً ، أي شيئاً قليلاً من الإِغناء .وعن مقاتل : أنهم قالوا : إن محمداً يزعم أنه ينصر يوم القيامة لقد شقينا إذن . فوالله لنُنْصَرَنّ يوم القيامة بأنفسنا وأولادنا وأموالنا إن كانت قيامة . فنزلت هذه الآية .وإقحام حرف النفي في المعطوف على المنفي لتوكيد انتفاء الإِغناء .ومعنى { من الله } من بأس الله أو من عذابه . وحذفُ مثل هذا كثير في الكلام . وتقديره ظاهر . ويلقب هذا الاستعمال عند علماء أصول الفقه بإضافة الحكم إلى الأعيان على إرادة أشهر أحوالها نحو { حرمت عليكم الميتة } \\[ المائدة : 3 \\] ، أي أكلها .وجملة { لن تغني عنهم أموالهم } الخ خبر ثالث أو ثان عن ( إنّ ) في قوله تعالى : { إنهم ساء ما كانوا يعملون } \\[ المجادلة : 15 \\] .وجملة { أولئك أصحاب النار هم فيها خالدون } في موضع العلة لِجملة { لن تغني عنهم أموالهم ولا أولادهم من الله شيئاً } ، أي لأنهم أصحاب النار ، أي حق عليهم أنهم أصحاب النار . وصاحب الشيء ملازمه فلا يفارقه . إذ قد تقرر من قوله : { أعد الله لهم عذاباً شديداً } \\[ المجادلة : 15 \\] ومن قوله : { فلهم عذاب مهين } \\[ المجادلة : 16 \\] أنهم لا محيص لهم عن النار ، فكيف تغني عنهم أموالهم وأولادهم شيئاً من عذاب النار . وهذا كقوله تعالى : { أفمن حق عليه كلمة العذاب أفأنت تنقذ من في النار } \\[ الزمر : 19 \\] أي ما أنت تنقذه من النار . فإن اسم الإِشارة في مثل هذا الموقع ينبه على أن المشار إليه صار جديراً بما يرد بعد اسم الإِشارة من أجل الأخبار التي أخبر بها عنه قبل اسم الإِشارة كما تقدم في قوله تعالى : { أولئك على هدى من ربهم } في سورة \\[ البقرة : 5 \\] .\n\n",
      "translations": [
        {
          "translation": "(Their wealth) the abundance of the wealth of the hypocrites and the Jews (and their children) and the abundance of their children (will avail them naught against Allah) against Allah's chastisement. (Such) the hypocrites and the Jews (are rightful owners of the Fire) the inhabitants of the Fire; (they will abide therein) for eternity, neither to die nor leave it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { هُمْ فِيهَا خَالِدُونَ } [المجادلة: 17] مخلدون\n لا يرجى نجاتهم منها أصلاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أولئك } الموصوفون بما ذكر من القبائح { أصحابُ النار } ملازموها { هم فيها خالدون }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:116",
      "similarity": 0.9802338894022993
    },
    {
      "verse": "3:10",
      "similarity": 0.5142073702945048
    },
    {
      "verse": "7:36",
      "similarity": 0.5003147771399591
    },
    {
      "verse": "69:28",
      "similarity": 0.4986876624027272
    },
    {
      "verse": "2:39",
      "similarity": 0.4895267333592305
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/058017.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/058017.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/58:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}