{
  "chapter": "المجادلة",
  "text": "قد سمع الله قول التى تجدلك فى زوجها وتشتكى الى الله والله يسمع تحاوركما ان الله سميعۢ بصير",
  "translations": [
    {
      "translation": "Allah has heard the words of the woman who disputes with you about her husband and lays her complaint before Allah. Allah hears the two of you talking together. Allah is All-Hearing, All-Seeing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "GOD CERTAINLY HEARD what the woman who argued with you about her husband, said, and complained to God; and God heard your interrogation. Verily God hears all, and sees everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has surely heard the words of her who contends with you concerning her husband and complains to Allah. Allah hears what both of you say. Verily Allah is All- Hearing, All-Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has certainly heard the words of the woman who disputed with you about her husband and who (after not having received a favorable response from you) complained to God. God was listening to your argument. He is All-hearing and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has indeed heard the speech of the woman who is arguing with you (O dear Prophet Mohammed – peace and blessings be upon him) concerning her husband, and is complaining to Allah; and Allah hears the conversation of you both; indeed Allah is All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah has heard the statement of her that disputes with you concerning her husband, and complains to Allah. And Allah hears the argument between you both. Verily, Allah is All-Hearer, All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah indeed knows the plea of her who pleads with you about her husband and complains to Allah, and Allah knows the contentions of both of you; surely Allah is Hearing, Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has heard the words of her that disputes with thee concerning her husband, and makes complaint unto God. God hears the two of you conversing together; surely God is All-hearing, All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath heard the saying of her that disputeth with thee (Muhammad) concerning her husband, and complaineth unto Allah. And Allah heareth your colloquy. Lo! Allah is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has indeed heard the words of the woman who pleads with you about her husband and lays her complaint before God: God hears what the two of you have to say. God is all hearing, all seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of a surety Allah hath heard the saying of her that disputed with thee concerning her husband and bewailed Unto Allah; and Allah hath heard your mutual discourse. Verlly Allah Is Hearing, Beholding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has certainly heard the speech of her who pleads with you about her husband and complains to Allah. Allah hears the conversation between the two of you. Indeed Allah is all-hearing, all-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has indeed heard (and accepted) the statement of the woman who pleads with thee concerning her husband and carries her complaint (in prayer) to Allah: and Allah (always) hears the arguments between both sides among you: for Allah hears and sees (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah has heard the statement of her (Khaulah bint Tha'labah) that disputes with you (O Muhammad SAW) concerning her husband (Aus bin As-Samit), and complains to Allah. And Allah hears the argument between you both. Verily, Allah is All-Hearer, All-Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has heard the words of her that reasons with you (Prophet Muhammad) concerning her husband and made her complaint to Allah. Allah has heard both of you discussing with one another. Indeed, Allah is the Hearer, the Seer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has heard the statement of she who argued with you concerning her husband, as she complained to God. God heard your conversation. God is Hearing and Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly has Allah heard the speech of the one who argues with you, [O Muhammad], concerning her husband and directs her complaint to Allah. And Allah hears your dialogue; indeed, Allah is Hearing and Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[58:1] God has certainly heard the words of her who disputes with you, [her who] consults you, O Prophet, concerning her husband, who has repudiated her by zihār — he had said to her, ‘You are to me [as untouchable] as the back of my mother’. She asked the Prophet (s) about this and he told her that she was [thenceforth] forbidden to him, as was customary among them [at the time of Jāhiliyya], namely, that repudiation by zihār results in permanent separation. She was Khawla bt. Tha‘laba and he was Aws b. alSāmit — and complains to God, of her being alone and of her impoverishment while having young children, whom if she were to leave with him, they would go astray, but whom, if they remained with her, would go hungry. And God hears your conversation, your consulting. Assuredly God is Hearer, Seer, [He is] Knower.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said concerning the interpretation of Allah's 652 saying (Allah hath heard): '(Allah hath heard) He says: Allah heard before He informed you, Muhammad, (the saying of her that disputeth) that speaks to and argues (with thee (Muhammad) concerning her husband, and complaineth unto Allah) and entreats Allah, Exalted is He, to explain her matter. (And Allah heareth your colloquy) and Allah hears your conversation and exchange of words. (Lo! Allah is Hearer) of your conversation, (Knower) of her matter. The story is that Khawlah Bint Tha'labah Ibn Malik Ibn al- Dakhshim al-Ansariyyah was married to Aws Ibn al-Samit al-Ansari and the latter, who was touched by the jinn, wanted to have sexual intercourse with her while in her period. When she refused, he became angry and said: \"if you leave the house before I have sexual intercourse with you, you are unlawful to me just as my mother is\".\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَدْ سَمِعَ ٱللَّهُ } السميع المجيب لمناجاة خُلَّص عباده\n العليم بحاجاتهم { قَوْلَ ٱلَّتِي } أي: دعاء المرأة التي { تُجَادِلُكَ } يا أكمل الرسل { فِي } حق { زَوْجِهَا } حين وقع بينهما ظهار\n\n\nرُوي أن خولة بنت ثعلبة ظاهر عنها أوس بن الصامت\n وكان الظهار والإيلاء حينئذٍ من عداد الطلاق\n فاستفتت رسول الله صلى الله عليه وسلم فقال رسول الله صلى الله عليه وسلم:\n \" حرمت عليه \" \nفكررها\n فأجاب صلى الله عليه وسلم كذكل { وَ } بعدما أيست أخذت { تَشْتَكِيۤ إِلَى ٱللَّهِ } متضرعة خاشعة فجيعة\n إذ لها أولاد صغار\n ولا متعهد لهم سواها\n فقالت مناجية إلى الله مشتكية: اللهم إني أشكو إليك\n وأتضرع نحوك\n فأنْزِل على نبيك ما يؤلف بيني وبين زوجي\n وترحم على أولادي المعصومين\n وهي على هذا فأوحى سبحانه إلى رسول الله صلى الله عليه وسلم: { قَدْ سَمِعَ ٱللَّهُ\n\n\n } \n { وَٱللَّهُ } على ما جرى بينكما { يَسْمَعُ تَحَاوُرَكُمآ } وتراجعكما في الكلام\n وكيف لا { إِنَّ ٱللَّهَ } العلم بالسرائر والخفايا { سَمِيعٌ } لأقوال عباده { بَصِيرٌ } [المجادلة: 1] بأحوالهم ونياتهم؟!\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:86",
      "similarity": 0.6992929950135892
    },
    {
      "verse": "44:54",
      "similarity": 0.32082346941347967
    },
    {
      "verse": "56:22",
      "similarity": 0.2842063651046287
    },
    {
      "verse": "5:111",
      "similarity": 0.2795887217973445
    },
    {
      "verse": "84:14",
      "similarity": 0.27895199342945864
    }
  ]
}