{
  "chapter": "المجادلة",
  "text": "لا تجد قوما يؤمنون بالله واليوم الءاخر يوادون من حاد الله ورسوله ولو كانوا۟ ءاباءهم او ابناءهم او اخونهم او عشيرتهم او۟لئك كتب فى قلوبهم الايمن وايدهم بروح منه ويدخلهم جنت تجرى من تحتها الانهر خلدين فيها رضى الله عنهم ورضوا۟ عنه او۟لئك حزب الله الا ان حزب الله هم المفلحون",
  "translations": [
    {
      "translation": "You will not find people who have iman in Allah and the Last Day having love for anyone who opposes Allah and His Messenger, though they be their fathers, their sons, their brothers or their clan. Allah has inscribed iman upon such people's hearts and will reinforce them with a Ruh from Him and admit them into Gardens with rivers flowing under them, remaining in them timelessly, for ever. Allah is pleased with them and they are pleased with Him. Such people are the party of Allah. Truly it is the party of Allah who are successful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will not find those who believe in God and the Day of Resurrection, loving those who oppose God and His Prophet, even though they be their fathers, sons, or brothers or their kin. God has inscribed on their hearts belief, and has succoured them with His own grace, and will admit them to gardens with rivers flowing by, where they will abide for ever, God accepting them, and they, happy in the pleasure of God. They are verily the army of God. Will not the army of God be victorious?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall not find a people who believe in Allah and the Last Day befriending those who oppose Allah and His Messenger even though they be their fathers or their sons or their brothers or their kindred. He has inscribed faith in their hearts and has strengthened them with a spirit from Him, and He shall make them enter Gardens beneath which rivers flow. Therein they shall abide. Allah is well-pleased with them, and they are well-pleased with Him. They belong to Allah's party. Verily Allah's party shall prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will not find any people of faith in God and the Day of Judgment who would establish friendship with those who oppose God and His Messenger, even if it would be in the interest of their fathers, sons, brothers, and kinsmen. God has established faith in their hearts and supported them by a Spirit from Himself. He will admit them to Paradise wherein streams flow to live therein forever. God is pleased with them and they are pleased with God. These are members of the party of God and the party of God will certainly have everlasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will not find the people who believe in Allah and the Last Day, befriending those who oppose Allah and His Noble Messenger, even if they are their fathers or their sons or their brothers or their tribesmen; it is these upon whose hearts Allah has ingrained faith, and has aided them with a Spirit from Himself; and He will admit them into Gardens beneath which rivers flow, abiding in them forever; Allah is pleased with them, and they are pleased with Him; this is Allah’s group; pay heed! Indeed it is Allah’s group who are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will not find any people who believe in Allah and the Last Day, making friendship with those who oppose Allah and His Messenger, even though they were their fathers or their sons or their brothers or their kindred. For such He has written faith in their hearts, and strengthened them with Ruh from Himself. And He will admit them to Gardens under which rivers flow, to dwell therein (forever). Allah is well pleased with them, and they are well pleased with Him. They are the party of Allah. Verily, the party of Allah will be the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall not find a people who believe in Allah and the latter day befriending those who act in opposition to Allah and His Apostle, even though they were their (own) fathers, or their sons, or their brothers, or their kinsfolk; these are they into whose hearts He has impressed faith, and whom He has strengthened with an inspiration from Him: and He will cause them to enter gardens beneath which rivers flow, abiding therein; Allah is well-pleased with them and they are well-pleased with Him these are Allah's party: now surely the party of Allah are the successful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou shalt not find any people who believe in God and the Last Day who are loving to anyone who opposes. God and His Messenger, not though they were their fathers, or their sons, or their brothers, or their clan. Those -- He has written faith upon their hearts, and He has confirmed them with a Spirit from Himself; and He shall admit them into gardens underneath which rivers flow, therein to dwell forever, God being well-pleased with them, and they well-pleased with Him. Those are God's party; why, surely God's party -- they are the prosperers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou wilt not find folk who believe in Allah and the Last Day loving those who oppose Allah and His messenger, even though they be their fathers or their sons or their brethren or their clan. As for such, He hath written faith upon their hearts and hath strengthened them with a Spirit from Him, and He will bring them into Gardens underneath which rivers flow, wherein they will abide. Allah is well pleased with them, and they are well pleased with Him. They are Allah's party. Lo! is it not Allah's party who are the successful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will find no believers in God and the Last Day consorting with those who oppose God and His Messenger, even though they be their fathers, their sons, their brothers or their close relatives. He has engraved faith on their very hearts and has strengthened them with a spirit of His own. He will usher them into Gardens through which rivers flow where they shall dwell forever. God is well-pleased with them and they are well pleased with Him. They are God's party. God's party shall surely enter into a state of bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou shalt not find a people who believe in Allah and the Last Day befriending those who oppose Allah and His apostle, even though they be their fathers or their sons or their brethren or their kindred. These! He hath inscribed faith on their hearts and hath strengthened them with a spirit from Him: and He shall make them enter Gardens whereunder rivers flow as abiders therein. Allah is well pleased with them, and they are well pleased with Him. These are Allah's band. Lo! verily it is the Allah's band that are the blissful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will not find a people believing in Allah and the Last Day endearing those who oppose Allah and His Apostle even though they were their own parents, or children, or brothers, or kinsfolk. [For] such, He has written faith into their hearts and strengthened them with a spirit from Him. He will admit them into gardens with streams running in them, to remain in them [forever], Allah is pleased with them, and they are pleased with Him. They are Allah’s confederates. Look! The confederates of Allah are indeed felicitous!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou wilt not find any people who believe in Allah and the Last Day, loving those who resist Allah and His Messenger, even though they were their fathers or their sons, or their brothers, or their kindred. For such He has written Faith in their hearts, and strengthened them with a spirit from Himself. And He will admit them to Gardens beneath which Rivers flow, to dwell therein (for ever). Allah will be well pleased with them, and they with Him. They are the Party of Allah. Truly it is the Party of Allah that will achieve Felicity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You (O Muhammad SAW) will not find any people who believe in Allah and the Last Day, making friendship with those who oppose Allah and His Messenger (Muhammad SAW), even though they were their fathers, or their sons, or their brothers, or their kindred (people). For such He has written Faith in their hearts, and strengthened them with Ruh (proofs, light and true guidance) from Himself. And We will admit them to Gardens (Paradise) under which rivers flow, to dwell therein (forever). Allah is pleased with them, and they with Him. They are the Party of Allah. Verily, it is the Party of Allah that will be the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You shall find no nation believing in Allah and the Last Day loving anyone that opposes Allah and His Messenger, even though they be their fathers, theirsons, their brothers, or their tribe. Those, He has written upon their hearts faith and strengthened them with a spirit from Him. He will admit them to the Gardensunderneath which rivers flow, where they shall live for ever. Allah is pleased with them and they are pleased with Him. They are the Party of Allah; and the Party ofAllah are the winners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will not find a people who believe in God and the Last Day, loving those who oppose God and His Messenger, even if they were their parents, or their children, or their siblings, or their close relatives. These—He has inscribed faith in their hearts, and has supported them with a spirit from Him. And He will admit them into Gardens beneath which rivers flow, wherein they will dwell forever. God is pleased with them, and they are pleased with Him. These are the partisans of God. Indeed, it is God’s partisans who are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will not find a people who believe in Allah and the Last Day having affection for those who oppose Allah and His Messenger, even if they were their fathers or their sons or their brothers or their kindred. Those - He has decreed within their hearts faith and supported them with spirit from Him. And We will admit them to gardens beneath which rivers flow, wherein they abide eternally. Allah is pleased with them, and they are pleased with Him - those are the party of Allah. Unquestionably, the party of Allah - they are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[58:22] You will not find a people who believe in God and the Last Day loving, befriending, those who oppose God and His Messenger, even though they, the opposers, were their fathers, that is to say, the believers’ [fathers], or their sons or their brothers or their clan, rather [you will find that] they intend to do them harm and they fight them over [the question of] faith, as occurred on one occasion with some Companions, may God be pleased with them. [For] those, the ones who are not loving of them, He has inscribed, He has established, faith upon their hearts and reinforced them with a spirit, a light, from Him, exalted be He, and He will admit them into gardens underneath which rivers flow, wherein they will abide, God being pleased with them, for their obedience of Him, and they being pleased with Him, because of His reward. Those [they] are God’s confederates, following His command and refraining from what He has forbidden. Assuredly it is God’s confederates who are the successful, the winners.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then revealed about Hatib Ibn Abi Balta'ah, a man from the Yemen, who wrote a letter to the people of Mecca in which he divulged one of the secrets of the Prophet (pbuh) saying: (Thou wilt not find) Muhammad (folk) i.e. Hatib (who believe in Allah and the Last Day) resurrection after death (loving those who oppose) contravene against (Allah and His messenger) in matters of religion, meaning here the people of Mecca: (even though they be their fathers) blood fathers (or, their sons or their brethren or their clan) or their own folk or relatives. (As for such) Hatib and his fellow believers, (He hath written faith upon their hearts) He cast love of faith in their hearts (and hath strengthened them with a Spirit from Him) with a mercy from Him; and it is said this means: He helped them with a help from Him, (and He will bring them into Gardens beneath which) beneath its trees and habitations (rivers flow) rivers of wine, water, honey and milk flow, (wherein they will abide) they will dwell in Paradise for eternity, never to die or leave it. (Allah is well pleased with them) because of their faith, works and repentance, (and they are well pleased with Him) 656 because of the reward and honour they receive from Him. (They are Allah's party) they are Allah's army. (Lo! is it not Allah's party who are the successful?) they are saved from His wrath and chastisement; these are the ones who found and obtained what they were seeking, and were saved from the evil of that which they fled from. Hatib was of those who took part in the Battle of Badr, and his story is found in surah \"She that is to be examined (al-Mumtahanah)\". And of the surah in which Exile is mentioned which is all Medinan, and consists of 24 verses, 745 words and 1,712 letters: Surah 59: Exile (al-Hashr) And of the surah in which Exile is mentioned which is all Medinan, and consists of 24 verses, 745 words and 1,712 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَنْ حَآدَّ ٱللَّهَ وَرَسُولَهُ } معناه من شَاقَّ الله وعَاداهُ\n\n\n\n\nوقوله تعالى: { وَأَيَّدَهُمْ بِرُوحٍ مِّنْهُ } معناه قَوّاهم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, { Whoever opposes Allah and His Messenger } means whoever is disobedient to Allah and His Messenger.\n\n\nAnd His words {and reinforced them with a spirit from Him} mean He empowered them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على سبيل العظة والتذكير بعموم المؤمنين: { لاَّ تَجِدُ قَوْماً يُؤْمِنُونَ بِٱللَّهِ وَٱلْيَوْمِ ٱلآخِرِ } المعدّ للحساب والجزاء { يُوَآدُّونَ } أي: لا تجدهم أن يوادوا وتحاببوا { مَنْ حَآدَّ ٱللَّهَ } وعاداه { وَرَسُولَهُ وَلَوْ كَانُوۤاْ } أي: الحادون العادون المعاندون { آبَآءَهُمْ } أي: آباء المؤمنين { أَوْ أَبْنَآءَهُمْ أَوْ إِخْوَانَهُمْ أَوْ عَشِيرَتَهُمْ } وأقرباءهم\n وذووا أرحامهم { أُوْلَـٰئِكَ } المقبولون الممتنعون عن و ودادة أعداء الله وأعداء رسوله صلى الله عليه وسلم طلباً لمرضات الله ومرضاة رسوله صلى الله عليه وسلم { كَتَبَ } أي: أثبت ومكن سبحانه { فِي قُلُوبِهِمُ ٱلإِيمَانَ } وجعله راسخاً فيها\n\n\n{ وَ } لذلك { أَيَّدَهُمْ بِرُوحٍ } فائض { مِّنْهُ } محيي لهم أبد الآباد\n إذ من يُحيى بالإيمان والعرفان فقد دامت حياته\n ولم يمت أبداً { وَيُدْخِلُهُمْ جَنَّاتٍ } متنزهات العلم والعين والحق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } أي: أنهار المعارف والحقائق المترشحة من بحر الحياة الأزلي الأبدي الذي هو الوجود المطلق الإلهي { خَالِدِينَ فِيهَا } لا يتحولون عنها أصلاً\n إذ { رَضِيَ ٱللَّهُ } المتجلي عليهم بالرضا { عَنْهُمْ وَرَضُواْ } أيضاً { عَنْهُ } سبحانه بالتفويض والتسليم إليه { أُوْلَـٰئِكَ } السعداء المقبولون عند الله { حِزْبُ ٱللَّهِ } وحوامل آثار أوصافه وأسمائه الذاتية\n وقوابل عموم كلياته وشئونه وتطوراته { أَلاَ } أي: تنبهوا أيه الأظلال السمتظلون بضلاله الممدودة من أزل الذات إلى أبد الأسماء والصفات { إِنَّ حِزْبَ ٱللَّهِ هُمُ ٱلْمُفْلِحُونَ } [المجادلة: 22] الفائزون من لدنه بالفوز العظيم\n والفضل الجسيم\n والكرم العميم\n\nخاتمة السورة\n\nعليك أيها الطالب المترقب للفلاح\n والفوز بالنجاح أن تتمكن في مقام التسليم والرضا بعموم ما جرى عليك من القضاء\n وتلازم على آداب الخدمة بين يدي الله في عموم أوقاتك وحالاتك\n فاغراً همَّك وسرك عن مطلق الوساوس والأشغال العائقة عن التوجه نحو المولى\n وتواظب على الطاعات والعبادات في خلال الخلوات\n لتكون مصونة عن السمعة والرياء\n والميل إلى العجب والهوى\n وإياك إياك أن تتلطخ بقاذورات الدنيا ومزخرفاتها الملهية عن اللذات الأخروية\n المستتبعة للسلاسل والأغلال الإمكانية\n والمبعدة عن الوصول إلى فضاء الوجوب وصفاء الوحدة الذاتية التي عبر بها عن النعيم الموعود\n والحوض المورود\n والمقام المحمود\n\n\nجعلنا الله ممن وصل إليه\n وتمكن دونه بمنِّه وجوده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { تجد } إما متعدٍّ إلى اثنين، و \" يوادون \" الثاني، أو إلى واحد، بمعنى: تصادف\n و \" يوادون \": حال من \" قوم \" ، لتخصيصه بالصفة، أو صفة ثانية\n يقول الحق جلّ جلاله: { لا تجدُ } أيها الرسول، أو: كل مَن يسمع { قَوْماً يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الآخِرِ يُوَادُّونَ مَنْ حَادَّ اللَّهَ } أي: خالفه { ورسولَه } أي: عاده، أي: لا تجد قوماً مؤمنين يُوالون المشركين، أي: لا ينبغي أن يكون ذلك، وحقه أن يمتنع ولا يوجد بحال، مبالغة في الزجر عن موالاة أعداء الله، والاحتراز عن مخالطتهم ومعاشرتهم، وزاد ذلك الأمر تأكيداً وتشديداً بقوله: { ولو كانوا آباءهم أو أبناءهم أو إِخوانَهم أو عشيرتَهم } أي: لو كان مَن حادّ الله ورسلَه مِن أقرب الناس إليه، فإنَّ قضية الإيمان بالله تعالى أن يهجر كُلَّ مَن حادَ عنه بالمرة، وهذه حال أهل الصدق في الإيمان، ولذلك كان الصحابة رضي الله عنهم يُقاتلون آباءهم وأبناءهم وإخوانهم، فقد قَتَلَ أبو عبيدة بنُ الجراح أباه، وأتى برأسه للنبي صلى الله عليه وسلم، طاعةً لله ورسوله، وقال سعدُ بن أبي وقاص: \" كنتُ جاهداً على قتل أخي عُتبة، يوم بدر \"\n وفيهم نزلت الآية\n والجمع باعتبار معنى \" مَن \" كما أنّ الإفراد فيما قبله باعتبار لفظها\n { أولئك } الموصوفون بما ذكر، وما فيه من معنى البُعد لرفع درجتهم في الفضل، وهو مبتدأ خبره: { كَتَبَ في قلوبهم الإِيمان } أي: أثبته فيها، وفيه دلالة على خروج الأعمال مِن مفهوم الإيمان، فإنَّ جزء الثابت في القلب ثابت، فيه، ولا شيء من أعمال الجوارح يثبتُ فيه\n { وأيَّدهم } أي: قوَّاهم { برُوحٍ منه } أي: من عنده تعالى، وهو نور اليقين، أو: القرآن، أو: النصر على العدو، ويجوز أن يكون الضمير للإيمان، أي: بروح من الإيمان، على أنه في نفسه روح لحياة القلوب به\n وعن الثوريِّ: أنهم كانوا يَرَوْنَ أنها نزلت فيمن يصحب السلطان، أي: ويُداهنه ولا ينصحه\n وقال سهل: مَن صحّح إيمانه، وأخلص توحيده، لا يأنس بمبتدِع، ولا يُجالسه، ويظهر له من نفسه العداوة، ومَن داهن مبتدِعاً سلبه الله حلاوةَ السنن، ومَن أجابه لطلب عزِّ الدنيا، أو عَرضها، أذلَه الله بذلك العزّ، وأفقره بذلك الغنى، ومَن ضحك إلى مبتدع نزع الله نورَ الإيمان من قلبه، ومَن لم يصدّق فليجرب\n هـ من النسفي\n ثم بيّن ما يتحفهم به في الآخرة، بعد بيان ما أكرمهم به في الدنيا، بقوله: { ويُدخلهم جناتٍ تجري مِن تحتها الإنهارُ خالدينَ فيها } أبد الآبدين، { رضي اللهُ عنهم } لتوحيدهم الخالص وطاعتهم، { ورَضُوا عنه } لثوابه الجسيم في الآخرة، وبما قضى بهم في الدنيا، وهو بيان لابتهاجهم بما أوتوه عاجلاً وآجلاً\n\n\n{ أولئك حزبُ الله } أنصار حقّه، ورعاة خلقه، وهو بيان لاختصاصهم به - عزّ وجل - وفي مقابلة اختصاص حزب الشيطان به\n وقوله تعالى: { ألا إِنَّ حزبَ الله هم المفلحون } بيان لاختصاصهم بالفوز بسعادة النشأتين، أي: هم الباقون في النعيم المقيم، الفائزون بكل محبوب، الآمنون من كل مرهوب\n الإشارة: لا تجد قوماً يريدون تحقيق الإيمان وخلوص العرفان يُوادون أهلَ الغفلة والعصيان، ولو كانوا من أقرب الناس إليهم، فالأخ الحقيقي والصاحب الخالص هو الذي يوافقك في النسبة، ويرافقك على الطاعة، ويُغيِّبك عن مواطن الغفلة، وأمَّا مَن يجرك إلى الغفلة فلا نسبة بينك وبينه، ولو كان أباً أو أمّاً أو أخاً شقيقاً\n وقد تقدّم الكلام على المسألة في قوله تعالى:\n\n[الزخرف: 67]\n قال القشيري: مَن جَنَحَ إلى منحرفٍ في دينه، أو داهَنَ مبتدعاً في عقده، نَزَعَ اللهُ نورَ التوحيد من قلبه، فهو في حياته جانٍ على عقيدته، سيذوق قريباً وَبَال أمره، وإنَّ الأولياء كتب الله الإيمانَ في قلوبهم وأثبته\n ويقال: جعل قلوبهم مُطرّزةً باسمه، وأعْزِزْ بحُلة أسرار قومٍ، طِرازُهم اسم \" الله \" عزّ وجل!!\n هـ\n وقال الورتجبي: { لا تجد قوماً يؤمنون بالله\n\n\n } الخ، أي: آثروا اللّهَ على مَن دونه، وذلك بأنّ الله غرس أشجار التوحيد والمعرفة في قلوبهم، وتجلّى لأرواحهم بنفسه، فصار معنى حقيقة التجلّي منقوشاً في نفس أرواحهم وعقولهم\n هـ\n وقوله تعالى: { وأيَّدهم بروح منه } قال في في الحاشية الفاسية: هو مقام الشهود والتجلّي العياني، وهو حقيقة السر عند القوم، وهو علم يمتد ظله في الأرواح المواجَهة على حسب قابليتها واستعدادها، كما خصصتها المشيئة الإلهية، وهو التعليم الإلهامي للأولياء، والتنزُّل الوحيي للأنبياء عليهم السلام\n وعن ذلك الأمداد عُبر بالنفخ والإلقاء، وباعتبار حياة الروح به وقوتها سُمي رُوحاً، وإضافته إلى الله تعالى لأنه مقتبس من نور أوصافه\n ومثالٌ انفعالي عن علمه، وآثارٌ عن قدرته وكلامه\n وبالجملة فالعلم الحقيقي الذاتي لله، وكذا سائر صفاته، والعلم العرضي المثالي الانفعالي لمَن خصّ سبحانه من عباده، ولا يحيطون بشيء من علمه إلاّ بما شاء، { وما أوتيتم من العلم إلا قليلاً } وكما أن الصُور المنطبعة في المرآة الصيقلة آثار ناشئة منها، وحادثة من مواجهة الصور الحسية، كذلك العلوم الممتدة في الأرواح المواجَهة، ظلال وآثار عارضة، منفعلة حادثة من حضرة الوجود الحقيقي، والعلم الذاتي، وهذا واضح لا شك فيه\n الله الموفق\n وقال الورتجبي: وأيّدهم بتجلّي ذاته لأرواحهم، وما وفقهم في الصفات، بل أغرقهم في بحر الذات\n هـ\n وقوله تعالى: { أولئك حزبُ الله } قال سهل: الحزب: الشيعة، وهم الأبدال: وأرفع منهم الصدِّيقون\n وقال بعضهم: حزب الله، إذا نطقوا بهروا، وإن سكتوا ظهروا، وإن غابوا حضروا، إن ناموا سهروا\n\n\nهـ\n وقال ابن عطاء: إنّ لله عباداً اتصالُهم به دائم، وأعينهم به قريرة أبداً، لا حياة لهم إلاّ به لاتصال قلوبهم به، والنظر إليه بصفاء اليقين، فحياتهم بحياته موصولة، لا موت لهم ابداً، ولا صبر لهم عنه، لأنه قد سبى أرواحهم به، فعلّقها عنده، فثمَّ مأواها، قد غشي قلوبهم من النور ما أضاءت به، فأشرقت، ونما زيادتها على الجوارح، وصاروا في حِرز حماية، أولئك حزب الله\n وقال أبو عثمان: حزب الله مَن يغضب في الله، ولا يأخذه فيه لومة لائم\n جعلنا الله ممن تحقّق بجميع هذه الأوصاف بمنّه وكرمه\n آمين\n وصلّى الله على سيدنا محمد وآله وصحبه وسلّم\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:13",
      "similarity": 0.365221382678967
    },
    {
      "verse": "51:47",
      "similarity": 0.30489114185636956
    },
    {
      "verse": "33:20",
      "similarity": 0.2716697717746714
    },
    {
      "verse": "2:253",
      "similarity": 0.2579667829388631
    },
    {
      "verse": "38:17",
      "similarity": 0.2437879791818388
    }
  ]
}