{
  "chapter": "المجادلة",
  "text": "والذين يظهرون من نسائهم ثم يعودون لما قالوا۟ فتحرير رقبة من قبل ان يتماسا ذلكم توعظون به والله بما تعملون خبير",
  "translations": [
    {
      "translation": "Those who divorce their wives by equating them with their mothers, and then wish to go back on what they said, must set free a slave before the two of them may touch one another. This is what you are enjoined to do. Allah is aware of what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who call their wives their mothers then revoke what they had said, should free a slave before having physical contact (with them). This is to warn you, as God is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who declare their wives to be their mothers and thereafter go back on what they have said shall free a slave before they may touch each other. That is what you are exhorted to do. Allah is fully aware of all your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who renounce their wives by calling them mothers and then change their minds about what they have said will have to set free a slave as a ransom and only then will their carnal relations be lawful. This is what you have been commanded. God is Well Aware of whatever you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those among you who have proclaimed their wives as their mothers and then wish to revert to the matter upon which they had uttered such an enormous word, must then free a slave before they touch one another; this is what you are advised; and Allah is Aware of your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who make unlawful to them (their wives) by Zihar and wish to free themselves from what they uttered, (the penalty) in that case is the freeing of a slave before they touch each other. That is an admonition to you. And Allah is All-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who put away their wives by likening their backs to the backs of their mothers then would recall what they said, they should free a captive before they touch each other; to that you are admonished (to conform); and Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who say, regarding their wives, 'Be as my mother's back,' and then retract what they have said, they shall set free a slave, before the two of them touch one another. By that you are admonished; and God is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who put away their wives (by saying they are as their mothers) and afterward would go back on that which they have said, (the penalty) in that case (is) the freeing of a slave before they touch one another. Unto this ye are exhorted; and Allah is Informed of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who put away their wives by equating them with their mothers, and then wish to go back on what they have said, must set free a slave before the couple may touch one another again. This is what you are exhorted to do. God is fully aware of what you do,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who put away their wives by pronouncing zihar and thereafter would retract that which they have said, then upon them is the freeing of a slave before the twain touch each other. That is that wherewith ye are exhorted; and Allah is of whatsoever ye work Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who repudiate their wives by ³ih¡r and then retract what they have said, shall set free a slave before they may touch each other. This you are advised [to carry out], and Allah is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who divorce their wives by Zihar, then wish to go back on the words they uttered,- (It is ordained that such a one) should free a slave before they touch each other: Thus are ye admonished to perform: and Allah is well-acquainted with (all) that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who make unlawful to them (their wives) (by Az-Zihar) and wish to free themselves from what they uttered, (the penalty) in that case (is) the freeing of a slave before they touch each other. That is an admonition to you (so that you may not return to such an ill thing). And Allah is All-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say to their wives, 'Be as my mother's back' then retract their words thereafter shall set a person free before they touch each other again. By that you are admonished. Allah is Aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who estrange their wives by equating them with their mothers, then go back on what they said, must set free a slave before they may touch one another. To this you are exhorted, and God is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who pronounce thihar from their wives and then [wish to] go back on what they said - then [there must be] the freeing of a slave before they touch one another. That is what you are admonished thereby; and Allah is Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[58:3] And those who repudiate their wives by zihār and then go back on what they have said, instead doing the opposite of this and retaining the woman divorced by zihār, that which is contrary to the purpose of zihār in which a woman is characterised as being forbidden — then [the penalty for them is] the setting free of a slave, an obligation upon him, before they touch one another, in sexual intercourse. By this you are being admonished; and God is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَالَّذِينَ يُظَاهِرُونَ مِنْ نِسَائِهِمْ ثُمَّ يَعُودُونَ لِمَا قَالُوا فَتَحْرِيرُ رَقَبَةٍ مِنْ قَبْلِ أَنْ يَتَمَاسَّا ذَلِكُمْ تُوعَظُونَ بِهِ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ (3)عطف على جملة { الذين يظّهّرون منكم من نسائهم ما هن أمهاتهم } \\[ المجادلة : 2 \\] أعيد المبتدأ فيها للاهتمام بالحكم والتصريح بأصحابه وكان مقتضى الكلام أن يقال : فإن يعودوا لما قالوا فتحرير رقبة ، فيكون عطفاً على جملة الخبر من قوله : { ما هن أمهاتهم } \\[ المجادلة : 2 . \\]و { ثمّ } عاطفة جملةَ { يعودون } على جملة { يظّهّرون } ، وهي للتراخي الرتبي تعريضاً بالتخطئة لهم بأنهم عادوا إلى ما كانوا يفعلونه في الجاهلية بعدَ أن انقطع ذلك بالإِسلام . ولذلك علق بفعل { يعودون } ما يدل على قولهم لفظ الظهار .والعود : الرجوع إلى شيء تركه وفارقه صاحبه . وأصله : الرجوع إلى المكان الذي غادره ، وهو هنا عوْد مجازي .ومعنى { يعودون لما قالوا } يحتمل أنهم يعودون لما نطقوا به من الظهار . وهذا يقتضي أن المظاهِر لا يَكون مظاهراً إلا إذا صدر منه لفظ الظهار مرة ثانية بعد أُولى . وبهذا فسر الفراء . وروي عن علي بن طلحة عن ابن عباس : بحيث يكون ما يصدر منه مرة أولى معفواً عنه . غير أن الحديث الصحيح في قضية المجادِلة يدفع هذا الظاهر لأن النبي صلى الله عليه وسلم قال لأوس بن الصامت : «أعتق رقبة» كما سيأتي من حديث أبي داود فتعين أن التكفير واجب على المظاهر من أول مرة ينطلق فيها بلفظ الظهار .ويحتمل أن يراد أنهم يريدون العود إلى أزواجهم ، أي لا يحبون الفراق ويرومون العود إلى المعاشرة . وهذا تأويل اتفق عليه الفقهاء عدا داود الظاهري وبُكير بن الأشج وأبا العالية . وفي «الموطأ» قال مالك في قول الله عز وجل : { والذين يظّهّرون من نسائهم ثم يعودون لما قالوا } قال سمعت : أن تفسير ذلك أن يُظاهر الرجل من امرأته ثم يُجمع على إصابتها وإمساكها فإن أجمع على ذلك فقد وجبت عليه الكفارة وإن طلقها ولم يجمع بعد تظاهره منها على إمساكها فلا كفارة عليه .وأقوال أبي حنيفة والشافعي والليثثِ تحوم حول هذا المعنى على اختلاف في التعبير لا نطيل به .وعليه فقد استعمل فعل { يعودون } في إرادة العودة كما استعمل فعل مستعمل في معنى إرادة العود والعزم عليه لا على العود بالفعل لأنه لو كان عوداً بالفعل لم يكن لاشتراط التفكير قبل المسِيس معنى ، فانتظم من هذا معنى : ثم يريدون العود إلى ما حرموه على أنفسهم فعليهم كفارة قبل أن يعودوا إليه على نحو قوله تعالى : { إذا قمتم إلى الصلاة فاغسلوا وجوهكم } \\[ المائدة : 6 \\] أي إذا أردتم القيام ، وقوله : { فإذا قرأت القرآن فاستعذ بالله من الشيطان الرجيم } \\[ النحل : 98 \\] ، وقول النبي صلى الله عليه وسلم \" إذا سَألت فاسأل الله وإذا استعَنْت فاستعنْ بالله \" .وتلك هي قضية سبب النزول لأن المرأة ما جاءت مجادلة إلا لأنها علمت أن زوجها المظاهر منها لم يرد فراقها كما يدل عليه الحديث المروي في ذلك في كتاب أبي داود عن خويلة بنت مالك بن ثعلبة قالت : ظاهر منّي زوجي أوس بن الصامت فجئت رسول الله صلى الله عليه وسلم أشكو إليه ورسول الله يجادلني ويقول : اتقي الله .فإنه ابن عمك؟ فما برحتُ حتّى نزل القرآن . فقال : «يعتق رقبة» . قالت : لا يجد . قال : «فيصوم شهرين متتابعين» . قالت : إنه شيخ كبير ما بِه من صيام . قال : «فليطعم ستين مسكيناً» . قالت : ما عنده شيء يتصدق به . فأُتي ساعتئذٍ بعَرَق من تمر قلت : يا رسول الله فإني أعينه بعرَق آخر . قال : «قد أحسنتتِ اذهبي فأَطعمي بهما عنه ستّين مسكيناً وارجعي إلى ابننِ عمّك» . قال أبو داود في هذا : إنها كفرت عنه من غير أن تستأمره .والمراد «بما قالوا» ما قالوا بلفظ الظهار وهو ما حَرموه على أنفسهم من الاستمتاع المفاد من لفظ : أنتتِ عليّ كظهر أمي ، لأن : أنت عليّ . في معنى : قربانك ونحوه عليّ كمِثله من ظهر أمي . ومنه قوله تعالى : { ونرثه ما يقول } \\[ مريم : 80 \\] ، أي مالاً وولداً في قوله تعالى : { وقال لأوتين مالاً وولداً } \\[ مريم : 77 \\] ، وقوله : { قل قد جاءكم رسل من قبلي بالبينات وبالذي قلتم } \\[ آل عمران : 183 \\] أي قولكم حتى يأتينا بقربان تأكله النار . ففعل القول في هذا وأمثاله ناصبُ لمفرد لوقوعه في خلاف جملة مقولة ، وإيثار التعبير عن المعنى الذي وقع التحْريم له . فلفظ الظهار بالموصول وصلته هذه إيجاز وتنزيه للكلام عن التصريح به . فالمعنى : ثم يرومون أن يرجعوا للاستمتاع بأزواجهم بعد أن حرموه على أنفسهم .وفهم من قوله : { ثم يعودون لما قالوا } أن من لم يُرِد العود إلى امرأته لا يخلو حالهُ : فإما أن يريد طلاقها فله أن يوقع علَيها طلاقاً آخر لأن الله أبطل أن يكون الظهار طلاقاً ، وإما أن لا يريد طلاقاً ولا عوداً . فهذا قد صار ممتنعاً من معاشرة زوجه مضِرًّا بها فله حكم الإِيلاء الذي في قوله تعالى : { للذين يؤلون من نسائهم تربص أربعة أشهر } \\[ البقرة : 226 \\] الآية . وقد كانوا يجعلون الظهار إيلاء كما في قصة سلمة بن صخر البياضي . ثم الزرقي في كتاب أبي داود قال : «كنت امرأ أُصِيب من النساء ما لا يصيب غيري فلما دخل شهر رمضان خفت أن أصيب من امرأتي شيئاً يُتايع بي ( بتحتية في أوله مضمومة ثم مثناة فوقية ثم ألف ثم تحتية ، والظاهر أنها مكسورة . والتتايع الوقوع في الشر فالباء في قوله : ( بي ) زائدة للتأكيد ) حتى أُصبح ، فظاهرتُ منها حتى ينسلخ شهر رمضان» . الحديث .واللام في قوله : { لما قالوا } بمعنى ( إلى ) كقوله تعالى : { بأن ربك أوحى لها } \\[ الزلزلة : 5 \\] ونظيره قوله : { ولو ردوا لعادوا لما نهوا عنه } \\[ الأنعام : 28 \\] . وأحسب أن أصل اللام هو التعليل ، وهو أنها في مثل هذه المواضع إن كان الفعل الذي تعلقت به ليس فيه معنى المجيء حملت اللام فيه على معنى التعليل وهو الأصل نحو :{ بأن ربك أوحى لها } \\[ الزلزلة : 5 \\] ، وما يقع فيه حرف ( إلى ) من ذلك مجاز بتنزيل من يُفعل الفعل لأجله منزلةَ من يجيء الجائي إليه ، وإن كان الفعل الذي تعلقت به اللام فيه معنى المجيء مثل فعل العَوْد فإن تعلق اللام به يشير إلى إرادة معنى في ذلك الفعل بتمجّز أو تضميننٍ يناسبه حرف التعليل نحو قوله تعالى : { كل يجري لأجل مسمى } \\[ الرعد : 2 \\] ، أي جَرْيُه المستمر لقصده أجلاً يبلغه . ومنه قوله تعالى : { ولو ردوا لعادوا لما نهوا عنه } \\[ الأنعام : 28 \\] أي عاودوا فعله ومنه ما في هذه الآية .وفي «الكشاف» في قوله تعالى : { كل يجري لأجل مسمى } في سورة \\[ الزمر : 5 \\] أنه ليس مثل قوله تعالى : { كل يجري إلى أجل مسمى } في سورة \\[ لقمان : 29 \\] أي أنه ليس من تعاقب الحرفين ولا يَسلك هذه الطريقة إلا ضيّق العطن ، ولكن المعنيين أعني الاستعلاء والتخصيص كلاهما ملائم لصحة الغرض لأن قوله : إلى أجل } معناه يبلغه ، وقوله : { لأجل } يريد لإِدراك أجل تجعل الجري مختصاً بالإِدراك ا ه .فيكون التقدير على هذا الوجه ثم يريدون العود لأجل ما قالوا ، أي لأجل رغبتهم في أزواجهم ، فيصير متعلَّق فعل { يعودون } مقدّراً يدل عليه الكلام ، أي يعودون لما تركوه من العصمة ، ويصير الفعل في معنى : يندَمون على الفراق .وتحصل من هذا أن كفارة الظهار شرعت إذا قصد المظاهر الاستمرار على معاشرة زوجه ، تحلةً لما قصده من التحريم ، وتأديباً له على هذا القصد الفاسد والقول الشنيع .وبهذا يكون محمل قوله : { من قبل أن يتماسا } على أنه من قبل أن يمسّ زوجه مسّ استمتاع قبل أن يكفر وهو كناية عن الجماع في اصطلاح القرآن ، كما قال : { وإن طلقتموهن من قبل أن تمسوهن } \\[ البقرة : 237 \\] .ولذلك جعلت الكفارة عِتق رقبة لأنه يَفتدي بتلك الرقبة رقبةَ زوجه .وقد جعلها الله تعالى موعظة بقوله : { ذلكم توعظون به } . واسم الإِشارة في قوله : { ذلكم } عائد إلى تحرير رقبة . والوعظ : التذكير بالخير والتحذير من الشر بترغيب أو ترهيب ، أي فرضُ الكفارة تنبيه لكم لتتفَادَوْا مسيس المرأة التي طلقت أو تستمروا على مفارقتها مع الرغبة في العود إلى معاشرتها لئلا تعودوا إلى الظهار . ولم يسم الله ذلك كفارة هنا وسمّاها النبي صلى الله عليه وسلم كفارة كما في حديث سلمة بن صخر البياضي في «جامع الترمذي» وإنما الكفارة من نوع العقوبة في أحد قولين عن مالك وهو قول الشافعي حكاه عنه ابن العربي في «الأحكام» .فالمظاهر ممنوع من الاستمتاع بزوجته المظاهَر منها ، أي ممنوع من علائق الزوجية ، وذلك يقتضي تعطيل العصمة ما لم يكفر لأنه ألزم نفسه ذلك فإن استمتع بها قبل الكفارة كلها فليتُب إلى الله وليستغفر وتتعين عليه الكفارة ولا تتعدد الكفارة بسبب الاستمتاع قبل التكفير لأنه سبب واحد فلا يضرّ تكرر مسببه ، وإنما جعلت الكفارة زجراً ولذلك لم يكن وطء المظاهر امرأته قبل الكفارة زناً .وقد روى أبو داود والترمذي حديث سلمة بن صخر البياضي أنه ظاهر من امرأته ثم وقع عليها قبل أن يكفر فأمره النبي صلى الله عليه وسلم بكفارة واحدة ، وهو قول جمهور العلماء . وعن مجاهد وعبد الرحمن بن مهدي أن عليه كفارتين .وتفاصيل أحكام الظهار في صيغته وغير ذلك مفصلة في كتب الفقه .وقوله : { والله بما تعملون خبير } تذييل لجملة { ذلكم توعظون به } ، أي والله عليم بجميع ما تعملونه من هذا التكفير وغيره .\n\n",
      "translations": [
        {
          "translation": "Allah explained the expiation for saying to one's wife: \"you are unlawful to me just like my mother is\" (Zihar), saying: (Those who put away their wives (by saying they are as their mothers)) those who make unlawful for themselves sexual intercourse with their wives (and afterward would go back on that which they have said) then go back on making it lawful; ((the penalty) in that case (is) the freeing of a slave before they touch one another. Unto this) freeing of a slave (ye are exhorted) as an expiation of the Zihar; (and Allah is informed of what ye do) regarding the Zihar, of expiation and other things.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { وَٱلَّذِينَ يُظَاهِرُونَ مِن نِّسَآئِهِمْ } وهو أن يَقولَ لامراتهِ أنتِ عليّ كَظهرِ أُمي\n فإذا قالَ ذلك فليسَ لهُ أن يَقرُبَها حتّى يَعتقَ رَقبةً\n فإنْ لمْ يَجدْ فَصِيام شَهرينِ مُتتابعينِ فإن لَمْ يَقدرْ على ذلكَ أطعمَ ستينَ مِسكيناً\n فإذا فعلَ ذلكَ، فلهُ أن يَقرُبَها\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\nHe said: \"Ali ibn Ahmad told us...\"\n\n\nHe said: \"We were told by Ata ibn al-Sa'ib from Abu Khalid from Zayd ibn Ali, peace be upon him, regarding the words of the Almighty, 'And those who openly show their affection for their wives' - that is, he says to his wife, 'You are like my back.'\"\n If he says that, then it is not permissible for him to approach her until he frees a slave.\n\n\nIf he cannot find [the means to do so], then he should fast two consecutive months. If he cannot do that, then he should feed sixty needy people.\n\n\n{If he does that, then he should bring her closer.}",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ يُظَاهِرُونَ مِن نِّسَآئِهِمْ ثُمَّ يَعُودُونَ } للتلافي والتدارك مناقضين { لِمَا قَالُواْ } نادمين عنه\n مسترجعين { فَتَحْرِيرُ رَقَبَةٍ } أي: يلزمهم في الشرع تحرير رقبة في كل مرة\n ليكون كفارة قولهم المنكر الباطل { مِّن قَبْلِ أَن يَتَمَآسَّا } أي: يستمتعا ويجتمعا\n أي: المظاهِر والمظاهَر عنها { ذَلِكُمْ } أي: إلزام الكفارة عليكم { تُوعَظُونَ بِهِ } وترتدعون عنه خوفاً من الغرامة\n إذ ليس هو من شيم أهل الإيمان\n بل من ديدنة الجاهلية الأولى { وَٱللَّهُ } المراقب على عموم أحوالكم وأعمالكم { بِمَا تَعْمَلُونَ خَبِيرٌ } [المجادلة: 3] أي: بجميع أعمالكم ونياتكم فيها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { والذين يَظَهِرون مِن نسائهم ثم يعودون لِما قالوا } أي: والذين يقولون ذلك القول المُنكَر\n ثم يعودون إلى ما قالوا بالتدارك والتلافي ورفع التضرُّر\n أو: لِنقيض ما قالوا: قال ابن جزي: في معنى العود ستة أقوال: الأول: إيقاع الظِّهار في الإسلام\n فالمعنى أنهم كانوا يُظاهرون في الجاهلية\n فإذا فعلوه في الإسلام فذلك عود إليه\n هذا قول ابن قتيبة\n فتجب الكفارة عنده بنفس الظَّهار\n بخلاف أقوال غيره\n فإنَّ الكفارة لا تجب إلاّ بالظهار والعود معاً\n القول الثاني: إنّ العود هو وطء الزوجة\n رُوي ذلك عن مالك\n فلا تجب الكفارة على هذا حتى يطأ\n فإذا وطئها وجبت عليه الكفارة\n أمسك الزوجةَ أو طلّقها\n أو ماتت\n الثالث: إنَّ العَوْد هو العزم على الوطء\n ورُوي هذا أيضاً عن مالك\n فإذا عزم على الوطء وجبت الكفارة\n أمسك\n أو طلَّق\n أو ماتت\n الرابع: إن العود هو العزم على الوطء والإمساك\n وهذا أصح الروايات عن مالك\n الخامس: إنه العزم على الإمساك خاصة\n وهذا مذهب الشافعي\n فإذا ظاهر ولم يُطَلَّقها بعد الظَّهار لزمته الكفارة\n السادس: إنه تكرار الظهار مرة أخرى\n وهذا مذهب الظاهرية\n وهو ضعيف\n لأنهم لا يرون الظَّهار موجباً حكماً في أول مرة\n وإنما يُوجبه في الثانية\n وإنما نزلت فيما ظاهر أول مرة\n فذلك يرد عليهم\n ويختلف معنى \" لِما قالوه \" باختلاف هذه الأقوال\n فالمعنى: يعودون للوطء الذي حرَّموه\n أو للعزم عليه\n أو للإمساك الذي تركوه\n أو للعزم عليه\n هـ\n { فتحريرُ رقبةٍ } أي: فتداركه\n أو فعليه\n أو فالواجب تحرير رقبة\n واشترط مالك والشافعي أن تكون مؤمنة\n حملاً للمُطْلَق على المقيد لأنه قيّدها في القتل بالإيمان\n والفاء للسببية\n ومِن فوائدها: الدلالة على تكرُّر وجوب التحرير بتكرُّر الظهار\n\n{ مِن قبل أن يتماسا } أي: المظاهِر والمظاهَر منها\n ومذهب مالك والجمهور: أن المسّ هنا يُراد به الوطء\n وما دونه من اللمس والقُبلة\n فلا يجوز للمظاهِر أن يفعل شيئاً من ذلك حتى يُكفِّر\n فإن فعل شيئاً من ذلك تاب ولا يعود\n وقال الحسن والثوري: أراد الوطء خاصة\n فأباحا ما دونه من قبل الكفارة\n { ذالكم } الحُكم { تُوعظون به } لأنَّ الحُكم بالكفارة دليل على ارتكاب الجناية\n فيجب أن تتعظوا بهذا الحُكم حتى لا تعودوا إلى الظهار\n وتخافوا عقابَ الله عليه\n { واللهُ بما تعملون خبيرٌ } مُطَّلِع على ما ظهر مِن أعمالكم\n التي مِن جملتها الظاهر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "76:12",
      "similarity": 0.4529577819191609
    },
    {
      "verse": "35:21",
      "similarity": 0.4399404950662582
    },
    {
      "verse": "4:92",
      "similarity": 0.33939876092202526
    },
    {
      "verse": "24:17",
      "similarity": 0.30807879020000944
    },
    {
      "verse": "44:59",
      "similarity": 0.2960990665609409
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/058003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/058003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/58:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}