{
  "chapter": "المجادلة",
  "text": "والذين يظهرون من نسائهم ثم يعودون لما قالوا۟ فتحرير رقبة من قبل ان يتماسا ذلكم توعظون به والله بما تعملون خبير",
  "translations": [
    {
      "translation": "Those who divorce their wives by equating them with their mothers, and then wish to go back on what they said, must set free a slave before the two of them may touch one another. This is what you are enjoined to do. Allah is aware of what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who call their wives their mothers then revoke what they had said, should free a slave before having physical contact (with them). This is to warn you, as God is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who declare their wives to be their mothers and thereafter go back on what they have said shall free a slave before they may touch each other. That is what you are exhorted to do. Allah is fully aware of all your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who renounce their wives by calling them mothers and then change their minds about what they have said will have to set free a slave as a ransom and only then will their carnal relations be lawful. This is what you have been commanded. God is Well Aware of whatever you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those among you who have proclaimed their wives as their mothers and then wish to revert to the matter upon which they had uttered such an enormous word, must then free a slave before they touch one another; this is what you are advised; and Allah is Aware of your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who make unlawful to them (their wives) by Zihar and wish to free themselves from what they uttered, (the penalty) in that case is the freeing of a slave before they touch each other. That is an admonition to you. And Allah is All-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who put away their wives by likening their backs to the backs of their mothers then would recall what they said, they should free a captive before they touch each other; to that you are admonished (to conform); and Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who say, regarding their wives, 'Be as my mother's back,' and then retract what they have said, they shall set free a slave, before the two of them touch one another. By that you are admonished; and God is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who put away their wives (by saying they are as their mothers) and afterward would go back on that which they have said, (the penalty) in that case (is) the freeing of a slave before they touch one another. Unto this ye are exhorted; and Allah is Informed of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who put away their wives by equating them with their mothers, and then wish to go back on what they have said, must set free a slave before the couple may touch one another again. This is what you are exhorted to do. God is fully aware of what you do,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who put away their wives by pronouncing zihar and thereafter would retract that which they have said, then upon them is the freeing of a slave before the twain touch each other. That is that wherewith ye are exhorted; and Allah is of whatsoever ye work Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who repudiate their wives by ³ih¡r and then retract what they have said, shall set free a slave before they may touch each other. This you are advised [to carry out], and Allah is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who divorce their wives by Zihar, then wish to go back on the words they uttered,- (It is ordained that such a one) should free a slave before they touch each other: Thus are ye admonished to perform: and Allah is well-acquainted with (all) that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who make unlawful to them (their wives) (by Az-Zihar) and wish to free themselves from what they uttered, (the penalty) in that case (is) the freeing of a slave before they touch each other. That is an admonition to you (so that you may not return to such an ill thing). And Allah is All-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say to their wives, 'Be as my mother's back' then retract their words thereafter shall set a person free before they touch each other again. By that you are admonished. Allah is Aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who estrange their wives by equating them with their mothers, then go back on what they said, must set free a slave before they may touch one another. To this you are exhorted, and God is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who pronounce thihar from their wives and then [wish to] go back on what they said - then [there must be] the freeing of a slave before they touch one another. That is what you are admonished thereby; and Allah is Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[58:3] And those who repudiate their wives by zihār and then go back on what they have said, instead doing the opposite of this and retaining the woman divorced by zihār, that which is contrary to the purpose of zihār in which a woman is characterised as being forbidden — then [the penalty for them is] the setting free of a slave, an obligation upon him, before they touch one another, in sexual intercourse. By this you are being admonished; and God is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah explained the expiation for saying to one's wife: \"you are unlawful to me just like my mother is\" (Zihar), saying: (Those who put away their wives (by saying they are as their mothers)) those who make unlawful for themselves sexual intercourse with their wives (and afterward would go back on that which they have said) then go back on making it lawful; ((the penalty) in that case (is) the freeing of a slave before they touch one another. Unto this) freeing of a slave (ye are exhorted) as an expiation of the Zihar; (and Allah is informed of what ye do) regarding the Zihar, of expiation and other things.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { وَٱلَّذِينَ يُظَاهِرُونَ مِن نِّسَآئِهِمْ } وهو أن يَقولَ لامراتهِ أنتِ عليّ كَظهرِ أُمي\n فإذا قالَ ذلك فليسَ لهُ أن يَقرُبَها حتّى يَعتقَ رَقبةً\n فإنْ لمْ يَجدْ فَصِيام شَهرينِ مُتتابعينِ فإن لَمْ يَقدرْ على ذلكَ أطعمَ ستينَ مِسكيناً\n فإذا فعلَ ذلكَ، فلهُ أن يَقرُبَها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ يُظَاهِرُونَ مِن نِّسَآئِهِمْ ثُمَّ يَعُودُونَ } للتلافي والتدارك مناقضين { لِمَا قَالُواْ } نادمين عنه، مسترجعين { فَتَحْرِيرُ رَقَبَةٍ } أي: يلزمهم في الشرع تحرير رقبة في كل مرة؛ ليكون كفارة قولهم المنكر الباطل { مِّن قَبْلِ أَن يَتَمَآسَّا } أي: يستمتعا ويجتمعا؛ أي: المظاهِر والمظاهَر عنها { ذَلِكُمْ } أي: إلزام الكفارة عليكم { تُوعَظُونَ بِهِ } وترتدعون عنه خوفاً من الغرامة؛ إذ ليس هو من شيم أهل الإيمان، بل من ديدنة الجاهلية الأولى { وَٱللَّهُ } المراقب على عموم أحوالكم وأعمالكم { بِمَا تَعْمَلُونَ خَبِيرٌ } [المجادلة: 3] أي: بجميع أعمالكم ونياتكم فيها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وَالَّذِينَ يَظَّهَّرُونَ } وأصله: يتظهرون، فأدمغت التاء في الظاء، وقرأ عاصم: بضم الياء وتخفيف الظاء، مضارع ظاهر لأنّ كل واحد يباعد صاحبه، وقرأ ابن عامر والأخوان وأبو جعفر وخلف بفتح الياء وشد الظاء بالمد، مضارع \" تظاهر \" ، والحاصل في فعل الظهار ثلاث لغات: ظاهر وتظاهر وتظهر، مأخذة من الظهر لأنه يُشَبِّه امرأته بظهر أُمه، ولا مفهوم للظهر، بل كل جزء منها مثل الظهر\n وفي قوله: { منكم } توبيخ للعرب، لأنه كان من أيْمان الجاهلية خاصة، دون سائر الأمم، { مِن نسائهم } من زوجاتهم، { ما هن أمهاتِهم }: خبر الموصول، أي: ليسوا بأمهاتهم حقيقة، فهو كذب محض، { إِنْ أمهاتُهم } حقيقة { إِلاّ اللائي وَلَدنَهُمْ } مِن بطونهن، فلا تشبّه بهن في الحرمة إلاّ مَن ألحقها الشرع بهن من المرضعات وأزواج النبي صلى الله عليه وسلم، فيدخلن بذلك في حكم الأمهات، وأما الزوجات فأبعد شيء من الأمومة\n { وزُوراً } كذباً باطلاً، منحرفاً عن الحق، { وإنّ الله لعفوٌّ غفور } لما سلف منهم\n ثم ذَكَر الحُكم بعد بيان إنكاره، فقال: { والذين يَظَهِرون مِن نسائهم ثم يعودون لِما قالوا } أي: والذين يقولون ذلك القول المُنكَر، ثم يعودون إلى ما قالوا بالتدارك والتلافي ورفع التضرُّر، أو: لِنقيض ما قالوا: قال ابن جزي: في معنى العود ستة أقوال: الأول: إيقاع الظِّهار في الإسلام، فالمعنى أنهم كانوا يُظاهرون في الجاهلية، فإذا فعلوه في الإسلام فذلك عود إليه، هذا قول ابن قتيبة، فتجب الكفارة عنده بنفس الظَّهار، بخلاف أقوال غيره، فإنَّ الكفارة لا تجب إلاّ بالظهار والعود معاً\n القول الثاني: إنّ العود هو وطء الزوجة، رُوي ذلك عن مالك، فلا تجب الكفارة على هذا حتى يطأ، فإذا وطئها وجبت عليه الكفارة، أمسك الزوجةَ أو طلّقها، أو ماتت\n الثالث: إنَّ العَوْد هو العزم على الوطء، ورُوي هذا أيضاً عن مالك، فإذا عزم على الوطء وجبت الكفارة، أمسك، أو طلَّق، أو ماتت\n الرابع: إن العود هو العزم على الوطء والإمساك، وهذا أصح الروايات عن مالك\n الخامس: إنه العزم على الإمساك خاصة، وهذا مذهب الشافعي، فإذا ظاهر ولم يُطَلَّقها بعد الظَّهار لزمته الكفارة\n السادس: إنه تكرار الظهار مرة أخرى، وهذا مذهب الظاهرية، وهو ضعيف، لأنهم لا يرون الظَّهار موجباً حكماً في أول مرة، وإنما يُوجبه في الثانية، وإنما نزلت فيما ظاهر أول مرة، فذلك يرد عليهم، ويختلف معنى \" لِما قالوه \" باختلاف هذه الأقوال، فالمعنى: يعودون للوطء الذي حرَّموه، أو للعزم عليه، أو للإمساك الذي تركوه، أو للعزم عليه\n هـ\n { فتحريرُ رقبةٍ } أي: فتداركه، أو فعليه، أو فالواجب تحرير رقبة\n واشترط مالك والشافعي أن تكون مؤمنة، حملاً للمُطْلَق على المقيد لأنه قيّدها في القتل بالإيمان، والفاء للسببية، ومِن فوائدها: الدلالة على تكرُّر وجوب التحرير بتكرُّر الظهار\n\n\n{ مِن قبل أن يتماسا } أي: المظاهِر والمظاهَر منها، ومذهب مالك والجمهور: أن المسّ هنا يُراد به الوطء، وما دونه من اللمس والقُبلة، فلا يجوز للمظاهِر أن يفعل شيئاً من ذلك حتى يُكفِّر، فإن فعل شيئاً من ذلك تاب ولا يعود\n وقال الحسن والثوري: أراد الوطء خاصة، فأباحا ما دونه من قبل الكفارة\n { ذالكم } الحُكم { تُوعظون به } لأنَّ الحُكم بالكفارة دليل على ارتكاب الجناية، فيجب أن تتعظوا بهذا الحُكم حتى لا تعودوا إلى الظهار، وتخافوا عقابَ الله عليه، { واللهُ بما تعملون خبيرٌ } مُطَّلِع على ما ظهر مِن أعمالكم، التي مِن جملتها الظاهر",
      "translations": []
    }
  ]
}