{
  "chapter": "المجادلة",
  "text": "ان الذين يحادون الله ورسوله كبتوا۟ كما كبت الذين من قبلهم وقد انزلنا ءايتۭ بينت وللكفرين عذاب مهين",
  "translations": [
    {
      "translation": "Those who oppose Allah and His Messenger will be subdued and overcome as those before them were also subdued and overcome. We have sent down Clear Signs. The kafirun will have a humiliating punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who oppose God will be disgraced, as those before them were. We have sent down very clear signs. For unbelievers there is a shameful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who oppose Allah and His Messenger shall be brought low even as those before them were brought low. Surely We have sent down Clear Signs; and a humiliating chastisement awaits the unbelievers;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who oppose God and His Messenger will be humiliated like those who lived before. We have sent illustrious revelations and those who disbelieve will suffer a humiliating torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who oppose Allah and His Noble Messenger have been humiliated, like those before them who were humiliated, and We have indeed sent down clear verses; and for the disbelievers is a disgraceful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who oppose Allah and His Messenger will be disgraced as those before them were disgraced. And We have sent down clear Ayat. And for the disbelievers is a disgraceful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who act in opposition to Allah and His Apostle shall be laid down prostrate as those before them were laid down prostrate; and indeed We have revealed clear communications, and the unbelievers shall have an abasing chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who oppose God and His Messenger shall be frustrated as those before them were frustrated. Now We have sent down signs, clear signs; and for the unbelievers awaits a humbling chastisement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who oppose Allah and His messenger will be abased even as those before them were abased; and We have sent down clear tokens, and for disbelievers is a shameful doom\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who oppose God and His Messenger will be humiliated, as were their predecessors. We have sent down clear revelations. A humiliating punishment awaits those who deny the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who oppose Allah and His apostle shall be abased even as those before them were abased; and of a surety We have sent down manifest signs. And for the infidels will be a torment ignominious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who oppose Allah and His Apostle will be subdued just as those who passed before them were subdued. We have certainly sent down manifest signs, and there is a humiliating punishment for the faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who resist Allah and His Messenger will be humbled to dust, as were those before them: for We have already sent down Clear Signs. And the Unbelievers (will have) a humiliating Penalty,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who oppose Allah and His Messenger (Muhammad SAW) will be disgraced, as those before them (among the past nation), were disgraced. And We have sent down clear Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.). And for the disbelievers is a disgracing torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who oppose Allah and His Messenger shall be frustrated just as those before them were frustrated. We have sent down proofs and clear verses, and for the unbelievers, there is a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who oppose God and His Messenger will be subdued, as those before them were subdued. We have revealed clear messages. The unbelievers will have a demeaning punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who oppose Allah and His Messenger are abased as those before them were abased. And We have certainly sent down verses of clear evidence. And for the disbelievers is a humiliating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[58:5] Indeed those who oppose God and His Messenger will be abased, humiliated, just as those before them were abased, for opposing their messengers. And verily We have revealed clear signs, indicating the truthfulness of the Messenger, and for those who disbelieve, in the signs, there is a humiliating chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who oppose Allah and His messenger) regarding Religion and show enmity towards him (will be abased) they will be chastised and conquered on the day of the Ditch; they will be killed and defeated; the reference here is to the people of Mecca (even those before them were abased) just as those who had 653 fought against the prophets before the people of Mecca were chastised and conquered; (and We have sent down clear tokens) We have sent Gabriel with revelations making clear the commands and prohibitions, the lawful and unlawful, (and for disbelievers) in the revelations of Allah (is a shameful doom) through which they will be humiliated; and it is said that a shameful doom means: a severe chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كُبِتُواْ كَمَا كُبِتَ ٱلَّذِينَ مِن قَبْلِهِمْ } معناه أُهلِكُوا كما أُهلِكَ الذين من قَبلِهِم\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {As those before them have perished}, meaning, \"Destroy yourselves as those before you were destroyed.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على سبيل الوعيد والتهديد: { إِنَّ } المسرفين المفرطين { ٱلَّذِينَ يُحَآدُّونَ } ويعادون { ٱللَّهَ وَرَسُولَهُ } أي: يضعون حدوداً مخالفة لحدود الله ورسوله\n ويختارونها مراءً ومجادلةً\n ومعاداة مع الله ورسوله { كُبِتُواْ } أي: أكب وأحاط عليهم العذاب النازل من الله فهلكوا { كَمَا كُبِتَ ٱلَّذِينَ مِن قَبْلِهِمْ } من كفار الأمم الماضية { وَ } كيف لا نهلكهم ولا نستأصلهم\n إذ { قَدْ أَنزَلْنَآ } لإصلاح أحوالهم وأخلاقهم\n وعموم أطوارهم { آيَاتٍ بَيِّنَاتٍ } واضحات مشتملات على حكم ومصالح لا تخفى فأبو عنها\n ولم يقبلوها\n بل كذبوها وأنكروا عليها\n وعلى من أُنزلت عليه عتواً وعناداً؟! { وَ } بالجملة: { لِلْكَافِرِينَ } المستكبرين بما عندهم من الثروة والرئاسة { عَذَابٌ مُّهِينٌ } [المجادلة: 5] بحيث يبدل عزهم ذلاً\n ونخوتهم لعنةً وطرداً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنَّ الذين يُحادون اللّهَ ورسولَه } أي: يُعادونهما ويُشاقونهما فإنَّ كُلاَّ من المتعادين في عدوةٍ وشِقٍّ غير الآخر\n وكذلك يكون كُلُّ واحدٍ منهما في حدّ غير حدّ الآخر\nغير أنَّ لذكر المُحادَّة هنا لمّا ذكر حدود الله مِن حسن الموقع ما لا غاية وراءه\n ثم أخبر عنهم فقال: { كُبِتُوا } أي: أُخذوا وأُهلكوا\n أو: لُعنوا { كما كُبِتَ الذين من قبلهم } من كُفار الأمم الماضية المعادين للرسل عليهم السلام\n وقال القشيري: يُحادّون: يُخالفون أمر الله\n ويتركون طاعة رسول الله\n أذِلُّوا وأُخْزوا كما أُذِلَّ مَنْ قبلهم من الكفار والعصاة\n نزلت في المستهزئين يوم ا لخندق\n إذ الله أجرى سُنته بالانتقام من أهل الإجرام\n ومَن ضيَّعَ لرسول الله سُنةً واحدة في دينه ببدعة انخرط في سلك هذا الخزي\n ووقع في هذا الذُّل\n هـ\n وقال ابن عطية: الآية نزلت في المنافقين واليهود\n وكانوا يتربصون بالرسول والمؤمنين الدوائر\n ويتمنون فيهم المكروه\n ويتناجون بذلك\n هـ\n { وقد أنزلنا آياتٍ بيناتٍ }: حال من ضمير \" كُبتوا \" أي: كُبتوا بمحادتهم\n والحال أنَّا قد أنزلنا آيات واضحات فيمن حاد الله ورسولَه\n ممن قبلهم من الأمم وفيما فعلنا بهم\n أو: آيات على صدق الرسول وصحة ما جاء به\n { وللكافرين } بهذه الآيات\n أو: بكل ما يجب الإيمان به\n فيدخل فيه تلك الآيات دخولاً أوليّاً\n { عذابٌ مهين } يذهب بعزِّهم وكِبْرهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:127",
      "similarity": 0.6941926773799448
    },
    {
      "verse": "4:14",
      "similarity": 0.24375116952497167
    },
    {
      "verse": "58:20",
      "similarity": 0.15241885391148197
    },
    {
      "verse": "19:9",
      "similarity": 0.1445675415544257
    },
    {
      "verse": "9:63",
      "similarity": 0.14209317994938833
    }
  ]
}