{
  "chapter": "المجادلة",
  "text": "يوم يبعثهم الله جميعا فينبئهم بما عملوا۟ احصىه الله ونسوه والله على كل شىء شهيد",
  "translations": [
    {
      "translation": "On the Day Allah raises up all of them together, He will inform them of what they did. Allah has recorded it while they have forgotten it. Allah is a Witness of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when God will raise them up together, He will tell them what they did. God takes account of it although they forget, for all things are evident to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "a chastisement that shall come upon them on the Day when Allah will raise them all to a new life and will inform them of their deeds. Allah has recorded it all while they have forgotten it. Allah is a witness over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when everyone will be resurrected, God will tell them about their deeds which He has recorded in their entirety - while they themselves have forgotten them. God is the witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when Allah will raise all of them together and inform them of their misdeeds; Allah has kept count of them, whereas they have forgotten them; and all things are present before Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when Allah will resurrect them all together and inform them of what they did. Allah has kept account of it, while they have forgotten it. And Allah is Witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when Allah will raise them up all together, then inform them of what they did: Allah has recorded it while they have forgotten it; and Allah is a witness of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "upon the day when God shall raise them up all together, then He shall tell them what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when Allah will raise them all together and inform them of what they did. Allah hath kept account of it while they forgot it. And Allah is Witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day God raises them all up from the dead, He will make them understand what they have done. God has taken everything into account, even though they have forgotten, for God is a witness to all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day whereon Allah will raise them all together and declare Unto them that which they have worked. Allah hath taken count thereof, whilst they forget it. And Allah is over everything a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when Allah will raise them all together, He will inform them about what they have done. Allah has kept account of it, while they have forgotten, and Allah is witness to all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day that Allah will raise them all up (again) and show them the Truth (and meaning) of their conduct. Allah has reckoned its (value), though they may have forgotten it, for Allah is Witness to all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when Allah will resurrect them all together (i.e. the Day of Resurrection) and inform them of what they did. Allah has kept account of it, while they have forgotten it. And Allah is Witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when Allah will raise them up all together He will inform them of what they did. Allah has taken count of it, although they have forgotten. Allah is Witness to all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when God resurrects them all, and informs them of what they did. God has kept count of it, but they have forgotten it. God is Witness over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when Allah will resurrect them all and inform them of what they did. Allah had enumerated it, while they forgot it; and Allah is, over all things, Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[58:6] The day when God will raise them all together, He will then inform them of what they did. God has kept count of it, while they forgot it. And God is Witness to all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the day when Allah will raise them all together) will raise the adherents of all religions (and inform them of what they did) in the life of the world. (Allah hath kept account of it) i.e. He has kept account of all their works (while they forgot it) while they left the obedience of Allah with which they were commanded. (And Allah is Witness over all things) over all their works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر لهم يا أكمل الرسل { يَوْمَ يَبْعَثُهُمُ ٱللَّهُ } من قبورهم { جَمِيعاً } بحيث لا يشذ أحد منهم { فَيُنَبِّئُهُمْ } ويخبرهم { بِمَا عَمِلُوۤاْ } أي: بجميع أعمالهم تفضيحاً وتشهيراً لهم على رءوس الأشهاد\n بحيث { أَحْصَاهُ ٱللَّهُ } وفصله عليهم على وجه لا يغيب عن حيطة علمه وإحصائه سبحانه من عملهم { وَ } هم قد { نَسُوهُ } لكثرته أو تهاونهم عليه { وَ } كيف لا يحصي سبحانه عليهم أعمالهم\n إذ { ٱللَّهُ } بمقتضى ألوهيته\n وحيطة ظهوره { عَلَىٰ كُلِّ شَيْءٍ } من مظاهره { شَهِيدٌ } [المجادلة: 6] حاضر غير مغيب؟!\n\n{ أَ } تستبعد شهادته سبحانه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n واذكر { يومَ يبعثهم اللهُ جميعاً } أو: لهم ذلك العذاب { يومَ يبعثهم اللهُ جميعاً } أي: لا يترك أحداً منهم\n أو مجتمعين في حال واحد وصعيدٍ واحد\n { فيُنَبئهم بما عمِلوا } من القبائح\n تخجيلاً لهم\n وتشهيراً لحالهم\n وتشديداً لعذابهم\n فيتمنون حينئذ المسارعة إلى النار\n لِما يلحقهم من الخزي على رؤوس الأشهاد\n { أحصاه اللهُ } أحاط به عدداً\n لم يفته منه شيء\n والجملة استئناف بياني\n كأنه قيل: كيف ينبئهم بما عملوا\n وهي أعراض مُنقضية متلاشية\n فقيل: { أحصاه اللهُ ونَسًوه } أي: قد نسوه لأنهم تهاونوا به حين ارتكبوه وإنما تحفظ معظّمات الأمور\n وهو حال أيضاً\n { واللهُ على كل شيءٍ شهيدٌ } لا يغيب عنه شيء\n والجملة اعتراض تذييلي\n مقرِّرة لإحصائه تعالى\n ثم استشهد على شمول شهادته تعالى\n فقال: { ألم تَرَ أن الله يعلم ما في السماوات وما في الأرض } فهو كقوله تعالى:\n[البقرة: 258]\n\n[الشعراء: 225] أي: ألم تعلم علماً مزاحماً للمشاهدة أنَّ الله يعلم ما استقر في السماوات وما في الأرض من الموجودات",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:29",
      "similarity": 0.7127568715808271
    },
    {
      "verse": "19:94",
      "similarity": 0.6413776108868272
    },
    {
      "verse": "16:18",
      "similarity": 0.6128399816715556
    },
    {
      "verse": "14:34",
      "similarity": 0.604708078464073
    },
    {
      "verse": "36:12",
      "similarity": 0.5302006029246509
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/58:6.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/58:6.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/58:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}