{
  "chapter": "المجادلة",
  "text": "الم تر الى الذين نهوا۟ عن النجوى ثم يعودون لما نهوا۟ عنه ويتنجون بالاثم والعدون ومعصيت الرسول واذا جاءوك حيوك بما لم يحيك به الله ويقولون فى انفسهم لولا يعذبنا الله بما نقول حسبهم جهنم يصلونها فبئس المصير",
  "translations": [
    {
      "translation": "Do you not see those who were forbidden to confer together secretly returning to the very thing they were forbidden to do, and conferring together secretly in wrongdoing and enmity and disobedience to the say to themselves 'Why does Allah not punish us for what we say?' Hell will be enough for them! They will roast in it. What an evil destination!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered those who were forbidden to conspire, but reverted after a time to what was forbidden them, and conspired evil, rebellion and disobedience to the Prophet? Yet when they come to you they greet you with a greeting even God does not greet you with; and say to themselves, \"Why doesn't God punish us for what we say?\" Hell is sufficient for them, in which they will be burnt: And what an evil consequence!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who were forbidden to whisper and yet they engaged in what they had been forbidden? They secretly converse among themselves concerning sin and transgression and disobedience to the Messenger. And when they come to you, they greet you in a manner that Allah does not greet you, and say to themselves: “Why does Allah not chastise us for these utterances of ours?” Hell it is that shall suffice them, and in it will they burn. How woeful is their destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who have been forbidden to have secret counsels violate this prohibition and resume their secret counsels for sinful and hostile purposes and to disobey the Messenger? When they come to you (Muhammad), they greet you with a greeting with which even God has not greeted you and say to themselves, \"Why has God not punished us for what we say (if he is a true Prophet)?\" The heat of hell is a sufficient torment for them. This is the most terrible fate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see those who were forbidden from conspiracy, yet they do what was forbidden, and consult each other for sinning, and for exceeding limits, and for disobeying the Noble Messenger? And when they come in your presence, they greet you with words not chosen by Allah for respectfully greeting you, and they inwardly say, “Why does not Allah punish us for what we say?”; hell is sufficient for them; they will sink into it; and what a wretched outcome!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who were forbidden to hold secret counsels, and afterwards returned to that which they had been forbidden, and conspired together for sin and wrongdoing and disobedience to the Messenger. And when they come to you, they greet you with a greeting wherewith Allah greets you not, and say within themselves: \"Why should Allah punish us not for what we say\" Hell will be sufficient for them; they will enter therein. And worst indeed is that destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who are forbidden secret counsels, then they return to what they are forbidden, and they hold secret counsels for sin and revolt and disobedience to the Apostle, and when they come to you they greet you with a greeting with which Allah does not greet you, and they say in themselves: Why does not Allah punish us for what we say? Hell is enough for them; they shall enter it, and evil is the resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not regarded those who were forbidden to converse secretly together, then they return to that they were forbidden, and they converse secretly together in sin and enmity, and in disobedience to the Messenger? Then, when they come to thee, they greet thee with a greeting God never greeted thee withal; and they say within themselves, 'Why does God not chastise us for what we say?' Sufficient for them shall be Gehenna, at which they, shall be roasted -- an evil homecoming!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not observed those who were forbidden conspiracy and afterward returned to that which they had been forbidden, and (now) conspire together for crime and wrongdoing and disobedience toward the messenger? And when they come unto thee they greet thee with a greeting wherewith Allah greeteth thee not, and say within themselves: Why should Allah punish us for what we say? Hell will suffice them; they will feel the heat thereof - a hapless journey's end!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen how those who were forbidden to hold secret counsels yet revert to that which they were forbidden to do? And they conspire to indulge in wrongdoing, aggressive behaviour and disobedience to the Messenger. When they come to you, they greet you, but not in the words God would use, and inwardly they wonder, \"Why does God not punish us for what we say?\" Hell will be a fitting punishment for them: they will burn in its flames -- a wretched fate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Observest thou not those who were forbidden whispering and they afterwards returned to that which they had been forbidden; and they whisper Unto each Other of sin, transgression and disobedience reward the apostle! And when they came Unto thee, they greet thee with that wherewith Allah greeteth thee not, and say within themselves: wherefore god tormented us not for that which we say? Sufficient Unto them is Hell, where in they will roast: a hapless destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded those who were forbidden from secret talks but again resumed what they had been forbidden from, and hold secret talks [imbued] with sin and transgression and disobedience to the Apostle? And when they come to you they greet you with words with which Allah never greeted you, and they say to themselves, ‘Why does not Allah punish us for what we say?!’ Let hell suffice them: they shall enter it, and it is an evil destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Turnest thou not thy sight towards those who were forbidden secret counsels yet revert to that which they were forbidden (to do)? And they hold secret counsels among themselves for iniquity and hostility, and disobedience to the Messenger. And when they come to thee, they salute thee, not as Allah salutes thee, (but in crooked ways): And they say to themselves, \"Why does not Allah punish us for our words?\" Enough for them is Hell: In it will they burn, and evil is that destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who were forbidden to hold secret counsels, and afterwards returned to that which they had been forbidden, and conspired together for sin and wrong doing and disobedience to the Messenger (Muhammad SAW). And when they come to you, they greet you with a greeting wherewith Allah greets you not, and say within themselves: \"Why should Allah punish us not for what we say?\" Hell will be sufficient for them, they will burn therein, and worst indeed is that destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who were forbidden to talk in secrecy together? They return to that which they are forbidden and talk secretly together in sin andhatred, and in disobedience to the Messenger. Then, when they come to you they greet you with greetings with which Allah does not greet you, and they say within themselves: 'Why does Allah not punish us for what we say' Gehenna (Hell) suffices them, they shall be roasted, an evil arrival!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you noted those who were prohibited from conspiring secretly, but then reverted to what they were prohibited from? They conspire to commit sin, and aggression, and defiance of the Messenger. And when they come to you, they greet you with a greeting that God never greeted you with. And they say within themselves, “Why does God not punish us for what we say?” Hell is enough for them. They will roast in it. What a miserable destiny!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered those who were forbidden from private conversation, then they return to that which they were forbidden and converse among themselves about sin and aggression and disobedience to the Messenger? And when they come to you, they greet you with that [word] by which Allah does not greet you and say among themselves, \"Why does Allah not punish us for what we say?\" Sufficient for them is Hell, which they will [enter to] burn, and wretched is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[58:8] Have you not seen, [have you not] observed, those who were forbidden from conversing in secret [but] then returned to that they had been forbidden, and [all the while] hold secret conversations [tainted] with sin and [plans for] enmity and disobedience to the Messenger? These were the Jews, whom the Prophet (s) had forbidden them what they used to do in their secret talks, that is, their [habit of] conversing secretly with one another and giving the believers looks in order to cast doubt into their hearts [about the faith]. And [who] when they come to you, they greet you, O Prophet, with that with which God never greeted you — namely, their saying [to the Prophet]: al-sāmu ‘alayka, meaning, ‘Death [be upon you]’, and they say within   themselves, ‘Why does God not chastise us for what we say?’, in the way of such a greeting and [our saying] that he is not a prophet, if he [truly] were a prophet. Hell will suffice them! In it they will be made to burn — and [what] an evil journey’s end!, it is.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hast thou not observed) Muhammad (those who were forbidden conspiracy) other than true believers (and afterward returned to that which they had been forbidden) of conspiracy, leaving aside true believers, (and (now) conspire together) among themselves (for crime) for lies (and wrong-doing) transgression (and disobedience towards the messenger) by opposing the Messenger after he forbade them from doing so? What happened is that the hypocrites used to hold secret conferences with the Jews regarding the military expeditions of the believers, in order to aggrieve the believers. (And when they) i.e. the Jews (come unto thee they greet thee with a greeting wherewith Allah greeteth thee not) for they used to say al-sam, i.e. death, be with you [that is instead of saying al-salam, i.e. peace, be with you] and the Prophet (pbuh) used to answer: \"and al-sam be with you\", (and say within themselves) to one another: (Why should Allah punish us for what we say) to His Prophet? If he were truly a Prophet, as he claims, his prayer would have been answered when he answers: \"and al-sam be with you\". Allah answered them, saying: (Hell will suffice them) i.e. the Jews as a destination in the Hereafter; (they will feel the heat thereof. A hapless journey's end) is hell wherein they will end!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِذَا جَآءُوكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ ٱللَّهُ } وهو قولُ اليَهودِ: سامٌ عليكم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd when they come to you with something that Allah has not revealed to you, {and say}, \"O Muhammad, this is from Allah,\" do not believe them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ألم تر إلى الذين نهوا عن النجوى } إنما نهوا لأن التناجي اتصال واتحاد بين اثنين في أمر يختص بهما لا يشاركهما فيه ثالث\n وللنفوس عند الاجتماع والاتصال تعاضد وتظاهر يتقوّى ويتأيد بعضها بالبعض فيما هو سبب الاجتماع لخاصية الهيئة الاجتماعية التي لا توجد في الأفراد فإذا كانت شريرة يتناجون في الشر ويزداد فيهم الشر ويقوى فيهم المعنى الذي يتناجون به بالاتصال والاجتماع\n ولهذا ورد بعد النهي: { ويتناجون بالإثم } الذي هو رذيلة القوى البهيمية { والعدوان } الذي هو رذيلة القوى الغضبية { ومعصية الرسول } التي هي رذيلة القوة النطقية بالجهل وغلبة الشيطنة\n الا ترى كيف نهى المؤمنين بعد هذه الآية عن التناجي بهذه الرذائل المذكورة وأمرهم بالتناجي بالخيرات ليتقوّوا بالهيئة الاجتماعية ويزدادوا فيها فقال: { وتناجوا بالبرّ } أي: الفضائل التي هي أضداد تلك الرذائل من الصالحات والحسنات المخصوصة بكل واحدة من القوى الثلاث { والتقوى } أي: الاجتناب عن أجناس الرذائل المذكورة { واتّقوا الله } في صفات نفوسكم { الذي إليه تُحْشرون } بالقرب منه عند التجرّد منها { فافسحوا يفسح الله لكم } أي: افسحوا من ضيق التنافس في الجاه والنخوة فإنه من الهيئات النفسانية واستيلاء القوة السبعية وركود النفس في ظلمة الأنية واحتجابها عن الأنوار القلبية والروحية\n فتنزهوا عنها { يفسح الله لكم } بالتجريد عن الهيئات البدنية والإمداد بالأنوار فتنشرح صدوركم وتنفسح ويتسع مكانكم في فضاء عالم القدس { يرفع الله الذين آمنوا منكم } الإيمان اليقيني { والذين أوتوا العلم } أي: علم آفات النفس ودقائق الهوى وعلم التنزّه منها بالتجريد { درجات } من الصفات القلبية والمراتب الملكوتية والجبروتية في عالم الأنوار { والله بما تعملون خبير } فيجازيكم ويعاقبكم بتلك الهيئات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على سبيل التوبيخ والتقريع للمنافقين: { أَلَمْ تَرَ } أيها الرائي { إِلَى } المنافقين { ٱلَّذِينَ نُهُواْ } ومنعوا { عَنِ ٱلنَّجْوَىٰ } والتغامز فيما بينهم بالعيون والحواجب\n حين جلسوا في مجلس رسول الله صلى الله عليه وسلم مع المؤمنين فمنعهم صلى الله عليه وسلم عن ذلك { ثُمَّ يَعُودُونَ لِمَا نُهُواْ عَنْهُ } إصراراً ومكابرةً { وَ } هم حينئذٍ { يَتَنَاجَوْنَ بِٱلإِثْمِ } الموجب للحد الشرعي\n أو ظهروا به وأفشوه { وَٱلْعُدْوَانِ } عن الأوضاع الشرعية { وَمَعْصِيَتِ ٱلرَّسُولِ } وتكذيبه\n والإعراض عنه وعن دينه مهما أمكن لهم\n\n\n{ وَ } بالجملة: هم من جملة شكيمتهم وغيظهم: { إِذَا جَآءُوكَ } يا أكمل الرسل { حَيَّوْكَ } على وجه النفاق { بِمَا لَمْ يُحَيِّكَ بِهِ ٱللَّهُ } فيقولون: السام عليك\n أو انعم صباحاً\n مع أن الله سبحانه يقول:\n[النمل: 59] { وَ } بعدما حيوك على مقتضى أهويتهم\n وقصدوا مقتك في تحيتهم { يَقُولُونَ } حينئذٍ { فِيۤ أَنفُسِهِمْ } ونجواهم: { لَوْلاَ } أي: هلاَّ { يُعَذِّبُنَا ٱللَّهُ بِمَا نَقُولُ } لو كان محمد نبياً؟! فظهر من عدم تعذيب الله إيانا أنه ليس بنبي\n قيل لهم حينئذٍ من قِبَل الحق: { حَسْبُهُمْ جَهَنَّمُ } عذاباً { يَصْلَوْنَهَا } ويدخلونها { فَبِئْسَ ٱلْمَصِيرُ } [المجادلة: 8] مصيرهم جنهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { ألم تَرَ إِلى الذين نُهوا عن النجوى ثم يعودون لما نُهوا عنه } نزلت في اليهود والمنافقين، كانوا يتناجون فيما بينهم، ويتغامزون بأعينهم إذا رأوا المؤمنين، يريدون أن يغيظوهم، فنهاهم رسولُ الله صلى الله عليه وسلم، فعادوا لمثل فعلهم. والخطاب لرسول الله صلى الله عليه وسلم. والهمزة للتعجيب مِن حالهم، وصيغة المضارع للدلالة على تكرير عودهم وتجدُّده، واستحضار صورته العجيبة. وفي السِّيَر: أنه أمر بإخراجهم من المسجد، فأُخرجوا مجرورين، كما في الاكتفاء. { ويتناجون بالإِثم والعُدوان } أي: بما هو إثم في نفسه وعدوان للمؤمنين، { ومعصيتِ الرسول } أي: وتواصٍ بمعصية الرسول. وذكره صلى الله عليه وسلم بعنوان الرسالة بين الخطابين المتوجهيْن إليه عليه السّلام لزيادة تشنُّعهم واستعظام معصيتهم، { وإِذا جاؤوا حَيَّوكَ } أي: سلَّموا عليك { بما لم يُحَيِّك به اللهُ } بما لا يُسلم عليك الله تعالى، فكانوا يقولون في تحيتهم: السام عليك يا محمد. والسام: الموت، والله تعالى يقول في سلامه على رسوله:\n[النمل: 29]\n[الصفات: 181]. { ويقولون في أنفسِهم } أي: فيما بينهم، أو في ضمائرهم، { لولا يُعذبُنا اللّهُ بما نقول } هلاّ يُعذبنا الله بذلك، فلو كان نبيّاً لعاقبنا بالهلاك، قال تعالى: { حَسْبُهم } عذاباً { جهنمُ يصلونها } يدخلونها فيحترقون فيها، { فبئس المصيرُ } المرجع جهنم. الإشارة: ألم ترَ إلى الذين نُهوا عن الوقوع في أهل الخصوصية، والتناجي بما يسؤوهم ثم يعودون لما نُهوا عنه، ويتناجون بالإثم والعدوان، وما فيه فساد البين وتشتيت القلوب، ومعصية الرسول بمخالفة سنته، وإذا جاؤوك أيها العارف، الخليفة للرسول، حيَّوك بما لم يُحيك به الله، أي: خاطبوك بما لم يأمر الله أن تُخاطَب به من التعظيم، ويقولون في أنفسهم، لولا يُعذبنا الله بن نفعل من تصغيرهم، حسبهم نار القطيعة والبُعد، مُخلّدون فيها، فبئس المصير. ثم أمر المؤمنين بعكس ذلك، فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ إِذَا تَنَاجَيْتُمْ }.\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "58:9",
      "similarity": 0.40127108251885363
    },
    {
      "verse": "4:115",
      "similarity": 0.3994574544287855
    },
    {
      "verse": "67:6",
      "similarity": 0.3795641519901305
    },
    {
      "verse": "14:29",
      "similarity": 0.3593507229131119
    },
    {
      "verse": "38:56",
      "similarity": 0.3261336908326527
    }
  ]
}