{
  "chapter": "المجادلة",
  "text": "يايها الذين ءامنوا۟ اذا تنجيتم فلا تتنجوا۟ بالاثم والعدون ومعصيت الرسول وتنجوا۟ بالبر والتقوى واتقوا۟ الله الذى اليه تحشرون",
  "translations": [
    {
      "translation": "You who have iman! when you confer together secretly, do not do so in wrongdoing and enmity and disobedience to the Messenger; rather confer together in goodness and taqwa of Allah. Have taqwa of Allah - Him to Whom you will be gathered.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, when you converse privately, do not talk of iniquity, rebellion, and disobedience to the Prophet, but talk of goodness and piety, and fear God before whom you will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when you converse in secrecy, let that not be concerning sin and transgression and disobedience to the Messenger; rather, converse concerning virtue and piety. And fear Allah to Whom all of you shall be mustered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when you hold a secret counsel, let it not be for a sinful, hostile purpose or to disobey the Messenger, but let your counsel take place for virtuous and pious reasons. Have fear of God in whose presence you will all be brought together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! When you consult each other, do not consult for sinning, nor for exceeding limits, nor for disobeying the Noble Messenger – and consult for righteousness and piety; and fear Allah, towards Whom you will be raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you hold secret counsel, do it not for sin and wrongdoing, and disobedience to the Messenger, but do it for Al-Birr and Taqwa; and have Taqwa of Allah unto Whom you shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! when you confer together in private, do not give to each other counsel of sin and revolt and disobedience to the Apostle, and give to each other counsel of goodness and guarding (against evil); and be careful of (your duty to) Allah, to Whom you shall be gathered together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, when you conspire secretly, then conspire not together in sin and enmity and disobedience to the Messenger, but conspire in piety and godfearing. Fear God, unto whom you shall be mustered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! When ye conspire together, conspire not together for crime and wrongdoing and disobedience toward the messenger, but conspire together for righteousness and piety, and keep your duty toward Allah, unto whom ye will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when you confer together in private, do not confer in support of sin and transgression and disobedience to the Messenger, but confer for the promotion of virtue and righteousness. Fear God, before whom you shall all be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! when ye whisper together, whisper not of sin, transgression and disobedience toward the apostle; but whisper for virtue and piety. And fear Allah Unto Whom ye will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! When you converse secretly, do not hold private conversations [imbued] with sin and aggression and disobedience to the Apostle, but converse in [a spirit of] piety and Godfearing, and be wary of Allah toward whom you will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! When ye hold secret counsel, do it not for iniquity and hostility, and disobedience to the Prophet; but do it for righteousness and self-restraint; and fear Allah, to Whom ye shall be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you hold secret counsel, do it not for sin and wrong-doing, and disobedience towards the Messenger (Muhammad SAW) but do it for Al-Birr (righteousness) and Taqwa (virtues and piety); and fear Allah unto Whom you shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when you talk in secret do not talk together in sin and hatred, and disobedience towards the Messenger, but talk of piety and caution. Fear Allah before whom you shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you converse secretly, do not converse in sin, and aggression, and disobedience of the Messenger; but converse in virtue and piety; And fear God, to Whom you will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, when you converse privately, do not converse about sin and aggression and disobedience to the Messenger but converse about righteousness and piety. And fear Allah, to whom you will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[58:9] O you who believe, if you do talk in secret, then do not talk in secret sinfully and in enmity and disobedience to the Messenger, but talk secretly in piety and fear of God. And fear God to Whom you will be gathered.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا أَيُّهَا الَّذِينَ آَمَنُوا إِذَا تَنَاجَيْتُمْ فَلَا تَتَنَاجَوْا بِالْإِثْمِ وَالْعُدْوَانِ وَمَعْصِيَةِ الرَّسُولِ وَتَنَاجَوْا بِالْبِرِّ وَالتَّقْوَى وَاتَّقُوا اللَّهَ الَّذِي إِلَيْهِ تُحْشَرُونَ (9)خطاب للمنافقين الذين يظهرون الإِيمان فعاملهم الله بما أظهروه وناداهم بوصف الذين آمنوا كما قال : { من الذين قالوا آمنا بأفواههم ولم تؤمن قلوبهم } \\[ المائدة : 41 \\] ومنه ما حكاه الله عن المشركين { وقالوا يا أيها الذي نزل عليه الذكر إنك لمجنون } \\[ الحجر : 6 \\] أي يأيها الذي نزل عليه الذكر بزعمه ، ونبههم إلى تدارك حالهم بالإِقلاع عن آثار النفاق على عادة القرآن من تعقيب التخويف بالترغيب . فالجملة استئناف ابتدائي .ذلك أن المنافقين كانوا يعملون بعمل أهل الإِيمان إذا لَقُوا الذين آمنوا فإذا رجعوا إلى قومهم غلب عليهم الكفر فكانوا في بعض أحوالهم مقاربين الإِيمان بسبب مخالطتهم للمؤمنين . ولذلك ضرب الله لهم مثلاً بالنور في قوله تعالى : { مثلهم كمثل الذي استوقد ناراً فلما أضاءت ما حوله ذهب الله بنورهم } \\[ البقرة : 17 \\] ثم قوله : { كلما أضاء لهم مشوا فيه وإذا أظلم عليهم قاموا } \\[ البقرة : 20 \\] . وهذا هو المناسب لقوله تعالى : { فلا تتناجوا بالإثم والعدوان ومعصيت الرسول } ، ويكون قوله : { وتناجوا بالبر والتقوى } تنبيهاً على ما يجب عليهم إن كانوا متناجين لا محالة .ويجوز أن تكون خطاباً للمؤمنين الخلّص بأنْ وجه الله الخطاب إليهم تعليماً لهم بما يحسن من التناجي وما يقبح منه بمناسبة ذم تناجي المنافقين فلذلك ابتدىء بالنهي عن مثل تناجي المنافقين وإن كان لا يصدر مثله من المؤمنين تعريضاً بالمنافقين ، مثل قوله تعالى : { يأيها الذين آمنوا لا تكونوا كالذين كفروا وقالوا لإخوانهم إذا ضربوا في الأرض أو كانوا غزى لو كانوا عندنا ما ماتوا وما قتلوا ليجعل الله ذلك حسرة في قلوبهم } \\[ آل عمران : 156 \\] ، ويكون المقصود من الكلام هو قوله : { وتناجوا بالبر والتقوى } تعليماً للمؤمنين .والتقييد ب { إذا تناجيتم } يشير إلى أنه لا ينبغي التناجي مطلقاً ولكنهم لما اعتادوا التناجي حُذروا من غوائله ، وإلا فإن التقييد مستغنى عنه بقوله : «لا تتناجوا بالإِثم والعدوان» . وهذا مثل ما وقع في حديث النهي عن الجلوس في الطرقات من قوله صلى الله عليه وسلم «فإن كنتم فاعلين لا محالة فاحفظوا حَق الطريق» .وقرأ الجمهور { فلا تتناجوا } بصيغة التفاعل . وقرأه رويس عن يعقوب وحده { فلا تنتجُوا } بوزن تَنْتَهُوا .والأمر من قوله : { وتناجوا بالبر } مستعمل في الإِباحة كما اقتضاه قوله تعالى : { إذا تناجيتم } .والإِثم والعدوان ومعصية الرسول تقدمت . وأما البرّ فهو ضد الإِثم والعدوان وهو يعم أفعال الخير المأمور بها في الدين .و { التقوى } : الامتثال ، وتقدمت في قوله تعالى : { هدى للمتقين } في سورة \\[ البقرة : 2 \\] .وفي قوله : الذي إليه تحشرون } تذكير بيوم الجزاء . فالمعنى : الذي إليه تحشرون فيجازيكم .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe) in Muhammad (pbuh) and the Qur'an! (when ye conspire together) among yourselves, (conspire not together for crime) for lying (and wrong-doing) transgression (and disobedience towards the messenger) by opposing the Messenger like the hypocrites did with the Jews, leaving aside the true believers, (but conspire together for righteousness) for performing the obligations of Allah and for being good towards one another (and pity) shunning transgressions and boycott, (and keep your duty) fear Allah for secret conferencing with other than the true believers, (towards Allah, unto whom ye will be gathered) in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ } عليكم { إِذَا تَنَاجَيْتُمْ } فيما بينكم { فَلاَ تَتَنَاجَوْاْ بِٱلإِثْمِ وَٱلْعُدْوَانِ وَمَعْصِيَتِ ٱلرَّسُولِ } مثل مناجاة أولئك الأشقياء المردودين\n بل { وَتَنَاجَوْاْ بِٱلْبِرِّ } الموجب لأنواع الخيرات\n الجالب لأكرم المثوبات { وَٱلتَّقْوَىٰ } عن محارم الله\n ولا سيما عن عصيان الرسول المستلزم لأنواع الحرمان والخسران { وَ } بالجملة: { ٱتَّقُواْ ٱللَّهَ } المنتقم الغيور { ٱلَّذِيۤ إِلَيْهِ تُحْشَرُونَ } [المجادلة: 9] وترجعون في يوم البعث والجزاء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الذين آمنوا إِذا تناجيتم } في أنديتكم وفي خلواتكم { فلا تتناجَوا بالإِثم والعدوانِ ومعصيتِ الرسول } كفعل هؤلاء المنافقين\n { وتناجَوا بالبِرِّ والتقوى } أي: بما تضمن خير المؤمنين\n والاتقاء عن معصية الرسول صلى الله عليه وسلم\n أو: بأداء الفرائض وترك المعاصي\n { واتقوا اللهّ الذي إِليه تحشرون } فيُجازيكم بما تتناجون به من خير أو شر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:203",
      "similarity": 0.40488288665257566
    },
    {
      "verse": "58:8",
      "similarity": 0.40127108251885363
    },
    {
      "verse": "19:14",
      "similarity": 0.38451983109658877
    },
    {
      "verse": "46:6",
      "similarity": 0.36430903993344144
    },
    {
      "verse": "83:12",
      "similarity": 0.35003755954011234
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/058009.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/058009.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/58:9.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}