{
  "chapter": "الحشر",
  "text": "والذين جاءو منۢ بعدهم يقولون ربنا اغفر لنا ولاخوننا الذين سبقونا بالايمن ولا تجعل فى قلوبنا غلا للذين ءامنوا۟ ربنا انك رءوف رحيم",
  "translations": [
    {
      "translation": "Those who have come after them say, 'Our Lord, forgive us and our brothers who preceded us in iman and do not put any rancour in our hearts towards those who have iman. Our Lord, You are All-Gentle, Most",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And the spoils are for) those who came after them, who say: \"O Lord, forgive us and our brothers who came to faith before us, and do not put a grudge in our hearts against those who believe O Lord, You are compassionate and kind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And it also belongs to) those who came after them, and who pray: “Lord, forgive us and our brethren who have preceded us in faith, and do not put in our hearts any rancour towards those who believe. Lord, You are the Most Tender, the Most Compassionate.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who migrated later (to Medina) say, \"Lord, forgive us and our brothers who preceded us in the faith, and clear our hearts of any ill will against the believers. Lord, You are Compassionate and All-merciful\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who came after them say, “O our Lord! Forgive us, and our brothers who accepted faith before us, and do not keep any malice in our hearts towards the believers – O our Lord! Indeed You only are the Most Compassionate, Most Merciful.”.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who came after them say: \"Our Lord! Forgive us and our brethren who have preceded us in faith, and put not in our hearts any hatred against those who have believed. Our Lord! You are indeed full of kindness, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who come after them say: Our Lord! forgive us and those of our brethren who had precedence of us in faith, and do not allow any spite to remain in our hearts towards those who believe, our Lord! surely Thou art Kind, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who came after them, they say, 'Our Lord, forgive us and our brothers, who preceded us in belief, and put Thou not into our hearts any rancour towards those who believe. Our Lord, surely Thou art the All-gentle, the All-compassionate.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who came (into the faith) after them say: Our Lord! Forgive us and our brethren who were before us in the faith, and place not in our hearts any rancour toward those who believe. Our Lord! Thou art Full of Pity, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who came [into the faith] after them say, \"Our Lord, forgive us and our brothers who preceded us in the faith and leave no malice in our hearts towards those who believe. Lord, You are indeed compassionate and merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is also due Unto those who came after them, saying: 'Our Lord! forgive us and our brethren who have preceded us in the faith, and place not in our hearts any rancour toward those who had believed. Our Lord! verily Thou art Tender, Merciful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [also for] those who came in after them, who say, ‘Our Lord, forgive us and our brethren who were our forerunners in the faith, and do not put any rancour in our hearts toward the faithful. Our Lord, You are indeed most kind and merciful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who came after them say: \"Our Lord! Forgive us, and our brethren who came before us into the Faith, and leave not, in our hearts, rancour (or sense of injury) against those who have believed. Our Lord! Thou art indeed Full of Kindness, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who came after them say: \"Our Lord! Forgive us and our brethren who have preceded us in Faith, and put not in our hearts any hatred against those who have believed. Our Lord! You are indeed full of kindness, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who came after them say: 'Forgive us our Lord, and forgive our brothers who were believers before us. Do not put in our hearts any spite towards those who believe. Lord, You are the Gentle, the Most Merciful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who came after them, saying, “Our Lord, forgive us, and our brethren who preceded us in faith, and leave no malice in our hearts towards those who believe. Our Lord, You are Clement and Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [there is a share for] those who came after them, saying, \"Our Lord, forgive us and our brothers who preceded us in faith and put not in our hearts [any] resentment toward those who have believed. Our Lord, indeed You are Kind and Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:10] And those who will come after them, after the Emigrants and the Helpers, up to the Day of Resurrection, say, ‘Our Lord, forgive us and our brethren who preceded us in [embracing] the faith, and do not place any rancour, any spite, in our hearts toward those who believe. Our Lord, You are indeed Kind, Merciful!’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who came (into the faith) after them) after the first Emigrants (say: Our Lord Forgive us) our sins (and our brethren who were before us in the faith) and migration, (and place not in our hearts any rancour) or resentful envy (towards those who believe) among the Emigrants. (Our Lord! Thou art Full of Pity, Merciful) they made these supplications because they were afraid of resentful envy, because the Prophet (pbuh) gave the spoils to the first Emigrants and did not give them anything.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تَجْعَلْ فِي قُلُوبِنَا غِلاًّ } يعني غِشاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعد فقراء الأنصار للفقراء التابعين، وهم { ٱلَّذِينَ جَآءُوا مِن بَعْدِهِمْ } مهاجرين من بقعة الإمكان نحو فضاء الوجوب، مقتفين أثر أولئك الكرام، مريدين لهم بإحسان، مذكرين لهم بغفران، حيث { يَقُولُونَ } في مناجاتهم مع ربهم في خلواتهم، وأعقاب صلواتهم: { رَبَّنَا } يا من ربَّانا على فطرة الإسلام { ٱغْفِرْ لَنَا } ذنوبنا التي صدرت عنَّا { وَلإِخْوَانِنَا } في الدين، وهم { ٱلَّذِينَ سَبَقُونَا بِٱلإِيمَانِ } وسلوك طريق العرفان { وَ } بالجملة: { لاَ تَجْعَلْ فِي قُلُوبِنَا } يا مولانا { غِلاًّ } حقداً وحسداً { لِّلَّذِينَ آمَنُواْ } مطلقاً، لا للسابقين ولا للاحقين { رَبَّنَآ } يا من ربَّانا على الإخلاص والتوفيق تقبل منَّا مناجاتنا، واقض لنا حاجاتنا { إِنَّكَ رَءُوفٌ } عطوف على عموم عبادك، سيما المخلصين منهم { رَّحِيمٌ } [الحشر: 10] تقبل توبتهم، وتغفر زلتهم إن استغفروا نحوك نادمين عما صدر عنهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ذكر التابعين، فقال: { والذين جاؤوا مِن بعدهم } هم التابعون بإحسان إلى يوم القيامة، وقيل: هم الذين هاجروا بعدما قوي الإسلام، { يقولون ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان } ، وصفوهم بذلك اعترافاً بفضلهم، وعن عائشة رضي الله عنها:\n\n \" أُمِرُوا بأن يستغفروا لهم، فسبُّوهم \" \n\n{ ولا تجعل في قلوبنا غِلاًّ } أي: حقداً وعداوة { للذين آمنوا } على الإطلاق، { ربنا إِنك رؤوف رحيم } مبالغ في الرأفة والرحمة، فأنت حقيق بأن تجيب دعاءنا برأفتك ورحمتك\n الإشارة: الذين يستحقون المواهب، والفيض الإلهي والاصطفاء، ثلاث أصناف، الأول: الفقراء الذين هاجروا أوطانهم، وتركوا ديارهم وعشائرهم طلباً لصلاح قلوبهم وأسرارهم، والثاني: القوم الذين نزلوا بهم إذا آووهم وآثروهم بأموالهم وأنفسهم، الثالث: مَن جاء بعدهم طلباً لذلك، على الوصف الذي ذكره الحق { يقولون ربنا اغفر لنا\n\n\n } الخ\n قال الورتجبي: قوله تعالى: { والذين تبوؤوا الدارَ والإيمان\n\n\n } الخ، أثنى الله سبحانه على الفقراء، ووصَفَهم بأحسن الوصف، إذ كانوا صادقين في فقرهم، ثم أثنى على الأغنياء لِصدقهم في غناهم، ووصَفَهم بالإيمان والمعرفة بالله من قبلهم ولزومهم مواضع قربه، وخفضِهم جناحهم لإخوانهم من الفقراء، ومحبتهم، وتقديسهم من الحسد والشح والبُغض وحب الدنيا، ثم وَصَفَهم بالسخاء والإيثار، فلم يبقَ في قلوبهم من حب الدنيا وجاهها ذرة\n ومَنْ سجيتُه مقدسة مِن حرص نفسه أفلح وظفر برؤية ربه\n هـ\n قلت: كأنه يشير إلى أنَّ قوله تعالى: { للفقراء المهاجرين } هم أهل السير من المريدين، وقوله تعالى: { والذين تبوؤوا الدار\n\n\n } هو الواصلون العارفون، أي: تبوؤوا دارَ المعرفة، حيث سكنوها، ورسخوا فيها، وأَلفِوا الإيمان وذاقوا حلاوته\n وقوله تعالى: { ويُؤثرون على أنفسهم\n\n\n } الخ، بعد أن وَصَفَهم بقطع الطمع والحرص، والزهد فيما لم يملكوا بقوله: { ولا يجدون في صدورهم حاجة } وَصَفَهم بالإيثار فيما ملكوا، وبذلك يتم تحقيق خروج الدنيا من قلوبهم، بحيث لا يتعلق القلب بما فات منها، ولا يُمسك ما وجد منها، بل يُؤثر به مع الحاجة إليه، فالآية تشير إلى سلامة الصدور، وسخاوة الأنفس، وهذا كان وصف الصحابة - رضي الله عنهم - وبهذين الخصلتين فاقوا جميعَ الناس، وهي أخلاق الصوفية - رضي الله عنهم - قال الشيخ أبو يزيد: ما غلبني أحد غير شاب من بَلْخ، قَدِمَ حاجًّا، فقال: يا أبا يزيد، ما الزهد عندكم؟ فقلت: إذا وجدنا أكلنا، وإذا فقدنا صبرنا، فقال: هكذا عندنا الكلاب ببلخ، فقلت: وما الزهد عندكم؟ فقال: إذا وجدنا آثرنا، وإذا فقدنا شكرنا\n هـ\n وسُئل ذو النون: ما حد الزاهد المشروح صدره؟ فقال: ثلاثة تفريق المجموع، وترك طلب المفقود، والإيثار عند القوت\n هـ\n ثم عَجَّبَ من المنافقين، فقال: { أَلَمْ تَرَ إِلَى ٱلَّذِينَ نَافَقُواْ يَقُولُونَ لإِخْوَانِهِمُ }\n\n",
      "translations": []
    }
  ]
}