{
  "chapter": "الحشر",
  "text": "والذين جاءو منۢ بعدهم يقولون ربنا اغفر لنا ولاخوننا الذين سبقونا بالايمن ولا تجعل فى قلوبنا غلا للذين ءامنوا۟ ربنا انك رءوف رحيم",
  "translations": [
    {
      "translation": "Those who have come after them say, 'Our Lord, forgive us and our brothers who preceded us in iman and do not put any rancour in our hearts towards those who have iman. Our Lord, You are All-Gentle, Most",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And the spoils are for) those who came after them, who say: \"O Lord, forgive us and our brothers who came to faith before us, and do not put a grudge in our hearts against those who believe O Lord, You are compassionate and kind.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And it also belongs to) those who came after them, and who pray: “Lord, forgive us and our brethren who have preceded us in faith, and do not put in our hearts any rancour towards those who believe. Lord, You are the Most Tender, the Most Compassionate.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who migrated later (to Medina) say, \"Lord, forgive us and our brothers who preceded us in the faith, and clear our hearts of any ill will against the believers. Lord, You are Compassionate and All-merciful\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who came after them say, “O our Lord! Forgive us, and our brothers who accepted faith before us, and do not keep any malice in our hearts towards the believers – O our Lord! Indeed You only are the Most Compassionate, Most Merciful.”.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who came after them say: \"Our Lord! Forgive us and our brethren who have preceded us in faith, and put not in our hearts any hatred against those who have believed. Our Lord! You are indeed full of kindness, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who come after them say: Our Lord! forgive us and those of our brethren who had precedence of us in faith, and do not allow any spite to remain in our hearts towards those who believe, our Lord! surely Thou art Kind, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for those who came after them, they say, 'Our Lord, forgive us and our brothers, who preceded us in belief, and put Thou not into our hearts any rancour towards those who believe. Our Lord, surely Thou art the All-gentle, the All-compassionate.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who came (into the faith) after them say: Our Lord! Forgive us and our brethren who were before us in the faith, and place not in our hearts any rancour toward those who believe. Our Lord! Thou art Full of Pity, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who came [into the faith] after them say, \"Our Lord, forgive us and our brothers who preceded us in the faith and leave no malice in our hearts towards those who believe. Lord, You are indeed compassionate and merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is also due Unto those who came after them, saying: 'Our Lord! forgive us and our brethren who have preceded us in the faith, and place not in our hearts any rancour toward those who had believed. Our Lord! verily Thou art Tender, Merciful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [also for] those who came in after them, who say, ‘Our Lord, forgive us and our brethren who were our forerunners in the faith, and do not put any rancour in our hearts toward the faithful. Our Lord, You are indeed most kind and merciful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who came after them say: \"Our Lord! Forgive us, and our brethren who came before us into the Faith, and leave not, in our hearts, rancour (or sense of injury) against those who have believed. Our Lord! Thou art indeed Full of Kindness, Most Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who came after them say: \"Our Lord! Forgive us and our brethren who have preceded us in Faith, and put not in our hearts any hatred against those who have believed. Our Lord! You are indeed full of kindness, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who came after them say: 'Forgive us our Lord, and forgive our brothers who were believers before us. Do not put in our hearts any spite towards those who believe. Lord, You are the Gentle, the Most Merciful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who came after them, saying, “Our Lord, forgive us, and our brethren who preceded us in faith, and leave no malice in our hearts towards those who believe. Our Lord, You are Clement and Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [there is a share for] those who came after them, saying, \"Our Lord, forgive us and our brothers who preceded us in faith and put not in our hearts [any] resentment toward those who have believed. Our Lord, indeed You are Kind and Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:10] And those who will come after them, after the Emigrants and the Helpers, up to the Day of Resurrection, say, ‘Our Lord, forgive us and our brethren who preceded us in [embracing] the faith, and do not place any rancour, any spite, in our hearts toward those who believe. Our Lord, You are indeed Kind, Merciful!’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَالَّذِينَ جَاءُوا مِنْ بَعْدِهِمْ يَقُولُونَ رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِلَّذِينَ آَمَنُوا رَبَّنَا إِنَّكَ رَءُوفٌ رَحِيمٌ (10)عطف على { والذين تبوؤا الدار } \\[ الحشر : 9 \\] على التفسيرين المتقدمين؛ فأما على رأي من جعلوا { والذين تبوءوا الدار } \\[ الحشر : 9 \\] معطوفاً على { للفقراء المهاجرين } \\[ الحشر : 8 \\] جعلوا { الذين جاؤوا من بعدهم } فريقاً من أهل القُرى ، وهو غير المهاجرين والأنصار بلْ هو من جاء إلى الإِسلام بعد المهاجرين والأنصار ، فضمير { من بعدهم } عائد إلى مجموع الفريقين .والمجيء مستعمل للطروِّ والمصير إلى حالة تماثل حالهم ، وهي حالة الإِسلام ، فكأنهم أتوا إلى مكان لإِقامتهم ، وهذا فريق ثالث وهؤلاء هم الذين ذُكروا في قوله تعالى بعدَ ذكر المهاجرين والأنصار { والذين اتَّبعوهم بإحسان } \\[ التوبة : 100 \\] أي اتبعوهم في الإِيمان .وإنما صيغ { جاءوا } بصيغة الماضي تغليباً لأن من العرب وغيرهم من أسلموا بعد الهجرة مثل غِفارة ، ومُزينة ، وأسلم ، ومثل عبد الله بن سَلاَم ، وسلمان الفارسي ، فكأنه قيل : الذين جاؤوا ويجيئون ، بدلالة لحن الخطاب . والمقصود من هذا : زيادة دفع إيهام أن يختص المهاجرون بما أفاء الله على رسوله صلى الله عليه وسلم من أهل القرى كما اختصهم النبي صلى الله عليه وسلم بفيْء بني النضير .وقد شملت هذه الآية كل من يوجد من المسلمين أبد الدهر ، وعلى هذا جرى فهم عمر بن الخطاب رضي الله عنه . روى البخاري من طريق مالك عن زيد بن أسلم عن أبيه قال : قال عمر : لولا آخر المسلمين ما فتحت قرية إلا قسمتها بين أهلها ( أي الفاتحين ) كما قسم النبي صلى الله عليه وسلم خيبر .وذكر القرطبي : أن عمر دعا المهاجرين والأنصار واستشارهم فيما فتح الله عليه وقال لهم : تثبتوا الأمر وتدبروه ثم اغدوا عليَّ فلما غدَوا عليه قال : قد مررت بالآيات التي في سورة الحشر وتلا { ما أفاء الله على رسوله من أهل القرى } إلى قوله : { أولئك هم الصادقون } ( 7 ، 8 ) . قال : ما هي لهؤلاء فقط وتلا قوله : والذين جاءوا من بعدهم } إلى قوله : { رؤوف رحيم } ثم قال : ما بقي أحد من أهل الإِسلام إلا وقد دخل في ذلك اه .وهذا ظاهر في الفيء ، وأما ما فُتح عنوة فمسألة أخرى ولعمر بن الخطاب في عدم قسمته سوادَ العراق بين الجيش الفاتحين له عمل آخر ، وهو ليس من غرضنا . ومحله كتب الفقه والحديث .والفريق من المفسرين الذين جعلوا قوله تعالى : { والذين تبوءوا الدار والإيمان } \\[ الحشر : 9 \\] كلاماً مستأنفاً ، وجعل { يحبون من هاجر إليهم } \\[ الحشر : 9 \\] خبراً عن اسم الموصول ، جعلوا قوله : { والذين جاءوا من بعدهم } كذلك مستأنفاً .ومن الذين جعلوا قوله : { والذين تبوءوا } \\[ الحشر : 9 \\] معطوفاً على { للفقراء المهاجرين } \\[ الحشر : 8 \\] من جعل قوله : { والذين جاءوا من بعدهم } مستأنفاً . ونسبه ابن الفرس في «أحكام القرآن» إلى الشافعي . ورأى أن الفيء إذا كان أرضاً فهو إلى تخيير الإِمام وليس يتعين صرفه للأصناف المذكورة في فيء بني النضير .وجملة { يقولون ربنا اغفر لنا } على التفسير المختار في موضع الحال من { الذين جاؤوا من بعدهم } .والغلّ بكسر الغين : الحسد والبغض ، أي سألوا الله أن يطَهر نفوسهم من الغلّ والحسد للمؤمنين السابقين على ما أعطُوه من فضيلة صحبة النبي صلى الله عليه وسلم وما فُضّل به بعضهم من الهجرة وبعضهم من النصرة ، فبيّن الله للذين جاؤا من بعدهم ما يكسبهم فضيلة ليست للمهاجرين والأنصار ، وهي فضيلة الدعاء لهم بالمغفرة وانطواء ضمائرهم على محبتهم وانتفاء البغض لهم .والمراد أنهم يضمرون ما يدعون الله به لهم في نفوسهم ويرضوا أنفسهم عليه .وقد دلت الآية على أن حقاً على المسلمين أن يَذكروا سلفهم بخير ، وأن حقاً عليهم محبة المهاجرين والأنصار وتعظيمهم ، قال مالك : من كان يبغض أحداً من أصحاب محمد صلى الله عليه وسلم أو كان قلبه عليه غل فليس له حق في فيْء المسلمين ، ثم قرأ { والذين جاءوا من بعدهم } الآية .فلعله أخذ بمفهوم الحال من قوله تعالى : { يقولون ربنا اغفر لنا } الآية ، فإن المقصد من الثناء عليهم بذلك أن يضمروا مضمونه في نفوسهم فإذا أضمروا خلافه وأعلنوا بما ينافي ذلك فقد تخلف فيهم هذا الوصف ، فإن الفيء عطية أعطاها الله تلك الأصناف ولم يكتسبوها بحق قتال ، فاشترط الله عليهم في استحقاقها أن يكونوا محبين لسلفهم غير حاسدين لهم .وهو يعني إلا ما كان من شنآن بين شخصين لأسباب عادية أو شرعية مثل ما كان بين العباس وعليّ حين تحاكما إلى عمر ، فقال العباس : اقض بيني وبين هذا الظالم الخائن الغادر . ومثل إقامة عمر حدّ القذف على أبي بَكرة .وأما ما جرى بين عائشة وعليّ من النزاع والقتال وبين عليّ ومعاوية من القتال فإنما كان انتصاراً للحق في كلا رأيَي الجانبين وليس ذلك لغلّ أو تنقص ، فهو كضرب القاضي أحداً تأديباً له فوجب إمساك غيرهم من التحَزب لهم بعدهم فإنه وإن ساغ ذلك لآحادِهم لتكافىء درجاتهم أو تقاربها . والظنِّ بهم زوال الحزازات من قلوبهم بانقضاء تلك الحوادث ، لا يسوغ ذلك للأذناب من بعدهم الذين ليسوا منهم في عير ولا نفير ، وإنما هي مسحَة من حمية الجاهلية نَخرت عضد الأمة المحمدية .\n\n",
      "translations": [
        {
          "translation": "(And those who came (into the faith) after them) after the first Emigrants (say: Our Lord Forgive us) our sins (and our brethren who were before us in the faith) and migration, (and place not in our hearts any rancour) or resentful envy (towards those who believe) among the Emigrants. (Our Lord! Thou art Full of Pity, Merciful) they made these supplications because they were afraid of resentful envy, because the Prophet (pbuh) gave the spoils to the first Emigrants and did not give them anything.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تَجْعَلْ فِي قُلُوبِنَا غِلاًّ } يعني غِشاً\n\n",
      "translations": [
        {
          "translation": " And do not make in our hearts {ghishāan}\n\nAnd do not make in our hearts ghishāan.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ والذين جاؤوا من } بعد الذين هاجروا إلى الفطرة\n أي: اخذوا في السلوك وقطع منازل النفس متضرّعين قائلين بلسان الافتقار: { ربّنا اغفر لنا } هيئات الرذائل وصفات النفوس بأنوار القلوب { ولإخواننا الذين سبقونا بالإيمان } ذنوب التلوينات بظهور تلك الصفات والضلالة بعد الهدى { ولا تجعل في قلوبنا غلاًّ } بالاحتجاب بالهيئات السبعية والشيطانية ورسوخها في قلوبنا { ربنا إنك غفور } تستر تلك الهيئات بأنوار الصفات { رحيم } بإفاضة الكمالات وإراءة التجليات\n { لأنتم أشدّ رهبة في صدورهم من الله } لاحتجابهم بالخلق عن الحق بسبب جهلهم بالله وعدم معرفتهم له إذ لو عرفوه لعلموا أن لا مؤثر غيره وشعروا بعظمته وقدرته فلم يبق عظم الخلق ولا أثرهم وقدرهم عندهم\n كما قال أمير المؤمنين عليه السلام: \" عظم الخالق عندك يصغر المخلوق في عينك \"\n { بأسهم بينهم شديد } لكونهم غير مقهورين هناك بقهر الله ولا واقعاً ظل قهر الرسول وهيبته وعكس نور تأييده وتنوّر نفسه بالاتصال بعالم القدس عليهم { تحسبهم جميعاً } لاتفاقهم في الظاهر { وقلوبهم شتّى } لانتفاء الجمعية الحقيقية بنور التوحيد عنها وتجاذب دواعيها لتفنن تعلقاتها بالأمور السفلية وتفرّقها عن الحق بالباطل لاحتجابها بالكثرة عن الوحدة { ذلك بأنهم قوم لا يعقلون } فيختارون طريق التوحيد العلمي ويتنحون عن السبل المتفرّقة الوهمية\n فإن طريق العقل واحد وطرق شيطان الوهم متفرقة\n وتشتت القلوب يوهن العزائم ويضعف القوى",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهم { ٱلَّذِينَ جَآءُوا مِن بَعْدِهِمْ } مهاجرين من بقعة الإمكان نحو فضاء الوجوب\n مقتفين أثر أولئك الكرام\n مريدين لهم بإحسان\n مذكرين لهم بغفران\n حيث { يَقُولُونَ } في مناجاتهم مع ربهم في خلواتهم\n وأعقاب صلواتهم: { رَبَّنَا } يا من ربَّانا على فطرة الإسلام { ٱغْفِرْ لَنَا } ذنوبنا التي صدرت عنَّا { وَلإِخْوَانِنَا } في الدين\n وهم { ٱلَّذِينَ سَبَقُونَا بِٱلإِيمَانِ } وسلوك طريق العرفان { وَ } بالجملة: { لاَ تَجْعَلْ فِي قُلُوبِنَا } يا مولانا { غِلاًّ } حقداً وحسداً { لِّلَّذِينَ آمَنُواْ } مطلقاً\n لا للسابقين ولا للاحقين { رَبَّنَآ } يا من ربَّانا على الإخلاص والتوفيق تقبل منَّا مناجاتنا\n واقض لنا حاجاتنا { إِنَّكَ رَءُوفٌ } عطوف على عموم عبادك\n سيما المخلصين منهم { رَّحِيمٌ } [الحشر: 10] تقبل توبتهم\n وتغفر زلتهم إن استغفروا نحوك نادمين عما صدر عنهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يقولون ربنا اغفر لنا ولإخواننا الذين سبقونا بالإيمان } \n وصفوهم بذلك اعترافاً بفضلهم\n وعن عائشة رضي الله عنها:\n \" أُمِرُوا بأن يستغفروا لهم\n فسبُّوهم \" \n{ ولا تجعل في قلوبنا غِلاًّ } أي: حقداً وعداوة { للذين آمنوا } على الإطلاق\n { ربنا إِنك رؤوف رحيم } مبالغ في الرأفة والرحمة\n فأنت حقيق بأن تجيب دعاءنا برأفتك ورحمتك\n الإشارة: الذين يستحقون المواهب\n والفيض الإلهي والاصطفاء\n ثلاث أصناف\n الأول: الفقراء الذين هاجروا أوطانهم\n وتركوا ديارهم وعشائرهم طلباً لصلاح قلوبهم وأسرارهم\n والثاني: القوم الذين نزلوا بهم إذا آووهم وآثروهم بأموالهم وأنفسهم\n الثالث: مَن جاء بعدهم طلباً لذلك\n على الوصف الذي ذكره الحق { يقولون ربنا اغفر لنا\n\n\n } الخ\n قال الورتجبي: قوله تعالى: { والذين تبوؤوا الدارَ والإيمان\n\n\n } الخ\n أثنى الله سبحانه على الفقراء\n ووصَفَهم بأحسن الوصف\n إذ كانوا صادقين في فقرهم\n ثم أثنى على الأغنياء لِصدقهم في غناهم\n ووصَفَهم بالإيمان والمعرفة بالله من قبلهم ولزومهم مواضع قربه\n وخفضِهم جناحهم لإخوانهم من الفقراء\n ومحبتهم\n وتقديسهم من الحسد والشح والبُغض وحب الدنيا\n ثم وَصَفَهم بالسخاء والإيثار\n فلم يبقَ في قلوبهم من حب الدنيا وجاهها ذرة\n ومَنْ سجيتُه مقدسة مِن حرص نفسه أفلح وظفر برؤية ربه\n هـ\n قلت: كأنه يشير إلى أنَّ قوله تعالى: { للفقراء المهاجرين } هم أهل السير من المريدين\n وقوله تعالى: { والذين تبوؤوا الدار\n\n\n } هو الواصلون العارفون\n أي: تبوؤوا دارَ المعرفة\n حيث سكنوها\n ورسخوا فيها\n وأَلفِوا الإيمان وذاقوا حلاوته\n وقوله تعالى: { ويُؤثرون على أنفسهم\n\n\n } الخ\n بعد أن وَصَفَهم بقطع الطمع والحرص\n والزهد فيما لم يملكوا بقوله: { ولا يجدون في صدورهم حاجة } وَصَفَهم بالإيثار فيما ملكوا\n وبذلك يتم تحقيق خروج الدنيا من قلوبهم\n بحيث لا يتعلق القلب بما فات منها\n ولا يُمسك ما وجد منها\n بل يُؤثر به مع الحاجة إليه\n فالآية تشير إلى سلامة الصدور\n وسخاوة الأنفس\n وهذا كان وصف الصحابة - رضي الله عنهم - وبهذين الخصلتين فاقوا جميعَ الناس\n وهي أخلاق الصوفية - رضي الله عنهم - قال الشيخ أبو يزيد: ما غلبني أحد غير شاب من بَلْخ\n قَدِمَ حاجًّا\n فقال: يا أبا يزيد\n ما الزهد عندكم؟ فقلت: إذا وجدنا أكلنا\n وإذا فقدنا صبرنا\n فقال: هكذا عندنا الكلاب ببلخ\n فقلت: وما الزهد عندكم؟ فقال: إذا وجدنا آثرنا\n وإذا فقدنا شكرنا\n هـ\n وسُئل ذو النون: ما حد الزاهد المشروح صدره؟ فقال: ثلاثة تفريق المجموع\n وترك طلب المفقود\n والإيثار عند القوت\n هـ\n ثم عَجَّبَ من المنافقين\n فقال: { أَلَمْ تَرَ إِلَى ٱلَّذِينَ نَافَقُواْ يَقُولُونَ لإِخْوَانِهِمُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:47",
      "similarity": 0.497763144297662
    },
    {
      "verse": "69:30",
      "similarity": 0.49573430863220014
    },
    {
      "verse": "57:9",
      "similarity": 0.48589306841980395
    },
    {
      "verse": "24:20",
      "similarity": 0.4779547613891979
    },
    {
      "verse": "15:47",
      "similarity": 0.43112920398426174
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/059010.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/059010.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/59:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}