{
  "chapter": "الحشر",
  "text": "لا يقتلونكم جميعا الا فى قرى محصنة او من وراء جدرۭ باسهم بينهم شديد تحسبهم جميعا وقلوبهم شتى ذلك بانهم قوم لا يعقلون",
  "translations": [
    {
      "translation": "They will not fight against you all together as a group except in fortified towns or behind high walls. Their hostility towards each other is intense. They are full of bravado in each other's company. You consider them united but their hearts are scattered wide. That is because they are people who do not use their intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not fight you in a body except in fortified cities, or from behind the walls. Their enmity among themselves is great. You think they are united, but divided are their hearts. That is because these people are devoid of sense,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will never fight against you as a body (in an open battlefield); and if they fight against you they will fight only in fortified townships or from behind walls. Intense is their hostility to one another. You reckon them united while their hearts are divided. That is because they are a people devoid of reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not fight you united except with the protection of fortified towns or from behind walls. They are strong among themselves. You think that they are united, but in fact, their hearts are divided. They are a people who have no understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not fight you even if they all come together, except in barricaded cities or from behind walls; they are severe fighters among themselves; you will assume them to be one, whereas their hearts are divided; this is because they are a people who do not have any sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They fight not against you even together, except in fortified townships, or from behind walls. Their enmity among themselves is very great. You would think they were united, but their hearts are divided. That is because they are a people who understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not fight against you in a body save in fortified towns or from behind walls; their fighting between them is severe, you may think them as one body, and their hearts are disunited; that is because they are a people who have no sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not fight against you all together except in fortified cities, or from behind walls. Their valour is great, among themselves; you think of them as a host; but their hearts are scattered; that is because they are a people who have no sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not fight against you in a body save in fortified villages or from behind walls. Their adversity among themselves is very great. Ye think of them as a whole whereas their hearts are divers. That is because they are a folk who have no sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will never fight against you in a body except from within fortified strongholds or from behind walls. There is much hostility between them. You think they are united, but their hearts are divided, because they are a people devoid of reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall not fight against you, not even together, except in fenced townships or from behind walls. Their violence among themselves is strong; thou deemest them enjoined, whereas their hearts are diverse. That is because they are a people who reflect not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not fight against you together except in fortified townships or from behind walls. Their fierceness is great only within themselves. You suppose them to be united, but their hearts are divided. That is because they are a lot who do not exercise their reason,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not fight you (even) together, except in fortified townships, or from behind walls. Strong is their fighting (spirit) amongst themselves: thou wouldst think they were united, but their hearts are divided: that is because they are a people devoid of wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They fight not against you even together, except in fortified townships, or from behind walls. Their enmity among themselves is very great. You would think they were united, but their hearts are divided, that is because they are a people who understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will never fight against you all together except from fortified villages or from behind walls. Their courage is great among themselves; you think them to be united, yet their hearts are not united. That is because they are a people who have no sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not fight you all together except from fortified strongholds, or from behind walls. Their hostility towards each other is severe. You would think they are united, but their hearts are diverse. That is because they are a people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will not fight you all except within fortified cities or from behind walls. Their violence among themselves is severe. You think they are together, but their hearts are diverse. That is because they are a people who do not reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:14] They, that is, the Jews, will not fight against you together, [all] in a [single] body, except in fortified towns or from behind some wall (jidār: a variant reading has [plural] judur, ‘walls’), some [kind of protective] fence. Their might, their belligerence, is great among themselves. You [would] suppose them to be all together, united as a [single] body, but their hearts are disunited, scattered, contrary to supposition. That is because they are a people who have no sense;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They) i.e. Banu Qurayzah and Banu'l-Nadir (will not fight against you in a body save in fortified villages or from behind walls) or if there is between you and them walls. (Their adversity among themselves is very great) He says: their fighting against each other is great, for they fought against their own folk and not against the Prophet (pbuh) and his Companions. (Ye think of them as a whole) united (whereas their hearts are diverse) whereas they differ a great deal. (That) differing and betrayal (is because they are a folk who have no sense) is because they do not understand Allah's command and divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تَحْسَبُهُمْ جَمِيعاً وَقُلُوبُهُمْ شَتَّىٰ } معناهُ مُتفرقةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: لا تبالوا أيها المؤمنون بودادة المنافقين مع اليهود، واتفاقهم معهم؛ إذ { لاَ يُقَاتِلُونَكُمْ جَمِيعاً } مجتمعين متفقين { إِلاَّ فِي قُرًى مُّحَصَّنَةٍ } محصورة، مسورة بالدروب والخنادق { أَوْ مِن وَرَآءِ جُدُرٍ } يستحصنون بها؛ وذلك من فرط رعبهم، وشدة رهبتهم من المؤمنين، وإلاَّ { بَأْسُهُمْ بَيْنَهُمْ شَدِيدٌ } أي: حين حارب بعضهم بعضاً، أو مع غير المؤمنين، قتالهم شديد وحرابهم عظيم، وإذا حاربوا مع المؤمنين { تَحْسَبُهُمْ جَمِيعاً } مجتمعين ظاهراً في بادئ النظر { وَ } لكن { قُلُوبُهُمْ شَتَّىٰ } متفرقة مختلفة حقيقةً؛ لافتراق عقائدهم، واختلاف مقاصدهم { ذَلِكَ } الافتراق والاختلاف { بِأَنَّهُمْ قَوْمٌ لاَّ يَعْقِلُونَ } [الحشر: 14] ولا يفهمون ما هو صلاحهم في الدارين، وفلاحهم في النشأتين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لا يُقاتلونكم } أي: اليهود والمنافقون، أي: لا يقدرون على قتالكم { جميعاً } مجتمعين متفقين في موطن من المواطن، { إلاّ في قُرىً محصنةٍ } ، بالدُّروب والخنادق، { أو مِن وراء جُدُر } دون أن يصحروا ويبارزوكم لفرط رهبتهم\n وقرأ المكي: \" جدار \" بالإفراد\n { بأسُهم بينهم شديدٌ } ، بيان لِما ذكر من أنَّ رهبتهم ليس لضعفهم وجُبنهم في أنفسهم، فإنّ بأسهم بالنسبة إلى أقرانهم شديد، وإنما ضعفُهم وجبنهُم بالنسبة إليكم، بما قذف الله تعالى في قلوبهم من الرعب\n { تَحْسَبُهم } أي: المنافقين واليهود { جميعاً } أي: مجتمعين ذوي أُلفة واتحاد، { وقلوبُهم شَتَّى } متفرقة لا أُلفة بينها\n\n\nقال ابن عطية: وهذه حالة الجماعة المتخاذلة\n هـ\n يعني: أنّ بينهم إحناً وعداوات، فلا يتعاضدون حقَّ التناصر ولا ينصرون أبداً\n قال القشيري: اجتماع النفوس مع تنافر القلوب أصلِ كل فساد، وموجب كل تخاذل، واتفاق القلوب، والاشتراك في الهمّة، والتساوي في القصد، يُوجب كلٍّ ظفرٍ وسعادة\n هـ\n وما وصف به الحق تعالى المنافقين واليهود كله تجسير للمؤمنين، وتشجيع لقلوبهم على قتالهم\n { ذلك } التفرُّق { بأنهم قوم لا يعقلون } شيئاً، حتى يعرفوا الحق ويتبعوه، وتطئمن به قلوبهم، وتتحد كلمتهم، ويَرمُوا عن قوس واحدة، لكن لّمَّا جهلوا الحق تشتتت طُرُقهم، وتشتتت القلوب حسب تشتُّت الطُرق، وأما ما قيل من أنّ المعنى: لا يعقلون أنّ تشتيت القلوب مما يُوهن قلوبهم، فبعيد\n الإشارة: إذا حاصر المريدُ قريةَ القلب ليُخرج منها الأوصاف المذمومة لتتهيأ لسكنى سلطان المعرفة، تقول الحظوظ والأهوية المنافقة للنفس، وأوصافها اليهودية: لا تخرجوا، فنحن نُعاونكم، وفي نصرتكم، لئن أُخرجتم لنخرجنَّ معكم، ولا نُطيع فيكم أحداً أبداً، وإن قوتلتم بالمجاهدة والرياضة لننصرنكم بالتخاذل والتثُّبط، والله يشهد أنهم لكاذبون إذ لا قدرة لشيء إلاّ بإذن الله\n { لئن أُخرجوا لا يخرجون معهم\n\n\n } الآية\n لا يقاتلونكم جميعاً، أي: لا يجتمع جند الهوى النفس على قتالكم، إلاّ في قلوب غافلة شديدة العلائق والمساوىء محصنة من دخول النور بأسوار الشواغل والعلائق أو: تُوَسْوِس من وراء جُدُر الإيمان وأما القلوب الفارغة من الشواغل المطهرة من المساوئ، فإنما يقاتلها البعض الباقي فيها\n بأسهم بينهم شديد، أي: الحرب بينهم سجال، إذا غلب جند النفس استولت ظلماتها على الروح، وإذا غلب جند القلب والروح استولى النورُ على ظلمة النفس، تحسبهم جميعاً وقلوبهم شتى، أي: تظنون أنَّ مهاوي الهوى ومهاوي النفس واحدة وقلوبهم شتى فالأهواء مختلفة، والحظوظ متفاوتة، والمساوىء متفرقة، فلكل شخص حظ، ولكل نفس هوى غير ما يشتهي الآخر، وذلك بأنهم قوم لا يعقلون، ولو عقلوا لاتفقت أهواؤهم في محبة الله ورسوله، قال صلى الله عليه وسلم:\n\n \" لا يؤمن أحدكم حتى يكون هواه تابعاً لما جئتُ به \"\n \n\nثم شبَّه بني النضير بقتلى أهل بدر، فقال: { كَمَثَلِ ٱلَّذِينَ مِن قَبْلِهِمْ قَرِيباً }\n\n",
      "translations": []
    }
  ]
}