{
  "chapter": "الحشر",
  "text": "لئن اخرجوا۟ لا يخرجون معهم ولئن قوتلوا۟ لا ينصرونهم ولئن نصروهم ليولن الادبر ثم لا ينصرون",
  "translations": [
    {
      "translation": "If they are driven out they will not leave with them. If they are fought against they will not help them. And if they did help them they would turn their backs, and then they would not be helped.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they are driven out, they will not go with them; and if they are attacked, they will not aid them. And even if they aided them, they will turn their backs, then they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To be sure, if they are banished, they will not go with them and if war is waged against them, they will not aid them; and even if they provide any aid to them, they will still turn their backs, and thereafter no aid will be forthcoming to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they were to be expelled, they would not go with them. If they were to be attacked they would not help them. Even if they were to help them, they would run away from the battle and leave them helpless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they are expelled, the hypocrites will not go out with them; and if they are fought against they will not help them; and even if they were to help them, they would turn their backs and flee; and then they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, if they (the Jews) are expelled, never will they (hypocrites) go out with them; and if they are attacked, they will never help them. And (even) if they do help them, they (hypocrites) will turn their backs, and they will not be victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly if these are driven forth, they will not go forth with them, and if they are fought against, they will not help them, and even if they help-them, they will certainly turn (their) backs, then they shall not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If those are expelled, they will not go forth with them, and if they are fought against, they will not help them. Even if they helped them, they would surely turn their backs, then they would not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(For) indeed if they are driven out they go not out with them, and indeed if they are attacked they help them not, and indeed if they had helped them they would have turned and fled, and then they would not have been victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they are driven out, they will not go with them, nor, if they are attacked, will they help them. Indeed, if they go to their help, they will turn their backs in flight, and then they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely if they are driven forth, they shall not; go forth with them, and surely if they are attacked, they shall succour them, not, and even ifs they succoured them they would turn their backs; and then they shall not be succoured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, if they were expelled they will not go out with them, and if they were fought against they will not help them, and [even if] they were to help them they will turn their backs [to flee] and eventually they will not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they are expelled, never will they go out with them; and if they are attacked (in fight), they will never help them; and if they do help them, they will turn their backs; so they will receive no help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, if they (the Jews) are expelled, never will they (hypocrites) go out with them, and if they are attacked, they will never help them. And if they do help them, they (hypocrites) will turn their backs, so they will not be victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they are expelled or fought against, they will not go with them, nor will they will help them. Indeed, if they helped them, they would turn their backs andthen they would not be helped.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they are evicted, they will not leave with them; and if anyone fights them, they will not support them; and if they go to their aid, they will turn their backs and flee; then they will receive no support.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they are expelled, they will not leave with them, and if they are fought, they will not aid them. And [even] if they should aid them, they will surely turn their backs; then [thereafter] they will not be aided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:12] [For] indeed if they are expelled, they would not go forth with them, and if they are fought against, they would not help them. And even if they were to help them, that is to say, even if they came to help them, they would surely turn their backs [to flee] (the implied response to the oath suffices in place of the response to the conditional, in all five instances) — then they, the Jews, would not be helped.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((For) indeed if they) i.e. the Banu Qurayzah (are driven out) from Medina (they) the hypocrites (go not out with them, and indeed if they are attacked) by the Prophet (pbuh) (they help not) against Muhammad (pbuh) (and indeed if they had helped them) against Muhammad (pbuh) (they would have turned and fled) in defeat, (and then they would not have been victorious) they will not escape what will befall them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nحيث قال سبحانه: { لَئِنْ أُخْرِجُواْ لاَ يَخْرُجُونَ مَعَهُمْ } ألبتة { وَلَئِن قُوتِلُواْ لاَ يَنصُرُونَهُمْ } جزماً، وقد وقع ذلك، فإن أُبي وأصحابه عهدوا مع بني النضير على هذا، ثمَّ أخلفوهم، وهم قد خرجوا من ديارهم، وهؤلاء لم يخرجوا { وَلَئِن نَّصَرُوهُمْ } بالفرض والتقدير، ويقاتلوا معكم أيها المؤمنون من جانب عدوكم، والله { لَيُوَلُّنَّ ٱلأَدْبَارَ } وقت كركم عليهم { ثُمَّ لاَ يُنصَرُونَ } [الحشر: 12] بعد ذلك؛ لشدة خوفكم ورعبكم في قلوبهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لئن أُخرجوا لا يخرجون معهم ولئن قُوتلوا لا ينصرونهم } ، وكان الأمر كذلك، فلم يقدر أحد أن يرفع رأسه لنصرتهم، ففيه معجزة واضحة، { ولئن نصروهم } على الفرض والتقدير، { ليُوَلُّنَّ الأدبارَ } فراراً { ثم لا يُنصرون } أبداً، إما المنافقون أو اليهود، أي: لا تكون لهم شوكة أبداً\n وإنما قال: { ولئن نصروهم } بعد الإخبار بأنهم لا ينصرونهم، أي: على الفرض والتقدير كقوله:\n\n[الزمر: 65]، والحق تعالى كما يعلم ما يكون، يعلم ما لا يكون أن لو كان كيف يكون",
      "translations": []
    }
  ]
}