{
  "chapter": "الحشر",
  "text": "كمثل الشيطن اذ قال للانسن اكفر فلما كفر قال انى برىء منك انى اخاف الله رب العلمين",
  "translations": [
    {
      "translation": "They are like Shaytan when he says to a human being, 'Be kafir,' and then when he becomes kafir, says, 'I wash my hands of you. Truly I fear Allah, the Lord of all the worlds.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They are) like Satan who says to man: \"Do not believe;\" and when he becomes a disbeliever, he says: \"I have nothing to do with you. I fear God, the Lord of all the worlds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their parable is that of Satan when he says to man: “Disbelieve,” but when he disbelieves, he says: “I am quit of you. Verily I fear Allah, the Lord of the Universe.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are like satan who said to people, \"Reject the faith,\" but when the people rejected the faith he said, \"I have nothing to do with you. I fear the Lord of the Universe\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The example of the devil – when he said to man “Disbelieve”; so when he has rejected faith, he says, “I am unconcerned with you – indeed I fear Allah, the Lord of The Creation.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like Shaytan, when he says to man: \"Disbelieve.\" But when he disbelieves, Shaytan says: \"I am free of you, I fear Allah, the Lord of all that exists!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like the Shaitan when he says to man: Disbelieve, but when he disbelieves, he says: I am surely clear of you; surely I fear Allah, the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like Satan, when he said to man, 'Disbelieve'; then, when he disbelieved, he said, 'Surely I am quit of you. Surely I fear God, the Lord of all Being.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And the hypocrites are) on the likeness of the devil when he telleth man to disbelieve, then, when he disbelieveth saith: Lo! I am quit of thee. Lo! I fear Allah, the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are like Satan, who says to man, \"Deny the truth!\" but when man denied the truth, said, \"I disown you; I fear God, the Lord of the Universe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are like the Satan, when he saith Unto man: 'disbelieve,' then, when he disbelieveth, saith: verily I am quit of thee, verily I fear Allah, the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The hypocrites are] like Satan when he tells man to disbelieve, but when he disbelieves, he says, ‘I am absolved of you. Indeed I fear Allah, the Lord of all the worlds.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Their allies deceived them), like the Evil One, when he says to man, \"Deny Allah\": but when (man) denies Allah, (the Evil One) says, \"I am free of thee: I do fear Allah, the Lord of the Worlds!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Their allies deceived them) like Shaitan (Satan), when he says to man: \"Disbelieve in Allah.\" But when (man) disbelieves in Allah, Shaitan (Satan) says: \"I am free of you, I fear Allah, the Lord of the 'Alamin (mankind, jinns and all that exists)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like satan when he said to the human, 'Disbelieve'; then as soon as he disbelieved, he said, 'Indeed, I am innocent of you, surely, I fear Allah, the Lord of all the Worlds'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like the devil, when he says to the human being, “Disbelieve.” But when he has disbelieved, he says, “I am innocent of you; I fear God, the Lord of the Worlds.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The hypocrites are] like the example of Satan when he says to man, \"Disbelieve.\" But when he disbelieves, he says, \"Indeed, I am disassociated from you. Indeed, I fear Allah, Lord of the worlds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:16] In addition, their likeness in heeding the [words of the] hypocrites and their forsaking of them is, like Satan when he says to man, ‘Disbelieve!’; so that when he [man] disbelieves, he says, ‘Lo! I am absolved of you. Indeed I fear God, the Lord of the Worlds’, out of mendacity and dissimulation on his part.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((And the hypocrites) with the Banu Qurayzah upon failing them ((are) on the likeness of the devil) with the 659 monk (when he telleth man) the monk Barsisa (to disbelieve) in Allah, (then, when he disbelieveth) he lets him down and (says: Lo! I am quit of thee) and of your religion. (Lo! I fear Allah, the Lord of the Worlds.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ كمثل الشيطان } أي: مثل إخوانهم المنافقين في إغوائهم كمثل الشيطان\n أي: الوهم الإنساني\n إذ زين للإنسان حال كونه على الفطرة اللذات الحسية والشهوات البدنية وحرّضه على مخالفة العقل بالهوى والاحتجاب بالطبيعة ليقع في الردى فلما احتجب بها عن الحق وانغمس في ظلمة النفس تبرأ منه بإدراك المعاني دونه\n والتقرّب إلى جناب الحق بالترقي إلى الأفق العقلي والاطلاع على بعض الصفات الإلهية واستشعار الخوف بإدراك آثار العظمة والقدرة وأنوار الربوبية { فكان عاقبتهما أنهما في النار } لكونهما جسمانيين ملازمين للطبيعة ونيرانها المتفننة وآلامها المتنوعة { وذلك جزاء الظالمين } الذين وضعوا العبادة غير موضعها فعبدوا صنم الهوى وطاغوت البدن\n واتخذوا آلهتهم أهواءهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبل مثلهم { كَمَثَلِ ٱلشَّيْطَانِ } أي: مثل المنافقين في إغراء اليهود على قتال المؤمنين كمثل الشيطان وقت { إِذْ قَالَ لِلإِنسَانِ } أي: كل فرد وفرد من أفراد الكفرة: { ٱكْفُرْ } حتى أعينك على عموم مقاصدك ومرامك { فَلَمَّا كَفَرَ } الإنسان - العياذ بالله - بتغريره { قَالَ } له الشيطان بعدما كفر: { إِنِّي بَرِيۤءٌ مِّنكَ } لا أعينك على شيء\n لأنك كفرت بالله\n وصرت عدواً لله { إِنِّيۤ أَخَافُ ٱللَّهَ } القادر القاهر الغيور أن ينتقم عني بسبب معاوتنك ومظاهرتك\n لكونه { رَبَّ ٱلْعَالَمِينَ } [الحشر: 16] فلا يجري التصرف في ملكه بلا إذن منه سبحانه\n\n\nوبعدما كفر الإنسان بتغرير الشيطان وتلبيسه { فَكَانَ عَاقِبَتَهُمَآ } أي: عاقبة الشيطان والإنسان الذي كفر بتغريره { أَنَّهُمَا فِي ٱلنَّارِ } تابعاً ومتبوعاً\n لا زماناً دون زمان\n بل واقعا { خَالِدِينَ فِيهَا } مستمرين أبداً { وَذَلِكَ } الخلود في النار { جَزَآءُ ٱلظَّالِمِينَ } [الحشر: 17] الخارجين عن ربقة الرقية الإلهية\n وعروة عبوديته بتلبيس الشيطان وتغريره\n\n\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم: التقوى عن محارم الله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:41",
      "similarity": 0.5656093574262583
    },
    {
      "verse": "98:7",
      "similarity": 0.5081890895498478
    },
    {
      "verse": "43:26",
      "similarity": 0.508136639205158
    },
    {
      "verse": "12:53",
      "similarity": 0.49722532509980666
    },
    {
      "verse": "26:216",
      "similarity": 0.4675469030877817
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/059016.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/059016.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/59:16.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}