{
  "chapter": "الحشر",
  "text": "الم تر الى الذين نافقوا۟ يقولون لاخونهم الذين كفروا۟ من اهل الكتب لئن اخرجتم لنخرجن معكم ولا نطيع فيكم احدا ابدا وان قوتلتم لننصرنكم والله يشهد انهم لكذبون",
  "translations": [
    {
      "translation": "Did you not see the hypocrites saying to their brothers, those among the People of the Book who are kafir, 'If you are driven out we will leave with you, we will never obey anyone to your detriment. And if you are fought against we will help you'? Allah bears witness that they are truly liars.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you never considered the hypocrites? They say to their brethren among the people of the Book who do not believe: \"If you are driven out we shall go with you, and will not listen to any one in what concerns you; and if there is war against you, we shall aid you.\" But God is witness they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see the hypocrites say to their brethren, the unbelievers among the People of the Book: “If you are banished we too will go with you and will not listen to anyone concerning you; and if war is waged against you, we will come to your aid.” But Allah bears witness that they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen the hypocrites who say to their disbelieving brothers among the People of the Book, \"If you are driven out, we shall, also, leave the town with you and we shall never obey whoever seeks to harm you. If you are attacked, we shall help you.\" God testifies that they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did you not see the hypocrites, that they say to their disbelieving brothers among the People given the Book(s), “If you are expelled, then we will definitely go out with you, and we will not listen to anyone in your matters, and if you are fought against we will surely help you”; and Allah testifies that they are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not observed the hypocrites who say to their disbelieving brethren among the People of the Scripture, \"If you are expelled, we indeed will go out with you, and we shall never obey anyone against you; and if you are attacked, we shall indeed help you.\" But Allah is Witness that they verily are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who have become hypocrites? They say to those of their brethren who disbelieve from among the followers of the Book: If you are driven forth, we shall certainly go forth with you, and we will never obey any one concerning you, and if you are fought against, we will certainly help you, and Allah bears witness that they are most surely liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not regarded the hypocrites, saying to their brothers of the People of the Book who disbelieve, 'If you are expelled, we will go forth with you, and we will never obey anyone in regard to you. If you are fought against, we will help you.' And God bears witness that they are truly liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not observed those who are hypocrites, (how) they tell their brethren who disbelieve among the People of the Scripture: If ye are driven out, we surely will go out with you, and we will never obey anyone against you, and if ye are attacked we verily will help you. And Allah beareth witness that they verily are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen those who act hypocritically? They say to their disbelieving companions from among the People of the Book, \"If you are driven out we shall surely go out with you, and we shall never listen to anyone against you, and if war is waged against you, we shall help you.\" God bears witness that they are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beholdest thou not: those who dissemble saying Unto their brethren who disbelieve among the people of the Book: if ye are driven forth we shall surely go forth with you, and we, shall not ever obey anyone in your respect, and if ye are attacked, we shall surely succour you. And Allah beareth witness that surely they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not regarded the hypocrites who say to their brethren, the faithless from among the People of the Book, ‘If you are expelled, we will surely go out with you, and we will never obey anyone against you, and if you are fought against we will surely help you,’ and Allah bears witness that they are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hast thou not observed the Hypocrites say to their misbelieving brethren among the People of the Book? - \"If ye are expelled, we too will go out with you, and we will never hearken to any one in your affair; and if ye are attacked (in fight) we will help you\". But Allah is witness that they are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you (O Muhammad SAW) not observed the hypocrites who say to their friends among the people of the Scripture who disbelieve: \"(By Allah) If you are expelled, we (too) indeed will go out with you, and we shall never obey any one against you, and if you are attacked (in fight), we shall indeed help you.\" But Allah is Witness, that they verily, are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not seen the hypocrites? They say to their brothers among the People of the Book who disbelieve, 'If they expel you, we will go with you. We willnever obey anyone against you. If they fight against you we will certainly help you' But Allah bears witness that they are, without doubt, liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered those who act hypocritically? They say to their brethren who disbelieved among the People of the Book, “If you are evicted, we will leave with you, and will not obey anyone against you; and should anyone fight you, we will certainly support you.” But God bears witness that they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not considered those who practice hypocrisy, saying to their brothers who have disbelieved among the People of the Scripture, \"If you are expelled, we will surely leave with you, and we will not obey, in regard to you, anyone - ever; and if you are fought, we will surely aid you.\" But Allah testifies that they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:11] Have you not considered, [have you not] seen, the hypocrites who say to their brethren who disbelieve from among the People of the Scripture, namely, the Banū al-Nadīr, their brethren in disbelief, ‘If (la-in: the lām is for oaths in all four instances) you are expelled, from Medina, we will assuredly go forth with you, and we will never obey anyone against you, to forsake you. And if you are fought against (wa-in qūtiltum: the prefatory lām [of la-in] has been omitted), we will certainly help you’. And God bears witness that they are truly liars.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Hast thou not observed) Muhammad (those who are hypocrites) those who are double-faced in their religion: these were a group of people from the Aws tribe who claimed to be believers in the open but were disbelievers in private, ((how) they tell) in private (their brethren who disbelieve among the People of the Scripture) i.e. Banu Qurayzah; they said to them when they were surrounded by the Prophet (pbuh) \"Remain firm in your faith inside your strongholds\": (If ye are driven out) from Medina as were driven out the Banu'l-Nadir, (we surely will go out with you, and we will never obey anyone against you) and we will not help anyone in Medina against you, (and if ye are attacked) by the Prophet (pbuh) and his Companions (we verily will help you) against them. (And Allah beareth witness) and Allah knows (that they) i.e. the hypocrites (verily are liars) they lie in what they say.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على سبيل التوبيخ والتقريع: { أَلَمْ تَرَ } أيها الرائي { إِلَى ٱلَّذِينَ نَافَقُواْ } مع المؤمنين حيث { يَقُولُونَ } في خلواتهم { لإِخْوَانِهِمُ ٱلَّذِينَ كَفَرُواْ مِنْ أَهْلِ ٱلْكِتَابِ } وكان بينهم صداقة الشرك وأخوة الكفر\n وموالاة البغض مع المؤمنين: لا تصالحوا مع هؤلاء المدعين\n يعنون: المؤمنين\n وإنَّا معكم\n والله { لَئِنْ أُخْرِجْتُمْ } من دياركم عنوةً { لَنَخْرُجَنَّ مَعَكُمْ } ألبتة { وَلاَ نُطِيعُ } ونتبع { فيكُمْ } أي: في قتالكم وحرابكم { أَحَداً أَبَداً } من هؤلاء الأعادي { وَإِن قُوتِلْتُمْ لَنَنصُرَنَّكُمْ } ونعاوننكم ألبتة بلا تخلف منَّا { وَٱللَّهُ } المطلع على عموم أفعالهم ونياتهم فيها { يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ } [الحشر: 11] في قولهم وعهدهم هذا مع إخوانهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ألم تَرَ إلى الذين نافقوا } أي: ألم ترَ يا محمد\n أو: يا مَن يسمع\n إلى عبد الله بن أُبيّ وأشياعه؟ حكاية لما جرى بين الكفرة والمنافقين\n من الأقوال الكاذبة والأحوال الفاسدة\n بعد حكاية محاسن أقوال المؤمنين\n وأحوالهم الحميدة\n على اختلاف طبقاتهم\n وقوله تعالى: { يقولون } استئناف لبيان المتعجب منه\n وصيغة المضارع للدلالة على استمرار قولهم\n أو: لاستحضار صورته\n واللام في قوله: { لإِخوانهم الذين كفروا من أهل الكتاب } للتبليغ\n والمراد بالأخوة: أخوة الكفر\n واللام في قوله: { لئن أُخرجتم } موطئة للقسم\n و { لنَخْرُجَنَّ } جوابه\n أي: والله لئن أُخرجتم من دياركم { لنَخْرُجَنَّ معكم } \n رُوي أن ابن أُبي وأصحابه دسُّوا إلى بني النضير\n حين حاصرهم النبي صلى الله عليه وسلم: لا تخرجوا من الحصن\n فإن قاتلوكم فنحن معكم\n لا نخذلكم\n ولئن أُخرجتم لنخرُجن معكم\n { ولا نُطيعُ فيكم } في قتالكم { أحداً أبداً } \n يعني رسول الله والمسلمين\n أو: لا نُطيع في خذلانكم وإخلاف ما وعدناكم من النصرة أحداً\n وإن طال الزمان\n { وإن قُوتلتم لننصرنكم } \n قال تعالى في تكذيبهم: { واللهُ يشهد إنهم لكاذبون } في مواعدهم المؤكدة بأيمانهم الفاجرة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:65",
      "similarity": 0.39457245843103605
    },
    {
      "verse": "9:22",
      "similarity": 0.3292393537165124
    },
    {
      "verse": "59:12",
      "similarity": 0.3204508229035756
    },
    {
      "verse": "9:83",
      "similarity": 0.31354107515659235
    },
    {
      "verse": "24:17",
      "similarity": 0.2837577430517162
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/059011.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/059011.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/59:11.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}