{
  "chapter": "الحشر",
  "text": "كمثل الذين من قبلهم قريبا ذاقوا۟ وبال امرهم ولهم عذاب اليم",
  "translations": [
    {
      "translation": "They are the same as those a short time before them who tasted the evil consequences of what they did. They will have a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like those who had tasted the gravity of their actions a little before them. There is a grievous punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are like those who tasted the evil consequences of their deeds a short while before. A grievous chastisement awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are like those who, a short time before, suffered the consequences of their deeds. They, too, will suffer a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like the example of those who were before them not long ago – they tasted the evil result of their deeds; and for them is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are like their immediate predecessors; they tasted the evil result of their conduct, and for them a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like those before them shortly; they tasted the evil result of their affair, and they shall have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like those who a short time before them tasted the mischief of their action; there awaits them a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the likeness of those (who suffered) a short time before them, they taste the ill-effects of their own conduct, and theirs is painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like those who went just before them, they have tasted the evil consequences of their doings. And they shall have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are like those a little before them; they tasted the ill-effect of their affair, and theirs shall be a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "just like those who tasted the evil consequence of their conduct recently before them, and there is a painful punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like those who lately preceded them, they have tasted the evil result of their conduct; and (in the Hereafter there is) for them a grievous Penalty;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are like their immediate predecessors (the Jews of Bani Qainuqa', who suffered), they tasted the evil result of their conduct, and (in the Hereafter, there is) for them a painful torment;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Just as those who, not long before, tasted the mischief of their actions, there awaits for them a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Like those shortly before them. They experienced the consequences of their decisions. For them is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Theirs is] like the example of those shortly before them: they tasted the bad consequence of their affair, and they will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:15] their likeness in relinquishing faith is, as the likeness of those who, recently before them, a short time before — these being the idolaters from among those [who fought] at Badr — tasted the evil consequences of their   conduct, the punishment for it in this world, by being killed or otherwise. And for them there will be a painful chastisement, in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the likeness of those (who suffered) a short time before them) He says: the similitude of Banu Qurayzah with regard to breaking covenants and the punishment inflicted upon them as a result is like that of the Banu'l-Nadir two years before them, (they taste the ill-effects of their conduct) they, i.e. Banu'l-Nadir, taste the punishment of breaking their covenant, (and theirs is painful punishment) in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كَمَثَلِ ٱلَّذِينَ } أي: مثلهم كمثل اليهود الذين مضوا { مِن قَبْلِهِمْ قَرِيباً } بزمانهم { ذَاقُواْ وَبَالَ أَمْرِهِمْ } في الدنيا من أنواع الهوان والخسار { وَلَهُمْ عَذَابٌ أَلِيمٌ } [الحشر: 15] في الآخرة التي هي دار البوار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: مَثَلهم، أي: مثل اليهود في حلول البأس بهم { كَمَثَلِ الذين مِن قبلهم } وهم أهل بدر { قريبًا } أي: استقر مِن قبلهم زمنًا قريبًا، فكانت غزوة بني النضير على رأس ستة أشهر من بدر، كما صدر به البخاري عن الزهري\n ثم قال: وجعله ابن إسحاق بعد بئر معونة وأُحد\n هـ\n قلت: وهو الموافق لِما تقدم في صدر السورة، وهو المشهور، { ذاقوا وبالَ أمرِهم } أي: ذاقوا سوء عاقبة أمرهم وعداوتهم لرسول الله صلى الله عليه وسلم وهو القتل في الدنيا، { ولهم } مع ذلك في الآخرة { عذابٌ أليمٌ }\n ومَثَل المنافقين { كَمَثَلِ الشيطانِ إِذ قال للإِنسان اكْفُرْ فلما كفر قال إِني بريء منك إِني أخاف اللهَ ربَّ العالمين } أي: مثل المنافقين في أغوائهم اليهود على القتال، ووعدهم إياهم النصر، ثم مشاركتهم لهم وخذلانهم كمثل الشيطان إذ استغوى الإنسان بكيده، ثم تبرّأ منه في العاقبة\n وقيل: المراد: استغواؤه قريشًا يوم بدر، وقوله:\n\n[الأنفال: 48] إلى قوله:\n",
      "translations": []
    }
  ]
}