{
  "chapter": "الحشر",
  "text": "يايها الذين ءامنوا۟ اتقوا۟ الله ولتنظر نفس ما قدمت لغد واتقوا۟ الله ان الله خبيرۢ بما تعملون",
  "translations": [
    {
      "translation": "You who have iman! have taawa of Allah and let each self look to what it has sent forward for Tomorrow. Have taqwa of Allah. Allah is aware of what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, be fearful of God. Let each soul consider what it has sent (of good deeds) in advance for the morrow, and fear God. Surely God is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, fear Allah and let every person look to what he sends forward for the morrow. Fear Allah; Allah is well aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, have fear of God. A soul must see what it has done for the future. Have fear of God for He is All-aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Fear Allah, and every soul must see what it has sent ahead for tomorrow; and fear Allah; indeed Allah is Aware of your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Have Taqwa of Allah and let every person look to what he has sent forth for tomorrow, and fear Allah. Verily, Allah is All-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! be careful of (your duty to) Allah, and let every soul consider what it has sent on for the morrow, and be careful of (your duty to) Allah; surely Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, fear God. Let every soul consider what it has forwarded for the morrow. And fear God; God is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Observe your duty to Allah. And let every soul look to that which it sendeth on before for the morrow. And observe your duty to Allah. Lo! Allah is Informed of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Fear God, and let every soul look to what it lays up for the future. Fear God: God is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! fear Allah, and let every soul look to that which it sendeth forward for the morrow. And fear Allah; veril Allah is Aware of that which ye work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Be wary of Allah, and let every soul consider what it sends ahead for Tomorrow, and be wary of Allah. Allah is indeed well aware of what you do\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Fear Allah, and let every soul look to what (provision) He has sent forth for the morrow. Yea, fear Allah: for Allah is well-acquainted with (all) that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Fear Allah and keep your duty to Him. And let every person look to what he has sent forth for the morrow, and fear Allah. Verily, Allah is All-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, fear Allah. Let every soul look to what it has forwarded for the future, and fear Allah, for Allah is Aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Fear God, and let every soul consider what it has forwarded for the morrow, and fear God. God is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, fear Allah. And let every soul look to what it has put forth for tomorrow - and fear Allah. Indeed, Allah is Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:18] O you who believe, fear God and let every soul consider what it has sent ahead for tomorrow, for the Day of Resurrection. And fear God. God is indeed Aware of what you do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا أَيُّهَا الَّذِينَ آَمَنُوا اتَّقُوا اللَّهَ وَلْتَنْظُرْ نَفْسٌ مَا قَدَّمَتْ لِغَدٍ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ (18)انتقال من الامتنان على المسلمين بما يسرّ الله من فتح قرية بني النضير بدون قتال ، وما أفاء الله على رسوله صلى الله عليه وسلم منهم ، ووصف ما جرى من خيبتهم وخيبة أملهم في نصرة المنافقين ، ومن الإِيذان بأن عاقبة أهل القرى الباقية كعاقبة أسلافهم . وكذلك موقف أنصارهم معهم ، إلى الأمر بتقوى الله شكراً له على ما منح وما وعد من صادق الوعد فإن الشكر جزاء العبد عن نعمة ربه إذ لا يستطيع جزاء غير ذلك فأقبل على خطاب الذين آمنوا بالأمر بتقوى الله .ولما كان ما تضمنته السورة من تأييد الله إياهم وفَيض نعمه عليهم كان من منافع الدنيا ، أعقبه بتذكيرهم بالإِعداد للآخرة بقوله : { ولتنظر نفس ما قدمت لغدٍ } أي لتتأمل كل نفس فيما قدمته للآخرة .وجملة { ولتنظر نفس ما قدمت لغدٍ } ، عطف أمر على أمر آخر . وهي معترضة بين جملة { اتقوا الله } وجملة { إن الله خبير بما تعملون } . وذِكر { نفس } إظهار في مقام الإِضمار لأن مقتضى الظاهر : وانظروا ما قدمتم ، فعُدل عن الإِظهار لقصد العموم أي لتنظروا وتنظر كل نفس .وتنكير { نفس } يفيد العموم في سياق الأمر ، أي لتنظر كل نفس ، فإن الأمر والدعاء ونحوهما كالشرط تكون النكرة في سياقها مثل ما هي في سياق النفي كقوله تعالى { وإن أحد من المشركين استجارك فأجره } \\[ التوبة : 6 \\] وكقول الحريري :يا أهلَ ذا المَغْنَى وُقيتم ضُرّا ... ( أي كل ضر ) .وإنما لم يعرَّف بلام التعريف تنصيصاً على العموم لئلا يتوهم نفسٌ معهودةوأطلق «غد» على الزمن المستقبل مجازاً لتقريب الزمن المستقبل من البعيد لملازمة اقتراب الزمن لمفهوم الغَد ، لأن الغد هو اليوم الموالي لليوم الذي فيه المتكلم فهو أقرب أزمنة المستقبل كما قال قرّاد بن أجدع :فإن يَكُ صدْرُ هذا اليوم ولّى ... فإن غداً لناظره قريبوهذا المجاز شائع في كلام العرب في لفظ ( غد ) وأخواته قال زهير :وأعْلَمُ عِلْم اليوممِ والأمسسِ قبلَه ... ولكنني عن علم ما في غدٍ عَمِيريد باليوم الزمن الحاضر ، وبالأمس الزمن الماضي ، وبالغد الزمن المستقبل .وتنكير «غد» للتعظيم والتهويل ، أي لغدٍ لا يعرف كنهه .واللام في قوله : { لغدٍ } لام العلة ، أي ما قدمتْه لأجل يوم القيامة ، أي لأجل الانتفاع به .والتقديم : مستعار للعمل الذي يُعمل لتحصيل فائدته في زمن آت شبه قصد الانتفاع به في المستقبل بتقديم من يَحلّ في المنزل قبل ورود السائرين إليه من جيش أو سَفر ليهيّء لهم ما يصلح أمرهم ، ومنه مقدمة الجيش وتقديم الرائد قبل القافلة . قال تعالى : { وما تقدموا لأنفسكم من خير تجدوه عند الله } \\[ البقرة : 110 \\] ويقال في ضده : أَخَّر ، إذا ترك عمل شيء قال تعالى : { علمت نفس ما قدمت وأخرت }\\[ الأنفطار : 5 \\] .وإعادة { واتقوا الله } ليبنَى عليه { إن الله خبير بما تعملون } فيحصل الربط بين التعليل والمعلل إذ وقع بينهما فصل { ولتنظر نفس ما قدمت لغدٍ } . وإنما أعيد بطريق العطف لزيادة التأكيد فإن التوكيد اللفظي يؤتى به تارة معطوفاً كقوله تعالى : { أولى لك فأولى ثم أولى لك فأولى } \\[ القيامة : 34 ، 35 \\] وقوله : { كلا سوف تعلمون ثم كلا سوف تعلمون } \\[ التكاثر : 3 4 \\] . وقول عدي بن زيد : «وألفَى قولها كذباً ومَيناً» .وذلك أن في العطف إيهام أن يكون التوكيد يجعل كالتأسيس لزيادة الاهتمام بالمؤكد .فجملة { إن الله خبير بما تعملون } تعليل للحث على تقوى الله وموقع { إنَّ } فيها موقع التعليل .ويجوز أن يكون { اتقوا الله } المذكور أولاً مراداً به التقوى بمعنى الخوف من الله وهي الباعثة على العمل ولذلك أردف بقوله : { ولتنظر نفس ما قدمت لغدٍ } ويكون { اتقوا الله } المذكور ثانياً مراداً به الدوام على التقوى الأولى ، أي ودوموا على التقوى على حد قوله تعالى : { يا أيها الذين آمنوا آمنوا بالله ورسوله } \\[ النساء : 136 \\] ولذلك أردف بقوله : { إن الله خبير بما تعملون } أي بمقدار اجتهادكم في التقوى ، وأردف بقوله : { ولا تكونوا كالذين نسوا الله فأنساهم أنفسهم } \\[ الحشر : 19 \\] أي أهملوا التقوى بعد أن تقلّدوها كما سيأتي أنهم المنافقون فإنهم تقلّدوا الإِسلام وأضاعوه قال تعالى : { نسوا الله فنسيهم إن المنافقين هم الفاسقون } \\[ التوبة : 67 \\] . وفي قوله : { إن الله خبير بما تعملون } إظهار اسم الجلالة في مقام الإِضمار ، فتكون الجملة مستقلة بدلالتها أتمّ استقلال فتجري مجرى الأمثال ولتربية المهابة في نفس المخاطبين .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe) in Muhammad, Allah bless him and the Qur'an! (Observe your duty to Allah) fear Allah. (And let every soul) whether it is righteous or sinful (look to that which it sendeth on before for the morrow) to what it achieved for the Day of Judgement, for it will only find on the Day of Judgement that which it has performed in the life of the world; if it is good, it is good, and if it is evil, it is evil. (And observe your duty to Allah) and fear Allah! (Lo! Allah is informed of what ye do) of good and evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { يا أيها الذين آمنوا } الإيمان الغيبي التقليدي { اتّقوا الله } في اجتناب المعاصي والسيئات والرذائل واكتساب الحسنات والطاعات والفضائل { ولتنظر نفس ما قدّمت لغد } لما بعد الموت من الصالحات { واتقوا الله } في الاحتجاب بالأعراض والأغراض وتوسيط الحق للمشتهيات { إن الله خبير } بأعمالكم ونيّاتكم فيجازيكم بحسبها\n كما قال عليه السلام:\n \" لكل امرىء ما نوى \" \nأو آمنوا الإيمان التحقيقي واتّقوا الله في الاحتجاب عنه بأفعالكم وصفاتكم { ولتنظر نفس ما قدّمت لغد } من محقرات الأعمال والصفات\n فإنها حجب حاجزة ووسائل مردودة مذمومة\n واتّقوا الله في البقيات والتلوينات فإن الله خبير بما تعملون بنفوسكم وما تعملون به لا بنفوسكم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والاجتناب عن منهياته { ٱتَّقُواْ ٱللَّهَ } واحذروا عن بطشه وانتقامه { وَلْتَنظُرْ نَفْسٌ } أي: كل واحد من النفوس المجبولة على نظرة الدارية والشعور على وجه العبرة والاستبصار { مَّا قَدَّمَتْ لِغَدٍ } وما ادخرت ليوم القيامة\n وتزودت للنشأة الأخرى بعدما كلفت بأنواع التكاليف\n وأُمرت لإعداد زاد المعاد على وجه المبالغة\n وكمال الإرشاد { وَ } بالجملة: { ٱتَّقُواْ ٱللَّهَ } المنتقم الغيور\n واحذروا عن مخالفة أمره { إِنَّ ٱللَّهَ } المطلع على ما في ضمائر عباده { خَبِيرٌ بِمَا تَعْمَلُونَ } [الحشر: 18] من خير وشر\n ونفع وضر\n يجازيكم على مقتضى خبرته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا اتقوا الله } في كل ما تأتون وتذرون\n { ولتنظرْ نَفْس ما قَدَّمَتْ لِغَدٍ } أي: أيّ شيء قدمت من الأعمال الصالحة ليوم القيامة\n سمّاه باليوم الذي يلي يومك تقريبًا له\n أو عبّر عن الآخرة بالغد\n كأنّ الدنيا والآخرة نهاران يوم وغد\n وتنكيره لتفخيمه وتهويله\n كأنه قيل: لغد لا يعرف كنهه لغاية عِظمه\n وعن مالك بن دينار: مكتوب على باب الجنة: وجدنا ما عملنا\n ربحنا ما قدّمنا\n خسرنا ما خلفنا\n { واتقوا اللهَ } \n كرر تأكيدًا للأمر بالتقوى\n أو الأول في أداء الواجبات\n كما يشعر به ما بعده من الأمر بالعمل\n وهذا في ترك المعاصي\n كما يؤذن به الوعيد في قوله: { إِنَّ الله خبير بما تعملون } أي: من المعاصي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:23",
      "similarity": 0.5850428440408355
    },
    {
      "verse": "3:121",
      "similarity": 0.39615908065695465
    },
    {
      "verse": "49:1",
      "similarity": 0.3689597024451879
    },
    {
      "verse": "40:46",
      "similarity": 0.3474771123834009
    },
    {
      "verse": "24:36",
      "similarity": 0.3352696540418884
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/059018.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/059018.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/59:18.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}