{
  "chapter": "الحشر",
  "text": "ولا تكونوا۟ كالذين نسوا۟ الله فانسىهم انفسهم او۟لئك هم الفسقون",
  "translations": [
    {
      "translation": "Do not be like those who forgot Allah so He made them forget themselves. Such people are the deviators.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like those who have forgotten God, so that God has made them forget themselves. Such are the reprobates.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like those who forgot Allah and so He made them oblivious of themselves. They are the wicked ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be like those who forget about God. He will make them forget themselves. These are the sinful people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be like those who forgot Allah – He therefore put them into hardship making them forget themselves; it is they who are the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like those who forgot Allah, and He caused them to forget themselves. Those are the rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like those who forsook Allah, so He made them forsake their own souls: these it is that are the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be not as those who forgot God, and so He caused them to forget their souls; those -- they are the ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not ye as those who forgot Allah, therefor He caused them to forget their souls. Such are the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be like those who forgot God, so that He caused them to forget their own souls [their own true interests]. It is they who are the rebellious ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not as those who forgot Allah, wherefore He caused them to forget their own souls. Those! they are the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be like those who forget Allah, so He makes them forget their own souls. It is they who are the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be ye not like those who forgot Allah; and He made them forget their own souls! Such are the rebellious transgressors!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like those who forgot Allah (i.e. became disobedient to Allah) and He caused them to forget their ownselves, (let them to forget to do righteous deeds). Those are the Fasiqun (rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not be like those who have forgotten Allah so that He has caused them to forget their souls. Those, they are the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not be like those who forgot God, so He made them forget themselves. These are the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be not like those who forgot Allah, so He made them forget themselves. Those are the defiantly disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:19] And do not be like those who forget God, [those who] neglect obedience to Him, so that He makes them forget their own souls, [to forget] to send ahead good deeds for its sake. Those — they are the immoral.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And be not ye) believers, with regard to sinning, (as those who forgot Allah) as those who shunned the obedience of Allah openly and in private, i.e. the Jews, (therefore He caused them to forget their souls) therefore Allah forsook them such that they left His obedience altogether. (Such are the evil-doers) such are the disbelievers in Allah in private, i.e. the hypocrites; and if it is taken to mean the Jews, this means: such are the disbelievers in Allah openly and in private.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تَكُونُواْ كَٱلَّذِينَ نَسُواْ ٱللَّهَ } يعني تَركوا طَاعتَهُ\n\n",
      "translations": [
        {
          "translation": " And do not be like those who forget Allah, meaning they abandoned His obedience",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { لاَ تَكُونُواْ } أيها المؤمنون { كَٱلَّذِينَ } أي: كالغافلين الذين { نَسُواْ ٱللَّهَ } أي: ذكره المستلزم للإيمان\n المستلزم للمحبة والعرفان { فَأَنسَاهُمْ } سبحانه { أَنفُسَهُمْ } أي: معرفتها المستلزمة لمعرفة الحق\n وبالجملة: { أُولَـٰئِكَ } البعداء عن ساحة عز الحضور { هُمُ ٱلْفَاسِقُونَ } [الحشر: 19] المقصورون على الخروج عن مقتضى الحدود الإلهية ولوازم العبودية\n الجاهلون بقدر الألوهية مطلقاً\n\n\nواعلموا أيها المكلفون أنه { لاَ يَسْتَوِيۤ أَصْحَابُ ٱلنَّارِ } منكم وملازموها\n وهم الذين اقترفوا طول عمرهم من سيئات الأعمال",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:126",
      "similarity": 0.6684976974713724
    },
    {
      "verse": "20:52",
      "similarity": 0.5358466146038761
    },
    {
      "verse": "87:6",
      "similarity": 0.5264526574021579
    },
    {
      "verse": "7:165",
      "similarity": 0.525942673016611
    },
    {
      "verse": "32:18",
      "similarity": 0.49293706883723337
    }
  ]
}