{
  "chapter": "الحشر",
  "text": "لانتم اشد رهبة فى صدورهم من الله ذلك بانهم قوم لا يفقهون",
  "translations": [
    {
      "translation": "Surely they have greater fear of you in their hearts than of God, because they do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely they have greater dread for you in their hearts than for Allah. That is because they are a people who are devoid of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are more afraid of you than of God. They are a people who lack understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in their hearts is a greater fear of you than that of Allah; this is because they are a people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, you are more fearful in their breasts than Allah. That is because they are a people who comprehend not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are certainly greater in being feared in their hearts than Allah; that is because they are a people who do not understand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, you arouse greater fear in their hearts than God; that is because they are a people who understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ye are more awful as a fear in their bosoms than Allah. That is because they are a folk who understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are more in dread of you than of God, because they are people devoid of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely ye are more awful in their breasts than Allah. That is because they are a people who understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed they have a greater awe of you in their hearts than of Allah. That is because they are a lot who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of a truth ye are stronger (than they) because of the terror in their hearts, (sent) by Allah. This is because they are men devoid of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, you (believers in the Oneness of Allah - Islamic Monotheism) are more awful as a fear in their (Jews of Bani An-Nadir) breasts than Allah. That is because they are a people who comprehend not (the Majesty and Power of Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their fear of you in their hearts is greater than their fear of Allah; that is because they are a people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Fear of you is more intense in their hearts than fear of God. That is because they are a people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You [believers] are more fearful within their breasts than Allah. That is because they are a people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:13] You indeed arouse greater awe, fear, in their hearts, that is, [the hearts of] the hypocrites, than God — [but only] because He has deferred His chastisement [to the Hereafter]. That is because they are a people who do not comprehend.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then said to the believers: (Ye are more awful as a fear in their bosoms than Allah) He says: the fear of the Jews and hypocrites of the swords of Muhammad (pbuh) and his Companions is greater than their fear of Allah. (That) fear (is because they are a folk who understand not) the command of Allah or Allah's divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لأَنتُمْ أَشَدُّ رَهْبَةً } معناه خَوفٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { لأَنتُمْ } أيها المؤمنون { أَشَدُّ رَهْبَةً } مرهوبية ومرعوبية راسخة { فِي صُدُورِهِمْ } متمكنة في نفوسهم من قبلكم، والحال أن تلك الرهبة الشديدة الحاصلة منكم إياهم ناشئة { مِّنَ ٱللَّهِ } إذ هو سبحانه قذفها في صدورهم من جانبكم، وأقدركم عليها { ذَلِكَ } أي: عدم تفطنهم بمنشئها { بِأَنَّهُمْ قَوْمٌ لاَّ يَفْقَهُونَ } [الحشر: 13] ولا يعلمون عظمة الله، وحق قدره حتى يخشوا منه حق خشيته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لأنتم أشدُّ رهبةً } أي: أشد مرهوبية، مصدر: رُهِبَ، المبني للمفعول، أي: أنتم أشد خوفاً { في صُدورهم من الله } دلالة على نفاقهم، يعني: إنهم يُظهرون لكم في العلانية خوفَ الله، وأنتم أهيب في صدورهم من الله، { ذلك } أي: ما ذكر من كون رهبتهم منكم أشد من رهبة الله { بأنهم قوم لا يفقهون } شيئاً حتى يعلموا عظمة الله تعالى، فيخشوه حق خشيته",
      "translations": []
    }
  ]
}