{
  "chapter": "الحشر",
  "text": "فكان عقبتهما انهما فى النار خلدين فيها وذلك جزؤا۟ الظلمين",
  "translations": [
    {
      "translation": "The final fate of both of them is that they will be timelessly, for ever in the Fire. That is the repayment of the wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Both of them will end up in Hell, where they will abide for ever. This is the punishment for the wicked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the end both will be in the Fire, and will abide in it. That is the recompense of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fate of both of them will be hell fire wherein they will live forever. Thus will be the recompense for the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the fate of them both is that they are both in the fire, to remain in it forever; and this is the proper punishment for the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, the end of both will be that they will be in the Fire, abiding therein. Such is the recompense of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore the end of both of them is that they are both in the fire to abide therein, and that is the reward of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their end is, both are in the Fire, there dwelling forever; that is the recompense of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the consequence for both will be that they are in the Fire, therein abiding. Such is the reward of evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus, in the end, both will find themselves in the Fire, therein to abide: that is the reward of evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore the end of the twain will be that they will be in the Fire, as abiders there in; that is the meed of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the fate of both is that they will be in the Fire, to remain in it [forever]. Such is the requital of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The end of both will be that they will go into the Fire, dwelling therein for ever. Such is the reward of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the end of both will be that they will be in the Fire, abiding therein. Such is the recompense of the Zalimun (i.e. polytheists, wrong-doers, disbelievers in Allah and in His Oneness, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their end shall be that they live for ever in the Fire. That is the recompense of the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ultimate end for both of them is the Fire, where they will dwell forever. Such is the requital for the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the outcome for both of them is that they will be in the Fire, abiding eternally therein. And that is the recompense of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:17] So the sequel for both will be, that is, [the sequel for both] the one who leads astray and the one led astray (a variant reading for [‘āqibatahumā] has the nominative ‘āqibatuhumā, as the subject of kāna, ‘will be’), that they are in the Fire, therein abiding. And that is the requital of the evildoers, that is, the disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And the consequence for both) the devil and the monk (will be that they are in the Fire, therein abiding. Such) eternity in hell (is the reward of evil-doers) is the punishment of the disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما كفر الإنسان بتغرير الشيطان وتلبيسه { فَكَانَ عَاقِبَتَهُمَآ } أي: عاقبة الشيطان والإنسان الذي كفر بتغريره { أَنَّهُمَا فِي ٱلنَّارِ } تابعاً ومتبوعاً، لا زماناً دون زمان، بل واقعا { خَالِدِينَ فِيهَا } مستمرين أبداً { وَذَلِكَ } الخلود في النار { جَزَآءُ ٱلظَّالِمِينَ } [الحشر: 17] الخارجين عن ربقة الرقية الإلهية، وعروة عبوديته بتلبيس الشيطان وتغريره\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}