{
  "chapter": "الحشر",
  "text": "هو الذى اخرج الذين كفروا۟ من اهل الكتب من ديرهم لاول الحشر ما ظننتم ان يخرجوا۟ وظنوا۟ انهم مانعتهم حصونهم من الله فاتىهم الله من حيث لم يحتسبوا۟ وقذف فى قلوبهم الرعب يخربون بيوتهم بايديهم وايدى المؤمنين فاعتبروا۟ ياو۟لى الابصر",
  "translations": [
    {
      "translation": "It is He who expelled those who were kafir among the People of the Book from their homes to the first gathering-place.* You did not think that they would leave and they thought that their fortresses would protect them from Allah. Then Allah came upon them from where they least expected it and cast terror into their hearts. Their houses were pulled down by their own hands and by the hands of the muminun. People of insight, take note!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who drove those among the people of the Book who refused to believe, from their homes for the first confrontation. You did not think that they would go away, and they imagined that their forts would protect them against God. But God came upon them from where they did not suspect, and filled their hearts with terror, so that they destroyed their homes with their own hands (or were destroyed) by the hands of believers. So take heed, O men of sight!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who in the first assault drove forth the People of the Book that disbelieved from their homes at the first gathering of forces. You did not believe that they would leave; while they too thought that their fortresses would defend them against Allah. Then Allah came upon them from whence they did not even imagine, casting such terror into their hearts that they destroyed their homes by their own hands and their destruction was also caused by the hands of the believers. So learn a lesson from this, O you who have perceptive eyes!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who drove the disbelievers among the followers of the Bible out of their homes (in the Arabian Peninsula) as the first time exiles. You did not think that they would leave their homes and they thought that their fortresses would save them from God. The decree of God came upon them in a way that even they did not expect. He caused such terror to enter their hearts that they started to destroy their own homes by their own hands and by those of the believers. People of vision, learn from this a lesson.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who expelled the disbelievers among the People given the Book(s) from their homes, for their first gathering; you did not expect them to leave, whereas they assumed that their fortresses would save them from Allah, so Allah’s command came to them from a place they had not imagined; and He instilled awe in their hearts, so they ruin their own houses by their own hands and at the hands of the Muslims; therefore learn a lesson, O those who can perceive!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who drove out the disbelievers among the People of the Scripture from their homes at the first gathering. You did not think that they would get out. And they thought that their fortresses would defend them from Allah! But Allah reached them from a place whereof they expected it not, and He cast terror into their hearts so that they demolished their own dwellings with their own hands and the hands of the believers. Then take admonition, O you with eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who caused those who disbelieved of the followers of the Book to go forth from their homes at the first banishment you did not think that they would go forth, while they were certain that their fortresses would defend them against Allah; but Allah came to them whence they did not expect, and cast terror into their hearts; they demolished their houses with their own hands and the hands of the believers; therefore take a lesson, O you who have eyes!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who expelled from their habitations the unbelievers among the People of the Book at the first mustering. You did not think that they would go forth, and they thought that their fortresses would defend them against God; then God came upon them from whence they had not reckoned, and He cast terror into their hearts as they destroyed their houses with their own hands, and the hands of the believers; therefore take heed, you who have eyes!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who hath caused those of the People of the Scripture who disbelieved to go forth from their homes unto the first exile. Ye deemed not that they would go forth, while they deemed that their strongholds would protect them from Allah. But Allah reached them from a place whereof they recked not, and cast terror in their hearts so that they ruined their houses with their own hands and the hands of the believers. So learn a lesson, O ye who have eyes!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was He who turned those People of the Book who denied the truth out of their homes in the first banishment. You never thought they would go, and they thought their strongholds would protect them against God. But God came upon them from where they least expected and cast such terror into their hearts that their houses were pulled down by their own hands as well as by the hands of the believers. Learn a lesson, then, you who are endowed with insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is that drave forth those of the people of the Book who disbelieved from their homes at the first gathering, Ye imagined no that they would go -forth; and they imagined that their fortresses would protect them against Allah. Wherefore Allah came upon them whence they reckoned not, and cast terror in their hearts so that they made their houses desolate with their own hands and the hands of the believers. So learn a lesson. O ye endued with insight!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who expelled the faithless belonging to the People of the Book from their homes at the outset of [their] en masse banishment. You did not think that they would go out, and they thought their fortresses would protect them from Allah. But Allah came at them from whence they did not suppose and He cast terror into their hearts. They demolish their houses with their own hands and the hands of the faithful. So take lesson, O you who have insight!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who got out the Unbelievers among the People of the Book from their homes at the first gathering (of the forces). Little did ye think that they would get out: And they thought that their fortresses would defend them from Allah! But the (Wrath of) Allah came to them from quarters from which they little expected (it), and cast terror into their hearts, so that they destroyed their dwellings by their own hands and the hands of the Believers, take warning, then, O ye with eyes (to see)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who drove out the disbelievers among the people of the Scripture (i.e. the Jews of the tribe of Bani An-Nadir) from their homes at the first gathering. You did not think that they would get out. And they thought that their fortresses would defend them from Allah! But Allah's (Torment) reached them from a place whereof they expected it not, and He cast terror into their hearts, so that they destroyed their own dwellings with their own hands and the hands of the believers. Then take admonition, O you with eyes (to see).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was He who expelled the unbelievers among the People of the Book from their homes into the first exile. You did not think that they would go out, and they thought their fortresses would protect them from Allah. But Allah came upon them from where they did not expect, casting terror into their hearts that their homes were destroyed by their own hands as well as by the hands of the believers. Therefore, take heed you that have eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who evicted those who disbelieved among the People of the Book from their homes at the first mobilization. You did not think they would leave, and they thought their fortresses would protect them from God. But God came at them from where they never expected, and threw terror into their hearts. They wrecked their homes with their own hands, and by the hands of the believers. Therefore, take a lesson, O you who have insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who expelled the ones who disbelieved among the People of the Scripture from their homes at the first gathering. You did not think they would leave, and they thought that their fortresses would protect them from Allah; but [the decree of] Allah came upon them from where they had not expected, and He cast terror into their hearts [so] they destroyed their houses by their [own] hands and the hands of the believers. So take warning, O people of vision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:2]   It is He Who expelled those who disbelieved of the People of the Scripture, namely, the Jews of the Banū alNadīr, from their homelands, [from] their dwellings at Medina, at the first exile, that is, their exile to Syria, the last [exile] being their banishment to Khaybar by ‘Umar during his caliphate. You did not think, O believers, that they would go forth, and they thought that they would be protected (māni‘atuhum is the predicate of an, ‘that’) by their fortresses (husūnuhum, the agent of the verb [māni‘atuhum], with which the predication is completed) from God, from His chastisement. But God, His command and His chastisement, came at them from whence they had not reckoned, [from whence] had never occurred to them, from the part of the believers, and He cast terror (ru‘b or ru‘ub) into their hearts, by having their chief Ka‘b b. alAshraf slain, destroying [as they did] (read yukharribūna; or yukhribūna, [derived] from [4th form] akhraba) their houses, in order to take away with them what they valued of wood and so on, with their own hands and the hands of the believers. So take heed, O you who have eyes!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهُوَ الَّذِي أَخْرَجَ الَّذِينَ كَفَرُوا مِنْ أَهْلِ الْكِتَابِ مِنْ دِيَارِهِمْ لِأَوَّلِ الْحَشْرِ مَا ظَنَنْتُمْ أَنْ يَخْرُجُوا وَظَنُّوا أَنَّهُمْ مَانِعَتُهُمْ حُصُونُهُمْ مِنَ اللَّهِ فَأَتَاهُمُ اللَّهُ مِنْ حَيْثُ لَمْ يَحْتَسِبُوا وَقَذَفَ فِي قُلُوبِهِمُ الرُّعْبَ يُخْرِبُونَ بُيُوتَهُمْ بِأَيْدِيهِمْ وَأَيْدِي الْمُؤْمِنِينَ فَاعْتَبِرُوا يَا أُولِي الْأَبْصَارِ (2){ هُوَ الذى أَخْرَجَ الذين كَفَرُواْ مِنْ أَهْلِ الكتاب مِن ديارهم لاَِوَّلِ الحَشْرِ مَا ظَنَنتُمْ أَن يَخرُجُواْ } .يجوز أن تجعل جملة { هو الذي أخرج الذين كفروا } إلى آخرها استئنافاً ابتدائياً لقصد إجراء هذا التمجيد على اسم الجلالة لما يتضمنه من باهر تقديره ، ولِمَا يؤذن به ذلك من التعريض بوجوب شكره على ذلك الإِخراج العجيب .ويجوز أن تجعل علة لما تضمنه الخبر عن تسبيح ما في السماوات وما في الأرض من التذكير للمؤمنين والتعريض بأهل الكتاب والمنافقين الذين هم فريقان مما في الأرض فإن القصة التي تضمنتها فاتحة السورة من أهل أحوالهما .ويجوز أن تجعل مبينة لجملة { وهو العزيز الحكيم } \\[ الحشر : 1 \\] لأن هذا التسخير العظيم من آثار عزّه وحكمته .وعلى كل الوجوه فهو تذكير بنعمة الله على المسلمين وإيماء إلى أن يشكروا الله على ذلك وتمهيد للمقصود من السورة وهو قسمة أموال بني النضير .وتعريف جزأي الجملة بالضمير والموصول يفيد قصر صفة إخراج الذين كفروا من ديارهم عليه تعالى وهو قصر ادعائي لعدم الاعتداد بسعي المؤمنين في ذلك الإِخراج ومعالجتهم بعض أسبابه كتخريب ديار بني النضير .ولذلك فَجملة { ما ظننتم أن يخرجوا } تتنزل منزلة التعليل لجملة القصر .وجملة { وظنوا أنهم مانعتهم حصونهم } عطف على العلة ، أي وهم ظنوا أن المسلمين لا يغلبونهم . وإنما لم يقل : وظنوا أن لا يُخرَجوا . مع أن الكلام على خروجهم ، من قوله تعالى : { هو الذي أخرج الذين كفروا } فعدل عنه إلى { وظنوا أنهم مانعتهم حصونهم } أي مانعتهم من إخراجهم استغناء عن ذكر المظنون بذكر علة الظن . والتقدير : وظنوا أن لا يخرجوا لأنهم تمنعهم حصونهم ، أي ظنوا ظناً قوياً معتمدين على حصونهم .والمراد ب { الذين كفروا من أهل الكتاب } بنو النضير ( بوزن أمير ) وهم قبيلة من اليهود استوطنوا بلاد العرب هم وبنو عمهم قُريظة ، ويهودُ خَيبر ، وكلهم من ذرية هَارون عليْه السلام وكان يقال لبني النضير وبني قريظة : الكاهنان لأن كل فريق منهما من ذرية هارون وهو كاهن الملة الإسرائيلية ، والكهانة : حفظ أمور الديانة بيده ويد أعقابه .وقصة استيطانهم بلاد العرب أن موسى عليه السلام كان أرسل طائفة من أسلافهم لقتال العماليق المجاورين للشام وأرض العرب فقصَّروا في قتالهم وتوفي موسى قريباً من ذلك . فلما علموا بوفاة موسى رجعوا على أعقابهم إلى ديار إسرائيل في أريحَا فقال لهم قومهم : أنتم عصيتم أمر موسى فلا تدخلوا بلادنا ، فخرجوا إلى جزيرة العرب وأقاموا لأنفسهم قُرى حول يثرب ( المدينة ) وبنوا لأنفسهم حصُوناً وقرية سَموها الزَّهرة . وكانت حصونهم خمسة سيأتي ذكر أسمائها في آخر تفسير الآية ، وصاروا أهل زرع وأموال . وكان فيهم أهل الثراء مثل السموأل بن عَادِيا ، وكَعب بن الأشرف ، وابن أبي الحُقَيق ، وكان بينهم وبين الأوس والخزرج حِلف ومعاملة ، فكان من بطون أولئك اليهود بنو النضير وقريظة وخيبر .ووسموا ب { الذين كفروا } لأنهم كفروا بمحمد صلى الله عليه وسلم تسجيلاً عليهم بهذا الوصف الذميم وقد وُصفوا ب { الذين كفروا } في قوله تعالى : { ولما جاءهم كتاب من عند الله مصدق لما معهم وكانوا من قبل يستفتحون على الذين كفروا فلما جاءهم ما عرفوا كفروا به فلعنة الله على الكافرين } \\[ البقرة : 89 \\] إلى قوله : { عذاب مهين } في سورة \\[ البقرة : 90 \\] .وعليه فحرف من } في قوله : { من أهل الكتاب } بيانية لأن المراد بأهل الكتاب هنا خصوص اليهود أي الذين كفروا برسالة محمد صلى الله عليه وسلم وهم أهل الكتاب وأراد بهم اليهود ، فوصفوا ب { من أهل الكتاب } لئلا يظن أن المراد ب { الذين كفروا } المشركون بمكة أو بقية المشركين بالمدينة فيُظنّ أن الكلام وعيد .وتفصيل القصة التي أشارت إليها الآية على ما ذكره جمهور أهل التفسير . أن بني النضير لما هاجر المسلمون إلى المدينة جاؤوا فصالحوا النبي صلى الله عليه وسلم على أن لا يكونوا عليه ولا له ، ويقال : إن مصالحتهم كانت عقبَ وقعة بَدر لمَّا غلَب المسلمون المشركين لأنهم توسّموا أنه لا تهزم لهم راية ، فلما غُلب المسلمون يوم أُحد نكثوا عهدهم وراموا مصالحة المشركين بمكة ، إذ كانوا قد قعدوا عن نصرتهم يوم بدر ( كدأب اليهود في موالاة القوي ) فخرج كعب بن الأشرف وهو سيد بني النضير في أربعين راكباً إلى مكة فحَالفوا المشركين عند الكعبة على أن يكونوا عوناً لهم على مقاتلة المسلمين ، فلما أُوحي إلى رسول الله صلى الله عليه وسلم بذلك أمرَ محمدَ بن مسلمة أن يقتل كعب بن الأشرف فقتله غيلة في حصنه في قصة مذكورة في كتب السنة والسير .وذكر ابن إسحاق سبباً آخر وهو أنه لما انقضت وقعة بئر معونة في صفر سنة أربع كان عَمرو بن أمية الضَّمْري أسيراً عند المشركين فأطلقه عامر بن الطفيل . فلما كان راجعاً إلى المدينة أقبل رجلان من بني عامر وكان لقومهما عقد مع رسول الله صلى الله عليه وسلم ونزلا مع عمرو بن أمية ، فلما ناما عدا عليهما فقتلهما وهو يحسب أنه يثأر بهما من بني عامر الذين قتلوا أصحاب رسول الله صلى الله عليه وسلم ببئر معونة ، ولما قدم عمرو بن أمية أخبر رسولَ الله صلى الله عليه وسلم بما فعل فقال له رسول الله صلى الله عليه وسلم « لقد قتلت قتيلين ولآدِيَنَّهُمَا » ، وخرج رسول الله صلى الله عليه وسلم إلى بني النضير يستعينهم في دية ذينك القتيلين إذ كان بين بني النضير وبين بني عامر حِلف ، وأضمر بنو النضير الغدر برسول الله صلى الله عليه وسلم وأطلعه الله عليه فأمر رسول الله صلى الله عليه وسلم المسلمين بالتهيّؤ لحربهم .ثم أمر النبي صلى الله عليه وسلم المسلمين بالسيْر إليهم في ربيع الأول سنة أربع من الهجرة فسار إليهم هو والمسلمون وأمرهم بأن يَخرجوا من قريتهم فامتنعوا وتنادوا إلى الحرب ودسّ إليهم عبد الله بنُ أُبيّ ابنُ سلول أن لا يخرجوا من قريتهم وقال : إنْ قاتلَكم المسلمون فنحن معكم ولننصُرنَّكم وإن أخرجتم لَنَخُرجَنّ معكم فَدَرِّبُوا على الأزقة ( أي سُدُّوا منافذ بعضها لبعض ليكون كلّ درب منها صالحاً للمدافعة ) وحصِّنوها ، ووعدهم أن معه ألفين من قومه وغيرهم ، وأن معهم قريظة وحلفاءهم من غطفان من العرب فحاصرهم النبي صلى الله عليه وسلم وانتظروا عبد الله بن أُبيّ ابن سلول وقريظة وغطفان أن يقدموا إليهم ليردوا عنهم جيش المسلمين فلما رأوا أنهم لم ينجدوهم قذف الله في قلوبهم الرعب فطلبوا من النبي صلى الله عليه وسلم الصلح فأبى إلا الجلاء عن ديارهم وتشارطوا على أن يخرجوا ويَحملَ كلّ ثلاثة أبيات منهم حِمْل بعير مما شاؤوا من متاعهم ، فجعلوا يخرّبون بيوتهم ليحملوا معهم ما ينتفعون به من الخشب والأبواب .فخرجوا فمنهم من لحق بخيبر ، وقليل منهم لحقوا ببلاد الشام في مدن ( أريحا ) وأذرعات من أرض الشام وخرج قليل منهم إلى الحِيرة .واللام في قوله : { لأول الحشر } لام التوقيت وهي التي تدخل على أول الزمان المجعول ظرفاً لعمللٍ مثل قوله تعالى : { يقول يا ليتني قدمت لحياتي } \\[ الفجر : 24 \\] أي من وقت حياتي . وقولهم : كتب ليوم كذا . وهي بمعنى ( عند ) . فالمعنى أنه أخرجهم عند مبدأ الحشر المقدر لهم ، وهذا إيماء إلى أن الله قَدر أن يخرجوا من جميع ديارهم في بلاد العرب . وهذا التقدير أمر به النبي صلى الله عليه وسلم كما سيأتي . فالتعريف في { الحشر } تعريف العهد .والحشر : جمع ناس في مكان قال تعالى : { وابعث في المدائن حاشرين يأتوك بكل سحّار عليم } \\[ الشعراء : 36 - 37 \\] .والمراد به هنا : حشر يهود جزيرة العرب إلى أرض غيرها ، أي جمْعهم للخروج ، وهو بهذا المعنى يرادف الجلاء إذا كان الجلاء لجماعة عظيمة تُجمع من متفرق ديار البلاد .وليس المراد به : حشر يوم القيامة إذ لا مناسبة له هنا ولا يلائم ذكر لفظ «أول» لأن أول كل شيء إنما يكون متحد النوع مع ما أضيف هو إليه .وعن الحسن : أنه حمل الآية على حشر القيامة وركّبوا على ذلك أوهاماً في أن حشر القيامة يكون بأرض الشام وقد سبق أن ابن عباس احترز من هذا حين سمى هذه السورة «سورة بني النضير» وفي جعل هذا الإِخراج وقتاً لأوّل الحشر إيذان بأن حشرهم يتعاقب حتى يكمل إخراج جميع اليهود وذلك ما أوصى به النبي صلى الله عليه وسلم قُبيل وفاته إذ قال :« لا يبقى دينان في جزيرة العرب » وقد أنفذه عمر بن الخطاب حين أجلى اليهود من جميع بلاد العرب . وقيل : وُصف الحشر بالأول لأنه أول جلاء أصاب بني النضير ، فإن اليهود أُجْلُوا من فلسطين مرتين مرة في زمن ( بختنصر ) ومرة في زمن ( طيطس ) سلطان الروم وسَلِم بنو النضير ومن معهم من الجلاء لأنهم كانوا في بلاد العرب . فكان أول جلاء أصابهم جلاء بني النضير .{ يَخْرُجُواْ وظنوا أَنَّهُمْ مَّانِعَتُهُمْ حُصُونُهُم مِّنَ } .أي كان ظن المسلمين وظن أهل الكتاب متواردين على تعذر إخراج بني النضير من قريتهم بسبب حصانة حصونهم .وكان اليهود يتخذون حصوناً يأوون إليها عندما يغزوهم العدوّ مثل حصون خيبر .وكانت لبني النضير ستة حصون أسماؤها : الكُتيبة ( بضم الكاف وفتح المثناة الفوقية ) والوَطِيح ( بفتح الواو وكسر الطاء ) والسُّلاَلم ( بضم السين ) والنَّطَاةُ ( بفتح النون وفتح الطاء بعدها ألف وبهاء تأنيث آخرَه ) والوَخْدَة ( بفتح الواو وسكون الخاء المعجمة ودال مهملة ) وشَقّ ( بفتح الشين المعجمة وتشديد القاف ) .ونظم جملة { وظنوا أنهم مانعتهم حصونهم } على هذا النظم دون أن يقال : وظَنُّوا أن حصونهم مانعتُهم ليكون الابتداء بضميرهم لأنه سيعقبه إسناد { مانعتهم } إليه فيكون الابتداء بضميرهم مشيراً إلى اغترارهم بأنفسهم أنهم في عزة ومَنَعة ، وأن مَنَعة حصونهم هي من شؤون عزتهم .وفي تقديم { مانعتهم } وهو وصف على { حصونهم } وهو اسم والاسم بحسب الظاهر أولى بأن يجعل في مرتبة المبتدأ ويجعل الوصف خبراً عنه ، فعدل عن ذلك إشارة إلى أهمية منَعة الحصون عند ظنهم فهي بمحل التقديم في استحضار ظنهم ، ولا عبرة بجواز جعل حصونهم فاعلاً باسم الفاعل وهو { مانعتهم } بناء على أنه معتمد على مسند إليه لأن محامل الكلام البليغ تجري على وجوه التصرف في دقائق المعاني فيصير الجائز مرجوحاً . قال المرزوقي في شرح ( باب النسب ) قول الشاعر وهو منسوب إلى ذي الرمة في غير ديوان الحماسة :فإن لم يكن إلا مُعَرَّج ساعة ... قليلاً فإني نافع لي قليلهايجوز أن يكون ( قليلها ) مبتدأ و ( نافع ) خبر مقدم عليه أي لقصد الاهتمام . والجملة في موضع خبر ( إنّ ) والتقدير : إني قليلها نافع لي .{ الله فأتاهم الله مِنْ حَيْثُ لَمْ يَحْتَسِبُواْ وَقَذَفَ فِى قُلُوبِهِمُ الرعب يُخْرِبُونَ بُيُوتَهُمْ بِأَيْدِيهِمْ وَأَيْدِى المؤمنين فاعتبروا ياأولى } .تفريع على مجموع جملتي { ما ظننتم أن يخرجوا وظنوا أنهم مانعتهم حصونهم من الله } اللتين هما تعليل للقصر في قوله تعالى : { هو الذي أخرج الذين كفروا من أهل الكتاب } .وتركيب ( أتاهم الله من حيث لم يحتسبوا ) تمثيل ، مُثِّل شأنُ الله حين يسّر أسباب استسلامهم بعد أن صمموا على الدفاع وكانوا أهل عِدة وعُدة ولم يطل حصارهم بحال من أخذ حذره من عدوّه وأحكم حراسته من جهاته فأتاه عدوه من جهة لم يكن قد أقام حراسة فيها .وهذا يشبه التمثيل الذي في قوله تعالى : { والذين كفروا أعمالهم كسراب بقيعة يحسبه الظمآن ماء حتى إذا جاءه لم يجده شيئاً ووجد الله عنده } \\[ النور : 39 \\] .والاحتساب : مبالغة في الحسبان ، أي الظنّ أي من مكان لم يظنوه لأنهم قصروا استعدادهم على التحصّن والمنَعة ولم يعلموا أن قوة الله فوق قوتهم .والقذف : الرمي باليد بقوة . واستعير للحصول العاجل ، أي حصل الرعب في قلوبهم دفعة دون سابق تأمل ولا حصول سبب للرعب ولذلك لم يؤت بفعل القذف في آية \\[ آل عمران : 151 \\] { سنلقي في قلوب الذين كفروا الرعب }والمعنى : وجعل الله الرعب في قلوبهم فأسرعوا بالاستسلام . وقَذْفُ الرعب في قلوبهم هو من أحوال إتيان الله إياهم من حيث لم يحتسبوا فتخصيصه بالذكر للتعجيب من صنع الله ، وعطفُه على أتاهم الله من حيث لم يحتسبوا عطف خاص على عام للاهتمام .والرعب } : شدة الخوف والفزع . وهذا معنى قول النبي صلى الله عليه وسلم « نصرت بالرعب » ، أي برعب أعداء الدين .وجملة { يخربون بيوتهم } حال من الضمير المضاف إليه { قلوبهم } لأن المضاف جزء من المضاف إليه فلا يمنع مجيء الحال منه .والمقصود التعجيب من اختلال أمورهم فإنهم وإن خربوا بيوتهم باختيارهم لكن داعي التخريب قهري .والإِخراب والتخريب : إسقاط البناء ونقضه . والخراب : تهدم البناء .وقرأ الجمهور { يخربون } بسكون الخاء وتخفيف الراء المكسورة مضارع : أَخرب . وقرأه أبو عمرو وحْده بفتح الخاء وتشديد الراء المكسورة مضارع : خَرَّب . وهما بمعنى واحد . قال سيبويه : إن أفعلت وفَعَّلت يتعاقبان نحْو أخربته وخَرّبته ، وأفرحته وفرّحته . يريد في أصل المعنى . وقد تقدم ما ذكر من الفرق بين : أَنزل ونَزّل في المقدمة الأولى من مقدمات هذا التفسير .وأشارت الآية إلى ما كان من تخريب بني النضير بيوتهم ليأخذوا منها ما يصلح من أخشاب وأبواب مما يحملونه معهم ليبنوا به منازلهم في مهاجرهم ، وما كان من تخريب المؤمنين بقية تلك البيوت كلما حلّوا بقعة تركها بنو النضير .وقوله : { بأيديهم } هو تخريبهم البيوت بأيديهم ، حقيقةٌ في الفعل وفي ما تعلق به ، وأما تخريبهم بيوتهم بأيدي المؤمنين فهو مجاز عقلي في إسناد التخريب الذي خربه المؤمنون إلى بني النضير باعتبار أنهم سبَّبوا تخريب المؤمنين لما تركه بنو النضير .فعطف { أيدي المؤمنين } على { بأيديهم } بحيث يصير متعلّقاً بفعل { يخربون } استعمال دقيق لأن تخريب المؤمنين ديار بني النضير لمّا وجدوها خاوية تخريب حقيقي يتعلق المجرور به حقيقة .فالمعنى : ويسببون خراب بيوتهم بأيدي المؤمنين فوقع إسناد فعل { يخربون } على الحقيقة ووقع تعلق وتعليق { وأيدي المؤمنين } به على اعتبار المجاز العقلي ، فالمجاز في التعليق الثاني .وأما معنى التخريب فهو حقيقي بالنسبة لكلا المتعلقين فإن المعنى الحقيقي فيهما هو العبرة التي نبه عليها قوله تعالى : { فاعتبروا يا أولي الأبصار } ، أي اعتبروا بأن كان تخريب بيوتهم بفعلهم وكانت آلات التخريب من آلاتهم وآلات عدوهم .والاعتبار : النظر في دلالة الأشياء على لوازمها وعواقبها وأسبابها . وهو افتعال من العبرة ، وهي الموعظة . وقول «القاموس» : هي العجب قصور .وتقدم في قوله تعالى : { لقد كان في قصصهم عبرة لأولي الألباب } في سورة \\[ يوسف : 111 \\] .والخطاب في قوله : يا أولي الأبصار } موجّه إلى غير معين . ونودي أولو الأبصار بهذه الصلة ليشير إلى أن العبرة بحال بني النضير واضحة مكشوفة لكل ذي بَصر مما شاهد ذلك ، ولكل ذي بصر يرى مواقع ديارهم بعدهم ، فتكون له عبرة قدرة الله على إخراجهم وتسليط المسلمين عليهم من غير قتال . وفي انتصار الحق على الباطل وانتصار أهل اليقين على المذبذبين .وقد احتج بهذه الآية بعض علماء الأصول لإِثبات حجّيّة القياس بناء على أنه من الاعتبار .\n\n",
      "translations": [
        {
          "translation": "(He it is Who hath caused those of the People of the Scripture who disbelieved) i.e. Banu'l-Nadir (to go forth from their homes) and fortresses (unto the first exile) because they are the first to be gathered and exiled from Medina to Historic Syria, and specifically to Jericho and Adhri'at, as a result of breaking their covenants with the Prophet (pbuh) after the battle of Uhud. (Ye deemed not) you did not have any hope, group of believers, (that they) i.e. Banu'l-Nadir (would go forth) from Medina to Historic Syria, (while they) the Banu'l-Nadir (deemed that their strongholds) their fortresses (would protect them from Allah) from Allah's chastisement. (But Allah reached them) Allah punished them and humiliated them through the killing of Ka'b Ibn al-Ashraf (from a place whereof they reckoned not) they did not think that Ka'b Ibn al-Ashraf would be killed nor did they have any fear regarding this, (and cast terror in their hearts) fear from Muhammad (pbuh) and his Companions, when they did not fear them at all before this (so that they ruined their houses) some of their houses (with their own hands) and throw its stones on the believers (and the hands of the believers) and they left some of their homes to the believers who destroyed them and threw their stones at them. (So learn a lesson, ye who have eyes!) learn a lesson, you who have insight in Religion, from what Allah has done to them concerning their exile.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مع أنهم { مِنْ أَهْلِ ٱلْكِتَابِ مِن دِيَارِهِمْ } المألوفة\n وأوطانهم المأنوسة زجراً عليهم\n وتذليلاً له واقعاً إياهم { لأَوَّلِ ٱلْحَشْرِ } أي: في أول الحشر\n إجلائهم الواقع عليهم بظهر الإسلام\n إذ أجلى رسول الله صلى الله عليه وسلم بني النضير أولاً من المدنية إلى الشام\n ثمَّ أجلى بقية الكفرة عمرُ رضي الله عنه في خلافته\n انظروا كيف أخرجهم سبحانه بكمال قدرته وعزته\n مع أنكم { مَا ظَنَنتُمْ } أيها المؤمنون من { أَن يَخْرُجُواْ } لشدتهم وشوكتهم\n واستحكام آماكنهم وقلاعهم { وَ } هم أيضاً { ظَنُّوۤاْ أَنَّهُمْ مَّانِعَتُهُمْ حُصُونُهُم } أي: ظنهم لأنفسهم أن حصونهم تمنعهم { مِّنَ } بأس { ٱللَّهِ } المنتقم الغيور وبشطه وإن اشتد\n لكن لم ينفعهم الحصون والقلاع حين نزول العذاب\n بل { فَأَتَاهُمُ ٱللَّهُ } أي: القهر الهائل من لدنه { مِنْ حَيْثُ لَمْ يَحْتَسِبُواْ } أي: من صوب وجهة لم يتوقعوا\n\n\n{ وَ } ذلك أنه { قَذَفَ } وألقى سبحانه { فِي قُلُوبِهِمُ ٱلرُّعْبَ } الشديد\n والخوف العظيم من غير قتال\n وبسبب ذلك الرعب الهائل اخذوا { يُخْرِبُونَ بُيُوتَهُمْ بِأَيْدِيهِمْ } ضناً بها على المسلمين\n وإخراج ما فيها من الأمتعة { وَأَيْدِي ٱلْمُؤْمِنِينَ } أيضاً\n فإنهم أيضاً كانوا يخرجون بيوتهم إذلالاً لهم\n وتوسيعاً لمضمار الحرب والقتال\n وبالجملة: { فَٱعْتَبِرُواْ يٰأُوْلِي ٱلأَبْصَارِ } [الحشر: 2] واتعظوا بما جرى على هؤلاء الغواة الطغاة\n يثقون بحصونهم ويشيدونها\n ليتحصنوا بها من بأس الله\n ثمَّ لما اضطروا أخذوا يخبرون بأيديهم ما يعتمدون عليه\n ويستحفظون به\n وذلك كمال قدرته الله ومتانة حكمته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nواللام في قوله: { لأول الحشر } متعلق بأخْرَج\n وهو اللام في قوله:\n[الفجر: 24] أي: أخرجهم عند أول الحشر\n وكونه أول الحشر لأنّ هذا أول حشرهم إلى الشام\n وكانوا مِن سبط لم يُصبهم جلاء قط\n وهم أول مَن أُخرج من أهل الكتاب من جزيرة العرب إلى الشام\n وآخر حشرهم: إجلاء عُمر إياهم من خيبر إلى الشام\n أو: آخر حشرهم: حشر يوم القيامة\n قال ابن عباس رضي الله عنه: \" مَن شك أنَّ المحشر بالشام فليقرأ هذه الآية \" فهم الحشر الأول\n وسائر الناس الحشر الثاني\n وقال لهم رسول الله صلى الله عليه وسلم لمّا خرجوا:\n \" امضوا\n فإنكم أول الحشر ونحن على الأثر \" \n{ ما ظننتم أن يخرجوا } \n لشدة بأسهم\n ومَنعَتهم\n ووثاقه حصونهم\n وكثرة عَددهم وعُدتهم\n { وظنوا أنهم مانعتهم حُصُونُهم من الله } أي: ظنوا أنّ حصونهم تمنعهم من بأس الله\n والفرق بين هذا التركيب والنظم الذي جاء عليه التنزيل: أنّ في تقديم الخبر على المبتدأ دليلاً على فرط وُثوقهم بحصانتها ومنعها إياهم\n وفي مصير ضميرهم اسماً لـ \" أن \" \n وإسناد الجملة إليه\n دليل على اعتقادهم في أنفسهم أنهم في عزة ومنعة\n لا يُبالَى معها بأحد يتعرض لهم\n أو يطمع في مغازيهم\n وليس ذلك في قولك: وظنوا أنّ حصونهم تمنعهم\n { فأتاهم اللهُ } أي: أمره وعقابه { من حيث لم يحتسبوا } من حيث لم يظنوا\n ولم يخطر ببالهم\n حتى قُتل \" كعب \" رئيسهم على يد أخيه رضاعاً\n { وقَذَفَ في قلوبهم الرُّعْبَ } الخوف والجزع\n { يُخْربون بيوتَهم بأيديهم وأيدي المؤمنين } \n فكانوا يُخربون بواطنَها\n والمسلمون ظواهرَها\n لِمَا أراد الله مِن استئصال شأفتهم\n وألاَّ تبقى لهم بالمدينة دار\n ولا منهم دَيَّار\n والذي دعاهم إلى التخريب حاجتهم إلى الخشب والحجارة\n ليسدُّوا بها أفواه الأزفَّة ولئلا يبقى بعد جلائهم مساكن للمسلمين\n وأن ينقلوا معهم ما كان في أبنيتهم من جيّد الخشب والساج\n وأمّا المؤمنون فدعاهم إلى التخريب إزالة مُتحصّنهم\n وأن تتسع لهم مجال الحرب\n ومعنى تخريبهم إياها بأيدي المؤمنين: أنهم لما عرّضوهم بنكث العهد لذلك\n وكان السبب فيه فكأنهم أمروهم به\n وكلّفوهم إياه\n { فاعتبِروا يا أُولي الأبصارِ } أي: فاتعِظوا بما جرى عليهم من الأمور الهائلة على وجهٍ لا تهتدي إليه الأفكار\n أو: فتأملوا فيما نزل بهؤلاء\n والسبب الذي استحقوا به ذلك\n فاحذروا أن تفعلوا مثَل فعلهم\n فتُعاقََبوا مثل عقوبتهم\n قال البيضاوي: اتعِظوا بحالهم\n فلا تغدروا ولا تعتمدوا على غير الله\n هـ\n وهذا دليل على جواز القياس",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:114",
      "similarity": 0.5682957732061265
    },
    {
      "verse": "3:151",
      "similarity": 0.25857535183592667
    },
    {
      "verse": "33:26",
      "similarity": 0.24421265044202412
    },
    {
      "verse": "8:12",
      "similarity": 0.19009064539096165
    },
    {
      "verse": "24:44",
      "similarity": 0.18668505079689732
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/059002.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/059002.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/59:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}