{
  "chapter": "الحشر",
  "text": "هو الذى اخرج الذين كفروا۟ من اهل الكتب من ديرهم لاول الحشر ما ظننتم ان يخرجوا۟ وظنوا۟ انهم مانعتهم حصونهم من الله فاتىهم الله من حيث لم يحتسبوا۟ وقذف فى قلوبهم الرعب يخربون بيوتهم بايديهم وايدى المؤمنين فاعتبروا۟ ياو۟لى الابصر",
  "translations": [
    {
      "translation": "It is He who expelled those who were kafir among the People of the Book from their homes to the first gathering-place.* You did not think that they would leave and they thought that their fortresses would protect them from Allah. Then Allah came upon them from where they least expected it and cast terror into their hearts. Their houses were pulled down by their own hands and by the hands of the muminun. People of insight, take note!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who drove those among the people of the Book who refused to believe, from their homes for the first confrontation. You did not think that they would go away, and they imagined that their forts would protect them against God. But God came upon them from where they did not suspect, and filled their hearts with terror, so that they destroyed their homes with their own hands (or were destroyed) by the hands of believers. So take heed, O men of sight!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who in the first assault drove forth the People of the Book that disbelieved from their homes at the first gathering of forces. You did not believe that they would leave; while they too thought that their fortresses would defend them against Allah. Then Allah came upon them from whence they did not even imagine, casting such terror into their hearts that they destroyed their homes by their own hands and their destruction was also caused by the hands of the believers. So learn a lesson from this, O you who have perceptive eyes!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who drove the disbelievers among the followers of the Bible out of their homes (in the Arabian Peninsula) as the first time exiles. You did not think that they would leave their homes and they thought that their fortresses would save them from God. The decree of God came upon them in a way that even they did not expect. He caused such terror to enter their hearts that they started to destroy their own homes by their own hands and by those of the believers. People of vision, learn from this a lesson.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who expelled the disbelievers among the People given the Book(s) from their homes, for their first gathering; you did not expect them to leave, whereas they assumed that their fortresses would save them from Allah, so Allah’s command came to them from a place they had not imagined; and He instilled awe in their hearts, so they ruin their own houses by their own hands and at the hands of the Muslims; therefore learn a lesson, O those who can perceive!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who drove out the disbelievers among the People of the Scripture from their homes at the first gathering. You did not think that they would get out. And they thought that their fortresses would defend them from Allah! But Allah reached them from a place whereof they expected it not, and He cast terror into their hearts so that they demolished their own dwellings with their own hands and the hands of the believers. Then take admonition, O you with eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who caused those who disbelieved of the followers of the Book to go forth from their homes at the first banishment you did not think that they would go forth, while they were certain that their fortresses would defend them against Allah; but Allah came to them whence they did not expect, and cast terror into their hearts; they demolished their houses with their own hands and the hands of the believers; therefore take a lesson, O you who have eyes!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who expelled from their habitations the unbelievers among the People of the Book at the first mustering. You did not think that they would go forth, and they thought that their fortresses would defend them against God; then God came upon them from whence they had not reckoned, and He cast terror into their hearts as they destroyed their houses with their own hands, and the hands of the believers; therefore take heed, you who have eyes!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who hath caused those of the People of the Scripture who disbelieved to go forth from their homes unto the first exile. Ye deemed not that they would go forth, while they deemed that their strongholds would protect them from Allah. But Allah reached them from a place whereof they recked not, and cast terror in their hearts so that they ruined their houses with their own hands and the hands of the believers. So learn a lesson, O ye who have eyes!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was He who turned those People of the Book who denied the truth out of their homes in the first banishment. You never thought they would go, and they thought their strongholds would protect them against God. But God came upon them from where they least expected and cast such terror into their hearts that their houses were pulled down by their own hands as well as by the hands of the believers. Learn a lesson, then, you who are endowed with insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is that drave forth those of the people of the Book who disbelieved from their homes at the first gathering, Ye imagined no that they would go -forth; and they imagined that their fortresses would protect them against Allah. Wherefore Allah came upon them whence they reckoned not, and cast terror in their hearts so that they made their houses desolate with their own hands and the hands of the believers. So learn a lesson. O ye endued with insight!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who expelled the faithless belonging to the People of the Book from their homes at the outset of [their] en masse banishment. You did not think that they would go out, and they thought their fortresses would protect them from Allah. But Allah came at them from whence they did not suppose and He cast terror into their hearts. They demolish their houses with their own hands and the hands of the faithful. So take lesson, O you who have insight!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who got out the Unbelievers among the People of the Book from their homes at the first gathering (of the forces). Little did ye think that they would get out: And they thought that their fortresses would defend them from Allah! But the (Wrath of) Allah came to them from quarters from which they little expected (it), and cast terror into their hearts, so that they destroyed their dwellings by their own hands and the hands of the Believers, take warning, then, O ye with eyes (to see)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who drove out the disbelievers among the people of the Scripture (i.e. the Jews of the tribe of Bani An-Nadir) from their homes at the first gathering. You did not think that they would get out. And they thought that their fortresses would defend them from Allah! But Allah's (Torment) reached them from a place whereof they expected it not, and He cast terror into their hearts, so that they destroyed their own dwellings with their own hands and the hands of the believers. Then take admonition, O you with eyes (to see).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was He who expelled the unbelievers among the People of the Book from their homes into the first exile. You did not think that they would go out, and they thought their fortresses would protect them from Allah. But Allah came upon them from where they did not expect, casting terror into their hearts that their homes were destroyed by their own hands as well as by the hands of the believers. Therefore, take heed you that have eyes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who evicted those who disbelieved among the People of the Book from their homes at the first mobilization. You did not think they would leave, and they thought their fortresses would protect them from God. But God came at them from where they never expected, and threw terror into their hearts. They wrecked their homes with their own hands, and by the hands of the believers. Therefore, take a lesson, O you who have insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who expelled the ones who disbelieved among the People of the Scripture from their homes at the first gathering. You did not think they would leave, and they thought that their fortresses would protect them from Allah; but [the decree of] Allah came upon them from where they had not expected, and He cast terror into their hearts [so] they destroyed their houses by their [own] hands and the hands of the believers. So take warning, O people of vision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:2]   It is He Who expelled those who disbelieved of the People of the Scripture, namely, the Jews of the Banū alNadīr, from their homelands, [from] their dwellings at Medina, at the first exile, that is, their exile to Syria, the last [exile] being their banishment to Khaybar by ‘Umar during his caliphate. You did not think, O believers, that they would go forth, and they thought that they would be protected (māni‘atuhum is the predicate of an, ‘that’) by their fortresses (husūnuhum, the agent of the verb [māni‘atuhum], with which the predication is completed) from God, from His chastisement. But God, His command and His chastisement, came at them from whence they had not reckoned, [from whence] had never occurred to them, from the part of the believers, and He cast terror (ru‘b or ru‘ub) into their hearts, by having their chief Ka‘b b. alAshraf slain, destroying [as they did] (read yukharribūna; or yukhribūna, [derived] from [4th form] akhraba) their houses, in order to take away with them what they valued of wood and so on, with their own hands and the hands of the believers. So take heed, O you who have eyes!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is Who hath caused those of the People of the Scripture who disbelieved) i.e. Banu'l-Nadir (to go forth from their homes) and fortresses (unto the first exile) because they are the first to be gathered and exiled from Medina to Historic Syria, and specifically to Jericho and Adhri'at, as a result of breaking their covenants with the Prophet (pbuh) after the battle of Uhud. (Ye deemed not) you did not have any hope, group of believers, (that they) i.e. Banu'l-Nadir (would go forth) from Medina to Historic Syria, (while they) the Banu'l-Nadir (deemed that their strongholds) their fortresses (would protect them from Allah) from Allah's chastisement. (But Allah reached them) Allah punished them and humiliated them through the killing of Ka'b Ibn al-Ashraf (from a place whereof they reckoned not) they did not think that Ka'b Ibn al-Ashraf would be killed nor did they have any fear regarding this, (and cast terror in their hearts) fear from Muhammad (pbuh) and his Companions, when they did not fear them at all before this (so that they ruined their houses) some of their houses (with their own hands) and throw its stones on the believers (and the hands of the believers) and they left some of their homes to the believers who destroyed them and threw their stones at them. (So learn a lesson, ye who have eyes!) learn a lesson, you who have insight in Religion, from what Allah has done to them concerning their exile.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { هُوَ ٱلَّذِيۤ أَخْرَجَ } بمقتضى عزته وحكمته المسرفين { ٱلَّذِينَ كَفَرُواْ } بالله وبرسوله، وهو إجلاء بني النضير، مع أنهم { مِنْ أَهْلِ ٱلْكِتَابِ مِن دِيَارِهِمْ } المألوفة، وأوطانهم المأنوسة زجراً عليهم، وتذليلاً له واقعاً إياهم { لأَوَّلِ ٱلْحَشْرِ } أي: في أول الحشر، إجلائهم الواقع عليهم بظهر الإسلام؛ إذ أجلى رسول الله صلى الله عليه وسلم بني النضير أولاً من المدنية إلى الشام، ثمَّ أجلى بقية الكفرة عمرُ رضي الله عنه في خلافته، انظروا كيف أخرجهم سبحانه بكمال قدرته وعزته، مع أنكم { مَا ظَنَنتُمْ } أيها المؤمنون من { أَن يَخْرُجُواْ } لشدتهم وشوكتهم، واستحكام آماكنهم وقلاعهم { وَ } هم أيضاً { ظَنُّوۤاْ أَنَّهُمْ مَّانِعَتُهُمْ حُصُونُهُم } أي: ظنهم لأنفسهم أن حصونهم تمنعهم { مِّنَ } بأس { ٱللَّهِ } المنتقم الغيور وبشطه وإن اشتد، لكن لم ينفعهم الحصون والقلاع حين نزول العذاب، بل { فَأَتَاهُمُ ٱللَّهُ } أي: القهر الهائل من لدنه { مِنْ حَيْثُ لَمْ يَحْتَسِبُواْ } أي: من صوب وجهة لم يتوقعوا\n\n\n\n\n{ وَ } ذلك أنه { قَذَفَ } وألقى سبحانه { فِي قُلُوبِهِمُ ٱلرُّعْبَ } الشديد، والخوف العظيم من غير قتال، وبسبب ذلك الرعب الهائل اخذوا { يُخْرِبُونَ بُيُوتَهُمْ بِأَيْدِيهِمْ } ضناً بها على المسلمين، وإخراج ما فيها من الأمتعة { وَأَيْدِي ٱلْمُؤْمِنِينَ } أيضاً، فإنهم أيضاً كانوا يخرجون بيوتهم إذلالاً لهم، وتوسيعاً لمضمار الحرب والقتال، وبالجملة: { فَٱعْتَبِرُواْ يٰأُوْلِي ٱلأَبْصَارِ } [الحشر: 2] واتعظوا بما جرى على هؤلاء الغواة الطغاة، يثقون بحصونهم ويشيدونها؛ ليتحصنوا بها من بأس الله، ثمَّ لما اضطروا أخذوا يخبرون بأيديهم ما يعتمدون عليه، ويستحفظون به؛ وذلك كمال قدرته الله ومتانة حكمته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nواللام في قوله: { لأول الحشر } متعلق بأخْرَج، وهو اللام في قوله:\n\n[الفجر: 24] أي: أخرجهم عند أول الحشر، وكونه أول الحشر لأنّ هذا أول حشرهم إلى الشام، وكانوا مِن سبط لم يُصبهم جلاء قط، وهم أول مَن أُخرج من أهل الكتاب من جزيرة العرب إلى الشام، وآخر حشرهم: إجلاء عُمر إياهم من خيبر إلى الشام، أو: آخر حشرهم: حشر يوم القيامة، قال ابن عباس رضي الله عنه: \" مَن شك أنَّ المحشر بالشام فليقرأ هذه الآية \" فهم الحشر الأول، وسائر الناس الحشر الثاني\n وقال لهم رسول الله صلى الله عليه وسلم لمّا خرجوا:\n\n \" امضوا، فإنكم أول الحشر ونحن على الأثر \" \n\n{ ما ظننتم أن يخرجوا } ، لشدة بأسهم، ومَنعَتهم، ووثاقه حصونهم، وكثرة عَددهم وعُدتهم، { وظنوا أنهم مانعتهم حُصُونُهم من الله } أي: ظنوا أنّ حصونهم تمنعهم من بأس الله\n والفرق بين هذا التركيب والنظم الذي جاء عليه التنزيل: أنّ في تقديم الخبر على المبتدأ دليلاً على فرط وُثوقهم بحصانتها ومنعها إياهم، وفي مصير ضميرهم اسماً لـ \" أن \" ، وإسناد الجملة إليه، دليل على اعتقادهم في أنفسهم أنهم في عزة ومنعة، لا يُبالَى معها بأحد يتعرض لهم، أو يطمع في مغازيهم، وليس ذلك في قولك: وظنوا أنّ حصونهم تمنعهم\n { فأتاهم اللهُ } أي: أمره وعقابه { من حيث لم يحتسبوا } من حيث لم يظنوا، ولم يخطر ببالهم، حتى قُتل \" كعب \" رئيسهم على يد أخيه رضاعاً\n { وقَذَفَ في قلوبهم الرُّعْبَ } الخوف والجزع، { يُخْربون بيوتَهم بأيديهم وأيدي المؤمنين } ، فكانوا يُخربون بواطنَها، والمسلمون ظواهرَها، لِمَا أراد الله مِن استئصال شأفتهم، وألاَّ تبقى لهم بالمدينة دار، ولا منهم دَيَّار\n والذي دعاهم إلى التخريب حاجتهم إلى الخشب والحجارة، ليسدُّوا بها أفواه الأزفَّة ولئلا يبقى بعد جلائهم مساكن للمسلمين، وأن ينقلوا معهم ما كان في أبنيتهم من جيّد الخشب والساج، وأمّا المؤمنون فدعاهم إلى التخريب إزالة مُتحصّنهم، وأن تتسع لهم مجال الحرب\n ومعنى تخريبهم إياها بأيدي المؤمنين: أنهم لما عرّضوهم بنكث العهد لذلك، وكان السبب فيه فكأنهم أمروهم به، وكلّفوهم إياه\n { فاعتبِروا يا أُولي الأبصارِ } أي: فاتعِظوا بما جرى عليهم من الأمور الهائلة على وجهٍ لا تهتدي إليه الأفكار، أو: فتأملوا فيما نزل بهؤلاء، والسبب الذي استحقوا به ذلك، فاحذروا أن تفعلوا مثَل فعلهم، فتُعاقََبوا مثل عقوبتهم\n قال البيضاوي: اتعِظوا بحالهم، فلا تغدروا ولا تعتمدوا على غير الله\n هـ\n وهذا دليل على جواز القياس",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:114",
      "similarity": 0.5682957732061265
    },
    {
      "verse": "3:151",
      "similarity": 0.25857535183592667
    },
    {
      "verse": "33:26",
      "similarity": 0.24421265044202412
    },
    {
      "verse": "8:12",
      "similarity": 0.19009064539096165
    },
    {
      "verse": "24:44",
      "similarity": 0.18668505079689732
    }
  ]
}