{
  "chapter": "الحشر",
  "text": "هو الله الخلق البارئ المصور له الاسماء الحسنى يسبح له ما فى السموت والارض وهو العزيز الحكيم",
  "translations": [
    {
      "translation": "He is Allah - the Creator, the Maker, the Giver of Form. To Him belong the Most Beautiful Names. Everything in the heavens and earth glorifies Him. He is the Almighty, the All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God, the Creator, the Maker, the Fashioner. His are all the names beautiful. Whatever is in the heavens and the earth sings His praises. He is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah, the Planner, Executer and Fashioner of creation. His are the names most beautiful. Whatever is in the heavens and the earth extols His Glory. He is the Most Mighty, the Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Creator, the Designer, the Modeler, and to Him belong all virtuous names. All that is in the heavens and the earth glorify Him. He is All-majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah only, Who is the Creator, the Initiator, the Designer of all – His only are all the good names; all whatever is in the heavens and in the earth proclaims His Purity; and He only is the Most Honourable, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah, Al-Khaliq, Al-Bari, Al-Musawwir. To Him belong the Best Names. All that is in the heavens and the earth glorify Him. And He is the Almighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah the Creator, the Maker, the Fashioner; His are the most excellent names; whatever is in the heavens and the earth declares His glory; and He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God, the Creator, the Maker, the Shaper. To Him belong the Names Most Beautiful. All that is in the heavens and the earth magnifies Him; He is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah, the Creator, the Shaper out of naught, the Fashioner. His are the most beautiful names. All that is in the heavens and the earth glorifieth Him, and He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God -- the Creator, the Originator, the Giver of Form. His are the most excellent names. Everything in the heavens and earth declares His glory. He is the Mighty, the Wise One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah, the Creator, the Maker, the Fashioner; His are the excellent names. Him halloweth whatsoever is in the heavens and the earth, and He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah, the Creator, the Maker, and the Former. To Him belong the Best Names. Whatever there is in the heavens and the earth glorifies Him and He is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah, the Creator, the Evolver, the Bestower of Forms (or Colours). To Him belong the Most Beautiful Names: whatever is in the heavens and on earth, doth declare His Praises and Glory: and He is the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah, the Creator, the Inventor of all things, the Bestower of forms. To Him belong the Best Names. All that is in the heavens and the earth glorify Him. And He is the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah, the Creator, the Originator, the Shaper. To Him belong the Most Beautiful Names. All that is in the heavens and earth exalt Him. He is theAlmighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God; the Creator, the Maker, the Designer. His are the Most Beautiful Names. Whatever is in the heavens and the earth glorifies Him. He is the Majestic, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah, the Creator, the Inventor, the Fashioner; to Him belong the best names. Whatever is in the heavens and earth is exalting Him. And He is the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:24] He is God, the Creator, the Maker, the Originator from nothing, the Shaper. To Him belong the, ninety nine, Most Beautiful Names, cited in hadīth (al-husnā is the feminine of al-ahsan). All that is in the heavens and   the earth glorify Him, and He is the Mighty, the Wise — already explained at the beginning of this [sūra].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He is Allah, the Creator) of sperms in the loins of fathers, (the Shaper out of naught) Who transforms them from one state to another, (the Fashioner) of what is in the wombs: i.e. whether it is a male or female, felicitous or damned; it is also said that this means: He Who places the spirit in the living being. (His are the most beautiful names) the most exalted attributes: knowledge, power, sight, hearing, etc., so call upon Him through these attributes. (All that is in the heavens) of creation (and the earth) all that is possessed of life (glorifieth Him) prays to Him; and it is also said this means: remembers Him, (and He is the Mighty) in retribution against those who disbelieve in Him, (the Wise) in His command and decree; He commanded that none should be worshipped except Him'. And of the surah is which \"She That Is To Be Examined\" is mentioned which is all Medinan and consists of 13 verses, 348 words and 1,510 letters: Surah 60: She That Is To Be Examined (al-Mumtahanah) And of the surah is which \"She That Is To Be Examined\" is mentioned which is all Medinan and consists of 13 verses, 348 words and 1,510 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكيف يشركون معه غيره أولئك المسرفون، مع أنه سبحانه { هُوَ ٱللَّهُ ٱلْخَالِقُ } المقصور المنحصر، المستقل على خلق الأشياء وتقديرها، وإيجادها وإظهارها من كتم العدم بمقتضى حكمته بالإرادة والاختيار { ٱلْبَارِىءُ } الموجد لها بمقتضى اسمه الرحمن بلا تفاوت ونقصان { ٱلْمُصَوِّرُ } الصور الأشياء وهياكلها وأشكالها على أبلغ نظام وأعجب شأن، ولا يشغله شأن عن شأن، بالجملة: { لَهُ ٱلأَسْمَآءُ ٱلْحُسْنَىٰ } التي لا تُعد ولا تُحصى، يتجلى على مقتضاها في كل آن في شأن؛ لذلك { يُسَبِّحُ لَهُ } مظاهر { مَا فِي ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } وينزهه على الدوام عن كل ما لا يليق بشأنه؟! { وَ } بالجملة: { هُوَ ٱلْعَزِيزُ } الغالب القادر على عموم ما أحاط به علمه { ٱلْحَكِيمُ } [الحشر: 24] المدبر المقتن على مقتضى علمه وإرادته بلا مدافعة أحد ومظاهرته\n\n\nجعلنا الله ممن تحقق بوحدة ذاته، وانكشف بكمالات أسمائه وصفاته\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها السالك المتحقق بمقر التوحيد، المكشف بوحدة الذات وكمالات الأسماء والصفات الذاتية الإلهية - مكنك الله في مقر عزك بلا تذبذب وتلوين - أن تطالع آثار أسمائه الحسنى، وصفاته العليا على صفحات الكائنات الغيبية والشهادية، وتعتبر منها حسب استعدادك، وقدر قابليتك الموعدة فيك من قِبَل الحق\n\n\n\n\nوإياك إياك أن تنحرف عن جادة العدالة الشرعية التي هي منتخبة عن العدالة الإلهية الواقعة بين مقتضيات أسمائه الذاتية، وصفاته العليَّة، فلك أن تطابق عموم أعمالك وأخلاقك وأطوارك عليها، بحيث لا تهمل شيئاً من دقائقها؛ إذ بقدر إهمالك من حدودها أحطت عن درجة التوحيد، ومرتبة أهل الوحدة الذاتية؛ إذ الشريعة إنما هي الوقاية الموضوعة بالوضع الإلهي بين الأنام؛ ليوفقهم الحق بها إلى دار السلام التي هي مقعد صدق الرضا والتسليم الذي هو أعلى مقامات العارفين، وأقصى حالات الموحدين المكاشفين\n\n\n\n\nهدانا الله وعموم عباده إلى سواء السبيل، وأعاذنا الله وإياهم عن الانحراف والتحويل بلطفه الجميل، وكرمه الجزيل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { هو اللهُ الخالقُ } المقدّر للأشياء على مقتضى حكمته، { البارىء } الموجد لها بريةً من التفاوت وقيل: المميِز بعضها من بعض بالأشكال المختلفة، { المُصَوِّر } الموجد لصورها وكيفيتها كما أراد\n قال الغزالي: الخالق من حيث إنه مُقدِّر، البارىء من حيث إنه مُوجد، المصوِّر، مِن حيث أنه مُصَوِّر صور المخترعات أحسن ترتيب، ومُزيّنها أحسن تزيين\n هـ\n قلت: وحاصل كلامه: أن الخالق يرجع للإرادة، والبارىء للقدرة، والمُصَوِّر للحكمة، والأحسن: أن يُقال: إنّ الخالق: المخترع للأشياء من غير أصل، البارىء: المهيىء كلَّ ممكن لقبول صورته، فهو من معنى الإرادة إذ متعلّقه التخصيص، المُصَوِّر: المُعطي كل مخلوق ما هيىء له من صورة وجوده بحكمته، فهو معاني اسمه \" الحكيم \"\n { له الأسماءُ الحسنى } لدلالتها على المعاني الحسنة، وتقدم عدها في آخر الإسراء\n { يُسبح له ما في السمواتِ والإرض } ينطق بتنزيهه عن جميع النقائص تنزيهًا ظاهرًا، { وهو العزيزُ } لا يُغلب، { الحكيمُ } الذي لايمكن الاعتراض عليه في شيء من تقديراته\n ختم السورة بما بدأ به من التسبيح\n عن أبي هريرة رضي الله عنه أنه قال: سألت حبيبي رسولَ الله صلى الله عليه وسلم عن اسم الله الأعظم؟ فقال:\n\n\n\n \" عليك بآخر الحشر، فأَكْثِر قراءته \" \n\n، فأعدتُ عليه، فأعاد عليّ فأعدت عليه، فأعاد عليّ، وعنه صلى الله عليه وسلم أنه قال:\n\n \" مَن قال حين يُصبح ثلاث مرات: أعوذ بالله السيمع العليم، من الشيطان الرجيم، وقرأ ثلاث آيات من آخر سورة الحشر، وكّلَ اللهُ سبعين ألف ملك يُصلُّون عليه حتى يُمسي، فإذا مات في ذلك اليوم مات شهيدًا، ومَن قالها حين يُمسي كان بتلك المنزلة \" \n\nرواه الترمذي\n وأسند ابن جزي حديثًا إلى\n\n \" عبد الله بن مسعود: أنه قال: قرأتُ على النبي صلى الله عليه وسلم فلما انتهيت إلى آخر الحشر، قال: \" ضع يدك على رأسك \" قلت: ولِمَ ذلك يا رسول الله؟ قال: أقرأني جبريلُ القرآنَ، فلما انتهيت إلى آخر الحشر، قال: ضع يدك على رأسك يا محمد، قلت: ولمَ ذاك؟ قال: إن الله تبارك وتعالى افتتح القرآن فضرب فيه، فلما انتهى إلى آخر الحشر، أمر الملائكة أن تضع يدها على رؤوسها، فقالت: يا ربنا ولِمَ ذلك؟ قال: لأنه شفاء من كل داء إلا السام \" \n\nوسمعتُ من شيخنا الفقيه الجنوي أنه حديث ضعيب، يعمل به الإنسان وحده، فإذا كان مع الناس تركه، لئلا تعتقد العامة أنه مندوب أو واجب\n هـ\n الإشارة: قد ذكرنا في تفسير الفاتحة الكبير كيفية التعلُّق والتخلُّق والتحقُّق بهذه الأسماء\n وقال الورتجبي: بيّن بقوله: \" الأسماء \" أنَّ لذاته النعوت والأسامي القديمة المقدسة عن الإشراك والإدراك، فلما ظهر بهذه الأوصاف أظهر أنوار صفاته في الآيات، وألبس أرواح نوره الأرواح والأشباح والأعصار والأدهار والشواهد والحوادث فسبّحه الكلُّ بألسنة نورية غيبية صفاتية، لقوله: { يُسبح له\n\n\n } الآية، قلت: أرواح نوره هي أسرار ذاته اللطيفة السارية في الأشباح والأرواح والجمادات وجميع الموجودات، التي بها قامت\n قال: ثم بيّن أنه منزّه بتنزيهه عن تنزيههم وإدراكهم وعلمهم بقوله: { وهو العزيز الحكيم } العزيز عن الإدراك، الحكيم في إنشاء الأقدار\n تعالى الله عما أشار إليه الواصف الحدثاني واللسان الإنساني\n هـ\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:6",
      "similarity": 0.637383248161017
    },
    {
      "verse": "64:3",
      "similarity": 0.5893472675694764
    },
    {
      "verse": "6:73",
      "similarity": 0.457964774941738
    },
    {
      "verse": "50:20",
      "similarity": 0.45602444322456154
    },
    {
      "verse": "40:64",
      "similarity": 0.453178077706091
    }
  ]
}