{
  "chapter": "الحشر",
  "text": "هو الله الذى لا اله الا هو علم الغيب والشهدة هو الرحمن الرحيم",
  "translations": [
    {
      "translation": "He is Allah - there is no god but Him. He is the Knower of the Unseen and the Visible. He is the All-",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God; there is no god but He, the knower of the unknown and the known. He is the benevolent, ever-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah: there is no god but He; the Knower of the unseen and the manifest, He is the Most Merciful, the Most Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God, the only Lord, Who knows the unseen and the seen. He is the Beneficent and All-merciful One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah, except Whom there is no God; the Knowing of all – the hidden and the evident; He only is the Most Gracious, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah, beside Whom La ilaha illa Huwa, the All-Knower of the unseen and the seen. He is the Most Gracious, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah besides Whom there is no god; the Knower of the unseen and the seen; He is the Beneficent, the Merciful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God; there is no god but He. He is the knower of the Unseen and the Visible; He is the All-merciful, the All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah, than Whom there is no other Allah, the Knower of the Invisible and the Visible. He is the Beneficent, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God: there is no deity save Him. He knows the unseen and the visible. He is the Compassionate, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah, there is no God but He; Knower of the unseen and the seen. He is the Compassionate, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah—there is no god except Him—Knower of the sensible and the Unseen, He is the All-beneficent, the All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He, than Whom there is no other god;- Who knows (all things) both secret and open; He, Most Gracious, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah, than Whom there is La ilaha illa Huwa (none has the right to be worshipped but He) the All-Knower of the unseen and the seen (open). He is the Most Beneficent, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah, there is no god except He. He knows the Unseen and the Visible. He is the Merciful, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God. There is no god but He, the Knower of secrets and declarations. He is the Compassionate, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah, other than whom there is no deity, Knower of the unseen and the witnessed. He is the Entirely Merciful, the Especially Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:22] He is God, than Whom there is no other god, Knower of the unseen and the visible, what is secret and what is proclaimed — He is the Compassionate, the Merciful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He is Allah, than whom there is no other God, the Knower of the invisible) the Knower of that which is hidden from people and that which will happen in the future (and the visible) and that which people know and has already happened. (He is the Beneficent) Who shows pity towards the righteous as well as towards the sinful through giving both provision, (the Merciful) specifically towards the believers through forgiving their sins and entering them into the Garden.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا تتذللون له سبحانه أيها الحمقى الهالكون، مع أنه سبحانه { هُوَ ٱللَّهُ } أي: الموجود الحق الحقيق { ٱلَّذِي لاَ إِلَـٰهَ } ولا موجود في الوجود { إِلاَّ هُوَ } الواحد الأحد الصمد، المستقل بالألوهية والربوبية { عَالِمُ ٱلْغَيْبِ وَٱلشَّهَادَةِ } على التفصيل الواقع في الواقع، بحيث لا يعزب عن حيطة علمه مثقال ذرة في الأرض ولا في السماء، ومع ذلك { هُوَ ٱلرَّحْمَـٰنُ } على عموم الأكوان بإفاضة الوجود عليهم وتربيتهم، وتدبير مصالحهم في النشأة الأولى { ٱلرَّحِيمُ } [الحشر: 22] لهم، يوصلهم إلى فضاء وحدته، وسعة جنته ورحمته في النشأة الأخرى؟!\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { هو اللهُ الذي لا إِله إِلاّ هو } وحده { عَالِمُ الغيبِ والشهادة } أي: ما غاب عن الحس من الأسرار القديمة، وما حضر له من الأجرام الحسية\n قال الورتجبي: أي: عالم بالمعلومات الغيبية قبل وجودها، وبعد وجودها، لا يزيد علمه بالغيب علمه بالعلانية، لا علمه بالعلانية علمه بالغيب\n هـ\n وتقديم الغيب على الشهادة لتقدُّمه في الوجود، وتعلُّق العلم القديم به، أو: المراد بالغيب: المعدوم، وبالشهادة: الموجود، أو السر والعلانية، { هو الرحمنُ الرحيم } أي: الرحمن بجلائل النِعم، والرحيم بدقائقها، أو: الرحمن بنعمة الإيجاد، والرحيم بنعمة الإمداد",
      "translations": []
    }
  ]
}