{
  "chapter": "الحشر",
  "text": "ولولا ان كتب الله عليهم الجلاء لعذبهم فى الدنيا ولهم فى الءاخرة عذاب النار",
  "translations": [
    {
      "translation": "If Allah had not prescribed banishment for them, He would have punished them in the dunya. But in the akhira they will have the punishment of the Fire.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God not decreed the expulsion for them He would have punished them in this world, and in the next the punishment of Hell would have been theirs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah had not decreed banishment for them, He would certainly have chastised them in this world. As for the Hereafter, the chastisement of the Fire awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God not decreed exile for them, He would have certainly punished them (in some other way). In this life and in the next life they would have suffered the torment of hell fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had Allah not decreed exile for them, He would have surely punished them in this world; and for them in the Hereafter is the punishment of the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had it not been that Allah had decreed exile for them, He would certainly have punished them in this world; and in the Hereafter theirs shall be the torment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had it not been that Allah had decreed for them the exile, He would certainly have punished them in this world, and in the hereafter they shall have chastisement of the fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God not prescribed dispersal for them, He would have chastised them in this world; and there awaits them in the world to come the chastisement of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah had not decreed migration for them, He verily would have punished them in the world, and theirs in the Hereafter is the punishment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God had not prescribed exile for them, He would surely have punished them in this world. But they shall have the torment of Fire in the Hereafter,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had not Allahg prescribed banishment for them, surely He would have tormented them in the world; and theirs in the Hereafter is the torment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah had not ordained banishment for them, He would have surely punished them in this world, and in the Hereafter, there is the punishment of the Fire for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had it not been that Allah had decreed banishment for them, He would certainly have punished them in this world: And in the Hereafter they shall (certainly) have the Punishment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had it not been that Allah had decreed exile for them, He would certainly have punished them in this world, and in the Hereafter theirs shall be the torment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it been that Allah had not decreed that they should be dispersed, He would have surely punished them in this world. And in the Everlasting Life thepunishment of the Fire awaits them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God not decreed exile for them, He would have punished them in this life. But in the Hereafter they will have the punishment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if not that Allah had decreed for them evacuation, He would have punished them in [this] world, and for them in the Hereafter is the punishment of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:3] And had God not prescribed, [had He not] decreed, banishment for them, departure from their homeland, He would have chastised them in this world, by having them killed or taken captive, as He did with the Jews of [Banū] Qurayza, and in the Hereafter there is for them the chastisement of the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if Allah had not decreed migration) from Medina to Historic Syria (for them) for the Banu'l-Nadir, (He verily would have punished them in this world) by exposing them to killing, (and theirs in the Hereafter is the punishment of the Fire) which is worse than being killed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدثنا علي بن أحمد\n قال: حدّثنا عطاء بن السّائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { وَلَوْلاَ أَن كَتَبَ ٱللَّهُ عَلَيْهِمُ ٱلْجَلاَءَ لَعَذَّبَهُمْ } معناه الخُروجُ من أرضٍ إلى أرضٍ\n وهو الحَشرُ\n ويقالُ: القَتلُ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\nHe said: \"Ali ibn Ahmad narrated to us.\"\n\n\n{And had it not been for Allah's decree of exile, He would have punished them} [means] moving from one land to another.\n\n\nAnd it is the Resurrection.\n\n\nIt is said that killing is",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { لَوْلاَ أَن كَتَبَ ٱللَّهُ } المصلح لأمور دنياهم\n ولم يفترض { عَلَيْهِمُ ٱلْجَلاَءَ } ولم يخرجهم من أوطانهم { لَعَذَّبَهُمْ فِي ٱلدُّنْيَا } بالقتل والأسر\n وأنواع الإذلال والصغار\n كما جرى على الكفرة المتمكنين في أمكانهم بعدهم { وَ } مع ذلك الإصلاح والكرامة لهم في الدنيا { لَهُمْ فِي ٱلآخِرَةِ عَذَابُ ٱلنَّارِ } [الحشر: 3] بواسطة إصرارهم على الكفر\n وإنكارهم على الإسلام\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولولا أن كتب اللهُ عليهم الجلاء } الخروج من الوطن\n على ذلك الوجه الفظيع { لعذَّبهم في الدنيا } بالقتل والسبي\n كما فعل ببني قريظة\n { ولهم في الآخرة عذابُ النار } الذي لا أشد منه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "91:3",
      "similarity": 0.881904713039709
    },
    {
      "verse": "92:2",
      "similarity": 0.881904713039709
    },
    {
      "verse": "7:143",
      "similarity": 0.346215306796173
    },
    {
      "verse": "7:187",
      "similarity": 0.3080104221830358
    },
    {
      "verse": "2:201",
      "similarity": 0.15733069228844368
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/59:3.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/59:3.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/59:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}