{
  "chapter": "الحشر",
  "text": "ما قطعتم من لينة او تركتموها قائمة على اصولها فباذن الله وليخزى الفسقين",
  "translations": [
    {
      "translation": "Whatever palm-trees you cut down, or left standing upright on their roots, it was done by Allah's permission in order to disgrace the deviators.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The palm trees that you cut down or left standing intact was by God's dispensation, so that He might disgrace the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The palm-trees that you cut down or those that you left standing on their roots, it was by Allah's leave that you did so. (Allah granted you this leave) in order that He might humiliate the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All the productive palm-trees (of the Jews hostile to you) which you cut down or left untouched were the will of God to bring disgrace upon the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The trees you had cut down or left standing on their roots was all by Allah’s permission, and in order to disgrace the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What you cut down of the Linah, or you left them standing on their stems, it was by leave of Allah, and in order that He might disgrace the rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever palm-tree you cut down or leave standing upon its roots, It is by Allah's command, and that He may abase the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever palm-trees you cut down, or left standing upon their roots, that was by God's leave, and that He might degrade the ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever palm-trees ye cut down or left standing on their roots, it was by Allah's leave, in order that He might confound the evil-livers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever palm trees you cut down or left standing on their roots, it was by God's leave, so that He might disgrace the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever fine palms ye cut down or left standing on roots there of, it was by the leave of Allah, and in order that He might abase the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever palm trees you cut down or left standing on their roots, it was by Allah’s will and in order that He may disgrace the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether ye cut down (O ye Muslim!) The tender palm-trees, or ye left them standing on their roots, it was by leave of Allah, and in order that He might cover with shame the rebellious transgresses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What you (O Muslims) cut down of the palm-trees (of the enemy), or you left them standing on their stems, it was by Leave of Allah, and in order that He might disgrace the Fasiqun (rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever palmtree you cut down or left standing upon its roots, it is by the permission of Allah, so that He might humiliate the impious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whether you cut down a tree, or leave it standing on its trunk, it is by God’s will. He will surely disgrace the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever you have cut down of [their] palm trees or left standing on their trunks - it was by permission of Allah and so He would disgrace the defiantly disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:5] Whatever palm-trees you cut down, O Muslims, or left standing on their roots, it was by God’s leave: He gave you the choice in this matter, and in order that, by giving [you] leave to cut them down, He might disgrace those who are immoral, the Jews, in return for their objection that the cutting down of productive trees was [deliberate] spoiling [of the land].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "The Prophet (pbuh) then ordered his Companions to cut down their palm-trees except a particular tree called the 'Ajwah, which he asked them not to cut down. When the Banu'l-Nadir reproached the believers for 657 doing so, Allah revealed: (Whatsoever palm-trees you cut down) other than the 'Ajwah palm-tree (or left standing on their roots) and did not cut down, i.e. the 'Ajwah, (it was by Allah's leave) both commands of cutting down and not cutting down are from Allah, (in order that He might confound the evil-livers) in order that He might humiliate the disbelievers, i.e. the Banu'l-Nadir, through that which you have cut down of their palm-trees.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَا قَطَعْتُمْ مِّن لِّينَةٍ } معناه من نَخلةٍ\n وهو ألوانُ النَّخلِ ما خلا العَجْوةُ أو البَرْنيّ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفسمع المؤمنون منهم ذلك، وأوجسوا في نفوسهم الكراهة، وعدم اللياقة، فنزلت: { مَا قَطَعْتُمْ } أيها المؤمنون { مِّن لِّينَةٍ } أي: من بعض نخلة من النخلات { أَوْ تَرَكْتُمُوهَا } بلا قطع شيء منها { قَآئِمَةً عَلَىٰ أُصُولِهَا } على ما كانت { فَبِإِذْنِ ٱللَّهِ } أي: القطع والترك كلاهما بأمر الله وحكمه { وَ } إنما أمركم بالقطع والحرق { لِيُخْزِيَ ٱلْفَاسِقِينَ } [الحشر: 5] أي: يرديهم ويذلهم بما غاظهم، ويضيق صدرهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:44",
      "similarity": 0.6048437495958942
    },
    {
      "verse": "34:10",
      "similarity": 0.4465887164197848
    },
    {
      "verse": "24:36",
      "similarity": 0.3298223069645599
    },
    {
      "verse": "37:64",
      "similarity": 0.32264878754373605
    },
    {
      "verse": "76:25",
      "similarity": 0.3192121238849953
    }
  ]
}