{
  "chapter": "الحشر",
  "text": "وما افاء الله على رسوله منهم فما اوجفتم عليه من خيل ولا ركاب ولكن الله يسلط رسله على من يشاء والله على كل شىء قدير",
  "translations": [
    {
      "translation": "Whatever booty from them Allah has given to His Messenger - and you spurred on neither horse nor camel in its acquisition, but Allah gives power to His Messengers over anyone He wills, Allah has power over all things -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You did not charge with horse or camel for whatever (spoils) God gave His Apostle from them. In any case, God gives authority to His Apostle over whomsoever He please. God has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever Allah has taken away from them and bestowed (as spoils) on His Messenger for which you spurred neither horses nor camels; but Allah grants authority to His Messengers over whomsoever He pleases. Allah has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Since you did not have to exhaust your horses and camels or (even fight), God granted to His Messenger their property. God gives authority to His Messenger over whomever He wants. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from them, the booty which Allah gave to His Noble Messenger – so you had not raced your horses or camels against them, but it is Allah Who gives whomever He wills within the control of His Noble Messengers; and Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what Allah gave as booty (Fai') to His Messenger from them -- for this you made no expedition with either cavalry or camelry. But Allah gives power to His Messengers over whomsoever He wills. And Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever Allah restored to His Apostle from them you did not press forward against it any horse or a riding camel but Allah gives authority to His apostles against whom He pleases, and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever spoils of war God has given unto His Messenger from them, against that you pricked neither horse nor camel; but God gives authority to His Messengers over whomsoever He will. God is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that which Allah gave as spoil unto His messenger from them, ye urged not any horse or riding-camel for the sake thereof, but Allah giveth His messenger lordship over whom He will. Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever God has given to His Messenger as spoils from them is by His grace; you spurred neither horse nor camel for them, but God gives power to His messengers over anyone He wills. God has power over all things --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as to that which Allah restored Unto His apostle from them, ye rushed neither horse nor camel upon it but Allah giveth His apostles mastery over whomsoever He will. And Allah Is -over everything potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The spoils that Allah gave to His Apostle from them, you did not spur any horse for its sake, nor any riding camel, but Allah makes His apostles prevail over whomever He wishes, and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What Allah has bestowed on His Messenger (and taken away) from them - for this ye made no expedition with either cavalry or camelry: but Allah gives power to His messengers over any He pleases: and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what Allah gave as booty (Fai') to His Messenger (Muhammad SAW) from them, for which you made no expedition with either cavalry or camelry. But Allah gives power to His Messengers over whomsoever He wills. And Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whatever spoils of war Allah has given to His Messenger from them, you hastened on neither horse nor camel against them, but Allah gives HisMessengers authority over whom He will. Allah is Powerful over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever God has bestowed upon His Messenger from them; you spurred neither horse nor camel for them, but God gives authority to His messengers over whomever He will. God is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what Allah restored [of property] to His Messenger from them - you did not spur for it [in an expedition] any horses or camels, but Allah gives His messengers power over whom He wills, and Allah is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:6] And whatever spoils God has given to His Messenger from these, you did not, O Muslims, spur for it any (min is extra) horses or camels, that is to say, you did not suffer any hardship in [securing] it, but God gives His messengers sway over whomever He will, and God has power over all things: hence you have no right to any of this [booty], rather it is exclusively for the Prophet (s) and those of the four categories mentioned with him in the next verse, [to be dispensed] in accordance with the way in which he used to divide it up, such that each would receive a fifth of the fifth and the rest being the Prophet’s (s), for him to do with as he pleases — thus he gave of it to the Emigrants and three from among the Helpers, on account of their poverty.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَا أَفَاءَ اللَّهُ عَلَى رَسُولِهِ مِنْهُمْ فَمَا أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلَا رِكَابٍ وَلَكِنَّ اللَّهَ يُسَلِّطُ رُسُلَهُ عَلَى مَنْ يَشَاءُ وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (6)يجوز أن يكون عطفاً على جملة { ما قطعتم من لينة } \\[ الحشر : 5 \\] الآية فتكون امتناناً وتكملة لمصارف أموال بني النضير .ويجوز أن تكون عطفاً على مجموع ما تقدم عطفَ القصة على القصة والغرض على الغرض للانتقال إلى التعريف بمصير أموال بني النضير لئلا يختلف رجال المسلمين في قسمته . ولبيان أن ما فعله الرسول صلى الله عليه وسلم في قسمة أموال بني النضير هو عدلٌ إن كانت الآية نزلت بعد القسمة وَمَا صْدَقُ { ما أفاء الله } هو ما تركوه من الأرض والنخل والنقض والحطب .والفَيء معروف في اصطلاح الغزاة ، ففعل أفاء أعطَى الفيء ، فالفيء في الحروب والغارات ما يظفر به الجيْشُ من متاع عدوّهم وهو أعم من الغنيمة ولم يتحقق أيمة اللغة في أصل اشتقاقه فيكون الفيء بقتال ويكون بدون قتال ، وأما الغنيمة فهي ما أخذ بقتال .وضمير { منهم } عائد إلى { الذي أخرج الذين كفروا من أهل الكتاب } \\[ الحشر : 2 \\] الواقع في أول السورة وهم بنو النضير . وقيل : أريد به الكفار ، وأنه نزَّلَ في فيء فدك فهذا بعيد ومخالف للآثار .وقوله : { فما أوجفتم عليه } خبر عن ( ما ) الموصولة قرن بالفاء لأن الموصول كالشرط لتضمنه معنى التسبب كما تقدم آنفاً في قوله : { فبإذن الله } \\[ الحشر : 5 \\] .وهو بصريحه امتنان على المسلمين بأن الله ساق لهم أموال بني النضير دون قتال ، مثل قوله تعالى : { وكفى الله المؤمنين القتال } \\[ الأحزاب : 25 \\] ، ويفيد مع ذلك كناية بأن يقصد بالإِخبار عنه بأنهم لم يُوجفوا عليه لازمُ الخبر وهو أنه ليس لهم سبب حقَ فيه . والمعنى : فما هو من حقّكم ، أو لا تسألوا قسمته لأنكم لم تنالوه بقتالكم ولكن الله أعطاه رسوله صلى الله عليه وسلم نعمة منه بلا مشقة ولا نصَب .والإِيجاف : نوع من سَير الخيل . وهو سَير سريع بإِيقاع وأريد به الركض للإِغارة لأنه يكون سريعاً .والركابُ : اسم جمع للإِبل التي تُرْكبُ . والمعنى : ما أغرتم عليه بخيل ولا إبل .وحرف ( على ) في قوله تعالى : { فما أوجفتم عليه } للتعليل ، وليس لتعدية { أوجفتم } لأن معنى الإِيجاف لا يتعدى إلى الفيء بحرف الجر ، أو متعلقٌ بمحذوف هو مصدر { أوجفتم } ، أي إيجافاً لأجله .و { مِن } في قوله : { من خيل } زائدة داخلة على النكرة في سياق النفي ومدخول { مِن } في معنى المفعول به ل { أوجفتم } أي ما سقتم خيلاً ولا ركاباً .وقوله : { ولكن الله يسلط رسله على من يشاء } استدراك على النفي الذي في قوله تعالى : { فما أوجفتم عليه } لرفع توهم أنه لا حقّ فيه لأحد . والمراد : أن الله سلط عليه رسوله صلى الله عليه وسلم فالرسول أحق به . وهذا التركيب يفيد قصراً معنوياً كأنه قيل : فما سلطكم الله عليهم ولكن سلط عليهم رسوله صلى الله عليه وسلموفي قوله تعالى : { ولكن الله يسلط رسله على من يشاء } إيجاز حذف لأن التقدير : ولكن الله سلط عليهم رسوله صلى الله عليه وسلم والله يسلط رُسله على من يشاء وكان هذا بمنزلة التذييل لعمومه وهو دال على المقدر .وعموم { من يشاء } لشمول أنه يسلط رسله على مقاتلين ويسلطهم على غير المقاتلين .والمعنى : وما أفاء الله على رسوله صلى الله عليه وسلم إنما هو بتسليط الله رسوله صلى الله عليه وسلم عليهم ، وإلقاء الرعب في قلوبهم والله يسلط رسله على من يشاء . فأغنى التذييل عن المحذوف ، أي فلا حقّ لكم فيه فيكون من مال الله يتصرّف فيه رسوله صلى الله عليه وسلم وولاة الأمور من بعده .فتكون الآية تبييناً لما وقع في قسمة فيء بني النضير . ذلك أن رسول الله صلى الله عليه وسلم لم يقسمه على جميع الغُزاة ولكن قسمه على المهاجرين سواء كانوا مِمَّن غزوا معهُ أم لم يغزوا إذ لم يكن للمهاجرين أموالٌ . فأراد أن يكفيهم ويكفي الأنصار ما مَنحوه المهاجرين من النخيل . ولم يعط منه الأنصار إلا ثلاثة لشدة حاجتهم وهم أبو دَجانة ( سِماك بن خزينة ) ، وسَهلُ بن حنيف ، والحارث بن الصِّمَّة . وأعطى سعد بنَ معاذ سيفَ أبي الحُقيق ، وكل ذلك تصرّف باجتهاد الرسول صلى الله عليه وسلم لأن الله جعل تلك الأموال له .فإن كانت الآية نزلت بعد أن قسمت أموال النضير كانت بياناً بأن ما فعله الرسول صلى الله عليه وسلم حقٌّ ، أمره الله به ، أو جعله إليه ، وإن كانت نزلت قبل القسمة ، إذ روي أن سبب نزولها أن الجيش سألوا رسول الله صلى الله عليه وسلم تخميس أموال بني النضير مثل غنائم بدر فنزلت هذه الآية ، كانت الآية تشريعاً لاستحقاق هذه الأموال .قال أبو بكر ابن العربي : «لا خلاف بين العلماء أن الآية الأولى خاصة لرسول الله صلى الله عليه وسلم أي هذه الآية الأولى من الآيتين المذكورتين في هذه السورة خاصة بأموال بني النضير ، وعلى أنها خاصة لرسول الله صلى الله عليه وسلم يضعها حيث يشاء . وبذلك قال عمر بن الخطاب بمحضر عثمان ، وعبد الرحمان بن عوف ، والزبير ، وسعد ، وهو قول مالك فيما روَى عنه ابن القاسم وابن وهب . قال : كانت أموال بني النضير صافية لرسول الله صلى الله عليه وسلم واتفقوا على أن النبي صلى الله عليه وسلم لم يخمسها . واختُلف في القياس عليها كل مال لم يوجف عليه . قال ابن عطية : قال بعض العلماء وكذلك كل ما فتح الله على الأيمة مما لم يوجف عليه فهو لهم خاصة ا ه . وسيأتي تفسير ذلك في الآية بعدها .\n\n",
      "translations": [
        {
          "translation": "(And that which Allah gave as spoil unto His messenger from them) from Banu'l-Nadir, it is solely for the Messenger of Allah (pbuh) and there is nothing in it for you, (ye urged not) you did not use (any horse or riding-camel for the sake thereof) but you walked to it, for it was very close to Medina, (but Allah giveth His messenger) Muhammad (pbuh) (lordship over whom He will) the Banu'l-Nadir. (Allah is Able to do all things) in terms of giving help and spoils.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَمَآ أَوْجَفْتُمْ عَلَيْهِ مِنْ خَيْلٍ وَلاَ رِكَابٍ } فالإيجافُ: السَّيرُ إلى الأَعداءِ\n والرِّكابُ: الإِبلُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allaah (swt): {But you did not attack him with any horses or riders} - meaning: marching towards the enemy.\n\n\n{And} the riders: the camels.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلموا أيها المؤمنون أن { مَآ أَفَآءَ ٱللَّهُ } أي: ردّ الله وأعطاه { عَلَىٰ رَسُولِهِ مِنْهُمْ } أي: من يهود بني النضير من الأموال والعقار فهو لرسول الله خاصة خالصة\n له أن يفعل به حيث شاء بلا حق لكم فيها\n ليس مثل سائر الغنائم { فَمَآ أَوْجَفْتُمْ } وأجريتم { عَلَيْهِ } أي: على تحصيله { مِنْ خَيْلٍ وَلاَ رِكَابٍ } نجائب الإبل\n إذ هم مشوا إلى بني النضير رجالاً لا فرساناً\n وكانت المسافة ميلين من المدينة\n ومع ذلك لا يقاتلون معهم مقاتلتكم مع سائر الكفرة { وَلَـٰكِنَّ ٱللَّهَ } المنتقم الغيور { يُسَلِّطُ رُسُلَهُ عَلَىٰ مَن يَشَآءُ } من المستوجبين للطرد والمقت بلا وسائل القتال والحراب\n بل يقذف الرعب\n وإلقاء الخوف في قلوبهم وغير ذلك من الأمور الخارقة للعادة\n الموجبة للهزيمة\n لا عن شيء { وَٱللَّهُ } القادر المتقدر { عَلَىٰ كُلِّ شَيْءٍ } موجب لقهر أعدائه\n ونصر أوليائه { قَدِيرٌ } [الحشر: 6] سواء وافق العادة أو لا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: جملة { وما أفاء }: شرطية معطوفة على مثلها\n وهو: { ما قطعتم\n\n } الآية\n وكلتاهما إخبار وإعلام\n أي: اعلموا أن ذلك القطع والترك كان بإذن الله\n وذلك الفيء كان بتسليط الله لا بسعيكم\n لكنه لم يُعلم منه كيفية القسمة\n فبيّنها بعدُ بقوله: { وما أفاء الله على رسوله\n\n\n } الخ\n وقيل: غير ذلك على ما سيأتي\n يقول الحق جلّ جلاله: { وما أفاء الله على رسوله منهم } أي: ما أعاده الله من مالهم\n وفيه إشعار بأنه كان حقيقاً بأن يكون له صلى الله عليه وسلم\n وإنما وقع في أيديهم بغير حق\n فردّه الله تعالى إلى مستحقه\n لأنه تعالى خلق الناس لعبادته\n وخَلَقَ ما خَلَقَ ليتوسَلوا به إلى طاعته\n فهو جديرٌ بأن يكون للمؤمنين\n { فما أوجفتمْ عليه } أي: فما أجريتم على تحصيله وتغنيمه\n من: الوجيف\n وهو: سرعة السير\n و \" مِن \" في قوله: { مِن خَيْلَ ولا رِكابٍ } زائدة لتأكيد النفي\n أي: فما أجريتم على تحصيله خيلاً ولا ركاباً\n وهو ما يركب من الإبل خاصة\n كما أنَّ الراكب عندهم راكبها لا غير\n وأمّا راكب الفرس فإنما يُسمونه فارساً\n ولا واحد لها من لفظها\n وإنما الواحد منها: راحلة\n والمعنى: ما قطعتم لها شقةً بعيدة\n ولا لقيتم مشقة شديدة\n وذلك لأن قُراهم كانت على ميلين من المدينة\n فمشوا إليها مشياً\n وما كان فيهم إلاَّ النبي صلى الله عليه وسلم فَفَتَحَها صُلحاً\n كأنه قيل: ما أفاء الله على رسوله فما حصَّلتموه بكد اليمين ولا بعرق الجبين\n { ولكنَّ اللهَ يُسَلِّطُ رسلَه على مَن يشاء } أي: ولكن جرت سنّة الله أن يُسلّط رسلَه على مَن يشاء من أعدائهم\n وقد سلّط رسولَه صلى الله عليه وسلم تسليطاً غير معتاد من غير أن تقتحموا الخطوب\n وتُقاسموا شدائد الحروب\n فلا حقّ لكم في أموالهم\n { واللهُ على كل شيء قدير } يفعل ما يشاء\n تارة على الوجوه المعهودة\n وأخرى على غيرها\n ثم بيّن قسمة الفيء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "79:8",
      "similarity": 0.7094323446504067
    },
    {
      "verse": "49:9",
      "similarity": 0.26965934891712395
    },
    {
      "verse": "2:226",
      "similarity": 0.2563893161556237
    },
    {
      "verse": "16:48",
      "similarity": 0.2294397302123985
    },
    {
      "verse": "59:7",
      "similarity": 0.1856706405188042
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/059006.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/059006.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/59:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}