{
  "chapter": "الحشر",
  "text": "ما افاء الله على رسوله من اهل القرى فلله وللرسول ولذى القربى واليتمى والمسكين وابن السبيل كى لا يكون دولةۢ بين الاغنياء منكم وما ءاتىكم الرسول فخذوه وما نهىكم عنه فانتهوا۟ واتقوا۟ الله ان الله شديد العقاب",
  "translations": [
    {
      "translation": "whatever booty Allah gives to His Messenger from city dwellers belongs to Allah and to the Messenger and to near relatives and orphans and the very poor and travellers, so that it does not become something which whatever he forbids you you should forgo. Have taqwa of Allah - Allah is severe in retribution.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever booty God gives to His Apostle from the people of the cities, is for God and His Apostle, the near relations, the orphans, the needy and wayfarers, so that it does not concentrate in the hands of those who are rich among you. Accept what the Apostle gives you, and refrain from what he forbids, and take heed for yourself and fear God. Surely God is severe of retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever (from the possessions of the towns people) Allah has bestowed on His Messenger belongs to Allah, and to the Messenger, and to his kinsfolk, and to the orphans, and to the needy, and to the wayfarer so that it may not merely circulate between the rich among you. So accept whatever the Messenger gives you, and refrain from whatever he forbids you. And fear Allah: verily Allah is Most Stern in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever God grants to His Messenger (out of the property) of the people of the towns, belongs to God, the Messenger, the kinsfolk, the orphans, the destitute and to those who may become needy while on a journey, so that it will not circulate only in the hands of rich ones among them. Take only what the Messenger gives to you and desist from what he forbids you. Have fear of God; God is severe in His retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The booty which Allah gave to His Noble Messenger from the people of the townships, is for Allah and His Noble Messenger, and for the relatives, and the orphans, and the needy and the travellers – so that it does not become the wealth of the rich among you; and accept whatever the Noble Messenger gives you; and refrain from whatever he forbids you; and fear Allah; indeed Allah’s punishment is severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What Allah gave as booty (Fai') to His Messenger from the people of the townships -- it is for Allah, His Messenger, the kindred, the orphans, the poor, and the wayfarer, in order that it may not become a fortune used by the rich among you. And whatsoever the Messenger gives you, take it; and whatsoever he forbids you, abstain (from it). And have Taqwa of Allah, verily, Allah is Severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever Allah has restored to His Apostle from the people of the towns, it is for Allah and for the Apostle, and for the near of kin and the orphans and the needy and the wayfarer, so that it may not be a thing taken by turns among the rich of you, and whatever the Apostle gives you, accept it, and from whatever he forbids you, keep back, and be careful of (your duty to) Allah; surely Allah is severe in retributing (evil):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever spoils of war God has given to His Messenger from the people of the cities belongs to God, and His Messenger, and the near kinsman, orphans, the needy and the traveller, so that it be not a thing taken in turns among the rich of you. Whatever the Messenger gives you, take; whatever he forbids you, give over. And fear God; surely God is terrible in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That which Allah giveth as spoil unto His messenger from the people of the townships, it is for Allah and His messenger and for the near of kin and the orphans and the needy and the wayfarer, that it become not a commodity between the rich among you. And whatsoever the messenger giveth you, take it. And whatsoever he forbiddeth, abstain (from it). And keep your duty to Allah. Lo! Allah is stern in reprisal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whatever gains God has assigned to His Messenger from the inhabitants of the town is for God and for the Messenger and for his kinsfolk and for orphans and the needy and the wayfarer, so that they may not become the property of those of you who are rich. Whatever the Messenger gives you, take it; and whatever he forbids you, abstain from it. Fear God; surely, God is severe in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever Allah may restore Unto His apostle from the people of the cities is due Unto Allah and Unto the apostle and Unto the near of kin and the orphans and the needy and the wayfarer, so that it may not be confined to the rich among you. And whatsoever the apostle giveth you, take; and whatsoever he forbiddeth you, refrain from. And fear Allah; verily Allah is Stern in chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The spoils that Allah gave to His Apostle from the people of the townships, are for Allah and the Apostle, the relatives and the orphans, the needy and the traveller, so that they do not circulate among the rich among you. Take whatever the Apostle gives you, and refrain from whatever he forbids you, and be wary of Allah. Indeed Allah is severe in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What Allah has bestowed on His Messenger (and taken away) from the people of the townships,- belongs to Allah,- to His Messenger and to kindred and orphans, the needy and the wayfarer; In order that it may not (merely) make a circuit between the wealthy among you. So take what the Messenger assigns to you, and deny yourselves that which he withholds from you. And fear Allah; for Allah is strict in Punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What Allah gave as booty (Fai') to His Messenger (Muhammad SAW) from the people of the townships, - it is for Allah, His Messenger (Muhammad SAW), the kindred (of Messenger Muhammad SAW), the orphans, Al-Masakin (the poor), and the wayfarer, in order that it may not become a fortune used by the rich among you. And whatsoever the Messenger (Muhammad SAW) gives you, take it, and whatsoever he forbids you, abstain (from it), and fear Allah. Verily, Allah is Severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The spoils of war taken from the villagers and given by Allah to His Messenger belong to Allah, His Messenger and the near kinsmen, the orphans, the needy and the destitute traveler, so that it is not something taken in turns by the rich among you. Whatever the Messenger gives you, accept it; and whatever he forbids you, abstain. And fear Allah; surely, Allah is Stern in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever God restored to His Messenger from the inhabitants of the villages belongs to God, and to the Messenger, and to the relatives, and to the orphans, and to the poor, and to the wayfarer; so that it may not circulate solely between the wealthy among you. Whatever the Messenger gives you, accept it; and whatever he forbids you, abstain from it. And fear God. God is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what Allah restored to His Messenger from the people of the towns - it is for Allah and for the Messenger and for [his] near relatives and orphans and the [stranded] traveler - so that it will not be a perpetual distribution among the rich from among you. And whatever the Messenger has given you - take; and what he has forbidden you - refrain from. And fear Allah; indeed, Allah is severe in penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:7] Whatever spoils God has given to His Messenger from the people of the towns, such as al-Safrā’, Wādī alQurā and Yanbu‘, belong to God, dispensing with it as He will, and to the Messenger and to the near of kin, the Prophet’s kin, from among the Banū Hāshim and the Banū al-Muttālib, and the orphans, the [orphaned] children of Muslims, those whose parents have died and who are impoverished, and the needy, those Muslims in need, and the traveller, the Muslim who may be cut off [from all resources] on a remote journey: in other words, they [these spoils] are the due of the Prophet (s) and [those of] the four categories, divided up in the way that he used to, where each category received a fifth of the fifth, with the rest being his [the Prophet’s], so that these, the spoils — this being the justification for the division of these [spoils] in this way, do not (kay-lā: kay functions like lā with a following implied an [sc. an-lā]) become a thing circulating, handed round, between the rich among you. And whatever the Messenger gives you, of spoils or otherwise, take it; and whatever he forbids you, abstain [from it]. And fear God. Surely God is severe in retribution.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That which Allah giveth as spoil unto His messenger from the people of the townships) of 'Uraynah, Qurayzah, Banu'l-Nadir, Fadak and Khaybar, (it is for Allah) specifically and there is nothing in it for you (and His messenger) the command of the Messenger of Allah (pbuh) regarding this is permissible, and this is why he made the spoils of Fadak and Khaybar an endowment for the needy people; it remained under his control during his lifetime, and after his death it came under the control of Abu Bakr al-Siddiq, and after him under 'Umar, 'Uthman and 'AN respectively exactly as it was under the control of the Prophet (pbuh) and it remains so to this day. The Prophet (pbuh) also divided the spoils of Banu Qurayzah and Banu'l-Nadir on the poor from among the Emigrants (al-Muhajirun), he gave them according to their need and the need of their dependents (and for the near of kin) and he gave some of it to the needy among the Banu 'Abd al-Muttalib (and the orphans) and he gave some of it to the orphans, other than the orphans of Banu 'Abd al-Muttalib (and the needy) and gave some of it to the needy, other than the needy of the Banu 'Abd al-Muttalib (and the wayfarer) the guest and the passer-by, (that it become not a commodity) a division (between the rich among you) between the strong among you. (And whatsoever the messenger giveth you) of spoils, (take it) accept it; it is also said that this means: whatever the messenger commands you, act upon it. (And whatsoever he forbideth, abstain (from it). And keep your duty to Allah) fear Allah in that which He commanded you. (Lo! Allah is stern in reprisal) when He punishes; this is because they said to the Prophet (pbuh): \"Take your share of the spoils and leave us to deal with the rest of it\".\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كَيْ لاَ يَكُونَ دُولَةً بَيْنَ ٱلأَغْنِيَآءِ مِنكُمْ } فالدُّولةُ: في المُلكِ والسَّيرُ التي تُغيرُ وتُبدلُ\n والدَّولةُ بفتح الدَّالِ في الجَيشِ\n يَهزمُ هذا ثم يُهزم الهَازِمُ\n فيقال قد رَجعتْ الدَّولةُ عَلى هؤلاء\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {So that there will not be a nation amongst the rich from amongst you}, so the state: is in the kingship and the changeable and changeable succession.\n\n\nAnd the state, by opening its borders to the army,\n\n\n\n\nThis will be defeated, then the defeated will be defeated.\n It is said that the state has returned to these people",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وما آتاكم الرسول فخذوه وما نهاكم عنه فانتهوا } لأنه متحقق بالله فكل ما أمر به فهو أمر الله وما نهى عنه نهي الله لقوله:\n[النجم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { مَّآ أَفَآءَ ٱللَّهُ عَلَىٰ رَسُولِهِ مِنْ } أموال { أَهْلِ ٱلْقُرَىٰ } الهالكة بالغلبة والاستيلاء بلا مقاتلة وحراب { فَلِلَّهِ وَلِلرَّسُولِ } سهم { وَلِذِي ٱلْقُرْبَىٰ } من بني هاشم وبني المطلب سهم { وَٱلْيَتَامَىٰ وَٱلْمَسَاكِينِ وَٱبْنِ ٱلسَّبِيلِ } سهام\n وإنما قسم سبحانه مال الفيء بنفسه { كَيْ لاَ يَكُونَ } الفيء الذي حقه أن يصل إلى الفقراء { دُولَةً } متداولة { بَيْنَ ٱلأَغْنِيَآءِ مِنكُمْ } ورؤسائكم\n كما هو عادة الجاهلية الأولى { وَ } بعدما قسم سبحانه في كتابه { مَآ آتَاكُمُ } وأعطاكم { ٱلرَّسُولُ } المستخلف منه سبحانه { فَخُذُوهُ } بلا مراء ومجادلة معه { وَمَا نَهَاكُمْ عَنْهُ } بإذن الله { فَٱنتَهُواْ } أيضاً عنه بلا مكابرة وإصرار { وَ } بالجملة: { ٱتَّقُواْ ٱللَّهَ } عن مخالفة أمره\n وأمر رسوله النائب عنه\n واحذروا عن بطشه وانتقامه { إِنَّ ٱللَّهَ } القادر على وجوه الانتقام { شَدِيدُ ٱلْعِقَابِ } [الحشر: 7] على من خرج من ربقة عبوديته\n ومقتضى ألوهيته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { ما أفاء اللهُ على رسوله من أهل القُرى } \n فلم يدخل العاطف لأنَّ الجملة بيان للأولى\n وقيل: الأولى نزلت في أموال بني النضير\n وقد جعلها الله لرسوله خاصة\n فقسمها على المهاجرين\n ولم يُعط الأنصارَ منها\n إلاّ لثلاثة\n لفقرهم\n أبو دُجانة\n وسهل بن حنيف\n والحارث بن الصمة\n والثانية: نزلت في كل قريةٍ فُتحت عنوة\n وهو الظاهر\n فقال في بيان مصرف الفيء: { فللّه وللرسول ولذي القربى واليتامى والمساكين وابن السبيل }\n واختلف في قسمته\n فقيل: يُسدس لظاهر الآية\n ويُصرف سهم الله إلى عمارة الكعبة وسائر المساجد\n وقيل: يُخمس\n وذكر الله للتعظيم\n ويُصرف سهم الرسول للإمام على قولٍ\n وإلى العساكر والثغور على قولٍ\n وإلى مصالح المسلمين على قولٍ\n\nوقد تقدّم في سورة الأنفال تحقيقه\n وإنما بيّنا قسمته\n { كي لا يكون دُولَة } أي: كي لا يكون الفيء الذي حقه أن يكون للفقراء يعيشون به { دُولة بين الأغنياء منكم } أي: يتداوله الأغنياء بينهم\n ويختصُّون به\n والدولة: ما يدول للإنسان\n أي: ما يدور له من الغنى والجدّ والغلبة وغيرها\n وقيل: الدولة - بالفتح - من المُلك\n وبالضم من المِلك - بالكسر-\n { وما آتاكم الرسولُ } أي: ما أعطاكموه من الفيء أو من الأمر\n { فَخُذوه } فاقبلوه\n أو: افعلوه\n فإنه واجب\n { وما نهاكم عنه } أي: عن أخذه\n أو عن تعاطيه { فانتهوا } عنه\n ولا تطلبوه\n أو: لا تفعلوه\n لَمَّا خصّ عليه السلام المهاجرين بفيء بني النضير وما حولها من القرى\n قالت الأنصار: لنا معهم سهم\n فنزلت { واتقوا الله } في مخالفته عليه السلام\n { إنَّ الله شديدُ العقاب } لمَن خالف رسولَه صلى الله عليه وسلم\n والأحسن: أن يكون عاماً في كل ما جاء به الرسول\n والفيء داخل في العموم\n الإشارة: العلم على قسمين علم وهبي إلهي\n يفيض على رسول القلب\n بمحض الفضل والجود\n وهو ما يختص بأسرار الربوبية فهذا يختص به صاحبه\n ولا يبذله لغيره إلاّ مَن بذل نفسه له\n وإليه تُشير الآية الأولى\n وعلم كسبي\n يُكتسب بالجد والتشمير في تعلُّمه وأخذه\n فهذا يجب بذله لعامة الناس وخاصتهم\n وإليه تشير الآية الثانية\n وإنما اختص علم السر بأهله كي لا يكون دُولة بين الأغنياء من أهل الظاهر\n فيُبتذل ويُشتهر\n وهو فساد نظام العالم\n وقوله تعالى: { وما آتاكم الرسولُ فخُذوه } قال القشيري: هذا أصل في وجوب متابعة الرسول\n ولزوم طريقته وسنته\n على ما في العلم تفصيله\n والواجبُ على العبد عَرْضُ ما وقع له من الخواطر\n ويُكاشَفُ به من الأحوالِ\n على العلم\n فما لم يقبله الكتاب والسنّة فهو ضلال\n هـ\n ثم بيّن المساكين المذكورين قبلُ\n فقال: { لِلْفُقَرَآءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُواْ مِن دِيَارِهِمْ وَأَمْوَالِهِمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:140",
      "similarity": 0.5009200608880097
    },
    {
      "verse": "49:9",
      "similarity": 0.26059973767945993
    },
    {
      "verse": "33:50",
      "similarity": 0.251605771201575
    },
    {
      "verse": "2:226",
      "similarity": 0.24530387639843382
    },
    {
      "verse": "16:48",
      "similarity": 0.22059570471272238
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/59:7.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/59:7.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/59:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}