{
  "chapter": "الحشر",
  "text": "للفقراء المهجرين الذين اخرجوا۟ من ديرهم وامولهم يبتغون فضلا من الله ورضونا وينصرون الله ورسوله او۟لئك هم الصدقون",
  "translations": [
    {
      "translation": "It is for the Door of the Muhaiirun who were driven from their homes and wealth desirina the favour and the pleasure of Allah and supporting Allah and His Messenger. Such people are the truly sincere.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The spoils are also for the poor emigrants who were deprived of their homes and possessions and are seeking the bounty and protection of God, and are helping God and His Apostle. They are the ones who are true of word and deed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It also belongs to the poor Emigrants who have been driven out of their homes and their possessions, those who seek Allah's favour and good pleasure and help Allah and His Messenger. Such are the truthful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The poor immigrants who were deprived of their homes and property, who seek favors and pleasures from God, and help Him and His Messenger will also have (a share in the said property). These people are the truthful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (the booty is) also for the poor migrants who were expelled from their homes and their wealth, seeking Allah’s munificence and His pleasure, and aiding Allah and His Noble Messenger; it is they who are the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And there is also a share in this booty) for the poor emigrants, who were expelled from their homes and their property, seeking bounties from Allah and (His) good pleasure, and helping Allah and His Messenger. Such are indeed the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It is) for the poor who fled their homes and their possessions, seeking grace of Allah and (His) pleasure, and assisting Allah and His Apostle: these it is that are the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is for the poor emigrants, who were expelled from their habitations and their possessions, seeking bounty from God and good pleasure, and helping God and His Messenger; those -- they are the truthful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (it is) for the poor fugitives who have been driven out from their homes and their belongings, who seek bounty from Allah and help Allah and His messenger. They are the loyal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is for the poor refugees who were driven from their homes and possessions, desiring the favour and the pleasure of God and supporting God and His Messenger. Such people are the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is due Unto the poor Muhajirs who have been driven forth from their homes and their substance, seeking grace from Allah and His goodwill and succouring Allah and His apostle. These! they are the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[They are also] for the poor Emigrants who have been expelled from their homes and [wrested of] their possessions, who seek grace from Allah and [His] pleasure and help Allah and His Apostle. It is they who are the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Some part is due) to the indigent Muhajirs, those who were expelled from their homes and their property, while seeking Grace from Allah and (His) Good Pleasure, and aiding Allah and His Messenger: such are indeed the sincere ones:-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And there is also a share in this booty) for the poor emigrants, who were expelled from their homes and their property, seeking Bounties from Allah and to please Him. And helping Allah (i.e. helping His religion) and His Messenger (Muhammad SAW). Such are indeed the truthful (to what they say);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(A share of the spoils shall also be given) to the poor emigrants who were expelled from their homes and their possessions, who seek the Favor and Pleasure of Allah, and help Allah and His Messenger. These are they that are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the poor refugees who were driven out of their homes and their possessions, as they sought the favor of God and His approval, and came to the aid of God and His Messenger. These are the sincere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the poor emigrants who were expelled from their homes and their properties, seeking bounty from Allah and [His] approval and supporting Allah and His Messenger, [there is also a share]. Those are the truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:8]   [At] the poor Emigrants (li’l-fuqarā’i is semantically connected to an omitted [verb], that is to say, a-‘ajibū, ‘What! Do they marvel [at the poor Emigrants]’) who have been driven away from their homes and their possessions that they should seek bounty from God and beatitude and help God and His Messenger? Those — they are the sincere, in their faith.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah therefore said to them: these spoils-i.e. seven gardens that belonged to the Banu'l-Nadir-(And (it is) for the poor fugitives who have been driven out from their homes) because they were driven out of their homes in Mecca (and their belongings) the disbelievers of Mecca expelled them from Mecca, they were about one hundred men, (who seek bounty) who seek reward (and pleasure from Allah) and the good pleasure of Allah by means of jihad (and help Allah and His messenger) through jihad. (They are the loyal) they are the ones who are true in their faith and jihad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n الآيات:3 - 4] { للفقراء المهاجرين } أي: التاركين المجرّدين المهاجرين عن مقام النفس { الذين أُخْرجوا } أي: أخرجهم الله\n إذ لو خرجوا بنفوسهم لاحتجبوا بها وبرؤية الترك والتجريد فوقعوا في مقام النفس مع حجاب العجب الذي هو أشدّ من الذنب { من ديارهم وأموالهم } من مواطنهم ومألوفاتهم أي: صفات نفوسهم ومعلوماتهم { يبتغون فضلاً من الله } من العلوم والفضائل الخلقية { ورضواناً } من الأحوال والمواهب السنية من أنوار تجليات الصفات { وينصرون الله ورسوله } ببذل النفوس لقوة اليقين { أولئك هم الصادقون } في الإيمان اليقيني لتصديق أعمالهم دعواهم\n إذ علامة وجدان اليقين ظهور أثره على الجوارح بحيث لا تمكن حركاتها إلا على مقتضى شاهدهم من العلم { والذين تبوؤوا الدار والإيمان } أي: المقرّ الأصلي الذي هو الفطرة الأولى والعهد الأول الذي هو محل الإيمان وموطنه ولهذا قرنه به",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ بيَّن سبحانه مصارف الفيء بعد إخراج سهم الله ورسوله\n وقدم منهم فقراء المهاجرين اهتماماً بشأنهم فقال: { لِلْفُقَرَآءِ الْمُهَاجِرِينَ الَّذِينَ أُخْرِجُواْ مِن دِيَارِهِمْ وَأَمْوَالِهِمْ } أي: أخرجهم المشركون\n ونهبوا أموالهم\n وسبوا أولادهم\n والحال أنهم في مصائبهم هذه { يَبْتَغُونَ } ويطلبون { فَضْلاً } تفضلاً وإحساناً { مِّنَ ٱللَّهِ وَرِضْوَاناً } منه سبحانه\n لكمال تمكنهم ورسوخهم في مقام الرضا والتسليم { وَ } مع ذلك { يَنصُرُونَ ٱللَّهَ } يترويج دينه\n وإعلاء كلمة توحيده { وَرَسُولَهُ } بالمعاونة والمظاهرة\n وبذل المال والنفس في تقويته ونصره { أُوْلَـٰئِكَ } السعداء المقبولون\n الباذلون مهجهم في طريق الحق\n وتقوية دينه القويم وصراطه المستقيم\n ونصرة رسوله الكريم { هُمُ ٱلصَّادِقُونَ } [الحشر: 8] المقصورون على الصدق والإخلاص ظاهراً وباطناً\n\n\n{ وَ } بعد أولئك الفقراء الأنصار",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" للفقراء \" يتعلق بمحذوف\n أي: يعطي\n أو: اعْجَبوا\n على أنه استئناف\n وقيل: بدل من \" ذي القربى \"\n و \" وتبوؤوا الدارَ والإيمان \" أي: وأَلِفوا الإيمان\n ولا يصح العطف لئلا يلزم أنّ الإيمان متبوأ\n وإنما يُتبوأ المنزل إذ التبوء: التهيؤ\n يقال: بوأت له منزلاً\n أي: هيأته له\n وفي إعراب الحوفي في سورة آل عمران: يقال تبوأ فلان الدار إذا لزمها\n هـ\n فعلى هذا يصح العطف\n ولا يحتاج إلى تقدير عاملٍ آخر\n قال ابن هشام: ولا يجوز كون الإيمان مفعولاً معه لعدم الفائدة في تقييد الأنصار المعطوفين على المهاجرين بمصاحبة الإيمان إذ هو أمر معلوم\n هـ\n وانظر ابن جزي\n فإنه هو الوجه المستحسن عنده في توجيه الآية\n والمعنى: أنهم جمعوا بين الحالتين قبل المهاجرين لأن المهاجرين إنما سبقوهم بالإيمان\n لا بنزول الدار\n قال: فيكون الإيمان على هذا مفعولاً معه\n وأصله لابن عطية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:25",
      "similarity": 0.46916198273397436
    },
    {
      "verse": "35:15",
      "similarity": 0.45711249359129286
    },
    {
      "verse": "2:268",
      "similarity": 0.42116740038661543
    },
    {
      "verse": "2:271",
      "similarity": 0.3988969887087277
    },
    {
      "verse": "28:24",
      "similarity": 0.3882992614939699
    }
  ]
}