{
  "chapter": "الحشر",
  "text": "والذين تبوءو الدار والايمن من قبلهم يحبون من هاجر اليهم ولا يجدون فى صدورهم حاجة مما اوتوا۟ ويؤثرون على انفسهم ولو كان بهم خصاصة ومن يوق شح نفسه فاو۟لئك هم المفلحون",
  "translations": [
    {
      "translation": "Those who were already settled in the abode, and in iman, before they came, love those who have made hijra to them and do not find in their hearts any need for what they have been given and prefer them to themselves even if they themselves are needy. It is the people who are safe-guarded from the avarice of their own selves who are successful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who came to the city and to faith before them, love those who take refuge with them, and do not feel for themselves any need for what is given them, and give them preference over themselves even if they are indigent. Whoever preserves himself from his own greed will be prosperous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It also belongs to those who were already settled in this abode (of Hijrah) having come to faith before the (arrival of the) Muhajirun (Emigrants). They love those who have migrated to them and do not covet what has been given them; they even prefer them above themselves though poverty be their own lot. And whosoever are preserved from their own greed, such are the ones that will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who established a community center and embraced the faith before the arrival of the immigrants love those who have come to their town. They are not jealous of what is given to the immigrants. They give preference to them over themselves - even concerning the things that they themselves urgently need. Whoever controls his greed will have everlasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who accepted this city as their home and accepted faith before them, befriend those who migrated towards them, and in their breasts do not find any need for what they have been given, and prefer the migrants above themselves even if they themselves are in dire need; and whoever is saved from the greed of his soul – it is they who are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (it is also for) those who, before them, had homes and had adopted the faith, love those who emigrate to them, and have no jealousy in their breasts for that which they have been given, and give them preference over themselves even though they were in need of that. And whosoever is saved from his own greed, such are they who will be the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who made their abode in the city and in the faith before them love those who have fled to them, and do not find in their hearts a need of what they are given, and prefer (them) before themselves though poverty may afflict them, and whoever is preserved from the niggardliness of his soul, these it is that are the successful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who made their dwelling in the abode, and in belief, before them; love whosoever has emigrated to them, not finding in their breasts any need for what they have been given, and preferring others above themselves, even though poverty be their portion. And whoso is guarded against the avarice of his own soul, those -- they are the prosperers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who entered the city and the faith before them love those who flee unto them for refuge, and find in their breasts no need for that which hath been given them, but prefer (the fugitives) above themselves though poverty become their lot. And whoso is saved from his own avarice - such are they who are successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who were already settled in the city [Madinah] and firmly rooted in faith, love those who migrated to them for refuge, and harbour no desire in their hearts for what has been given to the [latter]. They give them preference over themselves, even if they too are needy: those who are saved from their own souls' greed are truly successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is also due Unto those who are settled in the dwelling and the faith before them, loving those who have migrated Unto them, and finding in their breasts no desire for that which hath been given them, and preferring them above themselves even though there was want amongst them. And whosoever is Preserved from covetousness of his soul, then those! - they are the blissful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[They are as well] for those who were settled in the land and [abided] in faith before them, who love those who migrate toward them, and do not find in their breasts any privation for that which is given to them, but prefer [the Immigrants] to themselves, though poverty be their own lot. And those who are saved from their own greed—it is they who are the felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who before them, had homes (in Medina) and had adopted the Faith,- show their affection to such as came to them for refuge, and entertain no desire in their hearts for things given to the (latter), but give them preference over themselves, even though poverty was their (own lot). And those saved from the covetousness of their own souls,- they are the ones that achieve prosperity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who, before them, had homes (in Al-Madinah) and had adopted the Faith, love those who emigrate to them, and have no jealousy in their breasts for that which they have been given (from the booty of Bani An-Nadir), and give them (emigrants) preference over themselves, even though they were in need of that. And whosoever is saved from his own covetousness, such are they who will be the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those before them who had made their dwelling in the abode (the City of Madinah), and because of their belief love those who have emigrated to them; they do not find any (envy) in their chests for what they have been given and prefer them above themselves, even though they themselves have a need. Whosoever is saved from the greed of his own soul, they are the ones who win.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who, before them, had settled in the homeland, and had accepted faith. They love those who emigrated to them, and find no hesitation in their hearts in helping them. They give them priority over themselves, even if they themselves are needy. Whoever is protected from his natural greed—it is they who are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [also for] those who were settled in al-Madinah and [adopted] the faith before them. They love those who emigrated to them and find not any want in their breasts of what the emigrants were given but give [them] preference over themselves, even though they are in privation. And whoever is protected from the stinginess of his soul - it is those who will be the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[59:9] And those who had settled in the hometown, that is, Medina, and [had abided] in faith, that is to say, [those who] had embraced it with enthusiasm — these being the Helpers, before them, love those who have emigrated to them, and do not find in their breasts any need, any envy, of that which those [others] have been given, that is to say, of what the Prophet (s) had given the Emigrants from the [seized] possessions of the Banū al-Nadīr, [a share which was] exclusively theirs; but prefer [others] to themselves, though they be in poverty, in need of that which they prefer for [those] others [to have]. And whoever is saved from the avarice of his own soul, its covetousness for [acquiring] possessions, those — they are the successful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then the Prophet (pbuh) to the Helpers (al-Ansar): \"These spoils and gardens are solely for the poor among the Emigrants. If you wish, I will divide your wealth and properties on the Emigrants and give you a share of the spoils, or you keep your wealth and properties and I divide the spoils on the poor among the Emigrants\". They said: \"0 Messenger of Allah, we would like to share our wealth and properties with them and we will also prefer them over ourselves and let them have the spoils\". Allah praised them for this by saying: (Those who entered the city) those who made it possible for the Prophet (pbuh) and his Companions to live in the abode of migration (and the faith before them) and were believers before the Immigrants came to them (love these who flee unto them for refuge) in Medina from among the Companions of the Prophet (pbuh) (and find in their breasts) in their hearts (no need) no resentful envy; and it is said this means: no vexation (for that which hath been given them) of spoils, while they did not get any, (but prefer (the fugitives) above themselves) with their wealth and homes (though poverty become their lot. And whoso is saved from his 658 own avarice) and whoever drives away avarice from his own self (such are they who are successful) such are they who are saved from Allah's wrath and chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱلَّذِينَ تَبَوَّءُوا ٱلدَّارَ } معناه نَزَلوها\n\n\n\n\nوقوله تعالى: { وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ } معناه فَقرٌ وحَاجةٌ\n\n\n\n\nوقوله تعالى: { وَمَن يُوقَ شُحَّ نَفْسِهِ } معناه يَمنعُ بُخلَ نَفسِهِ والشُّحُّ: البُخلُ\n\n\n\n\nوقوله تعالى: { وَلاَ يَجِدُونَ فِي صُدُورِهِمْ حَاجَةً } معناه حَسدٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd those who have established their home (in Medina), it is they who have disbelieved.\n\n\nAnd if they had {khasaṣah} (a specific need), it would be a burden for them.\n\n\nAnd His saying, \"And whoever is saved from the self-indulgence of his own soul\" means that he prevents himself from being stingy, and \"self-indulgence\" refers to stinginess.\n And they will not find in their chests any {need} except for envy.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهم { ٱلَّذِينَ تَبَوَّءُوا ٱلدَّارَ وَٱلإِيمَانَ } أي: توطنوا وتمكنوا في المدينة\n ورسخوا على الإيمان والإسلام بالعزيمة الصادقة الخالصة { مِن قَبْلِهِمْ } أي: قبل هجرة المهاجرين إليها\n ومع رسوخهم وتمكنهم في الإيمان { يُحِبُّونَ } محبة خالصة { مَنْ هَاجَرَ إِلَيْهِمْ } من المؤمنين { وَ } من كمال محبتهم وإخلاصهم بأخوانهم المهاجرين: { لاَ يَجِدُونَ فِي صُدُورِهِمْ } ووجدانهم { حَاجَةً } باعثة لهم إلى أن يحسدوا { مِّمَّآ أُوتُواْ } وأعُطوا\n أي: المهاجرين من سهام الفيء\n وسائر الغنائم والصدقات\n وذلك من غاية محبتهم ومودتهم بالنسبة إليهم\n بل { وَيُؤْثِرُونَ } أي: يختارون ويقدمون المهاجرين { عَلَىٰ أَنفُسِهِمْ } حتى إن من كان له امرأتان نزل عن واحدة وزوَّجها على أحدهم\n\n\nوبالجملة: يؤثرونهم ويختارونهم\n أي: المهاجرين على أنفسهم في آخر ما آثروا لنفوسهم { وَلَوْ كَانَ بِهِمْ خَصَاصَةٌ } أي: حاجة شديدة بليغة\n ومحبة بالنسبة إلى ذلك الشيء\n وما هو إلا من فرط محبتهم وإخلاصهم بالنسبة إلى إخوانهم المهاجرين { وَ } بالجملة: { مَن يُوقَ شُحَّ نَفْسِهِ } ويخالفها حتى يمنعها عن مقتضاها طلباً لمرضاة الله\n ورعايةً لجانب أخيه المسلم { فَأُوْلَـٰئِكَ } السعداء المحافظون على آداب الأخوة والمروَّة { هُمُ ٱلْمُفْلِحُونَ } [الحشر: 9] المقصورون على الفوز العظيم من عنده سبحانه عاجلاً وآجلاً\n في العاجل بالذكر الجميل\n وي الآجل بالجزاء الجزيل\n\n\n{ وَ } بعد فقراء الأنصار للفقراء التابعين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وانظر ابن جزي، فإنه هو الوجه المستحسن عنده في توجيه الآية، والمعنى: أنهم جمعوا بين الحالتين قبل المهاجرين لأن المهاجرين إنما سبقوهم بالإيمان، لا بنزول الدار، قال: فيكون الإيمان على هذا مفعولاً معه، وأصله لابن عطية، وبهذا الاقتراح يصح معنى قوله: { مِن قبلهم } فتأمله\n انظر الحاشية\n يقول الحق جلّ جلاله: { للفقراءِ } أي: يعطى الفيء للفقراء { المهاجرين الذين أُخرجوا من ديارهم وأموالِهم } حيث اضطرهم كفارُ مكة إلى الخروج من مكة، وكانوا مائة رجل\n وفيه دليل على أنّ الكفار يملكون ما استولوا عليه من أموال المسلمين لأنّ الله تعالى سمّاهم فقراء، مع أنهم كانت لهم ديار وأموال بمكة، فخرجوا { يبتغون فضلاً من الله ورضواناً } أي: طالبين منه تعالى رزقاً في الدنيا، ورضا في الآخرة، أو: يطلبون الجنة ورضوان الله أو: زيادة في الإيمان والرضوان، { وينصرون اللهَ ورسولَه } أي: ناوين نصرة دين الله وإعانة رسوله، { أولئك } الموصوفون بما فصّل من الصفات الحميدة { هُم الصادقون } الراسخون في الصدق، حيث ظهر ذلك عليهم بما فعلوا من مفارقة الأوطان والأهل والولدان\n { والذين تبوؤوا الدارَ والإِيمانَ } ، هذا استئناف مسوق لمدح الأنصار بخصال حميدة، من جملتها: محبتهم للمهاجرين، ورضاهم باختصاصهم بالفيء أكمل رضا، أي: اتخذوا المدينة والإيمان مباءة وسكناً وتمكّنوا فيهما أشد تمكين، { مِن قبلهم } أي: من قبل هجرة المهاجرين أو تبوؤوا الدار ولزموا الإيمان، ولزومه: إخلاصه وظهور شعائره وأحكامه، ولا ريب في تقدُّم الأنصار في ذلك على المهاجرين لأنّ المهاجرين لم يتأتَّ لهم أظهاره قبل الهجرة، فتقدمهم في إظهاره فقط، لا في إخلاصه إذ لا يتصور تقدمهم عليهم في ذلك\n { يُحبون مَنْ هاجر إليهم } حتى شاطروهم أموالهم، وأنزلوهم منازلهم، ونزل مَن كانت له امرأتان عن إحداهما ليتزوجها المهاجري، ومحبتهم للمهاجرين من حيث هجرتهم لنصرة الدين لشدة محبتهم للإيمان، { ولا يجدون في صُدورهم } في نفوسهم { حاجةً } أي: شيئاً محتاجاً إليه، يقال: خذ منه حاجتك، أي: ما تحتاج إليه، يعني: أنّ نفوسهم لم تتبع ما أوتوا من الفيء، ولم تطمح إلى شيء منه تحتاج إليه، وقيل: حاجة: حسداً أو كزازة، مما أُعطي المهاجرون من الفيء، حيث خصّهم النبيُّ صلى الله عليه وسلم به\n\n\n{ ويُؤثرون على أنفسهم } أي: يُقدمون المهاجرين على أنفسهم في كل شيء من أسباب المعاش، { ولو كان بهم خصاصةٌ } أي: حاجة وخلّة، وأصلها: خُصاص البيت، أي: فروجه\n والجملة: حال، أي: يُؤثرون في حال خصاصتهم\n قال ابن عباس: لما ظفر النبيُّ صلى الله عليه وسلم بأموال بني النضير، قال للأنصار: إن شئتم قسمتم للمهاجرين من أموالكم ودياركم، وشاركتموهم في هذه الغنيمة، وإن شئتم كانت لكم دياركم وأموالكم ولم يقسم لكم شيء من الغنيمة فقالت الأنصار: بل نقسم لهم من ديارنا وأموالنا، ونؤثرهم بالغنيمة، ولا نُشاركهم فيها، فنزلت\n وهذا صريح في أنَّ قوله تعالى: { والذين تبوؤوا الدار } استئناف غير معطوف على الفقراء المهاجرين، نعم يجوز عطفه عليهم باعتبار شركة الأنصار للمهاجرين في الصدق، دون الفيء، فيكون قوله تعالى: { يُحبون } وما عطف عليه استئنافاً مقرراً لصدقهم، أو حال\n قاله أبو السعود\n قلت: إذا جعلنا قولَه تعالى: { ما أفاء اللهُ على رسوله مِن أهل القُرى } استئنافاً غير مُبيّنِ لِما قبله، بل في كل فيء يأتي بعد بني النضير، صحّ عطف الأنصار على فقراء المهاجرين في كل شيء، وكذا قوله: { والذين جاؤوا مِن بعدهم } عطف عليهم، فيكون المعنى: يقسم الفيء للفقراء المهاجرين، وللذين تبوؤوا الدار والإيمان من قبلهم، وللذين جاؤوا مِن بعدهم\n ويؤيد هذا ما رُوي أنّ عمر رضي الله عنه لمّا قرأ هذه الآية إلى آخرها قال: هذه الآية استوعبت المسلمين، ما على وجه الأرض مسلم إلاَّ وله في هذا الفيء حق، إلا ما ملكت أيْمَانهم\n هـ\n وقيل: نزلت في\n\n \" ضيفٍ نزل بالنبي صلى الله عليه وسلم فلم يجد عنده شيئاً، فقال صلى الله عليه وسلم: \" مَن يُضيف هذا؟ \" فقال: رجلٌ من الأنصار - قيل: أبو طلحة، أنا يا رسول الله، فلم يجد من الطعام إلاّ ما يكفي الصبية، فقال لامرأته: نوّمي الصبيان، وأطِفئي السراج، وقرّبي الطعام، فنظهر للضيف أنَّا نأكل معه، ونمضغ ألسنتنا ليأكل، فأكل الضيف وحده، فلما أصبح قال صلى الله عليه وسلم للرجل: \" إنَّ الله ضحك مِن فعلكما \" \n\nعن أنس: أُهدي لبعضهم رأس مشويّ، وهو مجهود، فَوَجَّهه إلى جارِه، وجارُه وَجَّهَه إلى جارِه، فتداولته تسعةُ أنْفُس، حتى عاد إلى الأول\n { ومَن يُوق شُحَّ نفسه } أي: مَن يقيه الله شحَّ نفسه حتى يغالبها فيما يغلب عليها، مِن حب المال وبُغضَ الإنفاق، { فأولئك هم المفلحون } الفائزون بكل مطلوب، والناجون من كل مرهوب\n والشح - بالضم والكسر -: اللُّؤم، وأن تكون نفس الرجل كزّةً حريصة على المنع\n وإضافته إلى النفس لأنه غريزة فيها، وأما البخل فهم المنع نفسه، وقيل: الشُح: أكل مال أخيك ظلماً، والبخل: منع مالك، وقيل: الشُح: منع ما عندك والطمع في غيرك، والبُخل: منع مالك من غير طمع، فالشُح أقبح من البخل\n\n\nوالجملة: اعتراض وارد لمدح الأنصار بالسخاء، بعد مدحهم بالإيثار\n وجميع الإشارة باعتبار \" مَن \" لأنها واقعة على الجمع",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:80",
      "similarity": 0.4622520438658795
    },
    {
      "verse": "12:68",
      "similarity": 0.4181972178203553
    },
    {
      "verse": "64:16",
      "similarity": 0.40337542580360375
    },
    {
      "verse": "3:74",
      "similarity": 0.3639334659714031
    },
    {
      "verse": "8:25",
      "similarity": 0.3600307143307262
    }
  ]
}