{
  "chapter": "المائدة",
  "text": "يايها الذين ءامنوا۟ اوفوا۟ بالعقود احلت لكم بهيمة الانعم الا ما يتلى عليكم غير محلى الصيد وانتم حرم ان الله يحكم ما يريد",
  "translations": [
    {
      "translation": "You who have iman! fulfil your contracts. All livestock animals are halal for you, except those that are recited to you now; but it is still not halal to hunt while you are in ihram. Allah makes whatever judgements He wills.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O YOU WHO believe, fulfil your obligations. Made lawful (as food) for you are animals except those mentioned (here); but unlawful during Pilgrimage is game. God ordains whatsoever He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Honour your bonds! All grazing beasts of the flock are permitted to you except those which are recited to you hereinafter, but you are not allowed to hunt in the state of Ihram (a state of pilgrim sanctity). Indeed Allah decrees as He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, stand by your contracts (and obligations). Of all animals, cattle has been made lawful for you as food with certain exceptions. Hunting is not lawful for you during ihram (a part of the rituals during pilgrimage). God decrees as He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Fulfil your words (agreements); the mute animals are made lawful for you (to eat) except what will be declared to you after this, but do not assume hunting as lawful when you are on the pilgrimage; indeed Allah commands whatever He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Fulfill (your) obligations. Lawful to you (for food) are all the beasts of cattle except that which will be announced to you (herein), game (also) being unlawful when you assume Ihram. Verily, Allah commands that which He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! fulfill the obligations. The cattle quadrupeds are allowed to you except that which is recited to you, not violating the prohibition against game when you are entering upon the performance of the pilgrimage; surely Allah orders what He desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, fulfil your bonds. Permitted to you is the beast of the flocks, except that which is now recited to you, so that you deem not game permitted to be hunted when you are in pilgrim sanctity. God decrees whatsoever He desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Fulfil your indentures. The beast of cattle is made lawful unto you (for food) except that which is announced unto you (herein), game being unlawful when ye are on the pilgrimage. Lo! Allah ordaineth that which pleaseth Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, fulfill your obligations. All livestock is lawful for you, other than that which is hereby announced to you. You are forbidden to kill game while you are on a pilgrimage -- God commands what He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! fulfil the compacts. Allowed unto you is the beast of the flock except that which is rehearsed unto you, not allowing the chase while ye are in a state of sanctity. Verily Allah ordaineth whatsoever He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Keep your agreements. You are permitted animals of grazing livestock, except what is [now] announced to you, disallowing game while you are in pilgrim sanctity. Indeed Allah decrees whatever He desires.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! fulfil (all) obligations. Lawful unto you (for food) are all four-footed animals, with the exceptions named: But animals of the chase are forbidden while ye are in the sacred precincts or in pilgrim garb: for Allah doth command according to His will and plan.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Fulfill (your) obligations. Lawful to you (for food) are all the beasts of cattle except that which will be announced to you (herein), game (also) being unlawful when you assume Ihram for Hajj or 'Umrah (pilgrimage). Verily, Allah commands that which He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, fulfill your obligations. It is lawful for you (to eat the flesh of) the beast among cattle other than that which is recited to you, hunting is forbidden while you are on pilgrimage. Allah decrees what He will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Fulfill your commitments. Livestock animals are permitted for you, except those specified to you; but not wild game while you are in pilgrim sanctity. God decrees whatever He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, fulfill [all] contracts. Lawful for you are the animals of grazing livestock except for that which is recited to you [in this Qur'an] - hunting not being permitted while you are in the state of ihram. Indeed, Allah ordains what He intends.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:1]   O you who believe, fulfil your bonds, the covenants confirmed between you and God and [between you and other] people. Lawful to you is the beast of the flocks, camels, cattle, and sheep [and goats], to eat after slaughtering [them], except that which is now being recited to you, as forbidden in [the verse below] Forbidden to you are carrion…[Q. 5:3]; the exceptive clause here is a discontinuous one, but may also be continuous; the forbidding concerns that which has succumbed to death and the like; game not being lawful to you when you are on pilgrimage (hurum means muhrimūn; ghayra, ‘not’, is in the accusative as [it introduces] a circumstantial qualifier referring to the subject of the pronoun lakum, ‘to you’). Verily, God decrees whatever He desires, in the way of making [things] lawful or otherwise, and there can be no objection thereto.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ ياأيها الذين ءَامَنُواْ أَوْفُواْ بالعقود } .تصدير السورة بالأمر بالإيفاء بالعقود مؤذن بأن سَتَرد بعده أحكام وعقود كانت عقدت من الله على المؤمنين إجمالاً وتفصيلاً ، ذكَّرهم بها لأنّ عليهم الإيفاء بما عاقدوا الله عليه . وهذا كما تفتتح الظهائر السلطانية بعبارة : هذا ظهير كريم يُتقبل بالطاعة والامتثال . وذلك براعة استهلال .فالتعريف في العقود تعريف الجنس للاستغراق ، فشمل العقودَ التي عاقد المسلمون عليها ربّهم وهو الامتثال لِشريعته ، وذلك كقوله : { واذكروا نعمة الله عليكم وميثاقه الذي واثقكم به } \\[ المائدة : 7 \\] ، ومثل ما كان يبَايع عليه الرسولُ المؤمنين أن لا يشركوا بالله شيئاً ولا يسرقوا ولا يزنوا ، ويقول لهم : فمن وفى منكم فأجره على الله .وشَمل العقود التي عاقد المسلمون عليها المشركين ، مثل قوله : { فسيحيوا في الأرض أربعةَ أشهر } \\[ التوبة : 2 \\] ، وقوله : { ولا آمِّين البيتَ الحرام } \\[ المائدة : 2 \\] . ويشمل العقود التي يتعاقدها المسلمون بينهم .والإيفاء هو إعطاء الشيء وافياً ، أي غير منقوص ، ولمّا كان تحقّق ترك النقص لا يحصل في العرف إلاّ بالزيادة على القدر الواجب ، صار الإيفاء مراداً منه عرفاً العدل ، وتقدّم عند قوله تعالى : { فأمّا الذين آمنوا وعملوا الصالحات فيوفّيهم أجورهم } في سورة النساء ( 173 ) .والعقود جمع عقد بفتح العين ، وهو الالتزام الواقع بين جانبين في فعل مّا . وحقيقته أنّ العقد هو ربط الحبل بالعروة ونحوها ، وشدّ الحبل في نفسه أيضاً عقد . ثم استعمل مجازاً في الالتزام ، فغلب استعماله حتّى صار حقيقة عرفية ، قال الحطيئة :قوم إذا عقدوا عقداً لجارهم ... شدّوا العِناج وشدّوا فوقه الكَرَبَافذكر مع العقد العناج وهو حبل يشدّ القربة ، وذكر الكَرَب وهو حبل آخر للقربة : فرَجَعَ بالعقد المجازيّ إلى لوازمه فتَخيّل معه عناجاً وكرباً ، وأراد بجميعها تخييل الاستعارة . فالعقد في الأصل مصدر سمّي به ما يعقد ، وأطلق مجازاً على التزام من جانبين لشيء ومقابله ، والموضع المشدود من الحبل يسمّى عُقدة . وأطلق العقد أيضاً على الشيء المعقود إطلاقاً للمصدر على المفعول ، فالعهود عقود ، والتحالف من العقود ، والتبايع والمؤاجرة ونحوهما من العقود ، وهي المراد هنا . ودخل في ذلك الأحكام التي شرعها الله لنا لأنّها كالعقود ، إذ قد التزمها الداخل في الإسلام ضمناً ، وفيها عهد الله الذي أخذه على الناس أن يعبدوه ولا يشركوا به .ويقع العقد في اصطلاح الفقهاء على إنشاء تسليم أو تحمّل من جانبين؛ فقد يكون إنشاء تسليم كالبيع بثمن ناض؛ وقد يكون إنشاء تحمّل كالإجارة بأجر ناض ، وكالسلم والقراض؛ وقد يكون إنشاء تحمّل من جانبين كالنكاح ، إذ المهر لم يُعتبر عوضاً وإنَّما العوض هو تحمّل كلّ من الزوجين حقوقاً للآخر . والعقود كلّها تحتاج إلى إيجاب وقبول .والأمر بالإيفاء بالعقود يدلّ على وجوب ذلك ، فتعيّن أنّ إيفاء العاقد بعقده حقّ عليه ، فلذلك يقضي به عليه ، لأنّ العقود شرعت لسدّ حاجات الأمّة فهي من قسم المناسب الحاجيّ ، فيكون إتمامها حاجيّاً؛ لأنّ مكمّل كلّ قسم من أقسام المناسب الثلاثة يلحق بمكمَّلِه : إنْ ضروريّاً ، أو حاجياً ، أو تحسيناً .وفي الحديث المسلمون على شروطهم إلاّ شرطاً أحلّ حراماً أو حرّم حلالاً .فالعقود التي اعتبر الشرع في انعقادها مجرّد الصيغة تلزم بإتمام الصيغة أو ما يقوم مقامها ، كالنكاح والبيع . والمراد بما يقوم مقام الصيغة نحو الإشارة للأبكم ، ونحو المعاطاة في البيوع . والعقود التي اعتبر الشرع في انعقادها الشروعَ فيها بعد الصيغة تلزم بالشروع ، كالجُعل والقِراض . وتمييزُ جزئيَّات أحد النوعين من جزئيات الآخر مجال للاجتهاد .وقال القرافيّ في الفرق التاسع والمائتين : إنّ أصل العقود من حيث هي اللزوم ، وإنّ ما ثبت في الشرع أو عند المجتهدين أنّه مبنيّ على عدم اللزوم بالقول فإنَّما ذلك لأنّ في بعض العقود خفاء الحقّ الملتزم به فيُخشى تطرّق الغرر إليه ، فوسَّع فيها على المتعاقدين فلا تلزمهم إلاّ بالشروع في العمل ، لأنّ الشروع فرع التأمّل والتدبّر . ولذلك اختلف المالكيَّة في عقود المغارسة والمزارعة والشركة هل تلحق بما مصلحته في لزومه بالقول ، أو بما مصلحته في لزومه بالشروع . وقد احتجّ في الفرق السادس والتسعين والمائة على أنّ أصل العقود أن تلزم بالقول بقوله تعالى : أوفوا بالعقود } . وذكر أنّ المالكيَّة احتجّوا بهذه الآية على إبطال حديث : خيار المجلس؛ يعني بناء على أنّ هذه الآية قرّرت أصلاً من أصول الشريعة ، وهو أنّ مقصد الشارع من العقود تمامها ، وبذلك صار ما قرّرته مقدّماً عند مالك على خبر الآحاد ، فلذلك لم يأخذ مالك بحديث ابن عمر «المتبايعان بالخيار ما لم يتفرّقا» .واعلم أنّ العقد قد ينعقد على اشتراط عدم اللزوم ، كبيع الخيار ، فضبطه الفقهاء بمدّة يحتاج إلى مثلها عادة في اختيار المبيع أو التشاور في شأنه .ومن العقود المأمور بالوفاء بها عقود المصالحات والمهادنات في الحروب ، والتعاقد على نصر المظلوم ، وكلّ تعاقد وقع على غير أمر حرام ، وقد أغنت أحكام الإسلام عن التعاقد في مثل هذا إذ أصبح المسلمون كالجسد الواحد ، فبقي الأمر متعلّقاً بالإيفاء بالعقود المنعقدة في الجاهلية على نصر المظلوم ونحوه : كحلف الفضول . وفي الحديث : \" أوفُوا بعقود الجاهلية ولا تُحدثوا عقداً في الإسلام \" وبقي أيضاً ما تعاقد عليه المسلمون والمشركون كصلح الحُدَيْبِية بين النبي صلى الله عليه وسلم وقريش . وقد رُوِي أنّ فرات بن حيّان العِجْلي سأل رسول الله صلى الله عليه وسلم عن حلف الجاهلية فقال : «لعلّك تسأل عن حلف لُجَيْم وتَيْمَ ، قال : نعم ، قال : لا يزيده الإسلام إلاّ شدّة» . قلت : وهذا من أعظم ما عرف به الإسلام بينهم في الوفاء لغير من يعتدي عليه . وقد كانت خزاعة من قبائل العرب التي لم تناو المسلمين في الجاهلية ، كما تقدّم في قوله تعالى :{ الذين قال لهم الناس إنّ الناس قد جمعوا لكم } في سورة آل عمران ( 173 ) .أُحِلَّتْ لَكُمْ بَهِيمَةُ الانعام إِلاَّ مَا يتلى عَلَيْكُمْ غَيْرَ مُحِلِّى الصيد وَأَنتُمْ حُرُمٌ إِنَّ الله يَحْكُمُ مَا يُرِيدُ } .أشعر كلام بعض المفسّرين بالتَّوقّف في توجيه اتّصال قوله تعالى : { أحلت لكم بهيمة الأنعام } بقوله : { أوفوا بالعقود } . ففي «تلخيص الكواشي» ، عن ابن عباس : المراد بالعقود ما بَعد قوله : { أحلت لكم بهيمة الأنعام } اه . ويتعيَّن أن يكون مراد ابن عباس ما مبْدؤه قوله : { إلا ما يتلى عليكم } الآيات .وأمّا قول الزمخشري { أحلَّت لكم بهيمة الأنعام } تفصيل لمجمل قوله : { أوفوا بالعُقود } فتأويله أنّ مجموع الكلام تفصيل لا خصوص جملة { أحلّت لكم بهيمة الأنعام } ؛ فإنّ إباحة الأنعام ليست عقداً يجب الوفاء به إلاّ باعتبار ما بعده من قوله : «إلاّ ما يتلى عليكم» . وباعتبار إبطال ما حرّم أهل الجاهلية باطلاً ممّا شمله قوله تعالى : { ما جعل الله من بحيرة ولا سائبة } \\[ المائدة : 103 \\] الآيات .والقول عندي أنّ جملة { أحلّت لكم بهيمة الأنعام } تمهيد لما سَيَرِد بعدها من المنهيات : كقوله : { غيْر محِلّي الصّيد } وقوله : { وتعاونوا على البِرّ والتقوى } \\[ المائدة : 2 \\] التي هي من عقود شريعة الإسلام فكان الابتداء بذكر بعض المباح امتناناً وتأنيساً للمسلمين ، ليتلقّوا التكاليف بنفوس مطمئنّة؛ فالمعنى : إنْ حرّمنا عليكم أشياء فقد أبحنا لكم أكثر منها ، وإن ألزمناكم أشياء فقد جعلناكم في سعة من أشياء أوفر منها ، ليعلموا أنّ الله ما يريد منهم إلاّ صلاحهم واستقامتهم . فجملة { أُحِلَّت لكم بهيمة الأنعام } مستأنفة استئنافاً ابتدائياً لأنّها تصدير للكلام بعد عنوانه .والبهيمة : الحيوان البرّي من ذوي الأربع إنسِيّها ووحشيّها ، عدا السباعَ ، فتشمل بقر الوحش والظباء . وإضافة بهيمة إلى الأنعام من إضافة العامّ للخاصّ ، وهي بيانية كقولهم : ذبابُ النحل ومدينة بغداد . فالمراد الأنعام خاصّة ، لأنَّها غالب طعام الناس ، وأمّا الوحش فداخل في قوله : { غير محلّي الصيد وأنتم حرم } ، وهي هنا لدفع توهّم أن يراد من الأنعام خصوص الإبل لغلبة إطلاق اسم الأنعام عليها ، فذكرت ( بهيمة ) لشمول أصناف الأنعام الأربعة : الإبل ، والبقر ، والغنم ، والمعز .والإضافة البيانيَّة على معنى ( مِن ) التي للبيان ، كقوله تعالى : { فاجتنبوا الرجس من الأوثان } \\[ الحج : 30 \\] .والاستثناء في قوله : { إلاّ ما يتلى عليكم } من عموم الذوات والأحوال ، وما يتلى هُو ما سيفصّل عند قوله : { حُرّمت عليكم الميتة } \\[ المائدة : 3 \\] ، وكذلك قوله : { غير مُحلِّي الصيد وأنتم حرم } ، الواقع حالاً من ضمير الخطاب في قوله : { أحِلت لكم } ، وهو حال مقيّد معنى الاستثناء من عموم أحوال وأمكنة ، لأنّ الحُرم جمع حرام مثل رَدَاح على رُدُح . وسيأتي تفصيل هذا الوصف عند قوله تعالى : { جعل الله الكعبة البيت الحرام قياماً للناس } في هذه السورة ( 97 ) .والحرام وصف لمن أحرم بحجّ أو عمرة ، أي نواهما . ووصف أيضاً لمن كان حالاً في الحرم ، ومن إطلاق المحرم على الحالّ بالحرم قول الراعي :قَتَلوا ابنَ عفّان الخليفةَ مُحْرِما ... أي حالاً بحرم المدينة .والحَرَم : هو المكان المحدود المحيط بمكة من جهاتها على حدود معروفة ، وهو الذي لا يصاد صيده ، ولا يُعضد شجره ولا تحلّ لقطته ، وهو المعروف الذي حدّده إبراهيم عليه السلام ونصَب أنصاباً تعرف بها حدوده ، فاحترمه العرب ، وكان قُصّي قد جدّدها ، واستمرّت إلى أن بَدَا لقريش أن ينزعوها ، وذلك في مدّة إقامة النبي بمكة ، واشتدّ ذلك على رسول الله ، ثم إنّ قريشاً لم يلبثوا أن أعادوها كما كانت . ولمَّا كان عامُ فتح مكة بعث النبي تميماً بن أسد الخُزاعي فجدّدها . ثم أحياها وأوضحها عمر بن الخطاب في خلافته سنة سبع عشرة ، فبعث لتجديد حدود الحرم أربعة من قريش كانوا يتبدّون في بوادي مكة ، وهم : مخرمة بن نوفل الزهري ، وسعيد بن يربوع المخزومي ، وحوَيطب بن عبد العزّى العامري ، وأزهر بن عوف الزهري ، فأقاموا أنصاباً جعلت علامات على تخطيط الحرم على حسب الحدود التي حدّدها النبي وتبتدىء من الكعبة فتذهب للماشي إلى المدينة نحو أربعة أميال إلى التنعيم ، والتنعيم ليس من الحرم ، وتمتدّ في طريق الذاهب إلى العراق ثمانية أميال فتنتهي إلى موضع يقال له : المقطع ، وتذهب في طريق الطائف تسعة ( بتقديم المثناة ) أميال فتنتهي إلى الجعرانة ، ومن جهة اليمن سبعة ( بتقديم السين ) فينتهي إلى أضاةِ لِبْن ، ومن طريق جُدّة عشرة أميال فينتهي إلى آخر الحديبية ، والحديبية داخلة في الحرم . فهذا الحرم يحرم صيده ، كما يحرم الصيد على المحرم بحجّ أو عمرة .فقوله : وأنتم حرم } يجوز أن يراد به محرِمون ، فيكون تحريماً للصيد على المحرم : سواء كان في الحرم أم في غيره ، ويكون تحريم صيد الحرم لغير المحرم ثابتاً بالسنّة ، ويجوز أن يكون المراد به : محرمون وحالّون في الحرم ، ويكون من استعمال اللفظ في معنيين يجمعهما قدر مشترك بينهما وهو الحُرمة ، فلا يكون من استعمال المشترك في معنييه إن قلنا بعدم صحّة استعماله فيهما ، أو يكون من استعماله فيهما ، على رأي من يصحّح ذلك ، وهو الصحيح ، كما قدّمناه في المقدّمة التاسعة .وقد تفنّن الاستثناء في قوله : { إلاّ ما يتلى عليكم } وقوله : { غير مُحِلّي الصيد } ، فجيء بالأول بأداة الاستثناء ، وبالثاني بالحالين الدالّين على مغايرة الحالة المأذون فيها ، والمعنى : إلاّ الصيد في حالة كونكم مُحْرمين ، أو في حالة الإحرام . وإنَّما تعرّض لحكم الصيد للمحرم هنا لمناسبة كونه مستثنى من بهيمة الأنعام في حال خاصّ ، فذكر هنا لأنّه تحريم عارض غير ذاتيّ ، ولولا ذلك لكان موضع ذكره مع الممنوعات المتعلّقة بحكم الحرم والإحرام عند قوله تعالى : { يأيها الذين آمنوا لا تحلّوا شعائر الله } \\[ المائدة : 2 \\] الآية .والصيد يجوز أن يكون هنا مصدراً على أصله ، وأن يكون مطلقاً على اسم المفعول : كالخَلْق على المخلوق ، وهو إطلاق شائع أشهر من إطلاقه على معناه الأصليّ ، وهو الأنسب هنا لتكون مواقعه في القرآن على وتيرة واحدة ، فيكون التقدير : غير محلي إصابة لصيد .والصيد بمعنى المصدر : إمساك الحيوان الذي لا يألف ، باليد أو بوسيلة ممسكة ، أو جارحة : كالشباك ، والحبائل ، والرماح ، والسهام ، والكلاب ، والبُزاة؛ وبمعنى المفعول هو المَصيد . وانتصب { غيرَ } على الحال من الضمير المجرور في قوله : { لكم } . وجملة { وأنتم حرم } في موضع الحال من ضمير ( مُحلّي ) ، وهذا نسج بديع في نظم الكلام استفيد منه إباحة وتحريم : فالإباحة في حال عدم الإحرام ، والتحريم له في حال الإحرام .وجملة { إنّ الله يحكم ما يريد } تعليل لقوله : { أوفوا بالعقود } ، أي لا يصرفكم عن الإيفاء بالعقود أن يكون فيما شرعه الله لكم شيء من ثقل عليكم ، لأنّكم عاقدتم على عدم العصيان ، وعلى السمع والطاعة لله ، والله يحكم ما يريد لا ما تريدون أنتم . والمعنى أنّ الله أعلم بصالحكم منكم .وذكر ابن عطية : أنّ النقّاش حكى : أنّ أصحاب الكِندي قالوا له : «أيّها الحكيم اعمل لنا مِثْلَ هذا القرآن ، قال : نعم أعْمَل لكم مثلَ بعضه ، فاحتجبَ عنهم أيَّاماً ثمّ خرج فقال : والله ما أقدر عليه . ولا يطيق هذا أحد ، إنِّي فتحت المصحف فخرجتْ سورة المائدة فنظرت فإذا هو قد أمر بالوفاء ونَهَى عن النكث وحلّل تحليلاً عامّاً ثم استثنى استثناء بعد استثناء ثم أخبرَ عن قدرته وحكمته في سطرين ولا يستطيع أحد أن يأتي بهذا إلاّ في أجْلاد» جَمع جِلد أي أسفار .\n\n",
      "translations": [
        {
          "translation": "And on his authority Ibn 'Abbas said regarding Allah's saying: (0 ye who believe! Fulfil your undertakings): '(0 ye who believe! Fulfil your undertakings) fulfil the pledges that are between you and Allah or between you and other people; it is also said that this means: fulfil the obligations which have been made obligatory upon you and which you accepted on the Day of the Covenant and in this Book. (The beast of cattle is made lawful unto you (for food)) you have a legal dispensation to eat of the meat of game such as wild oxen, wild camels and gazelles (except that which is announced unto you) except that which is recited to you in this no surah, (game being unlawful when ye are on pilgrimage) or in the Sacred Precinct. (Lo! Allah ordaineth that which pleaseth Him) He says: He makes lawful and prohibits what He wills whether you are in a state of ritual consecration or not.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جَعفر قالَ: حدثنا عليُّ بن أَحمد، قال: حدثنا عطاءُ بن السائب عن أَبي خالد الواسطي عن الإِمام زيد بن علي عليهما السلامُ في قَولِهِ تَعالى: { يَا أَيُّهَا ٱلَّذِينَ آمَنُواْ أَوْفُواْ بِٱلْعُقُودِ } معناهُ فِي العهودِ وهي خَمسةُ عُقُودٍ: عُقْدَةُ الإِيمانِ، وعُقْدَةُ النِّكاحِ، وعُقْدَةُ العَهدِ وعُقْدَةُ البَيعِ\n وعُقْدَةُ الحِلفِ\n\n\n\n\nوقوله تعالى: { أُحِلَّتْ لَكُمْ [بَهِيمَةُ ٱلأَنْعَامِ] } يُريدُ بِهِ الإِبلَ، والبَقَرَ، والغَنَم\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us that Ali ibn Ahmad said, that Ata' ibn al-Saa'ib narrated to them from Abu Khalid al-Wasiti from Imam Zayd ibn Ali, peace be upon him, regarding the saying of the Almighty, {O you who have believed, fulfill [all] contracts} its meaning is in the contracts, which are five: the contract of faith, the contract of marriage, the contract of allegiance, and the contract of sale.\n\n\nThe oath {Huqdah} is a solemn promise or undertaking.\n\nAnd His saying, {It is lawful for you [the livestock]} means the camels, and the cows, and the sheep.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا أيها الذين آمنُوا } بالإيمان العلمي { أوفوا بالعُقُود } أي: العزائم التي أحكمتموها في السلوك\n والفرق بين العهد والعقد ههنا: أنّ العهد هو إيداع التوحيد فيهم في الأزل كما مرّ\n والعقد هو إحكام عزائم التكليف عليهم ليتأدّى بهم إلى الإيفاء بما عاهدوا عليه\n فالعهد سابق والعقد لاحق\n فكل عزيمة على أمر يوجب إخراج ما في الاستعداد بالقوة إلى الفعل عقد بينه وبين الله يجب الوفاء به والامتناع عن نقضه بفتور أو تقصير { أحلّت لكم } جميع أنواع التمتعات والحظوظ بالنفوس السليمة التي لا تغلب عليها السبعية والشره\n كالنفوس التي هي على طباع الأنعام الثلاثة { إلاّ ما يُتْلى عليكم } من التمتعات المنافية للفضيلة والعدالة فإنها منهيّ عنها لحجبها عن الكمال الشخصي والنوعي { غير مُحِلي الصيد وأنتم حُرُمٌ } أي: لا متمتعين بالحظوظ في تجريدكم للسلوك وشروعكم في الرياضة عند السير إلى الله لطلب الوصول فإنه يجب حينئذ الاقتصار على الحقوق\n إذ الإحرام في الظاهر صورة الإحرام الحقيقي للسالكين في طريق كعبة الوصال\n والقاصدين لدخول الحرم الإلهيّ وسرادقات صفات الجلال والكمال { إنّ الله يحكُم ما يُريد } على من يريده من أوليائه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم الوفاء بالعهدو والعقود الموضوعة فيكم لإصلاح حالكم { أَوْفُواْ بِٱلْعُقُودِ } واظبوا على إقامة الحدود\n وداوموا على محافظة المواثيق التي وضعها الحق بينكم\n لتدبر أمور معاشكم ومعادكم من جملتها أنها { أُحِلَّتْ لَكُمْ بَهِيمَةُ ٱلأَنْعَامِ } وهي الأزواج الثمانية وما يشبهها\n تقويماً لمزاجكم وتقيوة له\n ليتمكنوا على إتيان ما كلفوا به { إِلاَّ مَا يُتْلَىٰ عَلَيْكُمْ } في كتاب الله تحريمه حال كونكم { غَيْرَ مُحِلِّي ٱلصَّيْدِ } مطلقاً { وَأَنْتُمْ } في تلك الحالة { حُرُمٌ } محرمين للحج\n مأمورين بحبس القوى الشهوية والغضبية عن مقتضياتهما\n بل معطلين لها حتى تتكنوا\n وتقدروا على الموت الإرادي { إِنَّ ٱللَّهَ } المدبر لمصالح عباده { يَحْكُمُ } بمقتضى حكمته ومصلحته { مَا يُرِيدُ } [المائدة: 1] لهم من التحليل والتحريم بحسب الأوقات والحالات\n لا يسأل عن فعله \n بل لا بد لكم الانقياد\n تعبداً\n سيما في أعمال الحج\n\n\n{ يَا أَيُّهَا ٱلَّذِينَ آمَنُواْ } بالله\n طاعةً وتعبداً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "{ يَا أَيُّهَا ٱلَّذِينَ آمَنُواْ أَوْفُواْ بِٱلْعُقُودِ... }  أي: بالعهود التي عَهِدْتُ إليكم أن تحفظوها، وهي حفظ الأموال، وحفظ الأنساب، وحفظ الأديان، وحفظ الأبدان، وحفظ اللسان، وحفظ الأيمان، ثم مرَّ معها على الترتيب، فما ذكره هناك مُستوفَى، لم يُعِدْ منه هنا إلا أصله، وما بقي هناك في أصل من الأصول الستّة كمّلهُ هنا، ولمّا ذكر فيما تقدّم في أول السورة حُكْم الأموال باعتبار المِلك، ولم يتكلم على ما يحلّ منها وما يحرم، تكلم هنا على ذلك، فقال: {...أُحِلَّتْ لَكُمْ بَهِيمَةُ ٱلأَنْعَامِ إِلاَّ مَا يُتْلَىٰ عَلَيْكُمْ غَيْرَ مُحِلِّي ٱلصَّيْدِ وَأَنْتُمْ حُرُمٌ إِنَّ ٱللَّهَ يَحْكُمُ مَا يُرِيدُ }  قلت: إضافة { بهيمة الأنعام }: للبيان، كثوب خزّ، إي: البهيمة من الأنعام، و { غير مُحِلِّي الصيد }: حال، قال الأخفش: من فاعل { أوفوا } ، وفيه معنى النّهي، وقال الكسائي: من ضمير { لكم } كما تقول: أُحِلّ لكم الطعام غير مُفسِدين فيه، فإن قُلتَ: الحال قيد لعامِلها، والحِلِّيَّة غير خاصّة بوقت حُرمَة الصيد؟ قلت: لمّا كانت الحاجة إليها في ذلك الوقت أكثر، خصّ الحِلِّيَّة به ليكون أدعى للشكر، ويؤخَذ عموم الحِلِّيَّة من سورة الحج. يقول الحقّ جلّ جلاله: { أُحِلَّت لكم بهيمة الأنعام } أي: الأنعام كلها، وهي الإبل والبقر والغنم، { إلا ما يُتلَى عليكم } بعدُ في قوله:\n[المَائدة:3] الآية، حال كونكم { غير مُحِلِّي الصيد } في حال الإحرام، ومعنى الآية في الجملة: أُحِلَّت الأنعام كلها إلا ما يُتلى عليكم من الميتة وأخواتها، لكن الصيد في حال الإحرام حرام عليكم، { إن الله يحكم ما يريد } من تحليل أو تحريم. الإشارة: يا أيها الذين آمنوا أوفوا بالعقود التي عقدتموها على نفوسكم في حال سيركم إلى حضرة ربَكم، من مجاهدة ومُكابَدة، فمَن عقد عقدة مع ربّه فلا يحلّها، فإن النفس إذا استأنست بحلّ العقود لم ترتبط بحال، ولعبت بصاحبها كيف شاءت، وأوفوا بالعقود التي عقدتموها مع أشياخكمْ بالاستماع والاتّباع إلى مماتكم، وأوفوا بالعقود التي عقدها عليكم الحق تعالى، من القيام بوظائف العبودية، ودوام مشاهدة عظمة الربوبية، فإن أوفيتم بذلك، فقد أُحِلَّت لكم الأشياء كلها تتصرّفون فيها بهِمّتكم لأنكم إذا كنتم مع المُكَوِّن كانت الأكوان معكم. إلا ما يُتلَى عليكم مما ليس من مقدوركم مما أحاطت به أسوار الأقدار، \" فإن سوابق الهِمَم لا تخرق أسوار الأقدار \" ، غير مُتَعَرِّضين لشهود السّوى وأنتم في حرم حضرة المولى، والله تعالى أعلم. ولما نهى عن التعرض للصيد في الحرم، نهى عن تغيير المناسك والتعرض للحُجَّاج لأنه بينْ تعظيم حرمة الحرم، فقال: { يَا أَيُّهَا ٱلَّذِينَ آمَنُواْ لاَ تُحِلُّواْ شَعَآئِرَ ٱللَّهِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:28",
      "similarity": 0.5281910159777274
    },
    {
      "verse": "22:34",
      "similarity": 0.405538794967836
    },
    {
      "verse": "5:96",
      "similarity": 0.3685818343101472
    },
    {
      "verse": "20:27",
      "similarity": 0.3338721969557101
    },
    {
      "verse": "4:33",
      "similarity": 0.2769781257899447
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}