{
  "chapter": "المائدة",
  "text": "ذلك ادنى ان ياتوا۟ بالشهدة على وجهها او يخافوا۟ ان ترد ايمنۢ بعد ايمنهم واتقوا۟ الله واسمعوا۟ والله لا يهدى القوم الفسقين",
  "translations": [
    {
      "translation": "That makes it more likely that they will give their evidence properly or be afraid that their oaths will be refuted by subsequent oaths. Have taqwa of Allah and listen carefully. Allah does not guide deviant people.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is thus likely that men will bear witness rightly, or else fear that their oaths may be disproved by oaths given after them. So fear God, and do not forget that God does not guide the iniquitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus it is more likely that they will either bear the right testimony or else they will at least fear that their oaths may be rebutted by other oaths. Have fear of Allah and pay heed. Allah does not direct the disobedient to the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This will help preserve a proper testimony because the witness will be afraid of the denial of their own testimony by a second pair of witness. Have fear of God and listen (properly). God does not guide the evil doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is more suitable than their bearing testimony as they wish or fear that some oaths may be made void, after their taking oath; so fear Allah and heed the commands; and Allah does not guide the disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That should make it closer (to the fact) that their testimony would be in its true nature and shape, or else they would fear that (other) oaths would be admitted after their oaths. And have Taqwa of Allah and listen (with obedience to Him). And Allah guides not the rebellious people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is more proper in order that they should give testimony truly or fear that other oaths be given after their oaths; and be careful of (your duty to) Allah, and hear; and Allah does not guide the transgressing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it is likelier that they will bear testimony in proper form, or else they will be afraid that after their oaths, oaths may be rebutted. Fear God, and hearken; God guides not the people of the ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus it is more likely that they will bear true witness or fear that after their oaths the oaths (of others) will be taken. So be mindful of your duty (to Allah) and hearken. Allah guideth not the froward folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That makes it more likely that people will bear true witness, or else they will fear that their oaths will be contradicted by the oaths of others. Heed God and listen; God does not guide a rebellious, disobedient people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That shall make it more likely that they shall produce the testimony according to the fact thereof or they shall fear that other oaths would be admitted after their oaths. And fear Allah and hearken; and Allah guideth not a transgressing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That makes it likelier that they give the testimony in its genuine form, or fear that other oaths will be taken after their oaths. Be wary of Allah and listen, and Allah does not guide the transgressing lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is most suitable: that they may give the evidence in its true nature and shape, or else they would fear that other oaths would be taken after their oaths. But fear Allah, and listen (to His counsel): for Allah guideth not a rebellious people:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That should make it closer (to the fact) that their testimony would be in its true nature and shape (and thus accepted), or else they would fear that (other) oaths would be admitted after their oaths. And fear Allah and listen (with obedience to Him). And Allah guides not the people who are Al-Fasiqun (the rebellious and disobedient).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it is likelier that they will bear testimony in proper form, or else they will be afraid that oaths may be rejected after their oaths. Fear Allah, and listen; Allah does not guide the people of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That makes it more likely that they will give true testimony, fearing that their oaths might be contradicted by subsequent oaths. So fear God, and listen. God does not guide the disobedient people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is more likely that they will give testimony according to its [true] objective, or [at least] they would fear that [other] oaths might be taken after their oaths. And fear Allah and listen; and Allah does not guide the defiantly disobedient people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:108] That, ruling mentioned, where the oath devolves to the inheritors, [makes it] likelier, brings closer [the eventuality], that they, the witnesses or the trustees, will bear the testimony in its true form, [the form] in which they have been charged to bear it, without distortion or breach of faith, or, it is likelier, that they will be afraid that after their oaths other oaths may be taken, from the inheritors, the plaintiffs, who would swear to the two men’s breach of faith or perjury, in which case they would be disgraced and would incur penalties, and so [because of this] they will not lie. Fear God, by refraining from betrayal and perjury, and listen, to what you have been commanded, listening in acceptance. God does not guide the wicked people, those rebelling against obedience to Him; [He does not guide the wicked] to the way of goodness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thus it is more likely) it is more appropriate and worthier (that they) the Christians (will hear true witness or fear) i.e. the Christians (that after their oath the oath (of others) will be taken) i.e. the oath of the Muslims will be taken, so let them not withhold their testimony. (So be mindful of your duty (to Allah)) fear Allah regarding that which is entrusted to you (and hearken) to that with which you are commanded and obey Allah. (Allah guideth not the froward folk) He does not guide to His religion or clear proof lying, transgressing disbelievers nor does He guide those who are not fit for His guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذٰلِكَ } التحليف والتغليظ { أَدْنَىٰ } أقرب إلى الاحتياط { أَن يَأْتُواْ بِٱلشَّهَادَةِ } ويؤدوها { عَلَىٰ وَجْهِهَآ } أي: على وجه تحملونها من غير تحريف وخيانة فيها { أَوْ يَخَافُوۤاْ أَن تُرَدَّ أَيْمَانٌ } على المدعين { بَعْدَ أَيْمَانِهِمْ } الكاذبة، فيفتضحوا بظهور الخيانة على رءوس الملأ { وَٱتَّقُوا ٱللَّهَ } أيها الشهود عن الكتمان والتحريف { وَٱسْمَعُواْ } ما يقول المحتضر وأدوه على وجهه { وَٱللَّهُ } المطلع لضمائر عباده { لاَ يَهْدِي } إلى توحيده { ٱلْقَوْمَ ٱلْفَاسِقِينَ } [المائدة: 108] الخارجين عن مقتضى أوامره ومنهياته، واذكروا، وتذكروا خطاب الله وعتابه لرسله من أجلكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { ذلك } أي: تحليف الشهود، { أدنى } أي: أقرب { أن يأتوا بالشهادة على وجهها } كما تحملوها من غير تحريف ولا خيانة فيها، { أو يخافوا أن تُرَدّ أيمَانٌ بعد أيمانهم } أي: أو أقرب لأن يخافوا أن ترد اليمين على المدعين بعد أيمانهم، فيفتضحوا بظهور الخيانة واليمين الكاذبة، وإنما جمع الضمير، لأنه حكم يعم الشهود كلهم، { واتقوا الله واسمعوا } ما تُوصون به، فإن لم تتقوا ولم تسمعوا كنتم قومًا فاسقين، { والله لا يهدي القوم الفاسقين } أي: لا يهديهم إلى حجة أو إلى طريق الجنة\n الإشارة: أمر الحقّ ـ جلّ جلاله ـ في الآية المتقدمة، بالاعتناء بشأن الأنفس، بتزكيتها وتحليتها وأمر في هذه الآية بالاعتناء بشأن الأموال بحفظها، والأمر بالإيصاء عليها ودفعها لمستحقها إذا كلاهما يقربان إلى رضوان الله، ويوصلان إلى حضرته، وقد كان في الصحابة من قربه ماله، وفيهم من قربه فقره، وكذلك الأولياء، منهم من نال الولاية من جهة المال أنفقه على شيخه فوصله من حينه، ومنهم من نال من جهة فقره أنفق نفسه في خدمة شيخه، وقد رُوِيَ أن سيدي يوسف الفاسي أنفق على شيخه قناطير من المال، قيل: أربعين، وقيل: أقل\n والله تعالى أعلم\n ولما أمره بالتقوى، ذكر اليوم الذي تجنى فيه ثمراتها، فقال: { يَوْمَ يَجْمَعُ ٱللَّهُ ٱلرُّسُلَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:96",
      "similarity": 0.3529604761820985
    },
    {
      "verse": "3:82",
      "similarity": 0.3198077071418187
    },
    {
      "verse": "63:6",
      "similarity": 0.27857732257051027
    },
    {
      "verse": "9:105",
      "similarity": 0.2736217616116082
    },
    {
      "verse": "2:224",
      "similarity": 0.27352650141866164
    }
  ]
}