{
  "chapter": "المائدة",
  "text": "ما جعل الله منۢ بحيرة ولا سائبة ولا وصيلة ولا حام ولكن الذين كفروا۟ يفترون على الله الكذب واكثرهم لا يعقلون",
  "translations": [
    {
      "translation": "Allah did not institute any such thing as bahira or sa'iba or wasila or hami. Those who were kafir invented lies against Allah. Most of them do not use their intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has not sanctioned Baheerah or Sa'ibah, Waseelah or Ham. The unbelievers fabricate lies of God, for many of them are devoid of sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has neither appointed (cattle devoted to idols such as) Bahirah, Sa'ibah, Wasilah nor Ham; but those who disbelieve forge lies against Allah and of them most have no understanding (and therefore succumb to such superstitions).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has not instituted the rites of Bahirah, Sa'ibah, Wasilah, nor of Hami (names of certain animals that the pagans would offer as sacrifice). It is the pagans who have attributed falsehood to God. Many of them have no understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not appointed (commanded to sacrifice) the camel with ears sliced (Bahira) or the she-camel (Saibah) or the she-goat (Wasilah) or the breeding camel (Hami), but the disbelievers fabricate lies against Allah; and most of them do not have any sense at all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not instituted things like Bahirah or a Sa'ibah or a Wasilah or a Ham. But those who disbelieve invent lies against Allah, and most of them have no understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not ordained (the making of) a bahirah or a saibah or a wasilah or a hami but those who disbelieve fabricate a lie against Allah, and most of them do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has not appointed cattle dedicated to idols, such as Bahira, Sa'iba, Wasila, Hami; but the unbelievers forge against God falsehood, and most of them have no understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath not appointed anything in the nature of a Bahirah or a Sa'ibah or a Wasilah or a Hami, but those who disbelieve invent a lie against Allah. Most of them have no sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has ordained no sanctity about animals described as bahirah, or sa'ibah, or wasilah or ham. Those who deny the truth invent falsehoods about God. Most of them do not use their reason:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath not appointed aught of the bahira or the sa'iba or the wasila or the ham, those who disbelieve have fabricated a lie against Allah, and most of them reflect not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not prescribed any such thing as Bahirah, Sa’ibah, Waseelah, or Haam; but those who are faithless fabricate lies against Allah, and most of them do not exercise their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was not Allah who instituted (superstitions like those of) a slit-ear she-camel, or a she-camel let loose for free pasture, or idol sacrifices for twin-births in animals, or stallion-camels freed from work: It is blasphemers who invent a lie against Allah; but most of them lack wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not instituted things like Bahirah (a she-camel whose milk was spared for the idols and nobody was allowed to milk it) or a Sa'ibah (a she-camel let loose for free pasture for their false gods, e.g. idols, etc., and nothing was allowed to be carried on it), or a Wasilah (a she-camel set free for idols because it has given birth to a she-camel at its first delivery and then again gives birth to a she-camel at its second delivery) or a Ham (a stallion-camel freed from work for their idols, after it had finished a number of copulations assigned for it, all these animals were liberated in honour of idols as practised by pagan Arabs in the pre-Islamic period). But those who disbelieve invent lies against Allah, and most of them have no understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not made cattle, a slit eared shecamel, nor a freely grazing shecamel, nor a shecamel that bore twins, nor an uncastrated camel (dedicated to idols), but those who disbelieve invent lies against Allah. Most of them do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God did not institute the superstitions of Bahirah, Saibah, Wasilah, or of Hami; but those who disbelieve fabricate lies about God—most of them do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has not appointed [such innovations as] bahirah or sa'ibah or wasilah or ham. But those who disbelieve invent falsehood about Allah, and most of them do not reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:103] God has not ordained, He has not stipulated [in His Law], anything such as a Bahīra, a Sā’iba, a Wasīla or a Hām, in the way that people did at the time of paganism. Al-Bukhārī reported [in a hadīth] from Sa‘īd b. alMusayyab, who said: ‘The bahīra is that [camel] whose milk is consecrated to idols and whom no human   may milk; the sā’iba is the one they would leave to roam freely for their gods and was forbidden to bear any load; the wasīla is the young she-camel that would give birth to a young female, as its first offspring, followed by another female, bearing one after the other without a male in between: she would then be left to roam freely for their idols; the hām is the mature male camel, which after completing a certain number of copulations with a female, would then be consigned to their idols and be exempt from bearing any load, and they would call it hāmī; but the disbelievers invent lies against God, in this matter, by attributing [the sanctioning of] such [practices] to Him; and most of them do not understand, that this is mendacity, for in this they have [merely] followed the example of their forefathers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah hath not appointed anything in the nature of a Bahirah or a Sa'ibah or a Wasilah or a Hami) He says: Allah has not prohibited the Bahirah, the Sa'ibah, the Wasilah or the Hami. As for the Bahirah, it was the norm that if a she-camel delivered on its fifth birthing a male camel, the latter would be immolated and both men and women would eat from it, but if it were a female, they would cleave its ear. The latter is called a Bahirah. The latter's milk and benefits were for men only, to the exclusion of women, and when she died both men and women could share her meat. As for the Sa'ibah, people used to give whatever they were willing to give of cattle and hand it over to the custodians of idols. The latter would offer it to travellers who passed by, the men not the women. The animals offered were also male and never female. When these died both men and women shared its meat. As for the Wasilah, when a sheep had delivered seven times, they used to check the seventh birth. If it were male, they used to immolate it and its meat was shared by men and women. If it were female, women would not be allowed to benefit from it until the animal died. When the animal died, both men and women shared its meat. If it were a twin delivery, male and female, both were spared for the benefit of men only, until their death. When the animal died, both men and women shared their meat. As for the Ham, it is the male camel whose offspring has produced its own offspring, it is said that such an animal has protected its back. This animal is left alone: it is not used for riding or transporting things. It cannot be stopped from drinking of any water or grazing in any pasture, nor can it be stopped from copulating with any she-camel that comes its way. When this animal gets too old or dies, its meat is shared by men and women. Allah says that He did not prescribe any of these practices described above; (but those who disbelieve) i.e. 'Amr ibn Luhayy and his followers (invent a lie against Allah) by declaring the above unlawful [for some]. (Most of them) all of them (have no sense) in relation to Allah's command, that which He has made lawful and that which He has made unlawful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَا جَعَلَ ٱللَّهُ مِن بَحِيرَةٍ [وَلاَ سَآئِبَةٍ وَلاَ وَصِيلَةٍ وَلاَ حَامٍ] } معناهُ نَاقةٌ مَشْقوقَةُ الأُذنِ\n وَكَانَ أَهلُ الجَاهِليةِ يُحرِّمُونَها ويُحرِّمونَ وَبَرَها وَظَهرَهَا وَلَحمَهَا وَلَبَنَهَا عَلَى النِّسَاءِ ويُحلُّونَها لِلرِجالِ\n وَمَا وَلَدَتْ مِنْ ذَكَر أَوْ أُنْثَى فَهي بِمَنزِلَتِهَا\n فَإِن مَاتَتْ البَحِيرةُ اشْتَرَكَ الرِّجالُ والنِّسَاءِ في أكلِ لَحمِها\n وإذا ضَرَبَ جملٌ مِن وَلَد البحيرة فهو حامٍ والسائبة: لناقة تُسيّب للآلهة فلا ينتفع بها فما ولدت من ولد بينها وبين ستةِ أَوْلادٍ فَهوَ بِمَنزِلتِها\n فإِذا وَلَدَتْ السَّابعَ ذكراً أَو أُنثى ذَبَحوهُ، فأَكلهُ الرِّجالُ دُونَ النِّساءِ\n فَإِنْ أَتأَمتْ بِذَكَرٍ وأَنْثَى، فَهو وَصِيلةٌ فلا يُذْبَحُ الذَّكَرُ\n وإِنْ كَانَتَا انثَيينِ تُرِكَتَا، فَلَمْ تُذْبَحا\n وإِذَا وَلَدَتْ سَبعةَ أَبْطُنٍ، كُلُ بَطنٍ ذَكراً وأُنثَى حَيْين، قَالُوا وَصَلَتْ أَخَاهَا، فَأَحْمَوهَا وَتَركُوهَا تَرعَى لا يمِسُّها أَحَدٌ\n وإِنْ وَضَعَتْ أُنْثَى حَيَّةً بَعدَ البَطنِ السَّابعِ، كَانَتْ مَع أُمِها كَسَائِرِ النَّعَم، لَمْ تُحْمَ هِي وَلاَ أُمُّها\n وإِنْ وَضَعَتْ أَنثَى مَيتةً بَعدَ البَطنِ السَّابع أَكَلتها النِّساءُ, وكَذَلِكَ إِذَا وَضَعَتْ ذَكَراً وأَنثى مَيتين بَعَدَ البَطنِ السَّابع أَكَلَها الرِّجالُ والنِّساءُ جميعاً بالسَّويةِ\n وإِنْ وَضَعَتْ ذَكراً أَو أنثى حَيينِ بَعَدَ البَطنِ السابعِ أكَلَ الذَكَرَ منهما الرِّجالُ دُون النِّساءِ\n وَجَعَلوا الأُنثَى مَعَ أُمِّها كَسَائِر النِّعَم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah: {He has not made any river [or] a returner [or] a waseelah [or] a hami}, meaning a female camel with her ears slit.\n\n\nAnd the people of pre-Islamic Arabia used to forbid it {i.e. the killing of animals}, and they would also forbid the eating of its meat, and its skin, and its fat, and its milk, to women, and they would allow it only to men.\n\n\nAnd whatever is born of a male or female is by its nature equal.\n\n\nIf the river buffalo dies, the men and women share in eating its meat.\n\n\nAnd if a {camel} from the {beehive} is cast, it is a {stallion}, and the {sow} is a {mare} for the {goddess}, from which no {profit} can be gained. {Any} {offspring} {born} between {it} and {six} {other} {offspring} is {equal} to {it} in {status}.\n\n\nIf the seventh child is born male or female, the men shall eat it, without the women.\n\nIf you have a boy and a girl, then it is a {walidah} and it is not permissible to kill the boy.\n\nAnd if they are two women, then they are not to be put to death, unless they have committed a great sin.\n\n\nAnd when she gives birth to seven {abtunin}, each with a boy and a girl, they say, \"her brother has been born,\" and they leave her {ahmawha} and let her {tar'a} without anyone touching her.\n\n\nAnd if a woman gives birth to a living child after the seventh month, she and her child are like other livestock, neither she nor her child shall be subject to the law.\n\n\nAnd if a woman gives birth to a dead child after the seventh month, the women shall eat it. And likewise, if a man gives birth to a dead child after the seventh month, the men and women shall eat it together.\n\n\nIf a boy or girl is born after the seventh month of pregnancy, the men will eat the boy and the women will eat the girl.\n And they made the female with her mother as the rest of the blessings.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مَا جَعَلَ ٱللَّهُ } أي: ما وضع\n وشرع لكم في دينكم ما في الجاهلية { مِن بَحِيرَةٍ } وهو أنهم كانوا إذا انتجت ناقتهم خمسة أبطن خامسها ذكر بحروا أذنها\n أي: شقُّوها وخلوا سبيلها\n فلا تركب ولا تحمل ولا تحلب أبداً\n فسموها بحيرة { وَلاَ سَآئِبَةٍ } وهي أنهم قالوا: إذا شفيتُ فناقتي سائبة\n أي: ممنوعة من الانتفاع كالبحيرة { وَلاَ وَصِيلَةٍ } وهي أنهم إذا ولدت شاتهم أنثى كان لهم\n وإذا ولدت ذكراً كان لآلهلتهم\n وإذا ولت ذكرا وأنثى في بطن واحد يتبعون الأنثى بالكذور\n ويتقربون بها\n وسموها وصيلة\n\n\n{ وَلاَ حَامٍ } وهي أنهم إذا أنتجت من صلب فحل عشرة أبطن\n حرم انتفاعه بالكلية\n ولم يمنعوها من الماء والكلأ والمرعى\n وقالوا: قد حمى ظهره\n ويسمونها حام { وَلَـٰكِنَّ ٱلَّذِينَ كَفَرُواْ } أعرضوا عن الإيمان والإطاعة { يَفْتَرُونَ عَلَىٰ ٱللَّهِ ٱلْكَذِبَ } أي: يستوي أمثال هذه المزخرفات الباطلة على الله\n افتراءً { وَأَكْثَرُهُمْ لاَ يَعْقِلُونَ } [المائدة: 103] الله\n ولا يعلمون حق قدرة ومقتضى حكمته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: البحيرة: فعيلة بمعنى مفعولة\n من بَحَرَ\n إذا شق\n وذلك أن الناقة كانت إذا ولدت عندهم في الجاهلية عشرة أبطن\n شقوا أذنها\n وتركوها ترعى\n ولا ينتفع بها\n وأما السائبة فكان الرجل يقول: إذا قدمت من سفري\n أو برئت من مرضي\n فناقتي سائبة\n فإذا قدم أو برىء سيّبها لآلهتهم\n فلا تُحلَب\n ولا تُركب\n ولا تُمنَع من شجر\n وقد يُسَيّبُون غير الناقة\n فإذا سيّبوا العبد فلا يكون عليه ولاء لأحد\n وإن قال ذلك\n اليوم\n فحمله على العتق\n وولاؤه للمسلمين\n وفعل ذلك ـ اليوم ـ في الحيوان حرام\n كما يفعله جهلة النساء في الديك الأبيض يحرر حتى يموت\n فإذا فعل ذلك ذبح وأكل\n وأما الوصيلة: فكانوا إذا ولدت الناقة ذكرًا وأنثى متصلين\n قالوا: وصلت الناقة أخاها\n فلم يذبحوها\n وأما الحام: فكانوا إذا نتج من الجمل عشرة أبطن\n قالوا: قد حُمي ظهرُه\n فلا يُركب ولا يُحمل عليه\n يقول الحقّ جلّ جلال: في إبطال هذه الأشياء: { ما جعل الله من بحيرة ولا سائبة ولا وصيلة ولا حام } أي: ما شرع الله شيئًا من ذلك\n ولا أمر به\n { ولكن الذين كفروا يفترون على الله الكذب } بتحريم ذلك\n ونسبته إليه\n { وأكثرهم لا يعقلون } \n أي: جُلهم لا عقل لهم\n بل هم مقلدون غيرهم في تحريم ذلك\n وتقليد الآباء والرؤساء في تحريم ما أحل الله ـ تعالى ـ شرك لأنهم نَزَّلَوا غير الله منزلته في التحريم والتحليل\n وهو كفر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "101:11",
      "similarity": 0.250416217857968
    },
    {
      "verse": "88:4",
      "similarity": 0.24429858508740393
    },
    {
      "verse": "48:26",
      "similarity": 0.21743463625681528
    },
    {
      "verse": "28:51",
      "similarity": 0.13329377689096208
    },
    {
      "verse": "13:21",
      "similarity": 0.13192042605137705
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/5:103.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/5:103.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:103.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}