{
  "chapter": "المائدة",
  "text": "يوم يجمع الله الرسل فيقول ماذا اجبتم قالوا۟ لا علم لنا انك انت علم الغيوب",
  "translations": [
    {
      "translation": "On the day Allah gathers the Messengers together and says, 'What response did you receive?' they will say, 'We do not know. You are the Knower of unseen things.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day God will gather the apostles and ask: \"What answer was made to you?\" They will say: \"We know not. You alone know the secrets unknown.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when Allah will gather together the Messengers and say: 'What answer were you given?' They will reply: 'We have no real knowledge of it. You alone fully know all that lies beyond the reach of human perception.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have fear of the day when God will bring all the Messengers together and ask them, \"What was the response of men to your call?\" They will reply, \"We have no knowledge. You are the only One who has knowledge of the unseen.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when Allah will gather all the Noble Messengers, and then say, “What response did you get?” They will submit, “We do not have any knowledge; indeed it is only You, Who knows all the hidden.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when Allah will gather the Messengers together and say to them: \"What was the response you received (from men to your teaching)\" They will say: \"We have no knowledge, verily, only You are the Knower of all that is hidden.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when Allah will assemble the apostles, then say: What answer were you given? They shall say: We have no knowledge, surely Thou art the great Knower of the unseen things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when God shall gather the Messengers, and say, 'What answer were you given?' They shall say, 'We have no knowledge; Thou art the Knower of the things unseen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the day when Allah gathereth together the messengers, and saith: What was your response (from mankind)? they say: We have no knowledge. Lo! Thou, only Thou art the Knower of Things Hidden,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when God assembles the messengers and asks them, \"What was the response you received [from the people]?\" they will reply, \"We have no knowledge of it. You alone know what is hidden.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Beware of the Day whereon Allah shall assemble the apostles and say unto them: how were you answered? Then they will say: no knowledge have we; verily Thou! Thou art the Great Knower of the things hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day Allah will gather the apostles and say, ‘What was the response to you?’ They will say, ‘We have no knowledge. Indeed You are knower of all that is Unseen.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One day will Allah gather the messengers together, and ask: \"What was the response ye received (from men to your teaching)?\" They will say: \"We have no knowledge: it is Thou Who knowest in full all that is hidden.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when Allah will gather the Messengers together and say to them: \"What was the response you received (from men to your teaching)? They will say: \"We have no knowledge, verily, only You are the All-Knower of all that is hidden (or unseen, etc.).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On a Day, Allah will gather all the Messengers and ask them: 'How were you answered' They will reply: 'We have no knowledge, You are the Knower of the unseen'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when God will gather the messengers, then say, “What response were you given?” They will say, “We have no knowledge; it is you who are the Knower of the unseen.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Be warned of] the Day when Allah will assemble the messengers and say, \"What was the response you received?\" They will say, \"We have no knowledge. Indeed, it is You who is Knower of the unseen\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:109] Mention, the day when God shall gather the messengers, which is the Day of Resurrection, and He will say, to them, as a rebuke for their peoples: ‘What answer were you given?’, when you summoned [them] to proclaim God’s Oneness; they shall say, ‘We have no knowledge, of this; You, only You, are the Knower of things unseen’, those things which are hidden from [God’s] servants and that which they [the messengers] have forgotten all knowledge of on account of the great terror of the Day of Resurrection and their fright; but when they have calmed down, they [proceed to] bear witness against their communities.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(In the day when Allah gathereth together the messengers) this is on the Day of Judgement, (and saith) in some place, at the time of bedazzlement: (What was your response (from mankind)) how did people respond to you? (They say) due to the intensity of the situation, which is that place: (We have no knowledge. Lo! Thou, only Thou art the Knower of Things Hidden) i.e. that which is hidden from us of the response of people. But later, they answer and testify that they have delivered the message to their people.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَوْمَ يَجْمَعُ ٱللَّهُ ٱلرُّسُلَ } في يوم العرض الأكبر { فَيَقُولُ } لهم على وجه التوبيخ: { مَاذَآ أُجِبْتُمْ } أي: بأي شيء أجبتم لهؤلاء العصاة المتجاوزين عن الحد؟ { قَالُواْ لاَ عِلْمَ لَنَآ } بحالهم\n ولا عذر لنا نعتذر عنهم { إِنَّكَ } بذاتك وأسمائك وأوصافك { أَنتَ } بخصوصيتك\n إذ لا غير معك { عَلاَّمُ ٱلْغُيُوبِ } [المائدة: 109] التي غابت عن عقولنا وأبصارنا وأسماعنا\n فلك الحكم الأمر\n نفعل ما تشاء\n وتحكم ما تريد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:65",
      "similarity": 0.7382626685474142
    },
    {
      "verse": "37:85",
      "similarity": 0.5068196178660171
    },
    {
      "verse": "4:39",
      "similarity": 0.48924756646234174
    },
    {
      "verse": "7:110",
      "similarity": 0.48816732632459625
    },
    {
      "verse": "31:11",
      "similarity": 0.448123299529096
    }
  ]
}