{
  "chapter": "المائدة",
  "text": "يايها الذين ءامنوا۟ عليكم انفسكم لا يضركم من ضل اذا اهتديتم الى الله مرجعكم جميعا فينبئكم بما كنتم تعملون",
  "translations": [
    {
      "translation": "You who have iman! you are only responsible for yourselves. The misguided cannot harm you as long as you are guided. All of you will return to Allah and He will inform you about what you were doing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, on you rests (the responsibility) for your own selves. If you follow the right path those who have gone astray will not be able to do you harm. To God have all of you to return, when He will tell you what you were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Take heed of your own selves. If you are rightly guided, the error of he who strays will not harm you. To Allah will all of you return; then He will let all of you know what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, save your own souls, for if you have the right guidance, no one who strays can harm you. You will all return to God who will tell you about what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Fear for your own souls; he who has strayed cannot harm you in the least if you are on guidance; towards Allah only you will all return – He will then inform you of what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Take care of yourselves. If you follow the right guidance, no hurt can come to you from those who are in error. The return of you all is to Allah, then He will inform you about (all) that you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! take care of your souls; he who errs cannot hurt you when you are on the right way; to Allah is your return, of all (of you), so He will inform you of what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, look after your own souls. He who is astray cannot hurt you, if you are rightly guided. Unto God shall you return, all together, and He will tell you what you were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Ye have charge of your own souls. He who erreth cannot injure you if ye are rightly guided. Unto Allah ye will all return; and then He will inform you of what ye used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, take care of your own souls. The misguided cannot harm you as long as you are guided. All of you will return to God. Then He will make you realize that which you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! on you resteth the case of yourselves; it can hurt you not as to whosoever strayeth so long as ye keep yourselves guided. Unto Allah is the return of you all; then He shall declare unto you that which ye were wont to work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Take care of your own souls. He who strays cannot hurt you if you are guided. To Allah will be the return of you all, whereat He will inform you concerning what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Guard your own souls: If ye follow (right) guidance, no hurt can come to you from those who stray. the goal of you all is to Allah: it is He that will show you the truth of all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Take care of your ownselves, [do righteous deeds, fear Allah much (abstain from all kinds of sins and evil deeds which He has forbidden) and love Allah much (perform all kinds of good deeds which He has ordained)]. If you follow the right guidance and enjoin what is right (Islamic Monotheism and all that Islam orders one to do) and forbid what is wrong (polytheism, disbelief and all that Islam has forbidden) no hurt can come to you from those who are in error. The return of you all is to Allah, then He will inform you about (all) that which you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, look after your own souls, he who goes astray cannot harm you if you are guided. You shall all return to Allah, and He will inform you of what you have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! You are responsible for your own souls. He who has strayed cannot harm you if you are guided. To God is you return, all of you, and He will inform you of what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, upon you is [responsibility for] yourselves. Those who have gone astray will not harm you when you have been guided. To Allah is you return all together; then He will inform you of what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:105] O you who believe, you are responsible for your own souls, in other words, preserve them and do what is in their best interest; he who is astray cannot hurt you, if you are rightly guided: it is said that this means, ‘None of those misguided ones from among the People of the Scripture can hurt you’; it is also said to mean others, on the basis of the [following] hadīth of Abū Tha‘laba al-Khushanī: ‘I asked the Messenger of God (s) about it [this verse] and he said, “Enjoin one other to decency and forbid one another indecency, and then if you see niggardliness being obeyed, whims being followed, this present world being preferred, and every intelligent person proud of his own opinions, then you are [still] responsible for [looking after] your own soul”,’ as reported by al-Hākim and others. Unto God you shall return, all together, and He will inform you of what you used to do, and requite you for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتذييل جرى على مناسبة في الانتقال فإنّه لما ذكر مكابرة المشركين وإعراضهم عن دعوة الخير عقّبه بتعليم المسلمين حدود انتهاء المناظرة والمجادلة إذا ظهرت المكابرة ، وعذر المسلمين بكفاية قيامهم بما افترض الله عليهم من الدعوة إلى الخير ، فأعلمهم هنا أن ليس تحصيل أثر الدعاء على الخير بمسؤولين عنه ، بل على الداعي بذل جهده وما عليه إذا لم يصغ المدعوّ إلى الدعوة ، كما قال تعالى : { إنّك لا تهدي من أحببت ولكن الله يهدي من يشاء } \\[ القصص : 56 \\] .و { عليكم } اسم فعل بمعنى الزَموا ، وذلك أنّ أصله أن يقال : عليك أن تفعل كذا ، فتكون جملة من خبر مقدّم ومبتدأ مؤخّر ، وتكون ( على ) دالّة على استعلاء مجازي ، كأنّهم جعلوا فعل كذا معتلياً على المخاطب ومتمكّناً منه تأكيداً لمعنى الوجوب فلمّا كثر في كلامهم قالوا : عليك كذا ، فركّبوا الجملة من مجرور خبر واسم ذات مبتدأ بتقدير : عليك فعل كذا ، لأنّ تلك الذات لا توصف بالعلوّ على المخاطب ، أي التمكّن ، فالكلام على تقدير . وذلك كتعلّق التحريم والتحليل بالذوات في قوله : { حرّمت عليكم الميتة } \\[ المائدة : 3 \\] ، وقوله { أحلّت لكم بهيمة الأنعام } \\[ المائدة : 1 \\] ، ومن ذلك ما روي { عليكم الدعاء وعليّ الإجابة } ومنه قولهم : عليّ أليّة ، وعليّ نذر . ثم كثر الاستعمال فعاملوا ( على ) معاملة فعل الأمر فجعلوها بمعنى أمر المخاطب بالملازمة ونصبوا الاسم بعدها على المفعولية . وشاع ذلك في كلامهم فسمّاها النحاة اسم فعل لأنّها جعلت كالاسم لمعنى أمر مخصوص ، فكأنّك عمدت إلى فعل ( الزم ) فسميّته ( عَلَى ) وأبرزت مَا مَعه من ضمير فألصقته ب ( عَلى ) في صورة الضمير الذي اعتيد أن يتّصل بها ، وهو ضمير الجرّ فيقال : عليك وعليكما وعليكم . ولذلك لا يسند إلى ضمائر الغيبة لأنّ الغائب لا يؤمر بصيغة الأمر بل يؤمر بواسطة لام الأمر .فقوله تعالى : { عليكم أنفسكم } هو بنصب { أنفسكم } أي الزموا أنفسكم ، أي احرصوا على أنفسكم . والمقام يبيّن المحروص عليه ، وهو ملازمة الاهتداء بقرينة قوله : { إذا اهتديتم } ، وهو يشعر بالإعراض عن الغير وقد بيّنه بقوله : { لاَ يضرّكم من ضلّ } .فجملة { لا يضرّكم من ضلّ } تتنزّل من التي قبلها منزلة البيان فلذلك فصلت ، لأنّ أمرهم بملازمة أنفسهم مقصود منه دفع ما اعتراهم من الغمّ والأسف على عدم قبول الضالّين للاهتداء ، وخشية أن يكون ذلك لتقصير في دعوتهم ، فقيل لهم : عليكم أنفسكم ، أي اشتغلوا بإكمال اهتدائكم ، ففعل { يضرّكم } مرفوع .وقوله : { إذا اهتديتم } ظرف يتضمّن معنى الشرط يتعلّق ب { يضرّكم } . وقد شمل الاهتداء جميع ما أمرهم به الله تعالى . ومن جملة ذلك دعوة الناس إلى الخير والأمر بالمعروف والنهي عن المنكر ، فلو قصروا في الدعوة إلى الخير والاحتجاج له وسكتوا عن المنكر لضرّهم من ضلّ لأنّ إثم ضلاله محمول عليهم .فلا يتوهّم من هذه الآية أنّها رخصة للمسلمين في ترك الدعوة إلى الخير والأمر بالمعروف والنهي عن المنكر ، لأنّ جميع ذلك واجب بأدلّة طفحت بها الشريعة . فكان ذلك داخلاً في شرط { إذا اهتديتم } . ولما في قوله { عليكم أنفسكم } من الإشعار بالإعراض عن فريق آخر وهو المبيّين بِ { من ضلّ } ، ولما في قوله { إذا اهتديتم } من خفاء تفاريع أنواع الاهتداء؛ عرض لبعض الناس قديماً في هذه الآية فشكّوا في أن يكون مُفادها الترخيص في ترك الأمر بالمعروف والنهي عن المنكر . وقد حدث ذلك الظنّ في عهد النبي صلى الله عليه وسلمأخرج الترمذي عن أبي أمية الشعباني أنّه قال : سألت عنها أبا ثعلبة الخشني ، فقال لي : سألتَ عنها خبيراً ، سألتُ عنها رسول الله صلى الله عليه وسلم فقال : \" بل ائتمروا بالمعروف وتناهَوا عن المنكر حتّى إذا رأيت شحّاً مُطَاعَاً وهوى مُتَّبعاً وَدنْيَا مُؤثرَة وإعجابَ كلّ ذي رأي برأيه فعليك بخاصّة نفسك ودَعَ العوّام \" وَحَدَثَ في زَمَن أبي بكر : أخرَجَ أصحابُ «السنن» أنّ أبا بكر الصديق بلغه أنّ بعض الناس تأوّل الآية بسقوط وجوب الأمر بالمعروف والنهي عن المنكر فصعد المنبر فحمد الله وأثنى عليه ثم قال : { يأيّها الناس إنّكم تَقْرَأونَ هذه الآية يأيها الذين آمنوا عليكم أنفسكم لا يضرّكم من ضلّ إذا اهتديتم } وإنّكم تضعونها على غير موضعها وإنّي سمعت رسول الله صلى الله عليه وسلم يقول : إنّ الناس إذا رأوا المنكر ولا يغيّرونه يوشك الله أن يعمّهم بعقابه ، وإنّ الناس إذا رأوا الظالم فلم يأخذوا على يديه أوشك أن يعمّهم الله بعذاب من عنده . وعن ابن مسعود أنّه قرئت عنده هذه الآية فقال : إنّ هذا ليس بزمانها إنّها اليوم مقبولة ( أي النصيحة ) ولكن يوشك أن يأتي زمان تأمرون فلا يُقبل منكم فحينئذٍ عليكم أنفسكم ( يريد أن لا يجب عليهم قتال لتقبل نصيحتهم ) . وعنه أيضاً : إذا اختلفت القلوب وألبستم شيعاً وذاق بعضكم بأس بعض فامرُؤ ونفسه . وعن عبد الله بن عمر أنه قال : إنّها ( أي هذه الآية ) ليست لي ولا لأصحابي لأنّ رسول الله قال : \" ألا ليبلّغ الشاهد الغائب \" فكنّا نحن الشهود وأنتم الغيّب ، ولكن هذه الآية لأقوام يجيؤون من بعدنا إن قالوا لم يقبل منهم .فماصْدقُ هذه الآية هو مَاصْدقُ قول النبي صلى الله عليه وسلم في تغيير المنكر : \" من رأى منكم منكراً فليغيِّره بيده فإن لم يستطع فبلسانه فإن لم يستطع فبقلبه وذلك أضعف الإيمان \" فإنّ معنى الاستطاعة التمكّن من التغيير دون ضُرّ يلحقه أو يلحق عموم الناس كالفتنة . فالآية تفيد الإعراض عن ذلك إذا تحقّق عدم الجدوى بعد الشروع في ذلك ، ويلحق بذلك إذا ظهرت المكابرة وعدم الانتصاح كما دلّ عليه حديث أبي ثعلبة الخشني ، وكذلك إذا خيف حصول الضرّ للداعي بدون جدوى ، كما دلّ عليه كلام ابن مسعود المذكور آنفاً .وقوله : { إلى الله مرجعكم جميعاً } عذر للمهتدي ونذارة للضالّ . وقدّم المجرور للاهتمام بمتعلّق هذا الرجوع وإلقاء المهابة في نفوس السامعين ، وأكّد ضمير المخاطبين بقوله : { جميعاً } للتنصيص على العموم وأن ليس الكلام على التغليب . والمراد بالإنباء بما كانوا يعملون الكناية عن إظهار أثر ذلك من الثواب للمهتدي الداعي إلى الخير ، والعذاب للضالّ المعرض عن الدعوة .والمرجع مصدر ميمي لا محالة ، بدليل تعديته ب { إلى } ، وهو ممّا جاء من المصادر الميمية بكسر العين على القليل ، لأنّ المشهود في الميمي مِن يَفعِل بكسر العين أن يكون مفتوح العين .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe! Ye have charge of your own souls) hasten to save your own persons. (He who erreth) the error of the one who errs (cannot injure you if you are rightly guided) to faith and further show their error. (Unto Allah ye will all return) after you die; (and then He will inform you of what ye used to do) and say of good and evil. This verse was revealed about the idolaters of Mecca when the Prophet (pbuh) accepted the capitation tax from the people of the Book and then refused to take it from them. This story has already been mentioned in surah al-Baqarah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ عَلَيْكُمْ } أن تحفظوا { أَنْفُسَكُمْ } وتلازموها على الطاعات وتداوموها على التوجه نحو الحق في جميع الحالات\n وما لكم إلا حفظ نفوسكم { لاَ يَضُرُّكُمْ } ضلالة { مَّن ضَلَّ } عن طريق الحق { إِذَا ٱهْتَدَيْتُمْ } إليه\n واعلموا أيها المؤمنون { إِلَى ٱللَّهِ } المبدئ\n المعيد { مَرْجِعُكُمْ } وهم { جَمِيعاً فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ تَعْمَلُونَ } [المائدة: 105] في دينكم من شر وخير\n ومعصية وطاعة\n ويجازيكم عليه\n\n\n{ يِآ أَيُّهَا ٱلَّذِينَ آمَنُواْ } من جملة الأمور التي يجب عليكم محافظتها: { شَهَادَةُ بَيْنِكُمْ } أي: إشهادكم { إِذَا حَضَرَ أَحَدَكُمُ ٱلْمَوْتُ } أن يُشهدوا { حِينَ ٱلْوَصِيَّةِ ٱثْنَانِ ذَوَا عَدْلٍ مِّنْكُمْ } أي: من أقاربكم وعشائركم { أَوْ آخَرَانِ مِنْ غَيْرِكُمْ } من جانب المسلمين وأهل الذمة { إِنْ أَنتُمْ ضَرَبْتُمْ } سافرتم { فِي ٱلأَرْضِ } متباعدين عن الأقارب والعشائر { فَأَصَابَتْكُم } فيها { مُّصِيبَةُ ٱلْمَوْتِ تَحْبِسُونَهُمَا } أي: الآخران من الأجانب",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { عليكم }: اسم فعل، وفاعله مستتر فيه وجوبًا، و { أنفسكم }: مفعول به على حذف مضاف أي: الزموا شأن أنفسكم. قاله الأزهري. يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا عليكم أنفسكم }: احفظوها والزموا صلاحها، { لا يضرّكم مَن ضلّ إذا اهتديتم } أنتم، أي: لا يضركم ضلال غيركم إذا كنتم مهتدين ومن الاهتداء أن ينكر المنكر حسب طاقته، قال صلى الله عليه وسلم:\n \" مَن رَأى مِنكُم مُنكَرًا، واستطَاعَ أن يُغيِّره بَيدِه، فَليغَيِّر، فإنَّ لم يَستَطِع فَبِلسانِه، فإن لم يَستَطعِ فَبقَلبِه \" \nوالآية نزلت حيث كان المؤمنون يحرصون على الكفرة، ويتمنون إيمانهم، وقيل: كان الرجل إذا أسلم قالوا له: سفهت آباءك، فلاموه، فنزلت. وعن أبي ثعلبة الخشني قال: سألت رسول الله صلى الله عليه وسلم عن قوله تعالى: { يا أيها الذين آمنوا عليكم أنفسكم }؟ فقال:\n \" أئتِمَرُوا بالمَعرُوِفِ، وانهوا عن المُنكَرِ، فإذَا رَأيتَ دُنيا مُؤثَرةٍ، وشُحًا مُطاعًا، وإعجَابَ كُلِّ ذِي رأي بِرأيِه، فَعَليكَ بخويصة نَفسِك، وَذَر عوامَهم فإنّ وَراءكُم أيامًا، العامِلُ فيها كأجرِ خَمسِينَ مِنكُم \". \nوعن أبي بكر الصديق رضي الله عنه أنه بلغه أن بعض الناس تأول الآية على أنه لا يلزم معها أمر ولا نهي، فصعد المنبر، فقال: يا أيها الناس: لا تغتروا بقول الله تعالى: { عليكم أنفسكم } فيقول أحدكم: عليّ نفسي، والله لتأمُرن بالمعروف، ولتنهَوُنَّ عن المنكر أو ليستعملن عليكم شرارَكم فليسُومُنكم سوء العذاب. وعن ابن مسعود رضي الله عنه قال: ليس هذا بزمان هذه الآية، قولوا الحق ما قُبِلَ منكم، فإذا رُدّ عليكم فعليكم أنفسكم.  قال ابن عطية: وجملة ما عليه أهل العلم في هذا: أن الأمر بالمعروف متعين متى رجى القبول، أو رجى رد المظالم، ولو بعُنف، ما لم يخف الآمِرُ ضررًا يلحقه في خاصته، أو فتنة يدخلها عن المسلمين، إما بشق عصًا، وإما بضرر يلحق طائفة من الناس، فإذا خيف هذا فعليكم أنفسكم، حُكمٌ واجب أن يوقف عنده. هـ. ثم هدد مَن لم ينته، فقال: { إلى الله مرجعكم جميعًا فَيُنَبِّئُكم بما كنتم تعملون } وفيه تنبيه على أن أحدًا لا يؤاخذ بذنب غيره، وتسليةٌ عن أمور الدنيا مكروهها ومحبوبها، بذكر الحشر وما بعده، وعن بعض الصالحين أنه قال: ما من يوم إلا يجيئني الشيطان فيقول: ما تأكل؟ وما تلبس؟ وأين تسكن؟ فأقول له: آكل الموت، وألبس الكفن، وأسكن القبور. هـ. الإشارة: في الآية إغراء وتحضيض على الاعتناء بإصلاح النفوس وتطهيرها من الرذائل، وتحليتها بالفضائل، قال تعالى: { يا أيها الذين آمنوا } عليكم بإصلاح أنفسكم أولاً، فإذا صلحت فأصلحوا غيركم، فعلى العبد أن يشتغل بشأن نفسه ولا يلتفت إلى غيره، حتى إذا كمل تطهيرُها، وفرغ من تأديبها، فإن أمره الحق ـ جل جلاله ـ بإصلاح غيره على لسان شيخ كامل، أو هاتف حقيقي، فليتقدم لذلك، فإنه حينئٍذ محمول محفوظ مأذون، وإلا فعليه بخاصة نفسه، كما تقدم. والله ـ تعالى ـ أعلم. ولما جَرَى ذكر المرجع وما بعدها، ولا يكون إلا بالموت، ناسب أن يذكر الوصية، التي من شأنها أن تكون عندها، فقال: { يِا أَيُّهَا ٱلَّذِينَ آمَنُواْ شَهَادَةُ بَيْنِكُمْ إِذَا حَضَرَ أَحَدَكُمُ ٱلْمَوْتُ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:89",
      "similarity": 0.4010161514722938
    },
    {
      "verse": "10:23",
      "similarity": 0.38863044346080605
    },
    {
      "verse": "45:15",
      "similarity": 0.35918141097682593
    },
    {
      "verse": "7:158",
      "similarity": 0.3582470694284424
    },
    {
      "verse": "10:108",
      "similarity": 0.3546073759015316
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005105.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005105.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:105.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}