{
  "chapter": "المائدة",
  "text": "قل لا يستوى الخبيث والطيب ولو اعجبك كثرة الخبيث فاتقوا۟ الله ياو۟لى الالبب لعلكم تفلحون",
  "translations": [
    {
      "translation": "Say: 'Bad things and good things are not the same, even though the abundance of the bad things may seem attractive to you.' Have taqwa of Allah, people of intelligence, so that hopefully you will be successful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"The unclean and the pure are not equal, even though the abundance of the unclean may be pleasing to you.\" So fear God, O men of wisdom; you may haply find success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Messenger!) Say to them: \"The bad things and the good things are not equal, even though the abundance of the bad things might make you pleased with them. Men of understanding, beware of disobeying Allah; then maybe you will attain true success.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say to them, \"The pure and filthy are not the same even though the abundance of filth may attract you. Men of reason, have fear of God so that you may have eternal happiness.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “The impure (evil) and the pure (good) are not equal, even though the abundance of the impure may attract you; therefore keep fearing Allah, O men of intellect, so that you may succeed.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Not equal are the bad things and the good things, even though the abundance of the bad may please you. \" So have Taqwa of Allah, O men of understanding in order that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: The bad and the good are not equal, though the abundance of the bad may please you; so be careful of (your duty to) Allah, O men of understanding, that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'The corrupt and the good are not equal, though the abundance of the corrupt please thee.' So fear God, O men possessed of minds; haply so you will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: The evil and the good are not alike even though the plenty of the evil attract thee. So be mindful of your duty to Allah, O men of understanding, that ye may succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"The bad and the good are not alike, even though the abundance of the bad may appear pleasing to you. So fear God, O men of understanding, so that you may prosper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: equal are not the foul and the pure, even though the abundance of the foul may astonish thee; wherefore fear Allah, ye men of understanding! that haply ye may fare well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘The good and the bad are not equal, though the abundance of the bad should amaze you.’ So be wary of Allah, O you who possess intellect, so that you may be felicitous!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Not equal are things that are bad and things that are good, even though the abundance of the bad may dazzle thee; so fear Allah, O ye that understand; that (so) ye may prosper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Not equal are Al-Khabith (all that is evil and bad as regards things, deeds, beliefs, persons, foods, etc.) and At-Taiyib (all that is good as regards things, deeds, beliefs, persons, foods, etc.), even though the abundance of Al-Khabith (evil) may please you.\" So fear Allah much [(abstain from all kinds of sins and evil deeds which He has forbidden) and love Allah much (perform all kinds of good deeds which He has ordained)], O men of understanding in order that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'The evil and the good are not alike, even if the abundance of evil pleases you. Have fear of Allah, you who are possessed of minds, in order that you prosper'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: “The bad and the good are not equal, even though the abundance of the bad may impress you. So be conscious of God, O you who possess intelligence, that you may succeed.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Not equal are the evil and the good, although the abundance of evil might impress you.\" So fear Allah, O you of understanding, that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:100] Say: ‘The evil, the unlawful, and the good, the lawful, are not equal, even though the abundance of the evil attract you.’ So fear God, in avoiding it, O people of pith, so that you might prosper, triumph.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلما آذن قوله : { اعلموا أنّ الله شديد العقاب وأنّ الله غفور رحيم } \\[ المائدة : 98 \\] وقوله : { والله يعلم ما تبدون وما تكتمون } \\[ المائدة : 99 \\] بأنّ الناس فريقان : مطيعون وعصاة ، فريق عاندوا الرسول ولم يمتثلوا ، وهم من بقي من أهل الشرك ومن عاضدهم من المنافقين ، وربما كانوا يظهرون للقبائل أنّهم جمع كثير ، وأنّ مثلهم لا يكون على خطأ ، فأزال الله الأوهام التي خامرت نفوسهم فكانت فتنة أو حجّة ضالّة يموّه بها بعض منهم على المهتدين من المسلمين . فالآية تؤذن بأن قد وجدت كثرة من أشياء فاسدة خيف أن تستهوي من كانوا بقلّة من الأشياء الصالحة ، فيحتمل أن تكون تلك الكثرة كثرة عدد في الناس إذ معلوم في متعارف العرب في الجاهلية وفي أول الإسلام الاعتزاز بالكثرة والإعجاب بها . قال الأعشى :ولستَ بالأكثرِ منهم حصًى ... وإنّما العزّة للكاثروقال السموأل أو عبد الملك الحارثي :تعيّرنا أنّا قليل عَدِيدنَا ... وقد تعجّب العنبري إذ لام قومه فقال :لكنّ قومي وإن كانوا ذوي عَدد ... ليسوا من الشرّ في شيء وإن هاناقال السديّ : كثرة الخبيث هم المشركون ، والطيّب هم المؤمنون . وهذا المعنى يناسب لو يكون نزول هذه الآية قبل حجّة الوداع حين كان المشركون أكثر عدداً من المسلمين؛ لكن هذه السورة كلّها نزلت في عام حجّة الوداع فيمكن أن تكون إشارة إلى كثرة نصارى العرب في الشام والعراق ومشارف الشام لأنّ المسلمين قد تطلّعوا يومئذٍ إلى تلك الأصقاع ، وقيل : أريد منها الحرام والحلال من المال ، ونقل عن الحسن .ومعنى { لا يستوي } نفي المساواة ، وهي المماثلة والمقاربة والمشابهة . والمقصود منه إثبات المفاضلة بينهما بطريق الكناية ، والمقام هو الذي يعيّن الفاضل من المفضول ، فإنّ جعل أحدهما خبيثاً والآخر طيّباً يعيّن أنّ المراد تفضيل الطيّب . وتقدّم عند قوله تعالى : { ليسوا سواء } في سورة آل عمران ( 113 ) . ولمّا كان من المعلوم أنّ الخبيث لا يساوي الطيّب وأنّ البون بينهما بعيد ، علم السامع من هذا أنّ المقصود استنزال فهمه إلى تمييز الخبيث من الطيّب في كلّ ما يلتبس فيه أحدهما بالآخر ، وهذا فتح لبصائر الغافلين كيلا يقعوا في مهواة الالتباس ليعلموا أنّ ثمّة خبيثاً قد التفّ في لباس الحسن فتموّه على الناظرين ، ولذلك قال ولو أعجبك كثرة الخبيث } . فكان الخبيث المقصود في الآية شيئاً تلبّس بالكثرة فراق في أعين الناظرين لكثرته ، ففتح أعينهم للتأمّل فيه ليعلموا خبثه ولا تعجبهم كثرته .فقوله : { ولو أعجبك كثرة الخبيث } من جملة المقول المأمور به النبيءُ صلى الله عليه وسلم أي قُل لهم هذا كلّه ، فالكاف في قوله : { أعجبك } للخطاب ، والمخاطب بها غير معيَّن بل كلّ من يصلح للخطاب ، مثل { ولو ترى إذ وقفوا على النار } \\[ الأنعام : 27 \\] ، أي ولو أعجبَ مُعْجَبا كثرةُ الخبيث .وقد علمت وجه الإعجاب بالكثرة في أول هذه الآية .وليس قوله : { ولو أعجبك كثرة الخبيث } بمقتض أنّ كلّ خبيث يكون كثيراً ولا أن يكون أكثر من الطيِّب من جنسه ، فإنّ طيِّب التَمر والبرّ والثمار أكثر من خبيثها ، وإنّما المراد أن لا تعجبكم من الخبيث كثرته إذا كان كثيراً فتصرفكم عن التأمّل من خبثه وتحدُوَكم إلى متابعته لكثرته ، أي ولكن انظروا إلى الأشياء بصفاتها ومعانيها لا بأشكالها ومبانيها ، أو كثرةُ الخبيث في ذلك الوقت بوفرة أهل الملل الضالّة . والإعجاب يأتي الكلام عليه عند قوله تعالى : { فلا تُعْجبْك أمْوالهم ولا أولادهم } في سورة براءة ( 55 ) .وفي تفسير ابن عرفة } قال : «وكنت بحثت مع ابن عبد السلام وقلت له : هذه تدلّ على الترجيح بالكثرة في الشهادة لأنّهم اختلفوا إذا شهد عدلان بأمر وشهد عشرة عدول بضدّه ، فالمشهور أن لا فرق بين العشرة والعدلين ، وهما متكاملان . وفي المذهب قول آخر بالترجيح بالكثرة . فقوله : { ولو أعجبك كثرة الخبيث } يدلّ على أنّ الكثرة لها اعتبار بحيث إنّها ما أسقطت هنا إلاّ للخبث ، ولم يوافقني عليه ابن عبد السلام بوجه . ثم وجدت ابن المنير ذكره بعينه» اه .والواو في قوله { ولو أعجبك } واو الحال ، و { لو } اتّصالية ، وقد تقدّم بيان معناهما عند قوله تعالى : { فلن يقبل من أحدهم ملْءُ الأرض ذهباً ولو افتدى به } في سورة آل عمران ( 91 ) .وتفريع قوله : فاتّقوا الله يا أولى الألباب } على ذلك مؤذن بأنّ الله يريد منّا إعمال النظر في تمييز الخبيث من الطيّب ، والبحث عن الحقائق ، وعدم الاغترار بالمظاهر الخلابة الكاذبة ، فإنّ الأمر بالتقوى يستلزم الأمر بالنظر في تمييز الأفعال حتى يُعرف ما هو تقوى دون غيره .ونظير هذا الاستدلال استدلاللِ العلماء على وجوب الاجتهاد بقوله تعالى : { فاتّقوا الله ما استطعتم } \\[ التغابن : 16 \\] ، لأنّ ممّا يدخل تحت الاستطاعة الاجتهاد بالنسبة للمتأهّل إليه الثابت له اكتساب أداته . ولذلك قال هنا : { يأولي الألباب } فخاطب الناس بصفة ليؤمىء إلى أنّ خلق العقول فيهم يمكِّنهم من التمييز بين الخبيث والطيّب لاتّباع الطيّب ونبذ الخبيث . ومن أهمّ ما يظهر فيه امتثال هذا الأمر النظر في دلائل صدق دعوى الرسول وأن لا يحتاج في ذلك إلى تطلّب الآيات والخوارق كحال الذين حكى الله عنهم { وقالوا لن نؤمن لك حتى تفجّر لنا من الأرض ينبوعاً } \\[ الإسراء : 90 \\] الآية ، وأن يميّز بين حال الرسول وحال السحرة والكهّان وإن كان عددهم كثيراً .وقوله : { لعلّكم تفلحون } تقريب لحصول الفلاح بهم إذا اتّقوا هذه التقوى التي منها تمييز الخبيث من الطيّب وعدم الاغترار بكثرة الخبيث وقلّة الطيّب في هذا .\n\n",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the people of Sarh who brought Shurayh's property: (The evil) the unlawful: Shurayh's property, (and the good) the lawful property which Shurayh brought (are not alike even though the plenty of the evil) that which is unlawful (attract thee. So be mindful of your duty to Allah) fear Allah regarding taking that which is unlawful, (0 men of understanding) people possessed of mind and reason, (that ye may succeed) that you may be saved from Allah's wrath and torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قُلْ لا يَسْتَوي الخَبِيث } من النفوس والأعمال والأخلاق والأموال { والطيب } منها عند الله تعالى\n فإنّ الطيب مقبول موجب للقرب والوصول والخبيث منها مردود موجب للبعد والطرد والحرمان { ولو أعجبك } الخبيث بكثرته ووفوره لمناسبته للنفس ولملاءمته لصفاتها\n فاجعلوا الله وقاية لكم في الاجتناب عن الخبيث واختيار الطيب\n يأكل من له لبّ أي: عقل خالص عن شوب الوهم ومزج هوى النفس { لعلكم تفلحون } بالخلاص عن نفوسكم وصفاتها وخبائثها والوصول إلى الله بالفناء فيه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { قل لا يستوي الخبيث والطيب } عند الله، في القلوب والأحوال والأعمال والأموال والأشخاص، فالطيب من ذلك كله مقبول محبوب، والرديء مردود ممقوت، فالطيب مقبول وإن قلّ، والرديء مردود ولو جلّ، وهو معنى قوله: { ولو أعجبك كثرة الخبيث } ، فالعبرة بالجودة والرداءة، دون القلة والكثرة، وقد جرت عادته ـ تعالى ـ بكثرة الخبيث من كل شيء، وقلة الطيب من كل شيء، قال تعالى:\n[صَ:24]،\n[سَبَأ:13]، وفي الحديث الصحيح:\n \" النّاسُ كإبلٍ مِائةٍ لا تكادُ تَجِدُ فيها رَاحِلةَ \" \n، وقال الشاعر:\nفأهل الصفا قليل في كل زمان، ولذلك خاطبهم بقوله: { فاتقوا الله يا أولي الألباب } أي: القلوب الصافية في تجنب الخبيث وإن كثر، وأخذ الطيب وإن قلّ، { لعلكم تُفلحون } بصلاح الدارين. الإشارة: لا عبرة بالأحوال الظلمانية وإن كثرت، وإنما العبرة بالأحوال الصافية ولو قلّت، صاحب الأحوال الصافية موصول، وصاحب الأحوال الظلمانية مقطوع، ما لم يتب عنها، قال بعض الحكماء: كما لا يصح دفن الزرع في أرض ردية، لا يجوز الخمول بحال غير مرضية. والمراد بالأحوال الصافية: هي التي توافق مراسم الشريعة بحيث لا يكون عليها من الشارع اعتراض، بأن تكون مباحة في أصل الشريعة، ولو أخلت بالمروءة عند العوام، إذ المروءة إنما هي التقوى عند الخواص، والمراد بالأحوال، كل ما يثقل على النفس وتموت به سريعًا، كالمشي بالحفا وتعرية الرأس، والأكل في السوق، والسؤال، وغير ذلك من خرق عوائدها، التي هي شرط في حصول خصوصيتها، وفي الحِكَم: \" كيف تخرق لك العوائد؟ وأنت لم تخرق من نفسك العوائد \". وبالله التوفيق. ومن جملة الأحوال الرديئة: كثرة الخوض فيما لا يعني، التي أشار إليه بقوله: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ لاَ تَسْأَلُواْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:26",
      "similarity": 0.4953159858133291
    },
    {
      "verse": "21:74",
      "similarity": 0.3938480925783484
    },
    {
      "verse": "2:179",
      "similarity": 0.39279573549138375
    },
    {
      "verse": "2:269",
      "similarity": 0.38193910328821695
    },
    {
      "verse": "40:54",
      "similarity": 0.3699576043738711
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005100.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005100.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:100.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}