{
  "chapter": "المائدة",
  "text": "يايها الذين ءامنوا۟ شهدة بينكم اذا حضر احدكم الموت حين الوصية اثنان ذوا عدل منكم او ءاخران من غيركم ان انتم ضربتم فى الارض فاصبتكم مصيبة الموت تحبسونهما منۢ بعد الصلوة فيقسمان بالله ان ارتبتم لا نشترى به ثمنا ولو كان ذا قربى ولا نكتم شهدة الله انا اذا لمن الءاثمين",
  "translations": [
    {
      "translation": "You who have iman! when one of you is near to death and makes a will, two just men from among you should act as witnesses; or, if you are travelling when the misfortune of death occurs, two men who are strangers to you. You should detain them after salat and, if you are doubtful, they should swear by Allah: 'We will not sell it for any price, even to a near relative, and we will not conceal the testimony of Allah. If we did we would indeed be wrongdoers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, let two honest men among you be witness when you dictate your last will and testament as (the hour of) death draws near; and if death approaches while you are on a journey, two men other than yours. Detain them after the service of prayer, and if you doubt their word make them swear by God that: \"We shall not take a bribe even though it be offered by a near relative, nor hide the testimony of God, for then we shall surely be sinful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! When death approaches you, let two men of equity among you act as witnesses when you make your bequest; or let two of those from others than yourselves act as witnesses if you are on a journey when the affliction of death befalls you. Then if any doubt occurs you shall detain both of them (in the mosque) after the Prayer, and they shall swear by Allah: 'We shall neither sell our testimony in return for any gain even though it concerns any near of kin nor shall we conceal our testimony which we owe to Allah, for then we should become among sinners.'.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when death approaches any one of you, let two just men from your own people (Muslims) or any two other men (People of the Book) if death befalls you on a journey, bear witness to the bequest. If you have any doubts as to their honesty, detain them and let them take an oath after the prayer, each one of them saying, \"I swear by God that my testimony is true. I am not selling the Truth for a paltry price even though the beneficiary would be one of my relatives. I do not hide the testimony which is the right of God, for then I would be one of the sinners.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! The witnesses between you when death approaches any one of you, at the time of making a will, should be two reliable men from among you, or two from another tribe in case you are travelling in the land and the event of death approaches you; engage them after the prayers, and if you doubt, they must swear by Allah that, “We shall not exchange our oaths for any price even if he is a near relative, nor will we hide the testimony of Allah – if we do, then surely we are of the sinners.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When death approaches any of you, and you make a bequest, then take the testimony of two just men of your own folk or two others from outside, if you are traveling through the land and the calamity of death befalls you. Detain them both after the Salah (the prayer), (then) if you are in doubt (about their truthfulness), let them both swear by Allah (saying): \"We wish not for any worldly gain in this, even though he (the beneficiary) be our near relative. We shall not hide the testimony of Allah, for then indeed we should be of the sinful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! call to witness between you when death draws nigh to one of you, at the time of making the will, two just persons from among you, or two others from among others than you, if you are travelling in the land and the calamity of death befalls you; the two (witnesses) you should detain after the prayer; then if you doubt (them), they shall both swear by Allah, (saying): We will not take for it a price, though there be a relative, and we will not hide the testimony of Allah for then certainly we should be among the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, the testimony between you when any of you is visited by death, at the bequeathing, shall be two men of equity among you; or two others from another folk, if you are journeying in the land and the affliction of death befalls you. Them you shall detain after the prayer, and they shall swear by God, if you are doubtful, 'We will not sell it for a price, even though it were a near kinsman, nor will we hide the testimony of God, for then we would surely be among the sinful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Let there be witnesses between you when death draweth nigh unto one of you, at the time of bequest - two witnesses, just men from among you, or two others from another tribe, in case ye are campaigning in the land and the calamity of death befall you. Ye shall empanel them both after the prayer, and, if ye doubt, they shall be made to swear by Allah (saying): We will not take a bribe, even though it were (on behalf of) a near kinsman nor will we hide the testimony of Allah, for then indeed we should be of the sinful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when death approaches you, let two just men from among you act as witnesses when you make your testaments; or two men from another tribe, if the calamity of death overtakes you while you are travelling in the land. Detain them after prayers, and if you doubt their honesty, let them swear by God, \"We will not sell our testimony for any price, even to a kinsman. And we will not conceal the testimony of God. If we did, we would indeed be guilty of sin.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! the testimony amongst you, when death presenteth itself to you, at the making of a bequest shall be that of two equitable persons from amongst you, or two others from amongst those not of you, if ye be journeying in the earth and the affliction of death afflicteth you. O Ye shall detain the twain after the prayer, if ye be in doubt, and they shall swear by Allah affirming: we shall not barter it for a price, even though he be a kinsman, and we shall not hide the testimony of Allah, for then verily we shall be of the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! The witness between you, when death approaches any of you, while making a bequest, shall be two fair men from among yourselves—or two from among others, if you are journeying in the land and the affliction of death visits you. You shall detain the two of them after the prayer, and, if you have any doubt, they shall vow by Allah, ‘We will not sell it for any gain, even if it were a relative, nor will we conceal the testimony of Allah, for then we would indeed be among the sinners.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! When death approaches any of you, (take) witnesses among yourselves when making bequests,- two just men of your own (brotherhood) or others from outside if ye are journeying through the earth, and the chance of death befalls you (thus). If ye doubt (their truth), detain them both after prayer, and let them both swear by Allah: \"We wish not in this for any worldly gain, even though the (beneficiary) be our near relation: we shall hide not the evidence before Allah: if we do, then behold! the sin be upon us!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When death approaches any of you, and you make a bequest, then take the testimony of two just men of your own folk or two others from outside, if you are travelling through the land and the calamity of death befalls you. Detain them both after As-Salat (the prayer), (then) if you are in doubt (about their truthfulness), let them both swear by Allah (saying): \"We wish not for any worldly gain in this, even though he (the beneficiary) be our near relative. We shall not hide Testimony of Allah, for then indeed we should be of the sinful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you are traveling in the land and the affliction of death befalls you, at the bequeathing testimony shall be two just men from among you, or two others from other than you. You shall detain both after the prayer, and they shall swear by Allah if you are doubtful: 'We will not sell it for a price, even though it were a near kinsmen, nor will we hide the testimony of Allah, because then we would surely be among the sinful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When death approaches one of you, let two reliable persons from among you act as witnesses to the making of a bequest, or two persons from another people if you are travelling in the land and the event of death approaches you. Engage them after the prayer. If you have doubts, let them swear by God: “We will not sell our testimony for any price, even if he was a near relative, and we will not conceal God’s testimony, for then we would be sinners.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, testimony [should be taken] among you when death approaches one of you at the time of bequest - [that of] two just men from among you or two others from outside if you are traveling through the land and the disaster of death should strike you. Detain them after the prayer and let them both swear by Allah if you doubt [their testimony, saying], \"We will not exchange our oath for a price, even if he should be a near relative, and we will not withhold the testimony of Allah. Indeed, we would then be of the sinful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:106] O you who believe, let testimony between you, when death, that is, [one of] its causes, draws near to one of you, at the time of a bequest, be that of two men of justice among you (ithnāni dhawā ‘adlin minkum, ‘two men of justice among you’, is the predicate expressed with the sense of an imperative, in other words, ‘let [two men] bear witness … [etc.]’; the genitive annexation of shahāda, ‘testimony’, and bayn, ‘between’, is meant to allow for a range [of alternatives]; hīn, ‘at the time of’, is a substitute for idhā, ‘when’, or an adverbial qualifier of time for [the verb] hadara, ‘draws near’); or of two others from another folk, that is, [from] other than your own religious community, if you are travelling in the land and the affliction of death befalls you. Then you shall empanel them, you shall detain them (tahbisūnahumā, ‘you shall empanel them’, is an adjectival qualification of ākharān, ‘two others’) after the, mid-afternoon, prayer and, if you are in doubt, [if] you are uncertain about it [their testimony], they shall swear by God, both of them saying: ‘We will not sell it, [our testimony] in [swearing by] God, for any price, [for] any compensation that we might take in exchange for it from this world, neither by swearing by Him [falsely], nor by testifying falsely for the sake of that [price]; even if he, the person before whom it is being sworn or the one for whose sake testimony is being given, be a near kinsman, a close relative of ours, nor will we hide testimony to God, which He has commanded us [to give], for then, if we were to hide it, we would surely be among the sinful’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(O ye who believe! Let there be witnesses between you) in settlement or upon travelling (when death draweth nigh unto one of you, at the time of bequest) of the dead person (two witnesses) should testify, just men from among you) two free men; it is also said: two of your own people, (or two others from another tribe) who adhere to your religion, as it is said that this means: two people from outside your own people. Then, leaving the question in the case of settlement, Allah mentioned the same question in the case of travelling, saying: (in case you are campaigning in the land) if you are out in the land or travelling (and 128 the calamity of death befall you). This verse was revealed about three men who travelled together for trade to Historic Syria. On the way, one of them, Budayl Ibn Abi Mariyah, a client of 'Amr Ibn al-'As, who was a Muslim, died. But before he died, he requested his two companions, 'Adiyy Ibn Bida' and Tamim Ibn Aws al- Dari, who were Christians, to hand over his property to his people. They however betrayed his testament. So Allah said to the custodians of the deceased person: (You shall empanel them both) the two Christians (after the prayer) of 'Asr, (and, if ye doubt) custodian of the deceased person that they gave back less than the deceased person had with him, (they shall be made to swear by Allah (saying): We will not take a bribe) let them say: we will not exchange our oath for a paltry portion of this world, (even though it were (on behalf of) a near kinsman) even if the deceased person is one of our kinsmen (nor will we hide the testimony of Allah) let them also say: we will not withhold our testimony, if asked, (for then) for if we withhold our testimony (indeed we should be of the sinful) i.e. of the wrong-doers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يِآ أَيُّهَا ٱلَّذِينَ آمَنُواْ } من جملة الأمور التي يجب عليكم محافظتها: { شَهَادَةُ بَيْنِكُمْ } أي: إشهادكم { إِذَا حَضَرَ أَحَدَكُمُ ٱلْمَوْتُ } أن يُشهدوا { حِينَ ٱلْوَصِيَّةِ ٱثْنَانِ ذَوَا عَدْلٍ مِّنْكُمْ } أي: من أقاربكم وعشائركم { أَوْ آخَرَانِ مِنْ غَيْرِكُمْ } من جانب المسلمين وأهل الذمة { إِنْ أَنتُمْ ضَرَبْتُمْ } سافرتم { فِي ٱلأَرْضِ } متباعدين عن الأقارب والعشائر { فَأَصَابَتْكُم } فيها { مُّصِيبَةُ ٱلْمَوْتِ تَحْبِسُونَهُمَا } أي: الآخران من الأجانب، وتقفونهما { مِن بَعْدِ ٱلصَّلاَةِ } عند الجماعة\n\n\n\n\n{ فَيُقْسِمَانِ بِٱللَّهِ } على رءوس الأشهاد { إِنِ ٱرْتَبْتُمْ } أيها الوارثون في شهادتهما، بأنا { لاَ نَشْتَرِي } ولا نرتشي بشهادتنا { بِهِ ثَمَناً } ولا نشهد بالزور { وَ } خصوصاً { لَوْ كَانَ } المقسم له { ذَا قُرْبَىٰ } صاحب قرابة { وَ } بأنا { لاَ نَكْتُمُ شَهَادَةَ ٱللَّهِ } التي أودعناها، بل نؤديها على وجهها بلا تحريف ولا كتمان، وإن كتمناها وحرفناها؛ ظلماً وزوراً { إِنَّآ إِذَاً لَّمِنَ ٱلآَثِمِينَ } [المائدة: 106] المكستبين لأنفسنا إثماً عظيماً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { شهادة }: مبتدأ، وخبره: { اثنان } ، أي: مقيم شهادة بينكم اثنان، أو حذف الخبر، أي: فيما أمرتكم شهادة بينكم، و { اثنان } على هذا: فاعل شهادة، و { إذا }: ظرف لشهادة، و { حين الوصية }: بدل منه، ويجوز أن يكون { إذا }: شرطية حذف جوابها، أي: إذا حضر الموت فينبغي أن يشهد حين الوصية اثنان، و { ذوا عدل }: صفة لاثنان، أو { آخران }: عطف على { اثنان } ، { إن أنتم }: شرط حذف جوابه، دل عليه ما تقدم، أي: إن سافرتم، فأصابتكم مصيبة الموت في السفر، فشهادة بينكم اثنان\n و { تحبسونهما }: قال أبو علي الفارسي: هو صفة لآخران، واعترض بين الصفة والموصوف قوله: { إن أنتم } إلى قوله: { الموت } ، ليفيدا العد، { آخران } من غير الملة، إنما يجوز لضرورة الضرب في الأرض وحلول الموت في السفر",
      "translations": []
    }
  ]
}