{
  "chapter": "المائدة",
  "text": "ان تعذبهم فانهم عبادك وان تغفر لهم فانك انت العزيز الحكيم",
  "translations": [
    {
      "translation": "If You punish them, they are Your slaves. If you forgive them, You are the Almighty, the All-Wise.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If You punish them, indeed they are Your creatures; if You pardon them, indeed You are mighty and wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If You chastise them, they are Your servants; and if You forgive them, You are the All-Mighty, the All-Wise.\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You may punish Your servants or forgive them for You are Majestic and Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“If you punish them, then indeed they are Your slaves; and if you forgive them, then indeed You only are the Almighty, the Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If You punish them, they are Your servants, and if You forgive them, verily You, only You are the Almighty, the All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Thou shouldst chastise them, then surely they are Thy servants; and if Thou shouldst forgive them, then surely Thou art the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Thou chastisest them, they are Thy servants; if Thou forgivest them, Thou art the All-mighty, the All-wise.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Thou punish them, lo! they are Thy slaves, and if Thou forgive them (lo! they are Thy slaves). Lo! Thou, only Thou, art the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and if You punish them, they are surely Your servants; and if You forgive them, You are surely the Mighty and Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shouldst Thou torment them, then verily they are Thine creatures; and shouldst Thou forgive them, then verily Thou! Thow art the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If You punish them, they are indeed Your creatures; but if You forgive them, You are indeed the All-mighty, the All-wise.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Thou dost punish them, they are Thy servant: If Thou dost forgive them, Thou art the Exalted in power, the Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If You punish them, they are Your slaves, and if You forgive them, verily You, only You are the All-Mighty, the All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If You punish them (for their disbelief), they surely are Your subjects; and if You forgive them, surely You are the Almighty, the Wise'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If You punish them, they are Your servants; but if You forgive them, You are the Mighty and Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If You should punish them - indeed they are Your servants; but if You forgive them - indeed it is You who is the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:118] If you chastise them, that is, those among them who are fixed upon disbelief, verily they are Your servants, and You are their Master, disposing of them as You will: there can be no objection to [what] You [do]; and if You forgive them, that is, those of them who are believers, You, only You, are the Mighty, in His affair, the Wise’, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If Thou punish them, lo! they are Thy slaves, and if Thou forgive them (lo! they are Your slaves). Lo! Thou, only Thou art the Mighty, the Wise). This verse has already been explained.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِن تُعَذِّبْهُمْ } عدلاً { فَإِنَّهُمْ عِبَادُكَ } فلك أن تتصرف فيهم على أي وجه تتعلق إرادتكم ومشيئتك { وَإِن تَغْفِرْ لَهُمْ } فضلاً وطولاً { فَإِنَّكَ أَنتَ ٱلْعَزِيزُ } الغالب على الإنعام والانتقام { ٱلْحَكِيمُ } [المائدة: 118] المتقن في إعطاء ما ينبغي لمن ينبغي، ومنعه عنه بلا مشاركة ولا مظاهرة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إن تعذبهم فأنهم عبادك } وأنت مالك لهم، ولا اعتراض على المالك في ملكه، وفيه تنبيه على أنهم استحقوا العذاب، أي: لأنهم عبادك وقد عبدوا غيرك، { وإن تغفر لهم فإنك أنت العزيز الحكيم } ، فلا عجز ولا استقباح، فإنك القادر والقوي على الثواب والعقاب بلا سبب، ولا تُعاقب إلا عن حكمة وصواب، فإن عذبت فعدل، وإن غفرت ففضل، وعدم غفران الشرك مقتضى الوعيد، فلا امتناع فيه لذاته ليمتنع الترديد والتعليق بإن\n\n\nقاله البيضاوي\n وقال ابن جزي: فيه سؤالان: الأول: كيف قال: { وإن تغفر لهم } وهم كفار، والكفار لا يغفر لهم؟ فالجواب: أن المعنى تسليم الأمر إلى الله، وإنه إن عذب أو غفر فلا اعتراض عليه لأن الخلق عباده، والمالك يفعل ما يشاء، ولا يلزم من هذا وقوع المغفرة للكفار، وإنما يقتضي جوازها في حكمة الله وعزته، وفَرقٌ بين الجواز والوقوع، وأما على قول من قال: إن هذا الخطاب وقع لعيسى عليه السلام حين رفعه الله إلى السماء فلا إشكال، لأن المعنى: إن لم تغفر بهم التوبة، وكانوا حينئذٍ أحياء، وكل حيّ مُعرض للتوبة\n السؤال الثاني: ما مناسبة قوله: { العزيز الحكيم } لقوله: { وإن تغفر لهم } ، والأليق إن قال: فإنك أنت الغفور الرحيم؟ فالجواب: أنه لما قصد التسليم له والتعظيم، كان قوله: { فإنك أنت العزيز الحكيم } أليق، فإن الحكمة تقتضي التسليم، والعزة تقتضي التعظيم، فإن العزيز هو الذي يفعل ما يريد، ولا يغلبه غيره، ولا يمتنع عليه شيء أراده، فاقتضى الكلام تفويض الأمر إلى الله في المغفرة لهم أو عدمها لأنه قادر على كلا الأمرين لعزته، وأيهما فعل فهو جميل لحكمته\n وقال أبو جعفر بن الزبير: إنما لم يقل الغفور الرحيم لئلا يكون شفيعًا لهم بطلب المغفرة، فاقتصر على التسليم والتفويض، دون الطلب، إذ لا نصيب في المغفرة للكفار\n انظر بقية كلامه\n قال التفتازاني: ذكر المغفرة، يوُهم أن الفاصلة: { الغفور الرحيم } ، لكن يُعرف بعد التأمل أن الواجب هو العزيز الحكيم لأنه لا يغفر لمن يستحق العذاب إلا من ليس فوقه أحد يرد عليه حكمه، وهو العزيز، أي: الغالب، ثم وجب أن يوصف بالحكمة على سبيل الاحتراس لئلا يتوهم أنه خارج عن الحكمة\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:1",
      "similarity": 0.5629547105482304
    },
    {
      "verse": "45:2",
      "similarity": 0.5629547105482304
    },
    {
      "verse": "46:2",
      "similarity": 0.5629547105482304
    },
    {
      "verse": "38:66",
      "similarity": 0.5527840729368
    },
    {
      "verse": "60:5",
      "similarity": 0.5513127705261122
    }
  ]
}