{
  "chapter": "المائدة",
  "text": "واذ قال الله يعيسى ابن مريم ءانت قلت للناس اتخذونى وامى الهين من دون الله قال سبحنك ما يكون لى ان اقول ما ليس لى بحق ان كنت قلته فقد علمته تعلم ما فى نفسى ولا اعلم ما فى نفسك انك انت علم الغيوب",
  "translations": [
    {
      "translation": "And when Allah says, \"Isa son of Maryam! Did you say to people, \"Take me and my mother as gods besides Allah?'\" he will say, 'Glory be to You! It is not for me to say what I have no right to say! If I had said it, then You would have known it. You know what is in my self but I do not know what is in Your Self. You are the Knower of all unseen things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when God will ask: \"O Jesus, son of Mary, did you say to mankind: 'Worship me and my mother as two deities apart from God?' (Jesus) will answer: \"Halleluja. Could I say what I knew I had no right (to say)? Had I said it You would surely have known, for You know what is in my heart though I know not what You have. You alone know the secrets unknown.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And imagine when thereafter Allah will say: 'Jesus, son of Mary, did you say to people: \"Take me and my mother for gods beside Allah?\" and he will answer: \"Glory to You! It was not for me to say what I had no right to. Had I said so, You would surely have known it. You know all what is within my mind whereas I do not know what is within Yours. You, indeed You, know fully all that is beyond the reach of human perception.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God asked Jesus, son of Mary \"Did you tell men to consider you and your mother as their gods besides God?\" he replied, \"Glory be to you! How could I say what I have no right to say? Had I ever said it, You would have certainly known about it. You know what is in my soul, but I do not know what is in Yours. It is You who has absolute knowledge of the unseen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah will say, “O Eisa, the son of Maryam! Did you say to the people, ‘Appoint me and my mother as two Gods, besides Allah’?” He will submit, “Purity is to You! It is not proper for me to say something for which I do not have a right; if I have said it, then surely You know it; You know what lies in my heart, and I do not know what is in Your knowledge; indeed You only know all the hidden.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Allah will say (on the Day of Resurrection): \"O `Isa, son of Maryam! Did you say unto men: `Worship me and my mother as two gods besides Allah\"' He will say: \"Glory be to You! It was not for me to say what I had no right (to say). Had I said such a thing, You would surely have known it. You know what is in my inner self though I do not know what is in Yours, truly, You, only You, are the Knower of all that is hidden and unseen.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah will say: O Isa son of Marium! did you say to men, Take me and my mother for two gods besides Allah he will say: Glory be to Thee, it did not befit me that I should say what I had no right to (say); if I had said it, Thou wouldst indeed have known it; Thou knowest what is in my mind, and I do not know what is in Thy mind, surely Thou art the great Knower of the unseen things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when God said, 'O Jesus son of Mary, didst thou say unto men, \"Take me and my mother as gods, apart from God\"?' He said, 'To Thee be glory! It is not mine to say what I have no right to. If I indeed said it, Thou knowest it, knowing what is within my soul, and I know not what is within Thy soul; Thou knowest the things unseen\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah saith: O Jesus, son of Mary! Didst thou say unto mankind: Take me and my mother for two gods beside Allah? he saith: Be glorified! It was not mine to utter that to which I had no right. If I used to say it, then Thou knewest it. Thou knowest what is in my mind, and I know not what is in Thy Mind. Lo! Thou, only Thou, art the Knower of Things Hidden?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God says, \"Jesus, son of Mary, did you say to people, \"Take me and my mother as two deities besides God\"?\" He will answer, \"Glory be to You! How could I ever say that to which I have no right? If I had ever said so, You would surely have known it. You know what is in my mind, while I do not know anything that is within Yours. You alone are the knower of unseen things --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And call to mind what time Allah will say: O 'Isa, son of Maryam! was it thou who said to the people: take me and my mother as two god beside Allah! 'Isa will say: hallowed be Thou! it was not for me to say that to which had no right; had I said it, Thou would have surely known it; Thou knowest that which is in my mind and know not that which is in Thy mind. Verily Thou! Thou art the Great Knower of the things hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah will say, ‘O Jesus son of Mary! Was it you who said to the people, ‘‘Take me and my mother for gods besides Allah’’?’ He will say, ‘Immaculate are You! It does not behoove me to say what I have no right to [say]. Had I said it, You would certainly have known it: You know whatever is in my self, and I do not know what is in Your Self. Indeed, You are knower of all that is Unseen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And behold! Allah will say: \"O Jesus the son of Mary! Didst thou say unto men, worship me and my mother as gods in derogation of Allah'?\" He will say: \"Glory to Thee! never could I say what I had no right (to say). Had I said such a thing, thou wouldst indeed have known it. Thou knowest what is in my heart, Thou I know not what is in Thine. For Thou knowest in full all that is hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Allah will say (on the Day of Resurrection): \"O 'Iesa (Jesus), son of Maryam (Mary)! Did you say unto men: 'Worship me and my mother as two gods besides Allah?' \" He will say: \"Glory be to You! It was not for me to say what I had no right (to say). Had I said such a thing, You would surely have known it. You know what is in my inner-self though I do not know what is in Yours, truly, You, only You, are the All-Knower of all that is hidden and unseen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah said: '(Prophet) Jesus, son of Mary, did you ever say to the people: \"Take me and my mother for two gods, other than Allah?\" 'Exaltations to You' he said, 'how could I say that to which I have no right? If I had said that, You would have surely known. You know what is in my self, but I do not know what is in Yours. Indeed, You are the Knowledgeable of the unseen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And God will say, “O Jesus son of Mary, did you say to the people, `Take me and my mother as gods rather than God?'“ He will say, “Glory be to You! It is not for me to say what I have no right to. Had I said it, You would have known it. You know what is in my soul, and I do not know what is in your soul. You are the Knower of the hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [beware the Day] when Allah will say, \"O Jesus, Son of Mary, did you say to the people, 'Take me and my mother as deities besides Allah?'\" He will say, \"Exalted are You! It was not for me to say that to which I have no right. If I had said it, You would have known it. You know what is within myself, and I do not know what is within Yourself. Indeed, it is You who is Knower of the unseen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:116] And, mention, when God says, that is, when God will say, to Jesus at the Resurrection in rebuke of his followers: ‘O Jesus, son of Mary, did you say to mankind, “Take me and my mother as gods, besides God”?’ He, Jesus, says, shuddering: ‘Glory be to You!, exalted be You above all that does not befit You, such as [having] a partner and so on. It is not mine, it is unjustified [for me], to say what I have no right to (bihaqq, ‘right to’, is the predicate of laysa, ‘not’; lī, ‘mine’, is explicative). If I indeed had said it, You would have known it. You know what is, hidden by me, in my self, but I do not know what is within Your Self, that is, what You keep hidden of Your knowledge: You are the Knower of things unseen.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ وَإِذْ قَالَ الله } عطف على قوله : { إذ قال الله يا عيسى بن مريم اذكر نعمتي عليك } \\[ المائدة : 110 \\] فهو ما يقوله الله يوم يجمع الرسل وليس ممّا قاله في الدنيا ، لأنّ عبادة عيسى حدثت بعد رفعه ، ولقوله : { هذا يوم ينفع الصادقين صدقهم } . فقد أجمع المفسّرون على أنّ المراد به يوم القيامة . وأنّ قوله : { وإذ قال الله يا عيسى بن مريم أأنت قلت للناس } قول يقوله يوم القيامة . وهذا مبدأ تقريع النصارى بعد أن فُرغ من تقريع اليهود من قوله : { إذ قال الله يا عيسى بن مريم اذكر نعمتي عليك } \\[ المائدة : 110 \\] إلى هنا . وتقريع النصارى هو المقصود من هذه الآيات كما تقدّم عند قوله تعالى : { يوم يجمع الله الرسل } \\[ المائدة : 109 \\] الآية ، فالاستفهام هنا كالاستفهام في قوله تعالى للرسل { ماذا أجبتم } \\[ المائدة : 109 \\] والله يعلم أنّ عيسى لم يقل ذلك ولكن أريد إعلان كذب من كفر من النصارى .وتقديم المسند إليه على الخبر الفعلي في قوله : { أأنت قلت للناس } يدلّ على أنّ الاستفهام متوجّه إلى تخصيصه بالخبر دون غيره مع أنّ الخبر حاصل لا محالة . فقول قائلين : اتّخِذوا عيسى وأمّه إلهين ، واقع . وإنّما ألقي الاستفهام لعيسى أهو الذي قال لهم ذلك تعريضاً بالإرهاب والوعيد بتوجّه عقوبة ذلك إلى من قال هذا القول إن تنصّل منه عيسى فيعلم أحبارهم الذين اخترعوا هذا القول أنّهم المراد بذلك .والمعنى أنّه إن لم يكن هو قائل ذلك فلا عذر لمن قاله لأنّهم زعموا أنّهم يتّبعون أقوال عيسى وتعاليمه ، فلو كان هو القائل لقال : اتّخذوني وأمّي ، ولذلك جاء التعبير بهذين اللفظين في الآية . والمراد بالناس أهل دينه .وقوله : { من دون الله } متعلّق بِ { اتّخذوني } ، وحرف { من } صلة وتوكيد . وكلمة { دون } اسم للمكان المجاوز ، ويكثر أن يكون مكاناً مجازياً مراداً به المغايرة ، فتكون بمعنى ( سوى ) . وانظر ما تقدّم آنفاً عند قوله تعالى : { قل أتعبدون من دون الله ما لا يملك لكم ضرّاً ولا نفعاً } \\[ المائدة : 76 \\] . والمعنى اتّخذوني وأمّي إلهين سوى الله .وقد شاع هذا في استعمال القرآن قال تعالى : { ومن الناس من يتّخذ من دون الله أنداداً يحبّونهم كحبّ الله } \\[ البقرة : 165 \\] ، وقال : { ويعبدون من دون الله ما لا يضرّهم ولا ينفعهم ويقولون هؤلاء شفعاؤنا عند الله } \\[ يونس : 18 \\] ، وغير ذلك من الآيات التي خوطب بها المشركون مع أنّهم أشركوا مع الله غيره ولم ينكروا إلهيّة الله .وذُكر هذا المتعلّق إلزاماً لهم بشناعة إثبات إلهية لغير الله لأنّ النصارى لمّا ادّعوا حلول الله في ذات عيسى توزّعت الإلهية وبطلت الوحدانية . وقد تقدّم بيان هذا المذهب عند تفسير قوله تعالى : { لقد كفر الذين قالوا إنّ الله هو المسيح ابن مريم } في هذه السورة ( 17 ) .وجواب عيسى عليه السلام بقوله : { سبحانك } تنزيه لله تعالى عن مضمون تلك المقالة .وكانت المبادرة بتنزيه الله تعالى أهمّ من تبرئته نفسه ، على أنّها مقدّمة للتبرّي لأنّه إذا كان ينزّه الله عن ذلك فلا جرم أنّه لا يأمر به أحداً . وتقدّم الكلام على { سبحانك } في قوله تعالى : { قالوا سبحانك لا علم لنا } في سورة البقرة ( 32 ) .وبرّأ نفسه فقال : ما يكون لي أن أقول ما ليس لي بحق } ؛ فجملة { ما يكون لي أن أقول } مستأنفة لأنّها جواب السؤال . وجملة { سبحانك } تمهيد .وقوله : { ما يكون لي } مبالغة في التبرئة من ذلك ، أي ما يوجد لديّ قول ما ليس لي بحقّ ، فاللام في قوله : { ما يكون لي } للاستحقاق ، أي ما يوجد حقّ أن أقول . وذلك أبلغ من لم أقله لأنّه نفى أن يوجد استحقاقه ذلك القول .والباء في قوله { بحقّ } زائدة في خبر { ليس } لتأكيد النفي الذي دلّت عليه { ليس } . واللام في قوله { ليس لي بحقّ } متعلّقة بلفظ { حقّ } على رأي المحقّقين من النحاة أنّه يجوز تقديم المتعلّق على متعلّقه المجرور بحرف الجرّ . وقدّم الجارّ والمجرور للتنصيص على أنّه ظرف لغو متعلّق { بحقّ } لئلا يتوهّم أنّه ظرف مستقرّ صفة ل { حقّ } حتى يفهم منه أنّه نفى كون ذلك حقّاً له ولكنّه حقّ لغيره الذين قالوه وكفروا به ، وللمبادرة بما يدلّ على تنصّله من ذلك بأنّه ليس له . وقد أفاد الكلام تأكيدَ كون ذلك ليس حقّاً له بطريق المذهب الكلامي لأنّه نفى أن يباح له أن يقول ما لا يحقّ له ، فعُلم أنّ ذلك ليس حقّاً له وأنّه لم يقله لأجل كونه كذلك . فهذا تأكيد في غاية البلاغة والتفنّن .ثم ارتقى في التبرّىء فقال : { إن كنت قلته فقد علمته } ، فالجملة مستأنفة لأنّها دليل وحجّة لمضمون الجملة التي قبلها ، فكانت كالبيان فلذلك فصلت . والضمير المنصوب في { قلته } عائد إلى الكلام المتقدّم . ونصْب القول للمفرد إذا كان في معنى الجملة شائع كقوله تعالى : { كلاّ إنّها كلمة هو قائلها } \\[ المؤمنون : 100 \\] ، فاستدلّ على انتفاء أن يقوله بأنّ الله يعلم أنّه لم يقله ، وذلك لأنّه يتحقّق أنّه لم يقله ، فلذلك أحال على علم الله تعالى . وهذا كقول العرب : يعلم الله أني لم أفعل ، كما قال الحارث بن عبّاد :لَم أكُنْ من جُنَاتِعَا عَلِمَ الله وأني لِحرّها اليومَ صالٍ ... ولذلك قال : { تعلم ما في نفسي } ، فجملة { تعلم ما في نفسي } بيان لجملة الشرط { إن كنت قلته فقد علمته } فلذلك فُصلت .والنفس تطلق على العقل وعلى ما به الإنسان ، إنسان وهي الروح الإنساني ، وتطلق على الذات . والمعنى هنا : تعلم ما أعتقده ، أي تعلم ما أعلمه لأنّ النفس مقرّ العلوم في المتعارف .وقوله : { ولا أعلم ما في نفسك } اعتراض نشأ عن { تعلم ما في نفسي } لقصد الجمع بين الأمرين في الوقت الواحد وفي كلّ حال .وذلك مبالغة في التنزيه وليس له أثر في التبرّىء ، والتنصّل ، فلذلك تكون الواو اعتراضية .وإضافة النفس إلى اسم الجلالة هنا بمعنى العلم الذي لم يُطلع عليه غيره ، أي ولا أعلم ما تعلمه ، أي ممّا انفردت بعمله . وقد حسّنه هنا المشاكلة كما أشار إليه في «الكشاف» .وفي جواز إطلاق النفس على ذات الله تعالى بدون مشاكلة خلاف؛ فمن العلماء من منع ذلك وإليه ذهب السعد والسيد وعبد الحكيم في شروح «المفتاح» و«التخليص» . وهؤلاء يجعلون ما ورد من ذلك في الكتاب نحو { ويحذّركم الله نفسه } \\[ آل عمران : 28 \\] من قبيل المتشابه . ومن العلماء من جوّز ذلك مثل إمام الحرمين كما نقله ابن عرفة في «التفسير» عند قوله تعالى : { كتب ربّكم على نفسه الرحمة } في سورة الأنعام ( 54 ) ، ويشهد له تكرّر استعماله في القرآن وكلام النبي كما في الحديث القدسي فإن ذكرني في نفسه ذكرته في نفسي } .وقوله : { إنّك أنت علاّم الغيوب } علّة لقوله : { تعلم ما في نفسي } ولذلك جيء بِ ( إنّ ) المفيدة التعليل . وقد جمع فيه أربع مؤكّدات وطريقة حصر ، فضمير الفصل أفاد الحصر ، وإنّ وصيغة الحصر ، وجمع الغيوب ، وأداة الاستغراب .\n\n",
      "translations": [
        {
          "translation": "(And when Allah saith) Allah says on the Day of Judgement: (0 Jesus, son of Mary! Didst thou say unto mankind) in the life of this world: (Take me and my mother for two gods beside Allah? He) Jesus (saith: Be glorified! It was not mine) it was not proper nor was it permissible (to utter that to which I had no right. If I used to say it) to them, (then Thou knewest it. Thou knowest what is in my mind) you know that which I have conveyed to them of commands and prohibitions, (and I know not what is in Thy mind) I do not know what proceeded from you to them in terms of forsakenness or success. (Lo! Thou, only Thou art the Knower of Things Hidden) things hidden from the servants. 130\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أأنت } دعوت الناس إلى نفسك وأمّك أو إلى مقام قلبك ونفسك فإنّ من بقي فيه وجود الأنائية وبقية النفس والهوى\n أو كان فيه تلوين بوجود القلب وظهوره بصفته يدعو الخلق إما إلى مقام نفسه وإما إلى مقام قلبه لا إلى الحق { قال سُبْحانك } تنزيه لله عن الشريك وتبرئة له عن وجود البقية { ما يكون لي أن أقول ما ليس لي بحق } فإني لا وجود لي بالحقيقة فلا ينبغي ولا يصح أن أقول قولاً ليس لي ذلك القول بالحقيقة\n فإن القول والفعل والصفة والوجود كلها لك { إن كنت قلته فقد علمته } أي: إن كان صدر مني قول فعن علمك ولا وجود لما لا تعلم وما وجد بعلمك وجد { تعلم ما في نفسي } لإحاطتك بالكلّ\n فعلمي بعض علمك { ولا أعلم ما في نفسك } أي: ذاتك لأني لا أحيط بالكلّ { ما قلت لهم } وما أمرتهم إلا ما كلفتني قوله وألزمتني إياه { أن اعْبدوا الله ربي وربكم } أي: ما دعوتهم إلا إلى الجمع في صورة التفصيل وهو الذي نسبة ربوبيته إلى الكل سواء فغلطوا فما رأوه إلا في بعض التفاصيل لضيق وعائهم { وكنت عليهم شهيداً } رقيباً حاضراً أراعيهم وأعلمهم { ما دُمْت فيهم } أي: ما بقي مني وجود بقية { فلما توفيتني } أفنيتني بالكلية بك { كنت أنت الرقيب عليهم } لفنائي فيك { وأنت على كل شيء شهيد } حاضر\n يوجد بك\n وإلا لم يكن ذلك الشيء",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر { إِذْ قَالَ ٱللَّهُ } حين فشا غلو النصارى في حق عيسى وأمه\n ونسبتهما إلى الألوهية\n وقولهم بالتثليث والأقانينم والحلول والاتحاد: { يٰعِيسَى ٱبْنَ مَرْيَمَ أَأَنتَ قُلتَ لِلنَّاسِ ٱتَّخِذُونِي وَأُمِّيَ إِلَـٰهَيْنِ مِن دُونِ ٱللَّهِ } واعبدوني مثل عبادته\n أم اتخذوك من تلقاء أنفسهم؟ { قَالَ } عيسى منزهاً لله\n مبعداً نفسه إليها عن أمثاله: { سُبْحَانَكَ } أنزهك تنزيهاً عن أن يكون لك شريك { مَا يَكُونُ } ما يصح ويليق { لِيۤ أَنْ أَقُولَ مَا } أي: قولاً { لَيْسَ لِي بِحَقٍّ } لائق جائز أن أقوله\n سيما بعد لطفك إلي\n وفضلك وامتنانك علي { إِن كُنتُ قُلْتُهُ فَقَدْ عَلِمْتَهُ } إذ { تَعْلَمُ } بالعلم الحضوري { مَا فِي نَفْسِي وَ } أنا { لاَ أَعْلَمُ مَا فِي نَفْسِكَ } وذاتك وشأنك وسلطانك { إِنَّكَ أَنتَ عَلاَّمُ ٱلْغُيُوبِ } [المائدة: 116]\n\n\nوإنما خاطبه سبحانه\n وعاتبه بما عابته مع أن الأمر معلوم عنده\n ليوبخ ويقرع على الغالين المتخذين\n لعلهم ينتهون بسوء صنيعهم\n وقبح معاملتهم مع الله المتوحد\n المتفرد المنزه بذاته عن الأهل والولد\n الصمد المقدس الذي\n[الإخلاص: 3-4]",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { من دون الله }: صفة لإلهين\n أو صلة { اتخذوني } ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:34",
      "similarity": 0.547262290983228
    },
    {
      "verse": "3:45",
      "similarity": 0.43386604905853715
    },
    {
      "verse": "61:6",
      "similarity": 0.4145416973280391
    },
    {
      "verse": "33:7",
      "similarity": 0.41323002465682696
    },
    {
      "verse": "5:78",
      "similarity": 0.35906774670509156
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005116.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005116.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:116.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}