{
  "chapter": "المائدة",
  "text": "قالوا۟ نريد ان ناكل منها وتطمئن قلوبنا ونعلم ان قد صدقتنا ونكون عليها من الشهدين",
  "translations": [
    {
      "translation": "They said, 'We want to eat from it and for our hearts to be at peace and to know that you have told us the truth and to be among those who witness it.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We should like to eat of it to reassure our hearts and to know that it's the truth you have told us, and that we should be witness to it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'We desire to partake of it that our hearts be satisfied and we know that you did speak the truth to us, and that we are its witnesses.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"We only wish to eat therefrom to comfort our hearts, to know that you have spoken the Truth to us, and to bear witness to it along with the others.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “We wish to eat from it and so that our hearts be convinced and to see that you have spoken the truth to us, and that we may be witnesses upon it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We wish to eat thereof and to be stronger in faith, and to know that you have indeed told us the truth and that we ourselves be its witnesses. \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: We desire that we should eat of it and that our hearts should be at rest, and that we may know that you have indeed spoken the truth to us and that we may be of the witnesses to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'We desire that we should eat of it and our hearts be at rest; and that we may know that thou hast spoken true to us, and that we may be among its witnesses.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They said:) We wish to eat thereof, that we may satisfy our hearts and know that thou hast spoken truth to us, and that thereof we may be witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"We want to eat from it, so that we may satisfy our hearts and know that you have told us the truth, and that we should be witnesses of it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: we mean that we may eat thereof and we may set our hearts at rest and we be assured that thou hast spoken the truth unto us, and we should be of the witnesses thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘We desire to eat from it, and our hearts will be at rest: we shall know that you have told us the truth, and we shall be among the witnesses to it.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We only wish to eat thereof and satisfy our hearts, and to know that thou hast indeed told us the truth; and that we ourselves may be witnesses to the miracle.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We wish to eat thereof and to be stronger in Faith, and to know that you have indeed told us the truth and that we ourselves be its witnesses.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We wish to eat of it' they said, 'so that we can satisfy our hearts and know that what you said to us is true, and that we become witnesses to it'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “We wish to eat from it, so that our hearts may be reassured, and know that you have told us the truth, and be among those who witness it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"We wish to eat from it and let our hearts be reassured and know that you have been truthful to us and be among its witnesses.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:113] They said, ‘We desire, to request this in order, to eat of it and that our hearts be reassured, through increased certainty, and that we may know, that we may acquire more awareness [of the fact], that you (annaka is softened to an) have spoken truthfully to us, in your claim to prophethood, and that we may be among the witnesses thereof’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said: We wish to eat thereof, that we may satisfy our hearts) regarding the marvels that you show us (and know) and have certainty (that thou hast spoken truth to us) regarding all what you said, (and that thereof we may be witnesses) when we go back to our people.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ملتجئين: { نُرِيدُ أَن نَّأْكُلَ } نذوق ونستفيد { مِنْهَا وَتَطْمَئِنَّ قُلُوبُنَا } وتتمكن أقدامنا في جادة التوحيد { وَنَعْلَمَ } يقيناً عينياً { أَن قَدْ صَدَقْتَنَا } في جميع ما أرشدتنا وأهديتنا { وَنَكُونَ عَلَيْهَا مِنَ ٱلشَّاهِدِينَ } [المائدة: 113] أي: من أهل الشهود والكشف بلا حجاب العلم\n\n\nفلمَّا أحس عيسى ابتلاء الله\n وفتنته إياهم بادر إلى المناجاة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:27",
      "similarity": 0.740961653468257
    },
    {
      "verse": "13:28",
      "similarity": 0.6989654179550863
    },
    {
      "verse": "3:126",
      "similarity": 0.687054689685581
    },
    {
      "verse": "8:10",
      "similarity": 0.6857137151627264
    },
    {
      "verse": "17:95",
      "similarity": 0.5940985625917462
    }
  ]
}