{
  "chapter": "المائدة",
  "text": "قال عيسى ابن مريم اللهم ربنا انزل علينا مائدة من السماء تكون لنا عيدا لاولنا وءاخرنا وءاية منك وارزقنا وانت خير الرزقين",
  "translations": [
    {
      "translation": "'Isa son of Maryam said, 'Allah, our Lord, send down a table to us out of heaven to be a feast for us, for the first and last of us, and as a Sign from You. Provide for us! You are the Best of Providers!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Jesus, son of Mary. \"O God, our Lord, send down a table well laid out with food from the skies so that this day may be a day of feast for the earlier among us and the later, and a token from You. Give us our (daily) bread, for You are the best of all givers of food.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jesus, son of Mary, then prayed: 'O Allah, our Lord, send down to us a repast from the heavens that shall be a festival for the first of us and for the last of us, and a sign from You. And provide us with sustenance, for You are the best Provider of sustenance.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Jesus prayed, \"Lord, send us a table full of food from heaven so that it will make a feast for us and for those who are yet to come in this world and an evidence from You. Give us sustenance, for You are the best Provider,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eisa, the son of Maryam, said, “O Allah, O our Lord! Send down to us a table spread from heaven, so that it may become a day of celebration for us – for our former and latter people – and a sign from You; and give us sustenance – and You are the Best Provider Of Sustenance.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "`Isa, son of Maryam, said: \"O Allah, our Lord! Send us from heaven a table spread (with food) that there may be for us -- for the first and the last of us -- a festival and a sign from You; and provide us sustenance, for You are the Best of sustainers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Isa the son of Marium said: O Allah, our Lord! send down to us food from heaven which should be to us an ever-recurring happiness, to the first of us and to the last of us, and a sign from Thee, and grant us means of subsistence, and Thou art the best of the Providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Jesus son of Mary, 'O God, our Lord, send down upon us a Table out of heaven, that shall be for us a festival, the first and last of us, and a sign from Thee. And provide for us; Thou art the best of providers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jesus, son of Mary, said: O Allah, Lord of us! Send down for us a table spread with food from heaven, that it may be a feast for us, for the first of us and for the last of us, and a sign from Thee. Give us sustenance, for Thou art the Best of Sustainers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jesus, son of Mary, said, \"O God, our Lord! Send down for us a table spread with food from heaven, so that it may be a feast for us, for the first of us and for the last of us: a sign from You. Give us our sustenance, for You are the best of sustainers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Isa, son of Maryam, said: O Allah, our Lord send down unto us some food from the heaven, that it may become unto us an occasion of joy, unto the first of us and the last of us, and a sign from Thee. And provide us Thou; and Thou art the Best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Jesus son of Mary, ‘O Allah! Our Lord! Send down to us a table from the sky, to be a festival for us, for the first ones and the last ones among us and as a sign from You, and provide for us; for You are the best of providers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Jesus the son of Mary: \"O Allah our Lord! Send us from heaven a table set (with viands), that there may be for us - for the first and the last of us - a solemn festival and a sign from thee; and provide for our sustenance, for thou art the best Sustainer (of our needs).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Iesa (Jesus), son of Maryam (Mary), said: \"O Allah, our Lord! Send us from heaven a table spread (with food) that there may be for us - for the first and the last of us - a festival and a sign from You; and provide us sustenance, for You are the Best of sustainers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, our Lord' said (Prophet) Jesus, the son of Mary, 'send down upon us a table out of heaven, that shall be a festival for us the first and the last of us and a sign from You. And provide for us; You are the Best of providers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jesus son of Mary said, “O God, our Lord, send down for us a table from heaven, to be a festival for us, for the first of us, and the last of us, and a sign from You; and provide for us; You are the Best of providers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Jesus, the son of Mary, \"O Allah, our Lord, send down to us a table [spread with food] from the heaven to be for us a festival for the first of us and the last of us and a sign from You. And provide for us, and You are the best of providers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:114] Jesus, son of Mary, said: ‘O God, our Lord, send down upon us a Table from the heaven, that it shall be, that is, the day of its sending down [shall be], a celebration for us, which we shall consecrate and honour, for the first (li-awwalinā is an inclusive substitution for lanā, ‘for us’, with the repetition of the [oblique] preposition [li-]) and the last of us, those who will come after us, and a sign from You, of Your power and my prophethood. And provide, it, for us; You are the Best of Providers’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Jesus, son of Mary, said: Allah, Lord of us! Send down for us a table spread with food from heaven) it is also said that this means: send down for us the grace of food, for they already had some food with them, (that it may be a feast for Us, for the first of us) the people of our own time (and for the last of us) those who come after us, so that we worship you on this day, which happened to be a Sunday, (and a sign from You) for he who believes and an argument against he who disbelieves. (Give us sustenance) give us that which we have asked for, (for Thou art the Best of Sustainers) the Best of those who feed others.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفلمَّا أحس عيسى ابتلاء الله، وفتنته إياهم بادر إلى المناجاة، حيث { قَالَ عِيسَى ٱبْنُ مَرْيَمَ ٱللَّهُمَّ رَبَّنَآ أَنزِلْ عَلَيْنَا مَآئِدَةً مِّنَ ٱلسَّمَآءِ تَكُونُ لَنَا عِيداً } فرحاً وسروراً { لأَوَّلِنَا } متقدمينا { وَآخِرِنَا } متأخيرنا { وَآيَةً مِّنْكَ } تنكشف بها بتوحيدك { وَٱرْزُقْنَا } من لدنك حظاً يخلصنا من ظلام أظلالنا، وغيوم هوياتنا { وَأَنتَ خَيْرُ ٱلرَّازِقِينَ } [المائدة: 114] على من سبقت غايته له\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال عيسى ابن مريم } مسعفًا لهم لما رأى لهم غرضًا صحيحًا في ذلك، رُوِي أنه لبس جُبَّةَ شعر، ورداء شعر وقام يصلي ويدعو ويبكي، وقال: { اللهم ربنا أنزل علينا مائدة من السماء تكون لنا عيدًا لأولنا وآخرنا } أي: لمتقدمنا ومتأخرنا، يعود علينا وقت نزولها كل عام بالفرح والسرور، فنتخذه عيدًا نحن ومن يأتي بعدنا، { و } يكون نزولها { آية منك } على كمال قدرتك وصحة نبوتي، { وارزقنا } المائدة والشكر عليها، { وأنت خير الرازقين } أي: خير من يرزق لأنه خالق الرزق ومعطيه بلا عوض، ونسبة الرزق إلى غيره مجاز\n\n\n{ قال الله إني منزلها عليكم } كما طلبتم، { فمن يكفر بعدُ منكم فإني أعذبه عذابًا لا أعذبه أحدًا من العالمين } أي: من عالمي زمانهم، أو مطلقًا\n قال ابن عمر:  أشد الناس عذابًا يوم القيامة: من كفر من أصحاب المائدة، وآل فرعون، والمنافقون\n رُوِي أنها نزلت سُفرة حمراء بين غمامتين، وهم ينظرون إليها، حتى سقطت بين أيديهم، فبكى عيسى وقال: اللهم اجعلني من الشاكرين، اللهم اجعلها رحمة، ولا تجعلها مثلة وعقوبة، ثم قام وتوضأ وصلى وبكى، ثم كشف المنديل، وقال: بسم الله خير الرازقين، فإذا سمكة مشوية، تسيل دسمًا وعند ذنبها خل، وحولها من أنواع البقول ما خلا الكراث، وخمسة أرغفة، على واحد منها زيتون، وعلى الثاني عسل، وعلى الثالث سمن، وعلى الرابع جبن، وعلى الخامس قديد، قال شمعون: يا روح الله أمن طعام الدنيا أم من طعام الآخرة؟ قال: ليس منهما، ولكنه اخترعه الله بقدرته، كلوا ما سألتم، واشكروا الله يمدُدكم ويزدكم من فضله، فقالوا: يا روح الله، لو أريتنا من هذه الآية آية أخرى، فقال: يا سمكة: احيَى بإذن الله، فاضطربت، ثم قال لها: عودي، فعادت كما كانت، فعادت مشوية، ثم طارت المائدة ثم عصوا بعدها فمسخوا\n وقيل: كانت تأتيهم أربعين يومًا، غِبًّا، يجتمع عليها الفقراء والأغنياء والصغار والكبار، يأكلون، فإذا فرغوا، طارت وهم ينظرون في ظلها، ولم يأكل منها فقير إلا غني مدة عمره، ولا مريض إلا برىء ولم يمرض أبدًا، ثم أوحى الله إلى عيسى: أن اجعل مائدتي في الفقراء والمرضى دون الأغنياء والأصحاء، فاضطرب الناس، فمسخ منهم ثلاثة وثمانون\n وقيل: لما وعد الله إنزالها بهذه الشريطة، استغفروا وقالوا: لا نريد، فلم تنزل\n قلت: المشهور أنها نزلت، ويحكى أن أرجلها باقية بجزيرة الأندلس\n والله تعالى أعلم\n الإشارة: في سؤال الحواريين لسيدنا عيسى عليه السلام قلة آدب من وجهين: أحدهما: خطابه بقوله: { يا عيسى ابن مريم } وقد كانت هذه الأمة المحمدية تخاطب رسول الله صلى الله عليه وسلم يا رسول الله، يا نبي الله، لكمال أدبها، وبذلك شرفت وعظم قدرها، فالأدب عند الصوفية ركن عظيم، بل هو روح التصوف وقطب دائرته، قال بعضهم:  اجعل عملك ملحًا، وأدبك دقيقًا، والكلام فيه عندهم طويل شهير\n والوجه الثاني: ما في قولهم: { هل يستطيع ربك } من بشاعة التعبير، وسوء اللفظ، حتى اتهموا بالكفر من أجله، وقد تقدم تأويله، وأما سؤالهم المائدة، فقال بعض الصوفية: هي عبارة عن المعارف والأسرار الربانية التي هي قوت الأرواح السماوية، فقوت الأشباح الأرضية ما يخرج من الأرض من الأقوات الحسية، وقوت الأرواح السماوية ما ينزل من السماء من العلوم اللدنية والأسرار الربانية، ينزل على قلوب العارفين، ثم يبرز منها إلى قلوب عائلة المستمعين، ولما طلبوها قبل إبانها وقبل الاستعداد لها، قال لهم: { اتقوا الله إن كنتم مؤمنين } ، فلما ألحوا في السؤال، بيَّن الحق لهم أن إنزالها سهل على قدرته، لكن فيه خطر وسوء عاقبة، لأن الحقائق قد تضر بالمريد إذا لم يكمل أدبه واستعداده، فلما بينوا مرادهم من كمال الطمأنينة واليقين دعا الله ـ تعالى ـ فوعدهم بالإنزال مع دوام الإيمان وكمال الإيقان، فمن كفر بها، ولم يعرف قدرها، عذب بعذاب لم يعذبه أحد من العالمين، وهو الطرد والبعد من ساحة حضرة رب العالمين\n والله تعالى أعلم\n ثم وبخ مَن عبد عيسى من الكفرة، فقال: { وَإِذْ قَالَ ٱللَّهُ يٰعِيسَى ٱبْنَ مَرْيَمَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:112",
      "similarity": 0.6150142260251159
    },
    {
      "verse": "10:10",
      "similarity": 0.5209346078376456
    },
    {
      "verse": "39:46",
      "similarity": 0.48591589692432935
    },
    {
      "verse": "3:26",
      "similarity": 0.47476713109330154
    },
    {
      "verse": "16:15",
      "similarity": 0.4722703678339424
    }
  ]
}