{
  "chapter": "المائدة",
  "text": "اذ قال الله يعيسى ابن مريم اذكر نعمتى عليك وعلى ولدتك اذ ايدتك بروح القدس تكلم الناس فى المهد وكهلا واذ علمتك الكتب والحكمة والتورىة والانجيل واذ تخلق من الطين كهيـة الطير باذنى فتنفخ فيها فتكون طيرۢا باذنى وتبرئ الاكمه والابرص باذنى واذ تخرج الموتى باذنى واذ كففت بنى اسرءيل عنك اذ جئتهم بالبينت فقال الذين كفروا۟ منهم ان هذا الا سحر مبين",
  "translations": [
    {
      "translation": "Remember when Allah will say, \"Isa, son of Maryam, remember My blessing to you and to your mother when I reinforced you with the Purest Ruh so that you could speak to people in the cradle and when you were fully grown; and when I taught you the Book and Wisdom, and the Torah and the Nil: and when you created a bird-shape out of clay by My permission, and then breathed into it and it became a bird by My permission; and healed the blind and the leper by My permission; and when you brought forth the dead by My permission; and when I held back the tribe of Israel from you, when you brought them the Clear Signs and those of them who were kafir said, \"This is nothing but downright magic\";",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when God will say: \"O Jesus, son of Mary, remember the favours I bestowed on you and your mother, and reinforced you with divine grace that you spoke to men when in the cradle, and when in the prime of life; when I taught you the law and the judgement and the Torah and the Gospel; when you formed the state of your people's destiny out of mire and you breathed (a new spirit) into it, and they rose by My leave; when you healed the blind by My leave, and the leper; when you put life into the dead by My will; and when I held back the children of Israel from you when you brought to them My signs, and the disbelievers among them said: \"Surely these are nothing but pure magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Imagine, then, when Allah will say: 'Jesus, son of Mary, recall My favour upon you and your mother, and when I strengthened you with the spirit of holiness so that you talked to men in the cradle and also when you became of age; and when I taught you the Book and Wisdom, and the Torah and the Gospel; and when, by My leave, you fashioned from clay the likeness of a bird and you breathed into it, and by My leave it became a bird; you healed, by My leave, the blind from birth and the leprous; and when, by My leave, you caused the dead to come to life. And recall when I restrained the Israelites from you when you came to them with clear proofs whereupon those of them who disbelieved said: \"This is nothing but clear magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God said, \"Jesus, son of Mary, recall My favors to you and your mother. (Recall) how I supported you by the holy spirit, made you speak to people from your cradle and when you grew up, taught you the Book, gave you wisdom, the Torah, and the Gospel. (Recall) when, by My will, you made a sculpture of a bird out of clay, blew into it, and it turned into a real bird by My Will. (Recall) how, by My will, you healed the deaf, the lepers, and raised the dead. (Recall) when you came to the Israelites in the house with clear miracles and I saved you from their mischief, even though the disbelievers among them said, \"This is obviously magic\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Allah will say, “O Eisa, the son of Maryam! Remember My favour upon you and your mother; when I supported you with the Holy Spirit; you were speaking to people from the cradle and in maturity; and when I taught you the Book and wisdom and the Taurat and the Injeel; and when you used to mould a birdlike sculpture from clay, by My command, and blow into it – so it (the living bird) used to fly by My command, and you used to cure him who was born blind and cure the leper, by My command; and when you used to raise up the dead, by My command; and when I restrained the Descendants of Israel against you when you came to them with clear proofs, and the disbelievers among them said, ‘This is nothing but clear magic’.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when Allah will say (on the Day of Resurrection): \"O `Isa, son of Maryam! Remember My favor to you and to your mother when I supported you with Ruh - il-Qudus [Jibril] so that you spoke to the people in the cradle and in maturity; and when I taught you the Book, the Hikmah, the Tawrah and the Injil; and when you made out of the clay, as it were, the figure of a bird, by My permission, and you breathed into it, and it became a bird by My permission, and you healed those born blind, and the lepers by My permission, and when you brought forth the dead by My permission; and when I restrained the Children of Israel from you since you came unto them with clear proofs, and the disbelievers among them said: `This is nothing but evident magic.\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Allah will say: O Isa son of Marium! Remember My favor on you and on your mother, when I strengthened you I with the holy Spirit, you spoke to the people in the cradle and I when of old age, and when I taught you the Book and the wisdom and the Taurat and the Injeel; and when you determined out of clay a thing like the form of a bird by My permission, then you breathed into it and it became a bird by My permission, and you healed the blind and the leprous by My permission; and when you brought forth the dead by My permission; and when I withheld the children of Israel from you when you came to them with clear arguments, but those who disbelieved among them said: This is nothing but clear enchantment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God said, 'Jesus Son of Mary, remember My blessing upon thee and upon thy mother, when I confirmed thee with the Holy Spirit, to speak to men in the cradle, and of age; and when I taught thee the Book, the Wisdom, the Torah, the Gospel; and when thou createst out of clay, by My leave, as the likeness of a bird, and thou breathest into it, and it is a bird, by My leave; and thou healest the blind and the leper by My leave, and thou bringest the dead forth by My leave; and when restrained from thee the Children of Israel when thou camest unto them with the clear signs, and the unbelievers among them said, \"This is nothing but sorcery manifest.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Allah saith: O Jesus, son of Mary! Remember My favour unto thee and unto thy mother; how I strengthened thee with the holy Spirit, so that thou spakest unto mankind in the cradle as in maturity; and how I taught thee the Scripture and Wisdom and the Torah and the Gospel; and how thou didst shape of clay as it were the likeness of a bird by My permission, and didst blow upon it and it was a bird by My permission, and thou didst heal him who was born blind and the leper by My permission; and how thou didst raise the dead by My permission; and how I restrained the Children of Israel from (harming) thee when thou camest unto them with clear proofs, and those of them who disbelieved exclaimed: This is naught else than mere magic;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then God will say, \"Jesus, son of Mary, remember My favour to you and to your mother: how I strengthened you with the holy spirit, so that you could speak to people in childhood and in maturity; and how I taught you the Book, and wisdom, the Torah and the Gospel; how by My leave you fashioned from clay the shape of a bird and blew upon it, so that, by My leave, it became a bird, and healed the blind and the leper by My permission, and when you brought forth the dead by My permission; and how I prevented the Children of Israel from harming you when you came to them with clear signs, when those of them who denied the truth said, \"This is sheer magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And call to mind what time Allah will say: 'Isa, son of Maryam, remember My favour unto thee and unto thine mother when I aided thee with the holy spirit so that thou spakest unto mankind in the cradle and in maturity, and when taught thee the Book and wisdom and the Taurah and the Injil, and when thou formedst out of clay as though the likeness of a bird by My command, and thou breathedest thereinto and it became a bird by My command, and thou healedest the blind from birth and the leprous by My command; and when thou causedest the dead to come forth by My command; and when I restrained the Children of Isra'il from thee when thou didst come to them with evidences, and those of them who disbelieved said: this is but magic manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Allah will say, O Jesus son of Mary, remember My blessing upon you and upon your mother, when I strengthened you with the Holy Spirit, so you would speak to the people in the cradle and in adulthood, and when I taught you the Book and wisdom, the Torah and the Evangel, and when you would create from clay the form of a bird, with My leave, and you would breathe into it and it would become a bird, with My leave; and you would heal the blind and the leper, with My leave, and you would raise the dead, with My leave; and when I held off [the evil of] the Children of Israel from you when you brought them manifest proofs, whereat the faithless among them said, ‘This is nothing but plain magic.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then will Allah say: \"O Jesus the son of Mary! Recount My favour to thee and to thy mother. Behold! I strengthened thee with the holy spirit, so that thou didst speak to the people in childhood and in maturity. Behold! I taught thee the Book and Wisdom, the Law and the Gospel and behold! thou makest out of clay, as it were, the figure of a bird, by My leave, and thou breathest into it and it becometh a bird by My leave, and thou healest those born blind, and the lepers, by My leave. And behold! thou bringest forth the dead by My leave. And behold! I did restrain the Children of Israel from (violence to) thee when thou didst show them the clear Signs, and the unbelievers among them said: 'This is nothing but evident magic.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when Allah will say (on the Day of Resurrection). \"O 'Iesa (Jesus), son of Maryam (Mary)! Remember My Favour to you and to your mother when I supported you with Ruh-ul-Qudus [Jibrael (Gabriel)] so that you spoke to the people in the cradle and in maturity; and when I taught you writing, Al-Hikmah (the power of understanding), the Taurat (Torah) and the Injeel (Gospel); and when you made out of the clay, as it were, the figure of a bird, by My Permission, and you breathed into it, and it became a bird by My Permission, and you healed those born blind, and the lepers by My Permission, and when you brought forth the dead by My Permission; and when I restrained the Children of Israel from you (when they resolved to kill you) since you came unto them with clear proofs, and the disbelievers among them said: 'This is nothing but evident magic.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Allah said: '(Prophet) Jesus, son of Mary, remember the favor upon you and on your mother; how I strengthened you with the Holy Spirit (Gabriel), to speak to people in your cradle and of age (when he descends and dies); how I taught you the Book and Wisdom, the Torah and the Gospel; and how, by My permission, you fashioned from clay the likeness of a bird, and breathed into it so that, by My permission, it became a living bird. How, by My permission, you healed the blind man and the leper, and by My permission you brought the dead forth; and how I protected you from the Children of Israel when you brought them clear signs; whereupon the unbelievers among them said: \"This is nothing but plain magic\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God will say, “O Jesus son of Mary, recall My favor upon you and upon your mother, how I supported you with the Holy Spirit. You spoke to the people from the crib, and in maturity. How I taught you the Scripture and wisdom, and the Torah and the Gospel. And recall that you molded from clay the shape of a bird, by My leave, and then you breathed into it, and it became a bird, by My leave. And you healed the blind and the leprous, by My leave; and you revived the dead, by My leave. And recall that I restrained the Children of Israel from you when you brought them the clear miracles. But those who disbelieved among them said, `This is nothing but obvious sorcery.'“\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The Day] when Allah will say, \"O Jesus, Son of Mary, remember My favor upon you and upon your mother when I supported you with the Pure Spirit and you spoke to the people in the cradle and in maturity; and [remember] when I taught you writing and wisdom and the Torah and the Gospel; and when you designed from clay [what was] like the form of a bird with My permission, then you breathed into it, and it became a bird with My permission; and you healed the blind and the leper with My permission; and when you brought forth the dead with My permission; and when I restrained the Children of Israel from [killing] you when you came to them with clear proofs and those who disbelieved among them said, \"This is not but obvious magic.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:110] Mention, when God said, ‘O Jesus, son of Mary, remember My favour to you and to your mother, be thankful for it; when I strengthened you with the Holy Spirit, Gabriel, to speak to people (tukallimu’l-nāsa is a circumstantial qualifier referring to the [suffixed pronoun] kāf in ayyadtu-ka) in the cradle, that is, as a child, and in maturity — this implies that he will descend before the Hour, since he was raised up [to God] before middle age, as has already been mentioned in [sūrat] Āl ‘Imrān [Q. 3:55], and when I taught you the Scripture, and wisdom, and the Torah, and the Gospel; and how you create out of clay the likeness (kahay’at: the kāf here functions like a noun and is a direct object), the image, of a bird by My permission, and you breathe into it and it becomes a bird by My permission, by My will, and you heal the blind and the leper   by My permission, and you raise the dead, from their graves back to life, by My permission; and how I restrained the Children of Israel from you, when they intended to kill you, when you brought them clear proofs, miracles, and the disbelievers among them said, “This, what you have done, is nothing but manifest sorcery” (a variant reading [for sihrun, ‘sorcery’] has sāhirun, ‘sorcerer’, in other words, [he] Jesus [is nothing but a manifest sorcerer]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When Allah saith: Jesus, son of Mary! Remember My favour) recollect My grace (unto thee) by bestowing prophethood upon you (and unto thy mother) by gracing her with complete surrender to Allah and with worship; (how I strengthened thee with the holy Spirit) the pure Gabriel: he taught and helped you talk to people, (so that thou spakest unto mankind in the cradle) in your mother's lap and in your cot, saying: I am Allah's servant and anointed one (as in maturity) as did Gabriel help you after you reached your thirtieth year when you said to them: I am Allah's Messenger to you; (and how I taught you the Scripture) the Scriptures of past prophets; and it is said that this means: writing with the pen (and Wisdom) the wisdom of past sages; it is also said that this means: the lawful and the unlawful (and the Torah) and taught you the Torah in the womb of your mother (and the Gospel) after you were born; (and how thou didst shape of clay as it were the likeness of a bird) a bat (by My permission) by My command, (and didst blow upon it) like the breathing of a sleeping person (and it was a bird) flying in the air (by My permission) by My command and 129 will, (and thou didst heal him who was born blind and the leper by My permission) by My command, will and power; (and how thou didst raise the dead) by means of My will and through Me give life to the dead, (by My permission and how I restrained the Children of Israel from you) when they decided to kill you (when thou earnest unto them with clear proofs) with commands, prohibitions and the wondrous things that you showed them, (and those of them who disbelieved) from among the Children of Israel (exclaimed: This) which Jesus is showing us (is naught else than mere magic);\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذْ أَيَّدتُّكَ بِرُوحِ ٱلْقُدُسِ } معناهُ قَوّيتُكَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر وقت { إِذْ قَالَ ٱللَّهُ يٰعِيسَى ٱبْنَ مَرْيَمَ } امتناناً عليه { ٱذْكُرْ نِعْمَتِي عَلَيْكَ وَعَلَىٰ وَالِدَتِكَ } وأقم شكرها { إِذْ أَيَّدتُّكَ } قويتك، وخصصتك { بِرُوحِ ٱلْقُدُسِ } أي: بالنفس القدسية اللاهوتية المطهرة عن شوب القوى الناسوتية، لذلك { تُكَلِّمُ ٱلنَّاسَ فِي ٱلْمَهْدِ وَكَهْلاً } على السوية؛ أي: جعلت لك جميع كمالاتك بالفعل، في جميع أوقات وجودك بلا تفاوت بين طفوليتك وكهوليتك { وَإِذْ عَلَّمْتُكَ ٱلْكِتَابَ } أي: التدبيرات المتعلقة لظواهر الشرع { وَٱلْحِكْمَةَ } المتعقلة لبواطنها { وَٱلتَّوْرَاةَ } الجامع بينهما { وَٱلإِنْجِيلَ } الغالب فيه ما يتعلق بالباطن\n\n\n\n\n{ وَإِذْ تَخْلُقُ } تصور وتقدر { مِنَ ٱلطِّينِ كَهَيْئَةِ ٱلطَّيْرِ بِإِذْنِي } أي: بأمري وتعليمي { فَتَنفُخُ فِيهَا } من روحي التي أبديتك به { فَتَكُونُ طَيْراً بِإِذْنِي } وتُبصِر { وَتُبْرِىءُ ٱلأَكْمَهَ } المكفوف العين { وَ } تشفي { ٱلأَبْرَصَ بِإِذْنِي وَإِذْ تُخْرِجُ ٱلْمَوتَىٰ } من قبورهم أحياء بِإِذْنِيِ { وَإِذْ كَفَفْتُ } ومنعت شر { بَنِيۤ إِسْرَائِيلَ عَنكَ } وقت { إِذْ جِئْتَهُمْ بِٱلْبَيِّنَاتِ } الواضحات المعجزات الباهرات { فَقَالَ ٱلَّذِينَ كَفَرُواْ مِنْهُمْ } من حيث باطنهم: { إِنْ هَـٰذَا إِلاَّ سِحْرٌ مُّبِينٌ } [المائدة: 110] وما هو إلا ساحر عليم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:49",
      "similarity": 0.5806686185353759
    },
    {
      "verse": "3:46",
      "similarity": 0.3565098417219384
    },
    {
      "verse": "2:253",
      "similarity": 0.19911861105267975
    },
    {
      "verse": "2:87",
      "similarity": 0.18027809338183287
    },
    {
      "verse": "18:10",
      "similarity": 0.15391940804372645
    }
  ]
}