{
  "chapter": "المائدة",
  "text": "اذ قال الحواريون يعيسى ابن مريم هل يستطيع ربك ان ينزل علينا مائدة من السماء قال اتقوا۟ الله ان كنتم مؤمنين",
  "translations": [
    {
      "translation": "And when the Disciples said, \"Isa son of Maryam! Can your Lord send down a table to us out of heaven?' He said, 'Have taqwa of Allah if you are muminun!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the disciples said: \"O Jesus, son of Mary, could your Lord send down for us a table laid with food?\" he said: \"Fear God, if indeed you believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also recall when the disciples asked Jesus, son of Mary: 'Jesus, son of Mary, has your Lord the power to send down to us a repast from the heaven?' There- upon Jesus said: 'Fear Allah if you do indeed have faith.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Recall) when the disciples said, \"Jesus, son of Mary, can your Lord send us a table full of food from heaven?\" and you replied, \"Have fear of God if you are true believers\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the disciples said, “O Eisa, the son of Maryam! Will your Lord send down a table spread (with food) for us from heaven?” He said, “Fear Allah, if you are believers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when Al-Hawariyun said: \"O `Isa, son of Maryam! Can your Lord send down to us a Ma'idah from heaven\" `Isa said: \"Have Taqwa of Allah, if you are indeed believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the disciples said: O Isa son of Marium! will your Lord consent to send down to us food from heaven? He said: Be careful of (your duty to) Allah if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Apostles said, 'O Jesus son of Mary, is thy Lord able to send down on us a Table out of heaven?' He said, 'Fear you God, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the disciples said: O Jesus, son of Mary! Is thy Lord able to send down for us a table spread with food from heaven? He said: Observe your duty to Allah, if ye are true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the disciples said, \"O Jesus, son of Mary! Can your Lord send down to us from heaven a table spread with food?\" He replied, \"Have fear of God, if you are true believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recall what time the disciples said: O 'Isa, son of Maryam! is thine Lord able to send down unto us some food from the heaven? He said: fear Allah, if ye are indeed believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Disciples said, ‘O Jesus son of Mary! Can your Lord send down to us a table from the sky?’ Said he, ‘Be wary of Allah, should you be faithful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! the disciples, said: \"O Jesus the son of Mary! can thy Lord send down to us a table set (with viands) from heaven?\" Said Jesus: \"Fear Allah, if ye have faith.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when Al-Hawariun (the disciples) said: \"O 'Iesa (Jesus), son of Maryam (Mary)! Can your Lord send down to us a table spread (with food) from heaven?\" 'Iesa (Jesus) said: \"Fear Allah, if you are indeed believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the disciples said: 'O (Prophet) Jesus, son of Mary, can your Lord send down to us a table from heaven' He replied: 'Have fear of Allah, if you are believers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And when the disciples said, 'O Jesus son of Mary, is your Lord able to bring down for us a feast from heaven?' He said, 'Fear God, if you are believers.'“\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And remember] when the disciples said, \"O Jesus, Son of Mary, can your Lord send down to us a table [spread with food] from the heaven? [Jesus] said,\" Fear Allah, if you should be believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:112] Mention, when the disciples said, ‘O Jesus, son of Mary, is your Lord able, that is, would He (a variant reading has hal tastatī‘a rabbaka, ‘Are you able to ask of Him?’) to send down on us a Table from the heaven?’ He, Jesus, said, to them: ‘Fear God, when you request signs, if you are believers’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجملة : { إذ قال الحواريّون } يجوز أن تكون من تمام الكلام الذي يكلّم الله به عيسى يومَ يجمع الرسل ، فيكون { إذ } ظرفا متعلّقاً بفعل { قالوا آمنّا } \\[ المائدة : 111 \\] فيكون ممّا يذكر الله به عيسى يوم يجمع الرسل ، فحكي على حسب حصوله في الدنيا وليس ذلك بمقتض أنّ سؤالهم المائدة حصل في أول أوقات إيمانهم بل في وقت آخر { قالوا آمنّا واشهد بأنّنا مسلمون } \\[ المائدة : 111 \\] ؛ فإنّ قولهم { آمنّا } قد يتكرّر منهم بمناسبات ، كما يكون عند سماعهم تكذيب اليهود عيسى ، أو عندما يشاهدون آيات على يد عيسى ، أو يقولونه لإعادة استحضار الإيمان شأن الصدّيقيين الذين يحاسبون أنفسهم ويصقلون إيمانهم فيقولون في كلّ معاودة . آمنّا واشهد بأنّنا مسلمون . وأمّا ما قرّر به «الكشاف» ومتابعوه فلا يحسن تفسير الكلام به .ويجوز أن يكون جملة : { إذ قال الحواريّون } ابتدائية بتقدير : اذكر ، على أسلوب قوله تعالى { إذْ قال موسى لأهله إنّي آنست ناراً } في سورة النمل ( 7 ) ، فيكون الكلام تخلّصاً إلى ذكر قصّة المائدة لمناسبة حكاية ما دار بين عيسى وبين الحواريّين في قوله تعالى : { وإذ أوحيت إلى الحواريّين أن آمنوا بي وبرسولي } \\[ المائدة : 111 \\] وابتدأوا خطابهم عيسى بندائه باسمه للدلالة على أنّ ما سيقولونه أمر فيه اقتراح وكلفة له ، وكذلك شأن من يخاطب من يتجشّم منه كلفة أن يطيل خطابه طلباً لإقبال سمعه إليه ليكون أوعى للمقصود .وجرى قوله تعالى : { هل يستطيع ربّك } على طريقة عربية في العرض والدعاء ، يقولون للمستطيع لأمر : هل تستطيع كذا ، على معنى تطلّب العذر له إن لم يجبك إلى مطلوبك وأنّ السائل لا يحبّ أن يكلّف المسؤول ما يشقّ عليه ، وذلك كناية فلم يبق منظوراً فيه إلى صريح المعنى المقتضي أنّه يشكّ في استطاعة المسؤول ، وإنّما يقول ذلك الأدنى للأعلى منه ، وفي شيء يعلم أنه مستطاع للمسؤول ، فقرينة الكناية تحقّقُ المسؤول أنّ السائل يعلم استطاعته . ومنه ما جاء في حديث يحيى المازني «أنّ رجلاً قال لعبد الله بن زيد : أتستطيع أن تريني كيف كان رسول الله يتوضّأ» . فإنّ السائل يعلم أنّ عبد الله بن زيد لا يشقّ عليه ذلك . فليس قول الحواريّين المحكي بهذا اللفظ في القرآن إلاّ لفظاً من لغتهم يدلّ على التلطّف والتأدّب في السؤال ، كما هو مناسب أهل الإيمان الخالص . وليس شكّاً في قدرة الله تعالى ولكنّهم سألوا آية لزيادة اطمئنان قلوبهم بالإيمان بأن ينتقلوا من الدليل العقلي إلى الدليل المحسوس . فإنّ النفوس بالمحسوس آنس ، كما لم يكن سؤال إبراهيم بقوله { ربّ أرني كيف تحيي الموتى } \\[ البقرة : 260 \\] شكّاً في الحال . وعلى هذا المعنى جرى تفسير المحققين مثل ابن عطية ، والواحدي ، والبغوي خلافاً لما في «الكشاف» .وقرأ الجمهور : { يستطيع } بياء الغيبة ورفع { ربُّك } .وقرأه الكسائي { هل تَستطيع ربَّك } بتاء المخاطب ونصب الباء الموحّدة من قوله { ربّك } على أنّ { ربّك } مفعول به ، فيكون المعنى هل تسأل لنا ربّك ، فعبّر بالاستطاعة عن طلب الطاعة ، أي إجابة السؤال . وقيل : هي على حذف مضاف تقديره هل تستطيع سؤال ربّك ، فأقيم المضاف إليه مُقام المضاف في إعرابه . وفي رواية الطبري عن عائشة قالت : كان الحواريّون أعلم بالله عزّ وجل من أن يقولوا : هل يستطيع ربّك ، ولكن قالوا : هل تستطيع ربّك . وعن معاذ بن جبل أقرأنا النبي { هل تستطيع ربّك } .واسم { مائدة } هو الخوان الموضوع عليه طعام ، فهو اسم لمعنى مركّب يدلّ على طعاممٍ وما يوضع عليه . والخِوان بكسر الخاء وضمّها تخت من خشب له قوائم مجعول ليوضع عليه الطعام للأكل ، اتّفقوا على أنّه معرّب . قال الجواليقي : هو أعجمي . وفي حديث قتادة عن أنس قال : ما أكل رسول الله صلى الله عليه وسلم على خوان قطّ ، ولا في سُكُرُّجَة ، قال قتادة : قلت لأنس : فعلاَم كنتم تأكلون قال : على السُّفَر ، وقيل : المائدة اسم الطعام ، وإن لم يكن في وعاء ولا على خِوان . وجزم بذلك بعض المحقّقين من أهل اللغة ، ولعلّه مجاز مرسل بعلاقة المحلّ . وذكر القرطبي أنّه لم تكن للعرب موائد إنّما كانت لهم السفرة . وما ورد في الحديث من قول ابن عباس في الضبّ : لو كان حراماً ما أُكل على مائدة رسول الله ، إنّما يعني به الطعام الموضوع على سفرة . واسم السفرة غلب إطلاقه على وعاء من أديم مستدير له معاليق ليرفع بها إذا أريد السفر به . وسمّيت سفرة لأنّها يتّخذها المسافر . وإنّما سأل الحواريّون كون المائدة منزّلة من السماء لأنّهم رغبوا أن تكون خارقة للعادة فلا تكون ممّا صنع في العالم الأرضي فتعيّن أن تكون من عالم علوي .وقول عيسى حين أجابهم { اتّقوا الله إن كنتم مؤمنين } أمر بملازمة التقوى وعدم تزلزل الإيمان ، ولذلك جاء بِ { إن } المفيدة للشكّ في الإيمان ليعلم الداعي إلى ذلك السؤال خشية أن يكون نشأ لهم عن شكّ في صدق رسولهم ، فسألوا معجزة يعلمون بها صدقه بعد أن آمنوا به ، وهو قريب من قوله تعالى لإبراهيم المحكي في قوله : { قال أو لم تؤمن } ، أي ألم تكن غنيّاً عن طلب الدليل المحسوس . فالمراد بالتقوى في كلام عيسى ما يشمل الإيمان وفروعه . وقيل : نهاهم عن طلب المعجزات ، أي إن كنتم مؤمنين فقد حصل إيمانكم فما الحاجة إلى المعجزة .\n\n",
      "translations": [
        {
          "translation": "(When the disciples) the chosen among them, Simon the Pure (said: Jesus, son of Mary!) your people are asking: (Is thy Lord able) would your Lord; and it is also said that this means: could you pray to your Lord (to send down for us a table spread with food from heaven? He said:) Jesus said to Simon: tell them (Observe your duty to Allah) fear Allah, (if ye are true believers) if you have firm faith, for it may happen that you would not give gratitude for it and, as a result, be punished. And so Simon conveyed the message to them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { هَلْ يَسْتَطِيعُ رَبُّكَ } معناهُ هَلْ يُريدُ رَبُّكَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Is your Lord able?} Its meaning, does your Lord want?",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إذ قالَ الحواريون } إذ اقترح عليك أصحابك فقالوا { هل يستطيع ربّك } أي: شاهدك من عالم الربوبية\n فإنّ ربّ كل واحد هو الاسم الذي يربّه ويكمله ولا يعبد أحد إلا ما عرفه من عالم الربوبية ولا عرف إلا ما بلغ إليه من المرتبة في الألوهية فيستفيض منه العلوم ويستنزل منه البركات ويستمدّ منه المدد الروحاني\n ولهذا قالوا مع إقرارهم وإسلامهم: ربّك\n ولم يقولوا: ربنا\n لأن ربهم لا يستطيع { أن ينزل علينا مائدة من السماء } شريعة من سماء عالم الروح تشتمل على أنواع العلوم والحكم والمعارف والأحكام فيها غذاء القلوب وقوت النفوس وحياتها وذوقها { قال اتّقوا الله } احذروه في ظهور صفات نفوسكم واجعلوه وقاية لكم فيما يصدر عنكم من الأخلاق والأفعال تنجوا من تبعاتها وتفوزوا وتفلحوا إن تحقق إيمانكم فلا حاجة بكم إلى شريعة جديدة\n { قالوا نريد أن } نستفيد { منها } ونعمل بها ونتقوّى بها { وتَطْمَئِن قُلُوبنا } فإنّ العلم غذاء القلب وقوته { ونعلم } صدقك في الإخبار عن ربك ونبوّتك وولايتك بها وفيها { ونكون عليها من الشاهدين } الحاضرين أهل العلم نخبر بها من عدانا من الغائبين ونعلمهم وندعوهم بها إلى الله { تكون لنا عيداً لأوّلنا وآخرنا } أمراً أي: شرعاً وديناً يعود إليه من في زماننا من أهل ديننا ومن بعدنا ممن سيوجد من النصارى { وآية منك } علامة وعلماً منك تعرف بها وتعبد { وارْزقْنَا } ذلك الشرع والعلم النافع والهداية { وأنت خير الرازِقين } لا ترزق إلا ما ينفعنا ويكون صلاحنا فيه { فمن يَكْفر } يحتجب عن ذلك الدين بعد إنزاله ووضوحه { فإني أعذبه عذاباً لا أعذبه أحداً من العالمين } لبيان الطريق ووضوح الدين والحجة مع وجود استعدادهم فلا ينكرونه إلا معاندين والعذاب مع العلم أشدّ من العذاب مع الجهل\n إذ الشعور بالمحجوب عنه يوجب شدّة الإيلام",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n اذكر { إِذْ قَالَ ٱلْحَوَارِيُّونَ } لك حين أرادوا الترقي في مرتبة العلم إلى العين: { يٰعِيسَى ٱبْنَ مَرْيَمَ هَلْ يَسْتَطِيعُ رَبُّكَ } اضافوه إليه\n لتحققه في مرتبة العلم والحق { أَن يُنَزِّلَ عَلَيْنَا مَآئِدَةً } رزقاً معنوياً حقيقاً { مِّنَ ٱلسَّمَآءِ } أي: من جانب العلو الذي هو مرتبة العين والحق\n فلمَّا سمع منهم ما سمع آيس منهم\n وأفظع أمرهم\n وأوجس في نفسه خيفة من الله الغيور\n لأنهم ليسوا في تلك الحالة مستعدين الكشف والشهود\n لذلك { قَالَ ٱتَّقُواْ ٱللَّهَ } عن أمثال هذه الأسئلة { إِن كُنْتُم مُّؤْمِنِينَ } [المائدة: 112] موقنين بكمال قدرته وإرادته واختياره\n واستقلاله بالتصرف في ملكه وملكوته\n\n\n{ قَالُواْ } معتذرين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { يا عيسى ابن مريم }: ابن هنا بدل\n ولذلك كتب بالألف\n و { أن ينزل }: مفعول { يستطيع } \n ومن قرأ بالخطاب\n فمفعول بالمصدر المقدر\n أي: سؤال ربك إنزال مائدة\n و { لأولنا وآخرنا }: بدل كل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:114",
      "similarity": 0.6150142260251159
    },
    {
      "verse": "16:15",
      "similarity": 0.5606719715673995
    },
    {
      "verse": "61:14",
      "similarity": 0.42849032092857386
    },
    {
      "verse": "21:31",
      "similarity": 0.3881821962363775
    },
    {
      "verse": "31:10",
      "similarity": 0.37195084719534943
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005112.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005112.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:112.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}