{
  "chapter": "المائدة",
  "text": "ما قلت لهم الا ما امرتنى به ان اعبدوا۟ الله ربى وربكم وكنت عليهم شهيدا ما دمت فيهم فلما توفيتنى كنت انت الرقيب عليهم وانت على كل شىء شهيد",
  "translations": [
    {
      "translation": "I said to them nothing but what You ordered me to say: \"Worship Allah, my Lord and your Lord.\" I was a witness against them as long as I remained among them, but when You took me back to You, You were the One watching over them. You are Witness of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I said nought to them but what You commanded me: Worship God, my Lord and your Lord. And so long as I dwelt with them I was witness over their actions. And after my life had been done, You were their keeper; and You are a witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I said to them nothing except what You commanded me, that is: 'Serve Allah, my Lord and your Lord.' I watched over them as long as I remained among them; and when You did recall me, then You Yourself became the Watcher over them. Indeed, You are Witness over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I did not tell them anything except what You commanded me to tell them. I told them that they must worship God who is everyone's Lord. I watched them as long as I was among them until You raised me to Yourself and You Yourself had also watched over them; You are Omnipresent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“I have not told them except what You commanded me, that ‘Worship Allah, Who is my Lord and is also your Lord’; I was aware of them till I was among them; and when You raised me, only You watched over them; and all things are present before You.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never did I say to them ought except what You (Allah) did command me to say: `Worship Allah, my Lord and your Lord.' And I was a witness over them while I dwelled amongst them, but when You took me [up], You were the Watcher over them, and You are a Witness to all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I did not say to them aught save what Thou didst enjoin me with: That serve Allah, my Lord and your Lord, and I was a witness of them so long as I was among them, but when Thou didst cause me to die, Thou wert the watcher over them, and Thou art witness of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I only said to them what Thou didst command me: \"Serve God, my Lord and your Lord.\" And I was a witness over them, while I remained among them; but when Thou didst take me to Thyself, Thou wast Thyself the watcher over them; Thou Thyself art witness of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I spake unto them only that which Thou commandedst me, (saying): Worship Allah, my Lord and your Lord. I was a witness of them while I dwelt among them, and when Thou tookest me Thou wast the Watcher over them. Thou art Witness over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I told them only what You commanded me to, \"Worship God, my Lord and your Lord.\" I was a witness to what they did as long as I remained among them, and when You took my soul, You were the watcher over them. You are the witness of all things,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I spake not unto them aught save that for which Thou badest me: worship Allah, mine Lord and your Lord. I was a witness over them so long as abode amongst them: then when Thou tookest up Thou hast been the Watcher. And over everything Thou art a Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I did not say to them [anything] except what You had commanded me [to say]: ‘‘Worship Allah, my Lord and your Lord.’’ And I was a witness to them so long as I was among them. But when You had taken me away, You Yourself were watchful over them, and You are witness to all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never said I to them aught except what Thou didst command me to say, to wit, 'worship Allah, my Lord and your Lord'; and I was a witness over them whilst I dwelt amongst them; when Thou didst take me up Thou wast the Watcher over them, and Thou art a witness to all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never did I say to them aught except what You (Allah) did command me to say: 'Worship Allah, my Lord and your Lord.' And I was a witness over them while I dwelt amongst them, but when You took me up, You were the Watcher over them, and You are a Witness to all things. (This is a great admonition and warning to the Christians of the whole world).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I spoke to them of nothing except that which You ordered me, that you worship Allah, my Lord and our Lord. I witnessed them whilst living in their midst and ever since You took me to You, You have been the Watcher over them. You are the Witness of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I only told them what You commanded me: that you shall worship God, my Lord and your Lord. And I was a witness over them while I was among them; but when You took me to Yourself, you became the Watcher over them—You are Witness over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I said not to them except what You commanded me - to worship Allah, my Lord and your Lord. And I was a witness over them as long as I was among them; but when You took me up, You were the Observer over them, and You are, over all things, Witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:117] I only said to them that which You commanded me, to [say], and that is: “Worship God, my Lord and your Lord.” And I was a witness, a watcher, over them, preventing them from [saying] what they used to say,   whilst I was amongst them; but when You took me [to You], [when] You raised me up to the heaven, You were Yourself the Watcher over them, the Observer of their deeds, and You Yourself are Witness over all things, Aware and knowing them, including what I said to them and what they said after me, and whatever else.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(I spake unto them) in the life of this world (only that which Thou commandedst me, (saying): Worship Allah) declare Allah's divine Oneness and obey Him, (my Lord and your Lord) He is my Lord and yours. (I was a witness of them) by conveying the message (while I dwelt among them, and when Thou tookest me) when you raised from amongst them (Thou wast the Watcher over them) You were the Protector and Witness of them. (Thou art Witness over all things) of what I said and what they said.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم بسط عيسى الكلام مع ربه؛ تشفياً، فقال: { مَا قُلْتُ لَهُمْ } قولاً { إِلاَّ مَآ أَمَرْتَنِي بِهِ } أي: بتبليغه وإيصاله إليهم، وهو { أَنِ ٱعْبُدُواْ ٱللَّهَ } الواحد الأحد الذي هو { رَبِّي } أوجدني من العدم، ورباني بأنواع اللطف والكرم { وَرَبَّكُمْ } أيضاً أوجدكم من العدم مثلثي، ورباكم، فتكون نسبة إيجاده وتربيته علي وعليكم على السواء، ما ترى من تفاوت في خلقه { وَكُنتُ } بأمرك وإرسالك ووحيك { عَلَيْهِمْ شَهِيداً } أحفظهم بتوفيقكم عن أمثال هذه الهذيانات الباطلة { مَّا دُمْتُ فِيهِمْ فَلَمَّا تَوَفَّيْتَنِي } ورفعتني بجودك إلى ما رفعتني { كُنتَ } بذاتك وأسمائك وأوصافك { أَنتَ الرَّقِيبَ } المحافظ { عَلَيْهِمْ } المولي لأمورهم، تضلهم وتهديهم، ترشدهم وتغويهم { وَأَنتَ } المنزه بذاتك عن جميع الأكوان { عَلَىٰ كُلِّ شَيْءٍ } من الأمور الكائنة { شَهِيدٌ } [المائدة: 117] حاضر غير مغيب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والتوفي أخذ الشيء وافيًا، فلما رفعتني إلى السماء { كنت أنت الرقيب عليهم } أي: المراقب لأحوالهم { وأنت على كل شيء شهيد }: مطّلع عليه مراقب له",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:23",
      "similarity": 0.6609118186969637
    },
    {
      "verse": "11:107",
      "similarity": 0.641652312692824
    },
    {
      "verse": "13:35",
      "similarity": 0.4846981207675144
    },
    {
      "verse": "19:31",
      "similarity": 0.45568787277744127
    },
    {
      "verse": "5:24",
      "similarity": 0.3914639031853121
    }
  ]
}