{
  "chapter": "المائدة",
  "text": "واذ اوحيت الى الحوارين ان ءامنوا۟ بى وبرسولى قالوا۟ ءامنا واشهد باننا مسلمون",
  "translations": [
    {
      "translation": "and when I inspired the Disciples to have iman in Me and in My Messenger, they said, \"We have iman. Bear witness that we are Muslims.'\"",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when I inspired the disciples (through Jesus) to believe in Me and My apostle, they said: \"We believe, and You bear witness that we submit\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when I revealed to the disciples to believe in Me and in My Mes-senger, they said: \"We do believe, and we bear witness that we indeed are the ones who submit to Allah\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Recall) when I inspired the disciples to have faith in Me and My Messenger. They said, \"We have accepted the faith. Lord, bear witness that we have submitted ourselves to Your will\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And when I inspired into the hearts of the disciples that, ‘Believe in Me and in My Noble Messenger’; they said, ‘We accept faith, and be witness that we are Muslims.’”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when I Awhaytu [put in the hearts of] Al- Hawariyyin to believe in Me and My Messenger, they said: `We believe. And bear witness that we are Muslims.\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when I revealed to the disciples, saying, Believe in Me and My apostle, they said: We believe and bear witness that we submit (ourselves).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when I inspired the Apostles: \"Believe in Me and My Messenger\"; they said, \"We believe; witness Thou our submission.\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when I inspired the disciples, (saying): Believe in Me and in My messenger, they said: We believe. Bear witness that we have surrendered (unto Thee) \"we are muslims\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Remember the time], when I inspired the disciples to believe in Me and in My messenger, they replied, \"We believe, bear witness that we have submitted.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time I revealed to the disciples: believe in Me and My Apostle, they said: we have believed and bear thou witness that verily we are Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when I inspired the Disciples, [saying], ‘Have faith in Me and My apostle,’ they said, ‘We have faith. Bear witness that we are Muslims.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And behold! I inspired the disciples to have faith in Me and Mine Messenger: they said, 'We have faith, and do thou bear witness that we bow to Allah as Muslims'\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when I (Allah) put in the hearts of Al-Hawarieen (the disciples) [of 'Iesa (Jesus)] to believe in Me and My Messenger, they said: \"We believe. And bear witness that we are Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When I revealed to the disciples to believe in Me and in My Messenger they replied: \"We believe, bear witness that we submit.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And when I inspired the disciples: `Believe in Me and in My Messenger.' They said, `We have believed, so bear witness that We have submitted.'“\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [remember] when I inspired to the disciples, \"Believe in Me and in My messenger Jesus.\" They said, \"We have believed, so bear witness that indeed we are Muslims [in submission to Allah].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:111] And when I revealed to the disciples, [when] I commanded them by the tongue of Jesus: “Believe in Me and in My Messenger”, Jesus; they said, “We believe, in both; bear witness that we have submitted”.’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيجوز أن يكون عطفاً على جملة { إذْ أيَّدتك بروح القدس } \\[ المائدة : 110 \\] ، فيكون من جملة ما يقوله الله لعيسى يوم يجمع الرسل . فإنّ إيمان الحواريّين نعمة على عيسى إذ لو لم يؤمنوا به لما وجد من يتّبع دينه فلا يحصل له الثواب المتجدّد بتجدد اهتداء الأجيال بدينه إلى أن جاء نسخه بالإسلام .والمراد بالوحي إلى الحواريّين إلهامهم عند سماع دعوة عيسى للمبادرة بتصديقه ، فليس المراد بالوحي الذي به دعاهم عيسى . ويجوز أن يكون الوحيَ الذي أوحي به إلى عيسى ليدعو بني إسرائيل إلى دينه . وخُصّ الحواريّون به هنا تنويهاً بهم حتّى كأنّ الوحي بالدعوة لم يكن إلاّ لأجلهم ، لأنّ ذلك حصل لجميع بني إسرائيل فكفر أكثرهم على نحو قوله تعالى : { كما قال عيسى ابنُ مريم للحواريّين من أنصاري إلى الله قالَ الحواريّون نحن أنصار الله فآمنت طائفة من بني إسرائيل وكفرت طائفة } \\[ الصف : 14 \\] ؛ فكان الحواريّون سابقين إلى الإيمان لم يتردّدوا في صدق عيسى . و { أنْ } تفسيرية للوحي الذي ألقاه الله في قلوب الحواريّين .وفَصْل جملة { قالوا آمنَّا } لأنّها جوابُ ما فيه معنى القول ، وهو «أوحينا» ، على طريقة الفصل في المحاورة كما تقدّم في سورة البقرة ، وهو قول نفسي حصل حين ألقى الله في قلوبهم تصديق عيسى فكأنّه خاطبهم فأجابوه . والخطاب في قولهم : { واشهَدْ } لله تعالى وإنّما قالوا ذلك بكلام نفسي من لغتهم ، فحكى الله معناه بما يؤدّيه قوله : { واشهد بأنّنا مسلمون } . وسمّى إيمانهم إسلاماً لأنّه كان تصديقاً راسخاً قد ارتفعوا به عن مرتبة إيمان عامّة من آمن بالمسيح غيرهم ، فكانوا مماثلين لإيمان عيسى ، وهو إيمان الأنبياء والصدّيقيين ، وقد قدّمت بيانه في تفسير قوله تعالى : { ولكن كان حنفياً مسلماً } في سورة آل عمران ( 67 ) ، وفي تفسير قوله { فلا تموتنّ إلاّ وأنتم مسلمون } في سورة البقرة ( 132 ) فارجع إليه .\n\n",
      "translations": [
        {
          "translation": "(And when I inspired the disciples) who were 12 in number, ((saying): Believe in Me and in My messenger) Jesus, (they said: We believe) in You and in Your Messenger Jesus. (Bear witness) you, Jesus, and they also bore witness one for the other (that we have surrendered (unto You)) sincere in worship and in declaring Allah's divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِذْ أَوْحَيْتُ إِلَى ٱلْحَوَارِيِّينَ } معناهُ أَلقيتُ فِي قلوبِهِم\n",
      "translations": [
        {
          "translation": "\n\nAnd when I revealed myself to the two angels, I placed in their hearts",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِذْ أَوْحَيْتُ } وألهمت { إِلَى ٱلْحَوَارِيِّينَ أَنْ آمِنُواْ بِي وَبِرَسُولِي } عيسى بن مريم { قَالُوۤاْ } عن صميم فؤادهم: { آمَنَّا } بك وبرسولك { وَٱشْهَدْ } يا بنا { بِأَنَّنَا مُسْلِمُونَ } [المائدة: 111] منقادون بدينك ونبيك\n نستوعدك هذه الشهادة إلى قوت الحاجة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:22",
      "similarity": 0.7437220088958858
    },
    {
      "verse": "84:14",
      "similarity": 0.7108984592752823
    },
    {
      "verse": "44:54",
      "similarity": 0.6887239432640939
    },
    {
      "verse": "18:34",
      "similarity": 0.4708073135068843
    },
    {
      "verse": "3:52",
      "similarity": 0.46288434151517605
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005111.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005111.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:111.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}