{
  "chapter": "المائدة",
  "text": "واذ قال الله يعيسى ابن مريم ءانت قلت للناس اتخذونى وامى الهين من دون الله قال سبحنك ما يكون لى ان اقول ما ليس لى بحق ان كنت قلته فقد علمته تعلم ما فى نفسى ولا اعلم ما فى نفسك انك انت علم الغيوب",
  "translations": [
    {
      "translation": "And when Allah says, \"Isa son of Maryam! Did you say to people, \"Take me and my mother as gods besides Allah?'\" he will say, 'Glory be to You! It is not for me to say what I have no right to say! If I had said it, then You would have known it. You know what is in my self but I do not know what is in Your Self. You are the Knower of all unseen things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when God will ask: \"O Jesus, son of Mary, did you say to mankind: 'Worship me and my mother as two deities apart from God?' (Jesus) will answer: \"Halleluja. Could I say what I knew I had no right (to say)? Had I said it You would surely have known, for You know what is in my heart though I know not what You have. You alone know the secrets unknown.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And imagine when thereafter Allah will say: 'Jesus, son of Mary, did you say to people: \"Take me and my mother for gods beside Allah?\" and he will answer: \"Glory to You! It was not for me to say what I had no right to. Had I said so, You would surely have known it. You know all what is within my mind whereas I do not know what is within Yours. You, indeed You, know fully all that is beyond the reach of human perception.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God asked Jesus, son of Mary \"Did you tell men to consider you and your mother as their gods besides God?\" he replied, \"Glory be to you! How could I say what I have no right to say? Had I ever said it, You would have certainly known about it. You know what is in my soul, but I do not know what is in Yours. It is You who has absolute knowledge of the unseen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah will say, “O Eisa, the son of Maryam! Did you say to the people, ‘Appoint me and my mother as two Gods, besides Allah’?” He will submit, “Purity is to You! It is not proper for me to say something for which I do not have a right; if I have said it, then surely You know it; You know what lies in my heart, and I do not know what is in Your knowledge; indeed You only know all the hidden.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Allah will say (on the Day of Resurrection): \"O `Isa, son of Maryam! Did you say unto men: `Worship me and my mother as two gods besides Allah\"' He will say: \"Glory be to You! It was not for me to say what I had no right (to say). Had I said such a thing, You would surely have known it. You know what is in my inner self though I do not know what is in Yours, truly, You, only You, are the Knower of all that is hidden and unseen.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah will say: O Isa son of Marium! did you say to men, Take me and my mother for two gods besides Allah he will say: Glory be to Thee, it did not befit me that I should say what I had no right to (say); if I had said it, Thou wouldst indeed have known it; Thou knowest what is in my mind, and I do not know what is in Thy mind, surely Thou art the great Knower of the unseen things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when God said, 'O Jesus son of Mary, didst thou say unto men, \"Take me and my mother as gods, apart from God\"?' He said, 'To Thee be glory! It is not mine to say what I have no right to. If I indeed said it, Thou knowest it, knowing what is within my soul, and I know not what is within Thy soul; Thou knowest the things unseen\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah saith: O Jesus, son of Mary! Didst thou say unto mankind: Take me and my mother for two gods beside Allah? he saith: Be glorified! It was not mine to utter that to which I had no right. If I used to say it, then Thou knewest it. Thou knowest what is in my mind, and I know not what is in Thy Mind. Lo! Thou, only Thou, art the Knower of Things Hidden?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God says, \"Jesus, son of Mary, did you say to people, \"Take me and my mother as two deities besides God\"?\" He will answer, \"Glory be to You! How could I ever say that to which I have no right? If I had ever said so, You would surely have known it. You know what is in my mind, while I do not know anything that is within Yours. You alone are the knower of unseen things --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And call to mind what time Allah will say: O 'Isa, son of Maryam! was it thou who said to the people: take me and my mother as two god beside Allah! 'Isa will say: hallowed be Thou! it was not for me to say that to which had no right; had I said it, Thou would have surely known it; Thou knowest that which is in my mind and know not that which is in Thy mind. Verily Thou! Thou art the Great Knower of the things hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah will say, ‘O Jesus son of Mary! Was it you who said to the people, ‘‘Take me and my mother for gods besides Allah’’?’ He will say, ‘Immaculate are You! It does not behoove me to say what I have no right to [say]. Had I said it, You would certainly have known it: You know whatever is in my self, and I do not know what is in Your Self. Indeed, You are knower of all that is Unseen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And behold! Allah will say: \"O Jesus the son of Mary! Didst thou say unto men, worship me and my mother as gods in derogation of Allah'?\" He will say: \"Glory to Thee! never could I say what I had no right (to say). Had I said such a thing, thou wouldst indeed have known it. Thou knowest what is in my heart, Thou I know not what is in Thine. For Thou knowest in full all that is hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Allah will say (on the Day of Resurrection): \"O 'Iesa (Jesus), son of Maryam (Mary)! Did you say unto men: 'Worship me and my mother as two gods besides Allah?' \" He will say: \"Glory be to You! It was not for me to say what I had no right (to say). Had I said such a thing, You would surely have known it. You know what is in my inner-self though I do not know what is in Yours, truly, You, only You, are the All-Knower of all that is hidden and unseen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Allah said: '(Prophet) Jesus, son of Mary, did you ever say to the people: \"Take me and my mother for two gods, other than Allah?\" 'Exaltations to You' he said, 'how could I say that to which I have no right? If I had said that, You would have surely known. You know what is in my self, but I do not know what is in Yours. Indeed, You are the Knowledgeable of the unseen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And God will say, “O Jesus son of Mary, did you say to the people, `Take me and my mother as gods rather than God?'“ He will say, “Glory be to You! It is not for me to say what I have no right to. Had I said it, You would have known it. You know what is in my soul, and I do not know what is in your soul. You are the Knower of the hidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [beware the Day] when Allah will say, \"O Jesus, Son of Mary, did you say to the people, 'Take me and my mother as deities besides Allah?'\" He will say, \"Exalted are You! It was not for me to say that to which I have no right. If I had said it, You would have known it. You know what is within myself, and I do not know what is within Yourself. Indeed, it is You who is Knower of the unseen.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:116] And, mention, when God says, that is, when God will say, to Jesus at the Resurrection in rebuke of his followers: ‘O Jesus, son of Mary, did you say to mankind, “Take me and my mother as gods, besides God”?’ He, Jesus, says, shuddering: ‘Glory be to You!, exalted be You above all that does not befit You, such as [having] a partner and so on. It is not mine, it is unjustified [for me], to say what I have no right to (bihaqq, ‘right to’, is the predicate of laysa, ‘not’; lī, ‘mine’, is explicative). If I indeed had said it, You would have known it. You know what is, hidden by me, in my self, but I do not know what is within Your Self, that is, what You keep hidden of Your knowledge: You are the Knower of things unseen.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when Allah saith) Allah says on the Day of Judgement: (0 Jesus, son of Mary! Didst thou say unto mankind) in the life of this world: (Take me and my mother for two gods beside Allah? He) Jesus (saith: Be glorified! It was not mine) it was not proper nor was it permissible (to utter that to which I had no right. If I used to say it) to them, (then Thou knewest it. Thou knowest what is in my mind) you know that which I have conveyed to them of commands and prohibitions, (and I know not what is in Thy mind) I do not know what proceeded from you to them in terms of forsakenness or success. (Lo! Thou, only Thou art the Knower of Things Hidden) things hidden from the servants. 130\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر { إِذْ قَالَ ٱللَّهُ } حين فشا غلو النصارى في حق عيسى وأمه، ونسبتهما إلى الألوهية، وقولهم بالتثليث والأقانينم والحلول والاتحاد: { يٰعِيسَى ٱبْنَ مَرْيَمَ أَأَنتَ قُلتَ لِلنَّاسِ ٱتَّخِذُونِي وَأُمِّيَ إِلَـٰهَيْنِ مِن دُونِ ٱللَّهِ } واعبدوني مثل عبادته، أم اتخذوك من تلقاء أنفسهم؟ { قَالَ } عيسى منزهاً لله، مبعداً نفسه إليها عن أمثاله: { سُبْحَانَكَ } أنزهك تنزيهاً عن أن يكون لك شريك { مَا يَكُونُ } ما يصح ويليق { لِيۤ أَنْ أَقُولَ مَا } أي: قولاً { لَيْسَ لِي بِحَقٍّ } لائق جائز أن أقوله، سيما بعد لطفك إلي، وفضلك وامتنانك علي { إِن كُنتُ قُلْتُهُ فَقَدْ عَلِمْتَهُ } إذ { تَعْلَمُ } بالعلم الحضوري { مَا فِي نَفْسِي وَ } أنا { لاَ أَعْلَمُ مَا فِي نَفْسِكَ } وذاتك وشأنك وسلطانك { إِنَّكَ أَنتَ عَلاَّمُ ٱلْغُيُوبِ } [المائدة: 116]\n\n\n\n\nوإنما خاطبه سبحانه، وعاتبه بما عابته مع أن الأمر معلوم عنده؛ ليوبخ ويقرع على الغالين المتخذين؛ لعلهم ينتهون بسوء صنيعهم، وقبح معاملتهم مع الله المتوحد، المتفرد المنزه بذاته عن الأهل والولد، الصمد المقدس الذي\n\n[الإخلاص: 3-4]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { من دون الله }: صفة لإلهين، أو صلة { اتخذوني } ، و { أن أعبدوا }: تفسيرية للمأمور به، أو بدل من ضمير به، وليس من شرط البدل جواز طرح المبدل منه مطلقًا لئلا يلزم منه بقاء الموصول بلا راجع، أو عطف بيان له، أو خبر عن مضمر، أي: هو، أو معفول به، أي: أعني، ولا يجوز إبداله من { ما } لأن المصدر لا يكون مفعولاً للقول لأنه مفرد، والقول لا يعمل إلا في الجمل أو ما في معناه\n { يوم ينفع } من نصب جعله ظرفًا لقال، أو ظرف، مستقر خبرِ { هذا } والمعنى: هذا الذي مَرّ من كلام عيسى، واقع يوم ينفع، الخ، وأجاز ابن مالك أن يكون مبنيًّا، قال في ألفيته:\n\nومَن رفع، فخبر، وهو ظرف متصرف\n يقول الحقّ جلّ جلاله: واذكر { إذ قال الله يا عيسى } بعد رفعه إلى السماء، أو يقول له يوم القيامة، وهو الصحيح، بدليل قوله: { قال الله هذا } الخ، فإن اليوم الذي { ينفع الصادقين صدقهم } هو يوم القيامة، فيقول له حينئذٍ: { أنت قلت للناس اتخذوني وأمي إلهين من دون الله } يريد به توبيخ الكفار الذين عبدوه وتبكيتهم، وفيه تنبيه على أن من عبد مع الله غيره فكأنه لم يعبد الله قط، إذ لا عبرة بعبادة من أشرك معه غيره\n { قال } عيسى عليه السلام مبرءًا نفسه من ذلك وقد أرعد من الهيبة: { سبحانك } أي: تنزيهًا لك من أن يكون لك شريك، { ما يكون لي أن أقول ما ليس لي بحق } أي: ما ينبغي لي أن أقول ما لا يجوز لي أن أقوله، { إن كنتُ قُلتُه فقد علمته } ، وكَلَ العلم إلى الله لتظهر براءته، لأن الله علم أنه لم يقل ذلك، { تعلم ما في نفسي ولا أعلم ما في نفسك } أي: تعلم ما أخفيته في نفسي، كما تعلم ما أعلنته، ولا أعلم ما تخفيه، من معلوماتك، سلك في اللفظ مسلك المشاكلة، فعبّر بالنفس عن الذات\n { إنك أنت علاّم الغيوب } لا يخفى عليك شيء من الأقوال والأفعال\n { ما قُلتُ لهم إلا ما أمرتني به } وهو عبادة الله وحده، فقلت لهم: { اعبدوا الله ربي وربكم وكنت عليهم شهيدًا } أي: رقيبًا عليهم، أمنعهم أن يقولوا ذلك أو يعتقدوه\n { ما دمتُ فيهم فلما توفيتني } بالرفع إلى السماء، أي: توفيت أجلي من الأرض",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:34",
      "similarity": 0.547262290983228
    },
    {
      "verse": "3:45",
      "similarity": 0.43386604905853715
    },
    {
      "verse": "61:6",
      "similarity": 0.4145416973280391
    },
    {
      "verse": "33:7",
      "similarity": 0.41323002465682696
    },
    {
      "verse": "5:78",
      "similarity": 0.35906774670509156
    }
  ]
}