{
  "chapter": "المائدة",
  "text": "قال الله هذا يوم ينفع الصدقين صدقهم لهم جنت تجرى من تحتها الانهر خلدين فيها ابدا رضى الله عنهم ورضوا۟ عنه ذلك الفوز العظيم",
  "translations": [
    {
      "translation": "Allah will say, 'This is the Day when the sincerity of the sincere will benefit them. They will have Gardens with rivers flowing under them, remaining in them timelessly, for ever and ever. Allah is pleased with them and they are pleased with Him. That is the Great Victory.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will say: 'This is the day when the truthful shall profit by their truthfulness. For them will be gardens with streams running by, where they will for ever abide.\" God will accept them, and they will be gratified in (obeying) Him. This will surely be happiness supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon Allah will say: 'This day truthfulness shall profit the truthful. For them are Gardens beneath which rivers flow. There they will abide for ever. Allah is well- pleased with them, and they well-pleased with Allah. That indeed is the mighty triumph.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will say, \"This is the Day when the truthful ones will benefit from their truthfulness. For them there are gardens wherein streams flow and they will live therein forever. God is pleased with them and they will be pleased with God in their supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaimed Allah, “This is a day on which the truthful will benefit from their truthfulness; for them are Gardens beneath which rivers flow, in which they will abide for ever and ever; Allah is pleased with them and they are pleased with Allah; this is the greatest success.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will say: \"This is a Day on which the truthful will profit from their truth: Theirs are Gardens under which rivers flow (in Paradise) -- they shall abide therein forever. Allah is pleased with them and they with Him. That is the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will say: This is the day when their truth shall benefit the truthful ones; they shall have gardens beneath which rivers flow to abide in them for ever: Allah is well pleased with them and they are well pleased with Allah; this is the mighty achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God said, 'This is the day the truthful shall be profited by their truthfulness. For them await gardens underneath which rivers flow, therein dwelling forever and ever; God being well-pleased with them and they well-pleased with Him; that is the mighty triumph.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah saith: This is a day in which their truthfulness profiteth the truthful, for theirs are Gardens underneath which rivers flow, wherein they are secure for ever, Allah taking pleasure in them and they in Him. That is the great triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will say, \"This is the Day when the truthful will benefit from their truthfulness. They shall forever dwell in Gardens through which rivers flow. God is pleased with them and they with Him: that is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will say: this is a Day whereon their truthfulness will benefit the truthful. Theirs are Gardens whereunder rivers flow; they shall be abiders therein for ever, well-pleased is Allah with them and well-pleased are they with Him: that is an achievement supreme.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will say, ‘This day truthfulness shall benefit the truthful. For them there will be gardens with streams running in them, to remain in them forever. Allah is pleased with them and they are pleased with Him. That is the great success.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will say: \"This is a day on which the truthful will profit from their truth: theirs are gardens, with rivers flowing beneath,- their eternal Home: Allah well-pleased with them, and they with Allah: That is the great salvation, (the fulfilment of all desires).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will say: \"This is a Day on which the truthful will profit from their truth: theirs are Gardens under which rivers flow (in Paradise) - they shall abide therein forever. Allah is pleased with them and they with Him. That is the great success (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will say: 'This is the Day the truthful shall benefit by their truthfulness. They shall live for ever in Gardens underneath which rivers flow. Allah is pleased with them, and they are pleased with Him. That is the great winning'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will say, “This is a Day when the truthful will benefit from their truthfulness.” They will have Gardens beneath which rivers flow, wherein they will remain forever. God is pleased with them, and they are pleased with Him. That is the great attainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will say, \"This is the Day when the truthful will benefit from their truthfulness.\" For them are gardens [in Paradise] beneath which rivers flow, wherein they will abide forever, Allah being pleased with them, and they with Him. That is the great attainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:119] God says, ‘This, namely, the Day of Resurrection, is the day those who were truthful, in the world, like Jesus, shall profit by their truthfulness, because this is the Day of Requital. Theirs will be Gardens underneath which rivers flow, wherein they shall abide forever. God is well-pleased with them, because of their obedience to Him, and they are well-pleased with Him, with His reward — that is the great triumph’. The sincerity of those who were liars in this world shall not avail them on that Day, just as [it shall not avail] the disbelievers when they believe upon seeing the chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah saith) Allah will say: (This is a day in which their truthfulness profiteth the Truthful) and their faith the believers and their conveyance the conveyors of messages and their loyalty the loyal people, (for theirs are Gardens underneath which) beneath its trees and couches (rivers) of water, milk, wine and honey (flow, wherein they are secure for ever) in Paradise they dwell, never to die or be removed from it, (Allah taking pleasure in them) because of their faith and works (and they in Him) because of His reward and the honour bestowed upon them. (That) which I have mentioned of eternity and pleasure (is the great triumph) the ultimate safety: they earned Paradise and were saved from the torment of hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وصدق كل صادق لكونه خميرة الكمالات وخاصية الملكوت { لهم جنات } الصفات بدليل ثمرة الرضوان فإنّ الرضا لا يكون إلا بفناء الإرادة ولا تفنى إرادتهم إلا إذا غلبت إرادة الله عليهم فأفنتها\n ولهذا قدّم رضوان الله عنهم على رضوانهم عنه\n أي: لما أرادهم الله تعالى في الأزل بمظهرية إرادته ومحل رضوانه ورضي بهم محلاً وأهلاً لذلك سلب عنهم إرادتهم بأن جعل إرادته مكانها وأبدلهم بها فرضي عنهم وأرضاهم { ذلِكَ الفوز العَظِيم } أي: الفلاح العظيم الشأن ولو كان فناء الذات لكان الفوز الأكبر والفلاح الأعظم\n له ما في العالم العلويّ والسفليّ باطنه وظاهره { وما فيهنّ } أسماؤه وصفاته وأفعاله { وهو على كل شيء قدير } إن شاء أفنى بظهور ذاته\n وإن شاء أوجد بتستره بأسمائه وصفاته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n خصوصاً أمر قومه { قَالَ ٱللَّهُ } سبحانه: يا عيسى { هَـٰذَا يَوْمُ } لا يكتسب فيه الخير\n ولا يتسجلب النفع\n ولا يدفع الضر\n بل { يَنفَعُ ٱلصَّادِقِينَ } الذين صدقوا في النشأة الأولى { صِدْقُهُمْ } السابق { لَهُمْ } شفي هذه النشأة لهؤلاء الصادقين إلى { جَنَّاتٌ } منتزهات المعارف والحقائق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } مملوءة بمياه المكاشفات والمشاهدات المثمرة للحياة الأبدية والبقاء السرمدي { خَالِدِينَ فِيهَآ أَبَداً } لا يتحولون عنها أصلاً { رَّضِيَ ٱللَّهُ عَنْهُمْ } لتحققهم بمقام الصدق والإخلاص { وَرَضُواْ عَنْهُ } لإيصالهم إلى غاية ما جبلوا عليه لأجله بلا منتظر { ذٰلِكَ } الوصول والتحقق هو { ٱلْفَوْزُ ٱلْعَظِيمُ } [المائدة: 119] والفضل العميم\n واللطف الجسيم لأهل العناية الفائزين من عنده بهذه المرتبة العلية\n\n\nولا يستبعد من الله أمثال هذه الكرامات مع أرباب الولاء الباذلين مهجهم في سلوك طريق الفناء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يوم ينفع } من نصب جعله ظرفًا لقال\n أو ظرف\n مستقر خبرِ { هذا } والمعنى: هذا الذي مَرّ من كلام عيسى\n واقع يوم ينفع\n الخ\n وأجاز ابن مالك أن يكون مبنيًّا\n قال في ألفيته:\nومَن رفع\n فخبر\n وهو ظرف متصرف\n يقول الحقّ جلّ جلاله: واذكر { إذ قال الله يا عيسى } بعد رفعه إلى السماء\n أو يقول له يوم القيامة\n وهو الصحيح\n بدليل قوله: { قال الله هذا } الخ\n فإن اليوم الذي { ينفع الصادقين صدقهم } هو يوم القيامة\n فيقول له حينئذٍ: { أنت قلت للناس اتخذوني وأمي إلهين من دون الله } يريد به توبيخ الكفار الذين عبدوه وتبكيتهم\n وفيه تنبيه على أن من عبد مع الله غيره فكأنه لم يعبد الله قط\n إذ لا عبرة بعبادة من أشرك معه غيره\n { قال } عيسى عليه السلام مبرءًا نفسه من ذلك وقد أرعد من الهيبة: { سبحانك } أي: تنزيهًا لك من أن يكون لك شريك\n { ما يكون لي أن أقول ما ليس لي بحق } أي: ما ينبغي لي أن أقول ما لا يجوز لي أن أقوله\n { إن كنتُ قُلتُه فقد علمته } \n وكَلَ العلم إلى الله لتظهر براءته\n لأن الله علم أنه لم يقل ذلك\n { تعلم ما في نفسي ولا أعلم ما في نفسك } أي: تعلم ما أخفيته في نفسي\n كما تعلم ما أعلنته\n ولا أعلم ما تخفيه\n من معلوماتك\n سلك في اللفظ مسلك المشاكلة\n فعبّر بالنفس عن الذات\n { إنك أنت علاّم الغيوب } لا يخفى عليك شيء من الأقوال والأفعال\n { ما قُلتُ لهم إلا ما أمرتني به } وهو عبادة الله وحده\n فقلت لهم: { اعبدوا الله ربي وربكم وكنت عليهم شهيدًا } أي: رقيبًا عليهم\n أمنعهم أن يقولوا ذلك أو يعتقدوه\n { ما دمتُ فيهم فلما توفيتني } بالرفع إلى السماء\n أي: توفيت أجلي من الأرض\n والتوفي أخذ الشيء وافيًا\n فلما رفعتني إلى السماء { كنت أنت الرقيب عليهم } أي: المراقب لأحوالهم { وأنت على كل شيء شهيد }: مطّلع عليه مراقب له\n { إن تعذبهم فأنهم عبادك } وأنت مالك لهم\n ولا اعتراض على المالك في ملكه\n وفيه تنبيه على أنهم استحقوا العذاب\n أي: لأنهم عبادك وقد عبدوا غيرك\n { وإن تغفر لهم فإنك أنت العزيز الحكيم } \n فلا عجز ولا استقباح\n فإنك القادر والقوي على الثواب والعقاب بلا سبب\n ولا تُعاقب إلا عن حكمة وصواب\n فإن عذبت فعدل\n وإن غفرت ففضل\n وعدم غفران الشرك مقتضى الوعيد\n فلا امتناع فيه لذاته ليمتنع الترديد والتعليق بإن\n\nقاله البيضاوي\n وقال ابن جزي: فيه سؤالان: الأول: كيف قال: { وإن تغفر لهم } وهم كفار\n والكفار لا يغفر لهم؟ فالجواب: أن المعنى تسليم الأمر إلى الله\n وإنه إن عذب أو غفر فلا اعتراض عليه لأن الخلق عباده\n والمالك يفعل ما يشاء\n ولا يلزم من هذا وقوع المغفرة للكفار\n وإنما يقتضي جوازها في حكمة الله وعزته\n وفَرقٌ بين الجواز والوقوع\n وأما على قول من قال: إن هذا الخطاب وقع لعيسى عليه السلام حين رفعه الله إلى السماء فلا إشكال\n لأن المعنى: إن لم تغفر بهم التوبة\n وكانوا حينئذٍ أحياء\n وكل حيّ مُعرض للتوبة\n السؤال الثاني: ما مناسبة قوله: { العزيز الحكيم } لقوله: { وإن تغفر لهم } \n والأليق إن قال: فإنك أنت الغفور الرحيم؟ فالجواب: أنه لما قصد التسليم له والتعظيم\n كان قوله: { فإنك أنت العزيز الحكيم } أليق\n فإن الحكمة تقتضي التسليم\n والعزة تقتضي التعظيم\n فإن العزيز هو الذي يفعل ما يريد\n ولا يغلبه غيره\n ولا يمتنع عليه شيء أراده\n فاقتضى الكلام تفويض الأمر إلى الله في المغفرة لهم أو عدمها لأنه قادر على كلا الأمرين لعزته\n وأيهما فعل فهو جميل لحكمته\n وقال أبو جعفر بن الزبير: إنما لم يقل الغفور الرحيم لئلا يكون شفيعًا لهم بطلب المغفرة\n فاقتصر على التسليم والتفويض\n دون الطلب\n إذ لا نصيب في المغفرة للكفار\n انظر بقية كلامه\n قال التفتازاني: ذكر المغفرة\n يوُهم أن الفاصلة: { الغفور الرحيم } \n لكن يُعرف بعد التأمل أن الواجب هو العزيز الحكيم لأنه لا يغفر لمن يستحق العذاب إلا من ليس فوقه أحد يرد عليه حكمه\n وهو العزيز\n أي: الغالب\n ثم وجب أن يوصف بالحكمة على سبيل الاحتراس لئلا يتوهم أنه خارج عن الحكمة\n هـ\n قال الله تعالى: { هذا } أي: يوم القيامة { يوم ينفع الصادقين صدقهم } أي: هنا ينتفع الصادقون في الدنيا بصدقهم\n ويفتضح الكاذبون على الله بكذبهم\n والمراد بالصادقين أهل التوحيد\n الذين نزهوا الله تعالى عما لا يليق بجلاله وجماله\n فصدقوا فيما وصفوا به ربهم\n ثم ذكر ما وعدهم به\n فقال: { لهم جنات تجري من تحتها الأنهار خالدين فيها أبدًا رضي الله عنهم ورضوا عنه } حيث رضوا بأحكامه القهرية والتكليفية\n { ذلك الفوز العظيم لله ملك السماوات والأرض وما فيهن وهو على كل شيء قدير } \n وهذا تنبيه على تكذيب النصارى\n وفساد دعواهم في المسيح وأمه\n وإنما لم يقل: ومن فيهن\n تغليبًا لغير العقلاء\n وإنما غلبَ غير أولى العقل للإعلام بأنهم في غاية القصور عن معنى الربوبية\n وإهانة لهم وتنبيهًا على أنهم جنس واحد\n فمن يعقل منهم لقصور عقله ونظره كمن لا يعقل\n فيبعد استحقاقهم للألوهية التي تنبىء عن تمام الحكمة وإحاطة العلم\n\nوالله تعالى أعلم\n الإشارة: كل من صَدّر نفسه للشيخوخة من غير إذن\n وأشار إلى تعظيمه بلسان الحال أو المقال يَلحَقُهُ العتاب يوم القيامة فيقال له: أأنت قلت للناس عظموني من دون الله؟ فإن كان مقصوده بالأمر بالتعظيم الوصول إلى تعظيم الحق تعالى\n والأدب معه في الحضرة دون الوقوف مع الواسطة\n وبذل جهده في توصيل المريدين إلى هذا المقام\n يقول: سبحانك ما يكون لي أن أقول ما ليس لي بحق\n إلى تمام ما قال السيد عيسى عليه السلام\n فيقال له: { هذا يوم ينفع الصادقين صدقهم }\n وإن كان مقصوده بالتصدّر للتعظيم والآمر به\n حظ نفسه\n وفَرَح بتربية جاهه والإقبال عليه\n افتضح وأُهين بما افتضح به الكاذبون المدعون\n نسأل الله تعالى الحفظ والرعاية بمنِّه وكرمه\n وسيدنا محمد رسوله ونبيّه ـ صلى الله عليه وسلم\n وعلى آله وصحبه وسلم ـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:100",
      "similarity": 0.690653864795852
    },
    {
      "verse": "9:89",
      "similarity": 0.6745665140720727
    },
    {
      "verse": "48:5",
      "similarity": 0.6741335869001936
    },
    {
      "verse": "4:122",
      "similarity": 0.6243087336646608
    },
    {
      "verse": "85:11",
      "similarity": 0.5890034932800486
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/5:119.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/5:119.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:119.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}