{
  "chapter": "المائدة",
  "text": "لله ملك السموت والارض وما فيهن وهو على كل شىء قديرۢ",
  "translations": [
    {
      "translation": "The kingdom of the heavens and the earth and everything in them belongs to Allah. He has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs all that is in the heavens and the earth, and His the power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the dominion of the heavens and the earth and all that is in them and He has full power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the kingdom of the heavens and the earth and all that is between them and He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah only belongs the kingship of the heavens and the earth and all that is in them: and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the dominion of the heavens and the earth and all that is therein, and He is able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah's is the kingdom of the heavens and the earth and what is in them; and He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the kingdom of the heavens and of the earth, and all that is in them, and He is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Allah belongeth the Sovereignty of the heavens and the earth and whatsoever is therein, and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The kingdom of the heavens and the earth and everything in them belongs to God: He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah's is the dominion of the heavens and the earth and whatsoever Is therein, and over everything He is Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the kingdom of the heavens and the earth and whatever there is in them, and He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah doth belong the dominion of the heavens and the earth, and all that is therein, and it is He Who hath power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the dominion of the heavens and the earth and all that is therein, and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the Kingdom of the heavens and the earth and what is in them. He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belongs the sovereignty of the heavens and the earth and what lies in them, and He has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the dominion of the heavens and the earth and whatever is within them. And He is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:120] To God belongs the kingdom of the heavens and of the earth, the storehouses of rain, vegetation, sustenance and everything else, and all that is in them (wa-mā fīhinna: the use of mā, ‘that’, indicates the predominance of all those non-rational creations); and He has power over all things, including the rewarding of the truthful and the punishing of the liar — He is specifically addressing rational beings, for there is none among them with power over all things. [Consists of] 165 verses, all Meccan except for 20, 23, 91, 93, 114, 141, 151, 152, 153, which are Medinese and which were revealed after [sūrat] al-Hijr.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Unto Allah belongeth the Sovereignty of the heavens and the earth) unto Him belong the stores of the heavens and the earth: rain, lands, vegetation, fruits, etc., (and whatsoever is therein) of created beings and marvels, (and He is Able to do all things) creating the heavens and the earth, and bestowing reward and punishment'. And of the surah in which the Cattle is mentioned, which is Meccan and revealed in one bulk with the exception of five verses-three verses beginning from (Say: Come, I will recite unto you that which your Lord hath made a sacred duty for you...) to (This hath He ordained for you, that ye may ward off (evil).) and two verses beginning from (Who does greater wrong than he who invents a lie against Allah...) to (... Where are (now) those partners of your make believe?)-which are Medinan, and it consists of 126 verses, 3,050 words and 12,422 letters: Surah 6: The Cattle (al-An'am) And of the surah in which the Cattle is mentioned, which is Meccan and revealed in one bulk with the exception of five verses— three verses beginning from (Say: Come, I will recite unto you that which your Lord hath made a sacred duty for you...) to (This hath He ordained for you, that ye may ward off (evil).) and two verses beginning from (Who does greater wrong than he who invents a lie against Allah...) to (... Where are (now) those partners of your make believe?)— which are Medinan, and it consists of 126 verses, 3,050 words and 12,422 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { للَّهِ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } إظهاراً وتصرفاً واستقلالاً { وَمَا فِيهِنَّ } من المكونات\n فله التصرف فيها كيف يشاء حسب إرادته واختياره { وَهُوَ } بذاته { عَلَىٰ كُلِّ شَيْءٍ } من عموم مراداته ومقدوراته { قَدِيرٌ } [المائدة: 120] فله أن صول خلَّص عباده إلى فضاء فنائه بإفنائهم عن هوياتهم الباطلة\n وإبقائهم بهويتهم الحقيقية السارية\n الظاهرة في الأكوان\n\n\nخاتمة السورة\n\n\nعليك أيها المحمدي المتوجه لمرتبة الفناء المثمر للبقاء الأبدي شكران سعيك وأوصلك إلى غاية مبتغاك أن تجعل قرينك الرضا في جميع ما جرى عليك من القضاء\n إذ كل ما يجري في عالم الأكوان والفساد إنما هو على مراد الله\n ومقتضى مشيئته حسب تجلياته الجمالية والجلالية\n واللطيفة والقهرية\n والعارف إذا تحقق بمقام الرضا الذي هو نهاية مراتب العبودية فقد خلص عن الإضافات مطلقاً\n ومتى ارتفعت الإضافات لا يشوشه السراء والضراء\n ولا اللذة ولا الفناء\n إذ كل ذلك من لوازم الإمكان وأمارات البعد\n\nفعليك أن تصفي نفسك عن جميع الأمراض الباطنة من العُجب والرياء والرعونة والهوى\n وتلازم العزلة والإعراض عن أبناء الدنيا\n والالتجاء إليهم والمخالطة معهم وتقلل عن حوائجك وحظوظك سوى سدِّ جوعة وكنٍّ ولباسٍ كيف اتفق\n وعليك أن تروض نفسك في زاوية الخمول\n وركن القناعة\n ومنزل الفراغة\n\n\nوإياك أن تصاحب مع أهل الأهواء وتراجعهم\n سيما في الأمور التي تتعلق بالمعاش المستعار\n وكن في ورطة الدنيا كأنك غريب ليس لك ألف ومؤانسة مع من فيها وما فيها أو كعابر سبيل يروح فيها ويغدو بلا تمكن وقرار\n\n\nوبالجملة: عدّ نفسك من أصحاب القبور\n وافعل مثل ما تشاهد منهم بالنسبة إلى الدنيا\n بل موتك الأرادي لا بد أن يكون أعرق في قطع التعلق\n وترك المألوف من الموت الصوري\n لأن أكثر الأموات بالموت الصوري يخرجون من الدنيا متحسرين بحسرة عظيمة\n والعارف المتحقق بمرتبة الموت الإرادي له مسرة ولذة\n بحيث لو عاد على ما عليه لتغمم\n بل هلك خوفاً\n فذلك أن تشمر ذيلك عنها وعن لذاتها بالمرة وتداوم الاستفادة الاسترشاد من كتاب الله وأحاديث رسوله صلى الله عليه وسلم\n وملتقطات المشايخ العظام التي ساتنبطوها منها بسعي بليغ - شكر الله مساعيهم - وتصرف عنان عزمك عمَّا سواها من الأباطيل الزائفة\n والمنسوبة إلى أصحاب الحجج والاستدلال\n الضالين بتغريرات عقولهم القاصرة عن منهج الحق ومحجة اليقين\n\n\nجعلنا الله ممَّن أيد من عنده فتأيد\n وأطلق عنان عزمه نحو الحق ولم يتقيد\n بمنِّه وجوده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:189",
      "similarity": 0.9759181976879145
    },
    {
      "verse": "57:2",
      "similarity": 0.7736003467953783
    },
    {
      "verse": "5:40",
      "similarity": 0.7490401713176936
    },
    {
      "verse": "64:1",
      "similarity": 0.6707207072628887
    },
    {
      "verse": "85:9",
      "similarity": 0.6557725099034064
    }
  ]
}