{
  "chapter": "المائدة",
  "text": "ولقد اخذ الله ميثق بنى اسرءيل وبعثنا منهم اثنى عشر نقيبا وقال الله انى معكم لئن اقمتم الصلوة وءاتيتم الزكوة وءامنتم برسلى وعزرتموهم واقرضتم الله قرضا حسنا لاكفرن عنكم سيـاتكم ولادخلنكم جنت تجرى من تحتها الانهر فمن كفر بعد ذلك منكم فقد ضل سواء السبيل",
  "translations": [
    {
      "translation": "Allah made a covenant with the tribe of Israel and We raised up twelve leaders from among them. Allah said, 'I am with you. If you establish salat and pay zakat, and have iman in My Messengers and respect and support them, and make a generous loan to Allah, I will erase your wrong actions from you and admit you into Gardens with rivers flowing under them. Any of you who are kafir after that have gone astray from the right way.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God covenanted the people of Israel and raised twelve leaders among them, and said: \"I shall verily be with you. If you fulfil your devotional obligations, pay the zakat and believe in My apostles and support them, and give a goodly loan to God, I shall certainly absolve you of your evil, and admit you to gardens with streams of running water. But whosoever among you denies after this, will have wandered away from the right path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah took a covenant with the Children of Israel, and We raised up from them twelve of their leaders, and Allah said: 'Behold, I am with you; if you establish Prayer and pay Zakah and believe in My Prophets and help them, and lend Allah a good loan, I will certainly efface from you your evil deeds, and will surely cause you to enter the Gardens beneath which rivers flow. Whosoever of you disbelieves thereafter has indeed gone astray from the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God certainly made a solemn covenant with the children of Israel and raised among them twelve elders. God said to them, \"I am with you if you will be steadfast in your prayers, pay (zakat) religious tax, believe in My Messengers, support them with reverence, and give a generous loan for the cause of God.\" We shall expiate your bad deeds and admit you to the gardens wherein streams flow. Whichever of you turns to disbelief after this has certainly gone astray (from the right path).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Undoubtedly Allah made a covenant with the Descendants of Israel, and We appointed twelve chiefs among them; and Allah said, “Indeed I am with you; surely, if you establish the prayer and pay the charity, and believe in My Noble Messengers and respect* them, and lend an excellent loan to Allah, I will surely forgive your sins, and I will surely admit you into Gardens beneath which rivers flow; then after this, if any of you disbelieves, he has certainly gone astray from the Straight Path.\" (To honour the Holy Prophet – peace and blessings be upon him – is part of faith. To disrespect him is blasphemy.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah took the covenant from the Children of Israel (Jews), and We appointed twelve leaders among them. And Allah said: \"I am with you if you perform the Salah and give the Zakah and believe in My Messengers; honor and assist them, and lend to Allah a good loan, verily, I will remit your sins and admit you to Gardens under which rivers flow (in Paradise). But if any of you after this, disbelieved, he has indeed gone astray from the straight way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly Allah made a covenant with the children of Israel, and We raised up among them twelve chieftains; and Allah said: Surely I am with you; if you keep up prayer and pay the poor-rate and believe in My apostles and assist them and offer to Allah a goodly gift, I will most certainly cover your evil deeds, and I will most certainly cause you to enter into gardens beneath which rivers flow, but whoever disbelieves from among you after that, he indeed shall lose the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God took compact with the Children of Israel; and We raised up from among them twelve chieftains. And God said, 'I am with you. Surely, if you perform the prayer, and pay the alms, and believe in My Messengers and succour them, and lend to God a good loan, I will acquit you of your evil deeds, and I will admit you to gardens underneath which rivers flow. So whosoever of you thereafter disbelieves, surely he has gone astray from the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah made a covenant of old with the Children of Israel and We raised among them twelve chieftains, and Allah said: Lo! I am with you. If ye establish worship and pay the poor-due, and believe in My messengers and support them, and lend unto Allah a kindly loan, surely I shall remit your sins, and surely I shall bring you into Gardens underneath which rivers flow. Whoso among you disbelieveth after this will go astray from a plain road.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God made a covenant with the Children of Israel; and raised among them twelve leaders. God said, \"Surely, I am with you. If you attend to your prayers and pay the alms and believe in My messengers and support them, and give a generous loan to God, I will certainly forgive you your sins and admit you into Gardens through which rivers flow. Whoever among you denies the truth after this shall go astray from the straight path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly Allah took a bond from the Children of Isra'il, and We raised from amongst them twelve wardens. And Allah said: verily I am with you, if ye establish prayer and give the poor-rate and believe in My apostles and support them and lend unto Allah a goodly loan, I shall surely expiate for you your misdeeds and surely shall make you enter the Gardens whereunder rivers flow; then whosoever of you shall disbelieve thereafter, he hath surely strayed from the level way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly Allah took a pledge from the Children of Israel, and We raised among them twelve chiefs. And Allah said, ‘I am with you! Surely, if you maintain the prayer and give the zakat and have faith in My apostles and support them and lend Allah a good loan, I will surely absolve you of your misdeeds, and I will surely admit you into gardens with streams running in them. But whoever of you disbelieves after that has certainly strayed from the right way.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah did aforetime take a covenant from the Children of Israel, and we appointed twelve captains among them. And Allah said: \"I am with you: if ye (but) establish regular prayers, practise regular charity, believe in my messengers, honour and assist them, and loan to Allah a beautiful loan, verily I will wipe out from you your evils, and admit you to gardens with rivers flowing beneath; but if any of you, after this, resisteth faith, he hath truly wandered from the path or rectitude.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah took the covenant from the Children of Israel (Jews), and We appointed twelve leaders among them. And Allah said: \"I am with you if you perform As-Salat (Iqamat-as-Salat) and give Zakat and believe in My Messengers; honour and assist them, and lend to Allah a good loan. Verily, I will remit your sins and admit you to Gardens under which rivers flow (in Paradise). But if any of you after this, disbelieved, he has indeed gone astray from the Straight Path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah made a covenant with the Children of Israel and raised among them twelve chieftains. He said: 'I shall be with you and if you establish the prayers and pay the obligatory charity; if you believe in My Messengers and assist them and give Allah a generous loan, I shall forgive you your sins and admit you to Gardens underneath which rivers flow. Whosoever amongst you disbelieves after that, he indeed has strayed from the Straight Path'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God received a pledge from the Children of Israel, and We raised among them twelve chiefs. God said, “I am with you; if you perform the prayer, and pay the alms, and believe in My messengers and support them, and lend God a loan of righteousness; I will remit your sins, and admit you into Gardens beneath which rivers flow. But whoever among you disbelieves afterwards has strayed from the right way.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah had already taken a covenant from the Children of Israel, and We delegated from among them twelve leaders. And Allah said, \"I am with you. If you establish prayer and give zakah and believe in My messengers and support them and loan Allah a goodly loan, I will surely remove from you your misdeeds and admit you to gardens beneath which rivers flow. But whoever of you disbelieves after that has certainly strayed from the soundness of the way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:12] God had made a covenant with the Children of Israel, for what will be mentioned shortly, and We raised up (there is a shift of address away from the third [to the first] person) from among them twelve leaders, from each tribe one leader, to be responsible for his people’s fulfilment of the covenant, as a way of binding them [to it]. And God said, to them: ‘I am with you, helping and assisting. Surely if (la-in, the lām is for oaths) you establish the prayer, and pay the alms, and believe in My messengers and succour them, help them, and lend to God a goodly loan, by expending in His way, I will absolve you of your evil deeds, and I will admit you to gardens underneath which rivers flow. So whoever of you disbelieves after that, covenant, surely he has strayed from the right way’, he has erred from the path to Paradise (al-sawā’ originally means ‘the middle way’). And they broke the covenant.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah made a covenant of old with the Children of Israel) the acknowledgement of the Children of Israel in the Torah of Muhammad, that they shall worship none except Allah and that they shall not ascribe partners to Him (and We raised among them twelve chieftains) 12 messengers; and it is said: 12 kings, a king to each tribe: (and Allah said) to these kings: (Lo! I am with you) I will help you. (If you establish worship) if you establish the prayer which has been made obligatory upon you (and pay the poor-due) from your wealth, (and believe in) acknowledge and accept (My messengers) who are sent to you (and support them) and assist them with the sword against the enemy, (and lend unto Allah a kindly loan) genuinely from your heart, (surely I shall remit your sins) other than the enormities, (and surely I shall bring you into Gardens beneath which) beneath its trees and habitations (rivers) rivers of water, milk, wine and honey (flow. Whoso among you disbelieveth after this) after accepting and acknowledging the covenant (will go astray from a plain road) such a person has erred from the road of guidance. Nonetheless, they disbelieved except five of them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَبَعَثْنَا مِنهُمُ ٱثْنَيْ عَشَرَ نَقِيباً } معناهُ اثنَا عَشَر أمِيناً\n\n\n\n\nوقوله تعالى: { وَآمَنتُمْ بِرُسُلِي وَعَزَّرْتُمُوهُمْ } معناهُ أَثَنيتُم عَلَيهم والتَّعْزِيرُ: أَيضاً الأَدبُ\n\n\n\n\nوقوله تعالى: { سَوَآءَ ٱلسَّبِيلِ } معناهُ وسَطُ الطَّريقِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"We will raise from among them twelve leaders\" - this means that there will be twelve Imams.\n\nAnd His saying, {And you believed in My messengers and you honored them} means that you testified to their truth and that you revered them. Also included in this is good manners.\n\n\nAnd His saying, \"There is no difference between the two ways,\" means the middle of the road.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ميثاق بني إسرائيل } هو العهد المذكور والنقباء الإثنا عشر هم الحواس الخمس الظاهرة والخمس الباطنة والقوّة العاقلة النظرية والعاقلة العلمية { وقال الله إني معكم } أي: في العقد اللاحق أوفقكم وأعينكم لئن قمتم بحقوق التزكية والتخلية من الإعراض عن السعادات البدنية بالعبادة وترك السعادات الخارجية بالزهد\n وإيثار الثالثة التي هي الإيمان برسل العقل والإلهامات والأفكار الصائبة والخواطر الصادقة من الروح والقلب\n وإمداد الملكوت وتعزيرهم أي: تعظيمهم بتسليطهم على شياطين الوهم وتقويتهم ومنعهم وساوسها وإلقاء الوهميات والخياليات والخواطر النفسانية { وأقرضتم الله قرضاً حسناً } بالبراءة من الحول والقوة والعلم والقدرة إلى الله بالجملة من الأفعال والصفات كلها ثم من الذات بالمحو والفناء وإسلامها إلى الله { لأكفرنّ عنكم سيئاتكم } أي: وجودات هذه الثلاث التي هي حجبكم وموانعكم عنكم { ولأدخلنكم جنّات } من أفعالي وصفاتي وذاتي { تجري من تحتها الأنهار } علوم التوكل والرضا والتسليم والتوحيد\n وبالجملة علوم تجليات الأفعال والصفات والذات\n فمن احتجب بعد ذلك العهد وبعث النقباء منكم { فقد ضلّ } السبيل المستقيم بالحقيقة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "ثم لمَّا أراد سبحانه تقرير المؤمنين على الإيمان، وتثبيت قدمهم على جادة التوحيد والفرقان، استشهد عليهم تزلزل بني إسرائيل، وعدم رسوخ قدمهم في الإيمان والإطاعة مع أخذ المواثيق منهم على لسان نبيهم - صلوات الرحمن على نبينا وعليه - فقال: { وَلَقَدْ أَخَذَ ٱللَّهُ } بلسان موسى كليم الله { مِيثَاقَ بَنِيۤ إِسْرَآئِيلَ } أي: العهد الوثيق منهم بعدما خلصوا من فرعون، وورثوا منه ما ورثوا، واستقروا على ملك مصر { وَ } ذلكا أنَّا { بَعَثْنَا مِنهُمُ ٱثْنَيْ عَشَرَ نَقِيباً } من نجبائهم ونخبائهم، من كل فرقة نقيب مسلم، بينهم رئاسةً وجاهاً، وبالجملة: كل من النقباء يولي أمر فرقته عند نبينا موسى عليه السلام.\n\nفعهدوا أن يسيروا مع موسى إلى \" أريحا \" بالشام حين أوحى إليه، فساروا إلى أن وصلوا، وكان فيها الجبابرة الكنعانيون، فلمَّا رأوا العدو ذوي قوة ، وأولي بأس شديد هابوا منه، وترهبوا، فرجعوا إلى قومهم، فأبخروا لهم ما ظهر عليهم إلا قليلاً منهم فنقضوا العهد والميثاق.\n\n{ وَ } مع ذلك { قَالَ ٱللَّهُ } لهم حين أمرهم: { إِنِّي مَعَكُمْ } لينصركم على عدوكم وأخرجهم منها: فوعزتي وجلالي { لَئِنْ أَقَمْتُمُ ٱلصَّلاَةَ } على الوجه الذي وصل إليكم من رسولكم { وَآتَيْتُمُ ٱلزَّكَاةَ } على الوجه المشروع { وَآمَنتُمْ بِرُسُلِي } بلا تفريق بينهم { وَعَزَّرْتُمُوهُمْ } أي: نصرتموهم في إعلاء كلمة الحق، وإشاعة دينه { وَأَقْرَضْتُمُ ٱللَّهَ } ما في أيديكم من زخرفة الدنيا { قَرْضاً } إنفاقاً للفقراء والمساكين { حَسَناً } بلا شوب المنة والأذى { لأُكَفِّرَنَّ عَنْكُمْ } أي: لأمحوَّ عن ديوان عملكم { سَيِّئَاتِكُمْ } بأسرها { وَلأُدْخِلَنَّكُمْ } جزاءً لإخلاصكم { جَنَّاتٍ } متنزهاتٍ ثلاث: هي العلم والعين والحق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } مملوء بمياه الحقائق والمعارف { فَمَن كَفَرَ بَعْدَ ذٰلِكَ مِنْكُمْ } أي: بعدما سمع التذكير والعظة من الله { فَقَدْ ضَلَّ } وفقد { سَوَآءَ ٱلسَّبِيلِ } [المائدة: 12] لا دواء لدائه، ولا رجاء لإنجائه.\n\nاهدنا بفظلك إلى سواء السبيل.\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: النقيب: هو كبير القوم والمقدَّم عليهم\n ينقب عن أحوالهم ويفتش عليها\n والخائنة: إما مصدر كالعاقبة واللاغية\n أو اسم فاعل\n والتاء للمبالغة\n مثل: رواية ونسَّابة وعلاَّمة\n يقول الحقّ جلّ جلاله: { ولقد أخذ الله ميثاق بني إسرائيل } على أن يجاهدوا مع موسى ـ عليه السلام ـ وينصروه\n ويلتزموا أحكام التوراة\n { وبعثنا منهم اثني عشر نقيبًا } اخترناهم وقدمناهم\n على كل سبط نقيبًا ينقب عن أحوال قومه\n ويقوم بأمرهم\n ويتكفل بهم فيما أمروا به\n رُوِي أن بني إسرائيل لمَّا خرجوا عن فرعون\n واستقروا بأوائل الشام\n أمرهم الله تعالى بالمسير إلى بيت المقدس\n وهي في الأرض المقدسة\n وكان يسكنها الجبابرة الكنعانيون\n وقال: إني كتبتها لكم دارًا وقرارًا\n فأخرجوا إليها\n وجاهدوا مَن فيها من العدو\n فإني ناصركم\n وقال لموسى عليه السلام: خذ من قومك اثني عشر نقيبًا\n من كل سبط نقيبًا\n يكون أمينًا وكفيلاً على قومه بالوفاء على ما أمروا به\n فاختار موسى النقباء\n فسار بهم حتى إذا دنوا من أرض كنعان\n وهي أريحا\n بعث هؤلاء النقباء يتجسسون الأخبار\n ونهاهم أن يحدثوا قومهم بما يرون\n فلما قربوا من الأرض المقدسة رأوا أجرامًا عظامًا وبأسًا شديدًا\n فهابوا ورجعوا وحدثوا قومهم\n إلا كالب بن يوقنا ـ من سبط يهوذا ـ ويوشع بن نون ـ من سبط إفراثيم بن يوسف ـ ثم { قالوا يا موسى إن فيها قومًا جبارين } إلى آخر ما يأتي من قصتهم\n وأما ما ذكره الثعلبي هنا\n وغيره\n من قصة عوج بن عناق\n فقال القسطلاني: هي باطلة من وضع الزنادقة\n فلا يجوز ذكرها في تفسير كتاب الله الصادق المصدوق\n { وقال الله } لبني إسرائيل: { إني معكم } بالنصر والمعونة { لئن أقمتم الصلاة وأتيتم الزكاة وآمنتم برُسلي } التي أرسلتُ بعد موسى { وعزرتموهم } أي: نصرتموهم وقويتموهم\n { وأقرضتم الله قرضًا حسنًا } بالإنفاق في سُبُل الخير\n { لأكفّرنّ عنكم سيئاتكم } أي: أستر عنكم ذنوبكم فلا نفضحكم بها\n { ولأدخلنكم جنات تجري من تحتها الأنهار فمن كفر بعد ذلك } العهد المؤكد\n المعلَق عليه هذا الوعد العظيم\n { فقد ضلّ سواء السبيل } أي: تلف عن وسط الطريق\n تلفًا لا شبهة فيه ولا عذر معه\n بخلاف من كفر قبل أخذ العهد فيمكن أن تكون له شبهة\n ويتوهم له معذرة\n ثم إن بني إسرائيل نقضوا المواثيق التي أُخذت عليهم\n فكفروا وقتلوا الأنبياء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:97",
      "similarity": 0.4464418252234522
    },
    {
      "verse": "48:9",
      "similarity": 0.3804544954305282
    },
    {
      "verse": "50:36",
      "similarity": 0.34033747904462947
    },
    {
      "verse": "7:157",
      "similarity": 0.2913234016406159
    },
    {
      "verse": "57:11",
      "similarity": 0.22576753599758012
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/5:12.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/5:12.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/5:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}