{
  "chapter": "المائدة",
  "text": "فبما نقضهم ميثقهم لعنهم وجعلنا قلوبهم قسية يحرفون الكلم عن مواضعه ونسوا۟ حظا مما ذكروا۟ به ولا تزال تطلع على خائنة منهم الا قليلا منهم فاعف عنهم واصفح ان الله يحب المحسنين",
  "translations": [
    {
      "translation": "But because of their breaking of their covenant, We have cursed them and made their hearts hard. They distort the true meaning of words and have forgotten a good portion of what they were reminded of. You will never cease to come upon some act of treachery on their part, except for a few of them. Yet pardon them, and overlook. Allah loves good-doers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they dishonoured their pledge We condemned them, and hardened their hearts. So they distort the words of the Scripture out of context, and have forgotten some of what they were warned against. You will always hear of treachery on their part except that of a few. But forbear and forgive them, for God loves those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, for their breach of the covenant We cast them away from Our mercy and caused their hearts to harden. (And now they are in such a state that) they pervert the words from their context and thus distort their meaning, and have forgotten a good portion of the teaching they were imparted, and regarding all except a few of them you continue to learn that they committed acts of treachery. Pardon them, then, and overlook their deeds. Surely Allah loves those who do good deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For their disregard of their solemn covenant with God, We condemned the Israelites and made their hearts hard as stone. Now they displace the words of God and have forgotten their share of the guidance that they had received. Still you receive news of the treachery of all but a few of them. Forgive and ignore them. God loves the righteous ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We cursed them because of them constantly breaking their covenant, and hardened their hearts; they shift the Words of Allah from their places, and have forgotten a large portion of the advices that were given to them; and you will constantly learn of deceits from them, except a few; so forgive them and excuse them; indeed Allah loves the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, because of their breach of their covenant, We cursed them and made their hearts grow hard. They changed the words from their (right) places and have abandoned a good part of the Message that was sent to them. And you will not cease to discover deceit in them, except a few of them. But forgive them and overlook (their misdeeds). Verily, Allah loves the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But on account of their breaking their covenant We cursed them and made their hearts hard; they altered the words from their places and they neglected a portion of what they were reminded of; and you shall always discover treachery in them excepting a few of them; so pardon them and turn away; surely Allah loves those who do good (to others).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So for their breaking their compact We cursed them and made their hearts hard, they perverting words from their meanings; and they have forgotten a portion of that they were reminded of; and thou wilt never cease to light upon some act of treachery on their part, except a few of them. Yet pardon them, and forgive; surely God loves the good-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And because of their breaking their covenant, We have cursed them and made hard their hearts. They change words from their context and forget a part of that whereof they were admonished. Thou wilt not cease to discover treachery from all save a few of them. But bear with them and pardon them. Lo! Allah loveth the kindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Since they broke their solemn pledge, We laid on them Our curse and hardened their hearts. They distorted the meaning of the revealed words, taking them out of their context, and forgot much of what they were enjoined. You will constantly discover treachery on their part, except for a few of them. But pardon them, and bear with them; truly, God loves the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore for their breach of their bond We accursed them and We made their hearts hard. They pervert the words from the meanings thereof and have abandoned a good portion of that wherewith they were admonished. And thou wilt not cease to light upon defrauding on their part, save a few of them; yet pardon thou them and overlook them, verily Allah loveth the well-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, because of their breaking their covenant We cursed them and made their hearts hard: they pervert words from their meanings, and have forgotten a part of what they were reminded. You will not cease to learn of some of their treachery, excepting a few of them. Yet excuse them and forbear. Indeed Allah loves the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But because of their breach of their covenant, We cursed them, and made their hearts grow hard; they change the words from their (right) places and forget a good part of the message that was sent them, nor wilt thou cease to find them- barring a few - ever bent on (new) deceits: but forgive them, and overlook (their misdeeds): for Allah loveth those who are kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So because of their breach of their covenant, We cursed them, and made their hearts grow hard. They change the words from their (right) places and have abandoned a good part of the Message that was sent to them. And you will not cease to discover deceit in them, except a few of them. But forgive them, and overlook (their misdeeds). Verily, Allah loves Al-Muhsinun (good-doers - see V. 2:112).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But because they broke their covenant, We cursed them and hardened their hearts. They changed the Words from their places and have forgotten a portion of what they were reminded. Except for a few, you will always find treachery from them, yet pardon them, and forgive; indeed Allah loves the gooddoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of their breaking their pledge, We cursed them, and made their hearts hard. They twist the words out of their context, and they disregarded some of what they were reminded of. You will always witness deceit from them, except for a few of them. But pardon them, and overlook. God loves the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So for their breaking of the covenant We cursed them and made their hearts hard. They distort words from their [proper] usages and have forgotten a portion of that of which they were reminded. And you will still observe deceit among them, except a few of them. But pardon them and overlook [their misdeeds]. Indeed, Allah loves the doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:13] God says: So because (bi-mā, the mā is extra) of their breaking their covenant, We cursed them, We removed them from Our mercy, and made their hearts hard, unyielding to the acceptance of faith; they pervert words, pertaining to the descriptions of Muhammad (s) in the Torah and other things, from their contexts, those in which God has placed them, in other words, they substitute them; and they have forgotten, they have abandoned, a portion, a part, of what they were reminded of, [of what] they were enjoined to in the Torah, in the way of following Muhammad (s); and you — addressing the Prophet (s) now — will never cease to discover some treachery on their part, in the way of breaking a covenant or some other matter, except for a few of them, who have submitted themselves [to Islam]. Yet pardon them, and forgive; surely God loves the virtuous: this was abrogated by the ‘sword’ verse [Q. 9:5].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then explained the punishment of those who had disbelieved, saying: (And because of their) i.e. the kings (breaking their covenant, We have cursed them) We punished them through imposing the capitation tax upon them (and made hard) and lightless (their hearts. They change words from their context) they change the traits and description of Muhammad (pbuh) and the legal ruling on stoning [married people who fornicate] after this was exposited upon in the Torah (and forget a part) and leave part (of that whereof they were admonished) they were commanded with in the Torah concerning their following of Muhammad (pbuh) and manifesting his traits and description to others. Allah then showed their betrayal of the Prophet (pbuh) saying: (Thou wilt not) Muhammad (cease to discover treachery) and contravention (from all) i.e. the Banu Qurayzah (save a few of them) 'Abdullah Ibn Salam and his followers. (But bear with them) and punish them not (and pardon them) and leave them. (Lo! Allah loveth the kindly) towards others.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُحَرِّفُونَ ٱلْكَلِمَ } معناهُ يُزِيلُونَهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَبِمَا نَقْضِهِم مِّيثَاقَهُمْ } وبعدم وفائهم للعهود الوثيقة { لَعنَّاهُمْ } طردناهم عن فضاء التوحيد { وَجَعَلْنَا قُلُوبَهُمْ قَاسِيَةً } مظلمة بظلمة الإمكان إلى حيث { يُحَرِّفُونَ ٱلْكَلِمَ } المثبتة في كتاب الله؛ لإعلاء كلمة التوحيد { عَن مَّوَاضِعِهِ } التي وضعها الحق { وَنَسُواْ حَظًّا } نصيباً { مِّمَّا ذُكِرُواْ بِهِ } أي: بالتوراة، ووعظوا عنه، وأفادوا منه { وَ } صاروا من غاية القساوة والنيسان بحيث { لاَ تَزَالُ تَطَّلِعُ } دائماً مستمراً { عَلَىٰ خَآئِنَةٍ مِّنْهُمْ } تبالغ في الخيانة { إِلاَّ قَلِيلاً مِّنْهُمُ } وهم الذين آمنوا بكم، وأنصفوا على ما في التوراة وأظهروها { فَٱعْفُ عَنْهُمْ } ولم يحرفوها زماناً { وَٱصْفَحْ } وانصرف عن انتقامهم إلى الإحسان معهم { إِنَّ ٱللَّهَ } القادر على الانتقام { يُحِبُّ ٱلْمُحْسِنِينَ } [المائدة: 13] المجاوزين عن الانتقام بعد الاقتدار عليهز\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم إن بني إسرائيل نقضوا المواثيق التي أُخذت عليهم، فكفروا وقتلوا الأنبياء، قال تعالى: { فبما نقضهم ميثاقهم لعنّاهم } أي: طردناهم وأبعدناهم، أو مسخناهم، { وجعلنا قلوبهم قاسية } أي: يابسة صلبة لا ينفع فيها الوعظ والتذكير، أو رديَّة مغشوشة بمرض الذنوب والكفر\n ثم بيَّن نتيجة قسوة قلوبهم فقال: { يُحرفون الكلم عن مواضعه } لفظًا أو تأويلاً\n ولا قسوة أعظم من الجرأة على تغيير كتاب الله وتحريفه، { ونسوا حظًا مما ذُكروا به } أي: تركوا نصيبًا واجبًا مما ذُكروا به من التوراة، فلو عملوا بما ذكَّرهم الله في التوراة ما نقضوا العهود وحرّفوا كلام الله من بعد ما علموه، لكن رَين الذنوب والأنهماك في المعاصي، غطت قلوبهم فقست ويبست، { ولا تزال } يا محمد { تطلع على خائنة } أي: خيانة { منهم } أو على طائفة خائنة منهم، لأن الخيانة والغدر من عادتهم وعادة أسلافهم، فلا تزال ترى ذلك منهم { إلا قليلاً منهم } لم يخونوا، وهم الذين أسلموا منهم، { فاعف عنهم واصفح } حتى يأتيك أمر الله فيهم، أو إن تابوا وآمنوا، أو إن عاهدوا والتزموا الجزية، { إنَّ الله يحبّ المحسنين } إلى عباده كيفما كانوا\n\n\nومن الإحسان إليهم: جبرهم على الإيمان بالسيف وسوقهم إلى الجنة بسلاسل الامتحان\n الإشارة: قد أخذ الله على هذه الأمة أن يلتزموا أحكام القرآن، ويحافظوا على مراسم الإسلام والإيمان ويجاهدوا نفوسهم في تحصيل مقام الإحسان، وبَعث من يقوم ببيان شرائع الإسلام والإيمان، ومن يعرف الطريق إلى مقام الإحسان، وقال الله لهم: { إني معكم } بالنصر والتأييد، لئن أقمتم شرائع الإسلام، وحققتم قواعد الإيمان وعظمتم من يعرفكم بطريق الإحسان، لأغطين مساوئكم، ولأمحقن دعاويكم، فأوصلكم بما منى إليكم من الكرم والجود، ولأدخلنكم جنة المعارف تجري من تحتها أنهار العلوم وأنواع الحِكَم، فمن لم يقم بهذا، أو جحده فقد ضل عن طريق الرشاد، ومن نقض عهد الشيوخ المعرفين بمقام الإحسان، فقد طرد وأبعد غاية الإبعاد، وقسا قلبه، بعد اللين\n وقد ذكرنا في تفسير الفاتحه الكبير معنى النقباء والنجباء وسائر مراتب الأولياء، وبالله التوفيق، وهو الهادي إلى سواء الطريق\n ولما ذكر نقض اليهود ذكر نقض النصارى، فقال: { وَمِنَ ٱلَّذِينَ قَالُواْ إِنَّا نَصَارَىٰ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:41",
      "similarity": 0.25002890729338295
    },
    {
      "verse": "24:22",
      "similarity": 0.2424436609278553
    },
    {
      "verse": "2:75",
      "similarity": 0.23862313087408835
    },
    {
      "verse": "64:14",
      "similarity": 0.2375885830715628
    },
    {
      "verse": "22:53",
      "similarity": 0.23463735215824033
    }
  ]
}