{
  "chapter": "المائدة",
  "text": "ومن الذين قالوا۟ انا نصرى اخذنا ميثقهم فنسوا۟ حظا مما ذكروا۟ به فاغرينا بينهم العداوة والبغضاء الى يوم القيمة وسوف ينبئهم الله بما كانوا۟ يصنعون",
  "translations": [
    {
      "translation": "We also made a covenant with those who say, 'We are Christians,' and they too forgot a good portion of what they were reminded of. So We stirred up enmity and hatred between them until the Day of Rising when Allah will inform them about what they did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had taken the pledge of those also who call themselves Christians. But they too forgot to take advantage of the warning they were given. So We have caused enmity and hatred among them to last till the Day of Resurrection, when God will inform them of what they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We also took a covenant from those who said: 'We are Christians'; but they forgot a good portion of the teaching they had been imparted with. Wherefore We aroused enmity and spite between them till the Day of Resurrection, and ultimately Allah will tell them what they had contrived.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had made a solemn covenant with those who call themselves Christians, but they forgot their share of the guidance that was sent to them. We have induced hatred and animosity among them which will remain with them until the Day of Judgment when God will tell them about what they had done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made a covenant with those who proclaimed, “We are Christians” – they then forgot a large portion of the advices given to them; We have therefore instilled enmity and hatred between them till the Day of Resurrection; and Allah will soon inform them of what they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from those who call themselves Christians, We took their covenant, but they have abandoned a good part of the Message that was sent to them. So We planted amongst them enmity and hatred till the Day of Resurrection; and Allah will inform them of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And with those who say, We are Christians, We made a covenant, but they neglected a portion of what they were reminded of, therefore We excited among them enmity and hatred to the day of resurrection; and Allah will inform them of what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And with those who say 'We are Christians' We took compact; and they have forgotten a portion of that they were reminded of. So We have stirred up among them enmity and hatred, till the Day of Resurrection; and God will assuredly tell them of the things they wrought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And with those who say: \"Lo! we are Christians,\" We made a covenant, but they forgot a part of that whereof they were admonished. Therefor We have stirred up enmity and hatred among them till the Day of Resurrection, when Allah will inform them of their handiwork.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We also made a covenant with those who say, \"We are Christians.\" But they too have forgotten much of what they were enjoined. So, We have put enmity and hatred between them till the Day of Judgement; and soon God will declare to them what they have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them who say: verily we are Nazarenes, We took a bond from them, but they have abandoned a good portion of that wherewith they were admonished. Wherefore We have occasioned enmity and hatred amongst them till the Day of Judgement, and presently Allah shall declare unto them that which they have been performing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also from those who say, ‘We are Christians,’ We took their pledge; but they forgot a part of what they were reminded. So We stirred up enmity and hatred among them until the Day of Resurrection, and soon Allah will inform them concerning what they had been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From those, too, who call themselves Christians, We did take a covenant, but they forgot a good part of the message that was sent them: so we estranged them, with enmity and hatred between the one and the other, to the day of judgment. And soon will Allah show them what it is they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from those who call themselves Christians, We took their covenant, but they have abandoned a good part of the Message that was sent to them. So We planted amongst them enmity and hatred till the Day of Resurrection (when they discarded Allah's Book, disobeyed Allah's Messengers and His Orders and transgressed beyond bounds in Allah's disobedience), and Allah will inform them of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With those who said they were Nazarenes, We made a Covenant, but they have forgotten much of what they were reminded. Therefore, We stirred among them enmity and hatred till the Day of Resurrection when Allah will inform them of all that they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from those who say, “We are Christians,” We received their pledge, but they neglected some of what they were reminded of. So We provoked enmity and hatred among them until the Day of Resurrection; God will then inform them of what they used to craft.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from those who say, \"We are Christians\" We took their covenant; but they forgot a portion of that of which they were reminded. So We caused among them animosity and hatred until the Day of Resurrection. And Allah is going to inform them about what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:14] And with those who say ‘We are Christians’ (this is semantically connected to [what follows]) We made a covenant, just as We did with the Children of Israel, the Jews, and they have forgotten a portion of that they were reminded of, in the Gospel, pertaining to faith and other matters, and they [too] broke the covenant.   So We have stirred up, We have caused, among them enmity and hatred until the Day of Resurrection, on account of their schisms and differing whims, each sect charging the other with unbelief; and God will assuredly tell them, in the Hereafter, of what they wrought, and requite them for this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nذكر بعد ميثاق اليهود ميثاق النصارى . وجاءت الجملة على سبه اشتغال العامل عن المعمول بضميره حيث قُدّم متعلِّق { أخَذْنا ميثاقهم } وفيه اسْم ظاهر ، وجيء بضميره مع العامل للنكتة الداعية للاشتغال من تقرير المتعلِّق وتثبيته في الذهن إذ يتعلّق الحكم باسمه الظاهر وبضميره ، فالتقدير : وأخذنا ، من الذين قالوا : إنّا نصارى ، ميثاقهم ، وليس تقديم المجرور بالحرف لقصد الحصر . وقيل : ضمير { ميثاقهم } عائد إلى اليهود ، والإضافة على معنى التشبيه ، أي من النصارى أخذنا ميثاقَ اليهود ، أي مثلَه ، فهو تشبيه بليغ حذفت الأداة فانتصب المشبّه به . وهذا بعيد ، لأنّ ميثاق اليهود لم يفصّل في الآية السابقة حتّى يشبّه به ميثاق النّصارى .وعبّر عن النصارى ب { الذين قالوا إنّا نصارى } هُنا وفي قوله الآتي : { ولتجدنّ أقبربهم مودّة للّذين آمنوا الذين قالوا إنّا نصارى } \\[ المائدة : 82 \\] تسجيلاً عليهم بأنّ اسم دينهم مشير إلى أصل من أصوله ، وهو أن يكون أتباعه أنصاراً لِما يأمر به الله ، { كما قال عيسى ابن مريم للحواريين من أنصاريَ إلى الله قال الحواريّون نحن أنصار الله } \\[ الصف : 14 \\] . ومن جملة ذلك أن ينصروا القائم بالدّين بعْد عيسى من أتباعه ، مثل بُولس وبَطرس وغيرهما من دعاة الهدى؛ وأعظم من ذلك كلّه أن ينصروا النبيءَ المبشَّر به في التَّوراة والإنجيل الّذي يجيء بعد عيسى قبل منتهى العالم ويخلِّص النّاس من الضلال { وإذ أخذ الله ميثاق النبيّين لَمَا آتيتكم من كتاب وحكمة ثُمّ جاءكم رسول مصدّق لما معكم لتؤمِنُنّ به ولتَنْصُرُنَّه } \\[ آل عمران : 81 \\] الآية . فجميع أتباع الرسل قد لزمهم ما التزمه أنبياؤهم وبخاصّة النّصارى ، فهذا اللقب ، وهو النصارى ، حجّة عليهم قائمة بهم متلبّسة بجماعتهم كلّها .ويفيد لفظ { قالوا } بطريق التعريض الكنائي أنّ هذا القول غير موفًّى به وأنّه يجب أن يوفّى به . هذا إذا كان النصارى جمعاً لنَاصرِيّ أو نصْرانِي على معنى النسبة إلى النّصر مبالغة ، كقولهم : شَعْرَاني ، ولِحيَاني ، أي النّاصر الشديد النصر؛ فإن كان النّصارى اسم جمع ناصريّ ، بمعنى المنسوب إلى الناصري ، والناصري عيسى ، لأنّه ظهر من مدينة الناصرة . فالناصري صفة عرف بها المسيح عليه السّلام في كتب اليهود لأنّه ظهر بدعوة الرسالة من بلد النّاصرة في فلسطين؛ فلذلك كان معنى النسبة إليه النسبة إلى طريقته وشرعه؛ فكلّ من حاد عن شرعه لم يكن حقيقاً بالنسبة إليه إلاّ بدعوى كاذبة ، فلذلك قال : { قالوا إنَّا نصارى } . وقيل : إنّ النصارى جمع نصراني ، منسوب إلى النصْر : كما قالوا : شعراني ، ولِحياني ، لأنّهم قالوا : نحن أنصار الله . وعليه فمعنى { قالوا : إنّا نصارى } أنّهم زعموا ذلك بقولهم ولم يؤيّدوه بفعلهم .وقد أخذ الله على النصارى ميثاقاً على لسان المسيح عليه السّلام . وبعضه مذكور في مواضع من الأناجيل .وقوله : { فأغرينا بينهم العداوة } حقيقة الإغراء حَثّ أحدٍ على فعل وتحسينُه إليه حتّى لا يتوانى في تحصيله؛ فاستعير الإغراء لتكوين ملازمة العداوة والبغضاء في نفوسهم ، أي لزومهما لهم فيما بينهم ، شُبّه تكوين العداوة والبغضاء مع استمرارهما فيهم بإغراء أحد أحداً بعمل يعمل تشبيه معقول بمحسوس . ولمّا دلّ الظرف ، وهو { بينَهم } ، على أنّهما أغْرِيَتَا بهم استُغني عن ذكر متعلّق { أغرينا } . وتقدير الكلام : فأغرينا العداوة والبغضاء بِهم كائنتين بينهم . ويُشبه أن يكون العدول على تعدية «أغرينا» بحرف الجرّ إلى تعليقه بالظرف قرينة أو تجريداً لبيان أنّ المراد ب { أغرينا } ألْقينا .وما وقع في «الكشاف» من تفسير { أغرينا } بمعنى ألصقنا تطوّح عن المقصود إلى رائحة الاشتقاق من الغِرَاءِ ، وهو الدهن الذي يُلْصق الخشب به ، وقد تنوسي هذا المعنى في الاستعمال . والعداوة والضمير المجرور بإضافة بينَ إليه يعود إلى النصارى لتنتسق الضّمائر .والعداوَة والبغضاءُ اسمان لمعنيين من جنس الكراهية الشديدة ، فهما ضدّان للمحبّة .وظاهر عطف أحدِ الاسمين على الآخر في مواضع من القرآن ، في هذه الآية وفي الآيتين بعدها في هذه السورة وفي آية سورة الممتحنة ، أنّهما ليسا من الأسماء المترادفة؛ لأنّ التزام العطف بهذا الترتيب بُبعِّد أن يكون لمجرّد التّأكيد ، فليس عطف أحدهما على الآخر من قبيل عطف المرادف لمجرّد التّأكيد ، كقوله عَدِي :وألْفَى قَولهَا كَذِبا وَمَيْنا ... وقد ترك علماء اللّغة بيان التفرقة بين العداوة والبغضاء ، وتابعهم المفسّرون على ذلك؛ فلا تجد من تصدّى للفرق بينهما سوى الشيخ ابن عرفة التّونسي ، فقال في «تفسيره» «العداوة أعمّ من البغضاء لأنّ العداوة سبب في البغضاء؛ فقد يتعادى الأخ مع أخيه ولا يتمادى على ذلك حتّى تنشأ عنه المباغضة ، وقد يتمادى على ذلك» اه .ووقع لأبي البقاء الكفوي في كتاب «الكليّات» أنّه قال : «العداوة أخصّ من البغضاء لأنّ كلّ عدوّ مبغض ، وقد يُبغِض من ليس بعدوّ» . وهو يخالف كلام ابن عرفة . وفي تعليليْهما مصادرة واضحة ، فإن كانت العداوة أعمّ من البغضاء زادتْ فائدةُ العطف لأنّه يصير في معنى الاحتراس ، وإن كانت العداوة أخصّ من البغضاء لم يكن العطف إلاّ للتّأكيد ، لأنّ التأكيد يحصل بذكر لفظ يدلّ على بعْضضٍ مُطلققٍ من معنى الموكَّذ ، فيتقرّر المعنى ولو بوجه أعمّ أو أخصّ ، وذلك يحصل به معنى التّأكيد .وعندي : أنّ كلا الوجهين غير ظاهر ، والذي أرى أنّ بين معنيي العداوة والبغضاء التضادّ والتباين؛ فالعداوة كراهية تصدر عن صاحبها : معاملةٌ بجفاء ، أو قطيعة ، أو إضرار ، لأنّ العداوة مشتقّة من العدو وهو التجاوز والتباعد ، فإنّ مشتقّات مادة ( ع د و ) كلّها تحوم حول التفرّق وعدم الوئام . وأمّا البغضاء فهي شدّة البغض ، وليس في مادة ( ب غ ض ) إلاّ معنَى جنس الكراهية فلا سبيل إلى معرفة اشتقاق لفظها من مادتها . نعم يمكن أن يرجع فيه إلى طريقة القلب ، وهو من علامات الاشتقاق ، فإنّ مقلوب بَغِض يكون غَضِب لا غير ، فالبغضاء شدّة الكراهية غير مصحوبة بَعَدوْ ، فهي مضمرة في النفس .فإذا كان كذلك لم يصحّ اجتماع معنيي العداوة والبغضاء في موصوف واحد في وقتتٍ واحد فيتعيّن أن يكون إلقاؤهما بينهما على معنى التّوزيع ، أي أغرينا العداوة بين بعض منهم والبغضاءَ بين بعضضٍ آخر . فوقع في هذا النظم إيجاز بديع ، لأنّه يرجع إلى الاعتماد على علم المخاطبين بعدم استقامة اجتماع المعنيين في موصوف واحد .ومن اللّطائف ما ذكره ابن هشام ، في شرح قصيدة كعب بن زهير عند قول كعب :لكنَّها خُلّة قد سِيط من دَمها ... فَجْع وولْع وإخلاف وتبديلأنّ الزمخشري قال : إنّه رأى نفسه في النّوم يقول : العداوة مشتقّة من عُدوة الوادي ، أي جانبه ، لأنّ المتعاديين يكون أحدهما مفارقاً للآخر فكأنّ كلّ واحد منهما على عدوة اه . فيكون مشتقّاً من الاسم الجامد وهو بعيد .وإلقاء العداوة والبغضاء بينهم كان عقاباً في الدنيا لقوله : { إلى يوم القيامة وسوف ينبّئهم الله بما كانوا يصنعون } جزاء على نكثهم العهد . وأسباب العداوة والبغضاء شدّة الاختلاف : فتكون من اختلافهم في نحَل الدّين بين يعاقبة ، وملكانية ، ونسطورية ، وهراتقة ( بروتستانت ) ؛ وتكون من التحاسد على السلطان ومتاع الدّنيا ، كما كان بين ملوك النّصرانية ، وبينهم وبين رؤساء ديانتهم .فإن قيل : كيف أغريت بينهم العداوة وهم لم يزالوا إلْبا على المسلمين؟ فجوابه : أنّ العداوة ثابتة بينهم في الدين بانقسامهم فِرقاً ، كما قدّمناه في سورة النساء ( 171 ) عند قوله تعالى : { وكلمتُه ألقاها إلى مريم وروح منه } ، وذلك الانقسام يجرّ إليهم العداوة وخذْل بعضهم بعضاً . ثمّ إنّ دولهم كانت منقسمة ومتحاربة ، ولم تزل كذلك ، وإنّما تألّبوا في الحروب الصّليبية على المسلمين ثمّ لم يلبثوا أن تخاذلوا وتحاربوا ، ولا يزال الأمر بينهم كذلك إلى الآن . وكم ضاعت مساعي الساعين في جمعهم على كلمة واحدة وتأليف اتّحاد بينهم ، وكان اختلافهم لطفاً بالمسلمين في مختلف عصور التّاريخ الإسلامي ، على أنّ اتّفاقهم على أمّة أخرى لا ينافي تمكُّن العداوة فيما بينهم ، وكفى بذلك عقاباً لهم على نسيانهم ما ذكّروا به .وقيل : الضمير عائد على الفريقين ، أي بين اليهود والنصارى ، ولا إشكال في تجسّم العداوة بين الملّتين .وقوله : وسوف ينبّئُهم الله } تهديد لأنّ المراد بالإنباء إنباء المؤاخذة بصنيعهم ، كقوله : { فسوف تعلمون } \\[ الأنعام : 135 \\] . وهذا يحتمل أن يحصل في الآخرة فالإنباء على حقيقته ، ويحتمل أن يحصل في الدنيا ، فالأنباء مجاز في تقدير الله لهم حوادث يعرفون بها سوء صنيعتهم .\n\n",
      "translations": [
        {
          "translation": "(And with those who say: \"Lo! we are Christians\"), i.e. the Christians of Najran (We made a covenant) in the Gospel that they should follow Muhammad (pbuh) and manifest his traits and not worship anyone or anything except Allah or associate anyone with Him, (but they forgot a part) they left part (of that whereof they were admonished) with which they were commanded. (Therefore We have stirred up) We have cast (enmity) killing and destruction (and hatred) in the hearts (among them) between the Jews and Christians; and it is said between the Nestorians of Najran, the sects known as the Jacobites, the Marqusiyya and the Melkites (till the Day of Resurrection, when Allah will inform them of their handiwork) of their opposition, treachery, concealment, enmity and hatred.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمِنَ ٱلَّذِينَ قَالُواْ إِنَّا نَصَارَىٰ } قالَ زيدُ بن علي عليهما السلامُ: هُمْ قَومٌ سُموا بِقَريةٍ يُقالَ لَها نَاصِرة، وَكَانَ عِيسى بن مَريمَ عَلَيهما السَّلامُ يَنزِلُهَا\n\n\n\n\nوقوله تعالى: { فَأَغْرَيْنَا بَيْنَهُمُ ٱلْعَدَاوَةَ وَٱلْبَغْضَآءَ } معناه هَيَّجْنَا\n\n",
      "translations": [
        {
          "translation": "\nAnd { among those who say, \"We are Christians\" } Zayd bin 'Ali, peace be upon them both, said: They are a people who are called by the name of a city, Nasirah, and Jesus son of Mary, peace be upon him, used to descend to them.\n\n\nAnd the saying of the Almighty: {We have instilled between them hatred and hostility} means that we have made them hate each other.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فأغرينا بينهم العداوة والبغضاء } أي: الزمناهم ذلك لتخالف دواعي قواهم السبعية والبهيمية والشيطانية وميلهم إلى الجهة السفلية الموجب للتضاد والتعاند لاحتجابهم عن نور التوحيد وبعدهم عن العالم القدسي الذي فيه المقاصد كلية لا تقتضي التجاذب والتعاند إلى وقت قيامهم بظهور نور الروح والقيامة الكبرى بظهور نور التوحيد { ينبئهم الله } بعقاب ما صنعوا عند الموت وظهور الحرمان والخسران بظهور الهيآت القبيحة المؤذية الراسخة فيهم\n  { لقد كفر الذين قالوا إنّ الله هو المسيح } بأن حصروا الألوهية فيه وقيدوا الإله بتعينه { أن يهلك المسيح ابن مريم } إلى قوله { جميعاً } بالإفناء في التوحيد والطمس في غير الجمع كما قال:\n[القصص\n الآية: 88]\n { ولله مُلْك السموات } أي: عالم الأرواح { والأرض } عالم الأجساد { وما بينهما } من الصور والأعراض كلها ظاهرة وباطنة وأسماؤه وصفاته وأفعاله { ادخلوا الأرض المقدّسة } أي: حضرة القلب التي هي مقام تجلي الصفات\n فإنه بالنسبة إلى سماء الروح أرض { كتب الله لكم } عين لكم في القضاء السابق وأودع في استعدادكم الوصول إليها والمقام بها { ولا ترتدّوا على أدباركم } في الميل إلى مدينة البدن والإقبال عليه بتحصيل مآربه ولذاته وطلب موافقته وتزيين هيآته فإنه مقام خلف مقامكم وأدنى وأسفل من رتبتكم { فتنقلبوا خاسرين } باستبدال ظلمات البدن بأنوار القلب وخبائثه بطيباته { إنّ فيها قوماً جبّارين } من سلطان الوهم وأمراء الهوى والغضب والشهوة وسائر صفات النفس الفرعونية أخذوها عنوة وقهراً واستولوا عليها مستعلين يجبرون كلاً على هواهم ما لنا بهم يدان ولا نقدر على مقاومتهم\n قالوا ذلك لاعتيادهم بالذات الطبيعية والشهوات الجسمانية وغلبة الهوى عليهم\n فلم يقدروا على الرياضة وقمع الهوى وكسر صفات النفس بالمجاهدة { وإنّا لن ندخلها حتى يخرجوا منها } أي: يصرفهم الله عنها بلا رياضة منا ومجاهدة أو ينصرفوا بالطبع مع إحالته أو يضعفوا عن الاستيلاء كما في الشيخوخة مع امتناع دخولهم فيها حينئذ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمِنَ ٱلَّذِينَ قَالُواْ إِنَّا نَصَارَىٰ } مدعين نصرة الدين\n وإعلاء كلمة الحق { أَخَذْنَا } كما أخذنا من اليهود { مِيثَاقَهُمْ } فنقضوا كما نقضوا { فَنَسُواْ } كما نسوا { حَظّاً مِّمَّا ذُكِرُواْ بِهِ } أي: بالإنجيل المنزل على عيسى - صلوات الرحمن عليه - { فَأَغْرَيْنَا } ألقينا\n وألزمنا { بَيْنَهُمُ } بين اليهود والنصارى\n وهم اليعقوبية والنسطورية والملكائية { ٱلْعَدَاوَةَ وَٱلْبَغْضَآءَ } المستمرة { إِلَىٰ يَوْمِ ٱلْقِيَامَةِ } بحيث لا يصفو نفاقهم وشقاقهم أصلاً { وَسَوْفَ يُنَبِّئُهُمُ ٱللَّهُ } كلا الفريقين\n أو الفرق { بِمَا كَانُواْ يَصْنَعُونَ } [المائدة: 14] في الدنيا من البغض والنفاق\n وبما يكسبون به في الآخرة من العذاب والعقاب",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: وأخذنا أيضًا عهدًا وميثاقًا من النصارى، الذين سموا أنفسهم نصارى ادعاء لنصرة عيسى عليه السلام ولم يقوموا بواجب ذلك عملاً واعتقادًا، أخذناه عليهم بالتزام أحكام الإنجيل، وأن يؤمنوا بالله وحده لا شريك له، ولا صاحبة ولا ولد، وأن يؤمنوا بمحمد ـ عليه الصلاة والسلام ـ إن أدركوه ويتبعوه، { فنسوا حظًا مما ذُكروا به } أي: نسوا ما ذكرناهم به، وتركوا حظًا واجبًا مما كلفوا به، { فأغرينا } أي: سلطنا { بينهم العداوة والبغضاء إلى يوم القيامة } ، فهم يقتتلون في البر والبحر، ويتحاربون إلى يوم القيامة، فكل فرقة تلعن أختها وتكفرها، أو بينهم وبين اليهود، فالعداوة بينهم دائمة، { وسوف ينبئهم الله بما كانوا يصنعون } بالجزاء والعقاب. الإشارة: يؤخذ من الآية أن من نقض العهد مع الله بمخالفة ما أمره به أو نهاه عنه. أو مع أولياء الله، بالانتقاد عليهم وعدم موالاتهم، ألقى الله في قلب عباده العداوة والبغضاء له، فيبغضه الله، ويبغضه عبادُ الله، ومن أوفى بما أخذه الله عليه من العهد بوفاء ما كلفه به، واجتناب ما نهاه عنه، وتودد إلى أوليائه، ألقى الله في قلب عباده المحبة والوداد، فيحبه الله، ويحبه عباد الله، ويتعطف عليه أولياء الله، كما في الحديث:\n \" إذا أحبَّ الله عبدًا نادى جبريل، إنَّ اللهَ يحبّ فلانًا فأحِبَّه، فيُحِبَّهُ جبرِيلُ. ثم يُنَادِي في الملائكة: إن اللهَ يُحِبُّ فُلاَنًا فأحِبُّوه. فيُحِبُّه أهلُ السَّمَاءِ، ثم يُلقَى له القَبولُ في الأرض \" \n.. الحديث. ثم دعا أهل الكتابين إلى الإيمان برسوله صلى الله عليه وسلم، فقال: { يَا أَهْلَ ٱلْكِتَابِ قَدْ جَآءَكُمْ رَسُولُنَا }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:60",
      "similarity": 0.5238166705609706
    },
    {
      "verse": "5:91",
      "similarity": 0.2829948002621148
    },
    {
      "verse": "60:4",
      "similarity": 0.25975209234470337
    },
    {
      "verse": "41:35",
      "similarity": 0.2395260214445631
    },
    {
      "verse": "3:176",
      "similarity": 0.22373419386206708
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005014.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005014.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:14.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}