{
  "chapter": "المائدة",
  "text": "يهدى به الله من اتبع رضونه سبل السلم ويخرجهم من الظلمت الى النور باذنه ويهديهم الى صرط مستقيم",
  "translations": [
    {
      "translation": "By it, Allah guides those who follow what pleases Him to the ways of Peace. He will bring them from the darkness to the light by His permission, and guide them to a straight path.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Through which God will lead those who follow His pleasure to the path of peace, and guide them out of darkness into light by His will, and to the path that is straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "through which Allah shows to all who seek to please Him the paths leading to safety. He brings them out, by His leave, from darkness to light and directs them on to the straight way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "to show the way of peace to those who seek His pleasure, to bring them out of darkness into light through His will and to guide them to the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With it, Allah guides whoever obeys the will of Allah to the paths of peace, and takes them out of darkness towards light by His command, and guides them to the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherewith Allah guides all those who seek His Pleasure to ways of peace, and He brings them out of darkness by His permission unto light and guides them to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With it Allah guides him who will follow His pleasure into the ways of safety and brings them out of utter darkness into light by His will and guides them to the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whereby God guides whosoever follows His good pleasure in the ways of peace, and brings them forth from the shadows into the light by His leave; and He guides them to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whereby Allah guideth him who seeketh His good pleasure unto paths of peace. He bringeth them out of darkness unto light by His decree, and guideth them unto a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "whereby God guides to the ways of peace all who seek His good pleasure, bringing them from darkness to the light, by His will, and guiding them to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therewith Allah guideth those who follow His goodwill unto the ways of safety, and bringeth them forth out of darkness into the light by His leave, and guideth them onto the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With it Allah guides those who follow [the course of] His pleasure to the ways of peace, and brings them out from darkness into light by His will, and guides them to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherewith Allah guideth all who seek His good pleasure to ways of peace and safety, and leadeth them out of darkness, by His will, unto the light,- guideth them to a path that is straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherewith Allah guides all those who seek His Good Pleasure to ways of peace, and He brings them out of darkness by His Will unto light and guides them to a Straight Way (Islamic Monotheism).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "with which Allah guides those who seek His pleasure to the Paths of Peace. By His permission He takes them out from darkness to the light, and guides them to a Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God guides with it whoever follows His approval to the ways of peace, and He brings them out of darkness into light, by His permission, and He guides them in a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By which Allah guides those who pursue His pleasure to the ways of peace and brings them out from darknesses into the light, by His permission, and guides them to a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:16] whereby, that is, the Book by which, God guides whoever follows His good pleasure, by believing, to the ways of peace, the paths of safety, and brings them forth from the shadows, [from] unbelief, into the light, [into] belief, by His leave, by His will, and He guides them to a straight path, the religion of Islam.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whereby) i.e. through Muhammad and the Qur'an (Allah guideth him who seeketh His good pleasure) His divine Oneness (unto paths of peace) the religion of Islam, and the Peace (al-Salam) is Allah. (He bringeth them out of darkness unto light) He brings them out of disbelief to faith (by His decree) by His command; it is also said that this means: by His given success and grace, (and guideth them unto a straight path) He confirms them on that religion after they accept it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَهْدِي بِهِ ٱللَّهُ } الهادي لعباده { مَنِ ٱتَّبَعَ } منهم { رِضْوَانَهُ } أي: يرضى به { سُبُلَ ٱلسَّلاَمِ } أي: طريق التوحيد الموصلة إلى سلامة الوحدة\n المسماة عند بدار السلام { وَيُخْرِجُهُمْ } أيك المتبعين رضوان { مِّنِ ٱلظُّلُمَاتِ } ظلمة العدم\n وظلمة الإمكان وظلمة التعينات { إِلَى ٱلنُّورِ } أي: الوجود البحث\n الخالص عن شوب الظلمة\n إذ هو نور على نور\n يهدي الله لنوره من يشاء من أهل العناية\n وإنما يخرجهم { بِإِذْنِهِ } وتوفيقه\n وجذب { وَ } بالجملمة: { يَهْدِيهِمْ } أن سيق لهم العناية منه { إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ } [المائدة: 16] موصل إلى توحيده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الضمير في: { به } \n يعود إلى النور والكتاب\n ووحَّدَه لأن المراد به شيء واحد\n لأن النور هو الكتاب المبين\n أو لأنهما جنس واحد\n يقول الحقّ جلّ جلاله: { يا أهل الكتاب } اليهود والنصارى { قد جاءكم رسولنا } محمد صلى الله عليه وسلم { يُبين لكم كثيرًا مما كنتم تُخفون من الكتاب } كصفة محمد صلى الله عليه وسلم\n وآية الرجم التي في التوراة\n وكبشارة عيسى بأحمد التي في الإنجيل\n { ويعفو عن كثير } مما تخفونه وتحرفونه\n فلم يخبر به\n ولم يفضحكم\n حيث لم يؤمر به\n أو عن كثير منكم\n فلا يؤاخذه بجرمه وسوء أدبه معه\n { قد جاءكم } يا أهل الكتاب { من الله نور وكتاب مبين } \n عطف تفسير\n فالنور هو الكتاب المبين\n أو النور: محمد ـ عليه الصلاة والسلام ـ والكتاب المبين: القرآن لأنه الكاشف لظلمات الشك والضلال\n والواضح الإعجاز والبيان\n { يهدي به الله من اتبع رضوانه } أي: من اتبع رضى الله بالإيمان به\n والعمل بما فيه\n { سُبل السلام } أي: طرق السلامة من العذاب\n أو طرق الله الموصلة إليه\n { ويخرجهم من الظلمات إلى النور } من ظلمات الكفر\n إلى نور الإسلام { بإذنه } أي: بإرادته وتوفيقه\n { ويهديهم إلى صراط مستقيم } أي: طريق توصلهم إليه لا عوج فيها\n الإشارة: قد أطْلَع الله علماء الباطن على مقامات علماء الظاهر وأحوالهم وجل مساوئهم\n ولا سيما من كان عالمًا بالظاهر ثم انتقل إلى علم الباطن\n كالغزالي وابن عباد وغيرهما\n فقد تكلم الغزالي في صدر الإحياء مع علماء الظاهر\n ففضح كثيرًا من مساوئهم\n وكذلك ابن عباد في شرح الحكم\n وعفوًا عن كثير ـ فهم على قدم رسول الله صلى عليه وسلم وخواص ورثته\n لأنهم حازوا الوراثة كلها\n كما في المباحث:\nفالولي نور من نور الله\n وسر من أسراره\n يُخرج به من سبقت له العناية من ظلمات الحجاب إلى نور الشهود\n ويهدي به من اصطفاه لحضرته تعالى طريق الوصول إليه\n وبالله التوفيق\n ثم ذكر مساوئ أهل الكتاب وضلالتهم\n تحريضاً على قتالهم إن لم يسلموا أو يعطوا الجزية\n فقال: { لَّقَدْ كَفَرَ ٱلَّذِينَ قَآلُوۤاْ إِنَّ ٱللَّهَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:1",
      "similarity": 0.569755885730779
    },
    {
      "verse": "10:25",
      "similarity": 0.4842542967462937
    },
    {
      "verse": "37:118",
      "similarity": 0.46143055001081446
    },
    {
      "verse": "1:6",
      "similarity": 0.4586258072732829
    },
    {
      "verse": "4:68",
      "similarity": 0.45699588121353635
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/5:16.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/5:16.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/5:16.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}