{
  "chapter": "المائدة",
  "text": "لقد كفر الذين قالوا۟ ان الله هو المسيح ابن مريم قل فمن يملك من الله شيـا ان اراد ان يهلك المسيح ابن مريم وامه ومن فى الارض جميعا ولله ملك السموت والارض وما بينهما يخلق ما يشاء والله على كل شىء قدير",
  "translations": [
    {
      "translation": "Those who say, 'Allah is the Messiah, son of Maryam,' are kafir. Say: 'Who possesses any power at all over Allah if He desires to destroy the Messiah, son of Maryam, and his mother, and everyone else on earth?' The kingdom of the heavens and the earth and everything between them belongs to Allah. He creates whatever He wills. Allah has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily they are unbelievers who say: \"The Messiah, son of Mary, is God.\" You ask them: \"Who could prevail against God if He had chosen to destroy the Messiah, son of Mary, and his mother, and the rest of mankind?\" For God's is the kingdom of the heavens and the earth and whatsoever lies between them. He creates what He please, for God has the power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who said: 'Christ, the son of Mary, he is indeed God', disbelieved. Say (O Muhammad!): 'Who could have overruled Allah had He so willed to destroy Christ, the son of Mary, and his mother, and all those who are on earth?' For to Allah belongs the dominion of the heavens and the earth and all that is between them; He creates what He wills. Allah is All-Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have said that the Messiah, son of Mary, is God, have, in fact, committed themselves to disbelief. (Muhammad), ask them, \"Who can prevent God from destroying the Messiah, his mother and all that is in the earth?\" To God belongs all that is in the heavens, the earth, and all that is between them. God creates whatever He wants and He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have indeed become disbelievers who say, “Messiah, the son of Maryam is certainly Allah”; say, “Who can then do anything against Allah, if He wills to destroy the Messiah, the son of Maryam, and his mother and everyone on earth?” And for Allah only is the kingship of the heavens and the earth and all that is between them; He creates whatever He wills; and Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, in disbelief are they who say that Allah is the Messiah, son of Maryam. Say: \"Who then has the least power against Allah, if He were to destroy the Messiah, son of Maryam, his mother, and all those who are on the earth together\" And to Allah belongs the dominion of the heavens and the earth, and all that is between them. He creates what He wills. And Allah is able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly they disbelieve who say: Surely, Allah-- He is the Messiah, son of Marium. Say: Who then could control anything as against Allah when He wished to destroy the Messiah son of Marium and his mother and all those on the earth? And Allah's is the kingdom of the heavens and the earth and what is between them; He creates what He pleases; and Allah has power over all things,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are unbelievers who say, 'God is the Messiah, Mary's son.' Say: 'Who then shall overrule God in any way if He desires to destroy the Messiah, Mary's son, and his mother, and all those who are on earth?' For to God belongs the kingdom of the heavens and of the earth, and all that is between them, creating what He will. God is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They indeed have disbelieved who say: Lo! Allah is the Messiah, son of Mary. Say: Who then can do aught against Allah, if He had willed to destroy the Messiah son of Mary, and his mother and everyone on earth? Allah's is the Sovereignty of the heavens and the earth and all that is between them. He createth what He will. And Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In blasphemy indeed are those who say, \"God is Christ, the son of Mary.\" Say, \"Who then could prevent God if He so willed from destroying Christ, son of Mary, and his mother and everyone on earth? The kingdom of the heavens and the earth and everything between them belong to God. He creates what He will and God has power over all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly they have disbelieved who say. verily God! He is the Masih, son of Maryam. Say thou; who can avail in aught against Allah, if He intended to destroy Masih, son of Maryam, and his mother and thou on the earth altogether? And Allah's is the dominion of the heavens and the earth and that which is in between the twain. He createth whatsoever He will, and Allah is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are certainly faithless who say, ‘Allah is the Messiah, son of Mary.’ Say, ‘Who can avail anything against Allah should He wish to destroy the Messiah, son of Mary, and his mother, and everyone upon the earth?’ To Allah belongs the kingdom of the heavens and the earth, and whatever is between them. He creates whatever He wishes, and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In blasphemy indeed are those that say that Allah is Christ the son of Mary. Say: \"Who then hath the least power against Allah, if His will were to destroy Christ the son of Mary, his mother, and all every - one that is on the earth? For to Allah belongeth the dominion of the heavens and the earth, and all that is between. He createth what He pleaseth. For Allah hath power over all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, in disbelief are they who say that Allah is the Messiah, son of Maryam (Mary). Say (O Muhammad SAW): \"Who then has the least power against Allah, if He were to destroy the Messiah, son of Maryam (Mary), his mother, and all those who are on the earth together?\" And to Allah belongs the dominion of the heavens and the earth, and all that is between them. He creates what He wills. And Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say that Allah is the Messiah, son of Mary are indeed those who disbelieved. Say: 'Who then could prevent any thing from Allah, if He willed to destroy the Messiah, son of Mary, together with his mother and all the people of the earth? For Allah is the kingdom of the heavens and the earth and all that lies between them. He creates what He will and has power over all things'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They disbelieve those who say, “God is the Christ, the son of Mary.” Say, “Who can prevent God, if He willed, from annihilating the Christ son of Mary, and his mother, and everyone on earth?” To God belongs the sovereignty of the heavens and the earth and what is between them. He creates whatever He wills, and God has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have certainly disbelieved who say that Allah is Christ, the son of Mary. Say, \"Then who could prevent Allah at all if He had intended to destroy Christ, the son of Mary, or his mother or everyone on the earth?\" And to Allah belongs the dominion of the heavens and the earth and whatever is between them. He creates what He wills, and Allah is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:17] They indeed are disbelievers those who say, ‘God is the Messiah, son of Mary’, insofar as they make him [Jesus] a god, and these were the Jacobites, a Christian sect. Say: ‘Who then can do anything, [who then can] defend, against, the chastisement of, God if He desires to destroy the Messiah, son of Mary, and his mother, and all those who are on earth?’, that is to say, none can do anything of the sort, since if Jesus were a god, he would be able to do so. And to God belongs the kingdom of the heavens and the earth, and all that is between them. He creates what He will. God has power over everything, which He wills.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They indeed have disbelieved who say: Lo! Allah is the Messiah, son of Mary) this is the claim of the Jacobites. (Say) to these Christians, Muhammad: (Who then can do aught against Allah) who can save from Allah's punishment, (if He had willed to destroy) to punish (the Messiah son of Mary, and his mother and everyone on earth?) who worshipped her. (Allah's is the Sovereignty of the heavens and the earth) to Him belong the stores of the heavens and earth (and all that is between them) of created things and marvels. (He createth what He will) as He wills, whether a father exists or not. (And Allah is Able to do all things) in terms of creating created beings, rewarding His allies and punishing His enemies.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَّقَدْ كَفَرَ } وأعرض عن الحق\n ولم يعرف حق قدره { ٱلَّذِينَ } بالغوا في وصف عيسى عليه السلام\n وغالوا فيه إلى أن { قَآلُوۤاْ } على سبيل الحصر\n { إِنَّ ٱللَّهَ } المتجلي في الآفاق { هُوَ ٱلْمَسِيحُ ٱبْنُ مَرْيَمَ قُلْ } لهم يا أكمل الرسل تبكتاً لهم وإلزاماً: { فَمَن يَمْلِكُ } يدفع ويمنع { مِنَ ٱللَّهِ شَيْئاً } من مراداته ومقدوراته { إِنْ أَرَادَ أَن يُهْلِكَ } أي: يبقي على الهلاك الأصلي\n والفناء الجبلي بلا مدّ من ظله\n ورش من نوره { ٱلْمَسِيحَ ٱبْنَ مَرْيَمَ وَأُمَّهُ وَمَن فِي ٱلأَرْضِ جَمِيعاً } لا يبالي الله به وبهم\n إذ { وَللَّهِ } المنزه عن الأكوان مطلقاً { مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ وَمَا بَيْنَهُمَا } متصرف فيها حسب إرادته واختياره إيجاداً وإعداماً { يَخْلُقُ } ويظهر { مَا يَشَآءُ } بلطفه\n ويعدم ويخفي ما يشاء بقهره { وَٱللَّهُ } المتصف بجميع أوصاف الكمال { عَلَىٰ كُلِّ شَيْءٍ } مقدر إرادته { قَدِيرٌ } [المائدة: 17] لا تفتر قدرته\n ولا تنتهي إرادته ومشيئته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { لقد كفر الذين قالوا إن الله هو المسيح ابن مريم } ، والقائل بهذه المقالة هي الطائفة اليعقوبية من النصارى، كما تقدم. وقيل: لم يصرح بهذه المقالة أحدٌ منهم. ولكن لزمهم حيث قالوا بأن اللاهوت حل في ناسوت عيسى ـ مع أنهم يقولون الإله واحد، فلزمَهم أن يكون هو المسيح، ولزمهم الاتحاد والحلول فنسب إليهم لازم قولهم، توضيحًا لجهلهم، وتقبيحًا لمعتقدهم. ثم رد عليهم بقوله: { قل فمن يملك من الله شيئًا } أي: من يمنع من قدرته وإرادته شيئًا، { إن أراد أن يهلك المسيح ابن مريم وأمه ومن في الأرض جميعًا } ، وبيان الرد عليهم: أن المسيح مقدورٌ ومقهور، قابل للفناء كسائر الممكنات، ومن كان كذلك فهو معزول عن الألوهية. ثم أزال شبهتهم بحجة أخرى فقال: { ولله ملك السماوات والأرض وما بينهما } ، يتصرف فيهما كيف شاء، { يخلق ما يشاء والله على كل شيء قدير } فقدرته عامة فيخلق من غير أصل كالسماوات والأرض، ومن أصل كخلق ما بينهما، وينشىء من أصل ليس هو جنسه كآدام وكثير من الحيوانات، ومن أصل يجانسه، إما من ذكر وحده كحواء، أو من أنثى وحدها: كعيسى، أو منهما كسائر الناس. قاله البيضاوي: الإشارة: قد رُمي كثير من الأولياء المحققين بالاتحاد والحلول كابن العربي الحاتمي، وابن الفارض، وابن سبعين، والششتري والحلاج، وغيرهم ـ رضي الله عنهم عنهم ـ وهم بُرءاء منه. وسبب ذلك أنهم لما خاضوا بحار التوحيد، وكُوشفوا بأسرار التفريد، أو أسرار المعاني قائمة بالأواني، سارية في كل شيء، ماحية لكل شيء، كما قال في الحِكَم: \" الأكوان ثابتة بإثباته ممحوه بأحدية ذاته \" فأرادوا أن يعبروا عن تلك المعاني فضاقت عبارتهم عنها لأنه خارجة عن مدارك العقول، لا تدرك بالسطور ولا بالنقول. وإنما هي أذواق ووجدان فمن عبَّر عنها بعبارة اللسان كُفِّر وزندق، وهذه المعاني هي الخمرة الأزلية التي كانت خفية لطيفة، ثم ظهرت محاسنها، وأبدت أنوارها وأسرارها، وهي أسرار الذات وأنوار الصفات، فمن عرفها وكوشف بها. اتحد عنده الوجود، وأفضى إلى مقام الشهود. وهي منزهة عن الحلول والاتحاد، إذ لا ثاني لها حتى تحل فيه أو تتحد معه، وقد أشرت إلى هذا المعنى في تائيتي الخمرية، حيث قلت:\nفمن كوشف بأسرار هذه الخمرة، لم ير مع الحق سواه. كما قال بعضُ العارفين:  لو كُلفتُ أن أرى غيره لم أستطع فإنه لا غير معه حتى أشهده . ولو أظهرها الله تعالى للكفار لوجدوا أنفسهم عابدة لله دون شيء سواه، وفي هذا المعنى يقول ابن الفارض على لسان الحقيقة:\nوالنصارى ـ دمرهم الله في مقام الفرق والضلال ـ حملهم الجهل والتقليد الرديّ على مقالاتهم التي قالوا في عيسى عليه السلام. ثم ذكر مقالة أخرى لليهود و النصارى، فقال: { وَقَالَتِ ٱلْيَهُودُ وَٱلنَّصَارَىٰ نَحْنُ أَبْنَاءُ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:72",
      "similarity": 0.5993862365465581
    },
    {
      "verse": "3:45",
      "similarity": 0.5987159505967008
    },
    {
      "verse": "5:75",
      "similarity": 0.5248647614836313
    },
    {
      "verse": "9:31",
      "similarity": 0.38914976519065353
    },
    {
      "verse": "4:157",
      "similarity": 0.3320424003691589
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/5:17.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/5:17.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}