{
  "chapter": "المائدة",
  "text": "وقالت اليهود والنصرى نحن ابنؤا۟ الله واحبؤه قل فلم يعذبكم بذنوبكم بل انتم بشر ممن خلق يغفر لمن يشاء ويعذب من يشاء ولله ملك السموت والارض وما بينهما واليه المصير",
  "translations": [
    {
      "translation": "The Jews and Christians say, 'We are Allah's children and His loved ones.' Say: 'Why, then, does He punish you for your wrong actions? No, you are merely human beings among those He has created. He forgives whoever He wills and He punishes whoever He wills. The kingdom of the heavens and the earth and everything between them belongs to Allah. He is our final destination.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say the Jews and the Christians: \"We are sons of God and beloved of Him.\" Say: \"Why does He punish you then for your sins? No: You are only mortals, of His creation.\" He can punish whom He please and pardon whom He will, for God's is the kingdom of the heavens and the earth and all that lies between them, and everything will go back to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews and the Christians say: 'We are Allah's children and His beloved ones.' Ask them: 'Why, then, does He chastise you for your sins?' You are the same as other men He has created. He forgives whom He wills and chastises whom He wills. And to Allah belongs the dominion of the heavens and the earth, and all that is between them. To Him is the eventual return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews and Christians call themselves the beloved sons of God. (Muhammad), ask them, \"Why does God punish you for your sins? In fact, you are mere human beings whom He has created. He forgives and punishes whomever He wants. To Him belongs all that is in the heavens, the earth, and all that is between them and to Him do all things return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews and the Christians said, “We are the sons of Allah and His beloved ones”; say, “Why does He then punish you for your sins? In fact you are human beings, part of His creation; He forgives whomever He wills, and punishes whomever He wills; and for Allah only is the kingship of the heavens and the earth and all that is between them – and towards Him is the return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews and the Christians say: \"We are the children of Allah and His loved ones.\" Say: \"Why then does He punish you for your sins\" Nay, you are but human beings of those He has created, He forgives whom He wills and He punishes whom He wills. And to Allah belongs the dominion of the heavens and the earth and all that is between them; and to Him is the return (of all).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews and the Christians say: We are the sons of Allah and His beloved ones. Say: Why does He then chastise you for your faults? Nay, you are mortals from among those whom He has created, He forgives whom He pleases and chastises whom He pleases; and Allah's is the kingdom of the heavens and the earth and what is between them, and to Him is the eventual coming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say the Jews and Christians, 'We are the sons of God, and His beloved ones.' Say: 'Why then does He chastise you for your sins? No; you are mortals, of His creating; He forgives whom He will, and He chastises whom He will.' For to God belongs the kingdom of the heavens and of the earth, and all that is between them; to Him is the homecoming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews and Christians say: We are sons of Allah and His loved ones. Say: Why then doth He chastise you for your sins? Nay, ye are but mortals of His creating. He forgiveth whom He will, and chastiseth whom He will. Allah's is the Sovereignty of the heavens and the earth and all that is between them, and unto Him is the journeying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews and the Christians say, \"We are the children of God and His beloved ones.\" Say, \"Then why does He punish you for your sins? Indeed, you are but human beings among those He has created. He forgives whom He pleases and punishes whom He pleases. The kingdom of the heavens and the earth and all that is between them, belong to God and all shall return to Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews and the Nazarenes say: we are the children of God and His loved ones. Say thou: wherefore then doth He torment you for your sins? Aye! ye are but men, part of those whom He hath created. He forgiveth whomsoever He will and tormenteth whomsoever He will. And Allah's is the dominion of the heavens and the earth and that which is in- between the twain, and unto Him in the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews and the Christians say, ‘We are Allah’s children and His beloved ones.’ Say, ‘Then why does He punish you for your sins?’ No, you are humans from among His creatures. He forgives whomever He wishes, and punishes whomever He wishes, and to Allah belongs the kingdom of the heavens and the earth, and whatever is between them, and toward Him is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Both) the Jews and the Christians say: \"We are sons of Allah, and his beloved.\" Say: \"Why then doth He punish you for your sins? Nay, ye are but men,- of the men he hath created: He forgiveth whom He pleaseth, and He punisheth whom He pleaseth: and to Allah belongeth the dominion of the heavens and the earth, and all that is between: and unto Him is the final goal (of all)\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (both) the Jews and the Christians say: \"We are the children of Allah and His loved ones.\" Say: \"Why then does He punish you for your sins?\" Nay, you are but human beings, of those He has created, He forgives whom He wills and He punishes whom He wills. And to Allah belongs the dominion of the heavens and the earth and all that is between them, and to Him is the return (of all).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews and the Nazarenes say: 'We are the children of Allah and His loved ones' Say: 'Why then does He punish you for your sins? Surely, you are mortals amongst what He created. He forgives whom He will, and punishes whom He will. For Allah is the Kingdom of the heavens and the earth, and all that is between them. All shall return to Him'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews and the Christians say, “We are the children of God, and His beloved.” Say, “Why then does He punish you for your sins?” In fact, you are humans from among those He created. He forgives whom He wills, and He punishes whom He wills. To God belongs the dominion of the heavens and the earth and what lies between them, and to Him is the return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Jews and the Christians say, \"We are the children of Allah and His beloved.\" Say, \"Then why does He punish you for your sins?\" Rather, you are human beings from among those He has created. He forgives whom He wills, and He punishes whom He wills. And to Allah belongs the dominion of the heavens and the earth and whatever is between them, and to Him is the [final] destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:18] The Jews and Christians, both of them, say: ‘We are the sons of God, that is, [we are] like his sons in terms of closeness and rank, and He is like a father to us in terms of compassion and care, and His beloved ones’. Say, to them, O Muhammad (s): ‘Why then does He chastise you for your sins?, if what you say is true. For, the father does not punish his son, nor the loving his beloved; but He has punished you, and therefore you are saying lies. Nay; you are mortals from among, all, those, mortals, He created, you shall be rewarded as they are rewarded and you shall be requited as they are requited. He forgives, him for, whom He wills, forgiveness, and He chastises, him for, whom He wills’, chastisement, and there can be no objection thereto. For to God belongs the kingdom of the heavens and of the earth, and all that is between them; to Him is the journey’s end, the [final] return.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The Jews) the Jews of Medina (and Christians) the Christians of Najran (say: We are sons of Allah) we are the sons and prophets of Allah (and His loved ones) who follow His religion; it is also said that this means: we follow Allah's religion as if we were His sons and loved ones; and it is said that this means: we are to Allah like His sons and we are followers of His religion. (Say) to the Jews, Muhammad; (Why then doth He chastise you for your sins) due to worshipping the calf for 40 days, if you are like sons to Him; have you ever seen a father torturing his sons with fire? (Nay, ye are but mortals) created servants (of His creating) like all His other created beings. (He forgiveth whom He will) whoever repents of Judaism and Christianity, (and chastiseth whom He will) whoever dies professing Judaism or Christianity. (Allah's is the Sovereignty) the stores (of the heavens and the earth and all that is between them) of created beings and marvels, (and unto Him is the journeying) returning to Him is the end result of those who believe and those who do not.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَالَتِ ٱلْيَهُودُ وَٱلنَّصَٰرَىٰ } من غاية مبالغتهم، وغلوهم في حق عيسى وعزير - عليهما السلام -: { نَحْنُ أَبْنَٰؤُاْ ٱللَّهِ } إذ نعبد نبيه { وَأَحِبَّٰؤُهُ } إذ نحبهما، وهما محبوباه { قُلْ } لهم يا أكمل الرسل: { فَلِمَ يُعَذِّبُكُم } الله { بِذُنُوبِكُم } إن كنتم صادقين في هذه الدعوة، يعذبكم في الدنيا بالقتل والسبي والإجلاء، وضرب الذلة والمسكنة، وفي الآخرة بأضعاف ما في الدنيا وآلافها، فعليكم ألاَّ تغلوا في دينكم ونبيكم، ولا تفتروا على الله الكذب\n\n\n\n\n{ بَلْ أَنتُمْ } ونبيكم أيضاً { بَشَرٌ مِمَّنْ } أي: من جنس ما { خَلَقَ } الله بقدرته وأظهره حسب إرادته، فله التصرف فيكم وفيهم { يَغْفِرُ لِمَن يَشَآءُ } تفضلاً وامتناناً { وَيُعَذِّبُ مَن يَشَآءُ } عدلاً وانتقاماً { وَ } اعلموا أن { للَّهِ مُلْكُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ وَمَا بَيْنَهُمَا } يتصرف فيها كيف يشاء إرادة واختياراً { وَإِلَيْهِ } لا إلى غيره { ٱلْمَصِيرُ } [المائدة: 18] والرجع؛ إذ الكل منه بدأ، وإليه يعود\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { وقالت اليهود والنصارى نحن أبناء الله } أي: أولاد بنيه فاليهود يقولون: نحن أولاد عزير، والنصارى يقولون: نحن أشياع عيسى\n أو: فينا أبناء الله ونحن أحباؤه، أو: نحن مقربون عند الله كقرب الولد من والده\n وهذه دعوى ردَّها عليهم بقوله: { قل } لهم: { فلِمَ يعذبكم بذنوبكم } ، وهل رأيتم والدًا يُعذب ابنه، وقد عذبكم في الدنيا بالمسخ والقتل والذل، وقد اعترفتم أنه يعذبكم بالنار أيامًا معدودة، { بل أنتم بشر ممن خلق } أي: ممن خلقه الله، { يغفر لمن يشاء } بفضله وهو من آمن منهم بالله ورسوله، { ويعذب من يشاء } بعدله وهو من مات منهم على كفره، فأنتم كسائر البشر يعاملكم معاملتهم، لا مزية لكم عليهم، { ولله ملك السماوات والأرض وما بينهما } كلها سواء في كونها ملكًا وعبيدًا لله ـ سبحانه ـ { وإليه المصير } ، فيجازي المحسن بإحسانه والمسيء بإساءته، فلا فضل لأحد على أحد إلا بالتقى\n الإشارة: قوله تعالى: { فلِمَ يعذبكم بذنوبكم } أي: فلو كنتم أحباءه لما عذبكم لأن الحبيب لا يعذب حبيه، حُكي عن الشبلي رضي الله عنه أنه كان إذا لبس ثوبًا جديدًا مزقه، فأراد ابن مجاهد أن يعجزه بمحضر الوزير فقال له: أين تجد في العلم فساد ما ينتفع به؟ فقال له الشبلي: أين في العلم:\n\n[صَ:33]؟ فسكت، فقال له الشبلي: أنت مقرىء عند الناس، فأين في القرآن: إن الحبيب لا يعذب حبيبه؟ فسكت ابن مجاهد، ثم قال: قل يا أبا بكر، فقرأ له الشبلي قوله تعالى:\n\n[المَائدة:18]، فقال ابن مجاهد: كأني والله ما سمعتها قط\n هـ\n وفي الحديث:\n\n \" إذا أحَبَّ اللهُ عبدًا لاَ يضُرُّه ذَنبٌ \" \n\n، ذكره في القوت\n وفي المثل الشائع:  من سبقت له العناية لا تضره الجناية \n وفي الصحيح\n\n \" لعَلَّ اللهَ اطَّلَعَ عَلَى أهلِ بَدرِ فَقَالَ: افعَلُوا مَا شِئتم فَقَد غَفَرتُ لَكم \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:42",
      "similarity": 0.43590710501812674
    },
    {
      "verse": "3:31",
      "similarity": 0.4035865224732113
    },
    {
      "verse": "2:285",
      "similarity": 0.3675603829101348
    },
    {
      "verse": "40:3",
      "similarity": 0.3527960598586971
    },
    {
      "verse": "2:113",
      "similarity": 0.3435526537178228
    }
  ]
}