{
  "chapter": "المائدة",
  "text": "يايها الذين ءامنوا۟ لا تحلوا۟ شعئر الله ولا الشهر الحرام ولا الهدى ولا القلئد ولا ءامين البيت الحرام يبتغون فضلا من ربهم ورضونا واذا حللتم فاصطادوا۟ ولا يجرمنكم شنـان قوم ان صدوكم عن المسجد الحرام ان تعتدوا۟ وتعاونوا۟ على البر والتقوى ولا تعاونوا۟ على الاثم والعدون واتقوا۟ الله ان الله شديد العقاب",
  "translations": [
    {
      "translation": "You who have iman! do not profane the sacred rites of Allah or the sacred months, or the sacrificial animals, or the ritual garlands, or those heading for the Sacred House, desiring profit and good pleasure from their Lord. When you have come out of ihram, then hunt for game. Do not let hatred for a people who debar you from the Masjid al-Haram incite you into going beyond the limits. Help each other to goodness and taqwa. Do not help each other to wrongdoing and enmity. Have taqwa of Allah. Allah is severe in retribution.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, do not violate the (sanctity of) offerings to God, nor the rites of the holy month, nor sacrificial cattle with garlands (that are brought to the Ka'bah), nor of the people who flock to the Holy House seeking the bounties of their Lord, and His pleasure. Hunt when you have laid aside the robe of the pilgrim. And do not let your hatred of a people who had barred you from the Holy Mosque lead you to aggression. But help one another in goodness and piety, and do not assist in crime and rebellion, and fear God. Surely God is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Neither desecrate the symbols of (devotion to) Allah, nor the holy month, nor the animals of offering, nor the animals wearing collars indicating they are for sacrifice, nor ill-treat those who have set out for the Holy House seeking from their Lord His bounty and good pleasure. But once you are free from Pilgrimage obligations, you are free to hunt. Do not let your wrath against the people who have barred you from the Holy Mosque move you to commit undue transgressions; rather, help one another in acts of righteousness and piety, and do not help one another in sin and transgression. Fear Allah. Surely Allah is severe in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not disrespect the reminders of God, the sacred months, the animals brought for sacrifice, or what is marked for sacrificial offering or the people heading to the precinct of the Sacred House to seek the favor and pleasure of their Lord. Once the restrictions of ihram are over, you may hunt. Do not let the hostility of a group of people keep you away from the Sacred Mosque or make you express animosity. Co-operate with each other in righteousness and piety, not in sin and hostility. Have fear of God; He is stern in His retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not make lawful the symbols of Allah nor the sacred months nor the sacrificial animals sent to Sacred Territory (around Mecca) nor the animals marked with garlands, nor the lives and wealth of those travelling towards the Sacred House (Kaa’bah) seeking the munificence and pleasure of their Lord; and when you have completed the pilgrimage, you may hunt; and let not the enmity of the people who had stopped you from going to the Sacred Mosque tempt you to do injustice; and help one another in righteousness and piety – and do not help one another in sin and injustice – and keep fearing Allah; indeed Allah’s punishment is severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Violate not the sanctity of the symbols of Allah, nor of the Sacred Month, nor of the Hady brought for sacrifice, nor the garlands, nor the people coming to the Sacred House (Makkah), seeking the bounty and good pleasure of their Lord. But when you finish the Ihram, then hunt, and let not the hatred of some people in (once) stopping you from Al-Masjid Al-Haram (at Makkah) lead you to transgression. Help you one another in Al-Birr and At-Taqwa, but do not help one another in sin and transgression. And have Taqwa of Allah. Verily, Allah is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! do not violate the signs appointed by Allah nor the sacred month, nor (interfere with) the offerings, nor the sacrificial animals with garlands, nor those going to the sacred house seeking the grace and pleasure of their Lord; and when you are free from the obligations of the pilgrimage, then hunt, and let not hatred of a people-- because they hindered you from the Sacred Masjid-- incite you to exceed the limits, and help one another in goodness and piety, and do not help one another in sin and aggression; and be careful of (your duty to) Allah; surely Allah is severe in requiting (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, profane not God's waymarks nor the holy month, neither the offering, nor the necklaces, nor those repairing to the Holy House seeking from their Lord bounty and good pleasure. But when you have quit your pilgrim sanctity, then hunt for game. Let not detestation for a people who barred you from the Holy Mosque move you to commit aggression. Help one another to piety and godfearing; do not help each other to sin and enmity. And fear God; surely God is terrible in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Profane not Allah's monuments nor the Sacred Month nor the offerings nor the garlands, nor those repairing to the Sacred House, seeking the grace and pleasure of their Lord. But when ye have left the sacred territory, then go hunting (if ye will). And let not your hatred of a folk who (once) stopped your going to the inviolable place of worship seduce you to transgress; but help ye one another unto righteousness and pious duty. Help not one another unto sin and transgression, but keep your duty to Allah. Lo! Allah is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, violate neither the sanctity of God's signs, the Sacred Month, the sacrificial animals, the animals wearing garlands [indicating they are to be sacrificed] nor those on their way to the Sacred House seeking the bounty and pleasure of their Lord. When, on completion of your pilgrimage, you take off the garb of the pilgrim, you may hunt. Do not let the enmity of those who barred you from the Sacred Mosque lead you into sin. Help one another in goodness and in piety. Do not help one another in sin and transgression. Fear God! God is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! profane not the landmarks of Allah nor any sacred month nor the offering nor the victims with the garlands nor those repairing to the Sacred House seeking the grace of their Lord and His goodwill. And when ye have put off the state of sanctity, ye may chase. And let not the hatred against a people, because they kept you from the Sacred Mosque, incite you to trespass. Assist each other to virtue and piety, and assist not each other to sin and transgression, Fear Allah: verily Allah is Severe in chastising.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not violate Allah’s sacraments, neither the sacred month, nor the offering, nor the necklaces, nor those bound for the Sacred House, who seek their Lord’s grace and [His] pleasure. But when you emerge from pilgrim sanctity, you may hunt for game. Ill feeling for a people should not lead you, because they barred you from [access to] the Sacred Mosque, to transgress. Cooperate in piety and Godwariness, but do not cooperate in sin and aggression, and be wary of Allah. Indeed Allah is severe in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Violate not the sanctity of the symbols of Allah, nor of the sacred month, nor of the animals brought for sacrifice, nor the garlands that mark out such animals, nor the people resorting to the sacred house, seeking of the bounty and good pleasure of their Lord. But when ye are clear of the sacred precincts and of pilgrim garb, ye may hunt and let not the hatred of some people in (once) shutting you out of the Sacred Mosque lead you to transgression (and hostility on your part). Help ye one another in righteousness and piety, but help ye not one another in sin and rancour: fear Allah: for Allah is strict in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Violate not the sanctity of the Symbols of Allah, nor of the Sacred Month, nor of the animals brought for sacrifice, nor the garlanded people or animals, etc. [Marked by the garlands on their necks made from the outer part of the tree-stems (of Makkah) for their security], nor the people coming to the Sacred House (Makkah), seeking the bounty and good pleasure of their Lord. But when you finish the Ihram (of Hajj or 'Umrah), you may hunt, and let not the hatred of some people in (once) stopping you from Al-Masjid-al-Haram (at Makkah) lead you to transgression (and hostility on your part). Help you one another in Al-Birr and At-Taqwa (virtue, righteousness and piety); but do not help one another in sin and transgression. And fear Allah. Verily, Allah is Severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not violate the rites of Allah, or the sacred month, or the offerings, or (those hung with) necklaces, nor those whose aim is to the Sacred House seeking from their Lord bounty and pleasure. Once your pilgrimage has ended, you are free to hunt. Do not allow your hatred for a nation who would bar you from the Holy Mosque to lead you to transgress. And cooperate in righteousness and warding off (evil), and do not cooperate in sinfulness and transgression. Have fear of Allah, for Allah is Stern in retribution.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not violate God’s sacraments, nor the Sacred Month, nor the offerings, nor the garlanded, nor those heading for the Sacred House seeking blessings from their Lord and approval. When you have left the pilgrim sanctity, you may hunt. And let not the hatred of people who barred you from the Sacred Mosque incite you to aggression. And cooperate with one another in virtuous conduct and conscience, and do not cooperate with one another in sin and hostility. And fear God. God is severe in punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not violate the rites of Allah or [the sanctity of] the sacred month or [neglect the marking of] the sacrificial animals and garlanding [them] or [violate the safety of] those coming to the Sacred House seeking bounty from their Lord and [His] approval. But when you come out of ihram, then [you may] hunt. And do not let the hatred of a people for having obstructed you from al-Masjid al-Haram lead you to transgress. And cooperate in righteousness and piety, but do not cooperate in sin and aggression. And fear Allah; indeed, Allah is severe in penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:2] O you who believe, do not profane God’s sacraments (sha‘ā’ir is the plural of sha‘īra), that is, the [ritual] ceremonies of the religion, by hunting [game] while you are on pilgrimage, nor the sacred month, by fighting in it, nor the offering, that is, the boon offered in the [Meccan] Sanctuary, by interfering with it, nor the garlands (qalā’id, is the plural of qilāda, and these, made from the trees around the Sanctuary, were placed around it [the offering] to protect it), in other words, do not interfere with these [offerings] or with those who place them; nor, violate the sanctity of, those repairing, those heading, to the Sacred House, by fighting them [who are], seeking bounty, provision, from their Lord, through commerce, and, His, beatitude, by resorting to Him, as they [the Meccans pagans] falsely claimed (this was abrogated by the barā’a verse [of sūrat al-Tawba, Q. 9:4]). But when you are discharged, from pilgrimage inviolability, then hunt for game (a command denoting permission). And let not hatred (read shana’ānu or shan’ānu) of a people that, because [they], barred you from the Sacred Mosque cause you to commit aggression, against them by killing them or otherwise. Help one another to righteousness, by doing that to which you were enjoined, and piety, by refraining from what you have been forbidden; do not help one another (ta‘āwanū: one of the two original tā’ letters [in tata‘āwanū] has been omitted) to sin, acts of disobedience, and enmity, transgression of God’s bounds. And fear God, fear His punishment by being obedient to Him; surely God is severe in retribution, against those that oppose Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe! Profane not Allah's monuments) do not make lawful the abstention from all of Allah's rites (nor the Sacred Month) nor attacking people in the Sacred Month (nor the offerings) nor the taking of offerings which are made to the House (nor the garlands) nor the taking of the garlands which are hung by the advent of the Sacred Month, (nor those repairing to the Sacred House) nor attacking those who head for Allah's Sacred House, i.e. the pilgrims of al-Yamamah-the clan of the idolater Bakr Ibn Wa'il-and the traders of the idolater Shurayh Ibn Dabi'ah, (seeking the grace) provision (and pleasure of Allah) by means of the pilgrimage. It is also said that this means: they seek provision by means of trade and also Allah's pleasure. (But when ye have left the sacred territory) after the days of Tashriq, (then go hunting (if ye will)) if you will, go hunt wild game. (And let not your hatred of a folk) the hatred of the people of Mecca (who (once) stopped your going to the Inviolable Place of Worship) on the Day of al-Hudaybiyyah (seduce you) drive you (to transgress) against the pilgrims of the clan of Bakr Ibn Wa'il; (but help ye one another unto righteousness) acts of obedience (and pious duty) shunning transgressions. (Help not one another unto sin) contraventions (and transgression) against the pilgrims of the clan of Bakr Ibn Wa'il, (but keep your duty to Allah) fear Allah in that which He has commanded and prohibited you. (Lo! Allah is severe in punishment) when He punishes those who abstain from that which He has commanded.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { شَعَآئِرَ ٱللَّهِ } معناهُ هَدَايَاهُ\n واحِدُهَا شَعِيرةٌ، تُشْعَرُ البَدنةُ، ليُعلَمَ أَنَّها هَديٌ\n والإِشْعارُ أَنْ يُطْعَنَ شِقُ سِنَامِهَا الأَيمَنُ بِحَديدةٍ ليُعْلَمَ أَنَّها بَدْنةٌ\n والشَّعائِرُ: الصَّفا والمَروَةُ وَمَا أَشْبَهَهُمَا مِن المَناسِكِ\n\n\n\n\nوقوله تعالى: { وَلاۤ آمِّينَ ٱلْبَيْتَ ٱلْحَرَامَ } وَلاَ عَامِدِينَ إِليهِ\n\n\n\n\nوقوله تعالى: { وَلاَ يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ } معناهُ لاَ يَحمِلَنكُمْ\n والشَّنَأَنُ: العَداوةُ والبَغضاءُ\n\n\n\n\nوقوله تعالى: { وَتَعَاوَنُواْ عَلَى ٱلْبرِّ وَٱلتَّقْوَىٰ } قالَ زيدُ بن علي عليهما السلامُ فالبِرُّ: مَا أَمرَ بِهِ\n والتَّقوى: مَا نَهَى عَنهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { لا تُحِلوا شَعَائِرَ الله } من المقامات والأحوال التي يعلم بها حال السالك في سلوكه كالصبر والشكر والتوكل والرضا وأمثالها، أي: لا ترتكبوا ذنوب الأحوال ولا تخرجوا عن حكم المقامات فإنها شعائر دين الله الخالص\n وكما أن المواضع المعلومة المعلمة بما يفعل فيها كالمطاف والمسعى والمنحر وغيرها والأفعال المعلومة في الحجّ شعائر يشعر بها الحاج\n فهذه المقامات والمراتب والأحوال شعائر يشعر بها حال السالك وكما أنه لا يجوز في ظاهر الشرع تغييرها عن موضعها والخروج عن حكمها فكذلك هذه في شرع المحبين كما يحكى عن أحدهم أنه كان يتكلم في الصبر فدبّ عقرب على ساقه وأخذت تضربه وهو على حاله لا ينحيها فسئل عنه فقال: أستحي من أن أتكلم في مقام وأنا أفعل ما ينافيه { ولا الشهر الحرام } أي: وقت الإحرام بالحج الحقيقي وهو وقت السلوك والوصول بالخروج عن حكمه والاشتغال بما ينافيه ويصده عن وجهته ويثبطه في سيره { ولا الهدي } ولا النفس المستعدّة المعدة للقربان عند الوصول إلى فناء الحضرة الإلهية على ما أُشير إليه باستعمالها في شغل يصرفها عن طريقها أو يضعفها أو حمل فوق طاقتها من الرياضة، فينقطع دون البلوغ إلى المحل { ولا القَلائِد } ولا ما قلدته النفس من شعار أهل السلوك والسنن والأعمال الظاهرة بتركها وتغييرها عن وضعها { ولا آمّينَ البَيْت الحرام } ولا القاصدين المجدّين في السلوك المجتهدين بتغيرهم ومنعهم عن الرياضة وإيهان عزائمهم بالمخالطة وتقليل السعي وإيهامهم أنه لا حاجة بهم إليه وشغلهم بما يصدّهم أو يكسلهم { يَبْتَغون فَضْلاً من ربهم } بتجلّيات الأفعال { ورضْوَاناً } بتجليات الصفات\n\n\n{ وإذا حللتُم } بالرجوع إلى البقاء بعد الفناء والاستقامة { فاصطادوا } أي: فلا حرج عليكم في الحظوظ بل ربما كان تمتيع النفس بالحظوظ إعانة لها في مشاهداتها ومكاشفاتها لشرفها وذكائها وشدّة صفائها { ولا يجرمنكم شنآن قوم } إلى آخره، أي: لا يكسبنكم بعض القوى النفسانية المانعة عن سلوككم أن تقهروها بالكلية بمنعها عن الحقوق التي تقوم بها فتبطلوها أو تضعفوها عن منافعها وما يحتاج إليه من أفعالها بسبب صدّها إياكم، فإنّ وبال ذلك عائد إليكم\n أو عداوة قوم من أهليكم وأقاربكم وأصدقائكم بسبب منعهم إياكم عن التجريد والرياضة في السلوك { أن تعتدوا } عليهم بإضرارهم ومقتهم وإرادة الشرّ بهم فإنه أضرّ بكم في السلوك من منعهم إياكم { وتعاونوا على البرّ والتقوى } بتدبير تلك القوى وسياستها بالإحسان إليها بحقوقها ومنعها من حظوظها أو بمراعاة الأهلين والأقارب والأصدقاء بمواساتهم والإحسان إليهم، والمعروف في حقّهم مع مخالفتهم إلى ما يمنعكم عنه والاجتناب عن ذلك، كما قال تعالى:\n\n[لقمان، الآية: 15]، { واتقوا الله } واجعلوه وقاية لكم في هذه الأمور واحذروه في خلافها { إنّ الله شديد العقاب } يعاقبكم بالصدّ والحرمان\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَا أَيُّهَا ٱلَّذِينَ آمَنُواْ } بالله؛ طاعةً وتعبداً، مقتضى إيمانكنم أن { لاَ تُحِلُّواْ } وتبيحوا لأنفسكم { شَعَآئِرَ ٱللَّهِ } أي: حرمات الله التي حرمها سبحانه في أيام الحج؛ تعظيماً لأمره وتوقيراً لبيته { وَلاَ ٱلشَّهْرَ ٱلْحَرَامَ } أي: لا تحلوا قواكم الحيوانية عن الحبس والزجر في الأزمنة التي حرم سبحانه إطلاقها فيها؛ تعظيماً لبيته { وَلاَ } تبيحوا أيضاً لأنفسكم { ٱلْهَدْيَ } أي: التعرض لما أُهدي إلى البيت قبل بلوغه إلى كله { وَ } أيضاً { لاَ } يتعرضوا { ٱلْقَلاۤئِدَ } وهي ما يعلم، ويقلد بقلادة دالة على أنه من هدايا بيت الله على ما هو من عادة العرب\n\n\n\n\n{ وَ } عليكم أن { لا } تتعرضوا، وتتقاتلوا مع المؤمنين الموقنين الذين توجهوا نحو الكعبة الحقيقة، وأرادوا أن يخرجوا عن بقعة الإمكان، فدخلوا في طريق المجاهدة وسلكوا نحو الوجوب؛ تقرباً وتشوقاً، مع كونهم { ۤ آمِّينَ ٱلْبَيْتَ ٱلْحَرَامَ } قاصدين التقرب والتحقق بكعبة الذات، والوقوف بعرفات الأسماء والصفات؛ إذ لا بد من وقوفها لمن قصد زيارة بيت الله الأعظم، بل الركن الأصلي لزيارة بيت الله، وهي هنا الوقوف عند المنجذبين نحو الحق من طريق المجاهدة المستتبعة للكشف والمشاهدة لأهل العناية\n\n\n\n\nوأما المنجبون نحوه بالاستغناء والاستغراق التام الذي لا يحوم حله شائبة من الكثرة أصلاً، فهم في مقعد صدق عن مليك مقتدر، حال كونهم { يَبْتَغُونَ } ويطلبون هؤلاء الزوار التحقق بهذه المرتبة العليَّة، والمنزلة السنيَة { فَضْلاً مِّن رَّبِّهِمْ } بلا وسائق الأعمال والنسك، ووسائق المأمورات والمنهيات { وَ } يطلبون أيضاً من فضل الله { رِضْوَاناً } رضاً من جانب الحق، وتحسيناً من قبله فيما يأتونه من الشعائر المكتوبة في الحي الحقيقي؛ إذ لا وثوق للعبد سوى الرضا منك يا أكرم الأكرمين، ويا أرحم الراحمين\n\n\n\n\n{ وَإِذَا حَلَلْتُمْ } قوى حيوانيتكم عن عقال التكاليف المفروضة في الحج بخروج أيامها وأوقاتها مع متمماتها { فَٱصْطَادُواْ } أي: أبيحوا على أنفسكم اصطياد ما أحلَّ الله لكم من صيد البر والبحر { وَ } بعدما علمتم فوائد الحج، وعرفتم عرفانه ومناسكه { لاَ يَجْرِمَنَّكُمْ شَنَآنُ قَوْمٍ } أي: لا يوقعنَّم في الجريمة العظيمة بغض قوم إياكم، وخوفكم منهم إلى { أَن صَدُّوكُمْ } وصرفوكم { عَنِ } التوجه نحو { ٱلْمَسْجِدِ ٱلْحَرَامِ } الذي حرمت عنده سجود السوى والأغيار مطلقاً\n\n\nفعليكم أيها القاصدون زيارة الكعبة المعظمة، والقبلة المكرمة التي هي بيت الوحدة { أَن تَعْتَدُواْ } وتتمنوا، وتعتادوا على المقاتلة، والمقاتلة مع الكفار إنما يغني عن الزيارة من القوى الشهوية والغضبية، والمستلذات الخالية الواهية { وَتَعَاوَنُواْ } استنصورا { عَلَى } جنود { ٱلْبرِّ } المورث للرجاء، وحسن الظن بربكم { وَ } على جنود { ٱلتَّقْوَىٰ } المشعر للخوف من قهر الله وغضبه { وَلاَ تَعَاوَنُواْ عَلَى ٱلإِثْمِ } الخصلة الذميمة عقلاً وشرعاً { وَٱلْعُدْوَانِ } أي: التجاوز عن الحدود الشرعية - العياذ بالله - { وَٱتَّقُواْ ٱللَّهَ } أن تجترئوا عليه بنقض عهوده ، ومجاوزة حدوده { إِنَّ ٱللَّهَ } القادر على كل ما يريد { شَدِيدُ ٱلْعِقَابِ } [المائدة: 2] أليم العذاب لمن ظلم نفسه بالإثم والعدوان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الشعائر: جمع شَعيرة، وهي اسم ما أشعر، أي: جعل علامة على مناسك الحج ومواقفه و { لا يجرمنّكم } أي: يحملنّكم، أو يكسبنّكم، يُقال: جرم فلان فلانًا هذا الأمر، إذا أكسبه إيّاه وحمله عليه\n والشنآن: هو البغض والحقد، يقال: بفتح النون وإسكانها، و { أن صدّوكم } مفعول من أجله، و { أن تعتدوا } مفعول ثانٍ ليحرمنّكم\n ومَن قرأ:  إن صدّوكم، بالكسر فشرط، أغنى عن جوابه: { لا يجرمنّكم }\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا لا تُحِلّوا شعائر الله } أي: لا تستحلّوا شيئًا من ترك المناسك، وذلك أن الأنصار كانوا لا يسعون بين الصفا والمروة، وكان أهل مكة لا يخرجون إلى عرفات، وكان أهل اليمن يرجعون من عرفات، فأمرهم الله ألاّ يتركوا شيئًا من المناسك، أي: لا تحلّوا ترك شعائر الله { ولا } تحلّوا { الشهر الحرام } بالقتال أو السَّبْي، وهذا قبل النسخ، { ولا } تحلّوا { الهَدْيَ } ، أي: ما أُهْدِيَ إلى الكعبة، فلا تتعرّضوا له ولو من كافر، { ولا } تحلّوا { القلائد } أي: ذوات القلائد، وهي الهَدْي المقلّدة، وعطفها على الهَدْي للاختصاص فإنها أشرف الهَدْي، أي لا تتعرضوا للهَدْي مطلقًا\n والقلائد جمع قِلادة، وهي: ما قُلِّدَ به الهَدْي من نَعْل أو لِحاء الشجر، أو غيرهما، ليُعلَم به أنه هَدْي فلا يُتَعَرَّض له، { ولا } تحلّوا { آمِّين } أي: قاصِدين البيت الحرام، أي: قاصدين لزيارته، { يبتغون فضلاً من ربّهم ورضوانًا } أي: يطلبون رزقًا بالتجارة التي قصدوها، ورضوانًا بزعمهم، لأنهم كانوا كُفّارًا\n وذلك، أن الآية نزلت في الحُطَم بن ضُبَيْعة، وذلك أنه أتى المدينة، فخلَّف خَيْلَه خَارجَ المدِينةَ، ودخل وحْدَه إلى النَّبي صلى الله عليه وسلم فقال: إلامَ تدعُو النَّاس إليه؟ فقال له:\n\n \" إلى شَهادة أنْ لا إله إلا اللهُ وإقَام الصَّلاةِ وإيتَاءِ الزَّكاة \" \n\nفقال: حَسَنٌ، إلاّ أن لي أُمَرَاءَ لا أقطعُ أمْرًا دُونَهُمْ، ولَعَلَّي أُسْلِم، فخرج وغار على سَرْحِ المدينة فاسْتَاقَهُ، فما كان في العام المقبل خرج حاجًا مع أهل اليمامة، ومعه تجارة عظيمة، وقد قلّد الهَدْيَ، فقال المسلمون للنبي صلى الله عليه وسلم: هذا الحُطَمُ قد خرج حاجًا فخَلِّ بيننا وبينه؟ فقال النبي صلى الله عليه وسلم\n\n \" إنه قلّد الهَدْيَ \" \n\n، فقالوا يا رسول الله: هذا شيء كنّا نفعله في الجاهلية ـ أي تقيه ـ، فأبى عليهم النبي صلى الله عليه وسلم، فنزلت الآية\n وقال ابن عباس: كان المشركون يحجّون ويهدون، فأرادَ المسلمون أن يُغِيرُوا عليهم، فنهاهم الله تعالى بالآية\n { وإذا حللتم } من الحج والعمرة { فاصطادوا } ، أمْر إباحة لأنه وقع بعد الحَظْر، { ولا يجرمنّكم } أي: لا يحملنّكم، أو لا يكسبنّكم { شنآن قوم } أي: شدّة بغضكم لهم لأجل { أن صدّوكم عن المسجد الحرام } عام الحديبية { أن تعتدوا } بالانتقام منهم بأن تحلّوا هداياهم وتتعرّضوا لهم في الحرم\n\n\nقال ابن جزيّ: نزلت عام الفتح حين ظفر المسلمون بأهل مكة، فأرادوا أن يستأصلوهم بالقتل لأنهم كانوا قد صدّوهم عن المسجد الحرام عام الحديبية، فنهاهم الله عن قتلهم لأن الله عَلِمَ أنهم يؤمنون\n هـ\n ثم نسخ ذلك بقوله:\n\n[التوبَة:5]\n ثم قال تعالى: { وتعاونوا على البرّ والتقوى } كالعفو، والإغضاء، ومتابعة الأمر، ومُجانَبة الهوى\n وقال ابن جزيّ: وصية عامّة، والفرق بين البرّ والتقوى أن البرّ عامّ في الواجبات والمندوبات، فالبرّ أعمّ من التقوى\n هـ\n { ولا تعاونوا على الإثم والعدوان } كالتشفّي والانتقام\n قال ابن جُزَيّ: الإثم: كل ذنب بين الله وعبده، والعدوان: على الناس\n هـ\n { واتقوا الله إن الله شديد العقاب } فانتقامه أشد\n الإشارة: قد أمر الحق ـ جلّ جلاله ـ بتعظيم عباده، وحِفظ حُرمتهم كيفما كانوا، \" فالخلق كلّهم عِيال الله، وأحبّ الخلقِ إلى اللهِ أنفعُهُمْ لِعِياله \" ، فيجب على العبد كفّ أذاه عنهم وحمل الجفا منهم، وألاَّ ينتقم لنفسه ممَّن آذاه منهم، ولا يحمله ما أصابه منهم على أن يعتدي عليهم ولو بالدعاء، بل إن وسَّع الله صدره بالمعرفة قابلهم بالإحسان، ودعا لعدوّه بصلاح حاله حتى يأخذ الله بيده، وهذا مقام الصّديقيَة العظمى والولاية الكبرى، وهذا غاية البرّ والتقوى الذي أمر الله ـ تعالى ـ بالتعاون عليه، والاجتماع إليه، دون الاجتماع على الإثم والعدوان، وهو الانتصار للنفس والانتقام من الأعداء، فإن هذا من شأن العوامّ، الذين هم في طرف مقام الإسلام\n والله تعالى أعلم\n ثمَّ بيَّن ما وعد به في قوله: { إِلاَّ مَا يُتْلَىٰ عَلَيْكُمْ } ، فقال: { حُرِّمَتْ عَلَيْكُمُ ٱلْمَيْتَةُ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:8",
      "similarity": 0.4280148225484414
    },
    {
      "verse": "5:97",
      "similarity": 0.37539850953066994
    },
    {
      "verse": "39:63",
      "similarity": 0.3338968395516141
    },
    {
      "verse": "42:12",
      "similarity": 0.3214101028901273
    },
    {
      "verse": "5:96",
      "similarity": 0.3156420307829906
    }
  ]
}