{
  "chapter": "المائدة",
  "text": "واذ قال موسى لقومه يقوم اذكروا۟ نعمة الله عليكم اذ جعل فيكم انۢبياء وجعلكم ملوكا وءاتىكم ما لم يؤت احدا من العلمين",
  "translations": [
    {
      "translation": "Remember when Musa said to his people, 'My people! remember Allah's blessing to you when He appointed Prophets among you and appointed kings for you, and gave you what He had not given to anyone else in all the worlds!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when Moses said to his people: \"O my people, remember the favours that God bestowed on you when He appointed apostles from among you, and made you kings and gave you what had never been given to any one in the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when Moses said to his people: 'My people, remember Allah's favour upon you when He raised Prophets amongst you and appointed you rulers, and granted to you what He had not granted to anyone else in the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses told his people, \"Recall God's favors to you. He made Messengers and Kings out of your own people and gave you what He had not given to others-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moosa said to his people, “O my people! Remember Allah’s favour upon you, that He created Prophets among you, and made you kings, and has now given you what He has not given to any one else in this world.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Musa said to his people: \"O my people! Remember the favor of Allah to you: when He made Prophets among you, made you kings and gave you what He had not given to any other among the nations (Al-`Alamin).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Musa said to his people: O my people! remember the favor of Allah upon you when He raised prophets among you and made you kings and gave you what He had not given to any other among the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses said to his people, 'O my people, remember God's blessing upon you, when He appointed among you Prophets, and appointed you kings, and gave you such as He had not given to any being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Moses said unto his people: O my people! Remember Allah's favour unto you, how He placed among you prophets, and He made you kings, and gave you that (which) He gave not to any (other) of (His) creatures.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when Moses said to his people, \"O my people! Remember God's favour to you, He has raised up prophets among you, made you kings, and granted you [favours] such as He has not granted to anyone else in the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time Musa said unto his people: O my people! remember the favour of Allah on you when he made amongst you prophets and made princes, and vouchsafed unto you that which he vouchsafed not to anyone in the world.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses said to his people, ‘O my people, remember Allah’s blessing upon you when He appointed prophets among you, and made you kings, and gave you what none of the nations were given.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember Moses said to his people: \"O my people! Call in remembrance the favour of Allah unto you, when He produced prophets among you, made you kings, and gave you what He had not given to any other among the peoples.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Musa (Moses) said to his people: \"O my people! Remember the Favour of Allah to you, when He made Prophets among you, made you kings, and gave you what He had not given to any other among the 'Alamin (mankind and jinns, in the past).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when Moses said to his people. 'Remember, my people, the favors which Allah has bestowed upon you. He has raised up Prophets among you, made you kings, and given you that which He has not given to any one of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses said to his people, “O my people, remember God’s blessings upon you, when He placed prophets among you, and made you kings, and gave you what He never gave any other people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention, O Muhammad], when Moses said to his people, \"O my people, remember the favor of Allah upon you when He appointed among you prophets and made you possessors and gave you that which He had not given anyone among the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:20] And, mention, when Moses said to his people, ‘O my people, remember God’s favour to you, when He established among you, that is, from among you, prophets, and established you as kings, possessing servants and retinues, and gave you such as He had not given to any in all the worlds, in the way of manna and quails, the parting of the sea and other things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (remember) when Moses said unto his people: my people! Remember Allah's favour) Allah's grace (unto you, how He placed among you) from you (Prophets, and He made you Kings) while you were slaves of Pharaoh before, (and gave you that (which) He gave not to any (other) of (His) creatures) of your time in the wilderness: quails and honey.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَآتَاكُمْ مَّا لَمْ يُؤْتِ أَحَداً مِّن ٱلْعَٱلَمِينَ } معناهُ المَّنُ والسُّلوى والحَجرُ والغَمَامُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And He has given you what He has not given to anyone else in the world} [means] al-Manna and al-Sulwa and al-Hajar and al-Ghamaam.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكروا { إِذْ قَالَ مُوسَىٰ لِقَوْمِهِ } وهم أسلاف لكم وآباؤكم حين أراد أن يذكرهم نعم الله التي أنعمها عليهم\n ليقوموا بشكرها: { يَاقَوْمِ ٱذْكُرُواْ نِعْمَةَ ٱللَّهِ عَلَيْكُمْ } تفضلاً وامتناناً { إِذْ جَعَلَ فِيكُمْ } منكم { أَنْبِيَآءَ } يرشدونكم\n ويهدونكم إلى طريق التوحيد { وَجَعَلَكُمْ مُّلُوكاً } متصرفين في أقطار الأرض { وَآتَاكُمْ } من الخوارق والإرهاصات من فلق البحر\n وظل الغمام\n وسقي الحجر\n ونزول المن والسلوى وغير ذلك { مَّا لَمْ يُؤْتِ أَحَداً مِّن ٱلْعَٱلَمِينَ } [المائدة: 20] حين ظهروكم واستيلائكم\n\n\n{ يَٰقَوْمِ ٱدْخُلُوا ٱلأَرْضَ ٱلمُقَدَّسَةَ } المطهرة عن شوائر الفتن { ٱلَّتِي كَتَبَ ٱللَّهُ لَكُمْ } أي: قدرها في علمه لمقركم ومسكنكمح إذ هي منازل الأنبياء\n ومقر الأولياء والأصفياء\n فعليكم أن تقبلوا إليها تاركين ديار العمالقة والفراعنة التي هي محل الجور والفساد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { و } اذكر { إذ قال موسى لقومه }: يا بني إسرائيل { اذكروا نعمة الله عليكم إذ جعل فيكم أنبياء } يسُوسُونكم، كلما مات نبي خلفه نبي، فقد شرفكم بهم دون غيركم، إذ لم يبعث في أمة ما بعث في بني إسرائيل من الأنبياء، { وجعلكم ملوكًا } أي: جعل منكم ملوكًا، وقد تكاثر فيهم الملوك تكاثر الأنبياء، فكان كل نبي معه ملك ينفذ أحكامه، فكانت دار النبوة ودار المملكة معلومة، يخلف بعضهم بعضًا في النبوة والمُلك، استمر ذلك لهم، حتى قتلوا يحيى، وهموا بقتل عيسى، فنزع الله منهم الملك، وأنزل عليهم الذل والهوان. وقيل: لمّا كانوا مملوكين في أيدي القبط، فأنقذهم الله وجعلهم مالكين لأنفسهم، سماهم ملوكًا. { وآتاكم ما لم يُؤت أحدًا من العالمين } من فلق البحر، وتظليل الغمام، وإنزال المن والسلوى، ونحوها، أو المراد عالمي زمانهم، وعن أبي سعيد الخدري قال النبي صلى الله عليه وسلم:\n \" كَانَ بنو إسرَائيل إذا كَانَ لأحَدِهم خَادِمٌ وامرَأة يُكتَب مَلِكًا \" \nوقال ابن عباس:  من كان له بيت وخادم وامراة فهو مَلِك، وعن أبي الدرداء قال: قال النبي صلى الله عليه وسلم\n \" مَن أصبَحَ مُعَافّى في بَدَنِه، آمنًا في سِربِه، عِندَه قُوتُ يَومِه، فكأنما حِيزَت له الدنيا بحذافيرها، يكفيكَ منها، يا ابنَ آدم، ما سَدَّ جوعَتَكَ، وَوَارَ عَورَتك، فإن كان بيتٌ يُوارِيك فذاك، وإن كانت دابة فبخ بخ، فلق الخبز، وماء الجر وما فَوق الإزار حِسَابٌ عليك \". \nوقال الضحاك: كانت منازلهم واسعة، فيها مياه جارية، فمن كان مسكنه واسعًا وفيه ماء جارٍ، فهو ملك. وقال قتادة: كانوا أول من ملك الخدم، وأول من سخر لهم الخدم من بني آدم. هـ. الإشارة: كل من رزقه الله من يأخذ بيده ومن يستعين به على ذكر ربه، فليذكر نعمة الله عليه، فقد أسبغ الله عليه نعمه ظاهرة وباطنة. وكل من ملك نفسه وهواه، وأغناه الله عما سواه، فهو ملك من الملوك. وكل من خرجت فكرته عن دائرة الأكوان، واتصل بفضاء الشهود والعيان، فقد آتاه الله ما لم يؤت أحدًا من العالمين. وقد كُنتُ ذات يوم جالسًا في الجامع الأعظم من مدينة تطوان، فانتبهتُ فإذا مصحف إلى جنبي، فقال لي الهاتف: انظر تجد مقامك، فأعرضت عنه، فأعاد عليَّ الهاتف ثلاث مرات، فرفعته، ونظرت، فإذا في أول الورقة: { وآتاكم ما لم يؤت أحدًا من العالمين } ، فحمدت الله تعالى وأثنيت عليه. ثم أمرهم بجهاد عدوهم، فقال: { يَاقَوْمِ ادْخُلُوا الأَرْضَ المُقَدَّسَةَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "92:19",
      "similarity": 0.4213645825529766
    },
    {
      "verse": "89:25",
      "similarity": 0.3581251029521324
    },
    {
      "verse": "112:1",
      "similarity": 0.34173193032203325
    },
    {
      "verse": "5:115",
      "similarity": 0.33683845213244673
    },
    {
      "verse": "22:56",
      "similarity": 0.33307543981877685
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/5:20.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/5:20.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:20.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}