{
  "chapter": "المائدة",
  "text": "قالوا۟ يموسى ان فيها قوما جبارين وانا لن ندخلها حتى يخرجوا۟ منها فان يخرجوا۟ منها فانا دخلون",
  "translations": [
    {
      "translation": "They said, 'There are tyrants in it, Musa. We will not enter it until they leave. If they leave it, then we will go in.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Moses, in that land live a people who are formidable; we shall never go there until they leave. We shall enter when they go away.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They answered: 'Moses, therein live a ferocious people: we will not enter unless they depart from it; but if they do depart from it then we will surely enter it.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Moses, a giant race of people is living there. We shall never go there unless they leave the land first. If they leave it then we will enter.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Moosa! In it lives a very strong nation – and we shall never enter it, until they have gone away from there; so when they have gone away from there, we will enter it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Musa! In it are a people of great strength, and we shall never enter it, till they leave it; when they leave, then we will enter.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Musa! surely there is a strong race in it, and we will on no account enter it until they go out from it, so if they go out from it, then surely we will enter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Moses, there are people in. it very arrogant; we will not enter it until they depart from it; if they depart from it then we will enter.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Moses! Lo! a giant people (dwell) therein and lo! we go not in till they go forth from thence. When they go forth from thence, then we will enter (not till then).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Moses, in that land there is a powerful people. Never shall we enter it until they leave it: if they leave, then we shall certainly enter it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Musa! verily therein are a people high handed, and verily we shall never enter it until they go forth therefrom; so if they go forth thence, we shall verily enter in.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘O Moses, there are a tyrannical people in it. We will not enter it until they leave it. But once they leave it, we will go in.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Moses! In this land are a people of exceeding strength: Never shall we enter it until they leave it: if (once) they leave, then shall we enter.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Musa (Moses)! In it (this holy land) are a people of great strength, and we shall never enter it, till they leave it; when they leave, then we will enter.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses' they replied, 'therein is a nation of giants. We will not enter until they depart from it; if they depart from it only then shall we enter'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Moses, there are tyrannical people in it; we will not enter it until they leave it. If they leave it, we will be entering.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"O Moses, indeed within it is a people of tyrannical strength, and indeed, we will never enter it until they leave it; but if they leave it, then we will enter.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:22] They said, ‘O Moses, there are giants in it, those remaining of the people of ‘Ād, who were very tall and mighty; we will never enter it until they depart from it; if they depart from it then we will enter’, it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said: Moses! Lo! a giant people) assassins ((dwell) therein, and lo! we go not in) this land of assassins (till they go forth from thence. When they go forth, then we will enter (not till then)).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالُوا يَامُوسَىٰ } على صورة الاعتذار وإظهار العجز وعدم الإقدار، وما هي إلا من عدم تثبتهم على الإيمان، وعدم رسوخهم في مقتضياته، وعدم وثوقهم بنصر الله وإعانته بعدما أمرهم بالقتل والترحال، ووعدهم ما وعدهم: { إِنَّ فِيهَا قَوْماً جَبَّارِينَ } لا يتأتى مقاومتهم ومقاتلتهم { وَ } بالجملة: { إِنَّا لَن نَّدْخُلَهَا حَتَّىٰ يَخْرُجُواْ مِنْهَا } بقتالٍ أو غيره { فَإِن يَخْرُجُواْ مِنْهَا } على أي وجهٍ { فَإِنَّا دَاخِلُونَ } [المائدة: 22] إذ لا طاقة ولا قدرة لنا معهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n رُوِي أنهم لما سمعوا حالهم من النقباء بكوا، وقالوا: ليتنا متنا بمصر، تعالوا نجعل علينا رأسًا ينصرف بنا إلى مصر، ثم { قالوا يا موسى إن فيها قومًا جبارين } أقوياء متغالبين، لا طاقة لنا بمقاومتهم، وهم قوم من العمالقة، من بقية قوم عاد، { وإنا لن ندخلها حتى يخرجوا منها } بأمر سماوي، أو يُسلط عليهم من يخرجهم من غيرها، { فإن يخرجوا منها فإنا داخلون } فيها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:45",
      "similarity": 0.7114363524367782
    },
    {
      "verse": "19:14",
      "similarity": 0.6083146194483037
    },
    {
      "verse": "26:130",
      "similarity": 0.5339119848245701
    },
    {
      "verse": "19:32",
      "similarity": 0.5220497045610739
    },
    {
      "verse": "11:59",
      "similarity": 0.4938697052708258
    }
  ]
}