{
  "chapter": "المائدة",
  "text": "قال رجلان من الذين يخافون انعم الله عليهما ادخلوا۟ عليهم الباب فاذا دخلتموه فانكم غلبون وعلى الله فتوكلوا۟ ان كنتم مؤمنين",
  "translations": [
    {
      "translation": "Two men among those who were afraid, but whom Allah had blessed, said, 'Enter the gate against them! Once you have entered it, you will be victorious. Put your trust in Allah if you are muminun.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then two of the men who feared (God), and to whom God was gracious, said to them: \"Charge and rush the gate. If you enter, you will surely be victorious. And place your trust in God if you truly believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Two from among these who were frightened but upon whom Allah had bes-towed His favour said: 'Enter upon them through the gate - for if you do enter - you will be the victors. And put your trust in Allah if indeed you are men of faith.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Two God-fearing men on whom God had bestowed favors told them, \"Proceed through the gates and when you enter the city you will be victorious. Have trust in God if you are true believers\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So two men who were among those who feared Allah and whom Allah had favoured said, “Enter upon them by force, through the gate; if you enter the gate, victory will be yours; and depend only upon Allah, if you have faith.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Two men of those who feared (Allah and) on whom Allah had bestowed His grace said: \"Assault them through the gate; for when you are in, victory will be yours. And put your trust in Allah if you are believers indeed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Two men of those who feared, upon both of whom Allah had bestowed a favor, said: Enter upon them by the gate, for when you have entered it you shall surely be victorious, and on Allah should you rely if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said two men of those that feared God whom God had blessed, 'Enter against them the gate! When you enter it, you will be victors. Put you all your trust in God, if you are believers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then out spake two of those who feared (their Lord, men) unto whom Allah had been gracious: Enter in upon them by the gate, for if ye enter by it, lo! ye will be victorious. So put your trust (in Allah) if ye are indeed believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon two God-fearing men whom God had blessed said, \"Go into them through the gate -- for as soon as you enter, you shall surely be victorious! Put your trust in God if you are true believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon spake two men of those who feared and whom Allah had favoured; enter ye the gate against them, then as ye enter it ye are the over - and put your trust in Allah, if ye are indeed believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said two men from among those who were Godfearing and whom Allah had blessed: ‘Go at them by the gate! For once, you have entered it, you will be victors. Put your trust in Allah, should you be faithful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(But) among (their) Allah-fearing men were two on whom Allah had bestowed His grace: They said: \"Assault them at the (proper) Gate: when once ye are in, victory will be yours; But on Allah put your trust if ye have faith.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Two men of those who feared (Allah and) on whom Allah had bestowed His Grace [they were Yusha' (Joshua) and Kalab (Caleb)] said: \"Assault them through the gate, for when you are in, victory will be yours, and put your trust in Allah if you are believers indeed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon, two pious men whom Allah had favored said: 'Go in to them through the gate, and if you enter you shall surely be victorious. In Allah put your trust, if you are believers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Two men of those who feared, but whom God had blessed, said, “Go at them by the gate; and when you have entered it, you will prevail. And put your trust in God, if you are believers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said two men from those who feared [to disobey] upon whom Allah had bestowed favor, \"Enter upon them through the gate, for when you have entered it, you will be predominant. And upon Allah rely, if you should be believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:23] There said, to them, two men of those who feared, contravening God’s command, and these were Joshua and Caleb — who were from among the leaders that Moses dispatched to bring back news of those giants — to whom God had been gracious, by making them virtuous, for they concealed what they had discovered about the giants, telling only Moses, unlike the other leaders, who divulged the news, and so the people became cowardly. ‘Enter against them by the gate!, the gate of the town, and have no fear of them, for they are bodies without hearts. For if you enter by it, you will be victorious: the two [Joshua and Caleb] said this because they were certain of God’s assistance and the fulfilment of His promise. Put your trust in God, if you are believers’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then spoke two of those who feared) two men who feared the assassins (unto whom Allah had been gracious) by bestowing upon them the certainty of inspiration; these two men were Joshua ben Nun and Caleb ben Jephunneh: (Enter in upon them by the gate, for if ye enter by it, lo! ye will be victorious. So put your trust (in Allah)) that you will be victorious (if ye are indeed believers) it is also said that the two men who said this are two men from the assassins who feared Moses and with whom Allah was gracious by bestowing upon them belief in Allah's divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قال رجلان من الذين يخافون } كانا من النقباء الإثني عشر وهم: العقل النظري والعقل العلمي يخافون سوء عاقبة ملازمة الجسم ووبال العقوبة بهيآته المظلمة { أنعَمَ الله عليهماْ } بالهداية إلى الطريق المسقيم والدين القويم { ادْخلوا عليهم الباب } باب قرية القلب وهو التوكل بتجلي الأفعال كما أنّ باب قرية الروح هو الرضا { فإذا } دخلتم مقام التوكل الذي هو باب القرية { فإنكم غَالِبون } بخروجكم عن أفعالكم وعن أحوالكم وبكونكم فاعلين بالله، وإذا كان الحول والقوة بالله يهرب شيطان الوهم والتخيل والهوى والغضب منكم فغلبتم عليهم\n ويدلّ على أن الباب هو التوكل قوله: { وعلى الله فتوكلوا إن كنتم مؤمنين } بالحقيقة، إذ الإيمان بالغيبة عن المؤمن به أقل درجات حضور تجلي الأفعال { قالوا يا موسى } أي: أصروا على إبائهم وامتناعهم عن الدخول { فاذْهَب أنتَ وربكَ } أي: إن كنت نبيّاً فادفعهم عنا بقوة نفسك، واقمع الهوى، وتلك القوى فينا بلا رياضة ومجاهدة منا، وسل ربّك يدفعها عنا كما يقول الشطّار والوغود عند موعظتك إياهم، وزجرك وتهديدك لهم\n ادفع بهمتك عنا هذه الشقاوة إمّا استهزاء وعناداً وإما جدّاً واعتقاداً { إنّا ها هنا قاعدون } ملازمون مكاننا في مقام النفس، معتكفون على هوى نفوسنا ولذات أبداننا كما قالوا: حطاً سمقاثاً\n { قال فإنها محرّمة عليهم أربعين سنة يتِيهون في الأرض } هي مدة بقائهم في مقام النفس، أي: بقوا في تيع الطبيعة يتحيرون أربعين سنة إلى قرية القلب، فإنّ دخول مقام القلب مع استيلاء جبابرة صفات النفس عليه حرام ممتنع، ولهذا قال تعالى:\n\n[الأحقاف، الآية: 15]، فإنه وقت البلوغ الحقيقي\n وقيل في قصة التيه: إنهم كانوا يسيرون جادّين طول النهار في ستة فراسخ، فإذا أمسوا كانوا على المقام الذي ارتحلوا عنه، أي: كان سعيهم في تحصيل المناجح الجسمانية والمباغي البدنية المحصورة في الجهات الست ولم يخرجوا عن الجهات بالتجرد، فكانوا على المقام الأول لعدم توجههم إلى سمت القلب بطلب التجرد والتنزّه عن الهيآت البدنية والصفات النفسانية\n وكان ينزل من السماء بالليل عمود من نار يسيرون وينتفعون بضوئه، أي: ينزل عليهم نور عقل المعاش من سماء الروح فيهتدون به إلى مصالحهم\n وقيل: من نار لأنه عقل مشوب بالوهم ليس عقلاً صرفاً، وإلا لاهتدوا به إلى طريق القلب\n وأما الغمام والمنّ والسلوى فقد مرّ ذكرها وتأويلها وقيل: كان على كل مولود ولد في التيه قميص بقدر قامته يزيد بزيادته، يعنون به: لباس البدن والله أعلم\n وإن شئت أن تطبق القصة على حالك أوّلت موسى بالقلب وهارون بالروح، فإنه كان أخاه الأكبر، ولهذا قال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ رَجُلاَنِ مِنَ ٱلَّذِينَ يَخَافُونَ } من قهر الله وغضبه\n سيما بعد ورورد أمره\n إذ هما من أهل الوثوق بنصر الله وإنجاز وعده\n إذ { أَنْعَمَ ٱللَّهُ عَلَيْهِمَا } بالإيمان والإذعان وبإعطاء الحكمة والمعرفة: { ٱدْخُلُواْ عَلَيْهِمُ ٱلْبَابَ } أي: ضيقوا على عدوكم باب بلدهم\n وقربوهم إلى حيث يضطرون ويخنقون من جسامتهم\n وضيق مكانهم { فَإِذَا دَخَلْتُمُوهُ } على هذا الوجه { فَإِنَّكُمْ غَالِبُونَ } غانمون { وَعَلَى ٱللَّهِ فَتَوَكَّلُوۤاْ إِن كُنتُم مُّؤْمِنِينَ } [المائدة: 23]\n\n\n{ قَالُواْ } مستهزئين\n مصرحين بما تكنّ صدورهم من الكفر\n وعدم الوثوق والإخلاص",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال رجلان } كالب بن يوقنّا، ويوشع بن نون ـ ابن آخت موسى وخادمه ـ { من الذين يخافون } الله، أو رجلان من الجبابرة أسلما وصارا إلى موسى، وعليه قراءة { يُخافان } بضم الياء، { أنعم الله عليهما } بالإسلام والتثبت، قالا: { ادخلوا عليهم الباب } أي: باب المدينة، أي: باغِتوهم بالقتال، { فإذا دخلتموه فإنكم غالبون } أي: ظاهرون عليهم، فإنهم أجسام لا قلوب فيها\n يحتمل أن يكون علمهما بذلك من قِبل موسى، أو من قوله تعالى: { التي كتب الله لكم } ، أو من عادته سبحانه في نصر رسله وأوليائه، وما عَهِدا من صنيعه تعالى مع موسى من قهر أعدائه\n ثم قال: { وعلى الله فتوكلوا إن كنتم مؤمنين } به، ومصدقين لوعده",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "12:67",
      "similarity": 0.5044990244645406
    },
    {
      "verse": "37:116",
      "similarity": 0.3975256134418651
    },
    {
      "verse": "78:19",
      "similarity": 0.3941895740540837
    },
    {
      "verse": "54:10",
      "similarity": 0.37070127742430997
    },
    {
      "verse": "30:3",
      "similarity": 0.35794796946290136
    }
  ]
}