{
  "chapter": "المائدة",
  "text": "قالوا۟ يموسى انا لن ندخلها ابدا ما داموا۟ فيها فاذهب انت وربك فقتلا انا ههنا قعدون",
  "translations": [
    {
      "translation": "They said, 'We will never enter it, Musa, as long as they are there. So you and your Lord go and fight. We will stay sitting here.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Moses, we shall never, never enter so long as they are there. Go you and your Lord to fight them; we stay here.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nevertheless they said: 'O Moses! Never shall we enter it as long as they are there. Go forth, then, you and your Lord, and fight, both of you. As for us, we will sit here.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"(Moses), as long as they are in the land, we shall never go there. Go with your Lord to fight them but we shall stay where we are\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Moosa! We will never enter it whilst they are there, so you and your Lord go and fight – we shall remain seated here.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Musa! We shall never enter it as long as they are there. So go, you and your Lord, and fight you two, we are sitting right here.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Musa! we shall never enter it so long as they are in it; go therefore you and your Lord, then fight you both surely we will here sit down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Moses, we will never enter it so long as they are in it. Go forth, thou and thy Lord, and do battle; we will be sitting here.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Moses! We will never enter (the land) while they are in it. So go thou and thy Lord and fight! We will sit here.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"We will never enter it, Moses, as long as they are there. Go, you and your Lord, and fight, and we will stay here.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: O Musa! verily we shall never enter it so long as they remain therein; go thou and thy Lord, and fight ye twain, we shall remain here sitting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘O Moses, we will never enter it so long as they remain in it. Go ahead, you and your Lord, and fight! We will be sitting right here.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Moses! while they remain there, never shall we be able to enter, to the end of time. Go thou, and thy Lord, and fight ye two, while we sit here (and watch).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O Musa (Moses)! We shall never enter it as long as they are there. So go you and your Lord and fight you two, we are sitting right here.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: 'Moses, we will never go in so long as they are in it. Go, you and your Lord, to fight. We will stay here'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “O Moses, we will not enter it, ever, as long as they are in it. So go ahead, you and your Lord, and fight. We are staying right here.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"O Moses, indeed we will not enter it, ever, as long as they are within it; so go, you and your Lord, and fight. Indeed, we are remaining right here.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:24] They said, ‘O Moses, we will never enter it so long as they are in it. So go forth, you and your Lord, and fight, them, we will be sitting here’, away from the fighting.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They said: Moses! We will never enter (the land)) of the giant people (while they are in it. So go thou and thy Lord) go with your master Aaron (and fight) for your Lord will help you as He did against Pharaoh and his people! (We will sit here) and wait.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱذْهَبْ أَنتَ وَرَبُّكَ فَقَاتِلاۤ } معناهُ لَتُقاتلُ أَنتَ وَيُعينُكَ الله تَعالى وَلَيس الله تَعالى بِزَايلٍ وَلاَ آفِلٍ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {So you and your Lord fight. } Its meaning is that you will fight and Allah will help you. And Allah is not helpless and nor uninterested.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ومناقضة العهود والمواثيق: { يَامُوسَىۤ } لا تحمِّلنا ما لا طاقة لنا به { إِنَّا لَنْ نَّدْخُلَهَآ أَبَداً مَّا دَامُواْ فِيهَا } وإن شئت { فَٱذْهَبْ أَنتَ } أيها الداعي { وَرَبُّكَ } الذي دعوتناك إليه\n وادَّعيت الإعانة والانتصار منه { فَقَاتِلاۤ } مع العدو { إِنَّا هَاهُنَا قَاعِدُونَ } [المائدة: 24] منتظرون إلى أن يظهر الأمر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وأشنعُ منه قولهم: { فاذهب أنت وربك فقاتلا إنا هاهنا قاعدون } \n قالوه استهزاء بالله ورسوله وعدم مبالاة بهما\n وانظر فضيلة الأمة المحمدية\n وكمال أدبها مع نبيها ـ عليه الصلاة والسلام ـ فإن النبي صلى الله عليه وسلم قال يوم الحديبية لأصحابه حين صُد عن البيت: إني ذاهب بالهدي فناحِرُه عند البيت\n فقال المقداد بنُ الأسود: أما والله ما تقول لك كما قالت بنو إسرائيل لموسى: { فاذهب أنت وربك فقَاتلا إنا هاهنا قاعدون } \n ولكن نقاتل عن يمينك وشمالك\n ومن بين يديك من خلفك\n ولو خُضت البحر لخضناه معك\n ولو تسنَمت جبلاً لعلوناه معك\n ولو ذهبت بنا إلى بَرك الغماد لتبعناك\n فلما سمعها أصحاب النبي صلى الله عليه وسلم تابعوه على ذلك فَسُرَ صلى الله عليه وسلم وأشرق وجهه\n\nهـ\n ولما سمع موسى مقالة قومه له غضب\n ودعا ربه فقال: { ربّ إني لا أملك إلا نفسي وأخي } أي: لا أثق إلا بنفسي وأخي\n ولا قدرة لي على غيرهما\n والرجلان المذكوران\n وإن كانا موافقين له\n لكنه لم يوثق عليهما\n لما كبد من تلوّن قومه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:146",
      "similarity": 0.48361305325855525
    },
    {
      "verse": "52:19",
      "similarity": 0.4641042342914666
    },
    {
      "verse": "77:43",
      "similarity": 0.4641042342914666
    },
    {
      "verse": "69:35",
      "similarity": 0.45217876082016173
    },
    {
      "verse": "70:23",
      "similarity": 0.447854236553832
    }
  ]
}