{
  "chapter": "المائدة",
  "text": "قال رب انى لا املك الا نفسى واخى فافرق بيننا وبين القوم الفسقين",
  "translations": [
    {
      "translation": "He said, 'My Lord, I have no control over anyone but myself and my brother, so make a clear distinction between us and this deviant people.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said (Moses): \"O Lord, I have control over none but myself and my brother; so distinguish between us and these, the wicked people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon Moses said: 'My Lord! I have control over none but my own self and my brother; so distinguish between us and the transgressing people.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Moses) said, \"Lord, I can only speak for myself and my brother; keep us away from the evil-doers\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Moosa, “My Lord! I have no control except over myself and my brother, so keep us separated from the disobedient nation.” (Do not count us among them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Musa] said: \"O my Lord! I have power only over myself and my brother, so Ifruq us from the rebellious people!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! Surely I have no control (upon any) but my own self and my brother; therefore make a separation between us and the nation of transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'O my Lord, I rule no one except myself and my brother. So do Thou divide between us and the people of the ungodly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: My Lord! I have control of none but myself and my brother, so distinguish between us and the wrong-doing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses supplicated, \"Lord, I have power over none but myself and my brother; so separate us from the disobedient people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he: my Lord control not but myself and my brother, so decide Thou between us and this transgressing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘My Lord! I have no power over [anyone] except myself and my brother, so part us from the transgressing lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"O my Lord! I have power only over myself and my brother: so separate us from this rebellious people!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Musa (Moses)] said: \"O my Lord! I have power only over myself and my brother, so separate us from the people who are the Fasiqun (rebellious and disobedient to Allah)!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'Lord, I have none but myself and my brother. Set a barrier between us and the wicked people'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “My Lord! I have control only over myself and my brother, so separate between us and between the wicked people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Moses] said, \"My Lord, indeed I do not possess except myself and my brother, so part us from the defiantly disobedient people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:25] He, Moses, thereupon, said, ‘My Lord, I control none but myself and my brother, and I control no one else to be able to force them to obedience. So separate, distinguish, us from the wicked folk’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said: My Lord!) Moses said: my Lord! (I have control of none but myself and my brother, so distinguish between us) judge between us (and the wrong-doing folk) the contravening folk.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱفْرُقْ بَيْنَنَا } معناهُ مَيِّز\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } موسى آيساً، متحيزاً، باثاً شكواه مع ربه: { رَبِّ إِنِّي لاۤ أَمْلِكُ } ولا أثق لامتثال أمرك { إِلاَّ نَفْسِي وَأَخِي فَٱفْرُقْ بَيْنَنَا وَبَيْنَ ٱلْقَوْمِ ٱلْفَاسِقِينَ } [المائدة: 25] الخارجين عن مقتضى أمرك، التاركين الامتثال به؛ من عدم وثوقهم بإعانتك وتأييدك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولما سمع موسى مقالة قومه له غضب، ودعا ربه فقال: { ربّ إني لا أملك إلا نفسي وأخي } أي: لا أثق إلا بنفسي وأخي، ولا قدرة لي على غيرهما، والرجلان المذكوران، وإن كانا موافقين له، لكنه لم يوثق عليهما، لما كبد من تلوّن قومه، ثم دعا عليهم فقال: { فافرق بيننا وبين القوم الفاسقين } أي: احكم بيننا وبينهم بما يستحق كل واحد منا ومنهم، أو بالتبعيد بيننا وبينهم، وتخليصنا من صحبتهم\n رُوِي أنه لما دعا عليهم ظهر فوقهم الغمام، وأوحى الله إليه: يا موسى إلى متى يعصي هذا الشعب؟ لأُهلكنهم جميعًا، فشفع فيهم موسى عليه السلام فقال الله تعالى له: قد غفرت لهم بشفاعتك، ولكن بعد ما سَميتَهم فاسقين، ودعوت عليهم، بي حلفت لأحرمنَّ عليهم دخول الأرض المقدسة، وذلك قوله تعالى: { قال فإنها محرمة عليهم أربعين سنة يتيهون في الأرض } يحتمل أن يكون \" أربعين \" متعلقًا بمحرمة، فيكون التحريم عليهم مؤقتًا غير مؤبد فيوافق ظاهر قوله: { التي كتب الله لكم }\n ويؤيد هذا ما رُوِي أن موسى ـ عليه السلام ـ لما خرج من التيه، سار بمن بقي معه من بني إسرائيل، ويوشع على مقدمته، ففتح بيت المقدس، فبقي فيها ما شاء الله، ثم قبض",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:99",
      "similarity": 0.4527152732911428
    },
    {
      "verse": "3:82",
      "similarity": 0.40395385556150976
    },
    {
      "verse": "77:4",
      "similarity": 0.39351313877538113
    },
    {
      "verse": "59:19",
      "similarity": 0.3904010654918018
    },
    {
      "verse": "98:4",
      "similarity": 0.390036848631435
    }
  ]
}