{
  "chapter": "المائدة",
  "text": "قال فانها محرمة عليهم اربعين سنة يتيهون فى الارض فلا تاس على القوم الفسقين",
  "translations": [
    {
      "translation": "He said, 'The land will be forbidden to them for forty years during which they will wander aimlessly about the earth. Do not waste grief on this deviant people.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And God) said: \"Then verily this land is forbidden them for forty years, and they shall wander perplexed over the earth. So do not grieve for these, the wicked people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: 'This land will now be forbidden to them for forty years and they will remain wandering about on the earth. Do not grieve over the condition of these transgressing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord said, \"The land will be prohibited to them for forty years (during all such time) they will wander in the land. Do not feel sad for the evil-doing people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Allah, “The (holy) land is therefore forbidden for them for forty years; they will wander in the earth; so do not grieve for these disobedient people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"Therefore it is forbidden to them for forty years; in distraction they will wander through the land. So do not greive for the rebellious people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: So it shall surely be forbidden to them for forty years, they shall wander about in the land, therefore do not grieve for the nation of transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said He, 'Then it shall be forbidden them for forty years, while they are wandering in the earth; so grieve not for the people of the ungodly.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Their Lord) said: For this the land will surely be forbidden them for forty years that they will wander in the earth, bewildered. So grieve not over the wrongdoing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God said, \"The land is forbidden to them for forty years, while they wander around the earth, bewildered; do not grieve over these wicked people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said He: verily then it is forbidden unto them for forty years, while they shall wander about in the earth, so mourn not thou over this transgressing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘It shall be forbidden them for forty years: they shall wander about in the earth. So do not grieve for the transgressing lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: \"Therefore will the land be out of their reach for forty years: In distraction will they wander through the land: But sorrow thou not over these rebellious people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"Therefore it (this holy land) is forbidden to them for forty years; in distraction they will wander through the land. So be not sorrowful over the people who are the Fasiqun (rebellious and disobedient to Allah).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'They shall be forbidden this land for forty years, during which time they shall wander (homeless) on the earth. Do not grieve for these wicked people.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “It is forbidden for them for forty years. They will wander aimlessly in the land. So do not grieve over the defiant people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah] said, \"Then indeed, it is forbidden to them for forty years [in which] they will wander throughout the land. So do not grieve over the defiantly disobedient people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:26] He, God, exalted be He, said, to him: ‘Then it, the Holy Land, shall be forbidden them, to enter, for forty years; they shall wander lost, bewildered, in the land — according to Ibn ‘Abbās this [land] was about nine parasangs [sc. 30 miles]; so do not grieve for the wicked folk’. It is reported that they would travel throughout the night earnestly, but in the morning would find themselves back where they had started. And they would travel all day, with the same result, until they all perished, except those under twenty years of age. It is said that they numbered 600,000. Moses and Aaron died in the wilderness, and this was a mercy for them, and a chastisement for those others. When Moses was on the verge of death, he asked his Lord to bring him close to the Holy Land, to within a stone’s throw, and He did, as related in hadīth. Joshua became a prophet sometime after his fortieth year and he was commanded to fight against the giants. So he sallied forth with those that remained by his side and he fought against them; it was a Friday and the sun stopped for him for an hour, until he had finished with fighting them. Ahmad [b. Hanbal] reported in his Musnad the [following] hadīth, ‘The sun was never detained for any human, except for Joshua during those days in which he marched towards the Holy House [of Jerusalem]’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Their Lord) said) to Moses: (For this the land will surely be forbidden them) i.e. to enter it, after you called them wrong-doing folk (for forty years that they will wander in the earth, bewildered) they will be bewildered in the wilderness, confined in an area of seven parasangs, unable to get out of it or be guided to the right way. (So grieve not over) do not be saddened about (the wrong-doing folk).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَتِيهُونَ فِي ٱلأَرْضِ } معناهُ يَحُورُونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"They will roam the earth,\" means they will wander.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وكان حالهم وصلاحهم معلومة عنده سبحانه { قَالَ فَإِنَّهَا } أي: الأرض المقدسة { مُحَرَّمَةٌ عَلَيْهِمْ } مدة { أَرْبَعِينَ سَنَةً } خصّ هذا العدد\n لأنهم لما أعادوا نفوسهم بعدم امتثال أمر الله\n والاستهزاء به وبرسوله إلى ما هم عليه قبل إيمانهم\n والإيمان ماي كمل غالباً إلا بعد الأربعين\n لذلك خصَّ هذه المدة\n لمجازاتهم ومجاهداتهم\n ليكملوا الإيمان\n وهم بعدما ارتدوا من الشام وتوجهوا إلى المصر { يَتِيهُونَ فِي ٱلأَرْضِ } المقدسة بستة فراسخ تائهين\n حائرين\n مذبذبين لا إلى مصر وإلا إلى الشام في تلك المدة\n وموسى سارٍ معهم فيها\n يرشدهم إلى أن يخرجهم من الضلال الصوري والمعنوي\n\n\nثم لمَّا رأى موسى اضطراب قومه وحزنهم وقلقهم واضطرارهم\n رحمهم\n وندم عمَّا دعا عليهم\n على مقتضى شفقة النبوة ومرحمته\n لذلك رد الله عليه بقوله: { فَلاَ تَأْسَ } أي: لا تحزن أيها النبي الشاكي { عَلَى ٱلْقَوْمِ ٱلْفَاسِقِينَ } [المائدة: 26] الخارجين عن مقتضى التصديق والإيمان\n\n\n{ وَٱتْلُ } يا أكمل الرسل { عَلَيْهِمْ } أي: على من اتبعك من المؤمنين { نَبَأَ ٱبْنَيْ ءَادَمَ } أي: قصة قابيل وهابيل واختلافهما ونزاعهما وقربانهما\n وقتل قابيل هاببيل\n ليعتبروا وينتبهوا من قصتهما على ما هو الأقول من السبيل\n والأليق بحال المؤمن من حسن المعاشرة والمصاحبة مع الأخوان\n ورعاية الغبطة\n والتصبر على البلية والمحنة\n وإن أدى إلى بذل المجهة والإخلاص مع الله في جميع الأحوال",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ويحتمل أن يكون \" أربعين \" متعلقًا ب { يتيهون } \n فيكون التحريم مؤبدًا\n وعلى هذا لم يبق أحد ممن دخل التيه إلا يوشع وكالب\n ولم يدخل الأرض المقدسة أحد ممن قال له: { اذهب أنت وربك\n\n\n } \n بل كلهم هلكوا في التيه\n وإنما دخلها أشياعهم\n رُوِي أن موسى عليه السلام لما حضره الموت في التيه أخبرهم بأن يوشع بعده نبي\n وأن الله أمره بقتال الجبابرة\n فسار بهم يوشع\n وقاتل الجبابرة وكان القتال يوم الجمعة\n فبقيت منهم بقية\n وكادت الشمس أن تغرب ليلة السبت\n فخشي أن يعجزوه\n فقال: اللهم اردد الشمس عليَّ\n وقال للشمس: إنك في طاعة الله وأنا في طاعته\n فوقفت مثل يوم حتى قتلهم\n ثم قتل ملوك الأرمانيين\n وقتل مِن ملوك الشام أحدًا وثلاثين ملكًا\n فصارت الشام كلها لبني إسرائيل\n وفرَّق عماله في تواحيها\n وبقيت بنو إسرائيل في التيه أربعين سنة يتيهون في الأرض في ستة فراسخ\n بين فلسطين وأيلة\n متحيرين\n يسيرون من الصباح إلى السماء جادين في السير\n فإذا هم بحيث ارتحلوا عنه\n ثم يسيرون بالليل كذلك فيصبحون حيث ارتحلوا\n وكان الغمام يظلهم من الشمس وعمود من نور يطلع بالليل فيضيء لهم\n وكان طعامهم المن والسلوى\n وماؤهم من الحجر الذي يحمله موسى\n واختلف في الكسوة\n فقيل: أبقى الله كسوتهم معجزة لموسى\n وقيل: كساهم مثل الظفر\n\nوالأكثر أن موسى وهارون كانا معهم زيادة في درجاتهما\n وكان عقوبة لقومهما وأنهما ماتا فيه\n مات هارون أولاً ودفنه أخوه في كهف\n وقيل: رُفع على سرير في قبة\n ثم مات موسى ـ عليه السلام ـ ودفن بقرب من الأرض المقدسة\n رمية بحجر\n كما في الحديث\n ثم دخل يوشع الأرض المقدسة بعد ثلاثة أشهر\n والله تعالى أعلم\n ثم قال تعالى لموسى عليه السلام: { فلا تأس } أي: لا تخزن\n { على القوم الفاسقين } \n خاطبه الحق تعالى بذلك لمَّا ندم على الدعاء عليهم\n فقال له: أنهم أحق بذلك لفسقهم وعصيانهم\n الإشارة: يقول الحقّ جلّ جلاله للمتوجهين إليه من المريدين: ادخلوا الحضرة المقدسة التي كتب الله لكم\n إن دمتم على جهاد أنفسكم\n وصدقتم في طلب ربكم\n وبقيتم في تربية شيوخكم\n ولا ترتدوا على أدباركم بالرجوع عن صحبة شيوخكم من الملل مع طول الأمل\n قتنقلبوا خاسرين\n فإن حضرتي محفوفة بالمكاره\n والطريقة الموصلة إليها مرصودة للقواطع والعوائق\n فإن كان ممن لم يكتب له فيها نصيب\n قال: لن ندخلها أبدًا ما دام القواطع فيها\n ورجع على عقبيه\n يتيه في مهامه شكوكه وأوهامه\n وإن كان ممن سبقت له العناية وحقت به الرعاية قال: { ادخلوا عليهم الباب فإذا دخلتموه فإنكم غالبون وعلى الله فتوكلوا إن كنتم مؤمنين } \n فيبادر إلى قتل نفسه\n من غير تأن ولا خوف ولا فزع\n فحضرة التحقيق لا ينالها إلا الشجعان\n ولا يسكنها إلا الأكابر من أهل العرفان وإلى ذلك أشار صاحب العينية بقوله:\nوقال الورتجبي في قوله تعالى: { لا أملك إلا نفسي وأخي }: من بلغ عين التمكين ملك نفسه وملك نفوس المريدين لأنه عرفها بمعرفة الله\n وقمعها من الله بسلطان سائس قاهر\n من نظر إليه يفزع من الله\n لا يطيق عصيانه ظاهرًا وباطنًا\n فأخبر عليه السلام عن محلّ تمكينه وقدرته على نفسه ونفس أخيه\n وأعلمنا أن بينهما اتحادًا\n بحيث إنه إذا حكم على نفسه صار نفس أخيه مطمئنة طائعة لله بالانفعال\n قال صلى الله عليه وسلم:\n \" المؤمنون كنفس واحدة \"\n \nثم تكلم الحقّ جلّ جلاله على بقية حفظ الأبدان\n فبيَّن أول مَن سَنَّ القتل ووبَال من تَبعِه\n فقال: { وَٱتْلُ عَلَيْهِمْ نَبَأَ ٱبْنَيْ ءَادَمَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:21",
      "similarity": 0.19287326805761182
    },
    {
      "verse": "60:6",
      "similarity": 0.1912781331814759
    },
    {
      "verse": "7:93",
      "similarity": 0.18749261636763184
    },
    {
      "verse": "5:68",
      "similarity": 0.1762367834522939
    },
    {
      "verse": "60:4",
      "similarity": 0.15054829859983332
    }
  ]
}