{
  "chapter": "المائدة",
  "text": "واتل عليهم نبا ابنى ءادم بالحق اذ قربا قربانا فتقبل من احدهما ولم يتقبل من الءاخر قال لاقتلنك قال انما يتقبل الله من المتقين",
  "translations": [
    {
      "translation": "Recite to them the true report of Adam's two sons when they offered a sacrifice and it was accepted from one of them but not accepted from the other. The one said, 'I shall kill you.' The other said, 'Allah only accepts from people who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Narrate to them exactly the tale of the two sons of Adam. When each of them offered a sacrifice (to God), that of one was accepted, and that of the other was not. Said (the one): \"I will murder you,\" and the other replied: \"God only accepts from those who are upright and preserve themselves from evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Narrate to them in all truth the story of the two sons of Adam. When they made an offering and it was accepted from one of them and was not accepted from the other, the latter said: 'I will surely kill you.' Thereupon the former said: 'Allah accepts offerings only from the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad) tell them the true story of the two sons of Adam (Abel and Cain). Each one of them offered a sacrifice. God accepted the sacrifice of one of them (Abel) but not that of the other (Cain) who then said to his brother, \"I shall certainly kill you.\" (Abel) replied, \"God only accepts the offerings of the pious ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite to them the true tale of the two sons of Adam; when both of them offered a sacrifice each – hence the sacrifice of one was accepted and not accepted from the other; he (the other) said, “I swear I will kill you”; he answered, “Allah accepts only from the pious.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite to them the story of the two sons of Adam in truth; when each offered a sacrifice, it was accepted from the one but not from the other. The latter said to the former: \"I will surely, kill you.\" The former said: \"Verily, Allah accepts only from those who have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And relate to them the story of the two sons of Adam with truth when they both offered an offering, but it was accepted from one of them and was not accepted from the other. He said: I will most certainly slay you. (The other) said: Allah only accepts from those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite thou to them the story of the two sons of Adam truthfully, when they offered a sacrifice, and it was accepted of one of them, and not accepted of the other. 'I will surely slay thee,' said one. 'God accepts only of the godfearing,' said the other.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But recite unto them with truth the tale of the two sons of Adam, how they offered each a sacrifice, and it was accepted from the one of them and it was not accepted from the other. (The one) said: I will surely kill thee. (The other) answered: Allah accepteth only from those who ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Relate to them, the true story of the two sons of Adam. When they both presented an offering, it was accepted from one of them and not from the other. The latter said, \"I shall kill you!\" The former said, \"God accepts [things] only from the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And rehearse thou unto them with truth the tale of the two sons of Adam, when the twain offered an offering, and it was accepted from one of them, and was not accepted from the other; he said: surely I will slay thee. Said the other: Allah accepteth only from the God- fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Relate to them truly the account of Adam’s two sons. When the two of them offered an offering, it was accepted from one of them and not accepted from the other. [One of them] said, ‘Surely I will kill you.’ [The other one] said, ‘Allah accepts only from the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite to them the truth of the story of the two sons of Adam. Behold! they each presented a sacrifice (to Allah): It was accepted from one, but not from the other. Said the latter: \"Be sure I will slay thee.\" \"Surely,\" said the former, \"Allah doth accept of the sacrifice of those who are righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (O Muhammad SAW) recite to them (the Jews) the story of the two sons of Adam [Habil (Abel) and Qabil (Cain)] in truth; when each offered a sacrifice (to Allah), it was accepted from the one but not from the other. The latter said to the former: \"I will surely kill you.\" The former said: \"Verily, Allah accepts only from those who are Al-Muttaqun (the pious - see V. 2:2).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recite to them in all truth the news of Adam's two sons; how they each made an offering, and how the offering of the one was accepted while that of the other was not. He said: 'I will surely kill you' (The other) said: 'Allah accepts only from the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And relate to them the true story of Adam's two sons: when they offered an offering, and it was accepted from one of them, but it was not accepted from the other. He Said, “I will kill you.” He Said, “God accepts only from the righteous.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recite to them the story of Adam's two sons, in truth, when they both offered a sacrifice [to Allah], and it was accepted from one of them but was not accepted from the other. Said [the latter], \"I will surely kill you.\" Said [the former], \"Indeed, Allah only accepts from the righteous [who fear Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:27] And recite, O Muhammad (s), to them, your people, the story, the tale, of the two sons of Adam, Abel and Cain, truthfully (bi’l-haqq is semantically connected to utlu, ‘recite’), how they each offered a sacrifice, to God, which in Abel’s case was a ram, and in Cain’s, some green crops, and it was accepted from one of them, namely, from Abel, when a fire came down from the heaven and consumed his offering, and not accepted from the other, that is, from Cain, and so he became furious and kept secret his envy until Adam left on pilgrimage. He said, to him, ‘I will surely slay you,’, and the other said, ‘Why?’, to which the first replied, ‘Because only your offering was accepted’. The other said, ‘God accepts only from the God-fearing’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But recite unto them) Muhammad (with truth) with the Qur'an (the tale of the two sons of Adam, how they offered each a sacrifice, and it was accepted from the one) Abel (of them and it was not accepted from the other) Cain. ((The one)) Cain (said) to Abel: (I will surely kill thee) Abel. ((The other) answered) why? Because Allah has accepted your offering and rejected mine. And Abel said: (Allah accepteth only from those who ward off (evil)) the sincere in their speech and action, whose hearts are pure, and your heart is not pure.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱتْلُ } يا أكمل الرسل { عَلَيْهِمْ } أي: على من اتبعك من المؤمنين { نَبَأَ ٱبْنَيْ ءَادَمَ } أي: قصة قابيل وهابيل واختلافهما ونزاعهما وقربانهما، وقتل قابيل هاببيل، ليعتبروا وينتبهوا من قصتهما على ما هو الأقول من السبيل، والأليق بحال المؤمن من حسن المعاشرة والمصاحبة مع الأخوان، ورعاية الغبطة، والتصبر على البلية والمحنة، وإن أدى إلى بذل المجهة والإخلاص مع الله في جميع الأحوال، تلاوة متلبسة { بِٱلْحَقِّ } مطابقة للواقع موافقة لما في الكتب السالفة\n\n\n\n\nوذلك أنهما تنازعا في تزويج كل منهما توءمة الآخر على ما هو شرع أبيهم، فقال قابيل: توءمتي أحسن صورة من توءمتك، أنا أحق بتزويجها منك، فترافعا إلى أبيهما فأمرهما بالقربان المقرب إلى الله، اذكر { إِذْ قَرَّبَا قُرْبَاناً } بإذن أبيهما، كل واحد منهما على مقتضى إخلاصهما مع الله، وكان قابيل صاحب زرع، قرب مقداراً من أردأ قمحه، وهابيل صاحب ضرع، قرب شاة سمينة حسناء { فَتُقُبِّلَ مِن أَحَدِهِمَا } وهو هابيل { وَلَمْ يُتَقَبَّلْ مِنَ ٱلآخَرِ }\n\n\n\n\nوعلامة القبول حينئذٍ أنه تنزل نار من السماء، وتأكل ما يتقربون به، فأخذا قربانهما وذهبا إلى جبل فطرحها عليه، وانتظرا القبول، فنزلت نار فأكلت قربان هابيل، ولم تأكل قربان أخيه، فاشتد سخطه وعضبه على أخيه، وزاد حسده بقبول الله قربانه { قَالَ لأَقْتُلَنَّكَ } البتة؛ إذ ظهر مزيّتك عليّ، وفضلك عند الله منّي، وبذلك تفتخفر وتتفوق عليّ بين الناس { قَالَ } هابيل: يا أخي، ما لي في هذا التقرب إلا الإخلاص والرجوع إلى الله والإطاعة والانقياد لأمره، والاجتناب والتحرز عن سخطه وغضبه بلا غرض نفساني وميل شهواني، فتقبل مني بفضله ولطفه { إِنَّمَا يَتَقَبَّلُ ٱللَّهُ } أي: ما يتقبل المطلع لسرائر عباده أعمالهم التي يتقربون بها إلى الله إلا { مِنَ ٱلْمُتَّقِينَ } [المائدة: 27] المتقربين إليه بين طرفين الخوف والرجاء، المخلصين فيما جاءوا به خالصاً لوجهه الكريم، بلا ميل إلى ما تهوى نفوسهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الضمير في { عليهم }: لبني إسرائيل لتقدم شأنهم، ولاختصاصهم بعلم قصة بني ابني آدم، ولإقامة الحجة عليهم بهمهم ببسط اليد إلى النبي صلى الله عليه وسلم\n يقول الحقّ جلّ جلاله: { واتل عليهم } أي: على بني إسرائيل إذ الكلام كان معهم، أو على جميع الأمة، أو على جميع الناس، إذ هو أول الكلام على بقية حفظ الأبدان ـ { نبأ ابني آدم } وهو قابيل وهابيل { بالحق } أي: تلاوة ملتبسة بالحق، أو نبأ ملتبسًا بالحق موافقًا لما في كتب الأوائل\n { إذ قرّبا قربانًا فتُقبل من أحدهما } وهو هابيل، { ولم يتُقبل من الآخر } وهو قابيل، وسبب تقريبهما القربان أن آدم ـ عليه السلام ـ كان يُولد له من حواء توأمان في كل بطن: غلام وجارية، إلا شيتًا، فإنه ولد منفردًا، وكان جميع ما ولدته حواء أربعين، بين ذكر وأنثى، في عشرين بطنًا، أولهم قابيل، وتوأمته أقليما، وآخرهم عبد المغيث، ثم بارك الله في نسل آدم\n قال ابن عباس: لم يمت آدم حتى بلغ ولده، وولد ولده، أربعين ألفًا، ورأى فيهم الزنا وشُرب الخمر والفساد، وكان غشيان آدم لحواء بعد مهبطهما إلى الأرض، وقال ابن إسحق عن بعض العلماء بالكتاب الأول: إن آدم كان يغشى حواء في الجنة، قبل أن يصيب الخطيئة، فحملت في الجنة بقابيل وتوأمته، ولم تجد عليهما وحمًا ولا غيره، وحملت في الأرض بهابيل وتوأمته، فوجدت عليهما الوحم والوصب والطلق والدم\n وكان آدم إذا كبر ولده يزوج غلام هذا البطن بجارية بطن آخر، فكان الرجل يتزوج أيّ أخواته شاء إلا تَوأمَته، لأنه لم يكن نساء يومئٍذ، فأمر الله تعالى آدم أن يزوج قابيل لَودَاء توأمة هابيل، وينكح هابيل أقليما أخت قابيل، وكانت أحسن الناس، فرضي هابيل وسخط قابيل، وقال: أختي أحسن، وهي من ولادة الجنة، وأنا أحق بها، فقال له أبوه: لا تحل لك، فأبى، فقال لهما آدم: قربًا قربانًا، فأيكما قُبل قربانه فهو أحق بها\n وكان قابيل صاحب زرع، فقرَّب حِملاً من زرع رديء، وأضمر في نفسه: لا أُبالي قُبل أو لا، لا يتزوج أختي أبدًا، وكان هابيل صاحب غنم، فقرّب أحسن كبش عنده، وأضمر في نفسه الرضا لله تعالى، وكانت العادة حينئٍذ أن تنزل نارٌ من السماء فتأكل القربان المقبول، وإن لم يقبل لم تنزل، فنزلت نار من السماء فأكلت قربان هابيل، وتركت قربان قابيل، فحسده، وقال له: { لأقتلنك } ، حسدًا على تقبل قربانه دونه، فقال له أخوه: { إنما يتقبل الله من المتقين } الكفر، أي: إنما أُوتيت من قبل نفسك بترك التقوى، لا من قِبلي، فِلمَ تقتلني؟  قال البيضاوي: وفيه إشارة إلى أن الحاسد ينبغي أن يرى حرمانه من تقصيره، ويجتهد في تحصيل ما به صار المحسود محظوظًا، لا في إزالة حظه، فإن ذلك مما يضره ولا ينفعه، وأن الطاعة لا تقبل إلا من مؤمن متقي\n\n\nهـ\n وفيه نظر: فإن تقوى المعاصي ليست شرطًا في قبول الأعمال بإجماع أهل السنة، إلا أن يحمل على تقوى الرياء والعجب\n انظر الحاشية\n ثم قال له أخوه هابيل: { لئن بسطت إليَّ يدك لتقتلني ما أنا بباسطٍ يَدِيَ إليك لأقتلك إني أخاف الله ربّ العالمين } أي: لئن بدأتني بالقتل لم أبدأك به، أو لم أدفعك عني، وهل تركه للدفع تورع، وهو الظاهر أو كان واجبًا عندهم، وهو قول مجاهد؟ وأما في شرعنا: فيجوز الدفع، بل يجب، قاله ابن جزي\n وقال البيضاوي: قيل: كان هابيل أقوى منه، فتحرج عن قتله، واستسلم له خوفًا من الله، لأن الدفع لم يُبح بعدُ، أو تحريًا لِمَا هو الأفضل\n قال صلى الله عليه وسلم:\n\n \" كُن عبدَ الله المقتُول، ولا تكُن عبدَ الله القاتل \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:31",
      "similarity": 0.44690989155103006
    },
    {
      "verse": "7:35",
      "similarity": 0.42006366864160505
    },
    {
      "verse": "36:60",
      "similarity": 0.4054385638971208
    },
    {
      "verse": "2:37",
      "similarity": 0.39202832078695055
    },
    {
      "verse": "2:33",
      "similarity": 0.34666421168630523
    }
  ]
}