{
  "chapter": "المائدة",
  "text": "لئنۢ بسطت الى يدك لتقتلنى ما انا۠ بباسط يدى اليك لاقتلك انى اخاف الله رب العلمين",
  "translations": [
    {
      "translation": "Even if you do raise your hand against me to kill me, I am not going to raise my hand against you to kill you. Truly I fear Allah, the Lord of all the worlds.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you raise your hand to kill me, I will raise not mine to kill you, for I fear God, the Lord of all the worlds;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if you stretch forth your hand against me to kill, I will not stretch forth my hand to kill you. Surely, I fear Allah, the Lord of the entire universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if you try to kill me, I certainly shall not try to kill you. I have fear of God, the Lord of the creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Indeed, if you do extend your hand against me to kill me, I will not extend my hand against you to kill you; I fear Allah, the Lord Of The Creation.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do stretch your hand against me to kill me, I shall never stretch my hand against you to kill you, for I fear Allah; the Lord of all that exists.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you will stretch forth your hand towards me to slay me, I am not one to stretch forth my hand towards you to slay you surely I fear Allah, the Lord of the worlds:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet if thou stretchest out thy hand against me, to slay me, I will not stretch out my hand against thee, to slay thee; I fear God, the Lord of all Being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if thou stretch out thy hand against me to kill me, I shall not stretch out my hand against thee to kill thee, lo! I fear Allah, the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you raise your hand to kill me, I will not raise mine to kill you. I fear God, the Lord of the Universe,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou stretchest forth thine hand against me to slay me, I shall not be stretching forth my hand against thee to slay thee, verily I fear Allah, the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if you extend your hand toward me to kill me, I will not extend my hand toward you to kill you. Indeed, I fear Allah, the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou dost stretch thy hand against me, to slay me, it is not for me to stretch my hand against thee to slay thee: for I do fear Allah, the cherisher of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do stretch your hand against me to kill me, I shall never stretch my hand against you to kill you, for I fear Allah; the Lord of the 'Alamin (mankind, jinns, and all that exists).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you stretch your hand to kill me, I shall not stretch mine to kill you; for I fear Allah, the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“If you extend your hand to kill me, I will not extend my hand to kill you; for I fear God, Lord of the Worlds.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you should raise your hand against me to kill me - I shall not raise my hand against you to kill you. Indeed, I fear Allah, Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:28] ‘Yet if (la-in, the lām is for oaths) you extend your hand against me to slay me, I will not extend my hand against you to slay you; I fear God, the Lord of the Worlds, in slaying you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Even if thou stretch out thy hand against me to kill me) wrongfully, (I shall not stretch out my hand against thee to kill you) wrongfully, (lo! I fear Allah, the Lord of the Worlds) if I were to kill you wrongfully.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ما أنا بباسط يدي إليكَ لأقتلك } لأني لا أبطل أعمالك التي هي شديدة في مواضعها من المحسوسات ولا أقطع عنك حياتك التي هي مدد النفس والهوى ولا أمنعك عن فعلك الخاص بك إذ العقل يعلم أنّ المصالح الجزئية وأحكام المحسوسات والمعاني الجزئية المعلقة بها وترتيب أسباب المعاش كلها لا تحصل ولا تتيسر إلا بالوهم ولولا الرجاء وحصول الأماني والآمال الصادرة عن الوهم لم يتيسر لأحد ما يتمعش به { إني أخاف الله ربّ العالمين } لأني أعرفه\n وقال:\n[فاطر\n الآية: 28] واعلم بأنه إنما خلقك لشأن وأوجدك لحكمة\n فلا أتعرّض له في ذلك { إني أريد أن تبوء } بإثم قتلي وإثم قتلك من الآراء الباطلة والتصوّرات الفاسدة التي لم يتقبل قربانك لأجلها { فتكون من أصحاب } نار الحجبة والحرمان { وذلك جزاء الظالمين } الواضعين الأشياء في غير موضعها كوضعك الأحكام الحسيّة في المعقولات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أقسم هابيل بعدما أوعده قابيل القتل: والله { لَئِن بَسَطتَ إِلَيَّ يَدَكَ } من إفراط غيظك وغضبك\n وشؤم إمارة نفسك { لِتَقْتُلَنِي } ظلماً بلا رخصة شرعية\n بل محض عناد ومكابرة { مَآ أَنَاْ بِبَاسِطٍ يَدِيَ إِلَيْكَ } لدفع صولتك عن نفسي\n أو { لأَقْتُلَكَ } على مقتضى أمارتي { إِنِّيۤ أَخَافُ ٱللَّهَ رَبَّ ٱلْعَالَمِينَ } [المائدة: 28] من تخريب\n لمجرد دفع الصائل ولا أخاف على نفسي من القتل\n إذا الشهداء المقتولون ظلماً أحياء عند ربهم يُرزقون\n فرحين بما آتاهم الله من فضله\n\n\n{ إِنِّيۤ } من غاية إشافقي وإعطافي معك يا أخي { أُرِيدُ أَن تَبُوءَ } أي: لأن تذهب وترجع إلى الله { بِإِثْمِي } أي: بإثمك المنسوب إلى قتلي { وَإِثْمِكَ } الذي كنت فيه { فَتَكُونَ مِنْ أَصْحَابِ ٱلنَّارِ } عند الله بهذا الظلم { وَذَلِكَ جَزَآءُ ٱلظَّالِمِينَ } [المائدة: 29] عنده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nوإنما قال: { ما أنا بباسط } في جواب { لئن بسطت } للتبري من هذا الفعل الشنيع\n والتحرز من أن يوصف به\n ولذلك أكد النفي بالباء\n هـ\n ثم قال له هابيل: { إني أريد أن تبوء بإثمي وإثمك فتكون من أصحاب النار } أي: إني أريد بالاستسلام وعدم الدفع أن تنقلب إلى الله ملتبسًا بإثمي\n أي: حاملاً لإثمي لو بسطت إليك يدي\n وإثمك ببسطك بيدك إليّ\n ونحوه قوله صلى الله عليه وسلم:\n \" المُستَبَّان ما قَالاَ فَعَلى البادِىء منهما مَا لَم يَعتَدِ المَظلُومُ \" \nأو بإثم قتلى وبإثمك الذي لم يتقبل من أجله قربانك\n أو بسائر ذنوبي فتحملها عني بسبب قتلك لي فإن الظالم يجعل عليه يوم القيامة ذنوب المظلوم ثم يطرح في النار\n ولذلك قال: { وذلك جزاء الظالمين } \n يحتمل أن يكون من كلام هابيل\n أو استئناف من كلام الله تعالى\n أي: جزاؤهم يوم القيامة أن يحملوا أوزار المظلومين\n ثم يطرحون في النار\n كما في حديث المفلس\n ولم يرد هابيل بقوله: { إني أريد } \n أنه يُحب معصية أخيه وشقاوته\n بل قصد بذلك الكلام أنه إن كان القتل لا محالة واقعًا فأريد أن يكون لك لا لي\n والمقصود بالذات: ألا يكون له\n لا أن يكون لأخيه\n ويجوز أن يكون المراد بالإثم عقوبته\n وإرادة عقاب العاصي جائزة\n قاله البيضاوي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "71:19",
      "similarity": 0.703714184210171
    },
    {
      "verse": "29:62",
      "similarity": 0.6246449819689338
    },
    {
      "verse": "39:52",
      "similarity": 0.5953351569874855
    },
    {
      "verse": "34:36",
      "similarity": 0.5796684408721761
    },
    {
      "verse": "30:37",
      "similarity": 0.5704695030148168
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/5:28.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/5:28.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}