{
  "chapter": "المائدة",
  "text": "حرمت عليكم الميتة والدم ولحم الخنزير وما اهل لغير الله به والمنخنقة والموقوذة والمتردية والنطيحة وما اكل السبع الا ما ذكيتم وما ذبح على النصب وان تستقسموا۟ بالازلم ذلكم فسق اليوم يئس الذين كفروا۟ من دينكم فلا تخشوهم واخشون اليوم اكملت لكم دينكم واتممت عليكم نعمتى ورضيت لكم الاسلم دينا فمن اضطر فى مخمصة غير متجانف لاثم فان الله غفور رحيم",
  "translations": [
    {
      "translation": "Haram for you are carrion, blood and pork, and what has been consecrated to other than Allah, and animals which have been strangled, and animals which have been killed by a blow, and animals which have fallen to their death, and animals which have been gored, and animals which wild beasts have eaten - except those you are able to slaughter properly - and animals which have been sacrificed on altars, and deciding things by means of divining arrows - that is deviance. Today the kuffar have despaired of overcoming your deen. So do not be afraid of them but be afraid of Me. Today I have perfected your deen for you and completed My blessing upon you and I am pleased with Islam as a deen for you. But if anyone is forced by hunger, not intending any wrongdoing, Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden you is carrion and blood, and the flesh of the swine, and whatsoever has been killed in the name of some other than God, and whatever has been strangled, or killed by a blow or a fall, or by goring, or that which has been mauled by wild beasts unless slaughtered while still alive; and that which has been slaughtered at altars is forbidden, and also dividing the meat by casting lots with arrows. All this is sinful. Today the unbelievers have lost every hope of (despoiling) your creed; so do not fear them, fear Me. Today I have perfected your system of belief and bestowed My favours upon you in full, and have chosen submission (al-Islam) as the creed for you. If one of you is driven by hunger (to eat the forbidden) without the evil intent of sinning, then God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden to you are carrion, blood, the flesh of swine, the animal slaughtered in any name other than Allah's, the animal which has either been strangled, killed by blows, has died of a fall, by goring or that devoured by a beast of prey - unless it be that which you yourselves might have slaughtered while it was still alive - and that which was slaughtered at the altars. - You are also forbidden to seek knowledge of your fate by divining arrows. All these are sinful acts. This day the unbelievers have fully despaired of your religion. Do not fear them; but fear Me. This day I have perfected for you your religion, and have bestowed upon you My bounty in full measure, and have been pleased to assign for you Islam as your religion. (Follow, then, the lawful and unlawful bounds enjoined upon you.) As for he who is driven by hunger, without being wilfully inclined to sin, surely Allah is All-Forgiving, All-Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is unlawful for you to consume the following as food: an animal that has not been properly slaughtered, blood, pork, an animal slaughtered and consecrated in the name of someone other than God, an animal killed by strangulation or a violent blow, an animal killed by falling down, an animal which has been gored to death, an animal partly eaten by a wild beast before being properly slaughtered, an animal which has been sacrificed on the stone blocks (which pagans worshipped), and any flesh divided by casting superstitious and gambling arrows (a pagan tradition), which is a sin. Today, the unbelievers have lost hope about your religion. Do not be afraid of them but have fear of Me. On this day I have perfected your religion, completed My favors to you, and have chosen Islam as your religion. If anyone not (normally) inclined to sin is forced by hunger to eat unlawful substances instead of proper food, he may do so to spare his life. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden for you are carrion, and blood, and flesh of swine, and that which has been slaughtered while proclaiming the name of any other than Allah, and one killed by strangling, and one killed with blunt weapons, and one which died by falling, and that which was gored by the horns of some animal, and one eaten by a wild beast, except those whom you slaughter; and (also forbidden is) that which is slaughtered at the altar (of idols) and that which is distributed by the throwing of arrows (as an omen); this is an act of sin; this day, the disbelievers are in despair concerning your religion, so do not fear them and fear Me; this day have I perfected your religion for you* and completed My favour upon you, and have chosen Islam as your religion; so whoever is forced by intense hunger and thirst and does not incline towards sin, then indeed Allah is Oft Forgiving, Most Merciful. (*Prophet Mohammed – peace and blessings be upon him – is the Last Prophet.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden to you (for food) are: Al-Maytah (the dead animals), blood, the flesh of swine, and that which has been slaughtered as a sacrifice for other than Allah, and that which has been killed by strangling, or by a violent blow, or by a headlong fall, or by the goring of horns ـand that which has been (partly) eaten by a wild animal ـunless you are able to slaughter it (before its death) - and that which is sacrificed (slaughtered) on An-Nusub (stone altars). (Forbidden) also is to make decisions with Al-Azlam (arrows) (all) that is Fisq (disobedience and sin). This day, those who disbelieved have given up all hope of your religion; so fear them not, but fear Me. This day, I have perfected your religion for you, completed My favor upon you, and have chosen for you Islam as your religion. But as for him who is forced by severe hunger, with no inclination to sin (such can eat these above mentioned animals), then surely, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden to you is that which dies of itself, and blood, and flesh of swine, and that on which any other name than that of Allah has been invoked, and the strangled (animal) and that beaten to death, and that killed by a fall and that killed by being smitten with the horn, and that which wild beasts have eaten, except what you slaughter, and what is sacrificed on stones set up (for idols) and that you divide by the arrows; that is a transgression. This day have those who disbelieve despaired of your religion, so fear them not, and fear Me. This day have I perfected for you your religion and completed My favor on you and chosen for you Islam as a religion; but whoever is compelled by hunger, not inclining willfully to sin, then surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden to you are carrion, blood, the flesh of swine, what has been hallowed to other than God, the beast strangled; the beast beaten down, the beast fallen to death, the beast gored, and that devoured by beasts of prey - excepting that you have sacrificed duly -- as also things sacrificed to idols, and partition by the divining arrows; that is ungodliness. Today the unbelievers have despaired of your religion; therefore fear them not, but fear you Me. Today I have perfected your religion for you, and I have completed My blessing upon you, and I have approved Islam for your religion. But whosoever is constrained in emptiness and not inclining purposely to sin -- God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden unto you (for food) are carrion and blood and swineflesh, and that which hath been dedicated unto any other than Allah, and the strangled, and the dead through beating, and the dead through falling from a height, and that which hath been killed by (the goring of) horns, and the devoured of wild beasts, saving that which ye make lawful (by the death-stroke), and that which hath been immolated unto idols. And (forbidden is it) that ye swear by the divining arrows. This is an abomination. This day are those who disbelieve in despair of (ever harming) your religion; so fear them not, fear Me! This day have I perfected your religion for you and completed My favour unto you, and have chosen for you as religion al-Islam. Whoso is forced by hunger, not by will, to sin: (for him) lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are forbidden carrion, blood and pork; and any flesh over which the name of any other than God is invoked; and any creature which has been strangled, or killed by a blow or in a fall, or has been gored to death or half-eaten by a wild animal, saving that which you make lawful [by slaughtering properly while it was still alive] and what has been slaughtered at an altar. You are forbidden to make the division of [meat] by means of divining arrows: that is sinful conduct. Those who deny the truth have this day despaired of ever harming your religion. So do not fear them. Fear Me. Today I have completed your religion for you and completed My blessing upon you. I have chosen for you Islam as your religion. But if anyone is forced by hunger to eat something which is forbidden, not intending to commit a sin, he will find God forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden unto you are the deadmeat, and blood, and the flesh of the swine, and that over which is invoked the name of other than Allah, and the strangled, and the felled, and the tumbled, and the gored, and that which wild animals have devoured, unless ye have cleansed, and that which hath been slaughtered on the altars, and that ye seek a division by means of the divining arrows: all that is an abomination. To- day those who disbelieve have despaired of your religion; wherefore fear them not, and fear Me. To-day I have perfected for you your religion, and have completed My favour upon you, and am well-pleased with Islam as your religion. Then whosoever is driven to extreme hunger not inclining to sin, verily then Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are prohibited carrion, blood, the flesh of swine, and what has been offered to other than Allah, and the animal strangled or beaten to death, and that which dies by falling or is gored to death, and that which is mangled by a beast of prey—barring that which you may purify —and what is sacrificed on stone altars [to idols], and that you should divide by raffling with arrows. All that is transgression. Today the faithless have despaired of your religion. So do not fear them, but fear Me. Today I have perfected your religion for you, and I have completed My blessing upon you, and I have approved Islam as your religion. But should anyone be compelled by hunger, without inclining to sin, then Allah is indeed all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden to you (for food) are: dead meat, blood, the flesh of swine, and that on which hath been invoked the name of other than Allah; that which hath been killed by strangling, or by a violent blow, or by a headlong fall, or by being gored to death; that which hath been (partly) eaten by a wild animal; unless ye are able to slaughter it (in due form); that which is sacrificed on stone (altars); (forbidden) also is the division (of meat) by raffling with arrows: that is impiety. This day have those who reject faith given up all hope of your religion: yet fear them not but fear Me. This day have I perfected your religion for you, completed My favour upon you, and have chosen for you Islam as your religion. But if any is forced by hunger, with no inclination to transgression, Allah is indeed Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forbidden to you (for food) are: Al-Maytatah (the dead animals - cattle-beast not slaughtered), blood, the flesh of swine, and the meat of that which has been slaughtered as a sacrifice for others than Allah, or has been slaughtered for idols, etc., or on which Allah's Name has not been mentioned while slaughtering, and that which has been killed by strangling, or by a violent blow, or by a headlong fall, or by the goring of horns - and that which has been (partly) eaten by a wild animal - unless you are able to slaughter it (before its death) - and that which is sacrificed (slaughtered) on An-Nusub (stone altars). (Forbidden) also is to use arrows seeking luck or decision, (all) that is Fisqun (disobedience of Allah and sin). This day, those who disbelieved have given up all hope of your religion, so fear them not, but fear Me. This day, I have perfected your religion for you, completed My Favour upon you, and have chosen for you Islam as your religion. But as for him who is forced by severe hunger, with no inclination to sin (such can eat these above-mentioned meats), then surely, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are forbidden (to consume) the dead, blood and the flesh of swine; also flesh dedicated to any other than Allah, the flesh of strangled (animals) and of those beaten, that which is killed by falling, gored to death, mangled by beasts of prey, unless you find it (still alive) and slaughter it; also of animals sacrificed on stones (to idols). (You are forbidden) to seek division by the arrows, that is debauchery. Those who disbelieve have this day despaired of your religion. Do not fear them, but fear Me. This day I have perfected your religion for you and completed My favor to you. I have approved Islam to be your religion. (As for) he who does not intend to commit a sin but is constrained by hunger to eat of what is forbidden, then surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prohibited for you are carrion, blood, the flesh of swine, and animals dedicated to other than God; also the flesh of animals strangled, killed violently, killed by a fall, gored to death, mangled by wild animals—except what you rescue, and animals sacrificed on altars; and the practice of drawing lots. For it is immoral. Today, those who disbelieve have despaired of your religion, so do not fear them, but fear Me. Today I have perfected your religion for you, and have completed My favor upon you, and have approved Islam as a religion for you. But whoever is compelled by hunger, with no intent of wrongdoing—God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prohibited to you are dead animals, blood, the flesh of swine, and that which has been dedicated to other than Allah, and [those animals] killed by strangling or by a violent blow or by a head-long fall or by the goring of horns, and those from which a wild animal has eaten, except what you [are able to] slaughter [before its death], and those which are sacrificed on stone altars, and [prohibited is] that you seek decision through divining arrows. That is grave disobedience. This day those who disbelieve have despaired of [defeating] your religion; so fear them not, but fear Me. This day I have perfected for you your religion and completed My favor upon you and have approved for you Islam as religion. But whoever is forced by severe hunger with no inclination to sin - then indeed, Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:3] Forbidden to you is carrion, that is, the consumption of it, and blood, that is, what has been spilt, as mentioned in [sūrat] al-An‘ām [Q. 6:145], and the flesh of swine, and what has been hallowed to other than God, in that it was sacrificed in the name of something other than Him, and the beast strangled, to death, and the beast beaten down, to death, and the beast fallen, from a height to its death, and the beast gored, to death by another, and what beasts of prey have devoured, of such animals — except for what you have sacrificed duly, catching it while it still breathes life and then sacrificing it — and what has been sacrificed in, the name of, idols (nusub is the plural of nusāb) and that you apportion, that is, that you demand an oath or a ruling, through the divining of arrows (azlām: the plural of zalam or zulam, which is a qidh, ‘a small arrow’, without feathers or a head). There were seven of these [arrows], [marked] with flags, and they were retained by the keeper of the Ka‘ba. They would use them for abitrations and when they commanded them they obeyed, and if they prohibited them they would desist; that is wickedness, a rebellion against obedience. And on the Day of ‘Arafa in the year of the Farewell Pilgrimage, the following was revealed: Today the disbelievers have despaired of your religion, of you apostatising from it, having hoped for it [earlier], for now they perceived its strength; therefore do not fear them, but fear Me. Today I have perfected your religion for you, that is, its rulings and obligations (after this [verse] nothing about [what is] lawful or unlawful was revealed) and I have completed My favour upon you, by perfecting it [your religion], but it is also said by [effecting] their safe entry into Mecca; and I have approved, chosen, Islam for you as religion. But whoever is constrained by emptiness, by hunger, to consume some of what has been forbidden him and consumes it, not inclining purposely to sin, to an act of disobedience — then God is Forgiving, to him for what he has consumed, Merciful, to him by permitting it to him, in contrast to the one who [purposely] inclines to sin, that is, the one actively engaged in it, such as a waylayer or a criminal, for whom [such] consumption is forbidden.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then explained what He made unlawful for them, saying: (Forbidden unto you (for food) are carrion) He says: eating carrion is forbidden for you because He has commanded that it be immolated (and blood) which is shed (and swine flesh, and that which hath been dedicated unto any other than Allah) in purpose, (and the strangled) that which is strangled with a rope until it dies, (and the dead through beating) the beast beaten by a piece of wood until it dies, (and the dead through falling from a height) or in a well and which dies as a consequence, (and that which has been killed by (the goring of) horns, and the devoured of wild beasts) as a prey, (saving that which ye make lawful) except that which you find on the verge of dying and make it lawful by immolating it, (and that which hath been immolated unto idols. And (forbidden is it) that you swear by the divining arrows) He says: He has forbidden your use of divining arrows. They were in the habit of writing on some arrows: \"My Lord commands me\", and on others \"My Lord forbids me\" and then use the divination method associated with it to decide their affairs, and so Allah prohibited them from engaging in such activity. (This) that which I have mentioned to you of transgressions and the unlawful (is an abomination) engaging in them is an abomination and declaring them lawful is an act of disbelief. (This day) the day of the greater pilgrimage, the farewell pilgrimage (are those who disbelieve) the unbelievers of Mecca (in despair of your religion) in despair of you religion reverting to theirs after you left their religion and its laws; (so fear them not) in relation to following the Prophet Muhammad (pbuh) and opposing them (fear Me!) if you abstain from following Muhammad and his religion and follow them. (This day) the day of the pilgrimage (have I perfected your religion for you) I have elucidated to you the prescriptions of your religion: the lawful and the unlawful, the commands and the prohibitions (and completed My favour unto you) I have completed My blessing upon you in that, after today, no idolater will ever gather with you in 'Arafat, Mina, in the circumambulation around the Ka'bah, and in the coming and going between al-Safa and al-Marwah, (and have chosen for you as religion al-Islam. Whoso is forced by hunger) whoever is forced to eat the meat of carrion upon necessity, (not by will to sin) not wilfully intending to commit a sin; it is also said that this means: not purposefully wanting to eat without a necessity: ((for him) lo! Allah is Forgiving) if he eats to satiety, (Merciful) when He gave legal dispensation to eat the meat of carrion upon necessity in order to gain strength but it is legally reprehensible (makruh) to eat to satiety.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱلْمُنْخَنِقَةُ } معناه التي اخْتَنَقَتْ فِي خِنَاقِهَا حتَّى ماتت { وَٱلْمَوْقُوذَةُ } هي التي تُوقَذُ فَتَموتُ مِنْهُ\n { وَٱلْمُتَرَدِّيَةُ } هي التي تُرَدَّى مِن جَبلٍ، أَو حَائطٍ، أَو نَحوَ ذَلِكَ\n { وَٱلنَّطِيحَةُ } المَنْطُوحةُ\n\n\n\n\nوقوله تعالى: { إِلاَّ مَا ذَكَّيْتُمْ } معناهُ مَا ذَبَحتُمْ\n\n\n\n\nوقولهِ تعالى: { وَمَا ذُبِحَ عَلَى ٱلنُّصُبِ } معناهُ ما ذُبحَ عَلَى الأَنصَابِ\n واحدها نُصبٌ\n\n\n\n\nوقوله تعالى: { وَأَنْ تَسْتَقْسِمُواْ بِٱلأَزْلاَمِ } فالأَزلاَمُ كِعابُ فَارس وقِدَاحُ العَرَبِ كَانُوا يَعْمَدُونَ إِلى قَِدْحَينِ فَيكْتُبونَ عَلَى أَحدِهِما مُرْنِي وَعَلى الآخر انهِني ثُمّ يَجيلُونَها، فَإِذَا أَرادَ الرَّجلُ سَفراً أَو نَحوَ ذَلكَ، فَمنْ خَرَجَ عَلَيهِ مُرني مَضَى فِي وِجْهتِهِ، وإنْ خَرَجَ الذِي عَليهِ انهني لمْ يَخرجْ\n ويُقالُ: إِنَّ الأَزلاَمَ: حَصىً كَانُوا يَضرِبُونَ بِهَا\n واحدُها زَلَمٌ وزُلَمٌ\n\n\n\n\nوقوله تعالى: { ذٰلِكُمْ فِسْقٌ } معناهُ كُفرٌ\n\n\n\n\nوقوله تعالى: { وَرَضِيتُ لَكُمُ ٱلإِسْلٰمَ دِيناً } معناه اختِرتُهُ لَكُمْ\n\n\n\n\nوقوله تعالى: { فَمَنِ ٱضْطُرَّ فِي مَخْمَصَةٍ غَيْرَ مُتَجَانِفٍ لإِثْمٍ } قالَ زيدُ بن علي عليهما السَّلامُ: فالمَخْمَصةُ: المَجاعَةُ\n وغَيرُ مُتَجانِفٍ لآثمٍ: معناهُ غَيرُ مُتَعرِجٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And the crushed one\" - that is, the one who was crushed in her crushing until she died - \"and the one who is pierced\" - that is, the one who is pierced and dies from it.\n\n\nThe mutaraddiyah is the one that is hurled from a mountain, or a wall, or something similar.\n\n\nAnd the {natiqah} is the most eloquent.\n\n\nAnd His saying, \"Except what you have sacrificed,\" means what you have slaughtered.\n\n\nAnd His saying, {And that which is sacrificed on an altar} means that which is sacrificed on an altar.\n\n\nOne of them is an installation.\n\n\nAnd the saying of Allah {And divide [the spoils of war] by lot} - the al-Azlam are the arrows of the Persian king, and the Qidah of the Arabs were two cups which they would use to write on, one saying \"Murni\" and the other saying \"Inhin\". They would then cast them, and if the man wanted to go on a journey or something similar, the one with \"Murni\" would go in the direction he was facing, and if the one with \"Inhin\" came out, he would not go.\n\n\nIt is said that the azlam were a people who used to strike with stones.\n\n\nOne of them is guilty, and the other is also guilty.\n\n\nAnd His saying, \"That is disbelief,\" means disbelief.\n\n\nAnd His saying, {And I have chosen Islam as your religion} [means that] I have chosen it for you.\n\n\nAnd the saying of Allah, {Whoever is forced by necessity, without willful disobedience or transgressing, then there is no sin on him} - Zayd ibn Ali said: \"The necessity is the hardship.\"\n\n\nAnd is not a partner in sin: this means that he is not an accomplice.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ حُرمَت عليكم الميتة } هذه هي الأمور المستثناة من أنواع التمتعات المحلّلة، وهي الميتة أي: خمود الشهوة التي هي رذيلة التفريط المنافية للعفة كالخنوثة والعجز عن الإقدام على القدر الضروري من التمتعات والتمتع بفقدان اعتدال القوة الشهوانية على ما يفعله الخناثى وبعض المغزلين والمتقشفين والمتزهدين بالطبع، القاصرين عن السلوك لنقصان الاستعدادات { والدم } أي: التمتع بهوى النفس في الأعمال فإن مزج الهوى وشوبه يفسد الأعمال كلها { ولحْمُ الخنزِير } ووجوه التمتعات الحاصلة بالحرص والشره، فإن قوّة الحرص أخبث القوى وأسدّها لطرق الكمال والنجاة { وما أُهِل لِغَيْرِ الله بِه } أي: الرياضات والأعمال بالرياء وكل ما يفعل لغير الله. فإن كسر النفس وقمعها ومخالفتها لا يكون فعلاً جميلاً وفضيلة ومعيناً في السلوك إلا إذا كان لله، فأمّا إذا كان لغير الله فهو شرك والشرك أكبر الكبائر { والمُنْخَنِقَة } أي: حبس النفس عن الرذائل ومنعها عن القبائح بحصول صور الفضائل وصدور الأفعال الحسنة صورة مع كمون الهوى فيها. فإنّ الأفعال النفسية إنما تحسن بقمعها وقهرها لله وخروج الهوى الذي هو قوّتها وحياتها عنها وقيامها بإرادة القلب كخروج الدم الذي هو قوّة الحيوان وحياته منه بذبحه لله { والموقوذة } أي: صدور الفضائل في الظاهر عن النفس مع كره منها وإجبار عليها { والمتردّية } التي تتعلق بالتفريط والنقصان والميل إلى الجهة السفلية وانحطاط النفس عن الهمم العلية والدرجة القوية { والنطيحة } التي تصدر عن خوف وقهر من مثله كالعفاف الحاصل بواسطة زجر المحتسب وخوف الفضيحة { وما أكل السبع } كفضائل العفة التي تحصل لشدة القوّة الغضبية من الأنفة والحمية واستيلاء الغضب، فإنّ الغضب إذا استولى منع الشدّة عن فعلها أو لقهر من قهار كالملك والأمير { إلا ما ذكيتم } إلا ما قرنت واعتادت وانقادت لكم بعد قهر من غير، فكانت تصدر عنها الفضائل بإرادة قلبية من غير مزج الهوى. { وما ذُبِح على النصب } ما يفعل بناء على العادات التي يجب رفعها إلا لغرض عقلي أو شرعي { وأن تستقسموا بالأزلام } وأن تطلبوا السعادات والكمالات بالرسوم والطوالع اتكالاً على ما قضى الله وقدّر وتتركوا السعي والجدّ في الطلب، وتجعلوا ذلك علّة للتقصير بأن تقولوا: ليس لنا نصيب فيها، ولو كان لنا نصيب لحصل. فإنه ربما كان مجرّد تعليل وقد علق في القدر كماله بسعيه، فإنه لم يطلع على ذلك { ذلِكُم فِسْق } خروج عن الدين الذي هو طريق الحقّ { اليوم } أي: وقت حصول الكمال بتمرّن النفس بالفضائل، وتثبتها في العزائم { يَئِسَ الذين كَفَروا } أي: حجبوا من قوى نفوسكم أو من أبناء جنسكم وأهل جِلْدَتكم من الطبيعيين والمتزندقين { من دينكم } أي: من أن يصدّوكم عن طريق الحق { فلا تَخْشوهم } فإنهم يستولون عليكم بعد ذلك { واخْشوني } بأن لا تقفوا عند تجلي صفة من صفاتي وتَهَيّبوا عظمة ذاتي حتى تصلوا إلى مقام الفناء.\n{ اليوم أكملت لكم دينكم } ببيان الشعائر وكيفية السلوك { وأتممْتُ عليكم نِعْمَتي } بالهداية إليّ { ورَضِيت لكم } الاستسلام والانقياد بالانمحاء عند تجليات الأفعال والصفات أو إسلام الوجه للفناء عند تجلي الذات { دِيناً فمن اضْطرّ } إلى أمر من هذه الأمور المحرّمة التي عددناها { في مَخْمصة } في هيجان شديد من النفس وغلبة لظهور صفة من صفاتها { غير متجانف لإثم } غير منحرف عن الدين والوجهة إلى رذيلة مانعة لقصد منه وعزيمة { فإنّ الله غَفُور } يستر ذلك عنه بنور صفة من صفاته تقابلها { رحِيم } يرحم بِمداد التوفيق لإظهار الكمال ورفع موانعه.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "ثم لمَّا كان الأصل في الأشياء الحل والإباحة، والحرمة إنما عرضت من الشرع، بيَّن سبحانه أولاً حكم المحللات مطلقاً وما يتفرع عليها، ثم عيَّن المحرمات التي استثناها بقوله { إِلاَّ مَا يُتْلَىٰ } [المائدة: 1، الحج: 30] فقال { حُرِّمَتْ عَلَيْكُمُ } في دينكم { ٱلْمَيْتَةُ } المائت حتف أنفه بلا موجب لإزالة الحياة { وَٱلْدَّمُ } المسفوح، السائل التزكية أو بغيرها { وَلَحْمُ ٱلْخِنْزِيرِ } النجس، الظاهر خباثته عقلاً وشرعاً.\n\n{ وَ } من جملة المحرمات { مَآ أُهِلَّ } صوت ذبحه { لِغَيْرِ } اسم { ٱللَّهِ بِهِ } من أسماء الأصنام { وَ } كذا { ٱلْمُنْخَنِقَةُ } المزيلة حياتها بالخنق بلا تذكية، كما يفعل المشركون { وَ } كذا { ٱلْمَوْقُوذَةُ المضروبة بالخضب الأحجار إلى أن تذهب منها الروح { وَٱلْمُتَرَدِّيَةُ } التي سقطت من علو، أو في بئر فزالت حياتها { وَٱلنَّطِيحَةُ } أيضاً، وهي التي نطحها الحيوان الآخر فماتت { وَ } كذا حرمت عليكم { مَآ أَكَلَ ٱلسَّبُعُ } منه فزال حياته { إِلاَّ مَا ذَكَّيْتُمْ } قطعتم حلقومه مهللين حين أحسستم الرمق منه، فإنه يحل لكم.\n\n{ وَ } كذا حرمت عليكم { مَا ذُبِحَ عَلَى ٱلنُّصُبِ } أي: الأصنام الموضوعة حول البيت، كانوا يعظمونها، ويتقربون إليها بالذبائح والقرابين { وَ } من جملة المحرمات { أَنْ تَسْتَقْسِمُواْ بِٱلأَزْلاَمِ } أي: الأقداح، وذلك أنهم إذا قصدوا فعلاً ضربوا ثلاثة أقداح مكتوب على أحدها: أمرني ربي، وعلى الآخر: نهاني ربي، وعلى الثالث: غفل، فإن خرج الأمر مضو عليه، وإن خرج النهي انصرفوا عنه، وإن خرج الغفل أجالوها ثانياً.\n\nومعنى الاستقسام بها: الاستخبار، والاستفسار عن القسمة الغيبية التي استأثر الله بها، ولم يطلع أحداً عليها، وأمثال هذا ما هي إلا كهانة وكفر، صدرت عن أولي الأحلام السخيفة، الخبيثة، الناشئة من عدم الرضا بقضاء الله { ذٰلِكُمْ } أي: استقسامكم واستخباركم من أزلامكم { فِسْقٌ } خروج عمَّا عليه الأمر والشروع وديدنة الجاهلية فعليكم أن تجتنبوا عن أمثالها، خصوصاً { ٱلْيَوْمَ يَئِسَ } وقنط بالمرة { ٱلَّذِينَ كَفَرُواْ } عن انصرافكم { مِن دِينِكُمْ فَلاَ تَخْشَوْهُمْ } على غلبتهم بترك رسومهم وعاداتهم المستقبحة.\n\n{ وَٱخْشَوْنِ } عن بشطي وانتقامي بترك ما أمرتب لكم، ونهيت عنه في جميع أحوالكم وأزمانكم، سيما { ٱلْيَوْمَ } الذي هذا قد { أَكْمَلْتُ لَكُمْ دِينَكُمْ } بأن ينصركم ويغلبكم على مخالفيكم مطلقاً، ويظهر دينكم على الأديان كلها { وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي } ظاهراً وباطناً بالاستيلاء، والغلبة على الأعداء، وقمع الآراء الباطلة والأهواء الفاسدة بالكلية { وَ } من إتمام نعمتي عليكم أني { رَضِيتُ } اخترت وانتخبت { لَكُمُ ٱلإِسْلٰمَ } الإطاعة والانقياد { دِيناً } ديدنه ومذهباً؛ إذ لا دين عند الله إلا الإسلام.\n\nوبعد كما دينكم وإتمام النعم عليكم، وتحليل ما أحل، وتحريم ما حرم { فَمَنِ ٱضْطُرَّ } منكم { فِي مَخْمَصَةٍ } مجاعة مفرطة، ملجئة إلى تناول الجيف والمحرمات حال كونكم { غَيْرَ مُتَجَانِفٍ } مائل { لإِثْمٍ } ومعصية، رخص التناول منها مقدار سدّ جوعه { فَإِنَّ ٱللَّهَ } المصلح لأحوالكم { غَفُورٌ } مما صدر عنكم حين اضطراركم ومخمصتكم { رَّحِيمٌ } [المائدة: 3] لا يخواذكم عليه بعدما رخص لكم.\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "{ حُرِّمَتْ عَلَيْكُمُ ٱلْمَيْتَةُ وَٱلْدَّمُ وَلَحْمُ ٱلْخِنْزِيرِ وَمَآ أُهِلَّ لِغَيْرِ ٱللَّهِ بِهِ وَٱلْمُنْخَنِقَةُ وَٱلْمَوْقُوذَةُ وَٱلْمُتَرَدِّيَةُ وَٱلنَّطِيحَةُ وَمَآ أَكَلَ ٱلسَّبُعُ إِلاَّ مَا ذَكَّيْتُمْ وَمَا ذُبِحَ عَلَى ٱلنُّصُبِ وَأَنْ تَسْتَقْسِمُواْ بِٱلأَزْلاَمِ ذٰلِكُمْ فِسْقٌ... }  يقول الحقّ جلّ جلاله: { حُرِّمَت عليكم الميتة } أي: ما ماتت حَتْفَ أنفها بلا ذكاة، { والدم } المسفوح، أي: المهروق، وكانت الجاهلية يصبّونه في الأمعاء، ويشوونها، ورُخِّصَ في الباقي في العروق بعد التذكية، { ولحم الخنزير } ، وكذا شحمه وسائر أجزائه المتصلة، بخلاف الشعر المجزوّ، { وما أُهَلَّ لغير الله به } أي: رفع الصوت عليه عند ذبحه بغير الله، كقولهم: باسم اللاّت والعزّى، وكذا ما تُرِكَ عليه اسم الله عَمْدًا، عند مالك { والمنخنقة } بحبل وشبهه حتى ماتت، { والموقوذة } أي: المضروبة بعصا أو بحجر أو شبهه، من: وقذته وقذًا: ضربته، { والمتردية } أي: الساقطة من جبل أو في بئر وشبهه فماتت، { والنطيحة } التي نطحتها أخرى فماتت، فإن لم تمت فإن كان في المصران الأعلى فكذلك، لا في الأسفل أو الكرش. { وما أكل السّبع } أي: أكل بعضه وأنفذ مقتله، والسبّع: كل حيوان مفترس كالذئب والأسد والنّمر والثعلب والنّمس والعُقاب والنّسر { إلاّ ما ذكّيتم } أي: إلا ما أدركتم ذكاته وفيه حياة مستقرة من ذلك. قاله البيضاوي. وقال ابن جُزَيّ: قيل: إنه استثناء منقطع، وذلك إذا أُريد بالمنخنقة وأخواتها: ما مات من ذلك بالخنق وما بعده، أي: حُرِّمَت عليكم هذه الأشياء، لكن ما ذكَّيتم من غيرها فهو حلال، وهذا ضعيف، وقيل: إنه استثناء متصل، وذلك إن أُريد بالمنخنقة وأخواتها ما أصابته تلك الأسباب وأدركت حياته. والمعنى: إلا ما أدركتم حياته من هذه الأشياء، فهو حلال، واختلف أهل هذا القول هل يُشتَرَط أن يكون لم تنفذ مقاتله، أم لا؟ فالأئمة كلهم على عدم الاشتراط إلا مالكًا ـ رحمه الله ـ، وأما مَن لم تُشرِف على الموت من هذه الأسباب، فذكاتها جائزة باتفاق. هـ. { و } حُرِّمَ عليكم أيضًا: { ما ذُبِحَ على النُّصُب } ، وهي أحجار كانت منصوبة حول البيت، يذبحون عليها ويعدُّون ذلك قُرْبَة، وليست بالأصنام لأن الأصنام مُصَوّرة، والنُّصُب غير مُصَوَّرة، وقيل: { على } بمعنى اللام، أي: وما ذُبِحَ للنُّصُب، والمراد كلّ ما ذُبحَ لغير الله. { وأن تستقسموا بالأزلام } أي: تطلبوا ما قسم لكم في الأزل من المقادير بالأزلام، جمع زلم ـ بضم الزاي وفتحها ـ وهي الأقداح على قدر السهام. وكانت في الجاهلية ثلاثة، قد كُتب على أحدها: افعل، على الآخر: لا تفعل، وعلى الثالث: مهمل، فإذا أراد الإنسان أن يعمل أمرًا جعلها في خريطة، وأدخل يده وأخرج أحدها، فإن خرج له الذي فيه \" افعل \" فعل ما أراد، وإن خرج الذي فيه \" لا تفعل \" ، تركه.\nوإن خرج المهمل أعاد الضرب، ويقاس عليه كل ما يدخل في علم الغيب، كالقريعة والحظ والنصبة والكهانة، وشبهها. { ذلكم فسق } ، الإشارة إلى المحرمات المذكورة، أو إلى الاستقسام بالأزلام، وإنما كان فسقًا لأنه دخول في علم الغيب الذي انفرد الله به، وفيه تجسس على سر الملك، وهو حرام، ولا يعارض ما ثبت جوازه من القرعة، في أمور مخصوصة كتمييز الأنصبة في القسمة، وقد كان ـ عليه الصلاة والسلام ـ يقترع بين نسائه \" ، وغير ذلك مما تفيد تطييب القلوب، دون الاطلاع على علم الغيوب. والله تعالى أعلم. الإشارة: حرمت عليكم يا معشر المريدين طلب الحظوظ والشهوات، وما تموت به قلوبكم من الانهماك في الغفلات، وتناول ما أعطِيكم لغير وجه الله، وقبضتموه من غير يد الله، بأن نظرتم حين قبضه إلى الواسطة، وغفلتم عن المعطي حقيقة، فمقتضى شريعة الخواص: إخراجه عن الملك، وحرمان النفس من الانتفاع به، كما وقع لبعض الأولياء، ولا تتناولوا من الطعام إلا ما ذكيتموه بأن شهدتم فيه المنعم دون الوقوف مع النعمة، ونزلتم إليه بالإذن، دون قصد الشهوة والمتعة، وهذا يحتاج إلى تيقظ كبير ومراقبة قوية. والله يتجاوز عن أمثالنا بحلمه وكرمه. آمين. ولمَا حرم الله تعالى هذه الاشياء حصل للمشركين الإياس من موافقة المسلمين لهم في دينهم، فلذلك ذكره الحق تعالى بإثر تحريمها، فقال: {... ٱلْيَوْمَ يَئِسَ ٱلَّذِينَ كَفَرُواْ مِن دِينِكُمْ فَلاَ تَخْشَوْهُمْ وَٱخْشَوْنِ ٱلْيَوْمَ أَكْمَلْتُ لَكُمْ دِينَكُمْ وَأَتْمَمْتُ عَلَيْكُمْ نِعْمَتِي وَرَضِيتُ لَكُمُ ٱلإِسْلاَمَ دِيناً... } يقول الحقّ جلَ جلاله: { اليوم } الذي أنتم فيه، وهو يوم الجمعة، ويوم عرفة في حجة الوداع، { يئس الذين كفروا من دينكم } أن يبطلوه، أو يظهروا عليه بحصول المباينة لهم في أمورهم كلها، ولظهور الإسلام فيه وكثرة المسلمين، قيل: إنه وقف معه صلى الله عليه وسلم في هذه الحجة: مائة ألف وأربعة عشر ألفًا، ويحتمل أن يريد باليوم الزمان الحاضر، وما يتصل به من الأزمنة الآتية، { فلا تخشوهم } أن يظهروا عليكم، { واخشون } وحدي فأمرهم بيدي. { اليوم أكملتُ لكم دينكم } بالنصر والإظهار على الأديان كلها، أو بالتنصيص على قواعد العقائد، والتوقيف على أحوال الشرائع وقوانين الاجتهاد، { وأتممتُ عليكم نعمتي } بالهداية والتوفيق، أو بإكمال الدين، وبالفتح والتمكين، بهدم منار الكفر، ومحو علل الملحدين، { ورضيتُ لكم الإسلام دينًا } أي: اخترته لكم من بين الأديان، الذي لا نرتضي غيره، ولا نقبل سواه. الإشارة: إذا حصل المريد على أسرار التوحيد، وخاض بحار التفريد، وذاق حلاوة أسرار المعاني، وغاب عن شهود حس الأواني، وحصل له الرسوخ والتمكين في ذلك، أيِسَ منه الشيطان وسائر القواطع، فلا يخشى أحدًا إلا الله، ولا يركن إلى شيء سواه، وأمِنَ من الرجوع في الغالب، إلا لأمر غالب،\n\n[يُوسُف:21]. ولذلك قال بعضهم:  والله ما رجع من رجع إلا من الطريق، وأما من وصل فلا يرجع. والوصول هو التمكين فيما ذكرنا، فإذا حصل على كمال المعرفة، ووقف على عرفة المعارف، فقد كمل دينه واستقام أمره، وظهرت أنواره، وتحققت أسراره، وما بقي إلا الترقي في الأسرار أبدًا سرمدًا، والسير في المقامات كسير الشمس في المنازل، ينتقل فيها من مقام إلى مقام، بحسب ما يبرز من عنصر القدرة، فتارة يبرز معه ما يوجب الخوف، وتارة ما يوجب الرجاء، وتارة ما يوجب الرضا والتسليم، وتارة ما يوجب التوكل، وهكذا يتلون مع كل مقام ويقوم بحقه، ولا يقف مع مقام ولا مع حال، لأنه خليفة الله في أرضه، وقد قال تعالى:\n[الرحمن:29]، وهذا هو التلوين بعد التمكين. والله تعالى أعلم. ثم استثنى من تلك المحرمات حالة المضطر، فقال: {... فَمَنِ ٱضْطُرَّ فِي مَخْمَصَةٍ غَيْرَ مُتَجَانِفٍ لإِثْمٍ فَإِنَّ ٱللَّهَ غَفُورٌ رَّحِيمٌ }  قال البيضاوي: هو متصل بذكر المحرمات، وما بينهما اعتراض مما يوجب التجنب عنها، وهو أن تناولها فسوق، وحرمتها من جملة الدين الكامل والنعمة التامة والإسلام المرضي. هـ. يقول الحقّ جلّ جلاله: { فمن اضطر } إلى تناول شيء من هذه المحرمات { في مخمصة } أي: مجاعة، حال كونه { غير متجانف } أي: مائل للإثم وقاصد له، بأن يأكلها تلذذًا أو متجاوزًا حد الرخصة، قيل: هو سد الرمق، وقال ابن أبي زيد: يأكل منها ويتزود، فإن استغنى عنها طرحها. هـ. فإن تناولها للضرورة { فإن الله غفور } له { رحيم } به حيث أباحها له في تلك الحالة. الإشارة: قال بعض الحكماء: الدنيا كلها كالميتة، لا يحل منها للذاكر إلا قدر الضرورة أكلاً وشربًا وملبسًا ومركبًا، حتى يتحقق له الوصول، فما بقي لأحد حينئٍذ ما يقول، وعلامة الوصول: هو الاكتفاء بالله دون الاحتياج لشيء سواه، إن افتقر اغتنى في فقره، وإن ذل عز في ذله، وإن فقد وجد في فقده، وهكذا في تقلبات الأحوال لا يتضعضع ولا يتزلزل، ولو سقطت السماء على الأرض. والله تعالى أعلم. ولمّا ذكر ما حرَّم عليهم ذكر ما أحل لهم، فقال: { يَسْأَلُونَكَ مَاذَآ أُحِلَّ لَهُمْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:173",
      "similarity": 0.1726179317304382
    },
    {
      "verse": "16:115",
      "similarity": 0.16693566578221464
    },
    {
      "verse": "6:145",
      "similarity": 0.1632569394606339
    },
    {
      "verse": "2:182",
      "similarity": 0.14090373662805725
    },
    {
      "verse": "5:90",
      "similarity": 0.13608522095329223
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/5:3.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/5:3.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/5:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}