{
  "chapter": "المائدة",
  "text": "فطوعت له نفسه قتل اخيه فقتله فاصبح من الخسرين",
  "translations": [
    {
      "translation": "So his lower self persuaded him to kill his brother, and he killed him and became one of the lost.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the other was induced by his passion to murder his brother, and he killed him, and became one of the damned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At last his evil soul drove him to the murder of his brother, and he killed him, whereby he himself became one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Cain's) soul prompted him to kill his own brother. In doing so he became of those who lose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So his soul incited him to kill his brother – he therefore killed him, and was therefore ruined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the soul of the other encouraged him and made fair-seeming to him the murder of his brother; he murdered him and became one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then his mind facilitated to him the slaying of his brother so he slew him; then he became one of the losers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then his soul prompted him to slay his brother, and he slew him, and became one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But (the other's) mind imposed on him the killing of his brother, so he slew him and became one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His lower self persuaded him to kill his brother, and he killed him and he became one of the lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then his soul made the slaying of his brother agreeable to him, so he slew him, and he became of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So his soul prompted him to kill his brother, and he killed him, and thus became one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The (selfish) soul of the other led him to the murder of his brother: he murdered him, and became (himself) one of the lost ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the Nafs (self) of the other (latter one) encouraged him and made fair-seeming to him the murder of his brother; he murdered him and became one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His soul made it seem fair to him to slay his brother; he killed him and became one of the lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then His soul prompted him to kill his brother, so he killed him, and became one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his soul permitted to him the murder of his brother, so he killed him and became among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:30] Then his soul prompted him, it seduced him, to slay his brother, so he slew him and became one of the losers, by slaying him. And he did not know what to do with him, because he was the first of the Children of Adam to die on earth, and so he carried him on his back.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But (the other's) mind imposed on him) his ego permitted him (the killing of his brother, so he slew him and became one of the losers) who deserved punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَطَوَّعَتْ لَهُ نَفْسُهُ } معناهُ شَجَّعَتْهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَطَوَّعَتْ لَهُ نَفْسُهُ } أي: هيَّجت حسده إلى أن طوعت، وأرضت نفسه { قَتْلَ أَخِيهِ فَقَتَلَهُ } ظلماً بلا مدافعة منه كما شرط، فندم دفعة { فَأَصْبَحَ } وصار { مِنَ ٱلْخَاسِرِينَ } [المائدة: 30] خسارناً عظيماً في الدنيا والآخرة، فتحيَّر في دفعه وإخفائه، إذ لا يموت أحد من بني آدم إلى ذلك الوقت، فحمله على عاتقه، وسار معه إلى حين أروح وأنتن\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فطوّعت له نفسه قتل أخيه } أي: سهلت له ووسِعته ولم تضق منه، أو طاوعته عليه وزينته له، { فَقتله فأصبح من الخاسرين } دينًا ودنيا، فبقي مدة عمره مطرودًا محزونًا\n قال السدي: لما قصد قابيلُ قتل هابيل، راغ هابيل في رؤوس الجبال، ثم أتاه يومًا من الأيام، فوجده نائمًا فشدخ رأسه بصخرة فمات، وقال ابن جريج: لم يدر قابيل كيف يقتل هابيل؟ فتمثل له إبليس، وأخذ طيرًا فوضع رأسه على حجر، ثم شدخه بحجر آخر، وقابيل ينظر، فعلمه القتل، فوضع رأس أخيه على حجر ثم شدخه بحجر آخر\n\n\nوكان لهابيل يوم قتل عشرون سنة، وقبره قيل: عند عقبة حراء، وقال ابن عباس: عند ثور، وقال جعفر الصادق: بالبصرة، في موضع المسجد الأعظم\n الإشارة: قد تضمنت هذه الآية من طريق الإشارة ثلاث خصال، يجب التحقق بها على كل مؤمن متوجه إلى الله تعالى: أولها: التطهير من رذيلة الحسد، الذي هو أول معصية ظهرت في السماء والأرض، وقد تقدم الكلام عليه في النساء، الثانية: التطهير من الشرك الجلي والخفي، والتغلغل في التبري من الذنوب التي توجب عدم قبول الأَعمال، ويتحصل ذلك بتحقيق الإخلاص، والثالثة: عدم الانتصار للنفس والدفع عنها إلا فيما وجب شرعًا، فقد قالوا:  الصوفي دمه هدر، وماله مباح فلا ينتصر لنفسه ولو بالدعاء، فإما أن يسكت، أو يدعوا لظالمه بالرحمة والهداية، حتى يأخذ الله بيده اقتداء برسوله صلى الله عليه وسلم، حيث قال\n\n \" اللهم اعفِر لِقَومي فَإنَّهُم لا يَعلَمُونَ \"\n \n\nولمَّا قتل قابيل أخاه، لم يدر ما يفعل به لأنه أول من مات من بني آدم، فعلّمه الله كيفية دفنه، فقال: { فَبَعَثَ ٱللَّهُ غُرَاباً يَبْحَثُ فِي ٱلأَرْضِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "81:18",
      "similarity": 0.5226284538004738
    },
    {
      "verse": "100:3",
      "similarity": 0.4561700708522949
    },
    {
      "verse": "23:34",
      "similarity": 0.4318813672670005
    },
    {
      "verse": "68:21",
      "similarity": 0.40211799143835747
    },
    {
      "verse": "5:102",
      "similarity": 0.39358560580886787
    }
  ]
}