{
  "chapter": "المائدة",
  "text": "فبعث الله غرابا يبحث فى الارض ليريه كيف يورى سوءة اخيه قال يويلتى اعجزت ان اكون مثل هذا الغراب فاورى سوءة اخى فاصبح من الندمين",
  "translations": [
    {
      "translation": "Then God sent a raven which scratched the ground in order to show him how to hide the nakedness of his brother. \"Alas, the woe,\" said he, \"that I could not be even like the raven and hide the nakedness of my brother,\" and was filled with remorse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereupon Allah sent forth a raven who began to scratch the earth to show him how he might cover the corpse of his brother. So seeing he cried: 'Woe unto me! Was I unable even to be like this raven and find a way to cover the corpse of my brother? Then he became full of remorse at his doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God sent down a raven which started to dig up the earth to show the killer how to bury the corpse of his brother. On seeing the raven, (Cain) said, \"Woe to me! Am I less able than a raven to bury the corpse of my brother?\" He became greatly remorseful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah sent a crow scratching the ground, to show him how to hide his brother’s corpse; he said, “Woe to me! I was not even capable enough to be like this crow, so I would hide my brother’s corpse”; and he turned remorseful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah sent a crow who scratched the ground to show him how to hide the dead body of his brother. He said: \"Woe to me! Am I not even able to be as this crow and to hide the dead body of my brother\" Then he became one of those who regretted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah sent a crow digging up the earth so that he might show him how he should cover the dead body of his brother. He said: Woe me! do I lack the strength that I should be like this crow and cover the dead body of my brother? So he became of those who regret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then God sent forth a raven, scratching into the earth, to show him how he might conceal the vile body of his brother. He said, 'Woe is me! Am I unable to be as this raven, and so conceal my brother's vile body?' And he became one of the remorseful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah sent a raven scratching up the ground, to show him how to hide his brother's naked corpse. He said: Woe unto me! Am I not able to be as this raven and so hide my brother's naked corpse? And he became repentant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then God sent a raven, which scratched the earth, so that He might show him how to hide the corpse of his brother. \"Alas!\" he cried, \"Am I not able even to be like this raven, so that I may hide the corpse of my brother?\" And he repented.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah sent a raven scratching in the earth to show him in what wise he might cover the corpse of his brother. He said: woe unto me was incapable of being like unto this raven so that I might cover the corpse of my brother! And he became of the remorseful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah sent a crow, exploring in the ground, to show him how to bury the corpse of his brother. He said, ‘Woe to me! Am I unable to be [even] like this crow and bury my brother’s corpse?’ Thus he became regretful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah sent a raven, who scratched the ground, to show him how to hide the shame of his brother. \"Woe is me!\" said he; \"Was I not even able to be as this raven, and to hide the shame of my brother?\" then he became full of regrets-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah sent a crow who scratched the ground to show him to hide the dead body of his brother. He (the murderer) said: \"Woe to me! Am I not even able to be as this crow and to hide the dead body of my brother?\" Then he became one of those who regretted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah sent down a crow, which dug the earth to show him how to bury the naked corpse of his brother. 'Alas' he said, 'am I unable to be like this crow and so I bury my brother's naked corpse' And he became among those who regret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then God sent a raven digging the ground, to show him how to cover his brother's corpse. He said, “Woe to me! I was unable to be like this raven, and bury my brother's corpse.” So he became full of regrets.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Allah sent a crow searching in the ground to show him how to hide the disgrace of his brother. He said, \"O woe to me! Have I failed to be like this crow and hide the body of my brother?\" And he became of the regretful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:31] Then God sent forth a raven, scratching into the earth, digging up the soil with its beak and with its legs and throwing it up over a dead raven next to it until it completely hid it, to show him how he might hide the nakedness, the carcass, of his brother. He said, ‘Woe to me! Am I not able to be as this raven, and so hide my brother’s nakedness?’ And he became one of the remorseful, for having carried him; he then dug [a hole] for him and covered him up.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then Allah sent a raven scratching up the ground) turning up the ground to bury a dead raven, (to show him) Cain (how to hide his brother's naked corpse) in the ground. (He said: Woe unto me! Am I not able to be as this raven) in his ability (and so hide my brother's naked corpse) in the ground? (And he became repentant) he was repentant at not being able to cover his brother's naked corpse, but not repentant for having killed him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { سَوْءَةَ أَخِيهِ } معناهُ فَرْجُهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَبَعَثَ ٱللَّهُ } إعلاماً له { غُرَاباً } فقتل غراباً من جنسه أراد أن يدفعه { يَبْحَثُ فِي ٱلأَرْضِ } بمنقاره ورجله { لِيُرِيَهُ كَيْفَ يُوَارِي } ويستر { سَوْءَةَ أَخِيهِ } أي: جثته وجسده التي يسوء { قَالَ } قابيل محتسراً، متحزناً، قلقاً، حائراً: { يَاوَيْلَتَا } يا هلكتي أحضري { أَعَجَزْتُ } وعلزت عن مقتضى العقل، وعن الاهتداء به إلى حيث { أَنْ أَكُونَ مِثْلَ هَـٰذَا ٱلْغُرَابِ } المتعزل عن العقل والإدراك، بل متابعاً له، متلمذاً منه { فَأُوَارِيَ سَوْءَةَ أَخِي فَأَصْبَحَ مِنَ ٱلنَّادِمِينَ } [المائدة: 31] ندامة مؤبدة بحيث لا يضحك مدة حياته أصلاً وعاش مدة مائة سنة، واسودَّ لونه إلى حيث لم يُعرف\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ليريه } أي: يعلمه، وضمير الفاعل يعود على \" الله \" أو الغراب، و { كيف }: حال من الضمير في { يُواري } والجملة مفعول ثان ليرى، أي: ليعلمه الله، أو الغراب، كيفية مواراة أخيه، و { يا ويلتا }: كلمة جزع وتحسر، والألف فيها بدل من ياء المتكلم، كيا حسرتا ويا أسفا، و \" أصبح \" هنا بمعنى صار\n يقول الحقّ جلّ جلاله: { فبعث الله غرابًا يبحث في الأرض } أي: يحفر فيها، { ليريه } أي: الله، أو الغراب، { كيف يُواري } أي: يستر { سوءة أخيه } أي: جسده لأنه مما يستقبح أن يرى، وخصت بالذكر لأنها أحق بالستر من سائر الجسد، فعلَّم اللهُ قابيل كيف يصنع بأخيه لأنه لم يدر ما يصنع به، إذ هو أول ميت مات من بني آدم، فتحير في أمره، فبعث الله غرابين فاقتتلا، فقتل أحدُهما الآخر، فحفر له بمنقاره ورجليه، ثم ألقاه في الحفرة وغطاه بالتراب\n قال قابيل لما رأى ذلك: { يا ويلتا أعجزت أن أكون مثل هذا الغراب فأواري سوءة أخي } فأهتَدِي إلى ما اهتدى إليه، فحفر لأخيه ودفنه { فأصبح من النادمين } على قتله، لِما كابد فيه من التحير في أمره، وحَملِه على رقبته سنة أو أكثر، وتلمذة الغراب له، واسوداد لونه، وتبرّي أبويه منه، إذ رُوِي أنه لما قتله أسود وجهه، فسأله آدم عن أخيه، فقال: ما كنتُ عليه وكيلاً\n فقال: بل قتلته فلذلك اسود جسدك، وتبرأ منه، ومكث بعد ذلك مائة سنة لم يضحك، وعدم الظفر بما فعله من أجله\n قاله البيضاوي، فانظره مع ما سيأتي عن الثعلبي\n واختلف في كفره فقال ابن عطية: الظاهر أنه لم يكن قابيل كافرًا، وإنما كان مؤمنًا عاصيًا، ولو كان كافرًا ما تحرج أخوه من قتله، إذ لا يتحرج من قتل كافر لأن المؤمن يأبى أن يقتل موحدًا، ويرضى بأن يُظلَمَ ليجازي في الآخرة\n ونحو هذا فعل عثمان رضي الله عنه لما قصد أهل مصر قتله مع عبد الرحمن بن أبي بكر، لشُبهةٍ، وكانوا أربعة آلاف، فأراد أهل المدينة أن يدفعوا عنه، فأبى واستسلم لأمر الله\n قال عياض: منعه من الدفع إعلام رسول الله صلى الله عليه وسلم بأن ذلك سَبَقَ به القدر\n حيث بشره بالجنة على بلوى تصيبه، كما في البخاري، ونقل عن بعض أهل التاريخ: أن شيتًا سار إلى أخيه قابيل، فقاتله بوصية أبيه له بذلك، متقلدًا بسيف أبيه\n وهو أول من تقلد بالسيف، فأخذ أخاه أسيرًا وسلسله، ولم يزل كذلك حتى قبض كافرًا\n هـ\n قلت: ولعل تحرّج أخيه من قتله لأنه حين قصد قتله لم يُظهِر كفره، وظهر بعد ذلك، فلذلك قاتله أخوه شيت بعد ذلك وأسره، وذكر الثعلبي: أن قابيل لما طرده أبوه، أخذ بيد أخته أقليمًا، فهرب بها إلى أرض اليمن، فأتاه إبليس فقال له: إنما أكلت النار قربان هابيل، لأنه كان يخدم النار ويعبدها، فانصب أنت أيضًا نارًا تكون لك ولعقبك، فبنى بيت نار، وهو أول من عبد النار\n\n\nهـ\n فهذا صريح في كفره\n والله تعالى أعلم\n الإشارة: إذا كان الحق جل جلاله يدل العصاة من عباده إذا تحيروا على ما يزيل حيرتهم، فكيف لا يدل الطائعين إذا تحيروا على ما يزيل شبهتهم، إذا فزعوا إليه والتجأوا إلى حماه؟! فكل من وقع في حيرة دينية أو دنيوية وفزع إلى الله تعالى، مضطرًا إليه، فلا شك أن الله تعالى يجعل له فرجًا ومخرجًا من أمره، إما بواسطة أو بلا واسطة\n كن صادقًا تجد مرشدًا،\n\n[محَمَّد:21]\n والله تعالى أعلم\n ثم ذكر وبال من قتل نفساً بغير حق، كما فعل قابيل، فقال: { مِنْ أَجْلِ ذٰلِكَ كَتَبْنَا عَلَىٰ بَنِيۤ إِسْرَائِيلَ }\n\n",
      "translations": []
    }
  ]
}