{
  "chapter": "المائدة",
  "text": "انما جزؤا۟ الذين يحاربون الله ورسوله ويسعون فى الارض فسادا ان يقتلوا۟ او يصلبوا۟ او تقطع ايديهم وارجلهم من خلف او ينفوا۟ من الارض ذلك لهم خزى فى الدنيا ولهم فى الءاخرة عذاب عظيم",
  "translations": [
    {
      "translation": "The reprisal against those who wage war on Allah and His Messenger, and go about the earth corrupting it, is that they should be killed or crucified, or have their alternate hands and feet cut off, or be banished from the land. That will be their degradation in this world and in the Next World they will have a terrible punishment,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The punishment for those who wage war against God and His Prophet, and perpetrate disorders in the land, is to kill or hang them, or have a hand on one side and a foot on the other cut off, or banish them from the land. Such is their disgrace in the world, and in the Hereafter their doom shall be dreadful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who wage war against Allah and His Messenger, and go about the earth spreading mischief -indeed their recompense is that they either be done to death, or be crucified, or have their hands and feet cut off from the opposite sides or be banished from the land. Such shall be their degradation in this world; and a mighty chastisement lies in store for them in the World to Come\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only proper recompense for those who fight against God and His Messenger and try to spread evil in the land is to be killed, crucified, or either to have one of their hands and feet cut from the opposite side or to be sent into exile. These are to disgrace them in this life and they will suffer a great torment in the life hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only reward of those who make war upon Allah and His Noble Messenger and cause turmoil in the land is that they be all be killed or crucified, or their hands and feet cut off from alternate sides, or they be banished far away from the land; this is their degradation in the world, and for them in the Hereafter is a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The recompense of those who wage war against Allah and His Messenger and do mischief in the land is only that they shall be killed or crucified, or their hands and their feet be cut off on opposite sides, or be exiled from the land. That is their disgrace in this world, and a great torment is theirs in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The punishment of those who wage war against Allah and His apostle and strive to make mischief in the land is only this, that they should be murdered or crucified or their hands and their feet should be cut off on opposite sides or they should be imprisoned; this shall be as a disgrace for them in this world, and in the hereafter they shall have a grievous chastisement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the recompense of those who fight against God and His Messenger, and hasten about the earth, to do corruption there: they shall be slaughtered, or crucified, or their hands and feet shall alternately be struck off; or they shall be banished from the land. That is a degradation for them in this world; and in the world to come awaits them a mighty chastisement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only reward of those who make war upon Allah and His messenger and strive after corruption in the land will be that they will be killed or crucified, or have their hands and feet on alternate sides cut off, or will be expelled out of the land. Such will be their degradation in the world, and in the Hereafter theirs will be an awful doom;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those that make war against God and His Messenger and spread disorder in the land shall be put to death or crucified or have their hands and feet cut off on alternate sides, or be banished from the country. They shall be disgraced in this world, and then severely punished in the Hereafter,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The meed of those who wage war against Allah and His apostle and go about in the land corrupting is only that they shall be slain or crucified or their hands and feet be cut off on the opposite sides, or be banished from the land. Such shall be their humiliation in the world, and theirs shall be in the Hereafter a mighty torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the requital of those who wage war against Allah and His Apostle, and try to cause corruption on the earth, is that they shall be slain or crucified, or shall have their hands and feet cut off from opposite sides, or be banished from the land. That is a disgrace for them in this world, and in the Hereafter, there is a great punishment for them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The punishment of those who wage war against Allah and His Messenger, and strive with might and main for mischief through the land is: execution, or crucifixion, or the cutting off of hands and feet from opposite sides, or exile from the land: that is their disgrace in this world, and a heavy punishment is theirs in the Hereafter;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The recompense of those who wage war against Allah and His Messenger and do mischief in the land is only that they shall be killed or crucified or their hands and their feet be cut off on the opposite sides, or be exiled from the land. That is their disgrace in this world, and a great torment is theirs in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The recompense of those who make war against Allah and His Messenger and spread corruption in the land is that they are to be killed or crucified, or have their hand and a foot cut off on opposite sides, or be expelled from the land. For them is shame in this world and a great punishment in the Everlasting Life;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The punishment for those who fight God and His Messenger, and strive to spread corruption on earth, is that they be killed, or crucified, or have their hands and feet cut off on opposite sides, or be banished from the land. That is to disgrace them in this life; and in the Hereafter they will have a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the penalty for those who wage war against Allah and His Messenger and strive upon earth [to cause] corruption is none but that they be killed or crucified or that their hands and feet be cut off from opposite sides or that they be exiled from the land. That is for them a disgrace in this world; and for them in the Hereafter is a great punishment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:33] The following was revealed when the ‘Arniyyūn came to Medina suffering from some illness, and the Prophet (s) gave them permission to go and drink from the camels’ urine and milk. Once they felt well they slew the Prophet’s shepherd and stole the herd of camels: Truly the only requital of those who fight against God and His Messenger, by fighting against Muslims, and hasten about the earth to do corruption there, by waylaying, is that they shall be slaughtered, or crucified, or have their hands and feet cut off on opposite sides, that is, their right hands and left feet, or be banished from the land (the aw, ‘or’, is [used] to indicate the [separate] application of [each of] the cases [listed]; thus, death is for those that have only killed; crucifixion is for those that have killed and stolen property; the cutting off [of limbs on opposite sides] is for those that have stolen property but have not killed; while banishment is for those that pose a threat — this was stated by Ibn ‘Abbās and is the opinion of al-Shāfi‘ī; the more sound of his [al-Shāfi‘ī’s] two opinions is that crucifixion should be for three days after [the] death [of the killer], or, it is also said, shortly before [he is killed]; with banishment are included similar punishments, such as imprisonment and the like). That, mentioned requital, is a degradation, a humiliation, for them in this world; and in the Hereafter theirs will be a great chastisement, namely, the chastisement of the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "The following verse was revealed about the people of Hilal Ibn 'Uwaymir who killed a group of people from the Banu Kinanah. This group wanted to emigrate to Medina to see Allah's Messenger (pbuh) and declare their Islam. However, they were all killed and their belongings taken as booty. Hence, Allah explained the punishment of the people of the Banu Hilal, who were idolaters, saying: (The only reward) requital (of those who make war upon Allah and His messenger) of those who disbelieve in Allah and His messenger (and strive after corruption in the land) and engage in sin in the land, i.e. by wrongfully killing others and taking their properties (will be that they will be killed) He says: the punishment of one who kills and does not take the victim's property is that he be killed (or crucified) He says: the punishment of one who kills a person and also takes his property is that he be crucified, (or have their hands and feet on alternate sides cut off) the right hand and the left leg. He says: the punishment of one who takes another's property but does not kill is that his hand and leg be cut off, (or will be expelled out of the land) or he will be put in prison until he displays righteousness and his repentance becomes apparent. Allah says: the punishment of someone who terrorises people as a highway robber but does not kill or take anyone's property is that he be imprisoned. (Such) that which I have mentioned (will be their degradation) their punishment (in the world, and in the Hereafter theirs will be an awful doom) more severe than their punishment which they suffered in this world, that is, if the person does not repent;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُحَارِبُونَ ٱللَّهَ وَرَسُولَهُ } معناه يُعَادُونهُ\n\n\n\n\nوقوله تعالى: { أَوْ يُنفَوْاْ مِنَ ٱلأَرْضِ } معناه يُطردوا\n\n\n\n\nوقوله تعالى: { أَوْ تُقَطَّعَ أَيْدِيهِمْ وَأَرْجُلُهُم مِّنْ خِلافٍ } قالَ زيدُ بن علي عليهما السَّلامُ: تُقطَعُ يَدُهُ اليمنَى ورِجْلُهُ اليُسرى، يُخَالفُ بَينَ قَطْعِهَا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah {they fight in the cause of Allah and His Messenger} means they return to Him.\n\n\nAnd His saying, {or they are expelled from the land} means they are expelled.\n\nAnd the saying of Allah {Or have their hands and feet cut off from opposite sides} Zaid bin Ali said: His right hand and left leg are cut off, opposite to the cutting.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n والانقياد لشرعه { وَرَسُولَهُ } بتكذيبه وتكذيب ما جاء به من عند ربه\n والقتال معه ومع من تابعه { وَ } مع ذلك { يَسْعَوْنَ فِي ٱلأَرْضِ فَسَاداً } مفسدين بأنواع الفسادات الساري ضررها في أقطار الأرض { أَن يُقَتَّلُوۤاْ } حيث وجدوا دفعة { أَوْ يُصَلَّبُوۤاْ } أحياء\n ليعتبر منهم من في قلبه مرض مثل مرضهم\n ثم يُقتل على أفظع وجه وأقبحه\n\n\n{ أَوْ تُقَطَّعَ أَيْدِيهِمْ وَأَرْجُلُهُم مِّنْ خِلافٍ } متبادلتين\n ليعيشوا بين الناس على هذا الوجه\n ولينزجر منهم نفوس أهل الأهوية الفاسدة { أَوْ يُنفَوْاْ مِنَ ٱلأَرْضِ } إلى حيث يؤمن من شرورهم { ذٰلِكَ } المذكور { لَهُمْ خِزْيٌ } تذليل وتفضيح { فِي ٱلدُّنْيَا وَلَهُمْ فِي ٱلآخِرَةِ عَذَابٌ عَظِيمٌ } [المائدة: 33] طرد وتبعيد عن مرتبة أهل التوحيد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: سبب نزل الآية عند ابن عباس: قوم من اليهود كان بينهم وبين رسول الله صلى الله عليه وسلم عهد\n فنقضوا العهد وقطعوا السبيل\n وهو مناسب لما قبله\n وقال جماعة: نزلت في نفر من عُكل وعُرينَة\n أظهروا الإسلام بالمدينة\n ثم خرجوا وقتلوا راعي النبي صلى الله عليه وسلم وأخذوا إبله\n فبعث في إثرهم\n فأُخذوا\n فقطع أيديهم وأرجلهم وسمل أعينهم\n فماتوا\n ثم حُكمُها جارٍِ في كل محارب\n والمحاربة عند مالك: هي حمل السلاح على الناس في بلد أو في خارج عنه\n وقال أبو حنيفة: لا يكون المحارب إلا خارج البلد\n و { فسادًا }: منصوب على العلة\n أو المصدر\n أو على حذف الجار\n يقول الحقّ جلّ جلاله: { إنما جزاء الذين يحاربون الله } حيث حاربوا عباده\n فهو تغليظ ومُبالغة\n { و } يحاربون { رسوله } كما فعل العُرَينيون أو غيرهم\n { ويسعون في الأرض فسادًا } بالفساد كإخافة الناس\n ونَهب أموالهم\n قال ابن جزي: هو بيان للحرابة\n وهي درجات فأدناها: إخافة الطريق\n ثم أخذ الأموال\n ثم قتل النفس\n فجزاؤهم { أن يُقتلوا أو يُصلبوا } \n فالصلب مضاف للقتل\n فقيل: يقتل ثم يصلب\n إرهابًا لغيره\n وهو قول أشهب\n وقيل: يصلب حيًا ويُقتل في الخشبة\n وهو قول ابن القاسم\n { أو تقطع أيديهم وأرجلهم من خلاف } \n فيقطع يده اليمنى ورجله اليسرى\n وإن عاد قطعت يده اليسرى ورجله اليمنى\n وقطع اليد من الرسغ\n والرجل من المفصل كالسرقة\n { أو يُنفوا من الأرض } أي: ينفوا من بلد إلى بلد\n ويسجنوا فيه حتى تظهر توبتهم\n وقال أبو حنيفة: يسجن في البلد بعينه\n ومذهب مالك: أن الإمام مخير في المحارب بين ما تقدم\n إلا أنه قال: إن كان قتل فلا بد من قتله\n وإن يقتل فالأحسن أن يؤخذ فيه بأيسر العقاب\n أولئك المحاربون { لهم خزي في الدنيا }: ذل وفضيحة\n { ولهم في الآخرة عذاب عظيم } لعظم ذنوبهم\n ظاهره أن العقوبة في الدنيا لا تكون كفارة للمحاربين بخلاف سائر الحدود\n ويحتمل أن يكون الخزي في الدنيا لمن عوقب\n وفي الآخرة لمن لم يعاقب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:124",
      "similarity": 0.22833358202480258
    },
    {
      "verse": "26:49",
      "similarity": 0.2228296136576394
    },
    {
      "verse": "20:71",
      "similarity": 0.18264660496153412
    },
    {
      "verse": "86:7",
      "similarity": 0.15623210095682766
    },
    {
      "verse": "4:157",
      "similarity": 0.1491193682087523
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/5:33.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/5:33.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/5:33.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}