{
  "chapter": "المائدة",
  "text": "يايها الذين ءامنوا۟ اتقوا۟ الله وابتغوا۟ اليه الوسيلة وجهدوا۟ فى سبيله لعلكم تفلحون",
  "translations": [
    {
      "translation": "You who have iman! have taqwa of Allah and seek the means of drawing near to Him, and do jihad in His Way, so that hopefully you will be successful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, follow the path shown to you by God, and seek the way of proximity to Him, and struggle in His way: you may have success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Fear Allah and seek the means to come near to Him, and strive hard in His way; maybe you will attain true success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, have fear of God. Find the means to reach Him and strive hard for His cause so that you may have everlasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Fear Allah, and seek the means towards Him, and strive in His cause, in the hope of attaining success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Have Taqwa of Allah and seek the Wasilah to Him, and strive hard in His cause, so that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! be careful of (your duty to) Allah and seek means of nearness to Him and strive hard in His way that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, fear God, and seek the means to come to Him, and struggle in His way; haply you will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Be mindful of your duty to Allah, and seek the way of approach unto Him, and strive in His way in order that ye may succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, fear God and seek ways to come closer to Him and strive for His cause, so that you may prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! fear Allah and seek approach unto Him and strive hard in His way, that haply ye may fare well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Be wary of Allah, and seek the means of recourse to Him, and wage jihad in His way, so that you may be felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Do your duty to Allah, seek the means of approach unto Him, and strive with might and main in his cause: that ye may prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do your duty to Allah and fear Him. Seek the means of approach to Him, and strive hard in His Cause as much as you can. So that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, have fear of Allah and seek the means by which you come to Him. Struggle in His Way in order that you are prosperous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be conscious of God, and seek the means of approach to Him, and strive in His cause, so that you may succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, fear Allah and seek the means [of nearness] to Him and strive in His cause that you may succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:35] O you who believe, fear God, fear His chastisement, by being obedient to Him, and seek the means to Him, that obedience which brings you closer to Him, and struggle in His way, in order to elevate His religion; so that you might prosper, triumph.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe!) in Muhammad and the Qur'an (Be mindful of your duty to Allah) regarding that which He has commanded you, (and seek the way of approach unto Him) seek the highest rank; it is also said that this means: seek with Him high degrees through righteous works, (and strive in His way) in His obedience (in order that ye may succeed) so that you escape His wrath and torment and so that you attain to faith. 116\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱبْتَغُوۤاْ إِلَيهِ ٱلْوَسِيلَةَ } معناهُ اطلبُوا إِليهِ القُربةَ\n والوَسيلةُ: الحَاجةُ\n\n",
      "translations": [
        {
          "translation": " And His saying, {And seek the means [of approach to] Him} [means] seek nearness to Him.\n\n\nThe means: the need.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَا أَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم التقوى عن محارم الله { ٱتَّقُواْ ٱللَّهَ } عن ارتكاب ما حرم عليكم، ونهاكم عنه { وَٱبْتَغُوۤاْ } واطلبوا { إِلَيهِ ٱلْوَسِيلَةَ } المقربة إلى ذاته لتتوسلوا به إلى توحيده { وَجَاهِدُواْ فِي سَبِيلِهِ } لقطع العلائق، ورفع الموانع مع القوى البشرية الشاغلة عن التوجه نحوه { لَعَلَّكُمْ تُفْلِحُونَ } [المائدة: 35] تفوزون بفضاء توحيده، وصفاء تجريده وتفريده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:57",
      "similarity": 0.835226857339181
    },
    {
      "verse": "9:88",
      "similarity": 0.1606431970409284
    },
    {
      "verse": "3:130",
      "similarity": 0.12713716215020718
    },
    {
      "verse": "62:10",
      "similarity": 0.12296618477899596
    },
    {
      "verse": "60:1",
      "similarity": 0.1205812261921614
    }
  ]
}