{
  "chapter": "المائدة",
  "text": "ان الذين كفروا۟ لو ان لهم ما فى الارض جميعا ومثله معه ليفتدوا۟ به من عذاب يوم القيمة ما تقبل منهم ولهم عذاب اليم",
  "translations": [
    {
      "translation": "As for those who are kafir, if they had everything on the earth and the same again with it to ransom themselves from the punishment of the Day of Rising, it would not be accepted from them. They will have a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for unbelievers, if they possess the riches of the whole earth, and two times more, and offer it as ransom for release from the torments of the Day of Resurrection, it will not be accepted from them, and their punishment will surely be painful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who disbelieved - even if they had all that is in the earth, and the like of it with it, and offered it all as ransom from chastisement on the Day of Resurrection, it will not be accepted of them - a painful chastisement lies in store for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had the unbelievers had twice as much as the wealth of the whole earth in order to ransom themselves from the torment in the life hereafter, still their ransom would not have been accepted. For them there will be a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed if the disbelievers owned all that is in the earth and a similar one in addition to it, and they offered it as a ransom to save themselves from the punishment of the Day of Resurrection, it would not be accepted from them; and for them is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve, if they had all that is in the earth, and as much again therewith to ransom themselves thereby from the torment on the Day of Resurrection, it would never be accepted of them. And theirs would be a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely (as for) those who disbelieve, even if they had what is in the earth, all of it, and the like of it with it, that they might ransom themselves with it from the punishment of the day of resurrection, it shall not be accepted from them, and they shall have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers, though they possessed all that is in the earth, and the like of it with it, to ransom themselves from the chastisement of the Day of Resurrection thereby, it would not be accepted of them; for them awaits a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve, lo! if all that is in the earth were theirs, and as much again therewith, to ransom them from the doom on the Day of Resurrection, it would not be accepted from them. Theirs will be a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who reject Faith, if they had everything on earth, and twice as much again and offered it to ransom themselves from the torment of the Day of Resurrection, it shall not be accepted from them -- they will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who have disbelieved, if they had all that is in the earth and with it as much again whereby to ransom themselves from the torment on the Day of Judgement, it shall not be accepted of them, and theirs shall be a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed if the faithless possessed all that is on the earth, and as much of it besides, to redeem themselves with it from the punishment of the Day of Resurrection, it shall not be accepted from them, and there is a painful punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to those who reject Faith,- if they had everything on earth, and twice repeated, to give as ransom for the penalty of the Day of Judgment, it would never be accepted of them, theirs would be a grievous penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who disbelieve, if they had all that is in the earth, and as much again therewith to ransom themselves thereby from the torment on the Day of Resurrection, it would never be accepted of them, and theirs would be a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve, if they possessed all that the earth contains and as much besides to ransom themselves from the punishment of the Day of Resurrection, it shall not be accepted from them. Theirs shall be a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who disbelieve, even if they owned everything on earth, and the like of it with it, and they offered it to ransom themselves from the torment of the Day of Resurrection, it will not be accepted from them. For them is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who disbelieve - if they should have all that is in the earth and the like of it with it by which to ransom themselves from the punishment of the Day of Resurrection, it will not be accepted from them, and for them is a painful punishment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:36] Truly, as for the disbelievers, if they possessed, definitely, all that is in the earth, and the like of it with it, by which to ransom themselves from the chastisement of the Day of Resurrection, it would not be accepted from them; theirs shall be a painful chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(As for those who disbelieve) in Muhammad and the Qur'an, (lo! if all) the wealth (that is in the were theirs, and as much again therewith) and double of it with it, (to ransom them from the doom on the day of Resurrection, it) the ransom (would not be accepted from them. Theirs will be a painful doom).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على مقتضى سنته من تعقب الوعد بالوعيد: { إِنَّ ٱلَّذِينَ كَفَرُواْ } بتوحيد الله، وأصرُّوا على ما هم عليه من الكفر والشقاق { لَوْ } تحقق وثبت { أَنَّ لَهُمْ } ملك { مَّا فِي ٱلأَرْضِ } من الزخارف والكنوز { جَمِيعاً وَمِثْلَهُ مَعَهُ } بل أضعاف أمثاله { لِيَفْتَدُواْ بِهِ } فدية، ويخلصوا { مِنْ عَذَابِ يَوْمِ ٱلْقِيَامَةِ } ونكالها المترتبة على كفرهم { مَا تُقُبِّلَ مِنْهُمْ } لعظم جرمهم وإصرارهم عليه، بل { وَلَهُمْ } فيها { عَذَابٌ أَلِيمٌ } [المائدة: 36] مؤبد، لا يرجى نجاتهم أصلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { لو أن لهم }: الجار متعلق بالاستقرار، لأنه خبر \" إن \" مقدمًا، والضمير في { به }: يعود على ما ومثله، ووحده باعتبار ما ذكر كقوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:47",
      "similarity": 0.7493908854016859
    },
    {
      "verse": "3:91",
      "similarity": 0.6715017292579423
    },
    {
      "verse": "70:11",
      "similarity": 0.6014277301190417
    },
    {
      "verse": "57:15",
      "similarity": 0.530181679801754
    },
    {
      "verse": "13:18",
      "similarity": 0.523750015447426
    }
  ]
}