{
  "chapter": "المائدة",
  "text": "والسارق والسارقة فاقطعوا۟ ايديهما جزاءۢ بما كسبا نكلا من الله والله عزيز حكيم",
  "translations": [
    {
      "translation": "As for thieves, both male and female, cut off their hands in reprisal for what they have done: an object lesson from Allah. Allah is Almighty, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the thief, whether man or woman, cut his hand as punishment from God for what he had done; and God is all mighty and all wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the thief -male or female - cut off the hands of both. This is a recompense for what they have done, and an exemplary punishment from Allah. Allah is All-Mighty, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cut off the hands of a male or female thief as a punishment for their deed and a lesson for them from God. God is Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And cut off the hands of those men or women who are thieves – a recompense of their deeds, a punishment from Allah; and Allah is Almighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) the male thief and the female thief, cut off their hands as a recompense for that which both committed, a punishment by way of example from Allah. And Allah is All-Powerful, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) the man who steals and the woman who steals, cut off their hands as a punishment for what they have earned, an exemplary punishment from Allah; and Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the thief, male and female: cut off the hands of both, as a recompense for what they have earned, and a punishment exemplary from God; God is All-mighty, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the thief, both male and female, cut off their hands. It is the reward of their own deeds, an exemplary punishment from Allah. Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cut off the hands of thieves, whether they are male or female, as a [deterrent] punishment from God for what they have done. God is almighty and wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the man-thief and the woman-thief, cut off their hands as a meed for that which they have earned; an exemplary punishment from Allah. And Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the thief, man or woman, cut off their hands as a requital for what they have earned. [That is] an exemplary punishment from Allah, and Allah is all-mighty, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to the thief, Male or female, cut off his or her hands: a punishment by way of example, from Allah, for their crime: and Allah is Exalted in power.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cut off (from the wrist joint) the (right) hand of the thief, male or female, as a recompense for that which they committed, a punishment by way of example from Allah. And Allah is All-Powerful, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the man or woman who is guilty of theft, recompense them by cutting off their hands for their crimes. That is the punishment from Allah. Allah is Mighty, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the thief, whether male or female, cut their hands as a penalty for what they have reaped—a deterrent from God. God is Mighty and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[As for] the thief, the male and the female, amputate their hands in recompense for what they committed as a deterrent [punishment] from Allah. And Allah is Exalted in Might and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:38] And the thieving male and the thieving female (the definite article in both [nouns] relates to the subject [sc. wa’lladhī saraqa wa’llatī saraqat, ‘And the male who thieves and the female who thieves’]; because this [clause] resembles a conditional statement [sc. ‘if he thieves, if she thieves’ etc.] the fā’ has been included in the predicate [fa’qta‘ū, ‘then cut off’]) cut off their hands, that is, the right hand of each of the two from the wristbone; it is explained in the Sunna that the amputation applies to [the stealing of] a quarter of a dinar and upwards, and if the person were to re-offend, the left foot should then be amputated from the ankle, and then [on subsequent re-offending] the left hand [is amputated], followed by the right foot, after which discretionary punishment is applied; as a requital (jazā’an is in the accusative because it is a verbal noun) for what they have earned, and an exemplary punishment, for both of them, from God; God is Mighty, His way will prevail, Wise, in His creation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجملة معطوفة على جملة { إنّما جزاء الّذين يحاربون } \\[ المائدة : 33 \\] . { والسارق } مبتدأ والخبر محذوف عند سيبويه . والتّقدير : ممّا يتلى عليكم حكم السارق والسارقة فاقطعوا أيديهما . وقال المبرّد : الخبر هو جملة { فاقطعوا أيديهما } ، ودخلت الفاء في الخبر لتضمّن المبتدأ معنى الشرط؛ لأنّ تقديره : والّذي سرق والّتي سرقت . والمصول إذا أريد منه التّعميم ينزّل منزلة الشرط أي يجعل ( أَلْ ) فيها اسم موصول فيكون كقوله تعالى { واللاتي يأتين الفاحشة من نسائكم فاستشهدوا عليهنّ أربعة منكم } \\[ النساء : 15 \\] ، قوله : { واللّذان يأتيانها منكم فآذوهما } \\[ النساء : 16 \\] . 6 قال سيبويه : وهذا إذا كان في الكلام ما يدلّ على أنّ المبتدأ ذكر في معرض القصص أو الحُكم أو الفرائض نحو { واللاتي يأتين الفاحشة من نسائكم فاستشهدواواللذان يأتيانها منكم فآذوهما } { والسارق والسارقة فاقطعوا أيديهما } إذ التّقدير في جميع ذلك : وحكم اللاتي يأتين ، أو وجَزاء السارق والسّارقة .ولقد ذكرها ابن الحاجب في «الكافية» واختصرها بقوله : «والفاء للشرط عند المبرّد وجملتان عند سيبويه ، يعني : وأمّا عند المبرّد فهي جملة شرط وجوابه فكأنّها جملة واحدة وإلاّ فالمختار النصب» . أشار إلى قراءة عيسى بن عمر { والسارقَ والسارقَة } بالنصب ، وهي قراءة شاذّة لا يعتدّ بها فلا يخرّج القرآن عليها . وقد غلط ابن الحاجب في قوله : فالمختار النصب .وقوله : { فاقطعوا أيديهما } ضمير الخطاب لِوُلاة الأمور بقرينة المقام ، كقوله : { الزّانية والزّاني فاجلدوا كلّ واحد منهما مائة جلدة } \\[ النور : 2 \\] . وليس الضّمير عائداً على الّذين آمنوا في قوله { يأيّها الّذين آمنوا اتّقوا الله } \\[ النساء : 35 \\] . وجُمع الأيدي باعتبار أفراد نوع السارق . وثنيّ الضمير باعتبار الصنفين الذكر والأنثى؛ فالجمع هنا مراد منه التّثنية كقوله تعالى : { فقد صغت قلوبكما } \\[ التحريم : 4 \\] .ووجه ذكر السارقة مع السارق دفعُ توهّم أن يكون صيغة التذكير في السارق قيداً بحيث لا يجري حدّ السرقة إلاّ على الرجال ، وقد كانت العرب لا يقيمون للمرأة وزناً فلا يجرون عليها الحدود ، وهو الدّاعي إلى ذكر الأنثى في قوله تعالى في سورة البقرة : ( 178 ) { الحُرّ بالحرّ والعبد بالعبد والأنثى بالأنثى } وقد سرقت المخزوميّة في زمن رسول الله فأمر بقطع يدها وعظم ذلك على قريش ، فقالوا : من يشفع لها عند رسول الله إلاّ زيد بن حارثة ، فلمّا شفع لها أنكر عليه وقال : أتشفع في حدّ من حدود الله ، وخطب فقال : إنّما أهلك الّذين من قبلكم أنّهم كانوا إذا سرق فيهم الشّريف تركوه وإذا سرق الضّعيف قطعوه ، والله لو أنّ فاطمة سرقت لقطعت يدها .وفي تحقيق معنى السرقة ونصاب المقدار المسروق الموجب للحدّ وكيفية القطع مجال لأهل الاجتهاد من علماء السلف وأيّمة المذاهب وليس من غرض المفسّر . وليس من عادة القرآن تحديد المعاني الشّرعية وتفاصيلها ولكنّه يؤصّل تأوصيلها ويحيل ما وراء ذلك إلى متعارف أهل اللّسان من معرفة حقائقها وتمييزها عمّا يشابهها .فالسارق : المتّصف بالسرقة . والسرقة معروفة عند العرب مميّزة عن الغارة والغصْب والاغتصاب والخلسة ، والمؤاخذة بها ترجع إلى اعتبار الشيء المسروق ممّا يشِحّ به معظم النّاس .فالسرقة : أخذ أحد شيئاً ما يملكه خُفية عن مالكه مخُرجاً إيّاه من موضععِ هو حرِزُ مثلِه لم يؤذن آخِذُه بالدخول إليه .والمسروق : مَا لهُ منفعة لا يتسامح النّاس في إضاعته . وقد أخذ العلماء تحديده بالرجوع إلى قيمة أقلّ شيء حكم النّبيء بقطع يد من سَرَقَه . وقد ثبت في الصّحيح أنّه حكم بقطع يد سارق حَجَفَة بحاء مهملة فجيم مفتوحتين ( ترس بن جلد ) تساوي ربع دينار في قول الجمهور ، وتساوي ديناراً في قول أبي حنيفة ، والثوري ، وابننِ عبّاس ، وتساوي نصفَ دينار في قول بعض الفقهاء .ولم يذكر القرآن في عقوبة السارق سوى قطع اليد . وقد كان قطع يد السارق حكماً من عهد الجاهليّة ، قضى به الوليدُ بن المغيرة فأقرّه الإسلام كما في الآية . ولم يرد في السنّة خبر صحيح إلاّ بقطع اليد . وأوّل رَجُل قطعت يده في الإسلام الخيارُ بن عدي بن نوفل بن عبد مناف ، وأوّل امرأة قطعت يَدها المخزوميةُ مُرّةُ بنتُ سفيان .فاتّفق الفقهاء على أنّ أوّل ما يبدأ به في عقوبة السارق أن تقطع يده . فقال الجمهور : اليد اليمنى ، وقال فريق : اليد اليسرى ، فإن سرق ثانية ، فقال جمهور الأيمّة : تقطع رجله المخالفة ليده المقطوعة . وقال عليّ بن أبي طالب : لا يقطع ولكن يحبس ويضرب . وقضى بذلك عمر بن الخطّاب ، وهو قول أبي حنيفة . فقال عليّ : إنّي لأستحيي أن أقطع يده الأخرى فبأي شيء يأكُل وَيَسْتَنْجِي أو رِجْلَه فعلى أي شيء يعتمد؛ فإن سرق الثّالثة والرّابعة فقال مالك والشّافعي : تقطع يده الأخرى ورجلُه الأخرى ، وقال الزهري : لم يبلغنا في السنّة إلاّ قطع اليد والرّجل لا يزاد على ذلك ، وبه قال أحمد بن حنبل ، والثّوري ، وحمَّاد بن سلمة . ويجب القضاء بقول أبي حنيفة ، فإنّ الحدود تُدرأ بالشبهات وأيّ شبهة أعظم من اختلاف أيمّة الفقه المعتبرين .والجزاء : المكافأة على العمل بما يناسب ذلك العملَ من خير أو شرّ ، قال تعالى : إنّ للمتّقين مفازاً إلى قوله { جزاءً من ربّك عطاءً حسابا } في سورة النبأ ( 31 - 36 ) ، وقال تعالى : { وجزاء سيئة مثلها } في سورة الشورى ( 40 ) .والنكال : العقاب الشّديد الّذي من شأنه أن يصدّ المعاقب عن العود إلى مثل عمله الّذي عوقب عليه ، وهو مشتقّ من النكول عن الشيء ، أي النكوص عنه والخوف منه . فالنكال ضرب من جزاء السّوء ، وهو أشدّه ، وتقدّم عند قوله تعالى : { فجعلناها نكالاً } الآية في سورة البقرة ( 66 ) .وانتصب جزاء } على الحال أو المفعول لأجله ، وانتصب { نكالاً } على البدل من { جزاء } بدل اشتمال .فحكمة مشروعيّة القطع الجزاء على السرقة جزاء يقصد منه الردع وعدم العود ، أي جزاء ليس بانتقام ولكنّه استصلاح .وضَلّ من حسب القطع تعويضاً عن المسروق ، فقال من بيتين ينسبان إلى المعرّي ( وليسا في «السقط» ولا في «اللّزوميات» ) :يد بخمسسِ مِئينَ عسجَدا وُديتْ ... ما بالها قُطعت في رُبع دينارونسب جوابه لعلم الدّين السَّخَاوي :عِزّ الأمَانة أغلاهَا؛ وأرخصها ... ذُلّ الخيانة فافهَمْ حكمة الباري\n\n",
      "translations": [
        {
          "translation": "(As for the thief, both male) i.e. Tu'mah (and female, cut off their hands) the right hands. (It is the reward of their own deeds) as a punishment for their theft, (an exemplary punishment from Allah) a disgrace for them from Allah. (Allah is Mighty) in showing His anger towards the thief, (Wise) in that He decreed for him the cutting off of his hand.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { نَكَالاً مِّنَ ٱللَّهِ } معناهُ عُقُوبةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {a punishment from Allah}, its meaning is a punishment.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلسَّارِقُ } المتجاوز عن حدود الله { وَٱلسَّارِقَةُ } المتجاوزة عنها { فَٱقْطَعُوۤاْ } أيها الحكام { أَيْدِيَهُمَا } أي: يمينها إن أخرجا المسروق من الحرز المتعارف { جَزَآءً بِمَا كَسَبَا } معهما { نَكَالاً } عقوبة وتعذيباً { مِّنَ ٱللَّهِ } لتصرفهم في ملك الغير { وَٱللَّهُ } المتصرف المستقل في ملكه { عَزِيزٌ } غالب\n قادر على الانتقام { حَكِيمٌ } [المائدة: 38] متقن في مقداره وتعيينه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { السارق }: مبتدأ والخبر محذوف عند سيبويه\n وهو الجار والمجرور\n أي: مما يتلى عليكم حكم السارق والسارقة\n وقال المبرد: الخبر هو جملة: { فاقطعوا } \n ودخلت الفاء لمعنى الشرط لأن الموصول ـ وهو \" ألـ \" ـ فيه معنى الشرط\n ومثله:\n[النُّور: 2]\n قلت: وهو أظهر\n فإن قلت: ما الحكمة في تقديم المُذكر في هذه الآية\n وفي أية الزنا قدم المؤنث\n فقال:\n؟ فالجواب: أن السرقة في الرجال أكثر\n والزنى في النساء أكثر\n فقدّم الأكثر وقوعًا\n وقدّم العذاب هنا على المغفرة\n لأنه قابل بذلك تقدم السرقة على التوبة\n أو لأن المراد به القطع\n وهو مقدم في الدنيا\n و { جزاء } و { نكالاً }: علة أو مصدر\n يقول الحقّ جلّ جلاله: { والسارق والسارقة فاقطعوا أيديهما } أي: أيمانهما من الرسغ\n بشروط\n منها: ألاَّ يكون مضطرًا بالجوع\n على قول مالك\n فيقدم السرقة على الميتة\n إن عُلِم تصديقه\n ومنها: ألاَّ يكون السارق أبًا أو عبدًا سرق مال ولده أو سيده\n ومنها: أن يكون سرق من حرز\n وأن يكون نِصَابًا\n وهو ربع دينار\n أو ثلاثة دراهم\n أو ما يساويهما عند مالك والشافعي\n وقال أبو حنيفة: لا قطع في أقل من عشرة دراهم\n وقال عثمان البَتى: يُقطع في درهم فما فوق\n وفي السرقة أحكام مبسوطة في كتب الفقه\n وعلة القطع: الزجر\n ولذلك قال: { جزاء بما كسبا نكالاً من الله والله عزيز حكيم }\n فإن قلت: ما الحكمة في قطعها في ربع دينار\n مع أن دِيتَهَا أن قطعت\n خمسمائة دينار؟ قلت: ذل الخيانة أسقطت حرمتها بعد عز الصيانة\n فافهم حكمة الباري",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "79:25",
      "similarity": 0.6291519305578124
    },
    {
      "verse": "2:66",
      "similarity": 0.6075367278539558
    },
    {
      "verse": "73:12",
      "similarity": 0.5646838583300376
    },
    {
      "verse": "12:81",
      "similarity": 0.4444337135774881
    },
    {
      "verse": "12:73",
      "similarity": 0.40571879629619495
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005038.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005038.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:38.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}