{
  "chapter": "المائدة",
  "text": "يسـلونك ماذا احل لهم قل احل لكم الطيبت وما علمتم من الجوارح مكلبين تعلمونهن مما علمكم الله فكلوا۟ مما امسكن عليكم واذكروا۟ اسم الله عليه واتقوا۟ الله ان الله سريع الحساب",
  "translations": [
    {
      "translation": "They will ask you what is halal for them. Say: 'All good things are halal for you, and also what is caught for you by hunting animals which you have trained as Allah has taught you. Eat what they catch for you,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you what is lawful for them. Say: \"All things are lawful for you that are clean, and what the trained hunting animals take for you as you have trained then, in the light of God's teachings, but read over them the name of God, and fear (straying from the path of) God, for God is swift in the reckoning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you what has been made lawful to them. Say: 'All clean things have been made lawful to you, and such hunting animals as you teach, training them to hunt, teaching them the knowledge Allah has given you - you may eat what they catch for you - but invoke the name of Allah on it. Have fear of Allah (in violating His Law). Allah is swift in His reckoning.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), they ask you what has been made lawful for them (as food). Tell them, \"All pure things are made lawful for you.\" If you train dogs or other beasts for hunting, you should train them according to what God has taught you. It, then, is lawful for you to eat the animals that they hunt, provided you mention the Name of God over the prey. Have fear of God. Certainly God's reckoning is swift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you (O dear Prophet Mohammed – peace and blessings be upon him) what is made lawful for them; say, “Pure things are made lawful for you, and the beasts (and birds) of prey which you have trained and use for hunting, (and) you teach them what Allah has taught you; so eat what they kill and leave for you, and mention Allah’s name upon it – and keep fearing Allah; indeed Allah is Swift At Taking Account.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you what is lawful for them. Say: \"Lawful unto you are At-Tayyibat (the good things). And those Jawarih (beasts and birds of prey) which you have trained as hounds, training and teaching them (to catch) in the manner as directed to you by Allah; so eat of what they catch for you, but pronounce the Name of Allah over it, and have Taqwa of Allah. Verily, Allah is swift in reckoning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you as to what is allowed to them. Say: The good things are allowed to you, and what you have taught the beasts and birds of prey, training them to hunt-- you teach them of what Allah has taught you-- so eat of that which they catch for you and mention the name of Allah over it; and be careful of (your duty to) Allah; surely Allah is swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will question thee what is permitted them. Say: 'The good things are permitted you; and such hunting creatures as you teach, training them as hounds, and teaching them as God has taught you -- eat what they seize for you, and mention God's Name over it. Fear God; God is swift at the reckoning.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee (O Muhammad) what is made lawful for them. Say: (all) good things are made lawful for you. And those beasts and birds of prey which ye have trained as hounds are trained, ye teach them that which Allah taught you; so eat of that which they catch for you and mention Allah's name upon it, and observe your duty to Allah. Lo! Allah is swift to take account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they ask you what has been made lawful for them, say, \"All good things have been made lawful for you;\" and what you have taught your birds and beasts of prey to catch, training them as God has taught you. So eat what they catch for you, but first pronounce God's name over it. Fear God, for God is swift in taking account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee as to whatever is allowed unto them. Say thou: allowed unto you are all clean foods, and as to the animals of prey which ye have taught even as Allah hath taught you, eat of that which they have caught for you, and mention the name of Allah over it; and fear Allah, verily Allah is swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you as to what is lawful to them. Say, ‘All the good things are lawful to you.’ As for what you have taught hunting dogs [to catch], teaching them out of what Allah has taught you, eat of what they catch for you and mention Allah’s Name over it, and be wary of Allah. Indeed Allah is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee what is lawful to them (as food). Say: lawful unto you are (all) things good and pure: and what ye have taught your trained hunting animals (to catch) in the manner directed to you by Allah: eat what they catch for you, but pronounce the name of Allah over it: and fear Allah; for Allah is swift in taking account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you (O Muhammad SAW) what is lawful for them (as food). Say: \"Lawful unto you are At-Tayyibat [all kind of Halal (lawful-good) foods which Allah has made lawful (meat of slaughtered eatable animals, milk products, fats, vegetables and fruits, etc.)]. And those beasts and birds of prey which you have trained as hounds, training and teaching them (to catch) in the manner as directed to you by Allah; so eat of what they catch for you, but pronounce the Name of Allah over it, and fear Allah. Verily, Allah is Swift in reckoning.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you what is lawful to them. Say: 'The good things are lawful to you, as well as that which you have taught the birds and beasts of prey to catch, teaching them of what Allah has taught you. Eat of what they catch for you, pronouncing upon it the Name of Allah. And fear Allah, Allah is Swift at reckoning'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you what is permitted for them. Say, “Permitted for you are all good things, including what trained dogs and falcons catch for you.” You train them according to what God has taught you. So eat from what they catch for you, and pronounce God’s name over it. And fear God. God is Swift in reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you, [O Muhammad], what has been made lawful for them. Say, \"Lawful for you are [all] good foods and [game caught by] what you have trained of hunting animals which you train as Allah has taught you. So eat of what they catch for you, and mention the name of Allah upon it, and fear Allah.\" Indeed, Allah is swift in account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:4]   They will ask you, O Muhammad (s), about what, food, is made lawful for them. Say: ‘The good, delicious, things are made lawful for you; and the, quarry of, hunting creatures, dogs, wildcats or birds that catch food, you have taught, training [them] as hounds (mukallibīn is a circumstantial qualifier, derived from kallabtu al-kalba, meaning, ‘I released the hound against the quarry’) teaching them (tu‘allimūnahunna is a circumstantial qualifier referring to the subject of mukallibīn, ‘training [them] as hounds’, in other words, ‘disciplining them’) of what God has taught you, of the art of hunting; so eat what they have caught for you, even if they have killed it, as long as they have not eaten any of it. This is in contrast to the untrained [hunting creatures], whose catch is not lawful [for consumption]: the mark of these [being trained hunting creatures] is that they should return after they have been sent out, that they can be curbed when cried at and that they can seize the quarry without eating of it; the minimum number of times by which this may be known is three. If they eat any of it, then it cannot be counted as ‘what they have caught’ for their trainers, and is consequently unlawful for consumption, as reported in hadīth in both of the Sahīhs [of Bukhārī and Muslim] — therein it is also mentioned that a catch made by an arrow over which God’s name is mentioned is equivalent [in lawfulness] to the catch of trained hunting creatures. And mention God’s name over it, when you unleash it. And fear God. Indeed, God is swift at the reckoning’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They ask thee) Muhammad; the people who so asked were Zayd Ibn Muhalhil al-Ta'i and 'Adiyy Ibn Hatim al-Ta'i, both fishermen (what is made lawful for them) of game. (Say : (all) good things) all the immolated ones (are made lawful for you. And those beasts and birds of prey which ye have trained as ill hounds are trained, ye teach them) to abstain from eating game (that which Allah taught you) as Allah has taught you; (so eat of that which they) the trained dogs (catch for you and mention Allah's name upon it) upon immolating your game; and it is also said: upon sending the trained dogs upon the game, (and observe your duty to Allah) fear Allah about eating the meat of carrion. (Lo! Allah is swift to take account) His punishment is severe; it is also said that this means: when He is swift when He takes people to task.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا عَلَّمْتُمْ مِّنَ ٱلْجَوَارِحِ مُكَلِّبِينَ } معناهُ الصَوائِدُ\n من البَازِ والصّقرِ، والكِلابِ\n وغَيرِ ذَلِكَ\n مُكَلبِّينَ معناهُ أَصحابُ كِلابٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {And what you have taught of the beasts of prey} [means] the hunting dogs.\n\n\nFrom the eagles and the falcons, and the dogs.\n\n\nAnd other than that\n\n\n{People} who own {dogs}",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قُلْ أُحِل لكم الطيّبات } من الحقائق والمعارف الحقيّة والفضائل العلمية التي تحصل لكم بعقولكم وقلوبكم وأرواحكم { وما علمتم } من جوارح حواسكم الظاهرة والباطنة وسائر قواكم وآلاتكم البدنية في اكتساب الفضائل والآداب\n محرّضين { تعلمونهنّ مما علّمكم الله } من علوم الأخلاق والشرائع التي تبين طريق الاحتظاء من الحظوظ على وجه العدالة { فكلوا مما أمسكن عليكم } مما حصلن لكم بتعليمكم على ما ينبغي بنيّة وإرادة قلبية وغرض صحيح يؤدي إلى كمال الشخص أو النوع لا يهجن ويثبن وينزنّ عليه بميلهنّ وحرصهنّ لطلب لذتهنّ وشهوتهنّ { واذكروا اسْمَ الله عليه } واحضروا بقلوبكم أنها للصورة الإنسانية الكاملة تُقْصد وتُراد\n لا لغرض آخر\n واجعلوا الله وقاية لكم في فعلها حتى تكون حسنة { إن الله سريع الحِساب } يحاسبكم بها في آن لا في أزمنة\n كحصول هيآتها في أنفسكم عند ارتكابها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَسْأَلُونَكَ مَاذَآ } أي: أيّ شيء من الأشياء المألوفة المتعارفة { أُحِلَّ لَهُمْ قُلْ أُحِلَّ لَكُمُ } في دينكم { ٱلطَّيِّبَاتُ } التي مضى ذكرها في أول السورة من البهائم المذكاة { وَ } كذا أحل لكم صيد { مَا عَلَّمْتُمْ مِّنَ ٱلْجَوَارِحِ } الكواسب\n لكم الصيد من أدوات القوائم والمخالب حال كونكم { مُكَلِّبِينَ } مؤدبين\n معلمين إياهن لاصطياد { تُعَلِّمُونَهُنَّ مِمَّا عَلَّمَكُمُ ٱللَّهُ } من مقتضيات العقل المفاض لكم بأنواع الحيل إياهن\n\n\nوإذا علمتوهن { فَكُلُواْ مِمَّآ أَمْسَكْنَ عَلَيْكُمْ } من صيدهن حلالاً طيباً { وَٱذْكُرُواْ ٱسْمَ ٱللَّهِ عَلَيْهِ } أي: وعليكم أن تذكروا اسم الله حين إرسال الجوارح إلى الصيد { وَٱتَّقُواْ ٱللَّهَ } ألاَّ تهلوا على الصيد والذبائح\n ولا تحلوها بذكر اسم الله بعدها أمركم به { إِنَّ ٱللَّهَ } المطلع لجميع حالاتكم { سَرِيعُ ٱلْحِسَابِ } [المائدة: 4] شديد العقاب لمن لم يمتثل بأوامره\n ولم يجتنب عن نواهيه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ يَسْأَلُونَكَ مَاذَآ أُحِلَّ لَهُمْ قُلْ أُحِلَّ لَكُمُ ٱلطَّيِّبَاتُ وَمَا عَلَّمْتُمْ مِّنَ ٱلْجَوَارِحِ مُكَلِّبِينَ تُعَلِّمُونَهُنَّ مِمَّا عَلَّمَكُمُ ٱللَّهُ فَكُلُواْ مِمَّآ أَمْسَكْنَ عَلَيْكُمْ وَٱذْكُرُواْ ٱسْمَ ٱللَّهِ عَلَيْهِ وَٱتَّقُواْ ٱللَّهَ إِنَّ ٱللَّهَ سَرِيعُ ٱلْحِسَابِ ٱلْيَوْمَ أُحِلَّ لَكُمُ ٱلطَّيِّبَاتُ وَطَعَامُ ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ حِلٌّ لَّكُمْ وَطَعَامُكُمْ حِلٌّ لَّهُمْ\n\n\n }  قلت: لم يقل ماذا أحل لنا لأن { يسألونك } بلفظ الغيبة\n وكلا الوجهين شائع في أمثاله\n قاله البيضاوي\n يقول الحقّ جلّ جلاله: { يسألونك } يا محمد عن الذي { أُحل لهم } من المآكل\n بعد الذي حرم عليهم من الخبائث\n فقل لهم: { أحل لكم الطيبات } وهو عند مالك: ما لم يدل دليل على تحريمه من كتاب ولا سنة\n وعند الشافعي: ما يستلذه الطبع السليم ولم يفّر عنه\n فحرم الخنافس وشبهها\n { و } أحل لكم صيد { ما علّمتم من الجوارح } أي: الكواسب\n وهي الكلاب ونحوها\n مما يصطاد به ويكسب الصيد على أهله\n من سباع وذوات أربع\n وطير\n ونحوها\n حال كونكم { مُكلبين } أي: معلمين لها الاصطياد\n أي: مؤدبين لها\n { تُعلمونهن مما علمكم الله } من الحيل وصدق التأديب\n فإن العلم بها إلهام من الله\n أو مكتسب بالعقل الذي هو منحة من الله لابن آدم\n وحد التعليم عند ابن القاسم: أن يفهم الجارح الإشلاء والزجر\n وقيل: الإشلاء أي: التسلط ـ فقط\n وقيل الزجر فقط\n وقيل: أن يجيب إذا دُعي\n { فكلوا مما أمسكن عليكم } ولم يأكل منه\n لقوله صلى الله عليه وسلم:\n \" وإن أكَلَ\n فلاَ تَأكُل فَإنَّما أمسكَ عَلَى نَفسِه \" \nوهو مذهب الشافعي\n وقال مالك: يؤكل مطلقًا لما في بعض الأحاديث:\n \" وإن أكلَ فكُل \" \n\n وقال بعضهم: لا يشترط ذلك في سَباع الطير لأن تأديبها إلى هذا الحد متعذر\n { واذكروا اسم الله عليه } أي: على ما علمتم عند إرساله\n ولو لم ير المرسل عليه\n وكذا عند الرمي المحدد ونحوه\n فإن سمي على شيء مُعين ووجد غيره لم يؤكل\n أو التبس مع غيره\n وإن سمي على ما وجد أكل الجميع\n ولا بد من نية الذكاة عند الإرسال أو الرمي\n واختلف في حكم التسمية\n فقال الظاهرية: أنها واجبة مطلقًا\n فإن تركت عمدًا أو سهوًا لم تؤكل عندهم\n وقال الشافعي: مستحبة\n حملاً للأمر على الندب\n فإن تركت عمدًا أو سهوًا أكلت عنده\n وجعل بعضُهم الضمير في { عليه } \n عائدًا على الأكل\n فليس فيها على هذا أمر بالتسمية على الصيد\n ومذهب مالك: أنه إن تركت التسمية عمدًا لم تؤكل\n وإن تركت سهوًا أكلت\n فهي عنده واجبة بالذكر ساقطة بالنسيان\n وهذا الخلاف جار في الذكاة كلها\n { واتقوا الله } في اجتناب محرماته\n { إن الله سريع الحساب } \n فيؤاخذكم على ما جلّ ودق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "45:21",
      "similarity": 0.501766645793029
    },
    {
      "verse": "6:60",
      "similarity": 0.46986429186790035
    },
    {
      "verse": "5:45",
      "similarity": 0.30989784011717453
    },
    {
      "verse": "18:22",
      "similarity": 0.2836280786161
    },
    {
      "verse": "7:176",
      "similarity": 0.22553596224951583
    }
  ]
}