{
  "chapter": "المائدة",
  "text": "الم تعلم ان الله له ملك السموت والارض يعذب من يشاء ويغفر لمن يشاء والله على كل شىء قدير",
  "translations": [
    {
      "translation": "Do you not know that the kingdom of the heavens and earth belongs to Allah? He punishes whoever He wills and forgives whoever He wills. Allah has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that God's is the kingdom of the heavens and the earth? He punishes whom He will, and pardons whom He please, for God has the power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that to Allah belongs the dominion of the heavens and the earth? He chastises whom He wills and forgives whom He wills. Allah is All-Powerful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that to God belongs the Kingdom of the heavens and the earth and that He punishes or forgives whomever He wants? God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that to Allah only belongs the kingship of the heavens and the earth? He punishes whomever He wills, and forgives whomever He wills; and Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know you not that to Allah (Alone) belongs the dominion of the heavens and the earth! He forgives whom He wills and He punishes whom He wills. And Allah is able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that Allah-- His is the kingdom of the heavens and the earth; He chastises whom He pleases; and forgives whom He pleases and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knowest thou not that to God belongs the kingdom of the heavens and the earth? He chastises whom He will, and forgives whom He will; and God is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knowest thou not that unto Allah belongeth the Sovereignty of the heavens and the earth? He punisheth whom He will, and forgiveth whom He will. Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that the kingdom of the heavens and earth belongs to God? He punishes whom He will and forgives whom He pleases. God has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knowest thou not that Allah! - verily His is the dominion of the heavens and the earth; He chastiseth whomsoever He will and forgiveth whomsoever He will; and Allah is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that to Allah belongs the kingdom of the heavens and the earth? He punishes whomever He wishes, and forgives whomever He wishes, and Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knowest thou not that to Allah (alone) belongeth the dominion of the heavens and the earth? He punisheth whom He pleaseth, and He forgiveth whom He pleaseth: and Allah hath power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Know you not that to Allah (Alone) belongs the dominion of the heavens and the earth! He punishes whom He wills and He forgives whom He wills. And Allah is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that to Allah belongs the Kingdom of the heavens and the earth? He punishes whom He will and forgives whom He will. Allah has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that to God belongs the kingdom of the heavens and the earth? He punishes whom He wills, and He forgives whom He wills. And God is Capable of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you not know that to Allah belongs the dominion of the heavens and the earth? He punishes whom He wills and forgives whom He wills, and Allah is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:40] Do you not know (the interrogative here is meant as an affirmative) that to God belongs the kingdom of the heavens and the earth? He chastises, him for, whom He wills, chastisement for, and forgives, him for, whom He wills, forgiveness, and God has power over all things, including chastising and forgiving.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Knowest thou not) have you not been informed, Muhammad, in the Qur'an (that Unto Allah belongeth the Sovereignty) the stores (of the heavens and the earth? He punisheth whom He will) whoever deserves to be punished, (and forgiveth whom He will) whoever deserves to be punished. (Allah is Able to do all things): forgiving sins and other things.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَلَمْ تَعْلَمْ } أيها الداعي للخلق إلى الحق { أَنَّ ٱللَّهَ } المتوحد، المستقل بالألوهية والتصرف { لَهُ مُلْكُ ٱلسَّمَٰوَٰتِ } من الكائنات والفاسدات { وَٱلأَرْضِ } وما يتكون عليها، وكذا ما بينهما من بدائع الكوائن { يُعَذِّبُ مَن يَشَآءُ } من أهل التكاليف على ما صدر عنهم من الجرائم؛ عدلاً منه { وَيَغْفِرُ لِمَن يَشَآءُ } فضلاً منه { وَٱللَّهُ } المتصرف بالاستقلال في ملكه { عَلَىٰ كُلِّ شَيْءٍ } من الإنعام والانتقام { قَدِيرٌ } [المائدة: 40] له الإرادة والاختيار، يفعل ما يشاء، ويحكم ما يريد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ألم تعلم أن الله له ملك السماوات والأرض } يتصرف فيهما كيف شاء، فالخطاب للرسول ـ عليه الصلاة والسلام ـ أو لكل أحد، { يُعذب من يشاء ويغفر لمن يشاء } قال السدي: يُعذب من مات على كفره، ويغفر لمن تاب من كفره\n وقال الكلبي: { يُعذب من يشاء } على الصغيرة إذا أقام عليها { ويغفر لمن يشاء } على الكبيرة إذا نزع منها، { والله على كل شيء قدير } لا يعجزه شيء\n\n\nالإشارة: كما أمر الحق ـ جل جلاله ـ بقطع سارق الأموال، أمر بقطع سارق القلوب، وهو الشيطان، وجنوده الخواطر الردية فإن القلب بيت كنز السر ـ أي: سر الربوبية ـ لأن القلب بيت الرب، والبصيرة حارسة له، فإذا طرقه الشيطان بجنوده، فإن وجد البصيرة متيقظة دفعته وأحرقته بأنوار ذكرها، وأن وجدها نائمة فإن كان نومها خفيفًا اختلس منها وفطنت له، وإن كان نومها ثقيلاً بتراكم الغفلات، خرب البيت ولم تفطن له، فيسكن فيه بجنوده الخواطر وهي نائمة\n فالواجب على الإنسان حفظ قلبه، قبل أن يسكنه الشيطان، فيصعب دفعه، وحفظه بدوام ذكر الله القلبي، فإن لم يستطع فبدوام اللسان، فإن لم يستطع فبالنية الصالحة\n وربنا المستعان\n ثم تكلم على ما يتعلق باللسان، وهو الأمر الخامس مما تضمنته السورة، فقال: { يٰأَيُّهَا ٱلرَّسُولُ لاَ يَحْزُنكَ ٱلَّذِينَ يُسَارِعُونَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:189",
      "similarity": 0.7631456594150638
    },
    {
      "verse": "5:120",
      "similarity": 0.7490401713176936
    },
    {
      "verse": "48:14",
      "similarity": 0.6523623945944245
    },
    {
      "verse": "57:2",
      "similarity": 0.6311738348329424
    },
    {
      "verse": "25:2",
      "similarity": 0.5479850714719066
    }
  ]
}