{
  "chapter": "المائدة",
  "text": "يايها الرسول لا يحزنك الذين يسرعون فى الكفر من الذين قالوا۟ ءامنا بافوههم ولم تؤمن قلوبهم ومن الذين هادوا۟ سمعون للكذب سمعون لقوم ءاخرين لم ياتوك يحرفون الكلم منۢ بعد مواضعه يقولون ان اوتيتم هذا فخذوه وان لم تؤتوه فاحذروا۟ ومن يرد الله فتنته فلن تملك له من الله شيـا او۟لئك الذين لم يرد الله ان يطهر قلوبهم لهم فى الدنيا خزى ولهم فى الءاخرة عذاب عظيم",
  "translations": [
    {
      "translation": "O Messenger! do not be grieved by those who rush headlong into kufr among those who say 'We have iman' with their tongues when their hearts contain no iman and among the Jews. Those who listen to lies listen to other people who have not come to you, distorting words from their proper meanings, saying, 'If you are given this, then take it. If you are not given it, then beware!' If Allah desires misguidance for someone, you cannot help him against Allah in any way. Those are the people whose hearts Allah does not want to purify. They will have disgrace in this world and in the Next World they will have a terrible punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be not grieved, O Apostle, by those who hasten to outrace others in denial, and say with their tongues: \"We believe,\" but do not believe in their hearts. And those of the Jews who listen to tell lies, and spy on behalf of others who do not come to you, and who distort the words (of the Torah) out of context, and say: \"If you are given (what we say is true) accept it; but if you are not given it, beware.\" You cannot intercede with God for him whom God would not show the way. These are the people whose hearts God does not wish to purify. For them is ignominy in this world and punishment untold in the next --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Messenger! Do not be grieved on account of those who vie with one another in disbelieving: even though they be those who say with their mouths: 'We believe' even though their hearts have no faith; or they be Jews who have their ears eagerly turned to falsehood and spy for other people who did not chance to come to you, who pervert the words of Allah, taking them out of their proper context in order to distort their meaning. They say to people: 'If such and such teaching is given to you, accept it; if you are not given that, then beware! You can be of no avail to him whom Allah wills to fall into error. Those are the ones whose hearts Allah does not want to purify. For them there is degradation in this world and a mighty chastisement in the Next.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messenger, do not be grieved about the people who run back to disbelief. They only say that they believe but, in fact, they have no faith in their hearts. Some Jews knowingly listen to lies and accept the lies which come from others, (Jews), who have no relation with you and who distort certain words of the Bible and say to the people, \"Accept only those words which are the same as what We have told you. If you do not, then beware!\" You can not help those whom God wants to try. God does not want to cleanse the hearts of such people. They lead a disgraceful life in this world and in the life hereafter they will suffer a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Noble Messenger (Prophet Mohammed – peace and blessings be upon him)! Do not let yourself be aggrieved by the people who rush towards disbelief – those who say with their mouths, “We believe” but whose hearts are not Muslims; and some Jews; they listen a great deal to falsehood, and to other people who do not come to you; shifting Allah’s Words from their correct places; and say, “If this command is given to you, obey it, but if this is not given to you, then refrain”; and the one whom Allah wills to send astray, you will never be able to help him in the least against Allah; they are those whose hearts Allah did not will to cleanse; for them is disgrace in this world, and for them is a great punishment in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Messenger! Let not those who hurry to fall into disbelief grieve you, of such who say, \"We believe\" with their mouths but their hearts have no faith. And of the Jews are men who listen much and eagerly to lies, listening to others who have not come to you. They change the words from their places; they say, \"If you are given this, take it, but if you are not given this, then beware!\" And whomsoever Allah wants to put in Fitnah, you can do nothing for him against Allah. Those are the ones whose hearts Allah does not want to purify; for them there is a disgrace in this world, and in the Hereafter a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Apostle! let not those grieve you who strive together in hastening to unbelief from among those who say with their mouths: We believe, and their hearts do not believe, and from among those who are Jews; they are listeners for the sake of a lie, listeners for another people who have not come to you; they alter the words from their places, saying: If you are given this, take it, and if you are not given this, be cautious; and as for him whose temptation Allah desires, you cannot control anything for him with Allah. Those are they for whom Allah does not desire that He should purify their hearts; they shall have disgrace in this world, and they shall have a grievous chastisement in the hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Messenger, let them not grieve thee that vie with one another in unbelief, such men as say with their mouths 'We believe' but their hearts believe not; and the Jews who listen to falsehood, listen to other folk, who have not come to thee, perverting words from their meanings, saying, 'If you are given this, then take it; if you are not given it, beware!' Whomsoever God desires to try, thou canst not avail him anything with God. Those are they whose hearts God desired not to purify; for them is degradation in this world; and in the world to come awaits them a mighty chastisement;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Messenger! Let not them grieve thee who vie one with another in the race to disbelief, of such as say with their mouths: \"We believe,\" but their hearts believe not, and of the Jews: listeners for the sake of falsehood, listeners on behalf of other folk who come not unto thee, changing words from their context and saying: If this be given unto you, receive it, but if this be not given unto you, then beware! He whom Allah doometh unto sin, thou (by thine efforts) wilt avail him naught against Allah. Those are they for whom the Will of Allah is that He cleanse not their hearts. Theirs in the world will be ignominy, and in the Hereafter an awful doom;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messenger, do not be grieved by those who vie with one another in denying the truth; those who say with their tongues, \"We believe,\" but have no faith in their hearts; from among the Jews also, there are those who listen eagerly to any lies. They listen to you to convey to others [religious leaders] who do not come to you [out of pride and conceit]. They [these leaders] take words out of their context and say, \"If this be given to you, receive it, but if not, then beware!\" If anyone's trial is intended by God, you cannot in the least prevail against God on his behalf. Those whose hearts God does not intend to purify shall be subjected to disgrace in this world and a severe punishment in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O apostle! let not those grieve thee that hasten after infidelity from among these who say with their mouths: we believe, yet their hearts believe not, and from among those who are Judaised: listeners to falsehoods, listeners to anot her people who come not unto thee; they pervert the words after they have been set in their places, saying: if that which is given you be this accept it, but if that is not given you, beware. And whosesoever temptation Allah Willeth, thou shalt not avail him against Allah in aught. These are they whose hearts Allah would not cleanse; theirs is humiliation in this world and theirs shall be in the Hereafter a mighty torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Apostle! Do not grieve for those who are active in [promoting] unfaith, such as those who say, ‘We believe’ with their mouths, but whose hearts have no faith, and the Jews who eavesdrop with the aim of [telling] lies [against you] and eavesdrop for other people who do not come to you. They pervert words from their meanings, [and] say, ‘If you are given this, take it, but if you are not given this, beware!’ Yet whomever Allah wishes to mislead, you cannot avail him anything against Allah. They are the ones whose hearts Allah did not desire to purify. For them is disgrace in this world, and there is a great punishment for them in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Messenger! let not those grieve thee, who race each other into unbelief: (whether it be) among those who say \"We believe\" with their lips but whose hearts have no faith; or it be among the Jews,- men who will listen to any lie,- will listen even to others who have never so much as come to thee. They change the words from their (right) times and places: they say, \"If ye are given this, take it, but if not, beware!\" If any one's trial is intended by Allah, thou hast no authority in the least for him against Allah. For such - it is not Allah's will to purify their hearts. For them there is disgrace in this world, and in the Hereafter a heavy punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Messenger (Muhammad SAW)! Let not those who hurry to fall into disbelief grieve you, of such who say: \"We believe\" with their mouths but their hearts have no faith. And of the Jews are men who listen much and eagerly to lies - listen to others who have not come to you. They change the words from their places; they say, \"If you are given this, take it, but if you are not given this, then beware!\" And whomsoever Allah wants to put in Al-Fitnah [error, because of his rejecting the Faith], you can do nothing for him against Allah. Those are the ones whose hearts Allah does not want to purify (from disbelief and hypocrisy); for them there is a disgrace in this world, and in the Hereafter a great torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Messenger, do not grieve for those who race into disbelief; those who say with their mouth: 'We believe' yet their hearts did not believe, and the Jews who listen to lies and listen to other nations who have not come to you. They pervert the words in their places and say: 'If you are given this, accept it; if not, then beware' Whomsoever Allah wishes to try, you will not own anything with Allah concerning him. For those whose hearts Allah does not will to purify shall be disgrace in this world and a grievous punishment in the Everlasting Life.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Messenger! Do not let those who are quick to disbelief grieve you—from among those who say with their mouths, “We believe,” but their hearts do not believe; and from among the Jews—listeners to lies, listeners to other people who did not come to you. They distort words from their places, and they say, “If you are given this, accept it; but if you are not given it, beware.” Whomever God has willed to divert, you have nothing for him from God. Those are they whose hearts God does not intend to purify. For them is disgrace in this world, and for them is a great punishment in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Messenger, let them not grieve you who hasten into disbelief of those who say, \"We believe\" with their mouths, but their hearts believe not, and from among the Jews. [They are] avid listeners to falsehood, listening to another people who have not come to you. They distort words beyond their [proper] usages, saying \"If you are given this, take it; but if you are not given it, then beware.\" But he for whom Allah intends fitnah - never will you possess [power to do] for him a thing against Allah. Those are the ones for whom Allah does not intend to purify their hearts. For them in this world is disgrace, and for them in the Hereafter is a great punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:41] O Messenger, let them not grieve you, the actions of, those who vie with one another in disbelief, falling   headlong into it, in other words, they [who] manifest it at every opportunity, of (min here is explicative) such as say with their mouths, with their tongues (bi-alsinatihim is semantically connected to qālū, ‘[such] as say’), ‘We believe’ but their hearts do not believe, and these are the hypocrites; and from among those of Jewry, there is a folk, who listen to calumny, fabricated by their rabbis, listening acceptingly, listening to, you, on behalf of some, other folk, from among the Jews, who have not come to you: these were the inhabitants of Khaybar, among whom two married persons committed adultery, but whom they did not want to stone. And so they dispatched [men from] Qurayza to ask the Prophet (s) about the ruling concerning the two; perverting words, that are in the Torah, such as the ‘stoning’ verse, from their contexts, [the contexts] in which God had placed them, that is to say, substituting them, saying, to the ones they dispatched: ‘If you are given this, distorted ruling, that is, flogging, which Muhammad (s) has pronounced for you as a ruling, then take it, accept it; but if you are not given it, and he pronounces some other ruling for you, then beware!’, of accepting it! Whomever God desires to try, to lead astray, you cannot avail him anything against God, by preventing such [a trial]. Those are they whose hearts God did not desire to purify, of unbelief, for had He desired it, you would have [been able to do something for them]; theirs shall be degradation in this world, humiliation, by being disgraced and subjected to the jizya, and in the Hereafter theirs shall be a great chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 Messenger!) Muhammad (Let not them grieve you who vie one with another in the race to disbelief) in allying themselves with the disbelievers in this world and in the Hereafter, (of such as say with their mouths) with their tongues: (\"We believe,\") in our hearts (but their hearts believe not) i.e. the hearts of the hypocrites, 'Abdullah Ibn Ubayy and his followers, (and of the Jews) i.e. the Jews of the Banu Qurayzah, Ka'b and his followers: (listeners for the sake of falsehood) listeners of untruth, (listeners on behalf of other folk) the people of Khaybar (who come not unto thee) regarding what happened among them, but Banu Qurayzah asked about them, (changing words) changing the traits and description of Muhammad and the legal ruling on the stoning of married people who commit adultery (from their context) after being exposited in the Torah (and saying) i.e. the leaders to their followers; it is also said: the hypocrites 'Abdullah Ibn Ubayy and his followers: (If this be given unto you) if Muhammad (pbuh) command you to whip [married people who committed adultery], (receive it) accept it from him and act according to it (but if this be not given unto you) if Muhammad does not command you to whip them and instead commands you to stone them, (then beware!) i.e. beware of following him if does not command you to whip them and, instead, commands you to stone them. Allah said: (He whom Allah doometh unto sin) he whom Allah wants to persist in his disbelief and idolatry; it is also said: he whom Allah wants to expose; and it is also said that this means: he whom Allah wants to test, (thou (by thine efforts) will avail him naught against Allah) against Allah's punishment. (Those are) the Jews and the hypocrites (they for whom the will of Allah is that He cleanse not their hearts) from scheming, treachery and persistence in disbelief. (Theirs in the world will be ignominy) punishment through killing and expulsion, (and in the Hereafter an awful doom) more severe than the punishment they suffer in this world;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَن يُرِدِ ٱللَّهُ فِتْنَتَهُ } فالفِتْنَةُ: الأَمرُ والإِرَادَةُ والاختِبارُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"And whoever Allah wills to test, He will test them,\" the Fitnah is the affair, the will, and the test.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "{ يٰأَيُّهَا ٱلرَّسُولُ } البعوث بالحق على كافة الخلق بشيراً ونذيراً { لاَ يَحْزُنكَ } صنيع الفرق { ٱلَّذِينَ يُسَارِعُونَ فِي ٱلْكُفْرِ } أي: يسرعون إليه عند الفرصة؛ لكون جبلتهم عليه وميلهم بالطبع نحوه { مِنَ } المداهنين المنافقين { ٱلَّذِينَ قَالُوۤاْ } حفظاً لدمائهم وأموالهم: { آمَنَّا } قولاً مجرداً { بِأَفْوَاهِهِمْ وَ } الحال أنه { لَمْ تُؤْمِن } ولم تذعن { قُلُوبُهُمْ } بل ختم عليها بالكفر.\n\n{ وَ } علامة كفرهم أنهم من غاية نفاقهم معك ومع من تبعك { مِنَ ٱلَّذِينَ هَادُواْ سَمَّاعُونَ لِلْكَذِبِ } أي: للكذب المفترى بالتورية، بأنك لست النبي الموعود فيها ومصدقون لها من الذين هادوا، قدم الاختصاص؛ إذ لا مصاحبة للمنافقين مع المؤمنين خصوصاً في خلواتهم، بل مع أحبار اليهود، وهم من أعدى عدوك، وأشدهم غيظاً وبغضاً، ومع ذلك { سَمَّاعُونَ } أيضاً { لِقَوْمٍ آخَرِينَ } ممن آمن بك من أقاربهم وعشائرهم؛ لضلوهم عن طريق الحق، ومن لم يؤمن لك يميلون بقلوبهم إلى الإيمان ليقعدوهم، وليصرفوهم عمَّا نووا في نفوسهم، وكيف لا يكون أحبار اليهود من أعدى عدوك يا أكمل الرسل، وهم من غاية بغضهم معك { لَمْ يَأْتُوكَ }؟.\n\nومع عدم إتيانهم { يُحَرِّفُونَ } ويغيرون { ٱلْكَلِمَ } المنزلة في التوراة بيان بعثتك ووصفك وحليتك، ومنشأتك وحسبك ونسبك وعلو شأنك، ووضوح برهانك وتكملتك أمر النبوة والرسالة، ونسخك جمع الأديان { مِن بَعْدِ } كونه مثبتاً عن { مَوَاضِعِهِ } بوضع إلهي، وهم أيضاً من غاية بغضهم معك { يَقُولُونَ } لإخوانهم حينما حكموك في أمر؛ لشهرة أمانتك، ووثوقهم برأيك وعزيمتك في قطع الخصومات: { إِنْ أُوتِيتُمْ } وحكمتم طبق { هَـٰذَا } أي: المحرف { فَخُذُوهُ } واقبلوه، وامضوا عليه، وارضوا به { وَإِن لَّمْ تُؤْتَوْهُ } موافقاً له { فَٱحْذَرُواْ } منه، وأعرضوا عنه.\n\nثم قال سبحانه؛ تسليةً لرسول الله صلى الله عليه وسلم: { وَمَن يُرِدِ ٱللَّهُ فِتْنَتَهُ } كفره وظلمته وقساوته { فَلَن تَمْلِكَ لَهُ مِنَ ٱللَّهِ شَيْئاً أُوْلَـٰئِكَ } البعداء عن نهج الرشاد من الكفارين { ٱلَّذِينَ لَمْ يُرِدِ ٱللَّهُ } ولم يتعلق مشيئته { أَن يُطَهِّرَ قُلُوبَهُمْ } من خباثة الكفر الشرك { لَهُمْ فِي ٱلدُّنْيَا خِزْيٌ } هوان وصغار وجزية وذلة ومسكنة { وَلَهُمْ فِي ٱلآخِرَةِ عَذَابٌ عَظِيمٌ } [المائدة: 41] هو الخلود في نار الحرمان عن مرتبة الإنسان.\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ يٰأَيُّهَا ٱلرَّسُولُ لاَ يَحْزُنكَ ٱلَّذِينَ يُسَارِعُونَ فِي ٱلْكُفْرِ مِنَ ٱلَّذِينَ قَالُوۤاْ آمَنَّا بِأَفْوَاهِهِمْ وَلَمْ تُؤْمِن قُلُوبُهُمْ\n\n\n }  قلت: الباء في: { بأفواههم } ـ متعلقة بقالوا\n يقول الحقّ جلّ جلاله: { يا أيها الرسول لا يحزنك } صنع المنافقين\n { الذين يسارعون في الكفر } أي: يقعون فيه سريعًا\n فيظهرونه إن وجدوا فرصة\n ثم بينهم بقوله: { من الذين قالوا آمنا } قالوه { بأفواههم ولم تؤمن قلوبهم } \n فلا يهولنّك شأنهم ولا تحتفل بكيدهم\n فإن الله سيكفيك أمرهم\n الإشارة: من شأن العارفين بالله تذكير عباد الله\n ثم ينظرون إلى ما يفعل الله\n فلا يحزنون على من لم تنفعه الموعظة\n ولا يفرحون بسبب نجاح موعظتهم\n إلا من حيث موافقة رضا ربهم\n فهم في ذلك على قدم نبيهم\n آخذين بوصية ربهم\n والله تعالى أعلم\n ثم رجع إلى عتاب اليهود\n فقال: {\n\n\n وَمِنَ ٱلَّذِينَ هِادُواْ سَمَّاعُونَ لِلْكَذِبِ سَمَّاعُونَ لِقَوْمٍ آخَرِينَ لَمْ يَأْتُوكَ يُحَرِّفُونَ ٱلْكَلِمَ مِن بَعْدِ مَوَاضِعِهِ يَقُولُونَ إِنْ أُوتِيتُمْ هَـٰذَا فَخُذُوهُ وَإِن لَّمْ تُؤْتَوْهُ فَٱحْذَرُواْ وَمَن يُرِدِ ٱللَّهُ فِتْنَتَهُ فَلَن تَمْلِكَ لَهُ مِنَ ٱللَّهِ شَيْئاً أُوْلَـٰئِكَ ٱلَّذِينَ لَمْ يُرِدِ ٱللَّهُ أَن يُطَهِّرَ قُلُوبَهُمْ لَهُمْ فِي ٱلدُّنْيَا خِزْيٌ وَلَهُمْ فِي ٱلآخِرَةِ عَذَابٌ عَظِيمٌ سَمَّاعُونَ لِلْكَذِبِ أَكَّالُونَ لِلسُّحْتِ فَإِن جَآءُوكَ فَٱحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ وَإِن تُعْرِضْ عَنْهُمْ فَلَن يَضُرُّوكَ شَيْئاً وَإِنْ حَكَمْتَ فَٱحْكُمْ بَيْنَهُمْ بِٱلْقِسْطِ إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُقْسِطِينَ وَكَيْفَ يُحَكِّمُونَكَ وَعِنْدَهُمُ ٱلتَّوْرَاةُ فِيهَا حُكْمُ ٱللَّهِ ثُمَّ يَتَوَلَّوْنَ مِن بَعْدِ ذٰلِكَ وَمَآ أُوْلَـٰئِكَ بِٱلْمُؤْمِنِينَ }  قلت: { ومن الذين هادوا }: يُحتمل أن يكون عطفًا على { الذين قالوا } أي: لا يحزنك شأن المنافقين واليهود\n و { سماعون }: خبر\n أي: هم سماعون\n ويحتمل أن يكون استئنافاً\n فيكون { سماعون }: مبتدأ على حذف الموصوف\n و { من }: خبر\n أي: ومن الذين هادوا قوم سماعون\n واللام في: { للكذب }: إما مزيدة للتأكيد\n أو لتضمين السماع معنى القبول\n وجملة { لم يأتوك }: صفة لقوم\n وجملة { يحرّفون }: صفة أخرى له\n يقول الحقّ جلّ جلاله: { ومن الذين هادوا } صنف { سماعون للكذب } أي: كثيروا السماع للكذب والقبول له\n وهم يهود بني قريظة\n { سماعون لقوم آخرين } وهم يهود خيبر\n { لم يأتوك } أي: لم يحضروا مجلسك\n تكبرًا وبغضًا\n { يُحرفون الكلم من بعد مواضعه } أي: يميلونه عن مواضعه الذي وضعه الله فيها\n إما لفظًا أو تأويلاً: { يقولون }: أي: الذين لم يأتوا النبي صلى الله عليه وسلم\n وهم يهود خيبر: { إن أُوتيتم هذا فخذوه } أي: إن أوتيتم هذا المحرّف وأفتاكم محمد بما يوافقه فخذوه\n { وإن لم تُؤتوه } بأن أفتاكم بغيره { فاحذروا } أن تقبلوا منه\n وسبب نزولها: أن شريفًا مِن يهود خَيْبَرَ زنى بِشريفة منهم\n وكانا مُحصنَين\n وكرهوا رجمهما\n فأرسلوا مع رَهطِ منهم إلى بَني قريظة ليسألوا رسولَ الله صلى الله عليه وسلم\n وقالوا لهم: إن أمَرَكُم بالجَلّد والتَّحمِيم فَاقبلُوا\n وإن أمَرَكُم بالرَّجم فاحذروا أن تقبلوه منه\n فأتوا رسولَ الله صلى عليه وسلم بالزَّانِيين\n ومعَهما ابن صوريا\n فاستفتوه صلى الله عليه وسلم\n فقال لابن صوريا: أنشُدكَ اللهَ الذي لا إله إلا هُو\n الذِي فَلَق البَحرَ لمُوسى\n ورفع فوقكم الطور\n وأنجاكُم وأغْرَقَ آلَ فِرعَونَ\n والذِي أنزل علَيكُم كِتَابه\n وأحلَّ حَلاله وحرَّم حَرَامه\n هل تجد فيه الرَّجمَ على من أحصن؟ فقال: نعم\n فوثبوا عليه\n فقال: خِفتُ إن كَذبتَه أن ينزل علينا العذاب\n فأمر رسولُ الله صلى الله عليه وسلم بالزَّانِيين فرُجِمَا عندَ باب المسجد\n وفي رواية: دعاهم إلى التوراة فأتوا بها\n فوضع ابن صوريا يده على آية الرجم\n وقرأ ما حولها\n فقال له عبدالله بن سلام: ارفع يدك\n فإذا آية الرجم تلوح\n فرجما\n\nوفي القصة اضطراب كثير\n ولعل القضية تعددت\n قال تعالى: { ومن يُرِد الله فتنته } أي: ضلالته أو فضيحته\n { فلن تملك له من الله شيئًا } أي: تقدر على دفعها عنه\n { أولئك الذين لم يُرد الله أن يُطهر قلوبهم } من الكفر والشرك\n { لَهُم في الدُّنيَا خزيٌ } أي: هوان وذل بضرب الجزية والخوف من المؤمنين\n { ولهم في الآخرة عذاب عظيم } وهو الخلود في النيران\n هم { سماعون للكذب } \n كرر للتأكيد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:11",
      "similarity": 0.41028830794946697
    },
    {
      "verse": "2:75",
      "similarity": 0.4005680937134156
    },
    {
      "verse": "4:46",
      "similarity": 0.28784443051439856
    },
    {
      "verse": "18:5",
      "similarity": 0.2532319876924458
    },
    {
      "verse": "5:13",
      "similarity": 0.25002890729338295
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005041.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005041.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:41.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}