{
  "chapter": "المائدة",
  "text": "سمعون للكذب اكلون للسحت فان جاءوك فاحكم بينهم او اعرض عنهم وان تعرض عنهم فلن يضروك شيـا وان حكمت فاحكم بينهم بالقسط ان الله يحب المقسطين",
  "translations": [
    {
      "translation": "They are people who listen to lies and consume ill-gotten gains. If they come to you, you can either judge between them or turn away from them. If you turn away from them, they cannot harm you in any way. But if you do judge, judge between them justly. Allah loves the just.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eavesdropping for telling lies, earning through unlawful means! So, if they come to you, judge between them or decline. And if you decline, they can do you no harm; but if you judge, you should do so with justice, for God loves those who are just.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are listeners of falsehood and greedy devourers of unlawful earnings. If they come to you you may either judge between them or turn away from them. And were you to turn away from them they shall not be able to harm you; and were you to judge between them judge with justice. Surely Allah loves the just.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They deliberately listen to lies (for deceitful purposes) and live on usury. If they come to you (seeking your judgment to settle their differences), you may settle their disputes or keep aloof from them. Should you choose not to bother with them, it will not harm you in the least. If you decide to issue your decree, decide their case with justice. God loves those who are just.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The excessively eager listeners of falsehood, extreme devourers of the forbidden; so if they come humbly to you (Prophet Mohammed – peace and blessings be upon him), judge between them or shun them; and if you turn away from them they cannot harm you at all; and if you do judge between them, judge with fairness; indeed Allah loves the equitable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (like to) listen to falsehood, to devour Suht. So if they come to you, either judge between them, or turn away from them. If you turn away from them, they cannot hurt you in the least. And if you judge, judge with justice between them. Verily, Allah loves those who act justly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They are) listeners of a lie, devourers of what is forbidden; therefore if they come to you, judge between them or turn aside from them, and if you turn aside from them, they shall not harm you in any way; and if you judge, judge between them with equity; surely Allah loves those who judge equitably.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who listen to falsehood, and consume the unlawful. If they come to thee, judge thou between them, or turn away from them; if thou turnest away from them, they will hurt thee nothing; and if thou judgest, judge justly between them; God loves the just.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Listeners for the sake of falsehood! Greedy for illicit gain! If then they have recourse unto thee (Muhammad) judge between them or disclaim jurisdiction. If thou disclaimest jurisdiction, then they cannot harm thee at all. But if thou judgest, judge between them with equity. Lo! Allah loveth the equitable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They listen eagerly to falsehood, and devour forbidden things voraciously. If they come to you, then judge between them or avoid them. If you avoid them, they can in no way harm you, but if you do judge, judge them with fairness: God loves those that deal justly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Listeners are they to falsehood, devourers of the forbidden. Wherefore if they come to thee, either judge between them or turn away from them. And if thou turnest away from them, they shall not be able to hurt thee in aught; and if thou judgest, judge between them with equity, verily Allah loveth the equitable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eavesdroppers with the aim of [telling] lies, eaters of the unlawful—if they come to you, judge between them, or disregard them. If you disregard them, they will not harm you in any way. But if you judge, judge between them with justice. Indeed Allah loves the just.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They are fond of) listening to falsehood, of devouring anything forbidden. If they do come to thee, either judge between them, or decline to interfere. If thou decline, they cannot hurt thee in the least. If thou judge, judge in equity between them. For Allah loveth those who judge in equity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They like to) listen to falsehood, to devour anything forbidden. So if they come to you (O Muhammad SAW), either judge between them, or turn away from them. If you turn away from them, they cannot hurt you in the least. And if you judge, judge with justice between them. Verily, Allah loves those who act justly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are listeners to lies and devourers of the unlawful. If they come to you, judge between them or turn away from them. If you avoid them they cannot harm you in anything; but if you judge, judge between them with fairness. Allah loves the just.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Listeners to falsehoods, eaters of illicit earnings. If they come to you, judge between them, or turn away from them. If you turn away from them, they will not harm you in the least. But if you judge, judge between them equitably. God loves the equitable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[They are] avid listeners to falsehood, devourers of [what is] unlawful. So if they come to you, [O Muhammad], judge between them or turn away from them. And if you turn away from them - never will they harm you at all. And if you judge, judge between them with justice. Indeed, Allah loves those who act justly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:42] They are, listeners to calumny and consumers of unlawful gain (read suhut or suht), that which is illicit, such as bribes. If they come to you, to judge between them, then judge between them or turn away from them: the [second] option given here was abrogated by His saying, So judge between them [to the end of] the verse [Q. 5:48]. Therefore, we [Muslims] are obliged to judge between them if they request arbitration before us — and this is the more sound of al-Shāfi‘ī’s two opinions. If their request for arbitration involves a Muslim, however, then we are obliged to judge according to the consensus [of legal scholars and not just alShāfi‘ī]); if you turn away from them, they cannot harm you at all; and if you judge, between them, then judge justly between them; God loves the just, those that judge fairly, meaning that He will reward them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله : { سمّاعون للكذب } خبر مبتدأ محذوف ، تقديره : هم سمّاعون للكذب . والظاهر أنّ الضّمير المقدّر عائد على الفريقين : المنافقين واليهودِ ، بقرينة الحديث عن الفريقين .وحذفُ المسند إليه في مثل هذا المقام حذف اتّبع فيه الاستعمال ، وذلك بعد أن يذكروا متحدّثاً عنه أو بعدَ أن يصدر عن شيء أمر عجيب يأتون بأخبار عنه بجملة محذوففٍ المبتدأ منها ، كقولهم للّذي يصيب بدون قصد «رَمْيَة من غير رَام» ، وقول أبي الرقَيش :سريع إلى ابن العمّ يلطُمُ وجهه ... وليس إلى داعي الندى بسريعوقول بعض شعراء الحماسة :فتى غير محجوب الغنى عن صديقه ... ولا مظهر الشكوى إذا النّعل زلّتعقب قوله :سأشكر عَمْراً إن تراختْ منيّتي ... أياديَ لم تُمنَنْ وإن هي جَلَّتوالسمَّاع : الكثيرُ السمع ، أي الاستماععِ لما يقال له . والسَّمع مستعمل في حقيقته ، أي أنّهم يُصغون إلى الكلام الكذب وهم يعرفونه كَذِبا ، أي أنّهم يحفلون بذلك ويتطلّبونه فيكثر سماعهم إيّاه . وفي هذا كناية عن تفشّي الكذب في جماعتهم بين سامع ومختلق ، لأنّ كثرة السمع تستلزم كثرة القول . والمراد بالكذب كذب أحبارهم الزاعمين أنّ حكم الزّنى في التّوراة التّحميمُ .وجملة { سمّاعون لقوم آخرين لم يأتوك } خبر ثان عن المبتدأ المحذوف . والمعنى أنّهم يقبلون ما يأمرهم به قوم آخرون من كَتم غرضهم عن النّبيء صلى الله عليه وسلم حتّى إن حكم بما يهوَون اتّبعوه وإن حكم بما يخالف هواهم عصَوه ، أي هم أتباع لقوم متستّرين هم القوم الآخرون ، وهم أهل خيبر وأهل فَدَك الّذين بعثوا بالمسألة ولم يأت أحد منهم النّبيء صلى الله عليه وسلم واللام في { لِقوم } للتقوية لضعف اسم الفاعل عن العمل في المفعول .وجملة { يحرّفون الكلم } صفة ثانية { لقوم آخرين } أو حال ، ولك أن تجعلها حالاً { من الّذين يسارعون في الكفر } . وتقدّم الكلام في تحريف الكلم عند قوله تعالى : { من الّذين هادوا يحرّفون الكلم عن مواضعه } في سورة النّساء ( 46 ) ، وأنّ التّحريف الميل إلى حرف ، أي جانب ، أي نقله من موضعه إلى طرف آخر .وقال هنا مِن بعد مواضعه ، وفي سورة النساء ( 46 ) عَن مواضعه ، لأنّ آية سورة النّساء في وصف اليهود كلّهم وتحريفهم في التّوراة . فهو تغيير كلام التّوراة بكلام آخر عن جهل أو قصد أو خطأ في تأويل معاني التّوراة أو في ألفاظها . فكان إبعاداً للكلام عن مواضعه ، أي إزالة للكلام الأصلي سواء عوّض بغيره أو لم يعوّض . وأمّا هاته الآية ففي ذكر طائفة معيّنة أبطلوا العمل بكلام ثابتتٍ في التّوراة إذْ ألغوا حكم الرّجم الثّابت فيها دون تعويضه بغيره من الكلام ، فهذا أشدّ جرأة من التّحريف الآخر ، فكان قوله : من بعد مواضعه } أبلغَ في تحريف الكلام ، لأنّ لفظ ( بعد ) يقتضي أنّ مواضع الكلم مستقرّة وأنّه أبطل العمل بها مع بقائها قائمة في كتاب التّوراة .والإشارة الّتي في قوله : { إن أوتيتم هذا } إلى الكلم المحرّف . والإيتاء هنا : الإفادة كقوله : { وآتاه الله المُلك والحكمة } \\[ البقرة : 251 \\] .والأخذ : القبول ، أي إن أُجبتم بمثل ما تهوَون فاقبلوه وإن لم تجَابوه فاحذروا قبوله . وإنّما قالوا : فاحذروا ، لأنّه يفتح عليهم الطعن في أحكامهم الّتي مَضَوْا عليها وفي حكّامهم الحاكمين بها .وإرادة الله فتنة المفتون قضاؤها له في الأزل ، وعلامة ذلك التّقدير عدم إجداء الموعظة والإرشاد فيه . فذلك معنى قوله : { فلَن تملك له من الله شيئاً } ، أي لا تبلغ إلى هديه بما أمرك الله به من الدّعوة للنّاس كافّة .وهذا التّركيب يدلّ على كلام العرب على انتفاء الحيلة في تحصيل أمر مّا .ومدلول مفرداته أنّك لا تملك ، أي لا تقدر على أقلّ شيء من الله ، أي لا تستطيع نيل شيء من تيسير الله لإزالة ضلالة هذا المفتون ، لأنّ مادّة المِلك تدلّ على تمام القدرة ، قال قَيْس بن الخطيم :مَلكتُ بها كَفِّي فأنْهَر فَتْقَهَا ... أي شددت بالطعنة كفّي ، أي ملكتها بكفّي ، وقال النّبيء صلى الله عليه وسلم لعُيَينة بن حِصْن \" أوَ أمْلِكُ لك أن نزع الله من قلبك الرّحمة \" وفي حديث دعوة الرّسول صلى الله عليه وسلم عشيرته \" فإنّي لا أغني عنكم من الله شيئاً \"و { شيئاً } منصوب على المفعولية . وتنكير { شيئاً } للتقليل والتّحقير ، لأنّ الاستفهام لمّا كان بمعنى النّفي كان انتفاء ملك شيء قليللٍ مقتضياً انتفاءَ ملك الشيء الكثير بطريق الأولى .والقول في قوله : { أولئك الّذين لم يرد الله أن يطهّر قلوبهم } كالقول في قوله : { ومن يرد الله فتنته } . والمراد بالتطهير التهيئة لقبول الإيمان والهدَى أو أراد بالتطهير نفس قبول الإيمان .والخزي تقدّم عند قوله تعالى : { إلاّ خزي } في سورة البقرة ( 85 ) ، وقوله : { ربنا إنّك من تدخل النار فقد أخزيته } في سورة آل عمران ( 192 ) .وأعاد سَمَّاعون للكذب } للتّأكيد وليرتّب عليه قوله { أكّالون للسحت } .ومعنى { أكَّالون للسحت } أخَّاذون له ، لأنّ الأكل استعارة لتمام الانتفاع . والسحت بضمّ السين وسكون الحاء الشيء المسحوت ، أي المستأصل . يقال : سحته إذا استأصَله وأتلفه . سمّي به الحرام لأنّه لا يُبارك فيه لصاحبه ، فهو مسحوت وممحوق ، أي مقدّر له ذلك ، كقوله { يمحق الله الرّبا } \\[ البقرة : 276 \\] ، قال الفرزدق :وعَضُّ زماننٍ يابنَ مروانَ لم يَدع ... من المال إلاّ مُسْحَت أو مجَنَّفوالسحت يشمل جميع المال الحرام ، كالربا والرّشوة وأكل مال اليتيم والمغصوب .وقرأ نافع ، وابن عامر ، وعاصم ، وحمزة ، وأبو جعفر ، وخلف «سحْت» بسكون الحاء وقرأه الباقون بضمّ الحاء إتْباعاً لضمّ السّين .تفريع على ما تضمّنه قوله تعالى : { سمّاعون لقوم آخرين لم يأتوك } وقوله : { يقولون إن أوتيتم هذا فخذوه } ، فإنّ ذلك دلّ على حِوار وقع بينهم في إيفاد نفر منهم إلى رسول الله صلى الله عليه وسلم للتحكيم في شأن من شئونهم مالت أهواؤهم إلى تغيير حكم التّوراة فيه بالتّأويل أو الكتمان ، وأنكر عليهم منكرون أو طالبوهم بالاستظهار على تأويلهم فطمعوا أن يجدوا في تحكيم النّبيء صلى الله عليه وسلم ما يعتضدون به . وظاهر الشرط يقتضي أنّ الله أعلم رسوله باختلافهم في حكم حدّ الزّنا ، وبعزمهم على تحكيمه قبل أن يصل إليه المستفتون . وقد قال بذلك بعض المفسّرين فتكون هذه الآية من دلائل النّبوءة . ويحتمل أنّ المراد : فإن جاؤوك مرّة أخرى فاحكم بينهم أو أعرض عنهم .وقد خيّر الله تعالى رسوله صلى الله عليه وسلم في الحكم بينهم والإعراض عنهم . ووجه التخيير تعارض السببين؛ فسبب إقامة العدل يقتضي الحكمَ بينهم ، وسبب معاملتهم بنقيض قصدهم من الاختبار أو محاولة مصادفة الحكم لهواهم يقتضي الإعراض عنهم لئلاّ يعرّض الحكم النبوي للاستخفاف .وكان ابتداء التخيير في لفظ الآية بالشقّ المقتضي أنّه يحكم بينهم إشارة إلى أنّ الحكم بينهم أولى . ويؤيّده قوله بعد { وإن حكمت فاحكم بينهم بالقسط إنّ الله يحبّ المقسطين } أي بالحقّ ، وهو حكم الإسلام بالحدّ . وأمّا قوله : { وإن تُعرض عنهم فلن يضرّوك شيئاً } فذلك تطمين للنّبيء صلى الله عليه وسلم لئلاّ يقول في نفسه : كيف أعرض عنهم ، فيتّخذوا ذلك حجّة علينا . يقولون : ركنّا إليكم ورضينا بحكمكم فأعرضتم عنّا فلا نسمع دعوتكم من بعد . وهذا ممّا يهتمّ به النّبيء صلى الله عليه وسلم لأنّه يؤول إلى تنفير رؤسائِهم دهماءَهم من دعوة الإسلام فطمّنه الله تعالى بأنّه إنْ فعل ذلك لا تنشأ عنه مضرّة . ولعلّ في هذا التطمين إشعاراً بأنّهم لا طمع في إيمانهم في كلّ حال . وليس المراد بالضرّ ضرّ العداوة أو الأذى لأنّ ذلك لا يهتمّ به النّبيء صلى الله عليه وسلم ولا يخشاه منهم ، خلافاً لما فسّر به المفسّرون هنا .وتنكير { شيئاً } للتحقير كما هو في أمثاله ، مثل { فلَن تملك له من الله شيئاً } وهو منصوب على المفعوليّة المطلقة لأنّه في نية الإضافة إلى مصدر ، أي شيئاً من الضرّ ، فهو نائب عن المصدر . وقد تقدّم القول في موقع كلمة شيء عند قوله تعالى : { ولنبلونَّكم بشيء من الخوف والجوع } في سورة البقرة ( 155 ) .والآية تقتضي تخيير حكّام المسلمين في الحكم بين أهل الكتاب إذا حكّموهم؛ لأنّ إباحة ذلك التخيير لغير الرسول من الحكّام مساو إباحته للرسول . واختلف العلماء في هذه المسألة وفي مسألة حكم حكّام المسلمين في خصومات غير المسلمين . وقد دلّ الاستقراء على أنّ الأصل في الحكم بين غير المسلمين إذا تنازع بعضهم مع بعض أن يحكم بينهم حكّام ملّتهم ، فإذا تحاكموا إلى حكّام المسلمين فإن كان ما حدث من قبيل الظلم كالقتل والغصب وكلّ ما ينتشر منه فساد فلا خلاف أنّه يجب الحكم بينهم ( وعلى هذا فالتخيير الذي في الآية مخصوص بالإجماع ) . وإن لم يكن كذلك كالنزاع في الطلاق والمعاملات .فمن العلماء من قال : حكم هذا التخيير مُحْكم غير منسوخ ، وقالوا : الآية نزلت في قصّة الرجم ( الّتي رواها مالك في الموطأ } والبخاري ومن بعده ) وذلك أنّ يهودياً زنى بامرأة يهوديّة ، فقال جميعهم : لنسأل محمّداً عن ذلك . فتحاكموا إليه ، فخيّره الله تعالى . واختلف أصحاب هذا القول فقال فريق منهم : كان اليهود بالمدينة يومئذٍ أهل موادعة ولم يكونوا أهل ذمّة ، فالتّخيير باق مع أمثالهم ممّن ليس داخلاً تحت ذمّة الإسلام ، بخلاف الّذين دخلوا في ذمّة الإسلام ، فهؤلاء إذا تحاكموا إلى المسلمين وجب الحكم بينهم . وهو قول ابن القاسم في رواية عيسى بن دينار ، لأنّ اليهوديين كانا من أهل خيبر أو فَدَك وهما يومئذٍ من دار الحرب في موادعة .وقال الجمهور : هذا التخيير عام في أهل الذمّة أيضاً . وهذا قول مالك ورواية عن الشافعي . قال مالك : الأعراض أولى . وقيل : لا يحكم بينهم في الحدود ، وهذا أحد قولي الشافعي . وقيل : التّخيير منسوخ بقوله تعالى بعد { وأن احكم بينهم بما أنزل الله } \\[ المائدة : 49 \\] ، وهو قول أبي حنيفة ، وقاله ابن عبّاس ، ومجاهد ، وعكرمة ، والسديّ ، وعمر بن عبد العزيز ، والنخَعي ، وعطاء ، الخراساني ، ويبعده أنّ سياق الآيات يقتضي أنّها نزلت في نسق واحد فيبعد أن يكون آخرها نسخاً لأوّلها .وقوله : { وإنْ حكمتَ فاحكم بينهم بالقسط } أي بالعدل . والعدل : الحكم الموافق لشريعة الإسلام . وهذا يحتمل أنّ الله نهى رسوله عن أن يحكم بينهم بما في التّوراة لأنّها شريعة منسوخة بالإسلام . وهذا الّذي رواه مالك . وعلى هذا فالقصّة الّتي حكّموا فيها رسول الله لم يحكم فيها الرسول على الزانيين ولكنّه قَصَر حكمه على أن بيّن لليهود حقيقة شرعهم في التّوراة ، فاتّضح بطلان ما كانوا يحكمون به لعدم موافقته شرعهم ولا شرْع الإسلام؛ فهو حُكم على اليهود بأنّهم كتموا . ويكون مَا وقع في حديث «الموطأ» والبخاري : أنّ الرجل والمرأة رُجما ، إنّما هو بحكم أحبارهم . ويحتمل أنّ الله أمره أن يحكُم بينهم بما في التّوراة لأنّه يوافق حكم الإسلام؛ فقد حكم فيه بالرجم قبل حدوث هذه الحادثة أو بعدها . ويحتمل أنّ الله رخّص له أن يحكم بينهم بشرعهم حين حكَّموه . وبهذا قال بعض العلماء فيما حكاه القرطبي . وقائل هذا يقول : هذا نُسخ بقوله تعالى : { وأن احكم بينهم بما أنزل الله } \\[ المائدة : 49 \\] ، وهو قول جماعة من التّابعين . ولا داعي إلى دعوى النسخ ، ولعلّهم أرادوا به ما يشمل البيان ، كما سنذكره عند قوله : { فاحكم بينهم بما أنزل الله } \\[ المائدة : 48 \\] .والّذي يستخلص من الفقه في مسألة الحكم بين غير المسلمين دون تحكيم : أنّ الأمّة أجمعت على أنّ أهل الذمّة داخلون تحت سلطان الإسلام ، وأنّ عهود الذمّة قضت بإبقائهم على ما تقتضيه مللهم في الشؤون الجارية بين بعضهم مع بعض بما حددتْ لهم شرائعهم . ولذلك فالأمور الّتي يأتونها تنقسم إلى أربعة أقسام :القسم الأوّل : ما هو خاصّ بذات الذمّيّ من عبادته كصلاته وذبحه وغيرها ممّا هو من الحلال والحرام . وهذا لا اختلاف بين العلماء في أنّ أيمّة المسلمين لا يتعرّضون لهم بتعطيله إلاّ إذا كان فيه فساد عامّ كقتل النّفس .القسم الثّاني : ما يجري بينهم من المعاملات الراجعة إلى الحلال والحرام في الإسلام ، كأنواع من الأنكحة والطلاق وشرب الخمر والأعمال الّتي يستحلّونها ويحرّمها الإسلام . وهذه أيضاً يقرّون عليها ، قال مالك : لا يقام حَدّ الزنا على الذميّين ، فإن زنى مسلم بكتابية يحدّ المسلم ولا تحدّ الكتابية . قال ابن خُويز منداد : ولا يُرسل الإمام إليهم رسولاً ولا يُحضِر الخصمَ مجلسه .القسم الثّالث : ما يتجاوزهم إلى غيرهم من المفاسد كالسرقة والاعتداء على النفوس والأعراض . وقد أجمع علماء الأمّة على أنّ هذا القسم يجري على أحكام الإسلام ، لأنّا لم نعاهدهم على الفسادِ ، وقد قال تعالى : { والله لا يحبّ الفساد } \\[ البقرة : 205 \\] ، ولذلك نمنعهم من بيع الخمر للمسلمين ومن التظاهر بالمحرّمات .القسم الرّابع : ما يجري بينهم من المعاملات الّتي فيها اعتداء بعضهم على بعض : كالجنايات ، والديون ، وتخاصم الزوجين . فهذا القسم إذا تراضوا فيه بينهم لا نتعرّض لهم ، فإن استعدى أحدهم على الآخر بحاكم المسلمين . فقال مالك : يقضي الحاكم المسلم بينهم فيه وجوباً ، لأنّ في الاعتداء ضرباً من الظلم والفساد ، وكذلك قال الشافعي ، وأبو يوسف ، ومحمّد ، وزفر . وقال أبو حنيفة : لا يَحكم بينهم حتّى يتراضى الخصمان معاً .\n\n",
      "translations": [
        {
          "translation": "117 (Listeners) and ones who utter words (for the sake of falsehood! Greedy for illicit gain!) bribery and that which is unlawful by changing the rulings of Allah. (If then they) i.e. the Banu Qurayzah and the Banu'l- Nadir (have recourse unto thee) Muhammad (judge between them) between the Banu Qurayzah and the Banu'l-Nadir; and it is also said: between the people of Khaybar (or disclaim jurisdiction) by choice. (If thou disclaimest jurisdiction) and do not judge between them, (then they cannot harm thee at all) they cannot take away anything from you. (But if thou judgest) between the Banu Qurayzah and the Banu'l-Nadir; and it is also said: between the people of Khaybar, (judge between them with equity) with stoning [married people who commit adultery]. (Lo! Allah loveth the equitable) who are fair when they judge with the Book of Allah and who apply the legal ruling of stoning.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَكَّالُونَ لِلسُّحْتِ } معناهُ للرُّشَى\n\n\n\n\nوقوله تعالى: { فَٱحْكُمْ بَيْنَهُمْ بِٱلْقِسْطِ } معناه بالعَدلِ\n فالمُقْسِطُ: العَادِلُ والقَاسِط: الجَائِرُ الكَافِرُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying {Akkaloona lis-suhti}, its meaning is for rushing.\n\nAnd His saying - the Most High: { So judge between them by that which is just } its meaning is with justice.\n\n\nThe just person is the one who is fair and equitable, while the unjust person is the one who is unfair and unbalanced.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوما هو إلا أنهم { سَمَّاعُونَ لِلْكَذِبِ } المذكور\n معتقدون صدقها ومطابتها للواقع ومسمعونهم أيضاً\n وهم\n أي: الأحبار { أَكَّالُونَ لِلسُّحْتِ } أي: الحرام الذين يرتشون منهم\n بسبب تحريفهم نعتك يا أكمل الرسل من كتابهم\n لتبقى رئاستهم وجاههم فأعرض عنهم وعن إيمانهم { فَإِن جَآءُوكَ } ليحكموك\n إن شئب { فَٱحْكُمْ بَيْنَهُمْ أَوْ أَعْرِضْ عَنْهُمْ } وعن حكمهم\n فلك الخيار\n\n\n{ وَ } لا تبال بهم وبعداوتهم { إِن تُعْرِضْ عَنْهُمْ } فإنهم وإن عادوك أشد عداوة وبغضاً { فَلَن يَضُرُّوكَ شَيْئاً } من المكروه\n فإن الله يعصمك ويكفيك من شرورهم { وَإِنْ حَكَمْتَ فَٱحْكُمْ بَيْنَهُمْ بِٱلْقِسْطِ } والعدل الذي هو أمر الحق ونطق به الفرقان { إِنَّ ٱللَّهَ } المستوي باسم الرحمن على عروش الذرائر معتدلاً بلا تفاوت { يُحِبُّ ٱلْمُقْسِطِينَ } [المائدة: 42] المتعدلين من عباده\n المائلين عن كلا طرفي الإفراط والتفريط\n المنتهين إلى قعر الجحيم\n وليس غرضهم من تحكيمك الإطاعة بك وبحكمك\n والوثوق لأمانتك ووقوفك\n بل ليس غرضهم إلا التسهيل والتيسير\n والإعراض عن بعض الأحكام مداهنةً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وليرتب عليه قوله: { أكَّالون للسحت } أي: الحرام\n كالرشا وغيرها\n وسُمي سحتًا لأنه يسحت البركة ويستأصل المال\n كما قال صلى الله عليه وسلم\n \" من جمع المال من نهاوش أذهبه الله في نهابر \"\n \nثم خيَّر نبيه ـ عليه الصلاة والسلام ـ في الحكم بينهم\n فقال: { فإن جاءوك } متحاكمين إليك { فاحكم بينهم أو أعرض عنهم } \n وقيل: نسخ بقوله:\n[المَائدة:49]\n والجمهور: أن ما كان من باب التظالم والتعدي فإن الحاكم يتعرض بهم ويبحث عنه\n وأما النوازل التي لا ظلم فيها\n وإنما هي دعاوي\n فإن رضوا بحكمنا فالإمام مُخير\n وإن لم يرضوا فلا نتعرض لهم\n انظر ابن عطية\n وقال البيضاوي: ولو تحاكم كتابيان إلى القاضي لم يجب عليه الحكم\n وهو قول الشافعي: والأصح: وجوبه إذا كان المترافعان أو أحدهما ذميًا\n لأنا التزمنا الذب عنهم\n ومذهب أبي حنيفة: يجب مطلقًا\n هـ\n { وإن تُعرض عنهم فلن يضروك شيئًا } لأن الله عصمك من الناس\n { وإن حكمت فاحكم بينهم بالقسط } أي: العدل الذي أمر الله به { إن الله يحب المقسطين } \n فيحفظهم ويعظم شأنهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:62",
      "similarity": 0.6886485688182364
    },
    {
      "verse": "20:61",
      "similarity": 0.5653902192841984
    },
    {
      "verse": "5:63",
      "similarity": 0.5570654644471262
    },
    {
      "verse": "10:47",
      "similarity": 0.22198927931127058
    },
    {
      "verse": "60:8",
      "similarity": 0.2201235321812573
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005042.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005042.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:42.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}