{
  "chapter": "المائدة",
  "text": "وكيف يحكمونك وعندهم التورىة فيها حكم الله ثم يتولون منۢ بعد ذلك وما او۟لئك بالمؤمنين",
  "translations": [
    {
      "translation": "How can they make you their judge when they have the Torah with them which contains the judgement of Allah? Then even after that they turn their backs! Such people are certainly not muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But why should they make you a judge when the Torah is with them which contains the Law of God? Even then they turn away. They are those who will never believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet how will they appoint you a judge when they have the Torah with them, wherein there is Allah's judgement - and still they turn away from it? The fact is, they are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How can they come to you for judgment when they already have the Torah which contains the decree of God! It does not take them long to disregard your judgment; they are not true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should they wish to be judged by you, when they have the Taurat with them, in which exist the commands of Allah and yet they turn away from it? And they will not accept faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But how do they come to you for a decision while they have the Tawrah, in which is the decision of Allah; yet even after that they turn away. For they are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how do they make you a judge and they have the Taurat wherein is Allah's judgment? Yet they turn back after that, and these are not the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet how will they make thee their judge seeing they have the Torah, wherein is God's judgment, then thereafter turn their backs? They are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How come they unto thee for judgment when they have the Torah, wherein Allah hath delivered judgment (for them)? Yet even after that they turn away. Such (folk) are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But why do they come to you for judgement when they have the Torah, which enshrines God's own judgement? Yet, in spite of that, they turn their backs; and certainly they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how shall they ask thee for judgement, whereas with them is the Taurat wherein is Allah's judgement? And they turn away thereafter? And those are no believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how should they make you a judge, while with them is the Torah, in which is Allah’s judgement? Yet in spite of that, they turn their backs [on Him] and they are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But why do they come to thee for decision, when they have (their own) law before them?- therein is the (plain) command of Allah; yet even after that, they would turn away. For they are not (really) People of Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But how do they come to you for decision while they have the Taurat (Torah), in which is the (plain) Decision of Allah; yet even after that, they turn away. For they are not (really) believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But how will they come to you for judgment when they already have the Torah in which is the judgement of Allah? Then they turn away after that; those are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But why do they come to you for judgment, when they have the Torah, in which is God’s Law? Yet they turn away after that. These are not believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But how is it that they come to you for judgement while they have the Torah, in which is the judgement of Allah? Then they turn away, [even] after that; but those are not [in fact] believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:43] But how is it that they make you their judge when they have the Torah, wherein is God’s judgement, of stoning: the interrogative here is for [provoking] amazement, in other words, they were not seeking thereby [by making you their judge] to discover the truth but a lighter punishment for them; and then they turn away, [and then] they reject your ruling of stoning, which accords with what is in their Scripture, after that, request [to you] for arbitration? Such are not believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(How come they unto thee for judgement) regarding stoning, this is mentioned by way of showing amazement (when they have the Torah, wherein) in the Torah (Allah hath delivered judgement (for them)) the judgement of stoning? (Yet even after that) after the exposition in the Qur'an and the Torah (they turn away. Such (folk) are not believers) in the Torah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إلا { كَيْفَ يُحَكِّمُونَكَ } مع عدم إيمانهم بك وبكتابك { وَ } الحال أنه { عِنْدَهُمُ ٱلتَّوْرَاةُ فِيهَا حُكْمُ ٱللَّهِ } على التفصيل، وم يدعون العلم بها { ثُمَّ يَتَوَلَّوْنَ } وينصرفون { مِن بَعْدِ ذٰلِكَ } أي: بعدما حكمت فيما حكموك فيه مع أنه مطالق لكتابهم { وَمَآ أُوْلَـٰئِكَ بِٱلْمُؤْمِنِينَ } [المائدة: 43] أي: وما إعراض أولئك المؤمنين بكتابهم، الموقنين فيه حتى يحكموك مع كونهم عالمين بحكمك فيه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكيف يُحكِّمونك } وهم لا يؤمنون بك، { وعندهم التوارة فيها حكم الله } أي: والحال أن الحكم منصوص عليه في الكتاب الذي هو عندهم { ثم يتولون من بعد ذلك } ، أو ثم يتولون عن حكمك الموافق لكتابهم من بعد التحكيم، وفيه تنبيه على أنهم ما قصدوا بالتحكيم معرفة الحق وإقامة الشرع، وإنما قصدوا به ما يكون عونًا لهم على هواهم، وإن لم يكن حكم الله في زعمهم، { وما أولئك بالمؤمنين } بكتابهم ولا بكتابك لإعراضهم عنه أولاً، وعنك ثانيًا، بل أولئك هم الفاسقون التابعون لأهوائهم\n\n\nوالله تعالى أعلم\n الإشارة: كل من تعرض للشيخوخة وادعى مقام التربية، وهو يأمر أصحابه باتباع رخص الشريعة، والبقاء مع العوائد، ويقول لهم: { إن أوتيتم هذا فخذوه } ويزعم أنه سنة، وإن لم تؤتوه، ولقيتم من يأمركم بقتل النفوس، وحط الرؤوس ودفع الفلوس، وخرق العوائد فاحذروه، فمن كان حاله هذا، فالآية تجر ذيلها عليه، لأنه تعرض لفتنة نفسه بحب الجاه وغرور أولاد الناس، { ومن يرد الله فتنته فلن تملك له من الله شيئًا أولئك الذين لم يرد الله أن يطهر قلوبهم } من الهوى، ولا بصيرتهم من شهود السِّوى لأن تطهير القلوب مشروط بقتل النفوس، وقتل النفوس إنما يكون باتباع ما يثقل عليها من خرق عوائدها، كالذل والفقر وغير ذلك من الأعمال الشاقة عليها، ومن لم يطهر قلبه من الهوى يعش في الدنيا في ذل الحجاب مسجوناً بمحيطاته، محصورًا في هيكل ذاته، وله في الآخرة أشد العتاب، حيث تعرض لمقام الرجال وهو عنه بمعزل، ويقال لمن تبعه في اتباع الرخص: { سماعون للكذب أكالون للسحت }\n قال الشيخ أبو العباس المرسي رضي الله عنه: من كان من فقراء الزمان يسمع الغناء، ويأكل أموال الظلمة، ففيه نزعة يهودية، قال تعالى: { سماعون للكذب أكالون للسحت }\n هـ\n فإن جاءوك أيها العارف، يستخبرونك، ويخاصمونك في الأمر بخرق العوائد، ويزعمون أنهم موافقون للسنة، { فاحكم بينهم أو أعرض عنهم وإن تعرض عنهم فلن يضروك شيئًا وإن حكمت فاحكم بينهم بالقسط } ، وهو الأخذ بكل ما يقتل النفوس، ويجهز عليها، { إن الله يحب المقسطين } وكيف يحكمونك أو يخاصمونك، وعندهم القرآن فيه حكم الله بذلك، قال تعالى:\n\n[العَنكبوت:69]، ولا يكون جهاد النفس إلا بمخالفتها، وقتلها بترك حظوظها وهواها\n والله تعالى أعلم\n ثم قرر صحة كتابه التوراة، ووبال من أعرض عنه من اليهود، فقال: { إِنَّآ أَنزَلْنَا ٱلتَّوْرَاةَ فِيهَا هُدًى وَنُورٌ يَحْكُمُ بِهَا }\n\n",
      "translations": []
    }
  ]
}