{
  "chapter": "المائدة",
  "text": "وقفينا على ءاثرهم بعيسى ابن مريم مصدقا لما بين يديه من التورىة وءاتينه الانجيل فيه هدى ونور ومصدقا لما بين يديه من التورىة وهدى وموعظة للمتقين",
  "translations": [
    {
      "translation": "And We sent 'Isa son of Maryam following in their footsteps, confirming the Torah that came before him. We gave him the Gospel containing guidance and light, confirming the Torah that came before it, and as guidance and admonition for those who have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Later, in the train (of the prophets), We sent Jesus, son of Mary, confirming the Torah which had been (Sent down) before him, and gave him the Gospel containing guidance and light, which corroborated the earlier Torah, a guidance and warning for those who preserve themselves from evil and follow the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent Jesus, the son of Mary, after those Prophets, confirming the truth of whatever there still remained of the Torah. And We gave him the Gospel, wherein is guidance and light, and which confirms the truth of whatever there still remained of the Torah, and a guidance and admonition for the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made Jesus, son of Mary, follow in the footsteps (of the earlier Prophets) and confirm what existed in the Torah in his time. We gave him the Gospel containing guidance and light, as a confirmation of the Torah and instruction and advice for the pious ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We brought Eisa the son of Maryam, following the footsteps of those Prophets, confirming the Taurat which preceded him – and We bestowed upon him the Injeel (Bible) in which is guidance and light, and confirms the Taurat which preceded it, and a guidance and an advice to the pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in their footsteps, We sent `Isa, son of Maryam, confirming the Tawrah that had come before him, and We gave him the Injil, in which was guidance and light and confirmation of the Tawrah that had come before it, a guidance and an admonition for those who have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent after them in their footsteps Isa, son of Marium, verifying what was before him of the Taurat and We gave him the Injeel in which was guidance and light, and verifying what was before it of Taurat and a guidance and an admonition for those who guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent, following in their footsteps, Jesus son of Mary, confirming the Torah before him and We gave to him the Gospel, wherein is guidance and light, and confirming the Torah before it, as a guidance and an admonition unto the godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We caused Jesus, son of Mary, to follow in their footsteps, confirming that which was (revealed) before him in the Torah, and We bestowed on him the Gospel wherein is guidance and a light, confirming that which was (revealed) before it in the Torah - a guidance and an admonition unto those who ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We caused Jesus, son of Mary to follow in their footsteps, fulfilling what had been revealed before him in the Torah. We gave him the Gospel, which contained guidance and light, fulfilling what was revealed before it in the Torah: a guide and an admonition to the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in their footsteps We caused 'Isa, son of Maryam, to follow, confessing to that which had preceded him, the Taurat, and We vouchsafed unto him the Injil wherein was a guidance and a light, confirming that which had preceded it, the Taurat, and a guidance and an admonition unto the God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We followed them with Jesus son of Mary, to confirm that which was before him of the Torah, and We gave him the Evangel containing guidance and light, confirming what was before it of the Torah, and as guidance and advice for the Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in their footsteps We sent Jesus the son of Mary, confirming the Law that had come before him: We sent him the Gospel: therein was guidance and light, and confirmation of the Law that had come before him: a guidance and an admonition to those who fear Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in their footsteps, We sent 'Iesa (Jesus), son of Maryam (Mary), confirming the Taurat (Torah) that had come before him, and We gave him the Injeel (Gospel), in which was guidance and light and confirmation of the Taurat (Torah) that had come before it, a guidance and an admonition for Al-Muttaqun (the pious - see V. 2:2).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent, following in their footsteps (Prophet) Jesus, the son of Mary, confirming that which was before him in the Torah, and gave him the Gospel, in which there is guidance and light, confirming that which was before him in the Torah, a guide and an admonition to the cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In their footsteps, We sent Jesus son of Mary, fulfilling the Torah that preceded him; and We gave him the Gospel, wherein is guidance and light, and confirming the Torah that preceded him, and guidance and counsel for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We sent, following in their footsteps, Jesus, the son of Mary, confirming that which came before him in the Torah; and We gave him the Gospel, in which was guidance and light and confirming that which preceded it of the Torah as guidance and instruction for the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:46] And We caused Jesus son of Mary to follow in their, that is, the prophets’, footsteps, confirming the Torah before him; and We gave to him the Gospel, wherein is guidance, from error, and light, an exposition of the rulings, confirming (musaddiqan is a circumstantial qualifier) the Torah before it, the rulings contained therein, and as a guidance and an admonition to the God-fearing.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We caused Jesus, son of Mary, to follow in their footsteps, confirming that which was (revealed) before him in the Torah) as regards the declaration of Allah's divine Oneness and some laws, (and We bestowed on him the Gospel wherein is guidance) from error (and a light) an exposition on stoning, (confirming that which was (revealed) before it in the Torah) regarding Allah's divine Oneness and the legal ruling of stoning (a guidance) from error (and an admonition unto) and a caution for (those who ward off (evil)) those who ward off disbelief, idolatry and indecencies. 118\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَقَفَّيْنَا عَلَىٰ آثَارِهِم } معناهُ أَتبَعنَا\n\n",
      "translations": [
        {
          "translation": " And His saying, {We will follow their tracks} means that We will follow them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما انقرض هؤلاء النبيون الحاكمون { قَفَّيْنَا عَلَىٰ آثَارِهِم } أي: أتبعناهم { بِعَيسَى ٱبْنِ مَرْيَمَ } خلفاً لهم { مُصَدِّقاً لِّمَا بَيْنَ يَدَيْهِ مِنَ ٱلتَوْرَاةِ وَآتَيْنَاهُ } امتناناً له { ٱلإِنجِيلَ فِيهِ } أيضاً { هُدًى وَنُورٌ } للمستهدين المستكشفين منه { وَ } مع كونه مشتملاً على الهداية والإنارة { مُصَدِّقاً لِّمَا بَيْنَ يَدَيْهِ مِنَ ٱلتَّوْرَاةِ وَهُدًى } هادياً لأهل العناية { وَمَوْعِظَةً } وتذكيراً { لِّلْمُتَّقِينَ } [المائدة: 46] المتوجيهن إلى الحق بين الخوف والرجاء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { قفينا }: اتبعنا\n مشتق من القفا كأن مجيء عيسى كان في قفا مجيء النبيين وخلفهم\n وحذف المفعول الأول\n أي: أتبعناهم\n و { بعيسى } مفعول ثاني\n وجملة: { فيه هدى ونور }: حال من { الإنجيل } \n و { مصدقًا }: عطف عليه\n يقول الحقّ جلّ جلاله: وأتبعنا النبيين المتقدمين وجئنا على إثرهم { بعيسى ابن مريم مصدقًا لما بين يديه } أي: ما تقدم أمامه { من التوراة } وتصديقه للتوراة إما لكونه مذكورًا فيها ثم ظهر\n أو بموافقة ما جاء به من التوحيد والأحكامِ لما فيها\n أو لكونه صدَّق بها وعمل بما فيها\n { وآتيناه الإنجيل فيه هدىً ونورٌ } فالهدى لإصلاح الظواهر بالشرائع\n والنور لإصلاح الضمائر بالعقائد الصحيحة والحقائق الربانية\n { ومصدقًا لما بين يديه من التوراة } بتقرير أحكامها\n والشهادة على صحتها\n { وهدى وموعظة للمتقين } أي: وإرشادًا وتذكيرًا للمتقين لأنهم هم الذين ينفع فيهم الموعظة والتذكير\n دون المنهمكين في الغفلة\n قد طبع الله على قلوبهم فهم لا يسمعون\n ثم أمر الله أهل الإنجيل بالحكم بما فيه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "57:27",
      "similarity": 0.5517004805679144
    },
    {
      "verse": "2:87",
      "similarity": 0.5399478010908599
    },
    {
      "verse": "17:36",
      "similarity": 0.5227207746651841
    },
    {
      "verse": "3:3",
      "similarity": 0.42772909070047954
    },
    {
      "verse": "3:48",
      "similarity": 0.385784887241364
    }
  ]
}