{
  "chapter": "المائدة",
  "text": "وليحكم اهل الانجيل بما انزل الله فيه ومن لم يحكم بما انزل الله فاو۟لئك هم الفسقون",
  "translations": [
    {
      "translation": "The people of the Gospel should judge by what Allah sent down in it. Those who do not judge by what Allah has sent down, such people are deviators.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the people of the Gospel judge by what has been revealed in it by God. And those who do not judge in accordance with what God has revealed are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the followers of the Gospel judge by what Allah has revealed therein, and those who do not judge by what Allah has revealed are the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The followers of the Gospels (the New Testament) must judge according to what God has revealed in it. Those who do not judge by the laws of God are evil doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the People of Injeel must judge by what Allah has sent down in it; and whoever does not judge according to what is sent down by Allah – it is they who are the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the people of the Injil judge by what Allah has revealed therein. And whosoever does not judge by what Allah has revealed, such are the rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the followers of the Injeel should have judged by what Allah revealed in it; and whoever did not judge by what Allah revealed, those are they that are the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let the People of the Gospel judge according to what God has sent down therein. Whosoever judges not according to what God has sent down -- they are the ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the People of the Gospel judge by that which Allah hath revealed therein. Whoso judgeth not by that which Allah hath revealed: such are evil-livers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, let those who follow the Gospel judge according to what God has revealed in it. Those who do not judge by what God has sent down are rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let the people of the Injil judge by that which Allah hath sent down therein; and whosoever judgeth not by that which Allah hath sent down, then those! - they are the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the people of the Evangel judge by what Allah has sent down in it. Those who do not judge by what Allah has sent down—it is they who are the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the people of the Gospel judge by what Allah hath revealed therein. If any do fail to judge by (the light of) what Allah hath revealed, they are (no better than) those who rebel.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the people of the Injeel (Gospel) judge by what Allah has revealed therein. And whosoever does not judge by what Allah has revealed (then) such (people) are the Fasiqun (the rebellious i.e. disobedient (of a lesser degree) to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, let the people of Gospel judge in accordance with that which Allah has sent in it. Those who do not judge according to that which Allah has sent down are the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So let the people of the Gospel rule according to what God revealed in it. Those who do not rule according to what God revealed are the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let the People of the Gospel judge by what Allah has revealed therein. And whoever does not judge by what Allah has revealed - then it is those who are the defiantly disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:47] We said: So let the People of the Gospel judge according to what God has revealed therein, of rulings (a variant reading of wa’l-yahkum, ‘let [them] judge’, is wa-li-yahkuma, making it a supplement to that which is governed by the previous verb [ātaynāhu, ‘We gave to him’]). Whoever does not judge according to what God has revealed — those are the wicked.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Let the People of the Gospel judge) such that the people of the Gospel elucidate (by that which Allah hath revealed therein) that which Allah has elucidated in the Gospel regarding the traits and description of Muhammad (pbuh) and the legal ruling of stoning. (Whoso judgeth not by that which Allah hath revealed) He says: whoever does not show that which Allah has elucidated in the Gospel; (such are evil-doers) transgressing disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلْيَحْكُمْ } أيضاً { أَهْلُ ٱلإِنْجِيلِ بِمَآ أَنزَلَ ٱللَّهُ فِيهِ } من الأحكام { وَمَن لَّمْ يَحْكُم } منهم أيضاً { بِمَآ أَنزَلَ ٱللَّهُ } لغرض من الأغراض الفاسدة { فَأُوْلَـٰئِكَ } البعداء\n المنصرفون عن منهج الرشاد { هُمُ ٱلْفَاسِقُونَ } [المائدة: 47] الخارجون عن رِبقَة الإيمان\n المنهمكون في حبر الضلال والطغيان\n\n\nومآل هذه الصفات الثلاثة لهؤلاء الحاكمين المجاوزين عمَّا حكم الله في كتبه واحد إذ الفكر: هو ستر حكم الله\n والظلم: هو المتجاوز عنه إلى غيره من الآراء الفاسدة والفسق: الخروج عن حكمه\n عناداً ومكابرة\n ومآل الكل إلى الشرك بالله\n والإلحاد عن توحيده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { وليحكم أهل الإنجيل بما أنزل الله فيه } من الأحكام\n وقرأ حمزة: { وليحكم } بلام الجر أي: وآتيناه الإنجيل ليحكم أهل الإنجيل بما فيه\n { ومن لم يحكم بما أنزل الله فأولئك هم الفاسقون } الخارجون عن طاعة الحق\n قال البيضاوي: والآية تدل على أن الإنجيل مشتملة على الأحكام\n وأن اليهودية منسوخة ببعث عيسى عليه السلام\n وأنه كان مستقلاً بالشرع\n وحمَلها على: وليحكموا بما أنزل الله\n فيه من إيجاب العمل بأحكام التوراة خلاف الظاهر\n هـ\n الإشارة: قد جمع الله في هذه الأمة المحمدية ما افترق في غيرها في الأزمنة المتقدمة\n فعلماؤها وأولياؤها كالأنبياء والرّسل\n كلما مات عالم أو ولي قفاه الله بآخر\n أما العلماء فأمرهم متفق وحالهم متقارب\n فمدار أمرهم على تحصيل العلوم الرسمية والأعمال الظاهرية\n وأما الأولياء ـ رضي الله عنهم ـ\n فأحوالهم مختلفة\n فمنهم من يكون على قدم نوح عليه السلام في القوة والشدة\n ومنهم من يكون على قدم إبراهيم عليه السلام في الحنانة والشفقة\n ومنهم من يكون على قدم موسى عليه السلام في القوة أيضًا\n ومنهم من يكون على قدم عيسى عليه السلام في الزهد والانقطاع إلى الله تعالى\n ومنهم من يكون على قدم نبينا محمد صلى الله عليه وسلم\n وهو أعظمهم لجمعه ما افترق في غيره\n وكل واحد يؤتيه الله نورًا في الباطن يجذب به القلوب إلى الحضرة\n وهدى في الظاهر يصلح به الظواهر في الشريعة\n والله تعالى أعلم\n ثم شرع يتكلم مع الأمة الإسلامية المحمدية\n فقال: { وَأَنزَلْنَآ إِلَيْكَ ٱلْكِتَابَ بِٱلْحَقِّ مُصَدِّقاً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:48",
      "similarity": 0.6273661417125462
    },
    {
      "verse": "3:3",
      "similarity": 0.5833052242574372
    },
    {
      "verse": "3:65",
      "similarity": 0.5203725974390537
    },
    {
      "verse": "5:68",
      "similarity": 0.3753133059791332
    },
    {
      "verse": "5:66",
      "similarity": 0.32290967810888505
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005047.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005047.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:47.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}