{
  "chapter": "المائدة",
  "text": "وانزلنا اليك الكتب بالحق مصدقا لما بين يديه من الكتب ومهيمنا عليه فاحكم بينهم بما انزل الله ولا تتبع اهواءهم عما جاءك من الحق لكل جعلنا منكم شرعة ومنهاجا ولو شاء الله لجعلكم امة وحدة ولكن ليبلوكم فى ما ءاتىكم فاستبقوا۟ الخيرت الى الله مرجعكم جميعا فينبئكم بما كنتم فيه تختلفون",
  "translations": [
    {
      "translation": "And We have sent down the Book to you with truth, confirming and conserving the previous Books. So judge between them by what Allah has sent down and do not follow their whims and desires deviating from the Truth that has come to you. We have appointed a law and a practice for every one of you. Had Allah willed, He would have made you a single community, but He wanted to test you regarding what has come to you. So compete with each other in doing good. Every one of you will return to Allah and He will inform you regarding the things about which you differed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to you We have revealed the Book containing the truth, confirming the earlier revelations, and preserving them (from change and corruption). So judge between them by what has been revealed by God, and do not follow their whims, side-stepping the truth that has reached you. To each of you We have given a law and a way and a pattern of life. If God had pleased He could surely have made you one people (professing one faith). But He wished to try and test you by that which He gave you. So try to excel in good deeds. To Him will you all return in the end, when He will tell you of what you were at variance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We revealed the Book to you (O Muhammad!) with Truth, confirming whatever of the Book was revealed before, and protecting and guarding over it. Judge, then, in the affairs of men in accordance with the Law that Allah has revealed, and do not follow their desires in disregard of the Truth which has come to you. For each of you We have appointed a Law and a way of life. And had Allah so willed, He would surely have made you one single community; instead, (He gave each of you a Law and a way of life) in order to test you by what He gave you. Vie, then, one with another in good works. Unto Allah is the return of all of you; and He will then make you understand the truth concerning the matters on which you disagreed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have revealed the Book to you (Muhammad) in all Truth. It confirms the (original) Bible and has the authority to preserve or abrogate what the Bible contains. Judge among them by what God has revealed to you and do not follow their desires instead of the Truth which has come to you. We have given a law and a way of life to each of you. Had God wanted, He could have made you into one nation, but He wanted to see who are the more pious ones among you. Compete with each other in righteousness. All of you will return to God who will tell you the truth in the matter of your differences.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O dear Prophet (Mohammed – peace and blessings be upon him) We have sent down the true Book upon you, confirming the Books preceding it, and a protector and witness over them – therefore judge between them according to what is sent down by Allah, and O listener, do not follow their desires, abandoning the truth which has come to you; We have appointed for you all, a separate (religious) law and a way; and had Allah willed He could have made you one nation, but the purpose (His will) is to test you by what He has given you, therefore seek to surpass one another in good deeds; towards Allah only you will all return, so He will inform you concerning the matter in which you disputed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have sent down to you the Book (this Qur'an) in truth, confirming the Scripture that came before it and Muhayminan over it (old Scriptures). So judge between them by what Allah has revealed, and follow not their vain desires, diverging away from the truth that has come to you. To each among you, We have prescribed a law and a clear way. If Allah willed, He would have made you one nation, but that (He) may test you in what He has given you; so compete in good deeds. The return of you (all) is to Allah; then He will inform you about that in which you used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have revealed to you the Book with the truth, verifying what is before it of the Book and a guardian over it, therefore judge between them by what Allah has revealed, and do not follow their low desires (to turn away) from the truth that has come to you; for every one of you did We appoint a law and a way, and if Allah had pleased He would have made you (all) a single people, but that He might try you in what He gave you, therefore strive with one another to hasten to virtuous deeds; to Allah is your return, of all (of you), so He will let you know that in which you differed;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have sent down to thee the Book with the truth, confirming the Book that was before it, and assuring it. So judge between them according to what God has sent down, and do not follow their caprices, to forsake the truth that has come to thee. To every one of you We have appointed a right way and an open road. If God had willed, He would have made you one nation; but that He may try you in what has come to you. So be you forward in good works; unto God shall you return, all together; and He will tell you of that whereon you were at variance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto thee have We revealed the Scripture with the truth, confirming whatever Scripture was before it, and a watcher over it. So judge between them by that which Allah hath revealed, and follow not their desires away from the truth which hath come unto thee. For each We have appointed a divine law and a traced-out way. Had Allah willed He could have made you one community. But that He may try you by that which He hath given you (He hath made you as ye are). So vie one with another in good works. Unto Allah ye will all return, and He will then inform you of that wherein ye differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down the Book to you with the truth, fulfilling [the predictions] revealed in the previous scriptures and determining what is true therein, and as a guardian over it. Judge, therefore, between them by what God has revealed, and do not follow their vain desires turning away from the truth that has come to you. To every one of you We have ordained a law and a way, and had God so willed, He would have made you all a single community, but He did not so will, in order that He might try you by what He has given you. Vie, then, with one another in doing good works; to God you shall all return; then He will make clear to you about what you have been disputing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have sent down the Book unto thee with truth; and confirming that which hath preceded it of the Book, and a guardian thereof. Wherefrom judge thou between them by that which Allah hath sent down, and follow thou not away from that which hath their desires come to thee of the truth. Unto each of you We appointed law and a way. And had Allah listed, He would have made you all a single community, but He willed not in order that he may prove you by that which He hath vouchsafed unto you. Hasten wherefore to the virtues; unto Allah is the return of you all; then He shall declare unto you concerning that wherein ye have been disputing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent down to you the Book with the truth, confirming what was before it of the Book and as a guardian over it. So judge between them by what Allah has sent down, and do not follow their desires against the truth that has come to you. For each [community] among you We had appointed a code [of law] and a path, and had Allah wished He would have made you one community, but [His purposes required] that He should test you in respect to what He has given you. So take the lead in all good works. To Allah shall be the return of you all, whereat He will inform you concerning that about which you used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To thee We sent the Scripture in truth, confirming the scripture that came before it, and guarding it in safety: so judge between them by what Allah hath revealed, and follow not their vain desires, diverging from the Truth that hath come to thee. To each among you have we prescribed a law and an open way. If Allah had so willed, He would have made you a single people, but (His plan is) to test you in what He hath given you: so strive as in a race in all virtues. The goal of you all is to Allah; it is He that will show you the truth of the matters in which ye dispute;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have sent down to you (O Muhammad SAW) the Book (this Quran) in truth, confirming the Scripture that came before it and Mohayminan (trustworthy in highness and a witness) over it (old Scriptures). So judge between them by what Allah has revealed, and follow not their vain desires, diverging away from the truth that has come to you. To each among you, We have prescribed a law and a clear way. If Allah willed, He would have made you one nation, but that (He) may test you in what He has given you; so strive as in a race in good deeds. The return of you (all) is to Allah; then He will inform you about that in which you used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to you We have revealed the Book with the truth confirming the Book that was revealed before it, and a guardian over it. Therefore, give judgment among them in accordance to what Allah has sent down and do not yield to their fancies from the truth that has come to you. We have ordained a law and a Path for each of you. Had Allah willed, He could have made you one nation but that He might try you by that which He has bestowed upon you. Race with one another in good works, to Allah you shall all return and He will declare to you what you were at variance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We revealed to you the Book, with truth, confirming the Scripture that preceded it, and superseding it. So judge between them according to what God revealed, and do not follow their desires if they differ from the truth that has come to you. For each of you We have assigned a law and a method. Had God willed, He could have made you a single nation, but He tests you through what He has given you. So compete in righteousness. To God is your return, all of you; then He will inform you of what you had disputed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have revealed to you, [O Muhammad], the Book in truth, confirming that which preceded it of the Scripture and as a criterion over it. So judge between them by what Allah has revealed and do not follow their inclinations away from what has come to you of the truth. To each of you We prescribed a law and a method. Had Allah willed, He would have made you one nation [united in religion], but [He intended] to test you in what He has given you; so race to [all that is] good. To Allah is your return all together, and He will [then] inform you concerning that over which you used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:48] And We have revealed to you, O Muhammad (s), the Book, the Qur’ān, with the truth (bi’l-haqq is semantically connected to anzalnā, ‘We have revealed’) confirming the Book that was before it and watching over it, testifying [to it] — the ‘Book’ means the Scriptures. So judge between them, between the People of the Scripture, if they take their cases before you, according to what God has revealed, to you, and do not follow their whims, deviating, away from the truth that has come to you. To every one of you, O communities, We have appointed a divine law and a way, a clear path in religion, for them to proceed along. If God had willed, He would have made you one community, following one Law, but, He separated you one from the other, that He may try you in what He has given to you, of the differing Laws, in order to see who among you is obedient and who is disobedient. So vie with one another in good works, strive hastily thereunto; to God you shall all return, through resurrection, and He will then inform you of that in which you differed, in the matter of religion, and requite each of you according to his deeds.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And unto thee have We revealed the Scripture) We have sent you Gabriel with the Qur'an (with the Truth) to make plain the Truth and falsehood, (confirming) the statement of Allah's divine Oneness and some laws (whatever Scripture was before it) whatever Scriptures were before it, (and a watcher over it) a witness upon all the Scriptures before it; it is also said: a witness upon the ruling of stoning; and it is also said: a watcher over all previous Scriptures. (So judge between them) between the Banu Qurayzah and the Banu'l- Nadir and the people of Khaybar (by that which Allah hath revealed) by that which Allah has exposited to you in the Qur'an, (and follow not their desires) regarding the application of whipping and discarding stoning (away from the Truth which hath come unto thee) after the exposition that has come to you. (For each We have appointed a divine law) for each prophet among you We have exposited a divine law (and a traced out way) obligations and practices. (Had Allah willed He could have made you one community) He has made you follow one divine law. (But that He may try you) test you (by that which He hath given you) of Scripture, obligations and practices, such that He says: I have prescribed all this for you, so let not delusion creep into your minds. (So vie one with another in good works) so vie, Community of Muhammad (pbuh) with other nations, in obligations, practices and righteous works; it is also said that this means: hasten, Community of Muhammad (pbuh) to perform acts of obedience. (Unto Allah ye will all) all nations (return, and He will then inform you of that wherein ye differ) where you contravene in relation to religion and divine laws.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمُهَيْمِناً عَلَيْهِ } فالمُهَيمِنُ: المُصدِقُ لِمَا قَبلَهُ\n والأَمينُ عَلَيهِ\n\n\n\n\nوقوله تعالى: { شِرْعَةً وَمِنْهَاجاً } فالشِّرْعةُ: السُّنَّةُ\n والمِنهَاجُ: الطَّريقُ البّيِّنُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And He is trusty over it\" - the muhaamin is the one who affirms what came before it.\n\n\nAnd the trustee over it.\n\n\nAnd His saying, \"With a legislation and a way,\" so the legislation is the Sunnah.\n\n\nAnd the methodology: the clear path",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما انقرض عيسى - صلوات الرحمن عليه - { أَنزَلْنَآ إِلَيْكَ } يا أكمل الرسل\n وخاتم النبيين { ٱلْكِتَابَ } الجامع لجميع الكتب السالفة متلبساً { بِٱلْحَقِّ } والصدق { مُصَدِّقاً لِّمَا بَيْنَ يَدَيْهِ مِنَ } جنس { ٱلْكِتَابِ } المنزل على الرسل الماضين { وَ } مع كونه مصدقاً { مُهَيْمِناً عَلَيْهِ } مستحضراً لما فيه\n يحفظه عن التحريف والتغيير\n إذ الكتب الإلهية كلٌّ لا حق منها يحفظ حكم سابق\n ويصونه عن التطرق والتحريف\n وإن كان مشتملاً على نسخ وتغيير إلهي بحسب الزمانين ومقتضى المرتبتين { فَٱحْكُم } أيضاً { بَيْنَهُم } مطابقاً { بِمَآ أَنزَلَ ٱللَّهُ } إليك في كتابه { وَلاَ تَتَّبِعْ أَهْوَآءَهُمْ } الباطلة\n ميلاً ومداهنة\n ولا تنحرف { عَمَّا جَآءَكَ مِنَ ٱلْحَقِّ } الصريح\n لائق للحكمة الإلهية المقتضية للأحكام\n\n\nواعلموا أيها الأمم المتوجهون نحو التوحيد المسقط لجميع الإضافات { لِكُلٍّ جَعَلْنَا مِنكُمْ شِرْعَةً } مورداً ومذهباً تردون منها إلى بحر الوحدة { وَمِنْهَاجاً } طريقاً واضحاً\n بيَّنها الحق لأنبيائه ورسله بإنزال الكتب عليهم { وَلَوْ شَآءَ ٱللَّهُ } الهادي لعباده إلى توحيده { لَجَعَلَكُمْ } وصيَّركم { أُمَّةً وَاحِدَةً } متحدة في المنهج والمقصد بحسب الظاهر أيضاً { وَلَـٰكِن } كثَّركم\n وعدَّد طرقكم { لِّيَبْلُوَكُمْ } ويجربكم { فِي } رعاية مقتضيات { مَآ آتَاكُم } من مواهبه\n وعطاياه الفائضة من تجلياته الحبية\n\n\n{ فَاسْتَبِقُوا } أيها المعترضون لنفحات الحق { الخَيْرَاتِ } الفائضة عن محض جوده فابتدروها\n وتعرضوا لمهايتها\n واعلموا أيها التائهون في سراب الإمكان { إِلَىٰ الله } المتوحد في الجود والوجود { مَرْجِعُكُمْ جَمِيعاً } أيها الأضلال الباطلة\n والتماثيل العاطلة المنعدمة في أنفاسها { فَيُنَبِّئُكُم } بد رفع تعيناتكم { بِمَا كُنتُمْ فِيهِ تَخْتَلِفُونَ } [المائدة: 48] من الإضافات المترتبة على الهويات الباطنة\n\n\nربنا آتنا من لدنك رحمة\n وهيئ لنا من أمرنا رشداً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { مهيمنًا } أي: شاهدًا، والشرعة والمنهاج: قال ابن عطية: معناهما واحد، وقال ابن عباس: أي سبيلاً وسنة. قلت: والظاهر: أن الشرعة يراد بها الأحكام الظاهرة، وهي التي تُصلح الظواهر، والمنهاج يراد به علوم الطريقة الباطنية، وهي التي تصلح الضمائر، وهو مضمن علم التصوف. يقول الحقّ جلّ جلاله: { وأنزلنا إليك } يا محمد { الكتاب } أي: القرآن ملتبسًا { بالحق مصدقًا لما بين يديه } من جنس الكتاب، أي: مصدقًا لما تقدمه من الكتب، بموافقته لهم في الأخبار والتوحيد، { ومهيمنًا عليه } أي: شاهدًا عليه بالصحة، أو راقبًا عليه من التغيير في المعنى، { فاحكم بينهم بما أنزل الله } إليك { ولا تتبع أهواءهم } منحرفًا عما جاءك من الحق إلى ما يشتهونه، لكل نبي { جعلنا منكم شرعة } ظاهرة يصلح بها الظواهر، { ومنهاجًا } أي: طريقًا واضحًا يسلك منها إلى معرفة الحق، وهو ما يتعلق بإصلاح السرائر، واستُدل به على أنا غير متعبدين بالشرائع المتقدمة. { ولو شاء الله لجعلكم أمة واحدة } أي: جماعة واحدة متفقة على دين واحد، { ولكن } عدد الشرائع وخالف بينها { ليبلوكم } أي: يختبركم فيما آتاكم من الشرائع المختلفة، أيكم ينقاد، ويخضع للحق أينما ظهر، فإن اختلاف الأحوال وتنقلات الأطوار فيه يظهر الإقرار والإنكار، { فاستبقوا الخيرات } أي: بادروا إلى الانقياد إلى الطاعات واتباع الحق والخضوع لمن جاء به أينما ظهر، انتهازًا للفرصة، وحيَازة لفضل السبق والتقدم، { إلى الله مرجعكم جميعًا } فيظهر السابقون من المقصرين، { فينبئكم } أي: يخبركم { بما كنتم فيه تختلفون } من أمر الدين بالجزاء الفاصل بين المحق والمبطل، والمبادر والمقصر، واختلاف الشرائع إنما هي باعتبار الفروع، وأما الأصول كالتوحيد والإيمان بالرّسل، والبعث، وغير ذلك من القواعد الأصولية، فهي متفقة‘ قال ـ عليه الصلاة والسلام ـ:\n \" نحنُ أبناء علات، أمهاتُنا شَتَّى وأبونا واحد \" \nيعني التوحيد. والله تعالى أعلم. الإشارة: اعلم أن نبينا ـ عليه الصلاة والسلام ـ جمع الله له ما افترق في غيره، فذاته الشريفة جمعت المحاسن كلها ظاهرة وباطنة، وكتابُه جمع ما في الكتب كلها فهو شاهد عليها، وشريعته جمعت الشرائع كلها، ولذلك كان الولي المحمدي هو أعظم الأولياء. واعلم أن الحق ـ جل جلاله ـ جعل لكل عصر تربية مخصوصة بحسب ما يناسب ذلك العصر، كما جعل لكل أمة شرعة ومنهاجًا بحسب الحكمة، فمن سلك بالمريدين تربية واحدة، وأراد أن يسيرهم على تربية المتقدمين، فهو جاهل بسلوك الطريق، فلو كان السلوك على نمط واحد ما جدد الله الرسل بتجديد الأزمنة والأعصار، فكل نبي وولي يبعثه الله تعالى بخرق عوائد زمانه، وهي مختلفة جدَا، فتارة يغلب على الناس التحاسد والتباغض، فيبعث بإصلاح ذات البين والتآلف والتودد، وتارة يغلب حب الرياسة والجاه فيربى بالخمول وإسقاط المنزلة، وتارة يغلب حب الدنيا وجمعها فيربى بالزهد فيها والتجريد والانقطاع إلى الله. وهكذا فليقس ما لم يقل. والله تعالى أعلم. ولما قصدت اليهود أن يفتنوا النبي صلى الله عليه وسلم بأن يحكم لهم بما يشتهون، أنزل الله تعالى: { وَأَنِ ٱحْكُم بَيْنَهُمْ بِمَآ أَنزَلَ ٱللَّهُ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "59:23",
      "similarity": 0.37635277168762277
    },
    {
      "verse": "45:18",
      "similarity": 0.2202217097780835
    },
    {
      "verse": "42:21",
      "similarity": 0.18138231287079004
    },
    {
      "verse": "7:163",
      "similarity": 0.17983380010600755
    },
    {
      "verse": "42:13",
      "similarity": 0.1688073643861042
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/5:48.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/5:48.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:48.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}