{
  "chapter": "المائدة",
  "text": "وان احكم بينهم بما انزل الله ولا تتبع اهواءهم واحذرهم ان يفتنوك عنۢ بعض ما انزل الله اليك فان تولوا۟ فاعلم انما يريد الله ان يصيبهم ببعض ذنوبهم وان كثيرا من الناس لفسقون",
  "translations": [
    {
      "translation": "Judge between them by what Allah has sent down and do not follow their whims and desires. And beware of them lest they lure you away from some of what Allah has sent down to you. If they turn their backs, then know that Allah wants to afflict them with some of their wrong actions. Many of mankind are deviators.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Judge between them in the light of what has been revealed by God, and do not follow their whims, and beware of them lest they lead you away from the guidance sent down to you by God. If they turn away, then know that God is sure to punish them for some of their sins; and many of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, judge bet-ween them (O Muhammad!) by what Allah has revealed and do not follow their desires, and beware lest they tempt you away from anything of what Allah has revealed to you. And if they turn away, then know well that Allah has indeed decided to afflict them for some of their sins. For surely many of them are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), you must judge among them by what God has revealed. Do not follow their desires. Beware of their mischievous deception concerning some of the matters that God has revealed to you. If they turn away, know that what God wants is to punish them for some of their sins. Many human beings are evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And therefore, O Muslims, judge between them according to what is sent down by Allah, and do not follow their desires, and be cautious of them so that they may not divert you from some commands which have been sent down to you; then if they turn away, know that Allah’s will is to punish them for some of their sins; and indeed many men are disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so judge between them by what Allah has revealed and follow not their vain desires, but beware of them lest they turn you far away from some of that which Allah has sent down to you. And if they turn away, then know that Allah's will is to punish them for some sins of theirs. And truly, most men are rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that you should judge between them by what Allah has revealed, and do not follow their low desires, and be cautious of them, lest they seduce you from part of what Allah has revealed to you; but if they turn back, then know that Allah desires to afflict them on account of some of their faults; and most surely many of the people are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And judge between them according to what God has sent down, and do not follow their caprices, and beware of them lest they tempt thee away from any of what God has sent down to thee. But if they turn their backs, know that God desires only to smite them for some sin they have committed; surely, many men are ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So judge between them by that which Allah hath revealed, and follow not their desires, but beware of them lest they seduce thee from some part of that which Allah hath revealed unto thee. And if they turn away, then know that Allah's Will is to smite them for some sin of theirs. Lo! many of mankind are evil-livers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Judge between them by what God has sent down and do not be led by their desires. Beware of them lest they turn you away from a part of that what God has revealed to you. If they reject your judgement, know that God intends to punish them for the sins they have committed. Indeed a large number of the people are disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And judge thou between them by that which Allah hath sent down, and follow thou not their desires, and beware thou of them lest they tempt thee away from any part of that which Allah hath sent down unto thee. Then if they turn away, then know thou that Allah only intendeth to afflict them for some of their sins. And verily many of the mankind are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Judge between them by what Allah has sent down, and do not follow their desires. Beware of them lest they should beguile you from part of what Allah has sent down to you. But if they turn their backs [on you], then know that Allah desires to punish them for some of their sins, and indeed many of the people are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this (He commands): Judge thou between them by what Allah hath revealed, and follow not their vain desires, but beware of them lest they beguile thee from any of that (teaching) which Allah hath sent down to thee. And if they turn away, be assured that for some of their crime it is Allah's purpose to punish them. And truly most men are rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so judge (you O Muhammad SAW) between them by what Allah has revealed and follow not their vain desires, but beware of them lest they turn you (O Muhammad SAW) far away from some of that which Allah has sent down to you. And if they turn away, then know that Allah's Will is to punish them for some sins of theirs. And truly, most of men are Fasiqun (rebellious and disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And judge among them in accordance to that which Allah has sent down and do not be led by their desires. Take heed lest they should turn you away from a part of that which Allah has sent to you. If they reject your judgment, know that Allah wants to scourge them for some of their sins. Many of the people are wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And judge between them according to what God revealed, and do not follow their desires. And beware of them, lest they lure you away from some of what God has revealed to you. But if they turn away, know that God intends to strike them with some of their sins. In fact, a great many people are corrupt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And judge, [O Muhammad], between them by what Allah has revealed and do not follow their inclinations and beware of them, lest they tempt you away from some of what Allah has revealed to you. And if they turn away - then know that Allah only intends to afflict them with some of their [own] sins. And indeed, many among the people are defiantly disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:49] And judge between them according to what God has revealed, and do not follow their whims, and beware of them lest they seduce you, [lest] they lead you astray, from part of what God has revealed to you. But if they turn away, from the judgement revealed, and desire some other, then know that God desires to smite them, with punishment in this world, for some of their sins, [those] which they have committed, among them, their turning away, and [that He desires] to requite them for all of their sins in the Hereafter; surely, many of mankind are wicked.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So judge between them) between Banu Qurayzah and Banu'l-Nadir and the people of Khaybar (by that which Allah hath revealed) by that which Allah has exposited in the Qur'an, (and follow not their desires) by applying whipping and leaving the punishment of stoning, (but beware of them) do not trust them (lest they seduce thee) such that they do not turn you away (from some part of that which Allah hath revealed unto you) in the Qur'an and in relation to stoning. (And if they turn away) from applying the legal ruling of stoning and from that which you judged between them regarding retaliation, (then know that Allah's will is to smite them) to punish them (for some sin of theirs) for all their sins. (Lo! many of mankind) of the people of the Book (are evil-doers) disbelievers who break their covenants.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَن يَفْتِنُوكَ } معناهُ يَضِلُوكَ\n\n\n\n\nوقوله تعالى:\n\n[التوبة: 98] [الفتح: [6] معناهُ دَولَةُ السُّوءِ\n\n",
      "translations": [
        {
          "translation": "\nThe meaning of the saying of the Most High: {They will surely seduce you} is that they will mislead you.\n\n\nAnd His saying, \"O My Lord, {indeed I have wronged myself, so forgive me},\" is the best of repentance.\n\n\nThe repentance: 98 The opening: [6] It means the state of evil",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً أمرناك فيما أنزلنا إليك بالحق { أَنِ ٱحْكُم بَيْنَهُمْ } مطابقاً\n موافقاً { بِمَآ أَنزَلَ ٱللَّهُ } إليك في كتابه بلا ميل وانحراف عنه { وَلاَ تَتَّبِعْ أَهْوَآءَهُمْ } المضلة { وَٱحْذَرْهُمْ } عن { أَن يَفْتِنُوكَ } ويُلبَّسوا عليك { عَن بَعْضِ مَآ أَنزَلَ ٱللَّهُ إِلَيْكَ } بمواساتك\n وإظهار محبتك ومودتك قاصدين انحرافك\n وميلك إلى ما تهوى نفوسهم { فَإِن تَوَلَّوْاْ } أعرضوا عنك وعن حكمك\n\n\n{ فَٱعْلَمْ } أيها الداعي للخلق إلى الحق { أَنَّمَا يُرِيدُ ٱللَّهُ } وتتعلق مشيئته به { أَن يُصِيبَهُم } ويأخذهم { بِبَعْضِ ذُنُوبِهِمْ } وهو التولي والإعراض عنك وعن حكمك\n لأنهم قد خرجوا بالإعراض عنك عن حكمك\n عن جميع حدود الله وأحكامه { وَ } لا تتعجب خروجهم { إِنَّ كَثِيراً مِّنَ ٱلنَّاسِ } الناسين للعهود الأصلية { لَفَاسِقُونَ } [المائدة: 49] خارجون عن مقتضى الأحكام الإلهية وحكمه بمتابعة الأهواء الباطلة\n\n\n{ أَ } يعرضون",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وأن احكم }: عطف على الكتاب\n أي: وأنزلنا إليك الكتاب والحكم بينهم بما أنزل الله\n أو على الحق\n أي: أنزلناه بالحق وبالحكم بما أنزل الله\n و { أن يفتنوك }: بدل اشتمال من الضمير\n أي: احذر فتنتهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:92",
      "similarity": 0.4141111538648535
    },
    {
      "verse": "26:56",
      "similarity": 0.37695763558741213
    },
    {
      "verse": "3:28",
      "similarity": 0.34151471933143634
    },
    {
      "verse": "2:145",
      "similarity": 0.3257590622432462
    },
    {
      "verse": "13:37",
      "similarity": 0.3100358079240019
    }
  ]
}