{
  "chapter": "المائدة",
  "text": "اليوم احل لكم الطيبت وطعام الذين اوتوا۟ الكتب حل لكم وطعامكم حل لهم والمحصنت من المؤمنت والمحصنت من الذين اوتوا۟ الكتب من قبلكم اذا ءاتيتموهن اجورهن محصنين غير مسفحين ولا متخذى اخدان ومن يكفر بالايمن فقد حبط عمله وهو فى الءاخرة من الخسرين",
  "translations": [
    {
      "translation": "Today all good things have been made halal for you. And the food of those given the Book is also halal for you and your food is halal for them. So are free women from among the muminun and free women of those given the Book before you, once you have given them their dowries in marriage, not in fornication or taking them as lovers. But as for anyone who rejects iman, his actions will come to nothing and in the Next World he will be among the losers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On this day all things that are clean have been made lawful for you; and made lawful for you is the food of the people of the Book, as your food is made lawful for them. And lawful are the chaste Muslim women, and the women of the people of the Book who are chaste, (for marriage) and not fornication or liaison, if you give them their dowries. Useless shall be rendered the acts of those who turn back on their faith, and they will be among the losers in the life to come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This day all good things have been made lawful to you. The food of the People of the Book is permitted to you, and your food is permitted to them. And permitted to you are chaste women, be they either from among the believers or from among those who have received the Book before you, provided you become their protectors in wedlock after paying them their bridal-due, rather than go around committing fornication and taking them as secret-companions. The work of he who refuses to follow the way of faith will go waste, and he will be among the utter losers in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On this day, all pure things are made lawful for you (as food). The food of the People of the Book is made lawful for you and your food is made lawful for them. It is lawful for you to marry chaste Muslim women and chaste women of the People of the Book, provided, you pay their dowry, maintain chastity, and avoid fornication or lustful relations outside of marriage. The deeds of anyone who rejects the faith, certainly, become fruitless. He will be of those who lose on the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This day the pure things are made lawful for you; and the food of the People given the Book(s) is lawful for you – and your food is lawful for them – and likewise are the virtuous Muslim women and the virtuous women from the people who received the Book(s) before you when you give them their bridal money – marrying them, not committing adultery nor as mistresses; and whoever turns a disbeliever after being a Muslim, all his deeds are wasted and he will be among the losers in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Made lawful to you this day are At-Tayyibat. The food of the People of the Scripture is lawful to you, and your food is lawful to them. (Lawful to you in marriage) are chaste women from the believers and chaste women from those who were given the Scripture before your time when you have given them their due, desiring chastity, not illegal sexual intercourse, nor taking them as girlfriends (or lovers). And whosoever rejects faith, then fruitless is his work; and in the Hereafter he will be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This day (all) the good things are allowed to you; and the food of those who have been given the Book is lawful for you and your food is lawful for them; and the chaste from among the believing women and the chaste from among those who have been given the Book before you (are lawful for you); when you have given them their dowries, taking (them) in marriage, not fornicating nor taking them for paramours in secret; and whoever denies faith, his work indeed is of no account, and in the hereafter he shall be one of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Today the good things are permitted you, and the food of those who were given the Book is permitted to you, and permitted to them is your food; Likewise believing women in wedlock, and in wedlock women of them who were given the Book before you if you give them their wages, in wedlock and not in licence, or as taking lovers. Whoso disbelieves in the faith, his work has failed, and in the world to come he shall be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This day are (all) good things made lawful for you. The food of those who have received the Scripture is lawful for you, and your food is lawful for them. And so are the virtuous women of the believers and the virtuous women of those who received the Scripture before you (lawful for you) when ye give them their marriage portions and live with them in honour, not in fornication, nor taking them as secret concubines. Whoso denieth the faith, his work is vain and he will be among the losers in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Today, all good things have been made lawful to you. The food of the People of the Book is lawful to you, and your food is lawful to them. The chaste believing women and the chaste women of the people who were given the Book before you, are lawful to you, provided that you give them their dowers, and marry them, neither committing fornication nor taking them as mistresses. The deeds of anyone who rejects the faith will come to nothing, and in the Hereafter he will be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To-day are allowed unto you all clean foods, and the meat of those vouchsafed the Book is allowable for you, and your meat is allowable for them as also are the wedded believing women and the wedded women of those vouchsafed the Book before you, when ye have given them their dowers, taking them in wedlock, neither fornicating, nor taking them is secret paramours. And who soever rejecteth the faith, his work will surely come to naught, and in the Hereafter he shall be of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Today all the good things have been made lawful to you—the food of those who were given the Book is lawful to you, and your food is lawful to them—and the chaste ones from among faithful women, and chaste women of those who were given the Book before you, when you have given them their dowries, in wedlock, not in license, nor taking paramours. Should anyone renounce his faith, his work shall fail and he will be among the losers in the Hereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This day are (all) things good and pure made lawful unto you. The food of the People of the Book is lawful unto you and yours is lawful unto them. (Lawful unto you in marriage) are (not only) chaste women who are believers, but chaste women among the People of the Book, revealed before your time,- when ye give them their due dowers, and desire chastity, not lewdness, nor secret intrigues if any one rejects faith, fruitless is his work, and in the Hereafter he will be in the ranks of those who have lost (all spiritual good).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Made lawful to you this day are At-Tayyibat [all kinds of Halal (lawful) foods, which Allah has made lawful (meat of slaughtered eatable animals, etc., milk products, fats, vegetables and fruits, etc.). The food (slaughtered cattle, eatable animals, etc.) of the people of the Scripture (Jews and Christians) is lawful to you and yours is lawful to them. (Lawful to you in marriage) are chaste women from the believers and chaste women from those who were given the Scripture (Jews and Christians) before your time, when you have given their due Mahr (bridal money given by the husband to his wife at the time of marriage), desiring chastity (i.e. taking them in legal wedlock) not committing illegal sexual intercourse, nor taking them as girl-friends. And whosoever disbelieves in the Oneness of Allah and in all the other Articles of Faith [i.e. His (Allah's), Angels, His Holy Books, His Messengers, the Day of Resurrection and Al-Qadar (Divine Preordainments)], then fruitless is his work, and in the Hereafter he will be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The good things have this day been made lawful to you. The food of those to whom the Book was given is lawful to you, and your food is lawful to them. Lawful to you (in marriage) are the free believing women and the free women from among those who were given the Book before you, provided that you give them their dowries in marriage, neither committing fornication nor taking them as mistresses. Whosoever denies the belief, his labors will be annulled. In the Everlasting Life he is of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Today all good things are made lawful for you. And the food of those given the Scripture is lawful for you, and your food is lawful for them. So are chaste believing women, and chaste women from the people who were given the Scripture before you, provided you give them their dowries, and take them in marriage, not in adultery, nor as mistresses. But whoever rejects faith, his work will be in vain, and in the Hereafter he will be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This day [all] good foods have been made lawful, and the food of those who were given the Scripture is lawful for you and your food is lawful for them. And [lawful in marriage are] chaste women from among the believers and chaste women from among those who were given the Scripture before you, when you have given them their due compensation, desiring chastity, not unlawful sexual intercourse or taking [secret] lovers. And whoever denies the faith - his work has become worthless, and he, in the Hereafter, will be among the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:5] Today the good, the delicious, things are permitted to you, and the food of those who were given the Scripture, that is, animals slaughtered by the Jews and Christians, is permitted to you, and permitted to them is your food. Likewise, the believing, free, married women, and the married women of those who were given the Scripture before you, are permitted to you for marriage, if you give them their wages, their dowries, in wedlock, in marriage, and not illicitly, fornicating overtly with them, or taking them as lovers, so as to fornicate with them secretly. Whoever disbelieves in faith, that is, [whose] apostatises, his, prior good, work has indeed failed, and so it counts for nothing and he will not be rewarded for it, and in the Hereafter he shall be among the losers, if he dies in this state [of unbelief]. 2848851345\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيجيء في التقييد ( باليوم ) هنا ما جاء في قوله : { اليوم يئس الذين كفروا من دينكم } \\[ المائدة : 3 \\] وقولِه : { اليوم أكملت لكم دينكم } \\[ المائدة : 3 \\] ، عدا وجه تقييد حصول الفعل حقيقة بذلك اليوم ، فلا يجيء هنا ، لأنّ إحلال الطيّبات أمر سابق إذ لم يكن شيء منها محرّماً ، ولكن ذلك اليوم كان يوم الإعلام به بصفة كليّة ، فيكون كقوله : { ورَضيت لكم الإسلام ديناً } \\[ المائدة : 3 \\] في تعلّق قوله : { اليوم } به ، كما تقدّم .ومناسبة ذكر ذلك عقب قوله { اليوم يئسَ } \\[ المائدة : 3 \\] و { اليوم أكملت } \\[ المائدة : 3 \\] أنّ هذا أيضاً منّة كبرى لأنّ إلقاء الأحكام بصفة كلّيّة نعمة في التفقّه في الدين .والكلام على الطيّبات تقدّم آنفاً ، فأعيدَ ليُبنى عليه قوله : { وطعام الذين أتوا الكتاب } . وعطفُ جملة { وطعام الذين أوتوا الكتاب حلّ لكم } على جملة { اليومَ أحلّ لكم الطيّبات } لأجل ما في هذه الرخصة من المنّة لكثرة مخالطة المسلمين أهل الكتاب فلو حرّم الله عليهم طعامهم لشقّ ذلك عليهم .والطعام في كلام العرب ما يطعَمه المرء ويأكله ، وإضافته إلى أهل الكتاب للملابسة ، أي ما يعالجه أهل الكتاب بطبخ أو ذبح . قال ابن عطية : الطعام الذي لا محاولة فيه كالبُرّ والفاكهة ونحوهما لا يغيّره تملّك أحد له ، والطعام الذي تقَع فيه محاولة صنعته لا تعلّق للدين بها كخَبز الدقيق وعصر الزيت . فهذا إن تُجنِّبَ من الذميّ فعلى جهة التقذّر . والتذكية هي المحتاجة إلى الدّين والنية ، فلمَّا كان القياس أن لا تجوز ذبائحهم رخص الله فيها على هذه الأمّة وأخرجها عن القياس . وأراد بالقياس قياس أحوال ذبائحهم على أحوالهم المخالفة لأحوالنا ، ولهذا قال كثير من العلماء : أراد الله هنا بالطعام الذبائح ، مع اتّفاقهم على أنّ غيرها من الطعام مباح ، ولكن هؤلاء قالوا : إنّ غير الذبائح ليس مراداً ، أي لأنّه ليس موضع تردّد في إباحة أكله . والأولى حمل الآية على عمومها فتشمل كلّ طعام قد يظن أنَّه محرّم علينا إذ تدخله صنعتهم ، وهم لا يتَوَقَّوْنَ ما نتوقّى ، وتدخله ذكاتهم وهم لا يشترطون فيها ما نشترطه . ودخل في طعامهم صيدهم على الأرجح .و { الذين أوتوا الكتاب } : هم أتباع التوراة والإنجيل ، سواء كانوا ممّن دعاهم موسى وعيسى عليهما السلام إلى اتّباع الدين ، أم كانوا ممّن اتّبعوا الدينيين اختياراً؛ فإنّ موسى وعيسى ودعَوا بني إسرائيل خاصّة ، وقد تهوّد من العرب أهل اليمن ، وتنصّر من العرب تغلب ، وبهراء ، وكلب ، ولخم ، ونَجران ، وبعض ربيعة وغسّان ، فهؤلاء من أهل الكتاب عند الجمهور عدا عليّا بن أبي طالب فإنه قال : لا تحلّ ذبائح نصارى تغلب ، وقال : إنّهم لم يتمسّكوا من النصرانية بشيء سوى شرب الخمر .وقال القرطبي : هذا قول الشافعي ، وروى الربيع عن الشافعي : لا خير في ذبائح نصارى العرب من تغلب . وعن الشافعي : من كان من أهل الكتاب قبل البعثة المحمّدية فهو من أهل الكتاب ، ومن دخل في دين أهل الكتاب بعد نزول القرآن فلا يقبل منه إلاّ الإسلام ، ولا تقبل منه الجزية ، أي كالمشركين .وأمَّا المجوس فليسوا أهل كتاب بالإجماع ، فلا تؤكل ذبائحهم ، وشذّ من جعلهم أهل كتاب . وأمَّا المشركون وعبدة الأوثان فليسوا من أهل الكتاب دون خلاف .وحِكمة الرخصة في أهل الكتاب : لأنّهم على دين إلهي يُحرّم الخبَائث ، ويتقي النجاسة ، ولهم في شؤونهم أحكام مضبوطة متّبعة لا تظنّ بهم مخالفتها ، وهي مستندة للوحي الإلهي ، بخلاف المشركين وعبدة الأوثان . وأمّا المجوس فلهم كتاب لكنّه ليس بالإلهي ، فمنهم أتباع ( زَرَادشْت ) ، لهم كتابُ ( الزندفستا ) وهؤلاء هم محلّ الخلاف . وأمّا المجوس ( المَانَويَّة ) فهم إباحية فلا يختلف حالهم عن حال المشركين وعبدة الأوثان ، أو هم شرّ منهم . وقد قال مالك : ما ليس فيه ذكاة من طعام المجوس فليس بحرام يعني إذا كانوا يتّقون النجاسة . وفي «جامع الترمذي» : أنّ أبا ثعلبة الخشني سأل رسول الله صلى الله عليه وسلم عن قدور المجوس . فقال له : \" أنْقُوها غسلاً واطبخوا فيها \" وفي البخاري : أنّ أبا ثعلبة سأل رسول الله صلى الله عليه وسلم عن آنِيَة أهل الكتاب . فقال له : \" إن وجدتم غيرها فلا تأكلوا فيها ، وإن لم تجدوا فاغسلوها ثمّ كلوا فيها \" قال ابن العربي : «فغسل آنية المجوس فرض ، وغسل آنية أهل الكتاب ندب» . يُريد لأنّ الله أباح لنا طعام أهل الكتاب فقد علم حالهم ، وإنَّما يسري الشكّ إلى آنيتهم من طعامهم وهو مأذون فيه ، ولم يبح لنا طعام المجوس ، فذلك منزع التفرقة بين آنية الفريقين .ثم الطعامُ الشامل للذكاة إنّما يعتبر طعاماً لهم إذاكانوا يستحلّونه في دينهم ، ويأكله أحبارهم وعلماؤهم ، ولو كان ممّا ذكر القرآنُ أنَّه حرّمه عليهم ، لأنَّهم قد تأوّلوا في دينهم تأويلات ، وهذا قول مالك . وأرى أنّ دليله : أنّ الآية عمّمت طعامهم فكان عمومها دليلاً للمسلمين ، ولا التفات إلى ما حكَى الله أنّه حرّمه عليهم ثم أباحه للمسلمين ، فكان عموم طعامهم في شرعنا مُباحاً ناسخاً للمحرّم عليهم ، ولا نصِيرُ إلى الاحتجاج «بشرع من قبلنا . . . » إلاّ إذا لم يكن لنا دليل على حُكمهِ في شرعنا . وقيل : لا يؤكل ما علِمْنا تحريمه عليهم بنصّ القرآن ، وهو قول بعض أهل العلم ، وقيل به في مذهب مالك ، والمعتمد عن مالك كراهة شحوم بقر وغنم اليهود من غير تحريم؛ لأنّ الله ذكر أنه حرّم عليهم الشحوم .ومن المعلوم أن لا تعمل ذكاة أهل الكتاب ولا إباحة طعامهم فيما حرّمه الله علينا بعينه : كالخنزير والدم ، ولا ما حرّمه علينا بوصفه ، الذي ليس بذكاة : كالميتة والمنخنقة والموقوذة والمتردّية والنطيحة وأكيلة السبع ، إذا كانوا هم يستحلّون ذلك ، فأمَّا ما كانت ذكاتهم فيه مخالفة لذكاتنا مخالفةَ تقصير لا مخالفة زيادة فذلك محلّ نظر كالمضروبة بمحدّد على رأسها فتموت ، والمفتولة العنق فتتمزّق العروق ، فقال جمهور العلماء : لا يؤكل .وقال أبو بكر ابن العربي من المالكية : تؤكل . وقال في «الأحكام» : فإن قيل فما أكلوه على غير وجه الذكاة كالخنق وحطْم الرأس فالجواب : أنّ هذه ميتة ، وهي حرام بالنصّ ، وإن أكلوها فلا نأكلها نحْن ، كالخنزير فإنّه حلال لهم ومن طعامهم وهو حرام علينا يريد إباحته عند النصارى ثم قال : ولقد سُئِلت عن النصراني يفتل عنق الدجاجة ثم يطبخها؛ هل تؤكل معه أو تؤخذ طعاماً منه ، فقلت : تؤكل لأنها طعامه وطعام أحباره ورهبانه ، وإن لم تكن هذه ذكاة عندنا ولكن الله تعالى أباح طعامهم مطلقاً وكلّ ما يرونه في دينهم فإنّه حلال لنا في ديننا» . وأشكل على كثير من الناظرين وجه الجمع بين كلامي ابن العربي ، وإنّما أراد التفرقة بين ما هو من أنواع قطع الحلقوم ، والأوداج ولو بالخنق ، وبين نحو الخنق لحبس النفَس ، ورَضّ الرأس وقول ابن العربي شذوذ .وقوله : { وطعامكم حلّ لهم } لم يعرّج المفسّرون على بيان المناسبة بذكر { وطعامكم حلّ لهم } . والذي أراه أنّ الله تعالى نبّهنا بهذا إلى التيسير في مخالطتهم ، فأباح لنا طعامهم ، وأباح لنا أن نُطعمهم طعَامنا ، فعُلم من هذين الحكمين أنّ علّة الرخصة في تناولنا طعامهم هو الحاجة إلى مخالطتهم ، وذلك أيضاً تمهيد لقوله بعد : { والمحصنات من الذين أوتوا الكتاب } لأنّ ذلك يقتضي شدّة المخالطة معهم لتزوّج نسائهم والمصَاهرة معهم .{ والمحصنات مِنَ المؤمنات والمحصنات مِنَ الذين أُوتُواْ الكتاب مِن قَبْلِكُمْ إِذَآ ءَاتَيْتُمُوهُنَّ أُجُورَهُنَّ مُحْصِنِينَ غَيْرَ مُسَافِحِينَ وَلاَ متخذى أَخْدَانٍ وَمَن يَكْفُرْ بالإيمان فَقَدْ حَبِطَ عَمَلُهُ وَهُوَ فِى الاخرة مِنَ الخاسرين } .عُطف { والمحصنات من المؤمنات } على { وطعام الذين أوتوا الكتاب حلّ لكم } عطفَ المفرد على المفرد . ولم يعرّج المفسّرون على بيان المناسبة لذكر حِلّ المحصنات من المؤمناتتِ في أثناء إباحة طعام أهل الكتاب ، وإباحةِ تزوّج نسائهم . وعندي : أنّه إيماء إلى أنَّهنّ أولى بالمؤمنين من محصنات أهل الكتاب ، والمقصودُ هو حكم المحصنات من الذين أوتوا الكتاب فإنّ هذه الآية جاءت لإباجة التزوّج بالكتابيات . فقوله : { والمحصنات من الذين أوتوا الكتاب } عطف على { وطعام الذين أوتُوا الكتاب حلّ لكم } . فالتقدير : والمحصنات من الذين أوتوا الكتاب حِلّ لكم .والمُحصنات : النسوة الّلاءِ أحْصَنَهُنّ ما أحْصَنَهُنّ ، أي منعهنّ عن الخنا أو عن الريب ، فأطلق الإحصان : على المعصومات بعصمة الأزواج كما في قوله تعالى في سورة النساء ( 24 ) عطفاً على المحرّمات { المحصنات من النساء } ؛ وعلى المسلمات لأنّ الإسلام وَزَعَهن عن الخنا ، قال الشاعر :ويصدّهن عن الخنا الإسلام ... وأطلق على الحرائر ، لأنّ الحرائر يترفّعن عن الخنا من عهد الجاهلية . ولا يصلح من هذه المعاني هنا الأوّل ، إذ لا يحلّ تزوّج ذات الزوج ، ولا الثاني لقوله : من المؤمنات } الذي هو ظاهر في أنّهنّ بعض المؤمنات فتعيّن معنى الحرية ، ففسّرها مالك بالحرائر ، ولذلك منع نكاح الحرّ الأمةَ إلاّ إذا خشي العنت ولم يجد للحرائر طَوْلا ، وجوّز ذلك للعبد ، وكأنّه جعل الخطاب هنا للأحرار بالقرينة وبقرينة آية النساء ( 25 ) { ومن لم يستطع منكم طولاً أن ينكح المحصنات المؤمنات } وهو تفسير بيِّن ملتئم . وأصل ذلك لعمر بن الخطاب ومجاهد . ومن العلماء من فسّر المحصنات هنا بالعفائف ، ونقل عن الشعبي وغيره ، فمنعوا تزوّج غير العفيفة من النساء لرقّة دينها وسوء خلقها .وكذلك القول في تفسير قوله : والمحصنات من الذين أوتوا الكتاب من قبلكم } أي الحرائر عند مالك ، ولذلك منع نكاح إماء أهل الكتاب مطلقاً للحرّ والعبد . والذين فسّروا المحصنات بالعفائف منعوا هنا ما منعوا هناك .وشمل أهلُ الكتاب : الذمّييّن ، والمعاهدين ، وأهل الحرب ، وهو ظاهر ، إلاّ أنّ مالكاً كره نكاح النساء الحربيّات ، وعن ابن عبّاس : تخصيص الآية بغير نساء أهل الحرب ، فمنع نكاح الحربيات . ولم يذكروا دليله .والأجور : المهور ، وسمَّيت هنا ( أجوراً ) مجازاً في معنى الأعْواض عن المنافع الحاصلة من آثار عُقدة النكاح ، على وجه الاستعارة أوْ المجاز المرسل . والمَهْر شِعار متقادم في البشر للتفرقة بين النكاح وبين المخادنة . ولو كانت المهور أجوراً حقيقة لوجب تحْديد مدّة الانتفاع ومقدارِه وذلك مِمَّا تنزّه عنه عقدة النكاح .والقول في قوله : { محصنات غير مسافحين ولا متخذي أخدان } كالقول في نظيره { محصنات غير مسافحات } \\[ النساء : 25 \\] تقدّم في هذه السورة .وجملة { ومن يكفر بالإيمان فقد حبط عمله } معترضة بين الجمل . والمقصود التنبيه على أنّ إباحة تزوّج نساء أهل الكتاب لا يقتضي تزكية لحالهم ، ولكن ذلك تيسير على المسلمين . وقد ذُكر في سبب نزولها أنّ نساء أهل الكتاب قلن «لولا أنّ الله رضي ديننا لم يبح لكم نكاحنا» . والمرادُ بالإيمان الإيمانُ المعهود وهو إيمان المسلمين الذي بسببه لُقّبوا بالمؤمنين ، فالكفر هنا الكفر بالرسل ، أي : ينكر الإيمان ، أي ينكر ما يقتضيه الإيمان من المعتقدات ، إذ الإيمان صار لَقباً لمجموع ما يجب التصديق به .والحبْط بسكون الموحّدة والحُبوط : فساد شيء كان صالحاً ، ومنه سمّي الحَبَط بفتحتين مرض يصيب الإبل من جرّاء أكل الخَضِر في أوّل الربيع فتنتفخ أمعاؤها وربما ماتت . وفعل ( حَبِط ) يؤذن بأنّ الحابط كان صالحاً فانقلب إلى فساد . والمراد من الفساد هنا الضياع والبطلان ، وهو أشدّ الفساد ، فدلّ فعل ( حبِط ) على أنّ الأعمال صالحة ، وحُذف الوصف لدلالة الفعل عليه . وهذا تشبيه لضياع الأعمال الصالحة بفَساد الذواتتِ النافعة ، ووجه الشبه عدم انتفاع مكتسبها منها . والمراد ضياع ثوابها وما يترقّبه العامل من الجزاء عليها والفوْز بها .والمراد التحذير من الارتداد عن الإيمان ، والترغيبُ في الدخول فيه كذلك ، ليعلم أهل الكتاب أنّهم لا تنفعهم قرباتهم وأعمالهم ، ويعلم المشركون ذلك .\n\n",
      "translations": [
        {
          "translation": "(This day) the day of the pilgrimage (are (all) good things) that which has been immolated (made lawful for you. The food) the animals immolated (of those who have received the Scripture is lawful for you) as long as it is not prohibited, (and your food) your immolated animals (is lawful for them) both the Jews and Christians can consume that which the Muslims immolate. (And so are the) free (virtuous women of the believers) are lawful for you to marry (and the virtuous women of those who received the Scripture before you) lawful for you to marry (when ye give them their marriage portions) their dowry, in surplus of the price given to the prostitute in exchange for sex (and live with them in honour) in wedlock, (not in) flagrant (fornication, nor taking them as secret concubines.) This was revealed about the women of Mecca when they boasted to the women of Medina. Allah said: (Whoso denieth the faith) Allah's divine Oneness, (his work is vain) in this world (and he will be among the losers in the Hereafter) he will be of those who have been duped since he will be deprived of Paradise and enter hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلْيَوْمَ أُحِلَّ لَكُمُ ٱلطَّيِّبَاتُ } معناهُ الحَلالُ\n\n\n\n\nوقوله تعالى: { وَطَعَامُ ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ حِلٌّ لَّكُمْ } معناهُ ذبائِحُهُمْ\n\n\n\n\nوقوله تعالى:\n\n[النساء: 25] معناهُ عَفَائِفُ غَيرُ زَوانٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Today, all good things are made lawful for you,\" means that all things that are permissible are lawful for you.\n\n\nAnd the saying of Allah, \"The food of those who have been given the Book is lawful for you,\" means that their slaughtered animals are lawful for you.\n\nAnd His saying, \"Exalted be He,\"\n {The women: 25} Its meaning is {non-blinking eyelids}",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلْيَوْمَ } أي: حين انتشر وظهر دينكم على الأديان كلها { أُحِلَّ لَكُمُ ٱلطَّيّبَـٰتُ } المذكورة\n المحللة فيه { وَ } أيضاً { طَعَامُ ٱلَّذِينَ أُوتُواْ ٱلْكِتَـٰبَ } أي: اليهود والنصارى وذبائحهم { حِلٌّ لَّكُمْ } في دينكم { وَطَعَامُكُمْ } وإطعامكم أيضاً { حِلٌّ لَّهُمْ } لأنهم من ذوي الملل والأديان { وَ } كذا أحلّ لكم { ٱلْمُحْصَنَـٰتُ } الحرائر\n العفائف { مِنَ ٱلْمُؤْمِنَـٰتِ } أي: نكاحكم إياهن { وَ } كذا { ٱلْمُحْصَنَـٰتُ مِنَ ٱلَّذِينَ أُوتُواْ ٱلْكِتَـٰبَ مِن قَبْلِكُمْ إِذَا ءاتَيْتُمُوهُنَّ أُجُورَهُنَّ } مهروهن بلا نقص وتكسير\n\n\nوالحال أنكم { مُحْصِنِينَ } محافظين على حقوق الزوج والنكاح { غَيْرَ مُسَٰفِحِينَ } مجاهرين بالزنا { وَلاَ مُتَّخِذِيۤ أَخْدَانٍ } مستترين به { وَمَن يَكْفُرْ } منكم\n وينكر { بِٱلإِيمَٰنِ } وبلوازمه\n وحدوده الدالة على صحته { فَقَدْ حَبِطَ عَمَلُهُ وَهُوَ فِي ٱلآخِرَةِ مِنَ ٱلْخَٰسِرِينَ } [المائدة: 5] الذي ظلَّ سعيهم في الحياة الدنيا\n وهم يحسبون أنهم يحسنون صنعاً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { اليوم أحل لكم الطيبات وطعام الذين أُتوا الكتاب حل لكم } فيتناول الذبائح وغيرها\n ويعم أهل الكتاب اليهود والنصارى\n واستثنى عليٌّ ـ كرم الله وجهه ـ نصارى بني تغلب\n وقال:  ليسوا على النصرانية\n ولم يأخذوا منها إلا شرب الخمر\n\nولا يلحق بهم المجوس في ذلك\n وإن ألحقوا بهم في الجزية\n لقوله صلى الله عليه وسلم\n \" سُنوا بهم سُنةَ أهلِ الكِتاب\n غير ألا تنكحوا نساءهم\n ولا تأكلوا ذبائحهم \" \nوكذلك المرتد مطلقًا لا تؤكل ذكاته\n قال ابن جزي: وأما الطعام\n فهو على ثلاثة أقسام: أحدها: الذبائح\n قد اتفق العلماء على أنها مرادة في الآية\n فأجازوا أكل ذبائح اليهود والنصارى\n واختلفوا فيما هو محرم عليهم في دينهم\n على ثلاثة أقوال: الجواز\n والمنع\n والكراهة\n وهو مبني على: هل هو من طعامهم أم لا؟ فإن أريد بطعامهم ما ذبحوه\n جازت\n وإن أريد ما يحل لهم\n مُنع والكراهة توسط بين القولين\n الثاني: ما لا محاولة لهم فيه\n كالقمح والفاكهة\n فهو جائر لنا اتفاقًا\n والثالث: ما فيه محاولة كالخبز وتعصير الزيت وعقد الجبن\n وشبه ذلك مما يمكن استعمال النجاسة فيه\n فمنعه ابن عباس لأنه رأى أن طعامهم هو الذبائح خاصة\n وأجازه الجمهور\n لأنه رأوه داخلاً في طعامهم\n وهذا إذا كان استعمال النجاسة فيه محتملاً\n أما إذا تحققنا استعمال النجاسة فيه كالخمر والخنزير والميتة\n فلا يجوز أصلاً\n وقد صنف الطرطوشي في تحريم جبن النصارى\n وقال: إنه يُنجس البائع والمشتري والآلة لأنهم يعقدونه على أنفحه الميتة\n هـ\n { وطعامكم حِلٌّ لهم } \n فلا بأس أن تُطعموهم من طعامكم\n وتبيعوه لهم\n وأما ما حرم عليهم\n فلا يجوز بيعه منهم\n والله تعالى أعلم\n الإشارة: يسألونك أيها العارف الرباني ماذ أحل للفقراء من الأعمال والأحوال\n قل لهم: أحل لكم الطيبات\n أي: الخالص من الأعمال\n والصافي من الأحوال\n والتلذذ بحلاوة المشاهدة والمكالمة\n وما اصطادت لكم أنفسكم من العلوم اللدنية والأسرار القدسية\n بقدر تزكيتها وتربيتها\n فكلوا مما أمسكن عليكم\n أي: تمتعوا بما أتت به لكم من أبكار الحِكَم وعرائس الحقائق\n فإن أتت بشيء من علوم الحس\n فاذكروا اسم الله عليه ينقلب معاني\n واتقوا الله أن تقفوا مع شيء سواه\n { إن الله سريع الحساب } فيحاسبكم على الخواطر والطوارق إن لم تعرفوا فيها\n اليوم أحل لكم الطيبات\n أي: حين دخلتم بلاد المعاني ورسختم فيها\n أحل لكم التمتع بالمشاهدات والمناجات\n وطعام العلوم الظاهرة حِلٌّ لكم تتوسعون بها\n وطعامكم حل لهم\n أي: وتذكيركم بما يقدرون عليه حِلٌّ لهم لأن العارف الكامل يُسير كل واحد على سيره\n ويتلون معه بلونه\n يُقره في بلده ويحوشه إلى ربه\n نفعنا الله بذكره\n آمين\n ثم تكلم على ما بقي من حفظ الأنساب\n وهو جواز نكاح الكتابية إذ لم يتكلم عليه في سورة النساء\n فقال: {\n\n\n\n وَٱلْمُحْصَنَاتُ مِنَ ٱلْمُؤْمِنَاتِ وَٱلْمُحْصَنَاتُ مِنَ ٱلَّذِينَ أُوتُواْ ٱلْكِتَابَ مِن قَبْلِكُمْ إِذَآ ءَاتَيْتُمُوهُنَّ أُجُورَهُنَّ مُحْصِنِينَ غَيْرَ مُسَافِحِينَ وَلاَ مُتَّخِذِيۤ أَخْدَانٍ وَمَن يَكْفُرْ بِٱلإِيمَانِ فَقَدْ حَبِطَ عَمَلُهُ وَهُوَ فِي ٱلآخِرَةِ مِنَ ٱلْخَاسِرِينَ }  يقول الحقّ جلّ جلاله: وأحل لكم { المحصنات } أي: الحرائر { من المؤمنات } دون الإماء\n إلا لخوف العنت\n أو العفيفات دون البغايا\n فإن نكاحها مكروه\n { و } أحل لكم { المحصنات } أي: الحرائر { من الذين أوتوا الكتاب من قبلكم } \n فأحل الله نكاح اليهودية والنصرانية الحُرتين دون إمائهم\n { إذا أتيتموهن أجورهن } أي: أعطيتموهن مهورهن\n فلا يجوز نكاح الكتابية إلا بصداق شرعي\n حال كونكم { محصنين } \n أي: متعففيين عن الزنى بنكاحها\n { غير مسافحين } أي: مجاهرين بالزنى\n { ولا متخذي أخدان } أي: أصحاب تُسرون معهن بالزنى\n والخدن: الصاحب\n يقع على الذكر والأنثى\n والمعنى: أحللنا لكم نكاح الكتابيات\n توسعة عليكم لتتعففوا عن الزنى سرًّا وجهرًا\n ولما نزل إباحة الكتابيات قال بعض الناس: كيف أتزوج من ليس على ديني؟ فأنزل الله: { ومن يكفر بالإيمان } أي: بشرائع الإيمان { فقد حبط عمله وهو في الآخرة من الخاسرين } \n ومن الكفر به إنكاره والامتناع منه\n الإشارة: قد تقدم أن علوم الحقائق أبكار\n لأنها عرائس مخدّرة\n مهرها النفوس\n وما سواها من العلوم ثيبات وإماء لرخص مهرها\n فإذا اتصل العارف بعلوم الحقائق ورسخ فيها أحل له أن ينكح المحصنات من علوم الطريقة ـ وهي مبادىء التصوف\n أي: التفنن فيها مع أهلها على وجه التركيز أو التعليم\n والمحصنات من علوم الشريعة إذا أعطاها مهرها من الإخلاص وقصد التوسع بها وتعليمها لأهلها\n وهذه العلوم كلها مشروعة\n والمشتغل بها متوجه إلى الله تعالى\n\n[البقرة:60]\n فمن كفر بها فقد حبط عمله\n وهو عند الله من الخاسرين\n ثم تكلم على ما بقي من حفظ الأديان\n وهو الوضوء إذ لم يتكلم عليه في النساء\n فقال: { يَا أَيُّهَا ٱلَّذِينَ آمَنُواْ إِذَا قُمْتُمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:25",
      "similarity": 0.6570408411374239
    },
    {
      "verse": "4:24",
      "similarity": 0.45977256855878657
    },
    {
      "verse": "6:145",
      "similarity": 0.2665046920904315
    },
    {
      "verse": "39:65",
      "similarity": 0.15675544778076403
    },
    {
      "verse": "12:48",
      "similarity": 0.14029080364891258
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005005.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005005.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}