{
  "chapter": "المائدة",
  "text": "افحكم الجهلية يبغون ومن احسن من الله حكما لقوم يوقنون",
  "translations": [
    {
      "translation": "Do they then seek the judgement of the Time of Ignorance? Who could be better at giving judgement than Allah for people with certainty?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they seek a judgement of the days of pagan ignorance? But who could be a better judge than God for those who are firm in their faith?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(If they turn away from the Law of Allah) do they desire judgement according to the Law of Ignorance? But for those who have certainty of belief whose judgement can be better than Allah's?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they want judgments that are issued out of ignorance? Who is a better judge for the people whose belief is based on certainty, than God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do they wish a judgement of ignorance? And whose judgement is better than that of Allah, for the people who are certain?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they then seek the judgement of (the days of) ignorance And who is better in judgement than Allah for a people who have firm faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it then the judgment of (the times of) ignorance that they desire? And who is better than Allah to judge for a people who are sure?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it the judgment of pagandom then that they are seeking? Yet who is fairer in judgment than God, for a people having sure faith?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it a judgment of the time of (pagan) ignorance that they are seeking? Who is better than Allah for judgment to a people who have certainty (in their belief)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it pagan laws that they wish to be judged by? Who is a better judge than God for men whose faith is firm?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seek they then the judgement of Paganism? And who is better than Allah in judgement unto a people who are convinced?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they seek the judgement of [pagan] ignorance? But who is better than Allah in judgement for a people who have certainty?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they then seek after a judgment of (the days of) ignorance? But who, for a people whose faith is assured, can give better judgment than Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they then seek the judgement of (the Days of) Ignorance? And who is better in judgement than Allah for a people who have firm Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it pagan laws that they wish to be judged by? Who is a better judge than Allah for a nation whose belief is firm?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it the laws of the time of ignorance that they desire? Who is better than God in judgment for people who are certain?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then is it the judgement of [the time of] ignorance they desire? But who is better than Allah in judgement for a people who are certain [in faith].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:50] Do they desire (yabghūn, is also read tabghūn, ‘[do] you desire?’), [do] they seek, the judgement of paganism, through their deceit and deviation when they turn away? (this is an interrogative meant as a disavowal). Yet who, that is, no one, is better in judgement than God for a people knowing, Him, with certainty? These [people] are singled out for mention because they are the ones who reflect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَرّعت الفاء على مضمون قوله : { فإن تولّوا فاعلم } \\[ المائدة : 49 \\] الخ استفهاماً عن مرادهم من ذلك التولّي ، والاستفهام إنكاري ، لأنّهم طلبوا حكم الجاهليّة . وحكم الجاهليّة هو ما تقرّر بين اليهود من تكايُل الدّماء الّذي سرى إليهم من أحكام أهل يثرب ، وهم أهلُ جاهلية ، فإنّ بني النضير لم يرضوا بالتساوي مع قريظة كما تقدّم؛ وما وضعوه من الأحكام بين أهل الجاهلية ، وهو العدول عن الرجم الّذي هو حكم التّوراة .وقرأ الجمهور { يَبغون } بياء الغائب ، والضمير عائد ل { مَن } من قوله : { ومَنْ لم يحكم بما أنزل الله } \\[ المائدة : 47 \\] . وقرأ ابن عامر بتاء الخطاب على أنّه خطاب لليهود على طريقة الالتفات .والواو في قوله : { ومن أحسن من الله حكماً } واو الحال ، وهو اعتراض ، والاستفهام إنكاري في معنى النفي ، أي لا أحسن منه حكماً . وهو خطاب للمسلمين ، إذ لا فائدة في خطاب اليهود بهذا .وقوله : { لقوم يوقنون } اللام فيه ليست متعلّقة ب { حكماً } إذ ليس المراد بمدخولها المحكومَ لهم ، ولا هي لام التّقوية لأنّ { لقوم يوقنون } ليس مفعولاً ل { حُكماً } في المعنى . فهذه اللامُ تُسمّى لام البيان ولام التبيين ، وهي الّتي تدخل على المقصود من الكلام سواء كان خبراً أم إنشاء ، وهي الواقعة في نحو قولهم : سَقْيَاً لك ، وَجَدْعاً له ، وفي الحديث « تبّاً وسُحقاً لمن بَدّل بَعْدي » ، وقوله تعالى : { هيهات هيهات لِما توعدون } \\[ المؤمنون : 36 \\] { حاش لله } \\[ يوسف : 51 \\] . وذلك أنّ المقصود التّنبيه على المراد من الكلام . ومنه قول تعالى عن زليخا { وقالت هيتَ لك } \\[ يوسف : 23 \\] لأنّ تهيّؤَها له غريب لا يخطر ببال يوسف فلا يدري ما أرادت فقالت له { هيت لك } \\[ يوسف : 23 \\] ، إذا كان ( هيت ) اسمَ فِعْللِ مُضي بمعنى تهيّأتُ ، ومثل قوله تعالى هنا : { ومن أحسن من الله حكماً لقوم يوقنون } . وقد يكون المقصود معلوماً فيخشى خفاؤه فيؤتى باللام لزيادة البيان نحو { حاشَ لله } \\[ يوسف : 51 \\] ، وهي حينئذٍ جديرة باسم لام التبيين ، كالداخلة إلى المواجه بالخطاب في قولهم : سَقياً لك ورعياً ، ونحوهما ، وفي قوله : { هِيتَ } \\[ يوسف : 23 \\] اسمَ فعل أمر بمعنى تَعالَ . وإنّما لم تجعل في بعض هذه المواضع لام تقوية ، لأنّ لام التّقوية يصحّ الاستغناء عنها مع ذكر مدخولها ، وَفي هذه المواضع لا يذكر مدخول اللام إلاّ معها .\n\n",
      "translations": [
        {
          "translation": "(Is it a judgement of the time of (pagan) ignorance that they are seeking?) to find in the Qur'an, Muhammad. (Who is better than Allah for judgement to a people who have certainty?) in Muhammad and the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أفحكم الجاهلية يبغون } أي: ما يطلبون بجهلهم إلا حكماً صادراً عن مقام النفس بالجهل لا صادراً عن علم إلهي { من يرتدّ } من يرجع عن طريق الحق إلى الاحتجاب ببعض الحجب\n أيّ حجاب كان وخرج عنه فهو من المردودين لا من أهل المحبة ولا ينثلم ولا ينتقض دين الحق بارتداده\n فإن الله سوف يأتي بقوم يحبهم بحسب العناية الأولى لا لعلة بل لذواتهم\n ويحبون ذاته لا لصفة من صفاته ككونه لطيفاً أو رحيماً أو منعماً فإن محبة الصفات تتغير باختلاف تجلياتها ومن يحب اللطيف لم تبق محبته إذا تجلى بصفة القهر\n ومن يحب المنعم انمحت محبته إذا تجلى بصفة المنتقم\n وأما محبة الذات فهي باقية ببقائها لا تتغير باختلاف التجليات فيحب محبها القهار عند القهر كما يحب اللطيف عند اللطف\n ويحب المنتقم حالة الانتقام كما يحب المنعم حالة الإنعام فلا تفاوت في الرضا وعدمه\n ولا تختلف محبته في أحواله ويشكر عند البلاء كما يشكر عند النعماء\n وأما من يحب المنعم فلا يشكر عند البلاء بل يصبر ومثل هذه المحبة يلزم المحبة الأولى التي هي لله ولأوليائه فيحبونه بحبه إياهم\n وإلا فمن أين لهم المحبة لله\n ما للتراب وربّ الأرباب\n { أذِلة على المؤمنين } لينين حانين عليهم\n عطوفين في تواضعهم لهم لمكان الجنسية الذاتية ورابطة المحبة الأزلية والمناسبة الفطرية بينهم { أعِزةً } أشدّاء غلاظ { على } المحجوبين لأضداد ما ذكر { يجاهدون في سبيل الله } بمحو صفاتهم وإفناء ذواتهم التي هي حجب مشاهداتهم { ولا يخافون لومة لائم } من نسبتهم إلى الإباحة والزندقة والكفر\n وعذلهم بترك الدنيا ولذاتها\n بل بترك الآخرة ونعيمها كما قال أمير المؤمنين عليه السلام: \" اعبدوا الله لا لرغبة ولا لرهبة \" \n فهم من الفتيان الذين قيل فيهم:",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وينصرفون عن حكمك { فَحُكْمَ ٱلْجَاهِلِيَّةِ } الناشئة من الآراء الفاسدة\n الزائفة\n الحاصلة عن تمويهات عقولهم\n القاصرة\n كأحكام متفقهة هذا العصر { يَبْغُونَ } يطلبون منك\n ويعتقدون أن الحسن والحق ما هم عليه من تلقاء أنفسهم { وَمَنْ أَحْسَنُ مِنَ ٱللَّهِ } المتفرد بذاته { حُكْماً لِّقَوْمٍ يُوقِنُونَ } [المائدة: 50] بتوحيده وتفريده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n واللام في قوله: { لقوم }: للبيان: أي: هذا الاستفهام لقوم يوقنون\n فإنهم هم الذين يعلمون ألاَّ أحسن حكمًا من الله\n يقول الحقّ جلّ جلاله: لرسوله ـ عليه الصلاة والسلام ـ: { و } أمرناك { أن اُحكم بينهم } أي: بين اليهود { بما أنزل الله } \n قيل هو ناسخ للتخيير المتقدم\n وقيل: لا\n والمعنى أنت مخير\n فإن أردت أن تحكم بينهم فاحكم بما أنزل الله { ولا تتبع أهواءهم } الباطلة\n التي أرادوا أن يفتنوك بها\n { واحذرهم أن يفتنوك عن بعض ما أنزل الله إليك } \n فيصرفوك عن الحكم به\n رُوِي أن أحبار اليهود قالوا: اذهبوا بنا إلى محمد لعلنا نفتنه عن دينه\n فقالوا: يا محمد\n قد عرفت أنَّا أحبار اليهود\n وأنّا إن اتبعناك اتبعتك اليهود كلهم\n وإن بيننا وبين قومنا خصومة\n فنتحاكم إليك\n فتقضي لنا عليهم\n ونحن نؤمن بك ونصدقك\n فأبى ذلك عليهم رسول الله صلى الله عليه وسلم\n وردَّهم\n فنزلت الآية\n قال تعالى لنبيّه ـ عليه الصلاة والسلام ـ: { فإن تولوا } عن الإيمان\n بل وأعرضوا عن اتباعك\n { فاعلم أنما يريد الله أن يصيبهم ببعض ذنوبهم } في الدنيا\n ويدخر جُلَّها للآخرة\n وقد أنجز الله وعده\n فأجلى بني النضير\n وقتل بني قريظة\n وسبا نساءهم وذراريهم\n وباعهم في الأسواق\n وفتح خيبر\n وضرب عليه الجزية\n { وإنَّ كثيرًا من الناس لفاسقون } خارجون عن طاعة الله ورسوله\n { أفحكم الجاهلية يبغون } أي: يطلبون منك حكم الملة الجاهلية التي هي متابعة الهوى\n { ومن أحسن من الله حكمًا لقوم يوقنون } أي: لا أحد أحسن حكمًا من الله تعالى عند أهل الإيقان لأنهم هم الذين يتدبرون الأمر\n ويتحققون الأشياء بأنظارهم\n فيعلمون ألاَّ أحسن حكمًا من الله عز وجل\n الإشارة: إذا كثرت عليك الخصوم الوهمية أو الواردات القلبية\n والتبس عليك أمرهم\n ولم تدر أيهما تتبع؟ فاحكم بينهم بالكتاب والسنة\n فمن وافق كتاب الله وسنة رسول الله صلى الله عليه وسلم فاتبعه\n فإن من أمَّر الكتاب والسُّنة على نفسه نطق بالحكمة\n وإن وافق أكثرُ من واحد الكتاب أو السنة\n فانظر أثقلهم على النفس\n فإنه لا يثقل عليها إلا ما هو حق\n ولا تتبع أهواء النفوس والخواطر\n واحذرهم أن يفتنوك عن بعض ما أنزل على قلبك من العلوم والأسرار\n فإن متابعة الهوى يُعمي القلب عن مطالعة الأسرار\n إلا إن وافق السُّنة\n قيل لعمرَ بن عبد العزيز: ما ألذُ الأشياءِ عندك؟ قال: حق وافق هواي\n وفي الحديث عنه صلى الله عليه وسلم\n \" لاَ يُؤمِنُ أُحَدُكُم حَتَّى يكُون هواه تابعًا لما جئتُ به \" \n\n وفي الحِكَم: \" يُخاف عليك أن تلتبس الطرقُ عليك\n إنما يُخاف عليك من غَلِبَةِ الهوى عليك \"\n فمن تولى عن هذا المنهاج الواضح\n وجعل يتبع الهوى ويسلك طريق الرخص\n فليعلم أن الله أراد أن يعاقبه ببعض سوء أدبه\n حتى يخرج عن منهاج السالكين\n والعياذ بالله\n أو يؤدبه في الدنيا إن كان متوجهًا إليه\n ثم حذَّر من صحبة أهل الأهواء\n فقال: { يَـٰأَيُّهَا ٱلَّذِينَ آمَنُواْ لاَ تَتَّخِذُواْ ٱلْيَهُودَ وَٱلنَّصَارَىٰ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:64",
      "similarity": 0.5282778198003085
    },
    {
      "verse": "69:51",
      "similarity": 0.49959686501469586
    },
    {
      "verse": "51:20",
      "similarity": 0.4980069671041181
    },
    {
      "verse": "4:17",
      "similarity": 0.4924340640189408
    },
    {
      "verse": "56:95",
      "similarity": 0.48655454629294403
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005050.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005050.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:50.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}