{
  "chapter": "المائدة",
  "text": "افحكم الجهلية يبغون ومن احسن من الله حكما لقوم يوقنون",
  "translations": [
    {
      "translation": "Do they seek a judgement of the days of pagan ignorance? But who could be a better judge than God for those who are firm in their faith?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(If they turn away from the Law of Allah) do they desire judgement according to the Law of Ignorance? But for those who have certainty of belief whose judgement can be better than Allah's?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they want judgments that are issued out of ignorance? Who is a better judge for the people whose belief is based on certainty, than God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So do they wish a judgement of ignorance? And whose judgement is better than that of Allah, for the people who are certain?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they then seek the judgement of (the days of) ignorance And who is better in judgement than Allah for a people who have firm faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it then the judgment of (the times of) ignorance that they desire? And who is better than Allah to judge for a people who are sure?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it the judgment of pagandom then that they are seeking? Yet who is fairer in judgment than God, for a people having sure faith?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it a judgment of the time of (pagan) ignorance that they are seeking? Who is better than Allah for judgment to a people who have certainty (in their belief)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it pagan laws that they wish to be judged by? Who is a better judge than God for men whose faith is firm?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Seek they then the judgement of Paganism? And who is better than Allah in judgement unto a people who are convinced?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they seek the judgement of [pagan] ignorance? But who is better than Allah in judgement for a people who have certainty?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they then seek after a judgment of (the days of) ignorance? But who, for a people whose faith is assured, can give better judgment than Allah?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they then seek the judgement of (the Days of) Ignorance? And who is better in judgement than Allah for a people who have firm Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it pagan laws that they wish to be judged by? Who is a better judge than Allah for a nation whose belief is firm?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it the laws of the time of ignorance that they desire? Who is better than God in judgment for people who are certain?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then is it the judgement of [the time of] ignorance they desire? But who is better than Allah in judgement for a people who are certain [in faith].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:50] Do they desire (yabghūn, is also read tabghūn, ‘[do] you desire?’), [do] they seek, the judgement of paganism, through their deceit and deviation when they turn away? (this is an interrogative meant as a disavowal). Yet who, that is, no one, is better in judgement than God for a people knowing, Him, with certainty? These [people] are singled out for mention because they are the ones who reflect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is it a judgement of the time of (pagan) ignorance that they are seeking?) to find in the Qur'an, Muhammad. (Who is better than Allah for judgement to a people who have certainty?) in Muhammad and the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَ } يعرضون، وينصرفون عن حكمك { فَحُكْمَ ٱلْجَاهِلِيَّةِ } الناشئة من الآراء الفاسدة، الزائفة، الحاصلة عن تمويهات عقولهم، القاصرة، كأحكام متفقهة هذا العصر { يَبْغُونَ } يطلبون منك، ويعتقدون أن الحسن والحق ما هم عليه من تلقاء أنفسهم { وَمَنْ أَحْسَنُ مِنَ ٱللَّهِ } المتفرد بذاته { حُكْماً لِّقَوْمٍ يُوقِنُونَ } [المائدة: 50] بتوحيده وتفريده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}