{
  "chapter": "المائدة",
  "text": "يايها الذين ءامنوا۟ لا تتخذوا۟ اليهود والنصرى اولياء بعضهم اولياء بعض ومن يتولهم منكم فانه منهم ان الله لا يهدى القوم الظلمين",
  "translations": [
    {
      "translation": "You who have iman! do not take the Jews and Christians as your friends; they are the friends of one another. Any of you who takes them as friends is one of them. Allah does not guide wrongdoing people.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, do not hold Jews and Christians as your allies. They are allies of one another; and anyone who makes them his friends is surely one of them; and God does not guide the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Do not take the Jews and the Christians for your allies. They are the allies of each other. And among you he who takes them for allies, shall be regarded as one of them. Allah does not guide the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not consider the Jews and Christians as your intimate friends for they are only friends with each other. Whoever does so will be considered as one of them. God does not guide the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not make the Jews and the Christians your friends; they are friends of one another; and whoever among you befriends them, is one of them; indeed Allah does not guide the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not take friends from the Jews and the Christians, as they are but friends of each other. And if any among you befriends them, then surely, he is one of them. Verily, Allah guides not those people who are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! do not take the Jews and the Christians for friends; they are friends of each other; and whoever amongst you takes them for a friend, then surely he is one of them; surely Allah does not guide the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, take not Jews and Christians as friends; they are friends of each other. Whoso of you makes them his friends is one of them. God guides not the people of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Take not the Jews and the Christians for friends. They are friends one to another. He among you who taketh them for friends is (one) of them. Lo! Allah guideth not wrongdoing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not take the Jews and Christians as allies. They are allies with one another. Whoever of you takes them as an ally shall become one of them. God does not guide the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! take not the Jews and the Nazarenes as friends: friends they are to each other: and whosoever of you befriendeth them, verily he is of them; verily Allah guideth not a wrong-doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not take the Jews and the Christians for allies: they are allies of each other. Any of you who allies with them is indeed one of them. Indeed Allah does not guide the wrongdoing lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! take not the Jews and the Christians for your friends and protectors: They are but friends and protectors to each other. And he amongst you that turns to them (for friendship) is of them. Verily Allah guideth not a people unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Take not the Jews and the Christians as Auliya' (friends, protectors, helpers, etc.), they are but Auliya' to one another. And if any amongst you takes them as Auliya', then surely he is one of them. Verily, Allah guides not those people who are the Zalimun (polytheists and wrong-doers and unjust).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, take neither Jews nor Nazarenes for your guides. They are guides of one another. Whosoever of you takes them for a guide shall become one of their number. Allah does not guide the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not take the Jews and the Christians as allies; some of them are allies of one another. Whoever of you allies himself with them is one of them. God does not guide the wrongdoing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not take the Jews and the Christians as allies. They are [in fact] allies of one another. And whoever is an ally to them among you - then indeed, he is [one] of them. Indeed, Allah guides not the wrongdoing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:51] O you who believe, do not take Jews and Christians as patrons, affiliating with them or showing them affection; they are patrons of each other, being united in disbelief. Whoever amongst you affiliates with them, he is one of them, counted with them. God does not guide the folk who do wrong, by affiliating with disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتهيّأت نفوس المؤمنين لقبول النّهي عن موالاة أهل الكتاب بعد ما سمعوا من اضطراب اليهود في دينهم ومحاولتهم تضليل المسلمين وتقليبَ الأمور للرسول صلى الله عليه وسلم فأقبل عليهم بالخطاب بقوله : { يأيّها الّذين آمنوا لا تتّخذوا اليهود والنّصارى } الآية ، لأنّ الولاية تنبنِي على الوفاق والوئام والصّلة وليس أولئك بأهل لولاية المسلمين لبُعد ما بين الأخلاق الدّينيّة ، ولإضمارهم الكَيد للمسلمين . وجرّد النّهي هنا عن التّعليل والتّوجيه اكتفاء بما تقدّم .والجملة مستأنفة استئنافاً ابتدائياً . وسبب النّهي هو ما وقع من اليهود ، ولكن لمّا أريد النّهي لم يُقتصر عليهم لكيلا يحسب المسلمون أنّهم مأذونون في موالاة النّصارى ، فلدفع ذلك عطف النّصارى على اليهود هنا ، لأنّ السبب الدّاعي لعدم الموالاة واحد في الفريقين ، وهو اختلاف الدّين والنفرةُ الناشئة عن تكذيبهم رسالة محمّد صلى الله عليه وسلم فالنّصارى وإن لم تجىء منهم يومئذٍ أذاة مثل اليهود فيوشك أن تجيء منهم إذا وُجد داعيها .وفي هذا ما ينبّه على وجه الجمع بين النّهي هنا عن موالاة النّصارى وبين قوله فيما سيأتي { وليتجِدنّ أقربهم مودّة للّذين آمنوا الّذين قالوا إنّا نصارى } \\[ المائدة : 82 \\] . ولا شكّ أنّ الآية نزلت بعد غزوة تبوك أو قُربَهَا ، وقد أصبح المسلمون مجاورين تخوم بلاد نصارى العرب . وعن السُدّي أنّ بعض المسلمين بعْد يوم أحُد عزم أن يوالي يهودياً ، وأنّ آخر عزم أن يوالي تصرانياً كما سيأتي ، فيكون ذكر النّصارى غير إدماج .وعقّبه بقوله : { بعضهم أولياء بعض } أي أنّهم أجدر بولاية بعضهم بعضاً ، أي بولاية كلّ فريق منهم بعض أهللِ فريقِه ، لأنّ كلّ فريق منهم تتقارب أفراده في الأخلاق والأعمال فيسهل الوفاق بينهم ، وليس المعنى أنّ اليهودَ أولياء النّصارى . وتنوين { بعضٍ } تنوين عوض ، أي أولياء بعضهم . وهذا كناية عن نفي موالاتهم المؤمنين وعن نهي المؤمنين عن موالاة فريق منهما .والولاية هنا ولاية المودّة والنصرة ولا علاقة لها بالميراث ، ولذلك لم يقل مالك بتوريث اليهودي من النّصراني والعكس أخذاً بقول النّبيء صلى الله عليه وسلم { لا يتوارث أهل ملّتين } . وقال الشّافعي وأبو حنيفة بتوريث بعض أهل الملل من بعض ورأيا الكفر ملّة واحدة أخذاً بظاهر هذه الآية ، وهو مذهب داوود .وقوله : { ومن يتَولّهم منكم فإنّه منهم } ، ( مَن ) شرطيّة تقتضي أنّ كلّ من يتولاّهم يصير واحداً منهم . جعل ولايتهم موجّبة كونَ المتولّي منهم ، وهذا بظاهره يقتضي أنّ ولايتهم دخولٌ في ملّتهم ، لأنّ معنى البعضية هنا لا يستقيم إلاّ بالكون في دينهم . ولمّا كان المؤمن إذا اعتقد عقيدة الإيمان واتّبع الرسول ولم ينافق كان مسلماً لا محالة كانت الآية بحاجة إلى التأويل ، وقد تأوّلها المفسّرون بأحد تأويلين : إمّا بحمل الولاية في قوله : { ومن يتولّهُم } على الولاية الكاملة الّتي هي الرّضى بدينهم والطعنُ في دين الإسلام ، ولذلك قال ابن عطيّة : ومن تولاّهم بمعتقده ودينه فهو منهم في الكفر والخلود في النّار .وأمّا بتأويل قوله : { فإنّه منهم } على التشبيه البليغ ، أي فهو كواحد منهم في استحقاق العذاب . قال ابن عطيّة : من تولاّهم بأفعاله من العَضْد ونحوه دون معتقدهم ولا إخلال بالإيمان فهو منهم في المقت والمذمّة الواقعة عليهم اه . وهذا الإجمال في قوله : { فإنّه منهم } مبالغة في التّحذير من موالاتهم في وقت نزول الآية ، فالله لم يرض من المسلمين يومئذٍ بأن يتولّوا اليهود والنّصارى ، لأنّ ذلك يلبسهم بالمنافقين ، وقد كان أمر المسلمين يومئذٍ ي حيرة إذ كان حولهم المنافقُون وضعفاء المسلمين واليهود والمشركون فكان من المتعيّن لحفظ الجامعة التّجرّد عن كلّ ما تتطرّق مِنه الرّبية إليهم .وقد اتّفق عُلماء السنّة على أنّ ما دون الرّضا بالكفر وممالاتهم عليه من الولاية لا يُوجب الخروج من الربقة الإسلاميّة ولكنّه ضلال عظيم ، وهو مراتب في القُوّة بحسب قوّة الموالاة وباختلاف أحوال المسلمين .وأعظم هذه المراتب القضية الّتي حدثت في بعض المسلمين من أهل غرناطة الّتي سئل عنها فقهاء غرناطة : محمد الموّاق ، ومحمد بن الأزرق ، وعليّ بن داوود ، ومحمد الجعدالة ، ومحمد الفخار ، وعليّ القلصادي ، وأبو حامد بن الحسن ، ومحمد بن سرحونة ، ومحمد المشذّالي ، وعبد الله الزليجي ، ومحمد الحذام ، وأحمد بن عبد الجليل ، ومحمد بن فتح ، ومحمد بن عبد البرّ ، وأحمد البقني ، عن عصابة من قُواد الأندلس ، وفرسانهم لَجَأُوا إلى صاحب قشتالة ( بلاد النصارى ) بعد كائنة ( اللَّسانة ) كذا واستنصروا به على المسلمين واعتصموا بحبْل جواره وسكنوا أرض النّصارى فهل يحلّ لأحد من المسلمين مساعدتهم ولأهل مدينة أو حصن أن يأوُوهم . فأجابوا بأنّ رُكونهم إلى الكفار واستنصارهم بهم قد دخلوا به في وعيد قوله تعالى : { ومن يتولّهم منكم فإنّه منهم } فمن أعانهم فهو معين على معصية الله ورسوله ، هذا ما داموا مصرّين على فعلهم فإن تابوا ورجعوا عمّا هم عليه من الشقاق والخلاف فالواجب على المسلمين قبولهم .فاستِدلالهم في جوابهم بهذه الآية يدلّ على أنّهم تأوّلوها على معنى أنّه منهم في استحقاق المقت والمذمة ، وهذا الّذي فعلوه ، وأجاب عنه الفقهاء هو أعظمُ أنواع الموالاة بعد موالاة الكفر . وأدنى درجات الموالاة المخالطة والملابسة في التّجارة ونحوها . ودون ذلك ما ليس بموالاة أصلاً ، وهو المعاملة . وقد عامَل النّبيء صلى الله عليه وسلم يهود خيبر مساقاة على نخل خيبر ، وقد بيّنّا شيئاً من تفصيل هذا عند قوله تعالى : { لا يَتّخذ المؤمنون الكافرين أولياء من دون المؤمنين } في سورة آل عمران ( 28 ) .وجملة إنّ الله لا يهدي القوم الظّالمين } تذييل للنّهي ، وعموم القوم الظّالمين شمل اليهود والنّصارى ، وموقع الجملة التذييلية يقتضي أنّ اليهودَ والنّصارى من القوم الظّالمين بطريق الكناية .والمراد بالظّالمين الكافرون .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe!) in Muhammad and the Qur'an. (Take not the Jews and Christians for friends) seeking their assistance and help. (They are friends one to another) He says: some are followers of the religion of others in secret and in the open, just as they are friends of each other. (He among you) group of believers (who taketh them for friends) seeking their assistance and help (is (one) of them) in alliance and is not included in Allah's protection and safety. (Lo! Allah guideth not) to His religion and proof (wrong-doing folk) the Jews and Christians.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَـٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم أن { لاَ تَتَّخِذُواْ ٱلْيَهُودَ وَٱلنَّصَارَىٰ أَوْلِيَآءَ } توالونهم\n وتصاحبونهم\n مثل موالاة المؤمنين\n ولا تعتمدوا\n ولا تثقوا بودادتهم ومودتهم إذ هم { بَعْضُهُمْ أَوْلِيَآءُ بَعْضٍ } متظاهرون متعاونون\n ينتهزون الفرضة لمقتدكم { وَمَن يَتَوَلَّهُمْ } ويعتمد عليهم { مِّنكُمْ فَإِنَّهُ مِنْهُمْ } من جملتهم\n وعدادهم عند الله { إِنَّ ٱللَّهَ } المطلع لضمائر عباده { لاَ يَهْدِي ٱلْقَوْمَ ٱلظَّالِمِينَ } [المائدة: 51] المجاوزين عن مقتضى أوامر الله\n المرتكبين لمناهيه\n فكيف لا يكون المتولون معهم من زمرتهم؟!\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { يقول الذين آمنوا } قرىء بغير واو استئنافًا\n وكأنه جواب عن سؤال\n أي: ماذا يقول المؤمنون حينئٍذ؟ فقال: يقول\n\n\n الخ\n وقرىء بالواو والرفع عطف جملة على جملة\n وقرىء بالواو والنصب عطف على { فيصبحوا } أو { يأتي }\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا لا تتخذوا اليهود والنصارى أولياء } تنتصرون بهم\n أو تعاشرونهم معاشرة الأحباب\n أو تتوددون إليهم\n وأما معاملتهم من غير مودة فلا بأس\n ثم علل النهي عن موالاتهم فقال: هم { بعضهم أولياء بعض } أي: لأنهم متفقون على خلافكم\n يوالي بعضهم بعضًا لا تحادهم في الدين\n وإجماعهم على مضادتكم\n { ومن يتولهم منكم فإنه منهم } أي: من والاهم منكم فإنه من جملتهم\n قال البيضاوي: وهذا تشديد في وجوب مجانبتهم\n كما قال صلى الله عليه وسلم\n \" المؤمنُ والمشركُ لا تَتَراءى نَارهَمَا \" \nأو لأن الموالين لهم كانوا منافقين\n هـ\n وقال ابن عطية: من تولهم بمعتقده ودينه فهو منهم في الكفر واستحقاق النقمة والخلود في النار\n ومن تولاهم بأفعاله من العَضد ونحوه\n دون معتقد ولا إخلال بإيمان\n فهو منهم في المقت والمذمة الواقعة عليهم وعليه\n هـ\n وسُئل ابن سيرين عن رجل أراد بيع داره للنصارى يتخذونها كنيسة\n فتلا هذه الآية: { ومن يتولهم منكم فإنه منهم }\n هـ\n وفي أبي الحسن الصغير: أن بيع غير السلاح للعدو الكافر فسق\n وبيع السلاح له كفر\n قلت: ولعله إذا قصد تقويتهم على حرب المسلمين\n وأما الفداء بالسلاح إذا لم يقبلوا غيره\n فيجوز في القليل دون الكثير\n وأجازه سحنون مطلقاً\n إذا لم يرج فداؤه بالمال\n انظر الحاشية\n { إن الله لا يهدي القوم الظالمين } أي: ظلموا أنفسهم بموالاة الكفار\n { فترى الذين في قلوبهم مرض } وهم المنافقون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:124",
      "similarity": 0.497013565136113
    },
    {
      "verse": "11:53",
      "similarity": 0.4918748415423754
    },
    {
      "verse": "7:65",
      "similarity": 0.4733551397178927
    },
    {
      "verse": "2:113",
      "similarity": 0.46724683751441176
    },
    {
      "verse": "11:50",
      "similarity": 0.43249951012205606
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005051.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005051.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:51.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}