{
  "chapter": "المائدة",
  "text": "فترى الذين فى قلوبهم مرض يسرعون فيهم يقولون نخشى ان تصيبنا دائرة فعسى الله ان ياتى بالفتح او امر من عنده فيصبحوا۟ على ما اسروا۟ فى انفسهم ندمين",
  "translations": [
    {
      "translation": "Yet you see those with sickness in their hearts rushing to them, saying, 'We fear the wheel of fate may turn against us.' But it may well be that Allah will bring about victory or some other contingency from Him. Then they will deeply regret their secret thoughts.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will notice that those whose hearts are afflicted with sickness (of doubt) only hasten to join them and say: \"We fear lest misfortune should surround us.\" It may well be that God may soon send (you) success, or other command of His. Then will they be repentant of what they had concealed in their hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed you see those afflicted with the disease of hypocrisy race towards them, saying: 'We fear lest some misfortune overtakes us. And it may happen that Allah will either bring you a decisive victory or bring about something else from Himself? and then they will feel remorseful at their hypocrisy which they have kept concealed in their breasts -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), you have seen those whose hearts are sick, running around among the people (Jews) saying, \"We are afraid of being struck by disaster.\" But if God were to grant you victory or some other favors, they would then regret for what they had been hiding in their souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will now see those in whose hearts is a disease, that they rush towards the Jews and the Christians, saying, “We fear that a misfortune will possibly befall us”; so it is likely that Allah may soon bring victory, or a command from Himself, so they will remain regretting what they had hidden in their hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you see those in whose hearts there is a disease, they hurry to their friendship, saying: \"We fear lest some misfortune of a disaster may befall us. \" Perhaps Allah may bring a victory or a decision according to His will. Then they will become regretful for what they have been keeping as a secret in themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But you will see those in whose hearts is a disease hastening towards them, saying: We fear lest a calamity should befall us; but it may be that Allah will bring the victory or a punishment from Himself, so that they shall be regretting on account of what they hid in their souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet thou seest those in whose hearts is sickness vying with one another to come to them, saying, 'We fear lest a turn of fortune should smite us.' But it may be that God will bring the victory, or some commandment from Him, and then they will find themselves, for that they kept secret within them, remorseful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou seest those in whose heart is a disease race toward them, saying: We fear lest a change of fortune befall us. And it may happen that Allah will vouchsafe (unto thee) the victory, or a commandment from His presence. Then will they repent them of their secret thoughts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will see those whose minds are diseased hastening towards them, saying, \"We fear lest a misfortune befall us.\" But God may well bring about victory or make a decision which is favourable to you. Then they will repent of the thoughts, which they secretly harboured in their hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore thou seest those in whose hearts is a disease hasten toward them saying: we fear lest there may befall us a reverse. But belike Allah may bring a victory or some affair from Himself; then they shall find themselves, for which they hide in their souls, remorseful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet you see those in whose hearts is a sickness rushing to them, saying, ‘We fear lest a turn of fortune should visit us.’ Maybe Allah will bring about a victory, or a command from Him, and then they will be regretful for what they kept secret in their hearts,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those in whose hearts is a disease - thou seest how eagerly they run about amongst them, saying: \"We do fear lest a change of fortune bring us disaster.\" Ah! perhaps Allah will give (thee) victory, or a decision according to His will. Then will they repent of the thoughts which they secretly harboured in their hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you see those in whose hearts there is a disease (of hypocrisy), they hurry to their friendship, saying: \"We fear lest some misfortune of a disaster may befall us.\" Perhaps Allah may bring a victory or a decision according to His Will. Then they will become regretful for what they have been keeping as a secret in themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You see those in whose hearts is sickness racing with one another to come to them. They say: 'We fear lest a change of fortune should befall us' May Allah bring victory or make known His ordinance, then, they shall regret what they had hidden in themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will see those in whose hearts is sickness racing towards them. They say, “We fear the wheel of fate may turn against us.” But perhaps God will bring about victory, or some event of His making; thereupon they will regret what they concealed within themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So you see those in whose hearts is disease hastening into [association with] them, saying, \"We are afraid a misfortune may strike us.\" But perhaps Allah will bring conquest or a decision from Him, and they will become, over what they have been concealing within themselves, regretful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:52] And you see those in whose hearts is sickness, weakness of faith, the like of ‘Abd Allāh b. Ubayy the hypocrite; vying with one another for them, to affiliate with them, saying, as an excuse for this: ‘We fear lest we suffer a turn of fortune’, which time will bring round against us, such as drought or defeat, and that if Muhammad’s affair should come to nothing, they will cease to supply us with provisions. God, exalted be He, says: But it may be that God will bring victory, by assisting His Prophet and making His religion prevail; or some commandment from Him, that will reveal the secrets of the hypocrites, disgracing them; and then they will end up, for what they kept secret within themselves, in the way of doubt and affiliating with disbelievers, remorseful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله : { فترى الّذين في قلوبهم مرض يسارعون فيهم } تفريع لحالة من موالاتهم أريد وصفها للنّبيء صلى الله عليه وسلم لأنّها وقعت في حضرته . والمرض هنا أطلق على النفاق كما تقدّم في قوله تعالى : { في قلوبهم مرض } في سورة البقرة ( 10 ) . أطلق عليه مرض لأنّه كفر مفسد للإيمان . والمسارعة تقدّم شرحها في قوله تعالى : { لا يحْزنك الّذين يسارعون في الكفر } \\[ المائدة : 41 \\] . وفي المجرور مضاف محذوف دلّت عليه القرينة ، لأنّ المسارعة لا تكون في الذوات ، فالمعنى : يسارعون في شأنهم من موالاتهم أو في نصرتهم .والقولُ الواقع في { يقولون نَخشى } قولُ لسان لأنّ عبد الله بن أبيّ بنَ سلول قال ذلك ، حسبما رُوي عن عطيّة الحوفي والزهري وعاصم بن عمر بن قتادة أنّ الآية نزلت بعد وقعة بدر أوبعد وقعة أحُد وأنّها نزلت حين عزم رسول الله على قتال بني قينقاع . وكان بنو قينقاع أحلافاً لعبد الله بن أبي بن سلول ولعُبادة بن الصامت ، فلمّا رأى عبادة منزع رسول الله صلى الله عليه وسلم جاء فقال : يا رسول الله إنّي أبرأ إلى الله من حِلف يهود وولائهم ولا أوالي إلاّ الله ورسولَه ، وكان عبد الله بن أبيّ حاضراً فقال : أمَّا أنا فلا أبرأ من حلفهم فإنّي لا بدّ لي منهم إنّي رجل أخاف الدّوائر .ويحتمل أن يكون قولهم : { نخشى أن تصيبنا دائرة } ، قولاً نفسياً ، أي يقولون في أنفسهم . فالدّائرة المخشيّة هي خشية انتقاض المسلمين على المنافقين ، فيكون هذا القول من المرض الّذي في قلوبهم ، وعن السديّ : أنّه لمّا وقع انهزام يوم أحُد فزع المسلمون وقال بعضهم : نأخذ من اليهود حلفاً ليُعاضدونا إن ألمّت بنا قاصمة من قريش . وقال رجل : إنّي ذاهب إلى اليهود فلان فآوي إليه وأتهوّدُ معه . وقال آخر : إنّي ذاهب إلى فلان النّصراني بالشّام فآوي إليه وأتنصّر معه ، فنزلت الآية . فيكون المرض هنا ضعف الإيمان وقلّة الثّقة بنصر الله ، وعلى هذا فهذه الآية تقدّم نزولها قبل نزول هذه السورة ، فإمّا أعيد نزولها ، وإمّا أمر بوضعها في هذا الموضع .والظاهر أنّ قوله { فعسى الله أن يأتي بالفتح أو أمر من عنده فيصبحوا على ما أسرّوا في أنفسهم نادمين } يؤيّد الرواية الأولى ، ويؤيّد مَحملنا فيها : أنّ القول قول نفسيّ .والدائرة اسم فاعل من دار إذا عَكس سيره ، فالدائرة تغيّر الحال ، وغلب إطلاقها على تغيّر الحال من خير إلى شرّ ، ودوائر الدّهر : نُوبه ودولُه ، قال تعالى : { ويتربّص بكم الدوائر } \\[ التوبة : 98 \\] أي تبدّل حالكم من نصر إلى هزيمة . وقد قالوا في قوله تعالى : { عليهم دائرة السَّوْء } \\[ الفتح : 6 \\] إنّ إضافة ( دائرة ) إلى ( السَّوْء ) إضافة بيان . قال أبو عليّ الفارسي : لو لم تُضف الدائرة إلى السَّوْء عرف منها معناه . وأصل تأنيثها للمرّة ثمّ غلبت على التغيّر مُلازمة لصبغة التّأنيث .\n\n",
      "translations": [
        {
          "translation": "(And thou) Muhammad (seest those in whose heart is a disease) doubt and hypocrisy, i.e. 'Abdullah Ibn 119 Ubayy and his followers (race towards them) race to take them as friends, (saying) to one another: (We fear lest a change of fortune befall us) we fear hardship may befall us, this is why we take them as friends. (And it may) \"may ['asa]\" when used in connection with Allah denotes a requisite (happen that Allah will vouchsafe (unto you) the victory) the Conquest of Mecca and victory to Muhammad (pbuh) and his Companions (or a commandment from His presence) or a punishment inflicted on the Banu Qurayzah and Banu'l-Nadir, by means of killing and expelling them. (Then will they) i.e. the hypocrites (repent) after being exposed (of their secret thoughts) of their alliance with Jews.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَتَرَى } أيها الرائي { ٱلَّذِينَ فِي قُلُوبِهِم مَّرَضٌ } كفر ونفاق { يُسَارِعُونَ } ويبادرون { فِيهِمْ } في مودتهم ومؤاخاتهم { يَقُولُونَ } معتذرين لكم\n نفاقاً: { نَخْشَىٰ أَن تُصِيبَنَا دَآئِرَةٌ } من دوائر الزمان\n كان الأمر فيها لهم\n والدولة تتوجه نحوههم\n فنداريهم ونواليهم\n خوفاً منها { فَعَسَى ٱللَّهُ أَن يَأْتِيَ بِٱلْفَتْحِ } والظفر لرسوله\n ليظهر دينه على الأديان كلها { أَوْ أَمْرٍ } عظيم\n نازل { مِّنْ عِندِهِ } يكفي مؤنة كفرهم ونفاقهم { فَيُصْبِحُواْ عَلَىٰ مَآ أَسَرُّواْ فِيۤ أَنْفُسِهِمْ } من بغض رسول الله\n والإنكار لرسالته\n وتكذيب كتابه { نَادِمِينَ } [المائدة: 52] خائبين\n خاسرين\n\n\n{ وَ } حينئذ { يَقُولُ ٱلَّذِينَ آمَنُواْ } وأخلصوا في إيمانهم بعضهم لبعض",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يسارعون فيهم } أي: في موالاتهم ومناصرتهم\n { يقولون نخشى أن تصيبنا دائرة } أي: يعتذرون بأنهم يخافون أن تصيبهم دائرة من الدوائر\n بأن ينقلب الأمر وتكون الدولة للكفار\n رُوِي أن عبادة بن الصامت قال لرسول الله صلى الله عليه وسلم: إن لي موالي من اليهود\n كثير عددهم\n وإني أبرأُ إلى الله ورسوله من ولايتهم\n فقال ابن أبي: إني امرؤ أخاف الدوائر\n لا أبرأ من ولاية موالي\n فنزلت الآية\n قال تعالى ردًا عليه: { فعسى الله أن يأتي بالفتح } لرسول الله صلى الله عليه وسلم على أعدائه وإظهار المسلمين ونصرهم\n { أو أمر من عنده } \n يقطع شأفة اليهود\n من القتل والإجلاء\n { فيُصبحوا } أي: هؤلاء المنافقون\n { على ما أسروا في أنفسهم } من الكفر والنفاق\n ومن مظاهرة اليهود { نادمين }\n { ويقول الذين آمنوا } حينئٍذ ـ أي: حين فتح الله على رسوله وفضح سريرة المنافقين ـ: { أهؤلاء الذين أقسموا بالله جهد أيمانهم إنهم لمعكم } \n يقولهُ المؤمنون بعضهم لبعض\n تعجبًا من حال المنافقين وتبجحًا بما منَّ الله عليهم من الإخلاص\n أو يقولونه لليهود لأن المنافقين حلفوا لهم بالمناصرة\n كما حكى تعالى عنهم\n\n[الحَشر:11] قاله البيضاوي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:40",
      "similarity": 0.5314334808671153
    },
    {
      "verse": "49:6",
      "similarity": 0.5215048387418172
    },
    {
      "verse": "26:157",
      "similarity": 0.4547130428241604
    },
    {
      "verse": "10:54",
      "similarity": 0.4502993225247616
    },
    {
      "verse": "34:33",
      "similarity": 0.3192852423449009
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005052.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005052.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:52.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}