{
  "chapter": "المائدة",
  "text": "ويقول الذين ءامنوا۟ اهؤلاء الذين اقسموا۟ بالله جهد ايمنهم انهم لمعكم حبطت اعملهم فاصبحوا۟ خسرين",
  "translations": [
    {
      "translation": "Those who have iman say, 'Are these the people who swore by Allah, with their most earnest oaths, that they were with you?' Their actions have come to nothing and they now are losers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the believers will say: \"Are these the people who had sworn by God on solemn oath and said: \"We are surely with you?\" Wasted have been all their deeds, and losers they remain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "while those who believe will exclaim: 'Are these the self-same people who solemnly swore by Allah that they were with you?' All their acts have gone to waste and now they are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers say, \"Are these the people who proclaimed themselves to be our sworn friends?\" Their deeds have become devoid of all virtue and they themselves have become lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the believers say, “Are these the ones who swore by Allah most vehemently in their oaths, that they are with you?” All their deeds are destroyed, so they are ruined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe will say: \"Are these the men who swore their strongest oaths by Allah that they were with you\" All that they did has been in vain, and they have become the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe will say: Are these they who swore by Allah with the most forcible of their oaths that they were most surely with you? Their deeds shall go for nothing, so they shall become losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the believers will say, 'What, are these the ones who swore by God most earnest oaths that they were with you? Their works have failed now they are losers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then will the believers say (unto the people of the Scripture): are these they who swore by Allah their most binding oaths that they were surely with you? Their works have failed, and they have become the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the believers will say, \"Are these the men who swore their strongest oaths by God, that they were with you?\" Their works will come to nothing and they will lose all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe will say: are those they who swear by Allah say their solemn oaths that they were verily with you? Their works came to naught, and they found themselves losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the faithful will say, ‘Are these the ones who swore by Allah with solemn oaths that they were with you?!’ Their works have failed, and they have become losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe will say: \"Are these the men who swore their strongest oaths by Allah, that they were with you?\" All that they do will be in vain, and they will fall into (nothing but) ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe will say: \"Are these the men (hypocrites) who swore their strongest oaths by Allah that they were with you (Muslims)?\" All that they did has been in vain (because of their hypocrisy), and they have become the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the believers will say: 'Are those (the ones) who solemnly swore by Allah that they would stand by you' Their works will be annulled and they shall be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe will say, “Are these the ones who swore by God with their strongest oaths that they are with you?” Their works have failed, so they became losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe will say, \"Are these the ones who swore by Allah their strongest oaths that indeed they were with you?\" Their deeds have become worthless, and they have become losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:53] And they say (read wa-yaqūlu, or just yaqūlu, to indicate a new [independent] sentence; or wa-yaqūla as a supplement to what follows), those who believe, to one another in amazement, when their secrets are revealed: ‘Are these the ones who swore by God their most earnest oaths, making the utmost effort thereby [to swear], that they were surely with you?, in religion. God, exalted be He, says: Their, good, works have failed, are invalid; and they have become, they have ended up as, the losers’, in this world, through ignominy, and in the Hereafter, through their punishment.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله : { يقول الّذين آمنوا } قرأه الجمهور { يقول } بدون واو في أوّله على أنّه استئناف بياني جواب لسؤال من يسأل : ماذا يقول الّذين آمنوا حينئذٍ . أي إذا جاء الفتح أو أمر من قوة المسلمين ووهنَ اليهود يقول الّذين آمنواوقرأ عاصم ، وحمزة ، والكسائي ، وخلف { ويَقول } بالواو وبرفع { يقول } عطفاً على { فعسى الله } ، وقرأه أبو عمرو ، ويعقوب بالواو أيضاً وبنصب { يقول } عطفاً على { أن يأتي } . والاستفهام في { أهؤلاء } مستعمل في التعجّب من نفاقهم .و { هؤلاء } إشارة إلى طائفة مقدّرة الحصول يومَ حصول الفتح ، وهي طائفة الّذين في قلوبهم مرض . والظاهر أنّ { الّذين } هو الخبر عن { هؤلاء } لأنّ الاستفهام للتّعجب ، ومحلّ العجب هو قَسمَهم أنّهم معهم ، وقد دلّ هذا التعجّب على أنّ المؤمنين يظهر لهم من حال المنافقين يوم إتيان الفتح ما يفتضح به أمرهم فيعجبون من حلفهم على الإخلاص للمؤمنين .وجَهْدُ الأيمان بفتح الجيم أقواها وأغلظها ، وحقيقة الجَهد التعب والمشقّة ومنتهى الطاقة ، وفِعله كمنع . ثم أطلق على أشدِّ الفعللِ ونهاية قوّته لِمَا بَيْن الشدّة والمشقّة من الملازمة ، وشاع ذلك في كلامهم ثُمّ استعمل في الآية في معنى أوْكَدِ الأيمان وأغظلها ، أي أقسموا أقوى قَسَم ، وذلك بالتّوكيد والتّكرير ونحو ذلك ممّا يغلّظ به اليمين عُرفاً . ولم أر إطلاق الجَهد على هذا المعنى فيما قبلَ القرآن . وانتصبَ { جَهدَ } على المفعولية المطلقة لأنّه بإضافته إلى «الأيمان» صار من نوع اليمين فكان مفعولاً مطلقاً مبيّناً للنّوع . وفي «الكشاف» في سورة النّور جعله مصدراً بدلاً من فعله وجعل التّقدير : أقسموا بالله يجهدون أيمانَهم جَهداً ، فلمّا حذف الفعل وجعل المفعول المطلق عوضاً عنه قدّم المفعول المطلق على المفعول به وأضيف إليه .وجملة { حَبِطت أعمالهم } استئناف ، سواء كانت من كلام الّذين آمنوا فتكون من المحكي بالقَول ، أم كانت من كلام الله تعالى فلا تكونه . وحبطت معناه تلِفت وفسَدت ، وقد تقدّم في قوله تعالى : { فأولئك حبطت أعمالهم في الدّنيا والآخرة } في سورة البقرة ( 217 ) .\n\n",
      "translations": [
        {
          "translation": "(Then will the believers say) the sincere believers say to the hypocrites 'Abdullah Ibn Ubayy and his followers: (Are these) the hypocrites (they who swore by Allah their most binding oaths) when a man swears by Allah, he has sworn by his most binding oath (that they) the hypocrites (were surely with you) with the sincere ones: i.e. following your religion in secret? (Their works have failed) their works will be thwarted in this world, (and they have become the losers) by incurring punishment upon themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مستهزئين لهؤلاء المنافقين: { أَهُـۤؤُلاۤءِ ٱلَّذِينَ أَقْسَمُواْ بِٱللَّهِ جَهْدَ أَيْمَانِهِمْ } أي: أغلظها وأوكدها { إِنَّهُمْ لَمَعَكُمْ } مؤمنين بنبيكم\n مظاهرة لكم في إعلاء كلمة الحق وانتشارها { حَبِطَتْ } واضمحلت { أَعْمَالُهُمْ } إلى حيث لا تفيدهم أصلاً { فَأَصْبَحُواْ خَاسِرِينَ } [المائدة: 53] خسراناً عظيماً في الدنيا والآخرة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله: { حبطت أعمالهم فأصبحوا خاسرين }\n يحتمل أن يكون من كلام المؤمنين\n أو من قول الله تعالى\n شهادة عليهم بحبوط أعمالهم\n وفيه معنى التعجب\n كأنه قال: ما أحبط أعمالهم وما أخسرهم! والله تعالى أعلم\n الإشارة: قد تقدم مرارًا النهيُ عن موالاة الغافلين\n وخصوصًا الفجار منهم\n ويلتحق بهم القراء المداهنون وهم فسقة الطلبة الذين هم على سبيل الشيطان\n والفقراء الجاهلون وهم من لا شيخ لهم يصلح للتربية\n والعلماء المتجمدون\n فصحبة هؤلاء تقدح في صفاء البصيرة\n وتخمد نور السريرة\n وكل من تراه من الفقراء يميل إلى هؤلاء خشية الدوائر\n ففيه نزعة من المنافقين\n والله تعالى أعلم\n ثم تكلم بقية حفظ الإيمان\n فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ مَن يَرْتَدَّ مِنكُمْ عَن دِينِهِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:65",
      "similarity": 0.5288770869609407
    },
    {
      "verse": "6:109",
      "similarity": 0.49300312964616955
    },
    {
      "verse": "24:53",
      "similarity": 0.47993653048267365
    },
    {
      "verse": "3:22",
      "similarity": 0.472989826281649
    },
    {
      "verse": "6:88",
      "similarity": 0.4659887270306452
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005053.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005053.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:53.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}