{
  "chapter": "المائدة",
  "text": "يايها الذين ءامنوا۟ من يرتد منكم عن دينه فسوف ياتى الله بقوم يحبهم ويحبونه اذلة على المؤمنين اعزة على الكفرين يجهدون فى سبيل الله ولا يخافون لومة لائم ذلك فضل الله يؤتيه من يشاء والله وسع عليم",
  "translations": [
    {
      "translation": "You who have iman! if any of you renounce your deen, Allah will bring forward a people whom He loves and who love Him, humble to the muminun, fierce to the kafirun, who strive in the Way of Allah and do not fear the blame of any censurer. That is the unbounded favour of Allah which He gives to whoever He wills. Allah is Boundless, All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, any one of you who turns back on his faith (should remember) that God could verily bring (in your place) another people whom He would love as they would love Him, gentle with believers, unbending with infidels, who would strive in the way of God, unafraid of blame by any slanderer. Such is the favour of God which He bestows on whomsoever He will. God is infinite and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! If any of you should ever turn away from your faith, remember that Allah will raise up a people whom He loves, and who love Him; a people humble towards the believers, and firm towards the unbelievers; who will strive hard in the way of Allah and will not fear the reproach of the reproacher. This is the favour of Allah which He grants to whom He wills. Allah is vast in resources, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, whichever of you turns away from his faith should know that God will soon raise a people whom He loves and who love Him, who are humble towards the believers, dignified to the unbelievers, who strive hard for the cause of God, and who have no fear of anyone's accusations. This is a favor from God. He bestows His favors upon whomever He wants. God is Munificent and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Whoever among you reneges from his religion, so Allah will soon bring a people who are His beloved ones and Allah is their beloved, lenient with the Muslims and stern towards disbelievers – they will strive in Allah’s cause, and not fear the criticism of any accuser; this is Allah’s munificence, He may give to whomever He wills; and Allah is the Most Capable, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Whoever from among you turns back from his religion (Islam), Allah will bring a people whom He will love and they will love Him; humble towards the believers, stern towards the disbelievers, fighting in the way of Allah, and never fearing the blame of the blamers. That is the grace of Allah which He bestows on whom He wills. And Allah is All-Sufficient for His creatures' needs, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! whoever from among you turns back from his religion, then Allah will bring a people, He shall love them and they shall love Him, lowly before the believers, mighty against the unbelievers, they shall strive hard in Allah's way and shall not fear the censure of any censurer; this is Allah's Face, He gives it to whom He pleases, and Allah is Ample-giving, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, whosoever of you turns from his religion, God will assuredly bring a people He loves, and who love Him, humble towards the believers, disdainful towards the unbelievers, men who struggle in the path of God, not fearing the reproach of any reproacher. That is God's bounty; He gives it unto whom He will; and God is All-embracing, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Whoso of you becometh a renegade from his religion, (know that in his stead) Allah will bring a people whom He loveth and who love Him, humble toward believers, stern toward disbelievers, striving in the way of Allah, and fearing not the blame of any blamer. Such is the grace of Allah which He giveth unto whom He will. Allah is All-Embracing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if any among you renounce the faith, God will replace them by others who love Him and are loved by Him, who will be kind and considerate towards believers and firm and unyielding towards those who deny the truth. They will strive hard for the cause of God and will in no way take to heart the reproaches of the fault finder. Such is God's bounty, which He gives to anyone He wishes. God is bountiful and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! whosoever of you apostateth from his religion, then presently Allah shall bring a people whom He shall love and who shall love Him, gentle toward the believers, stern toward the infidels, striving hard in the way of Allah, and fearing not the reproof of any reprover. This is the grace of Allah; He bestoweth it on whomsoever He will. And Allah is Bountiful, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Should any of you desert his religion, Allah will soon bring a people whom He loves and who love Him, [who will be] humble towards the faithful, stern towards the faithless, waging jihad in the way of Allah, not fearing the blame of any blamer. That is Allah’s grace, which He grants to whomever He wishes, and Allah is all-bounteous, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! if any from among you turn back from his Faith, soon will Allah produce a people whom He will love as they will love Him,- lowly with the believers, mighty against the rejecters, fighting in the way of Allah, and never afraid of the reproaches of such as find fault. That is the grace of Allah, which He will bestow on whom He pleaseth. And Allah encompasseth all, and He knoweth all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Whoever from among you turns back from his religion (Islam), Allah will bring a people whom He will love and they will love Him; humble towards the believers, stern towards the disbelievers, fighting in the Way of Allah, and never afraid of the blame of the blamers. That is the Grace of Allah which He bestows on whom He wills. And Allah is All-Sufficient for His creatures' needs, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, whosoever of you turns from his religion, Allah will bring a nation whom He loves and they love Him, humble towards the believers and stern towards the unbelievers, striving for the Path of Allah and fearless of anyone's blame. Such is the Bounty of Allah; He bestows it on whom He will. He is the Embracer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Whoever of you goes back on his religion—God will bring a people whom He loves and who love Him, kind towards the believers, stern with the disbelievers. They strive in the way of God, and do not fear the blame of the critic. That is the grace of God; He bestows it upon whomever He wills. God is Embracing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, whoever of you should revert from his religion - Allah will bring forth [in place of them] a people He will love and who will love Him [who are] humble toward the believers, powerful against the disbelievers; they strive in the cause of Allah and do not fear the blame of a critic. That is the favor of Allah; He bestows it upon whom He wills. And Allah is all-Encompassing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:54] O you who believe, whoever of you apostatises (read either yartadid, with separation [of the two dāl letters], or yartadd, with assimilation [of one of the dāl letters with the other]), turns back, from his religion, to disbelief — this is a notification of what God knew would happen, for some of them apostatised upon the death of the Prophet (s) — God will assuredly bring, in their place, a people whom He loves and who love Him: the Prophet (s) said, ‘They are people like him’, and he pointed to Abū Mūsā al-Ash‘arī, as reported by al-Hākim [al-Naysābūrī] in his Sahīh; humble, sympathetic, towards believers, stern, severe, towards disbelievers, struggling in the way of God, and fearing not the reproach of any reproacher, therein, in the way that the hypocrites fear the reproach of the disbelievers. That, description mentioned, is God’s bounty; He gives it to whom He will; and God is Embracing, of abundant bounty, Knowing, of those who deserve it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتقضَّى تحذيرهم من أعدائهم في الدّين ، وتجنيبهم أسباب الضعف فيه ، فأقبل على تنبيههم إلى أنّ ذلك حرص على صلاحهم في ملازمة الدّين والذبّ عنه ، وأنّ الله لا يناله نفع من ذلك ، وأنّهم لو ارتدّ منهم فريق أو نَفَر لم يضرّ الله شيئاً ، وسيكون لهذا الدّين أتباع وأنصار وإن صدّ عنه من صَدّ ، وهذا كقوله تعالى : { إن تكفروا فإنّ الله غنيّ عنكم ولا يرضى لعباده الكفر } \\[ الزمر : 7 \\] ، وقوله : { يمنّون عليك أن أسلموا قل لا تمنّوا عليّ إسلامكم بل الله يمنّ عليكم أن هداكم للإيمان إن كنتم صادقين } \\[ الحجرات : 17 \\] .فجملة { يأيّها الّذين آمنوا من يرتدد منكم } الخ معترضة بين ما قبلها وبين جملة { إنّما وليّكم الله } \\[ المائدة : 55 \\] ، دعت لاعتراضها مناسبة الإنذار في قوله { ومن يتولّهم منكم فإنّه منهم } \\[ المائدة : 51 \\] . فتعْقِيبُها بهذا الاعتراض إشارة إلى أنّ اتّخاذ اليهود والنّصارى أولياء ذريعة للارتداد ، لأنّ استمرار فريق على مُوالاة اليهود والنّصارى من المنافقين وضعفاء الإيمان يخشى منه أن ينسلّ عن الإيمان فريق . وأنبأ المتردّدين ضعفاء الإيمان بأنّ الإسلام غنيّ عنهم إن عزموا على الارتداد إلى الكفر .وقرأ نافع ، وابن عامر ، وأبو جعفر { من يرتَدِدْ } بدالين على فَكّ الإدغام ، وهو أحد وجهين في مثله ، وهو لغة أهل الحجاز ، وكذلك هو مرسوم في مصحف المدينة ومصحف الشام . وقرأ الباقون بدال واحدة مشدّدة بالإدغام ، وهو لغة تميم . وبفتححٍ على الدال فتحة تخلّص من التقاء الساكنين لخفّة الفتح ، وكذلك هو مرسوم في مصحف مكّة ومصحف الكوفة ومصحف البصرة .والارتداد مطاوع الردّ ، والردّ هو الإرجاع إلى مكان أو حالة ، قال تعالى : { رُدّوها عليّ } \\[ ص : 33 \\] . وقد يطلق الردّ بمعنى التّصيير { ومنكم من يردّ إلى أرذل العمر } \\[ النحل : 70 \\] . وقد لوحظ في إطلاق اسم الارتداد على الكفر بعد الإسلام ما كانوا عليه قبل الإسلام من الشرك وغيره ، ثم غلب اسم الارتداد على الخروج من الإسلام ولو لم يسبق للمرتدّ عنه اتّخاذ دين قبله .وجملة { فسوف يأتي الله بقوم } الخ جواب الشرط ، وقد حذف منها العائد على الشرط الإسمي ، وهو وعد بأنّ هذا الدّين لا يعدم أتباعاً بررة مخلصين . ومعنى هذا الوعد إظهار الاستغناء عن الّذين في قلوبهم مرض وعن المنافقين وقلّةُ الاكتراث بهم ، كقوله تعالى : { لوْ خرجوا فيكم مَا زادوكم إلاّ خَبالاً } وتطمين الرسول والمؤمنين الحقَّ بأنّ الله يعوّضهم بالمرتدِّين خيراً منهم . فذلك هو المقصود من جواب الشرط فاستغني عنه بذكر ما يتضمّنه حتّى كان للشرط جوابان .وفي نزول هذه الآية في أواخر حياة الرسول صلى الله عليه وسلم إيماء إلى ما سيكون من ارتداد كثير من العرب عن الإسلام مثل أصحاب الأسْود العَنْسي باليمن ، وأصحاب طلحة بن خُويلد في بَني أسد ، وأصحاب مسيلمة بننِ حبيب الحَنفي باليمامة .ثمّ إلى ما كان بعد وفاة الرسول صلى الله عليه وسلم من ارتداد قبائل كثيرة مثل فزارة وغطفان وبني تَميم وكِنْدة ونحوهم . قيل : لم يبق إلا أهل ثلاثة مساجد : مسجد المدينة ومسجد مكّة ومسجد ( جُؤَاثَى ) في البحرين ( أي من أهل المدن الإسلاميّة يومئذٍ ) . وقد صدق الله وعده ونصر الإسلام فأخلفه أجيالاً متأصّلة فيه قائمة بنصرته .وقوله : { يأتي الله بقوم } ، الإتيان هنا الإيجاد ، أي يوجد أقواماً لاتّباع هذا الدّين بقلوب تحبّة وتجلب له وللمؤمنين الخير وتذود عنهم أعداءهم ، وهؤلاء القوم قد يكونون من نفس الّذين ارتدّوا إذا رجعوا إلى الإسلام خالصة قلوبهم ممّا كان يخامرها من الإعراض مثل معظم قبائل العرب وسادتهم الّذين رجعوا إلى الإسلام بعد الردّة زمن أبي بكر ، فإنّ مجموعهم غير مجموع الذين ارتدّوا ، فصحّ أن يكونوا ممّن شمله لفظ { بقوم } ، وتحقّق فيهم الوصف وهو محبّة الله إيّاهم ومحبّتهم ربّهم ودينه ، فإنّ المحبّتين تتبعان تغيّر أحوال القلوب لا تغيّر الأشخاص فإنّ عمرو بن معد يكرب الّذي كان من أكبر عصاة الردّة أصبح من أكبر أنصار الإسلام في يوم القادسيّة ، وهكذا .ودَخل في قوله { بقوم } الأقوام الّذين دخَلوا في الإسلام بعد ذلك مثل عرب الشام من الغساسنة ، وعرب العراق ونبَطهم ، وأهل فارس ، والقبط ، والبَربر ، وفرنجة إسبانية ، وصقلّيَة ، وسردانية ، وتخوممِ فرانسا ، ومثل الترك والمغول ، والتتار ، والهند ، والصّين ، والإغريق ، والرّوم ، من الأمم الّتي كان لها شأن عظيم في خدمة الإسلام وتوسيع مملكته بالفتوح وتأييده بالعلوم ونشر حَضارته بين الأمم العظيمة ، فكلّ أمّة أو فريق أو قوم تحقّق فيهم وصف : { يحبّهم ويحبّونه أذلّة على المؤمنين أعزّة على الكافرين يحاهدون في سبيل الله ولا يخافون لومة لائم } فهُم من القوم المنوّه بهم؛ أمَّا المؤمنون الّذين كانوا من قبل وثبتوا فأولئك أعظم شأناً وأقوى إيماناً فأتاهم المؤيّدون زَرافَات ووُحْدانا .ومحبّة الله عبدَه رضاه عنه وتيسير الخير له ، ومحبّة العبد ربّه انفعال النّفس نحوَ تعظيمه والأنس بذكره وامتثال أمره والدّفاع عن دينه . فهي صفة تحصل للعبد من كثرة تصوّر عظمة الله تعالى ونِعمه حتّى تتمكّن من قلبه ، فمنشؤها السمع والتّصوّر . وليست هي كمحبّة استحسان الذّات ، ألا ترى أنّا نحبّ النّبيء صلى الله عليه وسلم من كثرة ما نسمع من فضائله وحرصه على خيرنا في الدّنيا والآخرة ، وتقوَى هذه المحبّة بمقدار كثرة ممارسة أقواله وذكر شمائله وتصرّفاته وهديه ، وكذلك نحبّ الخلفاء الأربعة لكثرة ما نسْمع من حبّهم الرسول ومن بذلهم غاية النصح في خير المسلمين ، وكذلك نحبّ حاتِماً لما نسمع من كرمه . وقد قالت هند بنت عتبة امرأةُ أبي سفيان لرسول الله صلى الله عليه وسلم ما كان أهلُ خباء أحبَّ إليّ من أن يذلّوا من أهل خبائك وقد أصبحت وما أهل خباء أحبّ إلي من أنْ يعزّوا من أهل خبائك .والأذلّة والأعزّة وصفان متقابلان وصف بهما القوم باختلاف المتعلّق بهما ، فالأذلّة جمع الذليل وهو الموصوف بالذُلّ . والذلّ بضمّ الذال وبكسرها الهوان والطاعة ، فهو ضدّ العزّ { ولقد نصركم الله ببدر وأنتم أذلّة } \\[ آل عمران : 123 \\] . وفي بعض التّفاسير : الذلّ بضم الذال ضد العزّ وبكسر الذال ضدّ الصعوبة ، ولا يعرف لهذه التفرقة سند في اللغة . والذليل جمعه الأذلّة ، والصفة الذلّ { واخفِض لهما جناح الذلّ من الرّحمة } \\[ الإسراء : 24 \\] . ويطلق الذلّ على لين الجانب والتّواضع ، وهو مجاز ، ومنه ما في هذه الآية . فالمراد هنا الذلّ بمعنى لين الجانب وتوطئة الكَنَف ، وهو شدّة الرّحمة والسّعي للنفع ، ولذلك علّق به قوله : { على المؤمنين } . ولتضمين { أذلّة } معنى مشفقين حانين عدّي بعلى دون اللام ، أو لمشاكلةِ ( على ) الثّانية في قوله : { على الكافرين } .والأعزّة جمع العزيز فهو المتّصف بالعزّ ، وهو القّوة والاستقلال» ، ولأجل ما في طباع العرب من القوّة صار العزّ في كلامهم يدلّ على معنى الاعتداء ، ففي المثل ( من عَزّ بَزّ ) . وقد أصبح الوصفان متقابلين ، فلذلك قال السموأل أو الحارثي :وما ضرّنا أنّا قليل وجارنا ... عزيز وجارُ الأكثرين ذليلوإثبات الوصفين المتقابلين للقوم صناعة عربيّة بديعية ، وهي المسماة الطباق ، وبلغاء العرب يغربون بها ، وهي عزيزة في كلامهم ، وقد جَاء كثير منها في القرآن . وفيه إيماء إلى أن صفاتهم تُسيِّرُها آراؤهم الحصيفة فليسوا مندفعين إلى فعل مّا إلاّ عن بصيرة ، وليسوا ممّن تنبعث أخلاقه عن سجية واحدة بأن يكون ليّناً في كلّ حال ، وهذا هو معنى الخلق الأقوم ، وهو الّذي يكون في كلّ حال بما يلائم ذلك الحال ، قال :حَلِيم إذا ما الحِلم زَيَّن أهلَه ... مع الحِلم في عين العَدُوّ مَهِيبوقال تعالى : { أشدّاء على الكفّار رحماء بينهم } \\[ الفتح : 29 \\] .وقوله : { يجاهدون في سبيل الله } صفة ثالثة ، وهي من أكبر العلامات الدالّة على صدق الإيمان . والجهاد : إظهار الجُهد ، أي الطاقة في دفاع العدوّ ، ونهاية الجهد التّعرّض للقتل ، ولذلك جيء به على صيغة مصدر فَاعَلَ لأنّه يظهر جهده لمن يُظهر له مثله . وقوله : { ولا يخافون لومة لائم } صفة رابعة ، وهي عدم الخوف من الملامة ، أي في أمر الدّين ، كما هو السياق .واللومة الواحدة من اللَّوم . وأريد بها هنا مطلق المصدر ، كاللّوْم لأنّها لمّا وقعت في سياق النّفي فعمّت زال منها معنى الوحدة كما يزول معنى الجمع في الجمع المعمَّم بدخول ال الجنسية لأنّ ( لا ) في عموم النّفي مثل ( ال ) في عموم الإثبات ، أي لا يخافون جميع أنواع اللّوم من جميع اللاّئمين إذ اللّوْم منه : شديد ، كالتقريع ، وخفيف؛ واللائمون : منهم اللاّئم المخيف ، والحبيب؛ فنفى عنهم خوفَ جميع أنواع اللّوم . ففي الجملة ثلاثة عمومات : عُموم الفعل في سياق النّفي ، وعموم المفعول ، وعموم المضاف إليه .وهذا الوصف علامة على صدق إيمانهم حتّى خالط قلوبهم بحيث لا يصرفهم عنه شيء من الإغراء واللوم لأنّ الانصياع للملام آية ضعف اليقين والعزيمة .ولم يزل الإعراض عن ملام اللائمين علامة على الثّقة بالنّفس وأصالة الرأي . وقد عَدّ فقهاؤنا في وصف القاضي أن يكون مستخفّاً باللاّئمَة على أحد تأويلين في عبارة المتقدّمين ، واحتمال التّأويلين دليل على اعتبار كليهما شرعاً .وجملة { ذلك فضل الله يؤتيه من يشاء } تذييل . واسم الاشارة إشارة إلى مجموع صفات الكمال المذكورة .و { واسع } وصف بالسعة ، أي عدم نهاية التّعلّق بصفاته ذات التّعلق ، وتقدّم بيانه عند قوله تعالى : { قل إنّ الفضل بيد الله يؤتيه من يشاء والله واسع عليم } في سورة آل عمران ( 73 ) .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe!) meaning: Asad, Ghatafan, and some people from Kindah and Murad. (Whoso of you becometh a renegade from his religion) after the death of Muhammad (pbuh) (Allah will bring a people) i.e. the people of Yemen (whom He loveth and who love Him, humble) compassionate and benevolent (towards believers, stern towards) hard on (disbelievers, striving in the way of Allah) attached to Allah's obedience (and fearing not the blame of any blamer. Such) that which I have mentioned of love, command, etc. (is the grace of Allah which He giveth unto whom He will) He gives to whoever is fit for it. (Allah is All-Embracing) Allah is Generous in His gift, (All-Knowing) to whom He gives.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } لا تحزنوا بصنيع { مَن يَرْتَدَّ مِنكُمْ عَن دِينِهِ } بعد إيمانه وقبوله الإسلام\n ولا تبالوا بشأنه { فَسَوْفَ يَأْتِي ٱللَّهُ } من فضله ولطفه { بِقَوْمٍ يُحِبُّهُمْ } الله ويفوقهم على الإيمان\n ويوصلهم إلى مرتبة اليقين والعرفان { وَيُحِبُّونَهُ } إلى حيث بذلوا مهجهم في سبيله طوعاً ورضاً\n إعلاء لكلمة توحيده\n ونصر دين نبيه { أَذِلَّةٍ عَلَى ٱلْمُؤْمِنِينَ } تواضعاً وإخاءً { أَعِزَّةٍ عَلَى ٱلْكَافِرِينَ } غلبةً واستيلاءً { يُجَاهِدُونَ فِي سَبِيلِ ٱللَّهِ } وطريق توحيده\n باذلين نفوسهم فيه\n طالبين رضاه { وَلاَ يَخَافُونَ لَوْمَةَ } ملامة { لاۤئِمٍ } مليم كهؤلاء المنافقين الذين يخافون من العلامة\n حفظاً لجاههم ورئاستهم\n وحمية لما أسروا في نفوسهم من الأهوية الباطلة\n\n\n{ ذٰلِكَ } الأوصاف الحميدة { فَضْلُ ٱللَّهِ } الهادي لعباده إلى فضاء توحيده { يُؤْتِيهِ مَن يَشَآءُ } من أهل العناية { وَٱللَّهُ } المتفضل\n المحسن لأرباب الولاء { وَاسِعٌ } في فضله وطوله { عَلِيمٌ } [المائدة: 54] على من يستحق الإفضال والإنعام\n\n\nثم لما نهى سبحانه المؤمنين عن موالاة الكفار وودادتهم\n وبالغ فيه\n أراد أن ينبه على من يستحق الولاية والودادة وحقيقته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { من }: شرطية\n و { يرتد }: فعل الشرط\n فمن قرأه بالتفكيك فعلى الأصل\n ومن قرأه بالإدغام ففتحه تخفيفًا\n وجملة { فسوف يأتي }: جواب\n والعائد من الجملة محذوف\n أي: فسوف يأتي الله بقوم مكانهم\n\n\nالخ\n و { أذلة }: نعت ثاني لقوم\n جمع ذليل\n وأتى به مع على لتضمنه معنى العطف والحنو\n و { لا يخافون }: عطف على يجاهدون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "51:54",
      "similarity": 0.4257455571119364
    },
    {
      "verse": "68:30",
      "similarity": 0.40817650408477457
    },
    {
      "verse": "75:2",
      "similarity": 0.39026657314808794
    },
    {
      "verse": "23:6",
      "similarity": 0.3770623142516745
    },
    {
      "verse": "70:30",
      "similarity": 0.3770623142516745
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005054.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005054.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:54.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}