{
  "chapter": "المائدة",
  "text": "يايها الذين ءامنوا۟ لا تتخذوا۟ الذين اتخذوا۟ دينكم هزوا ولعبا من الذين اوتوا۟ الكتب من قبلكم والكفار اولياء واتقوا۟ الله ان كنتم مؤمنين",
  "translations": [
    {
      "translation": "You who have iman! do not take as friends any of those given the Book before you or the kuffar who",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, do not make friends with those who mock and make a sport of your faith, who were given the Book before you, and with unbelievers; and fear God if you truly believe;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Do not take for your allies those who make a mockery and sport of your faith, be they those given the Book before you or other unbelievers. Fear Allah if you indeed believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not consider those among the People of the Book and the unbelievers who mock at your religion and treat it as useless, as your protectors. Have fear of God if you are true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Those who have made your religion a mockery and a sport, and those who received the Book before you, and the disbelievers – do not befriend any of them; and keep fearing Allah, if you have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not take as friends those who take your religion for a mockery and fun from those who received the Scriptures before you, and (nor) the disbelievers; and have Taqwa of Allah if you indeed are true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! do not take for guardians those who take your religion for a mockery and a joke, from among those who were given the Book before you and the unbelievers; and be careful of (your duty to) Allah if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, take not as your friends those of them, who were given the Book before you, and the unbelievers, who take your religion in mockery and as a sport -- and fear God, if you are believers --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Ye who believe! Choose not for guardians such of those who received the Scripture before you, and of the disbelievers, as make a jest and sport of your religion. But keep your duty to Allah if ye are true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Do not seek the friendship of those who were given the Book before you or the disbelievers who ridicule your religion and make a jest of it. Have fear of God, if you are true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! take not as friends those who make a mockery and fun of your religion from among those who have been vouchsafed the Book before you and other infidels. And fear Allah if ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not take those who take your religion in derision and play, from among those who were given the Book before you, and the infidels, as friends, and be wary of Allah, should you be faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! take not for friends and protectors those who take your religion for a mockery or sport,- whether among those who received the Scripture before you, or among those who reject Faith; but fear ye Allah, if ye have faith (indeed).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Take not for Auliya' (protectors and helpers) those who take your religion for a mockery and fun from among those who received the Scripture (Jews and Christians) before you, nor from among the disbelievers; and fear Allah if you indeed are true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not take as guides those who were given the Book before you who have made of your religion a jest and a pastime, nor the unbelievers. Have fear of Allah, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not befriend those who take your religion in mockery and as a sport, be they from among those who were given the Scripture before you, or the disbelievers. And obey God, if you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, take not those who have taken your religion in ridicule and amusement among the ones who were given the Scripture before you nor the disbelievers as allies. And fear Allah, if you should [truly] be believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:57] O you who believe, do not take as patrons those who take your religion in mockery, [as something] to be mocked, and as a game, from among (min is explicative) those who were given the Scripture before you and [from among] the disbelievers (read al-kuffāri or al-kuffāra), the idolaters — and fear God, by refraining from affiliating with them, if you are believers, [if you are] truthful in your faith.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe! Choose not for friends) seeking their assistance and help (such of those who received the Scripture before you) the Jews and Christians, (and of the disbelievers) the rest of the disbelievers, (as make a jest) a pleasantry (and sport) a joke and falsehood (of your religion. But keep your duty to Allah) fear Allah if you were to take them for friends (if ye are true believers).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَـٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } عليكم أن { لاَ تَتَّخِذُواْ ٱلَّذِينَ ٱتَّخَذُواْ } من غاية بغضهم ونفاقهم { دِينَكُمْ } الذي هو أقدم الأديان وأقسطها { هُزُواً وَلَعِباً } يستهزئون ويسخرون به\n استخفافاً واستهانةً لأهله { مِّنَ ٱلَّذِينَ } يدعون الدين والإيمان\n والإطاعة والانقياد افتراءً ومراءً\n لأنهم { أُوتُواْ ٱلْكِتَابَ مِن قَبْلِكُمْ } متلبساً بالحق\n لم يمتثلوا به\n ولم يعملوا بمقتضاه\n ولم يصدقوا الرسل الذين أنزل إليهم الكتاب\n بل يكذبونهم\n ويقتلونهم\n ظلماً وعناداً من كفرهم الأصلي\n وشركهم الجبلي\n\n\n{ وَ } خصوصاً { ٱلْكُفَّارَ } الذين أشركوا بالله المتوحد بذاته\n المنزه عمَّا ينسبونه إليه { أَوْلِيَآءَ } يوالونهم\n ويحبونهم\n كموالاة بعضكم بعضاً\n إذ هم أعداء لله ولرسوله وللمؤمنين { وَٱتَّقُواْ ٱللَّهَ } عن موالاة أعدائه { إِن كُنتُم مُّؤْمِنِينَ } [المائدة: 57] موقنين به ومصدقين لرسوله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { والكفار }: من نَصَبَ عطف على الموصول الأول\n ومن جَرَّ فعلى الموصول الثاني\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا لا تتخذوا الذين اتخذوا دينكم هزوًا ولعبًا } من شدة كفرهم\n وغلبة سفههم { من الذين أوتوا الكتاب من قبلكم } كاليهود والنصارى\n { و } لا تتخذوا أيضًا { الكفار } من المشركين { أولياء } وأصدقاء\n أو: لا تتخذوا من اتخذ دينكم هزوًا ولعبًا من أهل الكتاب ومن المشركين أولياء\n { واتقوا الله } في موالاتهم { إن كنتم مؤمنين } فإن الإيمان يقتضي الوقوف عند الأمر والنهي\n وكيف توالون من يستهزىء بدينكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:58",
      "similarity": 0.6258392605664912
    },
    {
      "verse": "21:16",
      "similarity": 0.5236466493718365
    },
    {
      "verse": "44:38",
      "similarity": 0.5236466493718365
    },
    {
      "verse": "21:55",
      "similarity": 0.5074644611529919
    },
    {
      "verse": "9:65",
      "similarity": 0.4916937669663857
    }
  ]
}