{
  "chapter": "المائدة",
  "text": "واذا ناديتم الى الصلوة اتخذوها هزوا ولعبا ذلك بانهم قوم لا يعقلون",
  "translations": [
    {
      "translation": "When you call to salat they make a mockery and a game of it. That is because they are people who do not use their intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Nor make friends with) those who, when you call (the faithful) to prayer, make mock of it and jest, because they do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you call for Prayer, they take it for a mockery and sport. That is because they are a people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because they are devoid of understanding, they ridicule your call for prayers saying that it is a useless act.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you call to prayer, they mock and make fun of it; this is because they are people without any sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you proclaim the call for the Salah, they take it (but) as a mockery and fun; that is because they are a people who understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you call to prayer they make it a mockery and a joke; this is because they are a people who do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when you call to prayer, take it in mockery and as a sport; that is because they are a people who have no understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when ye call to prayer they take it for a jest and sport. That is because they are a folk who understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you call them to prayer, they treat it as a jest and a diversion. This is because they are devoid of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when ye call for the prayer they make a mockery and fun thereof. This because they are a people who understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you call to prayer, they take it in derision and play. That is because they are a people who do not exercise their reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When ye proclaim your call to prayer they take it (but) as mockery and sport; that is because they are a people without understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you proclaim the call for As-Salat [call for the prayer (Adhan)], they take it (but) as a mockery and fun; that is because they are a people who understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you call to prayer, they treat it as a jest and a pastime. That is because they are a people who have no understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you call to the prayer, they take it as a joke and a trifle. That is because they are people who do not reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you call to prayer, they take it in ridicule and amusement. That is because they are a people who do not use reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:58] And, those who, when you make the call to prayer, take it, that is, the prayer, in mockery and as a game, mocking it and laughing at it among themselves; that, [mocking] attitude, is because they are a people who   do not understand.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when ye call to prayer) through the call to prayer (adhan) and the call announcing the start of the prayer (iqamah) (they take it for a jest and sport) they take it as a joke and falsehood. (That) jest (is because they are a folk who understand not) Allah's command nor do they know Allah's divine Oneness nor His religion. This verse was revealed about a Jewish man who used to poke fun at Bilal's call to prayer, and so Allah burned him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من غاية بغضهم وغيظهم منهم { إِذَا نَادَيْتُمْ } وأذنتم { إِلَى ٱلصَّلاَةِ } المقربة نحو الحق { ٱتَّخَذُوهَا هُزُواً وَلَعِباً } تلك الملاعبة والاستهزاء، والمجادلة والمراء مع الأمناء العرفاء بالله { ذٰلِكَ بِأَنَّهُمْ قَوْمٌ } جهلاء بمقتضى الربوبية، غفلاء عن مرتبة الألوهية وبالجملة: هم سفهاء في أنفسهم { لاَّ يَعْقِلُونَ } [المائدة: 58] ولا يصرفون العقل الجزئي المفاض لهم من الحق بمعرفة المبدأ والمعاد إلى ما خلق لأجله، ومع ذلك ينكرون العقلاء الشاكرين، الصارفين عقولهم وجميع جوارحهم وأعضائهم إلى ما جُبل لأجله من الأعمال المفربة نحو التوحيد الإلهي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى: { ذلك بأنهم قوم لا يعقلون } فإن السفه يؤدي إلى الجهل بالحق والهُزء به، والعقل يقتضي المنع من الجهل والإقرارَ بالحق وتعظيمه\n والله تعالى أعلم\n الإشارة: قد حذّر الحقّ جلّ جلاله من صحبة الأشرار، ويفهم منه الترغيب في موالاة الأخيار، وهم الصوفية الأبرار، ففي صحبتهم سر كبير وخير كثير، ولابن عباد رضي الله عنه في نظم الحكم:\n",
      "translations": []
    }
  ]
}