{
  "chapter": "المائدة",
  "text": "قل ياهل الكتب هل تنقمون منا الا ان ءامنا بالله وما انزل الينا وما انزل من قبل وان اكثركم فسقون",
  "translations": [
    {
      "translation": "Say: 'People of the Book! do you resent us for any other reason than that we have iman in Allah and what was sent down to us, and what was sent down before, and because most of you are deviators?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them: \"O people of the Book, what reason have you for disliking us other than that we believe in God and what has been sent down to us, and was sent down before, and because most of you are disobedient?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them: 'People of the Book! Do you hate us for anything else except that we believe in Allah, and in the teaching which has been revealed to us and in the teaching which was revealed before? Indeed most of you are transgressors.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say to the People of the Book, \"Do you take revenge on us because of our belief in God and what He has revealed to us and to others before us? Most of you are evil-doers\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “O People given the Book(s)! What do you dislike in us – except that we believe in Allah and what is sent down to us and what was sent down before, and because most of you are disobedient?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O People of the Scripture! Do you criticize us for no other reason than that we believe in Allah, and in what has been sent down to us and in that which has been sent down before (us), and that most of you are rebellious\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O followers of the Book! do you find fault with us (for aught) except that we believe in Allah and in what has been revealed to us and what was revealed before, and that most of you are transgressors?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'People of the Book, do you blame us for any other cause than that we believe in God, and what has been sent down to us, and what was sent down before, and that most of you are ungodly?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O People of the Scripture! Do ye blame us for aught else than that we believe in Allah and that which is revealed unto us and that which was revealed aforetime, and because most of you are evil-livers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"People of the Book! Do you resent us only because we believe in God and in what has been revealed to us and to others before, and because most of you are disobedient?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: O people of the Book! what is it that ye persecute us for save that we believe in Allah and in that which hath been sent down unto us and that which hath been sent down aforetime? and most of you are transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘O People of the Book! Are you vindictive toward us for any reason except that we have faith in Allah and in what has been sent down to us, and in what was sent down before, and that most of you are transgressors?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O people of the Book! Do ye disapprove of us for no other reason than that we believe in Allah, and the revelation that hath come to us and that which came before (us), and (perhaps) that most of you are rebellious and disobedient?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O people of the Scripture (Jews and Christians)! Do you criticize us for no other reason than that we believe in Allah, and in (the revelation) which has been sent down to us and in that which has been sent down before (us), and that most of you are Fasiqun [rebellious and disobedient (to Allah)]?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'People of the Book, do you blame us for any reason other than that we believe in Allah and in what has been sent down to us, and what was sent down before us, and that most of you are evildoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “O People of the Scripture! Do you resent us only because we believe in God, and in what was revealed to us, and in what was revealed previously; and most of you are sinners?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"O People of the Scripture, do you resent us except [for the fact] that we have believed in Allah and what was revealed to us and what was revealed before and because most of you are defiantly disobedient?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:59] The following was revealed when the Jews said to the Prophet (s), ‘Whom among the messengers do you believe in?’, and he replied: in God and in that which has been revealed to us [Q. 2:136], and when he mentioned Jesus they said, ‘We know of no religion worse than yours!’ Say: ‘O People of the Scripture, do you spite, [do] you repudiate, us for any other cause than that we believe in God, and what has been revealed to us, and what was revealed, to the prophets, before, and that most of you are wicked?’ (wa-anna aktharakum fāsiqūn is a supplement to an āmannā, ‘that we believe’), that is to say, ‘What you repudiate, in fact, is our faith and your opposition [to it], in refusing to accept it — [a refusal] which is described as ‘wickedness’, [this wickedness] itself being the necessary consequence of such [a refusal] — but in fact this [faith of ours] is not something to be repudiated’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "120 (Say) to the Jews, Muhammad: (0, People of the Scripture! Do ye blame us) do you accuse, and find fault with, us (for aught else than that we believe in Allah) for any other reason except for our faith in Allah, alone without any partners (and that which is revealed unto us) the Qur'an (and that which was revealed aforetime) of Scriptures and of messengers sent before Muhammad (pbuh) and before the Qur'an, (and because most of you) all of you (are evil-doers) disbelievers?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { هَلْ تَنقِمُونَ مِنَّآ } معناهُ تَكرَهُونَ\n\n",
      "translations": [
        {
          "translation": "\n\nDo you hate us?",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ يَـٰأَهْلَ ٱلْكِتَابِ هَلْ تَنقِمُونَ مِنَّآ } وتنكرون علينا\n وتستهزئون بنا { إِلاَّ أَنْ آمَنَّا بِٱللَّهِ } المتوحد\n المتفرد بذاته\n المتجلي على الآفاق بالاستحقاق { وَ } آمنا أيضاً { مَآ أُنزِلَ إِلَيْنَا } لتبيين توحيده { وَ } كذا آمنا { مَآ أُنزِلَ مِن قَبْلُ } من الكتب على الرسل الماضين لإهداء طريق الحق { وَ } تعلمون أنتم أيضاً يقيناً { أَنَّ أَكْثَرَكُمْ فَاسِقُونَ } [المائدة: 59] خارجون عن الإيمان وجادة التوحيد\n ولا تظهرونه\n عناداً ومكابرةً\n ويستهزئون مع أهل الحق تجاهلاً\n حفظاً لكم ورئاستكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: نقم ـ بفتح القاف ـ ينقم ـ بالكسر ـ، بمعنى: عاب وأنكر، وانتقم إذا كافأه على إنكاره، ويقال: نقم ـ بالكسر ـ ينقم ـ بالفتح ـ وقرىء به في الشاذ، و { أن أكثركم }: عطف على { آمنا } أي: ما تعيبون منا إلا أنا مؤمنون وأنتم فاسقون. يقول الحقّ جلّ جلاله: { قل يا أهل الكتاب هل تنقمون منا } أي: ما تنكرون علينا وتعيبونه منا { إلا أن آمنا بالله وما أنزل إلينا وما أنزل من قبل } من الكتب كلها، { وأن أكثركم } خارجون عن هذا الإيمان، وهذا أمر لا ينكر ولا يعاب، ونظير هذا في الاستثناء العجيب قوله النابغة:\nالإشارة: أهل الخصوصية يقرون أحوال أهل الشريعة كلها، ولا ينكرون على أهلها شيئًا من أمورهم، وأهل الشريعة ينكرون كثيرًا من أحوال أهل الخصوصية ويعيبُونها عليهم، وهي من أفضل القربات إلى الله عندهم، فيقولون لهم: هل تنقمون منا إلا أن آمنا بشريعتكم، وأنتم خارجون عن حقيقتنا ورؤية خصوصيتنا، لكن أهل الشريعة معذورون في إنكارهم، إذ ذاك مبلغهم من العلم، فإن كان إنكارهم غيرةً على ما فهموا من الدين فعذرهم صحيح، وإن كان حسدًا أو حمية فهم ممقوتون عند الله. والله تعالى أعلم. ولما جاء إلى رسول الله صلى الله عليه وسلم جماعة من اليهود، فقالوا يا محمد: أخبرنا بمن تؤمن من الرسل، فتلا عليهم:\n[آل عمران:84] إلى قوله:\n[آل عمران:84] فلما سمعوا ذكر عيسى قالوا: ما رأينا شرًا من دينك، فأنزل الله تعالى في الرد عليهم: { قُلْ هَلْ أُنَبِّئُكُمْ بِشَرٍّ مِّن ذٰلِكَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "85:8",
      "similarity": 0.6223160284935937
    },
    {
      "verse": "15:79",
      "similarity": 0.6178772748674521
    },
    {
      "verse": "30:47",
      "similarity": 0.5806093512980915
    },
    {
      "verse": "3:4",
      "similarity": 0.5581281632281647
    },
    {
      "verse": "39:37",
      "similarity": 0.5533274620733705
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005059.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005059.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:59.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}