{
  "chapter": "المائدة",
  "text": "يايها الذين ءامنوا۟ اذا قمتم الى الصلوة فاغسلوا۟ وجوهكم وايديكم الى المرافق وامسحوا۟ برءوسكم وارجلكم الى الكعبين وان كنتم جنبا فاطهروا۟ وان كنتم مرضى او على سفر او جاء احد منكم من الغائط او لمستم النساء فلم تجدوا۟ ماء فتيمموا۟ صعيدا طيبا فامسحوا۟ بوجوهكم وايديكم منه ما يريد الله ليجعل عليكم من حرج ولكن يريد ليطهركم وليتم نعمته عليكم لعلكم تشكرون",
  "translations": [
    {
      "translation": "You who have iman! when you get up to do salat, wash your faces and your hands and your arms to the elbows, and wipe over your heads, and wash your feet to the ankles. If you are in a state of major impurity, then purify yourselves. But if you are ill or on a journey, or have come from the lavatory, or have touched women, and cannot find any water, then do tayammum with pure earth, and wipe your faces and your hands. Allah does not want to make things difficult for you, but He does want to purify you and to perfect His blessing upon you so that hopefully you will be thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, when you stand up for the service of prayer wash your faces and hands up to elbows, and also wipe your heads, and wash your feet up to the ankles. If you are in a state of seminal pollution, then bathe and purify yourself well. But in case you are ill or are travelling, or you have satisfied the call of nature, or have slept with a woman, and you cannot find water, then take wholesome dust and pass it over your face and your hands, for God does not wish to impose any hardship on you. He wishes to purify you, and grace you with His favours in full so that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! When you stand up for Prayer wash your faces and your hands up to the elbows, and wipe your heads, and wash your feet up to the ankles. And if you are in the state of ritual impurity, purify yourselves (by taking a bath). But if you are either ill, travelling, have satisfied a want of nature or have had contact with women and find no water then have recourse to clean earth and wipe your faces and your hands therewith. Allah does not want to lay any hardship upon you; rather He wants to purify you and complete His favours upon you so that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when you are about to pray, wash your face and your hands along with the elbows and wipe your head and your feet to the ankles. If you experience a seminal discharge, manage to take (the required) bath. If you are sick, or on a journey, or have just defecated, or have had intercourse with women and cannot find any water, perform a tayammum by: touching clean natural earth with both palms and wiping (the upper part) of your face and (the back of) your hands. God does not want you to suffer hardship. He wants you to be purified. He wants to complete His favors to you so that perhaps you would give Him thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! When you wish to stand up for prayer, wash your faces, and your hands up to the elbows, and pass wet palms over your heads and wash your feet up to the ankles; and if you need a bath, clean yourselves thoroughly; and if you are sick or on a journey, or one of you returns from answering the call of nature, or you have cohabited with women, and you do not find water, then cleanse (yourself) with clean soil – therefore stroke your soiled palms over your faces and your hands with it; Allah does not will to place you in hardship, but He wills to fully purify you and complete His favour upon you, so that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you stand (intend) to offer the Salah (the prayer), then wash your faces and your hands (forearms) up to the elbows, rub (by passing wet hands over) your heads, and (wash) your feet up to the ankles. If you are in a state of Janaba, purify yourselves (bathe your whole body). But if you are ill or on a journey or any of you comes from the Gha'it (toilet) or you have touched women and you find no water, then perform Tayammum with clean earth and rub therewith your faces and hands. Allah does not want to place you in difficulty, but He wants to purify you, and to complete His Favor to you that you may be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! when you rise up to prayer, wash your faces and your hands as far as the elbows, and wipe your heads and your feet to the ankles; and if you are under an obligation to perform a total ablution, then wash (yourselves) and if you are sick or on a journey, or one of you come from the privy, or you have touched the women, and you cannot find water, betake yourselves to pure earth and wipe your faces and your hands therewith, Allah does not desire to put on you any difficulty, but He wishes to purify you and that He may complete His favor on you, so that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, when you stand up to pray wash your faces, and your hands up to the elbows, and wipe your heads, and your feet up to the ankles. If you are defiled, purify yourselves; but if you are sick or on a journey, or if any of you comes from the privy, or you have touched women, and you can find no water, then have recourse to wholesome dust and wipe your faces and your hands with it. God does not desire to make any impediment for you; but He desires to purify you, and that He may complete His blessing upon you; haply you will be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! When ye rise up for prayer, wash you faces, and your hands up to the elbows, and lightly rub your heads and (wash) your feet up to the ankles. And if ye are unclean, purify yourselves. And if ye are sick or on a journey, or one of you cometh from the closet, or ye have had contact with women, and ye find not water, then go to clean, high ground and rub your faces and your hands with some of it. Allah would not place a burden on you, but He would purify you and would perfect His grace upon you, that ye may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when you rise to pray, wash your faces and your hands up to the elbows and wipe your heads and [wash] your feet up to the ankles. If you are in a state of impurity, take a full bath. But if you are sick or on a journey or when you have just relieved yourselves, or you have consorted with your spouses, you can find no water, take some clean sand and rub your faces and hands with it. God does not wish to place any burden on you; He only wishes to purify you and perfect His favour to you, in order that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! when ye stand up for the prayer wash your faces and your hands unto the elbows, and wipe your heads, and wash your feet unto the ankles. And if ye be polluted, then purify yourselves And if ye be ailing or on a journey or one of you cometh from the privy or ye have touched women, and ye find not water, then betake yourselves to clean earth and wipe your faces and hands therewith. Allah intendeth not to lay upon you a hardship, but intendeth to purify you and to complete His favour upon you, that haply ye may return thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! When you stand up for prayer, wash your faces and your hands up to the elbows, and wipe a part of your heads and your feet, up to the ankles. If you are junub, purify yourselves. But if you are sick, or on a journey, or any of you has come from the toilet, or you have touched women, and you cannot find water, then make tayammum with clean ground and wipe a part of your faces and your hands with it. Allah does not desire to put you to hardship, but He desires to purify you, and to complete His blessing upon you so that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! when ye prepare for prayer, wash your faces, and your hands (and arms) to the elbows; Rub your heads (with water); and (wash) your feet to the ankles. If ye are in a state of ceremonial impurity, bathe your whole body. But if ye are ill, or on a journey, or one of you cometh from offices of nature, or ye have been in contact with women, and ye find no water, then take for yourselves clean sand or earth, and rub therewith your faces and hands, Allah doth not wish to place you in a difficulty, but to make you clean, and to complete his favour to you, that ye may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you intend to offer As-Salat (the prayer), wash your faces and your hands (forearms) up to the elbows, rub (by passing wet hands over) your heads, and (wash) your feet up to ankles. If you are in a state of Janaba (i.e. had a sexual discharge), purify yourself (bathe your whole body). But if you are ill or on a journey or any of you comes from answering the call of nature, or you have been in contact with women (i.e. sexual intercourse) and you find no water, then perform Tayammum with clean earth and rub therewith your faces and hands. Allah does not want to place you in difficulty, but He wants to purify you, and to complete His Favour on you that you may be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when you rise to pray wash your faces and your hands as far as the elbow, and wipe your heads and (wash) your feet to the ankle. If you are in a state of impurity, cleanse yourselves. But if you are sick or traveling, or, if when you have just relieved yourselves or had intercourse with women and you cannot find water, touch the clean surface of the earth and rub your hands and faces with it. Allah does not wish to burden you, He seeks only to purify you and to complete His Favor to you in order that you may thank.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When you rise to pray, wash your faces and your hands and arms to the elbows, and wipe your heads, and your feet to the ankles. If you had intercourse, then purify yourselves. If you are ill, or travelling, or one of you returns from the toilet, or you had contact with women, and could not find water, then use some clean sand and wipe your faces and hands with it. God does not intend to burden you, but He intends to purify you, and to complete His blessing upon you, that you may be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, when you rise to [perform] prayer, wash your faces and your forearms to the elbows and wipe over your heads and wash your feet to the ankles. And if you are in a state of janabah, then purify yourselves. But if you are ill or on a journey or one of you comes from the place of relieving himself or you have contacted women and do not find water, then seek clean earth and wipe over your faces and hands with it. Allah does not intend to make difficulty for you, but He intends to purify you and complete His favor upon you that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:6] O you who believe, when you stand up, that is, when you intend to go, to pray, and you are in [a state of] ritual impurity, wash your faces, and your hands up to the elbows, that is, including them [the elbows], as is clarified in the Sunna; and wipe your heads (the bā’ in bi-ru’ūsikum is for ‘adherence’), that is to say, wipe over [the head] adhering [the hand] closely, without [excessive] water pouring over; the noun [ra’s, ‘head’] is generic, and so the minimum required to fulfil [the stipulation] is acceptable, which is the wiping of some of the hair, as al-Shāfi‘ī asserts); and your feet (read wa-arjulakum in the accusative as a supplement to aydīyakum; or wa-arjulikum in the genitive because of its adjacency to [the genitive] bi-ru’ūsikum), up to the ankles, that is, including them [the ankles], as is clarified in the Sunna, and they are the two protruding bones at the juncture of the legs and the feet. The interposing of the wiping of the head between [the mention of] the hands and the feet, which are washed, is intended to show the requirement of [a specific] order during the purification of these limbs, as al-Shāfi‘ī asserts. In addition, the requirement of making intention (niyya) in this [ablution], as in the other rituals of worship, is taken from the Sunna. If you are defiled, purify, wash, yourselves; but if you are sick, with an illness made worse by water, or on a journey, travelling, or if any of you comes from the privy, that is, [if] he has defecated, or you have touched women (as mentioned already in the verse in [sūrat] al-Nisā’ [Q. 4:43]), and you cannot find water, having made the effort to look for it, then head for, seek, wholesome dust, that is, clean earth, and wipe your faces and your hands, including the elbows, with it, using two strikes (the bā’ of bi-wujūhikum, ‘your faces’, denotes ‘adherence’; it is explained in the Sunna that the requirement here is for the wiping to encompass the whole of these two parts. God does not desire to make any hardship for you, any constraint, in the obligations He has imposed on you with regard to ablution, washing and purification with dust; but He desires to purify you, of filth and sins, and that He may perfect His grace upon you, through Islam, by explaining the laws of the religion; so that you might give thanks, for His graces.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe! When ye rise up for prayer) and you are not in a state of minor ritual purity, He has taught you what to do, saying: (wash your face, and your hands up to the elbows, and lightly rub your heads) as you please (and (wash) your feet) above the sole of the feet (up to the ankles. And if ye are unclean) if you are in a state of major ritual impurity, (purify yourselves) with water. (And if ye are sick) of smallpox or are wounded. This was revealed about 'Abdullah Ibn 'Awf (or on a journey, or one of you cometh from the closet) or one of you has urinated or defecated, (or ye have had (sexual) contact with women) or had sex with women, (and ye find not water) you are unable to use water, (then go to clean, high ground and rub your faces) with the first blow (and your hands) with the second blow (with some of it) i.e. some of the dust. (Allah would not place a burden) constraint (on you, but He would purify you) by means of dry ablution from minor and major ritual impurities (and would perfect His grace) His favour (upon you, that ye may give thanks) for His blessing and legal dispensation.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذَا قُمْتُمْ إِلَى ٱلصَّلاةِ } معناهُ مِنْ مَكَانِكُمْ\n\n\n\n\nوقوله تعالى: { فَتَيَمَّمُواْ صَعِيداً طَيِّباً } معناهُ طَاهِرٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"When you stand [in prayer]\" - its meaning is from wherever you are.\n\n\nAnd His saying, {So purify yourselves} - its meaning is pure.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "ثم لمَّا بيَّن سبحانه ما يتعلق بمعاش عباده من الحل والحرمة، والزواج والنكاح وحسن المعاشرة، ورعاية الآداب المشروعة فيها، أراد أن يهديهم إلى طريق الرجوع إلى المعاج الذي هو المبدأ بعينه؛ ليميلوا إليه، ويتوجهوا نحوه على نية التقرب، إلى أن وصلوا واتصلوا، فقال منادياً: { يَا أَيُّهَا ٱلَّذِينَ آمَنُواْ } بوحدة ذات الحق، وتنزهه عن صمة الكثرة { إِذَا قُمْتُمْ إِلَى ٱلصَّلاةِ } أ ي: إذا أردتم أن تخرجوا من بقعة الإمكان، وتميلوا نحو فضاء الوحدة متشوقين، متقربين { فٱغْسِلُواْ وُجُوهَكُمْ } أي: فعليكم أن تغسلوا بماء المحبة والشوق، والجذب الإلهي المحيي، المنبت لأموت الأرواح من أرض تعينات وجوهكم التي تلي الحق عن رين الإمكان، وشين الكثرة.\n\n{ وَ } طهِّروا { أَيْدِيَكُمْ } أي: قصِّروها عن أدناس الأخذ والإعطاء من حطام الدنيا وأقذارها { إِلَى ٱلْمَرَافِقِ } أي: مبالغين في تطهيرها إلى أقصى الغاية { وَ } بعدما غسلتم الوجوه، وطهرتم الأيدي { ٱمْسَحُواْ بِرُؤُوسِكُمْ } أي: امحوا، وحكوا أنانيتكم وهويتكم التي منها طبلكم وأدبكم { وَ } احوا أيضاً { أَرْجُلَكُمْ } وأقدامكم التي بها سلكوككم وطلبكم { إِلَى ٱلْكَعْبَينِ } إلى أن ينقعط سيركم وسلوككم بالفناء فيه { وَإِن كُنتُمْ } أيها المائلون نحو الحق { جُنُباً } منغمسين في خبائث الإمكان وقاذوراتها { فَٱطَّهَّرُواْ } فعليكم المبالغة في التطهير بالرياضات الشاقة من قطع التعلقات، وترك المألوفات والمشتهيات، وبالركون إلى الموت الإداري، والخروج عن الأوصاف البشرية.\n\n{ وَإِن كُنتُم مَّرْضَىۤ } من الأبرار الذين مرضوا بسموم الإمكان، وبحموم نيرانه وصاروا محبوسين فيه بلا قدم وإقدام { أَوْ عَلَىٰ سَفَرٍ } من السالكين، السائرين نحو الحق بلا ممد { أَوْ جَآءَ أَحَدٌ مِّنْكُمْ مِّنَ ٱلْغَائِطِ } أي: رجع من التلوث والتندس بغلاظ أدناس الدنيا من جاهها ومالها ورئاستها { أَوْ لاَمَسْتُمُ ٱلنِّسَآءَ } واستكرهتموهن؛ لأنهن أقوى من بحائل الشيطان وشباكها، يصرف بها أهل الإرادة عن جادة السلامة { فَلَمْ تَجِدُواْ } في هذه الصورة من لدن نفوسكم وقلوبكم { مَآءً } شوقاً إلى الحق، مطهراً لخبائث نفسوكم، قالعاً لها مطلقاً، ومحبة مزيلة لدرن التعلقات، وجذباً مفرطاً من جانب الحق، مزعجاً ملجئاً إلى الفناء.\n\n{ فَتَيَمَّمُواْ } أي: فعليكم أن تقصدوا، وتتوجهوا { صَعِيداً طَيِّباً } مرشداً كاملاً ومكملاً طاهراً عن جميع الرذائل والآثام العائقة عن الوصول { فَٱمْسَحُواْ بِوُجُوهِكُمْ } إي: هوياتكم الباطلة { وَأَيْدِيكُمْ } أي: أوصافكم الذميمة، العاطلة { مِّنْهُ } أي: من تراب أقدام، وثرى سدته السنية؛ لعلة يرشدكم إلى النجاة عن مضيق التعيينات نحو قضاء الذات { مَا يُرِيدُ ٱللَّهُ } المدبر لأموركم { لِيَجْعَلَ عَلَيْكُم } ويبقى فيكم { وَلَـٰكِن يُرِيدُ لِيُطَهِّرَكُمْ } يمنعكم عن الوصل إلى ما جبلتم لأجله { مِّنْ حَرَجٍ } ويصفيكم أولاً من التعيين وأدناسها { وَلِيُتِمَّ نِعْمَتَهُ عَلَيْكُمْ } ثانياً مما لا عينٌ رأت، ولا أذنٌ سمعت، ولا خطر على قلب بشر { لَعَلَّكُمْ تَشْكُرُونَ } [المائدة: 6] حيثن تفوزون ما تفوزون.\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إذا قمتم }: أردتم القيام، كقوله:\n\n[ النّحل:98]، حذف الإرادة للإيجاز، وللتنبيه على أن من أراد العبادة ينبغي أن يبادر إليها، بحيث لا ينفك الفعل عن الإرادة، وقوله: { برؤوسكم } الباء للإلصاق، تقول: أمسكتُ بثوب زيد، أي: ألصقت يدي به، أي: ألصقوا المسح برؤوسكم، أو للتبعيض، وهذا سبب الخلاف في مسحه كله أو بعضه، فقال مالك: واجب كله، وقال الشافعي: أقل ما يقع عليه اسم الرأس، ولو قلّ\n وقال أبو حنيفة: الربع\n { وأرجلكم } ، مَن نَصَبَ عطف على الوجه، ومن خفض فعلى الجوار، وفائدته: التنبيه على قلة صبَّ الماء، حتى يكون غسلاً يقرب من المسح\n قاله البيضاوي: ورده في المُغني فقال: الجوار يكون في النعت قليلاً، وفي التوكيد نادرًا، ولا يكون في النسق لأن العاطف يمنع من التجاور، وقال الزمخشري: لمّا كانت الأرجل بين الأعضاء الثلاثة مغسولات، تغسل بصب الماء عليها، كان مظنة الإسراف المذموم شرعًا، فعطف على الممسوح لا لتمسح، ولكن لينبه على وجوب الاقتصاد في صب الماء عليها، وجيء فيهما بالغاية إماطة لظن من يظن أنها ممسوحة لأن المسح لم يضرب له غاية في الشريعة\n هـ\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا } إذا أردتم القيام { إلى الصلاة } وأنتم محدثون { فاغسلوا وجوهكم } من منابت شعر الرأس المعتاد إلى الذقن، ومن الأذن إلى الأذن، { وأيديكم إلى المرافق } أي: معها، { وامسحوا برؤوسكم } أي: جميعها أو بعضها على خلاف، { وأرجلكم إلى الكعبين } العظمين الناتئين في مفصلي الساقين، فهذه أربعة فرائض، وبقيت النية لقوله:\n\n[البَيّنَة:5]، ولقوله ـ عليه الصلاة والسلام ـ:\n\n \" إنما الأعمال بالنيات \" \n\nوالدلك إذًا لا يسمى غسلاً إلا به، وإلا كان غمسًا، والفور لأن العبادة إذا لم تتصل كانت عبثًا\n ولمّا عطفت بالواو، وهي لا ترتب، علمنا أن الترتيب سنة\n { وإن كنتم مرضى } لم تقدروا على الماء { أو على سفر } ولم تجدوه، أو في الحضر و { جاء أحد منكم من الغائط أو لامستم النساء } بالجماع أو غيره { ولم تجدوا ماء فتيموا صعيدًا طيبًا فامسحوا بوجوهكم } أي: جميعه { وأيديكم منه } ، وقيد الحضر بفقد الماء دون السفر لأن السفر مظنة إعوازه، فالآية نص في تيمم الحاضر الصحيح للصلوات كلها\n قال البيضاوي: وإنما كرره، ـ يعني مع ما في النساء ـ ليتصل الكلام في بيان أنواع الطهارة\n هـ\n ثم قال تعالى: { ما يريد الله ليجعل عليكم من حرج } حتى يكلفكم بالطهارة في المرض أو الفقد من غير انتقال للتيمم، { ولكن يريد ليطهركم } أي: ينظفكم بالماء أو بدله، أو يطهركم من الذنوب، فإن الذنوب تذهب مع صب الماء في كل عضو، كما في الحديث، { وليتم نعمته عليكم } بشرعه، ما هو مَطهَرَةٌ لأبدانكم، ومَكفَرَة لذنوبكم { ولعلكم تشكرون } نعمه فيزيدكم من فضله\n\n\nالإشارة: كما أمر الحقّ جلّ جلاله بتطهير الظاهر لدخول حضرة الصلاة، التي هي محل المناجاة ومعدن المصافاة، أمر أيضًا بتطهير الباطن من لوث السهو والغفلات، فمن طهر ظاهره من الأوساخ والنجاسات، ولوّث باطنه بالوساوس والغفلات، كان بعيدًا من حضرة الصلاة إذ لا عبرة بحركة الأبدان، وإنما المطلوب حضور الجنان\n قال القشيري: وكما أن للظاهر طهارةً فللسرائر طهارة، فطهارة الظاهر بماء السماء، أي: المطر، وطهارة القلوب بماء الندم والخجل، ثم بماء الحياء والوجل، ويجب غسلُ الوجه عند القيام إلى الصلاة، ويجب ـ في بيان الإشارة ـ صيانة الوجه عن التبذل للأشكال عند طلب خسائس الأغراض، وكما يجب مسحُ الرأس، يجب صونه عن التواضع لكل أحد ـ أي: في طلب الحظوظ والأغراض ـ وكما يجب غسل الرجلين في الطهارة الظاهرة، يجب صونها ـ في الطهارة الباطنة ـ عن التنقل فيما لا يجوز\n هـ\n وقال عند قوله: { وإن كنتم جُنبًا فاطهروا }: وكما يجب طهارة الأعلى، أي: الظاهر، فيقتضي غسل جميع البدن، فقد يقع للمريد فترة ـ توجب عليه الاستقصاء في الطهارة الباطنية ـ فذلك تجديد عقد وتأكيد عهد، وكما أنه إذا لم يجد المتطهرُ الماءَ فَفَرضُه التيممُ، فكذلك إذا لم يجد المريد مَن يفيض عليه صَوبَ همته، ويغسله ببركات إشارته، اشتغل بما يُنشر له من اقتفاء آثارهم، والاسترواح إلى ما يجد من سالف سِيرتهم، ومأثور حكايتهم\n هـ\n قلت: محصل كلامه أن من سقط على شيخ التربية، كان كمن وجد الماء فاستعمل الطهارة الأصلية الحقيقية، ومن لم يسقط على شيخ التربية، كان كالمستعمل للطهارة الفرعية المجازية وهي التيمم، وإلى ذلك أشار الغزالي، لما سقط على الشيخ، ولامه ابن العربي الفقيه على التجريد، فقال:\n\nثم قال: لمَّا طَلَعَ قمرُ السَّعَادةِ في ملك الإرَادَة وأشرقت شمسُ الوُصوُلِ على أُفقِ الأُصُول:\n\nثم ذكَّرهم الحقّ جلّ جلاله العهدّ الذي أخذه عليهم في الجهاد والطاعة، حين بايعوا نبيه ـ عليه الصلاة والسلام ـ في العقبة وغيرها، فقال: { وَٱذْكُرُواْ نِعْمَةَ ٱللَّهِ عَلَيْكُمْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:43",
      "similarity": 0.7367608274078524
    },
    {
      "verse": "69:36",
      "similarity": 0.19433136191134323
    },
    {
      "verse": "78:33",
      "similarity": 0.1926663181664643
    },
    {
      "verse": "5:97",
      "similarity": 0.17612618398326926
    },
    {
      "verse": "38:42",
      "similarity": 0.17110527130396447
    }
  ]
}