{
  "chapter": "المائدة",
  "text": "قل هل انبئكم بشر من ذلك مثوبة عند الله من لعنه الله وغضب عليه وجعل منهم القردة والخنازير وعبد الطغوت او۟لئك شر مكانا واضل عن سواء السبيل",
  "translations": [
    {
      "translation": "Say: 'Shall I tell you of a reward with Allah far worse than that: that of those whom Allah has cursed and with whom He is angry - turning some of them into monkeys and into pigs - and who worshipped false gods? Such people are in a worse situation and further from the right way.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Shall I inform you who will receive the worst chastisement from God? They who were condemned by God, and on whom fell His wrath, and those who were turned to apes and swine, and those who worship the powers of evil. They are in the worse gradation, and farthest away from the right path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then say to them: 'Shall I tell you about those whose retribution with Allah is even worse? They are the ones whom Allah has cursed, and who incurred His wrath and some of whom were changed into apes and swine, and who served the false deities. Such have an even worse rank and have strayed farther away from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Should I tell you who will receive the worst punishment from God? Those whom God has condemned, afflicted with His anger, made apes out of them, swine and worshippers of Satan, will have the worst dwelling and will wander far away from the right path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Shall I tell you of those who are in a worse position than this, in Allah’s sight? It is those whom Allah has cursed and has wreaked His wrath upon and turned some of them into apes and swine, and worshippers of the devil; theirs is a worse destination and they have wandered further astray from the Straight Path.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Shall I inform you of something worse than that, regarding the recompense from Allah: those who incurred the curse of Allah and His wrath, and those of whom He transformed into monkeys and swine, and those who worshipped Taghut; such are worse in rank, and far more astray from the straight path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Shall I inform you of (him who is) worse than this in retribution from Allah? (Worse is he) whom Allah has cursed and brought His wrath upon, and of whom He made apes and swine, and he who served the Shaitan; these are worse in place and more erring from the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Shall I tell you of a recompense with God, worse than that? Whomsoever God has cursed, and with whom He is wroth, and made some of them apes and swine, and worshippers of idols -- they are worse situated, and have gone further astray from the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall I tell thee of a worse (case) than theirs for retribution with Allah? (Worse is the case of him) whom Allah hath cursed, him on whom His wrath hath fallen and of whose sort Allah hath turned some to apes and swine, and who serveth idols. Such are in worse plight and further astray from the plain road.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Shall I tell you who will receive a worse reward from God? Those whom God has rejected and with whom He has been angry. They were condemned as apes and swine and those who worship the evil. These are in the worst plight and farthest astray from the right path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: shall I declare unto you something worse as a way with Allah than that? Whomsoever Allah hath accursed and is angered with, and of whom some He hath made apes and swine and slaves of the devil - those are worst in abode and furthest astray from the level way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Shall I inform you concerning something worse than that as a requital from Allah? Those whom Allah has cursed and with whom He is wrathful, and turned some of whom into apes and swine, and worshippers of fake deities! Such are in a worse situation and more astray from the right way.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Shall I point out to you something much worse than this, (as judged) by the treatment it received from Allah? those who incurred the curse of Allah and His wrath, those of whom some He transformed into apes and swine, those who worshipped evil;- these are (many times) worse in rank, and far more astray from the even path!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW to the people of the Scripture): \"Shall I inform you of something worse than that, regarding the recompense from Allah: those (Jews) who incurred the Curse of Allah and His Wrath, those of whom (some) He transformed into monkeys and swines, those who worshipped Taghut (false deities); such are worse in rank (on the Day of Resurrection in the Hell-fire), and far more astray from the Right Path (in the life of this world).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Shall I tell you who will receive a worse recompense from Allah than that? Those whom Allah has cursed and with whom He is angry, and made some of them apes and swine, and those who worship the devil. The place of these is worse, and they have strayed further from the Right Path'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Shall I inform you of worse than that for retribution from God? He whom God has cursed, and with whom He became angry; and He turned some of them into apes, and swine, and idol worshipers. These are in a worse position, and further away from the right way.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Shall I inform you of [what is] worse than that as penalty from Allah? [It is that of] those whom Allah has cursed and with whom He became angry and made of them apes and pigs and slaves of Taghut. Those are worse in position and further astray from the sound way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:60] Say: ‘Shall I tell you, [shall] I inform you, of what is worse than, the followers of, that, about which you are spiteful, by way of reward, requital, from God? They are, those whom God has cursed, [whom] He has removed from His mercy, and with whom He is wroth, and some of whom He has turned into apes and swine, by transformation, and, those who, worship the false deity, Satan, by obeying him (the particle minhum, ‘some of whom’, takes into account the [potentially plural] import of the particle min, ‘[those] whom’, and in what precedes [minhum, ‘some of whom’], the [singular] form [of min is taken into account]; a variant reading has ‘abuda al-tāghūt as [the genitive of] an annexation, ‘abud being a [variant] plural of ‘abd; the accusative ending [of ‘abuda] is because the clause is a supplement to al-qirada, ‘apes’), and these were the Jews. They are worse situated (makānan is for specification), for their abode shall be the Fire, and further astray from the even way’, from the path of truth (al-sawā’ originally means al-wasat, ‘middle’); the use of sharrun, ‘worse’, and adallu, ‘further astray’, is intended to counter their saying, ‘We know of no religion worse [sharrun] than yours’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then revealed about their saying: \"we do not know any religious community that is more disfavoured than Muhammad (pbuh) and his Companions\", saying: (Shall I tell thee of a worse (case) than theirs) that which is worse than what you told Muhammad and his Companions (for retribution with Allah) for him who is going to be punished by Allah? (Worse (is the case of him) whom Allah hath cursed) imposing on him the capitation tax, (him on whom His wrath hath fallen! Worse is he of whose sort Allah hath turned some to apes) in the time of the Prophet David (pbuh) (and swine) in the time of Jesus, after eating from the table that Allah sent from heaven, (and who serveth idols) soothsayers and devils; or he whom Allah has made the worshipper of the devil, idols and soothsayers. (Such are in worse plight) worse in works in this world and worse in status in the Hereafter (and further astray from the plain road) the road of guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم يا أكمل الرسل تبكيتاً وإلزاماً: { هَلْ أُنَبِّئُكُمْ } وأخبركم { بِشَرٍّ مِّن ذٰلِكَ } الدين الذي أنتم تنقمون منه؛ مكابرةً { مَثُوبَةً } عائدة، وجزاء مرتباً عليه، ثابتاً { عِندَ ٱللَّهِ } قبحه وديدنه { مَن لَّعَنَهُ ٱللَّهُ } طرده عن قبوله { وَغَضِبَ عَلَيْهِ } بأن أخرجه من رتبة خلافته ونيابته { وَجَعَلَ مِنْهُمُ ٱلْقِرَدَةَ وَٱلْخَنَازِيرَ } المنعزلة عن إدراك الحق { وَعَبَدَ ٱلطَّاغُوتَ } أي: الأهوية الباطلة، المضلة عن الهداية إلى طريق الحق { أُوْلَـٰئِكَ } المطرودون، المغضوبون، الممسوخون عن مقتضى الإنسانية { شَرٌّ مَّكَاناً } منزلة ومكانة عند الله { وَأَضَلُّ عَن سَوَآءِ ٱلسَّبِيلِ } [المائدة: 60] الذي هو الاعتدال الإنساني، المنعكس عن الاعتدال الإلهي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: مشاركة اسم التفضيل هنا باعتبار زعمهم واعتقادهم، وإلا فلا مشاركة بين المسلمين وبينهم في الشر والضلال، و { مثوبة }: تمييز عن شر، وضع موضع الجزاء، وأصل المثوبة: في الخير، والعقوبة: في الشر، فوضع هنا المثوبة موضع العقوبة تهكمًا بهم، كقوله:\n",
      "translations": []
    }
  ]
}