{
  "chapter": "المائدة",
  "text": "وقالت اليهود يد الله مغلولة غلت ايديهم ولعنوا۟ بما قالوا۟ بل يداه مبسوطتان ينفق كيف يشاء وليزيدن كثيرا منهم ما انزل اليك من ربك طغينا وكفرا والقينا بينهم العدوة والبغضاء الى يوم القيمة كلما اوقدوا۟ نارا للحرب اطفاها الله ويسعون فى الارض فسادا والله لا يحب المفسدين",
  "translations": [
    {
      "translation": "The Jews say, 'Allah's hand is chained.' Their hands are chained and they are cursed for what they say! No! Both His hands are open wide and He gives however He wills. What has been sent down to you from your Lord increases many of them in insolence and kufr. We have incited enmity and hatred between them until the Day of Rising. Each time they kindle the fire of war, Allah extinguishes it. They rush about the earth corrupting it. Allah does not love corrupters.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say: \"Bound are the hands of God.\" Tied be their own hands, and damned may they be for saying what they say! In fact, both His hands are open wide: He spends of His bounty in any way He please. But what your Lord has revealed to you will only increase their rebellion and unbelief. So We have caused enmity and hatred among them (which will last) till the Day of Resurrection. As often as they ignite the fires of war they are extinguished by God. Yet they rush around to spread corruption in the land; but God does not love those who are corrupt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say: 'The Hand of Allah is fettered. It is their own hands which are fettered, and they stand cursed for the evil they have uttered. No! His Hands are outspread; He spends as He wills. Surely the message that has been revealed to you from your Lord has increased many of them in their in-surgence and unbelief, and so We have cast enmity and spite among them until the Day of Resurrection. And as often as they kindle the fire of war, Allah extinguishes it; and they go about trying to spread mischief on earth, whereas Allah does not love those who spread mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews have said, \"God's hands are bound.\" May they themselves be handcuffed and condemned for what they have said! God's hands are free and He distributes His favors to His creatures however He wants. The rebellion and disbelief of many of them will be intensified against you because of what has been revealed to you from your Lord. We have induced hostility and hatred among them which will remain with them up until the Day of Judgment. Whenever they kindle the fire of war, God extinguishes it. They try to destroy the land but God does not love the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews said, “Allah’s hand is tied\"; may their hands be tied – and they are accursed for saying so! In fact, both His hands* are free, He bestows upon whomever He wills; and O dear Prophet, this Book which has been sent down upon you from your Lord will cause many of them to advance in their rebellion and disbelief; and We have instilled enmity and hatred between them till the Day of Resurrection; whenever they ignite the flame of war, Allah extinguishes it, and they strive to create chaos in the land; and Allah does not love the mischievous. (* This is a metaphor used to express Allah’s power).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say: \"Allah's Hand is tied up.\" Be their hands tied up and be they accursed for what they uttered. Nay, both His Hands are widely outstretched. He spends as He wills. Verily, the revelation that has come to you from your Lord makes many of them increase in rebellion and disbelief. We have put enmity and hatred among them till the Day of Resurrection. Every time they kindled the fire of war, Allah extinguished it; and they (ever) strive to make mischief on the earth. And Allah does not like the mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews say: The hand of Allah is tied up! Their hands shall be shackled and they shall be cursed for what they say. Nay, both His hands are spread out, He expends as He pleases; and what has been revealed to you from your Lord will certainly make many of them increase in inordinacy and unbelief; and We have put enmity and hatred among them till the day of resurrection; whenever they kindle a fire for war Allah puts it out, and they strive to make mischief in the land; and Allah does not love the mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews have said, 'God's hand is fettered.' Fettered are their hands, and they are cursed for what they have said. Nay, but His hands are outspread; He expends how He will. And what has been sent down to thee from thy Lord will surely increase many of them in insolence and unbelief; and We have cast between them enmity and hatred, till the Day of Resurrection. As often as they light a fire for war, God will extinguish it. They hasten about the earth, to do corruption there; and God loves not the workers of corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say: Allah's hand is fettered. Their hands are fettered and they are accursed for saying so. Nay, but both His hands are spread out wide in bounty. He bestoweth as He will. That which hath been revealed unto thee from thy Lord is certain to increase the contumacy and disbelief of many of them, and We have cast among them enmity and hatred till the Day of Resurrection. As often as they light a fire for war, Allah extinguisheth it. Their effort is for corruption in the land, and Allah loveth not corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say, \"The hand of God is tied up.\" May their own hands be tied up and may they be cursed for what they say. No indeed! His hands are both outstretched: He bestows as He will. What is revealed to you from your Lord will surely increase in most of them their obstinate rebellion and denial of truth; and We have sown among them enmity and hatred till the Day of Resurrection. Whenever they kindle the fire of war, God puts it out. They spread evil in the land, but God does not love the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews say: the hand of God is fettered. Fettered be their own hands, and cursed be they for that which they have said! Aye! His both hands are wide open. He expendeth howsoever He listeth. And surely that which hath been sent down to thee from thy Lord increaseth many of them in exorbitance and infidelity. And We have cast among them enmity and spite till the Day of Judgement: so oft as they kindle the fire of War Allah extinguisheth it, and they strive after corruption in the land, and Allah approveth not the corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say, ‘Allah’s hand is tied up.’ Tied up be their hands, and cursed be they for what they say! No, His hands are wide open: He bestows as He wishes. Surely many of them will be increased in rebellion and unfaith by what has been sent to you from your Lord, and We have cast enmity and hatred amongst them until the Day of Resurrection. Every time they ignite the flames of war, Allah puts them out. They seek to cause corruption on the earth, and Allah does not like the agents of corruption.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say: \"Allah's hand is tied up.\" Be their hands tied up and be they accursed for the (blasphemy) they utter. Nay, both His hands are widely outstretched: He giveth and spendeth (of His bounty) as He pleaseth. But the revelation that cometh to thee from Allah increaseth in most of them their obstinate rebellion and blasphemy. Amongst them we have placed enmity and hatred till the Day of Judgment. Every time they kindle the fire of war, Allah doth extinguish it; but they (ever) strive to do mischief on earth. And Allah loveth not those who do mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say: \"Allah's Hand is tied up (i.e. He does not give and spend of His Bounty).\" Be their hands tied up and be they accursed for what they uttered. Nay, both His Hands are widely outstretched. He spends (of His Bounty) as He wills. Verily, the Revelation that has come to you from Allah increases in most of them their obstinate rebellion and disbelief. We have put enmity and hatred amongst them till the Day of Resurrection. Every time they kindled the fire of war, Allah extinguished it; and they (ever) strive to make mischief on earth. And Allah does not like the Mufsidun (mischief-makers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say: 'The Hand of Allah is chained' Their own hands are chained! And they are cursed for what they said! Rather, His Hands are both outstretched, He spends as He will. That which Allah has sent down to you will surely increase the tyranny and disbelief of many of them. We have stirred among them enmity and hatred up until the Day of Resurrection. Whenever they kindle the fire of war, Allah extinguishes it. They spread corruption in the land, and Allah does not love those who corrupt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Jews say, “God’s hand is tied.” It is their hands that are tied, and they are cursed for what they say. In fact, His hands are outstretched; He gives as He wills. Certainly, what was revealed to your from your Lord will increase many of them in defiance and blasphemy. And We placed between them enmity and hatred, until the Day of Resurrection. Whenever they kindle the fire of war, God extinguishes it. And they strive to spread corruption on earth. God does not love the corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Jews say, \"The hand of Allah is chained.\" Chained are their hands, and cursed are they for what they say. Rather, both His hands are extended; He spends however He wills. And that which has been revealed to you from your Lord will surely increase many of them in transgression and disbelief. And We have cast among them animosity and hatred until the Day of Resurrection. Every time they kindled the fire of war [against you], Allah extinguished it. And they strive throughout the land [causing] corruption, and Allah does not like corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:64] The Jews said, when their circumstances became straitened, on account of their denial of the Prophet (s), after having been the wealthiest of people: ‘God’s hand is fettered’, withholding the sending forth of provision upon us — this was their metaphor for niggardliness — may God be exalted above this. God, exalted be He, says: Fettered be, withheld be, their hands, from the performance of good deeds, as an invocation against them; and they are cursed for what they have said. Nay, but His hands are extended out wide — a hyperbole for the attribute of generosity — the use of [yadā] the dual for yad, ‘hand’, is intended to imply abundance, since the utmost that an affluent person can give freely of his wealth is when he gives it with both hands. He expends how He will, in giving abundantly or straitening, and there can be no   objection to this. And what has been revealed to you from your Lord, of the Qur’ān, will surely increase many of them in insolence and disbelief, because of their [very] disbelief in it; and We have cast between them enmity and hatred until the Day of Resurrection, and so every sect among them is opposed to the other. Every time they light the fires of war, that is, for war against the Prophet (s), God extinguishes them, that is, every time they desire it [war], He repels them. And they hasten about the earth in corruption, that is, [they hasten about] corrupting, through acts of disobedience, and God does not love corrupters, meaning that He will punish them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The Jews) Finhas Ibn 'Azura', the Jew (say: Allah's hand is fettered) and cannot give. (Their hands are fettered) they neither do good nor spend in good causes (and they are accursed) they are punished by the imposition of the capitation tax on them (for saying so. Nay, but both His hands are spread out wide in bounty) His hands are wide open for both the righteous and the sinner. (He bestoweth as He will) if He wishes, He gives, and if He wishes, He withholds. (That which hath been revealed unto thee from thy Lord) i.e. the Qur'an, by Allah it (is certain to increase the contumacy) constancy upon disbelief (and disbelief) firmness in disbelief (of many of them) of the disbelievers, (and We have cast among them) the Jews and Christians (enmity) manifested in killing and destruction (and hatred) in their hearts (till the Day of Resurrection. As often as they light a fire for war) whenever they unite to kill Muhammad out of disobedience, (Allah extinguisheth it) Allah makes them disunite and oppose each other. (Their effort is for corruption in the land) they cause corruption in the land through preventing people from Muhammad and by inviting to other than Allah, (and Allah loveth not corrupters) the Jews and their religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَقَالَتِ ٱلْيَهُودُ يَدُ ٱللَّهِ مَغْلُولَةٌ } معناهُ هُوَ يُحِبُ أَنْ يُمسِكَ خَيرَهُ\n\n\n\n\nوقوله تعالى: { وَأَلْقَيْنَا بَيْنَهُمُ ٱلْعَدَاوَةَ وَٱلْبَغْضَآءَ } معناهُ جَعَلْنَاهَا\n\n\n\n\nوقوله تعالى: { كُلَّمَآ أَوْقَدُواْ نَاراً لِّلْحَرْبِ } معناهُ نَصَبُوا لِلحَربِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the Jews say, \"The hand of Allah is chained.\" This means that He is reluctant to do good.\n\n\nAnd We have placed between them [the believers and the disbelievers] enmity and hatred.\n\nAnd His saying, {Whenever they light a fire for war} means they set up for war.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من غاية جهلهم بالله، ونهاية غفلتهم عن مقتضيات أوصافه { قَالَتِ ٱلْيَهُودُ يَدُ ٱللَّهِ مَغْلُولَةٌ } مقبوضة، يقتر بالرزق حين فقدوا البسطة والرخاء الذي كانوا فيه قبل تكذيبهم رسول الله صلى الله عليه وسلم، قال سبحانه؛ دعاءً عليهم: { غُلَّتْ أَيْدِيهِمْ } عن جميع الخيرات والمبرَّات بضرب الذلة والمسكنة عليهم في الدنيا، وفي الآخرة بالأغلال والسلاسل يسحبون بها إلى الجحيم\n\n\n\n\n{ وَ } أعظم منه أنهم { لُعِنُواْ } طُردوا عن مرتبة الإنسانية { بِمَا قَالُواْ } على ما قالوا على الله الجواد، الكريم ما لا يليق بجنابه { بَلْ يَدَاهُ } أي: أوصافه اللطفية والقهرية { مَبْسُوطَتَانِ يُنفِقُ كَيْفَ يَشَآءُ } ويتعلق إرادته لمن يشاء؛ لطفاً وجوداً، ويمنع عمَّن يشاء قهراً وعدلاً { وَ } الله { لَيَزِيدَنَّ كَثِيراً مِّنْهُم } حقداً وحسداً من { مَّآ أُنزِلَ إِلَيْكَ } يا أكمل الرسل؛ إنعاماً وإفضالاً لك { مِن رَّبِّكَ طُغْيَاناً } اجتراء وظلماً على الله، لا يليق بجنابه { وَكُفْراً } إصراراً وتشدداً على ما هم عليه من الشرك والعناد\n\n\n\n\n{ وَ } بسبب طغيانهم وكفرهم { أَلْقَيْنَا } وأوقعنا { بَيْنَهُمُ ٱلْعَدَاوَةَ وَٱلْبَغْضَآءَ إِلَىٰ يَوْمِ ٱلْقِيَامَةِ } لا ينفقون، ولا يوافقون أصلاً، بل { كُلَّمَآ أَوْقَدُواْ نَاراً لِّلْحَرْبِ } مع المسلمين وصمموا العزم نحوه { أَطْفَأَهَا ٱللَّهُ } بإيقاع المخالفة والعداوة بينهم { وَ } بالجملة: هم { يَسْعَوْنَ فِي ٱلأَرْضِ } دائماً، مستمرين { فَسَاداً } أي: لأجل الفساد، وإثارة الفتن { وَٱللَّهُ } المصلح لأحوال عباده { لاَ يُحِبُّ ٱلْمُفْسِدِينَ } [المائدة: 64] المعاندين منهم، المجترئين على الله وعلى رسوله؛ مكابرةً وعناداً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم نعى عليهم مقالاتهم الشنيعة، التي هي من جملة قولهم الإثم، فقال: { وقالت اليهود يد الله مغلولة } أي: مقبوضة عن بسط الرزق\n رُوِي أن اليهود أصابتهم سنة جدبة بشؤم تكذيبهم للنبي صلى الله عليه وسلم فقالوا هذه المقالة الشنيعة، والذي قالها فِنحاص، ونسبت إلى جملتهم لأنهم رضوا بقوله، فعل اليد كناية عن البخل، وبسطها كناية عن الجود، ومنه:\n\n[الإسرَاء:29]\n ثم رد عليهم فقال: { غُلّت أيديهم } ، يحتمل أن يكون دعاءً أو خبرًا، ويحتمل أن يكون في الدنيا بالأسر والقبض، أو في الآخرة بجعل الأغلال فيها إلى عنقهم في جهنم، قال تعالى: { بل يداه مبسوطتان } ، أي: نعمه مبسوطة على عباده، سحاء عليهم، الليل والنهار، وإنما ثنيت اليدان عنها، وأفردت في قول اليهود ليكون أبلغ في الرد عليهم، ومبالغة في وصفه تعالى بالجود والكرم، كما تقول: فلان يعطي بكلتا يديه إذا كان عظيم السخاء، أو كناية عن نعم الدنيا والآخرة، أو عن ما يعطيه استدارجًا وما يعطيه للإكرام\n ثم أكده بقوله: { يُنفق كيف يشاء } أي: هو مختار في إنفاقه، يوسع تارة ويضيق تارة أخرى، على حسب مشيئته ومقتضى حكمته\n ولمّا عميت بصيرتهم بالكفر، وقست قلوبهم بالذنوب، كانوا كلما ازدادوا تذكيرًا بالقرآن، زادوا في العتو والطغيان، كما قال تعالى: { وليزيدن كثيرًا منهم ما أنزل إليك من ربك طغيانًا وكفرًا } إذ هم متعصبون بالكفر والطغيان، ويزدادون طغيانًا وكفرًا بما يسمعون من القرآن، كما يزداد المريض مرضًا من تناول الغذاء الصالح للأصحاء\n\n\nومن مساوئهم أيضًا: تفريق قلوبهم بالعداوة والشحناء، كما قال تعالى: { وألقينا بينهم العداوة والبغضاء إلى يوم القيامة } فلا تتوافق قلوبهم ولا تجتمع آراؤهم { كلما أوقدوا نارًا للحرب أطفأها الله } أي: كلما أرادوا حرب الرسول ـ عليه الصلاة والسلام ـ وإثارة شر عليه، ردهم الله، وأبطل كيدهم، بأن أوقع بينهم منازعة كف بها شرهم، أو: كلما أرادوا حرب عدو لهم هزمهم الله، فإنهم لما خالفوا حكم التوراة سلط عليهم بختنصر، ثم أفسدوا فسلط عليهم فطرس الرومي، ثم أفسدوا فسلط عليهم المجوس، ثم أفسدوا فسلط عليهم المسلمون\n فكان شأنهم الفساد، ولذلك قال تعالى فيهم: { ويسعون في الأرض فسادًا } أي: الفساد بإثارة الحروب والفتن، وهتك المحارم، واجتهادهم في الحيل والخدع للمسلمين، { والله لا يحب المفسدين } أي: لا يرضى فعلهم فلا يجازيهم إلا شرًّا وعقوبة\n الإشارة: قال الورتجبي: في الآية تحذير الربانيين العارفين بالله وبحقوق الله، والأحبار العلماء بالله وبعذاب الله لمن عصاه، وبثواب الله لمن أطاعه لئلا يسكنوا عن الزجر للمبطلين والمغالطين، المائلين عن طريق الحق إلى طريق النفس، وبيّن تعالى أن من داهن في دينه عذب وإن كان ربانيًا\n هـ\n وفي بعض الأثر: \" إذا رأى العالمُ المنكَر وسكت، فعليه لعنة الله \"\n والذي يظهر أن نهي الربانيين يكون بالهمة والحال، كقضية معروف الكرخي وغيره ونهي الأحبار يكون بالمقال، وقد تقدم هذا\n والله تعالى أعلم\n ثم ندبهم إلى الإسلام فقال: { وَلَوْ أَنَّ أَهْلَ ٱلْكِتَابِ آمَنُواْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "61:8",
      "similarity": 0.4222854205095965
    },
    {
      "verse": "9:32",
      "similarity": 0.40067676236572647
    },
    {
      "verse": "5:91",
      "similarity": 0.2632160639416931
    },
    {
      "verse": "60:4",
      "similarity": 0.25808228974612246
    },
    {
      "verse": "5:14",
      "similarity": 0.20725725274855772
    }
  ]
}