{
  "chapter": "المائدة",
  "text": "ولو ان اهل الكتب ءامنوا۟ واتقوا۟ لكفرنا عنهم سيـاتهم ولادخلنهم جنت النعيم",
  "translations": [
    {
      "translation": "If only the People of the Book had had iman and taqwa, We would have erased their evil deeds from them and admitted them into Gardens of Delight.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the people of the Book had believed and feared, We would surely have absolved them of their sins, and admitted them to gardens of delight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had the People of the Book only believed and been God-fearing, We should surely have effaced from them their evil deeds, and caused them to enter Gardens of Bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had the People of the Book accepted the faith and observed piety, certainly, We would have redeemed their bad deeds and admitted them into a blissful Paradise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the People given the Book(s) had accepted faith and been pious, We would have certainly redeemed them of their sins and would have certainly taken them into serene Gardens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if only the People of the Scripture had believed and had Taqwa, We would indeed have expiated for them their sins and admitted them to Gardens of pleasure (in Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if the followers of the Book had believed and guarded (against evil) We would certainly have covered their evil deeds and We would certainly have made them enter gardens of bliss\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But had the People of the Book believed and been godfearing, We would have acquitted them of their evil deeds, and admitted them to Gardens of Bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only the People of the Scripture would believe and ward off (evil), surely We should remit their sins from them and surely We should bring them into Gardens of Delight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only the People of the Book would believe and be mindful of God, We would surely pardon their sins and We would surely admit them into the Gardens of Bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had the people of the Book believed and feared, We would surely have expiated from them their misdeeds and would surely have made them enter the Garden of Delight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had the People of the Book believed and been Godwary, We would surely have absolved them of their misdeeds and admitted them into gardens of bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only the People of the Book had believed and been righteous, We should indeed have blotted out their iniquities and admitted them to gardens of bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if only the people of the Scripture (Jews and Christians) had believed (in Muhammad SAW) and warded off evil (sin, ascribing partners to Allah) and had become Al-Muttaqun (the pious - see V. 2:2) We would indeed have blotted out their sins and admitted them to Gardens of pleasure (in Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the People of the Book had believed and kept from evil, We would pardon them their sins and admit them to the Gardens of Delight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had the People of the Scriputure believed and been righteous, We would have remitted their sins, and admitted them into the Gardens of Bliss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if only the People of the Scripture had believed and feared Allah, We would have removed from them their misdeeds and admitted them to Gardens of Pleasure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:65] But had the People of the Scripture believed, in Muhammad (s), and feared unbelief, We would have absolved them of their evil deeds and We would admitted them to Gardens of Bliss.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "121 (If only the People of the Scripture) the Jews and Christians (would believe) in Muhammad and the Qur'an (and ward off (evil)) repent of Judaism and Christianity, (surely We should remit their sins from them) those which they committed when they were Jews or Christians (and surely We should bring them into Gardens of Delight) in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولو أنّ أهل الكتاب آمنوا } آمنوا الإيمان التوحيدي الحقيقي { واتّقوا } واجتنبوا عن شرك أفعالهم وصفاتهم وذواتهم { لكفرنا عنهم سيئاتهم } من بقاياهم { ولأدخلناهم } الجنات الثلاث { ولو أنهم أقاموا التوراة } بتحقق علوم الظاهر والقيام بحقوق تجليات الأفعال والمحافظة على أحكامها في المعاملات { والإنجيل } بتحقق عنوان الباطن\n والقيام بحقوق تجليات الصفات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَوْ أَنَّ أَهْلَ ٱلْكِتَٰبِ ءَامَنُواْ } بك وبكتابك { وَٱتَّقَوْاْ } عمَّا اجترؤوا عليه في حق الله\n وفي حقك { لَكَفَّرْنَا عَنْهُمْ } أي: محنا عن ديوان أعمالهم بالمرة { سَيِّئَاتِهِمْ } التي كانوا عليها { وَلأَدْخَلْنَٰهُمْ } تفضلاً وامتناناً { جَنَّٰتِ ٱلنَّعِيمِ } [المائدة: 65] منتزهات العلم والعين والحق\n إن أخلصوا في إيمانهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ولو أن أهل الكتاب } اليهود والنصارى\n { آمنوا } بمحمد صلى الله عليه وسلم وبما جاء به\n { واتقوا } ما ذكرنا من معاصيهم ومساويهم\n { لكفّرنا عنهم سيئاتهم } المتقدمة\n ولم نؤاخذهم بها\n { ولأدخلناهم جنات النعيم } مع المؤمنين\n وفيه تنبيه على أن الإسلام يجُب ما قبله ولو عظم\n وأن الكتابي لا يدخل الجنة إلا أن يسلم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "52:17",
      "similarity": 0.4554891000241549
    },
    {
      "verse": "68:34",
      "similarity": 0.4263496370160654
    },
    {
      "verse": "89:30",
      "similarity": 0.398345493210745
    },
    {
      "verse": "37:43",
      "similarity": 0.3625628605575282
    },
    {
      "verse": "56:12",
      "similarity": 0.3625628605575282
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005065.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005065.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:65.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}