{
  "chapter": "المائدة",
  "text": "ولو انهم اقاموا۟ التورىة والانجيل وما انزل اليهم من ربهم لاكلوا۟ من فوقهم ومن تحت ارجلهم منهم امة مقتصدة وكثير منهم ساء ما يعملون",
  "translations": [
    {
      "translation": "If only they had implemented the Torah and the Injil and what was sent down to them from their Lord, they would have been fed from above their heads and beneath their feet. Among them there is a moderate group but what most of them do is evil.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they had followed the teachings of the Torah and the Gospel, and what has been sent down to them by their Lord, they would surely have enjoyed (blessings) from the heavens above and the earth below their feet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had the People of the Book observed the Torah and the Gospel, and all that had been revealed to them from their Lord, sustenance would have been showered over them from above and risen from beneath their feet. Some among them certainly keep to the right path; but many of them do things which are evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had they followed the Laws of the Old and New Testaments and what was revealed to them from their Lord, they would have received Our bounties from above and below in abundance. Some of them are modest people, but many of them commit the worst sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had they kept the Taurat and the Injeel established, and what was sent down towards them from their Lord, they would have received sustenance from above and from beneath their feet; among them is a group who is fair; but most of them commit extremely evil deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if only they had acted according to the Tawrah, the Injil, and what has (now) been sent down to them from their Lord (the Qur'an), they would surely have gotten provision from above them and from underneath their feet. And among them is a Muqtasid Ummah, but for most of them; evil is their work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if they had kept up the Taurat and the Injeel and that which was revealed to them from their Lord, they would certainly have eaten from above them and from beneath their feet there is a party of them keeping to the moderate course, and (as for) most of them, evil is that which they do\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had they performed the Torah and the Gospel, and what was sent down to them from their Lord, they would have. eaten both what was above them, and what was beneath their feet. Some of them are a just nation; but many of them -- evil are the things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they had observed the Torah and the Gospel and that which was revealed unto them from their Lord, they would surely have been nourished from above them and from beneath their feet. Among them there are people who are moderate, but many of them are of evil conduct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they had observed the Torah and the Gospel and what was revealed to them from their Lord, they would surely have been nourished from above and from below. There are some among them who are on the right course; but there are many among them who do nothing but evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had they established the Taurat and the Injil and that which hath now been sent down unto them from their Lord, they would have devoured from above them and from beneath them. Among them is a community right-doing; but many of them - vile is that which they work!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had they observed the Torah and the Evangel, and what was sent down to them from their Lord, they would surely have drawn nourishment from above them and from beneath their feet. There is an upright group among them, but evil is what many of them do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only they had stood fast by the Law, the Gospel, and all the revelation that was sent to them from their Lord, they would have enjoyed happiness from every side. There is from among them a party on the right course: but many of them follow a course that is evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if only they had acted according to the Taurat (Torah), the Injeel (Gospel), and what has (now) been sent down to them from their Lord (the Quran), they would surely have gotten provision from above them and from underneath their feet. There are from among them people who are on the right course (i.e. they act on the revelation and believe in Prophet Muhammad SAW like 'Abdullah bin Salam), but many of them do evil deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they had established the Torah and the Gospel and what was sent down to them from their Lord they would be eating from above them and from beneath their feet. Some of them are a righteous nation; but many of them evil is what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had they observed the Torah, and the Gospel, and what was revealed to them from their Lord, they would have consumed amply from above them, and from beneath their feet. Among them is a moderate community, but evil is what many of them are doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if only they upheld [the law of] the Torah, the Gospel, and what has been revealed to them from their Lord, they would have consumed [provision] from above them and from beneath their feet. Among them are a moderate community, but many of them - evil is that which they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:66] And had they observed the Torah and the Gospel, by implementing what is in them, including believing in the Prophet (s), and what was revealed to them, of scriptures, from their Lord, they would surely have received nourishment from above them and from beneath their feet, by their being given provision in abundance, with it pouring forth from every place. Some of them, a group [among them], are a just community, implementing it [the Torah], and they are the ones who believed in the Prophet (s), the likes of ‘Abd Allāh b. Salām and his companions; but many of them — evil is that, thing, which they do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If they had observed the Torah and the Gospel) if they had accepted what is in the Torah and the Gospel and demonstrated the traits and description of Muhammad contained therein (and that which was revealed unto them from their Lord) and had they elucidated that which their Lord had explained to them in the Torah and the Gospel; it is also said that this means: if they had believed that all the scriptures and messengers are from their Lord, (they would surely have been nourished from above them) through rain (and from beneath their feet) through vegetation and fruit. (Among them) among the people of the Book (there are people who are moderate) a group of just and upright people, i.e. 'Abdullah Ibn Salam and his followers, the monk Bahirah, the Negus and his followers, and Salman al-Farisi and his fellows, (but many of them are of evil conduct) evil is what they do in terms of concealing the traits and description of Muhammad. Among such people are Ka'b Ibn al-Ashraf, Ka'b Ibn Asad, Malik Ibn al-Sayf, Sa'id Ibn 'Amr, Abu Yasir, and Judayy Ibn Akhtab.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِّنْهُمْ أُمَّةٌ } معناهُ جَمَاعةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"From them is a community,\" means a group.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n والمحافظة على أحكامها { و } احكموا { ما أُنْزِل إليهم } من علم المبدأ والمعاد وتوحيد الملك والملكوت من عالم الربوبية الذي هو عالم الأسماء { لأكلوا من فوقهم } أي: لرزقوا من العالم العلويّ الروحاني العلوم الإلهية والحقائق العقلية اليقينية\n والمعارف الحقانيّة التي بها اهتدوا إلى معرفة الله ومعرفة الملكوت والجبروت { ومن تحت أرجلهم } أي: من العالم السفليّ الجسماني العلوم الطبيعية والمدركات الحسيّة التى اهتدوا بها إلى معرفة عالم الملك\n فعرفوا الله باسمه الظاهر والباطن\n بل بجميع الأسماء والصفات ووصلوا إلى مقام التوحيدين المذكورين { منهم أمّة مُقْتصدة } عادلة واصلة إلى توحيد الأسماء والصفات { وكثير منهم } لم يصلوا إلى توحيد الأفعال بعد فضلاً عن توحيد الصفات\n فساء عملهم لأنه من صفات نفوسهم فهو حجابهم الأكثف\n { وأرسلنا إليهم رسلاً } على حسب مراتبهم فلما كانوا محجوبين من جميع الوجوه أرسلنا موسى لرفع حجاب الأفعال والدعوة إلى توحيد الملك\n فما هوته أنفسهم لأن دعوته كانت مخالفة لهواها لضراوتها بأفعالها وبتجمعها بها وبلذاتها وشهواتها فكذبوه وعبدوا عجل النفس واعتدوا في السبت وفعلوا ما فعلوا حتى إذا آمن به من آمن وبرز من حجاب الأفعال حسب أنه الكمال المطلق\n فأرسلنا عيسى برفع حجاب الصفات والدعوة إلى الباطن\n وتوحيد الملكوت فما هوته أنفسهم لمخالفة دعوته هواها من حسبان الكمال\n فكذّبوه وفعلوا ما فعلوا حتى إذا آمن به من آمن وبرز عن حجاب الصفات بقي على حاله\n حاسباً لنفسه الكمال المطلق فأرسلنا محمداً برفع حجاب الصفات والدعوة إلى توحيد الذات فما هوته أنفسهم فكذبوه\n { وحسبوا أن لا تكون فتنة } شرك عند توحيد الأفعال وظهور الدعوة العيسوية { فعمُوا } عن تجليات رؤية الصفات { وصمُوا } عن سماع علمها { ثم تاب الله عليهم } بفتح أسماع قلوبهم وأبصارها\n فتابوا\n فقَبل توبتهم { ثم عمُوا وصمُوا } عند الدعوة المحمدية عن مشاهدة الوجه الباقي وسماع علم توحيد الجمع المطلق { والله بصير } بعملهم في المقامات الثلاث وردّ الدعوات وإنكار الأنبياء فيجازيهم على حسب حالهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n سيما بعث سيدنا محمد صلى الله عليه وسلم ونعته { وَ } أقاموا أيضاً { ٱلإِنْجِيلَ } وعملوا بمقتضى ما فيه { وَ } كذا جميع { مَآ أُنزِلَ إِلَيهِمْ مِّن رَّبِّهِمْ } لوسع عليهم الرزق الصوري والمعنوي إلى حيث { لأَكَلُواْ } الرزق { مِن فَوْقِهِمْ وَمِن تَحْتِ أَرْجُلِهِم } - ذكر الجهتين يغني عن الجهات كلها - لو كوشفوا بوحدة الله من جميع الجوانب والجهات\n ولا يرون غير الله في مظاهره ومجاليه { مِّنْهُمْ أُمَّةٌ مُّقْتَصِدَةٌ } معتدلة\n لا من أهل التفريط\n ولا من أهل الإفراط\n يرجى إيمانهم\n وكشفهم { وَ } إن كان { كَثِيرٌ مِّنْهُمْ سَآءَ مَا يَعْمَلُونَ } [المائدة: 66] أي: ساء عملهم في الإفراط والتفريط عن جادة الاعتدال والتوحيد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وآمنوا بما { أُنزل إليهم من ربهم } \n يعني بسائر الكتب المنزلة\n ومن جملتها القرآن العظيم\n فإنهم لما كلفوا بالإيمان بها صارت كأنها منزلة عليهم\n فلو فعلوا ذلك { لأكلوا من فوقهم ومن تحت أرجلهم } أي: لوسعنا عليهم أرزاقهم\n وبسطنا عليهم النعم بأن يفيض عليهم بركاتٍ من السماء والأرض\n أو: لأكلوا من فوقهم بكثرة ثمرة الأشجار\n ومن تحت أرجلهم بكثرة الزروع\n أو من فوقهم ما يجنون من ثمار أشجارهم\n ومن تحت أرجلهم ما يتساقط منها\n والمراد: بيان علة قبض الرزق عنهم\n وأن ذلك بشؤم كفرهم ومعاصيهم\n لا لقصور القدرة عن ذلك\n ولو أنهم أقاموا ما ذكرنا لوسعنا عليهم\n ولحصل لهم خير الدارين\n { منهم أمة مقتصدة } أي: جماعة عادلة غير غالية ولا مقصرة\n وهم الذين آمنوا بمحمد صلى الله عليه وسلم\n { وكثير منهم ساء ما يعملون } أي: قبح عملهم\n وفيه معنى التعجب\n أي: ما أسوأ عملهم!\n وهو المعاندة وتحريف الحق والإعراض عنه\n والإفراط في العداوة\n قاله البيضاوي\n قال في الحاشية: وفي الآية شاهد لما ورد من افتراق أهل الكتابين على فرق\n كما أن شاهد افتراق هذه الأمة آية:\n[الأعرَاف:181]\n وهذه هي الناجية من هذه الأمة\n هـ\n يعني التي تهدي بالحق إلى الحق\n وتعدل به في جميع الأمور\n الإشارة: كل من حقّق الإيمان الكامل والتقوى الكاملة\n وسع الله عليه من أرزاق العلوم\n وفتحت له مخازن الفهوم\n ودخل جنة المعارف\n فلم يشتق إلى جنة الزخارف\n وقال الورتجبي: لو كانوا على محل التحقيق في المعرفة لأكلوا أرزاق الله بالله من خزائن غيبه\n كأصحاب المن والسلوى والمائدة من السماء\n ويفتح لهم كنوز الأرض وهم على ذلك\n بإسقاط رؤية الوسائط\n هـ\n وقال القشيري: لو سلكوا سبيل الطاعات لوسعنا عليهم أسباب المعيشة\n وسهلنا لهم الحال\n إن ضربوا يُمنة\n لا يلقون غير اليُمن\n وإن ضرَبوا يُسرةَ\n لا يجدون إلا اليسر\n هـ\n ثم أمر رسوله بالتبليغ من غير مبالاة بأهل التشغيب\n فقال: { يَـٰأَيُّهَا ٱلرَّسُولُ بَلِّغْ مَآ أُنزِلَ إِلَيْكَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:48",
      "similarity": 0.5043082066656005
    },
    {
      "verse": "3:3",
      "similarity": 0.5021745533217675
    },
    {
      "verse": "16:9",
      "similarity": 0.4819909274558709
    },
    {
      "verse": "3:65",
      "similarity": 0.44896469431845354
    },
    {
      "verse": "35:32",
      "similarity": 0.43744634495144064
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/5:66.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/5:66.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/5:66.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}