{
  "chapter": "المائدة",
  "text": "ان الذين ءامنوا۟ والذين هادوا۟ والصبـون والنصرى من ءامن بالله واليوم الءاخر وعمل صلحا فلا خوف عليهم ولا هم يحزنون",
  "translations": [
    {
      "translation": "All those who believe, and the Jews and the Sabians and the Christians, in fact any one who believes in God and the Last Day, and performs good deeds, will have nothing to fear or regret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Know well, none has an exclusive claim to the Truth.) For all those who believe in Allah and in the Last Day and do good deeds - be they either believers, Jews, Sabaeans or Christians - neither fear shall fall upon them, nor shall they have any reason to grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The believers, Jews, Sabaeans, and the Christians who believe in God and the Day of Judgment and who do what is right will have nothing to fear nor will they be grieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who call themselves Muslims – and similarly among the Jews, and the Sabeans, and the Christians* – whoever sincerely accepts faith in Allah and the Last Day, and does good deeds – so there shall be no fear upon them nor shall they grieve. (Whoever among them converts to Islam).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, those who believe, and those who are the Jews and the Sabians and the Christians, whosoever believed in Allah and the Last Day, and worked righteousness, on them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who believe and those who are Jews and the Sabians and the Christians whoever believes in Allah and the last day and does good-- they shall have no fear nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely they that believe, and those of Jewry, and the Sabaeans, and those Christians, whosoever believes in God and the Last Day, and works righteousness -- no fear shall be on them, neither shall they sorrow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who believe, and those who are Jews, and Sabaeans, and Christians - Whosoever believeth in Allah and the Last Day and doeth right - there shall no fear come upon them neither shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, Jews, Sabaeans and Christians, whoever believes in God and the Last Day and does what is right, shall have nothing to fear nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who believe, and those who are Judaised, and the Sabians and the Nazarenes - whosoever believeth in Allah and the Last Day and worketh righteously, no fear shall come on them, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the faithful, the Jews, the Sabaeans, and the Christians—those who have faith in Allah and the Last Day and act righteously—they will have no fear, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe (in the Qur'an), those who follow the Jewish (scriptures), and the Sabians and the Christians,- any who believe in Allah and the Last Day, and work righteousness,- on them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, those who believe (in the Oneness of Allah, in His Messenger Muhammad SAW and all that was revealed to him from Allah), those who are the Jews and the Sabians and the Christians, - whosoever believed in Allah and the Last Day, and worked righteousness, on them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, Jews, Sabaeans, and Nazarenes whoever believes in Allah and the Last Day and does good shall neither fear, nor shall they sorrow (as long as they do not reject any of the prophets).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and the Jews, and the Sabians, and the Christians—whoever believes in God and the Last Day, and does what is right—they have nothing to fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who have believed [in Prophet Muhammad] and those [before Him] who were Jews or Sabeans or Christians - those [among them] who believed in Allah and the Last Day and did righteousness - no fear will there be concerning them, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:69] Surely those who believe and those of Jewry ([this constitutes] the subject of the clause), namely, the Jews, and the Sabaeans, a sect among them, and the Christians (and [what follows] substitutes for the [above] subject): whoever, of them, believes in God and the Last Day and behaves righteously — no fear shall befall them, neither shall they grieve, in the Hereafter (this [fa-lā khawfun ‘alayhim wa-lā hum yahzanūn, ‘no fear shall befall them, neither shall they grieve’] is the predicate of the subject and also indicates the predicate of [the clause beginning with] inna, ‘surely’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who believe) in Moses as well as in all the prophets and Scriptures and die in this state, no fear shall come to them nor will they grieve, (and those who are Jews, and Sabaeans) a Christian sect, who are milder than the other Christians, (and Christians) of Najran as well as other Christians (whosoever) of the Jews, Sabaeans or Christians (believeth in Allah and the Last Day) in resurrection after death, and if the Jews repent of Judaism, the Sabaeans of their religion and the Christians of Christianity (and doeth right) sincerely between him and his Lord (there shall no fear come upon them neither shall they grieve) about that which they have left behind; it is also said that this means: they shall not fear when others so fear nor shall they grieve when others do; it is also said that this means: they shall not fear when death is slain nor grieve when the Fire is closed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ ٱلَّذِينَ آمَنُواْ وَٱلَّذِينَ هَادُواْ وَٱلصَّابِئُونَ } فالصَّابِئونَ: فِرقةٌ مِن أَهلِ الكِتابِ يَقرأونَ الزَّبورَ\n ويقالُ: لاَ كِتَابَ لَهُمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { إِنَّ ٱلَّذِينَ آمَنُواْ } أسلموا، وانقادوا، وامتثلوا بأوامر كتابك واجتنبوا عن نواهيه، وآمنوا أيضاً بجميع الكتب والرسل، وجميع الأنبياء وذوي الأديان وغيرها؛ لتمكنهم في مقر التوحيد البحث، الخالص عن شوب الكثرة { وَٱلَّذِينَ هَادُواْ } من الممتثلين جميع ما أمر في التوراة، ونُهي عنه إلى أن وصلوا إلى مرتبة التوحيد، المسقط للاختلافات الصوري والمعنوي { وَٱلصَّابِئُونَ } الذين يتوسلون بالملائكة في عبادة الله، لا الصابئون الطبيعيون الذين هم يعبدون الكواكب من صور نظرهم، وكثافة حجابهم { وَٱلنَّصَارَىٰ } الذين يعلمون على مقتضى الإنجيل بلا فوت شيء من أوامره ونواهيه\n\n\n\n\n{ مَنْ آمَنَ } منهم { بِٱللَّهِ } المتوحد بذاته، المستغني عن الأشياء والأنداد مطلقاً ووصل بمتابعة كتبه المنزلة، ورسله المبينين لكتبه إلى توحيده { وَٱلْيَوْمِ ٱلآخِرِ } المعدّ للكشف والوصول { وعَمِلَ } عملاً { صَالِحاً } بطريق توحيده { فَلاَ خَوْفٌ عَلَيْهِمْ } في سلوكهم { وَلاَ هُمْ يَحْزَنُونَ } [المائدة: 69] بعدما وصلوا؛ إذ كل ما جاء من عند الله إنما هو بمقتضى توحيده، مبيّن له، وإن كانت الطرق متعددة بتعدد الأوصاف والأسماء الإلهية لكن كل منها موصلة إليه سبحانه؛ إذ ليس وراء الله مرمى ومنتهى، لذلك قيل: التوحيد إسقاط الإضافات رأساً حتى يتحقق الفناء فيه والبقاء به، بل لا فناء ولا بقاء في مرتبة العماء أصلاً، حارت في ملكوتك عميقات مذاهب التفكر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { والصابئون }: مبتدأ، والخبر محذوف، أي: إن الذين آمنوا والذين هادوا من آمن بالله واليوم الآخر فلا خوف عليهم ولا هم يحزنون، والصابئون كذلك\n انظر البيضاوي وابن هشام\n يقول الحقّ جلّ جلاله: { إن الذين آمنوا } بمحمد صلى الله عليه وسلم { والذين هادوا والصابئون }: قوم بين النصارى والمجوس، أو عباد الكواكب، أو قوم بقوا على دين نوح ـ عليه السلام ـ { والنصارى }: قوم عيسى، { من آمن } منه { بالله } إيمانًا حقيقيًا بلا شرك ولا تفريق، وآمن باليوم الآخر، { وعمل صالحًا فلا خوف عليهم ولا هم يحزنون } ، قال ابن عباس: نسخها:\n",
      "translations": []
    }
  ]
}