{
  "chapter": "المائدة",
  "text": "واذكروا۟ نعمة الله عليكم وميثقه الذى واثقكم به اذ قلتم سمعنا واطعنا واتقوا۟ الله ان الله عليمۢ بذات الصدور",
  "translations": [
    {
      "translation": "Remember Allah's blessing to you and the covenant He made with you when you said, 'We hear and we obey.' Have taqwa of Allah. Allah knows what the heart contains.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember the favours He bestowed on you, and the covenant He cemented with you, when you said: \"We have heard and obey.\" Have fear of God, for He knows the secrets of your heart.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember Allah's favour upon you and His covenant which He made with you when you said: 'We have heard and we obey.' So do fear Allah. Allah has full knowledge even of that which is hidden in the breasts of people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember God's favors to you and the firm covenant that He has made with you. You said because of this covenant, \"We have heard (the words of the Lord) and have obeyed Him.\" Have fear of God; He knows well all that the hearts contain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Allah’s favour upon you and the covenant He took from you when you said, “We hear and we obey” – and fear Allah; indeed Allah knows what lies within the hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Allah's favor to you and His covenant with which He bound you when you said: \"We hear and we obey.\" And have Taqwa of Allah. Verily, Allah is All-Knower of that which is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember the favor of Allah on you and His covenant with which He bound you firmly, when you said: We have heard and we obey, and be careful of (your duty to) Allah, surely Allah knows what is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember God's blessing upon you, and His compact which He made with you when you said, 'We have heard and we obey. And fear you God; surely God knows the thoughts in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember Allah's grace upon you and His covenant by which He bound you when ye said: We hear and we obey; And keep your duty to Allah. Lo! He knoweth what is in the breasts (of men).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember God's favour to you, and the covenant, which He made with you when you said, \"We hear and we obey.\" Fear God. God has full knowledge of the innermost thoughts of men.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Allah's favour on you and His bond wherewith He bound you firmly when ye said: we hearken and we obey. And fear Allah: verily Allah is Knower of that which is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember Allah’s blessing upon you and His covenant with which He has bound you when you said, ‘We hear and obey.’ And be wary of Allah. Indeed Allah knows best what is in the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And call in remembrance the favour of Allah unto you, and His covenant, which He ratified with you, when ye said: \"We hear and we obey\": And fear Allah, for Allah knoweth well the secrets of your hearts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember Allah's Favour upon you and His Covenant with which He bound you when you said: \"We hear and we obey.\" And fear Allah. Verily, Allah is All-Knower of the secrets of (your) breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember the favor of Allah upon you, and the covenant with which He bound you when you said: 'We hear and obey' Have fear of Allah. Allah is the Knower of the innermost of the chests'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Remember God’s blessings upon you, and His covenant which He covenanted with you; when you said, “We hear and we obey.” And remain conscious of God, for God knows what the hearts contain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember the favor of Allah upon you and His covenant with which He bound you when you said, \"We hear and we obey\"; and fear Allah. Indeed, Allah is Knowing of that within the breasts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:7] And remember God’s grace upon you, through Islam, and His covenant, His pledge, which He made, He   bound, with you when you said, to the Prophet (s) upon pledging allegiance to him: ‘We hear and we obey’, all that you command and forbid, of what we love and what we despise. And fear God, in His covenant, lest you break it. Surely God knows what is in the breasts, that is, what is in the hearts [of people], all the more reason for [Him to have knowledge of] other things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Remember Allah's grace) recollect Allah's blessing (upon you) through faith (and His covenant) pledge (by which He bound you) with which He commanded you on the Day of the Covenant (when you said: We hear) Your words, our Lord, (and we obey) Your command; (and keep your duty to Allah) fear Allah in that which He commanded and prohibited you. (Allah knoweth what is in the breasts (of men)) of loyalty and betrayal.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما سمعتم ما سمعتم\n ووعدتم من عنده ما وعدتم { ٱذْكُرُواْ نِعْمَةَ ٱللَّهِ } التي أنعم بها { عَلَيْكُمْ } وقوموا بشكرها { وَ } تذكروا { مِيثَاقَهُ ٱلَّذِي وَاثَقَكُم بِهِ إِذْ قُلْتُمْ } حين سمعتم قوله: { أَلَسْتُ بِرَبِّكُم } [الأعراف: 172]: { سَمِعْنَا } قولك\n أنت ربنا أظهرتنا من العدم { وَأَطَعْنَا } ما أمرتنا به طوعاً { وَٱتَّقُواْ ٱللَّهَ } من نقض ميثاثه { إِنَّ ٱللَّهَ } المطلع بالسرائر والخفايا { عَلِيمٌ بِذَاتِ ٱلصُّدُورِ } [المائدة: 7] أي: بمكنونات صدروكم يجازيكم على مقتضى علمه وخبرته\n\n\n{ يَا أَيُّهَآ ٱلَّذِينَ آمَنُواْ كُونُواْ قَوَّامِينَ للَّهِ } مستقيمين فيما أمرتم به في طريق توحيده { شُهَدَآءَ } حضراء مستحضرين { بِٱلْقِسْطِ } لحقوق آلائه الإلهية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { واذكروا نعمة الله عليكم } بالهداية والعز والنصر، { و } اذكروا { ميثاقه الذي واثقكم به } حين بايعتم نبيه في بيعة العقبة وبيعة الرضوان على الجهاد وإظهار الدين، وعلى السمع والطاعة في المنشط والمكره، حين { قلتم } له: { سمعنا وأطعنا } فيما تأمرنا به في عسرنا ويسرنا، في منشطنا ومكرهنا، { واتقوا الله } في نقض العهود، { إن الله عليم بذات الصدور } أي: خفياتها، فيجازيكم عليها، فضلاً عن جليات أعمالكم، والمقصود: الترغيب في الجهاد الذي هو من كمال الدين. الإشارة: يقال للفقراء الذين مّن الله عليهم بصحبة شيوخ التربية، وأخذوا عنهم العهد ألا يخالفوهم: اذكروا نعمة الله عليكم، حيث يسَّر لكم من يُسَيّركم إلى حضرة ربكم، ويعرفكم به، وغيركم يقول: إنه معدوم، أو خفي لا يعرفه أحد، وهذا الكنز الذي سقطتم عليه، قلَّ من وجده، واذكروا أيضًا ميثاقه الذي واثقه عليكم ألا تخالفوهم، ولو أدى الأمر إلى حتف أنفكم. كان شيخ شيوخنا ـ سيدي العربي بن عبد الله، يقول: الفقير الصادق، هو الذي إذا قال له شيخه: ادخل في عين الإبرة، يقوم مبادرًا يُحاول ذلك، ولا يتردد. وقال أيضًا:  صاحبي هو الذي نقتله بشعرة، وقد تقرر أن من قال لشيخه: لِمَ، لا يفلح، وهذا أمر مقرر في علم التربية كما في قضية الخضر مع سيدنا موسى ـ عليه السلام ـ. واتقوا الله في اعتقاد مخالفتهم سرًا { إن الله عليم بذات الصدور } فإن الاعتراض سرًا أقبح لانه خيانة، فليبادر المريد بالتوبة منه ويغسله من قلبه. والله تعالى أعلم. ولما كان الجهاد لا يقوم إلا بنصب الإمام، ذَكَر ما يتعلق به من العدل في الأحكام، فقال: { يَا أَيُّهَآ ٱلَّذِينَ آمَنُواْ كُونُواْ قَوَّامِينَ للَّهِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:26",
      "similarity": 0.45765389761138603
    },
    {
      "verse": "57:8",
      "similarity": 0.45635578077709477
    },
    {
      "verse": "35:38",
      "similarity": 0.419673976625116
    },
    {
      "verse": "31:23",
      "similarity": 0.3586739273217744
    },
    {
      "verse": "12:66",
      "similarity": 0.31068994358497537
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/5:7.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/5:7.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/5:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}