{
  "chapter": "المائدة",
  "text": "لقد اخذنا ميثق بنى اسرءيل وارسلنا اليهم رسلا كلما جاءهم رسولۢ بما لا تهوى انفسهم فريقا كذبوا۟ وفريقا يقتلون",
  "translations": [
    {
      "translation": "We made a covenant with the tribe of Israel and We sent Messengers to them. Each time a Messenger came to them with something their lower selves did not desire, they denied some and they murdered others.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had taken a solemn pledge from the children of Israel, and sent messengers to them; but whenever an apostle came to them bringing what did not suit their mood, they called one imposter, another they slew,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We took a covenant from the Children of Israel and sent to them many Messengers. But whenever any Messenger brought to them something that did not suit their desires, they gave the lie to some of them and killed the others,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made a covenant with the Israelites and sent Messengers to them. Whenever a Messenger came to them with a message which did not suit their desires, they would reject some of the Messengers and kill others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made a covenant with the Descendants of Israel and sent Noble Messengers towards them; whenever a Noble Messenger came to them with whatever was not according to their own desires, they denied some of them and some they slew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We took the covenant of the Children of Israel and sent Messengers to them. Whenever there came to them a Messenger with what they themselves desired not, a group of them they called liars, and others among them they killed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We made a covenant with the children of Israel and We sent to them apostles; whenever there came to them an apostle with what that their souls did not desire, some (of them) did they call liars and some they slew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We took compact with the Children of Israel, and We sent Messengers to them. Whensoever there came to them a Messenger with that their souls had not desire for, some they cried lies to, and some they slew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made a covenant of old with the Children of Israel and We sent unto them messengers. As often as a messenger came unto them with that which their souls desired not (they became rebellious). Some (of them) they denied and some they slew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made a covenant with the Children of Israel and sent forth messengers among them. But whenever a messenger came to them with a message that was not to their liking, some they accused of lying, while others they put to death,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly We took a bond from the Children of Isra'il and We sent unto them apostles. Whenever there came unto them an apostle with that which their souls desired not, a party of them they belied and a party they slew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We took a pledge from the Children of Israel, and We sent apostles to them. Whenever an apostle brought them that which was not to their liking, they would impugn a part of them, and a part they would slay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We took the covenant of the Children of Israel and sent them messengers, every time, there came to them a messenger with what they themselves desired not - some (of these) they called impostors, and some they (go so far as to) slay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We took the covenant of the Children of Israel and sent them Messengers. Whenever there came to them a Messenger with what they themselves desired not - a group of them they called liars, and others among them they killed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We took a covenant with the Children of Israel and sent forth Messengers to them. But whenever a Messenger came to them with that which did not suit their fancies they belied some and killed others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made a covenant with the Children of Israel, and We sent to them messengers. Whenever a messenger came to them with what their souls did not desire, some of them they accused of lying, and others they put to death.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We had already taken the covenant of the Children of Israel and had sent to them messengers. Whenever there came to them a messenger with what their souls did not desire, a party [of messengers] they denied, and another party they killed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:70] And We made a covenant with the Children of Israel, to believe in God and His messengers, and We sent messengers to them. Every time a messenger came to them, from among them, with what their souls did not desire, in the way of truth, they denied it; some, of them, they denied, and some, of them, they slay, such as Zachariah and John (the use of [the present tense] yaqtulūn, ‘they slay’, instead of [the perfect tense] qatalū is to narrate past events [as if in the present] and to conclude [in harmony with] the end-   rhyme of the verses).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف عاد به الكلام على أحوال اليهود وجراءتهم على الله وعلى رسله . وذلك تعريض باليأس من هديهم بما جاء به محمّد صلى الله عليه وسلم وبأنّ ما قابلوا به دعوته ليس بدعاً منهم بل ذلك دأبهم جيلاً بعد جيل .وقد تقدّم الكلام على أخذ الميثاق على اليهود غير مرّة . أُولاها في سورة البقرة ( 83 ) .والرسل الّذين أرسلوا إليهم هم موسى وهارون ومن جاء بعدهما مثل يوشع بن نون وأشعيا وأرْميا وحزقيال وداوود وعيسى . فالمراد بالرّسل هنا الأنبياء : من جاء منهم بشرع وكتاب ، مثل موسى وداوود وعيسى ، ومن جاء معزّزاً للشّرع مبيّنا له ، مثل يوشع وأشعيا وأرميا . وإطلاق الرّسول على النّبيء الّذي لم يجىء بشريعة إطلاق شائع في القرآن كما تقدّم ، لأنّه لمَّا ذكر أنّهم قَتَلوا فريقاً من الرسل تعيَّن تأويل الرسل بالأنبياء فإنّهم ما قتلوا إلاّ أنبياء لا رسلاً .وقوله : { كلّما جاءهم رسول بما لا تهوَى أنفسهم فريقاً كذّبوا } إلخ انتصب { كلّما } على الظرفيّة ، لأنّه دالّ على استغراق أزمنة مَجيء الرسل إليهم فيدلّ على استغراق الرسل تبعاً لاستغراق أزمنة مجيئهم ، إذْ استغراق أزمنة وجود شَيْء يستلزم استغراق أفراد ذلك الشيء ، فما ظرفية مصدريّة دالّة على الزّمان .وانتصب ( كلَّ ) على النّيابة عن الزّمان لإضافته إلى اسم الزّمان المبهم ، وهو ( مَا ) الظرفية المصدرية . والتقدير : في كلّ أوقات مجيء الرّسل إليهم كَذّبوا ويَقتلون . وانتصب { كلَّما } بالفعلين وهو { كَذّبوا } وَ { يَقْتلون } على التّنازع .وتقديم { كلّما } على العامل استعمال شائع لا يكاد يتخلّف ، لأنّهم يريدون بتقديمه الاهتمام به ، ليظهر أنّه هو محلّ الغرض المسوقة له جملتهُ ، فإنّ استمرار صنيعهم ذلك مع جميع الرّسل في جميع الأوقات دليل على أنّ التّكذيب والقتل صارا سجيتين لهم لا تتخلّفان ، إذ لم ينظروا إلى حال رسول دون آخر ولا إلى زمان دون آخر ، وذلك أظهر في فظاعة حالهم ، وهي المقصود هنا .وبهذا التّقديم يُشرَبُ ظرف { كلّما } معنى الشرطية فيصير العامل فيه بمنزلة الجواب له ، كما تصير أسماء الشّرط متقدّمة على أفعالها وأجوبتها في نحو { أينما تكونوا يدرككم الموت } \\[ النساء : 78 \\] . إلاّ أنّ { كُلّما } لم يسمع الجزم بعدها ولذلك لم تعدّ في أسماء الشرط لأنّ ( كلّ ) بعيد عن معنى الشرطية . والحقّ أنّ إطلاق الشرط عليها في كلام بعض النّحاة تسامح . وقد أطلقه صاحب «الكشاف» في هذه الآية ، لأنّه لم يجد لها سبباً لفظياً يوجب تقديمها بخلاف ما في قوله تعالى : { أفكلما جاءكم رسول بما لا تهوى أنفسكم استكبرتم } في سورة البقرة : ( 87 ) ، وفي قوله : { أو كُلّما عاهدوا عهداً نبذة فريق منهم } ( 100 ) في تلك السورة ، فإنّ التّقديم فيهما تبع لوقوعهما متّصلتين بهمزة الاستفهام كما ذكرناه هنالك ، وإن كان قد سكت عليهما في الكشاف } لظهور أمرهما في تينك الآيتين .فالأحسن أن تكون جملة { فريقاً كذّبوا } حالاً من ضمير { إليهم } لاقترانها بضمير موافِق لصاحب الحال ، ولأنّ المقصود من الخبر تفظيع حال بني إسرائيل في سوء معاملتهم لهداتهم ، وذلك لا يحصل إلاّ باعتبار كون المرسَل إليهم هذه حالهم مع رسلهم . وليست جملة { فريقاً كذبوا } وما تقدّمها من متعلّقها استئنافاً ، إذ ليس المقصود الإخبار بأنّ الله أرسل إليهم رسلاً بل بمدلول هذا الحال .وبهذا يظهر لك أنّ التّقسيم في قوله : { فريقاً كذّبوا وفريقاً يقتلون } ليس لرسول من قوله : { كلّما جاءهم رسول } بل ل { رُسلاً } ، لأنَّنا اعتبرنا قوله : { كلّما جاءهم رسول } مقدّماً من تأخير . والتقدير : وأرسلنا إليهم رسلاً كذّبوا منهم فريقاً وقتلوا فريقاً كُلّما جاءهم رسول من الرسل . وبهذا نستغني عن تكلّفات وتقدير في نظم الآية الآتي على أبرع وجوه الإيجاز وأوضح المعاني .وقوله : { بما لا تهوى أنفسهم } أي بما لا تحبّه . يقال : هَوِي يهوَى بمعنى أحبّ ومَالت نفسه إلى ملابسة شيء . إنّ بعثة الرسل القصد منها كبح الأنفس عن كثير من هواها الموقع لها في الفساد عاجلاً والخسران آجلاً ، ولولا ذلك لتُرك النّاس وما يهوَوْن ، فالشرائع مشتملة لا محالة على كثير من منع النّفوس من هواها . ولمّا وصفت بنو إسرائيل بأنّهم يكذّبون الرسل ويقتلونهم إذا جاؤوهم بما يخالف هواهم علمنا أنّه لم يَخْلُ رسول جاءهم من أحد الأمرين أو كليهما : وهما التّكذيب والقتل . وذلك مستفاد من { كلّما جاءهم رسول } ، فلم يبق لقوله : { بما لا تهوى أنفسهم } فائدة إلاّ الإشارة إلى زيادة تفظيع حالهم من أنّهم يكذّبون الرسل أو يقتلونهم في غير حالة يلتمسون لأنفسهم فيها عُذراً من تكليففٍ بمشقّة فادحة ، أو من حدوث حادثثِ ثائرة ، أو من أجل التّمسّك بدين يأبون مفارقته ، كما فعل المشركون من العرب في مجيء الإسلام ، بل لمجرّد مخالفة هوى أنفسهم بعد أن أخذ عليهم الميثاق فقبلوه فتتعطّل بتمرّدهم فائدة التّشريع وفائدة طاعة الأمّة لهُداتها .وهذا تعليم عظيم من القرآن بأنّ من حقّ الأمم أن تكون سائرة في طريق إرشاد علمائها وهداتها ، وأنّها إذا رامت حمل علمائها وهدَاتها على مسايرة أهوئها ، بحيث يُعْصَوْن إذا دَعوا إلى ما يخالف هوى الأقوام فقد حقّ عليهم الخسران كما حقّ على بني إسرائيل ، لأنّ في ذلك قلباً للحقائق ومحاولة انقلاب التّابع متبوعاً والقائد مقوداً ، وأنّ قادة الأمم وعلماءها ونصحاءها إذا سايروا الأمم على هذا الخُلق كانوا غاشِّين لهم ، وزالت فائدة علمهم وحكمتهم واختلط المَرْعِيّ بالهَمَل والحَابِلُ بالنابل ، وقد قال رسول الله صلى الله عليه وسلم « من استرعاه الله رعيّة فغشّها لم يَشُمّ رائحةَ الجنّة » فالمشركون من العرب أقرب إلى المعذرة لأنّهم قابلوا الرسول من أوّل وهلة بقولهم : { إنّا وجدنا آباءَنَا على أمّة وإنَّا على آثارهم مهتدون }\\[ الزخرف : 22 \\] ، وقال قوم شعيب { أصلواتك تأمرك أن نترك ما يعبد آباؤنا } \\[ هود : 87 \\] ، بخلاف اليهود آمنوا برسلهم ابتداء ثُمّ انتقضوا عليهم بالتّكذيب والتّقتيل إذا حملوهم على ما فيه خيرهم ممّا لا يهُوونه .وتقديم المفعول في قوله : { فريقاً كذّبوا } لمجرّد الاهتمام بالتفصيل لأنّ الكلام مَسوق مساق التّفصيل لأحوال رُسل بني إسرائيل باعتبار ما لاَقوه من قومهم ، ولأنّ في تقديم مفعول { يقتلون } رعاية على فاصلة الآي ، فقدّم مفعول { كَذّبوا } ليكون المفعولان على وتيرة واحدة . وجيء في قوله : { يَقتلون } بصيغة المضارع لحكاية الحال الماضية لاستحضار تلك الحالة الفظيعة إبلاغاً في التعجيب من شناعة فاعليها .والضّمائر كلّها راجعة إلى بني إسرائيل باعتبار أنّهم أمّة يخلُف بعضُ أجيالها بعضاً ، وأنّها رسخت فيها أخلاق متماثلة وعوائدُ متّبعة بحيث يكون الخَلف منهم فيها على ما كان عليه السلف؛ فلذلك أسندت الأفعال الواقعة في عصور متفاوتة إلى ضمائرهم مع اختلاف الفاعِلين ، فإنّ الّذين قتلوا بعض الأنبياء فريق غير الّذين اقتصروا على التكذيب .\n\n",
      "translations": [
        {
          "translation": "(We made a covenant of old with the Children of Israel) in the Torah regarding Muhammad (pbuh) that they shall not associate any partners with Allah (and We sent unto them messengers. As often as a messenger came unto them with that which their souls desired not) that which did not agree with their hearts or their religion: Judaism ((they became rebellious). Some (of them) they denied) they denied Jesus and Muhammad, Allah bless both of them (and some they slew) like Zachariah and John. 122\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوالله { لَقَدْ أَخَذْنَا مِيثَاقَ بَنِيۤ إِسْرَائِيلَ } على لسان أنبيائهم ألاَّ تشركوا بالله\n ولا تخاصموا مع أنبيائه ورسوله { وَ } بعدما أخذنا منهم الميثاق { أَرْسَلْنَآ إِلَيْهِمْ رُسُلاً } مبشرين ومنذرين تخاصموا\n وصاروا من خبث بواطنهم { كُلَّمَا جَآءَهُمْ رَسُولٌ بِمَا لاَ تَهْوَىٰ أَنْفُسُهُمْ } وبما لا ترضى به عقولهم { فَرِيقاً كَذَّبُواْ } عندنا\n مكابرةً وعناداً { وَفَرِيقاً يَقْتُلُونَ } [المائدة: 70] الأنبياء\n ظلماً وعتواً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: المضارع إذا وقع بعد العلم وجب إهمال إن معه\n فتكون مخففة\n وإن وقعت بعد الظن يصح فيها الوجهان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "57:8",
      "similarity": 0.4610119201324577
    },
    {
      "verse": "7:105",
      "similarity": 0.40319598806866686
    },
    {
      "verse": "20:47",
      "similarity": 0.37575465488402415
    },
    {
      "verse": "89:26",
      "similarity": 0.3719602951849808
    },
    {
      "verse": "2:83",
      "similarity": 0.36332848685262104
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005070.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005070.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:70.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}