{
  "chapter": "المائدة",
  "text": "وحسبوا۟ الا تكون فتنة فعموا۟ وصموا۟ ثم تاب الله عليهم ثم عموا۟ وصموا۟ كثير منهم والله بصيرۢ بما يعملون",
  "translations": [
    {
      "translation": "They thought there would be no fitna. They were blind and deaf. Then Allah turned towards them. Then",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And imagined that no trials would befall them; and they turned deaf and blind (to the truth). But God still turned to them; yet many of them turned blind and deaf again; but God sees everything they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "thinking that no harm would come from it. Thus they became blind and deaf (to the Truth). Thereafter Allah turned towards them in gracious forgiveness; but many of them became even more deaf and blind (to the Truth). Allah sees all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were blind and deaf in their pride, thinking themselves (to be the chosen nation of God) and thus safe from calamities. God forgave them but many of them out, of pride, again became blind and deaf. God is Well Aware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they assumed that there will be no punishment, so they turned blind and deaf – then Allah accepted their penance, then again many of them turned blind and deaf; and Allah is seeing their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They thought there will be no Fitnah (trial or punishment), so they became blind and deaf; after that Allah turned to them (with forgiveness); yet again many of them became blind and deaf. And Allah is the All-Seer of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they thought that there would be no affliction, so they became blind and deaf; then Allah turned to them mercifully, but many of them became blind and deaf; and Allah is well seeing what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they supposed there should be no trial; but blind they were, and deaf. Then God turned towards them; then again blind they were, many of them, and deaf; and God sees the things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They thought no harm would come of it, so they were wilfully blind and deaf. And afterward Allah turned (in mercy) toward them. Now (even after that) are many of them wilfully blind and deaf. Allah is Seer of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they imagined that no harm would come to them; and so they became blind and deaf [of heart]. God turned to them in mercy; yet again many of them became blind and deaf. God is fully aware of their actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they imagined that there would be no trial; so they blinded and deafened themselves. Thereafter Allah relented toward them, then they again blinded and deafened themselves. And Allah is Beholder of that which they Work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They supposed there would be no testing, so they became blind and deaf. Thereafter Allah accepted their repentance, yet [again] many of them became blind and deaf, and Allah watches what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They thought there would be no trial (or punishment); so they became blind and deaf; yet Allah (in mercy) turned to them; yet again many of them became blind and deaf. But Allah sees well all that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They thought there will be no Fitnah (trial or punishment), so they became blind and deaf; after that Allah turned to them (with Forgiveness); yet again many of them became blind and deaf. And Allah is the All-Seer of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They thought there would be no trial; so they were blind and deaf. Then Allah turned towards them; then again many of them were blind and deaf. And Allah is the Seer of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They assumed there would be no punishment, so they turned blind and deaf. Then God redeemed them, but then again many of them turned blind and deaf. But God is Seeing of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they thought there would be no [resulting] punishment, so they became blind and deaf. Then Allah turned to them in forgiveness; then [again] many of them became blind and deaf. And Allah is Seeing of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:71] And they thought, they presumed that, there would be no (read as an lā takūnu, where an has been softened; or read an lā takūna, where it [an] requires a [following] subjunctive, that is to say, ‘that there would [not] befall [them]’) trial, a punishment against them, for their denial of the messengers and their slaying of them; and so they were wilfully blind, to the truth and could not see it, and deaf, [unable] to hear it. Then God relented to them, when they repented, then they were wilfully blind and deaf, a second time, many of them (kathīrun minhum substitutes for the [third] person [‘they’]); and God sees what they do, and will requite them for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They thought no harm would come of it,) no misfortune would ensue; it is also said that: they thought that their hearts would not be corrupted because of denying and killing messengers (so they were wilfully blind) and did not see guidance (and deaf) such that they did not hear the Truth deep in their hearts. They disbelieved and then they believed and repented from their disbelief. (And afterward Allah turned (in mercy) towards them) He forgave them. (Now (even after that) are many of them wilfully blind) do not see guidance and died in this state (and deaf) such they do not hear the Truth and become disbelievers. (Allah is Seer of what they do) in their disbelief in terms of denying and killing the prophets.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } هم من غاية عمههم وانهماكهم في الإعراض عن الحق { حَسِبُوۤاْ } وظنوا { أَلاَّ تَكُونَ } وتدور عليهم { فِتْنَةٌ } مصيبة وبلاء بواسطة التكذيب والقتل { فَعَمُواْ } عن أمارات الدين\n وعلامات اليقين { وَصَمُّواْ } عن استماع دلائل التوحيد والعرفان { ثُمَّ } بعدما تنبهوا تابوا مخلصين { تَابَ ٱللَّهُ عَلَيْهِمْ } عفا عنهم وقَبِل توبتهم\n ثم بعدما تابوا { ثُمَّ عَمُواْ وَصَمُّواْ كَثِيرٌ مِّنْهُمْ } كرةً أخرى\n لخباثتهم الجبلية { وَٱللَّهُ } المطلع لجميع حالاتهم { بَصِيرٌ } خبير { بِمَا يَعْمَلُونَ } [المائدة: 71] بمقتضى أهويتهم الباطلة يجازيهم على مقتضى علمه وخبرته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "47:23",
      "similarity": 0.7177800009225624
    },
    {
      "verse": "43:40",
      "similarity": 0.6996999279509234
    },
    {
      "verse": "11:24",
      "similarity": 0.6527031960739321
    },
    {
      "verse": "25:73",
      "similarity": 0.56689380447111
    },
    {
      "verse": "10:42",
      "similarity": 0.5251489400034413
    }
  ]
}