{
  "chapter": "المائدة",
  "text": "لقد كفر الذين قالوا۟ ان الله هو المسيح ابن مريم وقال المسيح يبنى اسرءيل اعبدوا۟ الله ربى وربكم انه من يشرك بالله فقد حرم الله عليه الجنة وماوىه النار وما للظلمين من انصار",
  "translations": [
    {
      "translation": "Those who say that the Messiah, son of Maryam, is Allah are kafirun. The Messiah said, 'Tribe of Israel! worship Allah, my Lord and your Lord. If anyone associates anything with Allah, Allah has forbidden him the Garden and his refuge will be the Fire.' The wrongdoers will have no helpers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are surely infidels who say: \"God is the Christ, son of Mary.\" But the Christ had only said: \"O children of Israel, worship God who is my Lord and your Lord.\" Whosoever associates a compeer with God, will have Paradise denied to him by God, and his abode shall be Hell; and the sinners will have none to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely they disbelieved when they said: 'Christ, the son of Mary, is indeed God'; whereas Christ had said: 'Children of Israel! Serve Allah, Who is your Lord and my Lord.' Allah has forbidden Paradise to those who associate anything with Him in His divinity and their refuge shall be the Fire. No one will be able to help such wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say that Jesus, the son of Mary, is God, have, in fact, turned to disbelief. Jesus said to the Israelites, \"Worship God, my Lord and yours. God will deprive anyone who considers anything equal to God of Paradise and his dwelling will be fire. The unjust people have no helpers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are certainly disbelievers who say, “Allah is actually the Messiah, the son of Maryam”; whereas the Messiah had said, “O Descendants of Israel, worship Allah Who is my Lord and (also) your Lord”; undoubtedly whoever ascribes partners with Allah, then Allah has forbidden Paradise for him; his destination is hell; and the unjust do not have any supporters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, they have disbelieved who say: \"Allah is the Messiah [`Isa], son of Maryam.\" But the Messiah said: \"O Children of Israel! worship Allah, my Lord and your Lord.\" Verily, whosoever sets up partners (in worship) with Allah, then Allah has forbidden Paradise for him, and the Fire will be his abode. And for the wrongdoers there are no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly they disbelieve who say: Surely Allah, He is the Messiah, son of Marium; and the Messiah said: O Children of Israel! serve Allah, my Lord and your Lord. Surely whoever associates (others) with Allah, then Allah has forbidden to him the garden, and his abode is the fire; and there shall be no helpers for the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are unbelievers who say, 'God is the Messiah, Mary's son.' For the Messiah said, 'Children of Israel, serve God, my Lord and your Lord. Verily whoso associates with God anything, God shall prohibit him entrance to Paradise, and his refuge shall be the Fire; and wrongdoers shall have no helpers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They surely disbelieve who say: Lo! Allah is the Messiah, son of Mary. The Messiah (himself) said: O Children of Israel, worship Allah, my Lord and your Lord. Lo! whoso ascribeth partners unto Allah, for him Allah hath forbidden paradise. His abode is the Fire. For evil-doers there will be no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, they are deniers of the truth who say, \"God is the Christ, the son of Mary.\" For the Christ himself said, \"Children of Israel, serve God, my Lord and your Lord.\" If anyone associates anything with God, God will forbid him the Garden and the Fire will be his home. The wrongdoers shall have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly they have disbelieved who say: verily God: He is the Masih, son of Maryam, whereas the Masih had said: Children of Isra'il! worship Allah, mine Lord and your Lord; verily whosoever associateth aught with Allah, Allah shall surely forbid the Garden unto him, and his resort is the Fire; and for the wrong-doers there shall be no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are certainly faithless who say, ‘Allah is the Messiah, son of Mary.’ But the Messiah had said, ‘O Children of Israel! Worship Allah, my Lord, and your Lord. Indeed whoever ascribes partners to Allah, Allah shall forbid him [entry into] paradise, and his refuge shall be the Fire, and the wrongdoers will not have any helpers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do blaspheme who say: \"Allah is Christ the son of Mary.\" But said Christ: \"O Children of Israel! worship Allah, my Lord and your Lord.\" Whoever joins other gods with Allah,- Allah will forbid him the garden, and the Fire will be his abode. There will for the wrong-doers be no one to help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, they have disbelieved who say: \"Allah is the Messiah ['Iesa (Jesus)], son of Maryam (Mary).\" But the Messiah ['Iesa (Jesus)] said: \"O Children of Israel! Worship Allah, my Lord and your Lord.\" Verily, whosoever sets up partners in worship with Allah, then Allah has forbidden Paradise for him, and the Fire will be his abode. And for the Zalimun (polytheists and wrong-doers) there are no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers are those who say: 'Allah is the Messiah, the son of Mary' But the Messiah said: 'Children of Israel, worship Allah, my Lord and your Lord. 'He who associates anything with Allah, Allah has indeed forbidden Paradise to him, and his abode shall be in the Fire. The harmdoers shall have no helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They disbelieve those who say, “God is the Messiah the son of Mary.” But the Messiah himself said, “O Children of Israel, worship God, my Lord and your Lord. Whoever associates others with God, God has forbidden him Paradise, and his dwelling is the Fire. The wrongdoers have no saviors.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have certainly disbelieved who say, \"Allah is the Messiah, the son of Mary\" while the Messiah has said, \"O Children of Israel, worship Allah, my Lord and your Lord.\" Indeed, he who associates others with Allah - Allah has forbidden him Paradise, and his refuge is the Fire. And there are not for the wrongdoers any helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:72] They indeed are disbelievers those who say, ‘Indeed God is the Messiah, son of Mary’ (a similar verse has preceded [Q. 5:17]). For the Messiah said, to them, ‘O Children of Israel, worship God, my Lord and your Lord, for, I am a servant and not a god. Verily he who associates anything with God, in worship, for him God has made Paradise forbidden, He has forbidden him admittance to it, and his abode shall be the Fire; and for wrongdoers (wa-mā li’l-zālimīna min, the min is extra) there shall be no helpers’, to guard them against the chastisement of God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They surely disbelieve who say : Lo! Allah is the Messiah, son of Mary) this is the claim of the Nestorians. (The Messiah (himself) said : Children of Israel, worship Allah) declare Allah's divine Oneness, (my Lord and your Lord. Lo! whoso ascribeth partners unto Allah) and dies in this state, (for him Allah hath forbidden Paradise. His abode) his end result (is the Fire. For evil-doers) idolaters (there will be no helpers) to save them from what is intended for them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ اعبدوا الله ربي وربكم } أي: خصصوا عبادتكم بالذات الموصوفة بجميع الصفات والأسماء التي هي الوجود المطلق، ولا تعينوه باسم وصفة، فإنّ نسبة ربوبيته إلى الكل سواء ومن حصر ألوهيته في صورة وخصصها باسم معين وكلمة معينة وصفة معينة، فقد أثبت غيره ضرورة وجود ما سواه من الأسماء والصور والصفات. ومن أثبت غيره فقد أشرك به ومن أشرك به { فقد حرّم الله عليه } جنة شهوده بذاته وصفاته وأفعاله أي: الجنة المطلقة الشاملة، يعني: فقد حجبه مطلقاً { ومأواه } نار الحرمان لظلمه بالشرك { وما للظالمين من أنصار } ينصرونهم فينقذونهم من العذاب.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَقَدْ كَفَرَ ٱلَّذِينَ قَالُوۤاْ } من غاية جهلهم بقدر الله وما يليق بجانبه: { إِنَّ ٱللَّهَ } المتجلي على عروش الذرائر الكائنة شهادة وغيباً { هُوَ ٱلْمَسِيحُ ٱبْنُ مَرْيَمَ } أي: متحد به محصور عليه\n إفراطاً وعلواً { وَقَالَ ٱلْمَسِيحُ } لهم حين سمع منهم ما قالوا: { يَابَنِيۤ إِسْرَائِيلَ } التائهين بتيه الجهل والإفراط { ٱعْبُدُواْ ٱللَّهَ } المنزه عن الحصر والحلول والاتحاد بل هو { رَبِّي } رباني بأنواع اللطف والكرم\n\n\n{ وَرَبَّكُمْ } أيضاً بإفاضة العقل الموصل إلى معرفة توحيده\n لا فرق بيني وبينكم في العبودية والربوبية\n لا تشركوا معه\n ولا تحصروه فيّ { إِنَّهُ مَن يُشْرِكْ بِٱللَّهِ } المنزه عن الشريك مطلقاً غيرَه من مخلوقاته { فَقَدْ حَرَّمَ ٱللَّهُ عَلَيهِ ٱلْجَنَّةَ } التي هي منزل السعداء الموحدين { وَمَأْوَاهُ ٱلنَّارُ } المعدة للأشقياء الظالمين\n المشركين { وَ } اعلموا أن { مَا لِلظَّالِمِينَ } المفترين على الله ما هو بريء عنه بذاته { مِنْ أَنصَارٍ } [المائدة: 72] ينصرونهم ويشفعون لهم عند أخذ سبحانه وبطشه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { لقد كفر الذين قالوا إن الله هو المسيح ابن مريم } \n لِما رأوا على يديه من الخوارق\n { وقال المسيح يا بني إسرائيل اعبدوا الله ربي وربكم } المعنى: لقد كفر من اتخذ عيسى إلهًا مع أنه كان يتبرأ من هذا الاعتقاد\n ويقول لبني إسرائيل: اعبدوا الله خالقي وخالقكم\n والمشهور في الأخبار\n أن النصارى هم الذين اعتقدوا هذا الاعتقاد دون بني إسرائيل\n نعم\n أصل دخول هذه الشبهة على النصارى من يهودي يقال له: بولس\n حسدًا منه\n وذلك أنه دخل في دينهم\n وفرق أموالهم\n وتأهب للتعبد معهم\n ثم سار إلى بيت المقدس وقطّع نفسه تقربًا عند قبري مريم وعيسى ـ عليهما السلام ـ في زعمهم\n وكان معه رجلان اسمهما: يعقوب وناسور\n فأخذ يعلمهما ذلك الفساد ويقول لهما: عيسى هو الله أو ابن الله\n فلما قطع نفسه صار الرجلان يُفشيان ذلك عنه\n فشاع مذهب الرجلين\n وكان منهما الطائفة اليعقوبية والناسورية\n ثم هددهم على الشرك فقال\n أي: عيسى: { إنه من يشرك بالله } في عبادته\n أو فيما يختص به من الصفات والأفعال\n { فقد حرم الله عليه الجنة } أي: يمنع من دخولها لأنها دار الموحدين\n { ومأواه النار } أي: محله النار\n لأنها معدة للمشركين\n { وما للظالمين من أنصار } أي: وما لهم أحد ينصرهم من النار\n ووضع المظهر موضع المضمر\n تسجيلاً على أنهم ظلموا بالإشراك\n وعدلوا عن طريق الحق\n وهو يحتمل أن يكون من تمام كلام عيسى عليه السلام\n أو من كلام الله تعالى\n ثم ذكر تعالى صنفًا آخر منهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:17",
      "similarity": 0.599386236546558
    },
    {
      "verse": "3:45",
      "similarity": 0.5387889544419253
    },
    {
      "verse": "5:75",
      "similarity": 0.4558977139747801
    },
    {
      "verse": "9:31",
      "similarity": 0.4083453428715616
    },
    {
      "verse": "4:157",
      "similarity": 0.3193063142063306
    }
  ]
}