{
  "chapter": "المائدة",
  "text": "لقد كفر الذين قالوا۟ ان الله ثالث ثلثة وما من اله الا اله وحد وان لم ينتهوا۟ عما يقولون ليمسن الذين كفروا۟ منهم عذاب اليم",
  "translations": [
    {
      "translation": "Those who say that Allah is the third of three are kafirun. There is no god but One God. If they do not stop saying what they say, a painful punishment will afflict those among them who are kafir.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Disbelievers are they surely who say: \"God is the third of the trinity;\" but there is no god other than God the one. And if they do not desist from saying what they say, then indeed those among them who persist in disbelief will suffer painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who said: 'Allah is one of the Three', certainly they disbelieved, for there is no god save the One God. And if they do not give up this claim, all who have disbelieved among them shall be subjected to painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who say that God is the third of the Three, have, in fact, turned to disbelief. There is no Lord but God, the only One Lord. If they will not give-up such belief, the disbelievers among them will suffer a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are certainly disbelievers who say, “Indeed Allah is the third of the three Gods”; whereas there is no God except the One God; and if they do not desist from their speech, undoubtedly a painful punishment will reach those among them who die as disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, they have disbelieved who say: \"Allah is the third of three.\" And there is no god but One God (Allah). And if they cease not from what they say, verily, a painful torment will befall on the disbelievers among them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly they disbelieve who say: Surely Allah is the third (person) of the three; and there is no god but the one Allah, and if they desist not from what they say, a painful chastisement shall befall those among them who disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are unbelievers who say, 'God is the Third of Three. No god is there but One God. If they refrain not from what they say, there shall afflict those of them that disbelieve a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They surely disbelieve who say: Lo! Allah is the third of three; when there is no Allah save the One Allah. If they desist not from so saying a painful doom will fall on those of them who disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are deniers of the truth who say, \"God is one of three.\" There is only One God. If they do not desist from so saying, a painful punishment is bound to befall such of them as are bent on denying the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly they disbelieve who say: God is the third of the three; whereas there is no god except the One God. And if they desist not from that which they say, there shall surely befall those of them who have disbelieved a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are certainly faithless who say, ‘Allah is the third [person] of a trinity,’ while there is no god except the One God. If they do not relinquish what they say, there shall befall the faithless among them a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do blaspheme who say: Allah is one of three in a Trinity: for there is no god except One Allah. If they desist not from their word (of blasphemy), verily a grievous penalty will befall the blasphemers among them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, disbelievers are those who said: \"Allah is the third of the three (in a Trinity).\" But there is no ilah (god) (none who has the right to be worshipped) but One Ilah (God -Allah). And if they cease not from what they say, verily, a painful torment will befall the disbelievers among them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who say: 'Allah is the third of the Trinity' became unbelievers. There is but One God. If they do not desist in what they say, a painful punishment will afflict those of them that disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They disbelieve those who say, “God is the third of three.” But there is no deity except the One God. If they do not refrain from what they say, a painful torment will befall those among them who disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have certainly disbelieved who say, \"Allah is the third of three.\" And there is no god except one God. And if they do not desist from what they are saying, there will surely afflict the disbelievers among them a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:73] They are indeed disbelievers those who say, ‘God is the third of three’, gods, that is, He is one of them, the other two being Jesus and his mother, and they [who claim this] are a Christian sect; when there is no god but the One God. If they do not desist from what they say, when they declare a trinity, and profess His Oneness, those of them who disbelieve, that is, [those] who are fixed upon unbelief, shall suffer a painful chastisement, namely, the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They surely disbelieve who say: Lo! Allah is the third of three) this is the claim of the Marqusiyyah; they claim that there is a father, a son and a holy Spirit; (when there is no God) for the dwellers of the heavens and the earth (save the One God) who has no son or partner. (If they desist not from so saying) He says: if the Jews and Christians do not repent of what they are saying (a painful doom will fall on those of them who disbelieve) the pain of which will extend to their hearts.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لقد كفر } حجب { الذين قالوا إنّ الله ثالث ثلاثة } واحد من جملة ثلاثة أشياء: الفعل الذي هو ظاهر عالم الملك\n والصفة التي هي باطن عالم الملكوت\n والذات التي تقوم بها الصفة ويصدر عنها الفعل\n إذ ليس هو ذلك الواحد الذي توهموه بل الفعل والصفة في الحقيقة عين الذات\n ولا فرق إلا بالاعتبار\n وما الله إلاّ الواحد المطلق\n وإلا لكان بحسب كل اسم من أسمائه إله آخر\n فتعدّد الآلهة سبحانه وتعالى عما يقول الظالمون علوّاً كبيراً { وإن لم ينتهوا عما يقولون } من كون الصفة والفعل غير الذات { ليمسنّ } المحجوبين { عذاب } مؤلم لقصورهم في العرفان مع كونهم مستعدّين { أفلا يتوبون إلى الله } بالرجوع عن إثبات التعدّد في الله إلى عين الجمع المطلق\n ويستغفرونه عن ذنب رؤية وجودهم ووجود غيرهم { والله غفور } يسترهم بذاته { رحيم } يرحمهم بكمال العرفان والتوحيد { ما لا يملك لكم ضرّاً ولا نفعاً } إذ لا فعل له فيضرّ أو ينفع\n بل لا وجود فضلاً عن الفعل\n وقال: ما لا يملك دون من\n وإن كان المراد عيسى للتنبيه على أنه شيء يعتبر اعتباراً من حيث تعينه ولا وجود له حقيقة { قد ضلّوا من قَبل } بالاحتجاب عن أنوار الصفات { وأضلّوا كثيراً وضلّوا } الآن { عن سواء السبيل } طريق الوحدة الذاتية التي هي الاستقامة إلى الله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَّقَدْ كَفَرَ ٱلَّذِينَ قَالُوۤاْ } من عدم تحققهم بمقام التوحيد\n وعدم تنبههم بمرتبة الفناء في الله: { إِنَّ ٱللَّهَ } المنزه عن التعدد\n بل عن العدد مطلقاً { ثَالِثُ ثَلاَثَةٍ } واحد منها وأراد بالثلاثة هو ومريم وعيسى { وَ } الحال أنه { مَا مِنْ إِلَـٰهٍ } أي: في الوجود موجود { إِلاَّ إِلَـٰهٌ } موجود { وَاحِدٌ } محير للعقول والأبصار\n ماحٍ لظلال السّوى الأغيار { وَإِن لَّمْ يَنتَهُواْ } هؤلاء الظَّلَمة { عَمَّا يَقُولُونَ } من التثليث والتعدد في الألوهية { لَيَمَسَّنَّ ٱلَّذِينَ كَفَرُواْ مِنْهُمْ } أي: بقوا على كفرهم بلا إيمان إلى أن ماتوا عليه { عَذَابٌ أَلِيمٌ } [المائدة: 73] لا عذاب أشد منه\n وهو حرمانهم عن مرتبة التوحيد التي هي مرتبة الخلافة والنيابة\n أتصرون على هذا الكفر والضلال؟\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { لقد كفر الذين قالوا إن الله ثالث ثلاثة } أي: أحد ثلاثة\n عيسى وأمه وهو ثالثهم\n أو أحد الأقانيم الثلاثة\n الأب والابن وروح القدس\n يريدون بالأب الذات\n وبالابن العلم\n وبروح القدس الحياة\n لكن في إطلاق هذا اللفظ إيهام وإيقاع للغير في الكفر\n وهذه المقالةـ أعني التثليث\n هي قوله النسطورية والملكانية\n وما سبق في قوله: { إن الله هو المسيح } قول اليعقوبية\n القائلة بالاتحاد\n وكلهم ضالون مضلون\n { وما من إله إلا إله واحد } في ذاته وصفاته وأفعاله\n لا شريك له في ألوهيته\n متصلاً ولا منفصلاً\n { وإن لم ينتهوا عما يقولون } \n ولم يوحدوا { ليمسن الذين كفروا منهم عذاب أليم } أي: ليمس الذين بقوا منهم على الكفر ولم يتوبوا\n عذاب موجع",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:18",
      "similarity": 0.419519243094531
    },
    {
      "verse": "56:7",
      "similarity": 0.4103289138653849
    },
    {
      "verse": "19:10",
      "similarity": 0.34752223065243776
    },
    {
      "verse": "53:20",
      "similarity": 0.3305578345387777
    },
    {
      "verse": "36:14",
      "similarity": 0.3301583840096955
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/5:73.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/5:73.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:73.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}