{
  "chapter": "المائدة",
  "text": "ما المسيح ابن مريم الا رسول قد خلت من قبله الرسل وامه صديقة كانا ياكلان الطعام انظر كيف نبين لهم الءايت ثم انظر انى يؤفكون",
  "translations": [
    {
      "translation": "The Messiah, the son of Maryam, was only a Messenger, before whom other Messengers came and went. His mother was a woman of truth. Both of them ate food. See how We make the Signs clear to them! Then see how they are perverted!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Christ, son of Mary, was but an apostle, and many apostles had (come and) gone before him; and his mother was a woman of truth. They both ate the (same) food (as men). Behold, how We show men clear signs, and behold, how they wander astray!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah, son of Mary, was no more than a Messenger before whom many Messengers have passed away; and his mother adhered wholly to truthfulness, and they both ate food (as other mortals do). See how We make Our signs clear to them; and see where they are turning away!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jesus, the son of Mary, was no more than a Messenger before whom there lived many other Messengers. His mother was a truthful woman and both of them ate earthly food. Consider how We explain the evidence (of the Truth) to them and see where they then turn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah, the son of Maryam, is purely a Noble Messenger; many Noble Messengers have passed before him; and his mother is a truthful woman; they both used to eat food; see how We make the signs clear for them, and see how they turn away!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah [`Isa], son of Maryam, was no more than a Messenger; many were the Messengers that passed away before him. His mother [Maryam] was a Siddiqah. They both used to eat food. Look how We make the Ayat clear to them; yet look how they are deluded away (from the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah, son of Marium is but an apostle; apostles before him have indeed passed away; and his mother was a truthful woman; they both used to eat food. See how We make the communications clear to them, then behold, how they are turned away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah, son of Mary, was only a Messenger; Messengers before him passed away; his mother was a just woman; they both ate food. Behold, how We make clear the signs to them; then behold, how they perverted are!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah, son of Mary, was no other than a messenger, messengers (the like of whom) had passed away before him. And his mother was a saintly woman. And they both used to eat (earthly) food. See how We make the revelations clear for them, and see how they are turned away!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Christ, son of Mary, was no more than a messenger. Many messengers passed away before him. His mother was a virtuous woman; and they both ate food [like other mortals]. See how We make the signs clear to them! See how they turn away!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Masih, son of Maryam, was naught but an apostle; surely there passed away apostles before him and his mother was a saintly woman; both of them were wont to eat food. Behold! how We expound unto them the evidences! Then behold! whither they are deviating!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah, son of Mary, is but an apostle. Certainly, [other] apostles have passed before him, and his mother was a truthful one. Both of them would eat food. Look how We clarify the signs for them, and yet, look, how they go astray!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Christ the son of Mary was no more than a messenger; many were the messengers that passed away before him. His mother was a woman of truth. They had both to eat their (daily) food. See how Allah doth make His signs clear to them; yet see in what ways they are deluded away from the truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah ['Iesa (Jesus)], son of Maryam (Mary), was no more than a Messenger; many were the Messengers that passed away before him. His mother [Maryam (Mary)] was a Siddiqah [i.e. she believed in the words of Allah and His Books (see Verse 66:12)]. They both used to eat food (as any other human being, while Allah does not eat). Look how We make the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) clear to them, yet look how they are deluded away (from the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah, the son of Mary, was not except a Messenger, other Messengers had gone before him. His mother was in the state of sincerity, they both ate food. See how We make plain to them Our signs. Then, see how perverted they are.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah son of Mary was only a messenger, before whom other Messengers had passed away, and his mother was a woman of truth. They both used to eat food. Note how We make clear the revelations to them; then note how deluded they are.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messiah, son of Mary, was not but a messenger; [other] messengers have passed on before him. And his mother was a supporter of truth. They both used to eat food. Look how We make clear to them the signs; then look how they are deluded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:75] The Messiah, son of Mary, was only a messenger; messengers passed away before him, and so he passed away like them, for he is not a god as they claim, otherwise he would not have passed away; his mother was a truthful woman, [siddīqa means] extremely truthful; they both used to eat food, like all other human beings, and one who is such cannot be a god because of his compound being and fallible nature, and because of the [impurities such as] urine and excrement that he produces. Behold, in amazement, how We make the signs, of Our Oneness, clear to them, then behold, how they are turned away!, [how] they are turned away from the truth despite the proof being established.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف لتبيان وصف المسيح في نفس الأمر ووصففِ أمّه زيادة في إبطال معتقد النّصارى إلهيّة المسيح وإلهيّة أمّه ، إذ قد عُلم أنّ قولهم { إنّ الله ثالث ثلاثة } \\[ المائدة : 73 \\] أرادوا به إلهيّة المسيح . وذلك مُعتقد جميع النّصارى . وفرّعت طائفة من النّصارى يُلَقَّبون ( بالرّكُوسِيَّةِ ) ( وهم أهل ملّة نصرانيّة صابئة ) على إلهيةِ عيسى إلهيَّةَ أمّه ولولا أنّ ذلك معتقدهم لما وقع التّعرض لوصف مَريم ولا للاستدلال على بَشَرِيَّتها بأنّهما كانا يأكلان الطّعام .فقوله : { ما المسيح ابن مريم إلاّ رسول } قصرُ موصوففٍ على صفة ، وهو قصر إضافي ، أي المسيح مقصور على صفة الرّسالة لا يتجاوزها إلى غيرها ، وهي الإلهيّة . فالقصر قصر قلب لردّ اعتقاد النّصارى أنّه الله .وقوله : { قد خلت من قبله الرّسل } صفة لرسول أريد بها أنّه مساو للرّسل الآخرين الّذين مضوا قبله ، وأنّه ليس بدعا في هذا الوصف ولا هو مختصّ فيه بخصوصيّة لم تكن لغيره في وصف الرّسالة ، فلا شبهة للّذين ادّعوا له الإلهيّة ، إذ لم يجىء بشيء زائد على ما جاءت به الرسل ، وما جرت على يديه إلاّ معجزات كما جرت على أيدي رُسل قبله ، وإن اختلفت صفاتها فقد تساوت في أنّها خوارق عادات وليس بعضها بأعجب من بعض ، فما كان إحياؤه الموتى بحقيق أن يوهم إلهيّتَه . وفي هذا نداء على غباوة القوم الّذين استدلّوا على إلهيّته بأنّه أحيا الموتى من الحيوان فإنّ موسى أحيا العصا وهي جماد فصارت حيّة .وجملة { وأمّه صدّيقة } معطوفة على جملة { ما المسيح ابن مريم إلاّ رسول } . والقصد من وصفها بأنّها صدّيقة نفيُ أن يكون لها وصف أعلى من ذلك ، وهو وصف الإلهيّة ، لأنّ المقام لإبطال قول الّذين قالوا إنّ الله ثالث ثلاثة ، إذْ جعلوا مريم الأقنوم الثالث . وهذا هو الّذي أشار إليه قول صاحب «الكشاف» إذ قال «أي وما أمّه إلاّ صديقة» مع أنّ الجملة لا تشتمل على صيغة حَصر . وقد وجّهه العلامة التفتزاني في «شرح الكشّاف» بقوله : «الحصر الّذي أشار إليه مستفاد من المقام والعطف» ( أي من مجموع الأمرين ) . وفي قول التفتزاني : والعطف ، نظر .والصدِّيقة صيغة مبالغة ، مثل شِرِّيب ومسِّيك ، مبالغة في الشُّرب والمَسْك ، ولَقَببِ امرىء القيس بالمَلك الضّلِّيل ، لأنّه لم يهتد إلى ما يسترجع به مُلك أبيه . والأصل في هذه الصيغة أن تكون مشتقّة من المجرّد الثّلاثي . فالمعنى المبالغة في وصفها بالصدق ، أي صدق وعد ربّها ، وهو ميثاق الإيمان وصدقُ وعد النّاس . كما وُصف إسماعيل عليه السّلام بذلك في قوله تعالى : { واذكر في الكتاب إسماعيل إنّه كان صادق الوعد } \\[ مريم : 54 \\] . وقد لقّب يوسف بالصدّيق ، لأنّه صَدَق وعد ربّه في الكفّ عن المحرّمات مع توفر أسبابها .وقيل : أريد هنا وصفها بالمبالغة في التّصديق لقوله تعالى : { وصدّقت بكلمات ربّها } \\[ التحريم : 12 \\] ، كما لقّب أبو بكر بالصدّيق لأنّه أوّل من صدّق رسول الله صلى الله عليه وسلم كما في قوله تعالى : { والّذي جاء بالصّدق وصدّق به } \\[ الزمر : 33 \\] ، فيكون مشتقّاً من المزيد .وقوله : { كانا يأكلان الطّعام } جملة واقعة موقع الاستدلال على مفهوم القصر الّذي هو نفي إلهيّة المسيح وأمّه ، ولذلك فصلت عن الّتي قبلها لأن الدّليل بمنزله البيان ، وقد استدلّ على بشريتهما بإثبات صفة من صفات البشر ، وهي أكل الطّعام . وإنَّما اختيرت هذه الصّفة من بين صفات كثيرة لأنّها ظاهرة واضحة للنّاس ، ولأنّها أثبتتها الأناجيل؛ فقد أثبتت أنّ مريم أكلت ثَمر النخلة حين مخاضها ، وأنّ عيسى أكل مع الحواريين يوم الفِصْح خبزاً وشرب خمراً ، وفي إنجيل لوقاً إصحاح22 «وقال لهم اشتهيت أن آكل هذا الفِصحَ معكم قبل أن أتألّم لأنّي لا آكل منه بعدُ ، وفي الصبح إذْ كان راجعاً في المدينة جاع» .وقوله : { انظر كيف نبيّن لهم الآيات } استئناف للتعجيب من حال الّذين ادّعوا الإلهيّة لعيسى . : والخطاب مراد به غيرُ معيّن ، وهو كلّ من سمع الحجج السابقة . واستُعمل الأمر بالنّظر في الأمر بالعِلم لتشبيه العالم بالرأي والعلممِ بالرؤية في الوضوح والجلاء ، وقد تقدّمت نظائره . وقد أفاد ذلك معنى التعجيب . ويجوز أن يكون الخطاب للرّسول عليه السّلام . والمراد هو وأهل القرآن . و { كيف } اسم استفهام معلِّق لفعل { انظر } عن العمل في مفعولين ، وهي في موضع المفعول به ل { انظر } ، والمعنى انظر جواب هذا الاستفهام . وأريد مع الاستفهام التعجيب كناية ، أي انظر ذلك تجد جوابك أنّه بيان عظيم الجلاء يتعجّب النّاظر من وضوحه . والآيات جمع آية ، وهي العلامة على وجود المطلوب ، استعيرت للحجّة والبرهان لشبهه بالمكان المطلوب على طريق المكنية ، وإثبات الآيات له تخييل ، شبّهت بآيات الطّريق الدّالة على المكان المطلوب .وقوله : { ثمّ انظر أنّى يؤفكون } ( ثمّ ) فيه للترتيب الرتبي والمقصود أنّ التأمّل في بيان الآيات يقتضي الانتقال من العجب من وضوح البيان إلى أعجب منه وهو انصرافهم عن الحقّ مع وضوحه . و { يؤفكون } يصرفون ، يقال : أفكَهُ من باب ضَرب ، صَرفه عن الشّيء .و { أنَّى } اسم استفهام يستعمل بمعنى من أين ، ويستعمل بمعنى كيف . وهو هنا يجوز أن يكون بمعنى كيفَ ( كما ) في «الكشاف» ، وعليه فإنّما عدل عن إعادة { كيف } تفنّناً . ويجوز أن تكون بمعنى من أين ، والمعنى التعجيب من أين يتطرّق إليهم الصّرف عن الاعتقاد الحقّ بعد ذلك البيان المبالغ غاية الوضوح حتّى كان بمحلّ التّعجيب من وضوحه . وقد علّق ب { أنَّى } فعل { انظر } الثّاني عن العمل وحذف متعلّق { يؤفكون } اختصاراً ، لظهور أنّهم يصرفون عن الحقّ الّذي بيّنته لهم الآيَات .\n\n",
      "translations": [
        {
          "translation": "(The Messiah, son of Mary, was no other than a messenger) sent to people, (messengers (the like of whom) had passed away before him. And his mother was a saintly woman. And they both used to eat (earthly) food) they were both servants who used to eat food. (See) Muhammad (how we make the revelations) the signs that Jesus and his mother were not gods (clear for them, and see) Muhammad (how they are turned away) through lies!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَنَّىٰ يُؤْفَكُونَ } معناهُ كَيفَ يَصُدونَ عَن الدِّين والخَيرِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {How can they be deluded?} Its meaning is: How can they turn away from the religion and good?",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مَّا ٱلْمَسِيحُ ٱبْنُ مَرْيَمَ إِلاَّ رَسُولٌ } من الرسل العظام { قَدْ خَلَتْ } مضت { مِن قَبْلِهِ ٱلرُّسُلُ } مثله: ولم ينسبهم أحد إلى ما نسبوه { وَأُمُّهُ } أيضاً { صِدِّيقَةٌ } مقبولة عند الله\n قد مضت مثلها كثيرة من الصادقات المقبولات\n لم ينسبها أحد إلى ما نسبتموها وبالجلمة: كيف ينسبونها إلى الألوهية { كَانَا } مركَّبان { يَأْكُلاَنِ ٱلطَّعَامَ } بدلاً لا يتحلل والإله منزةٌ عن التركيب والتحليل\n والأكل والشرب\n والأبوة والأمومة وغيرها من أوصاف البشر { ٱنْظُرْ } أيها الناظر متعجباً { كَيْفَ نُبَيِّنُ } ونوضح { لَهُمُ ٱلآيَاتِ } الدلائل القاطعة\n الدالة على عدم ليقاتها بمرتبة الألوهية\n مع أنه لا حاجة إلى الدليل أصلاً عند من له أدنى درية { ثُمَّ ٱنْظُرْ } وازدد في تعجبك { أَنَّىٰ } كيف { يُؤْفَكُونَ } [المائدة: 75] يصرفون وجوه عقولهم عن طريق الحق وإسماع كلمة التوحيد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم رد عليهم بقوله: { ما المسيح ابن مريم إلا رسول } بشر { قد خلت من قبله الرسل } \n وخصه الله بآيات\n كما خصهم بها\n فإن كان قد أحيا الله الموتى على يديه\n فقد أحيا العصى\n وجعلها حية تسعى على يد موسى\n بل هو أعجب\n وإن كان قد خلقه الله من غير أب\n فقد خلق آدم من غير أب وأم\n وهو أغرب\n { وأمه صديقة } فقط\n كسائر النساء اللاتي يلازمن الصدق أو التصديق\n { كانا يأكلان الطعام } ويفتقران إليه افتقار الحيوانات\n قال البيضاوي: بيّن أولاً أقصى مالهما من الكمال\n ودل أنه لا يوجب لهما ألوهية لأن كثيرًا من الناس يشاركهما في مثله\n ثم نبه على نقصهما\n وذكر ما ينافي الربوبية ويقتضي أن يكون من عداد المركبات الكائنة الفاسدة\n أي: القابلة للفساد\n ثم عجب ممن يدعي الربوبية لهما مع أمثال هذه الأدلة الظاهرة\n فقال: { انظر كيف نبين لهم الآيات ثم انظر أنا يؤفكون } أي: كيف يُصرفون عن استماع الحق وتأمله\n و { ثم } للتفاوت بين العجبين\n أي: أن بياننا للآيات عجب\n وإعراضهم عنها أعجب\n\nهـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:17",
      "similarity": 0.5248647614836314
    },
    {
      "verse": "5:72",
      "similarity": 0.45589771397478
    },
    {
      "verse": "3:45",
      "similarity": 0.4401618523794099
    },
    {
      "verse": "40:62",
      "similarity": 0.3564198522206852
    },
    {
      "verse": "43:87",
      "similarity": 0.3462221594484463
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005075.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005075.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:75.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}