{
  "chapter": "المائدة",
  "text": "قل اتعبدون من دون الله ما لا يملك لكم ضرا ولا نفعا والله هو السميع العليم",
  "translations": [
    {
      "translation": "Say: 'Do you worship, besides Allah, something which has no power to harm or help you when Allah is the All-Hearing, the All-Knowing?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"Leaving God aside, will you worship something that has no power over your loss or gain?\" But God is all-hearing and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Do you serve, beside Allah, that which has no power either to harm or benefit you, whereas Allah alone is All-Hearing, All-Knowing?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say to them, \"Do you worship things besides God which can neither harm or benefit you?\" It is only God who is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “What! You worship, other than Allah, that which is neither the controller of your losses nor of your benefits? And Allah only is the All Hearing, the All Knowing.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"How do you worship besides Allah something which has no power either to harm or to benefit you But it is Allah Who is the All-Hearer, All-Knower.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Do you serve besides Allah that which does not control for you any harm, or any profit? And Allah-- He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Do you serve, apart from God, that which cannot hurt or profit you? God is the All-hearing, the All-knowing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Serve ye in place of Allah that which possesseth for you neither hurt nor use? Allah it is Who is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Do you worship something other than God, that has no power to do you harm or good? God alone is the All Hearing and All Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: worship ye, beside Allah, that which availeth you not for hurt nor for profit! whereas Allah! He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Do you worship, besides Allah, what has no power to bring you any benefit or harm, while Allah—He is the All-hearing, the All-knowing?!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Will ye worship, besides Allah, something which hath no power either to harm or benefit you? But Allah,- He it is that heareth and knoweth all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW to mankind): \"How do you worship besides Allah something which has no power either to harm or to benefit you? But it is Allah Who is the All-Hearer, All-Knower.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Will you worship instead of Allah that which owns neither harm, nor benefit for you? Allah is the Hearer, Knower'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Do you worship, besides God, what has no power to harm or benefit you?” But God: He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Do you worship besides Allah that which holds for you no [power of] harm or benefit while it is Allah who is the Hearing, the Knowing?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:76] Say: ‘Do you worship besides God, that is, other than Him, what cannot hurt or profit you? God is the Hearer, of your sayings, the Knower’, of your circumstances (the interrogative is meant as a disavowal).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلمّا كان الكلام السابق جارياً على طريقة خطاب غير المعيّن كانت جملة { قل أتعبدون من دون الله } الخ مستأنفة ، أمر الرّسول بأن يبلّغهم ما عنوا به .والظاهر أنّ { أتعبدون } خطاب لجميع من يعبد شيئاً من دون الله من المشركين والنّصارى . والاستفهام للتّوبيخ والتّغليط مجازاً .ومعنى { من دون الله } غير الله . فمِن للتّوكيد ، و ( دون ) اسم للمغاير ، فهو مرادف لسوى ، أي أتعبدون معبوداً هو غير الله ، أي أتشركون مع الله غيره في الإلهيّة . وليس المعنى أتعبدون معبوداً وتتركون عبادة الله . وانظر ما فسّرنا به عند قوله تعالى : { ولا تسبّوا الّذين يدعون من دون الله } في سورة الأنعام ( 108 ) ، فالمخاطبون كلّهم كانوا يعبدون الله ويشركون معه غيره في العبادة حتّى الّذين قالوا إنّ الله هو المسيح ابن مريم فهم ما عبدوا المسيح إلاّ لزعمهم أنّ الله حلّ فيه فقد عبدوا الله فيه ، فشمل هذا الخطاب المشركين من العرب ونصارى العرب كلَّهم .ولذلك جيء بما } الموصولة دون ( مَن ) لأنّ معظمَ ما عبد من دون الله أشياء لا تَعْقل ، وقد غلب ( ما ) لما لا يعقل . ولو أريد ب { ما لا يَملك } عيسى وأمّه كما في «الكشاف» وغيره وجعل الخطاب خاصّاً بالنّصارى كان التّعبير عنه ب { ما } صحيحاً لأنّها تستعمل استعمال ( مَن ) ، وكثير في الكلام بحيث يكثر على التّأويل . ولكن قد يكون التّعبير بمَن أظهر .ومعنى { لا يملك ضَرّاً } لا يقدر عليه ، وحقيقة معنى الملك التمكّن من التّصرف بدون معارض ، ثم أطلق على استطاعة التّصرّف في الأشياء بدون عَجز ، كما قال قَيس بن الخَطِيم :مَلَكْتُ بها كفّي فأنْهَرَ فتقَها ... يرى قائم من دونها مَا وراءهَافإنّ كفّه مملوكة له لا محالة ، ولكنّه أراد أنّه تمكّن من كفّه تمام التّمكن فدفع به الرّمح دفعة عظيمة لم تخنه فيها كفّه . ومِن هذا الاستعمال نشأ إطلاق الملك بمعنى الاستطاعة القويّة الثّابتة على سبيل المجاز المرسل كما وقع في هذه الآية ونظائرها { ولا يملكون لأنفسهم ضرّاً ولا نفعاً ولا يملكون موتاً ولا حياة ولا نشوراً } \\[ الفرقان : 3 \\] { قل لا أملك لنفسي ضرّاً ولا نفعاً } \\[ يونس : 49 \\] { إنّ الّذين تعبدون من دون الله لا يَمْلكون لكم رزقاً } \\[ العنكبوت : 17 \\] . فقد تعلّق فعل الملك فيها بمعان لا بأشياء وذوات ، وذلك لا يكون إلاّ على جعل الملك بمعنى الاستطاعة القويّة ألا ترى إلى عطف نفي على نفي المِلك على وجه التّرقّي في قوله تعالى : { ويعبدون من دون الله ما لا يَملك رزقاً من السماوات والأرض شيئاً ولا يستطيعون } في سورة النّحل ( 73 ) . وقد تقدّم آنفاً استعمال آخر في قوله : { قل فمن يملك من الله شيئاً إن أرادَ أن يهلك المسيح ابن مريم } \\[ المائدة : 17 \\] .وقُدّم الضَرّ على النّفع لأنّ النّفوس أشدّ تطلّعاً إلى دفعه من تطلّعها إلى جلب النّفع ، فكان أعظمَ ما يدفعهم إلى عبادة الأصنام أنّ يستدفعوا بها الأضرار بالنّصر على الأعداء وبتجنّبها إلحاق الإضرار بعابديها .ووجه الاستدلال على أنّ معبوداتهم لا تملك ضرّاً ولا نفعاً ، وقوع الأضرار بهم وتخلّف النّفع عنهم .فجملة { والله هو السميع العليم } في موضع الحال ، قُصر بواسطة تعريف الجزأين وضمير الفصل ، سببُ النّجدة والإغاثة في حالي السؤال وظهورِ الحالةِ ، على الله تعالى قصرَ ادّعاء بمعنى الكمال ، أي ولا يسمع كلّ دعاء ويعلم كلّ احتياج إلاّ الله تعالى ، أي لا عيسى ولا غيره ممّا عُبِد من دون الله .فالواو في قوله { والله هو السّميع العليم } واو الحال . وفي موقع هذه الجملة تحقيق لإبطال عبادتهم عيسى ومريم من ثلاثة طرق : طريققِ القصر وطريققِ ضمير الفصل وطريق جملة الحال باعتبار ما تفيده من مفهوم مخالفه .\n\n",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (Serve ye in place of Allah) the idols (that which possesseth for you neither hurt) that which cannot drive away from you harm in this world or in the Hereafter (nor use) nor bring benefit to you in this world or in the Hereafter? (Allah it is Who is the Hearer) of your claims about Jesus, (the Knower) of your punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم يا أكمل الرسل إلزاماً وتبكيتاً: { أَتَعْبُدُونَ } وتؤمنون { مِن دُونِ ٱللَّهِ } المتفرد بالألوهية والوجود { مَا } أي: أضلالاً وتماثيل { لاَ يَمْلِكُ لَكُمْ } ولا لأنفسهم { ضَرّاً وَلاَ نَفْعاً } ولا وجوداً\n ولا حياة\n بل ما هي إ لا تماثيل موهومة\n وعكوس معدومة تنعكس من أشعة التجليات الإلهية\n ليس لها في أنفسها أوصاف وآثار { وَٱللَّهُ } المتجلي في الآفاق بالاستحقاق { هُوَ ٱلسَّمِيعُ } في مظاهره لا غيره\n إذ لا غير { ٱلْعَلِيمُ } [المائدة: 76] أيضاً فيها\n فله الاستقلال في التصرف في ملكه وملكوته بلا مشاركة أحدٍ ومظارته\n\n\n{ قُلْ يَـٰأَهْلَ ٱلْكِتَابِ } أي: النصارى { لاَ تَغْلُواْ فِي دِينِكُمْ } ونبيكم { غَيْرَ ٱلْحَقِّ } اقتراءً ومراءً\n سيما بعد ظهور المبيِّن\n المؤيَّد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم أبطل عبادتهم لعيسى عليه السلام فقال: { قل أتعبدون من دون الله ما لا يملك لكم ضرًّا ولا نفعًا } بل هو عاجز عن صرفه عن نفسه وجلب الخير لها\n فكيف يقدر أن يدفعه عن غيره؟ وعبَّر عنه بما\n دون { من } ـ إشارة إلى أنه من جنس ما لا يعقل\n وما كان مشاركًا في الحقيقة لجنس ما لا يعقل\n يكون معزولاً عن الألوهية\n وإنما قدّم الضر لأن التحرز منه أهم من تحري النفع\n ثم هددهم بقوله: { والله هو السميع العليم } بالأقوال والعقائد\n فيجازي عليهما\n إن خيرًا فخير\n وإن شرًا فشر\n والله تعالى أعلم\n الإشارة: ينبغي للعبد أن يصفي مشرب توحيده\n ويعتني بتربية يقينه\n بصحبة أهل اليقين\n وهم أهل التوحيد الخاص\n فيترقى من توحيد الأفعال إلى توحيد الصفات\n ومن توحيد الصفات إلى توحيدات الذات\n فنهاية توحيد الصالحين والعلماء المجتهدين تحقيق توحيد الأفعال\n وهو ألاَّ يرى فاعلاً إلا الله\n لا فاعل سواه\n وثمرة هذا التوحيد: الاعتماد على الله\n والثقة بالله\n وسقوط خوف الخلق من قلبه\n لأنه يراهم كالآلات\n والقدرة تحركهم\n ليس بيدهم نفع ولا ضرر\n عاجزون عن أنفسهم فكيف عن غيرهم؟ ونهاية توحيد العباد والزهاد والناسكين المنقطعين إلى الله تعالى توحيد الصفات\n فلا يرون قادرًا ولا مريدًا ولا عالمًا ولا حيًّا ولا سميعًا ولا بصيرًا ولا متكلمًا إلا الله\n قد انتفت عنه صفات الحدث وبقيت صفات القدم\n وثمرة هذا التوحيد: الانحياش من الخلق والتأنس بالملك الحق\n وحلاوة الطاعات ولذيذ المناجات\n ونهاية توحيد الواصلين من العارفين والمريدين السائرين: توحيد الذات فلا يشهدون إلا الله\n ولا يرون معه سواه\n قال بعضهم: لو كلفت أن أرى غيره لم أستطع\n فإنه لا غير معه حتى أشهده\n وقال شاعرهم:\nوقال في التنوير: أبى المحقّقون أن يشهدوا مع الله سواه لما حققهم به من شهود الأحدية وإحاطة القيومية\n هـ\n وفي الحكم: \" الأكوان ثابتة بإثباته\n ممحوة بأحدية ذاته \"\n وهؤلاء هم الصديقون المقربون\n نفعنا الله بذكرهم\n وخرطنا في سلكهم\n آمين\n ثم نهى أهل الكتاب عن الغلو في عيسى\n فقال: { قُلْ يَـٰأَهْلَ ٱلْكِتَابِ لاَ تَغْلُواْ فِي دِينِكُمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:66",
      "similarity": 0.8641514117018849
    },
    {
      "verse": "25:55",
      "similarity": 0.7157992352169258
    },
    {
      "verse": "22:12",
      "similarity": 0.7108778690275354
    },
    {
      "verse": "20:89",
      "similarity": 0.7070833936109302
    },
    {
      "verse": "10:106",
      "similarity": 0.6788542354707131
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005076.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005076.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:76.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}