{
  "chapter": "المائدة",
  "text": "قل ياهل الكتب لا تغلوا۟ فى دينكم غير الحق ولا تتبعوا۟ اهواء قوم قد ضلوا۟ من قبل واضلوا۟ كثيرا وضلوا۟ عن سواء السبيل",
  "translations": [
    {
      "translation": "Say: 'People of the Book! do not go to extremes in your deen, asserting other than the truth, and do not follow the whims and desires of people who were misguided previously and have misguided many others, and are far from the right way.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"O people of the Book, do not overstep the bounds of truth in your beliefs, and follow not the wishes of a people who had erred before, and led many others astray, and wandered away from the right path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'People of the Book! Do not go beyond bounds in your religion at the cost of truth, and do not follow the caprices of the people who fell into error before, and caused others to go astray, and strayed far away from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to the People of the Book, \"Do not wrongly exceed the proper limit of devotion to your religion or follow the desires of the people who have erred. They have misled many others and have themselves stayed far away from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “O People given the Book(s)! Do not wrongfully commit injustice in your religion, and do not follow the people who earlier went astray, and led many others astray, and wandered away from the Straight Path.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O People of the Scripture! Exceed not the limits in your religion beyond the truth, and do not follow the vain desires of people who went astray before and who misled many, and strayed (themselves) from the right path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O followers of the Book! be not unduly immoderate in your religion, and do not follow the low desires of people who went astray before and led many astray and went astray from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'People of the Book, go not beyond the bounds in your religion, other than the truth, and follow not the caprices of a people who went astray before, and led astray many, and now again have gone astray from the right way.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O People of the Scripture! Stress not in your religion other than the truth, and follow not the vain desires of folk who erred of old and led many astray, and erred from a plain road.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"People of the Book! Do not go to extremes in your religion and do not follow the whims of those who went astray before you -- they caused many to go astray and themselves strayed away from the right path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: O people of the Book! exceed not the just bounds in your religion except with truth, and follow not the vain desires of a people who have strayed aforetime and have led many astray and have strayed from the level way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘O People of the Book! Do not unduly exceed the bounds in your religion and do not follow the fancies of a people who went astray in the past, and led many astray, and [themselves] strayed from the right path.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O people of the Book! exceed not in your religion the bounds (of what is proper), trespassing beyond the truth, nor follow the vain desires of people who went wrong in times gone by,- who misled many, and strayed (themselves) from the even way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"O people of the Scripture (Jews and Christians)! Exceed not the limits in your religion (by believing in something) other than the truth, and do not follow the vain desires of people who went astray in times gone by, and who misled many, and strayed (themselves) from the Right Path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'People of the Book! Do not exaggerate your religion, other than the truth, and do not follow the desires of a people who went astray before, and led many astray, and, (once again) have gone astray from the Straight Path'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “O People of the Scripture! Do not exaggerate in your religion beyond the truth; and do not follow the opinions of people who went astray before, and misled many, and themselves strayed off the balanced way.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"O People of the Scripture, do not exceed limits in your religion beyond the truth and do not follow the inclinations of a people who had gone astray before and misled many and have strayed from the soundness of the way.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:77] Say: ‘O People of the Scripture, Jews and Christians, do not go to extremes, do [not] overstep the bounds, in your religion, other than those, extremes, of truth, neither lowering nor elevating Jesus above his proper place, and do not follow the whims of a people who went astray formerly, on account of their extremism — these were their forefathers — and have led many, [other] people, astray, and strayed from the even way’, from the path of truth (al-sawā’ originally means ‘middle’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say: People of the Scripture!) i.e. the people of Najran. (Stress not in your religion) do not be extreme in your religion (other than the Truth) for it is not the Truth, (and follow not the vain desires of folk) the religion and claims of a folk (who erred) from the guidance (of old) before you; these are the leaders (and led many astray) from guidance, (and erred from a plain road) they missed the road of guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n المدَّق { وَلاَ تَتَّبِعُوۤاْ أَهْوَآءَ قَوْمٍ } من أسلافكم { قَدْ ضَلُّواْ مِن قَبْلُ } عن طريق الحق { وَ } مع ذلك لا يقتصرون على الضلال بل { أَضَلُّواْ كَثِيراً } من ضعفائهم وعوامهم { وَ } هم قوم { ضَلُّواْ عَن سَوَآءِ ٱلسَّبِيلِ } [المائدة: 77] بلا هادٍ ومنبهٍ يهديهم إليه\n وما لكم تضلون عنه مع وجود المنبة المؤيد من عند الله\n الهادي بالهداية العامة إلى صراط مستقيم\n موصلٍ إلى مقر التوحيد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { يا أهل الكتاب } أي: النصارى، { لا تغلوا في دينكم } وتقولوا قولاً { غير الحق } وهو اعتقادكم في عيسى أنه إله، أو أنه لغير رشدة، ولا تفرطوا، { ولا تتبعوا أهواء قوم } سلفوا قبلكم، وهم أئمتكم في الكفر، { قد ضلوا من قبل } أي: من قبل مبعث محمد صلى الله عليه وسلم، { وأضلوا } أناسًا { كثيرًا } حملوهم على الاعتقاد الفاسد في عيسى وأمه، فقلدوهم وضلوا معهم، { وضلوا عن سواء السبيل } أي: عن قصد السبيل المستقيم، وهو الإسلام بعد مبعثه صلى الله عليه وسلم، وقيل: الضلال الأول إشارة إلى ضلالهم عن مقتضى العقل، والثاني إشارة إلى ضلالهم عما جاء به الشرع. قاله البيضاوي. الإشارة: الغلو كله مذموم كما تقدم، وخير الأمور أوسطها، كما تقدم. وقد رخص في الغلو في ثلاثة أمور: أحدها: في مدح النبي صلى الله عليه وسلم فلا بأس أن يبالغ فيه ما لم يخرجه عن طور البشرية، وهذا غلو ممدوح، مقرب إلى الله تعالى، قال في بردة المديح:\nالثاني: في مدح الأشياخ والأولياء، ما لم يخرجهم أيضًا عن طورهم، أو يغض من مرتبة بعضهم، فقد رخصوا للمريد أن يبالغ في مدح شيخه، ويتغالى فيه، بالقيدين المتقدمين لأن ذلك يقربه من حضرة الحق تعالى. والثالث: في تعظيم الحق جل جلاله. وهذا لا قيد فيه ولا حصر. حدث عن البحر ولا حرج، إذا كان ممن يحسن العبارة ويتقن الإشارة، بحيث لا يوهم نقصًا ولا حلولاً. وبالله التوفيق. ولما ذكر مساوئ النصارى ذكر مساوئ اليهود، فقال: { لُعِنَ ٱلَّذِينَ كَفَرُواْ مِن بَنِيۤ إِسْرَائِيلَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:171",
      "similarity": 0.7039929817949853
    },
    {
      "verse": "28:50",
      "similarity": 0.14039928430899964
    },
    {
      "verse": "38:26",
      "similarity": 0.13834426478780606
    },
    {
      "verse": "30:29",
      "similarity": 0.13572388819631193
    },
    {
      "verse": "6:119",
      "similarity": 0.13298764860021853
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005077.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005077.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:77.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}