{
  "chapter": "المائدة",
  "text": "لعن الذين كفروا۟ منۢ بنى اسرءيل على لسان داود وعيسى ابن مريم ذلك بما عصوا۟ وكانوا۟ يعتدون",
  "translations": [
    {
      "translation": "Those among the tribe of Israel who were kafir were cursed on the tongue of Dawud and that of 'Isa, son of Maryam. That is because they rebelled and overstepped the limits.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cursed were disbelievers among the children of Israel by David and Jesus, son of Mary, because they rebelled and transgressed the bounds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of the Children of Israel who took to unbelief have been cursed by the tongue of David and Jesus, son of Mary, for they rebelled and exceeded the bounds of right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers among the Israelites, because of their disobedience and transgression, were condemned by David and Jesus, the son of Mary for their disobedience; they were transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those among the Descendants of Israel who turned disbelievers were cursed by the tongue of Dawud, and of Eisa the son of Maryam; it was because of their disobedience and their rebellion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those among the Children of Israel who disbelieved were cursed by the tongue of Dawud and `Isa, son of Maryam. That was because they disobeyed (Allah and the Messengers) and were ever transgressing (beyond the bounds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved from among the children of Israel were cursed by the tongue of Dawood and Isa, son of Marium; this was because they disobeyed and used to exceed the limit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cursed were the unbelievers of the Children of Israel by the tongue of David, and Jesus, Mary's son; that, for their rebelling and their transgression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of the Children of Israel who went astray were cursed by the tongue of David, and of Jesus, son of Mary. That was because they rebelled and used to transgress.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those of the Children of Israel who were bent on denying the truth were cursed by David and Jesus, the son of Mary. That was because they disobeyed and were given to transgression;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cursed were those who disbelieved from among the Children of Isra'il by the tongue of Daud and 'Isa, son of Maryam. That is because they disobeyed and were ever transgressing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The faithless among the Children of Israel were cursed on the tongue of David and Jesus son of Mary. That, because they would disobey and they used to commit transgression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Curses were pronounced on those among the Children of Israel who rejected Faith, by the tongue of David and of Jesus the son of Mary: because they disobeyed and persisted in excesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those among the Children of Israel who disbelieved were cursed by the tongue of Dawud (David) and 'Iesa (Jesus), son of Maryam (Mary). That was because they disobeyed (Allah and the Messengers) and were ever transgressing beyond bounds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved of the Children of Israel were cursed by the tongue of (Prophets) David and Jesus, the son of Mary, because they disobeyed and transgressed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cursed were those who disbelieved from among the Children of Israel by the tongue of David and Jesus son of Mary. That is because they rebelled and used to transgress.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cursed were those who disbelieved among the Children of Israel by the tongue of David and of Jesus, the son of Mary. That was because they disobeyed and [habitually] transgressed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:78] Cursed were the disbelievers of the Children of Israel by the tongue of David, when he invoked God against them and they were transformed into apes — these were the people of Eilat — and by Jesus, son of Mary, when he invoked God against them and they were transformed into pigs — they were the ones [who ate] at the Table [cf. Q. 5:115, below] — that, cursing, was because of their disobedience and their transgression.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "123 (Those of the children of Israel who went astray were cursed by the tongue of David) through David's supplication against them they became apes, (and of Jesus, son of Mary) and through Jesus' supplication against them they became swine. (That) curse (was because they rebelled) on the Sabbath and upon eating from the table which was sent from heaven (and used to transgress) by killing the prophets and declaring to be lawful their indulgence in sin.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لُعِنَ } أي: طُرد ، وحُرم، ورُدَّ من مقر العز ومرتبة النيابة { ٱلَّذِينَ كَفَرُواْ مِن بَنِيۤ إِسْرَائِيلَ عَلَىٰ لِسَانِ دَاوُودَ وَعِيسَى ٱبْنِ مَرْيَمَ } أيضاً { ذٰلِكَ } الطرد واللعن { بِمَا عَصَوْا } على الله بعدم امتثال أوامره واجتناب نواهيه { وَّكَانُواْ يَعْتَدُونَ } [المائدة: 78] يتجاوزون عن مرتبة الإنسانية بالخروج عمَّا حدَّ الله لهم، وبيَّنه في كتابه إلى ما تهوى أنفسهم، وترضى عقولهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { لُعن الذين كفروا من بني إسرائيل على لسان داود } أي: لعنهم الله في الزبور على لسان نبيه داود عليه السلام، { و } لعنهم الله أيضًا في الإنجيل على لسان { عيسى ابن مريم } ، فالأول: أهل أيلَة لما اعتدوا في السبت لعنهم داود عليه السلام، فمسخوا قردة وخنازير، والثاني أصحاب المائدة، لمّا كفروا دعا عليهم عيسى، ولعنهم، فمسخوا خنازير، وكانوا خمسة آلاف رجل، { ذلك بما عصوا وكانوا يعتدون } ذلك اللعن الشنيع المقتضي للمسخ بسبب عصيانهم واعتدائهم ما حَرُم عليهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "61:6",
      "similarity": 0.38881105990193643
    },
    {
      "verse": "19:34",
      "similarity": 0.3823212464186375
    },
    {
      "verse": "5:116",
      "similarity": 0.35906774670509156
    },
    {
      "verse": "61:14",
      "similarity": 0.3583551262827388
    },
    {
      "verse": "3:45",
      "similarity": 0.3049526968494393
    }
  ]
}