{
  "chapter": "المائدة",
  "text": "كانوا۟ لا يتناهون عن منكر فعلوه لبئس ما كانوا۟ يفعلون",
  "translations": [
    {
      "translation": "They would not restrain one another from any of the wrong things that they did. How evil were the things they used to do!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They did not restrain one another from the wicked things they used to do; and vile were the things that they were doing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They did not forbid each other from committing the abominable deeds they committed. Indeed what they did was evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They did not prevent each other from committing sins nor would they themselves stay away from them. Evil was what they had done!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They did not restrain one another from the evil they used to do; undoubtedly they used to commit extremely evil deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They used not to forbid one another from the evil they committed. Vile indeed was what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They used not to forbid each other the hateful things (which) they did; certainly evil was that which they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They forbade not one another any dishonour that they committed; surely evil were the things they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They restrained not one another from the wickedness they did. Verily evil was that they used to do!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they would not prevent one another from doing the wrong things they did. Evil indeed were their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were wont not to desist from the evil they committed; vile is that which they have been doing!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They would not forbid one another from the wrongs that they committed. Surely, evil is what they had been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor did they (usually) forbid one another the iniquities which they committed: evil indeed were the deeds which they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They used not to forbid one another from the Munkar (wrong, evil-doing, sins, polytheism, disbelief, etc.) which they committed. Vile indeed was what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They did not forbid one another from the wrongdoing they were committing. Evil is what they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They used not to prevent one another from the wrongs they used to commit. Evil is what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They used not to prevent one another from wrongdoing that they did. How wretched was that which they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:79] They did not prevent one another, that is, one would not forbid the other from committing again, any indecency that they committed; verily evil was what they used to do, [verily evil] was this deed of theirs.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They restrained not one another) they did not repent (from the wickedness) the evil actions (they did. Verily evil was that they used to do!) evil are the sins and transgressions they used to engage in.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كَانُواْ } من غاية غفلتهم وانهماكهم { لاَ يَتَنَاهَوْنَ } أي: لا ينهون أنفسهم { عَن مُّنكَرٍ } مخالف للشرع { فَعَلُوهُ } بعد تنبههم بمخالفته، بل يصرون عليها؛ عناداً واستكباراً، والله { لَبِئْسَ مَا كَانُواْ يَفْعَلُونَ } [المائدة: 79] لأنفسهم ذلك المنكر، والإصرار المستجلب للعذاب والنكال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { كانوا لا يتناهون عن منكر فعلوه } أي: لا ينهى بعضهم بعضًا عن معاودة منكر فعلوه، أو عن منكر أرادوا فعله وتهيأوا له، أو: لا ينتهون عنه ولا يمتنعون منه، { لبئس ما كانوا يفعلون } ، وهو تعجيب من سوء فعلهم مؤكد بالقسم",
      "translations": []
    }
  ]
}