{
  "chapter": "المائدة",
  "text": "يايها الذين ءامنوا۟ كونوا۟ قومين لله شهداء بالقسط ولا يجرمنكم شنـان قوم على الا تعدلوا۟ اعدلوا۟ هو اقرب للتقوى واتقوا۟ الله ان الله خبيرۢ بما تعملون",
  "translations": [
    {
      "translation": "You who have iman! show integrity for the sake of Allah, bearing witness with justice. Do not let hatred for a people incite you into not being just. Be just. That is closer to taqwa. Have taqwa of Allah. Allah is aware of what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, stand up as witnesses for God in all fairness, and do not let the hatred of a people deviate you from justice. Be just: This is closest to piety; and beware of God. Surely God is aware of all you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Be upright bearers of witness for Allah, and do not let the enmity of any people move you to deviate from justice. Act justly, that is nearer to God-fearing. And fear Allah. Surely Allah is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, be steadfast for the cause of God and just in bearing witness. Let not a group's hostility to you cause you to deviate from justice. Be just, for it is closer to piety. Have fear of God; God is Well Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Firmly establish the commands of Allah, giving testimony with justice – and do not let the enmity of anyone tempt you not to do justice; be just; that is nearer to piety – and fear Allah; indeed Allah is Well Aware of your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Stand out firmly for Allah as just witnesses; and let not the enmity and hatred of others make you avoid justice. Be just, that is nearer to Taqwa; and have Taqwa of Allah. Verily, Allah is Well-Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be upright for Allah, bearers of witness with justice, and let not hatred of a people incite you not to act equitably; act equitably, that is nearer to piety, and he careful of (your duty to) Allah; surely Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, be you securers of justice, witnesses for God. Let not detestation for a people move you not to be equitable; be equitable -- that is nearer to godfearing. And fear God; surely God is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Be steadfast witnesses for Allah in equity, and let not hatred of any people seduce you that ye deal not justly. Deal justly, that is nearer to your duty. Observe your duty to Allah. Lo! Allah is Informed of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, be steadfast in the cause of God and bear witness with justice. Do not let your enmity for others turn you away from justice. Deal justly; that is nearer to being God-fearing. Fear God. God is aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! be maintainers of your pact with Allah and witnesses in equity, and let not the hatred of a people incite you not to act fairly; act fairly; that is highest unto piety. And fear Allah; verily Allah is Aware of that which ye work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Be maintainers, as witnesses for the sake of Allah, of justice, and ill feeling for a people should never lead you to be unfair. Be fair; that is nearer to Godwariness, and be wary of Allah. Allah is indeed well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! stand out firmly for Allah, as witnesses to fair dealing, and let not the hatred of others to you make you swerve to wrong and depart from justice. Be just: that is next to piety: and fear Allah. For Allah is well-acquainted with all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Stand out firmly for Allah and be just witnesses and let not the enmity and hatred of others make you avoid justice. Be just: that is nearer to piety, and fear Allah. Verily, Allah is Well-Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, be dutiful to Allah and bearers of just witness. Do not allow your hatred for other people to turn you away from justice. Deal justly; it is nearer to piety. Have fear of Allah; Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be upright to God, witnessing with justice; and let not the hatred of a certain people prevent you from acting justly. Adhere to justice, for that is nearer to piety; and fear God. God is informed of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, be persistently standing firm for Allah, witnesses in justice, and do not let the hatred of a people prevent you from being just. Be just; that is nearer to righteousness. And fear Allah; indeed, Allah is Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:8] O you who believe, be upright before God, in [fulfilling] what is His due, witnesses in equity, in justice. Let not hatred of a people, namely, the disbelievers, cause you not to be just, and to harm them on account of their enmity; be just, towards both friend and foe, that, justice, is nearer to God-fearing. And fear God; surely God is aware of what you do, and will requite you for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe! Be steadfast witnesses for Allah in equity) in justice, (and let not hatred of any people) the hatred of Shurayh Ibn Shurahbil (seduce you) drive you (that ye deal not justly) with the pilgrims of the clan of Bakr Ibn Wa'il. (Deal justly) with them, (that is nearer to your duty) justice is nearer to God- fearingness as far as the God-fearing are concerned. (Observe your duty to Allah) fear Allah regarding justice and injustice. (Lo! Allah is Informed of what ye do) whether it is justice or injustice.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ونعمائه الفائضة لكم من عنده تفضلاً وامتناناً { وَلاَ يَجْرِمَنَّكُمْ } أي: لا حملنَّكم ولا يبعثنَّكم { شَنَآنُ قَوْمٍ } شدة عداوة قوم وبغضهم { عَلَىۤ أَلاَّ تَعْدِلُواْ } ولا تقصطوا فيما أنعم الله عليكم\n بأن تجاوزوا عن حدود الله حين القدرة على الانتقام منهم\n تشفياً لصدوركم\n بل عليكم أن تقسطوا في كل الأحوال\n سيما عند الاقتدار { ٱعْدِلُواْ } أيها المنعمون بالقدرة والظفر { هُوَ } أي: عدلكم { أَقْرَبُ لِلتَّقْوَىٰ } عن محارم الله\n والاجتناب عن منهياته { وَٱتَّقُواْ ٱللَّهَ } المراقب لكم في جميع أحوالكم { إِنَّ ٱللَّهَ خَبِيرٌ بِمَا تَعْمَلُونَ } [المائدة: 8] من مقتضيات نفوسكم وتسويلاتها\n\n\n{ وَعَدَ ٱللَّهُ } المدبر لأمور عباده { ٱلَّذِينَ آمَنُواْ } بتوحيده { وَعَمِلُواْ ٱلصَّالِحَاتِ } المقربة نحوه\n المأمورة من عنده بأن حصل لهم مغفرة لذنوبهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وعد }: يتعدى إلى مفعولين\n وحذف هنا الثاني\n أي: وعدهم أجرًا عظيمًا\n دل عليه الجملة بعده\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا } عَامٌّ أريد به خاص\n وهم أولوا الأمر منهم\n الذين يلُون الحكم بين الناس\n وما تقدم في سورة النساء باقٍ على عمومه\n أي: { كونوا قوامين } على من تحت حكمكم\n راعين لهم فإنكم مسؤولون عن رعيتكم\n وكونوا مخلصين { لله } في قيامكم وولايتكم\n { شهداء } على أنفسكم بالعدل\n تشهدون عليها بالحق إن توجه عليها\n ولا تمنعكم الرئاسة من الإنصاف في الحق\n إن توجه عليكم\n أو على أقاربكم وأصدقائكم\n ولا على عدوكم { ولا يجرمنكم } أي: ولا يحملنكم { شنئان قوم } أي: شدة بغضهم لكم\n { على ألا تعدلوا } فيهم\n فتمنعوهم من حقهم\n أو تزيدوا في نكالهم\n تشفيًا وغيظًا\n { اعدلوا هو } أي: العدل { أقرب للتقوى } \n قال البيضاوي: صرح لهم بالأمر بالعدل\n وبيَّن أنه بمكان من التقوى بعد ما نهاهم عن الجور\n وبيَّن أنه مقتضى الهوى\n فإذا كان هذا العدل مع الكفار\n فما بالك مع المؤمنين؟\n هـ\n { واتقوا الله } ولا تراقبوا سواه\n { إن الله خبير بما تعملون } فيجازي كلاًّ على عمله\n من عدل أو جور\n ثم ذكر ثواب من امتثل\n فقال: { وعد الله الذين آمنوا وعملوا الصالحات لهم مغفرة وأجر عظيم } \n وأفضل الأعمال: العدل في الأحكام\n قال عليه الصلاة والسلام:\n \" المُقسِطُونَ عَلَى مَنَابِرَ مِن نُورٍ يومَ القيامة \" \n\n\n الحديث\n هو من السبعة الذين يظلهم الله في ظله\n ثم ذكر وعيد ضدهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:2",
      "similarity": 0.42801482254844136
    },
    {
      "verse": "108:3",
      "similarity": 0.36350685457317106
    },
    {
      "verse": "4:135",
      "similarity": 0.28779983196503994
    },
    {
      "verse": "49:9",
      "similarity": 0.2141520727610476
    },
    {
      "verse": "3:18",
      "similarity": 0.19866861775277908
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005008.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005008.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}