{
  "chapter": "المائدة",
  "text": "ترى كثيرا منهم يتولون الذين كفروا۟ لبئس ما قدمت لهم انفسهم ان سخط الله عليهم وفى العذاب هم خلدون",
  "translations": [
    {
      "translation": "You see many of them taking those who are kafir as their friends. What their lower selves have advanced for them is evil indeed, bringing Allah's anger down upon them. They will suffer punishment timelessly, for ever.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You can see among them many allying themselves with the infidels. Vile it was what they sent ahead of them, so that God's indignation came upon them; and torment will they suffer an eternity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And now you can see many of them taking the unbelievers (instead of the believers) for their allies. Indeed they have prepared evil for themselves. Allah is angry with them, and they shall abide in chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have seen many of them establishing friendship with the unbelievers. Vile is what their souls have gained! They have invoked the wrath of God upon themselves and they will live forever in torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will see that many of them make friends with the disbelievers; what an evil thing they had sent ahead for themselves, for Allah’s wrath came upon them and they will remain in the punishment, forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You see many of them taking the disbelievers as their friends. Evil indeed is that which they have sent forward before themselves; for that (reason) Allah is wrath with them, and in torment they will abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will see many of them befriending those who disbelieve; certainly evil is that which their souls have sent before for them, that Allah became displeased with them and in chastisement shall they abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou seest many of them making unbelievers their friends. Evil is that they have forwarded to their account, that God is angered against them, and in the chastisement they shall dwell forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou seest many of them making friends with those who disbelieve. Surely ill for them is that which they themselves send on before them: that Allah will be wroth with them and in the doom they will abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You see many among them allying themselves with those who deny the truth. Evil is that which their souls have sent on ahead for them. They have incurred the wrath of God and shall suffer eternal punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou wilt see many of them befriending those who disbelieve; vile surely is that which their souls have sent forth for them, so that Allah became incensed against them; and in torment they shall be abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You see many of them fraternizing with the faithless. Surely evil is what they have sent ahead for their souls, as Allah is displeased with them and they shall remain in punishment [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou seest many of them turning in friendship to the Unbelievers. Evil indeed are (the works) which their souls have sent forward before them (with the result), that Allah's wrath is on them, and in torment will they abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You see many of them taking the disbelievers as their Auliya' (protectors and helpers). Evil indeed is that which their ownselves have sent forward before them, for that (reason) Allah's Wrath fell upon them and in torment they will abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You see many of them taking the unbelievers as guides. Evil is that to which their souls forwarded them, that Allah is angered against them, and in the punishment they shall live for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will see many of them befriending those who disbelieve. Terrible is what their souls prompts them to do. The wrath of God fell upon them, and in the torment they will remain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You see many of them becoming allies of those who disbelieved. How wretched is that which they have put forth for themselves in that Allah has become angry with them, and in the punishment they will abide eternally.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:80] You, O Muhammad (s), see many of them affiliating with those who disbelieve, from among the Meccans, out of spite for you. Evil is that, in the way of deeds, which their souls have offered on their behalf, for [the day of] their inevitable return, such that God is wroth with them and in the chastisement they shall abide.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thou seest many of them) many of the hypocrites (making friends with) by seeking their assistance and help (those who disbelieve) Ka'b and his followers; it is also said that this means: you see many Jews, such as Ka'b and his followers, making friends with the disbelievers, the disbelievers of Mecca, Abu Sufyan and his followers, (surely ill for them is that which they themselves send on before them) in their state of Judaism and hypocrisy: (that Allah will be wroth with them and in the doom they will abide) never to die or be removed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تَرَىٰ } أيها الرائي { كَثِيراً مِّنْهُمْ يَتَوَلَّوْنَ } ويودون\n ويوالون { ٱلَّذِينَ كَفَرُواْ } أشركوا بالله ويصاحبونهم\n لذلك يسري شركهم وكفرهم عليهم\n والله { لَبِئْسَ مَا قَدَّمَتْ لَهُمْ أَنفُسُهُمْ أَن سَخِطَ ٱللَّهُ عَلَيْهِمْ } بسببه { وَفِي ٱلْعَذَابِ هُمْ خَالِدُونَ } [المائدة: 80] يشؤمه\n\n\n{ وَلَوْ كَانُوا } أي: هؤلاء المنافقون { يُؤْمِنُونَ بِالله } المتوحد في ذاته { والنَّبِيِّ } المؤيِّد من عنده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ترى كثيرًا منهم } أي: من اليهود\n { يتولون الذين كفروا } أي: يوالون المشركين بُغضًا للرسول صلى الله عليه وسلم وللمؤمنين\n { لبئس ما قدمت لهم أنفسهم } أي: لبئس شيئًا قدموه\n ليردوا عليه يوم القيامة\n وهو { أن سخط الله عليهم وفي العذاب هم خالدون } أي: بئس ما قدموا أمامهم\n وهو سخط الله والخلود في النار\n والعياذ بالله\n { ولو كانوا يؤمنون بالله والنبي } أي: نبيهم كما يزعمون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "47:28",
      "similarity": 0.7255167686306904
    },
    {
      "verse": "3:162",
      "similarity": 0.7009109857497069
    },
    {
      "verse": "9:58",
      "similarity": 0.5353489317950255
    },
    {
      "verse": "11:98",
      "similarity": 0.1474018277732311
    },
    {
      "verse": "64:10",
      "similarity": 0.144993720410864
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/5:80.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/5:80.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/5:80.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}