{
  "chapter": "المائدة",
  "text": "واذا سمعوا۟ ما انزل الى الرسول ترى اعينهم تفيض من الدمع مما عرفوا۟ من الحق يقولون ربنا ءامنا فاكتبنا مع الشهدين",
  "translations": [
    {
      "translation": "When they listen to what has been sent down to the Messenger, you see their eyes overflowing with tears because of what they recognise of the truth. They say, 'Our Lord, we have iman! So write us down among the witnesses.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For when they listen to what has been revealed to this Apostle, you can see their eyes brim over with tears at the truth which they recognise, and say: \"O Lord, we believe; put us down among those who bear witness (to the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear what has been revealed to the Messenger you see that their eyes overflow with tears because of the Truth that they recognize and they say: 'Our Lord! We do believe; write us down, therefore, with those who bear witness (to the Truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they hear what is revealed to the Messenger, you can see their eyes flood with tears, as they learn about the Truth. They say, \"Lord, we believe (in this faith). Write our names down as bearing witness to it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they listen to what has been sent down to the Noble Messenger (Prophet Mohammed – peace and blessings be upon him), you observe their eyes overflowing with tears because they have recognised the truth; they say, “Our Lord, we have accepted faith – therefore record us among the witnesses of the truth.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they listen to what has been sent down to the Messenger, you see their eyes overflowing with tears because of the truth they have recognized. They say: \"Our Lord! We believe; so write us down among the witnesses.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear what has been revealed to the apostle you will see their eyes overflowing with tears on account of the truth that they recognize; they say: Our Lord! we believe, so write us down with the witnesses (of truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when they hear what has been sent down to the Messenger, thou seest their eyes overflow with tears because of the truth they recognize. They say, 'Our Lord, we believe; so do Thou write us down among the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they listen to that which hath been revealed unto the messengers, thou seest their eyes overflow with tears because of their recognition of the Truth. They say: Our Lord, we believe. Inscribe us as among the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they listen to what has been sent down to the Messenger, you see their eyes overflowing with tears, because of the Truth they recognize. They say, \"Our Lord, we believe, so count us among those who bear witness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear that which hath been sent down unto the apostle, then thou beholdest their eyes overflow, with tears because of the truth they have recognised. They say: Our Lord! we believe, so write us down with the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they hear what has been revealed to the Apostle, you see their eyes fill with tears because of the truth that they recognize. They say, ‘Our Lord, we believe; so write us down among the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they listen to the revelation received by the Messenger, thou wilt see their eyes overflowing with tears, for they recognise the truth: they pray: \"Our Lord! we believe; write us down among the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they (who call themselves Christians) listen to what has been sent down to the Messenger (Muhammad SAW), you see their eyes overflowing with tears because of the truth they have recognised. They say: \"Our Lord! We believe; so write us down among the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they listen to that which was sent down to the Messenger, you will see their eyes fill with tears as they recognize its truth. They say: 'Lord, we believe. Write us among the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear what was revealed to the Messenger, you see their eyes overflowing with tears, as they recognize the truth in it. They say, “Our Lord, we have believed, so count us among the witnesses.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they hear what has been revealed to the Messenger, you see their eyes overflowing with tears because of what they have recognized of the truth. They say, \"Our Lord, we have believed, so register us among the witnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:83] This [verse] was revealed when the Negus’s delegation from Abyssinia came to him (s): when the Prophet (s) recited sūrat Yā Sīn, they cried and submitted [to Islam], saying, ‘How similar this is to what used to be revealed to Jesus!’ God, exalted be He, says: And when they hear what has been revealed to the Messenger, of the Qur’ān, you see their eyes overflow with tears because of what they recognise of the truth. They say, ‘Our Lord, we believe, we accept the truth of your Prophet and your Book, so inscribe us among the witnesses, those who affirm their acceptance of the truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When they listen to that which hath been revealed unto the messenger) when they hear Ja'far Ibn Abi Talib's recitation of what has been revealed to the messenger, (thou seest their eyes overflow with tears because of their recognition of the Truth) their recognition of the traits and description of Muhammad (pbuh) in their Scripture. (They say: Our Lord) our Lord, (we believe) in You, in Your Book and in Your Messenger Muhammad. (Inscribe us as among the witnesses) make us of the Community of Muhammad (pbuh) who believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ترى أعينهم تفيض من الدمع } شوقاً إلى ما عرفوا من توحيد الذات لأنهم كانوا أهل رياضة وذوق فهاجت نفوسهم بسماع الوحي وذكروا الوحدة { مما عرفوا من الحق } بصفاته أو سمعوا من الحق كلامه، فبكوا اشتياقاً كما قال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من غاية تشوقهم إلى مرتبة اليقين الحقي { إِذَا سَمِعُواْ مَآ أُنزِلَ إِلَى ٱلرَّسُولِ } من الحكم والأحكام والتذكير، والرموز والإشارات، والعبر والأمثال، المنبئ كل منها من مرتبة اليقين الحقي { تَرَىۤ } أيها الرائي { أَعْيُنَهُمْ تَفِيضُ } تسيل { مِنَ ٱلدَّمْعِ } من غاية تلذذهم، ونهاية تشوقهم بتلك المرتبة، وذلك التذلل والتشوق { مِمَّا عَرَفُواْ } بقدر وسعهم وطاقتهم { مِنَ } أمارات مرتبة { ٱلْحَقِّ } فكيف إذا تحققوا بها، وتمكنوا في مقعد الصدق\n\n\n\n\n{ يَقُولُونَ } من غاية تحننهم وتشوقهم منادياً، مناجياً، قلقاً، حائراً، خائفاً، حذراً، راجياً: { رَبَّنَآ آمَنَّا } صدقنا، وتحققنا بمَّا وهبت لنا من مرتبتي العلم والعين، وبعدما تحققنا بتوفيقك بهما { فَٱكْتُبْنَا } بلطفك { مَعَ ٱلشَّاهِدِينَ } [المائدة: 83] المتمكنين الذين حضروا وانقطع سيرهم، وحاروا إلى أن تاهوا أو فانوا، لا إله إلا هو، كل شيء هالك إلا وجهه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}