{
  "chapter": "المائدة",
  "text": "وما لنا لا نؤمن بالله وما جاءنا من الحق ونطمع ان يدخلنا ربنا مع القوم الصلحين",
  "translations": [
    {
      "translation": "How could we not have iman in Allah, and the truth that has come to us, when we long for our Lord to include us among the righteous?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should we not believe in God and what has come down to us of the truth? And we hope to be admitted by our Lord among those who are upright and do good?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should we not believe in Allah and the Truth which has come down to us when we do fervently desire that our Lord include us among the righteous?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should we not believe in God and the Truth that has come to us and hope that the Lord will admit us into the company of the righteous people?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And what is the matter with us, that we should not believe in Allah and this truth which has come to us? And we hope that our Lord will admit us along with the righteous.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should we not believe in Allah and in that which has come to us of the truth And we wish that our Lord will admit us along with the righteous people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what (reason) have we that we should not believe in Allah and in the truth that has come to us, while we earnestly desire that our Lord should cause us to enter with the good people?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should we not believe in God and the truth that has come to us, and be eager that our Lord should admit us with the righteous people?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How should we not believe in Allah and that which hath come unto us of the Truth. And (how should we not) hope that our Lord will bring us in along with righteous folk?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should we not believe in God and in the truth that has come down to us? We yearn for our Lord to admit us among the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what aileth us that we should not believe in Allah and that which hath come unto us of the truth; and we long that our Lord will enter us with the righteous people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should we not believe in Allah and the truth that has come to us, eager as we are that our Lord should admit us among the righteous people?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What cause can we have not to believe in Allah and the truth which has come to us, seeing that we long for our Lord to admit us to the company of the righteous?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should we not believe in Allah and in that which has come to us of the truth (Islamic Monotheism)? And we wish that our Lord will admit us (in Paradise on the Day of Resurrection) along with the righteous people (Prophet Muhammad SAW and his Companions).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should we not believe in Allah and in the truth that has come down to us? Why should we not hope for admission among the righteous'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And why should we not believe in God, and in the truth that has come to us, and hope that our Lord will include us among the righteous people?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should we not believe in Allah and what has come to us of the truth? And we aspire that our Lord will admit us [to Paradise] with the righteous people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:84] And, in response to those Jews who reviled them for their Islam, they would say: why should we not believe in God and what has come to us of the truth, the Qur’ān, that is to say, there is nothing to prevent us from faith when its prerequisites are present; and hope (natma‘u is a supplement to nu’minu, ‘we believe’) that our Lord should admit us with the righteous people?’, the believers, into Paradise?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "124 When their own people blamed them for believing, they said: (How should we not believe in Allah and that which hath come unto us of the Truth) He says: and also believe in the Truth that has come to us from Scripture and the Messenger. (And (how should we not) hope that our Lord will) in the Hereafter in Paradise (bring us in along with righteous folk) the righteous among the Community of Muhammad (pbuh)?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } يقولون أيضاً من غاية تحسرهم وتعطشهم: { مَا لَنَا } أي: أيّ شيء عرض لنا { لاَ نُؤْمِنُ } نصدق ونوقن ونذعن { بِٱللَّهِ } المتوحد، المتجلي في الأكوان، المستغني عن الدليل والبرهان { وَ } لا نتبع ونمتثل { مَا جَآءَنَا مِنَ } دلائل { ٱلْحَقِّ } وبنيانه { وَ } مع ذلك { نَطْمَعُ } ونرجو { أَن يُدْخِلَنَا رَبُّنَا مَعَ ٱلْقَوْمِ ٱلصَّالِحِينَ } [المائدة: 84] لتلك المرتبة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: القسيس: العالم، والراهب، العابد، و { مما عرفوا }: سببية، و { من الحق }: بيان أو تبعيض، وجملة: { لا نؤمن }: حال، والعامل فيها متعلق الجار، أي: أي شيء حصل لنا حال كوننا غير مؤمنيين، و { نطمع }: عطف على { نؤمن } ، أو خبر عن مضمر، أي: ونحن نطمع\n يقول الحقّ جلّ جلاله: { لتجدن أشد الناس عداوة } للمؤمنين اليهود والمشركين، لشدة شكيمتهم وتضاعف كفرهم، وانهماكهم في اتباع الهوى، وركونهم إلى التقليد، وبعدهم عن التحقيق، وتمرنهم على تكذيب الأنبياء، ومعاداتهم وعدوانهم لا ينقطع إلى الأبد\n { ولتجدن أقربهم مودة للذين آمنوا الذين قالوا إنّا نصارى } ، للين جانبهم، ورقة قلوبهم، وقلة حرصهم على الدنيا بالنسبة لليهود، وكثرة اهتمامهم بالعلم والعمل، وإليه أشار بقوله: { ذلك بأن منهم قسيسين } أي: علماء، ومن جملة علمهم: علمُهم بوصاية عيسى بالإيمان بمحمد صلى الله عليه وسلم، { ورهبانًا } أي: عبادًا، { وأنهم لا يستكبرون } عن قبول الحق إذا عرفوه، بخلاف اليهود لكثرة جحودهم، وفيه دليل على أن التواضع والإقبال على العلم والعمل محمود، وإن كان من كافر\n قاله البيضاوي\n { وإذا سمعوا ما أُنزل إلى الرسول } محمد صلى الله عليه وسلم { ترى أعينهم تفيض من الدمع } من البكاء، جعل أعينهم من فرط البكاء كأنها تفيض بأنفسها، وإنما يفيض دمعها، وذلك { مما عرفوا من الحق } حين سمعوه، أو من بعض الحق، فما بالك لو عرفوا كله؟ { يقولون ربنا آمنا } بذلك، أو بمحمد صلى الله عليه وسلم { فاكتبنا مع الشاهدين } بأنه حق، أو بنبوة محمد صلى الله عليه وسلم، أو من أمته الذين هم شهداء على الأمم\n نزلت في النجاشي وأصحابه، حين دعوا جعفرًا وأصحابه، وأحضروا القسيسين والرهبان، وأمره أن يقرأ عليهم القرآن، فقرأ سورة مريم، فبكوا وآمنوا بالقرآن\n وقيل: نزلت في ثلاثين أو سبعين رجلاً من قومه، وفدوا من عنده من الحبشة بأمره على رسول الله صلى الله عليه وسلم، فقرأ عليهم سورة { يَس } ، فبكوا وآمنوا، فصدر الآية عام، فالنصارى كلهم أقرب مودة للمسلمين، من آمن، ومن لم يؤمن، وإنما جاء التخصيص في قوله: { وإذا سمعوا } ، فالضمير إنما يرجع إلى من آمن منهم، كالنجاشي وأصحابه\n وإنما جاء الضمير عامًا لأن الجماعة تحمد بفعل الواحد\n انظر ابن عطية\n ولما دخل الإيمان في قلوبهم حين سمعوا القرآن، عاتبوا أنفسهم على التأخر عن الإيمان فقالوا: { وما لنا لا نؤمن بالله وما جاءنا من الحق }  { و } نحن { نطمع أن يدخلنا ربنا مع القوم الصالحين } ، وهي أمة محمد صلى الله عليه وسلم التي هي أفضل الأمم، وهذا منهم استفهامُ إنكار واستبعاد لانتفاء الإيمان مع قيام الداعي، وهو الطمع في الانخراط مع الصاحلين، والدخول في مداخلهم، { فأثابهم الله } أي: جازاهم { بما قالوا } واعتقدوا، { جنات تجري من تحتها الأنهار خالدين فيها وذلك جزاء المحسنين } الذين اعتادوا الإحسان في جميع الأمور، أو الذين أحسنوا النظر وأتقنوا العمل\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:15",
      "similarity": 0.7481097228361884
    },
    {
      "verse": "70:38",
      "similarity": 0.7232780596174216
    },
    {
      "verse": "7:56",
      "similarity": 0.6618205538511336
    },
    {
      "verse": "26:51",
      "similarity": 0.640886898934746
    },
    {
      "verse": "26:82",
      "similarity": 0.6183421079059719
    }
  ]
}