{
  "chapter": "المائدة",
  "text": "فاثبهم الله بما قالوا۟ جنت تجرى من تحتها الانهر خلدين فيها وذلك جزاء المحسنين",
  "translations": [
    {
      "translation": "Allah will reward them for what they say with Gardens with rivers flowing under them, remaining in them timelessly, for ever. That is the recompense of the good-doers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will reward them for saying so with gardens where streams flow by, where they will live for ever. This is the recompense of those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah rewarded them for these words with Gardens beneath which rivers flow so that they would abide there for ever. Such is the reward of the people who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus, God has given them as their reward, gardens wherein streams flow and wherein they will live forever. Such will be the recompense of the righteous people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So because of their saying, Allah bestowed them with Gardens beneath which rivers flow, in which they will abide forever; and this is the reward of the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So because of what they said, Allah awarded them with Gardens under which rivers flow, they will abide therein forever. Such is the reward of good-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore Allah rewarded them on account of what they said, with gardens in which rivers flow to abide in them; and this is the reward of those who do good (to others).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And God rewards them for what they say with gardens underneath which rivers flow, therein dwelling forever; that is the recompense of the good-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath rewarded them for that their saying - Gardens underneath which rivers flow, wherein they will abide for ever. That is the reward of the good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for their words God will reward them with Gardens through which rivers flow, wherein they shall abide forever. That is the reward of those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore Allah will reward them, for that which they said, with Gardens whereunder rivers flow as abiders therein: such is the recompense of the well-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, for what they said, Allah requited them with gardens with streams running in them, to remain in them [forever], and that is the reward of the virtuous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for this their prayer hath Allah rewarded them with gardens, with rivers flowing underneath,- their eternal home. Such is the recompense of those who do good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So because of what they said, Allah rewarded them Gardens under which rivers flow (in Paradise), they will abide therein forever. Such is the reward of good-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For their words Allah has rewarded them with Gardens underneath which rivers flow, where they shall live for ever. Such is the recompense of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will reward them for what they say—Gardens beneath which rivers flow, where they will stay forever. Such is the reward of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah rewarded them for what they said with gardens [in Paradise] beneath which rivers flow, wherein they abide eternally. And that is the reward of doers of good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:85] God, exalted be He, says: So God has rewarded them for what they have said with Gardens underneath which rivers flow, wherein they will abide; that is the requital of those who are virtuous, by believing.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah hath rewarded them) has decreed for them (for that their saying) for declaring their faith voluntarily. (Gardens beneath which) beneath its trees and habitation (rivers) of water, milk, wine and honey (flow, wherein they will abide for ever) remaining in Paradise for ever, never to die or be removed from it. (That) which I have mentioned (is the reward of the good) who testify to Allah's divine Oneness; it is also said that the good means those who are kind in speech and action.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأخلصوا فيما أظهروا { فَأَثَابَهُمُ ٱللَّهُ } وأورثهم { بِمَا قَالُواْ } راجياً\n مناجياً\n متمنياً\n متحسراً { جَنَّاتٍ } منتزهات من العلم والعين والحق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } أنهار المعارف والحقائق من ألسنة أرباب الكشف واليقين\n ليحيي بلدة ميتاً من المحجوبين المسجونين بسلاسل التلقليدات\n وأغلال الدلائل والتخمينات { خَالِدِينَ فِيهَا } ما شاء الله\n لا حول ولا قوة إلا بالله\n و { وَذٰلِكَ } الفوز العظيم\n والفضل الكريم { جَزَآءُ ٱلْمُحْسِنِينَ } [المائدة: 85] الموصلين إلى مرتبة حق اليقينز\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:136",
      "similarity": 0.6511690195189705
    },
    {
      "verse": "14:23",
      "similarity": 0.542550400033649
    },
    {
      "verse": "10:9",
      "similarity": 0.5184012437873093
    },
    {
      "verse": "3:198",
      "similarity": 0.5140547796547219
    },
    {
      "verse": "9:89",
      "similarity": 0.5101644971548553
    }
  ]
}