{
  "chapter": "المائدة",
  "text": "والذين كفروا۟ وكذبوا۟ بـايتنا او۟لئك اصحب الجحيم",
  "translations": [
    {
      "translation": "As for those who are kafir and deny Our Signs, they are the Companions of the Blazing Fire.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve and deny Our revelations are residents of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved and gave the lie to Our signs are rightfully the inmates of the Blazing Flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieved and denied Our revelations will be the dwellers of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved and denied Our signs, are the people of hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieved and belied Our Ayat, they shall be the dwellers of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who disbelieve and reject Our communications, these are the companions of the flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve, and cry lies to Our signs -- they are the inhabitants of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve and deny Our revelations, they are owners of hell-fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who deny the truth and deny Our signs will become the inmates of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieved and belied Our signs, they shall be the fellows of the Flaming Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who are faithless and deny Our signs—they shall be the inmates of hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who reject Faith and belie our Signs,- they shall be companions of Hell-fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieved and belied Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), they shall be the dwellers of the (Hell) Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieve and belie Our verses shall be the companions of Hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who disbelieve and deny Our signs—these are the inmates of the Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who disbelieved and denied Our signs - they are the companions of Hellfire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:86]   But those who disbelieve and deny Our signs — they are the inhabitants of Hell-fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But those who disbelieve) in Allah (and deny Our revelations) Muhammad and the Qur'an, (they are owners of hellflre) they are the folk of hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ كَفَرُواْ } بتوحيدنا { وَكَذَّبُواْ بِآيَٰتِنَآ } الدالة عليه، المبينة لطريقة { أُوْلَـۤئِكَ } البعداء، المحبوسون في مضيق الإمكان { أَصْحَٰبُ ٱلْجَحِيمِ } [المائدة: 86] لا نجاة لهم منها، ولا خلاص من غوائلها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nثم ذكر ضدهم فقال: { والذين كفروا وكذبوا بآياتنا أولئك أصحاب الجحيم } ، شفع بهم حال المؤمنين المصدقين، جمعًا بين الترغيب والترهيب، ليكون العبد بين خوف ورجاء\n والله تعالى أعلم\n الإشارة: أشد الناس إنكارًا على الفقراء، وأشدهم عداوة لهم، من تقدم في أسلافه رئاسة علم أو جاه أو صلاح أو نسبة شرف، وأقرب الناس مودة لهم من لم يتقدم له شيء من ذلك، فالعوام أقرب وأسهل للدخول في طريق الخصوص من غيرهم\n والله تعالى أعلم\n ولمّا تضمن الكلام مدح النصارى على ترهبهم، والحث على حبس النفس، ورفض الشهوات، أعقبه بالنهي عن الإفراط في ذلك والاعتداء عما حدّه الله بجعل الحلال حراماً، فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ لاَ تُحَرِّمُواْ طَيِّبَاتِ مَآ أَحَلَّ ٱللَّهُ }\n\n",
      "translations": []
    }
  ]
}