{
  "chapter": "المائدة",
  "text": "يايها الذين ءامنوا۟ لا تحرموا۟ طيبت ما احل الله لكم ولا تعتدوا۟ ان الله لا يحب المعتدين",
  "translations": [
    {
      "translation": "You who have iman! do not make haram the good things Allah has made halal for you, and do not overstep the limits. Allah does not love people who overstep the limits.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, do not forbid the good things God has made lawful for you; and do not transgress. God does not love transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Do not hold as unlawful the good things which Allah has made lawful to you, and do not exceed the bounds of right. Allah does not love those who transgress the bounds of right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not make unlawful the pure things which God has made lawful for you. Do not transgress for God does not love the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not forbid the pure things, which Allah has made lawful for you, and do not cross the limits; indeed Allah dislikes the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Make not unlawful the good things which Allah has made lawful to you, and transgress not. Verily, Allah does not like the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! do not forbid (yourselves) the good things which Allah has made lawful for you and do not exceed the limits; surely Allah does not love those who exceed the limits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, forbid not such good things as God has permitted you; and transgress not; God loves not transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Forbid not the good things which Allah hath made lawful for you, and transgress not, Lo! Allah loveth not transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not forbid the wholesome good things, which God made lawful to you. Do not transgress; God does not love the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! forbid not the clean things of that which Allah hath allowed unto you, and trespass not verily Allah approveth not the trespassers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not prohibit the good things that Allah has made lawful to you, and do not transgress. Indeed Allah does not like the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! make not unlawful the good things which Allah hath made lawful for you, but commit no excess: for Allah loveth not those given to excess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Make not unlawful the Taiyibat (all that is good as regards foods, things, deeds, beliefs, persons, etc.) which Allah has made lawful to you, and transgress not. Verily, Allah does not like the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not forbid the good things that Allah has made lawful to you. Do not transgress; Allah does not love the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not prohibit the good things God has permitted for you, and do not commit aggression. God does not love the aggressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not prohibit the good things which Allah has made lawful to you and do not transgress. Indeed, Allah does not like transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:87] When a number of Companions resolved to practise fasting and night vigil continuously, and to abstain from women, perfume, consumption of meat, and sleeping on beds, the following was revealed: O you who believe, do not forbid the good things that God has made lawful for you and do not transgress, do [not] exceed God’s command; God does not love transgressors.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي خطاب للمؤمنين بأحكام تشريعية ، وتكملة على صورة التفريع جاءت لمناسبة ما تقدّم من الثناء على القسّيسين والرهبان . وإذ قد كان من سنّتهم المبالغة في الزهد وأحدثوا رهبانية من الانقطاع عن التزوّج وعن أكل اللحوم وكثير من الطيّبات كالتدهُّن وترفيه الحالة وحُسن اللباس ، نبّه الله المؤمنين على أنّ الثناء على الرهبان والقسّيسين بما لهم من الفضائل لا يقتضي اطّراد الثناء على جميع أحوالهم الرهبانيّة . وصادف أن كانَ بعضُ أصحاب رسول الله صلى الله عليه وسلم قد طمَحت نفوسهم إلى التقلّل من التعلّق بلذائذ العيش اقتداء بصاحبهم سيِّد الزاهدين صلى الله عليه وسلم روى الطبري والواحدي أنّ نفَراً تنافسوا في الزهد . فقال أحدُهم : أمّا أنا فأقوم الليل لا أنام ، وقال الآخر : أمَّا أنا فأصوم النهار ، وقال آخر : أمّا أنا فلا آتي النساء ، فبلغ خبرُهم رسولَ الله صلى الله عليه وسلم فبعث إليهم ، فقال : \" ألَمْ أنَبَّأ أنَّكم قلتم كذا . قالوا : بَلَى يا رسول الله ، وما أرَدْنا إلاّ الخَيْر ، قال : لَكِنِّي أقوم وأنام ، وأصوم وأفطر ، وآتي النساء ، فمن رغب عن سنّتي فليس منّي \" فنزلت هذه الآية . ومعنى هذا في «صحيحي البخاري ومسلم» عن أنس بن مالك وليس فيه أنّ ذلك سبب نزول هذه الآية .ورُوي أنّ ناساً منهم ، وهم : أبو بكر ، وعليّ ، وابن مسعود ، وابن عُمر ، وأبو ذرّ ، وسالم مولى أبي حذيفة ، والمقدادُ بن الأسود ، وسلْمان الفارسي ، ومعقل بن مُقَرّن اجتمعوا في دار عثمان بن مظعون واتّفقوا على أن يرفُضوا أشغال الدنيا ، ويتركوا النساء ويترهّبوا . فقام رسول الله فغلّظ فيهم المقالة ، ثم قال : \" إنّما هلك من كان قبلكم بالتشديد ، شَدّدوا على أنفسهم فشدّد الله عليهم فأولئك بقاياهم في الديار والصوامع \" فنزلت فيهم هذه الآية . . وهذا الخبر يقتضي أنّ هذا الاجتماع كان في أول مدّة الهجرة لأنّ عثمان بن مظعون لم يكن له دار بالمدينة وأسكنه النبي صلى الله عليه وسلم في دار أمّ العلاء الأنصارية التي قيل : إنّها زوجة زيد بن ثابت ، وتوفّي عثمان بن مظعون سنة اثنتين من الهجرة . وفي رواية : أنّ ناساً قالوا إنّ النصارى قد حرّموا على أنفسهم فنحن نحرّم على أنفسنا بعض الطيّبات فحرّم بعضهم على نفسه أكل اللحم ، وبعضهم النوم ، وبعضهم النساء؛ وأنّهم ألزموا أنفسهم بذلك بأيمان حلفوها على ترك ما التزموا تركه . فنزلت هذه الآية .وهذه الأخبار متظافرة على وقوع انصراف بعض أصحاب رسول الله صلى الله عليه وسلم إلى المبالغة في الزهد واردة في الصحيح ، مثل حديث عبد الله بن عمرو بن العاصي . قال : قال لي رسول الله : \" ألم أخْبَر أنّك تقوم الليل وتصوم النهارَ ، قلت : إنّي أفعلُ ذلك . قال : فإنّك إذا فعلتَ هجَمت عينُك ونَفِهَتْ نَفْسك . وإنّ لنفسك عليك حقاً ولأهلِك عليك حقّاً ، فصم وأفطر وقُم ونَم \"وحديث سلمان مع أبي الدرداء أنّ سلمان زار أبا الدرداء فصنع أبو الدرداء طعاماً فقال لسلمان : كُلْ فإنّي صائم ، فلمّا كانَ الليلُ ذهب أبو الدرداء يقوم ، فقال : نم ، فنام ، ثم ذهب يقوم فقال : نم ، فنام . فلمّا كان آخر اللّيل قال سلمان : قم الآن ، وقال سلمان : إنّ لربّك عليك حقّاً ولنفسك عليك حقّاً ولأهلك عليك حقّاً فأعط كلّ ذي حقّ حقّه . فأتى النبي صلى الله عليه وسلم فذكر ذلك له . فقال النبي عليه الصلاة والسلام : «صدقَ سلمانُ» . وفي الحديث الصحيح أنّ النبي صلى الله عليه وسلم قال : \" أمّا أنا فأقوم وأرقد وأصوم وأفطر وأتزوّج النساء فمن رغب عن سُنّتي فليس منّي \"والنهي إنّما هو عن تحريم ذلك على النفس . أمّا ترك تناول بعض ذلك في بعض الأوقات من غير التزام ولقصد التربية للنفس على التصبّر على الحِرمان عند عدم الوجدان ، فلا بأس به بمقدار الحاجة إليه في رياضة النفس . وكذلك الإعراض عن كثير من الطّيبات للتطلّع على ما هو أعلى من عبادة أو شغل بعمل نافع وهو أعلى الزهد ، وقد كان ذلك سنّة رسول الله صلى الله عليه وسلم وخاصّة من أصحابه ، وهي حالة تناسب مرتبته ولا تتناسب مع بعض مراتب الناس ، فالتطلّع إليها تعسير ، وهو مع ذلك كان يتناول الطيّبات دون تشوّف ولا تطلّع . وفي تناولها شكر لله تعالى ، كما ورد في قصّة أبي الدحداح حين حَلّ رسولُ الله وأبُو بكر وعمرُ في حائطه وأطعمهم وسقاهم . وعن الحسن البصري : أنّه دُعي إلى طعام ومعه فَرقد السَبَخي وأصحابه فجلسوا على مائدة فيها ألوان من الطعام دجاج مسمَّن وفالَوْذ فاعتزل فرقد نَاحِية . فسأله الحسن : أصائم أنت ، قال : لا ولكنّي أكره الألوان لأنّي لا أؤدّي شكره ، فقال له : الحسن : أفتشرب الماءَ البارد ، قال : نعم ، قال : إنّ نعمةَ الله في الماءِ البارد أكثر من نعمته في الفَالَوْذ .وليس المراد من النهي أن يلفظ بلفظ التحريم خاصّة بل أن يتركه تشديداً على نفسه سواء لفظ بالتحريم أم لم يلفظ به . ومن أجل هذا النهي اعتبر هذا التحريم لغواً في الإسلام فليس يلزم صاحبه في جميع الأشياء التي لم يجعل الإسلام للتحريم سبيلاً إليها وهي كلّ حال عدا تحريم الزوجة . ولذلك قال مالك فيمن حرّم على نفسه شيئاً من الحلال أو عمّم فقال : الحلال عليّ حرام ، أنّه لا شيء عليه في شيء من الحلال إلاّ الزوجة فإنّها تحرم عليه كالبتَات ما لم ينو إخراج الزوجة قبل النطق بصيغة التحريم أو يخرجها بلفظ الاستثناء بعد النطق بصيغة التحريم ، على حكم الاستثناء في اليمين .ووجهه أنّ عقد العصمة يتطرّق إليه التحريم شرعاً في بعض الأحوال ، فكان التزام التحريم لازماً فيها خاصّة ، فإنّه لو حرّم الزوجة وحدها حرمت ، فكذلك إذا شملها لفظ عامّ . ووافقه الشافعي . وقال أبو حنيفة : من حرّم على نفسه شيئاً من الحلال حَرم عليه تناوُله ما لم يكَفّر كفارة يمين ، فإنْ كفَّر حلّ له إلاّ الزوجة . وذهب مسروق وأبو سلمة إلى عدم لزوم التحريم في الزوجة وغيرها .وفي قوله تعالى : { لا تحرّموا طيّبات ما أحلّ الله لكم } تنبيه لفقهاء الأمّة على الاحتراز في القول بتحريم شيء لم يقم الدليل على تحريمه ، أو كان دليله غير بالغ قوة دليل النهي الوارد في هذه الآية .ثم إنّ أهل الجاهلية كانوا قد حرّموا أشياء على أنفسهم كما تضمنته سورة الأنعام ، وقد أبطلها الله بقوله : { قل من حرّم زينة الله التي أخرج لِعباده والطيّبات من الرزق } \\[ الأعراف : 32 \\] ، وقوله : { قد خسر الذين قتلوا أولادهم سفهاً بغير علم وحرّموا ما رزقهم الله افتراء على الله } \\[ الأنعام : 140 \\] ، وقوله : { قُل الذّكَرَيْننِ حَرّم أم الأنثيين إلى قوله { فمن أظلم ممّن افترى على الله كذباً ليُضلّ النّاس بغير علم } \\[ الأنعام : 143 ، 144 \\] ، وغير ذلك من الآيات . وقد كان كثير من العرب قد دخلوا في الإسلام بعد فتح مكّة دفعة واحدة كما وصفهم الله بقوله : { يدخلون في دين الله أفواجاً } \\[ النصر : 2 \\] . وكان قصر الزمان واتّساع المكان حائلين دون رسوخ شرائع الإسلام فيما بينهم ، فكانوا في حاجة إلى الانتهاء عن أمور كثيرة فاشية فيهم في مدّة نزول هذه السورة ، وهي أيام حجّة الوداع وما تقدّمها وما تأخّر عنها .وجملة { ولا تعتدوا } معترضة ، لمناسبة أنّ تحريم الطّيبات اعتداء على ما شرع الله ، فالواو اعتراضية . وبما في هذا النهي من العموم كانت الجملة تذييلاً .والاعتداء افتعال العدوْ ، أي الظلم . وذِكره في مقابلة تحريم الطيّبات يدلّ على أنّ المراد النهي عن تجاوز حدّ الإذننِ المشروع ، كما قال { تلك حدود الله فلا تعتدوها } \\[ البقرة : 229 \\] . فلمّا نهى عن تحريم الحلال أردفه بالنهي عن استحلال المحرّمات وذلك بالاعتداء على حقوق النّاس ، وهو أشدّ الاعتداء ، أو على حقوق الله تعالى في أمره ونهيه دون حقّ الناس ، كتناول الخنزير أو الميتة . ويعمّ الاعتداءُ في سياق النهي جميع جنسه ممّا كانت عليه الجاهلية من العدوان ، وأعظمه الاعتداء على الضعفاء كالوأْد ، وأكللِ مال اليتيم ، وعضل الأيامَى ، وغير ذلك .وجملة { إنّ الله لا يحبّ المعتدين } تذييل للّتي قبلها للتحذير من كلّ اعتداء .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe! Forbid not the good things which Allah hath made lawful for you) this verse was revealed about ten Companions of the Prophet (pbuh) among them were Abu Bakr, 'Umar, 'AN, 'Abdullah Ibn Mas'ud, 'Uthman Ibn Maz'un al-Jumahi, Miqdad Ibn al-Aswad al-Kindi, and Salim the client of Abu Hudhayfah Ibn 'Utbah, Salman al-Farisi, Abu Dharr, 'Ammar Ibn Yasir-these Companions vowed in the house of 'Uthman Ibn Maz'un that they would not eat or drink except that which was enough to keep them alive, that they would not have sex with their wives, that they would never eat meat or fat and that they would cut off their male organs. But Allah forbade them from such acts, and revealed about them: do not forbid the lawful things that Allah has permitted such as foods, drinks and having sex with your wives (and transgress not) by cutting off your male organs. (Lo! Allah loveth not transgressors) who move from the lawful to the unlawful by mutilating themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا أيها الذين آمنوا } إيماناً عملياً { لا تحرّموا طيبات ما أحلّ الله لكم } من مكاشفات الأحوال وتجليات الصفات بتقصيركم في السلوك { ولا تعتدوا } بطغيان النفس وظهورها بصفاتها واجعلوا ما رزقكم الله من علوم التجليات ومواهب الأحوال والمقامات غذاء قلوبكم سائغاً طيباً واجعلوا الله وقاية لكم في حصول تلك الكمالات بأن تروها منه وله لا منكم ولكم فتطغوا { إن كنتم } موحدين\n { وأطيعوا الله } بالفناء فيه فتنقادوا فيما يستعملكم فيه كالميت { وأطيعوا الرسول } بالبقاء بعد الفناء\n فتستقيموا فيه مراعين للتفصيل\n أحياء بحياته { واحذروا } ظهور البقاء حالة الاستقامة { فإن توليتم فاعلموا } أن التقصير منكم وما على الرسول إلا البلاغ لا الإلزام\n { ليس على الذين آمنوا } الإيمان الغيبي بتوحيد الأفعال { وعملوا } بمقتضى إيمانهم أعمالاً تخرجهم عن حجب الأفعال وتصلحهم لرؤية أفعال الحق\n حرج وضيق فيما تمتعوا به من أنواع الحظوظ إذا ما اجتنبوا بقايا أفعالهم واتّخذوا الله وقاية في صدور الأفعال منهم { وآمنوا } بتوحيد الصفات { وعملوا } ما يخرجهم عن حجب الصفات ويصلحهم لمشاهدة التجليات الإلهية بالمحو فيها { ثم اتّقوا } بقايا صفاتهم واتخذوا الله وقاية في صدور صفته عليهم { وآمنوا } بتوحيد الذات { ثم اتّقوا } بقية ذواتهم واتخذوا الله وقاية في وجودهم بالفناء المحض والاستهلاك في عين الذات وأحسنوا بشهود التفصيل في عين الجمع والاستقامة في البقاء بعد الفناء { والله يحبّ المحسنين } المشاهدين للوحدة في عين الكثرة\n المراعين لحقوق التفاصيل في عين الجمع بالوجود الحقاني",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لمَّا بلغ النصارى في الإعراض والترهب عن حظوظ الدنيا والذاتها إلى حيث يحرمون على أنفسهم ما أحلَّ الله لهم\n وأفرطوا فيه إلى حيث لم يبق مزاجهم على الاعتدال الذي جبلوا عليه\n أراد سبحانه أن ينبه على المؤمنين طريقاً مستقيماً\n وسبيلاً واضحاً متوسطاً بين طرفي الإفراط والتفريط\n لئلا يؤدي إلى تخريب المزاج وتحريفه\n إذ للحق سبحانه في إيجاد الأمزجة صنائع عجيبة\n وبدائع غريبة منتشئة عن محض الحكمة الجامع لجميع الأوصاف الذاتية الإلهية من العلم والقدرة والإرادة وغيرها\n\n\nفقال منادياً: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } صدِّقوا بدين الإسلام\n وامتثلوا ما أمروا فيه ونهوا عنه\n عليكم أن { لاَ تُحَرِّمُواْ طَيِّبَاتِ مَآ أَحَلَّ ٱللَّهُ لَكُمْ } في دينكم { وَلاَ تَعْتَدُوۤاْ } عن حدود الله\n ترهباً وتزهداً\n مفضياً إلى الرياء والسمعة { إِنَّ ٱللَّهَ } المدبر لعباده { لاَ يُحِبُّ ٱلْمُعْتَدِينَ } [المائدة: 87] المجاوزين عن مقتضى تدبيره وإصلاحه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله } أي: لا تحرموا ما طاب ولذ مما أحله الله لكم\n { ولا تعتدوا } فتحرموا ما أحللت لكم\n ويجوز أن يراد: ولا تعتدوا حدود ما أحل لكم إلى ما حرم عليكم\n فتكون الآية ناهية عن تحريم ما أحل وتحليل ما حرم\n داعية إلى القصد بينهما\n والوقوف على ما حد دون التجاوز إلى غيره\n رُوِي أن رسول الله صلى الله عليه وسلم وصَفَ القِيامَة يومًا\n وبالغ في إنذارهم\n فَرَقوا\n واجتمعوا في بيت عُثمان بن مظعون\n واتفقوا على ألا يزالوا صائمين قائمين\n وألا يناموا على الفُرُش\n ولا يأكُلوا اللحمَ والودَك\n ولا يَقربُوا النساء والطَّيبَ\n ويَرفضُوا الدُنيا\n ويلَبسُوا المُسوح\n ويَسيحُوا في الأرض\n ويَجُبُّوا مَذَاكِرَهم\n فَبلَغ ذلك رَسُولَ الله صلى الله عليه وسلم\n فقال لهم\n \" إني لم أُومرْ بذلكَ\n إنَّ لأنفُسِكُم عَليكُم حقًا\n فصُومُوا وأفطِرُوا\n وقُومُوا ونَاموا\n فإنِّي أقُومُ وأنام\n وأصُوم وأُفطِر\n وآكُلُ اللحم والدَّسم\n وآتى النساء\n فَمَن رَغِبَ عن سُنتي فَليس مني \" \nونزلت الآية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:88",
      "similarity": 0.5821555969300625
    },
    {
      "verse": "4:160",
      "similarity": 0.5212095007386303
    },
    {
      "verse": "66:1",
      "similarity": 0.4712176506371149
    },
    {
      "verse": "23:51",
      "similarity": 0.40722313380373004
    },
    {
      "verse": "16:114",
      "similarity": 0.40530651691632863
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005087.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005087.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:87.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}