{
  "chapter": "المائدة",
  "text": "يايها الذين ءامنوا۟ لا تحرموا۟ طيبت ما احل الله لكم ولا تعتدوا۟ ان الله لا يحب المعتدين",
  "translations": [
    {
      "translation": "You who have iman! do not make haram the good things Allah has made halal for you, and do not overstep the limits. Allah does not love people who overstep the limits.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, do not forbid the good things God has made lawful for you; and do not transgress. God does not love transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Do not hold as unlawful the good things which Allah has made lawful to you, and do not exceed the bounds of right. Allah does not love those who transgress the bounds of right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not make unlawful the pure things which God has made lawful for you. Do not transgress for God does not love the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not forbid the pure things, which Allah has made lawful for you, and do not cross the limits; indeed Allah dislikes the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Make not unlawful the good things which Allah has made lawful to you, and transgress not. Verily, Allah does not like the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! do not forbid (yourselves) the good things which Allah has made lawful for you and do not exceed the limits; surely Allah does not love those who exceed the limits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, forbid not such good things as God has permitted you; and transgress not; God loves not transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Forbid not the good things which Allah hath made lawful for you, and transgress not, Lo! Allah loveth not transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not forbid the wholesome good things, which God made lawful to you. Do not transgress; God does not love the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! forbid not the clean things of that which Allah hath allowed unto you, and trespass not verily Allah approveth not the trespassers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not prohibit the good things that Allah has made lawful to you, and do not transgress. Indeed Allah does not like the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! make not unlawful the good things which Allah hath made lawful for you, but commit no excess: for Allah loveth not those given to excess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Make not unlawful the Taiyibat (all that is good as regards foods, things, deeds, beliefs, persons, etc.) which Allah has made lawful to you, and transgress not. Verily, Allah does not like the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not forbid the good things that Allah has made lawful to you. Do not transgress; Allah does not love the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not prohibit the good things God has permitted for you, and do not commit aggression. God does not love the aggressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not prohibit the good things which Allah has made lawful to you and do not transgress. Indeed, Allah does not like transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:87] When a number of Companions resolved to practise fasting and night vigil continuously, and to abstain from women, perfume, consumption of meat, and sleeping on beds, the following was revealed: O you who believe, do not forbid the good things that God has made lawful for you and do not transgress, do [not] exceed God’s command; God does not love transgressors.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe! Forbid not the good things which Allah hath made lawful for you) this verse was revealed about ten Companions of the Prophet (pbuh) among them were Abu Bakr, 'Umar, 'AN, 'Abdullah Ibn Mas'ud, 'Uthman Ibn Maz'un al-Jumahi, Miqdad Ibn al-Aswad al-Kindi, and Salim the client of Abu Hudhayfah Ibn 'Utbah, Salman al-Farisi, Abu Dharr, 'Ammar Ibn Yasir-these Companions vowed in the house of 'Uthman Ibn Maz'un that they would not eat or drink except that which was enough to keep them alive, that they would not have sex with their wives, that they would never eat meat or fat and that they would cut off their male organs. But Allah forbade them from such acts, and revealed about them: do not forbid the lawful things that Allah has permitted such as foods, drinks and having sex with your wives (and transgress not) by cutting off your male organs. (Lo! Allah loveth not transgressors) who move from the lawful to the unlawful by mutilating themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لمَّا بلغ النصارى في الإعراض والترهب عن حظوظ الدنيا والذاتها إلى حيث يحرمون على أنفسهم ما أحلَّ الله لهم، وأفرطوا فيه إلى حيث لم يبق مزاجهم على الاعتدال الذي جبلوا عليه، أراد سبحانه أن ينبه على المؤمنين طريقاً مستقيماً، وسبيلاً واضحاً متوسطاً بين طرفي الإفراط والتفريط؛ لئلا يؤدي إلى تخريب المزاج وتحريفه؛ إذ للحق سبحانه في إيجاد الأمزجة صنائع عجيبة، وبدائع غريبة منتشئة عن محض الحكمة الجامع لجميع الأوصاف الذاتية الإلهية من العلم والقدرة والإرادة وغيرها\n\n\n\n\nفقال منادياً: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } صدِّقوا بدين الإسلام، وامتثلوا ما أمروا فيه ونهوا عنه، عليكم أن { لاَ تُحَرِّمُواْ طَيِّبَاتِ مَآ أَحَلَّ ٱللَّهُ لَكُمْ } في دينكم { وَلاَ تَعْتَدُوۤاْ } عن حدود الله؛ ترهباً وتزهداً، مفضياً إلى الرياء والسمعة { إِنَّ ٱللَّهَ } المدبر لعباده { لاَ يُحِبُّ ٱلْمُعْتَدِينَ } [المائدة: 87] المجاوزين عن مقتضى تدبيره وإصلاحه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا لا تحرموا طيبات ما أحل الله } أي: لا تحرموا ما طاب ولذ مما أحله الله لكم، { ولا تعتدوا } فتحرموا ما أحللت لكم، ويجوز أن يراد: ولا تعتدوا حدود ما أحل لكم إلى ما حرم عليكم، فتكون الآية ناهية عن تحريم ما أحل وتحليل ما حرم، داعية إلى القصد بينهما، والوقوف على ما حد دون التجاوز إلى غيره\n رُوِي أن رسول الله صلى الله عليه وسلم وصَفَ القِيامَة يومًا، وبالغ في إنذارهم، فَرَقوا، واجتمعوا في بيت عُثمان بن مظعون، واتفقوا على ألا يزالوا صائمين قائمين، وألا يناموا على الفُرُش، ولا يأكُلوا اللحمَ والودَك، ولا يَقربُوا النساء والطَّيبَ، ويَرفضُوا الدُنيا، ويلَبسُوا المُسوح، ويَسيحُوا في الأرض، ويَجُبُّوا مَذَاكِرَهم، فَبلَغ ذلك رَسُولَ الله صلى الله عليه وسلم، فقال لهم\n\n \" إني لم أُومرْ بذلكَ، إنَّ لأنفُسِكُم عَليكُم حقًا، فصُومُوا وأفطِرُوا، وقُومُوا ونَاموا، فإنِّي أقُومُ وأنام، وأصُوم وأُفطِر، وآكُلُ اللحم والدَّسم، وآتى النساء، فَمَن رَغِبَ عن سُنتي فَليس مني \" \n",
      "translations": []
    }
  ]
}