{
  "chapter": "المائدة",
  "text": "وكلوا۟ مما رزقكم الله حللا طيبا واتقوا۟ الله الذى انتم به مؤمنون",
  "translations": [
    {
      "translation": "Eat the halal and good things Allah has provided for you, and have taqwa of Allah, Him in Whom you have iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat what is lawful and good of the provisions God has bestowed on you, and fear God in whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And partake of the lawful, good things which Allah has provided you as sustenance, and refrain from disobeying Allah in Whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat from the pure and lawful things that God has given to you. Have fear of God in Whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat of the sustenance which Allah has given you, the lawful and the pure – and fear Allah in Whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And eat of the things which Allah has provided for you, lawful and good, and have Taqwa of Allah in Whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And eat of the lawful and good (things) that Allah has given you, and be careful of (your duty to) Allah, in Whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat of what God has provided you lawful and good; and fear God, in whom you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat of that which Allah hath bestowed on you as food lawful and good, and keep your duty to Allah in Whom ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat the lawful and wholesome things, which God has given you. Fear God, in whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And eat of that wherewith Allah hath provided you as lawful and clean; and fear Allah in whom ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat the lawful and good things Allah has provided you, and be wary of Allah in whom you have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat of the things which Allah hath provided for you, lawful and good; but fear Allah, in Whom ye believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And eat of the things which Allah has provided for you, lawful and good, and fear Allah in Whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat of the lawful and good things with which Allah has provided you. Have fear of Allah in whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And eat of the lawful and good things God has provided for you; and be conscious of God, in whom you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And eat of what Allah has provided for you [which is] lawful and good. And fear Allah, in whom you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:88] And eat of the lawful and good food which God has provided you (halālan tayyiban, ‘lawful and good food’, is the direct object and the preceding genitive construction [mimmā, ‘of … which’] is a circumstantial qualifier connected to the former); and fear God, in Whom you are believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Eat of that which Allah hath bestowed on you as food lawful and good, and keep your duty to Allah in Whom ye are believers) fear Allah regarding mutilation and forbidding that which He has made lawful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إذا سمعتم من الحق ما سمعتم { كُلُواْ } من طيبات { مِمَّا رَزَقَكُمُ ٱللَّهُ حَلَـٰلاً } غير مسرفين في أكلها { طَيِّباً } من كدِّ يمينكم\n وعرق جبينكم مقدار ما يقوم مزاجكم ويقويكم على إقامة أمر الله وأحكامه { وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيۤ أَنتُم بِهِ مُؤْمِنُونَ } [المائدة: 88]\n موقنون مخلصون عن مجاوزة حدوده وارتكاب محظوراته\n واحذروا عن بطشه وانتقامه واعلموا أن خير قوتكم في دنياكم تقواكم ورضاكم\n لذلك أوصاكم سبحانه\n\n\nومن جملة الأمور التي تجب محافظتها عليكم في معاشكم\n\n لتكونوا مع المتقين المبرورين عند الله ألاَّ تجترئوا على اليمين والحلف بالله في الوقائع والعقود\n سيما على وجه الكذب قصداً واختياراً حتى لا تنحطوا عن مرتبة العدالة الفطرية\n ولا تحلقوا بالأخسرين\n[الكهف: 104] إلا أن تصدر عنكم هفوة بغتة بلا قصد على ما هو المتعارف عند العرب في أثناء أكثر الكلام: \" لا والله \" بلا إغراء وتمويه\n فإنه معفوٌّ عنكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى: { وكلوا مما رزقكم الله حلالاً طيبًا } أي: كلوا ما حل لكم وطاب مما رزقكم الله\n { واتقوا الله الذي أنتم به مؤمنون } فأحلوا حلاله واستعملوه\n وحرموا حرامه واجتنبوه\n الإشارة: طريقةُ العباد والزهاد: رفض الشهوات والملذوذات بالكلية\n زهدًا وورعًا وخوفًا من اشتغال النفس بطلبها\n فيتعطل وقتهم عن العبادة\n وطريقة المريدين السائرين: رفض ما تتعلق به النفس قبل الحصول\n وتشره إليه رياضة وتعففًا\n لئلا تتعلق هِممُهم بغير الله\n فما جاءهم من غير طلب ولا شره أكلوه وشكروا الله عليه\n ولا يقفون مع جوع ولا شبع\n وطريقة الواصلين العارفين: تجنب ما يقبض من غير يد الله\n فإذا أخذتهم سنة حتى غفلوا عن التوحيد فقبضوا شيئًا\n مع رؤية الواسطة\n أخرجوه عن ملكهم\n كما وقع لأبي مدين رضي الله عنه ويأخذون ما سوى ذلك قَلّ أو كثر\n ولا يقفون مع أخذ ولا ترك\n وفي الحكم: \" لا تمدن يديك إلى الأخذ من الخلائق\n إلا أن ترى أن المعطي فيهم مولاك\n فإن كنت كذلك فخذ ـ ما وافقك العلم \"\n ولما صدر من بعض الصحابة يمين على ترك ما تقدم\n ذكر لهم الكفارة\n وفيما تجب\n فقال: { لاَ يُؤَاخِذُكُمُ ٱللَّهُ بِٱللَّغْوِ فِيۤ أَيْمَانِكُمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:114",
      "similarity": 0.6268367430253596
    },
    {
      "verse": "5:87",
      "similarity": 0.5821555969300625
    },
    {
      "verse": "20:81",
      "similarity": 0.5355060533337761
    },
    {
      "verse": "23:51",
      "similarity": 0.5275850720524968
    },
    {
      "verse": "8:69",
      "similarity": 0.47927534443506314
    }
  ]
}