{
  "chapter": "المائدة",
  "text": "لا يؤاخذكم الله باللغو فى ايمنكم ولكن يؤاخذكم بما عقدتم الايمن فكفرته اطعام عشرة مسكين من اوسط ما تطعمون اهليكم او كسوتهم او تحرير رقبة فمن لم يجد فصيام ثلثة ايام ذلك كفرة ايمنكم اذا حلفتم واحفظوا۟ ايمنكم كذلك يبين الله لكم ءايته لعلكم تشكرون",
  "translations": [
    {
      "translation": "Allah does not take you to task for your inadvertent oaths, but He will take you to task for oaths you make intentionally. The expiation in that case is to feed ten poor people with the average amount you feed your family, or clothe them, or free a slave. Anyone without the means to do so should fast three days. That is the expiation for breaking oaths when you have sworn them. Keep your oaths. In this way Allah makes His Signs clear to you, so that hopefully you will be thankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not punish you but for what you swear in earnest. The expiation (for breaking an oath) is feeding ten persons who are poor, with food that you give your own families, or clothing them, or freeing a slave. But he who cannot do so should fast for three days. This is the expiation for an oath when you have sworn it. So abide by your oaths. Thus God makes His commandments clear to you: You may perhaps be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not take you to task for the oaths you utter vainly, but He will certainly take you to task for the oaths you have sworn in earnest. The expiation (for breaking such oaths) is either to feed ten needy persons with more or less the same food as you are wont to give to your families, or to clothe them, or to set free from bondage the neck of one man; and he who does not find the means shall fast for three days. This shall be the expiation for your oaths whenever you have sworn (and broken them.) But do keep your oaths. Thus does Allah make clear to you His commandments; maybe you will be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not hold you responsible for your thoughtless oaths. However, He will question you about your deliberate oaths. The expiation for breaking an oath is to feed ten needy people with food, typical of that which you feed to your own people, to clothe them or to set a slave free. One who cannot pay this, he must fast for three days to expiate his oaths. Keep your oaths. Thus, does God explain His Laws so that you will give Him thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not take you to task for oaths which are made unintentionally but He does take you to task for oaths which you ratify; so the redemption of such oaths is to provide food to ten needy persons equal to the average of what you feed your family, or to clothe them, or to free one slave; and for one who has no means, is the fasting for three days; this is the redemption of your oaths when you have sworn; and fulfil your oaths; this is how Allah explains His verses to you, so that you may be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not punish you for what is unintentional in your oaths, but He will punish you for your deliberate oaths; for its expiation feed ten poor, on a scale of the Awsat of that with which you feed your own families; or clothe them; or free a slave. But whosoever cannot afford, then he should fast for three days. That is the expiation for the oaths when you have sworn. And protect your oaths. Thus Allah makes clear to you His Ayat that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not call you to account for what is vain in your oaths, but He calls you to account for the making of deliberate oaths; so its expiation is the feeding of ten poor men out of the middling (food) you feed your families with, or their clothing, or the freeing of a neck; but whosoever cannot find (means) then fasting for three days; this is the expiation of your oaths when you swear; and guard your oaths. Thus does Allah make clear to you His communications, that you may be Fateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not take you to task for a slip in your oaths; but He will take you to task for such bonds as you have made by oaths, whereof the expiation is to feed ten poor persons with the average of the food you serve to your families, or to clothe them, or to set free a slave; or if any finds not the means, let him fast for three days. That is the expiation of your oaths when you have sworn; but keep your oaths. So God makes clear to you His signs; haply you will be thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not take you to task for that which is unintentional in your oaths, but He will take you to task for the oaths which ye swear in earnest. The expiation thereof is the feeding of ten of the needy with the average of that wherewith ye feed your own folk, or the clothing of them, or the liberation of a slave, and for him who findeth not (the wherewithal to do so) then a three days' fast. This is the expiation of your oaths when ye have sworn; and keep your oaths. Thus Allah expoundeth unto you His revelations in order that ye may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will not call you to account for your meaningless oaths, but He will call you to account for the oaths, which you swear in earnest. The expiation for a broken oath is the feeding of ten needy men with such food as you normally offer to your own people; or the clothing of ten needy men; or the freeing of one slave. Anyone who lacks the means shall fast for three days. That is the expiation of your breaking the oaths that you have sworn. Do keep your oaths. Thus God explains to you His commandments, so that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah shall not take you to task for the vain in your oaths; but he shall take you to task for that which your oaths make binding. The expiation thereof is the feeding of ten of the needy with the middle sort of that wherewith ye feed your households, or the clothing of them or the freeing of a neck; but whosoever cannot find, far him is a fasting of three days. That is the expiation of your oaths when ye have sworn and bear in mind your oaths. Thus doth Allah expound unto you His commandments, that haply ye may return thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah shall not take you to task for what is frivolous in your oaths; but He shall take you to task for what you pledge in earnest. The atonement for it is to feed ten needy persons with the average food you give to your families, or their clothing, or the freeing of a slave. He who cannot afford [any of these] shall fast for three days. That is the atonement for your oaths when you vow. But keep your oaths. Thus does Allah clarify His signs for you so that you may give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not call you to account for what is futile in your oaths, but He will call you to account for your deliberate oaths: for expiation, feed ten indigent persons, on a scale of the average for the food of your families; or clothe them; or give a slave his freedom. If that is beyond your means, fast for three days. That is the expiation for the oaths ye have sworn. But keep to your oaths. Thus doth Allah make clear to you His signs, that ye may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not punish you for what is uninentional in your oaths, but He will punish you for your deliberate oaths; for its expiation (a deliberate oath) feed ten Masakin (poor persons), on a scale of the average of that with which you feed your own families; or clothe them; or manumit a slave. But whosoever cannot afford (that), then he should fast for three days. That is the expiation for the oaths when you have sworn. And protect your oaths (i.e. do not swear much). Thus Allah make clear to you His Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not take you to account for a slip in your oaths. But He will take you to account for the oaths which you solemnly swear. Its expiation is the feeding of ten needy (people) with such food as you normally offer to your own people; or the clothing of them; or the freeing of a slave. He who does not have must fast three days. That is the expiation of your oaths when you have sworn; but keep your oaths. Allah makes plain to you His verses, in order that you are thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not hold you accountable for your unintended oaths, but He holds you accountable for your binding oaths. The atonement for it is by feeding ten needy people from the average of what you feed your families, or by clothing them, or by freeing a slave. Anyone who lacks the means shall fast for three days. That is the atonement for breaking your oaths when you have sworn them. So keep your oaths. Thus God makes clear His Revelations to you, that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will not impose blame upon you for what is meaningless in your oaths, but He will impose blame upon you for [breaking] what you intended of oaths. So its expiation is the feeding of ten needy people from the average of that which you feed your [own] families or clothing them or the freeing of a slave. But whoever cannot find [or afford it] - then a fast of three days [is required]. That is the expiation for oaths when you have sworn. But guard your oaths. Thus does Allah make clear to you His verses that you may be grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:89] God will not take you to task for a slip, contained, in your oaths, which is what the tongue utters spontaneously, without intending to swear an oath, such as when one says, ‘No, by God’, or ‘Yes, by God’; but He will take you to task for that to which you have pledged (read ‘aqadtum, ‘aqqadttum or ‘āqadttum) oaths, where you have sworn an oath intentionally; the expiation thereof, of the oath if you break it, is the feeding of ten of the needy, for each needy person one mudd measure, of the midmost food, from which, you feed your families, that is, the closest or the principal [food you consume], neither better, nor worse; or the clothing of them, with what may be [properly] called clothes, such as a shirt, a turban, or a loin cloth — it is not sufficient that these [items] mentioned be given only to one needy person, according to al-Shāfi‘ī; or the setting free of a, believing, slave, as applies in the expiation for slaying or repudiation through zihār, interpreting the general [stipulation] in a restricted sense; and whoever does not find the means, for any one of the [expiations] mentioned, then the fasting of three days, as an expiation for him — as it appears [in this verse], it is not obligatory to follow the [above] sequence [of alternatives when making an expiation], and this is the opinion of al-Shāfi‘ī. That, which is mentioned, is the expiation of your oaths if you have sworn, and have broken them; but keep your oaths, do not break them, unless it be for a righteous deed or setting right between people, as stated in the verse of sūrat al-Baqara [Q. 2:225]. So, in the same way that He has explained to you what has been mentioned, God makes clear to you His signs, so that you might be thankful, to Him for this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah will not take you to task for that which is unintentional in your oaths) Allah does not take you to task for the expiation of unintentional oaths, (but He will take you to task for the oaths which ye swear in earnest) He takes you to task for the intention of your hearts when you make oaths. (The expiation thereof) the expiation of the oath which is not unintentional (is the feeding often of the needy with the average of that wherewith ye feed your own folk) of bread and seasoning which you feed to them at lunch and dinner, (or the clothing of them) or the clothing of ten needy people whereby their nudity is covered: a shawl, a gown or a loin cloth, (or the liberation of a slave) whichever it is of these three options, (and for him who finds not (the wherewithal to do so)) any one of these three options (then a three day fast) consecutively. (This) which I have mentioned (is the expiation of your oaths when ye have sworn) and do not honour your oath; (and keep your oaths) the uttering of your oaths as well as the expiation of your oaths. (Thus Allah expoundeth unto you His revelations) His commands and prohibitions, as He expounds the expiation of oaths (in order that ye may give thanks) in order that you may show gratitude for expositing His commands and prohibitions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكما قال سبحانه: { لاَ يُؤَاخِذُكُمُ ٱللَّهُ } المجازي عن أعمالكم { بِٱللَّغْوِ } الصادر منكم { فِيۤ أَيْمَانِكُمْ } بلا قصد وتغرير { وَلَـٰكِن يُؤَاخِذُكُم } ويعذبكم { بِمَا عَقَّدتُّمُ ٱلأَيْمَانَ } أي: بالعقود التي وثقتموها بالأيمان\n وحنثتم فيها\n فعليكم بعدما حنثتهم أن تجبروها بالكفارة { فَكَفَّارَتُهُ } المسقط نكاله { إِطْعَامُ عَشَرَةِ مَسَاكِينَ مِنْ أَوْسَطِ مَا تُطْعِمُونَ أَهْلِيكُمْ أَوْ كِسْوَتُهُمْ } اي: كساوتهم على هذا الوجه { أَوْ تَحْرِيرُ رَقَبَةٍ } على تفاوت رتبكم ودرجاتكم عسراً أو يسراً\n\n\n{ فَمَن لَّمْ يَجِدْ } شيئاً منها { فَصِيَامُ ثَلاَثَةِ أَيَّامٍ } أي: فعليه أن يصوم ثلاثة أيام متوالية\n زجراً للنفس\n وجبراً لما انكسر من المروءة الفطرية { ذٰلِكَ } المذكور { كَفَّارَةُ أَيْمَانِكُمْ إِذَا حَلَفْتُمْ } جازمين حقيته وحنثتم\n وأمَّا إذا حلفتم كذباً وزوراً - والعياذ بالله - فنكاله لا يسقط عنكم إلا بخلاص التوبة الندامة المؤكدة { وَٱحْفَظُوۤاْ } أيها المؤمنون { أَيْمَانَكُمْ } التي حلفتم بها في مواقعها عن شوب الكذب والشك\n بل عن شوب الظن أيضاً إن أردتم أن تبروا فيها\n وتقسطوا عند الله\n { كَذٰلِكَ } الذي وعظتم به { يُبَيِّنُ ٱللَّهُ لَكُمْ آيَاتِهِ } الدالة على توحيده { لَعَلَّكُمْ تَشْكُرُونَ } [المائدة: 89] رجاء أن تتحققوا في مقام الشكر\n تصرفوا ما وهب لكم من العطايا إلى ما اقتضته حكمته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { في أيمانكم }: يتعلق باللغو، أو بيؤاخذكم. يقول الحقّ جلّ جلاله: { لا يُواخذكم الله باللغو في أيمانكم } وهو ما يصدر من الإنسان بلا قصد، كقوله: لا والله، وبلى والله. وإليه ذهب الشافعي، وقيل: هو الحلف على ما يظن أنه كذلك ولم يكن، وإليه ذهب مالك وأبو حنيفة، { ولكن يُؤاخذكم بما عقدتم الإيمان } عليه، أي: بما جزمتم عليه بالنية والقصد، { فكفارته } أي: ما عقدتم عليه إذا حلفتم، ويجوز التكفير قبل الحنث لظاهر الآية. ثم بيَّن الكفارة، فقال: { إطعام عشرة مساكين } ، فمن أطعم غنيًا لم تجزه، واشترط مالك أن يكونوا أحرارًا، وليس في الآية ما يدل على ذلك، ثم بيَّن نوعه فقال: { من أوسط ما تُطعمون أهليكم } أي: من وسط طعام أهليكم في القدر أو في الصفة، أما القدر فقال مالك: يطعم مُدًا لكل مسكين بمد النبي صلى الله عليه وسلم إذا كان في المدينة المشرفة، وفي غيرها وسط من الشبع، وقال الشافعي وابن القاسم: يجزىء المُد في كل مكان، وقال أبو حنيفة: إن غذاهم وعشاهم أجزأه. قلت: وهو قول في المدونة لمالك أيضًا. وأما الصنف، فاختلف: هل يطعم من عيش نفسه، أو من عيش بلده وهو المشهور؟ فمعنى الآية على هذا: { من أوسط ما تطعمون } أيها الناس { أهليكم } على الجملة { أو كسوتهم } فيكسو كل مسكين ما تصح به الصلاة، فالرجل ثوب، والمرأة قميص وخمار، { أو تحرير رقبة } مؤمنة على مذهب مالك لتقييدها بذلك في كفارة القتل. وأجاز أبو حنيفة عتق الكافر، لإطلاق اللفظ هنا، واشترط مالك أيضًا أن تكون مسلمة من العيوب، وليس في الآية ما يدل عليه، فهذه الثلاثة بالتخيير. { فمن لم يجد } واحدًا من هذه الثلاثة، ولم يقدر على شيء منها، بحيث لم يفضل له عن قوته وقوت عياله في يومه ما يطعم به، { فصيام ثلاثة أيام } يستحب تتابعها، اشترطه أبو حنيفة لأنه قرىء:  أيام متتابعات، والشاذ ليس بحجة، { ذلك } المذكور هو { كفارة أيمانكم إذا حلفتم } وحنثتم، { واحفظوا أيمانكم } أي: صونوا ألسنتكم عن كثرة الحلف، فيكون الله عرضة لأيمانكم، أو احفظوها بأن تبروا فيها ولا تحنثوا، إلا إن كان في الامتناع من الخير، فالحنث فيها أحسن، كما في الحديث. أو احفظوها بأن تكفروها إذا حنثتم، ولا تتهاونوا بها، { كذلك يُبيّن الله لكم آياته } أي: مثل ذلك البيان يُبين لكم أعلام شرائعه { لعلكم تشكرون } نعمة التعليم،أو نعمه الواجب شكرها، فإن مثل هذا التبيين يُسهل لكم المخرج من ضيق اليمين، فهو نعمة يجب شكرها. والله تعالى أعلم. الإشارة: ليس التشديد والتعقيد من شأن أهل التوحيد، إنما شأنهم الاسترسال مع ما يبرز من عنصر القدرة، ليس لهم وقت دون الوقت الذي هم فيه، قد حلّ التوحيد عُقدهم ودكّ عزائمهم، فهم في عموم أوقاتهم لا يدبرون ولا يختارون، وإن وقع منهم تدبير أو اختيار رجعوا إلى ما يفعل الواحد القهار، لا يبطشون إلى شيء ولا يهربون من شيء، إلا إن كان فيه مخالفة للشرع.\nولا يعقدون على ترك شيء من المباحات ولا على فعله، لأنهم لا يرون لأنفسهم فعلاً ولا تركًا، إن صدرت منهم طاعة شهدوا المنّة لله، وإن وقعت منهم زلّة أو غفلة تأدبوا مع الله، وبادروا بالتوبة إلى الله، وما صدر من الصحابة ـ رضوان الله عليهم ـ فلعل ذلك كان حالاً غالبة عليهم، قد أزعجهم وعظ النبي صلى الله عليه وسلم، وأنهضهم حاله، فلما رآهم غلب عليهم الحال ردّهم إلى حال الاعتدال، ولعل الحق ـ جل جلاله ـ، إنما جعل كفّارة اليمين جبرًا لخلل ذلك التعقيد، الذي صدر من الحالف مع تفريطه بالحنث، فكأنه حلف على فعل غيره، ففيه نوع من التألي على الله. والله تعالى أعلم. ولما أمر الحقّ جلّ جلاله بأكل الحلال الطيب أخرج ضده، فقال: { يَٰأَيُّهَا ٱلَّذِينَ آمَنُواْ إِنَّمَا ٱلْخَمْرُ وَٱلْمَيْسِرُ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:238",
      "similarity": 0.29914747829223337
    },
    {
      "verse": "4:92",
      "similarity": 0.2956003124332696
    },
    {
      "verse": "100:5",
      "similarity": 0.2887051620370789
    },
    {
      "verse": "68:28",
      "similarity": 0.287606585238608
    },
    {
      "verse": "4:5",
      "similarity": 0.26481544093814435
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005089.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005089.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:89.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}