{
  "chapter": "المائدة",
  "text": "وعد الله الذين ءامنوا۟ وعملوا۟ الصلحت لهم مغفرة واجر عظيم",
  "translations": [
    {
      "translation": "Allah has promised those who have iman and do right actions forgiveness and an immense reward.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has made a promise of forgiveness and the highest reward to those who believe and perform good deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised those who believe and do righteous deeds forgiveness from sins and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised forgiveness and a great reward to the righteously striving believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah’s promise to those who believe and are righteous, that for them will be forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised those who believe and do deeds of righteousness, that for them there is forgiveness and a great reward (i.e. Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised to those who believe and do good deeds (that) they shall have forgiveness and a mighty reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised those that believe, and do deeds of righteousness; they shall have; forgiveness and a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath promised those who believe and do good works: Theirs will be forgiveness and immense reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised those who believe and do good deeds forgiveness and a great reward;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath promised those who believe and work righteous works that for them shall be forgiveness; and a mighty hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised those who have faith and do righteous deeds forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those who believe and do deeds of righteousness hath Allah promised forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised those who believe (in the Oneness of Allah - Islamic Monotheism) and do deeds of righteousness, that for them there is forgiveness and a great reward (i.e. Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised those who believe and do good works forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has promised those who believe and work righteousness: they will have forgiveness and a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has promised those who believe and do righteous deeds [that] for them there is forgiveness and great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:9] God has promised those who believe and perform righteous deeds, an excellent promise: they shall have forgiveness and a great wage, that is, Paradise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah hath promised those who believe) in Muhammad and the Qur'an (and do good works) and do acts of obedience regarding that which is between them and their Lord: (Theirs will be forgiveness) of their sins in this world (and immense reward) in Paradise. 112\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَعَدَ ٱللَّهُ } المدبر لأمور عباده { ٱلَّذِينَ آمَنُواْ } بتوحيده { وَعَمِلُواْ ٱلصَّالِحَاتِ } المقربة نحوه، المأمورة من عنده بأن حصل لهم مغفرة لذنوبهم؛ تفضلاً وامتناناً (وَ) مع ذلك { لَهُم مَّغْفِرَةٌ وَأَجْرٌ عَظِيمٌ } [المائدة: 9] هو الفوز بشرف اللقاء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وعد }: يتعدى إلى مفعولين، وحذف هنا الثاني، أي: وعدهم أجرًا عظيمًا، دل عليه الجملة بعده\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا } عَامٌّ أريد به خاص، وهم أولوا الأمر منهم، الذين يلُون الحكم بين الناس، وما تقدم في سورة النساء باقٍ على عمومه، أي: { كونوا قوامين } على من تحت حكمكم، راعين لهم فإنكم مسؤولون عن رعيتكم، وكونوا مخلصين { لله } في قيامكم وولايتكم، { شهداء } على أنفسكم بالعدل، تشهدون عليها بالحق إن توجه عليها، ولا تمنعكم الرئاسة من الإنصاف في الحق، إن توجه عليكم، أو على أقاربكم وأصدقائكم، ولا على عدوكم { ولا يجرمنكم } أي: ولا يحملنكم { شنئان قوم } أي: شدة بغضهم لكم، { على ألا تعدلوا } فيهم، فتمنعوهم من حقهم، أو تزيدوا في نكالهم، تشفيًا وغيظًا\n { اعدلوا هو } أي: العدل { أقرب للتقوى } ، قال البيضاوي: صرح لهم بالأمر بالعدل، وبيَّن أنه بمكان من التقوى بعد ما نهاهم عن الجور، وبيَّن أنه مقتضى الهوى\n فإذا كان هذا العدل مع الكفار، فما بالك مع المؤمنين؟\n هـ\n { واتقوا الله } ولا تراقبوا سواه، { إن الله خبير بما تعملون } فيجازي كلاًّ على عمله، من عدل أو جور\n ثم ذكر ثواب من امتثل، فقال: { وعد الله الذين آمنوا وعملوا الصالحات لهم مغفرة وأجر عظيم } ، وأفضل الأعمال: العدل في الأحكام\n قال عليه الصلاة والسلام:\n\n \" المُقسِطُونَ عَلَى مَنَابِرَ مِن نُورٍ يومَ القيامة \" \n\n\n\n الحديث، هو من السبعة الذين يظلهم الله في ظله",
      "translations": []
    }
  ]
}