{
  "chapter": "المائدة",
  "text": "يايها الذين ءامنوا۟ انما الخمر والميسر والانصاب والازلم رجس من عمل الشيطن فاجتنبوه لعلكم تفلحون",
  "translations": [
    {
      "translation": "You who have iman! wine and gambling, stone altars and divining arrows are filth from the handiwork of Shaytan. Avoid them completely so that hopefully you will be successful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, this wine and gambling, these idols, and these arrows you use for divination, are all acts of Satan; so keep away from them. You may haply prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Intoxicants, games of chance, idolatrous sacrifices at altars, and divining arrows are all abominations, the handiwork of Satan. So turn wholly away from it that you may attain to true success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, wine, gambling, the stone altars and arrows (that the pagans associate with certain divine characters) are all abominable acts associated with satanic activities. Avoid them so that you may have everlasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Wine (all intoxicants), and gambling, and idols, and the darts are impure – the works of Satan, therefore keep avoiding them so that you may succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Khamr, Maysir, Ansab, and Azlam are a Rijs of Shaytan's handiwork. So avoid that in order that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! intoxicants and games of chance and (sacrificing to) stones set up and (dividing by) arrows are only an uncleanness, the Shaitan's work; shun it therefore that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, wine and arrow-shuffling, idols and divining-arrows are an abomination, some of Satan's work; so avoid it; haply So you will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Strong drink and games of chance and idols and divining arrows are only an infamy of Satan's handiwork. Leave it aside in order that ye may succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, intoxicants and gambling and [occult dedication of] stones and divining arrows are abominations devised by Satan. Avoid them, so that you may prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! wine and gambling and stone altars and divining arrows are only an abomination, a handiwork of Satan, shun it wherefore, that haply ye may fare well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Indeed wine, gambling, idols, and the divining arrows are abominations of Satan’s doing, so avoid them, so that you may be felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Intoxicants and gambling, (dedication of) stones, and (divination by) arrows, are an abomination,- of Satan's handwork: eschew such (abomination), that ye may prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Intoxicants (all kinds of alcoholic drinks), gambling, Al-Ansab, and Al-Azlam (arrows for seeking luck or decision) are an abomination of Shaitan's (Satan) handiwork. So avoid (strictly all) that (abomination) in order that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, wine and gambling, idols and divining arrows are abominations from the work of satan. Avoid them, in order that you prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Intoxicants, gambling, idolatry, and divination are abominations of Satan’s doing. Avoid them, so that you may prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, indeed, intoxicants, gambling, [sacrificing on] stone alters [to other than Allah], and divining arrows are but defilement from the work of Satan, so avoid it that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:90] O you who believe, verily wine, that intoxicates and overcomes the mind, and games of chance, gambling, and idols, and divinatory arrows are an abomination, an evil deemed vile, of Satan’s work, which he adorns; so avoid it, this abomination consisting of the things mentioned, do not do it; so that you might prosper.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe! Strong drink) which intoxicates the mind (and games of chance) all types of games of chance (and idols) the worship of idols (and divining arrows are only an infamy of Satan's handiwork) they 125 are unlawful because they are instigated by order of the devil and his whispering. (Leave it aside) avoid it (in order that ye may succeed) in order that you may escape Allah's anger and punishment and be safe in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلْخَمْرُ وَٱلْمَيْسِرُ } المَيسرُ: القِمَارُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {The wine and the gambling} - gambling is al-qimar (archery).",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم محافظة حدود الله الموضوعة فيكم لإصلاحكم أمراً ونهياً، كراهةً وندباً، حلاً وحرمة { إِنَّمَا ٱلْخَمْرُ } أي: مطلق ما يترتب عليه السكر وإزالة العقل من أي شيء أخذتم { وَٱلْمَيْسِرُ } القمار مع أي شيء لعبتم { وَٱلأَنصَابُ } أي: الأصنام الموضوعة؛ لتضليل العباد { وَٱلأَزْلاَمُ } الموضوعة للاستعلام مما استأثر الله به من غيبه، كلٌّ منها { رِجْسٌ مِّنْ عَمَلِ ٱلشَّيْطَانِ } قذر ونجس بلا واسطة أو واسطة { فَٱجْتَنِبُوهُ } أي: جانبوا، وأبعدوا أنفسكم عن كل منها { لَعَلَّكُمْ تُفْلِحُونَ } [المائدة: 90] رجاء أ تفوزوا بما يرضى به الله عنكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { رجس } خبر، وأفرده لأنه على حذف مضاف، أي: تعاطي الخمر، أو خبر عن الخمر، وخبر المعطوفات محذوف، أي: كذلك\n يقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا إنما } تناول { الخمر } وهو كل ما غيب العقل، دون الحواس، مع النشوة والطرب، { والميسر } وهو القمار { والأنصاب } وهو ما نصب ليُعبد من حجارة أو خشب، { والأزلام } أي: الاستقسام بها، وقد تقدم تفسيرها، { رجس } قذر خبيث تعافه العقول السليمة، { من عمل الشيطان } أي: من تسويله وتزيينه، { فاجتنبوه } أي: ما ذكر من تعاطي الخمر، وما بعده، { لعلكم تفلحون } أي: تفوزون بالرضوان والنعيم المقيم\n قال البيضاوي: اعلم أن الحق تعالى أكد تحريم الخمر والميسر في هذه الآية، بأن صدّر الجملة بإنما، وقرنها بالأنصاب والأزلام وسماهما رجسًا، وجعلهما من عمل الشيطان، تنبيهًا على أن الاشتغال بهما شر محض، وأمر بالاجتناب عن عينهما، وجعله سببًا يرجى منه الفلاح، ثم قرّر ذلك بأن بيّن ما فيهما من المفاسد الدنيوية والدينية المقتضية للتحريم فقال: { إنَّمَا يُرِيدُ الشَّيطَانُ أن يُوقِعَ بَينَكُمُ العَدَاوَةَ وَالبغضَاءَ فِي الخَمرِ وَالمَيسِرِ } ، وقد وقع ذلك في زمن الصحابة، وهي كانت سبب تحريمه، { ويصدّكم عن ذكر الله وعن الصلاة } إنما خصّ الخمر والميسر بإعادة الذكر وشرح ما فيهما من الوبال تنبيهًا على أنهما المقصودان بالبيان\n وذكر الأنصاب والأزلام للدلالة على أنهما مثلهما في الحرمة والشرارة لقوله صلى الله عليه وسلم:\n\n \" شَارِبُ الخَمرِ كَعَابِد الوَثَنِ \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:219",
      "similarity": 0.27528579509055545
    },
    {
      "verse": "5:91",
      "similarity": 0.25558138094295746
    },
    {
      "verse": "10:100",
      "similarity": 0.2145569305391207
    },
    {
      "verse": "9:125",
      "similarity": 0.20170285431104765
    },
    {
      "verse": "12:41",
      "similarity": 0.1922620911954401
    }
  ]
}