{
  "chapter": "المائدة",
  "text": "انما يريد الشيطن ان يوقع بينكم العدوة والبغضاء فى الخمر والميسر ويصدكم عن ذكر الله وعن الصلوة فهل انتم منتهون",
  "translations": [
    {
      "translation": "Shaytan wants to stir up enmity and hatred between you by means of wine and gambling, and to debar you from remembrance of Allah and from salat. Will you not then give them up?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan only wishes to create among you enmity and hatred through wine and gambling, and to divert you from the remembrance of God and prayer. Will you therefore not desist?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By intoxicants and games of chance Satan only desires to create enmity and hatred between you, and to turn you away from the remembrance of Allah and from Prayer. Will you, then, desist?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan wants to induce hostility and hatred among you through wine and gambling and to prevent you from remembering God and prayer. Will you then avoid such things?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The devil only seeks to instil hatred and enmity between you with wine and gambling, and to prevent you from the remembrance of Allah and from prayer; so have you desisted?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shaytan wants only to excite enmity and hatred between you with Khamr and Maysir, and hinder you from the remembrance of Allah and from the Salah (the prayer). So, will you not then abstain\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Shaitan only desires to cause enmity and hatred to spring in your midst by means of intoxicants and games of chance, and to keep you off from the remembrance of Allah and from prayer. Will you then desist?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan only desires to precipitate enmity and hatred between you in regard to wine and arrow-shuffling, and to bar you from the remembrance of God, and from prayer. Will you then desist?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan seeketh only to cast among you enmity and hatred by means of strong drink and games of chance, and to turn you from remembrance of Allah and from (His) worship. Will ye then have done?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan seeks to sow enmity and hatred among you by means of wine and gambling, and to keep you from the remembrance of God and from your prayers. Will you not then abstain?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan only seeketh to breed animosity and spites among you by means of wine and gambling and would keep you from the remembrance of Allah and from prayer; will ye not then desist?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Satan seeks to cast enmity and hatred among you through wine and gambling, and to hinder you from the remembrance of Allah and from prayer. Will you, then, relinquish?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan's plan is (but) to excite enmity and hatred between you, with intoxicants and gambling, and hinder you from the remembrance of Allah, and from prayer: will ye not then abstain?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shaitan (Satan) wants only to excite enmity and hatred between you with intoxicants (alcoholic drinks) and gambling, and hinder you from the remembrance of Allah and from As-Salat (the prayer). So, will you not then abstain?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "satan seeks to stir up enmity and hatred among you by means of wine and gambling, and to bar you from the remembrance of Allah and from praying. Will you not abstain from them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan wants to provoke strife and hatred among you through intoxicants and gambling, and to prevent you from the remembrance of God, and from prayer. Will you not desist?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan only wants to cause between you animosity and hatred through intoxicants and gambling and to avert you from the remembrance of Allah and from prayer. So will you not desist?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:91] Satan desires only to precipitate enmity and hatred between you through wine and games of chance, when you partake of them, because of the evil and discord that result therefrom; and to bar you, by your being preoccupied with them, from the remembrance of God and from prayer — He has specifically mentioned it [prayer] so as to magnify it. So will you then desist?, from partaking of them? In other words: Desist!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Satan seeketh only to cast among you enmity and hatred by means of strong drink) when you become drunk (and games of chance) when you loose your money, (and to turn you from remembrance of Allah) He says: intoxicants drive you from the obedience of Allah (and from (His) worship) He says: it also prevents you from performing the five daily prayers. (Will ye then have done?) will you then stop from indulging in them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّمَا يُرِيدُ ٱلشَّيْطَانُ } المضل { أَن يُوقِعَ بَيْنَكُمُ ٱلْعَدَاوَةَ وَٱلْبَغْضَآءَ فِي ٱلْخَمْرِ وَٱلْمَيْسِرِ } إلى حيث يفضي إلى المقاتلة والمشاجرة { وَ } يريد أن { يَصُدَّكُمْ عَن ذِكْرِ ٱللَّهِ } وخصوصاً { وَعَنِ ٱلصَّلاَةِ } التي هي معراج المؤمن نحو الحق { فَهَلْ أَنْتُمْ مُّنتَهُونَ } [المائدة: 91] أيها المؤمنون\n أم مهلكون بارتكابها\n إذ لا واسطة فيهما ولا عذر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ويصدّكم عن ذكر الله وعن الصلاة } إنما خصّ الخمر والميسر بإعادة الذكر وشرح ما فيهما من الوبال تنبيهًا على أنهما المقصودان بالبيان\n وذكر الأنصاب والأزلام للدلالة على أنهما مثلهما في الحرمة والشرارة لقوله صلى الله عليه وسلم:\n \" شَارِبُ الخَمرِ كَعَابِد الوَثَنِ \"\n \nوخصّ الصلاة من الذكر بالإفراد للتعظيم والإشعار بأن الصاد عنها كالصاد عن الإيمان من حيث إنها عماده\n والفارق بينه وبين الكفر\n ثم أعاد الحث على الانتهاء بصيغة الاستفهام مرتبًا على ما تقدم من أنواع الصوارف فقال: { فهل أنتم منتهون }؟ إيذانًا بإن الأمر في المنع والتحذير بلغ الغاية\n وأن الأعذار قد انقطعت\n هـ\n ولذلك لما سمعها الفاروق رضي الله عنه حين نزلت\n قال: قد انتهينا يا ربنا\n وبهذا الآية وقع تحريم الخمر\n وقد كان حلالاً قبلها\n بدليل سكوته صلى الله عليه وسلم على شربها قبل نزول الآية\n فإن قلت: حفظ العقول من الكليات الخمس التي اتفقت الشرائع على تحريمها؟ قلنا: لا حكم قبل الشرع\n بل الأمر موقوف إلى وروده\n ولما طالت الفترة\n وانقطعت الشرائع عند العرب\n رجعت الأشياء إلى أصلها من الإباحة بمقتضى قوله تعالى:\n[البَقَرة:29]\n حتى جاءت الشريعة المحمدية فحرمتها كالشرائع قبلها\n فكانت حينئٍذ حرامًا\n ودخلت في الكليات الخمس التي هي: حفظ العقول والأبدان والأموال والأنساب والأديان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:219",
      "similarity": 0.381196312085332
    },
    {
      "verse": "60:4",
      "similarity": 0.3589023967755529
    },
    {
      "verse": "5:14",
      "similarity": 0.2829948002621148
    },
    {
      "verse": "5:64",
      "similarity": 0.2632160639416931
    },
    {
      "verse": "5:90",
      "similarity": 0.25558138094295746
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/5:91.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/5:91.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/5:91.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}