{
  "chapter": "المائدة",
  "text": "واطيعوا۟ الله واطيعوا۟ الرسول واحذروا۟ فان توليتم فاعلموا۟ انما على رسولنا البلغ المبين",
  "translations": [
    {
      "translation": "Obey Allah and obey the Messenger and beware! If you turn your backs, know that Our Messenger is only responsible for clear transmission.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey God and the Prophet, and beware. If you turn away, remember, that the duty of Our Apostle is to give you a clear warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey Allah and obey the Messenger, and beware. But if you turn away, then know well that Our Messenger had merely to deliver the message clearly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey God and the Messenger and be cautious (of the harmful things). If you turn away (from Our laws), know that the duty of the Messenger is only to preach in clear words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and obey the Noble Messenger, and be cautious; then if you turn away, so know that the duty of Our Noble Messenger is only to plainly convey the message.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and obey the Messenger, and beware. Then if you turn away, you should know that it is Our Messenger's duty to convey in the clearest way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and obey the apostle and be cautious; but if you turn back, then know that only a clear deliverance of the message is (incumbent) on Our apostle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey God and obey the Messenger, and beware; but if you turn your backs, then know that it is only for Our Messenger to deliver the Message Manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey Allah and obey the messenger, and beware! But if ye turn away, then know that the duty of Our messenger is only plain conveyance (of the message).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey God and obey the Messenger, and be ever on your guard [against evil]. But if you turn away, then know that Our Messenger's duty is only to deliver the message clearly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey Allah and obey the apostle, and beware; but if ye turn away, then know that upon Our apostle resteth only the plain preaching.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and obey the Apostle, and beware; but if you turn your backs, then know that Our Apostle’s duty is only to communicate in clear terms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey Allah, and obey the Messenger, and beware (of evil): if ye do turn back, know ye that it is Our Messenger's duty to proclaim (the message) in the clearest manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and the Messenger (Muhammad SAW), and beware (of even coming near to drinking or gambling or Al-Ansab, or Al-Azlam, etc.) and fear Allah. Then if you turn away, you should know that it is Our Messenger's duty to convey (the Message) in the clearest way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey Allah, and obey the Messenger. Beware; if you give no heed, know that Our Messenger's duty is only to give the clear delivery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey God and obey the Messenger, and be cautious. If you turn away—know that the duty of Our Messenger is clear communication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and obey the Messenger and beware. And if you turn away - then know that upon Our Messenger is only [the responsibility for] clear notification.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:92] And obey God and obey the Messenger, and beware, of disobedient acts; but if you turn away, from obedience, then know that Our Messenger’s duty is only to proclaim plainly, to convey clearly [the Message] — your requital falls on Us.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Obey Allah and obey the messenger) regarding the prohibition of intoxicant drinks, (and beware!) of declaring them lawful or of drinking them. (But if ye turn away) from obeying them in relation to the prohibition of intoxicant drinks, (then know that the duty of Our messenger) Muhammad (is only plain) i.e. in a language that you understand (conveyance (of the message)) on behalf of Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَطِيعُواْ ٱللَّهَ } فيما أمركم به، ونهاكم عنه { وَأَطِيعُواْ ٱلرَّسُولَ } المبيّن لكم أمر الله ونهيه { وَٱحْذَرُواْ } عمَّا حذركم الله ورسوله { فَإِن تَوَلَّيْتُمْ } وأعرضتم بعد وضوح البرهان { فَٱعْلَمُوۤاْ أَنَّمَا عَلَىٰ رَسُولِنَا ٱلْبَلاَغُ ٱلْمُبِينُ } [المائدة: 92] الظاهر الواضح، وعلينا الحساب والأخذ، والانتقام والعذاب والنكال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم أكد ذلك أيضًا بقوله: { وأطيعوا الله وأطيعوا الرسول } فيما أمر ونهى { واحذروا } غضبهما إن خالفتم، { فإن توليتم } أو أعرضتم عن طاعتهما { فاعلموا أنما على رسولنا البلاغ المبين } لا تضرّه مخالفتكم، إنما عليه البلاغ وقد بلغ\n\n\nالإشارة: المقصود هو النهي عن كل ما يصد عن الله أو يشغل العبد عن شهود مولاه، وخص هذه الأربعة، لأنها أمهات الخطايا ومنبع الغفلة والبلايا، فالخمر فيه فساد العقل الذي هو محل الإيمان، والميسر فيه فساد المال وفساد القلب بالعداوة، والشحناء، وفساد الفكر لاستعماله في الهوى، والأنصاب فيه فساد الدين الذي هو رأس المال، والأزلام فيه الفضول والاطلاع على علم الغيب، الذي هو سر الربوبية، وهو موجب للمقت والعطب، والعياذ بالله\n ثم عفا عما سلف من الخمر والميسر قبل التحريم، فلقال: { لَيْسَ عَلَى ٱلَّذِينَ آمَنُواْ وَعَمِلُواْ ٱلصَّالِحَاتِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:56",
      "similarity": 0.7017219674502562
    },
    {
      "verse": "64:12",
      "similarity": 0.5591850893713801
    },
    {
      "verse": "3:28",
      "similarity": 0.5066699596660141
    },
    {
      "verse": "24:54",
      "similarity": 0.46271924407139703
    },
    {
      "verse": "5:49",
      "similarity": 0.41411115386485325
    }
  ]
}