{
  "chapter": "المائدة",
  "text": "يايها الذين ءامنوا۟ ليبلونكم الله بشىء من الصيد تناله ايديكم ورماحكم ليعلم الله من يخافه بالغيب فمن اعتدى بعد ذلك فله عذاب اليم",
  "translations": [
    {
      "translation": "You who have iman! Allah will test you with game animals which come within the reach of your hands and spears, so that Allah will know those who fear Him in the Unseen. Anyone who oversteps the limits after this will have a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, God will surely try you with the game that you take with your hands or your lances, in order to know who fear Him unseen. Whosoever transgress after this will suffer grievous punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Allah will surely try you with a game which will be within the range of your hands and lances so that He might mark out those who fear Him, even though He is beyond the reach of human perception. A painful chastisement awaits whosoever transgresses after that the bounds set by Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, God will test you (to see the strength of your obedience) concerning what you hunt by hand or spear, so that He would know who has fear of Him in private. Whoever transgresses will suffer a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Allah will surely test you with some prey that is within reach of your hands and your spears, so that Allah may make known those who fear Him without seeing; so henceforth, a painful punishment is for anyone who transgresses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Allah will certainly make a trial for you with something in the game that is well within reach of your hands and your lances, that Allah may test who fears Him in the unseen. Then whoever transgresses thereafter, for him there is a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Allah will certainly try you in respect of some game which your hands and your lances can reach, that Allah might know who fears Him in secret; but whoever exceeds the limit after this, he shall have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, God will surely try you with something of the game that your hands and lances attain, that God may know who fears Him in the Unseen. Whoso thereafter commits transgression, there awaits him a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Allah will surely try you somewhat (in the matter) of the game which ye take with your hands and your spears, that Allah may know him who feareth Him in secret. Whoso transgresseth after this, for him there is a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, God will test you with game which come within the reach of your hands and spears, so that He may know those who fear Him, even if they cannot see Him. Anyone who oversteps the limits after this will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Allah shall surely prove you with aught of the chases which your hands and your lances may reach, in order that Allah may know whosoever feareth Him unseen; so whosoever shall trespass thereafter, for him is a torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Allah will surely test you with some of the game within the reach of your hands and spears, so that Allah may know those who fear Him in secret. So whoever transgresses after that, there is a painful punishment for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Allah doth but make a trial of you in a little matter of game well within reach of game well within reach of your hands and your lances, that He may test who feareth him unseen: any who transgress thereafter, will have a grievous penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Allah will certainly make a trial of you with something in (the matter of) the game that is well within reach of your hands and your lances, that Allah may test who fears Him unseen. Then whoever transgresses thereafter, for him there is a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, Allah will test you by means of some hunting which you can catch with your hands and with your spears, in order that Allah knows those who fear Him in private. For he who transgresses thereafter shall be a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! God will test you with something of the game your hands and spears obtain, that God may know who fears Him at heart. Whoever commits aggression after that will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, Allah will surely test you through something of the game that your hands and spears [can] reach, that Allah may make evident those who fear Him unseen. And whoever transgresses after that - for him is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:94] O you who believe, God will surely try you, He will surely test you, with some game, which He releases to you, the smaller of, which will be caught by your hands and, the larger of which by, your lances: this was in [the plain of] al-Hudaybiyya; while they were in [the state of] pilgrimage inviolability, beasts and birds would flock to their caravans; so that God may know, through knowledge outwardly manifested, who fears Him in the Unseen (bi’l-ghayb is a circumstantial qualifier), in other words, while He is absent [to the eyes], one who does not see Him but nonetheless avoids hunting game. Whoever transgresses thereafter, after that prohibition against it, and hunts, his shall be a painful chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah revealed the unlawfulness of game in the year of al-Hudaybiyyah, saying: (0 ye who believe) in Muhammad and the Qur'an! (Allah will surely try you somewhat (in the matter) of the game) He will test you regarding the game you pursue on land (which ye take) of their eggs and little ones (with your hands and your spears) to catch wild animals in the year of al-Hudaybiyyah, (that Allah may know) that Allah may see (him who feareth Him in secret) and thus leave the game. (Whoso transgresseth) intentionally (after this) after Allah has decreed the requital and ruling of this, (for him there is a painful doom) a painful beating which will extend to his back and belly.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَيَبْلُوَنَّكُمُ } معناهُ لَيختَبِرنَّكُم\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - Almighty - {they will test you} means {they will test you}.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَـٰأَيُّهَا ٱلَّذِينَ آمَنُواْ لَيَبْلُوَنَّكُمُ } ويختبرنكم { ٱللَّهُ بِشَيْءٍ } حقير { مِّنَ ٱلصَّيْدِ } حال كونكم محرمين يغشاكم بحيث { تَنَالُهُ أَيْدِيكُمْ وَرِمَاحُكُمْ } من غاية قربه، هل ما تأخذونه وتشوشونه، أم تحفظون أمر التحريم، وتراعون حقه، وما ذلك إلا { لِيَعْلَمَ ٱللَّهُ } أي: يميز ويفصل { مَن يَخَافُهُ بِٱلْغَيْبِ } أي: من انتقامه في يوم الجزاء عمَّن لا يخاف، ولا يبال بأمره وشأنه { فَمَنِ ٱعْتَدَىٰ } وتجاوز { بَعْدَ ذٰلِكَ } أي: بعدما سمع من الحق ما سمع { فَلَهُ عَذَابٌ أَلِيمٌ } [المائدة: 94] وعقاب عظيم باعتدائه واجترائه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:96",
      "similarity": 0.208816513409124
    },
    {
      "verse": "5:1",
      "similarity": 0.19122237601987063
    },
    {
      "verse": "5:2",
      "similarity": 0.1708074604316062
    },
    {
      "verse": "5:95",
      "similarity": 0.1581678407734236
    },
    {
      "verse": "2:124",
      "similarity": 0.1530338102576476
    }
  ]
}