{
  "chapter": "المائدة",
  "text": "احل لكم صيد البحر وطعامه متعا لكم وللسيارة وحرم عليكم صيد البر ما دمتم حرما واتقوا۟ الله الذى اليه تحشرون",
  "translations": [
    {
      "translation": "Anything you catch in the sea is halal for you, and all food from it, for your enjoyment and that of travellers, but land game is haram for you while you are in ihram. So have taqwa of Allah, Him to whom you will be gathered.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lawful is all game of the water for you, and eating of it as food, so that you and the travellers may benefit by it. But unlawful is game of the jungle when you are on pilgrimage. Fear God before whom you have to gather in the end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The game of the water and eating thereof are permitted to you as a provision for you (who are settled) and for those on a journey; but to hunt on land while you are in the state of Pilgrim sanctity is forbidden for you. Beware, then, of disobeying Allah to Whom you shall all be mustered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is lawful for you to hunt from the sea and to eat seafood. This is for your benefit and for the benefit of travellers. However, it is not lawful for you to hunt on land as long as you are in the sacred precinct. Have fear of God before whom you will all be raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is lawful for you to hunt from the sea and to eat from it, for your benefit and that of the travellers; and hunting on land is forbidden for you while you are on the pilgrimage; and fear Allah, towards Whom you will arise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lawful to you is water game and its use for food -- for the benefit of yourselves and those who travel, but forbidden is (the pursuit of) land game as long as you are in a state of Ihram. And have Taqwa of Allah to Whom you shall be gathered back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lawful to you is the game of the sea and its food, a provision for you and for the travellers, and the game of the land is forbidden to you so long as you are on pilgrimage, and be careful of (your duty to) Allah, to Whom you shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permitted to you is the game of the sea and the food of it, as a provision for you and for the journeyers; but forbidden to you is the game of the land, so long as you remain in pilgrim sanctity; and fear God, unto whom you shall be mustered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To hunt and to eat the fish of the sea is made lawful for you, a provision for you and for seafarers; but to hunt on land is forbidden you so long as ye are on the pilgrimage. Be mindful of your duty to Allah, unto Whom ye will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To hunt and to eat the fish of the sea is made lawful for you, a provision made for you and for seafarers. But you are forbidden the game of the land while you are on a pilgrimage. Have fear of God, before whom you shall all be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allowed unto you is the game of the sea and the eating thereof: a provision for you and for the caravan; and forbidden unto you is the game of the land while ye are in the state of sanctity. And fear Allah unto whom ye shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are permitted the game of the sea and its food, a provision for you and for the caravans, but you are forbidden the game of the land so long as you remain in pilgrim sanctity, and be wary of Allah toward whom you will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lawful to you is the pursuit of water-game and its use for food,- for the benefit of yourselves and those who travel; but forbidden is the pursuit of land-game;- as long as ye are in the sacred precincts or in pilgrim garb. And fear Allah, to Whom ye shall be gathered back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lawful to you is (the pursuit of) water-game and its use for food - for the benefit of yourselves and those who travel, but forbidden is (the pursuit of) land-game as long as you are in a state of Ihram (for Hajj or 'Umrah). And fear Allah to Whom you shall be gathered back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Made lawful to you is the fished of the sea and its food, an enjoyment for you and for travelers. But you are forbidden the hunted of the land whilst you are on pilgrimage. Have fear of Allah, before whom you shall all be assembled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Permitted for you is the catch of sea, and its food—as sustenance for you and for travelers. But forbidden for you is the game of land while you are in pilgrim sanctity. And fear God, to whom you will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lawful to you is game from the sea and its food as provision for you and the travelers, but forbidden to you is game from the land as long as you are in the state of ihram. And fear Allah to whom you will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:96] Permitted to you, O people, be you in pilgrimage inviolability or not, is the game of the sea, for consumption, and it is what can only live in the sea, such as fish, but not what is able to live both in the sea and on land, such as crabs; and food from it, what it casts out that is dead, is a provision for you, for you to consume, and for the wayfarers, the travellers among you, to take as their provisions; but forbidden to you   is the hunting of game on the land, and this consists of those edible beasts that live on it; do not hunt them, so long as you remain in pilgrimage inviolability: if it is caught by one not in pilgrimage inviolability, then it is permissible for a person in pilgrimage inviolability to consume it, as is clarified in the Sunna; and fear God, to whom you shall be gathered.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(To hunt and to eat the fish of the sea is made lawful for you) this was revealed about a people from the Banu Mudlij who lived off the sea. They asked the Prophet (pbuh) about the fish of the sea and about that which is washed out of the sea, so Allah revealed that it is lawful to fish just as it is lawful to eat that which is washed out by the sea (a provision for you) a benefit for you (and for seafarers; but to hunt on land is forbidden you so long as ye are on the pilgrimage) or in the Sacred Precinct. (Be mindful of your duty to Allah) fear Allah, (unto Whom ye will be gathered) and questioned about the game made forbidden for you during ritual consecration and at the Sacred Precinct.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُحِلَّ لَكُمْ } أيها المحرمون { صَيْدُ ٱلْبَحْرِ } مائي المولد مظلقاً إلا ما تستكرهه طباعكم { وَطَعَامُهُ } أكله { مَتَاعاً لَّكُمْ } يمتعون بها مجاناً { وَ } كذا { لِلسَّيَّارَةِ } للتجارة والزيارة وغيرها تتزودون منها { وَحُرِّمَ عَلَيْكُمْ صَيْدُ ٱلْبَرِّ مَا دُمْتُمْ حُرُماً } أي: من أول مدة إحرامكم إلى أول الحل { وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيۤ إِلَيْهِ تُحْشَرُونَ } [المائدة: 96] وتساقون أيها المؤمنون\n\n\n\n\nوعليكم الحذر والاتقاء عن التعرض بمصنوعاته بقهر وغلبة في جميع حالاتكم سيما عد لبس الإحرام الذي هو كفن الفناء المعنوي، والموت الحقيقي عند أولي الألباب الناظرين إلى لب الأحكام وزبدته\n\n\n\n\nوكما أنَّ في الموت الصوري لا يبقى للقوى والأوصاف الظاهرة آثار وأفعال، بل تعطلت، وانمحت، وتلاشت بحيث لا يتوقع منها ذلك أصلاً، كذلك في الموت الإرادي الذي هو عبارة عن حج العارف لا بد من إحرامه، وتعطيله أعضاءه وجوارحه عن مقتضيات الأوصاف البشرية والقوى الحيوانية، وعن جميع التعينات الجمسانية والرحانية، والغيبية والشهادية، والظاهرية والباطنية، وبالجلمة: عن جميع الإضافات والكثرات الحاجبة لصرافة الوحدة الذاتية، المستهلكة عنها جميع ما يتوهم من الأضلال والعكوس\n\n\n\n\nلذلك صار الموت الإرادي أشدُّ في الانمحاء، وأغرقُ في الفناء من الموت الصوري؛ إذ ينتهي الأمر في الموت الإرادي إلى العدم والصرف والفناء المطلق الذي ما شمَّ رائحة الوجود أصلاً، فكيف تخلل الموت والحياة، والوجود والعدم، وتاهت في بيداء ألوهيته أنظار العقل وآرائه؟\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم صرح بالحرمة، فقال: { يا أيها الذين آمنوا لا تقتلوا الصيد وأنتم حرم } أي: محرمون جمع حَرَم، والمراد من دخل في الإحرام أو في الحرم، وذكر القتل ليفيد العموم، فيصدق بالذبح وغيره، وما صاده المحرم أو صيد له ميتةٌ لا يؤكل، والمراد بالصيد المنهي عن قتله: ما صيد وما لم يُصَد مما شأنه أن يصاد، وورد هنا النهي عن قتله قبل أن يصاد، وبعده، وأما النهي عن الاصطياد فيؤخذ من قوله: { وحرم عليكم صيد البر ما دمتم حُرمًا } ، وخصص الحديث: الغراب والحدأة، والفأرة والعقرب والكلب العقور، فلا بأس بقتلهم، في الحل والحرم، وأدخل مالك في الكلب العقور كل ما يؤذي الناس من السباع وغيرها، وقاس الشافعي على هذه الخمسة كل ما لا يؤكل لحمه\n\n\nثم ذكر جزاء قتله فقال: { ومن قتله منكم متعمدًا فجزاء مثل ما قتل من النَّعَم } أي: فعليه جزاء مثل ما يماثله من النعم، وهي الإبل والبقر والغنم، ففي النعامة بدنةَ، وفي الفيل ذات سنامين، وفي حمار الوحش وبقره بَقَرة، وفي الغزالة شاة، فالمثلية عند مالك والشافعي في الخلِقة والمقدار، فإن لم يكن له مثلٌ أطعم أو صام، يُقوّم بالطعام فيتصدق به، أو يصوم لكل مدِّ يومًا، ومَذهب أبي حنيفة أن المثلية: القيمة، يُقوم الصيد المقتول، ويُخير القاتل بين أن يتصدق بالقيمة أو يشتري بها من النعم ما يهديه\n وذكر العمد ليس بتقييد عند جمهور الفقهاء، خلافًا للظاهرية بل المتعمد، والناسي في وجوب الجزاء سواء، وإنما ذكره ليرتب عليه قوله: { ومن عاد فينتقم الله منه } ، ولأن الآية نزلت فيمن تعمد، إذ رُوِي أنهم عرض لهم حمار وحشي، فطعنه أبو اليسر برمحه فقتله، فنزلت الآية\n ولا بد من حكم الحكَمين على القاتل لقوله: { يَحكم به ذوا عدل منكم } ، فكما أن التقويم يحتاج إلى نظر واجتهاد، فكذلك تحتاج المماثلة في الخلقة والهيأة إليهما، فإن أخرج الجزاء قبل الحكم عليه فعليه إعادته، إلا حمام مكة فإنه لا يحتاج إلى حكمين، ويجب عند مالك التحكيم فيما حكمت به الصحابة وفيما لم تحكم، لعموم الآية\n وقال الشافعي: يكتفي في ذلك بما حكمت به الصحابة، حال كون المحكوم به { هديًا } بشرط أن يكون مما يصح به الهدي، وهو الجذع من الضأن، والثني مما سواه، وقال الشافعي: يخرج المثل في اللحم، ولا يشترط السن، { بالغ الكعبة } لم يرد الكعبة بعينها، وإنما أراد الحرم، وظاهره يقتضي أن يصنع به ما يصنع بالهدي من سوق من الحل إلى الحرم، وقال الشافعي وأبو حنيفة: إن اشتراه في الحرم أجزأه\n { أو كفارة طعام مساكين } مد لكل مسكين، { أو عدل ذلك صيامًا } ، يوم لكل مد، عدد الحق ـ تعالى ـ ما يجب في قتل الصيد، فذكر أولاً الجزاء من النعم، ثم الطعام، ثم الصيام، ومذهب مالك والجمهور: أنها على التخيير، وهو الذي يقتضيه العطب بأو، ومذهب ابن عباس أنها مرتبة\n\n\nوقد نظم ابن غازي الكفارات التي فيها التخيير أو الترتيب فقال:\n\nوكيفية التخيير هنا: أن يخير الحكمان القاتلَ فإن أراد الجزاء عينوا له ما يهدي، وإن أراد الإطعام قوموا الصيد بالطعام في ذلك المحل، فيطعم مُدًا لكل مسكين، وإن أراد الصيام صام يومًا لكل مُدّ، وكمل لكسره، فإذا قوم بعشرة مثلاً ونصف مُدّ، صام أحد عشر يومًا\n ثم ذكر حكمة الجزاء، فقال: { ليذوق وبال أمره } أي: فعليه الجزاء أو الإطعام أو الصيام ليذوق عقوبة سوء فعله، وسوء هتكه لحرمة الإحرام، { عفا الله عما سلف } في الجاهلية أو قبل التحريم، { ومن عاد فينتقم الله منه } في الآخرة، وليس فيه ما يمنع الكفارة على العائد، كما حكى عن ابن عباس وشريح\n { والله عزيز ذو انتقام } ممن أصر على عصيانه\n ثم استثنى صيد البحر فقال: { أُحل لكم صيد البحر } وهو ما لا يعيش إلا في الماء، وهو حلال كله لقوله صلى الله عليه وسلم في البحر:\n\n \" هُو الطَّهُورُ ماَؤهُ، الحِلُّ مَيتَتُه \" \n\nوقال أبو حنيفة: لا يحل منه إلا السمك، { وطعامه } أي: ما قذفه، أو طفا على وجهه لأنه ليس بصيد إنما هو طعام، وقال ابن عباس: طعامه: ما مُلِّح وبقي، { متاعًا لكم وللسيارة } ، الخطاب بلكم للحاضرين في البحر، والسيارة: المسافرون في البر، أي: هو متاع تأتِدمون به في البر والبحر، { وحُرم عليكم صيد البر } يحتمل أن يريد به المصدر، أي الاصطياد، أو الشيء المصيد، أو كلاهما، وتقدم أن ما صاده محرم أو صيد له، ميتة، وحد الحرمة: { ما دمتم حُرمًا } فإذا حللتم فاصطادوا، { واتقوا الله } في ترك ما حرم عليكم، { والذي إليه تحشرون } فيجازيكم على ما فعلتم\n الإشارة: إذا عقد المريد مع الله عقدة السير والمجاهدة، قد يختبره الله ـ تعالى ـ في سيره بتيسير الشهوات، وتسليط العلائق والعوائق ليعلم الكاذب من الصادق، فإن كف عنها وأعرض، هيأ لدخول الحضرة، وإن انهمك فيها، واقتُنص فيه شبكتها، بقي مرهونًا في يدها، أسيرًا في قبضة قهرها، فإذا نهض حتى دخل حرم الحضرة قاصدًا لعرفة المعارف، حَرُم عليه صيد البر، وهو كل ما يخرج من بحر الحقيقة إلى شهود بَر السِّوى، فرقًا بلا جمع، كائنًا ما كان، رسومًا أو علومًا أو أحوالاً أو أقوالاً، وحلّ له صيد البحر وطعامه، من أسرارِ أو أنوارِ أو حقائق، متاعًا لروحه وسره، وللسيارة من أبناء جنسه، يطعمهم من تلك الأسرار، بالهمة أو الحال أو التذكار، واتقوا الله في الاشتغال بما سواه، الذي إليه تحشرون، فيدخلكم جنة المعارف قبل جنة الزخارف\n والله تعالى أعلم\n ولما عَظَّم شأن الحرم عَظَّم شأن الكعبة، فقال: { جَعَلَ ٱللَّهُ ٱلْكَعْبَةَ ٱلْبَيْتَ ٱلْحَرَامَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:1",
      "similarity": 0.3685818343101472
    },
    {
      "verse": "70:23",
      "similarity": 0.3507478718493304
    },
    {
      "verse": "11:107",
      "similarity": 0.3343726832146111
    },
    {
      "verse": "5:2",
      "similarity": 0.3156420307829906
    },
    {
      "verse": "5:117",
      "similarity": 0.31021955983593524
    }
  ]
}