{
  "chapter": "المائدة",
  "text": "جعل الله الكعبة البيت الحرام قيما للناس والشهر الحرام والهدى والقلئد ذلك لتعلموا۟ ان الله يعلم ما فى السموت وما فى الارض وان الله بكل شىء عليم",
  "translations": [
    {
      "translation": "Allah has made the Ka'ba, the Sacred House, a special institution for mankind, and also the sacred the heavens and in the earth and that Allah has knowledge of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has made the Ka'bah, the Sacred House, a means of support for mankind, as also the holy month, the sacrificial offerings, and consecrated cattle, so that you may understand that known to God is all that is in the heavens and the earth, and God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has appointed the Ka'bah, the Sacred House, as a means of support for (the collective life of) men, and has caused the holy month (of Pilgrimage), and the animals of sacrificial of-fering and their distinguishing collars to assist therein. This is so that you may know that Allah is aware of all that is in the heavens and all that is in the earth; and that Allah has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has made the Kabah, the Sacred House, the sacred months, the unmarked and marked sacrificial animals for the welfare of men and in order to inform you that God knows all that is in the heavens and the earth. He has the knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has made the Kaa’bah, the respected house, a cause for peoples survival, and the Sacred Month, and the sacrifices in the holy land, and the garlanded animals; this is so that you may be convinced that Allah knows all whatever is in the heavens and all whatever is in the earth, and that Allah is the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has made the Ka`bah, the Sacred House, an asylum of security and benefits for mankind, and also the Sacred Month and the animals of offerings and the garlanded, that you may know that Allah has knowledge of all that is in the heavens and all that is in the earth, and that Allah is the All-Knower of each and everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has made the Kaaba, the sacred house, a maintenance for the people, and the sacred month and the offerings and the sacrificial animals with garlands; this is that you may know that Allah knows whatever is in the heavens and whatever is in the earth, and that Allah is the Knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has appointed the Kaaba, the Holy House, as an establishment for men, and the holy month; the offering, and the necklaces -- that, that you may know that God knows all that is in the heavens and in the earth; and that God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath appointed the Ka'bah, the Sacred House, a standard for mankind, and the Sacred Month and the offerings and the garlands. That is so that ye may know that Allah knoweth whatsoever is in the heavens and whatsoever is in the earth, and that Allah is Knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has made the Ka'bah, the Sacred House, a means of support as well as the sacred month and the sacrificial animals with their garlands. That is so that you may know that God has knowledge of whatever is in the heavens and on the earth and that He is fully aware of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath made the Ka'ba, the Sacred House, a maintenance for mankind and likewise the Sacred month, and so also the offering and the victims with garlands. That is in order that ye may know that Allah knoweth whatsoever is in the heavens and whatsoever is in the earth, and that of everything Allah is Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has made the Ka‘bah, the Sacred House, a [means of] sustentation for mankind, and [also] the sacred month, the offering and the garlands, so that you may know that Allah knows whatever there is in the heavens and whatever there is in the earth, and that Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah made the Ka'ba, the Sacred House, an asylum of security for men, as also the Sacred Months, the animals for offerings, and the garlands that mark them: That ye may know that Allah hath knowledge of what is in the heavens and on earth and that Allah is well acquainted with all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has made the Ka'bah, the Sacred House, an asylum of security and Hajj and 'Umrah (pilgrimage) for mankind, and also the Sacred Month and the animals of offerings and the garlanded (people or animals, etc. marked with the garlands on their necks made from the outer part of the stem of the Makkah trees for their security), that you may know that Allah has knowledge of all that is in the heavens and all that is in the earth, and that Allah is the All-Knower of each and everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has made the Ka'bah the Sacred House, as an establishment for people; and the Sacred Month, and the offering, and the necklaces, in order that you know that Allah has knowledge of all that is in the heavens and the earth; and that Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has appointed the Kaabah, the Sacred House, a sanctuary for the people, and the Sacred Month, and the offerings, and the garlanded. That you may know that God knows everything in the heavens and the earth, and that God is Cognizant of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has made the Ka'bah, the Sacred House, standing for the people and [has sanctified] the sacred months and the sacrificial animals and the garlands [by which they are identified]. That is so you may know that Allah knows what is in the heavens and what is in the earth and that Allah is Knowing of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:97] God has appointed the Ka‘ba, the Sacred, inviolable, House as an [enduring] institution for mankind, [an institution] by which their religious affair is sustained, through pilgrimage to it, as is their this-worldly [affair], on account of the security [guaranteed] for those who enter it and the fact that they are not interfered with, and because all manner of fruits are brought to it (a variant reading [for qiyāman] has qiyaman, ‘[always] standing’, as the verbal noun from [1st form] qāma, ‘to remain standing’, without defectiveness [of the middle radical]); and the sacred month, meaning the sacred months of Dhū’l-Qa‘da, Dhū’l-Hijja, Muharram and Rajab, instituted for them to be secure from fighting during them; the offering and the garlands, instituted for their owner so that he does not suffer any interference; that, mentioned appointment, is so that you may know that God knows all that is in the heavens and in the earth, and that God has knowledge of all things: thus that appointing of His in order to secure benefits for you and to ward off harm from you, before such things came to pass, testifies to His knowledge of all that is in existence and all that will be.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف بياني لأنّه يحصل به جواب عمّا يخطر في نفس السامع من البحث عن حكمة تحريم الصيد في الحرم وفي حال الإحرام ، بأنّ ذلك من تعظيم شأن الكعبة التي حُرّمت أرضُ الحرم لأجل تعظيمها ، وتذكيرٌ بنعمة الله على سكّانه بما جعل لهم من الأمن في علائقها وشعائرها .والجعل يطلق بمعنى الإيجاد ، فيتعدّى إلى مفعول واحد ، كما في قوله تعالى : { وجعل الظلمات والنور } ، في سورة الأنعام ( 1 ) ، ويطلق بمعنى التصيير فتعدّى إلى مفعولين ، وكلا المعنيين صالح هنا . والأظهر الأول فإنّ الله أوجد الكعبة ، أي أمر خليله بإيجادها لتكون قياماً للناس . فقوله : قياماً } منصوب على الحال ، وهي حال مقدّرة ، أي أوجدها مقدّراً أن تكون قياماً . وإذا حمل { جعل } على معنى التصيير كان المعنى أنّها موجودة بيتَ عبادة فصيّرها الله قياماً للناس لطفاً بأهلها ونسلهم ، فيكون { قياماً } مفعولاً ثانياً ل { جعل } . وأمّا قوله : { البيت الحرام } يصحّ جعله مفعولاً .والكعبة علم على البيت الذي بناه إبراهيم عليه السلام بمكة بأمر الله تعالى ليكون آية للتوحيد . وقد تقدّم ذلك في تفسير قوله تعالى : { إنّ أوّل بيتتٍ وضع للناس للذي ببكة } في سورة آل عمران ( 96 ) . قالوا : إنّه علم مشتقّ من الكَعَب ، وهو النتوء والبروز ، وذلك محتمل . ويحتمل أنّهم سمّوا كلّ بارز كعبة ، تشبيهاً بالبيت الحرام ، إذ كان أول بيت عندهم ، وكانوا من قبله أهل خيام ، فصار البيت مثلاً يمثّل به كلّ بارز . وأمّا إطلاق الكعبة على ( القليس ) الذي بناه الحبشة في صنعاء ، وسمّاه بعض العرب الكعبة اليمانية ، وعلى قبة نجران التي أقامها نصارى نجران لعبادتهم التي عناها الأعشى في قوله :فَكعْبَةُ نَجرَان حَتْم عليكِ ... حتى تُناخي بأبوابهافذلك على وجه المحاكاة والتشبيه ، كما سمّى بنو حنيفة مسَليمة رحمان .وقوله : البيت الحرام } بيان للكعبة . قصد من هذا البيان التنويه والتعظيم ، إذ شأن البيان أن يكون موضّحاً للمبيّن بأن يكون أشهر من المبيّن . ولمّا كان اسم الكعبة مساوياً للبيت الحرام في الدلالة على هذا البيت فقد عبّر به عن الكعبة في قوله تعالى : { ولا آمِّين البيت الحرام } \\[ المائدة : 2 \\] فتعيّن أنّ ذكر البيان للتعظيم ، فإنّ البيان يجيء لما يجيء له النعت من توضيح ومدح ونحو ذلك . ووجه دلالة هذا العلم على التعظيم هو ما فيه من لمح معنى الوصف بالحرام قبل التغليب . وذكر البيت هنا لأنّ هذا الموصوف مع هذا الوصف صارا علماً بالغلبة على الكعبة .والحرام في الأصل مصدر حَرُم إذا مُنِع ، ومصدره الحرام ، كالصلاح من صلُح ، فوصف شيء بحرام مبَالغة في كونه ممنوعاً . ومعنى وصف البيت بالحرام أنّه ممنوع من أيدي الجبابرة فهو محترم عظيم المهابة . وذلك يستتبع تحجير وقوع المظالم والفواحش فيه ، وقد تقدّم أنّه يقال رجل حرام عند قوله تعالى : { غير محلّي الصيد وأنتم حُرُم في هذه السورة ( 1 ) ، وأنّه يقال : شهر حرام ، عند قوله تعالى :{ ولا الشهر الحرام } \\[ المائدة : 2 \\] فيها أيضاً ، فيحمل هذا الوصف على ما يناسبه بحسب الموصوف الذي يجري عليه ، وهو في كلّ موصوف يدلّ على أنّه ممّا يتجنّب جانبه ، فيكون تجنّبه للتعظيم أو مهابته أو نحو ذلك ، فيكون وصفَ مدح ، ويكون تجنّبه للتنزّه عنه فيكون وصف ذمّ ، كما تقول : الخمر حرام .وقرأ الجمهور { قياماً } بألف بعد الياء . وقرأه ابن عامر { قيماً } بدون ألف بعد الياء .والقيام في الأصل مصدر قام إذا استقلّ على رجليه ، ويستعار للنشاط ، ويستعار من ذلك للتدبير والإصلاح ، لأنّ شأن من يعمل عملاً مهمّاً أن ينهض له ، كما تقدّم بيانه عند قوله تعالى : { ويقيمون الصلاة } في سورة البقرة ( 3 ) . ومن هذا الاستعمال قيل للناظر في أمور شيء وتدبيره : هو قيّم عليه أو قائم عليه ، فالقيام هنا بمعنى الصلاح والنفع . وأمّا قراءة ابن عامر قيما } فهو مصدر ( قام ) على وزن فِعَل بكسر ففتح مثل شِبَع . وقد تقدّم أنّه أحد تأويلين في قوله تعالى : { ولا تؤتوا السفهاء أموالكم التي جعل الله لكم قيما } في سورة النساء . وإنّما أعلّت واوه فصارت ياء لشدّة مناسبة الياء للكسرة . وهذا القلب نادر في المصادر التي على وزن فِعَل من الواوي العين . وإثباته للكعبة من الإخبار بالمصدر للمبالغة ، وهو إسناد مجازي ، لأنّ الكعبة لمّا جعلها الله سبباً في أحكام شرعية سابقة كان بها صلاح أهل مكة وغيرهم من العرب وقامت بها مصالحهم ، جُعلت الكعبة هي القائمة لهم لأنّها سبب القيام لهم .والناس هنا ناس معهودون ، فالتعريف للعهد . والمراد بهم العرب ، لأنّهم الذين انتفعوا بالكعبة وشعائرها دون غيرهم من الأمم كالفرس والروم . وأمّا ما يحصل لهؤلاء من منافع التجارة ونحوها من المعاملة فذلك تبع لوجود السّكان لا لكون البيت حراماً ، إلاّ إذا أريد التسبّب البعيد ، وهو أنّه لولا حرمة الكعبة وحرمة الأشهر في الحجّ لساد الخوف في تلك الربوع فلم تستطع الأمم التجارة هنالك .وإنّما كانت الكعبة قياماً للناس لأنّ الله لمّا أمر إبراهيم بأن يُنزل في مكة زوجه وابنه إسماعيل ، وأراد أن تكون نشأة العرب المستعربة ( وهم ذرية إسماعيل ) في ذلك المكان لينشأوا أمّة أصيلة الآراء عزيزة النفوس ثابتة القلوب ، لأنّه قدّر أن تكون تلك الأمّة هي أول من يتلقّى الدين الذي أراد أن يكون أفضل الأديان وأرسخها ، وأن يكون منه انبثاث الإيمان الحقّ والأخلاق الفاضلة . فأقام لهم بلداً بعيداً عن التعلّق بزخارف الحياة؛ فنشأوا على إباء الضيم ، وتلقّوا سيرة صالحة نشأوا بها على توحيد الله تعالى والدعوة إليه؛ وأقام لهم فيه الكعبة معلماً لتوحيد الله تعالى ، ووضع في نفوسهم ونفوس جيرتهم تعظيمه حرمته .ودعا مجاوريهم إلى حجّه ما استطاعوا ، وسخّر الناس لإجابة تلك الدعوة ، فصار وجود الكعبة عائداً على سكان بلدها بفوائد التأنّس بالوافدين ، والانتفاع بما يجلبونه من الأرزاق ، وبما يجلب التجّار في أوقات وفود الناس إليه؛ فأصبح ساكنوه لا يلحقهم جوع ولا عراء . وجعل في نفوس أهله القناعة فكان رزقهم كفاناً . وذلك ما دعا به إبراهيم في قوله : { ربّنا إنّي أسكنت من ذرّيّتي بواد غير ذي زرع عند بيتك المحرّم ربّنا ليقيموا الصلاة فاجعل أفئدة من الناس تهوي إليهم وارزقهم من الثمرات لعلّهم يشكرون } \\[ إبراهيم : 37 \\] . فكانت الكعبة قياماً لهم يقوم به أوَد معاشهم . وهذا قيام خاصّ بأهله .ثم انتشرت ذرّية إسماعيل ولحقت بهم قبائل كثيرة من العرب القحطانيين وأهِلت بلاد العرب . وكان جميع أهلها يدين بدين إبراهيم؛ فكان من انتشارهم ما شأنه أن يَحدُث بين الأمّة الكثيرة من الاختلاف والتغالب والتقاتل الذي يفضي إلى التفاني ، فإذا هم قد وجدوا حرمة أشهر الحج الثلاثة وحرمة شهر العمرة ، وهو رجب الذي سنَّتْهُ مُضَرُ ( وهم معظم ذرية إسماعيل ) وتبعهم معظم العرب . وجدوا تلك الأشهر الأربعة ملجئة إيّاهم إلى المسالمة فيها فأصبح السلم سائداً بينهم مدة ثلث العام ، يصلحون فيها شؤونهم ، ويستبقون نفوسهم ، وتسعى فيها سادتهم وكبراؤهم وذوو الرأي منهم بالصلح بينهم ، فيما نجم من تِراتتٍ وإحَننٍ . فهذا من قيام الكعبة لهم ، لأنّ الأشهر الحرم من آثار الكعبة إذ هي زمن الحج والعمرة للكعبة .وقد جعل إبراهيم للكعبة مكاناً متّسعاً شاسعاً يحيط بها من جوانبها أميالاً كثيرة ، وهو الحرم ، فكان الداخل فيه آمناً . قال تعالى : { أوَ لم يروا أنّا جعلنا حرماً آمناً ويتخطَّف الناس مِنْ حولهم } \\[ العنكبوت : 67 \\] . فكان ذلك أمناً مستمراً لسكّان مكة وحرمها ، وأمناً يلوذ إليه من عراه خوف من غير سكانها بالدخول إليه عائذاً ، ولتحقيق أمنه أمَّن الله وحوشه ودوابّه تقوية لحرمته في النفوس ، فكانت الكعبة قياماً لكلّ عربي إذا طرقه ضيم .وكان أهل مكة وحرمها يسيرون في بلاد العرب آمنين لا يتعرّض لهم أحد بسوء ، فكانوا يتّجرون ويدخلون بلاد قبائل العرب ، فيأتونهم بما يحتاجونه ويأخذون منهم ما لا يحتاجونه ليبلّغوه إلى من يحتاجونه ، ولولاهم لما أمكن لتاجر من قبيلة أن يسير في البلاد ، فلتعطّلت التجارة والمنافع . ولذلك كان قريش يوصفون بين العرب بالتجّار ، ولأجل ذلك جعلوا رحلتي الشتاء والصيف اللَّتين قال الله تعالى فيهما : { لإيلاف قريش إيلافهم رحلة الستاء والصيف } \\[ قريش : 1 ، 2 \\] . وبذلك كلّه بقيت أمّه العرب محفوظة الجبلّة التي أراد الله أن يكونوا مجبولين عليها ، فتهيّأت بعد ذلك لتلقّي دعوة محمد صلى الله عليه وسلم وحملِها إلى الأمم ، كما أراد الله تعالى وتمّ بذلك مراده .وإذا شئت أن تعدو هذا فقل : إنّ الكعبة كانت قياماً للناس وهم العرب ، إذ كانت سبب اهتدائهم إلى التوحيد واتّباع الحنيفية ، واستبقت لهم بقية من تلك الحنيفية في مدة جاهليتهم كلّها لم يعدموا عوائد نفعها .فلمّا جاء الإسلام كان الحج إليها من أفضل الأعمال ، وبه تكفّر الذنوب ، فكانت الكعبة من هذا قياماً للناس في أمور أخراهم بمقدار ما يتمسّكون به ممّا جعلت الكعبة له قياماً .وعَطْفُ { الشهرَ الحرامَ } على { الكعبةَ } شبْه عطف الخاصّ على العامّ باعتبار كون الكعبة أريد بها ما يشمل علائقها وتوابعها ، فإنّ الأشهر الحرم ما اكتسبت الحرمة إلاّ من حيث هي أشهر الحج والعمرة للكعبة كما علمت . فالتعريف في { الشهر } للجنس كما تقدّم في قوله تعالى : { ولا الشهر الحرام } \\[ المائدة : 2 \\] . ولا وجه لتخصيصه هنا ببعض تلك الأشهر . وكذلك عطف { الهدي } و { القلائد } . وكون الهدي قياماً للناس ظاهر ، لأنّه ينتفع ببيعه للحاج أصحابُ المواشي من العرب ، وينتفع بلحومه من الحاج فقراءُ العرب ، فهو قيام لهم .وكذلك القلائد فإنّهم ينتفعون بها؛ فيتّخذون من ظفائرها مادّة عظيمة للغزل والنسج ، فتلك قيام لفقرائهم ، ووجه تخصيصها بالذكر هنا ، وإن كانت هي من أقلّ آثار الحج ، التنبيهُ على أنّ جميع علائق الكعبة فيها قيام للناس ، حتى أدنى العلائق ، وهو القلائد ، فكيف بما عداها من جِلال البدْن ونعالها وكسوة الكعبة ، ولأنّ القلائد أيضاً لا يخلو عنها هدي من الهدايا بخلاف الجِلال والنعال . ونظير هذا قول أبي بكر «والله لو منعوني عِقالاً» إلخ . . .وقوله : { ذلك لتعلموا أنّ الله يعلم ما في السموات وما في الأرض } الآية ، مرتبط بالكلام الذي قبله بواسطة لام التعليل في قوله { لتعلموا } . وتوسّط اسم الإشارة بين الكلامين لزيادة الربط مع التنبيه على تعظيم المشار إليه ، وهو الجعل المأخوذ من قوله : { جعل الله الكعبة } ، فتوسّط اسم الإشارة هنا شبيه بتوسّط ضمير الفصل ، فلذلك كان الكلام شبيهاً بالمستأنف وما هو بمستأنف ، لأنّ ماصْدَقَ اسم الإشارة هو الكلام السابق ، ومفاد لام التعليل الربط بالكلام السابق ، فلم يكن في هذا الكلام شيء جديد غير التعليل ، والتعليل اتّصال وليس باستئناف ، لأنّ الاستئناف انفصال . وليس في الكلام السابق ما يصلح لأن تتعلّق به لام التعليل إلاّ قوله { جعل } . وليست الإشارة إلاّ للجعل المأخوذ من قوله { جعل } .والمعنى : جعل الله الكعبة قياماً للناس لتعلموا أن الله يعلم الخ . . ، أي أنّ من الحكمة التي جعل الكعبة قياماً للناس لأجلها أن تعلموا أنه يعلم . فَجَعْل الكعبة قياماً مقصود منه صلاح الناس بادىء ذي بدء لأنّه المجعولة عليه ، ثم مقصود منه عِلم الناس بأنّه تعالى عليم . وقد تكون فيه حكم أخرى لأنّ لام العلّة لا تدلّ على انحصار تعليل الحكم الخبري في مدخولها لإمكان تعدّد العلل للفعل الواحد ، لأنّ هذه علل جعلية لا إيجادية ، وإنّما اقتصر على هذه العلة دون غيرها لشدّة الاهتمام بها ، لأنّها طريق إلى معرفة صفة من صفات الله تحصل من معرفتها فوائد جمّة للعارفين بها في الامتثال والخشية والاعتراف بعجز من سواه وغير ذلك .فحصول هذا العلم غاية من الغايات التي جعل الله الكعبة قياماً لأجلها .والمقصود أنّه يعلم ما في السموات وما في الأرض قبل وقوعه لأنّه جعل التعليل متعلّقاً بجعل الكعبة وما تبعها قياماً للناس . وقد كان قيامها للناس حاصلاً بعد وقت جعلها بمدّة ، وقد حصل بعضُه يتلُو بعضاً في أزمنة متراخية كما هو واضح . وأمّا كونه يعلم ذلك بعد وقوعه فلا يحتاج للاستدلال لأنّه أولى ، ولأنّ كثيراً من الخلائق قد علم تلك الأحوال بعد وقوعها .ووجه دلالة جَعْل الكعبة قياماً للناس وما عطف عليها ، على كونه تعالى يعلم ما في السماوات وما في الأرض ، أنّه تعالى أمر ببناء الكعبة في زمن إبراهيم ، فلم يدر أحد يومئذٍ إلاّ أنّ إبراهيم اتّخذها مسجداً ، ومكة يومئذٍ قليلة السكّان ، ثم إنّ الله أمر بحج الكعبة وبحرمة حرمها وحرمة القاصدين إليها ، ووقّت للناس أشهراً القصد فيها ، وهدايا يسوقونها إليها فإذا في جميع ذلك صلاح عظيم وحوائل دون مضارّ كثيرة بالعرب لولا إيجاد الكعبة ، كما بيّنّاه آنفاً . فكانت الكعبة سبب بقائهم حتى جاء الله بالإسلام . فلا شك أنّ الذي أمر ببنائها قد علم أن ستكون هنالك أمّة كبيرة ، وأن ستحمد تلك الأمّة عاقبة بناء الكعبة وما معه من آثارها . وكان ذلك تمهيداً لما علمه مِن بعثة محمد صلى الله عليه وسلم فيهم ، وجعلِهم حملة شريعته إلى الأمم ، وما عقب ذلك من عِظم سلطان المسلمين وبناء حضارة الإسلام . ثم هو يعلم ما في الأرض وليس هو في الأرض بدليل المشاهدة ، أو بالترفّع عن النقص فلا جرم أن يكون عالماً بما في السماواة ، لأنّ السموات إمّا أن تكون مساوية للأرض في أنّه تعالى ليس بمستقرّ فيها ، ولا هي أقرب إليه من الأرض ، كما هو الاعتقاد الخاصّ ، فثبت له العلم بما في السماوات بقياس المساواة؛ وإمّا أن يكون تعالى في أرفع المكان وأشرف العوالم ، فيكون علمه بما في السماوات أحرى من علمه بما في الأرض ، لأنّها أقرب إليه وهو بها أعني ، فيتمّ الاستدلال للفريقين .وأمّا دلالة ذلك على أنّه بكلّ شيء عليم فلأنّ فيما ثبت من هذا العلم الذي تقرّر من علمه بما في السماوات وما في الأرض أنواعاً من المعلومات جليلة ودقيقة؛ فالعلم بها قبل وقوعها لا محالة ، فلو لم يكن يعلم جميع الأشياء لم يخل من جهل بعضها ، فيكون ذلك الجهل معطّلاً لعلمه بكثير ممّا يتوقّف تدبيره على العلم بذلك المجهول فهو ما دبر جعل الكعبة قياماً وما نشأ عن ذلك إلاّ عن عموم علمه بالأشياء ولولا عمومه ما تمّ تدبير ذلك المقدّر .\n\n",
      "translations": [
        {
          "translation": "(Allah hath appointed the Ka'bah, the Sacred House, a standard) a sanctuary and an emblem (for mankind) for the purpose of worship, (and the Sacred Month) is a time of security (and the offerings) which are offered to the House as a gesture of security to the company of people who are present where the offering is made (and the garlands) i.e. the offerings which carry garlands made of the barks of the trees of the Sacred Precinct, as a gesture of security to the company of people there. (That) which I have mentioned (is so that ye may know that Allah knoweth whatsoever) the benefit of (is in the heavens and whatsoever is in the earth, and that Allah is Knower of all things) their benefits and also that which is good for the people of the heavens and the earth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ جعل الله } كعبة حضرة الجمع { البيت } المحرّم من دخول الغير فيه كما قيل: جلّ جناب الحق من أن يكون شريعة لكل وارد\n { قياماً للناس } من موتهم الحقيقي وانتعاشاً لهم به وبحياته وقدرته وسائر صفاته { والشهر الحرام } أي: زمان الوصول\n وهو زمان الحج الحقيقي الذي يحرم ظهور صفات النفس فيه { والهَدي } أي: النفس المذبوحة بفناء تلك الكعبة { والقلائِد } وخصوصاً النفس القوية\n الشريفة\n المطيعة\n المنقادة\n فإنّ التقرّب بها أفضل وشأنها عند البقاء والقيام بالوجود الثاني والحياة الحقيقية أرفع { ذلِكَ } أي: جعل تلك الحضرة قياماً لكم { لِتَعْلَموا } بعلمه عند القيام به { إنّ الله يَعْلَم } حقائق الأشياء في عالم الغيب والشهادة وعلمه محيط بكل شيء\n إذ لا يمكن إحاطة علمكم بعلمه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإنما { جَعَلَ } وصيَّر { ٱللَّهُ } المستغني بذاته عن الأمكنة والحلول فيها مطلقاً { ٱلْكَعْبَةَ } الكعبة المعيننة في أرض الحجاز { ٱلْبَيْتَ ٱلْحَرَامَ } أي: المكان الذي يحرم فيه أكثر ما يحل في غيرها من الأمكنة\n بل جميعها عند العارف\n ليكون { قِيَٰماً لِّلنَّاسِ } يقومون بها ويتيقظون بأركانها ومناسكها\n وآدابها ومشاعرها عن منام الغفلة ورقود النسيان { وَ } كذا صيَّر { ٱلشَّهْرَ ٱلْحَرَامَ } ميقاتاً لزيارتها وطوافها\n ليقوموا فيها بتهيئة أسباب الفناء\n وتخلية الضمير عن الميل إلى الغير والسّوى\n\n\n{ وَ } صيَّر سبحانه أيضاً { ٱلْهَدْيَ وَٱلْقَلاَئِدَ } جبراً لما انكسر من رعاية نسكه\n وأراد به\n لئلا يتقاعدوا عن إتمامها { ذٰلِكَ } أي: جعلها وتصييرها مرجعاً لقاطبة الأنام\n وقبلة لهم بحيث يجب عليهم التوجه نحوه من كل مرمى سحيق\n وفج عميق\n إنما هو { لِتَعْلَمُوۤاْ أَنَّ ٱللَّهَ } المحيط بذرائر الأكوان { يَعْلَمُ } بالعلم الحضوري جميع { مَا فِي ٱلسَّمَٰوَٰتِ } أي: العلويات والأعيان الثابتة { وَمَا فِي ٱلأَرْضِ } السفليات التي هي الهويات الباطلة { وَ } ليعلموا { أَنَّ ٱللَّهَ } المنزه\n المتعالي عن أن يحاط بمجلاه وتجلياته { بِكُلِّ شَيْءٍ } مما استأثر باطلاعه\n وما يعلم جنوده إلا هو { عَلِيمٌ } [المائدة: 97] لا يعزب عن علمه وحضوره شيء\n كلَّت الألسن عن تفسير صفتك\n وانحسرت العقول عن كنه معرفتك\n فكيف يعرف كنه صفتك يا رب؟\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { البيت الحرام }: عطف بيان على جهة المدح\n و { قيامًا }: مفعول ثان\n يقول الحقّ جلّ جلاله: { جعل الله الكعبة } التي هي { البيت الحرام قيامًا للناس } أي: سبب انتعاشهم\n يقوم بها أمر معاشهم ومعادهم\n يلوذ به الخائف\n ويأمن فيه الضعيف\n ويربَحُ فيه التجار\n ويتوجه إليه الحجاج والعُمار\n أو يقوم به أمر دينهم بالحج إليه\n وأمر دنياهم بِأمنِ داخله\n وتُجبى ثمرات كل شيء إليه\n قال القشيري: حكَم الله ـ سبحانه ـ بأن يكون بيته اليومَ ملجأ يلوذ به كل مُؤمّل\n ويستقيم ببركة زيارته كلُّ حائدٍ عن نهج الاستقامة\n ويظفر بالانتقال هناك كل ذي أرَبٍ\n هـ\n { والشهر الحرام } جعله الله أيضًا قيامًا للناس والمراد به ذو الحجة\n فهو قيام لمناسك الحج\n وجَمعِ الوجود إليه بالأموال من كل جانب\n أو الجنس\n وهي أربعة: ذو القعدة وذو الحجة والمحرم ورجب\n لأنهم كانوا يكفون عن القتال\n ويأمن الناس فيها في كل مكان\n { والهدي } لأنه أمان لمن يسوقه لأنه لم يأت لحرب\n { والقلائد } \n كان الرجل إذا خرج يريد الحج تقلد شيئًا من السمُر\n وإذا رجع تقلد شيئًا من شجر الحرم ليعلم أنه كان في عبادة\n فلا يتعرض له أحد بشر\n فالقلائد هنا: ما تقلده المحرم من الشجر\n وقيل: قلائد الهدى\n { ذلك لتعلموا أن الله يعلم ما في السماوات وما في الأرض } أي: جعل ذلك الأمور\n قيامًا للناس لتعلموا أن الله يعلم تفاصيل الأمور\n فشرع ذلك دفعًا للمضار وجلبًا للمنافع\n { وأن الله بكل شيء عليم } لا يخفى عليه محل مصالح عباده ومضارهم\n وهو تعميم بعد تخصيص\n ومبالغة بعد إطلاق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:63",
      "similarity": 0.5736720606622315
    },
    {
      "verse": "42:12",
      "similarity": 0.5564453985701107
    },
    {
      "verse": "78:33",
      "similarity": 0.5464384339333068
    },
    {
      "verse": "5:2",
      "similarity": 0.3753985095306699
    },
    {
      "verse": "5:95",
      "similarity": 0.28662420936606214
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005097.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005097.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:97.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}