{
  "chapter": "المائدة",
  "text": "جعل الله الكعبة البيت الحرام قيما للناس والشهر الحرام والهدى والقلئد ذلك لتعلموا۟ ان الله يعلم ما فى السموت وما فى الارض وان الله بكل شىء عليم",
  "translations": [
    {
      "translation": "Allah has made the Ka'ba, the Sacred House, a special institution for mankind, and also the sacred the heavens and in the earth and that Allah has knowledge of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has made the Ka'bah, the Sacred House, a means of support for mankind, as also the holy month, the sacrificial offerings, and consecrated cattle, so that you may understand that known to God is all that is in the heavens and the earth, and God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has appointed the Ka'bah, the Sacred House, as a means of support for (the collective life of) men, and has caused the holy month (of Pilgrimage), and the animals of sacrificial of-fering and their distinguishing collars to assist therein. This is so that you may know that Allah is aware of all that is in the heavens and all that is in the earth; and that Allah has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has made the Kabah, the Sacred House, the sacred months, the unmarked and marked sacrificial animals for the welfare of men and in order to inform you that God knows all that is in the heavens and the earth. He has the knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has made the Kaa’bah, the respected house, a cause for peoples survival, and the Sacred Month, and the sacrifices in the holy land, and the garlanded animals; this is so that you may be convinced that Allah knows all whatever is in the heavens and all whatever is in the earth, and that Allah is the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has made the Ka`bah, the Sacred House, an asylum of security and benefits for mankind, and also the Sacred Month and the animals of offerings and the garlanded, that you may know that Allah has knowledge of all that is in the heavens and all that is in the earth, and that Allah is the All-Knower of each and everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has made the Kaaba, the sacred house, a maintenance for the people, and the sacred month and the offerings and the sacrificial animals with garlands; this is that you may know that Allah knows whatever is in the heavens and whatever is in the earth, and that Allah is the Knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has appointed the Kaaba, the Holy House, as an establishment for men, and the holy month; the offering, and the necklaces -- that, that you may know that God knows all that is in the heavens and in the earth; and that God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath appointed the Ka'bah, the Sacred House, a standard for mankind, and the Sacred Month and the offerings and the garlands. That is so that ye may know that Allah knoweth whatsoever is in the heavens and whatsoever is in the earth, and that Allah is Knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has made the Ka'bah, the Sacred House, a means of support as well as the sacred month and the sacrificial animals with their garlands. That is so that you may know that God has knowledge of whatever is in the heavens and on the earth and that He is fully aware of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath made the Ka'ba, the Sacred House, a maintenance for mankind and likewise the Sacred month, and so also the offering and the victims with garlands. That is in order that ye may know that Allah knoweth whatsoever is in the heavens and whatsoever is in the earth, and that of everything Allah is Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has made the Ka‘bah, the Sacred House, a [means of] sustentation for mankind, and [also] the sacred month, the offering and the garlands, so that you may know that Allah knows whatever there is in the heavens and whatever there is in the earth, and that Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah made the Ka'ba, the Sacred House, an asylum of security for men, as also the Sacred Months, the animals for offerings, and the garlands that mark them: That ye may know that Allah hath knowledge of what is in the heavens and on earth and that Allah is well acquainted with all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has made the Ka'bah, the Sacred House, an asylum of security and Hajj and 'Umrah (pilgrimage) for mankind, and also the Sacred Month and the animals of offerings and the garlanded (people or animals, etc. marked with the garlands on their necks made from the outer part of the stem of the Makkah trees for their security), that you may know that Allah has knowledge of all that is in the heavens and all that is in the earth, and that Allah is the All-Knower of each and everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has made the Ka'bah the Sacred House, as an establishment for people; and the Sacred Month, and the offering, and the necklaces, in order that you know that Allah has knowledge of all that is in the heavens and the earth; and that Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has appointed the Kaabah, the Sacred House, a sanctuary for the people, and the Sacred Month, and the offerings, and the garlanded. That you may know that God knows everything in the heavens and the earth, and that God is Cognizant of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has made the Ka'bah, the Sacred House, standing for the people and [has sanctified] the sacred months and the sacrificial animals and the garlands [by which they are identified]. That is so you may know that Allah knows what is in the heavens and what is in the earth and that Allah is Knowing of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:97] God has appointed the Ka‘ba, the Sacred, inviolable, House as an [enduring] institution for mankind, [an institution] by which their religious affair is sustained, through pilgrimage to it, as is their this-worldly [affair], on account of the security [guaranteed] for those who enter it and the fact that they are not interfered with, and because all manner of fruits are brought to it (a variant reading [for qiyāman] has qiyaman, ‘[always] standing’, as the verbal noun from [1st form] qāma, ‘to remain standing’, without defectiveness [of the middle radical]); and the sacred month, meaning the sacred months of Dhū’l-Qa‘da, Dhū’l-Hijja, Muharram and Rajab, instituted for them to be secure from fighting during them; the offering and the garlands, instituted for their owner so that he does not suffer any interference; that, mentioned appointment, is so that you may know that God knows all that is in the heavens and in the earth, and that God has knowledge of all things: thus that appointing of His in order to secure benefits for you and to ward off harm from you, before such things came to pass, testifies to His knowledge of all that is in existence and all that will be.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah hath appointed the Ka'bah, the Sacred House, a standard) a sanctuary and an emblem (for mankind) for the purpose of worship, (and the Sacred Month) is a time of security (and the offerings) which are offered to the House as a gesture of security to the company of people who are present where the offering is made (and the garlands) i.e. the offerings which carry garlands made of the barks of the trees of the Sacred Precinct, as a gesture of security to the company of people there. (That) which I have mentioned (is so that ye may know that Allah knoweth whatsoever) the benefit of (is in the heavens and whatsoever is in the earth, and that Allah is Knower of all things) their benefits and also that which is good for the people of the heavens and the earth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ جعل الله } كعبة حضرة الجمع { البيت } المحرّم من دخول الغير فيه كما قيل: جلّ جناب الحق من أن يكون شريعة لكل وارد\n { قياماً للناس } من موتهم الحقيقي وانتعاشاً لهم به وبحياته وقدرته وسائر صفاته { والشهر الحرام } أي: زمان الوصول\n وهو زمان الحج الحقيقي الذي يحرم ظهور صفات النفس فيه { والهَدي } أي: النفس المذبوحة بفناء تلك الكعبة { والقلائِد } وخصوصاً النفس القوية\n الشريفة\n المطيعة\n المنقادة\n فإنّ التقرّب بها أفضل وشأنها عند البقاء والقيام بالوجود الثاني والحياة الحقيقية أرفع { ذلِكَ } أي: جعل تلك الحضرة قياماً لكم { لِتَعْلَموا } بعلمه عند القيام به { إنّ الله يَعْلَم } حقائق الأشياء في عالم الغيب والشهادة وعلمه محيط بكل شيء\n إذ لا يمكن إحاطة علمكم بعلمه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإنما { جَعَلَ } وصيَّر { ٱللَّهُ } المستغني بذاته عن الأمكنة والحلول فيها مطلقاً { ٱلْكَعْبَةَ } الكعبة المعيننة في أرض الحجاز { ٱلْبَيْتَ ٱلْحَرَامَ } أي: المكان الذي يحرم فيه أكثر ما يحل في غيرها من الأمكنة\n بل جميعها عند العارف\n ليكون { قِيَٰماً لِّلنَّاسِ } يقومون بها ويتيقظون بأركانها ومناسكها\n وآدابها ومشاعرها عن منام الغفلة ورقود النسيان { وَ } كذا صيَّر { ٱلشَّهْرَ ٱلْحَرَامَ } ميقاتاً لزيارتها وطوافها\n ليقوموا فيها بتهيئة أسباب الفناء\n وتخلية الضمير عن الميل إلى الغير والسّوى\n\n\n{ وَ } صيَّر سبحانه أيضاً { ٱلْهَدْيَ وَٱلْقَلاَئِدَ } جبراً لما انكسر من رعاية نسكه\n وأراد به\n لئلا يتقاعدوا عن إتمامها { ذٰلِكَ } أي: جعلها وتصييرها مرجعاً لقاطبة الأنام\n وقبلة لهم بحيث يجب عليهم التوجه نحوه من كل مرمى سحيق\n وفج عميق\n إنما هو { لِتَعْلَمُوۤاْ أَنَّ ٱللَّهَ } المحيط بذرائر الأكوان { يَعْلَمُ } بالعلم الحضوري جميع { مَا فِي ٱلسَّمَٰوَٰتِ } أي: العلويات والأعيان الثابتة { وَمَا فِي ٱلأَرْضِ } السفليات التي هي الهويات الباطلة { وَ } ليعلموا { أَنَّ ٱللَّهَ } المنزه\n المتعالي عن أن يحاط بمجلاه وتجلياته { بِكُلِّ شَيْءٍ } مما استأثر باطلاعه\n وما يعلم جنوده إلا هو { عَلِيمٌ } [المائدة: 97] لا يعزب عن علمه وحضوره شيء\n كلَّت الألسن عن تفسير صفتك\n وانحسرت العقول عن كنه معرفتك\n فكيف يعرف كنه صفتك يا رب؟\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { البيت الحرام }: عطف بيان على جهة المدح\n و { قيامًا }: مفعول ثان\n يقول الحقّ جلّ جلاله: { جعل الله الكعبة } التي هي { البيت الحرام قيامًا للناس } أي: سبب انتعاشهم\n يقوم بها أمر معاشهم ومعادهم\n يلوذ به الخائف\n ويأمن فيه الضعيف\n ويربَحُ فيه التجار\n ويتوجه إليه الحجاج والعُمار\n أو يقوم به أمر دينهم بالحج إليه\n وأمر دنياهم بِأمنِ داخله\n وتُجبى ثمرات كل شيء إليه\n قال القشيري: حكَم الله ـ سبحانه ـ بأن يكون بيته اليومَ ملجأ يلوذ به كل مُؤمّل\n ويستقيم ببركة زيارته كلُّ حائدٍ عن نهج الاستقامة\n ويظفر بالانتقال هناك كل ذي أرَبٍ\n هـ\n { والشهر الحرام } جعله الله أيضًا قيامًا للناس والمراد به ذو الحجة\n فهو قيام لمناسك الحج\n وجَمعِ الوجود إليه بالأموال من كل جانب\n أو الجنس\n وهي أربعة: ذو القعدة وذو الحجة والمحرم ورجب\n لأنهم كانوا يكفون عن القتال\n ويأمن الناس فيها في كل مكان\n { والهدي } لأنه أمان لمن يسوقه لأنه لم يأت لحرب\n { والقلائد } \n كان الرجل إذا خرج يريد الحج تقلد شيئًا من السمُر\n وإذا رجع تقلد شيئًا من شجر الحرم ليعلم أنه كان في عبادة\n فلا يتعرض له أحد بشر\n فالقلائد هنا: ما تقلده المحرم من الشجر\n وقيل: قلائد الهدى\n { ذلك لتعلموا أن الله يعلم ما في السماوات وما في الأرض } أي: جعل ذلك الأمور\n قيامًا للناس لتعلموا أن الله يعلم تفاصيل الأمور\n فشرع ذلك دفعًا للمضار وجلبًا للمنافع\n { وأن الله بكل شيء عليم } لا يخفى عليه محل مصالح عباده ومضارهم\n وهو تعميم بعد تخصيص\n ومبالغة بعد إطلاق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:63",
      "similarity": 0.5736720606622315
    },
    {
      "verse": "42:12",
      "similarity": 0.5564453985701107
    },
    {
      "verse": "78:33",
      "similarity": 0.5464384339333068
    },
    {
      "verse": "5:2",
      "similarity": 0.3753985095306699
    },
    {
      "verse": "5:95",
      "similarity": 0.28662420936606214
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/005097.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/005097.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/5:97.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}