{
  "chapter": "المائدة",
  "text": "ما على الرسول الا البلغ والله يعلم ما تبدون وما تكتمون",
  "translations": [
    {
      "translation": "The Messenger is only responsible for transmission. Allah knows what you divulge and what you hide.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is for the Prophet to convey the message: God knows what you reveal and what you hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger is bound only to deliver the message, whereafter Allah knows well all that you disclose and all that you conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The duty of the Messenger is only to preach. God knows what you reveal or hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no duty upon the Noble Messenger except to convey the command; and Allah knows all what you disclose and all what you hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger's duty is but to convey. And Allah knows all that you reveal and all that you conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing is (incumbent) on the Apostle but to deliver (the message), and Allah knows what you do openly and what you hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is only for the Messenger to deliver the Message; and God knows what you reveal and what you hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The duty of the messenger is only to convey (the message). Allah knoweth what ye proclaim and what ye hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger's sole duty is to convey the message. God knows what you reveal and what you hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Naught resteth there on the apostle except the preaching, and Allah knoweth that which ye disclose and that which ye hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Apostle’s duty is only to communicate and Allah knows whatever you disclose and whatever you conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger's duty is but to proclaim (the message). But Allah knoweth all that ye reveal and ye conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger's duty [i.e. Our Messenger Muhammad SAW whom We have sent to you, (O mankind)] is but to convey (the Message). And Allah knows all that you reveal and all that you conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The duty of the Messenger is only the delivery (of the Message). Allah knows what you reveal and what you hide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Messenger’s sole duty is to convey. God knows what you reveal and what you conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not upon the Messenger is [responsibility] except [for] notification. And Allah knows whatever you reveal and whatever you conceal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[5:99] The duty of the Messenger is only to convey [the Message], to you; and God knows what you reveal, what deeds you manifest, and what you hide, and what of these you conceal, and He will requite you for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The duty of the messenger is only to convey (the message)) on behalf of Allah. (Allah knoweth what ye proclaim) what you display publicly of good and evil (and what ye hide) of good or evil; it is also said that this means: Allah knows what you display among yourselves and that which you conceal from one another in relation to taking the money of Shurayh.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nفإن جادلوا معك يا أكمل الرسل، أهل البدع الأهواء الفاسدة في هذه الإلهامات والاختبارات الإلهية المترشحة من بحر الحكمة، قل لهم نيابة عنا: { مَّا عَلَى ٱلرَّسُولِ } الهادي بإذن الحق { إِلاَّ ٱلْبَلاَغُ } أي: بلاغ ما أهدى به والقبول من الله، والتوفيق من عنده { وَٱللَّهُ } المطلع لضمائركم { يَعْلَمُ مَا تُبْدُونَ } تظهرون، وتعلنون من الإيمان والإطاعة { وَمَا } كنتم { تَكْتُمُونَ } [المائدة: 99] من الكفر والبدعة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:33",
      "similarity": 0.6218073980678369
    },
    {
      "verse": "24:29",
      "similarity": 0.5786211553860946
    },
    {
      "verse": "5:61",
      "similarity": 0.5608692591328165
    },
    {
      "verse": "2:146",
      "similarity": 0.49607864193565404
    },
    {
      "verse": "2:159",
      "similarity": 0.4905310317261876
    }
  ]
}