{
  "chapter": "الممتحنة",
  "text": "يايها الذين ءامنوا۟ لا تتخذوا۟ عدوى وعدوكم اولياء تلقون اليهم بالمودة وقد كفروا۟ بما جاءكم من الحق يخرجون الرسول واياكم ان تؤمنوا۟ بالله ربكم ان كنتم خرجتم جهدا فى سبيلى وابتغاء مرضاتى تسرون اليهم بالمودة وانا۠ اعلم بما اخفيتم وما اعلنتم ومن يفعله منكم فقد ضل سواء السبيل",
  "translations": [
    {
      "translation": "You who have iman! do not take My enemy and your enemy as friends, showing love for them when they have rejected the truth that has come to you, driving out the Messenger and yourselves simply because you have iman in Allah your Lord. If you go out to do jihad in My Way and seeking My pleasure, keeping secret the love you have for them, I know best what you conceal and what you make known. Any of you who do that have strayed from the right way.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O YOU WHO BELIEVE, do not take My enemies and your enemies as friends. You show kindness to them, but they reject the true way that has come to you. They expelled the Prophet and you, for you believe in God your Lord. If you have come out to struggle in My cause having sought My acceptance, (do not be) friendly with them in secret. I know what you hide and what you disclose. Whoever of you does this will have gone astray from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, if you have left (your homes and) have come forth to struggle in My Way and to seek My good pleasure, do not make friends with My enemies and your enemies. You befriend them whereas they have spurned the Truth that has come to you; and (such is their enmity that) they expel the Messenger and yourselves for no other reason than that you believe in Allah, your Lord. You send to them messages of friendship in secrecy, although I know well whatever you do, be it secretly or publicly. And whosoever of you does so has indeed strayed far away from the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not choose My enemies and your own enemies for friends, and offer them strong love. They have rejected the Truth which has come to you, and have expelled the Messenger and you from your homes because of your belief in your Lord. When you go to fight for My cause and seek My pleasure, you secretly express your love of them. I know best what you reveal or conceal. Whichever of you does this has indeed gone astray from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not befriend My and your enemy – you reveal secrets to them out of friendship whereas they disbelieve in the truth which has come to you! It is they who remove the Noble Messenger and you from your homes, upon your believing in Allah, your Lord; if you have come out to fight for My cause, and to gain My pleasure, then do not befriend them; you send them secret messages of friendship – and I well know all what you hide and all what you disclose; and whoever among you does it, has indeed strayed away from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Take not My enemies and your enemies as protecting friends, showing affection towards them, while they have disbelieved in what has come to you of the truth, and have driven out the Messenger and yourselves because you believe in Allah, your Lord! If you have come forth to strive in My cause and to seek My good pleasure. You show friendship to them in secret, while I am All-Aware of what you conceal and what you reveal. And whosoever of you (Muslims) does that, then indeed he has gone (far) astray from the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! do not take My enemy and your enemy for friends: would you offer them love while they deny what has come to you of the truth, driving out the Apostle and yourselves because you believe in Allah, your Lord? If you go forth struggling hard in My path and seeking My pleasure, would you manifest love to them? And I know what you conceal and what you manifest; and whoever of you does this, he indeed has gone astray from the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, take not My enemy and your enemy for friends, offering them love, though they have disbelieved in the truth that has come to you, expelling the Messenger and you because you believe in God your Lord. If you go forth to struggle in My way and seek My good pleasure, secretly loving them, yet I know very well what you conceal and what you publish; and whosoever of you does that, has gone astray from the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Choose not My enemy and your enemy for allies. Do ye give them friendship when they disbelieve in that truth which hath come unto you, driving out the messenger and you because ye believe in Allah, your Lord? If ye have come forth to strive in My way and seeking My good pleasure, (show them not friendship). Do ye show friendship unto them in secret, when I am Best Aware of what ye hide and what ye proclaim? And whosoever doeth it among you, he verily hath strayed from the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Do not offer friendship to those who are enemies of Mine and of yours. Would you show them affection when they have rejected the truth you have received; when they have driven you and the Messenger out [simply] because you believe in God, your Lord. If you have left your homes to strive for My cause and out of a desire to seek My goodwill, how can you secretly offer them friendship?  I know all that you conceal and all that you reveal. Whoever of you does this will surely stray from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! take not Mine enemy and your enemy for friends, showing affection toward them, whilst they of a surety disbelieve in that which hath come Unto you of the truth, and have driven forth the apostle and yourselves because ye believe in Allah, your Lord, if ye have come forth to strive in My way and to seek My goodwill. Ye secretly show them affection, while I am best Knower of that which ye conceal and that which ya make known! And whosoever of you doth this, he hath surely strayed from the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not take My enemy and your enemy for friends, [secretly] offering them affection, if you have set out for jihad in My way and to seek My pleasure, for they have certainly denied whatever has come to you of the truth, expelling the Apostle and you, because you have faith in Allah, your Lord. You secretly nourish affection for them, while I know well whatever you hide and whatever you disclose, and whoever among you does that has certainly strayed from the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Take not my enemies and yours as friends (or protectors),- offering them (your) love, even though they have rejected the Truth that has come to you, and have (on the contrary) driven out the Prophet and yourselves (from your homes), (simply) because ye believe in Allah your Lord! If ye have come out to strive in My Way and to seek My Good Pleasure, (take them not as friends), holding secret converse of love (and friendship) with them: for I know full well all that ye conceal and all that ye reveal. And any of you that does this has strayed from the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Take not My enemies and your enemies (i.e. disbelievers and polytheists, etc.) as friends, showing affection towards them, while they have disbelieved in what has come to you of the truth (i.e. Islamic Monotheism, this Quran, and Muhammad SAW), and have driven out the Messenger (Muhammad SAW) and yourselves (from your homeland) because you believe in Allah your Lord! If you have come forth to strive in My Cause and to seek My Good Pleasure, (then take not these disbelievers and polytheists, etc., as your friends). You show friendship to them in secret, while I am All-Aware of what you conceal and what you reveal. And whosoever of you (Muslims) does that, then indeed he has gone (far) astray, (away) from the Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not take My enemy and your enemy for your guides, offering them love when they have disbelieved the truth that has come to you, who expelthe Messenger and yourselves because you believe in Allah, your Lord! If you go out to struggle in My way seeking My pleasure, but secretly love them, I know well what you conceal and what you reveal; whosoever of you does this will have gone astray from the Right Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not take My enemies and your enemies for supporters, offering them affection, when they have disbelieved in what has come to you of the Truth. They have expelled the Messenger, and you, because you believed in God, your Lord. If you have mobilized to strive for My cause, seeking My approval, how can you secretly love them? I know what you conceal and what you reveal. Whoever among you does that has strayed from the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not take My enemies and your enemies as allies, extending to them affection while they have disbelieved in what came to you of the truth, having driven out the Prophet and yourselves [only] because you believe in Allah, your Lord. If you have come out for jihad in My cause and seeking means to My approval, [take them not as friends]. You confide to them affection, but I am most knowing of what you have concealed and what you have declared. And whoever does it among you has certainly strayed from the soundness of the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[60:1] O you who believe, do not take My enemy and your enemy, namely, the disbelievers of Mecca, for friends. You offer, you communicate to, them, the Prophet’s plan (s) to attack them, which he had confided to you, and had kept secret, at Hunayn, [communicating this to them out of], affection, between you and them. Hātib b. Abī Balta‘a sent them a letter to that effect, on account of his having children and close relatives, idolaters, among them. The Prophet (s) intercepted it from the person to whom he [Hātib] had given it to deliver, after God apprised him of this. Hātib’s excuse for this [conduct of his] was accepted [by the Prophet]; when verily they have disbelieved in the truth that has come to you, that is, [in] the religion of Islam and the Qur’ān, expelling the Messenger and you, from Mecca, by oppressing you, because you believe in God, your Lord. If you have gone forth to struggle in My way and to seek My pleasure … (the response to the conditional is indicated by what preceded, that is to say, [understand it as being] ‘then do not take them as friends’). You secretly harbour affection for them, when I know well what you hide and what you proclaim. And whoever among you does that, that is, to secretly communicate the Prophet’s news to them, has verily strayed from the right way, he has missed the path of guidance (originally, al-sawā’ means ‘the middle [way]’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said concerning the interpretation of Allah's saying (0 ye who believe!): (0 ye who believe!) referring to Hatib, (Choose not My enemy) in religion (and your enemy) who fight you, i.e. the people of Mecca (for friends) seeking their assistance and help. (Do ye give them friendship) you send them a letter to assist and help them (when they disbelieve in that truth which hath come unto you) i.e. to Hatib, (driving out the messenger) Muhammad (pbuh) from Mecca (and you) i.e. Hatib (because ye believe) because of your faith (in Allah, your Lord? If ye have come forth) if you have, Hatib, come forth from Mecca to Medina (to strive in My way) for the sake of My obedience (and seeking My good pleasure, (show them not friendship). Do ye show friendship unto them in secret) do not send letters to them in secret to assist and help them, (when I am best Aware of what ye hide) i.e. of what you hide, Hatib, regarding the letter; and it is also said that this means: regarding your faith (and what ye proclaim) Hatib, of excuse; and it is also said: of profession of Allah's divine Oneness? (And whosoever doeth it among you) whoever of you, believers, does as Hatib did, (he verily hath strayed from the right way) he has indeed strayed from the path of guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قالَ: علي بن أحمد\n قالَ: حدَّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السلامُ في قولهِ تعالى: { لاَ تَتَّخِذُواْ عَدُوِّي وَعَدُوَّكُمْ أَوْلِيَآءَ تُلْقُونَ إِلَيْهِمْ بِٱلْمَوَدَّةِ وَقَدْ كَفَرُواْ بِمَا جَآءَكُمْ مِّنَ ٱلْحَقِّ يُخْرِجُونَ ٱلرَّسُولَ وَإِيَّاكُمْ أَن تُؤْمِنُواْ بِٱللَّهِ رَبِّكُمْ } فالعَدوّ: واحدُ وجمعُ\n وتُلقُونَ إليهم: معناه تُخبرونَهم سِراً أنكم علَى مَودتِهِم\n وأنهَم يَقولونَ إيّاكم أن تُؤمنوا بالله رَبَّكُم\n فلا تَتّخذُونَهم أولياءَ، إنْ كُنتُم خَرجتُم جهاداً في سبيلي، وابتغاء مَرضَاتِي\n\n\n\n\nوقوله تعالى: { فَقَدْ ضَلَّ سَوَآءَ ٱلسَّبِيلِ } يعني جارَ عن وِسَطِ الطَّريقِ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\nHe said: \"Ali ibn Ahmad.\"\n\n\nHe said: It was narrated to us by 'Ata' ibn Al-Saa'ib from his father, from Zayd ibn 'Ali, peace be upon him, regarding the words of Allah, {Do not take My enemies and your enemies as allies, extending to them love and affection while they have disbelieved in what has come to you of the truth, expelling the Messenger and you only because you believe in Allah, your Lord}. So the \"enemy\" is singular and plural.\n\nYou tell them secretly that you love them.\n They (the pagans of Mecca) say to you (Prophet Muhammad), \"Believe in Allah, your Lord.\"\n\nThey (the pagans of Mecca) tell you, \"Believe in Allah, your Lord.\"\n\nDo not take them as allies, if you have gone out for my sake on a [religious] campaign, seeking my pleasure.\n\n\nAnd His saying, {So both ways are equally astray} means that one has gone off the path in either direction.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nعدوّ الله هو الذي خالف عهده وأعرض بقلبه عن جنابه\n فبالضرورة يكون مشركاً بمحبة الغير وعدواً لكل موحد ينفي الغير لكون كل منهما في عدوة حينئذ ولهذا قال: { عدوّي وعدوّكم } وأشار إلى كون الموالاة بينهما عرضياً لا ذاتياً بقوله: { تلقون إليهم بالموّدة } ثم بين امتناع كونه ذاتياً ببيان المنافاة الذاتية بينهما وعدم المناسبة والجنسية من جميع الوجوه بقوله: { وقد كفروا } إلى آخره\n ثم أشار إلى أن وقوعها لا يكون إلا عند الجنسية وحدوث الميل إلى الشرك\n فإن وقعت فلا بد منهما بقوله: { ومن يفعله منكم فقد ضلّ سواء السبيل } أي: طريق الوحدة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى اتصافكم بالإيمان بالله وبوحدة ذاته\n وكمالات أسمائه وصفاته: أن { لاَ تَتَّخِذُواْ عَدُوِّي } وهم الذين خرجوا من عروة وعبوديتي بإثبات الوجود لغيري { وَعَدُوَّكُمْ } إذ عداوتهم إياي مستلزمة لعداوتهم إياكم أيضاً\n إذ صديق العدو كعدو الصديق { أَوْلِيَآءَ } أحباء\n توالون معهم كأرباب المحبة والولاء\n وتظهرون محبتهم ومودتهم إلى حيث { تُلْقُونَ } ترسلون { إِلَيْهِمْ } رسالة مشعرة { بِٱلْمَوَدَّةِ } الخالصة\n المنبئة عن إفراط المحبة والإخاء { وَ } الحال أنهم { قَدْ كَفَرُواْ } وأعرضوا { بِمَا جَآءَكُمْ } أي: بعموم ما نزل على رسولكم { مِّنَ ٱلْحَقِّ } الحقيق بالإطاعة والاتِّباع\n وبالغوا في الإعراض والإنكار إلى حيث { يُخْرِجُونَ ٱلرَّسُولَ } أصالةً { وَإِيَّاكُمْ } تبعاً بوسطة { أَن تُؤْمِنُواْ بِٱللَّهِ رَبِّكُمْ } الذي رباكم على فطرة التوحيد والإيمان\n وقبول دين الإسلام من النبي المبعوث إلى كافة الأنام\n ليشردهم إلى دار السلام\n\n\nوبالجملة: { إِن كُنتُمْ } أيها المؤمنون الموحدون { خَرَجْتُمْ } عن أوطانكم\n وبقاع إمكانكم { جِهَاداً } أي: لأجل الجهاد والقتال { فِي سَبِيلِي } أي: سبيل توحيدي\n وترويج ديني\n وإعلاء كلمة توحيدي { وَٱبْتِغَآءَ مَرْضَاتِي } في امتثال أمري\n وإطاعة حكمي فلزمكم ترك موالاة أعدائي والمؤاخاة معهم\n مع أنكم أنتم { تُسِرُّونَ } وتخفون { إِلَيْهِمْ بِٱلْمَوَدَّةِ } ظناً منك أني لا أطلع على ما في سرائركم وضمائركم من محبة الأعداء ومودتهم { وَ } الحال أنه { أَنَاْ أَعْلَمُ } منكم { بِمَآ أَخْفَيْتُمْ وَمَآ أَعْلَنتُمْ } أي: بجميع ما تسرون وما تعلنون { وَ } بالجملة: { مَن يَفْعَلْهُ مِنكُمْ } أي: الاتخاذ المذكور { فَقَدْ ضَلَّ سَوَآءَ ٱلسَّبِيلِ } [الممتحنة: 1] أي: انحرف عن جادة العدالة الإلهية\n ومال عن الصراط المستقيم الموصل إلى مقصد التوحيد\n\n\nواعلموا أيها المؤمنون أنكم\n وإن بالغتم في إظهار المحبة والمودة بالنسبة إليهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { يا أيها الذين آمنوا لا تتخذوا عدوي وعدوَّكم أولياء } أي: أصدقاء\n نزلت في حاطب بن أبي بلتعة\n وذلك أنه لمّا تجهز رسولُ الله صلى الله عليه وسلم لغزوة الفتح\n كتب إلى أهل مكة\n إنَّ رسول الله صلى الله عليه وسلم يُرديكم\n فخُذوا حِذركم\n وفي رواية: كتب: إنَّ رسولَ الله صلى الله عليه وسلم يسير إليكم بجيشٍ كالليل\n يسيل كالسيل\n فالحذرَ الحذرَ\n وأرسله مع \" ساره \" مولاة بني المطلب\n وقيل: كلثوم بنت عقبة بن أبي مُعيط\n فنزل جبريلُ عليه السلام بالخبر\n\n \" فبعث رسولُ الله صلى الله عليه وسلم عليًّا وعمّاراً\n وطلحة\n والزبير\n والمقداد\n وأبا مرثد\n وقال: \" انطلقوا حتى تأتوا روضة خاخ\n فإنّ بها ظعينة\n معها كتاب إلى أهل مكة\n فخذوه منها\n وخلُوها\n فإن أبتْ فاضربوا عنقها \" فأدركوها ثمة\n فجحدت\n فسلّ عليٌّ سيفه\n فأخرجته من عِقاصِها\n زاد النسفي: أنه عليه السلام أمَّن يوم الفتح جميعَ الناس إلاّ أربعة\n هي أحدهم\n فاستحضر رسول الله صلى الله عليه وسلم حاطباً\n وقال: \" ما حملك على هذا \"؟ فقال: يا رسول الله! ما كفرتُ منذ أسلمتُ\n ولا غششتُ منذ نصحتُ\n ولكني كنتُ امرءاً مُلْصَقًا في قريش\n ليس لي فيهم مَن يحمي أهلي\n فأردتُ أن أتخذ عندهم يداً\n وعملتُ أن كتابي لا يُغني شيئاً\n فصدّقه صلى الله عليه وسلم\n وقَبِلَ عُذره\n فقال عمر: دعني يا رسول الله أضرب عنق هذا المنافق\n فقال رسول الله صلى الله عليه سلم: \" وما يدريك يا عمر\n لعل الله قد اطلع على أهل بدر\n فقال لهم: اعملوا ما شئتم فقد غفرتُ لكم \" \nففاضت عينا عمر رضي الله عنه\n أي: من بكاء الفرح\n والعَدُو: فَعُول\n من: عدا\n ولكونه على زنة المصدر أوقع على الجمع إيقاعه على الواحد\n وفي الآية دليل على أنّ الكبيرة لا تسلب الإيمان\n وقوله: { تُلْقٌونَ إِليهم بالمودةِ }: حال\n أي: لا تتخذوهم أولياء مُلقين إليهم\n أو: استئناف\n أو: صفة لأولياء\n أي: توصلون إليهم المودة\n على أن الباء زائدة\n كقوله:\n[البقرة: 195]\n أو: تُلقون إليهم أخبارَ النبي صلى الله عليه وسلم بسبب المودة التي بينكم وبينهم\n فتكون أصلية\n { وقد كفروا بما جاءكم من الحق }: حال من فاعل \" تتخذوا \" أو \" تُلقون \" \n أي: لا تتولوهم\n أو: لا تودوهم وهذه حالتهم يكفرون { بما جاءكم من الحق } الإسلام\n أو: القرآن\n جعلوا ما هو سبب الإيمان سبب الكفر\n { يُخرجون الرسولَ وإِياكم } من مكة\n وهواستئناف مُبيَّن لكفرهم وعتوهم\n أو حال من \" كفروا \"\n وصيغة المضارع لاستحضار الصورة\n وقوله: { أن تؤمنوا بالله ربِّكم } تعليل للإخراج\n أي: يُخرجونكم لإيمانكم\n { إِن كنتم خرجتمْ جهادًا في سبيلي وابتغاء مرضاتي } \n هو متعلق بـ \" لاتتخذوا \" كأنه قيل: لا تودُّوا أعدائي إن كنتم أوليائي\n\n{ تُسِرُّون إِليهم بالمودةِ } أي: تُفضون إليهم بمودتكم سرًّا\n أو تُسِرُّون إليهم أسرارَ رسولِ الله صلى الله عليه وسلم بسبب المودة\n وهو استئناف وارد على نهج العتاب والتوبيخ\n { وأنا أعلمُ } أي: والحال أني أعلم منكم { بما أخفيتم وما أعلنتم } ومُطلِع رسولي على ما تُسِرُّون\n فإني طائل لكم في الإسرار\n وقيل: الباء زائدة\n و \" أعلم \" مضارع و \" ما \" موصولة\n أو مصدرية\n { ومَن يَفْعله منكم } أي: الاتخاذ { فقد ضَلَّ سواء السبيل } فقد أخطأ طريق الحق والصواب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:38",
      "similarity": 0.43653253489852967
    },
    {
      "verse": "2:77",
      "similarity": 0.4046582728691715
    },
    {
      "verse": "16:19",
      "similarity": 0.3993697964145482
    },
    {
      "verse": "71:9",
      "similarity": 0.38911586160958506
    },
    {
      "verse": "36:76",
      "similarity": 0.3826447694668847
    }
  ]
}