{
  "chapter": "الممتحنة",
  "text": "يايها الذين ءامنوا۟ لا تتولوا۟ قوما غضب الله عليهم قد يئسوا۟ من الءاخرة كما يئس الكفار من اصحب القبور",
  "translations": [
    {
      "translation": "You who have iman! do not make friends of people with whom Allah is angry, who have despaired of the Next World as the kafirun have despaired of the inhabitants of the graves.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, do not make friends with those who have suffered the anger of God by having become despondent of the life to come like those unbelievers who are despondent of those who are in the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not make friends with those against whom Allah is wrathful and who are despaired of the Hereafter, as despaired as are the unbelievers lying in their graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not establish friendship with the people who have become subject to the wrath of God. They do not have any hope in the life to come, just as the disbelievers have no hope in those who are in their graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Do not befriend the people upon whom is Allah’s wrath – they have lost hope in the Hereafter the way the disbelievers have lost hope in the people of the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Take not as friends the people who incurred the wrath of Allah. Surely, they have despaired of the Hereafter, just as the disbelievers have despaired of those (buried) in graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! do not make friends with a people with whom Allah is wroth; indeed they despair of the hereafter as the unbelievers despair of those in tombs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, take not for friends a people against whom God is wrathful, and who have despaired of the world to come, even as the unbelievers have despaired of the inhabitants of the tombs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Be not friendly with a folk with whom Allah is wroth, (a folk) who have despaired of the Hereafter as the disbelievers despair of those who are in the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Do not make friends with those who have incurred the wrath of God. Such men are indeed bereft of all hope of a life to come, just as those who deny the truth lying in their graves are bereft of all hopes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! befriend not a people against whom Allah is Wroth. Surely they have despaired of tHe Hereafter even as have despaired the entombed of the infidels. S\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not befriend a people at whom Allah is wrathful: they have despaired of the Hereafter, just as the faithless have despaired of the occupants of the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Turn not (for friendship) to people on whom is the Wrath of Allah, of the Hereafter they are already in despair, just as the Unbelievers are in despair about those (buried) in graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Take not as friends the people who incurred the Wrath of Allah (i.e. the Jews). Surely, they have been in despair to receive any good in the Hereafter, just as the disbelievers have been in despair about those (buried) in graves (that they will not be resurrected on the Day of Resurrection).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not take as guides those who have incurred the Wrath of Allah and who despair of the Everlasting Life (to come), like the unbelieversdespaired of the inhabitants of the tombs (that they shall be resurrected).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Do not befriend people with whom God has become angry, and have despaired of the Hereafter, as the faithless have despaired of the occupants of the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, do not make allies of a people with whom Allah has become angry. They have despaired of [reward in] the Hereafter just as the disbelievers have despaired of [meeting] the inhabitants of the graves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[60:13] O you who believe, do not befriend a people against whom God is wrathful, namely, the Jews. They have truly despaired of the Hereafter, of [attaining] its reward — despite their being certain of its truth, out of obstinacy towards the Prophet, even though they know him to be sincere — just as the disbelievers have despaired — they [themselves] being — of those who are in the tombs, that is to say, those who are entombed [and barred] from the good of the Hereafter, for they are shown [both] their [would-have-been] places in Paradise, had they believed, and the Fire for which they are destined.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe!) referring here to 'Abdullah Ibn Ubayy and his fellow believers (Be not friendly) i.e. seeking their help and assistance and divulging to them the secrets of the Prophet (pbuh) (with a folk with whom Allah is wroth) twice; this refers to the Jews when they said: \"Allah's Hand is uptight\" and again when they disbelieved in Muhammad (pbuh) ((a folk) who have despaired of the Hereafter) who have despaired of the bliss of Paradise (as the disbelievers) the disbelievers of Mecca (despair of those who are in the graves) i.e. of the return of the people of the graves; and it is also said that this means: of the questioning of Munkar and Nakir; and it is also said this means: do not be friendly with a folk with whom Allah is wroth, but rather be of those who glorify Allah and pray to Him'. And of the surah in which the Ranks are mentioned, which is all Medinan and consists of 14 verses, 221 words and 929 letters: Surah 61: The Ranks (al-Saff) And of the surah in which the Ranks are mentioned, which is all Medinan and consists of 14 verses, 221 words and 929 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { يا أيها الذين آمنوا لا تَتَولوا قومًا غَضِبَ اللهُ عليهم } ، وهم اليهود. رُوِي أنها نزلت في بعض فقراء المسلمين، كانوا يُواصلون اليهود، ليُصيبوا من ثمارهم. وقيل: عامة الكفرة إذ كلهم في الغضب. قال ابن عرفة: كيف نهى عن مطلق الموالاة بعد قوله: { لا ينهاكم الله... } الآية؟ قلنا: المراد بتلك المسالمة والمتاركة، لا الموالاة. هـ. { قد يَئِسُوا من الآخرة } أي: مِن ثوابها لعلمهم بأنهم لا خلاق لهم فيها، لِعنادهم الرسول المنعوت في التوراة، المؤيَّد بالمعجزات، أو: لفعلهم فعل مَن يئس مِن الآخرة، فحالهم حال اليائس، وإذا قلنا: هم الكفرة فيأسهم ظاهر، لإنكارهم البعث. والأول أظهر لقوله { كما يئس الكفارُ } أي: المشركون { من أصحاب القبور } أن يرجعوا إليهم. أو: كما يئس منها الذين ماتوا منهم لأنهم وقفوا على حقيقة الحال، وشاهدوا حرمانهم من نعيمها المقيم، وابتلاءهم بعذابها الأليم. والمراد: وصفهم بكمال اليأس منها، وقيل: المعنى: كما يئسوا من موتاهم أن يُبعثوا أو يرجعوا أحياء. وأظهر في موضع الإضمار للإشعار بعلّة يأسهم، وهو الكفر. قال ابن عرفة: إنْ أُريد المشركون فهم يئسوا منها حقيقة، أي: مِن وجودها، وإنْ أُريد اليهود، فهم يئسوا من نعيمها. فأن قلت: كيف وهم يزعمون أنّ نعيمها خاص بهم؟ قُلتُ: كفرهم عناد. وإسناد الإياس إليهم مجاز، فإذا أراد اليهود، فيكون التشبيه بالكفار حقيقة، وإنْ أُريد العموم فالتشبيه باعتبار اختلاف الصفة والحال، كقولك: هذا بسْراً أطيب منه رطباً. أي: كما يئسوا من أصحاب القبور أن يرجعوا إلى الدنيا، أو يتنعّموا بالجنة. هـ. وعلى كل حالٍ، فقد ختم السورة بما افتتحها به، تأكيداً لِما نهى عنه. الإشارة: قد تقدّم مراراً النهي عن مخالطة العامة للمريد، حتى يتمكن من الشهود، فيفعل ما يشاء. وكل مَن حُجب عن الله فله قسط من الغضب، وكل مَن لم يتزوّد للآخرة التزوُّد الكامل، فقد نسيها نسيان اليائس. وبالله التوفيق، وصلّى الله على سيدنا محمد وآله وصحبه.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "80:21",
      "similarity": 0.5656486004155943
    },
    {
      "verse": "35:22",
      "similarity": 0.5430032534229204
    },
    {
      "verse": "22:7",
      "similarity": 0.5034464917530243
    },
    {
      "verse": "9:84",
      "similarity": 0.4998073493575475
    },
    {
      "verse": "29:23",
      "similarity": 0.4468673253958789
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/060013.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/060013.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/60:13.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}