{
  "chapter": "الممتحنة",
  "text": "يايها الذين ءامنوا۟ اذا جاءكم المؤمنت مهجرت فامتحنوهن الله اعلم بايمنهن فان علمتموهن مؤمنت فلا ترجعوهن الى الكفار لا هن حل لهم ولا هم يحلون لهن وءاتوهم ما انفقوا۟ ولا جناح عليكم ان تنكحوهن اذا ءاتيتموهن اجورهن ولا تمسكوا۟ بعصم الكوافر وسـلوا۟ ما انفقتم وليسـلوا۟ ما انفقوا۟ ذلكم حكم الله يحكم بينكم والله عليم حكيم",
  "translations": [
    {
      "translation": "You who have iman! when women who have iman come to you as muhajirun, submit them to a test. Allah has best knowledge of their iman. If you know they are muminun. do not return them to the kuffar. They are not halal for the kuffar nor are the kuffar halal for them. Give the kuffar whatever dowry they paid. And there is nothing wrong in your marrying them provided you pay them their due. Do not hold to any marriage ties with women who are kafir. Ask for what you paid and let them ask for what they paid. That is Allah's judgement. Allah will judge between them. Allah is All-Knowing, All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, when believing women come over to you as refugees, then examine them. God alone is cognisant of their faith. If you find that they are believers, do not send them back to unbelievers. They are not lawful for them, nor are infidels lawful for believing women. Give the unbelievers what they have spent on them. There is no sin if you marry them provided you give their dowers to them. Do not retain your (marriage) ties with unbelieving women. Ask for the return of what you have spent (on them); and the unbelievers should ask for the return of what they have spent. This is the judgement of God. He judges between you. God is all-knowing and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when believing women come to you as Emigrants (in the cause of faith), examine them. Allah fully knows (the truth) concerning their faith. And when you have ascertained them to be believing women, do not send them back to the unbelievers. Those women are no longer lawful to the unbelievers, nor are those unbelievers lawful to those (believing) women. Give their unbelieving husbands whatever they have spent (as bridal-dues); and there is no offence for you to marry those women if you give them their bridal-dues. Do not hold on to your marriages with unbelieving women: ask for the return of the bridal-due you gave to your unbelieving wives and the unbelievers may ask for the return of the bridal-due they had given to their believing wives. Such is Allah's command. He judges between you. Allah is All-Knowing, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when believing immigrant women come to you, test them. God knows best about their faith. If you know that they are believers, do not return them to the disbelievers. Such women are not lawful for them and disbelievers are not lawful for such women. Give the disbelievers whatever they have spent (on such women for their dowry). There is no offense for you to marry them if you agree to give them their dowry. Do not hold unto your disbelieving wives; you may get back what you have spent on them for their dowry and the disbelievers may also ask for what they have spent. This is the command of God by which He judges you. God is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! When Muslim women leave the lands of disbelief and migrate towards you, examine them; Allah knows more about their faith; so if you judge the women to be believers, do not send them back to the disbelievers; neither are they lawful for the disbelievers, nor are the disbelievers lawful for them; and give their disbelieving husbands what they had spent; and there is no sin upon you to marry them if you give them their bridal money; and do not continue the marriage with disbelieving women – and ask for what you had spent, and the disbelievers may ask for what they had spent; this is Allah’s command; He judges between you; and Allah is All Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When believing women come to you as emigrants, examine them; Allah knows best as to their faith, then if you ascertain that they are true believers, send them not back to the disbelievers. They are not lawful for the disbelievers nor are the disbelievers lawful for them. But give them (disbelievers) that which they have spent (on their dowery). And there will be no sin on you to marry them if you have paid their due to them. Likewise do not keep the disbelieving women, and ask for that which you have spent (on their dowery) and let them (the disbelievers) ask for that which they have spent. That is the judgement of Allah, He judges between you. And Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! when believing women come to you flying, then examine them; Allah knows best their faith; then if you find them to be believing women, do not send them back to the unbelievers, neither are these (women) lawful for them, nor are those (men) lawful for them, and give them what they have spent; and no blame attaches to you in marrying them when you give them their dowries; and hold not to the ties of marriage of unbelieving women, and ask for what you have spent, and let them ask for what they have spent. That is Allah's judgment; He judges between you, and Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, when believing women come to you as emigrants, test them. God knows very well their belief. Then, if you know them to be believers, return them not to the unbelievers. They are not permitted to the unbelievers, nor are the unbelievers permitted to them. Give the unbelievers what they have expended; and there is no fault in you to marry them when you have given them their wages. Do not hold fast to the ties of unbelieving women, and ask what you have expended, and let them ask what they have expended. That is God's judgment; He judges between you; and God is All-knowing, All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! When believing women come unto you as fugitives, examine them. Allah is Best Aware of their faith. Then, if ye know them for true believers, send them not back unto the disbelievers. They are not lawful for them (the disbelievers), nor are they (the disbelievers) lawful for them. And give them (the disbelievers) that which they have spent (upon them). And it is no sin for you to marry such women when ye have given them their dues. And hold not to the ties of disbelieving women; and ask for (the return of) that which ye have spent; and let them (the disbelievers) ask for that which they have spent. That is the judgment of Allah. He judgeth between you. Allah is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! When believing women come to you as refugees, submit them to a test. Their faith is best known to God. Then if you find them to be true believers, do not send them back to those who deny the truth. These [women] are not lawful for them, nor are those who deny the truth lawful for these women. But hand back to those who deny the truth the dowers they gave them; nor is it an offence for you to marry such women, provided you give them their dowers. Do not maintain your marriages with those women who deny the truth: demand repayment of the dowers you have given them and let the disbelievers ask for the return of what they have spent. Such is God's judgement; He judges with justice between you. God is all knowing and all wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! when believing women come Unto you as emigrants examine them. Allah is the best Knower of their faith. Then if ye know them to be true believers, send them not back Unto the infidels; they are not lawful Unto them, nor are they lawful Unto them. And give them that which they have expended. Nor is it any crime in you if ye marry them when ye have given their hires. And hold not to the ties of the infidel women, and ask back that which ye have expended, and let them ask back that which they have expended. That is the judgment of Allah; He judgeth between you, And Allah is Knowing, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! When faithful women come to you as immigrants, test them. Allah knows best [the state of] their faith. Then, if you ascertain them to be [genuinely] faithful women, do not send them back to the faithless. They are not lawful for them, nor are they lawful for them, but give them what [dowry] they have spent [for them]. There is no sin upon you in marrying them when you have given them their dowries. Do not hold on to [conjugal] ties with faithless women. Demand [from the infidels] what you have spent [as dowries], and let the faithless demand [from you] what they have spent [as dowries]. That is Allah’s judgment; He judges between you, and Allah is all-knowing, all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! When there come to you believing women refugees, examine (and test) them: Allah knows best as to their Faith: if ye ascertain that they are Believers, then send them not back to the Unbelievers. They are not lawful (wives) for the Unbelievers, nor are the (Unbelievers) lawful (husbands) for them. But pay the Unbelievers what they have spent (on their dower), and there will be no blame on you if ye marry them on payment of their dower to them. But hold not to the guardianship of unbelieving women: ask for what ye have spent on their dowers, and let the (Unbelievers) ask for what they have spent (on the dowers of women who come over to you). Such is the command of Allah: He judges (with justice) between you. And Allah is Full of Knowledge and Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When believing women come to you as emigrants, examine them, Allah knows best as to their Faith, then if you ascertain that they are true believers, send them not back to the disbelievers, they are not lawful (wives) for the disbelievers nor are the disbelievers lawful (husbands) for them. But give the disbelievers that (amount of money) which they have spent [as their Mahr] to them. And there will be no sin on you to marry them if you have paid their Mahr to them. Likewise hold not the disbelieving women as wives, and ask for (the return of) that which you have spent (as Mahr) and let them (the disbelievers, etc.) ask back for that which they have spent. That is the Judgement of Allah. He judges between you. And Allah is All-Knowing, All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when believing women come to you as emigrants, test them. Allah best knows their belief. If you find them to be believers do not return them to the unbelievers; they are not permitted to the unbelievers, nor are the unbelievers permitted to them. But give back to the unbelievers what they have spent, and there is no fault in you to marry such women, provided you give them their dowries. Do not hold on to the ties with unbelieving women, ask what you have spent and let them ask what they have spent. Such is the Judgement of Allah; He judges between you; and Allah is the Knower, and the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When believing women come to you emigrating, test them. God is Aware of their faith. And if you find them to be faithful, do not send them back to the unbelievers. They are not lawful for them, nor are they lawful for them. But give them what they have spent. You are not at fault if you marry them, provided you give them their compensation. And do not hold on to ties with unbelieving women, but demand what you have spent, and let them demand what they have spent. This is the rule of God; He rules among you. God is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, when the believing women come to you as emigrants, examine them. Allah is most knowing as to their faith. And if you know them to be believers, then do not return them to the disbelievers; they are not lawful [wives] for them, nor are they lawful [husbands] for them. But give the disbelievers what they have spent. And there is no blame upon you if you marry them when you have given them their due compensation. And hold not to marriage bonds with disbelieving women, but ask for what you have spent and let them ask for what they have spent. That is the judgement of Allah; He judges between you. And Allah is Knowing and Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[60:10] O you who believe, when believing women come to you, [saying] with their tongues [that they are], emigrating, from the [company of] disbelievers — [this was] following the truce concluded with them [the disbelievers] at al-Hudaybiyya to the effect that if any of their number should go to [join] the believers, that person should be sent back — test them, by making them swear that they had only gone forth [from Mecca] because of their [sincere] wish to embrace Islam, and not out of some hatred for their disbelieving husbands, nor because they might be enamoured by some Muslim man: that was how the Prophet (s) used to take from them their oaths. God knows best [the state of] their faith. Then, if you know them, if you suppose them, on the basis of their oaths, to be believers, do not send them back to the disbelievers. They [the women] are not lawful for them, nor are they [the disbelievers] lawful for them. And give them, that is to say, their disbelieving husbands, what they have expended, on them [on such women], in the way of dowries. And you would not be at fault if you marry them, on that [previous] condition, when you have given them their dowries. And do not hold on (read tumassikū or tumsikū) to the [conjugal] ties of disbelieving women, your wives, for your Islam automatically prohibits you from this, or [to the ties of] those apostatising women who return to the idolaters, for [likewise] their apostatising automatically prohibits you from marrying them, and ask for, demand, [the return of] what you have expended, on these women, of dowries, in the event of apostasy, from those disbelievers to whom they are married. And let them ask for what they have expended, on those women who have emigrated, as explained above, that it may be repaid   to them. That is God’s judgement. He judges between you, therewith, and God is Knower, Wise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا أَيُّهَا الَّذِينَ آَمَنُوا إِذَا جَاءَكُمُ الْمُؤْمِنَاتُ مُهَاجِرَاتٍ فَامْتَحِنُوهُنَّ اللَّهُ أَعْلَمُ بِإِيمَانِهِنَّ فَإِنْ عَلِمْتُمُوهُنَّ مُؤْمِنَاتٍ فَلَا تَرْجِعُوهُنَّ إِلَى الْكُفَّارِ لَا هُنَّ حِلٌّ لَهُمْ وَلَا هُمْ يَحِلُّونَ لَهُنَّ وَآَتُوهُمْ مَا أَنْفَقُوا وَلَا جُنَاحَ عَلَيْكُمْ أَنْ تَنْكِحُوهُنَّ إِذَا آَتَيْتُمُوهُنَّ أُجُورَهُنَّ وَلَا تُمْسِكُوا بِعِصَمِ الْكَوَافِرِ وَاسْأَلُوا مَا أَنْفَقْتُمْ وَلْيَسْأَلُوا مَا أَنْفَقُوا ذَلِكُمْ حُكْمُ اللَّهِ يَحْكُمُ بَيْنَكُمْ وَاللَّهُ عَلِيمٌ حَكِيمٌ (10){ ياأيها الذين ءَامَنُواْ إِذَا جَآءَكُمُ المؤمنات مهاجرات فامتحنوهن الله أَعْلَمُ بإيمانهن فَإِنْ عَلِمْتُمُوهُنَّ مؤمنات فَلاَ تَرْجِعُوهُنَّ إِلَى الكفار لاَ هُنَّ حِلٌّ } .لا خلاف في أن هذه الآيات إلى آخر السورة نزلت عقب صلح الحديبية وقد علمت أنا رجحنا أن أول السورة نزلت قبل هذه وأن كتاب حاطب بن أبي بلتعة إلى المشركين كان عند تجهز رسول الله صلى الله عليه وسلم للحديبية .ومناسبة ورود هذه الآية بعد ما قبلها ، أي النهي عن موالاة المشركين يتطرق إلى ما بين المسلمين والمشركين من عقود النكاح والمصاهرة فقد يكون المسلم زوجاً لمشركة وتكون المسلمة زوجاً لمشرك فتحدث في ذلك حوادث لا يستغني المسلمون عن معرفة حكم الشريعة في مثلها .وقد حدث عقب الصلح الذي انعقد بين النبي صلى الله عليه وسلم وبين المشركين في الحديبية سنة ستّ مَجيء أبي جندل بن سهيل بن عَمرو يَرسُف في الحديد وكان مسلماً وكان موثقاً في القيود عند أبيه بمكة فانفلت وجاء إلى رسول الله صلى الله عليه وسلم وهو في الحديبية وكان من شروط الصلح «أن من أتى محمداً من قريش بغير إذن وليه رده عليهم ومن جاء قريشاً ممن مع محمد لم يردوه عليه» فرده النبي صلى الله عليه وسلم إليهم ، ولما رجع رسول الله صلى الله عليه وسلم إلى المدينة هاجرتْ أُم كلثوم بنت عقبة بن أبي مُعيط هاربة من زوجها عَمرو بن العاص ، وجاءت سبيعة الأسلمية مهاجرة هاربة من زوجها صيفي بن الراهب أو مسافر المخزومي ، وجاءت أُميمة بنت بشر هاربة من زوجها ثابت بن الشِّمْراخ وقيل : حسان بن الدحداحة . وطَلَبهُن أزواجهن فجاء بعضهم إلى المدينة جاء زوج سبيعة الأسلمية يطلب ردها إليه وقال : إن طينة الكتاب الذي بيننا وبينك لم تَجف بعدُ ، فنزلت هذه الآية فأبى النبي صلى الله عليه وسلم أن يردها إليه ولم يرد واحدة إليهم وبقيت بالمدينة فتزوج أمَّ كلثوم بنت عقبة زيدُ بن حارثة . وتزوج سُبيعة عمر رضي الله عنه وتزوج أميمة سهلُ بن حنيف .وجاءت زينب بنت النبي صلى الله عليه وسلم مسلمة ولحق بها زوجها أبو العاص بن الربيع بن عبد العزى بعد سنين مشركاً ثم أسلم في المدينة فردها النبي صلى الله عليه وسلم إليه .وقد اختلف : هل كان النهي في شأن المؤمنات المهاجرات أن يرجعوهن إلى الكفار نسخاً لما تضمنته شرط الصلح الذي بين النبي صلى الله عليه وسلم وبين المشركين أو كان الصلح غير مصرح فيه بإرجاع النساء لأن الصيغة صيغة جمع المذكر فاعتبر مجملاً وكان النهيُ الذي في هذه الآية بياناً لذلك المجمل . وقد قيل : إن الصلح صرح فيه بأن من جاء إلى النبي صلى الله عليه وسلم من غير إذن وليّه من رجل أو امرأة يُرد إلى وليه .فإذا صحّ ذلك كان صريحاً وكانت الآية ناسخة لما فعله النبي صلى الله عليه وسلموالذي في سيرة ابن إسحاق من رواية ابن هشام خلي من هذا التصريح ولذلك كان لفظ الصلح محتملاً لإِرادة الرجال لأن الضمائر التي اشتمل عليها ضمائر تذكير .وقد روي أن النبي صلى الله عليه وسلم قال للذين سألوه إرجاع النساء المؤمنات وطلبوا تنفيذ شروط الصّلح : إنما الشرط في الرجال لا في النساء فكانت هذه الآية تشريعاً للمسلمين فيما يفعلونه إذا جاءهم المؤمنات مهاجرات وإيذاناً للمشركين بأن شرطهم غير نص ، وشأن شروط الصلح الصراحة لعظم أمر المصالحات والحقوق المترتبة عليها ، وقد أذهل الله المشركين عن الاحتياط في شرطهم ليكون ذلك رحمة بالنساء المهاجرات إذ جعل لهن مخرجاً وتأييداً لرسول صلى الله عليه وسلم كما في الآية التي بعدها لقصد أن يشترك من يمكنه الاطّلاع من المؤمنين على صدق إيمان المؤمنات المهاجرات تعاوناً على إظهار الحق ، ولأن ما فيها من التكليف يرجع كثير منه إلى أحوال المؤمنين مع نسائهم .والامتحان : الاختِبار . والمراد اختبار إيمانهن .وجملة { الله أعلم بإيمانهن } معترضة ، أي أن الله يعلم سرائرهنّ ولكن عليكم أن تختبروا ذلك بما تستطيعون من الدلائل .ولذلك فرع على ما قبل الاعتراض قوله : { فإن علمتموهن مؤمنات } الخ ، أي إن حصل لكم العلم بأنهن مؤمنات غير كاذبات في دعواهن . وهذا الالتحاق هو الذي سُمي المبايعة في قوله في الآية الآتية : { يأيها النبي إذا جاءك المؤمنات يبايعنك على أن لا يشركن بالله } الآية \\[ الممتحنة : 12 \\] .وفي «صحيح البخاري» عن عائشة : أنّ رسول الله صلى الله عليه وسلم كان يمتحن من هاجر من المؤمنات بهذه الآية يقول الله : { يأيها النبي إذا جاءك المؤمنات يبايعنك } إلى قوله : { غفور رحيم } \\[ الممتحنة : 12 \\] وزاد ابن عباس فقال : كانت الممتحنة أن تستحْلف أنها ما خرجت بغضاً لزوجها ، ولا رغبة من أرض إلى أرض ، ولا التماس دنيا ، ولا عشقاً لرجل منّا ، ولا بجريرة جرتها بل حبا لله ولرسوله والدار الآخرة ، فإذا حلفت بالله الذي لا إله إلاّ هو على ذلك أعطى النبي صلى الله عليه وسلم زوجها مهرها وما أنفق عليها ولم يردها . وكان النبي صلى الله عليه وسلم يأمر عمر بن الخطاب بتولّي تحليفهن فإذا تبين إيمان المرأة لم يردها النبي صلى الله عليه وسلم إلى دار الكفر كما هو صريح الآية . { فلا ترجعوهن إلى الكفار لا هن حل لهم ولا هم يحلون لهن } .وموقع قوله : { لا هن حل لهم ولا هم يحلون لهن } موقع البيان والتفصيل للنهي في قوله : { فلا ترجعوهن إلى الكفار } تحقيقاً لوجوب التفرقة بين المرأة المؤمنة وزوجها الكافر .وإذ قد كان المخاطب بذلك النهي جميع المؤمنين كما هو مقتضى قوله : { يأيها الذين آمنوا إذا جاءكم المؤمنات } إلى آخره ، تعين أن يقوم بتنفيذه من إليه تنفيذ أمُور المسلمين العامة في كل مكان وكل زمان وهم ولاة الأمور من أمراء وقضاة إذ لا يمكن أن يقوم المسلمون بما خوطبوا به من مثل هذه الأمور العامة إلاّ على هذا الوجه ولكن على كل فرد من المسلمين التزام العمل به في خاصة نفسه والتزام الامتثال لما يقرره ولاة الأمور .وإذ قد كان محمل لفظ الحل وما تصرف منه في كلام الشارع منصرفاً إلى معنى الإِباحة الشرعية وهي الجواز وضد التحريم .ومن الواضح أن الكفار لا تتوجه إليهم خِطابات التكليف بأمور الإِسلام إذ هم خارجون عنه فمطالبتهم بالتكاليف الإسلامية لا يتعلّق به مقصد الشريعة ، ولذلك تعدّ المسألة الملقبة في علم الأصول بمسألة : خطاب الكفار بالفروع ، مسألةً لا طائل تحتها ولا ينبغي الاشتغال بها بَله التفريع عليها .وإذ قد علق حكم نفي حل المرأة الذي هو معنى حرمة دوام عصمتها على ضمير الكفار في قوله تعالى : { لا هن حل لهم } . ولم يكن الكفار صالحين للتكليف بهذا التحريم فقد تعين تأويل هذا التحريم بالنسبة إلى كونه على الكافرين ، وذلك بإرجاع وصف الحل المنفي إلى النساء في كلتا الجملتين وإبداء وجه الإِتيان بالجملتين ووجه التعاكس في ترتيب أجزائهما . وذلك أن نقول : إن رجوع المرأة المؤمنة إلى الزوج الكافر يقع على صورتين :إحداهما : أن ترجع المرأة المؤمنة إلى زوجها في بلاد الكفر ، وذلك هو ما ألح الكفار في طلبه لمّا جاءت بعض المؤمنات مهاجرات .والثانية : أن ترجع إلى زوجها في بلاد الإِسلام بأن يخلى بينها وبين زوجها الكافر يقيم معها في بلاد الإِسلام إذا جاء يطلبها ومُنع من تسلمها . وكلتا الصورتين غير حلال للمرأة المسلمة فلا يجيزها ولاة الأمور ، وقد عبر عن الصورة الأولى بجملة { لا هن حل لهم } إذ جعل فيها وصف حل خبراً عن ضمير النساء وأدخلت اللام على ضمير الرجال ، وهي لام تعدية الحلّ وأصلها لام الملك فأفاد أن لا يملك الرجال الكفار عصمة أزواجهم المؤمنات وذلك يستلزم أن بقاء النساء المؤمنات في عصمة أزواجهن الكافرين غير حلال ، أي لم يحللهن الإِسلام لهم .وقدم { لا هن حل لهم } لأنه راجع إلى الصورة الأكثر أهمية عند المشركين إذ كانوا يَسألون إرجاع النساء إليهم ويرسلون الوسائط في ذلك بقصد الرد عليهم بهذا .وجيء في الجملة الأولى بالصفة المشبهة وهي { حل } المفيدة لثبوت الوصف إذ كان الرجال الكافرون يظنون أن العصمة التي لهم على أزواجهم المؤمنات مثبتة أنهم حلّ لهم .وعبّر عن الثانية بجملة { ولا هم يحلون لهن } فعُكس الإِخبار بالحل إذ جعل خبراً عن ضمير الرجال ، وعدي الفعل إلى المحلَّل باللام داخلة على ضمير النساء فأفاد أنهم لا يحلّ لهن أزواجهن الكافرون ولو بقي الزوج في بلاد الإِسلام .ولهذا ذكرت الجملة الثانية { ولا هم يحلون لهن } كالتتمة لحكم الجملة الأولى ، وجيء في الجملة الثانية بالمسند فعلاً مضارعاً لدلالته على التجدد لإِفادة نفي الطماعية في التحليل ولو بتجدده في الحال بعقد جديد أو اتفاق جديد على البقاء في دار الإِسلام خلافاً لأبي حنيفة إذ قال : إن موجب الفرقة هو اختلاف الدارين لا اختلاف الدين .ويجوز في الآية وجه آخر وهو أن يكون المراد تأكيد نفي الحال فبعد أن قال : { لا هن حل لهم } وهو الأصل كما علمت آنفاً أكد بجملة { ولا هم يحلون لهن } أي أن انتفاء الحلّ حاصل من كل جهة كما يقال : لست منك ولست مني .ونظيره قوله تعالى : { هن لباس لكم وأنتم لباس لهن } في سورة \\[ البقرة : 187 \\] تأكيداً لشدة التلبس والاتصال من كل جهة .وفي الكلام محسّن العكس من المحسنات البديعية مع تغيير يسير بين حل } و { يحلون } اقتضاه المقام ، وإنّما يُوفر حظّ التحسين بمقدار ما يسمح له به مقتضى حال البلاغة .{ لَهُنَّ وَءَاتُوهُم مَّآ } .المراد ب { ما أنفقوا } ما أعْطَوه من المهور ، والعدول عن إطلاق اسم المهور والأجور على ما دفعه المشركون لنسائهم اللاء أسلمن من لطائف القرآن لأن أولئك النساء أصبحن غير زوجات . فألغي إطلاق اسم المهور على ما يدفع لهم .وقد سمّى الله بعد ذلك ما يعطيه المسلمون لهن أجوراً بقوله تعالى : { ولا جناح عليكم أن تنكحوهن إذا آتيتموهن أجورهن .والمكلف بإرجاع مهور الأزواج المشركين إليهم هم ولاة أمور المسلمين مما بين أيديهم من أموال المسلمين العامة .أَنفَقُواْ وَلاَ جُنَاحَ عَلَيْكُمْ أَن تَنكِحُوهُنَّ إِذَآ ءَاتَيْتُمُوهُنَّ } .وإنما قال تعالى : { ولا جناح عليكم أن تنكحوهن إذا آتيتموهن أجورهن } للتنبيه على خصوص قوله : { إذا آتيتموهن أجورهن } لئلا يظن أن ما دفع للزوج السابق مسقط استحقاق المرأة المهر ممن يروم تزويجها ومعلوم أن نكاحها بعد استبرائها بثلاثة أقراء .{ أُجُورَهُنَّ وَلاَ تُمْسِكُواْ بِعِصَمِ } .نهى الله المسلمين عن إبقاء النساء الكوافر في عصمتهم وهن النساء اللاء لم يخرجن مع أزواجهن لكفرهن فلما نزلت هذه الآية طلق المسلمون من كان لهم من أزواج بمكة ، فطلق عمرُ امرأتين له بقيتا بمكة مشركتين ، وهما : قُرَيبة بنت أبي أمية ، وأمّ كلثوم بنت عمرو الخزاعية .والمراد بالكوافر : المشركات . وهنّ موضوع هذه التشريعات لأنها في حالة واقعة فلا تشمل الآية النهي عن بقاء المرأة المسلمة في عصمة زوج مشرك وإنما يُؤخذ حكم ذلك بالقياس .قال ابن عطية : رأيت لأبي علي الفارسي إنه قال : سمعت الفقيه أبا الحسن الكرخي يقول في تفسير قوله تعالى : { ولا تمسكوا بعصم الكوافر } أنه في الرجال والنسوان ، فقلت له : النحويون لا يرونه إلا في النساء لأن كوافر جمع كافرة ، فقال : وآيْش يمنع من هذا ، أليس الناس يقولون : طائفَة كافرة ، وفرقة كافرة ، فبُهتُّ وقلتُ : هذا تأييد اه .وجواب أبي الحسن الكرخي غير مستقيم لأنه يمنع منه ضمير الذكور في قوله : { ولا تمسكوا } فهم الرجال المؤمنون والكوافر نساؤهم . ومن العجيب قول أبي علي : فبهتُ وقلتُ . . . الخ . وقرأ الجمهور { ولا تمسكوا } بضم التاء وسكون الميم وكسر السين مخففة . وقرأ أبو عمرو بضم التاء وفتح الميم وتشديد السين مكسورة مُضارع مَسك بمعنى أمسك .{ الكوافر وَاسْھَلُواْ مَآ أَنفَقْتُمْ وَلْيَسْھَلُواْ مَآ } .عطف على قوله : { وآتوهم ما أنفقوا } وهو تتميم لحكمه ، أي كما تعطونهم مهور أزواجهم اللاء فررْنَ منهم مسلماتتٍ ، فكذلك إذا فرت إليهم امرأةُ مسلم كافرة ولا قدرة لكم على إرجاعها إليكم تسألون المشركين إرجاعَ مهرها إلى زوجها المسلممِ الذي فرّت منه وهذا إنصاف بين الفريقين ، والأمرُ للإِباحة .وقوله : { وليسألوا ما أنفقوا } تكملة لقوله : { واسألوا ما أنفقتم } لإِفادة أن معنى واو العطف هنا على المعية بالقرينة لأن قوله : { وليسألوا ما أنفقوا } لو أريد حكمهُ بمفرده لكان مغنياً عنه قوله : { وآتوهم ما أنفقوا } ، فلما كُرر عَقب قوله : { واسألوا ما أنفقتم } علمنا أن المراد جمع مضمون الجملتين ، أي إذا أعطوا ما عليهم أعطوهم ما عليكم وإلا فلا . فالواو مفيدة معنى المعية هنا بالقرينة . وينبغي أن يحمل عليه ما قاله بعض الحنفية من أن معنى واو العطف المعية . قال إمام الحرمين في البرهان في معاني الواو : «اشتهر من مذهب الشافعي أنها للترتيب وعند بعض الحنفية أنها للمعية . وقد زَل الفريقان» اه . وقد أشار إليه في «مغني اللبيب» ولم يرده . وقال المازري في «شرح البرهان» : «وأما قولهم : لا تأكل السمك وتشرب اللبن» ، فإن المراد النهي عن تناول السمك وتناول اللبن فيكون الإِعراب مختلفاً فإذا قال : وتشربَ اللبن بفتح الباء كان نهياً عن الجمع ويكون الانتصاب بمعنى تقدير حرف ( أَنْ ) اه . وهو يرمي إلى أن هذا المحمل يحتاج إلى قرينة .فأفاد قوله : { وليسألوا ما أنفقوا } أنهم إن أبوا من دفع مهور نساء المسلمين يفرّون إليهم كان ذلك مخوِّلاً للمؤمنين أن لا يعطوهم مهور من فرّوا من أزواجهم إلى المسلمين ، كما يقال في الفقه : خيرتهُ تنفي ضررَه .{ أَنفَقُواْ ذَلِكُمْ حُكْمُ الله يَحْكُمُ بَيْنَكُمْ والله عَلِيمٌ } .أي هذا حكم الله ، وهو عدل بين الفريقين إذ ليس لأحد أن يأخذ بأحد جانبيه ويترك الآخر . قال الزُهري : لولا العهد لأمسك النساء ولم يُردّ إلى أزواجهم صداق . وجملة { يحكم بينكم } يجوز كونها حالاً من اسم الجلالة أو حالاً من { حكم الله } مع تقدير ضمير يربط الجملة بصاحب الحال تقديره : يحكمه بينكم ، وأن تكون استئنافاً .وقوله : { والله عليم حكيم } تذييل يشير إلى أن هذا حكم يقتضيه علم الله بحاجات عباده وتقتضيه حكمته إذ أعطى كل ذي حق حقّه .وقد كانت هذه الأحكام التي في هذه الآيات من الترادّ في المهور شرعاً في أحوال مخصوصة اقتضاها اختلاط الأمر بين أهل الشرك والمؤمنين وما كان من عهد المهادنة بين المسلمين والمشركين في أوائل أمر الإِسلام خاصّاً بذلك الزمان بإجماع أهل العلم ، قاله ابن العربي والقرطبي وأبو بكر الجصاص .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe! When believing women) who truly believe in Allah (come unto you as fugitives) from Mecca to Medina or al-Hudaybiyyah, (examine them) ask them and let them swear as to their intentions from their coming. (Allah is best aware of their faith) Allah is best aware of their hearts' firmness in faith. (Then, if ye know them for true believers) through examination, (send them not back unto the disbelievers) do not send them back to their disbelieving husbands. (They are not) i.e. the believing women, (lawful for the disbelievers) for their disbelieving husbands, (nor are the disbelievers lawful for them) for the believing women. Allah says: a believing woman is not lawful for a disbelieving man nor is a disbelieving woman lawful for a believing man. (And give the disbelievers that which they have spent (upon them)) give their husbands that which they have spent on them as dower. This was revealed about Subay'ah Bint al-Harth al- Aslamiyyah who came to the Prophet (pbuh) in the year of al-Hudaybiyyah, to declare her Islam but her husband Musaflr came after her to take her back. The Prophet, Allah bless him and give peace, gave him back the dowry which her husband had given her. In that particular year, and before the revelation of this verse, the people of Mecca had signed a treaty with the Prophet (pbuh) which stipulated that whoever from the people of Mecca embraces Islam can join the Muslims, and whoever of the Muslims embraces the religion of the Meccan pagans is returned to the Muslims; and any woman from the people of Mecca who embraces Islam, the Muslims should pay back the dowry given to her to her husband, and any Muslim woman who joins the religion of the Meccan pagans, the people of Mecca should pay back her dowry to her husband. This is why the Prophet (pbuh) paid back to Musafir the dowry which he had given to Subay'ah. (And it is no sin for you) believers (to marry such women) those who were disbelievers and then embraced Islam (when ye have given them their dues) when you have given them their dowry. Allah says here: any woman who embraces Islam while her husband remains a disbeliever, the sacred bond that ties her to her husband becomes broken and, therefore, she does not have to observe a waiting period and can marry after making sure she is not pregnant. (And hold not to the ties of disbelieving women) He says: any woman who disbelieves in Allah has broken the sacred bond that ties her to her husband; and therefore he should not consider her his wife; (and ask for (the return of) that which ye have spent) He says: ask the people of Mecca to give back what you have spent on them, if your wives join their religion; (and let the disbelievers ask for that which they have spent) on their wives when the latter embrace Islam. And this exactly what they had agreed with the Prophet (pbuh). (That is the judgement of Allah) that is the obligation of Allah. (He judgeth between you) and the people of Mecca. (Allah is Knower) of what is best for you, (Wise) in that which He judged between you. This verse is abrogated by unanimous consensus of Muslims.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ إِذَا جَآءَكُمُ ٱلْمُؤْمِنَاتُ مُهَاجِرَاتٍ فَٱمْتَحِنُوهُنَّ } معناه اختَبِرُوهنَّ وجَرِّبُوهنَّ\n\n\n\n\nوقوله تعالى: { وَآتُوهُم مَّآ أَنفَقُواْ } معناه أَعطُوهم مهورَ النِّساءِ اللاّتي يَخرجنَ إليكم مِنهُم مُسلماتٍ\n\n\n\n\nوقوله تعالى: { وَلاَ تُمْسِكُواْ بِعِصَمِ ٱلْكَوَافِرِ } معناهُ بحَبلِهنَّ وسُنتِهنَّ\n\n",
      "translations": [
        {
          "translation": "\n\n{O you who have believed} when the believing women come to you as immigrants, {examine them} - that is, test and try them.\n\n\nAnd His saying, {And give them what they have spent}, means that you should give them the dowries of the women who come to you as Muslims.\n\nAnd his saying - {And do not take the disbelievers as allies instead of the believers. Do you not wish that Allah should forgive you for your sins?} - its meaning with their link and their custom.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ إِذَا جَآءَكُمُ ٱلْمُؤْمِنَاتُ } المذعنات للإيمان حال كونهن { مُهَاجِرَاتٍ } من قِبَل الكفار { فَٱمْتَحِنُوهُنَّ } واختبروهن\n وانظروا إليهن بنور الله المقتبس من مشكاة الإيمان متفرسين هل تجدوهن مواطئة قلوبهم بألسنتهن\n مع أنه { ٱللَّهُ } المطلع على ما في قلوبهن { أَعْلَمُ بِإِيمَانِهِنَّ } وبعدما تفرستم في شأنهن { فَإِنْ عَلِمْتُمُوهُنَّ } وظننتموهن { مُؤْمِنَاتٍ فَلاَ تَرْجِعُوهُنَّ } ولا تردوهن { إِلَى ٱلْكُفَّارِ } حتى لا يصرن مرتدات\n وبالجملة: بعد ظهور الإيمان منهن { لاَ هُنَّ حِلٌّ لَّهُمْ } أي: للأزواج الكفار { وَلاَ هُمْ } اي: الأزواج { يَحِلُّونَ لَهُنَّ } لاختلافهما في الدين\n\n\n{ وَ } بعدما حفظتموهن وحكمتموهن بالإيمان\n إن جاء أزواجهن في طلبهن { آتُوهُم مَّآ أَنفَقُواْ } أي: مهورهن { وَ } بعدمى أتيتم وأعطيتم مهورهن لأزواجهن { لاَ جُنَاحَ } أي: لا ضيق ولا حرج { عَلَيْكُمْ } أيها المؤمنون { أَن تَنكِحُوهُنَّ إِذَآ آتَيْتُمُوهُنَّ أُجُورَهُنَّ } مهورهن مرة أخرى مثل مهور سائر المؤمنات\n ولا تحسبوا عليهن ما أعطيتم لأزواجهن من المهور\n\n\n{ وَ } بعدما ثبت أنه لا رخصة لكم في دينكم أن تردوا المؤمنات المهاجرات إلى الكفار { لاَ تُمْسِكُواْ } أي: لا تبقوا أيضاً أزواجكم أيها المؤمنون { بِعِصَمِ ٱلْكَوَافِرِ } أي: لا تقيموا بعقود أزواجكم الكافرات الملحقات إلى الكفار\n بل خلوا سبيلهن { وَاسْأَلُواْ } منهن { مَآ أَنفَقْتُمْ } لهن من المهور بعدما لحن بالكفار { وَلْيَسْأَلُواْ } أي: الكفار أيضاً منكم { مَآ أَنفَقُواْ } من المهور لأزواجهم المؤمنات المهاجرات\n الملحقات بكم { ذَلِكُمْ } أي: جميع ما ذكر في الآية { حُكْمُ ٱللَّهِ } المدبر لمصالحكم { يَحْكُمُ } به { بَيْنَكُمْ وَٱللَّهُ عَلِيمٌ حَكِيمٌ } [الممتحنة: 10] يحكم بما يقتضيه علمه وحكمته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إذا جاءكم المؤمناتُ } إنما حُذفت تاء التأنيث للفصل بالمفعول\n ورُدّ بأنّ الحذف مع الفصل بغير \" إلاّ \" مرجوح\n والصواب: أنه على حذف الموصوف\n أي: النساء المؤمنات\n وهو اسم جمع\n يجوز في الأمران\n كقوله تعالى:\n[يوسف:30]\n يقول الحق جلّ جلاله: { يا أيها الذين آمنوا إذا جاءكم المؤمناتُ } أي: مُشْرِفات على الإيمان ونَطَقْن بالشهادة\n وإنما ظهر بعد الامتحان\n { مُهاجراتٍ } من بين الكفار\n { فامْتَحِنُوهن } فاختبروهن بما يغلب على ظنكم موافقة قلوبهن للسانهن\n كان صلى الله عليه وسلم يستحلفهن: ما خرجن من بُغض زوْج\n ولا رغبة من أرض إلى أرض\n ولا التماسَ دُنيا\n ولا عشقًا لرجل منا بل حبًّا لله ورسوله\n وقد كان صلى الله عليه وسلم صالح أهلَ مكة على أنَّ مَنْ أسلم منهم يَرُده إليهم\n فجاءت \" سُبيْعَةُ بنت الحارث \" مُسْلِمةً بعد الفراغ من الكتاب\n فقال زوجها: اردد عليّ امرأتي\n فنزلت\n فاستحلفها صلى الله عليه وسلم بما تقدّم\n فحلفت\n فلم يردها عليه\n وأعطى مهرها زوجَها\n فتزوجها عمرُ\n فكان صلى الله عليه وسلم يَرُد مَن جاء من الرجال\n ولا يَرُد النساء\n وعن ابن عباس: امتحانها: أن تقول: أشهد أن لا إله إلا الله\n وأنّ محمدًا رسول الله\n { اللهُ أعلم بإِيمانهن } \n لأنه المُطّلع على قلوبهن\n وفيه إشارة إلى التخفيف في الامتحان\n وأنه ليس المطلوب غايته لتصلوا إلى العلم\n بل ما يحصل به الظن القوي\n وأما العلم فخاص بالله تعالى\n { فإِن عَلِمْتُموهن مؤمناتٍ } \n العلم الذي تبلغه طاقتكم\n وهو الظن القوي\n بظهور الأمارات\n وتسمية الظن علمًا يُؤذن بأنَّ الظن الغالب\n وما يفضي إليه القياس\n جارٍ مجرى العلم\n وصاحبه غير داخل في قوله:\n[الإسراء:36]\n قاله النسفي\n { فلا تَرْجِعُوهنَّ إِلى الكفار } أي: إلى أزواجهن الكفرة\n { لا هُنَّ حِلٌّ لهم ولا هم يَحِلُّونَ لهن } \n تعليل للنهي أي: حيث خرجت مسلمة حَرُمت على المشرك\n والتكرير إما لتأكيد الحرمة\n أو الأول: لبيان زوال النكاح الأول\n والثاني: لبيان امتناع النكاح الجديد\n ما دام مشركاً\n فإنْ أسلم في عِدتها كان أولى بها\n { وآتوهم ما أنفقوا } أي: أعطوا أزواجَهن مثلَ ما دفعوا من المهور\n { ولا جُناحَ عليكم أن تَنكحوهن } \n فإنَّ إسلامهن حالَ بينهن وبين أزواجهن الكفار\n { إِذا آتيتموهن أُجورهنَّ } مهورهن لأنّ المهر أجر البُضْع\n وبه احتجّ أبو حنيفة على ألاّ عِدَّة على المهاجِرة\n قال الكواشي: أباح تعالى نكاحهن وإن كان لهن أزواج في دار الحرب لأنَّ الإسلام فرّق بينهن وبين أزواجهن بعد انقضاء العدة\n فإن أسلم الزوج قبل انقضاء العدة فهي امرأته عند مالك والشافعي وأحمد\n خلافًاً لأبي حنيفة في غير الحامل\n هـ\n { ولا تُمسكوا بِعِصَم الكوافرِ } \n العصمة: ما يعتصم به من عقدٍ وسبب\n\nوالكوافر: جمع كافرة\n وهي التي بقيت في دار الحرب أو: لحقت بدار الحرب مرتدةً\n أي: لا يكن بينكم وبين النساء الكوافر عصمة ولا عُلقة زوجية\n قال ابن عباس رضي الله عنه: مَن كانت له امراة كافرة بمكة فلا يعتَدنَّ بها من نسائه لأنَّ اختلاف الدارين قطع عصمتها منه\n ولمّا نزلت الآية طلَّق عمرُ رضي الله عنه امرأتين كانتا له بمكة\n قُرَيْبَة بنت أبي أمية\n وأم كلثوم الخزاعية\n { واسألوا ما أنفقتم } من مهور أزواجكم اللاحقات بالكفار\n أي: اطلبوه من الكفرة\n { وَلْيَسْألوا ما أنفقوا } من مهور نسائهم المهاجرات ممن تزوجها منا\n { ذالكم حُكْمُ الله } أي: جميع ما ذكر في هذا الآية\n وقوله: { يحكم بينكم }: كلام مستأنف أو: حال من \" حُكم الله \" على حذف الضمير\n أي: يحكمه الله\n وجعل الحُكْم حاكماً على المبالغة وقال: \" يحكم \" مستقبلاً\n مع أن الحكم ماضٍ باعتبار ظهور متعلقة { واللهُ عليم حكيمٌ } يشرع ما تقتضيه الحكمة البالغة\n رُوي أنه لمّا نزلت الآية أدّى المؤمنون ما أُمروا به من مهور المهاجرات إلى أزواجهن من المشركين\n وأبى المشركون أن يردُّوا شيئًا من مهور الكوافر إلى أزواجهن المسلمين\n فنزل قوله تعالى: { وإن فاتكم } أي: سبقكم وانفلت منكم { شيءٌ من أزواجكم إِلى الكفار } أي: أحَدٌ من أزواجكم\n وقرىء به\n وإيقاع \" شيء \" موقعه للتحقير والتعميم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "49:3",
      "similarity": 0.5581554461786126
    },
    {
      "verse": "2:230",
      "similarity": 0.2252530174605645
    },
    {
      "verse": "5:67",
      "similarity": 0.19688931176162444
    },
    {
      "verse": "4:146",
      "similarity": 0.19210213328021714
    },
    {
      "verse": "3:101",
      "similarity": 0.18283679780423392
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/060010.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/060010.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/60:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}