{
  "chapter": "الممتحنة",
  "text": "وان فاتكم شىء من ازوجكم الى الكفار فعاقبتم فـاتوا۟ الذين ذهبت ازوجهم مثل ما انفقوا۟ واتقوا۟ الله الذى انتم به مؤمنون",
  "translations": [
    {
      "translation": "If any of your wives rejoin the kuffar, you should have compensation. So repay to those whose wives have gone the dowry they paid out. Have taqwa of Allah - Him in Whom you have iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of your women go away to the unbelievers, and you succeed in your turn (and have a chance of getting spoils), then give to those whose wives have so gone away as much as they had spent on them; but take heed and fear God in whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you fail to receive from the unbelievers a part of the bridal-due of your disbelieving wives, and then your turn comes, pay to those who have been left on the other side an amount the like of the bridal-due that they have paid. And have fear of Allah in Whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If your wives go away from you to disbelievers who will not give you back the dowry which you spent on them, let the Muslims pay back such dowry from the property of the disbelievers which may come into their hands. Have fear of God in whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if some women go away from the Muslims to the disbelievers – then when you punish the disbelievers, give from the war booty to the Muslims who lost their wives the amount they had spent; and fear Allah in Whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any of your wives have gone from you to the disbelievers then you succeed over them (gain victory); then pay those whose wives have gone, the equivalent of what they had spent. And have Taqwa of Allah, the One in Whom you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if anything (out of the dowries) of your wives has passed away from you to the unbelievers, then your turn comes, give to those whose wives have gone away the like of what they have spent, and be careful of (your duty to) Allah in Whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any of your wives slips away from you to the unbelievers, and then you retaliate, give those whose wives have gone away the like of what they have expended. And fear God, in whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any of your wives have gone from you unto the disbelievers and afterward ye have your turn (of triumph), then give unto those whose wives have gone the like of that which they have spent, and keep your duty to Allah in Whom ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of your wives desert you to go over to the disbelievers, and you subsequently have your turn, [by the coming over of a woman from the other side] give to those  who have been deserted by their wives the equivalent of the dowers they gave them. Fear God in whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any of your wives hath been left with the infidels, and then ye have retaliated, then give Unto those whose wives have gone away the like of that which they have expended, and fear Allah in whom ye are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If anything [of the dowries] pertaining to your wives is not reclaimed from the faithless and then you have your turn, then give to those whose wives have left the like of what they have spent, and be wary of Allah in whom you have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any of your wives deserts you to the Unbelievers, and ye have an accession (by the coming over of a woman from the other side), then pay to those whose wives have deserted the equivalent of what they had spent (on their dower). And fear Allah, in Whom ye believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if any of your wives have gone from you to the disbelievers, and you have an accession (by the coming over of a woman from the other side), then pay to those whose wives have gone, the equivalent of what they had spent (on their Mahr). And fear Allah in Whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of your wives desert you to be with the unbelievers and you retaliate, give those whose wives who have deserted the equivalent of what they have spent. And fear Allah in whom you believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If any of your wives desert you to the unbelievers, and you decide to penalize them, give those whose wives have gone away the equivalent of what they had spent. And fear God, in whom you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you have lost any of your wives to the disbelievers and you subsequently obtain [something], then give those whose wives have gone the equivalent of what they had spent. And fear Allah, in whom you are believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[60:11] And if you lose any of your wives, that is to say, [if you lose] one or more of them — or [it means if you lose] anything of their dowries — by [their] going, to the disbelievers, as apostates, and so you retaliate, you embark upon a raid and capture spoils [from them], then give those whose wives have gone, from the spoils, the like of what they have expended, for their having lost it to the disbelievers. And fear God in Whom you believe. And indeed the believers did what they had been commanded to do in the way of paying [back] the disbelievers [the dowries of their former wives] and the believers [the dowries of the women who had apostatised]. Afterwards, however, this stipulation was annulled.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if any of your wives have gone from you unto the disbelievers) with whom you do not have any treaty or pledge (and afterward ye have your turn (of triumph)) and afterward you obtain booty from the enemy, (then give unto those whose wives have gone) to the disbelievers (the like of that which they have spent) of dowry on their wives; this should be given before the fifth of the booty is taken out from it, (and keep your duty to Allah) fear Allah regarding that which He commands you (in whom ye are believers) true believers. There were just six women who left Islam and joined the disbelievers of Mecca, two of them were wives of 'Umar Ibn al-Khattab, Umm Salamah and Umm Kulthum Bint Jarul, and also Umm al-Hakam the daughter of Abu Sufyan who was the wife of 'Abbad Ibn Shaddad al-Fihri, and Fatimah Bint Abi Umayyah Ibn al- Mughirah and Buru' Bint 'Uqbah who was the wife of Shammas Ibn 'Uthman from the Banu Makhzum, and 'Abdah Bint 'Abd al-'Uzza Ibn Nadlah whose husband was 'Amr Ibn Wudd, and Hind Bint Abu Jahl Ibn Hisham whose husband was Hashim Ibn al-'Ass Ibn Wa'il al-Sahmi. The Prophet (pbuh) gave back to the husbands of these women the dowry they had spend on them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِن فَاتَكُمْ شَيْءٌ مِّنْ أَزْوَاجِكُمْ إِلَى ٱلْكُفَّارِ } معناه أعجزَكُم أحدٌ من الكُفّارِ: معناهُ أن ذَهبتْ امرأةٌ مُسلمةٌ فَلحِقَتْ بالكُفارِ من أهلِ مَكةَ مُرتدةً، وليسَ بينكُم وبينَهُم عَهدٌ، فاعطوا زَوجَها مَهرَها من الغَنيمةِ بَدلَ الخُمسِ\n\n\n\n\nوقوله تعالى: { فَعَاقَبْتُمْ } يعني فأَصبتُم عُقبى مِثلَهُنَّ\n ويقال: فَغنِمتَم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"If any of you should die and leave behind wives,\" means that one of you has died and his wives have gone over to the disbelievers: that is, a Muslim woman has gone and joined the disbelievers of Mecca, and there is no pact between you and them. So give her husband his due from the booty in lieu of the fifth.\n\n\nAnd His saying, \"Then you will be returned,\" means that you will be returned like them.\n\n\nAnd it is said: \"You have been blessed.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِن فَاتَكُمْ } أيها المؤمنون { شَيْءٌ مِّنْ } مهور { أَزْوَاجِكُمْ } بعدما لحقن { إِلَى ٱلْكُفَّارِ } ولم يؤدوا جميع مهورهن إليكم { فَعَاقَبْتُمْ } بعد ذلك\n وغلبتم على الكفار المتمردين على أداء مهوركم\n وأخذتم الغنائم منهم { فَآتُواْ } وأعطوا أيها المؤمنون قبل القسمة { ٱلَّذِينَ ذَهَبَتْ أَزْوَاجُهُمْ } إلى الكفار { مِّثْلَ مَآ أَنفَقُواْ } في مهور أزواجهم الكفارات الملحقات { وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيۤ أَنتُمْ بِهِ مُؤْمِنُونَ } [الممتحنة: 11] ولا تضيعوا حق أخيكم المؤمن",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n رُوي أنه لمّا نزلت الآية أدّى المؤمنون ما أُمروا به من مهور المهاجرات إلى أزواجهن من المشركين، وأبى المشركون أن يردُّوا شيئًا من مهور الكوافر إلى أزواجهن المسلمين، فنزل قوله تعالى: { وإن فاتكم } أي: سبقكم وانفلت منكم { شيءٌ من أزواجكم إِلى الكفار } أي: أحَدٌ من أزواجكم، وقرىء به\n وإيقاع \" شيء \" موقعه للتحقير والتعميم، { فعاقبتم } ، من المعاقبة، لا من العقوبة، أي: صرتم منهم إلى الحال التي صاروا إليها منكم، وذلك بأن يفوت إليكم شيء من أزواجهم، شبّه ما حكم به على المسلمين والكافرين من أداء هؤلاء مهور نساء أولئك تارة، وأداء هؤلاء مهور نساء هؤلاء أخرى، بأمر يتعاقبون فيه كما يتعاقب في الركوب وغيره\n { فآتوا الذين ذهبتْ أزواجُهم } منكم إلى الكفار { مثلَ ما أنفقوا } ، تُعطوه من مهر المهاجرة التي تزوجتموها، ولا تؤتوا زوجها الكافر شيئًا، أي: ما كنتم تُعطونه للكفار من مهور أزواجهم المهاجرات أعطوه لمَن فاتت زوجته ولحقت بالكفار، فأزال الله دفعها إليهم، حين لم يرضوا بحُكمه، على أنّ هذا حكم قد نُسخ\n قال ابن عطية: وهذه الآية كلها قد ارتفع حكمها\n هـ\n وذكر الكواشي الخلاف في النسخ وعدمه، وأنَّ رد المال مستمر، وذكر الخلاف في أنَّ الإنفاق كان على الوجوب أو الندب\n هـ\n وقيل: معنى \" فعاقبتم \" من العقوبة، أي: فأصبتموهم في القتال، حتى غنمتم، فأعطوا المسلمين الذين ارتدت زوجاتهم، ولحقْن بدار الحرب مهورَ زوجاتهم من هذه الغنيمة\n قال ابن عباس: خمس نسوة رجعن عن الإسلام، ولحقن بالمشركين، من نساء المهاجرين: أم الحكم بنت أبي سفيان، وكانت عند عياض بن شداد، وفاطمة بنت أبي أمية، أخت أم سلمة، وكانت تحت عمر بن الخطاب، وعزةُ بنت عبد العزى، كانت تحت هشام بن العاص، وأم كلثوم بنت جرول، كانت تحت عمر أيضًا، فأعطاهم النبي صلى الله عليه وسلم مهور نسائهم من الغنيمة\n\n\nهـ\n { واتقوا اللهَ الذي أنتم به مؤمنون } أي: احذروا أن تتعدُّوا ما أُمرتم به فإن الإيمان يقتضي فعل ما أمر به صاحبه\n الإشارة: يا أيها الذين آمنوا إيمان الخصوص، وهم المشايخ العارفون إذا جاءكم النفوس المؤمنه بطريقكم، وأرادوا الانخراط في سلككم، فامتحنونهن هل هي صادقة الطلب، أو تريد حرفًا من حروف الهوى، فإن علمتم صدقهن، فلا تردجعوهن إلى أهل الغفلة، سيما أهل الإنكار إذ لا يحل مخالطتهم في طريق الخصوص، وآتوهم من العلوم والمعارف عِوض ما أنفقوا من أنفسهم وأموالهم، ولاجناح عليكم أن تعقدوا عليهم عقدة الإرادة، التي هي كعقدة النكاح إذا آتيتموهن أجورهن، وهو أن تبذلوا لهم ما عندكم من السر، قدر ما يطيقون، ومن نقض العهد ورجع عن الإرادة فلا تُمسكوا بعصمته، وأطلقوه مع نفسه، فإن سألكم شيئًا مما كان بذل فسلوه عوض ما بذلتم له من العلم، وإن رجع أحد منكم إلى أهل الإنكار، ثم جاء أحد منهم إليكم فآتوه من العلم ما آتيتم مَن فرّ منكم، واتقوا الله الذي توجهتم إليه، فلا تُعطوا السر مَن لا يستحقه، ولا تمنعوه من مستحقه\n والله تعالى أعلم بأسرار كتابه\n ثم ذكر بيعمة النساء، فقال: { يٰأَيُّهَا ٱلنَّبِيُّ إِذَا جَآءَكَ ٱلْمُؤْمِنَاتُ يُبَايِعْنَكَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:51",
      "similarity": 0.5931651320886303
    },
    {
      "verse": "67:3",
      "similarity": 0.4242383205730253
    },
    {
      "verse": "57:23",
      "similarity": 0.38103146580557506
    },
    {
      "verse": "3:153",
      "similarity": 0.3575148689793939
    },
    {
      "verse": "9:77",
      "similarity": 0.16626961279017846
    }
  ]
}