{
  "chapter": "الممتحنة",
  "text": "ان يثقفوكم يكونوا۟ لكم اعداء ويبسطوا۟ اليكم ايديهم والسنتهم بالسوء وودوا۟ لو تكفرون",
  "translations": [
    {
      "translation": "If they come upon you, they will be your enemies and stretch out their hands and tongues against you with evil intent, and they would dearly love you to become kafir.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they gain ascendancy over you, they will become your enemies, and employ their hands and tongues with evil designs, and wish that you also became disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they could overcome you, they would act as your foes and would hurt you by their hands and tongues, and would love to see you become unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they find an opportunity to turn against you, they will become your enemies and will stretch out their hands and tongues at you with evil intent. They would love to see you turn away from your faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they gain dominance over you they will be your enemies, and will extend their hands and their tongues towards you with evil, and they wish that in some way you turn disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should they gain the upper hand over you, they would behave to you as enemies, and stretch forth their hands and their tongues against you with evil, and they desire that you should disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they find you, they will be your enemies, and will stretch forth towards you their hands and their tongues with evil, and they ardently desire that you may disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they come on you, they will be enemies to you, and stretch against you their hands and their tongues, to do you evil, and they wish that you may disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they have the upper hand of you, they will be your foes, and will stretch out their hands and their tongues toward you with evil (intent), and they long for you to disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they gain ascendancy over you, they will behave towards you as enemies and stretch out their hands as well as their tongues with evil intent; they long for you to renounce your faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should they come upon you, they will be enemies Unto you and will stretch out against you their hands and their tongues with evil; and fain would they that ye should disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they were to confront you they would be your enemies, and would stretch out against you their hands and [unleash] their tongues with evil [intentions], and they are eager that you [too] should be faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they were to get the better of you, they would behave to you as enemies, and stretch forth their hands and their tongues against you for evil: and they desire that ye should reject the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should they gain the upper hand over you, they would behave to you as enemies, and stretch forth their hands and their tongues against you with evil, and they desire that you should disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they come upon you, they will be your enemies, and stretch out their hands and tongues to do evil to you. They wish that you would disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever they encounter you, they treat you as enemies, and they stretch their hands and tongues against you with malice. They wish that you would disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they gain dominance over you, they would be to you as enemies and extend against you their hands and their tongues with evil, and they wish you would disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[60:2] If they were to prevail over you, they would be your enemies, and would stretch out against you their hands, to kill and assault you, and their tongues with evil [intent], with insults and reviling; and they long for you to disbelieve.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If they have the upper hand of you) if the people of Mecca defeat you, (they will be your foes) by killing you, it will be evident for you that they are your enemies, (and will stretch out their hands) to beat you (and their tongues towards you with evil (intent)) with abuse and slander, (and they) the disbelievers of Mecca (long for you to disbelieve) in Allah after you have accepted faith in Muhammad (pbuh) and in the Qur'an and migrated to Allah's Messenger (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nقوله تعالى: { إِن يَثْقَفُوكُمْ } معناه يَلقُوكُم\n\n",
      "translations": [
        {
          "translation": "\n\nThe meaning of the verse is that if they catch you, they will kill you.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وهم بمكان من العداوة وشدة الخصومة إلى حيث { إِن يَثْقَفُوكُمْ } ويظفروا منكم بالفرض والتقدير { يَكُونُواْ لَكُمْ أَعْدَآءً } ألبتة\n بل يظهروا العداوة { وَيَبْسُطُوۤاْ إِلَيْكُمْ أَيْدِيَهُمْ وَأَلْسِنَتَهُمْ بِٱلسُّوۤءِ } بالقتل والأسر وقطع العضو\n والشتم المفرط\n وأنواع الوقاحة\n بل { وَوَدُّواْ } وتمنوا في أنفسهم دائماً { لَوْ تَكْفُرُونَ } [الممتحنة: 2] وترتدون عن دينكم\n وتلتحقون بكفرهم\n\n\nفعليكم ألاَّ تبالوا بأقاربكم وأرحامكم من الكفرة\n ولا تلتفتوا نحوهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِن يَثْقفوكم } أي: يظفروا بكم { يكونوا لكم أعداءً } أي: يُظهروا ما في قلوبهم من العداوة\n ويُرتبوا عليها أحكامها\n { ويبسُطُوا إِليكم أيديَهم وألسنتهم بالسوء } بما يسوؤكم من القتل والأسر\n { ووَدُّوا لو تكفرون } أي: تمنُّوا ارتدادكم\n وصيغة الماضي لتحقُّق ودادهم قبل أن يثقفوكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:61",
      "similarity": 0.5697036313042695
    },
    {
      "verse": "2:191",
      "similarity": 0.5423302966677956
    },
    {
      "verse": "3:112",
      "similarity": 0.370406919997428
    },
    {
      "verse": "5:28",
      "similarity": 0.2771890532216501
    },
    {
      "verse": "4:91",
      "similarity": 0.26489529338714685
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/60:2.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/60:2.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/60:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}