{
  "chapter": "الممتحنة",
  "text": "لن تنفعكم ارحامكم ولا اولدكم يوم القيمة يفصل بينكم والله بما تعملون بصير",
  "translations": [
    {
      "translation": "Neither your blood relations nor your children will be of any use to you. On the Day of Rising He will differentiate between you. Allah sees what you do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither your blood relations nor your children will be of any avail to you on the Day of Resurrection. He will judge between you, for God sees what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Resurrection neither your blood-kindred nor your own offspring will avail you. (On that Day) He will separate you. Allah sees all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your relatives and children will never be of any benefit to you on the Day of Judgment. God will separate you from them. He is All-aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither your relations nor your offspring will in the least benefit you, on the Day of Resurrection; He will separate you from them; and Allah is seeing your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither your relatives nor your children will benefit you on the Day of Resurrection. He will judge between you. And Allah is the All-Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your relationship would not profit you, nor your children on the day of resurrection; He will decide between you; and Allah sees what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither your blood-kindred nor your children shall profit you upon the Day of Resurrection; He shall distinguish between you. And God sees the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your ties of kindred and your children will avail you naught upon the Day of Resurrection. He will part you. Allah is Seer of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither your relatives nor your children will be of any help to you on the Day of Resurrection. He will judge between you, and God sees all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will profit you neither your kindred nor your children on the Day of Resurrection. He shall decide between; and Allah is of that which ye you work Beholder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your relatives and children will not avail you on the Day of Resurrection: He will separate you [from one another], and Allah watches what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of no profit to you will be your relatives and your children on the Day of Judgment: He will judge between you: for Allah sees well all that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither your relatives nor your children will benefit you on the Day of Resurrection (against Allah). He will judge between you. And Allah is the All-Seer of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Resurrection neither your blood relatives nor your children shall be of benefit to you. Allah will differentiate between you, and Allah sees thethings you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Neither your relatives nor your children will benefit you on the Day of Resurrection. He will separate between you. God is Observant of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never will your relatives or your children benefit you; the Day of Resurrection He will judge between you. And Allah, of what you do, is Seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[60:3] Your relatives and your children, the idolatrous [ones], for whose sake you secretly communicated the news, will not avail you, against the chastisement in the Hereafter. On the Day of Resurrection you will be separated (passive yufsalu; or read active yafsilu, ‘He will separate you’) from them, so that you will be in Paradise, while they will be alongside the disbelievers in the Fire. And God is Seer of what you do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Your ties of kindred) in Mecca, if you were to disbelieve, (and your children will avail you naught upon the Day of Resurrection) against Allah's chastisement. (He will part you) He will separate you from the believers on the Day of Judgement; and it is also said this means: He will judge between you on this. (Allah is Seer of what ye do) of good and evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nثم أشار إلى أن العرضية لا يجوز أن يختارها أهل التحقيق لأن السبب الموجب لها أمور فانية لا يبقى نفعها إلا في الدنيا والعاقل يجب أن يختار الأمور الباقية دون الفانية بقوله: { لن تنفعكم أرحامكم ولا أولادكم } أي: لا نفع لمن اخترتم موالاة العدوّ الحقيقي لأجله لأن القيامة الصغرى مفرّقة بينكم تفريقاً أبدياً لعدم الاتصال الحقيقي الباقي بعد الموت بينكم\n وهذا معنى قوله: { يوم القيامة يفصل بينكم } أي: يفصل الله بينكم وبين أرحامكم وأولادكم\n كما قال:\n[عبس\n الآيات:34 - 36]",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { لَن تَنفَعَكُمْ أَرْحَامُكُمْ } قراباتكم { وَلاَ أَوْلاَدُكُمْ } الذين أنتم توالون المشركين لأجلهم { يَوْمَ ٱلْقِيَامَةِ } المعدة\n لتنقيد الأعمال الصادرة عن كل نفس\n إذ الله { يَفْصِلُ } ويفرق { بَيْنَكُمْ } يومئذٍ\n فيجازي كلاً منكم حسب ما كسبوا خيراً كان أو شراً { وَٱللَّهُ } المطل على عموم أفعال عباده { بِمَا تَعْمَلُونَ } من الحسنات والسيئات { بَصِيرٌ } [الممتحنة: 3] يجازيكم عليه بمقتضى بصارته وخبرته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لن تنفَعَكُم أرحامُكُم } قراباتكم { ولا أولادُكم } الذين تُوالون المشركين لأجلهم\n وتتقرّبون إليهم محاماةً عليهم\n { يومَ القِيامة يَفْصِلُ بينكم } وبين أقاربكم وأولادكم\n بما اعتراكم من أهوال ذلك اليوم\n حسبما نطق به قوله تعالى:\n[عبس:34-36] الآيات\n ويحتمل أن يكون ظرفًا لـ \" تنفعكم \" \n أي: لا تنفعكم أقاربكم يوم القيامة\n ثم استأنف بقوله: { يفصل بينكم } لبيان عدم نفعهم\n وهنا قراءات بيّنّاها في غير هذا\n { والله بما تعملون بصير } فيجازيكم على أعمالكم\n الإشارة: أعدى الأعادي إليك نفسك\n فهي عدوة لله ولرسوله ولأوليائه لأنها أمّارة بالسوء\n ويُضاف إليها جنودها\n فيقال { يا ايها الذين آمنوا لا تتخذوا عدوي وعدوكم أولياء } \n من النفس وجنودها\n تُلقون إليهم بالمودّة والموافقة\n وقد كفروا بما جاءكم من الحق من طريق المجاهدة\n يُخرجون الرسول: الوارد الحقيقي أو الإيمان العياني\n من قلوبكم\n ويُخرجونكم من الحضرة كراهةَ أن تُؤمنوا بالله ربكم إيماناً حقيقيًّا\n إن كنتم خرجتم عن هواكم جهادًا في سبيلي\n وابتغاء مرضاتي ومعرفتي\n تُسِرُّون إليه بالمودة والموافقة\n وأنا أعلم بما أخفيتم من الميل إلى حظوظها\n وما أعلنتم\n ومَن يفعله ـ أي: الميل عن طريق المجاهدة ـ فقد ضلّ سواء السبيل طريق الوصول\n فقد قيل: \" مَن رأيته يتبع الرُخص والشهوات\n فاعلم أنه لا يأتي منه شيء \"\n لن تنفعكم أقاربكم ولا حظوظكم\n بدلاً من الله شيئًا \" ماذا وجَدَ من فقدك \" \n فالحظوظ الفانية تفنى وتبقى الحسرة والندامة\n يوم القيامة يفصلُ بينكم وبينها لفنائها\n أو بينكم وبين ما تشتهون من دوام النظرة\n والله بما تعملون بصير\n فيُجازي على قدر الكدّ والتعب\n ثم أمر بالاقتداء بالرسل ـ عليهم السلام ـ في معاداة كل ما يقطع عن الله\n فقال: { قَدْ كَانَتْ لَكُمْ أُسْوَةٌ حَسَنَةٌ فِيۤ إِبْرَاهِيمَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:39",
      "similarity": 0.4693665548946749
    },
    {
      "verse": "32:25",
      "similarity": 0.46630413066175525
    },
    {
      "verse": "77:13",
      "similarity": 0.45413358132372433
    },
    {
      "verse": "7:52",
      "similarity": 0.43145156620083225
    },
    {
      "verse": "37:21",
      "similarity": 0.4300500856405914
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/060003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/060003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/60:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}