{
  "chapter": "الممتحنة",
  "text": "قد كانت لكم اسوة حسنة فى ابرهيم والذين معه اذ قالوا۟ لقومهم انا برءؤا۟ منكم ومما تعبدون من دون الله كفرنا بكم وبدا بيننا وبينكم العدوة والبغضاء ابدا حتى تؤمنوا۟ بالله وحده الا قول ابرهيم لابيه لاستغفرن لك وما املك لك من الله من شىء ربنا عليك توكلنا واليك انبنا واليك المصير",
  "translations": [
    {
      "translation": "You have an excellent example in Ibrahim and those with him, when they said to their people, 'We wash our hands of you and all that you worship apart from Allah, and we reject you. Between us and you there will be enmity and hatred for ever unless and until you have iman in Allah alone.' Except for Ibrahim's words to his father: 'I will ask forgiveness for you but I have no power to help you in any way against Allah.' 'Our Lord, we have put our trust in You. and have made tawba to You. You are our final destination.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have an excellent model in Abraham and those who were with him, when he said to his people: \"We are through with you, and those you worship other than God. We reject you. Enmity and hate have come between you and us for ever, unless you believe in God the One,\" -- except for what he said to his father: \"I shall ask forgiveness for you, but I have no power to prevail with God for you.\" \"O Lord, we place our trust in You, and turn to You in penitence, and to You is our returning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have a good example in Abraham and his companions: they said to their people: “We totally dissociate ourselves from you, and from the deities that you worship instead of Allah. We renounce you and there has come to be enmity and hatred between us and you until you believe in Allah, the One True God.” (But you may not emulate) Abraham's saying to his father: “Certainly I will ask pardon for you, although I have no power over Allah to obtain anything on your behalf.” (And Abraham and his companions prayed): “Our Lord, in You have we put our trust, and to You have we turned, and to You is our ultimate return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham and those with him are the best examples for you to follow. They told the people, \"We have nothing to do with you and with those whom you worship besides God. We have rejected you. Enmity and hatred will separate us forever unless you believe in One God.\" Abraham told his father, \"I shall ask forgiveness for you only, but I shall not be of the least help to you before God\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in Ibrahim, and those along with him, lay a good example for you follow – when they said to their people, “Indeed we are unconcerned with you and all what you worship besides Allah; we reject you, and between us and you has surfaced enmity and hatred for ever until you accept faith in the One Allah” – except the saying of Ibrahim to his father, “I will surely seek forgiveness for you, and I do not possess any power to benefit you against Allah”; “O our Lord! We have relied only upon You, and towards You only we have inclined and only towards You is the return”.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed there has been an excellent example for you in Ibrahim and those with him, when they said to their people: \"Verily, we are free from you and whatever you worship besides Allah, we have rejected you, and there has started between us and you, hostility and hatred forever until you believe in Allah alone,\" -- except the saying of Ibrahim to his father: \"Verily, I will ask forgiveness for you, but I have no power to do anything for you before Allah.\" \"Our Lord! In You we put our trust, and to You we turn in repentance, and to You is the final Return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, there is for you a good example in Ibrahim and those with him when they said to their people: Surely we are clear of you and of what you serve besides Allah; we declare ourselves to be clear of you, and enmity and hatred have appeared between us and you forever until you believe in Allah alone-- but not in what Ibrahim said to his father: I would certainly ask forgiveness for you, and I do not control for you aught from Allah-- Our Lord! on Thee do we rely, and to Thee do we turn, and to Thee is the eventual coming:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have had a good example in Abraham, and those with him, when they said to their people, 'We are quit of you and that you serve, apart from God. We disbelieve in you, and between us and you enmity has shown itself, and hatred for ever, until you believe in God alone. (Except that Abraham said unto his father, 'Certainly I shall ask pardon for thee; but I have no power to do aught for thee against God.') 'Our Lord, in Thee we trust; to Thee we turn; to Thee is the homecoming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a goodly pattern for you in Abraham and those with him, when they told their folk: Lo! we are guiltless of you and all that ye worship beside Allah. We have done with you. And there hath arisen between us and you hostility and hate for ever until ye believe in Allah only - save that which Abraham promised his father (when he said): I will ask forgiveness for thee, though I own nothing for thee from Allah - Our Lord! In Thee we put our trust, and unto Thee we turn repentant, and unto Thee is the journeying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed you have an excellent example in Abraham and those who followed him, when they said to their people, \"We disown you and whatever you worship besides God. We renounce you. Enmity and hatred shall endure between us and you, until you believe in the one God.\" [The exception was] when Abraham said to his father, \"I shall indeed pray for [God\"s] forgiveness for you; although I do not have it in my power to obtain anything from God on your behalf.\" They prayed, \"O our Lord, in You we have placed our trust and to You we turn in repentance and to You is the final return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely there hath been an excellent pattern for you in Ibrahim and those with him, when they said Unto their people; verily we are quit of you and of that which ye worship beside Allah; we renounce you; and surely there hath appeared between us and you hostility and hatred for evermore until ye believe in Allah alone, - except the saying of Ibrahim Unto his father: surely I shall beg forgiveness for thee, and I have no power with Allah for thee at all. Our Lord! in Thee we put our trust, and Unto Thee we turn, and Unto Thee is the journeying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is certainly a good exemplar for you in Abraham and those who were with him, when they said to their own people, ‘Indeed we repudiate you and whatever you worship besides Allah. We disown you, and enmity and hate have appeared between you and us for ever, unless you come to have faith in Allah alone,’ apart from Abraham’s saying to his father, ‘I will surely plead forgiveness for you, though I cannot avail you anything against Allah.’ ‘Our Lord! In You do we put our trust, and to You do we turn penitently, and toward You is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is for you an excellent example (to follow) in Abraham and those with him, when they said to their people: \"We are clear of you and of whatever ye worship besides Allah: we have rejected you, and there has arisen, between us and you, enmity and hatred for ever,- unless ye believe in Allah and Him alone\": But not when Abraham said to his father: \"I will pray for forgiveness for thee, though I have no power (to get) aught on thy behalf from Allah.\" (They prayed): \"Our Lord! in Thee do we trust, and to Thee do we turn in repentance: to Thee is (our) Final Goal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed there has been an excellent example for you in Ibrahim (Abraham) and those with him, when they said to their people: \"Verily, we are free from you and whatever you worship besides Allah, we have rejected you, and there has started between us and you, hostility and hatred for ever, until you believe in Allah Alone,\" except the saying of Ibrahim (Abraham) to his father: \"Verily, I will ask for forgiveness (from Allah) for you, but I have no power to do anything for you before Allah.\" Our Lord! In You (Alone) we put our trust, and to You (Alone) we turn in repentance, and to You (Alone) is (our) final Return,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have a good example in Abraham and those with him. They said to their nation: 'We are quit of you, and that which you worship, other than Allah. We disbelieve you, enmity and hatred has shown itself between us for ever until you believe in Allah alone' Except that Abraham said to his father: 'Surely, I shall supplicate to ask for forgiveness for you although I have no power to do anything for you with Allah' ' Our Lord, in You we have put our trust; to You we turn, and to You is the arrival,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have had an excellent example in Abraham and those with him; when they said to their people, “We are quit of you, and what you worship apart from God. We denounce you. Enmity and hatred has surfaced between us and you, forever, until you believe in God alone.” Except for the words of Abraham to his father, “I will ask forgiveness for you, though I have no power from God to do anything for you.” “Our Lord, in You we trust, and to You we repent, and to You is the ultimate resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has already been for you an excellent pattern in Abraham and those with him, when they said to their people, \"Indeed, we are disassociated from you and from whatever you worship other than Allah. We have denied you, and there has appeared between us and you animosity and hatred forever until you believe in Allah alone\" except for the saying of Abraham to his father, \"I will surely ask forgiveness for you, but I have not [power to do] for you anything against Allah. Our Lord, upon You we have relied, and to You we have returned, and to You is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[60:4] Verily there is for you a good example (read iswa or uswa in both instances, meaning qudwa) in [the person of] Abraham, in terms of [his] sayings and deeds, and those who were with him, of believers, when they said to their people, ‘We are indeed innocent of you (bura’ā’ is the plural of barī’, similar [in form] to zarīf, ‘charming’) and of what you worship besides God. We repudiate you, we disavow you, and between us and you there has arisen enmity and hate forever (wa’l-baghdā’u abadan: pronounce both hamzas fully, or replace the second one with a wāw) until you [come to] believe in God alone’, except for Abraham’s saying to his father, ‘I shall ask forgiveness for you — [this statement is] excepted from ‘a [good] example’, so it is not [right] for you to follow his example in this [respect] by asking forgiveness for disbelievers. As for his saying: but I cannot avail you anything against God’ — that is, either against His chastisement or [to secure for you of] His reward — he [Abraham] is using it to intimate [to his father] that he can do nothing for him other than to ask forgiveness [for him], which [saying] is itself based on that [former statement] albeit excepted [from it] in terms of what is meant by it, even if on the face of it, it would seem to be [semantically] part of the [good] example to be followed: Say, ‘Who can avail you anything against God’ [Q. 48:11]; his [Abraham’s] plea of forgiveness for him was before it became evident to him that he [his father] was an enemy of God, as mentioned in sūrat Barā’a [Q. 9:114]. ‘Our Lord, in You we put our trust, and to You we turn [penitently], and to You is the journeying: these are the words of the Friend [of God, Abraham] and those who were with him, in other words, they were saying:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "661 (There is a goodly pattern) a good example (for you) Hatib (Abraham) in Abraham's words (and those with him) and also in the words of the believers who were with him, (when they told their folk) when they told their disbelieving kinsfolk; (Lo! we are guiltless of you) of your kinship and religion (and all that ye worship beside Allah) of idols. (We have done with you) we absolve ourselves from you and from your religion. (And there hath arisen between us and you hostility) through killing and beating (and hate) in the hearts (for ever until ye believe in Allah only) until you declare Allah's divine Oneness (save that which Abraham promised) save the words of Abraham to (his father (when he said): I will ask forgiveness for thee) because he promised him to do so, but when his father died in a state of disbelief, Abraham disavowed him, saying: (though I own nothing for thee from Allah) from Allah's chastisement. Allah then taught them what to say: (Our Lord!) our Lord! (In Thee we put our trust) we rely on you, (and unto Thee we turn repentant) we turn to your obedience, (and unto Thee is the journeying) and unto You is the return in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ثم علّمهم طريق التوحيد بالتأسي بالموحد الحقيقي السابق إبراهيم النبي عليه السلام وأصحابه { لأستغفرنّ لك } أي: لأطلبن لك الغفران بمحو صفاتك وسيئات أعمالك بالنور الإلهي { وما أملك } إلا الطلب\n وأما وجود ذلك فأمر متعلق بمشيئة الله وعنايته كما قال:\n[القصص\n الآية:56]\n { ربّنا عليك توكلنا } بالخروج عن أفعالنا بشهود أفعالك { وإليك أنبنا } بمحو صفاتنا بمطالعة صفاتك { وإليك المصير } بفناء ذواتنا ووجوداتنا في ذاتك وهو التوحيد التام",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولا تستنكفوا عن حكم الله إياكم بقطع أرحامكم الكفرة\n وأقاربكم المشركين\n إذ { قَدْ كَانَتْ لَكُمْ أُسْوَةٌ } وقدوة { حَسَنَةٌ } صالحة لائقة يُؤتسى ويُقتدى بها\n كانت تلك القدوة نازلة { فِيۤ } شأن { إِبْرَاهِيمَ وَٱلَّذِينَ مَعَهُ } المؤمنين له\n والمسترشدين من المتدينين بدينه\n وقد كانوا يقولون بمقتضى تلك الأسوة الحسنة وقت { إِذْ قَالُواْ لِقَوْمِهِمْ } الذين هم أقاربهم وأرحامهم الكفرة وعبدة الأوثان: { إِنَّا } بعدما كوشفنا بوحدة الحق { بُرَءآؤُاْ } برئيون { مِّنْكُمْ } لانهماكهم في الشرك أيضاً { وَمِمَّا تَعْبُدُونَ مِن دُونِ ٱللَّهِ } من الأصنام والأوثان الباطلة العاطلة\n وبالجملة: { كَفَرْنَا بِكُمْ } وبدينكم الباطل\n ومعبوداتكم العاطلة الباطلة\n\n\n{ وَ } بعد اليوم { بَدَا } ظهر { بَيْنَنَا وَبَيْنَكُمُ ٱلْعَدَاوَةُ وَٱلْبَغْضَآءُ أَبَداً } لا نصالح ولا نواسي معكم أصلاً { حَتَّىٰ تُؤْمِنُواْ بِٱللَّهِ وَحْدَهُ } وتتبرؤوا عن معبوداتكم الباطلة مثلنا\n فعليكم أيها المؤمنون اليوم أن تأتسوا وتقتدوا لجميع ما قال إبراهيم عليه السلام ومن تبعه لقومهم فيما مضى { إِلاَّ قَوْلَ إِبْرَاهِيمَ لأَبِيهِ } الكافر: { لأَسْتَغْفِرَنَّ لَكَ } من الله يا أبي\n وبالجملة: اقتدوا أيها المؤمنون بجميع أطوار إبراهيم عليه السلام وأقواله سوى هذا القول لأبيه معتذراً منه بقوله: { وَمَآ أَمْلِكُ لَكَ } أي: ما أقدر وأدفع منك { مِنَ } غضب { ٱللَّهِ } المنتقم الغيور { مِن شَيْءٍ } نزل عليك بمقتضى قهره وسخطه سبحانه سوى الاستغفار والشفاعة إن قَبِل الملك الغفار مني هذا\n وذلك قبل ورود النهي صلى الله عليه وسلم عن ودادة أهل الكفر\n أو صدر عنه هذا الموعود وعدها إياه\n\n\nوبعدما أُمرتم أيها المؤمنون بمحبة الله ومحبة رسوله والذين آمنوا معه\n وتدينوا بدينه\n ونُهيتم عن مودة الأعداء وموالاتهم\n ومواساة أخلاقهم وأطوارهم\n قولوا مسترجعين إلى الله\n مناجين معه: { رَّبَّنَا } يا من ربَّانا على فطرة التوحيد والإسلام { عَلَيْكَ تَوَكَّلْنَا } في كل الأمور بلا رؤية الوسائل في البين ثقةً واعتماداً عليك { وَإِلَيْكَ أَنَبْنَا } عدنا ورجعنا في الخطوب وعموم الملمات\n لا إلى غيرك من الأسباب العادية { وَ } بالجملة: { إِلَيْكَ ٱلْمَصِيرُ } [الممتحنة: 4] كما أن مصدره منك\n إذ لا موجود سواك\n ولا مقصد ولا مقصود غيرك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { قد كانت لكم أُسوةٌ } أي: قدوة { حسنةٌ } أو: خصلة حميدة\n حقيقة بأن يُرتقى بها ويُقتدى\n كائنة { في إِبراهيمَ والذين معه } من أصحابه المؤمنين\n أو: الأنبياء المعاصرين له\n وقريبًا من عصره\n ورجّحه الطبري وغيره لأنه لم يروا لإبراهيم أتباع مؤمنون وقت مكافحته نمرودًا\n وقد قال لسارة\n حين رحل بها إلى الشام: \" ليس على وجه الأرض مَن يعبد الله غيري وغيرك \"\n { إِذْ قَالُوا لِقَوْمِهمْ إِنَّا بُرَآءُ مِنْكُمْ } \n جمْع بريء\n كظريف وظرفاء\n أي: نتبرأ منكم { ومما تعبدون من دون الله } من الأصنام\n { كَفَرنا بكم } أي: بدينكم\n أو: معبودكم\n أو: بكم وبأصنامكم\n فلا نعتد بشأنكم وبآلهتكم\n { وبدا بيننا وبينكم العداوةُ والبغضاءُ أبداً } أي: هذا دأبنا أبداً { حتى تُؤمنوا بالله وَحْدَه } وتتركوا ما أنتم عليه من الشرك\n فتنقلب العداوة حينئذ ولاية\n والبغضاء محبة\n وحاصل الآية: أنّ الحق تعالى يقول: إن كانت عداوة الكفار لكم إنما هي لأجل إيمانكم بالحق\n فعادوهم أنتم\n وكافحوهم بالعداوة\n وأَظْهِروا البغضاء لهم والمقت\n وصَرِّحوا أنّ سبب العداوة ليس إلاّ كفركم بالله\n وما دام هذا السبب قائمًا كانت العداوة\n حتى إن أزلتموه انقلبت العداوةُ مولاةً\n وأنتم مقتدون في ذلك بالخليل عليه السلام وسائر الأنبياء\n حيث كافحوا الكفارَ بالعداوة\n وتوكّلوا على الله\n قال ابن عطية: هذه الأسوة مقيّدة بالتبرِّي من المشركين وإشراكهم\n وهو مطرد في كل ملة\n وفي نبينا صلى الله عليه وسلم أسوة حسنة على الإطلاق\n في العقائد وفي أحكام الشرع\n هـ\n فلكم أسوة فيمن تقدّم\n { إِلاَّ قولَ إِبراهيمَ لأبيه لأَستغفرنَّ لك } \n وذلك لموعدةٍ وعدها إياه\n أي: اقتدوا به في كل شيء\n ولا تقتدوا به في استغفاره لأبيه الكافر\n واستغفاره عليه السلام لأبيه الكافر جائز عقلاً وشرعاً قبل النهي\n لوقوعه قبل تبيُّن أنه من أصحاب الجحيم\n لكنه ليس مما ينبغي أن يُؤتسى به أصلاً\n { وما أَمْلِكُ لك من الله من شيءٍ } أي: من هداية ومغفرة وتوفيق\n وهذه الجملة من تمام قول المستثنى\n كأنه قال: أستغفرُ لك وما في طاقتي إلاّ الاستغفار\n إظهاراً للعجز وتفويضاً للأمر\n { ربنا عليك توكلنا وإِليك أَنَبْنا } أي: أَقبلنا\n { وإِليك المصيرُ } المرجع وهو من تمام ما نقل عن إبراهيم عليه السلام ومَن معه مِن الأسوة الحسنة\n وهو راجع لِما قبل الاستثناء\n قالوه بعد المهاجرة ونشر البغضاء\n التجاء إلى الله تعالى في جميع أمورهم\n لا سيما في موافقة الكفرة\n وكفاية شرورهم\n وقيل: معناه: قولوا\n فيكون أبتداء كلام خطاباً لهذه الأمة\n وضعّفه أبو السعود\n وتقديم المعمول لقصر التوكُّل والإنابة والمصير عليه تعالى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:91",
      "similarity": 0.3589023967755529
    },
    {
      "verse": "33:21",
      "similarity": 0.3471346054624233
    },
    {
      "verse": "60:6",
      "similarity": 0.33963666559059535
    },
    {
      "verse": "7:93",
      "similarity": 0.31730010099420203
    },
    {
      "verse": "5:68",
      "similarity": 0.3119553029401418
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/60:4.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/60:4.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/60:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}