{
  "chapter": "الممتحنة",
  "text": "ربنا لا تجعلنا فتنة للذين كفروا۟ واغفر لنا ربنا انك انت العزيز الحكيم",
  "translations": [
    {
      "translation": "Our Lord, do not make us a target for those who are kafir and forgive us. Our Lord, You are the Almighty, the All-Wise.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Lord, make us not an example of punishment for infidels, and forgive us, O Lord. You are all-mighty and all-wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, do not make us a test for the unbelievers, and forgive us, our Lord. Surely You are Most Mighty, Most Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They prayed, \"Lord, we have trust in You, turned to You in repentance, and to You we shall all return. Lord, save us from the evil intentions of the disbelievers. Our Lord, forgives us. You are Majestic and All-wise\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O our Lord! Do not put us into the trial of the disbelievers, and forgive us, O our Lord! Indeed You only are the Most Honourable, the Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Make us not a trial for the disbelievers, and forgive us, Our Lord! Verily, You, only You, are the Almighty, the All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! do not make us a trial for those who disbelieve, and forgive us, our Lord! surely Thou art the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, make us not a temptation to those who disbelieve; and forgive us. Our. Lord, Thou art the All-mighty, the All-wise.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Make us not a prey for those who disbelieve, and forgive us, our Lord! Lo! Thou, only Thou, are the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, do not make us a prey for those who deny the truth, and forgive us our Lord. For You alone are the Mighty, the Wise One.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! make us not a trial for those who disbelieve, and forgive us, our Lord! verily Thou! Thou art the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Do not make us a test for the faithless, and forgive us. Our Lord! Indeed You are the All-mighty, the All-wise.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Make us not a (test and) trial for the Unbelievers, but forgive us, our Lord! for Thou art the Exalted in Might, the Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord! Make us not a trial for the disbelievers, and forgive us, Our Lord! Verily, You, only You are the All-Mighty, the All-Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, do not make us a temptation for the unbelievers and forgive us. Our Lord, You are the Almighty, the Wise'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, do not make us a target for those who disbelieve, and forgive us, our Lord. You are indeed the Mighty and Wise.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Our Lord, make us not [objects of] torment for the disbelievers and forgive us, our Lord. Indeed, it is You who is the Exalted in Might, the Wise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[60:5]   Our Lord, do not make us a cause of beguilement for those who disbelieve, that is to say, do not make them prevail over us, lest they think that they are following the truth and are beguiled as a result, in other words, [lest] they lose their reason because of us; and forgive us. Our Lord, You are indeed the Mighty, the Wise’, in Your kingdom and Your actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Our Lord!) Say: our Lord! (Make us not a prey for those who disbelieve) for the disbelievers of Mecca; they said: do not set them on us, lest they think they are following the Truth while we are following falsehood, which will only embolden them against us, (and forgive us) our sins, (our Lord!) our Lord! (Lo! Thou, only Thou, art the Mighty) in retribution against whoever does not believe in You, (the Wise) in helping those who believe in You.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُواْ } معناه لا تَنصُرهُم علينا فيظُنوا أنهم عَلى حَقٍ ونَحنُ علَى البَاطلِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Do not make us a trial for those who disbelieve}, its meaning is, \"Do not support them against us so that they think they are in the right and we are in the wrong.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ربنا لا تجعلنا فتنة للذين كفروا } أي: إنّا لا نخافهم ولا نرى لهم تأثيراً ولا وجوداً ولكنا نعوذ بعفوك من عقابك حتى لا تعاقبنا بهم ولا تبلينا بأيديهم بسبب ما فرط منا من السيئات والظهور بالصفات { واغفر لنا } ذنوب تفريطاتنا بالعفو لا بالعقوبة { إنك أنت العزيز } القويّ على عقابنا بهم وعلى دفعهم عنا وقمعهم وقهرهم { الحكيم } لا يفعل أحد الأمرين ولا يختاره إلا بمقتضى الحكمة ثم كرر وجوب التأسي بإبراهيم وأصحابه وأثبته لمن كان في بداية التوحيد في مقام الرجاء وتوقع الكمال",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما وطنتنا في مقر توحيدك يا { رَبَّنَا لاَ تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُواْ } بأن تسلطهم علينا فيفتنوا بنا\n ويصيبونا بعذاب لا طاقة لنا بحمله { وَٱغْفِرْ لَنَا رَبَّنَآ } ما فرطنا بمقتضى بشريتنا { إِنَّكَ أَنتَ ٱلْعَزِيزُ } الغالب المقتدر على وجوه الإنعام والانتقام { ٱلْحَكِيمُ } [الممتحنة: 5] المتقن في تدبير مصالح العباد\n وما جرى عليهم في المعاش والمعاد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ربنا لا تجعلنا فتنةً للذين كفروا } بأن تُسلطهم علينا\n فيفتنونا بعذاب لا نُطيقه\n { واغفر لنا } ما فرط منا\n { ربنا إِنك أنت العزيزُ } الذي لا يذلّ مَن التجأ إليه\n ولا يخيب رجاء مَن توكل عليه\n { الحكيمُ } الذي لا يفعل إلاَّ ما فيه حكمة بالغة\n\nوتكرير النداء للمبالغة في التضرُّع والالتجاء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:63",
      "similarity": 0.6121423228968271
    },
    {
      "verse": "5:118",
      "similarity": 0.5513127705261122
    },
    {
      "verse": "68:6",
      "similarity": 0.5359286007726863
    },
    {
      "verse": "37:162",
      "similarity": 0.5335924492727567
    },
    {
      "verse": "10:85",
      "similarity": 0.4967627167466486
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/60:5.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/60:5.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/60:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}