{
  "chapter": "الممتحنة",
  "text": "لقد كان لكم فيهم اسوة حسنة لمن كان يرجوا۟ الله واليوم الءاخر ومن يتول فان الله هو الغنى الحميد",
  "translations": [
    {
      "translation": "Those of you who have hope in God and the Last Day have certainly a good example in them. But whosoever turns away, then surely God is above concern, worthy of praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed there is a good example for you in them; a good example for anyone who looks forward to Allah and the Last Day. As for him who turns away, Allah is All-Sufficient, Immensely Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the best examples for those who have hope in God and the Day of Judgment. Whoever turn away should know that God is Self-sufficient and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed in them lay a good example for you to follow – for one who looks forward to (meeting) Allah and the Last Day; and whoever turns away – then (know that) indeed Allah only is the Independent, the Most Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly, there has been in them an excellent example for you to follow - for those who look forward to (the meeting with) Allah and the Last Day. And whosoever turns away, then verily, Allah is Al-Ghani, Al-Hamid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly there is for you in them a good example, for him who fears Allah and the last day; and whoever turns back, then surely Allah is the Self-sufficient, the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have had a good example in them for whoever hopes for God and the Last Day. And whosoever turns away, surely God is the All-sufficient, the All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily ye have in them a goodly pattern for everyone who looketh to Allah and the Last Day. And whosoever may turn away, lo! still Allah, He is the Absolute, the Owner of Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, there is a good example in them for you; for those who place their hopes in God and the Last Day. Whoever turns away will surely learn that God is self-sufficient and worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Assuredly there hath been in them for you an excellent pattern-for him who hopeth for Allah and the last Day. And whosoever turneth away, then verily Allah! He is the Self-sufficient, the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is certainly a good exemplar for you in them—for those who look forward to Allah and the Last Day—and anyone who refuses to comply [should know that] indeed Allah is the All-sufficient, the All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There was indeed in them an excellent example for you to follow,- for those whose hope is in Allah and in the Last Day. But if any turn away, truly Allah is Free of all Wants, Worthy of all Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly, there has been in them an excellent example for you to follow, for those who look forward to (the Meeting with) Allah (for the reward from Him) and the Last Day. And whosoever turn away, then verily, Allah is Rich (Free of all wants), Worthy of all Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In those there is a good example for whosoever hopes for Allah and the Last Day. Whosoever turns away, indeed, Allah is the Rich and the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is an excellent example in them for you—for anyone who seeks God and the Last Day. But whoever turns away—God is the Self-Sufficient, the Most Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has certainly been for you in them an excellent pattern for anyone whose hope is in Allah and the Last Day. And whoever turns away - then indeed, Allah is the Free of need, the Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[60:6] Verily there is for you, O community of Muhammad (s) (laqad kāna lakum is the response to an implied oath) in them a good example, for those [of you] who (li-man kāna is an inclusive substitution for –kum [of lakum, ‘for you’] with the same preposition [li-] repeated) anticipate God and the Last Day, that is, [for those] who fear these two, or who expect reward or punishment. And whoever turns away, by befriending the disbelievers, [should know that] God is the Independent, [without need] of His creatures, the Worthy of Praise, to those who obey Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Verily ye have in them) you have, Hatib, in the words of Abraham and the believers with him (a goodly pattern) a good example to emulate (for everyone who looketh to Allah) for everyone who fears Allah (and the Last Day) and resurrection after death. Would it not be better for you, Hatib, to say as Abraham and the believers with him said. (And whosoever may turn away) from what he was commanded by Allah, (lo! still Allah, He is the Absolute) Allah is free of need for him as He is free of need for His creation, (the Owner of Praise) Who is praiseworthy in His acts; and it is said this means: the Owner of Praise regarding the one who professes His divine Oneness; and it is also said that the Owner of Praise means: He is thankful for little but He rewards for it abundantly.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ بالغ سبحانه في التأسي والاقتداء بملة إبراهيم عليه السلام وقدوته فقال مؤكداً بالقسم: والله { لَقَدْ كَانَ لَكُمْ } أيها المؤمنون { فِيهِمْ } أي: في إبراهيم والذين معه { أُسْوَةٌ حَسَنَةٌ } جرية صالحة يُؤتسى ويُقتدى { لِّمَن كَانَ يَرْجُو ٱللَّهَ } أي: التحقق برضاه، والتسليم بقضاه { وَ } يرجو { ٱلْيَوْمَ ٱلآخِرَ } ليتحقق عند مولاه بما وعد له وهيأه { وَمَن يَتَوَلَّ } ويعرض عن الله، ولم يؤمن بالوقوف بين يدي الله فلن يضر الله شيئاً { فَإِنَّ ٱللَّهَ } المتعزز برداء العظمة والكبرياء { هُوَ ٱلْغَنِيُّ } المستغني بذاته، لا احتياج له إلى رجاء الراجين ومناجاتهم معه، ورفع حاجاتهم إياه { ٱلْحَمِيدُ } [الممتحنة: 6] حسب أسمائه وصفاته بلا افتقار له إلى الحمد الحامدين، وشكر الشاكرين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لقد كان لكم فيهم } في إبراهيم ومَن معه { أُسوةٌ حسنةً } ، تكرير للمبالغة في الحث على الاقتداء به، ولذلك صدّره بالقسم\n وقوله: { لمَن كان يرجو اللهَ واليومَ الآخر } بدل من \" لكم \" ، وحكمته: الإيذان بأن مَن يؤمن بالله واليوم الآخر لا يترك الاقتداء بهم، وأنّ تركه مخلّ بالإيمان بهما، كما ينبىء عنه قوله تعالى: { ومَن يتولَّ فإِنَّ اللهَ هو الغنيُّ الحميدُ } ، فإنه إنما يُوعَد بأمثاله الكفرة، أي: هو الغني عن الخلق، الحميد المستحق للحمد وحده\n الإشارة: ينبغي للمريد أن يكون إبراهيميًّا، يتبرأ من كل ما يشغله عن الله، أيًّا مَن كان، ويظهر العداوة والبغضاء لكل مَن يقطعه عن مولاه، حتى يوافقه على طريقه وسيرته، إلاّ على وجه النصيحة والدعاء إلى الله، إن كان أهلاً لذلك، فيُذكِّر مَن خالفه في طريقه، فإن أيس منه استغفر له، ودعا له بالهداية، مُقرًّا بالعجز عن هدايته وتوفيقه، ثم يلتجىء إلى مولاه في جميع أموره، ويتحصّن بالله من فتنة أهل الظلم والغفلة\n والله غالب على أمره\n ولمّا أمر اللهُ بعداوة الكفرة، عادى المؤمنون أقرباءهم المشركين، وشدّدوا في عداوة آبائهم وأبنائهم، فعلم تعالى شدةَ وجد المؤمنين بذلك، فأنزل: { عَسَى ٱللَّهُ أَن يَجْعَلَ بَيْنَكُمْ }\n\n",
      "translations": []
    }
  ]
}