{
  "chapter": "الممتحنة",
  "text": "۞ عسى الله ان يجعل بينكم وبين الذين عاديتم منهم مودة والله قدير والله غفور رحيم",
  "translations": [
    {
      "translation": "It may well be that Allah will restore the love between you and those of them who are now your enemies. Allah is Ail-Powerful. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It maybe that God will create love between you and your enemies. God is all-powerful, and God is forgiving, ever-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may well be that Allah will implant love between you and those with whom you have had enmity. Allah is Most Powerful; and Allah is Most Forgiving, Most Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will perhaps bring about love between you and those of the disbelievers with whom you were enemies. God is All-powerful, All-merciful, and All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is likely that Allah may create friendship between you and those among them who are now your enemies; and Allah is All Able; and Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps Allah will make friendship between you and those whom you hold as enemies. And Allah has power (over all things), and Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be that Allah will bring about friendship between you and those whom you hold to be your enemies among them; and Allah is Powerful; and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be God will yet establish between you and those of them with whom you are at enmity love. God is All-powerful; God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be that Allah will ordain love between you and those of them with whom ye are at enmity. Allah is Mighty, and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may well be that God will create goodwill between you and those of them with whom you are now at enmity -- for God is all powerful, most forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Belike Allah may appoint between you and those of them whom ye hold as enemies affection. And Allah is Potent, and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be that Allah will bring about affection between you and those with whom you are at enmity, and Allah is all-powerful, and Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be that Allah will grant love (and friendship) between you and those whom ye (now) hold as enemies. For Allah has power (over all things); And Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps Allah will make friendship between you and those whom you hold as enemies. And Allah has power (over all things), and Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be that Allah establishes love between you and those with whom you are at enmity. Allah is the Powerful, Allah is the Forgiving and the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps God will plant affection between you and those of them you consider enemies. God is Capable. God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps Allah will put, between you and those to whom you have been enemies among them, affection. And Allah is competent, and Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[60:7] It may be that God will bring about between you and those of them with whom you are at enmity, from among the disbelievers of Mecca out of [your] obedience to God, exalted be He, affection, by His guiding them to faith, so that they then become your friends. For God is Powerful, [able] to do that — and He did do this after the conquest of Mecca — and God is Forgiving, to them of their past [deeds], Merciful, to them [also].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It may be) \"may be\" when used in connection with Allah denotes a requisite (that Allah will ordain love) a bond and marriage relationships; and it so happened that the Prophet (pbuh) married, upon the conquest of Mecca, Umm Habibah, the daughter of Abu Sufyan, and this became a bond between them and the Prophet (pbuh) (between you and those of them with whom ye are at enmity) those of the people of Mecca whom you oppose with regard to religion. (Allah is Mighty) He is able to give His Prophet the upper hand over the disbelievers of Quraysh, (and Allah is Forgiving) He forgives whoever amongt them repents of disbelief and accepts faith in Allah, (Merciful) towards whoever amongst them dies in a state of faith and repentance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ عسى الله ان يجعل بينكم وبين الذين عاديتم منهم مودّة } برفع موجب العداوة الذي هو الكفر\n إذ الاحتجاب ليس أمراً فطرياً بل الإيمان بمقتضى الفطرة الأصلية والتحاب وإنما حدث الكفر عند الاحتجاب بالنشأة والانغمار في الغواشي الطبيعية\n { والله } قادر على رفعها\n وإذا ارتفعت ظهرت المودّة الحقيقية بنور الوحدة الذاتية ومقتضى الأخوة الإيمانية { والله غفور } يستر تلك الهيئات المظلمة الحاجبة بنور صفاته { رحيم } يرحم أهل النقصان فيجبره بإفاضة كمالاته { إنّ الله يحبّ المقسطين } لأن العدالة هي ظل المحبة والمحبة ظل الوحدة فما ظهرت العدالة في مظهر إلا وقد تعلقت محبة الله به أولاً إذ لا ظلّ بغير الذات والله تعالى أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا ورد النهي الإلهي على وجه المبالغة والتأكيد عن موالاة ذوي الأرحام والأقارب من الكفرة تبرأ المؤمنون من أقاربهم وعشائرهم المشركين\n وعادوا معهم\n إلاَّ أنهم أضمروا في نفوسهم حزناً وغماً\n فوعد الله سبحانه لهم إيمان أقاربهم تسليةً لهم\n وإزالةً لحزنهم\n فقال: { عَسَى ٱللَّهُ أَن يَجْعَلَ بَيْنَكُمْ } أيها المؤمنون { وَبَيْنَ ٱلَّذِينَ عَادَيْتُم مِّنْهُم مَّوَدَّةً } ومحبة خالصة جامعة بينكم وبينهم\n ألا وهي الإسلام المسقِط لجميع الآثام { وَٱللَّهُ } المطلع على ما في ضمائرهم عباده { قَدِيرٌ } على ذلك الجمع المستلزم للمودة { وَٱللَّهُ } القادر المقتدر على جمعكم { غَفُورٌ } لفرطاتكم التي صدرت منكم { رَّحِيمٌ } [الممتحنة: 7] يرحمكم بمقتضى سعة رحمته وجوده\n\n\nثمَّ لمَّا تحرَّج المؤمنون من عدم موالاتهم مع أقاربهم الكفرة\n وذوي أرحامهم المشركين إلى حيث قدمت قتيلة بنت عبد العزى مشركة على ابنتها أسماء بنت أبي بكر بهدايا فلم تأذن لها بالدخول\n ولم تقبل هديتها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { عسى اللهُ أن يجعلَ بينكم وبين الذين عادَيْتم منهم } من أقاربكم المشركين، { مودةً } بأن يُوافقوكم في الدين. وَعَدهم بذلك لما رأى منهم من التصلُّب في الدين، والتشديد في معاداة أقربائهم، تطييباً لقلوبهم، ولقد أنجز وَعْدَه الكريم، فأسْلَم كثير منهم يوم فتح مكة، فتصافوا، وتوادوا وصاروا أولياء وإخواناً، وخالَطوهم وناكَحوهم. و \" عسى \" من الله واجبة الوقوع. { واللهُ قديرٌ } أي: مبالغ في القدرة على تغيير الأحوال وتسهيل أسباب المودة، { واللهُ غفور رحيم } ، فيغفر لمَن أسلم من المؤمنين ويرحمهم، أو: غفور لما فَرَط منكم من مولاتهم قبلُ، وما بقي في قلوبكم من ميل الطبع إلى الرحم بعدُ، رحيم لمَن لم تبقَ فيه بقية. الإشارة: عسى الله أن يجعل بينكم وبين نفوسكم، التي عاديتموها وخالفتموها، وقطعتم مواد هواها، مودةً، حين تتهذّب وتتأدّب وترتاض بالمجاهدة، فالواجب حينئذ البرور بها، والإحسان إليها، لأنها انقلبت روحانية، تصطاد بها العلوم اللدنية، والمعارف الربانية، وفيها يقول شيخ شيوخنا، سيدي عبد الرحمن المجذوب رضي الله عنه:\nفالآية تسلية وترجية لأهل المجاهدة من السائرين دون الواصلين فإنّ المجاهدة لا تكون إلاّ قبل المشاهدة، أو: تكون تسلية لهم عند مقاطعة أقاربهم وعشائرهم، حين فرُّوا عنهم لله، بأن يهديهم الله، حتى يوافقوهم على طريقهم. وبالله التوفيق. ثم بيَّن مَن نهى عن مقاطعته، فقال: { لاَّ يَنْهَاكُمُ ٱللَّهُ عَنِ ٱلَّذِينَ لَمْ يُقَاتِلُوكُمْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "85:14",
      "similarity": 0.5509327515818677
    },
    {
      "verse": "11:90",
      "similarity": 0.5114553869113015
    },
    {
      "verse": "19:96",
      "similarity": 0.505730741347984
    },
    {
      "verse": "4:99",
      "similarity": 0.45624686499091277
    },
    {
      "verse": "47:22",
      "similarity": 0.37170443623996585
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/060007.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/060007.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/60:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}