{
  "chapter": "الممتحنة",
  "text": "لا ينهىكم الله عن الذين لم يقتلوكم فى الدين ولم يخرجوكم من ديركم ان تبروهم وتقسطوا۟ اليهم ان الله يحب المقسطين",
  "translations": [
    {
      "translation": "Allah does not forbid you from being good to those who have not fought you in the deen or driven you from your homes, or from being just towards them. Allah loves those who are just.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not forbid you from being kind and acting justly towards those who did not fight over faith with you, nor expelled you from your homes. God indeed loves those who are just.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not forbid that you be kind and just to those who did not fight against you on account of religion, nor drove you out of your homes. Surely Allah loves those who are equitable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God does not forbid you to deal kindly and justly with those who have not fought against you about the religion or expelled you from your homes. God does not love the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not forbid you from those who did not fight against you because of religion and did not drive you out from your homes, that you should be kind towards them and deal with them fairly; indeed the equitable are the beloved of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not forbid you to deal justly and kindly with those who fought not against you on account of religion nor drove you out of your homes. Verily, Allah loves those who deal with equity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not forbid you respecting those who have not made war against you on account of (your) religion, and have not driven you forth from your homes, that you show them kindness and deal with them justly; surely Allah loves the doers of justice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God forbids you not, as regards those who have not fought you in religion's cause, nor expelled you from your habitations, that you should be kindly to them, and act justly towards them; surely God loves the just.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah forbiddeth you not those who warred not against you on account of religion and drove you not out from your homes, that ye should show them kindness and deal justly with them. Lo! Allah loveth the just dealers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He does not forbid you to deal kindly and justly with anyone who has not fought you on account of your faith or driven you out of your homes: God loves the just.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah forbiddeth you not that ye should deal benevolently and equitably with those who fought not against you on accouct of religion nor drave you out from your homes; verily Allah loveth the equitable,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not forbid you from dealing with kindness and justice with those [polytheists] who did not make war against you on account of religion and did not expel you from your homes. Indeed Allah loves the just.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah forbids you not, with regard to those who fight you not for (your) Faith nor drive you out of your homes, from dealing kindly and justly with them: for Allah loveth those who are just.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not forbid you to deal justly and kindly with those who fought not against you on account of religion and did not drive you out of your homes. Verily, Allah loves those who deal with equity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not forbid you to be kind and to act justly to those who have neither made war on your Religion nor expelled you from your homes. Allah loves the just.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who have not fought against you for your religion, nor expelled you from your homes, God does not prohibit you from dealing with them kindly and equitably. God loves the equitable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah does not forbid you from those who do not fight you because of religion and do not expel you from your homes - from being righteous toward them and acting justly toward them. Indeed, Allah loves those who act justly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[60:8] God does not forbid you in regard to those who did not wage war against you, from among the disbelievers, on account of religion and did not expel you from your homes, that you should treat them kindly (an tabarrūhum is an inclusive substitution for alladhīna, ‘those who’) and deal with them justly: this was [revealed] before the command to struggle against them. Assuredly God loves the just.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah forbideth you not) to help and have relations with (those who warred not against you on account of religion and drove you not out from your homes) i.e. from Mecca, nor helpe those who drove you out of it, (that ye should show them kindness) that you should have relations with them and help them (and deal justly with them) by honouring your pledges to them. (Lo! Allah loveth the just dealers) the just ones who honour their pledges. The latter are Khuza'ah, the people of Hilal Ibn 'Uwaymir, and Khuzaymah and the Banu Mudlij who signed a treaty with the Prophet (pbuh) before the year of the al-Hudaybiyyah and which stipulated that they will not fight against him, drive him out of Mecca or help anyone to drive him out of Mecca. It is for this reason that Allah did not forbid him from having relations with them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ لا سبب للنهي عن ودادة هؤلاء { وَ } عليكم أن { تُقْسِطُوۤاْ } وتفيضوا { إِلَيْهِمْ } بالقسط الإلهي على مقتضى الوصلة الموضوعية بينكم بالوضع الإلهي { إِنَّ ٱللَّهَ يُحِبُّ ٱلْمُقْسِطِينَ } [الممتحنة: 8] المعتدلين في عموم الأحوال\n سيما على ذوي القربى\n\n\nبل { إِنَّمَا يَنْهَاكُمُ ٱللَّهُ } العليم الحكيم { عَنِ } مولاة أقربائكم { ٱلَّذِينَ قَاتَلُوكُمْ فِي ٱلدِّينِ وَأَخْرَجُوكُم مِّن دِيَارِكُمْ } يعني: مكة - شرفها الله - { وَ } الذين { ظَاهَرُواْ } أعانوا ونصروا { عَلَىٰ إِخْرَاجِكُمْ } وإن لم يباشروا بجوارحهم\n لكن أعانوا على المباشرين المخرجين بالقول والمال\n وإيقاع الفتنة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { لا ينهاكم اللهُ عن الذين لم يقاتلوكم في الدين ولم يُخرجوكم من دياركم أن تَبروهم } أي: لا ينهاكم عن البر بهؤلاء\n فـ \" أن تبروهم \": بدل من الموصول\n { وتُقْسِطوا إِليهم } أي: تقضوا إليهم بالقسط\n أي: بالعدل\n ولا تظلموهم\n وإذا نهى عن الظلم في حق المشرك\n فكيف في حق المسلم؟ { إِن اللهَ يُحب المُقسِطين } الحاكمين بالعدل\n رُوِي أن \" قُتَيلةَ بنت عبد العزى \" قَدِمَتْ مشركة على بنتها \" أسماء بنت أبي بكر \" رضي الله عنه\n بهدايا\n فلم تقبلها\n ولم تأذن لها بالدخول فنزلت\n وأمرها رسولُ الله صلى الله عليه وسلم أن تقبل منها\n وتُكرمها\n وتُحسن إليها\n وقيل: المراد بهم خزاعة\n وكانوا صالحوا رسولَ الله صلى الله عليه وسلم ألاّ يقاتلوه\n ولا يُعينوا عليه\n قال المحلي: وهذا قبل الأمر بجهادهم\n ومثله لابن عطية\n فإنه نقل الخلاف\n ثم قال: وعلى أنها في الكفار فالآية منسوخة بالقتال\n هـ\n قال الكواشي: نزلت رخصة في صلة الذين لم يُعادوا المؤمنين ولم يُقاتلوهم\n ثم قال: وفي هذه الآية دلالة على جواز صلة الكفار\n الذين لم ينصبوا لحرب المسلمين\n وبِرهم\n وإن انقطعت الموالاة بينهم\n هـ\n قال القشيري: مَن كان فيهم حُسن خُلق\n أو للمسلمين منهم رِفْق\n أُمروا بالملاينة معهم\n شاهد هذه الجملة: \" إنَّ الله يُحب الرِّفق في الأمر كله \"\n هـ\n المحشي\n وهذا: فيما لا ضرر فيه للمسلمين\n وفي المدارك: حكى الدارقطني أنَّ عبدَ وزيرِ المعتضد دخل على القاضي إسماعيل وكان نصرانيّاً فقام له ورحّب به فرأى إنكار مَن عنده فقال: علمت إنكاركم\n وقد قال تعالى: { لا ينهاكم الله\n\n\n } الآية\n وهذا رجل يقضي حوائج المسلمين\n وهو سفير بيننا وبين المعتضد\n وهذا مَن البر\n فسكت الجماعةُ عند ذلك\n هـ\n قال البرزلي: ولعله رأى ذلك ضرورة\n وتأنّس بظاهر الآية\n وخاف مِن أذاه إن لم يفعل ذلك\n هـ\n وفي حديث الجامع:\n \" بُعثتُ بمداراة الناس \" \n\n قيل: والفرق بينها وبين المداهنة: أنَّ المداهنة: إظهار الرضا بفعل الفاسق من غير إنكار عليه\n والمداراة: هي الرفق في تعليم الجاهل\n والملاطفة في نهي الفاسق عن فعله\n وقد قال تعالى:\n[طه:44]\n وقيل: المداهنة: ترك الدين بالدنيا\n والمداراة: بيع الدنيا بحفظ الدين\n وقد عَدّ السهروردي في \" الآداب \" مِن رُخص الصوفية: التكلُّف مع أبناء الدنيا والرؤساء والسلاطين\n والقيام لهم\n وحسن الإقبال عليهم\n والأدب في ذلك: إلاّ يكون طمعاً في دنياهم\n ولا اتخاذ جاه عندهم كان صلى الله عليه وسلم يدخل عليه سادات قريش فيُكرمهم\n ويُجلهم\n ويُحسن مجالستهم\n وقال:\n \" إذا أتاكم كريم قوم فأكرِموه \" \n \nهـ\n وانظر الأصل الرابع والثمانين في إنزال الناس منازلهم\n فقد ذكر فيه: أن العاقل عن الله يُعاشر الناس على ما دبَّر الله لهم\n فالغَنِيّ قد أكرمه الله كرامةَ ابتلاء\n كما ذكر في تنزيله\n فإذا لم تُنزله المنزلةَ التي أنزله الله فيها\n فاستهنت به\n وحقّرته من غير جرم استحق بذلك الجفاء\n فقد تركتَ موافقة الله في تدبيره\n وأفسدت عليه دينه وأثمتَه\n وكذلك معاملة الملوك والوُلاة على هذا السبيل\n فإذا عاملت الملوك والسلاطين بمعاملة الرعية\n فقد استخففت بحق السلطان\n وكيف يجوز أن تستخف بحقه\n والسلطان ظل الله في الأرض؟ به تسكن النفوس\n وتجمع الأمور\n والناظر إلى ظل الله عليهم في الشغل عن الالتفات إلى أعمالهم\n ثم ذكر أنّ ضد ما ذكر مِن ضعف المعرفة واليقين\n وعدم التخلُّص من النفس\n فلم تكن لقوتِهم مطالعة ما ذكر\n فخافوا على نفوسهم من مخالطتهم أن يجدوا حلاوة بِرهم\n فتخلط قلوبُهم بقلوبهم\n فجانبوهم\n والآخرون نظروا إليهم بغير الجمع\n فشغلوا بما ألبسَهم مِن ظله عن جميع ما هم فيه\n فلم يضرهم اختلاطهم بهم\n وبهذه القوة كان أصحاب رسول الله صلى الله عليه وسلم يلقون الأمراء\n الذين قد ظهر جَوْرهم\n ويقبلون جوائزهم\n فكان ابن دينار ومحمد بن واسع\n ومَن قبلهم\n والحسن البصري\n يلقون الأمراء ويَقبلُون منهم\n فكانوا يلقونهم بما ذكر من رؤية ظل الله عليهم\n ويُظهرون العطف عليهم والنصيحة لهم\n ثم وَجَّه حديثَ ابن عباس:\n \" ملعون مَن أكرم بالغنى وأهان بالفقر \" \nفإنَّ معناه: مَن عظَّم الدنيا وعظَّم أهلها\n فأمّا مَن دقت الدنيا في عينه\n يرى أهلَها مُبْتَلون بها\n بما تقتضيه من القيام بالشكر\n ثم غرقه في حِسَابه\n فيرحمه كما يرحم الذي ذهب به السيل\n ويكرمه\n ويبره بما عَوّده الله\n وأبقاه على دينه\n لئلا يَفسد\n فذلك فعل الأنبياء والأولياء\n وبذلك وصَّى رسول الله صلى الله عليه وسلم فقال:\n \" إذا أتاكم كريمُ قومٍ فأكرموه \" \nفهو إنما يُكرم لله ويهين لله\n لا للدنيا\n ومن فعل ذلك للدنيا كان ملعونًا\n ثم ذكر حديث:\n \" مَن أُعطي حظه من الرفق أُعطي حظَّه من خير الدنيا والآخرة\n ومن حُرمه حُرم كذلك \" \n\n ثم ذكر قصة نسْطُور صاحب ابن مريم عليه السلام ورفقه وتلطُّفه مع ذلك الملك الذي سجن صاحبيْه حتى استخلصهما منه برفق\n وأعلم الملكَ وجميعَ الناس في قضية عجيبة\n فعليك بها\n { إِنما ينهاكم اللهُ عن } موالاة { الَّذين قاتلوكم في الدين وأَخْرَجوكم من دياركم } \n وهم عتاة أهل مكة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "60:9",
      "similarity": 0.5305050883092196
    },
    {
      "verse": "3:21",
      "similarity": 0.4060487607571926
    },
    {
      "verse": "3:18",
      "similarity": 0.38137770959285533
    },
    {
      "verse": "10:47",
      "similarity": 0.36244506605590504
    },
    {
      "verse": "55:9",
      "similarity": 0.33406608161908896
    }
  ]
}