{
  "chapter": "الممتحنة",
  "text": "انما ينهىكم الله عن الذين قتلوكم فى الدين واخرجوكم من ديركم وظهروا۟ على اخراجكم ان تولوهم ومن يتولهم فاو۟لئك هم الظلمون",
  "translations": [
    {
      "translation": "Allah merely forbids you from taking as friends those who have fought you in the deen and driven you from your homes and who supported your expulsion. Any who take them as friends are wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He only forbids you from making friends with those who fought over faith with you and banished you from your homes, and aided in your exile. Whoever makes friends with them is a transgressor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah only forbids you to be friends with those who have fought against you on account of religion and who have driven you out of your homes and have abetted in your expulsion. And any who make friends with them, they are the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He only forbids you to be friends with those who have fought against you about the religion, expelled you from your homes or supported others in expelling you. Whoever loves these people are unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah forbids you only from those who fought against you because of religion or drove you out from your homes or helped others to drive you out, that you should befriend them; and whoever befriends them – it is they who are the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is only as regards those who fought against you on account of religion, and have driven you out of your homes, and helped to drive you out, that Allah forbids you to befriend them. And whosoever will befriend them, then such are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah only forbids you respecting those who made war upon you on account of (your) religion, and drove you forth from your homes and backed up (others) in your expulsion, that you make friends with them, and whoever makes friends with them, these are the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God only forbids you as to those who have fought you in religion's cause, and expelled you from your habitations, and have supported in your expulsion, that you should take them for friends. And whosoever takes them for friends, those -- they are the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah forbiddeth you only those who warred against you on account of religion and have driven you out from your homes and helped to drive you out, that ye make friends of them. Whosoever maketh friends of them - (All) such are wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God only forbids you to make friends with those who have fought against you on account of your faith and driven you out of your homes or helped others to do so. Any of you who turn towards them in friendship will truly be transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah only forbiddeth you with regard to those who fought against you on account of religion and drave you out from your homes and helped in driving you out, that ye should befriend them. And whosoever shall befriend them, then those! they are the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah forbids you only in regard to those who made war against you on account of religion and expelled you from your homes and supported [the polytheists of Makkah] in your expulsion, that you make friends with them, and whoever makes friends with them—it is they who are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah only forbids you, with regard to those who fight you for (your) Faith, and drive you out of your homes, and support (others) in driving you out, from turning to them (for friendship and protection). It is such as turn to them (in these circumstances), that do wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is only as regards those who fought against you on account of religion, and have driven you out of your homes, and helped to drive you out, that Allah forbids you to befriend them. And whosoever will befriend them, then such are the Zalimun (wrong-doers those who disobey Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah only forbids you to be guided by those who have fought against you in your religion's cause and expelled you from your homes or have supportedothers in your expulsion. Whosoever takes them as guides are harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But God prohibits you from befriending those who fought against you over your religion, and expelled you from your homes, and aided in your expulsion. Whoever takes them for friends—these are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah only forbids you from those who fight you because of religion and expel you from your homes and aid in your expulsion - [forbids] that you make allies of them. And whoever makes allies of them, then it is those who are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[60:9] God only forbids you in regard to those who waged war against you on account of religion and expelled you from your homes and supported [others] in your expulsion, that you should make friends with them (an tawallawhum is an inclusive substitution for alladhīna, ‘those who’). And whoever makes friends with them, those — they are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "662 (Allah forbideth you only those) He forbids you from having relations with those (who warred against you on account of religion) the people of Mecca (and have driven you out from your homes) Mecca (and helped to drive you out) from Mecca, (that you make friends of them) seeking their assistance and help. (Whosoever maketh friends of them) seeking their help and assistance ((All) such are wrong-doers) who harm themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لذلك نهاكم سبحانه { أَن تَوَلَّوْهُمْ } وتختلطوا معهم\n وتوالوهم\n إي: المجرمين والمعاونين { وَمَن يَتَوَلَّهُمْ } منكم بعد وورد النهي { فَأُوْلَـٰئِكَ } الموالون { هُمُ ٱلظَّالِمُونَ } [الممتحنة: 9] الخارجون عن مقتضى النهي الوارد من قِبَل الحق فيستحقون العذاب الأليم\n بسبب خروجهم عن مقتضى النهي الإلهي",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنما ينهاكم اللهُ عن } موالاة { الَّذين قاتلوكم في الدين وأَخْرَجوكم من دياركم } ، وهم عتاة أهل مكة، { وظاهَرُوا } أي: عاوَنُوا { على إِخراجكم } وهم سائر أهلها، { أن تَوَلَّوْهم }: بدل اشتمال من الموصول، والمعنى: لا ينهاكم عن مبرة مَن لم يتعرّض لكم، إنما ينهاكم عمّن أذاكم { أن تَولَّوهُم ومَن يتولهمْ فأولئك هم الظالمون } حيث وضعوا التولي في غير موضعه\n الإشارة: لا ينهاكم الله عن النفوس المطيعة، التي لم تصدكم عن السير إلى الحضرة، أن تبرُّوا بها، وترفقوا بها، إنما ينهاكم عن النفوس الفاجرة، التي قاتلتكم، وصدّتكم عن الحضرة، وأخرجتكم عن دائرة الولاية، باتباع هواها أن تولوها، وتسعوا في حظوظها وهواها، ومَن يتولها، وبقي في رِقَّها فقد ظلم نفسه وبخسها، حيث حرمها نعيمَ الحضرة\n\n\nأو: لا ينهاكم الله عن بعض العامة، التي لا مضرة فيهم، أن تبرهم بالوعظ والتذكير، وتُقسطوا إليهم بقول الإحسان، إنما ينهاكم عن أهل الإنكار المخالفين لكم، من الجبابرة الغافلين، والقراء المداهنين، والعلماء المتجبرين، والفقراء الجاهلين، أن تولوهم فإنَّ مخالطتهم سم قاتل للمريد، ومَن يتولهم لا يُفلح أبدًا\n ثم نَهَى عن رد مَن أسلم من النساء إلى أزواجهن من الكفار، فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ إِذَا جَآءَكُمُ ٱلْمُؤْمِنَاتُ مُهَاجِرَاتٍ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "60:8",
      "similarity": 0.5305050883092197
    },
    {
      "verse": "2:193",
      "similarity": 0.4866913350579343
    },
    {
      "verse": "8:39",
      "similarity": 0.4519298789638566
    },
    {
      "verse": "6:127",
      "similarity": 0.34630912827071464
    },
    {
      "verse": "48:28",
      "similarity": 0.3445429888235349
    }
  ]
}