{
  "chapter": "الصف",
  "text": "يايها الذين ءامنوا۟ هل ادلكم على تجرة تنجيكم من عذاب اليم",
  "translations": [
    {
      "translation": "You who have iman! shall I direct you to a transaction which will save you from a painful punishment?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, may I offer you a bargain which will save you from a painful punishment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, shall I direct you to a commerce that will deliver you from a grievous chastisement?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, shall I show you a bargain which will save you from the painful torment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Shall I show you a trade that can save you from the painful punishment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Shall I guide you to a trade that will save you from a painful torment\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! shall I lead you to a merchandise which may deliver you from a painful chastisement?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, shall I direct you to a commerce that shall deliver you from a painful chastisement?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Shall I show you a commerce that will save you from a painful doom?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Shall I guide you to a profitable course that will save you from a painful punishment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! shall direct you to a merchandise that will deliver you from a torment afflictive?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Shall I show you a deal that will deliver you from a painful punishment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Shall I lead you to a bargain that will save you from a grievous Penalty?-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O You who believe! Shall I guide you to a commerce that will save you from a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Shall I direct you to a commerce that will save you from a painful punishment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Shall I inform you of a trade that will save you from a painful torment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, shall I guide you to a transaction that will save you from a painful punishment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[61:10] O you who believe, shall I show you a commerce that will deliver you (read tunjīkum or tunajjīkum) from a painful chastisement? It is as if they had replied, ‘Yes’, so that He then says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe!) And He explained who they are at the beginning of the surah (Shall I show you a commerce that will save you from a painful doom) in the Hereafter?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحاه بعدما أشار إلى ظهور دين الإسلام\n وإعلاء كلمة التوحيد حثاً على المؤمنين\n وترغيباً لهم إلى ترويج الدين القويم الذي هو الصراط المستقيم\n الموصل إلى مرتبة حق اليقين: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ هَلْ أَدُلُّكمْ عَلَىٰ تِجَارَةٍ تُنجِيكُم مِّنْ عَذَابٍ أَلِيمٍ } [الصف: 10] كأنه قيل: ما التجارة المنقذة المنجية؟\n\n\nقال سبحانه: { تُؤْمِنُونَ بِٱللَّهِ وَرَسُولِهِ وَتُجَاهِدُونَ فِي سَبِيلِ ٱللَّهِ } لترويج دينه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الذين آمنوا هل أَدُلُّكُمْ على تجارةٍ تُنجِيكم من عذابٍ أليم } ، وكأنهم قالوا: وما هذه التجارة، أو: ماذا نصنع؟ فقال: { تؤمنون بالله ورسوله وتُجاهدون في سبيل الله بأموالكم وأنفُسِكم } ، وهو خبر بمعنى الأمر، أي: وجاهِدوا، وجيء به بصيغة الخبر للإيذان بوجوب الامتثال، فكأنه قد وقع، فأخبر بوقوعه، وقرىء \" تؤمنوا \" و \" تجاهدوا \" على إضمار لام الأمر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:29",
      "similarity": 0.507491517599212
    },
    {
      "verse": "25:45",
      "similarity": 0.43510783668479436
    },
    {
      "verse": "24:37",
      "similarity": 0.37571709611792303
    },
    {
      "verse": "62:11",
      "similarity": 0.37560425596913555
    },
    {
      "verse": "20:120",
      "similarity": 0.3577491445580156
    }
  ]
}