{
  "chapter": "الصف",
  "text": "سبح لله ما فى السموت وما فى الارض وهو العزيز الحكيم",
  "translations": [
    {
      "translation": "Everything in the heavens and everything in the earth glorifies Allah. He is the Almighty, the All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "ALL THAT IS in the heavens and the earth sings the praises of God. He is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and all that is on earth extols Allah's glory. He is the Most Mighty, the Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and the earth glorify God. He is the Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All whatever is in the heavens and all whatever is in the earth proclaims the Purity of Allah; and He only is the Most Honourable, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah. And He is the Almighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and whatever is in the earth declares the glory of Allah; and He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and the earth magnifies God; He is the All-mighty; the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and all that is in the earth glorifieth Allah, and He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everything in the heavens and earth glorifies God -- He is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever is in the heavens and whatsoever is in the earth halloweth Allah. And He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever there is in the heavens and the earth glorifies Allah, and He is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and on earth, let it declare the Praises and Glory of Allah: for He is the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah. And He is the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and earth exalt Allah. He is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everything in the heavens and the earth praises God. He is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and whatever is on the earth exalts Allah, and He is the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[61:1] All that is in the heavens and all that is in the earth glorifies God, that is to say, [everything] proclaims His transcendence (the lām [of li’Llāhi] is extra, and mā has been used instead of min in order to indicate the predominance [of non-rational creatures]) and He is the Mighty, in His kingdom, the Wise, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (All that is in the heavens and all that is in the earth glorifieth Allah): '(All that is in the heavens) of created beings (and all that is in the earth) of creatures and living beings (glorifieth Allah) prays to Allah; and it is also said this means: remembers Allah, (and He is the Mighty) in retribution against those who disbelieve in Him, (the Wise) in His command and decree, and He has decreed that none should be worshipped beside Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ سَبَّحَ لِلَّهِ } ونزهه بكمال التقديس والتنزيه جميع { مَا } ظهر { فِي ٱلسَّمَٰوَٰتِ } أي: العلويات { وَمَا } ظهر { فِي ٱلأَرْضِ } أي: السفليات { وَ } كيف لا يتوجه نحوه عموم الموجودات؛ إذ { هُوَ ٱلْعَزِيزُ } الغالب على مطلق المقدورات والمرادات { ٱلْحَكِيمُ } [الصف: 1] المقتن في جميع التدبيرات والتقديرات؟!\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { سَبَّح لله ما في السماوات وما في الأرض وهو العزيزُ الحكيم }\n ولمَّا قال بعضُ الصحابة: لو نعلم أحب الأعمال إلى الله لبذلنا في أموالنا، فنزلت أية الجهاد، فتباطأ بعضُهم، فنزلت: { يا أيها الذين آمنوا لِمَ تقولون ما لا تفعلون }\n وقيل: لمَّا أخبر الله بثواب شهداء بدر، فقالوا: والله لئن شَهِدنا قتالاً لنُفْرِغَنَّ فيه وُسْعَنا، ففرُّوا يوم أُحُد فنزلت\n وقيل: نزلت فيمن يمدح كذباً، حيث كان يقول: قتلتُ، ولم يقتل، وطعنتُ، ولم يطعن، وقيل: كان رجل قد آذى المسلمين يوم بدر ونكأ فيهم، فقتله صُهيب، وانتحل قتله آخر، فنزلت في المنتحِل\n أي: لأيّ شيء تقولونه من الخير والمعروف، على أنّ مدار التوبيخ إنما هو عدم فعلهم، وإنما وجّه إلى قولهم تنبيهاً على تضاعيف معصيتهم، لبيان أنَّ المنكَر ليس ترك الخير الموعود فقط، بل الوعد به أيضاً، وقد كانوا يحسبونه معروفاً، ولو قيل: لِمَ لا تفعلون ما تقولون، لفُهم منه أنّ المنكَر إنما هو ترك المفعول",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "57:1",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "59:1",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "45:37",
      "similarity": 0.6822041955188959
    },
    {
      "verse": "2:32",
      "similarity": 0.6396364558061136
    },
    {
      "verse": "37:166",
      "similarity": 0.5365534467358908
    }
  ]
}