{
  "chapter": "الصف",
  "text": "يايها الذين ءامنوا۟ كونوا۟ انصار الله كما قال عيسى ابن مريم للحوارين من انصارى الى الله قال الحواريون نحن انصار الله فـامنت طائفة منۢ بنى اسرءيل وكفرت طائفة فايدنا الذين ءامنوا۟ على عدوهم فاصبحوا۟ ظهرين",
  "translations": [
    {
      "translation": "O you who believe, be helpers of God, as Jesus, son of Mary, had said to the disciples: \"Who will help me in the way of God?\" and they had answered: \"We are the helpers of God.\" Then a section among the children of Israel believed, but a section among them did not. So We helped those who believed against their enemies, and they prevailed over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, become Allah's helpers, as Jesus, son of Mary, said to the disciples: “Who is my helper in (calling people) to Allah?” The disciples had responded by saying: “We are Allah's helpers.” Then a section of the Children of Israel believed and a section rejected the call. Thereafter We aided the believers against their enemies, and they prevailed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, be the helpers of God just as when Jesus, the son of Mary, asked the disciples, \"Who will be my helpers for the cause of God?\" and the disciples replied, \"We are the helpers of God.\" A group of the Israelites believed in him and others rejected him. We helped the believers against their enemies and they became victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Become the aides of Allah’s religion, the way Eisa the son of Maryam had said to the disciples, “Who will help me, inclining towards Allah?” The disciples said, “We are the aides of Allah’s religion” – so a group among the Descendants of Israel accepted faith and another group disbelieved; We therefore aided the believers against their enemies, so they were victorious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be you helpers (in the cause) of Allah as said `Isa, son of Maryam, to the Hawariyyin (the disciples): \"Who are my helpers (in the cause) of Allah\" The Hawariyyun said: \"We are Allah's helpers\" (i.e., we will strive in His cause!). Then a group of the Children of Israel believed and a group disbelieved. So, We gave power to those who believed against their enemies, and they became the victorious (uppermost).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! be helpers (in the cause) of Allah, as~ Isa son of Marium said to (his) disciples: Who are my helpers in the cause of Allah? The disciples said: We are helpers (in the cause) of Allah. So a party of the children of Israel believed and another party disbelieved; then We aided those who believed against their enemy, and they became uppermost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, be you God's helpers, as Jesus, Mary's son, said to the Apostles. 'Who will be my helpers unto God?' The Apostles said, 'We will be helpers of God.' And a party of the Children of Israel believed, and a party disbelieved. So We confirmed those who believed against their enemy, and they became masters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Be Allah's helpers, even as Jesus son of Mary said unto the disciples: Who are my helpers for Allah? They said: We are Allah's helpers. And a party of the Children of Israel believed, while a party disbelieved. Then We strengthened those who believed against their foe, and they became the uppermost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, be God's helpers, as Jesus, son of Mary, said to the disciples, \"Who will be my helpers in the cause of God?\" The disciples said, \"We shall be God's helpers.\" Some of the Children of Israel believed in him and some denied the truth; We supported the believers against their enemies and they triumphed over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! be Allah's helpers, even as 'Isa, son of Maryam, said Unto the disciples: who shall be my helpers Unto Allah? The disciples said: we are Allah's helpers. Then a part of the Children of Israil believed, and part disbelieved. Then We strengthened those who believed against their foe; wherefore they became triumphant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Be Allah’s helpers, just as Jesus son of Mary said to his disciples, ‘Who will be my helpers for Allah’s sake?’ The Disciples said, ‘We will be Allah’s helpers!’ So a group of the Children of Israel believed, and a group disbelieved. Then We strengthened the faithful against their enemies, and they came to prevail [over them].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Be ye helpers of Allah: As said Jesus the son of Mary to the Disciples, \"Who will be my helpers to (the work of) Allah?\" Said the disciples, \"We are Allah's helpers!\" then a portion of the Children of Israel believed, and a portion disbelieved: But We gave power to those who believed, against their enemies, and they became the ones that prevailed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be you helpers (in the Cause) of Allah as said 'Iesa (Jesus), son of Maryam (Mary), to Al-Hawariun (the disciples): \"Who are my helpers (in the Cause) of Allah?\" Al-Hawarieen (the disciples) said: \"We are Allah's helpers\" (i.e. we will strive in His Cause!). Then a group of the Children of Israel believed and a group disbelieved. So We gave power to those who believed against their enemies, and they became the uppermost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, be the helpers of Allah. When (Prophet) Jesus, the son of Mary said to the disciples: 'Who will be my helpers unto Allah' The disciples replied:'We will be the helpers of Allah' A party of the Children of Israel believed, and a party disbelieved. So, We supported those who believed against their enemy, and they overcame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Be supporters of God, as Jesus son of Mary said to the disciples, “Who are my supporters towards God?” The disciples said, “We are God's supporters.” So a group of the Children of Israel believed, while another group disbelieved. We supported those who believed against their foe, so they became dominant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, be supporters of Allah, as when Jesus, the son of Mary, said to the disciples, \"Who are my supporters for Allah?\" The disciples said, \"We are supporters of Allah.\" And a faction of the Children of Israel believed and a faction disbelieved. So We supported those who believed against their enemy, and they became dominant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[61:14] O you who believe, be helpers of God, of His religion (a variant reading [of ansāran li’Llāhi] has the genitive annexation ansāra’Llāhi) just as said (kamā qāla to the end [of the statement] means ‘just as the disciples were so’, as is indicated by [what follows]) Jesus son of Mary to the disciples, ‘Who will be my helpers unto God?’, that is to say, who [of you] will be helpers alongside me turning to help God? The disciples said, ‘We will be God’s helpers!’ [These] al-hawāriyyūn [were] the intimates of Jesus, for they were the first to believe in him. They were twelve men of pure white complexion (hawar); but it is also said that [their epithet derives from the fact that] they were bleachers (qassārūn) who bleached (yuhawwirūna) clothes. So a group of the Children of Israel believed, in Jesus, saying: ‘He is [indeed] the servant of God, [who has been] raised to heaven’, while a group disbelieved, because they said that he was the son of God, whom He had raised unto Himself. Thus the two groups waged war against one another. Then We strengthened those who believed, of the two groups, against their enemy, the disbelieving groups, and so they became the triumphant, the victors.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe) in Muhammad (pbuh) and the Qur'an! (Be Allah's helpers) be helpers to Muhammad (pbuh) against his enemies; it is also said this means: be Allah's helpers against His enemies, (even as Jesus son of Mary said unto the disciples: Who are my helpers for Allah) who are my helpers, along with Allah, against His enemies? (They said) his disciples said: (We are Allah's helpers) we are your helpers, along with Allah, against His enemies. They were 12 male disciples, the first to believe in him and help him against his enemies. All of these men were believers. (And a party of the Children of Israel believed) in Jesus the son of Mary, (while a party disbelieved) in Jesus son of Mary. This is the party that was led astray by Paul and did not believe in him. (Then We strengthened) We helped and fortified (those who believed) in Jesus the son of Mary and did not oppose his religion (against their foe) those who opposed the religion of Jesus, (and they became the uppermost) in argument against their foes because of their prayer to Allah, and it is also said because they were among those who glorified Allah'. And of the surah in which Friday is mentioned, which is all Medinan and consists of 11 verses, 180 words and 748 letters: Surah 62: The Congregation (al-Jumu'ah) And of the surah in which Friday is mentioned, which is all Medinan and consists of 1 1 verses, 180 words and 748 letters: 666\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كَمَا قَالَ عِيسَى ٱبْنُ مَرْيَمَ لِلْحَوَارِيِّينَ } الحَواريونَ: هُم صَفوةُ الأَنبياءِ عليهم السّلامُ\n\n\n\n\nوقوله تعالى: { فَأَيَّدْنَا ٱلَّذِينَ آمَنُواْ عَلَىٰ عَدُوِّهِمْ } معناه قَويناهُم عَليهِم { فَأَصْبَحُواْ ظَاهِرِينَ } معناه قَاهرونَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم: نصرة دين الله، وتقوية رسوله { كُونُوۤاْ } بأموالكم وأنفسكم { أَنصَارَ ٱللَّهِ } وأنصار رسوله، وقولوا في مقابلة نبيكم ما قال الحواريون في مقابلة عيسى عليه السلام { كَمَا قَالَ عِيسَى ٱبْنُ مَرْيَمَ لِلْحَوَارِيِّينَ } مختبراً إخلاصهم ومحبتهم، ونهاية مرتبتهم في اليقين، ودرجتهم في أعلى عليين: { مَنْ أَنَّصَارِيۤ } وأعواني في توجهي { إِلَى ٱللَّهِ } وانتشار توحيده بين أظلاله المستمدين من أظلال أوصافه وأسمائه؟\n\n\n\n\nوبعدما سمعوا منه ما سمعوا { قَالَ ٱلْحَوَارِيُّونَ } من كمال انكشافهم بالله وتوحيده، وتحققهم في مقام الشهود، وتمكنهم فيه: { نَحْنُ } الفانون في الله، الباقون ببقائه، المستغرقون بمطالعة لقائه { أَنصَارُ ٱللَّهِ } وأحباؤه؛ إذ لا مرجع لنا سواه، ولا مقصد إلا إياه\n\n\n\n\nوالحواريون هم أول من آمن بعيسى عليه السلام من الحور، وهو البياض، وهم اثنا عشر، سُموا به؛ لصفاء عقائدهم عن التردد والتلوين، وبعدما أظهر عيسى عليه السلام دعوته بين الأنام { فَآمَنَت } به عليه السلام { طَّآئِفَةٌ مِّن بَنِيۤ إِسْرَائِيلَ وَكَفَرَت } به عليه السلام { طَّآئِفَةٌ } أخرى منهم، وبعد وقوع الخلاف والاختلاف { فَأَيَّدْنَا } وغلَّبنا الطائفة { ٱلَّذِينَ آمَنُواْ } منهم { عَلَىٰ عَدُوِّهِمْ } يعني: الطائفة الذين كفروا به عليه السلام { فَأَصْبَحُواْ } وصاروا؛ أي: المؤمنون { ظَاهِرِينَ } [الصف: 14] غالبين على الكفرة بالحراب والحجة، ألا إن\n\n[المائدة: 56]؟!\n\n\n\nجعلنا الله وعموم عباده من محبيهم، ومقتفي أثرهم بمنِّه وجوده\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها الموحد المحمدي، المنجذب نحو الحق، المنخرط في سلوك أرباب التوحيد الملقَّبين بأنصار الله، المهاجرين عن كورة بقعة الناسوت نحو مدينة الوحدة اللاهوتية، وسواد أعظم الفقر - أعانك الله إلى أن تصل أقصى مرامك، وأعلى مقامك من المعرفة والتوحيد - أن تجمع همك، وتشمر ذيلك لسلوط سبيل الفناء من طريق الموت الإرادي المثمَّر للفناء المطلق عن الفناء أيضاً؛ لتفوز بالبقاء الأزلي السرمدي، ألا وهي طريقة الحضرة الختمية المحمدية، المبعوث إلى كافة البرية؛ لبيان طريق التوحيد الذاتي، المسقط لجميع الكثرات؟!\n\n\n\nفلك أن تصفي سرك وضميرك عن نقوش مطلق المعتقدات، وصور عموم الرسوم والعادات المنافية لصرافة الوحدة الذاتية، وتقتفي أثر نبيك صلى الله عليه وسلم أمثال الحواريين أثر نبيهم بلا شوب وريب؛ لينكشف لك طريق المعرفة واليقين بعد توفيق الله، وجذب من جانبه، وطول خدمته الشريفة النبوية، والنواميس المصطفوية، وإياك إياك الالتفات إلى الدنيا وما فهيا، ليمكن لك التصفية والتخلية التي هي مقدمة الكشف والشهود\n\n\n\n\nهدانا الله إلى سبيل توحيده بفضله وطوله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ظاهره تشبيه كونهم أنصاراً بقول عيسى: { مَن أنصاري إلى الله } ولكنه محمول على المعنى، أي: كونوا أنصارَ الله، كما كان الحواريون أنصارَ عيسى، حينما قال لهم: مَن أنصاري إلى الله؟ { قال الحواريون نحن أنصارُ الله } أي: نحن الذين ينصرون دينه، والحواريون: أصفياؤه، وهم أول مَن آمن به من بني إسرائيل، قاله ابن عباس، وقيل: كانوا اثني عشر رجلاً\n وحواري الرجل: صفوته وخاصته من الحَور، وهو البياض الخالص، وقيل: كانوا قصّارين يُحوِّرون الثياب، أي: يُبيّضونها، وقيل: إنما سُمُّوا حواريين لأنهم كانوا يُطهرون النفوس بإقامتهم الدين والعلم، ولمَّا كفرت اليهود بعيسى عليه السلام، وهَمُّوا بقتله، فرَّ مع الحواريين إلى النصارى بقرية يُقال لها: نصرى، فنصوره، فقاتل اليهودَ بهم مع الحواريين، وهذا معنى قوله تعالى: { فآمنت طائفةٌ من بني إسرائيل وكفرت طائفةٌ } به، فقاتلوهم { فإيَّدنا الذين آمنوا } بعيسى عليه السلام { على عدوهم } أي: قوّيناهم { فأصبحوا ظاهِرين } غالبين عليهم\n\n\nالإشارة: هل أّدلُكم على تجارةٍ، وهي سلوك طريق التربية، على أيدي الرجال، تُنجيكم من عذاب أليم، وهو غم الحجاب على الدوام تؤمنون بالله ورسوله أولاً، وتجاهدون هواكم وسائرَ العلائق بأموالكم وأنفسكم ثانياً فالأموال تدفعونها لمن يدلكم على ربكم، والأنفس تُقدمونها لمَن يُربيكم، يَتحكم فيها بما يشاء { في سبيل الله } في الطريق الموصلة إلى حضرته، { ذالكم خير لكم إن كنتم تعلمون } أي: إن كان لكم علم وعقل، فهذا خير لكم، يغفر لكم ذنوبكم، أي: يُغطي مساوئكم، فيُغطي وصفكم بصوفه، ونعتكم بنعته، فيُوصلكم بما منه إليكم، لا بما منكم إليه، ويُدخلكم جنات المعارف، تجري من تحتها أنهار العلوم، ومساكن طيبة هي السكنى والأطمئنان في مقامات اليقين، مع شهود رب العالمين، أو روح الرضا وريحان التسليم، أو الإقامة في حضرة القدس، مع التنزُّه في المقامات، في جنات عدن، وهي الرسوخ والإقامة في جنات المعارف ذلك الفوز العظيم\n { وأُخرى تحبونها } عاجلة، { نصر من الله }: عِزٌّ دائم، { وفتح قريب } هو دخول بلاد المعاني\n وقال القشيري: الفتح القريب: الرؤية والزلفة، ويقال: الشهود، ويقال: الوجود أبد الأبد\n هـ\n { وبَشِّر } بأنهم ظافرون بهذا، إن فعلوا ما أُمروا به\n وقال الورتجبي: نصر الله: تأييده الأزلي، الذي سبق للعارفين والموحِّدين، والفتح القريب: كشف نقابه وفتح أبواب وِصاله، بنصره ظهروا على نفوسهم، فقهروها وبفتحه أبواب الغيب شاهَدوا كل مغيب مستور من أحكام الربوبية وأنوار الألوهية\n هـ\n وباقي الآية يُرغب في القيام في نصر الدين، وإرشاد العباد إلى الله، حتى تظهر أنوار الدين، وتخمد ظلمة المعاصي والبِدَع من أقطار البلاد، وبالله التوفيق، وصلّى الله على سيدنا محمد وآله وسلّم\n\n",
      "translations": []
    }
  ]
}