{
  "chapter": "الصف",
  "text": "يايها الذين ءامنوا۟ لم تقولون ما لا تفعلون",
  "translations": [
    {
      "translation": "You who have iman! why do you say what you do not do?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, why do you profess what you do not practise?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, why do you profess that which you do not practise?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, why do you preach what you do not practice?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Why do you preach what you do not practice?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Why do you say that which you do not do\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! why do you say that which you do not do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, wherefore do you say what you do not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Why say ye that which ye do not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! Why do you say one thing and do another.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! wherefore say ye that which ye do not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Why do you say what you do not do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Why say ye that which ye do not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Why do you say that which you do not do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, why do you say what you never do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Why do you say what you do not do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, why do you say what you do not do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[61:2] O you who believe, why do you say, in demanding [to participate in] the struggle, what you do not do?, for you retreated at Uhud.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe) in Muhammad (pbuh) and the Qur'an! (why say ye that which ye do not?) why do you speak about that which you do not act upon? This is because they said: \"0 Messenger of Allah! If we knew the most beloved deed to Allah, we would certainly do it\". But when he informed them about the works which are dear to Him in His saying (0 ye who believe! Shall I show you a commerce that will save you from a painful doom?) whose pain extends to the hearts, they waited for as long as Allah willed, but Allah did not explain further. They then said: \"if only we knew what it is so that we give for it our wealth, persons and families\". Allah answered by saying (Ye should believe in Allah and His messenger, and should strive for the cause of Allah with your wealth and your lives...), and so Allah explained to them what to do, saying: you should be firm in your belief in Allah and His Messenger and you should also strive to obey Allah using your 664 wealth and own persons. But when they were tried in the Battle of Uhud and ran away from the battlefield, leaving the Prophet (pbuh) behind, Allah reproached them saying: why do you promise that which you cannot fulfil and why talk about that which you cannot perform?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا عاهد المسلمون مع الله عند رسول الله صلى الله عليه وسلم، وقالوا: لو علمنا أحب الأعمال إلى الله لبذلنا فيه أموالنا وأنفسنا، فنزل: { إِنَّ ٱللَّهَ يُحِبُّ ٱلَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ } [الصف: 4]، فولوا يوم أُحد منهزمين، ولم يوفوا بعهدهم، فنزلت: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم: الوفاء بالعهد { لِمَ تَقُولُونَ } وقت المعاهدة والميثاق مع الله { مَا لاَ تَفْعَلُونَ } [الصف: 2] ولا توفون وقت الوفاء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:226",
      "similarity": 0.6879071529647731
    },
    {
      "verse": "21:59",
      "similarity": 0.638953675969197
    },
    {
      "verse": "82:12",
      "similarity": 0.6294581303413066
    },
    {
      "verse": "26:19",
      "similarity": 0.6101261316492584
    },
    {
      "verse": "15:71",
      "similarity": 0.5923581142885047
    }
  ]
}