{
  "chapter": "الصف",
  "text": "ان الله يحب الذين يقتلون فى سبيله صفا كانهم بنين مرصوص",
  "translations": [
    {
      "translation": "Allah loves those who fight in His Way in ranks like well-built walls.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely God loves those who fight in His cause in full formations as though they were a compact wall.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah indeed loves those who fight in His Way as though they are a solid wall cemented with molten lead.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God loves those who fight for His cause in battlefield formations firm as an unbreakable concrete wall.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah likes those who fight in His cause, positioned in rows, as if they were an edifice fortified.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah loves those who fight in His cause in rows as if they were a solid structure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah loves those who fight in His way in ranks as if they were a firm and compact wall.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God loves those who fight in His way in ranks, as though they were a building well-compacted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah loveth them who battle for His cause in ranks, as if they were a solid structure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "surely, God loves those who fight for His cause in ranks, as if they were a solid cemented structure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah loveth those who fight in His way drown up in ranks, as though they were a structure well compacted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah loves those who fight in His way in ranks, as if they were a compact structure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly Allah loves those who fight in His Cause in battle array, as if they were a solid cemented structure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Allah loves those who fight in His Cause in rows (ranks) as if they were a solid structure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah loves those who fight in His Way lining up as if they were a stacked building.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God loves those who fight in His cause, in ranks, as though they were a compact structure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah loves those who fight in His cause in a row as though they are a [single] structure joined firmly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[61:4]   Indeed God loves, He assists and honours, those who fight for His cause in ranks (saffan is a circumstantial qualifier, in other words [understand it as] sāffīna), as if they were a solid structure, with all of its parts compacted together, firm.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then He encouraged them to strive in His way, saying: (Lo! Allah loveth those who battle for His cause) in His obedience (in ranks, as if they were a solid structure) like a cemented block.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ ٱللَّهَ يُحِبُّ ٱلَّذِينَ يُقَاتِلُونَ فِي سَبِيلِهِ صَفّاً كَأَنَّهُم بُنْيَانٌ مَّرْصُوصٌ } معناه مُنْظَمٌ بعضهُ إلى بَعض\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Indeed, Allah loves those who fight in His cause in a orderly manner, as if they were a solid structure.\" This means that they are well-organized with each other.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّ الله يحب الذين يقاتلون في سبيله صفّاً } لأن بذل النفس في سبيل الله لا يكون إلا عند خلوص النفس في محبة الله إذ المرء إنما يحب كل ما يحب من دون الله لنفسه\n فأصل الشرك ومحبة الأنداد محبة النفس فإذا سمح بالنفس كان غير محب لنفسه وإذا لم يحب نفسه فبالضرورة لم يحب شيئاً من الدنيا وإذا كان بذله للنفس في الله وفي سبيله لا للنفس كما قال: \" ترك الدنيا للدنيا \" \n كانت محبة الله في قلبه راجحة على محبة كل شيء فكان من الذين قال فيهم:\n[البقرة\n الآية:56]\n وإذا كانوا كذلك يلزم محبة الله إياهم لقوله:\n[المائدة\n الآية:54]\n وبالحقيقة لا تكون محبة الله إلا منه\n { فلما زاغوا } عن مقتضى علمهم لفرط الهوى وحب الدنيا { أزاغ الله قلوبهم } عن طريق الهدى وحجبهم عن نور الكمال لإقبالهم على الجهة السفلية وميلهم عن مقتضى الفطرة الأصلية { والله لا يهدي القوم الفاسقين } الخارجين عن مقتضى الفطرة التي هي الدين القيم إلى نور الكمال لزوال الاستعداد وعدم القابل\n { ومن أظلم ممن افترى على الله الكذب } إذ وضع نوره في الظلمة وصرف بضاعة البقاء\n أي: الاستعداد الفطري في متاع الفناء مع وجود الداعي الخارجي الذي هو النبي إلى الإسلام الذي هو مقتضى ذلك النور الأصلي { والله لا يهدي } الموصوفين بهذه الصفة إلى النور الكمالي أي: نور ذاته وسبحات وجهه لما ذكر في الفاسقين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وإعلاء كلمة توحيده { صَفّاً } مصطفين مظاهرين\n متعاونين { كَأَنَّهُم بُنْيَانٌ مَّرْصُوصٌ } [الصف: 4] منمضد محكم\n مضمم بعضها مع بعض بحيث لا فرج فيها ولا شقوق\n\n\nثمَّ اعلموا أن عدم وفائكم بالعهود لا ينقص شيئاً من عظمته\n كما أن وفائكم لا تزيد فيها\n لكن نقضكم الميثاق يؤذي النبي\n وإيذاء النبي مستلزم لإيذاء الله وبغضه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وهو المقصود بالذات من السورة وقوله: { صفًّا } أي: صافِّين أنفسهم\n أو مصفوفين\n مصدر وقع موقع الحال\n { كأنهم بُنيان مرصُوص } لاصق بعضه ببعض\n وقيل: أريد: استواء نيّاتهم في حرب عدوّهم\n حتى يكونوا في اجتماع الكلمة كالبنيان الذي رُصَّ بعضه إلى بعض\n وهو حالٌ أيضاً\n أي: مشبّهين بالبنيان الملاصق\n قال ابن عرفة: التشبيه في الثبات وعدم الفرار كثبوت البناء ولزومه\n هـ\n الإشارة: { سَبَّحَ لله } \n قال الورتجبي: لمَّا عاينوا آيات الله طلبوا فيها مشاهدة الله\n فوجدوا في نفوسهم تأثير مباشرة نور قدرة الله\n فقدَّسُوه أنه باين بوجوده من الحدثان\n هـ\n قوله تعالى: { كَبُرَ مقتًا }\n\n\n الخ\n قال القشيري: خُلفُ الوعد مع كلِّ أحدٍ قبيحٌ\n ومع الله أقبح\n ويُقال: إظهارُ التجلُّدِ من غير شهودِ مواضعَ الفقر إلى الحقِّ في كل نَفَسٍ يؤذِنُ بالبقاء مع ما حصل به الدعوى\n واللهُ يحب التبرِّي من الحول والقوة\n\nويقال: لم يتوعَّد على زَلَّةٍ بمثْلِ ما توعَّد على هذا\n بقوله: { كَبُرَ مقتًا عند الله }\n هـ\n ولذا فرّ كثير من العلماء عن الوعظ والتذكير\n وآثروا السكوت\n كما قال بعضهم:\nقال أبو زيد الثعالبي: وهذا إن وَجد مَن يكفيه ويقوم عنه في الوعظ\n وإلاّ فلا ينبغي السكوت\n قال الباجي في سنن الصالحين\n عن الأصمعي: بلغني أنَّ بعض الحُكماء كان يقول: إني لأعظكم\n وإني لكبير الذنوب\n ولو أنَّ أحداً لا يعظ أخاه حتى يُحْكِم أمرَ نفسه لتُرك الأمر بالخير\n واقتُصر على الشر\n ولكن محادثة الإخوان حياة القلوب وجلاء النفوس\n وتذكير مِن النسيان\n وقال أبو حازم: إني لأعظ الناسَ\n وما أنا بموضع الوعظ\n ولكن أُريد به نفسي\n هـ\n قلت: وكان شيخ شيوخنا سيدي على الجمل العمراني رضي الله عنه يقول حين يُذَكِّر: نحْن ما ننبَحُ إلاّ على نفوسنا\n هـ\n ثم قال: وقال الحسن لِمطرف: عِظ أصحابك\n فقال: أخاف أنْ أقولَ ما لا أفعل\n فقال: يرحمك الله\n وأيّنا يفعل ما يقول\n ودّ الشيطانُ لو ظفر منكم بهذه\n فلم يأمر أحدٌ منكم بمعروف ولم ينهَ عن منكر\n هـ\n وفي حديث الجامع:\n \" مُروا بالمعروف وإنْ لم تَفعلُوه\n وانْهَوْا عن المنكرِ وإن لم تَتجنبُوه \" \nوقال الغزالي: مَن ترك العمل خوف الآفة والرياء فإنَّ ذلك منتهى بغية الشيطان منه إذ المراد منه ألاَّ يفوته الإخلاص\n ومهما ترك العمل فقد ضيَّع العمل والإخلاص\n هـ\n قلت: ولا شك أنَّ الوعظ مِن المخلصين وأهل القلوب\n أشد تأثيراً من غيرهم\n فإنَّ الكلامَ إذا خرج من القلب وقع في القلب\n وإذا خرج من اللسان حدّه الآذان\n وفي الحِكَم: \" تسبق أنوارُ الحكماء أقوالَهم\n فحيث ما صار التنوير وصل التعبير \"\n فأهل النور تسري أنوارُهم في الجالسين قبل أن يتكلموا\n وربما انتفع الناسُ بصمتهم\n كما ينتفعون بكلامهم\n وأمّا أهل الظُلمة ـ وهو مَن في قلبه حُب الدنيا ـ فكلامهم قليل الجدوى\n تسبق ظلمةُ قلوبهم إلى قلوب السامعين\n فلا ينتفع إلاّ القليل\n ثم ذكر مساوىء اليهود والنصارى\n بسبب جُبْنهم وسوء أدبهم\n حين أُمروا بالجهاد\n وبفكرهم بعد ظهور الحق\n تحذيراً مما صنعوا\n فقال: { وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ يٰقَوْمِ لِمَ تُؤْذُونَنِي }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:165",
      "similarity": 0.13548148984605501
    },
    {
      "verse": "37:1",
      "similarity": 0.13474265253294695
    },
    {
      "verse": "89:22",
      "similarity": 0.13364056478527991
    },
    {
      "verse": "78:38",
      "similarity": 0.12669314713673793
    },
    {
      "verse": "24:41",
      "similarity": 0.1266737125755329
    }
  ]
}