{
  "chapter": "الصف",
  "text": "ومن اظلم ممن افترى على الله الكذب وهو يدعى الى الاسلم والله لا يهدى القوم الظلمين",
  "translations": [
    {
      "translation": "Who could do greater wrong than someone who invents a lie against Allah when he has been called to Islam? Allah does not guide wrongdoing people.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more unjust than he who invents a lie against God when he is called to submit? God does not show the evil-doers the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who would be more unjust than he who invents a lie about Allah the while he is being called to Islam? Allah does not direct such evildoing folk to the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more unjust than one who creates falsehood against God when he has already been invited to Islam? God does not guide the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than one who fabricates a lie against Allah whereas he is being called towards Islam? And Allah does not guide the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than the one who invents a lie against Allah, while he is being invited to Islam And Allah guides not the people who are wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than he who forges a lie against Allah and he is invited to Islam, and Allah does not guide the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does greater evil than he who forges against God falsehood, when he is being called unto surrender? And God guides never the people of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who doeth greater wrong than he who inventeth a lie against Allah when he is summoned unto Al-Islam? And Allah guideth not wrongdoing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who could be more wicked than one who invents lies about God when called to submit to Him? God does not guide the wrongdoers:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is a greater wrong-doer than he who fabricateth against Allah a lie even as he is summoned Unto Islam? And Allah guideth not a wrongdoing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is a greater wrongdoer than him who fabricates falsehoods against Allah, while he is being summoned to Islam? And Allah does not guide the wrongdoing lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who doth greater wrong than one who invents falsehood against Allah, even as he is being invited to Islam? And Allah guides not those who do wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than the one who invents a lie against Allah, while he is being invited to Islam? And Allah guides not the people who are Zalimun (polytheists, wrong-doers and disbelievers) folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does greater evil than he who forges a lie against Allah, when he is being called to Islam? Allah does not guide the harmdoing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is a greater wrongdoer than he who attributes falsehoods to God, when he is being invited to Islam? God does not guide the wrongdoing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than one who invents about Allah untruth while he is being invited to Islam. And Allah does not guide the wrongdoing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[61:7] And who does — that is to say, none does — greater wrong than he who invents lies against God, by ascribing a partner and a child to Him and describing His signs as being sorcery, when he is [actually] being summoned to submission [to God]? And God does not guide the wrongdoing folk, the disbelieving [folk].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَنْ أَظْلَمُ مِمَّنِ افْتَرَى عَلَى اللَّهِ الْكَذِبَ وَهُوَ يُدْعَى إِلَى الْإِسْلَامِ وَاللَّهُ لَا يَهْدِي الْقَوْمَ الظَّالِمِينَ (7)كانت دعوة النبي صلى الله عليه وسلم مماثلة دعوة عيسى عليه السّلام وكان جواب الذين دعاهم إلى الإِسلام من أهل الكتابين والمشركين مماثلاً لجواب الذين دعاهم عليه السّلام . فلما أدمج في حكاية دعوة عيسى بشارته برسول يأتي من بعده ناسب أن ينقل الكلام إلى ما قابل به قوم الرسول الموعود دعوة رسولهم فلذلك ذكر في دعوة هذا الرسول دين الإِسلام فوصفوا بأنهم أظلم الناس تشنيعاً لحالهم .فالمراد من هذا الاستفهام هم الذين كذبوا النبي صلى الله عليه وسلم ولذلك عطف هذا الكلام بالوَاو ودون الفاء لأنه ليس مفرعاً على دعوة عيسى عليه السلام .وقد شمل هذا التشنيع جميع الذين كذبوا دعوة النبي صلى الله عليه وسلم من أهل الكتابين والمشركين .والمقصود الأول هم أهل الكتاب ، وسيأتي عند قوله تعالى : { يريدون ليطفئوا نور الله } إلى قوله : { ولو كره المشركون } \\[ الصف : 8 ، 9 \\] فهما فريقان .والاستفهام ب { من أظلم } إنكار ، أي لا أحد أظلم من هؤلاء فالمكذبون مِن قبلهم ، إما أن يكونوا أظلم منهم وإمّا أن يساووهم على كل حال ، فالكلام مبالغة .وإنما كانوا أظلم الناس لأنهم ظلموا الرسول صلى الله عليه وسلم بنسْبِته إلى ما ليس فيه إذ قالوا : هو ساحر ، وظلموا أنفسهم إذ لم يتوخوا لها النجاة ، فيعرضوا دعوة الرسول صلى الله عليه وسلم على النظر الصحيح حتى يعلموا صدقه ، وظلموا ربهم إذ نسبوا ما جاءهم من هديه وحجج رسوله صلى الله عليه وسلم إلى ما ليس منه فسموا الآيات والحجج سحراً ، وظلموا الناس بحملهم على التكذيب وظلموهم بإخفاء الأخبار التي جاءت في التوراة والإِنجيل مُثبتة صدق رسول الإِسلام صلى الله عليه وسلم وكمل لهم هذا الظلم بقوله تعالى : { والله لا يهدي القوم الظالمين } ، فيعلم أنه ظلم مستمر .وقد كان لجملة الحال { وهو يدعى إلى الإسلام } موقع متين هنا ، أي فعلوا ذلك في حين أن الرسول يدعوهم إلى ما فيه خيرهم فعَاضوا الشكر بالكفر .وإنما جُعل افتراؤهم الكذب على الله لأنهم كذبوا رسولاً يخبرهم أنه مرسل من الله فكانت حُرمة هذه النسبة تقتضي أن يُقبلوا على التأمل والتدبر فيما دعاهم إليه ليصلوا إلى التصديق ، فلما بادروها بالإِعراض وانتحلوا للداعي صفات النقص كانوا قد نسبوا ذلك إلى الله دون توقير .فأما أهل الكتاب فجحدوا الصفات الموصوفة في كتابهم كما قال تعالى فيهم { ومن أظلم ممن كتم شهادة عنده من الله } في سورة \\[ البقرة : 140 \\] . وذلك افتراء .وأما المشركون فإنهم افتروا على الله إذ قالوا : { ما أنزل الله على بشر من شيء } \\[ الأنعام : 91 \\] .واسم { الإسلام } عَلم للدين الذي جاء به النبي صلى الله عليه وسلم وهو جامع لما فيه خير الدنيا والآخرة فكان ذكر هذا الاسم في الجملة الحالية زيادة في تشنيع حال الذين أعرضوا عنه ، أي وهو يُدعى إلى ما فيه خيره وبذلك حق عليه وصف { أظلم } .وجملة { والله لا يهدي القوم الظالمين } تأييس لهم من الإِقلاع عن هذا الظلم ، أي أن الذين بلغوا هذا المبلغ من الظلم لا طمع في صلاحهم لتمكُن الكفرِ منهم حتى خالط سجاياهم وتقوّم مع قوميتهم ، ولذلك أقحم لفظ { القوم } للدلالة على أن الظلم بلغ حدَّ أن صار من مقومات قَوميتهم كما تقدم في قوله تعالى : { لآيات لقوم يعقلون } في سورة \\[ البقرة : 164 \\] . وتقدم غير مرة .وهذا يعم المخبر عنهم وأمثالهم الذين افتروا على عيسى ، ففيها معنى التذييل .وأسند نفي هديهم إلى الله تعالى لأن سبب انتفاء هذا الهدي عنهم أثر من آثار تكوين عقولهم ومداركهم على المكابرة بأسباب التكوين التي أودعها الله في نظام تكوّن الكائنات وتطورها من ارتباط المسببات بأسبابها مع التنبيه على أن الله لا يتدارك أكثرهم بعنايته ، فمُغَيِّر فيهم بعض القوى المانعة لهم من الهدى غضباً عليهم إذ لم يخلفوا بدعوة تستحق التبصر بسبب نسبتها إلى جانب الله تعالى حتى يتميز لهم الصدق من الكذب والحق من الباطل .\n\n",
      "translations": [
        {
          "translation": "(And who doth greater wrong) in his state of disbelief (than he who inventeth a lie against Allah) by ascribing to Him sons and partners (when he is summoned unto al-Islam) when he is summoned to believe in Allah's divine Oneness. The reference here is to the Jews whom the Prophet (pbuh) invited to embrace the profession of Allah's divine Oneness. (And Allah guideth not wrong-doing folk) He guides not to His religion those Jews whom He knew in His preeternal knowledge that they will die as Jews.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَنْ أَظْلَمُ } وأشد خروجاً عن مقتضى الحدود الإلهية { مِمَّنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ } الحكيم المتقن في أفعاله { ٱلْكَذِبَ } ونسب ما أنزله سبحانه من المعجزات الدالة على صدق رسوله المؤيد من عنده بالنفس القدسية\n والمبعوث إلى الناس\n ليرشدهم إلى طريق توحيده { وَ } الحال أنه { هُوَ } أي: المفتري الظالم { يُدْعَىٰ إِلَى ٱلإِسْلاَمِ } المتقدس عن جميع الآثام لو قَبِلَه وصدَّقه\n وامتثل بما فيه من الأوامر والنواهي\n وهو من غاية عتوه وعناده في موضع الإجابة والقبول يرده ويكذبه\n ونيسب معجزات الداعي إلى السحر والشعبذة مراءً وافتراءً { وَ } بالجملة: { ٱللَّهُ } المطلع على ما في استعدادات عباده { لاَ يَهْدِي ٱلْقَوْمَ ٱلظَّالِمِينَ } [الصف: 7] الخارجين عن مقتضى الفطرة الأصلية الإلهية التي فطر الناس عليها\n ذلك الدين القيم\n ولكن أكثر الناس لا يعلمون\n لذلك يخرجون\n\n\nوليس غرضهم من هذا الافتراء والتكذيب بعد وضوح ظهور الحجج الواضحة\n والبراهين الساطعة إلاَّ أنهم { يُرِيدُونَ } بفتنتهم هذه { لِيُطْفِئُواْ نُورَ ٱللَّهِ } الواحد الأحد الصمد\n المتشعشع من مطالع عموم الكائنات\n ومشارق جميع الذرات\n ألا وهو دين الإسلام المنزل على خير الأنام",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومَن أظلمُ ممن افترى على الله الكذبَ وهو يُدْعَى إِلى الإِسلام } أي: أيّ الناس أشد ظلماً ممن يُدْعى إلى سعادة الدارين\n فيضع موضع الإجابة الافتراءَ على الله عزّ وجل\n بقوله لكلامه الذي دعا عباده إلى الحق: هذا سحر؟ أي: هو أظلم من كل ظالم\n { واللهُ لا يهدي القومَ الظالمين } أي: لا يُرشدهم إلى ما فيه صلاحهم لعدم توجههم إليه\n { يُريدون لِيُطفئوا نورَ الله بإفواههم } أي: دينه أو: كتابه\n أو حجته النيِّرة\n واللام مزيدة\n أي: يُريدون إطفاءَ نور الله\n أو للتعليل والمفعول محذوف\n أي: يريدون الكذب ليُطفئوا نورَ الله\n وهو تهكُّم بهم في إرادتهم إبطال الإسلام\n بقولهم في القرآن: هذا سحر\n مُثِّلت حالهم بحال مَن ينفخ في نور الشمس بفيه ليطفئه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:94",
      "similarity": 0.6684881265071124
    },
    {
      "verse": "16:105",
      "similarity": 0.6049687337318201
    },
    {
      "verse": "16:87",
      "similarity": 0.5732613105296529
    },
    {
      "verse": "6:21",
      "similarity": 0.5222724775460199
    },
    {
      "verse": "23:38",
      "similarity": 0.5145599415520535
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/061007.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/061007.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/61:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}