{
  "chapter": "الصف",
  "text": "هو الذى ارسل رسوله بالهدى ودين الحق ليظهره على الدين كله ولو كره المشركون",
  "translations": [
    {
      "translation": "It is He who sent His Messenger with guidance and the Deen of Truth to exalt it over every other deen, though the idolaters hate it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sent His Apostle with the guidance and the true way to raise it above all faiths, however the idolaters may dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who has sent forth the Messenger with the Guidance and the True Religion that He may make it prevail over all religion, however those that associate aught with Allah in His Divinity might dislike this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent His Messenger with guidance and the true religion to stand supreme over all religions, even though the pagans may dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has sent His Noble Messenger with guidance and the religion of truth, in order that He may make it prevail over all other religions, even if the polytheists get annoyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who has sent His Messenger with guidance and the religion of truth to make it victorious over all religions even though idolators hate (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sent His Apostle with the guidance and the true religion, that He may make it overcome the religions, all of them, though the polytheists may be averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent His Messenger with the guidance and the religion of truth, that he may uplift it above every religion, though the unbelievers be averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who hath sent His messenger with the guidance and the religion of truth, that He may make it conqueror of all religion however much idolaters may be averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it is He who has sent His Messenger with guidance and the true religion, so that He may cause it to prevail over all religions, however much the polytheists may dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who hath sent His apostle with the guidance and the true religion, that He may make it triumph over all religion, even though averse may be associaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent His Apostle with guidance and the true religion that He may make it prevail over all religions though the polytheists should be averse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has sent His Messenger with Guidance and the Religion of Truth, that he may proclaim it over all religion, even though the Pagans may detest (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who has sent His Messenger (Muhammad SAW) with guidance and the religion of truth (Islamic Monotheism) to make it victorious over all (other) religions even though the Mushrikun (polytheists, pagans, idolaters, and disbelievers in the Oneness of Allah and in His Messenger Muhammed SAW) hate (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent His Messenger with guidance and the Religion of Truth, so that He raises it above all religions, much as the unbelievers dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sent His Messenger with the guidance and the true religion, to make it prevail over all religions, even though the idolaters dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sent His Messenger with guidance and the religion of truth to manifest it over all religion, although those who associate others with Allah dislike it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[61:9] It is He Who has sent His Messenger with the guidance and the religion of truth, that He may make it prevail, that He may raise it, over all [other] religions, [over] all the religions which oppose it, though the disbelievers be averse, to this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَى وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ (9)هذا زيادة تحدِّ للمشركين وأحلافهم من أهل الكتاب فيه تقوية لمضمون قوله : { والله متم نوره ولو كره الكافرون } \\[ الصف : 8 \\] . وفيه معنى التعليل للجملة التي قبله . فقد أفاد تعريفُ الجزأيْن في قوله : { هو الذي أرسل رسوله } قصراً إضافياً لقلببِ زَعْم الكافرين أن محمّداً صلى الله عليه وسلم أتى من قِبَللِ نفسه ، أي الله لا غيره أرسل محمداً صلى الله عليه وسلم بالهدى ودين الحق . وأن شيئاً تولى الله فعله لا يستطيع أحد أن يزيله .وتعليل ذلك بقوله : { ليظهره على الدين كله } إعلام بأن الله أراد ظهور هذا الدين وانتشاره كيلا يطمعوا أن يناله ما نال دين عيسى عليه السّلام من القمع والخفت في أول أمره واستمر زماناً طويلاً حتى تنصَّر قسطنطينُ سلطانُ الروم ، فلما أخبر الله بأنه أراد إظهار دين الإِسلام على جميع الأديان عُلم أن أمره لا يزال في ازدياد حتى يتمّ المراد .والإِظهار : النصر ويطلق على التفضيل والإِعلاء المعنوي .والتعريف في قوله : { على الدين } تعريف الجنس المفيد للاستغراق ، أي ليعلي هذا الدين الحق على جميع الأديان وينصر أهله على أهل الأديان الأخرى الذين يتعرضون لأهل الإسلام .ويظهر أن لفظ { الدين } مستعمل في كلا معنييه : المعنى الحقيقي وهو الشريعة . والمعنى المجازي وهو أهل الدّين كما تقول : دخلت قرية كذا وأكرمتني ، فإظهار الدين على الأديان بكونه أعلى منها تشريعاً وآداباً ، وأصلح بجميع الناس لا يخص أمة دون أخرى ولا جيلاً دون جيل .وإظهار أهله على أهل الأديان بنصر أهله على الذين يشاقُّونهم في مدة ظهوره حتى يتمّ أمره ويستغني عمن ينصره .وقد تمّ وعد الله وظهر هذا الدين وملك أهله أمماً كثيرة ثم عرضت عوارض من تفريط المسلمين في إقامة الدين على وجهه فغلبت عليهم أمم ، فأمّا الدين فلم يزل عالياً مشهوداً له من علماء الأمم المنصفين بأنه أفضل دين للبشر .وخص المشركون بالذكر هنا إتماماً للذين يكرهون إتمام هذا النور ، وظهور هذا الدين على جميع الأديان . ويعلم أن غير المشركين يكرهون ظهور هذا الدين لأنهم أرادوا إطفاء نور الدين لأنهم يكرهون ظهور هذا الدين فحصل في الكلام احتباك .\n\n",
      "translations": [
        {
          "translation": "(He it is Who hath sent His messenger) Muhammad (pbuh) (with the guidance) with the message of Allah's divine Oneness; and it is also said this means: with the Qur'an (and the religion of truth) the testification that there is no deity except Allah, (that He may make it conqueror of all religion) such that the Hour will not come except that people are either among the Muslims or among those who pay the capitation tax to the 665 Muslims (however much idolaters may be averse) even though the Jews, Christians and Pagan Arabs dislike its happening.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأيده { بِٱلْهُدَىٰ } والقرآن العظيم { وَدِينِ ٱلْحَقِّ } والملة الحنيفية السمحة البيضاء المورودة له من جده إبراهيم { لِيُظْهِرَهُ } ويغلبه\n أي: الدين القويم\n المبين لصراط الحق وطرق توحيده الذاتي { عَلَى ٱلدِّينِ كُلِّهِ } أي: على عموم الملل والأديان الواردة\n لبيان توحيد الصفات والأفعال { وَلَوْ كَرِهَ ٱلْمُشْرِكُونَ } [الصف: 9] ظهور توحيد الحق\n لما فيه من طقع عرق الشرك جلياً كان أو خفياً؟!",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أو بالهداية { ودين الحق } الملة الحنيفية { ليُظهره على الدين كلِّه } أي: ليعليه على جميع الأديان المخالفة له ولقد أنجز الله ـ عزّ وعلا ـ وعده\n حيث جعله بحيث لم يبقَ دين من الأديان إلاَّ وهو مغلوب مقهور بدين الإسلام\n وعن مجاهد: إذا نزل عيسى لم يكن إلا دين الإسلام\n هـ\n { ولو كَرِه المشركون } ذلك\n قال الطيبي: قوله تعالى: { ومَن أظلم\n\n\n } الخ\n حذَّر تعالى مما لقي قوم موسى من إزاغة القلوب\n والحرمان من التوفيق\n بسبب الأذى\n وما ارتكب قوم عيسى بعد مجيئه بالبينات من تكذيبه وقولهم فيه: \" هذا سحر مبين \" \n ألاَ ترى كيف جمع الكل في قوله: { ومن أظلم\n\n\n } الآية\n قال: وقضية الدعوة إلى الإسلام توقير مَن يدعو إليه\n وإجابة دعوته\n ثم قال: وأمّا قوله: { والله لا يهدي القوم الظالمين } هو تذييل لقوله: { ومَن أظلم ممن أفترى\n\n\n } الآية لأنّ الظلم هو: وضع الشيء في غير محله\n وأيُّ ظلم أعظم من جعل إجابة الداعي إلى الله مفترياً؟! والكفر: التغطية ومحاولة إطفاء النور إخفاء وتغطية\n ودين الحق هو التوحيد\n والشركُ يقابله\n ولذلك قال: { ولو كره المشركون }\n هـ\n الإشارة: سوء الأدب مع الأكابر\n وإذايتهم\n سبب كل طرد وبُعد\n وسبب كلّ ذُل وهوان\n وحسن الأدب معهم وتعظيمهم\n سبب كُلِّ تقريب واصطفاء\n وسبب كُلِّ عز ونصر\n ولذلك قال الصوفية: \" اجعل عَمَلك مِلحًا\n وأدبك دقيقًا \"\n\nألآ ترى بنى إسرائيل حين أساؤوا الأدب مع نبي الله موسى بقولهم:\n[المائدة:24] الخ كيف أذلَّهم الله وأخزاهم إلى يوم القيامة\n وانظر أصحابَ نبينا صلى الله عليه وسلم حيث تأدّبوا غاية الأدب\n وقالوا يوم بدر: \" لا نقول كما قالت بنو إسرائيل: اذهب أنت وربك\n ولكن اذهب أنت وربك ونحن معك\n والله لو خُضت بنا ضحضاح البحر لخضناه معك \" كيف أعزَّهم الله ونصرهم على سائر الأديان\n ببركة حُسن أدبهم ـ رضي الله عنهم وأرضاهم\n ثم حضَّ على الجهاد المقصود بالذات\n فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ هَلْ أَدُلُّكمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:33",
      "similarity": 0.9999999999999999
    },
    {
      "verse": "40:14",
      "similarity": 0.5313169244601592
    },
    {
      "verse": "48:28",
      "similarity": 0.5256538562132217
    },
    {
      "verse": "9:48",
      "similarity": 0.5241700615013766
    },
    {
      "verse": "10:82",
      "similarity": 0.5009229619654544
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/061009.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/061009.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/61:9.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}