{
  "chapter": "الجمعة",
  "text": "واذا راوا۟ تجرة او لهوا انفضوا۟ اليها وتركوك قائما قل ما عند الله خير من اللهو ومن التجرة والله خير الرزقين",
  "translations": [
    {
      "translation": "But when they see a chance of trade or entertainment they scatter off to it and leave you standing there. Say: 'What is with Allah is better than trade or entertainment. Allah is the Best of Providers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when they see some buying and selling, or some sport, they go for it, leaving you standing. Tell them: \"What is with God is better than your sport and commerce. And God is the best of providers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet no sooner than they saw some trading or amusement, they flocked to it and left you standing by yourself. Tell them: “That which is with Allah is far better than amusement and trading. Allah is the Best Provider of sustenance.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they see some merchandise or some sport, they rush towards it and leave you alone standing. Say, \"(God's rewards for good deeds) are better than merriment or merchandise; God is the best Sustainer\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they see some trade or sport, they move towards it and leave you standing delivering the sermon; proclaim, “That which is with Allah, is better than sport and trade; and the sustenance of Allah is the best.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they see some merchandise or some amusement, they disperse headlong to it, and leave you standing. Say: \"That which Allah has is better than any amusement or merchandise! And Allah is the best of providers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they see merchandise or sport they break up for It, and leave you standing. Say: What is with Allah is better than sport and (better) than merchandise, and Allah is the best of Sustainers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they see merchandise or diversion they scatter off to it, and they leave thee standing. Say: 'What is with God is better than diversion and merchandise. God is the best of providers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they spy some merchandise or pastime they break away to it and leave thee standing. Say: That which Allah hath is better than pastime and than merchandise, and Allah is the Best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when they see some merchandise or entertainment, they break away to go to it and leave you standing. Say, \"That which God has in store is far better than any merchandise or entertainment.\" God is the most munificent Giver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they beheld merchandise or sport, they flocked thereto, and left thee standing. Say thou: that which is with Allah is better than sport and better than merchandise; and Allah is the Best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they sight a deal or a diversion, they scatter off towards it and leave you standing! Say, ‘What is with Allah is better than diversion and dealing, and Allah is the best of providers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they see some bargain or some amusement, they disperse headlong to it, and leave thee standing. Say: \"The (blessing) from the Presence of Allah is better than any amusement or bargain! and Allah is the Best to provide (for all needs).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they see some merchandise or some amusement [beating of Tambur (drum) etc.] they disperse headlong to it, and leave you (Muhammad SAW) standing [while delivering Jumu'ah's religious talk (Khutbah)]. Say \"That which Allah has is better than any amusement or merchandise! And Allah is the Best of providers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when they see some commerce or amusement they flock to it, leaving you standing. Say: 'That which is with Allah is better than the amusement and commerce. Allah is the Best of Providers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet whenever they come across some business, or some entertainment, they scramble towards it, and leave you standing. Say, “What is with God is better than entertainment and business; and God is the Best of providers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they saw a transaction or a diversion, [O Muhammad], they rushed to it and left you standing. Say, \"What is with Allah is better than diversion and than a transaction, and Allah is the best of providers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[62:11] On one occasion the Prophet (s) was delivering the Friday sermon when a caravan arrived and so, as was the custom, drums were beaten to announce its arrival, whereat the people began to leave the mosque [to go to it], all except for twelve men. The following [verse] was then revealed: But when they sight some [opportunity for] business or a diversion, they scatter off towards it, that is, towards the business, since it is what they seek more than diversion, and leave you, during the sermon, standing. Say: ‘That which is with God, in the way of reward, is better, for those who believe, than diversion and commerce. And God is the best of providers’. They say that every person ‘provides for’ (yarzuqu) his dependants, [by which they mean that such a person does so] by means of the provision given by God (min rizqi’Llāhi), exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَإِذَا رَأَوْا تِجَارَةً أَوْ لَهْوًا انْفَضُّوا إِلَيْهَا وَتَرَكُوكَ قَائِمًا قُلْ مَا عِنْدَ اللَّهِ خَيْرٌ مِنَ اللَّهْوِ وَمِنَ التِّجَارَةِ وَاللَّهُ خَيْرُ الرَّازِقِينَ (11)عطف على جملة { إذا نودي للصلاة من يوم الجمعة فاسعوا إلى ذكر الله } \\[ الجمعة : 9 \\] الآية . عُطف التوبيخ على ترك المأمور به بعد ذكر الأمر وسُلكت في المعطوفة طريقة الالتفات لخطاب النبي صلى الله عليه وسلم إيذاناً بأنهم أحرياء أن يصرف للخطاب عنهم فحرموا من عز الحضور . وأخبر عنهم بحال الغائبين ، وفيه تعريض بالتوبيخ .ومقتضى الظاهر أن يقال : وإذا رأيتم تجارة أو لهواً فلا تنفضّوا إليها . ومن مقتضيات تخريج الكلام على خلاف مقتضى الظاهر هنا أن يكون هذا التوبيخ غير شامل لجميع المؤمنين فإن نفراً منهم بَقُوا مع النبي صلى الله عليه وسلم حين خطبته ولم يخرجوا للتجارة ولا للهو .وفي «الصحيح» عن جابر بن عبد الله قال : «بينما نحن نصلّي مع النبي صلى الله عليه وسلم وهو يخطب يوم الجمعة إذْ أقبلتْ عير من الشام تحمل طعاماً فانفتل الناس إليها حتى لم يبق مع النبي صلى الله عليه وسلم إلا اثنا عشر رجلاً أنا فيهم» . وفي رواية : وفيهم أبو بكر وعمر ، فأنزل الله فيهم هذه الآية التي في الجمعة { وإذا رأوا تجارة أو لهواً انفضوا إليها وتركوك قائماً } اه . وقد ذكروا في روايات أخرى أنه بقي مع النبي صلى الله عليه وسلم أبو بكر ، وعمر ، وعثمان ، وعلي ، وطلحة ، والزبير ، وسعد بن أبي وقاص ، وعبد الرحمان بن عوف ، وأبو عبيدة بن الجراح ، وسعيد بن زيد ، وبلال ، وعبد الله بن مسعود ، وعمار بن ياسر ، وجابر بن عبد الله ، فهؤلاء أربعة عشر . وذكر الدارقطني في حديث جابر : «أنه قال ليس مع رسول الله صلى الله عليه وسلم إلا أربعون رجلاً» .وعن مجاهد ومقاتل : «كان النبي صلى الله عليه وسلم يخطب فقدم دِحية بن خليفة الكلبي بتجارة فتلقاه أهله بالدفوف فخرج الناس» . وفي رواية «أن أهل المدينة أصابهم جوع وغلاء شديد فقدم دحية بتجارة من زيت الشام» . وفي رواية «وطعام وغير ذلك فخرج الناس من المسجد خشية أن يُسبقوا إلى ذلك» . وقال جابر بن عبد الله «كانت الجواري إذا نَكحن يمرّرن بالمزامير والطَّبْل فانفضّوا إليها» ، فلذلك قال الله تعالى : { وإذا رأوا تجارة أو لهواً انفضوا إليها وتركوك قائماً } ، فقد قيل إن ذلك تكرر منهم ثلاث مرات ، فلا شك أن خروجهم كان تارة لأجل مجيء العِير وتارة لحضور اللهو .وروي أن العِير نزلت بموضع يقال له : أحجار الزيت فتوهم الراوي فقال : بتجارة الزيت .وضمير { إليها } عائد إلى التجارة لأنها أهم عندهم من اللهو ولأن الحدث الذي نزلت الآية عنده هو مجيء عِير دحية من الشام . واكتفى به عن ضمير اللهو كما في قول قيس بن الخطيم ، أو عمرو بن الحارث بن امرىء القيس :نحن بما عندنا وأنت بما ... عندك راضضٍ والرأيُ مختلفولعل التقسيم الذي أفادته { أو } في قوله : { أو لهواً } تقسيم لأحوال المنفضّين إذ يكون بعضهم من ذوي العائلات خرجوا ليَمْتَاروا لأهلهم ، وبعضهم من الشباب لا همة لهم في الميرة ولكن أحبوا حضور اللهو .و { إذا } ظرف للزمان الماضي مجرد عن معنى الشرط لأن هذا الانفضاض مضى . وليس المراد أنهم سيعودون إليه بعد ما نزل هذا التوبيخ وما قبله من الأمر والتحريض . ومثله قوله تعالى : { وإذا جاءهم أمر من الأمن أو الخوف أذاعوا به } \\[ النساء : 83 \\] وقوله : { ولا على الذين إذا ما أتوك لتحملهم قلت لا أجد ما أحملكم عليه تولوا } \\[ التوبة : 92 \\] الآية .والانفضاض : مطاوع فَضَّه إذا فرقه ، وغلب إطلاقه على غير معنى المطاوعة ، أي بمعنى مطلق كما تفرق . قال تعالى : { هم الذين يقولون لا تنفقوا على من عند رسول الله حتى ينفضّوا } \\[ المنافقون : 7 \\] .وقوله : { أو لهواً } فيه للتقسيم ، أي منهم من انفضّ لأجل التجارة ، ومنهم من انفضّ لأجل اللهو ، وتأنيث الضمير في قوله : { إليها } تغليب للفظ ( تجارة ) لأن التجارة كانت الداعي الأقوى لانفضاضهم .وجملة { وتركوك قائماً } تفظيع لفعلهم إذ فرطوا في سماع وعظ النبي صلى الله عليه وسلم أي تركوك قائماً على المنبر . وذلك في خطبة الجمعة ، والظاهر أنها جملة حالية ، أي تركوك في حال الموعظة والإِرشاد فأضاعوا علماً عظيماً بانفضاضهم إلى التجارة واللهو . وهذه الآية تدل على وجوب حضور الخطبة في صلاة الجمعة إذ لم يقل : وتركوا الصلاة .وأمر الله نبيئه صلى الله عليه وسلم أن يعظهم بأن ما عند الله من الثواب على حضور الجمعة خير من فائدة التجارة ولذة اللهو . وكذلك ما أعد الله من الرزق للذين يؤثرون طاعة الله على ما يشغل عنها من وسائل الارتزاق جزاء لهم على إيثارهم جزاء في الدنيا قبل جزاء الآخرة ، فرب رزق لم ينتفع به الحريص عليه وإن كان كثيراً ، وربّ رزق قليل ينتفع به صاحبه ويعود عليه بصلاح ، قال تعالى : { من عمل صالحاً من ذكر أو أنثى وهو مؤمن فلنحيينه حياة طيبة ولنجزينهم أجرهم بأحسن ما كانوا يعملون } \\[ النحل : 97 \\] . وقال حكاية عن خطاب نوع قومه { فقلت استغفروا ربكم إنه كان غفّاراً يرسل السماء عليكم مدراراً ويمددكم بأموال وبنين ويجعل لكم جنات ويجعل لكم أنهاراً } \\[ نوح : 10 12 \\] .وذيل الكلام بقوله : { والله خير الرازقين } لأن الله يرزق الرزق لمن يرضى عنه سليماً من الأكدار والآثام ، ولأنه يرزق خير الدنيا وخير الآخرة ، وليس غير الله قادراً على ذلك ، والناس في هذا المقام درجات لا يعلمها إلا الله وهو العالم بالسرائر .\n\n",
      "translations": [
        {
          "translation": "(But when they) this refers to Dihyah Ibn Khalifah al-Kalbi (spy) hear the sound of the drum or (some merchandise or pastime they break away to it) they disperse and leave the mosque (and leave you standing) only eight men remained in the mosque; and it is also said: only 12 men and two women remained in the mosque. (Say) to them, Muhammad: (That which Allah hath) of reward (is better) for you (than pastime) the sound of the drum (and than merchandise) of Dihyah al-Kalbi; He says: if you had stayed with your Prophet and prayed behind him and then made supplications before leaving the mosque, that would have been better for you in terms of reward and bestowal of honour from Allah, and much better than leaving the mosque without doing this, (and Allah is the Best of providers) Allah is the best of those who give; i.e. say this when the hypocrites come to you'. And of the surah in which the Hypocrites are mentioned, which is all Medinan except for Allah's saying (They say: Surely, if we return to Medina the mightier will soon drive out the weaker...) which was revealed to the Prophet on the road of Banu'l-Mustaliq, and it consists of 11 verses, 180 words and 776 letters: Surah 63: The Hypocrites (al-Munafiqun) 668 And of the surah in which the Hypocrites are mentioned, which is all Medinan except for Allah's saying (They say: Surely, if we return to Medina the mightier will soon drive out the weaker...) which was revealed to the Prophet on the road of Banu'l-Mustaliq, and it consists of 11 verses, 180 words and 776 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِذَا رَأَوْاْ تِجَارَةً أَوْ لَهْواً } اللهوُ: الطَّبلُ { ٱنفَضُّوۤاْ إِلَيْهَا } معناه أسرعُوا، وتَفرّقُوا عَنكَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd when they see a trade or a game, they {swarm to it} - Allahu: the camel - {eagerly}. This means that they hurry to it and leave you behind.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n أي: أين هم وهذا المعنى؟ وأنى لهم هذه المعاملة؟ لقد بعدوا فذُهِلوا واحتجبوا فلهوا { قل ما عند الله خير } أي: إن لم تربأ فطرتكم بهمتكم إلى هذا المعنى فاعملوا للأعواض الباقية عند الله فإنها خير من الأمور الفانية التي عندكم وفوّضوا أمر الرزق إليه بالتوكل فإن الله هو { خير الرزاقين } والله تعالى أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } هم من غاية حرصهم على مقتضيات القوى البهيمية بعدما كانوا في الجامع عند سماع الخطبة { إِذَا رَأَوْاْ } وسمعوا { تِجَارَةً } حاضرة تدبير الناس حولها { أَوْ لَهْواً } طبلاً مخبراً لهم على مجيئ العير { ٱنفَضُّوۤاْ إِلَيْهَا } أي: مالوا وتحركوا نحوها مسرعين\n فخرجوا من الجامع سوى اثني عشر من الرجال والنساء { وَتَرَكُوكَ } يا أكمل الرسل { قَآئِماً } على المنبر\n وما هي إلا ثلمة ظهرت في الدين المستبين\n موجبة مقتضية للتهاون بأحكام الشرع المتين\n حدثت فيما بينهم\n\n\n{ قُلْ } لهم يا أكمل الرسل إزاحةً لها\n وإزالةً لما يتفرع عليها: { مَا عِندَ ٱللَّهِ } من المثوبات الأخروية الموجبة للدرجات العليَّة\n والمقامات السنيَّة { خَيْرٌ } لكم وأصلح بحالكم\n وأعظم نفعاً\n وأبقى فائدة { مِّنَ ٱللَّهْوِ وَمِنَ ٱلتِّجَارَةِ } إذ لا نفع لها عند أهل الحق وإن فرض\n فهو متناه زائل عن قريب\n بخلاف الكرامة الأخروية فإنها تدوم أبداً { وَ } إن عللوا انفضاضهم بتحصيل الرزق الصوري قل لهم يا أكمل الرسل: { ٱللَّهُ } المظهر لكم من كتم العدم\n المدبر المربي لأشباحكم بما ليس في وسعكم { خَيْرُ ٱلرَّازِقِينَ } [الجمعة: 11] يرزقكم من حيث لا تحستبون إن توكلتم عليه مخلصين\n وفوضتم أموركم إليه سبحانه واثقين بكرمه العميم\n وجوده العظيم\n\n\nخاتمة السورة\n\nعليك أيها الموحد الخائض لجج بحر الوجود\n المتحقق بمقام الكشف والشهود - مكنك الله في مقر عز الوحدة\n وجنبك عن الزيغ والضلال - أن تتوكل على الله\n وتتخذه وكيلاً\n وتفوض أمورك كلها إليه\n وتجعله كفيلاً\n فعليك ألاَّ تشتغل عن الله في آن وشأن\n ولا تغفل عنه في حين من الأحيان\n سيما في أمر الرزق الصوري الضروري\n المقدر عند الله المدبر الحكيم لكل من دخل في حيطة الوجود\n وظهر على صورة الموجود\n فإنه يصل على من يصل حسب إرادة الله ومشيئته\n\n\nوإياك إياك أن تطلبه بالتجارة والسؤال\n بل لك أن تستعمل آلاتك الموهبة لك من عند العليم الحكيم إلى ما جُلبت لأجله\n لتكون من زمرة الشاكرين المتوكلين\n\n\nوبالجملة: الرزق على الله\n ولا تكن من القانطين\n واعبد ربك\n واشكر على آلائه ونعمائه\n[الحجر: 99]\n\n\nربنا اجعلنا بلطفك من زمرة الشاكرين\n آمين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِذا رأَوْا تجارةً أو لهواً انفَضُّوا إِليها } \n\n \" رُوي أنّ أهل المدينة أصابهم جوع وغلاء شديد\n فقَدِم دِحْيَة بن خَليفةَ\n بتجارة من زيت الشام\n والنبيُّ صلى الله عليه وسلم يخطب يوم الجمعة\n فقاموا إليها خشية أن يُسبقوا إليه\n فما بقي معه عليه السلام إلاّ ثمانية\n أو اثنا عشر العشرة المبشَّرون بالجنة\n وبلال وابن مسعود\n وقيل: أربعون\n وهذا مبنى الخلاف في عدد الجماعة التي تنعقد بهم وتجب عليهم\n فقال مالك: تنعقد باثني عشر غير الإمام\n وتجب على قرية يُمكنهم الإقامة والدفع عن أنفسهم في الغالب\n وقال الشافعي: أربعون رجلاً وقال أبو حنيفة: لا بد من المصر الجامع\n والسلطان القاهر\n وتصح الصلاة عنده بأربعة\n ولمّا انفضُّوا قال صلى الله عليه وسلم: \" والذي نفس محمد بيده لو قاموا جميعاً لأضرم الله عليهم الوادي ناراً \" \n \nوفي مراسيل أبي داود: إنّ الخطبة كانت بعد الصلاة\n فتأو‍ّلوا ـ رضي الله عنهم ـ أنهم قد قضوا ما عليهم\n فحولت الخطبة بعد ذلك قبل الصلاة\n هـ\n  وكانوا إذا أقبلت العير استقبلوها بالطبل والتصفيق\n وهو المراد باللهو\n وتخصيص التجارة برجْع الضمير إليها لأنها المقصودة\n أو لأن الانفضاض إذا كان للتجارة مع الحاجة إليها مذموماً\n فما ظنك بالانفضاض إلى اللهو\n فهو مذموم في نفسه\n وقيل: التقدير: إذا رأوا تجارة انفضُّوا إليها\n أو لهواً انفضُّوا إليه\n فحذف الثاني لدلالة الأول عليه\n وقال أبو حيان: وإنما قال: \" إليها \" \n ولم يقل: إليهما\n لأن العطف بـ \" أو \" لا يثنى فيه الضمير\n بل يفرد\n وقال الطيبي: الضمير راجع إلى اللهو\n باعتبار المعنى\n والسر فيه: أنَّ التجارة إذا شغلت المكلّف عن الذكر عُدت لهواً\n وتعد فضلاً إن لم تشغله\n كما ذكر قبل ذلك\n فراجعه\n { وتَركُوك قائمًا } على المنبر\n وفيه دليل على طلب القيام في الخطبة إلاَّ لعذر\n { قل ما عند الله } من الثواب { خير من اللهو ومن التجارة } فإنَّ في ذلك نفع محقق دائم\n بخلاف ما فيهما من النفع المتوهم\n { واللهُ خيرُ الرازقين } فإليه اسعوا\nومنه اطلبوا الرزق\n أي: لا يفوتهم رزق الله بترك البيع\n فهو خير الرازقين\n الإشارة: إذا نُودي لصلاة القلوب في مقام الجمع\n من ناحية الداعي إليها\n وهم المشايخ العارفون\n فاسعوا إلى ذكر الله\n ودُوموا عليه باللسان والقلب\n ثم بالقلب فقط\n ثم بالروح\n ثم بالسر\n فإنَّ الذكر منشور الولاية\n ولا بد منه في البداية والنهاية\n قال الورتجبي بعد كلام: الساعي إلى الذكر مقام المريدين\n والمحقق في المعرفة غلب عليه ذكر الله إياه بنعت تجلِّي نفسه لقلبه\n هـ\n { وذّرُوا البيع } أي: اتركوا كلَّ ما يشغل عن الله\n فلا تتجلى الحقائق إلاّ بعد ترك العلائق\n ذلكم\n أي: ترك كل شاغل\n خيرٌ لكم إن كنتم تعلمون\n أي: إن كنتم من أهل العلم بالله فإذا قُضيت الصلاة فانتشروا في الأرض\n\n\n الخ\n أي: إذا حصل لكم البقاء بعد الفناء فانتشِروا في أرض العبودية\n واتسعوا في ميادين البشرية\n بالاستمتاع بالشهوات المباحة بالإذن والتمكين\n والرسوخ في اليقين\n وابتغوا من فضل الله\n بالتجارات الرابحة\n وهي إرشاد العباد إلى الله\n { واذكروا الله كثيراً } أي: في كل شيء وعند كل شيء\n برؤية الحق في كل شيء\n وإليه تُشير وصيته صلى الله عليه وسلم لمُعاذ بقوله:\n\n \" واذكر الله عند كل حَجر وشجر \"\n \nوقوله تعالى: { وإِذا رأوا تجارةً أو لهواً انفضُّوا إِليها } \n قال القشيري: يشير إلى السالكين المحرومين من الجذبة ـ وهو السالك الأبتر ـ إذا رأوا تجارة\n أي: طاعة تُوجب ثواب الآخرة\n يقومون إليها\n ويَثبون عليها\n نظراً إلى ثواب الآخرة\n كما قال عليه السلام:\n \" لا تكونوا كالأجير السوء\n إن أُعطي عمل\n وإن لم يُعطَ لم يعمل \" \n\n أو لهواً أطرب النفس برؤية الطاعة واستِلْذَاذها بنظر الخلق إليها\n انفضُّوا إليها وتركوك ـ أيها السالك الحقيقي ـ قائماً بعبودية الحق\n ومشاهدة قيوميته\n قل: ما عند الله من المواهب العالية\n والعطايا السنية\n خيرٌ من لهو النفس برؤية الغير\n ومن التجارات بثواب الآخرة\n لقوله تعالى:\n[الكهف:110] أو: ما عند الله نَقْداً للعارفين من واردات القلوب\n وبواده الحقيقية\n خير مما يؤمل من الدنيا والآخرة للغافلين\n والله خير الرازقين\n لإعطائه رزق النفس\n وهو الطاعة على المنهاج والشرع\n ورزق القلب\n وهو الأعمال القلبية\n كالزهد والورع والرضا والتسليم والمراقبة\n والبسط والقبض\n والأُنس والهيبة\n ورزق الروح بالتجليات والمشاهدات\n والمعاينات والتنزُّلات\n ورزق السر برفع رؤية الغير والغيرية\n ورزق الخفاء بالفناء في الله والبقاء به\n هـ\n قال الورتجبي: فيه تأديب المريدين حين اشتغلوا عن صحبة المشايخ\n بخلواتهم وعباداتهم\n لطلب الكرامة ولم يعلموا أنَّ ما يجدون في خلواتهم بالإضافة إلى ما يجدون في صحبة مشايخهم لَهْوٌ\n هـ\n وهو حق\n وبالله التوفيق\n وصلّى الله على سيدنا محمد\n عين عيان التحقيق وعلى آله وصحبه وسلّم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:37",
      "similarity": 0.532295174105544
    },
    {
      "verse": "76:16",
      "similarity": 0.4346781348087884
    },
    {
      "verse": "4:29",
      "similarity": 0.4253803312893824
    },
    {
      "verse": "61:10",
      "similarity": 0.37560425596913555
    },
    {
      "verse": "63:7",
      "similarity": 0.36541568942742875
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/062011.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/062011.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/62:11.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}