{
  "chapter": "الجمعة",
  "text": "فاذا قضيت الصلوة فانتشروا۟ فى الارض وابتغوا۟ من فضل الله واذكروا۟ الله كثيرا لعلكم تفلحون",
  "translations": [
    {
      "translation": "And when the service of prayer is over spread out in the land, and look for the bounty of God. and remember God a great deal that you may prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the Prayer is ended, disperse in the land and seek Allah's Bounty, and remember Allah much so that you may prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the prayer ends, disperse through the land and seek the favor of God. Remember Him often so that perhaps you will have everlasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the prayer ends, spread out in the land and seek Allah’s munificence, and profusely remember Allah, in the hope of attaining success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when the Salah is complete, you may disperse through the land, and seek the bounty of Allah, and remember Allah much, that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when the prayer is ended, then disperse abroad in the land and seek of Allah's grace, and remember Allah much, that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when the prayer is finished, scatter in the land and seek God's bounty, and remember God frequently; haply you will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the prayer is ended, then disperse in the land and seek of Allah's bounty, and remember Allah much, that ye may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the prayer is ended, disperse in the land and seek to obtain [something] of God's bounty; and remember God much, so that you may prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when the prayer is ended, disperse in the land and seek of Allah's grace, and remember Allah much, that haply ye may thrive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the prayer is finished disperse through the land and seek Allah’s grace, and remember Allah much so that you may be felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Prayer is finished, then may ye disperse through the land, and seek of the Bounty of Allah: and celebrate the Praises of Allah often (and without stint): that ye may prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when the (Jumu'ah) Salat (prayer) is finished, you may disperse through the land, and seek the Bounty of Allah (by working, etc.), and remember Allah much, that you may be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when the prayer has ended, disperse in the land and seek the favor of Allah, and, remember Allah often, so that you prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when the prayer is concluded, disperse through the land, and seek God’s bounty, and remember God much, so that you may prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the prayer has been concluded, disperse within the land and seek from the bounty of Allah, and remember Allah often that you may succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[62:10] And when the prayer is finished, disperse in the land (this is an imperative denoting permissibility) and seek, provision through, God’s bounty, and remember God, with remembrance, frequently, that perhaps you may be successful, [that perhaps] you may be the winners.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then gave them a dispensation, after imposing a prohibition upon them, in His saying (and leave your trading) and said: (And when the prayer is ended) when the Imam finishes the Friday prayer, (then disperse in the land) then leave the mosque if you wish (and seek of Allah's bounty) and seek Allah's provision if you wish, and this is the dispensation which came after prohibition. There is also another way of understanding this: when the Imam finishes the Friday prayer, disperse in the mosque and seek that which is better for you, i.e. the hidden knowledge, Oneness, non-attachment and reliance on Allah, (and remember Allah) with your tongues and hearts (much) in all circumstances, (that ye may be successful) that you may escape Allah's chastisement and wrath.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِذَا قُضِيَتِ } وأُديت { ٱلصَّلاَةُ } المكتوبة لكم يوم الجمعة مع الإمام { فَٱنتَشِرُواْ فِي } أقطار { ٱلأَرْضِ وَٱبْتَغُواْ } واطلبوا حوائجكم { مِن فَضْلِ ٱللَّهِ } وإحسانه، وسعة جوده وإنعامه { وَ } بالجملة: { ٱذْكُرُواْ ٱللَّهَ } المنعم المفضل عليكم { كَثِيراً } في عموم أحوالكم وأعمالكم، ولا تحصروا ولا تقصروا ذكره في الصلوات المفروضة فقط، بل اشتغلوا بذكره في عموم الأوقات والحالات، بالقلب واللسان، وسائر الجوارح والأركان؛ إذ ما من شيء إلا يسبح بحمده، ولكن لا يفقهون تسبيحهم إلاَّ قليلاً، وواظبوا عليه { لَّعَلَّكُمْ تُفْلِحُونَ } [الجمعة: 10] وتفوزون بخير الدارين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإِذا قُضِيَتِ الصلاةُ } أي: أُدّيت وفرغ منها { فانتشِرُوا في الأرض } ، أمْرُ إباحة، أي: اخرجوا لإقامة مصالحكم، { وابتغوا من فضل الله } الرزق، قال ابن عباس: \" إنما هي عيادة المريض، وحضور الجنائز، وزيارة أخ في الله \" ومثله في الحديث، وعن الحسن: طلب العلم، وقيل: صلاة التطوُّع\n { واذكروا اللهَ كثيراً } ، أي: ذكراً كثيراً أو زمناً كثيراً، ولا تخصُّوا ذكره بالصلاة، { لعلكم تُفلحون } أي: كي تفوزوا بخير الدارين",
      "translations": []
    }
  ]
}