{
  "chapter": "الجمعة",
  "text": "يسبح لله ما فى السموت وما فى الارض الملك القدوس العزيز الحكيم",
  "translations": [
    {
      "translation": "Everything in the heavens and everything in the earth glorifies Allah, the King, the All-Pure, the Almighty, the All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "ALL THAT IS in the heavens and the earth sings the praises of God the King, the Holy, Omnipotent, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and all that is in the earth extols the glory of Allah, the Sovereign, the Holy, the All- Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and the earth glorify God, the King, the Holy, the Majestic and the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All whatever is in the heavens and all whatever is in the earth proclaims the Purity of Allah, the King, the Most Pure, the Most Honourable, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah -- the King, the Holy, the Almighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and whatever is in the earth declares the glory of Allah, the King, the Holy, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and the earth magnifies God, the King, the All-holy, the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and all that is in the earth glorifieth Allah, the Sovereign Lord, the Holy One, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and on the earth glorifies God, the Sovereign Lord, the Holy One, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever is in the heavens and whatsoever is in the earth halloweth Allah, the Sovereign, the Holy, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever there is in the heavens and in the earth glorifies Allah, the Sovereign, the All-holy, the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and on earth, doth declare the Praises and Glory of Allah,- the Sovereign, the Holy One, the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah, the King (of everything), the Holy, the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in heavens and earth exalt Allah, the King, the Pure, the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everything in the heavens and the earth glorifies God the Sovereign, the Holy, the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and whatever is on the earth is exalting Allah, the Sovereign, the Pure, the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[62:1] All that is the heavens and all that is in the earth glorifies God, [all] proclaims His transcendence (the lām [of li’Llāhi] is extra; mā is used instead of min in order to indicate the predominance [of non-rational beings]), the King, the Holy, the One Who transcends what does not befit Him, the Mighty, the Wise, in His kingdom and in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said about the interpretation of Allah's saying (All that is in the heavens and all that is in the earth glorifieth Allah): '(All that is in the heavens) of created beings (and all that is in the earth) of creatures and living beings (glorifies Allah) prays to Allah; and it is also said this means: remembers Allah, (the Sovereign Lord) the Eternal whose sovereignty does not perish, (the Holy One) the Pure who has no son or partner, (the Mighty) the All-Conquering in His sovereignty and in His retribution against those who disbelieve in Him, (the Wise) in His command and decree, and He has decreed that none should be worshipped but Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إذا نودي للصلاة من يوم الجمعة } كل وضع لا تطلع العقول البشرية على سببه فهو من طور وراء العقل المشوب بالوهم لامتناع وقوع التخصيص من غير مخصص كوضع حروف التهجي وأيام الأسابيع، بل وضع اللغات كلها، فإن في كل بقعة من بقاع الأرض لغة لا شك في أن أول التكلم بها أمر توقيفي اقتضاه استعداد خاص باجتماع أمور سفلية وعلوية لا يمكننا ضبطها، ولو قلنا بالاصطلاح لكان لا يخلو أيضاً من سبب يوجب الاصطلاح على ذلك الوضع المخصوص، فأيام الأسبوع وضعت بإزاء الأيام الإلهية التي هي مدة الدنيا وقد اشتهر فيما بين الناس في جميع الأعصار أن مدة الدنيا سبعة آلاف سنة على عدد الكواكب السبعة، فكل ألف سنة يوم من أيام الله لقوله:\n\n[الحج، الآية:47]\n وتفيد مدة الدنيا بالسبعة هو أن جميع مدّة دور الخفاء المطلق ستة آلاف سنة ويبتدىء الظهور في السابع مع ظهور محمد عليه السلام كما قال:\n\n \" بعثت أنا والساعة كهاتين \" \n\n، وجمع بين السبابة والوسطى\n ويزداد إلى تمام سبعة آلاف سنة من لدن آدم عليه السلام أول الأنبياء إلى زمان المهدي عليه السلام، وينقضي الخفاء بالظهور التام لقيام الساعة ووقوع القيامة الكبرى وعند ذلك يظهر فناء الخلق والبعث والنشور والحساب ويتميز أهل النار وأهل الجنة ويرى عرش الله بارزاً كما حكى حارثة رضي الله عنه عن شهوده وهي في الآخرة\n فالستة منها هي التي خلق فيها السموات والأرض لأن الخلق حجاب الحق، فمعنى خلق اختفى بهما فأظهرهما وبطن، واليوم السابع هو يوم الجمع وزمان الاستواء على العرش بالظهور في جميع الصفات، وابتداء يوم القيامة الذي طلع فجره ببعثة نبينا محمد صلّى الله عليه و على آله، فالمحمديون أهل الجمعة ومحمد صاحبها وخاتم النبيين، وإنما سمي يوم الجمع لأنه وقت الظهور في صورة الاسم الأعظم لجميع الصفات ووقت استوائه في الظهور بجميعها بحيث لا يختلف بالظهور والخفاء\n ولهذا السر ندبت الصلاة يوم الجمعة وقت الاستواء وكرهت في سائر الأيام، ويسمى هذا الظهور عين الجمع لاجتماع الكل فيه ولهذا المعنى سميت الجمعة جمعة\n واتفق أهل الملل كلها من اليهود وغيرهم أن الله فرغ من خلق السموات والأرض في اليوم السابع، إلا أن اليهود قالوا: إنه السبت، وابتداء الخلق من الأحد\n وعلى ما أوّلنا يكون هو يوم الجمعة\n وكون الأحد ابتداء الخلق مؤوّل بان أحدية الذات منشأ الكثرة وإن جعلنا الأحد أول الأيام ووقت ابتداء الخلق كان دور النبوة دور الخفاء\n وفي السادس ابتداء الظهور وازداد في الخواص حتى ينتهي إلى تمام الظهور وارتفاع الخفاء في آخره عند خروج المهدي، ويعم الظهور في السابع الذي هو السبت\n\n\nولما كان هذا اليوم - أي يوم الجمعة - موضوعاً بإزاء هذا المعنى، ندب الناس فيه إلى الفراغ من الأشغال الدنيوية التي هي حجب كلها والحضور والاجتماع في الصلاة وأوجب السعي إلى ذكر الله فيه وترك البيع لكي تتظاهر النفوس بهيئة الاجتماع في صلاة الحضور المعدّ للوصول إلى حضرة الجمع عسى أن يتذكر أحدهم بالفراغ عن الأشغال الدنيوية التجرّد عن الحجب الخلقية، وبالسعي إلى ذكر الله، السلوك في طريقه، والصلاة مع الاجتماع: الوصول إلى حضرة الجمع، فيفلح\n { ذلكم خير لكم إن كنتم تعلمون } سرّ ذلك وحقيقته\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nلذلك { يُسَبِّحُ } ويقدس { لِلَّهِ } الواحد الأحد، المنزَّه عن مطلق التحديد مظاهر { مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلأَرْضِ } تسبيحاً وتقديساً، مقروناً بكمال التذلل والخضوع إلى الملك { ٱلْمَلِكِ } المتسلط بالاستيلاء التام، والسلطنة القاهرة الغالبة على مملكة الوجود { ٱلْقُدُّوسِ } المنزَّه الطاهر ذاته عن سمة الحدوث، ووصمة الإمكان { ٱلْعَزِيزِ } الغالب على عموم المقدورات بكمال الاستيلاء والاستقلال { ٱلْحَكِيمِ } [الجمعة: 1] المقتن في مطلق التدابير الجارية في عالم التصاوير بلا فتور وقصور\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يُسَبِّحُ لله ما في السموات وما في الأرض } ، وهذا التسبيح إمّا أن يكون: تسبيح خِلقة، يعني: أنك إذا نظرت إلى شيء دلتك خِلقتُه على وحدانيته تعالى، وتنزيهِه عما لا يليق به، وإمّا أن يكون تسبيح معرفة بأن يخلق في كل شيء ما يعرفه به تعالى وينزّهه، ألا ترى إلى قوله تعالى:\n\n[الإسراء:44]، أو: تسبيح ضرورة، بأن يُجري اللهُ التسبيحَ على كل جوهر من غير معرفةٍ له بذلك\n قاله النسفي\n { الملكِ القُدُّسِ } أي: المنزَّه عما لا يليق به من الكمالات\n ولا يُقال: المنزّه عن النقائص إذ لا يصح اتصافه بها حتى تُنفى عنه، وربما يكون نقصاً في حقه، كما يُقال: الملِك ليس بجزار\n { العزيزِ الحكيمِ }  وقرئت هذه الصفات الأربع بالرفع على المدح",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:21",
      "similarity": 0.6371477256918074
    },
    {
      "verse": "16:102",
      "similarity": 0.5763467586487208
    },
    {
      "verse": "57:1",
      "similarity": 0.3859815456729323
    },
    {
      "verse": "59:1",
      "similarity": 0.3859815456729323
    },
    {
      "verse": "61:1",
      "similarity": 0.3859815456729323
    }
  ]
}