{
  "chapter": "الجمعة",
  "text": "واذا راوا۟ تجرة او لهوا انفضوا۟ اليها وتركوك قائما قل ما عند الله خير من اللهو ومن التجرة والله خير الرزقين",
  "translations": [
    {
      "translation": "But when they see a chance of trade or entertainment they scatter off to it and leave you standing there. Say: 'What is with Allah is better than trade or entertainment. Allah is the Best of Providers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when they see some buying and selling, or some sport, they go for it, leaving you standing. Tell them: \"What is with God is better than your sport and commerce. And God is the best of providers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet no sooner than they saw some trading or amusement, they flocked to it and left you standing by yourself. Tell them: “That which is with Allah is far better than amusement and trading. Allah is the Best Provider of sustenance.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they see some merchandise or some sport, they rush towards it and leave you alone standing. Say, \"(God's rewards for good deeds) are better than merriment or merchandise; God is the best Sustainer\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they see some trade or sport, they move towards it and leave you standing delivering the sermon; proclaim, “That which is with Allah, is better than sport and trade; and the sustenance of Allah is the best.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they see some merchandise or some amusement, they disperse headlong to it, and leave you standing. Say: \"That which Allah has is better than any amusement or merchandise! And Allah is the best of providers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they see merchandise or sport they break up for It, and leave you standing. Say: What is with Allah is better than sport and (better) than merchandise, and Allah is the best of Sustainers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they see merchandise or diversion they scatter off to it, and they leave thee standing. Say: 'What is with God is better than diversion and merchandise. God is the best of providers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they spy some merchandise or pastime they break away to it and leave thee standing. Say: That which Allah hath is better than pastime and than merchandise, and Allah is the Best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when they see some merchandise or entertainment, they break away to go to it and leave you standing. Say, \"That which God has in store is far better than any merchandise or entertainment.\" God is the most munificent Giver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they beheld merchandise or sport, they flocked thereto, and left thee standing. Say thou: that which is with Allah is better than sport and better than merchandise; and Allah is the Best of providers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they sight a deal or a diversion, they scatter off towards it and leave you standing! Say, ‘What is with Allah is better than diversion and dealing, and Allah is the best of providers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they see some bargain or some amusement, they disperse headlong to it, and leave thee standing. Say: \"The (blessing) from the Presence of Allah is better than any amusement or bargain! and Allah is the Best to provide (for all needs).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they see some merchandise or some amusement [beating of Tambur (drum) etc.] they disperse headlong to it, and leave you (Muhammad SAW) standing [while delivering Jumu'ah's religious talk (Khutbah)]. Say \"That which Allah has is better than any amusement or merchandise! And Allah is the Best of providers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when they see some commerce or amusement they flock to it, leaving you standing. Say: 'That which is with Allah is better than the amusement and commerce. Allah is the Best of Providers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet whenever they come across some business, or some entertainment, they scramble towards it, and leave you standing. Say, “What is with God is better than entertainment and business; and God is the Best of providers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they saw a transaction or a diversion, [O Muhammad], they rushed to it and left you standing. Say, \"What is with Allah is better than diversion and than a transaction, and Allah is the best of providers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[62:11] On one occasion the Prophet (s) was delivering the Friday sermon when a caravan arrived and so, as was the custom, drums were beaten to announce its arrival, whereat the people began to leave the mosque [to go to it], all except for twelve men. The following [verse] was then revealed: But when they sight some [opportunity for] business or a diversion, they scatter off towards it, that is, towards the business, since it is what they seek more than diversion, and leave you, during the sermon, standing. Say: ‘That which is with God, in the way of reward, is better, for those who believe, than diversion and commerce. And God is the best of providers’. They say that every person ‘provides for’ (yarzuqu) his dependants, [by which they mean that such a person does so] by means of the provision given by God (min rizqi’Llāhi), exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But when they) this refers to Dihyah Ibn Khalifah al-Kalbi (spy) hear the sound of the drum or (some merchandise or pastime they break away to it) they disperse and leave the mosque (and leave you standing) only eight men remained in the mosque; and it is also said: only 12 men and two women remained in the mosque. (Say) to them, Muhammad: (That which Allah hath) of reward (is better) for you (than pastime) the sound of the drum (and than merchandise) of Dihyah al-Kalbi; He says: if you had stayed with your Prophet and prayed behind him and then made supplications before leaving the mosque, that would have been better for you in terms of reward and bestowal of honour from Allah, and much better than leaving the mosque without doing this, (and Allah is the Best of providers) Allah is the best of those who give; i.e. say this when the hypocrites come to you'. And of the surah in which the Hypocrites are mentioned, which is all Medinan except for Allah's saying (They say: Surely, if we return to Medina the mightier will soon drive out the weaker...) which was revealed to the Prophet on the road of Banu'l-Mustaliq, and it consists of 11 verses, 180 words and 776 letters: Surah 63: The Hypocrites (al-Munafiqun) 668 And of the surah in which the Hypocrites are mentioned, which is all Medinan except for Allah's saying (They say: Surely, if we return to Medina the mightier will soon drive out the weaker...) which was revealed to the Prophet on the road of Banu'l-Mustaliq, and it consists of 11 verses, 180 words and 776 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِذَا رَأَوْاْ تِجَارَةً أَوْ لَهْواً } اللهوُ: الطَّبلُ { ٱنفَضُّوۤاْ إِلَيْهَا } معناه أسرعُوا، وتَفرّقُوا عَنكَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } هم من غاية حرصهم على مقتضيات القوى البهيمية بعدما كانوا في الجامع عند سماع الخطبة { إِذَا رَأَوْاْ } وسمعوا { تِجَارَةً } حاضرة تدبير الناس حولها { أَوْ لَهْواً } طبلاً مخبراً لهم على مجيئ العير { ٱنفَضُّوۤاْ إِلَيْهَا } أي: مالوا وتحركوا نحوها مسرعين، فخرجوا من الجامع سوى اثني عشر من الرجال والنساء { وَتَرَكُوكَ } يا أكمل الرسل { قَآئِماً } على المنبر، وما هي إلا ثلمة ظهرت في الدين المستبين، موجبة مقتضية للتهاون بأحكام الشرع المتين، حدثت فيما بينهم\n\n\n\n\n{ قُلْ } لهم يا أكمل الرسل إزاحةً لها، وإزالةً لما يتفرع عليها: { مَا عِندَ ٱللَّهِ } من المثوبات الأخروية الموجبة للدرجات العليَّة، والمقامات السنيَّة { خَيْرٌ } لكم وأصلح بحالكم، وأعظم نفعاً، وأبقى فائدة { مِّنَ ٱللَّهْوِ وَمِنَ ٱلتِّجَارَةِ } إذ لا نفع لها عند أهل الحق وإن فرض، فهو متناه زائل عن قريب، بخلاف الكرامة الأخروية فإنها تدوم أبداً { وَ } إن عللوا انفضاضهم بتحصيل الرزق الصوري قل لهم يا أكمل الرسل: { ٱللَّهُ } المظهر لكم من كتم العدم، المدبر المربي لأشباحكم بما ليس في وسعكم { خَيْرُ ٱلرَّازِقِينَ } [الجمعة: 11] يرزقكم من حيث لا تحستبون إن توكلتم عليه مخلصين، وفوضتم أموركم إليه سبحانه واثقين بكرمه العميم، وجوده العظيم\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها الموحد الخائض لجج بحر الوجود، المتحقق بمقام الكشف والشهود - مكنك الله في مقر عز الوحدة، وجنبك عن الزيغ والضلال - أن تتوكل على الله، وتتخذه وكيلاً، وتفوض أمورك كلها إليه، وتجعله كفيلاً، فعليك ألاَّ تشتغل عن الله في آن وشأن، ولا تغفل عنه في حين من الأحيان، سيما في أمر الرزق الصوري الضروري، المقدر عند الله المدبر الحكيم لكل من دخل في حيطة الوجود، وظهر على صورة الموجود، فإنه يصل على من يصل حسب إرادة الله ومشيئته\n\n\n\n\nوإياك إياك أن تطلبه بالتجارة والسؤال، بل لك أن تستعمل آلاتك الموهبة لك من عند العليم الحكيم إلى ما جُلبت لأجله؛ لتكون من زمرة الشاكرين المتوكلين\n\n\n\n\nوبالجملة: الرزق على الله، ولا تكن من القانطين، واعبد ربك، واشكر على آلائه ونعمائه\n\n[الحجر: 99]\n\n\n\n\nربنا اجعلنا بلطفك من زمرة الشاكرين، آمين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِذا رأَوْا تجارةً أو لهواً انفَضُّوا إِليها } ،\n\n \" رُوي أنّ أهل المدينة أصابهم جوع وغلاء شديد، فقَدِم دِحْيَة بن خَليفةَ، بتجارة من زيت الشام، والنبيُّ صلى الله عليه وسلم يخطب يوم الجمعة، فقاموا إليها خشية أن يُسبقوا إليه، فما بقي معه عليه السلام إلاّ ثمانية، أو اثنا عشر العشرة المبشَّرون بالجنة، وبلال وابن مسعود، وقيل: أربعون، وهذا مبنى الخلاف في عدد الجماعة التي تنعقد بهم وتجب عليهم، فقال مالك: تنعقد باثني عشر غير الإمام، وتجب على قرية يُمكنهم الإقامة والدفع عن أنفسهم في الغالب، وقال الشافعي: أربعون رجلاً وقال أبو حنيفة: لا بد من المصر الجامع، والسلطان القاهر، وتصح الصلاة عنده بأربعة\n ولمّا انفضُّوا قال صلى الله عليه وسلم: \" والذي نفس محمد بيده لو قاموا جميعاً لأضرم الله عليهم الوادي ناراً \" \n\n \n\nوفي مراسيل أبي داود: إنّ الخطبة كانت بعد الصلاة، فتأو‍ّلوا ـ رضي الله عنهم ـ أنهم قد قضوا ما عليهم، فحولت الخطبة بعد ذلك قبل الصلاة\n هـ\n  وكانوا إذا أقبلت العير استقبلوها بالطبل والتصفيق، وهو المراد باللهو\n وتخصيص التجارة برجْع الضمير إليها لأنها المقصودة، أو لأن الانفضاض إذا كان للتجارة مع الحاجة إليها مذموماً، فما ظنك بالانفضاض إلى اللهو، فهو مذموم في نفسه، وقيل: التقدير: إذا رأوا تجارة انفضُّوا إليها، أو لهواً انفضُّوا إليه، فحذف الثاني لدلالة الأول عليه\n وقال أبو حيان: وإنما قال: \" إليها \" ، ولم يقل: إليهما، لأن العطف بـ \" أو \" لا يثنى فيه الضمير، بل يفرد، وقال الطيبي: الضمير راجع إلى اللهو، باعتبار المعنى، والسر فيه: أنَّ التجارة إذا شغلت المكلّف عن الذكر عُدت لهواً، وتعد فضلاً إن لم تشغله، كما ذكر قبل ذلك، فراجعه\n { وتَركُوك قائمًا } على المنبر، وفيه دليل على طلب القيام في الخطبة إلاَّ لعذر\n { قل ما عند الله } من الثواب { خير من اللهو ومن التجارة } فإنَّ في ذلك نفع محقق دائم، بخلاف ما فيهما من النفع المتوهم\n { واللهُ خيرُ الرازقين } فإليه اسعوا،ومنه اطلبوا الرزق، أي: لا يفوتهم رزق الله بترك البيع، فهو خير الرازقين\n الإشارة: إذا نُودي لصلاة القلوب في مقام الجمع، من ناحية الداعي إليها، وهم المشايخ العارفون، فاسعوا إلى ذكر الله، ودُوموا عليه باللسان والقلب، ثم بالقلب فقط، ثم بالروح، ثم بالسر، فإنَّ الذكر منشور الولاية، ولا بد منه في البداية والنهاية، قال الورتجبي بعد كلام: الساعي إلى الذكر مقام المريدين، والمحقق في المعرفة غلب عليه ذكر الله إياه بنعت تجلِّي نفسه لقلبه\n هـ\n { وذّرُوا البيع } أي: اتركوا كلَّ ما يشغل عن الله، فلا تتجلى الحقائق إلاّ بعد ترك العلائق، ذلكم، أي: ترك كل شاغل، خيرٌ لكم إن كنتم تعلمون، أي: إن كنتم من أهل العلم بالله فإذا قُضيت الصلاة فانتشروا في الأرض\n\n\n الخ، أي: إذا حصل لكم البقاء بعد الفناء فانتشِروا في أرض العبودية، واتسعوا في ميادين البشرية، بالاستمتاع بالشهوات المباحة بالإذن والتمكين، والرسوخ في اليقين، وابتغوا من فضل الله، بالتجارات الرابحة، وهي إرشاد العباد إلى الله، { واذكروا الله كثيراً } أي: في كل شيء وعند كل شيء، برؤية الحق في كل شيء، وإليه تُشير وصيته صلى الله عليه وسلم لمُعاذ بقوله:\n\n\n\n \" واذكر الله عند كل حَجر وشجر \"\n \n\nوقوله تعالى: { وإِذا رأوا تجارةً أو لهواً انفضُّوا إِليها } ، قال القشيري: يشير إلى السالكين المحرومين من الجذبة ـ وهو السالك الأبتر ـ إذا رأوا تجارة، أي: طاعة تُوجب ثواب الآخرة، يقومون إليها، ويَثبون عليها، نظراً إلى ثواب الآخرة، كما قال عليه السلام:\n\n \" لا تكونوا كالأجير السوء، إن أُعطي عمل، وإن لم يُعطَ لم يعمل \" \n\n، أو لهواً أطرب النفس برؤية الطاعة واستِلْذَاذها بنظر الخلق إليها، انفضُّوا إليها وتركوك ـ أيها السالك الحقيقي ـ قائماً بعبودية الحق، ومشاهدة قيوميته، قل: ما عند الله من المواهب العالية، والعطايا السنية، خيرٌ من لهو النفس برؤية الغير، ومن التجارات بثواب الآخرة، لقوله تعالى:\n\n[الكهف:110] أو: ما عند الله نَقْداً للعارفين من واردات القلوب، وبواده الحقيقية، خير مما يؤمل من الدنيا والآخرة للغافلين، والله خير الرازقين، لإعطائه رزق النفس، وهو الطاعة على المنهاج والشرع، ورزق القلب، وهو الأعمال القلبية، كالزهد والورع والرضا والتسليم والمراقبة، والبسط والقبض، والأُنس والهيبة، ورزق الروح بالتجليات والمشاهدات، والمعاينات والتنزُّلات، ورزق السر برفع رؤية الغير والغيرية، ورزق الخفاء بالفناء في الله والبقاء به\n هـ\n قال الورتجبي: فيه تأديب المريدين حين اشتغلوا عن صحبة المشايخ، بخلواتهم وعباداتهم، لطلب الكرامة ولم يعلموا أنَّ ما يجدون في خلواتهم بالإضافة إلى ما يجدون في صحبة مشايخهم لَهْوٌ\n هـ\n وهو حق\n وبالله التوفيق\n وصلّى الله على سيدنا محمد، عين عيان التحقيق وعلى آله وصحبه وسلّم\n\n",
      "translations": []
    }
  ]
}