{
  "chapter": "الجمعة",
  "text": "هو الذى بعث فى الامين رسولا منهم يتلوا۟ عليهم ءايته ويزكيهم ويعلمهم الكتب والحكمة وان كانوا۟ من قبل لفى ضلل مبين",
  "translations": [
    {
      "translation": "It is He who raised up among the unlettered people a Messenger from them to recite His Signs to them and purify them and teach them the Book and Wisdom, even though before that they were clearly misguided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who raised among the gentiles an apostle from amongst them, who recites His revelations to them, reforms them and teaches them the Scripture and the Law, for before him they were clearly in error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who has sent to the gentiles a Messenger from among themselves, one who rehearses to them His verses, purifies their lives, and imparts to them the Book and the Wisdom although before that they were in utter error;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent to the illiterate a Messenger from among their own people to recite to them His revelations and purify them. He will teach the Book to them\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has sent among the unlettered people a Noble Messenger from themselves, who recites His verses to them and purifies them, and bestows them the knowledge of the Book and wisdom; and indeed before this, they were in open error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sent among the unlettered ones a Messenger from among themselves, reciting to them His Ayat, purifying them, and teaching them the Book and the Hikmah. And verily, they had been before in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who raised among the inhabitants of Mecca an Apostle from among themselves, who recites to them His communications and purifies them, and teaches them the Book and the Wisdom, although they were before certainly in clear error,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has raised up from among the common people a Messenger from among them, to recite His signs to them and to purify them, and to teach them the Book and the Wisdom, though before that they were in manifest error,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who hath sent among the unlettered ones a messenger of their own, to recite unto them His revelations and to make them grow, and to teach them the Scripture and wisdom, though heretofore they were indeed in error manifest,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has raised among the unlettered people a messenger from among themselves who recites His revelations to them, and purifies them, and teaches them the Book and wisdom, for they had formerly been clearly misguided --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who hath raised amdist the unlettered ones an apostle from among themselves, rehearsing Unto them His revelations and purifying them and teaching them the Book and Wisdom, though they have been aforetime in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sent to the unlettered [people] an apostle from among themselves, to recite to them His signs, to purify them, and to teach them the Book and wisdom, and earlier they had indeed been in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has sent amongst the Unlettered a messenger from among themselves, to rehearse to them His Signs, to sanctify them, and to instruct them in Scripture and Wisdom,- although they had been, before, in manifest error;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sent among the unlettered ones a Messenger (Muhammad SAW) from among themselves, reciting to them His Verses, purifying them (from the filth of disbelief and polytheism), and teaching them the Book (this Quran, Islamic laws and Islamic jurisprudence) and Al-Hikmah (As-Sunnah: legal ways, orders, acts of worship, etc. of Prophet Muhammad SAW). And verily, they had been before in mainfest error;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has raised among the illiterate (Arabs), a Messenger from themselves, to recite to them His verses, to purify them, and to teach them the Book and the Wisdom, though before that they were in clear error,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sent among the unlettered a messenger from themselves; reciting His revelations to them, and purifying them, and teaching them the Scripture and wisdom; although they were in obvious error before that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent among the unlettered a Messenger from themselves reciting to them His verses and purifying them and teaching them the Book and wisdom - although they were before in clear error -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[62:2] It is He Who sent to the unlettered [folk], [among] the Arabs (ummī means ‘one who cannot write or read a book’), a messenger from among them, namely, Muhammad (s), to recite to them His signs, the Qur’ān, and to purify them, to cleanse them from idolatry, and to teach them the Book, the Qur’ān, and wisdom, [in] the rulings that it contains, though indeed (wa-in: in has been softened from the hardened form, with its subject having been omitted, that is to say, [understand it as] wa-innahum) before that, [before] his coming, they had been in manifest error.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is Who hath sent among the unlettered ones) the Arabs (a messenger of their own) of their own lineage, i.e. Muhammad (pbuh) (to recite unto them His revelations) the Qur'an which exposits commands and prohibitions (and to make them grow) and to cleanse them from idolatry by means of belief in Allah's divine Oneness; and it is also said this means: He cleanse them by means of them giving the poor-due from their wealth, and also by them repenting; in other words: He invites them to do so, (and to teach them the Scripture) i.e. the Qur'an (and Wisdom) the lawful and the unlawful; it is also said this means: knowledge and the admonitions of the Qur'an, (though heretofore) before the Prophet (pbuh) brought them the Qur'an (they) i.e. the Arabs (were indeed in error manifest) in manifest disbelief,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { هُوَ ٱلَّذِي بَعَثَ فِي ٱلأُمِّيِّينَ رَسُولاً } معناه في الذين لاَ يَكتُبونَ\n\n\n\n\nوقوله تعالى: { وَيُزَكِّيهِمْ } معناه يُطهرُهم\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us that Ali ibn Ahmad narrated to him.\n\n\nHe said: It was narrated to us by `Ata' ibn al-Saa'ib from Abu Khalid from Zayd ibn `Ali, upon them both be peace, regarding the words of God Almighty, {It is He who sent a Messenger among the unlettered} [i.e. those who cannot read or write], meaning those who do not write.\n\n\nAnd His saying, \"And He will purify them\" - this means that He will cleanse them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ناشئاً { مِّنْهُمْ } وأيده بروح القدس بعدما أصفاه من دنس الجهل\n واصطفاه من بين الملل\n وفضَّله على جميع أرباب النحل\n وجعله في كمال المعارف والحقائق الإلهية\n بحيث { يَتْلُواْ عَلَيْهِمْ } عموم { آيَاتِهِ } الدالة على وحدة ذاته\n وعلى كمال أسمائه وصفاته { وَيُزَكِّيهِمْ } عن مطلق النقائض والآثام المنافية لدين الإسلام\n المبين للتوحيد الذاتي\n\n\n{ وَ } بالجملة: { يُعَلِّمُهُمُ } بمقتضى الوحي الإلهي { ٱلْكِتَابَ } أي: القرآن الجامع لما في الكتب السالفة من الحكم والأحكام على أبلغ بيان\n وأبدع نظام { وَٱلْحِكْمَةَ } أي: الأحكام الشرعية المنزلة من عند العليم الحكيم العلاَّم { وَإِن كَانُواْ مِن قَبْلُ } أي: وإنهم كانوا قبل بعثته صلى الله عليه وسلم { لَفِي ضَلاَلٍ مُّبِينٍ } [الجمعة: 2] وغواية ظاهرة\n لأنهم كانوا على فترة من الرسل\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقيل: { منهم }: من أنفسهم\n يعلمون نَسَبه وأحواله وصِدْقَه\n والأُمي: منسوب إلى أميّة العرب لأنهم لايقرؤون ولا يكتبون من بين الأمم\n قيل\n بُدئت الكتابة في العرب بالطائف وهم أخذوها من أهل الحيرة\n وأهل الحيرة من أهل الأنبار\n { يتلو عليهم آياته } القرآن { ويُزكِّيهم } يطهرهم من الشرك وخبائث الجاهلية\n { ويُعَلّمهم الكتابَ } القرآن { والحكمةَ } السُنَّة\n أو الفقه في الدين\n أو إتقان العلم والعمل\n { وإِن كانوا من قبلُ لفي ضلالٍ مبين } كفر وجهالة\n و \" إن \" مخففة\n أي: وإن الشأن كانوا في ضلال فظيع\n وهو بيان لشدة افتقارهم لمَن يرشدهم\n وإزاحة لِمَا عسى أن يتوهم مِن تعلُّمه صلى الله عليه وسلم مِن الغير إذ كلهم كانوا مغروقين في الجهل والضلال\n ليس فيهم مَن يعلم شيئاً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:129",
      "similarity": 0.8047938735646015
    },
    {
      "verse": "3:164",
      "similarity": 0.7217040200270097
    },
    {
      "verse": "2:151",
      "similarity": 0.6954995433432715
    },
    {
      "verse": "28:59",
      "similarity": 0.49486819859435094
    },
    {
      "verse": "3:58",
      "similarity": 0.4238737467870779
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/062002.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/062002.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/62:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}