{
  "chapter": "الجمعة",
  "text": "وءاخرين منهم لما يلحقوا۟ بهم وهو العزيز الحكيم",
  "translations": [
    {
      "translation": "And others of them who have not yet joined them. He is the Almighty, the All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for others among them who have not joined them yet. He is all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and (He has also) sent him to those others who have not yet joined them. He is the Most Mighty, the Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and others who have not yet joined, and He will give them wisdom. Before this they had been in plain error. God is Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he (the Holy Prophet) bestows knowledge to others along with them, who have not yet joined them; and He only is the Most Honourable, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And others among them who have not yet joined them. And He is the Almighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And others from among them who have not yet joined them; and He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and others of them who have not yet joined them. And He is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Along with others of them who have not yet joined them. He is the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to others also, from among them, who have not yet joined them. He is the Mighty, the Wise One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And also others of them who have not yet joined them. And He is the Mighty; the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to others from among them [as well] who have not yet joined them. And He is the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As well as (to confer all these benefits upon) others of them, who have not already joined them: And He is exalted in Might, Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He has sent him (Prophet Muhammad SAW) also to others among them (Muslims) who have not yet joined them (but they will come). And He (Allah) is the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "together with others who have not as yet joined them. He is the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And others from them, who have not yet joined them. He is the Glorious, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [to] others of them who have not yet joined them. And He is the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[62:3] And [to] others (wa-ākharīna is a supplement to al-ummiyyīna, ‘the unlettered’), that is to say, those who are alive, from among them, and [to] those of them who will come after them, who have not yet joined them, with regard to precedence and merit; and He is the Mighty, the Wise, in His kingdom and in His actions: those [mentioned as coming afterwards] are the Successors (al-tābi‘ūna); and it suffices to mention these [Successors] in order to illustrate the [greater] merit of the Companions, among whom the Prophet (s) was sent, over all those others, of humans and jinn, to whom he was [also] sent and who [believed and] will believe in him up until the Day of Resurrection, for every generation is better than the succeeding one.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Along with others of them) of the Arabs; and it is also said: of the clients (who have not yet joined them) who have not joined the first Arabs. He says: they have not joined yet but they will join later. He says: Allah sent Muhammad (pbuh) as a Messenger to the Arabs as well as to the clients. (He is the Mighty) in retribution against those who disbelieve in Him, in His Scripture and in His Messenger Muhammad (pbuh) (the Wise) in His command and decree and He has decreed that none should be worshipped except Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُواْ بِهِمْ } هم الأَعاجمُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And others of them, when they have joined them}, refers to the Arabs.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لم يختص بعثته صلى الله عليه وسلم بالأميين من الأعراب الموجودين عند بعثته صلى الله عليه وسلم بل يعم { آخَرِينَ مِنْهُمْ } أي: من عموم المكلفين { لَمَّا يَلْحَقُواْ بِهِمْ } أي: حين يتبعوا بالأولين إلى يوم القيامة\n إذ خُتم ببعثته صلى الله عليه وسلم أمر البعثة \n وكمل عند ظهوره صلى الله عليه وسلم بنيان الدين القويم الذي هو صراط التوحيد الذاتي { وَهُوَ } سبحانه { ٱلْعَزِيزُ } الغالب على عموم التقادير { ٱلْحَكِيمُ } [الجمعة: 3] المطلق في جميع الأفعال والتدابير\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وآخرين منهم }: عطف على \" الأميين \" أي: بعث في الأميين\n الذين في عصره\n وفي آخرين من الأميين { لَمَّا يلحقوا بهم } أي: لم يلحقوا بهم بعدُ\n وسيلحقون\n وهم الذين يأتون بعد الصحابة إلى يوم القيامة\n وقيل: هم العجم\n أي: وآخرين من جنسهم\n وقيل: عطف على \" يُعلّمهم \" أي: يُعلّم أخرين منهم\n وعلى كلِّ فدعوته صلى الله عليه وسلم عامة\n { وهو العزيزُ الحكيم } المبالغ في العزة والحكمة\n ولذلك مكَّن رجلاً أميًّا من ذلك الأمر العظيم\n واصطفاه من بين كافة البشر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:27",
      "similarity": 0.855222011539851
    },
    {
      "verse": "26:83",
      "similarity": 0.8268264549008693
    },
    {
      "verse": "3:170",
      "similarity": 0.7014615675951265
    },
    {
      "verse": "12:101",
      "similarity": 0.6700559545146652
    },
    {
      "verse": "52:21",
      "similarity": 0.18828534662814084
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/062003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/062003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/62:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}