{
  "chapter": "الجمعة",
  "text": "ذلك فضل الله يؤتيه من يشاء والله ذو الفضل العظيم",
  "translations": [
    {
      "translation": "That is Allah's favour which He gives to whoever He wills. Allah's favour is indeed immense.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the bounty of God, He gives whosoever He please. God is master of great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Allah's favour: He bestows it on whomsoever He pleases. Allah is the Lord of abounding favour.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the favor of God which He grants to whomever He wants. God's favor is great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is Allah’s munificence, which He may give to whomever He wills; and Allah is Extremely Munificent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the grace of Allah, which He bestows on whom He wills. And Allah is the Owner of mighty grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Allah's grace; He grants it to whom He pleases, and Allah is the Lord of mighty grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the bounty of God; He gives it to whom He will, and God is of bounty abounding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the bounty of Allah; which He giveth unto whom He will. Allah is of Infinite Bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is God's grace; He bestows it on whom He pleases; for God is limitless in His grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the grace of Allah: He vouchsafeth it on whomsoever He will. And Allah is the Owner of mighty Grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Allah’s grace, which He grants to whomever He wishes, and Allah is dispenser of a great grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the Bounty of Allah, which He bestows on whom He will: and Allah is the Lord of the highest bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the Grace of Allah, which He bestows on whom He wills. And Allah is the Owner of Mighty Grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the Favor of Allah; He gives it to whom He will, and Allah is of abounding favors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is God’s grace, which He grants to whomever He wills. God is Possessor of limitless grace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the bounty of Allah, which He gives to whom He wills, and Allah is the possessor of great bounty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[62:4]   That is the bounty of God, which He gives to whom He will — [such as] the Prophet and those mentioned with him — and God is [dispenser] of tremendous bounty.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That) which I have mentioned regarding prophethood, Scriptures and the confession of Allah's divine Oneness (is the bounty of Allah) is a bounty from Allah; (which He giveth unto) and honour with (whom he will) whoever deserves it. (Allah is of Infinite Bounty) by bestowing Islam and prophethood upon Muhammad (pbuh); and it is also said this means: by bestowing Islam upon the believers; and it is also said this means: by sending the Messenger and Scripture to His created beings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَلِكَ } أي: التوحيد الذايت الذي ظهر به صلى الله عليه وسلم رحمةً للعالمين { فَضْلُ ٱللَّهِ } العزيز الحكيم { يُؤْتِيهِ مَن يَشَآءُ } من عباده بلا سبق الوسائل والأسباب العادية { وَٱللَّهُ } المتعزز برداء العظمة والكبرياء { ذُو ٱلْفَضْلِ ٱلْعَظِيمِ } [الجمعة: 4] الذي لا يُكتنه وصف فضله وطوله أصلاً\n\n\nثمَّ قال سبحانه تعريضاً على الكفرة المنكرين لنبوة محمد صلى الله عليه وسلم\n مع أنه قد ورد في كتبهم المنزلة عليهم بعثته وحليته صلى الله عليه وسلم\n وهم مؤمنون بها\n مصدقون بجميع ما فيها سوى بعثته صلى الله عليه وسلم\n وما جاء فيها من أوصافه صلى الله عليه وسلم الدالة على علو شأنه\n ورفعة قدره ومكانه\n وبالجملة: { مَثَلُ } القوم { ٱلَّذِينَ حُمِّلُواْ ٱلتَّوْرَاةَ } أي: علموها وكلِّفوا بما فيها من الأوامر والنواهي",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك } الذي امتاز به محمد صلى الله عليه وسلم من بين سائر البشر { فضلُ الله } وإحسانه\n أو: ذلك التوفيق حتى يؤمنوا من فضل الله\n لا باستحقاق\n أو الاعتناء بالبعث وعدم الإهمال\n مع ما حصل منه من النتائج المذكورة\n فضل من الله\n وقطع الأسباب في الجملة في استحقاق الفضل إذ علقه بالمشيئة في قوله: { يؤتيه مَن يشاء } تفضُّلاً وعطية\n { والله ذو الفضل العظيم } الذي يُستحقر دونه نِعم الدنيا والآخرة\n\nالإشارة: كل مَن لم يعرف الله معرفةَ العيان\n فهو من الأميين\n فكما مَنَّ الله تعالى على عباده ببعثه الرسول\n بعد أن كانوا في ضلالٍ مبين\n كذلك مَنَّ على أمته بعده\n فبَعَثَ مشايخَ التربية يتلو عليهم آياته الدالة على شهوده وظهوره\n ويزكيهم من الرذائل التي تحجبهم عن الله\n ويُعلّمهم أسرارَ الكتاب\n وأسرارَ الحكمة\n وهي الشريعة\n إذ لا يوقف على أسرارهما إلاّ بعد تطهير القلوب\n وتزكية النفوس\n وإن كانوا من قبل ملاقاة المشايخ لفي ضلال مبين\n حائدين عن طريق الشهود\n وبعث أيضاً في آخرين منهم من يُذكِّرهم ويُعرفهم بالله\n وهكذا لا ينقطع الداعي إلى يوم القيامة\n لكن لا يصل إليه إلاّ مَن أراد الله أن يوصله إليه\n ولذلك قال: { ذلك فضل الله يؤتيه من يشاء\n\n\n } الآية\n ولمَّا خَصَّ اللهُ العربَ بهذه المزية العظمى\n قالت اليهود: نحن أهل الكتاب\n وفينا العلم قبلكم\n فأنزل الله تعالى: { مَثَلُ ٱلَّذِينَ حُمِّلُواْ ٱلتَّوْرَاةَ ثُمَّ لَمْ يَحْمِلُوهَا }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "57:29",
      "similarity": 0.6430178129489765
    },
    {
      "verse": "8:29",
      "similarity": 0.49971766594277384
    },
    {
      "verse": "44:57",
      "similarity": 0.4536990535134374
    },
    {
      "verse": "3:174",
      "similarity": 0.4322693743709204
    },
    {
      "verse": "27:73",
      "similarity": 0.42962722078210475
    }
  ]
}