{
  "chapter": "الجمعة",
  "text": "قل ان الموت الذى تفرون منه فانه ملقيكم ثم تردون الى علم الغيب والشهدة فينبئكم بما كنتم تعملون",
  "translations": [
    {
      "translation": "Say: 'Death, from which you are fleeing, will certainly catch up with you. Then you will be returned to the Knower of the Unseen and the Visible and He will inform you about what you did.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"Death from which you run, will surely come to you. You will then be sent back to Him who knows the unknown and the known, who will tell you what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: “The death from which you flee will certainly overtake you. Then you will be returned to Him Who fully knows what is hidden and what is manifest. Thereupon He will let you know all that you used to do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"The death from which you run away will certainly approach you. Then you will be returned to the One who knows the unseen and the seen, and He will tell you what you have done\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “Indeed death which you run away from will surely confront you, then you will be returned to Him Who knows all the hidden and the visible – He will then inform you of what you did.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Verily, the death from which you flee, will surely meet you, then you will be sent back to the Knower of the unseen and the seen, and He will inform you about what you used to do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: (As for) the death from which you flee, that will surely overtake you, then you shall be sent back to the Knower of the unseen and the seen, and He will inform you of that which you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Surely death, from which you flee, shall encounter you; then you shall be returned to the Knower of the Unseen and the Visible, and He will tell you that you have been doing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (unto them, O Muhammad): Lo! the death from which ye shrink will surely meet you, and afterward ye will be returned unto the Knower of the Invisible and the Visible, and He will tell you what ye used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So say, \"The death you run away from will certainly meet you, and thereafter you will be brought back to the Knower of the unseen and the seen, and He will declare to you what you have done.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: verily the death which ye flee from! then verily it will meet you and thereafter ye will be brought back Unto the Knower of the unseen and the seen, and He will declare Unto you that which ye have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘The death that you flee will indeed encounter you. Then you will be returned to the Knower of the sensible and the Unseen, and He will inform you about what you used to do.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"The Death from which ye flee will truly overtake you: then will ye be sent back to the Knower of things secret and open: and He will tell you (the truth of) the things that ye did!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (to them): \"Verily, the death from which you flee will surely meet you, then you will be sent back to (Allah), the All-Knower of the unseen and the seen, and He will tell you what you used to do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Death from which you flee is sure to reach you. Then you shall be returned to the Knower of the Unseen and the Visible, and He will tell you all that you have done'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “The death from which you flee will catch up with you; then you will be returned to the Knower of the Invisible and the Visible, and He will inform you of what you used to do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Indeed, the death from which you flee - indeed, it will meet you. Then you will be returned to the Knower of the unseen and the witnessed, and He will inform you about what you used to do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[62:8] Say: ‘Assuredly the death from which you flee (fa-innahu: the fā’ is extra) will indeed encounter you; then you will be returned to the Knower of the Unseen and the visible, [the Knower of] what is [kept] secret and what is in the open, and He will inform you of what you used to do’, whereat He will requite you for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) unto them, Muhammad: (Lo! the death from which ye shrink) the death which you dislike (will surely meet you) will inevitably befall you, (and afterward ye will be returned) in the Hereafter (unto the Knower of the invisible) i.e. that which is hidden from the slaves and will happen in the future (and the visible) that which the people know and has already happened, (and He will tell you what ye used to do) and say whether it is good or evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم يا أكمل الرسل بعدما أعرضوا عن تمني الموت وابتغائه طلباً لمرضاة الله\n وشوقاً إليه أيضاً على وجه التبكيت والإلزام: { إِنَّ ٱلْمَوْتَ ٱلَّذِي تَفِرُّونَ مِنْهُ } وتخافون أن تمنوه بلسانكم مخالفة أنه لا يلحقكم\n بل تفرون عن مجرد التلفظ به\n فكيف عن لحوقه { فَإِنَّهُ مُلاَقِيكُمْ } ملاصقكم\n ولاحق بكم حتماً\n إذ كل نفس ذائقة كأس لموت\n ولك حي لا بدَّ وأن يموت سوى الحي الذي لا يموت\n ولا يفوت { ثُمَّ } بعدما تموتون { تُرَدُّونَ } وتُحشرون نحو المحشر\n وتعرضون { إِلَىٰ عَالِمِ ٱلْغَيْبِ وَٱلشَّهَادَةِ } بعلمه الحضوري { فَيُنَبِّئُكُم } ويخبركم حينئذٍ { بِمَا كُنتُمْ تَعْمَلُونَ } [الجمعة: 8] من خير وشر\n فيجازيكم عليهما\n\n\nثمَّ لمَّا تهاون المسلمون في أمر الجمعة\n وتكاسلوا في الاجمتاع قبل الصلاة\n بل انفضوا وصرفوا عن الجامع حين خطب رسول الله صلى الله عليه وسلم\n حين سمعوا صداء الملاهي المعهودة لمجيء العير على ما هو عادتهم دائماً\n عاتبهم الله سبحانه\n وأنزل عليهم الآية: { يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ } مقتضى إيمانكم: المبادرة إلى مطلق الطاعات\n سيما { إِذَا نُودِيَ } وأُذن { لِلصَّلاَةِ مِن يَوْمِ ٱلْجُمُعَةِ } أي: في يوم الجمعة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإنه مُلاقيكم } لا محالة\n من خير صارف يلويه\n ولا عاطف يُثنيه\n وقد قال صلى الله عليه وسلم:\n\n \" لو تَمَنَّوه لماتوا من ساعتهم \" \n\n وهذه إحدى المعجزات\n ودخلت الباء في خبر \" إن \" مع أنه لا يجوز: إن زيداً فمنطلق لأنَّ \" الذي \" قد عُرف فيه معنى الشرط والجزاء\n كأنه قيل: إن فررتم من أي موت كان من قتال أو غيره\n فإنه ملاقيكم\n { ثم تُرَدُّون إلى عالم الغيب والشهادة } الذي لاتخفى عليه خافية\n { فيُنبئكم بما كنتم تعملون } من الكفر والمعاصي\n بأن يجازيكم عليها\n قال الكواشي: أكذب اللهُ اليهودَ في ثلاث\n افتخروا بأنهم أولياء الله فكذبهم بقوله: { فتَمنَّواالموتَ } وبأنهم أهل الكتاب والعرب لا كتاب لهم\n فشُبِّهوا بالحمار يحمل أسفاراً\n وبالسبت\n وأنه ليس للمسلمين مثله\n فجعل الله لهم الجمعة\n هـ\n ولذلك ذكرها بإثر تكذيبهم\n الإشارة: مَثَلُ الذي يقرأ القرآن ويتلوه ولا يتدبّر معانيه\n أو يقرأ العلم ولا يعمل به\n كمثل الحمار\n\nالخ\n وعُروض الموت على النفس\n أو العمل أو الحال\n ميزان صحيح\n فكل حال وعمل\n أو شخص هزمه الموت فهو معلول\n وحب البقاء للترقِّي والتوسعة في المعرفة محمود\n وغيره مذموم\n وقد تقدّم في البقرة تفصيل ذلك\n فراجعه إن شئت\n وأمّا تمني الموت فقد نُهي عنه\n إلاّ لخوف الفتنة\n فقد قال ابن عباس لعمر رضي الله عنهما: ما لك تُكثر الدعاء بالموت؟ وما الذي مَلِلت من العيش؟ أما تُقوّم فاسداً وتعين صالحاً؟ فقال عمر: يا بن عباس! كيف لا أتمنى الموت\n وأطلب القدوم على الله\n ولست أرى في الناس إلاّ فاتحاً فاه لِلعدة من الدنيا إمّا بحق لا يثق به\n أو بباطل لا يناله\n ولولا أن يسألني ربي عن الناس لفررت منهم\n وتصبح الأرض مني بلاقع\n هـ\n وقيل لسفيان الثوري: لِمَ تتمنَّ الموت\n وقد نهى رسولُ الله صلى الله عليه وسلم عنه؟ فقال: إن سألني ربي عن ذلك أقول: لثقتي بك يا رب\n وخوفي من الناس\n ثم أنشد:\nوقال طاوس: لا يحرز المرء إلاَّ حفرته\n وأنشدوا:\nثم ذكر شأن الجمعة\n ردًّا على افتخار اليهود بالسبت\n فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ إِذَا نُودِيَ لِلصَّلاَةِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "51:50",
      "similarity": 0.7023328498580076
    },
    {
      "verse": "71:6",
      "similarity": 0.6567090942648325
    },
    {
      "verse": "80:34",
      "similarity": 0.6274207113001584
    },
    {
      "verse": "33:16",
      "similarity": 0.5985753785047655
    },
    {
      "verse": "75:10",
      "similarity": 0.5924590288681052
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/62:8.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/62:8.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/62:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}