{
  "chapter": "الجمعة",
  "text": "يايها الذين ءامنوا۟ اذا نودى للصلوة من يوم الجمعة فاسعوا۟ الى ذكر الله وذروا۟ البيع ذلكم خير لكم ان كنتم تعلمون",
  "translations": [
    {
      "translation": "You who have iman! when you are called to salat on the Day of Jumu'a, hasten to the remembrance of Allah and abandon trade. That is better for you if you only knew.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, when the call to prayer is made on the day of congregation, hasten to remember God, putting aside your business. This is better for you if you can understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when the call for Prayer is made on Friday, hasten to the remembrance of Allah and give up all trading. That is better for you, if you only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, on Friday when the call for prayer is made, try to attend prayer (remembering God) and leave off all business. This would be better for you if only you knew it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! When the call for prayer is given on (Friday) the day of congregation, rush towards the remembrance of Allah and stop buying and selling; this is better for you if you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When the call is proclaimed for the Salah on Al-Jumu`ah (Friday), then hasten (Fas`aw) to the remembrance of Allah and leave off business. That is better for you if you did but know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! when the call is made for prayer on Friday, then hasten to the remembrance of Allah and leave off trading; that is better for you, if you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, when proclamation is made for prayer on the Day of Congregation, hasten to God's remembrance and leave trafficking aside; that is better for you, did you but know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! When the call is heard for the prayer of the day of congregation, haste unto remembrance of Allah and leave your trading. That is better for you if ye did but know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! When the call to prayer is made on the day of congregation, hasten to the remembrance of God, and leave all worldly commerce: this is for your own good, if you but knew it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! when the call to prayer is made on the day of Friday then repair Unto the remembrance of Allah and leave off bargaining. That is better for you if ye know\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! When the call is made for prayer on Friday, hurry toward the remembrance of Allah, and leave all business. That is better for you, should you know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! When the call is proclaimed to prayer on Friday (the Day of Assembly), hasten earnestly to the Remembrance of Allah, and leave off business (and traffic): That is best for you if ye but knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe (Muslims)! When the call is proclaimed for the Salat (prayer) on the day of Friday (Jumu'ah prayer), come to the remembrance of Allah [Jumu'ah religious talk (Khutbah) and Salat (prayer)] and leave off business (and every other thing), that is better for you if you did but know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, when you are called to prayer on the Day of the Congregation (Friday), hasten to the Remembrance of Allah and put your trading to oneside. That is the best for you, if you but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! When the call is made for prayer on Congregation Day, hasten to the remembrance of God, and drop all business. That is better for you, if you only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, when [the adhan] is called for the prayer on the day of Jumu'ah [Friday], then proceed to the remembrance of Allah and leave trade. That is better for you, if you only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[62:9] O you who believe, when the call for prayer is made on Friday, hasten, set off, to the remembrance of God, to the prayer, and leave aside [all] commerce, suspend [all] such contracts. That is better for you, should you know, that it is better for you, then do it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe) in Muhammad (pbuh) and the Qur'an! (When the call is heard for the prayer) when the call to prayer calls you for the prayer (of the day of congregation, haste unto remembrance of Allah) haste to the sermon of the Imam and to praying with him (and leave your trading) and leave trading after the call to prayer. (That) listening to the sermon of the Imam and prayer (is better for you) than earning money and trading (if ye did but know) if you believe in the reward of Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱسْعَوْاْ إِلَىٰ ذِكْرِ ٱللَّهِ } معناه أجيبوه\n وذِكرُ الله تعالى: موعظةُ الإِمامِ\n ويقالُ: الوقتُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا تهاون المسلمون في أمر الجمعة، وتكاسلوا في الاجمتاع قبل الصلاة، بل انفضوا وصرفوا عن الجامع حين خطب رسول الله صلى الله عليه وسلم، حين سمعوا صداء الملاهي المعهودة لمجيء العير على ما هو عادتهم دائماً، عاتبهم الله سبحانه، وأنزل عليهم الآية: { يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ } مقتضى إيمانكم: المبادرة إلى مطلق الطاعات، سيما { إِذَا نُودِيَ } وأُذن { لِلصَّلاَةِ مِن يَوْمِ ٱلْجُمُعَةِ } أي: في يوم الجمعة، وهو الأذان المعهود قبيل الجمعة { فَٱسْعَوْاْ } مسرعين مجيبين { إِلَىٰ } سماع { ذِكْرِ ٱللَّهِ } في الخطبة والتذكيرات الواردة فيها { وَذَرُواْ } واتركوا { ٱلْبَيْعَ } بعد سماع الأذان { ذَلِكُمْ } أي: ترك البيع والانصراف نحو المسجد { خَيْرٌ لَّكُمْ } وأنفع في عقابكم { إِن كُنتُمْ تَعْلَمُونَ } [الجمعة: 9] صلاحكم وإفسادكم في أولاكم وأخراكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الذين آمنوا إِذا نودي للصلاة من يوم الجمعة } ، والإمام على المنبر، و \" مِن \" بيان لـ \" إذا \" أو تفسير لها، وقيل: \" مِن \" بمعنى \" في \" كقوله:\n\n[فاطر:40 و الأحقاف:4] أي: في الأرض\n وإنما سُمي جُمعة لاجتماع الناس فيه للصلاة، وقيل: أول مَن سمّاها جمعة: كعب بن لؤي، وكان يُسمى العروبة، وقيل: إنَّ الأنصار قالوا قبل الهجرة: لليهود يومٌ يجتمعون فيه في كل سبعة أيام، وللنصارى مثل ذلك، فهلُموا نجعل يوماً نجتمع فيه، فنذكر الله نُصلّي، فقالوا: يوم السبت لليهود، ويوم الأحد للنصارى، فاجعلوه يوم الجمعة، فاجتعوا إلى سعد بن زُرارة، فصلَّى بهم ركعتين، وذكَّرهم، فسموه يومَ الجمعة، لاجتماعهم فيه، فأنزل الله آية الجمعة ـ أي: بعد ذلك ـ تقريراً لفعلهم، فهي أول جمعة كانت في الإسلام\n وأما أول جمعة جمعها رسولُ الله صلى الله عليه وسلم فهي لمَا قَدِم المدينةَ مهاجراً، نزل قباء، على بني عَمرو بن عوف، وأقام بها يوم الاثنين والثلاثاء الأربعاء والخميس، وأسّس مسجدهم، ثم خرج يوم الجمعة عامداً إلى المدينة، فأدركته الصلاة في بني سالم بن عوف، في بطن وادٍ لهم، وقد بنوا هناك مسجداً، فخطب، وصلّى الجمعة فيه\n انظر الثعلبي\n ويوم الجمعة سيد الأيام، وفي الحديث:\n\n \" مَن مات يوم الجمعة كتب الله له أجر شهيد، ووُقي فتنة القبر \"\n \n\nفإذا نُودي للصلاة { فاسْعَوا إِلى ذكر الله } أي: امشوا واحضروا الخطبة والصلاة { وذَرُوا البيع } أي: اتركوا المعاملة كلها، وإنما خص البيع لأنّ يوم الجمعة كان سوقًا يتكاثر فيه البيع والشراء عند الزوال، فقيل لهم: بادِروا إلى تجارة الآخرة، واتركوا تجارة الدنيا، { واسْعَوا إِلى ذكر الله } الذي لا شيء أنفع منه، { ذالكم } أي: السعي إلى ذكر الله { خيرٌ لكم } من البيع والشراء { إِن كنتم تعلمون } الخير والشر الحقيقيين، أو: إن كنتم من أهل العلم",
      "translations": []
    }
  ]
}