{
  "chapter": "المنافقون",
  "text": "وانفقوا۟ من ما رزقنكم من قبل ان ياتى احدكم الموت فيقول رب لولا اخرتنى الى اجل قريب فاصدق واكن من الصلحين",
  "translations": [
    {
      "translation": "Give from what We have provided for you before death comes to one of you and he says, 'My Lord, if only you would give me a little more time so that I can give sadaqa and be one of the righteous!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Spend of what We have given you before death comes to one of you, when he will say: \"O Lord, why did you not defer my term for a while that I could give alms and be among the doers of good?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And spend of what Allah has granted you by way of sustenance before death should come to any of you and he should say: “Lord, why did You not defer my return for a while so that I might give alms and be among the righteous?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Spend for the cause of God out of what We have given you before death approaches you, and say, \"Lord, would that you would give me respite for a short time so that I could spend for Your cause and become one of those who do good\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And spend from what We have provided you before death approaches any one of you and he then says, “My Lord! Why did you not give me respite for a little while, so I would have given charity and become of the virtuous?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And spend of that with which We have provided you before death comes to one of you, and he says: \"My Lord! If only You would give me respite for a little while, then I should give Sadaqah from my wealth, and be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And spend out of what We have given you before death comes to one of you, so that he should say: My Lord! why didst Thou not respite me to a near term, so that I should have given alms and been of the doers of good deeds?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Expend of what We have provided you before that death comes upon one of you and he says, 'O my Lord, if only Thou wouldst defer me unto a near term, so that I may make freewill offering, and so I may become one of the righteous.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And spend of that wherewith We have provided you before death cometh unto one of you and he saith: My Lord! If only thou wouldst reprieve me for a little while, then I would give alms and be among the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And spend out of what We have provided you with before death comes to one of you and he says, \"My Lord! If only You would grant me respite for a little while, then I would give alms and be among the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And expend of that wherewith We have provided you afore death cometh Unto one of you, and he saith: 'my Lord! wouldst Thou not defer me for a short term, so that I would give alms and become of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Spend out of what We have provided you before death comes to any of you, whereat he might say, ‘My Lord, why did You not respite me for a short time so that I could give charity and become one of the righteous!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and spend something (in charity) out of the substance which We have bestowed on you, before Death should come to any of you and he should say, \"O my Lord! why didst Thou not give me respite for a little while? I should then have given (largely) in charity, and I should have been one of the doers of good\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And spend (in charity) of that with which We have provided you, before death comes to one of you and he says: \"My Lord! If only You would give me respite for a little while (i.e. return to the worldly life), then I should give Sadaqah (i.e. Zakat) of my wealth, and be among the righteous [i.e. perform Hajj (pilgrimage to Makkah)].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So spend of that with which We have provided you before death comes upon any of you and he then says: 'O my Lord, if only You would defer me to anear term, so that I could give in charity and be among the good doers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give from what We have provided for you, before death approaches one of you, and he says, “My Lord, if only You would delay me for a short while, so that I may be charitable, and be one of the righteous.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And spend [in the way of Allah] from what We have provided you before death approaches one of you and he says, \"My Lord, if only You would delay me for a brief term so I would give charity and be among the righteous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[63:10] And expend, in alms, of that with which We have provided you before death comes to any of you, whereat he will say, ‘My Lord, if only (law-lā means hal-lā, ‘why [do You] not’; or the lā is extra and the law is optative) You would reprieve me for a short time so that I might give charity (assaddaq: the original tā’ [of atasaddaqa] has been assimilated with the sād), that I might offer alms, and become one of the righteous!’, by making the Pilgrimage. Ibn ‘Abbās, may God be pleased with both [him and his father], said, ‘Every person who has fallen short of [his duty regarding] alms and the Pilgrimage will ask to be returned [to this world] at the moment of death’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And spend) give alms for the sake of Allah (of that wherewith We have provided you) of wealth; and it is also said this means: pay the poor-due from your wealth (before death) the seizure of death (cometh unto one of you and he saith: My Lord! If only thou wouldst reprieve me for a little while) as long as I lived in the life of the world, (then I would give alms) from my wealth and also give the poor-due (and be among the righteous) and use that wealth to go to pilgrimage.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وعلامات الفزع { فَيَقُولَ } المحتضر منكم حينئذٍ متحسراً: { رَبِّ لَوْلاۤ أَخَّرْتَنِيۤ } أي: هلاَّ أمهلتني يا رب { إِلَىٰ أَجَلٍ قَرِيبٍ } وأمد غير بعيد { فَأَصَّدَّقَ } وأتصدق من مالي هذا على الوجه المأمور طلباً لمرضاتك { وَ } بعد التصدق { أَكُن مِّنَ ٱلصَّالِحِينَ } [المنافقون: 10] المنفقين\n الممتثلين لأمرك\n المقبولين عندك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأَنفِقوا مِن مَّا رزقناكم } أي: بعض ما رزقناكم\n تفضُّلاً\n من غير أن يكون حصوله من جهتكم ادخاراً للآخرة\n وهو عام في المفروض والمندوب\n { مِن قبل أن يأتي أحدَكُم الموتُ } بأن يُشاهد دلائله\n ويُعاين أمارته ومخايله\n وتقديم المفعول على الفاعل للاهتمام بما قدّم\n والتشويق لِما أخّر\n { فيقولَ } حين تَيَقُنِه بحلوله: { لولا أخَّرتني } أمهلتني { إلى أجلٍ قريب } أمدٍ قصيرٍ\n { فأصَّدَّقَ } بالنصب جواب التمني { وأكن من الصالحين } بالجزم\n عطفاً على محل { فأصَّدق } أو: على توهُّم إسقاط الفاء\n كأنه قيل: إن أخرتني أصَّدَّق وأكن\n وقرأ أبو عمرو بالنصب عطفاً على اللفظ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:104",
      "similarity": 0.31575503797822263
    },
    {
      "verse": "56:57",
      "similarity": 0.2973153841159899
    },
    {
      "verse": "77:12",
      "similarity": 0.2965951020914318
    },
    {
      "verse": "8:3",
      "similarity": 0.29403734033621887
    },
    {
      "verse": "15:5",
      "similarity": 0.29156689248068196
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/063010.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/063010.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/63:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}