{
  "chapter": "المنافقون",
  "text": "ولن يؤخر الله نفسا اذا جاء اجلها والله خبيرۢ بما تعملون",
  "translations": [
    {
      "translation": "But God does not grant a soul respite once its term has come to end. And God is aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when a person's term comes to an end, Allah never grants any respite. Allah is well aware of all that you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will never grant respite to any soul when its appointed time has come. God is Well-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah will never give respite to any soul when its promise arrives; and Allah is Aware of your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah grants respite to none when his appointed time comes. And Allah is All-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah does not respite a soul when its appointed term has come, and Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But God will never defer any soul when its term comes. And God is aware of the things you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah reprieveth no soul when its term cometh, and Allah is Informed of what ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But God will not grant a reprieve to a soul when its appointed time has come; God is well-aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah deferreth not a soul when its term- hath come; and Allah is Aware of that which ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah will never respite anyone when his time has come, and Allah is well aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But to no soul will Allah grant respite when the time appointed (for it) has come; and Allah is well acquainted with (all) that ye do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah grants respite to none when his appointed time (death) comes. And Allah is All-Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah will never defer any soul when its term comes. Allah is Aware of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But God will not delay a soul when its time has come. God is Informed of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But never will Allah delay a soul when its time has come. And Allah is Acquainted with what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[63:11] But God will never reprieve a soul when its term has come. And God is Aware of what you do (ta‘malūna; also read [as the third person plural] ya‘malūna, ‘they do’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But Allah reprieveth no soul when its term comes, and Allah is Aware of what ye do) whether it is good or evil. From His saying (0 ye who believe) up to here was revealed about the hypocrites; as for Allah's saying (then I would give alms and be among the righteous) if it is taken to mean the hypocrites, then it would mean: I will do with my wealth as the believers do and be among those who are true in their faith'. And of the surah in which Mutual disillusion is mentioned which is Meccan/Medinan, and consists of 18 verses, 241 words, and 1,070 letters: Surah 64: Mutual Disillusion (al-Taghabun) And of the surah in which Mutual disillusion is mentioned which is Meccan/Medinan, and consists of 18 verses, 241 words, and 1,070 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فأما عند حضور الموت فالمال للوارث لا له فلا ينفعه إنفاقه وليس له إلا التحسر والتندم وتمنى التأخير في الأجل بالجهل فإنه لو كان صادقاً في دعوى الإيمان وموقناً بالآخرة لتيقن أن الموت ضروري وأنه مقدّر في وقت معين قدّره الله فيه بحكمته فلا يمكن تأخره { والله خبير } بأعمالكم ونياتكم فلا ينفع الإنفاق في ذلك الوقت ولا تمني التأخير في الأجل، ووعد التصدّق والصلاح لعلمه بأنه ليس عن ملكة السخاء ولا عن التجرد والزكاء بل من غاية البخل وحب المال كأنه يحسب أنه يذهب به معه وبأن ذلك التمني والوعد محض الكذب ومحبة العاجلة لوجود الهيئة المنافية للتصدّق والصلاح في النفس والميل إلى الدنيا، كما قال الله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلموا أيها المؤمنون يقيناً أنه { لَن يُؤَخِّرَ ٱللَّهُ نَفْساً } ولن يمهلها أبداً { إِذَا جَآءَ أَجَلُهَآ } وحل ما قدر لها؛ لرد الأمانة فيه من الزمان والآن، وكذا لن يقدمها عليه أصلاً، فعليكم التدارك والتلافي قبل حلول الأجل { وَ } بالجملة: { ٱللَّهُ } المراقب عليكم في عموم أحوالكم { خَبِيرٌ بِمَا تَعْمَلُونَ } [المنافقون: 11] في أيام حياتكم من خير وشر، فيجازيكم على مقتضى خبرته بلا فوت شيء من عملكم خيراً كان أو شراً\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها المحمدي المنكشف برجوع العكوس والأظلال إلى ما منه بدت وظهرت، ألاَّ وهي شمس الوحدة الذاتية أن تعرف أن إظهار المعارف المظاهر، وبسط الظل عليها، وامتداده إياها إنما هي بغتة بلا سبق مادة ومدة، وآلة ومقدمة، كذلك القبض والإخفاء إنما يكون كذلك، فلك ، تكون في مدة ظهورك على ذكر من ربك، بحيث لا يشغلك عنه شيء ساعة، ولا تغفل عنه وعن التوجه نحوه لحظة وطرفة، فإنك ما تدري متى يحل الأجل؟ فإذا حل لا يمكنك التدارك والتلافي\n\n\n\n\nجعلنا الله من زمرة المستيقظين في عموم الأحوال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولن يُؤخر اللهُ نفساً } لن يمهلها { إِذا جاء أجَلُهَا } آخر عُمْرِها المكتوب في اللوح\n { واللهُ خبير بما تعملون } فيُجَازيكم عليه، إن خيراً فخير، وإن شرًّا فشر، فسارعوا إلى الخيرات، واستعِدوا لما هو آت\n قال ابن عباس: ما قصَّر أحد في الزكاة والحجِّ إلاَّ سأل الرجعة عند الموت\n هـ\n والظاهر: أنَّ كل مَن قصَّر في الاجتهاد، وتعمير الأوقات، كله يطلب الرجعة، وكل مَن أدركته المنية قبل الوصول إلى الله مغبون، ولذلك ذكر التغابن بعدها، وفي الحديث:\n\n \" ما مِن أحدٍ إلاَّ سيندم عند الموت، إن كان عاصياً أن لو تاب، وإن كان طائعاً أن لو زاد \" \n\nأو كما قال صلى الله عليه وسلم\n قال في غريب المنتقى: إنّ العبد يقول عند كشف الغطاء: يا ملك الموت أَخِّرني يوماً أعتذر فيه إلى ربي، وأتوب وأتزوّد صالحاً لنفسي، فيقول المَلك: فَنيت الأيامُ، فلا يوم، فيقول: أخَّرني ساعة، فيقول: فَنِيَت الساعات فلا ساعة\n هـ\n قيل: لمَّا كانت سورة المنافقين رأس ثلاث وستين سورة، أُشير فيها إلى وفاته صلى الله عليه وسلم بقوله تعالى: { ولن يُؤخر اللهُ نفساً إِذا جاء أجلها } فإنه صلى الله عليه وسلم مات على رأس ثلاث وستين سنة وعقبها بالتغابن، ليظهر التغابن في فقده صلى الله عليه وسلم\n هـ\n الإشارة: قد نهى الله تعالى عن الاشتغال عن ذكره بالأموال والأولاد، ويُقاس عليه سائر القواطع، فلا عذر للعبد في تركه في وقت من الأوقات، فما مِن وقت من الأوقات إلاَّ وله حق جديد، وأمر أكيد، لا يُقضى في غيره، فحقوق الأوقات لا تقضى، بخلاف الحقوق التي لها أوقات محدودة، فإنها تُقضى في غيرها، ولمّا كان الذِكر يُطهِّر القلب، ويُخرج ما فيه من حب الدنيا وغيرها، أمر بالإنفاق بعد الأمر به ليسهل الإنفاقَ على العبد\n\n\nقال بعض الحكماء في مدح الذكر والترغيب فيه: الذكر منشور الولاية، ولا بُد منه في البداية والنهاية، وهو يُثمر أحوالاً شريفة، وماقامات عالية منيفة، وعلوماً لطيفة، ويحيي عوالم طالما كانت قَبْلُ مواتاً، ويُلبِسُ النفسَ وجنودَها ذلة وسُبَاتاً، ونظيره إذا وصل للقلب: كدخول الماء في الأسراب، فإنه يُخرج ما فيها من الحشرات والدواب، فكذلك الذكر، إذا صدم القلب، ودخل سُويداءه، فإنه يُخلصه مِن مساكنة صلصال النفس، ويُزيل عن ناظره الغشاوة واللبس، ولهذا كان أفضل الأعمال، وأزكى الأحوال وفُضّل على جهاد السيف والقتال\n هـ\n وأنفِقوا مما رزقناكم من العلوم والمعارف، لمَن يطلبها وكان أهلاً لها، بعد إنفاق ما عنده من الحس، وإلاَّ فلا خير في فقير شحيح، فإنه مِن أقبح كل قبيح\n فانتهزوا الفرصة، وبادِروا نفوذ الأجل، فالترقي إنما تهو في هذه الدار\n قال القشيري: لا تَغْتَرُّوا بسلامةِ أوقاتِكم، وتَرَقَّبوا بغَتَات آجالكم، وتأهَّبوا لِما بين أيديكم من الرحيل، ولا تعرجوا في أوطان التسويف\n هـ\n وبالله التوفيق، وصلّى الله على سيدنا محمد وآله وصحبه وسلّم\n\n",
      "translations": []
    }
  ]
}