{
  "chapter": "المنافقون",
  "text": "اذا جاءك المنفقون قالوا۟ نشهد انك لرسول الله والله يعلم انك لرسوله والله يشهد ان المنفقين لكذبون",
  "translations": [
    {
      "translation": "When the hypocrites come to you they say, 'We bear witness that you are indeed the Messenger of Allah.' Allah knows that you are indeed His Messenger and Allah bears witness that the hypocrites are certainly liars.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "WHEN THE HYPOCRITES come to you, they say: \"We affirm that you are the Apostle of God.\" God indeed knows you are His Apostle. God bears witness that the hypocrites are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), when the hypocrites come to you, they say: “We bear witness that you are certainly Allah's Messenger.” Allah certainly knows that you are His Messenger. But Allah also bears witness that the hypocrites are utter liars!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you, they say, \"We testify that you are the Messenger of God.\" God knows that you are His Messenger. God testifies that they hypocrites are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come in your presence (O dear Prophet Mohammed – peace and blessings be upon him) they say, “We testify that you surely are Allah’s Noble Messenger”; and Allah knows that you indeed are His Noble Messenger, and Allah testifies that the hypocrites are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you, they say: \"We bear witness that you are indeed the Messenger of Allah.\" Allah knows that you are indeed His Messenger, and Allah bears witness that the hypocrites are liars indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you, they say: We bear witness that you are most surely Allah's Apostle; and Allah knows that you are most surely His Apostle, and Allah bears witness that the hypocrites are surely liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to thee they say, 'We bear witness that thou art indeed the Messenger of God.' And God knows that thou art indeed His Messenger, and God bears witness that the hypocrites are truly liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come unto thee (O Muhammad), they say: We bear witness that thou art indeed Allah's messenger. And Allah knoweth that thou art indeed His messenger, and Allah beareth witness that the hypocrites indeed are speaking falsely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you, they say, \"We bear witness that you are indeed the Messenger of God.\" God knows that you are indeed His Messenger, but God bears witness that the hypocrites are surely liars --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come Unto thee, they say: we bear witness that thou art indeed the apostle of Allah. Allah knoweth that thou art indeed His apostle, and Allah beareth witness that; the hypocrites are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you they say, ‘We bear witness that you are indeed the apostle of Allah.’ Allah knows that you are indeed His Apostle, and Allah bears witness that the hypocrites are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Hypocrites come to thee, they say, \"We bear witness that thou art indeed the Messenger of Allah.\" Yea, Allah knoweth that thou art indeed His Messenger, and Allah beareth witness that the Hypocrites are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you (O Muhammad SAW), they say: \"We bear witness that you are indeed the Messenger of Allah.\" Allah knows that you are indeed His Messenger and Allah bears witness that the hypocrites are liars indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you they say: 'We bear witness that you are the Messenger of Allah' Allah knows that you (Prophet Muhammad) are indeedHis Messenger, and Allah bears witness that the hypocrites are truly liars!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you, they say, “We bear witness that you are God’s Messenger.” God knows that you are His Messenger, and God bears witness that the hypocrites are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you, [O Muhammad], they say, \"We testify that you are the Messenger of Allah.\" And Allah knows that you are His Messenger, and Allah testifies that the hypocrites are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[63:1] When the hypocrites come to you they say, with their tongues, in contradiction of what is in their hearts: ‘We bear witness that you are indeed the Messenger of God.’ And God knows that you are indeed His Messenger, and God bears witness, He knows, that the hypocrites truly are liars, in what they conceal, that which is contrary to what they say.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (When the hypocrites come unto thee): '(When the hypocrites come unto thee (0 Muhammad)) when the hypocrites of Medina, 'Abdullah Ibn Ubayy, Mu'attib Ibn Qushayr and Jadd Ibn Qays-who were cousins- come to you, (they say: We bear witness) we swear by Allah (that thou art) Muhammad (indeed Allah's messenger) we know this and are conscious of it. (And Allah knoweth) and Allah bears witness (that thou art) Muhammad (indeed His messenger) without the need for the testimony of the hypocrites, (and Allah beareth witness) and Allah knows (that the Hypocrites are speaking falsely) that the hypocrites lie in their oath, because they do not know it nor are their hearts conscious of it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِذَا جَآءَكَ } يا أكمل الرسل { ٱلْمُنَافِقُونَ } على سبيل الملاينة والخداع تغريراً لك ولمن تبعك من المؤمنين { قَالُواْ } مبالغين في إظهار الإيمان، مؤكدين: { نَشْهَدُ } أي: نقر ونعترف عن صميم الفؤاد { إِنَّكَ لَرَسُولُ ٱللَّهِ } أرسلك الحق على الحق بالحق { وَ } بعدما أكدوا شهادتهم تأكيداً على تأكيد بالغوا أيضاً في التأكيد؛ لتكميل التقرير والتنوير، حيث قالوا: { ٱللَّهُ } المطلع على السرائر والخفايا { يَعْلَمُ } ويشهد { إِنَّكَ لَرَسُولُهُ } هم وإن بالغوا في شهادتهم الكاذبة على سبيل التزوير والتلبيس { وَٱللَّهُ } المطلع على ما في ضمائرهم من النفاق والشقاق { يَشْهَدُ } حتماً { إِنَّ ٱلْمُنَافِقِينَ } المصرِّين على ما هم عليه من الكفر والإنكار { لَكَاذِبُونَ } [المنافقون: 1] في شهادتهم المزورة، الصادرة منهم على وجه المبالغة والتأكيد\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إذا جاءك } أيها الرسول { المنافقون } أي: حضروا مجلسك، { قالوا نشهدُ إِنك لَرسولُ الله } ، أكدوا بإنَّ واللام للإيذان بأنَّ شهادتهم هذه صادرة عن صميم قلبهم، وخلوص اعتقادهم، ووفور رغبتهم ونشاطهم، قال تعالى: { واللهُ يعلم إِنك لَرسوله } حقيقةً، كما يدل عليه ظاهر كلامهم\n والجملة معترضة بين شهادتهم وتكذيبهم بقوله: { واللهُ يشهدُ إِنَّ المنافقين لكاذبون } ، وحكمته: أنه لو لم يذكره لتوهم أنَّ قوله: { واللهُ يشهد إِنَّ المنافقين لكاذبون } إبطال للرسالة، فوسطه بين حكاية قول المنافقين وبين تكذيبهم ليزيل هذا الوهم، ويُحقق الرسالة\n وقوله: \" لكاذبون \" أي: في ادعائهم أنهم قالوا ذلك عن اعتقاد وصميم قلب، كما يُشير إليه ظاهر قولهم\n قال القشيري: كذَّبهم فيما قالوا: إنّا نشهد عن بصيرة، ونعتقد تصديقك، فلم يكذبهم في الشهادة، ولكن كذَّبهم في قولهم: إنّا مخلصون مصدِّقون بك\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:11",
      "similarity": 0.4955257046922039
    },
    {
      "verse": "100:7",
      "similarity": 0.38997704109951215
    },
    {
      "verse": "2:270",
      "similarity": 0.3883041496317121
    },
    {
      "verse": "85:3",
      "similarity": 0.3749973904319616
    },
    {
      "verse": "4:41",
      "similarity": 0.3631973587908554
    }
  ]
}