{
  "chapter": "المنافقون",
  "text": "اذا جاءك المنفقون قالوا۟ نشهد انك لرسول الله والله يعلم انك لرسوله والله يشهد ان المنفقين لكذبون",
  "translations": [
    {
      "translation": "When the hypocrites come to you they say, 'We bear witness that you are indeed the Messenger of Allah.' Allah knows that you are indeed His Messenger and Allah bears witness that the hypocrites are certainly liars.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "WHEN THE HYPOCRITES come to you, they say: \"We affirm that you are the Apostle of God.\" God indeed knows you are His Apostle. God bears witness that the hypocrites are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), when the hypocrites come to you, they say: “We bear witness that you are certainly Allah's Messenger.” Allah certainly knows that you are His Messenger. But Allah also bears witness that the hypocrites are utter liars!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you, they say, \"We testify that you are the Messenger of God.\" God knows that you are His Messenger. God testifies that they hypocrites are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come in your presence (O dear Prophet Mohammed – peace and blessings be upon him) they say, “We testify that you surely are Allah’s Noble Messenger”; and Allah knows that you indeed are His Noble Messenger, and Allah testifies that the hypocrites are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you, they say: \"We bear witness that you are indeed the Messenger of Allah.\" Allah knows that you are indeed His Messenger, and Allah bears witness that the hypocrites are liars indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you, they say: We bear witness that you are most surely Allah's Apostle; and Allah knows that you are most surely His Apostle, and Allah bears witness that the hypocrites are surely liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to thee they say, 'We bear witness that thou art indeed the Messenger of God.' And God knows that thou art indeed His Messenger, and God bears witness that the hypocrites are truly liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come unto thee (O Muhammad), they say: We bear witness that thou art indeed Allah's messenger. And Allah knoweth that thou art indeed His messenger, and Allah beareth witness that the hypocrites indeed are speaking falsely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you, they say, \"We bear witness that you are indeed the Messenger of God.\" God knows that you are indeed His Messenger, but God bears witness that the hypocrites are surely liars --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come Unto thee, they say: we bear witness that thou art indeed the apostle of Allah. Allah knoweth that thou art indeed His apostle, and Allah beareth witness that; the hypocrites are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you they say, ‘We bear witness that you are indeed the apostle of Allah.’ Allah knows that you are indeed His Apostle, and Allah bears witness that the hypocrites are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Hypocrites come to thee, they say, \"We bear witness that thou art indeed the Messenger of Allah.\" Yea, Allah knoweth that thou art indeed His Messenger, and Allah beareth witness that the Hypocrites are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you (O Muhammad SAW), they say: \"We bear witness that you are indeed the Messenger of Allah.\" Allah knows that you are indeed His Messenger and Allah bears witness that the hypocrites are liars indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you they say: 'We bear witness that you are the Messenger of Allah' Allah knows that you (Prophet Muhammad) are indeedHis Messenger, and Allah bears witness that the hypocrites are truly liars!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you, they say, “We bear witness that you are God’s Messenger.” God knows that you are His Messenger, and God bears witness that the hypocrites are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the hypocrites come to you, [O Muhammad], they say, \"We testify that you are the Messenger of Allah.\" And Allah knows that you are His Messenger, and Allah testifies that the hypocrites are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[63:1] When the hypocrites come to you they say, with their tongues, in contradiction of what is in their hearts: ‘We bear witness that you are indeed the Messenger of God.’ And God knows that you are indeed His Messenger, and God bears witness, He knows, that the hypocrites truly are liars, in what they conceal, that which is contrary to what they say.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِذَا جَاءَكَ الْمُنَافِقُونَ قَالُوا نَشْهَدُ إِنَّكَ لَرَسُولُ اللَّهِ وَاللَّهُ يَعْلَمُ إِنَّكَ لَرَسُولُهُ وَاللَّهُ يَشْهَدُ إِنَّ الْمُنَافِقِينَ لَكَاذِبُونَ (1)لما كان نزول هذه السورة عقب خصومة المهاجري والأنصاري ومقالة عبد الله بن أُبيّ في شأن المهاجرين . تعيّن أن الغرض من هذه الآية التعريض بكذب عبد الله بن أبيّ وبنفاقه فصيغ الكلام بصيغة تعمّ المنافقين لتجنب التصريح بالمقصود على طريقة قول النبي صلى الله عليه وسلم « مَا بال أقوام يشترطون شُروطاً ليست في كتاب الله » ومراده مولى بَريرة لما أراد أن يبيعها لعائشة أمّ المؤمنين واشترط أن يكون الولاء له ، وابتدىء بتكذيب مَنْ أُريد تكذيبه في ادعائه الإِيمان بصدق الرسول صلى الله عليه وسلم وإن لم يكن ذلك هو المقصود إشعاراً بأن الله أطلع رسول الله صلى الله عليه وسلم على دخَائِلهم ، وهو تمهيد لما بعده من قوله : { والله يشهد إن المنافقين لكاذبون } ، لأن رسول الله صلى الله عليه وسلم يَعلم أن المنافقين قَالوا : نشهد إنك لرسول الله .فيجوز أن يكون قولهم : { نشهد إنك لرسول الله } محكياً بالمعنى لأنهم يقولون عبارات كثيرة تفيد معنى أنهم يشهدون بأنه رسول الله مثل نطقهم بكلمة الشهادة .ويجوز أن يكونوا تواطؤوا على هذه الكلمة كلما أعلن أحدهم الإِسلام . وهذا أليق بحكاية كلامهم بكلمة { قالوا } دون نحو : زعموا .و { إذا } ظرف للزمان الماضي بقرينة جعل جملتيها ماضيتين ، والظرف متعلق بفعل { قالوا } وهو جواب { إذا } .فالمعنى : إنك تعلم أنهم يقولون نشهد إنك لرسول الله .و { نشهد } خبر مؤكّد لأن الشهادة الإِخبار عن أمر مقطوع به إذ هي مشتقة من المشاهدة أي المعاينة ، والمعاينة أقوى طرق العلم ، ولذلك كثر استعمال : أشهد ونحوه من أفعال اليقين في معنى القسم . وكثر أن يُجاب بمثل ما يجاب به القسم قاله ابن عطية . ومعنى ذلك : أن قوله : { نشهد } ليس إنشاء . وبعض المفسرين جعله صيغة يمين . وروي عن أبي حنيفة .والمقصود من قوله : { والله يشهد إن المنافقين لكاذبون } إعلام النبي صلى الله عليه وسلم وإعلام المسلمين بطائفة مبهمة شأنهم النفاق ليتوسموهم ويختبروا أحوالهم وقد يتلقى النبي صلى الله عليه وسلم بطريق الوحْي تعيينهم أو تعيين بعضهم .و { المنافقون } جمع منافق وهو الذي يظهر الإِيمان ويُسر الكفر وقد مضى القول فيه مفصلاً في سورة آل عمران .وجملة { إنك لرسول الله } بيان لجملة { نشهد } .وجملة { والله يعلم إنك لرسوله } معترضة بين الجملتين المتعاطفتين وهذا الاعتراض لدفع إيهام من يسمع جملة { والله يشهد إن المنافقين لكاذبون } أنه تكذيب لجملة { إنك لرسول الله } فإن المسلمين كانوا يومئذٍ محفوفين بفئام من المنافقين مبثوثين بينهم هجّيراهم فتنة المسلمين فكان المقام مقتضياً دفع الإِيهام وهذا من الاحتراس .وعُلق فعل { يعلم } عن العمل لوجود ( إنّ ) في أول الجملة وقد عدوا ( إنَّ ) التي في خبرها لاَم ابتداء من المعلقات لأفعال القلب عن العَمل بناء على أن لام الابتداء هي في الحقيقة لام جواب القسم وأن حقها أن تقع قبل ( إنَّ ) ولكنها زُحْلقت في الكلام كراهية اجتماع مؤكَّدين متصلين ، وأُخذ ذلك من كلام سيبويه .وجملة { والله يشهد إن المنافقين لكاذبون } عطف على جملة { قالوا نشهد } .وتقديم المسند إليه على الخبر الفعلي لتقوّي الحكم .وجيء بفعل { يشهد } في الإِخبار عن تكذيب الله تعالى إياهم للمشاكلة حتى يكون إبطال خبرهم مساوياً لإِخبارهم .والكذب : مُخالفة ما يفيدهُ الخبرُ للواقع في الخارج ، أي الوُجود فمعنى كون المنافقين كاذبون هنا أنهم كاذبون في إخبارهم عن أنفسهم بأنهم يشهدون بأن محمداً صلى الله عليه وسلم رسول الله لأن خبرهم ذلك مخالف لما في أنفسهم فهم لا يشهدون به ولا يوافق قولُهم ما في نفوسهم . وبهذا بطل احتجاج النَظَّام بظاهر هذه الآية على رأيه أن الكذب مخالفة الخبر لاعتقاد المخبر لأنه غفل عن قوله تعالى : { قالوا نشهد } . وقد أشار إلى هذا الرد القزويني في «تلخيص المفتاح» وفي «الإِيضاح» .وجملة { إن المنافقين لكاذبون } مبنية لجملة { يشهد } مثل سَابقتاها .\n\n",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (When the hypocrites come unto thee): '(When the hypocrites come unto thee (0 Muhammad)) when the hypocrites of Medina, 'Abdullah Ibn Ubayy, Mu'attib Ibn Qushayr and Jadd Ibn Qays-who were cousins- come to you, (they say: We bear witness) we swear by Allah (that thou art) Muhammad (indeed Allah's messenger) we know this and are conscious of it. (And Allah knoweth) and Allah bears witness (that thou art) Muhammad (indeed His messenger) without the need for the testimony of the hypocrites, (and Allah beareth witness) and Allah knows (that the Hypocrites are speaking falsely) that the hypocrites lie in their oath, because they do not know it nor are their hearts conscious of it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ المنافقون } هم المتذبذبون الذين يجذبهم الاستعداد الأصلي إلى نور الإيمان والاستعداد العارضي الذي حدث برسوخ الهيئات الطبيعية والعادات الرديئة إلى الكفر\n وإنما هم كاذبون في شهادة الرسالة لأن حقيقة معنى الرسالة لا يعلمها إلا الله والراسخون في العلم الذي يعرفون الله ويعرفون بمعرفته رسول الله\n فإن معرفة الرسول لا تمكن إلا بعد معرفة الله وبقدر العلم بالله يعرف الرسول فلا يعلمه حقيقة إلا من انسلخ عن علمه وصار عالماً بعلم الله وهم محجوبون عن الله بحجب ذواتهم وصفاتهم وقد أطفؤوا نور استعداداتهم بالغواشي البدنية والهيئات الظلمانية فأنى يعرفون رسول الله حتى يشهدوا برسالته",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِذَا جَآءَكَ } يا أكمل الرسل { ٱلْمُنَافِقُونَ } على سبيل الملاينة والخداع تغريراً لك ولمن تبعك من المؤمنين { قَالُواْ } مبالغين في إظهار الإيمان\n مؤكدين: { نَشْهَدُ } أي: نقر ونعترف عن صميم الفؤاد { إِنَّكَ لَرَسُولُ ٱللَّهِ } أرسلك الحق على الحق بالحق { وَ } بعدما أكدوا شهادتهم تأكيداً على تأكيد بالغوا أيضاً في التأكيد\n لتكميل التقرير والتنوير\n حيث قالوا: { ٱللَّهُ } المطلع على السرائر والخفايا { يَعْلَمُ } ويشهد { إِنَّكَ لَرَسُولُهُ } هم وإن بالغوا في شهادتهم الكاذبة على سبيل التزوير والتلبيس { وَٱللَّهُ } المطلع على ما في ضمائرهم من النفاق والشقاق { يَشْهَدُ } حتماً { إِنَّ ٱلْمُنَافِقِينَ } المصرِّين على ما هم عليه من الكفر والإنكار { لَكَاذِبُونَ } [المنافقون: 1] في شهادتهم المزورة\n الصادرة منهم على وجه المبالغة والتأكيد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إذا جاءك } أيها الرسول { المنافقون } أي: حضروا مجلسك\n { قالوا نشهدُ إِنك لَرسولُ الله } \n أكدوا بإنَّ واللام للإيذان بأنَّ شهادتهم هذه صادرة عن صميم قلبهم\n وخلوص اعتقادهم\n ووفور رغبتهم ونشاطهم\n قال تعالى: { واللهُ يعلم إِنك لَرسوله } حقيقةً\n كما يدل عليه ظاهر كلامهم\n والجملة معترضة بين شهادتهم وتكذيبهم بقوله: { واللهُ يشهدُ إِنَّ المنافقين لكاذبون } \n وحكمته: أنه لو لم يذكره لتوهم أنَّ قوله: { واللهُ يشهد إِنَّ المنافقين لكاذبون } إبطال للرسالة\n فوسطه بين حكاية قول المنافقين وبين تكذيبهم ليزيل هذا الوهم\n ويُحقق الرسالة\n وقوله: \" لكاذبون \" أي: في ادعائهم أنهم قالوا ذلك عن اعتقاد وصميم قلب\n كما يُشير إليه ظاهر قولهم\n قال القشيري: كذَّبهم فيما قالوا: إنّا نشهد عن بصيرة\n ونعتقد تصديقك\n فلم يكذبهم في الشهادة\n ولكن كذَّبهم في قولهم: إنّا مخلصون مصدِّقون بك\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:11",
      "similarity": 0.4955257046922039
    },
    {
      "verse": "100:7",
      "similarity": 0.38997704109951215
    },
    {
      "verse": "2:270",
      "similarity": 0.3883041496317121
    },
    {
      "verse": "85:3",
      "similarity": 0.3749973904319616
    },
    {
      "verse": "4:41",
      "similarity": 0.3631973587908554
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/063001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/063001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/63:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}