{
  "chapter": "المنافقون",
  "text": "اتخذوا۟ ايمنهم جنة فصدوا۟ عن سبيل الله انهم ساء ما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "They have made their oaths into a cloak and barred the Way of Allah. What they have done is truly evil.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have made their oaths a shield in order to obstruct others from the way of God. It is certainly evil what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shelter behind their oath, and thus hinder their own selves and others from the Path of Allah. Evil indeed is what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have chosen their oaths as a shield for them to obstruct others from the way of God. How terrible is what they do!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have taken their oaths as a shield, thereby prevented others from Allah’s way; indeed they commit extremely evil deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have made their oaths a screen. Thus they hinder (others) from the path of Allah. Verily, evil is what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They make their oaths a shelter, and thus turn away from Allah's way; surely evil is that which they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have taken their oaths as a covering, then they have barred from the way of God. Surely they -- evil are the things they have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They make their faith a pretext so that they may turn (men) from the way of Allah. Verily evil is that which they are wont to do,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they use their oaths as a cover and thus they bar others from God's way: what they have been doing is truly evil --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have taken their oaths for a shield; then they turn away men from the way of Allah. Verily vile is that which they have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They make a shield of their oaths, and bar from the way of Allah. Evil indeed is what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have made their oaths a screen (for their misdeeds): thus they obstruct (men) from the Path of Allah: truly evil are their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have made their oaths a screen (for their hypocrisy). Thus they hinder (men) from the Path of Allah. Verily, evil is what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have taken their oaths as a cover and barred others from the Path of Allah. Evil is what they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They treat their oaths as a cover, and so they repel others from God’s path. Evil is what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have taken their oaths as a cover, so they averted [people] from the way of Allah. Indeed, it was evil that they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[63:2] They have taken their oaths as a shield, as a [means of] protection for their possessions and their lives, and so they have barred, thereby, from the way of God, that is, from using them for the struggle. Evil indeed is that which they are wont to do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاتَّخَذُوا أَيْمَانَهُمْ جُنَّةً فَصَدُّوا عَنْ سَبِيلِ اللَّهِ إِنَّهُمْ سَاءَ مَا كَانُوا يَعْمَلُونَ (2)استئناف بياني لأن تكذيب الله تعالى إياهم في قولهم للنبيء صلى الله عليه وسلم { نشهد إنك لرسول الله } \\[ المنافقون : 1 \\] يثير في أنفس السامعين سؤالاً عن أيْمانهم لدى النبي صلى الله عليه وسلم بأنهم مؤمنون به وأنهم لا يضمرون بغضه فأخبر الله عنهم بأنهم اتخذوا أيمانهم تقية يتقون بها وقد وصفهم الله بالحلف بالأيمان الكاذبة في آيات كثيرة من القرآن .والجُنة : ما يستتر به ويُتَّقَى ومنه سميت الدرع جُنة .والمعنى : جعلوا أيمانهم كالجُنّة يتّقي بها ما يَلْحق من أذى . فلما شبهت الأيمان بالجُنّة على طريقة التشبيه البليغ ، أُتبع ذلك بتشبيه الحَلف باتخاذ الجنة ، أي استعمالها ، ففي { اتخذوا } استعارة تبعية ، وليس هذا خاصاً بحلف عبد الله بن أُبَيّ أنه قال : «لئن رجعنا إلى المدينة ليخرجن الأعز منها الأذل» ، كما تقدم في ذكر سبب نزولها ، بل هو أعمّ ، ولذلك فالوجه حمل ضمائر الجمع في قوله : { اتخذوا أيمانهم } الآية على حقيقتها ، أي اتخذ المنافقون كلُّهم أيمانهم جُنة ، أي كانت تلك تقيتهم ، أي تلك شنشنة معروفة فيهم .{ فصدوا عن سبيل الله } تفريع لصدهم عن سبيل الله على الحلف الكاذب لأن اليمين الفاجرة من كبائر الإِثم لما فيها من الاستخفاف بجانب الله تعالى ولأنهم لما حلفوا على الكذب ظنوا أنهم قد أمنوا اتّهام المسلمين إياهم بالنفاق فاستمروا على الكفر والمكر بالمسلمين وذلك صدّ عن سبيل الله ، أي إعراض عن الأعمال التي أمر الله بسلوكها .وفعل ( صدّوا ) هنا قاصر الذي قياس مضارعه يَصِدُّ بكسر الصاد .وجملة { إنهم ساء ما كانوا يعملون } تذييل لتفظيع حالهم عن السامع . وساء من أفعال الذم تُلحق ببئس على تقدير تحويل صيغة فعْلها عن فَعَل المفتوح العين إلى فَعُل المضمومِها لقصد إفادة الذم مع إفادة التعجب بسبب ذلك التحويل كما نبه عليه صاحب «الكشاف» وأشار إليه صاحب «التسهيل» .\n\n",
      "translations": [
        {
          "translation": "(They make their faith) they make their oath by Allah (a pretext) to escape being killed (that they may turn (men) from the way of Allah) and bar people from Allah's religion and obedience in secret. (Verily evil is that which they are wont to do) evil is that which they do in their state of disbelief and hypocrisy, of plotting, treachery and turning people away,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { ٱتَّخَذُوۤاْ أَيْمَانَهُمْ } المغلظة الحاصلة من شهادتهم المؤكدة بها { جُنَّةً } جعلوها وقاية لأموالهم وأنفسهم { فَصَدُّواْ } وصرفوا غزاة المسلمين\n بسبب ذلك الحلف الكاذب { عَن سَبِيلِ ٱللَّهِ } الذي هو قتالهم وأسرهم ونهبهم\n وبالجملة: { إِنَّهُمْ سَآءَ مَا كَانُواْ يَعْمَلُونَ } [المنافقون: 2] من الصد والنفاق\n والإصرار على الشقاق\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { اتخَذوا أيمانَهم } الفاجرة { جُنَّةً } وقاية عما يتوجه إليهم من المؤاخذة بالقتل والسبي\n وغير ذلك\n واتخاذها جُنَّةً عبارة عن إعدادهم وتهيئهم لها إلى وقت الحاجة\n ليحلفوا بها\n ويتخلّصوا عن المؤاخذة\n { فصَدُّوا } بأنفسهم { عن سبيل الله } وضلُّوا عن طريق الحق\n أو: فصّدُّوا مَن أراد الدخول في الإسلام بإلقاء الشُبه\n وصدُّوا مَن أراد الإنفاق في سبيل الله بالنهي عنه\n كما سيجيء عنهم\n ولا ريب أنّ هذا الصدّ منهم متقدم على حلفهم بالفعل\n ولذلك عبّر بالاتخاذ\n { إِنهم ساء ما كانوا يعملون } من النفاق والصدّ\n وفي \" ساء \" معنى التعجب وتعظيم أمرهم للسامعين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "58:16",
      "similarity": 0.6876970939908229
    },
    {
      "verse": "47:1",
      "similarity": 0.6291647120316552
    },
    {
      "verse": "4:167",
      "similarity": 0.5619178283895006
    },
    {
      "verse": "43:37",
      "similarity": 0.558061038339965
    },
    {
      "verse": "47:34",
      "similarity": 0.5137059304596373
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/063002.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/063002.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/63:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}