{
  "chapter": "المنافقون",
  "text": "ذلك بانهم ءامنوا۟ ثم كفروا۟ فطبع على قلوبهم فهم لا يفقهون",
  "translations": [
    {
      "translation": "That is because they have had iman and then returned to kufr. So their hearts have been sealed up and they cannot understand.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they came to believe, and then renounced (their faith). So their hearts were sealed; and now they do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is because they first believed and then disbelieved, and therefore a seal was set on their hearts; as a result they understand nothing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because they accepted the faith and then rejected it. God has sealed their hearts, thus, they do not have any understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they accepted faith with their tongues then disbelieved with their hearts, therefore their hearts were sealed – so now they do not understand anything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they believed, and then disbelieved; therefore their hearts are sealed, so they understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they believe, then disbelieve, so a seal is set upon their hearts so that they do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they have believed, then they have disbelieved; therefore a seal has been set on their hearts, and they do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they believed, then disbelieved, therefore their hearts are sealed so that they understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that is because they believed and then rejected their faith: their hearts are sealed up, so that they are devoid of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is, because they believed, and thereafter disbelieved, wherefore their hearts are sealed, so that they understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they believed and then disbelieved, so their hearts were sealed. Hence, they do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they believed, then they rejected Faith: So a seal was set on their hearts: therefore they understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they believed, then disbelieved, therefore their hearts are sealed, so they understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they believed, then disbelieved, because of this a seal has been set upon their hearts so they are unable to understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they believed, and then disbelieved; so their hearts were sealed, and they cannot understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because they believed, and then they disbelieved; so their hearts were sealed over, and they do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[63:3] That, namely, their evil deed, is because they believed, by [affirming faith only with] the tongue, then disbelieved, in [their] hearts, that is to say, they persist in harbouring disbelief in it; therefore their hearts have been stamped, sealed, with disbelief. Hence they do not understand, faith.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That) which I have mentioned regarding the hypocrites (is because they believed) outwardly, (then disbelieved) and became firm in their disbelief inwardly, (therefore their hearts are sealed) as a punishment for their disbelief and hypocrisy (so that they understand not) the Truth or guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَلِكَ } أي: اجتراؤهم على تلك الشهادة على وجه المراء والنفاق، وإصرارهم على الكفر والشقاق { بِأَنَّهُمْ } أي: بسبب أنهم { آمَنُواّ } أولاً بالله وبرسوله، وأقروا بألسنتهم ما ليس في قلوبهم على وجه النفاق صوناً لأموالهم وأنفسهم { ثُمَّ كَفَرُوا } بعدما آمنوا عن مكر المؤمنين { فَطُبِعَ } الكفر حينئذٍ { عَلَىٰ قُلُوبِهِمْ } ورسخ فيها واستحكم، وبعد الطبع والتمرن { فَهُمْ لاَ يَفْقَهُونَ } [المنافقون: 3] ولا يفهمون حقية الإيمان ولذته وصحبته، ولا باطلية الكفر وفساده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك } أي: ما تقدّم من قولهم، الناعي عليهم بأنهم أسوأ الناس أعمالاً، أو: ما وصف مِن حالهم في النفاق والكذب والاستتار بالأيمان الفاجرة\n { بأنهم } بسبب أنهم { أمنوا } نطقوا بكلمة الشهادة، كسائر مَن دخل في الإسلام { ثم كفروا } أي: ظهر كفرهم بما شُوهد منهم من شواهد الكفر ودلائله، أو: نطقوا بالإيمان عند المؤمنين، ونطقوا بالكفر عند شياطينهم، { فطُبعَ على قلوبهم } ختم عليها، حتى لا يدخلها الإيمان، جزاء على نفاقهم، فتمرّنوا على الكفر، واطمأنوا به، { فهم لا يفقهون } شيئًا، لا يعرفون حقيَّة الإيمان ولا حقيقته أصلاً\n الإشارة: قد يأتي إلى مشايخ التربية مَن يُنافقهم، طمعًا في الدنيا، فيقول: نشهد إنك لَمن العارفين، أو مِن أهل التربية، مثلاً، فَتَجُر الآيةُ ذيلَها عليه، وقد يكون مذبذباً، تارة تلوح له أنوارُ الولاية، وتارة تَستر عنه، فيُصدّق ثم يرجع، ثم يُطبع على قلبه\n قال القشيري: { ذلك بأنهم آمنوا }: استضاؤوا بنور الإجابة، فلم يَنْبَسِطْ عليهم شعاعُ نور السعادة، فانطفأ نورُهم بقَهْرِ الحرمان، وبَقوا في ظلمة القسمة السابقة بحكم الشقاوة\n هـ\n وهنا إشارة أخرى للقشيري، وهو: إذا جاءك أيها الروح الصافية منافق الهوى والنفس الأمّارة، قالوا: نشهد إنك لَرسول الله، أي: كاملة صافية، يُريدون بذلك توقفها عن الترقي باستحسان ما أدركت، والوقوف معه، والله يعلم إنك لَرسوله، حين تصفى، فتكون محل العِلم الرباني، والوحي الإلهامي، والله يشهد إنهم لكاذبون في ادعاء الشهادة بلا حقيقة، اتخذوا أيمانهم جُنَّة، لئلا تكرّ عليهم بأنوارها، فتُخرجهم عن عوائدهم وشهواتهم، فصُدُّوا عن سبيل الله، حيث بقوا مع عوائدهم، أو: فصدُّوا الروح إن صدقتهم وطاوعتهم، ذلك بأنهم أمنوا، حيث ترد عليهم أنوار الواردات، ثم كفروا رجعوا إلى وطنهم، من الحظوظ، حيث تخمد أنوار الواردات عنهم، فطُبع على قلوبهم، حيث وقفوا مع عوائدهم فهم لا يفقهون: لا يعرفون سر إيجادهم، ولا لماذا خُلقوا\n\n\nهـ\n بالمعنى\n ثم وبَّخ المنافقين بكونهم أشباحاً خاوية، فقال: { وَإِذَا رَأَيْتَهُمْ تُعْجِبُكَ أَجْسَامُهُمْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:87",
      "similarity": 0.8827368181785075
    },
    {
      "verse": "30:59",
      "similarity": 0.7542070205846336
    },
    {
      "verse": "10:74",
      "similarity": 0.6572511714822246
    },
    {
      "verse": "16:108",
      "similarity": 0.6564303106578723
    },
    {
      "verse": "9:93",
      "similarity": 0.6181331872286587
    }
  ]
}