{
  "chapter": "المنافقون",
  "text": "واذا رايتهم تعجبك اجسامهم وان يقولوا۟ تسمع لقولهم كانهم خشب مسندة يحسبون كل صيحة عليهم هم العدو فاحذرهم قتلهم الله انى يؤفكون",
  "translations": [
    {
      "translation": "When you see them, their outward form appeals to you, and if they speak you listen to what they say. But they are like propped-up planks of wood. They imagine every cry to be against them. They are the enemy, so beware of them. Allah fight them! How they are perverted!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Pleasing seem their persons when you look at them; and when they talk, you listen to their speech. Yet they are like the wooden panelling of a wall. They imagine every rebuke to be directed against them. They are the enemies, beware of them. May God damn them, how pervert are they!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you look at them, their persons are pleasing, and when they speak, you pay heed to what they say. But in truth they are (merely) beams of timber propped-up (against a wall). They consider every shout they hear to be directed against them. They are your utter enemies; guard against them. May Allah do away with them! How are they being turned away (from the Truth)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their physical appearance attracts you when you see them and when they speak, you carefully listen to them. In fact, they are like propped up hollow trunks of wood (They are so cowardly) they think that every cry which they hear is against them. They are the enemy, so beware of them. May God condemn them. Where are they turning to, leaving behind the Truth?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you see them, their appearance would please you; and when they speak, you would listen carefully to their speech; like wooden blocks propped against the wall; they assume every cry to be against them; they are the enemy, so beware of them; may Allah slay them! Where are they reverting!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you look at them, their bodies please you; and when they speak, you listen to their words. They are as blocks of wood propped up. They think that every cry is against them. They are the enemies, so beware of them. May Allah curse them! How are they denying the right path\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you see them, their persons will please you, and If they speak, you will listen to their speech; (they are) as if they were big pieces of wood clad with garments; they think every cry to be against them. They are the enemy, therefore beware of them; may Allah destroy them, whence are they turned back?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When thou seest them, their bodies please thee; but when they speak, thou listenest to their speech, and it is as they were propped-up timbers. They think every cry is against them. They are the enemy; so beware of them. God assail them! How they are perverted!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thou seest them their figures please thee; and if they speak thou givest ear unto their speech. (They are) as though they were blocks of wood in striped cloaks. They deem every shout to be against them. They are the enemy, so beware of them. Allah confound them! How they are perverted!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you see them, their outward appearance pleases you; when they speak, you listen to what they say. But they are like propped up blocks of timber. They think that every shout is directed against them. They are the [real] enemies, so beware of them. The curse of God be upon them! How they turn away!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thou beholdest them, their persons please thee: and if they speak, thou listenest to their discourse; they are as though they were blocks of wood propped up. They deem every shout to be against them. They are the enemy; so beware of them. Perish them Allah! whither are they deviating!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you see them, their bodies impress you, and if they speak, you listen to their speech. Yet they are like dry logs set reclining [against a wall]. They suppose every cry is directed against them. They are the enemy, so beware of them. May Allah assail them, where do they stray?!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When thou lookest at them, their exteriors please thee; and when they speak, thou listenest to their words. They are as (worthless as hollow) pieces of timber propped up, (unable to stand on their own). They think that every cry is against them. They are the enemies; so beware of them. The curse of Allah be on them! How are they deluded (away from the Truth)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you look at them, their bodies please you; and when they speak, you listen to their words. They are as blocks of wood propped up. They think that every cry is against them. They are the enemies, so beware of them. May Allah curse them! How are they denying (or deviating from) the Right Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you see them their bodies please you, but when they speak and you listen to their sayings, they are like proppedup timber. Every shout (they hear) they take it to be against them. They are the enemy be wary of them. Allah kills them! How perverse they are!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you see them, their appearance impresses you. And when they speak, you listen to what they say. They are like propped-up timber. They think every shout is aimed at them. They are the enemy, so beware of them. God condemns them; how deluded they are!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you see them, their forms please you, and if they speak, you listen to their speech. [They are] as if they were pieces of wood propped up - they think that every shout is against them. They are the enemy, so beware of them. May Allah destroy them; how are they deluded?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[63:4] And when you see them, their figures please you, on account of their fairness; and if they speak, you listen to their speech, because of its eloquence. [Yet] they are, by virtue of the enormous size of their figures, [yet] in their lack of comprehension, like blocks of timber (read khushbun or khushubun) [that have been] propped-up, set reclining against a wall. They assume that every cry, made, like a battle-cry or one made to [retrieve] a lost camel, is [directed] against them, because of the [extent of] terror in their hearts, lest something should be revealed deeming their blood licit. They are the enemy, so beware of them, for they communicate your secrets to the disbelievers. May God assail them!, destroy them! How can they deviate?, how can they be turned away from faith after the proofs [for it] have been established?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when thou) Muhammad (seest them) i.e. 'Abdullah Ibn Ubayy and his two friends (their figures please thee) their bodies and appearance please you; (and if they speak) saying: we know you are Allah's Messenger (thou givest ear unto their speech) you believe what they say and think they are truthful while they are not. ((They are)) i.e. their bodies are (as though they were blocks of wood in striped cloaks) aligned against the wall; He says: there is no goodness or light in their hearts just as dry wood has no life or moistness in it. (They deem every shout) every noise in Medina (to be against them) because of their cowardice. (They are the enemy, so beware of them) and never feel safe from them. (Allah confound them) Allah cursed them! (How they are perverted!) How they lie; it is also said this means: how they turn people away through lies!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السّائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { كَأَنَّهُمْ خُشُبٌ } معناه جَماعةُ الخَشَبِ\n\n\n\n\nوقوله تعالى: { قَاتَلَهُمُ ٱللَّهُ } معناه لَعَنهُم الله { أَنَّى يُؤْفَكُونَ } معناه يُدفَعُون ويُصرَفُون\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us that Ali ibn Ahmad related to him.\n\n\nHe said: \"Ata ibn al-Saaib narrated to us from Abu Khalid from Zayd ibn Ali, upon them both be peace, regarding the saying of God Almighty, {as if they were wood} [i.e. as if they were lifeless]. This means the group of wood [i.e. the group of people].\"\n\n\nAnd the saying of Allah {Qatalahumullah} means that Allah cursed them {Anaa Yu'fakoona} meaning they are diverted and turned away.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وإذا رأيتهم تعجبك أجسامهم } لأن التناسب في أشكالهم وحسن مناظرهم وروائهم وكمال صباحتهم ووسامتهم دلّ على استعدادهم من جهة الفراسة ونمّ بنور فطرهم\n ولهذا سمع رسول الله صلى الله عليه وسلم لقولهم: واستمع إلى كلامهم: فإن الصباحة وحسن المنظر لا يكون إلا من صفاء الفطرة في الأصل\n ولما رأى غلبة الرين على قلوبهم وانطفاء نور استعدادهم وإبطال الهيئات البدنية العارضية خواصهم الأصلية آيس منهم وتعجب من حالهم بقوله: { أنى يؤفكون } أي: يصرفون عن النور إلى الظلمة وعن الحق إلى الباطل\n وروي عن بعض الحكماء أنه رأى غلاماً حسناً وجهه\n فاستنطقه لظنه ذكاءه وفطنته فما وجد عنده معنى فقال: ما أحسن هذا البيت لو كان فيه ساكن\n وهذا معنى قوله: { كأنهم خشب مسندة } أي: أجرام خالية عن الأرواح لا نفع فيها ولا ثمر كالأخشاب المسندة إلى الجدران عند الجفاف وزوال الروح النامية عنها\n فهم في زوال استعداد الحياة الحقيقية والروح الإنساني بمثابتها { يحسبون كل صيحة عليهم هم العدوّ } لأن الشجاعة إنام تكون من اليقين\n واليقين من نور الفطرة وصفاء القلب\n وهم منغمسون في ظلمات صفات النفوس محتجبون باللذات والشهوات أهل الشك والارتياب\n فلذلك غلبهم الجبن والخور فاحذرهم فقد بطل استعدادهم فلا يهتدون بنورك ولا تؤثر فيهم صحبتك { لووا رؤوسهم } لضراوتهم بالأمور الظلمانية واعتيادهم بالكمالات البهيمية والسبعية فلا يألفون النور ولا يشتاقون إليه ولا إلى الكمالات الإنسانية لمسخ الصورة الذاتية { ورأيتهم يصدّون } يعرضون لانجذابهم إلى الجهة السفلية والزخارف الدنيوية فلا ميل في طباعهم إلى الجهة العلوية والمعاني الأخروية { وهم مستكبرون } لغلبة الشيطنة واستيلاء القوة الوهمية واحتجابهم بالأنائية وقصور الخيرية { لن يغفر الله لهم } لرسوخ الهيئات الظلمانية فيهم وزوال قبول استعداداتهم للهداية لفسقهم وخروجهم عن دين الفطرة القيم\n { يقولون لا تنفقوا على من عند رسول الله حتى ينفضوا } لاحتجابهم بأفعالهم عن رؤية فعل الله وبما في أيديهم عما في خزائن الله فيتوهمون الإنفاق منهم لجهلهم وكذا توهموا العزّة والقدرة ولأنفسهم لاحتجابهم بصفاتهم عن صفات الله فقالوا: { ليخرجنّ الأعز منها الأذل } ولم يشعروا أن العزة والقوة والقدرة كلها أنوار ذات الله تعالى وصفاته اللازمة لذاته فبقدر القرب منه والفناء فيه والمحو في صفاته تظهر على المظاهر الإنسية ولا أقرب إليه من رسول الله صلى الله عليه وسلم ثم المؤمنين المحققين الموقينين فلا أعز منه عليه السلام من جميع الخلق ثم الذين يلونه من المؤمنين { ولكنّ المنافقين لا يعلمون } لمكان احتجابهم وشدّة ارتيابهم\n ولقد قيض من نفس من تكلم بهذا الكلام من أخرجه وحبسه ولم يدعه يدخل المدينة حتى أقر بأن العزة لله ولرسوله وللمؤمنين\n روي أن القائل لذلك هو عبد الله بن ابيّ\n فلما رجعوا إلى المدينة سلّ ابنه السيف ومنع أباه من الدخول\n فلم يزل حبيساً في يده حتى أذن له رسول الله صلى الله عليه وسلم وشهد هو بعزّة الله ورسوله والمؤمنين",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ونهاية عرائهم وخلوهم عن نور الإيمان { إِذَا رَأَيْتَهُمْ } يا أكمل الرسل { تُعْجِبُكَ أَجْسَامُهُمْ } أي: سمتها وضخامتها { وَإِن يَقُولُواْ } أيضاً كلاماً { تَسْمَعْ لِقَوْلِهِمْ } لفصاحتهم وحلاوة نظمهم\n إلاَّ أنهم لخلوهم عن العلم اللدني\n والرشد المعنوي\n والصفاء الفطري الذاتي الذي هو نفوذ أرباب المحبة والولاء { كَأَنَّهُمْ خُشُبٌ } يابسة فانية\n فاقدة للقابلية الفطرية { مُّسَنَّدَةٌ } على جدار الجهل والبلادة\n ومع ذلك { يَحْسَبُونَ } يظنون ويترقبون من شدة شكيمتهم وغيظهم مع المؤمنين { كُلَّ صَيْحَةٍ } واقعة { عَلَيْهِمْ } مسموعة لهم { هُمُ ٱلْعَدُوُّ } يصيح عليهم\n ليهلكهم\n\n\nوبعدما صار بغضهم مع المؤمنين\n ومخافتهم من العدو بهذه الحثيثة { فَٱحْذَرْهُمْ } يا أكمل الرسل\n واترك مصاحبتهم\n واحترز من غيلتهم وطغيانهم\n إذ الخائف ربما يصول بلا سبب وداع عليهم\n وقل في شأنهم: { قَاتَلَهُمُ ٱللَّهُ } المنتقم الغيور { أَنَّى يُؤْفَكُونَ } [المنافقون: 4] وكيف يصرفون وينحرفون عن الحق الصريح إلى الباطل الغير الصحيح\n مع أنه لا ضرورة تلجئهم إليه؟!",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { وإِذا رأيتهم تُعْجِبُكَ أجسامُهم } لضخامتها، ويروقك منظرُهم لصباحة وجوههم، والخطاب للرسول صلى الله عليه وسلم، أو: لكل سامع، { وإِن يقولوا تسمعْ لِقَولهم } لفصاحتهم، وذلاقة ألسنتهم، وحلاوة كلامهم، وكان ابن أُبي رجلاً جسيماً صبيحاً، وقوم من المنافقين في مثل صفته، فكانوا يحضرون مجلس الرسول صلى الله عليه وسلم، ويستندون فيه، ولهم جهارة المناظرة، وفصاحة الألسن، فكان النبي صلى الله عليه وسلم ومَن معه يُعجبون بهم، ويسمعون إلى كلامهم. { كأنهم خُشُب مُسَنَّدةٌ } أي: هم كخشب مُسَنَّدة، شُبِّهوا في جلوسهم في مجلس الرسول صلى الله عليهم وسلم مستندين فيها بخُشب منظومة، مسندة إلى الحائط، في كونهم أشباحاً خاليه من العلم والخير لأنّ الخشب إذا انتُفع بها كانت في سَقفٍ، أو جدارٍ، أو غير ذلك من مظان الانتفاع، وما دام متروكاً غير منتفع به، أُسند إلى الحائط فشُبِّهوا به في عدم الانتفاع. أو: لأنهم أشباح بلا أرواح، وأجرام بلا أحلام. و \" خُشُب \" بضمتين، جمع خَشبة، كَثمرة وثُمُر، ويسكن، كبَدنة وبُدن. { يحسبون كلَّ صيحةٍ } واقعة { عليهم } ، فـ \" كل \": مفعول أول، و \" عليهم \": مفعول ثان، أي: يظنون كلَّ صيحة واقعة عليهم لاستقرار الرعب في قلوبهم، فإذا نادى منادٍ في العسكر، أو انفلتت دابة، أو نُشِدت ضالّة ظنوه إيقاعاً بهم. { هم العدوُّ } أي: الكاملون في العداوة، الراسخون فيها، فإنّ أعدى الأعادي المكاشِر، الذي يُكاشر وتحت ضلوعه الداء. فالألف واللام للجنس، أو: للعهد، أي: العدو الذي يشهد لك، ويعتقد خلاف ما يشهد، { فاحْذرهم } ولا تغتر بحلاوة منطقهم، { قاتلهم اللهُ } ، دعاء عليهم، أو: تعليم للمؤمنين أن يدعوا عليهم، { أنى يُؤفكون } أي: كيف يعدلون عن الحق بعد وضوحه، تعجُّباً من جهلهم وضلالتهم. الإشارة: لا عبرة بالأجسام العريضة، ولا بالألسن الفصيحة، إنما العبرة بالقلوب المطهرة، والسرائر المنورة،\n \" إن الله لا ينظر إلى صوركم... \" \nالحديث، و\n \" رُبَّ أشعثَ أغبر، مدفوعٍ بالأبواب، لو أقسمَ على الله لأبَرَّه في قسمه \" \nقال القشيري: قوله تعالى: { وإذا رأيتهم.. } الخ، أي: هم أشباح وقوالب، ليس وراءهم ألبابُ وحقائق، والجوزُ الفارغ يؤنق ظاهره، ولكن للعب الصبيان. هـ. وقال الشاعر:\nوقالت العامة: لا يتكلم إلاَّ الجوز الفارغ، ذمًّا لشقشقة اللسان، وفي الحديث أيضاً ذمهم والتحذير منهم. أما قوله صلى الله عليه وسلم:\n \" التمسوا حوائجكم عن حِسَان الوُجُوه \" \nفإنما المراد: ما يظهر على الوجه من البهجة والنور، والخفة والملاحة، مما خامر الباطن من بشاشة الإيمان ونور المعرفة. والله تعالى أعلم. ثم قال تعالى في ذم المنافقين وافتضاحهم: { وَإِذَا قِيلَ لَهُمْ تَعَالَوْاْ يَسْتَغْفِرْ لَكُمْ رَسُولُ ٱللَّهِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:247",
      "similarity": 0.2644507176078644
    },
    {
      "verse": "50:42",
      "similarity": 0.057278559119229765
    },
    {
      "verse": "36:53",
      "similarity": 0.053252365803798364
    },
    {
      "verse": "15:83",
      "similarity": 0.053019295333661245
    },
    {
      "verse": "38:15",
      "similarity": 0.05245791958986654
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/63:4.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/63:4.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/63:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}