{
  "chapter": "المنافقون",
  "text": "واذا قيل لهم تعالوا۟ يستغفر لكم رسول الله لووا۟ رءوسهم ورايتهم يصدون وهم مستكبرون",
  "translations": [
    {
      "translation": "When they are told, 'Come, and the Messenger of Allah will ask forgiveness for you,' they turn their heads and you see them turn away in haughty arrogance.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you tell them: \"Come, let the Apostle of God ask forgiveness for you,\" they turn their heads, and you see them turning away with arrogance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: “Come, Allah's Messenger will seek forgiveness for you,” they (contemptuously) shake their heads and you see them holding back in pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, \"Come and let the Prophet of God seek forgiveness for you,\" they shake their heads and you can see them arrogantly turning away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Come! Allah’s Noble Messenger may seek forgiveness for you” – they turn heads away, and you will see them turning away in pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"Come, so that the Messenger of Allah may ask forgiveness from Allah for you,\" they twist their heads, and you would see them turning away their faces in pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: Come, the Apostle of Allah will ask forgiveness for you, they turn back their heads and you may see them turning away while they are big with pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, 'Come now, and God's Messenger will ask forgiveness for you,' they twist their heads, and thou seest them turning their faces away, waxing proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said unto them: Come! The messenger of Allah will ask forgiveness for you! they avert their faces and thou seest them turning away, disdainful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, \"Come! The Messenger of God will ask forgiveness for you!\" they turn their heads away and you see them walking away arrogantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said Unto them: come! that the apostle of Allah may ask forgiveness for you, they twist their heads, and thou beholdest them retire, while they are stiff-necked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are told, ‘Come, that Allah’s Apostle may plead for forgiveness for you,’ they twist their heads, and you see them turn away disdainfully.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, \"Come, the Messenger of Allah will pray for your forgiveness\", they turn aside their heads, and thou wouldst see them turning away their faces in arrogance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them: \"Come, so that the Messenger of Allah may ask forgiveness from Allah for you\", they turn aside their heads, and you would see them turning away their faces in pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it is said to them: 'Come, the Messenger of Allah will ask forgiveness for you' they turn their heads in pride and you see them go away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, “Come, the Messenger of God will ask forgiveness for you,” they bend their heads, and you see them turning away arrogantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when it is said to them, \"Come, the Messenger of Allah will ask forgiveness for you,\" they turn their heads aside and you see them evading while they are arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[63:5] And when it is said to them, ‘Come, offer apologies, and God’s Messenger will ask forgiveness for you’, they twist (read lawwaw or lawū), they turn, their heads, and you see them turning away, rejecting this [offer], disdainful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when it is said unto them) when their clans said to them after their exposure: (Come) to Allah's Messenger and repent of disbelief and hypocrisy! (The Messenger of Allah will ask forgiveness for you! they avert their faces) and cover their heads (and thou seest them) Muhammad (turning away) from asking forgiveness, repenting and coming to you, (disdainful) too proud to repent and to ask for forgiveness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَوَّوْاْ رُءُوسَهُمْ } يعهني حَرّكُوها وأَمالُوها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من شدة بغضهم وضغينتهم مع المؤمنين المخلصين { إِذَا قِيلَ لَهُمْ } إمحاضاً للنصح: { تَعَالَوْاْ } هلمَّوا أيها المسرفون المفرطون مجلس رسول الله صلى الله عليه وسلم { يَسْتَغْفِرْ لَكُمْ رَسُولُ ٱللَّهِ } صلى الله عليه وسلم، ويطلب مغفرتكم من العفو الغفور { لَوَّوْاْ رُءُوسَهُمْ } وعطفوا أعناقهم عن القبول معتذرين بأعذار كاذبة مخافةً وصوناً { وَرَأَيْتَهُمْ } حينئذٍ في وجوههم التي هي عنوان بواطنهم آثار الكفر والعناد؛ إذ هم { يَصُدُّونَ } ويعرضون معتذرين عن المؤمنين { وَهُم } في أنفسهم { مُّسْتَكْبِرُونَ } [المنافقين: 5] عن القبول والاعتذار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وإِذا قيل لهم } عند ظهور نفاقهم: { تعالَوا يستغفر لكم رسولُ الله لَووا رؤوسَهم } أي: عطفوا استكباراً\n وقرأ غير نافع بالتشديد للمبالغة\n { ورأيتهم يصُدُّون } أي: يُعرضون عن القائل، أوعن الاستغفار، { وهم مستكبرون } عن الاعتذار والاستغفار\n\n\n \" رُوي أنَّ رسولَ الله صلى الله عليه وسلم حين لقي بني المصطلق على المُرَيْسيع ـ وهوماءٌ لهم ـ وهزمهم، وقتلهم، ازدحم على الماء \" جهجاه \" أجير لعُمر ـ مع سِنانٍ ـ حليف لعبد الله بن أُبيّ المنافق ـ فصرخ جهجاه: يا للمهاجرين! وصرخ سنان: يا للأنصار! فأعان جَهْجَاهاً جُعال من فقراء المهاجرين، ولطم سناناً، فقال ابنُ أُبيّ: أُوَقد فعلوها، وقال: وما صحبنا محمداً إلا لنُلطَم! وما مثلنا ومثلهم إلاَّ كما قائل القائل: سمِّن كلبك يَأكُلْكَ! والله لئن رجعنا إلى المدينة ليُخرجن الأعزُّ منها الأذلَّ\n ثم قال لقومه: كُفوا طعامكم عن هذا الرجل، ولا تُنفقوا على مَن عنده حتى ينفضُّوا ويتركوه، فسمع ذلك زيدُ بن أرقم، وكان حدثاً، فقال: أنت ـ والله ـ الذليلُ، المبَغَّضُ في قومك، ومحمد على رأسه تاج المعراج، في عزّ من الرحمن، وقوةٍ من المسلمين، فقال عبدالله: اسكت، فإنما كنتُ ألعب، فأخبر زيدٌ رسولَ الله صلى الله عليه وسلم، فقال عمر رضي الله عنه: دعني أضرب عنقَ المنافق! فقال رسولُ الله صلى الله عليه وسلم: \" إذن تُرْعَدُ أنوفٌ كثيرة بيثرب \" قال: فإن كرهت أن يقتله مُهاجريّ، فمُر به أنصاريًّا، فقال: \" فكيف إذا تحدّث الناسُ أنّ محمداً يقتل أصحابه؟ \" فأرسل صلى الله عليه وسلم له، فأتى، فقال: \" أنت صاحب الكلام الذي بلغني \"؟ فقال: والذي أنزل عليك الكتاب ما قلتُ شيئاً من ذلك، وإنّ زيداً لكاذب، وهو قوله: { اتخَذوا أَيمانهم جُنَّة } فقال الحاضرون: يا رسول الله! شيخُنا وكبيرُنا، لا تُصدق عليه كلام غلام، عسى أن يكون قد وَهم، قال زيد: فوجدتُ في نفسي، ولآمَنِي الناسُ، فلزمتُ بيتي، فلما نزلت الآية، قال رسولُ الله صلى الله عليه وسلم لزيد: \" يا غلام إنَّ الله قد صَدَّقك وكذّب المنافقين \" \n\n، فلما بان كذب عبدالله قيل له: قد نزلت فيك آيٌ شِدادٌ، فاذهب إلى رسول الله صلى الله عليه وسلم يستغفر لك، فلوى رأسه، وقال: أمرتموني أن أومن فآمنتُ، وأمرتموني أن أزكي مَالي، فزكّيتُ، ما بقي لي إلاّ أن أسجد لمحمد، فنزل: { وإذا قيل لهم تعالوا\n\n\n } الآية، وما بقي إلاّ أياماً حتى اشتكى ومات\n قاله النسفي، فانظره، مع أنّ سورة براءة متأخرة عن هذه، وفيها:\n\n[التوبة:84] التي نزلت فيه",
      "translations": []
    }
  ]
}