{
  "chapter": "المنافقون",
  "text": "هم الذين يقولون لا تنفقوا۟ على من عند رسول الله حتى ينفضوا۟ ولله خزائن السموت والارض ولكن المنفقين لا يفقهون",
  "translations": [
    {
      "translation": "They are the people who say, 'Do not spend on those who are with the Messenger of Allah, so that they this.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who say: \"Do not spend on those who are with the Apostle of God till they break away (from him).\" To God belong the treasures of the heavens and the earth; but the hypocrites do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who say: “Give nothing to those who are with the Messenger of Allah so that they may disperse.” (They say so although) the treasures of the heavens and the earth belong to Allah. But the hypocrites do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who say, \"Give nothing to those who are around the Messenger of God so that they will desert him.\" To God belongs the treasures of the heavens and the earth, but the hypocrites have no understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who say, “Do not spend upon those who are with Allah’s Noble Messenger until they get distraught”; whereas to Allah only belong the treasures of the heavens and the earth, but the hypocrites do not have sense.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who say: \"Spend not on those who are with Allah's Messenger, until they desert him.\" And to Allah belong the treasures of the heavens and the earth, but the hypocrites comprehend not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They it is who say: Do not spend upon those who are with the Apostle of Allah until they break up. And Allah's are the treasures of the heavens and the earth, but the hypocrites do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they that say, 'Do not expend on them that are with God's Messenger until they scatter off'; yet unto God belong the treasuries of the heavens and of the earth, but the hypocrites do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They it is who say: Spend not on behalf of those (who dwell) with Allah's messenger that they may disperse (and go away from you); when Allah's are the treasures of the heavens and the earth; but the hypocrites comprehend not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who say, \"Give nothing to those who follow God's Messenger, until they abandon him;\" but the treasures of the heavens and the earth belong to God, though the hypocrites do not understand this\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who say: expend not on those who are with Allah's apostle, that they may disperse; whereas Allah's are the treasures of the heavens and the earth; yet the hypocrites understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who say, ‘Do not spend on those who are with the Apostle of Allah until they scatter off [from around him].’ Yet to Allah belong the treasuries of the heavens and the earth, but the hypocrites do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who say, \"Spend nothing on those who are with Allah's Messenger, to the end that they may disperse (and quit Medina).\" But to Allah belong the treasures of the heavens and the earth; but the Hypocrites understand not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who say: \"Spend not on those who are with Allah's Messenger, until they desert him.\" And to Allah belong the treasures of the heavens and the earth, but the hypocrites comprehend not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they that say: 'Spend nothing on those who follow the Messenger of Allah until they disperse' Yet to Allah belong the treasuries of heavens and the earth, but the hypocrites do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is they who say: “Do not spend anything on those who side with God’s Messenger, unless they have dispersed.” To God belong the treasures of the heavens and the earth, but the hypocrites do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones who say, \"Do not spend on those who are with the Messenger of Allah until they disband.\" And to Allah belongs the depositories of the heavens and the earth, but the hypocrites do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[63:7] They are the ones who say, to their companions from among the Helpers: ‘Do not expend on those who are with the Messenger of God, from among the Emigrants, until they scatter off’, until they part with him. Yet to God belong the treasuries of the heavens and the earth, with [what they contain of] provision, and so He is the provider for the Emigrants and others, but the hypocrites do not understand.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "669 (They it is who say) the one who said this is 'Abdullah Ibn Ubayy, especially to his host at the Battle of Tabuk: (Spend not on behalf of those (who dwell) with Allah's messenger) who are poor and needy (that they may disperse (and go away from you)) to join their clans; (when Allah's are the treasures of the heavens and the earth) when Allah has the keys to the stores of the heavens through providing rain and vegetation; (but the hypocrites) 'Abdullah Ibn Ubayy and his host (comprehend not) that Allah provides for them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { حَتَّىٰ يَنفَضُّواْ } أي حتّى يَتفرّقُوا\n\n",
      "translations": [
        {
          "translation": " And His saying, { until they disperse } that is, until they separate.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف يهديهم ويغفر له سبحانه، مع أنهم { هُمُ } المسرفون المفسدون { ٱلَّذِينَ يَقُولُونَ } للأنصار؛ من نهاية عداوتهم وبغضهم مع الرسول والمؤمنين: { لاَ تُنفِقُواْ عَلَىٰ مَنْ عِندَ رَسُولِ ٱللَّهِ } يعنون: فقراء المهاجرين { حَتَّىٰ يَنفَضُّواْ } وينتشروا بعدما اضطروا من حوله { وَ } لم يعلموا هؤلاء الغفلة الضالون، والجهلة الهالكون في تيه الجهل والعناد أن { لِلَّهِ } وفي قبضة قدرته، وتحت ضبطه وملكيته { خَزَآئِنُ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: الكنوز المكنونة المطلوبة في ضمن العلويات، والمدفونة في السفليات { وَلَـٰكِنَّ ٱلْمُنَافِقِينَ } المصرِّين على الكفر والعناد { لاَ يَفْقَهُونَ } [المنافقون: 7] كما قدرة الله، وسعة خزائن كرمه وجوده؟!\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { هم الذين يقولون } للأنصار: { لا تُنفقوا على مَن عند رسول الله حتى ينفضوا } يتفرقوا، وهذه المقالة كانت السبب في استدعائه إلى الاستغفار، كما تقدّم، فحقها التقديم قبل قوله: { وإِذا قيل لهم تعالوا } وإنما أُخرت ليتوجه العتاب إليه مرتين، كما تقدّم في سورة البقرة\n ثم قال تعالى، في الرد على الخبيث: { ولله خزائنُ السموات والأرض } ، فهو رد وإبطال لما زعموا من أنَّ عدم إنفاقهم يؤدي إلى انفضاض الفقراء من حوله صلى الله عليه وسلم ببيان أنَّ خزائن الأرزاق بيد الله تعالى خاصة، يُعطي مَن يشاء، ويمنع مَن يشاء، فيرزق منها المهاجرين، وإن أمسك أهلُ المدينة عنهم، { ولكنَّ المنافقين لا يفقهون } ولكن عبد الله وأضرابه لايفقهون ذلك فيهتدون، بما يُزيِّن لهم الشيطان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "76:16",
      "similarity": 0.5195684145110995
    },
    {
      "verse": "15:21",
      "similarity": 0.4311083433510886
    },
    {
      "verse": "12:55",
      "similarity": 0.41296935784400174
    },
    {
      "verse": "38:9",
      "similarity": 0.3823284737948763
    },
    {
      "verse": "52:37",
      "similarity": 0.37768474432125837
    }
  ]
}