{
  "chapter": "المنافقون",
  "text": "يقولون لئن رجعنا الى المدينة ليخرجن الاعز منها الاذل ولله العزة ولرسوله وللمؤمنين ولكن المنفقين لا يعلمون",
  "translations": [
    {
      "translation": "They say, 'If we return to Madina, the mightier will drive out the inferior.' But all might belongs to Allah and to His Messenger and the muminun. But the hypocrites do not know this.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"If we now go back to Madina, the stronger will turn the weaker out.\" But power belongs to God, His Apostle and the faithful, though the hypocrites do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: “When we return to Madinah, the honourable ones will drive out from it those that are abject.” In truth, all honour belongs to Allah, and to His Messenger, and to the believers. But the hypocrites do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"When we return to Medina, the honorable ones will certainly drive out the mean ones.\" Honor belongs to God, His Messenger and the believers, but the hypocrites do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, “If we return to Medinah, then indeed the honourable group will soon expel the lowly one”; whereas all honour belongs to Allah and to His Noble Messenger and to the Muslims, but the hypocrites do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"If we return to Al-Madinah, indeed the more honorable will expel therefrom the weaker.\" But Al-`Izzah belongs to Allah, and to His Messenger, and to the believers, but the hypocrites know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: If we return to Medina, the mighty will surely drive out the meaner therefrom; and to Allah belongs the might and to His Apostle and to the believers, but the hypocrites do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, 'If we return to the City, the mightier ones of it will expel the more abased'; yet glory belongs unto God, and unto His Messenger and the believers, but the hypocrites do not know it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: Surely, if we return to Al-Madinah the mightier will soon drive out the weaker; when might belongeth to Allah and to His messenger and to the believers; but the hypocrites know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[and] they say, \"Indeed, when we return to Madinah, [we] the ones most worthy of honour, will surely drive out from there the contemptible ones!\" [referring to poor Muslims]. However, all honour belongs to God, and to His Messenger and those who believe [in God]: but of this the hypocrites are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: surely, if we return to Madina the mightier shall drive out the meaner thence: whereas might is Allah's and His apostle's and the believers; yet the hypocrites know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, ‘When we return to the city, the mighty will surely expel the weak from it.’ Yet all might belongs to Allah and His Apostle and the faithful, but the hypocrites do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"If we return to Medina, surely the more honourable (element) will expel therefrom the meaner.\" But honour belongs to Allah and His Messenger, and to the Believers; but the Hypocrites know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (hyprocrites) say: \"If we return to Al-Madinah, indeed the more honourable ('Abdullah bin Ubai bin Salul, the chief of hyprocrites at Al-Madinah) will expel therefrom the meaner (i.e. Allah's Messenger SAW).\" But honour, power and glory belong to Allah, His Messenger (Muhammad SAW), and to the believers, but the hypocrites know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'If we return to the City, the strong will expel the humiliated' But the might belongs to Allah, and His Messenger and the believers, but thehypocrites do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, “If we return to the City, the more powerful therein will evict the weak.” But power belongs to God, and His Messenger, and the believers; but the hypocrites do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"If we return to al-Madinah, the more honored [for power] will surely expel therefrom the more humble.\" And to Allah belongs [all] honor, and to His Messenger, and to the believers, but the hypocrites do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[63:8] They say, ‘Surely if we return, from the raid against the Banū al-Mustaliq, to Medina, the powerful, by which they meant themselves, will [soon] expel from it the weaker’, by which they meant the believers. Yet [the real] might, victory, belongs to God and to His Messenger, and to the believers, but the hypocrites do not   know, that.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They say) the one who said this is 'Abdullah Ibn Ubayy, especially to his host at the Battle of Tabuk: (Surely, if we return to Medina) from this battle (the mightier) i.e. 'Abdullah Ibn Ubayy (will soon drive out) of Medina (the weaker) the weak and humble, meaning by this Muhammad (pbuh); (when might belongeth to Allah and to His messenger and the believers) to conquer the hypocrites, 'Abdullah Ibn Ubayy and his host; (but the hypocrites know not) this nor believe in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن نهاية غافلتهم عن الله\n وعداوتهم مع المؤمنين: { يَقُولُونَ } على سبيل التهور والتهديد: { لَئِن رَّجَعْنَآ } عن سفرنا هذا { إِلَى ٱلْمَدِينَةِ لَيُخْرِجَنَّ ٱلأَعَزُّ } يريدون أنفسهم { مِنْهَا } أي: من المدينة { ٱلأَذَلَّ } يريدون المؤمنين\n وذلك أن أعرابياً من المهاجرين نازع أنصارياً في بعض الغزوات على ماء فضرب الأعرابي رأسه بخشبة\n فشكا إلى بان أُبي وملئه\n فقالوا: لا تنفقوا على من عند رسو الله حتى ينفضروا\n وإذا { رَّجَعْنَآ إِلَى ٱلْمَدِينَةِ لَيُخْرِجَنَّ ٱلأَعَزُّ مِنْهَا ٱلأَذَلَّ } [المنافقون: 8]\n { وَ } لم يعلموا أولئك الغواة الضالون في تيه العتو والعناد أنه { لِلَّهِ ٱلْعِزَّةُ } أي: القوة والغلبة أصالةً { وَلِرَسُولِهِ } تبعاً { وَلِلْمُؤْمِنِينَ } بمتابعة الرسول { وَلَـٰكِنَّ ٱلْمُنَافِقِينَ لاَ يَعْلَمُونَ } [المنافقون: 8] عزة الله وعزة أهل الله\n لفرط جهلهم وغرورهم بأموالهم وأولادهم\n لذلك يحصرون العزة والقوة بأنفسهم\n\n\nثمَّ قال سبحانه تسليةً للمؤمنين مشتملة على نوع من التعريض\n والحث والترغيب: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } مقتضى إيمانكم: ألاَّ تلتفتوا لعزة الدنيا\n ولا تغتروا بكثرة الأموال والأولاد فيها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يقولون لئن رجعنا } من غزوة بني الصطلق { إِلى المدينة ليُخْرِجَنَّ الأعَزُّ منها } يعني: نفسه ـ لعنه الله ـ { الأذلَّ } يعني: جانب المؤمنين\n وإسناد القول بذلك إلى المنافقين لرضاهم به\n فردّ تعالى عليهم ذلك بقوله: { وللهِ العِزَّةُ ولرسوله وللمؤمنين } أي: ولله الغلبة والعزّة\n ولِمن أعزّه من رسوله والمؤمنين\n لا لغيرهم\n كما أنَّ المَذلة والهوان للشيطان وذويه من الكافرين والمنافقين\n وعن بعض الصالحات\n وكانت في هيئة رثّة من الفقر: ألستُ على الإسلام\n وهو العزّ الذي لا ذُلّ معه\n والغنى الذي لا فقر معه؟ وعن الحسن بن عليّ رضي الله عنه: أنّ رجلاً قال له: إنَّ فيك تيهاً؟ قال: ليس بتيه\n ولكنه عزّة\n وتلا هذه الآية\n هـ\n  { ولكنَّ المنافقينَ لا يعلمون } ذلك لفرط جهلهم وغرورهم\n فيهذون ما يهذون\n رُوي أنَّ ولد عبدالله بن أُبيّ\n واسمه عبدالله\n\n \" وكان رجلاً صالحاً\n لَمَّا سمع الآية جاء إلى أبيه\n فقال له: أنت والله يا أبت الذليل\n ورسول الله العزيز\n ووقف على باب السكة التي يسلكها أبوه\n وجرّد السيف\n ومنعه الدخول\n وقال: والله لا دخلتَ منزلك إلاَّ أن يأذن في ذلك رسولُ الله صلى الله عليه وسلم\n وعبد الله في أذل حال\n فبلغ ذلك رسولَ الله صلى الله عليه وسلم فبعث إليه: \" أن خَلِّه يمضي إلى منزله\n وجزاه خيراً \" \nفقال: الآن فنعم\n هـ\n الإشارة: مَن تكبّر عن حط رأسه للأكابر ففيه خصلة من النفاق\n والمراد بالأكابر: الأولياء العارفون بالله\n مَن تكبّر عنهم مات\n وفيه بقية مِن النفاق\n إذ لا يخلو منه إلاّ بالتطهير الكبير على أيدي المشايخ\n وكذلك مَن منع الناس مِن الإنفاق على أهل النسبة\n كائناً ما كانوا\n فشُؤمه الحرمان من نسيم أهل الوصلة\n { وللّه خزائن السماوات والأرض } أي: خزائن الأرزاق الحسية والمعنوية\n فقد يُعطي أحدهما دون الآخر\n وقد يعطيهما معاً\n أو: يمنعهما معاً\n على حسب المشيئة\n قال رجل لحاتم الأصم: من أين تأكل؟ فقال: { وللّه خزائن السماوات والأرض } وقال الجنيد: خزائن السماوات: الغيوب\n وخزائن الأرض: القلوب\n وهم علاّم الغيوب\n ومُقلِّب القلوب\n\nوكان الشبلي يقرأ: { وللّه خزائن السماوات والأرض } ويقول: فأين تذهبون\n هـ\n أي: حين تهتمون بالرزق بعد هذه الآية\n { ولله العزةُ ولرسوله وللمؤمنين } \n قال بعضهم: عزة الله: قهره\n وعزته لرسوله: إظهاره\n وعزتُه للمؤمنين: نصره إياهم على مَن آذاهم\n وقيل: عزة الله: الولاية\n[الكهف:44]\n وعزة الرسول: الكفاية والعناية\n وعزة المؤمنين: الرفعة والرعاية\n وقيل: عزة الله: الربوبية\n وعزة الرسول: النبوة\n وعزة المؤمنين: العبودية\n فإذا أردتَ أيها العبد أن تكون عزيزاً فارفع همتك عن الخلق\n وسُد باب الطمع\n وتحلَّ بحلية الورع\n قال بعضهم: والله ما رأيتُ العزّ إلاَّ في رفع الهمة عن الخلق\n وقال آخر: ما قُذِّر لماضغيك أن يمضغاه فلا بدّ أن يمضغاه\n فامضغه ـ ويحك ـ بعز\n ولا تمضغه بذل\n هـ\n ولمّا ذمَّ المنافقين بأمرهم بالإمساك عن الإنفاق أَمَرَ المؤمنين به\n وقدَّم الأمر بذكره\n تمهيداً\n فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ لاَ تُلْهِكُمْ أَمْوَالُكُمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:37",
      "similarity": 0.41384598076717394
    },
    {
      "verse": "58:20",
      "similarity": 0.39415023941285077
    },
    {
      "verse": "27:34",
      "similarity": 0.39074186134026473
    },
    {
      "verse": "15:67",
      "similarity": 0.37826971687666305
    },
    {
      "verse": "17:111",
      "similarity": 0.3719175604584852
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/63:8.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/63:8.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/63:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}