{
  "chapter": "المنافقون",
  "text": "يايها الذين ءامنوا۟ لا تلهكم امولكم ولا اولدكم عن ذكر الله ومن يفعل ذلك فاو۟لئك هم الخسرون",
  "translations": [
    {
      "translation": "You who have iman! do not let your wealth or children divert you from the remembrance of Allah. Whoever does that is lost.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, let not your wealth and children make you negligent of the remembrance of God. Those who do so will be losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, let your possessions and your offspring not make you negligent of Allah's remembrance. For whoso does that, they will be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not let your wealth and children divert you from remembering God. Wwhoever is diverted will suffer a great loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! May not your wealth or your children cause you to neglect the remembrance of Allah; and whoever does this – so it is they who are in a loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Let not your properties or your children divert you from the remembrance of Allah. And whosoever does that, then they are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! let not your wealth, or your children, divert you from the remembrance of Allah; and whoever does that, these are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, let not your possessions neither your children divert you from God's remembrance; whoso does that, they are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Let not your wealth nor your children distract you from remembrance of Allah. Those who do so, they are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers! Do not let your wealth or your children distract you from remembrance of God. Those who do so will be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe let not your riches or your children divert you from the remembrance of Allah. And whosoever doth that then those! they are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Do not let your possessions and children distract you from the remembrance of Allah, and whoever does that—it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Let not your riches or your children divert you from the remembrance of Allah. If any act thus, the loss is their own.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Let not your properties or your children divert you from the remembrance of Allah. And whosoever does that, then they are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not let either your possessions or your children divert you from the Remembrance of Allah. Those who do that shall be the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Let neither your possessions nor your children distract you from the remembrance of God. Whoever does that—these are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, let not your wealth and your children divert you from remembrance of Allah. And whoever does that - then those are the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[63:9] O you who believe, do not let your possessions and your children divert you, distract you, from the remembrance of God, [from] the five prayers; for whoever does that — it is they who are the losers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا أَيُّهَا الَّذِينَ آَمَنُوا لَا تُلْهِكُمْ أَمْوَالُكُمْ وَلَا أَوْلَادُكُمْ عَنْ ذِكْرِ اللَّهِ وَمَنْ يَفْعَلْ ذَلِكَ فَأُولَئِكَ هُمُ الْخَاسِرُونَ (9)انتقال من كشف أحوال المنافقين المسوق للحذر منهم والتحذير من صفاتهم ، إلى الإِقبال على خطاب المؤمنين بنهيهم عما شأنُه أن يشغل عن التذكر لما أمر الله ونهى ، ثم الأمر بالإِنفاق في سبل الخير في سبيل الله ومصالح المسلمين وجماعتهم وإسعاف آحادهم ، لئلا يستهويهم قول المنافقين { لا تنفقوا على من عند رسول الله } \\[ المنافقين : 7 \\] والمبادرة إلى ذلك قبل إتيان الموت الذي لا يُدْرى وقت حلوله حين تمنى أن يكون قد تأخر أجله ليزيد من العمل الصالح فلا ينفعه التمني وهو تمهيد لقوله بعده { وأنفقوا من ما رزقناكم } \\[ المنافقون : 10 \\] ، فالمناسبة لهذا الانتقال هو حكاية مقال المنافقين ولذلك قدم ذكر الأموال على ذكر الأولاد لأنها أهم بحسب السياق .ونودي المخاطبون بطريق الموصول لما تؤذن به الصلة من التهمم لامتثال النهي .وخص الأموال والأولاد بتوجه النهي عن الاشتغال بها اشتغالاً يلهي عن ذكر الله لأن الأموال مما يكثر إقبال الناس على إنمائها والتفكير في اكتسابها بحيث تكون أوقات الشغل بها أكثر من أوقات الشغل بالأولاد . ولأنها كما تشغل عن ذكر الله بصرف الوقت في كسبها ونمائها ، تشغل عن ذكره أيضاً بالتذكير لكنزها بحيث ينسى ذكر ما دعا الله إليه من إنفاقها .وأما ذِكر الأولاد فهو إدماج لأن الاشتغال بالأولاد والشفقة عليهم وتدبير شؤونهم وقضاء الأوقات في التأنس بهم من شأنه أن ينسي عن تذكر أمر الله ونهيه في أوقات كثيرة فالشغل بهذين أكثر من الشغل بغيرهما .وصيغ الكلام في قالب توجيه النهي عن الإِلهاء عن الذكر ، إلى الأموال والأولاد والمراد نهي أصحابها ، وهو استعمال معروف وقرينته هنا قوله : { ومن يفعل ذلك فأولئك هم الخاسرون } . وأصله مجاز عقلي مبالغة في نهي أصحابها عن الاشتغال بسببها عن ذكر الله ، فنُزّل سبب الإِلهاء منزلة اللاَّهي للملابسة بينهما وهو كثير في القرآن وغيره كقوله : { يا بني آدم لا يفتننكم الشيطان } \\[ الأعراف : 27 \\] وقولهم لا أعرفنك تفعل كذا .و { لا } في قوله : { ولا أولادكم } نافية عاطفة { أولادكم } على { أموالكم } ، والمعطوف عليه مدخول { لا } الناهية لأن النهي يتضمن النفي إذ هو طلب عدم الفعل ف { لا } الناهية أصلها { لا } النافية أشربت معنى النهي عند قصد النهي فجزمت الفعل حملاً على مضادة معنى لام الأمر فأكد النهي عن الاشتغال بالأولاد بحرف النفي ليكون للاشتغال بالأولاد حظ مثل حظ الأموال .و { ذكر الله } مستعمل في معنييه الحقيقي والمجازي . فيشمل الذكر باللسان كالصلاة وتلاوةِ القرآن ، والتذكر بالعقل كالتدبر في صفاته واستحْضار امتثاله قال عمر بن الخطاب : «أفضل من ذكر الله باللسان ذِكر الله عند أمره ونهيه» .وفيه أن الاشتغال بالأموال والأولاد الذي لا يُلهي عن ذكر الله ليس بمذموم وله مراتب .وقوله : { ومن يفعل ذلك فأولئك هم الخاسرون } ، دليل على قول علماء أصول الفقه «النهيُ اقتضاءُ كفَ عن فعل» .والإِشارة ب { ذلك } إلى اللهو عن ذكر الله بسبب الأموال والأولاد ، أي ومن يُلْهِ عن ذكر الله ، أي يترك ذكر الله الذي أوجبه مثل الصلاة في الوقت ويترك تذكر الله ، أي مراعاة أوامره ونواهيه .ومتى كان اللهو عن ذكر الله بالاشتغال بغير الأموال وغير الأولاد كان أولى بحكم النهي والوعيد عليه .وأفاد ضمير الفصل في قوله : { فأولئك هم الخاسرون } قصرَ صفة الخاسر على الذين يفعلون الذي نُهوا عنه ، وهو قصر ادعائي للمبالغة في اتصافهم بالخسران كأن خسران غيرهم لا يعد خسراناً بالنسبة إلى خسرانهم .والإِشارة إليهم ب { أولئك } للتنبيه على أنهم استحقوا ما بعد اسم الإِشارة بسبب ما ذكر قبل اسم الإِشارة ، أعني اللهو عن ذكر الله .\n\n",
      "translations": [
        {
          "translation": "Here the story of Zayd Ibn Arqam is also mentioned (0 ye who believe) in Muhammad (pbuh) and the Qur'an! (Let not your wealth) in Mecca (nor your children) also in Mecca (distract you from remembrance of Allah) from migration and jihad. (Those who do so) whoever is distracted by his wealth and children from migrating and striving, (they are the losers) who will face punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لا تلهكم أموالكم ولا أولادكم عن ذكر الله } إن صدقتم في الإيمان\n فإن قضية الإيمان غلبة حب الله على محبة كل شيء فلا تكن محبتهم ومحبة الدنيا من شدّة التعلق بهم وبالأموال غالبة في قلوبكم على محبة الله فتحتجبوا بهم عنه فتصيروا إلى النار فتخسروا نور الاستعداد الفطري بإضاعته فيما يفنى سريعاً\n وتجرّدوا عن الأمور بإنفاقها وقت الصحة والاحتياج إليها ليكون فضيلة في أنفسكم وهيئة نورية لها\n فإن الإنفاق إنما ينفع إذا كان عن ملكة السخاء وهيئة التجرّد في النفس",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n حتى { لاَ تُلْهِكُمْ } ولا تشغلكم { أَمْوَالُكُمْ وَلاَ أَوْلاَدُكُمْ عَن ذِكْرِ ٱللَّهِ } وعن التوجه نحوه\n والركون إليه في مطلق الأحوال { وَمَن يَفْعَلْ ذَلِكَ } والتفت إلى مزخرفات الدنيا\n وشغل بها عن الله { فَأُوْلَـٰئِكَ } البعداء المشغولون بالخسيس الأدنى عن الشريف الأعلى { هُمُ ٱلْخَاسِرُونَ } [المنافقون: 9] المقصورون على الخسران الكلي\n لاستبدالهم الباقي بالفاني\n والزاهق الزائل بالقهَّار القديم\n\n\n{ وَ } بعدما سمعتم مآل أموالكم إلى ما يتفرع عليها من الحرمان والخسران { أَنفِقُواْ مِن مَّا رَزَقْنَاكُمْ } وسقنا نحوكم من أموال الدنيا { مِّن قَبْلِ أَن يَأْتِيَ أَحَدَكُمُ ٱلْمَوْتُ } يعني: أنفقوا قبل حلول الأجل\n وظهور أمارات الموت",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الذين آمنوا لا تُلهكم أموالكُم } أي: لايشغلكم الاهتمام بتدبير أمورها\n والاعتناء بمصالِحها\n والتمتُّع بها\n { ولا أولادُكم } أي: سروركم بهم\n وشفقتكم عليهم\n والاستغراق في الأسباب\n للنفقة عليهم { عن ذكر الله } أي: عن الاشتغال بذكره عزّ وجل\n من الصلاة\n والذكر\n وسائر العبادات\n والمراد: نهيهم عن التلهي بها\n وتوجيه النهي لهم للمبالغة\n كقوله تعالى:\n[المائدة:2]\n { ومن يفعل ذلك } أي: التلهي بالدنيا عن الدين { فأولئك هم الخاسرون } الكاملون في الخسران\n حيث باعوا العظيم الباقي بالحقير الفاني",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "80:10",
      "similarity": 0.6722386359650913
    },
    {
      "verse": "102:1",
      "similarity": 0.6361736978778679
    },
    {
      "verse": "47:36",
      "similarity": 0.5297285467025156
    },
    {
      "verse": "21:17",
      "similarity": 0.5260628296419014
    },
    {
      "verse": "29:64",
      "similarity": 0.4637215733381819
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/063009.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/063009.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/63:9.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}