{
  "chapter": "التغابن",
  "text": "ما اصاب من مصيبة الا باذن الله ومن يؤمنۢ بالله يهد قلبه والله بكل شىء عليم",
  "translations": [
    {
      "translation": "No misfortune occurs except by Allah's permission. Whoever has iman in Allah - He will guide his heart. Allah has knowledge of all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No calamity befalls unless God dispenses. He guides the heart of whosoever believes in God; and God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No misfortune ever befalls unless it be by Allah's leave. And whosoever has faith in Allah, Allah directs his heart along the Right Path. Allah has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No one will be afflicted with any hardship without it being the will of God. The hearts of whoever believed in God will receive guidance. God has the knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No misfortune befalls except by Allah’s command; and Allah will guide the heart of whoever accepts faith in Him; and Allah knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No calamity occurs, but by the permission of Allah, and whosoever believes in Allah, He guides his heart. And Allah is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No affliction comes about but by Allah's permission; and whoever believes in Allah, He guides aright his heart; and Allah is Cognizant of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No affliction befalls, except it be by the leave of God. Whosoever believes in God, He will guide his heart. And God has knowledge of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No calamity befalleth save by Allah's leave. And whosoever believeth in Allah, He guideth his heart. And Allah is Knower of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No affliction can befall man but by God's permission -- He guides the hearts of those who believe in Him: God has knowledge of all things --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No calamity befalleth save by Allah's leave. And whosoever believeth in Allah, his heart He guideth. And Allah is of everything Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No affliction visits [anyone] except by Allah’s leave. Whoever has faith in Allah, He guides his heart, and Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No kind of calamity can occur, except by the leave of Allah: and if any one believes in Allah, (Allah) guides his heart (aright): for Allah knows all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No calamity befalls, but with the Leave [i.e. decision and Qadar (Divine Preordainments)] of Allah, and whosoever believes in Allah, He guides his heart [to the true Faith with certainty, i.e. what has befallen him was already written for him by Allah from the Qadar (Divine Preordainments)], and Allah is the All-Knower of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No affliction falls except by the permission of Allah. For those who believe in Allah, Allah will guide his heart. Allah has knowledge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No disaster occurs except by God’s leave. Whoever believes in God, He guides his heart. God is Aware of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No disaster strikes except by permission of Allah. And whoever believes in Allah - He will guide his heart. And Allah is Knowing of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[64:11] No affliction strikes except by the leave of God, by His decree. And whoever believes in God, in His saying that every affliction is by His decreeing [it], He will guide his heart, to endure it [patiently]. And God is Knower of all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(No calamity befalleth) you in your bodies, families or wealth (save by Allah's leave) and decree. (And whosoever believeth in Allah) seeing that the calamity is from Allah, (He guideth his heart) to have contentment and patience; it is also said: when Allah gives him, he is thankful and when Allah tries him, he is patient and when he wrongs someone, he asks for forgiveness, and when a calamity befalls him, he says: \"verily we are unto Allah, and unto Him we shall return\". (And Allah is Knower of all things) that befall you, whether it is a calamity or something else.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ما أصاب من مصيبة } من هذه المصائب الحاجبة وغيرها { إلا بإذن الله } أي: بتقديره ومشيئته على مقتضى حكمته { ومن يؤمن بالله } أحد الإيمانات المذكورة { يهد قلبه } إلى العمل بمقتضى إيمانه حتى يجد كمال مطلوبه الذي آمن به ويصل إلى محل نظره { والله بكل شيء عليم } فيعلم مراتب إيمانكم وسرائر قلوبكم وأحوال أعمالكم وآفاتها وخلوصها من الآفات\n { واطيبعوا الله وأطيعوا الرسول } على حسب معرفتكم بالله وبالرسول فإن أكثر التخلف من الكمال والوقوع في الخسران والنقصان إنما يقع من التقصير في العمل وخور القدم لا من عدم النظر",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على سبيل التقرير والتثبيت لأرباب المعرفة والإيقان على جادة التفويض والتكلان: { مَآ أَصَابَ } على من أصاب وما أصاب { مِن مُّصِيبَةٍ } أي: حادثة مفرحة أو مؤلمة { إِلاَّ بِإِذْنِ ٱللَّهِ } وبمقتضى إرادته وتقديره { وَمَن يُؤْمِن بِٱللَّهِ } ويفوّض أمره إليه\n ويأخذه وكيلاً\n ويجعله حسيباً وكفيلاً { يَهْدِ قَلْبَهُ } وينور خلده\n ويبصره على أمارات التوحيد وعلامات اليقين { وَ } بالجملة: { ٱللَّهُ } المطلع على عموم ما غاب\n وشهد { بِكُلِّ شَيْءٍ } دخل في حيطة قدرته { عَلِيمٌ } [التغابن: 11] بعمله الحضوري بحيث لا يعزب عنه شيء مطلقاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ما أصاب من مُصيبةٍ } دنيوية أو أخروية { إِلاّ بإذن الله } أي: بتقديره وإرادته\n كأنها بذاتها متوجهة إلى الإنسان\n متوقفة على إذنه تعالى\n { ومَن يُؤمن بالله } أي: يُصدِّق بأنّ المقادير كلها بيد الله { يَهْدِ قلبه } للرضا والتسليم\n أو الاسترجاع\n فيقول: إنّا لله وإنّا إليه راجعون\n أو: يَهْدِ قلبه حتى يعلم أنّ ما أصابه لم يكن ليخطئه\n وما أخطأه لم يكن ليُصيبه\n وعن مجاهد: إن ابتلي صبر\n وإن أعطي شكر\n وإن ظُلم غفر\n ونقل ابن عطية عن المفسرين: أنّ المراد: مَن اعترف بالقدر هانت عليه المصيبة\n وسلَّم لأمر الله تعالى\n { واللهُ بكل شيءٍ عليمٌ } فيعلم ما في القلوب من برد الرضا أو حرارة التدبير",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:166",
      "similarity": 0.6497362259282363
    },
    {
      "verse": "2:156",
      "similarity": 0.4353078347908262
    },
    {
      "verse": "9:51",
      "similarity": 0.40147998439265514
    },
    {
      "verse": "42:39",
      "similarity": 0.3982325430331595
    },
    {
      "verse": "84:2",
      "similarity": 0.3359352046867719
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/064011.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/064011.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/64:11.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}