{
  "chapter": "التغابن",
  "text": "فاتقوا۟ الله ما استطعتم واسمعوا۟ واطيعوا۟ وانفقوا۟ خيرا لانفسكم ومن يوق شح نفسه فاو۟لئك هم المفلحون",
  "translations": [
    {
      "translation": "So have taqwa of Allah, as much as you are able to, and listen and obey and spend for your own benefit. It is the people who are safe-guarded from the avarice of their own selves who are successful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So fear God as much as you can, and listen and obey, and spend in charity for your own good. He who is saved from his own avarice will be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So hold Allah in awe as much as you can, and listen and obey, and be charitable. This is for your own good. And whoever remains safe from his own greediness, it is such that will prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have as much fear of God as best as you can. Listen to the Messenger, obey him, and spend for your own sake good things for the cause of God. Those who control their greed will have everlasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore fear Allah as much as possible, and heed the commands, and obey, and spend in Allah’s cause, for your own good; and whoever is rescued from the greed of his own soul – is they who will be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So have Taqwa of Allah as much as you can; listen and obey, and spend in charity; that is better for yourselves. And whosoever is saved from his own greed, then they are the successful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore be careful of (your duty to) Allah as much as you can, and hear and obey and spend, it is better for your souls; and whoever is saved from the greediness of his soul, these it is that are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So fear God as far as you are able, and give ear, and obey, and expend well for yourselves. And whosoever is guarded against the avarice of his own soul, those -- they are the prosperers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So keep your duty to Allah as best ye can, and listen, and obey, and spend; that is better for your souls. And whoso is saved from his own greed, such are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so be mindful of God as best as you can; and listen, and obey; and spend in charity: it is for your own good. Those who guard themselves against their own greed will surely prosper:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore fear Allah as much as ye are able, and hearken and obey, and expend, for the benefit of your souls. And whosoever is protected from niggardliness of his soul - those! they are the blissful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be wary of Allah, as much as you can, and listen and obey, and spend [in the way of Allah]; that is better for yourselves. Those who are saved from their own greed—it is they who are the felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So fear Allah as much as ye can; listen and obey and spend in charity for the benefit of your own soul and those saved from the covetousness of their own souls,- they are the ones that achieve prosperity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So keep your duty to Allah and fear Him as much as you can; listen and obey; and spend in charity, that is better for yourselves. And whosoever is saved from his own covetousness, then they are the successful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore fear Allah as much as you can, and listen, obey, and spend well for yourselves. And whosoever is saved from the greed of his own soul; those are the winners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be conscious of God as much as you can, and listen, and obey, and give for your own good. He who is protected from his stinginess—these are the prosperous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So fear Allah as much as you are able and listen and obey and spend [in the way of Allah]; it is better for your selves. And whoever is protected from the stinginess of his soul - it is those who will be the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[64:16] So fear God as far as you can — this abrogates His saying: Fear God as He should be feared [Q. 3:102] — and listen, to what you have been enjoined to, listening disposed to accept, and obey and expend, in obedience [to Him]; that is better for your souls (khayran li-anfusikum is the predicate of an implied yakun, ‘[that] is’, and the response to the imperative). And whoever is shielded from the avarice of his own soul, such are the successful, the winners.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So keep your duty to Allah) so obey Allah (as best ye can) to the best of your ability, (and listen) to what you are commanded with, (and obey) the commands of Allah and His Messenger, (and spend) and give alms in the way of Allah; (that is better for your souls) He says: giving alms is better than withholding wealth. (And whoso is saved from his own greed) whoever drives away from himself his own greed; and it is also said this means: whoever gives the poor-due entitled in his wealth, (such are the successful) who escape Allah's wrath and torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { فَٱتَّقُواْ ٱللَّهَ مَا ٱسْتَطَعْتُمْ } واجعلوه وقاية لنفوسكم من تغرير الشيطان وفتنته { وَٱسْمَعُواْ } قول الله بسمع الرضا والقبول { وَأَطِيعُواْ } أمره ونهيه، ولا تخرجوا عن مقتضى حكمه وأحكامه مطلقاً { وَأَنْفِقُواْ } مما رزقكم الله، واستخلفكم عليه امتثالاً لأمره، وطلباً لمرضاته ، وافعلوا جميع ما أمركم الحق، سيما الإيثار والإنفاق؛ ليكون امتثالكم وإنفاقكم { خَيْراً لأَنفُسِكُمْ } في أولاكم، وذخراً لكم في أخراكم، ومن معظم فوائد الإنفاق: صون النفس عن الشح المطاع { وَمَن يُوقَ شُحَّ نَفْسِهِ } بالبذل والإنفاق { فَأُوْلَـٰئِكَ } السعداء المتصفون بالكرم والسخاء { هُمُ ٱلْمُفْلِحُونَ } [التغابن: 16] الفائزون من الله بالمثوبة العظمة، والدرجة العليا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فاتقوا اللهَ ما استطعتم } أي: ابذلوا جهدَكم وطاقتكم في تقواه، قال ابن عطية: تقدّم الخلاف هل هذه الآية ناسخة لقوله تعالى:\n\n[آل عمران:102] أو: مُبيّنة لها، والمعنى: اتقوا الله حق تقاته فيما استطعتم، وهذا هو الصحيح\n هـ\n { واسمَعُوا } ما تُوعظون به، { وأطيعوا } فيما تُؤمرون به { وأَنفِقوا } مما رزقناكم في الوجوه التي أُمرتم، فالإنفاق فيها خالصاً لوجهه { خيراً لأنفسِكم } أي: وائتوا خيراً لأنفسكم { ومَن يُوقَ شُحَّ نفسه فأولئك هم المفلحون } الفائزون بكل خير",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:128",
      "similarity": 0.44278674297044657
    },
    {
      "verse": "59:9",
      "similarity": 0.4033754258036037
    },
    {
      "verse": "33:19",
      "similarity": 0.27281394997028463
    },
    {
      "verse": "24:51",
      "similarity": 0.22096563145128073
    },
    {
      "verse": "9:88",
      "similarity": 0.17465915087495387
    }
  ]
}