{
  "chapter": "التغابن",
  "text": "واطيعوا۟ الله واطيعوا۟ الرسول فان توليتم فانما على رسولنا البلغ المبين",
  "translations": [
    {
      "translation": "Obey Allah and obey the Messenger. But if you turn your backs, the Messenger is only responsible for clear transmission.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey God and obey His Apostle. If you turn away, the duty of the Apostle is to convey the message clearly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey Allah and obey the Messenger. But if you turn away from obedience, (then know that) Our Messenger has no other duty than to clearly convey the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey God and the Messenger, but if you turn away, know that the only duty of Our Messenger is to clearly preach.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and obey His Noble Messenger; then if you turn away, know that the duty upon Our Noble Messenger is only to plainly convey.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey Allah, and obey the Messenger; but if you turn away, then the duty of Our Messenger is only to convey clearly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and obey the Apostle, but if you turn back, then upon Our Apostle devolves only the clear delivery (of the message).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey God, and obey the Messenger; but if you turn your backs, it is only for the Messenger to deliver the Manifest Message.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey Allah and obey His messenger; but if ye turn away, then the duty of Our messenger is only to convey (the message) plainly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "obey God and obey the Messenger; but if you turn away, remember that Our Messenger is only responsible for clearly conveying the message.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey Allah and obey the apostlle; then if ye turn away, on Our apostle is only the preaching manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey Allah and obey the Apostle; but if you turn away, then Our Apostle’s duty is only to communicate in clear terms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So obey Allah, and obey His Messenger: but if ye turn back, the duty of Our Messenger is but to proclaim (the Message) clearly and openly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey Allah, and obey the Messenger (Muhammad SAW), but if you turn away, then the duty of Our Messenger is only to convey (the Message) clearly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Obey Allah and obey the Messenger. But, if you turn away, Our Messenger's duty is only to deliver the Clear Message.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So obey God, and obey the Messenger. But if you turn away—it is only incumbent on Our Messenger to deliver the clear message.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And obey Allah and obey the Messenger; but if you turn away - then upon Our Messenger is only [the duty of] clear notification.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[64:12] And obey God and obey the Messenger; but if you turn away, then the Messenger’s duty is only to communicate [the Message] clearly.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Obey Allah) with regard to His obligations (and obey His messenger) with regard to his practices; it is also said this means: obey Allah regarding Allah's divine Oneness and obey His Messenger by accepting his message; (but if ye turn away) from their obedience, (then the duty of Our messenger) Muhammad (pbuh) (is only to convey (the message)) on behalf of Allah (plainly) i.e. in a language that you understand.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { أَطِيعُواْ ٱللَّهَ وَأَطِيعُواْ ٱلرَّسُولَ } المبلغ لكم طريق الهداية والرشاد\n المبين لكم سبيل السلام والسلامة والنجاة في يوم المعاد { فَإِن تَولَّيْتُمْ } وأعرضتم عن دعوته بعد تبليغه وإرشاده فلا بأس عليه { فَإِنَّمَا عَلَىٰ رَسُولِنَا } بمقتضى وحينا وأمرنا { ٱلْبَلاَغُ ٱلْمُبِينُ } [التغابن: 12] الظاهر والواضح\n\n\nوبد تبليغه عن وجهه لم يبق عليه شيء\n وعلينا حسابكم وعذابكم\n\n\nوكيف يتأتى منكم الإعراض أيها المعرضون المبطلون\n مع أنه { ٱللَّهُ } الواحد الأحد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأطيعوا اللهَ } فيما أمركم به\n ومن جملته: الرضا بقضائه عن المصائب\n { وأطيعوا الرسولَ } فيما سنَّ لكم من الأخلاق الطيبة\n وكرر الأمر للتأكيد والإيذان بالفرق بين الطاعتين في الكيفية\n { فإِن توليتم } عن طاعتهما { فإنما على رسولنا البلاغُ المبين } \n وهو تعليل للجواب المحذوف\n أي: فإن تُعرضوا فلا بأس عليه إذ ما عليه إلاّ البلاغ\n وقد فعل ذلك بما لا مزيد عليه\n وإظهار الرسول مضافاً إلى نون العظمة في مقام إضماره لتشريفه صلى الله عليه وسلم والإشعار بأنّ مدار الحكم\n الذين هو وظيفته عليه السلام هو محض التبليغ\n ولتشنيع التولِّي عنه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:82",
      "similarity": 0.8023923343898217
    },
    {
      "verse": "24:54",
      "similarity": 0.7284270568510739
    },
    {
      "verse": "36:17",
      "similarity": 0.6523264977004013
    },
    {
      "verse": "5:92",
      "similarity": 0.5591850893713801
    },
    {
      "verse": "29:18",
      "similarity": 0.5442706947189936
    }
  ]
}