{
  "chapter": "التغابن",
  "text": "يايها الذين ءامنوا۟ ان من ازوجكم واولدكم عدوا لكم فاحذروهم وان تعفوا۟ وتصفحوا۟ وتغفروا۟ فان الله غفور رحيم",
  "translations": [
    {
      "translation": "You who have iman! some of your wives and children are an enemy to you, so be wary of them. But if you pardon and exonerate and forgive, Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, some of your spouses and children are your enemies, so beware of them! Yet if you forbear, overlook, and forgive, God is indeed forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, there are enemies to you from among your spouses and your off-spring, so beware of them. But if you forgive and overlook their offences and pardon them, then surely Allah is Most Forgiving, Most Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, some of your wives and children may prove to be your enemies so beware of them. However, if you would pardon, ignore and forgive, know that God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Some of your wives and children are your enemies, therefore be wary of them; and if you pardon and overlook and forgive, then indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Verily, among your wives and your children there are enemies for you; therefore beware of them! But if you pardon (them) and overlook, and forgive, then verily, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! surely from among your wives and your children there is an enemy to you; therefore beware of them; and if you pardon and forbear and forgive, then surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O believers, among your wives and children there is an enemy to you; so beware of them. But if you pardon, and overlook, and if you forgive, surely God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Lo! among your wives and your children there are enemies for you, therefor beware of them. And if ye efface and overlook and forgive, then lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers! [Even] among your wives and your children you have enemies: so beware of them. But if you overlook their offences and forgive and pardon them, then surely, God is most forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! verily of your wives and your children there is an enemy Unto you; wherefore beware of them. And if ye pardon and pass over and forgive, then verily Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Indeed, you have enemies among your spouses and children; so beware of them. Yet if you excuse, forbear, and forgive, then Allah is indeed all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Truly, among your wives and your children are (some that are) enemies to yourselves: so beware of them! But if ye forgive and overlook, and cover up (their faults), verily Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Verily, among your wives and your children there are enemies for you (i.e. may stop you from the obedience of Allah), therefore beware of them! But if you pardon (them) and overlook, and forgive (their faults), then verily, Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, some of your wives and children are enemies; so beware of them. But if you pardon, overlook and forgive them, then Allah is the Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Among your wives and your children are enemies to you, so beware of them. But if you pardon, and overlook, and forgive—God is Forgiver and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, indeed, among your wives and your children are enemies to you, so beware of them. But if you pardon and overlook and forgive - then indeed, Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[64:14] O you who believe! Indeed among your wives and children there are enemies for you, so beware of them, of obeying them in neglecting [the performance of] good [deeds], such as struggling or emigrating — because the reason why this verse was revealed was [precisely their] obedience [of them] in such [matters]. And if you pardon, them, for their impeding you from such good [deeds], justifying it on account of the distress that parting with you causes them, and overlook [such enmity] and forgive, then assuredly God is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe) in Muhammad (pbuh) and the Qur'an! (Lo! Among your wives and your children) who are in Mecca (there are enemies for you) in that they barred you from migration and jihad, (therefore beware of them) lest you fail to migrate or engage in jihad. (And if ye efface) if you pardon them for barring you (and overlook) and turn away from them, and not punish them (and forgive) their sins after they have migrated from Mecca to Medina, (then lo! Allah is Forgiving) He forgives he who repents, (Merciful) towards he who die repentant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إن من أزواجكم وأولادكم } أي: بعضهم لاحتجابكم بهم ووقوفكم معهم بالمحبة وشدة العلاقة فتشركونهم بالله في المحبة بالتساوي في المحبتين وتعبدونهم من دون الله بإيثارهم عليه { فاحذروهم } أي: احفظوا أنفسكم عن محبتهم وشدّة التعلق بهم والاحتجاب\n وعاقبوهم عند التماسهم ذلك\n أي: إيثار حقوقهم على حقوق الله في كل شيء من المحبة وغيرها { وإن تعفوا } بالمداراة { وتصفحوا } عن جرائمهم بالحلم { وتغفروا } جناياتهم بالرحمة\n فلا ذنب ولا حرج إنما الذنب في الاحتجاب بهم وإفراط المحبة وشدة التعلق لا في مراعاة العدالة والفضيلة ومعاشرتهم بحسن الخلق فإنه مندوب بل اتصاف بصفات الله { فإن الله غفور رحيم } فعليكم التخلق بأخلاقه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ } وأيقنوا وحدة الحق واستقلاله في الوجود { إِنَّ مِنْ أَزْوَاجِكُمْ وَأَوْلاَدِكُمْ عَدُوّاً لَّكُمْ } يشغلونكم عن طاعة الله\n وعن التوجه نحوه\n والتوكل عليه بالتقريع والتشنيع\n ويردونكم في أمر المعاش وتحصيله إلى المعاطب والمهالك\n حتى تسألوا من كل غني غبي\n وشحيح دني\n فتسترزقون منهم\n وترزقون لهم\n ولا تثقون بالله\n ولا تعتمدون عليه في كفالته وترزيقه فتزل ثقتكم عن خالقكم ورازقكم\n وتزل قدمكم عن التثبت في صراط التوكل والتفويض\n\n\nوبالجملة: { فَٱحْذَرُوهُمْ } أي: عن الأولاد والأزواج\n ولا تأمنوا من مكرهم وغوائلهم { وَإِن تَعْفُواْ } عن جرائمهم وتشنيعاتهم\n وتوصلوهم إلى ما أملوا وترقبوا منكم { وَتَصْفَحُواْ } أي: تعرضوا عن إعراضهم\n وعدم الالتفات إلى حالهم { وَتَغْفِرُواْ } أي: تمحو وتستروا ما صدر عنهم من التشنيع والتقريع\n فتشتغلوا إلى إنجاح أغراضهم وإيجاد آمانيهم بعدما وفقكم الحق عليها { فَإِنَّ ٱللَّهَ } المطلع على ما في ضمائرهم من مراعاة جانب الأولاد والأزواج { غَفُورٌ } لذنوبكم التي صدرت عنكم في أمر المعاش إن كانت برخصة شرعية { رَّحِيمٌ } [التغابن: 14] يرحمكم ويمحو زلتكم إن كان سعيكم\n لتحصيل مقدار الكفاف والكفاية والقناعة\n لا للفضول منها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الذين آمنوا إِنّ مِن أزواجكم وأولادِكم عدواً لكم } يشغلونكم عن طاعة الله تعالى\n ويُخاصمونكم في أمور الدنيا\n أي: إنَّ من الأزواج أزواجاً يُعادين بعولتهنّ ويخاصمنَهم\n ومن الأولاد أولاداً يُعادون آباءهم ويعقّونهم\n { فاحذروهم } كونوا على حذر منهم إن شغلوكم عن الله\n فالضمير للعدو\n فإنه يُطلق على الجمع\n كقوله تعالى:\n[الشعراء:77]\n أو: للأزواج والأولاد جميعاً\n فالمأمور به على الأول: الحذر عن الكل\n وعلى الثاني: الحذر من البعض\n لأنّ منهم مَن ليس بعدو\n وإمّا الحذر عن عموم الفريقين\n لاشتمالهما على العدو\n { وإِن تَعفوا } عن ذنوبهم القابلة للعفو\n بأن تكون متعلقة بأمور الدنيا\n أو بأمور الدين لكن مع التوبة\n أو: تعفوا إذا اطّلعتم منهم على عداوة\n { وتصفحوا } تُعرضوا عن التوبيخ\n { وتغفروا } تستروا ذنوبهم\n { فإِنَّ الله غفور رحيم } يغفر لكم ذنوبكم\n ويعاملكم مثل ما عاملتم\n رُوي أنّ ناساً من أهل مكة أرادوا الهجرة\n فتعلّق بهم نساؤهم وأولادهم\n وقالوا: تنطلقون وتُضيعوننا\n فرقُّوا لهم\n ووقفوا\n فلما هاجروا بعد ذلك\n ورأوا الذين سبقوهم قد فَقِهُوا في الدين\n وحازوا رئاسةَ التقدُّم\n أرادوا أن يُعاقبوا أزواجهم وأولادهم\n فرغّبهم في العفو",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:89",
      "similarity": 0.6183502606582876
    },
    {
      "verse": "24:22",
      "similarity": 0.5803786295772034
    },
    {
      "verse": "43:5",
      "similarity": 0.5661697521544516
    },
    {
      "verse": "15:85",
      "similarity": 0.5126744020435633
    },
    {
      "verse": "2:109",
      "similarity": 0.4256415087106899
    }
  ]
}