{
  "chapter": "التغابن",
  "text": "ان تقرضوا۟ الله قرضا حسنا يضعفه لكم ويغفر لكم والله شكور حليم",
  "translations": [
    {
      "translation": "If you make a generous loan to Allah He will multiply it for you and forgive you. Allah is All-Thankful, Most Forbearing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you lend a goodly loan to God, He will double it for you, and forgive you. God knows the worth of good deeds and is clement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you give Allah a goodly loan, He will increase it for you several fold and will forgive you. Allah is Most Appreciative, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you give a virtuous loan to God, He will pay back double and forgive your sins. God is the Most Appreciating and the Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you lend an excellent loan to Allah, He will double it for you and forgive you; and Allah is Most Appreciative, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you lend to Allah a handsome loan, He will double it for you, and will forgive you. And Allah is Shakur, Halim,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you set apart for Allah a goodly portion, He will double it for you and forgive you; and Allah is the Multiplier (of rewards), Forbearing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you lend to God a good loan, He will multiply it for you, and will forgive you. God is All-thankful, All-clement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye lend unto Allah a goodly loan, He will double it for you and will forgive you, for Allah is Responsive, Clement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "if you give a good loan to God, He will multiply it for you and forgive you, for God is appreciative and forbearing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye lend Unto Allah a goodly loan, He will multiply it Unto you and will forgive you; and Allah is Appreciator, Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you lend Allah a good loan, He shall multiply it for you and forgive you, and Allah is all-appreciative, all-forbearing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye loan to Allah, a beautiful loan, He will double it to your (credit), and He will grant you Forgiveness: for Allah is most Ready to appreciate (service), Most Forbearing,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you lend to Allah a goodly loan (i.e. spend in Allah's Cause) He will double it for you, and will forgive you. And Allah is Most Ready to appreciate and to reward, Most Forbearing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you lend a good loan to Allah He will multiply it for you and will forgive you. Allah is the Thankful, the Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you lend God a good loan, He will multiply it for you, and will forgive you. God is Appreciative and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you loan Allah a goodly loan, He will multiply it for you and forgive you. And Allah is Most Appreciative and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[64:17] If you lend God a good loan, by giving voluntary alms out of the goodness of [your] hearts, He will multiply it for you (yudā‘ifhu: a variant reading has yuda‘‘ifhu), from tenfold up to seven hundredfold or more for each one — this [loan] being the giving of voluntary alms out of the goodness of the heart — and He will forgive you, whatever He will, and God is Appreciative, rewarding of obedience, Forbearing, in refraining from [always] punishing disobedience;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنْ تُقْرِضُوا اللَّهَ قَرْضًا حَسَنًا يُضَاعِفْهُ لَكُمْ وَيَغْفِرْ لَكُمْ وَاللَّهُ شَكُورٌ حَلِيمٌ (17) استئناف بياني ناشىء عن قوله : { وأنفقوا خيراً لأنفسكم } \\[ التغابن : 16 \\] ، فإن مضاعفة الجزاء على الإِنفاق مع المغفرة خير عظيم ، وبهذا الموقع يعلم السامع أن القرض أطلق على الإِنفاق المأمور به إطلاقاً بالاستعارة ، والمقصود الاعتناء بفضل الإِنفاق المأمور به اهتماماً مكرراً فبعد أن جُعل خيراً جُعل سببَ الفلاح وعُرف بأنه قرض من العبد لربّه وكفى بهذا ترغيباً وتلطفاً في الطلببِ إذ جُعل المنفق كأنه يعطي الله تعالى مالاً وذلك من معنى الإِحسان في معاملة العبد ربّه وقد بينه النبي صلى الله عليه وسلم في حديث جبريل إذ قال جبريل للنبيء عليهما الصلاة والسّلام : أخبرني عن الإِحسان فقال النبي صلى الله عليه وسلم «الإِحسان أن تعبد الله كأنك تراه فإن لم تكن تراه فإنه يراك» فمما ينضوي تحت معنى عبادة الله عبادةَ من يراه أن يستشعر العبدُ أن امتثال أمر ربه بالإِنفاق المأمور به منه كأنه معاملة بين مُقرض ومستقرض .وقد تقدم ذلك عند قوله تعالى : { من ذا الذي يُقرض الله قرضاً حسناً فيضاعفه له أضعافاً كثيرة } في سورة \\[ البقرة : 245 \\] .وقرأ الجمهور يضاعفه } بألف بعد الضاد وقرأ ابن كثير وابن عامر ويعقوب { يضعِّفه } بتشديد العين مضارع ضَعَّف ، وهما بمعنى واحد وهو لفظي الضعف .والمضاعفة : إعطاء الضِعف بكسر الضاد وهو مِثل الشيء في الذات أو الصفة . وتصدُق بمثل وبعدة أمثال كما قال تعالى : { أضعافاً كثيرة } \\[ البقرة : 245 \\] .وجعل الإِنفاق سبب للغفران كما قال النبي صلى الله عليه وسلم \" الصدقة تطفىء الخطايا كما يطفىء الماء النار \" .والشكور : فَعول بمعنى فاعل مبالغة ، أي كثير الشكر وأطلق الشكر فيه على الجزاء بالخير على فعل الصالحات تشبيهاً لفعل المتفضل بالجزاء بشكر المنعَم عليه على نعمة ولا نعمة على الله فيما يفعله عباده من الصالحات . فإنما نفعها لأنفسهم ولكن الله تفضّل بذلك حثاً على صلاحهم فرتب لهم الثواب بالنعيم على تزكية أنفسهم ، وتلطف لهم فسمى ذلك الثواب شكراً وجعل نفسه شاكراً .وقد أوما إلى هذا المقصد إتباع صفة { شكور } بصفة { حليم } تنبيهاً على أن ذلك من حِلمه بعباده دون حق لهم عليه سبحانه .\n\n",
      "translations": [
        {
          "translation": "(If ye lend unto Allah) by giving alms (a goodly loan) sincerely from your hearts and intending with it no one but Allah, (He will double it for you) He will accept it and multiply it from seven to 70 and up two millions folds, and up to whatever He wills (and will forgive you) through your alms, (for Allah is Responsive) in that He accepts your alms and multiplies it manifold; it is also said that this means: He is thankful: He accepts very little from His salves and rewards for it abundantly, (Clement) He does not hasten His punishment upon those who boast about their almsgiving and those who refuse to give alms,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { إِن تُقْرِضُواْ ٱللَّهَ } المنعم المتفضل أيها المنفقون المحسنون { قَرْضاً حَسَناً } مقروناً بالإخلاص والرضا\n ومصوناً عن وصمة المن والأذى { يُضَاعِفْهُ لَكُمْ } إحسانكم أضعافاً كثيرة { وَيَغْفِرْ لَكُمْ } ذنوبكم\n وإن عظُمت وكثرت { وَ } بالجملة: { ٱللَّهُ } المطلع على إخلاص عباده في أعمالهم ونياتهم فيها { شَكُورٌ } يحسن المحسن جزاء إحسانه أضعافاً مضاعفة\n ويزيد عليها تفضلاً وامتناناً { حَلِيمٌ } [التغابن: 17] لا يعاجل بعقوبة المسيء رجاء أن يعود ويتوب\n ويعتذر لما يصدر عنه من الذنوب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِن تُقرضوا اللهَ } بصرف أموالكم إلى المصارف التي عيّنها { قرضاً حسناً } مقروناً بالإخلاص { يُضاعِفْهُ لكم } بالواحدة عشراً إلى سبعمائة أو أكثر\n { ويغفرْ لكم } ببركة الإنفاق ما فرط منكم\n { واللهُ شكورٌ } يُعطي الجزيل في مقابلة القليل\n { حليمٌ } لا يُعاجِل بالعقوبة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "57:11",
      "similarity": 0.766841275447894
    },
    {
      "verse": "57:18",
      "similarity": 0.7606424493874638
    },
    {
      "verse": "2:245",
      "similarity": 0.5542458665625191
    },
    {
      "verse": "22:59",
      "similarity": 0.3180484585950319
    },
    {
      "verse": "73:20",
      "similarity": 0.3031875718547644
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/064017.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/064017.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/64:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}