{
  "chapter": "التغابن",
  "text": "الله لا اله الا هو وعلى الله فليتوكل المؤمنون",
  "translations": [
    {
      "translation": "Allah - there is no god but Him. So let the muminun put their trust in Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God: There is no god but He; and in God should believers place their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah there is no god but He; in Allah should the believers put all their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the only Lord and in Him the believers should trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah – there is none worthy of worship except Him; and only upon Allah must the Muslims rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! La ilaha illa Huwa. And in Allah therefore let the believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, there is no god but He; and upon Allah, then, let the believers rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God -- there is no god but He. And in God let the believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! There is no Allah save Him. In Allah, therefore, let believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God! There is no god but He, so let the faithful put their trust in Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! there is no God but He! In Allah, therefore, let the believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah—there is no god except Him—in Allah let all the faithful put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! There is no god but He: and on Allah, therefore, let the Believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah! La ilaha illa Huwa (none has the right to be worshipped but He), and in Allah (Alone), therefore, let the believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah, there is no god except He. In Allah let the believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God, there is no god but He; and in God let the believers put their trust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah - there is no deity except Him. And upon Allah let the believers rely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[64:13] God — there is no god except Him. And in God let [all] believers put their trust.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah! There is no God save Him) He has no son or partner. (In Allah, therefore, let believers put their trust) the believers should rely on Allah and not on anyone else.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف يتأتى منكم الإعراض أيها المعرضون المبطلون، مع أنه { ٱللَّهُ } الواحد الأحد، المستقل بالألوهية والربوبية { لاَ إِلَـٰهَ } أي: موجود في الوجود { إِلاَّ هُوَ } بتوحيده واستقلاله { وَعَلَى ٱللَّهِ } لا على غيره من الوسائل والأسباب العادية { فَلْيَتَوَكَّلِ ٱلْمُؤْمِنُونَ } [التغابن: 13] في عموم حوائجهم ومهماتهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { اللهُ لا إِله إلاّ هو } لا يستحق العبادة غيره، فـ \" الله \": مبتدأ، و \" لا إله إلا هو \": خبره، { وعلى الله } دون غيره { فليتوكل المؤمنون } ، حَثّ رسولَه صلى الله عليه وسلم على التوكُّل عليه حتى ينصره الله، وهي عامة لغيره، وإظهار الجلالة في موضع الإضمار للإشعار بعليّة التوكُّل والأمر به، فإنّ الألوهية مقتضية للتبتُل إليه تعالى بالكلية، وقطع التوكُّل عما سواه بالمرة\n الإشارة: ما من نَفَس تُبديه، إلاَّ وله قَدَر فيك يُمضيه\n ما أصاب من مصيبة قلبية أو نفسية، ظاهرة أو باطنة، إلاّ بإذن الله وقَدَرِه، وكذلك ما أصاب من مسرةٍ أو زيادة إلاّ بإذنه تعالى\n قال القشيري: أي: أيّ خصلة حَصَلَت فمن قِبَله، خَلْقاً، وبعلمه وإرادته حُكماً، ومَن يؤمن بالله يهدِ قلبه، حتى يهتدي إلى الله في السراء والضراء في الدنيا، وفي الآخرة يهديه إلى الجنة، وقيل: يهديه للأخلاق السنية، وقيل: لاتباع السنّة، واجتنابِ البدعة\n هـ\n وقال أبو بكر الورّاق: ومَن يؤمن بالله عند النعمة والرخاء فيعلم أنها من فضل الله يهدِ قلبه للشكر، ومَن يؤمن بالله عن الشدة والبلاء، فيعلم أنها من الله يَهْد قلبه للصبر والرضا\n هـ\n قال في الحاشية الفاسية: والظاهر والمتبادر: أنّ قوله: { ما أصاب\n\n\n } الآية جمعٌ على الله، ورَدٌّ من الأسباب، والوقوف معها، إلى الوقوف مع قضائه، وإنما يجد ذلك المؤمن بالله، وأمّا غيره فصَدْره ضَيق حرج عن قبول المعرفة، ولذلك قال: { ومَن يؤمن بالله يَهْد قلبه } لمعرفته والأطمئنان به، أي: ومَن لم يؤمن يَصْلى نار القطيعة والبُعد، وحرارة التدبير، ففيه ترغيب في الإيمان وتحذير من الكفر، وأنّ الإيمان تعقبه جنة الرضا والتسليم، عاجلاً، والكفر بضد ذلك، فبَعد أن ذكر الجزاء في الآخرة أشار إلى الجزاء المعجّل من اليقين والرضا للمؤمن، وضده للكافر\n\n\nوالله أعلم\n هـ\n وأطيعوا اللهَ في الفرائض والرسول في السنن، وقد بقي بعد الرسول خلفاؤه، يسنون السننَ الخاصة، فمَن أعرض عنهم، يقال له: { فإن توليتم\n\n\n } الآية، وتقدّم في آل عمران وغيرها الكلام على التوكُّل\n وبالله التوفيق\n ولمّا رغَّب في الرضا والإيمان، وأمر بالطاعة، حذّر مما يشغل عنهما، فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُوۤاْ إِنَّ مِنْ أَزْوَاجِكُمْ وَأَوْلاَدِكُمْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:79",
      "similarity": 0.7719146623120894
    },
    {
      "verse": "39:62",
      "similarity": 0.712558635092514
    },
    {
      "verse": "6:102",
      "similarity": 0.7092383902776798
    },
    {
      "verse": "26:217",
      "similarity": 0.6767476650850779
    },
    {
      "verse": "16:42",
      "similarity": 0.6583739344495488
    }
  ]
}