{
  "chapter": "التغابن",
  "text": "يسبح لله ما فى السموت وما فى الارض له الملك وله الحمد وهو على كل شىء قدير",
  "translations": [
    {
      "translation": "Everything in the heavens and everything on earth glorifies Allah. Sovereignty and praise belong to Him. He has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "ALL THAT THERE is in the heavens and the earth sings the praises of God. His the sovereignty and His is the praise, and He has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and all that is in the earth extols Allah's glory. His is the sovereignty and to Him is all praise due; He has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and the earth glorify God. To Him belongs the Kingdom and all praise. He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All whatever is in the heavens and all whatever is in the earth proclaims the Purity of Allah; His only is the kingship and His only is all praise; and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah. His is the dominion, and to Him belongs the praise, and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and whatever is in the earth declares the glory of Allah; to Him belongs the kingdom, and to Him is due (all) praise, and He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and the earth magnifies God. His is the Kingdom, and His is the praise, and He is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and all that is in the earth glorifieth Allah; unto Him belongeth Sovereignty and unto Him belongeth praise, and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in the heavens and on the earth extols the glory of God. To Him belongs the Kingdom and to Him all praise is due. He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever is in the heavens and whatsoever is in the earth halloweth Allah. His is the dominion; and His is the praise; and He is over everything potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever there is in the heavens and the earth glorifies Allah. To Him belongs all sovereignty and to Him belongs all praise, and He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and on earth, doth declare the Praises and Glory of Allah: to Him belongs dominion, and to Him belongs praise: and He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever is in the heavens and whatsoever is on the earth glorifies Allah. His is the dominion, and to Him belong all the praises and thanks, and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All that is in heavens and earth exalt Allah. His is the Kingdom, and His the Praise. He is powerful over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everything in the heavens and the earth praises God. To Him belongs the Kingdom, and to Him all praise is due, and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever is in the heavens and whatever is on the earth is exalting Allah. To Him belongs dominion, and to Him belongs [all] praise, and He is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[64:1] All that is in the heavens and all that is in the earth glorifies God, [everything] proclaims His transcendence (the lām [of li’Llāhi] is extra; mā is used instead of min in order to indicate the predominance [of nonrational beings]). To Him belongs the Kingdom and to Him belongs [all] praise, and He has power over all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said concerning the interpretation of Allah's saying (All that is in the heavens and all that is in the earth glorifieth Allah): '(All that is in the heavens) of creatures (and all that is in the earth) of creatures and living things (glorifieth Allah) pray to Allah; and it is also said this means: remember Allah; (unto Him belongeth sovereignty) perpetual sovereignty which never vanishes (and unto Him belongeth praise) thanks and gratitude are due to Him from the dwellers of the heavens and the earth; and it is also said this means: thanks and gratitude are due to Him from the people of the life of the world as well as from the people of the Hereafter, (and He is Able to do all things) relating 670 to the matters of the life of the world and the matters of the Hereafter, and to the adornment of the dwellers of the heavens and the dwellers of the earth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ فقالوا أبشر يهدوننا } لما حجبوا بصفات نفوسهم عن النور الذي هو به يفضل عليهم بما لا يقاس ولم يجدوا منه إلا البشرية أنكروا هدايته\n فإن كل عارف لا يعرف معروفه إلا بالمعنى الذي فيه فلا يوجد النور الكمالي إلا بالنور الفطري ولا يعرف الكمال إلا الكامل\n ولهذا قيل: لا يعرف الله غير الله\n وكل طالب وجد مطلوبه بوجه ما دالاً لما أمكن به التوجه نحوه\n وكذا كل مصدّق بشيء فإنه واجد للمعنى المصدّق به بما في نفسه من ذلك المعنى\n فلما لم يكن فيهم شيء من النور الفطري أصلاً لم يعرفوا منه الكمال فأنكروه ولم يعرفوا من الحق شيئاً فيحدث فيهم طلب فيحتاجوا إلى الهداية فأنكروا الهداية { فكفروا } مطلقاً أي: حجبوا عن الحق والدين والرسول وأعرضوا بالتوجه إلى ما وجدوا من المحسوسات عن المعقول { و } قد { استغنى الله } بكماله لأنه واجد كماله مشاهد لذاته عرفوا أو لم يعرفوا { والله غنيّ } بذاته عن إيمانهم لا يتوقف كمال من كمالاته عليهم ولا على معرفتهم له { حميد } كامل في نفسه بكمالاته الظاهرة في مظاهر ذرات الوجود خصوصاً على أوليائه وإن لم يظهر عليهم\n أي: إن لم يبصروه وإن لم يحمدوه بتلك الكمالات لاحتجابهم عنها فهو حميد من كل موجود بكماله المخصوص به",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يُسَبِّحُ لِلَّهِ } ويقدس ذاته عن مطلق النقائض على وجه الإطلاق بعدما لم يبلغ كنه أسمائه وصفاته حتى يعد\n ويحصى بتبيان مظاهر { مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلأَرْضِ } من ذرائر عموم الأكوان\n وكيف لا يقدِّسه جميع الأعيان\n إذ { لَهُ ٱلْمُلْكُ } على سبيل التخصيص\n لا مالك له سواه\n ولا مستولي عليه إلاَّ هو { وَ } كذا { لَهُ ٱلْحَمْدُ } على سبيل الحصر والاختصاص\n إذ لا مستحق للحمد بالاستحقاق إلاَّ هو\n ولا مفيض للنعم على الآفاق غيره\n ولا مقدر للأرزاق إلاَّ هو { وَ } بالجملة: { هُوَ } بذاته { عَلَىٰ كُلِّ شَيْءٍ } دخل في حيطة وجوده { قَدِيرٌ } [التغابن: 1] لا ينتهي قدرته بمقدور دون مقدور\n\n\nوكيف لا يكون سبحانه قديراً لعموم المقدورات\n مع أنه { هُوَ ٱلَّذِي خَلَقَكُمْ } وأظهركم\n وقدر خلقكم من كتم العدم على سبيل الإبداع بلا سبق مادة ومدو",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يُسبِّح لله ما في السماوات وما في الأرض } أي: يُنزّهه سبحانه جميعُ ما فيهما من المخلوقات عما لا يليق بجناب كبريائه\n قال القشيري: المخلوقات بجملتها مُسَبِّحةٌ لله\n ولكن لا يَسْمَعُ تسبيحَها مَن فيه طَرَشُ النكرة\n هـ\n { له الملكُ وله الحمدُ } لا لغيره إذ هو المبدىء لكلّ شيء\n وهو القائم به\n والمهيمن عليه\n وهو المُولي لأصول النِعم وفروعها\n وأمّا ملك غيره فاسترعاء من جنابه\n وحمد غيره اعتداد بأنّ نعمة الله جرت على يديه\n فتقديم الظرفين للاختصاص\n { وهو على كل شيءٍ قديرٌ } لأنّ نسبة ذاته المقتضية للقدرة إلى كل سواء\n { هو الذي خَلَقَكُم } خلقاً بديعاً\n حائزاً لجميع الكمالات العلمية والعملية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:120",
      "similarity": 0.6707207072628886
    },
    {
      "verse": "3:189",
      "similarity": 0.6494188865620923
    },
    {
      "verse": "15:98",
      "similarity": 0.561202918504014
    },
    {
      "verse": "45:36",
      "similarity": 0.5515967543440583
    },
    {
      "verse": "57:2",
      "similarity": 0.5498604061708462
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/64:1.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/64:1.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/64:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}