{
  "chapter": "التغابن",
  "text": "علم الغيب والشهدة العزيز الحكيم",
  "translations": [
    {
      "translation": "The Knower of the Unseen and the Visible, the Almighty, the All-Wise,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The knower of the unknown and the known, all-mighty and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows that which is beyond the ken of perception as well as that which can be perceived. He is the Most Mighty, the Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows the unseen and the seen. He is the Majestic and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The All Knowing of all things hidden and visible, the Most Honourable, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All-Knower of the unseen and seen, the Almighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Knower of the unseen and the seen, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knower He of the Unseen and the Visible, the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knower of the Invisible and the Visible, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is the Knower of the unseen and the seen: He is the Almighty, the Wise One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knower of the unseen and the seen, the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knower of the sensible and the Unseen, the All-mighty, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knower of what is open, Exalted in Might, Full of Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All-Knower of the unseen and seen, the All-Mighty, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Knower of the Unseen and the Visible, the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Knower of the Unseen and the Seen, the Almighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knower of the unseen and the witnessed, the Exalted in Might, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[64:18] Knower of the Unseen, the hidden, and the visible, the disclosed, the Mighty, in His kingdom, the Wise, in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Knower of the invisible) i.e. that which is in the hearts of those who give alms of the feelings of boasting and fear (and the visible) He is Aware of their alms, (the Mighty) in retribution against those who boast about their alms or refuse to give alms, (the Wise) in His command and decree; it is also said that this means: the Wise in accepting alms and multiplying the reward of almsgiving; and it is also said this means: the Wise in that He enjoined His Messenger (pbuh) and his nation to divorce in accordance with the prophetic practice'. And of the surah in which Divorce is mentioned, which is all Medinan and consists of 11 verses, 247 words and 1,170 letters: Surah 65: Divorce (al-Talaq) And of the surah in which Divorce is mentioned, which is all Medinan and consists of 1 1 verses, 247 words and 1,170 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا وهو { عَالِمُ ٱلْغَيْبِ وَٱلشَّهَادَةِ } يعلم بعلمه الحضوري منهم عموم ما في استعداداتهم وقابلياتهم من الإخلاص والإنفاق وغيرهما { ٱلْعَزِيزُ } الغالب القادر على وجوه الإنعام والانتقام { ٱلْحَكِيمُ } [التغابن: 18] المتقن في عموم الأفعال والجزاء المترتب على الأعمال؟!\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها الموحد المتحقق بمقام الفناء في الله، المستخلف منه سبحانه في عموم الأفعال والآثار، الصادر منك صورة أن تمتثل بمطلق الأوامر والنواهي الواردة عليك من عند ربك بمقتضى التكاليف المنبئة عن محض الحكمة المتقنة الإلهية، الجارية على وفق المصلحة المصلحة لأمور العباد في معاشهم ومعادهم، وتواظب على أداء الفرائض والواجبات الموجبة للعبودية بكمال التسليم والرضاء، وتلازم على الإتيان بالنوافل والمندوبات المقربة إلى الله، المستلزمة لمزيد الفضل والعطاء، فلك التبتل والإخلاص المقارن بالخضوع والخشوع، والتذلل التام، والانكسار المفرط في عموم ما جئت به من الطاعات والعبادات\n\n\nفاعلم أن الناقد بصير، وحبائل الشيطان في حواليك كثير، فلا تغفل عن غوائله، فإن إضلاله إياك سهل يسير، واتكل على الله في عموم أوقاتك، واستعذ به سبحانه من غوائله، فإنه سميع بصير\n\n\n\n\nربنا عليك توكلنا وإليك أنبنا، وإليك المصير\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:6",
      "similarity": 0.877740483564362
    },
    {
      "verse": "59:22",
      "similarity": 0.7212272253653402
    },
    {
      "verse": "13:9",
      "similarity": 0.6054808072007527
    },
    {
      "verse": "23:92",
      "similarity": 0.580456985855896
    },
    {
      "verse": "82:16",
      "similarity": 0.5596032427583045
    }
  ]
}