{
  "chapter": "التغابن",
  "text": "ان تقرضوا۟ الله قرضا حسنا يضعفه لكم ويغفر لكم والله شكور حليم",
  "translations": [
    {
      "translation": "If you lend a goodly loan to God, He will double it for you, and forgive you. God knows the worth of good deeds and is clement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you give Allah a goodly loan, He will increase it for you several fold and will forgive you. Allah is Most Appreciative, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you give a virtuous loan to God, He will pay back double and forgive your sins. God is the Most Appreciating and the Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you lend an excellent loan to Allah, He will double it for you and forgive you; and Allah is Most Appreciative, Most Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you lend to Allah a handsome loan, He will double it for you, and will forgive you. And Allah is Shakur, Halim,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you set apart for Allah a goodly portion, He will double it for you and forgive you; and Allah is the Multiplier (of rewards), Forbearing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you lend to God a good loan, He will multiply it for you, and will forgive you. God is All-thankful, All-clement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye lend unto Allah a goodly loan, He will double it for you and will forgive you, for Allah is Responsive, Clement,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "if you give a good loan to God, He will multiply it for you and forgive you, for God is appreciative and forbearing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye lend Unto Allah a goodly loan, He will multiply it Unto you and will forgive you; and Allah is Appreciator, Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you lend Allah a good loan, He shall multiply it for you and forgive you, and Allah is all-appreciative, all-forbearing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye loan to Allah, a beautiful loan, He will double it to your (credit), and He will grant you Forgiveness: for Allah is most Ready to appreciate (service), Most Forbearing,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you lend to Allah a goodly loan (i.e. spend in Allah's Cause) He will double it for you, and will forgive you. And Allah is Most Ready to appreciate and to reward, Most Forbearing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you lend a good loan to Allah He will multiply it for you and will forgive you. Allah is the Thankful, the Clement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you lend God a good loan, He will multiply it for you, and will forgive you. God is Appreciative and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you loan Allah a goodly loan, He will multiply it for you and forgive you. And Allah is Most Appreciative and Forbearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[64:17] If you lend God a good loan, by giving voluntary alms out of the goodness of [your] hearts, He will multiply it for you (yudā‘ifhu: a variant reading has yuda‘‘ifhu), from tenfold up to seven hundredfold or more for each one — this [loan] being the giving of voluntary alms out of the goodness of the heart — and He will forgive you, whatever He will, and God is Appreciative, rewarding of obedience, Forbearing, in refraining from [always] punishing disobedience;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If ye lend unto Allah) by giving alms (a goodly loan) sincerely from your hearts and intending with it no one but Allah, (He will double it for you) He will accept it and multiply it from seven to 70 and up two millions folds, and up to whatever He wills (and will forgive you) through your alms, (for Allah is Responsive) in that He accepts your alms and multiplies it manifold; it is also said that this means: He is thankful: He accepts very little from His salves and rewards for it abundantly, (Clement) He does not hasten His punishment upon those who boast about their almsgiving and those who refuse to give alms,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { إِن تُقْرِضُواْ ٱللَّهَ } المنعم المتفضل أيها المنفقون المحسنون { قَرْضاً حَسَناً } مقروناً بالإخلاص والرضا، ومصوناً عن وصمة المن والأذى { يُضَاعِفْهُ لَكُمْ } إحسانكم أضعافاً كثيرة { وَيَغْفِرْ لَكُمْ } ذنوبكم، وإن عظُمت وكثرت { وَ } بالجملة: { ٱللَّهُ } المطلع على إخلاص عباده في أعمالهم ونياتهم فيها { شَكُورٌ } يحسن المحسن جزاء إحسانه أضعافاً مضاعفة، ويزيد عليها تفضلاً وامتناناً { حَلِيمٌ } [التغابن: 17] لا يعاجل بعقوبة المسيء رجاء أن يعود ويتوب، ويعتذر لما يصدر عنه من الذنوب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِن تُقرضوا اللهَ } بصرف أموالكم إلى المصارف التي عيّنها { قرضاً حسناً } مقروناً بالإخلاص { يُضاعِفْهُ لكم } بالواحدة عشراً إلى سبعمائة أو أكثر، { ويغفرْ لكم } ببركة الإنفاق ما فرط منكم، { واللهُ شكورٌ } يُعطي الجزيل في مقابلة القليل، { حليمٌ } لا يُعاجِل بالعقوبة، { عالمُ الغيب والشهادة } لا تخفى عليه خافية، { العزيزُ الحكيمُ } مبالغ في القدرة والحكمة\n والله تعالى أعلم\n الإشارة: كل ما يشغلك عن السير إلى الحضرة، أو عن الترقِّي في معاريج الوصلة، فهو عدو لك، فاحذره، بالفرار من موافقته والوقوف معه، فكن إبراهيميًّا، حيث رمَى أهلَه وولَده في وادٍ غير ذي زرع، وتركهم في كنف الله وحِفْظِه، فانظر كيف حَفِظَهم غايةَ الحفظ، وتولاهم غاية التولي، وجعل أفئدة الناس تهوي إليهم من كل جانب، وانصبّت عليهم الأرزاق من كل ناحية، فهذه عادته تعالى مع أهل التوكُّل والانقطاع إليه\n ومِن الأزواج والأولاد مَن يزيد بالرجل ويُعينه على ربه، فهؤلاء ليسوا بأعداء\n قال سهل: مَن دعاك مِن أهلك وولدك للميل للدنيا فهو عدو، ومَن واخاك على القناعة والتوكُّل فليس بعدو\n هـ\n قال القشيري: إنَّ من أزواجكم: نفوسكم الأمَارة، وأولادكم: صفاتها ومُناها وأخلاقها الشهوانية، عدوًّا لكم، يمنعكم عن الهجرة إلى مدينة القلب، الذي هو بيت الرب، فاحذروا متابعتَهم بالكلية، وإن تعفوا عن هفواتكم الواقعة في بعض الأوقات، لكونهم مطية لكم، وتصفحوا عن التوبيخ، وتغفروا: تستروا ظلمتهم بنور إيمانكم وشعاع قلوبكم، فإنّ اللهَ غفور سائر لكم بستر لطفه، رحيم بإفاضة رحمته عليكم\n هـ\n ببعض المعنى\n إنما أموالكم وأولادكم فتنة اختبار من الحق، ليعلم مَن يقف معها، أو ينفذ عنها، فأهل العناية لم يشغلهم عن الله شيء، فحين توجّهوا إليه كفاهم أمْرَهم، أو: بالغيبة عنها بالخمرة القوية\n قال القشيري: أموالكم: أعمالكم المشوبة، وأولادكم: أخلاقكم المكدرة، فكدورة الطبع فتنة توجب افتتانكم بالإعراض عن الحق، والإقبال على الدنيا، وحب الجاه عند الناس، والتفاتهم إليكم بحسن الاعتقاد، والله عنده أجر عظيم بالفناء عن الكل والبقاء بالحق\n\n\nهـ\n { فاتقوا الله ما استطعتم } أي: غِيبوا عما سوى الله طاقة جهدكم، وتقدّم أنَّ قوله تعالى:\n\n[آل عمران:102] خطاب لأهل التجريد، وهذا خطاب لأهل الأسباب، والله تعالى أعلم\n وقال ابن عطاء: الاستطاعة على الظواهر والأعمال، وحق تقاته على القلوب والأحوال\n هـ\n أي: اتقوا الله حق تقاته بتوجيه القلوب إليه بلا التفات، واتقوا الله ما استطعتم بعمل الجوارح قدر الطاقات\n قال القشيري: ما أنتم في الجملة مستطيعين، ويتوجه إليكم التكليف، فاتقوا الله، والتقوى عن شهود التقوى، بعد ألاّ يكونَ تقصيرٌ في التقوى غايةُ التقوى\n هـ\n واسمعوا منا بلا واسطة، وأطيعوا فيما نأمركم به مما يُقرب إلينا، وننهاكم عنه مما يُبعد عنا\n قال القشيري: أطيعوا بالنفس لأحكام الشريعة، وبالقلب لآداب الطريقة، وبالروح بطلوع الحقيقة\n هـ\n وأنفِقوا من أموالكم وعلومكم وأسراركم، على الطالبين والسالكين والواصلين، يكن خيراً لأنفسكم، لأنّ الناس نفس واحدة، فإنفاقك على غيرك إنفاق على نفسك، لانتفاء الغيرية في الأحدية\n ومن يُوق شُحَّ نفسه بإنفاقها في مرضاة الله، بأن يُقدمها للمَتالف والمتاعب في طلب الوصول، فأولئك هم المفلحون الظافرون بشهود الحق\n قال القشيري: ومَن يُوق شُحَّ نفسه حتى يرتفع عن قلبه الأخطار، ويتحرَّر من رِقِّ المكونات، فأولئك هم المفلحون\n هـ\n وعن بعضهم: مَن أنفق بكُرهٍ فهو شح، ومَن أَنفق بطوعٍ فهو الفرض، ومَن عُوفي من بلاء الجمع والمنع، والرغبة والحرص، فقد دخل في ميدان الفلاح\n هـ\n إن تُقرضوا الله بإعطاء وجودكم قرضاً حسناً، من غير اعتبار الغرض والعوض، بالفناء عن شهود القَرْض والحس، يُضاعفه لكم بالوجود الحق، المشتمل على جميع الموجودات الإضافية، ويغفر لكم: يستر عنكم مساوئكم وحسّ وجودكم قبل فنائكم في الله وبقائكم به\n والله شكور يقبل مَن توجه إليه بلا شيء، حليم يُغيّب العبد عن شهود مساوئه، بإغراقه في إحسانه\n عالم الغيب: بواطن الأرواح، والشهادة: شهادة ظواهر الأشباح، العزيز: المعزّ لأوليائه ومكل مَن انتسب إليه، الحكيم في قسمه المراتب على حسب التوجُّه\n وبالله التوفيق، ولا حول ولا قوة إلاّ بالله\n وصلّى الله على سيدنا محمد وآله\n\n",
      "translations": []
    }
  ]
}