{
  "chapter": "التغابن",
  "text": "انما امولكم واولدكم فتنة والله عنده اجر عظيم",
  "translations": [
    {
      "translation": "Your wealth and children are a trial. But with Allah there is an immense reward.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wealth and children are surely meant as trial for you: But with God is the great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your possessions and your offspring are nothing but a trial for you. And there awaits a great reward for you with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your property and children are a trial for you, but the reward (which one may receive from God) is great.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wealth and your children are just a test; and with Allah is a tremendous reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wealth and your children are only a Fitnah, whereas Allah! With Him is a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your possessions and your children are only a trial, and Allah it is with Whom is a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wealth and your children are only a trial; and with God is a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wealth and your children are only a temptation, whereas Allah! with Him is an immense reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wealth and your children are only a trial; God's reward is great:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your riches and your children are but a temptation; and Allah! with Him is a mighty hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather, your possessions, and children are a test, and Allah—with Him is a great reward!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your riches and your children may be but a trial: but in the Presence of Allah, is the highest, Reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wealth and your children are only a trial, whereas Allah! With Him is a great reward (Paradise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wealth and children are but a trial, and with Allah is a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your possessions and your children are a test, but with God is a splendid reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your wealth and your children are but a trial, and Allah has with Him a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[64:15]   Your possessions and your children are only a trial, for you, distracting [you] from the concerns of the Hereafter, and God — with Him is a great reward, so do not forfeit it by preoccupying yourselves with possessions and children.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "672 (Your wealth and your children) who are in Mecca (are only a temptation) they are a calamity for you if they prevent you from migrating and taking part in jihad, (whereas Allah! with Him is an immense reward) for he who migrates and takes part in jihad in the way of Allah and is, further, not distracted by his wealth and children from migrating and taking part in jihad.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّمَآ أَمْوَالُكُمْ وَأَوْلاَدُكُمْ فِتْنَةٌ } معناه بَلوى\n\n\n\n\nوقوله تعالى: { وَٱللَّهُ عِنْدَهُ أَجْرٌ عَظِيمٌ } معناه ثَوابٌ جَزيلٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Your wealth and your children are only a trial,\" means that they are a source of tribulation.\n\n\nAnd the saying of Allah, \"Allah has a great reward with Him,\" means a great reward.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إنما أموالكم وأولادكم فتنة } ابتلاء وامتحان من الله إياكم { والله عنده أجر عظيم } لمن صبر في مقام الابتلاء وراعى حق الله فيه وتدارك ما قصر مما يجب لهم عليه فأساء الخلق وخالف أمر الله بما أمسك من المال وجمع ومنع حق الله فارتكب رذيلة البخل والعصيان\n وما أفرط في محبتهم ومراعاتهم فأضاع حق الله واحتجب بهم وكذا في مبحة المال فوضع في المقت والخسران وما أسرف فيه وأنفقه في المعاصي فكفر بنعمة الله\n وقعد عن القيام بشكرها\n وإن أصاب مالاً وولداً موافقاً شكر وما بطر من شدّة الفرح وما استغنى فطغى وإن فاته شيء من ذلك صبر وما جزع من شدّة الحزن فهلك وغوى",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { إِنَّمَآ أَمْوَالُكُمْ وَأَوْلاَدُكُمْ فِتْنَةٌ } عظيمة\n واختبار شديد لكم\n فعليكم ألاَّ تغتروا بهما فإنهما من شباك الشياطين وحبالهم\n يريدون أن يصدوكم عن سبيل الله بتزيينهما إليكم\n وتحبيبهما في قلوبكم\n لتشتغلوا بهما عن الله فتحطوا عن زمرة المخلصين { وَٱللَّهُ عِنْدَهُ أَجْرٌ عَظِيمٌ } [التغابن: 15] للمخلصين المجتنبين عن الالتفات إلى الغير مطلقاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنما أموالُكم وأولادُكم فتنةٌ } بلاءٌ ومحنةٌ\n يوقعون في الإثم والعقوبة\n أو: امتحان واختبار\n يختبر بهما عبادَه\n هل يصدونهم عن الخير أم لا\n فيعرف القويّ في دينه من الضعيف\n قال الحسن: أدخل \" مِن \" للتبعيض في الأزواج والأولاد لأنَّ كلهم ليسوا بأعداء\n ولم يذكر \" مِن \" في فتنة الأموال والأولاد لأنها لا تخلو من فتنة واشتغال قلب بها\n كان لابن مسعود بَنون كالبُدور\n فقيل له ـ وهم بين يديه: أيسرُّونك؟ فقال: لا\n إنما يسرُّني لو نفضت يدي من التراب عند دفنهم\n فنفوز بأجورهم\n قيل له: إنَّ لك الأجر في تربيتهم\n فقال: كل ما يشغل عن الله مشؤوم\n هـ\n من اللباب\n وعن ابن مسعود: لا يقل أحدكم: اللهم اعصمني من الفتنة إذ لا يخلو منها أحد\n ولكن ليقل: اللهم إنني أعوذ بك من مضلاَّت الفتن\n قال أبو بريدة:\n \" كان رسول الله صلى الله عليه وسلم يخطب يوم الجمعة\n فجاءه الحسن والحسين\n عليهما قميصان أحمران\n يجرانهما\n يعثران\n ويقومان\n فنزل رسولُ الله صلى الله عليه وسلم عن المنبر\n حتى أخذهما\n ثم قرأ: { إنما أموالكم وأولادكم فتنة }\n\n\nالآية\n ثم قال \" إني رأيت هذين فلم أصبر \" ثم أخذ في خطبته \"\n \n{ واللهُ عنده أجرٌ عظيم } لمَن آثر محبةَ الله وطاعتَه على محبة الأموال والأولاد\n والسعي في تدبير مصالحهم\n وليس في الآية ترهيب من مخالطة الأزواج والأولاد\n إنما المراد النهي عن الاشتغال بهم عن ذكر الله وطاعته\n فإذا تيسّر ذلك معهم فالمخالطة أولى\n فَعَن أنس رضي الله عنه: قلت: يا رسول الله الجلوس مع العيال أحب إليك أم في المسجد؟ قال:\n\n \" جلوس ساعة مع العيال أحب إليَّ من الاعتكاف في مسجدي هذا\n ودرهم تُنفقه على العيال أفضل من أن تنفقه في سبيل الله \" \nانظر السمرقندي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:28",
      "similarity": 0.9772481144950845
    },
    {
      "verse": "34:35",
      "similarity": 0.4979463503550876
    },
    {
      "verse": "19:77",
      "similarity": 0.45010755345100945
    },
    {
      "verse": "37:162",
      "similarity": 0.41129209925015053
    },
    {
      "verse": "68:6",
      "similarity": 0.39584124246186747
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/64:15.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/64:15.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/64:15.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}