{
  "chapter": "التغابن",
  "text": "الم ياتكم نبؤا۟ الذين كفروا۟ من قبل فذاقوا۟ وبال امرهم ولهم عذاب اليم",
  "translations": [
    {
      "translation": "Has the news not reached you of those who were kafir before and tasted the evil consequences of what they did? They will have a painful punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the account of those who disbelieved before come to you, who tasted the torment of their action, and for whom is grievous punishment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the news of the unbelievers of the past not reached you? (They disbelieved) and then tasted its evil consequence. A grievous chastisement awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not received the news about the disbelievers living before you who suffered the consequences of their deeds and will suffer a painful torment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Did not the news of those who disbelieved before you reach you? So they tasted the evil outcome of their deeds, and for them is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the news reached you of those who disbelieved aforetime And so they tasted the evil result of their disbelief, and theirs will be a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has there not come to you the story of those who disbelieved before, then tasted the evil result of their conduct, and they had a painful punishment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has there not come to you the tidings of those that disbelieved before, then tasted the mischief of their action, and there yet awaits them a painful chastisement?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath not the story reached you of those who disbelieved of old and so did taste the ill-effects of their conduct, and theirs will be a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not heard about those who denied the truth before you and tasted the evil consequences of their conduct? They will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hath not the tidings reached you of those who disbelieved aforetime, and so tasted the evil consequence of their affair, and theirs will be a torment afflictive?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has there not come to you the account of those who were faithless before? They tasted the evil consequence of their conduct, and there is a painful punishment for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the story reached you, of those who rejected Faith aforetime? So they tasted the evil result of their conduct; and they had a grievous Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not the news reached you of those who disbelieved aforetime? And so they tasted the evil result of their disbelief, and theirs will be a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you not heard the news of those before you who disbelieved? They tasted the mischief of their action, and for them is a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has the news not reached you, of those who disbelieved before? They tasted the ill consequences of their conduct, and a painful torment awaits them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has there not come to you the news of those who disbelieved before? So they tasted the bad consequence of their affair, and they will have a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[64:5] Has there not come to you, O disbelievers of Mecca, the tidings, the story, of those who disbelieved before and thus tasted the evil consequences of their conduct?, [they tasted] the punishment for disbelief in this world. And there will be for them, in the Hereafter, a painful chastisement?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَلَمْ يَأْتِكُمْ نَبَأُ الَّذِينَ كَفَرُوا مِنْ قَبْلُ فَذَاقُوا وَبَالَ أَمْرِهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ (5)انتقال من التعريض الرمزي بالوعيد الأخروي في قوله : { والله بما تعملون بصير } \\[ التغابن : 2 \\] ، إلى قوله : { وإليه المصير } \\[ التغابن : 3 \\] ، وقوله : { ويعلم ما تسرون وما تعلنون } \\[ التغابن : 4 \\] ، إلى تعريض أوضح منه بطريق الإِيماء إلى وعيد لعذاب دنيوي وأخروي معاً فإن ما يسمّى في باب الكناية بالإِيمان أقل لوازم من التعريض والرمز فهو أقرب إلى التصريح . وهذا الإِيماء بضرب المَثل بحال أمم تلقوا رسلهم بمثل ما تلقّى به المشركون محمداً صلى الله عليه وسلم تحذيراً لهم من أن يحلّ بهم مثل ما حلّ بأولئك ، فالجملة ابتدائية لأنها عَدٌّ لصنف ثاننٍ من أصناف كفرهم وهو إنكار الرسالة .فالخطاب لخصوص الفريق الكافر بقرينة قوله : { الذين كفروا من قبل } فهذا الخطاب موجه للمشركين الذين حالهم كحال من لم يبلغهم نبأ الذين كفروا مثلَ كفرهم ، مثلُ عاد وثمود ومَدين وقوم إبراهيم .والاستفهام تقريري ، والتقريري يؤتى معه بالجملة منفية توسعة على المقرر إن كان يريد الإِنكار حتى إذا أَقرّ لم يستطع بعد إقراره إنكاراً لأنه قد أعذر له من قبل بتلقينه النفي وقد تقدم غير مرة .وحُذف ما أضيف إليه { قبلُ } ونوي معناه ، والتقدير : من قبلِكم ، أي في الكفر بقرينة قوله : { فمنكم كافر } \\[ التغابن : 2 \\] . والكافرون يعلمون أنهم المقصود لأنهم مُقدمون على الكفر ومستمرون عليه .والوبال : السوء وما يكره .والأمر : الشأن والحال .والذَّوق مجاز في مطلق الإِحساس والوِجدان ، شبه ما حلّ بهم من العذاب بشيء ذي طعم كريه يذوقه من حلّ به ويبتلعه لأن الذوق باللسان أشد من اللمس باليد أو بالجلد .والمعنى : أحسوا العذاب في الدنيا إحساساً مكيناً .وقوله : { ولهم عذاب أليم } مراد به عذاب الآخرة لأن العطف يقتضي المغايرة .\n\n",
      "translations": [
        {
          "translation": "(Hath not the story) the event (reached you) people of Mecca (of those who disbelieved of old) of the nations who were before, how We dealt with them (and so did taste the ill effects of their conduct) and so did taste the punishment they deserved in the life of the world by being chastised and destroyed, (and theirs will be a painful doom) in the Hereafter.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه توبيخاً على من خرج عن ربقة عبوديته: { أَلَمْ يَأْتِكُمْ } أيها المكلفون المنكرون بظهور الحق وثوبته\n وتحققه في الأنفس والآفاق بالاستقلال والاستحقاق { نَبَأُ ٱلَّذِينَ كَفَرُواْ مِن قَبْلُ } كقوم نوح وهود وصالح - عليهم السلام - { فَذَاقُواْ وَبَالَ أَمْرِهِمْ } أي: كيف ذاقوا ضرر كفرهم وشركهم من العذاب النازل عليهم في النشأة الأولى بعدما أصرُّوا على ما هم عليه\n ولم يهتدوا بإرشاد الأنبياء والرسل { وَلَهُمْ } في النشأة الأخرى { عَذَابٌ أَلِيمٌ } [التغابن: 5] لا عذاب أشد من ذلك\n وهو حرمانهم عن ساحة عز القبول الإلهي",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: لكفار مكة { ألم يأتكم نبأُ الذين كفروا من قبلُ }؟ كقوم نوح\n ومَن بعدهم من الأمم المُصرَّة على الكفر\n { فذاقوا وبالَ أمرهم } أي: شؤم كفرهم في الدنيا من الهلاك والاستئصال\n والوبالُ: الثقل والشدة\n وأمرهم: كفرهم\n عبّر عنه بالأمر إيذاناً بأنه أمر هائلٌ\n وجناية عظيمة\n و \" ذاقوا \" عطف على \" كفروا \" أي: ألم يأتكم خبر الذين كفروا فذاقوا من غير مهلة ما يسْتتبعُهُ كفرهم في الدنيا؟ { ولهم عذابٌ أليم } لا يُقادَر قدره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "59:15",
      "similarity": 0.9075132260647223
    },
    {
      "verse": "65:9",
      "similarity": 0.8269837715273867
    },
    {
      "verse": "73:16",
      "similarity": 0.7197108640439946
    },
    {
      "verse": "37:38",
      "similarity": 0.28290994137924474
    },
    {
      "verse": "5:95",
      "similarity": 0.22789871179488388
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/064005.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/064005.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/64:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}