{
  "chapter": "التغابن",
  "text": "ذلك بانه كانت تاتيهم رسلهم بالبينت فقالوا۟ ابشر يهدوننا فكفروا۟ وتولوا۟ واستغنى الله والله غنى حميد",
  "translations": [
    {
      "translation": "That is because their Messengers brought them the Clear Signs but they said, 'Are human beings going to guide us?' So they were kafir and turned away. But Allah is completely independent of them. Allah is Rich Beyond Need, Praiseworthy.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This was so because their apostles came to them with clear proofs, but they said: \"What. Can a mortal show us the way?\" And they denied and turned away; but God was unconcerned. God is all-sufficient, worthy of praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This was because their Messengers would come to them with Clear Signs, but they would say: “Shall mortals (like ourselves) guide us to the Right Way?” They rejected the Truth and turned away. Thereupon Allah became unconcerned with them, for Allah is Self-Sufficient, Innately Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This was because their messengers came to them with clear proof (to support their prophethood) and they said, \"Can mere mortals provide us with guidance?\" They rejected the Messengers and turned away. God does not need the worship of anyone. He is Self-sufficient and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because their Noble Messengers used to bring clear proofs to them, in response they said, “What! Will humans show us the way?”; they therefore became disbelievers and turned away, and Allah acted independently; and Allah is the Independent, the Most Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was because there came to them their Messengers with Bayyinat, but they said: \"Shall mere men guide us\" So they disbelieved and turned away. But Allah was not in need. And Allah is not in need, Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because there came to them their apostles with clear arguments, but they said: Shall mortals guide us? So they disbelieved and turned back, and Allah does not stand in need (of anything), and Allah is Self-sufficient, Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because their Messengers came to them with the clear signs, and then they said, 'What, shall mortals be our guides?' Therefore they disbelieved, and turned away; and God was in no need of them. And God is All-sufficient, All-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was because their messengers (from Allah) kept coming unto them with clear proofs (of Allah's Sovereignty), but they said: Shall mere mortals guide us? So they disbelieved and turned away, and Allah was independent (of them). Allah is Absolute, Owner of Praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was because their messengers came to them with clear signs, but they replied, \"Shall mortals be our guides?\" And so they rejected the truth and turned away. God has no need of such people; God is self-sufficient and worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was because their apostles were wont to come Unto them with evidences, but they said: shall a mere human bein guide us? Wherefore they disbelieved and turned away; and Allah needed them not. And Allah is Self Sufficient, Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was because their apostles would bring them manifest proofs, but they said, ‘Will humans be our guides?!’ So they disbelieved and turned away, and Allah had no need [of their faith] and Allah is all-sufficient, all-laudable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was because there came to them messengers with Clear Signs, but they said: \"Shall (mere) human beings direct us?\" So they rejected (the Message) and turned away. But Allah can do without (them): and Allah is free of all needs, worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was because there came to them their Messengers with clear proofs (signs), but they said: \"Shall mere men guide us?\" So they disbelieved and turned away (from the truth), and Allah was not in need (of them). And Allah is Rich (Free of all wants), Worthy of all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because, when their Messengers came to them with clear proofs they said: 'Shall humans be our guides' They disbelieved and turned away, but Allah was not in need (of them). Allah is the Rich and the Praised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because their messengers came to them with clear explanations, but they said, “Are human beings going to guide us?” So they disbelieved and turned away. But God is in no need. God is Independent and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because their messengers used to come to them with clear evidences, but they said, \"Shall human beings guide us?\" and disbelieved and turned away. And Allah dispensed [with them]; and Allah is Free of need and Praiseworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[64:6]   That, chastisement in this world, is because (bi-annahu contains the pronoun of the matter) their messengers used to bring them clear signs, manifest proofs for [the validity of] faith, but they said, ‘Shall [mere] humans (basharan is meant as generic) be our guides?’ So they disbelieved and turned away, from faith, and God was independent, [without need] of their faith. And God is Independent, [without need] of His creatures, Praised, praiseworthy in His actions.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That) torment (was because their messengers (from Allah) kept coming unto them with clear proofs (of Allah's Sovereignty)) detailing commands, prohibitions and signs, (but they said: Shall mere mortals) human beings like us (guide us) call us to believe in Allah's divine Oneness? (So they disbelieved) in the Scriptures, messengers and signs (and turned away) from accepting faith in the Scriptures, messengers and signs, (and Allah was independent (of them)) of their faith. (Allah is Absolute) Allah is free of need for their faith, (Owner of Praise) He is praiseworthy in His acts; it is also said that this means: He is the Owner of Praise as far as those who believe in His divine Oneness are concerned.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَلِكَ } الويل والوبال عليهم في النشأة الأولى والأخرى { بِأَنَّهُ } أي: بسبب أن النشأة الأولى والأمر فيما بينهم هكذا { كَانَت تَّأْتِيهِمْ رُسُلُهُم } من عند الله مؤيَّدين { بِٱلْبَيِّنَاتِ } الواضحات، والمعجزات الباهرات { فَقَالُوۤاْ } بعدما عجزوا عن معارضة معجزاتهم الساطعة، وحججهم القاطعة على سبيل التعدب والإنكار: { أَبَشَرٌ } مثلنا { يَهْدُونَنَا }؟! كلا وحاشا أن يكون البشر هادين للبشر، وبالجملة: { فَكَفَرُواْ } بالرسل والمرسِل، والمرسَل به جميعاً { وَتَوَلَّواْ } عن التدبر والتفكر في الحجج والبينات { وَّٱسْتَغْنَىٰ ٱللَّهُ } عن كل شيء فضلاً عن هدايتهم وطاعتهم { وَٱللَّهُ } المتعزز برداء العظمة والكبرياء { غَنِيٌّ } في ذاته طلق مظاهره ومصنوعاتهخ، فكيف عن إيمانهم وعبادتهم؟! { حَمِيدٌ } [التغابن: 6] حسب أوصافه وأسمائه، مستغن عن حمد الحامدين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:64",
      "similarity": 0.6052449094385542
    },
    {
      "verse": "31:26",
      "similarity": 0.6052449094385542
    },
    {
      "verse": "14:8",
      "similarity": 0.5788602394112764
    },
    {
      "verse": "37:182",
      "similarity": 0.4017731275403429
    },
    {
      "verse": "1:2",
      "similarity": 0.39745133498343693
    }
  ]
}