{
  "chapter": "التغابن",
  "text": "يوم يجمعكم ليوم الجمع ذلك يوم التغابن ومن يؤمنۢ بالله ويعمل صلحا يكفر عنه سيـاته ويدخله جنت تجرى من تحتها الانهر خلدين فيها ابدا ذلك الفوز العظيم",
  "translations": [
    {
      "translation": "On the Day He gathers you for the Day of Gathering - that is the Day of Profit and Loss. As for those who have iman in Allah and act rightly, We will erase their bad actions from them and admit them into Gardens with rivers flowing under them, remaining in them timelessly, for ever and ever. That is the Great Victory!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day He will gather you together on the Day of Gathering, will be the day of Judgement. He who believed and did the right, will have his evil deeds expunged by God and admitted to gardens with rivers flowing by, and abide there perpetually. This will be the great achievement of success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(You shall come to know that) when He will assemble you on the Day of Gathering. That shall be the Day (to determine) mutual gains and losses. Whoever believes in Allah and acts righteously, Allah will have his evil deeds expunged and will admit him to Gardens beneath which rivers flow. Therein they shall abide forever. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when We shall gather you all together (for the Day of Judgment), all cheating will be exposed. Those who believe in God and act righteously will receive forgiveness for their sins. They will be admitted into Paradise wherein streams flow and they will live forever. This certainly is the greatest triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when He will gather you, on the Day of Collective Assembly – that is the day when the loss of the losers will be laid bare; and whoever believes in Allah and does good deeds, Allah will relieve him of his sins and admit him into Gardens beneath which rivers flow, for them to abide in it forever; this is the greatest success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when He will gather you on the Day of Gathering, that will be the Day of At-Taghabun. And whosoever believes in Allah and performs righteous deeds, He will expiate from him his sins, and will admit him to Gardens beneath which rivers flow, to dwell therein forever; that will be the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day that He will gather you for the day of gathering, that is the day of loss and gain; and whoever believes in Allah and does good, He will remove from him his evil and cause him to enter gardens beneath which rivers flow, to abide therein forever; that is the great achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day when He shall gather you for the Day of Gathering; that shall be the Day of Mutual Fraud. And whosoever believes in God, and does righteousness, God will acquit him of his evil deeds, and admit him into gardens underneath which rivers flow, therein to dwell for ever and ever; that is the mighty triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when He shall gather you unto the Day of Assembling, that will be a day of mutual disillusion. And whoso believeth in Allah and doeth right, He will remit from him his evil deeds and will bring him unto Gardens underneath which rivers flow, therein to abide for ever. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When He shall gather you all for the Day of Gathering, that will be the Day of loss and gain; and whoever believes in God and does good deeds shall be forgiven their sins and admitted to Gardens through which rivers flow, where they shall dwell forever. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember the Day whereon He shall assemble you, the Day of Assembly; that shall be the Day of Mutual Loss and Gain. And whosoever believeth in Allah and worketh righteously from him He will expiate His misdeeds and will make him enter Gardens whereunder rivers flow, as abiders therein for evermore. That is the mighty achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When He will you bring you together for the Day of Gathering, it will be a day of privation [and regret]. As for those who have faith in Allah and act righteously, He shall absolve them of their misdeeds and admit them into gardens with streams running in them, to remain in them forever. That is the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day that He assembles you (all) for a Day of Assembly,- that will be a Day of mutual loss and gain (among you), and those who believe in Allah and work righteousness,- He will remove from them their ills, and He will admit them to Gardens beneath which Rivers flow, to dwell therein for ever: that will be the Supreme Achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remember) the Day when He will gather you (all) on the Day of Gathering, that will be the Day of mutual loss and gain (i.e. loss for the disbelievers as they will enter the Hell-fire and gain for the believers as they will enter Paradise). And whosoever believes in Allah and performs righteous good deeds, He will remit from him his sins, and will admit him to Gardens under which rivers flow (Paradise) to dwell therein forever, that will be the great success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day on which He will gather you for the Day of Gathering; that is the Day of Loss and Gain. He who believes in Allah and does good deeds, Allah willacquit him of his evil deeds and admit him to Gardens underneath which rivers flow, where he shall live for ever. That is the mighty triumph.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when He gathers you for the Day of Gathering—that is the Day of Mutual Exchange. Whoever believes in God and acts with integrity, He will remit his misdeeds, and will admit him into gardens beneath which rivers flow, to dwell therein forever. That is the supreme achievement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day He will assemble you for the Day of Assembly - that is the Day of Deprivation. And whoever believes in Allah and does righteousness - He will remove from him his misdeeds and admit him to gardens beneath which rivers flow, wherein they will abide forever. That is the great attainment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[64:9] Mention, the day when He will gather you for the Day of Gathering, the Day of Resurrection, that will be the Day of Dispossession, [on which] the believers will dupe the disbelievers by occupying [what would have been] their places in Paradise, had they believed, as well as [appropriating] their [believing] spouses. And [as for] those who believe in God and act righteously, He will absolve them of their misdeeds and admit them into gardens underneath which rivers flow (a variant reading for both verbs has the first person plural) wherein they will abide. That is the supreme triumph.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَوْمَ يَجْمَعُكُمْ لِيَوْمِ الْجَمْعِ ذَلِكَ يَوْمُ التَّغَابُنِ وَمَنْ يُؤْمِنْ بِاللَّهِ وَيَعْمَلْ صَالِحًا يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ وَيُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ذَلِكَ الْفَوْزُ الْعَظِيمُ (9) { يَوْمَ يَجْمَعُكُمْ } .متعلقٌ بفعل { لتنبؤن بما عملتم } \\[ التغابن : 7 \\] الذي هو كناية عن «تُجَازوْنَ» على تكذيبكم بالبعث فيكون من تمام ما أُمر النبي صلى الله عليه وسلم بأن يقوله لهم ابتداء من قوله تعالى : { قل بلى وربي لتبعثن } \\[ التغابن : 7 \\] .والضمير المستتر في { يجمعكم } عائد إلى اسم الجلالة في قوله : { والله بما تعملون خبير } \\[ التغابن : 8 \\] .ومعنى { يجمعكم } يجمع المخاطبين والأمم من الناس كلهم ، قال تعالى : { هذا يوم الفصل جمعناكم والأولين } \\[ المرسلات : 38 \\] .ويجوز أن يراد الجمع الذي في قوله تعالى : { أيحسب الإِنسان أن لن نجمع عظامه } \\[ القيامة : 3 \\] ، وهذا زيادة تحقيق للبعث الذي أنكروه .واللام في { ليوم الجمع } يجوز أن يكون للتعليل ، أي يجمعكم لأجل اليوم المعروف بالجمع المخصوص . وهو الذي لأجل جمع الناس ، أي يبعثكم لأجل أن يجمع الناس كلهم للحساب ، فمعنى { الجمع } هذا غيرُ معنى الذي في { يجمعكم } . فليس هذا من تعليل الشيء بنفسه بل هو من قبيل التجنيس .ويجوز أن يكون اللام بمعنى ( في ) على نحو ما قيل في قوله تعالى : { لا يجليها لوقتها إلا هو } \\[ الأعراف : 187 \\] ، وقوله : { يا ليتني قدمت لحياتي } \\[ الفجر : 24 \\] وقول العرب : مضى لسبيله ، أي في طريقه وهو طريق الموت .والأحسن عندي أن يكون اللام للتوقيت ، وهي التي بمعنى ( عند ) كالتي في قولهم : كُتب لكَذا مَضِينَ مثلاً ، وقوله تعالى : { أقم الصلاة لدلوك الشمس } \\[ الإسراء : 78 \\] . وهو استعمال يدل على شدة الاقتراب ولذلك فسروه بمعنى ( عند ) ، ويفيد هنا : أنهم مجموعون في الأجل المعين دون تأخير ردّاً على قولهم : { لن يبعثوا } \\[ التغابن : 7 \\] ، فيتعلق قوله : { ليوم الجمع } بفعل { يجمعكم } .ف«يوم الجمع» هو يوم الحشر . وفي الحديث \" يجمع الله الأولين والآخرين \" الخ . جعل هذا المركب الإِضافي لقباً ليوم الحشر ، قال تعالى : { وتنذر يوم الجمع لا ريب فيه فريق في الجنة وفريق في السعير } \\[ الشورى : 7 \\] .وقرأ الجمهور { يجمعكم } بياء الغائب . وقرأه يعقوب بنون العظمة .{ الجمع ذَلِكَ يَوْمُ } .اعتراض بين جملة { ثم لتنبؤن بما عملتم } \\[ التغابن : 7 \\] بمتعلقها وبين جملة { ومن يؤمن بالله ويعمل صالحاً نكفر عنه سيئاته } اعتراضاً يفيد تهويل هذا اليوم تعريضاً بوعيد المشركين بالخسارة في ذلك اليوم : أي بسوء المنقلب .والإِتيان باسم الإِشارة في مقام الضمير لقصد الاهتمام بهذا اليوم بتمييزه أكمل تمييز مع ما يفيده اسم إشارة البعيد من علوّ المرتبة على نحو ما تقدم في قوله : { ذلك الكتاب } في سورة \\[ البقرة : 2 \\] .والتغابن } : مصدر غابَنه من باب المفاعلة الدالة على حصول الفعل من جانبين أو أكثر .وحقيقة صيغة المفاعلة أن تدل على حصول الفعل الواحد من فاعلين فأكثر على وجه المشاركة في ذلك الفعل .والغبن أن يعطى البائع ثمَناً لمبيعه دون حَقِّ قيمته التي يعوَّض بها مثلُه .فالغبن يؤول إلى خسارة البائع في بيعه ، فلذلك يطلق الغبن على مطلق الخسران مجازاً مرسلاً كما في قول الأعشى: ... لا يقبَلُ الرَشْوَة في حُكمهولا يبالي غَبن الخَاسر ... فليست مادة التغابن في قوله : { يوم التغابن } مستعملة في حقيقتها إذ لا تعارض حتى يكون فيه غبن بل هو مستعمل في معنى الخسران على وجه المجاز المرسل .وأما صيغة التفاعل فحملها جمهور المفسرين على حقيقتها من حصول الفعل من جانبين ففسروها بأن أهل الجنة غبنوا أهل النار إذ أهل الجنة أخذوا الجنة وأهل جهنم أخذوا جهنم قاله مجاهد وقتادة والحسن . فحمل القرطبي وغيره كلام هؤلاء الأيمة على أن التغابن تمثيل لحال الفريقين بحال مُتَبايَعَيْن أخذ أحدهما الثمن الوافيَ ، وأخذ الآخر الثمنَ المغبون ، يعني وقوله عقبه { ومن يؤمن بالله ويعمل صالحاً نكفر عنه سيئاته } ، إلى قوله : { وبئس المصير } قرينة على المراد من الجانبين وعلى كلا المعنيين يكون قوله : { ومن يؤمن بالله ويعمل صالحاً } إلى قوله : { وبئس المصير } تفصيلاً للفريقين ، فيكون في الآية مجاز وتشبيه وتمثيل ، فالمجاز في مادة الغبن ، والتمثيل في صيغة التغابن ، وهو تشبيه مركب بمنزلة التشبيه البليغ إذ التقدير : ذلك يوم مِثْل التغَابن .وحمل قليل من المفسرين ( وهو ما فسر إليه كلام الراغب في مفرداته ) وصرح ابن عطية صيغَة التفاعل على معنى الكثرة وشدة الفعل ( كما في قولنا : عافاك الله وتبارك الله ) فتكون استعارة ، أي خسارة للكافرين إذ هم مناط الإِنذار . وهذا في معنى قوله تعالى : { أولئك الذين اشتروا الضلالة بالهدى فما ربحت تجارتهم } في سورة \\[ البقرة : 16 \\] ، وقوله : { يأيها الذين آمنوا هل أدلكم على تجارة تنجيكم من عذاب أليم } الآية في سورة \\[ الصف : 10 \\] .فصيغة التفاعل مستعملة مجازاً في كثرة حصول الغبن تشبيهاً للكثرة بفعل من يحصل من متعدد .والكلام تهديد للمشركين بسوء حالتهم في يوم الجمع ، إذ المعنى : ذلك يوم غبنكم الكثير الشديد بقرينة قوله قبله { فآمنوا بالله ورسوله والنور الذي أنزلنا } \\[ التغابن : 8 \\] . والغابن لهم هو الله تعالى .ولولا قصد ذلك لما اقتصر على أن ذلك يوم تغابن فإن فيه ربحاً عظيماً للمؤمنين بالله ورسوله والقرآن ، فوزان هذا القصر وزان قوله : { فما ربحت تجارتهم } \\[ البقرة : 16 \\] وقول النبي صلى الله عليه وسلم « إنما المُفلس الذي يفلس يوم القيامة »وأفاد تعريف جزأي جملة { ذلك يوم التغابن } قصرَ المسند على المسند إليه أي قصر جنس يوم التغابن على يوم الجمعة المشار إليه باسم الإِشارة ، وهو من قبيل قصر الصفة على الموصوف قصراً ادعائياً ، أي ذلك يوم الغبن لا أيام أسواقكم ولا غيرُها ، فإن عدم أهمية غبن الناس في الدنيا جعل غبن الدنيا كالعدم وجعل يوم القيامة منحصراً فيه جنس الغبن .وأما لام التعريف في قوله : { التغابن } فهي لام الجنس ، ومن هذا المعنى قوله تعالى : { قل إن الخاسرين الذين خسروا أنفسهم وأهليهم يوم القيامة }\\[ الزمر : 15 \\] . وقوله في ضده { يرجون تجارة لن تبور } \\[ فاطر : 29 \\] . هذا هو المتعين في تفسير هذه الآية وأكثر المفسرين مرّ بها مَرّاً . ولم يحتلب منها دَرّاً . وها أنا ذَا كددت ثمادي ، فعَسَى أن يقع للناظر كوقْع القراححِ من الصادي ، والله الهادي .{ } لله .معطوفة على جملة { فآمنوا بالله ورسوله خَبِيرٌ \\* يَوْمَ يَجْمَعُكُمْ لِيَوْمِ الجمع ذَلِكَ يَوْمُ التغابن وَمَن يُؤْمِن بالله وَيَعْمَلْ صالحا يُكَفِّرْ عَنْهُ سيئاته وَيُدْخِلْهُ جنات تَجْرِى مِن تَحْتِهَا الانهار خالدين فِيهَآ أَبَداً ذَلِكَ الفوز العظيم \\*\n\n",
      "translations": [
        {
          "translation": "(The day) which is the day of Judgement (when He shall gather you unto the Day of Assembling) when the earlier and later generations will be assembled, (that will be a day of mutual disillusion) the disbeliever will be duped regarding his own person, family, servants and properties in Paradise and the believer will inherit him; it is also said that this means: the believer will dupe the disbeliever regarding his family and properties, and the disbeliever will be duped about his own person in the Garden and the believer will inherit him, and the wronged will dupe the one who wronged him by taking his good deeds and giving him his own evil deeds. (And whoso believeth in Allah) and in Muhammad (pbuh) and in the Qur'an (and does right) sincerely between himself and his Lord, (He will remit from him his evil deeds) He will forgive his sins because of his belief in Allah's divine Oneness (and will bring him into Gardens beneath which) beneath its trees and habitations (rivers flow) rivers of wine, water, honey and milk flow, (therein to abide for ever) dwelling in Paradise never to die or leave it. (That is the Supreme Triumph) that is the supreme gain: they gained the Garden and are saved from the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ذلك يوم التغابن } أي: ليس التغابن في الأمور الدنيوية فإنها أمور فانية سريعة الزوال\n ضرورية الفناء\n لا يبقى شيء منها لأحد\n فإن فات شيء من ذلك أو أفاته أحد ولو كان حياته فإنما فات أو أفيت ما لزم فوته ضرورة فلا غبن ولا حيف حقيقة وإنما الغبن والتغابن في إفاتة شيء لو لم يفته لبقي دائماً وانتفع به صاحبه سرمداً وهو النور الكمالي والاستعدادي فتظهر الحسرة والتغابن هناك في إضاعة الربح ورأس المال في تجارة الفوز والنجاة كما قال:\n[البقرة\n الآية:16] فمن أضاع استعداده ونور فطرته كان مغبوناً مطلقاً كمن أخذ نوره وبقي في الظلمة\n ومن بقي نور فطرته ولم يكتسب الكمال اللائق به الذي يقتضيه استعداده أو اكتسب منه شيئاً ولم يبلغ غايته كان مغبوناً بانسبة إلى الكامل التام فكأنما ظفر ذلك الكامل بمقامه ومرامه وبقي هذا متحيراً في نقصانه { ومن يؤمن بالله } بحسب نور استعداده { ويعمل صالحاً } بمقتضى إيمانه فإن العمل إنما يكون بقدر النظر { يكفر عنه سيئاته } التي اتقى الله فيها بعمله { ويدخله جنات } على حسب درجات أعماله\n فإن آمن تقليداً واجتنب المعاصي وعمل بالطاعات يكفر عنه سيئات ذنوبه ويدخله جنات النفس على حسب درجات عمله وتقواه\n وإن آمن تحقيقاً واجتنب صفاته وعمل بالسلوك في صفات الله ومرضاته يكفر عنه سيئات صفات نفسه ويدخله جنات القلب على قدر مراتبه في الأعمال والمقامات\n وإن آمن إيماناً عينياً وعمل بالمشاهدة واتقى الله في وجوده يدخل جنات الروح بتكفير سيئات وجود قلبه وصفاته\n وإن آمن إيماناً حقيقياً واتقى في آنيته ورؤية فنائه يكفر عنه سيئات بقيته وتلوينه بظهور أنائيته ويدخله جنات الذات",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكروا أيها المكلفون { يَوْمَ يَجْمَعُكُمْ } الله { لِيَوْمِ ٱلْجَمْعِ } والحشر\n لأجل الحساب والجزاء\n إذ يجتمع فيه الملائكة والثقلان { ذَلِكَ } اليوم { يَوْمُ ٱلتَّغَابُنِ } أي: يوم ظهور التغابن والغرور الواقع في نشأة الاختبار الابتلاء { وَ } بالجملة: { مَن يُؤْمِن بِٱللَّهِ } ويقر بوحدانيته سبحانه { وَيَعْمَلْ } عملاً { صَالِحاً } ليزيد به الإيمان\n حتى يصير علمه عياناً\n وعيانه حقاً وبياناً { يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ } ويمحوها عن صحيفة أعماله { وَيُدْخِلْهُ } بمقتضى فضله ولطفه { جَنَّاتٍ } منتزهات العلم والعين والحق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } المملوءة بمياه المعارف والحقائق المترشحة عن بحر الحياة الأزلي الأبدي\n لا يتحولون من التلذذ بها والتحقق دونها\n بل يصيرون { خَالِدِينَ فِيهَآ أَبَداً ذَلِكَ } التفكير والإدخال لأرباب العناية والإفضال { ٱلْفَوْزُ ٱلْعَظِيمُ } [التغابن: 9] واللطف الجسيم\n وبالجملة: لا فوز أعظم منه وأكمل",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n واذكر { يومَ يجمعكم } أو: لَتنبؤنَّ\n أو خبير { يوم يجمعكم ليوم الجمع } وهو يوم يُجمع فيه الأولون والآخرون للحساب والجزاء\n { ذلك يوم التغَابُنِ } \n مستعار من: تغابن القومُ في التجارة\n وهو أن يُغبن بعضُهم بعضاً\n لنزول السعداء منازلَ الأشقياء التي كانوا ينزلونها لو كانوا سعداء\n ونزول الأشقياء منازل السعداء لو كانوا أشقياء\n كما ورد في الحديث\n وقد يتغابن الناسُ في ذلك اليوم بتفاوت الدرجات\n وذلك هو التغابن الحقيقي\n لا التغابن في أمور الدنيا\n { ومَن يؤمن بالله ويعمل صالحاً يُكَفِّرْ } بنون العظمة لنافع والشامي\n وبياء الغيبة\n أي: يُكَفِّر الله { عنه سيئاتِه ويُدْخِلْه جنات } أو: يُدخله الله { جناتٍ تجري من تحتها الأنهار خالدين فيها أبداً ذلك } أي: ما ذكر من تكفير السيئات وإدخال الجنات { الفوزُ العظيم } الذي لا فوز وراءه لانطوائه على النجاة من أعظم الهلكات\n والظفر بأجل الطلبات",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:119",
      "similarity": 0.21803664469382797
    },
    {
      "verse": "9:100",
      "similarity": 0.2034361207485856
    },
    {
      "verse": "48:5",
      "similarity": 0.19925996962623396
    },
    {
      "verse": "4:122",
      "similarity": 0.17885196977801535
    },
    {
      "verse": "65:11",
      "similarity": 0.17606743983651948
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/064009.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/064009.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/64:9.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}