{
  "chapter": "الطلاق",
  "text": "رسولا يتلوا۟ عليكم ءايت الله مبينت ليخرج الذين ءامنوا۟ وعملوا۟ الصلحت من الظلمت الى النور ومن يؤمنۢ بالله ويعمل صلحا يدخله جنت تجرى من تحتها الانهر خلدين فيها ابدا قد احسن الله له رزقا",
  "translations": [
    {
      "translation": "a Messenger reciting Allah's Clear Signs to you to bring those who have iman and do right actions out of the darkness into the Light. Whoever has iman in Allah and acts rightly, We will admit him into Gardens with rivers flowing under them remaining in them timelessly, for ever and ever. Allah has provided for him excellently!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An Apostle who recites before you the explicating revelations of God that He may bring those who believe and do the right out of darkness into light. Whosoever believes in God and does the right, He will admit into gardens with rivers flowing by, where they will abide for ever. How excellent a provision has God made for him\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "a Messenger who rehearses to you Allah's verses that clearly expound the Guidance so that He may bring out those that believe and act righteously, from every kind of darkness into light. He will admit whosoever believes in Allah and acts righteously to Gardens beneath which rivers flow. They shall abide in them forever. For such has Allah made an excellent provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "a Messenger who recites to you the illustrious revelations of God, to bring the righteously striving believers out of darkness into light. God will admit those who believe in Him and act righteously to Paradise wherein streams flow, and they will live therein forever. God will provide them with excellent sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Noble Messenger who recites the clear verses of Allah to you, so that he may take those who accept faith and do good deeds, away from the realms of darkness towards light; and whoever accepts faith in Allah and does good deeds, Allah will admit him into Gardens beneath which rivers flow, to abide in them for ever and ever; indeed Allah has kept an excellent sustenance for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Messenger, who recites to you the Ayat of Allah containing clear explanations, that He may take out those who believe and do righteous good deeds, from the darkness to the light. And whosoever believes in Allah and performs righteous deeds, He will admit him into Gardens under which rivers flow, to dwell therein forever. Allah has indeed granted for him an excellent provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An Apostle who recites to you the clear communications of Allah so that he may bring forth those who believe and do good deeds from darkness into light; and whoever believes in Allah and does good deeds, He will cause him to enter gardens beneath which rivers now, to abide therein forever, Allah has indeed given him a goodly sustenance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "a Messenger reciting to you the signs of God, clear signs, that He may bring forth those who believe and do righteous deeds from the shadows into the light. Whosoever believes in God, and does righteousness, He will admit him to gardens underneath which rivers flow; therein they shall dwell for ever and ever. God has made for him a goodly provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A messenger reciting unto you the revelations of Allah made plain, that He may bring forth those who believe and do good works from darkness unto light. And whosoever believeth in Allah and doeth right, He will bring him into Gardens underneath which rivers flow, therein to abide for ever. Allah hath made good provision for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and a messenger who conveys to you God's clear messages, so that he might lead those, who believe and do good deeds, out of darkness into light. God will admit those who believe in Him and do good deeds into Gardens with rivers flowing through them, where they will remain forever. God has indeed made excellent provision for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An apostle reciting Unto you the revelations of Allah as evidences, that he may bring forth those who believe and work righteous works from darknesses into light. And whosoever believeth in Allah and worketh righteously, him He will cause to enter Gardens whereunder rivers flow, as abiders for evermore. Surely Allah hath made for him an excellent provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "an apostle reciting to you the manifest signs of Allah that He may bring out those who have faith and do righteous deeds from darkness into light. And whoever has faith in Allah and does righteous deeds, He shall admit him into gardens with streams running in them, to remain in them forever. Allah has certainly granted him an excellent provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An Messenger, who rehearses to you the Signs of Allah containing clear explanations, that he may lead forth those who believe and do righteous deeds from the depths of Darkness into Light. And those who believe in Allah and work righteousness, He will admit to Gardens beneath which Rivers flow, to dwell therein for ever: Allah has indeed granted for them a most excellent Provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And has also sent to you) a Messenger (Muhammad SAW), who recites to you the Verses of Allah (the Quran) containing clear explanations, that He may take out, those who believe and do righteous good deeds from the darkness (of polytheism and disbelief) to the light (of Monotheism and true Faith). And whosoever believes in Allah and performs righteous good deeds, He will admit him into Gardens under which rivers flow (Paradise), to dwell therein forever. Allah has indeed granted for him an excellent provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "a Messenger reciting to you the verses, clear verses of Allah, so that he may bring forth those who believe and do good deeds from the darkness into thelight. Whosoever believes in Allah and does good deeds He will admit to Gardens underneath which rivers flow where they shall live for ever and ever. For those, Allah has made a goodly provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A messenger who recites to you God’s Verses, clear and distinct, that he may bring those who believe and work righteousness from darkness into light. Whoever believes in God and acts with integrity, He will admit him into gardens beneath which rivers flow, therein to abide forever. God has given him an excellent provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[He sent] a Messenger [Muhammad] reciting to you the distinct verses of Allah that He may bring out those who believe and do righteous deeds from darknesses into the light. And whoever believes in Allah and does righteousness - He will admit him into gardens beneath which rivers flow to abide therein forever. Allah will have perfected for him a provision.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[65:11] a messenger, that is, Muhammad (s) (rasūlan is in the accusative because of an implied verb, that is to say, wa-arsala, ‘and He sent you [a messenger]’) reciting to you the clear signs of God (read mubayyanāt or mubayyināt, as [explained] above) that He may bring forth those who believe and perform righteous deeds, after the arrival of the remembrance and the Messenger, from darkness, the disbelief to which they adhered, to light, the faith that was established in them after [a life of] disbelief. And those who believe in God and act righteously, He will admit them (a variant reading has the first person plural [nudkhilhu, ‘We will admit them’]) into gardens underneath which rivers flow, wherein they will abide forever. God has verily made a good provision for him, namely, the provision of Paradise, the bliss of which never ends.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(A messenger) Muhammad (pbuh) (reciting unto you the revelations of Allah) the Qur'an (made plain) making clear the commands and prohibitions, (that He may bring forth those who believe) in Muhammad (pbuh) and the Qur'an (and do good works) and do acts of obedience, secretly between them and their Lord (from darkness unto light) from disbelief to faith. (And whosoever believeth in Allah) and Muhammad (pbuh) and the Qur'an, (and doeth right) sincerely between himself and his Lord, (He will bring him) in the Hereafter (into Gardens beneath which) beneath its trees and habitations (rivers flow) river of wine, water, honey and milk flow, (therein to abide for ever) they will dwell in the Garden, never to die or leave. (Allah hath made good provision for him) Allah has prepared a reward for him in Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nولهذا جعله سبحانه { رَّسُولاً } مرسلاً من عنده إليكم\n لإرشادكم وتكميلكم { يَتْلُواْ عَلَيْكُمْ آيَاتِ ٱللَّهِ } الدالة على وحدة ذاته\n وكمال أسمائه وصفاته { مُبَيِّنَاتٍ } مشروحات موضحات كل ذلك { لِّيُخْرِجَ ٱلَّذِينَ آمَنُواْ } بالله على وجه الإخلاص { وَعَمِلُواْ ٱلصَّالِحَاتِ } المؤكدة لإيمانهم { مِنَ ٱلظُّلُمَاتِ إِلَى ٱلنُّورِ } أي: الظلمات الحاصلة من تراكم الكثرات\n وتتابع الإضافات الناشئة من الأوهام والخيالات الباطلة إلى نور الوجود الذي هو الوحجدة الذاتية المسقطة لعموم الإضافات مطلقاً\n\n\n{ وَ } بالجملة: { مَن يُؤْمِن بِٱللَّهِ } ويوقن بوحدته { وَيَعْمَلْ صَالِحاً } طلباً لمرضاته { يُدْخِلْهُ } سبحانه بمقتضى فضله ولطفه { جَنَّاتٍ } منتزهات العلم والعين والحق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } المترشحة دائماً من البحر المحيط الذي هو حضرة العلم الإلهي\n ولوح قضائه المشتمل على عموم الكوائن والفواسد الجارية في فضاء الوجود مطلقاً { خَالِدِينَ فِيهَآ أَبَداً } لا يتحولون منها أصلاً\n وبالجملة: { قَدْ أَحْسَنَ ٱللَّهُ لَهُ رِزْقاً } [الطلاق: 11] صورياً ومعنوياً\n\n\nوكيف لا يحسن رزقه سبحانه\n مع أنه { ٱللَّهُ ٱلَّذِي خَلَقَ } أي: أظهر وقدَّر بمقتضى قدرته الكاملة { سَبْعَ سَمَٰوَٰتٍ } علويات مطبقات على عدد الأوصاف السبعة الذاتية الإلهية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وانتصب { رسولا } بفعل مضمر\n أي: وأرسل رسولاً\n أو: هو بدل من \" ذِكْراً \" كأنه في نفسه ذكر\n أو: على تقدير حذف مضاف\n قد أنزل ذا ذكر رسولاً\n وأريد بالذكر: الشرف\n كقوله:\n[الزخرف:44] أي: ذو شرف ومجدٍ عند الله\n أو: للمنزَل عليه\n أو: لقارئه\n وبالرسول: جبريل\n أو محمد ـ عليهما الصلاة والسلام ـ { يتلوا } أي: الرسول\n أو الله ـ عزّ وجل ـ { عليكم آياتِ الله مُبينات } أي: واضحاتٍ\n قد بيَّنها اللهُ تعالى لقوله:\n[آل عمران:118والحديد:17] وقرىء بكسر الياء\n أي: تُبين ما تحتاجون إليه من الأحكام\n { لِيُخرج الذين آمنوا وَعمِلوا الصالحاتِ من الظلمات إِلى النور } متعلق بـ \" يتلو \" \n أو: بـ \" أنزل \" \n وفاعل \" يُخرج \" إما الله\n أو الرسول\n أي: ليحصّل لهم الله أو الرسول ما هم عليه الآن من الإيمان والعمل الصالح\n أو: ليخرج من عَلِمَ وقدّر أنه سيؤمن\n { ومَن يؤمن بالله ويعمل صالحاً } حسبما بُيّن في تضاعيف ما أنزل من الآيات المبينات { يُدخله جنات تجري من تحتها الأنهارُ } \n وقرأ نافع والشامي بنون العظمة { خالدين فيها أبداً } \n والجمع باعتبار معنى \" من \" كما أنَّ الإفراد في الضمائر الثلاثة باعتبار لفظها\n { قد أحسن اللهُ له رزقاً } في الدنيا والآخرة\n قال القشيري: الرزقُ الحَسَنُ: ما كان على حَدِّ الكفاية\n لا نقصان فيه\n ليضعف عن كفاية صاحبه\n ولا زيادةَ فيه تَشْغَلهُ عن ربهم\n\nهـ\n بالمعنى\n وسيأتي في الإشارة بقيته\n الإشارة: وكأيّن من قريةٍ من قرى القلوب عتت عن أمر ربها عن تحمُّل أعباء العبودية لأنّ القلب لا يحب إلا العلو والغنى والراحة\n فإذا أراد العبد أن ينزل إلى الخمول والذل والفقر والتعب عَتَا وتَكَبَّر\n وقد حكم اللهُ تعالى بالطبع على القلب المتكبّر\n بقوله:\n[غافر:35] في قراءة الإضافة\n والمراد بالرسل: الواردات القهرية\n فالقلب أيضاً شأنه الفرار منها لأنها تهدم عليه عوائده\n وحسابه تعالى لها إحصاؤه لخواطرها\nوعتابه عليها\n وتعذيبه بالجزع والهلع\n والحرص والطمع\n وغم الحجاب وسوء الحساب\n فهذا وبال القلوب المتكبِّرة على الله\n وعلى أولياء الله\n وعاقبتها حرمان نعيم الحضرة\n ونسيم القربة\n فاتقوا الله يا أولي الألباب: القلوب الصافية\n أي: دُوموا على تقواكم\n واحْذروا مما حلّ بالقلوب الخاربة\n الذين آمنوا إيمان الخصوص\n قد أنزل الله إليكم ذكراً\n أي: مذكِّراً\n رسولاً بعثه الله خليفةَ رسوله الأعظم صلى الله عليه وسلم\n وهو الشيخ الداعي إلى الله\n يتلو عليكم آياته\n أي: شواهده الموصِّلة إليه\n ليُخرج الذين آمنوا وعملوا الأعمال الصالحات\n وهي آداب العبودية\n من ظلمات الجهل والغفلة\n وحس الكائنات إلى نور العيان\n ومَن يُؤمن بالله\n ويثق به في جميع أموره\n ويعمل صالحاً يُعرض عما سوى الله\n يُدخله جنات المعارف\n يخلد فيها\n قد أحسن اللهُ له رزقاً لقلبه وروحه وسره\n من العلوم والمعارف والأسرار\n قال القشيري بعد كلام: وكذلك أرزاقُ القلوب ـ أي: تكون على حد الكفاية\n من غير زيادة ولا نقصان ـ ثم قال: وحسنها: أن يكون له من الأحوال ما يشتغلُ به في الوقت من غير نقصان يجعله يتعذّب بتعطُّشه\n ولا تكون بزيادة\n فيكون على خَطَرٍ من مغاليط لا يَخْرُجُ منها إلاّ بتأييدٍ من الله سماويٍّ\nهـ\n ثم ذكر دلائل قدرته\n فقال: { ٱللَّهُ ٱلَّذِي خَلَقَ سَبْعَ سَمَاوَاتٍ وَمِنَ ٱلأَرْضِ مِثْلَهُنَّ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:122",
      "similarity": 0.7350111720835287
    },
    {
      "verse": "4:57",
      "similarity": 0.6118929227616103
    },
    {
      "verse": "14:23",
      "similarity": 0.583274007603452
    },
    {
      "verse": "5:119",
      "similarity": 0.5337030193986431
    },
    {
      "verse": "22:14",
      "similarity": 0.5335886204048206
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/65:11.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/65:11.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/65:11.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}