{
  "chapter": "الطلاق",
  "text": "الله الذى خلق سبع سموت ومن الارض مثلهن يتنزل الامر بينهن لتعلموا۟ ان الله على كل شىء قدير وان الله قد احاط بكل شىء علمۢا",
  "translations": [
    {
      "translation": "It is Allah who created the seven heavens and of the earth the same number, the Command descending down through all of them, so that you might know that Allah has power over all things and that Allah encompasses all things in His knowledge.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who created several skies, and as many earths. The commandment is sent down among them so that you may know that God has power over everything, and everything is held within the knowledge of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is He Who created seven heavens, and, like them, the earth. His commandment descends among them. (All this is being stated so that you know) that Allah has power over everything, and that Allah encompasses all things in His knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who has created the seven heavens and a like number of earths. His commandments are sent between them, so that you would know that God has power over all things and that His knowledge encompasses all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who has created the seven heavens, and seven earthly worlds like them; the command descends within them, so that you may know that Allah is Able to do all things, and that Allah’s knowledge encompasses everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who has created seven heavens and of the earth the like thereof. His command descends between them, that you may know that Allah has power over all things, and that Allah surrounds all things with (His) knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who created seven heavens, and of the earth the like of them; the decree continues to descend among them, that you may know that Allah has power over all things and that Allah indeed encompasses all things in (His) knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who created seven heavens, and of earth their like, between them the Command descending, that you may know that God is powerful over everything and that God encompasses everything in knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is who hath created seven heavens, and of the earth the like thereof. The commandment cometh down among them slowly, that ye may know that Allah is Able to do all things, and that Allah surroundeth all things in knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who created the seven heavens and the same number of earths. His commandment descends among them, so that you may know that God has power over all things;  and that He encompasses all things with His knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah it is Who hath created seven heavens, and of the earth the like thereof; the commandment cometh down between them, that ye may know that Allah is over everything Potent, and that Allah! He encompasseth everything in knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who has created seven heavens, and of the earth [a number] similar to them. The command gradually descends through them, that you may know that Allah has power over all things, and that Allah comprehends all things in knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah is He Who created seven Firmaments and of the earth a similar number. Through the midst of them (all) descends His Command: that ye may know that Allah has power over all things, and that Allah comprehends, all things in (His) Knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who has created seven heavens and of the earth the like thereof (i.e. seven). His Command descends between them (heavens and earth), that you may know that Allah has power over all things, and that Allah surrounds (comprehends) all things in (His) Knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who has created the seven heavens, and of the earth their like, and the Command descends between them so that you know Allah is powerful over all things, and that Allah encompasses everything in knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God is He Who created seven heavens, and their like of earth. The command descends through them, so that you may know that God is Capable of everything, and that God Encompasses everything in knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who has created seven heavens and of the earth, the like of them. [His] command descends among them so you may know that Allah is over all things competent and that Allah has encompassed all things in knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[65:12] God it is Who created seven heavens, and of earth the like thereof, that is to say, seven earths. The command, the revelation, descends between them, between the heavens and the earth: Gabriel descends with it from the seventh heaven to the seventh earth, that you may know (li-ta‘lamū is semantically connected to an omitted clause, that is to say, ‘He apprises you of this creation and this sending down [that you may know]’), that God has power over all things and that God encompasses all things in knowledge. Medinese, consists of 12 verses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "675 (Allah it is Who hath created seven heavens) one above the other like a dome, (and of the earth the like thereof) seven earths but they are flat. (The commandment cometh down among them slowly) He says: He sends the angels down from heaven with revelation, Scripture and calamities, (that ye may know) and acknowledge (that Allah is Able to do all things) relating to the dwellers of the heavens and the earths, (and that Allah surroundeth all things in knowledge) and that His knowledge encompasses everything'. And of the surah in which Banning is mentioned, which is all Medinan and consists of 13 verses, 249 words and 1,060 letters: Surah 66: Banning [al-Tahrim) And of the surah in which Banning is mentioned, which is all Medinan and consists of 13 verses, 249 words and 1,060 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا يحسن رزقه سبحانه، مع أنه { ٱللَّهُ ٱلَّذِي خَلَقَ } أي: أظهر وقدَّر بمقتضى قدرته الكاملة { سَبْعَ سَمَٰوَٰتٍ } علويات مطبقات على عدد الأوصاف السبعة الذاتية الإلهية، وجعلها مسكناً للمجردات من الملائكة والأرواح { وَ } قدَّر { مِنَ ٱلأَرْضِ } السفلى؛ أي: عالم العناصر أيضاً { مِثْلَهُنَّ } مطبقات بعضها فوق بعض: طبقة الأثير الصرف، وطبقة الأثير الممتزجة، وطبقة الزمهرير من الهواء، وطبقة الهواء الصرف، وطبقة الماء الصرف،م وطبقة الطين المركب من الماء والتراب، وطبقة التراب الصرف، على عدد القوى السبع الإنسانية الفائضة على أعضائه السبعة، وهي: الدماغ، والكبد، والعين، والأذن، والأنف، واللسان وجميع البشرة من الصانع الحكيم؟!\n\n\n\nوإنما رتبها سبحانه وطبقها عليها؛ حين { يَتَنَزَّلُ ٱلأَمْرُ } الإلهي { بَيْنَهُنَّ } يعني: تصير السفليات قوابل الآثار العلويات، يقبلن منها ما يفيض عليهن من الكمالات المترتبة على الأسماء والصفات الذاتية الإلهية، كل ذلك { لِّتَعْلَمُوۤاْ } أيها المجبولون على فطرة العلم والمعرفة { أَنَّ ٱللَّهَ } المستقل بالألوهية والربوبية { عَلَىٰ كُلِّ شَيْءٍ } دخل في حيطة الوجود، ولمع عليه برق الشهود { قَدِيرٌ } لا ينتهي قدرته عند مقدور { وَ } لتعلموا أيضاً { أَنَّ ٱللَّهَ } المتصف بالقدرة الكاملة { قَدْ أَحَاطَ بِكُلِّ شَيْءٍ } دخل في حيطة قدرته { عِلْماً } [الطلاق: 12] إذ لا يعزب عن عمله مثقال ذرة في الأرض ولا في السماء، وهو السميع العليم\n\n\nخاتمة السورة\n\n\n\nعليك أيها السالك المتحقق بمقام القلب وسعته، وقابليته لنزول سلطان الوحدة الذاتية الإلهية مع بُعد غورها، ورفعة طورها عن أحلام الأنام مطلقاً أن الله المتجلي على كل جلي وخفي قدير على مقدورات لا تتناهى، ومرادات لا تُعد ولا تُحصى بمقتضى حيطة علمه بمعلومات لا غاية يحدها، ولا نهاية يحيطها\n\n\n\n\nفله سبحانه الإعادة والإبداء، والإماتة والإحياء، وله التصرف في ملكه كيف يشاء حسب اقتضاء الأوصاف والأسماء، لا إله إلا هو، له الاسماء الحسنى، وله الحمد في الآخرة والأولى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { اللهُ الذي خلق سبعَ سموات }: مبتدأ وخبر، وقد أجمع المفسرون أنَّ السموات سبع، { ومن الأرض مثلَهن } ، وليس في القرآن آية تدل على أنَّ الأرضين سبع غير هذه الآية، وبين كل سماءين مسيرة خمسمائة عام، وغلظ كلّ سماءٍ كلذلك، والأرضون مثل السموات، والجمهور أنها طباق، بعضها فوق بعض، بين كل أرض وأرض مسافة، كما بين السماء والأرض، وفي كل أرض سُكَّان مِن خلق الله تعالى، قيل: الجن، وقيل: الملائكة، وقال الضحاك: مطبقة بعضها فوق بعض، من غير فتوق، بخلاف السموات\n قال القرطبي: والأول هو الأصح لأنَّ الأخبار دالة عليه، كما ورد في الحديث: أنه صلى الله عليه وسلم كان يقول إذا رأى قرية أو مدينة:\n\n \" اللهم رب السموات السبع، وما أظللن، ورب الأرضين السبع، وما أقللن\n\n\n \" \n\nالحديث\n وفي الحديث أيضاً:\n\n \" مَن غصب شبراً من أرض طوّقه الله له من سَبْع أرَضِين \" \n\nهـ\n واختلف: هل يرون السماء، ويستمدًّون منها الضوء، قولان، أحدهما: إنهم يُشاهدون السماء من كل جانب من أرضهم، ويستمدُّون الضياء منها، والثاني: أنهم لا يُشاهدون السماء، وأنَّ الله تعالى خلق لهم ضياء يشاهدونه\n وعن ابن عباس أيضاً: \" إنها سبع أرضين متفرقة بالبحار وتظل الجميع السماء \"\n وقيل: الأرض واحدة إلاَّ أنَّ الأقاليم سبعة، فالمثلية على هذا في عِظم الجرم، وكثرة العمار، وغير ذلك\n والأول أرجح لِما تقدّم\n وقد ذكر المنذري حديثاً بيَّن فيه ما يعمرُ أرض، فبعضها فيها حجارة الكبريت وقوم جهنم، وبعضها فيها خزائن الريح، وفي أسفلها عرش إبليس، فانظره\n { يَتَنزَّلُ الأمرُ بينهن } أي: يجري أمره وقضاؤه بينهن، وينفذ حكمُه فيهن\n وعن قتادة: في كل سماءٍ وفي كل أرضٍ خلقٌ مِن خلقه، وأمرٌ نافذ من أمره، وقضاء من قضائه\n وقيل: هو ما يدبّر فيه من عجائب تدبيره، من إنزال المطر، وإنبات النبات، والإتيان بالليل والنهار، والصيف والشتاء، وخلق الحيوانات المختلفة\n وقال الغزالي: يتنزّل الأمر بالقدر من حضرة الربوبية إلى حملة العرش، ثم تتلقى ملائكة السموات ذلك منهم، ثم تصريفهم بذلك إلى أهل الأرض، وإجرائهم على مقتضاه\n وقيل: يتنزّل الأمر بالوحي من السماء السابعة إلى الأرض السفلى، وهل لكل أرض رسول، أم لا؟ الله أعلم\n { لتعلموا أنَّ اللهَ على كل شيءٍ قديرٌ } أي: فعل ذلك لتعلموا عموم قدرته، { وأنَّ اللهَ قد أحاط بكل شيءٍ علماً } لاستحالة صدور هذه الأفاعيل المذكورة ممن ليس كذلك\n ويجوز أن يكون العامل في اللام بيان ما ذكر من الخلق وتنزُّل الأمر، أي: أوضَحَ ذلك بيّنه لتعلموا بما ذكر من الأمور التي تُشاهدونها، والتي تتلقونها من الوحي، وعجائب المصنوعات، أنه لا يخرج عن قدرته وعلمه شيء أصلاً\n\n\nالإشارة: سموات الأرواح سبع طبقات، تعرج فيها إلى عرش الحضرة\n سماء التوبة، ثم سماء الصبر، ثم سماء الورع والزهد، ثم سماء الرضا والتسليم، ثم سماء المحبة، ثم سماء المراقبة، ثم سماء المشاهدة، ثم الاستواء على عرش الحضرة، في حضرة الأسرار\n وأرض العبودية سبع أيضاً، وبالتنزُّل فيها تهوي النفس إلى عرش إبليس، في حضرة الفرق، وبالخروج عنها تعرج في سماوات الأرواح، وهي أرض الشهوة، ثم أرض الغفلة، ثم أرض حب الدنيا، ثم أرض حب العلو والجاه، ثم أرض هَم الرزق وخوف الفقر، ثم أرض التدبير والاختيار، ثم أرض الغضب والحقد والحسد، فبهذه الأخلاق المذمومة يهوي العبد إلى أسفل سافلين\n فإذا ترقّى عن هذه الأرضين، وسما في سماء الأرواح، يتنزّل على قلبه الوحي الإلهامي، والكشف الرباني\n قال تعالى: { يتنزل الأمر بينهن لتعلموا أنّ الله على كل شيءٍ قدير } ، أي: ليحصل لكم العلم الحقيقي بقدرة الله وعلمه وإحاطة ذاته\n قال الورتجبي: لو كانت للأشباح قيمة في المعرفة كالأرواح لم يخاطبها بالعلل والاستدلال، لتعلم برؤية الأشياء وجود الحق، وكانت كالأرواح في الخطاب بلا عِلّة في تعريف نفسه إياها بقوله:\n\n[الأعراف:172] هناك خطاب وشهود وتعريف بلا عِلّة، فلما عَلِمَ عجزها عن حمل واردات الخطاب الصِّرف أحالها إلى الشواهد، وليس بعارفٍ في الحقيقة مَن عرفه بشيءٍ من الأشياء، وسببٍ من الأسباب، فمَن نظر إلى خلق الكون يعرف أنه ذو قدرة واسعة وإحاطة شاملة، يخاف من قهره، ويذوب قلبه بعلمه في رؤية اطلاع الحق تعالى عليه\n هـ\n وبالله التوفيق\n وصلّى الله على سيدنا محمد وآله وصحبه وسلّم\n\n",
      "translations": []
    }
  ]
}