{
  "chapter": "الطلاق",
  "text": "يايها النبى اذا طلقتم النساء فطلقوهن لعدتهن واحصوا۟ العدة واتقوا۟ الله ربكم لا تخرجوهن منۢ بيوتهن ولا يخرجن الا ان ياتين بفحشة مبينة وتلك حدود الله ومن يتعد حدود الله فقد ظلم نفسه لا تدرى لعل الله يحدث بعد ذلك امرا",
  "translations": [
    {
      "translation": "O Prophet! When any of you divorce women, divorce them during their period of purity and calculate their 'idda carefully. And have taqwa of Allah, your Lord. Do not evict them from their homes, nor should they leave, unless they commit an outright indecency. Those are Allah's limits, and anyone who oversteps Allah's limits has wronged himself. You never know, it may well be that after that Allah will cause a new situation to develop.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O PROPHET WHEN you divorce women, divorce them at their appointed period, and calculate that period, and fear God, your Lord. Do not expel them from their houses, nor should they go away themselves, unless they are openly guilty of adultery. These are the limits set by God. Any one who exceeds the limits set by God sins against his own self. You never know that God may perchance lead to a new situation after this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, when you divorce women, divorce them for their waiting-period, and compute the waiting period accurately, and hold Allah, your Lord, in awe. Do not turn them out of their homes (during the waiting period) – nor should they go away (from their homes) – unless they have committed a manifestly evil deed. Such are the bounds set by Allah; and he who transgresses the bounds set by Allah commits a wrong against himself. You do not know: maybe Allah will cause something to happen to pave the way (for reconciliation).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prophet and believers, if you want to divorce your wives, you should divorce them at a time after which they can start their waiting period. Let them keep an account of the number of the days in the waiting period. Have fear of God, your Lord. (During their waiting period) do not expel them from their homes and they also must not go out of their homes, unless they commit proven indecency. These are the Laws of God. Whoever transgresses against the laws of God has certainly wronged himself. You never know, perhaps God will bring about some new situation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O dear Prophet (Mohammed – peace and blessings be upon him)! When you people divorce women, divorce them at the time of their completing the appointed period, and keep count of the appointed period; and fear Allah, your Lord; do not expel them from their houses during the appointed period nor should they leave on their own, unless they bring about some matter of blatant lewdness; and these are the limits of Allah; and whoever crosses Allah’s limits has indeed wronged himself; do you not know, it is likely that Allah may send some new decree after this?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! When you divorce women, divorce them at their `Iddah and count their `Iddah. And have Taqwa of Allah, your Lord. And turn them not out of their homes nor shall they leave, except in case they are guilty of Fahishah Mubayyinah. And those are the set limits of Allah. And whosoever transgresses the set limits of Allah, then indeed he has wronged himself. You know not, it may be that Allah will afterward bring some new thing to pass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! when you divorce women, divorce them for~ their prescribed time, and calculate the number of the days prescribed, and be careful of (your duty to) Allah, your Lord. Do not drive them out of their houses, nor should they themselves go forth, unless they commit an open indecency; and these are the limits of Allah, and whoever goes beyond the limits of Allah, he indeed does injustice to his own soul. You do not know that Allah may after that bring about reunion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, when you divorce women, divorce them when they have reached their period. Count the period, and fear God your Lord. Do not expel them from their houses, nor let them go forth, except when they commit a flagrant indecency. Those are God's bounds; whosoever trespasses the bounds of God has done wrong to himself. Thou knowest not, perchance after that God will bring something new to pass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! When ye (men) put away women, put them away for their (legal) period and reckon the period, and keep your duty to Allah, your Lord. Expel them not from their houses nor let them go forth unless they commit open immorality. Such are the limits (imposed by) Allah; and whoso transgresseth Allah's limits, he verily wrongeth his soul. Thou knowest not: it may be that Allah will afterward bring some new thing to pass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! When any of you divorce your wives, divorce them during their period of purity and calculate the period carefully: be mindful of God, your Lord. Do not drive them out of their homes, nor should they themselves leave, unless they become openly guilty of immoral conduct. These are the bounds set by God. He who transgresses God's bounds wrongs his own soul. You never know, after that, God may well bring about some new situation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! when ye divorce women, divorce them before their waitrng-period; and count the waiting period; and fear Allah, your Lord. Drive them not out of their houses, nor should they go forth, unless they commit a manifest indecency. These are the bounds of Allah; and whosoever trespasseth the bounds of Allah, hath surely wronged himself. Thou knowest not, that haply Allah may hereafter bring something new to pass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! When you divorce women, divorce them at [the conclusion of] their term and calculate the term, and be wary of Allah, your Lord. Do not turn them out from their homes, nor shall they go out, unless they commit a gross indecency. These are Allah’s bounds, and whoever transgresses the bounds of Allah certainly wrongs himself. You never know maybe Allah will bring off something new later on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! When ye do divorce women, divorce them at their prescribed periods, and count (accurately), their prescribed periods: And fear Allah your Lord: and turn them not out of their houses, nor shall they (themselves) leave, except in case they are guilty of some open lewdness, those are limits set by Allah: and any who transgresses the limits of Allah, does verily wrong his (own) soul: thou knowest not if perchance Allah will bring about thereafter some new situation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet (SAW)! When you divorce women, divorce them at their 'Iddah (prescribed periods), and count (accurately) their 'Iddah (periods). And fear Allah your Lord (O Muslims), and turn them not out of their (husband's) homes, nor shall they (themselves) leave, except in case they are guilty of some open illegal sexual intercourse. And those are the set limits of Allah. And whosoever transgresses the set limits of Allah, then indeed he has wronged himself. You (the one who divorces his wife) know not, it may be that Allah will afterward bring some new thing to pass (i.e. to return her back to you if that was the first or second divorce).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O (nation of the) Prophet, if you divorce your wives, divorce them after (the end of their) menstrual cycle. Count their waiting period and fear Allah your Lord. Do not drive them from their homes or let them go away unless they commit a proven immorality. Such are the bounds set by Allah, he that exceeds the bounds of Allah wrongs himself. You do not know, perhaps after that Allah will bring a new event.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! If any of you divorce women, divorce them during their period of purity, and calculate their term. And be pious before God, your Lord. And do not evict them from their homes, nor shall they leave, unless they have committed a proven adultery. These are the limits of God—whoever oversteps God’s limits has wronged his own soul. You never know; God may afterwards bring about a new situation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, when you [Muslims] divorce women, divorce them for [the commencement of] their waiting period and keep count of the waiting period, and fear Allah, your Lord. Do not turn them out of their [husbands'] houses, nor should they [themselves] leave [during that period] unless they are committing a clear immorality. And those are the limits [set by] Allah. And whoever transgresses the limits of Allah has certainly wronged himself. You know not; perhaps Allah will bring about after that a [different] matter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[65:1] O Prophet, meaning [to address] his community, on account of what follows; or, [it means] say to them: when you [men] divorce women, when you intend to [effect a] divorce, divorce them by their prescribed period, at the beginning of it, such that the divorce is effected while she is pure and has not been touched [sexually], based on the Prophet’s (s) explaining it in this way, [as] reported by the two Shaykhs [al-Bukhārī and Muslim]. And count the prescribed period, keep record of it, so that you may repeal [your decision] before it is concluded; and fear God your Lord, obey Him in His commands and prohibitions. Do not expel them from their houses, nor let them go forth, from them until their prescribed period is concluded, unless they commit a blatant [act of] indecency, [such as] adultery (read mubayyana or mubayyina, corresponding [respectively] to buyyinat, ‘one that has been proven’, and bayyina, ‘blatant’), in which case they are brought out in order to carry out the [prescribed] legal punishment against them. And those, mentioned [stipulations], are God’s bounds; and whoever transgresses the bounds of God has verily wronged his soul. You never know: it may be that God will bring something new to pass afterwards, [after] the divorce, [such as] a retraction, in the event that it was the first or second [declaration of divorce].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said in the interpretation of Allah's saying (O Prophet!): '(O Prophet!) And this includes his community. (When ye (men) put away women) He says: tell your people, when you want to divorce women, (put them away for their (legal) period) divorce them when they become pure from their menses and they have not had sexual intercourse with them (and reckon the period) reckon their periods of purity following three periods of menstruation which are followed by major ritual ablution which, for this denotes the end of the waiting period (and keep your duty to Allah) and fear Allah, (your Lord) and do not divorce them when they are not ritually pure, as this goes against the prophetic practice. (Expel them not from their houses) where the divorce has taken place until the waiting period is over (nor let them go forth) until the elapse of the waiting period (unless they commit open immorality) unless they commit an evident sin, i.e. going out during the waiting period without her husbands' permission. Thus, expelling them from their homes during the waiting period is a sin and their 673 going out in their waiting period is also a sin; it is also said that (unless they commit open immorality) means: unless they commit an act of adultery witnessed by four people, in which case they should be stoned. (Such are the limits (imposed by) Allah) these are the legal rulings and obligations of Allah about women regarding expenditure and lodgement; (and whoso transgresseth Allah's limits) and whoever transgresses Allah's legal rulings and obligations and that which He has commanded regarding expenditure and lodgement, (he verily wrongeth his soul) he harms his own person. (Thou knowest not) i.e. the husband does not know: (it may be that Allah will afterward) after the first pronouncement of divorce and before the end of the waiting period (bring some new thing to pass) i.e. love between the husband and wife and return to each other.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قالَ: حدّثنا علي بن أحمد\n قالَ: حدّثنا عطاء بن السّائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { لاَ تُخْرِجُوهُنَّ مِن بُيُوتِهِنَّ وَلاَ يَخْرُجْنَ إِلاَّ أَن يَأْتِينَ بِفَاحِشَةٍ مُّبَيِّنَةٍ } فالفَاحشةُ: الزِّنا\n\n\n\n\nوقوله تعالى: { وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ } معناه يُجاوزُها\n\n\n\n\nوقوله تعالى: { فَقَدْ ظَلَمَ نَفْسَهُ } معناه نَقَّصَها\n\n\n\n\nوقوله تعالى: { لاَ تَدْرِى لَعَلَّ ٱللَّهَ يُحْدِثُ بَعْدَ ذَلِكَ أَمْراً } معناه مُراجعةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n He said, \"Ali ibn Ahmad narrated to us.\"\n\n\nHe said: \"Ata ibn al-Saaib narrated to us from Abu Khalid from Zayd ibn Ali, peace be upon them, in his saying, 'Do not force them to leave their homes, and they should not leave except if they bring a clear case of immorality.'\" The case of immorality refers to adultery.\n\n\nAnd His saying, \" Whoever transgresses the bounds of Allah \" means whoever goes beyond them.\n\n\nAnd His saying, \"Indeed, he has wronged himself,\" [means that] he has deprived himself.\n\nAnd His saying, { perhaps Allah will bring about after that an affair } its meaning is a review.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ومن يتق الله } بحسب مقتضى مقامه واجتنب ذنب حاله { يجعل له مخرجاً } من ضيق المقام والمكاسب إلى سعة روح الحال والمواهب فمن يتقيه في معاصيه يجعل له مخرجاً من مضايق الهيئات المظلمة وعقوبات نيران الطبيعة { ويرزقه } ثواب جنة النفس وأنوار الفضائل من عالم الغيب { من حيث لا يحتسب } لعدم وقوفه منها ومن يتقيه في أفعال نفسه يجعل له مخرجاً إلى مقام التوكل ويرزقه تجليات الأفعال من حيث لا يحتسب\n ومن يتقيه في صفات نفسه يجعل له مخرجاً إلى مقام الرضا ويرزقه روح اليقين وثمرات تجليات الصفات الإلهية في جنة القلب من حيث لا يحتسب لعدم شعوره بها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأيُّهَا ٱلنَّبِيُّ } المبعوث إلى كافة البرايا\n لترشدهم وتصلح أحوالهم\n فلزم عليك وعليهم أصلاً وفرعاً { إِذَا طَلَّقْتُمُ ٱلنِّسَآءَ } وقصدتم دفع رابطة العلاقة الشرعية بالفرقة الشرعية أيضاً { فَطَلِّقُوهُنَّ } وادفعوا عنهن قيد الألفة المقتضية للزوجية { لِعِدَّتِهِنَّ } أي: في إيتانها ووقتها الذي هو مدة الطهر قبل وقوع الوقائع فيها { وَأَحْصُواْ ٱلْعِدَّةَ } الكاملة أي: الأطهار الثلاثة مع المطلقات الثلاثة\n حتى تقع كل طلقة في طهر { وَٱتَّقُواْ ٱللَّهَ رَبَّكُمْ } المنتقم الغيو الذي ربَّاكم على مقتضى العدالة\n فعليكم ألاَّ تتجاوزوا عنها\n فلا تزيدوا على عدتهن بالمراجعة عليهن\n ثمَّ تطلقوهن\n\n\nفعليكم أن { لاَ تُخْرِجُوهُنَّ } بالتعدي بعد وقوع الطلاق { مِن بُيُوتِهِنَّ } أي: مساكنكم التي كن فيها قبل الفرقة\n حتى تنقضي عدتهن فيها { وَلاَ يَخْرُجْنَ } أيضاً بأنفسهن بعد الفرقة من مساكنهن بلا رضاً منكم أيها المطلِّقون\n بل لا بدَّ لهن أن يعتددن فيها { إِلاَّ أَن يَأْتِينَ بِفَاحِشَةٍ مُّبَيِّنَةٍ } أي: زناً يشهد له شهود على الوجه المعتبر في الشرع\n فحينئذٍ يخرجن\n لإجراء الحد عليهن\n فيصبح هذا الاستثناء من كلا الحكمين السابقين\n\n\n{ وَتِلْكَ } الحدود المذكورة { حُدُودُ ٱللَّهِ } العليم الحكيم\n الصادرة عنه بمقتضى الحكمة البالغة المقتضية للعدالة الكاملة { وَمَن يَتَعَدَّ } ويتجاوز { حُدُودَ ٱللَّهِ } المنتقم الغيور { فَقَدْ ظَلَمَ نَفْسَهُ } بالعرض على عذاب الله عاجلاً وآجلاً\n إنه { لاَ تَدْرِى } وتعلم نفس المطلِّق المجاوز عن الحد الشرعي بالتطويل في العدة\n والتهاون على المرأة أو نفس المرأة المطلقة بإتيان الفاحشة في أوان العدة وغيرها { لَعَلَّ ٱللَّهَ } المقتدر { يُحْدِثُ بَعْدَ ذَلِكَ } التفريق والبينونة { أَمْراً } [الطلاق: 1] بأن جعل للمطلق بدل تلك الزوجة المطلقة زوجة سليطة مسلطة عليه\n أو جعل للمطلَّقة زوجاً أشد إيلاماً منه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ يٰأيُّهَا ٱلنَّبِيُّ إِذَا طَلَّقْتُمُ ٱلنِّسَآءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحْصُواْ ٱلْعِدَّةَ وَٱتَّقُواْ ٱللَّهَ رَبَّكُمْ لاَ تُخْرِجُوهُنَّ مِن بُيُوتِهِنَّ وَلاَ يَخْرُجْنَ إِلاَّ أَن يَأْتِينَ بِفَاحِشَةٍ مُّبَيِّنَةٍ وَتِلْكَ حُدُودُ ٱللَّهِ وَمَن يَتَعَدَّ حُدُودَ ٱللَّهِ فَقَدْ ظَلَمَ نَفْسَهُ لاَ تَدْرِى لَعَلَّ ٱللَّهَ يُحْدِثُ بَعْدَ ذَلِكَ أَمْراً فَإِذَا بَلَغْنَ أَجَلَهُنَّ فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ أَوْ فَارِقُوهُنَّ بِمَعْرُوفٍ وَأَشْهِدُواْ ذَوَي عَدْلٍ مِّنكُمْ وَأَقِيمُواْ ٱلشَّهَادَةَ لِلَّهِ ذَٰلِكُمْ يُوعَظُ بِهِ مَن كَانَ يُؤْمِنُ بِٱللَّهِ وَٱلْيَوْمِ ٱلآخِرِ\n\n\n }\n يقول الحق جلّ جلاله: { يا أيها النبيُّ إِذا طلقتم النساءَ } \n خصَّ النبيَّ صلى الله عليه وسلم بالنداء\n وعمَّ بالخطاب لأنَّ النبيَّ صلى الله عليه وسلم إمام أمته وقدوتهم\n كما يُقال لرئيس القوم: يا فلان افعلوا كذا وكذا إظهاراً لتقدُّمه\n واعتباراً لترؤسه\n وأنه قدوة قومه\n فكان هو وحده في حكم كلّهم\n وسادًّا مسدَّ جميعهم\n ومعنى \" إذا طلقتم \": إذا أردتم تطليقهن\n كقوله:\n[المائدة:6]\n تنزيلاً للمقبل على الشيء المشارِف له منزلةَ الشارع فيه\n كقوله صلى الله عليه وسلم:\n \" مَن قتل قتيلاً فله سلبه \" \n\n ومنه: كان الماشي إلى الصلاة والمنتظر لها في حكم المُصَلِّي\n { فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ } أي: مستقبلات لِعِدَّتهن\n شارعة فيها\n بمجرد الطلاق\n من غير أن تكون في حيض أو نِفاس\n فإنَّ المرأة إذا طلقت في طُهر تعتد بذلك الطُهر من أقرائها\n فتخرج من العدّة برؤية الحيض الثالث\n بخلاف إذا طُلقت في غير طُهر\n فتنتظر الطُهر منه\n فلا تخرج إلاّ برؤية الحيض الرابع\n والمراد أن يُطلِّق في طُهر لم يمس فيه\n وهذا هو طلاق السُنَّة\n قال ابن جزي: واختلف في الطلاق: هل هو مباح أو مكروه\n وأمّا إن كان على غير وجه السُنة فهو ممنوع\n هـ\n وفي قراءة رسول الله صلى الله عليه وسلم:\n \" فطلِّقوهن في قُبل عِدّتهن \"\n \nقال ابن جزي: واختلف في النهي عن الطلاق في الحيض\n هل هو معلَّل بتطويل العدة\n أو تعبُّد\n والصحيح: أنه معلَّل بذلك\n وينبني على هذا الخلاف فروع\n منها: هل يجوز إذا رضيت به المرأةُ أم لا؟ ومنها: هل يجوز طلاقها في الحيض وهي حامل أم لا؟ ومنها: هل يجوز طلاقها قبل الدخول وهي حائض أم لا؟ فالتعليل بتطويل العدة يقتضي جواز هذه الفروع\n والتعبُّد يقتضي المنع\n ومَن طَلَّق في الحيض لزمه الطلاق\n ثم أُمر بالرجعة على وجه الإجبار عند مالك\n ودون إجبار عند الشافعي حتى تطهر ثم تحيض ثم تطهر\n ثم إن شاء طلَّق وإن شاء أمسك\n حسبما ورد في حديث ابن عمر\n حيث طلّق امرأته\n فأمره صلى الله عليه وسلم برجعتها هـ\n { وأَحْصُوا العِدَّةَ } اضبطوها\n وأكمِلُوها ثلاثة أقراء كوامل\n لِما ينبني عليها من الأحكام\n كالرجعة والسكنى والميراث وغير ذلك\n { واتقوا اللهَ ربكم } في تطويل العدة عليهن والإضرار بهن\n\nوفي التعبير بعنوان الربوبية تأكيد لِما أمر\n ومبالغة في إيجاب الاتقاء\n { لا تُخرجوهن من بيوتهن } من مساكنهن عند الفراق إلى أن تنقضي عدتهن\n وإضافتها إليهن مع أنها للأزواج لتأكيد النهي ببيان كمال استحقاقهن لسكانها\n كأنها أملاكهن\n { ولا يَخْرُجْن } ولو بالإذن منكم\n فإنَّ الإذن في الخروج في حكم الإخراج\n وقيل: لا يخرجن باستبدادهن\n أمّا إذا اتفقا على الخروج جاز\n وهو خلاف مذهب مالك\n فلا يجوز لها في مذهبه المَبيت عن بيتها\n ولا أن تغيب عنه\n إلاّ لضرورة التصرُّف\n وذلك لحفظ النسب\n وصيانة المرأة\n فإن كان المسكن ملكًا للزوج\n أو مكترىً عنده لزمه إسكانها فيه\n وإن كان المسكن لها فعليه كِراؤه مدة العدة\n وإن كان قد استمتعته فيه مدة الزوجية ففي لزوم خِراج العدة له قولان في المذهب\n والصحيح لزومه لأنّ الاستمتاع قد انقطع بالطلاق\n { إِلاَّ أن يأتين بفاحشةٍ مبيِّنة } \n قيل: الزنا\n فيخرجن لإقامة الحد\n قاله الليثي والثعلبي\n وقيل: سوء الكلام وإظهار الفحش مع الأصْهار\n فتخرج ويسقط حقها من السكنى\n وتلزمها الإقامة في مسكن تتخذه حفظاً للنسب\n قاله ابن عباس\n ويؤيده: قراءة أُبي: \" إلاَّ أن يفحشن عليكم \" \n وقيل: جميع المعاصي من القذف والسرقة وغير ذلك\n قاله ابن عباس أيضاً\n ومال إليه الطبري\n وقيل: الخروج من بيتها خروجَ انتقال\n متى فعلت ذلك سقط حقها\n قاله ابن الفرس\n وإلى هذا ذهب مالك في المرأة إذا نشزت في العدة\n وقيل: هو النشوز قبل الطلاق\n فإذا طلّقها بسبب نشوزها فلا سكنى على زوجها قاله قتادة\n { وتلك حدودُ الله } أي: تلك الأحكام المذكورة هي حدود الله التي عيّنها لعباده\n { ومَن يَتَعَدَّ حدودَ الله } المذكورة\n بأن يُخلّ بشيء منها\n على أنَّ الإظهار في محل الإضمار لتهويل أمر التعدي\n والإشعار بعلة الحكم\n { فقد ظَلَمَ نفسه } أضرَّ بها\n إذ لعله يندم\n والتفسير بتعريضها للعذاب يأباه قوله: { لا تدري لعل اللهَ يُحدِثُ بعد ذلك أمراً } فإنه استئناف مسوق لتعليل مضمون الشرطية\n وقد قالوا: إنَّ الأمر الذي يُحدثه اللهُ تعالى: هو أن ينقلب قلبه بُغضها إلى محبتها\n أو: من الرغبة عنها إلى الرغبة فيها\n ويندم\n فلا بد أن يكون الظُلم عبارة عن ضرر دنيوي يلحقه بسبب تعدِّيه\n وهو الندم إن كان طلَّق ثلاثاً\n فيمنع من الرجعة\n أو: الحياء\n إن كان إخراجها من المسكن بلا سبب\n أو: فقد ظَلَمَ نفسَه بتعريضها للعذاب الشامل الدنيوي والأخروي\n حيث خالف ما أمره سيده\n { لاتدري } أيها المخاطب { لعل اللهُ يُحِدثُ بعد ذلك أمراً } وهو الرجعة\n والمعنى: أحصوا العِدَّة وامتثلوا ما أُمرتم به\n لعل الله يُحدث الرجعة لنسائكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:94",
      "similarity": 0.41962821110200305
    },
    {
      "verse": "14:34",
      "similarity": 0.41459942524305293
    },
    {
      "verse": "16:18",
      "similarity": 0.4038449558106222
    },
    {
      "verse": "72:28",
      "similarity": 0.3575741101449426
    },
    {
      "verse": "78:29",
      "similarity": 0.3443199710494453
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/65:1.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/65:1.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/65:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}