{
  "chapter": "الطلاق",
  "text": "فاذا بلغن اجلهن فامسكوهن بمعروف او فارقوهن بمعروف واشهدوا۟ ذوى عدل منكم واقيموا۟ الشهدة لله ذلكم يوعظ به من كان يؤمن بالله واليوم الءاخر ومن يتق الله يجعل له مخرجا",
  "translations": [
    {
      "translation": "Then when they have reached the end of their 'idda either retain them with correctness and courtesy or part from them with correctness and courtesy. Call two upright men from among yourselves as witnesses and they should carry out the witnessing for Allah. This is admonishment for all who have iman in Allah and the Last Day. Whoever has taqwa of Allah - He will give him a way out",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they have reached their appointed time, then either keep them lawfully or let them go honourably; but have two witnesses from among you, and give truthful evidence for (being acceptable to) God. This is to warn him who believes in God and the Last Day. God will furnish a way out for him who fears Him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they reach the end of their term (of waiting), then either honourably retain them (in the bond of wedlock) or honourably part with them, and call two persons of known probity as witnesses from among yourselves, and (let these witnesses) give upright testimony for the sake of Allah. That is to what all those that believe in Allah and the Last Day are exhorted. Allah will find a way out for him who fears Allah,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their waiting period is about to end, keep them or separate from them lawfully. Let two just people witness the divorce and let them bear witness for the sake of God. Thus does God command those who have faith in Him and the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they are about to reach their appointed term, hold them back with kindness or separate them with kindness, and make two just men among you as witnesses, and establish the testimony for Allah; with this is advised whoever believes in Allah and the Last Day; and whoever fears Allah – Allah will create for him a way of deliverance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they are about to attain their term appointed, either take them back in a good manner or part with them in a good manner. And take as witness two just persons from among you. And establish the testimony for Allah. That will be an admonition given to him who believes in Allah and the Last Day. And whosoever has Taqwa of Allah, He will make a way for him to get out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they have reached their prescribed time, then retain them with kindness or separate them with kindness, and call to witness two men of justice from among you, and give upright testimony for Allah. With that is admonished he who believes in Allah and the latter day; and whoever is careful of (his duty to) Allah, He will make for him an outlet,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they have reached their term, retain them honourably, or part from them honourably. And call in to witness two men of equity from among yourselves; and perform the witnessing to God Himself. By this then is admonished whosoever believes in God and the Last Day. And whosoever fears God, He will appoint for him a way out,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they have reached their term, take them back in kindness or part from them in kindness, and call to witness two just men among you, and keep your testimony upright for Allah. Whoso believeth in Allah and the Last Day is exhorted to act thus. And whosoever keepeth his duty to Allah, Allah will appoint a way out for him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when their waiting term is ended, either keep them honourably or part with them in honour. Call to witness two reliable men from among you and bear true witness for God. This is an admonishment for those who believe in God and the Last Day. To one who fears God, He will grant a way out [of his difficulties],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they have attained their term, either retain them reputably, or part from them reputably, and take as witnesses two just men from among you, and set up your testimony for Ailah. Thus is exhorted he who believeth in Allah and the Last Day. And whosoever feareth Allah He maketh for him an outlet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they have completed their term, either retain them honourably or separate from them honourably, and take the witness of two honest men from among yourselves, and bear witness for the sake of Allah. Whoever believes in Allah and the Last Day is advised to [comply with] this. Whoever is wary of Allah, He shall make for him a way out [of the adversities of the world and the Hereafter]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus when they fulfil their term appointed, either take them back on equitable terms or part with them on equitable terms; and take for witness two persons from among you, endued with justice, and establish the evidence (as) before Allah. Such is the admonition given to him who believes in Allah and the Last Day. And for those who fear Allah, He (ever) prepares a way out,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they are about to fulfil their term appointed, either take them back in a good manner or part with them in a good manner. And take for witness two just persons from among you (Muslims). And establish the witness for Allah. That will be an admonition given to him who believes in Allah and the Last Day. And whosoever fears Allah and keeps his duty to Him, He will make a way for him to get out (from every difficulty).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they have reached their term, either keep them honorably or part from them honorably. Call two honest men among you to witness and give yourwitnessing before Allah. Whoever believes in Allah and the Last Day is warned to do this. Whosoever fears Allah, He will appoint for him a way out,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Once they have reached their term, either retain them honorably, or separate from them honorably. And call to witness two just people from among you, and give upright testimony for God. By that is exhorted whoever believes in God and the Last Day. And whoever fears God—He will make a way out for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they have [nearly] fulfilled their term, either retain them according to acceptable terms or part with them according to acceptable terms. And bring to witness two just men from among you and establish the testimony for [the acceptance of] Allah. That is instructed to whoever should believe in Allah and the Last day. And whoever fears Allah - He will make for him a way out\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[65:2] Then, when they have reached their term, [when] they are near the end of their prescribed period, retain them, by taking them back, honourably, without coercion, or separate from them honourably, leave them to conclude their waiting period and do not compel them to go back [to you]. And call to witness two just men from among yourselves, [to witness] the retraction or the separation, and bear witness for the sake of God, and not [merely] for the sake of what is being witnessed or for the sake of the man. By this is exhorted whoever believes in God and the Last Day. And whoever fears God, He will make a way out for him, from the distress of this world and the Hereafter;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then, when they have reached their term) when the waiting period is over, before having major ritual ablution, after the end of the third period of menstruation, (take them back in kindness) before they have major ritual ablution after the third period of menstruation, and then they should be treated with kindness (or part from them in kindness) do not prolong their waiting period, and give them all their rights, (and call to witness) both for divorcing them and taking them back (two just men among you) two free, upright, Muslim men, (and keep your testimony upright for Allah) and give your testimony before the judges for Allah's sake. (Whoso believeth in Allah and the Last) resurrection after death (is exhorted) believes (to act thus) i.e. regarding the expenditure, lodgement and delivering testimony. It is said that from the beginning of the surah up to here was revealed about the Prophet (pbuh) when he divorced Hafsah, and also about six prophetic Companions, among whom was Ibn 'Umar, who divorced their wives when they were in their periods, and so Allah forbade them from doing so, because it does not comply with the prophetic practice of divorce, and taught them about the latter. (And whosoever keepeth his duty to Allah) upon committing a transgression and remain steadfast, (Allah will appoint a way out for him) from hardship; it is also said that this means: He will appoint a way out for him from transgression to acts of obedience; it is also said this means: from the Fire into Paradise,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { فَإِذَا بَلَغْنَ } أي: المطلقات { أَجَلَهُنَّ } أي: شارفن على انقضاء عدتهن { فَأَمْسِكُوهُنَّ } وراجعوا إليهن { بِمَعْرُوفٍ } مستحسن عقلاً وشرعاً ومروءةً، نادمين على ما صدر عنكم من الطلاق، محسنين إليهن، معطين لهن من الأمتعة جبراً لما كسرتم { أَوْ فَارِقُوهُنَّ } بعدما لم يبق بينكم وبينهن رابطة المحبة، وعلاقة الألفة { بِمَعْرُوفٍ } مستحسن مرضي لدى الشارع، مقبول عند عموم أرباب المروءات، بلا شرر ولا ضرار، وبلا أخذ شيء مما يتعلق بهن من الأمتعة المنسوبة إليهن عرفاً، بل أعطوهن شيئاً آخر معتداً به؛ ليعترفن بثنائكم وشكركم، ويدعون لكم بدل ما يدعون عليكم\n\n\n\n\n{ وَأَشْهِدُواْ } أيها المؤمنون عند اختيار الرجعة والفرقة { ذَوَىْ عَدْلٍ مِّنكُمْ } قطعاً لعرق الخصومة والنزاع، وبعداً عن التهمة { وَأَقِيمُواْ } أيها الشهود { ٱلشَّهَادَةَ } الموكولة لكم { لِلَّهِ } طلباً لمرضاته سبحانه، وحافظوا عليها؛ كي تؤدوها لدى الحاجة { ذَلِكُمْ } الذي سمعتم من محافظة الحدود، وإقامة الشهود؛ لحفظ الحقوق والعهود من جملة المواعظ والتذكيرات التي وضعها الحق بمقتضى حكمته بين عباده؛ ليحافظوابها آداب العبودية\n\n\n\n\nإنما { يُوعَظُ }  ويتذكر { بِهِ مَن كَانَ يُؤْمِنُ بِٱللَّهِ } ويوقن بوحدة ذاته، ويصدق برسله المبعوثين من عنده، المؤيَّدين من لدنه { وَٱلْيَوْمِ ٱلآخِرِ } المعدّ؛ لتنقيد الأعمال، وترتب الجزاء عليها، فإن غير هؤلاء السعداء الأمناء التائهون في تيه الضلال بأناع الوزر والوبال، لا تتعظون بها وبأمثالها { وَ } بالجملة: { مَن يَتَّقِ ٱللَّهَ } ويتحفظ نفسه عن قهره وغضبه، ويحافظ على رعاية حدوده الموضوعة من لدنه؛ لحفظ حقوق عباده، سيما حقوق الزوجية والائتلاف من كلا الطرفين، ويتوكل عليه في عموم أحواله، ويفوِّض أموره كلها إليه { يَجْعَل لَّهُ } سبحانه { مَخْرَجاً } [الطلاق: 2] عن مضيق الإمكان المورث لأنواع الخذلان والخسران\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإذا بَلَغْنَ أجلَهن } أي: قاربن آخر العِدَّة { فأمْسِكُوهنَّ } راجعوهن { بمعروفٍ } بحُسن معاشرة وإنفاقٍ لائق، { أو فارِقوهنَّ بمعروفٍ } بإعطاء الصداق والإمتاع حين الطلاق، والوفاء بالشروط\n\n\nوالمعنى: فأنتم بالخيار إن شئتم فالرجعة والإمساك بالمعروف، وإن شئتم فترك الرجعة والمفارقة واتّقاء الضرر، وهو أن يُراجعها في آخر عدتها ثم يُطلٍّقها، تطويلاً لعِدتها وتعذيباً لها، { وأَشْهِدوا } عند الرجعة والمفارقة { ذَوَيْ عَدْلٍ منكم } من المسلمين، وهذا الإشهاد مندوب على المشهور لئلا يقع بينهما التجاحد\n وفي قوله: { ذوي عدل } دلالة على أنهم ذكور، فلا تجوز شهادة النساء في النكاح ولا في الطلاق عند الجمهور\n { وأقيموا الشهادةَ للهِ } أيها الشهود عند الحاجة إليها، خالصاً لوجهه تعالى\n { ذٰلكم } إشارة إلى الحث على الإشهاد في الرجعة، أو: إلى جميع ما ذكر، { يُوعظ به مَن كان يؤمن بالله واليوم الآخر } إِذ هو المنتفِع به، والمقصود بتذكيره\n الإشارة: إذا طلقتم الدنيا وحظوظَ نفوسكم فليكن ذلك إلى أجل معلوم، وهو الرسوخ والتمكين بعد الوصول، وأَحْصُوا العدّة: اضبطوا أيام سيركم لئلا تضيع في البطالة أو الفضول، واتقوا ما سوى ربكم أن تلتفتوا إليه، لا تُخرجوا نفوسكم من أشباحها بشِدة مجاهدتها، فإنها مَغرفة السر، ومطيّة السير، نَبَرُّ بها فيما تقوم بها من مآكل وملبس ونُخالف هواها، ولا يَخرجن، إي:ولا تتركوها أن تخرج من عش التربية قبل الترشيد، إلاّ أن تطغى وتفحش، فبالِغ في مجاهدتها بما يقارب موتها، وتلك حدود الله التي حَدّها للسائر، ومَن يتعدَّ شيئاً منها فقد ظلم نفسه، إمّا بتفريط أو إفراط، فصاحب التفريط لا يصل، وصاحب الإفراط لا يدوم، لا تدري أيها السائر لعل اللهَ يُحدث بعد ذلك انقياداً وتسهيلاً، فإذا بلغ أجل الوصول، وحل التمكين، فلا ميزان على النفس، إن شاء أمسك عليها إبقاء، وإن شاء غاب عنهما فناء، وأشهِدوا ذّوّيْ عدل منكم، وهم أهل الفن، فلا يخرج مِن ربقة المجاهدة وعش الإرادة، حتى يشهد له الشيخ أو أهل الفن\n والله تعالى أعلم\n ثم حَضَّ على التقوى التي هي مجمع الخير، فقال: {\n\n\n وَمَن يَتَّقِ ٱللَّهَ يَجْعَل لَّهُ مَخْرَجاً وَيَرْزُقْهُ مِنْ حَيْثُ لاَ يَحْتَسِبُ وَمَن يَتَوَكَّلْ عَلَى ٱللَّهِ فَهُوَ حَسْبُهُ إِنَّ ٱللَّهَ بَالِغُ أَمْرِهِ قَدْ جَعَلَ ٱللَّهُ لِكُلِّ شَيْءٍ قَدْراً }\n يقول الحق جلّ جلاله: { ومَن يَتَّقِ اللهَ } بأن طلَّق للسُنَّة، ولم يُضار بالمعتدّة، ولم يُخرجها من مسكنها، واحتاط في الإشهاد، وغير ذلك، { يجعل له مخرجاً } مما عسى يقع في شأن الأزواج من الغموم والمضائق، ويُفرِّج عنه ما يعتريه من الكروب\n رُوي عن ابن عباس أنه قال لمَن طَلَّق ثلاثاً: \" إنك لم تتق الله، فبانت منك امرأتك \"\n والمختار: أنَّ الآية عامة، أي: ومَن يتق الله في أقواله وأفعاله وأحواله يجعل له مخرجاً من كرب الدنيا والأخرة\n و\n\n \" عن النبي صلى الله عليه وسلم أنه قرأها، فقال: \" مخرجاً من شُبهات الدنيا، ومن غمرات الموت، ومن شدائد يوم القيامة \" \n\n \n\n، قال ابن جزي: وهذا ـ أي العموم ـ أرجح من خمسة أوجه، الأول: حمل اللفظ على عمومه، فيدخل فيه الطلاق وغيره\n والثاني: رُوي: أنها نزلت في\n\n \" عوف بن مالك الأشجعي، وذلك أنه أُسر ولده، وضُيِّق عليه رزقه، فشكا ذلك إلى رسول الله صلى الله عليه وسلم فأمره بالتقوى، وقال له: \" أَكْثِرْ من: لاحَول ولا قوة إلاّ بالله \" فلم يلبث إلاَّ يسيراً، وانطلق ولده، ووسع عليه زرقه \" \n\nوالثالث: أنه رُوي عنه صلى الله عليه وسلم أنه قال:\n\n \" إني لأَعْلمُ آية لو أخذ الناسُ بها لكفتهُم { ومَن يتق الله يجعل له مخرجاً } \" \n\nفما زال يكررها، انظر بقيته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:90",
      "similarity": 0.3900101571698903
    },
    {
      "verse": "2:231",
      "similarity": 0.38582367428823244
    },
    {
      "verse": "4:63",
      "similarity": 0.3523503620062163
    },
    {
      "verse": "3:138",
      "similarity": 0.3187916345867853
    },
    {
      "verse": "4:58",
      "similarity": 0.3096691850348191
    }
  ]
}