{
  "chapter": "الطلاق",
  "text": "فاذا بلغن اجلهن فامسكوهن بمعروف او فارقوهن بمعروف واشهدوا۟ ذوى عدل منكم واقيموا۟ الشهدة لله ذلكم يوعظ به من كان يؤمن بالله واليوم الءاخر ومن يتق الله يجعل له مخرجا",
  "translations": [
    {
      "translation": "Then when they have reached the end of their 'idda either retain them with correctness and courtesy or part from them with correctness and courtesy. Call two upright men from among yourselves as witnesses and they should carry out the witnessing for Allah. This is admonishment for all who have iman in Allah and the Last Day. Whoever has taqwa of Allah - He will give him a way out",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they have reached their appointed time, then either keep them lawfully or let them go honourably; but have two witnesses from among you, and give truthful evidence for (being acceptable to) God. This is to warn him who believes in God and the Last Day. God will furnish a way out for him who fears Him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they reach the end of their term (of waiting), then either honourably retain them (in the bond of wedlock) or honourably part with them, and call two persons of known probity as witnesses from among yourselves, and (let these witnesses) give upright testimony for the sake of Allah. That is to what all those that believe in Allah and the Last Day are exhorted. Allah will find a way out for him who fears Allah,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their waiting period is about to end, keep them or separate from them lawfully. Let two just people witness the divorce and let them bear witness for the sake of God. Thus does God command those who have faith in Him and the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they are about to reach their appointed term, hold them back with kindness or separate them with kindness, and make two just men among you as witnesses, and establish the testimony for Allah; with this is advised whoever believes in Allah and the Last Day; and whoever fears Allah – Allah will create for him a way of deliverance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they are about to attain their term appointed, either take them back in a good manner or part with them in a good manner. And take as witness two just persons from among you. And establish the testimony for Allah. That will be an admonition given to him who believes in Allah and the Last Day. And whosoever has Taqwa of Allah, He will make a way for him to get out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they have reached their prescribed time, then retain them with kindness or separate them with kindness, and call to witness two men of justice from among you, and give upright testimony for Allah. With that is admonished he who believes in Allah and the latter day; and whoever is careful of (his duty to) Allah, He will make for him an outlet,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they have reached their term, retain them honourably, or part from them honourably. And call in to witness two men of equity from among yourselves; and perform the witnessing to God Himself. By this then is admonished whosoever believes in God and the Last Day. And whosoever fears God, He will appoint for him a way out,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they have reached their term, take them back in kindness or part from them in kindness, and call to witness two just men among you, and keep your testimony upright for Allah. Whoso believeth in Allah and the Last Day is exhorted to act thus. And whosoever keepeth his duty to Allah, Allah will appoint a way out for him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when their waiting term is ended, either keep them honourably or part with them in honour. Call to witness two reliable men from among you and bear true witness for God. This is an admonishment for those who believe in God and the Last Day. To one who fears God, He will grant a way out [of his difficulties],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they have attained their term, either retain them reputably, or part from them reputably, and take as witnesses two just men from among you, and set up your testimony for Ailah. Thus is exhorted he who believeth in Allah and the Last Day. And whosoever feareth Allah He maketh for him an outlet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they have completed their term, either retain them honourably or separate from them honourably, and take the witness of two honest men from among yourselves, and bear witness for the sake of Allah. Whoever believes in Allah and the Last Day is advised to [comply with] this. Whoever is wary of Allah, He shall make for him a way out [of the adversities of the world and the Hereafter]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus when they fulfil their term appointed, either take them back on equitable terms or part with them on equitable terms; and take for witness two persons from among you, endued with justice, and establish the evidence (as) before Allah. Such is the admonition given to him who believes in Allah and the Last Day. And for those who fear Allah, He (ever) prepares a way out,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they are about to fulfil their term appointed, either take them back in a good manner or part with them in a good manner. And take for witness two just persons from among you (Muslims). And establish the witness for Allah. That will be an admonition given to him who believes in Allah and the Last Day. And whosoever fears Allah and keeps his duty to Him, He will make a way for him to get out (from every difficulty).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they have reached their term, either keep them honorably or part from them honorably. Call two honest men among you to witness and give yourwitnessing before Allah. Whoever believes in Allah and the Last Day is warned to do this. Whosoever fears Allah, He will appoint for him a way out,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Once they have reached their term, either retain them honorably, or separate from them honorably. And call to witness two just people from among you, and give upright testimony for God. By that is exhorted whoever believes in God and the Last Day. And whoever fears God—He will make a way out for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they have [nearly] fulfilled their term, either retain them according to acceptable terms or part with them according to acceptable terms. And bring to witness two just men from among you and establish the testimony for [the acceptance of] Allah. That is instructed to whoever should believe in Allah and the Last day. And whoever fears Allah - He will make for him a way out\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[65:2] Then, when they have reached their term, [when] they are near the end of their prescribed period, retain them, by taking them back, honourably, without coercion, or separate from them honourably, leave them to conclude their waiting period and do not compel them to go back [to you]. And call to witness two just men from among yourselves, [to witness] the retraction or the separation, and bear witness for the sake of God, and not [merely] for the sake of what is being witnessed or for the sake of the man. By this is exhorted whoever believes in God and the Last Day. And whoever fears God, He will make a way out for him, from the distress of this world and the Hereafter;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَإِذَا بَلَغْنَ أَجَلَهُنَّ فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ أَوْ فَارِقُوهُنَّ بِمَعْرُوفٍ وَأَشْهِدُوا ذَوَيْ عَدْلٍ مِنْكُمْ وَأَقِيمُوا الشَّهَادَةَ لِلَّهِ ذَلِكُمْ يُوعَظُ بِهِ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآَخِرِ وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مَخْرَجًا (2) { فَإِذَا بَلَغْنَ أَجَلَهُنَّ فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ أَوْ فَارِقُوهُنَّ بِمَعْرُوفٍ } .تفريع على جميع ما تقدم من أحكام العدة معطوف على جملة { وأحصوا العدة } \\[ الطلاق : 1 \\] لأن إحصاءها بحفظ مدتها واستيعاب أيامها فإذا انتهت المدة فقد أعذر الله لهما والزيادة عليها إضرار بأحدهما أو بكليهما وفائدة الآجال الوقوف عند انتهائها .وبلوغ الأجل أصله انتهاء المُدة المقدرة له كما يؤذن به معنى البلوغ الذي هو الوصول إلى المطلوب على تشبيه الأجل المعين بالمكان المسير إليه وشاع ذلك في الاستعمال فالمجاز في لفظ الأجل وتبعه المجاز في البلوغ وقد استعمل البلوغ في هذه الآية في مقاربة ذلك الإِنتهاء مبالغة في عدم التسامح فيه وهذا الاستعمال مجاز آخر لمشابهة مقاربة الشيء بالحصول فيه والتلبس به .وقرينة المجاز هنا هو لفظ الأجل لأنه لا تتصور المراجعة بعد بلوغ الأجل لأن في ذلك رفع معنى التأجيل .ومنه قوله تعالى : { وإذا طلقتم النساء فبلغن أجلهن فأمسكوهن بمعروف أو سرحوهن بمعروف } في سورة \\[ البقرة : 231 \\] .والإمساك : اعتزام المراجعة عبر عنه بالإمساك للإيماء إلى أن المطلقة الرجعية لها حكم الزوجة فيما عدا الاستمتاع فكأنه لما راجعها قد أمسكها أن لا تفارقه فكأنه لم يفارقها لأن الإِمساك هو الضن بالشيء وعدم التفريط فيه ومنه قوله تعالى : { أمسك عليك زوجك } \\[ الأحزاب : 37 \\] وأنه إذا لم يراجعها فكأنه قد أعاد فراقها وقسا قلبه .ومن أجل هذه النكتة جعل عدم الإمساك فراقاً جديداً في قوله : { أو فارقوهن بمعروف } .والأمر في { فأمسكوهن } { أو فارقوهن } للإِباحة ، و { أو } فيه للتخيير .والباء في { بمعروف } للملابسة أي ملابسة كل من الإِمساك والفراق للمعروف .والمعروف : هو ما تعارفه الأزواج من حسن المعاملة في المعاشرة وفي الفراق .فالمعروف في الإِمساك : حسن اللقاء والاعتذارُ لها عما فرط والعودُ إلى حسن المعاشرة .والمعروف في الفراق : كف اللسان عن غِيبتها وإظهارِ الاستراحة منها .والمعروف في الحالين من عمل الرَّجل لأنه هو المخاطب بالإِمساك أو الفراق .وأما المعروف الذي هو من عمل المرأة فمقرر من أدلة أخرى كقوله تعالى : { ولهن مثل الذي عليهن بالمعروف } \\[ البقرة : 228 \\] .وتقديم الإِمساك أعني المراجعة على إمضاء المفارقة ، إيماء إلى أنه أرضى لله تعالى وأَوفَقُ بمقاصد الشريعة مع ما تقدم من التعبير عن المراجعة بالإمساك ، ففهم أن المراجعة مندوب إليها لأن أبْغض الحلال إلى الله الطلاق .ولمَّا قيد أمر الإباحة من قوله : { فأمسكوهن } { أو فارقوهن } ، بقيد بالمعروف ، فُهم منه أنّه إن كان إمساك دون المعروف فهو غير مأذون فيه وهو الإمساك الذي كان يفعله أهل الجاهلية أن يطلق الرجل امرأته فإذا قاربت انتهاء عدتها راجعها أياماً ثم طلقها يفعل ذلك ثلاثاً ليطيل عليها من العدة فلا تتزوج عدة أشهر إضراراً بها .وقد تقدم هذا عند قوله تعالى : { وإذا طلقتم النساء فبلغن أجلهن ، إلى قوله : ولا تمسكوهن ضراراً لتعتدوا } في سورة \\[ البقرة : 231 \\] .{ ه4س65ش2ن8/ن11-->بِمَعْرُوفٍ وَأَشْهِدُواْ ذَوَى عَدْلٍ } .ظاهر وقوع هذا الأمر بعد ذكر الإِمساك أو الفراق ، أنه راجع إلى كليهما لأن الإِشهاد جُعل تتمة للمأمور به في معنى الشرط للإِمساك أو الفراق لأن هذا العطف يشبه القيد وإن لم يكن قيداً وشأن الشروط الواردةِ بعد جمل أن تعود إلى جميعها .وظاهر صيغة الأمر الدلالة على الوجوب فيتركب من هذين أن يكون الإِشهاد على المراجعة وعلى بتّ الطلاق واجباً على الأزواج لأن الإِشهاد يرفع أشكالاً من النوازل وهو قول ابن عباس وأخذ به يحيى بن بُكير من المالكية والشافعي في أحد قوليه وابن حنبل في أحد قوليه وروي عن عمران بن حصين وطَاوس وإبراهيم وأبي قلابة وعطاء . وقال الجمهور : الإِشهاد المأمور به الإِشهاد على المراجعة دون بتّ الطلاق .أما مقتضى صيغة الأمر في قوله تعالى : { وأشهدوا ذوي عدل } فقيل هو مستحب وهو قول أبي حنيفة والمشهورُ عن مالك فيما حكاه ابن القصار ولعل مستند هذا القول عدمُ جريان العمل بالتزامه بين المسلمين في عصر الصحابة وعصور أهل العلم ، وقياسه على الإِشهاد بالبيع فإنهم اتفقوا على عدم وجوبه وكلا هذين مدخول لأن دعوى العمل بترك الإِشهاد دونها مَنع ، ولأن قياس الطلاق والرجعة على البيع قد يقدح فيه بوجود فارق معتبر وهو خطر الطلاق والمراجعة وأهمية ما يترتب عليهما من الخصومات بين الأنساب ، وما في البيوعات مما يغني عن الإِشهاد وهو التقايض في الأعواض . وقيل الأمر للوجوب المراجعة دون الفرقة وهو أحد قولي الشافعي وأحمد ونسبه إسماعيل بن حماد من فقهاء المالكية ببغداد إلى مالك وهو ظاهر مذهب ابنِ بكير .واتفق الجميع على أن هذا الإِشهاد ليس شرطاً في صحة المراجعة أو المفارقة لأنه إنما شرع احتياطاً لحقهما وتجنباً لنوازل الخصومات خوفاً من أن يموت فتدعي أنها زوجة لم تطلق ، أو أن تموت هي فيدعي هو ذلك ، وكأنهم بنوه على أن الأمر لا يقتضي الفور ، على أن جعل الشيء شرطاً لغيره يحتاج إلى دليل خاص غير دليل الوجوب لأنه قد يتحقق الإثم بتركه ولا يبطل بتركه ما أمر بإيقاعه معه مثل الصلاة في الأرض المغصوبة ، وبالثوب المغصوب . قال الموجبون للإِشهاد : لو راجع ولم يشهد أو بتّ الفراق ولم يشهد صحت مراجعته ومفارقته وعليه أن يشهد بعد ذلك .قال يحيى بن بكير : معنى الإشهاد على المراجعة والمفارقة أن يشهد عند مراجعتها إنْ راجعها ، وعند انقضاء عدتها إن لم يراجعها أنه قد كان طلقها وأن عدتها قد انقضت .ولفقهاء الأمصار في صفة ما تقع المراجعة من صيغة بالقول ومن فعل ما هو من أفعال الأزواج ، تفاصيل محلها كتب الفروع ولا يتعلق بالآية إلا ما جعله أهل العلم دليلاً على المراجعة عند من جعله كذلك .{ مِّنكُمْ وَأَقِيمُواْ الشهادة } .عطف على { وأشهدوا ذوي عدل منكم } .والخطاب موجه لكل من تتعلق به الشهادة من المشهود عليهم والشهود كلٌ يأخذ بما هو حظه من هذين الخطابين . وليس هو من قبيل { يوسف أعرض عن هذا واستغفري لذنبكِ } \\[ يوسف : 29 \\] لظهور التوزيع هناك باللفظ دون ما هنا فإنه بالمعنى فالكل مأمورون بإقامة الشهادة .فتعريف الشهادة للاستغراق ، أي كل شهادة وهو استغراق عرفي لأن المأمور به الشهادة الشرعية .ومعنى إقامة الشهادة : إيقاعها مستقيمة لا عوج فيها فالإقامة مستعارة لإيقاع الشهادة على مستوفيها ما يجب فيها شرعاً مما دلت عليه أدلة الشريعة وهذه استعارة شائعة وتقدم عند قوله تعالى : { وأقوم للشهادة } في سورة \\[ البقرة : 282 \\] .وقوله : { لله } ، أي لأجل الله وامتثال أمره لا لأجل المشهود له ولا لأجل المشهود عليه ولا لأجل منفعة الشاهد والإبقاء على راحته . وتقدم بعض هذا عند قوله تعالى : { ولا يأب الشهداء إذا ما دعوا } في سورة \\[ البقرة : 282 \\] .{ ه4س65ش2ن15/ن23-->لِلَّهِ ذَلِكُمْ يُوعَظُ بِهِ مَن كَانَ يُؤْمِنُ بالله واليوم } .الإِشارة إلى جميع ما تقدم من الأحكام التي فيها موعظة للمسلمين من قوله : { وأحصوا العدة واتقوا الله ربكم } \\[ الطلاق : 1 \\] ، إلى قوله : { وأقيموا الشهادة لله } .والوعظ : التحذير مما يضر والتذكير المليّن للقلوب وقد تقدم عند قوله تعالى : { ذلك يوعظ به من كان منكم يؤمن بالله } في سورة \\[ البقرة : 232 \\] وعند قوله تعالى : { يعظكم الله أن تعودوا لمثله } في سورة \\[ النور : 17 \\] .الاخر وَمَن يَتَّقِ الله يَجْعَل لَّهُ } { مَخْرَجاً \\* وَيَرْزُقْهُ مِنْ حَيْثُ لاَ يَحْتَسِبُ وَمَن يَتَوَكَّلْ عَلَى الله فَهُوَ حَسْبُهُ إِنَّ الله بالغ أَمْرِهِ قَدْ جَعَلَ الله لِكُلِّ شَىْءٍ قَدْراً } .اعتراض بين جملة { وأقيموا الشهادة } وجملة { واللائي يئسن من المحيض } \\[ الطلاق : 4 \\] الآية ، فإن تلك الأحكام لما اعتبرت موعظة بقوله : { ذلكم يوعظ به من كان يؤمن بالله واليوم الآخر } أعقب ذلك بقضيّة عامة ، وهي أن تلك من تقوى الله تعالى وبما لتقوى الله من خير في الدنيا والآخرة على عادة القرآن من تعقيب الموعظة والترهيب بالبشارة والترغيب .ولمّا كان أمر الطلاق غير خال من حرج وغم يعرض للزوجين وأمر المراجعة لا يخلو في بعض أحواله من تحمل أحدهما لبعض الكره من الأحوال التي سببت الطلاق ، أعلمهما الله بأنه وعد المتقين الواقفين عند حدوده بأن يجعل لهم مخرجاً من الضائقات ، شبه ما هم فيه من الحرج بالمكان المغلق على الحالّ فيه وشبه ما يمنحهم الله به من اللطف وإجراء الأمور على ما يلائم أحوالهم بجعللِ منفذ في المكان المغلق يتخلص منه المتضائق فيه .ففي الكلام استعارة أن إحداهما ضمنية مطوية والأخرى صريحة وشمل المَخْرَج ما يحف من اللطف بالمتقين في الآخرة أيضاً بتخليصهم من أهوال الحساب والانتظار فالمخرج لهم في الآخرة هو الإِسراع بهم إلى النعيم .ولما كان من دواعي الفراق والخلاف بين الزوجين ما هو من التقتير في الإِنفاق لضيق ذات اليد فكان الإحجام عن المراجعة عارضاً كثيراً للناس بعد التطليق ، أُتبع الوعد بجعل المخرَج للمتقين بالوعد بمخرج خاص وهو مخرج التوسعة في الرزق .وقوله : { من حيث لا يحتسب } احتراس لئلا يتوهَّم أحد أن طرق الرزق معطلة عليه فيستبعد ذلك فيمسك عن مراجعة المطلقة لأنه لا يستقبل مالاً ينفق منه ، فأعلمه الله أن هذا الرزق لطف من الله والله أعلم كيف يهيىء له أسباباً غير مرتقبة .فمعنى { من حيث لا يحتسب } : من مكان لا يحتسب منه الرزق أي لا يظن أنه يرزق منه .و { حيثُ } مستعملة مجازاً في الأحوال والوجوه تشبيهاً للأحوال بالجهات لأنها لما جعلت مقارنة للرزق أشبهت المكان الذي يَرِد منه الوارد ولذلك كانت { مِن } هنا للابتداء المجازي تبعاً لاستعارة { حيث } . ففي حرف { مِن } استعارة تبعية . وذكر الواحدي في «أسباب النزول» أنها نزلت في شأن عوف بن مالك الأشجعي إذْ أسَرَ المشركون ابنه سالماً فأتى عوف النبي صلى الله عليه وسلم وشكا إليه ذلك وأن أمه جزعت فقال له رسول الله صلى الله عليه وسلم «اتق الله واصبر» وأمره وزوجَه أن يكثرا قولاً : لا حول ولا قوة إلا بالله فغفل المشركون عن الابن فَسَاقَ عنزاً كثيرة من عنز المشركين وجاء بها المدينة فنزلت الآية ، فيجوز أن يكون نزولها في أثناء نزول هذه السورة فصادفت الغرضين ، ويكون ذلك من قبيل معجزات القرآن .{ يَحْتَسِبُ وَمَن يَتَوَكَّلْ عَلَى الله فَهُوَ حَسْبُهُ إِنَّ الله بالغ } .تكملة للتي قبلها فإن تقوى الله سبب تفريج الكُرَب والخَلاص من المضائق ، وملاحظةُ المسلم ذلك ويقينُه بأن الله يدفع عنه ما يخطر بباله من الخواطر الشيطانية التي تثبطه عن التقوى يحقق وعد الله إياه بأن يجعل له مخرجاً ويرزقَه من حيث لا يحتسب .وَحَسْب : وصف بمعنى كاففٍ . وأصله اسم مصدر أو مصدر .وجملة { إن الله بالغ أمره } في موضع العلة لجملة { ومن يتوكل على الله فهو حسبه } ، أي لا تستبعدوا وقوع ما وعدكم الله حين ترون أسباب ذلك مفقودة فإن الله إذا وعد وعداً فقد أراده وإذا أراد الله أمراً يسَّر أسبابه .ولعل قوله : { قد جعل الله لكل شيء قدراً } إشارة إلى هذا المعنى ، أي علم الله أن يكفي من يتوكل عليه مهمّة فقدّر لذلك أسبابه كما قدّر أسباب الأشياء كلها فلا تشُكّوا في إنجاز وَعده فإنه إذا أراد أمراً يسّر أسبابه من حيث لا يحتسب الناس وتصاريف الله تعالى خفية عجيبة .ومعنى { بالغ أمره } : واصلٌ إلى مراده . والبلوغ مجاز مشهور في الحصول على المراد . والأمر هنا بمعنى الشأن .وعن عبد الله بن رافع لما نزل قوله تعالى : { ومن يتوكل على الله فهو حسبه } قال أصحاب النبي صلى الله عليه وسلم ( أي بعضهم ) : فنحن إذا توكلنا نرسل ما كان لنا ولا نحفظه فنزلت { إن الله بالغ أمره } ، أي فيكم وعليكم اه .وقرأ الجمهور { بالغٌ } بالتنوين و { أمرَه } بالنصب . وقرأه حفص عن عاصم { بالغُ أمرهِ } بإضافة { بالغ } إلى { أمره } .{ أَمْرِهِ قَدْ جَعَلَ الله لِكُلِّ شَىْءٍ } .لهذه الجملة موقع تتجلى فيه صورة من صور إعجاز القرآن في ترتيب مواقع الجمل بعضها بعد بعض كما نبهت عليه في مواقع سلفت . فهذه الجملة لها موْقع الاستئناف البياني ناشىء عما اشتملت عليه جمل { ومن يتق الله يجعل له مخرجاً } ، إلى قوله : { إن الله بالغ أمره } لأن استعداد السامعين لليقين بما تضمنته تلك الجمل متفاوت فقد يستبعد بعض السامعين تحقق الوعد لأمثاله بما تضمنته تلك الجمل بعرضها على ارتباك أحْواله ، أو يتردد يقينه فيقول : أين أنا من تحصيل هذا ، حين يُتبع نظره فيرى بَوْنا عن حصول الموعود بسبب انعدام وسائله لديه فيتملكه اليأس .فهذا الاستئناف البياني وقع عقب الوعد تذكيراً بأن الله علم مواعيده وهيأ لها مقادير حصولها لأنه جعل لكل شيء قدراً .ولها موقع التعليل لجملة { وأحصوا العدة } \\[ الطلاق : 1 \\] فإن العِدة من الأشياء فلما أمر الله بإحصاء أمرها عَلّل ذلك بأن تقدير مدة العدة جعله الله ، فلا يسوغ التهاون فيه . ولهذا موقع التذييل لجملة { وتلك حدود الله ومن يتعد حدود الله فقد ظلم نفسه } \\[ الطلاق : 1 \\] ، أي الذي وضع تلك الحدود قد جعل لكل شيء قدراً لا يعدوه كما جعل الحدود .ولها موقع التعليل لجملة { فإذا بلغن أجلهن فأمسكوهن بمعروف أو فارقوهن بمعروف } ، لأن المعنى إذا بلغن القَدْر الذي جعله الله لمدة العدة فقد حصل المقصد الشرعي الذي أشار إليه قوله تعالى : { لا تدري لعل الله يحدث بعد ذلك أمراً } \\[ الطلاق : 1 \\] فالمعنى : فإن لم يُحدث الله أمر المراجعة فقد رفق بكم وحطّ عنكم امتداد العدة .ولها موقع التعليل لجملة { وأقيموا الشهادة لله } فإن الله جعل الشهادة قدراً لرفع النزاع .فهذه الجملة جُزء آية وهي تحتوي على حقائق من الحكمة .ومعنى { لكل شيء } لكل موجود ، أي لكل حادث فالشيء الموجود سواء كان ذاتاً أو معنى من المعاني قال تعالى : { وكل شيء فعلوه في الزبر } \\[ القمر : 52 \\] . فعموم قوله : { لكل شيء } صريح في أن ما وعد الله به يَجعل له حين تكوينه قَدْراً .قال الراغب في «مفرداته» : وذلك أن فعل الله ضربان : ضرب أوجده بالفعل ، ومعنى إيجاده بالفعل أنه أبدعه كاملاً دفعة لا تعتريه الزيادة والنقصان إلى أن يشاء أن يغنيه أو يبدله كالسماوات وما فيها . ومنها ما جعل أصوله موجودة بالفعل وأجزاءَه بالصلاحية وقدَّره على وجه لا يتأتى منه غير ما قدره فيه كتقديره في النواة أن ينبت منها النخل دون أن ينبت منها تفاح أو زيتون .وتقديره نطفة الإِنسان لأن يكون منها إنسان دون حيوان آخر . فتقدير الله على وجهين : أحدهما بالحُكم منه أن يَكون كذا أو لا يكون ، كذا إما على سبيل الوجوب وإما على سبيل الإِمكان . وعلى ذلك قوله : { قد جعل الله لكل شيء قدراً } . والثاني بإعطاء القدرة عليه ، وعلى ذلك قوله : { فقدرنا فنعم القادرون } \\[ المرسلات : 23 \\]\n\n",
      "translations": [
        {
          "translation": "(Then, when they have reached their term) when the waiting period is over, before having major ritual ablution, after the end of the third period of menstruation, (take them back in kindness) before they have major ritual ablution after the third period of menstruation, and then they should be treated with kindness (or part from them in kindness) do not prolong their waiting period, and give them all their rights, (and call to witness) both for divorcing them and taking them back (two just men among you) two free, upright, Muslim men, (and keep your testimony upright for Allah) and give your testimony before the judges for Allah's sake. (Whoso believeth in Allah and the Last) resurrection after death (is exhorted) believes (to act thus) i.e. regarding the expenditure, lodgement and delivering testimony. It is said that from the beginning of the surah up to here was revealed about the Prophet (pbuh) when he divorced Hafsah, and also about six prophetic Companions, among whom was Ibn 'Umar, who divorced their wives when they were in their periods, and so Allah forbade them from doing so, because it does not comply with the prophetic practice of divorce, and taught them about the latter. (And whosoever keepeth his duty to Allah) upon committing a transgression and remain steadfast, (Allah will appoint a way out for him) from hardship; it is also said that this means: He will appoint a way out for him from transgression to acts of obedience; it is also said this means: from the Fire into Paradise,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { فَإِذَا بَلَغْنَ } أي: المطلقات { أَجَلَهُنَّ } أي: شارفن على انقضاء عدتهن { فَأَمْسِكُوهُنَّ } وراجعوا إليهن { بِمَعْرُوفٍ } مستحسن عقلاً وشرعاً ومروءةً\n نادمين على ما صدر عنكم من الطلاق\n محسنين إليهن\n معطين لهن من الأمتعة جبراً لما كسرتم { أَوْ فَارِقُوهُنَّ } بعدما لم يبق بينكم وبينهن رابطة المحبة\n وعلاقة الألفة { بِمَعْرُوفٍ } مستحسن مرضي لدى الشارع\n مقبول عند عموم أرباب المروءات\n بلا شرر ولا ضرار\n وبلا أخذ شيء مما يتعلق بهن من الأمتعة المنسوبة إليهن عرفاً\n بل أعطوهن شيئاً آخر معتداً به\n ليعترفن بثنائكم وشكركم\n ويدعون لكم بدل ما يدعون عليكم\n\n\n{ وَأَشْهِدُواْ } أيها المؤمنون عند اختيار الرجعة والفرقة { ذَوَىْ عَدْلٍ مِّنكُمْ } قطعاً لعرق الخصومة والنزاع\n وبعداً عن التهمة { وَأَقِيمُواْ } أيها الشهود { ٱلشَّهَادَةَ } الموكولة لكم { لِلَّهِ } طلباً لمرضاته سبحانه\n وحافظوا عليها\n كي تؤدوها لدى الحاجة { ذَلِكُمْ } الذي سمعتم من محافظة الحدود\n وإقامة الشهود\n لحفظ الحقوق والعهود من جملة المواعظ والتذكيرات التي وضعها الحق بمقتضى حكمته بين عباده\n ليحافظوابها آداب العبودية\n\n\nإنما { يُوعَظُ }  ويتذكر { بِهِ مَن كَانَ يُؤْمِنُ بِٱللَّهِ } ويوقن بوحدة ذاته\n ويصدق برسله المبعوثين من عنده\n المؤيَّدين من لدنه { وَٱلْيَوْمِ ٱلآخِرِ } المعدّ\n لتنقيد الأعمال\n وترتب الجزاء عليها\n فإن غير هؤلاء السعداء الأمناء التائهون في تيه الضلال بأناع الوزر والوبال\n لا تتعظون بها وبأمثالها { وَ } بالجملة: { مَن يَتَّقِ ٱللَّهَ } ويتحفظ نفسه عن قهره وغضبه\n ويحافظ على رعاية حدوده الموضوعة من لدنه\n لحفظ حقوق عباده\n سيما حقوق الزوجية والائتلاف من كلا الطرفين\n ويتوكل عليه في عموم أحواله\n ويفوِّض أموره كلها إليه { يَجْعَل لَّهُ } سبحانه { مَخْرَجاً } [الطلاق: 2] عن مضيق الإمكان المورث لأنواع الخذلان والخسران\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإذا بَلَغْنَ أجلَهن } أي: قاربن آخر العِدَّة { فأمْسِكُوهنَّ } راجعوهن { بمعروفٍ } بحُسن معاشرة وإنفاقٍ لائق\n { أو فارِقوهنَّ بمعروفٍ } بإعطاء الصداق والإمتاع حين الطلاق\n والوفاء بالشروط\n\nوالمعنى: فأنتم بالخيار إن شئتم فالرجعة والإمساك بالمعروف\n وإن شئتم فترك الرجعة والمفارقة واتّقاء الضرر\n وهو أن يُراجعها في آخر عدتها ثم يُطلٍّقها\n تطويلاً لعِدتها وتعذيباً لها\n { وأَشْهِدوا } عند الرجعة والمفارقة { ذَوَيْ عَدْلٍ منكم } من المسلمين\n وهذا الإشهاد مندوب على المشهور لئلا يقع بينهما التجاحد\n وفي قوله: { ذوي عدل } دلالة على أنهم ذكور\n فلا تجوز شهادة النساء في النكاح ولا في الطلاق عند الجمهور\n { وأقيموا الشهادةَ للهِ } أيها الشهود عند الحاجة إليها\n خالصاً لوجهه تعالى\n { ذٰلكم } إشارة إلى الحث على الإشهاد في الرجعة\n أو: إلى جميع ما ذكر\n { يُوعظ به مَن كان يؤمن بالله واليوم الآخر } إِذ هو المنتفِع به\n والمقصود بتذكيره\n الإشارة: إذا طلقتم الدنيا وحظوظَ نفوسكم فليكن ذلك إلى أجل معلوم\n وهو الرسوخ والتمكين بعد الوصول\n وأَحْصُوا العدّة: اضبطوا أيام سيركم لئلا تضيع في البطالة أو الفضول\n واتقوا ما سوى ربكم أن تلتفتوا إليه\n لا تُخرجوا نفوسكم من أشباحها بشِدة مجاهدتها\n فإنها مَغرفة السر\n ومطيّة السير\n نَبَرُّ بها فيما تقوم بها من مآكل وملبس ونُخالف هواها\n ولا يَخرجن\n إي:ولا تتركوها أن تخرج من عش التربية قبل الترشيد\n إلاّ أن تطغى وتفحش\n فبالِغ في مجاهدتها بما يقارب موتها\n وتلك حدود الله التي حَدّها للسائر\n ومَن يتعدَّ شيئاً منها فقد ظلم نفسه\n إمّا بتفريط أو إفراط\n فصاحب التفريط لا يصل\n وصاحب الإفراط لا يدوم\n لا تدري أيها السائر لعل اللهَ يُحدث بعد ذلك انقياداً وتسهيلاً\n فإذا بلغ أجل الوصول\n وحل التمكين\n فلا ميزان على النفس\n إن شاء أمسك عليها إبقاء\n وإن شاء غاب عنهما فناء\n وأشهِدوا ذّوّيْ عدل منكم\n وهم أهل الفن\n فلا يخرج مِن ربقة المجاهدة وعش الإرادة\n حتى يشهد له الشيخ أو أهل الفن\n والله تعالى أعلم\n ثم حَضَّ على التقوى التي هي مجمع الخير\n فقال: {\n\n\n وَمَن يَتَّقِ ٱللَّهَ يَجْعَل لَّهُ مَخْرَجاً وَيَرْزُقْهُ مِنْ حَيْثُ لاَ يَحْتَسِبُ وَمَن يَتَوَكَّلْ عَلَى ٱللَّهِ فَهُوَ حَسْبُهُ إِنَّ ٱللَّهَ بَالِغُ أَمْرِهِ قَدْ جَعَلَ ٱللَّهُ لِكُلِّ شَيْءٍ قَدْراً }\n يقول الحق جلّ جلاله: { ومَن يَتَّقِ اللهَ } بأن طلَّق للسُنَّة\n ولم يُضار بالمعتدّة\n ولم يُخرجها من مسكنها\n واحتاط في الإشهاد\n وغير ذلك\n { يجعل له مخرجاً } مما عسى يقع في شأن الأزواج من الغموم والمضائق\n ويُفرِّج عنه ما يعتريه من الكروب\n رُوي عن ابن عباس أنه قال لمَن طَلَّق ثلاثاً: \" إنك لم تتق الله\n فبانت منك امرأتك \"\n والمختار: أنَّ الآية عامة\n أي: ومَن يتق الله في أقواله وأفعاله وأحواله يجعل له مخرجاً من كرب الدنيا والأخرة\n و\n \" عن النبي صلى الله عليه وسلم أنه قرأها\n فقال: \" مخرجاً من شُبهات الدنيا\n ومن غمرات الموت\n ومن شدائد يوم القيامة \" \n \n\n قال ابن جزي: وهذا ـ أي العموم ـ أرجح من خمسة أوجه\n الأول: حمل اللفظ على عمومه\n فيدخل فيه الطلاق وغيره\n والثاني: رُوي: أنها نزلت في\n \" عوف بن مالك الأشجعي\n وذلك أنه أُسر ولده\n وضُيِّق عليه رزقه\n فشكا ذلك إلى رسول الله صلى الله عليه وسلم فأمره بالتقوى\n وقال له: \" أَكْثِرْ من: لاحَول ولا قوة إلاّ بالله \" فلم يلبث إلاَّ يسيراً\n وانطلق ولده\n ووسع عليه زرقه \" \nوالثالث: أنه رُوي عنه صلى الله عليه وسلم أنه قال:\n \" إني لأَعْلمُ آية لو أخذ الناسُ بها لكفتهُم { ومَن يتق الله يجعل له مخرجاً } \" \nفما زال يكررها\n انظر بقيته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:90",
      "similarity": 0.3900101571698903
    },
    {
      "verse": "2:231",
      "similarity": 0.38582367428823244
    },
    {
      "verse": "4:63",
      "similarity": 0.3523503620062163
    },
    {
      "verse": "3:138",
      "similarity": 0.3187916345867853
    },
    {
      "verse": "4:58",
      "similarity": 0.3096691850348191
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/065002.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/065002.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/65:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}