{
  "chapter": "الطلاق",
  "text": "ويرزقه من حيث لا يحتسب ومن يتوكل على الله فهو حسبه ان الله بلغ امره قد جعل الله لكل شىء قدرا",
  "translations": [
    {
      "translation": "and provide for him from where he does not expect. Whoever puts his trust in Allah - He will be enough for him. Allah always achieves His aim. Allah has appointed a measure for all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And provide for him from where he does not reckon. God is sufficient for him who places his trust in Him. Certainly God fulfills His purpose. God has indeed fixed a measure of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and will provide him sustenance from whence he never even imagined. Whoever puts his trust in Allah, He shall suffice him. Surely Allah brings about what He decrees; Allah has set a measure for everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will make a way (out of difficulty) for one who has fear of Him and will provide him with sustenance in a way that he will not even notice. God is Sufficient for the needs of whoever trusts in Him. He has full access to whatever He wants. He has prescribed a due measure for everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And will provide him sustenance from a place he had never expected; and whoever relies on Allah – then Allah is Sufficient for him; indeed Allah will accomplish His command; indeed Allah has set a proper measure for all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He will provide him from where he never could imagine. And whosoever puts his trust in Allah, then He will suffice him. Verily, Allah will accomplish his purpose. Indeed Allah has set a measure for all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give him sustenance from whence he thinks not; and whoever trusts in Allah, He is sufficient for him; surely Allah attains His purpose; Allah indeed has appointed a measure for everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and He will provide for him from whence he never reckoned. And whosoever puts his trust in God, He shall suffice him. God attains his purpose. God has appointed a measure for everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And will provide for him from (a quarter) whence he hath no expectation. And whosoever putteth his trust in Allah, He will suffice him. Lo! Allah bringeth His command to pass. Allah hath set a measure for all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and God will provide for him from an unexpected source; God suffices for anyone who puts his trust in Him. God will surely bring about what He decrees. He has set a measure for all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He provideth for him from whence he reckoneth not upon. And whosoever putteth his trust in Allah He will suffice him. Verily Allah is sure to attain His purpose, and Allah hath appointed Unto everything a measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and provide for him from whence he does not count upon. And whoever puts his trust in Allah, He will suffice him. Indeed Allah carries through His commands. Certainly, Allah has ordained a measure [and extent] for everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He provides for him from (sources) he never could imagine. And if any one puts his trust in Allah, sufficient is (Allah) for him. For Allah will surely accomplish his purpose: verily, for all things has Allah appointed a due proportion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He will provide him from (sources) he never could imagine. And whosoever puts his trust in Allah, then He will suffice him. Verily, Allah will accomplish his purpose. Indeed Allah has set a measure for all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and provide for him from where he does not expect, Allah is Sufficient for whosoever puts his trust in Him. Indeed, Allah brings about whatever He decrees. Allah has set a measure for all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And will provide for him from where he never expected. Whoever relies on God—He will suffice him. God will accomplish His purpose. God has set a measure to all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And will provide for him from where he does not expect. And whoever relies upon Allah - then He is sufficient for him. Indeed, Allah will accomplish His purpose. Allah has already set for everything a [decreed] extent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[65:3]   and He will provide for him from whence he never expected, [from whence] it never occurred to him. And whoever puts his trust in God, regarding his affairs, He will suffice him. Indeed God fulfils His command, His will (a variant reading [for bālighun amrahu] has the genitive construction [bālighu amrihi]). Verily God has ordained for everything, [even things] such as comfort and hardship, a measure, a fixed time.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And will provide for him from (a quarter) whence he hath no expectation) this was revealed about 'Awf Ibn Malik al-Ashja'i whose son was captured by the enemy, and who returned later on to his family bringing with him many camels. (And whosoever putteth his trust in Allah) and whoever relies on Allah regarding provision, (He will suffice him. Lo! Allah bringeth His command to pass) His command and decree will come to pass in times of both comfort and hardship; it is also said this means: His command and providence will come to pass. (Allah hath set a measure) an appointed term (for all things) for both comfort and hardship. When Allah explained the waiting period of women who are divorced, Mu'adh stood up and said: \"0 Messenger of Allah! What is the waiting period for those women who despair of menstruation?\"\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قَدْ جَعَلَ ٱللَّهُ لِكُلِّ شَيْءٍ قَدْراً } معناه مُنتهى\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High - {Indeed, Allah has set a measure for everything} means: an end.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ومن يتقيه في وجوده والتنزه عنه يجعل له مخرجاً من ضيق أنائيته إلى فسحة الوجود المطلق ويرزقه الوجود الموهوب من حيث لا يحتسب ولا يخطر بباله { ومن يتوكل على الله } بقطع النظر عن الوسائل والانقطاع إليه من الوسايط { فهو حسبه } كافيه يوصل إليه ما قدّر له ويسوق إليه ما قسم لأجله من أنصبة الدنيا والآخرة { إن الله بالغ أمره } أي: يبلغ ما أراد من أمره لا مانع له ولا عائق\n فمن تيقن ذلك ما خاف أحداً ولا رجاء\n وفوّض أمره إليه ونجا { قد جعل الله لكل شيء قدراً } أي: عين لكل أمر حدّاً معيناً ووقتاً معيناً في الأزل لا يزيد بسعي ساع ولا ينقص بمنع مانع وتقصير مقصِّر ولا يتأخر عن وقته ولا يتقدّم عليه\n والمتيقن لهذا الشاهد له متوكل بالحقيقة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَيَرْزُقْهُ } ويسوق إليه جميع حوائجه المحتاجة إليه في معاش عياله { مِنْ حَيْثُ لاَ يَحْتَسِبُ } أي: من مكان لا يترقبه\n ولا ينتظره { وَ } كيف لا { مَن يَتَوَكَّلْ عَلَى ٱللَّهِ } مخلصاً له\n مفوضاً أمره إليه { فَهُوَ حَسْبُهُ } وكافيه\n يكفيه جميع المؤنة المحتاجة إليه في النشأة الأولى والأخرى؟! وكيف لا { إِنَّ ٱللَّهَ } القادر المقتدر على عموم المقادير { بَالِغُ أَمْرِهِ } بعدما فوَّض إليه سبحانه بالإخلاص والتسليم إلى حد قدَّر الله له في حضرة علمه\n ولوح قضائه\n إذ { قَدْ جَعَلَ ٱللَّهُ } القدير الحكيم { لِكُلِّ شَيْءٍ } من الأشياء الظاهرة حسب أظلال الأسماء والصفات الإليهة { قَدْراً } [الطلاق: 3] أي: مقداراً معيناً من الكمال في عموم أفعاله وأحواله على مقتضى الاستعدادات الفطرية\n والقابلية الجبلية؟!",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ويَرْزُقه من حيثُ لا يحتسب } أي: من وجوه لاتخطر بباله ولا بحسبه\n { ومَن يتوكل على الله } أي: يكل أمرَه إليه من غير تعلُّق بغير\n ولا تدبير نفس\n { فهو حَسْبُه } كافيه في جميع أموره\n { إِنَّ اللهَ بالغُ أَمْرِه } \n بالإضافة في قراءة حفص\n أي: منفذاً أمره\n وبالتنوين والنصب عند غيره\n أي: مبلغ ما يريد\n لا يفوته مُراد\n ولا يعجزه مطلوب\n { قد جعل اللهُ لكل شيءٍ قَدْراً } تقديراً\n أو توقيتاً\n أو مقداراً معلوماً ووقتاً محدوداً\n لا يتقدمه ولا يتأخر عنه\n وهذا حث على التوكل وترغيب فيه\n لأنَّ العبد إذا عَلِمَ أنَّ الأمور كلها بيد الله\n من الرزق وغيره وأنَّ لها وقتاً محدوداً لا يُجاوزه\n توكل عليه\n وانجمع بكليته عليه\n ولم يبقَ له إلاّ التسليم للقدَر السابق\n قال ابن عطية: في الآية حض على التوكل\n أي: لا بد من نفوذ أمر الله تعالى\n توكلتَ أيها المرء أم لم تتوكل\n فإنْ توكلتَ على الله كفاك\n وتعجّلت الراحة والبركة\n وإن لم تتوكل وَكَلَك إلى جحدك وتسخُّطك\n وأمره نافذ في الوجهين\n هـ\n الإشارة: ومَن يتق الله التقوى الكاملة\n يجعل له من كمل مُشْكل وشُبهة ومتشابه مَخرجاً\n فيَنحلّ له كل ما أشكل على الناس في أمر الدين والدنيا\n ويرزقه من العلوم والأسرار والمعارف\n ما لا يخطر على بال\n من حيث لا يحتسب\n من غير تعلُّم ولا مدارسة\n وقال القشيري: إذا صَدَقَ العبدُ في تقواه أخرجه من أشغاله\n كالشعرة من العجين\n لا يتعلق بها شيء\n يضرب على المتقِي سرادقات عنايته\n ويُدخله في كنف الإيواء ويصرف الأشغال\n عن قلبه\n ويُخرجه عن تدبيره\n ويُجرده عن كل شغل\n ويكفيه كل أمر\n وينقله إلى شهود قضاء تقديره\n هـ\n وقال الشيخ أبو الحسن الشاذلي رضي الله عنه في هذه التقوى: أن تكون ظاهرة وباطنة\n ظاهرة من المعاصي\n وباطنة من المساوىء والدعاوى\n أمّا مَن طهَّر ظاهره من المعاصي\n وسَدّ الأُفق بالدعاوى وإضافة التدبير والاختيار لنفسه\n فلا يقوم خيره بِشَرِّه\n أي: فلا يدخل في الآية\n ثم قال: إلاّ مَن وَطَّن نفسه على الأرياح إلى أيّ وجهة تقلب\n أي: دار مع رياح الأقدار حيث دارت\n ولم يسكن إلى شيء\n وكان ممن قال اللهُ فيه:\n\n[السجدة:16]\n أتراه منع جنوبَهم من مضاجع النوم\n وترك قلوبهم مضجعة وساكنة لغيره\n بل رفع قلوبهم عن كل شيء\n ولا يضاجِعُون أسرارهم شيئاً\n فافهم هذا المعنى\n تتجافى جُنوبهم عن مضاجعة الاختيار ومنازعة الأقدار\n يدعون ربهم خوفاً وطمعاً\n فالخوف قَطَعَهم عن غيره\n وبالشوق إليه أطمعهم فيه\n ومما رزقناهنم ينفقون\n هـ\n مختصراً\n وقوله تعالى: { ويَرْزُقه من حيثُ لا يحتسبُ } قال في الحاشية الفاسية: أي: يرزقه المقدَّر في الأزل من حيث لا مشقة عليه في وصوله إليه\n فيأكل ويلبس من غير انتظار\n ولا استشراف نفس\n ولا تعب\n فيخرج له من الغيب بالبديهة ما يكفيه عن السؤال\n ومَن عَرَف اللهَ عَرَفه بكمال قدرته وإحاطة علمه بكل ذرة\n فيلقي زمام الاختيار إليه\n فيكفيه كل مؤنه في الدنيا والآخرة\n وهو السميع العليم\n وقد قال سهل: التقوى: التبري من الحول والقوة\n هـ\n وقوله تعالى: { ومَن يتوكل على الله فهو حَسْبه } قال القشيري: فالله حاسبه\n أي: كافيه\n { إِنَّ اللهَ بالغُ أَمْرِه } \n إذا سَبَقَ له شيءٌ من التقدير\n فلا محالةَ يكون\n وفي التوكل لا يتغير المقدور ولا يتأخر\n ولكنَّ المتوكل تكون ثقته بقلبه\n غير كارهٍ لما يرد عليه\n وهذا من أجَلِّ النعم\n ثم قال في موضع آخر: التوكل: شهود نَفْسِك خارجاً من المِنَّة\n جارياً عليك أحكام التقدير من غير تدبيرٍ منك ولا اطلاع لك على حُكمه\n فسبيلُ العبد: الخمودُ والرضا دونَ استعلام الأمر\n وفي الخبر:\n \" أعوذ بالله من علم لا ينفع \" \nومن جملته: أن يكون قد وقع لك شُغْلٌ\n واستقبلك مُهمٌ\n وقد اشتبه عليك وجهُ التدبير فيه\n وتكون مُطالباً بالسُكون\n فيطلبك العلم\n وتتمنى أن تعرف متى يصلح هذا الأمر\n وبأي سببٍ؟ وعلى أي وجهٍ؟ وعلى يد مَن؟ فهذا كله تخليطٌ\n وغير مُسلَّم شيءٌ من ذلك للأكابر\n وهو مِن العلم الذي يجب التعوُّذ منه\n فيجب عليك السكون والرضا\n فإذا جاء وقتُ الكَشْف\n فسترى صورة الحال وتعرفه\n وربما ينظر العبدُ في هذه الحالة تعريفاً في المنام\n أوينظر في فال من الجامع ـ اي: ككتاب وشَبهه ـ أو يرجو بيان حاله\n بأن يجري على لسان مستنطق في الوقت\n كلُّ هذا تركُ للأدب\n واللهُ لا يَرْضى بذلك من أوليائه\n بل الواجبُ السكون\n هـ\n وقال في القوت: والحسب إلى الحسيب يجعلُه ما شاء كيف شاء\n فقد قيل: { فهو حَسْبُه } أي: التوكل حَسْبُه من سائر المقامات\n ثم قال معرباً باللطافة\n مسلياً للجماعة: { إِنَّ الله بالغ أمره } أي: منفذ حكمه فيمن توكل\n ومَن لا يتوكل\n إلاَّ أنّ مَن توكّل عليه يكون الله ـ عزّ وجل ـ حَسبه\n أي: يكفيه أيضاً مُهِم الدنيا والآخرة\n ولا يزيد مَن لم يتوكل عليه جناح بعوضة في قسْمه\n كما لا ينقص عليه ذرة من رزقه\n لكن يزيد مَن توكل عليه هُدىً إلى هداه\n ويرفعه مقاماً في اليقين قدر تقواه\n ويُعزّه بعزّه\n وينقص مَن لم يتوكل عليه من اليقين\n ويزيده من التعب والهم\n ويُشتت قلبَه\n ويشغل فكرَه\n فالمتوكل عليه يُجب له تكفير السيئات\n ويُلقي عليه رضاه ومحبته في المقامات\n أمّا الكفاية فقد ضَمِنها تعالى لِمن صدق في توكله عليه\n والوقاية قد وهبها لمَن أحسن تفويضه إليه\n إلاّ أنّ الاختيار وعلم الاستتار إليه في الكفاية والوقاية\n يجعل ذلك ما يشاء كيف شاء\n وأين شاء\n من أمور الدنيا وأمور الآخرة\n من حيث يعلم العبد\n ومن حيث لا يعلم لأنَّ العبد تجري عليه الأحكام في الدارين\n وفقير محتاج إلى الرحمة واللطف في المكانين\n\nهـ\n ثم ذَكَر مدة اليائسة والحامل\n فقال: { وَٱللاَّئِي يَئِسْنَ مِنَ ٱلْمَحِيضِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:25",
      "similarity": 0.38870681464479223
    },
    {
      "verse": "7:182",
      "similarity": 0.33517612775083966
    },
    {
      "verse": "6:102",
      "similarity": 0.33238993878389966
    },
    {
      "verse": "39:62",
      "similarity": 0.33196750601720354
    },
    {
      "verse": "9:129",
      "similarity": 0.31344692494738374
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/65:3.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/65:3.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/65:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}