{
  "chapter": "الطلاق",
  "text": "والـى يئسن من المحيض من نسائكم ان ارتبتم فعدتهن ثلثة اشهر والـى لم يحضن واو۟لت الاحمال اجلهن ان يضعن حملهن ومن يتق الله يجعل له من امره يسرا",
  "translations": [
    {
      "translation": "In the case of those of your wives who are past the age of menstruation, if you have any doubt, their 'idda should be three months, and that also applies to those who have not yet menstruated. The time for women who are pregnant is when they give birth. Whoever has taqwa of Allah - He will make matters easy for him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for your women who have lost hope of menstruation, and in case you have a doubt, the prescribed period (of waiting) for them is three months, as also for those who have not menstruated yet. As for those who are pregnant, their prescribed period is until the delivery of the child. God will make things easy for him who is mindful of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The waiting period of those of your women who have lost all expectation of menstruation shall be three months in case you entertain any doubt; and the same shall apply to those who have not yet menstruated. As for pregnant women, their waiting period shall be until the delivery of their burden. Allah will create ease for him who fears Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you have any doubt whether your wives have reached the stage of menopause, the waiting period will be three months. This will also be the same for those who do not experience menstruation. The end of the waiting period for a pregnant woman is the delivery. God will make the affairs of one who fears Him easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for those of your women who have no hope of menstruation, if you doubt, the appointed period is three months – and also for those who have not yet had menstruation; and the appointed period for the pregnant women is up to the time they deliver their burden; and whoever fears Allah – Allah will create ease for him in his affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those in menopause among your women, for them the `Iddah, if you have doubt, is three months; and for those who have no courses. And for those who are pregnant, their `Iddah is until they lay down their burden; and whosoever has Taqwa of Allah, He will make his matter easy for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those of your women who have despaired of menstruation, if you have a doubt, their prescribed time shall be three months, and of those too who have not had their courses; and (as for) the pregnant women, their prescribed time is that they lay down their burden; and whoever is careful of (his duty to) Allah He will make easy for him his affair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for your women who have despaired of further menstruating, if you are in doubt, their period shall be three months; and those who have not menstruated as yet. And those who are with child, their term is when they bring forth their burden. Whoso fears God, God will appoint for him, of His command, easiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for such of your women as despair of menstruation, if ye doubt, their period (of waiting) shall be three months, along with those who have it not. And for those with child, their period shall be till they bring forth their burden. And whosoever keepeth his duty to Allah, He maketh his course easy for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the case of those of your wives who have passed the age of menstruation, if you have any doubt, know that their waiting period is three months; and that will apply likewise to those who have not yet menstruated; the waiting period of those who are pregnant will be until they deliver their burden [give birth]. God makes things easy for those who are mindful of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as to such of your women as have despaired of menstruation, if ye be in doubt thereof, their waiting period is three months, as also of those who have not yet menstruated. And as to those with burthens, their term is when they lay down their burthen. And whosoever feareth Allah, He maketh his affair Unto him easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those of your wives who have ceased having menses—[or] if you have any doubts [concerning its cause, whether it’s is age or something else]—their term [of waiting] and of those who have not yet had menses, shall be three months. As for those who are pregnant, their term shall be until they deliver. And whoever is wary of Allah, He shall grant him ease in his affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such of your women as have passed the age of monthly courses, for them the prescribed period, if ye have any doubts, is three months, and for those who have no courses (it is the same): for those who carry (life within their wombs), their period is until they deliver their burdens: and for those who fear Allah, He will make their path easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those of your women as have passed the age of monthly courses, for them the 'Iddah (prescribed period), if you have doubts (about their periods), is three months, and for those who have no courses [(i.e. they are still immature) their 'Iddah (prescribed period) is three months likewise, except in case of death]. And for those who are pregnant (whether they are divorced or their husbands are dead), their 'Iddah (prescribed period) is until they deliver (their burdens), and whosoever fears Allah and keeps his duty to Him, He will make his matter easy for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for your women who have despaired of further menstruating, if you are in doubt, then their waiting period is three months as well as those who have not yet menstruated. As for those who are pregnant, their term shall be the time they deliver their burden. Allah will ease (matters) by His order for whosoever fears Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those of your women who have reached menopause, if you have any doubts, their term shall be three months—and also for those who have not yet menstruated. As for those who are pregnant, their term shall be until they have delivered. Whoever fears God—He will make things easy for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who no longer expect menstruation among your women - if you doubt, then their period is three months, and [also for] those who have not menstruated. And for those who are pregnant, their term is until they give birth. And whoever fears Allah - He will make for him of his matter ease.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[65:4] And [as for] those of your women who (read allā’ī or allā’i in both instances) no longer expect to menstruate, if you have any doubts, about their waiting period, their prescribed [waiting] period shall be three months, and [also for] those who have not yet menstruated, because of their young age, their period shall [also] be three months — both cases apply to other than those whose spouses have died; for these [latter] their period is prescribed in the verse: they shall wait by themselves for four months and ten [days] [Q. 2:234]. And those who are pregnant, their term, the conclusion of their prescribed [waiting] period if divorced or if their spouses be dead, shall be when they deliver. And whoever fears God, He will make matters ease for him, in this world and in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And for such of your women as despair of menstruation) because of old age, (if ye doubt) about their waiting period, (their period (of waiting) shall be three months) upon which another man asked: \"0 Messenger of Allah! What about the waiting period of those who do not have menstruation because they are too young?\" (along with those who have it not) because of young age, their waiting period is three months. Another man asked: \"what is the waiting period for those women who are pregnant?\" (And for those with child) i.e. those who are pregnant, (their period) their waiting period (shall be till they bring forth their burden) their child. (And whosoever keepeth his duty to Allah) and whoever fears Allah regarding what he commands him, (He maketh his course easy for him) He makes his matter easy; and it is also said this means: He will help him to worship Him well.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nهذه المذكورات من الحدود والآداب في طلاق ذوات الأقراء من المعتدات { وَٱللاَّئِي يَئِسْنَ } وقنطن { مِنَ ٱلْمَحِيضِ مِن نِّسَآئِكُمْ } لكبرهن { إِنِ ٱرْتَبْتُمْ } أي: جهلتم وشككتم في تعيين عدتهن { فَعِدَّتُهُنَّ } بعدما طلقتموهن { ثَلاَثَةُ أَشْهُرٍ } أي: مضيها\n\n\n\n\nرُوي أنه لمَّا نزلت:\n\n[البقرة: 228] قيل: فما عدة النساء اللاتي يئسن؟ فنزلت: { وَ } كذا أيضاً مضي ثلاثة أشهر عدة النساء { ٱللاَّئِي لَمْ يَحِضْنَ } بعد؛ لصغر سنهن أو مرض { وَأُوْلاَتُ ٱلأَحْمَالِ } من المطلقات { أَجَلُهُنَّ } ومنتهى عدتهن: { أَن يَضَعْنَ حَمْلَهُنَّ } سواء كان الوضع بعد الفرقة بزمان كثير أو قليل\n\n\n\n\nوهذا الحكم متناول للمطلقة، والمتوفي عنها زوجها، وإنما لم يعيَّن لأولات الأحمال حدّ معين من أقراء وشهود؛ لأن المقصود الأصلي من إلزام العدة: حفظ الماء، استبراء الرحم؛ لئلا ينجر إلى خلط النسب، وبالوضع يحصل المقصود على الوجه الأتم؛ ولهذا لم يحدّ لهن سوى الوضع { وَمَن يَتَّقِ ٱللَّهَ } ويحفظ نفسه من سخطه، وطلَّق امرأته على الوجه المسنون، ولم يركن إلى الطلاق البدعي أصلاً { يَجْعَل لَّهُ } سبحانه { مِنْ أَمْرِهِ } الذي هو فراق زوجته { يُسْراً } [الطلاق: 4] يسهل إليه التزويج الآخر، ويحسنها له، ويحبلها له\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { واللائي يَئِسْنَ من المحيض من نسائكم } لكبرهن، وقدّروه بستين، أو: بخمس وخمسين\n رُوي أنَّ ناساً قالوا: قد عرفنا عِدة الأقراء، فما عدة التي لم تحض؟ فنزلت\n وقوله: { إِن ارتبتمْ } أي: إن أشكل عليكم حكمهنّ كيف يعتددن، { فعِدَّتهُنَّ ثلاثةُ أشهرٍ } أو: إن ارتبتم في حيضها، هل انقطع أو لم ينقطع، فعِدَّتها بالأشهر، وهي المرتابة التي غابت حيضتُها، وهي في سن مَن يحيض، واختلف فيها، فقيل: ثلاثة أشهر على ظاهر الآية، وقيل: تسعة، وتستبرىء بثلاثة، وهو المشهور في مذهب مالك وقدوته في ذلك عُمر بن الخطاب، لأنّ مذهبه عُمري، وقيل: تعتد بالأقراء، ولو بلغت ثلاثين سنة، حتى تبلغ سن مَن لا يحيض، وهو مذهب الشافعي وأبي حنيفة\n { واللائي لم يَحِضْنَ } من صغر، فعدتهنّ ثلاثة أشهر، حذف لدلالة ما قبله، { وأُولات الأحمالِ أجَلُهُنَّ } أي: عِدّتهن { أن يضعن حَملَهن } سواء كن مطلقات، أو متوفًّى عنهن أزواجهن، عند مالك والشافعي وأبي حنيفة وسائر العلماء\n وقال عليّ وابن عباس رضي الله عنهما: إنما هذا في المطلقات الحوامل، وأما المتوقَّى عنهن فعدّتهنَ أقصى الأجلين، إما الوضع، أو انقضاء أربعة أشهر وعشر، وحُجة الجمهور: حديث سُبَيْعة، أنها لما مات زوجها، ووضعت، أَمَرَها رسولُ الله صلى الله عليه وسلم بالتزوُّج، وقد رُوي أن ابن عباس رجع إليه، ولو بلغ عليًّا لرجع، فهذه الآية مخصَّصة لِما في سورة البقرة من قوله تعالى:\n\n[البقرة:234]\n تنبيه: وَضْعُ الحمل إنما يُبرىء الرحم إذا كان من نكاح صحيح، وأمّا من الزنى فلا يُبرئ، باتفاقٍ، فمَن حملت مِن زنى وهي متزوجة فلا تحل للهارب الذي حملت منه إذا طُلّقت بوضع حملها منه، بل لا بد من ثلاثة قروء بعد الوضع، نَعَم مَن لا زوج لها من حُرةٍ أو أَمةٍ إذا حملت من زنى تمَّ استبراؤها بوضع حملها\n { ومَن يتقِ اللهَ } في شأن أحكام العدة ومراعاة حقوقها { يجعل له من أمره يُسراً } أي: يُسهل عليه أمره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:222",
      "similarity": 0.6209961168305318
    },
    {
      "verse": "46:15",
      "similarity": 0.19859565089396278
    },
    {
      "verse": "29:23",
      "similarity": 0.18406377400412355
    },
    {
      "verse": "11:9",
      "similarity": 0.17517056006398232
    },
    {
      "verse": "12:110",
      "similarity": 0.17068191791396306
    }
  ]
}