{
  "chapter": "الطلاق",
  "text": "والـى يئسن من المحيض من نسائكم ان ارتبتم فعدتهن ثلثة اشهر والـى لم يحضن واو۟لت الاحمال اجلهن ان يضعن حملهن ومن يتق الله يجعل له من امره يسرا",
  "translations": [
    {
      "translation": "In the case of those of your wives who are past the age of menstruation, if you have any doubt, their 'idda should be three months, and that also applies to those who have not yet menstruated. The time for women who are pregnant is when they give birth. Whoever has taqwa of Allah - He will make matters easy for him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for your women who have lost hope of menstruation, and in case you have a doubt, the prescribed period (of waiting) for them is three months, as also for those who have not menstruated yet. As for those who are pregnant, their prescribed period is until the delivery of the child. God will make things easy for him who is mindful of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The waiting period of those of your women who have lost all expectation of menstruation shall be three months in case you entertain any doubt; and the same shall apply to those who have not yet menstruated. As for pregnant women, their waiting period shall be until the delivery of their burden. Allah will create ease for him who fears Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you have any doubt whether your wives have reached the stage of menopause, the waiting period will be three months. This will also be the same for those who do not experience menstruation. The end of the waiting period for a pregnant woman is the delivery. God will make the affairs of one who fears Him easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for those of your women who have no hope of menstruation, if you doubt, the appointed period is three months – and also for those who have not yet had menstruation; and the appointed period for the pregnant women is up to the time they deliver their burden; and whoever fears Allah – Allah will create ease for him in his affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those in menopause among your women, for them the `Iddah, if you have doubt, is three months; and for those who have no courses. And for those who are pregnant, their `Iddah is until they lay down their burden; and whosoever has Taqwa of Allah, He will make his matter easy for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those of your women who have despaired of menstruation, if you have a doubt, their prescribed time shall be three months, and of those too who have not had their courses; and (as for) the pregnant women, their prescribed time is that they lay down their burden; and whoever is careful of (his duty to) Allah He will make easy for him his affair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for your women who have despaired of further menstruating, if you are in doubt, their period shall be three months; and those who have not menstruated as yet. And those who are with child, their term is when they bring forth their burden. Whoso fears God, God will appoint for him, of His command, easiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for such of your women as despair of menstruation, if ye doubt, their period (of waiting) shall be three months, along with those who have it not. And for those with child, their period shall be till they bring forth their burden. And whosoever keepeth his duty to Allah, He maketh his course easy for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the case of those of your wives who have passed the age of menstruation, if you have any doubt, know that their waiting period is three months; and that will apply likewise to those who have not yet menstruated; the waiting period of those who are pregnant will be until they deliver their burden [give birth]. God makes things easy for those who are mindful of Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as to such of your women as have despaired of menstruation, if ye be in doubt thereof, their waiting period is three months, as also of those who have not yet menstruated. And as to those with burthens, their term is when they lay down their burthen. And whosoever feareth Allah, He maketh his affair Unto him easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those of your wives who have ceased having menses—[or] if you have any doubts [concerning its cause, whether it’s is age or something else]—their term [of waiting] and of those who have not yet had menses, shall be three months. As for those who are pregnant, their term shall be until they deliver. And whoever is wary of Allah, He shall grant him ease in his affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such of your women as have passed the age of monthly courses, for them the prescribed period, if ye have any doubts, is three months, and for those who have no courses (it is the same): for those who carry (life within their wombs), their period is until they deliver their burdens: and for those who fear Allah, He will make their path easy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those of your women as have passed the age of monthly courses, for them the 'Iddah (prescribed period), if you have doubts (about their periods), is three months, and for those who have no courses [(i.e. they are still immature) their 'Iddah (prescribed period) is three months likewise, except in case of death]. And for those who are pregnant (whether they are divorced or their husbands are dead), their 'Iddah (prescribed period) is until they deliver (their burdens), and whosoever fears Allah and keeps his duty to Him, He will make his matter easy for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for your women who have despaired of further menstruating, if you are in doubt, then their waiting period is three months as well as those who have not yet menstruated. As for those who are pregnant, their term shall be the time they deliver their burden. Allah will ease (matters) by His order for whosoever fears Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those of your women who have reached menopause, if you have any doubts, their term shall be three months—and also for those who have not yet menstruated. As for those who are pregnant, their term shall be until they have delivered. Whoever fears God—He will make things easy for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who no longer expect menstruation among your women - if you doubt, then their period is three months, and [also for] those who have not menstruated. And for those who are pregnant, their term is until they give birth. And whoever fears Allah - He will make for him of his matter ease.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[65:4] And [as for] those of your women who (read allā’ī or allā’i in both instances) no longer expect to menstruate, if you have any doubts, about their waiting period, their prescribed [waiting] period shall be three months, and [also for] those who have not yet menstruated, because of their young age, their period shall [also] be three months — both cases apply to other than those whose spouses have died; for these [latter] their period is prescribed in the verse: they shall wait by themselves for four months and ten [days] [Q. 2:234]. And those who are pregnant, their term, the conclusion of their prescribed [waiting] period if divorced or if their spouses be dead, shall be when they deliver. And whoever fears God, He will make matters ease for him, in this world and in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَاللَّائِي يَئِسْنَ مِنَ الْمَحِيضِ مِنْ نِسَائِكُمْ إِنِ ارْتَبْتُمْ فَعِدَّتُهُنَّ ثَلَاثَةُ أَشْهُرٍ وَاللَّائِي لَمْ يَحِضْنَ وَأُولَاتُ الْأَحْمَالِ أَجَلُهُنَّ أَنْ يَضَعْنَ حَمْلَهُنَّ وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مِنْ أَمْرِهِ يُسْرًا (4) { واللائى يَئِسْنَ مِنَ المحيض مِن نِّسَآئِكُمْ إِنِ ارتبتم فَعِدَّتُهُنَّ ثلاثة أَشْهُرٍ واللاتي لَمْ يَحِضْنَ } .عطف على قوله : { فطلقوهن لعدتهن } \\[ الطلاق : 1 \\] فإن العدة هنالك أريد بها الأقراء فأشعر ذلك أن تلك المعتدة ممن لها أقراء ، فبقي بيان اعتداد المرأة التي تجاوزت سن المحيض أو التي لم تبلغ سن من تحيض وهي الصغيرة . وكلتاهما يصدق عليها أنها آيسة من المحيض ، أي في ذلك الوقت .والوقف على قوله : { واللائي لم يحضن } ، أي هن معطوفات على الآيسين .واليأس : عدم الأمل . والمأيوس منه في الآية يعلم من السياق من قوله : { فطلقوهن لعدتهن } \\[ الطلاق : 1 \\] ، أي يئسن من المحيض سواء كان اليأس منه بعد تعدده أو كان بعدم ظهوره ، أي لم يكن انقطاعه لمرض أو إرضاع . وهذا السنّ يختلف تحديده باختلاف الذوات والأقطار كما يختلف سن ابتداء الحيض كذلك . وقد اختُلف في تحديد هذا السنّ بعدد السنين فقيل : ستون سنة ، وقيل : خمس وخمسون ، وترك الضبط بالسنين أولى وإنما هذا تقريب لإبّان اليأس .والمقصود من الآية بيِّن وهي مخصصة لعموم قوله : { والمطلقات يتربصن بأنفسهن ثلاثة قروء } من سورة \\[ البقرة : 228 \\] . وقد نزلت سورة الطلاق بعد سورة البقرة .وقد خفي مفاد الشرط من قوله : إن ارتبتم } وما هو متصل به . وجمهور أهل التفسير جعلوا هذا الشرط متصلاً بالكلام الذي وقع هو في أثنائه ، وإنه ليس متصلاً بقوله : { لا تخرجوهن من بيوتهن } \\[ الطلاق : 1 \\] في أول هذه السورة خلافاً لشذوذ تأويل بعيد وتشتيت لشمل الكلام ، ثم خفيَ المراد من هذا الشرط بقوله : { إن ارتبتم } .وللعلماء فيه طريقتان :الطريقة الأولى : مشَى أصحابها إلى أن مرجع اليأس غير مرجع الارتياب باختلاف المتعلق ، فروى أشهب عن مالك أن الله تعالى لما بين عدة ذوات القُروء وذوات الحمل ، أي في سورة البقرة ، وبقيت اليائسة والتي لم تحض ارتاب أصحاب محمد صلى الله عليه وسلم في أمرهما فنزلت هذه الآية ، ومثله مروي عن مجاهد ، وروى الطبري خبراً عن أبيّ بن كعب أنه سأل رسول الله صلى الله عليه وسلم عن اعتداد هاتين اللتين لم تذكرا في سورة البقرة ، فنزلت هذه الآية . فجعلوا حرف { إنْ } بمعنى ( إذْ ) وأن الارتياب وقع في حكم العدة قبل نزول الآية ، أي إذ ارتبتم في حكم ذلك فبيّنّاه بهذه الآية قال ابن العربي : حديث أُبّي غير صحيح . وأنا أقول : رواه البيهقي في «سننه» والحاكم في «المستدرك» وصَحّحه . والطبراني بسنده عن عَمرو بن سالم أن أبَيَّا قال : وليس في رواية الطبري ما يدل على إسناد الحديث .وهو في رواية البيهقي بسنده إلى أبي عثمان عُمر بن سالم الأنصاري عن أُبي بن كعب وهو منقطع ، لأن أبا عثمان لم يلق أُبي بن كعب وأحسب أنه في «مستدرك الحاكم» كذلك لأن البيهقي رواه عن الحاكم فلا وجه لقول ابن العربي : هو غير صحيح .فإن رجال سنده ثقات .وفي «أسباب النزول» للواحدي عن قتادة أن خلاد بن النعمان وأبيَّا سألا رسول الله صلى الله عليه وسلم عن ذلك فنزلت هذه الآية . وقيل : إن السائل معاذ بن جبل سأل عن عدة الآيسة .فالريبة على هذه الطريقة تكون مراداً بها ما حصل من التردد في حكم هؤلاء المطلقات فتكون جملة الشرط معترضة بين المبتدأ وهو الموصول وبين خبره وهو جملة { فعدتهن ثلاثة أشهر } .والفاء في { فعدتهن } داخلة على جملة الخبر لما في الموصول من معنى الشرط مثل قوله تعالى : { واللذان يأتيانها منكم فآذوهما } \\[ النساء : 16 \\] ومثله كثير في الكلام .والارتياب على هذا قد وقع فيما مضى فتكون { إنْ } مستعملة في معنى اليقين بلا نكتة .والطريقة الثانية : مشى أصحابها إلى أن مرجع اليأس ومرجع الارتياب واحد ، وهو حالة المطلقة من المحيض ، وهو عن عكرمة وقتادة وابن زيد وبه فسر يحيى بن بكير وإسماعيل بن هاد مِن المالكية ونسبه ابن لبابة من المالكية إلى داود الظاهري .وهذا التفسير يمحض أن يكون المراد من الارتياب حصول الريب في حال المرأة .وعلى هذا فجملة الشرط وجوابه خَبر عن { اللاء يئسن } ، أي إن ارتبن هُن وارتبتُم أنتم لأجل ارتيابهن ، فيكون ضمير جمع الذكور المخاطبين تغليباً ويبقى الشرط على شرطيته . والارتياب مستقبل والفاء رابطة للجواب .وهذا التفسير يقتضي أن يكون الاعتداد بثلاثة أشهر مشروطاً بأن تحصل الريبة في يأسها من المحيض فاصطَدم أصحابُه بمفهوم الشرط الذي يقتضي أنه إن لم تحصل الريبة في يأسهن أنهن لا يعتددن بذلك أو لا يعتددن أصلاً فنسب ابنُ لبابة ( من فقهاء المالكية ) إلى داود الظاهري أنه ذهب إلى سقوط العدة عن المرأة التي يُوقَن أنها يائسة .قلت ولا تُعرف نسبة هذا إلى داود . فإن ابن حزم لم يحكه عنه ولا حكاه أحد ممن تعرضوا لاختلاف الفقهاء ، قال ابن لبابة : وهو شذوذ ، وقال ابن لبابة : وأمّا ابن بكير وإسماعيلُ بن حمَّاد ، أي من فقهاء المالكية فجعلا المرأة المتيقّن يأسها ملحقةً بالمرتابة في العدة بطريق القياس يريد أن العدة لها حكمتان براءة الرحم ، وانتظار المراجعة ، وأما الذين لا يعتبرون مفهوم المخالفة فهم في سعة مما لزم الذين يعتبرونه .وأصحاب هذا الطريق مختلفون في الوجهة وفي محمل الآية بحسبها : فقال عكرمة وابن زيد وقتادة : ليس على المرأة المرتاب في معاودة الحيض إليها عدّة أكثر من ثلاثة أشهر تعلقاً بظاهر الآية ( ولعل علة ذلك عندهم أن ثلاثة الأشهر يتبيّن فيها أمر الحمل فإن لم يظهر حمل بعد انقضائها تمت عدة المرأة ) ، لأن الحمل بعد سنّ اليأس نادر فإذا اعترتها ريبة الحمل انتَقل النظر إلى حكم الشك في الحمل وتلك مسألة غير التي نزلت في شأنها الآية .وقال الأكثرون من أهل العلم : إن المرتاب في يأسها تمكث تسعة أشهر ( أي أمدَ الحمللِ المعتادِ ) فإن لم يظهر بها حمل ابتْدأت الاعتداد بثلاثة أشهر فتكمل لها سنةٌ كاملة . وأصل ذلك ما رواه سعيد بن المسيب من قضاء عمر بن الخطاب ولم يخالفه أحد من الصحابة ، وأخذ به مالك . وعن مالك في «المدونة» : تسعة أشهر للريبة والثلاثة الأشهر هي العدة . ولعلهم رأوا أن العدة بعد مضي التسعة الأشهر تعبُّد لأن ذلك هو الذي في القرآن وأما التسعة الأشهر فأوجبها عمر بن الخطاب لعله بالاجتهاد ، وهو تقييد للإِطلاق الذي في الآية .وقال النخعي وسفيان الثوري وأبو حنيفة والشافعي : تعتد المرتاب في يأسها بالأقراء ( أي تنتظر الدم إلى أن تبلغ سن من لا يشبه أن تحيض ولو زادت مدة انتظارها على تسعة أشهر ) . فإذا بلغت سن اليأس دون ريبة اعتدّت بثلاثة أشهر من يومئذٍ . ونحن نتأول له بأن تقدير الكلام : فعدتهن ثلاثة أشهر ، أي بعد زوال الارتياب كما سنذكره ، وهو مع ذلك يقتضي أن هذه الثلاثة الأشهر بعد مضي تسعة أشهر أو بعد مضي مدة تبلغ بها سن من لا يشبه أن تحيض تعبدٌ ، لأن انتفاء الحمل قد اتضح وانتظار المراجعة قد امتدّ . إلا أن نعتذر لهم بأن مدة الانتظار لا يتحفز في خِلالها المطلِّق للرأي في أمر المراجعة لأنه في سعة الانتظار فيُزاد في المدة لأجل ذلك ، وفي «تفسير القرطبي» : «قال عكرمة وقتادة : من الريبة المرأة المستحاضة التي لا يستقيم لها الحيض تحيض في أول الشهر مراراً ، وفي الأشهر مرة ( أي بدون انضباط ) » اه . ونقل الطبري مثل هذا الكلام عن الزهري وابن زيد ، فيجب أن يصار إلى هذا الوجه في تفسير الآية . والمرأة إذا قاربت وقت اليأس لا ينقطع عنها المحيض دفعة واحدة بل تبقى عدة أشهر ينتابها الحيض غِبًّا بدون انتظام ثم ينقطع تماماً .وقوله تعالى : { واللائي لم يحضن } عطف على { واللائي يئسن } والتقدير : عدتهن ثلاثة أشهر . ويحسن الوقف على قوله : { فعدتهن ثلاثة أشهر } .{ يَحِضْنَ وأولات الاحمال أَجَلُهُنَّ أَن يَضَعْنَ } .معطوفة على جملة { واللائي لم يحضن } فهي إتمام لأحوال العدة المجمل في قوله تعالى : { وأحصوا العدة } \\[ الطلاق : 1 \\] وتقدير الكلام : وأولات الأحمال منهن ، أي من المطلقات أجلهن أن يضعن حملهن .فحصل بهذه الآية مع التي قبلها تفصيل لأحوال المطلقات وحصل أيضاً منها بيان لإِجمال الآية التي في سورة البقرة .{ وأولات } اسم جَمع لذاتتٍ بمعنى : صاحبة . وذات : مؤنث ذو ، بمعنى : صاحب . ولا مفرد ل { أولات } من لفظه كما لا مفرد للفظ ( أولو ) و { أولات } مثل ذوات كما أن أولو مثل ذَوُو . ويكتب { أولات } بواو بعد الهمزة في الرسم تبعاً لكتابة لفظ ( أولو ) بواو بعد الهمزة لقصد التفرقة في الرسم بين أولي في حالة النصب والجر وبين حرف ( إلى ) .وليتهم قصروا كتابته بواو بعد الهمزة على لفظ أولي المذكر المنصوب أو المجرور وتركوا التكلف في غيرهما . \\[وجعلت عدة المطلقة الحامل منهَّاة بوضع الحمل لأنه لا أدل على براءة الرحم منه ، إذ الغرض الأول من العدة تحقق براءة الرحم من ولدٍ للمطلِّق أو ظهور اشتغال الرحم بجنين له . وضمّ إلى ذلك غرض آخر هو ترقب ندم المطلق وتمكينه من تدارك أمره بالمراجعة ، فلما حصل الأهم أُلغي ما عداه رعْياً لحق المرأة في الانطلاق من حرج الانتظار ، على أن وضع الحمل قد يحصل بالقرب من الطلاق فألغي قصد الانتظار تعليلاً بالغالب دون النادر ، خلافاً لمن قال في المتوفى عنها : عليها أقصى الأجلين وهو منسوب إلى علي بن أبي طالب وابن عباس .وبهذا التفسير لا تتعارض هذه الآية مع آية عدة المتوفى عنها التي في سورة \\[ البقرة : 234 \\] { والذين يتوفون منكم ويذرون أزواجاً يتربصن بأنفسهن أربعة أشهر وعشراً } لأن تلك في وادٍ وهذه في وادٍ ، تلك في شأن المتوفى عنهن وهذه في شأن المطلقات .ولكن لما كان أجل أربعة أشهر وعشر للمتوفى عنها منحصرةً حكمتُه في تحقق براءة رحم امرأة المتوفى من ولدٍ له إذ له فائدة فيه غيرَ ذلك ( ولا يتوهم أن الشريعة جعلت ذلك لغرض الحزن على الزوج المتوفى للقطع بأن هذا مقصد جاهلي ) ، وقد دلت الشريعة في مواضع على إبطاله والنهي عنه في تصاريف كثيرة كما بينّاه في تفسير قوله تعالى : { والذين يتوفون منكم ويذرون أزواجاً يتربصن بأنفسهن } الخ في سورة \\[ البقرة : 234 \\] .وقد علمنا أن وضع الحمل غاية لحصول هذا المقصد نجم من جهة المعنى أن المتوفى عنها الحاملَ إذا وضعت حملها تخرج من عدة وفاة زوجها ولا تقضي أربعة أشهر وعشراً كما أنها لو كان أمد حملها أكثر من أربعة أشهر وعشر لا تقتصر على الأربعة الأشهر وعشر إذ لا حكمة في ذلك .من أجْل ذلك كانت الآية دالة على أن عدة الحامل وضع حملها سواء كانت معتدة من طلاق أم كانت معتدة من وفاة .ومن أجل ذلك قال جمهور أهل العلم من الصحابة فمن بعدهم : إن عدة الحامل المتوفّى عنها كعدتها من الطلاق وضع حملها غير أن أقوالهم تدل على أن بينهم من كانوا يرون في تعارض العمومين أن العامّ المتأخر منهما ينسخ العامّ الآخر وهي طريقة المتقدمين .روى أهل الصحيح أن عبد الله بن مسعود لما بلغه أن عليّ بن أبي طالب قال في عدة الحامل المتوفّي عنها : إن عليها أقصَى الأجلين أي أجل وضع الحمل وأجل الأربعة الأشهر والعشر قال ابن مسعود : لَنَزَلَتْ سورة النساء القُصرى أي سورة الطلاق بعد الطولى أي بعد طولى السور وهي البقرة ، أي ليست آية سورة البقرة بناسخة لما في آية سورة الطلاق .ويعضدهم خبر سبيعة بنت الحارث الأسلمية توفي زوجها سعدُ بن خولة في حجة الوداع بمكة وتركها حاملاً فوضعت بعد وفاته بخمس عشرة ليلة وقيل بأربعين ليلة . فاستأذنت رسولَ الله في التزوج فقال لها : قد حَلَلْتتِ فانكحي إن شئتِ . روته أم سلمة أم المؤمنين وقبله معظم الصحابة الذين بلغهم . وتلقاه الفقهاء بعدهم بالقبول ويشهد له بالمعنى والحكمة كما تقدم آنفاً .واختلف المتأخرون من أهل الأصول في وجه العمل في تعارض عمومين كل واحد منهما عام من وجه مثل هاتين الآيتين فالجمهور درجوا على ترجيح أحدهما بمُرجح والحنفية جعلوا المتأخِر من العمومين ناسخاً للمتقدم . فقوله : وأولات الأحمال } لأن الموصول من صيغ العموم فيعم كل حامل معتدة سواء كانت في عدة طلاق أو في عدة وفاة ، وقوله : { والذين يتوفون منكم ويذرون أزواجاً يتربصن بأنفسهن أربعة أشهر وعشراً } \\[ البقرة : 234 \\] تَعمّ كلّ امرأة تركها الميت سواء كانت حاملاً أو غير حامل ، لأن { أزواجاً } نكرة وقعت مفعولَ الصلة وهي { يَذرون } المشتملة على ضمير المَوصول الذي هو عام فمفعوله تبع له في عمومه فيشمل المتوفى عنهن الحوامل وهن ممن شملهن عموم { أولات الأحمال } فتعارض العمومان كل من وجه ، فآية { وأولات الأحمال } اقتضت أن الحوامل كلهن تنتهي عدتهن بالوضع وقد يكون الوضع قبل الأربعة الأشهر والعشر ، وآية البقرة يقتضي عمومها أن المتوفّى عنهن يتربصن أربعة أشهر وعشراً . وقد يتأخر هذا الأجل عن وضع الحمل .فذهب الجمهور إلى ترجيح عموم { وأولات الأحمال } على عموم { ويذرون أزواجاً } \\[ البقرة : 234 \\] من وجوه .أحدها : أن عموم { وأولات الأحمال } حاصل بذات اللفظ لأن الموصول مع صلته من صيغ العموم ، وأما قوله : { ويذرون أزواجاً } فإن { أزواجاً } نكرة في سياق الإِثبات فلا عموم لها في لفظها وإنما عرض لها العموم تبعاً لعموم الموصول العامل فيها وما كان عمومه بالذات أرجح مما كان عمومه بالعرض .وثانيها : أن الحكم في عموم { وأولات الأحمال } علق بمدلول صلة الموصول وهي مشتق ، وتعليق الحكم بالمشتق يؤذن بتعليل ما اشتق منه بخلاف العموم الذي في سورة البقرة ، فما كان عمومه معلَّلاً بالوصف أرجح في العمل مما عمومه غير معلل .وثالثها : قضاء رسول الله صلى الله عليه وسلم في عدّة سُبَيْعة الأسلمية .وذهب الحنفية إلى أن عموم { وأولات الأحمال } ناسخ لعموم قوله : { ويذرون أزواجاً } \\[ البقرة : 234 \\] في مقدار ما تعارضا فيه .ومآل الرأيين واحد هو أن عدة الحامل وضعُ حملها سواء كانت معتدة من طلاق أم من وفاة زوجها .والصحيح أن آية البقرة لم يرتفع حكمها وشذ القائلون بأن المتوفّى عنها إن لم تكن حاملاً ووضعت حملها يجب عليها عدة أربعة أشهر وعشر .وقال قليل من أهل العلم بالجمع بين الآيتين بما يحقق العمل بهما معاً فأوجبوا على الحامل المتوفّى عنها زوجها الاعتداد بالأقصى من الأجلين أجل الأربعة الأشهر والعشر .وأجل وضع الحمل ، وهو قول علي بن أبي طالب وابن عباس . وقصدهم من ذلك الاحتياط لأنه قد تأتَّى لهم هنا إذ كان التعارض في مقدار زمنين فأمكن العمل بأوسعهما الذي يتحقق فيه الآخَر وزيادة فيصير معنى هذه الآية { أولات الأحمال أجلهن أن يضعن حملهن } ما لم تكن عدة وفاة ويكون معنى آية سورة البقرة وأزواج المتوفَّيْن يتربصن بأنفسهن أربعة أشهر وعشراً ما لم تكنَّ حوامل فيزدْن تربّصاً إلى وضع الحمل . ولا يجوز تخصيص عموم { والذين يتوفون منكم ويذرون أزواجاً يتربصن بأنفسهن أربعة أشهر وعشراً } \\[ البقرة : 234 \\] بما في آية { وأولات الأحمال أجلهن أن يضعن حملهن } من خصوص بالنظر إلى الحوامل المتوفَّى عنهن ، إذ لا يجوز أن تنتهي عدة الحامل المتوفّى عنها التي مضت عليها أربعة أشهر وعشر قبل وضع حملها من عِدة زوجها ، وهي في حالة حمل لأن ذلك مقرر بطلانه من عدة أدلة في الشريعة لا خلاف فيها وإلى هذا ذهب ابن أبي ليلى .وفي «صحيح البخاري» «عن محمد بن سيرين قال : كنت في حلقة فيها عُظْم من الأنصار ( أي بالكوفة ) وفيهم عبد الرحمان بن أبي ليلى وكان أصحابه يعظمونه فذَكَر آخرَ الأجلين ، فحدثتُ حديث عبد الله بن عتبة في شأن سُبيعة بنت الحارث فقال عبد الرحمان لكن عمه ( أي عم عتبة وهو عبد الله بن مسعود ) كان لا يقول ذلك ( أي لم يحدثنا به ) فقلت : إني إذن لجَرِيء إن كذبتُ على رجل في جانب الكوفة ( وكان عبد الله بن عتبة ساكناً بظاهر الكوفة ) فخرجتُ فلقيت عامراً أو مالك بن عوف فقلت : كيف كان قول ابن مسعود في المتوفّى عنها زوجها وهي حامل ، فقال : قال ابن مسعود : أتجعلون عليها التغليظ ولا تجعلون لها الرخصة لنزلت سورة النساء القصرى بعد الطولى ( أي البقرة ) .وفي «البخاري» عن أبي سلمة جاء رجل إلى ابن عباس وأبو هريرة جالس عنده فقال : أفتني في امرأة ولدت بعد زوجها بأربعين ليلة فقال ابن عباس : آخرُ الأجلين : فقلتُ أنا { وأولات الأحمال أجلهن أن يضعن حملهن } . قال أبو هريرة : أنا مع ابن أخي ( أي مع أبي سلمة ) فأرسل ابن عباس كريباً إلى أمّ سلمة يسألها فقالت : قُتل ( كذا والتحقيق أنه مات في حجة الوداع ) زَوج سُبيعة الأسلمية وهي حبلى فوضعت بعد موته بأربعين ليلة فخُطِبت فأنكحها رسول الله . وقد قال بعضهم : إن ابن عباس رجع عن قوله . ولم يذكر رجوعه في حديث أبي سلمة .{ حَمْلَهُنَّ وَمَن يَتَّقِ الله يَجْعَل لَّهُ مِنْ أَمْرِهِ } { يُسْراً \\* ذَلِكَ أَمْرُ الله أَنزَلَهُ إِلَيْكُمْ وَمَن يَتَّقِ الله يُكَفِّرْ عَنْهُ سيئاته وَيُعْظِمْ لَهُ أَجْراً } .تكرير للموعظة وهو اعتراض . والقول فيه كالقول في قوله تعالى : { ومن يتق الله يجعل له مخرجاً ويرزقه من حيث لا يحتسب } \\[ الطلاق : 2 ، 3 \\] . والمقصود موعظة الرجال والنساء على الأخذ بما في هذه الأحكام مما عسى أن يكون فيه مشقة على أحد بأن على كل أن يصبر لذلك امتثالاً لأمر الله فإن الممتثل وهو مسمى المتقي يجعل الله له يسراً فيما لحقه من عسر .والأمر : الشأن والحال . والمقصود : يجعل له من أمره العسير في نظره يسراً بقرينة جعل اليسر لأمره .و { مِن } للابتداء المجازي المراد به المقارنةُ والملابسة .واليسر : انتفاء الصعوبة ، أي انتفاء المشاقّ والمكروهات .والمقصود من هذا تحقيق الوعد باليسر فيما شأنه العسر لحث الأزواج على امتثال ما أمر الله به الزوج من الإِنفاق في مدة العدة ومن المراجعة وترك منزلِه لأجل سكناها إذا كان لا يسعهما وما أمر به المرأة من تربص أمد العدة وعدم الخروج ونحو ذلك .\n\n",
      "translations": [
        {
          "translation": "(And for such of your women as despair of menstruation) because of old age, (if ye doubt) about their waiting period, (their period (of waiting) shall be three months) upon which another man asked: \"0 Messenger of Allah! What about the waiting period of those who do not have menstruation because they are too young?\" (along with those who have it not) because of young age, their waiting period is three months. Another man asked: \"what is the waiting period for those women who are pregnant?\" (And for those with child) i.e. those who are pregnant, (their period) their waiting period (shall be till they bring forth their burden) their child. (And whosoever keepeth his duty to Allah) and whoever fears Allah regarding what he commands him, (He maketh his course easy for him) He makes his matter easy; and it is also said this means: He will help him to worship Him well.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ومن يتّق الله } في مراعاة وقته والاجتناب عن ذنب حاله { يجعل له } من أمر سلوكه { يسراً } أي: متى راع آداب مقامه واجتنب ذنوب حاله في المواطن تيسر له الترقي منه إلى أعلى",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nهذه المذكورات من الحدود والآداب في طلاق ذوات الأقراء من المعتدات { وَٱللاَّئِي يَئِسْنَ } وقنطن { مِنَ ٱلْمَحِيضِ مِن نِّسَآئِكُمْ } لكبرهن { إِنِ ٱرْتَبْتُمْ } أي: جهلتم وشككتم في تعيين عدتهن { فَعِدَّتُهُنَّ } بعدما طلقتموهن { ثَلاَثَةُ أَشْهُرٍ } أي: مضيها\n\n\nرُوي أنه لمَّا نزلت:\n[البقرة: 228] قيل: فما عدة النساء اللاتي يئسن؟ فنزلت: { وَ } كذا أيضاً مضي ثلاثة أشهر عدة النساء { ٱللاَّئِي لَمْ يَحِضْنَ } بعد\n لصغر سنهن أو مرض { وَأُوْلاَتُ ٱلأَحْمَالِ } من المطلقات { أَجَلُهُنَّ } ومنتهى عدتهن: { أَن يَضَعْنَ حَمْلَهُنَّ } سواء كان الوضع بعد الفرقة بزمان كثير أو قليل\n\n\nوهذا الحكم متناول للمطلقة\n والمتوفي عنها زوجها\n وإنما لم يعيَّن لأولات الأحمال حدّ معين من أقراء وشهود\n لأن المقصود الأصلي من إلزام العدة: حفظ الماء\n استبراء الرحم\n لئلا ينجر إلى خلط النسب\n وبالوضع يحصل المقصود على الوجه الأتم\n ولهذا لم يحدّ لهن سوى الوضع { وَمَن يَتَّقِ ٱللَّهَ } ويحفظ نفسه من سخطه\n وطلَّق امرأته على الوجه المسنون\n ولم يركن إلى الطلاق البدعي أصلاً { يَجْعَل لَّهُ } سبحانه { مِنْ أَمْرِهِ } الذي هو فراق زوجته { يُسْراً } [الطلاق: 4] يسهل إليه التزويج الآخر\n ويحسنها له\n ويحبلها له\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { واللائي يَئِسْنَ من المحيض من نسائكم } لكبرهن\n وقدّروه بستين\n أو: بخمس وخمسين\n رُوي أنَّ ناساً قالوا: قد عرفنا عِدة الأقراء\n فما عدة التي لم تحض؟ فنزلت\n وقوله: { إِن ارتبتمْ } أي: إن أشكل عليكم حكمهنّ كيف يعتددن\n { فعِدَّتهُنَّ ثلاثةُ أشهرٍ } أو: إن ارتبتم في حيضها\n هل انقطع أو لم ينقطع\n فعِدَّتها بالأشهر\n وهي المرتابة التي غابت حيضتُها\n وهي في سن مَن يحيض\n واختلف فيها\n فقيل: ثلاثة أشهر على ظاهر الآية\n وقيل: تسعة\n وتستبرىء بثلاثة\n وهو المشهور في مذهب مالك وقدوته في ذلك عُمر بن الخطاب\n لأنّ مذهبه عُمري\n وقيل: تعتد بالأقراء\n ولو بلغت ثلاثين سنة\n حتى تبلغ سن مَن لا يحيض\n وهو مذهب الشافعي وأبي حنيفة\n { واللائي لم يَحِضْنَ } من صغر\n فعدتهنّ ثلاثة أشهر\n حذف لدلالة ما قبله\n { وأُولات الأحمالِ أجَلُهُنَّ } أي: عِدّتهن { أن يضعن حَملَهن } سواء كن مطلقات\n أو متوفًّى عنهن أزواجهن\n عند مالك والشافعي وأبي حنيفة وسائر العلماء\n وقال عليّ وابن عباس رضي الله عنهما: إنما هذا في المطلقات الحوامل\n وأما المتوقَّى عنهن فعدّتهنَ أقصى الأجلين\n إما الوضع\n أو انقضاء أربعة أشهر وعشر\n وحُجة الجمهور: حديث سُبَيْعة\n أنها لما مات زوجها\n ووضعت\n أَمَرَها رسولُ الله صلى الله عليه وسلم بالتزوُّج\n وقد رُوي أن ابن عباس رجع إليه\n ولو بلغ عليًّا لرجع\n فهذه الآية مخصَّصة لِما في سورة البقرة من قوله تعالى:\n[البقرة:234]\n تنبيه: وَضْعُ الحمل إنما يُبرىء الرحم إذا كان من نكاح صحيح\n وأمّا من الزنى فلا يُبرئ\n باتفاقٍ\n فمَن حملت مِن زنى وهي متزوجة فلا تحل للهارب الذي حملت منه إذا طُلّقت بوضع حملها منه\n بل لا بد من ثلاثة قروء بعد الوضع\n نَعَم مَن لا زوج لها من حُرةٍ أو أَمةٍ إذا حملت من زنى تمَّ استبراؤها بوضع حملها\n { ومَن يتقِ اللهَ } في شأن أحكام العدة ومراعاة حقوقها { يجعل له من أمره يُسراً } أي: يُسهل عليه أمره\n ويتحلّل عليه ما تعقّد ببركة التقوى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:222",
      "similarity": 0.6209961168305318
    },
    {
      "verse": "46:15",
      "similarity": 0.19859565089396278
    },
    {
      "verse": "29:23",
      "similarity": 0.18406377400412355
    },
    {
      "verse": "11:9",
      "similarity": 0.17517056006398232
    },
    {
      "verse": "12:110",
      "similarity": 0.17068191791396306
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/065004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/065004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/65:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}