{
  "chapter": "الطلاق",
  "text": "ذلك امر الله انزله اليكم ومن يتق الله يكفر عنه سيـاته ويعظم له اجرا",
  "translations": [
    {
      "translation": "That is Allah's command which He has sent down to you. Whoever has taqwa of Allah - He will erase his bad actions from him and greatly increase his reward.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the commandment of God that is sent down to you. God will forgive the ills of those who fear Him, and increase their reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the commandment of Allah that He has revealed to you. Whoever fears Allah, He will expunge his evil deeds and will richly reward him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the command of God which He has revealed to you. God will expiate the evil deeds of those who fear Him and will increase their rewards.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is Allah’s command that He has sent down towards you; and whoever fears Allah – Allah will relieve his sins and bestow upon him a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the command of Allah, which He has sent down to you; and whosoever has Taqwa of Allah, He will expiate from him his sins, and will increase his reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the command of Allah which He has revealed to you, and whoever is careful of (his duty to) Allah, He will remove from him his evil and give him a big reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is God's command, that He has sent down unto you. And whosoever fears God, He will acquit him of his evil deeds, and He will give him a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the commandment of Allah which He revealeth unto you. And whoso keepeth his duty to Allah, He will remit from him his evil deeds and magnify reward for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the commandment which God has revealed to you. He who fears God shall be forgiven his sins and richly rewarded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the commandment of Allah which He hath sent down Unto you. And whosoever feareth Allah, He Will expiate his misdeeds from him, and will magnify for him his hire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Allah’s ordinance, which He has sent down to you, and whoever is wary of Allah, He shall absolve him of his misdeeds and give him a great reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the Command of Allah, which He has sent down to you: and if any one fears Allah, He will remove his ills, from him, and will enlarge his reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the Command of Allah, which He has sent down to you, and whosoever fears Allah and keeps his duty to Him, He will remit his sins from him, and will enlarge his reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the command of Allah that He has sent down to you. Whosoever fears Allah shall be relieved of his sins and given a mighty wage.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the ordinance of God, which He sent down to you. Whoever fears God—He will remit his sins, and will amplify his reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the command of Allah, which He has sent down to you; and whoever fears Allah - He will remove for him his misdeeds and make great for him his reward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[65:5] That, which is mentioned regarding the prescribed [waiting] period, is God’s command, His ruling, which He has revealed to you. And whoever fears God, He will absolve him of his misdeeds and magnify the reward for him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That is the commandment of Allah) these are the legal rulings and obligations of Allah (which He revealeth unto you) which He explains to you in the Qur'an. (And whoso keepeth his duty to Allah) and whoever fears Allah regarding what He commands him, (He will remit from him his evil deeds) He will forgive his sins (and 674 magnify reward for him) in the Garden.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ذلك } اليسر المرتب على التقوى في كل مرتبة\n { أمر الله } وشأنه المخصوص به وهو التوفيق على حسب الاستعداد والفيض بقدر القبول { أنزله إليكم } ثم كرر للمبالغة تفصيل ما أجمل فقال: { ومن يتّق الله يكفر عنه سيئاته } أي: موانعه وهيئات نفسه الحاجبة عن الفيض\n المانعة للمزيد { ويعظم له أجراً } بإفاضة ما يناسب حاله بحسب القبول والاستعداد الجديد من الكمال { فاتّقوا الله يا أولي الألباب } أي: اعتبروا بحال الأمم الماضين من المنكرين المعاندين وما نزل به من العذاب والوبال فاتّقوا الله في أوامره ونواهيه إن خلصت عقولكم من شوب الوهم\n فإن اللبّ هو العقل الخالص من شوائب الوهم وذلك بخلوص القلب من شوائب صفات النفس والرجوع إلى الفطرة\n وإذا خلص العقل من الوهم والقلب من النفس كان الإيمان يقينياً فلذلك وصفهم: بـ { الذين آمنوا } أي: الإيمان التحقيقي\n { قد أنزل الله إليكم ذكراً } أي: فرقاناً مشتملاً على ذكر الذات والصفات والأسماء والأفعال والمعاد { رسولاً } أي: روح القدس الذي أنزله به فأبدل منه بدل الاشتمال لأن إنزال الذكر هو إنزاله بالاتصال بالروح النبوي وإلقاء المعاني في القلب { يتلوا عليكم آيات الله } أي: يجلي عليكم صفاته ويكشف لكم توحيدها { مبينات } متجليات أو مجليات لأنوار الذات { ليخرج الذين آمنوا } الإيمان اليقيني من ظلمات صفات القلب إلى نور الروح ومقام المشاهدة { ومن يؤمن بالله } الإيمان العيني بالمشاهدة { ويعمل صالحاً } بالسير في الله بالله { يدخله جنّات } من مشاهدات تجليات صفاته ومطالعات أنوارها { تجري من تحتها } أنهار علوم توحيد الأفعال والصفات والذات { قد أحسن الله له رزقاً } من تلك العلوم\n { الله الذي خلق سبع سموات ومن الأرض مثلهنّ } إن أخذنا السماوات بمعناها الظاهر\n فالأراضي السبعة هي طبقات العناصر المشهورة فإنها قوابل بالنسبة إلى المؤثرات فهي أرضها التي تنزل عليها منها الصور الكائنة وهي النار الصرفة والطبقة الممتزجة من النار والهواء المسماة كرة الأثير التي تتولد فيها الشهب وذوات الأذناب والذوائب وغيرها\n وطبقة الزمهرير وطبقة النسيم وطبقة الصعيد والماء المشمولة للنسيم الشاملة للطبقة الطينية التي هي السادسة وطبقة الأرض الصرفة عند المركز وإن حملناها على مراتب الغيوب السبعة المذكورة من غيب القوى والنفس والعقل والسرّ والروح والخفاء وغيب الغيوب أي: عين جمع الذات\n فالأرضون هي الأعضاء السبعة المشهورة { يتنزل } أمر الله بالإيجاد والتكوين وترتيب النظام والتكميل { بينهنّ } والله تعالى أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذَلِكَ } المذكور من الأحكام { أَمْرُ ٱللَّهِ } العليم الحكيم { أَنزَلَهُ إِلَيْكُمْ } أيها المكلَّفون\n ليصلح مفاسدكم المتعلقة بحكم الطلاق { وَمَن يَتَّقِ ٱللَّهَ } المنتقم الغيور\n ولم يتجاوز عن مقتضى أمره المبرم\n وحكمه المحكم { يُكَفِّرْ عَنْهُ سَيِّئَاتِهِ } يتغليب حسناته عليها { وَيُعْظِمْ لَهُ أَجْراً } [الطلاق: 5] بتضعيف حسناته أضعافاً كثيرة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك } أي: ما علَّمكم من الأحكام { أمرُ الله أَنزله إِليكم } لتعملوا به\n وإفراد الكاف مع أنّ المُشار إليهم جماعة لأنها لتعيين الفرق بين البُعد والقرب\n لا لتعيين خصوصية المخاطبين { ومَن يتق الله } بالمحافظة على أحكامه { يُكفِّر عنه سيئاتِه } فإنَّ الحسنات يُذهبن السيئات\n { ويُعْظِمْ له أجراً } بالمضاعفة والتكثير\n الإشارة: والنفوس التي يئسن من المساوىء والميل إلى الدنيا\n ثم شككتم في تحقق طهارتها\n تنتظر ثلاثة أشهر\n فإذا مضت هذه المدة ولم يظهر منها ميل\n فالغالب طهارتها\n وكذلك النفوس الزكية\n الباقية على الفطرة التي لم يظهر منها خَلل\n تنتظر هذه المدة\n فإن ظهرت سلامتها فلا مجاهدة عليها\n والنفوس الحوامل بكثرة الأشغال عِدَّة تمام فتحها أن تضع كل ما يثقل عليها ويمنعها من السير\n ولقد سمعتُ شيخنا البوزيدي رضي الله عنه يقول: إن شئتم أن أُقسم لكم إنه لا يدخل أحد عالَم الملكوت وفي قلبه علقة\n\nهـ\n { ومَن يتق الله } أي: يعزم على البر والتقوى يجعل له تعالى من أمره يُسراً\n يُسهّل عليه طريق السلوك\n ويكفيه كلَّ ما يُثقله ويشغله عنه\n إما بإزالة ذلك له\n أو بغيبته عن شؤونه\n ومَن يتق الله بالفعل يُكَفِّر عنه سيئاتِه\n أي: يُغطّي عنه أوصافه الذميمة بأوصافه الحميدة\n ويُعظم له أجراً بأن يفتح له باب مشاهدته\n والله تعالى أعلم\n ثم ذكر حكم السُكنى والنفقة\n فقال: { أَسْكِنُوهُنَّ مِنْ حَيْثُ سَكَنتُم }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:35",
      "similarity": 0.5064410297696565
    },
    {
      "verse": "5:9",
      "similarity": 0.42906489421615635
    },
    {
      "verse": "12:57",
      "similarity": 0.40454145022423926
    },
    {
      "verse": "8:29",
      "similarity": 0.4031699991158298
    },
    {
      "verse": "40:9",
      "similarity": 0.35817685058700477
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/65:5.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/65:5.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/65:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}