{
  "chapter": "الطلاق",
  "text": "لينفق ذو سعة من سعته ومن قدر عليه رزقه فلينفق مما ءاتىه الله لا يكلف الله نفسا الا ما ءاتىها سيجعل الله بعد عسر يسرا",
  "translations": [
    {
      "translation": "He who has plenty should spend out from his plenty, but he whose provision is restricted should spend from what Allah has given him. Allah does not demand from any self more than He has given it. Allah will appoint after difficulty, ease.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the man of means spend according to his means, and he whose means are limited, should spend of what God has given him. God does not burden a soul beyond what He has given him. God will bring ease after hardship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever has abundant means, let him spend according to his means; and he whose means are straitened, let him spend out of what Allah has given him. Allah does not burden any human being beyond the means that He has bestowed upon him. Possibly Allah will grant ease after hardship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the well-to-do people spend abundantly (for the mother and the child) and let the poor spend from what God has given them. God does not impose on any soul that which he cannot afford. God will bring about ease after hardship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever has the capacity must give provisions according to his means; and the one whose sustenance is restricted upon him, must give provisions from what Allah has given him; Allah does not burden any soul except according to what He has given it; Allah will soon, after the hardship, create ease.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the rich man spend according to his means; and the man whose resources are restricted, let him spend according to what Allah has given him. Allah puts no burden on any person beyond what He has given him. Allah will grant after hardship, ease.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let him who has abundance spend out of his abundance and whoever has his means of subsistence straitened to him, let him spend out of that which Allah has given him; Allah does not lay on any soul a burden except to the extent to which He has granted it; Allah brings about ease after difficulty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the man of plenty expend out of his plenty. As for him whose provision is stinted to him, let him expend of what God has given him. God charges no soul save with what He has given him. God will assuredly appoint, after difficulty, easiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let him who hath abundance spend of his abundance, and he whose provision is measured, let him spend of that which Allah hath given him. Allah asketh naught of any soul save that which He hath given it. Allah will vouchsafe, after hardship, ease.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "let the man of means spend in accordance with his means; and let him whose resources are restricted, spend in accordance with what God has given him. God does not burden any person with more than He has given him. God will soon bring about ease after hardship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the man of means expend according to his means; and whosoever is stinted in his subsistence let him expend of that which Allah hath given him. Allah tasketh not a soul except according to that which He hath vouchsafed it. Anon Allah will appoint after hardship ease.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the affluent man spend out of his affluence, and let he whose provision has been tightened spend out of what Allah has given him. Allah does not task any soul except [according to] what He has given it. Allah will bring about ease after hardship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the man of means spend according to his means: and the man whose resources are restricted, let him spend according to what Allah has given him. Allah puts no burden on any person beyond what He has given him. After a difficulty, Allah will soon grant relief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the rich man spend according to his means, and the man whose resources are restricted, let him spend according to what Allah has given him. Allah puts no burden on any person beyond what He has given him. Allah will grant after hardship, ease.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let the rich spend according to his wealth and for he whose provision is little, let him spend from what Allah has given him. Allah does not charge a soulexcept with that He has given him. Surely, Allah will bring ease after difficulty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wealthy shall spend according to his means; and he whose resources are restricted shall spend according to what God has given him. God never burdens a soul beyond what He has given it. God will bring ease after hardship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let a man of wealth spend from his wealth, and he whose provision is restricted - let him spend from what Allah has given him. Allah does not charge a soul except [according to] what He has given it. Allah will bring about, after hardship, ease.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[65:7] Let the affluent man expend, on the divorced or the suckling woman, out of his affluence. And let he whose provision has been straitened, restricted, for him, expend of what God has given him, in accordance with his means. God does not charge any soul save except with what He has given it. God will assuredly bring about ease after hardship — which He indeed did by way of the [Muslim] conquests.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Let him) i.e. the father, (who hath abundance) who is well off (spend of his abundance) according to his wealth, (and he whose provision is measured) and he whose livelihood is tight, (let him spend) on breastfeeding (of that which Allah hath given him) according to what Allah has given him. (Allah asketh naught of any soul) regarding payment for breastfeeding (save that which He hath given it) save according to what he has given it of wealth. (Allah will vouchsafe, after hardship) in expenditure, (ease) after poverty there will be richness, for the one who suffers hardship of living awaits provision from Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَن قُدِرَ عَلَيْهِ رِزْقُهُ } يعني قُتِّرَ عليهِ\n\n",
      "translations": [
        {
          "translation": " And His saying, {And whoever is given his provision in abundance} means that it is restricted to him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لِيُنفِقْ } على المعتدة الحاملة { ذُو سَعَةٍ } ويسر { مِّن سَعَتِهِ } ومقدار وسعه وطاقته على مقتضى نفقتها قبل الفرقة { وَمَن قُدِرَ } وضُيِّق { عَلَيْهِ رِزْقُهُ فَلْيُنفِقْ مِمَّآ آتَاهُ ٱللَّهُ } من الرزق بلا جبر وتحميل\n إنه { لاَ يُكَلِّفُ ٱللَّهُ } المنعم الحكيم { نَفْساً إِلاَّ } مقدار { مَآ آتَاهَا } وساق لها من الرزق الصوري\n إذ { سَيَجْعَلُ ٱللَّهُ } المنعم المفضل { بَعْدَ عُسْرٍ } دنيوي { يُسْراً } [الطلاق: 7] حقيقياً أخروياً\n فاليسر في الآخرة أولى من الدنيا وما فيها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n حيث قال: { سيجعل اللهُ بعد عُسر يُسراً } أي: بعد ضيق في المعيشة سعة فيها\n فإنّ عادته تعالى أن يُعقب العسر باليسر\n كما قال تعالى:\n[الشرح:5]\n وكرره مرتين\n فلن يغلب عسر يسريْن\n الإشارة: أسكِنوا نفوسَكم من حيث سكنتم بها قبل التوجه\n فينبغي للمريد أن يسايس نفسه شيئاً فشيئاً\n حتى يغيب عنها في شهود الحق\n من غير تشديدٍ في إخراجها عن طبعها بالكلية\n فإنها حينئذٍ تَملّ وتكِلّ\n فقد قيل: مَن سار إلى الله بموافقة طبعه كان الوصول إليه أقرب إليه من طبعه\n ومَن سار إلى الله بمخالفة طبعه كان الوصول إليه على قدر بُعده عن طبعه\n وفيه مشقة وحرج\n ولذا قال تعالى: { ولا تُضاروهن لتُضيقوا عليهن } لئلا تمل وترجع من حيث جاءت\n ولذلك قال صلى الله عليه وسلم:\n \" لا يكن أحدكم كالمُنْبَت\n فلا أرضاً قطع ولا ظهراً أبقى \" \n\n نعم مخالفة طبعها في حب الظهور والجاه\n أو حب الدنيا\n واجب حتماً لا رخصة فيه\n وهذه سيرة أشياخنا رضي الله عنهم لا يُضيقون على المريد في جوع ولا عطش\n ولا كثرة رياضة\n وإنما يأمرونه بالخمول وتخريب الظاهر والزهد التام\n والورع الكامل\n فقد سمعت شيخ شيخنا مولاي العربي الدرقاوي الحسني رضي الله عنه يقول: سُدُّوا باب الطمع\n وافتحوا باب الورع\n واللهِ إن فعلتم ذلك حتى يستولي باطنكم على ظاهركم\n هـ\n أي: تستولي المعاني على الحس\n فيتحقق الشهود الكامل\n وكان أيضاً يقول: نحن لسنا مع جوعٍ ولا مع شبعة\n نحن مع الله\n هـ\n أي: غائبون عن الجوع والشبع في ذكر الله وشهوده\n وإن كن أُولات حَمل\n أي: ثقل من كثرة العلائق\n فأّنْفِقوا عليهن من الواردات الإلهية بصُحبة الرجال\n حتى تصادم تلك العلائق\n فتهدمها\n فتضع الحمل عنها\n فإن أرْضَعْن لكم\n بإن تهذبت ورجعت روحانيةً تأتيك بالعلوم التي يرتضع منها القلب باليقين والمعرفة\n فأتوهن أجورهن من البرّ بها والرفق\n وائتمروا بينكم بمعروف\n فتُؤمر أنت بالإحسان إليها\n وتُؤمر هي بالطاعة لك\n وإن تعاسرتم\n بأن ضعفت هِمتكم\n وقلّت أمدادكم\n بعدم صحبة أهل الإمداد\n فستُرضع له نفس أخرى\n أي: فليتخذ شيخاً كاملاً يُرضع له نفسه من ثدي أسرار العلوم والمعارف\n ولذلك قيل: مَن لا شيخ له فالشيطان شيخه\n لِيُنفق ذو سعة من سعته\n وهم الواصلون العارفون\n يُنفقون من سعة علومهم وأسرارهم\n على المريدين الذي استرضعوهم\n ومَن قُدر عليه رزقه من المريدين السائرين فليُنفق مما آتاه الله على مَن تعلقَ به من المريدين\n لا يُكلف الله نفساً إلاّ ما آتاها\n سيجعل الله بعد عُسرٍ وضيقِ في العلوم والأسرار يُسراً\n فتتسع عليه العلوم والأسرار بعد التمكين\n\nوالله تعالى أعلم\n ثم هدّد مَن تعدّى الحدود\n فقال: { وَكَأِيِّن مِّن قَرْيَةٍ عَتَتْ عَنْ أَمْرِ رَبِّهَا }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:42",
      "similarity": 0.61578495164137
    },
    {
      "verse": "38:86",
      "similarity": 0.5312763102836486
    },
    {
      "verse": "92:10",
      "similarity": 0.5239215753926024
    },
    {
      "verse": "23:62",
      "similarity": 0.5122375442242998
    },
    {
      "verse": "2:280",
      "similarity": 0.48968846164632346
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/65:7.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/65:7.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/65:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}