{
  "chapter": "الطلاق",
  "text": "وكاين من قرية عتت عن امر ربها ورسله فحاسبنها حسابا شديدا وعذبنها عذابا نكرا",
  "translations": [
    {
      "translation": "How many habitations rebelled against their Lord's command and His apostles; but We took them to severe task, and punished them with the harshest punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many towns rebelled against the commandment of their Lord and His Messengers. Then We called them to a stern accounting, and subjected them to a harrowing chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a town has disobeyed its Lord and His Messenger! For them Our questioning was strict and Our punishment severe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many a town existed that rebelled against the command of its Lord and His Noble Messengers, so We took a severe account from it – and struck them with a dreadful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many a town revolted against the command of its Lord and His Messengers; and We called it to a severe account, and We shall punish it with a horrible torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a town which rebelled against the commandment of its Lord and His apostles, so We called it to account severely and We chastised it (with) a stern chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a city turned in disdain from the commandment of its Lord and His Messengers; and then We made with it a terrible reckoning and chastised it with a horrible chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a community revolted against the ordinance of its Lord and His messengers, and We called it to a stern account and punished it with dire punishment,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a town rebelled against the commands of its Lord and His messengers and We called them sternly to account and punished them severely,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a city trespassed the commandment of its Lord and His apostles! Wherefore We reckoned with them a stern reckoning, and We tormented them With a torment unheard of.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a town defied the command of its Lord and His apostles, then We called it to a severe account and punished it with a dire punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many populations that insolently opposed the Command of their Lord and of His messengers, did We not then call to account,- to severe account?- and We imposed on them an exemplary Punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many a town (population) revolted against the Command of its Lord and His Messengers, and We called it to a severe account (i.e. torment in this worldly life), and shall punish it with a horrible torment (in Hell, in the Hereafter).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a village has turned in its pride against the Order of their Lord and His Messengers! We made it a stern reckoning, and punished it with a horrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a town defied the command of its Lord and His messengers? So We held it strictly accountable, and We punished it with a dreadful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a city was insolent toward the command of its Lord and His messengers, so We took it to severe account and punished it with a terrible punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[65:8] And how many (ka’ayyin: the kāf is the genitive prepositional particle which has been added to ayy, ‘which’, to give the meaning of kam, ‘how many’) a town — that is to say, many a town, meaning its inhabitants, disobeyed the command of its Lord and His messengers, then We called it, in the Hereafter — even if it has not yet arrived, [God says so] because of the fact that it will surely come to pass — to a severe reckoning and chastised it with a dire chastisement (read nukran or nukuran), namely, the chastisement of the Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And how many a community) how many people of a community (revolted against the ordinance of its Lord) transgressed and refused to obey the commands of their Lord (and His messenger) and rejected the messengers and the messages they brought to them, (and we called it to a stern account) in the Hereafter (and punished it) in the life of the world (with dire punishment) with severe punishment,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَعَذَّبْنَاهَا عَذَاباً نُّكْراً } يعني شَديداً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على وجه الوعيد للموسرين: { وَكَأِيِّن مِّن قَرْيَةٍ } أي: كثيراص من أهل قرية { عَتَتْ } أعرضت واستكبرت { عَنْ أَمْرِ رَبِّهَا وَ } متابعة { رُسُلِهِ } المرسلين من عنده إياها اتكالاً على ما عندهم من المال والثروة، والتفاخر على الأقران، والتفوق عليهم بأنواع النخوة والعدوان { فَحَاسَبْنَاهَا حِسَاباً شَدِيداً } أي: عن القليل والكثير، والنقير والقمطير { وَ } بعدما حاسبناها كذلك { عَذَّبْنَاهَا عَذَاباً نُّكْراً } [الطلاق: 8] منكراً فجيعاً فظيعاً؛ والمراد: حساب النشأة الأخرى وعذابها، عبَّر بالماضي؛ لتحقق وقوعها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وكَأَيِّن من قريةٍ } أي: كثير من أهل قرية { عَتَتْ } أعرضت { عن أمر ربها ورُسلِه } أي: عن طاعتهما على وجه العتوّ والعناد، { فحاسبناها حِساباً شديداً } بالاستقصاء والتنقير والمباحثة في كل نقير وقطمير، { وعذَّبناها عذاباً نُكراً } منكراً فظيعاً، والمراد: إمّا عذاب الآخرة، والتعبير بالماضي لتحقُّق وقوعه، أو عذاب الدنيا، وهو أرجح لأنه سيذكر عذاب الآخرة بعدُ بقوله: { أعدّ اللهُ لهم عذاباً شديداً\n\n",
      "translations": []
    }
  ]
}