{
  "chapter": "الطلاق",
  "text": "فذاقت وبال امرها وكان عقبة امرها خسرا",
  "translations": [
    {
      "translation": "They tasted the evil consequences of what they did and the end of their affair was total loss.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they tasted the pain of their actions; and the consequence of their deeds was ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they tasted the evil fruit of their deeds; and the fruit of their deeds was utter loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They suffered the consequences of their deeds and their end was perdition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They therefore tasted the evil outcome of their deeds, and the outcome of their deeds was a loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it tasted the evil result of its affair, and the consequence of its affair was loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it tasted the evil result of its conduct, and the end of its affair was perdition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it tasted the mischief of its action, and the end of its affair was loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that it tasted the ill-effects of its conduct, and the consequence of its conduct was loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so they tasted the evil consequences of their conduct and the result of their conduct was ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore they tasted the evil consequence of their affair, and the end of their affair was loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it tasted the evil consequences of its conduct, and the outcome of its conduct was ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then did they taste the evil result of their conduct, and the End of their conduct was Perdition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it tasted the evil result of its disbelief, and the consequence of its disbelief was loss (destruction in this life and an eternal punishment in the Hereafter).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So it tasted the mischief of its action, and the end of its matter was loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It tasted the result of its decisions, and the outcome of its decisions was perdition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it tasted the bad consequence of its affair, and the outcome of its affair was loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[65:9] So it tasted the evil consequences of its conduct, the punishment for it, and the consequence of its conduct   was [utter] loss, failure and destruction.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So that it tasted the ill effects of its conduct) it tasted the punishment of its course in the life of the world through being destroyed, (and the consequence of its conduct) in the Hereafter (was loss) will be loss.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَذَاقَتْ } حينئذٍ { وَبَالَ أَمْرِهَا } أي: إعراضها عن الله وأهله ذوقاً محيطاً بها، بحيث لا يخلو من العذاب شيء من أعضائها وأجزائها { وَ } بالجملة: { كَانَ عَاقِبَةُ أَمْرِهَا } الذي كان عليه في النشأة الأولى { خُسْراً } [الطلاق: 9] في النشأة الأخرى، وأيّ خسر لا خسر أشد منه وأكبر، وهو حرمانهم عن عز والقبول الإلهي، وانحطاطهم عن رتبة الخلافة والنيابة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n } الخ، { فذاقت وَبَالَ أمرِها } أي: وخامة شأنها، وعقوبة فعلها\n قال في الصحاح: والوَبَلَة ـ بالتحريك: الثِقَّلُ والوخَامةُ، وقد وَبُل المرتعُ بالضم وَبْلاً ووَبَالاً، فهو وَبيلٌ، أي: وخِيمٌ\n هـ\n وفي القاموس: وبُلَ ككَرُمَ وبَالةً ووبالاً ووبُولاً، وأرض وَبِيلَةٌ: وخيمةُ المرتَعِ\n هـ\n { وكان عاقبةُ أمرها خُسراً } أي: خساراً وهلاكاً",
      "translations": []
    }
  ]
}