{
  "chapter": "التحريم",
  "text": "وضرب الله مثلا للذين ءامنوا۟ امرات فرعون اذ قالت رب ابن لى عندك بيتا فى الجنة ونجنى من فرعون وعمله ونجنى من القوم الظلمين",
  "translations": [
    {
      "translation": "Allah has made an example for those who have iman: the wife of Pharaoh when she said, 'My Lord, build a house in the Garden for me in Your presence and rescue me from Pharaoh and his deeds and rescue me from this wrongdoing people.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And God presents the example of Pharaoh's wife for those who believe, when she said: \"O Lord, build me a house in Paradise, and save me from Pharaoh and his deeds, and save me from a wicked people;\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has set forth for the believers the parable of Pharaoh's wife. She prayed: “My Lord, build for me a house with You in Paradise and deliver me from Pharaoh and his misdeeds; and deliver me from the iniquitous people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the believers, as a parable, God has told the story of the wife of the Pharaoh who said, \"Lord, establish for me a house in Paradise in your presence. Rescue me from Pharaoh and his deeds and save me from the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah illustrates an example of the Muslims – the wife of Firaun; when she prayed, “My Lord! Build a house for me near You, in Paradise, and deliver me from Firaun and his works, and rescue me from the unjust people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has set forth an example for those who believe: the wife of Fir`awn, when she said: \"My Lord! Build for me a home with You in Paradise, and save me from Fir`awn and his work, and save me from the people who are wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah sets forth an example to those who believe the wife of Firon when she said: My Lord! build for me a house with Thee in the garden and deliver me from Firon and his doing, and deliver me from the unjust people:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has struck a similitude for the believers -- the wife of Pharaoh, when she said, 'My Lord, build for me a house in Paradise, in Thy presence, and deliver me from Pharaoh and his work, and do Thou deliver me from the people of the evildoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah citeth an example for those who believe: the wife of Pharaoh when she said: My Lord! Build for me a home with thee in the Garden, and deliver me from Pharaoh and his work, and deliver me from evil-doing folk;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the believers God has given the example of Pharaoh's wife who said: \"My Lord, build me a house in nearness to You in Paradise and save me from Pharaoh and his misdeeds. Save me from all evil-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah propoundeth for those who believe the similitude of the wife Of Fir'awn, when she said: 'my Lord! build me in Thine presence a house in the Garden, and deliver me from Fir'awn and his handiwork, and deliver me from the transgressing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah cites an example of the faithful: the wife of Pharaoh, when she said, ‘My Lord! Build me a home near You in paradise, and deliver me from Pharaoh and his conduct, and deliver me from the wrongdoing lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah sets forth, as an example to those who believe the wife of Pharaoh: Behold she said: \"O my Lord! Build for me, in nearness to Thee, a mansion in the Garden, and save me from Pharaoh and his doings, and save me from those that do wrong\";\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah has set forth an example for those who believe, the wife of Fir'aun (Pharaoh), when she said: \"My Lord! Build for me a home with You in Paradise, and save me from Fir'aun (Pharaoh) and his work, and save me from the people who are Zalimun (polytheists, wrong-doers and disbelievers in Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But to those who believe Allah has given as an example Pharaoh's wife, who said: 'My Lord, build me a house before You in Paradise and save me fromPharaoh and his work, and save me from a harmdoing nation'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And God illustrates an example of those who believe: the wife of Pharaoh, when she said, “My Lord, build for me, with you, a house in Paradise, and save me from Pharaoh and his works, and save me from the wrongdoing people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah presents an example of those who believed: the wife of Pharaoh, when she said, \"My Lord, build for me near You a house in Paradise and save me from Pharaoh and his deeds and save me from the wrongdoing people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[66:11] And God has struck a similitude for those who believe: the wife of Pharaoh — she believed in Moses, her name was Āsiya; Pharaoh chastised her by tying her hands and feet to pegs and placing a huge millstone on her chest, and having her laid out in the sun; but when those in charge of her would leave her, the angels would [come to] shade her — when she said, during her torture, ‘My Lord, build for me a home near You in Paradise, — so He disclosed for her [a veil of the Unseen] and she saw it, which in turn alleviated for her the torture — and deliver me from Pharaoh and his work, his torture, and deliver me from the evildoing folk’, the followers of his [Pharaoh’s] religion, whereat God took [unto Himself] her spirit [in death]. Ibn Kaysān said, ‘She was raised to Paradise alive, where she eats and drinks’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then encouraged them to repent and be good and follow the example of Asiyah Bint Muzahim and Mary daughter of Amran, saying: (And Allah citeth an example) Allah explained the trait to be followed (for those who believe) giving the example of two Muslim women: (the wife of Pharaoh) Asiyah Bint Muzahim (when she said) regarding Pharaoh's torture of her: (My Lord! Build for me a home with Thee in the Garden) so that Pharaoh's torture becomes bearable for me, (and deliver me from Pharaoh) from the religion of Pharaoh (and his work) and his torture, (and deliver me from evil doing folk) the disbelievers. Thus the disbelief of her husband did not harm her because of her faith and sincerity;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَضَرَبَ ٱللَّهُ } أيضاً { مَثَلاً } آخر { لِّلَّذِينَ آمَنُواْ ٱمْرَأَتَ فِرْعَوْنَ } شبَّه حال المؤمنين في وصلة الكافرين بحال امرأة فرعون مع فرعون، وعدم تضرر إيمانها منه، بل تأكد إيمانها بصحبة زوجها فرعون - لعنه الله - اذكر { إِذْ قَالَتْ } امرأة فعرون بعدما انكشفت بسرائر التوحيد، مناجية إلى ربها: { رَبِّ } يا من ربَّاني بأنواع الكرامة، ووفقني على توحيدك { ٱبْنِ لِي عِندَكَ بَيْتاً فِي ٱلْجَنَّةِ } وذلك لمَّا آمنت حين غلب موسى على السحرة فآمنوا له بعدما غلبوا، فقتلهم فرعون، وأمر بزجرها، وأوتدها بالأوتاد الأربعة في حر الشمس؛ حتى ترجع عن الإيمان ولم ترجع، ثمَّ أمر اللعين أن يوضع فوقها صخرة عظيمة، فقالت حينئذٍ مناجية مع ربها من كمال تحننها وانكشافها: { رَبِّ ٱبْنِ لِي عِندَكَ بَيْتاً فِي ٱلْجَنَّةِ وَنَجِّنِي مِن فِرْعَوْنَ } الخبيث { وَعَمَلِهِ } السيئ { وَ } بالجملة: { نَجِّنِي مِنَ ٱلْقَوْمِ ٱلظَّالِمِينَ } [التحريم: 11] الخارجين عن ربقة عبوديتك بإيمانهم بهذا اللعين الطاغي، واعتقادهم بألوهيته وربوبيته، فماتت قبل وضع الصخرة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وضَرَبَ اللهُ مثلاً للذين آمنوا } في أنهم ينفعهم إيمانهم، ولو كانوا تحت قهرية الكفرة، حيث لم يميلوا عنه، { امرأة فرعونَ } ، وهي أسية بنت مزاحم، وهي عمة موسى عليه السلام، آمنت به فعذّبها بالأوتاد الأربعة، وتَدَ يديها ورجليها وألقاها في الشمس على ظهرها، وألقى عليها صخرةَ عظيمة، فأبصرت بيتَها في الجنة، من دُرة، وانتزع اللهُ روحَها، فلقيتها الصخرة بلا روح، فلم تجد ألماً، وقال سَلْمَان: كانت امرأة فرعون تُعذَّب بالشمس، فإذا انصرفوا عنها أظلتها الملائكة، وفيه بيان أنها لم تمِل عن الإيمان مع شدة ما قاست من العذاب، وكذا فليكن صوالح النساء، وأمر عائشة وحفصة أن يكونا كآسية هذه\n هـ\n من الثعلبي\n { إِذ قالتْ }: ظرف لمحذوف أي: ضرب مثلاً لحالها حين قالت: { رَبِّ ابْنِ لي عندكَ } أي: قريباً من رضوانك { بيتاً في الجنة } أو: في أعلى درجات المقربين، رُوي: أنها لَمّا قالت ذلك أُريت بيتها في الجنة\n { ونجِّني من فرعونَ وعملِهِ } أي: من نفسه الخبيثة وعمله السيىء { ونجني من القوم الظالمين } أي: من القبط التابعين له في الظلم قال الحسن وابن كيسان: نجاها الله أكرمَ نجاةٍ، ورفعها إلى الجنة، فهي فيها تأكل وتشرب\n\n\nهـ",
      "translations": []
    }
  ]
}