{
  "chapter": "التحريم",
  "text": "ضرب الله مثلا للذين كفروا۟ امرات نوح وامرات لوط كانتا تحت عبدين من عبادنا صلحين فخانتاهما فلم يغنيا عنهما من الله شيـا وقيل ادخلا النار مع الدخلين",
  "translations": [
    {
      "translation": "Allah has made an example for those who are kafir: the wife of Nuh and the wife of Lut. They were Allah. They were told, 'Enter the Fire along with all who enter it.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God advances the example of Noah's wife and the wife of Lot for those who do not believe. They were married to Our two pious devotees, but they were unfaithful to them, and even (the apostles) could not avail them in the least against God; and it was said to them: \"Enter Hell with those (who are condemned) to enter it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has set forth for the unbelievers the parable of the wives of Noah and Lot. They were wedded to two of Our righteous servants, but each acted treacherously with her husband, and their husbands could be of no avail to them against Allah. The two of them were told: “Enter the Fire with all the others who enter it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has told the disbelievers the story of the wives of Noah and Lot as a parable. They were married to two of Our righteous servants but were unfaithful to them. Nothing could protect them from the (wrath) of God and they were told to enter hell fire with the others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah illustrates the example of the disbelievers – the wife of Nooh and the wife of Lut; they were bonded in marriage to two of Our bondmen deserving Our proximity – they then betrayed them so they did not benefit them the least against Allah and it was declared, “Both of you women enter the fire, along with others who enter.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sets forth an example for those who disbelieve: the wife of Nuh and the wife of Lut. They were under two of our righteous servants, but they both betrayed them. So, they availed them not against Allah and it was said: \"Enter the Fire along with those who enter!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sets forth an example to those who disbelieve the wife of Nuh and the wife of Lut: they were both under two of Our righteous servants, but they acted treacherously towards them so they availed them naught against Allah, and it was said: Enter both the fire with those who enter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has struck a similitude for the unbelievers -- the wife of Noah, and the wife of Lot; for they were under two of Our righteous servants, but they betrayed them, so they availed them nothing whatsoever against God; so it was said, 'Enter, you two, the Fire with those who enter.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah citeth an example for those who disbelieve: the wife of Noah and the wife of Lot, who were under two of Our righteous slaves yet betrayed them so that they (the husbands) availed them naught against Allah and it was said (unto them): Enter the Fire along with those who enter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As an example to those who are bent on denying the truth, God cited the wife of Noah and the wife of Lot, who were married to two of Our righteous servants, but who betrayed them. So they could not help them against God, and they were told, \"Enter the Fire along with all the others.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah propoundeth for those who disbelieve the similitude of the wife of Nuh and the wife of Lut. They were under two of our righteous bondmen; then they defrauded them. Wherefore the twain availed them naught against Allah, and it was said: enter ye twain the Fire with those who enter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah cites an example of the faithless: the wife of Noah and the wife of Lot. They were under two of our righteous servants, yet they betrayed them. So they did not avail them in any way against Allah, and it was said [to them], ‘Enter the Fire, along with those who enter [it].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sets forth, for an example to the Unbelievers, the wife of Noah and the wife of Lut: they were (respectively) under two of our righteous servants, but they were false to their (husbands), and they profited nothing before Allah on their account, but were told: \"Enter ye the Fire along with (others) that enter!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah sets forth an example for those who disbelieve, the wife of Nuh (Noah) and the wife of Lout (Lot). They were under two of our righteous slaves, but they both betrayed their (husbands by rejecting their doctrine) so they [Nuh (Noah) and Lout (Lot)] benefited them (their respective wives) not, against Allah, and it was said: \"Enter the Fire along with those who enter!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has given as an example for the unbelievers, the wife of Noah and the wife of Lot. They were married to two of Our righteous worshipers, but theybetrayed them. It was not for (Noah and Lot) to avail them a thing. It was said to them both: 'Enter the Fire with those who shall enter'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God illustrates an example of those who disbelieve: the wife of Noah and the wife of Lot. They were under two of Our righteous servants, but they betrayed them. They availed them nothing against God, and it was said, “Enter the Fire with those who are entering.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah presents an example of those who disbelieved: the wife of Noah and the wife of Lot. They were under two of Our righteous servants but betrayed them, so those prophets did not avail them from Allah at all, and it was said, \"Enter the Fire with those who enter.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[66:10] God has struck a similitude for those who disbelieve: the wife of Noah and the wife of Lot. They were under two of Our righteous servants, yet they betrayed them, in [their] religion, for they both disbelieved — Noah’s wife, called Wāhila, used to say to his people that he was a madman, while Lot’s wife, called Wā‘ila, used to tell his people the whereabouts of his guests when they stayed with him, at night by lighting a fire, and during the day by making smoke. So they, that is, Noah and Lot, did not avail the two women in any way against God, against His chastisement, and it was said, to the two women: ‘Enter, both of you, the Fire along with the incomers’, from among the disbelievers of the peoples of Noah and Lot.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah warned 'A'ishah and Hafsah because they hurt the Prophet (pbuh) by mentioning the example of the wives of Noah and Lot, saying: (Allah citeth) Allah explains (an example) a trait (for those who disbelieve) by mentioning the two disbelieving women: (the wife of Noah) Wahilah (and the wife of Lot) Wa'ilah, (who were under two of our righteous slaves) messengers (yet betrayed them) yet opposed them in religion, displaying belief outwardly while hiding their disbelief inwardly, such that they kept their hypocrisy in their hearts; but they did not betray their husbands in the sense that they committed adultery, for no wife of a prophet had ever done this, (so that they the husbands availed them naught) benefited them naught 677 (against Allah) against the chastisement of Allah; i.e. the righteousness of their husbands did not benefit them while they were disbelievers (and it was said (unto them): Enter the Fire) in the Hereafter (along with those who enter) the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَخَانَتَاهُمَا } معناه كانتْ امرأةُ نُوحٍ عليهِ السّلامُ، تُخبرُ النّاسَ أنهُ مَجنونٌ\n وكانتْ امرأةُ لوطٍ عليهِ السّلامُ تَدُلُ النَّاسَ عَلى الأَضيافِ\n وما زَنتْ امرأةُ نَبي قَطْ\n\n",
      "translations": [
        {
          "translation": "\nAnd his saying, {So they both betrayed him}, means that the wife of Noah - peace be upon him - informed the people that he was crazy.\n\n\nAnd the wife of Lot (peace be upon him) was leading people to the guests.\n And you were not the wife of a prophet\n\nAnd you were not the wife of a prophet",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { ضَرَبَ ٱللَّهُ } العليم الحكيم { مَثَلاً لِّلَّذِينَ كَفَرُواْ ٱمْرَأَتَ نُوحٍ وَٱمْرَأَتَ لُوطٍ } وشبَّه حال الكفرة بحالهما في عدم دفع صحبتهم مع المؤمنين، ومحبتهم معهم شيئاً من عذاب الله؛ إذ { كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا } وهم نوح ولوط - عليهما السلام - { صَالِحَيْنِ } لقبولنا، مصلحين لأعمالهما وأخلاقهما، وعموم أطوارها { فَخَانَتَاهُمَا } أي: تلكما المرأتان بالنفاق { فَلَمْ يُغْنِيَا } ولم يدفعا؛ أي: العبدان { عَنْهُمَا } أي: عن تلك المرأتين { مِنَ } عذاب { ٱللَّهِ } المنتقم الغيور { شَيْئاً } من الإغناء، بل { وَقِيلَ ٱدْخُلاَ ٱلنَّارَ } المعدة للكفار والعصاة { مَعَ } سائر { ٱلدَّاخِلِينَ } [التحريم: 10] فيها بلا مبالاة إلى زوجيهما\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: \" مثلاُ \": مفعول ثان لضرب، أي: جعل، و \" امرأةَ \": مفعول أول، أي: جعل امرأة نوح وامرأة لوط مثلاُ مضروباً للذين كفروا\n يقول الحق جلّ جلاله: { ضَرَبَ اللهُ مثلاً للذين كفروا } ، ضَرْبُ المثل في أمثال هذه المواقع عبارة عن: إيراد حالة غريبة ليُعرف بها حالة أخرى، مشاكِلة لها في الغرابة، أي: ضرب الله مثلاً لحال الذين كفروا حيث يُعاقَبون على كفرهم وعداوتهم للمؤمنين، ولا ينفعهم ما كان بينهم وبين المؤمنين من النسب والمصاهرة بهاتين المرأتين، { امرأتَ نوحٍ وامرأتَ لوطٍ } قيل: اسم الأولى: واهلة، والثانية: راعلة، { كانتا تحت عبدين من عبادنا صَالِحَينِ } أي: كانتا في عصمة نبييْن عظيميْن، متمكنين من تحصيل خير الدنيا والأخرة، وحيازة سعادتهما، { فخانتاهما } بإفشاء سرهما، أو بالكفر والنفاق، { فلم يُغنيا عنهما من الله شيئاً } أي: فلم يُغن الرسولان عن المرأتين بحق ما بينهما من الزواج شيئاً من الإغناء من عذاب الله تعالى، { وقيل } لهما عند موتهما، أو يومَ القيامة: { ادخلا النارَ مع الداخلين } أي: مع سائر الداخلين من الكفرة، الذين لا وصلة بينهم وبين الأنبياء\n قال القشيري: لما سبقتً للمرأتين الفُرْقةُ يوم القِسْمة لم تنفعهما القرابةُ يومَ العقوبة\n هـ\n قال ابن عطية: وقول مَن قال: إنَّ في المثلَين عبرة لأزواج النبي صلى الله عليه وسلم بعيد\n هـ\n قلت: لا بُعد فيه لذكره إثر تأديب المرأتين، وليس فيه غض لجانبهنّ المعظم، إنما فيه إيقاظ وإرشاد لما يزيدهم شرفاً وقُرباً من تعظيم الرسول صلى الله عليه وسلم وطاعته، وصيانة سِره، والمسارعة إلى ما فيه محبتُه ورضاه، وكل مَن نصحك فقد أحبّك، وكل مَن أهملك فقد مقتك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:27",
      "similarity": 0.47775716652765154
    },
    {
      "verse": "12:52",
      "similarity": 0.4350367440994041
    },
    {
      "verse": "4:107",
      "similarity": 0.42097321699567664
    },
    {
      "verse": "40:19",
      "similarity": 0.4084310694141806
    },
    {
      "verse": "8:71",
      "similarity": 0.40275567693614184
    }
  ]
}