{
  "chapter": "التحريم",
  "text": "يايها النبى لم تحرم ما احل الله لك تبتغى مرضات ازوجك والله غفور رحيم",
  "translations": [
    {
      "translation": "O Prophet! Why do you make haram what Allah has made halal for you, seeking to please your wives? Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O PROPHET, WHY should you forbid (yourself) what God has made lawful for you, in order to please your wives? Yet God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, why do you forbid what Allah has made lawful for you? Is it to please your wives? Allah is Most Forgiving, Most Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prophet, in seeking the pleasure of your wives, why do you make unlawful that which God has made lawful. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O dear Prophet (Mohammed – peace and blessings be upon him)! Why do you forbid for yourself the things that Allah has made lawful for you? You wish to please some of your wives; and Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Why do you forbid that which Allah has allowed to you, seeking to please your wives And Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! why do you forbid (yourself) that which Allah has made lawful for you; you seek to please your wives; and Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, why forbiddest thou what God has made lawful to thee, seeking the good pleasure of thy wives? And God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Why bannest thou that which Allah hath made lawful for thee, seeking to please thy wives? And Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prophet, why in your desire to please your wives, do you impose a ban on what God has made lawful to you? God is forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O prophet! why makest thou unlawful that which Allah hath made lawful Unto thee, seeking the good-will of thy wives! And Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Why do you disallow [yourself] what Allah has made lawful for you, seeking to please your wives? And Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Why holdest thou to be forbidden that which Allah has made lawful to thee? Thou seekest to please thy consorts. But Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Why do you ban (for yourself) that which Allah has made lawful to you, seeking to please your wives? And Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, why do you forbid that which Allah has made lawful to you. Do you seek to please your wives' Allah is the Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O prophet! Why do you prohibit what God has permitted for you, seeking to please your wives? God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, why do you prohibit [yourself from] what Allah has made lawful for you, seeking the approval of your wives? And Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[66:1] O Prophet! Why do you prohibit what God has made lawful for you, in terms of your Coptic handmaiden Māriya — when he lay with her in the house of Hafsa, who had been away, but who upon returning [and finding out] became upset by the fact that this had taken place in her own house and on her own bed — by saying, ‘She is unlawful for me!’, seeking, by making her unlawful [for you], to please your wives? And God is Forgiving, Merciful, having forgiven you this prohibition.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (O Prophet!): '(O Prophet!) i.e. Muhammad (pbuh). (Why bannest thou that which Allah hath made lawful for thee) i.e. marrying Maria the Copt, the Mother of Ibrahim; that is because he had forbidden himself from marrying her, (seeking to please thy wives) seeking the pleasure of your wives 'A'ishah and Hafsah by forbidding yourself from marrying Maria the Copt? (And Allah is Forgiving) He forgives you, (Merciful) about that oath.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يٰأَيُّهَا ٱلنَّبِيُّ } المؤيد بالوحي والإلهام من عند العليم العلام، القدوس السلام مقتضى نبوتك وتأييدك: ألاَّ تخالف حكم الله، ولا تبادر إلى الخروج عما قضى الله { لِمَ تُحَرِّمُ } وتمنع عن نفسك من عندك بلا ورود نهي من قِبَل الحق { مَآ أَحَلَّ ٱللَّهُ لَكَ } وأباحه عليك بمقتضى حكمته وعدالته { تَبْتَغِي } بتحريم الحلال على نفسك { مَرْضَاتَ أَزْوَاجِكَ } وتترك رضا الله بمخالفة حكمه؟! فارتدع عن فعلك هذا، واستغفر الله لزلتك { وَٱللَّهُ } المطلع على نيتك وإخلاصك { غَفُورٌ } يعفو عنك ما صدر منك { رَّحِيمٌ } [التحريم: 1] يرحمك ويقبل توبتك\n\n\n\n\nرُوي أن رسول الله صلى الله عليه وسلم خلا بأَمَته مارية في يوم حفصة، فاطلعت حفصة على ذلك فعاتبته، فقال صلى الله عليه وسلم: حرمت مارية على نفسي لأجلك، لا تقولي لأحد من أزواجي، واستكتمي عنهن هذا التحريم، وأيضاً الخلافة بعدي لأبي بكر وبعده لعمر، ولا تفش لأحد قط، فأخبرت حفصة عائشة بكلا الخبرين؛ لكونهما متصادقتين، فأخبرت عائشة رسول الله صلى الله عليه وسلم بها، فغضب صلى الله عليه وسلم وطلق حفصة طلاقاً رجعياً، وعزل نساءه تسعاً عشرين يوماً؛ لأجل هذه الواقعة، فأنزل الله تعالى: { يٰأَيُّهَا ٱلنَّبِيُّ }\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق\n\n \" جلّ جلاله: { يا أيها النبي لِمَ تُحَرِّمُ ما أحلَّ اللهُ }\n في سبب نزول هذه السورة روايتان إحداهما: أنَّ رسول الله صلى الله عليه وسلم جاء يوماً إلى بيت زوجه حفصة، فوجدها ذهبت لزيارة أبيها، فبعث إلى جاريته مارية، فقال معها في البيت، فجاءت حفصة، فقالت: يا رسول الله أما كان في نسائك أهون مني، أتفعل هذا في بيتي، وعلى فراشي؟ فقال لها عليه الصلاة والسلام: \" أيُرضيك أن أُحَرِّمها \"؟ فقالت: نعم، فقال: \" إني قد حَرّمتها \" زاد ابن عباس: وقال مع ذلك: \" والله لا أطؤها أبداً \" ، ثم قال لها: \" لاتُخبري بهذا أحداً، وأُبشرك أنَّ أبا بكر وعمر يملكان بعدي أمر أمتي \" \n\nثم إنِّ حفصة قرعت الجدار الذي بينها وبين عائشة، وأخبرتها، وكانتا مصادقتين، ولم ترَ في إفشائها حَرَجاً، واستكتمتها، فأوحى الله إلى نبيه بذلك\n ورُوي أنه عليه السلام طلَّق حفصة، واعتزل نساءه، فمكث تسعاً وعشرين ليلة في بيت مارية، فنزل جبريلُ، وأمره برَدِّها، وقال له: إنها صوّامة قوّامة، وإنها من نسائك في الجنة، فردَّها\n والرواية الثانية:\n\n \" أنه عليه الصلاة والسلام كان يدخل على زوجه زينب بنت جحش، فتسقيه عسلاً، فاتفقت عائشةُ وحفصة وسودة على أن تقول له مَن دنا منهن: أكلتَ مغافير، وهو ضمغ العُرفُط، وهو حلو كريه الريح، ففعل ذلك، فقال رسولُ الله صلى الله عليه وسلم: \" لا، ولكني شربتُ عسلاً \" ، فقُلن له: جَرَست نحلُه العُرفُط أي: أكلت، ويقال للنحل: جراس، فقال صلى الله عليه وسلم: \" لا أشربه أبداً \" ، وكان يكره أن توجد منه رائحة كريهة، فدخل بعد ذلك على زينب، فقالت: ألاَ أسقيك من ذلك العسل؟ فقال: \" لا حاجة لي به \" فنزلت الآية عتاباً له على أن ضيَّق على نفسه تحريم الجارية والعسل \" \n\nوالرواية الأولى أشهر عند المفسرين والثانية خرّجها البخاري في صحيحه\n فإن قلتَ: لِمَ عاتبه اللهُ على هذا التحريم، ولم يعاتب يعقوبَ على تحريم لحوم الإبل على ما ذكر في سورة آل عمران؟ قلتُ: رتبة نبينا ـ عليه الصلاة والسلام ـ أرفع في المحبة والاعتناء، فلم يرضَ منه أن يُضيّق على نفسه، أرأيت إن كان لك ولد تُحبه، ووسعتَ عليه، ثم أراد أن يُضيّق على نفسه، فإنك لا ترضى له ذلك، محبةً فيه، وشفقة عليه\n وانظر تفسير ابن عرفة\n قال ابن جزي: ولنتكلم على فقه التحريم: فأمّا تحريم الطعام والمال وسائر الاشياء ما عدا النساء فلا يلزم، ولا شيء عليه فيه عند مالك، وأوجب عليه أبو حنيفة كفارة اليمين، وأمّا تحريم الأَمة فإن نوى به العتق لزم، وإن لم ينو به ذلك لم يلزم، وكان حكمه ما ذكرناه في الطعام، وأمَا تحريم الزوجة، فاختلف الناس فيه على أقوال كثيرة، فقال أبو بكر الصدّيق وعمر بن الخطاب وابن عباس وعائشة وغيرهم: إنما يلزم فيه كفارة يمين\n\n\nهـ\n قلت: وظاهره: سواء قال لها: أنتِ حرام، أو حلف بالحرام واحداً أو ثلاثاً، وسواء كان منجّزاً أومعلّقاً، كما إذا قال: كل امرأة تزوجتُها عليكِ فهي حرام، مثلاً، فلا يلزم من ذلك شيء على قول هؤلاء السادات رضي الله عنهم\n ثم قال: وقال مالك في المشهور عنه: هي ثلاث تطليقات في المدخول بها وينوي في غيرها، وقال ابن الماجشون: هي ثلاث في الوجهين، ورُوي عن مالك: أنها طلقة بائنة ـ قلتُ: وبهذا جرى العمل اليوم ـ وقيل: رجعية\n هـ\n { تبتغي مَرْضَاتَ أزواجِك }: حال، أو استئناف مُبيّن للحال الداعي، أي: تطلب رضا أزواجك بالتضييق على نفسك، والمراد: رضا حفصة، وهذا يُؤيد أنها نزلت في تحريم الجارية، وأمّا تحريم العسل فلم يقصد به رضا أزواجه، وإنما تركه لرائحته\n { واللهُ غفور } أي: غفور لك ما كان تركه أولى من الصدع بالحق من غير مبالاة بأحدٍ، ولا تُضيّق على نفسك، { رحيم } بك، حيث وسّع عليك، ولم يرضَ لك أن تُضيق على نفسك\n قال القشيري: ظاهرُ هذا الخطاب عتابٌ على كونه حَرَّمَ على نفسه ما أحلّه اللهُ لمراعاة قلب امرأته، والإشارة فيه: وجوب تقديم حق الله على كل شيء في كل وقت",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:87",
      "similarity": 0.4712176506371149
    },
    {
      "verse": "10:59",
      "similarity": 0.38546700633314135
    },
    {
      "verse": "3:50",
      "similarity": 0.3212757277110208
    },
    {
      "verse": "4:160",
      "similarity": 0.3183190789928399
    },
    {
      "verse": "90:2",
      "similarity": 0.28555203381154765
    }
  ]
}