{
  "chapter": "التحريم",
  "text": "ومريم ابنت عمرن التى احصنت فرجها فنفخنا فيه من روحنا وصدقت بكلمت ربها وكتبه وكانت من القنتين",
  "translations": [
    {
      "translation": "And Maryam, the daughter of 'Imran, who guarded her chastity - We breathed Our Ruh into her and she confirmed the Words of her Lord and His Books and was one of the obedient.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of Mary, daughter of 'Imran, who guarded her chastity, so that We breathed into her a new life from Us, and she believed the words of her Lord and His Books, and was among the obedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has also set forth the parable of Mary, the daughter of Imran, who guarded her chastity, and into whom We breathed of Our Spirit, and who testified to the words of her Lord and His Books. She was among the obedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has also told, as a parable, the story of Mary, daughter of Imran who preserved her virginity and (into whose womb) We breathed Our spirit. She made the words of her Lord and the predictions in His Books come true. She was an obedient woman.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the example of Maryam the daughter of Imran, who guarded her chastity – We therefore breathed into her a Spirit from Ourselves – and she testified for the Words of her Lord and His Books, and was among the obedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Maryam, the daughter of `Imran who guarded her chastity (private part). And We breathed into it through Our Ruh, and she testified to the truth of her Lords Kalimat, and His Kutub, and she was of the Qanitin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Marium, the daughter of Imran, who guarded her chastity, so We breathed into her of Our inspiration and she accepted the truth of the words of her Lord and His books, and she was of, the obedient ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Mary, Imran's daughter, who guarded her virginity, so We breathed into her of Our Spirit, and she confirmed the Words of her Lord and His Books, and became one of the obedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Mary, daughter of 'Imran, whose body was chaste, therefor We breathed therein something of Our Spirit. And she put faith in the words of her Lord and His scriptures, and was of the obedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[God gave another example in the story of] Mary, 'Imran's daughter, who preserved her chastity and We breathed Our spirit into her; she testified to the words of her Lord and His Scriptures, and was truly devout.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the similitude of Maryram daughter of lmran, who preserved her chastity, wherefore We breathed in it Of Our Spirit. And she testified to the words of her Lord and His Books and she was of the devout.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Mary, daughter of Imran, who guarded the chastity of her womb, so We breathed into it of Our spirit. She confirmed the words of her Lord and His Books, and she was one of the obedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Mary the daughter of 'Imran, who guarded her chastity; and We breathed into (her body) of Our spirit; and she testified to the truth of the words of her Lord and of His Revelations, and was one of the devout (servants).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Maryam (Mary), the daughter of 'Imran who guarded her chastity; and We breathed into (the sleeve of her shirt or her garment) through Our Ruh [i.e. Jibrael (Gabriel)], and she testified to the truth of the Words of her Lord [i.e. believed in the Words of Allah: \"Be!\" and he was; that is 'Iesa (Jesus) - son of Maryam (Mary); as a Messenger of Allah], and (also believed in) His Scriptures, and she was of the Qanitin (i.e. obedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, Mary, 'Imran's daughter, who guarded her chastity so We breathed into her of Our Spirit (Gabriel); and she put her trust in the Words of her Lord andHis Books, and was among the devout.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Mary, the daughter of Imran, who guarded her womb, and so We breathed into her of Our Spirit; and she believed in the truth of her Lord’s Words and His Books, and was one of the devout.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [the example of] Mary, the daughter of 'Imran, who guarded her chastity, so We blew into [her garment] through Our angel, and she believed in the words of her Lord and His scriptures and was of the devoutly obedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[66:12] And Mary (wa-Maryama is a supplement to imra’ata Fir‘awna) daughter of ‘Imrān, who preserved [the chastity of] her womb, so We breathed into it of Our Spirit, namely, Gabriel — when he breathed into the opening of her shirt, by God’s creation of this action of his which reached her womb, thus conceiving Jesus — and she confirmed the words of her Lord, His prescriptions, and His, revealed, Scriptures and she was of the obedient, [one] of the obedient folk.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَمَرْيَمَ ابْنَتَ عِمْرَانَ الَّتِي أَحْصَنَتْ فَرْجَهَا فَنَفَخْنَا فِيهِ مِنْ رُوحِنَا وَصَدَّقَتْ بِكَلِمَاتِ رَبِّهَا وَكُتُبِهِ وَكَانَتْ مِنَ الْقَانِتِينَ (12)عطف على { امرأت فرعون } ، أي وضرب الله مثلاً للذين آمنوا مريم ابنة عمران ، فضرَب مثلَيْن في الشرّ ومثلين في الخير .ومريم ابنة عمران تقدم الكلام على نسبها وكرامتها في سورة آل عمران وغيرها ، وقد ذكر الله باسمها في عدة مواضع من القرآن ، وقال ابن التلمساني في «شرح الشفاء» لعياض : لم يَذكُر الله امرأة في القرآن باسمها إلا مريم للتنبيه على أنها أمةُ الله إبطالاً لعقائد النصارى .والإِحصان : جعل الشيء حصيناً ، أي لا يُسلك إليه . ومعناه : منعت فرجها عن الرجال .وتفريع { فنفخنا فيه من روحنا } تفريع العطية على العمل لأجله . أي جزيناها على إحصان فرجها ، أي بأن كوّن الله فيه نبيئاً بصفة خارقة للعادة فخلد بذلك ذكرها في الصالحات .والنفخ : مستعار لسرعة إبداع الحياة في المكوّن في رحمها . وإضافة الروح إلى ضمير الجلالة لأن تكوين المخلوق الحيّ في رحمها كان دون الأسباب المعتادة ، أو أُريد بالروح الملك الذي يؤمر بنفخ الأرواح في الأجنة ، فعلى الأول تكون { من } تبعيضية ، وعلى الثاني تكون ابتدائية ، وتقدم قوله تعالى : { فنفخنا فيها من روحنا } في سورة \\[ الأنبياء : 91 \\] .وتصديقها : يقينها بأن ما أبلغ إليها الملَكُ من إرادة الله حملها .وكلمات ربها } : هي الكلمات التي ألقاها إليها بطريق الوحي .و { وكتابه } يجوز أن يكون المراد به «الإِنجيل» الذي جاء به ابنها عيسى وهو إن لم يكن مكتوباً في زمن عيسى فقد كتبه الحواريون في حياة مريم .ويجوز أن يراد ب { كتابه } ، أراده الله وقدّره أن تحمل من دون مس رجل إياها من باب وكان كتاباً مفعولاً .والقانت : المتمحض للطاعة . يجوز أن يكون و { من } للابتداء .والمراد بالقانتين : المكثرون من العبادة . والمعنى أنها كانت سليلة قوم صالحين ، أي فجاءت على طريقة أصولها في الخير والعفاف. ... وهل ينبت الخَطِّيُّ إلا وشيجَهُوهذا إيماء إلى تبرئتها مما رماها به القوم البهت .وهذا نظير قوله تعالى : { والطيبات للطيبين والطيبون للطيبات أولئك مبرءون مما يقولون } \\[ النور : 26 \\] .ويجوز أن تجعل { من } للتعبيض ، أي هي بعض من قنت لله . وغلبت صيغة جمع الذكور ولم يقل : من القانتات ، جرياً على طريقة التغليب وهو من تخريج الكلام على مقتضى الظاهر . وهذه الآية مثال في علم المعاني .ونكتته هنا الإِشارة إلى أنها في عداد أهل الإِكثار من العبادة وأن شأن ذلك أن يكون للرجال لأن نساء بني إسرائيل كن معفيات من عبادات كثيرة .ووصفت مريم بالموصول وصلته لأنها عُرفت بتلك الصلة من قصتها المعروفة من تكرر ذكرها فيما نزل من القرآن قبل هذه السورة .وفي ذكر { القانتين } إيماء إلى ما أوصى الله به أمهات المؤمنين بقوله تعالى : { ومن يقنت منكن لله ورسوله وتعمل صالحاً نؤتها أجرها مرتين } \\[ الأحزاب : 31 \\] الآية .وقرأ الجمهور { وكتابه } . وقرأه حفص وأبو عمرو ويعقوب { وكُتُبه } بصيغة الجمع ، أي آمنت بالكتب التي أنزلت قبل عيسى وهي «التوراة» و«الزبور» وكتب الأنبياء من بني إسرائيل ، و«الإِنجيل» إن كان قد كتبه الحواريون في حياتها .\n\n",
      "translations": [
        {
          "translation": "(And Mary, daughter of Imran, whose body was chaste, therefore We breathed therein something of Our Spirit) and so Gabriel breathed inside her garment and she became pregnant with Jesus. (And she put faith in the words of her Lord) she believed in what Gabriel told her that he was the Messenger of Allah entrusted with giving her a holy son (and His Scriptures) and she also believed in His Scriptures: the Torah, the Gospel and all other Scriptures; it is also said this means: she believed in the words of her Lord that Jesus the son of Mary will come into being by Allah saying \"Be!\" and he became a human being, and she also believed in His Scripture: the Gospel, (and was of the obedient) in times of hardship and comfort; and it is also said that this means: and she was obedient to He Who is far transcendent and majestic'. And of the surah in which Sovereignty is mentioned, which is Meccan and consists of 30 verses, 335 words and 1,313 letters: Surah 67: Sovereignty (al-Mulk) And of the surah in which Sovereignty is mentioned, which is Meccan and consists of 30 verses, 335 words and 1,313 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وطهارة ذيلها وعصمتها: { أَحْصَنَتْ فَرْجَهَا } من مخالطة الرجال\n وبالغت في التحصن والتحفظ إلى حيث رضي الله عنها وكرَّمها\n وأعطاها ما أعطى من الإرهاصات والكرامات التي خلت عنها سائر نساء الدنيا\n وبعدما كرَّمناها كذلك { فَنَفَخْنَا فِيهِ } أي: في جوفها من جيب درعها { مِن رُّوحِنَا } الذي كنَّا نفخنا منه في قالب آدم الصفي\n ومن تلك النفخة حبلت بعيسى عليه السلام\n ولهذا صار عيسى في الصفوة كآدم\n وظهرت منه معجزات ما ظهرت من نبي قط\n\n\n{ وَ } بالجملة: { صَدَّقَتْ } مريم { بِكَلِمَاتِ رَبِّهَا } أي: بعموم كلمات مربيها التي من جملتها: خلق عيسى عليه السلام من ذلك النفخ { وَ } بجميع { كُتُبِهِ } المنزلة من عنده على عموم رسله { وَ } من كمال مجاهدتها في طريق الحق\n وإخلاصها في الطاعات والعبادات\n واتكالها على الله في مطلق الملمات\n وكمال تفويضها عليه سبحانه وتسليماً إليه: { كَانَتْ مِنَ ٱلْقَانِتِينَ } [التحريم: 12] أي: من عداد الكمَّل من أرباب القنوت\n المنجذبين إلى حضرة الرحموت بكمال الخضوع والخشوع\n\nوفي هذا التمثيلين تعريض لأزواج النبي صلى الله عليه وسلم\n وحث لهن إلى حسن المعاشرة ومراعاة الأدب معه صلى الله عليه وسلم وكمال المصادقة\n وتبعيد لهن عن النفاق والمراء والمجادلة معه في أمر أباحه الله له بمقتضى حكمته\n إنما ضربهما سبحانه\n لينزجرون بهما عمَّا جئن به\n لتكون عظةً وتذكيراً لسائر المؤمنين المتعظين\n\n\nجعلنا الله من زمرتهم وجملتهم\n\n\nخاتمة السورة\n\nعليك أيها المحمدي المراقب لكلمات الحق النازلة من الغيب إلى الشهادة\n المتفرعة على الأسماء والصفات الذاتية الإلهية أن تترصد في عموم أوقاتك إلى ما سيتجدد من عالم الخفاء والكمون إلى فضاء البروز والظهور\n ثمَّ منها إلى البطون بمقتضى النشأة الحِبِّية الإلهية\n فلا بدَّ لك أن تخلي همك وبالك عن مطلق الأشغال الشاغلة لك عن الالتفات والتوجه إلى الله\n والتفرج بعجائب مصنوعاته\n وغرائب مخترعاته\n وإياك إياك أن تغفل عنه ساعة\n فإنها تورثك حسرة عظيمة طويلة\n وخسراناً عظيماً إن كنت من جملة المستيقظين\n\n\nربنا لا تزغ قلوبنا\n وهب لنا من لدنك رحمة\n إنك أنت الوهَّاب",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وصدَّقتْ بكلماتِ ربها } بصُحفه المنزلة\n أو: بما أوحى اللهُ إلى أنبيائه\n { وكتابه } أي: جنس الكتاب الشامل للكل\n وقرأ البصري وحفص بالجمع\n أي: كُتبه الأربعة\n وقُرىء: \" بكلمة الله وكتابه \" أي: بعيسى وبالكتاب المنزَّل عليه الإنجيل\n { وكانت من القانِتين } أي: من عدة المواظبين على الطاعة\n والتذكير للتغليب\n والإشعار بأنَّ طاعتها لم تقصر عن طاعة الرجال\n حتى عُدت من جملتهم\n أو كانت من نسل القانتين لأنها من أعقاب هارون\n أخي موسى عليهما السلام\n وعن النبي صلى الله عليه وسلم:\n \" كَمُل من الرجال كثير\n ولم يكمل من النساء إلا أربع: آسية بنت مزاحم\n ومريم بنت عمران\n وخديجة بنت خويلد\n وفاطمة بنت محمد صلى الله عليه وسلم\n وفضل عائشة على النساء كفضل الثريد على سائر الطعام \"\n \nقال النسفي: وفي طيِّ هذين التمثيلين تعريض بأمَّيِّ المؤمنين المذكورتين في أوّل السورة\n وما فرط منهما من التظاهر على رسول الله صلى الله عليه وسلم بما كَرِهه\n وتحذير لهما على أغلظ وجه\n وإشارة إلى أنّ مِن حقهما أن تكونا في الأخلاق كهاتين المؤمنتين\n وألاّ تتكلا على أنهما زوجا رسول الله صلى عليه وسلم\n هـ\n وفي الثعلبي: وقال ابن عباس وجماعة: قطع اللهُ بهذه الآية طمَعَ مَن ركب المعصية\n ورجا أن ينفعه صلاح غيره\n وأخبر أنّ معصية غيره لا تضره إذا كان مطيعاً\n هـ\n الإشارة: قال القشيري: المرأتان الكافرتان إشارة إلى النفس الأمّارة والهوى المتَّبع\n أي: كانتا تحت القلب والروح\n فخانتاهما\n حيث غلبتا القلبَ والروحَ\n وجذبتاهما إليهما\n فمال القلب إلى الحظوظ الجسمانية\n ومالت الروحُ إلى الحروف الظلمانية\n كحب الجاه والرئاسة والكرامة\n فلم تُغنيا عنهما من الله شيئاً\n حيث فاتهما اليقين والمعرفة العيانية\n والمرأتان المؤمنتان إشارة إلى النفس المطمئنة والقلب المطمئن\n حيث غلبا النفس الأمّارة والهوى\n لم يضرهما صحبتهما\n فقالت النفس المطمئنة: ربّ ابن لي عندك بيتاً في الجنة\n في مقعد صدق عند مليك مقتدر\n والقلب لمّا حَفِظً نفسه من دخول العلل\n نفخ الحقُّ فيه من روحه\n فأحياه به\n وأشْهَده أنوار قدسه\n فصدّق بكلمات الله الدالة على ذاته\n ثم ترقَّى إلى شهود المتكلِم\n وكان من القانتين\n فجمع بين شهود عظمة الربوبية وآداب العبودية\n قال الورتجبي: { فنفخنا فيه\n\n\n }  الآية\n أي: ظهر فيه نور الفعل\n ثم ظهر في نور الفعل نور الصفة\n فظهر في نور الصفة نور الذات\n فكان بنور الذات والصفات حيًّا موصوفاً بصفاته\n ناظراً إلى مشاهدة نور ذاته\n لم تنقطع عنه أنوار الذات والصفات والفعل أبداً\n\nوهذه خاصية لمَن له أثر من روحه\n قال بعضهم: نفخ من نوره في روح عبده\n ليحيي بذلك الروح\n ويحيى به\n ويطلب النورَ ولا يغفل عن طلب المُنوِّر\n فيعيش في الدنيا حميداً\n ويُبعث في الآخرة شهيداً\n فلمّا وجدت رَوحُ روحِ الله صدّقت بظهوره في العالم\n وشبيه قلوب العالمين بأنه يكون مرآة الحق للخلق\n وذلك قوله: { وصَدَّقت بكلمات ربها } ولمّا باشر أنوار القدس وروح الأنس كادت نفسها أن تميل إلى السكر في الأنانية\n فسبق لها العناية\n وأبقاها في درجة العبودية\n حتى لا تسقط بالسُكر عن مقام الصحو\n ألآ ترى كيف قال: { وكانت من القانتين } أي: من المستقيمين في معرفتها بربها\n ومعرفتها بقيمة نفسها أنها مُسَخَّرة عاجزة لربها\n هـ\n وبالله التوفيق\n وصلّى الله على سيدنا محمد وآله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:33",
      "similarity": 0.5375536999405647
    },
    {
      "verse": "21:91",
      "similarity": 0.5359134442268331
    },
    {
      "verse": "3:35",
      "similarity": 0.5277924822457523
    },
    {
      "verse": "33:35",
      "similarity": 0.33414426630001665
    },
    {
      "verse": "77:9",
      "similarity": 0.2560102216418851
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/066012.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/066012.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/66:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}