{
  "chapter": "التحريم",
  "text": "قد فرض الله لكم تحلة ايمنكم والله مولىكم وهو العليم الحكيم",
  "translations": [
    {
      "translation": "Allah has made the expiation of your oaths obligatory for you. Allah is your Master - He is the All-Knowing, the All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely God has sanctioned the dissolution of your vows. God is your Lord: He is all-knowing, and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has prescribed for you a way for the absolution of your oaths. Allah is your Guardian. He is All-Knowing, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has shown you how to absolve yourselves of your oaths. He is your Guardian and is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has ordained expiation for your oaths; and Allah is your Master; and Allah is the All Knowing, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has already ordained for you (O men) the absolution from your oaths. And Allah is your Protector and He is the All-Knower, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah indeed has sanctioned for you the expiation of your oaths and Allah is your Protector, and He is the Knowing the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has ordained for you the absolution of your oaths. God is your Protector, and He is the All-knowing, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath made lawful for you (Muslims) absolution from your oaths (of such a kind), and Allah is your Protector. He is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has already ordained that you be absolved of such oaths. God is your patron. He is the All Knowing, the Wise One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah hath ordained for you absolution from your oaths; and Allah is your Patron and He is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has certainly made lawful for you the dissolution of your oaths, and Allah is your master and He is the All-knowing, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has already ordained for you, (O men), the dissolution of your oaths (in some cases): and Allah is your Protector, and He is Full of Knowledge and Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has already ordained for you (O men), the dissolution of your oaths. And Allah is your Maula (Lord, or Master, or Protector, etc.) and He is the All-Knower, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has absolved you from your oaths. Allah is your Guardian, the Knowing, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has decreed for you the dissolution of your oaths. God is your Master. He is the All-Knowing, the Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has already ordained for you [Muslims] the dissolution of your oaths. And Allah is your protector, and He is the Knowing, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[66:2] Verily God has prescribed, He has made lawful, for you [when necessary] the absolution of your oaths, to absolve them by expiation, as mentioned in the sūrat al-Mā’ida [Q. 5:89] and the forbidding of [sexual relations with] a handmaiden counts as an oath, so did the Prophet (s) expiate? Muqātil [b. Sulaymān] said, ‘He set free a slave [in expiation] for his prohibition of Māriya’; whereas al-Hasan [al-Basrī] said, ‘He never expiated, because the Prophet (s) has been forgiven [all errors]’. And God is your Protector, your Helper, and He is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah hath made lawful for you (Muslims) absolution from your oaths (of such a kind)) and so the Prophet (pbuh) absolved himself from his oath and married Maria the Copt, (and Allah is your Protector) and Helper. (He is the Knower) He knows that you forbade yourself Maria the Copt, (the Wise) in that which He enjoined about the expiation of oaths.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قالَ: حدّثنا علي بن أحمد\n قالَ: حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { قَدْ فَرَضَ ٱللَّهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ } معناه بيَّنَها لَكُم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا نهى سبحانه نبيه صلى الله عليه وسلم على وجه المبالغة والتأكيد، أراد سبحانه أن يبين كفارة اليمين الواقعة من المؤمنين فقال: { قَدْ فَرَضَ ٱللَّهُ } وشرع { لَكُمْ } على سبيل الوجوب { تَحِلَّةَ أَيْمَانِكُمْ } أي: بتحليل أيمانكم وتكفيركم عنها { وَٱللَّهُ } المصلح لأحوالكم { مَوْلاَكُمْ } ومُولي أموركم { وَهُوَ ٱلْعَلِيمُ } لعموم مصالحكم ومفاسدكم { ٱلْحَكِيمُ } [التحريم: 2] في ضبطها وإصلاحها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى، عنايةً بأمره: { قد فرض اللهُ لكم تَحِلَّةَ أيمانكم } وتجاوزاً عنه بما كان تركه أولى\n هـ\n والحاصل: أنه تعالى غفر له ميله للسِّوى سهواً، والسهو قهرية الحق تعالى، قهر بها عبادَه ليتميّز ضعف العبودية من قوة الربوبية، وهو ليس بنقصٍ في حق البشر، لكنه لمّا كان في الغالب لا يحصل إلاَّ مع عدم العزم عُدَّ تفريطاً وهفوة، كما قال تعالى في حق آدم:\n\n[طه:115]، فالمغفرة في الحقيقة، وطلب التوبة من السهو، إنما هو لقلة العزم وعدم الحزم، وحسنات الأبرار سيئات المقربين، ولا تصغ بأذنك إلى ما قاله الزمخشري ومَن تبعه من كون ما فعله عليه السلام زلة، حيث حرّم ما أحلّ الله، فإنه تجاسر على منصب النبوة، وقلة أدب\n وقوله تعالى: { ما أحلّ الله لك } زيادة \" لك \" تَرُدّ ما زعمه الزمخشري، ولو كان كما قال لقال له: لِم تحرم ما أحلّ الله\n ثم قال تعالى: { قد فَرَضَ اللهُ لكم تَحِلَّةَ أَيمانكم } أي: شرع لكم تحليلها، وهو حل ما عقده بالكفَّارة، أو بالاستثناء متصلاً، والأول هو المراد هنا، وهل كفَّر عليه الصلاة والسلام؟ قال مقاتل: أعتق رقبةً، وقال الحسن: لم يُكفِّر لأنه مغفور له\n\n\nقال بعضهم: هذه التحلة إنما هي لليمين المقرونة بالتحريم، وقال بعضهم: بل هي لنفس التحريم، وبه تمسّك أبو حنيفة في تحريم الحلال، فأوجب كفارةَ اليمين\n { واللهُ مولاكم } أي: سيدكم ومتولي أمورَكم، فلا يُحب ما ضيّق عليكم\n قال في الحاشية الفاسية: ومَن تأمّل هذه السورة لاح له منزلةَ حبيب الله عند الله، وحقق معنى قول عائشة: \" يا رسول الله ما أرى ربك إلاّ يُسارع في هواك \" الحديث متفق على صحته هـ { وهو العليمُ } بما يُصلحكم، فيشرعه لكم، { الحكيمُ } المتقن في أفعاله وأحكامه، فلا يأمركم ولا ينهاكم ألاَّ بما تقتضيه الحكمة البالغة\n الإشارة: هذا العتاب يتوجه لكل مَن سبقت له عند الله عناية وزلفى، إذا ضَيّق على نفسه فيما أحلّ اللهُ له، فلا يرضى منه ذلك، محبةً فيه، وقد صدر مني مثل هذا زمان الوباء، فحلفت لبعض أزواجي: أني لا أتزوج عليها، وسبب ذلك أنها كانت مصارِمة لي، في غاية الغضب والقطيعة، وقد كان غلب على ظني الموت، لِما رأيتُ من الازدحام عليه، فخفتُ أن نموت متقاطعَين، فلمّا حلفتُ لها رأى بعض الفقراء من أصحابنا: أنه يقرأ عليّ أو معي: { يا أيها النبي لِمَ تُحرم\n\n\n } الخ السورة، ففهمت الإشارة على أنّ اليمين لا تلزم، والله أعلم، لأنّ بساط اليمين كان غلبة ظن الموت، فلما تخلّف انحل اليمين، كقضية الرجل الذي وجد الزحام على اللحم، فحلف لا يشتري لحماً أبداً، ثم وجد الفراغ، فقال مالك: لا يلزمه شيء\n هـ\n وقال الورتجبي: أدب نبيه عليه الصلاة والسلام ألاَّ يستبد برأيه، ويبتع ما يُوحى إليه\n هـ\n وجعل القشيري النبيَّ إشارة إلى القلب، أي: يا أيها القلب المتوجِّه لِمَ تُحرم ما أحلّ الله من حلاوة الشهود، تبتغي مرضاة نفسك وحظوظها، فتتبع هواها، وتترخّص في مباحات الشريعة، وهي تحجب عن أسرار الحقيقة، أو: لِمَ تُحرِّم ما أحلّ الله من الاستغراق في سُكر بحر الحقيقة، تبتغي مرضاة بقاء نفسك، والشعور بوجودها\n وكان صلى الله عليه وسلم يقول:\n\n \" لي وقت لا يَسعني فيه غير ربي \" \n\nوكان يقول لعائشة حين يغلب عليه السُكْر والاضمحلال في الحق:\n\n \" كلميني حركيني يا حميراء \" \n\nوكذلك القلب إذا غلب عليه الوجد، وخاف من الاصطلام، أو مِن مَحق البشرية، يطلب مَن يبرد عليه مِن نفسه أو مِن غيره، وقد سَمِعْتُ مِن شيخ شيخنا رضي الله عنه أنه قال: كان يغلب عَلَيَّ الوجد والسكر، فكنت أذهبُ إلى مجالسة العوام ليبُرد عليّ الحال، خوفاً من الاصطلام أو المحق، وذلك بعد وفاة شيخه\n وقوله تعالى: { والله غفور رحيم } أي: فلا يؤاخذ العبدَ بهذا الميل اليسير إلى الحس، دواء لنفسه، قد فرض اللهُ لكم تحلةَ أيمانكم، أي: الميل اليسير إلى الرفق بالنفس لأنها مطية القلب، بمجاهدتها يصل إلى كعبة الوصول، وهي حضرة الرب\n وبالله التوفيق\n ثم ذكر النازلة، فقالِ: { قَدْ فَرَضَ ٱللَّهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:85",
      "similarity": 0.5453093642796661
    },
    {
      "verse": "4:118",
      "similarity": 0.526960789775695
    },
    {
      "verse": "24:1",
      "similarity": 0.5107202763326727
    },
    {
      "verse": "4:7",
      "similarity": 0.4216693160927463
    },
    {
      "verse": "33:38",
      "similarity": 0.3472416126769005
    }
  ]
}