{
  "chapter": "التحريم",
  "text": "قد فرض الله لكم تحلة ايمنكم والله مولىكم وهو العليم الحكيم",
  "translations": [
    {
      "translation": "Allah has made the expiation of your oaths obligatory for you. Allah is your Master - He is the All-Knowing, the All-Wise.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely God has sanctioned the dissolution of your vows. God is your Lord: He is all-knowing, and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has prescribed for you a way for the absolution of your oaths. Allah is your Guardian. He is All-Knowing, Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has shown you how to absolve yourselves of your oaths. He is your Guardian and is All-knowing and All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has ordained expiation for your oaths; and Allah is your Master; and Allah is the All Knowing, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has already ordained for you (O men) the absolution from your oaths. And Allah is your Protector and He is the All-Knower, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah indeed has sanctioned for you the expiation of your oaths and Allah is your Protector, and He is the Knowing the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has ordained for you the absolution of your oaths. God is your Protector, and He is the All-knowing, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah hath made lawful for you (Muslims) absolution from your oaths (of such a kind), and Allah is your Protector. He is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has already ordained that you be absolved of such oaths. God is your patron. He is the All Knowing, the Wise One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah hath ordained for you absolution from your oaths; and Allah is your Patron and He is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has certainly made lawful for you the dissolution of your oaths, and Allah is your master and He is the All-knowing, the All-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has already ordained for you, (O men), the dissolution of your oaths (in some cases): and Allah is your Protector, and He is Full of Knowledge and Wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has already ordained for you (O men), the dissolution of your oaths. And Allah is your Maula (Lord, or Master, or Protector, etc.) and He is the All-Knower, the All-Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has absolved you from your oaths. Allah is your Guardian, the Knowing, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has decreed for you the dissolution of your oaths. God is your Master. He is the All-Knowing, the Most Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has already ordained for you [Muslims] the dissolution of your oaths. And Allah is your protector, and He is the Knowing, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[66:2] Verily God has prescribed, He has made lawful, for you [when necessary] the absolution of your oaths, to absolve them by expiation, as mentioned in the sūrat al-Mā’ida [Q. 5:89] and the forbidding of [sexual relations with] a handmaiden counts as an oath, so did the Prophet (s) expiate? Muqātil [b. Sulaymān] said, ‘He set free a slave [in expiation] for his prohibition of Māriya’; whereas al-Hasan [al-Basrī] said, ‘He never expiated, because the Prophet (s) has been forgiven [all errors]’. And God is your Protector, your Helper, and He is the Knower, the Wise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَدْ فَرَضَ اللَّهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ وَاللَّهُ مَوْلَاكُمْ وَهُوَ الْعَلِيمُ الْحَكِيمُ (2)استئناف بياني بيّن الله به لنبيئه صلى الله عليه وسلم أن له سعة في التحلل مما التزم تحريمه على نفسه ، وذلك فيما شرع الله من كفارة اليمين فأفتاه الله بأن يأخذ برخصته في كفارة اليمين المشروعة للأمة كلها ومن آثار حكم هذه الآية ما قاله النبي صلى الله عليه وسلم لوفد عبد القيس بعد أن استحملوه وحلف أن لا يحملهم إذ ليس عنده ما يحملهم عليه ، فجاءه ذود من إبل الصدقة فقال لهم : «وإني والله لا أحلف على يمين فأرى غيرها خيراً منها إلا كفرت عن يميني وفعلت الذي هو خير» .وافتتاح الخبر بحرف التحقيق لتنزيل النبي صلى الله عليه وسلم منزلة من لا يعلم أن الله فرض تَحِلَّة الأيمان بآية الكفارة بناء على أنه لم يأخذ بالرخصة تعظيماً للقَسَم . فأعلمه الله أن الأخذ بالكفارة لا تقصير عليه فيه فإن في الكفارة ما يكفي للوفاء بتعظيم اليمين بالله إلى شيء هذا قوله تعالى في قصة أيوب { وخذ بيدك ضغثاً فاضرب به ولا تحنث } \\[ ص : 44 \\] كما ذكرناه في تفسيرها و { فرض } عيَّن ومنه قوله تعالى : { نصيباً مفروضاً } \\[ النساء : 7 \\] . وقال : فرض له في العطاء والمعنى : قد بيَّن الله لكن تحلة أيمانكم .واعلم أنه إن كان النبي صلى الله عليه وسلم لم يصدر منه في تلك الحادثة إلا أنه التزم أن لا يعود لشرب شيء عند بعض أزواجه في غير يوم نوبتها أو كان وعد أن يحرّم مارية على نفسه بدون يمين على الرواية الأخرى . كان ذلك غير يمين فكان أمرُ الله إياه بأن يكفر عن يمينه إما لأن ذلك يجري مجرى اليمين لأنه إنما وعد لذلك تطميناً لخاطر أزواجه فهو التزام لهن فكان بذلك ملحقاً باليمين وبذلك أخذ أبو حنيفة ولم يره مالك يميناً ولا نذراً فقال في «الموطأ» : ومعنى قول رسول الله صلى الله عليه وسلم \" من نذر أن يعصي الله فلا يعصه \" أن ينذر الرجل أن يمشي إلى الشام أو إلى مصر مما ليس لله بطاعة إن كلم فلاناً ، فليس عليه في ذلك شيء إنْ هو كلّمه لأنه ليس لله في هذه الأشياء طاعة فإن حَلف فقال : «والله لا آكل هذا الطعام ولا ألبس هذا الثوب فإنما عليه كفارة يمين» اه .وقد اختلف هل كفّر النبي صلى الله عليه وسلم عن يمينه تلك .فالتحلّة على هذا التفسير عند مالك هي : جعل الله ملتزم مثل هذا في حلِّ مننِ التزاممِ ما التزمه . أي مُوجب التحلل من يمينه .وعند أبي حنيفة : هي ما شرعه الله من الخروج من الأيمان بالكفارات وإن كان النبي صلى الله عليه وسلم صدر منه يمين عند ذلك على أن لا يعود فتحِلَّة اليمين هي الكفارة عند الجميع .وجملة { والله مولاكم } تذييل لجملة { قد فرض الله لكم تحلة أيمانكم } . والمولى : الولي ، وهو الناصر ومتولي تدبير ما أضيف إليه ، وهو هنا كناية عن الرؤوف والميسّر ، كقوله تعالى : { يريد الله بكم اليسر ولا يريد بكم العسر } \\[ البقرة : 185 \\] .وعطف عليها جملة { وهو العليم الحكيم } أي العليم بما يصلحكم فيحملكم على الصواب والرشد والسداد وهو الحكيم فيما يشرعه ، أي يجري أحكامه على الحكمة . وهي إعطاء الأفْعال ما تقتضيه حقائقها دون الأوهام والتخيلات .واختلف فقهاء الإِسلام فيمن حرّم على نفسه شيئاً مما أحل الله له على أقوال كثيرة أنهاها القرطبي إلى ثمانية عشر قولاً وبعضها متداخل في بعض باختلاف الشروط والنيات فتؤول إلى سبعة .أحدها : لا يلزمه شيء سواء كان المحرَّم زوجاً أو غيرها . وهو قول الشعبي ومسروق وربيعة من التابعين وقاله أصبغ بن الفرج من أصحاب مالك .الثاني : تجب كفارة مثل كفارة اليمين . وروي عن أبي بكر وعمر وابن مسعود وابن عباس وعائشة وسعيد بن جبير ، وبه قال الأوزاعي والشافعي في أحد قوليه . وهذا جار على ظاهر الآية من قوله : { قد فرض الله لكم تحلة أيمانكم } .الثالث : لا يلزمه في غير الزوجة وأما الزوجة فقيل : إن كان دخل بها كان التحريم ثلاثاً ، وإن لم يدخل بها ينوّ فيما أراد وهو قول الحسن والحكم ومالك في المشهور . وقيل هي ثلاث تطليقات دخل بها أم لم يدخل . ونسب إلى علي بن أبي طالب وزيد بن ثابت وأبي هريرة . وقاله ابن أبي ليلى وهو عند عبد الملك بن الماجشون في «المبسوط» . وقيل طلقة بائنة . ونسب إلى زيد بن ثابت وحماد بن سليمان ونسبه ابن خُويز منداد إلى مالك وهو غير المشهور عنه . وقيل : طلقة رجعية في الزوجة مطلقاً ، ونسب إلى عمر بن الخطاب فيكون قيداً لما روي عنه في القول الثاني . وقاله الزهري وعبد العزيز بن أبي سلمة وابن الماجشون ، وقال الشافعي يعني في أحد قوليه : إن نوى الطلاق فعليه ما نوى من أعداده وإلا فَهي واحدة رجعية . وقيل : هي ثلاث في المدخول بها وواحدة في التي لم يدخل بها دون تنوية .الرابع : قال أبو حنيفة وأصحابه إن نوى بالحرام الظهار كان ما نوى فإن نوى الطلاق فواحدة بائنة إلا أن يكون نوى الثلاث . وإن لم ينو شيئاً كانت يميناً وعليه كفارة فإنْ أباها كان مولياً .وتحريم النبي صلى الله عليه وسلم سريته مارية على نفسه هو أيضاً من قبيل تحريم أحد شيئاً مما أحلّ الله له غير الزوجة لأن مارية لم تكن زوجة له بل هي مملوكته فحكم قوله : { قد فرض الله لكم تحلة أيمانكم } جار في قضية تحريم مارية بيمين أو بغير يمين بلا فرق . و { تحلة } تفعِلة مِن حلَّل جعل الفعل حلالاً . وأصله تَحْلِلة فأدغم اللامان وهو مصدر سماعي لأن الهاء في آخره ليست بقياس إذ لم يحذف منه حرف حتى يعوض عنه الهاء مثل تزكية ولكنه كثير في الكلام مثل تعلة .\n\n",
      "translations": [
        {
          "translation": "(Allah hath made lawful for you (Muslims) absolution from your oaths (of such a kind)) and so the Prophet (pbuh) absolved himself from his oath and married Maria the Copt, (and Allah is your Protector) and Helper. (He is the Knower) He knows that you forbade yourself Maria the Copt, (the Wise) in that which He enjoined about the expiation of oaths.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قالَ: حدّثنا علي بن أحمد\n قالَ: حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { قَدْ فَرَضَ ٱللَّهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ } معناه بيَّنَها لَكُم\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n He said: Ali ibn Ahmad narrated to us\n\n\nHe said: \"It has been narrated to us by 'Ata' ibn al-Sa'ib from Abu Khalid from Zayd ibn 'Ali, upon them both be peace, regarding the words of the Almighty, '{Allah has decreed for you the ritual purification of your oaths}' - its meaning is that He has made it clear to you.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أراد سبحانه أن يبين كفارة اليمين الواقعة من المؤمنين فقال: { قَدْ فَرَضَ ٱللَّهُ } وشرع { لَكُمْ } على سبيل الوجوب { تَحِلَّةَ أَيْمَانِكُمْ } أي: بتحليل أيمانكم وتكفيركم عنها { وَٱللَّهُ } المصلح لأحوالكم { مَوْلاَكُمْ } ومُولي أموركم { وَهُوَ ٱلْعَلِيمُ } لعموم مصالحكم ومفاسدكم { ٱلْحَكِيمُ } [التحريم: 2] في ضبطها وإصلاحها\n\n\n{ وَ } اذكر { إِذْ أَسَرَّ ٱلنَّبِيُّ إِلَىٰ بَعْضِ أَزْوَاجِهِ } يعني: حفصة { حَدِيثاً } وهو حديث مارية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n عنايةً بأمره: { قد فرض اللهُ لكم تَحِلَّةَ أيمانكم } وتجاوزاً عنه بما كان تركه أولى\n هـ\n والحاصل: أنه تعالى غفر له ميله للسِّوى سهواً\n والسهو قهرية الحق تعالى\n قهر بها عبادَه ليتميّز ضعف العبودية من قوة الربوبية\n وهو ليس بنقصٍ في حق البشر\n لكنه لمّا كان في الغالب لا يحصل إلاَّ مع عدم العزم عُدَّ تفريطاً وهفوة\n كما قال تعالى في حق آدم:\n[طه:115]\n فالمغفرة في الحقيقة\n وطلب التوبة من السهو\n إنما هو لقلة العزم وعدم الحزم\n وحسنات الأبرار سيئات المقربين\n ولا تصغ بأذنك إلى ما قاله الزمخشري ومَن تبعه من كون ما فعله عليه السلام زلة\n حيث حرّم ما أحلّ الله\n فإنه تجاسر على منصب النبوة\n وقلة أدب\n وقوله تعالى: { ما أحلّ الله لك } زيادة \" لك \" تَرُدّ ما زعمه الزمخشري\n ولو كان كما قال لقال له: لِم تحرم ما أحلّ الله\n ثم قال تعالى: { قد فَرَضَ اللهُ لكم تَحِلَّةَ أَيمانكم } أي: شرع لكم تحليلها\n وهو حل ما عقده بالكفَّارة\n أو بالاستثناء متصلاً\n والأول هو المراد هنا\n وهل كفَّر عليه الصلاة والسلام؟ قال مقاتل: أعتق رقبةً\n وقال الحسن: لم يُكفِّر لأنه مغفور له\n\nقال بعضهم: هذه التحلة إنما هي لليمين المقرونة بالتحريم\n وقال بعضهم: بل هي لنفس التحريم\n وبه تمسّك أبو حنيفة في تحريم الحلال\n فأوجب كفارةَ اليمين\n { واللهُ مولاكم } أي: سيدكم ومتولي أمورَكم\n فلا يُحب ما ضيّق عليكم\n قال في الحاشية الفاسية: ومَن تأمّل هذه السورة لاح له منزلةَ حبيب الله عند الله\n وحقق معنى قول عائشة: \" يا رسول الله ما أرى ربك إلاّ يُسارع في هواك \" الحديث متفق على صحته هـ { وهو العليمُ } بما يُصلحكم\n فيشرعه لكم\n { الحكيمُ } المتقن في أفعاله وأحكامه\n فلا يأمركم ولا ينهاكم ألاَّ بما تقتضيه الحكمة البالغة\n الإشارة: هذا العتاب يتوجه لكل مَن سبقت له عند الله عناية وزلفى\n إذا ضَيّق على نفسه فيما أحلّ اللهُ له\n فلا يرضى منه ذلك\n محبةً فيه\n وقد صدر مني مثل هذا زمان الوباء\n فحلفت لبعض أزواجي: أني لا أتزوج عليها\n وسبب ذلك أنها كانت مصارِمة لي\n في غاية الغضب والقطيعة\n وقد كان غلب على ظني الموت\n لِما رأيتُ من الازدحام عليه\n فخفتُ أن نموت متقاطعَين\n فلمّا حلفتُ لها رأى بعض الفقراء من أصحابنا: أنه يقرأ عليّ أو معي: { يا أيها النبي لِمَ تُحرم\n\n\n } الخ السورة\n ففهمت الإشارة على أنّ اليمين لا تلزم\n والله أعلم\n لأنّ بساط اليمين كان غلبة ظن الموت\n فلما تخلّف انحل اليمين\n كقضية الرجل الذي وجد الزحام على اللحم\n فحلف لا يشتري لحماً أبداً\n ثم وجد الفراغ\n فقال مالك: لا يلزمه شيء\n هـ\n وقال الورتجبي: أدب نبيه عليه الصلاة والسلام ألاَّ يستبد برأيه\n ويبتع ما يُوحى إليه\n هـ\n وجعل القشيري النبيَّ إشارة إلى القلب\n أي: يا أيها القلب المتوجِّه لِمَ تُحرم ما أحلّ الله من حلاوة الشهود\n تبتغي مرضاة نفسك وحظوظها\n فتتبع هواها\n وتترخّص في مباحات الشريعة\n وهي تحجب عن أسرار الحقيقة\n أو: لِمَ تُحرِّم ما أحلّ الله من الاستغراق في سُكر بحر الحقيقة\n تبتغي مرضاة بقاء نفسك\n والشعور بوجودها\n وكان صلى الله عليه وسلم يقول:\n \" لي وقت لا يَسعني فيه غير ربي \" \nوكان يقول لعائشة حين يغلب عليه السُكْر والاضمحلال في الحق:\n \" كلميني حركيني يا حميراء \" \nوكذلك القلب إذا غلب عليه الوجد\n وخاف من الاصطلام\n أو مِن مَحق البشرية\n يطلب مَن يبرد عليه مِن نفسه أو مِن غيره\n وقد سَمِعْتُ مِن شيخ شيخنا رضي الله عنه أنه قال: كان يغلب عَلَيَّ الوجد والسكر\n فكنت أذهبُ إلى مجالسة العوام ليبُرد عليّ الحال\n خوفاً من الاصطلام أو المحق\n وذلك بعد وفاة شيخه\n وقوله تعالى: { والله غفور رحيم } أي: فلا يؤاخذ العبدَ بهذا الميل اليسير إلى الحس\n دواء لنفسه\n قد فرض اللهُ لكم تحلةَ أيمانكم\n أي: الميل اليسير إلى الرفق بالنفس لأنها مطية القلب\n بمجاهدتها يصل إلى كعبة الوصول\n وهي حضرة الرب\n وبالله التوفيق\n ثم ذكر النازلة\n فقالِ: { قَدْ فَرَضَ ٱللَّهُ لَكُمْ تَحِلَّةَ أَيْمَانِكُمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:85",
      "similarity": 0.5453093642796661
    },
    {
      "verse": "4:118",
      "similarity": 0.526960789775695
    },
    {
      "verse": "24:1",
      "similarity": 0.5107202763326727
    },
    {
      "verse": "4:7",
      "similarity": 0.4216693160927463
    },
    {
      "verse": "33:38",
      "similarity": 0.3472416126769005
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/066002.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/066002.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/66:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}