{
  "chapter": "التحريم",
  "text": "واذ اسر النبى الى بعض ازوجه حديثا فلما نبات به واظهره الله عليه عرف بعضه واعرض عنۢ بعض فلما نباها به قالت من انۢباك هذا قال نبانى العليم الخبير",
  "translations": [
    {
      "translation": "The Prophet confided a certain matter to one of his wives, then when she divulged it Allah disclosed that to him, and he communicated part of it and withheld part of it. When he told her of it, she said, 'Who told you of this?' He said, 'The All-Knowing and All-Aware informed me of it.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Prophet told one of his wives something in confidence and she disclosed it, God revealed this to him. So he made some of it known to her, and held back some. When, however, he informed her about it, she asked: \"Who told you this?\" He said: \"I was told this by the All-knowing, All-Informed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet confided something to one of his wives and then she disclosed it (to another); so after Allah revealed to the Prophet (that she had disclosed that secret), he made a part of it known to her and passed over a part of it. And when he told her about this (i.e., that she had disclosed the secret entrusted to her), she asked: “Who informed you of this?” He said: “I was told of it by He Who is All-Knowing, All-Aware.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet told a secret to one of his wives telling her not to mention it to anyone else. When she divulged it, God informed His Prophet about this. The Prophet told his wife part of the information which he had received from God and ignored the rest. Then she asked, \"Who informed you about this?\" He replied, \"The All-aware and All-knowing one has told me\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Holy Prophet confided a matter to one of his wives; so when she disclosed it and Allah conveyed this to the Holy Prophet, he told her part of it and held back a part; so when the Holy Prophet informed her about it, she said, “Who informed you?”; he said, “The All Knowing, the All Aware has informed me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when the Prophet disclosed a matter in confidence to one of his wives, then she told it. And Allah made it known to him; he informed part thereof and left a part. Then when he told her thereof, she said: \"Who told you this\" He said: \"The All-Knower, the All-Aware has told me.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the prophet secretly communicated a piece of information to one of his wives-- but when she informed (others) of it, and Allah made him to know it, he made known part of it and avoided part; so when he informed her of it, she said: Who informed you of this? He said: The Knowing, the one Aware, informed me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Prophet confided to one of his wives a certain matter; and then, when she told of it, and God disclosed that to him, he made known part of it, and turned aside from part; then, when he told her of it, she said, 'Who told thee this?' He said, 'I was told of it by the All-knowing, the All-aware.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Prophet confided a fact unto one of his wives and when she afterward divulged it and Allah apprised him thereof, he made known (to her) part thereof and passed over part. And when he told it her she said: Who hath told thee? He said: The Knower, the Aware hath told me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet once told one of his wives something in confidence. She did not keep it secret and God informed him of this; he made known a part of it, and avoided [mentioning] part of it. When he spoke to his wife of this, she asked him who had told him about it. He replied, \"The All Knowing, the All Aware One.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time the Prophet confided a story Unto one of his spouses, then she disclosed it, and Allah apprised him thereof, he made known part thereof and Withheld part. Then, when he had apprised her of it, she said: who hath acquainted thee therewith! He said the Knower, the Aware hath acquainted me.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Prophet confided a matter to one of his wives, but when she divulged it [instead of guarding the secret] and Allah apprised him about it, he acquainted [her] with part of the matter and ignored part of it. So when he told her about it, she said, ‘Who informed you about it?’ He said, ‘The All-knowing and the All-aware has informed me.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Prophet disclosed a matter in confidence to one of his consorts, and she then divulged it (to another), and Allah made it known to him, he confirmed part thereof and repudiated a part. Then when he told her thereof, she said, \"Who told thee this? \"He said, \"He told me Who knows and is well-acquainted (with all things).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when the Prophet (SAW) disclosed a matter in confidence to one of his wives (Hafsah), so when she told it (to another i.e. 'Aishah), and Allah made it known to him, he informed part thereof and left a part. Then when he told her (Hafsah) thereof, she said: \"Who told you this?\" He said: \"The All-Knower, the All-Aware (Allah) has told me\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet confided a certain matter to one of his wives but thereafter she disclosed it, then Allah revealed what she had done to him. He made part of it known and another part not. And when he acquainted her with it, she said: 'Who has told you this' He replied: 'I was told of it by the Knower, the Aware'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Prophet told something in confidence to one of his wives. But when she disclosed it, and God made it known to him; he communicated part of it, and he avoided another part. Then, when he informed her of it, she said, “Who informed you of this?” He said, “The All-Knowing, the All-Informed, informed me.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [remember] when the Prophet confided to one of his wives a statement; and when she informed [another] of it and Allah showed it to him, he made known part of it and ignored a part. And when he informed her about it, she said, \"Who told you this?\" He said, \"I was informed by the Knowing, the Acquainted.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[66:3] And, mention, when the Prophet confided to one of his wives, namely, Hafsa, a certain matter, which was his prohibition of Māriya, telling her: ‘Do not reveal it!’; but when she divulged it, to ‘Ā’isha, reckoning there to be no blame in [doing] such a thing, and God apprised him, He informed him, of it, of what had been divulged, he announced part of it, to Hafsa, and passed over part, out of graciousness on his part. So when he told her about it, she said, ‘Who told you this?’ He said, ‘I was told by the Knower, the Aware’, namely, God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When the Prophet confided a fact unto one of his wives) i.e. Hafsah (and when she afterward divulged it) Hafsah divulged to 'A'ishah what the Prophet (pbuh) told her in confidence (and Allah apprised him thereof) and Allah informed him that Hafsah informed 'A'ishah, (he made known (to her) part thereof) part of what she said to 'A'ishah regarding the leadership of Abu Bakr and 'Umar; and it is said: about seeing Maria the Copt on his own (and passed over part) he did not mention making forbidding Maria the Copt on himself nor what he told her concerning the leadership of Abu Bakr and 'Umar after him, for he did not reproach him for this. (And when he told it her) when the Prophet (pbuh) informed Hafsah about what she said to 'A'ishah (she said) Hafsah said: (Who hath told thee) that I informed 'A'ishah? (He said) the Prophet (pbuh) said: (The Knower, the Aware hath told me) what you divulged to 'A'ishah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلَمَّا نَبَّأَهَا بِهِ } معناه أَخبرَها بِهِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {But when he told her of it} means He informed her of it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وحديث خلافة أبي بكر وعمر - رضي الله عنهما - بعده صلى الله عليه وسلم { فَلَمَّا نَبَّأَتْ } وأخبرت حفصة { بِهِ } عائشة { وَأَظْهَرَهُ ٱللَّهُ } وأطلع سبحانه نبيه صلى الله عليه وسلم { عَلَيْهِ } أي: على إفشاء حفصة الحديث المعهود الذي أوصاها بالإسرار\n فغضب صلى الله عليه وسلم على حفصة\n لذلك { عَرَّفَ بَعْضَهُ } أي: بعض الحديث\n وهو حديث تحريم مارية\n وطلقها طلاقاً رجعياً انتقاماً عنها { وَأَعْرَضَ عَن بَعْضٍ } وهو قصة الخلافة ولم يعرفها\n لئلا يقع الفتنة بين المسلمين\n ومع ذلك قد وقعت\n وبعدما أطلع الله نبيه على إفشاء حفصة الحديث معاتباً عليها { فَلَمَّا نَبَّأَهَا بِهِ قَالَتْ } حفصة ظناً منها أنها صدرت هذا من عائشة: { مَنْ أَنبَأَكَ } وأعلمك { هَـٰذَا قَالَ } صلى الله عليه وسلم في جوابها: { نَبَّأَنِيَ ٱلْعَلِيمُ } بالسرائر والخفايا { ٱلْخَبِيرُ } [التحريم: 3] بما يجري في الضمائر والنيات\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وإِذ أَسَرَّ } أي: واذكر أيها السامع حين أَسَرَّ { النبيُّ إِلى بعض أزواجه } يعني حفصة { حديثاً } حديث تحريم مارية\n أو العسل\n أو إمامة الشيخين\n { فلما نَبَّأَتْ به } أي: أخبرت حفصةُ عائشةَ بالحديث وأفشته\n فحذف المفعول\n وهو عائشة\n { وأظْهَرَه اللهُ عليه } أي: أطلع اللهُ تعالى نبيَّه ـ عليه الصلاة والسلام ـ على إفشاء حفصة على لسان جبريل عليه السلام\n أو: أظهر الله عليه الحديث\n من الظهور\n { عَرَّفَ بعضَه } أي: عرَّف النبيُّ صلى الله عليه وسلم حفصةَ بعض الحديث الذي أفشته\n قيل: هو حديث الإمامة\n رُوي أنه عليه الصلاة والسلام قال لها:\n \" ألم أقل لك اكتمي عليّ \" \n؟ قالت: \" والذي بعثك بالحق ما ملكتُ نفسي \" فرحاً بالكرامة التي خَصَّ اللهُ تعالى بها أباها\n { وأَعْرَضَ عن بعضٍ } فلم يُخبرها تكرُّماً\n قال سفيان: ما زال التغافل من فعل الكرام\n وقال الحسن: ما استقصى كريم قط\n وقرأ الكسائي: \" عَرَف \" بالتخفيف\n أي: جازى عليه\n من قولك للمسيء: لأعْرِفَنَّ لك ما فعلت\n أي: لأجازينَّك عليه\n فاجازاها عليه السلام بأن طلَّقها\n وآلى من نسائه شهراً\n وقعد في مشربة مارية حتى نزلت آية التخيير\n وقيل: هَمَّ بطلاقها\n فقال له جبريل: لا تُطلِّقها\n فإنها صوّامة قوّامة\n هـ\n قيل: المعرّف: حديث الإمامة\n والمعرَض عنه: حديث مارية\n { فلما نَبَّأها به } أي: أخبر صلى الله عليه وسلم حفصةَ بما عرفه من الحديث\n قالت حفصة للنبي عليه السلام: { مَن أنبأكَ هذا قال نبأنيَ العليمُ الخبيرُ } الذي لا تخفى عليه خافية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "99:4",
      "similarity": 0.4490354604123517
    },
    {
      "verse": "26:5",
      "similarity": 0.39204574552593363
    },
    {
      "verse": "47:26",
      "similarity": 0.292927857619025
    },
    {
      "verse": "33:6",
      "similarity": 0.2819561758284191
    },
    {
      "verse": "77:50",
      "similarity": 0.2760250556665955
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/66:3.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/66:3.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/66:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}