{
  "chapter": "التحريم",
  "text": "ان تتوبا الى الله فقد صغت قلوبكما وان تظهرا عليه فان الله هو مولىه وجبريل وصلح المؤمنين والملئكة بعد ذلك ظهير",
  "translations": [
    {
      "translation": "If the two of you would only turn to Allah, for your hearts clearly deviated ... But if you support one another against him, Allah is his Protector and so are Jibril and every right-acting man of the muminun and, furthermore, the angels too will come to his support.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If both of you two (women) turn to God in penitence (it would be better). Your hearts have been impaired; and if you assist one another against him, then surely his helper is God, and Gabriel and the righteous believers, and, besides them, the angels are his helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the two of you turn in repentance to Allah (that is better for you), for the hearts of both of you have swerved from the Straight Path. But if you support one another against the Prophet, then surely Allah is his Protector; and after that Gabriel and all righteous believers and the angels are all his supporters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would that you two (wives of the Prophet) had turned to God in repentance. Your hearts have sinned. If you conspire with each other against him, know that God is his Guardian. Gabriel, the righteous (ones) among the believers and the angels will all support him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you both, the wives of the Holy Prophet, incline towards Allah, for indeed your hearts have deviated a little; and if you come together against him (the Holy Prophet – peace and blessings be upon him) then indeed Allah is his Supporter, and Jibreel and the virtuous believers are also his aides; and in addition the angels are also his aides. (Allah has created several supporters for the believers.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you two turn in repentance to Allah, your hearts are indeed so inclined; but if you help one another against him, then verily, Allah is his Protector, and Jibril, and the righteous among the believers; and after that the angels are his helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you both turn to Allah, then indeed your hearts are already inclined (to this); and if you back up each other against him, then surely Allah it is Who is his Guardian, and Jibreel and -the believers that do good, and the angels after that are the aiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you two repent to God, yet your hearts certainly inclined; but if you support one another against him, God is his Protector, and Gabriel, and the righteous among the believers; and, after that, the angels are his supporters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye twain turn unto Allah repentant, (ye have cause to do so) for your hearts desired (the ban); and if ye aid one another against him (Muhammad) then lo! Allah, even He, is his Protecting Friend, and Gabriel and the righteous among the believers; and furthermore the angels are his helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only both of you would turn to God in repentance -- and your hearts are already so inclined. But if you uphold each other against him, then surely God is his protector, and Gabriel and the righteous among the believers; and the angels too are his helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye twain turn Unto Allah repentant, it is well, surely your hearts are so inclined, and if ye support each other against him, then verily Allah! his friend is He and Jibril and so are the righteous believers; and furthermore the angels are his aiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the two of you repent to Allah... for your hearts have certainly swerved, and if you back each other against him, then [know that] Allah is indeed his guardian, and his supporters are Gabriel, the righteous among the faithful and, thereafter, the angels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye two turn in repentance to Him, your hearts are indeed so inclined; But if ye back up each other against him, truly Allah is his Protector, and Gabriel, and (every) righteous one among those who believe,- and furthermore, the angels - will back (him) up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you two (wives of the Prophet SAW, namely 'Aishah and Hafsah) turn in repentance to Allah, (it will be better for you), your hearts are indeed so inclined (to oppose what the Prophet SAW likes), but if you help one another against him (Muhammad SAW), then verily, Allah is his Maula (Lord, or Master, or Protector, etc.), and Jibrael (Gabriel), and the righteous among the believers, and furthermore, the angels are his helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If both of you (wives) turn to Allah in repentance, even though your hearts inclined; but if you support one another against him, (know that) Allah is hisGuardian, and Gabriel, and the righteous among the believers; and thereafter the angels are his reinforcers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you repent to God, then your hearts have listened. But if you band together against him, then God is his Ally, as is Gabriel, and the righteous believers. In addition, the angels will assist him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you two [wives] repent to Allah, [it is best], for your hearts have deviated. But if you cooperate against him - then indeed Allah is his protector, and Gabriel and the righteous of the believers and the angels, moreover, are [his] assistants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[66:4] If the two of you, namely, Hafsa and ‘Ā’isha, repent to God … for your hearts were certainly inclined, towards the prohibition of Māriya, that is to say, your keeping this secret despite [knowing] the Prophet’s (s) dislike of it, which is itself a sin (the response to the conditional [‘if the two of you repent to God’] has been omitted, to be understood as, ‘it will be accepted of both of you’; the use of [the plural] qulūb, ‘hearts’, instead of [the dual] qalbayn, ‘both [your] hearts’, is on account of the cumbersomeness of putting two duals together in what is effectively the same word); and if you support one another (tazzāharā: the original second tā’ [of tatazāharā] has been assimilated with the zā’; a variant reading has it without [this assimilation, tazāharā]) against him, that is, the Prophet, in what he is averse to, then [know that] God, He (huwa, [a pronoun] for separation) is indeed his Protector, His supporter, and Gabriel, and the righteous among the believers, Abū Bakr and ‘Umar, may God be pleased with both of them (wa-Jibrīlu wa-sālihu’lmu’minīna is a supplement to the [syntactical] locus of the subject of inna [sc. ‘God’]), who will [also] be his supporters, and the angels furthermore, further to the support of God and those mentioned, are his supporters, assistants of his, in supporting him [to prevail] over both of you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If ye twain turn unto Allah repentant) if you two, i.e. Hafsah and 'A'ishah, repent of hurting and disobeying the Prophet (pbuh) ((ye have cause to do so) for your hearts desired (the ban)) for your hearts have deviated from the Truth; (and if ye aid one another against him (Muhammad)) but if you help one another to harm and disobey him (then lo! Allah, even He, is his protecting Friend) then Allah is his Protector and Helper against you, (and Gabriel) will help him against you (and the righteous among the believers) all true believers are helpers to him against you: Abu Bakr, 'Umar, 'Uthman, 'AN, may Allah be well pleased with, and all other true believers; (and furthermore the angels are his helpers) and the angels are with all these his helpers against you. 676\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِن تَتُوبَآ إِلَى ٱللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا } معناه طَغتْ ومالتْ وَعَدلتْ\n\n\n\n\nوقوله تعالى: { وَإِن تَظَاهَرَا عَلَيْهِ } معناه تَعاونا عَليهِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"If you turn to Allah, then indeed your hearts have been inclined [to righteousness]\" - this means that you have rebelled and disobeyed, but then you have turned back and repented, so your hearts are now right with Allah.\n\n\nAnd if you two cooperate against him,",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه في قِبَل نبيه صلى الله عليه وسلم على وجه الخطاب المبنئ عن العتاب: { إِن تَتُوبَآ إِلَى ٱللَّهِ } أنت وعائشة عما صدر عنكما توبةً صادرة عن محض الندم والإخلاص\n منبئة عن كمال الموافقة والاختصاص مع الرسول صلى الله عليه وسلم فقد جبرتما ما كسرتما\n وإلاَّ { فَقَدْ صَغَتْ } زاغت ومالت { قُلُوبُكُمَا } عن موافقة الرسول ومخالصته\n فجئتما بما يكرهه صلى الله عليه وسلم وبكراهتكما ما يحبه صلى الله عليه وسلم { وَإِن تَظَاهَرَا } وتعاونا { عَلَيْهِ } أي: على ما أنتما عليه من مخالفة الرسول فلن تضرا له صلى الله عليه وسلم شيئاً من الضرر\n وكيف يلحقه صلى الله عليه وسلم ضرر منكما { فَإِنَّ اللَّهَ } المراقب لعموم أحواله { هُوَ } سبحانه { مَوْلاَهُ } ناصره ومعينه\n ومولي عموم أموره { وَجِبْرِيلُ } رئيس الكروبيين قرينه وملازمه { وَصَالِحُ الْمُؤْمِنِينَ } أتباعه وأعوانه { وَالْمَلاَئِكَةُ } أي: عموم الملائكة { بَعْدَ ذَلِكَ } أي: بعد نصر أولئك المظاهرين { ظَهِيرٌ } [التحريم: 4] له سبحانه على سبيل التعريض لعموم أزواجه صلى الله عليه وسلم؟!\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِن تتوبا إِلى الله } ، الخطاب لحفصة وعائشة، على الالتفات للمبالغة في العتاب، { فقد صَغَتْ قُلوبُكما } مالت عن الواجب في مخالصة رسول الله صلى الله عليه وسلم، مِن حُب ما يُحبه، وكراهة ما يكرهه، وكان عليه الصلاة والسلام شقَّ عليه تحريم مارية وكَرِهَه، وهما فرحا بذلك\n وجواب الشرط: محذوف، أي: إن تتوبا إلى الله فهو الواجب، فقد زالت قلوبكما عن الحق، أو: تُقبلْ توبتكما، أو هو: \" فقد صغت \" أي: إن تتوبا فقد زاغب قلوبكما فاستوجبتما التوبة، أو: فقد كان منكما ما يقضي أن يُتاب منه\n قال ابن عطية: وهذا الجواب للشرط، وهو متقدم في المعنى، وإنما نزلت جواباً في اللفظ\n هـ\n وقُرىء \" زاغت \" من الزيغ\n { وإِن تَظَاهرا عليه } أي: تتعاونا عليه بما يسوؤه، من الإفراط في الغيرة، وإفشاء سرّه، والفرح بتحريم مارية، { فإِنَّ اللهَ هو مولاه } وليُّه وناصره، وزيادة \" هو \" إيذان: أنّه يتولّى ذلك بذاته بلا واسطة، { وجبريلُ } أيضاً وليّه، الذي هو رئيس الملائكة المقرّبين، { وصالحُ المؤمنين } أي: ومَن صلح مِن المؤمنين، أي: كل مَن آمن وعمل صالحاً، وقيل: مَن برىء مِن النفاق، وقيل: الصحابة جملة، وقال ابن عباس: أبو بكر وعمر، ورُوي مرفوعاً، وبه قال عكرمة ومقاتل، وهو اللائق لتوسيطه بين جبريل والملائكة عليهم السلام، فإنه جمع بين التظاهر المعنوي والتظاهر الحسي، فجبريل ظاهَره عليه السلام بالتأييدات الإلهية، وهما وزيراه وظهيراه في أمور الرسالة، وتمشية أحكامها الظاهرة، ولأنَّ تظاهرهما له صلى الله عليه وسلم أشد تأثيراً في قلوب بنيتْهما، وتوهيناً في حقهما، فكانا حقيقا بالذكر، بخلاف ما إذا أريد به جنس الصالحين، كما هو المشهور\n\n\nقاله أبو السعود\n { والملائكةُ } مع تكاثر عددهم وامتلاء السموات من جموعهم { بعد ذلك } أي: بعد نصرةِ الله عزّ وجل، وناموسه الأعظم، وصالح المؤمنين، { ظهيراً } أي: فوْج ظهير مُعاون له، كأنهم يد واحدة على مَن يعاديه، فماذا يفيد تظاهر امرأتين على مَنْ هؤلاء ظُهراؤه؟ ولمّا كانت مظاهرة الملائكة من جملة نصرة الله، قال: { بعد ذلك } تعظيماً لنصرتهم ومظاهرتهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:113",
      "similarity": 0.5773818164131272
    },
    {
      "verse": "2:97",
      "similarity": 0.527451231711649
    },
    {
      "verse": "2:98",
      "similarity": 0.30173933187415003
    },
    {
      "verse": "3:89",
      "similarity": 0.059478065802221286
    },
    {
      "verse": "24:5",
      "similarity": 0.059478065802221286
    }
  ]
}