{
  "chapter": "التحريم",
  "text": "عسى ربه ان طلقكن ان يبدله ازوجا خيرا منكن مسلمت مؤمنت قنتت تئبت عبدت سئحت ثيبت وابكارا",
  "translations": [
    {
      "translation": "It may be that if he does divorce you, his Lord will give him in exchange better wives than you: Muslim women, believing women, obedient women, penitent women, women who worship, women who fast much - previously married women as well as virgins.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In case he divorces you, his Lord will give him better wives in return, who will be modest, true believers, obedient to God, repentant, observant of prayer and fasting, both widows and virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Maybe if he were to divorce you, your Lord might grant him in exchange wives better than you – those who truly submit to Allah, are full of faith, obedient, disposed to repentance, and given to worship and fasting – both previously wedded ones and virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If he divorces you, perhaps his Lord will replace you with better wives, either widows or virgins who will be Muslims: believers, faithful, obedient, repentant, and devout in prayer and fasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is likely that, if he divorces you, his Lord will give him wives better than you in your place -widows and maidens who are obedient, believing, respectful, penitent, serving and fasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Maybe his Lord, if he divorces you, will give him instead of you, wives better than you - submitting, believers, obedient, turning to Allah in repentance, worshipping Allah sincerely, Sa'ihat, previously married, and virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Maybe, his Lord, if he divorce you, will give him in your place wives better than you, submissive, faithful, obedient, penitent, adorers, fasters, widows and virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is possible that, if he divorces you, his Lord will give him in exchange wives better than you, women who have surrendered, believing, obedient, penitent, devout, given to fasting, who have been married and virgins too.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may happen that his Lord, if he divorce you, will give him in your stead wives better than you, submissive (to Allah), believing, pious, penitent, devout, inclined to fasting, widows and maids.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were he to divorce you, his Lord might well replace you with better wives -- submissive [to God], believing, pious, penitent, devout in worship, given to fasting -- previously married and virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Belike his Lord, if he divorce you, will give him in exchange wives better than you, Muslims, believers, devout, penitent, worshippers, given to fasting, both non-virgins and virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be that if he divorces you his Lord will give him, in [your] stead, wives better than you: [such as are] muslim, faithful, obedient, penitent, devout and given to fasting, virgins and non-virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be, if he divorced you (all), that Allah will give him in exchange consorts better than you,- who submit (their wills), who believe, who are devout, who turn to Allah in repentance, who worship (in humility), who travel (for Faith) and fast,- previously married or virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be if he divorced you (all) that his Lord will give him instead of you, wives better than you, Muslims (who submit to Allah), believers, obedient to Allah, turning to Allah in repentance, worshipping Allah sincerely, fasting or emigrants (for Allah's sake), previously married and virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be that if he divorces you his Lord will give him in your place better wives than yourselves, women who have surrendered, believing, obedient, penitent worshippers and given to fasting; who were (previously) married, and virgins too.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps, if he divorces you, his Lord will give him in exchange wives better than you: submissive, believing, obedient, penitent, devout, fasting—previously married, or virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps his Lord, if he divorced you [all], would substitute for him wives better than you - submitting [to Allah], believing, devoutly obedient, repentant, worshipping, and traveling - [ones] previously married and virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[66:5] It may be that, if he divorces you, that is, [if] the Prophet divorces his wives, his Lord will give him in [your] stead (read yubaddilahu or yubdilahu) wives better than you (azwājan khayran minkunna is the predicate of ‘asā, ‘it may be’, the sentence being the response to the conditional) — the replacement [of his wives by God] never took place because the condition [of his divorcing them] never arose — women submissive [to God], affirming Islam, believing, faithful, obedient, penitent, devout, given to fasting — or given to emigrating [in God’s way] — previously married and virgins.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعَسَى رَبُّهُ إِنْ طَلَّقَكُنَّ أَنْ يُبْدِلَهُ أَزْوَاجًا خَيْرًا مِنْكُنَّ مُسْلِمَاتٍ مُؤْمِنَاتٍ قَانِتَاتٍ تَائِبَاتٍ عَابِدَاتٍ سَائِحَاتٍ ثَيِّبَاتٍ وَأَبْكَارًا (5)ليس هذا مما يتعلق بالشرط في قوله : { وإن تظاهرا عليه } \\[ التحريم : 4 \\] بل هو كلام مستأنف عدل به إلى تذكير جميع أزواجه بالحذر من أن يضيق صدره عن تحمل أمثال هذا الصنيع فيفارقهن لتقلع المتلبسة وتحذر غيرها من مثل فعلها .فالجملة مستأنفة استئنافاً ابتدائياً عقبت بها جملة { إن تتوبا إلى الله فقد صغت قلوبكما } \\[ التحريم : 4 \\] التي أفادت التحذير من عقاب في الآخرة إن لم تتوبا مما جرى منهما في شأن رسول الله صلى الله عليه وسلم أفاد هذا الإِيماء إلى التحذير من عقوبة دنيوية لهن يأمر الله فيها نبيئه صلى الله عليه وسلم وهي عقوبة الطلاق عليه ما يحصل من المؤاخذة في الآخرة إن لم تتوبا ، ولذلك فصلت عن التي قبلها لاختلاف الغرضين .وفي قوله : { عسى ربه إن طلقكن } إيجاز بحذف ما يترتب عليه إبدالهن من تقدير إن فارقكن . فالتقدير : عسى أن يطلقكن هو ( وإنما يطلق بإذن ربه ) أن يُبدله ربُّه بأزواج خيرٍ منكن .وفي هذا ما يشير إلى المعْنى الرابع عشر والخامس عشر من معاني الموعظة والإِرشاد التي ذكرناها آنفاً .و { عسى } هنا مستعملة في التحقيق وإيثارها هنا لأن هذا التبديل مجرد فرض وليس بالواقع لأنهن لا يظن بهن عدم الارعواء عما حذرن منه ، وفي قوله : { خيراً منكن } تذكير لهن بأنهن ما اكتسبن التفضيل على النساء إلا من فضل زوجهن عند الله وإجراء الأوصاف المفصلة بعد الوصف المجمل وهو { خيراً منكن } للتنبيه على أن أصول التفضيل موجودة فيهن فيكمل اللاء يتزوجهن النبي صلى الله عليه وسلم فضل على بقية النساء بأنهن صرن أزواجاً للنبيء صلى الله عليه وسلموهذه الآية إلى قوله : { خيراً منكن } نزلت موافِقة لقول عمر لابنته حفصة رضي الله عنهما مثل هذا اللفظ وهذا من القرآن الذي نزل وفاقاً لقول عمر أو رأيه تنويهاً بفضله . وقد وردت في حديث في «الصحيحين» واللفظ للبخاري «عن عمر قال : وافقت ربي في ثلاث : قلت : يا رسول الله لو اتخذت من مقام إبراهيم مصلّى ، فنزلت { واتخذوا من مقام إبراهيم مصلى } \\[ البقرة : 125 \\] ، وقلت : «يدخلُ عليك البرّ والفاجر فلو أمرت أمهاتتِ المؤمنين بالحجاب» فأنزل الله آية الحجاب . وبلغنِي معاتبة النبي بعضَ نسائه فدخلت عليهن فقلت : إن انتهيتن أو ليبدلَنَّ الله رسولَه خيراً منكن فأنزل الله { عسى ربه إن طلقكن أن يبدله أزواجاً خيراً منكن مسلمات } الآية .وهي موعظة بأن يأذن الله له بطلاقهن وأنه تصير له أزواجٌ خيرٌ منهن .وهذا إشارة إلى المعنى السادس عشر من مواعظ هذه الآي . .وقرأ الجمهور { أن يبدّله } بتشديد الدال مضارع بدّل . وقرأه يعقوب بتخفيف مضارع أبدل .والمسلمات : المتصفات بالإِسلام . والمؤمنات : المصدّقات في نفوسهن .والقانتات : القائمات بالطاعة أحسن قيام . وتقدم القنوت في قوله تعالى : { وقوموا لله قانتين } في سورة \\[ البقرة : 238 \\] . وقوله : { ومن يقنت منكن لله ورسوله } في سورة \\[ الأحزاب : 31 \\] .وفي هذا الوصف إشعار بأنهن مطيعات لله ورسوله ففيه تعريض لما وقع من تقصير إحداهن في ذلك فعاتبها الله وأيقظها للتوبة .والتائبات : المقلعات عن الذنب إذا وقعن فيه . وفيه تعريض بإعادة التحريض على التوبة من ذنبهما التي أُمرتا بها بقوله : { إن تتوبا إلى الله } \\[ التحريم : 4 \\] .والعابدات : المقبلات على عبادة الله وهذه الصفات تفيد الإِشارة إلى فضل هذه التقوى وهو المعنى السابع عشر من معاني العبرة في هذه الآيات .والسائحات : المهاجرات وإنما ذكر هذا الوصف لتنبيههن على أنهنّ إن كنّ يمتُنّ بالهجرة فإن المهاجرات غيرَهن كثير ، والمهاجرات أفضل من غيرهن ، وهذه الصفة تشير إلى المعنى الثامن عشر من معاني الاعتبار في هذه الآي .وهذه الصفات انتصبت على أنها نعوت ل { أزواجاً } ، ولم يعطف بعضُها على بعض الواو ، لأجل التنصيص على ثبوت جميع تلك الصفات لكل واحدة منهن ولو عطفت بالواو لاحتمل أن تكون الواو للتقسيم ، أي تقسيم الأزواج إلى من يثبت لهن بعض تلك الصفات دون بعض ، ألا ترى أنه لما أريدت إفادة ثبوت إحدى صفتين دون أخرى من النعتين الواقعين بعد ذلك كيف عطف بالواو قولُه : { وأبكاراً } لأن الثّيبات لا يوصفن بأبكار . والأبكار لا يوصفن بالثيّبات . قُلت وفي قوله تعالى : { مسلمات } ، إلى قوله : { سائحات } مُحسن الكلام المتزن إذْ يَلتئم من ذلك بيت من بحر الرمل التام: ... فاعلتن فاعلتن فاعلتنفاعلاتن فاعلاتن فاعلتن ... ووجه هذا التفصيل في الزوجات المقدرات لأن كلتا الصفتين محاسنها عند الرجال؛ فالثيب أرعى لواجبات الزوج وأميل مع أهوائه وأقوم على بيته وأحسن لِعاباً وأبهى زينة وأحلى غنجاً .والبكر أشد حياء وأكثر غرارة ودلاً وفي ذلك مجلبة للنفس ، والبكر لا تعرف رجلاً قبل زوجها ففي نفوس الرجال خلق من التنافس في المرأة التي لم يسبق إليها غيرهم .فما اعتزت واحدة من أزواج النبي صلى الله عليه وسلم بمزية إلا وقد أنبأها الله بأن سيبدله خيراً منها في تلك المزية أيضاً .وهذا هو المعنى التاسع عشر من معاني الموعظة والتأديب في هذه الآيات .وتقديم وصف { ثيبات } لأن أكثر أزواج النبي صلى الله عليه وسلم لمّا تزوجهن كن ثيبات . ولعله إشارة إلى أن الملام الأشد موجه إلى حفصة قبل عائشة وكانت حفصة ممن تزوجهن ثيبات وعائشة هي التي تزوجها بكراً . وهذا التعريض أسلوب من أساليب التأديب كما قيل : «الحر تكفيه الإِشارة» .وهذا هو المعنى العشرون من مغزى آداب هذه الآيات .ومن غرائب المسائل الأدبية المتعلقة بهذه الآية أن الواو في قوله تعالى : { ثيبات وأبكاراً } زَعمها ابنُ خَالويه واواً لها استعمال خاص ولقبها بواو الثمانية ( بفتح المثلثة وتخفيف التحتية بعد النون ) وتبعهُ جماعة ذكروا منهم الحريري والثعلبي النيسابوري المفسر والقاضي الفاضل .أنهم استخرجوا من القرآن أن ما فيه معنى عدد ثمانية تدخل عليه واو ويظهر من الأمثلة التي مثلوا بها أنهم يعتبرون ما دل على أمر معدود بعدد كما فيه سواء كان وصفاً مشتقاً من عدد ثمانية أو كان ذاتاً ثامنة أو كان يشتمل على ثمانية سواء كان ذلك مفرداً أو كان جملة . فقد مثلوا بقوله تعالى في سورة \\[ براءة : 112 \\] : { التائبون العابدون الحامدون السائحون الراكعون الساجدون الآمرون بالمعروف والناهون عن المنكر } قالوا لم يعطف الصفات المسرودة بالواو إلا عند البلوغ إلى الصفة الثامنة وهي الناهون عن المنكر } . وجعلوا من هذا القبيل آية سورة التحريم إذ لم يعطف من الصفات المبدوءة بقوله : { مسلمات } إلا الثامنة وهي { وأبكاراً } ومثلوا لما وصف فيه بوصف ثامن بقوله تعالى : { ويقولون سبعة وثامنهم كلبهم } في سورة \\[ الكهف : 22 \\] . فلم يعطف رابعهم } ولا { سادسهم } وعطفت الجملة التي وقع فيها وصف الثامن بواو عطف الجمل . ومثلوا لما فيه كلمة ثمانية بقوله تعالى : { سخرها عليهم سبع ليال وثمانية أيام حسوماً } في سورة \\[ الحاقة : 7 \\] . ومثلوا لما يشتمل على ثمانية أسماء بقوله تعالى في سورة \\[ الزمر : 73 \\] : { وسيق الذين اتقوا ربهم إلى الجنة زمراً حتى إذا جاءوها وفتحت أبوابها قالوا جاءت جملة وفتحت } هذه بالواو ولم تجىء أختها المذكورة قبلها وهي { وسيق الذين كفروا إلى جهنم زمراً حتى إذا جاءوها فتحت أبوابها } \\[ الزمر : 71 \\] . لأن أبواب الجنة ثمانية .وترددت كلماتهم في أن هذه الواو من صنف الواو العاطفة يمتاز عن الصنف الآخر يلزم ذكره إذا كان في المعطوف معنى الثامن أو من صنف الواو الزائدة .وذكر الدمَاميني في الحواشي } الهندية على «المغني» أنه رأى في «تفسير العماد الكندي» قاضي الإِسكندرية ( المتوفى في نحو عشرين وسبعمائة ) نسبة القول بإثبات واو الثمانية إلى عبد الله الكفيف المالقي النحوي الغرناطي من علماء غرناطة في مدة الأمير ابن حَبوس ( بموحدة بعد الحاء المهملة ) هو باديس بن حبوس صاحب غرناطة سنة 420 .وذكر السهيلي في «الروض الأنف» عند الكلام على نزول سورة الكهف أنه أفرد الكلام على الواو التي يسميها بعض الناس واو الثمانية باباً طويلاً ولم يبد رأيه في إثباتها ولم أقف على الموضع الذي أفرد فيه الكلام عليها . ويظهر أنه غير موافق على إثبات هذا الاستعمال لها . ومن عجيب الصدف ما اتفق في هذه الآيات الأربع من مثير شبهة للذين أثبتوا هذا المعنى في معاني الواو . ومن غريب الفطنة تنبه الذي أنبأ بهذا .وذكر ابن المنير في «الانتصاف» أن شيخه ابن الحاجب ذكر له أن القاضي الفاضل عبد الرحيم البيساني الكاتب كان يعتقد أن الواو في قوله تعالى : { وأبكاراً } هي الواو التي سماها بعض ضعفة النحاة واو الثمانية .وكان الفاضلُ يتبجح باستخراجها زائدة على المواضع الثلاثة المشهورة إلى أن ذكره يوماً بحضيرة أبي الجود النحوي المقري ، فبين لهم أنه واهم في عدها من ذلك القبيل وأحال البيان على المعنى الذي ذكره الزمخشري في دعاء اللزوم إلى الإِتيان بالواو هنا لامتناع اجتماع هذين الصنفين في موصوف واحد . فأنصفه الفاضل وقال : أرشدتنا يا أبا الجود .قلت : وأرى أن القاضي الفاضل تعجل التسليم لأبي الجُود إذ كان له أن يقول : إنا لم نلتزم أن يكون المعدود الثامن مستقلاً أو قسيماً لغيره وإنما تتبعنا ما فيه إشعار بعدد ثمانية .ونقل الطيبي والقزويني في «حاشيتي الكشاف» أنه روى عن صاحب «الكشاف» أنه قال : الواو تدخل في الثامن كقوله تعالى : { وثامنهم كلبهم } \\[ الكهف : 22 \\] ، وقوله : { وفتحت أبوابها } \\[ الزمر : 73 \\] ويسمونه واو الثمانية وهي كذلك ، وليس بشيء . قال الراوي عنه وقد قال لنا عند قراءة هذا الموضع : أنسيتم واو الثمانية عند جوابي هذا ( أي يلومهم على إهمالهم ذلك المعنى في تلك الآية ) أي هو جواب حسن وذلك خطأ محض لا يجوز أن يؤخذ به اه .قلت : وهذا يخالف صريح كلامه في «الكشاف» فلعل الراوي لم يحسن تحرير مراد صاحب «الكشاف» ، أو لعل صاحب «الكشاف» لم ير منافاة بين لزوم ذكر الواوين اقتضاء المقام ذكرها بأن المعطوف بها ثامن في الذكر فإن النكت لا تتزاحم فتأمل بتدقيق .وتقدم الكلام على واو الثمانية عند قوله تعالى : { التائبون العابدون } الآية في سورة \\[ براءة : 112 \\] . وعند قوله : { ويقولون سبعة وثامنهم كلبهم } في سورة \\[ الكهف : 22 \\] ، وتقدمت في سورة الزمر وفي سورة الحاقة .\n\n",
      "translations": [
        {
          "translation": "(It may happen) and this will surely happen (that his Lord, if he divorce you, will give him in your stead wives better than you) in obedience, (submissive (to Allah)) by stating it openly, (believing) true in their faith both with their tongues and hearts, (pious) obedient to Allah and to their husband, (penitent) from their sins, (inclined to fasting, widows) like Asiyah Bint Muzahim, the wife of Pharaoh (and maids) like Mary daughter of Amran, the mother of Jesus.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قَانِتَاتٍ } أي مُطيعاتٍ و: { سَائِحَاتٍ } أي صائماتٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {qanitat} - that is, those who are obedient - and {sa'ihat} - that is, those who are fasting.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ عَسَىٰ رَبُّهُ } الذي رباه على الكرامة الأصلية\n والنجابة الجبلية { إِن طَلَّقَكُنَّ } جميعاً { أَن يُبْدِلَهُ } بمقتضى قدرته وإرادته { أَزْوَاجاً خَيْراً مِّنكُنَّ } صورة وسيرة\n أخلاقاً وأعمالاً { مُسْلِمَاتٍ } في الاعتقاد\n مسلمات عن العيوب { مُّؤْمِنَاتٍ } بوحدة الحق\n مصدقات لعموم ما نزل من عنده { قَانِتَاتٍ } راسخات على الطاعات\n مواظبات على عموم الخيرات\n خاضعات خاشعات لله في عموم الأوقات { تَائِبَاتٍ } عن عموم المنكرات والمحظورات { عَابِدَاتٍ } على وجه التذلل والخضوع\n وكمال الانكسار والخشوع { سَائِحَاتٍ } صائمات أو مهاجرات { ثَيِّبَاتٍ وَأَبْكَاراً } [التحريم: 5] يعني: سواء كن ثيبات أو أبكاراً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { عسى ربُّه إِن طَلَّقكُنَّ أن يُبْدِلَه } بالتخفيف والتشديد للتكثير\n أي: يعطيه اللهُ تعالى بدلكن { أزواجاً خيراً منكن } \n قال النسفي: فإن قلتَ: كيف تكون المبدّلات خيراً منهنَ\n ولم يكن على وجه الأرض نساء خيراً من أمهات المؤمنين؟ قلتُ: إذا طلّقهنّ رسولُ الله صلى الله عليه وسلم لإيذائهنّ إياه لم يبقين على تلك الصفة\n وكان غيرهن من الموصوفات بهذه الأوصاف خيراً منهن\n هـ\n وأجاب أبو السعود: بأنّ ما عُلّق بما لم يقع لا يجب وقوعه\n هـ\n وليس فيه ما يدلّ على أنه صلى الله عليه وسلم لم يُطلِّق حفصة\n فإنّ تعليق طلاق الكل لا ينافي تطليق واحدة\n ثم وصف المبدَلات بقوله: { مُسلماتٍ مؤمناتٍ } أي: مُقرّات مخلصات\n أو: منقادات مصدّقات\n { قانتاتٍ } طائعات\n فالقنوت: هو القيام بطاعة الله\n وطاعة الله في طاعة رسوله\n { تائباتٍ } من الذنوب { عابداتٍ } متعبدات متذللات\n { سائحاتٍ } صائمات\n وقيل للصائم: سائح لأنَّ السائح لا زاد معه\n فلا يزال ممسكاً إلى أن يجد من يُطعمه\n فشبّه به الصائم في إمساكه إلى وقت إفطاره\n أو: مهاجرات\n قال زيد بن أسلم: لم يكن في هذه الأمة سياحة إلاَّ الهجرة\n { ثيباتٍ وأبكاراً } \n إنما وسط العاطف بين الثيبات والأبكار\n دون سائر الصفات لأنهما صفتان متباينتان\n وعَطْف الأبكار على الثيبات من باب الترقي من الأدنى إلى الأعلى\n كقوله تعالى:\n[التوبة:121]\n والله تعالى أعلم\n الإشارة: توجه العتاب له صلى الله عليه وسلم مرتين في تحريم الجارية\n وفي إخفائه لذلك\n إذ فيه بعض مراقبة الخلق\n والعارف لا يُراقب إلاّ الحق\n فهذا قريب من قوله تعالى:\n[الأحزاب:37]\n ففيه من التصوُّف: أنَّ العارف يكون الناس عنده كالموتى\n أو كالهباء في الهواء\n وفي الحديث عنه عليه الصلاة والسلام:\n \" لا يؤمن أحدكم حتى يكون الناس عنده كالأباعر \" \n \nإذا ليس بيدهم نفع ولا ضر\n وإشارة الآية على ما قال القشيري: وإذ أَسَرَّ القلبُ إلى بعض أزواجه\n وهي النفس والهوى\n حديث المخالفة\n على طريق\n \" شاوروهنّ وخالِفوهنّ \" \nفلما نبأت النفسُ الهوَى لتفعلا ذلك\n وأظهره الله عليه بوحي الإلهام\n عَرَّف بعضَه وأعرض عن بعض\n أي: عاتبهما على البعض\n وسامحهما في الآخر\n فلما نبأ القلبُ النفسَ بما أفشت للهوى\n قالت: مَن أنبأك هذا\n\n الخ\n إن تتوبا إلى الله\n وتنقادا لحكمه فقد وقع منكما ما يوجب التوبة\n وإن تظاهرا على القلب بتزيين المخالفة وتتبع الحظوظ والشهوات\n فإنَّ الله هو مولاه\n ينصره بالأجناد السماوية والأرضية\n من التأييدات والواردات\n عسى ربه إن طلقكن وغاب عنكن أن يُبدله أخلاقاً طيبة\n ونفوساً مطمئنة\n مسلماتٍ مؤمناتٍ قانتاتٍ تائباتٍ\n عابداتٍ سائحاتٍ بأفكارها في ميادين الغيوب\n وبحار التوحيد\n ثيبات\n أي: تأتي بعلوم الرسميات وأبكار الحقائق\n ثم أمر الحقُّ تعالى بإرشاد النساء وتأديبهن\n فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ قُوۤاْ أَنفُسَكُمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:112",
      "similarity": 0.3083806248076664
    },
    {
      "verse": "9:2",
      "similarity": 0.30481607961166896
    },
    {
      "verse": "30:26",
      "similarity": 0.09581318780404638
    },
    {
      "verse": "56:36",
      "similarity": 0.0954516924862095
    },
    {
      "verse": "19:62",
      "similarity": 0.09466270231573017
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/066005.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/066005.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/66:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}