{
  "chapter": "التحريم",
  "text": "عسى ربه ان طلقكن ان يبدله ازوجا خيرا منكن مسلمت مؤمنت قنتت تئبت عبدت سئحت ثيبت وابكارا",
  "translations": [
    {
      "translation": "In case he divorces you, his Lord will give him better wives in return, who will be modest, true believers, obedient to God, repentant, observant of prayer and fasting, both widows and virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Maybe if he were to divorce you, your Lord might grant him in exchange wives better than you – those who truly submit to Allah, are full of faith, obedient, disposed to repentance, and given to worship and fasting – both previously wedded ones and virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If he divorces you, perhaps his Lord will replace you with better wives, either widows or virgins who will be Muslims: believers, faithful, obedient, repentant, and devout in prayer and fasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is likely that, if he divorces you, his Lord will give him wives better than you in your place -widows and maidens who are obedient, believing, respectful, penitent, serving and fasting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Maybe his Lord, if he divorces you, will give him instead of you, wives better than you - submitting, believers, obedient, turning to Allah in repentance, worshipping Allah sincerely, Sa'ihat, previously married, and virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Maybe, his Lord, if he divorce you, will give him in your place wives better than you, submissive, faithful, obedient, penitent, adorers, fasters, widows and virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is possible that, if he divorces you, his Lord will give him in exchange wives better than you, women who have surrendered, believing, obedient, penitent, devout, given to fasting, who have been married and virgins too.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may happen that his Lord, if he divorce you, will give him in your stead wives better than you, submissive (to Allah), believing, pious, penitent, devout, inclined to fasting, widows and maids.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were he to divorce you, his Lord might well replace you with better wives -- submissive [to God], believing, pious, penitent, devout in worship, given to fasting -- previously married and virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Belike his Lord, if he divorce you, will give him in exchange wives better than you, Muslims, believers, devout, penitent, worshippers, given to fasting, both non-virgins and virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be that if he divorces you his Lord will give him, in [your] stead, wives better than you: [such as are] muslim, faithful, obedient, penitent, devout and given to fasting, virgins and non-virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be, if he divorced you (all), that Allah will give him in exchange consorts better than you,- who submit (their wills), who believe, who are devout, who turn to Allah in repentance, who worship (in humility), who travel (for Faith) and fast,- previously married or virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be if he divorced you (all) that his Lord will give him instead of you, wives better than you, Muslims (who submit to Allah), believers, obedient to Allah, turning to Allah in repentance, worshipping Allah sincerely, fasting or emigrants (for Allah's sake), previously married and virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It may be that if he divorces you his Lord will give him in your place better wives than yourselves, women who have surrendered, believing, obedient, penitent worshippers and given to fasting; who were (previously) married, and virgins too.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps, if he divorces you, his Lord will give him in exchange wives better than you: submissive, believing, obedient, penitent, devout, fasting—previously married, or virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perhaps his Lord, if he divorced you [all], would substitute for him wives better than you - submitting [to Allah], believing, devoutly obedient, repentant, worshipping, and traveling - [ones] previously married and virgins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[66:5] It may be that, if he divorces you, that is, [if] the Prophet divorces his wives, his Lord will give him in [your] stead (read yubaddilahu or yubdilahu) wives better than you (azwājan khayran minkunna is the predicate of ‘asā, ‘it may be’, the sentence being the response to the conditional) — the replacement [of his wives by God] never took place because the condition [of his divorcing them] never arose — women submissive [to God], affirming Islam, believing, faithful, obedient, penitent, devout, given to fasting — or given to emigrating [in God’s way] — previously married and virgins.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(It may happen) and this will surely happen (that his Lord, if he divorce you, will give him in your stead wives better than you) in obedience, (submissive (to Allah)) by stating it openly, (believing) true in their faith both with their tongues and hearts, (pious) obedient to Allah and to their husband, (penitent) from their sins, (inclined to fasting, widows) like Asiyah Bint Muzahim, the wife of Pharaoh (and maids) like Mary daughter of Amran, the mother of Jesus.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قَانِتَاتٍ } أي مُطيعاتٍ و: { سَائِحَاتٍ } أي صائماتٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { عسى ربُّه إِن طَلَّقكُنَّ أن يُبْدِلَه } بالتخفيف والتشديد للتكثير، أي: يعطيه اللهُ تعالى بدلكن { أزواجاً خيراً منكن } ، قال النسفي: فإن قلتَ: كيف تكون المبدّلات خيراً منهنَ، ولم يكن على وجه الأرض نساء خيراً من أمهات المؤمنين؟ قلتُ: إذا طلّقهنّ رسولُ الله صلى الله عليه وسلم لإيذائهنّ إياه لم يبقين على تلك الصفة، وكان غيرهن من الموصوفات بهذه الأوصاف خيراً منهن\n هـ\n وأجاب أبو السعود: بأنّ ما عُلّق بما لم يقع لا يجب وقوعه\n هـ\n وليس فيه ما يدلّ على أنه صلى الله عليه وسلم لم يُطلِّق حفصة، فإنّ تعليق طلاق الكل لا ينافي تطليق واحدة\n ثم وصف المبدَلات بقوله: { مُسلماتٍ مؤمناتٍ } أي: مُقرّات مخلصات، أو: منقادات مصدّقات، { قانتاتٍ } طائعات، فالقنوت: هو القيام بطاعة الله، وطاعة الله في طاعة رسوله، { تائباتٍ } من الذنوب { عابداتٍ } متعبدات متذللات، { سائحاتٍ } صائمات، وقيل للصائم: سائح لأنَّ السائح لا زاد معه، فلا يزال ممسكاً إلى أن يجد من يُطعمه، فشبّه به الصائم في إمساكه إلى وقت إفطاره، أو: مهاجرات\n قال زيد بن أسلم: لم يكن في هذه الأمة سياحة إلاَّ الهجرة، { ثيباتٍ وأبكاراً } ، إنما وسط العاطف بين الثيبات والأبكار، دون سائر الصفات لأنهما صفتان متباينتان، وعَطْف الأبكار على الثيبات من باب الترقي من الأدنى إلى الأعلى، كقوله تعالى:\n\n[التوبة:121]\n والله تعالى أعلم\n الإشارة: توجه العتاب له صلى الله عليه وسلم مرتين في تحريم الجارية، وفي إخفائه لذلك، إذ فيه بعض مراقبة الخلق، والعارف لا يُراقب إلاّ الحق، فهذا قريب من قوله تعالى:\n\n[الأحزاب:37]، ففيه من التصوُّف: أنَّ العارف يكون الناس عنده كالموتى، أو كالهباء في الهواء، وفي الحديث عنه عليه الصلاة والسلام:\n\n \" لا يؤمن أحدكم حتى يكون الناس عنده كالأباعر \" \n\n \n\nإذا ليس بيدهم نفع ولا ضر\n وإشارة الآية على ما قال القشيري: وإذ أَسَرَّ القلبُ إلى بعض أزواجه، وهي النفس والهوى، حديث المخالفة، على طريق\n\n \" شاوروهنّ وخالِفوهنّ \" \n\nفلما نبأت النفسُ الهوَى لتفعلا ذلك، وأظهره الله عليه بوحي الإلهام، عَرَّف بعضَه وأعرض عن بعض، أي: عاتبهما على البعض، وسامحهما في الآخر، فلما نبأ القلبُ النفسَ بما أفشت للهوى، قالت: مَن أنبأك هذا\n\n الخ، إن تتوبا إلى الله، وتنقادا لحكمه فقد وقع منكما ما يوجب التوبة، وإن تظاهرا على القلب بتزيين المخالفة وتتبع الحظوظ والشهوات، فإنَّ الله هو مولاه، ينصره بالأجناد السماوية والأرضية، من التأييدات والواردات، عسى ربه إن طلقكن وغاب عنكن أن يُبدله أخلاقاً طيبة، ونفوساً مطمئنة، مسلماتٍ مؤمناتٍ قانتاتٍ تائباتٍ، عابداتٍ سائحاتٍ بأفكارها في ميادين الغيوب، وبحار التوحيد، ثيبات، أي: تأتي بعلوم الرسميات وأبكار الحقائق\n ثم أمر الحقُّ تعالى بإرشاد النساء وتأديبهن، فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ قُوۤاْ أَنفُسَكُمْ }\n\n",
      "translations": []
    }
  ]
}