{
  "chapter": "التحريم",
  "text": "يايها الذين ءامنوا۟ قوا۟ انفسكم واهليكم نارا وقودها الناس والحجارة عليها ملئكة غلاظ شداد لا يعصون الله ما امرهم ويفعلون ما يؤمرون",
  "translations": [
    {
      "translation": "You who have iman! safeguard yourselves and your families from a Fire whose fuel is people and stones. Harsh, terrible angels are in charge of it who do not disobey Allah in respect of any order He gives them and carry out what they are ordered to do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, save yourselves and your families from the Fire whose fuel is men and rocks, over which are appointed angels stern and severe as wardens who never disobey what God commands them, and do what they are commanded;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, guard yourselves and your kindred against a Fire whose fuel is human beings and stones, a Fire held in the charge of fierce and stern angels who never disobey what He has commanded them, and always do what they are bidden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, save yourselves and your families from the fire which is fueled by people and stones and is guarded by stern angels who do not disobey God's commands and do whatever they are ordered to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Save yourselves and your families from the fire, the fuel of which is men and stones – appointed over it are the extremely strict angels, who do not refuse the command of Allah and carry out whatever they are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Protect yourselves and your families against a Fire (Hell) whose fuel is men and stones, over which are (appointed) angels stern (and) severe, who disobey not the commands they receive from Allah, but do that which they are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! save yourselves and your families from a fire whose fuel is men and stones; over it are angels stern and strong, they do not disobey Allah in what He commands them, and do as they are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, guard yourselves and your families against a Fire whose fuel is men and stones, and over which are harsh, terrible angels who disobey not God in what He commands them and do what they are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Ward off from yourselves and your families a Fire whereof the fuel is men and stones, over which are set angels strong, severe, who resist not Allah in that which He commandeth them, but do that which they are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, safeguard yourselves and your families from a Fire fuelled by people and stones, and watched over by angels, stern and strong: angels who never disobey God's commands to them, but promptly do as they are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! protect yourselves and your households from a Fire the fuel whereof is mankind and stones, over which are angels, stern, strong; they disobey not Allah in that which He commandeth them, and do that which they are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Save yourselves and your families from a Fire whose fuel will be people and stones, over which are [assigned] severe and mighty angels, who do not disobey whatever Allah commands them and carry out what they are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! save yourselves and your families from a Fire whose fuel is Men and Stones, over which are (appointed) angels stern (and) severe, who flinch not (from executing) the Commands they receive from Allah, but do (precisely) what they are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Ward off from yourselves and your families a Fire (Hell) whose fuel is men and stones, over which are (appointed) angels stern (and) severe, who disobey not, (from executing) the Commands they receive from Allah, but do that which they are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, guard yourselves and your families against the Fire the fuel of which is people and stones, over which there are harsh, and stern angels who never disobey Allah in that which He orders and do what they are ordered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Protect yourselves and your families from a Fire, whose fuel is people and stones. Over it are angels, fierce and powerful. They never disobey God in anything He commands them, and they carry out whatever they are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, protect yourselves and your families from a Fire whose fuel is people and stones, over which are [appointed] angels, harsh and severe; they do not disobey Allah in what He commands them but do what they are commanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[66:6] O you who believe! Guard yourselves and your families, by enjoining obedience to God, against a Fire whose fuel is, disbelieving, people and stones, such as those idols of theirs made of that [stone] — the meaning is that it is extremely hot, fuelled by the above-mentioned, unlike the fire of this world which is fuelled by wood and the like — over which stand angels, its keepers — numbering nineteen as will be stated in [sūrat] al-Muddaththir [Q. 74:30] — stern, a sternness of the heart, mighty, in [their power of] assault, who do not disobey God in what He commands them (mā amarahum is a substitution for His Majesty [‘God’]), in other words, they do not disobey the command of God, but do what they are commanded — this is [reiterated] for emphasis; the verse is meant as a threat to deter believers from apostatising and for hypocrites who believe only with their tongues and not with their hearts.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye who believe) in Muhammad (pbuh) and the Qur'an! (Ward off from yourselves) and your folks (and your families) and wives and children (a Fire) He says: teach them good manners and make them learn goodness, and by doing so you will save them from the Fire (whereof the fuel is men and stones) of sulphur which is the hottest of stones, (over which) over the Fire (are set angels) i.e. the angels in charge of the Fire (strong) huge, (severe) very strong, (who resist not Allah in that which He commandeth them) regarding the chastisement of the dwellers of the Fire, (but do) i.e. the angels in charge of the Fire (that which they are commanded.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قُوۤاْ أَنفُسَكُمْ [وَأَهْلِيكُمْ] } معناه امنعُوها أَنفسكم\n وعلموا أَهاليكُم وأَولادُكُم وادبُوهم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Qawwamoo anfusakum [wa-ahliykum]} [Surat Al-'Asr], means \"Take care of yourselves and your families.\"\n\nAnd teach your {ahlaaki} and your children [the] {adab}\n\n\"And teach your family and your children good manners.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ أوصى سبحانه لعموم المؤمنين ما يصلح لهم\n ويليق بحالهم فقال: { يٰأَيُّهَا ٱلَّذِينَ آمَنُواْ } عليكم حفظ النفس عن مطلق المهالك الدينية { قُوۤاْ أَنفُسَكُمْ } عن ارتكاب المعاصي\n والالتفات نحو المنكرات\n والتوجه نحو المحظورات { وَأَهْلِيكُمْ } إي: من في حفظكم وحضانتكم من أزواجكم وأولادكم عن الوقوع في المهالك والفتن\n وأنواع الآثام الموجبة للخذلان والحرمان\n وبالجملة: اتقوا { نَاراً } وأيّ نار\n ناراً { وَقُودُهَا ٱلنَّاسُ وَٱلْحِجَارَةُ } أي: ما يتقد به النار أجسام الأنام والحجارة\n وذلك من شدة حرارتها وإحراقها\n بخلاف سائر النيران فإن وقودها الحطب\n\n\nومع ذلك يوكل { عَلَيْهَا مَلاَئِكَةٌ } يوقدونها\n وهم الزبانية\n صفتهم: إنهم { غِلاَظٌ } في أقوالهم وهياكلهم\n لا يتأتى منهم الملاينة والملاطفة أصلاً { شِدَادٌ } في البطش وعموم التعذيب { لاَّ يَعْصُونَ ٱللَّهَ } ولا يتجاوزون عن أمره سبحانه في عموم أوامره\n بل يمضونها على الوجه المأمور بلا فوت شيء منها بعذر وشفاعة\n أو شفقة أو مروءة\n بل يفعلون { مَآ أَمَرَهُمْ وَيَفْعَلُونَ مَا يُؤْمَرُونَ } [التحريم: 6] على وجهه خوفاً من غيرته سبحانه وغضبه\n\n\nوبعدما نادى سبحانه عموم المؤمنين بما نادى\n نادى أيضاً عموم الكافرين على مقتضى المقابلة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها الذين آمنوا قُو أنفسَكم } أي: نَجُّوها من النار\n بترك المعاصي وفعل الطاعات\n { وأهليكم } بأن تأخذوهم بما تأخذون به أنفسكم\n أو بان تُعلِّموهم وتُرشدوهم\n قال القشيري: أظهٍروا من أنفسكم الطاعات ليتعلموا منكم ويقتادوا بأفعالكم\n هـ\n وفي الحديث:\n \" رحِم الله امرءاً قال: يا أهلاه\n صلاتَكم صيامَكم مسْكينَكم\n يتيمَكم \" \nأي: الزموا ما ينفعكم\n فمَن له أهل وأهملهم من التعلُّم والإرشاد عُوتب عليهم\n أي: احملوهم على الطاعة\n لتَقُوهُمْ { ناراً وقُودُهَا الناسُ والحجارةُ } أي: نوعاً من النار لا تتّقد إلاّ بالناس والحجارة\n كما تتّقد غيرها بالحطب\n قال ابن عباس: هي حجارة الكبريت\n فهي أشد الأشياء حرًّا\n { عليها ملائكةٌ } تلي أمرها والتعذيبَ بها\n وهي الزبانية\n { غِلاظٌ شِدادٌ } غلاظُ الأقوال\n شِدادُ الأحوال\n أو: غلاظُ الخلْق\n شِداد الخُلُق\n أقوياءُ على الأفعال الشديدة\n لم يخلق اللهُ فيهم رحمة\n { لا يَعْصُون اللهَ ما أَمَرَهم } أي: لا يعصون أمره\n فهو بدل اشتمال من \" الله \" أو: فيما أمرهم\n على نزع الخافض { ويفعلون ما يؤمرون } من غير تراخ ولاتثاقل\n وليست الجملتان في معنى واحد إذ معنى الأولى: أنهم يمتثلون أمره ويلتزمونها\n ومعنى الثانية: أنهم يُؤدون ما يُؤمرون به\n ولا يتثاقلون عنه ولا يتوَانون فيه\n ويُقال للكفرة يوم القيامة عند دخولهم النار: { يا أيها الذين كفروا لا تعتذروا اليومَ } إذ لا ينفعكم عذركم حيث فرَّطتم في الدنيا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:24",
      "similarity": 0.6456099789980646
    },
    {
      "verse": "104:6",
      "similarity": 0.4651685154625315
    },
    {
      "verse": "85:5",
      "similarity": 0.45580496545901716
    },
    {
      "verse": "3:10",
      "similarity": 0.41495144780346915
    },
    {
      "verse": "9:123",
      "similarity": 0.4062859727871732
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/66:6.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/66:6.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/66:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}