{
  "chapter": "التحريم",
  "text": "يايها الذين ءامنوا۟ توبوا۟ الى الله توبة نصوحا عسى ربكم ان يكفر عنكم سيـاتكم ويدخلكم جنت تجرى من تحتها الانهر يوم لا يخزى الله النبى والذين ءامنوا۟ معه نورهم يسعى بين ايديهم وبايمنهم يقولون ربنا اتمم لنا نورنا واغفر لنا انك على كل شىء قدير",
  "translations": [
    {
      "translation": "You who have iman! repent sincerely to Allah. It may be that your Lord will erase your bad actions from you and admit you into Gardens with rivers flowing under them on the Day when Allah will not disgrace the ProDhet and those who had iman alona with him. Their liaht will stream out ahead of them and on their riaht. They will say, 'Our Lord, perfect our light for us and forgive us! You have power over all things.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe, turn to God truly in repentance. Perhaps your Lord may forgive your ills and admit you to gardens with rivers flowing by on the day when God will not humiliate the Prophet and those who believe with him. Their light will move in front of them and to their right, and they will say: \"O Lord, perfect our light and forgive us. You have power over every thing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, turn to Allah in sincere repentance; maybe your Lord will expunge your evil deeds and admit you to the Gardens beneath which rivers flow. This will be on the Day when Allah will not disgrace the Prophet and those who have embraced faith and are with him; their light will be running before them and on their right hands, and they will say: “Our Lord, perfect for us our light and forgive us. Surely You have power over everything.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, turn to God in repentance with the intention of never repeating the same sin. Perhaps your Lord will expiate your evil deeds and admit you to Paradise wherein streams flow. On the Day of Judgment, God will not disgrace the Prophet and those who have believed in him. Their lights will shine in front of them and to their right. They will say, \"Our Lord, perfect our light for us and forgive our sins. You have power over all things\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O People who Believe! Incline towards Allah in a repentance that becomes a guidance for the future; it is likely that your Lord will relieve you of your sins and admit you into Gardens beneath which rivers flow – on the day when Allah will not humble the Prophet and the believers along with him; their light will be running ahead of them and on their right; they will say, “Our Lord! Perfect our light for us, and forgive us; indeed You are Able to do all things.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Turn to Allah with sincere repentance! It may be that your Lord will expiate from you your sins, and admit you into Gardens under which rivers flow -- the Day that Allah will not disgrace the Prophet and those who believe with him. Their light will run forward before them and in their right hands. They will say: \"Our Lord! Keep perfect our light for us and grant us forgiveness. Verily, You are Able to do all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! turn to Allah a sincere turning; maybe your Lord will remove from you your evil and cause you to enter gardens beneath which rivers flow, on the day on which Allah will not abase the Prophet and those who believe with him; their light shall run on before them and on their right hands; they shall say: Our Lord! make perfect for us our light, and grant us protection, surely Thou hast power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, turn to God in sincere repentance; it may be that your Lord will acquit you of your evil deeds, and will admit you into gardens underneath which rivers flow. Upon the day when God will not degrade the Prophet and those who believe with him, their light running before them, and on their right hands; and they say, 'Our 'Lord, perfect for us our light, and forgive us; surely Thou art powerful over everything.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Turn unto Allah in sincere repentance! It may be that your Lord will remit from you your evil deeds and bring you into Gardens underneath which rivers flow, on the day when Allah will not abase the Prophet and those who believe with him. Their light will run before them and on their right hands; they will say: Our Lord! Perfect our light for us, and forgive us! Lo! Thou art Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, turn to God in sincere repentance. Your Lord may well forgive your bad deeds and admit you into gardens watered by running streams, on a Day when God will not abase the Prophet and those who have believed with him. Their light will shine out ahead of them and on their right, and they will say: \"Lord perfect our light for us, and forgive us; You have power over all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! turn Unto Allah with a sincere repentance. Belike your Lord will expiate from you your misdeeds and cause you to enter Gardens whereunder rivers flow, on the Day whereon Allah will not humiliate the prophet and those who believe with him. Their light will be running before them and on their right hands, and they will say: our Lord! perfect for us our light, and forgive us; verily Thou art over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have faith! Repent to Allah with sincere repentance! Maybe your Lord will absolve you of your misdeeds and admit you into gardens with streams running in them, on the day when Allah will not let down the Prophet and the faithful who are with him. Their light will move swiftly before them and on their right. They will say, ‘Our Lord! Perfect our light for us, and forgive us! Indeed You have power over all things.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye who believe! Turn to Allah with sincere repentance: In the hope that your Lord will remove from you your ills and admit you to Gardens beneath which Rivers flow,- the Day that Allah will not permit to be humiliated the Prophet and those who believe with him. Their Light will run forward before them and by their right hands, while they say, \"Our Lord! Perfect our Light for us, and grant us Forgiveness: for Thou hast power over all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Turn to Allah with sincere repentance! It may be that your Lord will remit from you your sins, and admit you into Gardens under which rivers flow (Paradise) the Day that Allah will not disgrace the Prophet (Muhammad SAW) and those who believe with him, their Light will run forward before them and with (their Records Books of deeds) in their right hands they will say: \"Our Lord! Keep perfect our Light for us [and do not put it off till we cross over the Sirat (a slippery bridge over the Hell) safely] and grant us forgiveness. Verily, You are Able to do all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, turn to Allah in sincere repentance. Your Lord may acquit you of your sins, and admit you to Gardens underneath which rivers flow on a Day whenAllah will not degrade the Prophet and those who believe with him. Their light will run before them and on their right hands, and they will say: 'Our Lord, completeour light for us and forgive us. Surely, You have power over all things'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who believe! Repent to God with sincere repentance. Perhaps your Lord will remit your sins, and admit you into gardens beneath which rivers flow, on the Day when God will not disappoint the Prophet and those who believed with him. Their light streaming before them, and to their right, they will say, “Our Lord, complete our light for us, and forgive us; You are capable of all things.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you who have believed, repent to Allah with sincere repentance. Perhaps your Lord will remove from you your misdeeds and admit you into gardens beneath which rivers flow [on] the Day when Allah will not disgrace the Prophet and those who believed with him. Their light will proceed before them and on their right; they will say, \"Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[66:8] O you who believe! Repent to God with sincere repentance (read nasūhan or nusūhan), a truthful [repentance], so that one does not return to [committing] that sin again, nor have the desire to return to it. It may be that your Lord (‘asā: [an expression denoting] ‘a hope’ that will be realised) will absolve you of your misdeeds and admit you into gardens, orchards, underneath which rivers flow, on the day when God will not let down, by admitting into the Fire, the Prophet and those who believe with him. Their light will be running before them, in front of them, and, it will be, on their right. They will say (yaqūlūna: this denotes the beginning of a new [syntactically independent] sentence), ‘Our Lord! Perfect our light for us, towards Paradise — whereas the hypocrites, their light will be extinguished — and forgive us, Our Lord. Assuredly You have power over all things’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَا أَيُّهَا الَّذِينَ آَمَنُوا تُوبُوا إِلَى اللَّهِ تَوْبَةً نَصُوحًا عَسَى رَبُّكُمْ أَنْ يُكَفِّرَ عَنْكُمْ سَيِّئَاتِكُمْ وَيُدْخِلَكُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ يَوْمَ لَا يُخْزِي اللَّهُ النَّبِيَّ وَالَّذِينَ آَمَنُوا مَعَهُ نُورُهُمْ يَسْعَى بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ يَقُولُونَ رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (8){ ياأيها الذين ءَامَنُواْ توبوا إِلَى الله تَوْبَةً نَّصُوحاً عسى رَبُّكُمْ أَن يُكَفِّرَ عَنكُمْ سيئاتكم وَيُدْخِلَكُمْ جنات تَجْرِى مِن تَحْتِهَا الانهار } .أعيد خطاب المؤمنين وأعيد نداؤهم وهو نداء ثالث في هذه السورة . والذي قبله نداء للواعظين . وهذا نداء للموعوظين وهذا الأسلوب من أساليب الإِعراض المهتم بها .أُمر المؤمنون بالتوبة من الذنوب إذا تلبسوا بها لأن ذلك من إصلاح أنفسهم بعد أن أمروا بأن يجنِّبوا أنفسهم وأهليهم ما يَزِجّ بهم في عذاب النار ، لأن اتقاء النار يتحقق باجتناب ما يرمي بهم فيها ، وقد يذهلون عما فرط من سيئاتهم فهُدُوا إلى سبيل التوبة التي يمحون بها ما فرط من سيئاتهم .وهذا ناظر إلى ما ذكر من موعظة امرأتي النبي صلى الله عليه وسلم بقوله : { إن تتوبا إلى الله } \\[ التحريم : 4 \\] .والتوبة : العزم على عدم العود إلى العصيان مع الندم على ما فرط منه فيما مضى . وتقدمت عند قوله تعالى : { فتلقى آدم من ربه كلمات فتاب عليه } في سورة \\[ البقرة : 37 \\] . وفي مواضع أخرى وخاصة عند قوله تعالى : { إنما التوبة على الله للذين يعملون السوء بجهالة } في سورة \\[ النساء : 17 \\] . وتعديتها بحرف ( إلى ) لأنها في معنى الرجوع لأن ( تاب ) أخو ( ثاب ) .والنصوح : ذُو النصح .والنصح : الإِخلاص في العمل والقول ، أي الصدق في إرادة النفع بذلك . ووصف التوبة بالنصوح مجاز جعلت التوبة التي لا تردد فيها ولا تخالطها نية العودة إلى العمل المتوب منه بمنزلة الناصح لغيره ففي ( نصوح ) استعارة وليس من المجاز العقلي إذ ليس المراد نصوحاً صاحبها .وإنما لم تلحق وصف ( نصوح ) هاء التأنيث المناسبة لتأنيث الموصوف به لأن فعولاً بمعنى فاعل يلازم الإِفراد والتذكير .وقرأ الجمهور نصوحاً } بفتح النون على معنى الوصف كما علمت . وقرأه أبو بكر عن عاصم بضم النون على أنه مصدر ( نصح ) مثل : القُعود من قعد . وزعم الأخفش أن الضم غير معروف والقراءة حجة عليه .ومن شروط التوبة تدارك ما يمكن تداركه مما وقع التفريط فيه مثل المظالم للقادر على ردّها . روي عن علي رضي الله عنه : يجمع التوبة ستة أشياء : الندامة على الماضي من الذنوب ، وإعادة الفرائض . ورد المظالم ، واستحلال الخصوم ، وأن تذيب نفسك في طاعة الله كما ربيتها في المعصية ، وأن تذيقها مرارة الطاعات كما أذقتها حلاوة المعاصي .وتقوم مقام ردّ المظالم استحلال المظلوم حتى يعفو عنه .ومن تمام التوبة تمكين التائب من نفسه أن ينفذ عليها الحدود كالقود والضرب . قال إمام الحرمين : هذا التمكين واجب خارج عن حقيقة التوبة لأن التائب إذا ندم ونوى أن لا يعود صحت توبته عند الله وكان منَعه من تمكين نفسه معصية متجددة تستدعي توبة .وهو كلام وجيه إذ التمكين من تنفيذ ذلك يشق على النفوس مشقة عظيمة فلها عذر في الإِحجام عن التمكين منه .وتصح التوبة من ذنب دون ذنب خلافاً لأبي هاشم الجبائي المعتزلي ، وذلك فيما عدا التوبة من الكفر .وأما التوبة من الكفر بالإِيمان فصحيحة في غفران إثم الكفر ولو بقي متلبساً ببعض الكبائر بإجماع علماء الإِسلام .والذنوب التي تجب منها التوبة هي الكبائر ابتداء ، وكذلك الصغائر وتمييز الكبائر من الصغائر مسألة أخرى محلها أصول الدين وأصول الفقه والفقهُ .إلا أن الله تفضّل على المسلمين فغفر الصغائر لمن اجتنب الكبائر ، أخذ ذلك من قوله تعالى : { الذين يجتنبون كبائر الإِثم والفواحش إلا اللمم وقد مضى القول فيه } في تفسير سورة \\[ النجم : 32 \\] .ولو عاد التائب إلى بعض الذنوب أو جميعها ما عدا الكفر اختلف فيه علماء الأمة فالذي ذهب إليه أهل السنة أن التوبة تنتقض بالعودة إلى بعض الذنوب في خصوص الذنب المعود إليه ولا تنتقض فيما سواه . وأن العود معصية تجب التوبة منها . وقال المعتزلة : تنتقض بالعودة إلى بعض الذنوب فتعود إليه ذنوبه ووافقهم الباقلاني .وليس في أدلة الكتاب والسنة ما يشهد لأحد الفريقين .والرجاء المستفاد من فعل عسى } مستعمل في الوعد الصادر عن المتفضل على طريقة الاستعارة وذلك التائب لا حق له في أن يعفى عنه ما اقترفه لأن العصيان قد حصل وإنما التوبة عزم على عدم العودة إلى الذنب ولكن ما لصاحبها من الندم والخوف الذي بعث على العزم دل على زكاء النفس فجعل الله جزاءه أن يمحو عنه ما سلف من الذنوب تفضلاً من الله فذلك معنى الرجاء المستفاد من { عسى } .وقد أجمع علماء الإِسلام على أن التوبة من الكفر بالإِيمان مقبولة قطعاً لكثرة أدلة الكتاب والسنة ، واختلفوا في تعيُّن قبول توبة العاصي من المؤمنين ، فقال جمهور أهل السنة : قبولها مرجوّ غير مقطوع ، وممن قال به الباقلاني وإمام الحرمين وعن الأشعري أنه مقطوع به سمعاً ، والمعتزلة مقطوع به عقلاً .وتكفير السيئات : غفرانها ، وهو مبالغة في كَفَر المخفف المتعدي الذي هو مشتق من الكَفر بفتح الكاف ، أي الستر .{ الانهار يَوْمَ لاَ يُخْزِى الله النبى والذين ءَامَنُواْ مَعَهُ نُورُهُمْ يسعى بَيْنَ أَيْدِيهِمْ وبأيمانهم يَقُولُونَ رَبَّنَآ أَتْمِمْ لَنَا نُورَنَا واغفر لَنَآ إِنَّكَ على كُلِّ شَىْءٍ } .{ يوم } ظرف متعلق ب { يدخلكم جنات } وهو تعليقُ تخلص إلى الثناء على الرسول صلى الله عليه وسلم والمؤمنين معه . وهو يوم القيامة وهذا الثناء عليهم بانتفاء خزي الله عنهم تعريض بأن الذين لم يؤمنوا معه يخزيهم الله يوم القيامة وذكر النبي صلى الله عليه وسلم مع الذين آمنوا لتشريف المؤمنين ولا علاقة له بالتعريض .والخزي : هو عذاب النار ، وحكى الله تعالى عن إبراهيم عليه السلام قوله : { ولا تخزني يوم يبعثون } \\[ الشعراء : 87 \\] على أن انتفاء الخزي يومئذٍ يستلزم الكرامة إذ لا واسطة بينهما كما أشعر به قوله تعالى :{ فمن زحزح عن النار وأدخل الجنة فقد فاز } \\[ آل عمران : 185 \\] .وفي صلة { الذين آمنوا معه } إيذان بأن سبب انتفاء الخزي عنهم هو إيمانهم .ومعية المؤمنين مع النبي صلى الله عليه وسلم صحبتهم النبي صلى الله عليه وسلمو ( مع ) يجوز تعلقها بمحذوف حال من { الذين آمنوا } أي حال كونهم مع الشيء في انتفاء خزي الله عنهم فيكون عموم { الذين آمنوا } مخصوصاً بغير الذين يتحقق فيهم خزي الكفر وهم الذين ارتدوا وماتوا على الكفر .وفي هذه الآية دليل على المغفرة لجميع أصحاب النبي صلى الله عليه وسلمويجوز تعلق ( مع ) بفعل { آمنوا } أي الذين آمنوا به وصحبوه ، فيكون مراداً به أصحاب النبي صلى الله عليه وسلم الذين آمنوا به ولم يرتدوا بعده ، فتكون الآية مؤذنة بفضيلة للصحابة .وضمير { نورهم } عائد إلى النبي صلى الله عليه وسلم والذين آمنوا معه .وإضافة نور إلى ضمير هم مع أنه لم يسبق إخبار عنهم بنور لهم ليست إضافة تعريف إذ ليس المقصود تعريف النور وتعيينه ولكن الإِضافة مستعملة هنا في لازم معناها وهو اختصاص النور بهم في ذلك اليوم بحيث يميزه الناس من بين الأنوار يومئذٍ .وسعي النور : امتداده وانتشاره . شبه ذلك باشتداد مشي الماشي وذلك أنه يحفّ بهم حيثما انتقلوا تنويهاً بشأنهم كما تنشر الأعلام بين يدي الأمير والقائد وكما تساق الجياد بين يدي الخليفة .وإنما خص بالذكر من الجهات الأمامُ واليمين لأن النور إذا كان بين أيديهم تمتعوا بمشاهدته وشعروا بأنه كرامة لهم ولأن الأيدي هي التي تمسك بها الأمور النفيسة وبها بايعوا النبي صلى الله عليه وسلم على الإِيمان والنصر . وهذا النور نور حقيقي يجعله الله للمؤمنين يوم القيامة . والباء للملابسة ، ويجوز أن تكون بمعنى ( عن ) .وقد تقدم نظير هذا في سورة الحديد وما ذكرناه هنا أوسع .وجملة { يقولون ربنا أتمم لنا نورنا } إلى آخرها حال من ضمير { نورهم } ، وظاهره أن تكون حالاً مقارنة ، أي يقولون ذلك في ذلك اليوم ، ودعاؤهم طلب للزيادة من ذلك النور ، فيكون ضمير { يقولون } عائد إلى جميع الذين آمنوا مع النبي صلى الله عليه وسلم يومئذٍ ، أو يقول ذلك من كان نوره أقل من نور غيره ممن هو أفضل منه يومئذٍ فيكون ضمير { يقولون } على إرادة التوزيع على طوائف الذين آمنوا في ذلك اليوم .وإتمام النور إدامته أو الزيادة منه على الوجهين المذكورين آنفاً وكذلك الدعاء بطلب المغفرة لهم هو لطلب دوام المغفرة ، وذلك كله أدب مع الله وتواضع له مثل ما قيل في استغفار النبي صلى الله عليه وسلم في اليوم سبعين مرة .ويظهر بذلك وجه التذييل بقولهم : { إنك على كل شيء قدير } المشعر بتعليل الدعاء كناية عن رجاء إجابته لهم .\n\n",
      "translations": [
        {
          "translation": "(0 ye who believe) in Muhammad (pbuh) and the Qur'an! (Turn unto Allah in sincere repentance!) repent of your sins truly and sincerely from the bottom of your hearts. This means feeling regret in one's heart, asking forgiveness with one's tongue and stop engaging in the particular sin one is repenting of with one's body and conscience, intending never to return to it (It may be) \"may be\" from Allah denotes a necessity (that your Lord will remit from you your evil deeds) forgive your sins through repentance (and bring you) in the Hereafter (into Gardens beneath which) beneath their trees and habitations (rivers flow) rivers of wine, water, honey and milk flow, (on the day) which is the Day of Judgement (when Allah will not abase the Prophet) as He abases the disbelievers; He says: He will not torment the Prophet (pbuh) (and those who believe with him) and will not torment those who believe in him, such as Abu Bakr and his believing brothers. (Their light will run) will shine (before them) on the Bridge over the Fire (and on their right hands: they will say) when the light of the hypocrites is put out: (Our Lord! Perfect our light for us) on the Bridge over hell, (and forgive us) our sins! (Lo! Thou art Able to do all things) of completing our light and forgiving us.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تُوبُوۤاْ إِلَى ٱللَّهِ تَوْبَةً نَّصُوحاً } معناه أَن يَتوبَ من الذَنبِ ثُمَّ لا يعود إليهِ\n\n",
      "translations": [
        {
          "translation": " And his saying, {Turn to Allah a sincere repentance} its meaning is that he repents from the sin then does not return to it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ يا أيها الذين آمنوا تُوبوا إلى الله } بالرجوع إليه في كل حال من أحوالكم فإن مراتب التوبة كمراتب التقوى فكما أن أول مراتب التقوى هو الاجتناب عن المنهيات الشرعية وآخرها الاتقاء عن الأنائية والبقية فكذلك التوبة أولها الرجوع عن المعاصي وآخراه الرجوع عن ذنب الوجود الذي هو من أمّهات الكبائر عند أهل التحقيق { توبة نَصُوحاً } أي: توبة ترقع الخروق وترتق الفتوق وتصلح الفاسد وتسدّ الخلل\n فإن خلل كل مقام وفساده ونقصانه لا ينسدّ ولا ينصلح ولا ينجبر إلا عند التوبة عنه بالترقي إلى ما هو فوقه فإذا تاب عنه بالترقي وبرز عن حجاب رؤية ذلك المقام انجبر نقصه وتمّ\n وهو من النصح بمعنى الخياطة أو توبة خالصة عن شوب الميل إلى المقام الذي تاب عنه والنظر إليه بعدم الالتفات وقطع النظر عنه من النصوح بمعنى الخلوص { عسى ربكم أن يكفِّر عنكم سيئاتكم } من ذنوب المقام الذي تبتم إليه عنه وحجبه وآفاته والنظر إليه أو الاعتداد به والميل إليه ورؤيته أو التلوين الذي يحدث بعد الترقي عنه كالتلوين بظهور النفس في مقام القلب وبظهور القلب في مقام الروح وبظهور الأنائية في مقام الوحدة { ويُدْخلكم جنّات } مترتبة على مراتب التوبة { يوم لا يخزي الله النبيّ والذين آمنوا معه } بظهور الحجاب في مقام القرب { نورهم يسعى بين أيديهم } أي: الذي لهم بحسب النظر والكمال العلمي { وبأيمانهم } أي: الذي لهم بحسب العمل وكماله إذ النور العلمي من منبع الوحدة والعملي من جانب القلب الذي هو يمين النفس أو نور السابقين منهم يسعى بين أيديهم ونور الأبرار منهم يسعى بأيمانهم { يقولون ربّنا أتمم لنا نورنا } أي: يعوذون به ويلوذون إلى جنابه من ظهور البقية\n فإنها ظلمة في شهودهم فيطلبون إدامة النور بالفناء المحض\n أو: أدم علينا هذا الكمال بوجودك ودوام إشراق سبحات وجهك\n يقولون ذلك عن فرط الاشتياق مع الشهود كقوله:\nأو يقول بعضهم\n وهم الذين لم يصلوا إلى الشهود الذاتي { واغفر لنا } ظهور البقايا بعد الفناء أو وجود الإثبات قبله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولا يتيسر لكم هذا إلاَّ بالتوبة والرجوع على وجه الندم والإخلاص { تُوبُوۤاْ } أيها المخلصون المبتلون بقتنة الذنوب { إِلَى ٱللَّهِ } الملك القدوس\n المنزه ساحة عز حضوره عن سمة الحدوث والإمكان مطلقاً { تَوْبَةً نَّصُوحاً } خالصة لوجه الله\n قالعة لعرض الالتفات إلى غير الله\n نادمة على الذنوب الصادرة عنكم فيما مضى\n مجتنبة عن التي سيأتي\n مصفية للنفس عن مطلق الكدورات المتعلقة بالغير\n محلية لها بالتقوى عن مطلق الرذائل العائقة عن التوجه الخالص نحو المولى\n\n\n{ عَسَىٰ رَبُّكُمْ } بعدما تبتم ورجعتم نحوه بكمال التبتل والإخلاص { أَن يُكَفِّرَ عَنكُمْ سَيِّئَاتِكُمْ } ويعفو عنكم\n ولم ينتقم منكم { وَيُدْخِلَكُمْ } تفضلاً عليكم\n وإحساناً { جَنَّاتٍ } منتزهات العلم والدين والحق { تَجْرِي مِن تَحْتِهَا ٱلأَنْهَارُ } أنهار المعارف والحقائق المتجددة\n الجارية من أزل اللذات إلى أبد الأسماء والصفات\n\n\nوكيف لا يكفِّر\n ولا يدخل سبحانه خلَّص عباده في جنة وحدته { يَوْمَ لاَ يُخْزِى } ولا يُرى { ٱللَّهُ } المنعم المفضل على خلَّص عباده\n سيما { ٱلنَّبِيَّ } المؤيَّد من عنده بأنواع الكرامة والتعظيم { وَٱلَّذِينَ آمَنُواْ مَعَهُ } واهتدوا بهدايته\n مع أن شأنهم هكذا { نُورُهُمْ } الذي اقتبسوه من مشكاة النبوة المصطفوية { يَسْعَىٰ بَيْنَ أَيْدِيهِمْ وَبِأَيْمَانِهِمْ } أي: محيطاً بهم\n محفوفاً عليهم وقت عبورهم من الصراط؟!\n\nثمَّ لمَّا تفاوتت أنوارهم بحسب الجلاء والخفاء المترتب على أعمالهم واستعداداتهم الفطرية { يَقُولُونَ } مناجين: { رَبَّنَآ } يا من ربَّانا على الهداية والرشاد { أَتْمِمْ لَنَا نُورَنَا } تفضلاً علينا\n ومزيد إحسان بنا { وَٱغْفِرْ لَنَآ } ذنوبنا\n أي: استر أنانيتنا عن عيوب بصائرنا { إِنَّكَ } بمقتضى جودك { عَلَىٰ كُلِّ شَيْءٍ } يدخل في حيطة علمك وإرادتك { قَدِيرٌ } [التحريم: 8]\n\nثمَّ قال سبحانه: { يٰأَيُّهَا ٱلنَّبِيُّ } المبعوث",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { يا أيها الذين آمنوا تُوبوا إِلى الله توبةً نَصوحاً } أي: بالغة في النصح، وُصفت بذلك مجازاً، وهي وصف للتائبين، وهو أن ينصحوا بالتوبة أنفسَهم، فيأتوا بها على طريقتها، وذلك أن يتوبوا عن القبائح، لقبْحها، نادمين عليها، مغتمِّين أشد الاغتمام لارتكابها، عازمين على أنهم لا يعودون إلى قبيح من القبائح، وقيل: نصوحاً: صادقة، وقيل: خالصة، يُقال: عسل ناصح: إذا خلص من شمعه، وقيل: مِن نصاحة الثوب، أي: ترقيعه، لأنها ترقع خروقك في دينك وترمّ خللك، وقيل: توبة تنصح الناس، أي: تدعوهم إلى مثلها لظهور آثارها في صاحبها، باستعمال الجد والعزيمة في العمل على مقتضياتها، ومَن قرأ بضم النون فمصدر، أي: ذات نصوح، أو تنصح نصوحاً. وفي الحديث:\n \" التوبة النصوح أن يتوب، ثم لا يعود إلى الذنب إلى أن يعود اللبن في الضرع \" \nوعن حذيفة:\n \" بحسب الرجل من الشر أن يتوب من الذنب ثم يعود فيه \" \nوعن ابن عباس رضي الله عنه:\n \" هي الاستغفار باللسان، والندم بالجنان، والإقلاع بالأركان \". \n{ عسى ربُّكم أن يُكَفِّرَ عنكم سيئاتِكم } ، هذا على ما جرى به عادة الملوك من الإجابة بعسى ولعل، ووقوع ذلك منهم موقع القطع والبت. وقيل: عبّر بـ \" عسى \" للإشعار أنّ المغفرة تفضل وإحسان، وأنّ التوبة غير موجبة لها، ولِيَبقى العبد بين خوف ورجاء ولو عمل ما عمل. { ويُدْخِلَكم جناتٍ تجري من تحتها الأنهارُ يومَ لا يُخزي اللهُ النبيَّ }. هو ظرف لـ \" يدخلكم \" { والذين آمنوا معه }: عطف على \" النبي \"  و \" معه \": ظرف لآمنوا، وفيه تعريض بمَن أخزاهم الله من الكفرة. { نُورُهُمْ }: مبتدأ، و { يسعى } خبره، أي: يُضيء { بين أيديهم وبأَيمانهم } أي: على الصراط وفي مواطن القيامة، { يقولون } حال، أي: قائلين حين ينطفىء نور المنافقين: { ربنا أتمم لنا نورنا واغفرْ لنا إِنك على كل شيءٍ قديرٌ } ، وقيل: يدعون بذلك تقرُّباً إلى الله مع تمام نورهم، وقيل: تتفاوت أنوارهم بحسب أعمالهم، فيسألون إتمامه تفضُّلاً، وقيل: السابقون إلى الجنة يمرون مثل البرق على الصراط وبعضهم كالريح وبعضهم كأجاود الخيل، وبعضهم حبواً، وزحفاً، وهم الذين يقولون: { ربنا أَتمم لنا نورنا }. وقد تقدّم: أنَّ مِن المقربين مَن تُقرّب لهم غُرف الجنات فيركبون فيها، ويسرحون إلى الجنة، ومنهم مَن يطير في الهواء إلى باب الجنة، فيقول الخزنة: مَن أنتم؟ فيقولون: نحن المتحابُّون في الله، فيقول: اذهبوا فنِعْمَ أجر العاملين، ويقول بعضهم لبعض: أين الصراط الذي وُعدنه، فيُقال لهم: جزتموه ولم تشعروا. والله تعالى أعلم. الإشارة: توبةُ العامة من الذنوب، وتوبةُ الخاصة من العيوب، وتوبة خاصة الخاصة من الغيبة عن حضرة علاّم الغيوب، فهؤلاء أشد الناس افتقاراً إلى التوبة إذ لا بُد للعبد من سهوٍ وسِنةٍ حتى يجول بقلبه في الأكوان، أو يميل عن الاعتدال، فيجب في حقهم الاستغفار منها، ولذلك كان عليه الصلاة والسلام يستغفر في المجلس الواحد سبعين أو مائة مرة.\nوقد تكلم السّلفُ عن التوبة النصوح دون ما تقدّم، فقال ابن جبير: هي التوبة المقبولة، ولا تُقبل إلا بثلاثة شروط: خوف ألاَّ تُقبل منه، ورجاء أن تُقبل، وإدمان الطاعة. وقال ابن المسيب: توبة تنصحون بها أنفسكم، وقال القرظي: يجمعها أربعة: الاستغفار باللسان، والإقلاع بالأبدان، وترك العود بالجنان، ومهاجرة سيىء الخلان. وقال الثوري: علامتها أربعة: القِلة، والعِلة، والذلة، والغربة. وقال الفضيل: هو أن يكون الذنب نصب عينيه. وقال الواسطي: تكون لا لعرض دنيوي ولا أخروي. وقال أبو بكر الورّاق: هي أن تضيق عليك الدنيا بما رَحُبتْ، كحالة الذين خُلِّفوا. وقال رُويم: أن تكون لله وجهاً بلا قفا، كما كنت عند المعصية قفا بلا وجه، وقالت رابعة: توبة لا ارتياب فيها، وقال السري: لا تصلح التوبة النصوح إلاّ بنصيحة النفس والمؤمنين لأنَّ مَن صحّت توبته أَحبَّ أن يكون الناس مثله، وقال الجنيد: هي أن تنسى الذنب فلا تذكره أبداً لأنَّ مَن أحب اللهَ نسي ما دونه. هـ. ثم أمر بالجهاد بعد التوبة لأنَّ النصر لا يكون إلاَّ مع التطهُّر من دنس الخالفة، فقال: { يٰأَيُّهَا ٱلنَّبِيُّ جَاهِدِ ٱلْكُفَّارَ وَٱلْمُنَافِقِينَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "57:12",
      "similarity": 0.4029606357538958
    },
    {
      "verse": "7:68",
      "similarity": 0.35234326601999394
    },
    {
      "verse": "7:62",
      "similarity": 0.35205950919845475
    },
    {
      "verse": "7:79",
      "similarity": 0.3501939374613526
    },
    {
      "verse": "12:11",
      "similarity": 0.3452481963997418
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/066008.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/066008.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/66:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}