{
  "chapter": "التحريم",
  "text": "يايها النبى جهد الكفار والمنفقين واغلظ عليهم وماوىهم جهنم وبئس المصير",
  "translations": [
    {
      "translation": "O Prophet! do jihad against the kafirun and hypocrites and be harsh with them. Their refuge is Hell. What an evil destination!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, fight the unbelievers and the hypocrites, and be severe with them. Their abode is Hell, an evil destination?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, strive against the unbelievers and the hypocrites, and be severe with them. Hell shall be their resort. What a grievous end!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prophet, fight against the disbelievers and the hypocrites and be stern against them. Their dwelling will be hell fire, the most terrible fate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O dear Prophet (Mohammed – peace and blessings be upon him), wage holy war against the disbelievers and the hypocrites, and be strict with them; and their destination is hell; and what a wretched outcome!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Strive hard against the disbelievers and the hypocrites, and be severe against them; their abode will be Hell, and worst indeed is that destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! strive hard against the unbelievers and the hypocrites, and be hard against them; and their abode is hell; and evil is the resort.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, struggle with the unbelievers and the hypocrites, and be thou harsh with them; their refuge shall be Gehenna -- an evil homecoming!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Strive against the disbelievers and the hypocrites, and be stern with them. Hell will be their home, a hapless journey's end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prophet, exert yourself to the utmost against those who deny the truth and the hypocrites. Deal severely with them. Hell will be their abode -- a vile destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! strive hard against the infidels and the hypocrites, and be stern Unto them. And their abode is Hell: a hapless destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Wage jihad against the faithless and the hypocrites, and be severe with them. Their refuge will be hell, and it is an evil destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet! Strive hard against the Unbelievers and the Hypocrites, and be firm against them. Their abode is Hell,- an evil refuge (indeed).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet (Muhammad SAW)! Strive hard against the disbelievers and the hypocrites, and be severe against them, their abode will be Hell, and worst indeed is that destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, struggle with the unbelievers and the hypocrites and deal harshly with them. Gehenna (Hell) shall be their refuge, an evil arrival!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O prophet! Strive hard against the disbelievers and the hypocrites, and be stern with them. Their abode is Hell. What a miserable destination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Prophet, strive against the disbelievers and the hypocrites and be harsh upon them. And their refuge is Hell, and wretched is the destination.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[66:9]   O Prophet! Struggle against the disbelievers, with the sword, and the hypocrites, by the tongue and with argument, and be stern with them, in rebuke and hatred. For their abode will be Hell — and [what] an evil journey’s end!, it is.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(O Prophet! Strive against the disbelievers) the disbelievers of Mecca with the sword until they accept faith (and the hypocrites) of Medina with your tongue by rebuking and threatening them, (and be stern with them) and be hard in words and deeds with both parties. (Hell will be their home) the destination of the disbelievers and hypocrites will be the Fire, (a hapless journey's end) is Gehenna wherein they will end up.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { يٰأَيُّهَا ٱلنَّبِيُّ } المبعوث؛ لإعلاء كلمة التوحيد { جَاهِدِ ٱلْكُفَّارَ } الذين سرتوا بكغيوم هوياتهم الباطلة شمس الحق، وأنكروا وجودها عناداً ومكابرةً، وقاتل معهم بلا مبالاة بشوكتهم، وكثرة عَددهم وعُددهم، هم { وَٱلْمُنَافِقِينَ } أيضاً، مع أنك مؤيَّد من لدنا بالحجج القاطعة، والبينات الساطعة { وَٱغْلُظْ عَلَيْهِمْ } بالأقوال والأفعال، ولا تكن معهم بعد اليوم، مثل ملاينتك معهم قبله، بل اشدد عليهم، فإن الله معينك وناصرك، وهم سيغلبون عن قريب في الدنيا { وَ } في الآخرة { مَأْوَاهُمْ } المعدّ لهم { جَهَنَّمُ } البعد والحرمان، وسعير الطرد والخذلان { وَبِئْسَ ٱلْمَصِيرُ } [التحريم: 9] مصيرهم ومورجعهم جنهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يا أيها النبيُّ جاهِدِ الكفارَ } بالسيف { والمنافقين } بالحجة، أو: بالقول الغليظ والوعظ البليغ، أو: بإقامة الحدود، ولم يؤمر بقتالهم لِتَسَتُّر ظاهرهم بالإسلام،\n\n \" أُمرت أن أحكم بالظواهر، والله يتولى السرائر \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:73",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "9:123",
      "similarity": 0.49366482023370545
    },
    {
      "verse": "67:6",
      "similarity": 0.4395525381872514
    },
    {
      "verse": "31:24",
      "similarity": 0.4387552633439822
    },
    {
      "verse": "24:57",
      "similarity": 0.4307236601973984
    }
  ]
}