{
  "chapter": "الملك",
  "text": "ام امنتم من فى السماء ان يرسل عليكم حاصبا فستعلمون كيف نذير",
  "translations": [
    {
      "translation": "Or do you feel secure against Him Who is in heaven releasing against you a sudden squall of stones, so that you will know how true My warning was?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have you become so unafraid that He who is in Heaven will not send a violent wind to shower stones at you? Then you will know the import of My commination!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that He Who is in the heaven will not let loose upon you a storm of stones? Then shall you know what My warning is like!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that the One in the heavens will not strike you with a sandstorm? You will soon know, with the coming of the torment, how serious Our warning was.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have you become unafraid of the One Who controls the heavens, that He will not send a torrent of stones upon you? So now you will realise, how My warning turned out!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you feel secure that He, Who is over the heaven, will not send against you a Hasib Then you shall know how has been My warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or are you secure of those in the heaven that He should not send down upon you a punishment? Then shall you know how was My warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that He who is in heaven will not loose against you a squall of pebbles, then you shall know how My warning is?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have ye taken security from Him Who is in the heaven that He will not let loose on you a hurricane? But ye shall know the manner of My warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that the One in heaven will not send against you a whirlwind to pelt you with stones, so that you will know how [true] My warning was?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or are ye secure that He Who is in the heaven will not send against you a whirlwind? Anon ye shall know what wise hath been My warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you secure that He who is in the sky will not unleash upon you a rain of stones? Soon you will know how My warning has been!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do ye feel secure that He Who is in Heaven will not send against you a violent tornado (with showers of stones), so that ye shall know how (terrible) was My warning?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you feel secure that He, Who is over the heaven (Allah), will not send against you a violent whirlwind? Then you shall know how (terrible) has been My Warning?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that He who is in the heaven will not loose against you a squall of pebbles then you shall know how was My warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or are you confident that the One in Heaven will not unleash against you a violent storm? Then you will know what My warning is like.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you feel secure that He who [holds authority] in the heaven would not send against you a storm of stones? Then you would know how [severe] was My warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:17] Are you secure [in thinking] that He Who is in the heaven will not unleash (an yursila substitutes for man, ‘He Who’) upon you a squall of pebbles?, a wind hurling pebbles at you. But you will [soon] come to know, upon seeing the chastisement with your own eyes, the nature of My warning, My warning of chastisement, in other words, [you will soon see] that it was true.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or have ye taken security from Him Who is in the heaven) or have you taken security from the chastisement of He Who is in Heaven, established on the Throne, by your transgression (that He will not let loose on you a hurricane) that He will not send down on you stones just as He did with the folk of Lot? (But ye shall know the manner of My warning) you shall know how I turn against you with chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمْ أَمِنتُمْ } عذاب { مِّن فِي ٱلسَّمَآءِ أَن يُرْسِلَ } ويمطر { عَلَيْكُمْ حَاصِباً } حصباء من قِبَل السماء فيهلككم بها، كما فعل بقوم لوط عليه السلام { فَسَتَعْلَمُونَ } حينئذٍ أيها المسرفون المفرطون في كفران النعم، ونسيان حقوق الكرم { كَيْفَ نَذِيرِ } [الملك: 17] وإنذاري عليكم\n\n\n\n\nوإن كذبوك يا أكمل الرسل، وبالغوا في تكذيبك وإنكارك لا تبال بهم وبتكذيبهم، وانتظر إلى ما سيؤول أمرهم إليه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فستعلمون } عن قريب { كيف نذيرٍ } أي: إنذاري عن مشاهدتكم للمنذَر به، ولكن لا ينفعكم العلم حينئذٍ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "54:34",
      "similarity": 0.7653673049725729
    },
    {
      "verse": "21:98",
      "similarity": 0.6827512725769291
    },
    {
      "verse": "17:68",
      "similarity": 0.6031953605903588
    },
    {
      "verse": "29:40",
      "similarity": 0.5423750948550654
    },
    {
      "verse": "54:16",
      "similarity": 0.15446962268931835
    }
  ]
}