{
  "chapter": "الملك",
  "text": "تبرك الذى بيده الملك وهو على كل شىء قدير",
  "translations": [
    {
      "translation": "Blessed be He who has the Kingdom in His Hand! He has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "BLESSED BE HE who holds the (reins of) Kingship in His hand, who has power over everything,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He in Whose Hand is the dominion of the Universe, and Who has power over everything;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He in whose hands is the Kingdom and who has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most Auspicious is He in Whose control is the entire kingship; and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He in Whose Hand is the dominion; and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He in Whose hand is the kingdom, and He has power over all things,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He in whose hand is the Kingdom -- He is powerful over everything --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He in Whose hand is the Sovereignty, and, He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He in whose hand is the Kingdom: He has power over all things;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blest be He in whose hand is the dominion, and He is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He in whose hands is all sovereignty, and He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He in Whose hands is Dominion; and He over all things hath Power;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He in Whose Hand is the dominion, and He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed be He in whose Hand is the Kingdom, He is powerful over all things,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He in whose hand is the sovereignty, and Who has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is He in whose hand is dominion, and He is over all things competent -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:1] Blessed, exalted above the attributes of created beings, is He in Whose hand, at Whose disposal, is [all] sovereignty, [all] authority and power, and He has power over all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Blessed is He): '(Blessed is He) He says: He possesses grace; it is also said this means: exalted, transcendent, exonerated is He, and He is too holy to have children or partners (in Whose hand is the Sovereignty) the power to bestow might and abasement and the power over the stores of all things, (and He is Able to do all things) to elevate or to abase.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ تبارك الذي بيده الملك } الملك عالم الأجسام كما أن الملكوت عالم النفوس\n ولذلك وصف ذاته باعتبار تصريفه عالم الملك بحسب مشيئته بالتبارك الذي هو غاية العظمة ونهاية الازدياد في العلوّ والبركة\n وباعتبار تسخيره عالم الملكوت بمقتضى إرادته بالتسبيح الذي هو التنزيه كقوله:\n[يس\n الآية:83] كلاًّ بما يناسبه\n لأن العظمة والازدياد والبركة تناسب الأجسام\n والتنزّه يناسب المجرّدات عن المادة\n فمعنى تبارك: تعالى وتعاظم الذي يتصرّف في عالم الملك بيد قدرته\n لا يتصرّف فيه غيره\n فبيده كل ما وجد من الأجسام لا بيد غيره يصرّفها كما يشاء { وهو } القادر على كل ما عدم من الممكنات يوجدها على ما يشاء\n فإن قرينة القدرة تخص الشيء بالممكن إذ تعلل القدرة به فيقال: إنه مقدوره لأنه ممكن\n { الذي خلق الموت والحياة } الموت والحياة من باب العدم والملكة\n فإن الحياة هي الإحساس والحركة الإرادية ولو اضطرارية كالتنفس والموت عدم ذلك عما من شأنه ان يكون له وعدم الملكة ليس عدماً محضاً بل فيه شائبة الوجود وإلا لم يعتبر فيه المحل القابل للأمر الوجودي فلذلك صح تعلق الخلق به كتعلقه بالحياة وجعل الغرض من خلقهما بلاء الإنسان في حسن العمل وقبحه\n أي: العلم التابع للمعلوم الذي يترتب عليه الجزاء وهو العلم الذي يظهر على المظاهر الإنسانية بعد وقوع المعلوم\n فإنه ليس إلا علم الله الكامن في الغيب الظاهر بظهور المعلوم لأن الحياة هي التي يتمكن بها على الأعمال والموت هو الداعي إلى حسن العمل الباعث عليه وبه يظهر آثار الأعمال كما أن الحياة يظهر بها أصولها وبهما تتفاضل النفوس في الدرجات وتتفاوت في الهلاك والنجاة\n وقدّم الموت على الحياة لأن الموت في عالم الملك ذاتي والحياة عرضية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تَبَارَكَ هُوَ } تعاظم وتعالى من كثرة الخيرات والبركات الملك الكامل { ٱلَّذِي بِيَدِهِ ٱلْمُلْكُ } وبقبضة قدرته جميع التدابير الجارية فيه على وجوه الصور والتقادير { وَ } كيف لا { عَلَىٰ كُلِّ شَيْءٍ } من متفرعات جود وجوده { قَدِيرٌ } [الملك: 1] بالقدرة الشاملة\n والإرادة الكاملة؟!\n\n{ ٱلَّذِي خَلَقَ } وقدر { ٱلْمَوْتَ وَٱلْحَيَاةَ } بمقتضى قهره ولطفه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { تباركَ } أي: تعالى وتعاظم عن صفات المخلوقين فالبركة: السمو والزيادة\n حسية أو عقلية\n وكثرة الخير ودوامه\n والمعنى الأول أنسب للمقام\n باعتبار تعاليه عزّ وجل عما سواه في ذاته وصفاته وأفعاله\n وصيغة التفاعل للمبالغة في ذلك فإنَّ ما لا يصح نسبته إليه تعالى من الصيغ\n كالتكثُّر ونحوه\n إنما يُنسب إليه تعالى باعتبار غاياتها\n وعلى الثاني باعتبار كثرة ما يفيض منه تعالى على مخلوقاته من فنون الخيرات\n أي: تعالى بالذات عن كل ما سواه\n { الذي بيده المُلك } أي: بيده التصرُّف التام والاستيلا ء على كل موجود\n وهو مالك المُلك\n يُؤتيه مَن يشاء\n وينزعه عمن يشاء\n واليد: مجاز عن القدرة التامة\n والاستيلاء الكامل\n { وهو على كل شيءٍ } من المقدورات\n أو من الإنعام والانتقام { قديرٌ } مبالغ في القدرة يتصرف فيه على حسب ما تقتضيه مشيئته المبنية على الحِكم البالغة\n والجملة: معطوفة على الصلة\n مقرِّرة لمضمونها\n مفيدة لجريان أحكام مُلكه تعالى في جلائل الأمور ودقائقها\n دالة على العموم والشمول في أنه متصرف في أحوال المُلك في إيجاد أعيان الأشياء المتصرّف فيها وفي إيجاد عوارضها الذاتية\n ولو اقتصر على قوله: { بيده الملك } لأوهم قصوره على تغيُّر أحوال المُلك فقط\n ثم أحال على ما هو مُشاهد من التصرُّف بقوله: { الذي خلق الموتَ والحياةَ } أي: موتكم وحياتكم أيها المكلّفون\n ومعنى خلق الموت والحياة: إيجاد ما يصحح الإحساس وإعدامه\n والموت عند أهل السنة: صفة وجودية مضادة للحياة\n وأمّا ما رُوي عن ابن عباس: أنه تعالى خلق الموتَ في صورة كبش أملح\n لا يمر بشيء ويجد ريحه إلاّ مات\n وخلق الحياة في صورة فرس\n لا يَمر والا يجد رائحتها شيء إلاّ حيى \" فوارد على منهاج التمثيل والتصوير\n ويجوز أن يكون حقيقة\n إذ القدرة صالحة\n وتقديم الموت لأنه أدعى لأحسن العمل\n الذي هو حكمة خلق الموت والحياة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:29",
      "similarity": 0.6062697946220416
    },
    {
      "verse": "44:3",
      "similarity": 0.5216470857969314
    },
    {
      "verse": "25:1",
      "similarity": 0.5139920688208653
    },
    {
      "verse": "43:85",
      "similarity": 0.5097441159958194
    },
    {
      "verse": "6:155",
      "similarity": 0.5001342945097157
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/67:1.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/67:1.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/67:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}