{
  "chapter": "الملك",
  "text": "هو الذى جعل لكم الارض ذلولا فامشوا۟ فى مناكبها وكلوا۟ من رزقه واليه النشور",
  "translations": [
    {
      "translation": "It is He who made the earth subservient to you that you may travel all around it, and eat of things He has provided; and to Him will be your resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who made the earth subservient to you. So traverse in its tracks and partake of the sustenance He has provided. To Him will you be resurrected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has made the earth subservient to you. You walk through its vast valleys and eat of its sustenance. Before Him you will all be resurrected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who subjected the earth for you, therefore tread its paths and eat from Allah’s sustenance; and towards Him is the resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who has made the earth subservient to you; so walk in the paths thereof and eat of His provision. And to Him will be the resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who made the earth smooth for you, therefore go about in the spacious sides thereof, and eat of His sustenance, and to Him is the return after death.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the earth submissive to you; therefore walk in its tracts, and eat of His provision; to Him is the Uprising.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who hath made the earth subservient unto you, so Walk in the paths thereof and eat of His providence. And unto Him will be the resurrection (of the dead).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has made the earth subservient to you, so traverse its regions and eat its provisions. To Him you shall all be resurrected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who hath made the earth Unto you subservient, so go forth in the regions thereof, and eat of His provision. And Unto Him is the Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the earth tractable for you; so walk on its flanks and eat of His provision, and towards Him is the resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has made the earth manageable for you, so traverse ye through its tracts and enjoy of the Sustenance which He furnishes: but unto Him is the Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is, Who has made the earth subservient to you (i.e. easy for you to walk, to live and to do agriculture on it, etc.), so walk in the path thereof and eat of His provision, and to Him will be the Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has made the earth submissive to you. Walk about in its land and eat of His provision. To Him is the Resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the earth manageable for you, so travel its regions, and eat of His provisions. To Him is the Resurgence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the earth tame for you - so walk among its slopes and eat of His provision - and to Him is the resurrection.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:15] It is He Who made the earth tractable for you, easy for you to walk on; so walk in its flanks and eat of His provision, that has been created for you; and to Him is the resurrection, from the graves for the Requital.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is Who hath made the earth subservient unto you) He made it subservient by means of the mountains, (so walk in the paths) and it is also said: in the mountains, hills and valleys (thereof and eat of His providence) and you eat of His sustenance. (And unto Him will be the resurrection (of the dead)) and unto Him is the return after death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَنَاكِبِهَا } معناه في جوانِبِهَا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ هو الذي جعل لكم } أرض النفس { ذلولاً فامشوا } بأقدام الفطرة في أعالي صفاتها وأعز أطرافها وجهاتها وأقهروها مذللة { وكلوا من رزقه } الذي ينال من جهتها أي: العلم المأخوذ من الحسّ وهو الأكل من تحت الأرجل المشار إليه بقوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { هُوَ } سبحانه القادر المقتدر { ٱلَّذِي جَعَلَ لَكُمُ } أيها المكلفون بمقتضى سعة رحمته وجوده { ٱلأَرْضَ ذَلُولاً } لينة سهلة، قابلة للسلوك عليها { فَٱمْشُواْ فِي مَنَاكِبِهَا } جبالها أو جوانبها حيث شئتم { وَكُلُواْ مِن رِّزْقِهِ } رغداً واسعاً متى أردتم، واشكروا المنعم المفضل، ولا تكفروا به وبنعمه { وَ } اعلموا أنه { إِلَيْهِ } لا إلى غيره من الوسائل والأسباب { ٱلنُّشُورُ } [الملك: 15] أي: نشور الكل ورجوعه؛ إذ لا مرجع لكم سواه، ولا معاد إلاَّ إليه، فيسألكم عمَّا أنعم عليكم ويحاسبكم عليه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { هو الذي جعل لكم الأرضَ ذلولا } مذلّلة ليّنة يسهل عليكم سلوكها\n وتقديم لكم على مفعول الجعل للاهتمام والتشويق، { فامشُوا في مناكبها } جوانبها، وهو تمثيل لفرط التذلُّل، فإنَّ منكب البعير أرقّ أعضائه وأصعبها على أن يطأها الراكب بقدميه، فإذا جعل الأرض في الذل بحيث يتأتى المشي في مناكبها لم يبقَ منها شد لم يتذلّل، { وكُلوا من رزقه } أي: والتمسوا من رزق الله في سلوكها، أو إذا تعذّر العيش في أرضٍ فامشوا في مناكبها إلى أرض أخرى، كما قال الشاعر:\n\nأو: كُلوا من رزق الله الخارج منها، { وإِليه النُشورُ } أي: الرجوع بالبعث، فتُسألون عن شكر هذه النعم\n ثم هدَّد مَن لم يشكر فقال: { أأمِنْتُم مَن في السماء } من ملكوته وأسرار ذاته، وعبّر بها لأنها منزل قضاياه، وتدبيراته ووحيه، ومسكن ملائكته وأوامره ونواهيه، فكل ما يظهر في الأرض إنما يقضي به في السماء، وحينئذ يبرز، فكأنه قال: أأمِنتم خالق السموات؟ وقال اللجائي: كل شيء علا فهو سماء، وسماء البيت: سقفه، وليس المقصود في الآية سماء الدنيا ولا غيرها من السبع الطباق، وإنما المعنى: أأمِنتم مَن في العلو، وهو علو الجلال، وليس كون الله في سماء الحوادث من صفات الكمال، تعالى الله عن ذلك علوًّا كبيراً\n هـ\n وسيأتي في الإشارة تحقيقة عند أهل التوحيد",
      "translations": []
    }
  ]
}