{
  "chapter": "الملك",
  "text": "ءامنتم من فى السماء ان يخسف بكم الارض فاذا هى تمور",
  "translations": [
    {
      "translation": "Do you feel secure against Him Who is in heaven causing the earth to swallow you up when suddenly it rocks from side to side?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you so unafraid that He who is in Heaven will not open up the earth to swallow you, when it will begin to tremble?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that He Who is in the heaven will not cause the earth to cave in with you, and then suddenly it will begin to rock violently?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that the One in the heavens will not cause you to sink into the earth when it is violently shaking?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have you become unafraid of the One Who controls the heavens, that He will not cause you to sink into the earth when it trembles?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that He, Who is over the heaven, will not cause the earth to sink with you, and then it should quake\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you secure of those in the heaven that He should not make the earth to swallow you up? Then lo! it shall be in a state of commotion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that He who is in heaven will not cause the earth to swallow you, the while it rocks?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have ye taken security from Him Who is in the heaven that He will not cause the earth to swallow you when lo! it is convulsed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that He who is in heaven will not cause the earth to sink beneath you and then begin to quake?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are ye secure that He who is in the heaven will not sink the earth with you and then it should quake?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you secure that He who is in the sky will not make the earth swallow you while it quakes?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do ye feel secure that He Who is in heaven will not cause you to be swallowed up by the earth when it shakes (as in an earthquake)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that He, Who is over the heaven (Allah), will not cause the earth to sink with you, then behold it shakes (as in an earthquake)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that He who is in the heaven will not cause the earth to swallow you up while it shakes?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are you confident that the One in heaven will not cause the earth to collapse beneath you as it spins?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you feel secure that He who [holds authority] in the heaven would not cause the earth to swallow you and suddenly it would sway?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:16] Are you secure (read a-amintum pronouncing both hamzas fully, or by not pronouncing the second one, inserting an alif between it and the other one, or without [the insertion] but replacing it with an alif instead) [in thinking] that He Who is in the heaven, [that He] Whose authority and power [is in the heaven], will not cause the earth to swallow you (an yakhsifa substitutes for man, ‘He Who’) while it quakes?, [while] it moves underneath you and rises above you?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nأَأَمِنْتُمْ مَنْ فِي السَّمَاءِ أَنْ يَخْسِفَ بِكُمُ الْأَرْضَ فَإِذَا هِيَ تَمُورُ (16)انتقال من الاستدلال إلى التخويف لأنه لما تقرر أنه خالق الأرض ومذللها للناس وتقرر أنهم ما رعوا خالقها حق رعايته فقد استحقوا غضبه وتسليط عقابه بأن يُصيّر مشيهم في مناكب الأرض إلى تَجَلْجل في طبقات الأرض . فالجملة معترضة والاستفهام إنكار وتوبيخ وتحذير .و { مَن } اسم موصول وصلته صادِق على موجود ذي إدراك كائن في السماء . وظاهر وقوع هذا الموصول عقب جُمل { هو الذي جَعل لكم الأرض ذلولاً إلى قوله : { وإليه النشور } \\[ الملك : 15 \\] أن الإتيان بالموصول من قبيل الإِظهار في مقام الإِضمار ، وأن مقتضى الظاهر أن يقال أأمنتموه أن يخسف بكم الأرض؛ فيتأتى أن الإِتيان بالموصول لِما تأذن به الصلة من عظيم تصرفه في العالم العلوي الذي هو مصدر القُوى والعناصر وعجائب الكائنات فيصير قوله : { من في السماء } في الموضعين من قبيل المتشابه الذي يعطي ظاهره معنى الحلول في مكان وذلك لا يليق بالله ، ويجيء فيه ما في أمثاله من طريقتي التفويض للسلف والتأويل للخلَف رحمهم الله أجمعين .وقد أوَّلوه بمعنى : من في السماء عذابُه أو قدرتُه أو سلطانه على نحو تأويل قوله تعالى : { وجاء ربك } \\[ الفجر : 22 \\] وأمثاله ، وخُص ذلك بالسماء لأن إثباته لله تعالى ينفيه عن أصنامهم .ولكن هذا الموصول غير مَكين في باب المتشابه لأنه مجمل قابل للتأويل بما يَحتمله { من } أن يَكون مَا صْدَقُه مخلوقات ذات إدراك مقرها السماء وهي الملائكة فيصح أن تصدق { مَن } على طوائف من الملائكة الموكلين بالأمر التكويني في السماء والأرض قال تعالى : { يتنزل الأمر بينهن } \\[ الطلاق : 12 \\] ، ويصح أن يراد باسم الموصل ملك واحد معيَّن وظيفته فعل هذا الخسف ، فقد قيل : إن جبريل هو الملَك الموكّل بالعذاب .وإسناد فعل { يخسف } إلى «الملائكة» أو إلى واحد منهم حقيقة لأنه فاعل الخسف قال تعالى حكاية عن الملائكة { قالوا إنا مهلكوا أهل هذه القرية . . . إنا مُنجوك وأهلك . . . إنَّا منزلون على أهل هذه القرية رجزاً من السماء } \\[ العنكبوت : 31 34 \\] .وإفراد ضمير { يخسف } مراعاة للفظ { مَن } إذا أريد طائفة من الملائكة أو مراعاة للفظ والمعنى إذا كان ما صْدق { مَن } ملكاً واحداً .والمعنى : توبيخهم على سوء معاملتهم ربهم كأنهم آمنون من أن يَأمر الله ملائكته بأن يخسفوا الأرض بالمشركين .والخسف : انقلاب ظاهر السطح من بعض الأرض باطناً وباطنه ظاهراً وهو شدة الزلزال .وفعل خسف يستعمل قاصراً ومتعدياً وهو من باب ضرب ، وتقدم عند قوله تعالى : { أفأمن الذين مكروا السيئات أن يخسف الله بهم الأرض } سورة النحل ( 45 ) .والباء في قوله : بكم } للمصاحبة ، أي يخسف الأرض مصاحبة لذواتكم . وفي الجمع بين السماء والأرض محسّن الطباق .والمصدر المُنسبك من { أن يخسف } يجوز أن يكون بدل اشتمال من اسم الموصول لأن الخسف من شأن مَن في السماء ، ويجوز أن يكون منصوباً على نزع الخافض وهو مطّرد مع { أنْ } ، والخافض المحذوف حرف ( مِن ) .وفُرع على الخسف المتوقع المهدد به أن تمور الأرضُ تفريعَ الأثر على المؤثر لأن الخسف يحدث المَور ، فإذا خسفت الأرض فاجأها المَور لا محالة ، لكن نظم الكلام جرى على مَا يناسبُ جعل التهديد بمنزلة حادث وقع فلذلك جيء بعده بالحرف الدال على المفاجأة لأن حق المفاجأة أن تكون حاصلة زمن الحال لا الاستقبال كما في «مغني اللبيب» فإذا أريد تحقيق حصول الفعل المستقبل نُزل منزلة الواقع في الحال كقوله تعالى : { ثم إذا دعاكم دعوة من الأرض إذا أنتم تخرجون } \\[ الروم : 25 \\] ، وإذا أريد استحضار حالة فعل حصل فيما مضى نُزل كذلك منزلة المشاهد في الحال كقوله تعالى : { وإذا أذقنا الناس رحمة من بعد ضراء مستهم إذا لهم مكر في آياتنا } \\[ يونس : 21 \\] ، فكان قوله : { فإذا هي تمور } مؤذناً بتشبيه حالة الخسف المتوقع المهدد به بحالة خسف حصل بجامع التحقق كما قالوا في التعبير عن المستقبل بلفظ الماضي ، وحُذف المركب الدال على الحالة المشبه بها ورمز إليه بما هو من آثاره ويتفرع عنه فكان في الكلام تمثيلية مَكْنيّة .والمور : الارتجاج والاضطراب وتقدم في قوله تعالى : { يوم تمور السماء موراً } في سورة الطور ( 9 ) .\n\n",
      "translations": [
        {
          "translation": "(Have ye taken security) by your transgression, people of Mecca, (from Him Who is in the heaven) from the chastisement of He Who is in Heaven established on the Throne (that He will not cause the earth to swallow you when lo! it is convulsed) swirling with you to the seventh earth, just as it has swallowed Korah?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَإِذَا هِيَ تَمُورُ } معناه تَجيءُ كَمَا يَجيءُ السَّحابُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Then when it has become overwhelming\" - its meaning is that it comes as swiftly as a cloud.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا تشكرون نعمه\n ولا تواظبون على أداء حقوق كرمه؟! { أَءَمِنتُمْ } عذاب { مَّن فِي ٱلسَّمَآءِ } أي: من عذابه النازل من جانب السماء على من لم يشكر نعماءه المتوالية\n وآلاءه المتتالية من { أَن يَخْسِفَ بِكُمُ ٱلأَرْضَ } ويطويكم بها ويغيبكم فيها\n كما فعل بقارون { فَإِذَا هِيَ تَمُورُ } [الملك: 16]\n\n\n{ أَمْ أَمِنتُمْ } عذاب { مِّن فِي ٱلسَّمَآءِ أَن يُرْسِلَ } ويمطر { عَلَيْكُمْ حَاصِباً } حصباء من قِبَل السماء فيهلككم بها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أي: أأمِنتم مَن في السماء أسرار ذاته { أن يخسف بكم الأرضَ } كما خسف بقارون بعد ما جَعلها لكم ذلولاً تمشون في مناكبها\n وتأكلون من رزقه فيها\n بحيث كفرتم تلك النعمة\n فقلبها لكم { فإِذا هي تمورُ } تضطرب وتتحرّك\n { أم أَمِنْتُم مَن في السماء أن يُرسل عليكم حاصباً } حجارة من السماء كما أرسلها على قوم لوط وأصحاب الفيل\n أو: ريحاً فيها حجارة\n و \" أن \": بدل اشتمال في الموضعين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "52:9",
      "similarity": 0.8787751880365129
    },
    {
      "verse": "75:8",
      "similarity": 0.311738460374477
    },
    {
      "verse": "16:45",
      "similarity": 0.29866386824175695
    },
    {
      "verse": "28:81",
      "similarity": 0.28164752651965597
    },
    {
      "verse": "17:68",
      "similarity": 0.24360786736045628
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/067016.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/067016.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/67:16.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}