{
  "chapter": "الملك",
  "text": "امن هذا الذى هو جند لكم ينصركم من دون الرحمن ان الكفرون الا فى غرور",
  "translations": [
    {
      "translation": "Who is there who could be a force for you, to come to your support, apart from the All-Merciful? The kafirun are only living in delusion.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What other army do you have to help you apart from Ar-Rahman? The unbelievers are surely lost in delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which is your army that will come to your aid against the Merciful Lord? But the unbelievers are in utter delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you have any armies who will help you against the Beneficent God? The disbelievers are certainly deceived (by satan).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or which army do you have that will help you against the Most Gracious? The disbelievers are in nothing except an illusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it besides the Most Gracious that can be an army to you to help you The disbelievers are in nothing but delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or who is it that will be a host for you to assist you besides the Beneficent Allah? The unbelievers are only in deception.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or who is this that shall be a host for you to help you, apart from the All-merciful? The unbelievers are only in delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or who is he that will be an army unto you to help you instead of the Beneficent? The disbelievers are in naught but illusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is there to defend you like an army, besides the Lord of Mercy? Those who deny the truth are in deception.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who. is he that can be an army Unto you and succour you, beside the Compassionate! The infidelsjb are but in delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it that is your host who may help you, besides the All-beneficent? The faithless only dwell in delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, who is there that can help you, (even as) an army, besides (Allah) Most Merciful? In nothing but delusion are the Unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he besides the Most Beneficent that can be an army to you to help you? The disbelievers are in nothing but delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, who is it that shall be your host to help you, other than the Merciful? Indeed, the unbelievers are only deluded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or who is this who is a force for you to protect you against the Compassionate? The disbelievers are in nothing but delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or who is it that could be an army for you to aid you other than the Most Merciful? The disbelievers are not but in delusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:20] Or who (am-man: the subject) is it (hādhā: its predicate) that (alladhī: a substitution for hādhā, ‘is it’) will be an army, supporters, for you (lakum belongs to the relative clause of alladhī, ‘that’) to help you (yansurukum is an adjectival qualification of jundun, ‘an army’) besides the Compassionate One?, that is to say, other than Him, who [is there that] will [be able to] avert His chastisement from you, in other words, you have no helper. The disbelievers are in nothing but delusion: Satan has deluded them [into believing] that the chastisement will not befall them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or who is he that will be an army unto you to help you instead of the Beneficent) who helps you to avoid the chastisement of the Beneficent? (The disbelievers are in naught but illusion) they are in nothing but the falsehoods and illusion of the life of the world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه مستفهماً إياهم على الإنكار والتقريع: { أَمَّنْ هَـٰذَا } الناصر الظهير { ٱلَّذِي هُوَ جُندٌ لَّكُمْ } وعون لكم { يَنصُرُكُمْ } ويعينكم حين بطش الله إياكم أيها المسرفون { مِّن دُونِ ٱلرَّحْمَـٰنِ } المستوعب بالرحمة العامة على عموم الأكوان، مع أنه لا شيء في الوجود سواه، وبالجملة: { إِنِ ٱلْكَافِرُونَ } أي: ما هم { إِلاَّ فِي غُرُورٍ } [الملك: 20] باطل وزور ظاهر بلا وثوق لهم، ولا اعتماد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "82:6",
      "similarity": 0.4952347350379377
    },
    {
      "verse": "35:5",
      "similarity": 0.47761161183521117
    },
    {
      "verse": "35:40",
      "similarity": 0.4571054517140436
    },
    {
      "verse": "3:196",
      "similarity": 0.4349675258655225
    },
    {
      "verse": "36:28",
      "similarity": 0.43441467439951087
    }
  ]
}