{
  "chapter": "الملك",
  "text": "قل هو الذى انشاكم وجعل لكم السمع والابصر والافـدة قليلا ما تشكرون",
  "translations": [
    {
      "translation": "Say: 'It is He who brought you into being and gave you hearing, sight and hearts. What little thanks you show!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It is He who raised you and gave you ears and eyes and hearts. How little are the thanks you offer!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: “He it is Who has brought you into being, and has given you hearing and sight, and has given you hearts to think and understand. How seldom do you give thanks!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"It is God who has brought you into being and made ears, eyes, and hearts for you, but you give very little thanks\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “It is He Who created you, and made ears and eyes and hearts for you; very little thanks do you offer!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It is He Who has created you, and endowed you with hearing and seeing, and hearts. Little thanks you give.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: He it is Who brought you into being and made for you the ears and the eyes and the hearts: little is it that you give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'It is He who produced you, and appointed for you hearing and sight and hearts; little thanks you show!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (unto them, O Muhammad): He it is who gave you being, and hath assigned unto you ears and eyes and hearts. Small thanks give ye!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"It is He who brought you into being, and made ears and eyes and hearts for you, yet you are seldom grateful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: He it is who hath brought you forth and hath endowed you with hearing and sights and hearts. Little thanks it is ye give!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘It is He who created you, and made for you hearing, eyesight, and hearts. Little do you thank.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It is He Who has created you (and made you grow), and made for you the faculties of hearing, seeing, feeling and understanding: little thanks it is ye give.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say it is He Who has created you, and endowed you with hearing (ears), seeing (eyes), and hearts. Little thanks you give.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'It is He who has created you and given to you hearing, sight and hearts but little is it that you thank'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “It is He who produced you; and made for you the hearing, and the vision, and the organs. But rarely do you give thanks.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"It is He who has produced you and made for you hearing and vision and hearts; little are you grateful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:23] Say: ‘It is He Who created you and endowed you with hearing and sight and hearts. Little do you thank!’ (mā tashkurūna: mā is extra; the sentence itself is a new [independent] one, informing of how extremely little they give thanks for these graces).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ هُوَ الَّذِي أَنْشَأَكُمْ وَجَعَلَ لَكُمُ السَّمْعَ وَالْأَبْصَارَ وَالْأَفْئِدَةَ قَلِيلًا مَا تَشْكُرُونَ (23)هذا انتقال من توجيه الله تعالى الخطاب إلى المشركين للتبصير بالحجج والدلائل وما تخلل ذلك من الوعيد أو التهديد إلى خطابهم على لسان رسوله صلى الله عليه وسلم بأن يقُول لهم ما سيُذكر تفنناً في البيان وتنشيطاً للأذهان حتى كأنَّ الكلامَ صدَر من قائلين وترفيعاً لقدر نبيئه صلى الله عليه وسلم بإعطائه حظاً من التذكير معه كما قال تعالى : { فإنما يسرناه بلسانك } \\[ الدخان : 58 \\] .والانتقال هنا إلى الاستدلال بفُروع المخلوقات بعد الاستدلال بأصولها ، ومن الاستدلال بفروع أعراض الإِنسان بعد أصلها ، فمن الاستدلال بخلق السماوات والأرض والموت والحياة ، إلى الاستدلال بخلق الإِنسان ومداركه ، وقد أتبع الأمر بالقول بخمسةٍ مِثْلِه بطريقة التكرير بدون عاطف اهتماماً بما بعد كل أمر من مقالة يبلغها إليهم الرسول صلى الله عليه وسلم قال : { هو الذي أنشأكم وجعل لكم السمع والأبصار } ، الخ .والضمير { هو } إلى { الرحمان } من قوله : { من دون الرحمان } \\[ الملك : 20 \\] .والإِنشاء : الإيجاد .وإفراد { السمع } لأن أصله مصدر ، أي جعل لكم حاسة السمع ، وأما { الأبصار } فهو جمع البصر بمعنى العَين ، وقد تقدم وجه ذلك عند قوله تعالى { ختم الله على قلوبهم وعلى سمعهم وعلى أبصارهم غشاوة } في سورة البقرة ( 7 ) والأفئدة } القلوب ، والمراد بها العقول ، وهو إطلاق شائع في استعمال العرب .والقصر المستفاد من تعريف المسند إليه والمسندِ في قوله : { هو الذي أنشأكم } إلى آخره قصرُ إفراد بتنزيل المخاطبين لشركهم منزلةَ من يعتقد أن الأصنام شاركت الله في الإِنشاء وإعطاء الإِحساس والإِدراك .و { قليلاً ما تشكرون } حال من ضمير المخاطبين ، أي أنعم عليكم بهذه النعم في حال إهمالكم شكرها .و { مَا } مصدرية والمصدر المنسبك في موضع فاعل { قليلاً } لاعتماد { قليلاً } على صاحب حال . و { قليلاً } صفة مشبَّهة .وقد استعمل { قليلاً } في معنى النفي والعدم ، وهذا الإِطلاق من ضروب الكناية والاقتصاد في الحكم على طريقة التمليح وتقدم عند قوله تعالى : { فقليلاً ما يؤمنون } \\[ البقرة : 88 \\] وقوله تعالى : { فلا يؤمنون إلاّ قليلاً } في سورة النساء ( 155 ) ، وتقول العرب : هذه أرض قلما تنبت .\n\n",
      "translations": [
        {
          "translation": "(Say (unto them, Muhammad): He it is Who gave you being) He it is Who created you, (and hath assigned unto you ears) so that you would hear the Truth and guidance (and eyes) so that you would see the Truth and guidance (and hearts) so that you perceive the Truth and guidance. (Small thanks give ye!) He says: you give little thanks for all the things done for you; and it is also said this means: you do not give any thanks.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل لمن أنكر وحدة الحق\n واسقتلاله ف يمطلق التصرفات الواقعة في عالم الكون والفساد: { هُوَ } سبحانه القادر المقتدر { ٱلَّذِيۤ أَنشَأَكُمْ } وأظهركم من كتم العدم إنشاءً إبداعياً { وَجَعَلَ لَكُمُ ٱلسَّمْعَ } لتسمعوا به المواعظ\n والآثار والأخبار الصادرة عن أولي العزائم الصحيحة\n المجتازين نحو فضاء اللاهوت بانخلاعهم عن كسوة الناسوت مطلقاً { وَٱلأَبْصَارَ } لتنظروا بها في ملكوت السماوات والأرض فتعتبروا منها إلى مبدعها العليم الحكيم { وَٱلأَفْئِدَةَ } لتتفطنوا بها إلى عجائب حكمته\n وبدائع قدرته\n كي تنكشفوا بوحدته\n وتتشرفوا بوصلته\n لكن { قَلِيلاً مَّا تَشْكُرُونَ } [الملك: 23] أي: الشاكرون الصارفون لهذه النعم العظام إلى ما خلقت لأجله\n قليل في غاية القلة\n\n\n{ قُلْ } يا أكمل الرسل لمن أنكر قدرتنا على الحشر والنشر\n والحساب والجزاء على جميع الأمور الواقعة في النشأة الأخرى { هُوَ } سبحانه العزيز الغالب\n ذو القدرة والاختبار { ٱلَّذِي ذَرَأَكُمْ } أي: بثكم وبسطكم بمقتضى قدرته { فِي ٱلأَرْضِ } التي هي محل الكون والفساد\n وكلفكم على الإيمان والأعمال\n واختبركم بالأوامر والنواهي { وَ } كما أبدعكم أولاً بامتداد أظلاله\n ورش نوره على مرآة العدم\n أعادكم أيضاً بقبض أضلاله وأنواره إلى ذاته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:78",
      "similarity": 0.9870563079072616
    },
    {
      "verse": "32:9",
      "similarity": 0.6282283305203569
    },
    {
      "verse": "16:78",
      "similarity": 0.6129112557002832
    },
    {
      "verse": "53:11",
      "similarity": 0.5895815276540336
    },
    {
      "verse": "104:7",
      "similarity": 0.4867542963165071
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/067023.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/067023.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/67:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}