{
  "chapter": "الملك",
  "text": "قل هو الذى ذراكم فى الارض واليه تحشرون",
  "translations": [
    {
      "translation": "Say: 'It is He who scattered you about the earth and you will be gathered to Him.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It is He who dispersed you all over the earth, and to Him you will be gathered.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: “Allah it is Who multiplied you in the earth and to Him you will be mustered.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"It is God who has settled you on the earth and to Him you will be resurrected\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “It is He Who has spread you out in the earth, and towards Him you will be raised.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It is He Who has created you on the earth, and to Him shall you be gathered.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: He it is Who multiplied you in the earth and to Him you shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'It is He who scattered you in the earth, and unto Him you shall be mustered.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: He it is Who multiplieth you in the earth, and unto Whom ye will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"It is He who has scattered you on the earth; and it is to Him that you shall all be gathered [on the Day of Resurrection].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: He it is Who hath spread you over the earth, and Unto Him ye shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘It is He who created you on the earth, and toward Him you will be mustered.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It is He Who has multiplied you through the earth, and to Him shall ye be gathered together.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It is He Who has created you from the earth, and to Him shall you be gathered (in the Hereafter).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'It was He who created you, dispersing you in the earth, and to Him you shall be gathered'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “It is He who scattered you on earth, and to Him you will be rounded up.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"It is He who has multiplied you throughout the earth, and to Him you will be gathered.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:24] Say: ‘It is He Who multiplied you, created you, on earth, and to Him you will be gathered’, for the Reckoning.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say: He it is Who multiplieth) Who creates (you in the earth) from Adam and Adam is from dust and dust is from the earth, (and unto Whom ye will be gathered) in the Hereafter, and there He will reward each according to his works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل لمن أنكر قدرتنا على الحشر والنشر، والحساب والجزاء على جميع الأمور الواقعة في النشأة الأخرى { هُوَ } سبحانه العزيز الغالب، ذو القدرة والاختبار { ٱلَّذِي ذَرَأَكُمْ } أي: بثكم وبسطكم بمقتضى قدرته { فِي ٱلأَرْضِ } التي هي محل الكون والفساد، وكلفكم على الإيمان والأعمال، واختبركم بالأوامر والنواهي { وَ } كما أبدعكم أولاً بامتداد أظلاله، ورش نوره على مرآة العدم، أعادكم أيضاً بقبض أضلاله وأنواره إلى ذاته، فثبت أنكم { إِلَيْهِ تُحْشَرُونَ } [الملك: 24] للجزاء، فيجازيكم على مقتضى ما قترفتم من المأمورات الإلهية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل هو الذي ذرأكم في الأرض } أي: خلقكم وكثَّركم فيها { وإِليه تُحشرون } للجزاء لا إلى غيره، فتهيؤوا للقائه\n الإشارة: أَوَلَم يَرَوا إلى طيور أفكار العارفين فوقهم منزلةً ورفعة، صافاتٍ، تجول في ميادين الغيوب، ويقبضن عنانهن عكوفاً في الحضرة، وسكوناً في النظرة، ما يُمسِكُهن فيها إلاَّ الرحمن الذي مَنَّ عليهم برحمته، فأسكنهم فيها، إنه بكل شيء بصير، فيُبصر مَن توجه إليه ومَن لا، أمَّنْ هذا الذي هو جند لكم ينصركم على طريق السلوك، ويُبلغكم إلى حضرة مالك المَلوك، من دون الرحمن؟ إنِ الكافرون بهذا إلاّ في غرور، حيث حسبوا أنَّ وصولهم بحسب جهادهم وطاعتهم، أمَّن هذا الذي يرزقكم إمداد قلوبكم من العلوم والمعارف واليقين الكبير، إن أمسك رزقه فلم يتوجه إليكم إلاَّ القليل، بل لجُّوا في عُتو ونفور، أفمن يمشي مُكبًّا على وجهه، حيث رام سلوك الطريق بلا شيخ ولا دليل عارف، أهدى أمَّنْ يمشي سويًّا سالماً من الانحراف، على صراط مستقيم، تُوصله إلى حضرة العيان، وهو مَن سلك الطريق على يد الخبير، بل مَن سلكه على يد الخبير أهدى وأصوب، قل هو الذي أنشأكم وجعل لكم دلائل السلوك إلى معرفته، لتستدلوا عليه بالأدلة السمعية والعقلية، ثم تَتَرَقون إلى صريح معرفته، بسلوك الطريق على يد الخبير، قل هو الذي ذرأكم في أرض العبودية، وإليه تُحشرون بشهود عظمة الربوبية\n ثم سألوا عن وقت هذا الحشر، كما قال تعالى: { وَيَقُولُونَ مَتَىٰ هَـٰذَا ٱلْوَعْدُ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:79",
      "similarity": 0.9981562974370222
    },
    {
      "verse": "42:11",
      "similarity": 0.6959568004469955
    },
    {
      "verse": "16:13",
      "similarity": 0.6447525802183878
    },
    {
      "verse": "7:179",
      "similarity": 0.6106532585655021
    },
    {
      "verse": "6:136",
      "similarity": 0.4901957301073523
    }
  ]
}