{
  "chapter": "الملك",
  "text": "قل ارءيتم ان اهلكنى الله ومن معى او رحمنا فمن يجير الكفرين من عذاب اليم",
  "translations": [
    {
      "translation": "Say: 'What do you think? If Allah destroys me and those with me, or if He has mercy on us, who can shelter the kafirun from a painful punishment?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Just think: If God destroys me and those with me, or is benevolent to us, who will then protect the unbelievers from a painful doom?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them: “Did you ever consider: whether Allah destroys me and those that are with me, or shows mercy to us, who can protect the unbelievers from a grievous chastisement?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"Have you not considered that regardless whether God forgives me and my followers or grants us mercy, but who will protect the disbelievers from a painful torment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “What is your opinion –Allah may either destroy me and those with me, or have mercy on us – so who is such that will protect the disbelievers from the painful punishment?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Tell me! If Allah destroys me, and those with me, or He bestows His mercy on us - who can save the disbelievers from a painful torment\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Have you considered if Allah should destroy me and those with me-- rather He will have mercy on us; yet who will protect the unbelievers from a painful punishment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What think you? If God destroys me and those with me, or has mercy on us, then who will protect the unbelievers from a painful chastisement?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): Have ye thought: Whether Allah causeth me (Muhammad) and those with me to perish or hath mercy on us, still, who will protect the disbelievers from a painful doom?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Have you thought: if God destroys me and those who are with me, or treats us mercifully, then who will protect those who deny the truth from a painful chastisement?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: bethink ye if Allah destroy me and those with me; or have mercy on us, who will protect the infidels from a torment afflictive?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Tell me, whether Allah destroys me and those who are with me, or He has mercy on us, who will shelter the faithless from a painful punishment?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"See ye?- If Allah were to destroy me, and those with me, or if He bestows His Mercy on us,- yet who can deliver the Unbelievers from a grievous Penalty?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Tell me! If Allah destroys me, and those with me, or He bestows His Mercy on us, - who can save the disbelievers from a painful torment?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What do you think, if Allah destroys me and those with me, or has mercy upon us, who then will protect the unbelievers from the painful punishment'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Have you considered? Should God make me perish, and those with me; or else He bestows His mercy on us; who will protect the disbelievers from an agonizing torment?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"Have you considered: whether Allah should cause my death and those with me or have mercy upon us, who can protect the disbelievers from a painful punishment?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:28] Say: ‘Have you considered: If God destroys me and those with me, of believers, by His chastisement, as you would have it, or has mercy on us, and does not chastise us, who then will protect the disbelievers from a painful chastisement?’: in other words, they will have no protector from it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ أَرَأَيْتُمْ إِنْ أَهْلَكَنِيَ اللَّهُ وَمَنْ مَعِيَ أَوْ رَحِمَنَا فَمَنْ يُجِيرُ الْكَافِرِينَ مِنْ عَذَابٍ أَلِيمٍ (28)هذا تكرير ثان لفعل { قل هو الذي أنشأكم } \\[ الملك : 23 \\] .كان من بَذاءة المشركين أن يجهروا بتمني هلاك رسول الله صلى الله عليه وسلم وهلاك من معه من المسلمين ، وقد حكى القرآن عنهم { أم يقولون شاعر نتربص به ريب المنون } \\[ الطور : 30 \\] وحكى عن بعضهم { ويَتربص بكم الدوائر } \\[ التوبة : 98 \\] ، وكانوا يتآمرون على قتله ، قال تعالى : { وإذ يَمكر بك الذين كفروا ليُثبتوك أو يقتلوك } \\[ الأنفال : 30 \\] ، فأمره الله بأن يعرفهم حقيقةً تدحض أمانيَّهم ، وهي أن موت أحد أو حياته لا يغني عن غيره ما جرَه إليه عمله ، وقد جرَّت إليهم أعمالهم غضب الله ووعيده فهو نائلهم حَيي الرسول صلى الله عليه وسلم أو بادره المنون ، قال تعالى : { فإمَّا نذهبَنَّ بك فإنّا منهم منتقمون أو نُرينك الذي وعدناهم فإنا عليهم مقتدرون } \\[ الزخرف : 41 ، 42 \\] وقال : { وما جعلنا لبشر من قبلك الخلد أفإن مِتَّ فهُم الخالدون } \\[ الأنبياء : 34 \\] وقال : { إنك مَيت وإنهم ميتون } \\[ الزمر : 30 \\] أي المشركين ، وقد تكرر هذا المعنى وما يقاربه في القرآن ، وينسب إلى الشافعي :تمنَّى رجال أن أموت فإنْ أمت ... فتلكَ سبيل لستُ فيها بأوْحَدِفقد يكون نزول هذه الآيات السابقة صادف مقالة من مقالاتهم هذه فنزلت الآية في أثنائها وقد يكون نزولها لمناسبة حكاية قولهم : { متى هذا الوعد } \\[ الملك : 25 \\] بأن قارنه كلام بذيء مثل أن يقولوا : أبَعْدَ هلاكك يأتي الوَعْد .والإهلاك : الإِماتة ، ومقابلةُ { أهلكني } ب { رحِمنا } يدل على أن المراد : أو رحمنا بالحياة ، فيفيد أن الحياة رحمة ، وأن تأخير الأجل من النعم ، وإنما لم يؤخر الله أجل نبيئه صلى الله عليه وسلم مع أنه أشرف الرسل لحِكَم أرادها كما دلّ عليه قوله : «حياتي خيرٌ لكم وموْتي خيرٌ لكم» ، ولعلّ حكمة ذلك أن الله أكمل الدين الذي أراد إبلاغه فكان إكماله يوم الحج الأكبر من سنة ثلاث وعشرين من البعثة ، وكان استمرار نزول الوحي على النبي صلى الله عليه وسلم خصِّيصية خصّه الله بها من بين الأنبياء ، فلما أتم الله دينه ربا برسوله صلى الله عليه وسلم أن يبقى غير متصل بنزول الوحي فنقله الله إلى الاتصال بالرفيق الأعلى مباشرة بلا واسطة ، وقد أشارت إلى هذا سورة { إذا جاء نصر الله من قوله : { ورأيت الناس يدخلون في دين الله أفواجاً فسبح بحمد ربك واستغفره } \\[ النصر : 13 \\] . ولله درَ عبد بني الحسحاس في عبرته بقوله :رأيت لمنايا لم يدعْنَ محمداً ... ولا باقياً إلاَّ لَهْ الموتُ مُرْصَداًوقد عوضه الله تعالى بحياة أعلى وأجل ، إذ قال { ورفعنا لك ذكرك } \\[ الشرح : 4 \\] ، وبالحياة الأبدية العاجلة وهي أنه يَرُدُّ عليه روحَه الزكية كلَّما سلّم عليه أحد فيردّ عليه السلام كما ثبت بالحديث الصحيح .وإنما سمَّى الحياة رحمة له ولمن معه ، لأن في حياته نعمة له وللناس ما دام الله مقدراً حياته ، وحياة المؤمن رحمة لأنه تكثر له فيها بركة الإِيمان والأعمال الصالحة .والاستفهام في { أرأيتم } إنكاري أنكر اندفاعهم إلى أمنيات ورغائب لا يجتنون منها نفعاً ولكنها مما تمليه عليهم النفوس الخبيثة من الحقد والحسد .والرؤية علمية ، وفعلها معلق عن العمل فلذلك لم يرد بَعْدَه مفعولاه ، وهو معلق بالاستفهام الذي في جملة جواب الشرط ، فتقدير الكلام : أرأيتم أنفسكم ناجين من عذاب أليم إن هلكتُ وهلك من معي ، فهلاكنا لا يدفع عنكم العذاب المُعدّ للكافرين .وأُقحم الشرط بين فعل الرؤية وما سدّ مسد مفعوليه .والفاء في قوله : { فمن يأتيكم } \\[ الملك : 30 \\] رابطة لجواب الشرط لأنه لما وقع بعد ما أصلُه المبتدأ والخبرُ وهو المفعولان المقدّران رُجّح جانب الشرط .والمعية في قوله : { ومن معي } معية مجازية ، وهي الموافقة والمشاركة في الاعتقاد والدين ، كما في قوله تعالى : { محمد رسول الله والذين معه أشداء على الكفار } \\[ الفتح : 29 \\] الآية ، أي الذين آمنوا معه ، وقوله : { والذين ءامنوا معه نورهم يسعى بين أيديهم } \\[ التحريم : 8 \\] كما أطلقت على الموافقة في الرأي والفهم في قول أبي هريرة : «أنا مع ابن أخي» ، يعني موافق لأبي سلمة بن عبد الرحمان ، وذلك حين اختلف أبو سلمة وابن عباس في المتوفّى عنها الحامل إذا وضعتْ حملها قبل مضي عدة الوفاة .والاستفهام بقوله : { فمن يجير الكافرين } الخ إنكاري ، أي لا يجيرهم منه مجير ، أي أظننتم أن تجدوا مجيراً لكم إذا هَلَكنا فذلك متعذر فماذا ينفعكم هلاكنا .والعذاب المذكور هنا ما عبّر عنه بالوعد في الآية قبلها .وتنكير { عذاب } للتهويل .والمراد ب { الكافرين } جميع الكافرين فيشمل المخاطبين .والكلام بمنزلة التذييل ، وفيه حذف ، تقديره : من يجيركم من عذاب فإنكم كافرون ولا مجير للكافرين .وذُكر وصف { الكافرين } لما فيه من الإيماء إلى علة الحكم لأنه وصف إذا علق به حكم أفاد تعليل ما منه اشتقاق الوصف .وقرأ الجمهور بفتحة على ياء { أهلكنيَ } ، وقرأها حمزة بإسكان الياء .وقرأ الجمهور ياء { معيَ } بفتحة . وقرأها أبو بكر عن عاصم وحمزة والكسائي بسكون الياء .\n\n",
      "translations": [
        {
          "translation": "(Say (0 Muhammad): Have ye thought) people of Mecca: (Whether Allah causeth me (Muhammad) and those with me) among the believers (to perish) by chastising us (or hath mercy on us) by sparing us from the chastisement; he said: it is Allah Who has forgiven us such that He did not torment us; and it is Him Who has the power to show mercy towards us or destroy us, (still, who will protect the disbelievers from a painful doom?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل لمشركي مكة بعدما تطيروا بموتك\n وموت من معك من المؤمنين\n ليتخلصوا من شروركم: { أَرَأَيْتُمْ } أخبروني { إِنْ أَهْلَكَنِيَ ٱللَّهُ } العليم الحكيم بمقتضى قهره وجلاله { وَ } أهلك أيضاً { مَن مَّعِيَ } من المؤمنين { أَوْ رَحِمَنَا } بأن أخر آجالنا بمقتضى لطفه وجماله\n ونحن مؤمنون مخلصون له\n مقرّون بأنه الفاعل على الإطلاق بالإدارة والاختيار\n يفعل ما يشاء\n ويحكم ما يريد { فَمَن يُجِيرُ } وينقذ { ٱلْكَافِرِينَ } المنكرين على الله وإرادته\n واختياره وألوهيته مطلقاً { مِنْ عَذَابٍ أَلِيمٍ } [الملك: 28] نازل عليهم من لدنه سبحانه بشؤم ما اقترفوا من الكفر والعصيان\n وأنواع الفسوق والطغيان؟!\n\n{ قُلْ } لهم يا أكمل الرسل بعدما تمادى نزاعهم\n وتطاول جدالهم\n ولم تنفعهم الدعوة والتبليغ كلاماً خالياً عن وصمة المجادلة والمراء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فنحن في جوار رحمته متربصون إحدى الحسنيين { فمَن يُجير الكافرين من عذاب أليم } أي: لا يُنجيكم منه أحد\n متنا أو بَقينا\n ووضع \" الكافرين \" موضع ضميرهم للتسجيل عليهم بالكفر\n وتعليل نفي الإنجاء به\n أي: لا بد من لحوق العذاب لكفركم\n مُتنا أو بقينا\n فلا فائدة في دعائكم علينا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:88",
      "similarity": 0.7195230511658611
    },
    {
      "verse": "46:31",
      "similarity": 0.6851481598553206
    },
    {
      "verse": "9:6",
      "similarity": 0.6168789714021771
    },
    {
      "verse": "16:9",
      "similarity": 0.44843538055704485
    },
    {
      "verse": "72:22",
      "similarity": 0.43951230181896855
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/067028.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/067028.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/67:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}