{
  "chapter": "الملك",
  "text": "فلما راوه زلفة سيـت وجوه الذين كفروا۟ وقيل هذا الذى كنتم به تدعون",
  "translations": [
    {
      "translation": "When they see it right up close, the faces of those who are kafir will be appalled and they will be told, This is what you were calling for.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they realise it has come upon them, distraught will be the faces of unbelievers. They will be told: \"This is what you asked for.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they will see it near at hand, the faces of all those who had denied it will be distraught, and then they will be told: “This is the doom which you used to ask for.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they see the torment approaching, the faces of the disbelievers will blacken and they will be told, \"This is what you wanted to (experience)\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they will see it close, the faces of the disbelievers will become ghastly, and it will be declared, “This is what you were demanding.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they will see it approaching, the faces of those who disbelieve will be sad and grievous, and it will be said: \"This is what you were calling for!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they shall see it nigh, the faces of those who disbelieve shall be sorry, and it shall be said; This is that which you used to call for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they see it nigh at hand, the faces of the unbelievers will be vexed, and it will be said, 'This is what you were promised.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they see it nigh, the faces of those who disbelieve will be awry, and it will be said (unto them): This is that for which ye used to call.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they see it drawing near, the faces of those who deny the truth will turn gloomy and they will be told, \"This is what you were calling for.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they will behold it proximating sad will be the countenances of those who disbelieve, and it will be said: this is that which ye have been calling for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they see it brought near, the countenances of the faithless will be contorted, and [they will be] told, ‘This is what you were asking for!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At length, when they see it close at hand, grieved will be the faces of the Unbelievers, and it will be said (to them): \"This is (the promise fulfilled), which ye were calling for!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they will see it (the torment on the Day of Resurrection) approaching, the faces of those who disbelieve will be different (black, sad, and in grieve), and it will be said (to them): \"This is (the promise) which you were calling for!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they see it drawing near, the faces of the unbelievers will be blackened, and it is said: 'This is what you were promised'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they see it approaching, the faces of those who disbelieved will turn gloomy, and it will be said, “This is what you used to call for.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they see it approaching, the faces of those who disbelieve will be distressed, and it will be said, \"This is that for which you used to call.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:27] But when they see it, that is, the chastisement, after the gathering, near at hand, the faces of those who disbelieved will be awry, blackened, and it will be said, that is, the keepers [of Hell] will say to them: ‘This is that, chastisement, which, the warning of which, you used to make claims about’, [claims to the effect] that you would not be resurrected — this is the narration of a situation that will take place [in the future], and which has been expressed using the past tense in order to confirm that it will actually take place.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But when they see it) i.e. chastisement in the Fire (nigh) and it is said: with their own eyes, (the faces of those who disbelieve will be awry) due to the chastisement; and it is also said this means: the faces of the disbelievers will be burnt, (and it will be said (unto them): This) chastisement (is that for which ye used to call) in the life of the world; you used to say that it will never happen.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلَمَّا رَأَوْهُ زُلْفَةً } معناه معاينةٌ قريبةٌ\n\n\n\n\nوقوله تعالى: { وَقِيلَ هَـٰذَا ٱلَّذِي كُنتُم بِهِ تَدَّعُونَ } أي تُكَّذِبونَ وتَرِدُونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - {But when they saw it as a mirage} - means that they saw it close up.\n\n\nAnd the saying of Allah: {And this is what you were calling on} that is, you were disbelieving and you were wanting.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما تحقق وقوعه، وحل وقته { فَلَمَّا رَأَوْهُ } أي: العذاب الموعود في الآخرة { زُلْفَةً } قريباً منهم { سِيئَتْ وُجُوهُ ٱلَّذِينَ كَفَرُواْ } أي: استودت وقبحت من شدة الكآبة والحزن المفرط { وَقِيلَ } لهم حينئذٍ من قِبَل الحق: { هَـٰذَا } العذاب هو العذاب { ٱلَّذِي كُنتُم بِهِ تَدَّعُونَ } [الملك: 27] تطلبون وتستعجلون وقوعه مراءً واستهزاءً على سبيل التهكم، فالآن يلحقكم ما تنكرون به فيما مضى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فلما رَأَوه } أي: العذاب الموعود\n والفاء فصيحة مُعربة عن تقدير جملة، كأنه قيل: قد أتاهم الموعود فلما رأوه\n\n\n الخ، نزّل ما سيقع بمنزلة الواقع لتحقق وقوعه، و { زُلفةً }: حال من مفعول \" رَأَوه \" أي: قريباً منهم، وهو مصدر، أي: ذا زلفة، { سِيئَتْ } أي: تغيرت { وجوهُ الذين كفروا } بأن غشيها الكآبة ورهقها القَترُ والذلة\n ووضع الموصول موضع ضميرهم لذمهم بالكفر، وتعليل المساءة به\n { وقيل } توبيخاً لهم، وتشديداً لعذابهم: { هذا الذي كنتم به تَدَّعون } تطلبونه في الدنيا وتستعجلونه إنكاراً واستهزاءً، وهو \" تفتعلون \" من الدعاء، وقيل: من الدعوى، أي: تدعون ألاَّ بعث ولا حشر\n ورُوي عن مجاهد: أنَّ الموعود يوم بدر، وهو بعيد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:64",
      "similarity": 0.7923137761414986
    },
    {
      "verse": "81:13",
      "similarity": 0.7920453547050484
    },
    {
      "verse": "26:90",
      "similarity": 0.7853793363648652
    },
    {
      "verse": "50:31",
      "similarity": 0.7519854985405421
    },
    {
      "verse": "38:40",
      "similarity": 0.6344494129819422
    }
  ]
}