{
  "chapter": "الملك",
  "text": "قل هو الرحمن ءامنا به وعليه توكلنا فستعلمون من هو فى ضلل مبين",
  "translations": [
    {
      "translation": "Say: 'He is the All-Merciful. We have iman in Him and trust in Him. You will soon know who is clearly",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"He is the benevolent; in Him do we believe, and in Him do we place our trust. You will now realise who is in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them: “He is Merciful, and it is in Him that we believe, and it is in Him that we put all our trust. Soon will you know who is in manifest error.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"He is the Beneficent One in whom we have faith and trust. You will soon know who is in manifest error\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “He only is the Most Gracious – we have accepted faith in Him and have relied only upon Him; so you will now realise who is in open error.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"He is the Most Gracious, in Him we believe, and upon Him we rely. So, you will come to know who it is that is in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: He is the Beneficent Allah, we believe in Him and on Him do we rely, so you shall come to know who it is that is in clear error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'He is the All-merciful. We believe in Him, and in Him we put all our trust. Assuredly, you will soon, know who is in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: He is the Beneficent. In Him we believe and in Him we put our trust. And ye will soon know who it is that is in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"He is the Most Gracious: we believe in Him and we put our trust in Him. You will soon come to know who is in evident error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: He is the Compassionate; in Him we have believed, and in Him we have put our trust. -And anon ye will know who it is that is in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘He is the All-beneficent; we have faith in Him, and in Him do we trust. Soon you will know who is in manifest error.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"He is (Allah) Most Gracious: We have believed in Him, and on Him have we put our trust: So, soon will ye know which (of us) it is that is in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"He is the Most Beneficent (Allah), in Him we believe, and in Him we put our trust. So you will come to know who is it that is in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'He is the Merciful. In Him we believe and in Him we put all our trust. Indeed, you shall soon know who is in clear error'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “He is the Compassionate. We have faith in Him, and in Him we trust. Soon you will know who is in evident error.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"He is the Most Merciful; we have believed in Him, and upon Him we have relied. And you will [come to] know who it is that is in clear error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:29] Say: ‘He is the Compassionate One; we believe in Him, and in Him we put our trust. And assuredly you will [soon] know (sa-ta‘lamūna is also read sa-ya‘lamūna, ‘they will know’) upon seeing the chastisement with your own eyes, who is in manifest error’: is it us, or yourselves or them?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ هُوَ الرَّحْمَنُ آَمَنَّا بِهِ وَعَلَيْهِ تَوَكَّلْنَا فَسَتَعْلَمُونَ مَنْ هُوَ فِي ضَلَالٍ مُبِينٍ (29)هذا تكرير ثالث لفعل { قل } من قوله : { قل هو الذي أنشأكم } \\[ الملك : 23 \\] الآية .وجاء هذا الأمر بقول يقوله لهم بمناسبة قوله : { أو رحمنا } \\[ الملك : 28 \\] فإنه بعد أن سوَّى بين فرض إهلاك المسلمين وإحيائهم في أن أيّ الحالين فُرض لا يجيرهم معه أحد من العذاب ، أعقبه بأن المسلمين آمنوا بالرحمان ، فهم مظنة أن تتعلق بهم هذه الصفة فيرحمهم الله في الدنيا والآخرة ، فيعلم المشركون علم اليقين أيّ الفريقين في ضلال حين يرون أثر الرحمة على المسلمين وانتفاءه عن المشركين في الدنيا وخاصة في الآخرة .وضميرُ { هو } عائد إلى الله تعالى الواقع في الجملة قبله ، أي الله هو الذي وَصْفُه { الرحمان } فهو يرحمنا ، وأنكم أنكرتم هذا الاسم فأنتم أحرياء بأن تُحرَموا آثار رحمته . ونحن توكلنا عليه دون غيره وأنتم غرّكم عزّكم وجعلتم الأصنام معتمدكم ووكلاءكم .وبهذه التوطئة يقع الإيماء إلى الجانب المهتدي والجانب الضالّ من قوله : { فستعلمون من هو في ضلال مبين } لأنه يظهر بداءً تأمل أن الذين في ضلال مبين هم الذين جحدوا وصف { الرحمان } وتوكلوا على الأوثان .و { مَن } موصولة ، وما صْدَقُ { مَن } فريق مُبهم متردد بين فريقين تضمنهما قوله : { إن أهلكني الله ومَن معي } \\[ الملك : 28 \\] وقوله : { فمن يجير الكافرين } \\[ الملك : 28 \\] ، فأحد الفريقين فريق النبي صلى الله عليه وسلم ومن معه ، والآخر فريق الكافرين ، أي فستعلمون اتضاح الفريق الذي هو في ضلال مبين .وتقديم معمول { توكلنا } عليه لإفادة الاختصاص ، أي توكلنا عليه دون غيره تعريضاً بمخالفة حال المشركين إذ توكلوا على أصنامهم وأشركوها في التوكل مع الله ، أو نَسُوا التوكل على الله باشتغال فكرتهم بالتوجه إلى الْاصنام .وإنما لم يقدم معمول { آمنَّا } عليه فلم يقل : به آمنا لمُجرد الاهتمام إلى الإِخبار عن إيمانهم بالله لوقوعه عقب وصف الآخرين بالكفر في قوله : { فمن يجير الكافرين من عذاب أليم } \\[ الملك : 28 \\] فإن هذا جواب آخر عن تمنّيهم له الهلاك سُلك به طريق التبكيت ، أي هو الرحمان يجيرنا من سوء ترومونه لنا لأننا آمنا به ولم نكْفر به كما كفرتم ، فلم يكن المقصود في إيراده نفي الإِشراك وإثبات التوحيد ، إذ الكلام في الإِهلاك والإنجاء المعبّر عنه ب { رَحِمنَا } \\[ الملك : 28 \\] فجيء بجملة { ءامنا } على أصل مجرد معناها دون قصد الاختصاص ، بخلاف قوله : { وعليه توكلنا } لأن التوكل يقتضي منجياً وناصراً ، والمشركون متوكلون على أصنامهم وقوتهم وأموالهم ، فقيل : نحن لا نتكل على ما أنتم متكلون عليه ، بل على الرحمان وحده توكلنا .وفعل { فستعلمون } معلق عن العمل لمجيء الاستفهام بعده .وقرأ الجمهور { فستعلمون } بتاء الخطاب على أنه مما أمر بقوله الرسول صلى الله عليه وسلم وقرأه الكسائي بياء الغائب على أن يكون إخباراً من الله لرسوله بأنه سيعاقبهم عقاب الضالّين .\n\n",
      "translations": [
        {
          "translation": "Say) to them, Muhammad: (He is the Beneficent) Who will save us and show mercy towards us. (In Him we believe) truly (and in Him we put our trust) and we rely on Him. (And you will soon know) when the chastisement comes down (who it is that is in error manifest) who it is that is in manifest disbelief. 681\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n منبعثاً عن الحكمة والمصلحة: { هُوَ ٱلرَّحْمَـٰنُ } المستعان المستوي على عروش الأكوان بكمال الاستيلاء والاستحقاق { آمَنَّا بِهِ } مخلصين مستوثقين بحبل كرمه ووجوده { وَعَلَيْهِ } لا على غيره من الوسائل والأسباب العادية { تَوَكَّلْنَا } وفوَّضنا أمورمنا كلها بالعزيمة الخالصة الصادقة\n وأخذنا وكيلاً\n واعتقدناه حسيباً وكفيلاً { فَسَتَعْلَمُونَ مَنْ هُوَ فِي ضَلاَلٍ مُّبِينٍ } [الملك: 29] أنحن أم أنتم؟!\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل هو } أي: الذي أدعوكم إليه { الرحمن } مولى النعم كلها\n { آمَنَّا به } وحده لعِلْمنا ألاَّ راحم سواه\n { وعليه توكلنا } وحده لعِلْمنا أنَّ ما عداه كائناً ما كان بمعزل عن النفع والضر\n { فستعلمون } عن قريب { مَن هو في ضلالٍ مبينٍ } منا ومنكم\n { قل أرأيتم } أخبروني { إِن أصبحَ ماؤُكم غوراً } غائراً في الأرض بالكلية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "64:13",
      "similarity": 0.5917994933051967
    },
    {
      "verse": "27:79",
      "similarity": 0.5909471882875609
    },
    {
      "verse": "26:217",
      "similarity": 0.575434819696478
    },
    {
      "verse": "17:54",
      "similarity": 0.5625907234011037
    },
    {
      "verse": "39:41",
      "similarity": 0.5460990121423535
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/067029.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/067029.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/67:29.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}