{
  "chapter": "الملك",
  "text": "امن هذا الذى يرزقكم ان امسك رزقه بل لجوا۟ فى عتو ونفور",
  "translations": [
    {
      "translation": "Who is there who could provide for you if He withholds His provision? Yet still they obstinately persist in insolence and evasion.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is there to give you food in case He withholds His bounty? Yet they persist in rebellion and aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who shall provide for you if He withholds His sustenance? Nay; but they persist in rebellion and aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is there anyone who will provide you with sustenance if God were to deny you sustenance? In fact, they obstinately persist in their transgression and hatred.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or who is such that will give you sustenance if Allah stops His sustenance? In fact they persist in rebellion and hatred.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it that can provide for you if He should withhold His provision Nay, but they continue to be in pride, and flee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or who is it that will give you sustenance if He should withhold His sustenance? Nay! they persist in disdain and aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or who is this that shall provide for you if He withholds His provision? No, but they persist in disdain and aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or who is he that will provide for you if He should withhold His providence? Nay, but they are set in pride and frowardness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who can provide for you, if He withholds His provision? Yet they obstinately persist in rebellion and avoidance of the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he that can provide for you, should He withhold His provision? Aye! they persists in perverseness and aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is it that may provide for you if He withholds His provision? Indeed, they persist in defiance and aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or who is there that can provide you with Sustenance if He were to withhold His provision? Nay, they obstinately persist in insolent impiety and flight (from the Truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is he that can provide for you if He should withhold His provision? Nay, but they continue to be in pride, and (they) flee (from the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, who is it that shall provide for you if He withholds His provision? Yet they persist in arrogance and aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or who is this that will provide for you, if He withholds His provision? Yet they persist in defiance and aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or who is it that could provide for you if He withheld His provision? But they have persisted in insolence and aversion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:21]   Or who is it that will provide for you if He, the Compassionate One, withholds His provision?, that is to say, [if He withholds] the rain from you (the response to the conditional has been omitted, but is indicated by what preceded it, namely [the statement to the effect] ‘who will provide for you?’, and so [the response would be]: you have no provider other than Him. Nay, but they persist in disdain and aversion, moving away [further] from the truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "680 (Or who is he that will provide for you) i.e. rain from the sky and vegetation in the earth (if He should withhold His providence) who would give you provision if He withholds His? (Nay, but they are set in pride) refusing to accept faith (and frowardness) remoteness from faith.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِي عُتُوٍّ } معناه تَكبرٌ { وَنُفُورٍ } معناه تَولٍ عن الحَقِّ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"In {I'tuwwin}\" means {and arrogance}, \"and {Nufuwwir}\" means turning away from the truth.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمَّنْ هَـٰذَا } الرازق المتكفل لأرزاقكم { ٱلَّذِي يَرْزُقُكُمْ } ويسوق إليكم ما يسد رمقكم { إِنْ أَمْسَكَ } سبحانه { رِزْقَهُ } بإمساك المطر\n وسائر الأسباب والآلات التي تتوسلون بها إلى أرزقاكم\n هل لكم متمسك تتمسكون به\n وتثقون عليه سواه سبحانه أصلاً؟! كلا وحاشا\n ليس لكم إلاَّ هذا { بَل لَّجُّواْ } تمادوا وأصروا على اللجاج\n وصاروا دائماً { فِي عُتُوٍّ } لدد وعناد { وَنُفُورٍ } [الملك: 21] عن الحق وقبوله تعنتاً واستكباراً\n\n\nثمَّ قال سبحانه مستفهماً على سبيل التوبيخ: { أَ } يعتقدون الآثار الظاهرة في الأقطار من الوسائل والأسباب\n ولم ينسبوها إلى المؤثر المسبب لها المختار",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:75",
      "similarity": 0.5073955069733797
    },
    {
      "verse": "24:40",
      "similarity": 0.42114023037796616
    },
    {
      "verse": "27:44",
      "similarity": 0.32602374426328773
    },
    {
      "verse": "25:21",
      "similarity": 0.3217135726960057
    },
    {
      "verse": "51:44",
      "similarity": 0.30522170158291356
    }
  ]
}