{
  "chapter": "الملك",
  "text": "الذى خلق الموت والحيوة ليبلوكم ايكم احسن عملا وهو العزيز الغفور",
  "translations": [
    {
      "translation": "Who created death and life in order to try you to see who of you are best of deed. He is all-mighty and forgiving,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who created death and life that He might try you as to which of you is better in deed. He is the Most Mighty, the Most Forgiving;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has created death and life to put you to the test and see which of you is most virtuous in your deeds. He is Majestic and All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The One Who created death and life to test you – who among you has the better deeds; and He only is the Most Honourable, the Oft Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has created death and life that He may test you which of you is best in deed. And He is the Almighty, the Oft-Forgiving;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who created death and life that He may try you-- which of you is best in deeds; and He is the Mighty, the Forgiving,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who created death and life, that He might try you which of you is fairest in works; and He is the All-mighty, the All-forgiving --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hath created life and death that He may try you which of you is best in conduct; and He is the Mighty, the Forgiving,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created death and life so that He might test you, and find out which of you is best in conduct. He is the Mighty, the Most Forgiving One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hath created death and life that He might prove you, as to which of you is excellent in work. And He is the Mighty, the Forgiver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He, who created death and life that He may test you [to see] which of you is best in conduct. And He is the All-mighty, the All-forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He Who created Death and Life, that He may try which of you is best in deed: and He is the Exalted in Might, Oft-Forgiving;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has created death and life, that He may test you which of you is best in deed. And He is the All-Mighty, the Oft-Forgiving;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who created death and life that He might examine which of you is best in deeds, and He is the Almighty, the Forgiving,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who created death and life—to test you—as to which of you is better in conduct. He is the Almighty, the Forgiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[He] who created death and life to test you [as to] which of you is best in deed - and He is the Exalted in Might, the Forgiving -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:2] [He] Who created death, in this world, and life, in the Hereafter — or both of them in this world, since the sperm-drop is imbued with life, [life being] that [power] by which sensation becomes possible, death being the opposite of this or the non-existence of it — these being two [alternative] opinions; in the case of the latter [life in the Hereafter], ‘creation’ implies ‘ordainment’ — that He may try you, that He may test you in [this] life, [to see] which of you is best in conduct, [which of you] is most obedient to God, and He is the Mighty, in His vengeance against those who disobey Him, the Forgiving, to those who repent to Him;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who hath created life) resembling a white-and-black female horse which does not pass by, step on, or is smelled by a thing except that that thing becomes alive. This beast is smaller than a mule and bigger than an ass, one gallop can transport it as far as it can see. It is used as a means of travel by the prophets; (and death) resembling a ram whose wool is a mixture of white and black. This ram does not pass by, step on, or is smelled by, any thing except that that thing dies. It is also said that (He created death) means: He created the sperm drop; and (created life) means: He created the living being; (that He may try you) between life and death, (which of you is best in conduct) which of you is more sincere in works; (and He is the Mighty) in retribution against those who disbelieve in Him, (Forgiving) He forgives those who repent and believe in Him, 678\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلَّذِي خَلَقَ } وقدر { ٱلْمَوْتَ وَٱلْحَيَاةَ } بمقتضى قهره ولطفه، وأدارهما بينكم أيها المكلفون { لِيَبْلُوَكُمْ } ويختبركم { أَيُّكُمْ أَحْسَنُ عَمَلاً } وأصوبه وأصلحه، وأخلصه { وَ } إن لم تحسنوا العمل، ولم تصلحوه بعدما أمركم سبحانه بالإخلاص والإصلاح فقد ينتقم عنكم سبحانه بمقتضى غيرته؛ إذ { هُوَ ٱلْعَزِيزُ } الغالب القادر على وجوه الانتقام لمن خرج عن ربقة عبوديته { ٱلْغَفُورُ } [الملك: 2] المقتدر على وجوه الإنعام للمحسنين المخلصين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وتقديم الموت لأنه أدعى لأحسن العمل، الذي هو حكمة خلق الموت والحياة، المشار إليه بقوله: { ليبلوكم أَيُّكم أحسنُ عملا } أي: خلق موتكم الذي يعمّ الأمير والأسير، والحياة التي لا تبقى لعليل ولا طبيب، ليُعاملكم معالمة مَن يختبركم أيكم أحسن عملاً فيُجازيكم على مراتب متفاوتة، حسب طبقات علومكم وأعمالكم فإنَّ العمل غير مختص بالجوارح، ولذلك فسَّره صلى الله عليه وسلم بقوله:\n\n \" أيكم أحسن عقلاً، وأردع عن محارم الله، وأسرع في طاعة الله \" \n\n، وفي رواية:\n\n \" أيكم أحسن عقلاً، وأشدكم له خوفاً، وأحسنكم في أمره ونهيه نظراً، وإن كانوا أقلّكم تطوُّعاً \" \n\nوقال ابن عباس وغيره: أيكم أزهد في الدنيا\n قال القشيري: كيف تكونوا في الصبر في المحنة، والشكر عند المنّة\n وقال النسفي: { أيكم أحسن عملاً }: أخلصه وأصوبه، فالخالص: أن يكون لوجه الله، والصواب أن يكون على السُنَّة والمراد: أنه أعطاكم الحياة التي تقدرون بها على العمل، وسلّط عليكم الموت، الذي هو داعيكم إلى اختيار العمل الحسن على القبيح، فما وراءه إلاّ البعث والجزاء، الذي لا بدّ منه، ولمّا قدّم الموت ـ الذي هو أثر صفة القهر ـ على الحياة ـ التي هي أثر صفة اللطف ـ قدّم صفة القهر على صفة اللطف بقوله: { وهو العزيزُ }: الغالب، الذي لا يُعجزه مَن أساء العمل، { الغفور } الستور، الذي لاييأس منه أهل الإساءة والزلل\n\n\nهـ\n ثم استشهد على تمام قدرته بقوله: { الذي خلق سبعَ سمواتٍ طِباقاً } أي: متطابقة بعضها فوق بعض، من طباق النعلَ: أذا خصفها طبقاً على طبق، وهو مصدر وصف به، أو: ذات طباق، أو: طوبقت طباقاً\n وقوله تعالى: { ما ترى في خَلْقِ الرحمنِ من تفاوتٍ } صفة أخرى لسبع سموات، وضع فيها \" خَلْق الرحمن \" موضع الضمير للتعظيم، والإشعار بعلة الحكم، وبأنه تعالى خلقها بقدرته، رحمةً وتفضُّلاٍ، ولأنَّ في إبداعها نعماً جليلة\n أو: استئناف\n والخطاب للرسول صلى الله عليه وسلم، أو لكل أحدٍ يصلح للخطاب، و \" مِن \" لتأكيد النفي، أي: ما ترى فيه شيئاً من تفاوت، أي: اختلاف وعدم تناسب أو اضطراب\n وعن السدي: من عيْبٍ\n وحقيقة التفاوت: عدم التناسب، كأنّ بعضاً يفوت بعضاً\n وقرأ الأخوان: \" تَفَوُّت \" كالتعاهد والتعهّد والبناء لواحد",
      "translations": []
    }
  ]
}