{
  "chapter": "الملك",
  "text": "قل ارءيتم ان اصبح ماؤكم غورا فمن ياتيكم بماء معينۭ",
  "translations": [
    {
      "translation": "Say: 'What do you think? If, one morning, your water disappears into the earth who will bring you running water?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Just think: If your water were to dry up in the morning who will bring you water from a fresh, flowing stream?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them: “Did you even consider: if all the water that you have (in the wells) were to sink down into the depths of the earth, who will produce for you clear, flowing water?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Have you not thought that if your water was to dry up, who would bring you water from the spring?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “What is your opinion – if in the morning all your water were to sink into the earth, then who is such who can bring you water flowing before you?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Tell me! If (all) your water were to sink away, who then can supply you with flowing water\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Have you considered if your water should go down, who is it then that will bring you flowing water?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What think you? If in the morning your water should have vanished into the earth, then who would bring you running water?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Have ye thought: If (all) your water were to disappear into the earth, who then could bring you gushing water?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Have you considered if your water were to sink  into the ground, who could then bring you flowing water?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: bethink ye, were your water to be sunk away, who then could bring you water welling-up?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Tell me, should your water sink down [into the ground], who will bring you running water?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"See ye?- If your stream be some morning lost (in the underground earth), who then can supply you with clear-flowing water?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Tell me! If (all) your water were to be sunk away, who then can supply you with flowing (spring) water?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What do you think. If your water should sink into the earth in the morning, who then would bring you running water'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Have you considered? If your water drains away, who will bring you pure running water?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Have you considered: if your water was to become sunken [into the earth], then who could bring you flowing water?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:30]   Say: ‘Have you considered: If your water were to sink deep into the earth, who then will bring you running water?’, which hands and buckets would be able to reach, like [they do] your water: in other words, none but God, exalted be He, would be able to bring it, so how can you reject that He will resurrect you? It is commendable for one to say Allāhu rabbu’l-‘ālamīna, ‘God, Lord of the Worlds!’, after ma‘īn, ‘running water’, as is stated in a hadīth. This verse was recited before a certain tyrant who then replied, ‘Hatchets and pickaxes will bring it!’, whereupon the water of his eyes dried up and he became blind. We seek refuge with God against that we should be insolent towards Him or His verses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ أَرَأَيْتُمْ إِنْ أَصْبَحَ مَاؤُكُمْ غَوْرًا فَمَنْ يَأْتِيكُمْ بِمَاءٍ مَعِينٍ (30)إيماءٌ إلى أنهم يترقبهم عذاب الجوع بالقحط والجفاف فإن مكة قليلة المياه ولم تكن بها عيون ولا آبار قبل زمزم ، كما دل عليه خبر تعجب القافلة مِن ( جُرْهم ) التي مرّت بموضع مكة حين أسكنها إبراهيم عليه السلام هاجَر بابنه إسماعيل ففجَّر الله لها زمزم ولمحتْ القافلة الطير تحوم حول مكانها فقالوا : ما عهدنا بهذه الأرض ماء ، ثم حفَر ميمون بن خالد الحضرمي بأعلاها بئراً تسمى بئر ميمون في عهد الجاهلية قُبيل البعثة ، وكانت بها بئر أخرى تسمى الجَفْر ( بالجيم ) لبني تيم بن مُرة ، وبئر تسمى الجَم ذكرها ابن عطية وأهملها «القاموس» و«تاجه» ، ولعل هاتين البئرين الأخيرتين لم تكونا في عهد النبي صلى الله عليه وسلمفماء هذه الآبار هو الماء الذي أُنذروا بأنه يصبح غوراً ، وهذا الإِنذار نظير الواقع في سورة القلم ( 17 33 ) { إنا بلوناهم كما بلونا أصحاب الجنة } إلى قوله : لو كانوا يعلمون . !والغور : مصدر غارتْ البئر ، إذا نَزح ماؤها فلم تنله الدلاء .والمراد : مَاء البئر كما في قوله : { أو يصبح ماؤها غوراً } في ذكر جنة سورة الكهف ( 41 ) .وأصل الغور : ذهاب الماء في الأرض ، مصدر غار الماء إذا ذهب في الأرض ، والإِخبار به عن الماء من باب الوصف بالمصدر للمبالغة مثل : عَدل ورِضَى . والمعين : الظاهر على وجه الأرض ، والبئر المعينة : القريبة الماء على وجه التشبه .والاستفهام في قوله : فمن يأتيكم بماء } استفهام إنكاري ، أي لا يأتيكم أحد بماء مَعِين : أي غير الله واكتفي عن ذكره لظهوره من سياق الكلام ومن قوله قبله { أمَّن هذا الذي هو جند لكم ينصركم من دون الرحمان } \\[ الملك : 20 \\] الآيتين .وقد أصيبوا بقحط شديد بعد خروج النبي صلى الله عليه وسلم إلى المدينة وهو المشار إليه في سورة الدخان . ومن المعلوم أن انحباس المطر يتبعه غور مياه الآبار لأن استمدادها من الماء النازل على الأرض ، قال تعالى : { ألم تَر أن الله أنزل من السماء ماء فسلكه ينابيع في الأرض } \\[ الزمر : 21 \\] وقال : { وإنَّ من الحجارة لما يتفجر منه الأنهار وإنّ منها لما يشَّقّق فيخرج منه الماء } \\[ البقرة : 74 \\] .ومن النوادر المتعلقة بهذه الآية ما أشار إليه في «الكشاف» مع ما نقل عنه في «بيانه» ، قال : وعن بعض الشُطَّار ( هو محمد بن زكرياء الطبيب كما بينه المصنف فيما نقل عنه ) أنها ( أي هذه الآية ) تُليت عنده فقال : تجيء به ( أي الماء ) الفُؤوس والمَعاول ، فذهب ماء عينيه . نعوذ بالله من الجرأة على الله وعلى آياته . والله أعلم .\n\n",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (Have ye thought) people of Mecca: (If (all) your water) i.e. Zamzam (were to disappear into the earth) out of your reach, (who then could bring you gushing water) within your reach? It is also said that this means: who could bring you gushing water save the Creator of the whale and the pen'. And of the surah in which Nun is mentioned, which is all Meccan and consists of 52 verses, 300 words and 1,256 letters: Surah 68: The Pen (al-Qalam) And of the surah in which Nun is mentioned, which is all Meccan and consists of 52 verses, 300 words and 1,256 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قُلْ أَرَأَيْتُمْ إِنْ أَصْبَحَ مَآؤُكُمْ غَوْراً } معناه ذاهبٌ غائرٌ\n\n\n\n\nوقوله تعالى: { بِمَآءٍ مَّعِينٍ } معناه ظاهرٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"Say, 'Have you seen if your water becomes deep?'\" means that one is going to be searching.\n\n\nAnd His saying, \"With water, We bring life to the dead\" - this means that He gives life to those who are dead in a literal sense.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل للمنكرين بوجود الصانع الحكيم على سبيل التبكيت والإلزام: { أَرَأَيْتُمْ } أخبروني أيها المسرفون المكابرون { إِنْ أَصْبَحَ } أي: ظل وصار { مَآؤُكُمْ غَوْراً } غائراً إلى حيث لا يصل إليه السجال والدلاء بحبال وحيل { فَمَن يَأْتِيكُمْ بِمَآءٍ مَّعِينٍ } [الملك: 30] جارٍ هامرٍ\n سهل المأخذ سوى الله رب العالمين؟\n\n\nفكيف تنكرون وجوده\n مع أنكم مغمورون بسوابغ نعمه\n معترفون بسوابق كرمه؟!\n\nخاتمة السورة\n\nعليك أيها المحمدي المستمسك بعروة الشريعة المصطفوية التي لا عروة أوثق منها ولا جادة أقوم وأعدل أن تتشبث بها\n وتعمل بمقتضاها\n متوكلاً على الرحمن المستعان\n مفوضاً أمورك كلها إليه على وجه الإيقان\n معرضاً عن جنود أمارتك ومقتضياتها\n مجاهداً معها\n مخاصماً إياها حتى تصير مطمئنة راضية بما جرى عليها من القضاء\n صابرة على ما أصابها من البلوى إلى أن صارت فانية عن هوياتها الباطلة باقية بهوية الحق وبقائه\n\n\nجعلنا الله ممن فني فيه\n وبقي ببقائه بمنِّه وجوده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أو: لا تناله الدلاء { فمَن يأتيكم بماءٍ معين } جارٍ أو ظاهر سهل المأخذ\n يصل إليه مَن وصله؟\n وفي القاموس: ماء معيون ومعين: ظاهر\n هـ\n وقال مكي: ويجوز أن يكون معين \" فعيل \" من مَعَن الماء: كثر\n ويجوز أن يكون مفعولاً من العَين\n وأصله: معيون\n ثم أعل\n أي: فمَن يأتيكم بماء يُرى بالعين\n هـ\n مختصراً\n وقرئت الآية عند مُلحدٍ\n فقال: يأتي بالمعول والفؤوس\n فذهبت عيناه تلك الليلة وَعمِيَ\n وقيل: إنه محمد بن زكريا المتطبب\n أعاذنا الله من سوء الأدب مع كتابه\n\nقال ابن عرفة: ذكر ابن عطية في فضل السورة أربعة أحاديث\n وقد تقرّر أنَّ أحاديث الفضائل لم تصح إلاَّ أحاديث قليلة\n ليس هذا منها\n هـ\n وفي الموطأ: إنها تُجادل عن صاحبها\n الإشارة: ويقولون ـ أي: أهل الإنكار على المريدين ـ: متى هذا الوعد بالفتح إن كنتم صادقين في الوعد بالفتح على أهل التوجه؟ قل أيها العارف الداعي إلى الله: إنما العلمُ عند الله\n وإنما أنا نذير مبين\n أُنذر البقاء في غم الحجاب وسوء الحساب\n فلما رأوه ـ أي رأوا أثر الفتح على المتوجهين\n بظهور سيما العارفين على وجوههم\n ونبع الحِكَم من قلوبهم على ألسنتهم ـ زلفةً\n أي: قريباً\n سيئت وجوه الذين كفروا بطريق الخصوص\n وأنكروها ـ أي ساءهم ذلك حسداً أو ندماً\n وقيل هذا الذي كنتم به تَدَّعون\n أي: تدَّعون أنه لا يكون\n وأنه قد انقضى زمانه\n وأهل الإنكار لا محالة يتمنون هلاكَ أهل النِسبة\n فيُقال لهم: أرأيتم إن أهلكنا الله بالموت\n أو رَحِمَنا بالحياة\n فمَن يُجيركم أنتم من عذاب القطيعة والبُعد\n أي: هو لا حق لكم لا محالة\n متنا أو عشنا\n قل هو\n أي: الذي توجهنا إليه\n الرحمن وضمّنا إليه\n آمنّا به وعليه توكلنا في كفاية شروركم\n فستعلمون حين يُرفع المقربون في أعلى عليين\n ويسقط أهل الحجاب في الحضيض الأسفل من الجنة\n مَن هو اليوم في ضلال مبين\n قل أرأيتم إن أصبح ماؤكم ـ ماء حياة قلوبكم من الإيمان والتوحيد\n غَوْراً\n فمَن يأتيكم بماء معين؟ أي: فمَن يُظهره لكم\n ما يأتي به إلاَّ أهل العلم بالله\n والله تعالى أعلم\n وبالله التوفيق\n ولا حول ولا قوة إلاّ بالله\n وصلى الله على سيدنا محمد وآله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:41",
      "similarity": 0.6029752344300169
    },
    {
      "verse": "9:40",
      "similarity": 0.5174134030362185
    },
    {
      "verse": "9:57",
      "similarity": 0.258349143686016
    },
    {
      "verse": "54:12",
      "similarity": 0.15611042299402966
    },
    {
      "verse": "22:63",
      "similarity": 0.1447501231508287
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/067030.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/067030.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/67:30.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}