{
  "chapter": "الملك",
  "text": "الذى خلق سبع سموت طباقا ما ترى فى خلق الرحمن من تفوت فارجع البصر هل ترى من فطور",
  "translations": [
    {
      "translation": "He who created the seven heavens in layers. You will not find any flaw in the creation of the All-Merciful. Look again - do you see any gaps?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who created the seven skies one above the other. Do you see any disproportion in the creations of Ar-Rahman? Turn your eyes again. Do you see any fissures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who created the seven heavens one upon another. You will see no incongruity in the Merciful One's creation. Turn your vision again, can you see any flaw?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has created seven heavens, one above the other. You can see no flaw in the creation of the Beneficent God. Look again. Can you see faults?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The One Who created the seven heavens atop each other; do you see any discrepancy in the creation of the Most Gracious? Therefore lift your gaze – do you see any cracks?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has created the seven heavens one above the other; you can see no fault in the creation of the Most Gracious. Then look again. Can you see any rifts\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who created the seven heavens one above another; you see no incongruity in the creation of the Beneficent Allah; then look again, can you see any disorder?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who created seven heavens one upon another. Thou seest not in the creation of the All-merciful any imperfection. Return thy gaze; seest thou any fissure?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hath created seven heavens in harmony. Thou (Muhammad) canst see no fault in the Beneficent One's creation; then look again: Canst thou see any rifts?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created seven heavens one above the other in layers. You will not find any flaw in the creation of the Gracious One. Then look once again: can you see any flaw?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who hath created seven heavens in storeys. Thou shalt not behold in the Compassionates creation any over-sight; then repeat thy look, beholdest thou any crack?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He created seven heavens in layers. You do not see any discordance in the creation of the All-beneficent. Look again! Do you see any flaw?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He Who created the seven heavens one above another: No want of proportion wilt thou see in the Creation of (Allah) Most Gracious. So turn thy vision again: seest thou any flaw?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who has created the seven heavens one above another, you can see no fault in the creations of the Most Beneficent. Then look again: \"Can you see any rifts?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who created the seven heavens, one above the other. You cannot see any inconsistency in the creation of the Merciful. Return your gaze, do you see anycrack!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who created seven heavens in layers. You see no discrepancy in the creation of the Compassionate. Look again. Can you see any cracks?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[And] who created seven heavens in layers. You do not see in the creation of the Most Merciful any inconsistency. So return [your] vision [to the sky]; do you see any breaks?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:3] Who created seven heavens in layers, one above the other without any contact [between them]. You do not see in the Compassionate One’s creation, of these or of other things, any irregularity, any disparity or discordance. Then cast your eyes again, turn them toward the heaven: Do you see, in it, any fissure?, any   cracks or ruptures?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who hath created seven heavens in harmony) each one securely resting above the other, like a dome whose extremities are cemented with each other. (Thou) Muhammad (canst see no fault) no crookedness (in the Beneficent One's creation) in the creation of the heavens; (then look again) at the sky: (Canst thou see any rifts) cracks, cleaves, defects or faults?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قالَ: حدّثنا علي بن أحمد\n قالَ: حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { هَلْ تَرَىٰ مِن فُطُورٍ } معناه من صِدوعٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n He said: Ali ibn Ahmad narrated to us\n\n\nHe said: \"`Ata' ibn al-Sa'ib narrated to us from Abu Khalid from Zayd ibn `Ali, upon them both be peace, regarding the saying of Allah, {Do you see any flaw} its meaning is from fear.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الذي خلق سبع سماوات طباقاً } نهاية كمال عالم الملك في خلق السموات لا ترى أحكم خلقاً وأحسن نظاماً وطباقاً منها\n وأضاف خلقها إلى الرحمن لأنها من أصول النعم الظاهرة ومبادىء سائر النعم الدنيوية\n وسلب التفاوت عنها لبساطتها واستدارتها ومطابقة بعضها بعضاً وحسن انتظامها وتناسبها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وجعلها { طِبَاقاً } متطابقة بعضها فوق بعض\n جوف بعض\n وجعل تطبيقاتها ونظمها على وجه أحكم\n ونظام أبلغ\n حيث { مَّا تَرَىٰ } أيها الرائي { فِي خَلْقِ ٱلرَّحْمَـٰنِ } المستوي على عروش الأكوان { مِن تَفَاوُتٍ } ينبئ عن عدم رعاية الحكمة والمصلحة فيه\n بل كلها على مقتضى الحكمة المتقنة البالغة؟! فإن شككت أيها المعتبر الرائي فيها\n لقصور نظرك عن إحاطة ما فيها من الحكم والمصالح في بادئ الرأي { فَٱرْجِعِ ٱلْبَصَرَ } وتكرِّر النظر\n ثمَّ انظر { هَلْ تَرَىٰ } فيها { مِن فُطُورٍ } [الملك: 3] خلل وشقوق وقعت فيها\n لا على مقتضى الحكمة والإحكام؟\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فارجع البصرَ } أي: ردَّه إلى السماء\n حتى يصحَّ عندك ما أُخْبِرْت به معاينةً\n حتى لا يبقى شُبهة\n { هل ترى من فطورٍ } صدروع وشقوق\n جمع: فَطَر\n وهو الشقّ\n يقال: فطره فانفطر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "71:15",
      "similarity": 0.7167879443138996
    },
    {
      "verse": "84:19",
      "similarity": 0.6167855567559861
    },
    {
      "verse": "60:11",
      "similarity": 0.42423832057302546
    },
    {
      "verse": "34:51",
      "similarity": 0.38191497185040435
    },
    {
      "verse": "57:23",
      "similarity": 0.27440864890081684
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/67:3.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/67:3.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/67:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}