{
  "chapter": "الملك",
  "text": "ولقد زينا السماء الدنيا بمصبيح وجعلنها رجوما للشيطين واعتدنا لهم عذاب السعير",
  "translations": [
    {
      "translation": "We have adorned the lowest heaven with lamps and made some of them stones for the shaytans for whom We have prepared the punishment of the Blaze.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have adorned the lowest sky with lamps, and made them missiles against the devils, for whom We have prepared a torment of most intense fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have adorned the lower heaven with lamps, and have made them a means to drive away the satans. We have prepared for them the chastisement of the Blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have decked the lowest heavens with torches. With these torches We have stoned the devils and We have prepared for them the torment of hell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have beautified the lower heaven with lamps, and have made them weapons against the devils, and have kept prepared for them the punishment of the blazing fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have adorned the nearest heaven with lamps, and We have made such lamps (as) missiles to drive away the Shayatin, and have prepared for them the torment of the blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We have adorned this lower heaven with lamps and We have made these missiles for the Shaitans, and We have prepared for them the chastisement of burning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We adorned the lower heaven with lamps, and made them things to stone Satans; and We have prepared for them the chastisement of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily We have beautified the world's heaven with lamps, and We have made them missiles for the devils, and for them We have prepared the doom of flame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have adorned the lowest heaven with lamps, and We have made them for driving away devils. For them We have prepared the punishment of the blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have bedecked the nearest heaven with lamps, and We have made them missiles for satans: and for them We have gotten ready the torment of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have certainly adorned the lowest heaven with lamps, and made them [the means of pelting] missiles against the devils, and We have prepared for them a punishment of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we have, (from of old), adorned the lowest heaven with Lamps, and We have made such (Lamps) (as) missiles to drive away the Evil Ones, and have prepared for them the Penalty of the Blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have adorned the nearest heaven with lamps, and We have made such lamps (as) missiles to drive away the Shayatin (devils), and have prepared for them the torment of the blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have adorned the lower heaven with lamps, and We made them a stoning for the satans, We have prepared the punishment of the Blaze for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have adorned the lower heaven with lanterns, and made them missiles against the devils; and We have prepared for them the punishment of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have certainly beautified the nearest heaven with stars and have made [from] them what is thrown at the devils and have prepared for them the punishment of the Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:5] And verily We have adorned the lowest heaven, the one closest to the earth, with lamps, with stars, and made them missiles against the devils, should they [attempt to] listen by stealth, in which case a meteor of fire detaches itself from the star, just like a brand is taken from a fire, and either kills that jinn or deprives him of his senses: it is not that the star itself is displaced from its position; and We have prepared for them the chastisement of the Blaze, the ignited Fire.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And verily We have beatified the world's heaven) the first heaven (with lamps) with stars, (and We have made them) i.e. the stars (missiles for the devils) such that some of them become bewitched, some are killed while others are burnt, (and for them) for the devils (We have prepared) in the Hereafter (the doom of flame.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ومتانة حكمتنا: { لَقَدْ زَيَّنَّا ٱلسَّمَآءَ ٱلدُّنْيَا } أي: السماء المرئية من الدنيا { بِمَصَٰبِيحَ } أي: بكواكب كثيرة مضيئة\n منيرة في الليل كالسرج\n هي سبب رؤيتها\n وإلاَّ فلا ترى الأفلاك { وَ } من جملة اختباراتنا الواقعة بين عبادنا: إنَّا { جَعَلْنَٰهَا } أي: تلك المصابيح { رُجُوماً } أي: سبب ظنون وجهالات { لِّلشَّيَٰطِينِ } وهم المنجمون المرجفون الذين يرجمون بالغيب\n مستمسكين بها وبحركاتها وأوضاعها { وَ } بعدما أظللناهم بها في الدنيا { أَعْتَدْنَا لَهُمْ } في الآخرة { عَذَابَ ٱلسَّعِيرِ } [الملك: 5] أي: النار المسعرة جزاء ما اجترءوا على الله بدعوى الإطلاع على المغيبات\n مع أنه من الخصائص الإلهية\n وما ذلك إلاَّ من كفرهم بالله\n واسقلاله في مطلق تصرفاته الواقعة في ملكه وملكوته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم بيَّن حُسنها وبهجتها، فقال: { ولقد زيَّنا السماءَ الدنيا } أي: القُربى منكم { بمصابيحَ } أي: بكواكب مضيئة بالليل إضاءة السراج فيه، زينةً لسقف هذه الدار، من السيارة والثوابت، تتراءى كأنها كلها مركوزة فيها، مع أنَّ بعضها في سائر السموات، وما ذلك إلاَّ لأنَّ كل واحدة منها مخلوقة على نمط رائق، تحار في فهمه الأفكار، وطراز فائق تهيم في دركه الأنظار\n قال الفخر: وليس في هذه الآية ما يدل على أنَّ الكواكب مركوزة في سماء الدنيا، وذلك لأنَّ السموات إذا كانت شفافة فالكواكب سواء كانت في سماء الدنيا، أو في سماء أخرى فوقها، فهي لا بد أن تظهر في سماء الدنيا، وتلوح فيها، فعلى كِلا التقديرين فالسماء الدنيا مُزَيّنة بها\n\n\nهـ\n { وجعلناها رُجوماً للشياطين } أي: وجعلنا فيها فائدة أخرى، هي: رجم أعدائكم الذي يُخرجونكم من النور إلى الظلمات، بانقضاض الشُهب المقتَبسة منها، فيأخذ المَلك شعلة من نار الكوكب ويضرب بها الجني، فيقتله، أو يخبِّله فيرجع غُولاً يُفزع الناسَ، وأمّا الكواكب فلا تزول عن أماكنها لأنها قارّة في الفلك\n قال قتادة: خلق الله النجوم لثلاث: زينة السماء، ورجوماً للشياطين، وعلامات يهتدى بها، فمَن تأوّل فيها غير ذلك، فقد تكلّف ما لا علم له به\n { وأعتدنا لهم } للشياطين { عذابَ السعير } بعد الإحراق في الدنيا بالشُهب\n والله تعالى أعلم\n الإشارة: تبارك الذي بيده المُلك الملُك الظاهري والمُلك الباطني، يُعطيهما مَن يشاء، ويمنعهما مَن يشاء، فالمُلك الظاهري عز يفنى والملك الباطني عز يبقى، وهما ضدان لا يجتمعان في شخص واحد، ولا يتفقان بل أحدهما يغير من الآخر، والمراد بالملك الباطني: معرفة الشهود والعيان، فلا يناسبها إلاّ الخمول، ولا تقوم إلاّ به، ومهما ظهرت أخذ صاحبها وصدمته الحوافر\n الذي خلق الموتَ في بعض القلوب والأرواح، فكانت ميتة جاهلة ذليلة حقيرة، والحياةَ في بعضها، فكانت حيّة عارفة مالكة عزيزة، فعل ذلك ليبلوكم أيك أحسنُ عملاً بالإقبال على الله، والتوجٌّه بكليته إليه، أو بالإدبار عنه، والإعراض عن الداعي إليه\n وقيل: أحسن العمل: نيسان العمل ورؤية الفضل\n هـ\n والمراد: أنه يجتهد في العمل، ويغيب عنه، ومَن جعل الموتَ نُصب عينيه لا محالة يجتهد، ولله در القائل:\n\nوهو العزيز يُعز مَن أقبل عليه، والغفور لمَن رجع بعد الإعراض إليه\n الذي خلق سبعَ سموات الأرواح، وتقدّم قريباً تفسيرها، وعالم الأوراح في غاية الإتقان، ليس فيه خلل ولا تفاوت، ولقد زيَّنا السماء الدنيا\n قال القشيري: أراد بسماء الدنيا سماء القلب، لدنوه من سماء الروح، أي: زيّنا ونوّرنا سماء القلب بمصابيح العلم وأنوار الواردات القلبية، وسبحات الإلهامات الربانية، وجعلناها رجوماً للشياطين الخواطر النفاسية، والهواجس الظلمانية الشيطانية، وأعتدنا لتلك الخواطر عذابَ السعير، فيحترق بالخواطر الملكية والرحمانية\n هـ\n ثم ذكر وبال مَن كفر بعد هذا البيان العظيم، فقال: { وَلِلَّذِينَ كَفَرُواْ بِرَبِّهِمْ عَذَابُ جَهَنَّمَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "48:13",
      "similarity": 0.5913313476316333
    },
    {
      "verse": "25:11",
      "similarity": 0.5567662682704272
    },
    {
      "verse": "81:25",
      "similarity": 0.4816717194565509
    },
    {
      "verse": "15:17",
      "similarity": 0.446755706415259
    },
    {
      "verse": "15:34",
      "similarity": 0.4122208816964736
    }
  ]
}