{
  "chapter": "الملك",
  "text": "تكاد تميز من الغيظ كلما القى فيها فوج سالهم خزنتها الم ياتكم نذير",
  "translations": [
    {
      "translation": "It all but bursts with rage. Each time a group is flung into it its custodians will question them: 'Did no warner come to you?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As though it would burst with fury. Every time a crowd is thrown into it, its wardens will ask: \"Did no warner come to you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as though it will burst with rage. Every time a multitude is cast into it, its keepers will ask them: “Did no warner come to you?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It almost explodes in rage. Whenever a group is thrown into it, its keepers will ask them, \"Did no one come to warn you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As if about to explode with rage; whenever a group is thrown into it, the guardians of hell will ask them, “Did not a Herald of Warning come to you?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It almost bursts up with fury. Every time a group is cast therein, its keepers will ask: \"Did no warner come to you\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Almost bursting for fury. Whenever a group is cast into it, its keeper shall ask them: Did there not come to you a warner?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and wellnigh bursts asunder with rage. As often as a troop is cast into it, its keepers ask them, 'Came there no warner to you?';\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As it would burst with rage. Whenever a (fresh) host is flung therein the wardens thereof ask them: Came there unto you no warner?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as though bursting with rage. Each time a group is cast into it, its keepers will ask them, \"Did no warner come to you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Well-nigh it bursteth with rage. So oft as a company is cast thereinto, the keepers thereof will ask them: came there not Unto you a warner?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "almost exploding with rage. Whenever a group is thrown in it, its keepers will ask them, ‘Did not any warner come to you?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Almost bursting with fury: Every time a Group is cast therein, its Keepers will ask, \"Did no Warner come to you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It almost bursts up with fury. Every time a group is cast therein, its keeper will ask: \"Did no warner come to you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "nearly bursting apart out of rage. Every time a host is cast therein, its keepers will ask them: 'Did no one come to warn you'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It almost bursts with fury. Every time a batch is thrown into it, its keepers will ask them, “Has no warner come to you?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It almost bursts with rage. Every time a company is thrown into it, its keepers ask them, \"Did there not come to you a warner?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:8] almost exploding (tamayyazu: a variant reading has the original [form] tatamayyazu) ripped apart, with rage, in wrath against the disbelievers. Whenever a host, a group of them, is flung into it, its keepers ask them, an interrogation of rebuke: ‘Did there not come to you a warner?’, a messenger to warn you of God’s chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "As it would burst with rage) towards the disbelievers. (Whenever a (fresh) host) of disbelievers, i.e. the Jews, Christians, Magians and all other disbelievers (flung therein) in Gehenna (the wardens thereof) the wardens of Gehenna (ask them: Came there unto you no warner) a warning messenger?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كُلَّمَا أُلْقِيَ فِيهَا فَوْجٌ } معناه جَماعةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Whenever a group is cast into it} means a gathering.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن شدة غضبها وسخطها { تَكَادُ } وتقرب { تَمَيَّزُ } وتفترق أجزاؤها { مِنَ الغَيْظِ } المفرط { كُلَّمَا أُلْقِيَ فِيهَا فَوْجٌ } أي: جماعة وفرقة من المتفقين المجتمعين على ديدنة قبيحة، وخصلة خارجة عن مقتضى الحدود الإلهية { سَأَلَهُمْ خَزَنَتُهَآ } سؤال توبيخ وتقريع: { أَلَمْ يَأْتِكُمْ نَذِيرٌ } [الملك: 8] يخفوكم من هذا العذاب الهائل، مع أن سنة الله جرت على ألاَّ يدخل عباده فيها إلاَّ بعد الإنذار والتخويف\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { تكاد تميَّزُ } أي: تتميّز، يعني: تتقطّع وتتفرّق وينفصل بعضها من بعض { من الغيظ } وذلك حين تمد عنقها إليهم، لتستولي عليهم\n وغيظها حقيقة بالإدراك الذي خلقه الله فيها\n { كلما أُلْقِي فيها فوجٌ } جماعة من الكفار { سألهم خزنتُها } مالك وأعوانه من الزبانية توبيخاً لهم: { ألم يأتكم نذير } رسولٌ يُخوفكم من هذا العذاب الفظيع؟ { قالوا بلى قد جاءنا نذيرٌ } ، اعترفوا بعدل الله، وأنَّ الله أزاح عذرهم ببعث الرسل، وإنذارهم ما وقعوا فيه، تحسُّراً على ما فاتهم من السعادة وتمهيداً لِما وقع منهم من التفريط تندُّماً اغتماماً على ذلك، { فكذَّبنا } ذلك النذير في كونه نذيراً من جهته تعالى: { وقلنا ما نزَّل اللهُ من شيءٍ } مما يقولون من وعد ووعيد، وغير ذلك، { إِن أنتم إِلاَّ في ضلالٍ كبير } أي: قال الكفار للمنذِّرين: ما أنتم إلاّ في خطأ عظيم، بعيد عن الصواب\n وجمع ضمير الخطاب مع أنَّ مخاطب كل فوج نذيرُه لتغليبه على أمثاله، مبالغةً في التكذيب، وتمادياً في التضليل، كما ينبىء عنه تعميم المنزل مع ترك ذكر المنزل عليه، فإنه مُلوح لعمومه حتماً، أو: إقامة تكذيب الواحد مقام تكذيب الكل\n ويجوز أن يكون قوله: { إن أنتم إلا في ضلال كبير } من كلام الخزنة للكفار، على إرادة القول، ومرادهم بالضلال: الهلاك، أو: سمُّوا جزاء الضلال باسمه، كقوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:59",
      "similarity": 0.5124482945839328
    },
    {
      "verse": "110:2",
      "similarity": 0.43067840859495343
    },
    {
      "verse": "78:18",
      "similarity": 0.3962757581541435
    },
    {
      "verse": "3:179",
      "similarity": 0.38437055859666264
    },
    {
      "verse": "27:83",
      "similarity": 0.3535755941757034
    }
  ]
}