{
  "chapter": "الملك",
  "text": "قالوا۟ بلى قد جاءنا نذير فكذبنا وقلنا ما نزل الله من شىء ان انتم الا فى ضلل كبير",
  "translations": [
    {
      "translation": "They will say, 'Yes indeed, a warner did come to us but we denied him and said, \"Allah has sent nothing down. You are just greatly misguided.'\"",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they will answer: \"Surely; a warner came to us, but we denied him, and said: 'God did not send down any thing; you are greatly deluded, in fact.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: “Yes, a warner came to us, but we gave the lie to him and said: 'Allah has revealed nothing. You are surely in huge error.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"Yes, someone did come to warn us, but we rejected him saying, 'God has revealed nothing. You are in great error\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, “Yes, why not – indeed a Herald of Warning did come to us – in response we denied and said ‘Allah has not sent down anything – you are not except in a great error’.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Yes, indeed a warner did come to us, but we rejected him and said: `Allah never sent down anything; you are only in great error.\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say: Yea! indeed there came to us a warner, but we rejected (him) and said: Allah has not revealed anything, you are only in a great error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, 'Yes indeed, a warner came to us; but we cried lies, saying, \"God has not sent down anything; you are only in great error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: Yea, verily, a warner came unto us; but we denied and said: Allah hath naught revealed; ye are in naught but a great error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"Of course, a warner did come to us, but we belied him and we said, 'God has revealed nothing; you are in gross error.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: yea! surely there came a warner Unto us, but we belied, and said: God hath not sent down aught, are naught but in a great error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, ‘Yes, a warner did come to us, but we impugned [him] and said, ‘Allah did not send down anything; you are only in great error.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Yes indeed; a Warner did come to us, but we rejected him and said, 'Allah never sent down any (Message): ye are nothing but an egregious delusion!'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"Yes indeed; a warner did come to us, but we belied him and said: 'Allah never sent down anything (of revelation), you are only in great error.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yes, indeed' they will reply, 'but we belied the Warner (Messenger) saying: 'Allah has not sent down anything, you are but in great error'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, “Yes, a warner did come to us, but we disbelieved, and said, ‘God did not send down anything; you are very much mistaken.’”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say,\" Yes, a warner had come to us, but we denied and said, 'Allah has not sent down anything. You are not but in great error.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[67:9] They will say, ‘Yes, a warner did indeed come to us, but we denied and said, “God has not revealed anything; you are assuredly in great error”’: this [last words] may be the words of the angels [spoken] to the disbelievers when they are told of the denial, or they may belong to the words of the disbelievers [spoken] to the warners.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They say: Yea, verily, a warner) a warning messenger (came unto us; but we denied) the messengers (and said: Allah hath naught revealed) Allah has not revealed any Scripture nor has He sent any messenger to us; (ye are in naught) and we said to the messengers: you are in nothing (but a great error) ascribing partners to Allah; it is also said that the wardens of Gehenna will say to the disbelievers: when you were in the life of the world: you were in nothing but great error, i.e. idolatry.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالُواْ } حينئذٍ متسحرين: { بَلَىٰ قَدْ جَآءَنَا نَذِيرٌ } فأنذرنا عنها على أبلغ الوجوه { فَكَذَّبْنَا } النذير، وأفرطنا في تكذيبه إلى حيث نفينا الإنزال والإرسال مطلقاً، بل كفرنا بالحق وبحميع ما جاء به النبي النذير من عنده، ونسبنا دعواه إلى السفه والضلال { وَ } بالجملة: { قُلْنَا } له حين دعوته وادعائه نزول الكتاب: { مَا نَزَّلَ ٱللَّهُ مِن شَيْءٍ إِنْ أَنتُمْ } أي: ما أنتم أيها المدَّعون للرسالة { إِلاَّ فِي ضَلاَلٍ كَبِيرٍ } [الملك: 9] عظيم لا ضلال أعظم من ضلالكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:59",
      "similarity": 0.8036348703635136
    },
    {
      "verse": "40:50",
      "similarity": 0.6731626696394793
    },
    {
      "verse": "84:15",
      "similarity": 0.6364935048185847
    },
    {
      "verse": "36:81",
      "similarity": 0.5131194834450205
    },
    {
      "verse": "16:28",
      "similarity": 0.49491499066453926
    }
  ]
}