{
  "chapter": "القلم",
  "text": "انا بلونهم كما بلونا اصحب الجنة اذ اقسموا۟ ليصرمنها مصبحين",
  "translations": [
    {
      "translation": "We have tried them as We tried the owners of the garden when they swore that they would harvest in the",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have tried you as We tried the owners of the garden when they vowed to gather the fruits in the morning\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have put them [i.e., the Makkans] to test even as We put to test the owners of the orchard when they vowed that they would gather the fruit of their orchard in the morning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have tested them in the same way as we tested the dwellers of the garden (in Yemen) when they swore to pluck all the fruits of the garden in the morning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed tested them the way We had tested the owners of the garden when they swore that they would reap its harvest the next morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have tried them as We tried the People of the Garden, when they swore to pluck the fruits in the morning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We will try them as We tried the owners of the garden, when they swore that they would certainly cut off the produce in the morning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now We have tried them, even as We tried the owners of the garden when they swore they would pluck in the morning\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We have tried them as We tried the owners of the garden when they vowed that they would pluck its fruit next morning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have tried them as we tried the owners of a certain orchard, who vowed to harvest all its fruits the next morning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We have proved them even as We proved the fellows of a garden when they swarethat they would surely reap it in the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed we have tested them just as We tested the People of the Garden when they vowed they would gather its fruit at dawn,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We have tried them as We tried the People of the Garden, when they resolved to gather the fruits of the (garden) in the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have tried them as We tried the people of the garden, when they swore to pluck the fruits of the (garden) in the morning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have tried them as We tried the owners of the garden who had sworn that in the morning they would reap it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We tested them, as We tested the owners of the garden, when they vowed to harvest it in the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have tried them as We tried the companions of the garden, when they swore to cut its fruit in the [early] morning\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[68:17] Indeed We have tried them, We have tested the people of Mecca with drought and famine, just as We tried the owners of the garden, the orchard, when they vowed that they would pluck, [that] they would pick its fruits, in the morning, so that the poor folk would not notice them and so that they would not then have to give them of it that [portion] which their father used to give them of it by way of charity.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّا بَلَوْنَاهُمْ كَمَا بَلَوْنَا أَصْحَابَ الْجَنَّةِ إِذْ أَقْسَمُوا لَيَصْرِمُنَّهَا مُصْبِحِينَ (17) ضمير الغائيبن في قوله : { بلوناهم } يعود إلى المكذبين في قوله : { فلا تطع المكذبين } \\[ القلم : 8 \\] . والجملة مستأنفة استئنافاً ابتدائياً دَعت إليه مناسبة قوله : { أن كان ذا مال وبنين إذا تتلى عليه ءاياتُنا قال أساطير الأولين } \\[ القلم : 1415 \\] فإن الازدهاء والغرور بسعة الرزق المفضيين إلى الاستخفاف بدعوة الحق وإهمال النظر في كنهها ودلائلها قد أوقعا من قديم الزمان أصحابهما في بَطَر النعمة وإهمال الشكر فجَرَّ ذلك عليهم شر العواقب ، فضرب الله للمشركين مثلاً بحال أصحاب هذه الجَنة لعلهم يستفيقون من غفلتهم وغرورهم . كما ضرب المثل بقريب منه في سورة الكهف ، وضرب مثلاً بقارون في سورة القصص .والبلْوى حقيقتها : الاختبار وهي هنا تمثيل بحال المبتلَى في إرخاء الحبل له بالنعمة ليشكر أو يكفر ، فالبلوى المذكورة هنا بلوى بالخير فإن الله أمدّ أهل مكة بنعمة الأمن ، ونعمة الرزق ، وجعل الرزق يأتيهم من كل جهة ، ويسر لهم سبل التجارة في الآفاق بنعمة الإِيلاف برحلة الشتاء ورحلة الصيف ، فلما أكمل لهم النعمة بإرسال رسول منهم ليكمل لهم صلاح أحوالهم ويهديهم إلى ما فيه النعيم الدائم فدعاهم وذكرهم بنعم الله أعرضوا وطَغوا ولم يتوجهوا إلى النظر في النعم السالفة ولا في النعمة الكاملة التي أكمَلَتْ لهم النعم .ووجه المشابهة بين حالهم وحال أصحاب الجنّة المذكورة هنا هو الإِعراض عن طلب مرضاة الله وعن شكر نعمته .وهذا التمثيل تعريض بالتهديد بأن يلحقهم ما لحق أصحاب الجنة من البؤس بعد النعيم والقحط بعد الخصب ، وإن اختلف السبب في نوعه فقد اتحد جنسه . وقد حصل ذلك بعد سنين إذْ أخذهم الله بسبع سنين بعد هجرة النبي صلى الله عليه وسلم إلى المدينة .وهذه القصة المضروب بها المثل قصة معروفة بينهم وهي أنه كانت ببلد يقال له : ضَرَوان ( بضاد معجمة وراء وواو مفتوحات وألف ونون ) من بلاد اليمن بقرب صنعاء . وقيل : ضروان اسم هذه الجنة ، وكانت جنّة عظيمة غرسها رجل من أهل الصلاح والإيمان من أهل الكتاب قاله ابن عباس . ولم يبين من أي أهل الكتاب هو : أمِن اليهود أم من النصارى؟ فقيل : كان يهودياً ، أي لأن أهل اليمن كانوا تديّنوا باليهودية من عهد بلقيس كما قيل أو بعدها بِهجرة بعض جنود سليمان ، وكانت زكاة الثمار من شريعة التوراة كما في الإِصحاح السادس والعشرين من سفر اللاويين .وقال بعض المفسرين : كان أصحابُ هذه الجنة بعد عيسى بقليل ، أي قبل انتشار النصرانية في اليمن لأنها ما دخلت اليمن إلاّ بعد دخول الأحباش إلى اليمن في قصة القَليس وكان ذلك زمان عام الفيل . وعن عكرمة : كانوا من الحبشة كانت لأبيهم جنة وجعل في ثمرها حقاً للمساكين وكان يدخل معه المساكين ليأخذوا من ثمارها فكان يعيش منها اليتامى والأَرامل والمساكين وكان له ثلاثة بنين ، فلما توفي صاحب الجنة وصارت لأولاده أصبحوا ذوي ثروة وكانوا أشحة أو كان بعضهم شحيحاً وبعضهم دونه فتمالؤوا على حرمان اليتامى والمساكين والأَرامل وقالوا : لنغدون إلى الجنة في سدفة من الليل قبل انبلاج الصباح مثل وقت خروج الناس إلى جناتهم للجذاذ فلنجذنها قبل أن يأتي المساكين .فبيتوا ذلك وأقسموا أيماناً على ذلك ، ولعلهم أقسموا ليُلزموا أنفسهم بتنفيذ ما تداعَوا إليه . وهذا يقتضي أن بعضهم كان متردداً في موافقتهم على ما عَزموا عليه وأنهم ألجموه بالقسم وهذا الذي يلتئم مع قوله تعالى : { قال أوسطهم ألم أقل لكم لولا تسبحون } \\[ القلم : 28 \\] ، قيل كان يقول لهم : اتقوا الله واعدلوا عن خبث نيتكم من منع المساكين ، وذكرهم انتقام الله من المجرمين ، أي فغلبوه ومضَوا لما عزموا عليه ، ولعلهم أقسموا على أن يفعلوا وأقسموا عليه أن يفعل معهم ذلك فأقسم معهم أو وافقهم على ما أقسموا عليه ، ولهذا الاعتبار أسند القسم إلى جميع أصحاب الجنة .فلما جاءوا جنتهم وجدوها مسودّة قد أصَابها ما يشبه الاحتراق فلما رأوها بتلك الحالة علموا أن ذلك أصابهم دون غيرهم لعزمهم على قطع ما كان ينتفع به الضعفاء من قومهم وأنابوا إلى الله رجاء أن يعطيهم خيراً منها .قيل : كانت هذه الجنة من أعناب .والصرم : قطع الثمرة وجذاذها .ومعنى { مُصبحين } داخلين في الصباح أي في أوَائل الفجر .\n\n",
      "translations": [
        {
          "translation": "(Lo! we have tried them) We have tried the people of Mecca with death, captivity and defeat on the Day of Badr because they refrained from asking forgiveness and We tried them with hunger and drought for a period of seven years because the Prophet, Allah bless him and give peace, prayed against them on the Day of Badr (as We tried) with hunger and the burning of the gardens (the owners of the garden) the owners of the fields: the Banu Darwan (when they vowed) when they swore by Allah (they would pluck its fruit next morning) at the break of dawn.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّا بَلَوْنَاهُمْ } أي خَبَّرنَاهم { كَمَا بَلَوْنَآ أَصْحَابَ ٱلْجَنَّةِ } وهي بستانٌ باليمن بِقَريةٍ يُقالُ لَها ضَروانُ، بينها وبينَ صَنعاء ستةُ أميالٍ\n ويقالُ: عَشرَ ميلاً\n\n",
      "translations": [
        {
          "translation": "\nThe {We have put them to the test} mentioned here refers to the {We have put them to the test} as mentioned in the story of the people of the garden {as we put the people of paradise}. The garden is a garden in Yemen in a city called Darwan, six miles between it and Sana'a.\n\n\nIt is said that ten miles is a long way.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّا } بمقتضى قهرنا وانتقاما من أهل مكة { بَلَوْنَاهُمْ } أصبناهم وابتليناهم بالقحط سبع سنين\n لكفرانهم بنعمنا التي من معظمها: بعثة الرسول الذي هو أكمل الرسل منهم فكذبوه\n وأنكروا دينه وكتابه\n واستهزءوا به { كَمَا بَلَوْنَآ } وأصبنا { أَصْحَابَ ٱلْجَنَّةِ } التي اسمها ضروان\n كانت دون صنعاء بفرسخين لصالحٍ\n كان ينادي الفقراء وقت الصرام\n فلما مات قال بنوه: إن فعلنا ما كان يفعل أبونا لضاق علينا\n فإن المال قليل والعيال كثير\n وكان مال أبينا كثيراً وعياله قليلاً\n فحلفوا ليصرمنها مصبحين خيفةً من المساكين\n كما حكى عنهم سبحانه: { إِذْ أَقْسَمُواْ } يعني: أولاد الصالح وورثته { لَيَصْرِمُنَّهَا } وليقطعنها { مُصْبِحِينَ } [القلم: 17] داخلين في الصباح\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنَّا بلوناهم } أهل مكة\n أي: امتحنّاهم بالقحط والجوع\n حتى أكلوا الجِيفَ الرِّممَ\n بدعاء النبي صلى الله عليه سلم حيث قال:\n \" اللهم اشدُدْ وطأتَك على مُضَرَ\n واجعلها عليهم سِنينَ كسِني يوسفَ \" \n{ كما بلونا أصحابَ الجنةِ } \n وهم قوم من أهل الصلاة\n قيل: كانوا مؤمنين\n أهل كتاب\n بعد رفع عيسى عليه السلام وكانوا بـ \" ضرْوان \" على فراسخ من صنعاء اليمن\n قال ابن جزي: كانوا من بني إسرائيل\n هـ\n والجنة\n قال ابن عباس: هو بستان\n يقال له: الضّروان\n دون صنعاء بفرسخين\n يطؤه أهل الطريق\n كان غَرَسه رجل من أهل الصلاح\n فورثه ثلاثة بنين\n فإذا أصرموه كان للمساكين كل ما تعدّاه المنجل والقِطاف\n فإذا طرح من فوق النخل إلى البساط\n فكل شيء سقط عن البساط فهو للمساكين\n فكان أبوهم يتصدّق منها على المساكين\n فكان يعيش من ذلك في حياة أبيهم اليتامى والأرامل والمساكين\n وفي رواية: كان يأخذ قوت سنة\n ويتصدّق بالباقي\n وكان ينادي على الفقراء وقت الصرام\n فلما مات أبوهم قالوا: لقد قلَّ المال\n وكثر العيال\n فتحالفوا بينهم ليغدوا غدوة قبل خروج الناس\n ويصرمونه\n ولا يشعر المساكين\n وهو قوله تعالى: { إِذْ أقسَموا } حلفوا { لَيَصْرِمُنَّهَا مصبحين } ليقطفنّها داخلين في الصباح\n قبل انتشار الفقراء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "68:20",
      "similarity": 0.8915376642280397
    },
    {
      "verse": "68:22",
      "similarity": 0.7118875833269025
    },
    {
      "verse": "5:53",
      "similarity": 0.17443562462525547
    },
    {
      "verse": "15:90",
      "similarity": 0.15007798500835487
    },
    {
      "verse": "27:49",
      "similarity": 0.14019018943213854
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/068017.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/068017.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/68:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}