{
  "chapter": "القلم",
  "text": "سنسمه على الخرطوم",
  "translations": [
    {
      "translation": "We will brand him on the snout!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall brand him on the muzzle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon shall We brand him on his snout.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall brand him on his nose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will soon singe his pig-nose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall brand him on the snout (nose)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will brand him on the nose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall brand him upon the muzzle!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall brand him on the nose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon We will brand him on the nose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Anon We shall brand him on snout.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon We shall brand him on his snout.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon shall We brand (the beast) on the snout!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall brand him over the nose!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall mark him upon his nose!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will brand him on the muzzle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will brand him upon the snout.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[68:16] We shall brand him on the snout: We shall leave a distinguishing mark upon his nose, one by which he will be reviled for as long as he lives; and so his nose was chopped off by a sword at Badr.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We shall brand him on the nose) We shall hit him on the nose; and it is said this means: We shall hit him on the face; and it is also said this means: his face will be darkened. 683\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { سَنَسِمُهُ عَلَى ٱلْخُرْطُومِ } أي عَلَى الأَنفِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: لا تعطه يا أكمل الرسل، ولا تلتفت إلى ثروته وسيادته، فإنَّا بمقتضى قهرنا وجلالنا { سَنَسِمُهُ } ونُعلِّمه بالكيِّ { عَلَى ٱلْخُرْطُومِ } [القلم: 16] أي: أنفه، بحيث يعرف به في عرصات المحشر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { سَنَسِمُه على الخرطوم } سنعلِّمه على أنفه بالكي بالنار إهانةً له، وتخصيص الأنف بالذكر لأنَّ الوسم عليه أبشع، وقيل: خطم بالسيف يوم بدر، فبقيت سمة على خرطومه، وفيه نظر إذا قلنا هو الوليد، فإنه مات قبل بدر، لأنه من المستنصرين الخمسة، وقد ماتوا كلهم قبل وقعة بدر، وقيل: سنعلمه يوم القيامة بعلامة يُشوه بها من بين سائر الكفرة\n الإشارة: فستُبصر أيها العارف، والمتوجّه إلى الله، ويُبصر أهل الانتقاد من أهل الغفلة، أيكم المفتون، هل أنتم حين اجتمعت قلوبكم بالله، وجعلتم الهموم هَمًّا واحداً، فكفاكم الله همّ دنياكم، أو: هُم الذين تفرّقت قلوبهم، وتشعّبت همومهم، حتى ماتوا في أودية الفتن، فلم يُبالِ الله بهم في أيّ أودية الدنيا هلكوا، كما في الأثر\n\n\nإن ربك هو أعلم بمَن ضَلّ عن طريقه الموصلة إليه، وهو أعلم بالمهتدين إليها، السائرين فيها، حتى وصلوا إلى حضرة قدسه، فلا تُطع أيها المتوجّه المكذّبين لهذه الطريق، ودُّوا لو تلينون إليهم، وتشاركونهم فيما هم فيه من الحظوظ، فيميلون إليكم، طمعاً فيكم أن يصرفوكم عن طريق الجد والاجتهاد، ولا تُطع كل حلاّف مهين، قال القشيري: مّهين: هو الذي سقط من عيننا، فأقمناه بالبُعد عنا، همّاز مشاء بنميم، مُعذَّب بالوقيعة في أوليائنا\n هـ\n قال بعضهم: بُحث عن النمَّام فلم يوجد إلا ابن الزنا، واستدل بالآية في قوله: { بعد ذلك زنيم }\n وقوله تعالى: { منَّاعٍ للخير } ، وضده من أخلاق الصوفية، وهو أن يكون وصّالاً للخير لعباد الله، حسًّا ومعنىً، { معتد أثيم } وضده: كثير الإحسان والطاعة، { عُتل } وضده: سهل لين، { بعد ذلك زنيم } أي: لقيط، لا أب له، وكل مَن لا شيخ له يصلح للتربية فهو لقيط، لا أب له، فلا يصلح للاقتداء كما لا يؤم الناسَ ابنُ الزنا، وقوله تعالى: { أن كان ذا مال وبنين إِذا تُتلى عليه آياتنا قال\n\n\n } الخ\n أي: إنما حمله على التكذيب طغيانه بالمال، وهذه عادته تعالى: أنَّ المترفين لا ينالون من طريق السابقين شيئاً إلاَّ النادر\n والله تعالى أعلم\n ثم ضرب مثلاً لقريش، وقيل: لمَن كان ذا مال وبنين فلم ينفعوه، فدمّر الله عليهم كما فعل بأصحاب الجنة، فقال: { إِنَّا بَلَوْنَاهُمْ كَمَا بَلَوْنَآ أَصْحَابَ ٱلْجَنَّةِ }\n\n",
      "translations": []
    }
  ]
}