{
  "chapter": "القلم",
  "text": "انا بلونهم كما بلونا اصحب الجنة اذ اقسموا۟ ليصرمنها مصبحين",
  "translations": [
    {
      "translation": "We have tried them as We tried the owners of the garden when they swore that they would harvest in the",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have tried you as We tried the owners of the garden when they vowed to gather the fruits in the morning\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have put them [i.e., the Makkans] to test even as We put to test the owners of the orchard when they vowed that they would gather the fruit of their orchard in the morning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have tested them in the same way as we tested the dwellers of the garden (in Yemen) when they swore to pluck all the fruits of the garden in the morning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed tested them the way We had tested the owners of the garden when they swore that they would reap its harvest the next morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have tried them as We tried the People of the Garden, when they swore to pluck the fruits in the morning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We will try them as We tried the owners of the garden, when they swore that they would certainly cut off the produce in the morning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now We have tried them, even as We tried the owners of the garden when they swore they would pluck in the morning\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We have tried them as We tried the owners of the garden when they vowed that they would pluck its fruit next morning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have tried them as we tried the owners of a certain orchard, who vowed to harvest all its fruits the next morning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We have proved them even as We proved the fellows of a garden when they swarethat they would surely reap it in the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed we have tested them just as We tested the People of the Garden when they vowed they would gather its fruit at dawn,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We have tried them as We tried the People of the Garden, when they resolved to gather the fruits of the (garden) in the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have tried them as We tried the people of the garden, when they swore to pluck the fruits of the (garden) in the morning,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have tried them as We tried the owners of the garden who had sworn that in the morning they would reap it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We tested them, as We tested the owners of the garden, when they vowed to harvest it in the morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have tried them as We tried the companions of the garden, when they swore to cut its fruit in the [early] morning\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[68:17] Indeed We have tried them, We have tested the people of Mecca with drought and famine, just as We tried the owners of the garden, the orchard, when they vowed that they would pluck, [that] they would pick its fruits, in the morning, so that the poor folk would not notice them and so that they would not then have to give them of it that [portion] which their father used to give them of it by way of charity.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! we have tried them) We have tried the people of Mecca with death, captivity and defeat on the Day of Badr because they refrained from asking forgiveness and We tried them with hunger and drought for a period of seven years because the Prophet, Allah bless him and give peace, prayed against them on the Day of Badr (as We tried) with hunger and the burning of the gardens (the owners of the garden) the owners of the fields: the Banu Darwan (when they vowed) when they swore by Allah (they would pluck its fruit next morning) at the break of dawn.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّا بَلَوْنَاهُمْ } أي خَبَّرنَاهم { كَمَا بَلَوْنَآ أَصْحَابَ ٱلْجَنَّةِ } وهي بستانٌ باليمن بِقَريةٍ يُقالُ لَها ضَروانُ، بينها وبينَ صَنعاء ستةُ أميالٍ\n ويقالُ: عَشرَ ميلاً\n\n",
      "translations": [
        {
          "translation": "\nThe {We have put them to the test} mentioned here refers to the {We have put them to the test} as mentioned in the story of the people of the garden {as we put the people of paradise}. The garden is a garden in Yemen in a city called Darwan, six miles between it and Sana'a.\n\n\nIt is said that ten miles is a long way.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّا } بمقتضى قهرنا وانتقاما من أهل مكة { بَلَوْنَاهُمْ } أصبناهم وابتليناهم بالقحط سبع سنين؛ لكفرانهم بنعمنا التي من معظمها: بعثة الرسول الذي هو أكمل الرسل منهم فكذبوه، وأنكروا دينه وكتابه، واستهزءوا به { كَمَا بَلَوْنَآ } وأصبنا { أَصْحَابَ ٱلْجَنَّةِ } التي اسمها ضروان، كانت دون صنعاء بفرسخين لصالحٍ، كان ينادي الفقراء وقت الصرام، فلما مات قال بنوه: إن فعلنا ما كان يفعل أبونا لضاق علينا، فإن المال قليل والعيال كثير، وكان مال أبينا كثيراً وعياله قليلاً، فحلفوا ليصرمنها مصبحين خيفةً من المساكين، كما حكى عنهم سبحانه: { إِذْ أَقْسَمُواْ } يعني: أولاد الصالح وورثته { لَيَصْرِمُنَّهَا } وليقطعنها { مُصْبِحِينَ } [القلم: 17] داخلين في الصباح\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنَّا بلوناهم } أهل مكة، أي: امتحنّاهم بالقحط والجوع، حتى أكلوا الجِيفَ الرِّممَ، بدعاء النبي صلى الله عليه سلم حيث قال:\n\n \" اللهم اشدُدْ وطأتَك على مُضَرَ، واجعلها عليهم سِنينَ كسِني يوسفَ \" \n\n{ كما بلونا أصحابَ الجنةِ } ، وهم قوم من أهل الصلاة، قيل: كانوا مؤمنين، أهل كتاب، بعد رفع عيسى عليه السلام وكانوا بـ \" ضرْوان \" على فراسخ من صنعاء اليمن\n قال ابن جزي: كانوا من بني إسرائيل\n هـ\n والجنة، قال ابن عباس: هو بستان، يقال له: الضّروان، دون صنعاء بفرسخين، يطؤه أهل الطريق، كان غَرَسه رجل من أهل الصلاح، فورثه ثلاثة بنين، فإذا أصرموه كان للمساكين كل ما تعدّاه المنجل والقِطاف، فإذا طرح من فوق النخل إلى البساط، فكل شيء سقط عن البساط فهو للمساكين، فكان أبوهم يتصدّق منها على المساكين، فكان يعيش من ذلك في حياة أبيهم اليتامى والأرامل والمساكين، وفي رواية: كان يأخذ قوت سنة، ويتصدّق بالباقي، وكان ينادي على الفقراء وقت الصرام، فلما مات أبوهم قالوا: لقد قلَّ المال، وكثر العيال، فتحالفوا بينهم ليغدوا غدوة قبل خروج الناس، ويصرمونه، ولا يشعر المساكين، وهو قوله تعالى: { إِذْ أقسَموا } حلفوا { لَيَصْرِمُنَّهَا مصبحين } ليقطفنّها داخلين في الصباح، قبل انتشار الفقراء، { ولا يستثنون } لا يقولون إن شاء الله، وسمي استثناء، وإن كان شرطاً صورةً لأنه يؤدي مؤدّى الاستثناء لأنّ قولك: لأخرجنّ إن شاء الله، و: لا أخرج إلاّ أن يشاء الله، واحدٌ، أو: لا يستثنون حصة المساكين، كما كان يفعل أبوهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "68:20",
      "similarity": 0.8915376642280397
    },
    {
      "verse": "68:22",
      "similarity": 0.7118875833269025
    },
    {
      "verse": "5:53",
      "similarity": 0.17443562462525547
    },
    {
      "verse": "15:90",
      "similarity": 0.15007798500835487
    },
    {
      "verse": "27:49",
      "similarity": 0.14019018943213854
    }
  ]
}