{
  "chapter": "القلم",
  "text": "ن والقلم وما يسطرون",
  "translations": [
    {
      "translation": "Nun. By the Pen and what they write down!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "NUN. I CALL to witness the pen and what they inscribe,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nun. By the pen and what the scribes write.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nun. By the pen and by what you write,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nuun* – by oath of the pen and by oath of what is written by it. (Alphabet of the Arabic language; Allah and to whomever He reveals, know their precise meanings.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nun. By the pen and by what they Yastur.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noon. I swear by the pen and what the angels write,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nun. By the Pen, and what they inscribe,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nun. By the pen and that which they write (therewith),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nun. By the pen, and all that they write!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nun By the pen and by that which they inscribe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nun. By the Pen and what they write:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nun. By the Pen and the (Record) which (men) write,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nun. [These letters (Nun, etc.) are one of the miracles of the Quran, and none but Allah (Alone) knows their meanings]. By the pen and what the (angels) write (in the Records of men).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noon. By the Pen and that (the angels) write,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noon. By the pen, and by what they inscribe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nun. By the pen and what they inscribe,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[68:1] Nūn, one of the letters of the alphabet: God knows best what He means by it. By the Pen, with which He has inscribed [the records of] all creatures in the Preserved Tablet, and what they inscribe, that is, the angels, of good and righteousness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Nun): '(Nun) He says: Allah swears by the Nun, which is the whale that carries the earths on its back while in Water, and beneath which is the Bull and under the Bull is the Rock and under the Rock is the Dust and none knows what is under the Dust save Allah. The name of the whale is Liwash, and it is said its name is Lutiaya'; the name of the bull is Bahamut, and some say its name is Talhut or Liyona. The whale is in a sea called 'Adwad, and it is like a small bull in a huge sea. The sea is in a hollowed rock whereby there is 4,000 cracks, and from each crack water springs out to the earth. It is also said that Nun is one of the names of the Lord; it stands for the letter Nun in Allah's name al-Rahman (the Beneficent); and it is also said that a Nun is an inkwell. (By the pen) Allah swore by the pen. This pen is made of light and its height is equal to the distance between Heaven and earth. It is with this pen that the Wise Remembrance, i.e. the Guarded Tablet, was written. It is also said that the pen is one of the angels by whom Allah has sworn, (and that which they write (therewith)) and Allah also swore by what the angels write down of the works of the children of Adam,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السّائب عن أبي خالد عن زيد بن علي عليهما السّلامُ { [نۤ] وَٱلْقَلَمِ } النُّونُ: الدّواةُ والقَلَمُ: الذي يُكتبُ بِهِ\n\n\n\n\nوقوله تعالى: { وَمَا يَسْطُرُونَ } معناه ما يَكتُبونَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ن } هو النفس الكليّة { والقلم } هو العقل الكلي والأول من باب الكناية بالاكتفاء من الكلمة بأول حروفها، والثاني من باب التشبيه إذ تنتقش في النفس صور الموجودات بتأثير العقل كما تنتقش الصور في اللوح بالقلم { وما يَسْطرون } من صور الأشياء وماهياتها وأحوالها المقدّرة على ما يقع عليها، وفاعل ما يسطرون الكتبة من العقول المتوسطة والأرواح القدّسة وإن كان الكاتب في الحقيقة هو الله تعالى، لكن لما كان في حضرة الأسماء نسب إليها مجازاً، أقسم بهما وبما يصدر عنهما من مبادىء الوجود وصور التقدير الإلهي ومبدأ أمره ومخزن غيبه لشرفهما وكونهما مشتملين على كل الوجود في أول مرتبة التأثير والتأثر ومناسبتهما للمقسم عليه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ نۤ } أيها النبي النائب عن الحق، الناظر بنور الله، النقي عن جميع الرذائل والآثام المنافية لمرتبة النبوة والولاية { وَ } حق { ٱلْقَلَمِ } الأعلى { وَ } بحق { مَا يَسْطُرُونَ } [القلم: 1] ويكتبون بها الملأ الأعلى من الأسماء والصفات المأمورة بتصويرات الأشياء الكائنة في النشأة الأولى والأخرى حسب آثار الأوصاف والأسماء الإلهية التي لا تُعدّ ولا تُحصى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { نۤ } ، هو من جملة الرموز، كـ { ص } و { ق } ، وكأنه ـ والله أعلم ـ يُشير إلى ما خصّ به نبيَّه من أسرار النبوة والخلافة، أي: نبأناك ونبَّهناك ونوّبناك خليفة عنا، أو نوّهنا بك في مُلكنا وملكوتنا، أو: أيها النبي المفخّم، والرسول المعظّم، وحق نون والقلم ما أنت بمجنون\n وقيل: مختصر من نور وناصر ونصير، وقيل: من الرحمن، لكن ورد في الحديث:\n\n \" أول ما خلق اللهُ القلم، ثم خَلَقَ النون \" \n\n، وهو الدواة، وذلك قوله: { ن والقلم } فإن صَحّ الحديث فهو أولى في تفسير الآية، وقد رُوي عن ابن عباس وغيره، في تفسير الآية: أنه الدواة والقلم الذي بأيدي الناس، ورُوي عن ابن عباس أيضاً: أنه الحوت الأعظم، الذي عليه الأرضون السبع\n قال الكلبي ومقاتل: اسمه يهموت ـ بالياء ـ وقيل: ليُوثا، وقيل: باهوتا\n رُوي: أنّ الله تعالى لمّا خلق الأرض وفَتَقَها، بعث مِن تحت العرش ملكاً، فهبط إلى الأرض حتى دخل تحت الأرضين السبع، فوضعها على عاتقه، إحدى يديه بالمشرق، والأخرى بالمغرب، باسطتين، قابضتين على الأرضين السبع، فلم يكن لقدميه موضع قرار، فأهبط الله من الفردوس ثوراً، له أربعون ألف قرنٍ، وأربعون ألف قائمة، وجعل قرار قدم الملك على سنامه فلم تستقر قدماه، فأهبط الله ياقوتة خضراء من أعلى درجة في الفردوس، غلظها خمسمائة عام، فوضعها على سنام الثور إلى أذنه، فاستقرت قدما المَلك عليه، وقرون ذلك الثور خارجة من أقطار الأرض، ومنخاره في البحر، فهو يتنفس كل يوم نفساً، فإذا تنفّس مدَّ البحرُ، وإذا هدأ نَفَسُه جزرَ البحر، فلم يكن لقوائم الثور موضع قرار، فخلق الله صخرة خضراء، كغلظ سبع سموات وسبع أرضين، فاستقرت قوائم الثور عليها، وهي الصخرة التي قال لقمان لابنه:\n\n[لقمان:16] الآية، فلم تستقر الصخرة، فخلق الله نوناً ـ وهو الحوت العظيم ـ فوضع الصخرة على ظهره، وسائر جسده عارٍ، والحوت على البحر، والبحر على متن الريح، والريح على القدرة الأزلية، يُقلُّ الدنيا بما فيها حرفان \" كن فيكون \"\n هـ\n من الثعلبي، وهذا من باب عالَم الحكمة، وإلاّ فما ثَمَّ إلا تجليات الحق وأسرار الذات، والصفات الأزلية\n وتفسير { ن } بهذا الحوت ضعيف\n قال ابن جزي: ويُبطل قول مَن قال: إنه الحوت أو الدواة، بأنه لو كان كذلك لكان مُعرباً، ولَكَان في آخره تنوين، فكونه موقوفاً دليل على أنه حرف هجاء، نحو: { الـۤم } وغيره\n هـ\n ثم أقسم بالقلم، فقال: { والقلم وما يسطرون } ، قيل: هو القلم الذي كتب اللوح المحفوظ، فالضمير في { يسطرون } للملائكة، وقيل: القلم المعروف عند الناس، أقسم له بِما فيه من المنافع والحِكم\n\n\nقال ابن الهيثم: من جلالة القلم أنه لم يكتب الله كتاباً إلا به، ولذلك أقسم به\n الأقلام مطايا الفِطن ورسل الكرام، وقيل: البيان اثنان: بيان لسان، وبيان بَنَان، ومِن فضل بيان البنان أنَّ ما تبيَّنته الأقلام باق على الأيام، وبيان اللسان تدْرُسه الأعوام، ولبعض الحكماء: قِوام أمور الدين والدنيا: القلم، والسيف تحت القلم\n وأنشد بعضهم في هذا المعنى:\n\nوقال آخر:\n\nفالضمير في { يَسْطُرون } على هذا لبني آدم، فالضمير يعود على الكتبة المفهومة من القلم اللازمة له",
      "translations": []
    }
  ]
}