{
  "chapter": "القلم",
  "text": "افنجعل المسلمين كالمجرمين",
  "translations": [
    {
      "translation": "Would We make the Muslims the same as the evildoers?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should We treat those who submit and obey in the same way as those who are culpable?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Shall We treat those who have submitted (to Our command) like those who have acted as criminals?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We treat the Muslims like criminals?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We equate the Muslims to the guilty?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We then treat the Muslims like the criminals\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! shall We then make (that is, treat) those who submit as the guilty?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, shall we make those who have surrendered like to the sinners?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We then treat those who have surrendered as We treat the guilty?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should We treat the true believers and the wrongdoers alike?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We then make the Muslims like the culprits?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We treat those who submit [to Us] as [We treat] the guilty?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We then treat the People of Faith like the People of Sin?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We then treat the (submitting) Muslims like the Mujrimun (criminals, polytheists and disbelievers, etc.)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, shall We make those who are submissive like the wrongdoers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall We treat the Muslims like the villains?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then will We treat the Muslims like the criminals?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[68:35] Are We then to treat those who submit [to Us] as [We treat] the sinners?, that is to say, as belonging with them in terms of reward?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Utbah Ibn Rabi'ah said: \"if what Muhammad (pbuh) says to his Companions about Paradise and its bliss is true, we will surely be better than them in the Hereafter as we are better than them in the life of this world\", and so Allah revealed: (Shall We then treat those who have surrendered) shall We then make the reward of the Muslims in Paradise (as We treat the guilty) as the reward of the idolaters who are the owners of the Fire?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا كان الكفرة يقولون: إن صح أنَّا نُبعث كما يزعم محمد وأصحابه لم يفضلونها هناك أيضاً، بل نحن هناك أيضاً أحسن حالاً منهم كما في الدنيا، رد الله عليهم زعمهم هذا بقوله: { أَفَنَجْعَلُ } يعني: أيزعم الكفرة المفسدون المفرطون أنَّا نجعل { ٱلْمُسْلِمِينَ } المتصفين بالإيمان والأعمال الصالحة، المنزهين عن مطلق العصيان ولوازمه { كَٱلْمُجْرِمِينَ } [القلم: 35] الموصوفين بأنواع الجرائم والآثام الخارجة عن مقتضى الأحكام الإلهية الجارية على مقتضى الحكمة والعدالة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أفنجعلُ المسلمين كالمجرمين } ، تقرير لِما قبله من فوز المتقين بجنات النعيم، ورَدٌّ لما يقوله الكفرة عند سماعهم لحديث الآخرة، وما أعدّ للمسلمين، فإنهم كانوا يقولون: إن صحّ أنَّا نُبعث كما يزعم محمد ومَن معه، لم يكن حالنا وحالهم إلاَّ مثل ما هي في الدنيا، لم يزيدوا علينا، ولم يفضلونا، فرَدّ الله عليهم",
      "translations": []
    }
  ]
}