{
  "chapter": "القلم",
  "text": "ام لكم ايمن علينا بلغة الى يوم القيمة ان لكم لما تحكمون",
  "translations": [
    {
      "translation": "Or do you have oaths which bind Us, extending to the Day of Rising, that you will have whatever you decide?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have you taken a binding promise from Us which would hold till the Day of Judgement, that you will get whatever you demand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have We sworn a covenant with you which We are bound to keep till the Day of Resurrection, (a covenant requiring that whatever you ordain for yourselves shall be yours)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you have a covenant with Us which allows you to do whatever you want until the Day of Judgment?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or is it that you have a covenant from Us, right up to the Day of Judgement, that you will get all what you claim?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have you oaths from Us, lasting until the Day of Judgement, that yours will be what you judge\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have you received from Us an agreement confirmed by an oath extending to the day of resurrection that you shall surely have what you demand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have you oaths from Us, reaching to the Day of Resurrection? Surely you shall have whatever you judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have ye a covenant on oath from Us that reacheth to the Day of Judgment, that yours shall be all that ye ordain?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you have Our solemn oaths, binding upon Us till the Day of Resurrection, that you shall have whatever you yourselves decide?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have ye oaths from us reaching to the Day of Resurrection, that you shall be that which ye judge?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you have a pledge binding on Us until the Day of Resurrection, that you shall indeed have whatever you decide?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have ye Covenants with Us to oath, reaching to the Day of Judgment, (providing) that ye shall have whatever ye shall demand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or you have oaths from Us, reaching to the Day of Resurrection that yours will be what you judge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, have you an oath from Us that stretches to the Day of Resurrection (if so) you shall surely have what you judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you have oaths from Us, binding until the Day of Resurrection, that you will have whatever you demand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or do you have oaths [binding] upon Us, extending until the Day of Resurrection, that indeed for you is whatever you judge?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[68:39] Or do you have oaths, pledges, binding, secured, on Us until the Day of Resurrection (ilā yawmi’l-qiyāmati is semantically connected to ‘alaynā, ‘on Us’; these words [‘alaynā bālighatun, ‘binding on Us’] contain the sense of an oath [given], in other words, ‘Did We swear to you?’, the response to which is [what follows]) that you will indeed have whatever you decide?, to have for yourselves.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or have ye a covenant) pledges (on oath from Us) on firm oaths from Us (that reacheth to the Day of Judgement, that yours shall be all that ye ordain) that you shall have all that you judge for yourselves in Paradise in the Hereafter?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَمْ لَكُمْ أَيْمَانٌ } عهود ومواثيق مؤكدة لازمة { عَلَيْنَا بَالِغَةٌ إِلَىٰ يَوْمِ ٱلْقِيَامَةِ } مشتملة متضمنة لهذا { إِنَّ لَكُمْ لَمَا تَحْكُمُونَ } [القلم: 39] به علينا من أن الخير والكرامة لكم عند الله أكثر مما لنا؟!\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أم لكم أَيْمَانٌ علينا } أي: عهود مؤكدة بالأيمان { بالغةٌ } متناهية في التوكيد { إِلى يوم القيامة } متعلق بالمقدّر في { لكم } أي: ثابتة لكم إلى يوم القيامة، أو: بـ \" بالغة \" ، أي: تبلغ ذلك اليوم وتنتهي إليه، وافرة لم تبطل منها يمين، إلى أن يحصل المقسَم عليه من التحكيم، { إِنَّ لكم لَمَا تحكمون } به لأنفسكم، وهو جواب القسم، لأنَّ معنى { أم لكم أَيمان علينا }: أم أقسمنا لكم بأيمان مغلظة متناهية في التوكيد وقلنا والله إنَّ لكم لَمَا تحكمون { سَلْهُمْ } أي: المشركين، وهو تلوين للخطاب، وتوجيه له إلى رسول الله صلى الله عليه وسلم بإسقاطهم عن رتبة الخطاب، أي: سَلْهم مبكتاً لهم: { أَيُّهُم بذلك } الحكم { زعيمٌ } كفيل بأنه لا بد أن يكون ذلك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "69:45",
      "similarity": 0.4545245802397676
    },
    {
      "verse": "37:28",
      "similarity": 0.45181066975663686
    },
    {
      "verse": "36:17",
      "similarity": 0.43555437089643617
    },
    {
      "verse": "21:106",
      "similarity": 0.4321124345778257
    },
    {
      "verse": "16:82",
      "similarity": 0.42575694569805406
    }
  ]
}