{
  "chapter": "القلم",
  "text": "كذلك العذاب ولعذاب الءاخرة اكبر لو كانوا۟ يعلمون",
  "translations": [
    {
      "translation": "Such is the punishment. And the punishment of the Next World is much greater if they only knew.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Our chastisement; and the punishment of the Hereafter will be greater, if only they knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the chastisement; and the chastisement of the Hereafter is assuredly even greater, if only they knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the torment if only they knew that the torment in the life hereafter will certainly be greater.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the punishment; and indeed the punishment of the Hereafter is the greatest, if only they knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the punishment, but truly, the punishment of the Hereafter is greater if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the chastisement, and certainly the chastisement of the hereafter is greater, did they but know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the chastisement; and the chastisement of the world to come, is assuredly greater, did they but know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such was the punishment. And verily the punishment of the Hereafter is greater if they did but know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such was their punishment, [in this life]. But the punishment of the life to come is much more severe, if only they knew it!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the torment. And the torment of the Hereafter is far greater; if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such was their punishment; and the punishment of the Hereafter is surely greater, had they known.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the Punishment (in this life); but greater is the Punishment in the Hereafter,- if only they knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the punishment (in this life), but truly, the punishment of the Hereafter is greater, if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such was their punishment. But the punishment of the Everlasting Life is much greater, if they but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the punishment; but the punishment of the Hereafter is greater, if they only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the punishment [of this world]. And the punishment of the Hereafter is greater, if they only knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[68:33] Such, that is to say, like the chastisement for these [people], will be the chastisement, for those disbelievers of Mecca and others who contravene Our command; and the chastisement of the Hereafter is assuredly greater, did they but know, its chastisement, they would not have contavened Our command. When they said ‘If we are resurrected, we shall be given better than [what] you [have been given], the following was revealed:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Such was the punishment) in the life of the world for the one who refrains from giving Allah's due from his wealth, just as Allah burnt their garden and exposed them to hunger; it is also said that this means: such is the punishment of the life of the world as happened to the people of Mecca who were exposed to hunger and death. (And verily the punishment of the Hereafter) for he who does not repent (is greater) than the punishment of the life of the world (if they did but know) if the people of Mecca did but knew, but they do not know nor do they believe in this.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كَذَلِكَ ٱلْعَذَابُ } لمن خرج عن مقتضى الحدود الإليهة في الدنيا { وَ } الله { لَعَذَابُ ٱلآخِرَةِ } المعدة لأصحاب الغفلة عن الله { أَكْبَرُ } وأعظم بأضعافها وآلافها { لَوْ كَانُواْ يَعْلَمُونَ } [القلم: 33] ويعتقدون وقوعها لاحترزوا عمَّا يؤولهم إلى عذابها، ويوقعهم في وبالها ونكالها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "88:24",
      "similarity": 0.5220356564339836
    },
    {
      "verse": "74:3",
      "similarity": 0.38618498080124825
    },
    {
      "verse": "37:35",
      "similarity": 0.37757464631027665
    },
    {
      "verse": "20:23",
      "similarity": 0.36316261868598
    },
    {
      "verse": "39:26",
      "similarity": 0.35891521394565734
    }
  ]
}