{
  "chapter": "القلم",
  "text": "لولا ان تدركه نعمة من ربه لنبذ بالعراء وهو مذموم",
  "translations": [
    {
      "translation": "Had it not been for a favour from his Lord he would have been cast blame-worthy on a barren plain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "had his Lord not bestowed His favour upon him, he would have been cast upon that barren shore (and would have remained there) in disgrace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and who cried (for help) to his Lord, while imprisoned and helpless inside the fish. Had it not been for a favor from his Lord, he would have been left out in the open, deserving blame for his shortcomings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not for his Lord’s favour that reached him, he would have surely been cast onto the desolate land, reproached.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had not a grace from his Lord reached him, he would indeed have been (left in the stomach of the fish, but We forgave him), so he was cast off on the naked shore, while he was to be blamed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not that favor from his Lord had overtaken him, he would certainly have been cast down upon the naked Found while he was blamed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there not overtaken him a blessing from his Lord he would have been cast upon the wilderness, being condemned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been that favour from his Lord had reached him he surely had been cast into the wilderness while he was reprobate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had his Lord's grace not been bestowed upon him, he would have been cast away in disgrace upon that desolate shore.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had not grace from his Lord reached him, he had surely been cast into the wilderness in a plight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for a blessing that came to his rescue from his Lord, he would surely have been cast on the bare shore, being blameworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had not Grace from his Lord reached him, he would indeed have been cast off on the naked shore, in disgrace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had not a Grace from his Lord reached him, he would indeed have been (left in the stomach of the fish, but We forgave him), so he was cast off on the naked shore, while he was to be blamed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had the favor of his Lord not come upon him, he would have been blamed, cast upon the shore.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not for his Lord’s favor that reached him, he would have been thrown into the wilderness, fully despised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If not that a favor from his Lord overtook him, he would have been thrown onto the naked shore while he was censured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[68:49] Had it not been for a grace, a mercy, from his Lord that reached him, he would have surely been cast, out of the belly of the whale, onto a wilderness, a desolate land, while he was blameworthy — but he was shown mercy and was therefore cast out blameless.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Had it not been that favour) mercy (from his Lord had reached him he surely had been cast into the wilderness while he was reprobate) and guilty.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَنُبِذَ بِٱلْعَرَآءِ } معناه عَلَى وَجْهِ الأَرضِ ونُبِذَ: أَي أُلقِي\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَّوْلاَ أَن تَدَارَكَهُ } أدركته { نِعْمَةٌ مِّن رَّبِّهِ } يعني: لو لم يوفقه سبحانه على نعمة التوبة، والإنابة والرجوع إليه على وجه الإخلاص والندامة { لَنُبِذَ } وطرح ألبتة { بِٱلْعَرَآءِ } أي: الأرض الخالية عن الشجر { وَهُوَ } حينئذٍ { مَذْمُومٌ } [القلم: 49] مليم مطرود من الرحمة والكرامة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والجملة حال من ضمير \" نادى \" وعليه يدور النهي، لا على النداءِ فإنه أمر مستحسن، ولذلك لم يذكر المنادَى، و \" إذ \" منصوب بمضاف محذوف، أي: لا يكن حالك كحاله وقت ندائه، أي: لا يوجد منك ما وُجد منه من الضجر والمغاضبة فتُبتلى ببلائه، { لولا أن تدارَكه نعمةٌ } رحمة { من ربه } أي: لولا أنَّ الله أنعم عليه بإجابة دعائه، وقبول عذره، أو: لتوفيقه للتوبة وقبولها منه، { لنُبذ بالعراءِ } بالأرض الخالية من الأشجار { وهو مذموم } معاتَب بعجلته، لكنه رُحم، فنُبذ غير مذموم، بل مَرْضِي مقبول\n\n",
      "translations": []
    }
  ]
}