{
  "chapter": "القلم",
  "text": "خشعة ابصرهم ترهقهم ذلة وقد كانوا۟ يدعون الى السجود وهم سلمون",
  "translations": [
    {
      "translation": "Their eyes will be downcast, darkened by debasement; for they were called on to prostrate when they were in full possession of their faculties.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lowered will be their eyes, disgrace overwhelming them. They had indeed been called to bow in homage when they were free of blame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their eyes shall be downcast and ignominy shall overwhelm them. For when they were safe and sound, they were summoned to prostrate themselves, (and they refused).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their eyes will be lowered and disgrace will cover them. They had certainly been told to prostrate themselves before God when they were safe and sound.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With lowered eyes, disgrace overcoming them; and indeed they used to be called to prostrate themselves whilst they were healthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their eyes will be cast down and ignominy will cover them; they used to be called to prostrate themselves, while they were.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their looks cast down, abasement shall overtake them; and they were called upon to make obeisance indeed while yet they were safe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "humbled shall be their eyes, and abasement shall overspread them, for they had been summoned to bow themselves while they were whole.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With eyes downcast, abasement stupefying them. And they had been summoned to prostrate themselves while they were yet unhurt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their eyes will be cast down and they will be covered in shame; they were bidden to prostrate themselves, when they were safe and sound [but they did not obey].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Downcast will be their looks; abjectness will overspread them. Surely they had been called upon to Prostrate themselves while yet they were whole.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With a humbled look [in their eyes], they will be overcast by abasement. Certainly, they were summoned to prostrate themselves while they were yet sound.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their eyes will be cast down,- ignominy will cover them; seeing that they had been summoned aforetime to bow in adoration, while they were whole, (and had refused).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their eyes will be cast down, ignominy will cover them; they used to be called to prostrate (offer prayers), while they were healthy and good (in the life of the world, but they did not).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their eyes will be humbled, and humiliation shall spread over them for they were already ordered to prostrate themselves when they were undiminished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their eyes subdued, shame will cover them. They were invited to bow down when they were sound.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their eyes humbled, humiliation will cover them. And they used to be invited to prostration while they were sound.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[68:43] With humbled (khāshi‘atan is a circumstantial qualifier referring to the person [of the verb] yud‘awna, ‘they are summoned’) that is to say, with abject, gazes, which they do not raise, they will be overcast, enveloped, by abasement; for they had indeed been summoned, in this world, to prostrate themselves while they were yet sound, but they never used to do it, by the fact that they never performed prayer.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(With eyes downcast) not able to see any good, (abasement stupefying them) humiliation and darkness appear on their faces. (And they had been summoned) in the life of the world (to prostrate themselves) to submit themselves through the profession of Allah's divine Oneness but did not submit to Allah's divine Oneness (while they were yet unhurt) while they were strong and sound of bodies.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تَرْهَقُهُمْ } معناه تَغشَاهُم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"They shall be overwhelmed by it\" - this means that it will envelop them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبل صاروا { خَٰشِعَةً } ذليلة حاسرة { أَبْصَٰرُهُمْ } هائمة عقولهم، وبالجملة: { تَرْهَقُهُمْ } وتلحقهم { ذِلَّةٌ } محيطة بجميع جوانبهم { وَ } كيف لا يكونون كذلك يومئذٍ؛ إذ هم { قَدْ كَانُواْ } في نشأة الاخيتار { يُدْعَوْنَ إِلَى ٱلسُّجُودِ } حينئذٍ { وَهُمْ سَٰلِمُونَ } [القلم: 43] متمكنون قادرون عليه، فلم يفعلوا عناداً ومكابرةً؟! فالآن قد انقضى وقت الاعتبار، فلا ينفعهم التذلل والانكسار سواء قدروا أو لم يقدروا\n\n\n\n\nوبعدما بالغ المنكرون المكذِّبون في قدح القرآ، وطعنه، وأصروا على العناد والاستكبار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ خاشعةً أبصارُهم } أي: ذليلة، حال من الضمير في \" يُدْعَون \" ، أي: يُدعون في حال خشوع أبصارهم، ونسبة الخشوع إلى الأبصار لظهور أثره فيها، { تَرْهَقهم } أي: تلحقهم وتغشاهم { ذلَّةٌ } شديدة، { وقد كانوا } في الدنيا { يُدْعَون } على ألسنة الرسل { إِلى السجود } ، والأصل: إليه، وإنما أظهر لزيادة التقرير، أو: لأنَّ المراد به الصلاة بما فيها من السجود، والدعوة دعوة تكليف، { وهم سالِمون } متمكنون منه أقوى تمكُّن، فلا يُجيبون إليه ويأبونه، وإنما لم يذكره معه لظهوره\n الإشارة: إنَّ للمتقين ما سوى الله عند ربهم في حضرة قدسه، جناتِ النعيم، وهي جنات المعارف في نعيم دوام الشهود والرؤية، أفنجعل المسلمين المنقادين لأحكامنا القهرية والتكليفية، كالمجرمين العاصين، ثم وبَّخ مَن سوَّى بينهم وطالبه بالحجة\n وقوله تعالى: { يوم يُكشف عن ساق } أي: يوم يتجلّى لعباده بنور من نور ذاته، على صورة آدم، تشريفاً لهذا الآدمي، وفي الحديث:\n\n \" إن الله خلق آدم على صورته \" \n\nأي: على صورته التي يتجلّى بها لعباده في المحشر وفي الجنة، ولا يفهم هذا إلاَّ الغواصون في بحر الأحدية، وحسْب مَن لم يبلغ مقامهم التسليم ونفي التشبيه، فالعارفون يعرفون الله في جميع تجلياته، ولا ينكرونه في شيء منها، وأمّا ما ورد في حديث التجلِّي الأول لأهل المحشر فيُنكرونه، ويقولون: \" حتى يأتينا ربنا \" ، فإنما يقول ذلك علماء الظاهر، أهل الدليل، وأما العارفون فقد عرفوه وأقرُّوه، وسكتوا ستراً للسر الذي عرّفهم به، ولذلك كتب ابن العربي الحاتمي إلى الفخر الرازي فقال: تعال نعرِّفك بالله اليوم، قبل أن يتجلّى لك يوم القيامة، فتُنكره فيمن يُنكره\n هـ\n وقال الورتجبي: أخبر الله سبحانه أنه يكشف يوم الشهود لعشاقه وأحبابه ومُشتاقيه وعُرفائه عن بعض صفاته الخاصة، ويتجلّى منها لهم، وهو كشف في ستر الغَيرة عن أسرار القِدَم، فيُشاهدونها، فيُدعَون إلى السجود من حيث غشيتهم أنوار العظمة، حتى لا يحرقوا في كَشفِ سر الصفة فإنها موضع العظمة والكبرياء، وبُدُوّ لطائف أنوار أسرار الذات تظهر في لباس الالتباس، حتى لا يفنيهم فناء لا بقاء بعده، والمقصود منه زوائد المحبة، والنظر إلى وجود العظمة\n هـ\n قلت: وحاصل كلامه: أنّ الحق تعالى إنما تجلّى لعباده في الصورة الآدمية، حتى كشف عن ساقه غِيرةَ على سر الربوبية أن يظهر، وهو المراد بقوله: يكشف لعشاقه عن بعض صفاته، ويتجلى منها ـ أي: من تلك الصورة ـ لهم، وهو كشف في ستر الغيرة\n وأيضاً: لو كشف لهم عن أسرار جبروته بلا واسطة لاحترقوا، لكن تجلّى بأنوار صفاته ليطيقوا رؤيته، يظهر لهم في لباس الالتباس، وهو إظهار الصورة الآدمية، ليبقوا بين فناء وبقاء، بين سكر وصحو، ولو تجلّى بأسرار ذاته الأصلية لاحترقوا، أو سكروا بلا صحو، وفنوا بلا بقاء\n والله تعالى أعلم\n ثم ذكر استدراجه للكفرة، فقال: { فَذَرْنِي وَمَن يُكَذِّبُ بِهَـٰذَا ٱلْحَدِيثِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:44",
      "similarity": 0.9103094102692534
    },
    {
      "verse": "72:6",
      "similarity": 0.4529009165496995
    },
    {
      "verse": "79:9",
      "similarity": 0.4439036152195612
    },
    {
      "verse": "10:26",
      "similarity": 0.4384448095333474
    },
    {
      "verse": "74:17",
      "similarity": 0.4309938353228447
    }
  ]
}