{
  "chapter": "القلم",
  "text": "فذرنى ومن يكذب بهذا الحديث سنستدرجهم من حيث لا يعلمون",
  "translations": [
    {
      "translation": "So leave anyone who denies this discourse to Me! We will lead them, step by step, into destruction from where they do not know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So leave those who deny this Discourse to Me. We shall lead them step by step to (ruin) in a way they will not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So leave Me, (O Prophet), to deal with him who gives the lie to this Discourse. We shall draw them little by little (to their undoing) in a way that they will not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave those who reject the Quran to Me and I shall lead them step by step to destruction, without their being aware of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore leave the one who denies this matter, to Me; We shall soon steadily take them away, from a place they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then leave Me alone with whoever denies this narration. We shall punish them gradually from directions they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So leave Me and him who rejects this announcement; We will overtake them by degrees, from whence they perceive not:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So leave Me with him who cries lies to this discourse! We will draw them on little by little whence they know not;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave Me (to deal) with those who give the lie to this pronouncement. We shall lead them on by steps from whence they know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So leave to Me those who reject this message. We shall lead them step by step to their ruin, in ways beyond their ken.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let Me alone with him who belieth this discourse; step by step We lead them on when they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So leave Me with those who deny this discourse. We will draw them imperceptibly [into ruin], whence they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then leave Me alone with such as reject this Message: by degrees shall We punish them from directions they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then leave Me Alone with such as belie this Quran. We shall punish them gradually from directions they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, leave Me with he who belied this discourse. We will draw them on little by little from where they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So leave Me to those who reject this discourse; We will proceed against them gradually, from where they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So leave Me, [O Muhammad], with [the matter of] whoever denies the Qur'an. We will progressively lead them [to punishment] from where they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[68:44] So leave Me [to deal] with those who deny this discourse — the Qur’ān. We will draw them on by degrees, We will seize them little by little, whence they do not know.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Leave Me) Muhammad ((to deal) with those who give the lie to this pronouncement) to this Scripture. (We shall lead them on) i.e. those who mock the Qur'an (by steps from whence they know not) from whence they perceive not. And Allah did indeed destroy them-they were five people-in one night and one day.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فاعلم أنَّا { سَنَسْتَدْرِجُهُمْ } أي: ندنيهم درجة درجة إلى سوء العذاب بأن نهملهم في الدنيا\n وننعم عليهم\n ونديم صحتهم ونوفر عليهم أسباب الشقاوة حتى صاروا مغمرين في الكفر والطغيان\n منهمكين في الضلال والعصيان\n ثمَّ نبطشهم { مِّنْ حَيْثُ لاَ يَعْلَمُونَ } [القلم: 44] أي: من جهة وطريقة لا يفهمون أنه من جهته وطريقه مكراً عليهم\n وزجراً لهم\n\n\n{ وَ } بالجملة: { أُمْلِي لَهُمْ } وأمهلهم كيداً عليهم\n وهم لا يشعرون { إِنَّ كَيْدِي مَتِينٌ } [القلم: 45] محكم لا يفهمه أحد\n ولا يدفعه شيء\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { فَذَرْني ومَن يُكذِّب بهذا الحديث } أي: القرآن، والمعنى: كِلّ أمره لي، وخلِّ بيني وبينه، فإني أكفيك أمره لأني عليم بما يستحق من العذاب، ومطيق له\n والفاء لترتيب الأمر على ما قبلها من أحوالهم المحكية، أي: إذا كان حالهم في الآخرة كذلك فذرْني ومَن يُكَذِّب بالقرآن، وتوكل عليّ في الانتقام منه، { سنستدرجُهم } سنُدْنيهم من العذاب درجة درجة، يقال: استدرجه إلى كذا، أي: استنزله إليه درجة بدرجة حتى يورطه فيه، واستدراجه تعالى للعصاة أن يرزقهم الصحة والنعمة، فيجعلون رزقَ الله ذريعة إلى معاصيه\n والجملة استئناف مسوق لبيان التعذيب المستفاد من الأمر إجمالاً في قوله: { فذرني } والضمير لـ \" من \" ، والجمع باعتبار معناها، كما أنَّ الإفراد في \" يُكذِّب \" باعتبار لفظها، أي: سنسوقهم إلى العذاب { من حيث لا يعلمون } أي: من الجهة التي لا يشعرون أنه استدراج، قيل: كلما جدّدوا معصيةً جدّدنا لهم نعمة وأنسيناهم شكرها\n قال صلى الله عليه وسلم:\n\n \" إذا رأيت الله تعالى يُنعم على عبد، وهو مقيم على معصية، فاعلم أنه مُستدرج \" \n\nثم تلا هذه الآية\n { وأُمْلِي لهم } وأمهلهم ليزدادوا إثماً، وهم يظنون أنه لإرادة الخير بهم، { إِنَّ كيدي متينٌ } قوي شديد، لا يوقف عليه، فسمّى إحسانه وتمكينه كيداً كما سمّاه استدراجاً لكونه في صورة الكيد، حيث كان سبباً للهلاك\n والحاصل: أن معنى الكيد والمكر والاستدراج، هو الأخذ من جهة الأمن، ولا يجوز أن يُسمى الله كائداً وماكراً ومُسْتَدْرِجاً لعدم التوقيف، وأسماؤه تعالى توقيفيه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:182",
      "similarity": 0.7770250883777198
    },
    {
      "verse": "4:96",
      "similarity": 0.4699429199002897
    },
    {
      "verse": "3:163",
      "similarity": 0.45562916273760556
    },
    {
      "verse": "46:19",
      "similarity": 0.44181425209421654
    },
    {
      "verse": "20:75",
      "similarity": 0.4404093505968283
    }
  ]
}