{
  "chapter": "القلم",
  "text": "لولا ان تدركه نعمة من ربه لنبذ بالعراء وهو مذموم",
  "translations": [
    {
      "translation": "Had a blessing from his Lord not overtaken him, he would have been thrown up on the naked shore, for he was at fault.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for a favour from his Lord he would have been cast blame-worthy on a barren plain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "had his Lord not bestowed His favour upon him, he would have been cast upon that barren shore (and would have remained there) in disgrace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and who cried (for help) to his Lord, while imprisoned and helpless inside the fish. Had it not been for a favor from his Lord, he would have been left out in the open, deserving blame for his shortcomings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not for his Lord’s favour that reached him, he would have surely been cast onto the desolate land, reproached.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had not a grace from his Lord reached him, he would indeed have been (left in the stomach of the fish, but We forgave him), so he was cast off on the naked shore, while he was to be blamed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not that favor from his Lord had overtaken him, he would certainly have been cast down upon the naked Found while he was blamed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had there not overtaken him a blessing from his Lord he would have been cast upon the wilderness, being condemned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been that favour from his Lord had reached him he surely had been cast into the wilderness while he was reprobate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had his Lord's grace not been bestowed upon him, he would have been cast away in disgrace upon that desolate shore.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had not grace from his Lord reached him, he had surely been cast into the wilderness in a plight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it not been for a blessing that came to his rescue from his Lord, he would surely have been cast on the bare shore, being blameworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had not Grace from his Lord reached him, he would indeed have been cast off on the naked shore, in disgrace.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had not a Grace from his Lord reached him, he would indeed have been (left in the stomach of the fish, but We forgave him), so he was cast off on the naked shore, while he was to be blamed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had the favor of his Lord not come upon him, he would have been blamed, cast upon the shore.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were it not for his Lord’s favor that reached him, he would have been thrown into the wilderness, fully despised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If not that a favor from his Lord overtook him, he would have been thrown onto the naked shore while he was censured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[68:49] Had it not been for a grace, a mercy, from his Lord that reached him, he would have surely been cast, out of the belly of the whale, onto a wilderness, a desolate land, while he was blameworthy — but he was shown mercy and was therefore cast out blameless.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nلَوْلَا أَنْ تَدَارَكَهُ نِعْمَةٌ مِنْ رَبِّهِ لَنُبِذَ بِالْعَرَاءِ وَهُوَ مَذْمُومٌ (49) وقوله : { لولا أن تداركه نعمة من ربّه لَنُبذ بالعراء } إلخ استئناف بياني ناشىء عن مضمون النهي من قوله : { ولا تكن كصاحب الحوت إذ نادى } إلخ لأنه يتضمن التحذير من الوقوع في كرب من قبيل كرب يونس ثم لا يدري كيف يكون انفراجه .و { أنْ } يجوز أن تكون مخففة من ( أنَّ ) ، واسمها ضمير شأن محذوف ، وجملة { تداركه نعمة من ربّه } خبرها . ويجوز أن تكون مصدرية ، أي لولا تدارك رحمة من ربّه .والتدارك : تفاعل من الدرَك بالتحريك وهو اللحاق ، أي أن يلحق بعضُ السائرين بعضاً وهو يقتضي تسابقهم وهو هنا مستعمل في مبالغة إدراك نعمة الله إياه .والنبذ : الطرح والترك . والعراء ممدوداً : الفضاء من الأرض الذي لا نبات فيه ولا بناء .والمعنى : لنبذهُ الحوت أو البحر بالفضاء الخالي لأن الحوت الذي ابتلعه من النوع الذي يُرضع فراخه فهو يقترب من السواحل الخالية المترامية الأَطراف خوفاً على نفسه وفراخه .والمعنى : أن الله أنعم عليه بأن أنبت عليه شجرة اليقطين كما في سورة الصافات .وأُدمج في ذلك فضل التوبة والضراعة إلى الله ، وأنه لولا توبته وضراعته إلى الله وإنعام الله عليه نعمة بعدَ نعمة لقذفه الحوت من بطنه ميتاً فأخرجه الموج إلى الشاطىء فلكان مُثْلة للناظرين أو حيّاً منبوذاً بالعراء لا يجد إسْعافاً ، أو لَنجا بعد لأي والله غاضب عليه فهو مذموم عند الله مسخوط عليه . وهي نعم كثيرة عليه إذ أنقذه من هذه الورطات كلها إنقاذاً خارقاً للعادة .وهذا المعنى طوي طياً بديعاً وأشير إليه إشارة بليغة بجملة { لولا أن تداركه نعمة من ربّه لنبذ بالعراء وهو مذموم .وطريقة المفسرين في نشر هذا المطوي أن جملة وهو مذموم } في موضع الحال وأن تلك الحال قيد في جواب { لَولا } ، فتقدير الكلام : لولا أن تداركه نعمة من ربّه لنبذ بالعراء نبذاً ذميماً ، أي ولكن يونس نبذ بالعراء غيرَ مذموم .والذي حملهم على هذا التأويل أن نبذه بالعراء واقع فلا يستقيم أن يكون جواباً للشرط لأن { لولا } تقتضي امتناعاً لوُجودٍ ، فلا يكون جوابها واقعاً فتعين اعتبار تقييد الجواب بجملة الحال ، أي انتفى ذمه عند نبذه بالعراء .ويلوح لي في تفصيل النظم وجه آخر وهو أن يكون جواب { لولا } محذوفاً دل عليه قوله { وهو مكظوم } مع ما تفيده صيغة الجملة الاسمية من تمكن الكظم كما علمت آنفاً ، فتلك الحالة إذا استمرت لم يحصل نبذه بالعراء ، ويكون الشرط ب { لولا } لاحقاً لجملة { إذ نادى وهو مكظوم } ، أي لبقي مكظوماً ، أي محبوساً في بطن الحوت أبداً ، وهو معنى قوله في سورة الصافات ( 143 144 ) { فلولا أنه كان من المسبّحين للبث في بطنه إلى يوم يبعثون } ، وتجعل جملة { لَنُبِذ بالعراء وهو مذموم } استئنافاً بيانياً ناشئاً عن الإِجمال الحاصل من موقع { لَولا } .واللام فيها لام القسم للتحقيق لأنه خارق للعادة فتأكيده لرفع احتمال المجاز . والمعنى : لقد نبذ بالعراء وهو مذموم . والمذموم : إمّا بمعنى المذنب لأن الذنب يقتضي الذمَّ في العاجل والعقاب في الآجل ، وهو معنى قوله في آية الصافات ( 142 ) { فالتقمه الحوت وهو مُليم } وإِمّا بمعنى العيب وهو كونه عارياً جائعاً فيكون في معنى قوله : { فنبذناه بالعراء وهو سقيم } \\[ الصافات : 145 \\] فإن السقم عيب أيضاً .وتنكير { نعمة } للتعظيم لأنها نعمة مضاعفة مكررة .\n\n",
      "translations": [
        {
          "translation": "(Had it not been that favour) mercy (from his Lord had reached him he surely had been cast into the wilderness while he was reprobate) and guilty.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَنُبِذَ بِٱلْعَرَآءِ } معناه عَلَى وَجْهِ الأَرضِ ونُبِذَ: أَي أُلقِي\n\n",
      "translations": [
        {
          "translation": " And His saying, {We will surely show them Our signs on the horizons and within themselves} [41:53], its meaning is upon the face of the earth, and We will show them: that is, We will cast [them].",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَّوْلاَ أَن تَدَارَكَهُ } أدركته { نِعْمَةٌ مِّن رَّبِّهِ } يعني: لو لم يوفقه سبحانه على نعمة التوبة\n والإنابة والرجوع إليه على وجه الإخلاص والندامة { لَنُبِذَ } وطرح ألبتة { بِٱلْعَرَآءِ } أي: الأرض الخالية عن الشجر { وَهُوَ } حينئذٍ { مَذْمُومٌ } [القلم: 49] مليم مطرود من الرحمة والكرامة\n\n\nلكن أدركته العناية الإلهية\n وانفتح له باب التوبة والاستغفار على وجه الندم والانكسار\n فاستغفر ربه وتاب عليه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لولا أن تدارَكه نعمةٌ } رحمة { من ربه } أي: لولا أنَّ الله أنعم عليه بإجابة دعائه\n وقبول عذره\n أو: لتوفيقه للتوبة وقبولها منه\n { لنُبذ بالعراءِ } بالأرض الخالية من الأشجار { وهو مذموم } معاتَب بعجلته\n لكنه رُحم\n فنُبذ غير مذموم\n بل مَرْضِي مقبول\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:118",
      "similarity": 0.5277945391259516
    },
    {
      "verse": "37:145",
      "similarity": 0.5059791550838635
    },
    {
      "verse": "17:18",
      "similarity": 0.3143698194634349
    },
    {
      "verse": "17:22",
      "similarity": 0.3030167496620331
    },
    {
      "verse": "9:10",
      "similarity": 0.2676376346971275
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/068049.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/068049.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/68:49.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}