{
  "chapter": "القلم",
  "text": "يوم يكشف عن ساق ويدعون الى السجود فلا يستطيعون",
  "translations": [
    {
      "translation": "On the Day when legs are bared and they are called on to prostrate, they will not be able to do so.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day the great calamity befalls, and they are called to bow in homage, they will not be able to do so.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the dreadful calamity will unfold, when people will be summoned to prostrate themselves, and yet they will not be able to prostrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the terrible torment approaches, they will be told (in a mocking way) to prostrate themselves, but they will not be able to do it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the Shin* will be exposed and they will be called to prostrate themselves, they will be unable. (Used as a metaphor)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when the Shin shall be laid bare and they shall be called to prostrate themselves, but they shall not be able to do so.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when there shall be a severe affliction, and they shall be called upon to make obeisance, but they shall not be able,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day when the leg shall be bared, and they shall be summoned to bow themselves, but they cannot;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when it befalleth in earnest, and they are ordered to prostrate themselves but are not able,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the truth shall be laid bare, they will be called upon to prostrate themselves, but they will not be able to do so.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember the Day whereon the shank shall be bared and they shall be called upon to Prostrate themselves, but they shall not be able.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when the catastrophe occurs and they are summoned to prostrate themselves, they will not be able [to do it].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day that the shin shall be laid bare, and they shall be summoned to bow in adoration, but they shall not be able,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) the Day when the Shin shall be laid bare (i.e. the Day of Resurrection) and they shall be called to prostrate (to Allah), but they (hypocrites) shall not be able to do so,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the leg shall be bared, and they are ordered to prostrate themselves, they will be unable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the Shin will be exposed, and they will be called to bow down, but they will be unable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day the shin will be uncovered and they are invited to prostration but the disbelievers will not be able,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[68:42] Mention, the day when the shank is bared (an expression denoting the severity of the predicament during the reckoning and the requital on the Day of Resurrection: one says kashafati’l-harbu ‘an sāqin, ‘the war has   bared its shank’, to mean that it has intensified) and they are summoned to prostrate themselves, as a test of their faith, but they will not be able [to do so] — their backs will become as [stiff as] a brick wall.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the day when it befalleth in earnest) a matter to which they were blind in the life of the world; it is also said this means: when a severe, horrific matter is revealed; and it is also said that this means: when a sign between them and their Lord is revealed, (and they are ordered to prostrate themselves) this is because they said: By Allah, our Lord, we were not idolaters or hypocrites (but are not able) to prostrate, their bodies remaining erect like solid fortresses,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَوْمَ يُكْشَفُ عَن سَاقٍ } معناه عن شِدةٍ وكَربٍ\n قال الإِمام زيد بن علي عليهما السّلامُ: كانت العَربُ إذا نَزلتْ فيه الحَربُ أو أمرٌ عَظيمٌ الذي لا أَشدَّ منهُ قالوا كَشَفَتْ الحَربُ عَنْ سَاقٍ\n قال الله عز وجل: { يَوْمَ يُكْشَفُ عَن سَاقٍ وَيُدْعَوْنَ إِلَى ٱلسُّجُودِ } قال أبو خالد رحمه الله: سَمِعتُ الإِمامَ زيد بن علي صلواتُ الله عليهِ يَقولُ ذَاتَ يومٍ وقَدْ غَضِبَ غَضباً شَديداً إِنَّ الله يَكْشِفُ عن سَاقٍ إنما هو الأَمرُ الشَّديدُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما بهتوا اذكر لهم يا أكمل الرسل { يَوْمَ يُكْشَفُ } الأمور الخطوب { عَن سَاقٍ } أي: عن أصلها وحقيقتها، وتبلى السرائر برمتها، وارتفعت حجب الأغيار وسدل الاعتبار بأسرها، وبالجملة: لم يبق إلا الله الواحد القهار { وَيُدْعَوْنَ } حينئذٍ هؤلاء الأظلال الهالكون في تيه الحيرة والضلال { إِلَى ٱلسُّجُودِ } والتذلل على وجه الانكسار لدى الملك الجبار { فَلاَ يَسْتَطِيعُونَ } [القلم: 42] حينئذٍ؛ لمضيّ نشأة الاختيار، وأوان الاختبار\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n واذكر { يومَ يُكشَفُ عن ساقٍ } ، وجمهور المفسرين على أن الكشف عن ساق عبارة عن شدة الأمر، وصعوبة الخطب، أي: يوم يشتد الأمر ويصعب، وقيل: ساق الشيء: أصله الذي به قوامه، كساق الشجرة وساق الإنسان، أي: يوم يُكشف عن أصل الأمر، فتظهر حقائق الأمور وأصولها، بحيث تصير عياناً\n وتنكيره للتهويل العظيم\n قال النسفي: ولا كشف ثمَّ ولا ساق، ولكن كنّى به عن شدة الأمر لأنهم إذا ابتلوا بالشدّة كَشفوا عن الساق، وقال: كشفت الحرب عن ساقها، وهذا كما تقول للشحيح: يده مغلولة، ولا يد ثَمَّ ولا غل، وإنما هو كناية عن البخل، وأمّا مَن شبّه فلِضيق عِطفه وقلّة نظره في علم البيان، ولو كان الأمر كما زعم المشبَّه لكان من حقِّ الساق أن يُعرَّف لأنها ساق معهودة عنده\n هـ\n قلت: انظر الثعلبي، فقد نقل أحاديث الحشر، وكلها تدل على أنَّ كشف الساق حقيقة، وذكر حديث أبي موسى أنَّ النبي صلى الله عليه وسلم قال:\n\n \" { يوم يُكشف عن ساق } قال: عن نور عظيم، يخرُّون له سجداً \" \n\n، ثم ذكر حديث الحشر بتمامه، ومَن كحّل عينيه بإثمد التوحيد الخاص لم يصعب عليه أمثال هذه المتشابهات إذ الحق جلّ جلاله غير محصور، بل يتجلّى كيف شاء، وقد ورد أنه يتجلّى لفصل عباده، فيجلس على كرسيه، وورد أيضاً في حديث كشف الساق: أنه يتقدّم أمامهم بعد كشف الساق وسجود المؤمنين له، ثم ينطلق بهم إلى الجنة\n ذكر الحديث المنذري وغيره، ونقله المحشي الفاسي في سورة البقرة، عند قوله:\n\n[البقرة:210] الآية، وليس هذا تجسيم ولا حصر إذا ما في الوجود إلاّ تجليات الحق، ومظاهر ذاته\n ثم قال تعالى: { ويُدْعَون إِلى السجود } توبيخاً وتعنيفاً على تركهم له في الدنيا، وتحسُّراً لهم على تفريطهم في ذلك، لا تكليفاً، إذ ليست دار تكليف، { فلا يستطيعون } ذلك لأنَّ ظهورهم تصير كصياصي البقر، وفيه دلالة على أنهم يقصدون السجود فلا يتأتى منهم ذلك\n وعن ابن مسعود رضي الله عنه: تَفقُم أصلابهم، أي: تُرد عظماً بلا مفاصل، لا تثنى عند الرفع والخفض\n وفي الحديث الصحيح:\n\n \" يخرُّون لله سُجداً أجمعون، ولا يبقى أحد كان يسجد لله رياء وسمعة ونفاقاً إلاَّ صار ظهره طبقاً واحداً، كلما أراد أن يسجد خرّ على قفاه \"\n \n\n \n",
      "translations": []
    }
  ]
}