{
  "chapter": "القلم",
  "text": "وانك لعلى خلق عظيم",
  "translations": [
    {
      "translation": "Indeed you are truly vast in character.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For you are verily born of sublime nature.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and you are certainly on the most exalted standard of moral excellence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You have attained a high moral standard.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed you possess an exemplary character.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, you are on an exalted character.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And most surely you conform (yourself) to sublime morality.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "surely thou art upon a mighty morality.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! thou art of a tremendous nature.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For you are truly of a sublime character.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily thou art of a high and noble disposition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and indeed you possess a great character.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thou (standest) on an exalted standard of character.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, you (O Muhammad SAW) are on an exalted standard of character.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, you (Prophet Muhammad) are of a great morality.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you are of a great moral character.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, you are of a great moral character.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[68:4] And assuredly you possess a magnificent nature, [a magnificent] religion.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And lo! thou art) O Muhammad (of a tremendous nature) following a noble religion which is honoured by Allah; it is also said this means: you have great character traits with which Allah has honoured you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِنَّكَ لَعَلَىٰ خُلُقٍ عَظِيمٍ } معناه على القُرآنِ والإِسلامِ\n\n",
      "translations": [
        {
          "translation": " And His saying, {And indeed, you are on an exalted standard of character} [Quran 68:4], its meaning is with regards to the Quran and Islam.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وإنك لعلى خلق عظيم } لكونك متخلقاً بأخلاق الله متأيداً بالتأييد القدسي فلا تتأثر بمفترياتهم ولا تتأذى بمؤذياتهم إذ بالله تصبر لا بنفسك كما قال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِنَّكَ } من كمال تخلقك بالأخلاق الإلهية، وتحققك بقمام الخلة والخلافة { لَعَلَىٰ خُلُقٍ عَظِيمٍ } [القلم: 4] لا خلق أعظم من خلقك؛ لحيازتك وجمعك خُلق الأولين والآخرين حسب جامعية مرتبتك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإنك لعلى خُلُقِ عظيم } لا يُدْرِك شأوَه أحدٌ مِن الخلق، ولذلك تَحْتَمِل من جهتهم ما لا يحتمله أحد من البشر\n وسُئلت السيدة عائشة رضي الله عنها عن خلقة صلى الله عليه وسلم، فقالت: كان خُلقه القرأن، ألست تقرأ القرآن:\n\n[المؤمنون:1] الآية\n وقيل: المراد: التأدُّب بآداب القرآن، بامتثال أمره واجتناب نهيه\n قال ابن جُزي: وتفصيل ذلك: أنَّ رسولَ الله صلى الله عليه وسلم جمع كل فضيلة، وحاز كل خصلة جميلة، فمن ذلك: شرف النسب، ووفور العقل، وكثرة العلم والعبادة، وشدة الحياء، والسخاء، والصدْق، والشجاعة، والصبر، والشكر، والمروءة، والتوءدة، والاقتصاد، والزهد، والتواضع، والشفقة، والعدل، والعفو، وكظم الغيظ، وصلة الرحم، وحُسن المعاشرة، وحسن التدبير، وفصاحة اللسان، وقوة الحواس، وحسن الصورة، وغير ذلك، حسبما ورد في أخباره وسِيرَه صلى الله عليه وسلم، ولذلك قال:\n\n \" بُعثت لأتمم مكارمَ الأخلاق \" \n\n \n\n، قال الجنيد: سُمي خُلقه عظيماً لأنه لم تكن له همة سوى الله عزّ وجل\n هـ\n والخُلق: السجية والطبع\n قال في القاموس: الخُلْق بالضم وبضمتين: السجية، والطبع، والمروءة والدين\n هـ\n وعرَّف بعضهم حقيقة الخُلق، فقال: مَلكة للنفس، تصدر عنها الأفعال بسهولة، من غير فكر ولا رَوية، فخرج الصبر لأنه بصُعوبة، والفكرة لأنها تكون بروية، ثم ينظر في تلك الأفعال الصادرة عن تلك المَلكة فإن كانت سيئة، كالغضب، والعَجَلة، والكِبر، والفظاظة، والغلظة، والقسوة، والبُخل، والجُبن، وغير ذلك من القبائح، سُمي خُلقاً سيئاً، وإن كانت تلك الأفعال حسنة، كالعفو، والحلم، والجود، والصبر، والرحمة، ولين الجانب، وتحمل الأذى، سُمي خلقاً حسناً، الذي اتصف به صلى الله عليه سلم على أكمل الوجوه، ومَدَحه بقوله:\n\n \" ما من شيء يوضع في الميزان أثقل من حسن الخلق، وإن صاحب حسن الخلق يبلغ درجة الصائم القائم \" \n\nوبقوله:\n\n \" أفضل ما أُعطي المرء الخلق الحسن \" \n\nفي أحاديث كثيرة\n وبالله التوفيق\n الإشارة: قد يُقال: أشار بقوله: { ن } إلى سرعة إنفاذ أمره بين الكاف والنون، ثم أقسم بالقلم على تنزيه نبيه من الجنون، ويُقال مثل ذلك لخلفائه، إذا رُمُوا بالجنون أو السحر أو سخافة العقل، ويُقال لهم في إرشاد الناس وتذكيرهم ما قيل لنبيّهم: { وإِنَّ لك لأجراً غير ممنون وإنك لعلى خلق عظيم } ، فحُسن الخلق دليل على ثبوت الخصوصية، وعدمه دليل على عدم وجودها لأنّ الخمرة إذا دخلت القلب والروح هَذّبت أخلاقهما، وطهّرت أكدارهما، وما تُبقي إلاَّ الذهب الإبريز\n وقال شيخ شيوخنا، سيدي عبد الرحمن العارف: كان صلى الله عليه وسلم على خُلقٍ عظيم لشرح صدره بالنور، كما قال تعالى:\n\n[الشرح:1]، ولحديث شرح صدره وشقه وتطهيره، ونزع حظ الشيطان منه، ثم إفراغ الحكمة والنور فيه، حتى مُلىء بذلك، فكان شيئاً محضاً لله تعالى، لا تعلُّق له بغيره، فناسب القرأن، وصار خُلقاً له، منقوشاَ فيه، من غير روية، ولا تكسب في ذلك، بل طُبع على ذلك، وسرى فيه أمر الوحي، وجرى على مقتضاه في جميع أحواله، ولذلك تجد السُنة مشرعة من القرآن، وخارجة منه خروج اللبن من الضرع، والزبد من اللبن، فصار متخلّقاً بالقرآن، وفي الحقيقة متخلّقاً بخُلق الله، ومظهرَ أوصافه، ومجلاة سره وشأنه،\n\n[الفتح:10] الآية، ومَن رآه فقد رأى الحق\n والله أعلم\n هـ\n فعائشة رضي الله عنها احتشمت وسترت حيث عبّرت بالقرآن، ولم تقل كان خلقه خلق الرحمن\n ثم ردّ عليهم نسبة الجنون لرسوله صلى الله عليه وسلم فقال: { فَسَتُبْصِرُ وَيُبْصِرُونَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "83:5",
      "similarity": 0.6604360754999156
    },
    {
      "verse": "69:33",
      "similarity": 0.6189861773475105
    },
    {
      "verse": "38:67",
      "similarity": 0.5316022571785831
    },
    {
      "verse": "78:2",
      "similarity": 0.4997006404432157
    },
    {
      "verse": "26:135",
      "similarity": 0.4883933708509796
    }
  ]
}