{
  "chapter": "القلم",
  "text": "فاصبر لحكم ربك ولا تكن كصاحب الحوت اذ نادى وهو مكظوم",
  "translations": [
    {
      "translation": "So wait with patience for the judgement of your Lord, and do not be like (onah) of the fish who called (to his Lord) when he was choked with anger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So bear with patience until the Judgement of your Lord comes, and do not belike the man in the fish (i.e., Jonah) who called out, choking with grief:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exercise patience until the promise of your Lord (to punish the unbelievers) comes true. Do not be like Jonah (who left his people without the permission of God; he wanted them to be punished immediately),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore wait for your Lord’s command, and do not be like the one of the fish; who cried out when he was distraught. (Prophet Yunus – peace be upon him.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, wait with patience for the decision of your Lord, and be not like the Companion of the Fish when he cried out (to Us) while he was Makzum.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So wait patiently for the judgment of your Lord, and be not like the companion of the fish, when he cried while he was in distress.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be thou patient under the judgment of thy Lord, and be not as the Man of the Fish, when he called, choking inwardly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But wait thou for thy Lord's decree, and be not like him of the fish, who cried out in despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wait patiently for your Lord's judgement; do not be like the man who, having been swallowed by a whale, called out in distress.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be patient thou, then, with thy Lord's judgment, and be thou not like him of the fish, when he cried out while he was in anguish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So submit patiently to the judgement of your Lord, and do not be like the Man of the Fish who called out as he choked with grief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So wait with patience for the Command of thy Lord, and be not like the Companion of the Fish,- when he cried out in agony.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So wait with patience for the Decision of your Lord, and be not like the Companion of the Fish, when he cried out (to Us) while he was in deep sorrow. (See the Quran, Verse 21:87).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So be patient with the judgement of your Lord and do not be like the Companion of the Whale (Jonah), when he called out choking inwardly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So wait patiently for the Decision of your Lord, and do not be like the Fellow of the Fish who cried out in despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then be patient for the decision of your Lord, [O Muhammad], and be not like the companion of the fish when he called out while he was distressed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[68:48] So await patiently the judgement of your Lord, regarding them in the way that He wills, and do not be like the one of the whale, in terms of impatience and haste — this is Jonah, peace be upon him — who called out, [who] supplicated his Lord, choking with grief, filled with anguish inside the belly of the whale.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "686 (But wait thou for your Lord's decree) be patient in conveying the message of your Lord; it is also said this means: be pleased with the decree of your Lord, (and be not) fed up and heart constricted with regard to Allah's command (like him of the fish) like Jonah the son of Mathew (Matta), (who cried out) to his Lord in the belly of the fish (in despair) tired and aggrieved.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تَكُن كَصَاحِبِ ٱلْحُوتِ } أي كيونس بن متَّى عليه السلامُ\n\n[الصافات: 142] فَبقي فِي بطنِهِ يوماً واحداً\n وقِيل: سبعةُ أيامٍ وقيل: أربعونَ يوماً\n\n\n\n\nوقوله تعالى: { إِذْ نَادَىٰ وَهُوَ مَكْظُومٌ } معناه شَديدُ الضَّيمِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوهم وإن بالغوا في العناد والإنكار { فَٱصْبِرْ } أنت يا أكمل الرسل { لِحُكْمِ رَبِّكَ } وهو تأخير نصرك عليهم، وإمهالهم زماناً على حالهم، ولا تستعجل في مؤاخذتهم { وَلاَ تَكُن } في الاستعجال { كَصَاحِبِ ٱلْحُوتِ } يعني: أخاك يونس بن متى عليه السلام، فاستعجل العذاب القومه، ثمَّ لمَّا ظهرت أماراته خرج من بينهم مغاضباً عليهم حتى اقتحرم البحر\n\n[الصافات: 141] في السفينة\n\n[الصافات: 141- 142]، اذكر { إِذْ نَادَىٰ } ربه في بطن الحوت { وَهُوَ } حينئذٍ { مَكْظُومٌ } [القلم: 48] مملوء غضباً وغيظاً، مبتلى بالبلاء العظيم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أم عندهم الغيب } أي: اللوح المحفوظ، أو علم المغيبات، { فهم يكتبون } منه ما يحكمون به، فيستغنون عن علمه؟ { فاصبرْ لحُكم ربك } أي: ما حكم به، وهو إمهالهم وتأخير نصرتك عليهم لأنهم وإن أُمهلوا لم يُهمَلوا، { ولا تكن كصاحِب الحوت } يونس عليه السلام في العَجَلة والغضب على القوم حتى ابتلي ببلائه، { إِذ نادَى } في بطن الحوت { وهو مكظوم } مملوء غيظاً",
      "translations": []
    }
  ]
}