{
  "chapter": "القلم",
  "text": "وان يكاد الذين كفروا۟ ليزلقونك بابصرهم لما سمعوا۟ الذكر ويقولون انه لمجنون",
  "translations": [
    {
      "translation": "But the unbelievers would like to stare you out of balance when they hear the warning, and say: \"Surely he is possessed;\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the unbelievers hear this Exhortation, they look at you as though they would knock you off your feet with their (hostile) glances. They say: “Surely he is afflicted with madness”;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the disbelievers listen to you reciting the Quran they almost try to destroy you with their piercing eyes. Then they say, \"He is certainly insane\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed the disbelievers seem as if they would topple you with their evil gaze when they hear the Qur’an, and they say, “He is indeed insane.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, those who disbelieve would almost make you slip with their eyes (through hatred) when they hear the Reminder (the Qur'an), and they say: \"Verily, he is a madman!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve would almost smite you with their eyes when they hear the reminder, and they say: Most surely he is mad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers wellnigh strike thee down with their glances, when they hear the Reminder, and they say, 'Surely he is a man possessed!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! those who disbelieve would fain disconcert thee with their eyes when they hear the Reminder, and they say: Lo! he is indeed mad;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who deny the truth hear the admonition, they would almost cause you to stumble with their evil eyes; and they say, \"He is certainly mad.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who disbelieve well-nigh cause thee to stumble with their looks when they hear the Admonition, and they say: verily he is mad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the faithless almost devour you with their eyes when they hear this Reminder, and they say, ‘He is indeed crazy.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Unbelievers would almost trip thee up with their eyes when they hear the Message; and they say: \"Surely he is possessed!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, those who disbelieve would almost make you slip with their eyes through hatredness when they hear the Reminder (the Quran), and they say: \"Verily, he (Muhammad SAW) is a madman!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the unbelievers hear the Reminder, they nearly strike you down with their glances, and say: 'Surely, he is mad'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve almost stab you with their glances when they hear the message, and say, “He is crazy!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, those who disbelieve would almost make you slip with their eyes when they hear the message, and they say, \"Indeed, he is mad.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[68:51] Indeed those who disbelieve would almost throw you down [to the ground] (read la-yuzliqūnaka or layazliqūnaka) with their looks, looking at you in a severe way, almost hurling you to the ground or making you fall from your place, when they hear the Reminder, the Qur’ān, and they say, out of envy: ‘He is truly a madman!’, on account of the Qur’ān that he has brought.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And lo! those who disbelieve) the disbelievers of Mecca (would fain disconcert thee) would kill you (with their eyes) and it is said this means: they would give you the evil eye (when they hear the Reminder) when they hear you recite the Qur'an, (and they) i.e. the people of Mecca (say: Lo! he is) i.e. Muhammad (indeed mad) bewitched;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَيُزْلِقُونَكَ } معناه ليُزِيلُونكَ\n وقيل: ليُصرِعونكَ\n وقيل: ليُزهِقونَكَ بأبصارِهِمْ حتّى يَلقُوكَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من غلظ غيظهم معك يا أكمل الرسل، وشدة شكيمتهم وضغينتهم بالنسبة إليك { إِن يَكَادُ } أي: إنه يقرب { ٱلَّذِينَ كَفَرُواْ } بالله، وستروا محامد أخلاقك، ومحاسن شيمك { لَيُزْلِقُونَكَ بِأَبْصَارِهِمْ لَمَّا سَمِعُواْ ٱلذِّكْرَ } أي: حين سمعوا منك تلاوة القرآن المعجز، وتعجبوا من بدائع نظمه، وغرائب أسلوبه، وكمال فصاحته وبلاغته، ومتانة تركيباته الفائقة على تراكيب عموم أرباب اللسن والفصاحة، وعجائب معانيه التي قرعت أسماعهم؛ لذلك حسدوك خفية، وقصدوا مقتك بإصابة العين { وَ } إن كانوا { يَقُولُونَ } عند الملأ: { إِنَّهُ لَمَجْنُونٌ } [القلم: 51] يتكلم بكلام المجانين، ما هو من جنس كلام الناس تلبيساً على ضعفاء الأنام، وتغريراً لهم؛ لئلا يتفطنوا على عظمة شأنك، ورفعة قدرك ومكانك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وإِن يكادُ الذين كفروا لَيُزْلِقُونك بأبصارهم } ، يقال: زَلَقه زَلَقاً، وأزلقه إزلاقاً: أزاله عن مكانه، و \" إن \" مخففة، أي: وإن الشأن يقرب الذي كفروا من شدّة عداوتهم، ونظرهم إليك شزراً بعيون العداوة أن يزيلوك عن مكانك، ويزلقوا قدمك عن مكانه، أو: يهلكوك لشدة حنقهم عليك، وكانت في بني أسد عيانون، فكان الرجل منهم يجوع ثلاثة أيام، فلا يمر به شيء فيقول فيه: لم أرَ كاليوم مثله إلاّ هلك، فأراد بعضُهم أن يَعين رسولَ الله صلى الله عليه وسلم، فعصمه الله من ذلك، فنزلت\n وفي الحديث:\n\n \" العين حق، وإن العين لَتُدْخِل الجمل القِدر، والرجلَ القبر \" \n\n، وهي من خصائص بعض النفوس\n وعن الحسن: دواء الإصابة بالعين أن يقرأ هذه الآية\n هـ\n و { لمَّا سمعوا }: ظرف ليُزلقونك، أي: يهلكونك وقت سماعهم { الذكرَ } أي: القرآن، أي: لاشتداد بغضهم وحسدهم وقت سماعه، { ويقولون } لغاية حيرتهم في أمره صلى الله عليه وسلم، ونهاية جهلهم لِما في تضاعيف القرآن من عجائب الحِكَم وبدائع العلوم المحجوبة عن العقول: { إنه لمجنونٌ } أي: إنَّ محمداً لمجنون، حيرةً في أمره، وتنفيراً للناس عنه، { وما هو } أي: القرآن { إِلاَّ ذكر للعالمين } أي: وعظ وتذكير للجن والإنس، والجملة: حال، أي: يقولون ذلك، والحال أنه تذكير وبيان لجميع ما يحتاجون إليه من أمور دينهم، فإنَّ مَن أنزل ذلك، وهو مطَّلع على أسراره طرًّا، ومحيط بحقائقه خُبراً، عليم بما قالوه\n وقيل: معناه: شرف وفضل، كقوله:\n",
      "translations": []
    }
  ]
}