{
  "chapter": "القلم",
  "text": "ان ربك هو اعلم بمن ضل عن سبيله وهو اعلم بالمهتدين",
  "translations": [
    {
      "translation": "Your Lord knows best who is misguided from His Way and He knows best those who are guided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily your Lord knows those who have gone astray from His path, and He knows those who are guided on the way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your Lord knows well those who have strayed from His Way just as He knows well those who are on the Right Way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows best who has gone astray from His path and who is rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed your Lord well knows those who have strayed from His path, and He well knows those who are upon guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, your Lord is the best Knower of him who has gone astray from His path, and He is the best Knower of those who are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your Lord best knows him who errs from His way, and He best knows the followers of the right course.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely thy Lord knows very well those who have gone astray from His way, and He knows very well those who are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! thy Lord is Best Aware of him who strayeth from His way, and He is Best Aware of those who walk aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows best who has fallen by the wayside, and who has remained on the true path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily thy Lord! He is the best Knower of him who strayeth from His path, and He is the best Knower of the guided one,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed your Lord knows best those who stray from His way, and He knows best those who are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily it is thy Lord that knoweth best, which (among men) hath strayed from His Path: and He knoweth best those who receive (true) Guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, your Lord knows better, who (among men) has gone astray from His Path, and He knows better those who are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, your Lord knows very well those who strayed from His Path, and those who are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows best who has strayed from His path, and He knows best the well-guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, your Lord is most knowing of who has gone astray from His way, and He is most knowing of the [rightly] guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[68:7] Assuredly your Lord knows best those who stray from His way, and He knows best those who are guided, to Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! thy Lord) Muhammad (is best aware of him who strayeth from His way) from His religion, i.e. Abu Jahl and his host, (and He is best aware of those who walk aright) and He is best aware of those who are guided to His religion, i.e. Abu Bakr and his fellow believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إنّ ربّك هو أعلم بمن } جنّ في الحقيقة فـ { ضلّ عن سبيله } واحتجب عن الدين وبمن عقل فاهتدى إليه\n أي: لا يعلم أحد كنه جنونهم وضلالهم إلا الله لكونه في الغاية وكذا كنه اهتدائك واهتداء من اهتدى بهداك فلا توافقهم في الظاهر كما لا توافقهم في الباطن\n فإن موافقة الظاهر أثر موافقة الباطن وكذا المخالفة وإلا كان نفاقاً سريع الزوال ومصانعة وشيكة الانقضاء\n وأما هم فلانهماكهم في الرذائل وتعمقهم في التلوين والاختلاف لتشعب أهوائهم وتفرّق أمانيهم وميول قواهم وجهات نفوسهم يصانعون ويضمون تلك الرذيلة إلى رذائلهم طمعاً في مداهنتك معهم ومصانعتك إياهم\n فلا يفتننك كثرة أموال من كان أغناهم وكثرة قومه وتبعه فتطيعه وتصانعه مع كثرة رذائله\n ودم على توافق الظاهر والباطن مستغنياً بالله مستظهراً به مصادقاً لمن صدقك مصافياً لمن وافقك مصاحباً لصعاليك المؤمنين الزاهدين في الدنيا\n { سنسمه على الخرطوم } أي: نغير وجهه في القيامة الصغرى ونجعل آلة حرصه مشاكلاً لهيئة نفسه كخرطوم الفيل مثلاً\n ونبدّل أعز أعضائه بما فيه علامة غاية الذل لخسّة نفسه المنجذبة إلى ما في جهة السفل الجاذبة لمواد الرجس\n { يوم يكشف عن ساق } أي: اذكر يوم يشتدّ الأمر وتتفاقم شدته بحيث لا يمكن وصفها بمفارقة المألوفات البدنية والملاذ الحسية وظهور الأهوال والآلام النفسية بالهيئات الموحشة والصور المؤذية { ويدعون } على لسان الملكوت للجنسية الأصلية والمناسبة الفطرية { إلى } سجود الإذعان والانقياد لقبول الأنوار الإلهية والإشراقات السبوحية { فلا يستطيعون } الانقياد والإذعان لقبولها لزوال استعدادهم الأصلي بالهيئات المظلمة واحتجابهم بالغواشي الجسمانية والملابس الهيولانية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { إِنَّ رَبَّكَ } الذي ربَّاك على الرشد والهداية { هُوَ أَعْلَمُ } بعلمه الحضوري { بِمَن ضَلَّ } وانحرف { عَن سَبِيلِهِ } الموصل إلى توحيده { وَهُوَ } أيضاً { أَعْلَمُ بِٱلْمُهْتَدِينَ } [القلم: 7] المتمكنين منهم على جادة التوحيد\n والصراط المستقيم الموصل إلى جنة الرضا\n وروضة التسليم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنَّ ربك هو أعلمُ بمَن ضلَّ عن سبيله } تعليل لمضمون ما قبله\n من ظهور جنونهم\n بحيث لا يخفى على أحد\n وتأكيد لِما فيه من الوعد والوعيد\n أي: هو أعلم بمَن ضلّ عن طريقه الموصلة إلى سعادة الدارين\n وبمن هو في تيه الضلال\n متوجهاً إلى ما يسوقه إلى الشقاوة الأبدية\n وهذا هو المجنون الذي لا يُفرّق بين الضرر والنفع\n بل يحسب الضررَ نفعاً فيؤثره\n والنفعَ ضرراً فيهجره\n { وهو أعلمُ بالمهتدين } إلى سبيله\n الفائزين بكل مطلوب\n الناجين من كل مرهوب\n وهم العقلاء المراجيح\n فيجزي كُلاًّ من الفريقين حسبما يستحقه من العقاب والثواب\n وإعادة { هو أعلم } لزيادة التقرير\n وإذا تقرّر أنك على الهدى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:117",
      "similarity": 1.0000000000000004
    },
    {
      "verse": "53:30",
      "similarity": 0.7488640164525666
    },
    {
      "verse": "15:76",
      "similarity": 0.46163381156096056
    },
    {
      "verse": "93:7",
      "similarity": 0.4584961776977437
    },
    {
      "verse": "42:46",
      "similarity": 0.44081900327871615
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/068007.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/068007.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/68:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}