{
  "chapter": "الحاقة",
  "text": "فعصوا۟ رسول ربهم فاخذهم اخذة رابية",
  "translations": [
    {
      "translation": "They disobeyed the Messenger of their Lord so He seized them in an ever-tightening grip.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they disobeyed the apostle of their Lord He seized them with an overwhelming punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They did not follow the Messenger of their Lord, and so He seized them with a severe grip.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They disobeyed the Messenger of their Lord and He seized them with torment which increased with time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They therefore disobeyed the Noble Messengers of their Lord – so He seized them with an intense seizure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they disobeyed their Lord's Messenger, so He seized them with a punishment that was Rabiyah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they disobeyed the Apostle of their Lord, so He punished them with a vehement punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they rebelled against the Messenger of their Lord, and He seized them with a surpassing grip.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they disobeyed the messenger of their Lord, therefor did He grip them with a tightening grip.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They defied their Lord's messenger, so He seized them with an ever-tightening grip.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they disobeyed their Lord's apostle, so He laid hold of them with a grip increasing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They disobeyed the apostle of their Lord, so He seized them with a terrible seizing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And disobeyed (each) the messenger of their Lord; so He punished them with an abundant Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they disobeyed their Lord's Messenger, so He punished them with a strong punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and rebelled against their Lord's Messenger. So He took them with a stern taking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they disobeyed the messenger of their Lord, so He seized them with an overpowering grip.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they disobeyed the messenger of their Lord, so He seized them with a seizure exceeding [in severity].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[69:10] Then they disobeyed the messenger of their Lord, namely, Lot and others, so He seized them with a devastating blow, one surpassing others in its severity.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they disobeyed the messenger of their Lord) Moses, (therefore did He grip them with a tightening grip) therefore He punished them with a severe punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَخَذَهُمْ أَخْذَةً رَّابِيَةً } معناه شَديدةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { فعصوا رسول ربّهم } أي: العقل الهادي إلى الحق { فأخذهم } بالغرق في بحر الهيولى ورجفة اضطراب مزاج البدن وخرابه { أخذة } زائدة في الشدّة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما جاء الرسل إليهم بالوحي { فَعَصَوْاْ رَسُولَ رَبِّهِمْ } أي: عصى كل أمة برسولها المبعوث إليهم؛ ليديهم إلى طريق الرشاد، فكذبوه واستهزءوا معه، وبالغوا في تكذيبه وعصيانه سبحانه { فَأَخَذَهُمْ } سبحانه { أَخْذَةً رَّابِيَةً } [الحاقة: 10] زائدة شديدة على مقتضى ما ازدادوا في العصيان والتكذيب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فَعَصَوا رسولَ ربهم } أي: عصت كل أمة رسولها، حيث نهوهم عما كانوا يتعاطونه من القبائح، { فأخَذّهم } أي: الله عزّ وجل { أخذةً رابيةً } أي: زائدة في الشدة، كما زادت قبائحهم في القُبح، من: ربا الشيء إذا زاد",
      "translations": []
    }
  ]
}