{
  "chapter": "الحاقة",
  "text": "فاما من اوتى كتبه بيمينه فيقول هاؤم اقرءوا۟ كتبيه",
  "translations": [
    {
      "translation": "As for him who is given his Book in his right hand, he will say, 'Here, come and read my Book!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who is given his ledger in his right hand, will say: \"Here, read my ledger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, he whose Record is given to him in his right hand will say: “Lo! Read my Record!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who will receive the books of the records of their deeds in their right hands will say, \"Come and read my record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So whoever is given his book in his right hand – he will say, “Take, read my account!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then as for him who will be given his Record in his right hand will say: \"Here! read my Record!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then as for him who is given his book in his right hand, he will say: Lo! read my book:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then as for him who is given his book in his right hand, he shall say, 'Here, take and read my book!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, as for him who is given his record in his right hand, he will say: Take, read my book!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he who is given his record in his right hand will exclaim, \"Here is my record, read it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then as to him who will be vouchsafed his book in his right hand, he shall say: here! read my book!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for him who is given his book in his right hand, he will say, ‘Here, take and read my book!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he that will be given his Record in his right hand will say: \"Ah here! Read ye my Record!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then as for him who will be given his Record in his right hand will say: \"Take, read my Record!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, he who is given his book in his right hand will say: 'Here, take and read my book!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for him who is given his book in his right hand, he will say, “Here, take my book and read it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So as for he who is given his record in his right hand, he will say, \"Here, read my record!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[69:19] As for him who is given his book in his right hand, he will say, addressing those around him, on account of the joy that has come to him: ‘Here, take [and], read my book! (kitābiyah: both hā’ūmu, ‘here [is]’, and iqra’ū, ‘read’, compete for [government of] this [direct object]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then, as for him who is given his record in his right hand) this refers to Abu Salamah Ibn 'Abd al-Asad, the husband of Umm Salamah who was a Muslim, (he will say) to his companions: (Take, read my book!) come and see what is in my book of reward and bestowal of honour.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { فأمّا مَن أُوتي كتابه بيمينه فيقول } تبجُّحاً وابتهاجاً وسروراً، لِما يرى فيه من الخيرات خطاباً لجماعته: { هاؤُمُ }: اسم فعل، بمعنى خُذوا، وفيه لغات، أجودهن المطابقة تقول: هاء يا رجل، وهاءِ يا امرأة، بهمزة مكسورة من غير ياء، وهاؤما يا رجلان وامرأتان، وهاؤم يا رجال وهاؤنّ يا نساء\n { اقرؤوا كتابيَهْ } ، والأصل: هاؤم كتابي اقرأوا كتابيهْ، فحذف الأول لدلالة الثاني عليه، والعامل في \" كتابيه \" اقرأوا، عند البصريين لأنهم يُعملون الأقرب، والهاء في \" كتابيه \" ، و \" حسابيه \" ، و \" ماليه \" ، و \" سلطانيه \" للسكت، وحقها أن تثبت في الوقف، وتسقط في الوصل، وقد استُحبّ إيثار الوقف إيثاراً لثباتها لثبوتها في المصحف\n { إِني ظننتُ أني ملاقٍ حسابيهْ } أي: علمت وتيقنت أني سألقى حسابي، ولعل التعبير بالظن للإشعار بأنه لا يقدح في الاعتقاد ما يهجس في النفس من الخطرات التي لا تنفك عنها العلوم النظرية\n قاله أبو السعود، وقد تقدّم سره في البقرة\n { فهو في عيشةٍ راضيةٍ } أي: ذات رضا يرضى بها صاحبها\n جعل الفعل لها مجازاً، وهو لصاحبها لكونها صافية من الشوائب، دائمة، مقرونة بالتعظيم، { في جنةٍ عاليةٍ } مرتفعة المكان لأنها في السماء السابعة، أو: رفيعة الدرجات، أو المباني والأشجار والقصور، وهو خبر بعد خبر، { قُطوفها دانيةُ } ثمارها قريبة من مريدها، ينالها القاعد والمضطجع كالقائم\n قال ابن عرفة: هذه الجملة احتراس لأنه تعالى وصفها بالعلو، وشأن المكان العالي أن تكون ثماره كذلك، فأزال ذلك بأنها مع علو ثمارها قريبة التناول، سهلة المأخذ\n هـ\n والقطوف جمع قطف، وهو ما يحثي بسرعة\n ويقال لهم: { كُلُوا واشربوا هنيئاً } أي: أكلاً وشُرباً هنيئاً، لا مكروه فيهما ولا أذىً، أو: هنئتم هنيئاً { بما أسلفتم } أي: بمقابلة ما قدّمتم من الأعمال الصالحة، { في الأيام الخاليةِ } أي: الماضية في الدنيا، وعن مجاهد: أيام الصيام وقال ابن عباس: هي في الصائمين، أي: كلوا واشربوا بدل ما أمسكتم عن الأكل والشرب لوجه الله تعالى\n رُوي أن الله تعالى يقول:\n\n \" يا أوليائي، طالما نظرتُ إليكم في الدنيا، وقد قلَصَتْ شفاهكم عن الأشربة، وغارت أعينكم وخمصت بطونكم، فكونوا اليوم في نعيمكم، وكلوا واشربوا هنيئاً بما أسلفتم في الأيام الخالية \" \n\nولا تقصر الآية على الصوم، بل كل ما أسلف الإنسانُ من الأعمال الصالحة داخل في الآية، بدليل قوله تعالى:\n\n[الطور:19 والمراسلات:43]\n وهذه الآية وأمثالها هزّت قلوب المجتهدين، حتى عمَّروا أوقاتهم، وحافظوا على أنفاسهم لئلا تضيع، وكان عمر رضي الله عنه يقول: حاسبوا أنفسكم قبل أن تُحاسبُوا، فإنه أهون، أو أيسر لحسابكم، وزنوا أنفسكم قبل أن تُوزنوا وتجهّزوا للعرض الأكبر، يومئذ تعرضون لا تخفى منكم خافية\n\n\nهـ\n { وأمَّا مَن أُوتي كتابه بشِماله } ، ورأى ما فيه من قبائح الأعمال، { فيقول يا ليتني لم أُوتَ كتابيهْ } أي: لم أُعطَ كتابي، { ولم أّدْرٍ ما حسابيهْ } أي: يا ليتني لم أعلم حسابي، ولم أقف عليه، لِمَا شاهد من سوء العاقبة، { يا ليتها }: يا ليت الموتة التي متُّها { كانت القاضيةَ } أي: القاطعة لأمري، ولم أُبعث بعدها، ولم ألقَ ما لقيت، فضمير \" ليتها \" للموتة، ويجوز أن يكون لِما شاهده من الحالة، أي: يا ليت هذه الحالة كانت الموتة التي قُضيت عليَّ لأنه وجدها أَمَرّ من الموت، فتمناه عندها، وقد جوّز أن يكون للحياة الدنيا، أي: يا ليت الحياة الدنيا كانت الموتة ولم أُخْلَق حيًّا\n { ما أغنى عن مالِيَهْ } أي: ما نفعني ما جمعتُ من الأموال شيئاً، فـ \" ما \" نافية، أو استفهامية للإنكار، أي: أيُّ شيء أغنى عني ما كان لي من اليسار؟ { هلك عني سلطانيهْ } أي: مُلكي وعزي، وتسلُّطي على الناس، وبقيتُ فقيراً ذليلاً، أو: حُجتي التي كنت أحتجّ بها في الدنيا\n فيقول الله تعالى لخزنة جهنّم: { خُذوه فغُلُّوه } أي: فشُدُّوه بالأغلال، بأن تجمع يده إلى عنقه، { ثم الجحيم صَلُّوه } أي: أدخلوه، أي: لا تصلّوه إلاّ للجحيم، وهي النار العظيمة ليكون الجزاء على وفق المعصية، حيث كان يتعاظم على الناس، { ثم في سلسلة ذَرْعُها } أي: طُولها { سبعون ذراعاً } بذراع الملَك، وقيل: لا يعرف قدرها إلاّ الله، { فاسْلُكُوه } أي: فأدْخِلوه فيها، وقيل: تدخل من دبره وتخرج من منخريه، وقيل: تدخل من قُبله وتخرج من دبره\n { أِنه كان لا يُؤمن بالله العظيم } ، تعليل لاستحقاق العذاب، ووصفه تعالى بالعظيم للإيذان بأنه المستحق للعظمة وحده، فمَن نَسَبَها لنفسه استحقّ أعظم العقوبات، { ولا يَحُضُّ على طعام المسكين } أي: لا يحث على بذل طعام غيره، فضلاً عن أن يبذل ماله، وقيل: ذكر الحض للتنبيه على أنَّ تارك الحضّ إذا كان بهذه المنزلة، فما ظنك بتاركه؟ وفيه دلالة على أنَّ الكفار مخاطبون بالفروع، وأنَّ أقبح العقائد الكفر، وأشنع الرذائل البخل وقسوة القلب، وفيه أيضاً إشارة إلى أنه كان لا يؤمن بالبعث، لأنَّ إطعام المساكين إنما يرجى جزاؤه يوم القيامة، فإذا لم يؤمن بالبعث لم يكن له ما يحمله على إطعامهم، وفيه دليل على عِظم جُرم حرمان المساكين لأنّه عطفه على الكفر، وجعله دليلاً عليه وقرينَه\n وعن أبي الدرداء رضي الله عنه أنه كان يحضّ امرأته على تكثير المرق لأجل المساكين، ويقول: خلَعْنا نصفَ السلسلة بالإيمان، فلنخلع نصفها بهذا، أي: الصدقة\n قال النسفي: وهذه الآية ناطقة بأنَّ المؤمنين يُرحمون جميعاً، والكافرون لا يُرحمون لأنه تعالى قسّم الخلق صنفين، فجعل صنفاً منهم أهل اليمين، ووصفهم بالإيمان بقوله: { إني ظننتُ إني ملاقٍ حسابيه } ، وصنفاً منهم أهل الشمال، ووصفهم بالكفر بقوله: { إنه كان لا يؤمن بالله العظيم\n\n\n\n\n } الخ، وجاز أنَّ الذي يُعاقَب من المؤمنين إنما يعاقَب قبل أن يؤتَى كتابه بيمينه\n هـ\n قال ابن عطية: والذين يُعطون كتابهم بأيْمانهم هم المخلَّدون في الجنة من أهل الإيمان، واختلف العلماء في الفرقة التي ينفذ فيها الوعيد من أهل المعاصي، متى تأخذ كتبها؟ فقال بعضهم: الأظهر أنها تأخذها مع الناس، وذلك يُؤنسُها مدة العذاب، قال الحسن: فإذا أعطي كتابه بيمينه لم يقرأه حتى يأذن الله له، فإذا أَذِنَ له قال: { هاؤم اقرأوا كتابيه } ، وقال آخرون: الأظهر أنها إذا خرجوا من النار، والإيمان يؤنسُهم وقت العذاب، قال: وهذا هو ظاهر الآية لأنَّ مَن يسير إلى النار كيف يقول: { هاؤم اقرأوا كتابيه }\n ثم قال: والمخلَّدون في النار من أهل الكفر هم الذين يُؤتون كتابهم بشمالهم، وقال في آية الانشقاق: مَن ينفذ فيه الوعيد من العصاة، يُعطى كتابه عند خروجه من النار، وقد جَوّز قومٌ أن يُعطاه أولاً قبل دخوله النار، وهذه الآية ترد عليه\n هـ\n يعني قوله:\n\n[الانشقاق:9]\n قلت: والذي يظهر من الأحاديث التي في أخبار البعث: أنَّ الصحف تُنشر دفعة واحدة للطائع والعاصي، والمؤمن والكافر، فالمؤمن يأخذ كتابه بيمينه، فيُسرّ، فإن كان كاملاً فسُروره ظاهر، وإن كان عاصياً فرح أن مآله للجنة، ويجوز أن يُبهم الأمر عليه حينئذ، فيفرح لظنه النجاة، فإن مرَّ على الصراط زلّت قدمه لمكان معاصيه، فينفذ فيه الوعيد، ثم يخرج، وأمّا بعد خروجه من النار وحسابه حينئذٍ فبعيد جدًّا، لم يرد به نص\n قال الشيخ ابن أبي جمرة رضي الله عنه: عادته تعالى في التنزيل أن يذكر الكامل في الطاعة، والكامل في العصيان ـ أي: الكفرـ ويسكت عن المخلط، فدلَّ على أنه يرى من هذا ويرى من هذا\n هـ\n بالمعنى\n فالذي يقول: { هاؤم اقرأوا كتابيه } هو الكامل، أو الذي حوسب وعُفي عنه، وأمّا العاصي الذي ينفذ فيه الوعيد، فلعله يسكت\n والله تعالى أعلم، وسَتَرِد وتعلم\n ثم قال تعالى: { فليس له اليومَ هاهنا حميمٌ } أي: قريب يحميه ويدفع عنه لأنَّ أولياءه الذين يتحامونه يفرُّون منه، { ولا طعامٌ إِلاَّ من غِسْلِينٍ } وهو غسالة أهل النار وصديدُهم، فِعْلِين، من الغَسْلِ، والنون زائدة، والمراد: ما يسيل من جلودهم من الصديد والدم\n وقال ابن عزيز: غِسْلين: غسالة أجواف أهل النار، وكل جرح أو دبر غسلته، فخرج منه شيء، فهو غِسلين\n هـ\n { لا يأكُله إِلاّ الخاطئون } الكافرون، أصحاب الخطايا العظام\n من خَطِىء الرجل: إذا تعمَّد الذنب\n أو من الخطأ، المقابل للصواب، وهو هنا: مَن أخطأ طريقَ التوحيد، وعن ابن عباس: هم المشركون\n الإشارة: أهل اليمين مَن سبق لهم اليُمن في الأزل، وأهل الشمال مَن سبق لهم الشؤم كذلك\n\n\nوفي الحديث:\n\n \" إن الله قبض قبضة فقال: هؤلاء إلى الجنة ولا أبالي، ثم قبض أخرى، وقال: هؤلاء إلى النار ولا أبالي \" \n\nأي: لا أُبالي بما يعملون\n وقال القشيري: في إشارة الآية ما نصه: يشير إلى قوله عليه السلام في أثناء حديث طويل:\n\n \" قبض قبضة، فإذا فيها آدم وبنوه، فمسح بيده اليُمنى الجمالية اللطيفة على ظهره الأيمن الجمالي، فأخرج منها ذراريه، كالقبضة البيضاء، باليد الجمالية أصحاب اليمين، ثم مسح بيده اليسرى الجلالية القهرية، على ظهره الأيسر الجلالي، فأخرج منه ذريته كالحمصة السوداء، باليد الجلالية، أصحاب الشمال \" \n\nأول ما في معناه\n وقوله: كتابيه يُشير إلى الكتاب الاستعدادي، المكتوب في الأزل، على لوح جبين كل واحد، بما يعمل إلى الأبد\n هـ\n فالكتاب الذي يُعطى يوم القيامة نسخة مما سُطِّر على لوح الجبين، الموافق للأزل، فحكمته قيام الحُجة في الظاهر، فمَنْ سبق له سهم العناية تبجّح به، ويقول: هاؤم اقرأوا كتابيه، إني تحققت في الدنيا أني ملاقٍ حسابيهْ\n وعبَّر بالظن ستراً لأهل الظنون والخواطر، وتوسعة عليهم، فهم في الدارين في عيشة راضية، في الدنيا في روح الرضا ونسيم التسليم وجنة العرفان، وفي الآخرة في مقعد صِدق في جوار الرحمن، في جنة عالية، رفيعة القدر حسًّا ومعنىً، قُطوفها دانية\n أمّا جنة المعارف فقطوفها ما يتجتنى من ثمار العلوم، وفواكه الحِكم، وتزايد الفهوم، وأمّا في الآخرة فزيادة الترقي والكشف أبداً سرمداً، ويُقال لهم: كُلوا من قوت أرواحكم وأشباحكم، واشربوا من خمرة قلوبكم وأسراركم، من كأس المحبة، والاجتباء، هنيئاً لا كدر فيه ولا تعب، بما أسلفتم في أيام مجاهدتكم الماضية، ومَن سبق لهم سهم الشقاء يقول: يا ليته لم يكن شيئاً، ويتمنى بقاءه في حيز العدم، ثم يَلقى من أنواع العذاب الجسماني والروحاني، من البُعد والطرد ما ذكره الحق تعالى في بقية الآية، نعوذ بالله من سوء القضاء، ومن السلب بعد العطاء\n ثم أقسم تعالى على حقيّة ما ذكره، فقال: { فَلاَ أُقْسِمُ بِمَا تُبْصِرُونَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "84:7",
      "similarity": 0.07739314798838065
    },
    {
      "verse": "56:90",
      "similarity": 0.06493657221011744
    },
    {
      "verse": "17:71",
      "similarity": 0.04892996339244096
    },
    {
      "verse": "84:10",
      "similarity": 0.045319485195846734
    },
    {
      "verse": "69:25",
      "similarity": 0.04370894893251576
    }
  ]
}