{
  "chapter": "الحاقة",
  "text": "وحملت الارض والجبال فدكتا دكة وحدة",
  "translations": [
    {
      "translation": "and the earth and the mountains are lifted and crushed with a single blow,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth and mountains heaved and crushed to powder with one levelling blow,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the earth and the mountains are carried aloft and are crushed to bits at one stroke,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the earth and mountains will be raised up high and crushed all together.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth and the mountains will be lifted up and crushed with a single crush.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth and the mountains shall be removed from their places, and crushed with a single crushing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth and the mountains are borne away and crushed with a single crushing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the earth and the mountains are lifted up and crushed with a single blow,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth with the mountains shall be lifted up and crushed with one crash,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the earth and the mountains are lifted up and then crushed with a single blow,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth and the mountains shall be borne and the twain shall be crushed with a single crash.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the earth and the mountains are lifted and levelled with a single levelling,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth is moved, and its mountains, and they are crushed to powder at one stroke,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth and the mountains shall be removed from their places, and crushed with a single crushing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when the earth with all its mountains is lifted up and crushed with a single blow,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth and the mountains are lifted up, and crushed, with a single crush.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the earth and the mountains are lifted and leveled with one blow -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[69:14] and the earth and the mountains are lifted and levelled with a single levelling,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the earth with the mountains) it is said: what is on the earth of buildings and the mountains (shall be lifted up and crushed with one crash,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَحُمِلَتِ ٱلأَرْضُ وَٱلْجِبَالُ فَدُكَّتَا دَكَّةً وَاحِدَةً } معناه دَقةٌ واحدة\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"And the earth and the mountains are carried with ease,\" means that they are carried with one smooth movement.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعد ظهور النفخة الأولى { حُمِلَتِ } ورفعت { ٱلأَرْضُ وَٱلْجِبَالُ } من أماكنها التي استقرتا عليها بأن أمر عليهما سبحانه بالتسيير والاضطراب بمقتضى القدرة الغالبة { فَدُكَّتَا } انكسرتا وانبسطتا\n فصارتا { دَكَّةً وَاحِدَةً } [الحاقة: 14] أي: قاعاً صفصفاً\n مساواة ملساء لا عوج لها ولا أمتاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { فإِذا نُفخ في الصُّور نفخةٌ واحدةُ } ، وهي النفخة الأولى، وتموت عندها الخلائق، والثانية يحيون عندها، { وحُمِلتِ الأرضُ والجبالُ } أي: قلعت ورفعت عن أماكنها، بمجرد القدرة الإلهية، أو بتوسُّط الزلزلة، أو الريح العاصفة، { فدُكَّتا دَكَّةً واحدةً } أي: دقّتا وكسرتا، أي: ضُرب بعضها ببعض حتى تندق وترجع كثيباً مهيلاً وهباءً منثوراً، { فيومئذٍ } ، فحينئذ { وقعت الواقعةُ } أي: قامت القيامة بعدها، { وانشقتِ السماءُ } أي: فُتحت أبواباً لنزول الملائكة، { فهي } أي: السماء { يومئذٍ واهيةٌ } ضعيفة مسترخية، كالصوف أو القطن، بعدها كانت مُحْكَمة { والمَلَكُ } أي: جنس المَلك، وهو بمعنى الجمع، فهو أعمّ من الملائكة، { على أرجائها } جوانبها، جمع رَجاً، مقصور، أي: تنشق السماءِ، التي هي مسكنهم، فيلتجئون إلى أكنافها وأطرافها، { ويحملُ عرشَ ربك فوقهم } أي: فوق الملَك الذين هم على الأرجاء، { يومئذٍ ثمانيةٌ } من الملائكة، واليوم تحمله أربعة، وزيدت أربعة أخرى يوم القيامة إمداداً لتلك الأربعة\n رُوي عن رسول الله صلى الله عليه وسلم أنه قال:\n\n \" هم اليوم أربعة، فإذا كان يوم القيامة قوّاهم الله تعالى بأربعة أخرى \" \n\n، وقال ابن عباس: هي ثمانية صفوف من الملائكة، لا يعلم أحدٌ عِدتهم\n وقال ابن زيدٍ: هم ثمانية أملاك، على هيئة الوعول\n الوَعِلَ: تيسُ الجبل، وقيل: على هيئة الناس، أرجلهم تحت الأرض السابعة، وكواهلهم فوق السماء السابعة، والعرش فوق رؤوسهم، وهم مطرقون\n وفي بعض الأخبار: أنَّ الأربعة التي تحمل العرش اليوم أحدهم على صورة الإنسان، يطلب الرزق للأرض، والآخر على صورة الثور، يطلب الرزق للبهائم، والآخر على صورة النسر، يطلب الرزق للطيور، والآخر على صورة الأسد، يطلب الرزق للوحوش، وقيل: المراد بالآية: تمثيل لعظمة الله تعالى بما يُشاهَد من أحوال السلاطين، يوم خروجهم على الناس للقضاء العام، لكونها أقصى ما يتصور من العظمة والجلال، وإلاّ فشؤونه تعالى أجلَّ من كل ما يُحيط به فلك العبارة والإشارة\n { يومئذٍ تُعرضون } للسؤال والحساب، شبّه ذلك بعرض السلطان الجيشَ ليعرف أحواله، رُوي\n\n \" أن في القيامة ثلاث عَرْضَاتٍ، فأمّا عَرْضَتَان: فاعتذار واحتجاج، وأما الثالثة: ففيها تُنشر الكتب، فيأخذ الفائز كتابه بيمينه، والهالك بشماله \" \n\n، وهذا وإن كان بعد النفحة الثانية لكن لمّا كان اليوم اسماً لزمان متسع يقع فيه النفحتان، والصعقة والنشور والحساب، وإدخال أهل الجنةِ الجنةَ، وأهل النارِ النارَ، صحّ جعله ظرفاً للكل، وظاهر نظم الآية أنَّ نشر الموتى من القبور لا يكون إلاَّ بعد دك الأرض، وتسيير الجبال، فلا يقع النشر إلاّ على الأرض المستوية، لا ترى فيها عِوجاً ولا أمتاً، وأمّا انشقاق السماء فمؤخّر، يكون ـ والله أعلم ـ والناس في الموقف على ما في بعض أخبار الآخرة\n\n\nثم قال تعالى: { لا تخفى منكم خافيةٌ } أي: سريرةٌ ولا حالٌ كانت تخفى في الدنيا\n والجملة: حال من ضمير \" تُعرضون \" أي: تُعرضون غير خافٍ عليه تعالى السرائر، وقرأ أهل الكوفة غير عاصم بالياء لأن تأنيثها مجازي\n الإشارة: فإذا نُفخ في صور القلب الغافل، الخالي من الحياة الأبدية، نفخة واحدة، من همّة شيخ كامل، إما بوارد شوق مُقلق، أو خوف مُزعج، وحُملت أرض بشريته، وجبال عقله، فدُكتا دكةً واحدة، فغاب حس البشرية وانخنس، وغاب نور العقل عند سطوع أنوار شمس العرفان، فيومئذ وقعت الواقعة، أي: ظهرت الحقيقة العيانية، وبدلت الأرض غير الأرض، والسموات، فصار الجميع نوراً ملكوتياً، أو سرًّا جبروتيًّا، وانشقت سماء الأرواح فظهرت أسرار المعاني خلف رداء الأواني، فهي ـ أي: الأواني الحسية ـ يومئذ واهية ضعيفة متلاشية، لا وجود لها من ذاتها، والمَلك، اي: الواردات الإلهية، والخواطر الملكية، على أرجائها: على أطراف سماء الأرواح، يُلهمها العلوم اللدنية، والأعمال الصافية، ويحمل عرش ربك، أي: عرش معرفة الرب، وهو القلب، فهو سرير سلطان المعرفة، ومحل التجليات الذاتية، ثمانية: الصبر، والشكر، والورع، والزهد، والتوكل، والتسليم، والمحبة، والمراقبة، وهو عرش المعرفة، يومئذ تُعرض الخواطر على القلب، لا يخفى عليه منها شيء، فيقبل الحسَن، ويرفع القبيح\n والله تعالى أعلم\n وذكر في الحاشية الفاسية ما فوق العرش الحسي، وما تحت الأرض السفلى، فقال ما نصُّه: وفي حديث\n\n \" فوق السماء السابعة بحرٌ، بين أعلاه وأسفله، كما بين السماء والسماء، وفوق ذلك ثمانية أَوْعَالٍ، بين أظلافهِنَّ ورُكبهنَّ ما بين سماءٍ إلى سماء، وفوق ظهورهن العرش، بين أسفله وأعلاه ما بين سماء إلى السماء، والله تبارك وتعالى فوق ذلك \" \n\n، وفي حديث آخر:\n\n \" عدد الأرضين سبع، بين كل واحدة والآخرى خمسمائة سنة، والذي نفس محمد بيده لو أنكم دلّيتم بحبل إلى الأرض السفلى لهبط على الله \" \n\n، ثم قرأ صلى الله عليه وسلم:\n\n[الحديد:3]\n هـ\n فتحصل من حديث سيد العارفين، وقدوة الواصلين، أنَّ الحق ـ جلّ جلاله ـ محيط بكل شيء، فأسرار ذاته العلية أحاطت بالوجود بأسره\n فما فوق العرش هو عين ما تحت الثرى، فلو صعد أحد إلى ما فوق العرش لوجد الله، ولو هبط إلى ما تحت الأرض السفلى لوجد الله إذ عظمته أحاطته بكل شيء، ومحت وجود كل شيء\n واعلم أن الحق جلّ جلاله منفرد بالوجود، لا شيء معه، غير أنَّ عظمة الذات الخارجة عن دائرة قبضة التكوين باقية على أصلها من اللطافة والكنزية، والعظمةَ الداخلة في القبضة حين دخلها التكثيف، وتحسّست ليقع بها التجلِّي، استترت وتردّت برداء الكبرياء، فظهر فيها الضدان العبودية والربوبية، والحس والمعنى، والقدرة والحكمة، فاستترت الربوبية برداء الكبرياء، فكان من اصطلاح الوحي التنزيلي أن يُخبر عن العظمة الأصلية وينعت أوصافها، ويسكت عن العظمة الفرعية، التي وقع بها التجلِّي، ستراً لسر الربوبية أن يظهر، إذ لو ظهر لفسد نظام عالم الحكمة، ولذلك قال سهل رضي الله عنه: للألوهية سر لو انكشف لبطلت النبوات، وللنبوات سر لو انكشف لبطل العِلم، وللعلم سر لو انكشف لبطلت الأحكام\n\n\nهـ\n فَسِرُّ الألوهية هو قيامها بالأشياء، وظهورها بها، بل لا وجود للأشياء معها، فلو انكشف هذا السر لجميع الناس لاستغنوا عن العبادة والعبودية، ولبطلت أحكام النبوة، إذ النبوة إنما هي لبيان العبادة وآداب العبودية، وعند ظهور هذا السر يقع الاستغناء عن تلقي الوحي\n وأيضاً، ليست القلوب كلها تقدر على حمل هذا السر، فلو تجلّى للقلوب الضعيفة لوقع لها الدهش والحيرة، وربما أدّاها إلى التلف\n وسر النبوات هو سدل الحجاب بين الله وعباده، حتى يفتقر الناس إلى تلقي العلم بواسطة النبوة، فلو انكشف هذا الحجاب لوقع الاستغناء عن النبوة، لتلقِّيه حينئذ كشفاً بدونها من غير تكلُّف، وسر العلم هو إبهام العواقب، فلو انكشف هذا السر وعرف كل واحد مآله للجنة أو النار لبطلت الأحكام إذ مَن عرف أنه للجنة قطعاً استغنى عن العبادة ومَن عرف أنه للنار قطعاً انهمك في المعاصي، فأخفى الله هذا السر ليعمل كل واحد على الرجاء والخوف\n والله تعالى أعلم\n ثم قسّم الحق تعالى عباده إلى أهل الشقاوة والسعادة، وبيَّن مآلهما في الآخرة، وهو تفصيلٌ لأحكام العرض، فقال: { فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ بِيَمِينِهِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:21",
      "similarity": 0.8443631013816134
    },
    {
      "verse": "18:98",
      "similarity": 0.8427144433709979
    },
    {
      "verse": "7:143",
      "similarity": 0.4489988224793459
    },
    {
      "verse": "33:72",
      "similarity": 0.16091641058098904
    },
    {
      "verse": "26:184",
      "similarity": 0.1458956268250786
    }
  ]
}