{
  "chapter": "الحاقة",
  "text": "لنجعلها لكم تذكرة وتعيها اذن وعية",
  "translations": [
    {
      "translation": "to make it a reminder for you and something to be retained by retentive ears.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order to make it a warning for you, and that the ear retentive may preserve it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that We might make it an instructive event for you, and retentive ears might preserve its memory.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as a lesson for you, but only attentive ears will retain it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order to make it a remembrance for you, and in order that the ears that store may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We might make it an admonition for you and that it might be retained by the retaining ears.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that We may make it a reminder to you, and that the retaining ear might retain it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that We might make it a reminder for you and for heeding ears to hold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We might make it a memorial for you, and that remembering ears (that heard the story) might remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that We might make it a reminder for you and so that attentive ears might retain it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We might make it Unto you an admonition, and thot it might be retained by the retaining ears.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that We might make it a reminder for you, and that receptive ears might remember it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We might make it a Message unto you, and that ears (that should hear the tale and) retain its memory should bear its (lessons) in remembrance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We might make it a remembrance for you, and the keen ear (person) may (hear and) understand it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "making it a Reminder for you, for all attentive ears to retain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To make it a lesson for you—so that retaining ears may retain it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We might make it for you a reminder and [that] a conscious ear would be conscious of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[69:12] so that We might make it, namely, this act, the saving of the believers and the destruction of the disbelievers, a reminder, a lesson, for you and that receptive ears, [ears] which remember what they hear, might remember it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That We might make it) i.e. the ship of Noah; and it is said: this story (a memorial for you) an admonition so that you might learn a lesson, (and that remembering ears (that heard the story) might remember) might benefit from it; and it is also said that this means: so that a retentive heart might remember it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَتَعِيَهَآ أُذُنٌ وَاعِيَةٌ } معناه حافِظةٌ مؤمنةٌ سَمِعتْ وحَقَقتْ فأَسمعَتْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إنّا لما طغى } ماء طوفان الهيولى { حملناكم } في جارية الشريعة المركبة من الكمال العلمي والعملي { لنجعلها لكم تذكرة } لعالم القدس وحضرة الحق التي هي مقرّكم الأصلي ومأواكم الحقيقي { وتعيها أذن واعية } أي: تحفظها أذن حافظة لما سمعت من الله في بدء الفطرة باقية على حالها الفطرية غير ناسية لعهده وتوحيده، وما أودعها من أسراره بسماع اللغو في هذه النشأة وحفظ الباطل من الشيطان والإعراض عن جناب الرحمن، ولهذا لما نزلت قال النبي صلى الله عليه وسلم لعليّ عليه السلام:\n\n \" سألت الله أن يجعلها أذنك يا عليّ \" \n\n، إذ هو الحافظ لتلك الأسرار كما قال: \" ولدت على الفطرة وسبقت إلى الإيمان والهجرة \"\n { فإذا نُفِخ في الصور } هي النفخة الأولى التي للإماتة في القيامة الصغرى إذ يمنع حمله على الكبرى قوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنما حملناكم عليها وأنجيناكم بها { لِنَجْعَلَهَا } أي: هذه الفعلة الجميلة التي هي نجاة المؤمنين من الطوفان العظيم { لَكُمْ } أيها المستخلفون المكفلون { تَذْكِرَةً } عظة وعبرة، وتبصرة دالة على كمال قدرة الصانع الحكيم، ومتانة حكمته { وَتَعِيَهَآ } أي: تستحضر بها وتحفظها؛ أي: هذه التذكرة والتبصرة الكاملة { أُذُنٌ وَاعِيَةٌ } [الحاقة: 12] حافظة للعبر والتذاكير المورثة للقلوب الصافية الخائفة خيراً كثيراً، ونفعاً كبيراً\n\n\n\n\nوبعدما بالغ سبحانه في وصف القيامة، وشرح أهوالها وأحوالها، وذكر حال من كذب بها، ومآل أمره، أراد أن يشرح ما ظهر فيها من الأمور الهائلة والوقائع العظيمة عند قيامها ، فقال: { فَإِذَا نُفِخَ فِي ٱلصُّورِ نَفْخَةٌ وَاحِدَةٌ } [الحاقة: 13] وهي النفخة الأولى التي عندها خراب العالم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { لِنجعلَها } أي: الفعلة التي هي عبارة عن إنجاء المؤمنين وإغراق الكافرين { لكم تذكرةً } عِبرة ودلالة على كمال قدرته تعالى وحكمته، وقوة قهره، وسعة رحمته { وتَعِيَها } أي: تحفظها\n والوعي: أن تحفظ الشيء في نفسك، والإيعاء: أن تحفظه في غيرك، { أُذنٌ واعيةٌ } أي: أُذن مِن شأنها أن تحفظ ما يجب حفظه، بتذكيره وإشاعته والتفكُّر فيه، ولا تضيعة بترك العمل به\n والتنكير لدلالة قلتها\n قال قتادة: الأذن الواعية هي التي عقلت عن الله، وانتفعت بما سمعت\n وعن عليّ رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم:\n\n \" سألتُ الله تعالى أن يجعلها أذنَك يا علي \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "84:23",
      "similarity": 0.9589068970955824
    },
    {
      "verse": "70:18",
      "similarity": 0.9486951784299543
    },
    {
      "verse": "12:76",
      "similarity": 0.5936716347479943
    },
    {
      "verse": "14:25",
      "similarity": 0.08409562252459758
    },
    {
      "verse": "84:2",
      "similarity": 0.0819290986795376
    }
  ]
}