{
  "chapter": "الحاقة",
  "text": "واما من اوتى كتبه بشماله فيقول يليتنى لم اوت كتبيه",
  "translations": [
    {
      "translation": "But as for him who is given his Book in his left hand, he will say, 'If only I had not been given my Book",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But whosoever gets his ledger in his left hand, will say: \"Would that I were never given my ledger,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for him whose Record will be given to him in his left hand, he will exclaim: “Would that I had never been given my Record,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, those who will receive the books of the records of their deeds in their left hands will say, \"We wish that this record had never been given to us\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whoever is given his book in his left hand – he will say, “Alas, if only my account were not given to me!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who will be given his Record in his left hand, will say: \"I wish that I had not been given my Record!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for him who is given his book in his left hand he shall say: O would that my book had never been given me:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who is given his book in his left hand, he shall say, 'Would that I had not been given my book\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who is given his record in his left hand, he will say: Oh, would that I had not been given my book\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But he who is given his record in his left hand will say, \"If only I had never been given my Record\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then as to him who shall be vouchsafed his book in his left hand, he shall say: Oh! would that I had not been vouchsafed my book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who is given his book in his left hand, he will say, ‘I wish I had not been given my book,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And he that will be given his Record in his left hand, will say: \"Ah! Would that my Record had not been given to me!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who will be given his Record in his left hand, will say: \"I wish that I had not been given my Record!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But, he who is given his book in his left hand will say: 'Woe to me, would that my book had not been given to me!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for him who is given his book in his left hand, he will say, “I wish I was never given my book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for he who is given his record in his left hand, he will say, \"Oh, I wish I had not been given my record\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[69:25] But as for him who is given his book in his left hand, he will say, ‘O (yā is for calling attention [to something]) would that I had not been given my book,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But as for him who is given his record in his left hand) this refers to al-Aswad Ibn 'Abd al-Asad, the brother of Abu Salamah who was a disbeliever, (he will say: Oh, would that I had not been given my book) this book 689 of mine\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وأما من أوتي كتابه بشماله } أي: جانبه الأضعف النفساني الحيواني\n فيتحسر ويتندّم ويتوحش من تلك الصور والهيئات السمجة والقبائح التي نسيها وأحصاها الله ويتنفر منها ويتمنى الموت عندها ويتيقن أن الذي صرف عمره فيه وأكبّ بوجهه عليه من المال والسلطنة والجاه ما كان ينفعه بل يضرّه\n وهو معنى قوله: { يا ليتني لم أوت كتابيه } إلى آخره\n وينادى على لسان العزة والقهر الملكوت الموكل بعالم الكون والفساد من النفوس السماوية والأرضية أن { خذوه فغلوه } أي: قيدوه بما يناسب هيئات نفسه من الصور واحبسوه في سجين الطبيعة بما يمنع الحركات على وفق الإرادة من الأجرام { ثم } جحيم الحرمان ونيران الآلام { صلوه * ثم في سلسلة } الحوادث الغير المتناهية { فاسلكوه } ليتعذب بأنواع التعذيبات\n والسبعون في العرف عبارة عن الكثرة الغير المحصورة لا العدد المعين { إنه كان لا يؤمن بالله } أي: كل ذلك بسبب كفره واحتجابه عن الله وعظمته وشحه لمحبّة المال { فليس له اليوم ها هنا حميم } لاستيحاشه عن نفسه فكيف لا يستوحش غيره عنه وهو متنفر عن كل أحد حتى عن نفسه؟\n { ولا طعام إلاَّ من } غسالات أهل النار وصديدهم وقد شاهدناهم يأكلونها عياناً\n { فلا أقسم } بالظاهر والباطن من العالم الجسماني والروحاني\n الوجود كله ظاهراً وباطناً { وإنه لحقّ اليقين } أي: محض اليقين وهو الكلام الوارد من عين الجمع\n إذ لو نشأ من مقام القلب لكان علم اليقين\n ولو نشأ من مقام الروح لكان عين اليقين\n فلما صدر من مقام الوحدة كان حق اليقين\n أي: يقيناً حقاً صرفاً لا شوب له بالباطل الذي هو غيره\n نسب القول أولاً إلى الرسول ثم إلى الحق ليفيد التوحيد الذاتي\n ثم قال: { فسّبح باسم ربّك العظيم } أي: نزّه الله وجرّده عن شوب الغير بذاتك الذي هو اسمه الأعظم الحاوي للأسماء كلها لأن لا يظهر في شهودك تلوين من النفس أو القلب فتحتجب برؤية الاثنينية أو الأنائية وإلا كنت مشبِّهاً لا مسبِّحاً\n والله تعالى أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَمَّا مَنْ أُوتِيَ كِتَٰبَهُ بِشِمَالِهِ فَيَقُولُ } بعدما رأى تفصيل المعاصي والمقابح الصادرة منه في نشأة الاعتبار\n متمنياً متحسراً من كمال الضجرة والأسف المفرط: { يٰلَيْتَنِي لَمْ أُوتَ كِتَٰبِيَهْ } [الحاقة: 25] هذا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:41",
      "similarity": 0.6097538793512987
    },
    {
      "verse": "36:26",
      "similarity": 0.5202620867018736
    },
    {
      "verse": "7:17",
      "similarity": 0.5160107013067485
    },
    {
      "verse": "69:27",
      "similarity": 0.5153916183724802
    },
    {
      "verse": "50:17",
      "similarity": 0.5138430101342105
    }
  ]
}