{
  "chapter": "الحاقة",
  "text": "انه لقول رسول كريم",
  "translations": [
    {
      "translation": "that this is the word of a noble Messenger.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That this is indeed the word of the noble Messenger,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that this is the speech of an honourable Messenger,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "because the Quran is certainly the word of a reverent messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Qur’an is the speech of Allah with a gracious Noble Messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That this is verily the word of an honored Messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Most surely, it is the Word brought by an honored Apostle,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it is the speech of a noble Messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That it is indeed the speech of an illustrious messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "most surely, this is the word brought by a noble messenger,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That it is surely the speech brought by messenger honourable.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it is indeed the speech of a noble apostle\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That this is verily the word of an honoured messenger;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That this is verily the word of an honoured Messenger [i.e. Jibrael (Gabriel) or Muhammad SAW which he has brought from Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that this is the speech of a noble Messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is the speech of a noble messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[That] indeed, the Qur'an is the word of a noble Messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[69:40] it, that is to say, the Qur’ān, is indeed the speech of a noble messenger, in other words, he has spoken it as a message from God, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That it) i.e. the Qur'an (is indeed the speech of an illustrious messenger) He says: the Qur'an is the Word of Allah which Gabriel brought down to an illustrious messenger, i.e. Muhammad (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّهُ } أي: القرآن { لَقَوْلُ رَسُولٍ كَرِيمٍ } [الحاقة: 40] نفسه، لا يتأتى منه المراء والافتراء على الله؛ إذ هو منزه عن أمثال هذه الرذائل المنافية لمنصب الرسالة التي هي مرتبة الخلافة والنيابة عن المرسِل الكريم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والتحقيق: أنه أقسم بالكل { إِنه } أي: القرآن { لقولُ رسولٍ كريم } على الله، وهو محمد صلى الله عليه وسلم، أو جبريل عليه السلام، أي: يقوله ويتكلم به على وجه الرسالة من عند الله عزّ وجل، { وما هو بقولِ شاعرٍ } كما تزعمون تارة، { قليلاً ما تؤمنون } أي: إيماناً قليلاً تؤمنون، { ولا بقول كاهنٍ } كما تزعمون ذلك تارة أخرى، والكاهن هو الذي يُخبر عن بعض المضمرات فيُصيب بعضها ويخطىء أكثرها، ويزعم أنَّ الجن تُخبره بذلك، ويدخل فيه: مَن يُخبر عن المغيبات من جهة النجوم أو الحساب، { قليلاً ما تذكّرون } ، والقلة في معنى العدم، يقال: هذه أرض قلما تُنبت أي: لا تنبت أصلاً، والمعنى: لا تؤمنون ولا تذكرون ألبتّة\n وقال ابن عطية: يحتمل أن تكون ما نافية فينتفي إيمانهم ألبتة، ويحتمل أن تكون مصدرية، فيتصف إيمانهم بالقلة، ويكون إيماناً لغوياً لأنهم صدّقوا بأشياء يسيرة، لا تغني شيئاً\n هـ\n فتحصل في ما ثلاثة أقوال المشهور: أنها زائدة لتأكيد القلة\n قال أبو السعود: قيل: ذكر الإيمان مع نفي الشاعرية لأنّ عدم مشابهة القرآن للشِعر أمر بيِّن، لا يُنكره إلاَّ معاند، بخلاف مباينته للكهانة فإنه يتوقف على تذكُّر أحواله صلى الله عليه وسلم ومعاني القرآن المنافية لطريقة الكهنة، ومعاني أقوالهم، وأنت خبير بأنَّ ذلك أيضاً مما لا يتوقف على تأمُّل قطعاً\n وقُرىء بالياء فيهما\n هـ\n { تنزيلٌ من رَبِّ العالمين } أي: هو تنزيل، وهو تقرير لكنه قول رسول كريم، نزل عليه من رب العالمين، أنزله على لسان جبريل صلى الله عليه وسلم، { ولو تقوَّل علينا } محمد { بعضَ الأقاويل } أي: ولو ادّعى علينا شيئاً لم نَقُلْهُ افتراء علينا\n سَمَّى الافتراء تقوُّلاً لأنه قول متكلّف، والأقوال المفتراة أقاويل، تحقيراً لها، كأنها جمع أفعولة، من القوْل، كالأضاحيك، { لأخذنا منه باليمين } أي: لقتلناه صبراً، كما تفعل الملوك بمَن يَكذب عليهم، مُعاجلةً بالسخط والانتقام، فصوّر قتل الصبر بصورته ليكون أهْول، وهو أن يأخذ بيده، وتضرب رقبته، وخصَّ اليمين لأنَّ القتَّال إذا أراد أن يوقع الضرب في قفاه أخذ بيساره، وإذا أراد أن يوقعه في جيده، وهو أن يكفحه بالسيف ـ وهو أشد على المصبور لنظره إلى السيف ـ أخذه بيمينه، ومعنى { لأخذنا منه باليمين }: لأخذنا بيمينه، { ثم لقطعنا منه الوتينَ } أي: لقطعنا وتينه، وهو نياط القلب، إذا قطع مات صاحبه\n\n\n{ فما منكم } ، الخطاب للناس، أو المسلمين، { مِن أحدٍ } \" من \" زائدة، { عنه } أي: عن القتل أو المقتول، { حاجزين } دافعين، وجمعَه، وإن كان وصفاً لـ \" أحد \" لأنه في معنى الجماعة لأنَّ النكرة بعد النفي تعم\n { وإِنه } أي: القرآن { لتذكرةٌ } لَعِظةٌ { للمتقين } لأنهم المنتفعون به، { وإِنَّا لَنَعْلَمُ أَنَّ مِنكُم مُكَذِّبِينَ } فنُجازيهم على تكذيبهم، { وإِنه لحسرةٌ على الكافرين } عند مشاهدتهم لثواب المؤمنين له، { وإِنه لَحقُّ اليقين } أي: محض اليقين الذي لا يحوم حوله ريب ما، وحق اليقين فوق عين اليقين على ما يأتي\n { فسَبِّحْ باسم ربك العظيمِ } أي: فَسبِّح بذكر اسمه العظيم، تنزيهاً عن التقوُّل عليه، شكراً على ما أوحي إليك، أي: قل سبحان الله العظيم شكراً لنعمة الوحي والاصطفاء\n الإشارة: أقسم تعالى بذاته المقدسة، ما وقع به التجلِّي وما لم يقع، أي: ما ظهر منها في عالَم الشهادة، وما لم يظهر، على حقيّة القرآن، وأنه خرج من حضرة الحق، إلى الرسول الحق، ناطقاً بالحق، على لسان السفير الحق، متجلِّياً من ذات الحق، واصلاً من الحق إلى الحق، مشتملاً على علم اليقين، وعين اليقين، وحق اليقين، فعلم اليقين: ما أدراك من جهة البرهان، وعين اليقين: ما أدراك بالكشف والبيان، وحق اليقين: ما أدراك بالشمول والبيان، ومثال ذلك تقريباً، وجود مكة مثلاً، فمَن لم يرها فقد حصل له بالإخبار علم اليقين، ومَن رآها، ولم يدخلها، فقد حصل له عين اليقين، ومَن دخلها وعرف أماكنها وأزقتها، فقد حصل له حق اليقين، وكذلك شهود الحق تعالى، فمَن تحقق بوجوده من جهة الدليل فعنده علم اليقين، ومَن كشف له عن حس الكائنات، وشاهد أسرار الذات، لكنه لم يتمكن من دوام شهودها، فعنده عين اليقين، ومَن تمكن مِن شهودها ورسخ في المعرفة، فعنده حق اليقين\n وبالله التوفيق، وصلّى الله على سيدنا محمد وآله وسلّم\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "81:19",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "82:11",
      "similarity": 0.8527105483893568
    },
    {
      "verse": "70:35",
      "similarity": 0.8010340264504957
    },
    {
      "verse": "36:27",
      "similarity": 0.7489657050619207
    },
    {
      "verse": "56:77",
      "similarity": 0.7421425496563449
    }
  ]
}