{
  "chapter": "الحاقة",
  "text": "سخرها عليهم سبع ليال وثمنية ايام حسوما فترى القوم فيها صرعى كانهم اعجاز نخل خاوية",
  "translations": [
    {
      "translation": "Allah subjected them to it for seven whole nights and eight whole days without a break. You could see the people flattened in their homes just like the hollow stumps of uprooted palms.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which He sent to assail them for seven nights and eight days running. You should have seen the people prostrate like the decayed trunks of date-palm trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "which He let loose upon them for seven nights and eight days in succession; so that (if you had been there) you might have seen people lying prostrate, as though they were uprooted trunks of hollowed palm trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "which continued to strike them for seven and eight days so that eventually you could see the people lying dead like the hollow trunks of uprooted palm-trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He forced it upon them with strength, consecutively for seven nights and eight days – so you would see those people overthrown in it, like trunks of date palms fallen down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which Allah imposed on them for seven nights and eight days Husum, so that you could see men lying toppled, as if they were trunks of date palms, Khawiyah!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which He made to prevail against them for seven nights and eight days unremittingly, so that you might have seen the people therein prostrate as if they were the trunks of hollow palms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "violent that He compelled against them seven nights and eight days, uninterruptedly, and thou mightest see the people laid prostrate in it as if they were the stumps of fallen down palm-trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which He imposed on them for seven long nights and eight long days so that thou mightest have seen men lying overthrown, as they were hollow trunks of palm-trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "which God let loose against them for seven nights and eight days unremittingly, so that you could have seen its people lying prostrate as though they were the hollow trunks of palm-trees which had fallen down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To which He subjected them for seven nights and eight days in succession, so that thou mightest have seen men during it lying prostrate, as though they were stumps of palms ruined.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "which He clamped on them for seven gruelling nights and eight days, so that you could see the people there lying about prostrate as if they were hollow trunks of palm trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He made it rage against them seven nights and eight days in succession: so that thou couldst see the (whole) people lying prostrate in its (path), as they had been roots of hollow palm-trees tumbled down!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which Allah imposed on them for seven nights and eight days in succession, so that you could see men lying overthrown (destroyed), as if they were hollow trunks of date-palms!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that He subjected upon them for seven nights and eight days consecutively and you might have seen them struck down as if they were the stumps of palm trees that had fallen down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He unleashed it upon them for seven nights and eight days, in succession. You could see the people tossed around, as though they were stumps of hollow palm-trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Which Allah imposed upon them for seven nights and eight days in succession, so you would see the people therein fallen as if they were hollow trunks of palm trees.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[69:7] He forced it upon them for seven nights and eight days, the first of which was the morning of Wednesday, eight days before the end of [the month of] Shawwāl, and this was at the height of winter, successively, one after the next (husūman: it [the action of the wind] is likened to the repeated actions of a hāsim, ‘one cauterizing a wound’, time and again until it [the blood] has been cut off, inhsama) so that you might have seen the people therein lying prostrate, lying dead on the ground, as if they were the hollow, collapsed, trunks of palm-trees.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Which He imposed on them) uninterruptedly (for seven long nights and eight long days) with the same force (so that thou mightest have seen men) the people of Hud (lying) destroyed and (overthrown) in these days and nights; and it is said: in the wind, (as they were hollow trunks of palm-trees.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { سَخَّرَهَا عَلَيْهِمْ } معناه أَدامَها عَلَيهِمْ\n\n\n\n\nوقوله تعالى: { سَبْعَ لَيَالٍ وَثَمَانِيَةَ أَيَّامٍ حُسُوماً } معناه مُتتابعاتٌ مُتوالياتٌ\n\n\n\n\nوقوله تعالى: { كَأَنَّهُمْ أَعْجَازُ نَخْلٍ خَاوِيَةٍ } معناه أصولُها خَاويةٌ يعني دَراسة\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {He has made it subservient to them}, means that He has made it subject to them.\n\nAnd His saying, the Most High, {seven nights and eight days without} meaning successive consecutive.\n\n\nAnd His saying, {As if they were a tree that has been cut down} means that its roots are cut off, meaning that it is studied.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nحين { سَخَّرَهَا } وسلطها { عَلَيْهِمْ } سبحانه بمقتضى قهره وانتقامه { سَبْعَ لَيَالٍ وَثَمَانِيَةَ أَيَّامٍ حُسُوماً } متتابعات مترادفات\n قاطعات قالعات { فَتَرَى } أيها المعتبر الرائي { ٱلْقَوْمَ فِيهَا } أي: في تلك الأيام والليالي { صَرْعَىٰ } هلكى { كَأَنَّهُمْ أَعْجَازُ نَخْلٍ خَاوِيَةٍ } [الحاقة: 7] ساقطة عن أصولها\n لا جوف لها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ سَخَّرَها عليهم } أي: سلَّطها عليهم\n وهو استئناف جيء به لبيان كيفية إهلاكهم بها\n { سَبْعَ ليالٍ وثمانيةَ أيام حُسوماً } أي: متتابعات\n جمع حاسم\n كشهود وشاهد\n تمثيلاً لتتابعها بتتابع فعل الحاسم في إعادة الكيّ كرة بعد أخرى حتى ينحسم الداء\n أو: محسمات\n حسمت كل خير واستأصلته\n أو قاطعات قطعت دابرهم\n وهو حال\n ويجوز أن يكون مصدراً\n أي: تحسمه حسوماً\n أي: تستأصلهم استئصالاْ\n ويؤيده قراءة الفتح\n وكانت العرب تُسمي هذه الأيام أيام العجوز\n من صبيحة الأربعاء إلى غروب الأربعاء الآخر\n وإنما سميت بذلك لأنّ عجوزاً من عاد توارت في سِرب\n فانتزعَتها الريحُ في اليوم الثامن\n فأهلكتها\n وقيل: سميت عجوزاً لأنها في عَجُز الشتاء\n أي: آخره\n وأسماؤها: الصِنُّ\n والصنْبَرِ\n والوَبْر\n والآمر\n والمُؤْتمر والمُعلِّل\n ومُطْفىء الجمْر\n واليوم الثامن مكفي الظُّعن\n { فترى القومَ } إن كنت حاضراً حينئذ { فيها } أي: في تلك الليالي والأيام\n أو في مهابَّها\n أو في ديارهم { صَرْعَى } موتى هلكى\n جمع صريع\n { كأنهم أعجازُ نخلٍ } أي: أصول نخل\n جمع نخلة\n { خاويةٍ }\n ساقطة\n أو بالية متآكلة الأجواف\n وكانت أجسامهم طوالاً\n تبلغ مائة ذراعٍ\n أو مائتين\n ولذلك شُبّهوا بالنخل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:52",
      "similarity": 0.15024672468153044
    },
    {
      "verse": "18:42",
      "similarity": 0.1349479810265403
    },
    {
      "verse": "22:45",
      "similarity": 0.08102996772545079
    },
    {
      "verse": "2:259",
      "similarity": 0.08080758556645273
    },
    {
      "verse": "54:20",
      "similarity": 0.06839205890975868
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/69:7.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/69:7.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/69:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}