{
  "chapter": "الأنعام",
  "text": "الحمد لله الذى خلق السموت والارض وجعل الظلمت والنور ثم الذين كفروا۟ بربهم يعدلون",
  "translations": [
    {
      "translation": "ALL PRAISE BE to God who created the heavens and the earth, and ordained darkness and light. Yet the unbelievers make the others equal of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise is for Allah alone, Who created the heavens and the earth, and brought into being light and darkness, and yet those who have rejected the call of the Truth ascribe others to be equals to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only God Who has created the heavens, the earth, darkness, and light deserves all praise. The disbelievers consider other things equal to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise is to Allah, Who has created the heavens and the earth, and has created darkness and light; yet the disbelievers appoint equals (false deities) to their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise be to Allah, Who created the heavens and the earth, and originated the darkness and the light, yet those who disbelieve hold others as equal with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise is due to Allah, Who created the heavens and the earth and made the darkness and the light; yet those who disbelieve set up equals with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise belongs to God who created the heavens and the earth and appointed the shadows and light; then the unbelievers ascribe equals to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to Allah, Who hath created the heavens and the earth, and hath appointed darkness and light. Yet those who disbelieve ascribe rivals unto their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to God, who has created the heavens and the earth and brought into being darkness and light. Yet those who deny the truth set up equals to their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise unto Allah, who created the heavens and the earth and made the darknesses and the light, yet those who disbelieve equalise others with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise belongs to Allah who created the heavens and the earth and made the darkness and the light. Yet the faithless equate [others] with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be Allah, Who created the heavens and the earth, and made the darkness and the light. Yet those who reject Faith hold (others) as equal, with their Guardian-Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praises and thanks be to Allah, Who (Alone) created the heavens and the earth, and originated the darkness and the light, yet those who disbelieve hold others as equal with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise is due to Allah, who has created the heavens and the earth and made darkness and light. Yet the unbelievers make (others) equal with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to God, Who created the heavens and the earth, and made the darkness and the light. Yet those who disbelieve ascribe equals to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[All] praise is [due] to Allah, who created the heavens and the earth and made the darkness and the light. Then those who disbelieve equate [others] with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:1] Praise, which means to describe in beautiful terms, be, [ever] established, to God: is this meant to be informative, so that one believes in it? Or, is it meant as a eulogy, or both? These are three possibilities, the most likely of which is the last, as the Shaykh [Jalāl al-Dīn al-Mahallī] states in [his commentary on] sūrat alKahf [Q. 18:1]; Who created the heavens and the earth — He singles out these two for mention because for the observer they constitute the most awesome [visible] creation; and He appointed, He created, darknesses and light, that is, every darkness (zulma) and every light: the use of the plural only in the case of the former is because it [darkness] has many causes; and this is one of the proofs of His Oneness; then those who disbelieve, despite the existence of this proof, ascribe equals to their Lord, they worship others equally.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And on his authority from Ibn 'Abbas, regarding Allah's saying (Praise be to Allah) he said: '(Praise be to Allah) Allah says: gratitude and godhood are Allah's, (Who hath created the heavens) in two days: Sunday 131 and Monday (and the earth) in two days: Tuesday and Wednesday, (and has appointed darkness and light) He created faith and disbelief or night and day. (Yet those who disbelieve) the unbelievers of Mecca (ascribe rivals) idols (unto their Lord).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأَخبرنا أَبو جعفر، قَالَ حدّثنا عَليُّ بن أَحمد، قَالَ حدَّثنا عطاءُ بن السائب قالَ: حدَّثنا أبو خالد الواسطي عَن الإِمَامِ الشَّهيدِ أَبي الحسين زيد بن علي عليهما السَّلامُ\n في قولهِ تعالى: { وَجَعَلَ ٱلظُّلُمَٰتِ وَٱلنُّورَ } معناهُ خَلَقَها\n والظُّلماتُ الكُفرُ\n والنُّورُ: الإِيمانُ\n\n\n\n\nوقوله تعالى: { بِرَبِّهِمْ يَعْدِلُونَ } معناهُ يَجْعَلُونَ لَهُ مِثْلاً\n ويُشْركُونَ بهِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الحَمْدُ لله الذي خَلَقَ السموات والأرض } ظهور الكمالات، وصفات الجمال والجلال على مظاهر تفاصيل الموجودات بأسرها الذي هو كمال الكل",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلْحَمْدُ } والثناء المشعر بالإطاعة والانقياد المنبأ عن التعظيم والتبجيل الذاتي الصادر عن ألسنة جميع من يدخل في حيطة الوجود، المعترف بتوحيده سبحانه وتفريده استقلالاً ثابتاً { للَّهِ } المستقل بالألوهية، المتوحد في الربوبية، المستحق في العبودية، وكيف لا يستحق سبحانه مع أنه القادر { ٱلَّذِي خَلَقَ } وقدر { ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } أي: أظهر علويات الأسماء والصفات وسفليات الطبيعة العدمية القابلة لانعكاس أشعة العلويات { وَجَعَلَ ٱلظُّلُمَٰتِ } أي: أنشأ حجب التعينات { وَٱلنُّورَ } أيك ظل الوجود المنبسط عليها { ثْمَّ } بعدما ظهر إشراق نور الوجود، ولمع أضاء شمس الذات { ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمْ } أي: ستروا بهويتهم الباطلة هويته الحقيقة السارة في الآفاق أزلاً وأبداً { يَعْدِلُونَ } [الأنعام: 1] يميلون وينحرفون عن طريق الحق جهلاً وعناداً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ثم الذين كفروا }: عطف على جملة الحمد على معنى: أن الله حقيق بالحمد على ما خلقه، نعمةً على العباد، ثم الذين كفروا بربهم الذي ربَّاهم بهذه النعم، يَعدِلون به سواه من الأصنام، يقال: عدَلت فلانًا بفلان جعلته نظيره، أو عطف على \" خلَق وجعل \": على معنى أنه خلق وقدّر ما لا يقدر عليه غيره، ثم هم يعدلون به ما لا يقدر على شيء\n ومعنى { ثم }: استبعاد عدولهم بعد هذا البيان\n والباء في \" بربهم \" متعلقة بكفروا، على الأول، وبيعدلون على الثاني، قاله البيضاوي\n يقول الحقّ جلّ جلاله: { الحمد لله } أي: جميع المحامد إنما يستحقها الله، إذ ما بكم من نعمة فمن الله\n { الذي خلق السماوات } التي تُظِلُّكم، مشتملة على الأنوار التي تضيء عليكم، ومحلاً لنزول الرحمات والأمطار عليكم، { و } خلق { الأرض } التي تُقلُّكم، وفيها نبات معاشكم في العادة، وفيها قراركم في حياتكم وبعد مماتكم، مشتملة على بحار وأنهار، وفواكه وثمار، وبهجة أزهار ونِوار، { وجعل الظلمات } التي تستركم، راحة لأبدانكم وقلوبكم، كظلمات الليل الذي هو محل السكون\n { و } جعل { النور } الذي فيه معاشكم وقوام أبدانكم وأنعامكم\n { ثم الذين كفروا } بعد هذا كله، { يعدلون } عنه إلى غيره، أو يعدلون به سواه، فيُسوَونه في العبادة معه\n قال البيضاوي: وجمع السماوات دون الأرض وهي مثلهن لأن طبقاتها مختلفة بالذات، متفاوتة الآثار والحركات، وقدَّمها لشرفها وعلو مكانها\n ثم قال أيضًا: وجمع الظلمات لكثرة أسبابها والأجرام الحاملة لها، أو لأن المراد بالظلمة: الضلال، وبالنور: الهُدى\n والهدى واحد والضلال متعدد\n وتقديمها لتقدم الإعدام على المَلَكَهِ\n ومن زعم أن الظلمة عرَضٌ يُضاد النور احتج بهذه الآية، ولم يعلم أن عدم الملكَة كالعمي ليس صِرف العدم حتى لا يتعلق به الجعل\n هـ\n الإشارة: أثنى الحقّ ـ جلّ جلاله ـ على نفسه بإنشاء هذه العوالم، التي هي محل ظهور عظمته وجلاله وجماله وبهائه\n فأنشأ سموات الأرواح، التي هي مظهر لشروق أنوار ذاته وصفاته، ومحل لظهور عظمة ربوبيته، وأنشأ أرض النفوس، التي هي مظهر لتصرف أقداره، ومحل لظهور آداب عبوديته، وتجلى بين الضدين بين الظلمات والنور، ليقع الخفاء في الظهور، كما قال بعض الشعراء:\n",
      "translations": []
    }
  ]
}