{
  "chapter": "الأنعام",
  "text": "الحمد لله الذى خلق السموت والارض وجعل الظلمت والنور ثم الذين كفروا۟ بربهم يعدلون",
  "translations": [
    {
      "translation": "Praise belongs to Allah who created the heavens and the earth and appointed darkness and light. Then those who are kafir make others equal to their Lord!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "ALL PRAISE BE to God who created the heavens and the earth, and ordained darkness and light. Yet the unbelievers make the others equal of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise is for Allah alone, Who created the heavens and the earth, and brought into being light and darkness, and yet those who have rejected the call of the Truth ascribe others to be equals to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Only God Who has created the heavens, the earth, darkness, and light deserves all praise. The disbelievers consider other things equal to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise is to Allah, Who has created the heavens and the earth, and has created darkness and light; yet the disbelievers appoint equals (false deities) to their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise be to Allah, Who created the heavens and the earth, and originated the darkness and the light, yet those who disbelieve hold others as equal with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise is due to Allah, Who created the heavens and the earth and made the darkness and the light; yet those who disbelieve set up equals with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise belongs to God who created the heavens and the earth and appointed the shadows and light; then the unbelievers ascribe equals to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to Allah, Who hath created the heavens and the earth, and hath appointed darkness and light. Yet those who disbelieve ascribe rivals unto their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to God, who has created the heavens and the earth and brought into being darkness and light. Yet those who deny the truth set up equals to their Lord!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise unto Allah, who created the heavens and the earth and made the darknesses and the light, yet those who disbelieve equalise others with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praise belongs to Allah who created the heavens and the earth and made the darkness and the light. Yet the faithless equate [others] with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be Allah, Who created the heavens and the earth, and made the darkness and the light. Yet those who reject Faith hold (others) as equal, with their Guardian-Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All praises and thanks be to Allah, Who (Alone) created the heavens and the earth, and originated the darkness and the light, yet those who disbelieve hold others as equal with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise is due to Allah, who has created the heavens and the earth and made darkness and light. Yet the unbelievers make (others) equal with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Praise be to God, Who created the heavens and the earth, and made the darkness and the light. Yet those who disbelieve ascribe equals to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[All] praise is [due] to Allah, who created the heavens and the earth and made the darkness and the light. Then those who disbelieve equate [others] with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:1] Praise, which means to describe in beautiful terms, be, [ever] established, to God: is this meant to be informative, so that one believes in it? Or, is it meant as a eulogy, or both? These are three possibilities, the most likely of which is the last, as the Shaykh [Jalāl al-Dīn al-Mahallī] states in [his commentary on] sūrat alKahf [Q. 18:1]; Who created the heavens and the earth — He singles out these two for mention because for the observer they constitute the most awesome [visible] creation; and He appointed, He created, darknesses and light, that is, every darkness (zulma) and every light: the use of the plural only in the case of the former is because it [darkness] has many causes; and this is one of the proofs of His Oneness; then those who disbelieve, despite the existence of this proof, ascribe equals to their Lord, they worship others equally.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجملة { الحمد لله } تفيد استحقاق الله تعالى الحمد وحده دون غيره لأنّها تدلّ على الحصر . واللام لتعريف الجنس ، فدلّت على انحصار استحقاق هذا الجنس لله تعالى . وقد تقدّم بيان ذلك مستوفى في أول سورة الفاتحة .ثم إنّ جملة { الحمد لله } هنا خبر لفظاً ومعنىً إذ ليس هنا ما يصرف إلى قصد إنشاء الحمد بخلاف ما في سورة الفاتحة لأنّه عقّب بقوله : { إيّاك نعبد } \\[ الفاتحة : 5 \\] إلى آخر السورة ، فمن جوّز في هذه أن تكون إنشاء معنى لم يُجد التأمّل .فالمعنى هنا أنّ الحمد كُلّه لا يستحقّه إلاّ الله ، وهذا قصر إضافي للردّ على المشركين الذين حمدوا الأصنام على ما تخيّلوه من إسدائها إليهم نعماً ونصراً وتفريج كربات ، فقد قال أبو سفيان حين انتصر هو وفريقه يوم أحُد : أعلُ هُبل لنا العُزّى ولا عُزّى لكم . ويجوز أن يكون قصراً حقيقياً على معنى الكمال وأنّ حمد غيره تعالى من المنعمين تسامح لأنّه في الحقيقة واسطة صورية لجريان نعمة الله على يديه ، والمقصود هو هو ، وهو الردّ على المشركين ، لأنّ الأصنام لا تستحقّ الحمد الصوري بله الحقيقي كما قال إبراهيم عليه السلام «لمَ نعْبُدُ ما لا يسمع ولا يُبْصر ولا يُغْني عنك شيئاً» . ولذلك عقّبت جملة الحمد على عظيم خلق الله تعالى بجملة { ثم الذين كفروا بربّهم يعدلون }.والموصول ، في محلّ الصفة لاسم الجلالة ، أفاد مع صلته التذكير بعظيم صفة الخلق الذي عمّ السماوات والأرض وما فيهنّ من الجواهر والأعراض . وذلك أوجز لفظ في استحضار عظمة قدرة الله تعالى . وليس في التعريف بالموصولية هنا إيذان بتعليل الجملة التي ذكرت قبله ، إذ ليست الجملة إنشائية كما علمت . والجملة الخبرية لا تعلّل ، لأنّ الخبر حكاية ما في الواقع فلا حاجة لتعليله . فالمقصود من الأوصاف التمهيد لقوله بعدُ { ثم الذين كفروا بربّهم يعدلون }.وجمع : { السماوات } لأنّها عوالم كثيرة ، إذ كلّ كوكب منها عالم مستقلّ عن غيره ، ومنها الكواكب السبعة المشهورة المعبّر عنها في القرآن بالسماوات السبع فيما نرى . وأفرد الأرض لأنّها عالم واحد ، ولذلك لم يجيء لفظ الأرض في القرآن جمعاً .وقوله : { وجعل الظلمات والنور } أشار في «الكشاف» أنّ ( جعلَ ) إذا تعدّى إلى مفعول واحد فهو بمعنى أحدث وأنشأ فيقارب مرادفة معنى ( خلق ). والفرق بينه وبين ( خلق ) ؛ فإنّ في الخلق ملاحظة معنى التقدير ، وفي الجعل ملاحظة معنى الانتساب ، يعني كون المجعول مخلوقاً لأجل غيره أو منتسباً إلى غيره ، فيعْرف المنتسب إليه بمعونة المقام . فالظلمات والنور لمّا كانا عرضين كان خلقهما تكويناً لتُكيَّف موجودات السماوات والأرض بهما . ويعرف ذلك بذكر { الظلمات والنور } عقب ذكر { السماوات والأرض } ، وباختيار لفظ الخلق للسماوات والأرض ، ولفظ الجعل للظلمات والنور ، ومنه قوله تعالى :{ هو الذي خلقكم من نفس واحدة وجعل منها زوجها } \\[ الأعراف : 189 \\] فإنّ الزوج وهو الأنثى مراعى في إيجاده أن يكون تكملة لخلق الذكر ، ولذلك عقّبه بقوله : { ليسكن إليها } \\[ الأعراف : 189 \\] والخلق أعمّ في الإطلاق ولذلك قال تعالى في آية أخرى { يأيها النّاس اتّقوا ربّكم الذي خلقكم من نفس واحدة وخلق منها زوجها } \\[ النساء : 1 \\] لأنّ كلّ تكوين لا يخلو من تقدير ونظام .وخَصّ بالذكر من الجواهر والأعراض عرضين عظيمين ، وهما : الظلمات والنور فقال { وجعل الظلمات والنور } لاستواء جميع الناس في إدراكهما والشعور بهما . وبذكر هذه الأمور الأربعة حصلت الإشارة إلى جنسي المخلوقات من جواهر وأعراض . فالتفرقة بين فعل ( خلق ) وفعل ( جعل ) هنا معدود من فصاحة الكلمات . وإنّ لكلّ كلمة مع صاحبتها مقاماً ، وهو ما يسمّى في عرف الأدباء برشاقة الكلمة ففعل ( خلق ) ألْيق بإيجاد الذوات ، وفعل ( جعل ) أليق بإيجاد أعراض الذوات وأحوالها ونظامها .والاقتصار في ذكر المخلوقات على هذه الأربعة تعريض بإبطال عقائد كفار العرب فإنّهم بين مشركين وصابئة ومجوس ونصارى ، وكلّهم قد أثبتوا آلهة غير الله؛ فالمشركون أثبتوا آلهة من الأرض ، وَالصابئة أثبتوا آلهة من الكواكب السماوية ، والنصارى أثبتوا إلهية عيسى أو عيسى ومريم وهما من الموجودات الأرضية ، والمجوس وهم المانوية ألّهوا النور والظلمة ، فالنور إله الخير والظلمة إله الشرّ عندهم . فأخبرهم الله تعالى أنّه خالق السماوات والأرض ، أي بما فيهم ، وخالق الظلمات والنور .ثم إنّ في إيثار الظلمات والنور بالذكر دون غيرهما من الأعراض إيماء وتعريضاً بحالِيْ المخاطبين بالآية من كفر فريق وإيمان فريق ، فإنّ الكفر يشبه الظلمة لأنّه انغماس في جهالة وحيرة ، والإيمان يشبه النور لأنّه استبانة الهدى والحقّ . قال تعالى : { يخرجهم من الظلمات إلى النور } \\[ البقرة : 257 \\]. وقدّم ذكرالظلمات مراعاة للترتّب في الوجود لأنّ الظلمة سابقة النور ، فإنّ النور حصل بعد خلق الذوات المضيئة ، وكانت الظلمة عامّة . وإنّما جُمع { الظلمات } وأفرد { النور } اتّباعاً للاستعمال ، لأنّ لفظ ( الظلمات ) بالجمع أخفّ ، ولفظ ( النور ) بالإفراد أخفّ ، ولذلك لم يرد لفظ ( الظلمات ) في القرآن إلاّ جمعاً ولم يرد لفظ ( النور ) إلاّ مفرداً . وهما معاً دالاّن على الجنس ، والتعريف الجنسي يستوي فيه المفرد والجمع فلم يبق للاختلاف سبب لاتّباع الاستعمال ، خلافاً لما في «الكشاف» .{ ثْمَّ الذين كَفَرُواْ بِرَبِّهِمْ يَعْدِلُونَ }.عُطفت جملة { ثم الذين كفروا بربّهم يعدلون } على جملة : { الحمد لله الذي خلق السماوات }.ف { ثم } للتراخي الرتبي الدالّ على أنّ ما بعدها يتضمّن معنى من نوع ما قبله ، وهو أهمّ في بابه . وذلك شأن ( ثم ) إذا وردت عاطفة جملة على أخرى ، فإنّ عدول المشركين عن عبادة الله مع علمهم بأنّه خالق الأشياء أمر غريب فيهم أعجب من علمهم بذلك .والحجّة ناهضة على الذين كفروا لأنّ جميعهم عدا المانوية يعترفون بأنّ الله هو الخالق والمدبّر للكون ، ولذلك قال الله تعالى :{ أفمن يخلق كمن لا يخلق أفلا تذّكّرون } \\[ النحل : 17 \\].والخبر مستعمل في التعجيب على وجه الكناية بقرينة موقع { ثم } ودلالة المضارع على التجدّد ، فالتعجيب من شأن المشركين ظاهر وأمّا المانوية فالتعجيب من شأنهم في أنّهم لم يهتدوا إلى الخالق وعبدوا بعض مخلوقاته . فالمراد ب { الذين كفروا } كلّ من كفر بإثبات إله غير الله تعالى سواء في ذلك من جعل له شريكاً مثل مشركي العرب والصابئة ومن خصّ غير الله بالإلهية كالمانوية . وهذا المراد دلّت عليه القرينة وإن كان غالب عرف القرآن إطلاق الذين كفروا على المشركين .ومعنى { يعدلون } يُسوّون . والعدل : التسوية . تقول : عدلت فلاناً بفلان ، إذا سوّيته به ، كما تقدّم في قوله : { أو عَدْل ذلك صياماً } \\[ المائدة : 95 \\] ، فقوله { بربّهم } متعلّق ب { يعدلون } ولا يصحّ تعليقه ب { الذين كفروا } لعدم الحاجة إلى ذلك . وحذف مفعول { يعدلون } ، أي يعدلون بربّهم غيره وقد علم كلّ فريق ماذا عدل بالله . والمراد يعدلونه بالله في الإلهيّة ، وإن كان بعضهم يعترف بأنّ الله أعظم كما كان مشركو العرب يقولون : لَبَّيك لا شريك لك إلاّ شريكاً هو لك تملكه وما ملك . وكما قالت الصابئة في الأرواح ، والنصارى في الابن والروح القدس .ومعنى العجيب عامّ في أحوال الذين ادّعوا الإلهيّة لغير الله تعالى سواء فيهم من كان أهلاً للاستدلال والنظر في خلق السماوات والأرض ومن لم يكن أهلاً لذلك ، لأنّ محلّ التعجيب أنّه يخلقهم ويخلق معبوداتهم فلا يهتدون إليه بل ويختلقون إلهيّة غيره . ومعلوم أنّ التعجيب من شأنهم متفاوت على حسب تفاوت كفرهم وضلالهم .\n\n",
      "translations": [
        {
          "translation": "And on his authority from Ibn 'Abbas, regarding Allah's saying (Praise be to Allah) he said: '(Praise be to Allah) Allah says: gratitude and godhood are Allah's, (Who hath created the heavens) in two days: Sunday 131 and Monday (and the earth) in two days: Tuesday and Wednesday, (and has appointed darkness and light) He created faith and disbelief or night and day. (Yet those who disbelieve) the unbelievers of Mecca (ascribe rivals) idols (unto their Lord).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأَخبرنا أَبو جعفر، قَالَ حدّثنا عَليُّ بن أَحمد، قَالَ حدَّثنا عطاءُ بن السائب قالَ: حدَّثنا أبو خالد الواسطي عَن الإِمَامِ الشَّهيدِ أَبي الحسين زيد بن علي عليهما السَّلامُ\n في قولهِ تعالى: { وَجَعَلَ ٱلظُّلُمَٰتِ وَٱلنُّورَ } معناهُ خَلَقَها\n والظُّلماتُ الكُفرُ\n والنُّورُ: الإِيمانُ\n\n\n\n\nوقوله تعالى: { بِرَبِّهِمْ يَعْدِلُونَ } معناهُ يَجْعَلُونَ لَهُ مِثْلاً\n ويُشْركُونَ بهِ\n\n",
      "translations": [
        {
          "translation": "\n\nWe were informed by Abu Ja'far that he said, Ali ibn Ahmad narrated to us that Ata' ibn al-Sa'ib narrated to us that Abu Khalid al-Wasiti narrated to us from the Imam al-Shahid Abu al-Husayn Zayd ibn Ali, peace be upon them both, that\n\n\nAnd in the words of the Almighty: {And He made the darkness and the light}, its meaning is that He created them.\n {And the darkness of disbelief}\n And the light: faith\n\nAnd His saying, {With their Lord, they are equitable} [means that] they make for Him an equal.\n And they associate with Him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ الحَمْدُ لله الذي خَلَقَ السموات والأرض } ظهور الكمالات\n وصفات الجمال والجلال على مظاهر تفاصيل الموجودات بأسرها الذي هو كمال الكل\n والحمد المطلق مخصوص بالذات الإلهية الجامعة لجميع صفاتها وأسمائها باعتبار البداية الذي أوجد سموات عالم الأرواح وأرض عالم الجسم وأنشأ في عالم الجسم ظلمات مراتبه التي هي حجب ظلمانية لذاته وفي عالم الأرواح نور العلم والإدراك { ثم } أي: بعد ظهور هذه الآيات { الذين كفَرُوا } حجبوا مطلقاً { بربّهم يعدلون } غيره يثبتون موجوداً يساويه في الوجود { هو الذي خلقكم من طين } المادة الهيولانية { ثم قضى أجلاً } مطلقاً غير معين بوقت وهيئة\n لأن أحكام القضاء الثابت الذي هو أمّ الكتاب كلية منزّهة عن الزمان\n متعالية عن المشخصات إذ محلها الروح الأولى المقدّس عن التعلق بالمحل",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلْحَمْدُ } والثناء المشعر بالإطاعة والانقياد المنبأ عن التعظيم والتبجيل الذاتي الصادر عن ألسنة جميع من يدخل في حيطة الوجود\n المعترف بتوحيده سبحانه وتفريده استقلالاً ثابتاً { للَّهِ } المستقل بالألوهية\n المتوحد في الربوبية\n المستحق في العبودية\n وكيف لا يستحق سبحانه مع أنه القادر { ٱلَّذِي خَلَقَ } وقدر { ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } أي: أظهر علويات الأسماء والصفات وسفليات الطبيعة العدمية القابلة لانعكاس أشعة العلويات { وَجَعَلَ ٱلظُّلُمَٰتِ } أي: أنشأ حجب التعينات { وَٱلنُّورَ } أيك ظل الوجود المنبسط عليها { ثْمَّ } بعدما ظهر إشراق نور الوجود\n ولمع أضاء شمس الذات { ٱلَّذِينَ كَفَرُواْ بِرَبِّهِمْ } أي: ستروا بهويتهم الباطلة هويته الحقيقة السارة في الآفاق أزلاً وأبداً { يَعْدِلُونَ } [الأنعام: 1] يميلون وينحرفون عن طريق الحق جهلاً وعناداً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { ثم الذين كفروا }: عطف على جملة الحمد على معنى: أن الله حقيق بالحمد على ما خلقه، نعمةً على العباد، ثم الذين كفروا بربهم الذي ربَّاهم بهذه النعم، يَعدِلون به سواه من الأصنام، يقال: عدَلت فلانًا بفلان جعلته نظيره، أو عطف على \" خلَق وجعل \": على معنى أنه خلق وقدّر ما لا يقدر عليه غيره، ثم هم يعدلون به ما لا يقدر على شيء. ومعنى { ثم }: استبعاد عدولهم بعد هذا البيان. والباء في \" بربهم \" متعلقة بكفروا، على الأول، وبيعدلون على الثاني، قاله البيضاوي. يقول الحقّ جلّ جلاله: { الحمد لله } أي: جميع المحامد إنما يستحقها الله، إذ ما بكم من نعمة فمن الله. { الذي خلق السماوات } التي تُظِلُّكم، مشتملة على الأنوار التي تضيء عليكم، ومحلاً لنزول الرحمات والأمطار عليكم، { و } خلق { الأرض } التي تُقلُّكم، وفيها نبات معاشكم في العادة، وفيها قراركم في حياتكم وبعد مماتكم، مشتملة على بحار وأنهار، وفواكه وثمار، وبهجة أزهار ونِوار، { وجعل الظلمات } التي تستركم، راحة لأبدانكم وقلوبكم، كظلمات الليل الذي هو محل السكون. { و } جعل { النور } الذي فيه معاشكم وقوام أبدانكم وأنعامكم. { ثم الذين كفروا } بعد هذا كله، { يعدلون } عنه إلى غيره، أو يعدلون به سواه، فيُسوَونه في العبادة معه. قال البيضاوي: وجمع السماوات دون الأرض وهي مثلهن لأن طبقاتها مختلفة بالذات، متفاوتة الآثار والحركات، وقدَّمها لشرفها وعلو مكانها. ثم قال أيضًا: وجمع الظلمات لكثرة أسبابها والأجرام الحاملة لها، أو لأن المراد بالظلمة: الضلال، وبالنور: الهُدى. والهدى واحد والضلال متعدد. وتقديمها لتقدم الإعدام على المَلَكَهِ. ومن زعم أن الظلمة عرَضٌ يُضاد النور احتج بهذه الآية، ولم يعلم أن عدم الملكَة كالعمي ليس صِرف العدم حتى لا يتعلق به الجعل. هـ. الإشارة: أثنى الحقّ ـ جلّ جلاله ـ على نفسه بإنشاء هذه العوالم، التي هي محل ظهور عظمته وجلاله وجماله وبهائه. فأنشأ سموات الأرواح، التي هي مظهر لشروق أنوار ذاته وصفاته، ومحل لظهور عظمة ربوبيته، وأنشأ أرض النفوس، التي هي مظهر لتصرف أقداره، ومحل لظهور آداب عبوديته، وتجلى بين الضدين بين الظلمات والنور، ليقع الخفاء في الظهور، كما قال بعض الشعراء:\nثم بعد هذا الظهور التام، عدل عن معرفتهُ جلُ الأنام، إلا من سبقت له العناية من المِلك العلام، وبالله التوفيق. ثم برهن على كمال قدرته، فقال: { هُوَ ٱلَّذِي خَلَقَكُمْ مِّن طِينٍ }.\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "82:7",
      "similarity": 0.6348576552215025
    },
    {
      "verse": "7:181",
      "similarity": 0.6190036722861618
    },
    {
      "verse": "7:159",
      "similarity": 0.542137363478649
    },
    {
      "verse": "45:36",
      "similarity": 0.40357586030383497
    },
    {
      "verse": "2:48",
      "similarity": 0.40148111981929957
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}