{
  "chapter": "الأنعام",
  "text": "قد جاءكم بصائر من ربكم فمن ابصر فلنفسه ومن عمى فعليها وما انا۠ عليكم بحفيظ",
  "translations": [
    {
      "translation": "To you have come signs from your Lord, (and the light of understanding). So any one who sees (and understands) does so for himself, and any one who turns blind shall suffer the consequences alone. (Say:) \"I am not a guardian over you (to make you understand).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The lights of clear perception have now come to you from your Lord. Then, he who chooses to see clearly, does so for his own good; and he who chooses to remain blind, does so to his own harm. I am not your keeper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"Clear proofs have certainly come to you from your Lord. Whoever tries to understand it will gain much but those who ignore it will only harm themselves. I am not (supposed) to watch over you (all the time)\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Enlightening proofs came to you from your Lord; so whoever observes, it is for his own good; and whoever is blind, it is for his own harm; and I am not a guardian over you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, Basa'ir (proofs) have come to you from your Lord, so whosoever sees, will do so for (the good of) himself, and whosoever blinds himself, will do so against himself, and I am not a Hafiz over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed there have come to you clear proofs from your Lord; whoever will therefore see, it is for his own soul and whoever will be blind, it shall be against himself and I am not a keeper over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Clear proofs have come to you from your Lord. Whoso sees clearly, it is to his own gain, and whoso is blind, it is to his own loss; I am not a watcher over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proofs have come unto you from your Lord, so whoso seeth, it is for his own good, and whoso is blind is blind to his own hurt. And I am not a keeper over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Clear insights have come to you from your Lord. Whoever, therefore, chooses to see, does so for his own good; and whoever chooses to remain blind, does so to his own loss. Say, \"I am not here as your keeper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely there hath come unto you enlightenment from your Lord. Whosoever then shall see shall do so for his own soul, and whosoever blindeth himself shall do so to his own hurt. And say thou I am not over you a guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Say,] ‘Certainly insights have come to you from your Lord. So whoever sees, it is to the benefit of his own soul, and whoever remains blind, it is to its detriment, and I am not a keeper over you.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now have come to you, from your Lord, proofs (to open your eyes): if any will see, it will be for (the good of) his own soul; if any will be blind, it will be to his own (harm): I am not (here) to watch over your doings.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, proofs have come to you from your Lord, so whosoever sees, will do so for (the good of) his ownself, and whosoever blinds himself, will do so to his own harm, and I (Muhammad SAW) am not a watcher over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Clear proofs have come to you from your Lord. Whosoever sees clearly it is for himself, and whosoever is blind, it is against himself. I am not an overseer for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Insights have come to you from your Lord. Whoever sees, it is to the benefit of his soul; and whoever remains blind, it is to its detriment. I am not a guardian over you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There has come to you enlightenment from your Lord. So whoever will see does so for [the benefit of] his soul, and whoever is blind [does harm] against it. And [say], \"I am not a guardian over you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:104] Say, O Muhammad (s), to them: Clear proofs have come to you from your Lord; whoever perceives, them and believes, then it is for his own good, that he has perceived [them], since the reward resulting from his perception will be his; and whoever is blind, to them and goes astray, then it, the evil consequence of his being astray, will be to his own hurt. And I am not a keeper, a watcher, over you, of your deeds: I am but a warner.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Proofs) an exposition (have come unto you from your Lord) i.e. the Qur'an, (so whoso seeth) believes in the Qur'an, (it is for his own good) reward, (and whoso is blind) disbelieves (is blind to his own hurt) punishment. (And I am not a keeper over you) to protect you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قَدْ جَآءَكُمْ بَصَآئِرُ مِن رَّبِّكُمْ } معناهُ حُجَجٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n والبصيرة نور يبصر به القلب، كما أنّ البصر نور تبصر به العين، { فمن أبْصَر } أي: صار بصيراً بها، فإنما فائدة إبصاره وهدايته لنفسه ومن حجب عنها فإنما مضرّة احتجابه لا تتعدّى إلى غيره بل إليه { وما أنا عليكم بحفيظ } رقيب يرقبكم ويحفظكم عن الضلال، بل الله حفيظ يحفظكم ويحفظ أعمالكم { ولو شاء الله ما أشركوا } أي: كل ما يقع فإنما يقع بمشيئة الله ولا شك أن استعداداتهم التي وقعوا بها في الشرك وأسباب ذلك من تعليم الآباء والعادات وغيرها أيضاً واقعة بإرادة من الله وإلا لم تقع\n فإن آمنوا بذلك فبهداية الله وإلا فهوّن على نفسك { وما جعلناك عليهم حفيظاً } تحفظهم عن الضلال { وما أنت } بموكل عليهم بالإيمان\n ولا ينافي هذا ما قال في تعييرهم فيما بعد بقوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَدْ جَآءَكُمْ } وحصل عندكم أيها المجبولون على فطرة التوحيد { بَصَآئِرُ } شواهر وكواشف { مِن رَّبِّكُمْ } الذي أوجدكم وأظهركم عليها { فَمَنْ أَبْصَرَ } شهد وانكشف بها { فَلِنَفْسِهِ } أي: عاد نفعه إليها { وَمَنْ عَمِيَ } و احتجب { فَعَلَيْهَا } أي: وبالها عائد عليها { وَمَآ أَنَاْ عَلَيْكُمْ بِحَفِيظٍ } [الأنعام: 104] رقيب مصرف بل منبه مبلغ، والحفظ بيد الله، والتصرف بقدرته، يهدي من يشاء ويضل من يشاء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}