{
  "chapter": "الأنعام",
  "text": "وجعلوا۟ لله شركاء الجن وخلقهم وخرقوا۟ له بنين وبنتۭ بغير علم سبحنه وتعلى عما يصفون",
  "translations": [
    {
      "translation": "Yet they make the jinn co-partners with Allah when He created them! And they attribute sons and daughters to Him without any knowledge. Glory be to Him! He is far above what they describe!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they ascribe to jinns a partnership with God, although He created them; and they ascribe to Him sons and daughters, without possessing any knowledge. All praise be to Him. He is much too exalted for things they associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And yet, some people have come to associate the jinn with Allah in His divinity, even though it is He Who created them; and in ignorance they impute to Him sons and daughters. He is Holy and Exalted far above that which they attribute to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Some) people considered the jinn to be equal to God even though God created them and they unknowingly ascribed to Him children, both boys and girls. God is too glorious to have the attributes which they ascribe to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And out of sheer ignorance they have ascribed jinns as partners of Allah, whereas it is He Who created them, and they have invented sons and daughters for Him! Purity and Supremacy is to Him, from all what they ascribe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet, they join the Jinns as partners in worship with Allah, though He has created them, and they attribute, falsely without knowledge - sons and daughters to Him. Be He Glorified and Exalted above what that they attribute to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they make the jinn associates with Allah, while He created them, and they falsely attribute to Him sons and daughters without knowledge; glory be to Him, and highly exalted is He above what they ascribe (to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they ascribe to God, as associates, the jinn, though He created them; and they impute to Him sons and daughters without any knowledge. Glory be to Him! High be He exalted above what they describe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they ascribe as partners unto Him the jinn, although He did create them, and impute falsely, without knowledge, sons and daughters unto Him. Glorified be He and High Exalted above (all) that they ascribe (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have set up jinns as associates with God, even though He created them! They have even dared, in their ignorance, to attribute sons and daughters to Him. Hallowed be He and exalted far above what they ascribe to Him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have set up the genii as associates unto Allah, whereas He hath created them and they impute unto Him falsely without knowledge, sons and daughters. Hallowed be He, far above that which they ascribe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They make the jinn partners of Allah, though He has created them, and carve out sons and daughters for Him, without any knowledge. Immaculate is He and exalted above what they allege [concerning Him]!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they make the Jinns equals with Allah, though Allah did create the Jinns; and they falsely, having no knowledge, attribute to Him sons and daughters. Praise and glory be to Him! (for He is) above what they attribute to Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet, they join the jinns as partners in worship with Allah, though He has created them (the jinns), and they attribute falsely without knowledge sons and daughters to Him. Be He Glorified and Exalted above (all) that they attribute to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they regard the jinn as the partners of Allah, although He created them, and without knowledge ascribe to Him sons and daughters. Exaltations to Him! He is above what they describe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet they attributed to God partners—the sprites—although He created them. And they invented for Him sons and daughters, without any knowledge. Glory be to Him. He is exalted, beyond what they describe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they have attributed to Allah partners - the jinn, while He has created them - and have fabricated for Him sons and daughters. Exalted is He and high above what they describe\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:100] Yet they ascribe to God (li’Llāhi, the indirect object) as associates (shurakā’a, the direct object, which is substituted by [the following, al-jinn]) the jinn, since they obey them by worshipping graven images, even though He created them: so how can they be associates? And they falsely impute to Him (read kharaqū or kharraqū), that is, they invent, sons and daughters without any knowledge, saying, Ezra (‘Uzayr) is the son of God, and the angels are the daughters of God. Glory be to Him — an affirmation of His transcendence — and exalted be He above what they describe!, of Him having a child.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Yet they ascribe as partners unto Him the jinn) they said: Allah, Exalted is He, and Satan are brothers and partners: Allah is the Creator of human beings, beasts and cattle while Satan is the Creator of snakes, scorpions and predatory beasts. This is the claim of the Magians, (although He did create them) and command them to declare His divine Oneness, (and impute falsely, without knowledge) without knowledge, argument or proof, (sons) as claimed by the Jews and Christians (and daughters unto Him) among the angels and idols, as claimed by the Arab idolaters. (Glorified be He) He has exonerated Himself from having children or partners (and high exalted) and He absolves Himself (above (all) that they ascribe (unto Him)) of sons and daughters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَخَرَقُواْ لَهُ بَنِينَ وَبَنَٰتٍ } معناهُ اخْتَلَقُوا\n",
      "translations": [
        {
          "translation": " And {And they broke their covenant with him and rejected his messengers} means they created him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } مع عجائب صنيعه وغرائب قدرته { جَعَلُواْ } من غاية جهلهم ونهاية غفلتهم { للَّهِ } التوحد في ذاته\n المنزه عن الشريك مطلقاً { شُرَكَآءَ } خصوصاً { ٱلْجِنَّ } أي: الشياطين فيعبدنهم كعبادة الله ويمتثلون أوامرهم كأوامر الله { وَ } الحال أنهم عالمون بأن الله تعالى قد { خَلَقَهُمْ } ومعبوداتهم { وَ } من جملة شركهم أنهم { خَرَقُواْ لَهُ } أي: أثبتوا له افتراء ومراء { بَنِينَ } كما قالت اليهود: عزير ابن الله\n وقالت النصارى: المسيح ابن الله { وَبَنَٰتٍ } كما قالت العرب: الملائكة بنات الله\n كل ذلك صار منهم { بِغَيْرِ عِلْمٍ } ومعرفة بذاته المنزه عن الأهل والولد { سُبْحَٰنَهُ وَتَعَٰلَىٰ عَمَّا يَصِفُونَ } [الأنعام: 100] هؤلاء الظالمون المفرطون\n إذ هو:\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { الجن }: مفعول أول لجعلوا، و { شركاء }: مفعول ثانٍ، وقدّم لاستعظام الإشراك، أو { شركاء }: مفعول أول، و { لله }: في موضع المفعول الثاني، و { الجن }: بدل من شركاء، وجملة { خلقهم }: حال، و { بديع }: خبر عن مضمر، أو مبتدأ وجملة { أنَّى }: خبره، وهو من إضافة الصفة إلى مفعولها أي: مبدع السماوات، أو إلى فاعلها: أي: بديع سماواته، من بَدُعَ إذا كان على نمط عجيب، وشكل فائق، وحُسن لائق\n يقول الحقّ جلّ جلاله: توبيخًا للمشركين: { وجعلوا لله شركاء } في عبادته، وهم { الجن } أي: الملائكة لاجتنانهم أي: استتارهم، فعبدوهم واعتقدوا أنهم بنات الله، أو الجن حقيقة، وهم الشياطين لأنهم أطاعوهم كما يُطاع الله تعالى، أو: عبدوا الأوثان بتسويلهم وتحريضهم، فقد أشركوا مع الله، و { و } الحال أن الله قد { خلقهم } أي: الجن أي: عبدوهم وهم مخلوقون، أو الضمير للمشركين، أي: عبدوا الجن، وقد عَلِمُوا أن الله قد خلقهم دون الجن لعجزه، وليس من يَخلُق كمَن لا يَخلُق\n { وخرقوا له } أي: اختلقوا وافترَوا، أو زوَّرُوا برأيهم الفاسد له { بنين } كالنصارى في المسيح، واليهود في عُزَير، { وبنات } كقول العرب في الملائكة: إنهم بنات الله ـ تعالى الله عن قولهم ـ قالوا ذلك { بغير علم } أي: بلا دليل ولا حجة، بل مجرد افتراء وكذب، { سبحانه وتعالى } أي: تنزيهًا له، وتعاظم قدره { عما يصفون } من أن له ولدًا أو شريكًا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:71",
      "similarity": 0.5019148799413736
    },
    {
      "verse": "17:37",
      "similarity": 0.4977197733767018
    },
    {
      "verse": "23:91",
      "similarity": 0.3352320532581672
    },
    {
      "verse": "37:159",
      "similarity": 0.3101675840678685
    },
    {
      "verse": "37:180",
      "similarity": 0.303999551285592
    }
  ]
}