{
  "chapter": "الأنعام",
  "text": "اتبع ما اوحى اليك من ربك لا اله الا هو واعرض عن المشركين",
  "translations": [
    {
      "translation": "Follow what has been revealed to you from your Lord - there is no god but Him - and turn away from the idolaters.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So follow what is sent down to you by your Lord, for homage is due to no one but God, and turn away from idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad!) Follow the revelation which has come to you from your Lord, other than Whom there is no god, and turn away from those who associate others with Allah in His divinity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), follow what has been revealed to you from your Lord; there is no God but He, and stay away from pagans.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what is divinely revealed to you from your Lord; there is none worthy of worship except Him; and turn away from the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what has been inspired (revealed) to you from your Lord, none has the right to be worshipped but He, and turn aside from the idolators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what is revealed to you from your Lord; there is no god but He; and withdraw from the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow thou what has been revealed to thee from thy Lord; there is no god but He; and turn thou away from the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow that which is inspired in thee from thy Lord; there is no Allah save Him; and turn away from the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what has been revealed to you from your Lord: there is no deity but Him; and ignore the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow thou that which hath been revealed unto thee from thy Lord: no god is there but He; and turn thou away from the associaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow that which has been revealed to you from your Lord, there is no god except Him, and turn away from the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what thou art taught by inspiration from thy Lord: there is no god but He: and turn aside from those who join gods with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what has been inspired to you (O Muhammad SAW) from your Lord, La ilaha illa Huwa (none has the right to be worshipped but He) and turn aside from Al-Mushrikun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, follow what has been revealed to you from your Lord there is no god except Him, and avoid the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what was revealed to you from your Lord. There is no god but He. And turn away from the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow, [O Muhammad], what has been revealed to you from your Lord - there is no deity except Him - and turn away from those who associate others with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:106] Follow what has been revealed to you from your Lord, namely, the Qur’ān. There is no god but Him; and turn away from the idolaters.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف في خطاب النّبيء عليه الصّلاة والسّلام لأمره بالإعراض عن بهتان المشركين وأن لا يكترث بأقوالهم ، فابتداؤه بالأمر باتّباع ما أوحي إليه يتنزّل منزلة المقدّمة للأمر بالإعراض عن المشركين ، وليس هو المقصد الأصلي من الغرض المسوق له الكلام ، لأنّ اتّباع الرّسول صلى الله عليه وسلم ما أوحي إليه أمر واقع بجميع معانيه؛ فالمقصود من الأمر الدّوام على اتّباعه . والمعنى : أعرض عن المشركين اتّباعاً لما أنزل إليك من ربّك . والمراد بما أوحي إليه القرآن .والاتِّباع في الأصل اقتفاء أثر الماشِي ، ثمّ استعمل في العمل بمثل عمل الغير ، كما في قوله : { والّذين اتّبعوهم بإحسان } \\[ التوبة : 100 \\]. ثمّ استعمل في امتثال الأمر والعمل بما يأمر به المتبوع فهو الائتمار ، ويتعدّى فعله إلى ذات المتَّبَع فيقال : اتَّبعت فلاناً بهذه المعاني الثّلاثة وهو على حذف مضاف في جميع ذلك لأنّ الاتّباع لا يتعلّق بالذّات .وإطلاق الاتّباع بمعنى الائتمار شائع في القرآن لأنّه جاء بالأمر والنّهي وأمر النّاس باتّباعه ، واستُعمل أيضاً في معنى الملازمة على سبيل المجاز المرسل ، لأنّ من يتّبع أحداً يلازمه . ومنه سمّي الرّئيّ من الجنّ في خرافات العرب تابعة ، ومنه سمّى من لازم الصّحابي وروى عنه تابعياً .فيجوز أن يكون الاتّباع في الآية مراداً به دوام الامتثال لما أمر به القرآن من الإعراض عن أذى المشركين وعنادهم ، فالاتّباع المأمور به اتّباع في شيء مخصوص ، وهذا مأمور به غير مرّة ، فالأمر بالفعل مستمرّ في الأمر بالدّوام عليه .ويجوز أن يكون أمراً بملازمة الدّعوة إلى الله والإعلان بها ودعاء المشركين إلى التّوحيد والإيمان وأن لا يعتريه في ذلك لَيْن ولا هوادة حتّى لا يكون لبذاءتهم وتكذيبهم إيّاه تأثير على نفسه يوهن دعوتهم والحرصَ على إيمانهم واعتقاد أنّ محاولة إيمانهم لا جدوى لها . فالمراد بما أوحي إليه ما أوحي من القرآن خطاباً للمشركين ، أو أمراً بدعوتهم للإسلام وعدم الانقطاع عن ذلك ، فيكون الكلام شدّاً لساعد النّبيء صلى الله عليه وسلم في مقامات دعوته إلى الله ، وهذا هو المناسب لقوله : { لا تسبّوا الّذين يدعون من دون الله } \\[ الأنعام : 108 \\] كما سنبيّنه . وقد تقدّم شيء من هذا آنفاً عند قوله تعالى : { إنْ أتَّبِعُ إلاّ ما يوحَى إليّ } \\[ الأنعام : 50 \\]. وليس المراد من الأمر بالاتّباع الأمرُ باتّباع أوامر القرآن ونواهيه مطلقاً ، لأنّه لا مناسبة له بهذا السّياق ، وفي الإتيان بلفظ : { ربّك } دون اسم الجلالة تأنيس للرّسول صلى الله عليه وسلم وتلطّف معه .وجملة : { لا إله إلاّ هو } معترضة ، والمقصود منها إدماج التّذكير بالوحدانيّة لزيادة تقرّرها وإغاظة المشركين .والمراد بالإعراض عن المشركين الإعراض عن مكابرتهم وأذاهم لا الإعراض عن دعوتهم ، فإنّ الله لم يأمر رسوله صلى الله عليه وسلم بقطع الدّعوة لأي صنف من النّاس ، وكلّ آية فيها الأمر بالإعراض عن المشركين فإنّما هو إعراض عن أقوالهم وأذاهم ، ألا ترى كلّ آية من هذه الآيات قد تلتْها آيات كثيرة تدعو المشركين إلى الإسلام والإقلاع عن الشّرك كقوله تعالى في سورة \\[ النّساء : 63 \\] :{ فأعرض عنهم وعِظْهُم } وقد تقدّم .\n\n",
      "translations": [
        {
          "translation": "(Follow that which is inspired in you from thy Lord) act upon that which is revealed to you from your Lord, i.e. the Qur'an: what is lawful and unlawful; (there is no God save Him) there is no creator or provider save Him; (and turn away from the idolaters) those who mock, among whom are al-Walid Ibn al-Mughirah al- Makhzumi, al-'As Ibn Wa'il al-Sahmi, al-Aswad Ibn 'Abd Yaghuth al-Zuhri, al-Aswad Ibn al-Harith Ibn 'Abd al- Muttalib, and al-Harith Ibn Qays Ibn Hanzalah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱتَّبِعْ } أنت { مَآ أُوحِيَ إِلَيْكَ مِن } توحيد { رَّبِّكَ } بأن { لاۤ إِلَـٰهَ } أي: لا موجود { إِلاَّ هُوَ وَأَعْرِضْ عَنِ ٱلْمُشْرِكِينَ } [الأنعام: 106] واتركهم وشركهم بعدما تحققت وتمكنت في مقر التوحيد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { اتبع ما أُوحى إليك من ربك } بالدوام على التمسك به\n والاهتداء بهديه\n ودم على توحيده\n { لا إله إلا هو } فلا تصغ إلى من يعبد معه غيره\n { وأعرض عن المشركين } \n فلا تحتفل بأقوالهم\n ولا تلتفت إلى رأيهم\n وهذا محكم\n أو: أعرض عن عقابهم وقتالهم\n وهو منسوخ بآية السيف",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:4",
      "similarity": 0.5334386719123799
    },
    {
      "verse": "36:46",
      "similarity": 0.5334386719123799
    },
    {
      "verse": "33:2",
      "similarity": 0.4985427057777811
    },
    {
      "verse": "21:25",
      "similarity": 0.48406808361378056
    },
    {
      "verse": "38:68",
      "similarity": 0.484040787935137
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006106.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006106.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:106.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}