{
  "chapter": "الأنعام",
  "text": "ولا تسبوا۟ الذين يدعون من دون الله فيسبوا۟ الله عدوۢا بغير علم كذلك زينا لكل امة عملهم ثم الى ربهم مرجعهم فينبئهم بما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "Do not curse those they call upon besides Allah, in case that makes them curse Allah in animosity, without knowledge. In this way We make the actions of every nation seem attractive to them. Then they will return to their Lord, and He will inform them about what they did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not revile those who invoke others apart from God, lest they begin to revile God out of malice and ignorance. We have made attractive their deeds to every people. They have to go back to their Lord, when He will tell them what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not revile those whom they invoke other than Allah, because they will revile Allah in ignorance out of spite. For We have indeed made the deeds of every people seem fair to them. Tlen, their return is to their Lord and He will inform them of what they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not say bad words against the idols lest they (pagans) in their hostility and ignorance say such words against God. We have made every nation's deeds seem attractive to them. One day they will all return to their Lord who will inform them of all that they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not abuse those whom they worship besides Allah lest they become disrespectful towards Allah’s Majesty, through injustice and ignorance; likewise, in the eyes of every nation, We have made their deeds appear good – then towards their Lord they have to return and He will inform them of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And insult not those whom they worship besides Allah, lest they insult Allah wrongfully without knowledge. Thus We have made fair seeming to each people its own doings; then to their Lord is their return and He shall inform them of all that they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not abuse those whom they call upon besides Allah, lest exceeding the limits they should abuse Allah out of ignorance. Thus have We made fair seeming to every people their deeds; then to their Lord shall be their return, so He will inform them of what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abuse not those to whom they pray, apart from God, or they will abuse God in revenge without knowledge. So We have decked out fair to every nation their deeds; then to their Lord they shall return, and He will tell them what they have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Revile not those unto whom they pray beside Allah lest they wrongfully revile Allah through ignorance. Thus unto every nation have We made their deed seem fair. Then unto their Lord is their return, and He will tell them what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not revile those [beings] whom they invoke instead of God, lest they, in their hostility, revile God out of ignorance. Thus to every people We have caused their actions to seem fair. To their Lord they shall all return, and He will declare to them all that they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Revile not those whom they invoke besides Allah, lest they may spitefully revile Allah without knowledge. Thus fair-seeming unto every community We have made their work. Then unto their Lord is their return, and then He will declare unto them that which they were wont to work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not abuse those whom they invoke besides Allah, lest they should abuse Allah out of hostility, without any knowledge. That is how to every people We have made their conduct seem decorous. Then their return will be to their Lord and He will inform them concerning what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Revile not ye those whom they call upon besides Allah, lest they out of spite revile Allah in their ignorance. Thus have We made alluring to each people its own doings. In the end will they return to their Lord, and We shall then tell them the truth of all that they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And insult not those whom they (disbelievers) worship besides Allah, lest they insult Allah wrongfully without knowledge. Thus We have made fair-seeming to each people its own doings; then to their Lord is their return and He shall then inform them of all that they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not say crude words to those who call upon other than Allah, lest they use crude words about Allah in revenge without knowledge. As such we have made the actions of each nation seem pleasing. To their Lord they shall return, and He will inform them of that they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not insult those they call upon besides God, lest they insult God out of hostility and ignorance. We made attractive to every community their deeds. Then to their Lord is their return, and He will inform them of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not insult those they invoke other than Allah, lest they insult Allah in enmity without knowledge. Thus We have made pleasing to every community their deeds. Then to their Lord is their return, and He will inform them about what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:108] Do not revile those whom they call upon, besides God, namely, the idols, lest they then revile God out of spite, out of aggression and wrongfully, through ignorance, that is, through their ignorance of God. So, in the same way that We have adorned for these that which they practise, We have adorned for every community their, good and evil, deeds, and they commit them; then to their Lord they shall return, in the Hereafter, and He will tell them what they used to do, and requite them for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على قوله : { وأعرض عن المشركين } \\[ الأنعام : 106 \\] يزيد معنى الإعراض المأمور به بياناً ، ويحقّق ما قلناه أن ليس المقصود من الإعراض ترك الدّعوة بل المقصود الإغضاء عن سبابهم وبذيء أقوالهم مع الدّوام على متابعة الدّعوة بالقرآن ، فإنّ النّهي عن سبّ أصنامهم يؤذن بالاسترسال على دعوتهم وإبطال معتقداتهم مع تجنّب المسلمين سبّ ما يدعونهم من دون الله .والسبّ : كلام يدلّ على تحقير أحد أو نسبته إلى نقيصة أو معرّة ، بالباطل أو بالحقّ ، وهو مرادف الشّتم . وليس من السبّ النسبةُ إلى خطإ في الرّأي أو العمللِ ، ولا النّسبة إلى ضلال في الدّين إن كان صدر من مخالف في الدّين .والمخاطب بهذا النّهي المسلمون لا الرّسول صلى الله عليه وسلم لأنّ الرّسول لم يكن فحّاشاً ولا سبّاباً لأنّ خُلقه العظيم حائل بينه وبين ذلك ، ولأنّه يدعوهم بما ينزل عليه من القرآن فإذا شاء الله تركه من وحيه الّذي ينزله ، وإنّما كان المسلمون لغيرتهم على الإسلام ربّما تجاوزوا الحدّ ففرطت منهم فرطات سبّوا فيها أصنام المشركين .روى الطّبري عن قتادة قال «كان المسلمون يسبّون أوثان الكفّار فيردّون ذلك عليهم فنهاهم الله أن يستَسبّوا لربّهم» . وهذا أصحّ ما روي في سبب نزول هذه الآية وأوفَقُه بنظم الآية . وأمّا ما روى الطّبري عن عليّ بن أبي طلحة عن ابن عبّاس أنّه لمّا نزل قوله تعالى : { إنّكم وما تعبدون من دون الله حصب جهنّم } \\[ الأنبياء : 98 \\] قال المشركون : لئن لم تنته عن سبّ آلهتنا وشتمها لنهجُوَنّ إلهك ، فنزلت هذه الآية في ذلك ، فهو ضعيف لأنّ عليّ بن أبي طلحة ضعيف وله منكرات ولم يلق ابن عبّاس . ومن البعيد أن يكون ذلك المراد من النّهي في هذه الآية ، لأنّ ذلك واقع في القرآن فلا يناسب أن ينهى عنه بلفظ { ولا تسُبّوا } وكان أن يقال : ولا تجهروا بسبّ الّذين يَدْعون من دون الله مثلاً . كما قال في الآية الأخرى { ولا تجهر بصلاتك ولا تخافت بها وابتغ بين ذلك سبيلا } \\[ الإسراء : 110 \\]. وكذا ما رواه عن السديّ أنّه لمّا قربت وفاة أبي طالب قالت قريش : ندخل عليه ونطلب منه أن ينهى ابنَ أخيه عنّا فإنّا نستحيي أن نقتله بعد موته ، فانطلق نفر من سادتهم إلى أبي طالب وقالوا : أنت سيّدنا ، وخاطبوه بما راموا ، فدعا رسولَ الله صلى الله عليه وسلم فقال له : هؤلاء قومك وبنو عمّك يريدون أن تدَعهم وآلهتَهم ويدَعوك وإلَهَك ، وقالوا : لتكُفّن عن شتمك آلهتنا أو لنشتمنّك ولنشتمنّ من يأمُرك . ولم يقل السدّي أنّ ذلك سبب نزول هذه الآية ولكنّه جعله تفسيراً للآية ، ويرد عليه ما أوردناه على ما روي عن عليّ بن أبي طلحة .قال الفخر : ههنا إشكالان هما : أنّ النّاس اتَّفقوا على أنّ سورة الأنعام نزلت دفعة واحدة فكيف يصحّ أن يقال : إنّ سبب نزول هذه الآية كذا ، وأنّ الكفّار كانوا مقرّين بالله تعالى وكانوا يقولون : عبدنا الأصنام لتكون شفعاء لنا عند الله فكيف يعقل إقدامُ الكفّار على شتم الله تعالى اه .وأقول : يدفع الإشكال الأوّل أنّ سبب النّزول ليس يلزم أن يكون مقارناً للنّزول فإنّ السّبب قد يتقدّم زمانه ثمّ يشار إليه في الآية النّازلة فتكون الآية جواباً عن أقوالهم . وقد أجاب الفخر بمثل هذا عند قوله تعالى : { ولو أنّنا نزّلنا إليهم الملائكة } \\[ الأنعام : 111 \\] الآية . ويدفع الإشكال الثّاني أنّ المشركين قالوا لئن لم تنته عن سبّ آلهتنا لنهجونّ إلهك ، ومعناه أنّهم ينكرون أنّ الله هو إلهه ولذلك أنكروا الرّحمان { وإذا قيل لهم اسجدوا للرّحمان قالوا وما الرّحمان أنسجد لما تأمرنا وزادهم نفورا } \\[ الفرقان : 60 \\]. فهم ينكرون أنّ الله أمره بذمّ آلهتهم لأنّهم يزعمون أنّ آلهتهم مقرّبون عند الله ، وإنّما يزعمون أنّ شيطاناً يأمر النّبيء صلى الله عليه وسلم بسبّ الأصنام ، ألا ترى إلى قول امرأة منهم لمّا فتَر الوحي في ابتداء البعثة : ما أرى شيطانه إلاّ ودّعه ، وكان ذلك سبب نزول سورة الضّحى .وجواب الفخر عنه { بأنّ بعضهم كان لا يثبت وجود الله وهم الدهريون ، أو أنّ المراد أنّهم يشتمون الرّسول عليه الصّلاة والسّلام فأجرى الله شتم الرّسول مجرى شتم الله كما في قوله تعالى : { إنّ الّذين يبايعونك إنّما يبايعون الله } \\[ الفتح : 10 \\] اه . فإنّ في هذا التّأويل بُعداً لا داعي إليه .والوجه في تفسير الآية أنّه ليس المراد بالسبّ المنهي عنه فيها ما جاء في القرآن من إثبات نقائص آلهتهم ممّا يدلّ على انتفاء إلهيتها ، كقوله تعالى : { أولئك كالأنعام بل هم أضلّ } في سورة الأعراف ( 179 ). وأمّا ما عداه من نحو قوله تعالى : ألهم أرجل يمشون بها } \\[ الأعراف : 195 \\] فليس من الشّتم ولا من السبّ لأنّ ذلك من طريق الاحتجاج وليس تصدّياً للشّتم ، فالمراد في الآية ما يصدر من بعض المسلمين من كلمات الذمّ والتّعبير لآلهة المشركين ، كما روي في «السيرة» أنّ عُروة بن مسعود الثّقفي جاء رسولاً من أهل مكّة إلى رسول الله صلى الله عليه وسلم يومَ الحديبيّة فكان من جملة ما قاله : \" وأيم الله لكأنّي بهؤلاء ( يعني المسلمين ) قد انكشفوا عنك \" ، وكان أبو بكر الصدّيق حاضراً ، فقال له أبو بكر «امصُصْ بَظْر اللاّت» إلى آخر الخبر .ووجه النّهي عن سبّ أصنامهم هو أنّ السبّ لا تترتَّب عليه مصلحة دينيّة لأنّ المقصود من الدّعوة هو الاستدلال على إبطال الشّرك وإظهار استحالة أن تكون الأصنام شركاء لله تعالى ، فذلك هو الّذي يتميّز به الحقّ عن الباطل ، وينهض به المحقُّ ولا يستطيعه المبطل ، فأمّا السبّ فإنّه مقدور للمحقّ وللمبطل فيظهر بمظهر التّساوي بينهما .وربّما استطاع المبطل بوقاحته وفحشه ما لا يستطيعه المحقّ ، فيلوح للنّاس أنّه تغلّب على المحقّ . على أنّ سبّ آلهتهم لمّا كان يُحمي غيظهم ويزيد تصلّبهم قد عادَ مُنافياً لمراد الله من الدّعوة ، فقد قال لرسوله عليه الصّلاة والسّلام \" وجادلهم بالّتي هي أحسن \" ، وقال لموسى وهارون عليهما السّلام «فقولا له قولاً ليّناً» ، فصار السبّ عائقاً من المقصود من البعثة ، فتمحّض هذا السبّ للمفسدة ولم يكن مشوباً بمصلحة . وليس هذا مثل تغيير المنكر إذا خيف إفضاؤه إلى مفسدة لأنّ تغيير المنكر مصلحة بالذّات وإفضاؤه إلى المفسدة بالعَرض . وذلك مَجال تتردّد فيه أنظار العلماء المجتهدين بحسب الموازنة بين المصالح والمفاسد قوّة وضعفاً ، وتحقّقاً واحتمالاً . وكذلك القول في تعارض المصالح والمفاسد كلّها .وحكم هذه الآية محكم غير منسوخ . قال القرطبي : قال العلماء : حكمها باق في هذه الأمّة على كلّ حال ، فمتى كان الكافر في منعة وخيف أنّه إنْ سبّ المسلمون أصنامه أو أمور شريعَته أن يَسُبّ هو الإسلام أو النّبيء عليه الصّلاة والسّلام أو اللّهَ عزّ وجلّ لم يحلّ للمسلم أن يسبّ صُلبانهم ولا كنائسهم لأنّه بمنزلة البعث على المعصيّة اه ، أي على زيادة الكفر . وليس من السبّ إبطال ما يخالف الإسلام من عقائدهم في مقام المجادلة ولكنّ السبّ أن نباشرهم في غير مقام المناظرة بذلك ، ونظير هذا ما قاله علماؤنا فيما يصدر من أهل الذّمة من سبّ الله تعالى أو سبّ النّبيء صلى الله عليه وسلم بأنّهم إن صدر منهم ما هو من أصول كفرهم فلا يعدّ سَبّاً وإن تجاوزوا ذلك عدّ سبّاً ، ويعبّر عنها الفقهاء بقولهم : «مَا به كَفر وغير ما به كفر» .وقد احتجّ علماؤنا بهذه الآية على إثبات أصل من أصول الفقه عند المالكيّة ، وهو الملقّب بمسألة سَدّ الذّرائع . قال ابن العربي : «منع الله في كتابه أحداً أن يفعل فعلاً جائزاً يؤدّي إلى محظور ولأجل هذا تعلّق علماؤنا بهذه الآية في سدّ الذّرائع وهو كلّ عقد جائز في الظاهر يؤول أو يمكن أن يتوصّل به إلى محظور» . وقال في تفسير سورة الأعراف ( 163 ) عند قوله تعالى : { واسْألهم عن القرية الّتي كانت حاضرة البحر إذْ يعدون في السّبت } قال علماؤنا : هذه الآية أصل من أصول إثبات الذّرائع الّتي انفرد بها مالك رضي الله عنه وتابعه عليها أحمد في بعض رواياته وخفيت على الشّافعي وأبي حنيفة رضي الله عنهما مع تبحّرهما في الشّريعة ، وهو كلّ عمل ظاهر الجواز يتوصّل به إلى محظور اه . وفَسَّر المازري في باب بيوع الآجال من شرحه للتّلقين } سَدّ الذّريعة بأنّه منع ما يجوز لئلاّ يتَطرّق به إلى ما لا يجوز اه . والمراد : سدّ ذرائع الفساد ، كما أفصح عنه القرافي في «تنقيح الفصول» وفي «الفرق الثّامن والخمسين» فقال : الذّريعة : الوسيلة إلى الشّيء .ومعنى سدّ الذّرائع حسم مادّة وسائل الفساد .وأجمعت الأمّة على أنّ الذّرائع ثلاثة أقسام : أحدها : معتبر إجماعاً كحفر الآبار في طرق المسلمين وإلقاءِ السمّ في أطعمتهم وسبّ الأصنام عند من يُعلم من حاله أنّه يسبّ الله تعالى حينئذٍ . وثانيها : مُلغًى إجماعاً كزراعة العنب فإنّها لا تمنع لخشيَة الخمر ، وكالشركة في سكنى الدّور خشية الزّنا . وثالثها مختلف فيه كبيوع الآجال ، فاعتبر مالك رضي الله عنه الذّريعة فيها وخالفه غيره اه . وعَنَى بالمخالف الشّافعي وأبا حنيفة رضي الله عنهما .وهذه القاعدة تندرج تحت قاعدة الوسائل والمقاصد ، فهذه القاعدة شعبة من قاعدة إعطاء الوسيلة حكم المقصد خاصّة بوسائل حصول المفسدة . ولا يختلف الفقهاء في اعتبار معنى سدّ الذّرائع في القسم الّذي حكى القرافي الإجماع على اعتبار سدّ الذّريعة فيه . وليس لهذه القاعدة عنوان في أصول الحنفيّة والشّافعيّة ، ولا تعرّضوا لها بإثبات ولا نفي ، ولم يذكرها الغزالي في «المستصفى» في عداد الأصول الموهومة في خاتمة القطب الثّاني في أدلّة الأحكام .و { عَدْواً } بفتح العين وسكون الدّال وتخفيف الواو في قراءة الجمهور ، وهو مصدر بمعنى العدوان والظلم ، وهو منصوب على المفعوليّة المطلقة ل«يسبّوا» لأنّ العدو هنا صفة للسبّ ، فصحّ أن يحلّ محلّه في المفعوليّة المطلقة بياناً لنوعه . وقرأ يعقوب { عُدُوّاً } بضمّ العين والدّال وتشديد الواو وهو مصدر كالعَدْو .ووصفُ سبِّهم بأنّه عَدْو تعريض بأنّ سبّ المسلمين أصنامَ المشركين ليس من الاعتداء ، وجعل ذلك السبّ عدواً سواء كان مراداً به الله أم كان مراداً به من يأمر النّبيء صلى الله عليه وسلم بما جاء به لأنّ الّذي أمر النّبيء صلى الله عليه وسلم بما جاء به هو في نفس الأمر اللّهُ تعالى فصادفوا الاعتداء على جلاله .وقوله : { بغير علم } حال من ضمير { يسبّوا } ، أي عن جهالة ، فهم لجهلهم بالله لا يزعهم وازع عن سبّه ، ويسبّونه غير عالمين بأنّهم يسبّون الله لأنّهم يسبّون مَن أمر محمّداً صلى الله عليه وسلم بما جاء به فيصادف سبّهم سبّ الله تعالى لأنّه الّذي أمره بما جاء به .ويجوز أن يكون { بغير علم } صفة ل { عَدْواً } كاشفة ، لأنّ ذلك العدو لا يكون إلاّ عن غير علم بعظم الجرم الّذي اقترفوه ، أو عن علم بذلك لكن حالة إقدامهم عليه تشبه حالة عدم العلم بوخامة عاقبته .وقوله : { كذلك زيّنّا لكلّ أمّة عمَلهم } معناه كتزييننا لهؤلاء سُوءِ عملهم زَيَّنَّا لكلّ أمّة عملهم ، فالمشار إليه هو ما حكاه الله عنهم بقوله : { وجعلوا لله شركاء الجنّ إلى قوله فيسبّوا الله عدواً بغير علم } \\[ الأنعام : 100 108 \\]. فإنّ اجتراءهم على هذه الجرائم وعماهم عن النّظر في سوء عواقبها نشأ عن تزيينها في نفوسهم وحسبانهم أنّها طرائق نفع لهم ونجاة وفوز في الدّنيا بعناية أصنامهم .فعلى هذه السنّة وبمماثل هذا التّزيين زيّن الله أعمال الأمم الخالية مع الرّسل الّذين بُعثوا فيهم فكانوا يُشاكسونهم ويعصون نصحهم ويجترئون على ربّهم الّذي بعثهم إليهم ، فلمّا شبّه بالمشار إليه تزيينا عَلِم السّامع أنّ ما وقعت إليه الإشارة هو من قبيل التّزيين . وقد جرى اسم الإشارة هنا على غير الطّريقة الّتي في قوله : { وكذلك جعلناكم أمّة وسطا } \\[ البقرة : 143 \\] ونظائره ، لأنّ ما بعده يتعلّق بأحوال غير المتحدّث عنهم بل بأحوال أعمّ من أحوالهم . وفي هذا الكلام تعريض بالتوعّد بأن سيحلّ بمشركي العرب من العذاب مثلُ ما حلّ بأولئك في الدّنيا .وحقيقة تزيين الله لهم ذلك أنّه خلَقهم بعقول يَحْسُن لديها مثلُ ذلك الفعل ، على نحو ما تقدّم في قوله تعالى : { ولو شاء الله ما أشركوا } \\[ الأنعام : 108 \\]. وذلك هو القانون في نظائره .والتّزيين تفعيل من الزّيْن ، وهو الحُسن؛ أو من الزّينة ، وهي ما يتحسّن به الشّيء . فالتّزيين جعل الشّيء ذا زينة أو إظهاره زيْناً أو نسبته إلى الزّين . وهو هنا بمعنى إظهاره في صورة الزّين وإن لم يكن كذلك ، فالتّفعيل فيه للنّسبة مثل التّفسيق . وفي قوله : { ولكنّ الله حبَّب إليكم الإيمان وَزَيَّنه في قلوبكم } \\[ الحجرات : 7 \\] بمعنى جعله زيناً ، فالتّفعيل للجعل لأنّه حَسَن في ذاته .ولما في قوله : { كذلك زيّنّا لكلّ أمّة عملهم } من التّعريض بالوعيد بعذاب الأمم عقّب الكلام ب { ثُمّ } المفيدة التّرتيب الرتبي في قوله : { ثمّ إلى ربّهم مرجعهم فينبّئهم بما كانوا يعملون } ، لأنّ ما تضمّنته الجملة المعطوفة ب { ثُمّ } أعظم ممّا تضمّنته المعطوفُ عليها ، لأنّ الوعيد الّذي عُطفت جملته ب { ثمّ } أشدّ وأنكى فإنّ عذاب الدّنيا زائل غير مؤيّد . والمعنى أعظم من ذلك أنّهم إلى الله مرجعهم فيحاسبهم . والعدول عن اسم الجلالة إلى لفظ { ربّهم } لقصد تهويل الوعيد وتعليل استحقاقه بأنّهم يرجعون إلى مالكهم الذي خلقهم فكفروا نعمه وأشركوا به فكانوا كالعبيد الآبقين يطوِّفون ما يطوفوّن ثمّ يقعون في يد مالكهم .والإنباء : الإعلام ، وهو توقيفهم على سوء أعمالهم . وقد استعمل هنا في لازم معناه ، وهو التّوبيخ والعقاب ، لأنّ العقاب هو العاقبة المقصودة من إعلام المجرم بجرمه . والفاء للتّفريع عن المَرْجِع مؤذنة بسرعة العقاب إثر الرّجوع إليه .\n\n",
      "translations": [
        {
          "translation": "(Revile not those unto whom they pray) worship (beside Allah lest they wrongfully revile Allah through ignorance) because they have no knowledge, argument; this after He told them: (Lo! you (idolaters) and that which you worship beside Allah are fuel of hell) but then this was abrogated by the verse of fighting. (Thus) as We made their religion and works seem fair to them (unto every nation) to every adherents of a religion (have We made their deed) and their religion (seem fair. Then unto their Lord is their return) after they die, (and He will tell them what they used to do) in relation to their religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَيَسُبُّواْ ٱللَّهَ عَدْواً } معناهُ اعْتِداءٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"So they ascribe to Allah an enemy,\" is an act of aggression.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ تَسُبُّواْ } أي: لا تذكروا بالمساوئ والمقابح أيها المؤمنون الموحدون أصنام { ٱلَّذِينَ يَدْعُونَ } ويعبدون\n أي: المشركون { مِن دُونِ ٱللَّهِ } إذ هم من جملة المجالي والمظاهر لله مع أنكم إن تسبوهم وآلهتهم { فَيَسُبُّواْ ٱللَّهَ } من غاية جهلهم وحميتهم فتكونوا سبباً لسب الله { عَدْواً } تجاوزاً عن الحق إلى الباطل { بِغَيْرِ عِلْمٍ } بمآله { كَذَلِكَ } أي: مثل تزيننا لكم دينكم وإلهكم وعملكم { زَيَّنَّا لِكُلِّ أُمَّةٍ } من الأمم { عَمَلَهُمْ } وإلههم سواء كان حقاً أو باطلاً\n إذ { كُلُّ حِزْبٍ بِمَا لَدَيْهِمْ فَرِحُونَ } [المؤمنون: 53] { ثُمَّ إِلَىٰ رَبِّهِمْ مَّرْجِعُهُمْ فَيُنَبِّئُهُمْ بِمَا كَانُواْ يَعْمَلُونَ } [الأنعام: 108] أي: يجازيهم على مقتضى ما عملوا من خير وشر وإيمان وكفر\n\n\n{ وَ } من غاية نفاقهم واستهزائهم معك يا أكمل الرسل وتهكمهم بما جئت به من الآيات { أَقْسَمُواْ بِٱللَّهِ جَهْدَ أَيْمَٰنِهِمْ } أي: مغلظين فيها مؤكدين لها تهكماً { لَئِن جَآءَتْهُمْ آيَةٌ } من مقترحاتهم { لَّيُؤْمِنُنَّ بِهَا } البتة وبك أيضاً { قُلْ } لهم كلاماً خالياً عن وصمة الكذب: { إِنَّمَا ٱلآيَٰتُ } ونزولها وإنزالها { عِندَ ٱللَّهِ } وبقبضة قدرته وليس في وسعي وطاقتي شيء منها { وَمَا يُشْعِرُكُمْ } ويظهر لكم أيها المؤمنون الطالبون لإيمان هؤلاء الكفرة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { ولا تَسُبُّوا } أصنامهم { الذين } يدعونها آلهة، ويخضعون لها { من دون الله } أي: ولا تذكروا آلهتهم بسوء، { فيَسُبوا الله عَدْوًا } أي: ظُلْمًا وتجاوزًا عن الحق إلى الباطل، { بغير علم } أي: على جهالة بالله تعالى، وبما يجب أن يذكر به من التعظيم، رُوِي أنه صلى الله عليه وسلم كان يطعن في آلهتهم، فقالوا: لتنتهين عن آلهتنا أو لنَهجُونَّ إلهك، فنزلت. وقيل: كان المسلمون يسبون آلهتهم، فنُهوا لئلا يكون سبهم سببًا لسب الله تعالى، واستدل المالكية بهذا على سد الذرائع. قال البيضاوي: وفيه دليل على أن الطاعة إذا أدت لمعصية راجحة وجب تركها، فإنَّ ما يُؤدي إلى الشر شر. هـ. وقال ابن العربي: وقاية العرض بترك سنة واجب في الدنيا. هـ. قال تعالى: { كذلك زينَّا لكل أمة عملهم } من الخير والشر، نحملهم على ما سبق لهم توفيقًا أو تخذيلاً، أو يكون مخصوصًا بالشر، أي: زيَّنا لكل أمة من الكفرة عملهم السوء كَسَب الله تعالى وغيره من الكفر، { ثم إلى ربهم مرجعهم فينبئُهم بما كانوا يعملون } من الخير فيُجازيهم عليه، أو من الشر فيعاقبهم عليه. الإشارة: العارف الكامل لا يُنقِص شيئًا من مصنوعات الله، ولا يصغر شيئًا من مقدورات الله، بل يتأدب مع كل شيء لرؤية صنعة الله في كل شيء، وكذلك المريد اللبيب، يتأدب مع كل من ظهر بالخصوصية في زمنه، كان صادقًا أو كاذبًا لئلا يؤدي إلى تنقيص شيخه، حين يذكر غيره بنقص أو غض. وفي الحديث:\n \" لَعَن الله مَن يَسُبُّ والدَيهِ \" \nفقالُوا: وكيف يسبُّ والدَيه يا رسول الله؟ قال\n \" يَسُبُّ أبا الرجُلِ فيسُبُّ الرجلُ أباهُ وأُمه \" \nأو كما قال صلى الله عليه وسلم. ثم ردَّ عليم في اقتراح الآيات، فقال: { وَأَقْسَمُواْ بِٱللَّهِ جَهْدَ أَيْمَانِهِمْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:89",
      "similarity": 0.6616472725645529
    },
    {
      "verse": "18:92",
      "similarity": 0.6616472725645529
    },
    {
      "verse": "18:85",
      "similarity": 0.6493299092563729
    },
    {
      "verse": "18:84",
      "similarity": 0.550612078430915
    },
    {
      "verse": "2:166",
      "similarity": 0.5303206866431163
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006108.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006108.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:108.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}