{
  "chapter": "الأنعام",
  "text": "واقسموا۟ بالله جهد ايمنهم لئن جاءتهم ءاية ليؤمنن بها قل انما الءايت عند الله وما يشعركم انها اذا جاءت لا يؤمنون",
  "translations": [
    {
      "translation": "They have sworn by Allah with their most earnest oaths that if a Sign comes to them they will have iman in it. Say: The Signs are in Allah's control alone.' What will make you realise that even if a Sign did come, they would still not have iman?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They solemnly swear by God: \"If a sign comes to us we shall certainly believe in it.\" Tell them: \"The signs are with God.\" Yet for all you know they will not believe if the signs came to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah with their most solemn oaths that if a sign comes to them, they will certainly believe in it. Say: 'Signs are in Allah's power alone. What will make you realize that even if those signs were to come, they would still not believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The unbelievers solemnly swear by God that if they were to be shown some miracle, they would certainly believe. (Muhammad), tell them, \"Only with God are all the miracles.\" Even if a miracle was to take place, they still would not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swore by Allah vehemently in their oaths that if any sign came to them, they will certainly believe in it; say, “The signs are with Allah, and what do you people know that if they came to them, they will not believe.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swear their strongest oaths by Allah, that if there came to them a sign, they would surely believe therein. Say: \"Signs are but with Allah and what will make you perceive that (even) if it came, they will not believe\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swear by Allah with the strongest of their oaths, that if a sign came to them they would most certainly believe in it. Say: Signs are only with Allah; and what should make you know that when it comes they will not believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have sworn by God the most earnest oaths if a sign comes to them they will believe in it. Say: 'Signs are only with God.' What will make you realize that, when it comes, they will not believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swear a solemn oath by Allah that if there come unto them a portent they will believe therein. Say; Portents are with Allah and (so is) that which telleth you that if such came unto them they would not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear a solemn oath by God that if there should come to them a sign, they will believe in it. Say, \"Signs are granted only by God.\" How can you tell that if a sign be given to them, they will indeed believe in it?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swear by God with thee their solemn oaths that if there came unto them a sign they would surely believe therein. Say thou: signs are but with Allah; and what will make ye perceive that even if it came they will not believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by Allah with solemn oaths that were a sign to come to them they would surely believe in it. Say, ‘These signs are only from Allah,’ and what will bring home to you that they will not believe even if they came?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear their strongest oaths by Allah, that if a (special) sign came to them, by it they would believe. Say: \"Certainly (all) signs are in the power of Allah: but what will make you (Muslims) realise that (even) if (special) signs came, they will not believe.\"?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swear their strongest oaths by Allah, that if there came to them a sign, they would surely believe therein. Say: \"Signs are but with Allah and what will make you (Muslims) perceive that (even) if it (the sign) came, they will not believe?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They solemnly swear by Allah that if a sign is given to them they would believe in it. Say: 'Signs are only with Allah' And how can you tell if it comes they will not believe'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They swear by God, with their most solemn oaths, that if a miracle were to come to them, they would believe in it. Say, “The miracles are only with God.” But how do you know? Even if it did come, they still would not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they swear by Allah their strongest oaths that if a sign came to them, they would surely believe in it. Say, \"The signs are only with Allah.\" And what will make you perceive that even if a sign came, they would not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:109] They, that is, the disbelievers of Mecca, have sworn by God the most earnest oaths that if there came to them a sign, of what they requested, they will believe in it. Say, to them: ‘Signs are only with God’, and He sends them down as [and when] He wills; I am but a warner. But what will make you realise?, how would you know if they have believed, if these [signs] did come [to them]? In other words, you would not know this; truly, when they come, they will not believe, because of what I already know (a variant reading [for lā yu’minūna, ‘they will not believe’] has lā tu’minūna, ‘you will not believe’, making the address to the disbelievers; another [variant reading] has annahā [instead of innahā, ‘that truly’] as meaning la‘alla, ‘that perhaps’, or as governed by the preceding clause [la’in jā’athum āyatun, ‘if there came to them a sign’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they swear a solemn oath) an utmost oath, for when one swears by Allah, one swears a solemn oath (by Allah that if there come unto them a portent) as they have asked (they will believe therein) they will believe in that sign. (Say) Muhammad, to those who sneer and their folk: (Portents are with Allah) the signs come from Allah (and (so is) that which telleth you) and how do you know, believers (that if such) the signs (came unto them they would not believe) by Allah they will not believe in the sign.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا يُشْعِرُكُمْ } معناهُ ما يُدْرِيكُمْ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - exalted be He: {And what would make you know?} Its meaning is: what would make you know?",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وأقسموا بالله جهد أيمانهم لئن جاءتهم آية } إلى آخره\n طلبوا خوارق العادات وأعرضوا عن الحجج البينات\n لأنهم كانوا محجوبين بالحسّ والمحسوس\n فلم تنجع فيهم الدعوة بالحكمة والإثبات بالحجة كما تنجع في العقلاء والمستعدّين\n { قل إنما الآيات } أي: خوارق العادات التي اقترحوها إنما هي من عَالم القدرة ليست إلا عنده { وما يشعركم } أنهم لا يؤمنون عند مجيئها\n أي: أنا أعلم بهم منكم أنهم لا يؤمنون بها\n أو وما يشعركم أنهم يؤمنون عند مجيئها لعلها إذا جاءت لا يؤمنون بها\n ومن لم يرد الله منه الإيمان يقلب قلبه وبصره عند مجيء الآية التي اقترحها وزعم أنه يؤمن عند نزولها\n فيقول: هذا سحر\n ولا يؤمن به كما لا يؤمن قبل مجيء الآية ويذره في ظهور نفسه بصفاتها واحتجابه بها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وأنتم تتفرسون من مظاهر حالهم لو تأملتم في شأنهم { أَنَّهَآ إِذَا جَآءَتْ } جميع مقتراحتهم { لاَ يُؤْمِنُونَ } [الأنعام: 109] بها البتة\n إذ طبع الله على قلوبهم بالكفر والنفاق",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { جهد }: مصدر لعامل محذوف\n أي: واجتهدُّوا جهد أيمانهم\n وهو حال\n أي: وأقسموا جاهدين أيمانهم\n ومن قرأ: { أنها } بالفتح\n فهو مفعول بيُشعركم\n أي: وما يُدريكم أن الآيات إذا جاءت لا يؤمنون\n وقيل: { لا }: مزيدة\n أي: وما يدريكم أنهم لا يؤمنون إذا رأوها\n وقيل: أن\n هنا\n بمعنى لعل\n ومَن قرأ بالكسر فهو استئناف\n وتم الكلام في قوله: { وما يشعركم } أي: وما يشعركم ما يكون منهم\n فعلى القراءة بالكسر\n يُوقف على: { ما يشعركم } \n وأما على القراءة بالفتح\n فإن كانت أنَّ ـ مصدرية لم يوقف عليه لأنه عامل فيها\n وإن كانت بمعنى: لعل\n فأجاز بعض الناس الوقف\n ومنعه بعضهم\n يقول الحقّ جلّ جلاله: { وأقسموا } أي: المشركون\n { بالله } واجتهدوا في أيمانهم\n { لئن جاءتهم آية } ظاهرة يشهدونها\n { ليُؤمنن بها } وبمن جاء بها\n { قل } لهم: { إنما الآيات عند الله } وفي قدرته وإرادته\n يُظهرها حيث شاء\n وليس في قدرتي منها شيء\n { وما يُشعركم } أي: وما يُدريكم أيها المؤمنون\n { أنها إذا جاءت لا يؤمنون } بها\n لما سبق لهم من الشقاء\n وقد كان المؤمنون يتمنَّون إنزالها طمعًا في إيمانهم\n وفيه تنبيه على أنه تعالى إنما لم ينزلها لعلمه بأنها { إذا جاءت لا يؤمنون } بها\n وقيل: الخطاب للمشركين\n ويتأتى هذا على كسر \" إن \" \n أو على قراءة ابن عامر وحمزة: { لا تؤمنون } بتاء الخطاب\n وقرىء: { وما يُشعرهم } بالغيبة\n فيكون إنكارًا لهم على حلفهم\n ثم ذكر سبب عدم إيمانهم فقال: { ونُقلب أفئدتهم وأبصارهم } عند نزول الآية\n أي: نصرف قلوبهم ونحولها عن الحق\n فلا يفقهون بها\n ونقلب أبصارهم عن النظر والتفكر\n فلا يُبصرون بها الحق",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:53",
      "similarity": 0.6334589760564062
    },
    {
      "verse": "35:42",
      "similarity": 0.5206036205625941
    },
    {
      "verse": "16:38",
      "similarity": 0.5144307169333519
    },
    {
      "verse": "5:53",
      "similarity": 0.49300312964616955
    },
    {
      "verse": "75:1",
      "similarity": 0.41166227595085353
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006109.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006109.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:109.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}