{
  "chapter": "الأنعام",
  "text": "وكذلك نصرف الءايت وليقولوا۟ درست ولنبينه لقوم يعلمون",
  "translations": [
    {
      "translation": "That is how We vary the Signs, so that they say, 'You have been studying,' and so We can make it clear to people who know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus in varied ways We explain Our signs so that they may say: \"You have been instructed,\" and that We might make it clear to those who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We make Our signs clear in diverse ways that they might say: 'You have learned this (from somebody)'; and 'We do this in order that We make the Truth clear to the people of knowledge.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We explain Our revelations to them. Let them say,\"You have learned (those statements) from other people.\" We want to explain Our revelations only to those who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is how We explain Our verses in different ways that they (the disbelievers) may say to you, (O dear Prophet Mohammed – peace and blessings be upon him), “You have studied” – and to make it clear for the people of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We explain variously the verses so that they (the disbelievers) may say: \"You have Darasta (studied)\" and that We may make the matter clear for the people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We repeat the communications and that they may say: You have read; and that We may make it clear to a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We turn about the signs, that they may say, 'Thou hast studied'; and that We may make it clear to a people having knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We display Our revelations that they may say (unto thee, Muhammad): \"Thou hast studied,\" and that We may make (it) clear for people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is how We explain Our revelations in various ways -- so that they might come to the point of saying, \"You have read this out to us,\" and that We might make it clear [that this is the truth] to those who are eager to know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Thus We variously propound the revelation, and this is in order that they may say: thou hast studied, and that We may expound it to a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We paraphrase the signs variously, lest they should say, ‘You have received instruction,’ and so that We may make it clear for a people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do we explain the signs by various (symbols): that they may say, \"Thou hast taught (us) diligently,\" and that We may make the matter clear to those who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We explain variously the Verses so that they (the disbelievers) may say: \"You have studied (the Books of the people of the Scripture and brought this Quran from that)\" and that We may make the matter clear for the people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As such We make plain Our verses, so that they can say: 'You have studied' in order that We clarify it to a nation that knows.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We thus diversify the revelations, lest they say, “You have studied,” and to clarify them for people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We diversify the verses so the disbelievers will say, \"You have studied,\" and so We may make the Qur'an clear for a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:105] And so, in the same way that We have explained what has been mentioned, We dispense, We elucidate, the signs, that they might take heed, and that they, the disbelievers, may say, at the end of this: ‘You have studied with someone’, that you have consulted with (dārasta) the People of the Scripture or [that] you have studied (darasta, variant reading) the scriptures of past peoples and brought this [Qur’ān] therefrom; and that We may make it clear for a people who have knowledge.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجملة معترضة تذييلاً لما قَبلها . والواو اعتراضية فهو متّصل بجملة : { قد جاءكم بصائر من ربّكم } \\[ الأنعام : 104 \\] الّتي هي من خطاب الله تعالى رسوله صلى الله عليه وسلم بتقدير «قل» كما تقدّم ، والإشارة بقوله : { وكذلك } إلى التّصريف المأخوذ من قوله : { نُصرّف الآيات }.أي ومثلَ ذلك التّصريف نُصرّف الآيات . وتقدّم نظيره غير مرّة وأوّلها قوله : { وكذلك جعلناكم أمّة وسَطا } في سورة \\[ البقرة : 143 \\].والقول في تصريف الآيات تقدّم في قوله تعالى : { انظر كيف نصرّف الآيات } في هذه السّورة \\[ 46 \\].وقوله : { وليقُولوا دَرَسْتَ } معطوف على { وكذلك نصرّف الآيات }.وقد تقدّم بيان معنى هذا العطف في نظيره في قوله تعالى : { وكذلك نفصّل الآيات ولتستبين سبيل المجرمين } من هذه السّورة \\[ 55 \\]. ولكن ما هنا يخالف ما تقدّم مخالفة مَّا فإنّ قول المشركين للرّسول عليه الصلاة والسلام درستَ } لا يناسب أن يكون علّة لتصريف الآيات ، فتعيَّن أن تكون اللاّم مستعارة لمعنى العاقبة والصيرورة كالّتي في قوله تعالى : { فالتقطه آل فرعون ليكونَ لهم عدوّاً وحزناً } \\[ القصص : 8 \\]. المعنى . فكان لهم عدوّاً . وكذلك هنا ، أي نصرّف الآيات مثلَ هذا التّصريف الساطع فيحسبونك اقتبسته بالدّراسة والتّعليم فيقولوا : دَرَسْتَ . والمعنى : أنّا نصرّف الآيات ونبيّنها تبييناً من شأنه أن يصدر من العَالِم الَّذي دَرَس العلم فيقول المشركون دَرستَ هذا وتَلَقَّيتَه من العلماء والكُتب ، لإعراضهم عن النّظر الصّحيح الموصل إلى أنّ صدور مثل هذا التَّبيين من رجل يعلمونه أمِّيّاً لا يكون إلاّ من قِبل وحي من الله إليه ، وهذا كقوله : { ولقد نعلم أنّهم يقولون إنّما يعلّمه بشر } \\[ النحل : 103 \\] وهم قد قالوا ذلك من قَبْل ويقولونه ويزيدون بمقدار زيادة تصريف الآيات ، فشُبّه ترَتُّب قولهم على التّصريف بترتّب العلّة الغائيَّة ، واستعير لهذا المعنى الحرفُ الموضوع للعلّة على وجه الاستعارة التّبعيّة ، ولذلك سمَّى بعض النّحويين مثل هذه اللاّم لام الصّيرورة ، وليس مرادهم أنّ الصّيرورة معنى من معاني اللاّم ولكنّه إفصاح عن حاصل المعنى .والدّراسة : القراءة بتمهّل للحفظ أو للفهم ، وتقدّم عند قوله تعالى : { وبما كنتم تدرسون } في سورة \\[ آل عمران : 79 \\]. وفعله من باب نصر . يقال : درس الكتاب ، أي تعلّم . وقد تقدّم في قوله تعالى : { بما كنتم تعلمون الكتاب وبما كنتم تدرسون } \\[ آل عمران : 79 \\] ، وقال { وَدَرَسوا ما فيه } \\[ الأعراف : 169 \\]. وسمّي بيت تعلّم اليهود المِدْرَاسَ ، وسمّي البيت الّذي يسكنه التّلامذة ويتعلّمون فيه المدرسة . والمعنى يقولون : تعلّمت ، طعْناً في أمّية الرّسول عليه الصّلاة والسّلام لئلاّ يلزمَهم أنّ ما جاء به من العلم وحي من الله تعالى .وقرأ الجمهور { درست } بدون ألف وبفتح التّاء . وقرأه ابن كثير ، وأبو عمرو «دَارسْتَ» على صيغة المفاعلة وبفتح التّاء أي يقولون : قرأت وقُرىء عليك ، أي دارسْتَ أهل الكتاب وذاكرتهم في علمهم . وقرأه ابن عامر ويعقوب «دَرَسَتْ» بصيغة الماضي وتاء التأنيث أي الآيات ، أي تكرّرتْ .وأمّا اللاّم في قوله : { ولنبيّنه لقوم يعلمون } فهي لام التّعليل الحقيقيّة . وضمير { نبيّنه } عائد إلى القرآن لأنّه ماصْدَق { الآيات } ، ولأنّه معلوم من السّياق .والقوم هم الّذين اهتدوا وآمنوا كما تقدّم في قوله : { قد فصّلنا الآيات لقوم يعلمون } \\[ الأنعام : 97 \\] ، والكلام تعريض كما تقدّم .والمعنى أنّ هذا التّصريف حصل منه هدى للموفّقين ومكابرة للمخاذيل . كقوله تعالى : { يضلّ به كثيراً ويهدي به كثيراً وما يضلّ به إلاّ الفاسقين } \\[ البقرة : 26 \\].\n\n",
      "translations": [
        {
          "translation": "146 (Thus do We display Our revelations) We expound the Qur'an regarding their matter (that they may say (unto thee, Muhammad): \"Thou hast studied,\") you have learnt and acquired these traits from another person; it is also said that this means: in order that they do not say you acquired these traits from another person; and it is also said that it could mean: so that they do not say you have learnt it from Abu Fukayhah, a client from the Quraysh, or from Jabr and Yasar, two other clients from the Quraysh; and it could also mean: these are old stories (and that We may make (it) clear for people who have knowledge) who believe it is from Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { دَرَسْتَ } معناهُ قَرَأتَ وتعلَّمَت\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Study,\" means that you read and learned.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { وَكَذٰلِكَ } أي: مثل ذلك المذكور { نُصَرِّفُ } ونكرر { ٱلآيَاتِ } الدالة على توحيدنا رجاء أن يتنبهوا فلم يتنبهوا { وَ } غاية أمرهم أنهم { لِيَقُولُواْ } لك يا أكمل الرسل: { دَرَسْتَ } تعلمت هذه الأساطير الكاذبة القديمة من أهل الكتاب { وَ } مع كونه ما نصرفها ونكررها إلا { لِنُبَيِّنَهُ } ونوضحه إلى التوحيد الذاتي المدلول عليه بتصريف الآيات والدلالة { لِقَوْمٍ يَعْلَمُونَ } [الأنعام: 105] يستدلون بالدلائل القاطعة والبراهين الساطعة على وحدة الصانع الحكيم\n وانصرفوا عنكم ولم يقبلوا منك ما جئت به من الآيات\n اتركهم وحالهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: تصريف الشيء: إجراؤه على أحوال متعاقبة وجهات مختلفة، ومنه: تصريف الرياح لهبوبه من جهات مختلفة، ولما كانت آيات القرآن تنزل على أنواع مختلفة في أوقات متعاقبة، شبهت بتصريف الرياح على أنحاء مختلفة، { وليقولوا }: متعلق بمحذوف، أي: وليقولوا: درست، صرفنا الآيات، واللام للعاقبة، وكذلك: { ولنبينه }: المتعلق واحد. يقول الحقّ جلّ جلاله: ومثل ذلك التصريف الذي صرفنا من الآيات، من قوله:\n[الأنعَام:95]، إلى قوله:\n[الأنعَام:104] ـ { نُصرِّف الآيات } في المستقبل لتكون عاقبة قوم الشقاء بها بتكذيبهم إياها، { وليقولوا } لك: { دارسْتَ } أهل الكتاب، وتعلمت ذلك منهم، وليس بوحي، أو { درسَت } هذه الأخبار وعفت، وأخبرت بها من إملاء غيرك عليك، كقولهم: أساطير الأولين، وليكون عاقبة قوم آخرين الاهتداء، وإليهم الإشارة بقوله: { ولنبينه لقوم يعلمون } أي: وليتضح معناه عند قوم آخرين، فيهتدوا به إلى معرفتي وتوحيدي ومحل رضواني وكرامتي، فالخطاب متحد، والأثبر مختلف على حسب السابقة. الإشارة: ظهور الآيات على يد أهل الخصوصية ـ كالعلوم اللدنية والمواهب الربانية ـ لا يوجب لهم التصديق لجميع الخلق، فلو أمكن ذلك لكان النبي صلى الله عليه وسلم أولى به، بل لا بد من الاختلاف، فقوم قالوا: هذه العلوم... دارس فيها وتعلمها، وقوم قالوا: بل هي من عند الله لا كسب فها، قال تعالى:\n[هُود:118]. ثم أمر نبيه بالإعراض عن أهل الإنكار، فقال: { ٱتَّبِعْ مَآ أُوحِيَ إِلَيْكَ مِن رَّبِّكَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "68:37",
      "similarity": 0.8480525068479249
    },
    {
      "verse": "34:44",
      "similarity": 0.8261899093522881
    },
    {
      "verse": "3:79",
      "similarity": 0.7698810664267649
    },
    {
      "verse": "6:156",
      "similarity": 0.735282194275163
    },
    {
      "verse": "7:169",
      "similarity": 0.5783148434532239
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006105.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006105.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:105.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}