{
  "chapter": "الأنعام",
  "text": "ذلكم الله ربكم لا اله الا هو خلق كل شىء فاعبدوه وهو على كل شىء وكيل",
  "translations": [
    {
      "translation": "That is Allah, your Lord. There is no god but Him, the Creator of everything. So worship Him. He is responsible for everything.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is God, your Lord; there is no god but He, the creator of all things. So pay homage to Him, for He takes care of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Allah, your Lord. There is no god but He - the Creator of all things. Serve Him alone - for it is He Who is the guardian of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God your Lord. There is no God but He. He has created all things. Worship Him for He is the Guardian of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Allah, your Lord; and none is worthy of worship except Him; the Creator of all things – therefore worship Him; and He is the Trustee over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Allah, your Lord! None has the right to be worshipped but He, the Creator of all things. So worship Him (alone), and He is the Guardian over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Allah, your Lord, there is no god but He; the Creator of all things, therefore serve Him, and He has charge of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That then is God your Lord; there is no god but He, the Creator of everything. So serve Him, for He is Guardian over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Allah, your Lord. There is no Allah save Him, the Creator of all things, so worship Him. And He taketh care of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is God, your Lord, there is no God but Him, the Creator of all things, so worship Him; He is the guardian of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Allah, your Lord, There is no god but He, the Creator of everything: so worship Him. And He is unto everything a Trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Allah, your Lord, there is no god except Him, the creator of all things; so worship Him. He watches over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Allah, your Lord! there is no god but He, the Creator of all things: then worship ye Him: and He hath power to dispose of all affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is Allah, your Lord! La ilaha illa Huwa (none has the right to be worshipped but He), the Creator of all things. So worship Him (Alone), and He is the Wakil (Trustee, Disposer of affairs, Guardian, etc.) over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Allah, your Lord. There is no god except He, the Creator of all things. Therefore, worship Him. He is the Guardian of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is God, your Lord. There is no god except He, the Creator of all things; so worship Him. He is responsible for everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Allah, your Lord; there is no deity except Him, the Creator of all things, so worship Him. And He is Disposer of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:102] That then is God, your Lord. There is no god but Him, the Creator of all things. So worship Him, affirm His Oneness. And He is Guardian over, [He is] Keeper of, all things.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Such is Allah, your Lord) He Who does so is your Lord. (There is no God save Him) alone without any partner, (the Creator of all things, so worship Him) declare His divine Oneness and do not ascribe partners to Him. (And He taketh care) He is witness; as it is said that this means: He is the guarantor of the provision (of all things) of all created beings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ذلكم } البديع العديم المثل الموصوف بجميع هذا الصفات { الله ربّكم لا إله } في الوجود { إلا هو } أي: لا موجود إلا هو باعتبار الجمع { خالق كل شيء } باعتبار تفاصيل صفاته فخصوا العبادة به\n أي: بالوجود الموصوف بجميع الصفات الذي هو الله دون من سواه { وهو على كل شيء وكيل } أي: لا يستحق العبادة إلا المبدئ لكل شيء وهو مع ذلك وكيل على الكل يحفظها ويدبرها ويوصل إليها الأرزاق وما تحتاج إليه حتى تبلغ الكمال اللاحق بها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذٰلِكُمُ ٱللَّهُ } أي: الذات الأحدية الموصوفة بالصفات الأزلية الأبدية السرمدية المتجلي بالتجليات اللطيفة والقهرية { رَبُّكُمْ } ومربيكم أيها الأطفال الهالكة والعكوس الباطلة { لاۤ إِلَـٰهَ } ولا موجود { إِلاَّ هُوَ } وهو { خَٰلِقُ } ومظهر { كُلِّ شَيْءٍ } ظهر من العكوس والأضلال { فَٱعْبُدُوهُ } فهو المستحق للعبادة والرجوع \n وفوضوا أمروكم كلها إليه وكيف لا يفوضونها إليه { وَهُوَ } بذاته وأوصافه وأسمائه { عَلَىٰ كُلِّ شَيْءٍ } من الكوائن والفواسد الحادثة في مظاهره { وَكِيلٌ } [الأنعام: 102] يوليها ويصرفها كيف يشاء حسب قدرته وإرادته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلكم } المنعوت بما ذكر من جلائل الصفات\n هو { الله } المستحق للعبادة خاصة\n { ربُكم } أي مالك أمركم لا شريك له أصلاً\n { خالقُ كل شيء } \n مما كان وسيكون\n ولا تكرار مع ما قبله لأن المعتبر فيما تقدم خالقيته لِمَا كان فقط\n كما تقتضيه صيغة الماضي\n بخلاف الوصف يصلح للجميع\n وإذا تقرر أنه خالق كل شيء { فاعبدوه } فإن من كان خالقًا لكل شيء\n جامعًا لهذه الصفات\n هو المستحق للعبادة وحده\n { وهو على كل شيء وكيل } أي: هو متولي أمور جميع عباده ومخلوقاته\n التي أنتم من جملتها\n فَكِلُوا أمركم إليه\n وتوسلوا بعبادته إلى جميع مآربكم الدنيوية والأخروية\n فإنه يكفيكم أمرها بقدرته وحفظه\n\nالإشارة: كل من خضع لمخلوق في نيل حظ دنيوي\n إنسيًا أو جنيًا\n أو أطاعه في معصية الخالق\n فهو مشرك به مع ربه\n\n[النساء:116]\n فلذلك عمل الصوفية على مجاهدة نفوسهم في مخالفة الهوى لئلا تميل بهم إلى شيء من السِّوى\n وتحرروا من رق الطمع\n وتوجهوا بمهمتهم إلى الحق وحده\n ليتبرأوا من أنواع الشرك كلها\n جليها وخفيها\n حفظنا الله بما حفظهم به\n آمين\n ثم عَرَّف بذاته المقدسة\n فقال: { لاَّ تُدْرِكُهُ ٱلأَبْصَارُ وَهُوَ يُدْرِكُ ٱلأَبْصَارَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:62",
      "similarity": 0.8542029538753803
    },
    {
      "verse": "64:13",
      "similarity": 0.7092383902776798
    },
    {
      "verse": "27:79",
      "similarity": 0.5877417379342392
    },
    {
      "verse": "17:54",
      "similarity": 0.5628166138046916
    },
    {
      "verse": "16:42",
      "similarity": 0.5537205697422632
    }
  ]
}