{
  "chapter": "الأنعام",
  "text": "لا تدركه الابصر وهو يدرك الابصر وهو اللطيف الخبير",
  "translations": [
    {
      "translation": "Eyesight cannot perceive Him but He perceives eyesight. He is the All-Penetrating, the All-Aware.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No eyes can penetrate Him, but He penetrates all eyes, and He knows all the mysteries, for He is all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No visual perception can encompass Him, even though He encompasses all visual perception. He is the All-Subtle, the All-Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No mortal eyes can see Him, but He can see all eyes. He is All-kind and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eyes do not encompass Him – and all eyes are within His domain*; He is the Most Subtle, the Fully Aware. (* control / knowledge)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No vision can grasp Him, but His grasp is over all vision. He is the Most Subtle, Well-Acquainted (with all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vision comprehends Him not, and He comprehends (all) vision; and He is the Knower of subtleties, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The eyes attain Him not, but He attains the eyes; He is the All-subtle, the All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vision comprehendeth Him not, but He comprehendeth (all) vision. He is the Subtile, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No vision can grasp Him, but He takes in over all vision; He is the Subtle and Aware One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Sights comprehend Him not, and He comprehendeth all sights. And He is the Subtle, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The sights do not apprehend Him, yet He apprehends the sights, and He is the All-attentive, the All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No vision can grasp Him, but His grasp is over all vision: He is above all comprehension, yet is acquainted with all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No vision can grasp Him, but His Grasp is over all vision. He is the Most Subtle and Courteous, Well-Acquainted with all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No eye can see Him, though He sees all eyes. He is the Subtle, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No vision can grasp Him, but His grasp is over all vision. He is the Subtle, the Expert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vision perceives Him not, but He perceives [all] vision; and He is the Subtle, the Acquainted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:103] Vision cannot attain Him, that is, they [the eyes] cannot see Him — this is [a denial that applies] in particular [circumstances], since [it is accepted] that the believer will see Him in the Hereafter, as indicated   by God’s words, On that Day faces shall be radiant, gazing upon their Lord [Q. 75:22f.], and by the hadīth of the two Shaykhs [Bukhārī and Muslim]: ‘Verily you shall see your Lord, as clearly as you see the full moon at night’) — and it is also said [to mean] that it [vision] cannot encompass Him; but He attains [all] vision, that is to say, He perceives them, whereas they cannot perceive Him; it is not possible in [the case of] anyone other than Him to attain all vision while it [vision] cannot attain Him or encompass Him in knowledge. And He is the Subtle, [in dealing] with His friends, the Aware, of them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Vision comprehendeth Him not) in this world, nor do created beings see what He sees. Sights will not comprehend the modality of seeing Him in the Hereafter nor will created beings be able to see Him in this world, (but He comprehendeth (all) vision) in this world and in the Hereafter: He sees that which human beings do not see and nothing escapes or is hidden from Him. (He is the Subtile) in His actions whose knowledge surrounds His created beings, (the Aware) of His created beings and their actions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n  { لا تدركه الأبصار } أي: لا تحيط به لأنه اللطيف الجليل عن إدراكها، وكيف تدركه وهي لا تدرك أنفسها التي هي نور منه؟! { وهو يُدْرِك الأبْصَار } لإحاطته بكل شيء ولطف إدراكه { قد جاءكم بصائر من ربّكم } أي: آيات بيّنات هي صور تجليات صفاته التي هي أنوار بصائر القلوب",
      "translations": [
        {
          "translation": "\n\n{You cannot perceive it with your eyes}\n\nThis means that you cannot surround it because it is too delicate to be grasped.,\nHow can you understand it when it does not understand itself, which is light from it?! {And He grasps the eyesights} to envelop everything with His knowledge and the ease of His understanding {There has come to you enlightenment from your Lord} i.e. clear verses, they are the manifestations of His attributes which are the lights of the hearts' eyesights.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإن كان { لاَّ تُدْرِكُهُ } من غاية ظهوره وجلائه { ٱلأَبْصَٰرُ } القاصره عن إبصار نوره { وَ } كيف تدركه الأبصار { هُوَ } بذاته { يُدْرِكُ } ويبصر { ٱلأَبْصَٰرَ } ومبصر الأبصار لا يبصره الأبصار { وَ } كيف يبصر { هُوَ ٱللَّطِيفُ } الرقيق المنزه عن المجازاة والمقابلة والانطباع والمحاكاة { ٱلْخَبِيرُ } [الأنعام: 103] هو كيف يخبر عنه، وبالجملة ما يرى الله إلا الله، وما يخبر عنه إلا هو، كل شيء هالك إلى وجهه له الحكم وإليه ترجعون رجوع الظل إلى ذي الظل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { لا تدركه الأبصار } أي: لا تحيط به، ولا تناله بحقيقته، وعن ابن عباس:  لا تدركه في الدنيا، وهو يُرى في الآخرة، ومذهب الأشعرية: أن رؤية الله في الدنيا جائزة عقلاً، لأن موسى عليه السلام سألها، ولا يسأل موسى ما هو محال، وأحالته المعتزلة مُطلقًا، وتمسكوا بالآية، ولا دليل فيها لأنه ليس الإدراك مطلق الرؤية، ولا النفي في الآية عامًا في الأوقات، فلعله مخصوص ببعض الحالات، ولا في الأشخاص فإنه في قوة قولنا: لا كل بصر يدركه، مع أن النفي لا يوجب الامتناع\n قاله البيضاوي\n ثم قال تعالى: { وهو يُدرك الأبصارَ } أي: يحيط علمه بها إذ لا تخفى عليه خافية، { وهو اللطيف الخبير } فيدرك ما لا تدركه الأبصار، ويجوز أن يكون تعليلاً للحُكمَين السابقين على طريق اللفّ، أي: لا تدركه الأبصار لأنه اللطيف، وهو يدرك الأبصار لأنه الخبير، فيكون اللطيف مقابلاً للكثيف، لا يُدرك بالحاسة ولا ينطبع فيها\n قاله البيضاوي وأبو السعود\n الإشارة: اعلم أن الحق جل جلاله قد تجلى لعباده في مظاهر الأكوان، لكنه لحكمته وقدرته، قد تجلى بين الضدين، بين الأنوار والأسرار، بين الحس والمعنى، بين مظهر الربوبية وقالب العبودية، فالأنوار ما ظهر من الأواني، والأسرار ما خَفِيَ من المعاني، فالحس ما يُدرك بحاسة البصر، والمعنى ما يُدرك بالبصيرة\n فالحس رداء للمعنى، فمن فتح الله بصيرته استولى نورُ بصيرته على نور بصره، فأدرك المعاني خلف رقة الأواني، فلم تحجبه الأواني عن المعاني، بل تمتحق في حقه الأواني، ولا يرى حينئذٍ إلا المعاني\n لذلك قال الحلاج، لما سئل عن المعرفة، قال: استهلاك الحس في المعنى\n فإذا فَنِيَ العبد عن شهود حِسِّه بشهود معناه، غاب وجوده في وجود معبوده، فشاهد الحقَّ بالحق\n فالعارفون لَمَّا فنوا عن أنفسهم، لا يقع بصرهم إلا على المعاني، فهم يشاهدون الحق عيانًا\n ولذلك قال شاعرُهم:\n\nوقال في الحِكَم: \" ما حَجَبَكَ عن الحَقِّ وجُودُ مَوجُودٍ مَعَه إذ لا شَيءَ مَعَهَ، وَإنَّما حَجَبك تَوّهُّمُ مَوُجُودٍ مَعَهُ \"\n وقوله تعالى: { لا تُدركه الأبصارُ } أي: الأبصار الحادثة، وإنما تدركه الأبصار القديمة في مقام الفناء\n وقال الورتجبي: لا تدركه الأبصار، إلا بأبصار مستفادة من أبصار جلاله، وكيف يدركه الحدثان؟ ووجود الكون عند ظهور سطوات عظمته عدم\n هـ\n أو لا تحيط به، إذ الإحاطة بكُنه الربوبية متعذرة\n وعلى هذا حمل الآية في نوادر الأصول، قال: إدراك الهوية ممتنع، وإنما يقع التجلي بصفة من صفاته\n وقال ابن عبد الملك في شرح مشارق الصغاني، ناقلاً عن المشايخ: إنما يتجلى الله لأهل الجنة، ويريهم ذاته تعالى، في حجاب صفاته، لأنهم لا يطيقون أن يروا ذاته بلا حجابٍ مرَتبةٍ من مراتب الصفات\n\n\nوقال الورتجبي: التجلي لا يكون بكلية الذات، ولا بكلية الصفات، وإنما يكون على قدر الطاقات، فيستحيل أن يقال: تجلى كل الهوى لذرة واحدة، وإنما يتجلى لها على قدرها\n هـ\n وتتفاوت الناس في لذَّة النظر يوم القيامة على قدر معرفتهم في الدنيا، وتدوم لهم النظرة على قدر اسغراقهم هنا، فمن كان هنا محجوبًا لا يرى إلا الحس، كان يوم القيامة كذلك، إلا في وقت مخصوص، يُغيبه الحق تعالى عن حسه، فيشاهد معاني أسرار الربوبية في مظاهر أنوار صفاته\n ومن كان هنا مفتوحًا عليه في شهود المعاني، كان يوم القيامة كذلك، لا تغيب عنه مشاهدة الحق ساعة\n قال الغزالي في كتاب الأربعين: إذا ارتفع الحجاب بعد الموت انقلبت المعرفة بعينها مشاهدة\n قلت: ومعنى كلامه: أن ما عرفه به هنا من التجليات، صار بعينه هناك مشاهدة لأن المعنى هناك غالب على الحس، بخلاف دار الدنيا، الحس فيها غالب، إلاَّ لمن غاب عنه واستهلكه\n ثم قال: ويكون لكل واحد على قدر معرفته، ولذلك تزيد لذة أولياء الله تعالى في النظر على لذة غيرهم، ولذلك يتجلى الله تعالى لأبي بكر خاصة، ويتجلى للناس عامة\n وقال في الإحياء: ولَمَّا كانت المعرفة على درجات متفاوتة كان التجلي على درجات متفاوتة، ثم ذكر حديث التجلي لأبي بكر المتقدم\n ثم قال: فلا ينبغي أن يظن أن غير أبي بكر، ممن هو دونه، يجد من لذة النظر والمشاهدة ما يجده أبو بكر، بل لا يجده، إلا عُشرَ عُشرِه، إن كانت معرفته في الدنيا عشر عشره، ولما فَضَل الناسَ بسر وقر في صدره، فضل لا محالة بِتَجلًّ انفرد به\n وقال أيضًا: يتجلى الحق للعبد، تجليًا يكون انكشاف تجلَّيه، بالإضافة إلى ما علمه، كانكشاف تجلي المرئيات بالإضافة إلى ما تخيله ـ أي: إلى ما وصفه له الواصف\n ثم قال: وهذه المشاهدة والتجلي هي التي تسمى رؤية، ثم قال: المعرفة الحاصلة في الدنيا هي التي تستكمل، فتبلغ كمال الكشف والوضوح وتنقلب مشاهدة، ولا يكون بين المشاهدة في الآخرة والمعلوم في الدنيا اختلاف، إلا من حيث زيادة الكشف والوضوح\n وقال أيضًا: وبحر المعرفة لا ساحل له، والإحاطة بكنه جلاله مُحال، وكلما كثرت المعرفة وقويت كثر النعيم في الآخرة، وعظم، كما أنه كلما كثر البذر وحسن كثر الزرع وحسن، ولا يمكن تحصيل هذا البذر إلا في الدنيا، ولا يزرع إلا في صعيد القلب، ولا حصاد إلا في الآخرة\n هـ\n قال شيخنا مولاي العربي رضي الله عنه: بل الرجال زرعوا اليوم وحصدوا اليوم، وفي تفسير الأقليشي لقوله:\n\n[الفاتحة:6]: ليس لهذه الهدايةـ ما دام العبد في الدنيا ـ نهاية، حتى إذا حصل في جوار الجبار، ونظر إلى وجهه العظيم، كان حظه من النعيم بقدر ما هداه في الدنيا لصراطه المستقيم\n\n\nهـ\n وقال في نوادر الأصول: في الحديث:\n\n \" إنَّ مِن أهل الجنَّة من ينظرُ إلى الله عزَّ وجَلَّ غُدوَةً وعَشيًّا \" \n\nورُوِي عن معاذ أنه قال: \" صِنفٌ مِن أهلِ الجَنَّة مَن يَنظُر إلى الله عزَّ وجَلَّ، لا يُستر الربُّ عنهم ولا يحتَجِبُ \" ثم قال: وذُكر أن الرضوان آخر ما ينال أهلُ الجنة، ولا شيء أكبر منه، وكل عبد من أهل الجنة حظه من الرضوان هناك فيها على قدر جوده بنفسه على الله في الدنيا\n هـ\n وقوله تعالى: { وهو اللطيف الخبير } ، قال الورتجبي: هو بلطف ذاته ممتنع عن مطالعة خلقه، مع علو شأن علمه وإحاطته بجميعهم، وجودًا وعدمًا، أي: وإنما يُرى بنوره، لا بالحواس الخفاشية، فإنها تضعف عن مقاومة شعاعه، وتنخنس عند انكشاف سبحاته\n هـ\n على نقل الحاشية الفاسية\n والله تعالى أعلم\n ولمَّا كان الاطلاع على هذه الأسرار، به تنفتح البصائر، أشار إلى ذلك بقوله: { قَدْ جَآءَكُمْ بَصَآئِرُ مِن رَّبِّكُمْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "67:14",
      "similarity": 0.7319544548045528
    },
    {
      "verse": "33:34",
      "similarity": 0.6613042759463743
    },
    {
      "verse": "42:19",
      "similarity": 0.5973618215735824
    },
    {
      "verse": "22:63",
      "similarity": 0.5037392304278723
    },
    {
      "verse": "26:61",
      "similarity": 0.48785423966174185
    }
  ]
}