{
  "chapter": "الأنعام",
  "text": "ولا تسبوا۟ الذين يدعون من دون الله فيسبوا۟ الله عدوۢا بغير علم كذلك زينا لكل امة عملهم ثم الى ربهم مرجعهم فينبئهم بما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "Do not curse those they call upon besides Allah, in case that makes them curse Allah in animosity, without knowledge. In this way We make the actions of every nation seem attractive to them. Then they will return to their Lord, and He will inform them about what they did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not revile those who invoke others apart from God, lest they begin to revile God out of malice and ignorance. We have made attractive their deeds to every people. They have to go back to their Lord, when He will tell them what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not revile those whom they invoke other than Allah, because they will revile Allah in ignorance out of spite. For We have indeed made the deeds of every people seem fair to them. Tlen, their return is to their Lord and He will inform them of what they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, do not say bad words against the idols lest they (pagans) in their hostility and ignorance say such words against God. We have made every nation's deeds seem attractive to them. One day they will all return to their Lord who will inform them of all that they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not abuse those whom they worship besides Allah lest they become disrespectful towards Allah’s Majesty, through injustice and ignorance; likewise, in the eyes of every nation, We have made their deeds appear good – then towards their Lord they have to return and He will inform them of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And insult not those whom they worship besides Allah, lest they insult Allah wrongfully without knowledge. Thus We have made fair seeming to each people its own doings; then to their Lord is their return and He shall inform them of all that they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not abuse those whom they call upon besides Allah, lest exceeding the limits they should abuse Allah out of ignorance. Thus have We made fair seeming to every people their deeds; then to their Lord shall be their return, so He will inform them of what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abuse not those to whom they pray, apart from God, or they will abuse God in revenge without knowledge. So We have decked out fair to every nation their deeds; then to their Lord they shall return, and He will tell them what they have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Revile not those unto whom they pray beside Allah lest they wrongfully revile Allah through ignorance. Thus unto every nation have We made their deed seem fair. Then unto their Lord is their return, and He will tell them what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not revile those [beings] whom they invoke instead of God, lest they, in their hostility, revile God out of ignorance. Thus to every people We have caused their actions to seem fair. To their Lord they shall all return, and He will declare to them all that they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Revile not those whom they invoke besides Allah, lest they may spitefully revile Allah without knowledge. Thus fair-seeming unto every community We have made their work. Then unto their Lord is their return, and then He will declare unto them that which they were wont to work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not abuse those whom they invoke besides Allah, lest they should abuse Allah out of hostility, without any knowledge. That is how to every people We have made their conduct seem decorous. Then their return will be to their Lord and He will inform them concerning what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Revile not ye those whom they call upon besides Allah, lest they out of spite revile Allah in their ignorance. Thus have We made alluring to each people its own doings. In the end will they return to their Lord, and We shall then tell them the truth of all that they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And insult not those whom they (disbelievers) worship besides Allah, lest they insult Allah wrongfully without knowledge. Thus We have made fair-seeming to each people its own doings; then to their Lord is their return and He shall then inform them of all that they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not say crude words to those who call upon other than Allah, lest they use crude words about Allah in revenge without knowledge. As such we have made the actions of each nation seem pleasing. To their Lord they shall return, and He will inform them of that they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not insult those they call upon besides God, lest they insult God out of hostility and ignorance. We made attractive to every community their deeds. Then to their Lord is their return, and He will inform them of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not insult those they invoke other than Allah, lest they insult Allah in enmity without knowledge. Thus We have made pleasing to every community their deeds. Then to their Lord is their return, and He will inform them about what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:108] Do not revile those whom they call upon, besides God, namely, the idols, lest they then revile God out of spite, out of aggression and wrongfully, through ignorance, that is, through their ignorance of God. So, in the same way that We have adorned for these that which they practise, We have adorned for every community their, good and evil, deeds, and they commit them; then to their Lord they shall return, in the Hereafter, and He will tell them what they used to do, and requite them for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Revile not those unto whom they pray) worship (beside Allah lest they wrongfully revile Allah through ignorance) because they have no knowledge, argument; this after He told them: (Lo! you (idolaters) and that which you worship beside Allah are fuel of hell) but then this was abrogated by the verse of fighting. (Thus) as We made their religion and works seem fair to them (unto every nation) to every adherents of a religion (have We made their deed) and their religion (seem fair. Then unto their Lord is their return) after they die, (and He will tell them what they used to do) in relation to their religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَيَسُبُّواْ ٱللَّهَ عَدْواً } معناهُ اعْتِداءٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"So they ascribe to Allah an enemy,\" is an act of aggression.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ تَسُبُّواْ } أي: لا تذكروا بالمساوئ والمقابح أيها المؤمنون الموحدون أصنام { ٱلَّذِينَ يَدْعُونَ } ويعبدون\n أي: المشركون { مِن دُونِ ٱللَّهِ } إذ هم من جملة المجالي والمظاهر لله مع أنكم إن تسبوهم وآلهتهم { فَيَسُبُّواْ ٱللَّهَ } من غاية جهلهم وحميتهم فتكونوا سبباً لسب الله { عَدْواً } تجاوزاً عن الحق إلى الباطل { بِغَيْرِ عِلْمٍ } بمآله { كَذَلِكَ } أي: مثل تزيننا لكم دينكم وإلهكم وعملكم { زَيَّنَّا لِكُلِّ أُمَّةٍ } من الأمم { عَمَلَهُمْ } وإلههم سواء كان حقاً أو باطلاً\n إذ { كُلُّ حِزْبٍ بِمَا لَدَيْهِمْ فَرِحُونَ } [المؤمنون: 53] { ثُمَّ إِلَىٰ رَبِّهِمْ مَّرْجِعُهُمْ فَيُنَبِّئُهُمْ بِمَا كَانُواْ يَعْمَلُونَ } [الأنعام: 108] أي: يجازيهم على مقتضى ما عملوا من خير وشر وإيمان وكفر\n\n\n{ وَ } من غاية نفاقهم واستهزائهم معك يا أكمل الرسل وتهكمهم بما جئت به من الآيات { أَقْسَمُواْ بِٱللَّهِ جَهْدَ أَيْمَٰنِهِمْ } أي: مغلظين فيها مؤكدين لها تهكماً { لَئِن جَآءَتْهُمْ آيَةٌ } من مقترحاتهم { لَّيُؤْمِنُنَّ بِهَا } البتة وبك أيضاً { قُلْ } لهم كلاماً خالياً عن وصمة الكذب: { إِنَّمَا ٱلآيَٰتُ } ونزولها وإنزالها { عِندَ ٱللَّهِ } وبقبضة قدرته وليس في وسعي وطاقتي شيء منها { وَمَا يُشْعِرُكُمْ } ويظهر لكم أيها المؤمنون الطالبون لإيمان هؤلاء الكفرة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { ولا تَسُبُّوا } أصنامهم { الذين } يدعونها آلهة، ويخضعون لها { من دون الله } أي: ولا تذكروا آلهتهم بسوء، { فيَسُبوا الله عَدْوًا } أي: ظُلْمًا وتجاوزًا عن الحق إلى الباطل، { بغير علم } أي: على جهالة بالله تعالى، وبما يجب أن يذكر به من التعظيم، رُوِي أنه صلى الله عليه وسلم كان يطعن في آلهتهم، فقالوا: لتنتهين عن آلهتنا أو لنَهجُونَّ إلهك، فنزلت. وقيل: كان المسلمون يسبون آلهتهم، فنُهوا لئلا يكون سبهم سببًا لسب الله تعالى، واستدل المالكية بهذا على سد الذرائع. قال البيضاوي: وفيه دليل على أن الطاعة إذا أدت لمعصية راجحة وجب تركها، فإنَّ ما يُؤدي إلى الشر شر. هـ. وقال ابن العربي: وقاية العرض بترك سنة واجب في الدنيا. هـ. قال تعالى: { كذلك زينَّا لكل أمة عملهم } من الخير والشر، نحملهم على ما سبق لهم توفيقًا أو تخذيلاً، أو يكون مخصوصًا بالشر، أي: زيَّنا لكل أمة من الكفرة عملهم السوء كَسَب الله تعالى وغيره من الكفر، { ثم إلى ربهم مرجعهم فينبئُهم بما كانوا يعملون } من الخير فيُجازيهم عليه، أو من الشر فيعاقبهم عليه. الإشارة: العارف الكامل لا يُنقِص شيئًا من مصنوعات الله، ولا يصغر شيئًا من مقدورات الله، بل يتأدب مع كل شيء لرؤية صنعة الله في كل شيء، وكذلك المريد اللبيب، يتأدب مع كل من ظهر بالخصوصية في زمنه، كان صادقًا أو كاذبًا لئلا يؤدي إلى تنقيص شيخه، حين يذكر غيره بنقص أو غض. وفي الحديث:\n \" لَعَن الله مَن يَسُبُّ والدَيهِ \" \nفقالُوا: وكيف يسبُّ والدَيه يا رسول الله؟ قال\n \" يَسُبُّ أبا الرجُلِ فيسُبُّ الرجلُ أباهُ وأُمه \" \nأو كما قال صلى الله عليه وسلم. ثم ردَّ عليم في اقتراح الآيات، فقال: { وَأَقْسَمُواْ بِٱللَّهِ جَهْدَ أَيْمَانِهِمْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:89",
      "similarity": 0.6616472725645529
    },
    {
      "verse": "18:92",
      "similarity": 0.6616472725645529
    },
    {
      "verse": "18:85",
      "similarity": 0.6493299092563729
    },
    {
      "verse": "18:84",
      "similarity": 0.550612078430915
    },
    {
      "verse": "2:166",
      "similarity": 0.5303206866431163
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/6:108.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/6:108.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:108.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}