{
  "chapter": "الأنعام",
  "text": "ولقد استهزئ برسل من قبلك فحاق بالذين سخروا۟ منهم ما كانوا۟ به يستهزءون",
  "translations": [
    {
      "translation": "Messengers before you were also mocked, but those who jeered were engulfed by what they mocked.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the apostles have been mocked before you; but what they had mocked rebounded on the mockers themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed before your time (O Muhammad!) many a Messenger has been scoffed at; but those who mocked at them were encompassed by the Truth they had scoffed at.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They mocked the Messengers who lived before you (Muhammad), but those who received warnings of punishment and mocked the warnings, all suffered their torments accordingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly, O dear Prophet (Mohammed – peace and blessings be upon him) the Noble Messengers before you have also been mocked at, so those who laughed at them were themselves ruined by their own mocking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed Messengers were mocked before you, but their scoffers were surrounded by the very thing that they used to mock at.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly apostles before you were mocked at, but that which they mocked at encompassed the scoffers among them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messengers indeed were mocked at before thee; but those that scoffed at them were encompassed by that they mocked at.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messengers (of Allah) have been derided before thee, but that whereat they scoffed surrounded such of them as did deride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messengers have been mocked before you, but those who scoffed were overtaken by the very thing they scoffed at.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly mocked were the apostles before thee, wherefore that whereat they scoffed beset these who had been mocking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Apostles were certainly derided before you. Then those who ridiculed them were besieged by what they used to deride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mocked were (many) messengers before thee; but their scoffers were hemmed in by the thing that they mocked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed (many) Messengers were mocked before you, but their scoffers were surrounded by the very thing that they used to mock at.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Other Messengers have been mocked before you. But those who scoffed at them were encompassed by that they had mocked'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Messengers before you were ridiculed, but those who mocked them became besieged by what they ridiculed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And already were messengers ridiculed before you, but those who mocked them were enveloped by that which they used to ridicule.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:10] And messengers were indeed mocked before you — this is meant as a consolation for the Prophet, (s) — but those who scoffed at them were encompassed by that which they mocked, namely, [by the] punishment [sent down on them]: those who mock you will be encompassed likewise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Messengers (of Allah) have been derided before thee) their people derided them as your people are deriding you now, (but that whereat they scoffed surrounded) befell (such of them) of the unbelievers (as did deride) the punishment of their derision.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } لا تغمم ولا تضطرب يا أكمل الرسل من استهزائهم وستخريتهم معك واصبر على أذاهم فإنه { لَقَدِ ٱسْتُهْزِىءَ بِرُسُلٍ مِّن قَبْلِكَ } فصبروا على ما كذبوا واستهزئوا { فَحَاقَ } وأحاط من الجوانب { بِٱلَّذِينَ سَخِرُواْ مِنْهُمْ مَّا كَانُواْ بِهِ يَسْتَهْزِءُونَ } [الأنعام: 10] فأهلكوا واستؤصلوا بما استُهزءوا وإن أنكروا قصة هلاكهم\n\n\nفـ { قُلْ } لهم: { سِيرُواْ فِي ٱلأَرْضِ } أي: مستقر الفراعنة والأكاسرة والقياصرة والخواقين معتبرين { ثُمَّ ٱنْظُرُواْ كَيْفَ كَانَ عَٰقِبَةُ ٱلْمُكَذِّبِينَ } [الأنعام: 11] الذين كذبوا الرسل عتواً وعناداً إلى حيث لم يبق من رسومهم وآثارهم وأظلالهم أصلاً مع أنهم كانوا أولي قوة ذوي بأس شديد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: حاق يَحِيق حَيقًا، أي: نزل وأحاط، و { منهم }: يتعلق بسخروا، و { ما كانوا }: الموصول اسمي أو حرفي. يقول الحق جلّ جلاله: في تسلية رسوله صلى الله عليه وسلم: { ولقد استُهزىء برسل } كثير { من قبلك } فصبروا على أذى قومهم حتى أهلكهم الله، { فحاق } أي: أحاط { بالذين سَخروا منهم ما كانوا به يستهزءون } أي: نزل بهم العذاب الذي كانوا يستهزءون به ويستبعدونه، أو: نزل بهم وبالُ استهزائهم وهو الهلاك. الإشارة: كل ما سُلِّيت به الرسل تسلَّى به الأولياء، فما من ولي صِدِّيق إلا ابتلاه الله بتسليط الخلق عليه حتى ترحلَ رُوحه عن هذا العالم لضِيقه عليها، وتتمكن من شهود عالم الملكوت، فإذا طهرت منه البقايا، وكملت فيه المزايا، ردَّه إليهم غنيًّا عنهم، وغائبًا عنهم، جسمُه مع الخلق وقلبه مع الحق. هذه سُنة الله في أوليائه، فكل وليّ يتسلى بمن قبله في إيذاء الخلق له. غير أن أولياء هذه الأمة إذا كمل مقامهم صاروا على قَدَم نبيهم، يكونون رحمة للعباد، مَن آذاهم لا يُعاجَل بالعقوبة غالبًا، كما كان نبيهم رحمة للعالمين، فقال:\n \" اللهم اغفر لقومي فإنهم لا يعلمون \" \nوالله تعالى اعلم. ثم جدَّد الأمر بالاعتبار، فقال: { قُلْ سِيرُواْ فِي ٱلأَرْضِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:41",
      "similarity": 1.0000000000000002
    },
    {
      "verse": "16:34",
      "similarity": 0.8016226993777044
    },
    {
      "verse": "45:33",
      "similarity": 0.7632281799595378
    },
    {
      "verse": "39:48",
      "similarity": 0.7349769936555967
    },
    {
      "verse": "40:83",
      "similarity": 0.7262971195882226
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/6:10.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/6:10.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/6:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}