{
  "chapter": "الأنعام",
  "text": "ولو شاء الله ما اشركوا۟ وما جعلنك عليهم حفيظا وما انت عليهم بوكيل",
  "translations": [
    {
      "translation": "If Allah had willed, they would not have associated anything with Him. We did not appoint you over them as their keeper and you are not set over them as their guardian.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had He willed they would not have been idolaters. We have not appointed you their guardian, nor are you their pleader.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah so willed they would not have associated others with Him in His divinity; and We have not appointed you a watcher over them, and you are not their guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God wanted, they would not consider anything equal to Him. God has not appointed you to watch over them nor are you their guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah willed, they would not ascribe (any partner to Him); We have not made you as a guardian over them; and you are not responsible for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah willed, they would not have taken others besides Him in worship. And We have not made you Hafiz over them nor are you set over them to dispose of their affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah had pleased, they would not have set up others (with Him) and We have not appointed you a keeper over them, and you are not placed in charge of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God willed, they were not idolaters; and We have not appointed thee a watcher over them, neither art thou their guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah willed, they had not been idolatrous. We have not set thee as a keeper over them, nor art thou responsible for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God had willed, they would not have associated anything with Him. We did not appoint you over them as their keeper, nor are you their guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had Allah willed, they had not associated. And We have not made thee a guardian over them nor art thou unto them a trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah wished they would not have ascribed partners [to Him]. We have not made you a caretaker for them, nor is it your duty to watch over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If it had been Allah's plan, they would not have taken false gods: but We made thee not one to watch over their doings, nor art thou set over them to dispose of their affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah willed, they would not have taken others besides Him in worship. And We have not made you a watcher over them nor are you set over them to dispose of their affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had Allah willed, they would not have associated. We have not made you an overseer for them, nor are you their guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had God willed, they would not have practiced idolatry. We did not appoint you as a guardian over them, and you are not a manager over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if Allah had willed, they would not have associated. And We have not appointed you over them as a guardian, nor are you a manager over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:107] Had God willed, they would not have been idolaters; and We have not set you as a keeper over them, a watcher, so that you might then requite them for their deeds; nor are you a guardian over them, so that you might [be able to] coerce them to faith — this was [revealed] before the command to fight [them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله : { ولو شاء الله ما أشركوا } عطف على جملة { وأعرض عن المشركين }.وهذا تلطّف مع الرّسول صلى الله عليه وسلم وإزالة لما يلقاه من الكَدَر من استمرارهم على الشّرك وقلّة إغناء آيات القرآن ونُذُره في قلوبهم ، فذكّره الله بأنّ الله قادر على أن يحوّل قلوبهم فتقبَل الإسلام بتكوين آخر ولكنّ الله أراد أن يحصل الإيمانُ ممّن يؤمن بالأسباب المعتادة في الإرشاد والاهتداء ليَميز الله الخبيثَ من الطيّب وتَظهرَ مراتب النّفوس في ميادين التلقّي ، فأراد الله أن تختلف النّفوس في الخير والشّر اختلافاً ناشئاً عن اختلاف كيفيّات الخِلقة والخُلُق والنّشأة والقبوللِ ، وعن مراتب اتّصال العباد بخالقهم ورجائهم منه . فالمشركون بلغوا إلى حَضِيض الشّرك بأسباب ووسائلَ متسلسلة مترتّبة خَلْقية ، وخُلُقيّة ، واجتماعيّة ، تهيأت في أزمنة وأحوال هيّأتْها لهم ، فلمّا بَعَث الله إليهم المرشد كان إصغاؤهم إلى إرشاده متفاوتاً على تفاوت صلابة عقولهم في الضّلال وعراقتهم فيه ، وعلى تفاوت إعداد نفوسهم للخير وجموحهم عنه ، ولم يجعل الله إيمان النّاس حاصلاً بخوارق العادات ولا بتبديل خَلْق العقول ، وهذا هو القانون في معنى مثل هذه الآية ، فهذا معنى انتفاء مشيئة الله في هذا المقام المراد به تطمين قلب الرّسول عليه الصّلاة والسّلام وتذكيره بحقائق الأحوال وليس في مثل هذا عذر لهم ولا لأمثالهم من العصاة ، ولذلك ردّ الله عليهم الاعتذار بمثل هذا في قوله في الآية الآتية { سيقول الّذين أشركوا لو شاءَ الله ما أشْرَكْنا ولا آباؤنا ولا حَرّمنَا من شيء كذلك كذّب الّذين من قبلهم حتّى ذاقوا بأسنا قل هل عندكم من علم فتخرجوه لنا } \\[ الأنعام : 148 \\] الآية . وفي قوله : { وقالوا لو شاء الرّحمان ما عَبدْناهم ما لهم بذلك من علم إنْ هم إلاّ يخرصون } \\[ الزخرف : 20 \\] في سورة الزخرف ، لأنّ هذه حقيقة كاشفة عن الواقع لا تصلح عذراً لمن طلب منهم أن لا يكونوا في عِداد الّذين لم يشأ الله أن يرشدهم ، قال تعالى : { أولئك الّذين لم يرد الله أن يطهّر قلوبهم } \\[ المائدة : 41 \\].ومفعول المشيئة محذوف دلّ عليه جواب ( لو ) على الطّريقة المعروفة . والتّقدير : ولو شاء الله عدمَ إشراكهم ما أشركوا . وتقدّم عند قوله تعالى : { ولو شاء الله لجمعهم على الهدى } في هذه السّورة \\[ 35 \\].وقوله : { وما جعلناك عليهم حفيظاً } تذكير وتسلية ليزيح عنه كرب إعراضهم عن الإسلام لأنّ ما يحصل له من الكدر لإعراض قومه عن الإسلام يجعل في نفسه انكساراً كأنّه انكسار من عُهد إليه بعمل فلم يتسَنَّ له ما يريده من حسن القيام ، فذكّره الله تعالى بأنّه قد أدّى الأمانة وبلّغ الرّسالة وأنّه لم يبعثه مُكرهاً لهم ليأتي بهم مسلمين ، وإنّما بعثه مبلّغاً لرسالته فمن آمن فلنفسه ومن كفر فعليها .والحفيظ : القيّم الرّقيب ، أي لم نجعلك رقيباً على تحصيل إيمانهم فلا يهمّنك إعراضهم عنك وعدم تحصيل ما دعوتَهم إليه إذ لا تَبِعة عليك في ذلك ، فالخبر مسوق مساق التّذكير والتسلية ، لا مساقَ الإفادة لأنّ الرّسول عليه الصّلاة والسّلام يعلم أنّ الله ما جعله حفيظاً على تحصيل إسلامهم إذ لا يجهل الرّسولُ ما كلّف به .وكذلك قوله : { وما أنت عليهم بوكيل } تهوين على نفس الرّسول عليه الصّلاة والسّلام بطريقة التّذكير لينتفي عنه الغمّ الحاصل له من عدم إيمانهم . فإن أريد ما أنت بوكيل مِنَّا عليهم كان تتميماً لقوله : { وما جعلناك عليهم حفيظاً } ؛ وإنْ أريد ما أنتَ بوكيل منهم على تحصيل نفعهم كان استيعاباً لنفي أسباب التّبعة عنه في عدم إيمانهم ، يقول : ما أنت بوكيل عليهم وكّلوك لتحصيل منافعهم كإيفاء الوكيل بما وكّله عليه موكّله ، أي فلا تَبِعة عليك منهم ولا تقصير لانتفاء سببي التّقصير إذ ليس مقامك مقام حفيظ ولا وكيل . فالخبر أيضاً مستعمل في التّذكير بلازمه لا في حقيقته من إفادة المخبر به ، وعلى كلا المعنيين لا بدّ من تقدير مضاف في قوله : { عليهم } ، أي على نفعهم .والجمع بين الحفيظ والوكيل هنا في خبرين يؤيّد ما قلناه آنفاً في قوله تعالى : { وما أنا عليكم بحفيظ } \\[ الأنعام : 104 \\]. من الفرق بين الوكيل والحفيظ فاذْكُره .\n\n",
      "translations": [
        {
          "translation": "(Had Allah willed) that they did not ascribe partners to Allah, (they had not been idolatrous). We have not set you as a keeper over them) to protect them, (nor art thou responsible for them) nor are you their custodian.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَوْ شَآءَ ٱللَّهُ } الهادي لعباده عدم إشراكهم { مَآ أَشْرَكُواْ وَمَا جَعَلْنَاكَ عَلَيْهِمْ حَفِيظاً } مصرفاً بل مبلغاً منبهاً { وَمَآ أَنتَ } أيضاً { عَلَيْهِم بِوَكِيلٍ } [الأنعام: 107] تشفع لهم وتقوم بأمرهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولو شاء الله ما أشركوا }: لكن سبقت مشيئته بإشراكهم\n ولو أراد إيمانهم لآمنوا\n وهو حجة على المعتزلة\n { وما جعلناك عليهم حفيظًا }: رقيبًا\n { وما أنت عليهم بوكيل } تقوم بأمرهم\n وتُلجئهم إلى الإيمان\n[فَاطِر:23]\n الإشارة: الإعراض عن الخلق والاكتفاء بالملك الحق ركن من أركان الطريق\n قال الشيخ زروق رضي الله عنه: أصول الطريقة خمسة أشياء: تقوى الله في السر والعلانية\n واتباع الرسول في الأقوال والأفعال\n والإعراض عن الخلق في الإقبال والإدبار\n والرجوع إلى الله في السراء والضراء\n والرضا عن الله في القليل والكثير\n هـ\n ثم نهى عن التعرّض لأصنامهم\n فقال: { وَلاَ تَسُبُّواْ ٱلَّذِينَ يَدْعُونَ مِن دُونِ ٱللَّهِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:6",
      "similarity": 0.710407843794529
    },
    {
      "verse": "82:10",
      "similarity": 0.5766093999162105
    },
    {
      "verse": "83:33",
      "similarity": 0.5758363524278153
    },
    {
      "verse": "15:9",
      "similarity": 0.5147278455949841
    },
    {
      "verse": "23:9",
      "similarity": 0.5111986565947791
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006107.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006107.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:107.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}