{
  "chapter": "الأنعام",
  "text": "قل سيروا۟ فى الارض ثم انظروا۟ كيف كان عقبة المكذبين",
  "translations": [
    {
      "translation": "Say: 'Travel about the earth and see the final fate of the deniers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Travel in the land and see what happened to those who disbelieved.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Go about journeying the earth, and behold the end of those who gave the lie (to the Truth).'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them to travel in the land and see what happened to those who rejected the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim, “Travel in the land, and see what sort of fate befell those who denied.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Travel in the land and see what was the end of those who rejected truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Travel in the land, then see what was the end of the rejecters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Journey in the land, then behold how was the end of them that cried lies.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (unto the disbelievers): Travel in the land, and see the nature of the consequence for the rejecters!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Travel about the land and see what was the end of the deniers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: go about in the earth and then see what wise hath been the end of the beliers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Travel over the land, and then observe how was the fate of the deniers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Travel through the earth and see what was the end of those who rejected Truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Travel in the land and see what was the end of those who rejected truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Travel the land and see what was the fate of those who belied'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Travel the earth and observe the final fate of the deniers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Travel through the land; then observe how was the end of the deniers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:11] Say, to them: ‘Travel in the land, and see the nature of the consequence for the deniers’, of the messengers, how they were destroyed through chastisement; perhaps they will take heed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذه الجملة وزانها وزان البيان لمضمون الجملة التي قبلها ولذلك فصلت ، فإنّ الجملة التي قبلها تخبر بأنّ الذين استهزأوا بالرسل قد حاق بهم عواقب استهزائهم ، وهذه تّحدوهم إلى مشاهدة ديار أولئك المستهزئين . وليس افتتاح هذه الجملة بخطاب النبي صلى الله عليه وسلم منافياً لكونها بياناً لأنّه خوطب بأن يقول ذلك البيان . فالمقصودُ ما بعد القول .وافتتاحها بالأمر بالقول لأنّها واردة مورد المحاورة على قولهم { لولا أنزل عليه ملك } \\[ الأنعام : 1 \\].وهذه سلسلة ردود وأجوبة على مقالتهم المحكية آنفاً لتضمّنها التصميم على الشرك وتكذيب الرسالة ، فكانت منحلّة إلى شبه كثيرة أريد ردّها وتفنيدها فكانت هاته الردود كلّها مفتتحة بكلمة { قل } ) عشر مرات .و { ثم } للتراخي الرتبي ، كما هو شأنها في عطف الجمل ، فإنّ النظر في عاقبة المكذّبين هو المقصد من السير ، فهو ممّا يُرتقى إليه بعد الأمر بالسير ، ولأنّ هذا النظر محتاج إلى تأمّل وترسّم فهو أهمّ من السير .والنظر يحتمل أن يكون بصرياً وأن يكون قلبياً ، وعلى الاحتماليين فقد علّقه الاستفهام عن نصب مفعوله أو مفعوليه . و { كيف } خبر لِ { كان } مقدّم عليها وجوباً .والعاقبة آخر الشيء ومآله وما يعقبه من مسبّباته . ويقال : عاقبة وعقبى ، وهي اسم كالعافية والخاتمة .وإنّما وصفوا بِ { المكذّبين } دون المستهزئين للدلالة على أنّ التكذيب والاستهزاء كانا خلقين من أخُلاقهم ، وأنّ الواحد من هذين الخلقين كاف في استحقاق تلك العاقبة ، إذ قال في الآية السابقة { فحاق بالذين سخروا منهم ما كانوا به يستهزئون } \\[ الأنعام : 10 \\] وقال في هذه الآية { كيف كان عاقبة المكذّبين }.وهذا ردّ جامع لدحض ضلالاتهم الجارية على سنن ضلالات نظرائهم من الأمم السالفة المكذّبين .\n\n",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the people of Mecca: (Travel in the land, and see) and reflect upon (the nature of the consequence for the rejecters!) what happened to those who denied Allah and His messengers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: قال الزمخشري: فإن قلت: أيُّ فرق بين قوله: { فانظروا } ، وبين قوله: { ثم انظروا }؟ فالجواب: أنه جعل النظر مسبَّبًا على السير في قوله: { فانظروا } ، كأنه قال: سيروا لأجل النظر، وأما قوله: { قل سيروا في الأرض ثم انظروا } ، فمعناه: إباحة السير للتجارة وغيرها من المنافع، وإيجاب النظر في الهالكين. هـ. ولم يقل: كانت لأن العاقبة مُجَاز تأنيثُها. يقول الحقّ جلّ جلاله: { قل } لهم: { سيروا في الأرض } وجُولوا في أقطارها، { ثم انظروا كيف كان عاقبة المكذبين } قبلكم، كعاد وثمود وقوم لوط وأصحاب مَديَن، كيف أهلكهم الله بعذاب الاستئصال، كي تعتبروا وتنزجروا عن تكذيب محمد ـ عليه الصلاة والسلام ـ. الإشارة: يقال لأهل التنكير على أهل الذكر والتذكير: سِيروا في الأرض، وانظروا كيف كان عاقبة المنكرين على المتوجهين، كانت عاقبتهم الخذلان، وسوء الذكر بعد الموت والخسران كابن البراء وغيره من أهل التنكير. نعوذ بالله من التعرّض لمقت الله. لكن الأَمر كله بيد الله، كما قال تعالى: { قُل لِّمَن مَّا فِي ٱلسَّمَاوَاتِ وَٱلأَرْضِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:69",
      "similarity": 0.8727997429422241
    },
    {
      "verse": "30:42",
      "similarity": 0.8608218937168755
    },
    {
      "verse": "3:137",
      "similarity": 0.5919521659959578
    },
    {
      "verse": "16:36",
      "similarity": 0.5864977448143615
    },
    {
      "verse": "35:44",
      "similarity": 0.5839330218196671
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006011.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006011.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:11.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}