{
  "chapter": "الأنعام",
  "text": "افغير الله ابتغى حكما وهو الذى انزل اليكم الكتب مفصلا والذين ءاتينهم الكتب يعلمون انه منزل من ربك بالحق فلا تكونن من الممترين",
  "translations": [
    {
      "translation": "'Am I to desire someone other than Allah as a judge when it is He who has sent down the Book to you clarifying everything?' Those We have given the Book know it has been sent down from your Lord with truth, so on no account be among the doubters.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Say): \"Then should I seek (the source of) law elsewhere than God, when it is He who has revealed this Book to you, which distinctly explains (everything)?\" Those to whom We have given the Book know it has been sent by your Lord in truth. So be not a sceptic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall I look upon anyone apart from Allah for judgement when it is He Who has revealed to you the Book in detail? And those whom We gave the Book (before you) know that this (Book) has been revealed in truth by your Lord. Do not, then, be among the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"Should I seek any judge other than God? It is He Who has revealed this Book (Quran) to you with all its intricate details.\" Those to whom We have given the Bible know that the Quran has been revealed to you from your Lord in all Truth. Thus, you (people) must have no doubts about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“So shall I seek the command other than that of Allah, whereas it is He Who has sent down the detailed Book towards you?” And those whom We gave the Book know that this is the truth sent down from your Lord, so O listener, (followers of this Prophet) do not ever be of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Say:] \"Shall I seek a judge other than Allah while it is He Who has sent down unto you the Book, explained in detail.\" Those unto whom We gave the Scripture know that it is revealed from your Lord in truth. So be not you of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall I then seek a judge other than Allah? And He it is Who has revealed to you the Book (which is) made plain; and those whom We have given the Book know that it is revealed by your Lord with truth, therefore you should not be of the disputers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, shall I seek after any judge but God? For it is He who sent down to you the Book well-distinguished; and those whom We have given the Book know it is sent down from thy Lord with the truth; so be not thou of the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall I seek other than Allah for judge, when He it is Who hath revealed unto you (this) Scripture, fully explained? Those unto whom We gave the Scripture (aforetime) know that it is revealed from thy Lord in truth. So be not thou (O Muhammad) of the waverers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should I seek a judge other than God, when it is He who has revealed the Book, clearly explained. Those to whom We gave the Book earlier know that it is the truth revealed by your Lord. Therefore, have no doubts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: shall I then seek as judge other than Allah, when it is He who hath sent down toward you the Book detailed? And those whom We vouchsafed the book know that it hath been revealed by thy Lord in truth; so be thou not of the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Say,] ‘Shall I seek a judge other than Allah, while it is He who has sent down to you the Book, well-elaborated?’ Those whom We have given the Book know that it has been sent down from your Lord with the truth; so do not be one of the skeptics.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Shall I seek for judge other than Allah? - when He it is Who hath sent unto you the Book, explained in detail.\" They know full well, to whom We have given the Book, that it hath been sent down from thy Lord in truth. Never be then of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Say (O Muhammad SAW)] \"Shall I seek a judge other than Allah while it is He Who has sent down unto you the Book (The Quran), explained in detail.\" Those unto whom We gave the Scripture [the Taurat (Torah) and the Injeel (Gospel)] know that it is revealed from your Lord in truth. So be not you of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should I seek a judge other than Allah when it is He who has sent down the well distinguished Book for you? Those to whom We have given the Book know that it is the truth sent down from your Lord, so do not be among the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Shall I seek a judge other than God, when He is the One who revealed to you the Book, explained in detail?” Those to whom We gave the Book know that it is the truth revealed from your Lord. So do not be of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Say], \"Then is it other than Allah I should seek as judge while it is He who has revealed to you the Book explained in detail?\" And those to whom We [previously] gave the Scripture know that it is sent down from your Lord in truth, so never be among the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:114] The following was revealed when they asked the Prophet (s) to appoint an arbiter between him and themselves. Say: Shall I seek, demand, other than God as a judge, an arbiter between you and me, when it is He Who revealed to you the Book, the Qur’ān, clearly explained?, wherein truth is distinguished from falsehood. Those to whom We have given the Scripture, the Torah, the likes of ‘Abd Allāh b. Salām and his companions, know that it is revealed (read munzal or munazzal) from your Lord in truth; so do not be of the waverers, the doubters, regarding it: this is intended to affirm to the disbelievers that it is the truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then, say to them, Muhammad: (Shall I seek other than Allah for judge) shall I worship as Lord other than Allah, (when He it is who has revealed unto you) you are your prophet ((this) Scripture) this Qur'an through the intermediary of Gabriel, (fully explained?) explaining fully the lawful and the unlawful; it is also said: it is revealed in instalments, a few verses on each occasion. (Those unto whom We gave the Scripture) those to whom We have given knowledge of the Torah, i.e. 'Abdullah Ibn Salam and his followers (know) are certain on the basis of their Scripture (that it) i.e. the Qur'an (is revealed from thy Lord in truth) with commands and prohibitions; it is also said that this means: Gabriel is sent by your Lord with the Truth, i.e. with the Qur'an. (So be not thou (0 Muhammad) of the waverers) of those who doubt that they might not know this.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقل لهم إن أرادوا أن يتصالحوا ويتحاكموا معك بعدما ظهر لك تنسيبهم وتغريرهم إنكاراً عليهم: { أَفَغَيْرَ ٱللَّهِ } المستقل بالحكومة والتصرف { أَبْتَغِي } أطلب { حَكَماً } عادلاً يفصل بيني وبينكم أيها المعاندون المكابرون { وَ } الحال أنة { هُوَ ٱلَّذِيۤ أَنَزَلَ إِلَيْكُمُ ٱلْكِتَابَ مُفَصَّلاً } مبيناً موضحاً مغنياً عن التحاكم والترافع { وَٱلَّذِينَ آتَيْنَاهُمُ ٱلْكِتَابَ } أي: علمه إن أنصفوا، ولم يعاندوا ولم يكابروا { يَعْلَمُونَ } يقيناً بشهادة كتبهم { أَنَّهُ } أي: القرآن { مُنَزَّلٌ مِّن رَّبِّكَ } ملتبساً { بِٱلْحَقِّ } بلا ميل إلى الباطل أصلاً { فَلاَ تَكُونَنَّ } يا أكمل الرسل { مِنَ ٱلْمُمْتَرِينَ } [الأنعام: 114] في أنهم عالمون بحقية القرآن وموافقته لكتبهم، إلا أنهم يكابرون في تحريف كتبهم، ويعاندون بادعاء تكذيب القرآن ظلماً وعدواناً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { غير }: مفعول، و { حَكَمًا }: حال، وهو أبلغ من حاكم، ولذلك لا يوصف به غير العادل، و { صدقًا وعدلاً }: تمييز، أو حال، أو مفعول به\n يقول الحقّ جلّ جلاله: قل يا محمد: { أفغير الله } أطلبُ { حَكَمًا } يحكم بيني وبينكم، ويفصل المحق مِنَّا من المبطل، { وهو الذي أنزل إليكم الكتاب } أي: القرآن المعجز، { مُفصَّلاً } مُبينًا قد بيّن فيه الحق من الباطل، بحيث انتفى به الالتباس، فهو الحاكم بيني وبينكم، فلا أطلب حاكمًا غيره، وفيه تنبيه على أن القرآن بإعجازه مُغنٍ عن سائر الآيات\n { والذين آتيناهم الكتاب } كأحبار اليهود، { يعلمون أنه منزل من ربك بالحق } لتصديقه ما عندهم، وموافقته له في كثير من الأخبار، { فلا تكونن من الممترين } في أنهم يعلمون ذلك، أو في أنه منزل من ربك، والمراد غيره ـ عليه الصلاة والسلام ـ ممن يطرقه ارتياب، والمعنى: أن الأدلة تعاضدت على صحته، فلا ينبغي لأحد أن يمتري فيه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:147",
      "similarity": 0.6687810327838002
    },
    {
      "verse": "3:60",
      "similarity": 0.6324273942095713
    },
    {
      "verse": "53:12",
      "similarity": 0.5798180397030906
    },
    {
      "verse": "44:50",
      "similarity": 0.5723927671814691
    },
    {
      "verse": "15:63",
      "similarity": 0.5441625808859133
    }
  ]
}