{
  "chapter": "الأنعام",
  "text": "افغير الله ابتغى حكما وهو الذى انزل اليكم الكتب مفصلا والذين ءاتينهم الكتب يعلمون انه منزل من ربك بالحق فلا تكونن من الممترين",
  "translations": [
    {
      "translation": "'Am I to desire someone other than Allah as a judge when it is He who has sent down the Book to you clarifying everything?' Those We have given the Book know it has been sent down from your Lord with truth, so on no account be among the doubters.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Say): \"Then should I seek (the source of) law elsewhere than God, when it is He who has revealed this Book to you, which distinctly explains (everything)?\" Those to whom We have given the Book know it has been sent by your Lord in truth. So be not a sceptic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall I look upon anyone apart from Allah for judgement when it is He Who has revealed to you the Book in detail? And those whom We gave the Book (before you) know that this (Book) has been revealed in truth by your Lord. Do not, then, be among the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"Should I seek any judge other than God? It is He Who has revealed this Book (Quran) to you with all its intricate details.\" Those to whom We have given the Bible know that the Quran has been revealed to you from your Lord in all Truth. Thus, you (people) must have no doubts about it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“So shall I seek the command other than that of Allah, whereas it is He Who has sent down the detailed Book towards you?” And those whom We gave the Book know that this is the truth sent down from your Lord, so O listener, (followers of this Prophet) do not ever be of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Say:] \"Shall I seek a judge other than Allah while it is He Who has sent down unto you the Book, explained in detail.\" Those unto whom We gave the Scripture know that it is revealed from your Lord in truth. So be not you of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall I then seek a judge other than Allah? And He it is Who has revealed to you the Book (which is) made plain; and those whom We have given the Book know that it is revealed by your Lord with truth, therefore you should not be of the disputers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, shall I seek after any judge but God? For it is He who sent down to you the Book well-distinguished; and those whom We have given the Book know it is sent down from thy Lord with the truth; so be not thou of the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Shall I seek other than Allah for judge, when He it is Who hath revealed unto you (this) Scripture, fully explained? Those unto whom We gave the Scripture (aforetime) know that it is revealed from thy Lord in truth. So be not thou (O Muhammad) of the waverers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should I seek a judge other than God, when it is He who has revealed the Book, clearly explained. Those to whom We gave the Book earlier know that it is the truth revealed by your Lord. Therefore, have no doubts.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: shall I then seek as judge other than Allah, when it is He who hath sent down toward you the Book detailed? And those whom We vouchsafed the book know that it hath been revealed by thy Lord in truth; so be thou not of the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Say,] ‘Shall I seek a judge other than Allah, while it is He who has sent down to you the Book, well-elaborated?’ Those whom We have given the Book know that it has been sent down from your Lord with the truth; so do not be one of the skeptics.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Shall I seek for judge other than Allah? - when He it is Who hath sent unto you the Book, explained in detail.\" They know full well, to whom We have given the Book, that it hath been sent down from thy Lord in truth. Never be then of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Say (O Muhammad SAW)] \"Shall I seek a judge other than Allah while it is He Who has sent down unto you the Book (The Quran), explained in detail.\" Those unto whom We gave the Scripture [the Taurat (Torah) and the Injeel (Gospel)] know that it is revealed from your Lord in truth. So be not you of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should I seek a judge other than Allah when it is He who has sent down the well distinguished Book for you? Those to whom We have given the Book know that it is the truth sent down from your Lord, so do not be among the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Shall I seek a judge other than God, when He is the One who revealed to you the Book, explained in detail?” Those to whom We gave the Book know that it is the truth revealed from your Lord. So do not be of those who doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Say], \"Then is it other than Allah I should seek as judge while it is He who has revealed to you the Book explained in detail?\" And those to whom We [previously] gave the Scripture know that it is sent down from your Lord in truth, so never be among the doubters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:114] The following was revealed when they asked the Prophet (s) to appoint an arbiter between him and themselves. Say: Shall I seek, demand, other than God as a judge, an arbiter between you and me, when it is He Who revealed to you the Book, the Qur’ān, clearly explained?, wherein truth is distinguished from falsehood. Those to whom We have given the Scripture, the Torah, the likes of ‘Abd Allāh b. Salām and his companions, know that it is revealed (read munzal or munazzal) from your Lord in truth; so do not be of the waverers, the doubters, regarding it: this is intended to affirm to the disbelievers that it is the truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف بخطاب من الله تعالى إلى رسوله صلى الله عليه وسلم بتقدير الأمر بالقول بقرينة السّياق كما في قوله تعالى : { لا نفرّق بين أحد من رسله } \\[ البقرة : 285 \\] أي يقولون . وقوله المتقدّم آنفاً { قد جاءكم بصائر من ربكم } \\[ الأنعام : 104 \\] بعد أن أخبره عن تصاريف عناد المشركين ، وتكذيبهم . وتعنّتهم في طلب الآيات الخوارق ، إذ جعلوها حكَماً بينهم وبين الرّسول عليه الصلاة والسلام في صدق دعوته ، وبعد أن فضحهم الله بعداوتهم لرسوله عليه الصلاة والسلام ، وافترائهم عليه ، وأمر رسوله صلى الله عليه وسلم بالإعراض عنهم وتركِهم وما يفترون ، وأعلمَه بأنَّه ما كلَّفه أن يكون وكيلاً لإيمانهم ، وبأنَّهم سيَرجعون إلى ربّهم فينبّئهم بما كانوا يعملون ، بعد ذلك كلّه لَقَّن الله رسوله صلى الله عليه وسلم أن يخاطبهم خطاباً كالجواب عن أقوالهم وتورّكاتهم ، فيفرّع عليها أنّه لا يطلب حاكماً بينه وبينهم غير الله تعالى ، الّذي إليه مرجعهم ، وأنهم إن طمعوا في غير ذلك منه فقد طمعوا منكراً ، فتقدير القول متعيّن لأنّ الكلام لا يناسب إلاّ أن يكون من قول النبي عليه الصلاة والسلام .والفاء لتفريع الجواب عن مجموع أقوالهم ومقتَرحاتهم ، فهو من عطف التّلقين بالفاء : كما جاء بالواو في قوله تعالى : { قال إنّي جاعلك للنّاس إماماً قال ومن ذريّتي } \\[ البقرة : 124 \\] ، ومنه بالفاء قوله في سورة الزمر ( 64 ) : { قل أفغيرَ اللَّه تأمرونيَ أعْبُد أيّها الجاهلون } فكأنّ المشركين دعوا النّبي إلى التّحاكم في شأن نبوءته بحكم ما اقترحوا عليه من الآيات ، فأجابهم بأنّه لا يضع دِين الله للتّحاكم ، ولذلك وقع الإنكار أن يحكِّم غير الله تعالى ، مع أنّ حكم الله ظاهر بإنزال الكتاب مفصّلا بالحقّ ، وبشهادة أهل الكتاب في نفوسهم ، ومن موجبات التّقديم كون المقدّم يتضمّن جواباً لردّ طلب طلبَه المخاطب ، كما أشار إليه صاحب الكشاف } في قوله تعالى : { قل أغير الله أبغي رباً في هذه السورة } \\[ الأنعام : 164 \\]. والهمزة للاستفهام الإنكاري : أي إن ظننتم ذلك فقد ظننتم مُنكراً .وتقديم { أفغير الله } على { أبتغي } لأنّ المفعول هو محلّ الإنكار . فهو الحقيق بموالاة همزة الاستفهام الإنكاري ، كما تقدّم في قوله تعالى : { قل أغير الله أتَّخذ وليّا } في هذه السورة ( 14 ).والحَكَم : الحاكم المتخصّص بالحكم الَّذي لا ينقض حكمه ، فهو أخصّ من الحاكم ، ولذلك كان من أسمائه تعالى : الحَكَم ، ولم يكن منها : الحاكم . وانتصب حكما على الحال .والمعنى : لا أطلب حكَماً بيني وبينكم غير الله الّذي حكم حُكمَه عليكم بأنَّكم أعداء مقترفون .وتقدّم الكلام على الابتغاء عند قوله تعالى : { أفغيرَ دين الله يبغون } في سورة آل عمران ( 83 ).وقوله : وهو الذي أنزل إليكم الكتاب مفصلاً } من تمام القول المأمور به . والواو للحال أي لا أعدل عن التّحاكم إليه . وقد فصّل حكمه بإنزال القرآن إليكم لتتدبّروه فتعلَموا منه صدقي ، وأنّ القرآن من عند الله .وقد صيغت جملة الحال على الاسميّة المعرَّفةِ الجزأيْن لتفيد القصر مع إفادة أصل الخبر . فالمعنى : والحال أنّه أنزل إليكم الكتاب ولم ينزله غيره ، ونكتة ذلك أنّ في القرآن دلالة على أنّه من عند الله بما فيه من الإعجاز ، وبأُمِّيَّةِ المنزّل عليه . وأنّ فيه دلالة على صدق الرّسول عليه الصلاة والسلام تبعاً لثبوت كونه منزّلا من عند الله ، فإنَّه قد أخبر أنَّه أرسل محمّدا صلى الله عليه وسلم للنّاس كافَّة ، وفي تضاعيف حجج القرآن وأخباره دلالة على صدق من جاء به؛ فحصل بصوغ جملة الحال على صيغة القصر الدّلالة على الأمرين : أنَّه من عند الله ، والحكممِ للرسول عليه الصّلاة والسّلام بالصّدق .والمراد بالكتاب القرآن ، والتعريف للعهد الحضوري ، والضمير في { إليكم } خطاب للمشركين ، فإنّ القرآن أُنزل إلى النّاس كلّهم للاهتداء به ، فكما قال الله : { بما أنزل إليك أنزله بعلمه } \\[ النساء : 166 \\] قال : { يأيُّها النّاس قد جاءكم بُرْهان من ربّكم وأنزلنا إليكم نوراً مبيناً } \\[ النساء : 174 \\] وفي قوله : { إليكم } هنا تسجيل عليهم بأنَّه قد بلّغهم فلا يستطيعون تجاهلاً .والمفصّل المبيَّن . وقد تقدّم ذكر التّفصيل عند قوله تعالى : { وكذلك نفصّل الآيات ولتستبين سبيل المجرمين } في هذه السورة ( 55 ).وجملة والذين أتيناهم الكتاب يعلمون أنه منزل } معطوفة على القول المحذوف ، فتكون استئنافاً مثله ، أو معطوفة على جملة { أفغير الله أبتغى } أو على جملة { وهو الذي أنزل إليكم الكتاب } ، فهو عطف تلقين عُطف به الكلام المنسوب إلى الله على الكلام المنسوب إلى النبي صلى الله عليه وسلم تعضيدا لما اشتمل عليه الكلام المنسوب إلى النبي صلى الله عليه وسلم من كون القرآن حقّاً ، وأنّه من عند الله .والمراد بالَّذين آتاهم الله الكتابَ : أحبار اليهود ، لأنّ الكتاب هو التّوراة المعروف عند عامّة العرب ، وخاصّة أهلُ مكَّة ، لتردّد اليهود عليها في التّجارة . ولتردّد أهل مكّة على منازل اليهود بيَثرب وقُراها ولكون المقصود بهذا الحكم أحبارَ اليهود خاصّة قال : { آتيناهم الكتاب } ولم يقل : أهلُ الكتاب .ومعنى علم الّذين أوتوا الكتاب بأنّ القرآن منزّل من الله : أنَّهم يجدونه مصدّقاً لما في كتابهم ، وهم يعلمون أنّ محمّداً صلى الله عليه وسلم لم يَدرس كتابهم على أحد منهم ، إذ لو درسه لشاع أمْرُه بينهم ، ولأعلنوا ذلك بين النّاس حين ظهور دعوته . وهم أحرص على ذلك ، ولم يَدّعوه . وعلمُهم بذلك لا يقتضي إسلامهم لأنّ العناد والحسد يصدّانهم عن ذلك . وقيل : المراد بالَّذين آتاهم الله الكتاب : مَن أسلموا من أحبار اليهود . مثل عبدا لله بن سلاَم . ومُخَيْرِيق ، فيكون الموصول في قوله : { والذين آتيناهم الكتاب } للعهد . وعن عطاء : { والذين آتيناهم الكتاب }.هم رؤساء أصحاب محمّد صلى الله عليه وسلم أبو بكر ، وعُمر ، وعثمانُ ، وعليّ . فيكون الكتابُ هو القرآن .وضمير { أنَّه } عائد إلى الكتاب الّذي في قوله : { وهو الذي أنزل إليكم الكتاب } وهو القرآن .والباء في قوله { بالحق } للملابسة ، أي ملابساً للحقّ . وهي ملابسة الدّالّ للمدلول ، لأنّ معانيه ، وأخباره ، ووعده ، ووعيده ، وكلّ ما اشتمل عليه ، حقّ .وقرأ الجمهور { مُنْزَل } بتخفيف الزاي وقرأ ابن عامر وحفص بالتّشديد والمعنى متقارب أو متّحد ، كما تقدّم في قوله تعالى : { نزّل عليك الكتاب بالحقّ } في أوّل سورة آل عمران ( 3 ).والخطاب في قوله : { فلا تكوننّ من الممترين } \\[ البقرة : 147 \\] يحتمل أن يكون خطاباً للنبيء صلى الله عليه وسلم فيكون التّفريع على قوله : { يعلمون أنه منزل من ربك بالحق } أي فلا تكن من الممترين في أنَّهم يعلمون ذلك ، والمقصود تأكيد الخبر كقول القائل بعد الخبر : هذا مَا لا شكّ فيه ، فالامتراء المنفي هو الامتراء في أنّ أهل الكتاب يعلمون ذلك ، لأنّ غريباً اجتماعُ علمهم وكفرهم به ، ويجوز أن يكون خطابا لغير معيّن ، ليعمّ كلّ من يحتاج إلى مثل هذا الخطاب ، أي فلا تكوننّ أيُّها السّامع من الممترين ، أي الشّاكين في كون القرآن من عند الله ، فيكون التّفريع على قوله : { منزل من ربك بالحق } أي فهذا أمر قد اتّضح . فلا تكن من الممترين فيه . ويحتمل أن يكون المخاطب الرّسول عليه الصلاة والسلام ، والمقصود من الكلام المشركون الممترون ، على طريقة التّعريض ، كما يقال : ( إياكَ أعني واسمعي يا جارهْ ). ومنه قوله تعالى : { ولقد أوحي إليك وإلى الذين من قبلك لئن أشركت ليحبطنّ عملك } \\[ الزمر : 65 \\]. وهذا الوجه هو أحسن الوجوه ، والتفريع فيه كما في الوجه الثّاني .وعلى كلّ الوجوه كان حذف متعلّق الامتراء لظهوره من المقام تعويلاً على القرينة ، وإذ قد كانت هذه الوجوه الثّلاثة غير متعارضة ، صحّ أن يكون جميعها مقصوداً من الآية . لتذهب أفهام السامعين إلى ما تتوصّل إليه منها . وهذا فيما أرى من مقاصد إيجاز القرآن وهو معنى الكلام الجامع ، ويجيء مثله في آيات كثيرة ، وهو من خصائص القرآن .\n\n",
      "translations": [
        {
          "translation": "Then, say to them, Muhammad: (Shall I seek other than Allah for judge) shall I worship as Lord other than Allah, (when He it is who has revealed unto you) you are your prophet ((this) Scripture) this Qur'an through the intermediary of Gabriel, (fully explained?) explaining fully the lawful and the unlawful; it is also said: it is revealed in instalments, a few verses on each occasion. (Those unto whom We gave the Scripture) those to whom We have given knowledge of the Torah, i.e. 'Abdullah Ibn Salam and his followers (know) are certain on the basis of their Scripture (that it) i.e. the Qur'an (is revealed from thy Lord in truth) with commands and prohibitions; it is also said that this means: Gabriel is sent by your Lord with the Truth, i.e. with the Qur'an. (So be not thou (0 Muhammad) of the waverers) of those who doubt that they might not know this.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولم يعاندوا ولم يكابروا { يَعْلَمُونَ } يقيناً بشهادة كتبهم { أَنَّهُ } أي: القرآن { مُنَزَّلٌ مِّن رَّبِّكَ } ملتبساً { بِٱلْحَقِّ } بلا ميل إلى الباطل أصلاً { فَلاَ تَكُونَنَّ } يا أكمل الرسل { مِنَ ٱلْمُمْتَرِينَ } [الأنعام: 114] في أنهم عالمون بحقية القرآن وموافقته لكتبهم\n إلا أنهم يكابرون في تحريف كتبهم\n ويعاندون بادعاء تكذيب القرآن ظلماً وعدواناً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { غير }: مفعول\n و { حَكَمًا }: حال\n وهو أبلغ من حاكم\n ولذلك لا يوصف به غير العادل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:147",
      "similarity": 0.6687810327838002
    },
    {
      "verse": "3:60",
      "similarity": 0.6324273942095713
    },
    {
      "verse": "53:12",
      "similarity": 0.5798180397030906
    },
    {
      "verse": "44:50",
      "similarity": 0.5723927671814691
    },
    {
      "verse": "15:63",
      "similarity": 0.5441625808859133
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006114.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006114.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:114.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}