{
  "chapter": "الأنعام",
  "text": "ولو اننا نزلنا اليهم الملئكة وكلمهم الموتى وحشرنا عليهم كل شىء قبلا ما كانوا۟ ليؤمنوا۟ الا ان يشاء الله ولكن اكثرهم يجهلون",
  "translations": [
    {
      "translation": "Even if We sent down angels to them, and the dead spoke to them, and We gathered together everything in front of them right before their eyes, they would still not have iman unless Allah willed. The truth is that most of them are ignorant.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if We send down the angels to them, and the dead should speak to them, and We gather all things before their eyes, they will not believe, unless God should will, for most of them are ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if We had sent angels down to them and the dead had spoken to them, and even if We had assembled before them all the things, face to face, they would still not believe unless it be Allah's will that they believe. Most of them behave in utter ignorance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We sent the angels to them, made the dead speak to them, and resurrected all things before their very eyes, they still would not believe unless God willed it to be so. But, in fact, most of them ignore (the evidence).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We sent down the angels towards them, and had the dead spoken to them, and had We raised all things in front of them, they would still not have believed unless Allah willed – but most of them are totally ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even if We had sent down unto them angels, and the dead had spoken unto them, and We had gathered together all things before them, they would not have believed, unless Allah willed, but most of them behave ignorantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even if We had sent down to them the angels and the dead had spoken to them and We had brought together all things before them, they would not believe unless Allah pleases, but most of them are ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though We had sent down the angels to them, and the dead had spoken with them, had We mustered against them every thing, face to face, yet they would not have been the ones to believe, unless God willed; but most of them are ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And though We should send down the angels unto them, and the dead should speak unto them, and We should gather against them all things in array, they would not believe unless Allah so willed. Howbeit, most of them are ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if We sent down angels to them, and caused the dead to speak to them, and We gathered together everything in front of them, they would still not believe, unless God had so willed. But most of them behave ignorantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even thou We had sent down angels unto them, and the dead had spoken to them, and We had gathered together about them everything face to face, they were not such as could believe, unless Allah had so willed, but most of them speak ignorantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if We had sent down angels to them, and the dead had spoken to them, and We had gathered before them all things manifestly, they would [still] not believe unless Allah wished. But most of them are ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if We did send unto them angels, and the dead did speak unto them, and We gathered together all things before their very eyes, they are not the ones to believe, unless it is in Allah's plan. But most of them ignore (the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even if We had sent down unto them angels, and the dead had spoken unto them, and We had gathered together all things before their very eyes, they would not have believed, unless Allah willed, but most of them behave ignorantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if We sent down the angels to them and the dead spoke to them, and assembled all things in front of them, they would still not believe, unless Allah willed it. But most of them are ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if We sent down the angels to them, and the dead spoke to them, and We gathered all things before them, they still would not believe, unless God wills; but most of them are ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even if We had sent down to them the angels [with the message] and the dead spoke to them [of it] and We gathered together every [created] thing in front of them, they would not believe unless Allah should will. But most of them, [of that], are ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:111] And if We had sent down the angels to them, and the dead had spoken with them, as they have requested, and We had gathered against them all things in droves (read qubulan, plural of qabīl, meaning ‘throng upon throng’, or read qibalan, meaning ‘before their very eyes’), and they were witness to your truthfulness, yet they would not have believed, as God already knows, unless God willed, that they believe and they did; but most of them are ignorant, of this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And though We should send down the angels) as they have asked and testified in favour of that which they denied (unto them) unto those who sneer, (and the dead should speak unto them) from their graves, as they asked, telling them that Muhammad is Allah's Messenger and that the Qur'an is Allah's speech, (and We should gather against them all things) of birds and beasts (in array) face to face, testifying that what We say is the Truth and affirming that which they have denied, (they would not believe) in Muhammad and the Qur'an (unless Allah so willed) that they believe. (Howbeit, most of them are ignorant) that it is the Truth from Allah. 147\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَحَشَرْنَا عَلَيْهِمْ كُلَّ شَيْءٍ قُبُلاً } معناهُ أَصنَافاً واحدُهَا قُبلٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَوْ أَنَّنَا نَزَّلْنَآ إِلَيْهِمُ ٱلْمَلاۤئِكَةَ } كما اقترحوا { وَكَلَّمَهُمُ ٱلْمَوْتَىٰ } من قبورهم وأوصاهم بالإيمان { وَحَشَرْنَا عَلَيْهِمْ كُلَّ شَيْءٍ قُبُلاً } كفلاً يرشدونهم إلى الإيمان { مَّا كَانُواْ } ليؤمنوا؛ إذ ختم الله على قلوبهم بالكفر في سابق عمله { لِيُؤْمِنُوۤاْ إِلاَّ أَن يَشَآءَ ٱللَّهُ } إيمانهم أيضاً في قضائه السابق { وَلَـٰكِنَّ أَكْثَرَهُمْ } أي: أكثر النار { يَجْهَلُونَ } [الأنعام: 111] عن قضاء الله ومشيئته فيتمنون إيمانهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { قبلاً }: بكسر القاف معاينة، وبضمتين: جمع قبيل، أي: ضمناء، وهو حال\n يقول الحقّ جلّ جلاله: في الرد على المشركين، حين أقسموا: لئن رأوا آية ليؤمنن بها، فقال تعالى: { ولو أننا نزّلنا إليهم الملائكة } تشهد لك بالنبوة كما اقترحوا، { وكلمهم الموتى } كما طلبوا بقولهم:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "46:23",
      "similarity": 0.47968962874146814
    },
    {
      "verse": "39:64",
      "similarity": 0.4301374503531993
    },
    {
      "verse": "4:17",
      "similarity": 0.3993752203313204
    },
    {
      "verse": "6:35",
      "similarity": 0.3822308079610327
    },
    {
      "verse": "16:119",
      "similarity": 0.37693678296969396
    }
  ]
}