{
  "chapter": "الأنعام",
  "text": "فكلوا۟ مما ذكر اسم الله عليه ان كنتم بـايته مؤمنين",
  "translations": [
    {
      "translation": "Eat that over which the name of Allah has been mentioned, if you have iman in His Signs.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat only that over which the name of God has been pronounced, if you truly believe in His commands.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you believe in the signs of Allah, eat (the flesh) of that over which Allah's name has been pronounced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you have faith in God's revelations, eat the flesh of the animal which has been slaughtered with a mention of His Name.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat from that over which Allah’s name has been mentioned, if you believe in His signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat of that on which Allah's Name has been mentioned, if you are believers in His Ayat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore eat of that on which Allah's name has been mentioned if you are believers in His communications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat of that over which God's Name has been mentioned, if you believe in His signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat of that over which the name of Allah hath been mentioned, if ye are believers in His revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat then, only that over which God's name has been pronounced, if you truly believe in His revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore eat of that whereon the name of Allah hath been pronounced, if ye are believers in His revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat from that over which Allah’s Name has been mentioned, if you are believers in His signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat of (meats) on which Allah's name hath been pronounced, if ye have faith in His signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat of that (meat) on which Allah's Name has been pronounced (while slaughtering the animal), if you are believers in His Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat then of that over which the Name of Allah has been mentioned (when slaughtered), if you truly believe in His verses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat of that over which the Name of God was pronounced, if you indeed believe in His revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So eat of that [meat] upon which the name of Allah has been mentioned, if you are believers in His verses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:118]   So eat from that over which God’s Name has been invoked, that is, [that which] has been sacrificed to His Name, if you believe in His signs.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Eat of that over which the name of Allah hath been mentioned) of immolated animals, (if ye are believers in His revelations) in the Qur'an. 148\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذا علمتم أيها المؤمنون أن الهداية والإضلال بيد الله لا تتبعوا أهواء قوم قد ضلوا بتحريم المباح وتحليل الحرام { فَكُلُواْ } أي: من الأزواج الثمانية وما يشبهها { مِمَّا ذُكِرَ ٱسْمُ ٱللَّهِ عَلَيْهِ } عند ذبحه مستبيحين محللين على أنفسكم { إِن كُنتُمْ بِآيَاتِهِ مُؤْمِنِينَ } [الأنعام: 118] ويأحكامه مصدقين ممتثلين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { فكلوا مما ذُكر اسم الله عليه } عند ذبحه، ولا تتورعوا منه، { إن كنتم بآياته مؤمنين } ، فإن الإيمان يقتضي استباحة ما أحل الله تعالى، واجتناب ما حرمه، { وما لكم ألاَّ تأكلوا مما ذُكر اسم الله عليه } أي: ما يمنعكم منه، وأيّ غرض لكم في التحرُّج عن أكله؟",
      "translations": []
    }
  ]
}