{
  "chapter": "الأنعام",
  "text": "وكذلك جعلنا لكل نبى عدوا شيطين الانس والجن يوحى بعضهم الى بعض زخرف القول غرورا ولو شاء ربك ما فعلوه فذرهم وما يفترون",
  "translations": [
    {
      "translation": "In this way We have appointed as enemies to every Prophet shaytans from both mankind and from the jinn, who inspire each other with delusions by means of specious words - if your Lord had willed, they would not have done it, so abandon them and all they fabricate -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is how We have made for each apostle opponents, the satans among men and jinns, who inspire one another with deceitful talk. But if your Lord had willed they would not have done so. Pay no attention to them and to what they fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so it is that against every Prophet We have set up the evil ones from among men and jinn, some of them inspire others with specious speech only by way of. delusion. Had it been your Lord's will, they would not have done it. Leave them alone to fabricate what they will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made devilish enemies for every Prophet from among people and jinn. They whisper attractive but and deceitful words to each other. Had your Lord wanted, the devils would not have seduced people. Keep away from them and the falsehood which they invent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And similarly We have appointed enemies for every Prophet – devils from men and jinns – one inspires the other with fabrications to deceive; and had your Lord willed they would not do so, therefore leave them with their fabrications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so We have appointed for every Prophet enemies -- Shayatin among mankind and Jinn, inspiring one another with adorned speech as a delusion. If your Lord had so willed, they would not have done it; so leave them alone with their fabrications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus did We make for every prophet an enemy, the Shaitans from among men and jinn, some of them suggesting to others varnished falsehood to deceive (them), and had your Lord pleased they would not have done it, therefore leave them and that which they forge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We have appointed to every Prophet an enemy -- Satans of men and jinn, revealing tawdry speech to each other, all as a delusion; yet, had thy Lord willed, they would never have done it. So leave them to their forging,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We appointed unto every prophet an adversary - devils of humankind and jinn who inspire in one another plausible discourse through guile. If thy Lord willed, they would not do so; so leave them alone with their devising;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In like manner We have assigned for every prophet an opponent, Satans from among men and jinn, who make evil suggestions to each other by means of specious words in order to deceive -- had it been your Lord's will, they would not have done so; so leave them alone to their fabrication,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in this wises have we appointed unto every prophet an enemy-- Satans of men and of genii inspiring to each other gilded speech as a delusion. And had thy Lord willed, they could not have done so; wherefore let thou alone if them and that which they fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is how for every prophet We appointed as enemy the devils from among humans and jinn, who inspire each other with flashy words, deceptively. Had your Lord wished, they would not have done it. So leave them with what they fabricate,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise did We make for every Messenger an enemy,- evil ones among men and jinns, inspiring each other with flowery discourses by way of deception. If thy Lord had so planned, they would not have done it: so leave them and their inventions alone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so We have appointed for every Prophet enemies - Shayatin (devils) among mankind and jinns, inspiring one another with adorned speech as a delusion (or by way of deception). If your Lord had so willed, they would not have done it, so leave them alone with their fabrications. (Tafseer Qurtubi, Vol. 7, Page 67)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As such We have assigned for every Prophet an enemy; the satans of humans and jinn, revealing varnished speech to each other, all as a delusion. But had your Lord willed, they would not have done so. Therefore leave them and what they invent,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise, We have assigned for every prophet an enemy—human and jinn devils—inspiring one another with fancy words in order to deceive. But had your Lord willed, they would not have done it. So leave them to their fabrications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have made for every prophet an enemy - devils from mankind and jinn, inspiring to one another decorative speech in delusion. But if your Lord had willed, they would not have done it, so leave them and that which they invent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:112] And so We have appointed to every Prophet an enemy, just as We have appointed these your enemies (and this [‘adūwwan, ‘an enemy’, is substituted by [the following, shayātīn, ‘devils’]) devils, the rebels, of mankind and jinn who inspire, whisper, fine speech to each other, the falsehood that is disguised as such [fine speech], in delusion, that is, in order to delude them; yet, had your Lord willed, they would never have done it, that mutual inspiration. So leave them, let the disbelievers be, with what they fabricate, of disbelief and otherwise, of what has been adorned for them — this was [revealed] before the command to fight [them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاعتراض قصد منه تسلية الرّسول صلى الله عليه وسلم والواو واو الاعتراض ، لأنّ الجملة بمنزلة الفذلكة ، وتكون للرّسول صلى الله عليه وسلم تسلية بعد ذكر ما يحزنه من أحوال كفار قومه ، وتصلبّهم في نبذ دعوته ، فأنبأه الله : بأنّ هؤلاء أعداؤه ، وأن عداوة أمثالهم سنة من سنن الله تعالى في ابتلاء أنبيائه كلّهم ، فما منهم أحد إلاّ كان له أعداء ، فلم تكن عداوة هؤلاء للنبيء عليه الصلاة والسلام بِدْعا من شأن الرّسل . فمعنى الكلام : ألَسْتَ نبيئا وقد جعلنا لكلّ نبيء عدوّا إلى آخره .والإشارة بقوله : { وكذلك } إلى الجعل المأخوذ من فعل { جعلنا } كما تقدّم في قوله تعالى : { وكذلك جعلناكم أمّة وسطاً } \\[ البقرة : 143 \\]. فالكاف في محل نصب على أنّه مفعول مطلق لفعل { جعلنا }.وقوله : { عدواً } مفعول { جعلنا } الأوّل ، وقوله : { لكل نبي } المجرور مفعول ثان ل { جعلنا } وتقديمه على المفعول الأول للاهتمام به ، لأنّه الغرض المقصود من السّياق ، إذ المقصود الإعلام بأنّ هذه سنّة الله في أنبيائه كلّهم ، فيحصل بذلك التَّأسِّي والقُدوة والتّسلية؛ ولأن في تقديمه تنبيهاً من أول السمع على أنه خبر ، وأنه ليس متعلّقا بقوله : { عدواً } كيلا يخال السّامع أنّ قوله : { شياطين الإنس } مفعول لأنّه يُحَوّل الكلام إلى قصد الإخبار عن أحوال الشّياطين ، أو عن تعيين العدوّ للأنبياء من هو ، وذلك ينافي بلاغة الكلام .و { شياطين } بدل من { عدواً } وإنَّما صيغ التّركيب هكذا : لأنّ المقصود الأوّل الإخبار بأنّ المشركين أعداء للرّسول صلى الله عليه وسلم فمن أعرب { شياطين } مفعولاً ل { جَعل } و { لكل نبي } ظرفاً لغواً متعلِّقاً ب { عدوّا } فقد أفسد المعنى .والعَدُوّ : اسم يقع على الواحد والمعتددّ ، قال تعالى : { هم العدوّ فاحذرهم } \\[ المنافقون : 4 \\] وقد تقدّم ذلك عند قوله تعالى : { فإن كان من قوم عدوّ لكم } في سورة النساء ( 92 ).والشّيطان أصله نوع من الموجودات المجرّدة الخفية ، وهو نوع من جنس الجنّ ، وقد تقدّم عند قوله تعالى : { واتبعوا ما تتلوا الشّياطين على ملك سليمان } \\[ البقرة : 102 \\]. ويطلق الشّيطان على المضلّل الّذي يفعل الخبائث من النّاس على وجه المجاز . ومنه «شياطين العرب» لجماعة من خباثهم ، منهم : ناشب الأعور ، وابنُه سعد بن ناشب الشّاعر ، وهذا على معنى التّشبيه ، وشاع ذلك في كلامهم .والإنس : الإنسان وهو مشتقّ من التأنّس والإلْف ، لأنّ البشر يألف بالبشر ويأنس به ، فسمّاه إنساً وإنساناً .و«شياطين الإنس» استعارة للنّاس الّذين يفعلون فعل الشّياطين : من مكر وخديعة . وإضافة شياطين إلى الإنس إضافة مجازية على تقدير ( مِن ) التبعيضية مجازا ، بناء على الاستعارة التي تقتضي كون هؤلاء الإنس شياطين ، فهم شياطين ، وهم بعض الإنس ، أي أنّ الإنس : لهم أفراد متعارفة ، وأفراد غير متعارفة يطلق عليهم اسم الشّياطين ، فهي بهذا الاعتبار من إضافة الأخصّ من وجهٍ إلى الأعمّ من وجهٍ ، وشياطين الجنّ حقيقة ، والإضافة حقيقة ، لأنّ الجنّ منهم شياطين ، ومنهم غير شياطين ، ومنهم صالحون ، وعداوة شياطين الجنّ للأنبياء ظاهرة ، وما جاءت الأنبياء إلاّ للتحذير من فعل الشّياطين ، وقد قال الله تعالى لآدم :{ إنّ هذا عدوّ لك ولزوجك } \\[ طه : 117 \\].وجملة { يوحى } في موضع الحال ، يتقيّد بها الجَعل المأخوذ من { جعلنا } فهذا الوحي من تمام المجعول .والوحي : الكلام الخفي ، كالوسوسة ، وأريد به ما يشمل إلقاء الوسوسة في النّفس من حديث يُزوّر في صورة الكلام . والبعض الموحي : هو شياطين الجنّ ، يُلقون خواطر المقدرة على تعليم الشرّ إلى شياطين الإنس ، فيكونون زعماء لأهل الشرّ والفساد .والزّخرف : الزّينة ، وسمّي الذهب زُخرفاً لأنَّه يتزيَّن به حَلياً ، وإضافة الزخرف إلى القول من إضافة الصّفة إلى الموصوف ، أي القول الزُخرف : أي المُزَخْرَف ، وهو من الوصف بالجامد الّذي في معنى المشتق ، إذ كان بمعنى الزيْن . وأفهم وصف القول بالزُخرف أنّه محتاج إلى التّحسين والزخرفَة ، وإنَّما يحتاج القول إلى ذلك إذا كان غير مشتمل على ما يكسبه القبول في حدّ ذاته ، وذلك أنّه كان يفضي إلى ضُرّ يحتاج قائله إلى تزيينه وتحسينه لإخفاء ما فيه من الضرّ ، خشية أن ينفر عنه من يُسوله لهم ، فذلك التّزيين ترويج يستهوون به النّفوس ، كما تموّه للصّبيان اللُّعب بالألوان والتذهيب .وانتصب { زخرف القول } على النيابة عن المفعول المطلق من فِعل { يوحى } لأنّ إضافة الزّخرف إلى القول ، الّذي هو من نوع الوحي ، تجعل { زخرف } نائياً عن المصدر المبيِّن لنوع الوحي .والغرور : الخِداع والإطماع بالنّفع لقصد الإضرار ، وقد تقدّم عند قوله تعالى : { لا يغرنَّك تقلّب الذين كفروا في البلاد } في سورة آل عمران ( 196 ). وانتصب غروراً } على المفعول لأجله لفعل { يوحى } ، أي يرحون زخرف القول ليَغُرّوهم .والقول في معنى المشيئة من قوله : { ولو شاء ربك ما فعلوه } كالقول في { ما كانوا ليؤمنوا إلاّ أن يشاء الله } \\[ الأنعام : 111 \\] وقوله : { ولو شاء الله ما أشركوا } \\[ الأنعام : 107 \\] والجملة معترضة بين المفعول لأجله وبين المعطوف عليه .والضّمير المنصُوبُ في قوله : { فعلوه } عائد إلى الوحي . المأخوذ من { يوحى } أو إلى الإشراك المتقدّم في قوله : { ولو شاء الله ما أشركوا } \\[ الأنعام : 107 \\] أو إلى العداوة المأخوذة من قوله : { لكل نبي عدواً }.والضّمير المرفوع عائد إلى { شياطين الإنس والجن } ، أو إلى المشركين ، أو إلى العدوّ ، وفرع عليه أمر الرسول عليه الصلاة والسلام بتركهم وافتراءَهم ، وهو تركُ إعراضضٍ عن الاهتمام بغرورهم ، والنكدِ منه ، لا إعْراض عن وعظهم ودعوتهم ، كما تقدّم في قوله : { وأعرض عن المشركين }.والواو بمعنى مع .{ وما يفترون } مَوصول منصوب على المفعول معه . وما يفترونه هو أكاذيبهم الباطلة من زعمهم إلهية الأصنام ، وما يتبع ذلك من المعتقدات الباطلة .\n\n",
      "translations": [
        {
          "translation": "(Thus) just as We have appointed Abu Jahl and those who sneer as your enemies, so (have We appointed unto every Prophet an adversary) a tyrant (devils of humankind and jinn) He says: We appointed human and jinn devils (who inspire in) dictate to (one another plausible discourse through guile) in order to deceive the son of Adam. (If thy Lord willed they would not do so) i.e. dictate plausible discourse and beguiling; (so leave them alone) leave, Muhammad, those who sneer and their folk (with their devising) their embellishment of words and deception;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { زُخْرُفَ ٱلْقَوْلِ غُرُوراً } معناهُ مُزيّنٌ مُحسَّنٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Exalt the word with glory\" - this means that it is beautiful and noble.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وكذلك جعلنا لكل نبيّ عدوّاً } إلى آخره\n يلزم من ترتب مراتب الأرواح أن مقابلة أصفى الاستعدادات وأنورها بأكدرها وأظلمها وأبعدها ولزم منه وجود عدوّ لكل نبيّ للتضاد الحقيقي بينهما\n وفائدة وجود العدوّ في مقابلته له أن الكمال الذي قدّر له بحسب استعداده لا يظهر عليه إلا بقوة المحبة للاستمداد\n وأما القهر فلانكسار نفسه به وبإهانته واستخفافه له\n وتثبته عند مقابلته في مقام القلب وتجلده معرضاً عن النفس ولذاتها لاشتغاله بالعدوّ ذاهلاً عنها لفرط الحمية والحرص على الفضيلة التي يقهر بها العدو والاحتراز عن الملابس الحيوانية والشيطانية ليبعد بها عن مقامه ومناسبته ولئلا يتطرّق له سبيل إلى طعنه وتحقيره وازدرائه بها\n ولهذا قال صلى الله عليه وسلم:\n \" ما أُوذِي نبيّ قط مثل ما أُوذيت \" \n\n إذ لا كمال لأحد مثل كماله فيجب أن يكون سبب إخراجه إلى الفعل أقوى لغاية بعده عن صفات النفس وعاداتها\n { ولتصغى إليه أفئدة الذين لا يؤمنون بالآخرة } ولتميل إليه المحجوبون لمناسبتهم { وليرضوه } لمحبتهم إياه\n فتقوى غوايتهم ويتظاهرون ويخرج ما فيهم من الشرور إلى الفعل\n ويزدادوا طغياناً وتعدّياً على النبيّ صلى الله عليه وسلم فتزداد قوى كماله وتهيج أيضاً بسببه دواعي المؤمنين\n والذين في استعدادهم مناسبة للنبي صلى الله عليه وسلم فتنبعث حميتهم\n وتزداد محبتهم للنبي صلى الله عليه وسلم ونصرهم إيّاه\n فتظهر عليهم كمالاتهم ويتقوّى بهم النبي صلى الله عليه وسلم كما قيل: إن شهرة المشايخ وكثرة مريديهم لا تكون إلا بواسطة المنكرين إياهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَذَٰلِكَ } أي: ومثل ما جعلنا لك يا أكمل الرسل عدواً { جَعَلْنَا لِكُلِّ نِبِيٍّ } من الأنبياء { عَدُوّاً } يعاديهم { شَيَٰطِينَ ٱلإِنْسِ وَٱلْجِنِّ } بالمظاهرة والمعاونة\n إذ { يُوحِي بَعْضُهُمْ إِلَىٰ بَعْضٍ زُخْرُفَ ٱلْقَوْلِ } أي: أباطيله وأراجيفه { غُرُوراً } ليقدموا ضعفاء الأنام على مخاصمة الأنبياء ومعاداتهم\n ويظهروا عليه بتغرير بعضهم { وَلَوْ شَآءَ رَبُّكَ } إيمانهم { مَا فَعَلُوهُ } أي: هذا الغرور والقول المزخرف المموه\n وبالجملة: { فَذَرْهُمْ } وكفرهم { وَمَا يَفْتَرُونَ } [الأنعام: 112] ويزخرفون بسبب غرورهم وزخرفتهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { شياطين }: بدل من { عدو } إذ هو بمعنى الجمع\n أو مفعول أول لجعلنا\n و { عدوًا }: مفعول ثان\n والضمير في { فعلوه }: للوحي\n أو للعداوة\n و { غرورًا }: مفعول له",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:35",
      "similarity": 0.6888921859113384
    },
    {
      "verse": "17:93",
      "similarity": 0.44892481894243785
    },
    {
      "verse": "10:24",
      "similarity": 0.3076119696371264
    },
    {
      "verse": "3:24",
      "similarity": 0.23954118241297753
    },
    {
      "verse": "4:120",
      "similarity": 0.21929963339670117
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006112.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006112.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:112.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}