{
  "chapter": "الأنعام",
  "text": "وما لكم الا تاكلوا۟ مما ذكر اسم الله عليه وقد فصل لكم ما حرم عليكم الا ما اضطررتم اليه وان كثيرا ليضلون باهوائهم بغير علم ان ربك هو اعلم بالمعتدين",
  "translations": [
    {
      "translation": "What is the matter with you that you do not eat that over which the name of Allah has been mentioned, when He has made clear to you what He has made haram for you except when you are forced to eat it? Many people lead themselves astray through their whims and desires without having any knowledge. Your Lord knows best those who overstep the limits.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should you not eat of that over which the name of God has been pronounced, when He has made it distinctly clear what is forbidden, unless you are constrained to do so. Surely many (men) mislead others into following their vain desires through lack of knowledge. Your Lord certainly knows the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how is it that you do not eat of that over which Allah's name has been pronounced even though He has clearly spelled out to you what He has forbidden you unless you are constrained to it? Many indeed say misleading things without knowledge, driven merely by their lowly desires. But your Lord knows well the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should you not eat such flesh when God has told you in detail what is unlawful to eat under normal conditions. Most people, out of ignorance, are led astray by their desires. Your Lord knows best those who transgress.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what is the matter with you that you should not eat from that over which Allah’s name has been mentioned whereas He has explained in detail to you all what is forbidden to you except when you are forced (by circumstances) towards it? And indeed many lead astray by their own desires, out of ignorance; indeed your Lord well knows the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should you not eat of that on which Allah's Name has been mentioned, while He has explained to you in detail what is forbidden to you, except under compulsion of necessity And surely, many do lead astray by their own desires through lack of knowledge. Certainly your Lord knows best the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what reason have you that you should not eat of that on which Allah's name has been mentioned, and He has already made plain to you what He has forbidden to you-- excepting what you are compelled to; and most surely many would lead (people) astray by their low desires out of ignorance; surely your Lord-- He best knows those who exceed the limits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How is it with you, that you do not eat of that over which God's Name has been mentioned, seeing that He has distinguished for you that He has forbidden you, unless you are constrained to it? But surely, many lead astray by their caprices, without any knowledge; thy Lord knows very well the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How should ye not eat of that over which the name of Allah hath been mentioned, when He hath explained unto you that which is forbidden unto you unless ye are compelled thereto. But lo! many are led astray by their own lusts through ignorance. Lo! thy Lord, He is Best Aware of the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should you not eat what has been consecrated in God's name, when He has already explained to you what He has forbidden you, unless you are compelled by necessity? Surely, many mislead others by their desires through lack of knowledge. But your Lord best knows the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what aileth you that ye should not eat that whereon the name of Allah hath been pronounced while He hath surely detailed unto you that which He hath forbidden you, unless ye are driven thereto? Verily many lead others astray by their desires without knowledge. Verily thy Lord! He knoweth best the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should you not eat that over which Allah’s Name has been mentioned, while He has already elaborated for you whatever He has forbidden you, excepting what you may be compelled to [eat in an emergency]? Indeed many mislead [others] by their fancies, without any knowledge. Indeed your Lord knows best the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should ye not eat of (meats) on which Allah's name hath been pronounced, when He hath explained to you in detail what is forbidden to you - except under compulsion of necessity? But many do mislead (men) by their appetites unchecked by knowledge. Thy Lord knoweth best those who transgress.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should you not eat of that (meat) on which Allah's Name has been pronounced (at the time of slaughtering the animal), while He has explained to you in detail what is forbidden to you, except under compulsion of necessity? And surely many do lead (mankind) astray by their own desires through lack of knowledge. Certainly your Lord knows best the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should you not eat of that over which the Name of Allah has been pronounced when He has already made plain to you what is forbidden, except when you are constrained? Many are those who mislead through ignorance on account of their fancies, but your Lord best knows the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should you not eat of that over which the Name of God is pronounced, when He has detailed for you what is prohibited for you, unless you are compelled by necessity? Many lead astray with their opinions, through lack of knowledge. Your Lord knows best the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should you not eat of that upon which the name of Allah has been mentioned while He has explained in detail to you what He has forbidden you, excepting that to which you are compelled. And indeed do many lead [others] astray through their [own] inclinations without knowledge. Indeed, your Lord - He is most knowing of the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:119] What is wrong with you, that you do not eat from that over which God’s Name has been invoked, of sacrifices, when He has detailed (for both verbs, read the passive [fussila, ‘it has been detailed’, and hurrima, ‘[that which] has been forbidden’] or the active [fassala, ‘He has detailed’, and harrama, ‘[what] He has forbidden’]) for you what He has forbidden, in the verse: Forbidden to you is carrion … [Q. 5:3], except that to which you are compelled?, thereof, which is also lawful for you. The meaning is: there is nothing to prevent you from eating what has been mentioned, for He has explained to you what is forbidden for consumption, and that [over which God’s Name has been invoked] is not among these [forbidden things]. But truly many are led astray (read la-yadillūna, ‘[many] are led astray’, or la-yudillūna, ‘[many] lead [others] astray’), by their whims, by what their own selves fancy, in the way of permitting [the consumption of] carrion and otherwise, without any knowledge, with which to support their claims. Truly your Lord knows the transgressors, those who overstep [the bounds] of what is lawful into what is unlawful.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(How should ye not eat of that over which the name of Allah hath been mentioned) of immolated animals, (when He hath explained unto you that which is forbidden unto you) such as the meat of carrion, blood and pork, (unless you are compelled thereto) except if you are forced to eat the meat of carrion. (But lo! Many) Abu'l-Ahwas and his folk (are led astray by their own lusts) call on you to eat the meat of carrion (through ignorance) or proof. (Lo! your Lord, He is best aware of the transgressors) who move from the lawful to that which is unlawful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا لَكُمْ } وأي شيء عرض لكم ويمنعكم { أَلاَّ تَأْكُلُواْ مِمَّا ذُكِرَ ٱسْمُ ٱللَّهِ عَلَيْهِ وَ } الحال أنه { قَدْ فَصَّلَ لَكُمْ } ربكم { مَّا حَرَّمَ عَلَيْكُمْ } في قوله:\n[المائدة: 3]\n\n\nفعليكم ألاَّ تأكلوا المحرمات { إِلاَّ مَا ٱضْطُرِرْتُمْ إِلَيْهِ } حينئذ يباح لكم منها مقدار سد جرعة { وَإِنَّ كَثِيراً } من الناس { لَّيُضِلُّونَ } في أنفسهم ويضلون غيرهم من الضعفاء بتحليل المحرمات\n وتحريم المحللات بلا سند شرعي { بِأَهْوَائِهِم } الباطلة { بِغَيْرِ عِلْمٍ } بما عند الله فلا تتبعوا ولا تقتفوا أثرهم { إِنَّ رَبَّكَ } يا أكمل الرسل { هُوَ أَعْلَمُ بِٱلْمُعْتَدِينَ } [الأنعام: 119] المتجاوزين عن حدوده بمتابعة أهوائهم الفاسدة فيجازيهم على مقتضى علمه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وما لكم ألاَّ تأكلوا مما ذُكر اسم الله عليه } أي: ما يمنعكم منه\n وأيّ غرض لكم في التحرُّج عن أكله؟\n { وقد فصَّل لكم } في الكتاب\n أو فصَّل الله لكم { ما حرم عليكم } مما لم يحرم بقوله:\n[المَائدة:3] الآية { إلا ما اضطررتم إليه } مما حرم عليكم فإنه حلال حال الضرورة\n { وإنَّ كثيرًا ليُضلون } بتحليل الحرام وتحريم الحلال { بأهوائهم } أي: بمجرد أهوائهم { بغير علم } ولا دليل\n بل بتشهي أنفسهم\n { إن ربك هو أعلم بالمعتدين } المجاوزين الحق إلى الباطل\n والحلال إلى الحرام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:29",
      "similarity": 0.40838765078919614
    },
    {
      "verse": "28:50",
      "similarity": 0.40484062777536284
    },
    {
      "verse": "6:56",
      "similarity": 0.3488105181838403
    },
    {
      "verse": "6:126",
      "similarity": 0.3197894515857916
    },
    {
      "verse": "7:52",
      "similarity": 0.31765712277966623
    }
  ]
}