{
  "chapter": "الأنعام",
  "text": "وتمت كلمت ربك صدقا وعدلا لا مبدل لكلمته وهو السميع العليم",
  "translations": [
    {
      "translation": "The Words of your Lord are perfect in truthfulness and justice. No one can change His Words. He is the All-Hearing, the All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perfected are the laws of your Lord in truth and justice, and there is no changing His laws. He is all-hearing and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Word of your Lord is perfect in truthfulness and justice; no one can change His words. He is the All-Hearing, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(After having revealed the Quran to you) in all truth and justice, your Lord's Word has been completed. No one can change His Words. He is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Word of your Lord is complete in truth and justice; there is none to change His Words; He is the All Hearing, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Word of your Lord has been fulfilled in truth and in justice. None can change His Words. And He is the All-Hearer, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the word of your Lord has been accomplished truly and justly; there is none who can change His words, and He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perfect are the words of thy Lord in truthfulness and justice; no man can change His words; He is the All-hearing, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perfected is the Word of thy Lord in truth and justice. There is naught that can change His words. He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Word of your Lord is perfected in truth and justice. None can change His words. He is the All Hearing, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And perfected is the word of thy Lord in veracity and in justice. And none can change His words. And He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The word of your Lord has been fulfilled in truth and justice. Nothing can change His words, and He is the All-hearing, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The word of thy Lord doth find its fulfilment in truth and in justice: None can change His words: for He is the one who heareth and knoweth all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Word of your Lord has been fulfilled in truth and in justice. None can change His Words. And He is the All-Hearer, the All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Perfected are the words of your Lord in truth and justice, none can change His Words. He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Word of your Lord has been completed, in truth and justice. There is no changing to His words. He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the word of your Lord has been fulfilled in truth and in justice. None can alter His words, and He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:115] Perfected is the word of your Lord, in the way of rulings and appointed terms, in truthfulness and justice (sidqan wa-‘adlan is for specification); none can change His words, either by contravening [His rulings] or evading [His appointed terms]. He is the Hearing, of what is said, the Knowing, of what is done.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Perfected is the Word of thy Lord) the Qur'an, detailing the commands and prohibitions (in truth) in His speech (and justice) from Him. (There is naught that can change His words) the Qur'an; it is also said that this means: the Word of your Lord has prescribed that His friends shall triumph. He is truthful in His speech and just in that which shall come. Nothing can change His words about His giving help to His friend. It is also said that this means: the religion of your Lord is now manifest, people truthfully believe that it is Allah's religion. Allah's command is just and nothing will ever change His religion. (He is the Hearer) of their speech, (the Knower) of them and their works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَتَمَّتْ كَلِمَتُ رَبِّكَ } أي: انتهت وتناهت، وبلغت الغاية القصوى بيان كلمة التوحيد برسالتك يا أكمل الرسلح إذ ظهرت في تبيينها وكشفها بما لا يظهر به أحد من الأنبياء؛ إذا الأنبياء إنما يظهرون توحيد الصفات والأفعال دون توحيد الذات، وأنت تظهر به حيث ورد في شأنك:\n\n[النساء: 80]، و\n\n[الفتح: 10]\n\n\n\n\nوقلت:\n\n \" من رآني فقد رأى الحق \"\n \n\n \n\nوقلت: أيضاً:\n\n \" رأيت ربي في ليلة المعراج \" \n\n، وغير ذلك الآثار والأخبار الدالة على التوحيد الذاتي\n\n\n\n\nلذلك أتمت مكارم الأقوال والأخلاق { صِدْقاً وَعَدْلاً } ومتى تمت وبلغت { لاَّ مُبَدِّلِ } ولا محول { لِكَلِمَاتِهِ } إذ ختم وتم أمر الرسالة والنبوة وسد باب الوحي { وَ } بعد ذلك ظهر أنه { هُوَ ٱلسَّمِيعُ } لأقواله { ٱلْعَلِيمُ } [الأنعام: 115] بشؤونه وتجلياته إلى ما شاء الله\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وتمت كلمة ربك } آيات القرآن، بلغت الغاية في التمام والكمال، { صِدقًا وعدلاً } أي: من جهة الصدق والعدل، صدقًا في الأخبار والمواعيد، وعدلاً في الأقضية والأحكام، فلا أصدَق منها فيما أخبرت، ولا أعدل منها فيما حكمت، { لا مبدل لكلماته } أي: لا أحد يقدر أن يبدل منها شيئًا بما هو أصدق وأعدل، ولا أن يحرف شيئًا منها، كما فُعل بالتوراة، فهو ضمان من الحق لحفظ القرآن، كما قال:\n\n[الحِجر:9] أو: لا نبي ولا كتاب بعدها ينسخها ويبدل أحكامها، { وهو السميع } لكل ما يقال، { العليم } بكل ما يضمر، فمن ألحد أو بدل فالله عليم به\n الإشارة: من قواعد أهل التصوف: الرجوع إلى الله في كل شيء، والاعتماد عليه في كل نازل، والتحاكم إلى الله في كل أمر، إن توقفوا في حكم رجعوا إلى كتاب الله، فإن لم يجدوه نصًا، رجعوا إلى سنة رسول الله صلى الله عليه وسلم، فإن لم يجدوه، استفتوا قلوبهم، وفي الحديث عنه:\n\n \" استَفت قلبَكَ وإن أفتَاكَ المُفتُونَ وأفتوك \" \n\nوفي بعض الآثار قالوا: يا رسول الله أرأيت إن اختلفنا بعدك، ولم نجد نصًا في كتاب الله ولا في سنة رسول الله؟ قال:\n\n \" ردوه إلى صلحائكم، واجعلوه شُورَى بينهم ولا تَتَعَدّوا رأيهم \" \n",
      "translations": []
    }
  ]
}