{
  "chapter": "الأنعام",
  "text": "ولتصغى اليه افـدة الذين لا يؤمنون بالءاخرة وليرضوه وليقترفوا۟ ما هم مقترفون",
  "translations": [
    {
      "translation": "Let those who do not believe in the life to come, listen to it and be pleased with it, and let them gain what they may gain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that the hearts of those who do not believe in the Life to Come might incline towards this attractive delusion, and that they may be well pleased with it and might acquire the evils that they are bent on acquiring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let those who do not believe in the Day of Judgment listen to the deceitful words with pleasure and indulge in whatever sins they want.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in order that the hearts of those who do not believe in the Hereafter may lean towards it and that they may like it, and earn the sins which they are to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Tasgha to it that the hearts of those who do not believe in the Hereafter may incline to such (deceit), and that they may remain pleased with it, and that they may commit what they are committing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that the hearts of those who do not believe in the hereafter may incline to it and that they may be well pleased with it and that they may earn what they are going to earn (of evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that the hearts of those who believe not in the world to come may incline to it, and that they may be well-pleased with it, and that they may gain what they are gaining.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That the hearts of those who believe not in the Hereafter may incline thereto, and that they may take pleasure therein, and that they may earn what they are earning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in order that the hearts of those who do not believe in the life to come might incline towards those suggestions and, being pleased, persist in their sinful ways.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is in order that the; hearts of those who believe not in the Hereafter might incline thereto, and that they might be pleased therewith, and that they might do that whereof they are the doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that toward it may incline the hearts of those who do not believe in the Hereafter, and so that they may be pleased with it and commit what they commit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To such (deceit) let the hearts of those incline, who have no faith in the hereafter: let them delight in it, and let them earn from it what they may.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And this is in order) that the hearts of those who disbelieve in the Hereafter may incline to such (deceit), and that they may remain pleased with it, and that they may commit what they are committing (all kinds of sins and evil deeds, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that the hearts of those who have no belief in the Everlasting Life are inclined to it and, being pleased, persist in their sinful ways.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that the hearts of those who do not believe in the Hereafter may incline to it, and be content with it, and that they may perpetrate whatever they perpetrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [it is] so the hearts of those who disbelieve in the Hereafter will incline toward it and that they will be satisfied with it and that they will commit that which they are committing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:113] And that the hearts of those who do not believe in the Hereafter may incline to it (wa-li-tasghā is a supplement to [the above] ghurūran, ‘in delusion’), that is, [to] that fine [speech], and that they may be pleased with it, and that they may acquire, earn, what they are acquiring, of sins, and be punished for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That the hearts of those who believe not in the Hereafter) who do not believe in resurrection after death (may incline thereto) to such embellishment of words and deception, (and that they may take pleasure therein) and so that they may accept from the satans such embellishment and deception, (and that they may earn what they are earning) of sin.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلِتَصْغَىۤ إِلَيْهِ أَفْئِدَةُ } معناه تَميلُ والأَفْئِدَةُ جَمعُ فوْادٍ\n ويقالُ: صَغوتُ إِليهِ، وأَصْغَيتُ إِليهِ\n\n\n\n\nوقوله تعالى: { وَلِيَقْتَرِفُواْ مَا هُم مُّقْتَرِفُونَ } معناه يَتَوافَقُوا وَيَعْمَلوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلِتَصْغَىۤ } ولتميل { إِلَيْهِ } وتوجه نحوه { أَفْئِدَةُ ٱلَّذِينَ لاَ يُؤْمِنُونَ بِٱلآخِرَةِ وَلِيَرْضَوْهُ } لأنفسهم ما يزخرفون به لكون جبلتهم عليه { وَلِيَقْتَرِفُواْ } ويكتسبوا بسببه { مَا هُم مُّقْتَرِفُونَ } [الأنعام: 113] مكتسبون من العقائد الزائفة والآثام\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وإنما فعلنا ذلك الإيحاء { لتصغى إليه أفئدة الذين لا يؤمنون بالآخرة } فيغتروا به، { وليَرضَوهُ } لأنفسهم، { وليقترفوا ما هم مقترفون } أي: وليكتسبوا من الإثم والكفر ما هم مكتسبون بسبب ذلك الوحي من الجن أو الأنس، وفي الآية دليل لأهل السنة في أن الله خالق الكفر والإيمان، والطاعة والمعصية، فالمعصية خلقها وقدرها، ولم يَرضهَا،\n\n[الأنبيَاء:23]\n الإشارة: كما جعل الله لكل نبي عدوًا من شياطين الإنس والجن جعل للأولياء كذلك تحويشًا لهم إليه، وتطهيرًا لهم من البقايا ليصلحوا لحضرته، قال في الحِكَم: \" إنما أجرى الأذى عليهم كي لا تكون ساكنًا إليهم، أراد أن يُزعجك عن كل شيء حتى لا يشغلك عنه شيء \"\n وقال في لطائف المنن: اعلم أن أولياء الله حكمهم في بدايتهم أن يُسلط الخلق عليهم ليطهروا من البقايا، وتكمل فيهم المزايا، كي لا يساكنوا هذا الخلق باعتماد، أو يميلوا إليهم باستناد، ومن آذاك فقد أعتقك من رق إحسانه، ومن أحسن إليك فقد استرقك بوجود امتنانه، ولذلك قال صلى الله عليه وسلم:\n\n \" من أسدى إليكم نعمًا فكافئوه، فإن لم تقدروا فادعوا له \" \n\nكل ذلك ليتخلص القلب من رق إحسان الخلق، ويتعلق بالملك الحق\n هـ\n وقال الشيخ أبو الحسن رضي الله عنه: آذاني إنسانٌ فضقت به ذرعًا، فرأيتُ يُقال لي: مِن علامة الصديقية كثرةُ أعدائها ثم لا يبالي بهم\n وقال بعضهم: الصيحة من العدو، سَوطٌ من الله يزجرُ بها القلوب إذا ساكنت غيره، وإلا رقد القلب في ظل العز والجاه، وهو حجاب عن الله تعالى عظيم\n\n\nهـ\n وقال شيخ شيوخنا سيدي على الجمل رضي الله عنه:  عداوة العدو حقًا: اشتغالك بمحبة الحبيب حقًا، وأما إذا اشتغلت بعداوة العدو نال مراده منك، وفاتتك محبة الحبيب\n وقال بعض أشياخ الشعراني في بعض وصاياه له: لا تشتغل قط بمن يؤذيك، واشتغل بالله يرده عنك فإنه هو الذي حركه عليك ليختبر دعواك في الصدق، وقد غلط في هذا الأمر خلق كثير، فاشتغلوا بأذى من آذاهم، فدام الآذى مع الإثم، ولو أنهم رجعوا إلى الله لردهم عنهم وكفاهم أمرهم\n هـ\n وهذا كله إنما يكون في البدايات، كما قال الشاذلي رضي الله عنه:  اللهم إن القوم قد حكمت عليهم بالذل حتى عزوا\n\n فإذا تمت أنوارهم وتطهرت من البقايا أسرارهم، حكَّمهم في العباد، وأذلهم لهم، فيكون العبد المجتبى سيفًا من سيوف الله، ينتصر الله به لنفسه كما نبه على ذلك في لطائف المنن\n وذلك من أسرار عدم مشروعية الجهاد من أول الإسلام تشريعًا لما ذكرنا، وتحذيرًا من الانتصار للنفس، وعدم تمحض النصرة للحق\n وعند الرسوخ في اليقين، والأمن من مزاحمة الصدق غيره، وقع الإذن في الجهاد، هذا بالنسبة إلى الصحابة الكرام، وأما النبي صلى الله عليه وسلم فكامل من أول نشأته، وإنما ذلك تشريع لغيره، وترفيع لرتبته\n والله تعالى أعلم\n ولما طلبوا من يحكم بينهم وبينه صلى الله عليه وسلم، أنزل الله: { أَفَغَيْرَ ٱللَّهِ أَبْتَغِي حَكَماً }\n\n",
      "translations": []
    }
  ]
}