{
  "chapter": "الأنعام",
  "text": "ونقلب افـدتهم وابصرهم كما لم يؤمنوا۟ به اول مرة ونذرهم فى طغينهم يعمهون",
  "translations": [
    {
      "translation": "We will overturn their hearts and sight, just as when they did not have iman in it at first, and We will abandon them to wander blindly in their excessive insolence.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall turn their hearts and their eyes, for they did not believe them at the very first, and leave them to wander perplexed in bewilderment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We are turning their hearts and eyes away from the Truth even as they did not believe in the first instance - and We leave them in their insurgence to stumble blindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will turn their hearts and vision away (from a miracle); they did not have faith (in miracles) at the first time, and We will leave them blind in their rebellion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We revert their hearts and their eyes – the way they had not believed the first time – and We leave them to keep wandering blindly in their rebellion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall turn their hearts and their eyes away, as they refused to believe therein for the first time, and We shall leave them in their trespass to wander blindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will turn their hearts and their sights, even as they did not believe in it the first time, and We will leave them in their inordinacy, blindly wandering on.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall turn about their hearts and their eyes, even as they believed not in it the first time; and We shall leave them in their insolence wandering blindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We confound their hearts and their eyes. As they believed not therein at the first, We let them wander blindly on in their contumacy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will turn away their hearts and eyes from the Truth, since they refused to believe in it in the first instance. We will let them wander blindly in their insolence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall turn aside their hearts and their eyesights, even as they believed not therein for the first time and We shall let them wander in their exorbitance perplexed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We transform their hearts and their visions as they did not believe in it the first time, and We leave them bewildered in their rebellion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We (too) shall turn to (confusion) their hearts and their eyes, even as they refused to believe in this in the first instance: We shall leave them in their trespasses, to wander in distraction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall turn their hearts and their eyes away (from guidance), as they refused to believe therein for the first time, and We shall leave them in their trespass to wander blindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will turn away their hearts and eyes since they refused to believe in it at first. We will leave them in their insolence wandering blindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We turn away their hearts and their visions, as they refused to believe in it the first time, and We leave them blundering in their rebellion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will turn away their hearts and their eyes just as they refused to believe in it the first time. And We will leave them in their transgression, wandering blindly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:110] And We shall confound their hearts, We shall turn their hearts away from the truth, so that they cannot   understand it, and their eyes, away from it, so that they do not see it and thus do not believe; just as they did not believe in it, that is, in the verses that have been revealed, the first time; and We shall leave them in their insolence, in their misguidance, wandering blindly, hesitating, perplexed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We confound their hearts and their eyes) upon the revelation of the sign such that they do not believe in it. (As they believed not therein) just as they did not believe in that which the Prophet (pbuh) informed them about the sign (at the first) before this, (We let them wander) We leave them (blindly on in their contumacy) in their disbelief and error.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف يؤمنون بها؛ إذ { نُقَلِّبُ أَفْئِدَتَهُمْ } عن الميل إلى الحق مطلقاً { وَأَبْصَٰرَهُمْ } عن إحساس شواهده وعلاماته { كَمَا } قلبناهم حيث { لَمْ يُؤْمِنُواْ بِهِ } أي: بما جاء به من الحق { أَوَّلَ مَرَّةٍ } إذ لا تفاوت بين حقية الآيات سواء كانت مقترحة أم لا { وَنَذَرُهُمْ } نمهلهم وندعهم { فِي طُغْيَانِهِمْ } أي: ظلالهم المجاوز عن الحد { يَعْمَهُونَ } [الأنعام: 110] يتحيرون ويترددون إلى أن نأخذهم وننتقم منهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ذكر سبب عدم إيمانهم فقال: { ونُقلب أفئدتهم وأبصارهم } عند نزول الآية، أي: نصرف قلوبهم ونحولها عن الحق، فلا يفقهون بها، ونقلب أبصارهم عن النظر والتفكر، فلا يُبصرون بها الحق، فيصرفون عن الإيمان بما أنزل إليك { كما لم يؤمنوا به } أي: بما أنزل من الآيات، { أول مرة ونذرهم في طغيانهم } أي: في كفرهم وجحدهم { يعمهون } أي: يتحيرون، فلا نهديهم هداية المؤمنين\n الإشارة: سألني بعض العوام، فقال لي: ليس لكم ولا لأصحابكم كرامات تظهر فيمن آذاكم، فقد كان أصحاب سيدي فلان وفلان يُظهرون الكرامات، وينفذون في من آذاهم؟‍ فقلت له: نحن على قدم نبينا صلى الله عليه وسلم، أرسله الله رحمة للعالمين، فقد أُوذي وضُرِب، فلما خيَّره ملكُ الجبال في أن يُطبق عليهم الأخشَبين ـ أي الجَبلَين ـ قال:\n\n \" لا، لعل الله تعالى يُخرج منهم مَن يعبُد الله \" \n\nوقال حين أكثروا إيذاءه:\n\n \" اللهُمَّ اغفِر لِقَومي فإنَّهُم لا يَعلَمُون \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:186",
      "similarity": 0.731784143006864
    },
    {
      "verse": "2:15",
      "similarity": 0.6091544554692236
    },
    {
      "verse": "27:4",
      "similarity": 0.5786632683142479
    },
    {
      "verse": "10:11",
      "similarity": 0.5750382877815909
    },
    {
      "verse": "15:72",
      "similarity": 0.418874908501249
    }
  ]
}