{
  "chapter": "الأنعام",
  "text": "وكذلك نولى بعض الظلمين بعضۢا بما كانوا۟ يكسبون",
  "translations": [
    {
      "translation": "In that way We make the wrongdoers friends of one another because of what they have done.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We place some sinners over others as requital for their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this manner We shall make the wrong-doers friends of each other (in the Hereafter) because they earned (evil together in the world).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We make the unjust friends of one another because of their evil deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And similarly We empower some of the oppressors over others – the recompense of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We do make the wrongdoers supporters of one another, because of that which they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We make some of the iniquitous to befriend others on account of what they earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We make the evildoers friends of each other for what they have earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We let some of the wrong-doers have power over others because of what they are wont to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in like manner We shall keep the wrongdoers close to others as a punishment for their misdeeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We shall keep some of the wrong-doers close to others for that which they were wont to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is how We make the wrongdoers one another’s friends because of what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do we make the wrong-doers turn to each other, because of what they earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We do make the Zalimun (polytheists and wrong-doers, etc.) Auliya' (supporters and helpers) one to another (in committing crimes etc.), because of that which they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We make the harmdoers guides of each other for what they have earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We make some of the wrongdoers befriend one another, because of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus will We make some of the wrongdoers allies of others for what they used to earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:129] So, just as We let the rebels from among mankind and jinn enjoy one another, We let some of the evildoers have power over others because of what they are wont to earn, of acts of disobedience.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thus We let some of the wrong-doers) the idolaters (have power over others) in the life of this world and in the Hereafter; it is also said that this means: We let some of the idolaters have authority over others (because of what they are wont to earn) and say of evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَذٰلِكَ } أي: مثل قول أولياء الإنس والجن { نُوَلِّي بَعْضَ ٱلظَّٰلِمِينَ } من الإنس { بَعْضاً } منه ليفتضحوا { بِمَا كَانُواْ يَكْسِبُونَ } [الأنعام: 129] من المظاهر بتغرير بعضهم بعضاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكذلك } أي: كما ولينا الشياطين على الكفرة، { نُوَلِّي بعض الظالمين بعضًا } أي: نَكَّل بعضهم إلى بعض، أو نجعل بعضًا يتولى بعض فيقويهم، أو: أولياءهم وقرناءهم في العذاب، كما كانوا قرناء في الدنيا، وذلك التولي والتسليط { بما كانوا يكسبون } من الكفر والمعاصي\n الإشارة: ليست الآية خاصة بالكفار، بل كان عَوَّق الناسَ عن طريق الخصوص، واستكثر من العموم بأن أبقاهم في حزبه، يقال له: يا معشر أهل الرياسة قد استكثرتم من العموم، فيقول أهل اليمين من العموم: ربنا استمتع بعضنا ببعض فتبعناهم في الوقوف مع الحظوظ والعوائد، وتمتعوا بتكثير سوادهم بنا وتنعيش رياستهم، مع ما يلحقهم من الارتفاق من قِبلنا، فيقول الحق تعالى: نار القطيعة والحجاب مثواكم خالدين فيها، إلا وقت الرؤية مع عوام الخلق، وهذه عادته تعالى: يولي بعض الغافلين بعضًا بسبب غفلتهم\n وفي قوله تعالى: { إلا ما شاء الله } ـ إرشاد إلى استعمال الأدب، وردُ الأمور كلها إلى رب الأرباب، وعدم التحكيم على غيب مشيئته وعلمه، وقوفًا مع ظاهر الوعد أو الوعيد، فالأكابر لا يقفون مع وعد ولا وعيد، كقول عيسى عليه السلام:\n\n[المَائدة:118]، وكقوله إبراهيم عليه السلام:\n\n[الأنعَام:80] الآية، وكقوله:\n\n\n\n[إبراهيم:36]، وكقول شعيب عليه السلام:\n\n[الأعرَاف:89]، وكاستغفار نبينا صلى الله عليه وسلم للمنافقين قبل نزول النهي، وبعد نزوله،\n\n[التّوبَة:80] الآية\n وكقوله، يوم بدر:\n\n \" إن تهلك هذه العصابة لن تعبد \" \n\n، مع تقدم الوعد بالنصر، وكخوف موسى بعد قوله:\n\n[طه:46] الآية\n ومنه: خوف الأكابر بعد تأمينهم لأن ظاهر الوعد والوعيد لا يقضي على باطن المشيئة والعلم، ومثله يجري في سورة هود في قوله:\n\n[هُود:107]، وفي سورة يوسف:\n\n[يُوسُف:110] بالتخفيف، وغير ذلك مما ورد في الكتاب والسنة، وانظر الورتجبي\n فقد انفرد بمقالة، بعد حكاية اتفاق مذاهب المسلمين جميعًا على عدم غفران الشرك، ولكن قول عيسى عليه السلام: { وَإِن تَغْفِرْ لَهُمْ\n\n\n } الآية، يشير إلى ما أشار إليه ابن عباس وابن مسعود في قوله تعالى:\n\n[هود:107] قال: تؤمر النار أن تأكلهم وتفنيهم، ثم يجدد خلقهم، ويرجى من كرم الله ولطفه إدخالهم بعد ذلك الجنة، قال: وهذا مرجو، ليس بمعتقد أهل السنة\n هـ\n قال في الحاشية: وهو يرجع عند التحقيق إلى طرح الأسباب وعدم الوقوف معها، نظرًا إلى أن الحق تعالى لا يتقيد في وعيد ولا وعد، فمن غلبه النظر إليه، سرى إليه الرجاء في عين التخويف، كما أنه يسري الخوف في عين الرجاء، لكونه اقتطع من الوقوف مع خصوص وصف، ولما كانت تلك الحالة هي عين الأدب اللائق بالعبودية مع الله تعالى أرشد تعالى إليها بقوله: { إلا ما شاء الله } ،\n\n[هُود:107]، وهو حال أهل الحقيقة، والوقوف مع خصوص الوعد أو الوعيد حال أهل الشريعة\n انتهى ببعض اختصار\n وقد رد الثعالبي هذه المقالة التي حكاها الورتجبي\n ثم وبخهم على عدم الإيمان بالرسل، فقال: { يَامَعْشَرَ ٱلْجِنِّ وَٱلإِنْسِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:84",
      "similarity": 0.4584642678351592
    },
    {
      "verse": "45:22",
      "similarity": 0.4560164593477021
    },
    {
      "verse": "39:50",
      "similarity": 0.41600773204964825
    },
    {
      "verse": "45:19",
      "similarity": 0.41335613434291635
    },
    {
      "verse": "10:8",
      "similarity": 0.4080167250430127
    }
  ]
}