{
  "chapter": "الأنعام",
  "text": "فمن يرد الله ان يهديه يشرح صدره للاسلم ومن يرد ان يضله يجعل صدره ضيقا حرجا كانما يصعد فى السماء كذلك يجعل الله الرجس على الذين لا يؤمنون",
  "translations": [
    {
      "translation": "When Allah desires to guide someone, He expands his breast to Islam. When He desires to misguide someone, He makes his breast narrow and constricted as if he were climbing up into the sky. That is how Allah defiles those who have no iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus God guides whomsoever He please by opening wide his breast to surrender; and Straitens the breasts of those He allows to go astray, (who feel suffocated) as if they were ascending the skies. Thus will God punish those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus, (it is a fact that) whomsoever Allah wills to guide, He opens his breast for Islam; and whomsoever He wills to let go astray, He causes his breast to become strait and constricted, as if he were climbing towards the heaven. Thus Allah lays the abomination (of flight from and hatred of Islam) on those who do not believe\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will open the hearts of whomever He wants to guide to Islam, but He will tighten the chest of one whom He has led astray, as though he was climbing high up into the sky. Thus, God places wickedness on those who do not accept the faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whomever Allah wills to guide, He opens his bosom for Islam; and whomever He wills to send astray, He makes his bosom narrow and firmly bound as if he were being forced by someone to climb the skies; this is how Allah places the punishment on those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whomsoever Allah wills to guide, He opens his breast to Islam; and whomsoever He wills to send astray, He makes his breast closed and constricted, as if he is climbing up to the sky. Thus Allah puts the wrath on those who believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore (for) whomsoever Allah intends that He would guide him aright, He expands his breast for Islam, and (for) whomsoever He intends that He should cause him to err, He makes his breast strait and narrow as though he were ascending upwards; thus does Allah lay uncleanness on those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whomsoever God desires to guide, He expands his breast to Islam; whomsoever He desires to lead astray, He makes his breast narrow, tight, as if he were climbing to heaven. So God lays abomination upon those who believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whomsoever it is Allah's will to guide, He expandeth his bosom unto the Surrender, and whomsoever it is His Will to send astray, He maketh his bosom close and narrow as if he were engaged in sheer ascent. Thus Allah layeth ignominy upon those who believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When God desires to guide someone, He opens his breast to Islam; and whoever He wills to let go astray, He causes his breast to be constricted as if he had to climb up to the skies. That is how God heaps ignominy upon those who refuse to believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So whomsoever Allah willeth that he shall guide, He expoundeth his breast for Islam; and whomsoever He willeth that he shall send astray, He maketh his breast strait, narrow, as if he were mounting up into the sky, thus Allah layeth the abomination on those who believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whomever Allah desires to guide, He opens his breast to Islam, and whomever He desires to lead astray, He makes his breast narrow and straitened as if he were climbing to a height. Thus does Allah lay [spiritual] defilement on those who do not have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom Allah (in His plan) willeth to guide,- He openeth their breast to Islam; those whom He willeth to leave straying,- He maketh their breast close and constricted, as if they had to climb up to the skies: thus doth Allah (heap) the penalty on those who refuse to believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whomsoever Allah wills to guide, He opens his breast to Islam, and whomsoever He wills to send astray, He makes his breast closed and constricted, as if he is climbing up to the sky. Thus Allah puts the wrath on those who believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whomsoever Allah desires to guide, He expands his chest to Islam (submission). Whomsoever He desires to lead astray, He makes his chest narrow, tight, as though he were climbing to heaven. As such Allah lays the scourge on the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whomever God desires to guide, He spreads open his heart to Islam; and whomever He desires to misguide, He makes his heart narrow, constricted, as though he were climbing up the sky. God thus lays defilement upon those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So whoever Allah wants to guide - He expands his breast to [contain] Islam; and whoever He wants to misguide - He makes his breast tight and constricted as though he were climbing into the sky. Thus does Allah place defilement upon those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:125] Whomever God desires to guide, He expands his breast to Islam, by casting into his heart a light which it [the heart] expands for and accepts, as reported in a hadīth; and whomever He, God, desires to send astray, He makes his breast narrow (read dayqan or dayyiqan), [unable] to accept it, and constricted, extremely tight (read harijan, ‘constricted’, as an adjective, or harajan as a verbal noun, by which it [the heart of the misguided one] is described hyperbolically) as if he were engaged in ascent (yassa‘‘ad, is also read as yassā‘ad: in both [forms] the original tā’ has been assimilated with the sād; a third [variant reading] has yas‘ad) to the heaven, when he is charged with [the obligations of] the faith, because of the hardship for him therein. So, like this making [of the breast narrow], God casts ignominy, chastisement, or [He casts] Satan, that is, He gives him authority, over those who do not believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "149 (And whomsoever it is Allah's will to guide) to His religion, (He expandeth his bosom) His heart (unto the Surrender) unto accepting Islam, (and whomsoever it is His will to send astray) to leave in error and disbelief, (He maketh his bosom) He leaves his heart (close) like the ferrule of a spear (and narrow) in doubt; this could also mean: the light cannot find a way, or a passage to his heart (as if he were engaged in sheer ascent) like a person who is told to rise in heaven: the heart of such a person is not guided to Islam. (Thus Allah layeth ignominy) Allah leaves denial (upon those) in the heart of those (who believe not) in Muhammad (pbuh), or in the Qur'an, and then He punishes them for their disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كَذٰلِكَ يَجْعَلُ ٱللَّهُ ٱلرِّجْسَ عَلَى ٱلَّذِينَ لاَ يُؤْمِنُونَ } وهو العَذَابُ\n والرِجْزُ مِثلُهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah: {Thus does Allah make the filth [of disbelief] upon those who do not believe} and that is the punishment.\n\n\nAnd the punishment is like the crime.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { فمن يرد الله أن يهديه } من هذه القوى للانقياد للعقل { يشرح صدره } أي: يسهل عليه ويجعل وجهه الذي يلي القلب ذا نتوء وسعة لقبول نوره وممكناً من استسلامه له { ومن يرد أن يضلّه يجعل صدره } يعسر عليه ويعجزه عن ذلك { حرجاً } ذا ظلمة وقصور استعداد عن قبول النور كأنما يزاول أمراً ممتنعاً في الاستنارة بنور القلب وطلب الفيض منه\n على هذا التأويل الذي ذكرناه وعلى المعنى الظاهر المراد من الآية السابقة\n فمن يرد الله أن يهديه للتوحيد يشرح صدره بقبول نور الحق وإسلام الوجود إلى الله بكشف حجب صفات نفسه عن وجه قلبه الذي يلي النفس\n فيفسح لقبول نور الحق\n ومن يرد أن يضله يجعل صدره ضيقاً حرجاً باستيلائها عليه وضغطها له { كأنما يصعد } في سماء روحه مع تلك الهيآت البدنية وذلك أمر محال\n { كذلك يجعل الله } رجس التلوّث بلوث التعلقات المادية أو رجس التعذب بالهيآت البدنية { على الذين لا يؤمنون }",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذا كان الأمر بيد الله من عنده { فَمَن يُرِدِ ٱللَّهُ أَن يَهْدِيَهُ } إلى توحيده { يَشْرَحْ صَدْرَهُ } أي: يفسحه ويوسعه { لِلإِسْلَٰمِ } أي: التفويض والاستسلام إلى حيث رضي بجميع ما قضي له\n ومتى رضي بالقضاء يسع الحق فيه فيستولي عليه فيغنيه عن هويته ويبقيه ببقائه السرمدي { وَمَن يُرِدْ أَن يُضِلَّهُ } عن فسحة توحيده { يَجْعَلْ صَدْرَهُ } الذي من شأنه أن يسع الحق فيه { ضَيِّقاً } ضنكاً { حَرَجاً } في غاية الضيف باستيلاء لوازم الإمكان عليه\n إلى حيث تضيق الأرض عليه فيتمنى الصعود إلى عالم الأسباب { كَأَنَّمَا يَصَّعَّدُ فِي ٱلسَّمَآءِ } أي: يطلب الصعود إلى السماء\n ومن غاية احتياجه واضطراره\n وهذا مثل يضرب به لمن ضاق عليه طرق معاشه { كَذٰلِكَ } أي: كحال من اضطر إلى الصعود نحو السماء { يَجْعَلُ ٱللَّهُ ٱلرِّجْسَ } أي: خذلان الإمكان والحرمان في النشأة الأخرى { عَلَى } القوم { ٱلَّذِينَ لاَ يُؤْمِنُونَ } [الأنعام: 125] بتوحيد الله وسعة لطفه وجوده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: من قرأ { حرَجًا } بالفتح\n فهو مصدر وُصف به للمبالغة\n ومن قرأ بالكسر\n فوصف\n أي: شديد الضيق\n ومن قرأ { يَصَّعَّد } بالشد والقصر\n فأصله: يتصعد\n أدغم التاء في الصاد\n ومن قرأ: { يصّاعد } فأصله: يتصاعد\n فأدغم أيضًا\n يقول الحقّ جلّ جلاله: { فمن يُرد الله أن يهديه } أي: يعرِّفه طريق الحق ويوفقه للإيمان { يشرح صدرَه } أي: يوسعه { للإسلام } \n فيتسع له\n ويقبله\n ويغتبط به\n ويبتهج\n فرحًا وسرورًا\n والشرح: كناية عن جعل النفس قابلة للحق\n مهيأة لحلوله فيها\n مصفاة عما يمنعها منه\n وإليه أشار النبي صلى الله عليه وسلم\n حين سُئل عنه\n فقال:\n \" نُورٌ يقذفه الله في قَلبِ المؤمن\n فينشرح له وينفسح \" \nقالوا: هل لذلك أمارة يعرف بها؟ قال\n \" نعم\n الإنابة إلى دار الخلود\n والتجافي عن دار الغرور\n والاستعداد للموت قبل نزول \"\n \nثم ذكر ضدَّه\n فقال: { ومن يُرد أن يضله يجعل صدره ضيقًا حرجًا } شديد الضيق\n بحيث ينبو عن قبول الحق\n فلا يدخله الإيمان\n ولا ينشرح صدره له\n بل يفر منه\n ويثقل عليه { كأنما يصَّعَّد في السماء } أي: يتكلف الصعود فيه\n شَبَّههُ ـ على وجه المبالغة ـ بمن يُحاول ما لا يقدر عليه\n فإن صعود السماء غاية فيما يبعد عن الاستطاعة\n تنبيهًا على أن الإيمان تَمَنَّع عليه كما يمتنع عليه الصعود إلى السماء\n { كذلك } أي: كما يضيق صدر الكافر ويبعد قلبه عن الحق\n { يجعل الله الرجس } أي: العذاب والخذلان\n { على الذين لا يؤمنون } \n ووضع الظاهر موضع المضمر للتعليل",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:25",
      "similarity": 0.48359731978293286
    },
    {
      "verse": "94:1",
      "similarity": 0.4818935408557439
    },
    {
      "verse": "39:22",
      "similarity": 0.41826925980560076
    },
    {
      "verse": "16:106",
      "similarity": 0.4064118098102863
    },
    {
      "verse": "7:2",
      "similarity": 0.2823986197126007
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006125.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006125.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:125.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}