{
  "chapter": "الأنعام",
  "text": "وكذلك جعلنا فى كل قرية اكبر مجرميها ليمكروا۟ فيها وما يمكرون الا بانفسهم وما يشعرون",
  "translations": [
    {
      "translation": "And likewise in every city We set up its greatest wrongdoers to plot in it. They plot against themselves alone, but they are not aware of it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus have We placed in every city the greatest of the sinners to contrive and deceive; yet they contrive against no one but themselves even though they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have appointed the leaders of the wicked ones in every land to weave their plots; but in truth they plot only to their own harm, without even realizing it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In every town We have placed some sinful leaders who always make evil plans. These plans will only work against their own souls but they do not realize this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And similarly, We have made in every town leaders among its criminals that they may conspire in it; and they do not conspire except against themselves and they do not have perception.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have set up in every town great ones of its wicked people to plot therein. But they plot not except against themselves, and they perceive (it) not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus have We made in every town the great ones to be its guilty ones, that they may plan therein; and they do not plan but against their own souls, and they do not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even so We appointed in every city great ones among its sinners, to devise there; but they devised only against themselves, and they were not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus have We made in every city great ones of its wicked ones, that they should plot therein. They do but plot against themselves, though they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have placed leaders of the wicked in every town to plot therein. Yet it is only against themselves that they scheme, though they may not perceive it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even so we set up in every town the great ones as its sinners, that they may plot therein. And they plot not but against themselves, and they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We installed in every town its major criminals that they may plot therein. Yet they do not plot except against their own souls, but they are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We placed leaders in every town, its wicked men, to plot (and burrow) therein: but they only plot against their own souls, and they perceive it not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have set up in every town great ones of its wicked people to plot therein. But they plot not except against their ownselves, and they perceive (it) not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as such we have placed in every village its archtransgressors to scheme there. But they scheme only against themselves, though they do not sense it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We set up in every city its leading wicked sinners, to conspire in it, but they conspire only against themselves, and they do not realize it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have placed within every city the greatest of its criminals to conspire therein. But they conspire not except against themselves, and they perceive [it] not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:123] And thus, in the same way that We have made the wicked folk of Mecca its leaders, We have made in every city its sinners great ones, that they may plot therein, to impede the faith; but they plot only against themselves, because the evil consequences thereof will befall them, though they do not perceive, this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على جملة : { كذلك زيّن للكافرين ما كانوا يعملون } \\[ الأنعام : 122 \\] فلها حكم الاستئناف البياني ، لبيان سبب آخر من أسباب استمرار المشركين على ضلالهم ، وذلك هو مكر أكابر قريتهم بالرّسول صلى الله عليه وسلم والمسلمين وصرفهم الحيل لصدّ الدهماء عن متابعة دعوة رسول الله صلى الله عليه وسلم والمشار إليه بقوله : { وكذلك } أولياء الشياطين بتأويل { كذلك } المذكور .والمعنى : ومِثْل هذا الجعل الذي جعلناه لمشركي مكّة جعَلنا في كلّ قرية مضت أكابرَ يصدّون عن الخير ، فشبّه أكابر المجرمين من أهل مكّة في الشرّك بأكابر المجرمين في أهل القرى في الأمَممِ الأخرى ، أي أنّ أمر هؤلاء ليس ببدع ولا خاصّ بأعداء هذا الدّين ، فإنَّه سنّة المجرمين مع الرسل الأوّلين .فالجَعل : بمعنى الخلق ووضععِ السّنن الكونيّة ، وهي سنن خلق أسباب الخير وأسباب الشرّ في كلّ مجتمع ، وبخاصّة القُرى .وفي هذا تنبيه على أنّ أهل البداوة أقرب إلى قبول الخير من أهل القرى ، لأنَّهم لبساطة طباعهم من الفطرة السّليمة ، فإذا سمعوا الخير تقبّلوه ، بخلاف أهل القرى ، فإنَّهم لتشبّثهم بعوائدهم وما ألفوه ، ينفرون من كلّ ما يغيّره عليهم ، ولهذا قال الله تعالى : { وممنّ حولكم من الأعراب منافقون ومن أهل المدينة مردوا على النّفاق } \\[ التوبة : 101 \\] فجعل النّفاق في الأعراب نفاقاً مجرّداً ، والنّفاق في أهل المدينة نفاقاً مارداً .وقد يكون الجَعل بمعنى التّصيير ، وهو تصيير خَلْق على صفة مخصوصة أو تصيير مخلوق إلى صفة بعد أن كان في صفة أخرى ، ثمّ إنّ تصارع الخير والشرّ يكون بمقدار غلبة أهل أحدهما على أهل الآخر ، فإذا غلب أهل الخير انقبض دعاة الشرّ والفساد ، وإذا انعكس الأمر انبسط دعاة الشرّ وكثروا . ومن أجل ذلك لم يزل الحكماء الأقدمون يبذلون الجهد في إيجاد المدينة الفاضلة الّتي وصفها ( أفلاطون ) في «كتابه» ، والّتي كادت أن تتحقّق صفاتها في مدينة ( أثينة ) في زمن جمهوريتها ، ولكنّها ما تحقّقت بحقّ إلاّ في مدينة الرّسول صلى الله عليه وسلم في زمانه وزمان الخلفاء الرّاشدين فيها .وقد نبّه إلى هذا المعنى قوله تعالى : { وإذَا أردْنا أن نهلك قرية أمَّرْنا مترفيها ففسقوا فيها فحقّ عليها القول فدمرناها تدميراً } \\[ الإسراء : 16 \\] على قراءة تشديد ميم : { أمَّرنا }.والأظهر في نظم الآية : أنّ { جعلنا } بمعنى خلقنا وأوجدنا ، وهو يتعدّى إلى مفعول واحد كقوله : { وجعل الظّلمات والنّور } \\[ الأنعام : 1 \\] فمفعوله : { أكابر مجرميها }.وقوله : { في كل قرية } ظرف لغو متعلّق ب { جعلنا } وإنَّما قدّم على المفعول مع أنّه دونه في التعلّق بالفعل ، لأنّ كون ذلك من شأن جميع القرى هو الأهمّ في هذا الخبر ، ليَعلم أهل مكّة أنّ حالهم جرى على سُنن أهل القرى المرسل إليها .وفي قوله : { أكبر مجرميها } إيجاز لأنَّه أغنى عن أن يقول جعلنا مُجرمين وأكابر لهم وأن أولياء الشياطين أكابر مجرمي أهل مكة ، وقوله : { ليمكروا } متعلّق ب { جعلنا } أي ليحصُل المكر ، وفيه على هذا الاحتمال تنبيه على أنّ مكرهم ليس بعظيم الشأن .ويحتمل أن يكون { جعلنا } بمعنى صيّرنا فيتعدّى إلى مفعولين هما : { أكبر مجرميها } على أنّ { مجرميها } المفعول الأوّل ، و { أكابر } مفعول ثان ، أي جعلنا مجرميها أكابر ، وقدم المفعول الثّاني للاهتمام به لغرابة شأنه ، لأنّ مصير المجرمين أكابر وسادة أمر عجيب ، إذ ليسوا بأهل للسؤدد ، كما قال طفيل الغنوي :لا يصلح النّاس فَوضى لا سَراة لهم ... ولا سَراة إذا جُهَّالهم سادواتُهدَى الأمورُ بأهل الرأي ما صَلُحت ... فإنْ تولَّتْ فبالأشرار تَنْقَادُوتقديم قوله : { في كل قرية } للغرض المذكور في تقديمه للاحتمال الأوّل . وفي هذا الاحتمال إيذان بغلبة الفساد عليهم ، وتفاقم ضرّه ، وإشعار بضرورة خروج رسول الله صلى الله عليه وسلم من تلك القرية ، وإيذان باقتراب زوال سيادة المشركين إذ تولاها المجرمون لأنّ بقاءهم على الشّرك صيّرهم مجرمين بين مَن أسلم منهم .ولعلّ كلا الاحتمالين مراد من الكلام ليفرض السّامعون كليهما ، وهذا من ضروب إعجاز القرآن كما تقدّم عند قوله تعالى : { والذين آتيناهم الكتاب يعلمون أنَّه منزل من ربّك بالحقّ فلا تكوننّ من الممترين } \\[ الأنعام : 114 \\].واللاّم في { ليمكروا } لام التّعليل ، فإنّ من جملة مراد الله تعالى من وضع نظام وجود الصّالح والفاسد ، أن يعمل الصّالح للصلاح ، وأن يعمل الفاسد للفساد ، والمكرُ من جملة الفساد ، ولام التّعليل لا تقتضي الحصر ، فللّه تعالى في إيجاد أمثالهم حِكَم جمّة ، منها هذه الحكمة ، فيظهر بذلك شرف الحقّ والصّلاح ويسطع نوره ، ويظهر انْدِحاض الباطل بين يديه بعد الصّراع الطّويل؛ ويجوز أن تكون اللام المسماةَ لام العاقبة ، وهي في التحقيق استعارة اللام لمعنى فاء التفريع كالتي في قوله تعالى : { فالتقطه آل فرعون ليكون لهم عدوّاً وحزناً } \\[ القصص : 8 \\].ودخلت مكّة في عموم : { كل قرية } وهي المقصود الأول ، لأنَّها القرية الحاضرة الّتي مُكِر فيها ، فالمقصود الخصوص . والمعنى : وكذلك جعلنا في مكّة أكابر مجرميها ليمكروا فيها كما جعلنا في كلّ قرية مثلَهم ، وإنَّما عُمّم الخبرُ لقصد تذكير المشركين في مكّة بما حلّ بالقرى من قبلها ، مثل قرية : الحِجر ، وسَبا ، والرّس ، كقوله : { تلك القرى نقص عليك من أنبائها ولقد جاءتهم رسلهم بالبيّنات فما كانوا ليؤمنوا } \\[ الأعراف : 101 \\] ، ولقصد تسلية الرّسول صلى الله عليه وسلم بأنَّه ليس ببدع من الرّسل في تكذيب قومه إيَّاه ومكرهم به ووعده بالنّصر .وقوله : { أكبر مجرميها } أكابر جمع أكبر . وأكبر اسم لعظيم القوم وسيّدهم ، يقال : ورثوا المجد أكْبَر أكْبَر ، فليست صيغة أفعل فيه مفيدة الزّيادة في الكبر لا في السِنّ ولا في الجسم ، فصار بمنزلة الاسم غير المشتقّ ، ولذلك جمع إذا أخبر به عن جمع أو وُصف به الجمع ولو كان معتبراً بمنزلة الاسم المشتقّ لكان حقّه أن يلزم الإفراد والتّذكير .وجمع على أكابر ، يقال : ملوك أكابر ، فوزن أكابر في الجمع فَعالل مثل أفاضل جمع أفضل ، وأيامِنَ وأشَائِمَ جمع أيَمن وأشأم للطّير السوانح في عرف أهل الزجر والعيافة .وأعلم أنّ اصطلاح النّحاة في موازين الجموع في باب التّكسير وفي باب ما لا ينصرف أن ينظروا إلى صورة الكلمة من غير نظر إلى الحروف الأصليّة والزائدة بخلاف اصطلاح علماء الصّرف في باب المُجرّد والمزيد . فهمزة أكبر تعتبر في الجمع كالأصلي وهي مزيدة .وفي قوله : { أكبر مجرميها } إيجاز لأنّ المعنى جعلنا في كلّ قرية مجرمين وجعلنا لهم أكابر فلمّا كان وجود أكابر يقتضي وجود من دونهم استغنى بذكر أكابر المجرمين .والمكر : إيقاع الضرّ بالغير خُفية وتحيُّلاً ، وهو من الخداع ومن المذام ، ولا يغتفر إلاّ في الحرب ، ويغتفر في السّياسة إذا لم يمكن اتّقاء الضرّ إلاّ به ، وأمّا إسناده إلى الله في قوله تعالى : { ومكرَ الله واللَّهُ خير الماكرين } \\[ آل عمران : 54 \\] فهو من المشاكلة لأنّ قبلهُ { ومكروا } \\[ آل عمران : 54 \\] ، أي مكروا بأهل الله ورسله . والمراد بالمكر هنا تحيّل زعماء المشركين على النّاس في صرفهم عن النّبيء صلى الله عليه وسلم وعن متابعة الإسلام ، قال مجاهد : كانوا جلسوا على كلّ عقبة ينفّرون النّاس عن اتّباع النّبيء صلى الله عليه وسلموقد حذف متعلِّق : { ليمكروا } لظهوره ، أي ليمكروا بالنَّبيء عليه الصلاة والسلام ظنّاً منهم بأنّ صدّ النّاس عن متابعته يضرّه ويحزنه ، وأنَّه لا يعلم بذلك ، ولعلّ هذا العمل منهم كان لما كثُر المسلمون في آخر مدّة إقامتهم بمكّة قبيل الهجرة إلى المدينة ، ولذلك قال الله تعالى : { وما يمكرون إلا بأنفسهم } ، فالواو للحال ، أي هم في مكرهم ذلك إنَّما يضرّون أنفسهم ، فأطلق المكر على مآله وهو الضرّ ، على سبيل المجاز المرسل ، فإنّ غاية المكر ومآله إضرار الممكور به ، فلمّا كان الإضرار حاصلا للماكرين دون الممكور به أطلق المكر على الإضرار .وجيء بصيغة القصر : لأنّ النّبيّء صلى الله عليه وسلم لا يلحقه أذى ولا ضرّ من صدّهم النّاس عن اتِّباعه ، ويَلحق الضرّ الماكرين ، في الدّنيا : بعذاب القتل والأسر ، وفي الآخرة : بعذاب النّار ، إنْ لم يؤمنوا فالضرّ انحصر فيهم على طريقة القصر الإضافي ، وهو قصر قلب .وقوله : { وما يشعرون } جملة حال ثانية ، فهم في حالة مكرهم بالنّبيء متّصفون بأنَّهم ما يمكرون إلاّ بأنفسهم وبأنَّهم ما يشعرون بلحاق عاقبة مكرهم بهم ، والشّعور : العلم .\n\n",
      "translations": [
        {
          "translation": "(And thus have We made in every city great ones of its wicked ones) their leaders, tyrants and wealthy citizens, as We made in the city of Mecca those who sneer and their friend, Abu Jahl and his folk, (that they should plot therein) that they should engage in transgression and corruption; it is also said that this means: so that they deny therein the prophets. (They do but plot against themselves) He says: the punishment and ruination of the transgressions and corruption they commit will be to their detriment, (though they perceive not) this.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لِيَمْكُرُواْ فِيهَا } معناه يَخْدَعَوا ويحتَالُوا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {they scheme in it}, means they deceive and plot.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وكذلك جعلنا في كل قرية } للحكمة المذكورة في إعلاء الأنبياء وكذا في قرية وجود الإنسان التي هي البدن\n جعلنا أكابر مجرميها من قوى النفس الأمّارة ليمكروا فيها بإضلال القلب وفتنته وإغوائه { وما يمكرون إلا بأنفسهم } لأن عاقبة مكرهم راجعة إليهم باحتراقهم بنيران فقدان الآلات والأسباب في جحيم الهوى والحرمان عن اللذات والشهوات وحصول الآلات الجسمانية عند خراب البدن وعند المعاد والبعث في أقبح الصور على أسوأ الأحوال\n { وإذا جاءتهم آية } من صفة قلبية وإشراق نوري من هيئة ملكية خلقية\n أو علم وحكمة وفيض من روح ينكرونها بالإعراض عنها\n ويتمنون من قبل الوهم والخيال إدراكات مثل إدراكات العقل والفكر وتركيبات تخيلية ومغالطات وهمية يعارضون بها البراهين الحقة حتى يؤمنوا بها ويذعنوا لها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَذٰلِكَ } أي: كما جعل في مكبة أكابر وصناديد يجرمون فيها جرائم عظيمة { جَعَلْنَا فِي كُلِّ قَرْيَةٍ } أي: قدرنا فيها { أَكَٰبِرَ } كانوا { مُجْرِمِيهَا } ومترفيها { لِيَمْكُرُواْ فِيهَا } بأنواع المكر والحيل ليضلوا ضعفاء العوام { وَمَا يَمْكُرُونَ } هؤلاء الماكرون { إِلاَّ بِأَنْفُسِهِمْ } لأن وبال مكرهم يعود عليهم { وَمَا يَشْعُرُونَ } [الأنعام: 123] لقساوة لقولبهم وشدة عمههم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { جعلنا } بمعنى صيَّرنا، يتعدى إلى مفعولين، و { مجرميها }: مفعول أول، مؤخر، و { أكابر }: مفعول ثان، وفيه ضعف من جهة الصناعة لأن أكابر جمع أكبر، وهو من أفعل التفضيل، فلا يستعمل إلا بالإضافة، أو مقرونًا بمن. قاله ابن جزي. قلت: ويُجاب بأنه لم يقصد به المفاضلة، وإنما المراد مطلق الوصف، أي: جعلناهم كبراء، فلا يلزم إفراده ولا اقترانه بمن. فتأمله. يقول الحقّ جلّ جلاله: { وكذلك } أي: كما جعلنا في مكة أكابر مجرميها، ليمكروا فيها بأهلها، { جعلنا في كل قرية أكابر مجرميها } أي: مجرميها أكابر، { ليمكروا فيها } بمن فيها، فيمكروا بالناس فيتبعوهم على ذلك المكر، لأنهم أكابر تصعب مخالفتهم، فيحملونهم على الكفر والعصيان، ويخذلونهم عن الإسلام والإيمان، { وما يمكرون إلا بأنفسهم } لأن وبال مكرهم راجع إليهم، { وما يشعرون } بذلك. الاشارة: إذا أراد الله بقومٍ خيرًا جعل الخير في أكابرهم: فيجعل أُمراءهم عُدولاً حُلَماء، وعلماءهم زهَّادًا أعفَّاءً، وأغنياءهم رحماء أسخياء، وصُلحاءهم قانعين أغنياء، وإذا أراد بهم شرًا جعل الشر في كبرائهم، فيجعل أمراءهم فجارًا يحكمون بالهوى، وعلماءهم حراصًا جامعين للدنيا، وأغنياءهم أشحاء قاسية قلوبهم، وصلحاءهم طماعين في الناس، منتظرين لما في أيديهم، فبهؤلاء يصلح الدين إذا صلحوا، ويفسد إذا فسدوا، وفي ذلك يقول ابن المبارك رحمه الله:\nوقد تقدم تمامه في تفسير سورة البقرة. وبالله التوفيق. ثم بيَّن حال تلك الأكابر المجرمين، فقال: { وَإِذَا جَآءَتْهُمْ آيَةٌ قَالُواْ لَن نُّؤْمِنَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:50",
      "similarity": 0.6978972571476308
    },
    {
      "verse": "71:22",
      "similarity": 0.5656068670064145
    },
    {
      "verse": "3:54",
      "similarity": 0.49240964117343117
    },
    {
      "verse": "7:99",
      "similarity": 0.4597520872989552
    },
    {
      "verse": "13:42",
      "similarity": 0.3987480101085773
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006123.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006123.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:123.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}