{
  "chapter": "الأنعام",
  "text": "واذا جاءتهم ءاية قالوا۟ لن نؤمن حتى نؤتى مثل ما اوتى رسل الله الله اعلم حيث يجعل رسالته سيصيب الذين اجرموا۟ صغار عند الله وعذاب شديدۢ بما كانوا۟ يمكرون",
  "translations": [
    {
      "translation": "When a Sign comes to them, they say, We will not have iman until we have been given the same as the Allah and a severe punishment will strike those who did wrong for the plots that they concocted.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every time a sign comes to them they say: \"We shall never believe till what God's apostles had been given comes to us.\" God knows best where to direct His messages. A degradation will befall the sinners and chastisement from God for deceiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever there comes to them a sign from Allah, they say: 'We will not believe until we are given what was given to the Messengers of Allah.' Allah knows best where to place His message. Soon shall these wicked ones meet with humiliation and severe chastigement from Allah for all their evil plotting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a miracle is shown to them, they say, \"We will not believe unless we are shown a miracle like that shown to the messengers of God.\" God knows best whom to appoint as His Messenger. The sinful ones are worthless in the sight of God and they deserve a severe punishment for their evil plans.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a sign comes to them, they say, “We will not believe until we are given the same which Allah’s Noble Messengers were given”; Allah knows best where to place His message (prophethood); soon the guilty will be afflicted with disgrace before Allah and a severe punishment due to their scheming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there comes to them a sign they say: \"We shall not believe until we receive the like of that which the Messengers of Allah received.\" Allah knows best with whom to entrust His Message. Humiliation and disgrace from Allah and a severe torment will overtake the criminals for that which they used to plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a communication comes to them they say: We will not believe till we are given the like of what Allah's apostles are given. Allah best knows where He places His message. There shall befall those who are guilty humiliation from Allah and severe chastisement because of what they planned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a sign came to them, they said, 'We will not believe until we are given the like of what God's Messengers were given.' God knows very well where to place His Message; and humiliation in God's sight shall befall the sinners, and a terrible chastisement, for what they devised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a token cometh unto them, they say: We will not believe till we are given that which Allah's messengers are given. Allah knoweth best with whom to place His message. Humiliation from Allah and heavy punishment will smite the guilty for their scheming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a sign comes to them, they say, \"We will not believe in it until we are given what God's messengers have been given. But God knows best whom to appoint as His Messenger. Humiliation before God and severe torment will befall the evil-doers for their scheming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whensoever there cometh unto them a sign, they say: we shall not believe until we are vouchsafed the like of that which is vouchsafed unto the apostles of Allah. Allah knoweth best wheresoever to place His apostleship. Anon shall befall those who have sinned vileness before Allah and severe chastisement for that which they were wont to plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a sign comes to them, they say, ‘We will not believe until we are given the like of what was given to Allah’s apostles.’ Allah knows best where to place His apostleship! Soon the guilty will be visited by a degradation and severe punishment from Allah because of the plots they used to devise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When there comes to them a sign (from Allah), They say: \"We shall not believe until we receive one (exactly) like those received by Allah's messengers.\" Allah knoweth best where (and how) to carry out His mission. Soon will the wicked be overtaken by humiliation before Allah, and a severe punishment, for all their plots.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there comes to them a sign (from Allah) they say: \"We shall not believe until we receive the like of that which the Messengers of Allah had received.\" Allah knows best with whom to place His Message. Humiliation and disgrace from Allah and a severe torment will overtake the criminals (polytheists, sinners, etc.) for that which they used to plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a sign came to them they said: 'We will not believe in it unless we are given that which the Messengers of Allah have been given' But Allah knows best where to place His Message. Humiliation with Allah shall befall the sinners as well as a terrible punishment for what they devised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a sign comes to them, they say, “We will not believe unless we are given the like of what was given to God’s messengers.” God knows best where to place His message. Humiliation from God and severe torment will afflict the criminals for their scheming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a sign comes to them, they say, \"Never will we believe until we are given like that which was given to the messengers of Allah.\" Allah is most knowing of where He places His message. There will afflict those who committed crimes debasement before Allah and severe punishment for what they used to conspire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:124] And when a sign, of the truth of the Prophet (s), comes to them, the people of Mecca, they say, ‘We will not believe, in him, until we are given the like of what God’s messengers were given’, in the way of a message and inspiration to us, because we are wealthier and more senior in years. God, exalted be He, says: God knows best where to place His Message (read plural [risālātihi, ‘His Messages’] or singular [risālatahu, ‘His Message’]; hayth, ‘where’, constitutes the direct object because of the verb [ya‘lam, ‘He knows’] implicit in a‘lam, ‘the best knower’) that is to say, He knows the right place for it to be placed in, and He thus places it   [there] — these people, however, are not worthy of it. Humiliation from God and a terrible chastisement shall smite those who have sinned, by saying this, for their plotting.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ وَإِذَا جَآءَتْهُمْ ءَايَةٌ قَالُواْ لَن نُّؤْمِنَ حتى نؤتى مِثْلَ مَآ أُوتِىَ رُسُلُ الله }.عطف على جملة : { جعلنا في كلّ قرية أكابر مجرميها } \\[ الأنعام : 123 \\] لأنّ هذا حديث عن شيء من أحوال أكابر مجرمي مكّة ، وهم المقصود من التّشبيه في قوله : { وكذلك جعلنا في كلّ قرية أكابر مجرميها . ومكّة هي المقصود من عموم كلّ قرية كما تقدّم ، فالضّمير المنصوب في قوله : جاءتهم } عائدٌ إلى { أكابر مجرميها } \\[ الأنعام : 123 \\] ، باعتبار الخاصّ المقصود من العموم ، إذ ليس قولُ : { لن نؤمن حتى نؤتي مثل ما أوتي رسل الله } بمنسوب إلى جميع أكابر المجرمين من جميع القرى .والمعنى : إذا جاءتهم آية من آيات القرآن ، أي تُليت عليهم آية فيها دعوتهم إلى الإيمان . فعبّر بالمجيء عن الإعلام بالآية أو تلاوتها تشبيها للإعلام بمجيء الدّاعي أو المرسل . والمراد أنَّهم غير مقتنعين بمعجزة القرآن ، وأنَّهم يطْلبون معجزات عَيْنية مثل معجزة موسى ومعجزة عيسى ، وهذا في معنى قولهم : { فليأتنا بآية كما أرسل الأوّلون } \\[ الأنبياء : 5 \\] لجهلهم بالحكمة الإلهيّة في تصريف المعجزات بما يناسب حال المرسل إليهم ، كما حكى الله تعالى : { وقَالوا لولا أنزل عليه آيات من ربّه قل إنَّما الآيات عند الله وإنَّما أنا نذير مبين أو لم يكفهم أنَّا أنزلنا عليك الكتاب يتلى عليهم إنّ في ذلك لرحمة وذكرى لقوم يؤمنون } \\[ العنكبوت : 50 ، 51 \\] ؛ وقال النّبيء صلى الله عليه وسلم « ما من الأنبياء نبيء إلاّ أعطي من الآيات ما مِثْلُه آمنَ عليه البشر ، وإنَّما كان الّذي أوتيتُ وحياً أوحى الله إليّ » الحديث .وأطلق على إظهار المعجزة لديهم بالإيتاء في حكاية كلامهم إذ قيل : { حتى نؤتى مثل ما أوتى رسل الله } لأنّ المعجزة لمّا كانت لإقناعهم بصدق الرّسول عليه الصّلاة والسلام أشبهت الشّيء المعطى لهم .ومعنى : { مثل ما أوتى رسل الله } مثل ما أتَى اللَّهُ الرّسلَ من المعجزات الّتي أظهروها لأقوامهم . فمرادهم الرّسل الّذين بَلغتهم أخبارهم . وقيل : قائل ذلك فريق من كبراء المشركين بمكّة ، قال الله تعالى : { بل يريد كل امرىء منهم أن يُؤتى صحفاً مُنَشَّرة } \\[ المدثر : 52 \\]. روي أنّ الوليد بن المغيرة ، قال للنّبيء صلى الله عليه وسلم لو كانت النّبوءةُ لكنتُ أولى بها منكَ لأنّي أكبرُ منك سِنّا وأكثر مالاً وولداً؛ وأنّ أبا جهل قال : زاحمَنا ( يعني بني مخزوم ) بنو عبد مناف في الشّرف ، حتّى إذا صرنا كفَرسَيْ رِهاننٍ قالوا : مِنّا نبيء يُوحى إليه ، والله لا نرضى به ولا نتّبعه أبداً إلاّ أن يأتينا وحي كما يأتيه . فكانت هذه الآية مشيرة إلى ما صدر من هذين ، وعلى هذا يكون المراد حتّى يأتينا وَحْي كما يأتي الرّسلَ .أو يكون المراد برسل الله جميع الرّسل ، فعدلوا عن أن يقولوا مثل ما أوتي محمّد صلى الله عليه وسلم لأنّهم لا يؤمنون بأنّه يأتيه وحي .ومعنى { نؤتى } على هذا الوجه نعطى مثل ما أعطي الرّسل ، وهو الوحي . أو أرادوا برسل الله محمّداً صلى الله عليه وسلم فعبّروا عنه بصيغة الجمع تعريضاً ، كما يقال : إنّ ناساً يقولون كذا ، والمراد شخص معيّن ، ومنه قوله تعالى : { كذبت قوم نوح المرسلين } \\[ الشعراء : 105 \\] ونحوه ، ويكون إطلاقهم عليه : { رسل الله } تهكّماً به صلى الله عليه وسلم كما حكاه الله عنهم في قوله : { وقالوا يأيُّها الذي نُزِّل عليه الذكر إنَّك لمجنون } \\[ الحجر : 6 \\] وقوله : { إنّ رسولكم الذي أرسل إليكم لمجنون } \\[ الشعراء : 27 \\].{ الله أَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهُ }.اعتراض للردّ على قولهم : { حتى نؤتى مثل ما أوتى رسل الله } على كلا الاحتمالين في تفسير قولهم ذلك .فعلى الوَجه الأوّل : في معنى قولهم : { حتى نؤتى مثل ما أوتى رسل الله } يكون قوله : { الله أعلم حيث يجعل رسالته } ردّاً بأنّ الله أعلم بالمعجزات اللائقة بالقوم المرسَل إليهم؛ فتكون { حيث } مجازاً في المكان الاعتباري للمعجزة ، وهم القوم الذين يُظهرها أحد منهم ، جُعلوا كأنَّهم مكان لظهور المعجزة . والرّسالات مطلقة على المعجزات لأنَّها شبيهة برسالة يرسلها الله إلى النّاس ، وقريب من هذا قول علماء الكلام : وجهُ دلالة المعجزة على صدق الرّسول صلى الله عليه وسلم أنّ المعجزة قائمة مقام قول الله : « صدق هذا الرسولُ فيما أخبر به عني » بأمارةِ أنِّي أخرق العادة دليلاً على تصديقه .وعلى الوجه الثّاني : في معنى قولهم : { حتى نؤتى مثل ما أوتى رسل الله } ، يكون قوله : { الله أعلم حيث يجعل رسالته } ردّاً عليهم بأنّ الرّسالة لا تُعطى بسؤال سائِلها ، مع التّعريض بأنّ أمثالهم ليسوا بأهل لها ، فما صْدَقُ { حيث } الشّخصُ الّذي اصطفاه الله لرسالته .و { حيث } هنا اسم دالّ على المكان مستعارة للمبعوث بالرّسالة ، بناء على تشبيه الرّسالة بالوديعة الموضوعة بمكان أمانة ، على طريقة الاستعارة المكنيّة . وإثباتُ المكان تخييل ، وهو استعارة أخرى مصرّحة بتشبيه الرّسل بمكان إقامة الرّسالة . وليست { حيث } هنا ظرفاً بل هي اسم للمكان مجرّد عن الظرفية ، لأنّ { حيث } ظرف متصرّف ، على رأي المحقّقين من النّحاة ، فهي هنا في محلّ نصب بنزع الخافض وهو الباء ، لأن { أعلم } اسم تفضيل لا ينصب المفعول ، وذلك كقوله تعالى : { إنّ ربّك هو أعلم من يضلّ عن سبيله } \\[ الأنعام : 117 \\] كما تقدّم آنفاً .وجملة { يجعل رسالته } صفة ل { حيث } إذا كانت { حيث } مجرّدة عن الظرفية . ويتعيّن أن يكون رابط جملة الصّفة بالموصوف محذوفاً ، والتّقدير : حيث يجعل فيه رسالاته .وقد أفادت الآية : أنّ الرّسالة ليست ممّا يُنال بالأماني ولا بالتشهّي ، ولكن الله يعلم مَن يصلح لها ومن لا يصلح ، ولو علم من يصلح لها وأراد إرساله لأرسله ، فإنّ النّفوس متفاوتة في قبول الفيض الإلهي والاستعداد له والطّاقة على الاضطلاع بحمله ، فلا تصلح للرّسالة إلاّ نفس خُلقت قريبة من النّفوس الملكيّة ، بعيدة عن رذائل الحيوانية ، سليمة من الأدواء القلبية .فالآية دالّة على أنّ الرّسول يُخلق خِلقة مناسبة لمراد الله من إرساله ، والله حين خلقه عالم بأنّه سَيرسله ، وقد يخلق الله نفوساً صالحة للرّسالة ولا تكون حكمةٌ في إرسال أربابها ، فالاستعداد مهيِّيء لاصطفاء الله تعالى ، وليس موجِبا له ، وذلك معنى قول بعض المتكلّمين : إنّ الاستعداد الذّاتي ليس بموجب للرّسالة خلافاً للفلاسفة ، ولعلّ مراد الفلاسفة لا يبعد عن مراد المتكلّمين . وقد أشار ابنُ سينا في «الإشارات» إلى شيء من هذا في النّمط التّاسع .وفي قوله : { الله أعلم حيث يجعل رسالته } بيان لعظيم مقدار النبي صلى الله عليه وسلم وتنبيه لانحطاط نفوس سادة المشركين عن نوال مرتبة النّبوءة وانعدام استعدادهم ، كما قيل في المثل «ليس بعُشِّككِ فادْرُجي» .وقرأ الجمهور : { رسالاته } بالجمع وقرأ ابن كثير ، وحفص عن عاصم بالإفراد ولمّا كان المراد الجنس استوى الجمع والمفرد .{ سَيُصِيبُ الذين أَجْرَمُواْ صَغَارٌ عِندَ الله وَعَذَابٌ شَدِيدٌ بِمَا كَانُواْ يَمْكُرُونَ }.استئناف ناشىء عن قوله : { ليمكروا فيها } \\[ الأنعام : 123 \\] وهو وعيد لهم على مكرهم وقولهم : { لن نؤمن حتى نؤتى مثل ما أوتى رسل الله }.فالمراد بالّذين أجرموا أكابر المجرمين من المشركين بمكّة بقرينة قوله : { بما كانوا يمكرون } فإنّ صفة المكر أثبتت لأكابر المجرمين في الآية السّابقة ، وذكرهم ب { الّذين أجرموا } إظهار في مقام الإضمار لأنّ مقتضى الظاهر أنّ يقال : سيصيبهم صغار ، وإنَّما خولف مقتضى الظاهر للإتيان بالموصول حتّى يوميء إلى علّة بناء الخبر على الصّلة ، أي إنَّما أصابهم صغار وعذاب لإجرامهم .والصّغَار بفتح الصّاد الذلّ ، وهو مشتقّ من الصِّغَر ، وهو القماءة ونقصان الشيء عن مقدار أمثاله .وقد جعل الله عقابهم ذلاّ وعذاباً : ليناسب كِبْرهم وعُتُوّهم وعصيانهم الله تعالى . والصّغار والعذاب يحصلان لهم في الدّنيا بالهزيمة وزوال السّيادة وعذاب القتل والأسر والخوف ، قال تعالى : { قُل هل تربصون بنا إلاّ إحدى الحسنيين ونحن نتربّص بكم أن يصيبكم الله بعذاب من عنده أو بأيدينا } \\[ التوبة : 52 \\] وقد حصل الأمران يوم بدر ويوم أحُد ، فهلكت سادة المشركين ، وفي الآخرة بإهانتهم بين أهل المحشر ، وعذابهم في جهنم .ومعنى { عند الله } أنَّه صغار مقدّر عند الله ، فهو صغار ثابت محقّق ، لأنّ الشّيء الّذي يجعله الله تعالى يحصل أثره عند النّاس كلّهم ، لأنَّه تكوين لا يفارق صاحبه ، كما ورد في الحديث : \" إنّ الله إذا أحبّ عبداً أمر جبريل فأحبّه ثمّ أمر الملائكة فأحبّوه ثمّ يوضع له القبول عند أهل الأرض \" فلا حاجة إلى تقدير ( مِنْ ) في قوله : { عند الله } ، ولا إلى جعل العندية بمعنى الحصول في الآخرة كما درج عليه كثير من المفسّرين .والباء في : { بما كانوا يمكرون } سببيّة . و ( ما ) مصدريّة : أي بسبب مكرهم ، أي فعلهم المكر ، أو موصولة : أي بسبب الّذي كانوا يمكرونه ، على أنّ المراد بالمكر الاسم ، فيقدر عائدٌ منصوبٌ هو مفعول به محذوف .\n\n",
      "translations": [
        {
          "translation": "(And when a token cometh unto them) when a verse comes down from heaven informing of what al-Walid Ibn al-Mughirah, 'Abd Yalayl and Abu Mas'ud al-Thaqafi were doing, (they say: We will not believe) in this verse (till we are given) the Scripture like (that which Allah's messengers are given) meaning Muhammad (pbuh). (Allah knoweth best with whom to place His message) He knows best to whom He sends Gabriel with His message. (Humiliation) degradation and abasement (from Allah and heavy punishment will smite the guilty) the idolaters, i.e. al-Walid and his friends (for their scheming) for their denial of the messengers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { سَيُصِيبُ ٱلَّذِينَ أَجْرَمُواْ صَغَارٌ } وهو أَشَدُّ الذُّلِّ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"Those who are guilty will be afflicted with a severe punishment,\" is the most severe of all.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { الله أعلم حيث يجعل رسالته } لا يضعها إلا مواضعها من القوى الروحانية المجرّدة من المواد الهيولانية { سيصيب الذين أجرموا } باحتجابهم ومكرهم في إضلالهم من استعدّ للهدى أو اهتدى من القلوب الصافية { صغار عند الله } بزوال قدرتهم وتمكنهم بخراب البدن { وعذاب شديد } بحرمانهم عما يلائمهم ووصول ما ينافيهم في المعاد الجسماني بسبب مكرهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من غاية جهلهم ونهاية قسوتهم { إِذَا جَآءَتْهُمْ آيَةٌ } هادية لهم إلى سبيل الرشاد { قَالُواْ } من غاية بغضهم وعنادهم: { لَن نُّؤْمِنَ } بها { حَتَّىٰ نُؤْتَىٰ مِثْلَ مَآ أُوتِيَ } من يدعي أنهم { رُسُلُ ٱللَّهِ } إذ نحن وهم سواء في البشرية وأولى منهم في الرئاسة والنسب\n فكيف يؤتى لهم ولم يؤتَ إلينا؟ قل لهم يا أكمل الرسل: الوحي والإيتاء بيد الله يؤتي من يشاء ويمنع ممن يشاء\n إذ { ٱللَّهُ أَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهُ } لا يعتبر عنده الرئاسة والنسب بلا تفضلاً على من تفضل من عباده بلا التفات إلى نسبه وحسبه يقدر قابليته واستعداده\n المقدر له من عنده في سابق علمه\n\n[النمل: 70] ويقولون إذ { سَيُصِيبُ ٱلَّذِينَ أَجْرَمُواْ } مغرورين على رئاستهم وجهلهم ونسبهم { صَغَارٌ } مذلة وهوان { عِندَ ٱللَّهِ } حين إحضارهم الحساب والجزاء { وَ } بعدما كشف حالهم وحسابهم لهم { عَذَابٌ شَدِيدٌ بِمَا كَانُواْ يَمْكُرُونَ } [الأنعام: 124]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { حيث }: مفعول بفعل مقدر، لا بأعلم لأن أفعل التفضيل لا ينصب المفعول به، أي: يعلم حيث يجعل رسالته، أي: يعلم المكان الذي يصلح للرسالة، إلا إن أوِّلَ أفعل بما لا تفضيل فيه، فينتصب المفعول به، ويحتمل أن يكون هذا منه، قال أبو حيان: ويحتمل أن تكون حيث على بابها من الظرفية المجازية، ويُضَمَّنُ أعلم معنى يتعدى إلى الظرف، والتقدير: الله أنفذ علمًا حيث يجعل رسالته. انظر المحشي. يقول الحقّ جلّ جلاله: { وإذا جاءتهم } أي: هؤلاء المجرمين الأكابر، { آية } نزلت على نبي، { قالوا لن نؤمن } بها { حتى نُؤتى } من النبوة { مثل ما أُوتي رسلُ الله } ، فنكون أنبياء مثلهم، والقائل لهذه المقالة أبو جهل، قال: تزاحمنا: بنو عبد مناف الشرف مع بني هاشم، حتى إذا صِرنا كَفَرَسَى رهان، قالو: منا نبي يوحى إليه، والله لا نرضى به إلا أن يأتينا وحي كما يأتيه، فنزلت الآية. وقيل: في الوليد بن المغيرة، قال: أنا أولى بالنبوة من محمد. فرد الله على من قال ذلك بقوله: { اللهُ أعلَمُ حَيثُ يَجعَلُ رِسَالَتَهُ }. فَعَلِم أن محمدًا صلى الله عليه وسلم أهل للرسالة، فخصه بها، وعلم أنهم ليسوا بأهل لها، فحرمهم إياها، فإن النبوة ليست بمجرد النسب والمال، وإنما هي بفضائل نفسانية يَخُصُّ الله بها من يشاء من عباده، بل بمحض الفضل والكرم، فيجتبى لرسالته من علم أنه يصلح لها، وهو أعلم بالمكان الذي فيه يضعها. ثم ذكر وعيد المنكرين، فقال: { سيصيب الذين أجرموا صغار عند الله } أي: ذل وحقارة يوم القيامة، بعد تكبرهم وارتفاعهم في الدنيا. رُوِي \" أنهم يُبعثون في صورة الذَّرِّ، يطؤهم الناس في المَحشَر \". { و } يصيبهم { عذاب شديد بما كانوا يمكرون } أي: بسبب مكرهم، أو جزاء مكرهم. كما تدين تدان. الإشارة: ما حَرَم الناسَ من الخير إلا خصلتان: التكبر والحسد، فمن طهر قلبه من الحسد، وتواضع لكل أحد، نال الرفعة والشرف عند الله في الدنيا والآخرة، ولا يضع الله سر الخصوصية إلا في قلب طاهر متواضع، يحط صاحبه رأسه لأقدام الرجال، ويذل نفسه لأهل الصفاء والكمال، وفي ذلك يقول الشاعر:\nفكما أن الحق تعالى علم حيث يجعل رسالته، علم حيث يجعل سر ولايته، وهي النفوس المتواضعة المتطهرة من رذائل النفوس كالحسد والكبر وسائر الأوصاف المذمومة. ثم ذكر علامة الهداية والشقاء، فقالِ: { فَمَن يُرِدِ ٱللَّهُ أَن يَهْدِيَهُ يَشْرَحْ صَدْرَهُ لِلإِسْلاَمِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "54:53",
      "similarity": 0.3756740300074445
    },
    {
      "verse": "9:29",
      "similarity": 0.36499179273165294
    },
    {
      "verse": "27:37",
      "similarity": 0.3541167846365415
    },
    {
      "verse": "16:45",
      "similarity": 0.3337971534297427
    },
    {
      "verse": "7:13",
      "similarity": 0.32757644745392867
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006124.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006124.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:124.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}