{
  "chapter": "الأنعام",
  "text": "قل لمن ما فى السموت والارض قل لله كتب على نفسه الرحمة ليجمعنكم الى يوم القيمة لا ريب فيه الذين خسروا۟ انفسهم فهم لا يؤمنون",
  "translations": [
    {
      "translation": "Say: 'To whom does everything in the heavens and earth belong?' Say: 'To Allah.' He has made mercy incumbent on Himself. He will gather you to the Day of Rising about which there is no doubt. As for those who have lost their own selves, they have no iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask: \"To whom belongs what is in the heavens and the earth?\" Say: \"To God.\" He has prescribed grace for Himself. He will gather you on the Day of Resurrection which is certain to come. Only they who are lost of soul will not come to believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask thern: 'To whom belongs all that is in the heavens and on the earth?' Say: 'Everything belongs to Allah.' He has bound Himself to the exercise of mercy (and thus does not chastise you for your disobedience and excesses instantly). Surely He will gather you all together on the Day of Resurrection - the coming of which is beyond doubt; but those who have courted their own ruin are not going to believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them, \"Who is the owner of the heavens and the earth besides God, the All-merciful, who will gather you all together on the Day of Judgment? That day will certainly come. Those who have lost their souls will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “To Whom does all whatever is in the heavens and the earth, belong?” Proclaim, “To Allah”; He has made mercy obligatory upon His grace; undoubtedly, He will surely gather you all together on the Day of Resurrection in which there is no doubt; those who put their souls to ruin, do not accept faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"To whom belongs all that is in the heavens and the earth\" Say: \"To Allah.\" He has prescribed mercy for Himself. Indeed He will gather you together on the Day of Resurrection, about which there is no doubt. Those who destroy themselves will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: To whom belongs what is in the heavens and the earth? Say: To Allah; He has ordained mercy on Himself; most certainly He will gather you on the resurrection day-- there is no doubt about it. (As for) those who have lost their souls, they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'To whom belongs what is in the heavens and in the earth?' Say: 'It is God's. He has prescribed for Himself mercy. He will surely gather you to the Resurrection Day, of which is no doubt. Those who have lost their souls, they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Unto whom belongeth whatsoever is in the heavens and the earth? Say: Unto Allah. He hath prescribed for Himself mercy, that He may bring you all together to the Day of Resurrection whereof there is no doubt. Those who ruin their souls will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"To whom belongs all that is in the heavens and earth?\" Say, \"To God. He has taken it upon Himself to be merciful. That He will gather you on the Day of Resurrection is beyond all doubt. Those who have forfeited their souls will never have faith.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: whose is whatsoever is in the heavens and the earth? Say thou: Allah's. He hath prescribed mercy for Himself. Surely He shall gather you together on the Day of Judgement whereof there is no doubt. Those who have lost themselves shall not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘To whom belongs whatever is in the heavens and the earth?’ Say, ‘To Allah. He has made mercy incumbent upon Himself. He will surely gather you on the Day of Resurrection, in which there is no doubt. Those who have ruined their souls will not have faith.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"To whom belongeth all that is in the heavens and on earth?\" Say: \"To Allah. He hath inscribed for Himself (the rule of) Mercy. That He will gather you together for the Day of Judgment, there is no doubt whatever. It is they who have lost their own souls, that will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"To whom belongs all that is in the heavens and the earth?\" Say: \"To Allah. He has prescribed Mercy for Himself. Indeed He will gather you together on the Day of Resurrection, about which there is no doubt. Those who destroy themselves will not believe [in Allah as being the only Ilah (God), and Muhammad SAW as being one of His Messengers, and in Resurrection, etc.].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'To whom belongs that which is in the heavens and the earth' Say: 'To Allah. He has written for Himself mercy, and will gather you on the Day ofResurrection in which there is no doubt. Those who have lost their souls, they do not believe'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “To whom belongs what is in the heavens and the earth?” Say, “To God.” He has inscribed for Himself mercy. He will gather you to the Day of Resurrection, in which there is no doubt. Those who lost their souls do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"To whom belongs whatever is in the heavens and earth?\" Say, \"To Allah.\" He has decreed upon Himself mercy. He will surely assemble you for the Day of Resurrection, about which there is no doubt. Those who will lose themselves [that Day] do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:12] Say: ‘To whom belongs what is in the heavens and in the earth?’ Say: ‘To God, for even if they do not say this, there is no other response. He has prescribed, He has decreed, for Himself mercy, as a bounty from Him — this is a gentle summoning of them to the faith. He will surely gather you together on the Day of Resurrection of which there is no doubt, no uncertainty, in order to requite you for your deeds. Those who have forfeited their own souls (this is the subject) — by exposing them to the chastisement — they do not believe (this is the predicate).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the people of Mecca: (Unto whom belongeth whatsoever is in the heavens and the earth) of created beings? If they answer you, fine; if not, (Say: Unto Allah) belongs the creation of the heavens and the earth. (He hath prescribed for Himself mercy) for the Community of Muhammad (pbuh) in deferring His punishment, (that He may bring you all together) by Allah, He will bring you all together (to a Day) to the Day of Judgement (whereof there is no doubt. Those who ruin their own souls) as well as their dwellings, servants and spouses in Paradise (will not believe) in Muhammad and the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱلَّذِينَ خَسِرُوۤاْ أَنْفُسَهُمْ } معناهُ غَشُّوا أَنفُسَهُمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {those who have lost themselves} [means] they have covered themselves.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُل } لهم يا أكمل الرسل تبكيتاً وإلزاماً: { لِّمَن مَّا } ظهر { فِي ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } تصرفاً وتملكاً إيجاداً وإظهاراً وإعداماً وإفناءً { قُل } أيضاً أنت يا أكمل الرسل بعدما بُهتوا وتحيروا في الجواب: { للَّهِ } المتوحد المتفرد بالتجلي والظهور والتصرف مطلقاً\n إذ { كَتَبَ } أوجب وألزم { عَلَىٰ نَفْسِهِ } أي: ذاته حين كان ولم يكن معه شيء { ٱلرَّحْمَةَ } العامة\n أي: التجلي باسم الرحمن على عروش ذرائر الأكوان المنعكسة من أوصافه الذاتية\n والله { لَيَجْمَعَنَّكُمْ } أيها العكوس والأضلال بمقتضى اسم الرحيم { إِلَىٰ يَوْمِ ٱلْقِيَٰمَةِ } التي هي الطامة الكبرى المرتفعة فيها نقوش الغير والسوى مطلقاً { لاَ رَيْبَ فِيهِ } أي: في جمعه ورفعه عند أولي البصائر المتأملين في سر الظهور والإظهار\n وأما { ٱلَّذِينَ خَسِرُوۤاْ أَنْفُسَهُمْ } باقتصار النظر في هذه الأضلال والتماثيل الزائفة الزائلة التي لا قرار لها ولا مدار للذاتها وشهواتها { فَهُمْ لاَ يُؤْمِنُونَ } [الأنعام: 12] بالرجوع إلى ما في التوحيد ومقر التجريد والتفريد\n أولئك هم الظالمون في تيه الحرمان\n الباقون في ظلمة الإمكان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: جملة { ليجمعنّكم }: مقطوعة\n جواب لقسَم محذوف\n وقيل: بدل من الرحمة\n وهو ضعيف لدخول النون الثقيلة في غير موضعها\n و \" إلى \": هنا\n للغاية\n كما تقول: جمعتُ القوم إلى داري\n وقيل: بمعنى \" في \" و { الذين خسروا }: مبتدأ\n وجملة: { فهم لا يؤمنون }: خبر\n و { له ما سكن }: عطف على { لله } \n وهو إما من السكنى فلا حذف\n أو من السكون\n فيكون حذف المعطوف\n أي: ما سكن وتحرَّك\n يقول الحقّ جلّ جلاله: { قل } للمشركين يا محمد: { لمن ما في السماوات والأرض } خلقًا وملكًا وعبيدًا؟\n { قل } لهم هو: { لله } لا لغيره والقصد بالآية: إقامة البرهان على التوحيد وإبطال الشرك\n وجاء ذلك بصيغة الاستفهام لإقامة الحجة على الكفار\n فسأل أولاً\n ثم أجاب عن سؤاله بنفسه لأنَّ الكفار يُوافقون على ذلك ضرورة\n فثبت أن الإله الحق هو الذي له ما في السماوات والأرض\n وإنما يحسُن أن يكون السائلُ مجيبًا إذا عُلِم أن خَصمَه لا يخالفُه في الجواب الذي يقيم به الحجة عليه\n ثم دعاهم إلى الإيمان والتوبة بتلطُّف وإحسان فقال: { كتب على نفسه الرحمة }\n[الأنعام:54] كما في الآية الأخرى\n والكتابةُ هنا عبارة عن القضاء السابق\n وقد فسرها رسول الله صلى الله عليه وسلم بقوله:\n \" إنَّ اللهَ كتَبَ كتابًا قبلَ أن يَخلُقَ السَّماواتِ والإرضَ فَهُوَ عِندَه \" وفيه: \" أنَّ رَحمَتِي سبقَت غَضَبي \" \n وفي رواية: \" تَغّلِبُ غضبي \"\n \nقال البيضاوي: { كتب على نفسه الرحمة } أي: التزمها تفضلاً وإحسانًا\n والمراد بالرحمة: ما يعُمُّ الدارين\n ومن ذلك: الهداية إلى معرفته\n والعلم بتوحيده\n بنصب الأدلة\n وإنزال الكتب والإمهال على الكفر\n هـ\n ثم ذكر محل ظهور هذه الرحمة\n فقال: واللهِ { ليجمعنّكم إلى يوم القيامة } أي: ليجمعنكم من القبور مبعوثين إلى يوم القيامة فيُجازي أهل التوبة والإيمان\n ويعاقب أهل الشرك والكفران\n { لا ريب } في ذلك اليوم\n أو في ذلك الجمع\n فيظهر أهل الخسران من أهل الإحسان\n ولذلك قال: { الذين خسروا أنفسهم } بتضييع رأس مالهم\n وهو النظر الصحيح الموجِب للإيمان والتوحيد { فهم لا يؤمنون } حتى أدركهم الموت فلا خسران أعظم من ذلك\n ودخلت الفاء في الخبر للدلالة على أن عدم إيمانهم مسبّب عن خسرانهم فإن إبطال النظر\n والانهماك في التقليد واتباع الوهم\n أدَّى بهم إلى الإصرار على الكفر\n والامتناع من الإيمان إلى الممات\n فخسروا أولاً بتضييع النظر\n فتسبب عنه عدم الإيمان",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:87",
      "similarity": 0.5798520707739081
    },
    {
      "verse": "3:9",
      "similarity": 0.5534336600271913
    },
    {
      "verse": "45:26",
      "similarity": 0.5407475191900255
    },
    {
      "verse": "32:2",
      "similarity": 0.5342821397235875
    },
    {
      "verse": "2:2",
      "similarity": 0.5233761062948933
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/6:12.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/6:12.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}