{
  "chapter": "الأنعام",
  "text": "لهم دار السلم عند ربهم وهو وليهم بما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "They will have the Abode of Peace with their Lord. He is their Protector because of what they have done.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them is an abode of peace with their Lord. He will be their defender as reward for what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Theirs shall be an abode of peace with their Lord - their Protector - in recompense for all they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will live in peace with God. God protects them as a reward for their deeds; He is their Guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them is the abode of peace with their Lord and He is their Master – the result of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them will be the abode of peace with their Lord. And He will be their Wali because of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall have the abode of peace with their Lord, and He is their guardian because of what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Theirs is the abode of peace with their Lord, and He is their Protector for that they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them is the abode of peace with their Lord. He will be their Protecting Friend because of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall dwell in the Home of Peace with their Lord; He will be their Protector as a recompense for what they have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them is an abode of peace with their Lord; and He shall be their patron for that which they have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them shall be the abode of peace near their Lord and He will be their guardian because of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them will be a home of peace in the presence of their Lord: He will be their friend, because they practised (righteousness).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them will be the home of peace (Paradise) with their Lord. And He will be their Wali (Helper and Protector) because of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Theirs is the abode of peace with their Lord. He is their Guardian for what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them is the Home of Peace with their Lord, and He is their Master—because of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For them will be the Home of Peace with their Lord. And He will be their protecting friend because of what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:127] Theirs will be the abode of peace, namely, Paradise, with their Lord, and He will be their Friend because of what they used to do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(For them) for the believers (is the abode of peace with their Lord) Peace (al-Salam) is Allah and His abode is Paradise. (He be their Protecting Friend) who bestows upon them honour and reward (because of what they used to do) and say of goodness in the life of this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ لَهُمْ دَارُ ٱلسَّلَٰمِ } أي: مقام التفويض والاستسلام { عِندَ رَبِّهِمْ } بعدما تحققوا بتوحيده { وَهُوَ } بذاته { وَلِيُّهُمْ } ومولى أمورهم { بِمَا كَانُواْ يَعْمَلُونَ } [الأنعام: 127] أي: بجميع ما كانوا يعملون من الأعمال\n إذ هو سمعهم وبصرهم ويدهم ورجلهم وجميع جوارحهم التي صدرت عنها أعمالهم على ما نطق الحديث القدسي صلوات الله وسلامه على قائله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { لهم دار السلام } التي هي الجنة. والسلام اسم الحق تعالى، وأضافها إلى نفسه تعظيمًا لها، أو دار السلامة من المكاره، أو دار التحية\n[إبراهيم:23 يونس:10]، { عند ربهم } ذخيرة لهم عنده حين يقدمون عليه، لا يعلم كنهها غيره، أو في ضمانه وكفالته، { وهو وليهمُ } أي: مولاهم وناصرهم في الدارين، { بما كانوا يعملون } أي: بسبب أعمالهم، أي: تولاهم بسبب أعمالهم الصالحة، فيحفظهم في الدنيا، هم وذريتهم، ويحفظهم في الآخرة كذلك.  الإشارة: من هداه الله لطريق الخصوصية، واستعمله في الوصول إليها، ووصله إلى من يسيره إليها، فقد دخل دار السلام قبل موته، فللَّه جنتان جنة المعارف وجنة الزخارف، من دخل جنة المعارف لم يشتق إلى جنة الزخارف، لأن الله تولاه وأغناه عما سواه. ثم ذكر ما أعد لأهل الخذلان، فقال: { وَيَوْمَ يِحْشُرُهُمْ جَمِيعاً يَامَعْشَرَ ٱلْجِنِّ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "13:24",
      "similarity": 0.5329885552305456
    },
    {
      "verse": "10:25",
      "similarity": 0.4988579305438062
    },
    {
      "verse": "28:37",
      "similarity": 0.41518872968823606
    },
    {
      "verse": "38:46",
      "similarity": 0.3875738665201142
    },
    {
      "verse": "71:26",
      "similarity": 0.3464895587612382
    }
  ]
}