{
  "chapter": "الأنعام",
  "text": "واذا جاءتهم ءاية قالوا۟ لن نؤمن حتى نؤتى مثل ما اوتى رسل الله الله اعلم حيث يجعل رسالته سيصيب الذين اجرموا۟ صغار عند الله وعذاب شديدۢ بما كانوا۟ يمكرون",
  "translations": [
    {
      "translation": "When a Sign comes to them, they say, We will not have iman until we have been given the same as the Allah and a severe punishment will strike those who did wrong for the plots that they concocted.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every time a sign comes to them they say: \"We shall never believe till what God's apostles had been given comes to us.\" God knows best where to direct His messages. A degradation will befall the sinners and chastisement from God for deceiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever there comes to them a sign from Allah, they say: 'We will not believe until we are given what was given to the Messengers of Allah.' Allah knows best where to place His message. Soon shall these wicked ones meet with humiliation and severe chastigement from Allah for all their evil plotting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a miracle is shown to them, they say, \"We will not believe unless we are shown a miracle like that shown to the messengers of God.\" God knows best whom to appoint as His Messenger. The sinful ones are worthless in the sight of God and they deserve a severe punishment for their evil plans.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a sign comes to them, they say, “We will not believe until we are given the same which Allah’s Noble Messengers were given”; Allah knows best where to place His message (prophethood); soon the guilty will be afflicted with disgrace before Allah and a severe punishment due to their scheming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there comes to them a sign they say: \"We shall not believe until we receive the like of that which the Messengers of Allah received.\" Allah knows best with whom to entrust His Message. Humiliation and disgrace from Allah and a severe torment will overtake the criminals for that which they used to plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a communication comes to them they say: We will not believe till we are given the like of what Allah's apostles are given. Allah best knows where He places His message. There shall befall those who are guilty humiliation from Allah and severe chastisement because of what they planned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a sign came to them, they said, 'We will not believe until we are given the like of what God's Messengers were given.' God knows very well where to place His Message; and humiliation in God's sight shall befall the sinners, and a terrible chastisement, for what they devised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a token cometh unto them, they say: We will not believe till we are given that which Allah's messengers are given. Allah knoweth best with whom to place His message. Humiliation from Allah and heavy punishment will smite the guilty for their scheming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a sign comes to them, they say, \"We will not believe in it until we are given what God's messengers have been given. But God knows best whom to appoint as His Messenger. Humiliation before God and severe torment will befall the evil-doers for their scheming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whensoever there cometh unto them a sign, they say: we shall not believe until we are vouchsafed the like of that which is vouchsafed unto the apostles of Allah. Allah knoweth best wheresoever to place His apostleship. Anon shall befall those who have sinned vileness before Allah and severe chastisement for that which they were wont to plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a sign comes to them, they say, ‘We will not believe until we are given the like of what was given to Allah’s apostles.’ Allah knows best where to place His apostleship! Soon the guilty will be visited by a degradation and severe punishment from Allah because of the plots they used to devise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When there comes to them a sign (from Allah), They say: \"We shall not believe until we receive one (exactly) like those received by Allah's messengers.\" Allah knoweth best where (and how) to carry out His mission. Soon will the wicked be overtaken by humiliation before Allah, and a severe punishment, for all their plots.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when there comes to them a sign (from Allah) they say: \"We shall not believe until we receive the like of that which the Messengers of Allah had received.\" Allah knows best with whom to place His Message. Humiliation and disgrace from Allah and a severe torment will overtake the criminals (polytheists, sinners, etc.) for that which they used to plot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a sign came to them they said: 'We will not believe in it unless we are given that which the Messengers of Allah have been given' But Allah knows best where to place His Message. Humiliation with Allah shall befall the sinners as well as a terrible punishment for what they devised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a sign comes to them, they say, “We will not believe unless we are given the like of what was given to God’s messengers.” God knows best where to place His message. Humiliation from God and severe torment will afflict the criminals for their scheming.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a sign comes to them, they say, \"Never will we believe until we are given like that which was given to the messengers of Allah.\" Allah is most knowing of where He places His message. There will afflict those who committed crimes debasement before Allah and severe punishment for what they used to conspire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:124] And when a sign, of the truth of the Prophet (s), comes to them, the people of Mecca, they say, ‘We will not believe, in him, until we are given the like of what God’s messengers were given’, in the way of a message and inspiration to us, because we are wealthier and more senior in years. God, exalted be He, says: God knows best where to place His Message (read plural [risālātihi, ‘His Messages’] or singular [risālatahu, ‘His Message’]; hayth, ‘where’, constitutes the direct object because of the verb [ya‘lam, ‘He knows’] implicit in a‘lam, ‘the best knower’) that is to say, He knows the right place for it to be placed in, and He thus places it   [there] — these people, however, are not worthy of it. Humiliation from God and a terrible chastisement shall smite those who have sinned, by saying this, for their plotting.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when a token cometh unto them) when a verse comes down from heaven informing of what al-Walid Ibn al-Mughirah, 'Abd Yalayl and Abu Mas'ud al-Thaqafi were doing, (they say: We will not believe) in this verse (till we are given) the Scripture like (that which Allah's messengers are given) meaning Muhammad (pbuh). (Allah knoweth best with whom to place His message) He knows best to whom He sends Gabriel with His message. (Humiliation) degradation and abasement (from Allah and heavy punishment will smite the guilty) the idolaters, i.e. al-Walid and his friends (for their scheming) for their denial of the messengers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { سَيُصِيبُ ٱلَّذِينَ أَجْرَمُواْ صَغَارٌ } وهو أَشَدُّ الذُّلِّ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"Those who are guilty will be afflicted with a severe punishment,\" is the most severe of all.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من غاية جهلهم ونهاية قسوتهم { إِذَا جَآءَتْهُمْ آيَةٌ } هادية لهم إلى سبيل الرشاد { قَالُواْ } من غاية بغضهم وعنادهم: { لَن نُّؤْمِنَ } بها { حَتَّىٰ نُؤْتَىٰ مِثْلَ مَآ أُوتِيَ } من يدعي أنهم { رُسُلُ ٱللَّهِ } إذ نحن وهم سواء في البشرية وأولى منهم في الرئاسة والنسب، فكيف يؤتى لهم ولم يؤتَ إلينا؟ قل لهم يا أكمل الرسل: الوحي والإيتاء بيد الله يؤتي من يشاء ويمنع ممن يشاء؛ إذ { ٱللَّهُ أَعْلَمُ حَيْثُ يَجْعَلُ رِسَالَتَهُ } لا يعتبر عنده الرئاسة والنسب بلا تفضلاً على من تفضل من عباده بلا التفات إلى نسبه وحسبه يقدر قابليته واستعداده، المقدر له من عنده في سابق علمه،\n\n[النمل: 70] ويقولون إذ { سَيُصِيبُ ٱلَّذِينَ أَجْرَمُواْ } مغرورين على رئاستهم وجهلهم ونسبهم { صَغَارٌ } مذلة وهوان { عِندَ ٱللَّهِ } حين إحضارهم الحساب والجزاء { وَ } بعدما كشف حالهم وحسابهم لهم { عَذَابٌ شَدِيدٌ بِمَا كَانُواْ يَمْكُرُونَ } [الأنعام: 124]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { حيث }: مفعول بفعل مقدر، لا بأعلم لأن أفعل التفضيل لا ينصب المفعول به، أي: يعلم حيث يجعل رسالته، أي: يعلم المكان الذي يصلح للرسالة، إلا إن أوِّلَ أفعل بما لا تفضيل فيه، فينتصب المفعول به، ويحتمل أن يكون هذا منه، قال أبو حيان: ويحتمل أن تكون حيث على بابها من الظرفية المجازية، ويُضَمَّنُ أعلم معنى يتعدى إلى الظرف، والتقدير: الله أنفذ علمًا حيث يجعل رسالته\n انظر المحشي\n يقول الحقّ جلّ جلاله: { وإذا جاءتهم } أي: هؤلاء المجرمين الأكابر، { آية } نزلت على نبي، { قالوا لن نؤمن } بها { حتى نُؤتى } من النبوة { مثل ما أُوتي رسلُ الله } ، فنكون أنبياء مثلهم، والقائل لهذه المقالة أبو جهل، قال: تزاحمنا: بنو عبد مناف الشرف مع بني هاشم، حتى إذا صِرنا كَفَرَسَى رهان، قالو: منا نبي يوحى إليه، والله لا نرضى به إلا أن يأتينا وحي كما يأتيه، فنزلت الآية\n وقيل: في الوليد بن المغيرة، قال: أنا أولى بالنبوة من محمد\n فرد الله على من قال ذلك بقوله: { اللهُ أعلَمُ حَيثُ يَجعَلُ رِسَالَتَهُ }\n فَعَلِم أن محمدًا صلى الله عليه وسلم أهل للرسالة، فخصه بها، وعلم أنهم ليسوا بأهل لها، فحرمهم إياها، فإن النبوة ليست بمجرد النسب والمال، وإنما هي بفضائل نفسانية يَخُصُّ الله بها من يشاء من عباده، بل بمحض الفضل والكرم، فيجتبى لرسالته من علم أنه يصلح لها، وهو أعلم بالمكان الذي فيه يضعها\n ثم ذكر وعيد المنكرين، فقال: { سيصيب الذين أجرموا صغار عند الله } أي: ذل وحقارة يوم القيامة، بعد تكبرهم وارتفاعهم في الدنيا\n رُوِي \" أنهم يُبعثون في صورة الذَّرِّ، يطؤهم الناس في المَحشَر \"\n { و } يصيبهم { عذاب شديد بما كانوا يمكرون } أي: بسبب مكرهم، أو جزاء مكرهم\n كما تدين تدان\n الإشارة: ما حَرَم الناسَ من الخير إلا خصلتان: التكبر والحسد، فمن طهر قلبه من الحسد، وتواضع لكل أحد، نال الرفعة والشرف عند الله في الدنيا والآخرة، ولا يضع الله سر الخصوصية إلا في قلب طاهر متواضع، يحط صاحبه رأسه لأقدام الرجال، ويذل نفسه لأهل الصفاء والكمال، وفي ذلك يقول الشاعر:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "54:53",
      "similarity": 0.3756740300074445
    },
    {
      "verse": "9:29",
      "similarity": 0.36499179273165294
    },
    {
      "verse": "27:37",
      "similarity": 0.3541167846365415
    },
    {
      "verse": "16:45",
      "similarity": 0.3337971534297427
    },
    {
      "verse": "7:13",
      "similarity": 0.32757644745392867
    }
  ]
}