{
  "chapter": "الأنعام",
  "text": "اومن كان ميتا فاحيينه وجعلنا له نورا يمشى به فى الناس كمن مثله فى الظلمت ليس بخارج منها كذلك زين للكفرين ما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "Is someone who was dead and whom We brought to life, supplying him with a light by which to walk among people, the same as someone who is in utter darkness, unable to emerge from it? That is how what they were doing is made to seem attractive to the kafirun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can he who was lifeless, to whom We gave life, and gave him a light in whose glow he walks among men, be like him who is used to darkness from which he can never emerge? Thus have been their doings made attractive to unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who was dead and whom We raised to life, and We set a light for him to walk among men - is he like the one steeped in darkness out of which he does not come out?. Thus have their own doings been made to seem fair to the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can the dead to whom We have given life and light so that they may walk among the people, be considered equal to those who can never come out of darkness? The deeds of the unbelievers are made to seem attractive to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And will the one who was dead and so We raised him to life and set for him a light with which he walks among the people, ever be like the one who is in realms of darkness never to emerge from them? Similarly, the deeds of disbelievers are made to appear good to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who was dead, and We gave him life, and set for him a light, whereby he can walk among men -- like him who is in the darkness from which he can never come out Thus it is made fair seeming to the disbelievers that which they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who was dead then We raised him to life and made for him a light by which he walks among the people, like him whose likeness is that of one in utter darkness whence he cannot come forth? Thus what they did was made fair seeming to the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why, is he who was dead, and We gave him life, and appointed for him a light to walk by among the people as one whose likeness is in the shadows, and comes not forth from them? So it is decked out fair to the unbelievers the things they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who was dead and We have raised him unto life, and set for him a light wherein he walketh among men, as him whose similitude is in utter darkness whence he cannot emerge? Thus is their conduct made fairseeming for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can he who was dead, to whom We gave life, and a light whereby he could walk among people be like him who is in utter darkness from which he can never emerge? Thus the deeds of those who deny the truth have been made fair-seeming to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who was dead, and We quickened him and appointed for him a light whereby he walketh among mankind, like unto him whose similitude is that he is in darknesses forth from which he cannot come? Even so is made fair-seeming to the infidels that which they are wont to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who was lifeless, then We gave him life and provided him with a light by which he walks among the people, like one who dwells in a manifold darkness which he cannot leave? To the faithless is thus presented as decorous what they have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Can he who was dead, to whom We gave life, and a light whereby he can walk amongst men, be like him who is in the depths of darkness, from which he can never come out? Thus to those without faith their own deeds seem pleasing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who was dead (without Faith by ignorance and disbelief) and We gave him life (by knowledge and Faith) and set for him a light (of Belief) whereby he can walk amongst men, like him who is in the darkness (of disbelief, polytheism and hypocrisy) from which he can never come out? Thus it is made fair-seeming to the disbelievers that which they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who was dead whom We have revived and given a light with which he walks among people to be compared to him who blunders about in darkness from which he will never emerge? As such what the unbelievers have done appear decorated to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is he who was dead, then We gave him life, and made for him a light by which he walks among the people, like he who is in total darkness, and cannot get out of it? Thus the doings of disbelievers are made to appear good to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And is one who was dead and We gave him life and made for him light by which to walk among the people like one who is in darkness, never to emerge therefrom? Thus it has been made pleasing to the disbelievers that which they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:122] The following was revealed regarding Abū Jahl and others: Why, is he who was dead, through unbelief, and We gave him life, through guidance, and appointed for him a light by which to walk among people, distinguishing thereby the truth from falsehood — this [light] being faith — as him whose likeness (ka-man mathaluhu: mathal, ‘likeness’, is extra; in other words, [read] ka-man huwa, ‘as him who’) is in darkness whence he cannot emerge? — and this is the disbeliever — No! So, in the same way that faith has been adorned for believers, what the disbelievers have been doing, in the way of disbelief and acts of disobedience, has been adorned for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is he who was dead) i.e. the disbeliever; this verse was revealed about 'Ammar Ibn Yasir, Abu Jahl Ibn Hisham (and We have raised him unto life) and We honoured him with faith, referring to 'Ammar Ibn Yasir, (and set for him a light) knowledge (wherein he walketh) wherein he is guided (among men) it is also said that (and set for him a light) means: We set for him a light on the Bridge over hell in the midst of people, (as him whose similitude is in utter darkness) the error of disbelief in this world and the darkness of Gehenna on the Day of Judgement, the reference here is to Abu Jahl (whence he cannot emerge) he cannot free himself from disbelief and error in this world nor from the darkness in the Hereafter? (Thus is their conduct made fair-seeming for the disbelievers) thus We made his works seem fair to Abu Jahl.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوَ مَن كَانَ } منكم { مَيْتاً } بالجهل والكفر { فَأَحْيَيْنَٰهُ } بالمعرفة والإيمان { وَجَعَلْنَا لَهُ نُوراً يَمْشِي بِهِ فِي ٱلنَّاسِ } هداياً منيراً كان { كَمَن مَّثَلُهُ } وصفه وشأنه { فِي ٱلظُّلُمَٰتِ } المتراكمة والمتزاحمة وهي ظلمة الجهل والكفر والعصيان، واعتقاده أنه { لَيْسَ بِخَارِجٍ مِّنْهَا } لعدم تناهيها فأنقذه الله من ظلمة الضلالة بنور الهداية وهداء إلى صراط مستقيم هو الإسلام { كَذَلِكَ } أي: مثل تزيين الإيمان للمؤمن { زُيِّنَ لِلْكَٰفِرِينَ مَا كَانُواْ يَعْمَلُونَ } [الأنعام: 122] من الكفر والعصيان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "57:28",
      "similarity": 0.3665288682764668
    },
    {
      "verse": "38:6",
      "similarity": 0.3546148239187067
    },
    {
      "verse": "17:95",
      "similarity": 0.34761834598117497
    },
    {
      "verse": "32:26",
      "similarity": 0.3403937042153722
    },
    {
      "verse": "28:25",
      "similarity": 0.33320571010017946
    }
  ]
}