{
  "chapter": "الأنعام",
  "text": "وهذا صرط ربك مستقيما قد فصلنا الءايت لقوم يذكرون",
  "translations": [
    {
      "translation": "This is the path of your Lord - straight. We have made the Signs clear for people who remember.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the straight path of your Lord. Distinct have We made Our signs for those who reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "even though this way is the straight way of your Lord, and We have distinguished its signs to those who heed to admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the path of your Lord and it is straight. We have explained Our revelations to those who take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is the Straight Path of your Lord; We have explained in detail Our verses for the people who accept advice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is the path of your Lord leading straight. We have detailed Our Ayat for a people who take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is the path of your Lord, (a) right (path); indeed We have made the communications clear for a people who mind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the path of thy Lord; straight; We have distinguished the signs to a people who remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the path of thy Lord, a straight path. We have detailed Our revelations for a people who take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the straight path leading to your Lord. We have made the signs clear for thinking men.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is the path of thine Lord, straight. We have surely detailed the revelations unto a people who would be admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the straight path of your Lord. We have already elaborated the signs for a people who take admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the way of thy Lord, leading straight: We have detailed the signs for those who receive admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is the Path of your Lord (the Quran and Islam) leading Straight. We have detailed Our Revelations for a people who take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Path of your Lord, a Straight Path. We have made plain Our verses to a nation who remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the straight path of your Lord. We have explained the revelations in detail for people who recollect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is the path of your Lord, [leading] straight. We have detailed the verses for a people who remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:126] And this, [path] that you follow, O Muhammad (s), is the path of your Lord, a straight one, with no crookedness therein (mustaqīman, ‘straight’, is in the accusative because it is a circumstantial qualifier emphasising the [previous] statement, and it is operated by the import of the demonstrative noun [hādhā, ‘this’]). We have detailed, We have elucidated, the signs for a people who remember (yadhdhakkarūn: the original tā’ has been assimilated with the dhāl), that is to say, [a people] who heed admonition — such [people] are singled out for mention because they are the ones to profit [from the signs].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(This is the path of thy Lord) this is the doing of your Lord, (a straight path) a just path; it is also said this means: This Islam is the religion of your Lord which He is pleased with; it is straight and well established. (We have detailed Our revelations) i.e. the Qur'an, by explaining the commands and prohibitions, the causes of humiliation and the reasons for honour (for a people who take heed) for a people who understand and therefore believe. It is also said that (And whomsoever it is Allah's will to guide) was revealed about the Prophet (pbuh) and Abu Jahl; it is also said to have been revealed about 'Ammar Ibn Yasir and Abu Jahl.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَهَـٰذَا } أي: ما أنزلنا إليك يا أكمل الرسل من القرآن المبين لطريق المعرفة والإيقان { صِرَاطُ رَبِّكَ مُسْتَقِيماً } لا عوج فيها أصلاً موصلاً إلى توحيده { قَدْ فَصَّلْنَا } وأوضحنا فيما أنزلناه إليك { ٱلآيَاتِ } الدالة على توحيدنا { لِقَوْمٍ يَذَّكَّرُونَ } [الأنعام: 126] يتعظون بها ويتذكرون مبدأهم الذي ينشئون منه ويظهرون عنه وهو الوحدة الذاتية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:41",
      "similarity": 0.604510594954156
    },
    {
      "verse": "3:51",
      "similarity": 0.5996699283886391
    },
    {
      "verse": "19:36",
      "similarity": 0.5996699283886391
    },
    {
      "verse": "43:64",
      "similarity": 0.5996699283886391
    },
    {
      "verse": "36:61",
      "similarity": 0.584356385000233
    }
  ]
}