{
  "chapter": "الأنعام",
  "text": "ولا تاكلوا۟ مما لم يذكر اسم الله عليه وانه لفسق وان الشيطين ليوحون الى اوليائهم ليجدلوكم وان اطعتموهم انكم لمشركون",
  "translations": [
    {
      "translation": "Do not eat anything over which the name of Allah has not been mentioned. To do so is sheer deviance. The shaytans inspire their friends to dispute with you. If you obeyed them you would then be idolaters.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not eat of that over which God's name has not been pronounced, for that would amount to exceeding the limits of law. Certainly the devils inspire their proteges to dispute with you: If you obey them, you will surely become an idolater.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not eat of (the animal) over which the name of Allah has not been pronounced (at the time of its slaughtering), for that is a transgression. And behold, the evil ones do inspire doubts and objections into the hearts of their friends so that they dispute with you; but if you obey them, you will surely yourselves turn into those who associate others with Allah in His divinity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not eat the flesh of an animal which has been slaughtered without a mention of the Name of God; it is a sinful deed. Satan teaches his friends to argue with you. If you obey them, you will certainly be idol worshippers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not eat that on which Allah’s name has not been mentioned, and indeed that is disobedience; and undoubtedly the devils inspire in the hearts of their friends to fight with you; and if you obey them, you are then polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat not of that on which Allah's Name has not been pronounced, for surely it is disobedience. And certainly, the Shayatin do inspire their friends to dispute with you, and if you obey them, then you would indeed be polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not eat of that on which Allah's name has not been mentioned, and that is most surely a transgression; and most surely the Shaitans suggest to their friends that they should contend with you; and if you obey them, you shall most surely be polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And eat not of that over which God's Name has not been mentioned; it is ungodliness. The Satans inspire their friends to dispute with you; if you obey them, you are idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And eat not of that whereon Allah's name hath not been mentioned, for lo! it is abomination. Lo! the devils do inspire their minions to dispute with you. But if ye obey them, ye will be in truth idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and do not eat anything over which God's name has not been pronounced, for that surely is disobedience. The devils inspire their followers to argue with you. If you obey them, you will become of those who associate partners with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And eat not of that whereon the name of Allah hath not been pronounced; for verily that is a departure. Verily the Satans are ever inspiring their friends that they may wrangle with you; and were ye to obey them, verily ye shall become associaters indeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not eat [anything] of that over which Allah’s Name has not been mentioned, and that is indeed transgression. Indeed the satans inspire their friends to dispute with you; and if you obey them, you will indeed be polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat not of (meats) on which Allah's name hath not been pronounced: That would be impiety. But the evil ones ever inspire their friends to contend with you if ye were to obey them, ye would indeed be Pagans.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eat not (O believers) of that (meat) on which Allah's Name has not been pronounced (at the time of the slaughtering of the animal), for sure it is Fisq (a sin and disobedience of Allah). And certainly, the Shayatin (devils) do inspire their friends (from mankind) to dispute with you, and if you obey them [by making Al-Maytatah (a dead animal) legal by eating it], then you would indeed be Mushrikun (polytheists) [because they (devils and their friends) made lawful to you to eat that which Allah has made unlawful to eat and you obeyed them by considering it lawful to eat, and by doing so you worshipped them, and to worship others besides Allah is polytheism].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not eat from that which the Name of Allah has not been mentioned, for it is a sin. The satans will reveal to their guided ones to argue with you. If you obey them, you shall indeed become idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not eat from that over which the Name of God was not pronounced, for it is abomination. The devils inspire their followers to argue with you; but if you obey them, you would be polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not eat of that upon which the name of Allah has not been mentioned, for indeed, it is grave disobedience. And indeed do the devils inspire their allies [among men] to dispute with you. And if you were to obey them, indeed, you would be associators [of others with Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:121] And do not eat from that over which God’s Name has not been invoked, where it has died or been sacrificed to other than His Name — otherwise, what a Muslim sacrifices and does not invoke God’s Name over, whether intentionally or forgetfully, is lawful, as was stated by Ibn ‘Abbās, and this is the opinion of al-Shāfi‘ī — verily it, the eating thereof, is wickedness, a contravention of what is lawful. And truly the devils inspire, whisper [to], their friends, the disbelievers, to dispute with you, in deeming carrion lawful; and if you obey them, in this [matter], you are truly idolaters.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And eat not of that whereon Allah's name hath not been mentioned) of immolated animals intentionally, (for lo! it is abomination) i.e. eating it without a necessity is a sin and declaring it lawful, in denial of the revelation, is an act of disbelief. (Lo! the devils do inspire) whisper to (their minions) Abu'l-Ahwas and his folk (to dispute with you) regarding the consumption of the meat of carrion, idolatry and about the angels being the daughters of Allah. (But if you obey them) in their idolatry and the consumption of the meat of carrion, declaring it lawful without being in dire need of it, (ye will be in truth idolaters) like them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ تَأْكُلُواْ مِمَّا لَمْ يُذْكَرِ ٱسْمُ ٱللَّهِ عَلَيْهِ } حين ذبحه { وَإِنَّهُ } أي: أكلكم منه { لَفِسْقٌ } خروج عن حكم الله بمتابعة أهل الأهواء الضالين عن طريق الحق بوسوسة الشياطين\n ولا تغفلوا من وسوستهم { وَإِنَّ ٱلشَّيَٰطِينَ لَيُوحُونَ } يلقون ويسوسون { إِلَىۤ أَوْلِيَآئِهِمْ } من أهل الأهواء { لِيُجَٰدِلُوكُمْ } أيها المؤمنون حتى يضلوكم عن طريق الحق سيما في المآكل والمشارب { وَإِنْ أَطَعْتُمُوهُمْ إِنَّكُمْ لَمُشْرِكُونَ } [الأنعام: 121] لأنه من أطاع غير الله فقد أشرك به\n\n\n{ أَوَ مَن كَانَ } منكم { مَيْتاً } بالجهل والكفر { فَأَحْيَيْنَٰهُ } بالمعرفة والإيمان { وَجَعَلْنَا لَهُ نُوراً يَمْشِي بِهِ فِي ٱلنَّاسِ } هداياً منيراً كان { كَمَن مَّثَلُهُ } وصفه وشأنه { فِي ٱلظُّلُمَٰتِ } المتراكمة والمتزاحمة وهي ظلمة الجهل والكفر والعصيان",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { ولا تأكلوا مما لم يُذكر اسم الله عليه } \n بأن ترك التسمية عليه عمدًا لا سهوًا كما هو مذهب مالك وأبي حنيفة\n وقال الشافعي: تؤكل مطلقًا\n لقوله ـ عليه الصلاة والسلام ـ:\n \" ذَبِيحَةُ المُسلِم حَلالٌّ وإن لَم يُذكَر اسمُ اللهِ عَلَيهِ \" \n\n وقال أحمد وداود: لا تؤكل إن تركت مطلقًا\n عمدًا أو سهوًا\n وقال ابن جزي: إنما جاء الكلام في سياق تحريم الميتة وغيرها مما ذُبح للنُصب\n فإن حملناه على ذلك لم يكن فيه دليل على وجوب التسمية في ذبائح المسلمين\n وإن حملناه على عمومه كان فيه دليل على ذلك\n وقال عطاء: هذه الآية أمر بذكر الله على الذبح والأكل والشرب\n هـ\n  { وإنه } أي: الأكل مما لم يُذكر اسم الله عليه { لفسق } أو: وإنه ـ أي: عدم ذكر اسم الله على الذبيحة\n لفسق ومن تزيين الشياطين\n { إن الشياطين ليُوحون } ليوسوسون { إلى أوليائهم } من الكفار { ليُجادلوكم } بقولهم: إنكم تأكلون ما قتلتم أنتم وجوارحكم وتدعون ما قتله الله\n وهذا يؤيد أن المراد بما لم يذكر اسم الله عليه هو الميتة\n { وإنْ أطعتموهم } في استحلال ما حرمتُ عليكم\n { إنكم لمشركون } مثلهم\n لأن مَن أحلّ ما حرّم الله فقد كفر\n والجواب عن شبهتهم: أن الذكاة تطهير لخبث الميتة\n مع ضرب من التعبّد\n الإشارة: ليس المراد من التسمية على الطعام أو غيره مجرد اللفظ\n وإنما المراد حضور المسمى\n وهو شهود المنعم في تلك النعمة لأن الوقت الذي يغلب فيه حظ النفس\n ينبغي للذاكر المتيقظ أن يغلب فيه جانب الحق\n فيكون تناوله لتلك النعمة بالله من الله إلى الله\n وهذا هو المقصود من الأمر بذكر اسم الله\n لأن الاسم عين المسمى في التحقيق\n فإن كان الأكل أو غيره مما شرعت التسمية في أوله\n على هذا التيقظ\n فهو طائع لله وعابد له في أكله وشربه\n وسائر أحواله\n وإن كان غافلاً عن هذا\n فأكله فسق\n قال تعالى: { وَلا تَأكُلُوا مِمَّا لَم يُذكَرِ اسمُ اللهِ عَلَيهِ وَإنَّهُ لَفسقٌ } \n سبب ذلك: غلبة الغفلة\n\nوالغفلة من وحي الشيطان\n { وإن الشياطين ليوحون إلى أوليائهم }\n أو: ولا تنظروا إلى الأشياء بعين الفرق والغفلة\n بل اذكروا اسم الله عليها وكلوها بفكرتكم { ولا تأكلوا مما لم يذكر اسم الله } عليه من الأشياء فإنه غفلة وفسق في الشهود\n وقوله تعالى: { وَذَرُوا ظاهِرَ الإثمِ } هو ما ظهر على الجوارح من الذنوب\n وقوله: { وباطنه } هو ما كمن في السرائر من العيوب\n والله تعالى أعلم\n ثم حذر من الشرك والكفر\n فقال: { أَوَ مَن كَانَ مَيْتاً فَأَحْيَيْنَاهُ وَجَعَلْنَا لَهُ نُوراً يَمْشِي بِهِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:68",
      "similarity": 0.44718614946758883
    },
    {
      "verse": "22:8",
      "similarity": 0.40515564544351135
    },
    {
      "verse": "16:111",
      "similarity": 0.3806456939639492
    },
    {
      "verse": "29:46",
      "similarity": 0.3693274780553153
    },
    {
      "verse": "4:109",
      "similarity": 0.35887817613758
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006121.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006121.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:121.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}