{
  "chapter": "الأنعام",
  "text": "وذروا۟ ظهر الاثم وباطنه ان الذين يكسبون الاثم سيجزون بما كانوا۟ يقترفون",
  "translations": [
    {
      "translation": "Abandon wrong action, outward and inward. Those who commit wrong action will be repaid for what they perpetrated.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Discard both the visible and invisible sin. For those who sin will be punished for what they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abstain from sin, be it either open or secret. Indeed those who commit sins shall surely be requited for all they have done.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Stay away from both public and secret sins for a sinner will suffer for whatever he has committed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And give up the open and hidden sins; those who earn sins will soon receive the punishment of their earnings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave sin, open and secret. Verily, those who commit sin will get due recompense for that which they used to commit.) Mujahid said that,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And abandon open and secret sin; surely they who earn sin shall be recompensed with what they earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forsake the outward sin, and the inward surely the earners of sin shall be recompensed for what they have earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forsake the outwardness of sin and the inwardness thereof. Lo! those who garner sin will be awarded that which they have earned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eschew all sin, open or secret: Those who commit sin will receive due punishment for their sins,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And leave the outside of sin and the inside thereof; verily those who earn sin, anon will they be requited for that which they were wont to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Renounce outward sins and the inward ones. Indeed those who commit sins shall be requited for what they used to commit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Eschew all sin, open or secret: those who earn sin will get due recompense for their \"earnings.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave (O mankind, all kinds of) sin, open and secret. Verily, those who commit sin will get due recompense for that which they used to commit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forsake the revealed and hidden sin. Those who earn sin shall be recompensed for what they have committed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So abandon sin, outward and inward. Those who commit sins will be repaid for what they used to perpetrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And leave what is apparent of sin and what is concealed thereof. Indeed, those who earn [blame for] sin will be recompensed for that which they used to commit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:120] And forsake, leave, outward aspect of sin and its inward aspect, that is, what is overt of it and what is secret — it is said that ‘sin’ here means fornication, or, it is said, any act of disobedience; surely those who earn sin shall be requited, in the Hereafter, for what they used to perpetrate, [what] they used to earn.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Forsake the outwardness of sin) the adultery of the outward (and the inwardness thereof) secret adultery, i.e. taking lovers in secret. (Lo! those who garner sin) those who commit adultery (will be awarded) a lashing in this world and punishment in the Hereafter because of (that which they have earned) i.e. committing adultery.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَذَرُواْ } أيها المؤمنون { ظَٰهِرَ ٱلإِثْمِ } أي: الإقدام عليه والاتصاف به { وَبَاطِنَهُ } أي: أخطاره وإجراءه على القلب { إِنَّ ٱلَّذِينَ يَكْسِبُونَ ٱلإِثْمَ } ويميون إليه متلذذين { سَيُجْزَوْنَ } في النشأة الأخرى { بِمَا كَانُواْ يَقْتَرِفُونَ } [الأنعام: 120] أي: بمقدار ما يتلذذون",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وذَرُوا } أي: اتركوا { ظاهرَ الإثم وباطنه } أي: سره وعلانيته\n أو ما يتعلق بالجوارح والقلب\n { إن الذين يكسبون الإثم } سرًا أو علانية\n { سيُجزون بما كانوا يقترفون } يكتسبون\n ولما أمرهم بأكل الحلال نهاهم عن الحرام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:23",
      "similarity": 0.6441209076441785
    },
    {
      "verse": "6:113",
      "similarity": 0.4084524721735678
    },
    {
      "verse": "7:33",
      "similarity": 0.2770501221532897
    },
    {
      "verse": "57:3",
      "similarity": 0.2489519532406754
    },
    {
      "verse": "9:24",
      "similarity": 0.24107068799741177
    }
  ]
}