{
  "chapter": "الأنعام",
  "text": "وكذلك جعلنا فى كل قرية اكبر مجرميها ليمكروا۟ فيها وما يمكرون الا بانفسهم وما يشعرون",
  "translations": [
    {
      "translation": "And likewise in every city We set up its greatest wrongdoers to plot in it. They plot against themselves alone, but they are not aware of it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus have We placed in every city the greatest of the sinners to contrive and deceive; yet they contrive against no one but themselves even though they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have appointed the leaders of the wicked ones in every land to weave their plots; but in truth they plot only to their own harm, without even realizing it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In every town We have placed some sinful leaders who always make evil plans. These plans will only work against their own souls but they do not realize this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And similarly, We have made in every town leaders among its criminals that they may conspire in it; and they do not conspire except against themselves and they do not have perception.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have set up in every town great ones of its wicked people to plot therein. But they plot not except against themselves, and they perceive (it) not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus have We made in every town the great ones to be its guilty ones, that they may plan therein; and they do not plan but against their own souls, and they do not perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even so We appointed in every city great ones among its sinners, to devise there; but they devised only against themselves, and they were not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus have We made in every city great ones of its wicked ones, that they should plot therein. They do but plot against themselves, though they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have placed leaders of the wicked in every town to plot therein. Yet it is only against themselves that they scheme, though they may not perceive it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even so we set up in every town the great ones as its sinners, that they may plot therein. And they plot not but against themselves, and they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We installed in every town its major criminals that they may plot therein. Yet they do not plot except against their own souls, but they are not aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have We placed leaders in every town, its wicked men, to plot (and burrow) therein: but they only plot against their own souls, and they perceive it not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have set up in every town great ones of its wicked people to plot therein. But they plot not except against their ownselves, and they perceive (it) not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as such we have placed in every village its archtransgressors to scheme there. But they scheme only against themselves, though they do not sense it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We set up in every city its leading wicked sinners, to conspire in it, but they conspire only against themselves, and they do not realize it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have placed within every city the greatest of its criminals to conspire therein. But they conspire not except against themselves, and they perceive [it] not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:123] And thus, in the same way that We have made the wicked folk of Mecca its leaders, We have made in every city its sinners great ones, that they may plot therein, to impede the faith; but they plot only against themselves, because the evil consequences thereof will befall them, though they do not perceive, this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And thus have We made in every city great ones of its wicked ones) their leaders, tyrants and wealthy citizens, as We made in the city of Mecca those who sneer and their friend, Abu Jahl and his folk, (that they should plot therein) that they should engage in transgression and corruption; it is also said that this means: so that they deny therein the prophets. (They do but plot against themselves) He says: the punishment and ruination of the transgressions and corruption they commit will be to their detriment, (though they perceive not) this.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لِيَمْكُرُواْ فِيهَا } معناه يَخْدَعَوا ويحتَالُوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَذٰلِكَ } أي: كما جعل في مكبة أكابر وصناديد يجرمون فيها جرائم عظيمة { جَعَلْنَا فِي كُلِّ قَرْيَةٍ } أي: قدرنا فيها { أَكَٰبِرَ } كانوا { مُجْرِمِيهَا } ومترفيها { لِيَمْكُرُواْ فِيهَا } بأنواع المكر والحيل ليضلوا ضعفاء العوام { وَمَا يَمْكُرُونَ } هؤلاء الماكرون { إِلاَّ بِأَنْفُسِهِمْ } لأن وبال مكرهم يعود عليهم { وَمَا يَشْعُرُونَ } [الأنعام: 123] لقساوة لقولبهم وشدة عمههم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { جعلنا } بمعنى صيَّرنا، يتعدى إلى مفعولين، و { مجرميها }: مفعول أول، مؤخر، و { أكابر }: مفعول ثان، وفيه ضعف من جهة الصناعة لأن أكابر جمع أكبر، وهو من أفعل التفضيل، فلا يستعمل إلا بالإضافة، أو مقرونًا بمن\n قاله ابن جزي\n قلت: ويُجاب بأنه لم يقصد به المفاضلة، وإنما المراد مطلق الوصف، أي: جعلناهم كبراء، فلا يلزم إفراده ولا اقترانه بمن\n فتأمله\n يقول الحقّ جلّ جلاله: { وكذلك } أي: كما جعلنا في مكة أكابر مجرميها، ليمكروا فيها بأهلها، { جعلنا في كل قرية أكابر مجرميها } أي: مجرميها أكابر، { ليمكروا فيها } بمن فيها، فيمكروا بالناس فيتبعوهم على ذلك المكر، لأنهم أكابر تصعب مخالفتهم، فيحملونهم على الكفر والعصيان، ويخذلونهم عن الإسلام والإيمان، { وما يمكرون إلا بأنفسهم } لأن وبال مكرهم راجع إليهم، { وما يشعرون } بذلك\n الاشارة: إذا أراد الله بقومٍ خيرًا جعل الخير في أكابرهم: فيجعل أُمراءهم عُدولاً حُلَماء، وعلماءهم زهَّادًا أعفَّاءً، وأغنياءهم رحماء أسخياء، وصُلحاءهم قانعين أغنياء، وإذا أراد بهم شرًا جعل الشر في كبرائهم، فيجعل أمراءهم فجارًا يحكمون بالهوى، وعلماءهم حراصًا جامعين للدنيا، وأغنياءهم أشحاء قاسية قلوبهم، وصلحاءهم طماعين في الناس، منتظرين لما في أيديهم، فبهؤلاء يصلح الدين إذا صلحوا، ويفسد إذا فسدوا، وفي ذلك يقول ابن المبارك رحمه الله:\n",
      "translations": []
    }
  ]
}