{
  "chapter": "الأنعام",
  "text": "ويوم يحشرهم جميعا يمعشر الجن قد استكثرتم من الانس وقال اولياؤهم من الانس ربنا استمتع بعضنا ببعض وبلغنا اجلنا الذى اجلت لنا قال النار مثوىكم خلدين فيها الا ما شاء الله ان ربك حكيم عليم",
  "translations": [
    {
      "translation": "On the Day We gather them all together: 'Company of jinn, you gained many followers among mankind.' And their friends among mankind will say, 'Our Lord, we benefited from one another, and now we have reached the term which You determined for us.' He will say, 'The Fire is your home. You will be in it timelessly, for ever, except as Allah wills. Your Lord is All-Wise, All-Knowing.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day He will gather them together, (He will say:) \"O you assembly of jinns, you made great use of men.\" But their proteges among men will say: \"O our Lord, we lived a life of mutual gain, but have now reached the term You ordained for us.\" \"Your abode is Hell,\" He will say, \"where you will dwell for ever, unless God please otherwise.\" Verily your Lord is wise and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when He shall muster them all together, He will say (to the jinn): 'O assembly of the jinn, you have seduced a good many of mankind.' And their companions from among the humans will say: 'Our Lord! We did indeed benefit from one another and now have reached the term which You had set for us.' Thereupon Allah will say: 'The Fire is now your abode, and therein you shall abide.' Only those whom Allah wills shall escape the Fire. Surely your Lord is All-Wise, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when every one will be resurrected and the jinn will be told that they have made many people go astray, their friends from among people will say, \"Lord, we benefitted from each other until death approached us.\" They will be told that their dwelling will be fire wherein they will live forever unless God wills it to be otherwise. Your Lord is All-wise and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Day when He will raise them all and will proclaim, “O you group of jinns, you have enticed a lot of men”; and their human friends will submit, “Our Lord, some of us have benefited from one another and have reached the appointed term which You had set for us”; He will say, “Your home is hell – remain in it for ever, except whomever Allah wills”; O dear Prophet (Mohammed – peace and blessings be upon him), indeed your Lord is the Wise, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when He will gather them together (and say): \"O you assembly of Jinn! Many did you mislead of men,\" and their friends among the people will say: \"Our Lord! We benefited one from the other, but now we have reached our appointed term which You did appoint for us. \" He will say: \"The Fire be your dwelling place, you will dwell therein forever, except as Allah may will. Certainly your Lord is All-Wise, All-Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when He shall gather them all together: O assembly of jinn! you took away a great part of mankind. And their friends from among the men shall say: Our Lord! some of us profited by others and we have reached our appointed term which Thou didst appoint for us. He shall say: The fire is your abode, to abide in it, except as Allah is pleased; surely your Lord is Wise, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when He shall muster them all together: 'Company of jinn, you have made much of mankind.' Then their friends among mankind will say, 'Our Lord, we have profited each of the other, and we have reached the term determined by Thee for us. He will say: 'The Fire is your lodging, therein to dwell forever' - except as God will; surely thy Lord is All-wise, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the day when He will gather them together (He will say): O ye assembly of the jinn! Many of humankind did ye seduce. And their adherents among humankind will say: Our Lord! We enjoyed one another, but now we have arrived at the appointed term which Thou appointedst for us. He will say: Fire is your home. Abide therein for ever, save him whom Allah willeth (to deliver). Lo! thy Lord is Wise, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when He gathers them all together, He will say, \"Company of jinn, you took away many followers among mankind.\" And their adherents among mankind will say, \"Our Lord, we benefited from one another, but now we have reached the end of the term which You determined for us.\" He will say, \"The Fire shall be your home, and there you shall remain forever, except as God wills. Surely your Lord is wise and all knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day whereon He will gather them all together: O ye race of genii! surely much ye have gotten out of mankind. And their friends among mankind will say: our Lord! much use some of us made of others, and now we have reached the appointed term which Thou appointedest for us. He will say: the Fire shall be your habitation, therein ye shall be as abiders, save as Allah may will. Verily thy Lord is Wise, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day He will gather them all together, [He will say], ‘O company of jinn! You claimed many of the humans.’ Their friends from among the humans will say, ‘Our Lord, we used each other, and we completed our term which You had appointed for us.’ He will say, ‘The Fire is your abode, to remain in it [forever], except what Allah may wish.’ Indeed your Lord is all-wise, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One day will He gather them all together, (and say): \"O ye assembly of Jinns! Much (toll) did ye take of men.\" Their friends amongst men will say: \"Our Lord! we made profit from each other: but (alas!) we reached our term - which thou didst appoint for us.\" He will say: \"The Fire be your dwelling-place: you will dwell therein for ever, except as Allah willeth.\" for thy Lord is full of wisdom and knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when He will gather them (all) together (and say): \"O you assembly of jinns! Many did you mislead of men,\" and their Auliya' (friends and helpers, etc.) amongst men will say: \"Our Lord! We benefited one from the other, but now we have reached our appointed term which You did appoint for us.\" He will say: \"The Fire be your dwelling-place, you will dwell therein forever, except as Allah may will. Certainly your Lord is All-Wise, All-Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when He assembles them all together, 'O company of Jinn, you have seduced mankind in great numbers' And their guided ones among the humans will say: 'Lord, we have enjoyed each other. But now we have reached the term which You have appointed for us' He will say: 'The Fire shall be your lodging, and there you shall remain for ever except as Allah will' Your Lord is Wise, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when He gathers them all together: “O assembly of jinn, you have exploited multitudes of humans.” Their adherents among mankind will say, “Our Lord, we have profited from one another, but we have reached the term that you have assigned for us.” He will say, “The Fire is your dwelling, wherein you will remain, except as God wills. Your Lord is Wise and Informed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention, O Muhammad], the Day when He will gather them together [and say], \"O company of jinn, you have [misled] many of mankind.\" And their allies among mankind will say, \"Our Lord, some of us made use of others, and we have [now] reached our term, which you appointed for us.\" He will say, \"The Fire is your residence, wherein you will abide eternally, except for what Allah wills. Indeed, your Lord is Wise and Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:128] And, mention, the day when He, God, shall gather them (yahshuruhum, may also read nahshuruhum, ‘We shall gather them’), that is, creatures, all together, and it will be said to them: ‘O assembly of jinn, you have garnered much of mankind’, by your misleading [them]. Then their friends, those who obeyed them, from among mankind will say, ‘Our Lord, we enjoyed one another, mankind enjoyed what the jinn adorned for them of passions, while the jinn [enjoyed] mankind’s obedience to them; but now we have arrived at the term which You have appointed for us’, that is, the Day of Resurrection — this [statement] expresses extreme regret on their part. He, exalted be He, will say, to them, by the tongues of the angels: ‘The Fire is your lodging, your abode, to abide therein’ — except what God wills, of those times when they will exit from it in order to drink boiling water, which is located outside it, as God, exalted be He, has said: Then they shall return to the Hell-fire [Q. 37:68]; according to Ibn ‘Abbās, this [proviso] pertains to those whom God knows will believe (mā, ‘what’, thus has the sense of man, ‘whom’). Surely your Lord is Wise, in His actions, Knowing, of His creatures.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(In the day when He will gather them together) the jinn and human beings ((He will say): ye assembly of the jinn! Many of humankind did ye seduce) how many human beings have erred by seeking help in you. (And their adherents) the adherents of the jinn (among humankind) who sought help in the leaders of the jinn upon camping at a valley or hunting a beast of theirs, used to say: 'we seek refuge in the master of this valley from the foolish among his people', and used to feel safe after saying this, (will say: Our Lord!) our Lord! (We enjoyed one another) we benefited from one another; the benefit of the human beings was safety from the jinn, and that of the jinn, their status and position among their people (but now we have arrived at the appointed term which Thou appointedst for us) i.e. death. (He) Allah (will say) to them: (Fire is your home) is your dwelling, group of jinn. (Abide therein for ever) abiding in the Fire, (save him whom Allah willeth (to deliver)) but Allah wills that they abide therein for eternity. (Lo! thy Lord is Wise) He decreed that they will abide in hell for ever, (Aware) of them and of their punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n  { يوم يحشرهم } في يوم عين الجمع المطلق { جميعاً }\n قلنا { يا معشر } جنّ القوى النفسانية { قد اسْتَكْثَرتم من الإنس } أي: من الحواس والأعضاء الظاهرة أو من الصور الإنسانية بأن جعلتموهم أتباعكم وأهل طاعتكم إياهم\n وتسويلكم وتزيينكم الحطام الدنيوية واللذات الجسمانية عليهم\n ووسوستكم إياهم بالمعاصي { وقال أولياؤهم من الإنس } الذين تولوهم { ربنا استمتع بعضنا ببعض } بانتفاع كل منا في صورة الجمعية بالآخر { و } قد { بلغنا أجلنا الذي أجّلتَ لنا } بالموت أو بالمعاد الجسماني على أقبح الصور وأسوأ العيش { قال النار } نار الحرمان عن اللذات ووجدان الآلام { مثواكم خالدين فيها إلا } وقت { ما شاء الله } أن تخفّف\n أو ينجي منكم من لا يكون سبب تعذبه شركاً راسخاً في اعتقاده { إنّ ربك حكيم } لا يعذبكم إلا بهيآت نفوسكم التي كسبتم على ما تقتضيه الحكمة { عليم } بمن يتعذب باعتقاده فيدوم عذابه أو بهيآت سيئات أعماله فيعذب على حسبها ثم ينجو منه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أذكر يا أكمل الرسل { يَوْمَ يِحْشُرُهُمْ جَمِيعاً } أي: جميع ما يتأتى منه الأطاعة ويتوجه إليه التكليف من الثقلين قابلين عليهم منادين لهم: { يَٰمَعْشَرَ ٱلْجِنِّ } أي: الشياطين { قَدِ ٱسْتَكْثَرْتُمْ } أي: استتبعتم بأن أضللتم وأغويتم كثيراً { مِّنَ ٱلإِنْسِ } بإيقاعهم إلى المعاصي والمهالك والخروج عن مقتضى أوامرنا نواهينا\n وإغرائهم إلى مستلذات نفوسهم ومتقضيات شهواتهم { وَ } بعدما سمع الإنس هذا النداء { قَالَ أَوْلِيَآؤُهُم } أي: أولياء الجن ومتابعهم { مِّنَ ٱلإِنْسِ } متذللين متحسرين: { رَبَّنَا } يا من ربانا بأنواع اللطف والكرم فكفرناك بمتابعة هؤلاء الغواة فإن ظهر الحق واضمحل الباطل نحن نقر بما جرى بيننا وبينهم { ٱسْتَمْتَعَ بَعْضُنَا بِبَعْضٍ } منهم بإغوائهم وإغرائهم إلى خلاف ما أمرتنا عليه بألسنة رسلك\n وبعضهم استمتع ببعضنا بالموالاة والمتابعة { وَبَلَغْنَآ } الآن { أَجَلَنَا ٱلَّذِيۤ أَجَّلْتَ لَنَا } على ألسنة رسلك فالآن جئناك خائبين خاسرين { قَالَ } سبحانه من وراء سرادقات العز والجلال: الآن انقرض دار الابتلاء ومضى زمان الاهتداء { ٱلنَّارُ مَثْوَٰكُمْ } جميعاً\n أي: تابعيكم ومتبوعيكم مؤبداً { خَٰلِدِينَ فِيهَآ } أبداً { إِلاَّ مَا شَآءَ ٱللَّهُ } وقتاً ينقذهم منها\n لئلا يتعودوا بعذابها { إِنَّ رَبَّكَ حَكِيمٌ } متقن في أفعاله { عَليمٌ } [الأنعام: 128] بمقدار جزاء العصاة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { خالدين }: حال مقدَّرة من الكاف\n والعامل فيه: { مثواكم } \n إن جعل مصدرًا\n أو معنى الإضافة\n إن جعل مكانًا\n يقول الحقّ جلّ جلاله: { و } اذكر { يوم نحشرهم } أي: الثقلين\n { جميعًا } ونقول: { يا معشر الجن } أي: الشياطين { قد استكثرتم من الإنس } أي: من إغوائهم وإضلالهم\n أو استكثرتم منهم بأن جعلتموهم في أتباعكم\n فحُشروا معكم\n { وقال أولياؤهم من الإنس } الذين أطاعوهم في الكفر: { ربنا استمتع بعضنا ببعض } أي: انتفع الإنس بالجن\n بأن دلوهم على الشهوات وما يتوصل به إليها\n وانتفع الجن بالإنس بأن أطاعوهم وحَصَّلوا مرادهم: وقيل: استمتاع الإنس بهم أنهم كانوا يعوذُون بهم في المفارز وعند المخاوف\n كان الرجل إذا نزل واديًا يقول: أعوذ بصاحب هذا الواد\n يعني كبير الجن\n واستمتاعهم بالإنس: اعترافهم بأنهم يقدرون على إجارتهم\n { وبلغنا أجلنا الذي أجلت لنا } وهو الموت أو البعث والحشر\n وهو اعترافٌ بما فعلوا من طاعة الشياطين واتباع الهوى\n وتكذيب البعث\n وتحسرٌ على حالهم\n وإظهار للأستكانة والضعف\n أقروا بذنبهم لعله ينفعهم\n { قال النار مثواكم }: منزلكم\n { خالدين فيها إلا ما شاء الله } إلا أوقات\n ينتقلون فيها من النار إلى الزمهرير\n وقيل: ليس المراد بالاستثناء هنا الإخراج\n وإنما هو على وجه الآدب مع الله وإسناد الأمور إليه\n وسيأتي في الإشارة تكميله إن شاء الله\n { إن ربك حكيم } في أفعاله\n { عليم } بأعمال الثقلين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "47:12",
      "similarity": 0.4462665460762053
    },
    {
      "verse": "47:19",
      "similarity": 0.3964564515941867
    },
    {
      "verse": "39:72",
      "similarity": 0.39049652647272737
    },
    {
      "verse": "16:29",
      "similarity": 0.3891334670032645
    },
    {
      "verse": "40:76",
      "similarity": 0.38781115856449244
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006128.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006128.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:128.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}