{
  "chapter": "الأنعام",
  "text": "وربك الغنى ذو الرحمة ان يشا يذهبكم ويستخلف منۢ بعدكم ما يشاء كما انشاكم من ذرية قوم ءاخرين",
  "translations": [
    {
      "translation": "Your Lord is the Rich Beyond Need, the Possessor of Mercy. If He wanted, He could remove you and replace you with anything else He wanted to, just as He produced you from the descendants of another people.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is all-sufficient and full of benevolence. He can take you away if He please, and make whom He will succeed you, as He had raised you from the progeny of others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is Self-Sufficient, full of compassion. If He wills, He can put you away and cause whomever He wills to succeed you just as He has produced you from the seed of another people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is Self-sufficient and Merciful. Had He wanted, He could have destroyed you and replaced you by other people, just as He had created you from the offspring of others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O dear Prophet (Mohammed – peace and blessings be upon him), your Lord is the Perfect (Not needing anything), the Merciful; O people! If He wills, He can remove you and bring others in your stead – the way He created you from the descendants of others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord is Al-Ghani, full of mercy; if He wills, He can destroy you; and in your place make whom He wills as your successors, as He raised you from the seed of other people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord is the Self-sufficient one, the Lord of mercy; if He pleases, He may take you off, and make whom He pleases successors after you, even as He raised you up from the seed of another people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy Lord is All-sufficient, Merciful. If He will, He can put you away, and leave after you, to succeed you, what He will, as He produced you from the seed of another people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy Lord is the Absolute, the Lord of Mercy. If He will, He can remove you and can cause what He will to follow after you, even as He raised you from the seed of other folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is the self-sufficient One, the merciful. If He wills, He can take you away and replace you by anyone He pleases, just as He raised you from the offspring of other people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thine Lord is Self-sufficient, the Owner of mercy. If He will, He can take you away, and make those succeed you, after you, whomsoever He will, even as He raised you from the seed of anot her people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is the All-sufficient dispenser of mercy. If He wishes, He will take you away, and make whomever He wishes succeed you, just as He produced you from the descendants of another people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy Lord is self-sufficient, full of Mercy: if it were His will, He could destroy you, and in your place appoint whom He will as your successors, even as He raised you up from the posterity of other people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord is Rich (Free of all wants), full of Mercy, if He will, He can destroy you, and in your place make whom He will as your successors, as He raised you from the seed of other people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is Rich and the Owner of Mercy. He can destroy you if He will and replace you with whom He pleases, just as He raised you from the offspringof other nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord is the Rich Beyond Need, the Possessor of Mercy. If He wills, he can do away with you, and substitute whomever He wills in your place, just as He produced you from the descendants of another people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord is the Free of need, the possessor of mercy. If He wills, he can do away with you and give succession after you to whomever He wills, just as He produced you from the descendants of another people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:133] Your Lord is Independent, of His creatures and their worship, the Lord of Mercy. If He will, He can remove you, O people of Mecca, by destroying you, and leave whom He will, of creatures, to succeed after you, just as He produced you from the seed of another folk, [whom] He removed; but He has spared you, as a mercy to you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thy Lord is the Absolute) free of the need for their faith, (the Lord of Mercy) in that He defers punishment for him who believes in Him. (If He will, He can remove you) destroy you, people of Mecca (and can cause what He will to follow after you, even as He raised you from the seed of other folk) generation after generation.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } الحال إن نفعه عائد إليهم؛ إذ { رَبُّكَ } هو { ٱلْغَنِيُّ } بذاته عنهم وعن أعمالهم بالمرة صالحاً أو فساداً بل هو { ذُو ٱلرَّحْمَةِ } على من عمل بمقتضى التكليف امتناناً عليه وتفضلاً بلا احتياج له سبحانه إليهم وإلى عملهم بل { إِن يَشَأْ يُذْهِبْكُمْ } أيها لاناس الناسون حقوق ألوهيته وتوحيده والتكاليف الواقعة في طريقه { وَيَسْتَخْلِفْ مِن بَعْدِكُمْ مَّا يَشَآءُ } ممن يعمل على مقتضى تكاليفه { كَمَآ أَنشَأَكُمْ مِّن ذُرِّيَّةِ قَوْمٍ آخَرِينَ } [الأنعام: 133] قرناً بعد قرن، بطناً بعد بطن مع أنه يترحم عليكم ويبقيكم تفضلاً وامتناناً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وربك الغني } عن العباد وعبادتهم، { ذو الرحمة } يترحم عليهم بالتكليف، تكميلاً، ويمهلهم على المعاصي حلمًا، وليس له حاجة في طاعة ولا معصية، { إن يشأ يُذهبكم } أيها العصاة، { ويستخلف من بعدكم ما يشاء } من الخلق، { كما أنشأكم من ذرية قوم آخرين } فأنشأكم قرنًا بعد قرن، لكنه أبقاكم رحمة بكم، { إنَّ ما توعدون } من البعث وما بعده، { لآتٍ } لا محالة، { وما أنتم بمعجزين } تعجزون قدرة الله الطالب لكم بالبعث والحساب\n الإشارة: كما أن الحق تعالى لم يُعذب الكفار إلا بعد إرسال الرسل، كذلك لا يُعاقب أهل الإصرار إلا بعد بعث الأطباء وهم أهل التربية النبوية، فكل من لم يصحبهم وينقد إليهم مات مصرًا على الكبائر ـ أي: كبائر القلوب ـ وهو لا يشعر، فيلقى الله بقلب سقيم، فيعاقبه الحق تعالى على عدم صحبتهم، ومعاتبته له: بُعدُهُ عن مشاهدته وعن مقام المقربين، فإذا رأى مقام المقربين وقربهم من الحضرة، قال: غرتنا الحياة الدنيا ورخارفها، وجاهها ورياستها، وشهد على نفسه أنه كان غافلاً\n فحِكمة وجود الأولياء في كل قرن لتقوم الحجة على أهل الغفلة، فإذا وقع البعد لقوم لم يكن الحقّ ظالمًا لهم، فالدرجات على حسب المقامات، والمقامات على حسب الأعمال، وأعمال القلوب هي التي تقرب إلى حضرة علام الغيوب، بها يقع القرب، وبالخلو عنها يقع البعد\n وعليها دلت الأولياء بعد الأنبياء، لأن الأنبياء جاؤوا بالشريعة الظاهرة والحقيقة الباطنة، فمن رأوه أهلاً لسر الحقيقة دلًّوه عليها، فكان من المقربين، ومن رأوه ضعيفًا عنها دلوه على الشريعة، فكان من أصحاب اليمين\n وبالله التوفيق\n ثم أمره بتهديد قريش وتخويفهم، فقال: { قُلْ يَاقَوْمِ ٱعْمَلُواْ عَلَىٰ مَكَانَتِكُمْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "53:47",
      "similarity": 0.484614574885439
    },
    {
      "verse": "56:35",
      "similarity": 0.4554808623323781
    },
    {
      "verse": "23:31",
      "similarity": 0.44731418875099493
    },
    {
      "verse": "23:42",
      "similarity": 0.44731418875099493
    },
    {
      "verse": "55:24",
      "similarity": 0.39294945294412226
    }
  ]
}