{
  "chapter": "الأنعام",
  "text": "ولكل درجت مما عملوا۟ وما ربك بغفل عما يعملون",
  "translations": [
    {
      "translation": "All have ranks according to what they did. Your Lord is not unaware of what they do.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every one has his place according to his deeds, for your Lord is not negligent of what you do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everyone is assigned a degree according to his deed. Your Lord is not heedless of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People's deeds are of different degrees and your Lord is not unaware of what people do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for everyone are ranks from what they do; and your Lord is not unaware of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For all there will be degrees according to what they did. And your Lord is not unaware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all have degrees according to what they do; and your Lord is not heedless of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All have degrees according to what they have done; thy Lord is not heedless of the things they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For all there will be ranks from what they did. Thy Lord is not unaware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For all are degrees of rank according to their deeds; your Lord is not unaware of anything they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For all there will be degrees in accordance with that which they did, and thy Lord is not unaware of that which they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For everyone there are ranks in accordance with what they have done; and your Lord is not oblivious of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To all are degrees (or ranks) according to their deeds: for thy Lord is not unmindful of anything that they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For all there will be degrees (or ranks) according to what they did. And your Lord is not unaware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They all have their degrees according to their deeds. Your Lord is not inattentive of their actions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They all have ranks according to what they did; and your Lord is not unaware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for all are degrees from what they have done. And your Lord is not unaware of what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:132] All, of those who perform deeds, shall have degrees, of requital, according to what they have done, of good or evil. Your Lord is not heedless of what they do (ya‘malūna: may also be read ta‘malūna, ‘you do’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(For all) among the jinn and human beings (there will be ranks) for the believers among the jinn and humans in Paradise, and dungeons in hell for the unbelievers (from what they did) of good or evil (Thy Lord is not unaware) oblivious (of what they do) of good or evil; it is also said that this means: He is not going to suspend the punishment due for their transgressions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلم يا أكمل الرسل وذكرهم { لِكُلٍّ } من أهل التكليف { دَرَجَٰتٌ } عند الله حاصلة لهم { مِّمَّا عَمِلُواْ } عن الصالحات { وَمَا رَبُّكَ } المطلوب لضمائر عباده { بِغَٰفِلٍ عَمَّا يَعْمَلُونَ } [الأنعام: 132] لمقتضى التكاليف التي كلفهم بها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولكلٍّ } من الإنس والجن { درجات } مراتب، { مما عملوا } من أجل أعمالهم بالخير والشر، فهم متفاوتون في النعيم والعذاب، وظاهر الآية: أن الجن يُثابون ويُعاقبون لأنهم مكلفون، وهو المشهور، واختلف: هل يدخلون الجنة أم لا؟ فروى الطبري وابنُ أبي حاتم عن أبي الدرداء موقوفًا: أنهم يكونون ترابًا كسائر الحيوانات، ورُوِي عن أبي حنيفة مثله، وذهب الجمهور ـ وهو قول الأئمة الثلاثة والأوزاعي وأبي يوسف، وغيرهم أنهم يثابون على الطاعة ويدخلون الجنة\n ثم اختلفوا، هل يدخلون مدخل الإنس، وهو الأكثر، أو يكونون في ربض الجنة، وهو عن مالك وطائفته، أو أنهم أصحاب الأعراف، أو التوقف عن الجواب؟ في هذا أربعة أقوال، والله تعالى أعلم بغيبه\n\n\n{ وما ربك بغافل عما يعملون } فيخفى عليه عمل أو قدر ما يستحق عليه من ثواب أو عقاب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:163",
      "similarity": 0.6912635349103038
    },
    {
      "verse": "46:19",
      "similarity": 0.6867895397251729
    },
    {
      "verse": "4:96",
      "similarity": 0.6735773362324149
    },
    {
      "verse": "20:75",
      "similarity": 0.6274141034891678
    },
    {
      "verse": "8:4",
      "similarity": 0.5459490686121589
    }
  ]
}