{
  "chapter": "الأنعام",
  "text": "وقالوا۟ ما فى بطون هذه الانعم خالصة لذكورنا ومحرم على ازوجنا وان يكن ميتة فهم فيه شركاء سيجزيهم وصفهم انه حكيم عليم",
  "translations": [
    {
      "translation": "They say, 'What is in the wombs of these animals is exclusively for our men and haram for our wives. But if it is stillborn, they can share in it.' He will repay them for their false depiction. He is All-Wise, All- Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"Whatever is in the wombs of these cattle is only meant for men and forbidden our women; but in case it should be still-born both could eat it.\" God will punish them for what they assert. He is all-wise and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: 'What is within the bellies of such-and-such cattle is exclusively for our males and is forbidden to our females; but if it be born dead, they all may share in it.' He will soon requite them for all that they (falsely) attribute to Allah. He is All-Wise, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have also said, \"Whatever exists in the wombs of these animals belongs to our people alone and it is not lawful for our women.\" However, if they are born dead, then everyone will have a share. God will give them what they deserve for (their unjust laws). God is All-merciful and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “The animals in the bellies of such cattle are purely for our males and forbidden to our women; and if the animal is stillborn, they all have a share of it”; soon Allah will repay them for their utterances; indeed He is Wise, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"What is in the bellies of such and such cattle is for our males alone, and forbidden to our females, but if it is born dead, then all have shares therein.\" He will punish them for their attribution (of such false orders to Allah). Verily, He is All-Wise, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: What is in the wombs of these cattle is specially for our males, and forbidden to our wives, and if it be stillborn, then they are all partners in it; He will reward them for their attributing (falsehood to Allah); surely He is Wise, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, 'What is within the bellies of these cattle is reserved for our males and forbidden to our spouses; but if it be dead, then they all shall be partners in it.' He will assuredly recompense them for their describing; surely He is All-wise, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: That which is in the bellies of such cattle is reserved for our males and is forbidden to our wives; but if it be born dead, then they (all) may be partakers thereof. He will reward them for their attribution (of such ordinances unto Him). Lo, He is Wise, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, \"What is in the wombs of such and such cattle is exclusively for our males and is forbidden to our females. But if it is stillborn, they may have a share of it.\" God will soon punish them for their [false] attribution. He is wise, and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: whatsoever is in the bellies of such cattle is for our males alone and is forbidden unto our wives, and if it be born dead, then they all are partakers thereof. Anon He shall requite them for their attribution verily He is Wise, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, ‘That which is in the bellies of these cattle is exclusively for our males and forbidden to our wives. But if it be still-born, they will all share it.’ Soon He will requite them for their allegations. Indeed, He is all-wise, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"What is in the wombs of such and such cattle is specially reserved (for food) for our men, and forbidden to our women; but if it is still-born, then all have share therein. For their (false) attribution (of superstitions to Allah), He will soon punish them: for He is full of wisdom and knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"What is in the bellies of such and such cattle (milk or foetus) is for our males alone, and forbidden to our females (girls and women), but if it is born dead, then all have shares therein.\" He will punish them for their attribution (of such false orders to Allah). Verily, He is All-Wise, All-Knower. (Tafsir At-Tabari, Vol. 8, Page 49).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They also say: 'What is in the bellies (wombs) of these cattle is reserved for our males but not for our wives' But if it is stillborn, they all partake of it. He will recompense them for their describing. He is Wise, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “What lies in the wombs of these animals is exclusively for our males, and prohibited to our wives.” But if it is stillborn, they can share in it. He will surely punish them for their allegations. He is Wise and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"What is in the bellies of these animals is exclusively for our males and forbidden to our females. But if it is [born] dead, then all of them have shares therein.\" He will punish them for their description. Indeed, He is Wise and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:139] And they say, ‘That which is within the bellies of these, forbidden, cattle, namely, the camels [they call] Sā’ibas or Bahīras, is reserved, permitted, for our males and forbidden to our spouses, that is, the women; but if it be dead (read maytatun or maytatan, and the verb as either feminine takun or masculine yakun, ‘if it be’) then they [all] may be partakers thereof’. He, God, will assuredly requite them for their describing, [this and] that as [either] permitted or forbidden, with the appropriate requital thereof. Surely He is Wise, in His actions, Knowing, of His creatures.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they say: That which is in the bellies of such cattle) i.e. al-Bahirah and al-Wasilah (is reserved) lawful (for our males) men (and is forbidden to our wives; but if it be born dead) or dies consequently, (then they (all)) males and females (may be partakers thereof) in eating its meat. (He will reward them) this is a threat to them (for their attribution (ordinances unto Him)) it is also said that this means: He will reward them with what will happen to them. This is because the Prophet (pbuh) saw 'Amr ibn Luhayy, who taught them the unlawfulness of the cattle described above, dragging his guts from his behind. (Lo, He is Wise) He made that which is lawful permitted, (Aware) of their ascription of unlawfulness to things that are lawful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة مفترياتهم ومخترعاتهم أنهم { قَالُواْ مَا فِي بُطُونِ هَـٰذِهِ ٱلأَنْعَٰمِ } أي: البحائر والسوائب إن كانت حياً فهي { خَالِصَةٌ لِّذُكُورِنَا } مخصصة مستحلة لهم { وَمُحَرَّمٌ عَلَىٰ أَزْوَٰجِنَا } لا نصيب لهن فيه { وَإِن يَكُن مَّيْتَةً } أي: وإن يخرج ميتة { فَهُمْ } أي: الذكور والإناث { فِيهِ شُرَكَآءُ } بلا تفاوت وخصوصية { سَيَجْزِيهِمْ وَصْفَهُمْ } أي: سيجزيهم الله على وصفهم\n وتفصيلهم هذا افتراء عليه { إِنَّهُ حِكِيمٌ } في جزاء المفترين { عَلِيمٌ } [الأنعام: 139] بمقدار جزائهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { خالصةٌ }: خبر لـ { ما } ، وأنثه حملاً على المعنى، لأن { ما } واقعة على الأجنة، وذكّر { محرم } حملاً على لفظ { ما } ، ويحتمل أن تكون التاء للمبالغة، ومن قرأ: { تكن } ، بالتأنيث، فالمراد: الأجنة، ومن قرأ بالتذكير فراعى لفظ { ما }. يقول الحقّ جلّ جلاله: { وقالوا ما } استقر { في بطون هذه الأنعام } ، بمعنى: البحائر والسوائب، من الأجنة، { خالصة لذكورنا } لا يشاركون فيه، { ومحرم على أزواجنا } أي: نسائنا، يعني: أن ما يولد للبحائر والسوائب، قالوا هو حلال لذكورهم دون نسائهم، هذا إن وُلد حيًا، { وإن يكن ميتة } بأن ولد ميتًا { فهم فيه شركاء } فالذكور والإناث سواء، { سيجزيهم وصفهم } أي: سيجزيهم على ما وصفوا وافتروا على الله من الكذب في التحليل والتحريم، فهو كقوله:\n[النّحل:62]، { أنه حكيم } في صنعه، { عليم بخلقه } فيجزي كلاًّ على قدر جُرمه. الإشارة: اعلم أن جيفة الدنيا اشترك النساء مع الرجال فيها، لقوله تعالى: { وإن يكن ميتة فهم فيه شركاء } ، والزهد في النساء قليل بالنسبة إلى الرجال، واعلم أيضًا أن الحق تعالى يجازي عبده جزاء موافقًا لوصفه، فإن كان وصفه التعظيم لكل شيء عظمه الله، ومن كان وصفه التصغير صغره الله، ومن كان وصفه الإحسان أحسن الله إليه، ومن كان وصفه الإساءة أساء الله إليه، ومن كان وصفه الفرق فرقه الله، ومن كان وصفه الجمع جمعه الله، وهكذا: كما تدين تدان، كما تقابل الأشياء تقابلك، قال تعالى: { سيجزيهم وصفهم إنه حكيم عليم }. ثم شَنَّعَ عليهم قتل الأولاد، فقال: { قَدْ خَسِرَ ٱلَّذِينَ قَتَلُوۤاْ أَوْلاَدَهُمْ سَفَهاً }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:159",
      "similarity": 0.45315908442996217
    },
    {
      "verse": "37:180",
      "similarity": 0.44162002608650863
    },
    {
      "verse": "16:116",
      "similarity": 0.4210736477522243
    },
    {
      "verse": "43:82",
      "similarity": 0.4079973917348917
    },
    {
      "verse": "21:22",
      "similarity": 0.3918385673182636
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006139.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006139.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:139.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}