{
  "chapter": "الأنعام",
  "text": "وله ما سكن فى اليل والنهار وهو السميع العليم",
  "translations": [
    {
      "translation": "All that inhabits the night and the day belongs to Him. He is the All-Hearing, the All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatsoever dwells in the night and day belongs to Him. He is all-hearing and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Him belongs all that dwells in the night and the day. He is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that rests during the night and the day. He is All-hearing and All-knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Him only belongs all whatever exists in the night and in the day; and He only is the All Hearing, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Him belongs whatsoever exists in the night and the day, and He is the All-Hearing, the All-Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Him belongs whatever dwells in the night and the day; and He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Him belongs whatsoever inhabits the night and the day; and He is the All-hearing, the All-knowing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Him belongeth whatsoever resteth in the night and the day. He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs all that dwells in the night and the day. He is the All Hearing and the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is whatsoever dwelleth in the night and the day; and He is the Hearer, the Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whatever abides in the night and the day, and He is the All-hearing, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To him belongeth all that dwelleth (or lurketh) in the night and the day. For he is the one who heareth and knoweth all things.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Him belongs whatsoever exists in the night and the day, and He is the All-Hearing, the All-Knowing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His is whatever is at rest in the night and in the day. He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him belongs whatever rests in the night and the day. He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Him belongs that which reposes by night and by day, and He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:13] And to Him, exalted be He, belongs all that inhabits, resides [in], the night and the day, that is to say, everything — He is its Lord, its Creator and its Possessor; and He is the Hearer, of what is said, the Knower’, of what is done.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And about their saying to Muhammad (pbuh): \"revert to our religion and we shall make you rich, marry you, give you status and make you king over us\", Allah said: (Unto Him belongeth whatsoever resteth in the night and the day. He is the Hearer) of their saying, (the Knower) of their punishment and of the provisions of created beings.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف ينكرون جمعه وتوحيده مع أنه { لَهُ } سبحانه { مَا سَكَنَ } وبطن { فِي ٱلْلَّيْلِ } أي: مرتبة الباطن والغيب { وَ } ما ظهر وانكشف في { ٱلنَّهَارِ } أي: مرتبة الظاهر و الشهادة { وَهُوَ } بذاته { ٱلسَّمِيعُ } لكل ما سمع { ٱلْعَلِيمُ } [الأنعام: 13] لكل ما علم وأدرك لا يخفى عليه شيء مما ظهر وبطن\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم تمّم جوابه فقال: { وله ما سكن } أي: قل لهم: ما في السماوات والأرض لله، وله أيضًا ما سكن { في الليل والنهار }  أي: ما استقر فيهما وما اشتملنا عليه، أو ما سكن فيهما وتحرك، { وهو السميع } لكل مسموع، { العليم } بكل معلوم فلا يخفى عليه شيء في الليل والنهار، في جميع الأقطار\n\n\nالإشارة: إذا علم العبد أن الخلق كلهم في قبضة الله، وأمورهم كلها بيد الله، أحاط بهم علمًا وسمعًا وبصرًا، لم يبق له على أحد عتاب، ولا ترتيبُ خطأ ولا صواب، إلاَّ ما أمرت به الشريعةُ على ظاهر اللسان\n بل شأنه أن ينظر إلى ما يفعل المالك في ملكه\n فيتلقاه بالقبول والرضى، وفي الحِكَم: \" ما تَركَ من الجهل شيئًا مَن أراد أن يُظهر في الوقت غيرَ ما أظهره الله فيه \"\n هذا شأن أهل التوحيد يدوُرون مع رياح الأقدار حيثما دارت، غيرَ أنهم يتحنَّنون بقلوبهم إلى رحمة الكريم المنان، وينهضون بهمتهم إلى مَظانّ السعادة والغفران، ويرجون منه الجمع عليه في روح وريحان، وجنة ورضوان، بمحض فضل منه وإحسان\n جعَلَنَا الله منهم بفضله وكرمه\n آمين\n ثم أقام الحجة على أهل الشرك، فقال: { قُلْ أَغَيْرَ ٱللَّهِ أَتَّخِذُ وَلِيّاً }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:67",
      "similarity": 0.8322384761431388
    },
    {
      "verse": "27:86",
      "similarity": 0.6920401669749102
    },
    {
      "verse": "71:5",
      "similarity": 0.5675381304101854
    },
    {
      "verse": "28:73",
      "similarity": 0.5673457922898884
    },
    {
      "verse": "40:61",
      "similarity": 0.5214933817809018
    }
  ]
}