{
  "chapter": "الأنعام",
  "text": "ذلك ان لم يكن ربك مهلك القرى بظلم واهلها غفلون",
  "translations": [
    {
      "translation": "That was because their Lord would never have destroyed the cities unjustly while their people were unaware.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this (so that it may be clear) that your Lord does not destroy towns and cities arbitrarily while the citizens remain unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They will be made to bear this witness to show that) it is not the way of your Lord to destroy cities unjustly while their people were unaware of the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord did not want to destroy the towns, unjustly, without informing their inhabitants (of His guidance).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because your Lord does not unjustly destroy townships for their people may be unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because your Lord would not destroy the (populations of) towns for their wrongdoing while their people were unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because your Lord would not destroy towns unjustly while their people were negligent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because thy Lord would never destroy the cities unjustly, while their inhabitants were heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because thy Lord destroyeth not the townships arbitrarily while their people are unconscious (of the wrong they do).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord would not destroy a community for its wrongdoing, so long as its people were still unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because thy Lord is not one to destroy a town for its wrong-doing while its people are unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because your Lord would never destroy the towns unjustly while their people were unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The messengers were sent) thus, for thy Lord would not destroy for their wrong-doing men's habitations whilst their occupants were unwarned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because your Lord would not destroy the (populations of) towns for their wrong-doing (i.e. associating others in worship along with Allah) while their people were unaware (so the Messengers were sent).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because your Lord will not destroy villages unjustly, while their inhabitants were inattentive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because your Lord would not destroy towns for injustice while their inhabitants are unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because your Lord would not destroy the cities for wrongdoing while their people were unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:131] That, sending of the messengers, is because (an, [phonetically] lightened, with the lām [of li-annahu] implied, thus [read as] li-annahu, ‘because’) your Lord would never destroy the towns through injustice, on their part, while their inhabitants were heedless, not having had any Messenger to make [things] clear to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(This) i.e. sending messengers (is because your Lord destroyeth not the townships) the people of the townships (arbitrarily) because of their idolatry or transgression; it is also said that this means: out of injustice (while their people are unconscious) of the commands and prohibitions and the conveyance of the messengers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذٰلِكَ } أي: إرسال الرسل وإنزال الكتب إنما هو ليتنبهوا وينتبهوا؛ أي: العصاة على ما هم عليه والسر في الإرسال { أَن } أي: لأن { لَّمْ يَكُنْ رَّبُّكَ مُهْلِكَ ٱلْقُرَىٰ بِظُلْمٍ } أي: بسبب ظلم صدر عنه { وَ } الحال أنه { أَهْلُهَا غَٰفِلُونَ } [الأنعام: 131] عن طريق الحق بلا تنبيه وإرشاد مرشد نبيه، وعلّيم من تبعك من المؤمنين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ذلك أن لم يكن ربك }: خبر عن مضمر، وأن على حذف لام العلة، أي: الأمر ذلك لأجل أن لم يكن ربك متصفًا بالظلم\n يقول الحقّ جلّ جلاله: يوم القيامة في توبيخ الكفار: { يا معشر الجن والإنس ألم يأتكم رسل منكم } أي: من مجموعكم، أو رسل الجن: نُذُرُهم الذين يبلغون لهم شريعة الأنس إذ ليس في الجن رسل على المشهور\n ورَوى الطبري من طريق الضحاك بن مزاحم إثبات ذلك، واحتج بأنا لله تعالى أخبَر أن من الجن والإنس رسلاً أرسلوا إليهم، يعني ظاهر هذه الآية\n وأجاب الجمهور بأن معنى الآية: أن رسل الإنس رسل من قبل الله أليهم، ورسل الجن يبلغون كلام رسل الأنس إليهم، ولهذا قال قائلهم:\n\n[الأحقاف:30] الآية، فالرسالة إلى الجن خاصة بنبيّنا محمد صلى الله عليه وسلم، أي: مع الإنس\n حال كون الرسل الذين أتوكم { يقصون عليكم آياتي ويُنذرونكم لقاء يومكم هذا } يعني يوم القيامة، قالوا في الجواب: { شهدنا على أنفسنا } بالكفر والعصيان، وهو اعتراف منهم بما فعلوا\n قال تعالى: { وغرتهم الحياة الدنيا } ألهتهم بزخرفها عن النظر والتفكر، { وشهدوا على أنفسهم أنهم كانوا كافرين } ، وهذا ذم لهم على سُوء نظرهم وخطأ رأيهم، فإنهم اغتروا بالحياة الدنيوية واللذات الفاتية، وأعرضوا عن الآخرة بالكلية، حتى كان عاقبة أمرهم أن اضطروا إلى الشهادة على أنفسهم بالكفر والاستسلام للعذاب المخلد تحذيرًا للسامعين وإرشادًا لهم\n قاله البيضاوي\n ثم ذكر حكمة إرسال الرسل فقال: { ذلك } الإرسال حكمته لـ { أن لم يكن ربك مُهلك القرى بظلم وأهلها غافلون } أي: إنما أرسلَ الرسل لئلا يكون ظالمًا لهم بإهلاكهم بسبب ظلم فعلوه، وهم غافلون عن الإنذار، بحيث لم ينذرهم أحد، أو: لم يكن مهلك القرى ملتبسًا بظلم حيث أهلكهم من غير إنذار، ففاعل الظلم، على الأول: القرى، وعلى الثاني: الله تعالى، على تقدير إهلاكهم من غير إنذار\n والأول يتمشى على مذهب المعتزلة، والثاني على مذهب أهل السنة\n انظر ابن جزي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:117",
      "similarity": 0.7107547114767021
    },
    {
      "verse": "29:31",
      "similarity": 0.5676109557726109
    },
    {
      "verse": "18:59",
      "similarity": 0.5649505436422642
    },
    {
      "verse": "15:4",
      "similarity": 0.5553929384989627
    },
    {
      "verse": "21:6",
      "similarity": 0.5449875334284686
    }
  ]
}