{
  "chapter": "الأنعام",
  "text": "يمعشر الجن والانس الم ياتكم رسل منكم يقصون عليكم ءايتى وينذرونكم لقاء يومكم هذا قالوا۟ شهدنا على انفسنا وغرتهم الحيوة الدنيا وشهدوا۟ على انفسهم انهم كانوا۟ كفرين",
  "translations": [
    {
      "translation": "Company of jinn and men! did not Messengers come to you from among yourselves relating My Signs to you and warning you of the encounter of this Day of yours? They will say, 'We testify against ourselves.' The life of this world deluded them and they will testify against themselves that they were kuffar.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you assembly of jinns and men, did not apostles come to you from among you, communicating My signs to you, bringing warnings of this your day (of Doom)?\" They will answer: \"We bear witness to our sins.\" They were surely deluded by the life of the world, and bore witness against themselves because they were unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Then Allah will also ask them): 'O assembly of jinn and men! Did there not come to y ou Messengers from among yourselves, relating to you My signs, and warning you of the encounter of this your Day (of Judgement)?' They will say: 'Yes, we bear witness against ourselves.' They have been deluded by the life of this world, and they will bear witness against themselves that they had disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When people and jinn are asked, \"Did not Messengers from your own people come to you to convey Our revelations and to warn you of the Day of Resurrection?\" They will reply, \"(Yes indeed).\" The worldly life deceived them. They will testify that they were unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O you groups of jinns and men! Did not the Noble Messengers amongst you come to you reciting My verses and warning you of confronting this day?” They will say, “We testify against ourselves” – and the worldly life deceived them and they will testify against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you assembly of Jinn and humans! \"Did not there come to you Messengers from amongst you, reciting unto you My verses and warning you of the meeting of this Day of yours\" They will say: \"We bear witness against ourselves.\" It was the life of this world that deceived them. And they will bear witness against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O assembly of jinn and men! did there not come to you apostles from among you, relating to you My communications and warning you of the meeting of this day of yours? They shall say: We bear witness against ourselves; and this world's life deceived them, and they shall bear witness against their own souls that they were unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Company of jinn and mankind, did not Messengers come to you from among you, relating to you My signs and warning you of the encounter of this your day?' They shall say, 'We bear witness against ourselves.' They were deluded by the present life, and they bear witness against themselves that they were unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye assembly of the jinn and humankind! Came there not unto you messengers of your own who recounted unto you My tokens and warned you of the meeting of this your Day? They will say: We testify against ourselves. And the life of the world beguiled them. And they testify against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Company of jinn and mankind! Did messengers not come from among you to recite My revelations to you, and warn you of the meeting of this Day?\" They will say, \"We bear witness against ourselves.\" It was the life of this world that deceived them and so they will bear witness against themselves, that they rejected the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye race of genii and mankind came there not apostles unto you from amongst you recounting unto you My signs and warning you of your meeting of this Day? They will say: we bear witness against ourselves. The life of the world hath deluded them, and they shall bear witness against themselves that verily they had been infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘O company of jinn and humans! Did there not come to you apostles from yourselves, recounting to you My signs and warning you of the encounter of this Day?’ They will say, ‘We testify against ourselves.’ The life of this world had deceived them, and they will testify against themselves that they had been faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye assembly of Jinns and men! came there not unto you messengers from amongst you, setting forth unto you My signs, and warning you of the meeting of this Day of yours?\" They will say: \"We bear witness against ourselves.\" It was the life of this world that deceived them. So against themselves will they bear witness that they rejected Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you assembly of jinns and mankind! \"Did not there come to you Messengers from amongst you, reciting unto you My Verses and warning you of the meeting of this Day of yours?\" They will say: \"We bear witness against ourselves.\" It was the life of this world that deceived them. And they will bear witness against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jinn and human, did there not come to you Messengers of your own who narrated to you My verses and warned you of encountering this Day' They will reply: 'We bear witness against ourselves' Indeed, the life of this world beguiled them. They will bear witness against themselves that they were unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O assembly of jinn and humans, did there not come to you messengers from among you, relating to you My revelations, and warning you of the meeting of this Day of yours?” They will say, “We testify against ourselves.” The life of the world seduced them. They will testify against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O company of jinn and mankind, did there not come to you messengers from among you, relating to you My verses and warning you of the meeting of this Day of yours?\" They will say, \"We bear witness against ourselves\"; and the worldly life had deluded them, and they will bear witness against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:130] ‘O assembly of jinn and mankind, did not messengers come to you from among you, that is, from among both of your number — which holds true in the case of mankind [since messengers came from among them], or [by ‘messengers’ if the jinn are meant] those messengers among the jinn who are their warners, the ones who listen to the speech of the [human] messengers and convey it to their kind — to recount to you My signs and to warn you of the encounter of this Day of yours?’ They shall say, ‘We bear witness   against ourselves’, that [all] this was conveyed to us. God, exalted be He, says: And the life of this world deluded them, and so they did not believe. And they bear witness against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 ye assembly of the jinn and, humankind! Came there not unto you messengers of your own) i.e. human messengers: Muhammad (pbuh) and all other messengers, and among the jinn, the nine who came to the Prophet (pbuh) and then went back to their people to deliver the message; it is also said that the jinn had a prophet of their own called Joseph, (who recounted) recited (unto you My tokens) detailing commands and prohibitions (and warned you of the meeting) the punishment (of this your Day? They) the humans and jinn (will say: We testify against ourselves) that they delivered the message and that we disbelieved them. Allah said: (And the life of the world) that which is in the life of this world of comfort and enjoyment (beguiled them. And they testify against themselves) in the Hereafter (that they were disbelievers) in the life of this world. 150\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فيتوالون ويحشرون معاً في العذاب كالجنّ والإنس الذين ذكرناهم أو نجعل بعضهم والى بعض بتعذيبه بمكسوباته في النار { رسل منكم } من البشر الذين هم جنسكم وعلى التآويل المذكورة من عقولكم التي هي قوى من جنسكم وهذه الأسئلة والأجوبة والشهادات كلها بلسان الحال وإظهار الأوصاف\n كما قيل:",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَٰمَعْشَرَ ٱلْجِنِّ وَٱلإِنْسِ } المفتضحين على رءوس الأشهاد { أَلَمْ يَأْتِكُمْ رُسُلٌ مِّنْكُمْ } غلب الإنس على الجن\n إذ ليس يبعث من الجن نبي بل من الإنس إلى الثقلين { يَقُصُّونَ عَلَيْكُمْ آيَاتِي } ويدعونكم إلى توحيد ذاتي وأوصافي وأفعالي { وَيُنذِرُونَكُمْ لِقَآءَ يَوْمِكُمْ هَـٰذَا } يوم القيامة والجزاء { قَالُواْ } مضطرين معترفين: { شَهِدْنَا عَلَىٰ أَنْفُسِنَا } يا ربنا بالجرم والعصيان بعدما ظهر الأمر وانكشف الحجاب\n وصرنا مستحقين بالعذاب والنكال { وَ } ما ذلك إلا أن { غَرَّتْهُمُ ٱلْحَيَاةُ ٱلدُّنْيَا } بحيث لم يبالوا بما جاءهم من عند ربهم لإهدائهم بل يكذبونه ويستهزئون به { وَ } أدى عاقبة أمرهم في عتوهم وعنادهم إلى أن { شَهِدُواْ } واعترفوا { عَلَىٰ أَنْفُسِهِمْ أَنَّهُمْ كَانُواْ كَافِرِينَ } [الأنعام: 130] مستحقين بأنواع العقوبة والعذاب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:5",
      "similarity": 0.48914538135400765
    },
    {
      "verse": "31:33",
      "similarity": 0.4203925608710508
    },
    {
      "verse": "82:6",
      "similarity": 0.40674920773642265
    },
    {
      "verse": "26:214",
      "similarity": 0.36493499221303616
    },
    {
      "verse": "4:164",
      "similarity": 0.3374780081730388
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/6:130.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/6:130.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:130.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}