{
  "chapter": "الأنعام",
  "text": "وكذلك زين لكثير من المشركين قتل اولدهم شركاؤهم ليردوهم وليلبسوا۟ عليهم دينهم ولو شاء الله ما فعلوه فذرهم وما يفترون",
  "translations": [
    {
      "translation": "In the same way their idols have made killing their children appear good to many of the idolaters, in order to destroy them and confuse them in their deen. If Allah had willed, they would not have done it; so abandon them and what they fabricate.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the same way have their companions shown many unbelievers the killing of their children as desirable in order to ruin them and falsify their faith. If God had so willed they would never have done so. Leave them to their falsehoods.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, likewise, the beings supposed to have a share in Allah's divinity have made the slaying of their offspring seem lawful to many of those who associate others with Allah in His divinity so that they may ruin them and confound them regarding their faith. If Allah had so willed, they would not have done that. Leave them alone to persist in their fabrication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To many of the pagans, the murder of their children was made to seem attractive by the idols. This led them (the pagans) to confusion in their religion and to face their own destruction. Had God wanted, they would not have murdered their children. Keep away from them and their evil gains.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And similarly, their partners (the devils) have made the killing of their children seem righteous in the sight of many of the polytheists, in order to ruin them and make their religion blurred to them; and if Allah willed they would not do so, therefore leave them alone with their fabrications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so to many of the idolators, their \"partners\" have made fair seeming the killing of their children, in order to lead them to their own destruction and cause confusion in their religion. And if Allah had willed, they would not have done so. So leave them alone with their fabrications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus their associates have made fair seeming to most of the polytheists the killing of their children, that they may cause them to perish and obscure for them their religion; and if Allah had pleased, they would not have done it, therefore leave them and that which they forge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus those associates of theirs have decked out fair to many idolaters to slay their children, to destroy them, and to confuse their religion for them. Had God willed, they would not have done so; so leave them to their forging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have their (so-called) partners (of Allah) made the killing of their children to seem fair unto many of the idolaters, that they may ruin them and make their faith obscure for them. Had Allah willed (it otherwise), they had not done so. So leave them alone with their devices.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in like manner, their associate gods have made killing their children seem fair to many pagans, so that they may ruin them and cause confusion in their religion. Had God pleased, they would not have done so; so leave them to their false inventions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even so their associate-gods have made fair seeming unto many of the associaters the slaying of their offspring, so that they may cause them to perish and that they may confound unto them their religion. And had Allah so willed, they would not have done it. Wherefore let thou alone them and that which they fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is how to most of the polytheists the slaying of their children is presented as decorous by those whom they ascribe as partners [to Allah], that they may ruin them and confound their religion for them. Had Allah wished, they would not have done it. So leave them with what they fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even so, in the eyes of most of the pagans, their \"partners\" made alluring the slaughter of their children, in order to lead them to their own destruction, and cause confusion in their religion. If Allah had willed, they would not have done so: But leave alone them and their inventions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so to many of the Mushrikun (polytheists - see V. 2:105) their (Allah's so-called) \"partners\" have made fair-seeming the killing of their children, in order to lead them to their own destruction and cause confusion in their religion. And if Allah had willed they would not have done so. So leave them alone with their fabrications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As such their associates made it attractive to the idolaters to kill their children so that they ruin them and confuse them about their religion. But had Allah willed, they would not have done so. Therefore, leave them to their false inventions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise, their idols entice many idolaters to kill their children, in order to lead them to their ruin, and confuse them in their religion. Had God willed, they would not have done it; so leave them to their fraud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And likewise, to many of the polytheists their partners have made [to seem] pleasing the killing of their children in order to bring about their destruction and to cover them with confusion in their religion. And if Allah had willed, they would not have done so. So leave them and that which they invent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:137] And thus, in the same way that what is mentioned was adorned for them, those associates of theirs, from among the jinn, have adorned for many of the idolaters the slaying of their children, by burying them alive (shurakā’uhum, ‘those associates of theirs’, is read in the nominative as the subject of the verb zayyana, ‘adorned’; an alternative reading has the passive [zuyyina, ‘it has been adorned’], with qatlu, ‘the slaying’, in the nominative [as the subject of this passive verb], awlādahum, ‘their children’, in the accusative on account of it [being the direct object of qatlu, ‘the slaying’], and shurakā’ihim in the genitive as an   annexation to qatlu, so that the object in this case intervenes between the two elements of the annexation [qatlu awlādahum shurakā’ihim, ‘their associates killing the children’] — this is acceptable [syntactically] — and the annexation of qatlu to shurakā’ihim [in this latter reading] is on account of them [the associates] commanding [the idolaters to do] this), that they may destroy them and to confuse, to make obscure, their religion for them. Had God willed, they would not have done so; so leave them and that which they fabricate.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thus) just as We have made their words and works seem fair to them (have their (so called) partners) among the devil (made the killing of their children) their daughters (to seem fair unto many of the idolaters, that they may ruin them) destroy them (and make their faith) the religion of Abraham and Ishmael (obscure for them. Had Allah willed (it otherwise), they had not done so) i.e. killing their daughters and making it seem fair to them. (So leave them alone with their devices) with their lies when they claim that Allah commanded them to bury their daughters alive.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لِيُرْدُوهُمْ } معناهُ ليهْلِكوهم\n\n",
      "translations": [
        {
          "translation": " And His saying, {Let them be destroyed} means that He will destroy them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَذٰلِكَ } أي: مثل قسمتهم في القربات والصدقات { زَيَّنَ } حبب وحسن { لِكَثِيرٍ مِّنَ ٱلْمُشْرِكِينَ قَتْلَ أَوْلَٰدِهِمْ شُرَكَآؤُهُمْ } أي: آلهتهم الذين يعبدونهم من دون الله من الشياطين\n وما ذلك التزيين والتحسين إلا { لِيُرْدُوهُمْ } ليهلكوهم ويضلوهم بالإغواء عن طريق الحق { وَلِيَلْبِسُواْ } ويخلطوا { عَلَيْهِمْ دِينَهُمْ } الذي وجب عليهم الانقياد والإطاعة ليصلوا إلى طريق التوحيد { وَلَوْ شَآءَ ٱللَّهُ } الهادي لعباده هدايتهم { مَا فَعَلُوهُ } أي: ما قبلوا ما زينوهم ولبسوا عليهم { فَذَرْهُمْ وَمَا يَفْتَرُونَ } [الأنعام: 137] أي: جانب عنهم وعن افترائهم إلى أن نأخذهم وننتقم عنهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: قرأ الجمهور: { زَيَّن } بالبناء للفاعل ونصب قتل، على أنه مفعول به، وخفض { أولادهم } بالإضافة ورفع { شركاؤهم } فاعل { زين } ، فالشركاء على هذه القراءة هم الذين زينوا القتل، وقرأ ابن عامر: بضم الزاي على البناء للمفعول، ورفع { قتل } على النيابة عن الفاعل، ونصب { أولادهم } على أنه مفعول بقتل، وخفض \" شركائهم \" بالإضافة إلى قتل، إضافة المصدر إلى فاعله، أي: زُين لهم أن يقتل شركاؤهم أولادهم، ففصل بين المضاف والمضاف إليه بأولادهم، وهو معمول للمصدر، وهو جائز في العربية، قال ابن مالك في الألفية:\nوهذا من فصل المفعول، فهو جائز في السعة خلافًا للزمخشري ومن تبعه، وقد شنَّع عليه الشاطبي في حرز الأماني. يقول الحقّ جلّ جلاله: ومثل ذلك التزيين الذي وقع لهم في الحرث والأنعام، { زَيَّن لكثير من المشركين قتل أولادهم } زين لهم ذلك شركاؤهم من الجن، أو من السدنَة، وحملوهم عليه، خوفًا من الجوع أو من العار، وكانوا يقتلون البنات دون البنين، زينوا لهم ذلك { لُيردُوهم } أي: ليهلكوهم بالإغواء، { وليلبسوا عليهم دينهم } أي: ليخلطوا عليهم ما كانوا عليه من دين إسماعيل، أو ما وجب عليهم أن يتدينوا به، { ولو شاء الله ما فعلوه } أي: ما فعل المشركين ما زين لهم، أو ما فعل الشركاء التزيين، أو الفريقان جميع ذلك، { فذرهم وما يفترون } أي: اتركهم مع افترائهم، أو: والذي يفترونه من الإفك، وهذا قبل الأمر بالسيف، ثم نسخ به. الإشارة: مما ينخرط في سلك الآية: إهانة البنات وتعظيم البنين، وقد نهى الشارع ـ عليه الصلاة والسلام ـ عن تخصيص الذكور بالوصية، وقال للذي أراد أن يفعله:\n \" لا تُشهدني على جور \" \n، وهنا إشارة أرق من هذا، وهو أن يراد بالأولاد ما تنتجه الفكرة الصافية من العلوم والمواهب، وقتلها: إهمال الفكرة عن استخراجها حتى ضاعت عليه، والذي زين له ذلك هو شرك القلب، واشتغاله برسوم الفرق، حتى تعطلت الفكرة، وماتت تلك العلوم من قلبه، وقع ذلك التزيين بأهل الفرق ليسقطوهم عن درجة المقربين أهل العلوم اللدنية والأسرار الربانية، وليلبسوا عليهم دينهم بالخواطر والشكوك، والأوهام، ولو شاء الله لهدى الناس جميعًا. ثم ذكر أيضاً نوعاً آخر من جهالتهم، فقال: { وَقَالُواْ هَـٰذِهِ أَنْعَامٌ وَحَرْثٌ حِجْرٌ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "92:11",
      "similarity": 0.6074717826294495
    },
    {
      "verse": "41:23",
      "similarity": 0.5821176207238554
    },
    {
      "verse": "20:16",
      "similarity": 0.5701868219043617
    },
    {
      "verse": "37:56",
      "similarity": 0.4970512730757818
    },
    {
      "verse": "6:9",
      "similarity": 0.26396676867556407
    }
  ]
}