{
  "chapter": "الأنعام",
  "text": "قل يقوم اعملوا۟ على مكانتكم انى عامل فسوف تعلمون من تكون له عقبة الدار انه لا يفلح الظلمون",
  "translations": [
    {
      "translation": "Say: 'My people, do as you are doing, just as I am doing. You will certainly come to know who will have the best home in the end. The wrongdoers will certainly not be successful.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"O my people, go on acting on your part, I am acting on mine. You will soon know whose is the guerdon of life to come.\" The wicked will not succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad!): 'O people! Work in your place; and I too am at work. Soon you will know in whose favour the ultimate decision will be. Surely the wrong-doers will not prosper.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell your people, \"I shall do whatever I can and you may do whatever you want, but you will soon know who will be victorious. It is certain that the unjust will never have happiness.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O dear Prophet Mohammed – peace and blessings be upon him), “O my people! Keep on with your works* in your positions, I am doing mine; soon you will come to know for whom is the abode of the Hereafter; undoubtedly the unjust are never successful.” (* This is said as a challenge)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O my people! Work according to your way, surely, I too am working, and you will come to know for which of us will be the (happy) end in the Hereafter. Certainly the wrongdoers will not be successful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: O my people! act according to your ability; I too am acting; so you will soon come to know, for whom (of us) will be the (good) end of the abode; surely the unjust shall not be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'O my people, act according to your station; I am acting. And assuredly you will know who shall possess the Abode Ultimate. Surely the evildoers will not prosper.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): O my people! Work according to your power. Lo! I too am working. Thus ye will come to know for which of us will be the happy sequel. Lo! the wrong-doers will not be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"O my people! Go on acting in your way; indeed I am going to act in my way; soon you will know whose end will be best in the Hereafter.\" Surely, the wrongdoers shall not prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou. O my people! go on acting in your way, verily I am going to act in my way, presently ye shall know whose will be the happy end of the abode; and verily the wrong-doers will not fare well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘O my people, act according to your ability; I too am acting. Soon you will know in whose favour the outcome of that abode will be. Indeed the wrongdoers will not be felicitous.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"O my people! Do whatever ye can: I will do (my part): soon will ye know who it is whose end will be (best) in the Hereafter: certain it is that the wrong-doers will not prosper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"O my people! Work according to your way, surely, I too am working (in my way), and you will come to know for which of us will be the (happy) end in the Hereafter. Certainly the Zalimun (polytheists and wrong-doers, etc.) will not be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Work according to your station my people, for indeed I am working' You shall know to whom will be the good end of the abode. The harmdoers shall not be triumphant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “O my people! Work according to your ability, and so will I.” You will come to know to whom will belong the sequel of the abode.” The wrongdoers will not prevail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"O my people, work according to your position; [for] indeed, I am working. And you are going to know who will have succession in the home. Indeed, the wrongdoers will not succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:135] Say, to them: ‘O my people, act according to your state, your circumstances; truly I am acting, according to my circumstances. And assuredly you will know whose (man: the relative particle introducing the object of the verb ‘you will know’) sequel shall be the abode, that is, [who shall have] the praiseworthy sequel in the abode of the Hereafter: will it be us or yourselves? Surely the evildoers, the disbelievers, will not prosper’, will not find happiness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي بعد قوله : { إنَّ ما توعدون آتٍ } \\[ الأنعام : 134 \\] فإنّ المقصود الأوّل منه هو وعيد المشركين ، كما مرّ ، فأعقبه بما تمحّض لوعيدهم : وهو الأمر المستعمل في الإنذار والتّهديد ، لِيُمْلِيَ لَهُمْ في ضلالهم إملاء يشعر ، في متعارف التّخاطُب ، بأنّ المأمور به ممّا يزيد المأمور استحقاقاً للعقوبة ، واقتراباً منها . أمر الله رسوله صلى الله عليه وسلم بأن يُناديهم ويُهَدّدهم . وأمر أن يبتدىء خطابهم بالنّداء للاهتمام بما سيقال لهم ، لأنّ النّداء يسترعي إسماع المنادَيْن ، وكان المنادي عنوانَ القوم لما يشعر به من أنّه قد رقّ لحالهم حين توعدهم بقوله : { إنَّ ما توعدون لآتتٍ وما أنتم بمعجزين } \\[ الأنعام : 134 \\] لأنّ الشأن أنّه يحبّ لقومه ما يحبّ لنفسه .والنّداء : للقوم المعاندين بقرينة المقام ، الدالّ على أنّ الأمر للتّهديد ، وأنّ عملهم مخالف لعمله ، لقوله : { اعملوا } مع قوله { إني عامل }.فالأمر في قوله : { اعملوا } للتسوية والتخلية لإظهار اليأس من امتثالهم للنّصح بحيث يغيِّر ناصِحهم نُصحهم إلى الإطلاق لهم فيما يحبّون أن يفعلوا ، كقوله تعالى : { اعملوا ما شئتم } \\[ فصلت : 40 \\] وهذا الاستعمال استعارة إذ يشبَّه المغضوب عليه المأيوس من ارعوائهِ بالمأمور بأن يَفعل ما كان يُنهى عنه ، فكأنّ ذلك المنهي صار واجباً ، وهذا تهكّم .والمكانة : المَكان ، جاء على التّأنيث مثل ما جاء المقامة للمقام ، والدارةُ اسماً للدار ، والماءة للماءِ الذّي يُنزل حوله ، يقال : أهل الماء وأهل المَاءة . والمكانة هنا مستعارة للحالة الّتي تلبّس بها المرء ، تشبَّه الحالة في إحاطتها وتلبّس صاحبها بها بالمكان الّذي يحوي الشّيء ، كما تقدّم اطلاق الدّار آنفاً في قوله تعالى : { لهم دار السّلام } \\[ الأنعام : 127 \\] ، أو تكون المكانة كناية عن الحالة لأنّ أحوال المرء تظهر في مكانه ومقرّه ، فلذلك يقال : «يا فلان على مَكانتك» أي أثبت على ما أنت عليه لا تنحرفْ عنه .ومفعول { اعملوا } محذوف لأنّ الفعل نزّل منزلة اللاّزم ، أي اعملوا عملكم المألوف الّذي هو دأبكم ، وهو الإعراض والتّكذيب بالحقّ .و { عَلَى } مستعملة في التمكّن على وجه الاستعارة التّبعيّة ، وهي مناسبة لاستعارة المكانة للحالة . لأنّ العلاوة تناسب المكان ، فهي ترشيح للاستعارة ، مستعار من ملائم المشبه به لملائم المشبه . والمعنى : الزموا حالكم فلا مَطمع لي في اتِّباعكم .وقرأ الجمهور : { على مكانتكم } بالإفراد . وقرأه أبو بكر عن عاصم : { مَكانَاتِكم } جمعَ مكانة . والجمع باعتبار جمع المضاف إليه .وجملة : { إني عامل } تعليل لمفاد التّسوية من الأمر في قوله : { اعملوا } أي لا يضرّني تصميمكم على ما أنتم عليه ، لكنّي مستمرّ على عملي ، أي أنِّي غير تارك لما أنا عليه من الإيمان والدّعاء إلى الله . وحذف متعلّق : { إني عامل } للتّعميم مع الاختصار ، وسيأتي تفصيله في نظيره من سورة الزمر .ورُتِّب على عملهم وعَمَلِه الإنذارُ بالوعيد { فسوف تعلمون } بفاء التّفريع للدّلالة على أنّ هذا الوعيد متفرّع على ذلك التّهديد .وحرف التّنفيس مراد منه تأكيد الوقوع لأنّ حرفَي التّنفيس يؤكّدان المستقبل كما تؤكّد ( قَدْ ) الماضي ، ولذلك قال سيبويه في الكلام على ( لَن ) : إنَّها لنفي سَيفعل ، فأخذ منه الزمخشري إفادتها تأكيد النّفي . وهذا صريح في التّهديد ، لأنّ إخبارهم بأنَّهم سيعلمون يفيد أنّه يعلم وقوع ذلك لا محالة ، وتصميمه على أنَّه عامل على مكانته ومخالف لعملهم يدلّ على أنّه موقن بحسن عقباه وسوء عقباهم ، ولولا ذلك لعَمِل عملهم ، لأنّ العاقل لا يرضى الضرّ لنفسه ، فدلّ قوله : { فسوف تعلمون } على أنّ علمهم يقع في المستقبل ، وأمّا هُو فَعَالِم من الآن ، ففيه كناية عن وثوقه بأنَّه مُحِقّ ، وأنَّهم مبطلون ، وسيجيء نظِير هذه الآية في قصّة شعيب من سورة هود .وقوله : { من تكون له عاقبة الدار } استفهام ، وهو يُعلِّق فعل العِلم عن العمل ، فلا يعطَى مفعولين استغناء بمُفاد الاستفهام؛ إذ التّقديرُ : تعلمون أحدَنا تكون له عاقبة الدار . وموضع : { من } رفع على الابتداء ، وجملة : { تكون له عاقبة الدار } خبره .والعاقبة ، في اللّغة : آخر الأمر ، وأثر عمل العامل ، فعاقبة كلّ شيء هي ما ينجلي عنه الشّيء ويظهرُ في آخره من أثر ونتيجة ، وتأنيثه على تأويل الحالة فلا يقال : عاقب الأمر ، ولكن عاقبة وعُقْبى .وقد خصّص الاستعمال لفظ العاقبة بآخرة الأمر الحَسَنَةِ ، قال الراغب : العاقبة والعقبى يختصّان بالثّواب نحو { والعاقبة للمتّقين } \\[ الأعراف : 128 \\] ، وبالإضافة قد يستعمل في العقوبة نحو { ثمّ كان عاقبة الّذين أساءوا السُّوأى } \\[ الروم : 10 \\] وقَلّ من نبَّه على هذا ، وهو من تدقيقه ، وشواهدُه في القرآن كثيرة .والدّار الموضع الّذي يحلّ به النّاس من أرض أو بناء ، وتقدّم آنفاً عند قوله تعالى : { لهم دار السّلام } \\[ الأنعام : 127 \\] ، وتعريف الدّار هنا تعريف الجنس . فيجوز أن يكون لفظ { الدار } مطلقاً ، على المعنى الحقيقي ، فإضافةُ { عاقبة } إلى { الدار } إضافة حقيقية ، أي حُسن الأخارة الحاصلُ في الدّار ، وهي الفوز بالدّار ، والفلج في النّزاع عليها ، تشبيهاً بما كان العرب يتنازعون على المنازل والمَراعي ، وبذلك يكون قوله : { من تكون له عاقبة الدار } استعارة تمثيلية مكنية ، شُبّهت حالة المؤمنين الفائزين في عملهم ، مع حالة المشركين ، بحالة الغالب على امتلاك دار عَدُوّه ، وطُوي المركَّب الدالّ على الهيئة المشبَّه بها ، ورُمز إليه بذكر ما هو من رَوادفه ، وهو { عاقبة الدار } ، فإنّ التّمثيليّة تكون مصرّحة ، وتكون مكنية ، وإن لم يُقسِّمُوهَا إليهما ، لكنّه تقسيم لا محيص منه . ويجوز أن تكون { الدار } مستعارة للحالة الّتي استقرّ فيها أحد ، تشبيها للحالة بالمكان في الاحتواء ، فتكون إضافة عاقبَة إلى الدار إضافة بيانية ، أي العاقبة الحسنى الّتي هي حالُه ، فيكون الكلام استعارة مصرّحة .ومن محاسنها هنا : أنّها بنت على استعارة المكانة للحالة في قوله : { اعملوا على مكانتكم } فصار المعنى : اعملوا في داركم ما أنتم عاملون فسوف تعلمون من تكون له عاقبة الدار .وفي الكلام مع ذلك إيماء إلى أنّ عاقبة تلك الدار ، أي بلد مكة ، أن تكون للمسلمين ، كقوله تعالى : { أنّ الأرض يرثها عبادي الصّالحون } \\[ الأنبياء : 105 \\] وقد فسّر قوله : { من تكون له عاقبة الدار } بغير هذا المعنى .وقرأ الجمهور : { مَن تكون } بتاء فوقيّة وقرأه حمزة ، والكسائي ، بتحتيّة ، لأنّ تأنيث عاقبة غير حقيقي ، فلمّا وقع فاعلاً ظاهراً فيجوز فيه أن يقرن بعلامة التّأنيث وبدونها .وجملة : { إنه لا يفلح الظالمون } تذييل للوعيد يتنزّل منزلة التّعليل ، أي لأنّه لا يفلح الظّالمون ، ستكون عقبى الدار للمسلمين ، لا لكم ، لأنّكم ظالمون .والتّعريف في { الظالمون } للاستغراق ، فيشمل هؤلاء الظّالمين ابتداء ، والضّمير المجعول اسم ( إنّ ) ضميرُ الشأن تنبيها على الاهتمام بهذا الخبر وأنّه أمر عظيم .\n\n",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the unbelievers of Mecca: (0 my people! Work according to your power) according to your religion in your own homes to destroy me. (Lo! I too am working) to destroy you. (Thus ye will come to know for which of us will be the happy sequel) i.e. Paradise. (Lo! the wrong-doers) the idolaters (will not be successful) safe nor will they escape from Allah's torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱعْمَلُواْ عَلَىٰ مَكَانَتِكُمْ } معناهُ عَلَى نَاحِيتِكُم\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Work on your position} means according to your capability.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم يا أكمل الرسل على طريق الترحم والتحنن إرخاء العنان مبالغة في التعريض: { يَٰقَوْمِ ٱعْمَلُواْ } من المعاصي { عَلَىٰ مَكَانَتِكُمْ } مقدار مكنتكم وطاقتكم { إِنَّي عَامِلٌ } أيضاً من الصالحات المأمورة علي بمقتضى مكنتي وطاقتي { فَسَوْفَ تَعْلَمُونَ } حين انكشف الحجب وارتفع الغشاء { مَن تَكُونُ لَهُ عَٰقِبَةُ ٱلدَّارِ } أي: العاقبة الحسنى التي تترتب على هذه الدار\n أي: أينا نفوز بها إنا أو أنتم؟ { إِنَّهُ لاَ يُفْلِحُ ٱلظَّٰلِمُونَ } [الأنعام: 135] الخارجون عن حدوده بمقتضى أهويتهم الفاسدة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { من تكون }: إما مفعول { تعلمون } ، أو مبتدأ، وهي إما موصولة أو استفهامية، والمكانة: التمكن أو الجهة، يقال: مكان ومكانة كمقام ومقامة. يقول الحقّ جلّ جلاله: { قل } يا محمد: { يا قوم اعملوا على مكانتكم } أي: تمكنكم من هواكم وشهواتكم التي أنتم عليها، أو على ناحيتكم وجهتكم التي أنتم عليها من الكفر والهوى، والمعنى: اثبتوا على ما أنتم عليه من الكفر والعداوة، { إني عامل } على ما أنا عليه من المصابرة والثبات على الدين الحق. والتهديد بصيغة الأمر مبالغة في الوعيد، كأن الذي يهدده يريد تعذيبه لا محالة، فيحمله بالأمر على ما يفضي به إليه، وتسجيلٌ بأن المهدد لا يأتي منه إلا الشر، كالمأمور به الذي لا يقدر أن ينقضي عنه. قاله البيضاوي. ثم صرح بالتهديد فقال: { فسوف تعلمون من تكون له عاقبة الدار } أي: أيُّنا تكون له العاقبة الحسنى التي خلق الله لها هذه الدار، أي: وهي الدار الآخرة، أو: فسوف تعرفون الذي تكون له عاقبة سكنى الدار الآخرة والنعيم المقيم، أو: من تكون له عاقبة هذه الدار بالنصر والظهور على الأديان ـ أنا أو أنتم، وفيه إنصاف في المقال حال الإنذار، وحسن الأدب، وتنبيهٌ على وثوق المنذِر لأنه محق. قال تعالى { إنه } ، أي: الأمر والشأن، { لا يُفلح الظالمون } ، والظلم أعلم من الكفر، ولذلك وضُع موضعه لعمومه. الإشارة: إذا انكب الناس على الدنيا، وأخذتهم الغفلة، وغلب عليهم الهوى، ثم وقع الوعظ والتذكير من أهل الإنذار، فقابَلوهم بالإبعاد والإنكار، يقول لهم المذكور والواعظ: { يا قوم اعلموا على مكانتكم إني عامل فسوف تعلمون من تكون له عاقبة الدار... } الآية. ثم ذكر جهالةالجاهليّة وحمقهم، فقال: { وَجَعَلُواْ للَّهِ مِمَّا ذَرَأَ مِنَ ٱلْحَرْثِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:37",
      "similarity": 0.7054915647615222
    },
    {
      "verse": "39:39",
      "similarity": 0.5366367208242928
    },
    {
      "verse": "13:24",
      "similarity": 0.42408199450026945
    },
    {
      "verse": "37:170",
      "similarity": 0.4033383619982845
    },
    {
      "verse": "2:5",
      "similarity": 0.4029019482933234
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006135.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006135.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:135.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}