{
  "chapter": "الأنعام",
  "text": "يمعشر الجن والانس الم ياتكم رسل منكم يقصون عليكم ءايتى وينذرونكم لقاء يومكم هذا قالوا۟ شهدنا على انفسنا وغرتهم الحيوة الدنيا وشهدوا۟ على انفسهم انهم كانوا۟ كفرين",
  "translations": [
    {
      "translation": "Company of jinn and men! did not Messengers come to you from among yourselves relating My Signs to you and warning you of the encounter of this Day of yours? They will say, 'We testify against ourselves.' The life of this world deluded them and they will testify against themselves that they were kuffar.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you assembly of jinns and men, did not apostles come to you from among you, communicating My signs to you, bringing warnings of this your day (of Doom)?\" They will answer: \"We bear witness to our sins.\" They were surely deluded by the life of the world, and bore witness against themselves because they were unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Then Allah will also ask them): 'O assembly of jinn and men! Did there not come to y ou Messengers from among yourselves, relating to you My signs, and warning you of the encounter of this your Day (of Judgement)?' They will say: 'Yes, we bear witness against ourselves.' They have been deluded by the life of this world, and they will bear witness against themselves that they had disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When people and jinn are asked, \"Did not Messengers from your own people come to you to convey Our revelations and to warn you of the Day of Resurrection?\" They will reply, \"(Yes indeed).\" The worldly life deceived them. They will testify that they were unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O you groups of jinns and men! Did not the Noble Messengers amongst you come to you reciting My verses and warning you of confronting this day?” They will say, “We testify against ourselves” – and the worldly life deceived them and they will testify against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you assembly of Jinn and humans! \"Did not there come to you Messengers from amongst you, reciting unto you My verses and warning you of the meeting of this Day of yours\" They will say: \"We bear witness against ourselves.\" It was the life of this world that deceived them. And they will bear witness against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O assembly of jinn and men! did there not come to you apostles from among you, relating to you My communications and warning you of the meeting of this day of yours? They shall say: We bear witness against ourselves; and this world's life deceived them, and they shall bear witness against their own souls that they were unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Company of jinn and mankind, did not Messengers come to you from among you, relating to you My signs and warning you of the encounter of this your day?' They shall say, 'We bear witness against ourselves.' They were deluded by the present life, and they bear witness against themselves that they were unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye assembly of the jinn and humankind! Came there not unto you messengers of your own who recounted unto you My tokens and warned you of the meeting of this your Day? They will say: We testify against ourselves. And the life of the world beguiled them. And they testify against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Company of jinn and mankind! Did messengers not come from among you to recite My revelations to you, and warn you of the meeting of this Day?\" They will say, \"We bear witness against ourselves.\" It was the life of this world that deceived them and so they will bear witness against themselves, that they rejected the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye race of genii and mankind came there not apostles unto you from amongst you recounting unto you My signs and warning you of your meeting of this Day? They will say: we bear witness against ourselves. The life of the world hath deluded them, and they shall bear witness against themselves that verily they had been infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘O company of jinn and humans! Did there not come to you apostles from yourselves, recounting to you My signs and warning you of the encounter of this Day?’ They will say, ‘We testify against ourselves.’ The life of this world had deceived them, and they will testify against themselves that they had been faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye assembly of Jinns and men! came there not unto you messengers from amongst you, setting forth unto you My signs, and warning you of the meeting of this Day of yours?\" They will say: \"We bear witness against ourselves.\" It was the life of this world that deceived them. So against themselves will they bear witness that they rejected Faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O you assembly of jinns and mankind! \"Did not there come to you Messengers from amongst you, reciting unto you My Verses and warning you of the meeting of this Day of yours?\" They will say: \"We bear witness against ourselves.\" It was the life of this world that deceived them. And they will bear witness against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Jinn and human, did there not come to you Messengers of your own who narrated to you My verses and warned you of encountering this Day' They will reply: 'We bear witness against ourselves' Indeed, the life of this world beguiled them. They will bear witness against themselves that they were unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O assembly of jinn and humans, did there not come to you messengers from among you, relating to you My revelations, and warning you of the meeting of this Day of yours?” They will say, “We testify against ourselves.” The life of the world seduced them. They will testify against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O company of jinn and mankind, did there not come to you messengers from among you, relating to you My verses and warning you of the meeting of this Day of yours?\" They will say, \"We bear witness against ourselves\"; and the worldly life had deluded them, and they will bear witness against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:130] ‘O assembly of jinn and mankind, did not messengers come to you from among you, that is, from among both of your number — which holds true in the case of mankind [since messengers came from among them], or [by ‘messengers’ if the jinn are meant] those messengers among the jinn who are their warners, the ones who listen to the speech of the [human] messengers and convey it to their kind — to recount to you My signs and to warn you of the encounter of this Day of yours?’ They shall say, ‘We bear witness   against ourselves’, that [all] this was conveyed to us. God, exalted be He, says: And the life of this world deluded them, and so they did not believe. And they bear witness against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذا من جملة المقاولة الّتي تجري يوم الحشر ، وفصلت الجملة لأنَّها في مقام تعداد جرائمهم التي استحقّوا بها الخلود ، إبطالاً لمعذرتهم ، وإعلاناً بأنَّهم محقوقون بما جُزوا به ، فأعاد نداءهم كما ينادَى المندّد عليه الموبَّخ فيزداد روْعاً .والهمزة في { ألم يأتيكم } للاستفهام التّقريري ، وإنَّما جعل السؤال عن نفي إتيان الرّسل إليهم لأنّ المقرّر إذا كان حاله في ملابسة المقرّر عليه حالَ من يُظنّ به أن يجيب بالنَّفي ، يؤتى بتقريره داخلاً على نفي الأمر الّذي المراد إقراره بإثباته ، حتّى إذا أقرّ بإثباته كان إقراره أقطع لعُذره في المؤاخذة به ، كما يقال للجاني : ألَسْت الفاعل كذا وكذا ، وألست القائل كذا ، وقد يسلك ذلك في مقام اختبار مقدار تمكّن المسؤول المقرّر من اليقين في المقرّر عليه ، فيؤتى بالاستفهام داخلاً على نفي الشّيء المقرّر عليه ، حتىّ إذا كانت له شبهة فيه ارتبك وتلعثم . ومنه قوله تعالى : { وأشهدهم على أنفسهم ألست بربّكم } \\[ الأعراف : 172 \\] ، ولمّا كان حال هؤلاء الجنّ والإنس في التمرّد على الله ، ونبذ العمل الصّالح ظهرياً ، والإعراض عن الإيمان ، حالَ من لم يطرق سمعه أمر بمعروف ولا نهي عن منكر ، جيء في تقريرهم على بعثَة الرّسل إليهم بصيغة الاستفهام عن نفي مجيء الرّسل إليهم ، حتّى إذا لم يجدوا لإنكار مجيء الرّسل مساغاً ، واعترفوا بمجيئهم ، كان ذلك أحرى لأخذهم بالعقاب .والرّسل : ظاهره أنّه جمع رسول بالمعنى المشهور في اصطلاح الشّرع ، أي مرسل من الله إلى العباد بما يرشدهم إلى ما يجب عليهم : من اعتقاد وعمل ، ويجوز أن يكون جمع رسول بالمعنى اللّغوي وهو من أرسله غيره كقوله تعالى : { إذْ جاءها المرسلون } \\[ يس : 13 \\] وهم رسل الحواريين بعد عيسى .فوَصْف الرّسل بقوله : { منكم } لزيادة إقامة الحجّة ، أي رسل تعرفونهم وتسمعونهم ، فيجوز أن يكون ( مِن ) اتِّصالية مثل الّتي في قولهم : لَسْتُ منك ولستَ مِنِّي ، وليست للتّبعيض ، فليست مثل الّتي في قوله : { هو الذي بعث في الأمّيين رسولاً منهم } \\[ الجمعة : 2 \\] وذلك أنّ رسل الله لا يكونون إلاّ من الإنس ، لأنّ مقام الرّسالة عن الله لا يليق أن يجعل إلاّ في أشرف الأجناس من الملائكة والبشر ، وجنسُ الجنّ أحَطّ من البشر لأنَّهم خلقوا من نار .وتكون ( من ) تبعيضية ، ويكون المراد بضمير : { منكم } خصوص الإنس على طريقة التغليب ، أو عود الضّمير إلى بعض المذكور قَبله كما في قوله تعالى : { يخرج منهما اللؤلؤ والمرجان } \\[ الرحمن : 22 \\] وإنما يخرج اللؤلؤ والمرجان من البحر الملح . فأمّا مؤاخذة الجنّ بمخالفة الرّسل فقد يخلق الله في الجنّ إلهاماً بوجوب الاستماع إلى دعوة الرّسل والعمل بها ، كما يدلّ عليه قوله تعالى في سورة الجنّ : { قُل أوحي إليّ أنه استمع نفر من الجنّ فقالوا إنَّا سمعنا قُرآناً عجبا }\\[ الجن : 1 \\] الآية ، وقال في سورة الأحقاف ( 30 ، 31 ) : { قالوا يا قَوْمنا إنَّا سمعنا كتابا أنزل من بعد موسى مصدّقا لما بين يديه يهدي إلى الحقّ وإلى طريق مستقيم يا قومنا أجيبوا داعي الله وآمنوا به يغفر لكم من ذنوبكم ويُجركم من عذاب أليم } ذلك أن الظواهر تقتضي أنّ الجنّ لهم اتّصال بهذا العالم واطّلاع على أحوال أهله : { إنَّه يَراكم هو وقبيلُه من حيث لا ترونهم } \\[ الأعراف : 27 \\] فضعف قول من قال بوُجود رسل من الجنّ إلى جنسهم ، ونُسب إلى الضحاك ، ولذلك فقوله : { ألم يأتيكم } مصروف عن ظاهره من شموله الإنس والجنّ ، ولم يرد عن النّبيء صلى الله عليه وسلم ما يثبت به أنّ الله أرسل رسلاً من الجنّ إلى جنسهم ، ويجوز أن يكون رسل الجنّ طوائف منهم يستمعون إلى الأنبياء ويفهمون ما يَدْعون إليه ويبلّغون ذلك إلى أقوامهم ، كما تقتضيه الآية في سورة الأحقاف؛ فمؤاخذة الجنّ على الإشراك بالله يقتضيها بلوغ توحيد الله إلى علمهم لأنّ أدلّة الوحدانيّة عقليّة لا تحتاج إلاّ إلى ما يُحرّك النّظر . فلمّا خلق الله للجنّ علماً بما تجيء به رسل الله من الدّعاء إلى النّظر في التّوحيد فقد توجَّهت عليهم المؤاخذة بترك الإيمان بوحدانيّة الله تعالى فاستحقّوا العذاب على الإشراك دون توقف على توجيه الرّسل دعوتهم إليهم .ومن حسن عبارات أيمّتنا أنَّهم يقولون : الإيمان واجب على مَن بلَغَتْه الدّعوة ، دون أن يقولوا : على مَن وُجّهت إليه الدّعوة . وطرق بلوغ الدّعوة عديدة ، ولم يثبت في القرآن ولا في صحيح الآثار أنّ النّبيء محمّداً صلى الله عليه وسلم ولا غيرَه من الرّسل ، بُعث إلى الجنّ لانتفاء الحكمة من ذلك ، ولعدم المناسبة بين الجنسين ، وتعذّر تخالطهما ، وعن الكلبي أنّ محمّداً صلى الله عليه وسلم بعث إلى الإنس والجنّ ، وقاله ابن حزم ، واختاره أبو عُمر ابن عبد البرّ ، وحكَى الاتِّفاق عليه : فيكون من خصائص النّبيء محمّد صلى الله عليه وسلم تشريفاً لقدره . والخوض في هذا ينبغي للعالم أن يربأ بنفسه عنه لأنَّه خوض في أحوال عالَم لا يدخل تحت مُدْرَكاتنا ، فإنّ الله أنبأنا بأنّ العوالم كلّها خاضعة لسلطانه . حقيق عليها طاعته ، إذا كانت مدركة صالحة للتكليف .والمقصود من الآية الّتي نتكلّم عليها إعلامُ المشركين بأنَّهم مأمورون بالتّوحيد والإسلام وأنّ أولياءهم من شياطين الإنس والجن غير مفلتين من المؤاخذة على نبذ الإسلام . بلْهَ أتْباعهم ودهمائهم . فذكر الجنّ مع الإنس في قوله : { يا معشر الجن والإنس } يوم القيامة لتبكيت المشركين وتحْسيرهم على ما فرط منهم في الدّنيا من عبادة الجنّ أو الالتجاءِ إليهم ، على حدّ قوله تعالى : { ويوم يحشرهم وما يَعبدون من دون الله فيقول أنتم أضللتم عبادي هؤلاء } \\[ الفرقان : 17 \\] وقوله : { وإذ قال الله يا عيسى ابن مريم أنتَ قلتَ للنّاس اتَّخذوني وأمِّي إلهين من دون الله }\\[ المائدة : 116 \\].والقَصّ كالقَصَص : الإخبار ، ومنه القصّة للخبر ، والمعنى : يخبرونكم الأخْبار الدالّة على وحدانيّة الله وأمره ونهيه ووعده ووعيده ، فسمّى ذلك قَصَّاً؛ لأنّ أكثره أخبار عن صفات الله تعالى وعن الرّسل وأممهم وما حلّ بهم وعن الجزاء بالنّعيم أو العذاب . فالمراد من الآيات آيات القرآن والأقوالُ الّتي تتلى فيفهمها الجنّ بإلهام ، كما تقدّم آنفاً ، ويفهمها الإنس ممّن يعرف العربيّة مباشرة ومن لا يعرف العربيّة بالتّرجمة .والإنذار : الإخبار بما يُخِيف ويُكره ، وهو ضدّ البشارة ، وتقدّم عند قوله تعالى : { إنّا أرسلناك بالحقّ بشيراً ونذيراً } في سورة البقرة ( 119 ) ، وهو يتعدّى إلى مفعول بنفسه وهو الملقى إليه الخبر ، ويتعدّى إلى الشّيء المخبر عنه : بالباء ، وبنفسه ، يقال : أنذرته بكذا وأنذرته كَذا ، قال تعالى : { فأنذرتكم ناراً تلظّى } \\[ الليل : 14 \\] ، { فقُل أنذرتكم صاعقة } \\[ فصلت : 13 \\] ، { وتُنْذِرَ يومَ الجمع } \\[ الشورى : 7 \\] ولمّا كان اللّقاء يوم الحشر يتضمّن خيراً لأهل الخير وشرّا لأهل الشرّ ، وكان هؤلاء المخاطبون قد تمحّضوا للشرّ ، جُعل إخبار الرّسل إيَّاهم بلقاء ذلك اليوم إنذاراً لأنَّه الطَّرف الّذي تحقّق فيهم من جملة إخبار الرّسل إيَّاهم ما في ذلك اليوم وشرّه . ووصف اليوم باسم الإشارة في قوله : { يومكم هذا } لتهويل أمر ذلك بما يشاهد فيه ، بحيث لا تحيط العبارة بوصفه ، فيعدل عنها إلى الإشارة كقوله : { هذه النّار التي كنتم بها تكذّبون } \\[ الطور : 14 \\].ومعنى قولهم : { شهدنا على أنفسنا } الإقرارُ بما تضمّنه الاستفهام من إتيان الرّسل إليهم ، وذلك دليل على أن دخول حرف النّفي في جملة الاستفهام ليس المقصود منه إلاّ قطع المعذرة وأنّه أمر لا يسع المسؤولَ نفيُه ، فلذلك أجملوا الجواب : { قالوا شهدنا على أنفسنا } ، أي أقررنا بإتيان الرّسل إلينا .واستعملت الشّهادة في معنى الإقرار لأنّ أصل الشّهادة الإخبار عن أمر تحقّقه المخبر وبيَّنه ، ومنه : { شهد الله أنَّه لا إله إلا هو والملائكةُ وأولوا العلم قائماً بالقسط } \\[ آل عمران : 18 \\]. وشهد عليه ، أخبر عنه خبرَ المتثبت المتحقّق ، فلذلك قالوا : { شهدنا على أنفسنا } أي أقررنا بإتيان الرّسل إلينا . ولا تنافي بين هذا الإقرار وبين إنكارهم الشّرك في قوله : { إلاّ أن قالوا والله ربّنا ما كنّا مشركين } \\[ الأنعام : 23 \\] لاختلاف المخبر عنه في الآيتين . وفُصِلت جملة : { قالوا } لأنَّها جارية في طريقة المحاورة .وجملة { وغرتهم الحياة الدنيا } معطوفة على جملة : { قالوا شهدنا } باعتبار كون الأولى خبراً عن تبيّن الحقيقة لهم ، وعلمهم حينئذ أنَّهم عَصوا الرّسل ومَن أرسلهم . وأعرضوا عن لقاء يومهم ذلك . فعلموا وعلم السّامع لخبرهم أنَّهم ما وقعوا في هذه الربقة إلاّ لأنَّهم غرّتهم الحياة الدّنيا ، ولولا ذلك الغرور لما كان عملهم ممّا يرضاه العاقل لنفسه .والمراد بالحياة أحوالها الحاصلة لهم : من اللّهو ، والتّفاخر ، والكبر ، والعناد . والاستخفاف بالحقائق ، والاغترار بما لا ينفع في العاجل والآجل . والمقصود من هذا الخبر عنهم كشف حالهم ، وتحذير السّامعين من دوام التورّط في مثله . فإنّ حالهم سواء .وجملة : { وشهدوا على أنفسهم أنهم كانوا كافرين } معطوفة على جملة : { وغرتهم الحياة الدنيا } وهو خبر مستعمل في التعجيب من حالهم ، وتخطئة رأيهم في الدّنيا .وسوء نظرهم في الآيات ، وإعراضهم عن التدبّر في العواقب . وقد رُتّب هذا الخبرُ على الخبر الّذي قبله ، وهو اغترارهم بالحياة الدّنيا ، لأنّ ذلك الاغترار كان السبب في وقوعهم في هذه الحال حتّى استسلموا وشهدوا على أنفسهم أنَّهم كانوا في الدّنيا كافرين بالله ، فأمّا الإنس فلأنَّهم أشركوا به وعبدوا الجنّ ، وأمّا الجنّ فلأنَّهم أغروا الإنس بعبادتهم ووضعوا أنفسهم شركاء لله تعالى ، فكِلا الفريقين من هؤلاء كافر ، وهذا مثل ما أخبرَ الله عنهم أو عن أمثالهم بمثل هذا الخبر التعجيبي في قوله : { وقالوا لو كنّا نسمع أو نعقل ما كنّا في أصحاب السعير فاعترفوا بذنبهم } \\[ الملك : 10 ، 11 \\]. فانظر كيف فرّع على قولهم أنَّهم اعترفوا بذنبهم ، مع أنّ قولهم هو عين الاعتراف ، فلا يفرّع الشّيء عن نفسه ، ولكن أريد من الخبر التّعجيب من حالهم ، والتسميع بهم ، حين ألجئوا إلى الاعتراف في عاقبة الأمر .وشهادتهم على أنفسهم بالكفر كانت بعد التّمحيص والإلجاء ، فلا تنافي أنَّهم أنكروا الكفر في أوّل أمر الحساب ، إذ قالوا : { والله ربّنا ما كنّا مشركين } \\[ الأنعام : 23 \\]. قال سعيد بن جبير : قال رجل لابن عبّاس : «إنِّي أجد أشياء تختلف عليّ قال اللَّهُ : { ولا يكتمون الله حديثاً } \\[ النساء : 42 \\] ، وقال : { إلاّ أن قالوا واللَّهِ ربّنا ما كنّا مشركين } \\[ الأنعام : 23 \\] ، فقد كَتَموا . فقال ابن عبّاس : إنّ الله يغفر لأهل الإخلاص ذنوبهم ، فقال المشركون : تَعالوا نقل : ما كنّا مشركين ، فختم الله على أفواههم فتنطق أيديهم» .\n\n",
      "translations": [
        {
          "translation": "(0 ye assembly of the jinn and, humankind! Came there not unto you messengers of your own) i.e. human messengers: Muhammad (pbuh) and all other messengers, and among the jinn, the nine who came to the Prophet (pbuh) and then went back to their people to deliver the message; it is also said that the jinn had a prophet of their own called Joseph, (who recounted) recited (unto you My tokens) detailing commands and prohibitions (and warned you of the meeting) the punishment (of this your Day? They) the humans and jinn (will say: We testify against ourselves) that they delivered the message and that we disbelieved them. Allah said: (And the life of the world) that which is in the life of this world of comfort and enjoyment (beguiled them. And they testify against themselves) in the Hereafter (that they were disbelievers) in the life of this world. 150\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فيتوالون ويحشرون معاً في العذاب كالجنّ والإنس الذين ذكرناهم أو نجعل بعضهم والى بعض بتعذيبه بمكسوباته في النار { رسل منكم } من البشر الذين هم جنسكم وعلى التآويل المذكورة من عقولكم التي هي قوى من جنسكم وهذه الأسئلة والأجوبة والشهادات كلها بلسان الحال وإظهار الأوصاف\n كما قيل:",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَٰمَعْشَرَ ٱلْجِنِّ وَٱلإِنْسِ } المفتضحين على رءوس الأشهاد { أَلَمْ يَأْتِكُمْ رُسُلٌ مِّنْكُمْ } غلب الإنس على الجن\n إذ ليس يبعث من الجن نبي بل من الإنس إلى الثقلين { يَقُصُّونَ عَلَيْكُمْ آيَاتِي } ويدعونكم إلى توحيد ذاتي وأوصافي وأفعالي { وَيُنذِرُونَكُمْ لِقَآءَ يَوْمِكُمْ هَـٰذَا } يوم القيامة والجزاء { قَالُواْ } مضطرين معترفين: { شَهِدْنَا عَلَىٰ أَنْفُسِنَا } يا ربنا بالجرم والعصيان بعدما ظهر الأمر وانكشف الحجاب\n وصرنا مستحقين بالعذاب والنكال { وَ } ما ذلك إلا أن { غَرَّتْهُمُ ٱلْحَيَاةُ ٱلدُّنْيَا } بحيث لم يبالوا بما جاءهم من عند ربهم لإهدائهم بل يكذبونه ويستهزئون به { وَ } أدى عاقبة أمرهم في عتوهم وعنادهم إلى أن { شَهِدُواْ } واعترفوا { عَلَىٰ أَنْفُسِهِمْ أَنَّهُمْ كَانُواْ كَافِرِينَ } [الأنعام: 130] مستحقين بأنواع العقوبة والعذاب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:5",
      "similarity": 0.48914538135400765
    },
    {
      "verse": "31:33",
      "similarity": 0.4203925608710508
    },
    {
      "verse": "82:6",
      "similarity": 0.40674920773642265
    },
    {
      "verse": "26:214",
      "similarity": 0.36493499221303616
    },
    {
      "verse": "4:164",
      "similarity": 0.3374780081730388
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006130.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006130.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:130.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}