{
  "chapter": "الأنعام",
  "text": "وكذلك زين لكثير من المشركين قتل اولدهم شركاؤهم ليردوهم وليلبسوا۟ عليهم دينهم ولو شاء الله ما فعلوه فذرهم وما يفترون",
  "translations": [
    {
      "translation": "In the same way their idols have made killing their children appear good to many of the idolaters, in order to destroy them and confuse them in their deen. If Allah had willed, they would not have done it; so abandon them and what they fabricate.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the same way have their companions shown many unbelievers the killing of their children as desirable in order to ruin them and falsify their faith. If God had so willed they would never have done so. Leave them to their falsehoods.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, likewise, the beings supposed to have a share in Allah's divinity have made the slaying of their offspring seem lawful to many of those who associate others with Allah in His divinity so that they may ruin them and confound them regarding their faith. If Allah had so willed, they would not have done that. Leave them alone to persist in their fabrication.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To many of the pagans, the murder of their children was made to seem attractive by the idols. This led them (the pagans) to confusion in their religion and to face their own destruction. Had God wanted, they would not have murdered their children. Keep away from them and their evil gains.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And similarly, their partners (the devils) have made the killing of their children seem righteous in the sight of many of the polytheists, in order to ruin them and make their religion blurred to them; and if Allah willed they would not do so, therefore leave them alone with their fabrications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so to many of the idolators, their \"partners\" have made fair seeming the killing of their children, in order to lead them to their own destruction and cause confusion in their religion. And if Allah had willed, they would not have done so. So leave them alone with their fabrications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus their associates have made fair seeming to most of the polytheists the killing of their children, that they may cause them to perish and obscure for them their religion; and if Allah had pleased, they would not have done it, therefore leave them and that which they forge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus those associates of theirs have decked out fair to many idolaters to slay their children, to destroy them, and to confuse their religion for them. Had God willed, they would not have done so; so leave them to their forging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus have their (so-called) partners (of Allah) made the killing of their children to seem fair unto many of the idolaters, that they may ruin them and make their faith obscure for them. Had Allah willed (it otherwise), they had not done so. So leave them alone with their devices.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in like manner, their associate gods have made killing their children seem fair to many pagans, so that they may ruin them and cause confusion in their religion. Had God pleased, they would not have done so; so leave them to their false inventions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even so their associate-gods have made fair seeming unto many of the associaters the slaying of their offspring, so that they may cause them to perish and that they may confound unto them their religion. And had Allah so willed, they would not have done it. Wherefore let thou alone them and that which they fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is how to most of the polytheists the slaying of their children is presented as decorous by those whom they ascribe as partners [to Allah], that they may ruin them and confound their religion for them. Had Allah wished, they would not have done it. So leave them with what they fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even so, in the eyes of most of the pagans, their \"partners\" made alluring the slaughter of their children, in order to lead them to their own destruction, and cause confusion in their religion. If Allah had willed, they would not have done so: But leave alone them and their inventions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so to many of the Mushrikun (polytheists - see V. 2:105) their (Allah's so-called) \"partners\" have made fair-seeming the killing of their children, in order to lead them to their own destruction and cause confusion in their religion. And if Allah had willed they would not have done so. So leave them alone with their fabrications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As such their associates made it attractive to the idolaters to kill their children so that they ruin them and confuse them about their religion. But had Allah willed, they would not have done so. Therefore, leave them to their false inventions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Likewise, their idols entice many idolaters to kill their children, in order to lead them to their ruin, and confuse them in their religion. Had God willed, they would not have done it; so leave them to their fraud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And likewise, to many of the polytheists their partners have made [to seem] pleasing the killing of their children in order to bring about their destruction and to cover them with confusion in their religion. And if Allah had willed, they would not have done so. So leave them and that which they invent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:137] And thus, in the same way that what is mentioned was adorned for them, those associates of theirs, from among the jinn, have adorned for many of the idolaters the slaying of their children, by burying them alive (shurakā’uhum, ‘those associates of theirs’, is read in the nominative as the subject of the verb zayyana, ‘adorned’; an alternative reading has the passive [zuyyina, ‘it has been adorned’], with qatlu, ‘the slaying’, in the nominative [as the subject of this passive verb], awlādahum, ‘their children’, in the accusative on account of it [being the direct object of qatlu, ‘the slaying’], and shurakā’ihim in the genitive as an   annexation to qatlu, so that the object in this case intervenes between the two elements of the annexation [qatlu awlādahum shurakā’ihim, ‘their associates killing the children’] — this is acceptable [syntactically] — and the annexation of qatlu to shurakā’ihim [in this latter reading] is on account of them [the associates] commanding [the idolaters to do] this), that they may destroy them and to confuse, to make obscure, their religion for them. Had God willed, they would not have done so; so leave them and that which they fabricate.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطفٌ على جملة : { وجعلوا لله ممّا ذرأ من الحرث والأنعام نصيباً } \\[ الأنعام : 136 \\] والتقدير : جَعَلوا وزيَّنَ لهم شركاؤُهم قتلَ أولادِهم فقتلوا أولادَهم ، فهذه حكاية نوع من أنواع تشريعاتهم الباطلة ، وهي راجعة إلى تصرّفهم في ذُرّيَّاتهم بعد أن ذكر تصرّفاتهم في نتائج أموالهم . ولقد أعظم الله هذا التّزيين العجيب في الفساد الّذي حَسَّن أقبح الأشياء وهو قتْلهم أحبّ النّاس إليهم وهم أبناؤهم ، فشبه بنفس التزيين للدّلالة على أنّه لو شاء أحد أن يمثّله بشيء في الفظاعة والشّناعة لم يَسَعْه إلاّ أن يشبهه بنفسه لأنَّه لا يبلغ شيء مبلغ أن يكون أظهرَ منه في بابه ، فيلجأ إلى تشبيهه بنفسه ، على حدّ قولهم «والسّفاهة كاسمها» . والتّقدير : وزيّن شركاء المشركين لكثير فيهم تزييناً مثل ذلك التّزيين الّذي زيّنوه لهم ، وهُو هُو نفسه ، وقد تقدّم تفصيل ذلك عند قوله تعالى : { وكذلك جعلناكم أمّة وسطاً } في سورة \\[ البقرة : 143 \\].ومعنى التّزيين التّحسين ، وتقدّم عند قوله تعالى : { كذلك زيَّنَّا لكلّ أمّة عملهم } في هذه السورة \\[ 108 \\]. ومعنى تزيين ذلك هنا أنَّهم خيَّلوا لهم فوائد وقُرَباً في هذا القتل ، بأن يُلقوا إليهم مَضرّة الاستجداء والعار في النّساء ، وأنّ النّساء لا يرجى منهنّ نفع للقبيلة ، وأنَّهنّ يُجَبِّنّ الآباء عند لقاء العدوّ ، ويؤثرن أزواجهن على آبائهن ، فقتلهنّ أصلَحُ وأنفع من استبقائهن ، ونحوَ هذا من الشّبه والتّمويهات ، فيأتونهم من المعاني الّتي تروج عندهم ، فإنّ العرب كانوا مُفرطين في الغيرة ، والجموح من الغلب والعار كما قال النّابغة: ... حِذَاراً على أنْ لاَ تُنَالَ مَقَادَتِيولا نسوتي حتَّى يَمُتْنَ حَرائراً ... وإنَّما قال : لكثير من المشركين } لأنّ قتل الأولاد لم يكن يأتيه جميع القبائل ، وكان في ربيعة ومضر ، وهما جمهرة العرب ، وليس كلّ الآباء من هاتين القبيلتين يفعله .وأسند التّزيين إلى الشّركاء : إمّا لإرادة الشّياطين الشّركاءِ ، فالتّزيين تزيين الشّياطين بالوسوسة ، فيكون الإسناد حقيقة عقليّة ، وإمّا لأنّ التّزيين نشأ لهم عن إشاعة كبرائهم فيهم ، أو بشرع وضعه لهم مَن وضَع عبادة الأصنام وفرض لها حقوقاً في أموالهم مثل عَمْرو بن لُحَي ، فيكون إسناد التّزيين إلى الشّركاء مجازاً عقلياً لأنّ الأصنام سبب ذلك بواسطةٍ أو بواسطتين ، وهذا كقوله تعالى : { فما أغنت عنهم آلِهَتُهم التي يَدْعُون من دون الله من شيء لمّا جاء أمر ربّك وما زادوهم غير تتبيب } \\[ هود : 101 \\].والمعنيّ بقتل الأولاد في هذه الآية ونحوها هو الوأْد ، وهو دفن البنات الصغيرات أحياء فيمتن بغمّة التّراب ، كانوا يفعلون ذلك خشية الفقر ، كما قال تعالى : { ولا تقتلوا أولادكم خَشيةَ إملاق } \\[ الإسراء : 31 \\] ، وخشيةَ أن تفتضح الأنثى بالحاجة إذا هلك أبوها ، أو مخافة السّباء ، وذكر في «الروض الأنُف» عن النّقّاش في «تفسيره» : أنَّهم كانوا يئدون من البنات من كانت زَرقاء أو برشاء ، أو شَيْماء ، أو رَسْحاءَ ، تشاؤما بِهنّ وهذا من خَوَر أوْهَامهم وأنّ ذلك قوله تعالى :{ وإذا الموءودة سُئِلت بأي ذنب قتلت } \\[ التكوير : 8 ، 9 \\] ، وقيل : كانوا يفعلون ذلك من شدّة الغيرة خشية أن يأتين ما يَتعيَّر منه أهلهنّ .وقد ذكر المبرّد في «الكامل» ، عن أبي عبيدة : أنّ تميماً مَنَعت النّعمانَ بن المُنذر الإتاوة فوجّه إليهم أخاه الريان بن المنذر فاستاق النّعم وسبَى الذّراري ، فوفدت إليه بنو تميم فأنابوا وسألوه النّساء فقال النّعمان : كلّ امرأة اختارت أباها رُدّت إليه وإن اختارت صاحبها ( أي الّذي صارت إليه بالسبي ) تُركت عليه فكُلّهنّ اختارت أباها إلاّ ابنة لقيس بن عاصم اختارت صاحبَها عمرو بن المشمرِج ، فنذر قيس أن لا تولد له ابنة إلاّ قتلها فهذا شيء يَعتلّ به مَنْ وأدوا ، يقولون : فعلناه أنفة ، وقد أكذب الله ذلك في القرآن ، أي بقوله : { قد خَسِر الذين قتلوا أولادهم سَفَهاً } \\[ الأنعام : 140 \\].وذكر البخاري ، أنّ أسماء بنت أبي بكر ، قالت : كان زيدُ بن عَمرو بن نُفَيل يُحيي الموءودة ، يقول للرجل إذا أراد أن يقتل ابنته : لا تقتُلْها أنا أكفيكَ مؤونتها ، فيأخذها فإذا ترعرعت قال لأبيها : إن شئتَ دفعتُها إليك وإن شئتَ كفيتك مؤونتها . والمعروف أنَّهم كانوا يئدون البنت وقت ولادتها قبل أن تراها أُمّها ، قال الله تعالى : { وإذَا بشِّر أحدهم بالأنْثى ظَلّ وجهه مُسْوَدّا وهو كظيم يتوارى من القوم من سُوء ما بشِّر به أيُمْسِكه على هُون أم يدسّه في التّراب ألاَ ساء ما يحكمون } \\[ النحل : 58 ، 59 \\]. وكان صعصعة بن معاوية من مجاشع ، وهو جدّ الفرزدق ، يفدي الموءودة ، يفعل مثل فعل زيد بن عمرو بن نفيل . وقد افتخر الفرزدق بذلك في شعره في قوله: ... ومنّا الّذي منع الوائداتْوأحيا الوئيد فلم تُوءَد ... وقد أدرك جدّه الإسلام فأسلم . ولا يعرف في تاريخ العرب في الجاهليّة قتل أولادهم غير هذا الوأد إلاّ ما ورد من نذر عبد المطّلب الّذي سنذكره ، ولا ندري هل كان مثل ذلك يقع في الجاهليّة قبل عبد المطّلب أو أنّه هو الذي ابتكر ذلك ولم يتابَع عليه . ولا شكّ أنّ الوأد طريقة سنّها أيمّة الشّرك لقومهم ، إذ لم يكونوا يصدرون إلاّ عن رأيهم ، فهي ضلالة ابتدعوها لقومهم بعلّة التخلّص من عوائق غزوهم أعداءَهم ، ومن معرّة الفاقة والسباء ، وربّما كان سدنة الأصنام يحرّضونهم على إنجاز أمر الموءودة إذا رأوا من بعضهم تثاقلا ، كما أشار إليه «الكشاف» إذ قال : «والمعنى أنّ شركاؤهم من الشّياطين أو من سدنة الأصنام زيَّنوا لهم قتل أولادهم بالوأد أو بالنّحر» . وقال ابن عطيّة : والشّركاء على هذه القراءة هم الّذين يتناولون وأد بنات الغير فهم القاتلون .وفي قصّة عبد المطّلب ما يشهد لذلك فإنَّه نذر إن رزقه الله عشرة أولاد ذكور ، ثمّ بلغوا معه أن يمنعوه من عدوّه ، لينحرنّ أحدهم عند الكعبة ، فلمّا بلغ بنوه عشرة بهذا المبلغ دَعاهم إلى الوفاء بنذره فأطاعوه واستقسم بالأزلام عند ( هُبل ) الصّنم وكان ( هبل ) في جوف الكعبة ، فخرج الزلم على ابنه عبد الله فأخذه ليذبحه بين ( إساف ) و ( نائلة ) فقالت له قريش : لا تذبحْه حتّى تُعذِر فيه ، فإن كان له فداء فديناه ، وأشاروا عليه باستفتاء عَرّافة بخيبرَ فركبوا إليها فسألوها وقصّوا عليها الخبر فقالت : قَرّبوا صاحبكم وقَرّبوا عشراً من الإبل ثمّ اضربوا عليها وعليه بالقداح فإن خرجتْ على صاحبكم فزيدوا من الإبل حتّى يرضى رَبّكم ، وكذلك فعلوا فخرج القِدح على عبد الله ، فلم يزل عبد المطلب يزيد عشراً من الإبل ويضرب عليها بالقداح ويخرج القِدح على عبد الله حتّى بلغت الإبل مائة فضرب عليها فخرج القِدح على الإبل فنحرها .ولعلّ سدنة الأصنام كانوا يخلطون أمر الموءودة بقصد التقرّب إلى أصنام بعض القبائل ( كما كانت سنّة موروثة في الكنعانيين من نَبط الشّام يقرّبون صبيانهم إلى الصنم ملوك ، فتكون إضافة القتل إلى الشّركاء مستعملة في حقيقتها ومجازها .وقرأ الجمهور : { زَيَّنَ } بفتح الزاي ونصب : { قتل } على المفعوليّة ل { زيَّن } ، ورفععِ شركاؤهم على أنّه فاعل : { زين } ، وجرّ { أولادهم } بإضافة قَتْل إليه من إضافة المصدر إلى مفعوله . وقرأه ابن عامر : { زين لكثير من المشركين قتل أولادهم شركائِهم } ببناء فعل { زين } للنّائب ، ورفع { قتل } على أنه نائب الفاعل ، ونصب { أولادهم } على أنَّه مفعول { قتل } ، وجَرّ { شركائهم } على إضافة { قتل } إليه من إضافة المصدر إلى فاعله ، وكذلك رسمت كلمة { شركائهم } في المصحف العثماني الّذي ببلاد الشّام ، وذلك دليل على أنّ الّذين رَسموا تلك الكلمة راعوا قراءة { شركائهم } بالكسر وهم من أهل الفصاحة والتّثبت في سند قراءات القرآن ، إذا كتب كلمة { شركائهم } بصورة الياء بعد الألف ، وذلك يدلّ على أنّ الهمزة مكسورة ، والمعنى ، على هذه القراءة : أنّ مزيِّنا زَيَّن لكثير من المشركين أن يَقْتُلَ شركاؤُهم أولادَهم ، فإسناد القتل إلى الشّركاء على طريقة المجاز العقلي إمّا لأنّ الشّركاء سبب القتل إذا كان القتل قُرباناً للأصنام ، وإمَّا لأنّ الّذين شرعوا لهم القتل هم القائمون بديانة الشّرك مثل عمرو بن لُحي ومن بعده ، وإذا كان المراد بالقتل الوأْدَ ، فالشركاء سببَ وإن كان الوأد قُرباناً للأصنام وإن لم يكن قرباناً لهم ( وهو المعروف ) فالشركاء سبب السبب ، لأنه من شرائع الشرك .وهذه القراءة ليس فيها ما يناكد فصاحة الكلام لأنّ الإعراب يُبيِّن معاني الكلمات ومواقعها ، وإعرابها مختلف من رفع ونصب وجرّ بحيث لا لبس فيه ، وكلماتها ظاهرٌ إعرابها عليها ، فلا يعدّ ترتيب كلماتها على هذا الوصف من التّعقيد المخلّ بالفصاحة ، مثل التّعْقيد الّذي في قول الفرزدق: ... وما مِثْلُه في النّاس إلاّ مُمَلَّكاًأبُو أمِّه حَيّ أبُوهُ يقاربهْ ... لأنَّه ضَمَ إلى خلل ترتيب الكلام أنَّه خَلل في أركان الجملة وما حفّ به من تعدّد الضّمائر المتشابهة وليس في الآية ممّا يخالف متعارف الاستعمال إلاّ الفصل بين المضاف والمضاف إليه بالمفعول ، والخَطْبُ فيه سهل : لأنّ المفعول ليس أجنبياً عن المضاف والمضاف إليه ، وجاء الزمخشري في ذلك بالتّهويل ، والضّجيج والعويل ، كيف يفصَل بين المضاف والمضاف إليه بالمفعول وزاد طنبور الإنكار نغمة .فقال : والذي حَمَله على ذلك أنّه رأى في بعض المصاحف : { شركائهم } مكتوباً بالياء ، وهذا جري على عادة الزمخشري في توهين القراءات المتواترة ، إذا خالفت ما دُوّن عليه علم النّحو ، لتوهّمه أنّ القراءات اختيارات وأقيسة من القُرّاء ، وإنَّما هي روايات صحيحة متواترة وفي الإعراب دلالة على المقصود لا تناكد الفصاحة .ومُدوّناتُ النّحو ما قصد بها إلاّ ضبط قواعد العربيّة الغالبة ليجري عليها النّاشئون في اللّغة العربيّة ، وليست حاصرة لاستعمال فصحاء العرب ، والقرّاءُ حجّة على النّحاة دون العكس ، وقواعد النّحو لا تمنع إلاّ قياس المولَّدين على ما ورد نادراً في الكلام الفصيح ، والنّدرة لا تنافي الفصاحة ، وهل يظنّ بمثل ابن عامر أنّه يَقرأ القرآن متابعة لصورة حروف التهجّي في الكتابة . ومثل هذا لا يروج على المبتدئين في علم العربيّة ، وهلاّ كان رسم المصحف على ذلك الشّكل هادياً للزمخشري أن يتفطّن إلى سبب ذلك الرسم . أمَّا ابن عطيّة فقال : «هي قراءة ضعيفة في استعمال العَرب» يريد أنّ ذلك الفصل نادر ، وهذا لا يُثبت ضعف القراءة لأنّ الندور لا ينَافي الفصاحة .وبَعَّد ابنُ عطيّة هذه القراءة بعدم مناسبتها للتّعليل بقوله : { ليردوهم } وتبعيد ابن عطيّة لها تَوَهُّمٌ : إذ لا منافاة بين أن يُزيّنوا لهم قتلَ أولادهم وبين التّعليل فإنّ التّعليل يستعمل في العاقبة مجازاً مثل قوله تعالى : { فالتقطه آلُ فرعون ليكونَ لهم عدوّاً وحَزناً } \\[ القصص : 8 \\]. ومن العجيب قول الطّبري : والقراءَة الّتي لا أستجيز غيرها بفتح الزاي ونصب : { القتل } وخفض : { أولادهم } ورفع : { شركائهم }.وذلك على عادته في نصب نفسه حكماً في التّرجيح بين القراءات .واللاّم في : { ليردوهم } لام العاقبة إن كان المراد بالشّركاء الأصنام ، أي زيَّنوا لهم ذلك قصداً لنفعهم ، فانكشف عن أضرارٍ جهلوها . وإن كان المراد بالشّركاء الجنّ ، أي الشّياطين فاللاّم للتّعليل : لأنّ الإيقاع في الشرّ من طبيعة الوسواس لأنَّه يستحسن الشرّ وينسَاق إليه انسياق العقرب للَّسع من غير قصد إلى كون ما يدعونهم إليه مردِيا ومُلْبِساً فإنَّهم أولياؤهم لا يقصدون إضرارهم ولكنّهم لمّا دعوهم إلى أشياء هي في نفس الأمر مضارّ كان تزيينهم مُعلّلاً بالإرداء والإلباس وإن لم يفقهوه بخلاف من دعا لسبب فتبيّن خلافه ، والضّمير للشّركاء والتّعليل للتّزيين .والإرْدَاء : الإيقاع في الرّدى ، والردَى : الموت ، ويستعمل في الضرّ الشّديد مجازاً أو استعارة وذلك المراد هنا .ولَبَس عليه أوقعه في اللّبس ، وهو الخلط والاشتباه ، وقد تقدّم في قوله تعالى : { ولا تَلبسوا الحقّ بالباطل }في سورة \\[ البقرة : 42 \\] ، وفي قوله : { وللبَسْنا عليهم ما يلبسون } في هذه السّورة \\[ 9 \\]. أي أن يخلطوا عليهم دينهم فيوهموهم الضّلال رشداً وأنّه مراد الله منهم ، فهم يتقرّبون إلى الله وإلى الأصنام لتقرّبهم إلى الله ، ولا يفرّقون بين ما يرضاه الله وما لا يرضاه ، ويخيّلون إليهم أنّ وأد البنات مصلحة . ومن أقولهم : دَفْن البناهْ من المَكْرمَاهْ ( البناه . والمكرماه . بالهاء ساكنة في آخرهما . وأصلها تاء جمع المؤنث فغيّرت لتخفيف المثَل ) وهكذا شأن الشّبه والأدلّة الموهومة التي لا تستند إلى دليل . فمعنى : وليلبسوا عليهم دينهم } أنَّهم يحدثون لهم ديناً مختلطاً من أصناف الباطل ، كما يقال : وسِّعْ الجبّة ، أي اجعلها واسعة ، وقيل : المراد ليدخلوا عليهم اللّبس في الدّين الّذي كانوا عليه وهو دين إسماعيل عليه السّلام ، أي الحنيفيّة ، فيجعلوا فيه أشياء من الباطل تختلط مع الحقّ .والقول في معنى : { ولو شاء الله ما فعلوه فذرهم وما يفسرون } كالقول في قوله آنفاً { ولو شاء ربك ما فعلوه } \\[ الأنعام : 112 \\] وضمير الرّفع في : { فعلوه } يعود إلى المشركين ، أي : لو شاء الله لعصمهم من تزيين شركائهم ، أو يعود إلى الشّركاء ، أي : لو شاء الله لصدّهم عن إغواء أتباعهم ، وضمير النّصب يعود إلى القتل أو إلى التّزيين على التوزيع ، على الوجهين في ضمير الرّفع .والمراد : ب { ما يَفترون } ما يفترونه على الله بنسبة أنّه أمرهم بما اقترفوه ، وكان افتراؤهم اتِّباعاً لافتراء شركائهم ، فسمّاه افتراء لأنَّهم تقلّدوه عن غير نظر ولا استدلال ، فكأنَّهم شاركوا الّذين افتروه من الشّياطين ، أو سدنة الأصنام ، وقادة دين الشّرك ، وقد كانوا يموّهون على النّاس أنّ هذا ممّا أمر الله به كما دلّ عليه قوله في الآية بعد هذه : { افتراء عليه } \\[ الأنعام : 138 \\] وقوله في آخر السّورة : { قل هلمّ شهداءكم الذين يشهدون أنّ الله حرّم هذا } \\[ الأنعام : 150 \\].\n\n",
      "translations": [
        {
          "translation": "(Thus) just as We have made their words and works seem fair to them (have their (so called) partners) among the devil (made the killing of their children) their daughters (to seem fair unto many of the idolaters, that they may ruin them) destroy them (and make their faith) the religion of Abraham and Ishmael (obscure for them. Had Allah willed (it otherwise), they had not done so) i.e. killing their daughters and making it seem fair to them. (So leave them alone with their devices) with their lies when they claim that Allah commanded them to bury their daughters alive.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لِيُرْدُوهُمْ } معناهُ ليهْلِكوهم\n\n",
      "translations": [
        {
          "translation": " And His saying, {Let them be destroyed} means that He will destroy them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَذٰلِكَ } أي: مثل قسمتهم في القربات والصدقات { زَيَّنَ } حبب وحسن { لِكَثِيرٍ مِّنَ ٱلْمُشْرِكِينَ قَتْلَ أَوْلَٰدِهِمْ شُرَكَآؤُهُمْ } أي: آلهتهم الذين يعبدونهم من دون الله من الشياطين\n وما ذلك التزيين والتحسين إلا { لِيُرْدُوهُمْ } ليهلكوهم ويضلوهم بالإغواء عن طريق الحق { وَلِيَلْبِسُواْ } ويخلطوا { عَلَيْهِمْ دِينَهُمْ } الذي وجب عليهم الانقياد والإطاعة ليصلوا إلى طريق التوحيد { وَلَوْ شَآءَ ٱللَّهُ } الهادي لعباده هدايتهم { مَا فَعَلُوهُ } أي: ما قبلوا ما زينوهم ولبسوا عليهم { فَذَرْهُمْ وَمَا يَفْتَرُونَ } [الأنعام: 137] أي: جانب عنهم وعن افترائهم إلى أن نأخذهم وننتقم عنهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: قرأ الجمهور: { زَيَّن } بالبناء للفاعل ونصب قتل، على أنه مفعول به، وخفض { أولادهم } بالإضافة ورفع { شركاؤهم } فاعل { زين } ، فالشركاء على هذه القراءة هم الذين زينوا القتل، وقرأ ابن عامر: بضم الزاي على البناء للمفعول، ورفع { قتل } على النيابة عن الفاعل، ونصب { أولادهم } على أنه مفعول بقتل، وخفض \" شركائهم \" بالإضافة إلى قتل، إضافة المصدر إلى فاعله، أي: زُين لهم أن يقتل شركاؤهم أولادهم، ففصل بين المضاف والمضاف إليه بأولادهم، وهو معمول للمصدر، وهو جائز في العربية، قال ابن مالك في الألفية:\nوهذا من فصل المفعول، فهو جائز في السعة خلافًا للزمخشري ومن تبعه، وقد شنَّع عليه الشاطبي في حرز الأماني. يقول الحقّ جلّ جلاله: ومثل ذلك التزيين الذي وقع لهم في الحرث والأنعام، { زَيَّن لكثير من المشركين قتل أولادهم } زين لهم ذلك شركاؤهم من الجن، أو من السدنَة، وحملوهم عليه، خوفًا من الجوع أو من العار، وكانوا يقتلون البنات دون البنين، زينوا لهم ذلك { لُيردُوهم } أي: ليهلكوهم بالإغواء، { وليلبسوا عليهم دينهم } أي: ليخلطوا عليهم ما كانوا عليه من دين إسماعيل، أو ما وجب عليهم أن يتدينوا به، { ولو شاء الله ما فعلوه } أي: ما فعل المشركين ما زين لهم، أو ما فعل الشركاء التزيين، أو الفريقان جميع ذلك، { فذرهم وما يفترون } أي: اتركهم مع افترائهم، أو: والذي يفترونه من الإفك، وهذا قبل الأمر بالسيف، ثم نسخ به. الإشارة: مما ينخرط في سلك الآية: إهانة البنات وتعظيم البنين، وقد نهى الشارع ـ عليه الصلاة والسلام ـ عن تخصيص الذكور بالوصية، وقال للذي أراد أن يفعله:\n \" لا تُشهدني على جور \" \n، وهنا إشارة أرق من هذا، وهو أن يراد بالأولاد ما تنتجه الفكرة الصافية من العلوم والمواهب، وقتلها: إهمال الفكرة عن استخراجها حتى ضاعت عليه، والذي زين له ذلك هو شرك القلب، واشتغاله برسوم الفرق، حتى تعطلت الفكرة، وماتت تلك العلوم من قلبه، وقع ذلك التزيين بأهل الفرق ليسقطوهم عن درجة المقربين أهل العلوم اللدنية والأسرار الربانية، وليلبسوا عليهم دينهم بالخواطر والشكوك، والأوهام، ولو شاء الله لهدى الناس جميعًا. ثم ذكر أيضاً نوعاً آخر من جهالتهم، فقال: { وَقَالُواْ هَـٰذِهِ أَنْعَامٌ وَحَرْثٌ حِجْرٌ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "92:11",
      "similarity": 0.6074717826294495
    },
    {
      "verse": "41:23",
      "similarity": 0.5821176207238554
    },
    {
      "verse": "20:16",
      "similarity": 0.5701868219043617
    },
    {
      "verse": "37:56",
      "similarity": 0.4970512730757818
    },
    {
      "verse": "6:9",
      "similarity": 0.26396676867556407
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006137.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006137.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:137.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}