{
  "chapter": "الأنعام",
  "text": "وقالوا۟ هذه انعم وحرث حجر لا يطعمها الا من نشاء بزعمهم وانعم حرمت ظهورها وانعم لا يذكرون اسم الله عليها افتراء عليه سيجزيهم بما كانوا۟ يفترون",
  "translations": [
    {
      "translation": "They say, These animals and crops are sacrosanct. No one may eat them except those we wish', - as they allege - and animals on whose backs it is forbidden to ride, and animals over which they do not mention Allah's name, inventing falsehood against Him. He will repay them for the things they have invented.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They also say: \"These cattle and these crops are consecrated. None may eat of them other than those we permit,\" -- so they assert. \"And the use of these cattle is forbidden for carrying burden.\" They do not pronounce the name of God on certain animals, inventing lies against Him. He will punish them for what they fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'These animals and these crops are sacrosanct: none may eat of them save those whom we will' - imposing interdictions of their own contriving. And they declare that it is forbidden to burden the backs of certain cattle, and these are the cattle over which they do not pronounce the name of Allah. All these are false fabrications against Allah, and He will soon requite them for all that they fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They, (the pagans), have said that their cattle and farms are dedicated to private idols and that no one can consume (the produce) except those whom We wanted, in their opinion. They prohibited the riding of certain animals and they ate the flesh of certain animals slaughtered without a mention of the Name of God. Instead, they ascribed falsehood to Him. They will all be given an evil recompense for their sinful invention.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “These cattle and crops are forbidden; only those whom we wish can eat them” – in their opinion – and some cattle are those which they have forbidden riding upon, and some cattle over which they do not mention the name of Allah while slaughtering – all this is fabricating lies against Allah; He will soon repay them for their fabrications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And according to their claim, they say that such and such cattle and crops are Hijr (forbidden), and none should eat of them except those whom we allow. And (they say) there are cattle forbidden to be used for burden, and cattle on which (at slaughtering) the Name of Allah is not pronounced; lying against Him (Allah). He will recompense them for what they used to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: These are cattle and tilth prohibited, none shall eat them except such as We please-- so they assert-- and cattle whose backs are forbidden, and cattle on which they would not mention Allah's name-- forging a lie against Him; He shall requite them for what they forged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, 'These are cattle and tillage sacrosanct; none shall eat them, but whom we will'-- so they assert -- 'and cattle whose backs have been forbidden, and cattle over which they mention not the Name of God.' All that they say, forging against God; He will assuredly recompense them for what they were forging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Such cattle and crops are forbidden. No-one is to eat of them save whom we will - in their make-believe - cattle whose backs are forbidden, cattle over which they mention not the name of Allah. (All that is) a lie against Him. He will repay them for that which they invent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They also say, \"These animals and these crops are forbidden. None may eat them except those we permit.\" So they claim! There are some animals they exempt from labour and some over which they do not pronounce God's name, thus committing a sin against Him. He will requite them for the falsehoods they invent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say according to their fancy: such cattle and tilth are taboo none shall eat thereof save whom we allow, and there are cattle whose backs are forbidden, and cattle over which they pronounce not the name of Allah: a fabrication against Him Anon He shall requite them for that which they were wont to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, ‘These cattle and tillage are a taboo: none may eat them except whom we please,’ so they maintain, and there are cattle whose backs are forbidden and cattle over which they do not mention Allah’s Name, fabricating a lie against Him. Soon He will requite them for what they used to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say that such and such cattle and crops are taboo, and none should eat of them except those whom - so they say - We wish; further, there are cattle forbidden to yoke or burden, and cattle on which, (at slaughter), the name of Allah is not pronounced; - inventions against Allah's name: soon will He requite them for their inventions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And according to their pretending, they say that such and such cattle and crops are forbidden, and none should eat of them except those whom we allow. And (they say) there are cattle forbidden to be used for burden or any other work, and cattle on which (at slaughtering) the Name of Allah is not pronounced; lying against Him (Allah). He will recompense them for what they used to fabricate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: 'These cattle, and these crops are forbidden. None can eat of them except those whom we permit' so they claim 'and cattle whose backs are forbidden, and others over which they do not pronounce the Name of Allah' As such fabricating lies against Him. He will recompense them for their invented lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “These animals and crops are restricted; none may eat them except those we permit,” by their claims, and animals whose backs are forbidden, and animals over which they do not pronounce the name of God—fabricating lies against Him. He will repay them for what they used to invent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"These animals and crops are forbidden; no one may eat from them except whom we will,\" by their claim. And there are those [camels] whose backs are forbidden [by them] and those upon which the name of Allah is not mentioned - [all of this] an invention of untruth about Him. He will punish them for what they were inventing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:138] They say, ‘These cattle and tillage are sacrosanct, forbidden. No one is to eat of them except whom we will’, from among the retainers of the graven images and others — so they assert, in other words, they have no [convincing] argument for it — ‘and cattle whose backs have been forbidden, and cannot therefore be ridden, such as the camels [they call] Sā’ibas or Hāmīs, and cattle over which they do not invoke the Name of God’, when they slaughter them, invoking instead the names of their idols, ascribing such [rules] to God; forging lies against Him. He will assuredly requite them for what they used to fabricate, against Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they say: Such cattle) i.e. the Bahirah, al-Sa'ibah, al-Wasilah and al-Ham (and crops are forbidden. No one is to eat of them save whom We will in their make believe) they means men to the exclusion of women (cattle whose backs are forbidden) i.e. what is known as al-Ham, (cattle over which they mention not the 151 name of Allah) when they get pregnant or deliver, this is what is called al-Bahirah. ((All that is) a lie against Him) i.e. that He commanded them to do so. (He will repay them for that which they invent) for lying against Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { هَـٰذِهِ أَنْعَٰمٌ وَحَرْثٌ حِجْرٌ } معناهُ حَرامٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"This is livestock and agriculture, a stone\" means it is forbidden.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة ما اخترعوها من تلقاء أنفسهم ونسبوها إلى الله وإلى كتابه ترويجاً أنهم { قَالُواْ هَـٰذِهِ } المعينة المفروضة { أَنْعَٰمٌ وَحَرْثٌ حِجْرٌ } حرام { لاَّ يَطْعَمُهَآ إِلاَّ مَن نَّشَآءُ } إطعامه\n يعنون سدنةن الأوثان وخدمتهم من الرجال دون النساء\n فإنها يحل عليهم ويحرم على غيرهم وما هي إلا { بِزَعْمِهِمْ } الفاسد بلا حجة نقلية وعقلية { وَ } أيضاً قالوا: هذه { أَنْعَٰمٌ حُرِّمَتْ ظُهُورُهَا } وأراد البحائر والسوائب والحوامي\n { وَ } قالوا أيضاً: هذه { أَنْعَٰمٌ } معدة للتجارة والحمل والظعن { لاَّ يَذْكُرُونَ ٱسْمَ ٱللَّهِ عَلَيْهَا } أي: لا يركبونها للحج\n كل ذل من مخترعاتهم التي يخترعونها من أهويتهم الفاسدة وآرائهم الباطلة ويفترون { ٱفْتِرَآءً عَلَيْهِ } سبحانه بلا سند لهم نازل من عنده { سَيَجْزِيهِم } الله ويعذبهم { بِمَا كَانُواْ يَفْتَرُونَ } [الأنعام: 138] أي: بسبب بافترائهم عليه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { حِجْر }: فعل، بمعنى مفعول، يستوي فيه الواحد والكثير، والمذكر والمؤنث، ومعناه: حرام، و { افتراء }: حال، أو مفعول من أجله، أو مصدر. يقول الحقّ جلّ جلاله: { وقالوا } أيضًا: { هذه } الأشياء التي جعلوها لأصنامهم، وهي { أنعام وحرث } ، هي { حِجْرٌ } أي: حرام محجر، { لا يَطعمها } ، لا يأكلها { إلا من نشاء } ، وهم خُدام الأوثان وسدنتها، والرجال دون النساء. قالوا ذلك { بزعمهم } وافترائهم من غير حجة، { وأنعام } أخرى { حُرمت ظهورها } وهي البحائر والسوائب والحوامي، { وأنعام } أخرى { لا يذكرون اسم الله عليها } في الذبح، وإنما يذكرون عليه اسم آلهتهم { افتراء } على الله، لأنهم قسموا أموالهم على هذه القسمة، ونسبوا ذلك إلى الله افتراءً وكذبًا، { سيجزيهم بما كانوا يفترون } أي: بسببه فيعذبهم عليه. الإشاره: ما عاب الله على المشركين إلا الشرك والتحكم على الله، فالواجب على من أراد السلامة أن يُوحد ربه، وينفرد بكُلِّيته إليه، ويُخلص أعماله لله، ويصرف أمواله في مرضاة الله، ويقف في أموره كلها عندما حدد له الله، وبَيَّنه رسولُ الله يكونُ من أولياء الله. والله تعالى أعلم. ثم ذكر جهالة أخرى لهم، فقال: { وَقَالُواْ مَا فِي بُطُونِ هَـٰذِهِ ٱلأَنْعَامِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:63",
      "similarity": 0.4299449226027317
    },
    {
      "verse": "6:136",
      "similarity": 0.4103185627246448
    },
    {
      "verse": "42:20",
      "similarity": 0.37461592536079297
    },
    {
      "verse": "2:223",
      "similarity": 0.3555243974320289
    },
    {
      "verse": "34:22",
      "similarity": 0.33785606386554995
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006138.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006138.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:138.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}