{
  "chapter": "الأنعام",
  "text": "وجعلوا۟ لله مما ذرا من الحرث والانعم نصيبا فقالوا۟ هذا لله بزعمهم وهذا لشركائنا فما كان لشركائهم فلا يصل الى الله وما كان لله فهو يصل الى شركائهم ساء ما يحكمون",
  "translations": [
    {
      "translation": "They assign to Allah a share of the crops and livestock He has created, saying, 'This is for Allah,' - as they allege - 'and this is for our idols.' Their idols' share does not reach Allah whereas Allah's share reaches their idols! What an evil judgement they make!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They allocate a share from God's own created fields and cattle to God, and they say: \"This is God's\" -- or so they think -- \"and that, of the compeers of God,\" so that what belongs to the compeers does not reach God, but that which is God's may reach the compeers (set up by them). How bad is the judgement that they make!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They assign to Allah a portion out of the produce and cattle that He has created, saying out of their fancy: 'This is for Allah' - so they deem -'and this is for the associates (of Allah) whom we have contrived.' Then, the portion assigned to the beings whom they have set up as associates (of Allah) does not reach Allah, but the portion assigned to Allah reaches the beings they set up as associates (of Allah)! Indeed evil is what they decide!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They set aside a share of the left-overs of their farming produce and cattle saying, \"This is for God and that is for the idols.\" God does not receive the share of the idols but the share of God is given totally to the idols. How terrible is their decision!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among the crops and animals that Allah has created, they assigned (only) a portion to Him and therefore said “This is for Allah” – in their opinion – “and this is for our partners (false deities)”; so the portion for their partners does not reach Allah; and the portion for Allah reaches their partners; what an evil judgement they impose!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they assign to Allah a share of the tilth and cattle which He has created, and they say: \"This is for Allah,\" according to their claim, \"and this is for our partners.\" But the share of their \"partners\" reaches not Allah, while the share of Allah reaches their \"partners\"! Evil is the way they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they set apart a portion for Allah out of what He has created of tilth and cattle, and say: This is for Allah-- so they assert-- and this for our associates; then what is for their associates, it reaches not to Allah, and whatever is (set apart) for Allah, it reaches to their associates; evil is that which they judge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They appoint to God, of the tillage and cattle that He multiplied, a portion, saying, 'This is for God' -- so they assert -- 'and this is for our associates.' So what is for their associates reaches not God; and what is for God reaches their associates. Evil is their judgment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They assign unto Allah, of the crops and cattle which He created, a portion, and they say: \"This is Allah's\" - in their make-believe - \"and this is for (His) partners in regard to us.\" Thus that which (they assign) unto His partners in them reacheth not Allah and that which (they assign) unto Allah goeth to their (so-called) partners. Evil is their ordinance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They set aside for God a share in what He has produced, such as crops and livestock, and they say, \"This is for God,\" so they claim!, and \"this is for our associate-gods?\" Their associate-gods' share does not reach God, whereas God's share reaches their associate-gods. How ill they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they'll appoint for Allah, of the tilth and cattle He hath produced, a portion, they say according to their fancy: this is for Allah, and: this for our associate-gods. Then, that which is for their associate-gods reacheth not Allah, while that which is for Allah reacheth their associate-gods; vile is the way they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They dedicate a portion to Allah out of what He has created of the crops and cattle, and say, ‘This is for Allah,’ so do they maintain, ‘and this is for our partners.’ But what is for their partners does not reach Allah, and what is for Allah reaches their partners. Evil is the judgement that they make.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Out of what Allah hath produced in abundance in tilth and in cattle, they assigned Him a share: they say, according to their fancies: \"This is for Allah, and this\" - for our \"partners\"! but the share of their\" partners \"reacheth not Allah, whilst the share of Allah reacheth their \"partners\"! evil (and unjust) is their assignment!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they assign to Allah a share of the tilth and cattle which He has created, and they say: \"This is for Allah according to their pretending, and this is for our (Allah's so-called) partners.\" But the share of their (Allah's so-called) \"partners\" reaches not Allah, while the share of Allah reaches their (Allah's so-called) \"partners\"! Evil is the way they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They set aside for Allah a share of what He has created of tilth and cattle saying: 'This is for Allah so they claim and this for our associates (gods)' The share of their associates never reaches Allah, but the share of Allah reaches their associates. How evil they judge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they set aside for God a share of the crops and the livestock He created, and they say, “This is for God,” according to their claim, “and this is for our idols.” But the share of their idols does not reach God, yet the share of God reaches their idols. Evil is their judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the polytheists assign to Allah from that which He created of crops and livestock a share and say, \"This is for Allah,\" by their claim, \"and this is for our partners [associated with Him].\" But what is for their \"partners\" does not reach Allah, while what is for Allah - this reaches their \"partners.\" Evil is that which they rule.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:136] They, the disbelievers of Mecca, assign to God, of the tillage, the crops, and the cattle which He multiplied, He created, a portion, which they dispense to visitors and the needy, and to their associates belongs a portion, which they dispense to such keepers [of the tillage and cattle], saying, ‘This is for God’ — so they assert (read bi-za‘mihim or bi-zu‘mihim) — ‘and this is for our associates’: and if any of the portion of these [associates] fell into God’s portion, they used to restore it [to that of their associates], but when something of His portion fell into theirs, they would leave it there, saying, ‘God is Independent [and is not in need] of this’, as God, exalted be He, says: So that which is intended for their associates does not reach God, and that which is intended for God does reach their associates. Evil is that, provision of theirs, which they decree!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعَطفٌ على نظائره ممّا حكيت فيه أقوالهم وأعمالهم من قوله : { وما قدروا الله حقّ قدره إذ قالوا ما أنزل اللَّه على بشر من شيء } \\[ الأنعام : 91 \\] وقوله : { وجعلوا لله شركاء الجنّ } \\[ الأنعام : 100 \\] وقوله : { وأقسموا بالله جَهد أيمانهم لئن جاءتهم آية ليؤمنُنّ بها } \\[ الأنعام : 109 \\] وقوله : { وإذا جاءتهم آية قالوا لن نؤمن حتى نؤتى مثل ما أوتي رسل الله } \\[ الأنعام : 124 \\] وما تخلّل ذلك فهو إبطال لأقوالهم ، ورد لمذاهبهم ، وتمثيلات ونظائر ، فضمير الجماعة يعود على المشركين الّذين هم غرض الكلام من أوّل السّورة من قوله : { ثم الذين كفروا بربّهم يعدلون } \\[ الأنعام : 1 \\]. وهذا ابتداءُ بيان تشريعاتهم الباطلة ، وأوّلُها مَا جعلوه حقّاً عليهم في أموالهم للأصنام : ممّا يشبه الصّدقات الواجبة ، وإنَّما كانوا يوجبونها على أنفسهم بالالتزام مثل النّذور ، أو بتعيين من الّذين يشرعون لهم كما سيأتي .والجعل هنا معناه الصّرف والتّقسيم ، كما في قول عمر في قضيّة : ما أفاء الله على رسوله صلى الله عليه وسلم المختصم فيها العبّاس وعليّ رضي الله عنهم «فيجعَلُه رسولُ اللَّه مجعل ماللِ اللَّه» أي يضعه ويصرفه ، وحقيقة معنى الجعل هو التّصيير ، فكما جاء صيّر لمعان مجازية ، كذلك جاء ( جعل ) ، فمعنى { وجعلوا لله } : صرفوا ووضعوا لله ، أي عيّنوا له نصيباً ، لأنّ في التّعيين تصييراً تقديرياً ونقلاً . وكَذلِك قول النّبي صلى الله عليه وسلم في حديث أبي طلحةَ : \" أرى أن تجعلَها في الأقربِين \" أي أن تصرفها إليهم ، و { جعل } هذا يتعدّى إلى مفعول واحد ، وهذه التّعدية هي أكثر أحوال تعديته ، حتّى أنّ تعديته إلى مفعولين إنَّما ما في الحقيقة مفعولٌ وحالٌ منه .ومعنى : { ذرأ } أنشأ شيئاً وكثّره . فأطلق على الإنماء لأنّ إنشاء شيء تكثير وإنماء . و { ممّا ذرأ } متعلّق ب { جَعلوا } ، و { من } تبعيضية ، فهو في معنى المفعول ، و { مَا } موصولة ، والإتيان بالموصول لأجل دلالة صلته على تسفيه آرائهم ، إذ ملَّكوا الله بعض مَلْكه ، لأنّ ما ذرأه هو مِلْكُه ، وهو حقيق به بلا جَعْل منهم .واختيار فعل : { ذرأ } هنا لأنّه الّذي يدلّ على المعنى المراد ، إذ المقصود بيان شرائعهم الفاسدة في نتائج أموالهم . ثمّ سيبيّن شرعهم في أصول أموالهم في قوله : { وقالوا هذه أنعام وحرث حجر } \\[ الأنعام : 138 \\] الآية .و { من الحرث والأنعام } بيان { ما } الموصولة . والحرثُ مراد به الزّرع والشّجر ، وهو في الأصل من إطلاق المصدر على اسم المفعول ، ثمّ شاع ذلك الإطلاق حتّى صار الحرث حقيقة عرفية في الجنّات والمزارع ، قال تعالى : { أن اغْدُوا على حرثكم إن كنتم صارمين } \\[ القلم : 22 \\].والنّصيب : الحظ والقِسْم وتقدّم في قوله تعالى : { أولئك لهم نصيب ممّا كسبوا } في سورة البقرة ( 202 ) ، والتّقدير : جعلوا لله نصيباً ولغيره نصيباً آخر ، وفهم من السّياق أنّ النّصيب الآخر لآلهتهم . وقد أفصح عنه في التّفريع بقوله : فقالوا هذا لله بزعمهم وهذا لشركائنا }.والإشارتان إلى النّصيب المعيّن لله والنّصيب المعيّن للشركاء ، واسما الإشارة مشار بكلّ واحد منهما إلى أحد النّصيبين على الإجمال إذ لا غرض في المقام في تعيين ما جعلوه لله وما جعلوه لشركائهم .والزّعم : الاعتقاد الفاسد ، أو القريب من الخطأ ، كما تقدّم عند قوله تعالى : { ألم تر إلى الذين يزعمون أنّهم آمنوا بما أنزل إليك وما أنزل من قبلك في سورة النساء ( 60 ) ، وهو مثلّث الزاي ، والمشهور فيه فتح الزاي ، ومثله الرّغم بالرّاء مثلّث الراء . «وقرأ الجمهور بفتح الزاي وقرأه الكسائي بضمّ الزاي ويتعلّق قولهم : بزعمهم } ب { قالوا } وجُعل قوله : { بزعمهم } موالياً لبعض مقول القول ليكون متّصلاً بما جعلوه لله فيرتَّبُ التّعجيب من حكمهم بأنّ ما كان لله يصل إلى شركائهم ، أي ما اكتفوا بزعمهم الباطل حتّى نكلوا عنه وأشركوا شركاؤهم فيماجعلوه لله بزعمهم .والباء الداخلة على { بزعمهم } إمّا بمعنى { مِن } أي ، قالوا ذلك بألسنتهم ، وأعلنوا به قولاً ناشئاً عن الزعم ، أي الاعتقاد الباطل ، وإمّا للسببيّة ، أي قالوا ذلك بسبب أنّهم زعموا . ومحلّ الزّعم هو ما اقتضته القسمة بين الله وبين الآلهة ، وإلاّ فإنّ القول بأنّه ملك لله قول حقّ ، لكنّهم لما قالوه على معنى تعيين حقّ الله في ذلك النّصيب دون نصيب آخر . كان قولهم زعماً باطلاً .والشّركاء هنا جمع شريك ، أي شريك الله سبحانه في الإلهية ، ولمّا شاع ذلك عندهم صار كالعَلم بالغلبة ، فلذلك استغنى عن الإضافة إلى ما فيه المعنى المشتقّ منه أعني الشّركة ثمّ لأجل غلبته في هذا المعنى صار بمنزلة اللّقب ، فلذلك أضافوه إلى ضميرهم ، فقالوا : لشركائنا ، إضافة معنوية لا لفظيّة ، أي للشّركاء الّذين يُعرفون بنا . قال ابن عبَّاس وأصحابه : كان المشركون يجعلون لله من حروثهم ( يعني زرعهم وشجرهم ) وأنعامهم نصيباً وللأوثان نصيباً فما كان للأصنام أنفقوه عليها وما كان لله أطعموه الضيفان والمساكين ولا يأكلون منه البتة .وكانوا يجعلون البَحيرة والسائبة والوصيلة والحامي للأصنام . وذكر ابن إسحاق : أنّ ( خَوْلاَن ) كان لهم صنم اسمه ( عَمّ أنَس ) يقسمون له من أنعامهم وحروثهم قِسَما بينه وبين الله ، فما دخل في حق ( عَمّ أنس ) من حَقّ الله الّذي سَمَّوه له تركوه للصّنم وما دخل في حقّ الله من حقّ ( عَمّ أنس ) ردّوه عليه ، ومنهم بطن يقال لهم ( الأدِيم ) قال : وفيهم نزل قوله تعالى : وجعلوا لله مما ذرأ الآية .وقوله : { فما كان لشركائهم فلا يصل إلى الله وما كان لله فهو يصل إلى شركائهم }.قال ابن عبّاس وقتادة : كانوا إذا جمعوا الزرع فهبت الرّيح فحملت من الّذي لله إلى الّذي لشركائهم أقَرّوه وقالوا : إنّ الله غنيّ عنه ، وإذا حملت من الّذي لشركائهم إلى الّذي للَّهِ ردّوه ، وإذا هلك ما لأصنامهم بقحط أخذوا بدله ممّا لله ، ولا يفعلون ذلك فيما لله ، وإذا انفجر من سقي ما جعلوه لله فساح إلى ما للّذي للأصنام تركوه وإذا انفجر من سقي ما للأصنام فدخل في زرع الّذي لله سَدّوه .وكانوا إذا أصابتهم سَنَةٌ استعانوا بما جعلوه لله فأنفقوه على أنفسهم وأقرّوا ما جعلوه لشركائهم للشركاء ، وإذا هلك الّذي جعلوه للأصنام وكثر الّذي جعلوه لله قالوا : ليس لآلهتنا بدّ من نفقة وأخذوا الّذي جعلوه لله فأنفقوه عليها ، وإذا أجدب الّذي لله وكثر الّذي لآلهتهم قالوا : لو شاء الله أزكى الّذي له فلا يردّون على ما جعلوه لله شيئاً ممّا لآلهتهم ، فقوله : { فلا يصل إلى الله } مبالغة في صونه من أن يعطى لما لله لأنَّه إذا كان لا يصل فهو لا يُتْرك إذا وَصل بالأوْلى .وعدّي { يصل } إلى اسم الجلالة وإلى اسم شركائهم . والمراد لا يصل إلى النّصيب المجعول لله أو إلى لشركائهم لأنَّهم لما جعلوا نصيباً لله ونصيباً لشركائهم فقد استشعروا ذلك النّصيب محوزاً لمن جُعل إليه وفي حرزه فكأنّه وصل إلى ذاته .وجملة : { ساء ما يحكمون } استئناف لإنشاء ذمّ شرائعهم . وساء هنا بمعنى بِئس : و { مَا هي فاعل ساء } وهي موصولة وصلتها { يحكمون } ، وحذف العائد المنصوب ، وحذف المخصوص بالذّم لدلالة : { جعلوا } عليه ، أي : ساء ما يحكمون جَعْلُهم ، وسمَّاه حكماً تهكّما ، لأنَّهم نصبوا أنفسهم لتعيين الحقوق ، ففَصَلوا بحكمهم حقّ الله من حقّ الأصنام ، ثمّ أباحوا أن تأخذ الأصنام حقّ الله ولا يَأخذ الله حقّ الأصنام ، فكان حكماً باطلاً كقوله : { أفحكم الجاهليّة يبغون } \\[ المائدة : 50 \\].\n\n",
      "translations": [
        {
          "translation": "(They assign unto Allah) they ascribe to Allah, (of the crops and cattle) camels, oxen and the camels which graze freely (which He created, a portion, and they say: \"This is Allah's\" in their make believe \"and this is for (His) partners) their gods (in regard to us\". Thus that which (they assign) unto His partners) their gods (in them reacheth not Allah) does not go to that which they have assigned to Allah (and that which (they assign) unto Allah goeth to your (so called) partners) so called gods. (Evil is their ordinance) evil is that which they decree for themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجَعَلُواْ للَّهِ مِمَّا ذَرَأَ } معناهُ خَلَقَ\n وَبَرَأَ مِثْلُه\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And they made for Allah from what He created…\" - this means that He created them.\n\n\nAnd He created his likeness.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة أهويتهم الباطلة أنهم { جَعَلُواْ للَّهِ مِمَّا ذَرَأَ } برأ وخلق { مِنَ ٱلْحَرْثِ وَٱلأَنْعَٰمِ نَصِيباً فَقَالُواْ هَـٰذَا } المعين المفروز { للَّهِ بِزَعْمِهِمْ وَهَـٰذَا لِشُرَكَآئِنَا } أي: آلهتنا وشفعائنا { فَمَا كَانَ } من أموالهم يفرز { لِشُرَكَآئِهِمْ } إن كان جيداً طيباً { فَلاَ يَصِلُ إِلَىٰ ٱللَّهِ } ولا يتجاوز عن شركائهم { وَمَا كَانَ للَّهِ } إن كان جيداً { فَهُوَ يَصِلُ إِلَىٰ شُرَكَآئِهِمْ } بأن استبدلوها بالردئ الذي كان لشركائهم { سَآءَ مَا يَحْكُمُونَ } [الأنعام: 136] هؤلاء الجاهلون\n لأن فعلهم واختيارهم هذا إنما هو تفضيل المفضول المترذل على الأصل الأفضل\n\n\nروي أنهم كانوا يعينون في حرثهم ونتاجهم لله\n ويصرفونه إلى الضيفان والمساكين\n وشيئاً منها لآلهتهم وينفقونها إلى سدنة آلهتهم وخدامههم\n ويذبحون عندها ثم إن رأوا ما عينوا لله أزكى\n بدلوه بما لآلهتهم من الردئ\n وإن رأوا ما لآلهتهم أزكى تركوه لها حباً لآلهتهم\n وهذا مما اخترعوه من تلقاء أنفسهم وإن افتروا إلى كتبهم ترويجاً وتغريراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { وجعلوا } أي: مشركو العرب، { لله مما ذرأ } أي: خلق، { من الحرث والأنعام نصيبًا } ، وهم حي من خولان، يقال لهم: الأديم، كانوا يجعلون من زروعهم وثمارهم وأنعامهم نصيبًا، { فقالوا هذا لله بزعمهم } أي: بدعواهم من غير دليل، وأكثر ما يستعمل الزعم في الكذب، { وهذا لشركائنا فما كان لشركائهم فلا يَصِلُ إلى الله وما كان لله فهو يَصِلُ إلى شركائهم }. رُوِي أنهم كانوا يُعينون شيئًا من حرث أو نتاج إلى الله، فيصرفونه إلى الضيفان والمساكين، وشيئًا منها إلى آلهتهم، فينفقونه على سدنتهم ـ أي: خدَّامهم، والقيام بأصنامهم، ويذبحون عندها، ثم إذا رأوا ما عينوا لله أزكى وأكثر، بدلوه لآلهتهم وقالوا: الله غني عنه، وإذا رأوا ما لآلهتهم أزكى تركوه لها حبًا لآلهتهم، وإذا هبت ريح فحملت شيئًا من الذي لله إلى الذي للأصنام أقروه، وإن حملت شيئًا من الذي للأصنام إلى الذي لله ردوه، وإذا أصابتهم سَنَةٌ، أكلوا نصيب الله وتحاموا نصيب شركائهم، تعظيمًا لها. وفي قوله: { مما ذرأ }: تنبيه على فرط جهالتهم، فإنهم أشركوا الخالق في خلقه، جمادًا لا يقدر على شيء، ثم رجحوه عليه بأن جعلوا الزاكي له، وفي قوله: { بزعمهم }: تنبيه على أن ذلك مما اخترعوه، ولم يأمرهم الله تعالى به. { ساء } أي: قبح، { ما يحكمون } حكمهم هذا الذي اخترعوه من عند أنفسهم. الإشارة: مما ينخرط في سلك الآية. وتجر ذيلها عليه، ما يفعله بعض الناس من التساهل في حقوق الله الواجبة، والمسارعة إلى حقوق الناس التي ليست بواجبة عليه، فترى بعض العوام يقدمون مد أبي العباس السبتي، ويتساهل في الزكاة، وترى بعض الناس يُسارع إلى إطعام الطعام وقرى الأضياف، وهو لا يفي زكاته. وبعضهم يجعلون للصالحين شيئًا من أموالهم لتصلح وتنمو ويعتني بشأنها، وقد لا يعتني بزكاته ولا يخرجها، وهذا كله شعبة من فعل أهل الشرك، وعلامة اتباع الهوى. وبالله التوفيق. ثم ذكر نوعاً آخر من كفرهم، فقال: { وَكَذٰلِكَ زَيَّنَ لِكَثِيرٍ مِّنَ ٱلْمُشْرِكِينَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "67:24",
      "similarity": 0.4901957301073522
    },
    {
      "verse": "23:79",
      "similarity": 0.4886144394558132
    },
    {
      "verse": "42:11",
      "similarity": 0.45397961085139293
    },
    {
      "verse": "7:179",
      "similarity": 0.42053212675784835
    },
    {
      "verse": "6:138",
      "similarity": 0.41031856272464484
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006136.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006136.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:136.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}