{
  "chapter": "الأنعام",
  "text": "ذلك ان لم يكن ربك مهلك القرى بظلم واهلها غفلون",
  "translations": [
    {
      "translation": "That was because their Lord would never have destroyed the cities unjustly while their people were unaware.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this (so that it may be clear) that your Lord does not destroy towns and cities arbitrarily while the citizens remain unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They will be made to bear this witness to show that) it is not the way of your Lord to destroy cities unjustly while their people were unaware of the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord did not want to destroy the towns, unjustly, without informing their inhabitants (of His guidance).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because your Lord does not unjustly destroy townships for their people may be unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because your Lord would not destroy the (populations of) towns for their wrongdoing while their people were unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because your Lord would not destroy towns unjustly while their people were negligent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because thy Lord would never destroy the cities unjustly, while their inhabitants were heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because thy Lord destroyeth not the townships arbitrarily while their people are unconscious (of the wrong they do).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord would not destroy a community for its wrongdoing, so long as its people were still unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because thy Lord is not one to destroy a town for its wrong-doing while its people are unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because your Lord would never destroy the towns unjustly while their people were unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The messengers were sent) thus, for thy Lord would not destroy for their wrong-doing men's habitations whilst their occupants were unwarned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is because your Lord would not destroy the (populations of) towns for their wrong-doing (i.e. associating others in worship along with Allah) while their people were unaware (so the Messengers were sent).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because your Lord will not destroy villages unjustly, while their inhabitants were inattentive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because your Lord would not destroy towns for injustice while their inhabitants are unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is because your Lord would not destroy the cities for wrongdoing while their people were unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:131] That, sending of the messengers, is because (an, [phonetically] lightened, with the lām [of li-annahu] implied, thus [read as] li-annahu, ‘because’) your Lord would never destroy the towns through injustice, on their part, while their inhabitants were heedless, not having had any Messenger to make [things] clear to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي ، تهديد وموعظة ، وعبرة بتفريط أهل الضّلالة في فائدة دعوة الرّسل ، وتنبيه لجدوى إرسال الرّسل إلى الأمم ليعيد المشركون نظراً في أمرهم ، ما داموا في هذه الدار ، قبل يوم الحشر ، ويعلموا أنّ عاقبة الإعراض عن دعوة الرّسول صلى الله عليه وسلم خسرى ، فيتداركوا أمرهم خشية الفوات ، وإنذار باقتراب نزول العذاب بهم ، وإيقاظٌ للمشركين بأنّ حالهم كحال المتحدّث عنهم إذا ماتوا على شركهم .والإشارة بقوله : { ذلك } إلى مذكور في الكلام السّابق ، وهو أقرب مذكور ، كما هو شأن الإشارة إلى غير مَحسوس ، فالمشار إليه هو المذكور قبلُ ، أو هو إتيان الرّسل الّذي جَرى الكلام عليه في حكاية تقرير المشركين في يوم الحشر عن إتيان رسلهم إليهم ، وهو المصدر المأخوذ من قوله : { ألَم يَأتكم رسلٌ منكم } \\[ الأنعام : 130 \\] فإنَّه لمّا حكى ذلك القول للنّاس السّامعين ، صار ذلك القول المحكي كالحاضر ، فصحّ أن يشار إلى شيء يؤخذ منه . واسم الإشارة إمّا مبتدأ أو خبر لمحذوف تقديره : ذلك الأمر أو الأمر ذلك ، كما يدلّ عليه ضمير الشأن المقدّر بعد ( أنْ ).و { أن } مخففة من الثقيلة ، واسمها ضمير شأن محذوف ، كما هو استعمالها عند التّخفيف ، وذلك لأنّ هذا الخبر له شأن يجدر أن يُعرَف والجملة خبر { أن } ، وحذفت لام التّعليل الداخلة على { أن } : لأنّ حذف جارّ { أن } كثير شائع ، والتّقدير : ذلك الأمر ، أو الأمر ذلك ، لأنَّه أي الشأن لم يكن ربّك مُهلك القرى .وجملة : { لم يكن ربك مهلك القرى بظلم وأهلها غافلون } هو شأن عظيم من شؤون الله تعالى ، وهو شأن عَدله ورحمته ، ورضاه لعباده الخير والصّلاح ، وكراهيته سوء أعمالهم ، وإظهاره أثر ربوبيته إياهم بهدايتهم إلى سبل الخير ، وعدم مباغتتهم بالهلاك قبل التقدّم إليهم بالإنذار والتنبيه .وفي الكلام إيجاز إذ عُلم منه : أنّ الله يهلك القرى المسترسِلَ أهلُها على الشّرك إذا أعرضوا عن دعوة الرّسل ، وأنّه لا يهلكهم إلاّ بعد أن يرسل إليهم رسلاً منذرين ، وأنّه أراد حمل تَبعَة هلاكهم عليهم ، حتى لا يبقى في نفوسهم أن يقولوا : لولا رحمنا ربّنا فانبأنا وأعذر إلينا ، كما قال تعالى : { ولو أنَّا أهلكناهم بعذاب من قبله } ( أي قبل محمّد صلى الله عليه وسلم أو قبل القرآن ) { لقالوا ربنا لولا أرسلت إلينا رسولاً فنتبع آياتك من قبل أن نذل ونخزى } \\[ طه : 134 \\] فاقتصر من هذا المعنى على معنى أنّ علّة الإرسال هي عدم إهلاك القرى على غفلة ، فدلّ على المعنى المحذوف .والإهلاك : إعدام ذات الموجود وإماتةُ الحيّ . قال تعالى : { ليَهْلِك من هلك عن بيّنة ويَحْيَى من حَيِيَ عن بيّنة } \\[ الأنفال : 42 \\] فإهلاك القرى إبادة أهلها وتخريبها ، وإحياؤها إعادةُ عُمرانها بالسكّان والبناء ، قال تعالى : { أنَّى يحيي هذه ( أي القريةَ ) الله بعد موتها }\\[ البقرة : 259 \\]. وإهلاك النّاس : إبادتهم ، وإحياؤهم إبقاؤهم ، فمعنى إهلاك القرى هنا شامل لإبادة سكّانها . لأنّ الإهلاك تعلّق بذات القرى ، فلا حاجة إلى التمجّز في إطلاق القرى على أهل القرى كما في : و { اسأل القرية } \\[ يوسف : 82 \\] لصحّة الحقيقة هنا ، ولأنَّه يمنع منه قوله : { وأهلُها غافلون }.ألا ترى إلى قوله تعالى : { وإذا أردنا أن نهلك قرية أمرنا مترفيها ففسقوا فيها فحقّ عليها القول فدمّرناها تدميراً } \\[ الإسراء : 16 \\] فجعل إهلاكها تدميرها ، وإلى قوله : { ولقد أتَوْا على القرية التي أُمطرت مَطَر السَّوْء أفلم يكونوا يرونها } \\[ الفرقان : 40 \\].والباء في : { بِظلم } للسّببيّة ، والظلم : الشّرك ، أي مهلكهم بسبب شرك يَقع فيها فيهلكها ويهلك أهلها الّذين أوقعوه ، ولذلك لم يقل : بظلم أهلها ، لأنَّه أريد أن وجود الظلم فيها سببُ هلاكها ، وهلاكُ أهلها بالأحرى لأنَّهم المقصود بالهلاك .وجملة : { وأهلها غافلون } حال من { القرى }.وصرح هنا ب { أهلها } تنبيها على أنّ هلاك القُرى من جراء أفعال سكّانها ، { فتلك بيوتهم خاوية بما ظلموا } \\[ النمل : 52 \\].\n\n",
      "translations": [
        {
          "translation": "(This) i.e. sending messengers (is because your Lord destroyeth not the townships) the people of the townships (arbitrarily) because of their idolatry or transgression; it is also said that this means: out of injustice (while their people are unconscious) of the commands and prohibitions and the conveyance of the messengers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nوكشهادة الأيدي والأرجل بصورها التي تناسب هيآت أفعالها وتعذبها بها { ذلك } إشارة إلى إرسال الرسل وتبيين الآيات وإلزام الحجة بالإنذار والتهديد\n أي: الأمر ذلك لأن ربّك لم يكن مهلك القرى على غفلتهم ظالماً لأنه ينافي الحكمة\n { ولكلٍ دَرَجَات } في القرب والبعد من أعمالهم التي عملوها { إن يشأ يُذْهبكم } بفناء عينكم { ويَسْتَخْلف من بَعْدكم } من أهل طاعته برحمته { ذلك } أي: تحريم الطيبات عليهم جزاء { جازيناهم } بظلمهم { وإنّا لصادقون } في إيعادهم بجزاء الظلم { فإن كذبوك } بأن الله واسع المغفرة فلا يعذبنا بظلمنا { فقل } بلى { ربكم ذو رحمة واسعة } ولكنه ذو قهر شديد فلا تردّ رحمته بأسه { عن القوم المجرمين } بل ربما أودع قهره في صورة لطفه ولطفه في صورة قهره { كذلك كذّب الذين من قبلهم } أي: كذّب المنكرون الرسل من قبلهم بتعليق كفرهم بمشيئة الله عناداً وعتوّاً فعذبوا بكفرهم\n { قُلْ هل عندكم من عِلْمٍ فتخرِجُوه لنا } أي: إن كان لكم علم بذلك وحجة فبينوا\n وإنما قال ذلك إشارة إلى قولهم: { لو شاء الله ما أشركنا } لأنهم لو قالوا ذلك عن علم لعلموا أن إيمان الموحدين وكل شيء لا يقع إلا بإرادة الله فلم يعادوهم ولم ينكروهم\n بل والوهم\n ولم يبق بينهم وبين المؤمنين خلاف\n ولعمري إنهم لو قالوا ذلك عن علم لما كانوا مشركين\n بل كانوا موحدين ولكنهم اتّبعوا الظن في ذلك وبنوا على التقدير والتخمين لغرض التكذيب والعناد\n وعلى ما سمعوا من الرسل إلزاماً لهم وإثباتاً لعدم امتناعهم عن الرسل لأنهم محجوبون في مقام النفس\n وأنّى لهم اليقين؟ ومن أين لهم الاطلاع على مشيئة الله؟\n { قل فلله الحجّة البالغة } أي: إن كان ظنكم صدقاً في تعليق شرككم بمشيئة الله فليس لكم حجة على المؤمنين وعلى غيركم من أهل دين\n لكون كل دين حينئذ بمشيئة الله\n فيجب أن توافقوهم وتصدّقوهم بل لله الحجة عليكم في وجوب تصديقهم وإقراركم بأنكم أشركتم بمن لا يقع أمر إلا بإرادته ما لا أثر لإرادته أصلاً فأنتم أشقياء في الأزل\n مستحقون للبعد والعقاب { فلو شاء لهداكم أجمعين } أي: بلى صدقتم\n ولكن كما شاء كفركم لو شاء لهداكم كلكم\n فبأي شيء علمتم أنه لم يشأ هدايتكم حتى أصررتم؟ وهذا تهييج لمن عسى أن يكون له استعداد منهم فيقمع ويهتدي فيرجع عن الشرك ويؤمن",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذٰلِكَ } أي: إرسال الرسل وإنزال الكتب إنما هو ليتنبهوا وينتبهوا\n أي: العصاة على ما هم عليه والسر في الإرسال { أَن } أي: لأن { لَّمْ يَكُنْ رَّبُّكَ مُهْلِكَ ٱلْقُرَىٰ بِظُلْمٍ } أي: بسبب ظلم صدر عنه { وَ } الحال أنه { أَهْلُهَا غَٰفِلُونَ } [الأنعام: 131] عن طريق الحق بلا تنبيه وإرشاد مرشد نبيه\n وعلّيم من تبعك من المؤمنين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ذلك أن لم يكن ربك }: خبر عن مضمر\n وأن على حذف لام العلة\n أي: الأمر ذلك لأجل أن لم يكن ربك متصفًا بالظلم\n يقول الحقّ جلّ جلاله: يوم القيامة في توبيخ الكفار: { يا معشر الجن والإنس ألم يأتكم رسل منكم } أي: من مجموعكم\n أو رسل الجن: نُذُرُهم الذين يبلغون لهم شريعة الأنس إذ ليس في الجن رسل على المشهور\n ورَوى الطبري من طريق الضحاك بن مزاحم إثبات ذلك\n واحتج بأنا لله تعالى أخبَر أن من الجن والإنس رسلاً أرسلوا إليهم\n يعني ظاهر هذه الآية\n وأجاب الجمهور بأن معنى الآية: أن رسل الإنس رسل من قبل الله أليهم\n ورسل الجن يبلغون كلام رسل الأنس إليهم\n ولهذا قال قائلهم:\n[الأحقاف:30] الآية\n فالرسالة إلى الجن خاصة بنبيّنا محمد صلى الله عليه وسلم\n أي: مع الإنس\n حال كون الرسل الذين أتوكم { يقصون عليكم آياتي ويُنذرونكم لقاء يومكم هذا } يعني يوم القيامة\n قالوا في الجواب: { شهدنا على أنفسنا } بالكفر والعصيان\n وهو اعتراف منهم بما فعلوا\n قال تعالى: { وغرتهم الحياة الدنيا } ألهتهم بزخرفها عن النظر والتفكر\n { وشهدوا على أنفسهم أنهم كانوا كافرين } \n وهذا ذم لهم على سُوء نظرهم وخطأ رأيهم\n فإنهم اغتروا بالحياة الدنيوية واللذات الفاتية\n وأعرضوا عن الآخرة بالكلية\n حتى كان عاقبة أمرهم أن اضطروا إلى الشهادة على أنفسهم بالكفر والاستسلام للعذاب المخلد تحذيرًا للسامعين وإرشادًا لهم\n قاله البيضاوي\n ثم ذكر حكمة إرسال الرسل فقال: { ذلك } الإرسال حكمته لـ { أن لم يكن ربك مُهلك القرى بظلم وأهلها غافلون } أي: إنما أرسلَ الرسل لئلا يكون ظالمًا لهم بإهلاكهم بسبب ظلم فعلوه\n وهم غافلون عن الإنذار\n بحيث لم ينذرهم أحد\n أو: لم يكن مهلك القرى ملتبسًا بظلم حيث أهلكهم من غير إنذار\n ففاعل الظلم\n على الأول: القرى\n وعلى الثاني: الله تعالى\n على تقدير إهلاكهم من غير إنذار\n والأول يتمشى على مذهب المعتزلة\n والثاني على مذهب أهل السنة\n انظر ابن جزي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:117",
      "similarity": 0.7107547114767021
    },
    {
      "verse": "29:31",
      "similarity": 0.5676109557726109
    },
    {
      "verse": "18:59",
      "similarity": 0.5649505436422642
    },
    {
      "verse": "15:4",
      "similarity": 0.5553929384989627
    },
    {
      "verse": "21:6",
      "similarity": 0.5449875334284686
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006131.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006131.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:131.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}