{
  "chapter": "الأنعام",
  "text": "فان كذبوك فقل ربكم ذو رحمة وسعة ولا يرد باسه عن القوم المجرمين",
  "translations": [
    {
      "translation": "If they call you a liar, say: 'Your Lord possesses boundless mercy, but His violent force cannot be averted from the people of the evildoers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they call you a liar, tell them infinite is the mercy of your Lord; but His vengeance will not be turned back from the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if they give you the lie, say: 'Your Lord is of unbounded mercy; but His punishment shall not be averted from the guilty folk.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They reject you. (Muhammad), tell them, \"Your Lord's mercy is completely overwhelming, but no one can save the sinful from His wrath.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then if they deny you (O dear Prophet Mohammed – peace and blessings be upon him) say, “Your Lord has boundless mercy; and His wrath is never withdrawn from the culprits.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they deny you say: \"Your Lord is the Owner of vast mercy, and never will His wrath be turned back from the people who are criminals.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they give you the lie, then say: Your Lord is the Lord of All-encompassing mercy; and His punishment cannot be averted from the guilty people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, if they cry thee lies, say: 'Your Lord is of mercy all-embracing, and His might will never be turned back from the people of the sinners.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if they give the lie to thee (Muhammad), say: Your Lord is a Lord of All-Embracing Mercy, and His wrath will never be withdrawn from guilty folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, if they accuse you of lying, say, \"The mercy of your Lord is all-encompassing. His punishment cannot be averted from sinful men.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if they belie thee, say thou: Your Lord is Owner of extensive mercy, and His wrath shall not be turned aside from the guilty people,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But if they deny you, say, ‘Your Lord is dispenser of an all-embracing mercy, but His punishment will not be averted from the guilty lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they accuse thee of falsehood, say: \"Your Lord is full of mercy all-embracing; but from people in guilt never will His wrath be turned back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they (Jews) belie you (Muhammad SAW) say you: \"Your Lord is the Owner of Vast Mercy, and never will His Wrath be turned back from the people who are Mujrimun (criminals, polytheists, sinners, etc.).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they belie you, say: 'Your Lord is the Owner of all Encompassing Mercy, but His Might cannot be withheld from the nation, the evildoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If they accuse you of lying, say, “Your Lord is Possessor of infinite mercy, but His wrath cannot be averted from the guilty people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So if they deny you, [O Muhammad], say, \"Your Lord is the possessor of vast mercy; but His punishment cannot be repelled from the people who are criminals.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:147] So, if they deny you, with regard to what you have brought, then say, to them: ‘Your Lord has all-embracing mercy, for He does not hasten [to bring about] your punishment — herein is a gentle summoning of them to the faith; and His might, His chastisement, when it comes, will never be driven back from the sinning folk’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتفريع على الكلام السّابق الذي أبطل تحريم ما حرّموه ، ابتداء من قوله : { ثمانية أزواج } \\[ الأنعام : 143 \\] الآيات أي : فإن لم يرعَوُوا بعد هذا البيان وكذّبوك في نفي تحريم الله ما زعموا أنَّه حرّمه فذكِّرهم ببأس الله لعلّهم ينتهون عمّا زعموه ، وذكِّرهم برحمته الواسعة لعلّهم يبادرون بطلب ما يخوّلهم رحمته من اتّباع هَدي الإسلام ، فيعود ضمير : { كذبوك } إلى المشركين وهو المتبادر من سياق الكلام : سابِقِه ولاحقه ، وعلى هذا الوجه يجوز أن يكون في قوله : { فقل ربكم ذو رحمة واسعة } تنبيه لهم بأنّ تأخير العذاب عنهم هو إمهال داخل في رحمة الله رحمة مؤقّته ، لعلّهم يسلمون . وعليه يكون معنى فعل : { كذبوك } الاستمرار ، أي إن استمرّوا على التّكذيب بعد هذه الحجج .ويجوز أن يعود الضّمير إلى { الذين هادوا } \\[ الأنعام : 146 \\] ، تكملة للاستطراد وهو قول مجاهد والسُدّي : أنّ اليهود قالوا لم يُحرّم الله علينا شيئاً وإنَّما حرّمنا ما حرّم إسرائيل على نفسه ، فيكون معنى الآية : فَرْض تكذيبهم قوله : { وعلى الذين هادوا حرمنا } \\[ الأنعام : 146 \\] إلخ ، لأنّ أقوالهم تخالف ذلك فهم بحيث يكذّبون ما في هذه الآية ، ويشتبه عليهم الإمهال بالرّضى ، فقيل لهم : { ربكم ذو رحمة واسعة }.ومن رحمته إمهاله المجرمين في الدّنيا غالباً .وقوله : { ولا يرد بأسه عن القوم المجرمين } فيه إيجاز بحذف تقديره : وذو بأس ولا يُردّ بأسه عن القوم المجرمين إذا أراده . وهذا وعيد وتوقّع وهو تذييل ، لأنّ قوله : { عن القوم المجرمين } يعمّهم وغيرهم وهو يتضمّن أنهم مجرمون .\n\n",
      "translations": [
        {
          "translation": "(So if they give the lie to thee) Muhammad regarding the prohibitions that We described to you, (say: Your Lord is a Lord of all-embracing mercy) towards the pious and sinner alike, in that He defers torment to the next life, (and His wrath) His torment (will never be withdrawn from guilty folk) the idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَإِن كَذَّبُوكَ } وعاندوك فيما تلونا عليك { فَقُلْ } لهم إمحاضاً للنصح على مقتضى مرتبة النبوة: { رَّبُّكُمْ ذُو رَحْمَةٍ وَاسِعَةٍ } يمهلكم على ما أنتم عليه ويوسع عليكم على مقتضى رحمته وجماله { وَ } الحال أنه { لاَ يُرَدُّ بَأْسُهُ } وبطشه على مقتضى غيرته وحميته وجلاله { عَنِ ٱلْقَوْمِ ٱلْمُجْرِمِينَ } [الأنعام: 147] الذين أجرموا على الله بالخروج عن مقتضى أحكامه النازلة على ألسنة رسله\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { فإن كذبوك } يا محمد، { فقل } لهم: { ربكم ذو رحمة واسعة } يُمهلكم على التكذيب، فلا تغتروا بإمهاله فإنه يُمهل ولا يُهمل. ولذلك أعقبه بقوله: { ولا يُرَدُّ بأسه عن القوم المجرمين } حين ينزل بهم، أو ذو رحمة واسعة على المطيعين، وذو بأس شديد على المجرمين، فأقام مقامه: { ولا يُرَدُّ بأسه عن القوم المجرمين } ، لتضمنه التنبيه على إنزال البأس عليهم، مع الدلالة على أنه لازب لا يمكن رده. قاله البيضاوي. وفي ابن عطية: ولكن لا تغتروا بسعة رحمته، فإن له بأسًا لا يُرد عن القوم المجرمين. هـ. الإشارة: يُؤخذ من تقديم الرحمة الواسعة على البأس الشديد أن جانب الرجاء أقوى من جانب الخوف لأن حسن الظن بالله مطلوب من العبد على كل حال، لأن الرجاء وحسن الظن يستوجبان محبة العبد وإيحاشه إلى سيده بخلاف الخوف، وهذا مذهب الصوفية: أن تغليب الرجاء هو الأفضل في كل وقت، ومذهب الفقهاء أن حال الصحة ينبغي تغليب الخوف لينزجر عن العصيان، وحال المرض يغلب الرجاء إذ لا ينفع حينئذٍ، فالصوفية يرون أن العبد معزول عن الفعل، فليس له قدرة على فعل ولا ترك. وإنما ينظر ما تفعل به القدرة، فهو كحال المستشرف على الموت. والفقهاء يرون أن العبد له كسب واختيار. والله تعالى أعلم. ولا ينفع الاحتجاج بالقدر على كلا المذهبين، كما قال تعالى: { سَيَقُولُ ٱلَّذِينَ أَشْرَكُواْ لَوْ شَآءَ ٱللَّهُ مَآ أَشْرَكْنَا }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:98",
      "similarity": 0.4787376598734832
    },
    {
      "verse": "4:130",
      "similarity": 0.3960304775600391
    },
    {
      "verse": "29:56",
      "similarity": 0.36577482495228153
    },
    {
      "verse": "12:110",
      "similarity": 0.3645797121082605
    },
    {
      "verse": "6:80",
      "similarity": 0.3567021421904475
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006147.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006147.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:147.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}