{
  "chapter": "الأنعام",
  "text": "قل اغير الله اتخذ وليا فاطر السموت والارض وهو يطعم ولا يطعم قل انى امرت ان اكون اول من اسلم ولا تكونن من المشركين",
  "translations": [
    {
      "translation": "Say: 'Am I to take anyone other than Allah as my protector, the Bringer into Being of the heavens and the earth, He who feeds and is not fed?' Say: 'I am commanded to be the first of the Muslims,' and, 'Do not be among the idolaters.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Should I find some other protector besides God the Creator of the heavens and the earth, who nourishes all and is nourished by none? Say: \"I am commanded to be the first to submit to Him, and not be an idolater.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Shall I take for my guardian anyone other than Allah - the Originator of the heavens and earth; He Who feeds and Himself is not fed?' Say: 'Surely I have been commanded to be the first among those who submit (to Allah) and not to be one of those who associate others with Allah in His divinity (even though others may do so).'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), ask them, \"Should I take a guardian other than God, the Originator of the heavens and the earth, who feeds everyone and who needs no food Himself?\" Say, \"I have been commanded to be the first Muslim (submitted to the will of God). Thus, people, do not be pagans.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Shall I choose as a supporter someone other than Allah, Who is the Originator of the heavens and the earth and Who feeds and does not need to eat?” Say, “I have been ordered to be the first to submit myself (to Him), and O people, do not be of the polytheists.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Shall I take as a guardian any other than Allah, the Creator of the heavens and the earth And it is He Who feeds but is not fed.\" Say: \"Verily, I am commanded to be the first of those who submit. \"And be not you of the idolators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Shall I take a guardian besides Allah, the Originator of the heavens and the earth, and He feeds (others) and is not (Himself) fed. Say: I am commanded to be the first who submits himself, and you should not be of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Shall I take to myself as protector other than God, the Originator of the heavens and of the earth, He. who feeds and is not fed?' Say: 'I have been commanded to be the first of them that surrender: \"Be not thou of the idolaters.\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Shall I choose for a protecting friend other than Allah, the Originator of the heavens and the earth, Who feedeth and is never fed? Say: I am ordered to be the first to surrender (unto Him). And be not thou (O Muhammad) of the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Shall I take as my protector someone other than God, Creator of the heavens and the earth, who feeds all and is fed by none?\" Say, \"I have been commanded to be the first of those who submit. Do not be one of the polytheists.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: Shall I take for a patron any other than Allah, the Maker of the heavens and the earth! And He feedeth, and is not fed. Say thou: I am commanded that I be the first who submitteth himself, and that: be thou not of the associaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Shall I take for guardian [anyone] other than Allah, the originator of the heavens and the earth, who feeds and is not fed?’ Say, ‘I have been commanded to be the first of those who submit [to Allah], and [told,] “Never be one of the polytheists.” ’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Shall I take for my protector any other than Allah, the Maker of the heavens and the earth? And He it is that feedeth but is not fed.\" Say: \"Nay! but I am commanded to be the first of those who bow to Allah (in Islam), and be not thou of the company of those who join gods with Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Shall I take as a Wali (helper, protector, etc.) any other than Allah, the Creator of the heavens and the earth? And it is He Who feeds but is not fed.\" Say: \"Verily, I am commanded to be the first of those who submit themselves to Allah (as Muslims).\" And be not you (O Muhammad SAW) of the Mushrikun [polytheists, pagans, idolaters and disbelievers in the Oneness of Allah].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Should I take any but Allah for a guardian? He is the Originator of the heavens and the earth. He feeds and is not fed' Say: 'I was commanded to be the first to submit to Him' Do not be one of the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Shall I take for myself a protector other than God, Originator of the heavens and the earth, and He feeds and is not fed?” Say, “I am instructed to be the first of those who submit.” And do not be among the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Is it other than Allah I should take as a protector, Creator of the heavens and the earth, while it is He who feeds and is not fed?\" Say, [O Muhammad], \"Indeed, I have been commanded to be the first [among you] who submit [to Allah] and [was commanded], 'Do not ever be of the polytheists.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:14] Say, to them: ‘Shall I take as a protector, to worship, other than God, the Originator of the heavens and the earth, the One Who has created them without any precedent, He Who feeds, Who gives sustenance, and is not fed?’, and is not given sustenance. Say: ‘I have been commanded to be the first to submit, to God, from among this community, and, it was said to me: “Do not be among those who associate others” ’, with Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (Shall I choose for a protecting friend) for a lord to worship (other than Allah, the Originator of the heavens and the earth, who feedeth) provides sustenance to the servants (and is never fed?) is never provided sustenance; it is also said: He is not helped in providing sustenance to His servants. (Say) to the unbelievers of Mecca, Muhammad: (I am ordered to be the first to surrender (unto Him)) the first to embrace Islam; it is also said that this means: the first among the people of his time to worship sincerely and declare Allah's divine Oneness. (And be not thou (0 Muhammad) of the idolaters) with the idolaters, following their religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَاطِرِ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } معناهُ مُبتدئءُ خَلْقِها\n والفُطُورُ: الصِّدُوعُ\n\n",
      "translations": [
        {
          "translation": " And His saying - the Most High: {So the Originator of the heavens and the earth} meaning the One who began His creation.\n\n\nThe Futooh: The Sudden Awakening",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لمن أنكر توحيد الله وأثبت الشريط له\n ومع ذلك يرغبك يا أكمل الرسل إلى شركه إلزاماً وتبكيتاً: { أَغَيْرَ ٱللَّهِ } الواحد الأحد الصمد الذي لا شريك له أصلاً { أَتَّخِذُ وَلِيّاً } مولياً وكيلاً لأكون مشركاً مع كونه سبحانه { فَاطِرِ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: موجدهما ومظهرهما من كتم العدم { وَهُوَ يُطْعِمُ } أي: يرزق للمحتاجين { وَلاَ يُطْعَمُ } لتنزهه عن الأكل والشرب\n خص بهذه الصنعة\n لأنه من أقوى أسباب الإمكان\n وأجل أمارات الحدوث وأظهرها\n والباقي متفرع عليه { قُلْ } يا أكمل الرسل لكافة البرايا: { إِنِّيۤ أُمِرْتُ } من عند ربي { أَنْ أَكُونَ أَوَّلَ مَنْ أَسْلَمَ } أطاع وانقاد\n وأظهر التوحيد الذاتي وأدعو الناس إليه { وَ } أيضاً نُهيت أنا على وجه المبالغة والتأكيد من عنده سبحانه بقوله: { لاَ تَكُونَنَّ مِنَ ٱلْمُشْرِكَينَ } [الأنعام: 14] المثبتين الوجود لغير الحق من الأظلال وبعدما أمرت مما أمرت",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { فاطر }: نعت لله\n ومعناه: خالق ومبدع\n قال ابن عباس رضي الله عنه:  ما كُنت أعرف معنى فاطر\n حتى أتاني أعرابيان يختصمان في بئر\n فقال أحدهما: أنا فطَرتها بيدي\n وجملة: { وهو يطعم }: حال\n وقُرِىء بعكس الأول ببناء الأول للمفعول\n والثاني للفاعل\n على أن ضمير { هو } راجع لغير الله\n وببنائهما للفاعل على معنى يُطعِم تارة\n ويمنع أخرى\n كقوله:\n[البَقَرَة:245]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "82:1",
      "similarity": 0.5666603467032415
    },
    {
      "verse": "21:56",
      "similarity": 0.5432193474019087
    },
    {
      "verse": "73:18",
      "similarity": 0.5309078098621103
    },
    {
      "verse": "43:27",
      "similarity": 0.513660414186131
    },
    {
      "verse": "36:22",
      "similarity": 0.5130569071314931
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006014.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006014.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:14.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}