{
  "chapter": "الأنعام",
  "text": "وعلى الذين هادوا۟ حرمنا كل ذى ظفر ومن البقر والغنم حرمنا عليهم شحومهما الا ما حملت ظهورهما او الحوايا او ما اختلط بعظم ذلك جزينهم ببغيهم وانا لصدقون",
  "translations": [
    {
      "translation": "We made haram for the Jews every animal with an undivided hoof, and in respect of cattle and sheep, We made their fat haram for them, except what is attached to their backs or guts or mixed up with bone. That is how We repaid them for their insolence. And We certainly speak the truth.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made unlawful for the Jews all animals with claws or nails, and the fat of the oxen and sheep, except that on their backs or their intestines, or which remains attached to their bones. This was the punishment for their insubordination; and what We say is true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to those who had Judaized We have forbidden all beasts with claws, and the fat of oxen and sheep except the fat which is either on their backs or their entrails, or that which sticks to the bones. Thus did We requite them for their rebellion. Surely We state the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made unlawful for the Jews all the claw-footed animals, fat of the cows, sheep and goats except what is found on their backs, intestines and whatever is mixed with their bones. Thus, did We recompense them for their rebellion and We are certainly truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for the Jews We forbade all animals with claws; and forbade them the fat of oxen and sheep except which is on their backs or joined to their intestines or to the bone; We awarded this to them for their rebellion; and indeed, surely, We are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto those who are Jews, We forbade every (animal) with undivided hoof, and We forbade them the fat of the ox and the sheep except what adheres to their backs or their Hawaya, or is mixed up with a bone. Thus We recompensed them for their rebellion. And verily, We are Truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to those who were Jews We made unlawful every animal having claws, and of oxen and sheep We made unlawful to them the fat of both, except such as was on their backs or the entrails or what was mixed with bones: this was a punishment We gave them on account of their rebellion, and We are surely Truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to those of Jewry We have forbidden every beast with claws; and of oxen and sheep We have forbidden them the fat of them, save what their backs carry, or their entrails, or what is mingled with bone; that We recompensed them for their insolence; surely We speak truly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto those who are Jews We forbade every animal with claws. And of the oxen and the sheep forbade We unto them the fat thereof save that upon the backs or the entrails, or that which is mixed with the bone. That we awarded them for their rebellion. And lo! we verily are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We forbade the Jews all animals with claws and the fat of sheep [and goats] and oxen, except what is on their backs and in their intestines and what adheres to their bones. That is the penalty We imposed on them for their disobedience. And We assuredly are true to Our word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto those who are Judaised We forbade every animal with cloven hoof; and of the bullock and the goats We forbade unto them the fat thereof, save that which is borne on their backs or entrails or that which sticketh to the bone. Thus We requited them for their rebellion, and verily We are the Truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To the Jews We forbade every animal having an undivided hoof, and of oxen and sheep We forbade them their fat, except what is borne by their backs or the entrails, or what is attached to the bones. We requited them with that for their rebelliousness, and We indeed speak the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who followed the Jewish Law, We forbade every (animal) with undivided hoof, and We forbade them that fat of the ox and the sheep, except what adheres to their backs or their entrails, or is mixed up with a bone: this in recompense for their wilful disobedience: for We are true (in Our ordinances).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And unto those who are Jews, We forbade every (animal) with undivided hoof, and We forbade them the fat of the ox and the sheep except what adheres to their backs or their entrails, or is mixed up with a bone. Thus We recompensed them for their rebellion [committing crimes like murdering the Prophets, eating of Riba (usury), etc.]. And verily, We are Truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We forbade the Jews all with undivided hoofs and the fat of sheep and cattle, except what is on their backs and entrails, and what is mixed with their bones. As such We recompensed them for their transgress ions. Indeed, We are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the Jews We forbade everything with claws. As of cattle and sheep: We forbade them their fat, except what adheres to their backs, or the entrails, or what is mixed with bone. This is how We penalized them for their inequity. We are indeed truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to those who are Jews We prohibited every animal of uncloven hoof; and of the cattle and the sheep We prohibited to them their fat, except what adheres to their backs or the entrails or what is joined with bone. [By] that We repaid them for their injustice. And indeed, We are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:146] And to those of Jewry, that is, the Jews, We forbade every beast with hoof, that is, [every animal] which does not have divided toes, such as camels and ostriches; and of oxen and sheep We forbade them the fat of them, the thin fat lining the stomach and the fat of the kidneys, save what their backs carry, that is, what [fat] is attached to it, or, what is carried by, their entrails, their intestines (hawāyā is the plural of hāwiyā’ or hāwiya), or what is mingled with bone, thereof, which is the fat of the rump: these were lawful for them; that, prohibition, We requited them, with, for their insolence, on account of their wrongdoing, as already mentioned in sūrat al-Nisā’ [Q. 4:160]; verily We are truthful, in [recounting] Our tidings and Our appointed times.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Unto those who are Jews We forbade every animal with claws) every bird with claws and every predatory animal with teeth, as well as every beast that has claws such as camels, ducks, geese, egrets and rabbits. All these were forbidden for them. (And of the oxen and the sheep forbade We unto them the fat thereof) i.e. the fat spread between the bowels and intestines and the fat spread over the kidneys (save that upon the backs or the entrails, or that which is mixed with the bone) such as the tail; all these were lawful for them. (That) which We made unlawful for them (We awarded them) We punished them (for their rebellion) because of their transgression We made all these forbidden for them. (And lo! We verily are Truthful) in what We have said.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوِ ٱلْحَوَايَآ } معناهُ المَباعرُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Or the Hawai'a} means the one who is close.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إن سألوك يا أكمل الرسل عن محرمات الأمم الماضية قل لهم نيابة عنا: { عَلَى ٱلَّذِينَ هَادُواْ حَرَّمْنَا كُلَّ ذِي ظُفُرٍ } وحافر يمكن أن يخرج معها { وَمِنَ ٱلْبَقَرِ وَٱلْغَنَمِ حَرَّمْنَا عَلَيْهِمْ شُحُومَهُمَآ إِلاَّ مَا حَمَلَتْ } من الشحوم { ظُهُورُهُمَا } وهي الثُّروب وشحوم الكلى { أَوِ } حملتها { ٱلْحَوَايَآ } أي: الأمعاء { أَوْ مَا ٱخْتَلَطَ } من الشحوم { بِعَظْمٍ } كالألية { ذٰلِكَ } أي: تحريم هذه الأشياء\n وإن كان الأصل في الأشياء الحل والإباحة مطلقة بسبب أنا { جَزَيْنَٰهُم بِبَغْيِهِمْ } بها وظلمهمه وخروجهم عن حدودنا بلا ورود نص منا { وِإِنَّا لَصَٰدِقُونَ } [الأنعام: 146] في جميع ما أوحينا إليك من الأقوال والأخبار والمواعيد والوعيدات",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { الحوايا } هي الأمعاء، أي: المصارين التي فيها البعر، وتسمى المباعر، جمع حوية، فعيلة، فوزنها على هذا: فعائل، فصنع بها ما صنع بهرَاوا، وقيل: جمع حاوية، فوزنها: فواعل، كقوارب، وهو عطف على ما في قوله: { إلا ما حملت }. يقول الحقّ جلّ جلاله: { وعلى الذين هادوا حرمنا كل ذي ظفر } ماله أصبع، كالإبل والأوز والنعام، وغيرها من الحيوان، الذي هو غير منفرج الأصابع وله ظفر، وقيل: كل ذي مخلب وحافر، وسمي الحافر ظفرًا مجازًا. { ومن البقر والغنم حرمنا عليهم شحومهما } كالثروب وشحوم الكُلى، { إلا ما حملت ظُهورهما } أي: إلا ما علق من الشحم بظهور البقر والغنم، فهو حلال عليهم، لكنهم اليوم لا يأكلونه، حدثني شيخي الفقيه الجنوي أنه سأل بعض أحبارهم: هل هو حرام في كتابكم؟ فقال له: لا، لكنهم قاسوه سدًا للذريعة. هـ. فلما شددوا شدد الله عليهم، { أو الحوايا } أي: ما احتوت عليه الأمعاء والحشوة مما يتحوى في البطن من الشحوم، فهو حلال عليهم { أو ما اختلط بعظم } في جميع الجسد، فإنه حلال عليهم، لكنهم شددوا فحرموا الجميع عقوبة من الله { ذلك } التحريم جزاءٌ { جزيناهم } به بسبب بغيهم، أي: ظلمهم، { وإنا لصادقون } فيما أخبرنا به من التحريم، وفي ذلك تعريض بكذب من حرّم غير ما حرم الله. الإشارة: يؤخذ من الآية أن الذنوب والمعاصي تضيق على العبد لذائذ متعته، وتقتر عليه طيب رزق بشريته، وتضيق عليه آيضًا حلاوة المعاملة في قلبه، ولذة الشهود في روحه وسره، لقوله تعالى: { ذلك جزيناهم ببغيهم }. وقال تعالى:\n[الأعرَاف:96]، وقال في شأن القلب:\n[الأنفَال:29]، أي: نورًا يفرق بين الحق والباطل، وقال تعالى:\n[البَقَرَة:282]، أي: علمًا لدُّنيا، فالمعصية كلها تُبعد العبد من الحضرة، إن لم يتب، والطاعة كلها تقرب من الحضرة. والتنعم إنما هو على قدر القرب، ونقصانه على قدر البُعد. والله تعالى أعلم. ولمَّا كانت المعصية توجب تعجيل العقوبة أخبر تعالى عن سعة حلمه، فقال: { فَإِن كَذَّبُوكَ فَقُلْ رَّبُّكُمْ ذُو رَحْمَةٍ وَاسِعَةٍ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "87:5",
      "similarity": 0.2828653265281639
    },
    {
      "verse": "48:24",
      "similarity": 0.24110293246364783
    },
    {
      "verse": "9:102",
      "similarity": 0.11956735755029009
    },
    {
      "verse": "2:220",
      "similarity": 0.1108370489594526
    },
    {
      "verse": "38:24",
      "similarity": 0.10165983907830059
    }
  ]
}