{
  "chapter": "الأنعام",
  "text": "قد خسر الذين قتلوا۟ اولدهم سفهۢا بغير علم وحرموا۟ ما رزقهم الله افتراء على الله قد ضلوا۟ وما كانوا۟ مهتدين",
  "translations": [
    {
      "translation": "Those who kill their children foolishly without any knowledge and make what Allah has provided for them haram, inventing lies against Allah, such people are lost. They are misguided. They are not guided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will surely perish who kill their offspring in ignorance foolhardily, and forbid the food that God has given them by fabricating lies against God. Misguided are they surely, and will never come to guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who slayed their children in folly, without knowledge,. and forbade the sustenance that Allah has provided them, falsely ascribing that to Allah, are utter losers; they have gone astray, and are certainly not among those guided to the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who foolishly and ignorantly murdered their children, ascribed falsehood to God and made unlawful what He had given to them for their sustenance, have certainly lost much. They had gone far away from the right guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed ruined are those who slay their children out of senseless ignorance and forbid the sustenance which Allah has bestowed upon them, in order to fabricate lies against Allah; they have undoubtedly gone astray and not attained the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed lost are they who have killed their children, foolishly, without knowledge, and (they) have forbidden that which Allah has provided for them, inventing a lie against Allah. They have indeed gone astray and were not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are lost indeed who kill their children foolishly without knowledge, and forbid what Allah has given to them forging a lie against Allah; they have indeed gone astray, and they are not the followers of the right course.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Losers are they who slay their children in folly, without knowledge, and have forbidden what God has provided them, forging against God; they have gone astray, and are not right-guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are losers who besottedly have slain their children without knowledge, and have forbidden that which Allah bestowed upon them, inventing a lie against Allah. They indeed have gone astray and are not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Losers indeed are they who kill their children foolishly and without knowledge and declare as forbidden what God has provided for them as sustenance -- a fabrication against God: they have gone astray and have not chosen to be rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely lost are they who slay their offspring foolishly and without knowledge, and have forbidden that which Allah had provided for them: a fabrication against Allah: surely they have strayed and have not become guided ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are certainly losers who slay their children foolishly without knowledge, and forbid what Allah has provided them, fabricating a lie against Allah. Certainly, they have gone astray and are not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lost are those who slay their children, from folly, without knowledge, and forbid food which Allah hath provided for them, inventing (lies) against Allah. They have indeed gone astray and heeded no guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed lost are they who have killed their children, from folly, without knowledge, and have forbidden that which Allah has provided for them, inventing a lie against Allah. They have indeed gone astray and were not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lost are those who, without knowledge, have foolishly slain their own children and made unlawful that which Allah has provided them, fabricating lies about Allah. They have gone astray and are not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lost are those who kill their children foolishly, with no basis in knowledge, and forbid what God has provided for them—innovations about God. They have gone astray. They are not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those will have lost who killed their children in foolishness without knowledge and prohibited what Allah had provided for them, inventing untruth about Allah. They have gone astray and were not [rightly] guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:140] They are losers who slay (read qatalū or qattalū) their children, by burying them alive, in folly, out of ignorance, without knowledge, and have forbidden what God has provided them, of what has been mentioned, in calumny against God. Verily they have gone astray and are not guided.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتذييل جُعل فذلكة للكلام السّابق ، المشتمل على بيان ضلالهم في قتل أولادهم ، وتحجير بعض الحلال على بعض من أحلّ له .وتحقيق الفعل ب { قد } للتّنبيه على أنّ خسرانهم أمر ثابت ، فيفيد التّحقيق التّعجيب منهم كيف عَمُوا عمَّا هم فيه من خسرانهم . وعن سعيد بن جبير قال ابن عبّاس : إذا سرّك أن تعلم جهلَ العرب فاقرأ ما فوق الثّلاثين ومائة من سورة الأنعام : { قد خسر الذين قتلوا أولادهم سفاهاً بغير علم إلى وما كانوا مهتدين . أي من قوله تعالى : { وجعلوا لله ممّا ذرأ من الحرث والأنعام نصيباً } \\[ الأنعام : 136 \\] وجعلها فوق والثّلاثين ومائة تقريباً ، وهي في العدّ السادسة والثلاثون ومائة .ووصف فعلهم بالخسران لأنّ حقيقة الخسران نقصان مال التّاجر ، والتّاجر قاصد الرّبح وهو الزّيادة ، فإذا خسر فقد باء بعكس ما عَمِل لأجلِه ( ولذلك كثر في القرآن استعارة الخسران لعمل الّذين يعملون طلباً لمرضاة الله وثوابه فيقعون في غضبه وعقابه ، لأنَّهم اتّعبوا أنفسهم فحصلوا عكس ما تعبوا لأجله ) ذلك أنّ هؤلاء الّذين قتلوا أولادهم قد طلبوا نفع أنفسهم بالتخلّص من أضرارٍ في الدّنيا مُحْتَمَللٍ لحَاقُها بهم من جراء بَناتهم ، فوقعوا في أضرار محقّقة في الدّنيا وفي الآخرة ، فإنّ النّسل نعمة من الله على الوالدين يأنسون به ويجدونه لكفاية مهمّاتهم ، ونعمة على القبيلة تكثر وتعتزّ ، وعلى العالَم كلّه بكثرة من يعمره وبما ينتفع به النّاس من مواهب النّسل وصنائعه ، ونعمة على النّسل نفسِه بما يناله من نعيم الحياة وملذاتها . ولتلك الفوائد اقتضت حكمة الله إيجاد نظام التّناسل ، حفظاً للنّوع ، وتعميراً للعالم ، وإظهاراً لما في الإنسان من مواهبَ تنفعه وتنفع قومه ، على ما في عملهم من اعتداء على حقّ البنت الّذي جعله الله لها وهو حقّ الحياة إلى انقضاء الأجل المقدّر لها وهو حقّ فطري لا يملكه الأب فهو ظلم بيّن لرجاء صلاح لغير المظلوم ولا يُضَرّ بأحد ليَنتفع غيره . فلما قتل بعض العرب بناتِهم بالوأْد كانوا قد عطّلوا مصالحَ عظيمة محقّقة ، وارتكبوا به أضراراً حاصلة ، من حيث أرادوا التخلّص من أضرار طفيفة غير محقّقة الوقوع ، فلا جرم أن كانوا في فعلهم كالتّاجر الّذي أراد الرّبح فباء بضياع أصل ماله ، ولأجل ذلك سمَّى الله فعلهم : سفهاً ، لأنّ السّفه هو خفّة العقل واضطرابه ، وفعلهم ذلك سفه محض ، وأيُّ سفه أعظم من إضاعة مصالح جمّة وارتكاب أضرار عظيمة وجناية شنيعة ، لأجل التخلّص من أضرار طفيفة قد تحصُل وقد لا تحصل . وتعريف المسند إليه بالموصولية للإيماء إلى أنّ الصّلة علّة في الخبر فإنّ خسرانهم مسبّب عن قتل أولادهم .وقوله : { سفهاً } منصوب على المفعول المطلق المبين لنوع القتل : أنّه قتلُ سفه لا رأي لصاحبه ، بخلاف قتل العَدوّ وقتْل القاتل ، ويجوز أن ينتصب على الحال من { الذين قتلوا } ، وصفوا بالمصدر لأنّهم سفهاءُ بالغون أقصى السفه .والباء في قوله : { بغير علم } للملابسة ، وهي في موضع الحال إمَّا منْ { سفهاً } فتكون حالاً مؤكّدة ، إذ السفه لا يكون إلاّ بغير علم ، وإمَّا من فاعل { قتلوا } ، فإنَّهم لمّا فعلوا القتل كانوا جاهلين بسفاهتهم وبشناعة فعلهم وبعاقبة ما قدّروا حصوله لهم من الضرّ ، إذ قد يحصل خلاف ما قدّروه ولو كانوا يزنون المصالح والمفاسد لما أقدموا على فعلتهم الفظيعة .والمقصود من الإخبار عن كونه بغير علم ، بعد الإخبار عنه بأنّه سفَه . التّنبيه على أنَّهم فعلوا ذلك ظنّا منهم أنَّهم أصابوا فيما فعلوا ، وأنَّهم علموا كيف يَرأبُون ما في العالم من المفاسد ، وينظمون حياتهم أحسن نظام ، وهم في ذلك مغرورون بأنفسهم ، وجاهلون بأنَّهم يجهلون { الذين ضلّ سعيهم في الحياة الدّنيا وهم يحسبون أنّهم يُحسنون صُنعا } \\[ الكهف : 104 \\]. وتقدّم الكلام على الوأد آنفاً ، ويأتي في سورة الإسراء عند قوله : { ولا تقتلوا أولادكم خشية إملاق } \\[ الإسراء : 31 \\].وقرأ الجمهور : { قَتَلوا أولادهم } بتخفيف التّاء وقرأه ابن عامر بتشديد التّاء لأنّه قتْل بشدّة ، وليست قراءة الجمهور مفيتة هذا المعنى ، لأنّ تسليط فعل القتل على الأولاد يفيد أنَّه قتل فظيع .وقوله : { وحرموا ما رزقهم الله } نَعَى عليهم خسرانهم في أن حرّموا على أنفسهم بعض ما رزقهم الله ، فحُرِموا الانتفاع به ، وحَرَموا النّاس الانتفاع به ، وهذا شامل لجميع المشركين ، بخلاف الّذين قتلوا أولادهم . والموصول الّذي يراد به الجماعة يصحّ في العطف على صلته أن تكون الجمل المتعاطفة مع الصّلة موزّعة على طوائف تلك الجماعة كقوله تعالى : { إنّ الذين يكفرون بآيات الله ويقتلون النّبيين بغير حقّ ويقتلون الذين يأمرون بالقسط من النّاس فبشّرهم بعذاب أليم } \\[ آل عمران : 21 \\].وانتصب { افتراء } على المفعول المطلق ل { حرّموا } : لبيان نوع التّحريم بأنَّهم نسبوه لله كذباً .وجملة { قد ضلوا } استئناف ابتدائي لزيادة النّداء على تحقّق ضلالهم .والضّلال : خطأ الطّريق الموصِّل إلى المقصود ، فهم راموا البلوغ إلى مصالح دنيوية ، والتّقرب إلى الله وإلى شركائهم ، فوقعوا في المفاسد العظيمة ، وأبعدهم الله بذنوبهم ، فلذلك كانوا كمن رام الوصول فسلك طريقاً آخر .وعَطْف { وما كانوا مهتدين } على { قد ضلوا } لقصد التّأكيد لمضمون جملة { ضلوا } لأنّ مضمون هذه الجملة ينفي ضدّ الجملة الأولى فتؤول إلى تقرير معناها .والعرب إذا أكّدوا بمثل هذا قد يأتون به غير معطوف نظراً لمآل مُفاد الجملتين ، وأنَّهما باعتباره بمعنى واحد ، وذلك حقّ التّأكيد كما في قوله تعالى : { أموات غيرُ أحياء } \\[ النحل : 21 \\] وقوله : { فذلك يومئذ يوم عسير على الكافرين غير يسير } \\[ المدثر : 9 ، 10 \\]. وقول الأعشى: ... إمَّا تَرَيْنَا حُفَاة لا نِعَالَ لناوقد يأتون به بالعطف وهو عطف صوري لأنَّه اعتداد بأنّ مفهوم الجملتين مختلف ، ولا اعتداد بمآلهما كما في قوله تعالى : { وأضلّ فرعون قومَه وما هَدى } \\[ طه : 79 \\] وقوله : { قد ضللتُ إذنْ وما أنا من المهتدين } \\[ الأنعام : 56 \\] وقول المتنبّي: ... والبَيْنُ جارَ على ضُعفي وما عَدَلاوكذلك جاء في هذه الآية ليفيد ، بالعطف ، أنَّهما خبران عن مساويهم .و ( كان ) هنا في حكم الزائدة : لأنَّها زائدة معنى ، وإن كانت عاملة ، والمراد : وما هم بمهتدين ، فزيادة ( كان ) هنا لتحقيق النّفي مثلَ موقعها مع لام الجحود ، وليس المراد أنَّهم ما كانوا مهتدين قبل أن يقتلوا أولادهم ويُحرّموا ما رزقهم الله ، لأنّ هذا لا يتعلّق به غرض بليغ .\n\n",
      "translations": [
        {
          "translation": "(They are losers who besottedly) out of ignorance (have slain their children) have buried their daughters alive (without knowledge) this was revealed about Rabi'ah and Mudar, two leaders of Arab clans buried their daughters alive in the pre-Islamic period, except for the the Banu Kinanah who did not engage in such a practice, (and have forbidden) for women (that which Allah bestowed upon them) that which Allah has made lawful for them of cattle and crops, (inventing a lie against Allah. They indeed have gone astray) they are in error about what they say (and are not guided) to the guidance and right in that which they ascribe unlawfulness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَدْ خَسِرَ } وخاب خيبة مؤبدة الأعراب { ٱلَّذِينَ قَتَلُوۤاْ أَوْلَٰدَهُمْ سَفَهاً } مخالفة سبي وإملاق { بِغَيْرِ عِلْمٍ } منهم بما يؤول أمرهم عليه\n ولا شك أن الرازق لعباده هو الله لا هم { وَ } أيضاً { حَرَّمُواْ } على نفوسهم { مَا رَزَقَهُمُ ٱللَّهُ } وأباح عليهم ن البحائر والسوائب وغيرها ونسبوا تحريمها { ٱفْتِرَآءً عَلَى ٱللَّهِ } هوى وميلاً إلى الباطل\n وبالجملة: { قَدْ ضَلُّواْ } بهذه الجرائم عن طريق الحق { وَمَا كَانُواْ مُهْتَدِينَ } [الأنعام: 140] إلى توحيده وما يرجى منهم الهداية والفلاح أصلاً\n\n\n{ وَ } كيف تضلون عن طريق الحق أيها الجاهلون المسرفون مع أنه سبحانه { هُوَ ٱلَّذِيۤ أَنشَأَ } لكم لمعاشكم في النشأة الأولى { جَنَّٰتٍ } من الكروم { مَّعْرُوشَٰتٍ } مرتفعات من الأرض { وَغَيْرَ مَعْرُوشَٰتٍ } ملقيات على وجه الأرض { وَ } أنشأ لكم أيضاً { ٱلنَّخْلَ وَٱلزَّرْعَ مُخْتَلِفاً أُكُلُهُ } أي: أكمل كل واحد منهما رطباً ويابساً { وَٱلزَّيْتُونَ وَٱلرُّمَّانَ مُتَشَٰبِهاً } بعضها ببعض { وَغَيْرَ مُتَشَٰبِهٍ } بل مختلف في الشكل والطعم { كُلُواْ مِن ثَمَرِهِ } أي: ثمر كل واحد من المذكورات حيث شئتم { إِذَآ أَثْمَرَ وَآتُواْ حَقَّهُ } أي: أخرجوا حق الله منه على الوجه المفروض { يَوْمَ حَصَادِهِ } إدراكه وبدو صلاحه { وَلاَ تُسْرِفُوۤاْ } في الأكل إلى حيث تقسى قلوبكم وبكل إدراككم { إِنَّهُ لاَ يُحِبُّ ٱلْمُسْرِفِينَ } [الأنعام: 141] أي: لا يرضى: عنهم وعن فعلهم\n إذ الأكل إنما هو لقوام البدن وتقوية الروح على فعله\n وإسرافه يفضي إلى التعطيل والتكليل المخل للحكمة الإلهية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { سفهًا }: حال أو مصدر، وكذلك: { افتراء }. يقول الحقّ جلّ جلاله: { قد خسر الذين قتلوا أولادهم } يعني: العرب الذين كانوا يقتلون بناتهم مخافة السبي أو الفقر، { بغير علم } ولا دليل لخفة عقلهم وجهلهم بأن الله رازق أولادهم كما يرزقهم، وليسوا هم الرزاقين لهم، { وحرَّموا ما رزقهم الله } من البحائر والسوائب ونحوهما { افتراء على الله } من عند أنفسهم، { قد ضلوا وما كانوا مهتدين } إلى الحق الصواب. الإشارة: قد خسر الذين ضيعوا قلوبهم فلم تنتج لهم شيئًا من أبكار الحقائق وأسرار العلوم، بل اشتغلوا بالسفه من القول والفعل، بغير علم ولا بصيرة نافذة، وحرموا ما رزقهم الله من العلوم والأسرار، لو طهروا قلوبهم، وخربوا ظواهرهم وخرقوا عوائدهم، لكنهم حكموا على فعل ذلك بالتحريم، تجمدوا على علم الرسوم وحفظ المروءة، والمروءة إنما هي التقوى والدين، كما قال الإمام مالك رضي الله عنه، قد ضلوا عن طريق الوصول، وما كانوا مهتدين إلى طريق الخصوص، ما داموا على ما هم عليه من زيّ اللصوص. ثم بيَّن أن الأشياء كلها لله، ليس لأحد فيها شيء حتى يحلل منها أو يحرم، فقال: { وَهُوَ ٱلَّذِيۤ أَنشَأَ جَنَّاتٍ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:67",
      "similarity": 0.6097777076199778
    },
    {
      "verse": "2:13",
      "similarity": 0.5695827920160141
    },
    {
      "verse": "7:66",
      "similarity": 0.5589239413077389
    },
    {
      "verse": "2:142",
      "similarity": 0.44704946818603625
    },
    {
      "verse": "4:5",
      "similarity": 0.4006427686048554
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006140.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006140.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:140.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}