{
  "chapter": "الأنعام",
  "text": "سيقول الذين اشركوا۟ لو شاء الله ما اشركنا ولا ءاباؤنا ولا حرمنا من شىء كذلك كذب الذين من قبلهم حتى ذاقوا۟ باسنا قل هل عندكم من علم فتخرجوه لنا ان تتبعون الا الظن وان انتم الا تخرصون",
  "translations": [
    {
      "translation": "Those who associate others with Allah will say, 'If Allah had willed we would not have associated anything with Him, nor would our fathers; nor would we have made anything haram.' In the same way the people before them also lied until they felt Our violent force. Say: 'Do you have some knowledge you can produce for us? You are following nothing but conjecture. You are only guessing.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the idolaters say: \"If God had so willed we would not have associated (others with Him), nor would have our fathers, nor would we have forbidden any thing.\" So had others denied before them, and had to taste Our punishment in the end. Ask them: \"Have you any knowledge? Then display it. You follow nothing but conjecture, and are nothing but liars.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who associate others with Allah in His divinity will now surely say: 'Had Allah willed, neither we nor our forefathers would have associated others with Allah in His divinity, nor would we have declared anything (which Allah did not forbid) as forbidden.' Even so those who had lived before them gave the lie (to the Truth) until they tasted Our chastisement. Tell them: 'Have you any sure knowledge that you can produce before us? In fact you are only following idle fancies, merely conjecturing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The pagans will say, \"Had God wanted, we would not have worshipped idols, nor would our fathers, nor would we have made anything unlawful.\" Others before them had also spoken such lies until they experienced the severity of Our wrath. (Muhammad), ask them, \"Do you possess any knowledge? If so, tell us about it. You follow only conjectures and preach falsehood.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The polytheists will now say, “Had Allah willed, we would not have ascribed partners (to Him) nor would have our forefathers, nor would we have forbidden anything”; similarly those before them had denied, till the time they tasted Our punishment; say, “Do you have any knowledge so you can offer it to us? You follow only assumptions and only make guesses.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who committed Shirk say: \"If Allah had willed, we would not have commited Shirk, nor would our fathers, and we would not have forbidden anything (against His will).\" Likewise belied those who were before them, till they tasted Our wrath. Say: \"Have you any knowledge (proof) that you can produce before us Verily, you follow the Zann and you do nothing but lie.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are polytheists will say: If Allah had pleased we would not have associated (aught with Him) nor our fathers, nor would we have forbidden (to ourselves) anything; even so did those before them reject until they tasted Our punishment. Say: Have you any knowledge with you so you should bring it forth to us? You only follow a conjecture and you only tell lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The idolaters will say, 'Had God willed, we would not have been idolaters, neither our fathers, nor would we have forbidden aught.' Even so the people before them cried lies until they tasted Our might. Say: 'Have you any knowledge, for you to bring forth for us? You follow only surmise, merely conjecturing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They who are idolaters will say: Had Allah willed, we had not ascribed (unto Him) partners neither had our fathers, nor had we forbidden aught. Thus did those who were before them give the lie (to Allah's messengers) till they tasted of the fear of Us. Say: Have ye any knowledge that ye can adduce for Us? Lo! ye follow naught but an opinion, Lo! ye do but guess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who associate partners with God will surely say, \"Had God pleased, neither we nor our fathers would have served other gods besides Him; nor would we have made anything unlawful.\" Likewise those who lived before them argued falsely until they came to taste Our punishment! Say, \"Have you any knowledge? If so, produce it before us. You follow nothing but conjecture. You are merely guessing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Anon will those who associate had God willed, we would not say: have associated, nor our fathers; neither could we have forbidden aught. Even so belied those before them, until they tasted Our wrath. Say thou: is there with you any authority, that ye may bring unto us? ye but follow your fancy, and only conjecture.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The polytheists will say, ‘Had Allah wished we would not have ascribed any partner [to Him], nor our fathers, nor would we have forbidden anything.’ Those who were before them had denied likewise until they tasted Our punishment. Say, ‘Do you have any [revealed] knowledge that you can produce before us? You follow nothing but conjectures, and you do nothing but surmise.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who give partners (to Allah) will say: \"If Allah had wished, we should not have given partners to Him nor would our fathers; nor should we have had any taboos.\" So did their ancestors argue falsely, until they tasted of Our wrath. Say: \"Have ye any (certain) knowledge? If so, produce it before us. Ye follow nothing but conjecture: ye do nothing but lie.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who took partners (in worship) with Allah will say: \"If Allah had willed, we would not have taken partners (in worship) with Him, nor would our fathers, and we would not have forbidden anything (against His Will).\" Likewise belied those who were before them, (they argued falsely with Allah's Messengers), till they tasted of Our Wrath. Say: \"Have you any knowledge (proof) that you can produce before us? Verily, you follow nothing but guess and you do nothing but lie.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The idolaters will say: 'Had Allah willed, neither we nor our fathers would have associated (idols), nor would we have forbidden anything. As such, those who have gone before them belied until they tasted Our Might. Say: 'Have you any knowledge you can bring forth to us? You follow nothing but guessing and you are only speakers of conjecture'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The polytheists will say, “Had God willed, we would not have practiced idolatry, nor would have our forefathers, nor would we have prohibited anything.” Likewise those before them lied, until they tasted Our might. Say, “Do you have any knowledge that you can produce for us? You follow nothing but conjecture, and you only guess.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who associated with Allah will say, \"If Allah had willed, we would not have associated [anything] and neither would our fathers, nor would we have prohibited anything.\" Likewise did those before deny until they tasted Our punishment. Say, \"Do you have any knowledge that you can produce for us? You follow not except assumption, and you are not but falsifying.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:148] The idolaters will say, ‘Had God willed, we would not have been idolaters, neither, we [nor], our fathers, nor would we have forbidden anything’, in other words, our idolatry and our forbidding [of things] are by His will, and so He must be satisfied with it. God, exalted be He, says: So, in the same way that these have lied, those who were before them gave the lie, to their prophets, until they tasted Our might, Our chastisement. Say: ‘Have you any knowledge, that God is satisfied with this, such that you can adduce for us?, that is, you have no such knowledge. You follow only supposition, in this [matter], merely guessing’, telling lies therein.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They who are idolaters will say: Had Allah willed, we had not ascribed (unto Him) partners neither had our fathers nor had we forbidden aught) of crops and cattle, but this has been commanded and forbidden for us. (Thus) just as did your people give the lie (did those who were before them give the lie) to their messengers (till they tasted of the fear of Us) Our torment. (Say) Muhammad: (Have ye any knowledge) any clarification regarding what you describe as unlawful (that ye can adduce for us? Lo! ye follow naught but an opinion) your prohibition of crops and cattle is nothing but surmise. (Lo! Ye do but guess) you just lie.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ سَيَقُولُ ٱلَّذِينَ أَشْرَكُواْ } على سبيل التكذيب والإنكار فيما جئت به: و { لَوْ شَآءَ ٱللَّهُ } ما أنت ترويه عنه وتدعيه بالنسبة إلينا { مَآ أَشْرَكْنَا } مع أنه القادر على جميع ما أراد { وَلاَ } أشرك { آبَاؤُنَا } أيضاً { وَلاَ حَرَّمْنَا مِن شَيْءٍ } مما أجزت تحريمه عنه بالنسبة إلينا بل ما هي إلا مفتريات تخترعه من عندك { كَذٰلِكَ } مثل تكذيبهم لك بأمثال هذه الهذيانات الباطلة { كَذَّبَ ٱلَّذِينَ } مضوا { مِن قَبْلِهِم } أنبياءهم { حَتَّىٰ ذَاقُواْ بَأْسَنَا } الذي أنزلنا عليهم واستأصلناهم بتكذيبهم، وإن أردت إلزامهم وتبكيتهم { قُلْ } لهم مستفهماً: { هَلْ } حصل { عِندَكُم مِّنْ عِلْمٍ } نقل صريح وحجة واضحة موردة من عند الله { فَتُخْرِجُوهُ لَنَآ } وتظهروه حتى نتبعه، ونقبله؟ فإن لم يخرجوا فقل لهم: { إِن تَتَّبِعُونَ } أي: ما تتبعون { إِلاَّ ٱلظَّنَّ } الذي لا يغني من الحق شيئاً { وَإِنْ أَنتُمْ إَلاَّ تَخْرُصُونَ } [الأنعام: 148] تكذبون على الله افتراء ومراء، فأعرض عنهم ودع مجادلتهم ومخاطبتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:20",
      "similarity": 0.7469079895642525
    },
    {
      "verse": "6:116",
      "similarity": 0.7436835126203188
    },
    {
      "verse": "10:66",
      "similarity": 0.742393386931728
    },
    {
      "verse": "51:10",
      "similarity": 0.7143171972490785
    },
    {
      "verse": "16:35",
      "similarity": 0.28197172327335723
    }
  ]
}