{
  "chapter": "الأنعام",
  "text": "ومن الابل اثنين ومن البقر اثنين قل ءالذكرين حرم ام الانثيين اما اشتملت عليه ارحام الانثيين ام كنتم شهداء اذ وصىكم الله بهذا فمن اظلم ممن افترى على الله كذبا ليضل الناس بغير علم ان الله لا يهدى القوم الظلمين",
  "translations": [
    {
      "translation": "And a pair of camels and a pair of cattle - Say: 'Is it the two males He has made haram, or the two females, or what the wombs of the two females contain? Were you then witnesses when Allah gave you this instruction?' Who could do greater wrong than someone who invents lies against Allah thus leading people astray without any knowledge? Allah does not guide the people of the wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there are two of camels and two of oxen. Ask them: \"Which has He forbidden, the two males or the two females, or what the females carry in their wombs?\" Were you present at the time God issued this command?\" Who then could be more wicked than he who fabricates a lie and ascribes it to God to mislead men, without any knowledge? God does not guide the miscreants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And likewise, of camels there are two, and of oxen there are two. Ask them: 'Is it either the two males that He has forbidden or the two females, or that which the wombs of the two females may contain? Or were you present when Allah enjoined this commandment upon you?' Who, then, would be more unjust than he who fabricates a lie against Allah that he might lead people astray without knowledge. Surely Allah never guides such a wrong-doing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of the two pairs of camels and cows, are the males unlawful (to eat) or the females or that which exists in the wombs of the females? Were you present when God commanded you to do this? Who are more unjust than those who ascribe falsehood to God and out of ignorance make others go astray? God does not guide the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And a pair of camels and a pair of oxen”; say, “Has He forbidden the two males or the two females, or what the two females carry in their wombs? Were you present when Allah commanded this to you?” So who is more unjust than one who fabricates a lie against Allah in order to lead mankind astray with his ignorance? Indeed Allah does not guide the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the camels two, and of oxen two. Say: \"Has He forbidden the two males or the two females or (the young) which the wombs of the two females enclose Or were you present when Allah ordered you such a thing Then who does more wrong than one who invents a lie against Allah, to lead mankind astray without knowledge. Certainly Allah guides not the people who are wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And two of camels and two of cows. Say: Has He forbidden the two males or the two females or that which the wombs of the two females contain? Or were you witnesses when Allah enjoined you this? Who, then, is more unjust than he who forges a lie against Allah that he should lead astray men without knowledge? Surely Allah does not guide the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of camels two, of oxen two. Say: 'Is it the two males He has forbidden or the two females? Or what the wombs of the two females contain? Or were you witnesses when God charged you with this? Then who does greater evil than he who forges against God a lie, in order that he may lead mankind astray without any knowledge? Surely God guides not the people of the evildoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the camels twain and of the oxen twain. Say: Hath He forbidden the two males or the two females, or that which the wombs of the two females contain; or were ye by to witness when Allah commanded you (all) this? Then who doth greater wrong than he who deviseth a lie concerning Allah, that he may lead mankind astray without knowledge. Lo! Allah guideth not wrongdoing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Again, of the camels there are two, and of the oxen two. Ask them, \"Is it the two males He has forbidden, or the two females or what the wombs of the two females contain? Were you present when God enjoined this on you?\" Who is more unjust than one who, without knowledge, fabricates a lie against God, so that he may lead people astray without knowledge? Surely, God does not guide the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the camels He hath created a twain and of the oxen a twain. Say thou: is it the two males He hath forbidden or the two females, or that which the wombs of the two females contain? Were ye present when Allah enjoined this on you? Who then doth greater wrong than he who fabricateth a lie against Allah that he may lead people astray; verily Allah shall not guide a wrong-doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And two of camels and two of oxen. Say, ‘Is it the two males that He has forbidden or the two females, or what is contained in the wombs of the two females? Were you witnesses when Allah enjoined this upon you?’ So who is a greater wrongdoer than him who fabricates a lie against Allah to mislead the people without any knowledge? Indeed Allah does not guide the wrongdoing lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of camels a pair, and oxen a pair; say, hath He forbidden the two males, or the two females, or (the young) which the wombs of the two females enclose? - Were ye present when Allah ordered you such a thing? But who doth more wrong than one who invents a lie against Allah, to lead astray men without knowledge? For Allah guideth not people who do wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the camels two (male and female), and of oxen two (male and female). Say: \"Has He forbidden the two males or the two females or (the young) which the wombs of the two females enclose? Or were you present when Allah ordered you such a thing? Then who does more wrong than one who invents a lie against Allah, to lead mankind astray without knowledge. Certainly Allah guides not the people who are Zalimun (polytheists and wrong-doers, etc.).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then a pair of camels and a pair of cattle. Say: 'Of these, has He forbidden you the males, the females, or what the wombs of the two females contain? Were you witnesses when Allah charged you with this? Who is more harmful than he who, without knowledge, invents a lie about Allah to mislead people? Allah does not guide the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And two of the camels, and two of the cattle. Say, “Did He forbid the two males, or the two females, or what the wombs of the two females contain? Were you present when God enjoined this upon you?” Who does greater wrong than he who invents lies and attributes them to God, in order to mislead people without knowledge? God does not guide the wicked people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the camels, two and of the cattle, two. Say, \"Is it the two males He has forbidden or the two females or that which the wombs of the two females contain? Or were you witnesses when Allah charged you with this? Then who is more unjust than one who invents a lie about Allah to mislead the people by [something] other than knowledge? Indeed, Allah does not guide the wrongdoing people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:144] And of the camels two and of the oxen two. Say: ‘Is it the two males He has forbidden or the two females? Or what the wombs of the two females contain? Or were you witnesses, present, when God charged you with this?, prohibition, such that you use it to support your claims? Nay! You speak lies in this [matter]. Then who, that is, none, does greater evil than he who invents a lie against God, in this matter, that he may lead mankind astray without any knowledge? Truly God does not guide evildoing folk’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "152 (And of the camels) and He created of the camels (twain) male and female (and of the oxen twain) male and female. (Say) Muhammad, to Malik: (Hath He forbidden the two males or the two females) is the prohibition of the Bahirah and Wasilah because of the fluids of the two males or those of the two females, (or that which the wombs of the two females contain) before copulation? Another way of understanding this is as follows: is this prohibited because what is delivered is male or because it is female? (or were ye by to witness when Allah commanded you (all) this) all that you claim? (Then who doth greater wrong) who is more insolent and bolder vis-a-vis Allah (than he who deviseth) invents (a lie concerning Allah, that he may lead mankind astray) from Allah's religion and obedience (without knowledge) from Allah. (Lo! Allah guideth not) does not direct to His religion and proof (wrong-doing folk) the idolaters, meaning: Malik Ibn 'Awf.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً أباح لكم ربكم أيها المؤمنون { مِنَ ٱلإِبْلِ ٱثْنَيْنِ وَمِنَ ٱلْبَقَرِ ٱثْنَيْنِ قُلْ ءَآلذَّكَرَيْنِ حَرَّمَ أَمِ ٱلأُنْثَيَيْنِ أَمَّا ٱشْتَمَلَتْ عَلَيْهِ أَرْحَامُ ٱلأُنْثَيَيْنِ } يعني: لم يحرم أيضاً شيئاً منهما ولا ما في بطنهما ذكراً كان أو أنثى { أَمْ } تدعون أيها المدعون أنكم { كُنتُمْ شُهَدَآءَ } حضراء { إِذْ وَصَّٰكُمُ ٱللَّهُ } أي: حين وصاكم الله { بِهَـٰذَا } التحريم\n لأنه ما أخبر به نبي وما جاء به كتاب\n فبقي أن تدعوا الحضور عنده سبحانه وأنتم أيها المفترون من المردودين المطرودين عن ساحة عز حضوره سبحانه\n وما من الأمر تسويلات نفوسكم وتلبيسات شياطين أوهامكم وخيالاتكم تفترونه على الله ظلماً وزوراً { فَمَنْ أَظْلَمُ مِمَّنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ كَذِباً لِيُضِلَّ ٱلنَّاسَ } عن طريق الحق { بِغَيْرِ عِلْمٍ } نص ونقل وارد نازل من عند الله بل من تلقاء نفسه تلبيساً وتخليطاً لضعفاء العوام { إِنَّ ٱللَّهَ } المطلع بمخايل المفسدين { لاَ يَهْدِي } إلى طريق صراط توحيده { ٱلْقَوْمَ ٱلظَّٰلِمِينَ } [الأنعام: 144] المفترين عليه بأمثال هذه المفتريات الزائغة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومن الإبل اثنين } ذكر وأنثى\n { ومن البقر اثنين } كذلك\n { قل آلذكرين حرَّم أم الأُنثيين } أم حرم ما { اشتملت عليه أرحام الأُنثيين } من الجنين مطلقًا؟ وهذا تقسيم على الكفار حتى يتبين كذبهم على الله\n وتوبيخ لهم\n حيث حرموا بعض الذكور مرة وبعض الأناث مرة\n فألزمهم تحريم جميع الذكور\n إن كان علة التحريم وصف الذكورة\n أو تحريم جميع الإناث\n إن كانت العلة الأنوثة\n أو تحريم الجميع إن كان المُحرم ما اشتملت عليه الأرحام\n ولا وجه للتخصيص\n فالاستفهام للإنكار\n وأكده بقوله: { أم كنتم شهداء } حاضرين حين { وصّاكم الله بهذا } التحريم\n ولا طريق لكم إلى معرفة هذا إلا المشاهدة والسماع\n وليس لكم شيء من ذلك\n وإنما أنتم مفترون على الله\n { فمن أظلم ممن افترى على الله كذبًا } فنسب إليه تحريم ما لم يحرم\n والمراد: كبراؤهم الأوائل كعمرو بن لحي وأمثاله\n أي: لا أحد أظلم ممن كذب على الله\n { ليُضل الناس بغير علم إن الله لا يهدي القوم الظالمين } إلى مراشدهم\n أو إلى ما ينفعهم\n الإشارة: ومن الأحوال ما تحمل صاحبها إلى مقام الحرية\n بشهود الربوبية\n فيغلب عليه العز والاستظهار\n ومنها ما تحمله إلى مقام العبودية\n فيغلب عليه الذل والإنكسار\n وإليه الإشارة بقوله: { حمولة وفرشًا } \n فليتمتع المريد بما يظهر عليه منهما\n ولا يتبع خطوات الشيطان فيتعدى طوره\n ولا يعرف قدره\n وهذه الأحوال ثمانية أنواع: أربعة سفلية تناسب العبودية\n وأربعة علوية تناسب الربوبية\n فالإربعة السفلية: الذل\n والفقر\n والعجز والضعف\n والأربع العلوية: العز\n والغنى\n والقدرة\n والقوة\n فمن أراد التعلق بهذه الأوصاف فليناد من كوة الذل: يا عزيز من للذليل سواك؟\n ومن كوة الفقر: يا غني من للفقير سواك؟\n ومن كوة العجز: يا قدير من للعاجز سواك؟ ومن كوة الضعف: يا قوي من للضعيف سواك؟\n ير الإجابة طوع يديه\n ومن أراد التحقيق بها\n فليتحقق بذله يمده بعزه\n وليتحقق بفقره يمده بغناه\n وليتحقق بعجزه يمده بقدرته\n وليتحقق بضعفه يمده بقوته\n \" تحقق بوصفك يمدك بوصفه \"\n وبالله التوفيق\n ثم بيَّن ما حرم عليهم ليقفوا عنده\n فقال: { قُل لاَّ أَجِدُ فِي مَآ أُوْحِيَ إِلَيَّ مُحَرَّماً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "88:17",
      "similarity": 0.597092864323093
    },
    {
      "verse": "105:3",
      "similarity": 0.5850665428233558
    },
    {
      "verse": "2:70",
      "similarity": 0.23629982126328386
    },
    {
      "verse": "2:67",
      "similarity": 0.21382598592361637
    },
    {
      "verse": "56:41",
      "similarity": 0.21182164749138255
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/6:144.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/6:144.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/6:144.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}