{
  "chapter": "الأنعام",
  "text": "قد خسر الذين قتلوا۟ اولدهم سفهۢا بغير علم وحرموا۟ ما رزقهم الله افتراء على الله قد ضلوا۟ وما كانوا۟ مهتدين",
  "translations": [
    {
      "translation": "They will surely perish who kill their offspring in ignorance foolhardily, and forbid the food that God has given them by fabricating lies against God. Misguided are they surely, and will never come to guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who slayed their children in folly, without knowledge,. and forbade the sustenance that Allah has provided them, falsely ascribing that to Allah, are utter losers; they have gone astray, and are certainly not among those guided to the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who foolishly and ignorantly murdered their children, ascribed falsehood to God and made unlawful what He had given to them for their sustenance, have certainly lost much. They had gone far away from the right guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed ruined are those who slay their children out of senseless ignorance and forbid the sustenance which Allah has bestowed upon them, in order to fabricate lies against Allah; they have undoubtedly gone astray and not attained the path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed lost are they who have killed their children, foolishly, without knowledge, and (they) have forbidden that which Allah has provided for them, inventing a lie against Allah. They have indeed gone astray and were not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are lost indeed who kill their children foolishly without knowledge, and forbid what Allah has given to them forging a lie against Allah; they have indeed gone astray, and they are not the followers of the right course.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Losers are they who slay their children in folly, without knowledge, and have forbidden what God has provided them, forging against God; they have gone astray, and are not right-guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are losers who besottedly have slain their children without knowledge, and have forbidden that which Allah bestowed upon them, inventing a lie against Allah. They indeed have gone astray and are not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Losers indeed are they who kill their children foolishly and without knowledge and declare as forbidden what God has provided for them as sustenance -- a fabrication against God: they have gone astray and have not chosen to be rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely lost are they who slay their offspring foolishly and without knowledge, and have forbidden that which Allah had provided for them: a fabrication against Allah: surely they have strayed and have not become guided ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are certainly losers who slay their children foolishly without knowledge, and forbid what Allah has provided them, fabricating a lie against Allah. Certainly, they have gone astray and are not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lost are those who slay their children, from folly, without knowledge, and forbid food which Allah hath provided for them, inventing (lies) against Allah. They have indeed gone astray and heeded no guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed lost are they who have killed their children, from folly, without knowledge, and have forbidden that which Allah has provided for them, inventing a lie against Allah. They have indeed gone astray and were not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lost are those who, without knowledge, have foolishly slain their own children and made unlawful that which Allah has provided them, fabricating lies about Allah. They have gone astray and are not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lost are those who kill their children foolishly, with no basis in knowledge, and forbid what God has provided for them—innovations about God. They have gone astray. They are not guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those will have lost who killed their children in foolishness without knowledge and prohibited what Allah had provided for them, inventing untruth about Allah. They have gone astray and were not [rightly] guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:140] They are losers who slay (read qatalū or qattalū) their children, by burying them alive, in folly, out of ignorance, without knowledge, and have forbidden what God has provided them, of what has been mentioned, in calumny against God. Verily they have gone astray and are not guided.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They are losers who besottedly) out of ignorance (have slain their children) have buried their daughters alive (without knowledge) this was revealed about Rabi'ah and Mudar, two leaders of Arab clans buried their daughters alive in the pre-Islamic period, except for the the Banu Kinanah who did not engage in such a practice, (and have forbidden) for women (that which Allah bestowed upon them) that which Allah has made lawful for them of cattle and crops, (inventing a lie against Allah. They indeed have gone astray) they are in error about what they say (and are not guided) to the guidance and right in that which they ascribe unlawfulness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَدْ خَسِرَ } وخاب خيبة مؤبدة الأعراب { ٱلَّذِينَ قَتَلُوۤاْ أَوْلَٰدَهُمْ سَفَهاً } مخالفة سبي وإملاق { بِغَيْرِ عِلْمٍ } منهم بما يؤول أمرهم عليه، ولا شك أن الرازق لعباده هو الله لا هم { وَ } أيضاً { حَرَّمُواْ } على نفوسهم { مَا رَزَقَهُمُ ٱللَّهُ } وأباح عليهم ن البحائر والسوائب وغيرها ونسبوا تحريمها { ٱفْتِرَآءً عَلَى ٱللَّهِ } هوى وميلاً إلى الباطل، وبالجملة: { قَدْ ضَلُّواْ } بهذه الجرائم عن طريق الحق { وَمَا كَانُواْ مُهْتَدِينَ } [الأنعام: 140] إلى توحيده وما يرجى منهم الهداية والفلاح أصلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}