{
  "chapter": "الأنعام",
  "text": "ومن الانعم حمولة وفرشا كلوا۟ مما رزقكم الله ولا تتبعوا۟ خطوت الشيطن انه لكم عدو مبين",
  "translations": [
    {
      "translation": "And also animals for riding and for haulage and animals for slaughtering and for wool. Eat what Allah has provided for you and do not follow in the footsteps of Shaytan. He is an outright enemy to you.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has created beasts of burden and cattle for slaughter. So eat of what God has given you for food, and do not walk in the footsteps of Satan who is surely your declared enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the cattle (He has reared) some for burden, and some whose flesh you eat and whose skins and hair you use to spread the ground. Eat of the sustenance Allah has provided you and do not follow in the footsteps of Satan, for surely he is your open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has created animals, both small and large. Eat from what God has given you for your sustenance and do not follow in the footsteps of Satan. He is your sworn enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And from the cattle, some for burdens, some spread on the earth; eat of the sustenance which Allah has bestowed upon you, and do not follow the footsteps of the devil; undoubtedly he is your open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the cattle (are some) for burden and (some smaller) for Farsh. Eat of what Allah has provided for you, and follow not the footsteps of Shaytan. Surely, he is to you an open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of cattle (He created) beasts of burden and those which are fit for slaughter only; eat of what Allah has given you and do not follow the footsteps of the Shaitan; surely he is your open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the cattle, for burthen and for slaughter, eat of what God has provided you; and follow not the steps of Satan; he is a manifest foe to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the cattle (He produceth) some for burdens, some for food. Eat of that which Allah hath bestowed upon you, and follow not the footsteps of the devil, for lo! he is an open foe to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of the cattle there are some for carrying burdens and some for food. Eat what God has provided for you and do not follow in Satan's footsteps, for he is a declared enemy of yours.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the cattle He hath created beasts of burden and small ones. Eat of that which Allah hath provided for you; and follow not the foot-steps of the Satan; verily he is unto you a manifest foe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of the cattle [some] are for burden and [some] for slaughter. Eat of what Allah has provided you and do not follow in Satan’s footsteps; he is indeed your manifest enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of the cattle are some for burden and some for meat: eat what Allah hath provided for you, and follow not the footsteps of Satan: for he is to you and avowed enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the cattle (are some) for burden (like camels etc.) and (some are) small (unable to carry burden like sheep, goats etc. for food, meat, milk, wool etc.). Eat of what Allah has provided for you, and follow not the footsteps of Shaitan (Satan). Surely he is to you an open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the cattle, some are for carrying burdens, and others for slaughter. Eat of that which Allah has provided you with and do not follow in satan's footsteps; he is your open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among the livestock are some for transportation, and some for clothing. Eat of what God has provided for you, and do not follow the footsteps of Satan. He is to you an outright enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of the grazing livestock are carriers [of burdens] and those [too] small. Eat of what Allah has provided for you and do not follow the footsteps of Satan. Indeed, he is to you a clear enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:142] And, He produces, of the cattle some for burden, fit to bear loads, such as the large [mature] camels, and some for light support, not fit for these [load-bearing tasks], such as young camels or sheep (such [cattle] are called farsh because they are like ‘bedding [farsh] spread on the ground’, on account of their [physical] closeness to it); eat of that which God has provided you and do not follow the steps of Satan, his methods of forbidding [things] or deeming [them] lawful. Surely he is a manifest foe to you, one whose enmity is evident.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And of the cattle) He creates of the cattle (some for burdens) like camels and oxen, (some for food) and some not for burdens such as sheep and young camels. (Eat of that which Allah hath bestowed upon you) of crops and cattle, (and follow not the footsteps of the devil) what the devil has made seem fair by forbidding some crops and cattle, (for lo! he is an open foe to you) whose enmity is quite manifest, for he commands you to forbid some crops and cattle.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { حَمُولَةً وَفَرْشاً } فالحَمولةُ: الكِبارُ مِن الإِبلِ والفَرشُ: الصِغار\n ويقالُ الفَرشُ: الغَنمُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah: { } The burden: the camel and the bedding: the young.\n\n\nThe term \"farasha\" refers to a type of camel.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } إنشاء لكم أيضاً { مِنَ ٱلأَنْعَٰمِ حَمُولَةً } تحملون أثقالكم يوم ظعنكم { وَفَرْشاً } تفرشون من أصوافها وأشعارها وأوبارها المنسوجة تحتكم يوم إقامتكم { كُلُواْ مِمَّا رَزَقَكُمُ ٱللَّهُ } وأباحه عليكم منها { وَلاَ تَتَّبِعُواْ } أثر { خُطُوَٰتِ ٱلشَّيْطَٰنِ } ولا تسمعوا وساوسه في تحليل المحرمات وتحريم المباحات\n يعني: لا تتبعوا أهويتكم التي هي من جنود الشياطين { إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ } [الأنعام: 142] ظاهر العداوة فاجتنبوا من إغوائها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { حَمولة وفرشًا }: عطف على جنات",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:168",
      "similarity": 0.6927184121818529
    },
    {
      "verse": "2:208",
      "similarity": 0.6451542429730152
    },
    {
      "verse": "24:21",
      "similarity": 0.5626590120406907
    },
    {
      "verse": "56:34",
      "similarity": 0.4764883740763082
    },
    {
      "verse": "51:48",
      "similarity": 0.4701316132456591
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/6:142.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/6:142.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:142.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}