{
  "chapter": "الأنعام",
  "text": "قل فلله الحجة البلغة فلو شاء لهدىكم اجمعين",
  "translations": [
    {
      "translation": "Say: 'Allah's is the conclusive argument. If He had willed He could have guided every one of you.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"To God belongs the consummate argument. Had He willed He would surely have guided all of you aright.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then say to them: '(As against your argument) Allah's is the conclusive argument. Surely, had He willed, He would have guided you all to the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Final authority belongs only to God. Had He wanted, He would have given you all guidance\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Then only Allah’s argument is the complete one; so had He willed, He would have guided you all.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"With Allah is the perfect proof and argument; had He so willed, He would indeed have guided you all.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Then Allah's is the conclusive argument; so if He please, He would certainly guide you all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'To God belongs the argument conclusive; for had He willed, He would have guided you all.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say - For Allah's is the final argument - Had He willed He could indeed have guided all of you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"God alone has the conclusive proof. If He had willed, He could have guided every one of you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: with Allah resteth the argument evident. Wherefore, had He so willed, He would have guided you all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘To Allah belongs the conclusive argument. Had He wished, He would have surely guided you all.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"With Allah is the argument that reaches home: if it had been His will, He could indeed have guided you all.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"With Allah is the perfect proof and argument, (i.e. the Oneness of Allah, the sending of His Messengers and His Holy Books, etc. to mankind), had He so willed, He would indeed have guided you all.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Allah alone has the conclusive proof. Had He willed, He would have guided you all'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “To God belongs the conclusive argument. Had He willed, He would have guided you all.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"With Allah is the far-reaching argument. If He had willed, He would have guided you all.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:149]   Say, if you have no definitive argument, then: ‘To God belongs the conclusive argument, the perfect [one], for had He willed, to guide you, He could have guided all of you’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجواب عن قولهم : { لو شاء الله ما أشرَكْنا ولا آباؤنا } \\[ الأنعام : 148 \\] تكملة للجواب السّابق لأنَّه زيادة في إبطال قولهم ، وهو يشبه المعارضة في اصطلاح أهل الجدل .وأعيد فعل الأمر بالقول لاسترعاء الأسماع لِما سيرد بعد فعل : { قل } وقد كرّر ثلاث مرات متعاقبة بدون عطف ، والنكتة ما تقدم من كون القول جارياً على طريقة المقاولة .والفاء فصيحة تؤذن بكلام مقدّر هو شرط ، والتّقدير : فإن كان قولكم لمجرّد اتّباع الظنّ والخرص وسوء التّأويل فللّه الحجّة البالغة . وتقديم المجرور على المبتدأ لإفادة الاختصاص ، أي : لله لا لكم ، ففهم منه أنّ حجتّهم داحضة .والحجّة : الأمر الذي يدلّ على صدق أحد في دعواه وعلى مصادفة المستدلّ وجه الحقّ ، وتقدّم القول فيها عند قوله تعالى : { لئلا يكون للنّاس عليكم حجّة } في سورة البقرة ( 150 ).والبالغة هي الواصلة : أي الواصلة إلى ما قُصدت لأجله ، وهو غَلَب الخصم ، وإبطالُ حجّته ، كقوله تعالى : { حِكْمة بالغة } \\[ القمر : 5 \\] ، فالبلوغ استعارة مشهورة لحصول المقصود من الشّيء فلا حاجة إلى إجراء استعارة مكنيّة في الحجّة بأن تشبّه بسائر إلى غاية ، وقرينتها إثباتُ البلوغ ، ولا حاجة أيضاً إلى جعل إسناد البلوغ إلى الحجّة مجازاً عقلياً ، أي بالغاً صاحبُها قَصْدَه ، لأنَّه لا محيصّ من اعتبار الاستعارة في معنى البلوغ ، فالتّفسير به من أوّل وهلة أولى ، والمعنى : لله الحجّة الغالبة لكم ، أي وليس استدلالُكم بحجّة .والفاء في قوله : { فلو شاء } فاء التّفريع على ظهور حجّة الله تعالى عليهم : تفرع على بطلان استدلالهم أنّ الله لو شاء لهداهم ، أي لو شاء هدايتهم بأكثر من إرسال الرّسول عليه الصّلاة والسّلام بأن يغيّر عقولهم فتأتيَ على خلاف ما هُيِّئتْ له لَكَان قد فعل ذلك بوجه عناية خاصّة بهم أو خارق عادة لأجلهم ، إذ لا يعجزه شيء ، ولكن حكمته قضت أن لا يعمّم عنايته بل يختصّ بها بعض خاصّته ، وأن لا يعدل عن سنّته في الهداية بوضع العقول وتنبيهها إلى الحقّ بإرسال الرّسل ونصب الأدلّة والدّعاء إلى سبيله بالحكمة والموعظة ، فالمشيئة المقصودة في قوله : فلو شاء لهداكم غير المشيئة المقصودة فيما حكى الله عنهم من قولهم : { لو شاء الله ما أشركنا } \\[ الأنعام : 148 \\] وإلاّ لكان ما أُنكر عليهم قد أثبت نظيره عقب الإنكار فتتناقض المُحَاجَّة ، لأنّ الهداية تساوي عدم الإشراك وعدمَ التحريم ، فلا يصدُق جعل كليهما جواباً للَوْ الامتناعيّة ، فالمشيئة المقصودة في الردّ عليهم هي المشيئة الخفيّة المحجوبة ، وهي مشيئة التّكوين ، والمشيئة المنكرة عليهم هي ما أرادوه من الاستدلال بالواقع على الرّضى والمحبّة . هذا وجه تفسير هذه الآية التي كلَّلها من الإيجاز ما شتَّت أفهاماً كثيرة في وجه تفسيرها لا يَخفى بُعدها عن مُطالع التّفاسير والموازنةُ بينها وبين ما هنا .\n\n",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad, if you do not have an argument for your claim, then (For Allah's is the final argument) the most firm argument. (Had He willed He could indeed have guided all of you) to His religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل بدما ألزموا وأفحموا: { فَلِلَّهِ ٱلْحُجَّةُ } البينة الواضحة { ٱلْبَالِغَةُ } حد الكمال { فَلَوْ شَآءَ } هدايتكم { لَهَدَاكُمْ أَجْمَعِينَ } [الأنعام: 149] أي: لأوضح حجته عليكم ووفقكم إلى قبوله\n ولكن لم تتعلق مشيئته على هدايتكم لذلك أصررتم واستكبرتم\n وإذا لم ينتبهوا بعد إلقاء حجة الله عليهم بل أصروا على تقليد أحبارهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:66",
      "similarity": 0.5996439651348885
    },
    {
      "verse": "3:20",
      "similarity": 0.5825357443970636
    },
    {
      "verse": "2:139",
      "similarity": 0.5184061924716468
    },
    {
      "verse": "4:165",
      "similarity": 0.5043720685263477
    },
    {
      "verse": "45:25",
      "similarity": 0.48736904370781914
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006149.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006149.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:149.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}