{
  "chapter": "الأنعام",
  "text": "وهو الذى انشا جنت معروشت وغير معروشت والنخل والزرع مختلفا اكله والزيتون والرمان متشبها وغير متشبه كلوا۟ من ثمره اذا اثمر وءاتوا۟ حقه يوم حصاده ولا تسرفوا۟ انه لا يحب المسرفين",
  "translations": [
    {
      "translation": "It is He who produces gardens, both cultivated and wild, and palm-trees and crops of diverse kinds, and olives and pomegranates, both similar and dissimilar. Eat of their fruits when they bear fruit and pay their due on the day of their harvest, and do not be profligate. He does not love the profligate.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who grew the gardens, trellised and bowered, and palm trees and land sown with corn and many other seeds, and olives and pomegranates, alike and yet unlike. So eat of their fruit when they are in fruit, and give on the day of harvesting His due, and do not be extravagant, for God does not love those who are prodigal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has brought into being gardens - the trellised and untrellised - and the palm trees, and crops, all varying in taste, and. the olive and pomegranates, all resembling one another and yet so different. Eat of their fruits when they come to fruition and pay His due on the day of harvesting. And do not exceed the proper limits, for He does not love those who exceed the proper limits.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has created all kinds of gardens, those raised on trellises and those without, palm-trees and the crops of different seasons, and olives and pomegranates of all types. You may eat their fruits that they produce but pay God's share on the harvest day. Do not be excessive for God does not love those who are excessive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who produces gardens spread on the ground and above, and the date-palm, and crops of various flavours, and the olive and the pomegranate, similar in some respects and unlike in others; eat from its fruit when it bears yield, and pay the due (obligatory charity) from it on the day it is harvested; and do not be wasteful; indeed the wasteful are not liked by Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who produces gardens Ma`rushat and not Ma`rushat, and date palms, and crops of different shape and taste, and olives, and pomegranates, similar, and different. Eat of their fruit when they ripen, but pay the due thereof on the day of their harvest, and waste not by extravagance. Verily, He likes not the wasteful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who produces gardens (of vine), trellised and untrellised, and palms and seed-produce of which the fruits are of various sorts, and olives and pomegranates, like and unlike; eat of its fruit when it bears fruit, and pay the due of it on the day of its reaping, and do not act extravagantly; surely He does not love the extravagant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who produces gardens trellised, and untrellised, palm-trees, and crops diverse in produce, olives, pomegranates, like each to each, and each unlike to each. Eat of their fruits when they fructify, and pay the due thereof on the day of its harvest; and be not prodigal; God loves not the prodigal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who produceth gardens trellised and untrellised, and the date-palm, and crops of divers flavour, and the olive and the pomegranate, like and unlike. Eat ye of the fruit thereof when it fruiteth, and pay the due thereof upon the harvest day, and be not prodigal. Lo! Allah loveth not the prodigals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has produced gardens, both trellised and untrellised, and date palms and field crops, all varying in taste, and the olive and the pomegranate, both similar and dissimilar. Eat their fruits when they bear fruit and give away what is due of them on the day of their harvest. Do not waste anything. He does not love the wasteful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who hath produced gardens, trellised and untrellised, and the date-palm and the corn of varied produce, and the olives and the pomegranates alike and unlike. Eat of the fruit thereof when it fruiteth, and give the due thereof on the day of its harvesting; and waste not; verily He approveth not the wasters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who produces gardens trellised and without trellises, and palm-trees and crops of diverse produce, olives and pomegranates, similar and dissimilar. Eat of its fruits when it fructifies, and give its due on the day of harvest, and do not be wasteful; indeed, He does not like the wasteful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who produceth gardens, with trellises and without, and dates, and tilth with produce of all kinds, and olives and pomegranates, similar (in kind) and different (in variety): eat of their fruit in their season, but render the dues that are proper on the day that the harvest is gathered. But waste not by excess: for Allah loveth not the wasters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who produces gardens trellised and untrellised, and date-palms, and crops of different shape and taste (its fruits and its seeds) and olives, and pomegranates, similar (in kind) and different (in taste). Eat of their fruit when they ripen, but pay the due thereof (its Zakat, according to Allah's Orders 1/10th or 1/20th) on the day of its harvest, and waste not by extravagance. Verily, He likes not Al-Musrifun (those who waste by extravagance),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He brings forth gardens, trellised and untrellised, palmtrees and crops, different to eat, and the olive and pomegranates alike and unlike. When it bears fruit eat of it and pay what is due (the zakat) of it upon the harvest day. But do not be wasteful; He does not love the wasteful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who produces gardens, both cultivated and wild, and date-palms, and crops of diverse tastes, and olives and pomegranates, similar and dissimilar. Eat of its fruit when it yields, and give its due on the day of its harvest, and do not waste. He does not love the wasteful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is who causes gardens to grow, [both] trellised and untrellised, and palm trees and crops of different [kinds of] food and olives and pomegranates, similar and dissimilar. Eat of [each of] its fruit when it yields and give its due [zakah] on the day of its harvest. And be not excessive. Indeed, He does not like those who commit excess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:141] And He it is Who produces, creates, gardens, orchards, trellised, extending along the ground, as in the case of watermelons, and untrellised, rising upwards on a stem, such as palm-trees; and, He produces, palmtrees, and crops diverse in flavour, [diverse] in the shape and savour of its fruit and seed, and olives, and pomegranates, alike, in [terms of their] leaf (mutashābihan, ‘alike’, is a circumstantial qualifier) and unlike, in [terms of their] savour. Eat of the fruit thereof when it ripens, before its maturity [passes], and pay the due thereof, the alms as appropriate, on the day of its harvest (read yawma hasādahu or yawma hasādihi), that is, one tenth or half of it, and do not be prodigal, by giving it all away, so that nothing remains for [the consumption of] your dependants. Truly, God does not love the prodigal, who overstep [the bounds of] that which He has delimited for them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is Who produceth) creates (gardens trellised) spread out: i.e. not resting on trunks such as vines and other vegetations (and untrellised) that which rests on trunks such as walnuts and almonds, (and the date- palm, and crops of diverse flavour) sweetness and sourness, (and the olive) and He created the olive tree (and the pomegranate) of pomegranate trees, (like) in colour and appearance (and unlike) in taste. (Eat you of the fruit thereof) of the fruit of the palm-tree (when it fruits) when it ripens, (and pay the due thereof upon the harvest day) it could also mean upon measuring it, (and be not prodigal) do not spend in disobedience of Allah nor prevent the obedience of Allah; it is also said that this means: do not forbid the Bahirah, the Sa'ibah, the Wasilah and the Ham. (Lo! Allah loveth not the prodigals) those who spend in disobedience of Allah; or it could mean: the idolaters. It is said that this verse was revealed about Thabit Ibn Qays who collected with his own hands the harvest of 500 palm-trees and gave it away, not leaving a thing for his own family.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { جَنَّٰتٍ مَّعْرُوشَٰتٍ } قَد عَرُشَ عِنَبُها { وَغَيْرَ مَعْرُوشَٰتٍ } من النَّخلِ وَمن سَائِرِ الشَّجرِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah: {Gardens of perpetual bliss} - its grapevines are {uninterrupted} and its other trees are from the palms and from other trees.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف تضلون عن طريق الحق أيها الجاهلون المسرفون مع أنه سبحانه { هُوَ ٱلَّذِيۤ أَنشَأَ } لكم لمعاشكم في النشأة الأولى { جَنَّٰتٍ } من الكروم { مَّعْرُوشَٰتٍ } مرتفعات من الأرض { وَغَيْرَ مَعْرُوشَٰتٍ } ملقيات على وجه الأرض { وَ } أنشأ لكم أيضاً { ٱلنَّخْلَ وَٱلزَّرْعَ مُخْتَلِفاً أُكُلُهُ } أي: أكمل كل واحد منهما رطباً ويابساً { وَٱلزَّيْتُونَ وَٱلرُّمَّانَ مُتَشَٰبِهاً } بعضها ببعض { وَغَيْرَ مُتَشَٰبِهٍ } بل مختلف في الشكل والطعم { كُلُواْ مِن ثَمَرِهِ } أي: ثمر كل واحد من المذكورات حيث شئتم { إِذَآ أَثْمَرَ وَآتُواْ حَقَّهُ } أي: أخرجوا حق الله منه على الوجه المفروض { يَوْمَ حَصَادِهِ } إدراكه وبدو صلاحه { وَلاَ تُسْرِفُوۤاْ } في الأكل إلى حيث تقسى قلوبكم وبكل إدراككم { إِنَّهُ لاَ يُحِبُّ ٱلْمُسْرِفِينَ } [الأنعام: 141] أي: لا يرضى: عنهم وعن فعلهم؛ إذ الأكل إنما هو لقوام البدن وتقوية الروح على فعله، وإسرافه يفضي إلى التعطيل والتكليل المخل للحكمة الإلهية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { مختلفًا }: حال مقدَّرة لم يكن كذلك عند الإنشاء، والضمير في { أُكله }: يعود على النخل، والزرعُ مقيس عليه، أو للجميع على تقدير: كل واحد منهما\n يقول الحقّ جلّ جلاله: { وهو الذي أنشأ } أي: خلق { جنات } بساتين مشتملة على كروم ـ أي: دوالي ـ { معروشات } أي: مرفوعة بالعرشان والدعائم، { وغير معروشات } أي: مبسوطة على وجه الأرض، قيل: المعروشات: ما غرسه الناس في العمران، وغير المعروشات: ما أنبته في الجبال والبراري\n { و } أنشأ { النخل والزرع مختلفًا أُكله } أي: ثمره الذي يؤكل منه، واختلافه في اللون والطعم والرائحة والحجم والهيئة والكيفية، وذلك دليل على عظمة القادر المريد، { و } أنشأ { الزيتون والرمان متشابهًا وغير متشابه } أي: تتشابه بعض أفرادهما في اللون والطعم، ولا يتشابه بعضها\n { كُلوا من ثمره } أي: من ثمر كل واحد منهما، { إذا أثمر } وإن لم يطب، قيل: فائدة الأمر بالأكل: رخصة المالك في الأكل منه قبل أداء حق الله منه قبل الطيب، أي: قبل أن تجب زكاته، وأما إذا طاب فلا بد من التخريص\n { وآتوا حقه يوم حصاده } يريد: ما كان يتصدق به يوم الحصاد، لا الزكاة المقدرة لأنها فرضت بالمدينة، وكان ذلك واجبًا ثم نسخ بالعشر\n وقيل: الزكاة حقيقةً، والآية مدنية، وقيل: مكية، ولم يعيَّن قدرها إلا بالمدينة، والأمر بإتيانها يوم الحصاد ليُهتم به حينئذٍ، حتى لا يؤخر عن وقت الأداء، خلاف ما يفعله العامة من خزنها مع ماله، حتى يدفعها في نوائب المخزن، وليعلم أن الوجوب بالإفراك والطيب، لا بالتصفية، ولذلك شرع التخريص، { ولا تُسرفوا } بصرفها في غير محلها، ولا تتعدوا ما أمرتم به فتجعلوا ما أنشأ الله للأصنام، أو: لا تسرفوا في التصدق بالكل، كقوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "55:68",
      "similarity": 0.48919032395938283
    },
    {
      "verse": "16:11",
      "similarity": 0.4136539037789693
    },
    {
      "verse": "6:99",
      "similarity": 0.3411324895864111
    },
    {
      "verse": "80:29",
      "similarity": 0.32177115935141065
    },
    {
      "verse": "12:47",
      "similarity": 0.26824221023748573
    }
  ]
}