{
  "chapter": "الأنعام",
  "text": "ولا تقربوا۟ مال اليتيم الا بالتى هى احسن حتى يبلغ اشده واوفوا۟ الكيل والميزان بالقسط لا نكلف نفسا الا وسعها واذا قلتم فاعدلوا۟ ولو كان ذا قربى وبعهد الله اوفوا۟ ذلكم وصىكم به لعلكم تذكرون",
  "translations": [
    {
      "translation": "And that you do not go near the property of orphans before they reach maturity - except in a good way; that you give full measure and full weight with justice - We impose on no self any more than it can bear; that you are equitable when you speak - even if a near relative is concerned; and that you fulfil Allah's contract. That is what He instructs you to do, so that hopefully you will pay heed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not spend the belongings of the orphans but for their betterment, until they come of age; and give in full measure, and weigh justly on the balance. God does not burden a soul beyond capacity. When you say a thing, let it be just, even though the matter relate to a relative of yours, and fulfil a promise made to God. These are the things that He has enjoined that you may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(vi) and do not even draw near to the property of the orphan in his minority except in the best manner; (vii) and give full measures and weight with justice; We do not burden anyone beyond his capacity; (viii) When you speak, be just, even though it concern a near of kin; (ix) and fulfil the covenant of Allah. That is what He has enjoined upon you so that you may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not handle the property of the orphans except with a good reason until they become mature and strong. Maintain equality in your dealings by the means of measurement and balance. No soul is responsible for what is beyond it's ability. Be just in your words, even if the party involved is one of your relatives and keep your promise with God. Thus does your Lord guide you so that you may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘And do not approach the wealth of an orphan except in the best manner, till he reaches his adulthood; and measure and weigh in full, with justice; We do not burden any soul except within its capacity; and always speak fairly, although it may be concerning your relative; and be faithful only to Allah’s covenant; this is commanded to you, so that you may accept advice.’”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And come not near to the orphan's property, except to improve it, until he (or she) attains the age of full strength; and give full measure and full weight with justice.\" -- We burden not any person, but that which he can bear -- \"And whenever you speak, say the truth even if a near relative is concerned, and fulfill the covenant of Allah. This He commands you, that you may remember.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not approach the property of the orphan except in the best manner until he attains his maturity, and give full measure and weight with justice-- We do not impose on any soul a duty except to the extent of its ability; and when you speak, then be just though it be (against) a relative, and fulfill Allah's covenant; this He has enjoined you with that you may be mindful;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that you approach not the property of the orphan, save in the fairer manner, until he is of age. And fill up the measure and the balance with justice. We charge not any soul save to its capacity. And when you speak, be just, even if it should be to a near kinsman. And fulfil God's covenant. That then He has charged you with; haply you will remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And approach not the wealth of the orphan save with that which is better, till he reach maturity. Give full measure and full weight, in justice. We task not any soul beyond its scope. And if ye give your word, do justice thereunto, even though it be (against) a kinsman; and fulfil the covenant of Allah. This He commandeth you that haply ye may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Stay well away from an orphan's property, except with the best intentions, before he comes of age. Give full measure and weight, according to justice, We never charge a soul with more than it can bear, when you speak, observe justice, even though it concerns a close relative; and fulfil the covenants of God. That is what He has enjoined upon you so that you may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And approach not the substance of an orphan save with that which is best until he attaineth his age of strength, and fill up the measure and balance with equity- We burthen not a soul except according to its capacity and when ye speak, be fair, even though it be against a kinsman; and the covenant of Allah fulfil. Thus He enjoineth you that haply ye may be admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not approach the orphan’s property, except in the best [possible] manner, until he comes of age. And observe fully the measure and the balance with justice.’ We task no soul except according to its capacity. ‘And when you speak, be fair, even if it were a relative; and fulfill Allah’s covenant. This is what He enjoins upon you so that you may take admonition.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And come not nigh to the orphan's property, except to improve it, until he attain the age of full strength; give measure and weight with (full) justice;- no burden do We place on any soul, but that which it can bear;- whenever ye speak, speak justly, even if a near relative is concerned; and fulfil the covenant of Allah: thus doth He command you, that ye may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And come not near to the orphan's property, except to improve it, until he (or she) attains the age of full strength; and give full measure and full weight with justice. We burden not any person, but that which he can bear. And whenever you give your word (i.e. judge between men or give evidence, etc.), say the truth even if a near relative is concerned, and fulfill the Covenant of Allah, This He commands you, that you may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not touch the wealth of the orphan, except in the fairer manner until he reaches maturity. Give just weight and full measure, We never charge a soul with more than it can bear. When you speak, be just, even if it affects your own kinsmen. Fulfill the covenant of Allah. With such He charges you, in order that you remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not come near the property of the orphan, except with the best intentions, until he reaches maturity. And give full weight and full measure, equitably. We do not burden any soul beyond its capacity. And when you speak, be fair, even if it concerns a close relative. And fulfill your covenant with God. All this He has enjoined upon you, so that you may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not approach the orphan's property except in a way that is best until he reaches maturity. And give full measure and weight in justice. We do not charge any soul except [with that within] its capacity. And when you testify, be just, even if [it concerns] a near relative. And the covenant of Allah fulfill. This has He instructed you that you may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:152] And that you do not approach the property of the orphan save with that, approach, which is fairer, namely, the one wherein lie his best interests, until he is of age, when he is sexually mature. And give full measure and full weight, in justice, fairly, desisting from any fraud. We do not charge any soul beyond its capacity, what it can bear in such [matters], so that if one makes a mistake in a measure or weight, and God knows that his intention had been well-meaning, then he suffers no blame, as is stated in one hadīth. And if you speak, [to pass] a judgement or otherwise, then be just, by being truthful, even if he, the person receiving the statement or the one being accused in it, should be a kinsman. And fulfil God’s covenant. This is what He has charged you with, that perhaps you will remember (read tadhakkarūn or tadhkurūn), you will be admonished.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ وَلاَ تَقْرَبُواْ مَالَ اليتيم إِلاَّ بالتى هِىَ أَحْسَنُ حتى يَبْلُغَ أَشُدَّهُ }.عطف جملة : { ولا تقربوا } على الجملة التي فَسَّرت فعل : { أتْلُ } \\[ الأنعام : 151 \\] عطف محرّمات ترجع إلى حفظ قواع التّعامل بين النّاس لإقامة قواعد الجامعة الإسلاميّة ومدنيتها وتحقيق ثقة النّاس بعضهم ببعض .وابتدأها بحفظ حقّ الضّعيف الذي لا يستطيع الدّفع عن حقّه في ماله ، وهو اليتيم ، فقال : { ولا تقربوا مال اليتيم إلا بالتي هي أحسن } والقِربان كناية عن ملابسة مال اليتيم . والتّصرّف فيه كما تقدّم آنفاً في قوله : { ولا تقربوا الفواحش } \\[ الأنعام : 151 \\]. ولمَّا اقتضى هذا تحريم التصرّف في مال اليتيم ، ولو بالخزن والحفظ ، وذلك يعرّض ماله للتّلف ، استُثني منه قوله : { إلا بالتي هي أحسن } أي إلاّ بالحالة التي هي أحسن ، فاسم الموصول صفة لموصوف محذوف يقدّر مناسباً للموصول الذي هو اسم للمؤنَّث ، فيقدر بالحالة أو الخَصلة .والباء للملابسة ، أي إلاّ ملابسين للخصلة أو الحالة التي هي أحسن حالات القرب ، ولك أن تقدّره بالمرّة من : { تقربوا } أي إلاّ بالقَربة التي هي أحسن . وقد التزم حذف الموصوف في مثل هذا التّركيب واعتباره مؤنَّثاً يجري مجرى المثل ، ومنه قوله تعالى : { ادفع بالتي هي أحسن السيئة } \\[ المؤمنون : 96 \\] أي بالخصلة الحسنة ادفَعْ السيّئة ، ومن هذا القبيل أنَّهم أتوا بالموصول مؤنَّثاً وصفاً لمحذوف ملتزم الحذف وحذفوا صلته أيضاً في قولهم في المثل : «بعد اللَّتَيَّا والتي» ، أي بعد الدّاهية الحقيرة والدّاهية الجليلة كما قال سُلْمِيّ بنُ ربيعةَ الضبِّي: ... ولقد رأبْتُ ثَأى العشيرة بينَهاوكفيتُ جانبها اللَّتَيَّا والتِي ... و { أحسنُ } اسم تفضيل مسلوب المفاضلة ، أي الحسنة ، وهي النّافعة التي لا ضرّ فيها لليتيم ولا لِماله . وإنَّما قال هنا : { ولا تقربوا } تحذيراً من أخذ ماله ولو بأقلّ أحوال الأخذ لأنَّه لا يدفع عن نفسه ، ولذلك لم يقل هنا : { ولا تأكلوا كما قال في سورة البقرة ( 188 ) : { ولا تأكلوا أموالكم بينكم بالباطل } والأشُدّ : اسم يدلّ على قوّة الإنسان ، وهو مشتقّ من الشدّ وهو التوثّق ، والمراد به في هذه الآية ونظائرها ، ممّا الكلام فيه على اليتيم ، بلوغه القوّة التي يخرج بها من ضعف الصّبا ، وتلك هي البلوغ مع صحّة العقل ، لأنّ المقصود بلوغه أهليّة التصرّف في ماله . وما منع الصّبي من التصرّف في المال إلاّ لضعف في عقله بخلاف المراد منه في أوصاف الرّجال فإنَّه يُعنى به بلوغ الرجل منتهى حدّ القوّة في الرّجال وهو الأربعون سنة إلى الخمسين قال تعالى : { حتى إذا بلغ أشده وبلغ أربعين سنة } \\[ الأحقاف : 15 \\] وقال سُحيم بن وَثيل: ... أخُو خمسين مُجتمع أشُدّيوَنَجَّذني مداورة الشُّؤون ... والبلوغ : الوصول ، وهو هنا مجاز في التدرّج في أطوار القوّة المخرِجة من وهن الصّبا .و { حتى } غاية للمستثنى : وهو القربان بالتي هي أحسن ، أي التصرّف فيه إلى أن يبلغ صاحبه أشدّه أي فيسلم إليه ، كما قال تعالى في الآية الأخرى{ فإن آنستم منهم رشداً فادفعوا إليهم أموالهم } \\[ النساء : 6 \\] الآية .ووجه تخصيص حقّ اليتيم في ماله بالحفظ : أنّ ذلك الحقّ مظنّة الاعتداء عليه من الولي ، وهو مظنة انعدام المدافع عنه ، لأنَّه ما من ضعيف عندهم إلاّ وله من الأقارب والموالي من يدفع عنه إذا استجاره أو استنجده ، فأمّا اليتيم فإنّ الاعتداء عليه إنَّما يكون من أقرب النّاس إليه ، وهو وليّه ، لأنَّه لم يكن يلي اليتيم عندهم إلاّ أقرب النّاس إليه ، وكان الأولياء يتوسّعون في أموال أيتامهم ، ويعتدُون عليها ، ويضيعون الأيتام لكيلا ينشأوا نشأة يعرفون بها حقوقهم ، ولذلك قال تعالى : { ألم يجدك يتيماً فآوى } \\[ الضحى : 6 \\] لأنّ اليتيم مظنّة الإضاعة فلذلك لم يوص الله تعالى بمال غير اليتيم ، لأنّ صاحبه يدفع عن نفسه ، أو يستدفع بأوليائه ومنجديه .{ وَأَوْفُواْ الكيل والميزان بالقسط }.عطف الأمر بإيفاء الكيل والميزان ، وذلك في التّبايع ، فقد كانوا يبيعون التّمر والزّبيب كيلاً ، وكانوا يتوازنون الذّهب والفضّة ، فكانوا يُطَفّفون حرصاً على الرّبح ، فلذلك أمرهم بالوفاء . وعدل عن أن يأتي فيه بالنَّهي عن التّطفيف كما في قول شعيب : { ولا تَنقصوا المكيال والميزان } \\[ هود : 84 \\] إشارة إلى أنَّهم مأمورون بالحدّ الذي يتحقّق فيه العدل وافياً ، وعدمُ النّقص يساوي الوفاء ، ولكن في اختيار الأمر بالإيفاء اهتماماً به لتكون النّفوس ملتفتة إلى جانب الوفاء لا إلى جانب ترك التّنقيص ، وفيه تذكير لهم بالسّخاء الذي يتمادحُون به كأنَّه قيل لهم : أين سخاؤكم الذي تتنافسون فيه فهلا تظهرونه إذا كِلْتم أو وزنتم فتزيدوا على العدل بأن توفّروا للمُكتال كرماً بله أن تسرقوه حقّه . وهذا تنبيه لهم على اختلال أخلاقهم وعدم توازنها .والباء في قوله : { بالقسط } للملابسة والقسط العدل ، وتقدّم عند قوله تعالى : { قائماً بالقسط } في سورة آل عمران ( 18 ) ، أي أوفوا متلبّسين بالعدل بأن لا تظلموا المكتال حقّه .لاَ نُكَلِّفُ نَفْسًا إِلاَّ وُسْعَهَا }.ظاهر تعقيب جملة : { وأوفوا الكيل } إلخ بجملة : { لا نكلف نفساً إلا وسعها } أنَّها متعلّقة بالتي وليتها فتكون احتراساً ، أي لا نكلّفكم تمام القسط في الكيل والميزان بالحبّة والذرّة ولكنّا نكلّفكم ما تظنّون أنَّه عدل ووفاء . والمقصود من هذا الاحتراسسِ أنّ لا يَترك النّاسُ التّعامل بينهم خشية الغلط أو الغفلة ، فيفضي ذلك إلى تعطيل منافع جمّة . وقد عدل في هذا الاحتراس عن طريق الغيبة الذي بُنيَ عليه المقول ابتداء في قوله : { ما حرم ربكم عليكم } \\[ الأنعام : 151 \\] لِما في هذا الاحتراس من الامتنان ، فتولّى الله خطاب النّاس فيه بطريق التكلّم مباشرة زيادة في المنّة ، وتصديقاً للمبلّغ ، فالوصاية بإيفاء الكيل والميزان راجعة إلى حفظ مال المشتري في مظنّة الإضاعة ، لأنّ حالة الكيل والوزن حالة غفلة المشتري ، إذ البائع هو الذي بيده المكيال أو الميزان ، ولأنّ المشتري لرغبته في تحصيل المكيل أو الموزون قد يتحمّل التّطفيف ، فأوصِي البائع بإيفاء الكيل والميزان .وهذا الأمر يدلّ بفحوى الخطاب على وجوب حفظ المال فيما هو أشدّ من التّطفيف ، فإنّ التّطفيف إن هو إلاّ مخالسة قَدْر يسير من المبيع ، وهو الذي لا يظهر حين التّقدير فأكل ما هو أكثر من ذلك من المال أوْلى بالحفظ ، وتجنّب الاعتداء عليه .ويجوز أن تكون جملة : { لا نكلف نفساً إلا وسعها } تذييلاً للجمل التي قبلها ، تسجيلاً عليهم بأنّ جميع ما دُعوا إليه هو في طاقتهم ومكنتهم . وقد تقدّم ذلك عند قوله تعالى : { لا يكلف الله نفساً إلا وسعها } في آخر سورة البقرة ( 286 ).وَإِذَا قُلْتُمْ فاعدلوا وَلَوْ كَانَ ذَا قربى }.هذا جامعٌ كلّ المعاملات بين النّاس بواسطة الكلام وهي الشّهادة ، والقضاء ، والتّعديل ، والتّجريح ، والمشاورة ، والصّلح بين النّاس ، والأخبار المخبِرة عن صفات الأشياء في المعاملات : من صفات المبيعات ، والمؤاجرات ، والعيوب؛ وفي الوعود ، والوصايا ، والأيمان؛ وكذلك المدائح والشّتائم كالقذف ، فكلّ ذلك داخل فيما يصدر عن القول .والعدل في ذلك أن لا يكون في القول شيء من الاعتداء على الحقوق : بإبطالها ، أو إخفائها ، مثل كتمان عيوب المبيع ، وادّعاء العيوب في الأشياء السّليمة ، والكذب في الأثمان ، كأن يقول التّاجر : أُعطيت في هذه السلعة كذا ، لثمن لم يُعْطَه ، أو أنّ هذه السّلعة قامتْ علي بكذا . ومنه التزام الصّدق في التّعديل والتّجريح وإبداء النّصيحة في المشاورة ، وقول الحقّ في الصّلح . وأمّا الشّهادة والقضاء فأمر العدل فيهما ظاهر ، وإذا وَعَد القائل لا يُخلِف ، وإذا أوْصَى لا يظلم أصحابَ حقوق الميراث ، ولا يحلف على الباطل ، وإذا مدحَ أحداً مدحه بما فيه ، وأمَّا الشّتم فالإمساك عنه واجب ولو كان حقّاً فذلك الإمساك هو العدل لأنّ الله أمر به .وفي التّعليق بأداة الشّرط في قوله : { وإذا قلتم } إشارة إلى أنّ المرء في سعة من السكوت إن خشي قولَ العدل . وأمَّا أن يقول الجور والظّلم والباطل فليس له سبيل إلى ذلك ، والكذب كلّه من القول بغير العدل ، على أنّ من السكوت ما هو واجب . وفي «الموطأ» أنّ رجلاً خطب إلى رجل أختَه فذكر الأخُ أنَّها قد كانت أحدثَتْ فبلغ ذلك عُمر بن الخطّاب فضربه أو كاد يضربه ثمّ قال : «مَالَك ولِلْخَبَر» .والواو في قوله : { ولو كان } واو الحال ، ولو وصلية تفيد المبالغة في الحال التي من شأنها أن يظُنّ السّامع عدمَ شموللِ الحكم إيَّاها لاختصاصها من بين بقيّة الأحوال التي يشملها الحكم ، وقد تقدّم بيانها عند قوله تعالى : { فلن يقبل من أحدهم ملء الأرض ذهبا ولو افتدى به } في سورة آل عمران ( 91 ) ، فإنّ حالة قرابة المقوللِ لأجله القولُ قد تحمل القائل على أن يقول غير العدل ، لنفع قريبه أو مصانعته ، فنبّهوا على وجوب التزام العدل في القول في تلك الحالة ، فالضّمير المستتر في ( كان ) كائد إلى شيء معلوم من الكلام : أي ولو كان الذي تعلّق به القول ذا قربى .والقربى : القرابة ويُعلم أنَّه ذو قرابة من القائل ، أي إذا قلتم قولاً لأجله أو عليه فاعدلوا ولا تقولوا غير الحقّ ، لا لدفع ضرّه بأن تغمصوا الحقّ الذي عليه ، ولا لنفعه بأن تختلقوا له حقّاً على غيره أو تبرءوه ممّا صدر منه على غيره ، وقد قال الله تعالى في العدل في الشّهادة والقضاء : { كونوا قوامين بالقسط شهداء لله ولو على أنفسكم أو الوالدين والأقربين } \\[ النساء : 135 \\].وقد جاء طلب الحقّ في القول بصيغة الأمر بالعدل ، دون النّهي عن الظلم أو الباطل : لأنَّه قيّده بأداة الشّرط المقتضي لصدور القول : فالقول إذا صدر لا يخلو عن أن يكون حقّاً أو باطلاً ، والأمر بأن يكون حقّاً أوفَى بمقصد الشّارع لوجهين : أحدهما : أنّ الله يحبّ إظهار الحقّ بالقول ، ففي الأمر بأن يكون عدلاً أمر بإظهاره ونهي عن السّكوت بدون موجب . الثّاني : أنّ النَّهي عن قول الباطل أو الزّور يصدق بالكلام الموجَّه الذي ظاهره ليس بحقّ ، وذلك مذموم إلاّ عند الخوف أو الملاينة ، أو فيما لا يرجع إلى إظهار حقّ ، وتلك هي المعاريض التي ورد فيها حديث : « إنّ في المعاريض لمندوحة عن الكذب » .ختم هذه المتلوات بالأمر بإيفاء العهد بقوله : { وبعهد الله أوفوا }.وعهد الله المأمور بالإيفاء به هو كلّ عهد فيه معنى الانتساب إلى الله الذي اقتضته الإضافة ، إذ الإضافة هنا يصحّ أن تكون إضافة المصْدر إلى الفاعل ، أي ما عهد اللَّهُ به إليكم من الشّرائع ، ويصحّ أن تكون إضافة المصدر إلى مفعوله ، أي ما عاهدتم الله أن تفعلوه ، والتزمتموه وتقلّدتموه ، ويصحّ أن تكون الإضافة لأدنى ملابسة ، أي العهد الذي أمر الله بحفظه ، وحذر من ختره ، وهو العهود التي تنعقد بين الناس بعضهم مع بعض سواء كان بين القبائل أم كان بين الآحاد . ولأجل مراعاة هذه المعاني النّاشئة عن صلاحيّة الإضافة لإفادتها عُدِل إلى طريق إسناد اسم العهد إلى اسم الجلالة بطريق الإضافة دون طريق الفعل ، بأن يقال : وبما عاهدتم الله عليه ، أو نحن ذلك ما لا يحتمل إلاّ معنى واحداً . وإذْ كان الخطاب بقوله : { تعالوا } \\[ الأنعام : 151 \\] للمشركين تعيّن أن يكون العهد شيئاً قد تقرّرت معرفته بينهم ، وهو العهود التي يعقدونها بالموالاة والصّلح أو نحو ذلك فهو يدعوهم إلى الوفاء بما عاقدوا عليه . وأضيف إلى الله لأنَّهم كانوا يتحالفون عند التّعاقد ولذلك يسمّون العهد حِلْفاً ، قال الحارث بن حلِّزة: ... واذْكروا حِلْف ذي المجاز وماقُدم فيه العهودُ والكفلاء ... وقال عمرو بن كلثوم: ... ونُوجد نحن أمنعَهم ذماراًوأوفاهم إذا عقَدوا يميناً ... فالآية آمرة لهم بالوفاء ، وكان العرب يتمادحون به . ومن العهود المقرّرة بينهم : حلف الفضول ، وحلف المطيَّبين ، وكلاهما كان في الجاهليّة على نفي الظّلم والجور عن القاطنين بمكّة ، وذلك تحقيق لعهد الله لإبراهيم عليه السّلام أن يجعل مكّة بلداً آمناً ومن دخله كان آمناً ، وقد اعتدى المشركون على ضعفاء المؤمنين وظلموهم مثللِ عمار ، وبلال ، وعامر بن فهيرة ، ونحوهم ، فهو يقول لهم فيما يتلو عليهم أنّ خفر عهد الله بأمان مكّة ، وخفر عهودكم بذلك ، أولى بأن تحرّموه من مزاعمكم الكاذبة فيما حرّمتم وفصّلتم ، فهذا هو الوجه في تفسير قوله : { وبعهد الله أوفوا }.وتقديم المجرور على عامله للاهتمام بأمر العهد وصرف ذهن السّامع عند ، ليتقرّر في ذهنه ما يرد بعده من الأمر بالوفاء ، أي إن كنتم تَرَون الوفاء بالعهد مدحة فعهد الله أولى بالوفاء وأنتم قد اخترتموه ، فهذا كقوله تعالى : { يسألونك عن الشهر الحرام قتال فيه قل قتال فيه كبير } ثمّ قال { وصَدّ عن سبيل الله وكفر به والمسجد الحرام وإخراج أهله منه أكبر عند الله } \\[ البقرة : 217 \\]{ ذلكم وصاكم بِهِ لَعَلَّكُمْ تَذَكَّرُونَ }.تكرار لقوله المماثل له قبله ، وقد علمت أنّ هذا التّذييل ختم به صنف من أصناف الأحكام . وجاء مع هذه الوصيّة بقوله : { لعلكم تذكرون } لأنّ هذه المطالب الأربعة عرف بين العرب أنَّها محامد ، فالأمر بها ، والتّحريض عليها تذكير بما عرفوه في شأنها ولكنّهم تناسوه بغلبة الهوى وغشاوة الشّرك على قلوبهم .وقرأ نافع ، وابن كثير ، وأبو عمرو ، وابن عامر ، وعاصم في رواية أبي بكر ، وأبو جعفر ، ويعقوبُ : تذّكرون بتشديد الذال لإدغام التّاء الثّانية في الذال بعد قلبها ، وقرأ حمزة ، والكسائي ، وعاصم في رواية حفص ، وخلَف بتخفيف الذال على حذف التّاء الثّانية تخفيفاً .\n\n",
      "translations": [
        {
          "translation": "(And approach not the wealth of the orphan save with that which is better) through protecting it and making it grow; (till he reach maturity) legal age and shows righteousness in his character. (Give full measure and full weight, in justice. We task not any soul) upon measuring and weighing (beyond its scope) beyond its effort to establish justice. (And if you give your word, do justice thereunto) be truthful, (even though it be (against) a kinsman) you should be truthful and say what is true; (and fulfil the covenant of Allah. This He commandeth you that haply ye may remember) haply you may heed the admonition.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nثم أراد أن يبين أن الرذائل الثلاث مستلزمة باجتماعها رذيلة الجور التي هي أعظمها وجماعها كما أنّ فضائلها تستلزم العدالة التي هي كمالها والشاملة لها فقال: { ولا تقربوا مال اليتيم } بوجه من الوجوه { إلا بالتي هي أحسن } إلا بالخصلة التي هي أحسن من حفظه وتثميره { حتى يبلغ أشدّه } فينتفع به\n لا بالأكل والإنفاق في مآربكم والإتلاف فإنه أفحش\n ولما بيّن تحريم أجناس الرذائل الأربع بأسرها على التفصيل أمر بإيجاب الفضائل الأربع بالإجمال\n إذ تفصيل الرذائل يغني عن تفصيل مقابلاتها وذلك أنها مندرجة بأسرها في العدالة فأمر بها في جميع الوجوه فعلاً وقولاً وقال: { وأوفوا الكيل والميزان بالقسط } أي: حافظوا على العدل فيما بينكم وبين الخلق مطلقاً { وإذا قلتم فاعْدِلوا } أي: لا تقولوا إلا الحق { ولو كان } المقول فيه { ذا قربى } فلا تميلوا في القول له أو عليه إلى زيادة أو نقصان { وبِعَهد الله أوْفُوا } أي: بالتوحيد والطاعة وكل ما بينكم وبين الله من لوازم العهد السابق بالعقد اللاحق\n ولما كان سلوك طريقة الفضيلة التي هي طريقة الوحدة والتوجه إلى الحق صعباً\n كما قيل: أدقّ من الشعرة وأحدّ من السيف\n وخصوصاً في الأفعال إذ مراعاة الوسط فيها بلا ميل ما إلى طرف الإفراط والتفريط في غاية الصعوبة\n قال بعد قوله: { وأوفوا الكيل والميزان بالقسط لا نكلف نفساً إلا وسعها } فبين أنه جمع في هذا المقام بين النهي عن جميع الرذائل والأمر بجميع الفضائل كلها بحيث لا يخرج منها جزئي ما من جزئياتها\n ولهذا قال ابن عباس رضي الله عنه: إن هذه آيات محكمات لم ينسخهنّ شيء من جميع الكتب\n واتفق على قوله أهل الكتابين وجميع المِلل والنِحَل\n وقال كعب الأحبار: والذي نفس كعب بيده إنها لأول شيء في التوراة\n { ذلكم } أي: ما ذكر من وجوب الانتهاء عن جميع الرذائل والاتصاف بجميع الفضائل { وصاكم به } في جميع الكتب على ألسنة جميع الرُسُل { لعلكم تذكرون } عند سماعها ما وهب الله لكم من الكمال وأودع استعدادكم في الأزل",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة المحرمات التي حرمها الحق عليكم: أن { لاَ تَقْرَبُواْ مَالَ ٱلْيَتِيمِ } ولا تتصرفوا { إِلاَّ بِ } التصرفات { ٱلَّتِي هِيَ أَحْسَنُ } لليتيم وأحفظ لغبطته من تنمية ماله وحفظه { حَتَّىٰ يَبْلُغَ } اليتيم { أَشُدَّهُ } أي: يسمع من التصرفات الشرعية شرعاً\n وحينئذ يسلم إليه بعد تجربته واختباره\n { وَ } من جملتها أيضاً: ألا تنقصوا وتخسروا في الكيل والوزن بل { أَوْفُواْ ٱلْكَيْلَ وَٱلْمِيزَانَ بِٱلْقِسْطِ } أي: بالعدل ولا تنقصوا منهما\n وإن كان إبقاؤهما في غاية الصعوبة والعسر\n فعليكم أن تبذلوا وسعكم وطاقتمك في تعديلها وإيفائهما مهما أمكن لكم\n وما ليس في وسعكم { لاَ نُكَلِّفُ نَفْساً إِلاَّ وُسْعَهَا } معفو عنكم\n { وَ } من جملتها: ألا تميلوا في الأحكام { إِذَا قُلْتُمْ } وحكمتم حال كونكم حاكمين بين الخصمين { فَٱعْدِلُواْ } في الحكومة { وَلَوْ كَانَ } المحكوم عليه أو له { ذَا قُرْبَىٰ } من حميمكم وذوي قرابتكم\n وعليكم أيها الحكام ألا تتجاوزوا في الأحكام عما حكم الله به بل { وَبِعَهْدِ ٱللَّهِ } الحكيم العليم { أَوْفُواْ } وبمقتضى حكمه وحكمه وفوا { ذٰلِكُمْ } المذكور مما { وَصَّـٰكُمْ } الله { بِهِ لَعَلَّكُمْ تَذَكَّرُونَ } [الأنعام: 152] رجاء أن تتذكروا وتتعظوا به أيها المتواجهون إلى توحيده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { حتى يبلغ أشده } وهو البلوغ مع الرشد\n بحيث يعرف مصالح نفسه ويأمن عليه التبذير\n فيدفع له\n { وأوفوا الكيل والميزان بالقسط } بالعدل والتوفية\n { لا نُكلِّف نفسًا إلا وسعها } إلا ما يسعها ولا يعسر عليها\n ولمَّا أمر بالقسط في الكيل والوزن\n وقد علم أن القسط الذي لا زيادة فيه ولا نقصان مما يجري فيه الحرج ـ أمر بالوسع في ذلك وعفا عما سواه\n { وإذا قلتم } في حكومة ونحوها\n { فاعدلوا ولو كان } المقول له في شهادة أو حكومة { ذا قربى } فيجب العدل في ذلك\n { وبعهد الله أوفوا } أي: ما عهد إليكم من ملازمة العدل وتأدية أحكام الشرع\n أو ما عاهدتم مع عباده\n { ذلكم وصّاكم به لعلكم تذكرون } تتعظون به",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:42",
      "similarity": 0.41312773449830176
    },
    {
      "verse": "17:34",
      "similarity": 0.4008470168666392
    },
    {
      "verse": "65:7",
      "similarity": 0.37122068917523254
    },
    {
      "verse": "23:62",
      "similarity": 0.3614787160415617
    },
    {
      "verse": "83:3",
      "similarity": 0.3371732832189903
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006152.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006152.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:152.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}