{
  "chapter": "الأنعام",
  "text": "ان تقولوا۟ انما انزل الكتب على طائفتين من قبلنا وان كنا عن دراستهم لغفلين",
  "translations": [
    {
      "translation": "So you cannot say: The Book was only sent down to the two groups before us and we were ignorant of their studies.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest you say: \"The Book that was sent before was meant only for two groups; we were not aware of their teachings;\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(You may no longer) say now that the Book was revealed only to two groups of people before Us and that we had indeed been unaware of what they read.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and will not say that the Book was revealed only to two groups of people before you, or that you were ignorant of its knowledge,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For you (the disbelievers) may say, “The Book was sent down only to two groups (Jews and Christians) before us; and we were totally unaware of what they read and taught.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest you should say: \"The Book was sent down only to two sects before us, and for our part, we were in fact unaware of what they studied.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest you say that the Book was only revealed to two parties before us and We were truly unaware of what they read.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "lest you should say, 'The Book was sent down only upon two parties before us, and we have indeed been heedless of their study';\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest ye should say: The Scripture was revealed only to two sects before us, and we in sooth were unaware of what they read;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and not say, \"The Book was only sent down to the two groups before us and we were indeed unaware of their teachings,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest ye should say: the Book was only sent down to the two sects before us, and we in sooth were unaware of their readings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest you should say, ‘The Book was sent down only to two communities before us, and we were indeed unaware of their studies,’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest ye should say: \"The Book was sent down to two Peoples before us, and for our part, we remained unacquainted with all that they learned by assiduous study:\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest you (pagan Arabs) should say: \"The Book was only sent down to two sects before us (the Jews and the Christians), and for our part, we were in fact unaware of what they studied.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "lest you should say: 'The Book was sent down only to two parties before us; we are inattentive to their study'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest you say, “The Scripture was revealed to two parties before us, and we were unaware of their teachings.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[We revealed it] lest you say, \"The Scripture was only sent down to two groups before us, but we were of their study unaware,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:156] We have revealed it, lest you should say, ‘The Scripture was revealed only upon two parties — the Jews and   the Christians — before us and we (in has been softened, its noun omitted, in other words [read as] innā) indeed have been unacquainted with their study’, their reading [of the scripture], not knowing any of it, since it is not in our own language.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله : { أن تقولوا } في موضع التّعليل لفعل { أنزلناه } على تقدير لام التّعليل محذوفة على ما هو معروف من حذفها مع ( أنْ ). والتّقدير : لأن تقولوا ، أي لقولكم ذلك في المستقبل ، أي لملاحظة قولكم وتَوقُّع وقوعه ، فالقول باعث على إنزال الكتاب .والمقام يدلّ على أنّ هذا القول كانَ باعثاً على إنزال هذا الكتاب ، والعلّة الباعثة على شيء لا يلزم أن تكون علّة غائية ، فهذا المعنى في اللاّم عكس معنى لام العاقبة ، ويؤول المعنى إلى أنّ إنزال الكتاب فيه حِكَم منها حكمة قطع معذرتهم بأنَّهم لم ينزّل إليهم كتاب ، أو كراهية أن يقولوا ذلك ، أو لتجنّب أن يقولوه ، وذلك بمعونة المقام إيثاراً للإيجاز فلذلك يقدّر مضافٌ مثل : كراهيةَ أو تجنّبَ . وعلى هذا التّقدير جرى نحاة البصرة . وذهب نحاة الكوفة إلى أنَّه على تقدير ( لاَ ) النّافية ، فالتّقدير عندهم : أنْ لا تقولوا ، والمآل واحد ونظائر هذا في القرآن كثيرة كقوله : { يبين الله لكم أن تضلوا } \\[ النساء : 176 \\] وقوله : { واتبعوا أحسن ما أنزل إليكم من ربكم من قبل أن يأتيكم العذاب بغتة وأنتم لا تشعرون أن تقول نفس يا حسرتى على ما فرطت في جنب الله } \\[ الزمر : 55 ، 56 \\] وقوله : { وألقى في الأرض رواسي أن تميد بكم }\\[ النحل : 15 \\] أي لتجنّب مَيْدها بكم ، وقول عمرو بن كثلوم :فَعَجَّلْنَا القِرَى أنْ تَشْتُمُونَا ... وهذا القول يجُوز أن يكون قد صدر عنهم من قبلُ ، فقد جاء في آية سورة القصص ( 48 ) : { فلما جاءهم الحق من عندنا قالوا لولا أوتي مثل ما أوتي موسى } ويجُوز أن يكون متوقّعاً ثمّ قالوه من بعد ، وأيّاً مَا كان فإنَّه متوقّع أن يكرّروه ويعيدوه قولاً موافقاً للحال في نفس الأمر ، فكان متوقّعاً صدوره عند ما يتوجّه الملام عليهم في انحطاطهم عن مجاوريهم من اليهودِ والنّصارى من حيث استكمال الفضائل وحسن السّير وكمال التديّن ، وعند سؤالهم في الآخرة عن اتّباع ضلالهم ، وعندما يشاهدون ما يناله أهل الملل الصّالحة من النّعيم ورفع الدّرجات في ثواب الله فيتطلّعون إلى حظّ من ذلك ويتعلّلون بأنَّهم حرموا الإرشاد في الدّنيا .وقد كان اليهود والنّصارى في بلاد العرب على حالة أكمل من أحوال أهل الجاهليّة ، ألا ترى إلى قول النّابغة يمدح آل النّعمان بن الحارث ، وكانوا نصارى :مَجَلَّتُهم ذاتُ الإله ودينُهم ... قَويمٌ فما يَرْجُون غيرَ العواقبولا يَحْسِبُون الخَيْر لا شرّ بعده ... ولا يحسبون الشرّ ضَرْبَةَ لازبوالطائفة : الجماعة من النّاس الكثيرة ، وقد تقدّم عند قوله تعالى : { فلتقم طائفة منهم معك } في سورة النّساء ( 102 ) ، والمراد بالطّائفتين هنا اليهود والنّصارى .والكتاب مراد به الجنس المنحصر في التّوراة والإنجيل والزّبور . ومعنى إنزال الكتاب عليهم أنَّهم خوطبوا بالكتب السّماوية التي أنزلت على أنبيائهم فلم يكن العرب مخاطبين بما أنزل على غيرهم ، فهذا تعلّل أول منهم ، وثمة اعتلال آخر عن الزّهادة في التخلّق بالفضائل والأعمال الصالحة : وهو قولهم : وإن كنا عن دراستهم لغافلين } ، أي وأنَّا كنّا غافلين عن اتباع رشدهم لأنّا لم نتعلم ، فالدّراسة مراد بها التعليم .والدّراسة : القراءة بمعاودة للحفظ أو للتّأمّل ، فليس سرد الكتاب بدراسة . وقد تقدّم قوله تعالى : { وليقولوا درست } في هذه السّورة ( 105 ) ، وتقدّم تفصيله عند قوله تعالى : { وبما كنتم تدرسون } من سورة آل عمران ( 79 ).والغفلة : السّهو الحاصل من عدم التفطّن ، أي لم نهتمّ بما احتوت عليه كتبهم فنقتدي بهديها ، فكان مجيء القرآن منبّها لهم للهدي الكامل ومغنِياً عن دراسة كتبهم .\n\n",
      "translations": [
        {
          "translation": "(Lest ye should say) so that you will not say, people of Mecca, on the Day of Judgement: (The Scripture was revealed only to two sects) the people of two religions (before us) i.e. the Jews and Christians, (and we 154 in sooth were unaware) ignorant (of what they read) their reading of the Torah and the Gospel;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وإن كان أكثر أحكام الكتب الإلهية مشتركة كراهة { أَن تَقُولُوۤاْ } أيها المؤمنون { إِنَّمَآ أُنزِلَ ٱلْكِتَابُ عَلَىٰ طَآئِفَتَيْنِ مِن قَبْلِنَا } أي: اليهود والنصارى\n وعلى لسانهم ولغتهم فلا تقبلون الأحكام الإلهية معللين قائلين: { وَإِن } أي: { كُنَّا عَن دِرَاسَتِهِمْ } قراءتهم وتعلمهم لعدم علمنا بوضع لغتهم { لَغَافِلِينَ } [الأنعام: 156]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أن تقولوا }: مفعول له\n أي: كراهة أن تقولوا\n يقول الحقّ جلّ جلاله: { وهذا } القرآن { كتاب أنزلناه مبارك } كثير النفع { فاتبعوه } في الأصول والفروع\n { واتقوا } الشرك والمعاصي\n { لعلكم تُرحمون } ببركة أتباعه فتحيا به قلوبكم\n وتنتعش به أرواحكم\n وإنما أنزلناه كراهة { أن تقولوا يوم القيامة } في الحجة: { إنما أُنزل الكتابُ على طائفتين من قبلنا } اليهود والنصارى\n وإنما خصهما بالذكر لشهرتهما دون الكتب السماوية\n { وإن كنا } وإنه\n أي: الأمر والشأن\n كنا { عن دراستهم } أي: قراءتهم { لغافلين } أي: كنا غافلين عن قراءة أهل الكتاب\n لا ندري ما هي ولا نعرف مثلها\n أو لم ندرس مثل دراستهم\n ولم نعرف ما درسوا من الكتب\n فلا حجة علينا\n فقد قامت الحجة عليكم بنزول القرآن",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:44",
      "similarity": 0.8086838671495795
    },
    {
      "verse": "68:37",
      "similarity": 0.8074400701575437
    },
    {
      "verse": "3:79",
      "similarity": 0.7450411631788849
    },
    {
      "verse": "6:105",
      "similarity": 0.7352821942751628
    },
    {
      "verse": "7:169",
      "similarity": 0.5710530132524387
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006156.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006156.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:156.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}