{
  "chapter": "الأنعام",
  "text": "قل هلم شهداءكم الذين يشهدون ان الله حرم هذا فان شهدوا۟ فلا تشهد معهم ولا تتبع اهواء الذين كذبوا۟ بـايتنا والذين لا يؤمنون بالءاخرة وهم بربهم يعدلون",
  "translations": [
    {
      "translation": "Say: 'Produce your witnesses to testify that Allah made this haram.' If they do testify, do not testify with them and do not follow the whims and desires of people who deny Our Signs, and who do not have iman in the Next World and make others equal to their Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"Bring your witnesses to testify that God has forbidden this (and this).\" Then even if they testify, you should not testify with them; and do not follow the wishes of those who deny Our signs and believe not in the Hereafter, and make others the equal of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them: 'Call your witnesses to testify that Allah forbade such-and-such.' Then if they do testify, neither testify with them nor follow the desires of those who have given the lie to Our signs and who do not believe in the Hereafter and set up equals with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them to call their witness who will testify that God has made certain things unlawful. Even if they do testify, do not testify with them. Do not follow the desires of those who have rejected Our revelations and the pagans who do not believe in the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Bring your witnesses who can testify that Allah has forbidden this”; then if they do testify, O listener (followers of this Prophet) do not bear witness along with them and do not follow the desires of those who deny Our signs, and of those who do not believe in the Hereafter and who ascribed equals to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Bring forward your witnesses, who can testify that Allah has forbidden this.\" Then if they testify, do not testify with them. And do not follow the vain desires of those who belie Our Ayat, and such as believe not in the Hereafter, and they hold others as equal with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Bring your witnesses who should bear witness that Allah has forbidden this, then if they bear witness, do not bear witness with them; and follow not the low desires of those who reject Our communications and of those who do not believe in the hereafter, and they make (others) equal to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Produce your witnesses, those who testify God has forbidden this.' Then if they testify, bear not witness with them; and do not thou follow the caprices of those who cried lies to Our signs, and who believe not in the world to come, and ascribe equals to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Come, bring your witnesses who can bear witness that Allah forbade (all) this. And if they bear witness, do not thou bear witness with them. Follow thou not the whims of those who deny Our revelations, those who believe not in the Hereafter and deem (others) equal with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Come, bring your witnesses, who can testify that God forbade [all] this.\" If they bear witness [falsely], do not bear witness with them; nor yield to the wishes of those who deny Our signs, nor of those who do not believe in the life to come and set up others as equals with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: here with your witnesses, those who will testify that Allah hath forbidden all this. Then even if they testify, testify thou not with them. And follow thou not the desires of those who belie Our signs and those who believe not in the Hereafter while they equalise others with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Bring your witnesses who may testify that Allah has forbidden this.’ So if they testify, do not testify with them, and do not follow the desires of those who deny Our signs, and those who do not believe in the Hereafter and equate [others] with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Bring forward your witnesses to prove that Allah did forbid so and so.\" If they bring such witnesses, be not thou amongst them: Nor follow thou the vain desires of such as treat our signs as falsehoods, and such as believe not in the Hereafter: for they hold others as equal with their Guardian-Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Bring forward your witnesses, who can testify that Allah has forbidden this. Then if they testify, testify not you (O Muhammad SAW) with them. And you should not follow the vain desires of such as treat Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) as falsehoods, and such as believe not in the Hereafter, and they hold others as equal (in worship) with their Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Bring those witnesses of yours who can testify that Allah has forbidden this' If they testify to it, do not testify with them, nor follow the wishes of those who belie Our verses, and disbelieve in the Everlasting Life and ascribe equals to their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Produce your witnesses who would testify that God has prohibited this.” If they testify, do not testify with them. And do not follow the whims of those who deny Our revelation, and those who do not believe in the Hereafter, and those who equate others with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"Bring forward your witnesses who will testify that Allah has prohibited this.\" And if they testify, do not testify with them. And do not follow the desires of those who deny Our verses and those who do not believe in the Hereafter, while they equate [others] with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:150] Say: ‘Come, bring forth, your witnesses, those who can testify that God has forbidden this’, which you have forbidden. Then if they testify, do not bear witness with them; and do not follow the whims of those who deny Our signs, those who do not believe in the Hereafter and ascribe equals to their Lord, associating others [with Him].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "153 (Say) to them, Muhammad: (Come, bring your witnesses who can bear witness that Allah forbade (all) this) that you claim of crops and cattle. (And if they) falsely (bear witness) that they are forbidden, (do not you bear witness with them. Follow thou not the whims of those who deny Our revelations) i.e. the Qur'an, (those who believe not in the Hereafter) in resurrection after death (and deem (others) equal with their Lord) take idols as His partners.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم يا أكمل الرسل: { هَلُمَّ شُهَدَآءَكُمُ } أي: أحضروا أحباركم { ٱلَّذِينَ يَشْهَدُونَ أَنَّ ٱللَّهَ حَرَّمَ } في كتابه { هَـٰذَا } أي: ما ادعيتم تحريمها\n\n\n{ فَإِن شَهِدُواْ } بعدما حضروا افتراء على كتاب الله { فَلاَ تَشْهَدْ } يا أكمل الرسل { مَعَهُمْ } ولا تقبل شهادتهم { وَلاَ تَتَّبِعْ أَهْوَآءَ ٱلَّذِينَ كَذَّبُواْ بِآيَاتِنَا } ونسبوا إليها ما هي خالية عنها { وَ } اعلم يا أكمل الرسل أن { ٱلَّذِينَ لاَ يُؤْمِنُونَ بِٱلآخِرَةِ } ولا بالمجازاة والكافأة مطلقاً\n ولا يبالون من أفعال هذه المفتريات الباطلة { وَهُم } من غاية جهلهم { بِرَبِّهِمْ } الذي رباهم بأنواع الكرم { يَعْدِلُونَ } [الأنعام: 150] يشركون ويجعلون له عديلاً\n تعالى عما يقول الظالمون علواً كبيراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { هَلُم }: اسم فعل\n وهو عند البصريين بسيط\n وعند الكوفيين مركب\n انظر البيضاوي\n يقول الحقّ جلّ جلاله: { سيقول الذين آشركوا } في الاحتجاج لأنفسهم: { لو شاء الله } عدم شركنا { ما أشركنا ولا } أشرك { آباؤنا ولا حرمنا من شيء } من البحائر وغيرها\n فلو لم نكن على حق مرضى عند الله ما أمهلنا ولا تركنا عليه فإمهاله لنا وتركه لنا على ما نحن فيه دليل على أنه أراده منا\n والجواب عن شُبهتهم: أنه خلاف ما أنزل الله على جميع رسله\n والحق تعالى لم يتركهم على ذلك\n بل بعث لهم الرسل يكلفهم بالخروج عنه\n والإرادة خلاف التكليف\n وأيضًا: قولهم هذا لم يصدر منهم على وجه الاعتذار وإنما صدر منهم على وجه المخاصمة والاحتجاج\n ولا يصح الاحتجاج بالقدر\n والحاصل أنهم تمسكوا بالحقيقة ورفضوا الشريعة\n وهو كفر وزندقة\n إذ لا بد من الجمع بين الحقيقة في الباطن\n والتمسك بما جاءت به الرسل من الشريعة في الظاهر\n وإلاَّ فهو على باطل\n ولذلك ردّ الله تعالى عليهم بقوله: { كذلك كذب الذين من قبلهم } الرسل\n فتمسكوا بالحقيقة الظلمانية\n { حتى ذاقوا بأسنا } أي: عذابنا الذي أنزلناه عليهم بتكذيبهم { قل } لهم: { هل عندكم من علم } يدل على أن الله أمركم بالشرك\n وتحريم ما أحل\n وأنه رضي ذلك لكم\n { فتخرجوه } أي: فتظهروه { لنا } \n بل { إن تتبعون } في ذلك { إلا الظن } ولا تحقيق عندكم\n { وإن أنتم إلا تخرصون } تكذبون على الله تعالى\n وفيه دليل على أن الظن لا يكفي في العقائد\n { قل } لهم: { فللَّه الحجة } على عباده\n { البالغة } \n حيث بعث الرسل مبشرين ومنذرين\n وأمروا بتوحيد الله وطاعته\n فكل من خالفهم قامت الحجة عليه\n هذا باعتبار التشريع الظاهر\n وأما باعتبار باطن الحقيقة\n فالأمور كلها بيد الله يضل من يشاء بعدله\n ويهدي من يشاء بفضله\n { فلو شاء لهداكم أجمعين } ولكن شاء هداية قوم وضلال آخرين\n\n[الأنبيَاء:23]\n فقول المشركين: { لو شاء الله\n\n\n } الخ\n حق في نفسه\n لكنهم لم يعذَروا لإهمالهم الشريعة\n { قل هلُم } أي: أحضروا\n { شهداءكم } أي: كبراءكم وأئمتكم\n { الذين يشهدون أن الله حرّم هذا } \n استحضرهم ليلزمهم الحجة\n ويَظهر بانقطاعهم ضلالهم\n وألاَّ متمسك لهم في ذلك\n ثم قال لنبيه ـ عليه الصلاة والسلام ـ: { فإن شهدوا } بشيء من ذلك\n { فلا تشهد معهم } أي: لا تصدقهم وبيِّن لهم فساده { ولا تتبع أهواء الذين كذبوا بآياتنا } \n والأصل أن يقول: ولا تتبع أهواءهم\n فوضع الظاهر موضع المضمر\n للدلالة على أن مكذب الآية متبع للهوى لا غير\n وأن متبع الحق لا يكون إلا مصدقًا لها\n { و } تتبع أيضًا { الذين لا يؤمنون بالآخرة } كعبدة الأوثان\n { وهم بربهم يعدلون } يجعلون له عديلاً ومثيلاً\n\nالإشارة: اعلم أن الحقّ جلّ جلاله كلف عباده في هذا الدار\n بالقيام بوظيفتين: الشريعة والحقيقة\n الشريعة محلها الظواهر\n والحقيقة محلها البواطن\n الشريعة تقتضي التكليف\n والحقيقة تقتضي التعريف\n الشريعة شهود الحكمة\n والحقيقة شهود القدرة\n وجعل الشريعة رداء الحقيقة ولباسًا لها\n ثم جعل سبحانه في القلب عينين\n وتسمى البصيرة\n إحداهما تنظر للحكمة فتقوم بالشرائع\n والأخرى تنظر للقدرة فتقوم بالحقائق\n فقوم فتحوا عين الحقيقة وأعموا عين الشريعة\n وهم أهل الكفر والزندقة\n ولذلك قالوا: { لو شاء الله ما أشركنا } \n وقوم فتحوا عين الشريعة وأهملوا عين الحقيقة\n وهم عوام المسلمين من أهل اليمن\n فلذلك طال خصمهم للمقادير الأزلية مع إقرارهم بها\n فإن أنكروها فقد عَمِيَتْ بصيرتهم\n وقوم أحبهم الله\n ففتح لهم عين الحقيقة\n فأسندوا الأفعال كلها إلى الله ولم يروا معه سواه\n فتأدبوا في الباطن مع الأشياء كلها\n وفتح لهم عين الشريعة فقاموا بوظائف العبودية على المنهاج الشرعي\n وهم الأولياء العارفون بالله\n فمن تمسك بالحقائق العلمية دون الشرائع كان زنديقًا\n ومن تمسك بالشرائع دون الحقائق كان فاسقًا\n ومن تمسك بهما كان صدِّيقًا\n فمن رام تمسك بالشرائع\n ولم تُسعفه الأقدار\n فإن كان عن سُكر وجذب فهو معذور\n وإن كان عن كسل فهو مخذول\n وإن كان عن إنكار لها فهو مطرود معدود من حزب الشيطان\n والعياذ بالله\n ثم بَيَّن ما حرم عليهم\n فقال: { قُلْ تَعَالَوْاْ أَتْلُ مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:18",
      "similarity": 0.46144214794445143
    },
    {
      "verse": "42:15",
      "similarity": 0.20036829031636816
    },
    {
      "verse": "4:135",
      "similarity": 0.16527696416417856
    },
    {
      "verse": "65:2",
      "similarity": 0.13477610310445073
    },
    {
      "verse": "6:1",
      "similarity": 0.1265535053585834
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/6:150.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/6:150.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:150.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}