{
  "chapter": "الأنعام",
  "text": "وان هذا صرطى مستقيما فاتبعوه ولا تتبعوا۟ السبل فتفرق بكم عن سبيله ذلكم وصىكم به لعلكم تتقون",
  "translations": [
    {
      "translation": "This is My Path and it is straight, so follow it. Do not follow other ways or you will become cut off from His Way. That is what He instructs you to do, so that hopefully you will have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He has further commanded:) 'This is My straight path, so walk along it, and do not follow other ways, lest you should turn away from the right one.' All this has He commanded. You may perhaps take heed for yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(x) This is My way -that which is straight: follow it, then, and do not follow other paths lest they scatter you from His path. This is what He has enjoined upon you, so that you may beware.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is My path and it is straight. Follow it and not other paths which will lead you far away from the path of God. Thus does God guide you so that you may become pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And that, ‘This is My Straight Path, so follow it; and do not follow other ways for they will sever you from His way; this is commanded to you, so that you may attain piety.’”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, this is My straight path, so follow it, and follow not (other) paths, for they will separate you away from His path. This He has ordained for you that you may have Taqwa.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (know) that this is My path, the right one therefore follow it, and follow not (other) ways, for they will lead you away from His way; this He has enjoined you with that you may guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that this is My path, straight; so do you follow it, and follow not divers paths lest they scatter you from His path. That then He has charged you with; haply you will be godfearing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (He commandeth you, saying): This is My straight path, so follow it. Follow not other ways, lest ye be parted from His way. This hath He ordained for you, that ye may ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[He has enjoined], \"This is My straight path; so follow it, and do not follow other ways: that will lead you away from His path.\" That is what He enjoins upon you, so that you may guard yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that: verily this is my path, straight; follow it then, and follow not other ways; that will deviate you from His way. Thus He enjoineth you, that haply ye may fear God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘This indeed is my straight path, so follow it, and do not follow [other] ways, for they will separate you from His way. This is what He enjoins upon you so that you may be Godwary.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, this is My way, leading straight: follow it: follow not (other) paths: they will scatter you about from His (great) path: thus doth He command you. that ye may be righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, this (i.e. Allah's Commandments mentioned in the above two Verses 151 and 152) is my Straight Path, so follow it, and follow not (other) paths, for they will separate you away from His Path. This He has ordained for you that you may become Al-Muttaqun (the pious - see V. 2:2).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Path of Mine is straight. Follow it and do not follow other paths, for they will scatter you away from His Path. With such Allah charges you, in order that you be cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is My path, straight, so follow it. And do not follow the other paths, lest they divert you from His path. All this He has enjoined upon you, that you may refrain from wrongdoing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And, [moreover], this is My path, which is straight, so follow it; and do not follow [other] ways, for you will be separated from His way. This has He instructed you that you may become righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:153] And that (read anna, with lām [of li-anna, ‘because’] being implied, or inna, as beginning a new sentence) this, that I have charged you with, is My straight path (mustaqīman, ‘straight’, is a circumstantial qualifier), so follow it; and do not follow other ways, paths opposed to it, lest it separate you (tafarraqa: one of the two letters tā’ [of the original tatafarraqa] has been omitted) make you incline, away from His way, His religion. This is what He has ordained for you, that perhaps you will be God-fearing’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (He commandeth you, saying): This) Islam (is My straight path) it is well established and I am pleased with it, (so follow it. Follow not other ways) i.e. Judaism, Christianity and Zoroastrianism, (lest ye be parted from His way) from His religion: (This hath He ordained for you) He commanded for you in the Book, (that ye may ward off (evil)) that you may ward off these different ways.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وأن هذا } أي: طريق الفضائل لأن منبع الفضيلة هي الوحدة\n ألا ترى أنها أواسط واعتدالات بين طرفي إفراط وتفريط لا يمكن سلوكها على التعيين بالحقيقة إلا لمن استقام في دين الله إليه وأيده الله بالتوفيق لسلوك طريق الحق حتى وصل إلى الفناء عن صفاته ثم عن ذاته\n ثم اتصف في حال البقاء بعد الفناء بصفاته تعالى حتى قام بالله فاستقام فيه وبه فحينئذ يكون صراطه صراط الحق وسيره سير الله { صراطي مستقيماً } أي: طريقي لا يسلكها إلا من قام بي مستوياً غير مائل إلى اليمين والشمال لغرض { فاتّبعوه ولا تتّبعوا السبل } من المذاهب المتفرقة والأديان المختلفة فإنها أوضاع وضعها أهل الاحتجاب بالعادات والأهواء\n أي: وضع لهم لئلا يزدادوا ظلمة وعتوّاً وحيرة\n وروى ابن مسعود\n \" عن رسول الله صلى الله عليه وسلم\n أنه خطّ خطّاً فقال: \" هذا سبيل الرشاد \" \" \n\n ثم خطّ عن يمينه وشماله خطوطاً فقال:\n \" هذه سبل على كل سبيل منها شيطان يدعو إليه \" \nثم تلا هذه الآية: { فتفرّق بكم عن سبيله ذلكم } أي: سلوك طريق الوحدة والفضيلة { وصّاكم به لعلكم تتقون } السبل المتفرقة بالاجتناب عن مقتضيات الأهواء ودواعي النفوس وتجعلون الله وقاية لكم في ملازمة الفضائل ومجانبة الرذائل",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأنَّ هذا } أي: ما تقدم في السورة كلها\n { صراطي مستقيمًا فاتبعوه } لأن السورة بأسرها إنما هي في إثبات التوحيد\n والنبوة\n وبيان الشريعة\n { ولا تتبعوا السُّبل } الأديان المختلفة والطرق التابعة للهوى\n فإن مقتضى الحجة واحد\n ومقتضى الهوى متعدد لاختلاف الطبائع والعادات\n ولذلك تَفرقت\n والمراد بالطرق: اليهودية والنصرانية وغيرهما من الأديان الباطلة\n ويدخل فيه البدع والأهواء\n وفي الحديث أن النبي صلى الله عليه وسلم خط خطًا\n ثم قال:\n \" هذا سبيل الله \" \n\n ثم خط خطوطًا عن يمينه وشماله\n ثم قال:\n \" هذه سُبُلٌ\n وعلى كُلِّ سبيلٍ منها شيطانٌ يَدعُو إليها \" \n{ ذلكم } الاتباع { وصّاكم به لعلكم تتقون } الضلال والتفرق عن الحق\n وبالله التوفيق\n الإشارة: قد وصّى الحقّ ـ جلّ جلاله ـ على التخلص من الشرك\n جليه وخفيه\n ولا يكون إلا بتحقيق الإخلاص والتوحيد الخاص\n وهو مطلب الصوفية\n وبالإحسان بالوالدين الروحانيين والبشريين\n أي: والد الأرواح ـ وهو الشيخ المربي ـ ووالد الأشباح\n ولا بد للمريد من طاعتهما\n إلاَّ أنه يقدم طاعة الشيخ\n كما تقدم عن الجنيد في  سورة النساء\n ووصى بعدم قتل الأولاد\n وهم المواهب والعلوم بإهمال القلب في الغفلة\n وعدم قرب الفواحش: الظاهرة الحسية\n والباطنية القلبية كالحسد\n والكبر\n وحب الجاه والدنيا\n وسائر العيوب\n وعدم قتل النفس بالانهماك في الهوى والغفلة حتى تموت بالجهل عن المعرفة\n وعدم قرب مال اليتيم\n وهو الذي ليس له شيخ\n فإن الغالب عليه عدم المسامحة\n وسيأتي عند قوله تعالى:\n[الأعرَاف:143]\n إشارة لها أرق من هذه\n وعلى التوفية في الأمور كلها لأن الصوفي من أهل الصفاء والوفاء\n وعلى الصدق في الأقوال والأفعال والأحوال\n وعلى الوفاء بالعهد\n وأعظمها عهد الشيوخ المُربين\n وعلى اتباع طريق السلوك الموصلة للحضرة وهي ما عينه الشيوخ للمريدين\n فلا يتعدى نظرهم ولو لحظة\n وبالله التوفيق\n ولما ذكر ما وصى به هذه الأمة\n ذكر ما وصى به بني إسرائيل\n فقال: { ثُمَّ آتَيْنَا مُوسَى ٱلْكِتَابَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "90:17",
      "similarity": 0.5118119220201455
    },
    {
      "verse": "36:50",
      "similarity": 0.4962954347157732
    },
    {
      "verse": "103:3",
      "similarity": 0.4941338945235189
    },
    {
      "verse": "51:53",
      "similarity": 0.48257231533803296
    },
    {
      "verse": "4:131",
      "similarity": 0.4011808167099937
    }
  ]
}