{
  "chapter": "الأنعام",
  "text": "قل تعالوا۟ اتل ما حرم ربكم عليكم الا تشركوا۟ به شيـا وبالولدين احسنا ولا تقتلوا۟ اولدكم من املق نحن نرزقكم واياهم ولا تقربوا۟ الفوحش ما ظهر منها وما بطن ولا تقتلوا۟ النفس التى حرم الله الا بالحق ذلكم وصىكم به لعلكم تعقلون",
  "translations": [
    {
      "translation": "Say: 'Come and I will recite to you what your Lord has made haram for you': that you do not associate anything with Him; that you are good to your parents; that you do not kill your children because of poverty - We will provide for you and them; that you do not approach indecency - outward or inward; that you do not kill any person Allah has made inviolate - except with the right to do so. That is what He instructs you to do so that hopefully you will use your intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"Come, I will read out what your Lord has made binding on you: That you make none the equal of God, and be good to your parents, and do not abandon your children out of poverty, for We give you food and We shall provide for them; and avoid what is shameful, whether open or hidden, and do not take a life which God has forbidden, unless for some just cause. These things has God enjoined on you. Haply you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them (O Muhammad!): 'Come, let me recite what your Lord has laid down to you: (i) that you associate nothing with Him; (ii) and do good to your parents; (iii) and do not slay your children out of fear of poverty. We provide you and will likewise provide them with sustenance; (iv) and do not even draw to things shameful - be they open or secret; (v) and do not slay the soul santified by Allah except in just cause; this He has enjoined upon you so that you may understand;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"Let me tell you about what your Lord has commanded: Do not consider anything equal to God; Be kind to your parents; Do not murder your children out of fear of poverty, for We give sustenance to you and to them. Do not even approach indecency either in public or in private. Take not a life which God has made sacred except by way of justice and law. Thus does He command you that you may learn wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Come – so that I may recite to you what your Lord has forbidden for you that ‘Do not ascribe any partner to Him and be good to parents; and do not kill your children because of poverty; We shall provide sustenance for all – you and them; and do not approach lewd things, the open among them or concealed; and do not unjustly kill any life which Allah has made sacred; this is the command to you, so that you may have sense.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Come, I will recite what your Lord has prohibited you from: Join not anything in worship with Him; be kind and dutiful to your parents; kill not your children because of poverty -- We provide sustenance for you and for them. Come not near to Al-Fawahish (immoral sins) whether committed openly or secretly; and kill not anyone whom Allah has forbidden, except for a just cause. This He has commanded you that you may understand.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Come I will recite what your Lord has forbidden to you-- (remember) that you do not associate anything with Him and show kindness to your parents, and do not slay your children for (fear of) poverty-- We provide for you and for them-- and do not draw nigh to indecencies, those of them which are apparent and those which are concealed, and do not kill the soul which Allah has forbidden except for the requirements of justice; this He has enjoined you with that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Come, I will recite what your Lord has forbidden you: that you associate not anything with Him, and to be good to your parents, and not to slay your children because of poverty; We will provide you and them and that you approach not any indecency outward or inward, and that you slay not the soul God has forbidden, except by right. That then He has charged you with; haply you will understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Come, I will recite unto you that which your Lord hath made a sacred duty for you: That ye ascribe no thing as partner unto Him and that ye do good to parents, and that ye slay not your children because of penury - We provide for you and for them - and that ye draw not nigh to lewd things whether open or concealed. And that ye slay not the life which Allah hath made sacred, save in the course of justice. This He hath command you, in order that ye may discern.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Come! I will tell you what your Lord has really forbidden you! Do not associate anything with Him; be good to your parents; and do not kill your children for fear of poverty, We shall provide sustenance for you as well as for them, refrain from committing indecent deeds, whether openly or in secret; and do not kill the life which God has made sacred, save by right. That is what He has enjoined upon you, so that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: come, I shall recite that which your Lord hath forbidden unto you: associate not aught with Him, and shew kindness unto the parents, and slay not your offspring for fear of want - We it is who shall provide for you and them -and approach not indecencies, whatsoever is open thereof and whatsoever is concealed, and slay not anyone whom Allah hath forbidden except for justification. Thus He enjoineth you that haply ye may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Come, I will recount what your Lord has forbidden you. That you shall not ascribe any partners to Him, and you shall be good to the parents, you shall not kill your children due to penury—We will provide for you and for them—you shall not approach indecencies, the outward among them and the inward ones, and you shall not kill a soul [whose life] Allah has made inviolable, except with due cause. This is what He has enjoined upon you so that you may exercise your reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Come, I will rehearse what Allah hath (really) prohibited you from\": Join not anything as equal with Him; be good to your parents; kill not your children on a plea of want;- We provide sustenance for you and for them;- come not nigh to shameful deeds. Whether open or secret; take not life, which Allah hath made sacred, except by way of justice and law: thus doth He command you, that ye may learn wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Come, I will recite what your Lord has prohibited you from: Join not anything in worship with Him; be good and dutiful to your parents; kill not your children because of poverty - We provide sustenance for you and for them; come not near to Al-Fawahish (shameful sins, illegal sexual intercourse, etc.) whether committed openly or secretly, and kill not anyone whom Allah has forbidden, except for a just cause (according to Islamic law). This He has commanded you that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Come, I will recite to you what your Lord forbids you; that you shall associate anything with Him; that you shall be good to your parents, that you shall not kill your children because of poverty, We provide for you and for them, that you shall not commit foul deeds whether openly or in secret, and that you shall not kill the soul that Allah has forbidden except by right. With such Allah charges you, in order that you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Come, let me tell you what your Lord has forbidden you: that you associate nothing with Him; that you honor your parents; that you do not kill your children because of poverty—We provide for you and for them; that you do not come near indecencies, whether outward or inward; and that you do not kill the soul which God has sanctified—except in the course of justice. All this He has enjoined upon you, so that you may understand.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Come, I will recite what your Lord has prohibited to you. [He commands] that you not associate anything with Him, and to parents, good treatment, and do not kill your children out of poverty; We will provide for you and them. And do not approach immoralities - what is apparent of them and what is concealed. And do not kill the soul which Allah has forbidden [to be killed] except by [legal] right. This has He instructed you that you may use reason.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:151] Say: ‘Come, I will recite that which your Lord has made a sacred duty for you: that (allā: [consisting of anlā] an being explicative) you associate nothing with Him, that you be dutiful to parents, and that you do not slay your children, by burying them alive, because of poverty, destitution, that you may fear — We will provide for you and them — and that you do not draw near any acts of lewdness, grave sins, such as fornication, whether it be manifest or concealed, that is, [acts committed] overtly or in secret, and that you do not slay the life which God has made sacred, except rightfully, as in the case of retaliation, or [as] the prescribed punishment for apostasy, and the stoning of an adulterer. This, which is mentioned, is what He has charged you with, that perhaps you will understand, reflect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي للانتقال من إبطال تحريم ما ادّعوا تحريمه من لحوم الأنعام ، إلى دعوتهم لمعرفة المحرّمات ، التي علمُها حقّ وهو أحقّ بأنْ يعلموه ممّا اختلقوا من افترائهم وموّهوا بجدلهم . والمناسبة لهذا الانتقال ظاهرة فالمقام مقامُ تعليم وإرشاد ، ولذلك ابتدىء بأمر الرّسول عليه الصّلاة والسّلام بفعل القول استرعاء للأسماع كما تقدّم آنفاً .وعُقّب بفعل : { تعالوا } اهتماماً بالغرض المنتقل إليه بأنَّه أجدى عليهم من تلك السّفاسف التي اهتمّوا بها وهذا على أسلوب قوله تعالى : { ليس البِرّ أن تولّوا وجوهكم قبل المشرق والمغرب ولكنّ البرّ من آمن بالله واليوم الآخر } \\[ البقرة : 177 \\] الآيات . وقوله : { أجعلتم سقاية الحاج وعمارة المسجد الحرام كَمَنْ آمن بالله واليوم الآخر } \\[ التوبة : 19 \\] الآية ، ليعلموا البون بين ما يَدعون إليه قومهم وبين ما يدعوهم إليه الإسلام ، من جلائل الأعمال ، فيعلموا أنَّهم قد أضاعوا أزمانهم وأذهانهم .وافتتاحه بطلب الحضور دليل على أنّ الخطاب للمشركين الذين كانوا في إعراض . وقد تلا عليهم أحكاماً قد كانوا جارين على خلافها ممّا أفسد حالهم في جاهليتهم ، وفي ذلك تسجيل عليهم بسوء أعمالهم ممّا يؤخذ من النّهي عنها والأمر بضدّها .وقد انقسمت الأحكام التي تضمّنتها هذه الجمل المتعاطفة في الآيات الثّلاث المفتتحة بقوله : { قل تعالوا أتل ما حرم ربكم عليكم } إلى ثلاثة أقسام :الأوّل : أحكام بها إصلاح الحالة الاجتماعية العامَّة بين النّاس وهو ما افتتح بقوله : { ألاَّ تشركوا به شيئاً }.الثّاني : ما به حفظ نظام تعامل النّاس بعضِهم مع بعض وهو المفتتح بقوله : { ولا تَقْرَبوا مال اليتيم } \\[ الأنعام : 152 \\].الثّالث : أصل كلي جامع لجميع الهدى وهو اتّباع طريق الإسلام والتّحرّز من الخروج عنه إلى سبل الضّلال وهو المفتتح بقوله : { وأنّ هذا صراطي مستقيماً فاتبعوه } \\[ الأنعام : 153 \\].وقد ذيّل كلّ قسم من هذه الأقسام بالوصاية به بقوله : { ذلكم وصاكم به } ثلاث مرّات .و ( تعالَ ) فعل أمر ، أصله يُؤْمر به من يراد صعوده إلى مكان مرتفع فوق مكانه ، ولعلّ ذلك لأنَّهم كانوا إذا نَادوا إلى أمر مهمّ ارتقَى المنادي على ربوة ليُسمَع صوته ، ثمّ شاع إطلاق ( تَعالَ ) على طلب المجيء مجازاً بعلاقة الإطلاق فهو مجاز شائع صار حقيقة عرفية ، فأصله فعل أمر لا محالة من التعالي وهو تكلّف الاعتلاء ثمّ نقل إلى طلب الإقبال مطلقاً ، فقيل : هو اسم فعللِ أمر بمعنى ( اقدَمْ ) ، لأنَّهم وجدوه غير متصرّف في الكلام إذ لا يقال : تعاليتُ بمعنى ( قَدِمت ) ، ولا تعالَى إليّ فلان بمعنى جاء ، وأيّاً ما كان فقد لزمته علامات مناسبة لحال المخاطب به فيقال : تعالوا وتَعالَيْن . وبذلك رجَّح جمهور النّحاة أنَّه فعل أمر وليس باسْم فِعل ، ولأنَّه لو كان اسم فعل لما لحقتْه العلامات ، ولكان مثل : هَلُمّ وهَيْهات .و { أتْلُ } جواب { تعالوا } ، والتّلاوة القراءة ، والسّردُ وحكاية اللّفظ ، وقد تقدّم عند قوله تعالى : { واتبعوا ما تتلوا الشياطين على ملك سليمان } \\[ البقرة : 102 \\]. و { ألاَّ تشركوا } تفسير للتّلاوة لأنَّها في معنى القول .وذُكرَت فيما حرّم الله عليهم أشياءُ ليست من قبيل اللّحوم إشارة إلى أنّ الاهتمام بالمحرّمات الفواحش أولى من العكوف على دراسة أحكام الأطعمة ، تعريضاً بصرف المشركين همتّهم إلى بيان الأطعمة وتضييعهم تزكية نفوسهم وكفّ المفاسد عن النّاس ، ونظيره قوله : { قل من حرّم زينة الله التي أخرج لعباده إلى قوله إنَّما حرم ربِّي الفواحش ما ظهر منها } \\[ الأعراف : 32 ، 33 \\] الآية .وقد ذُكرت المحرّمات : بعضها بصيغة النّهي ، وبعضها بصيغة الأمر الصّريح أو المؤوّل ، لأنّ الأمر بالشّيء يقتضي النّهي عن ضدّه ، ونكتة الاختلاف في صيغة الطّلب لهاته المعدودات سنبيّنها .و { أنْ } تفسيرية لفعل : { أتل } لأنّ التّلاوة فيها معنى القول . فجملة : { ألا تشركوا } في موقع عطف بيان . والابتداء بالنَّهي عن الإشراك لأنّ إصلاح الاعتقاد هو مفتاح باب الإصلاح في العاجل ، والفلاح في الآجل .وقوله : { وبالوالدين إحسانا } عطف على جملة : { ألاَّ تشركوا }.و { إحسانا } مصدر ناب مناب فعله ، أي وأحسنوا بالوالدين إحساناً ، وهو أمر بالإحسان إليهما فيفيد النّهي عن ضدّه : وهو الإساءة إلى الوالدين ، وبذلك الاعتبار وقع هنا في عداد ما حَرّم الله لأنّ المحرّم هو الإساءة للوالدين . وإنَّما عدل عن النّهي عن الإساءة إلى الأمر بالإحسان اعتناء بالوالدين ، لأن الله أراد برهما ، والبرّ إحسان ، والأمرُ به يتضمّن النَّهي عن الإساءة إليهما بطريق فحوى الخطاب ، وقد كان كثير من العرب في جاهليتهم أهل جلافة ، فكان الأولاد لا يوقّرون آباءهم إذا أضعفهم الكبر . فلذلك كثرت وصاية القرآن بالإحسان بالوالدين .وقوله : { ولا تقتلوا أولادكم من إملاق } جملة عطفت على الجملة قبلها أريد به النّهي عن الوأد ، وقد تقدّم بيانه عند قوله تعالى في هذه السّورة ( 137 ) : { وكذلك زيّن لكثير من المشركين قتل أولادهم شركاؤهم } و ( مِنْ ) تعليلية ، وأصلها الابتدائيّة فجعل المعلول كأنَّه مبتدىء من علّته .والإملاق : الفقر ، وكونه علّة لقتل الأولاد يقع على وجهين : أن يكون حاصلاً بالفعل ، وهو المراد هنا ، وهو الذي تقتضيه ( من ) التّعليلية ، وأن يكون متوقَّع الحصول كما قال تعالى ، في آية سورة الإسراء ( 31 ) : { ولا تقتلوا أولادكم خشية إملاق } لأنَّهم كانوا يئدون بناتهم إمّا للعجز عن القيام بهنّ وإمَّا لتوقّع ذلك . قال إسحاق بن خلف ، وهو إسلامي قديم :إذَا تذكرتُ بنتي حين تندبني ... فاضت لعبرة بنتي عبرتي بدمأحاذر الفقر يوماً أن يُلِمّ بها ... فيُكشفَ السترُ عن لحم على وضموقد تقدّم عند قوله تعالى : وكذلك زيَّن لكثير من المشركين قتل أولادهم شركاؤهم } في هذه السورة ( 137 ).وجملة : { نحن نرزقكم وإياهم } معترضة ، مستأنفة ، علّة للنّهي عن قتلهم ، إبطالاً لمعذرتهم : لأنّ الفقر قد جعلوه عذراً لقتل الأولاد ، ومع كون الفقر لا يصلح أن يكون داعياً لقتل النّفس ، فقد بيّن الله أنَّه لمّا خَلق الأولاد فقد قدّر رزقهم ، فمن الحماقة أن يظنّ الأب أنّ عجزه عن رزقهم يخوّله قتلهم ، وكان الأجدر به أن يكتسِبَ لهم .وعُدل عن طريق الغيبة الذي جرى عليه الكلام من قوله : { ما حرم ربكم } إلى طريق التكلّم بضمير : نرزقكم تذكيراً بالذي أمر بهذا القول كلّه ، حتى كأنّ الله أقحمَ كلامَه بنفسه في أثناء كلام رسوله الّذي أمره به ، فكلّم النّاس بنفسه ، وتأكيداً لتصديق الرسول صلى الله عليه وسلموذكَرَ الله رزقهم مع رزق آبائهم ، وقدم رزق الآباء للإشارة إلى أنَّه كما رزق الآباء ، فلم يموتوا جوعاً ، كذلك يرزق الأبناء ، على أن الفقر إنَّما اعترى الآباء فلِمَ يُقتل لأجله الأبناء .وتقديم المسند إليه على المسند الفعلي . هنا لإفادة الاختصاص : أي نحن نرزقكم وإيَّاهم لا أنتم ترزقون أنفسكم ولا ترزقون أبناءكم . وقد بيّنتُ آنفاً أنّ قبائل كثيرة كانت تئد البنات . فلذلك حذروا في هذه الآية .وجملة : { ولا تقربوا الفواحش ما ظهر منها وما بطن } عطف على ما قبله . وهو نهي عن اقتراف الآثام ، وقد نهى عن القرب منها ، وهو أبلغ في التّحذير من النّهي عن ملابستها : لأنّ القرب من الشّيء مظنّة الوقوع فيه ، ولمّا لم يكن للإثم قرب وبعد كان القرب مراداً به الكناية عن ملابسة الإثم أقلّ ملابسة ، لأنَّه من المتعارف أن يقال ذلك في الأمور المستقرة في الأمكنة إذا قيل لا تقرب منها فُهم النّهي عن القرب منها ليكون النّهي عن ملابستها بالأحرى ، فلمّا تعذّر المعنى المطابقي هنا تعيّنت إرادة المعنى الالتزامي بأبلغ وجه .والفواحش : الآثام الكبيرة ، وهي المشتملة على مفاسد ، وتقدّم بيانها عند قوله تعالى : { إنَّما يأمركم بالسّوء والفحشاء } في سورة البقرة ( 169 ).وما ظهر منها } ما يظهرونه ولا يسْتَخْفُون به ، مثل الغضب والقذف . { وما بطن } ما يستخْفون به وأكثره الزّنا والسّرقة وكانا فاشيين في العرب .ومن المفسّرين من فسّر الفواحش بالزّنا ، وجعل ما ظهر منها ما يفعله سفهاؤهم في الحوانيت وديار البغايا ، وبما بطَن اتَّخاذ الأخدان سِرّاً ، وروي هذا عن السُدّي . وروي عن الضحّاك وابن عبّاس : كان أهل الجاهليّة يرون الزّنا سِراً حلالاً ، ويستقبحونه في العلانية ، فحرّم الله الزّنى في السرّ والعلانية . وعندي أن صيغة الجمع في الفواحش ترجح التّفسير الأوّل كقوله تعالى : { الذين يجتنبون كبائر الإثم والفواحش إلا اللمم } \\[ النجم : 32 \\]. ولعلّ الذي حمل هؤلاء على تفسير الفواحش بالزّنى قوله في سورة الإسراء ( 32 ) في آيات عَدَّدت منهيات كثيرة تشابه آيات هذه السورة وهي قوله : { ولا تقربوا الزنا إنه كان فاحشة وساء سبيلاً } وليس يلزم أن يكون المراد بالآيات المتماثلة واحداً .وتقدّم القول في : { ما ظهر منها وما بطن } عند قوله تعالى : { وذروا ظاهر الإثم وباطنه } في هذه السّورة ( 120 .( وأعقب ذلك بالنّهي عن قتل النّفس ، وهو من الفواحش على تفسيرها بالأعمّ ، تخصيصاً له بالذّكر : لأنَّه فساد عظيم ، ولأنّه كان متفشياً بين العرب .والتّعريف في النّفس تعريف الجنس ، فيفيد الاستغراق .ووصفت بالتي حَرّم الله } تأكيداً للتّحريم بأنَّه تحريم قديم فإنّ الله حرّم قتل النّفس من عهد آدم ، وتعليق التّحريم بالنّفس : هو على وجه دلالة الاقتضاء ، أي حرّم الله قتلها على ما هو المعروف في تعليق التّحريم والتّحليل بأعيان الذّوات أنَّه يراد تعليقه بالمعنى الذي تستعمل تلك الذّات فيه كقوله : { أحلّت لكم بهيمة الأنعام } \\[ المائدة : 1 \\] أي ، أكلها ، ويجوز أن يكون معنى : { حرم الله } جعلها الله حَرَماً أي شيئاً محترماً لا يعتدى عليه ، كقوله تعالى : { إنَّما أمرت أن أعبد ربّ هذه البلدة الذي حرمها } \\[ النمل : 91 \\]. وفي الحديث : « وإنِّي أحَرّم ما بين لابَتَيْها » .وقوله : { إلا بالحق } استثناء مفرّغ من عموم أحوال ملابسة القتل ، أي لا تقتلوها في أيَّة حالة أو بأي سبب تنتحلونه إلاّ بسبب الحقّ ، فالباء للملابسة أو السببيّة .والحقّ ضدّ الباطل ، وهو الأمر الذي حَقّ ، أي ثبت أنّه غير باطل في حكم الشّريعة وعند أهل العقول السّليمة البريئة من هوى أو شهوة خاصّة ، فيكونُ الأمرَ الذي اتَّفقت العقول على قبوله ، وهو ما اتَّفقت عليه الشّرائع ، أو الذي اصطلح أهل نزعة خاصّة على أنَّه يحقّ وقوعه وهو ما اصطلحت عليه شريعة خاصّة بأمّة أو زمن .فالتّعريف في : { الحق } للجنس ، والمراد به ما يتحقّق فيه ماهية الحقّ المتقدّم شرحها ، وحيثما أطلق في الإسلام فالمراد به ماهيته في نظر الإسلام ، وقد فصّل الإسلام حقّ قتل النّفس بالقرآن والسنّة ، وهو قتل المحارب والقصاص ، وهذان بنصّ القرآن ، وقتل المرتدّ عن الإسلام بعد استتابَته ، وقتل الزّاني المحصن ، وقتل الممتنع من أداء الصّلاة بعد إنظاره حتّى يخرج وقتها ، وهذه الثّلاثة وردت بها أحاديث عن النّبيء صلى الله عليه وسلم ومنه القتل الناشىء عن إكراه ودفاععٍ مأذوننٍ فيه شرعاً وذلك قتل من يُقتل من البغاة وهو بنصّ القرآن ، وقتل من يقتل من مانعي الزّكاة وهو بإجماع الصّحابة ، وأمّا الجهاد فغير داخل في قوله : { إلا بالحق } ، ولكنّ قتل الأسير في الجهاد إذا كان لمصلحة كان حقّاً ، وقد فصلنا الكلام على نظير هذه الآية في سورة الإسراء .والإشارة بقوله : { ذلكم وصاكم به } إلى مجموع ما ذكر ، ولذلك أفرد اسم الإشارة باعتبار المذكور ، ولو أتى بإشارة الجمع لكان ذلك فصيحاً ، ومنه : { كل أولئك كان عنه مسؤلاً } \\[ الإسراء : 36 \\].وتقدّم معنى الوصاية عند قوله : { أم كنتم شهداء إذ وصّاكم الله بهذا } \\[ الأنعام : 144 \\] آنفاً .وقوله : { لعلكم تعقلون } رجاء أن يعقلوا ، أي يصيروا ذوي عقول لأنّ ملابسة بعض هذه المحرّمات ينبىء عن خساسة عقل ، بحيث ينزّل ملابسوها منزلة من لا يعقل ، فلذلك رُجي أن يعقلوا .وقوله : { ذلكم وصاكم به لعلكم تعقلون } تذييل جعل نهاية للآية ، فأومأ إلى تنهية نوع من المحرّمات وهو المحرّمات الرّاجع تحريمها إلى إصلاح الحالة الاجتماعيّة للأمّة ، بإصلاح الاعتقاد ، وحفظ نظام العائلة والانكفاف عن المفاسد ، وحفظ النّوع بترك التّقاتل .\n\n",
      "translations": [
        {
          "translation": "(Say) Muhammad to Malik Ibn 'Awf and his fellows: (Come, I will recite unto you that which your Lord hath made a sacred duty for you) in the Scripture that was revealed to me: (that ye ascribe no thing as partner unto Him) the first thing is that you do not associate with Him any of the idols (and that you do good to parents) you be dutiful to parents, (and that ye slay not your children) your daughters (because of penury) out of fear of humiliation and poverty. (We provide for you and for them) i.e. for your children (and that ye draw not nigh to lewd things) fornication (whether open) i.e. open fornication (or concealed) taking lovers in secret. (And that ye slay not the life which Allah hath made sacred, save in the course of justice) as a result of cases such as retaliation, stoning, apostasy. (This He hath commanded you) in the Qur'an, (in order that you may discern) His command and divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تَقْتُلُوۤاْ أَوْلاَدَكُمْ مِّنْ إمْلاَقٍ } معناهُ من فَقرٍ وَفَاقَةٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And do not kill your children from {famaraq},\" means from poverty and need.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ قل تعالوا أتلُ ما حرّم ربّكم عليكم } لما أثبت أن المشركين في التحريم والتحليل يتّبعون أهواءهم، إذ الشرك في نفسه ليس إلا عبادة الهوى والشيطان. فلما احتجبوا بصفات النفس عن صفات الحق، وأمّروا عليهم الهوى وعبدوه وأطاعوا أوامره ونواهيه في التحريم والتحليل، بيّن أن التحريم والتحليل المتّبع فيهما أمر الله تعالى ما هما، ولما كان الكلام معهم في تحريم الطيبات عدّد المحرمات ليستدل بها على المحللات فحصر جميع أنواع الفضائل بالنهي عن أجناس الرذائل وابتدأ بالنهي عن رذيلة القوة النطقية التي هي أشرفها. فإن رذيلتها أكبر الكبائر، مستلزمة لجميع الرذائل، بخلاف رذيلة أخويها من القوّتين البهيمية والسبعية فقال: { ألا تشركوا به شيئاً } إذ الشرك من خطئها في النظر وقصورها عن استعمال العقل ودرك البرهان وعقّبه بإحسان الوالدين، إذ معرفة حقوقهما تتلو معرفة الله في الإيجاد والربوبية لأنهما سببان قريبان في الوجود والتربية وواسطتان جعلهما الله تعالى مظهرين لصفتي إيجاده وربوبيته، ولهذا قال صلى الله عليه وسلم:\n \" من أطاع الوالدين فقد أطاع الله ورسوله \" \nفعقوقهما يلي الشرك ولا يقع الجهل بحقوقهما إلا عن الجهل بحقوق الله تعالى ومعرفة صفاته، ثم بالنهي عن قتل الأولاد خشية الفقر، فإن ارتكاب ذلك لا يكون إلا عن الجهل والعمى عن تسبيبه تعالى الرزق لكل مخلوق وأن أرزاق العباد بيده يبسط الرزق لمن يشاء ويقدر. والاحتجاب عن سرّ القدر، فلا يعلم أن الأرزاق مقدّرة بإزاء الأعمار كتقدير الآجال، فأولاها لا تقع إلا من خطئها في معرفة ذات الله تعالى، والثانية من خطئها في معرفة صفاته، والثالثة من معرفة أفعاله فلا يرتكب هذه الرذائل الثلاث إلا منكوس، محجوب عن ذات الله تعالى وصفاته وأفعاله وهذه الحجب أم الرذائل وأساسها. ثم بيّن رذيلة القوة البهيمية لأن رذيلتها أظهر وأقدم، فقال: { ولا تقربوا الفواحش } من الأعمال القبيحة الشنيعة عند العقل { ما ظهر منها } كالزنا في الحانات، وشرب الخمر وأكل الربا { وما بَطن } كقصد هذه الفواحش المذكورة ونيتها والهمّ بها وإخفائها كالسرقة وارتكاب المحظورات في الخفية. ثم أشار إلى رذيلة القوّة السبعية بقوله: { ولا تقتلوا النفس التي حرّم الله إلاّ بالحق } أي: بالقصاص والكفر، وختم الكلام بقوله: { ذلكم } اي: الاجتناب عن أجناس رذائل النفوس الثلاث { وصاكم به لعلكم تعقلون } أي: لا تجتنبها إلا العقلاء ومن ارتكبها فلا عقل له.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم يا أكمل الرسل على مقتضى شفقة النبوة: { تَعَالَوْاْ } أيها التائهون في بيداء الضلال { أَتْلُ } وأعد لكم { مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ } في نشأتكم الدنيا\n أولاها وعظماها: { أَلاَّ تُشْرِكُواْ بِهِ شَيْئاً } من مصنوعاته\n إذ هو أحد صمد فرد وتر ليس لغيره وجود حتى يشاركه ويماثله { وَ } أن تفعلوا { بِٱلْوَالِدَيْنِ } اللذين هما سببان قريبان لظهوركم إلا { إِحْسَاناً } لإحسانهما إليكم في حفظكم وحضانتكم { وَ } أن { لاَ تَقْتُلُوۤاْ أَوْلاَدَكُمْ } ظلماً ناشئاً { مِّنْ } خوف { إمْلاَقٍ } فقر وقلة\n إذ { نَّحْنُ نَرْزُقُكُمْ وَإِيَّاهُمْ } وأن { وَلاَ تَقْرَبُواْ ٱلْفَوَاحِشَ } القبيح { مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَلاَ تَقْتُلُواْ ٱلنَّفْسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلاَّ بِٱلْحَقِّ } كالقود وقتل المرتد ورجم الزاني المحصن وغيرها من المحارم التي رخص الشرع بارتكابها\n إذا ارتكابها من جملة المحللات والمأمورات { ذٰلِكُمْ } المذكور مفصلاً مما { وَصَّاكُمْ بِهِ لَعَلَّكُمْ تَعْقِلُونَ } [الأنعام: 151] رجاء أن تسترشدوا لتهتدوا إلى توحيده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { تعالوا }: أمر من التعالي\n وأصله: أن يقوله من كان في علو لمن كان في سفل\n فاتسع فيه بالتعميم في كل أمر بالقدوم\n و { ألاَّ تشركوا }: فيه تأويلات أحدها: أن تكون مفسرة لا موضع لها\n و { لا }: ناهية جزمت الفعل\n أو تكون مصدرية في موضع رفع\n أي: الأمر ألاَّ تشركوا\n و { لا }: نافية حينئذٍ\n أو بدل من { ما } و { لا }: زائدة\n أو على حذف الإغراء\n أي: عليكم إلا تشركوا\n قال ابن جزي: والأحسن أن يكون ضَمَّنَ { حرَّم } معنى وَصَّى\n وتكون { أن } مصدرية\n و { لا } نافية\n ولا تفسد المعنى لأن الوصية في المعنى تكون بتحريم وتحليل وبوجوب وندب\n ويدل على هذا قوله بعد ذلك: { ذلكم وصاكم به } ولا ينكر أن يريد بالتحريم ـ الوصية لأن العرب قد تذكر اللفظ الخاص\n وتريد به العموم\n كما تذكر اللفظ العام وتريد به الخصوص\n فتقدير الكلام على هذا: قل تعالوا أتل ما وصاكم به ربكم\n ثم أبدل منه\n على وجه التفسير والبيان\n فقال: ألاَّ تشركوا\n ووصاكم بالإحسان بالوالدين\n وهكذا\n\n فجمعت الوصية ترك الإشراك وفعل الإحسان بالوالدين\n وما بعد ذلك\n انظر بقية كلامه\n وإنما قال الحق سبحانه: { من إملاق } \n وقدّم الكاف في قوله { نرزقكم } \n وفي الإسراء قال:\n[الإِسرَاء:31]\n وأخر الكاف لأن ما هنا نزل في فقراء العرب\n فكان الإملاق نازلاً بهم وحاصلاً لديهم\n فلذلك قال: { من إملاق } \n وقدم الخطاب لأنه أهم\n وفي الإسراء نزلت في أغنيائهم\n فكانوا يقتلون خوفًا من لحوق الفقر\n لذلك قال: { خشية إملاق } \n وقدم الغيبة فقال: { نحن نرزقهم } حين نخلقهم وإياكم\n يقول الحقّ جلّ جلاله: { قل } لهم: { تعالَوا } أي: هلموا\n { أتلُ } أي: أقرأ { ما حرم ربكم عليكم } \n واجتمعت عليه الشرائع قبلكم\n ولم يُنسخ قط في ملة من الملل\n بل وصى به جميع الملل\n و { ألاَّ تُشركوا به شيئًا } بل توحدوه وتعبدوه وحده\n { و } أن تحسنوا { بالوالدين إحسانًا } \n ولا تُسيئوا إليهما لأن من أساء إليهما لم يحسن إليهما\n { ولا تقتلوا أولادكم من إملاق } أي: من أجل الفقر الحاصل بكم\n وكانت العرب تقتل أولادها خوفًا من الفقر فنزلت فيهم\n فلا يفهم منه إباحة قتلهم لغيره\n { نحن نرزقكم وإياهم } \n فلا تهتموا بأمرهم حتى تقتلوهم\n { ولا تقربوا الفواحش } كبار الذنوب { ما ظهر منها } للناس { وما بَطَنَ } في خلوة\n أو: ما ظهر منها على الجوارح\n وما بطن في القلوب من العيوب\n { ولا تقتلوا النفس التي حرَّم الله إلا بالحق } كالقود\n وقتل المرتد\n ورجم المحصن\n قال صلى الله عليه وسلم:\n \" لا يحلُّ دَمُ امرىءٍ مُسلمٍ إلا بإحدى ثلاثٍ: زِنَىً بعد إحصَانٍ\n وكُفرٍ بعد إيمَانٍ\n وقَتل نَفسٍ بغيرِ نَفسٍ \" \n \n{ ذلكم } المتقدم\n { وصّاكم به لعلكم تعقلون } \n فتتدبرون فيما ينفعكم وما يضركم\n { ولا تقربوا مال اليتيم إلا بالتي } بالخصلة التي { هي أحسن } كحفظه وتثميره\n والنهي عن القرب: يعم وجوه التصرف\n وفيه سد الذريعة لأنه إذا نهى عن القرب كان الأكل أولى",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:31",
      "similarity": 0.7672431165513515
    },
    {
      "verse": "7:33",
      "similarity": 0.25366942825742056
    },
    {
      "verse": "4:131",
      "similarity": 0.19271086196820897
    },
    {
      "verse": "29:8",
      "similarity": 0.15226545100906333
    },
    {
      "verse": "2:180",
      "similarity": 0.14893257820106762
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006151.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006151.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:151.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}