{
  "chapter": "الأنعام",
  "text": "هل ينظرون الا ان تاتيهم الملئكة او ياتى ربك او ياتى بعض ءايت ربك يوم ياتى بعض ءايت ربك لا ينفع نفسا ايمنها لم تكن ءامنت من قبل او كسبت فى ايمنها خيرا قل انتظروا۟ انا منتظرون",
  "translations": [
    {
      "translation": "What are they waiting for but for the angels to come to them or for your Lord Himself to come, or for one of your Lord's Signs to come? On the day that one of your Lord's Signs does come, no iman which a self professes will be of any use to it if it did not have iman before and earn good in its iman. Say: 'Wait, then; We too are waiting.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What are the people waiting for? For the angels to come down, or your Lord to appear, or some signs from your Lord? The day when certain signs appear from your Lord, the embracing of faith shall not be of any avail to one who did not come to belief at first, or who did not perform good deeds by virtue of his faith. Tell them: \"Wait on, we are waiting too (for the good and evil to become distinct).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Do they wait either for the angels to appear before them or for your Lord to come unto them or for some clear signs of your Lord to appear before them? When some clear signs of your Lord will appear, believing will be of no avail to anyone who did not believe before, or who earned no good deeds through his faith. Say: 'Wait on; we too are waiting.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting until the angels or your Lord come to them or for some miracles to take place? On the day when some miracles of God will take place, the belief of any soul will be of no avail to it unless some good deeds have been done with it, or it has been formed before the coming of such a day. (Muhammad), tell them, \"Wait and we, too, are waiting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What are they waiting for – except that the angels come to them, or the punishment from your Lord, or one of the signs of your Lord? On the day when the (foretold) sign of your Lord comes, not a single soul who had not earlier accepted faith nor earned any good from its faith, will benefit from accepting faith; say, “Wait – we too are waiting.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they then wait for anything other than that the angels should come to them, or that your Lord should come, or that some of the Signs of your Lord should come! The day that some of the signs of your Lord do come, no good will it do to a person to believe then, if he believed not before, nor earned good with his faith. Say: \"Wait you! We (too) are waiting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not wait aught but that the angels should come to them, or that your Lord should come, or that some of the signs of your Lord should come. On the day when some of the signs of your Lord shall come, its faith shall not profit a soul which did not believe before, or earn good through its faith. Say: Wait; we too are waiting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, do they look for the angels to come to them, nothing less, or that thy Lord should come, or that one of thy Lord's signs should come? On the day that one of thy Lord's signs comes it shall not profit a soul to believe that never believed before, or earned some good in his belief. Say: 'Watch and wait; We too are waiting.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wait they, indeed, for nothing less than that the angels should come unto them, or thy Lord should come, or there should come one of the portents from thy Lord? In the day when one of the portents from thy Lord cometh, its belief availeth naught a soul which theretofore believed not, nor in its belief earned good (by works). Say: Wait ye! Lo! We (too) are waiting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting for the angels or your Lord to come down to them, or for some of your Lord's signs to come? The day when some of the signs of your Lord shall come, it shall not profit any human being who did not believe before, or who did not do any good by his faith. Say to them, \"Wait then, we too are waiting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They await indeed that the angel should come unto them, or that thy Lord should come or that certain of the signs of thy Lord should come. On the Day whereon certain of the signs of thy Lord will come, belief will not profit any person who had not believed theretofore or had not earned any good by his belief. Say thou: so wait ye verily we also are waiting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not consider that the angels may come to them, or your Lord may come, or some of your Lord’s signs may come? The day when some of your Lord’s signs do come, faith shall not benefit any soul that had not believed beforehand and had not earned some goodness in its faith. Say, ‘Wait! We too are waiting!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting to see if the angels come to them, or thy Lord (Himself), or certain of the signs of thy Lord! the day that certain of the signs of thy Lord do come, no good will it do to a soul to believe in them then if it believed not before nor earned righteousness through its faith. Say: \"Wait ye: we too are waiting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they then wait for anything other than that the angels should come to them, or that your Lord should come, or that some of the Signs of your Lord should come (i.e. portents of the Hour e.g., arising of the sun from the west)! The day that some of the Signs of your Lord do come, no good will it do to a person to believe then, if he believed not before, nor earned good (by performing deeds of righteousness) through his Faith. Say: \"Wait you! we (too) are waiting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting for the angels or your Lord to come to them, or for some of the signs of your Lord? On the Day when some of the signs of your Lord come, no soul will be benefited by its belief had it not believed before or earned good in its belief. Say: 'Wait, we are waiting'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting for anything but for the angels to come to them, or for your Lord to arrive, or for some of your Lord’s signs to come? On the Day when some of your Lord’s signs come, no soul will benefit from its faith unless it had believed previously, or had earned goodness through its faith. Say, “Wait, we too are waiting.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they [then] wait for anything except that the angels should come to them or your Lord should come or that there come some of the signs of your Lord? The Day that some of the signs of your Lord will come no soul will benefit from its faith as long as it had not believed before or had earned through its faith some good. Say, \"Wait. Indeed, we [also] are waiting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:158] Are they waiting — the deniers are indeed waiting — for nothing less than that the angels should come to them (read ta’tīyahum or ya’tīyahum), to seize their souls, or that your Lord, that is, His command, meaning His chastisement, should come, or that one of your Lord’s signs should come?, that is, those portents of His that indicate [the arrival of] the Hour? On the day that one of your Lord’s signs comes — and this is the rising of the sun from the west, as reported in the hadīth of the two Sahīhs [of Bukhārī and Muslim] — it shall not benefit a soul to believe if it had not believed theretofore (lam takun āmanat min qabl is an adjectival qualification of nafs, ‘a soul’) or, a soul which had not [until then], earned in its belief some good, some [act of] obedience, that is to say, its repentance shall be of no benefit to it, as [stated] in the hadīth [corpus]. Say: ‘Wait, for one of these things, We too are waiting’, for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف بياني نشأ في قوله : { فمن أظلم ممن كذب بآيات الله } \\[ الأنعام : 157 \\] الآية ، وهو يحتمل الوعيد ويحتمل التهكّم ، كما سيأتي . فإن كان هذا وعيداً وتهديداً فهو ناشىء عن جملة : { سنجزي الذين يصدفون عن آياتنا } \\[ الأنعام : 157 \\] لإثارته سؤال سائل يقول : متى يكون جزاؤهم ، وإن كان تهكّما بهم على صدفهم عن الآيات التي جاءتهم ، وتطلّعهم إلى آيات أعظم منها في اعتقادهم ، فهو ناشىء عن جملة : { فمن أظلم ممن كذب بآيات الله وصدف عنها } \\[ الأنعام : 157 \\] لأنَّه يثير سؤال سائل يقول : ماذا كانوا يترقَّبون من الآيات فوق الآيات التي جاءتهم .و { هل } للاستفهام الإنكاري ، وهي ترد له كما ترد له الهمزة على التّحقيق ، ولذلك جاء بعده الاستثناء .و { ينظرون } مضارع نَظَر بمعنى انتظر ، وهو مشترك مع نظر بمعنى رأى في الماضي والمضارع والمصدر ، ويخالفه في التّعدية ، ففِعل نَظَر العين متعدّ بإلى ، وفعل الانتظار متعدّ بنفسه ، ويخالفه أيضاً في أنّ له اسم مصدر وهو النظِرة بكسر الظاء ولا يقال ذلك في النّظر بالعين . والضّمير عائد للّذين يصدفون عن الآيات .ثمّ إنْ كان الانتظار واقعاً منهم على أنَّه انتظار آيات ، كما يقترحون ، فمعنى الحصر : أنَّهم ما ينتظرون بعد الآيات التي جاءتهم ولم يقتنعوا بها إلاّ الآيات التي اقترحوها وسألوها وشرطوا أن لا يؤمنوا حتّى يُجاءوا بها ، وهي ما حكاه الله عنهم بقوله : { وقالوا لن نؤمن لك حتى تفجر لنا من الأرض ينبوعاً } إلى قوله { أو تأتي بالله والملائكة قبيلا } \\[ الإسراء : 90 92 \\] وقوله { وقالوا لولا أنزل عليه ملك } \\[ الأنعام : 8 \\] فهم ينتظرون بعض ذلك بجِدّ من عامتَّهم ، فالانتظار حقيقة ، وبسخرية من قادتهم ومضلّليهم ، فالانتظار مجاز بالصّورة ، لأنَّهم أظهروا أنفسهم في مظهر المنتظرين ، كقوله تعالى : { يحذر المنافقون أن تنزل عليهم سورة تنبّئهم بما في قلوبهم قل استهزءوا } \\[ التوبة : 64 \\] الآية . والمراد ببعض آيات ربّك : ما يشمل ما حكي عنهم بقوله : { حتى تفجر لنا من الأرض ينبوعاً إلى قوله حتى تنزل علينا كتاباً نقرؤه } \\[ الإسراء : 90 93 \\]. وفي قوله : { وقالوا لولا أنزل عليه ملك } إلى قوله { فحاق بالذين سخروا منهم ما كانوا به يستهزئون } \\[ الأنعام : 8 10 \\] فالكلام تهكّم بهم وبعقائدهم .وإن كان الانتظار غير واقع بجدّ ولا بسخرية فمعناه أنَّهم ما يترقَّبون شيئاً من الآيات يأتيهم أعظم ممَّا أتاهم ، فلا انتظار لهم ، ولكنّهم صمّموا على الكفر واستبطنوا العناد ، فإن فرض لهم انتظار فإنَّما هو انتظار ما سيَحل بهم من عذاب الآخرة أو عذاب الدّنيا أو ما هو برزخ بينهما ، فيكون الاستنثاء تأكيداً للشّيء بما يشبه ضدّه . والمراد : أنَّهم لا ينتظرون شيئاً ولكن سيجيئهم ما لا ينتظرونه ، وهو إتيان الملائكة ، إلى آخره ، فالكلام وعيد وتهديد .والقصر على الاحتمالين إضافي ، أي بالنّسبة لما ينتظر من الآيات ، والاستفهام الخبري مستعمل في التهكّم بهم على الاحتمالين ، لأنَّهم لا ينتظرون آية ، فإنَّهم جازمون بتكذيب الرّسول صلى الله عليه وسلم ولكنّهم يسألون الآيات إفحاماً في ظنّهم .ولا ينتظرون حساباً لأنَّهم مكذّبون بالبعث والحشر .والإتيان بالنّسبة إلى الملائكة حقيقة ، والمراد بهم : ملائكة العذاب ، مثل الّذين نزلوا يوم بدر { إذ يوحي ربّك إلى الملائكة أنّي معكم فثبّتوا الذين آمنوا سألقي في قلوب الذين كفروا الرّعب فاضربوا فوق الأعناق واضربوا منهم كلّ بنان } \\[ الأنفال : 12 \\]. وأمّا المسند إلى الرّب فهو مجاز ، والمراد به : إتيان عذابه العظيم ، فهو لعظم هوله جعل إتيانه مسنداً إلى الآمر به أمراً جازماً ليعرف مقدار عظمته ، بحسب عظيم قدرة فاعله وآمره ، فالإسناد مجازي من باب : بنى الأمير المدينة ، وهذا مجاز وارد مثله في القرآن ، كقوله تعالى : { فأتاهم الله من حيث لم يحتسبوا } \\[ الحشر : 2 \\] وقوله : { ووجد الله عنده فوفّاه حسابه } \\[ النور : 39 \\]. ويجوز أن يكون المراد بقوله : { أو يأتي ربك } إتيان أمره بحساب النّاس يوم القيامة ، كقوله : { وجاء ربك والملك صفا صفاً } \\[ الفجر : 22 \\] ، أي لا ينتظرون إلاّ عذاب الدّنيا أو عذاب الآخرة .وعلى الاحتمالات كلّها يجوز أن يكون وقوع ذلك يوم القيامة ، ويجوز أن يكون في الدّنيا .وجملة : { يوم يأتي بعض آيات ربك لا ينفع نفساً إيمانها } مستأنفة استئنافاً بيانياً تذكيراً لهم بأنّ الانتظار والتريّث عن الإيمان وخِيمُ العاقبة ، لأنَّه مهدّد بما يمنع من التّدارك عند النّدامة ، فإمَّا أن يعقبه الموت والحساب ، وإمّا أن يعقبه مجيء آية من آيات الله ، وهي آية عذاب خارق للعادة يختصّ بهم فيعلموا أنَّه عقوبة على تكذيبهم وصَدْفهم ، وحين ينزّل ذلك العذاب لا تبقى فسحة لتدارك ما فات لأنّ الله إذا أنزل عذابه على المكذّبين لم ينفع عنده توبة ، كما قال تعالى : { فلولا كانت قرية آمنت فنفعها إيمانها إلا قوم يونس لما آمنوا كشفنا عنهم عذاب الخزي في الحياة الدنيا ومتعناهم إلى حين } \\[ يونس : 98 \\] وقال تعالى : { ما ننزل الملائكة إلا بالحق وما كانوا إذاً منظرين } \\[ الحجر : 8 \\] وقال { ولو أنزلنا ملكاً لقضي الأمر ثم لا ينظرون } \\[ الأنعام : 8 \\].ومن جملة آيات الله الآيات التي جعلها الله عامّة للنّاس ، وهي أشراط السّاعة : والتي منها طلوع الشّمس من مغربها حين تُؤذن بانقراض نظام العالم الدنيوي . روى البخاري ، ومسلم ، عن أبي هريرة ، قال : قال رسول الله صلى الله عليه وسلم « لا تقوم السّاعة حتّى تطلع الشمس من مغربها فإذا طلعت ورآها النّاس آمنوا أجمعون وذلك حينَ لا ينفع نفساً إيمانها لم تكن آمنت من قبل » ثمّ قرأ هذه الآية .والنّفع المنفي هو النّفع في الآخرة ، بالنّجاة من العذاب ، لأنّ نفع الدّنيا بكشف العذاب عند مجيء الآيات لا ينفع النّفوس المؤمنة ولا الكافرة ، لقوله تعالى :{ واتقوا فتنة لا تصيبن الذين ظلموا منكم خاصة } \\[ الأنفال : 25 \\] وقول رسول الله صلى الله عليه وسلم « ثمّ يحشرون على نياتهم » . والمراد بالنّفس : كلّ نفس ، لوقوعه في سياق النّفي .وجملة : { لم تكن آمنت من قبل } صفة { نفساً } ، وهي صفة مخصّصة لعموم : { نفساً } ، أي : النّفس التي لم تكن آمنت من قبل إتيان بعض الآيات لا ينفعها إيمانها إذا آمنت عند نزول العذاب ، فعلم منه أنّ النّفس التي كانت آمنت من قبل نزول العذاب ينفعها إيمانها في الآخرة . وتقديم المفعول في قوله : { نفساً إيمانها } ليتمّ الإيجاز في عود الضّمير .وقوله : { أو كسبت في إيمانها خيراً } عطف على { آمنت } ، أي أو لم تكن كسبت في إيمانها خيراً .و { في } للظرفيّة ، وإنَّما يصلح للظرفية مدّة الإيمان ، لا الإيمان ، أي أو كسبت في مدّة إيمانها خيراً . والخير هو الأعمال الصّالحة والطّاعات .و { أو } للتّقسيم في صفات النّفس فيستلزم تقسيم النّفوس التي خصّصتها الصّفتان إلى قسمين : نفوس كافرة لم تكن آمنت من قبل ، فلا ينفعها إيمانها يوم يأتي بعض آيات الله ، ونفوس آمنت ولم تكسب خيراً في مدّة إيمانها ، فهي نفوس مؤمنة ، فلا ينفعها ما تكسبه من خير يوم يأتي بعض آيات ربّك . وهذا القسم الثّاني ذو مراتب متفاوتة ، لأنّ التّقصير في اكتساب الخير متفاوت ، فمنه إضاعة لأعمال الخير كلّها ، ومنه إضاعة لبعضها ، ومنه تفريط في الإكثار منها . وظاهر الآية يقتضي أن المراد نفوس لم تكسب في إيمانها شيئاً من الخير أي اقتصرت على الإيمان وفرّطت في جميع أعمال الخير .وقد علم من التّقسيم أنّ هذه النّفوس لا ينفعها اكتساب الخير من بعد مجيء الآيات ، ولا ما يقوم مقام اكتساب الخير عند الله ، وهو ما منّ به على هذه الأمّة من غفران السيّئات عند التّوبة ، فالعزم على الخير هو التّوبة ، أي العزم على اكتساب الخير ، فوقع في الكلام إيجازُ حذف اعتمَاداً على القرينة الواضحة . والتّقدير : لا ينفع نفساً غيرَ مؤمنة إيمانُها أو نفساً لم تكن كسبت خيراً في إيمانها من قبل كسبها ، يعني أو ما يقوم مقام كسب الخير ، مثل التّوبة فإنَّها بعض اكتساب الخير ، وليس المراد أنّه لا ينفع نفساً مؤمنة إيمانُها إذا لم تكن قد كسبت خيراً بحيث يضيع الإيمان إذا لم يقع اكتساب الخير ، لأنَّه لو أريد ذلك لما كانت فائدة للتّقسيم ، ولكفى أن يقال لا ينفع نفساً إيمانها لم تكسب خيراً ، ولأنّ الأدلّة القطعية ناهضة على أن الإيمان الواقع قبل مجيء الآيات لا يُدْحَض إذا فرّط صاحبه في شيء من الأعمال الصّالحة ، ولأنَّه لو كان كذلك وسلَّمناه لما اقتضى أكثر من أنّ الّذي لم يفعل شيئاً من الخير عدا أنَّه آمن لا ينفعه إيمانه ، وذلك إيجاد قسم لم يقل به أحد من علماء الإسلام .وبذلك تعلم أنّ الآية لا تنهض حجّة للمعتزلة ولا الخوارج الذين أوجبوا خلود مرتكب الكبيرة غير التّائب في النّار ، والتّسويةَ بينه وبين الكافر ، وإن كان ظاهرُها قبل التأمّل يوهم أنَّها حجّة لهم ، ولأنّه لو كان الأمر كما قالوا لصار الدّخول في الإيمان مع ارتكاب كبيرة واحدة عبثاً لا يرضاه عاقل لنفسه ، لأنّه يدخل في كلفةِ كثيرٍ من الأعمال بدون جدوى عليه منها ، ولكان أهون الأحوال على مرتكب الكبيرة أن يخلع ربقة الإيمان إلى أن يتوب من الأمرين جميعاً . وسخافة هذا اللازم لأصحاب هذا المذهب سخافة لا يرضاها من له نظر ثاقب . 6 والاشتغال بتبيين ما يستفاد من نظم الآية من ضبط الحدّ الذي ينتهي عنده الانتفاع بتحصيل الإيمان وتحصيل أعمال الخير ، أجدى من الخوض في لوازم معانيها من اعتبار الأعمال جُزْءاً من الإيمان ، لا سيّما مع ما في أصل المعنى من الاحتمال المسقط للاستدلال .فصفة : { لم تكن آمنت من قبل } تحذير للمشركين من التريُّث عن الإيمان خشية أن يبغتهم يومُ ظهور الآيات ، وهم المقصود من السّياق . وصفة { أو كسبت في إيمانها خيراً } إدماج في أثناء المقصود لتحذير المؤمنين من الإعراض عن الأعمال الصّالحة .ثمّ إنّ أقوال المفسرين السّالفين ، في تصوير هذين القسمين ، تفرّقت تفرّقاً يؤذن باستصعاب استخلاص مقصود الآية من ألفاظها ، فلم تقارب الإفصاح بعبارة بيّنة ، ويجمع ذلك ثلاثة أقوال :الأوّل : عن السدّي ، والضحاك : أنّ معنى { كسبت في إيمانها خيراً } : كسبت في تصديقها ، أي معه أو في مدّته ، عملاً صالحاً ، قَالا : وهؤلاء أهلُ القبلة ، فإن كانت مُصدّقة ولم تعمل قبل ذلك ، أي إتيان بعض آيات الله ، فعمِلت بعد أن رأت الآية لم يُقبل منها ، وإن عملتْ قبل الآية خيراً ثمّ عملت بعد الآية خيراً قُبل منها .الثّاني : أنّ لفظ القرآن جرى على طريقة التّغليب ، لأنّ الأكثر ممّن ينتفع بإيمانه ساعتئذ هو من كسب في إيمانه خيراً .الثّالث : أنّ الكلام إبهام في أحد الأمرين ، فالمعنى : لا ينفع يومئذ إيمان من لم يكن آمن قبل ذلك اليوم أو ضمّ إلى إيمانه فعل الخير ، أي لا ينفع إيمان من يؤمن من الكفار ولا طاعة من يطيع من المؤمنين . وأمّا من آمن قبل فإنَّه ينفعه إيمانه ، وكذلك من أطاع قبلُ نفعته طاعته .وقد كان قوله : { يوم يأتي بعض آيات ربك } بعد قوله : { هل ينظرون إلا أن تأتيهم الملائكة أو يأتي ربك أو يأتي بعض آيات ربك } ، مقتصراً على ما يأتي من آيات الله في اليوم المؤجّل له ، إعراضاً عن التعرّض لما يكون يوم تأتي الملائكة أو يأتي ربّك ، لأنّ إتيان الملائكة ، والمعطوف عليه غير محتمَل الوقوع وإنَّما جرى ذكره إبطالاً لقولهم : { أو تأتي باللَّه والملائكة قَبيلاً } \\[ الإسراء : 92 \\] ونحوه من تهكّماتهم ، وإنَّما الذي يكون ممّا انتظروه هو أن يأتي بعض آيات الله ، فهو محلّ الموعظة والتّحذير ، وآيات القرآن في هذا كثيرة منها قوله تعالى :{ فلم يك ينفعهم إيمانهم لما رأوا بأسنا } \\[ غافر : 85 \\].وآياتُ اللَّه منها ما يختصّ بالمشركين وهو ما هدّدهم الله به من نزول العذاب بهم في الدّنيا ، كما نزل بالأمم من قبلهم ، ومنها آيات عامّة للنّاس أجمعين ، وهو ما يُعرف بأشراط السّاعة ، أي الأشراط الكبرى .وقد جاء تفسير هذه الآية في السنّة بطلوع الشّمس من مغربها . ففي «الصّحيحين» وغيرهما عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم \" لا تقوم السّاعة حتّى تطلع الشّمس من مغربها فإذا رآها النّاس آمَن مَنْ عليها فذلك حينَ لا ينفع نفساً إيمانها لم تكن آمنت من قبل \" . ثمّ قرأ هذه الآية ، أي قوله تعالى : { يوم يأتي بعض آيات ربك } إلى قوله { خيراً }.وفي «صحيح مسلم» عن أبي هريرة قال : قال رسول الله صلى الله عليه وسلم \" من تاب قبل طلوع الشّمس من مغربها تاب الله عليه \" . وفي «جامع التّرمذي» ، عن صفوان بن عسال المرادي قال : قال رسول الله صلى الله عليه وسلم \" بابٌ مِن قِبل المغرب مفتوح مسيرة عَرضه أربعين سنة ( كذا ) مفتوح للتَّوبة لا يُغلق حتّى تطلُع الشّمس من مغربها \" قال التّرمذي : حديث صحيح .واعلم أنّ هذه الآية لا تعارض آية سورة النّساء ( 18 ) : { وليست التوبة للذين يعملون السيئات حتى إذا حضر أحدهم الموت قال إني تبت الآن ولا الذين يموتون وهم كفار } لأنّ محمل تلك الآية على تعيين وقت فوات التّوبة بالنّسبة للأحوال الخاصّة بآحاد النّاس ، وذلك ما فُسّر في حديث ابن عمر : أنّ رسول الله قال : إنّ الله يقبل توبة العبد ما لم يُغَرْغِرْ رواه التّرمذي ، وابن ماجه ، وأحمد . ( ومعنى يغرغر أن تبلغ روحه أي أنفاسه رأْس حلقه ). ومحمل الآية التي نتكلّم فيها تعيين وقت فوات التّوبة بالنّسبة إلى النّاس كافة ، وهي حالة يأس النّاس كلّهم من البقاء .وجاء الاستئناف بقوله : قل انتظروا إنا منتظرون } أمراً للرّسول صلى الله عليه وسلم بأن يهدّدهم ويتوعّدهم على الانتظار ، إن كان واقعاً منهم ، أو على التريُّثثِ والتّأخّر عن الدّخول في الإسلام الذي هو شبيه بالإنتظار إن كان الانتظار إدّعائياً ، بأن يأمرهم بالدّوام على حالهم التي عبّر عنها بالانتظار أمْرَ تهديد ، ويخبرهم بأنّ المسلمين ينتظرون نصر الله ونزول العقاب بأعدائهم ، أي : دوموا على انتظاركم فنحن منتظرون .وفي مفهوم الصّفتين دلالة على أنّ النّفس التي آمنت قبل مجيء الحساب ، وكسبت في إيمانها خيراً ، ينفعها إيمانها وعملها . فاشتملت الآية بمنطوقها ومفهومها على وعيد ووعد مُجملين تبيّنهما دلائل الكتاب والسنّة .\n\n",
      "translations": [
        {
          "translation": "(Wait they) i.e. the people of Mecca, (indeed, for nothing less than that the angels should come unto them) to take their souls away at the moment of death, (or thy Lord should come) on the Day of Judgement, and His coming is without modality, (or there should come one of the portents from thy Lord) i.e. the rising of the sun from the West? (In the day when one of the portents from they Lord cometh) before the rising of the sun from the West, (its belief availeth naught a soul which theretofore) before the rising of the sun from the West (believed not, nor in its belief earned good) nor was it sincere in its belief, nor doing any good works before the rising of the sun from the West. This is because no faith, works or repentance are accepted from an unbeliever who embraces Islam upon seeing the sun rise from the West, unless that person is young at that time or is born after. In such a case, if he leaves Islam after the sun rises from the West and then returns to Islam, his repentance is accepted. Likewise, the repentance of a sinning believer who repents of his sins after the sun rises from the West is accepted. (Say) Muhammad to the people of Mecca: (Wait you) the Day of Judgement! (Lo! We (too) are waiting) for your punishment on the Day of Judgement or before the Day of Judgement; it is also said that this means: Say, Muhammad, wait for my destruction, I am also waiting for yours.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { هَلْ يَنظُرُونَ إِلاَّ أَن تَأْتِيهُمُ ٱلْمَلاۤئِكَةُ } معناهُ تَنتَظرُونَ\n قالَ زيدُ بن علي عليهما السَّلامُ: { هَلْ يَنظُرُونَ إِلاَّ أَن تَأْتِيهُمُ ٱلْمَلاۤئِكَةُ } قالَ: المَوتُ: { أَوْ يَأْتِيَ رَبُّكَ } قال: القِيامةُ { أَوْ يَأْتِيَ بَعْضُ آيَاتِ رَبِّكَ } قالَ: هُوَ طُلُوعُ الشَّمسِ مِن مَغْرِبِهَا\n\n",
      "translations": [
        {
          "translation": "\n\nDo they not expect that the angels will come to them?\n\n\nZayd ibn Ali said, {Do they only look for that the angels should come to them?} He said, Death. {Or that your Lord should come?} He said, The Resurrection. {Or that some of the signs of your Lord should come?} He said, It is the rising of the sun from its setting.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "{ هل ينظرون إلا أن تأتيهم الملائكة } لتوفي روحهم { أو يأتي ربّك } بتجلية في جميع الصفات كما مرّت الإشارة إليه من تحوّل الصورة في القيامة، فلا يعرفه إلا الموحدون الكاملون. وأما أهل المذاهب والملل المختلفة فلا يعرفونه إلا في صورة معتقدهم { أو يأتي بعض آيات ربّك } تجليه في بعض الصفات التي لم يعرفوه بها { يوم يأتي بعض آيات ربّك } بعض تجلياته التي لم يأنسوا بها أو لم يعرفوها { لا ينفع نفساً إيمانها لم تكن آمنت من قَبل } فإنّ الناس إما محجوبون مطلقاً أو ليسوا كذلك، وهم إما مؤمنون لعرفانهم ببعض الصفات أو بكلها، والمؤمنون به العارفون إياه بكلها إما محبون للذات وإما محبون للصفات، فإذا تجلى الحق ببعض الصفات لا ينفع إيمان المحجوبين مطلقاً، وإيمان المؤمنين الذين لم يعرفوه بهذه الصفة من قبل هذا التجلي، إذ الإيمان إنما ينفع إذا صار عقيدة ثابتة راسخة يتمثل بها القلب وتتنوّر بها النفس وتشاهد بها الروح، لا الذي يقع عند الاضطرار دفعة { أو كسبت في إيمانها خيراً } كإيمان العارفين، المحبّين للصفات، فإنهم وإن آمنوا به وعرفوا بتجليه بكل الصفات. فلما لم يكتسبوا المحبة الذاتية، والكمال المطلق، وأحبّوه ببعض الصفات، كالمنعم مثلاً أو اللطيف أو الرحيم فإذا تجلى بصفة المنتقم أو القهّار أو المبلي لم ينفعهم الإيمان به، إذ لم يطيعوه من قبل بهذا الوصف ولم يتمرّنوا بتجليه ولم يحبّوا الذات فيلتذوا بشهوده في أي صفة كانت.",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ هَلْ يَنظُرُونَ } أي: ما ينتظرون ويسوفون أمر الإيمان { إِلاَّ أَن تَأْتِيهُمُ ٱلْمَلاۤئِكَةُ } أي: ملائكة العذاب كما أتوا الأمم الماضية فتلجئهم إلأيه { أَوْ يَأْتِيَ رَبُّكَ } أي: يطلبون إيتان ربك عناداً كما طلب اليهود حين قالوا: { أَرِنَا ٱللَّهَ جَهْرَةً } [النساء: 153] { أَوْ يَأْتِيَ بَعْضُ ءَايَاتِ رَبِّكَ } الدالة على انقضاء النشأة الأولى المسمى بأشراط الساعة\n وبالجملة: { يَوْمَ يَأْتِي بَعْضُ ءَايَاتِ رَبِّكَ لاَ يَنفَعُ نَفْساً إِيمَانُهَا } لكونها ملجئة إليه حين اضطرارها\n ولا عبرة للإيمان حين البأس والإلجاء\n إذ الإيمان تعبدي برهاني اختياري { لَمْ تَكُنْ ءَامَنَتْ مِن قَبْلُ } أي: نفساً لم تكن آمنت قبل ظهور المجلئ { أَوْ } لم تكن { كَسَبَتْ } وإن آمنت { فِيۤ إِيمَٰنِهَا خَيْراً } مقبولاً عند الله { قُلِ } للمنتظرين استهزاءاً: { ٱنتَظِرُوۤاْ } إلى ما تخيلتم وتوهمتم { إِنَّا مُنتَظِرُونَ } [الأنعام: 158] أيضاً إلى حلول الوقت المعلوم ونزول العذاب فيه عليكم بكفركم وشرككم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { هل ينظرون } أي: ما ينتظر أهل مكة { إلا أن تأتيهم الملائكة } لقبض أرواحهم، أو بالعذاب، لأجل كفرهم، وهم لم يكونوا ينتظرون ذلك، ولكن لما كان يلحقهم لحوق المنتظر شبهوا بالمنتظرين، { أو يأتي ربك } أي: أمره بالعذاب، { أو يأتي بعض آيات ربك } يعني: أشراط الساعة. وعن حذيفة والبراء بن عازب: كنا نتذاكر الساعة، إذ أشرق علينا رسول الله صلى الله عليه وسلم، فقال:\n \" ما تداكرون \" \nقلنا: نتذاكر الساعة، فقال:\n \" إنها لا تقوم حتى تروا قبلها عشر آيات: الدجال ودابة الأرض، وخسفًا بالمشرق، وخسفًا بالمغرب، وخسفًا بجزيرة العرب، والدخان، وطلوع الشمس من مغربها، ويأجوج ومأجوج، ونزول عيسى، ونارًا تخرج من عدن \". \n{ يوم يأتي بعض آيات ربك } ، وهو طلوع الشمس من مغربها، كما في حديث الصحيحين، قال الأقليشي: وذلك أن الله تعالى، إذا أراد طلوعها من مغربها، حبسها ليلة تحت العرش، فكلما سجدت وأستأذنت لم يجر لها جواب، حتى يحبسها مقدار ثلاث ليال، فيأتيها جبريل عليه السلام فيقول: إن الرب تعالى يأمرك أن ترجعي إلى مغربك فتطلعي منه، وأنه لا ضوء لك عندنا ولا نور، فتبكي عن ذلك بكاء يسمعها أهل السبع سماوات، ومن دونها، وأهل سرادقات العرش وحملته من فوقها، فيبكون لبكائها مما يخالطهم من خوف الموت، وخوف يوم القيامة، قال: فيبيت الناس ينتظرون طلوعها من المشرق، فتطلع الشمس والقمر خلف أقفيتهم من الغرب، أسودين مُكدرين، كالقارتين، ولا ضوء للشمس ولا نور للقمر، فيتصايح أهل الدنيا، وتذهل الأمهات عن أولادها، والأحبة عن ثمرة قلوبها، فتشتغل كل نفس بنفسها، ولا ينفع التوحيد حينئذٍ. هـ. وهو معنى قوله تعالى: { يوم يأتي بعض آيات ربك لا ينفع نفسًا إيمانها } كالمحتضر إذا صار الأمر عيانًا، وإنما ينفع الإيمان بالغيب، وقد فات يومئذٍ، فلا ينفع الإيمان نفسًا { لم تكن آمنت من قبل } ولا تنفع التوبة من المعاصي وترك الواجبات حينئذٍ لقوله: { أو كسبت في إيمانها خيرًا } أي: لا ينفع نفسًا مؤمنة لم تكن كسبت خيرًا قبل ذلك اليوم، حيث كانت فرطت فيه قبل: وينفع اكتسابه بعد. والحاصل: أن طلوع الشمس من مغربها يُغلق بعده بابُ التوبة فلا يقبل الإيمان من كافر، ولا التوبة من عاصٍ، وأما الإيمان المجرد عن العمل، إذا كان حاصلاً قبل ذلك اليوم، فإنه ينفع على مذهب أهل السنة، وكذلك العاصي بالبعض ينفعه بعض الذي كان يعمله، كالزاني مثلاً، إذا كان يصلي، فتنفعه صلاته ويعاقب على العصيان، وهكذا، والمنفي قبوله: إنما هو الخير المتروك قبل ذلك اليوم، فلا ينفع استدراكه بعد. ثم قال تعالى: { قل انتظروا }  إتيان أحد الثلاثة الملائكة بعذابكم، أو أمر الله تعالى بإهلاككم، أو بعض آياته، { إنا منتظرون } ذلك، لنا الفوز وعليكم الويل.\nالإشارة: ما ينتظر الغافلون والمنهمكون في اللذات والشهوات والإعراض عن الله إلا أن تأتيهم الملائكة لقبض أرواحهم فجأة، فيموتون على الغفلة، فتنزل بهم الحسرة والندم، وقد زلت القدم بهم، أو يأتي أمر الله بطردهم والطبع على قلوبهم، فلا ينفعهم وعظ ولا تذكير، أو يأتي بعض آيات ربك مصيبة أو داهية تثقل قلوبهم عن التوجه إلى الله، وجوارحهم عن طاعة الله. فالغافل والعاصي بين هذه الثلاثة، إن لم يقلع ويتب. والله تعالى أعلم. ثم أمرهم بالإعراض عن أهل الإعراض، فقال: { إِنَّ ٱلَّذِينَ فَرَّقُواْ دِينَهُمْ وَكَانُواْ شِيَعاً }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:33",
      "similarity": 0.4766210870248056
    },
    {
      "verse": "34:42",
      "similarity": 0.4175902246498413
    },
    {
      "verse": "32:29",
      "similarity": 0.3876020261053194
    },
    {
      "verse": "6:129",
      "similarity": 0.37963027673284355
    },
    {
      "verse": "80:4",
      "similarity": 0.36282488324045825
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006158.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006158.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:158.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}