{
  "chapter": "الأنعام",
  "text": "ثم ءاتينا موسى الكتب تماما على الذى احسن وتفصيلا لكل شىء وهدى ورحمة لعلهم بلقاء ربهم يؤمنون",
  "translations": [
    {
      "translation": "Then We gave Musa the Book, complete and perfect for him who does good, elucidating everything, and a guidance and a mercy, so that hopefully they will have iman in their encounter with their Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To that end We gave the Book to Moses, a perfect law, distinctly explaining all things, and a guidance and grace, so that they should believe in the meeting with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We gave to Moses the Book, completing the benediction of Allah upon the one who acts righteously, spelling out everything clearly, a guidance and a mercy; so that they may believe in their meeting with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gave Moses the Book to complete (Our favor) for the righteous ones, the Book that contained a detailed explanation of all things, a guide and a mercy so that perhaps they would have faith in the Day of Judgment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We gave the Book to Moosa, to complete the favour on one who is virtuous, and an explanation of all things, a guidance and a mercy, so they may believe in meeting their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, We gave Musa the Book [the Tawrah], complete for that which is best, and explaining all things in detail and a guidance and a mercy that they might believe in the meeting with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Again, We gave the Book to Musa to complete (Our blessings) on him who would do good (to others), and making plain all things and a guidance and a mercy, so that they should believe in the meeting of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We gave Moses the Book, complete for him who does good, and distinguishing every thing, and as a guidance and a mercy; haply they would believe in the encounter with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Again, We gave the Scripture unto Moses, complete for him who would do good, an explanation of all things, a guidance and a mercy, that they might believe in the meeting with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We gave Moses the Book, completing [Our favour] to the righteous, explaining everything clearly, as guidance and mercy, so that they might believe in meeting their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then unto Musa We vouchsafed the Book perfect for him who would do well and detailing every thing and a guidance and a mercy, that haply in the meeting of their Lord they would believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We gave Moses the Book, completing [Our blessing] on him who is virtuous, and as an elaboration of all things, and as a guidance and mercy, so that they may believe in the encounter with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moreover, We gave Moses the Book, completing (Our favour) to those who would do right, and explaining all things in detail,- and a guide and a mercy, that they might believe in the meeting with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, We gave Musa (Moses) the Book [the Taurat (Torah)], to complete (Our Favour) upon those who would do right, and explaining all things in detail and a guidance and a mercy that they might believe in the meeting with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then to Moses We gave the Book, complete for him who does good, and (to make) plain all things, and guidance, and mercy, so that they might believe in the ultimate meeting with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We gave Moses the Scripture, perfect for the righteous, and explaining everything clearly, and a beacon, and mercy, that they may believe in the encounter with their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We gave Moses the Scripture, making complete [Our favor] upon the one who did good and as a detailed explanation of all things and as guidance and mercy that perhaps in [the matter of] the meeting with their Lord they would believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:154] Then (thumma is for [describing events in a] sequence) We gave Moses the Scripture, the Torah, complete, in grace, for him who does good, by observing it, and a detailing, an explanation, of all things, needed for religion, and as a guidance and a mercy, that perhaps they, that is, the Children of Israel, might believe in the encounter with their Lord, through the Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Again, We gave the Scripture) the Torah (unto Moses, complete) with commands and prohibitions, promises and threats, reward and punishment (for him who would do good) for him who is in a good state; it is also said that this means: for him who follows the excellence of Moses and the conveyance of the message of his Lord, (an explanation of all things) He says: it is an exposition of all things regarding the lawful and the unlawful, (a guidance) from error (and a mercy) that absolves the one who believes in Allah from His torment, (that they might believe in the meeting with their Lord) that they might believe in resurrection after death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ثم آتينا موسى الكتاب } أي: بعدما وصّاكم بسلوك طريق الفضيلة في قديم الدهر\n[البقرة\n الآية: 153] { تماماً على الذي أحسن } أي: تتميماً لكرامة الولاية ونعمة النبوّة مزيداً على الذي أحسنه موسى من سلوك طريق الكمال وبلوغه إلى ما بلغ من مقام المكالمة والقرب بالوجود الموهوب بعد الفناء في الوحدة\n كما قال تعالى:\n[الأعراف\n الآية: 143] بالتكميل ودعوة الخلق إلى الحق { وتفصيلاً لكل شيء } يحتاج إليه الخلق في المعاد { وهدى } لهم إلى ربّهم في سلوك سبيله { ورحمة } عليهم بإفاضة كمالاته عليهم بواسطة موسى وكتابه { لعلهم بلقاء ربّهم يؤمنون } الإيمان العلمي أو العياني",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } اعملوا أنا { آتَيْنَا } من مقام جودنا { مُوسَى ٱلْكِتَابَ } تماماً\n أي: التوراة المبين لطريق الحق { تَمَاماً عَلَى } الوجه { ٱلَّذِيۤ أَحْسَنَ } بيانه وتوضيحه { وَ } بينَّا فيه أيضاً { تَفْصِيلاً لِّكُلِّ شَيْءٍ } من الكوائن والفواسد المتعلقة بعالم الفواسد المتعلقة بعالم الملك والشهادة { وَهُدًى } من المعارف والحقائق المتعلقة بعالم الملكوت والغيب { وَرَحْمَةً } من المكاشفات والمشاهدات المسقطة للإضافات مطلقاً المغنية لنفوس الغير والسوى رأساً { لَّعَلَّهُمْ بِلِقَآءِ رَبِّهِمْ يُؤْمِنُونَ } [الأنعام: 154] رجاء أن يتحققوا بمرتبة اليقين العلمي ثم العيني ثم الحقي\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { ثم }: هنا للترتيب الإخباري، وقال ابن جزي: هذه الوصية قديمة لكل أمة على لسان نبيها، فصح الترتيب. وقال البيضاوي: { أو } للتفاوت في الرتبة، كأنه قيل: ذلكم وصاكم به قديمًا وحديثًا، ثم أعظم من ذلك: أنا آتينا موسى الكتاب... الخ. وهو عطف على { وصّاكم } ، و { تمامًا وتفصيلاً }: حالان، أو علتان، أو مصدران. يقول الحقّ جلّ جلاله: { ثم } نخبرك أنا { آتينا موسى الكتاب } التوراة، { تمامًا على الذي أحسن } القيام به من بني إسرائيل، ويدل عليه قراءة: { أحسنوا } ، أي: تمامًا للنعمة على العاملين به، أو تمامًا على موسى الذي أحسن القيام به، أي: آتيناه الكتاب تفضلاً وإتمامًا للنعمة جزاء على ما أحسن من طاعة ربه وتبليغ رسالته، ففاعل أحسن: ضمير موسى. أو: { تمامًا } أي: إكمالاً على ما أحسن الله به إلى عباده، فالفاعل على هذا: ضمير الله تعالى، { وتفصيلاً } أي: تبيينًا { لكل شيء } يحتاجون إليه في الدين. { وهدى } أي: هداية للظواهر، { ورحمة } للقلوب، { لعلهم } أي: بني إسرائيل، { بلقاء ربهم } للجزاء، { يُؤمنون } إيمانًا صحيحًا، وهو اللقاء بالأجسام والأرواح، والنعيم أو العذاب للأشباح. الله تعالى أعلم. الإشارة: كل من أحسن عبادة ربه في الظاهر، وحقق عبوديته في الباطن، أتم الله عليه نعمته بشهود ذاته وأنوار صفاته، ووهب له علومًا لدنية تفصل له ما أشكل، يكون له هداية لزيادة الترقي، ورحمةً يتهيأ بها قلبه لوحي الإلهام والتلقي. وبالله التوفيق. ثم ذكر فضل كتابه العزيز، فقال: { وَهَـٰذَا كِتَابٌ أَنزَلْنَاهُ مُبَارَكٌ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:52",
      "similarity": 0.4279372765759409
    },
    {
      "verse": "11:119",
      "similarity": 0.4157039733133719
    },
    {
      "verse": "48:2",
      "similarity": 0.4027126349746174
    },
    {
      "verse": "6:115",
      "similarity": 0.37544525303658655
    },
    {
      "verse": "7:174",
      "similarity": 0.3666521896198815
    }
  ]
}