{
  "chapter": "الأنعام",
  "text": "ان تقولوا۟ انما انزل الكتب على طائفتين من قبلنا وان كنا عن دراستهم لغفلين",
  "translations": [
    {
      "translation": "So you cannot say: The Book was only sent down to the two groups before us and we were ignorant of their studies.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest you say: \"The Book that was sent before was meant only for two groups; we were not aware of their teachings;\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(You may no longer) say now that the Book was revealed only to two groups of people before Us and that we had indeed been unaware of what they read.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and will not say that the Book was revealed only to two groups of people before you, or that you were ignorant of its knowledge,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For you (the disbelievers) may say, “The Book was sent down only to two groups (Jews and Christians) before us; and we were totally unaware of what they read and taught.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest you should say: \"The Book was sent down only to two sects before us, and for our part, we were in fact unaware of what they studied.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest you say that the Book was only revealed to two parties before us and We were truly unaware of what they read.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "lest you should say, 'The Book was sent down only upon two parties before us, and we have indeed been heedless of their study';\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest ye should say: The Scripture was revealed only to two sects before us, and we in sooth were unaware of what they read;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and not say, \"The Book was only sent down to the two groups before us and we were indeed unaware of their teachings,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest ye should say: the Book was only sent down to the two sects before us, and we in sooth were unaware of their readings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest you should say, ‘The Book was sent down only to two communities before us, and we were indeed unaware of their studies,’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest ye should say: \"The Book was sent down to two Peoples before us, and for our part, we remained unacquainted with all that they learned by assiduous study:\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest you (pagan Arabs) should say: \"The Book was only sent down to two sects before us (the Jews and the Christians), and for our part, we were in fact unaware of what they studied.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "lest you should say: 'The Book was sent down only to two parties before us; we are inattentive to their study'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lest you say, “The Scripture was revealed to two parties before us, and we were unaware of their teachings.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[We revealed it] lest you say, \"The Scripture was only sent down to two groups before us, but we were of their study unaware,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:156] We have revealed it, lest you should say, ‘The Scripture was revealed only upon two parties — the Jews and   the Christians — before us and we (in has been softened, its noun omitted, in other words [read as] innā) indeed have been unacquainted with their study’, their reading [of the scripture], not knowing any of it, since it is not in our own language.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lest ye should say) so that you will not say, people of Mecca, on the Day of Judgement: (The Scripture was revealed only to two sects) the people of two religions (before us) i.e. the Jews and Christians, (and we 154 in sooth were unaware) ignorant (of what they read) their reading of the Torah and the Gospel;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنما أنزلنا القرآن بعد التوراة والإنجيل، وإن كان أكثر أحكام الكتب الإلهية مشتركة كراهة { أَن تَقُولُوۤاْ } أيها المؤمنون { إِنَّمَآ أُنزِلَ ٱلْكِتَابُ عَلَىٰ طَآئِفَتَيْنِ مِن قَبْلِنَا } أي: اليهود والنصارى، وعلى لسانهم ولغتهم فلا تقبلون الأحكام الإلهية معللين قائلين: { وَإِن } أي: { كُنَّا عَن دِرَاسَتِهِمْ } قراءتهم وتعلمهم لعدم علمنا بوضع لغتهم { لَغَافِلِينَ } [الأنعام: 156]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "34:44",
      "similarity": 0.8086838671495795
    },
    {
      "verse": "68:37",
      "similarity": 0.8074400701575437
    },
    {
      "verse": "3:79",
      "similarity": 0.7450411631788849
    },
    {
      "verse": "6:105",
      "similarity": 0.7352821942751628
    },
    {
      "verse": "7:169",
      "similarity": 0.5710530132524387
    }
  ]
}