{
  "chapter": "الأنعام",
  "text": "هل ينظرون الا ان تاتيهم الملئكة او ياتى ربك او ياتى بعض ءايت ربك يوم ياتى بعض ءايت ربك لا ينفع نفسا ايمنها لم تكن ءامنت من قبل او كسبت فى ايمنها خيرا قل انتظروا۟ انا منتظرون",
  "translations": [
    {
      "translation": "What are they waiting for but for the angels to come to them or for your Lord Himself to come, or for one of your Lord's Signs to come? On the day that one of your Lord's Signs does come, no iman which a self professes will be of any use to it if it did not have iman before and earn good in its iman. Say: 'Wait, then; We too are waiting.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What are the people waiting for? For the angels to come down, or your Lord to appear, or some signs from your Lord? The day when certain signs appear from your Lord, the embracing of faith shall not be of any avail to one who did not come to belief at first, or who did not perform good deeds by virtue of his faith. Tell them: \"Wait on, we are waiting too (for the good and evil to become distinct).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What! Do they wait either for the angels to appear before them or for your Lord to come unto them or for some clear signs of your Lord to appear before them? When some clear signs of your Lord will appear, believing will be of no avail to anyone who did not believe before, or who earned no good deeds through his faith. Say: 'Wait on; we too are waiting.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting until the angels or your Lord come to them or for some miracles to take place? On the day when some miracles of God will take place, the belief of any soul will be of no avail to it unless some good deeds have been done with it, or it has been formed before the coming of such a day. (Muhammad), tell them, \"Wait and we, too, are waiting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What are they waiting for – except that the angels come to them, or the punishment from your Lord, or one of the signs of your Lord? On the day when the (foretold) sign of your Lord comes, not a single soul who had not earlier accepted faith nor earned any good from its faith, will benefit from accepting faith; say, “Wait – we too are waiting.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they then wait for anything other than that the angels should come to them, or that your Lord should come, or that some of the Signs of your Lord should come! The day that some of the signs of your Lord do come, no good will it do to a person to believe then, if he believed not before, nor earned good with his faith. Say: \"Wait you! We (too) are waiting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not wait aught but that the angels should come to them, or that your Lord should come, or that some of the signs of your Lord should come. On the day when some of the signs of your Lord shall come, its faith shall not profit a soul which did not believe before, or earn good through its faith. Say: Wait; we too are waiting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, do they look for the angels to come to them, nothing less, or that thy Lord should come, or that one of thy Lord's signs should come? On the day that one of thy Lord's signs comes it shall not profit a soul to believe that never believed before, or earned some good in his belief. Say: 'Watch and wait; We too are waiting.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wait they, indeed, for nothing less than that the angels should come unto them, or thy Lord should come, or there should come one of the portents from thy Lord? In the day when one of the portents from thy Lord cometh, its belief availeth naught a soul which theretofore believed not, nor in its belief earned good (by works). Say: Wait ye! Lo! We (too) are waiting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting for the angels or your Lord to come down to them, or for some of your Lord's signs to come? The day when some of the signs of your Lord shall come, it shall not profit any human being who did not believe before, or who did not do any good by his faith. Say to them, \"Wait then, we too are waiting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They await indeed that the angel should come unto them, or that thy Lord should come or that certain of the signs of thy Lord should come. On the Day whereon certain of the signs of thy Lord will come, belief will not profit any person who had not believed theretofore or had not earned any good by his belief. Say thou: so wait ye verily we also are waiting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not consider that the angels may come to them, or your Lord may come, or some of your Lord’s signs may come? The day when some of your Lord’s signs do come, faith shall not benefit any soul that had not believed beforehand and had not earned some goodness in its faith. Say, ‘Wait! We too are waiting!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting to see if the angels come to them, or thy Lord (Himself), or certain of the signs of thy Lord! the day that certain of the signs of thy Lord do come, no good will it do to a soul to believe in them then if it believed not before nor earned righteousness through its faith. Say: \"Wait ye: we too are waiting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they then wait for anything other than that the angels should come to them, or that your Lord should come, or that some of the Signs of your Lord should come (i.e. portents of the Hour e.g., arising of the sun from the west)! The day that some of the Signs of your Lord do come, no good will it do to a person to believe then, if he believed not before, nor earned good (by performing deeds of righteousness) through his Faith. Say: \"Wait you! we (too) are waiting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting for the angels or your Lord to come to them, or for some of the signs of your Lord? On the Day when some of the signs of your Lord come, no soul will be benefited by its belief had it not believed before or earned good in its belief. Say: 'Wait, we are waiting'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they waiting for anything but for the angels to come to them, or for your Lord to arrive, or for some of your Lord’s signs to come? On the Day when some of your Lord’s signs come, no soul will benefit from its faith unless it had believed previously, or had earned goodness through its faith. Say, “Wait, we too are waiting.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they [then] wait for anything except that the angels should come to them or your Lord should come or that there come some of the signs of your Lord? The Day that some of the signs of your Lord will come no soul will benefit from its faith as long as it had not believed before or had earned through its faith some good. Say, \"Wait. Indeed, we [also] are waiting.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:158] Are they waiting — the deniers are indeed waiting — for nothing less than that the angels should come to them (read ta’tīyahum or ya’tīyahum), to seize their souls, or that your Lord, that is, His command, meaning His chastisement, should come, or that one of your Lord’s signs should come?, that is, those portents of His that indicate [the arrival of] the Hour? On the day that one of your Lord’s signs comes — and this is the rising of the sun from the west, as reported in the hadīth of the two Sahīhs [of Bukhārī and Muslim] — it shall not benefit a soul to believe if it had not believed theretofore (lam takun āmanat min qabl is an adjectival qualification of nafs, ‘a soul’) or, a soul which had not [until then], earned in its belief some good, some [act of] obedience, that is to say, its repentance shall be of no benefit to it, as [stated] in the hadīth [corpus]. Say: ‘Wait, for one of these things, We too are waiting’, for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Wait they) i.e. the people of Mecca, (indeed, for nothing less than that the angels should come unto them) to take their souls away at the moment of death, (or thy Lord should come) on the Day of Judgement, and His coming is without modality, (or there should come one of the portents from thy Lord) i.e. the rising of the sun from the West? (In the day when one of the portents from they Lord cometh) before the rising of the sun from the West, (its belief availeth naught a soul which theretofore) before the rising of the sun from the West (believed not, nor in its belief earned good) nor was it sincere in its belief, nor doing any good works before the rising of the sun from the West. This is because no faith, works or repentance are accepted from an unbeliever who embraces Islam upon seeing the sun rise from the West, unless that person is young at that time or is born after. In such a case, if he leaves Islam after the sun rises from the West and then returns to Islam, his repentance is accepted. Likewise, the repentance of a sinning believer who repents of his sins after the sun rises from the West is accepted. (Say) Muhammad to the people of Mecca: (Wait you) the Day of Judgement! (Lo! We (too) are waiting) for your punishment on the Day of Judgement or before the Day of Judgement; it is also said that this means: Say, Muhammad, wait for my destruction, I am also waiting for yours.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { هَلْ يَنظُرُونَ إِلاَّ أَن تَأْتِيهُمُ ٱلْمَلاۤئِكَةُ } معناهُ تَنتَظرُونَ\n قالَ زيدُ بن علي عليهما السَّلامُ: { هَلْ يَنظُرُونَ إِلاَّ أَن تَأْتِيهُمُ ٱلْمَلاۤئِكَةُ } قالَ: المَوتُ: { أَوْ يَأْتِيَ رَبُّكَ } قال: القِيامةُ { أَوْ يَأْتِيَ بَعْضُ آيَاتِ رَبِّكَ } قالَ: هُوَ طُلُوعُ الشَّمسِ مِن مَغْرِبِهَا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ هَلْ يَنظُرُونَ } أي: ما ينتظرون ويسوفون أمر الإيمان { إِلاَّ أَن تَأْتِيهُمُ ٱلْمَلاۤئِكَةُ } أي: ملائكة العذاب كما أتوا الأمم الماضية فتلجئهم إلأيه { أَوْ يَأْتِيَ رَبُّكَ } أي: يطلبون إيتان ربك عناداً كما طلب اليهود حين قالوا: { أَرِنَا ٱللَّهَ جَهْرَةً } [النساء: 153] { أَوْ يَأْتِيَ بَعْضُ ءَايَاتِ رَبِّكَ } الدالة على انقضاء النشأة الأولى المسمى بأشراط الساعة، وبالجملة: { يَوْمَ يَأْتِي بَعْضُ ءَايَاتِ رَبِّكَ لاَ يَنفَعُ نَفْساً إِيمَانُهَا } لكونها ملجئة إليه حين اضطرارها، ولا عبرة للإيمان حين البأس والإلجاء؛ إذ الإيمان تعبدي برهاني اختياري { لَمْ تَكُنْ ءَامَنَتْ مِن قَبْلُ } أي: نفساً لم تكن آمنت قبل ظهور المجلئ { أَوْ } لم تكن { كَسَبَتْ } وإن آمنت { فِيۤ إِيمَٰنِهَا خَيْراً } مقبولاً عند الله { قُلِ } للمنتظرين استهزاءاً: { ٱنتَظِرُوۤاْ } إلى ما تخيلتم وتوهمتم { إِنَّا مُنتَظِرُونَ } [الأنعام: 158] أيضاً إلى حلول الوقت المعلوم ونزول العذاب فيه عليكم بكفركم وشرككم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { هل ينظرون } أي: ما ينتظر أهل مكة { إلا أن تأتيهم الملائكة } لقبض أرواحهم، أو بالعذاب، لأجل كفرهم، وهم لم يكونوا ينتظرون ذلك، ولكن لما كان يلحقهم لحوق المنتظر شبهوا بالمنتظرين، { أو يأتي ربك } أي: أمره بالعذاب، { أو يأتي بعض آيات ربك } يعني: أشراط الساعة\n وعن حذيفة والبراء بن عازب: كنا نتذاكر الساعة، إذ أشرق علينا رسول الله صلى الله عليه وسلم، فقال:\n\n \" ما تداكرون \" \n\nقلنا: نتذاكر الساعة، فقال:\n\n \" إنها لا تقوم حتى تروا قبلها عشر آيات: الدجال ودابة الأرض، وخسفًا بالمشرق، وخسفًا بالمغرب، وخسفًا بجزيرة العرب، والدخان، وطلوع الشمس من مغربها، ويأجوج ومأجوج، ونزول عيسى، ونارًا تخرج من عدن \"\n \n\n{ يوم يأتي بعض آيات ربك } ، وهو طلوع الشمس من مغربها، كما في حديث الصحيحين، قال الأقليشي: وذلك أن الله تعالى، إذا أراد طلوعها من مغربها، حبسها ليلة تحت العرش، فكلما سجدت وأستأذنت لم يجر لها جواب، حتى يحبسها مقدار ثلاث ليال، فيأتيها جبريل عليه السلام فيقول: إن الرب تعالى يأمرك أن ترجعي إلى مغربك فتطلعي منه، وأنه لا ضوء لك عندنا ولا نور، فتبكي عن ذلك بكاء يسمعها أهل السبع سماوات، ومن دونها، وأهل سرادقات العرش وحملته من فوقها، فيبكون لبكائها مما يخالطهم من خوف الموت، وخوف يوم القيامة، قال: فيبيت الناس ينتظرون طلوعها من المشرق، فتطلع الشمس والقمر خلف أقفيتهم من الغرب، أسودين مُكدرين، كالقارتين، ولا ضوء للشمس ولا نور للقمر، فيتصايح أهل الدنيا، وتذهل الأمهات عن أولادها، والأحبة عن ثمرة قلوبها، فتشتغل كل نفس بنفسها، ولا ينفع التوحيد حينئذٍ\n هـ\n وهو معنى قوله تعالى: { يوم يأتي بعض آيات ربك لا ينفع نفسًا إيمانها } كالمحتضر إذا صار الأمر عيانًا، وإنما ينفع الإيمان بالغيب، وقد فات يومئذٍ، فلا ينفع الإيمان نفسًا { لم تكن آمنت من قبل } ولا تنفع التوبة من المعاصي وترك الواجبات حينئذٍ لقوله: { أو كسبت في إيمانها خيرًا } أي: لا ينفع نفسًا مؤمنة لم تكن كسبت خيرًا قبل ذلك اليوم، حيث كانت فرطت فيه قبل: وينفع اكتسابه بعد\n والحاصل: أن طلوع الشمس من مغربها يُغلق بعده بابُ التوبة فلا يقبل الإيمان من كافر، ولا التوبة من عاصٍ، وأما الإيمان المجرد عن العمل، إذا كان حاصلاً قبل ذلك اليوم، فإنه ينفع على مذهب أهل السنة، وكذلك العاصي بالبعض ينفعه بعض الذي كان يعمله، كالزاني مثلاً، إذا كان يصلي، فتنفعه صلاته ويعاقب على العصيان، وهكذا، والمنفي قبوله: إنما هو الخير المتروك قبل ذلك اليوم، فلا ينفع استدراكه بعد\n ثم قال تعالى: { قل انتظروا }  إتيان أحد الثلاثة الملائكة بعذابكم، أو أمر الله تعالى بإهلاككم، أو بعض آياته، { إنا منتظرون } ذلك، لنا الفوز وعليكم الويل\n\n\nالإشارة: ما ينتظر الغافلون والمنهمكون في اللذات والشهوات والإعراض عن الله إلا أن تأتيهم الملائكة لقبض أرواحهم فجأة، فيموتون على الغفلة، فتنزل بهم الحسرة والندم، وقد زلت القدم بهم، أو يأتي أمر الله بطردهم والطبع على قلوبهم، فلا ينفعهم وعظ ولا تذكير، أو يأتي بعض آيات ربك مصيبة أو داهية تثقل قلوبهم عن التوجه إلى الله، وجوارحهم عن طاعة الله\n فالغافل والعاصي بين هذه الثلاثة، إن لم يقلع ويتب\n والله تعالى أعلم\n ثم أمرهم بالإعراض عن أهل الإعراض، فقال: { إِنَّ ٱلَّذِينَ فَرَّقُواْ دِينَهُمْ وَكَانُواْ شِيَعاً }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:33",
      "similarity": 0.4766210870248056
    },
    {
      "verse": "34:42",
      "similarity": 0.4175902246498413
    },
    {
      "verse": "32:29",
      "similarity": 0.3876020261053194
    },
    {
      "verse": "6:129",
      "similarity": 0.37963027673284355
    },
    {
      "verse": "80:4",
      "similarity": 0.36282488324045825
    }
  ]
}