{
  "chapter": "الأنعام",
  "text": "قل تعالوا۟ اتل ما حرم ربكم عليكم الا تشركوا۟ به شيـا وبالولدين احسنا ولا تقتلوا۟ اولدكم من املق نحن نرزقكم واياهم ولا تقربوا۟ الفوحش ما ظهر منها وما بطن ولا تقتلوا۟ النفس التى حرم الله الا بالحق ذلكم وصىكم به لعلكم تعقلون",
  "translations": [
    {
      "translation": "Say: 'Come and I will recite to you what your Lord has made haram for you': that you do not associate anything with Him; that you are good to your parents; that you do not kill your children because of poverty - We will provide for you and them; that you do not approach indecency - outward or inward; that you do not kill any person Allah has made inviolate - except with the right to do so. That is what He instructs you to do so that hopefully you will use your intellect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"Come, I will read out what your Lord has made binding on you: That you make none the equal of God, and be good to your parents, and do not abandon your children out of poverty, for We give you food and We shall provide for them; and avoid what is shameful, whether open or hidden, and do not take a life which God has forbidden, unless for some just cause. These things has God enjoined on you. Haply you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them (O Muhammad!): 'Come, let me recite what your Lord has laid down to you: (i) that you associate nothing with Him; (ii) and do good to your parents; (iii) and do not slay your children out of fear of poverty. We provide you and will likewise provide them with sustenance; (iv) and do not even draw to things shameful - be they open or secret; (v) and do not slay the soul santified by Allah except in just cause; this He has enjoined upon you so that you may understand;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"Let me tell you about what your Lord has commanded: Do not consider anything equal to God; Be kind to your parents; Do not murder your children out of fear of poverty, for We give sustenance to you and to them. Do not even approach indecency either in public or in private. Take not a life which God has made sacred except by way of justice and law. Thus does He command you that you may learn wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Come – so that I may recite to you what your Lord has forbidden for you that ‘Do not ascribe any partner to Him and be good to parents; and do not kill your children because of poverty; We shall provide sustenance for all – you and them; and do not approach lewd things, the open among them or concealed; and do not unjustly kill any life which Allah has made sacred; this is the command to you, so that you may have sense.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Come, I will recite what your Lord has prohibited you from: Join not anything in worship with Him; be kind and dutiful to your parents; kill not your children because of poverty -- We provide sustenance for you and for them. Come not near to Al-Fawahish (immoral sins) whether committed openly or secretly; and kill not anyone whom Allah has forbidden, except for a just cause. This He has commanded you that you may understand.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Come I will recite what your Lord has forbidden to you-- (remember) that you do not associate anything with Him and show kindness to your parents, and do not slay your children for (fear of) poverty-- We provide for you and for them-- and do not draw nigh to indecencies, those of them which are apparent and those which are concealed, and do not kill the soul which Allah has forbidden except for the requirements of justice; this He has enjoined you with that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Come, I will recite what your Lord has forbidden you: that you associate not anything with Him, and to be good to your parents, and not to slay your children because of poverty; We will provide you and them and that you approach not any indecency outward or inward, and that you slay not the soul God has forbidden, except by right. That then He has charged you with; haply you will understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Come, I will recite unto you that which your Lord hath made a sacred duty for you: That ye ascribe no thing as partner unto Him and that ye do good to parents, and that ye slay not your children because of penury - We provide for you and for them - and that ye draw not nigh to lewd things whether open or concealed. And that ye slay not the life which Allah hath made sacred, save in the course of justice. This He hath command you, in order that ye may discern.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Come! I will tell you what your Lord has really forbidden you! Do not associate anything with Him; be good to your parents; and do not kill your children for fear of poverty, We shall provide sustenance for you as well as for them, refrain from committing indecent deeds, whether openly or in secret; and do not kill the life which God has made sacred, save by right. That is what He has enjoined upon you, so that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: come, I shall recite that which your Lord hath forbidden unto you: associate not aught with Him, and shew kindness unto the parents, and slay not your offspring for fear of want - We it is who shall provide for you and them -and approach not indecencies, whatsoever is open thereof and whatsoever is concealed, and slay not anyone whom Allah hath forbidden except for justification. Thus He enjoineth you that haply ye may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Come, I will recount what your Lord has forbidden you. That you shall not ascribe any partners to Him, and you shall be good to the parents, you shall not kill your children due to penury—We will provide for you and for them—you shall not approach indecencies, the outward among them and the inward ones, and you shall not kill a soul [whose life] Allah has made inviolable, except with due cause. This is what He has enjoined upon you so that you may exercise your reason.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Come, I will rehearse what Allah hath (really) prohibited you from\": Join not anything as equal with Him; be good to your parents; kill not your children on a plea of want;- We provide sustenance for you and for them;- come not nigh to shameful deeds. Whether open or secret; take not life, which Allah hath made sacred, except by way of justice and law: thus doth He command you, that ye may learn wisdom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Come, I will recite what your Lord has prohibited you from: Join not anything in worship with Him; be good and dutiful to your parents; kill not your children because of poverty - We provide sustenance for you and for them; come not near to Al-Fawahish (shameful sins, illegal sexual intercourse, etc.) whether committed openly or secretly, and kill not anyone whom Allah has forbidden, except for a just cause (according to Islamic law). This He has commanded you that you may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Come, I will recite to you what your Lord forbids you; that you shall associate anything with Him; that you shall be good to your parents, that you shall not kill your children because of poverty, We provide for you and for them, that you shall not commit foul deeds whether openly or in secret, and that you shall not kill the soul that Allah has forbidden except by right. With such Allah charges you, in order that you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Come, let me tell you what your Lord has forbidden you: that you associate nothing with Him; that you honor your parents; that you do not kill your children because of poverty—We provide for you and for them; that you do not come near indecencies, whether outward or inward; and that you do not kill the soul which God has sanctified—except in the course of justice. All this He has enjoined upon you, so that you may understand.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Come, I will recite what your Lord has prohibited to you. [He commands] that you not associate anything with Him, and to parents, good treatment, and do not kill your children out of poverty; We will provide for you and them. And do not approach immoralities - what is apparent of them and what is concealed. And do not kill the soul which Allah has forbidden [to be killed] except by [legal] right. This has He instructed you that you may use reason.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:151] Say: ‘Come, I will recite that which your Lord has made a sacred duty for you: that (allā: [consisting of anlā] an being explicative) you associate nothing with Him, that you be dutiful to parents, and that you do not slay your children, by burying them alive, because of poverty, destitution, that you may fear — We will provide for you and them — and that you do not draw near any acts of lewdness, grave sins, such as fornication, whether it be manifest or concealed, that is, [acts committed] overtly or in secret, and that you do not slay the life which God has made sacred, except rightfully, as in the case of retaliation, or [as] the prescribed punishment for apostasy, and the stoning of an adulterer. This, which is mentioned, is what He has charged you with, that perhaps you will understand, reflect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad to Malik Ibn 'Awf and his fellows: (Come, I will recite unto you that which your Lord hath made a sacred duty for you) in the Scripture that was revealed to me: (that ye ascribe no thing as partner unto Him) the first thing is that you do not associate with Him any of the idols (and that you do good to parents) you be dutiful to parents, (and that ye slay not your children) your daughters (because of penury) out of fear of humiliation and poverty. (We provide for you and for them) i.e. for your children (and that ye draw not nigh to lewd things) fornication (whether open) i.e. open fornication (or concealed) taking lovers in secret. (And that ye slay not the life which Allah hath made sacred, save in the course of justice) as a result of cases such as retaliation, stoning, apostasy. (This He hath commanded you) in the Qur'an, (in order that you may discern) His command and divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلاَ تَقْتُلُوۤاْ أَوْلاَدَكُمْ مِّنْ إمْلاَقٍ } معناهُ من فَقرٍ وَفَاقَةٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And do not kill your children from {famaraq},\" means from poverty and need.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قل تعالوا أتلُ ما حرّم ربّكم عليكم } لما أثبت أن المشركين في التحريم والتحليل يتّبعون أهواءهم، إذ الشرك في نفسه ليس إلا عبادة الهوى والشيطان\n فلما احتجبوا بصفات النفس عن صفات الحق، وأمّروا عليهم الهوى وعبدوه وأطاعوا أوامره ونواهيه في التحريم والتحليل، بيّن أن التحريم والتحليل المتّبع فيهما أمر الله تعالى ما هما، ولما كان الكلام معهم في تحريم الطيبات عدّد المحرمات ليستدل بها على المحللات فحصر جميع أنواع الفضائل بالنهي عن أجناس الرذائل وابتدأ بالنهي عن رذيلة القوة النطقية التي هي أشرفها\n فإن رذيلتها أكبر الكبائر، مستلزمة لجميع الرذائل، بخلاف رذيلة أخويها من القوّتين البهيمية والسبعية فقال: { ألا تشركوا به شيئاً } إذ الشرك من خطئها في النظر وقصورها عن استعمال العقل ودرك البرهان وعقّبه بإحسان الوالدين، إذ معرفة حقوقهما تتلو معرفة الله في الإيجاد والربوبية لأنهما سببان قريبان في الوجود والتربية وواسطتان جعلهما الله تعالى مظهرين لصفتي إيجاده وربوبيته، ولهذا قال صلى الله عليه وسلم:\n\n \" من أطاع الوالدين فقد أطاع الله ورسوله \" \n",
      "translations": [
        {
          "translation": "\n\nSay, \"Come, let us recite what God has made unlawful for you: that which you have associated with Him {in worship}. For God is Witness between us and you. We have rejected your ways, and you will find us to be enemies of yours.\",\n\n{Partnership} in and of itself is nothing but the worship of one's {desires} and {Satan}.\n\n\n{When they cover the qualities of the soul with the qualities of the Truth},\n\nAnd command them to lower their voices and to serve and obey their Lord's commands and prohibitions in humility and submission.,\n\n{It is clear that the prohibition and analysis that follows it are both commands of Allah.},\n\n{When the discussion was about the prohibition of certain kinds of food, the number of things that are forbidden was not used as an argument against those who analyze things. Rather, all kinds of virtues were restricted by the prohibition of the kinds of things that are contemptible, and the prohibition began with the kind of thing that is contemptible because it is the most vocal.}\n If her nose is big, it's one of the biggest things.,\n\nThis is required for all messages.,\n\nIn contrast to her two brothers from the Qawwutin tribe, she said: {Do not associate anything with him} because associating him with something is her mistake in judgement and her lack of understanding of how to use reason and grasp evidence, and following that with good treatment of her parents.,\n\nKnowing their rights leads to knowing God in creation and lordship, because they are both close causes in existence and education, and God has made them both manifest signs of His attribute of creating and His attribute of lordship.,\n\nAnd for this reason the Prophet Muhammad (peace and blessings of Allah be upon him) said:\n Whoever obeys his parents has obeyed Allah and His Messenger",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم يا أكمل الرسل على مقتضى شفقة النبوة: { تَعَالَوْاْ } أيها التائهون في بيداء الضلال { أَتْلُ } وأعد لكم { مَا حَرَّمَ رَبُّكُمْ عَلَيْكُمْ } في نشأتكم الدنيا، أولاها وعظماها: { أَلاَّ تُشْرِكُواْ بِهِ شَيْئاً } من مصنوعاته؛ إذ هو أحد صمد فرد وتر ليس لغيره وجود حتى يشاركه ويماثله { وَ } أن تفعلوا { بِٱلْوَالِدَيْنِ } اللذين هما سببان قريبان لظهوركم إلا { إِحْسَاناً } لإحسانهما إليكم في حفظكم وحضانتكم { وَ } أن { لاَ تَقْتُلُوۤاْ أَوْلاَدَكُمْ } ظلماً ناشئاً { مِّنْ } خوف { إمْلاَقٍ } فقر وقلة؛ إذ { نَّحْنُ نَرْزُقُكُمْ وَإِيَّاهُمْ } وأن { وَلاَ تَقْرَبُواْ ٱلْفَوَاحِشَ } القبيح { مَا ظَهَرَ مِنْهَا وَمَا بَطَنَ وَلاَ تَقْتُلُواْ ٱلنَّفْسَ ٱلَّتِي حَرَّمَ ٱللَّهُ إِلاَّ بِٱلْحَقِّ } كالقود وقتل المرتد ورجم الزاني المحصن وغيرها من المحارم التي رخص الشرع بارتكابها، إذا ارتكابها من جملة المحللات والمأمورات { ذٰلِكُمْ } المذكور مفصلاً مما { وَصَّاكُمْ بِهِ لَعَلَّكُمْ تَعْقِلُونَ } [الأنعام: 151] رجاء أن تسترشدوا لتهتدوا إلى توحيده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { تعالوا }: أمر من التعالي، وأصله: أن يقوله من كان في علو لمن كان في سفل، فاتسع فيه بالتعميم في كل أمر بالقدوم، و { ألاَّ تشركوا }: فيه تأويلات أحدها: أن تكون مفسرة لا موضع لها، و { لا }: ناهية جزمت الفعل، أو تكون مصدرية في موضع رفع، أي: الأمر ألاَّ تشركوا، و { لا }: نافية حينئذٍ، أو بدل من { ما } و { لا }: زائدة، أو على حذف الإغراء، أي: عليكم إلا تشركوا\n قال ابن جزي: والأحسن أن يكون ضَمَّنَ { حرَّم } معنى وَصَّى، وتكون { أن } مصدرية، و { لا } نافية، ولا تفسد المعنى لأن الوصية في المعنى تكون بتحريم وتحليل وبوجوب وندب، ويدل على هذا قوله بعد ذلك: { ذلكم وصاكم به } ولا ينكر أن يريد بالتحريم ـ الوصية لأن العرب قد تذكر اللفظ الخاص، وتريد به العموم، كما تذكر اللفظ العام وتريد به الخصوص، فتقدير الكلام على هذا: قل تعالوا أتل ما وصاكم به ربكم، ثم أبدل منه، على وجه التفسير والبيان، فقال: ألاَّ تشركوا، ووصاكم بالإحسان بالوالدين، وهكذا\n\n فجمعت الوصية ترك الإشراك وفعل الإحسان بالوالدين، وما بعد ذلك\n انظر بقية كلامه\n وإنما قال الحق سبحانه: { من إملاق } ، وقدّم الكاف في قوله { نرزقكم } ، وفي الإسراء قال:\n\n[الإِسرَاء:31]، وأخر الكاف لأن ما هنا نزل في فقراء العرب، فكان الإملاق نازلاً بهم وحاصلاً لديهم، فلذلك قال: { من إملاق } ، وقدم الخطاب لأنه أهم\n وفي الإسراء نزلت في أغنيائهم، فكانوا يقتلون خوفًا من لحوق الفقر، لذلك قال: { خشية إملاق } ، وقدم الغيبة فقال: { نحن نرزقهم } حين نخلقهم وإياكم\n يقول الحقّ جلّ جلاله: { قل } لهم: { تعالَوا } أي: هلموا، { أتلُ } أي: أقرأ { ما حرم ربكم عليكم } ، واجتمعت عليه الشرائع قبلكم، ولم يُنسخ قط في ملة من الملل، بل وصى به جميع الملل، و { ألاَّ تُشركوا به شيئًا } بل توحدوه وتعبدوه وحده، { و } أن تحسنوا { بالوالدين إحسانًا } ، ولا تُسيئوا إليهما لأن من أساء إليهما لم يحسن إليهما\n { ولا تقتلوا أولادكم من إملاق } أي: من أجل الفقر الحاصل بكم، وكانت العرب تقتل أولادها خوفًا من الفقر فنزلت فيهم، فلا يفهم منه إباحة قتلهم لغيره، { نحن نرزقكم وإياهم } ، فلا تهتموا بأمرهم حتى تقتلوهم\n { ولا تقربوا الفواحش } كبار الذنوب { ما ظهر منها } للناس { وما بَطَنَ } في خلوة، أو: ما ظهر منها على الجوارح، وما بطن في القلوب من العيوب، { ولا تقتلوا النفس التي حرَّم الله إلا بالحق } كالقود، وقتل المرتد، ورجم المحصن\n قال صلى الله عليه وسلم:\n\n \" لا يحلُّ دَمُ امرىءٍ مُسلمٍ إلا بإحدى ثلاثٍ: زِنَىً بعد إحصَانٍ، وكُفرٍ بعد إيمَانٍ، وقَتل نَفسٍ بغيرِ نَفسٍ \" \n\n \n\n{ ذلكم } المتقدم، { وصّاكم به لعلكم تعقلون } ، فتتدبرون فيما ينفعكم وما يضركم\n { ولا تقربوا مال اليتيم إلا بالتي } بالخصلة التي { هي أحسن } كحفظه وتثميره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:31",
      "similarity": 0.7672431165513515
    },
    {
      "verse": "7:33",
      "similarity": 0.25366942825742056
    },
    {
      "verse": "4:131",
      "similarity": 0.19271086196820897
    },
    {
      "verse": "29:8",
      "similarity": 0.15226545100906333
    },
    {
      "verse": "2:180",
      "similarity": 0.14893257820106762
    }
  ]
}