{
  "chapter": "الأنعام",
  "text": "من جاء بالحسنة فله عشر امثالها ومن جاء بالسيئة فلا يجزى الا مثلها وهم لا يظلمون",
  "translations": [
    {
      "translation": "Those who produce a good action will receive ten like it. But those who produce a bad action will only be repaid with its equivalent and they will not be wronged.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who does a good deed will receive ten times its worth; and he who does evil will be requited to an equal degree; and no one will be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever will come to Allah with a good deed shall have ten times as much, and whoever will come to Allah with an evil deed, shall be requited with no more than the like of it. They shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For a single good deed, one will be rewarded tenfold. But the recompense for a bad deed will be equal to that of the deed and no injustice will be done to anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For one who brings one good deed, are ten like it; and one who brings an ill-deed will not be repaid but with one like it, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever brings a good deed shall have ten times the like thereof to his credit, and whoever brings an evil deed shall have only the recompense of the like thereof, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever brings a good deed, he shall have ten like it, and whoever brings an evil deed, he shall be recompensed only with the like of it, and they shall not be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso brings a good deed shall have ten the like of it; and whoso brings an evil deed shall only be recompensed the like of it; they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso bringeth a good deed will receive tenfold the like thereof, while whoso bringeth an ill-deed will be awarded but the like thereof; and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever does a good deed will be repaid tenfold, but those who do a bad deed will only be repaid with its equivalent and they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever will come with a virtue for him shall be then like thereof, and whosoever will come with a vice shall not be requited save with the like thereof; and they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever brings virtue shall receive [a reward] ten times its like; but whoever brings vice shall not be requited except with its like, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He that doeth good shall have ten times as much to his credit: He that doeth evil shall only be recompensed according to his evil: no wrong shall be done unto (any of) them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever brings a good deed (Islamic Monotheism and deeds of obedience to Allah and His Messenger SAW) shall have ten times the like thereof to his credit, and whoever brings an evil deed (polytheism, disbelief, hypocrisy, and deeds of disobedience to Allah and His Messenger SAW) shall have only the recompense of the like thereof, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who brings a good deed shall have tenfold of its like, but he who brings a sin shall be recompensed only for its like. None shall be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever comes up with a good deed will have ten times its like; and whoever comes up with an evil deed will be repaid only with its equivalent—they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever comes [on the Day of Judgement] with a good deed will have ten times the like thereof [to his credit], and whoever comes with an evil deed will not be recompensed except the like thereof; and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:160] Whoever brings a good deed, that is, [the affirmation of] ‘there is no god but God’, shall receive tenfold the like of it, that is, the reward for ten good deeds, and whoever brings an evil deed shall only be requited the like of it, that is, its [appropriate] requital; and they shall not be wronged, nothing shall be diminished from their [just] requital.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whoso bringeth a good deed) while confessing Allah's divine Oneness (will receive tenfold the like thereof, while whoso bringeth an ill deed) while ascribing partners to Allah (will be awarded but the like thereof) i.e. the Fire; (and they will not be wronged) their good deeds will not be diminished nor will their bad deeds be increased.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { من جاء بالحسنة فله عشر أمثالها } هذا أقلّ درجات الثواب وذلك أنّ الحسنة تصدر بظهور القلب\n والسيئة بظهور النفس\n فأقلّ درجات ثوابها أنه يصل إلى مقام القلب الذي يتلو مقام النفس في الارتقاء تلو مرتبة العشرات للآحاد في الأعداد\n { ومن جاء بالسيئة فلا يجزى إلا مثلها } لأنه لا مقام أدون من مقام النفس\n فينحط إليه بالضرورة فيرى جزاءه في مقام النفس بالمثل\n ومن هذا يعلم أن الثواب من باب الفضل فإنه يزيد به صاحبه ويتنوّر استعداده ويزداد قبوله لفيض الحق فيتقوّى على إضعاف ما فعل ويكتسب به أجوراً متضاعفة إلى غير نهاية بازدياد القبول عند فعل كل حسنة\n وزيادة القدرة والشغف على الحسنة عند زيادة الفيض إلى ما لا يعلمه إلا الله\n كما قال بعد ذكر أضعافها إلى سبعمائة:\n[البقرة\n الآية: 261] وأن العقاب من باب العدل\n إذ العدل يقتضي المساواة ومن فعل بالنفس إذا لم يعف عنه يجازى بالنفس سواء وتذكر ما قيل في قوله تعالى:\n[البقرة\n الآية: 286] فإن الفضيلة للإنسان ذاتية موجبة لترقيه البتة\n والرذيلة عارضة ظلمتها للفطرة\n فمهما لم تكن بقصد ونيّة من صاحبها أو كانت ولم يصرّ عليها\n عفي عنها ولم تحجب صاحبها\n وإن كانت وأصر عليها جوزي في مقام النفس بالمثل\n والحسنة والسيئة المذكورتان ههنا من قبيل الأعمال وإلا فربّ سيئة من شخص تعادل حسنة من غيره\n كما قال عليه السلام: \" حسنات الأبرار سيئات المقرّبين \" \n بوجود القلب عند الشهود\n وسيئات الأبرار بظهور النفس عند السلوك\n وحسناتهم بظهور القلب\n وربّ سيئة توجب حجاب الأبد كاعتقاد الشرك مثلاً",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { مَن جَآءَ بِٱلْحَسَنَةِ } فيها { فَلَهُ } على مقتضى الفضل الإلهي { عَشْرُ أَمْثَالِهَا } امتناناً عليه وجزاء له { وَمَن جَآءَ بِٱلسَّيِّئَةِ } فيها { فَلاَ يُجْزَىۤ إِلاَّ مِثْلَهَا } على مقتضى العدل الإلهي { وَهُمْ } في جزاء السيئة { لاَ يُظْلَمُونَ } [الأنعام: 160] بالزيادة\n إذ لا ظلم في ذلك اليوم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { من جاء بالحسنة } قولية أو فعلية أو قلبية، { فله عشر أمثالها } من الحسنات، فضلاً من الله، وهذا أقل ما وعد من الأضعاف، وقد جاء الوعد بسبعين وسبعمائة، وبغير حساب، ولذلك قيل: المراد بالعشر: الكثرة دون العدد، { ومن جاء بالسيئة فلا يُجزى إلا مثلها } قضية للعدل، { وهم لا يظلمون } بنفس الثواب وزيادة العقاب. الإشارة: إنما تضاعف أعمال الجوارح وما كان من قبل النيات، وأما أعمال القلوب فأجرها بغير حساب، قال تعالى:\n[الزُّمَر:10]، وقال صلى الله عليه وسلم:\n \" تفكر ساعة أفضل من عبادة سبعين سنة \" \nوقا الشاعر:\nوقد تقدم هذا في سورة البقرة. ثم إن تضعيف الحسنات إنما يكون لمن تمسك بالدين القيم، وهو الذي أشار إليه بقوله: { قُلْ إِنَّنِي هَدَانِي رَبِّيۤ إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:2",
      "similarity": 0.5969463175474069
    },
    {
      "verse": "26:214",
      "similarity": 0.5675137307201998
    },
    {
      "verse": "28:84",
      "similarity": 0.5005848969092783
    },
    {
      "verse": "34:45",
      "similarity": 0.42764369075077807
    },
    {
      "verse": "22:13",
      "similarity": 0.42058597500628925
    }
  ]
}