{
  "chapter": "الأنعام",
  "text": "وهو الذى جعلكم خلئف الارض ورفع بعضكم فوق بعض درجت ليبلوكم فى ما ءاتىكم ان ربك سريع العقاب وانه لغفور رحيمۢ",
  "translations": [
    {
      "translation": "It is He who appointed you khalifs on the earth and raised some of you above others in rank so He could test you regarding what He has given you. Your Lord is Swift in Retribution; and He is Ever-Forgiving, Most",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made you trustees on the earth, and exalted some in rank over others in order to try you by what He has given you. Indeed your Lord's retribution is swift, yet He is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For He it is Who has appointed you vicegerent over the earth, and has exalted some of you over others in rank that He may try you in what He has bestowed is upon you. Indeed your Lord is swift in retribution, and He is certainly AllForgiving, All-Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On earth, We have made each of your generations the successors of their predecessors; We have made some of you do good deeds of a higher degree than others. He will test you in this way through what He has revealed to you. Your Lord's retribution is swift and He is certainly All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who made you caliphs (viceroys) in the earth and ranked some of you high above others, in order that He may test you with what He has bestowed upon you; indeed it does not take time for your Lord to mete out punishment; and indeed, surely, He is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who has made you generations coming after generations, replacing each other on the earth. And He has raised you in ranks, some above others that He may try you in that which He has bestowed on you. Surely, your Lord is Swift in retribution, and certainly He is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has made you successors in the land and raised some of you above others by (various) grades, that He might try you by what He has given you; surely your Lord is quick to requite (evil), and He is most surely the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has appointed you viceroys in the earth, and has raised some of you in rank above others, that He may try you in what He has given you. Surely thy Lord is swift in retribution; and surely He is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who hath placed you as viceroys of the earth and hath exalted some of you in rank above others, that He may try you by (the test of) that which He hath given you. Lo! Thy Lord is swift in prosecution, and Lo! He verily is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has made you successors [of others] on the earth and has exalted some of you over the others in degrees of rank, so that He may test you by that which He has given you. Your Lord is swift in punishment; yet surely He is forgiving, and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who hath made you successors in the earth, and hath raised some of you over others in degrees, that he might prove you by that which He hath vouchsafed unto you. Verily thy Lord is swift in chastising, and verily He is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has made you successors on the earth, and raised some of you in rank above others so that He may test you in respect to what He has given you. Indeed your Lord is swift in retribution, and indeed, He is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who hath made you (His) agents, inheritors of the earth: He hath raised you in ranks, some above others: that He may try you in the gifts He hath given you: for thy Lord is quick in punishment: yet He is indeed Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who has made you generations coming after generations, replacing each other on the earth. And He has raised you in ranks, some above others that He may try you in that which He has bestowed on you. Surely your Lord is Swift in retribution, and certainly He is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has made you caliphs in the earth and raised some of you in rank above others, so that He might try you in what He has given you. Swift is your Lord in retribution; yet He is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made you successors on the earth, and raised some of you in ranks over others, in order to test you through what He has given you. Your Lord is Quick in retribution, and He is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who has made you successors upon the earth and has raised some of you above others in degrees [of rank] that He may try you through what He has given you. Indeed, your Lord is swift in penalty; but indeed, He is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:165] And He it is Who has made you successors (khalā’if is the plural of khalīfa), in other words, [He has made you] to succeed one another therein, in the earth and has raised some of you above others in degrees, through wealth and status and otherwise, so that He may try you, that He may test you, in what He has given you, in order to manifest the obedient among you and the disobedient. Surely your Lord is swift in punishment, of those who disobey Him; and surely He is Forgiving, to believers, Merciful, to them. Meccan, except for verses 163-170 inclusive, which are Medinese: it consists of 205 or 206 verses, and was revealed after [sūrat] Sād.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is who hath placed you as vicegerents of the earth) in the place of past nations (and hath exalted some of you in rank above others) in merit in terms of wealth and servants, (that He may try you) that He may test you (by (the test of) that which He hath given you) of wealth and servants. (Lo! Thy Lord is swift in prosecution) towards the one who disbelieves in Him or who does not give thanks to Him, (and lo! He is Forgiving) He pardons, (Merciful) towards the person who believes in Him'. And of the surah in which the Heights are mentioned, which is Meccan in its entirety, and comprises 206 verses, 3,625 words and 14,310 letters: Surah 7: The Heights (al-A'raf) And of the surah in which the Heights are mentioned, which is Meccan in its entirety, and comprises 206 verses, 3,625 words and 14,310 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { وهو الذي جعلكم خلائف الأرض } أي: يخلف بعضكم بعضًا، أو خلفاء الله في أرضه تتصرفون فيها بإذنه، على أن الخطاب عام، أو خلفاء الأمم السابقة، على أن الخطاب للمسلمين، { ورفع بعضكم فوق بعض درجات } في الشرف والغناء والقوة والجاه، وفي العلوم والأعمال والأحوال والإخلاص والمعارف، وغير ذلك مما يقع به التفاضل بين العباد، { ليبلوكم فيما آتاكم } أي: ليختبر شكركم على ما أعطاكم، وأعمالَكم فيما مكنكم فيه من الخلافة. { إن ربك سريع العقاب } لمن كفر نعمه، إما في الدنيا لمن عجل أخذه لأن كل آت قريب، { وإنه لغفور رحيم } لمن شكر نعمه وآمن وعمل بطاعته، جمع بين التخويف والترجيه ليكون العبد بينهما. وبالله التوفيق. الإشارة: من شرف هذا الآدمي أن جعله خليفة عنه، في ملكه، يتصرف فيه بنيابته عنه، ثم إن هذا التصرف يتفاوت على قدر الهمم، فبقدر ما ترتفع الهمة عن هذا العالم يقع للروح التصرف في هذا الوجود، فالعوام إنما يتصرفون فيما ملَّكهم الله من الأملاك الحسية. والخواص يتصرفون بالهمة في الوجود بأسره، وخواص الخواص يتصرفُون بالله، أمرُهم بأمر الله، إن قالوا لشيء: كن ـ يكون بإذن الله، مع إرادة الله وسابق علمه وقدره، وإلا فالهمم لا تخرق أسوار الأقدار، والحاصل: أن من بقي مع الأكوان شهودًا وافتقارًا، كان محبوسًا معها، ومن كان مع المكون كانت الأكوان معه، يتصرف فيها بإذن الله، خليفة عنه فيها، وهم متفاوتون في ذلك كما تقدم. وقال تعالى: { وهو الذي جعلكم خلائف الأرض } أي: خلفاء عنه تتصرفون في الوجود بأسره بأرواحكم، وأنتم في الأرض بأشباحكم، { ورفع بعضكم فوق بعض درجات } من أقطاب وأوتاد ونجباء ونقباء وغير ذلك، مما هو مذكور في محله. خرطنا الله في سلكهم ومنحنا ما منحهم، بمنَّه وكرمه، وبسيدنا محمد صلى الله عليه وسلم حبيبه ونبيه. آمين ـ والحمد لله رب العالمين.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:83",
      "similarity": 0.4543940826309452
    },
    {
      "verse": "43:32",
      "similarity": 0.4344136987897537
    },
    {
      "verse": "40:15",
      "similarity": 0.417644858467643
    },
    {
      "verse": "4:96",
      "similarity": 0.3957775735184727
    },
    {
      "verse": "17:21",
      "similarity": 0.36629084130839035
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/6:165.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/6:165.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:165.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}