{
  "chapter": "الأنعام",
  "text": "قل اننى هدىنى ربى الى صرط مستقيم دينا قيما ملة ابرهيم حنيفا وما كان من المشركين",
  "translations": [
    {
      "translation": "Say: 'My Lord has guided me to a straight path, a well-founded deen, the religion of Ibrahim, a man of pure natural belief. He was not one of the idolaters.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"My Lord has directed me to a path that is straight, a supreme law, the creed of Abraham the upright who was not an idolater.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'As for me, my Lord has guided me on to a straight way, a right religion, the way of Abraham who adopted it in exclusive devotion to Allah, and he was not of those who associated others with Allah in His divinity.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"My Lord has guided me to the right path, a well established religion and the upright tradition of Abraham who was not a pagan\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Indeed my Lord has guided me to the Straight Path; the right religion, (of) the community of Ibrahim who was free from all falsehood; and was not a polytheist.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Truly, my Lord has guided me to a straight path, a right religion, the religion of Ibrahim, Hanifan (monotheism) and he was not of the Mushrikin.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Surely, (as for) me, my Lord has guided me to the right path; (to) a most right religion, the faith of Ibrahim the upright one, and he was not of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'As for me, my Lord has guided me to a straight path, a right religion, the creed of Abraham, a man of pure faith; he was no idolater.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Lo! As for me, my Lord hath guided me unto a straight path, a right religion, the community of Abraham, the upright, who was no idolater.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"My Lord has guided me to a straight path, and to an upright religion, the religion of Abraham the upright, who was not of those who associate partners with God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou as for me, my Lord hath guided me unto a straight path, a right religion, the faith of Ibrahim, the upright, and he was not of the associaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Indeed my Lord has guided me to a straight path, the upright religion, the creed of Abraham, a Hanif, and he was not one of the polytheists.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Verily, my Lord hath guided me to a way that is straight,- a religion of right,- the path (trod) by Abraham the true in Faith, and he (certainly) joined not gods with Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Truly, my Lord has guided me to a Straight Path, a right religion, the religion of Ibrahim (Abraham), Hanifa [i.e. the true Islamic Monotheism - to believe in One God (Allah i.e. to worship none but Allah, Alone)] and he was not of Al-Mushrikun (see V. 2:105).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'My Lord has guided me to a Straight Path, an upright religion, the creed of Abraham, he was upright, not from the idolaters'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “My Lord has guided me to a straight path, an upright religion, the creed of Abraham the Monotheist, who was not a polytheist.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Indeed, my Lord has guided me to a straight path - a correct religion - the way of Abraham, inclining toward truth. And he was not among those who associated others with Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:161] Say: ‘As for me, my Lord has guided me to a straight path (ilā sirātin mustaqīm is substituted by [the following, dīnan qiyaman]) a right religion, an upright [one], the creed of Abraham, a hanīf; and he was not of the idolaters’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي للانتقال من مجادلة المشركين ، وما تخلّلها ، إلى فذلكة ما أُمر به الرّسول صلى الله عليه وسلم في هذا الشّأن ، غَلقاً لباب المجادلة مع المعرضين ، وإعلاناً بأنّه قد تقلّد لنفسه ما كان يجادلهم فيه ليتقلّدوه وأنَّه ثابت على ما جاءهم به ، وأنّ إعراضهم لا يزلزله عن الحقّ .وفيه إيذان بانتهاء السّورة لأنّ الواعظ والمناظر إذا أشبع الكلام في غرضه ، ثمّ أخذ يبين ما رَضِيه لِنفسه وما قَرّ عليه قَراره ، علم السّامع أنَّه قد أخذ يطوي سجلّ المحاجّة ، ولذلك غيّر الأسلوب . فأمر الرّسول صلى الله عليه وسلم بأن يقول أشياء يعلن بها أصول دينه ، وتكرّر الأمر بالقول ثلاث مرّات تنويهاً بالمقول .وقوله : { إنني هداني ربي } متصل بقوله : { وأنّ هذا صراطي مستقيماً فاتبعوه } \\[ الأنعام : 153 \\] الذي بيّنه بقوله : { وهذا كتاب أنزلناه مبارك } \\[ الأنعام : 92 \\] فزاده بياناً بقوله هذا : { قل إنني هداني ربي إلى صراط مستقيم } ، ليبيّن أنّ هذا الدّين إنَّما جاء به الرّسول صلى الله عليه وسلم بهدي من الله ، وأنَّه جعله ديناً قيّماً على قواعد ملّة إبراهيم عليه السّلام ، إلاّ أنَّه زائد عليه بما تضمّنه من نعمة الله عليه إذ هداه إلى ذلك الصّراط الذي هو سبيل النّجاة . وافتُتح الخبر بحرف التّأكيد لأنّ الخطاب للمشركين المكذّبين .وتعريف المسند إليه بالإضافة للاعتزاز بمربوبية الرّسول صلى الله عليه وسلم للَّه تعالى ، وتعريضاً بالمشركين الذين أضلّهم أربابهم ، ولو وحّدوا الربّ الحقيق بالعبادة لهداهم .وقوله : { هداني ربي إلى صراط مستقيم } تمثيليّة : شبّهت هيئة الإرشاد إلى الحقّ المبلّغ إلى النّجاة بهيئة من يدلّ السّائر على الطّريق المبلّغة للمقصود .والمناسبة بين الهداية وبين الصّراط تامّة ، لأنّ حقيقة الهداية التّعريف بالطّريق ، يقال : هو هاد خِرّيت ، وحقيقة الصّراط الطّريق الواسعة . وقد صحّ أن تستعار الهداية للإرشاد والتّعليم ، والصّراطُ للدين القويم ، فكان تشبيهاً مركّباً قابلاً للتفكيك وهو أكمل أحوال التّمثيليّة .ووُصف الصّراط بالمستقيم ، أي الذي لا خطَأ فيه ولا فساد ، وقد تقدّم عند قوله تعالى : { وأنّ هذا صراطي مستقيماً فاتبعوه } \\[ الأنعام : 153 \\] ، والمقصود إتمام هيئة التّشبيه بأنَّه دين لا يتطرّق متّبعه شكّ في نفعه كما لا يتردّد سالك الطّريق الواسعة التي لا انعطاف فيها ولا يتحيَّر في أمره .وفي قوله : { ديناً } تجريد للاستعارة مؤذن بالمشبّه ، وانتصب على الحال من : { صراط } لأنَّه نكرة موصوفة .والدّين تقدّم عند قوله تعالى : { إن الدِّين عند الله الإسلام } \\[ آل عمران : 19 \\] وهو السّيرة التي يتّبعها النّاس .والقَيِّم بفتح القاف وتشديد الياء كما قرأه نافع ، وابن كثير ، وأبو عمرو ، وأبو جعفر ، ويعقوب : وصف مبالغة قَائم بمعنى معتدل غير معوج ، وإطلاق القيام على الاعتدال والاستقامة مجاز ، لأنّ المرء إذا قام اعتدلت قامته ، فيلزم الاعتدال القيام .والأحسن أن نجعل القيم للمبالغة في القيام بالأمر ، وهو مرادف القيّوم ، فيستعار القيام للكفاية بما يحتاج إليه والوفاء بما فيه صلاح المقوّم عليه ، فالإسلام قيّم بالأمّة وحاجتها ، يقال : فلان قيّم على كذا ، بمعنى مدبّر له ومصلح ، ومنه وصف الله تعالى بالقيُّوم ، وهذا أحسن لأنّ فيه زيادة على مفاد مستقيم الذي أخذ جزءاً من التّمثيليّة ، فلا تكون إعادة لبعض التّشبيه .وقرأ عاصم ، وحمزة ، وابن عامر ، والكسائي ، وخلف : { قيماً } بكسر القاف وفتح الياء مخفّفة وهو من صيغ مصادر قام ، فهو وصف للدّين بمصدر القيام المقصودِ به كفاية المصلحة للمبالغة ، وهذه زنة قليلة في المصادر ، وقَلْبُ واوه ياء بعد الكسرة على غير الغالب : لأنّ الغالب فيه تصحيح لامِه لأنَّها مفتوحة ، فسواء في خفّتِها وقوعها على الواو أو على الياء ، مثل عِوَض وحِوَل ، وهذَا كشذوذ جياد جمع جواد ، وانتصب { قيماً } على الوصف ل { دينا }.وقوله : { ملة إبراهيم } حال من : { ديناً } أو من : { صراط مستقيم } أو عطفُ بيان على { ديناً }.والملّة ، الدّين : فهي مرادفة الدين ، فالتَّعبير بها هنا للتَّفنّن ألا ترى إلى قوله تعالى : { ووصى بها إبراهيم بنيه ويعقوب يا بني إن الله اصطفى لكم الدين } \\[ البقرة : 132 \\].و { ملّة } فِعْلة بمعنى المفعول ، أي المملول ، من أمللت الكتاب إذا لقَّنت الكاتب ما يَكتب ، وكان حقّها أن لا تقترن بهاء التّأنيث لأنّ زنة ( فِعْل ) بمعنى المفعول تلزم التّذكير ، كالذِّبح ، إلاّ أنَّهم قرنوها بهاء التّأنيث لما صيّروها اسماً للدّين ، ولذلك قال الرّاغب : الملّة كالدّين ، ثمّ قال : «والفرق بينها وبين الدّين أنّ الملّة لا تضاف إلاّ إلى النَّبيء الذي تسند إليه نحو ملّة إبراهيم ، ملّة آبائي ، ولا توجد مضافة إلى الله ولا إلى آحاد الأمّة ، ولا تستعمل إلاّ في جملة الشّريعة دون آحادها لا يقال الصّلاة ملّة الله» أي ويقال : الصّلاةُ دين الله ذلك أنَّه يراعى في لفظ الملّة أنَّها مملول من الله فهي تضاف للّذي أُمِلَّت عليه .ومعنى كون الإسلام ملّةَ إبراهيم : أنَّه جاء بالأصول التي هي شريعة إبراهيم وهي : التّوحيد ، ومسايرة الفطرة ، والشّكر ، والسّماحة ، وإعلان الحقّ ، وقد بيَّنتُ ذلك عند قوله تعالى : { ما كان إبراهيم يهودياً ولا نصرانياً ولكن كان حنيفاً مسلماً } في سورة آل عمران ( 67 ).والحنيف : المُجانب للباطل ، فهو بمعنى المهتدي ، وقد تقدّم عند قوله تعالى : { قل بل مِلَّة إبراهيم حنيفاً وما كان من المشركين } في سورة البقرة ( 135 ). وهو منصوب على الحال .وجملة : وما كان من المشركين } عطف على الحال من { إبراهيم } عليه السّلام المضاف إليه ، لأنّ المضاف هنا كالجزاء من المضاف إليه ، وقد تقدّم في آية سورة البقرة .\n\n",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the people of Mecca, the Jews and to the Christians: (Lo! As for me, my Lord hath guided me unto a straight path) my Lord has honoured me with His religion and has commanded me to call people to His religion; it is also said that this means: my Lord has shown how to call people to His to (a right religion, the community of Abraham) the religion of Abraham, (the upright) who surrendered to Allah and (who was no idolater) he did not follow the idolaters in their religion. 155\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِّلَّةَ إِبْرَاهِيمَ حَنِيفاً } معناهُ دِينَ إِبْرَاهيمَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"the religion of Ibrahim,\" means the religion of Ibrahim.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قل إنني هداني ربّي إلى صراط مستقيم } إلى طريق التوحيد الذاتي { ديناً قيماً } ثابتاً أبداً لا تغيره الملل والنِحل ولا تنسخه الشرائع والكتب { ملّة إبراهيم } التي أعرض بها عن كل ما سواه بالترقي عن جميع المراتب مائلاً عن كل دين وطريق باطل فيه شرك ما\n ولو بصفة من صفات الله تعالى\n { قل إن صلاتي } أي: حضوري بالقلب وشهودي بالروح { ونسكي } أي: تقرّبي أو كل ما أتقرّب به بالقلب { ومحياي } بالحق { ومماتي } بالنفس كلها { لله } لا نصيب لي ولا لأحد غيري فيها لأني قمت به له بالفناء فلا وجود لي ولا لغيري حتى يكون لي حظ ونصيب { ربّ العالمين } أي: له باعتبار الجمع في صورة تفاصيل الربوبية { لا شريك له } في ذلك جمعاً وتفصيلاً { وبذلك أُمرت } أي: أُمرت أن لا أرى غيره في عين الجمع ولا في صورة التفاصيل حتى أعمل له كما وصفني تعالى بقوله:\n[النجم\n الآية: 17] فهو الآخر والمأمور",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل المبعوث إلى كافة البرايا: { إِنَّنِي } مع كوني بشراً مثلكم { هَدَانِي رَبِّيۤ } الذي رباني بأنواع اللطف والكرم { إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ } موصل إلى توحيده الذاتي\n وآتاني من فضله { دِيناً قِيَماً } قومياً مستقيماً { مِّلَّةَ إِبْرَاهِيمَ حَنِيفاً } مائلاً عن الأديان الباطلة والآراء الفاسدة لذلك { وَمَا كَانَ مِنَ ٱلْمُشْرِكِينَ } [الأنعام: 161] في وقت من الأوقات\n\n\n{ قُلْ } يا أكمل الرسل المظهر للتوحيد الذاتي مفوضاً جميع أمورك وما جرى عليك وظهر منك إلى ربك: { إِنَّ صَلاَتِي } إي: ميلي بجميع أعضائي وجوارحي { وَ } سائر { نُسُكِي } وعبادتي التي هي سبب تقريبي وتوسلي نحو الحق { وَ } بالجملة: لوازم { مَحْيَايَ وَمَمَاتِي } خالصاً { لِلَّهِ } المتوحد المتصرف في ملكه وملوكته بما يشاء بالاستقلال والاختيار لكونه { رَبِّ ٱلْعَالَمِينَ } [الأنعام: 162]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { دينًا }: بدل من محل، \" صراط \" لأن الأصل: هداني صراطًا مستقيمًا دينًا قيمًا، و { قَيَّمًا }: فيعل من القيام، فهو أبلغ من مستقيم، ومن قرأ بكسر القاف: فهو مصدر وصف به للمبالغة، و { ملة إبراهيم }: عطف بيان الدين، { وحنيفًا }: حال من إبراهيم. يقول الحقّ جلّ جلاله: { قل } لهم: { إنني هداني ربي إلى صراط مستقيم } بالوحي والإرشاد إلى ما نصب من الحجج والآيات، { دينًا قيمًا } مستقيمًا يوصل من تمسك به إلى جوار الكريم، في حضرة النعيم، وهو { ملة إبراهيم } أي: دينه، حال كونه { حنيفًا }: مائلاً عما سوى الله، { وما كان من المشركين } ، وهو تعريض لقريش، الذين يزعمون أنهم على دينه، وقد أشركوا بالله عبادة الأوثان. الإشارة: قد أخذ الصوفية من هذا الدين القيم، الذي هدى الله إليه نبيه ـ عليه الصلاة والسلام ـ خلاصته ولبابه، فأخذوا من عقائد التوحيد: الشهود والعيان على طريق الذوق والوجدان ولم يقنعوا بالدليل والبرهان، وأخذوا من الصلاة: صلاة القلوب، فهم على صلاتهم دائمون مع صلاة الجوارح، على نعت قوله:\n[المؤمنون:2]، وأخذوا من الزكاة: زكاة نفوسهم بالرياضة والتأديب وإضافة الكل إليه.  العبد وما كسب لسيده، مع أداء الزكاة الشرعية لمن وجبت عليه. وكان الشيخ أبو العباس السبتي رضي الله عنه يعطي تسعة أعشار زرعه، ويمسك العشر لنفسه. وأخذوا من الصيام: صيام الجوارح كلها، مع صيام القلب عن شهود السِّوى. وأخذوا من الحج: حج القلوب إلى حضرة علام الغيوب، فالكعبة تشتاق إليهم وتطوف بهم، كما تقدم في آل عمران، ومن الجهاد: الجهاد الأكبر، وهو جهاد النفوس، وهكذا مراسم الشريعة كلها عندهم صافية خالصة من الشوائب، بخلاف غيرهم، فلم يأخذ منها إلا قشرها الظاهر وعمل الأشباح، فهي صُور قائمة لا روح فيها لعدم الإخلاص والحضور فيها. والله تعالى أعلم. ثم بيَّن مقام الإخلاص، فقال: { قُلْ إِنَّ صَلاَتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:95",
      "similarity": 0.8585077728150324
    },
    {
      "verse": "16:123",
      "similarity": 0.838061494259961
    },
    {
      "verse": "2:135",
      "similarity": 0.7898659606755404
    },
    {
      "verse": "4:125",
      "similarity": 0.6902121413019143
    },
    {
      "verse": "10:105",
      "similarity": 0.617313533208514
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006161.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006161.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:161.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}