{
  "chapter": "الأنعام",
  "text": "قل اغير الله ابغى ربا وهو رب كل شىء ولا تكسب كل نفس الا عليها ولا تزر وازرة وزر اخرى ثم الى ربكم مرجعكم فينبئكم بما كنتم فيه تختلفون",
  "translations": [
    {
      "translation": "Say: 'Am I to desire other than Allah as Lord when He is the Lord of all things?' What each self earns is for itself alone. No burden-bearer can bear another's burden. Then you will return to your Lord, and He will inform you regarding the things about which you differed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Shall I search for another lord apart from God when He is the only Lord of all and everything?\" Each soul earns (what it earns) for itself, and no man shall bear another's burden. You have to go back to your Lord in the end when He will tell you about the things you disputed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Shall I seek someone other than Allah as Lord when He is the Lord of everything?' Everyone will bear the consequence of what he does, and no one shall bear the burden of another. Thereafter, your return will be to your Lord, whereupon He will let you know what you disagreed about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"Should I take a lord besides God when He is the Lord of all things?\" All one's evil deeds are against one's own soul. No one will be considered responsible for another's sins. You will all be returned to your Lord who will tell you what is right and wrong in disputed matters among you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Shall I seek a Lord other than Allah, whereas He is Lord of all things?” And whatever a soul earns is itself responsible for it; and no load bearing soul will bear anyone else’s load; then towards your Lord you have to return and He will inform you about the matters you differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Shall I seek a lord other than Allah, while He is the Lord of all things No person earns any (sin) except against himself (only), and no bearer of burdens shall bear the burden of another. Then unto your Lord is your return, so He will tell you that wherein you have been differing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: What! shall I seek a Lord other than Allah? And He is the Lord of all things; and no soul earns (evil) but against itself, and no bearer of burden shall bear the burden of another; then to your Lord is your return, so He will inform you of that in which you differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Shall I seek after a Lord other than God, who is the Lord of all things?' Every soul earns only to its own account, no soul laden bears the load of another. Then to your Lord shall you return, and He will tell you of that whereon you were at variance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Shall I seek another than Allah for Lord, when He is Lord of all things? Each soul earneth only on its own account, nor doth any laden bear another's load. Then unto your Lord is your return and He will tell you that wherein ye differed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Shall I seek a lord other than God, while He is the Lord of all things?\" Everyone must bear the consequence of what he does, and no bearer of a burden can bear the burden of another. Then to your Lord you will return, and He will inform you of what you used to dispute about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: shall seek a Lord other than Allah, while He is the Lord of everything? And no person earneth aught save against himself, and no bearer of burden shall bear anot her's burden. Thereafter Unto your Lord shall be your return, and He will declare unto you that wherein ye have been disputing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Shall I seek a Lord other than Allah, while He is the Lord of all things?’ No soul does evil except against itself, and no bearer shall bear another’s burden; then to your Lord will be your return, whereat He will inform you concerning that about which you used to differ.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Shall I seek for (my) Cherisher other than Allah, when He is the Cherisher of all things (that exist)? Every soul draws the meed of its acts on none but itself: no bearer of burdens can bear the burden of another. Your goal in the end is towards Allah: He will tell you the truth of the things wherein ye disputed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Shall I seek a lord other than Allah, while He is the Lord of all things? No person earns any (sin) except against himself (only), and no bearer of burdens shall bear the burden of another. Then unto your Lord is your return, so He will tell you that wherein you have been differing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Should I seek a lord other than Allah, who is the Lord of all things? Every soul earns only to its account no soul shall bear another's burden. Then to your Lord you shall be returned, and He will inform you about that in which you differed'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Am I to seek a Lord other than God, when He is the Lord of all things?” No soul gets except what it is due, and no soul bears the burdens of another. Then to your Lord is your return, then He will inform you regarding your disputes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Is it other than Allah I should desire as a lord while He is the Lord of all things? And every soul earns not [blame] except against itself, and no bearer of burdens will bear the burden of another. Then to your Lord is your return, and He will inform you concerning that over which you used to differ.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:164] Say: ‘Shall I seek any other than God for a lord, for a god, in other words, I shall not seek any other than Him, when He is the Lord, the Possessor, of all things?’ Every soul earns, of sin, only against itself; and no burdened, [no] sinful, soul shall bear the burden of another, soul. Then to your Lord shall you return, and He will inform you of that over which you differed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad: (Shall I seek another than Allah for Lord) shall I worship other than Allah, (when He is Lord of all things) when everything is from Him? (Each soul earneth) of sins (only on its own account) as a punishment, (nor doth any laden bear another's load) of sins; it is also said that this means: no soul shall be taken to task for the sins of another soul; and it is also said that this means: no soul will be tormented for committing no sin; as it is said that this means: no soul bears the burden of another soul with pleasure; it does so only when it is forced. (Then unto your Lord is your return) after you die (and He will tell you that wherein) in Religion (you differed) you contravened.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل مستوبخاً مستقرعاً لمن عاندك في طريق التوحيد\n وجادلك بإثبات الشركاء له وتوقع موافقتك لشركه: { أَغَيْرَ ٱللَّهِ } المتوحد في ذاته\n المتفرد في ألوهيته { أَبْغِي } أتخذ وأطلب { رَبّاً } مربياً مولياً { وَ } الحال أنه { هُوَ } بذاته وأسمائه وأوصافه { رَبُّ كُلِّ شَيْءٍ } وخالقه وموجده من كتم العدم { وَ } إذا قلت لهم من كلمة الحق ما قلت دعمهم وشركهم\n إذ { لاَ تَكْسِبُ كُلُّ نَفْسٍ } من الجرائم والآثام { إِلاَّ } تحمل { عَلَيْهَا } أصارها وأثقالها { وَلاَ تَزِرُ } تقترف تحمل نفس { وَازِرَةٌ } عاصية كافرة { وِزْرَ أُخْرَىٰ } بل كل منها رهينة بما كسبت\n إن خيراً فخير وإن شراً فشر { ثُمَّ } بعد انقضاء النشأة الأولى { إِلَىٰ رَبِّكُمْ مَّرْجِعُكُمْ } رجوع الظل إلى ذي الظل { فَيُنَبِّئُكُمْ بِمَا كُنْتُمْ فِيهِ تَخْتَلِفُونَ } [الأنعام: 164] أي: يميز لكم الحق من الباطل والهداية من الضلال والعناية من الوبال والنكال\n\n\n{ وَ } كيف ينكرون توحيد الحق وترتبيته إياكم مع أنه سبحانه { هُوَ ٱلَّذِي جَعَلَكُمْ خَلاَئِفَ ٱلأَرْضِ } أي: خلفاء قابلين لمظهرية جميع أوصافه { وَرَفَعَ بَعْضَكُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ } في الاتصاف بأوصافه والتخلق بأخلاقه { لِّيَبْلُوَكُمْ } ويختبركم { فِي مَآ آتَاكُمْ } من استعداداتكم وقابليتكم هل تصرفها إلى ما خلقتم لأجله أم لا { إِنَّ رَبَّكَ } يا أكمل الرسل { سَرِيعُ ٱلْعِقَابِ } على صنيع استعداده الفطري فيما لا يعنيه { وَإِنَّهُ } أيضاً { لَغَفُورٌ } لمن تنبه استغفر { رَّحِيمٌ } [الأنعام: 165] لمن تاب واستهدى\n\n\nخاتمة سورة الأنعام\n\nعليك أيها المتوجه نحو الحق القاصد سلوك طريق توحيده\n أنجح الله أملك وأوصلك إلى مبتغاك أن تنخلع وتتجرد عن متقضيات القوى النفسانية من لذاتها وشهواتها الحسية والوهمية والخيالية\n وتتوجه بما فيك من مبادئ القوى الروحانية إلى مبدئها\n مقتفياً في توجهك أثر ما وصل إليك من آثار النبي صلى الله عليه وسلم المختار\n الذي استخلفه الحق وأظهره على مقتضى جميع أوصافه وأسمائه\n واجتباه من بين جميع رسله وأنبيائه\n وأرسله مظهراً للتوحيد الذاتي وأنزل عليه كتاباً جامعاً محتوياً على جميع فوائد الكتب السالفة مع زيادات خلت عنها الجميع\n مبيناً لطريق التوحيد على الوجه الأتم الأكمل إلى حيث لم يبقَ بعد بعثته احتياج إلى مبين آخر\n لذلك قال سبحانه:\n\n[المائدة: 3]\n وقال صلى الله عليه وسلم: \" بعثت لأتمم مكارم الأخلاق \"\n\n\nوبعد بعثته صلى الله عليه وسلم ونزول الكتاب لم يبقَ للمسترشد المستهدي نحو التوحيد الذاتي إلا الاتصاف والامتثال بما جاء به خاتم الرسالة\n لذلك لم يكن الاجتهاد بعد بعثته إلا في جزيئات الأحكام دون المعتقدات الكلية\n إذ خُتم أمر الرسالة والتشريع به صلى الله عليه وسلم\n ولا بدَّ لك أن تربط قلبك بمرتبته صلى الله عليه وسلم وتجعلها قبلة مقصدك\n وتقتفي أثر ما ورد عليه وجاء به صلى الله عليه وسلم بحيث لا يهمل منها شيء\n ولا بدَّ أن يكون في متابعته صلى الله عليه وسلم على وثوق تام واطمئنان كامل\n عارٍ عن جميع ما يشوشك من ظلمات الشكوك والأوهام\n خالٍ عن جميع الرعونات العارضة من وساوس شياطين الأهواء الفاسدة مثل العجب والرياء والسمعة وغيرها\n\n\nوبالجلمة: عليك أن تتوجه نحو التوحيد عن طريق الفناء والموت الأرادي\n بحيث لا يصدر عنك شيء من أمارات الحياة الضرورية ومقتضيات القوى البشرية\n حتى يتيسر لك التحقق بمقام الخلة\n والتخلق بأخلاق الله\n مع توفيق من قبل الحق وجذب من جانبه\n إذ كل ميسر لما خلق له\n ومتى صفيت سرك وسريرتك عن جميع ما يشغلك عن الله ويضلك عن سبيله\n تحققت بمقام التوحيد\n وفنيت عن مقتضيات أمارات التخمين والتقليد\n وصرت على يقين من ربك وكشف وشهود لا تضمأ منه أصلاً ولا تروى أبداً\n وحينئذٍ حق لك أن تقول حقاً: { إِنَّ صَلاَتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي لِلَّهِ رَبِّ ٱلْعَالَمِينَ * لاَ شَرِيكَ لَهُ } [الأنعام: 162-163]\n\n\n[الكهف: 10]",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "53:38",
      "similarity": 0.6430806672711588
    },
    {
      "verse": "17:15",
      "similarity": 0.5886908411314395
    },
    {
      "verse": "20:29",
      "similarity": 0.5877759410747503
    },
    {
      "verse": "39:7",
      "similarity": 0.5818563568027988
    },
    {
      "verse": "75:11",
      "similarity": 0.5523025872307638
    }
  ]
}