{
  "chapter": "الأنعام",
  "text": "من جاء بالحسنة فله عشر امثالها ومن جاء بالسيئة فلا يجزى الا مثلها وهم لا يظلمون",
  "translations": [
    {
      "translation": "Those who produce a good action will receive ten like it. But those who produce a bad action will only be repaid with its equivalent and they will not be wronged.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who does a good deed will receive ten times its worth; and he who does evil will be requited to an equal degree; and no one will be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever will come to Allah with a good deed shall have ten times as much, and whoever will come to Allah with an evil deed, shall be requited with no more than the like of it. They shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For a single good deed, one will be rewarded tenfold. But the recompense for a bad deed will be equal to that of the deed and no injustice will be done to anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For one who brings one good deed, are ten like it; and one who brings an ill-deed will not be repaid but with one like it, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever brings a good deed shall have ten times the like thereof to his credit, and whoever brings an evil deed shall have only the recompense of the like thereof, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever brings a good deed, he shall have ten like it, and whoever brings an evil deed, he shall be recompensed only with the like of it, and they shall not be dealt with unjustly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso brings a good deed shall have ten the like of it; and whoso brings an evil deed shall only be recompensed the like of it; they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoso bringeth a good deed will receive tenfold the like thereof, while whoso bringeth an ill-deed will be awarded but the like thereof; and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever does a good deed will be repaid tenfold, but those who do a bad deed will only be repaid with its equivalent and they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whosoever will come with a virtue for him shall be then like thereof, and whosoever will come with a vice shall not be requited save with the like thereof; and they shall not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever brings virtue shall receive [a reward] ten times its like; but whoever brings vice shall not be requited except with its like, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He that doeth good shall have ten times as much to his credit: He that doeth evil shall only be recompensed according to his evil: no wrong shall be done unto (any of) them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever brings a good deed (Islamic Monotheism and deeds of obedience to Allah and His Messenger SAW) shall have ten times the like thereof to his credit, and whoever brings an evil deed (polytheism, disbelief, hypocrisy, and deeds of disobedience to Allah and His Messenger SAW) shall have only the recompense of the like thereof, and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He who brings a good deed shall have tenfold of its like, but he who brings a sin shall be recompensed only for its like. None shall be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever comes up with a good deed will have ten times its like; and whoever comes up with an evil deed will be repaid only with its equivalent—they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whoever comes [on the Day of Judgement] with a good deed will have ten times the like thereof [to his credit], and whoever comes with an evil deed will not be recompensed except the like thereof; and they will not be wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:160] Whoever brings a good deed, that is, [the affirmation of] ‘there is no god but God’, shall receive tenfold the like of it, that is, the reward for ten good deeds, and whoever brings an evil deed shall only be requited the like of it, that is, its [appropriate] requital; and they shall not be wronged, nothing shall be diminished from their [just] requital.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Whoso bringeth a good deed) while confessing Allah's divine Oneness (will receive tenfold the like thereof, while whoso bringeth an ill deed) while ascribing partners to Allah (will be awarded but the like thereof) i.e. the Fire; (and they will not be wronged) their good deeds will not be diminished nor will their bad deeds be increased.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { من جاء بالحسنة فله عشر أمثالها } هذا أقلّ درجات الثواب وذلك أنّ الحسنة تصدر بظهور القلب، والسيئة بظهور النفس، فأقلّ درجات ثوابها أنه يصل إلى مقام القلب الذي يتلو مقام النفس في الارتقاء تلو مرتبة العشرات للآحاد في الأعداد\n { ومن جاء بالسيئة فلا يجزى إلا مثلها } لأنه لا مقام أدون من مقام النفس، فينحط إليه بالضرورة فيرى جزاءه في مقام النفس بالمثل\n ومن هذا يعلم أن الثواب من باب الفضل فإنه يزيد به صاحبه ويتنوّر استعداده ويزداد قبوله لفيض الحق فيتقوّى على إضعاف ما فعل ويكتسب به أجوراً متضاعفة إلى غير نهاية بازدياد القبول عند فعل كل حسنة، وزيادة القدرة والشغف على الحسنة عند زيادة الفيض إلى ما لا يعلمه إلا الله، كما قال بعد ذكر أضعافها إلى سبعمائة:\n\n[البقرة، الآية: 261] وأن العقاب من باب العدل، إذ العدل يقتضي المساواة ومن فعل بالنفس إذا لم يعف عنه يجازى بالنفس سواء وتذكر ما قيل في قوله تعالى:\n",
      "translations": [
        {
          "translation": "\n\nHe who does good will have ten times its equivalent in rewards. This is the lowest level of reward, because good deeds are done openly from the heart.,\n\nThe evil manifests in the self., The lowest degrees of its reward are that it reaches the degree of the heart that equals the degree of the soul in the ascent, {tulo} the degree of the tens in the numbers.\n\n\nAnd whoever brings evil shall not be compensated with anything except what is equivalent to it, because there is no measure for evil greater than the measure of the self., He will be brought to justice in the hereafter for what he did in this life.\n\n From this, it is known that the reward is from the aspect of favor, because it increases the one who does it and enlightens his preparation, and increases his acceptance of the abundance of truth, so he becomes cautious of his weak deeds and acquires multiplied rewards to an endless extent, with the increase of acceptance every time he does a good deed.,\n\nAnd increasing one's capacity and yearning for good as the flood of evil increases, is something known only to God.,\n\nAs he said after mentioning its weakness to seven hundred:\n\n\nThe Cow\n\nIn the name of God, Most Gracious, Most Merciful\n\n{1} Alif-Lam-Mim.\n\n{2} This is the Book; in it is guidance sure, without doubt, to those who fear God.\n\n{3} Who believe in the Unseen, are steadfast in prayer, and spend out of what We have provided for them;\n\n{4} And who believe in the Revelation sent to thee, and sent before thy time, and (in their hearts) have the assurance of the Hereafter.\n\n{5} They are on (true) guidance, from their Lord, and it is these who will prosper.\n\n{6} As to those who reject Faith, it is the same to them whether thou warn them or do not warn them; they will not believe.\n\n{7} God has set a seal on their hearts and on their hearing, and on their eyes is a veil; great is the penalty they (incur).\n\n{8} Of the people there are some who say: \"We believe in God and the Last Day;\" but they do not (really) believe.\n\n{9} Fain would they deceive God and those who believe, but they only deceive themselves, and perceive (it) not!\n\n{10} In their hearts is a disease; and God has increased their disease: and grievous is the penalty they (incur), because they are false (to themselves).\n\n{11} When it is said to them: \"Make not mischief on the earth,\" they say: \"Why, we only Want to make peace!\"\n\n{12} Of a surety, they are the ones who make mischief, but they perceive (it) not.\n\n{13} When it is said to them: \"Believe as other men have believed,\" they say: \"Shall we believe as the fools have believed?\" Nay, of a surety they are the fools, but they do not know.\n\n{14} When they meet those who believe, they say: \"We believe;\" but when they are alone with their evil ones, they say: \"We are really with you:\n\n{15} We were only jesting.\"\n\n{16} God will throw back their mockery on them, and give them rope in their trespasses; so they will wander like blind ones (To and fro).\n\n{17} These are they who have bartered Guidance for error: but their traffic is profitless, and they have lost true direction.\n\n{18} Their similitude is that of a man who kindled a fire; when it lighted all around him, God took away their light and left them in utter darkness. So they could not see.\n\n{19} Deaf, dumb, and blind, they will not return (to the path).\n\n{20} Or (another similitude) is that of a stormy wind, which leaves the earth dark and bleak: (It is) them who have lost their sight of God.\n\n{21} O ye who believe! Eat not up your property among yourselves,\n\n\"And that the punishment is from the standpoint of justice.\",\n\n\"Justice requires equality, and whoever does not act justly towards themselves will not be forgiven by Allah. So remember what is said in the Quran: 'Whoever does not judge by what Allah has revealed - then it is those who are the defiantly disobedient.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { مَن جَآءَ بِٱلْحَسَنَةِ } فيها { فَلَهُ } على مقتضى الفضل الإلهي { عَشْرُ أَمْثَالِهَا } امتناناً عليه وجزاء له { وَمَن جَآءَ بِٱلسَّيِّئَةِ } فيها { فَلاَ يُجْزَىۤ إِلاَّ مِثْلَهَا } على مقتضى العدل الإلهي { وَهُمْ } في جزاء السيئة { لاَ يُظْلَمُونَ } [الأنعام: 160] بالزيادة؛ إذ لا ظلم في ذلك اليوم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { من جاء بالحسنة } قولية أو فعلية أو قلبية، { فله عشر أمثالها } من الحسنات، فضلاً من الله، وهذا أقل ما وعد من الأضعاف، وقد جاء الوعد بسبعين وسبعمائة، وبغير حساب، ولذلك قيل: المراد بالعشر: الكثرة دون العدد، { ومن جاء بالسيئة فلا يُجزى إلا مثلها } قضية للعدل، { وهم لا يظلمون } بنفس الثواب وزيادة العقاب\n الإشارة: إنما تضاعف أعمال الجوارح وما كان من قبل النيات، وأما أعمال القلوب فأجرها بغير حساب، قال تعالى:\n\n[الزُّمَر:10]، وقال صلى الله عليه وسلم:\n\n \" تفكر ساعة أفضل من عبادة سبعين سنة \" \n\nوقا الشاعر:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:2",
      "similarity": 0.5969463175474069
    },
    {
      "verse": "26:214",
      "similarity": 0.5675137307201998
    },
    {
      "verse": "28:84",
      "similarity": 0.5005848969092783
    },
    {
      "verse": "34:45",
      "similarity": 0.42764369075077807
    },
    {
      "verse": "22:13",
      "similarity": 0.42058597500628925
    }
  ]
}