{
  "chapter": "الأنعام",
  "text": "وان يمسسك الله بضر فلا كاشف له الا هو وان يمسسك بخير فهو على كل شىء قدير",
  "translations": [
    {
      "translation": "If Allah touches you with harm, none can remove it but Him. If He touches you with good, He has power over all things.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God sends you harm, there is no one but He who can take it away; and if He bring you good, surely He has power over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should Allah touch you with affliction, there is none to remove it but He; and should He touch you with good, He has the power to do everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), if God afflicts you with hardship, no one besides Him will be able to relieve you. If He bestows a favor on you, know that He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah afflicts you with some misfortune, then there is none who can remove it, except Him; and if He sends you some good fortune, then (know that) He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah touches you with harm, none can remove it but He, and if He touches you with good, then He is able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah touch you with affliction, there is none to take it off but He; and if He visit you with good, then He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if God visits thee with affliction none can remove it but He; and if He visits thee with good, He is powerful over everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah touch thee with affliction, there is none that can relieve therefrom save Him, and if He touch thee with good fortune (there is none that can impair it); for He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God should let any harm touch you, no one could remove it except He; while if He should let some good touch you, know that He has the power to do all that He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah touch thee with hurt there is no reverser thereof but he, and if he touch thee with good, then He is over everything Potent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should Allah visit you with some distress there is no one to remove it except Him; and should He bring you some good, then He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah touch thee with affliction, none can remove it but He; if He touch thee with happiness, He hath power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah touches you with harm, none can remove it but He, and if He touches you with good, then He is Able to do all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Allah visits you with affliction, none can remove it except He; and if He touches you with good, indeed, He has power over all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If God touches you with adversity, none can remove it except He. And if He touches you with good—He is Capable of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if Allah should touch you with adversity, there is no remover of it except Him. And if He touches you with good - then He is over all things competent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:17] And if God touches you with an affliction, a trial, such as an illness or impoverishment, then none can remove it, [none can] lift it, except Him; and if He touches you with good, such as health and affluence, then He has power over all things, including His touching you with this, and none other than Him has the power to remove it from you.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If Allah touch thee with) if Allah brings on you (affliction) hardship and penury, (there is none that can relieve therefrom) none can lift them from you (save Him, and if He touch thee with) if Allah brings on you (good fortune) blessing and wealth ((there is none that can impair it); for He is Able to do all things): hardship and penury, blessing and wealth.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتقررت في مقر التوحيد { إِن يَمْسَسْكَ ٱللَّهُ بِضُرٍّ } بلية وعناء { فَلاَ كَاشِفَ لَهُ إِلاَّ هُوَ } إذ لا شيء غيره { وَإِن يَمْسَسْكَ بِخَيْرٍ } عطية وغنى { فَهُوَ } أيضاً منه\n لأنه { عَلَىٰ كُلِّ شَيْءٍ } من الخير والشر والنفع والضر { قَدُيرٌ } [الأنعام: 17] تحيط قدرته بجميع المقدروات\n\n\n{ وَ } كيف لايكون قديراً علكى كل ما أراد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { وإن يمسسك الله بضرّ } كمرض أو فقر\n { فلا كاشف له إلا هو } إذ لا يقدر على صرفه غيره\n { وإن يمسسك بخير } بنعمة\n كصحة وغنى ومعرفة وعلم\n { فهو على كل شيء قدير } \n فهو قادر على حفظه وإدامته\n ولا يقدر أحد على دفعه\n كقوله تعالى:\n[يُونس:107]",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:107",
      "similarity": 0.704945932098991
    },
    {
      "verse": "16:54",
      "similarity": 0.636941600558539
    },
    {
      "verse": "44:12",
      "similarity": 0.6112012650926734
    },
    {
      "verse": "53:58",
      "similarity": 0.5758221553594847
    },
    {
      "verse": "21:84",
      "similarity": 0.5537142825311978
    }
  ]
}