{
  "chapter": "الأنعام",
  "text": "قل اى شىء اكبر شهدة قل الله شهيدۢ بينى وبينكم واوحى الى هذا القرءان لانذركم به ومنۢ بلغ ائنكم لتشهدون ان مع الله ءالهة اخرى قل لا اشهد قل انما هو اله وحد واننى برىء مما تشركون",
  "translations": [
    {
      "translation": "Say: 'What thing is greatest as a witness?' Say: 'Allah. He is Witness between me and you. This Qur'an has been revealed to me so that I may warn you by it, and anyone else it reaches. Do you then bear witness that there are other gods together with Allah?' Say: 'I do not bear witness.' Say: 'He is only One God, and I am free of all you associate with Him.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask: \"Of all things what is most vital as evidence?\" Say: \"God (who) is witness between you and me that this Qur'an has been revealed to me that I may warn you on its strength, and those whom it reaches. Do you really bear witness there are other gods with God?\" Tell them: \"I bear no such Witness.\" Say: \"Verily He is the only God, and I am clear of what you associate (with Him).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them: 'Whose testimony is the greatest?' Say: 'Allah is the witness between me and you; and this Qur'an was revealed to me that I should warn you thereby and also whomsoever it may reach.' Do you indeed testify that there are other gods with Allah? Say: 'I shall never testify such a thing.' Say: 'He is the One God and I am altogether averse to all that you associate with Him in His divinity.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), ask them, \"What is the greatest testimony? God testifies of my truthfulness to you. He has revealed this Quran to me to warn you and the coming generations (against disobeying God). Do you believe that other gods exist besides God? I solemnly declare that He is the only Lord and that I am not guilty of believing in what the pagans believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “Whose testimony is the greatest?” Say, “Allah is the Witness between me and you; and this Qur’an has been sent down upon me, so I may warn you with it and whomever it may reach; so do you bear witness that there are other Gods along with Allah?” Say, “I do not bear witness to it”; Say, “He is the only One God and I do not have any relation with whatever you ascribe as partners (to Him).”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"What thing is the most great in witness\" Say: \"Allah is Witness between you and I; this Qur'an has been revealed to me that I may therewith warn you and whomsoever it may reach. Can you verily bear witness that besides Allah there are other gods\" Say \"I bear no (such) witness!\" Say: \"Only He is God, alone, and truly I am innocent of what you join in worship with Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: What thing is the weightiest in testimony? Say: Allah is witness between you and me; and this Quran has been revealed to me that with it I may warn you and whomsoever it reaches. Do you really bear witness that there are other gods with Allah? Say: I do not bear witness. Say: He is only one Allah, and surely I am clear of that which you set up (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'God is witness between me and you, and this Koran has been revealed to me that I may warn you thereby, and whomsoever it may reach. Do you indeed testify that there are other gods with God?' Say: 'I do not testify.' Say: 'He is only One God, and I am quit of that you associate.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): What thing is of most weight in testimony? Say: Allah is Witness between me and you. And this Qur'an hath been inspired in me, that I may warn therewith you and whomsoever it may reach. Do ye in sooth bear witness that there are gods beside Allah? Say: I bear no such witness. Say: He is only One Allah. Lo! I am innocent of that which ye associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them, \"What carries the most weight as a witness?\" Tell them it is God. He is a witness between you and me. Say, \"This Quran has been revealed to me so that through it I may warn you and whoever it reaches. Do you really bear witness that there are other deities beside God?\" Say, \"I do not bear witness to this.\" Say, \"He is only one God, and I disown whatever you associate with Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: what thing is the greatest in testimony? Say thou: Allah is Witness between me and you, and this Qur'an hath been revealed unto me that I may thereby warn you and whomsoever it may reach. Would ye indeed testify that there is anot her god together with Allah? Say thou: I testify not. Say thou: verily He is the One God, and I am quit of that which ye associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘What thing is greatest as witness?’ Say, ‘Allah! [He is] witness between me and you, and this Quran has been revealed to me that I may warn thereby you and whomever it may reach.’ ‘Do you indeed bear witness that there are other gods besides Allah?’ Say, ‘I do not bear witness [to any such thing].’ Say, ‘Indeed He is the One God, and I indeed disown what you associate [with Him].’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"What thing is most weighty in evidence?\" Say: \"Allah is witness between me and you; This Qur'an hath been revealed to me by inspiration, that I may warn you and all whom it reaches. Can ye possibly bear witness that besides Allah there is another Allah?\" Say: \"Nay! I cannot bear witness!\" Say: \"But in truth He is the one Allah, and I truly am innocent of (your blasphemy of) joining others with Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"What thing is the most great in witness?\" Say: \"Allah (the Most Great!) is Witness between me and you; this Quran has been revealed to me that I may therewith warn you and whomsoever it may reach. Can you verily bear witness that besides Allah there are other aliha (gods)?\" Say \"I bear no (such) witness!\" Say: \"But in truth He (Allah) is the only one Ilah (God). And truly I am innocent of what you join in worship with Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What thing is greatest in testimony' Say: 'Allah is a witness between me and you. This Koran has been revealed to me in order that I can warn you and all whom it reaches. Do you indeed testify that there are gods other than Allah' Say: 'I do not testify' Say: 'He is only One God, and I am quit of that which you associate'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “What thing is more solemn in testimony?” Say, “God is Witness between you and me. This Quran was revealed to me, that I may warn you with it, and whomever it may reach. Do you indeed testify that there are other gods with God?” Say, “I myself do not testify.” Say, “He is but One God, and I am innocent of your idolatry.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"What thing is greatest in testimony?\" Say, \"Allah is witness between me and you. And this Qur'an was revealed to me that I may warn you thereby and whomever it reaches. Do you [truly] testify that with Allah there are other deities?\" Say, \"I will not testify [with you].\" Say, \"Indeed, He is but one God, and indeed, I am free of what you associate [with Him].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:19] When they said to the Prophet (s), ‘Bring us someone to testify to the truth of your prophethood, for the People of the Scripture have denied you’, the following was revealed: Say, to them: ‘What thing is greatest in testimony?’ (shahādatan: this is for specification, and is derived from the [implied] subject of the sentence). Say: ‘God — even if they do not say this, there is no other response — He, is Witness between me and you, to my truthfulness; and this Qur’ān has been revealed to me that I may warn you, [that I may] make you fear, O people of Mecca, thereby, and whomever it may reach (wa-man balagha: this is a   supplement to the [suffixed] pronoun [‘you’] of undhira-kum, ‘I may warn you’), that is to say, whomever among men and jinn the Qur’ān may reach. Do you indeed bear witness that there are other gods with God?’ (this interrogative is meant as a disavowal). Say, to them: ‘I do not bear witness’, to this. Say: ‘He is only One God, and I am innocent of what you associate’, with Him of idols.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nانتقال من الاستدلال على إثبات ما يليق بالله من الصفات ، إلى إثبات صدق رسالة محمد صلى الله عليه وسلم وإلى جعْللِ الله حكماً بينه وبين مكذّبيه ، فالجملة استئناف ابتدائي ، ومناسبة الانتقال ظاهرة .روى الواحدي في «أسباب النزول» عن الكلبي : أنّ رؤساء مكّة قالوا : يا محمد ما نرى أحداً مصدّقَك بما تقول ، وقد سألنا عنك اليهود والنصارى فزعموا أن ليس عندهم ذكرُك ولا صفتك فأرِنا من يشهد أنّك رسول الله . فنزلت هذه الآية .وقد ابتدئت المحاورة بأسلوب إلقاء استفهام مستعمل في التقرير على نحو ما بيّنته عند قوله تعالى : { قل لمن ما في السماوات والأرض } \\[ الأنعام : 12 \\] ومثل هذا الأسلوب لإعداد السامعين لتلقّي ما يرد بعد الاستفهام .و ( أي ) اسم استفهام يطلب به بيان أحد المشتركات فيما أضيف إليه هذا الاستفهام ، والمضاف إليه هنا هو { شيء } المفسّر بأنَّه من نوع الشهادة .و { شَيء } اسم عامّ من الأجناس العالية ذات العموم الكثير ، قيل : هو الموجود ، وقيل : هو ما يعلم ويصحّ وجوده . والأظهر في تعريفه أنّه الأمر الذي يعلم . ويجري عليه الإخبار سواء كان موجوداً أو صفة موجود أو معنى يتعقّل ويتحاور فيه ، ومنه قوله تعالى : { فقال الكافرون هذا شيء عجيب أإذا متنا وكنّا تراباً ذلك رجْع بعيد } \\[ ق : 2 ، 3 \\].وقد تقدّم الكلام على مواقع حسن استعمال كلمة ( شيء ) ومواقع ضعفها عند قوله تعالى : { ولنبلونّكم بشيء من الخوف والجوع } في سورة \\[ البقرة : 155 \\].{ وأكبَرُ } هنا بمعنى أقوى وأعدل في جنس الشهادات ، وهو من إطلاق ما مدلوله عظم الذات على عظم المعنى ، كقوله تعالى : { ورضوان من الله أكبر } \\[ التوبة : 72 \\] وقوله : { قل قتال فيه كبير } وقد تقدّم في سورة \\[ البقرة : 217 \\].وقوة الشهادة بقوة اطمئنان النفس إليها وتصديق مضمونها .وقوله : { شهادة } تمييز لنسبة الأكبرية إلى الشيء فصار ماصْدق الشيء بهذا التمييز هو الشهادة . فالمعنى : أيّة شهادة هي أصدق الشهادات ، فالمستفهم عنه بِ { أي } فرد من أفراد الشهادات يطلب عِلم أنَّه أصدق أفراد جنسه .والشهادة تقدّم بيانها عند قوله تعالى : { شهادة بينكم } في سورة \\[ المائدة : 106 \\].ولمّا كانت شهادة الله على صدق الرسول غير معلومة للمخاطبين المكذّبين بأنّه رسول الله ، صارت شهادة الله عليهم في معنى القسم على نحو قوله تعالى : { ويدرأ عنها العذاب أن تشهد أربع شهادات بالله إنّه لمن الكاذبين } \\[ النور : 8 \\] أي أن تُشهد الله على كذب الزوج ، أي أن تحلف على ذلك بسم الله ، فإنّ لفظ ( أشهد الله ) من صيغ القسم إلاّ أنّه إن لم يكن معه معنى الإشهاد يكون مجازاً مرسلاً ، وإن كان معه معنى الإشهاد كما هنا فهو كناية عن القسم مراد منه معنى إشهاد الله عليهم ، وبذلك يظهر موقع قوله : { الله شهيد بيني وبينكم } ، أي أشهده عليكم .وقريب منه ما حكاه الله عن هود { قال إنّي أشهد الله } \\[ هود : 54 \\].وقوله : { قل الله شهيد بيني وبينكم } جواب للسؤال ، ولذلك فصلت جملته المصدّرة ب { قل }.وهذا جواب أمر به المأمور بالسؤال على معنى أن يسأل ثم يبادر هو بالجواب لكون المراد بالسؤال التقرير وكون الجواب ممّا لا يسع المقرّر إنكاره ، على نحو ما بيّنّاه في قوله : { قل لمن ما في السماوات والأرض قل لله } \\[ الأنعام : 12 \\] ووقع قوله : { الله شهيد بيني وبينكم } جواباً على لسانهم لأنّه مرتّب على السؤال وهو المقصود منه فالتقدير : قل شهادة الله أكبر شهادة ، فالله شهيد بيني وبينكم ، فحذف المرتّب عليه لدلالة المرتّب إيجازاً كما هو مقتضى جزالة أسلوب الإلجاء والجدل . والمعنى : أنّي أشهد الله الذي شهادته أعظم شهادة أنّني أبلغتكم أنّه لا يرضى بأن تشركوا به وأنذرتكم .وفي هذه الآية ما يقتضي صحة إطلاق اسم ( شيء ) على الله تعالى لأنّ قوله : { الله شهيد } وقع جواباً عن قوله : { أي شيء } فاقتضى إطلاق اسم ( شيء ) خبراً عن الله تعالى وإن لم يدلّ صريحاً . وعليه فلو أطلقه المؤمن على الله تعالى لما كان في إطلاقه تجاوز للأدب ولا إثم . وهذا قول الأشعرية خلافاً لجهم بن صفوان وأصحابه .ومعنى : { شهيد بيني وبينكم } أنّه لمّا لم تنفعهم الآيات والنذر فيرجعوا عن التكذيب والمكابرة لم يبق إلاّ أن يكلهم إلى حساب الله تعالى . والمقصود : إنذارهم بعذاب الله في الدنيا والآخرة . ووجه ذكر { بيني وبينكم } أنّ الله شهيد له ، كما هو مقتضى السياق . فمعنى البيْن أنّ الله شهيد للرسول صلى الله عليه وسلم بالصدق لردّ إنكارهم رسالته كما هو شأن الشاهد في الخصومات .وقوله : { وأوحي إليّ هذا القرآن } عطف على جملة { الله شهيد بيني وبينكم } ، وهو الأهمّ فيما أقسم عليه من إثبات الرسالة . وينطوي في ذلك جميع ما أبلغهم الرسول صلى الله عليه وسلم وما أقامه من الدلائل . فعطف { وأوحي إلي هذا القرآن } من عطف الخاصّ على العامّ ، وحُذف فاعل الوحي وبني فعله للمجهول للعلم بالفاعل الذي أوحاه إليه وهو الله تعالى .والإشارة ب { هذا القرآن } إلى ما هو في ذهن المتكلّم والسامع . وعطف البيان بعد اسم الإشارة بيَّن المقصود بالإشارة .واقتصر على جعل علّة نزول القرآن للنذارة دون ذكر البشارة لأنّ المخاطبين في حال مكابرتهم التي هي مقام الكلام لا يناسبهم إلاّ الإنذار ، فغاية القرآن بالنسبة إلى حالهم هي الإنذار ، ولذلك قال { لأنذركم به } مصرَّحاً بضمير المخاطبين . ولم يقل : لأنذر به ، وهم المقصود ابتداء من هذا الخطاب وإن كان المعطوف على ضميرهم ينذر ويبشّر . على أنّ لام العلّة لا تؤذن بانحصار العلّة في مدخولها إذ قد تكون للفعل المعدّى بها علل كثيرة .{ ومن بلغ } عطف على ضمير المخاطبين ، أي ولأنذر به من بلغه القرآن وسمعه ولو لم أشافهه بالدعوة ، فحذف ضمير النصب الرابط للصلة لأنّ حذفه كثير حسن ، كما قال أبو علي الفارسي .وعموم { مَن } وصلتها يشمل كلّ من يبلغه القرآن في جميع العصور .{ أَئِنَّكُمْ لَتَشْهَدُونَ أَنَّ مَعَ الله ءَالِهَةً أخرى قُل لاَّ أَشْهَدُ قُلْ إِنَّمَا هُوَ إله واحد وَإِنَّنِى بَرِىءٌ مِّمَّا تُشْرِكُونَ }.جملة مستأنفة من جملة القول المأمور بأن يقوله لهم . فهي استئناف بعد جملة { أيّ شيء أكبر شهادة }.خصّ هذا بالذكر لأنّ نفي الشريك لله في الإلهية هو أصل الدعوة الإسلامية فبعد أن قرّرهم أنّ شهادة الله أكبر شهادة وأشهد الله على نفسه فيما بلّغ ، وعليهم فيما أعرضوا وكابروا؛ استأنف استفهاماً على طريقة الإنكار استقصاء في الإعذار لهم فقال : أتشهدون أنتم على ما أصررتم عليه أنّ مع الله آلهة أخرى كما شهدت أنا على ما دعوتكم إليه ، والمقرّر عليه هنا أمر ينكرونه بدلالة المقام .وإنّما جعل الاستفهام المستعمل في الإنكار عن الخبر الموكّد ب ( إنّ ) ولام الابتداء ليفيد أنّ شهادتهم هذه ممَّا لا يكاد يصدَّق السامعون أنّهم يشهدونها لاستبعاد صدورها من عقلاء ، فيحتاج المخبر عنهم بها إلى تأكيد خبره بمؤكّديْن فيقول : إنّهم ليشهدون أنّ مع الله آلهة أخرى ، فهنالك يحتاج مخاطبهم بالإنكار إلى إدخال أداة الاستفهام الإنكاري على الجملة التي من شأنها أن يحكى بها خبرهم ، فيفيد مثلُ هذا التركيب إنكارين : أحدهما صريح بأداة الإنكار ، والآخر كنائي بلازم تأكيد الإخبار لغرابة هذا الزعم بحيث يشكّ السامع في صدوره منهم .ومعنى { لتشهدون } لتدّعونا دعوى تحقَّقونها تحقيقاً يشبه الشهادة على أمر محقّق الوقوع ، فإطلاق { تشهدون } مشاكلة لقوله { قل الله شهيد بيني وبينكم }.والآلهة جمع إله ، وأجري عليه الوصف بالتأنيث تنبيهاً على أنّها لا تعقل فإنّ جمع غير العاقل يكون وصفه كوصف الواحدة المؤنّثة .وقوله : { قل لا أشهد } جواب للاستفهام الذي في قوله : { أإنّكم لتشهدون } لأنّه بتقدير : قل أإنّكم ، ووقعت المبادرة بالجواب بتبرّىء المتكلّم من أن يشهد بذلك لأنّ جواب المخاطبين عن هذا السؤال معلوم من حالهم أنّهم مقرّون به فأعرض عنهم بعد سؤالهم كأنّه يقول : دعْنا من شهادتكم وخذوا شهادتي فإنّي لا أشهد بذلك . ونظير هذا قوله تعالى : { فإن شهدوا فلا تشهد معهم } \\[ الأنعام : 15 \\].وجملة : { قل إنّما هو إله واحد } بيان لجملة { لا أشهد } فلذلك فصلت لأنّها بمنزلة عطف البيان ، لأنّ معنى لا أشهد بأنّ معه آلهة هو معنى أنّه إله واحد ، وأعيد فعل القول لتأكيد التبليغ .وكلمة { إنّما } أفادت الحصر ، أي هو المخصوص بالوحدانية : ثم بالغ في إثبات ذلك بالتبرّىء من ضدّه بقوله : { وإنّني بريء ممَّا تشركون }.وفيه قطع للمجادلة معهم على طريقة المتاركة .و ( ما ) في قوله : { ممّا تشركون } يجوز كونها مصدرية ، أي من إشراككم . ويجوز كونها موصولة ، وهو الأظهر ، أي من أصنامكم التي تشركون بها ، وفيه حذف العائد المجرور لأنّ حرف الجرّ المحذوف مع العائد متعيّن تقديره بلا لبس ، وذلك هو ضابط جواز حذف العائد المجرور ، كقوله تعالى : { أنسجد لما تأمرنا } \\[ الفرقان : 60 \\] أي بتعظيمه ، وقوله تعالى : { فاصدع بما تؤمر } أي بالجهر به . وظاهر كلام «التسهيل» أنّ هذا ممنوع ، وهو غفلة من مؤلّفه اغترّ بها بعض شرّاح كتبه .\n\n",
      "translations": [
        {
          "translation": "When they said to the Prophet (pbuh) bring us a witness to testify that you are a prophet, Allah said: (Say) to them, Muhammad: (What thing is of most weight) that is, fairer and most pleasing (in testimony?) If they answer, fine, if not (Say: Allah is witness between you and me) that I am His Messenger and this Qur'an is His speech. (And this Qur'an hath been inspired in me) and that Gabriel has brought down this Qur'an to me, (that I may warn therewith you) with the Qur'an (and whomsoever it may reach) I am a warner to him. (Do ye) people of Mecca (in sooth bear witness that there are gods beside Allah) i.e. idols: you say that they are Allah's daughters? And if they bear witness, (Say: I bear no such witness) with you. (Say) Muhammad: (He is only One God) the true God is only One God. (Lo! I am innocent of that which you associate (with Him)) of idols in worship.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإن جادولك واستشهدوا منك شيهداً على نبوتك ورسالتك { قُلْ } لهم إلزاما وتبكيتاً: { أَيُّ شَيْءٍ أَكْبَرُ } وأتم { شَهَٰدةً قُلِ ٱللَّهُ } لأن المتعين المتعزز بالعظمة والكبرياء هو { شَهِيدٌ بِيْنِي وَبَيْنَكُمْ وَ } شهادته على أنه { أُوحِيَ إِلَيَّ هَـٰذَا ٱلْقُرْآنُ } الجامع للكتب السالفة من عنده { لأُنذِرَكُمْ } وأبشركم { بِهِ } أيها الموجودون في حين نزوله { وَ } كذا { مَن بَلَغَ } له خبر وحيه وحكمه من الأسود والأحمر إذ أرسلت إ لى كافة البرية بشيراً ونذيراً على مقتضى التوحيد الذاتي { أَئِنَّكُمْ } أيها المنهمكون في بحر الضلال { لَتَشْهَدُونَ } بعد وضوح البرهان { أَنَّ مَعَ ٱللَّهِ } المتوحد بذاته\n المستقل بالألوهية { ءَالِهَةً أُخْرَىٰ } مشاركة له في ملكه ووجوده { قُل لاَّ أَشْهَدُ } ما تشهدون ظلماً وزوراً بل { قُلْ إِنَّمَا هُوَ إِلَـٰهٌ وَاحِدٌ } متفرد بالألوهية\n متوحد بالربوبية\n ليس لغيره وجود حتى يشارك معه\n بل لا وجود إلا هو\n ولا إله سواه { وَإِنَّنِي بَرِيءٌ مِّمَّا تُشْرِكُونَ } [الأنعام: 19] إليه من الأظلال الباطلة والتماثيل العاطلة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "{ قُلْ أَيُّ شَيْءٍ أَكْبَرُ شَهَادةً قُلِ ٱللَّهِ شَهِيدٌ بِيْنِي وَبَيْنَكُمْ وَأُوحِيَ إِلَيَّ هَـٰذَا ٱلْقُرْآنُ لأُنذِرَكُمْ بِهِ وَمَن بَلَغَ... }  قلت: { قل الله شهيد }: يحتمل المبتدأ والخبر، أو يكون { الله } خبرًا عن مضمر، أو مبتدأ حُذف خبره، و { شهيد }: خبر عن مضمر، أي: قل هو الله، أو الله أكبر شهادة، وهو شهيد بيني وبينكم، و { من بلغ }: عطف على مفعول، \" أنذر \" ، أي: لأنذركم يا أهل مكة، وأنذر من بلغه القرآن، وحذف مفعول { بلغ }. يقول الحقّ جلّ جلاله: { قل } يا محمد للذين سألوك مَن يشهد لك بالنبوة: { أيُّ شيء } عندكم هو { أكبر شهادة }؟ فإن لم يجيبوا فقل لهم: هو { الله } فإنه أكبر الشاهدين، وهو الذي يشهد لي بالنبوة والرسالة بإقامة البراهين وإظهار المعجزات، وهو { شهيد بيني وبينكم } ، وكفى به شهيدًا. { وأُوحي إليَّ هذا القرآن لأُنذركم به } أي: لأخوّفكم به، إن أعرضتم عنه، وأُبشِّركم به إن آمنتم به، واكتفى بذكر الإنذار عن ذكر البشارة لأنه مصرح به في موضع آخر، ولأن الأهم هنا هو الإنذار لغلبة الكفر حينئذٍ، وأُنذر به أيضًا كل من بلغه القرآن من الأحمر والأسود، والجن والإنس إلى يوم القيامة. وفيه دليل على أن أحكام القرآن تعُم الموجودين وقت النزول ومَن بعدَهم، وأنه لا يؤاخذ بها من لم تبلغه، وهو نادر، قال سعيد بن جبير:  مَن بلَغه القرآن فكأنما رأى محمدًا صلى الله عليه وسلم. الإشارة: في الآية حثٌّ على اكتفاء بعلم الله، والاستغناء به عما سواه، وعلامةُ الاكتفاء بعلم الله ثلاث: استواء المدح والذم، والرضى بالقليل والكثير، والرجوع إلى الله وحده في السراء والضراء. واعلم أن الحق تعالى إذا شهد لك بالخصوصية، ثم اكتفيت بشهادته فأنت من أهل الخصوصية، وإن لم تكتف بشهادته، وتطلعت إلى أن يعلم الناس بخصوصيتك، فأنت كاذب في دعوى الخصوصية. واطلاع الحق تعالى على ثبوت خصوصيتك هو شهادته لك، فاقنع بعلم الله، ولا تلتفت إلى أحد سواه، لئلا ينزعَها مِن قلبك، حيث لم تقنع بعلم الله فيك. وبالله التوفيق. ولمّا أتى قومٌ من الكفار إلى رسول الله صلى الله عليه وسلم، فقالوا: يا محمد أما تعلم أن مع الله إلهًا آخر؟ أنزل الله تعالى: {...أَئِنَّكُمْ لَتَشْهَدُونَ أَنَّ مَعَ ٱللَّهِ آلِهَةً أُخْرَىٰ قُل لاَّ أَشْهَدُ قُلْ إِنَّمَا هُوَ إِلَـٰهٌ وَاحِدٌ وَإِنَّنِي بَرِيءٌ مِّمَّا تُشْرِكُونَ }  قلت: الاستفهام للإنكار والتوبيخ. يقول الحقّ جلّ جلاله: في الإنكار على المشركين: { أئنكم لتشهدون أنَّ مع الله آلهة أُخرى } تستحق أن تعبد { قل } لهم يا محمد: أنا { لا أشهدُ } بما تشهدون به، { قل } لهم: { إنما هو إله واحد } بل أشهد ألا إله إلا هو، { وإنني بريءٌ مما تُشركون } به من الأصنام.\nالإشارة: لم يَبرَأ من الشرك الخفي والجلِي إلا أهلُ الفناء الذين وحدوا الله في وجوده، فلم يروَا معه سواه، قال بعضُ من بلغ هذا التوحيد:  لو كُلفت أن أرى غيره لم أستطع فإنه لا غيرَ معه حتى أشهده وقال آخر: مُحَالٌ أن تشهده وتشهد معه سواه. وقال شاعرهم:\nإلى غير ذلك من مقالاتهم الدالة على تحقيق وجدانهم. نفعنا الله بذكرهم ومحبتهم. آمين. ولمّا قالت قريش: قد سألنا اليهود والنصارى عنك، فلم يجدوا لك عندهم ذكراً، ردّ الله عليهم، فقال: { ٱلَّذِينَ آتَيْنَاهُمُ ٱلْكِتَابَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:1",
      "similarity": 0.40060523225057687
    },
    {
      "verse": "10:41",
      "similarity": 0.3899719472725157
    },
    {
      "verse": "98:7",
      "similarity": 0.36658632634343236
    },
    {
      "verse": "12:53",
      "similarity": 0.35448398030359457
    },
    {
      "verse": "41:6",
      "similarity": 0.3479999727352806
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006019.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006019.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:19.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}