{
  "chapter": "الأنعام",
  "text": "هو الذى خلقكم من طين ثم قضى اجلا واجل مسمى عنده ثم انتم تمترون",
  "translations": [
    {
      "translation": "It is He who created you from clay and then decreed a fixed term, and another fixed term is specified with Him. Yet you still have doubts!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created you from clay then determined a term (of life) for you, and a term (is fixed) with Him. Even then you doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who has created you out of clay, and then decreed a term (of life), and has also appointed another term, a term determined with Him. Yet you are in doubt!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has created you from clay to live for a life-time and the span of your life is only known to Him. You are still suspicious!.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has created you from clay, and then decreed a term for you; and it is a fixed promise before Him, yet you still doubt!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who has created you from clay, and then has decreed a stated term. And there is with Him another determined term, yet you doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who created you from clay, then He decreed a term; and there is a term named with Him; still you doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created you of clay, then determined a term and a term is stated with Him; yet thereafter you doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who hath created you from clay, and hath decreed a term for you. A term is fixed with Him. Yet still ye doubt!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has created you out of clay, and then has decreed a term [for you], a term known [only] to Him. Yet you are still in doubt,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is who created you of clay and then decreed a term - and a term determined is with Him - yet ye waver.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created you from clay, then ordained the term [of your life]—the specified term is with Him—and yet you are in doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is created you from clay, and then decreed a stated term (for you). And there is in His presence another determined term; yet ye doubt within yourselves!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who has created you from clay, and then has decreed a stated term (for you to die). And there is with Him another determined term (for you to be resurrected), yet you doubt (in the Resurrection).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has created you from clay. He has decreed a term for you and another one set with Him. Yet you are still in doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created you from clay, then decided a term—a term determined by him. Yet you doubt.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created you from clay and then decreed a term and a specified time [known] to Him; then [still] you are in dispute.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:2] It is He Who created you from clay, by creating your father Adam from it; then He decreed a term, for [each of] you, at the conclusion of which you die. A term is stated, fixed, with Him, for your resurrection; yet thereafter you, O disbelievers, doubt, you are uncertain about the Resurrection, when you know that it was He Who initiated your creation, and One Who has the power to initiate [creation], is even more capable of bringing you back [to life after death].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is Who hath created you from clay) i.e. from Adam and Adam was created from clay, (and hath decreed a term for you) He created this world and fixed a term for its extinction and made created beings whose lifespan expires with death. (A term is fixed with Him) Allah knows the term of the Hereafter: therein there is no death or evanescence. (Yet still you) people of Mecca (doubt) in Allah and resurrection after death!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قَضَىۤ أَجَلاً } معناهُ وقتٌ، وَهَو المَوتُ\n\n\n\n\nوقوله تعالى: { وَأَجَلٌ مُّسَمًّى عِندَهُ } وَهوَ الآخِرةُ\n ويُقالُ قَضَى أَجلاً: معناهُ مَا بَينَ أَنْ يُخْلَقَ إِلى أَنْ يَموتَ\n وأَجلٌ مُسَمّى مَا بينَ أَنْ يَموتَ إِلى أَنْ يُبْعَثَ\n ويقال (أجلاً): الدُّنيا، وأَجلٌ مُسَمَّى عِندَهُ: الآخِرةُ\n\n\n\n\nوقوله تعالى: { ثُمَّ أَنتُمْ تَمْتَرُونَ } معناه تَشكُّونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"He has decreed a term for everything\" - this means that everything has a set time, and that time is death.\n\n\nAnd His saying - {And a specified term} - is the Hereafter.\n It is said that he has a lifespan: meaning what is between his creation and his death.\n\nAnd a specified term between his death and his resurrection\n\n\nIt is said that {the world} is {dunya}, and {ajlun} is called {the hereafter}.\n\n\nAnd His saying, \"Then you will be questioned\" - its meaning is that you will be held accountable.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فهو الأجل الذي يقتضيه الاستعداد طبعاً بحسب هويته المسمّى أجلاً طبيعياً بالنظر إلى نفس ذلك المزاج الخاص والتركيب المخصوص بلا اعتبار عارض من العوارض الزمانية { وأجل مسمّى } معين { عنده } هو الأجل المقدّر الزماني الذي يجب وقوعه عند اجتماع الشرائط وارتفاع الموانع المثبت في كتاب النفس الفلكية التي هي لوح القدر المقارن لوقت معين ملازماً له\n كما قال تعالى:\n[الأعراف\n الآية: 34]\n { ثم أنتم } بعدما علمتم قدرته على إبدائكم وإفنائكم وإحاطة علمه بكم تشكون فيه وفي قدرته\n فتتبتلون لغيره تأثيراً وقدرة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف تعدلون عن طريق الحق وتسترون هويته مع هوياتكم الباطلة أيها التائهون في تيه الضلال؟! إنه: { هُوَ ٱلَّذِي خَلَقَكُمْ } أي: قدر وجودكم { مِّن طِينٍ } جماد قريب من العدم { ثُمَّ قَضَىۤ } وقدر { أَجَلاً } لحياتكم في النشاة الأولى { وَأَجَلٌ مُّسَمًّى } مقدر { عِندَهُ } لفنائكم فيه في النشأة الأخرى { ثُمَّ أَنتُمْ } بعدما علمتم وتحققتم منشأكم ونشأتكم الأولى { تَمْتَرُونَ } [الأنعام: 2] تشكون في النشأة الأخرى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { أجل }: مبتدأ. و { مُسَمى }: صفته. و { عنده }: خبر، وتخصيصه بالصفة أغنَى عن تقديم الخبر. يقول الحقّ جلّ جلاله: { هو الذي خلقكم من طين } أي: ابتدأ خلقكم منه، وهو آدم، لأنه المادة الأولى، وهو أصل البشر. { ثم قضى أجلاً } تنتهون في حياتكم إليه. وهو الموت. { وأجل مسمى } مُعيَّن للبعث، لا يقبل التغيير، ولا يتقدم ولا يتأخر،عنده استأثر بعلمه، لا مدخل لغيره فيه بعلم ولا قدرة، وهو المقصود بالبيان، { ثم أنتم تمترون } أي: تشكُّون في هذا الأجل المسمى الذي هو البعث. و { ثم }: لاستبعاد امترائهم بعد ما ثبت عنه أنه خالقهم، وخالق أصولهم ومحييهم إلى آجالهم، فإن مَن قدر على خلق المواد وجمعها، وإيداع الحياة فيها وإبقائها ما شاء، كان أقدر على جمع تلك المواد وإحيائها ثانيًا. قاله البيضاوي. الإشارة: القوالب من الطين، والأرواح من نور رب العالمين، فالطينية ظرف لنور الربوبية، الذي هو الروح لأن الروح نور من أنوار القدس، وسر من أسرار الله، فمن نظَّف طينته ولطَّفها ظهرت عليها أسرار الربوبية والعلوم اللدنية، وكُشف للروح عن أنوار الملكوت وأسرار الجبروت، وانخنَست الطينية، واستولت عليها الروح النورانية، ومن لطّخ طينته بالمعاصي وكثّفها باتباع الشهوات، انحجبت الأنوار واستترت، واستولت الطينية الظُلمانية على الروح النُورانية، وحجبتها عن العلوم اللدنية والأسرار القدسية، بحكمته تعالى وعدله وظهور قهره. وبالله التوفيق. ثم برهن على وحدانيته الخاصة، فقال: { وَهُوَ ٱللَّهُ فِي ٱلسَّمَاوَاتِ وَفِي ٱلأَرْضِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:76",
      "similarity": 0.6067756350300579
    },
    {
      "verse": "38:71",
      "similarity": 0.5895454172264976
    },
    {
      "verse": "51:33",
      "similarity": 0.5013284321152007
    },
    {
      "verse": "32:7",
      "similarity": 0.48810772641431255
    },
    {
      "verse": "7:12",
      "similarity": 0.4741857888724419
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/6:2.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/6:2.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}