{
  "chapter": "الأنعام",
  "text": "الذين ءاتينهم الكتب يعرفونه كما يعرفون ابناءهم الذين خسروا۟ انفسهم فهم لا يؤمنون",
  "translations": [
    {
      "translation": "Those We have given the Book recognise it as they recognise their own children. As for those who have lost their own selves, they have no iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book know it distinctly as they know their sons; but those who are lost of soul do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom We have given the Book will recognize this just as they recognize their own ofspring; but those who have courted their own ruin will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The People of the Book know him (Muhammad) just as well as they know their own children, but those who have lost their souls will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people to whom We gave the Book(s) recognise this Prophet (Mohammed – peace and blessings be upon him) as they recognise their own sons; those who put their own souls to ruin, do not accept faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Scripture recognize him, as they recognize their own children. Those who have lost (destroyed) themselves will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom We have given the Book recognize him as they recognize their sons; (as for) those who have lost their souls, they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book recognize it as they recognize their sons. Those who have lost their own souls, they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those unto whom We gave the Scripture recognise (this revelation) as they recognise their sons. Those who ruin their own souls will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Scriptures know this as they know their own sons. But those who have ruined their souls will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom We have vouchsafed the Book recognise him even as they recognise their own children. Yet those who have lost themselves will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom We have given the Book recognize him just as they recognize their sons. Those who have ruined their souls will not have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book know this as they know their own sons. Those who have lost their own souls refuse therefore to believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Scripture (Jews and Christians) recognize him (i.e. Muhammad SAW as a Messenger of Allah, and they also know that there is no Ilah (God) but Allah and Islam is Allah's Religion), as they recognize their own sons. Those who destroy themselves will not believe. (Tafsir At-Tabari)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book know him (Prophet Muhammad) as they know their own children. But those who have lost their own souls do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book recognize it as they recognize their own children; but those who have lost their souls do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Scripture recognize it as they recognize their [own] sons. Those who will lose themselves [in the Hereafter] do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:20] Those to whom We have given the Scripture recognise him, that is, Muhammad (s), by the descriptions of him in their Scripture, as they recognise their sons; those, of them, who have forfeited their own souls do not believe, in him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجملة مستأنفة انتقل بها أسلوب الكلام من مخاطبة الله المشركين على لسان الرسول صلى الله عليه وسلم إلى إخبار عامّ كسائر أخبار القرآن . أظهر الله دليلاً على صدق الرسول فيما جاء به بعد شهادة الله تعالى التي في قوله { قل الله شهيد بيني وبينكم } \\[ الأنعام : 19 \\] ، فإنّه لمَّا جاء ذكر القرآن هنالك وقع هذا الانتقال للاستشهاد على صدق القرآن المتضمّن صدق من جاء به ، لأنّه هو الآية المعجزة العامَّة الدائمة . وقد علمت آنفاً أنّ الواحدي ذكر أنّ رؤساء المشركين قالوا للنبيء صلى الله عليه وسلم قد سألنا عنك اليهود والنصارى فزعموا أن ليس عندهم ذكرك ولا صفتك إلى آخره؛ فإذا كان كذلك كان التعرّض لأهل الكتاب هنا إبطالاً لما قالوه أنّه ليس عندهم ذكر النبي ولا صفته ، أي فهم وأنتم سواء في جحد الحقّ ، وإن لم تجعل الآية مشيرة إلى ما ذكر في أسباب النزول تعيّن أن تجعل المراد بِ { الذين آتيناهم الكتاب } بعض أهل الكتاب ، وهم المنصفون منهم مثل عبد الله بن سلام ومخيريق ، فقد كان المشركون يقدُرون أهل الكتاب ويثقون بعلمهم وربما اتّبع بعض المشركين دين أهل الكتاب وأقلعوا عن الشرك مثل ورقة بن نوفل ، فلذلك كانت شهادتهم في معرفة صحّة الدين موثوقاً بها عندهم إذا أدّوها ولم يكتموها . وفيه تسجيل على أهل الكتاب بوجوب أداء هذه الشهادة إلى الناس .فالضمير المنصوب في قوله : { يعرفونه } عائد إلى القرآن الذي في قوله : { وأوحي إليّ هذا القرآن } \\[ الأنعام : 19 \\]. والمراد أنَّهم يعرفون أنّه من عند الله ويعرفون ما تضمّنه ممّا أخبرت به كتبهم ، ومن ذلك رسالة من جاء به ، وهو محمد صلى الله عليه وسلم لما في كتبهم من البشارة به . والمراد بالذين أوتوا الكتاب علماء اليهود والنصارى كقوله تعالى : { قل كفى بالله شهيداً بيني وبينكم ومن عنده علم الكتاب } \\[ الرعد : 43 \\].والتشبيه في قوله : { كما يعرفون أبناءهم } تشبيه المعرفة بالمعرفة . فوجه الشبه هو التحقّق والجزم بأنّه هو الكتاب الموعود به ، وإنّما جعلت المعرفة المشبّه بها هي معرفة أبنائهم لأن المرء لا يضلّ عن معرفة شخص ابنه وذاته إذا لقيه وأنّه هو ابنه المعروف ، وذلك لكثرة ملازمة الأبناء آباءهم عرفاً .وقيل : إنّ ضمير { يعرفونه } عائد إلى التوحيد المأخوذ من قوله : { إنّما هو إله واحد } \\[ الأنعام : 19 \\] وهذا بعيد . وقيل : الضمير عائد إلى النبي صلى الله عليه وسلم مع أنّه لم يجر له ذكر فيما تقدّم صريحاً ولا تأويلاً . ويقتضي أن يكون المخاطب غير الرسول صلى الله عليه وسلم وهو غير مناسب على أنّ في عوده إلى القرآن غنية عن ذلك مع زيادة إثباته بالحجَّة وهي القرآن .وقوله : { الذين خسروا أنفسهم فهم لا يؤمنون } استئناف لزيادة إيضاح تصلّب المشركين وإصرارهم ، فهم المراد بالذين خسروا أنفسهم كما أريدوا بنظيره السابق الواقع بعد قوله { ليجمعنكم إلى يوم القيامة لا ريب فيه } \\[ النساء : 87 \\]. فهذا من التكرير للتسجيل وإقامة الحجَّة وقطع المعذرة ، وأنّهم مصرّون على الكفر حتى ولو شهد بصدق الرسول أهل الكتاب ، كقوله { قل أرأيتم إن كان من عند الله وكفرتم به وشهد شاهد من بني إسرائيل على مثله فآمن واستكبرتم } \\[ الأحقاف : 10 \\]. وقيل : أريد بهم أهل الكتاب ، أي الذين كتموا الشهادة ، فيكون { الذين خسروا } بدلاً من { الذين آتيناهم الكتاب }.\n\n",
      "translations": [
        {
          "translation": "(Those unto whom We gave the Scripture) those unto who We gave the knowledge of the Torah, i.e. 'Abdullah Ibn Salam and his followers (recognise (him)) Muhammad through his traits and description (as they recognise their sons. Those who ruin their own souls) through losing this world and the Next, i.e. Ka'b Ibn al-Ashraf and his followers (will not believe) in Muhammad or the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { ٱلَّذِينَ آتَيْنَاهُمُ ٱلْكِتَابَ } من اليهود والنصارى { يَعْرِفُونَهُ } أي: سيدنا محمد صلى الله عليه وسلم بحيلته وأوصافه المذكورة في كتبهم { كَمَا يَعْرِفُونَ أَبْنَآءَهُمُ } بلا شائبة شك ووهم { ٱلَّذِينَ خَسِرُوۤاْ أَنْفُسَهُمْ } من أهل الشرك والتحريف { فَهُمْ لاَ يُؤْمِنُونَ } [الأنعام: 20] به وبنوبته ورسالته عناداً ومكابرة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { الذين آتيناهم الكتاب } من اليهود والنصارى\n { يعرفونه } أي: محمدًا صلى الله عليه وسلم بحليته المذكورة في التوراة والإنجيل\n { كما يعرفون أبناءهم } أو أشد\n وإنما كتموه جحدًا وخوفًا على رياستهم\n\n { الذين خسروا أنفسهم } من أهل الكتاب حيث كذَّبوا وكتموا\n ومن المشركين حيث كفروا وجحدوا\n { فهم لا يؤمنون } لتضييعهم ما به يُكتسب الإيمان من النظر والتفكير والإنصاف للحق\n فقد ظلموا أنفسهم وبخسوها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:121",
      "similarity": 0.4748225302999171
    },
    {
      "verse": "103:2",
      "similarity": 0.43306318467113536
    },
    {
      "verse": "77:1",
      "similarity": 0.42922981469824456
    },
    {
      "verse": "10:95",
      "similarity": 0.4269919393438467
    },
    {
      "verse": "2:146",
      "similarity": 0.413608492669798
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006020.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006020.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:20.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}