{
  "chapter": "الأنعام",
  "text": "الذين ءاتينهم الكتب يعرفونه كما يعرفون ابناءهم الذين خسروا۟ انفسهم فهم لا يؤمنون",
  "translations": [
    {
      "translation": "Those We have given the Book recognise it as they recognise their own children. As for those who have lost their own selves, they have no iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book know it distinctly as they know their sons; but those who are lost of soul do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom We have given the Book will recognize this just as they recognize their own ofspring; but those who have courted their own ruin will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The People of the Book know him (Muhammad) just as well as they know their own children, but those who have lost their souls will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people to whom We gave the Book(s) recognise this Prophet (Mohammed – peace and blessings be upon him) as they recognise their own sons; those who put their own souls to ruin, do not accept faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Scripture recognize him, as they recognize their own children. Those who have lost (destroyed) themselves will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom We have given the Book recognize him as they recognize their sons; (as for) those who have lost their souls, they will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book recognize it as they recognize their sons. Those who have lost their own souls, they do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those unto whom We gave the Scripture recognise (this revelation) as they recognise their sons. Those who ruin their own souls will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Scriptures know this as they know their own sons. But those who have ruined their souls will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom We have vouchsafed the Book recognise him even as they recognise their own children. Yet those who have lost themselves will not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom We have given the Book recognize him just as they recognize their sons. Those who have ruined their souls will not have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book know this as they know their own sons. Those who have lost their own souls refuse therefore to believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Scripture (Jews and Christians) recognize him (i.e. Muhammad SAW as a Messenger of Allah, and they also know that there is no Ilah (God) but Allah and Islam is Allah's Religion), as they recognize their own sons. Those who destroy themselves will not believe. (Tafsir At-Tabari)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book know him (Prophet Muhammad) as they know their own children. But those who have lost their own souls do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Book recognize it as they recognize their own children; but those who have lost their souls do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those to whom We have given the Scripture recognize it as they recognize their [own] sons. Those who will lose themselves [in the Hereafter] do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:20] Those to whom We have given the Scripture recognise him, that is, Muhammad (s), by the descriptions of him in their Scripture, as they recognise their sons; those, of them, who have forfeited their own souls do not believe, in him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those unto whom We gave the Scripture) those unto who We gave the knowledge of the Torah, i.e. 'Abdullah Ibn Salam and his followers (recognise (him)) Muhammad through his traits and description (as they recognise their sons. Those who ruin their own souls) through losing this world and the Next, i.e. Ka'b Ibn al-Ashraf and his followers (will not believe) in Muhammad or the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { ٱلَّذِينَ آتَيْنَاهُمُ ٱلْكِتَابَ } من اليهود والنصارى { يَعْرِفُونَهُ } أي: سيدنا محمد صلى الله عليه وسلم بحيلته وأوصافه المذكورة في كتبهم { كَمَا يَعْرِفُونَ أَبْنَآءَهُمُ } بلا شائبة شك ووهم { ٱلَّذِينَ خَسِرُوۤاْ أَنْفُسَهُمْ } من أهل الشرك والتحريف { فَهُمْ لاَ يُؤْمِنُونَ } [الأنعام: 20] به وبنوبته ورسالته عناداً ومكابرة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:121",
      "similarity": 0.4748225302999171
    },
    {
      "verse": "103:2",
      "similarity": 0.43306318467113536
    },
    {
      "verse": "77:1",
      "similarity": 0.42922981469824456
    },
    {
      "verse": "10:95",
      "similarity": 0.4269919393438467
    },
    {
      "verse": "2:146",
      "similarity": 0.413608492669798
    }
  ]
}