{
  "chapter": "الأنعام",
  "text": "ومن اظلم ممن افترى على الله كذبا او كذب بـايته انه لا يفلح الظلمون",
  "translations": [
    {
      "translation": "Who could do greater wrong than someone who invents lies against Allah or denies His Signs? The wrongdoers are certainly not successful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more wicked than he who invents lies about God or denies His revelations? Surely the wicked will not succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who could be more wrong-doing than he who either foists a lie on Allah or gives the lie to His signs? Surely such wrong-doers shall not attain success.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who are more unjust than those who ascribe falsehood to God or reject His revelations? The unjust will certainly have no happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than one who fabricates lies against Allah or denies His signs? Undoubtedly, the unjust will never succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than he who invents a lie against Allah or rejects His Ayat Verily, the wrongdoers shall never be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than he who forges a lie against Allah or (he who) gives the lie to His communications; surely the unjust will not be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does greater evil than he who forges against God a lie, or cries lies to His signs? They shall not prosper, the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who doth greater wrong than he who inventeth a lie against Allah or denieth His revelations? Lo! the wrongdoers will not be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who does greater wrong than he who invents a lie against God and denies His signs? Assuredly, the wrongdoers will not succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is a greater wrong-doer than he who fabricateth a lie against Allah or belieth His signs? Verily the wrong-doers shall not fare well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is a greater wrongdoer than him who fabricates a lie against Allah, or denies His signs? Indeed the wrongdoers will not be felicitous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who doth more wrong than he who inventeth a lie against Allah or rejecteth His signs? But verily the wrong-doers never shall prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does more wrong than he who invents a lie against Allah or rejects His Ayat (proofs, evidences, verses, lessons, revelations, etc.)? Verily, the Zalimun (polytheists and wrong-doers, etc.) shall never be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more wicked than he who invents a lie about Allah or belies His verses? The harmdoers shall never prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who does greater wrong than someone who fabricates lies against God, or denies His revelations? The wrongdoers will not succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than one who invents about Allah a lie or denies His verses? Indeed, the wrongdoers will not succeed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:21] And who, that is, none, does greater evil than he who invents a lie against God, by ascribing to Him an associate, or denies His signs?, the Qur’ān; it is verily the case that, they the evildoers shall not prosper, on account of this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على جملة { الذين خسروا أنفسهم } \\[ الأنعام : 20 \\]. فالمراد بهم المشركون مثل قوله : { ومن أظلم ممّن منع مساجد الله أن يذكر فيها اسمه } وقد تقدَّم نظيره في سورة البقرة ( 114 ). والمراد بافترائهم عقيدة الشرك في الجاهلية بما فيها من تكاذيب ، وبتكذيبهم الآيات تكذيبهم القرآن بعد البعثة . وقد جعل الآتي بواحدة من هاتين الخصلتين أظلم الناس فكيف بمن جمعوا بينهما .وجملة : إنّه لا يفلح الظالمون } تذييل ، فلذلك فصلت ، أي إذا تحقّق أنّهم لا أظلم منهم فهم غير مفلحين ، لأنّه لا يفلح الظالمون فكيف بمن بلغ ظلمه النهاية ، فاستغنى بذكر العلّة عن ذكر المعلول .وموقع ( إنّ ) في هذا المقام يفيد معنى التعليل للجملة المحذوفة ، كما تقرّر في كلام عبد القاهر . وموقع ضمير الشأن معها أفاد الاهتمام بهذا الخبر اهتمام تحقيق لتقع الجملة الواقعة تفسيراً له في نفس السامع موقع الرسوخ .والافتراء الكذب المتعمّد . وقوله : { كذباً } مصدر مؤكَّد له ، وهو أعمّ من الافتراء . والتأكيد يحصل بالأعم ، كما قدّمناه في قوله تعالى : { ولكنّ الذين كفروا يفترون على الله الكذب } في سورة المائدة ( 103 ) ، وقد نفى فلاحهم فعمّ كلّ فلاح في الدنيا والآخرة ، فإنّ الفلاح المعتدّ به في نظر الدين في الدنيا هو الإيمان والعمل ، وهو سبب فلاح الآخرة .\n\n",
      "translations": [
        {
          "translation": "(Who doth greater wrong) and is more daring (than he who inventeth a lie against Allah) by associating with Him other gods (and denieth His revelations) Muhammad and the Qur'an? (Lo! the wrong-doers) the disbelievers and idolaters (will not be successful) will not escape or be safe from Allah's torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَنْ أَظْلَمُ } عند الله وأوجب للبطش والانتقام { مِمَّنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ كَذِباً } وحرَّف كتابه عناداً { أَوْ كَذَّبَ بِآيَٰتِهِ } المنزلة على رسوله المبينة لطريق توحيده مكابرة بلا سند ودليل\n ومع ذلك يطلبون ويتوقعون الفوز والفلاح من عنده سبحانه { إِنَّهُ لاَ يُفْلِحُ ٱلظَّٰلِمُونَ } [الأنعام: 21] الخارجون عن مقتضى العقل والنقل\n التاركون متابعة من أيده الحق وأرسله إلى الخلق لإشاعة توحيده وتبليغ أحكامه اللائقة بوحدة ذاته وإزاحة الشرك وإزالته بالمرة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ومَن أظلم ممّن افترى على الله كذبًا } بأن كتم شهادة الحق\n وهي صفة الرسول ـ عليه الصلاة والسلام ـ أو ادّعاءُ الملائكة بنات الله\n وهؤلاء شفعاؤنا عند الله\n { أو كذَّب بآياته } كالقرآن والمعجزات وسمَّوها سِحرًا\n أي: لا أحد أظلم ممن فَعل هذا\n وإنما عبَّر بـ \" أو \" \n وهم قد جمعوا بين الأمرين تنبيهًا على أن كل واحد منهما وحده بالِغٌ غاية الإفراط في الظلم على النفس\n { إنه } أي: الأمر والشأن { لا يُفلح الظالمون } \n فضلاً عمّن لا أحد أظلم منه\n الإشارة: أقبحُ الناس منزلة عند الله\n من تحقق بخصوصية ولي من أولياء الله\n ثم كَتمها وجَحدها حسدًا وعنادًا\n وجعل يُنكر عليه\n فقد آذن بحرب من الله\n فالتسليمُ عناية\n والانتقاد جناية\n والاستنصافُ من شأن الكرام\n والتعصب من شأن اللئام\n وبالله التوفيق\n ثم ذكر وعيد أهل الشّرك\n فقال: { وَيَوْمَ نَحْشُرُهُمْ جَمِيعاً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:69",
      "similarity": 0.8888439016148436
    },
    {
      "verse": "10:17",
      "similarity": 0.8838980852906965
    },
    {
      "verse": "16:105",
      "similarity": 0.5860609499575822
    },
    {
      "verse": "3:94",
      "similarity": 0.5831113414435929
    },
    {
      "verse": "2:5",
      "similarity": 0.5681315247895354
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006021.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006021.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:21.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}