{
  "chapter": "الأنعام",
  "text": "ويوم نحشرهم جميعا ثم نقول للذين اشركوا۟ اين شركاؤكم الذين كنتم تزعمون",
  "translations": [
    {
      "translation": "On the Day We gather them all together, We will say to those who associated others with Allah, 'Where are the partner-gods, for whom you made such claims?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day We shall gather all of them together and say to those who ascribe (partners to God): \"Where are the compeers who you claimed (were equal to God)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when We shall gather them all together, We shall ask those who associated others with -Allah in His divinity: 'Where, now, are your partners whom you imagined (to have a share in the divinity of Allah)?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day of Judgment when We will gather all people together, We will ask the pagans, \"Where are those whom you believed to be your gods?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when We will resurrect everyone together, then say to the polytheists, “Where are those partners (your false deities) whom you professed?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when We shall gather them all together, We shall say to those who joined partners in worship (with Us): \"Where are your partners (false deities) whom you used to assert (as partners in worship with Allah)\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when We shall gather them all together, then shall We say to those who associated others (with Allah): Where are your associates whom you asserted?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day when We shall muster them all together, then We shall say unto those who associated other gods with God, 'Where are your associates whom you were asserting?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the day We gather them together We shall say unto those who ascribed partners (unto Allah): Where are (now) those partners of your make-believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when We gather them all together, We will say to those who associated [others with Us], \"Where are those partners that you claimed?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let them beware the Day whereon We shall gather them all together; then We shall say unto those who associated: where are your associate-gods whom ye have been asserting?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when We gather them all together, We shall say to those who ascribed partners [to Allah] ‘Where are your partners that you used to claim?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One day shall We gather them all together: We shall say to those who ascribed partners (to Us): \"Where are the partners whom ye (invented and) talked about?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And on the Day when We shall gather them all together, We shall say to those who joined partners in worship (with Us): \"Where are your partners (false deities) whom you used to assert (as partners in worship with Allah)?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when We gather them all together We shall say to the idolaters: 'Where are your partners now, those whom you claimed'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when We gather them all together, then say to the idolaters, “Where are your idols, those you used to claim?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention, O Muhammad], the Day We will gather them all together; then We will say to those who associated others with Allah, \"Where are your 'partners' that you used to claim [with Him]?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:22] And, mention, on the day We shall gather them all together, then We shall say, in rebuke, to those who associated other gods with God, ‘Where are those associates of yours whom you were claiming?’, to be associates of God?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And on the Day We gather them together) all mankind on the Day of Judgement (We shall say unto those who ascribed partners (unto Allah): Where are (now) those partners) idols (of your make-believe) that you worshipped and claimed they would intercede for you?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر لهم يا أكمل الرسل { يَوْمَ نَحْشُرُهُمْ } وتجمعهم { جَمِيعاً ثُمَّ نَقُولُ لِلَّذِينَ أَشْرَكُواْ } استهزاءً وتفيضحاً لهم على رءوس الملأ: { أَيْنَ شُرَكَآؤُكُمُ ٱلَّذِينَ كُنتُمْ تَزْعُمُونَ } [الأنعام: 22] أنهم آهلة مستحقة للعبودية والإيمان، وتعتقدون أنهم يشفعون لكم وينقذونكم من العذاب؟ ادعوهم لينقذوكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "28:62",
      "similarity": 0.8206482016688434
    },
    {
      "verse": "28:74",
      "similarity": 0.8206482016688434
    },
    {
      "verse": "40:73",
      "similarity": 0.5703114248648217
    },
    {
      "verse": "68:40",
      "similarity": 0.5310130433573281
    },
    {
      "verse": "26:92",
      "similarity": 0.4949309099516895
    }
  ]
}