{
  "chapter": "الأنعام",
  "text": "ثم لم تكن فتنتهم الا ان قالوا۟ والله ربنا ما كنا مشركين",
  "translations": [
    {
      "translation": "Then they will have no recourse except to say, 'By Allah, our Lord, we were not idolaters.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then their excuse will be but to say: \"By God our Lord, we were not idolaters.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they will be able to play no mischief but will say (falsely): 'By Allah, our Lord, we associated none (with You in Your divinity).'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Attempting to answer, they will say, \"Lord, we swear by Your Name that we were not pagans\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they had no fabrication except that they said, “By Allah, our Lord, we were never polytheists!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will then be (left) no Fitnah for them but to say: \"By Allah, our Lord, we were not those who joined others (in worship with Allah).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then their excuse would be nothing but that they would say: By Allah, our Lord, we were not polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they shall have no proving, but to say, 'By God our Lord, we never associated other gods with Thee.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then will they have no contention save that they will say: By Allah, our Lord, we never were idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they will have no excuse but to say, \"By God our Lord, we have never been polytheists.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they will have no excuse but to say: by God our Lord, we have not been associaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then their only excuse will be to say, ‘By Allah, our Lord, we were not polytheists.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will then be (left) no subterfuge for them but to say: \"By Allah our Lord, we were not those who joined gods with Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will then be (left) no Fitnah (excuses or statements or arguments) for them but to say: \"By Allah, our Lord, we were not those who joined others in worship with Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then it was not their trial, but they will say: 'By Allah, our Lord we have never been idolaters'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then their only argument will be to say, “By God, our Lord, we were not idolaters.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there will be no [excuse upon] examination except they will say, \"By Allah, our Lord, we were not those who associated.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:23] Then their dissension (read accusative fitnatahum or nominative fitnatuhum) their apology, was (read lam takun or lam yakun) only to say, in other words, [was only] their saying, ‘By God, our Lord (read rabbinā as an adjective of [wa’Llāhi, ‘by God’], or rabbanā as a vocative) we were never idolaters’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then will they have no contention) excuse or answer (save that they will say: By Allah, our Lord, we never were idolaters).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ لَمْ تَكُنْ فِتْنَتُهُمْ } معناهُ معذرتُهمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بعدما سمعوا ما سمعوا { لَمْ تَكُنْ فِتْنَتُهُمْ } وحيلتهم للخلاص { إِلاَّ أَن قَالُواْ } معتذرين مقسمين: { وَٱللَّهِ رَبِّنَا } أنت يا مولانا { مَا كُنَّا } في أنفسنا { مُشْرِكِينَ } [الأنعام: 23] لك غيرك عابدين لسواك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { لم تكن فتنتهم إلا أن قالوا } ، من قرأ بالرفع والتأنيث: ففتنة اسمها، و { إلاَّ أن قالوا }: خبرها، ومن قرأ بالنصب: فخبرٌ مقدم، والتأنيث لأجل الخبر، ومن قرأ بالتذكير والنصب، فخبر مقدم، و { إلاَّ أن قالوا }: أسمها\n يقول الحقّ جلّ جلاله: { و } اذكر يا محمد { يوم نحشرهم } أي: المشركين، { جميعًا ثم نقول للذين أشركوا أين شركاؤكم } أي: آلهتكم التي جعلتموها شركاء لله، { الذين كنتم } تزعمونهم شركاء، وتودونها وتنتصرون لها، فيُحالُ بينهم وبينها، ويتبرأون منها، كما قال تعالى: { ثم لم تكن فتنتهم إلا أن قالوا والله ربنا ما كنا مشركين } أي: لم تكن عاقبة كفرهم الذي افتتنوا به، إلا التبرؤ منه، بعد الانتصار له والتعصب عليه، أو: لم يكن جواب اختبارهم إلا التبرؤ من الشرك، فيكذبون ويحلفون عليه، مع علمهم بأنه لا ينفع من فَرط الحيرة والدهشة\n فإن قلت: كيف يجحدون مع قوله:\n\n[النِّساء:42] فالجواب: أن ذلك يختلف باختلاف الطوائف والمواطن، فيكتم قومٌ ويُقر آخرون، ويكتمون في موطن ويُقرون في موطن آخر لأن يوم القيامة طويل، وقال ابن عباس لَمَّا سئل عن هذا:  إنهم جحدوا، طَمَعًا في النجاة، فختم الله على أفواههم وتكلمت جوارحهم، فلا يكتمون حديثًا",
      "translations": []
    }
  ]
}