{
  "chapter": "الأنعام",
  "text": "ومنهم من يستمع اليك وجعلنا على قلوبهم اكنة ان يفقهوه وفى ءاذانهم وقرا وان يروا۟ كل ءاية لا يؤمنوا۟ بها حتى اذا جاءوك يجدلونك يقول الذين كفروا۟ ان هذا الا اسطير الاولين",
  "translations": [
    {
      "translation": "Some of them listen to you but We have placed covers on their hearts, preventing them from understanding it, and heaviness in their ears. Though they see every Sign, they still have no iman, so that when they come to you, disputing with you, those who are kafir say, 'This is nothing but the myths of previous peoples!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some among them who listen to you; but We have put a covering on their hearts so that they fail to understand it, and a deafness appears in their ears. Even if they saw all the signs they would not believe in them; and even when they come to you to dispute with you, the unbelievers say: \"This is nothing but fables of antiquity.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them there are some who appear to pay heed to you, but upon their hearts We have laid coverings so they understand it not; and in their ears, heaviness (so they hear not). Even if they were to witness every sign, they would still not believe in it so much so that when they come to you, they dispute with you, those who disbelieve contend: 'This is nothing but fables of the ancient times.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them listen to you, but We have veiled their hearts so that they cannot understand and made them deaf. They disbelieve all the evidence (of Our existence) that they may have seen. They only come to you for the sake of argument and the disbelievers say that (whatever Muhammad says) is no more than ancient legends.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them is one who listens to you; and We have put covers upon their hearts so they may not understand it, and deafness in their ears; and (even) if they see all the signs, they will not believe in them; to the extent that when they come to you to debate with you, the disbelievers say, “This is nothing but stories of former people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them there are some who listen to you; but We have set veils on their hearts, so they understand it not, and deafness in their ears; if they see every one of the Ayat they will not believe therein; to the point that when they come to you to argue with you, those who disbelieve say: \"These are nothing but tales of the men of old.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them is he who hearkens to you, and We have cast veils over their hearts lest they understand it and a heaviness into their ears; and even if they see every sign they will not believe in it; so much so that when they come to you they only dispute with you; those who disbelieve say: This is naught but the stories of the ancients.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And some of them there are that listen to thee, and We lay veils upon their hearts lest they understand it, and in their ears heaviness; and if they see any sign whatever, they do not believe in it, so that when they come to thee they dispute with thee, the unbelievers saying, 'This is naught but the fairy-tales of the ancient ones.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of them are some who listen unto thee, but We have placed upon their hearts veils, lest they should understand, and in their ears a deafness. If they saw every token they would not believe therein; to the point that, when they come unto thee to argue with thee, the disbelievers say: This is naught else than fables of the men of old.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them are some who listen to you, but We have placed veils over their hearts and deafness in their ears which prevent them from understanding what you say. Even if they saw all the signs, they would still not believe in them. When those who deny the truth come to dispute with you, they will say, \"This is nothing but ancient fables,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them are some who hearken unto thee and We have set over their hearts veils lest they understand it, and in their ears heaviness, and though they see any sign they will not believe therein: in as much as when they come to thee, they dispute with thee. Then who disbelieve say: this is naught but the fables of the ancients.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are some of them who prick up their ears at you, but We have cast veils on their hearts lest they should understand it, and a deafness into their ears; and though they should see every sign, they will not believe in it. When they come to you, to dispute with you, the faithless say, ‘These are nothing but myths of the ancients.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of them there are some who (pretend to) listen to thee; but We have thrown veils on their hearts, So they understand it not, and deafness in their ears; if they saw every one of the signs, not they will believe in them; in so much that when they come to thee, they (but) dispute with thee; the Unbelievers say: \"These are nothing but tales of the ancients.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And of them there are some who listen to you; but We have set veils on their hearts, so they understand it not, and deafness in their ears; if they see every one of the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) they will not believe therein; to the point that when they come to you to argue with you, the disbelievers say: \"These are nothing but tales of the men of old.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of them listen to you. But We have cast veils over their hearts lest they understand it and in their ears heaviness; and if they see every sign they do not believe in it. When they come to you they argue, the unbelievers say: 'This is nothing but the tales of the ancient ones'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Among them are those who listen to you; but We place covers over their hearts, to prevent them from understanding it, and heaviness in their ears. Even if they see every sign, they will not believe in it. Until, when they come to you, to argue with you, those who disbelieve will say, “These are nothing but myths of the ancients.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And among them are those who listen to you, but We have placed over their hearts coverings, lest they understand it, and in their ears deafness. And if they should see every sign, they will not believe in it. Even when they come to you arguing with you, those who disbelieve say, \"This is not but legends of the former peoples.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:25] And there are some of them who listen to you, when you recite, and We have placed veils, covers, upon their hearts so that they do not understand it, [so that] they [do not] comprehend the Qur’ān; and in their ears a heaviness, a deafness, so that they do not hear it with a willingness to accept it. And if they were to see every sign, they would not believe in it, so that when they come to you to argue with you, the disbelievers say, ‘This, Qur’ān, is nothing but the fables, the lies, of the ancients’, similar to [their] jokes and strange tales (asātīr, ‘fables’, is the plural of ustūra).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "134 (Of them are some who listen unto you) Allah says: of the people of Mecca there are some who listen to your speech and words, among them Abu Sufyan Ibn Harb, al-Walid Ibn al-Mughira, al-Nadr Ibn al-Harith, 'Utbah and Shaybah the sons of Rabi'ah, Umayyah Ibn Khalaf, and al-Harth Ibn 'Amir, (but We have placed upon their hearts veils) a cover, (lest they should understand) so that they do not understand your speech or words, (and in their ears a deafness) so that they do not hear the Truth and guidance; it is also said this means: We have placed a heaviness in their ears so that they cannot comprehend the guidance. (If they saw every token) they have asked you to produce (they would not believe therein) this was asked by al- Harth Ibn 'Amir; (to the point that, when they come unto thee to argue with thee) asking you about what was revealed in the Qur'an, and when you informed them, (the disbelievers) i.e. al-Nadr Ibn al-Harith (say: This) what Muhammad says (is naught else than fables of the men of old) the lies and stories of people of old.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَكِنَّةً أَن يَفْقَهُوهُ } معناهُ غِطَاءٌ\n\n\n\n\nوقوله تعالى: { وَفِيۤ آذَانِهِمْ وَقْراً } معناهُ صَمَمٌ\n\n\n\n\nوقوله تعالى: { أَسَٰطِيرُ ٱلأَوَّلِينَ } معناهُ الأَبَاطِيلُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كان { مِنْهُمْ } أي: من هؤلاء المشركين المعتذرين { مَّن يَسْتَمِعُ إِلَيْكَ } حين تتلو القرآن ولم يفهموه أنكروه واستهزءا به { وَ } كيف يفهمونه؛ إذ { جَعَلْنَا عَلَىٰ قُلُوبِهِمْ أَكِنَّةً } أغطية وأغشية كراهة { أَن يَفْقَهُوهُ وَفِيۤ ءَاذَانِهِمْ وَقْراً } يمنع عن استماعه { وَ } من غاية إنكارهم وعنادهم { إِن يَرَوْاْ كُلَّ ءَايَةٍ } دالةٍ على توحيد الحق وتمجيده { لاَّ يُؤْمِنُواْ بِهَا } عناداً ومكابرة { حَتَّىٰ إِذَا جَآءُوكَ } من إفراط عتوهم { يُجَٰدِلُونَكَ } في آيات الله بما لا يليق بها حيث { يَقُولُ ٱلَّذِينَ كَفَرُوۤاْ } ستراً للحق وترويجاً للباطل: { إِنْ هَـٰذَآ } ما هذا الكلام الذي أتى به سيدنا محمد صلى الله عليه وسلم { إِلاَّ أَسَٰطِيرُ ٱلأَوَّلِينَ } [الأنعام: 25] يسطرونها لتضليل ضعفاء العوام\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { مَنْ }: لفظها مفرد ومعناها جمع، فيجوز في الضمير مراعاة اللفظ فيُفرد، كقوله هنا: { ومنهم من يستمع إليك } ، ويجوز مراعاة المعنى فيجمع، كقوله في يونس:\n\n[يُونس:42]، والأكِنَّة: الأغطِية، جمع كنان، و { أن يفقهوه }: مفعول له أي: كراهية أن يفقهوه، و { حتى }: غاية، أي: انتهى التكذيب حتى وصلوا إليك يجادلونك، والجملة بعدها: إمَّا في محل جر بها ويجادلونك جواب لها، و { يقول }: تبيين لها، وإما لا محل لها فتكون ابتدائية\n والأساطير: جمع أسطورة، أو أسطار جمع سَطر، فيكون جمع الجمع\n يقول الحقّ جلّ جلاله: ومن الكفار { من يستمع إليك } حين تقرأ القرآن، والمراد: أبو سفيان والوليد والنضر وعُتبة وشَيبَة وأبو جهل وأضرابهم، اجتمعوا فسمعوا رسول الله صلى الله عليه وسلم يقرأ، فقالوا للنضر: ما تقول؟ فقال: والذي جعلها بيننا وبينه ما أدري ما يقول، إلا أنه يحرك لسانه، ويقول أساطير الأولين، مثل ما جئتُكم به\n قال السُّهَيلي: حيث ما ورد في القرآن: \" أساطير الأولين \" فإنَّ قائلها هو النضر بن الحارث، وكان قد دخل بلاد فارس وتعلَّم أخبار ملوكِهم، فكان يقول: حديثي أحسنُ من حديث محمد، فنزلت فيه وفي أصحابه\n { وجعلنا على قلوبهم أكنَّةً } أي: أغطية كراهة { أن يفقهوه } لما سبق لهم من الشقاء، { و } جعلنا { في آذانهم وقرًا } أي: ثقلاً وصمَمًا فلا يسمعون معانيه، ولا يتدبرونها\n { وإن يَرَوا كلَّ آية } ومعجزة { لا يؤمنوا بها } لفرط عنادهم، واستحكام التقليد فيهم، وسبقِ الشقاء لهم، فلا يزال التكذيب والشك يعظُم فيهم { حتى إذا جاؤوك يجادلونك } أي: حتى ينتهي بهم التكذيب إلى أن يجيؤوك يجادلونك { يقول الذين كفروا إن } أي: ما { هذا إلا أساطير } أي: أكاذيب { الأولين } ، فإنَّ جَعلَ أصدق الحديث خرافاتِ الأولين غايةٌ التكذيب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:46",
      "similarity": 0.6678355636507286
    },
    {
      "verse": "18:57",
      "similarity": 0.6635121164408593
    },
    {
      "verse": "41:5",
      "similarity": 0.5608191153159189
    },
    {
      "verse": "51:2",
      "similarity": 0.40526983389923776
    },
    {
      "verse": "71:13",
      "similarity": 0.39392132477311376
    }
  ]
}