{
  "chapter": "الأنعام",
  "text": "ولو ترى اذ وقفوا۟ على النار فقالوا۟ يليتنا نرد ولا نكذب بـايت ربنا ونكون من المؤمنين",
  "translations": [
    {
      "translation": "If only you could see when they are standing before the Fire and saying, 'Oh! If only we could be sent back again, we would not deny the Signs of our Lord and we would be among the muminun.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you should see them when they are stood before the Fire, they will say: \"Ah would that we were sent back (to the world)! We shall not deny the signs of our Lord, and be among those who believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could but see when they shall be made to stand by the Fire! They will plead: 'Would that we were brought back to life? Then we would not give the lie to the signs of our Lord and would be among the believers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only you could see them standing in the fire saying, \"Would that we could return to the worldly life. We would never reject any of our Lord's revelations and we would be true believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you see them when they will be placed above hell, they will say, “Alas, if only we might be sent back and not deny the signs of our Lord, and become Muslims!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could but see when they will be held over the (Hell) Fire! They will say: \"Would that we were but sent back (to the world)! Then we would not deny the Ayat of our Lord, and we would be of the believers!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And could you see when they are made to stand before the fire, then they shall say: Would that we were sent back, and we would not reject the communications of our Lord and we would be of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou couldst see when they are stationed before the Fire, and they say, 'Would that we might be returned, and then not cry lies to the signs of our Lord, but that we might be among the believers!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou couldst see when they are set before the Fire and say: Oh, would that we might return! Then would we not deny the revelations of our Lord but we would be of the believers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could only see when they are set before the Fire. They will say, \"If only we could be sent back. Then we would not deny the signs of our Lord and we would be of the believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And couldst thou see what time they shall be held over the Fire, and then they will say: would that we were sent back and now we shall not belie the signs of our Lord and we shall be of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were you to see when they are brought to a halt by the Fire, whereupon they will say, ‘If only we were sent back [into the world]! Then we will not deny the signs of our Lord, and we will be among the faithful!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou couldst but see when they are confronted with the Fire! They will say: \"Would that we were but sent back! Then would we not reject the signs of our Lord, but would be amongst those who believe!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could but see when they will be held over the (Hell) Fire! They will say: \"Would that we were but sent back (to the world)! Then we would not deny the Ayat (proofs, evidences, verses, lessons, revelations, etc.) of our Lord, and we would be of the believers!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could see them when they are set before the Fire! They will say: 'Would that we could return! Then we would not belie the verses of our Lord and would be believers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only you could see, when they are made to stand before the Fire; they will say, “If only we could be sent back, and not reject the revelations of our Lord, and be among the faithful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could but see when they are made to stand before the Fire and will say, \"Oh, would that we could be returned [to life on earth] and not deny the signs of our Lord and be among the believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:27] If you, O Muhammad (s), could see when they are made to stand, [when] they are exposed, before the Fire, and they say, ‘Oh (yā is for exclamation) would that we might be returned, to the world; then we would not deny the signs of our Lord, but we would be among the believers!’ (read nukadhdhibu and nakūnu as a new   [independent] sentence; or read nukadhdhiba and nakūna as the [subjunctive] response to the optative [clause]; or read nukadhdhibu and nakūna). The response to the clause ‘if [you could see]’ would be ‘you would be seeing a terrible thing indeed’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If thou couldst see) Muhammad (when they are set before) locked up in (the Fire and say: Oh, would that we might return!) to the world (Then would we not deny the revelations of our Lord) i.e. in the Scriptures and messengers (but we would be of the believers!) with the believers inwardly and outwardly.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَوْ تَرَىٰ } أيها الرائي { إِذْ وُقِفُواْ } أي: حين أشرفوا { عَلَى ٱلنَّارِ } وتحققوا الوقوع والإيقاع فيها عنوة وعنفاً لرأيت أمراً فظيعاً فجيعاً { فَقَالُواْ } حينئذٍ من غاية تفزعهم وتفجعهم متمنين: { يٰلَيْتَنَا نُرَدُّ } على أعقابنا التي كنا فيها { وَلاَ نُكَذِّبَ بِآيَٰتِ رَبِّنَا } التي جئنا فيها فكذبناها { وَنَكُونَ مِنَ ٱلْمُؤْمِنِينَ } [الأنعام: 27] المصدقين بمن جاءنا بها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:24",
      "similarity": 0.7917934878853057
    },
    {
      "verse": "6:30",
      "similarity": 0.7334383524996326
    },
    {
      "verse": "34:31",
      "similarity": 0.7097684748336823
    },
    {
      "verse": "33:66",
      "similarity": 0.33201781155080506
    },
    {
      "verse": "69:27",
      "similarity": 0.3238797399272627
    }
  ]
}