{
  "chapter": "الأنعام",
  "text": "بل بدا لهم ما كانوا۟ يخفون من قبل ولو ردوا۟ لعادوا۟ لما نهوا۟ عنه وانهم لكذبون",
  "translations": [
    {
      "translation": "No, it is simply that what they were concealing before has been shown to them; and if they were sent back they would merely return to what they were forbidden to do. Truly they are liars.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no. What they were hiding has now become clear to them. If they were sent back they would surely return to what had been forbidden them, for surely they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No! They will say this merely because the Truth which they had concealed will become obvious to them; or else if they were sent back, they would still revert to what was forbidden to them. (So this plea of theirs would be a lie too) for they are just liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever they had concealed will be revealed to them. If they were to return to (the worldly life), they would again worship idols, for they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact it has become clear to them what they used to hide before; and were they to be sent back, they would commit the same which they were forbidden to, and undoubtedly they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, what they had been concealing before has become manifest to them. But if they were returned (to the world), they would certainly revert to that which they were forbidden. And indeed they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, what they concealed before shall become manifest to them; and if they were sent back, they would certainly go back to that which they are forbidden, and most surely they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No; that which they were concealing before has now appeared to them; and even if they were returned, they would again commit the very thing they were prohibited; they are truly liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but that hath become clear unto them which before they used to hide. And if they were sent back they would return unto that which they are forbidden. Lo! they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The truth they used to hide will become all too clear to them. But if they were sent back, they would return to what they had been forbidden. For they are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yea! manifest hath become unto them that which they were erst wont to hide. And were they sent back they would surely return to that which was prohibited to them, and verily they are perfect liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, what they used to hide before has now become evident to them. But were they to be sent back they would revert to what they were forbidden, and they are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yea, in their own (eyes) will become manifest what before they concealed. But if they were returned, they would certainly relapse to the things they were forbidden, for they are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, it has become manifest to them what they had been concealing before. But if they were returned (to the world), they would certainly revert to that which they were forbidden. And indeed they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, that which they concealed will appear to them. But if they were sent back, they would return to that which they have been forbidden. They are indeed liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What they used to conceal before will become clear to them. And even if they were sent back, they would revert to what they were forbidden. They are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But what they concealed before has [now] appeared to them. And even if they were returned, they would return to that which they were forbidden; and indeed, they are liars.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:28] God, exalted be He, says: Nay — [here used] in order to reject the desire to believe implied by the optative [exclamation] — that which they used to conceal, to hide, before, by their saying, By God, our Lord, we were never idolaters! [Q. 6:23]) has now become evident to them, as their limbs have borne witness [against them], and so they [now] wish for that [mentioned in the previous verse]; and even if, hypothetically, they were returned, to the world, they would return to that which they are forbidden, of idolatry; they are truly liars, when they promise that they would believe [if they were to be returned].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay, but that) their punishment (hath become clear unto them which before) in the life of this world (they used to hide) their disbelief and idolatry. (And if they were sent back) to the life of this world, as they request (they would return unto that which they are forbidden) their disbelief and idolatry. (Lo! they are liars) because were they to be returned, they would still not believe.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بَلْ بَدَا } وظهر { لَهُمْ مَّا كَانُواْ يُخْفُونَ مِن قَبْلُ } حقية الرسل والكتب عناداً واستكباراً فتمنوا حين اليأس والبأس ضجراً لا عزماً صحيحاً\n حيث لو ردوا لآمنوا البتة بل { وَ } الله { لَوْ رُدُّواْ } أي: لو فرض ردهم إلى الدنيا بعد وقوعهم على أهوال الآخرة { لَعَادُواْ } من خباثة طينتهم { لِمَا نُهُواْ عَنْهُ } أيضاً مكابرة وعناداً { وَ } بالجملة: { إِنَّهُمْ } في هذا التمني أيضاً { لَكَاذِبُونَ } [الأنعام: 28] البتة لكون جبلتهم وأصل فطرتهم على الكذب لا يزول عنهم أصلاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { بل بدَا لهم } أي: ظهر لهم يوم القيامة في صحائفهم { ما كانوا يُخفون من قبل } في دار الدنيا من عيوبهم وقبائح أعمالهم\n أو: بدا لهم حِقيّة الإيمان وبطلان ضده\n عيانًا\n لمَّا وقفوا الى التوحيد وعرفوه ضرورة\n وقد كانوا في الدنيا يُخفونه ويُظهرون الشرك\n عياذًا بالله\n قال تعالى: { ولو رُدُّوا } إلى الدنيا بعد الوقوف والظهور { لعادوا لما نُهوا عنه } من الكفر والمعاصي لأنهم من قبضة الشقاء\n والعياذ بالله\n { وإنهم لكاذبون } فيما وعدوا من أنفسهم من الإيمان وعدم التكذيب\n وفي هذا الإخبار بما لا يكون\n ولو كان كيف يكون\n وهو مما انفرَد الله بعلمه\n الإشارة: يوم القيامة هو محل ظهور حقائق الأشياء على ما هي عليه\n فإن كانت حقًا ظهرت حقيقتها وصحتها\n وإن كانت باطلة\n ظهر بطلانها عيانًا\n لكن لا تنفع المعرفة حينئذٍ\n لرفع حجاب الحكمة وظهور القدرة\n فلم يبقَ غيبٌ\n وإنما المزِيَّةُ في الإيمان بالغيب\n والمعرِفةَ في النكران\n والشهود خلف رداء الكبرياء\n بشهود المعاني خلف الأواني\n فإن ظهرت المعاني فلا إيمان\n وإنما يبقَى العيان\n لأهل العيان\n والخيبة لأهل الخذلان\n قال الورتجبي: القوم لم يعرفوا حقائق الكفر في الدنيا\n ولو عرفوه لكانوا موحدين\n فيظهر لهم يوم القيامة حقيقة الكفر\n ولا ينفعهم ذلك لفوتهم السير في النكرات\n التي معرفتها توجب المعارف\n وذلك المقام في أماكن صُدورهم\n وهم كانوا يخفونه بمتابعة صورة الكفر وشهوة العصيان بغير اختيارهم لقلة عرفانهم به\n ولا يكون قلبٌ من العرش إلى الثرى إلا ويطرقه هواتف الغيب\n بإلهام الله الذي يعرف به طُرُقَ رضى الحق\n وصاحبه يعلم ذلك ويسمع ويُخفيه في قلبه\n لأنه أدق من الشعرة\n وحركته أخفى من دبيب النمل\n ومع ذلك يعرفه من نفسه\n ولكن من غلَبت شهواتُ نفسه عليه\n لا يتبع خطاب الله بالسر\n فأبدى الله لهم ما كانوا يخفونه\n تعييرًا لهم وحجة عليهم\n انتهى\n قلت: قوله: ولا يكون قلب\n\n\n الخ\n حاصل كلامه: أن القلب من حيث هو لابد أن يطرقه الخصم إن حاد عن الحق\n وهو المراد بهواتف الغيب\n لكنه أخفى من دبيب النمل في حق الغافلين\n فإن كان القلب حيًّا متيقظًا تتبع ذلك الخصم حتى يزيله بظهور الحق\n وإن كان ميتًا بغلبة الشهوات أخفاه حتى يموت\n فيبدو له ما كان يخفيه من قبل\n والله تعالى أعلم\n ثم ذكر اعتقادهم الفاسد\n وما أدّاهم إليه\n فقال: { وَقَالُوۤاْ إِنْ هِيَ إِلاَّ حَيَاتُنَا }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:54",
      "similarity": 0.6001387015883917
    },
    {
      "verse": "2:284",
      "similarity": 0.5231541433972163
    },
    {
      "verse": "3:29",
      "similarity": 0.5132156869389461
    },
    {
      "verse": "4:149",
      "similarity": 0.5122616050154222
    },
    {
      "verse": "2:271",
      "similarity": 0.4136439221895389
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/6:28.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/6:28.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/6:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}