{
  "chapter": "الأنعام",
  "text": "وهو الله فى السموت وفى الارض يعلم سركم وجهركم ويعلم ما تكسبون",
  "translations": [
    {
      "translation": "He is Allah in the heavens and in the earth. He knows what you keep secret and what you make public and He knows what you earn.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God in the heavens and the earth. He knows what you hide and bring out into the open, and knows what you earn (of good and evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who is One True God in the heavens and in the earth. He knows your deeds - both secret and open - and knows fully whatever you earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God of the heavens and the earth and He knows whatever you conceal, reveal, or gain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Allah (the God) of the heavens and in the earth; He knows all, your secrets and your disclosures, and He knows your deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Allah, in the heavens and the earth, He knows what you conceal and what you reveal, and He knows what you earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Allah in the heavens and in the earth; He knows your secret (thoughts) and your open (words), and He knows what you earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God in the heavens and the earth; He knows your secrets, and what you publish, and He knows what you are earning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah in the heavens and in the earth. He knoweth both your secret and your utterance, and He knoweth what ye earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God both in the heavens and on earth. He has knowledge of all that you hide and all that you reveal. He knows what you do;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah in the heavens and the earth; He knoweth your secret and your publishment, and He knoweth that which ye earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah in the heavens and on the earth: He knows your secret and your overt [matters], and He knows what you earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Allah in the heavens and on earth. He knoweth what ye hide, and what ye reveal, and He knoweth the (recompense) which ye earn (by your deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Allah (to be worshipped Alone) in the heavens and on the earth, He knows what you conceal and what you reveal, and He knows what you earn (good or bad).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Allah in the heavens and earth. He has knowledge of all that you hide and all that you reveal. He knows what you earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is God in the heavens and the earth. He knows what you keep secret and what you make public; and He knows what you earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Allah, [the only deity] in the heavens and the earth. He knows your secret and what you make public, and He knows that which you earn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:3] He is God, the One worthy of being worshipped, in the heavens and in the earth. He knows your secrets and your utterance, what you keep secret and what you utter openly among yourselves, and He knows what you   earn, what you do of good and evil.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He is Allah in the heavens) He is the God of the dwellers of heaven (and in the earth) and the God of all the dwellers of the earth. (He knoweth both your secret and your utterance) He says: He knows what you keep hidden in your breasts just as He knows what you make public, (and He knoweth what you earn) of good or evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n  { وهو الله } في صورة الكل سواء ألوهيته بالنسبة إلى العالم العلويّ والسفليّ { يعلم سرّكم } في عالم الأرواح الذي هو عالم الغيب { وجهركم } في عالم الأجسام الذي هو عالم الشهادة { ويعلم ما تكسبون } فيهما من العلوم والعقائد والأحوال والحركات والسكنات والأعمال صحيحها وفاسدها\n صوابها وخطئها\n خيرها وشرّها\n فيجازيكم بحسبها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف تمتمرون وتشكون فيها مع أنه { هُوَ ٱللَّهُ } القادر المتوحد المتفرد المتجلي { فِي ٱلسَّمَٰوَٰتِ وَفِي ٱلأَرْضِ } بالاستقلال والانفراد { يَعْلَمُ } بعلمه الحضوري { سِرَّكُمْ وَجَهْرَكُمْ وَيَعْلَمُ مَا تَكْسِبُونَ } [الأنعام: 3] من خير وشر ونفعوضر في نشأتكم الأولى\n\n\n{ وَ } من أمارات كفرهم وسترهم أنهم { مَا تَأْتِيهِم مِّنْ آيَةٍ } عظيمة دالة على توحيد الحق بلسان رسول من الرسل العظام { مِّنْ آيَٰتِ رَبِّهِمْ } المتوحد بالربوبية { إِلاَّ كَانُواْ } من غاية كفرهم وجهلهم { عَنْهَا مُعْرِضِينَ } [الأنعام:4]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { هو }: مبتدأ، و { الله }: خبره. و { في السماوات }: خبر ثان، أي: وهو الله كائن أو موجود في السماوات وفي الأرض بنوره وعلمه. قال تعالى:\n[النور:35]. و { يعلم سركم وجهركم }: تقرير له. يقول الحقّ جلّ جلاله: هذا الذي اختص بالحمد وأبدع الكائنات كلها ـ { هو الله } ظاهر { في السماوات وفي الأرض } بنوره وقدرته وعلمه وإحاطته، فلا شريك معه { يعلم سركم وجهركم ويعلم ما تكسبون } من خير أو شر، فيثيب عليه ويعاقب، ولعله أراد بالسر والجهر ما يظهر من أحوال النفس، وبالمكتسب أعمال الجوارح. فالآية الأولى دليل القدرة التي ختم بها السورة، والآية الثانية دليل البعث، والآية الثالثة دليل الوَحدة. الإشارة: قال بعض العارفين: الحق تعالى مُنزَّه عن الأّين والجهة، والكيف، والمادة، والصورة، ومع ذلك لا يخلو منه أين، ولا مكان، ولا كم، ولا كيف، ولا جسم، ولا جوهر، ولا عرض، لأنه للطفه سار في كل شيء، ولنوريته ظاهر في كل شيء، ولإطلاقه وإحاطته متكيف بكل كيف، غير متقيد بذلك، فمن لم يعرف هذا ولم يذقه ولم يشهده، فهو أعمى البصيرة، محروم من مشاهدة الحق تعالى. ولابن وفا:\nثم ذم مَن أعرض عن دلائل توحيده، فقال: { وَمَا تَأْتِيهِم مِّنْ آيَةٍ مِّنْ آيَاتِ رَبِّهِمْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:7",
      "similarity": 0.759619155336885
    },
    {
      "verse": "67:13",
      "similarity": 0.7532838781774333
    },
    {
      "verse": "71:8",
      "similarity": 0.6968414495084204
    },
    {
      "verse": "4:148",
      "similarity": 0.6354433276637712
    },
    {
      "verse": "87:7",
      "similarity": 0.6280005591452156
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/6:3.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/6:3.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/6:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}