{
  "chapter": "الأنعام",
  "text": "ولو ترى اذ وقفوا۟ على ربهم قال اليس هذا بالحق قالوا۟ بلى وربنا قال فذوقوا۟ العذاب بما كنتم تكفرون",
  "translations": [
    {
      "translation": "If only you could see when they are standing before their Lord. He will say, 'Is this not the Truth?' They will say, 'Yes indeed, by our Lord!' He will say, 'Then taste the punishment for your kufr.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you see them when they are put before their Lord, He will say to them: \"Is not this the truth?\" They will answer: \"Indeed, by our Lord.\" He will say: \"Then taste the agony of punishment for what you had denied.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could but see when they will be made to stand before their Lord. He will say: 'Is not this the truth?' They will say: 'Yes indeed, by our Lord.'Whereupon He will say: 'Taste the chastisement, then, for your denying the Truth.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Would that you could see them standing before their Lord who would ask them, \"Is not the Resurrection true?\" They would reply, \"Yes, Lord, there is a Resurrection.\" The Lord would then say, \"For your disbelief, suffer the torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you see when they are placed before their Lord, He will say, “Is this not real (the truth)? They will say, “Yes – why not, by our Lord!” He will say, “So now taste the punishment – the recompense of your disbelief.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could but see when they will stand before their Lord! He will say: \"Is not this the truth\" They will say: \"Yes, by our Lord!\" He will then say: \"So taste you the torment because you used not to believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And could you see when they are made to stand before their Lord. He will say: Is not this the truth? They will say: Yea! by our Lord. He will say: Taste then the chastisement because you disbelieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou couldst see when they are stationed before their Lord! He will say, 'Is not this the truth?' They will say, 'Yes indeed, by our Lord!' He will say, 'Then taste the chastisement for your unbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou couldst see when they are set before their Lord! He will say: Is not this real? They will say: Yea, verily, by our Lord! He will say: Taste now the retribution for that ye used to disbelieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could only see when they are made to stand before their Lord! He will ask them, \"Is this [second life] not the truth?\" They will say, \"Yes, by our Lord!\" He will say, \"Then, taste the punishment that comes from your having refused to acknowledge the truth!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And couldst thou see what time they shall be held before their Lord? He will say: is this not real? They will say: aye! by our Lord! He will say: taste then the torment for ye have been disbelieving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Were you to see when they are brought to a halt before their Lord. He will say, ‘Is this not a fact?’ They will say, ‘Yes, by our Lord!’ He will say, ‘So taste the punishment because of what you used to deny.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou couldst but see when they are confronted with their Lord! He will say: \"Is not this the truth?\" They will say: \"Yea, by our Lord!\" He will say: \"Taste ye then the penalty, because ye rejected Faith.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could but see when they will be held (brought and made to stand) in front of their Lord! He will say: \"Is not this (Resurrection and the taking of the accounts) the truth?\" They will say: \"Yes, by our Lord!\" He will then say: \"So taste you the torment because you used not to believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could see them when they are made to stand before their Lord! He will say: 'Is this not the truth' 'Yes, by our Lord' they will reply, and He will say: 'Taste then the punishment, for that which you disbelieved'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If only you could see, when they are stationed before their Lord. He will say, “Is this not real?” They will say, “Yes indeed, by our Lord.” He will say, “Then taste the torment for having disbelieved.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you could but see when they will be made to stand before their Lord. He will say, \"Is this not the truth?\" They will say, \"Yes, by our Lord.\" He will [then] say, \"So taste the punishment because you used to disbelieve.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:30] If you could see when they are made to stand, [when they are] presented, before their Lord, you would certainly see an awesome thing! He will say, to them, by the tongue of the angels, in rebuke: ‘Is this, resurrection and reckoning, not the truth?’ They will say, ‘Yes indeed, by our Lord’, it is the truth! He will say, ‘Then taste the chastisement because you disbelieved’, during life on earth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(If thou couldst see) Muhammad (when they are set before) constrained before (their Lord! He will say) Allah says to them; it is also said that this means: the angels say to them: (Is not this real?) Is not this torment and resurrection after death real? (They will say: Yea, verily, by our Lord!) It is the Truth as informed by the messengers (He will say: Taste now the retribution for that ye used to disbelieve) in your resurrection after death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ولو ترى إذ وقفوا على ربهم } في القيامة الكبرى وهو تصوير لحالهم في الاحتجاب والبعد وإلا لم يكن ثم قول ولا جواب، لحرمانهم عن لحضور والشهود، وإن كانوا في عين الجمع المطلق\n واعلم أن الوقف على الشيء غير الوقوف معه، فإن الوقوف مع الشيء يكون طوعاً ورغبة، والوقف على الشيء لا يكون إلا كرهاً ونفرة، فمن وقف مع الله بالتوحيد كمن قال:\n\nلا يوقف للحساب، بل هو من أهل الفوز الأكبر الذين قال فيهم:\n\n[الكهف، الآية: 28]،\n\n[الأنعام، الآية: 52] ويثاب بأنواع النعيم في الجنان كلها\n ومن وقف مع الغير بالشرك وقف على الربّ وعذب بجميع أنواع العذاب في مراتب النيران كلها، لكون حجابه أغلظ وكفره أعظم\n ومن وقف مع الناسوت بمحبة اللّذات والشهوات، ولبث في حجاب الآثار وقف على الملكوت وعذّب بنيران الحرمان عن المراد، وسلّط عليه زبانية الهيآت المظلمة، وقرن بشياطين الأهواء المردية\n ومن وقف مع الأفعال وخرج عن حجاب الآثار، وقف على الجبروت، وعذّب بنار الطمع والرجاء، وردّ إلى مقام الملكوت\n ومن وقف مع الصفات وخرج عن حجاب الأفعال، وقف على الذات، وعذّب بنار الشوق في الهجران وإن كان من أهل الرضا وهذا الموقف ليس هو الموقف على الربّ، فإن الموقوف على الذات يعرف ربّه الموصوف بصفات اللطف كالرحيم، والرؤوف، والكريم، دون الموقوف على الربّ فهو حجاب الأنية كما أنّ الواقف مع الأفعال في حجاب أوصافه، والواقف مع الناسوت في حجاب أفعاله التي هي من جملة الآثار\n فالمشرك موقوف في المواقف الأربعة أولاً على الربّ فيحجب بالبعد والطرد، كما قال:\n\n[المؤمنون: 108]، وقال:\n\n[آل عمران، الآية: 106]، ثم على الجبروت فيطرد بالسخط والقهر كما قال:\n\n[آل عمران، الآية: 77]، ثم على الملكوت فيزجر بالغضب واللعن كما قيل:\n\n[الزمر، الآية: 72] ثم على النار، فيعذب بأنواع النيران أبداً، كما قال على لسان مالك:\n\n[الزخرف، الآية: 77]، فيكون وقفه على النار متأخراً عن وقفه على الربّ، معلولاً منه، كما قال:\n\n[يونس، الآية: 70]\n وأما الواقف مع الناسوت فيقف للحساب على الملكوت ثم على النار، وقد ينحى لعدم السخط وقد لا ينحى لوجوده\n والواقف مع الأفعال لا يوقف على النار أصلاً، بل يحاسب ويدخل الجنة\n وأما الواقف مع الصفات فهو من الذين:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَوْ تَرَىٰ } أيها الرائي { إِذْ وُقِفُواْ عَلَىٰ رَبِّهِمْ } أي: حين وقفوا وصفوا عند ربهم\n ليحاسبوا بما عملوا لرأيتهم حيارى سكارى مضطرين مضطربين { قَالَ } لهم سبحانه من وراء سرادقات العز والإجلال: { أَلَيْسَ هَـٰذَا بِٱلْحَقِّ } أيها الحمقى الكاذبون المكذبون؟ { قَالُواْ } بعدما كوشفوا وعوينوا معتذرين متفجعين مصدقين مقسمين: { بَلَىٰ وَرَبِّنَا } آمنا وصدقنا { قَالَ } سبحانه: الآن لن ينفعكم الإيمان { فَذُوقُواْ ٱلعَذَابَ بِمَا كُنتُمْ تَكْفُرُونَ } [الأنعام: 30] وتكذبون به في النشأة الأولى التي هي دار الفتنة والاختبار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { وقالوا } أي: الكفار في إنكار البعث: { إن هي } أي: الحياة { إلا حياتنا الدنيا } لا حياة بعدها، { وما نحن بمبعوثين } ، قال جل جلاله: { ولو ترى إذ وُقفوا على ربهم } ، كناية عن حبسهم للسؤال والتوبيخ، أو: وقفوا على قضاء ربهم بين عباده، وعرفوه حق التعريف، قال لهم الحق جل جلاله: { أليس هذا } الذي كنتم تُنكرونه، { بالحق قالوا بلى وربنا } إنه لحق، ولكنا كنا قومًا ضالين، وهو إقرار مؤكد باليمين، لانجلاء الأمر غاية الجلاء، قال تعالى لهم: { فذوقوا } أي: باشروا { العذاب بما كنتم تكفرون } أي: بسبب كفركم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:24",
      "similarity": 0.8141114205370681
    },
    {
      "verse": "34:31",
      "similarity": 0.7351730058136832
    },
    {
      "verse": "6:27",
      "similarity": 0.7334383524996325
    },
    {
      "verse": "46:34",
      "similarity": 0.3961984897481353
    },
    {
      "verse": "36:81",
      "similarity": 0.2749899238066347
    }
  ]
}