{
  "chapter": "الأنعام",
  "text": "قد خسر الذين كذبوا۟ بلقاء الله حتى اذا جاءتهم الساعة بغتة قالوا۟ يحسرتنا على ما فرطنا فيها وهم يحملون اوزارهم على ظهورهم الا ساء ما يزرون",
  "translations": [
    {
      "translation": "Those who deny the meeting with Allah have lost, so that, when the Hour comes upon them suddenly, they will say, 'Alas for how we neglected it!' They will bear their burdens on their backs. How evil is what they bear!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are surely lost who call the meeting with God a lie. When the Hour comes upon them unawares, they will say: \"Alas, we neglected it!\" and carry their burdens on their backs: How evil the burden they will carry!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who consider it a lie that they will have to meet Allah are indeed the losers so much so that when that Hour comes to them suddenly they will say: 'Alas for us, how negligent we have been in this behalf.' They will carry their burden (of sins) on their backs. How evil is the burden they bear!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who do not believe in the Day of Judgment have incurred upon themselves a great loss. When the Day of Judgment suddenly comes upon them, they will sink under the burden of their sins in grief for their neglecting that day. Terrible indeed will be their burden!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who denied their meeting with Allah, have indeed failed; to the extent that when the Last Day suddenly came upon them they said, “Woe to us that we failed to believe in it” – and they carry their burdens on their backs; what an evil burden they carry!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They indeed are losers who denied their meeting with Allah, until all of a sudden, the Hour (signs of death) is upon them, and they say: \"Alas for us that we gave no thought to it,\" while they will bear their burdens on their backs; and evil indeed are the burdens that they will bear!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are losers indeed who reject the meeting of Allah; until when the hour comes upon them all of a sudden they shall say: O our grief for our neglecting it! and they shall bear their burdens on their backs; now surely evil is that which they bear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lost indeed are they that cried lies to the encounter with God, so that when the Hour comes to them suddenly they shall say, 'Alas for us, that we neglected it!' On their backs they shall be bearing their loads; O how evil the loads they bear!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They indeed are losers who deny their meeting with Allah until, when the Hour cometh on them suddenly, they cry: Alas for us, that we neglected it! They bear upon their backs their burdens. Ah, evil is that which they bear!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those indeed are the losers who deny the meeting with God. When the Hour comes on them suddenly, they cry, \"Alas for us, that we neglected it!\" They shall bear their burdens on their backs. Evil are the burdens they shall bear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lost surely are those who belie their meeting with Allah, until when the Hour cometh on them on a sudden, and they will say: woe betide us, that we neglected it! - the while they will be bearing their burthens on their backs. Lo! vile is that which they shall bear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are certainly losers who deny the encounter with Allah. When the Hour overtakes them suddenly, they will say, ‘Alas for us, for what we neglected in it!’ And they will bear their burdens on their backs. Look! Evil is what they bear!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lost indeed are they who treat it as a falsehood that they must meet Allah,- until on a sudden the hour is on them, and they say: \"Ah! woe unto us that we took no thought of it\"; for they bear their burdens on their backs, and evil indeed are the burdens that they bear?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They indeed are losers who denied their Meeting with Allah, until all of a sudden, the Hour (signs of death) is on them, and they say: \"Alas for us that we gave no thought to it,\" while they will bear their burdens on their backs; and evil indeed are the burdens that they will bear!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are lost indeed, those who belied the meeting with Allah. When the Hour overtakes them suddenly, they will say: 'Alas, for us, that we neglected it' On their backs they shall be bearing their sinful loads; how evil is what they sin!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Losers are those who deny the encounter with God. Then, when the Hour comes upon them suddenly, they will say, “Alas for us, how we have neglected it.” And they will carry their burdens on their backs—evil is what they carry.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those will have lost who deny the meeting with Allah, until when the Hour [of resurrection] comes upon them unexpectedly, they will say, \"Oh, [how great is] our regret over what we neglected concerning it,\" while they bear their burdens on their backs. Unquestionably, evil is that which they bear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:31] They indeed are losers who deny the encounter with God, through resurrection, until (hattā is purposive to expose the [extent of their] mendacity) when the Hour, the Resurrection, comes upon them suddenly, they shall say, ‘Alas for us (yā hasratanā, ‘O grief of ours’, expresses extreme suffering, the [vocative] call to which is figurative, meaning ‘Now is the time for you [O grief], so come forth!’) that we neglected it!’, the worldly life. On their backs they shall be bearing their burdens, so that these come to them at the Resurrection in the vilest of forms and with the most putrid of smells, and they ride them. Ah, evil is that, burden of theirs, which they bear!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They indeed are losers who deny their meeting with Allah) i.e. deny their resurrection after death; Allah says: leave them (until, when the Hour cometh on them suddenly, they cry: Alas for us) how great is our sadness, and how sorry we are, (that we neglected it!) that we neglected faith and repentance in our worldly life. (They bear upon their back their burdens) their sins. (Ah, evil is that which they bear) of sins!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْزَارَهُمْ } معناهُ آثَامُهُم\n واحِدُهَا وِزرٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه تقريعاً وتوبيخاً لهم: { قَدْ خَسِرَ } وخاب { ٱلَّذِينَ كَذَّبُواْ بِلِقَآءِ ٱللَّهِ } مع نزول الآيات الدالة عليه، وإرشاد الرسل والأنبياء والأولياء لهم { حَتَّىٰ إِذَا جَآءَتْهُمُ ٱلسَّاعَةُ } المعدة للعرض { بَغْتَةً } فجأة { قَالُواْ } بعدما انكشفوا به وتيقنوا له متسحرين خائبين خاسرين: { يٰحَسْرَتَنَا } كلمة تحسر وتأسف { عَلَىٰ مَا فَرَّطْنَا فِيهَا } أي: في النشاة الأولى من التكذيب وعدم الإيمان { وَهُمْ } في تلك الحالة { يَحْمِلُونَ } وبال { أَوْزَارَهُمْ } وآثامهم { عَلَىٰ ظُهُورِهِمْ } خائبين خاسرين محرومين عن مطالعة وجه الله الكريم { أَلاَ سَآءَ مَا يَزِرُونَ } [الأنعام: 31] في الدنيا، ويحرمون بها في العقبى عن لقاء المولى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قد خسر الذين كذبوا بلقاء الله } ، حيث فاتهم النعيم، واستوجبوا العذاب المقيم، والمراد بلقاء الله: البعث وما يتبعه\n فاستمروا على التكذيب { حتى إذا جاءتهم الساعة بغتة } أي: فجأة { قالوا يا حسرتنا } أي: يا هلكتنا { على ما فرطنا } أي: قصَّرنا { فيها } أي: في الحياة الدنيا، أو في الساعة، أي: في شأنها والاستعداد لها، { وهم يحملون أوزارهم على ظهورهم } ، كناية عن تحمل الذنوب، لأن العادة حمل الأثقال على الظهور، وقيل: أنهم يحملونها حقيقة، وقد رُوِي: أن الكافر يركبه عمله، بعد أن يتمثل له في أقبح صورة، وأن المؤمن يركب عمله، بعد أن يتصور له في أحسن صورة\n قال تعالى في شأن الكفار: { ألا ساء ما يزرون } أي: بئس شيئًا يَزِرُونَهُ ويرتكبونه في الدنيا وزرهم هذا، الذي يتحملونه على ظهورهم يوم القيامة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:56",
      "similarity": 0.5457334912156665
    },
    {
      "verse": "20:45",
      "similarity": 0.37574481437097246
    },
    {
      "verse": "6:61",
      "similarity": 0.33490290060497496
    },
    {
      "verse": "16:62",
      "similarity": 0.32227689184646113
    },
    {
      "verse": "6:38",
      "similarity": 0.3115854966308676
    }
  ]
}