{
  "chapter": "الأنعام",
  "text": "وما الحيوة الدنيا الا لعب ولهو وللدار الءاخرة خير للذين يتقون افلا تعقلون",
  "translations": [
    {
      "translation": "As for the life of this world, it is nothing but a frolic and frivolity. The final abode is the best for those who are pious and fear God. Do you not comprehend?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is nothing but a sport and a pastime, and the life of the Hereafter is far better for those who seek to ward off their ruin. Will you not, then, understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The worldly life is but useless amusement and sport (compared to) the life hereafter which is far better and is only for the pious. Will you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is nothing except a pastime and sport; and undoubtedly the abode of the Hereafter is better for the pious; so do you not have sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the life of this world is nothing but play and amusement. But far better is the abode of the Hereafter for those have Taqwa. Will you not then understand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this world's life is naught but a play and an idle sport and certainly the abode of the hereafter is better for those who guard (against evil); do you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The present life is naught but a sport and a diversion; surely the Last Abode is better for those that are godfearing. What, do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Naught is the life of the world save a pastime and a sport. Better far is the abode of the Hereafter for those who keep their duty (to Allah). Have ye then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is but a sport and a pastime. Surely the Home of the Hereafter is best for those who fear God. Will you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And naught is the life of world but a play and a sport, and surely the abode of the Hereafter is better for those who fear. Reflect then ye not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of the world is nothing but play and diversion, and the abode of the Hereafter is surely better for those who are Godwary. Do you not exercise your reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is the life of this world but play and amusement? But best is the home in the hereafter, for those who are righteous. Will ye not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the life of this world is nothing but play and amusement. But far better is the house in the Hereafter for those who are Al-Muttaqun (the pious - see V. 2:2). Will you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is but playing and an amusement. Surely, the Everlasting home is better for the cautious. Will you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The life of this world is nothing but game and distraction, but the Home of the Hereafter is better for those who are righteous. Do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the worldly life is not but amusement and diversion; but the home of the Hereafter is best for those who fear Allah, so will you not reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:32] The life of this world, that is, preoccupation with it, is nothing but a game and a diversion, while obedience and what is conducive to it are of the things of the Hereafter; surely the abode of the Hereafter (wa-la’l-dāru is also read wa-la-dāru’l-ākhirati), namely, Paradise, is better for those who fear idolatry. What, do they not understand? this, and so believe? (read a-fa-lā ya‘qilūna, ‘do they not understand’, or a-fa-lā ta‘qilūna, ‘do you not understand?’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "135 (Naught is the life of the world) the comfort and enjoyment of the life of the world is nothing (save a pastime) amusement (and a sport) worthless activity. (Better far is the abode of the Hereafter) i.e. Paradise (for those who keep their duty (to Allah)) for those who ward off disbelief, idolatry and indecencies. (Have ye then no sense?) Do you not comprehend that this world is evanescent and that the Hereafter is everlasting?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا ٱلْحَيَٰوةُ ٱلدُّنْيَآ } التي يحصرون الحياة عليها، ويحرمون من الحياة الحقيقية لأجلها { إِلاَّ لَعِبٌ وَلَهْوٌ } يلعب بهم ويلهيهم ويشغلهم عن الحياة الأبدية والبقاء السرمدي { وَلَلدَّارُ ٱلآخِرَةُ } وجناتها الحقيقية ولذاتها المعنوية { خَيْرٌ لِّلَّذِينَ يَتَّقُونَ } عن محارم الله ومنهياته في الحياة الصورية { أَفَلاَ تَعْقِلُونَ } [الأنعام: 32] وتميزون أيها العقلاء بين الحياتين، ولا تعلمون أي اللذتين خير لكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وسبب هذا: الركون إلى دار الغرور ونيسان دار الخلود، ولذلك قال تعالى بإثره: { وما الحياة الدنيا إلا لعب ولهو } أي: وما أعمالها إلا لعب ولهو، تُلهي الناس وتشغلهم عما يعقب منفعة دائمة ولذة حقيقية، وما مدة بقائها مع ما يعقبها من الفناء إلاَّ كمدة اللعب واللهو، إذ لا طائل تحته لمن لم يعمر أوقاتها بطاعة ربه، { وللدار الآخرة خير للذين يتقون } لدوامها وخلوص نعيمها وصفاء لذاتها، { أفلا تعقلون } أيّ الأمرين خير، هل دار الخراب والفناء، أو دار النعيم والبقاء، وفي قوله: { للذين يتقون }: تنبيه على أن ما ليس من أعمال المتقين كله لعب ولهو\n الإشارة: إذا كمل نور العقل حصل لصاحبه التمييز بن الحق والباطل، وبين الضار والنافع، فنظر بعين اعتباره إلى الدنيا، فوجدها ذاهبة فانية، ونظر إلى الآخرة، فرآها مقبلة باقية دائمة، فصدف عن الدنيا مُوليًا، وأعرض عن زهرتها مدبرًا، وأقبل بكليته إلى مولاه، غائبًا عن كل ما سواه، فجعل الموت وما بعده نصب عينيه، وخلف الدنيا وراء ظهره أو تحت قدميه\n وفي الحِكم: \" لو أشرق نور اليقين في قلبك، لرأيت الآخرة أقرب من أن ترحل إليها، ولرأيت الدنيا، وكسفَةُ الفناء ظاهرة عليها \" وقال بعض الحكماء:  لو كانت الدنيا من ذهب يفنى، والأخرة من طين يبقى، لاختار العاقل ما يبقى على ما يفنى، ولا سيما والأمر بالعكس، الدنيا من طين يفنى والآخرة من ذهب يبقى\n فلا يختار هذه الدار إلا من لا عقل له أصلاً\n وفي الحديث عنه صلى الله عليه وسلم:\n\n \" الدُّنيا دَارُ مَن لا دَار لَه، وَمَالُ مَن لا مَالَ لَهُ، لَهَا يَجَمعُ مَن لاَ عَقل لَهُ، وعلَيها يُعَادى مَن لا عِلم عِنده \" \n",
      "translations": []
    }
  ]
}