{
  "chapter": "الأنعام",
  "text": "قد نعلم انه ليحزنك الذى يقولون فانهم لا يكذبونك ولكن الظلمين بـايت الله يجحدون",
  "translations": [
    {
      "translation": "We know that what they say distresses you. It is not that they are calling you a liar; the wrongdoers are just denying Allah's Signs.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know what they say distresses you. It is not you in fact they accuse of lies, but the wicked deny the revelations of God!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Muhammad!) We know indeed that the things they say grieve you, though in truth it is not you whom they give the lie to, but it is the signs of Allah that these wrong-doers reject.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We certainly know that you (Muhammad) are sad about what they (the unbelievers) say. It is not you (alone) who has been accused of lying. The unjust have always rejected God's revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know well that their statement grieves you – so they do not deny you (Prophet Mohammed – peace and blessings be upon him) but in fact the unjust deny the signs of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know indeed the grief which their words cause you; it is not you that they deny, but it is the verses of Allah that the wrongdoers deny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know indeed that what they say certainly grieves you, but surely they do not call you a liar; but the unjust deny the communications of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know indeed that it grieves thee the things they say; yet it is not thee they cry lies to, but the evildoers - it is the signs of God that they deny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know well how their talk grieveth thee, though in truth they deny not thee (Muhammad) but evil-doers flout the revelations of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know that what they say grieves you. It is not you that the wrongdoers are rejecting, rather it is the signs of God that they reject.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know indeed that verily that which they say grieveth thee, but it is not thee they belie; it is the signs of Allah the wrong- doers gainsay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We certainly know that what they say grieves you. Yet it is not you that they deny, but it is Allah’s signs that the wrongdoers impugn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know indeed the grief which their words do cause thee: It is not thee they reject: it is the signs of Allah, which the wicked contemn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know indeed the grief which their words cause you (O Muhammad SAW): it is not you that they deny, but it is the Verses (the Quran) of Allah that the Zalimun (polytheists and wrong-doers) deny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know what they say saddens you. It is not you that they belie; but the harmdoers deny the verses of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know that what they say grieves you. It is not you they reject, but it is God's revelations that the wicked deny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know that you, [O Muhammad], are saddened by what they say. And indeed, they do not call you untruthful, but it is the verses of Allah that the wrongdoers reject.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:33] We know indeed (qad is a confirmative particle) that it grieves you that, matter, which they say, to you, in denial; yet it is not that they deny you, in secret, for they know that you are truthful (a variant reading [for lā yukadhdhibūnaka, ‘not [that] they deny you’] has lā yukdhibūnak, that is to say, ‘they do not associate you with mendacity’) but evildoers (al-zālimīn replaces the previous pronominalisation [‘they’]) knowingly reject, deny, the signs of God, the Qur’ān.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We know well how their talk) their slander, denial and demand for proofs (grieveth thee) Muhammad, (though in truth they) i.e. al-Harth Ibn 'Amir and his followers (deny not thee (Muhammad)) inwardly (but evil-doers) the idolaters (flout the revelations of Allah) quite openly.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { قد نعلم إنه ليحزنك } عتاب لرسول الله صلى الله عليه وسلم بظهور نفسه بصفة الحزن { لا يكذبونك } إلى آخره\n أي: ليس إنكارهم تكذيبك لأنك لست في هذه الدعوة قائماً بنفسك ولا هذا الكلام صفة لك\n بل تدعوهم بالله وصفاته وهذه عادة قديمة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { قَدْ نَعْلَمُ إِنَّهُ } الشا\n { لَيَحْزُنُكَ } ويؤذيك القول { ٱلَّذِي يَقُولُونَ } في حقك أولئك المعاندون المكابرون من أنك ساحر كاذب مجنون شاعر وغيرها\n ولا تبال بهم وبقولهم { فَإِنَّهُمْ } في الحقيقة { لاَ يُكَذِّبُونَكَ وَلَـٰكِنَّ ٱلظَّٰلِمِينَ } الخارجين عن حدود الله\n المنصرفين عن مقتضى أحكامه { بِآيَاتِ ٱللَّهِ } المنزلة عليك من عنده لإهداء التائهين من عباده { يَجْحَدُونَ } [الأنعام: 33] ينكرون ويعاندون جحوداً وإصراراً\n وبالجملة: فاصبر على أذاهم يا أكمل الرسل إلى أن يحل عليهم الغضب من الله المنتقم المقتدر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { قد } للتحقيق\n وإنه ضمير الشأن\n وقرأ نافع: \" يُحزن \" \n بضم الياء حيث وقع\n إلا قوله:\n[الأنبيَاء:103] والباقون: بفتح الياء\n وفيه لغتان: حزن يحزُن\n كنصر ينصر\n وأحزن يحزِن\n والأول أشهر\n ومن قرأ: \" يُكذّبُونَك \" بالتشديد فمعناه: لا يعتقدون كذبك\n وإنما هم يجحدون الحق مع علمهم به\n ومن قرأ بالتخفيف فمعناه: لا يجدونك كاذبًا\n يقال: أكذبت الرجل إذا وجدته كاذبًا\n وقيل: معناهما واحد\n يقال: كذّب فلانٌ فلانًا\n وأكذبه\n بمعنى واحد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:47",
      "similarity": 0.715945447808847
    },
    {
      "verse": "29:49",
      "similarity": 0.6957151163334399
    },
    {
      "verse": "40:63",
      "similarity": 0.6701868494619938
    },
    {
      "verse": "41:28",
      "similarity": 0.6209655725112955
    },
    {
      "verse": "16:71",
      "similarity": 0.5488122770246756
    }
  ]
}