{
  "chapter": "الأنعام",
  "text": "وان كان كبر عليك اعراضهم فان استطعت ان تبتغى نفقا فى الارض او سلما فى السماء فتاتيهم بـاية ولو شاء الله لجمعهم على الهدى فلا تكونن من الجهلين",
  "translations": [
    {
      "translation": "If their aversion still weighs upon you, seek out a tunnel (going deep) into the earth, or a ladder reaching out to the skies, and bring them a sign: (Even then they will not believe). If God had willed He would have brought them all to the right path. So be not like the pagans.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nevertheless, if their turning away grieves you, then seek - if you can - either a way down into the earth or a ladder to the heavens, and try to bring to them some sign. Had Allah so willed, He would have gathered them all to the true guidance. Do not, then, be among the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), if their refusal of the faith is so grievous to you and if you can dig up the earth or ascend into the sky in search of further evidence to inevitably make them believe you, you should have done so, but note that had God wanted, He could have made them all follow the same guidance. Do not ever be unaware (of this fact).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if their turning away has grieved you, then if you can, seek a tunnel into the earth or a ladder into the sky to bring a sign for them; and if Allah willed, He could have brought them all together upon guidance, so O listener (followers of this Prophet) do not ever be of the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If their aversion is hard on you, then if you were able to seek a tunnel in the ground or a ladder to the sky, so that you may bring them a sign. And had Allah willed, He could have gathered them together upon true guidance, so be not you one of the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if their turning away is hard on you, then if you can seek an opening (to go down) into the earth or a ladder (to ascend up) to heaven so that you should bring them a sign and if Allah had pleased He would certainly have gathered them all on guidance, therefore be not of the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if their turning away is distressful for thee, why, if thou canst seek out a hole in the earth, or a ladder in heaven, to bring them some sign but had God willed, He would have gathered them to the guidance; so be not thou one of the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if their aversion is grievous unto thee, then, if thou canst, seek a way down into the earth or a ladder unto the sky that thou mayst bring unto them a portent (to convince them all)! - If Allah willed, He could have brought them all together to the guidance - So be not thou among the foolish ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you find their rejection hard to bear, then seek a tunnel into the ground or a ladder into the sky, if you can, and bring them a sign. Had God so willed, He would indeed have given them all [His] guidance. So do not be among the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if their backsliding is hard unto thee, then seek out, if thou canst, an opening into the earth or a ladder to the heaven that thou mayst bring unto them a sign. And had Allah willed, He would have assembled them unto the guidance; wherefore be not thou of the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And should their aversion be hard on you, find, if you can, a tunnel into the ground, or a ladder into sky, that you may bring them a sign. Had Allah wished, He would have brought them together on guidance. So do not be one of the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If their spurning is hard on thy mind, yet if thou wert able to seek a tunnel in the ground or a ladder to the skies and bring them a sign,- (what good?). If it were Allah's will, He could gather them together unto true guidance: so be not thou amongst those who are swayed by ignorance (and impatience)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If their aversion (from you, O Muhammad SAW and from that with which you have been sent) is hard on you, (and you cannot be patient from their harm to you), then if you were able to seek a tunnel in the ground or a ladder to the sky, so that you may bring them a sign (and you cannot do it, so be patient). And had Allah willed, He could have gathered them together (all) unto true guidance, so be not you one of those who are Al-Jahilun (the ignorant).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If their turning away is hard upon you, seek if you can, a tunnel in the ground or a ladder to the sky by which you can bring them a sign. Had Allah willed, He would gather them to guidance. Do not then be among the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you find their rejection hard to bear, then if you can, seek a tunnel into the earth, or a stairway into the heaven, and bring them a sign. Had God willed, He could have gathered them to guidance. So do not be of the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if their evasion is difficult for you, then if you are able to seek a tunnel into the earth or a stairway into the sky to bring them a sign, [then do so]. But if Allah had willed, He would have united them upon guidance. So never be of the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:35] And if their aversion, to Islam, is grievous, [too] great, for you, on account of your concern for them, then, if you can, seek out a hole, an underground passage, in the earth, or a ladder, a stairway, to heaven, that you may bring them a sign, from among those they have requested, then go ahead: the meaning is that you will not be able to do this, so be patient until God delivers His judgement — but had God willed, to guide them, He would have gathered them together in guidance, but He did not will this, and so they do not believe; so do not be among the ignorant, of this matter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if their aversion is grievous unto thee, then, if thou canst, seek a way down) a tunnel (into the earth) such that you enter it (or a ladder) or a method or way which enables you to rise (unto the sky that thou mayst bring unto them a portent (to convince them all)) then do so! (If Allah willed, He could have brought them all together to the guidance) to the declaration of Allah's divine Oneness. (So be not thou among the foolish ones) regarding My decree about their disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تَبْتَغِيَ نَفَقاً فِي ٱلأَرْضِ } معناهُ طريقٌ وهَو السِّربُ\n\n\n\n\nوقوله تعالى: { أَوْ سُلَّماً فِي ٱلسَّمَآءِ } معناهُ مَصعدٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِن كَانَ كَبُرَ } وشق { عَلَيْكَ إِعْرَاضُهُمْ } عن الإيمان والانقياد لك { فَإِن ٱسْتَطَعْتَ } من غاية حرصك لإيمانهم وانقيادهم { أَن تَبْتَغِيَ } وتطلب { نَفَقاً } منفذاً { فِي ٱلأَرْضِ أَوْ سُلَّماً } مرقاة { فِي ٱلسَّمَآءِ } فافعل { فَتَأْتِيَهُمْ بِآيَةٍ } دالة على إلجائهم إلى الإيمان، وإلا فاصبر حتى يأتي الله بأمر من عنده وما لك إلا التبليغ { وَلَوْ شَآءَ ٱللَّهُ لَجَمَعَهُمْ عَلَى ٱلْهُدَىٰ فَلاَ تَكُونَنَّ مِنَ ٱلْجَٰهِلِينَ } [الأنعام: 35] بأن الأمور كلها بيد الله واختياره، يهدي من يشاء ويضل من يشاء، فلا تحصر على إيمانهم وهدايتهم، ولا تجهد فيما لا يسع فيه جهدك وسعيك؛ لأنك لا تهدي من أحببت، هذا تأديب من الله لرسوله وأمثال هذا في القرآن كثيرة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وجواب { فإن استطعت }: محذوف، أي: فافعل\n يقول الحقّ جلّ جلاله: { قد نعلم إنه ليحزنك الذي يقولون } أي: الكفار في جانبك من أنك شاعر أو كاهن أو مجنون أو كاذب،\n { فإنهم لا يُكذبونك } في الحقيقة، لجزمهم بصحة نبوتك، ولكنهم يجحدون بآيات الله، حسدًا وخوفًا على زوال الشرف من يدهم: نزلت في أبي جهل، قال لرسول الله صلى الله عليه وسلم:\n\n \" إِنَّا لاَ نُكَذِّبُكَ، ولكِن نُكذِّبُ بِمَا جئتَ بِهِ \" \n\nوقال الأخنَسُ بن شُرَيق: والله إن محمدًا لصادق، ولكني أحسده على الشرف\n ووضع { الظالمين } موضع المضمر للدلالة على أنهم ظلموا لجحودهم، أو جحدوا لتمرنهم على الظلم\n ثم سلاَّه عن ذلك، فقال: { ولقد كذبت رسل من قبلك فصبروا على ما كذبوا وأُوذوا } أي: صبروا على تكذيبهم وأذاهم، { حتى أتاهم نصرنا } ، فاصبر كما صبروا حتى يأتيك نصرنا كما أتاهم، وفيه إيماء بوعد النصر للصابرين، ولذلك قيل: الصبر عنوان الظفر\n { ولا مبدل لكلمات الله } السابقة بنصر الصابرين، كقوله تعالى:\n\n[الصافات: 171ـ172]، { ولقد جاءك من نبأ المرسلين } أي: من قصصهم، وما كابدوا من قومهم حتى نصرهم الله فتأنس بهم وانتظر نصرنا\n { وإن كان كَبُر } أي: عظم وشق { عليك إعراضهم } عنك وعن الإيمان بما جئت به، { فإن استطعت أن تبتغي نفقًا } أي: سرباً { في الأرض } فتدخل فيه لتطلع لهم آية، { أو سُلَّما في السماء } لترتقي فيه { فتأتيهم بآية } حتى يعاينوها فافعل، ولكن الأمر بيدي، فإنما أنت نذير\n قال البيضاوي: المقصود: بيان حرصه البالغ على إسلام قومه، وأنه لو قدر أن يأتيهم بآية من تحت الأرض أو من فوق السماء لأتى بها رجاء إسلامهم، { ولو شاء الله لجمعهم على الهدى } أي: لو شاء الله جمعهم على الهدى لوفقهم للإيمان حتى يُؤمنوا، ولكن لم تتعلق به مشيئته، وفيه حجة على القدرية\n أو: لو شاء الله لأظهر لهم أية تلجئهم إلى الإيمان، لكن لم يفعل لخروجه عن الحكمة، { فلا تكونن من الجاهلين } أي: من الذين يحرصون على ما لم تجر به المقادير، أي: دم على عدم كونك منهم ولا تقارب حالهم بشدة التحسر\n\n\nهـ\n وقال في نوادر الأصول: إن الخطاب به تربية له، وترقيةُ من حال إلى حال، كما يُربَّى أهل التقريب ويُنقلُون من ترك الاختيار، فيما ظاهرُه بِرٌ وقربة\n هـ\n قلت: تشديد الخطاب على قدر علو المقام، كما هو معلوم من الأب الشفيق أو الشيخ الناصح، وقد قال لنوح عليه السلام:\n\n[هُود:46]\n وهذا الخطاب أشد لعلو مقامه صلى الله عليه وسلم\n الإشارة: كل ما سُلِّيت به الرسل تسَّلى به الأولياء لأنهم ورثتهم الخاصة، وكل ما أُمرت به الرسل تؤمر به الأولياء، من الصبر وعدم الحرص، فليس من شأن الدعاة إلى الله الحرص على الناس، ولا الحزن على من أدبر عنهم أو أنكر، بل هم يزرعون حكمة التذكير في أرض القلوب، وينظرون ما ينبت الله فيها، اقتداءً بما أُمر به الرسول ـ عليه الصلاة والسلام ـ، وما تخلق به، فمن أصول الطريقة: الإعراض عن الخلق في الإقبال والإدبار، والرجوع إلى الله في السراء والضراء\n والله تعالى أعلم\n ثم ذكر علَّة إعراضهم، وهون موت أرواحهم، فقال: { إِنَّمَا يَسْتَجِيبُ ٱلَّذِينَ يَسْمَعُونَ }\n\n",
      "translations": []
    }
  ]
}