{
  "chapter": "الأنعام",
  "text": "وما من دابة فى الارض ولا طئر يطير بجناحيه الا امم امثالكم ما فرطنا فى الكتب من شىء ثم الى ربهم يحشرون",
  "translations": [
    {
      "translation": "There is no creature crawling on the earth or flying creature, flying on its wings, who are not communities just like yourselves - We have not omitted anything from the Book - then they will be gathered to their Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not a thing that moves on the earth, no bird that flies on its wings, but has a community of its own like yours. There is nothing that We have left out from recording. Then they will all be gathered before their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no animal that crawls on the earth, no bird that flies with its two wings, but are communities like you. We have neglected nothing in the Book (of decree). Then to their Lord will they all be mustered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All the beasts on land and flying birds have different communities, just as you (people) do. Nothing is left without a mention in the Book. They will all be brought into the presence of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is not an animal moving in the earth nor a bird flying on its wings, but they are a nation like you; We have left out nothing in this Book – then towards their Lord they will be raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not a moving creature on earth, nor a bird that flies with its two wings, but are Umam like you. We have neglected nothing in the Book, then unto their Lord they (all) shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is no animal that walks upon the earth nor a bird that flies with its two wings but (they are) genera like yourselves; We have not neglected anything in the Book, then to their Lord shall they be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No creature is there crawling on the earth, no bird flying with its wings, but they are nations like unto yourselves. We have neglected nothing in the Book; then to their Lord they shall be mustered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not an animal in the earth, nor a flying creature flying on two wings, but they are peoples like unto you. We have neglected nothing in the Book (of Our decrees). Then unto their Lord they will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "there is not an animal that moves about on the earth, nor a bird that flies on its two wings, but are creatures like you. We have left out nothing in the Book -- they shall all be gathered before their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is not an animal on the earth nor a fowl that flieth with its two wings but are communities like unto you. And We have not been remiss in respect of aught in the Book: then unto their Lord they shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no animal on land, nor a bird that flies with its wings, but they are communities like yourselves. We have not omitted anything from the Book. Then they will be mustered toward their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not an animal (that lives) on the earth, nor a being that flies on its wings, but (forms part of) communities like you. Nothing have we omitted from the Book, and they (all) shall be gathered to their Lord in the end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not a moving (living) creature on earth, nor a bird that flies with its two wings, but are communities like you. We have neglected nothing in the Book, then unto their Lord they (all) shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no crawling creature on the earth, nor a bird that flies with its two wings, but they are nations like you. We have neglected nothing in the Book. They shall all be gathered before their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no animal on land, nor a bird flying with its wings, but are communities like you. We neglected nothing in the Scripture. Then to their Lord they will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is no creature on [or within] the earth or bird that flies with its wings except [that they are] communities like you. We have not neglected in the Register a thing. Then unto their Lord they will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:38] There is no (mā min: min is extra) animal, that crawls, on the earth and no bird that flies, through the air, with its wings, but they are communities like to you, in the way that its creation has been ordained, together with its sustenance and affairs. We have neglected nothing (min shay’: min is extra) in the Book, in the Preserved Tablet (al-lawh al-mahfūz), [nothing] that We have not written; then to their Lord they shall be gathered, and judgement shall be passed upon them, and the hornless sheep shall retaliate against the horned ram, and then it will be said to them [the animals], ‘Be dust’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nمعنى هذه الآية غامض بدءاً . ونهايتها أشدّ غموضاً ، وموقعها في هذا السياق خفي المناسبة . فاعلَم أنّ معنى قوله : { وما من دابّة في الأرض إلى قوله إلاّ أمم أمثالكم } أنّ لها خصائص لكلّ جنس ونوع منها كما لأمم البشر خصائصها ، أي جعل الله لكلّ نوع ما به قوامه وألهمه اتِّباع نظامه وأنّ لها حياة مؤجّلة لا محالة .فمعنى { أمثالكم } المماثلة في الحياة الحيوانية وفي اختصاصها بنظامها .وأمّا معنى قوله : { ثم إلى ربّهم يحشرون } أنّها صائرة إلى الموت . ويعضّده ما روي عن ابن عباس : حشر البهائم موتها ، أي فالحشر مستعمل في مجاز قريب إلى حقيقته اللغوية التي في نحو قوله تعالى : { وحشر لسليمان جنوده } \\[ النمل : 17 \\]. فموقع هذه الآية عند بعض المفسّرين أنّها بمنزلة الدليل على مضمون قوله تعالى : { قل إنّ الله قادر على أن ينزّل آية ولكن أكثرهم لا يعلمون } \\[ الأنعام : 37 \\] ، فيجوز أن تكون معطوفة على جملة { إنّ الله قادر على أن ينزّل آية } \\[ الأنعام : 37 \\] على أنّها من جملة ما أمر النبي بأن يقوله لهم؛ ويجوز أن تكون معطوفة على جملة : { قُل إنّ الله قادر } \\[ الأنعام : 37 \\] على أنّها من خطاب الله لهم . أي أنّ الذي خلق أنواع الأحياء كلِّها وجعلها كالأمم ذات خصائص جامعة لأفراد كلّ نوع منها فكان خلقها آية على عظيم قدرته لا يعجزه أن يأتي بآية حسب مقترحكم ولكنّكم لا تعلمون الحكمة في عدم إجابتكم لما سألتم . ويكون تعقيبه بقوله تعالى : { والّذين كذّبوا بآياتنا صمّ وبُكْم } \\[ الأنعام : 39 \\] الآية واضح المناسبة ، أي لا يهتدون إلى ما في عوالم الدواب والطير من الدلائل على وحدانية الله .وأمّا قوله : { ثمّ إلى ربّهم يحشرون } فإن نظرنا إليه مستقلاً بنصّه غير ملتفتين إلى ما نيط به من آثار مروية في تفسيره؛ فأول ما يبدو للناظر أنّ ضميري { ربّهم } و { يحشرون } عائدان إلى { دابّة } و { طائر } باعتبار دلالتهما على جماعات الدّواب والطير لوقوعهما في حيّز حرف ( مِنْ ) المفيدة للعموم في سياق النفي ، فيتساءل الناظر عن ذلك وهما ضميران موضوعان للعقلاء . وقد تأولوا لوقوع الضميرين على غير العقلاء بوجهين : أحدهما أنّه بناءٌ على التغليب إذ جاء بعده { إلاّ أمم أمثالكم }.الوجه الثاني أنّهما عائدان إلى { أمم أمثالكم } ، أي أنّ الأمم كلّها محشورة إلى الله تعالى .وأحسن من ذلك تأويلاً أن يكون الضميران عائديْن إلى ما عادت إليه ضمائر الغيبة في هذه الآيات التي آخرها ضمير { وقالوا لولا نزّل عليه آية من ربّه } ، فيكون موقع جملة { ثم إلى ربّهم يحشرون } موقع الإدماج والاستطراد مجابهة للمشركين بأنَّهم محشورون إلى الله لا محالة وإن أنكروا ذلك .فإذا وقع الإلتفات إلى ما روي من الآثار المتعلّقة بالآية كان الأمر مُشكلاً .فقد روى مسلم عن أبي هريرة أنّ رسول الله صلى الله عليه وسلم قال : \" لتُؤَدّنّ الحقوق إلى أهلها يوم القيامة حتّى يقاد للشّاة الجلحاء ( التي لا قرن لها ، وفي رواية غيره : الجَماء ) من الشاة القرناء \" وروى أحمد بن حنبل وأبو داوود الطيالسي في «مسنديهما» عن أبي ذرّ قال : انتطحت شاتان أو عنزان عند رسول الله صلى الله عليه وسلم فقال : يا أبا ذر أتدري فيم انتطحتا ، قلت : لا ، قال : لكن الله يدري وسيقضي بينهما يوم القيامة . فهذا مقتض إثبات حشر الدوابّ ليوم الحساب ، فكان معناه خفي الحكمة إذ من المحقّق انتفاء تكليف الدوابّ والطير تبعاً لانتفاء العقل عنها . وكان موقعها جلي المناسبة بما قاله الفخر نقلاً عن عبد الجبّار بأنّه لمّا قدّم الله أنّ الكفّار يُرجعون إليه ويحشرون بيّن بعده أنّ الدوابّ والطير أمم أمثالهم في أنّهم يحشرون . والمقصود بيان أنّ الحشر والبعث كما هو حاصل في الناس حاصل في البهائم . وهذا ظاهر قوله : { يحشرون } لأنّ غالب إطلاق الحشر في القرآن على الحشر للحساب ، فيناسب أن تكون جملة : { وما من دابّة في الأرض } الآية عطفاً على جملة : { والموتى يبعثهم الله } ، فإنّ المشركين ينكرون البعث ويجعلون إخبار الرسول عليه الصلاة والسلام به من أسباب تهمته فيما جاء به ، فلمّا توعّدهم الله بالآية السابقة بأنّهم إليه يرجعون زاد أن سجّل عليهم جهلهم فأخبرهم بما هو أعجب ممّا أنكروه ، وهو إعلامهم بأنّ الحشر ليس يختصّ بالبشر بل يعمّ كلّ ما فيه حياة من الدّوابّ والطير . فالمقصود من هذا الخبر هو قوله : { ثم إلى ربّهم يحشرون }.وأمّا ما قبله فهو بمنزلة المقدمة له والاستدلال عليه ، أي فالدّوابّ والطير تبعث مثل البشر وتحضر أفرادها كلّها يوم الحشر ، وذلك يقتضي لا محالة أن يقتصّ لها ، فقد تكون حكمة حشرها تابعة لإلقاء الأرض وما فيها وإعادة أجزاء الحيوان .وإذا كان المراد من هذين الحديثين ظاهرهما فإنّ هذا مظهر من مظاهر الحق يوم القيامة لإصلاح ما فرط في عالم الفناء من رواج الباطل وحكم القوة على العدالة ، ويكون القصاص بتمكين المظلوم من الدوابّ من ردّ فعل ظالمه كيلا يستقرّ بالباطل . فهو من قبيل ترتّب المسبّبات على أسبابها شبيه بخطاب الوضع ، وليس في ذلك ثواب ولا عقاب لانتفاء التكليف ثم تصير الدواب يومئذٍ تراباً ، كما ورد في رواية عن أبي هريرة في قوله تعالى : { ويقول الكافر يا ليتني كنت تراباً } \\[ النبأ : 40 \\]. قال المازري في المُعَلِم : واضطرب العلماء في بعث البهائم . وأقوى ما تعلّق به من يقول ببعثها قوله تعالى : { وإذا الوحوش حشرت }.وقد قيل : إنّ هذا كلّه تمثيل للعدل . ونسبه المازري إلى بعض شيوخه قال : هو ضرب مَثل إعلاماً للخلق بأن لا يبقى حقّ عند أحد .والدابّة مشتقّة من دبّ إذا مشى على الأرض ، وهي اسم لكلّ ما يدبّ على الأرض . وقوله : { في الأرض } صفة قصد منها إفادة التعميم والشمول بذكر اسم المكان الذي يحوي جميع الدوابّ وهو الأرض ، وكذلك وصف { طائر } بقوله { يطير بجناحيه } قصد به الشمول والإحاطة ، لأنّه وصف آيل إلى معنى التوكيد ، لأنّ مفاد { يطير بجناحيه } أنَّه طائر ، كأنَّه قيل : ولا طائر ولا طائر . والتوكيد هنا يؤكّد معنى الشمول الذي دلّت عليه ( من ) الزائدة في سياق النفي؛ فحصل من هذين الوصفين تقرير معنى الشمول الحاصل من نفي اسمي الجنسين . ونكتة التوكيد أنّ الخبر لغرابته عندهم وكونه مظنّة إنكارهم أنَّه حقيق بأن يؤكّد .ووقع في «المفتاح» في بحث إتباع المسند إليه بالبيان أنّ هذين الوصفين في هذه الآية للدلالة على أنّ القصد من اللفظين الجنس لا بعض الأفراد وهو غير ما في «الكشاف» ، وكيف يتوهَّم أنّ المقصود بعض الأفراد ووجود ( مِن ) في النفي نصّ على نفي الجنس دون الوحدة .وبهذا تعلم أن ليس وصف { يطير بجناحيه } وارداً لرفع احتمال المجاز في { طائر } كما جنح إليه كثير من المفسِّرين وإن كان رفع احتمال المجاز من جملة نكت التوكيد اللفظي إلاّ أنّه غير مطّرد ، ولأنّ اعتبار تأكيد العموم أولى ، بخلاف نحو قولهم :نظرته بعيني وسمعته بأذني . وقول صخْر: ... شر واتّخذت من شَعَر صدارهاإذ من المعلوم أنّ الصّدار لا يكون إلاّ من شَعَر .و { أمم } جمع أمّة . والأمّة أصلها الجماعة من الناس المتماثلة في صفات ذاتية من نسب أو لغة أو عادة أو جنس أو نوع . قيل : سمّيت أمة لأنّ أفرادها تؤمّ أمَماً واحداً وهو ما يجمع مقوّماتها .وأحسب أنّ لفظ أمَّة خاصّ بالجماعة العظيمة من البشر ، فلا يقال في اللغة أمّة الملائكة ولا أمّة السباع . فأمّا إطلاق الأمم على الدّوابّ والطير في هذه الآية فهو مجاز ، أي مثل الأمم لأنّ كلّ نوع منها تجتمع أفراده في صفات متّحدة بينها أمماً واحدة ، وهو ما يجمعها وأحسب أنّها خاصّة بالبشر .و { دابّة } و { طائر } في سياق النفي يُراد بهما جميع أفراد النوعين كما هو شأن الاستغراق ، فالإخبار عنهما بلفظ { أمم } وهو جمع على تأويله بجماعاتها ، أي إلاّ جماعاتها أمم ، أو إلاّ أفراد أمم .وتشمل الأرض البحر لأنَّه من الأرض ولأنّ مخلوقاته يطلق عليها لفظ الدابَّة ، كما ورد في حديث سرية سِيف البحر قول جابر بن عبد الله : فألقى لنا البحر دابّة يقال لها العنبر .والمماثلة في قوله : { أمثالكم } التشابه في فصول الحقائق والخاصّات التي تميّز كلّ نوع من غيره ، وهي النظم الفطرية التي فطر الله عليها أنواع المخلوقات . فالدّواب والطير تُماثل الأناسي في أنّها خلقت على طبيعة تشترك فيها أفراد أنواعها وأنّها مخلوقة لله معطاة حياة مقدّرة مع تقدير أرزاقها وولادتها وشبابها وهرمها ، ولها نظم لا تستطيع تبديلها .وليست المماثلة براجعة إلى جميع الصفات فإنّها لا تماثل الإنسان في التفكير والحضارة المكتسبة من الفكر الذي اختصّ به الإنسان . ولذلك لا يصحّ أن يكون لغير الإنسان نظام دولة ولا شرائع ولا رسل ترسل إليهن لانعدام عقل التكليف فيهنّ ، وكذلك لا يصحّ أن توصف بمعرفة الله تعالى . وأما قوله تعالى : { وإنْ من شيء إلاّ يُسبّح بحمده } \\[ الإسراء : 44 \\] فذلك بلسان الحال في العجماوات حين نراها بَهِجَة عند حصول ما يلائمها فنراها مرحة فرحة . وإنّما ذلك بما ساق الله إليها من النعمة وهي لا تفقه أصلها ولكنّها تحسّ بأثرها فتبتهج ، ولأنّ في كل نوع منها خصائص لها دلالة على عظيم قدرة الله وعلمه تختلف عن بقية الأنواع من جنسه والمقصد من هذا صرف الأفهام إلى الاعتبار بنظام الخلق الذي أودعه الله في كلّ نوع ، والخطاب في قوله : { أمثالكم } موجّه إلى المشركين .وجملة : { ما فرطنا في الكتاب من شيء } معترضة لبيان سعة علم الله تعالى وعظيم قدرته . فالكتاب هنا بمعنى المكتوب ، وهو المكنّى عنه بالقلم المراد به ما سبق في علم الله وإرادته الجارية على ، وفْقِه كما تقدّم في قوله تعالى : { كتب على نفسه الرحمة } \\[ الأنعام : 12 \\].وقيل الكتاب القرآن . وهذا بعيد إذ لا مناسبة بالغرض على هذا التفسير ، فقد أورد كيف يشتمل القرآن على كلّ شيء . وقد بسط فخر الدين بيان ذلك لاختيار هذا القول وكذلك أبو إسحاق الشاطبي في «الموافقات» .والتفريط : الترك والإهمال ، وتقدّم بيانه آنفاً عند قوله تعالى : { قالوا يا حسرتنا على ما فرّطنا فيها } \\[ الأنعام : 31 \\].والشيء هو الموجود . والمراد به هنا أحوال المخلوقات كما يدلّ عليه السياق فشمل أحوال الدّواب والطير فإنّها معلومة لله تعالى مقدّرة عنده بما أودع فيها من حكمة خلقه تعالى .وقوله { ثم إلى ربِّهم يحشرون } تقدّم تفسيره آنفاً في أوّل تفسير هذه الآية . وفي الآية تنبيه للمسلمين على الرفق بالحيوان فإنّ الإخبار بأنّها أمم أمثالنا تنبيه على المشاركة في المخلوقية وصفات الحيوانية كلّها . وفي قوله : { ثم إلى ربِّهم يحشرون } إلقاء للحذر من الاعتداء عليها بما نهى الشرع عنه من تعذيبها وإذا كان يقتصّ لبعضها من بعض وهي غير مكلّفة ، فالاقتصاص من الإنسان لها أولى بالعدل . وقد ثبت في الحديث الصحيح : أنّ الله شكر للذي سقى الكلب العطشان ، وأنّ الله أدخل امرأة النار في هرّة حبستها فماتت جوعاً .\n\n",
      "translations": [
        {
          "translation": "(There is not an animal in the earth, nor a flying creature flying on two wings) between the earth and sky, (but they are peoples) creations and servants (like unto you) they resemble you in eating, copulation, understanding one another, just as you understand one another: this is a sign for you. (We have neglected nothing in the Book) We have neglected nothing that We have inscribed in the Preserved Tablet; We have mentioned everything in the Qur'an. (Then unto their Lord they) the birds and beasts (will be gathered) with all other created beings on the Day of Judgement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلاَّ أُمَمٌ أَمْثَالُكُمْ } معناه أَصْنَافٌ مُصَنفَةٌ تُعرفُ بأَسمَائِهَا\n\n\n\n\nوقوله تعالى: { مَّا فَرَّطْنَا فِي ٱلكِتَٰبِ مِن شَيْءٍ } معناه مَا ضَيَّعنَا\n\n\n\n\nوقوله تعالى: { إِلاَّ أُمَمٌ أَمْثَالُكُمْ } معناهُ أجْنَاسٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Nations like you\" means nations that are classified and known by their names.\n And His saying - the Most High - {We have not neglected anything in the Book} means that We have not neglected anything.\n The saying of the Most High: {Except for peoples like you} means races.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n يمكن حمله على المسخ أي: أمم أمثالكم في الاحتجاب والاعتداء وارتكاب الرذائل كأصحاب السبت الذين مسخوا قردة وخنازير { ما فرّطنا } ما قصرنا في كتابهم الذي فيه صور أعمالهم وهو صحيفة النفس الفلكية أو صحيفة نيتهم التى ثبتت فيها صور أعمالهم { ثم إلى ربهم يُحْشَرون } للجزاء\n محجوبين في عين الجمع المطلق\n والظاهر أن المراد أنهم أمم أمثالكم مربوبون بما احتاجوا إليه من معايشهم\n مكفيون مؤنتهم بتقدير من الله وحكمه\n ما قصرنا في كتاب اللوح المحفوظ من شيء يصلحهم بل أثبتنا فيه أرزاقهم وآجالهم وأعمالهم وكل ما احتاجوا إليه\n { ثم إلى ربّهم يحشرون } لجزاء أعمالهم كما هو مروي في الحديث من حشر الوحوش\n وقصاص الأعمال بينهم\n وكل واحدة منها آية لكم تعرف بها أحوالكم وأرزاقكم وآجالكم وأعمالكم\n فاعتبروا بها ولا تصرفوا هممكم ومساعيكم في طلب الرزق وإصلاح الحياة الدنيا فتخسروا أنفسكم وتضرّوها وتشقوا بها في آخرتكم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا يقدر سبحانه على جميع المرادات المقدروات مع أنه { مَا مِن دَآبَّةٍ } تتحرك { فِي ٱلأَرْضِ وَلاَ طَائِرٍ يَطِيرُ } في الجو { بِجَنَاحَيْهِ إِلاَّ أُمَمٌ أَمْثَالُكُمْ } محفوظة أحوالها وأرزاقها وآجالها عندنا\n بحيث لا نهمل شيئاً من حوائجهما\n بل نكتب ونثبت في لوحنا المحفوظ وكتابنا المبين على الفضيل بحيث { مَّا فَرَّطْنَا } وأفرطنا { فِي ٱلكِتَٰبِ مِن شَيْءٍ } من حوائجهم وأحوالهم { ثُمَّ } بعدما حفظوا ورزقوا كل منهم { إِلَىٰ رَبِّهِمْ يُحْشَرُونَ } [الأنعام: 38] يرجعون رجوع الظل إلى ذي الظل\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إلا أمم أمثالكم } مقدرة أرزاقها\n محدودة آجالها\n معدودة أجناسها وأصنافها\n محفوظة ذواتها\n معلومة أماكنها\n كلها في قبضة الحق\n وتحت قدرته ومشيئته\n فدل ذلك على كمال قدرته وشمول علمه وسعة تدبيره\n فيدل على قدرته على أن ينزل آية\n وعلى بعثهم وحشرهم لأنه عالم بما تنقص الأرض منهم\n كما قال تعالى: { ما فرطنا في الكتاب } أي: اللوح المحفوظ\n { من شيء } فإنه مشتمل على ما يجري في العالم من جليل ودقيق\n لم يهمل فيه أمرَ حيوان ولا جماد\n ظاهرًا ولا باطنًا\n أو القرآن فإنه قد اشتمل على كل ما يحتاج إليه من أمر الدين مفصلاً ومجملاً\n حتى قال بعض السلف:  لو ضَاع لي عِقالٌ لوجدتُه في كِتَابِ الله أي: باعتبار العموم وأصول المسائل\n قال تعالى: { ثم إلى ربهم يُحشرون } أي: الأمم كلها\n فيُنصف بعضها من بعض\n كما رُوِي أنه يُؤخذ للجَمَّاء من القَرنَاء وعن أبي هريرة رضي الله عنه أنه قال في هذه الآية: يُحشر الخلقُ كلهم يوم القيامة: البهائم والدواب والطير وكل شيء\n فيبلغُ من عَدل الله تعالى أن يأخذ للجماء من القرناء\n ثم يقول: كُوني ترابًا\n فذلك حيث يقول الكافر:\n[النّبَأ:40]\n وفي المسألة اضطراب بين العلماء\n والصحيح هو حشرها\n كما قال تعالى:\n[التّكوير:5]\n وعن ابن عباس رضي الله عنه:  حشرها موتها\n والله تعالى أعلم\n الإشارة: قد تقدم مرارًا أن طلب الكرامات من الأولياء: لقلة الاعتقاد فيهم وقلة الصدق\n وأكمل الكرامات: الاستقامة على التوحيد في الباطن\n وتحقيق العبودية في الظاهر\n وبالله التوفيق\n ثم قبَّح شأن أهل التكذيب\n فقال: { وَٱلَّذِينَ كَذَّبُواْ بِآيَاتِنَا صُمٌّ وَبُكْمٌ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:45",
      "similarity": 0.5249139654612744
    },
    {
      "verse": "39:56",
      "similarity": 0.4275103375531407
    },
    {
      "verse": "16:62",
      "similarity": 0.41139809097672775
    },
    {
      "verse": "6:61",
      "similarity": 0.3933855189973002
    },
    {
      "verse": "18:28",
      "similarity": 0.3307710767433886
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006038.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006038.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:38.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}