{
  "chapter": "الأنعام",
  "text": "وما من دابة فى الارض ولا طئر يطير بجناحيه الا امم امثالكم ما فرطنا فى الكتب من شىء ثم الى ربهم يحشرون",
  "translations": [
    {
      "translation": "There is no creature crawling on the earth or flying creature, flying on its wings, who are not communities just like yourselves - We have not omitted anything from the Book - then they will be gathered to their Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not a thing that moves on the earth, no bird that flies on its wings, but has a community of its own like yours. There is nothing that We have left out from recording. Then they will all be gathered before their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no animal that crawls on the earth, no bird that flies with its two wings, but are communities like you. We have neglected nothing in the Book (of decree). Then to their Lord will they all be mustered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All the beasts on land and flying birds have different communities, just as you (people) do. Nothing is left without a mention in the Book. They will all be brought into the presence of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is not an animal moving in the earth nor a bird flying on its wings, but they are a nation like you; We have left out nothing in this Book – then towards their Lord they will be raised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not a moving creature on earth, nor a bird that flies with its two wings, but are Umam like you. We have neglected nothing in the Book, then unto their Lord they (all) shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is no animal that walks upon the earth nor a bird that flies with its two wings but (they are) genera like yourselves; We have not neglected anything in the Book, then to their Lord shall they be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No creature is there crawling on the earth, no bird flying with its wings, but they are nations like unto yourselves. We have neglected nothing in the Book; then to their Lord they shall be mustered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not an animal in the earth, nor a flying creature flying on two wings, but they are peoples like unto you. We have neglected nothing in the Book (of Our decrees). Then unto their Lord they will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "there is not an animal that moves about on the earth, nor a bird that flies on its two wings, but are creatures like you. We have left out nothing in the Book -- they shall all be gathered before their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is not an animal on the earth nor a fowl that flieth with its two wings but are communities like unto you. And We have not been remiss in respect of aught in the Book: then unto their Lord they shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no animal on land, nor a bird that flies with its wings, but they are communities like yourselves. We have not omitted anything from the Book. Then they will be mustered toward their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not an animal (that lives) on the earth, nor a being that flies on its wings, but (forms part of) communities like you. Nothing have we omitted from the Book, and they (all) shall be gathered to their Lord in the end.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is not a moving (living) creature on earth, nor a bird that flies with its two wings, but are communities like you. We have neglected nothing in the Book, then unto their Lord they (all) shall be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no crawling creature on the earth, nor a bird that flies with its two wings, but they are nations like you. We have neglected nothing in the Book. They shall all be gathered before their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no animal on land, nor a bird flying with its wings, but are communities like you. We neglected nothing in the Scripture. Then to their Lord they will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there is no creature on [or within] the earth or bird that flies with its wings except [that they are] communities like you. We have not neglected in the Register a thing. Then unto their Lord they will be gathered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:38] There is no (mā min: min is extra) animal, that crawls, on the earth and no bird that flies, through the air, with its wings, but they are communities like to you, in the way that its creation has been ordained, together with its sustenance and affairs. We have neglected nothing (min shay’: min is extra) in the Book, in the Preserved Tablet (al-lawh al-mahfūz), [nothing] that We have not written; then to their Lord they shall be gathered, and judgement shall be passed upon them, and the hornless sheep shall retaliate against the horned ram, and then it will be said to them [the animals], ‘Be dust’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(There is not an animal in the earth, nor a flying creature flying on two wings) between the earth and sky, (but they are peoples) creations and servants (like unto you) they resemble you in eating, copulation, understanding one another, just as you understand one another: this is a sign for you. (We have neglected nothing in the Book) We have neglected nothing that We have inscribed in the Preserved Tablet; We have mentioned everything in the Qur'an. (Then unto their Lord they) the birds and beasts (will be gathered) with all other created beings on the Day of Judgement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِلاَّ أُمَمٌ أَمْثَالُكُمْ } معناه أَصْنَافٌ مُصَنفَةٌ تُعرفُ بأَسمَائِهَا\n\n\n\n\nوقوله تعالى: { مَّا فَرَّطْنَا فِي ٱلكِتَٰبِ مِن شَيْءٍ } معناه مَا ضَيَّعنَا\n\n\n\n\nوقوله تعالى: { إِلاَّ أُمَمٌ أَمْثَالُكُمْ } معناهُ أجْنَاسٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Nations like you\" means nations that are classified and known by their names.\n And His saying - the Most High - {We have not neglected anything in the Book} means that We have not neglected anything.\n The saying of the Most High: {Except for peoples like you} means races.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n يمكن حمله على المسخ أي: أمم أمثالكم في الاحتجاب والاعتداء وارتكاب الرذائل كأصحاب السبت الذين مسخوا قردة وخنازير { ما فرّطنا } ما قصرنا في كتابهم الذي فيه صور أعمالهم وهو صحيفة النفس الفلكية أو صحيفة نيتهم التى ثبتت فيها صور أعمالهم { ثم إلى ربهم يُحْشَرون } للجزاء\n محجوبين في عين الجمع المطلق\n والظاهر أن المراد أنهم أمم أمثالكم مربوبون بما احتاجوا إليه من معايشهم\n مكفيون مؤنتهم بتقدير من الله وحكمه\n ما قصرنا في كتاب اللوح المحفوظ من شيء يصلحهم بل أثبتنا فيه أرزاقهم وآجالهم وأعمالهم وكل ما احتاجوا إليه\n { ثم إلى ربّهم يحشرون } لجزاء أعمالهم كما هو مروي في الحديث من حشر الوحوش\n وقصاص الأعمال بينهم\n وكل واحدة منها آية لكم تعرف بها أحوالكم وأرزاقكم وآجالكم وأعمالكم\n فاعتبروا بها ولا تصرفوا هممكم ومساعيكم في طلب الرزق وإصلاح الحياة الدنيا فتخسروا أنفسكم وتضرّوها وتشقوا بها في آخرتكم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف لا يقدر سبحانه على جميع المرادات المقدروات مع أنه { مَا مِن دَآبَّةٍ } تتحرك { فِي ٱلأَرْضِ وَلاَ طَائِرٍ يَطِيرُ } في الجو { بِجَنَاحَيْهِ إِلاَّ أُمَمٌ أَمْثَالُكُمْ } محفوظة أحوالها وأرزاقها وآجالها عندنا\n بحيث لا نهمل شيئاً من حوائجهما\n بل نكتب ونثبت في لوحنا المحفوظ وكتابنا المبين على الفضيل بحيث { مَّا فَرَّطْنَا } وأفرطنا { فِي ٱلكِتَٰبِ مِن شَيْءٍ } من حوائجهم وأحوالهم { ثُمَّ } بعدما حفظوا ورزقوا كل منهم { إِلَىٰ رَبِّهِمْ يُحْشَرُونَ } [الأنعام: 38] يرجعون رجوع الظل إلى ذي الظل\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إلا أمم أمثالكم } مقدرة أرزاقها\n محدودة آجالها\n معدودة أجناسها وأصنافها\n محفوظة ذواتها\n معلومة أماكنها\n كلها في قبضة الحق\n وتحت قدرته ومشيئته\n فدل ذلك على كمال قدرته وشمول علمه وسعة تدبيره\n فيدل على قدرته على أن ينزل آية\n وعلى بعثهم وحشرهم لأنه عالم بما تنقص الأرض منهم\n كما قال تعالى: { ما فرطنا في الكتاب } أي: اللوح المحفوظ\n { من شيء } فإنه مشتمل على ما يجري في العالم من جليل ودقيق\n لم يهمل فيه أمرَ حيوان ولا جماد\n ظاهرًا ولا باطنًا\n أو القرآن فإنه قد اشتمل على كل ما يحتاج إليه من أمر الدين مفصلاً ومجملاً\n حتى قال بعض السلف:  لو ضَاع لي عِقالٌ لوجدتُه في كِتَابِ الله أي: باعتبار العموم وأصول المسائل\n قال تعالى: { ثم إلى ربهم يُحشرون } أي: الأمم كلها\n فيُنصف بعضها من بعض\n كما رُوِي أنه يُؤخذ للجَمَّاء من القَرنَاء وعن أبي هريرة رضي الله عنه أنه قال في هذه الآية: يُحشر الخلقُ كلهم يوم القيامة: البهائم والدواب والطير وكل شيء\n فيبلغُ من عَدل الله تعالى أن يأخذ للجماء من القرناء\n ثم يقول: كُوني ترابًا\n فذلك حيث يقول الكافر:\n[النّبَأ:40]\n وفي المسألة اضطراب بين العلماء\n والصحيح هو حشرها\n كما قال تعالى:\n[التّكوير:5]\n وعن ابن عباس رضي الله عنه:  حشرها موتها\n والله تعالى أعلم\n الإشارة: قد تقدم مرارًا أن طلب الكرامات من الأولياء: لقلة الاعتقاد فيهم وقلة الصدق\n وأكمل الكرامات: الاستقامة على التوحيد في الباطن\n وتحقيق العبودية في الظاهر\n وبالله التوفيق\n ثم قبَّح شأن أهل التكذيب\n فقال: { وَٱلَّذِينَ كَذَّبُواْ بِآيَاتِنَا صُمٌّ وَبُكْمٌ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:45",
      "similarity": 0.5249139654612744
    },
    {
      "verse": "39:56",
      "similarity": 0.4275103375531407
    },
    {
      "verse": "16:62",
      "similarity": 0.41139809097672775
    },
    {
      "verse": "6:61",
      "similarity": 0.3933855189973002
    },
    {
      "verse": "18:28",
      "similarity": 0.3307710767433886
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/6:38.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/6:38.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:38.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}