{
  "chapter": "الأنعام",
  "text": "والذين كذبوا۟ بـايتنا صم وبكم فى الظلمت من يشا الله يضلله ومن يشا يجعله على صرط مستقيم",
  "translations": [
    {
      "translation": "Those who deny Our Signs are deaf and dumb in utter darkness. Allah misguides whoever He wills, and puts whoever He wills on a straight path.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny Our revelations are deaf, dumb, and lost in the dark. God sends whosoever He wills astray, and leads whom He will to the straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who gave the lie to Our signs are deaf and dumb and blunder about in darkness. Allah causes whomsoever He wills to stray in error, and sets whomsoever He wills on the straight way.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who disbelieve Our revelations are, in fact, deaf and dumb. They wander in darkness. God leads astray or guides to the right path whomever He wants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who deny Our signs are deaf and dumb in realms of darkness; Allah may send astray whomever He wills; and may place on the Straight Path whomever He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Our Ayat are deaf and dumb in darkness. Allah sends astray whom He wills and He guides on the straight path whom He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they who reject Our communications are deaf and dumb, in utter darkness; whom Allah pleases He causes to err and whom He pleases He puts on the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who cry lies to Our signs are deaf and dumb, dwelling in the shadows. Whomsoever God will, He leads astray, and whomsoever He will, He sets him on a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny Our revelations are deaf and dumb in darkness. Whom Allah will sendeth astray, and whom He will He placeth on a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Our signs are deaf and dumb, [groping along] in darkness. God lets anyone He wishes go astray and sets whoever He will on a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who belie our signs are deaf and dumb, in darkness. Whomsoever Allah willeth He sendeth astray, and whomsoever He willeth He putteth on the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny Our signs are deaf and dumb, in a manifold darkness. Allah leads astray whomever He wishes, and whomever He wishes He puts him on a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject our signs are deaf and dumb,- in the midst of darkness profound: whom Allah willeth, He leaveth to wander: whom He willeth, He placeth on the way that is straight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) are deaf and dumb in darkness. Allah sends astray whom He wills and He guides on the Straight Path whom He wills.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who belie Our verses are deaf and dumb, in darkness. Allah leaves in error whom He will, and guides to the Straight Path whom He pleases.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Our revelations are deaf and dumb, in total darkness. Whomever God wills, He leaves astray; and whomever He wills, He sets on a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who deny Our verses are deaf and dumb within darknesses. Whomever Allah wills - He leaves astray; and whomever He wills - He puts him on a straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:39] And those who deny Our signs, the Qur’ān, are deaf, to hearing them in such a way so as to accept [them], and dumb, [unable] to utter truth, in darkness, in unbelief. He whom God wills, to send astray, He sends astray, and whom He wills, to guide, He sets him on a straight path, [a straight] road, the religion of Islam.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيجوز أن تكون الواو للعطف ، والمعطوف عليه جملة : { إنّما يستجيب الذين يسمعون }.والمعنى : والذين كذّبوا بآياتنا ولم يستمعوا لها ، أي لا يستجيبون بمنزلة صمّ وبكم في ظلمات لا يهتدون .ويجوز أن تكون الجملة مستأنفة والواو استئنافية ، أي عاطفة كلاماً مبتدأ ليس مرتبطاً بجملة معيّنة من الكلام السابق ولكنّه ناشيء عن جميع الكلام المتقدّم . فإنّ الله لمّا ذكر من مخلوقاته وآثار قدرته ما شأنه أن يعرّف الناس بوحدانيته ويدلّهم على آياته وصدق رسوله أعقبه ببيان أنّ المكذّبين في ضلال مبين عن الاهتداء لذلك ، وعن التأمّل والتفكير فيه ، وعلى الوجهين فمناسبة وقوع هذه الجملة عقب جملة : { وما من دابة في الأرض } \\[ الأنعام : 38 \\] الآية قد تعرّضنا إليها آنفاً .والمراد بالذين كذّبوا المشركون الذين مضى الكلام على أحوالهم عموماً وخصوصاً .وقوله : { صمّ وبكم في الظلمات } تمثيل لحالهم في ضلال عقائدهم والابتعاد عن الاهتداء بحال قوم صمّ وبُكم في ظلام . فالصّمم يمنعهم من تلقِّي هدى من يهديهم ، والبكَم يمنعهم من الاسترشاد ممّن يمرّ بهم ، والظلام يمنعهم من التبصّر في الطريق أو المنفذ المخرج لهم من مأزقهم .وإنَّما قيل في { الظلمات } ولم يوصفوا بأنَّهم عُمّي كما في قوله : { عُميا وبُكما وصمّا } \\[ الإسراء : 97 \\] ليكون لبعض أجزاء الهيئة المشبَّهة بها ما يصلح لشبه بعض أجزاء الهيئة المشبَّهة ، فإنّ الكفر الذي هم فيه والذي أصارهم إلى استمرار الضلال يشبه الظلمات في الحيلولة بين الداخل فيه وبين الاهتداء إلى طريق النجاة . وفي الحديث : « الظلم ظلمات يوم القيامة » فهذا التمثيل جاء على أتمّ شروط التمثيل . وهو قبوله لتفكيك أجزاء الهيئتين إلى تشبيهات مفردة ، كقول بشّار: ... كأنّ مُثَار النّقع فوقَ رؤوسناوأسيافنا ليل تَهادَى كواكبُه ... وجمع الظلمات جار على الفصيح من عدم استعمال الظلمة مفرداً . وقد تقدّم في صدر السورة ، وقيل : للإشارة إلى ظلمة الكفر ، وظلمة الجهل ، وظلمة العناد .وقوله : { صمّ وبكم } خبر ومعطوف عليه . وقوله : { في الظلمات } خبر ثالث لأنّه يجوز في الأخبار المتعددة ما يجوز في النعوت المتعدّدة من العطف وتركه .وقوله : { من يشأ الله يضلله } استئناف بياني لأنّ حالهم العجيبة تثير سؤالاً وهو أن يقول قائل ما بالهم لا يهتدون مع وضوح هذه الدلائل البيّنات ، فأجيب بأنّ الله أضلّهم فلا يهتدون ، وأنّ الله يضلّ من يشاء ويهدي من يشاء ، فدلّ قوله : { من يشأ الله يضلله } على أنّ هؤلاء المكذّبين الضالّين هم ممَّن شاء الله إضلالهم على طريقة الإيجاز بالحذف لظهور المحذوف ، وهذا مرتبط بما تقدّم من قوله تعالى : { ولو شاء الله لجمعهم على الهدى } \\[ الأنعام : 35 \\].ومعنى إضلال الله تقديره الضلال؛ بأن يخلق الضّالّ بعقل قابل للضلال مُصرّ على ضلاله عنيد عليه فإذا أخذ في مبادىء الضلال كما يعرض لكثير من الناس فوعظه واعظ أو خطر له في نفسه خاطر أنَّه على ضلال منعه إصراره من الإقلاع عنه فلا يزال يهوي به في مهاوي الضلالة حتَّى يبلغ به إلى غاية التخلّق بالضلال فلا ينكفّ عنه .وهذا ممّا أشار إليه قوله تعالى : { لقد خلقنا الإنسان في أحسن تقويم ثم رددناه أسفل سافلين } \\[ التين : 4 ، 5 \\] ، ودلّ عليه قول النبي صلى الله عليه وسلم « إنّ الرجل ليَصْدُق حتَّى يكون صدّيقاً وإنّ الرجل ليكذب حتَّى يُكتب عند الله كذّاباً » وكلّ هذا من تصرّف الله تعالى بالتكوين والخلق وهو تصرّف القدر . وله اتِّصال بناموس التسلسل في تطوّر أحوال البشر في تصرّفات بعقولهم وعوائدهم ، وهي سلسلة بعيدة المدى اقتضتها حكمة الله تعالى في تدبير نظام هذا العالم ، ولا يعلم كنهها إلاّ الله تعالى ، وليس هذا الإضلال بالأمر بالضلال فإنّ الله لا يأمر بالفحشاء ولا بتلقينه والحثّ عليه وتسهيله فإنّ ذلك من فعل الشيطان ، كما أنّ الله قد حرم من أراد إضلاله من انتشاله واللطف به لأنّ ذلك فضل مَن هو أعلم بأهله . ومفعول { يشأ } محذوف لدلالة جواب الشرط عليه ، كما هو الشائع في مفعول فعل المشيئة الواقع شرطاً .والصراط هو الطريق البيّن . ومعنى المستقيم أنّه لا اعوجاج فيه ، لأنّ السّير في الطريق المستقيم أيسر على السائر وأقرب وصولاً إلى المقصود .ومعنى ( على ) الاستعلاء ، وهو استعلاء السائر على الطريق . فالكلام تمثيل لحال الذي خلقه الله فمَنّ عليه بعقل يرعوي من غيّه ويُصغي إلى النصيحة فلا يقع في الفساد فاتّبع الدين الحقّ ، بحال السائر في طريق واضحة لا يتحيَّر ولا يخطىء القصد ، ومستقيمة لا تطوح به في طول السير . وهذا التمثيل أيضاً صالح لتشبيه كلّ جزء من أجزاء الهيئة المشبّهة بجزء من أجزاء الهيئة المشبّه بها ، كما تقدّم في نظيره . وقد تقدّم شيء من هذا عند قوله تعالى : { اهدنا الصراط المستقيم } \\[ الفاتحة : 6 \\]. فالدين يشبه الصراط الموصّل بغير عناء ، والهدي إليه شبيه الجعل على الصراط .\n\n",
      "translations": [
        {
          "translation": "(Those who deny our revelations) i.e. deny Muhammad and the Qur'an (are deaf) of heart; it is also said that this means: they pretend not to hear the Truth (and dumb) they pretend to be dumb in relation to the 136 Truth and guidance (in darkness) i.e. they adhere to disbelief. (Whom Allah will He sendeth astray) He makes him die in a state of disbelief, (and whom He will) He makes him die such that (He placeth on a straight path) places on the straight path which He is pleased with; it is also said that this means: Allah forsakes whom He will and guides, gives success and firmness in adhering to the straight path (Islam), which He is pleased with, to whom He will.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ والذين كذّبوا } بتجليات صفاتنا لاحتجابهم بغواشي صفات نفوسهم { صمّ } بآذان القلوب فلا يسمعون كلام الحق { وبُكْم } بألسنتها التي هي العقول فلا ينطقون بالحق في ظلمات صفات نفوسهم وجلابيب أبدانهم وغشاوات طبائعهم كالدواب\n فكيف يصدّقونك وما هداهم الله لذلك بالتوفيق { من يشأ الله يضلله } بإسبال حجب جلاله { ومن يشأ يجعله على صراط مستقيم } بإشراق نور وجهه وسبحات جماله { قل أرأيتكم } إلى آخره\n أي: كل مشرك عند وقوعه في العذاب أو عند حضور الموت إن فسرنا الساعة بالقيامة الصغرى أو رفع الحجاب بالهداية الحقانية إلى التوحيد الحقيقي\n إن فسرناها بالقيامة الكبرى يتبرّأ عن حول من أشركه بالله وقوته ويتحقق أن لا حول ولا قوة إلا بالله ولا يدعو إلا الله\n وينسى كل من تمسك به وأشركه بالله من الوسائل\n ولهذا قيل: البلاء سوط من سياط الله\n يسوق عباده\n أما ترى كيف عقب كلامه بمقارنة الأخذ بالبأساء والضرّاء بإرسال الرسل\n لعل تضاعف أسباب اللطف\n كقود الأنبياء وسوق العذاب\n يزعجهم عن مقارّ نفوسهم ويكسر سورتها وشدّة شكيمتها\n فيطيعوا ويبرزوا من الحجاب وينقادوا متضرّعين عند تجلي صفة القهر وتأثيرها فيهم\n ثم بيّن أنهم ما تضرّعوا لقساوة قلوبهم بكثافة الحجاب وغلبة غشّ الهوى وحب الدنيا وميل اللذات الجسمانية",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ كَذَّبُواْ بِآيَاتِنَا } الدالة على قدرتنا الكاملة { صُمٌّ } عن استماع كلمة الحق من ألسنة الرسل { وَبُكْمٌ } عن التنطق بها مع أنهم تيقنوا بها بل هم مغمورون { فِي ٱلظُّلُمَاتِ } أي: الحجب الناشئة من هوياتهم الباطلة وهياكلهم الفاسدة العاطلة { مَن يَشَإِ ٱللَّهُ } إضلاله بمقتضى اسمه المذل المضل { يُضْلِلْهُ } حتماً بلا هداية وإرشاد أصلاً { وَمَن يَشَأْ } هدايته { يَجْعَلْهُ عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ } [الأنعام: 39] موصل إلى توحيده\n إذ كل من عنده ميسر موفق لما خلق له",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { والذين كذبوا بآياتنا } الدالة على كمال قدرتنا وتحقيق وحدانيتنا، أو بآياتنا المنزلة على رسولنا، هم { صمٌّ } لا يسمعون مثل هذه الآيات ـ الدالة على ربوبيته وكمال علمه وعظيم قدرته ـ سماعًا تتأثر به نفوسهم، { و } هم أيضًا { بُكم } لا ينطقون بالحق، وهم { في الظلمات } أي: خائضون في بحر ظلمات الكفر والجهل، وظلمة العناد، وظلمة التقليد، فوصفهم بالصمم والبَكَم والعَمى، ويؤخذ العمى من قوله: { في الظلمات } ، وهذا كله داخل تحت مشيئته وعلمه السابق { من يشأ الله يُضلله } عدلاً، { ومن يشأ يجعله على صراط مستقيم } بأن يرشده إلى الهدى ويحمله عليه، فيتبع الطريق الذي لا عوج فيه. الإشارة: أولياء الله في أرضه آية من آيات الله، فمن كذب بهم بقي في ظلمة الجهل بالله وظلمة حجاب النفس وحجاب الأكوان، محجوبًا بمحيطاته، محصورًا في هيكل ذاته، قلبه أصم عن تَذَكُّرِ الحقائق، ولسانه أبكم عن النطق بحكم العلم والأسرار، لم تسبق له في مشيئة الحق عناية، ولا هَبَّ عليه شيءٌ من رياح الهداية، عائذًا بالله من سوء القضاء ودرك الشقاء. ثم أقام لهم البرهان على توحيده، فقال: { قُلْ أَرَأَيْتُكُم إِنْ أَتَاكُمْ عَذَابُ ٱللَّهِ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:18",
      "similarity": 0.8367186250185662
    },
    {
      "verse": "8:22",
      "similarity": 0.7463087143044144
    },
    {
      "verse": "16:76",
      "similarity": 0.5615507369962319
    },
    {
      "verse": "43:40",
      "similarity": 0.37648870826770425
    },
    {
      "verse": "10:42",
      "similarity": 0.3646028055407042
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006039.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006039.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:39.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}