{
  "chapter": "الأنعام",
  "text": "وما تاتيهم من ءاية من ءايت ربهم الا كانوا۟ عنها معرضين",
  "translations": [
    {
      "translation": "Not one of their Lord's Signs comes to them without their turning away from it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet no sign of their Lord comes to them but they turn away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet every time a sign of their Lord comes to them, they turn away from it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The unbelievers) have always turned away from the revelations and the evidence (of the Truth) that has been sent to them from time to time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never does a sign come to them from among the signs of Allah, except that they* turn away from it. (* The disbelievers)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never an Ayah comes to them from the Ayat of their Lord, but that they have been turning away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there does not come to them any communication of the communications of their Lord but they turn aside from it\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not a sign of their Lord comes to them, but they turn away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Never came there unto them a revelation of the revelations of Allah but they did turn away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "yet every time a sign comes to them from their Lord, they turn away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And not a sign cometh unto them of the signs of their Lord but that therefore they have been backsliders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There did not come to them any sign from among the signs of their Lord, but that they used to disregard it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But never did a single one of the signs of their Lord reach them, but they turned away therefrom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And never an Ayah (sign) comes to them from the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of their Lord, but that they have been turning away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet every time a sign comes to them from the signs of their Lord, they turn away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Not one of their Lord’s signs comes to them, but they turn away from it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And no sign comes to them from the signs of their Lord except that they turn away therefrom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:4] Not a verse (min āya: min introduces a relative clause) of the verses of their Lord, in the Qur’ān, comes to them, that is, [to] the Meccans, but they turn away from it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Never came there unto them) i.e. unto the people of Mecca (a revelation of the revelations of Allah) such as the eclipse of the sun or the splitting of the moon or stars (but they did turn away from) except that they disbelieved in (it) i.e. the sign.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من أمارات كفرهم وسترهم أنهم { مَا تَأْتِيهِم مِّنْ آيَةٍ } عظيمة دالة على توحيد الحق بلسان رسول من الرسل العظام { مِّنْ آيَٰتِ رَبِّهِمْ } المتوحد بالربوبية { إِلاَّ كَانُواْ } من غاية كفرهم وجهلهم { عَنْهَا مُعْرِضِينَ } [الأنعام:4]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}