{
  "chapter": "الأنعام",
  "text": "قل ارءيتكم ان اتىكم عذاب الله او اتتكم الساعة اغير الله تدعون ان كنتم صدقين",
  "translations": [
    {
      "translation": "Say: 'What do you think? If Allah's punishment were to come upon you or the Hour, would you call on other than Allah if you are being truthful?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Have you thought if the punishment of God or the Hour (of Doom) came upon you, would you call to any other than God? Answer, if you are men of truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What do you think if some chastisement of Allah or the Hour suddenly overtakes you: do you cry to any other than Allah? Answer, if you speak the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say to them, \"Should God afflict you with torment, or should the Day of Judgment arrive, if what you claim is true, could you then seek help from any one other than God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “What is your opinion – if the punishment of Allah comes upon you or the Hour arrives, will you call upon anyone (deity) besides Allah; if you are truthful?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Tell me if Allah's torment comes upon you, or the Hour comes upon you, would you then call upon any one other than Allah (Reply) if you are truthful!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Tell me if the chastisement of Allah should overtake you or the hour should come upon you, will you call (on others) besides Allah, if you are truthful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What think you? If God's chastisement comes upon you, or the Hour comes upon you, will you call upon any other than God if you speak truly?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Can ye see yourselves, if the punishment of Allah come upon you or the Hour come upon you, (calling upon other than Allah)? Do ye then call (for help) to any other than Allah? (Answer that) if ye are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Tell me if the punishment of God came upon you or the Hour overtook you, would you call upon any other than God, if you are truthful?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: look ye now, were Allah's torment to come upon you, or the Hour come upon you, would ye then cry unto other than Allah, if ye are truthful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Tell me, should Allah’s punishment overtake you, or should the Hour overtake you, will you supplicate anyone other than Allah, should you be truthful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Think ye to yourselves, if there come upon you the wrath of Allah, or the Hour (that ye dread), would ye then call upon other than Allah?- (reply) if ye are truthful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Tell me if Allah's Torment comes upon you, or the Hour comes upon you, would you then call upon any one other than Allah? (Reply) if you are truthful!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Do you see yourselves when the punishment of Allah smites you or the Hour overtakes you, will you call on any except Allah, if you are truthful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Have you considered? if God's punishment came upon you, or the Hour overtook you, would you call upon any other than God, if you are sincere?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Have you considered: if there came to you the punishment of Allah or there came to you the Hour - is it other than Allah you would invoke, if you should be truthful?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:40] Say, O Muhammad (s), to the Meccans: ‘Do you see yourselves, [that is] inform me, if God’s chastisement comes upon you, in this world, or the Hour, the Resurrection, which includes this [chastisement], comes upon you, suddenly, will ye call upon any other than God? No! If you speak truly!’, that the idols can benefit you, then call upon them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say: Can ye see yourselves) what you are saying, people of Mecca, (if the punishment of Allah come upon you) such was the case on the Day of Badr, Uhud or the Confederates (or the Hour come upon you) or if torment comes upon you on the Day of Judgement, (calling upon other than Allah? Do ye then call (for help) to any other than Allah) to lift the torment from you? ((Answer that) if ye are truthful) that the idols are His partners.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم يا أكمل الرسل إمحاضاً للنصح: { أَرَءَيْتَكُمْ } أي: أخبروني صريحاً { إِنْ أَتَـٰكُمْ عَذَابُ ٱللَّهِ } في يوم الجزاء { أَوْ أَتَتْكُمُ ٱلسَّاعَةُ } التي تحشرون فيها إلى الله تعالى هائمين حائرين { أَغَيْرَ ٱللَّهِ } المنقذ من العذاب\n والمنجي من الحيرة والهيما { تَدْعُونَ } أم تدعونه تضرعاً وتلجئون نحوه استعاذة؟ بينوا إليَّ أمركم في حالة اضطراركم { إِن كُنتُمْ صَـٰدِقِينَ } [الأنعام: 40] في الأقوال والأخبار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:14",
      "similarity": 0.4340952702720536
    },
    {
      "verse": "34:30",
      "similarity": 0.3838321518166559
    },
    {
      "verse": "40:59",
      "similarity": 0.3788475310753162
    },
    {
      "verse": "45:27",
      "similarity": 0.3176182885920916
    },
    {
      "verse": "33:63",
      "similarity": 0.3164946394261595
    }
  ]
}