{
  "chapter": "الأنعام",
  "text": "قل ارءيتكم ان اتىكم عذاب الله او اتتكم الساعة اغير الله تدعون ان كنتم صدقين",
  "translations": [
    {
      "translation": "Say: 'What do you think? If Allah's punishment were to come upon you or the Hour, would you call on other than Allah if you are being truthful?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Have you thought if the punishment of God or the Hour (of Doom) came upon you, would you call to any other than God? Answer, if you are men of truth.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What do you think if some chastisement of Allah or the Hour suddenly overtakes you: do you cry to any other than Allah? Answer, if you speak the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say to them, \"Should God afflict you with torment, or should the Day of Judgment arrive, if what you claim is true, could you then seek help from any one other than God?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “What is your opinion – if the punishment of Allah comes upon you or the Hour arrives, will you call upon anyone (deity) besides Allah; if you are truthful?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Tell me if Allah's torment comes upon you, or the Hour comes upon you, would you then call upon any one other than Allah (Reply) if you are truthful!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Tell me if the chastisement of Allah should overtake you or the hour should come upon you, will you call (on others) besides Allah, if you are truthful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What think you? If God's chastisement comes upon you, or the Hour comes upon you, will you call upon any other than God if you speak truly?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Can ye see yourselves, if the punishment of Allah come upon you or the Hour come upon you, (calling upon other than Allah)? Do ye then call (for help) to any other than Allah? (Answer that) if ye are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Tell me if the punishment of God came upon you or the Hour overtook you, would you call upon any other than God, if you are truthful?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: look ye now, were Allah's torment to come upon you, or the Hour come upon you, would ye then cry unto other than Allah, if ye are truthful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Tell me, should Allah’s punishment overtake you, or should the Hour overtake you, will you supplicate anyone other than Allah, should you be truthful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Think ye to yourselves, if there come upon you the wrath of Allah, or the Hour (that ye dread), would ye then call upon other than Allah?- (reply) if ye are truthful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Tell me if Allah's Torment comes upon you, or the Hour comes upon you, would you then call upon any one other than Allah? (Reply) if you are truthful!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Do you see yourselves when the punishment of Allah smites you or the Hour overtakes you, will you call on any except Allah, if you are truthful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Have you considered? if God's punishment came upon you, or the Hour overtook you, would you call upon any other than God, if you are sincere?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Have you considered: if there came to you the punishment of Allah or there came to you the Hour - is it other than Allah you would invoke, if you should be truthful?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:40] Say, O Muhammad (s), to the Meccans: ‘Do you see yourselves, [that is] inform me, if God’s chastisement comes upon you, in this world, or the Hour, the Resurrection, which includes this [chastisement], comes upon you, suddenly, will ye call upon any other than God? No! If you speak truly!’, that the idols can benefit you, then call upon them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي يتضمّن تهديداً بالوعيد طرداً للأغراض السابقة ، وتخلّله تعريض بالحثّ على خلع الشرك إذ ليس لشركائهم نفع بأيديهم ، فذُكِّروا بأحوال قد تعرض لهم يلجأون فيها إلى الله . وألقي عليهم سأل أيستمرون على الإشراك بالله في تلك الحالة وهل يستمرّون من الآن على الشرك إلى أن يأتيهم العذاب أو تأتيهم القيامة حين يلجأون إلى الإيمان بوحدانيته ، ولات حينَ إيمان .وافتتح هذا التهديد بالأمر بالقول اهتماماً به وإلاّ فإنّ معظم ما في القرآن مأمور الرسول صلى الله عليه وسلم بأن يقوله لهم . وقد تتابع الأمر بالقول في الآيات بعد هذه إلى قوله : { لكلّ نبأ مستقرّ } \\[ الأنعام : 67 \\] اثنتي عشرة مرّة . وورد نظيره في سورة يونس .وقوله : { أرأيتكم } تركيب شهير الاستعمال ، يفتتح بمثله الكلام الذي يراد تحقيقه والاهتمام به . وهمزة الاستفهام فيه للاستفهام التقريري .و ( رأى ) فيه بمعنى الظنّ . يسند إلى تاء خطاب تلازم حالة واحدة ملازمة حركة واحدة ، وهي الفتحة لا تختلف باختلاف عدد المخاطب وصنفه سواء كان مفرداً أو غيره ، مذكّراً أو غيره ، ويجعل المفعول الأول في هذا التركيب غالباً ضمير خطاب عائداً إلى فاعل الرؤية القلبية ومستغنى به لبيان المراد بتاء الخطاب . والمعنى أنّ المخاطب يعلم نفسه على الحالة المذكورة بعد ضمير الخطاب ، فالمخاطب فاعل ومفعول باختلاف الاعتبار ، فإنّ من خصائص أفعال باب الظنّ أنّه يجوز أن يكون فاعلها ومفعولها واحداً ( وألحق بأفعال العلم فعلان : فقَد ، وعَدِم في الدعاء نحو فقدتُني ) ، وتقع بعد الضمير المنصوب جملة في موضع مفعوله الثاني ، وقد يجيء في تلك الجملة ما يعلق فعل الرؤية عن العمل .هذا هو الوجه في تحليل هذا التركيب . وبعض النحاة يجعل تلك الجملة سادّة مسدّ المفعولين تفصّياً من جعل ضمائر الخطاب مفاعيل إذ يجعلونها مجرّد علامات خطاب لا محلّ لها من الإعراب ، وذلك حفاظاً على متعارف قواعد النحو في الاستعمال الأصلي المتعارف مع أنّ لغرائب الاستعمال أحوالاً خاصّة لا ينبغي غضّ النظر عنها إلاّ إذا قصد بيان أصل الكلام أو عدم التشويش على المتعلّمين . ولا يخفى أنّ ما ذهبوا إليه هو أشدّ غرابة وهو الجمع بين علامتي خطاب مختلفتين في الصورة ومرجعهما متَّحد . وعلى الوجه الذي اخترناه فالمفعول الثاني في هذا التركيب هو جملة : { أغير الله تدعون }.وإنّما تركت التاء على حالة واحدة لأنّه لمَّا جعلتْ ذاتُ الفاعل ذات المفعول إعراباً وراموا أن يجعلوا هذا التركيب جارياً مجرى المثل في كونه قليل الألفاظ وافر المعنى تجنّبوا ما يحدثه الجمع بين ضميري خطاب مرفوع ومنصوب من الثقل في نحو أرأيتما كُما ، وأرأيتُمْكُم وأريْتُنُّكُنّ ، ونحو ذلك ، سلكوا هذه الطريقة الغريبة فاستغنوا بالاختلاف حالة الضمير الثاني عن اختلاف حالة الضمير الأول اختصاراً وتخفيفاً ، وبذلك تأتَّى أن يكون هذا التركيب جارياً مجرى المثل لما فيه من الإيجاز تسهيلاً لشيوع استعماله استعمالاً خاصّاً لا يغيّر عنه ، فلذلك لا تكسر تلك التاء في خطاب المؤنّث ولا تضمّ في خطاب المثنّى والمجموع .وعن الأخفش : أخرجت العرب هذا اللفظ من معناه بالكلية فألزمته الخطاب ، وأخرجته عن موضوعه إلى معنى ( أمّا ) بفتح الهمزة ، فجعلت الفاء بعده في بعض استعمالاته كقوله تعالى : { أرأيتَ إذْ أويْنَا إلى الصخرة فإنّي نسيت الحوت } \\[ الكهف : 63 \\] فما دخلت الفاء إلاّ وقد أخرجت ( أرأيت ) لمعنى ( أمّا ) ؛ وأخرجته أيضاً إلى معنى ( أخبرني ) فلا بد بعده من اسم المستخبر عنه؛ وتلزم الجملة بعد الاستفهام ، وقد يخرج لهذا المعنى وبعده الشرط وظرففِ الزمان . اه .في «الكشاف» : متعلِّق الاستخبار محذوف ، تقديره : إن أتاكم عذاب الله أو أتتكم الساعة من تدعون ، ثم بكتهم بقوله { أغير الله تدعون } ، أي أتخصّون آلهتكم بالدعوة أم تدعون الله دونها بل إيَّاه تدعون اه . وجملة : { أغير الله تدعون } هي المفعول الثاني لفعل { أرأيتكم }.واعلم أنّ هذا استعمال خاصّ بهذا التركيب الخاصّ الجاري مجرى المثل ، فأمّا إذا أريد جريان فعل الرؤية العلمية على أصل بابه فإنَّه يجري على المتعارف في تعدية الفعل إلى فاعله ومفعوليه . فمن قال لك : رأيتُني عالماً بفلان . فأردت التحقّق فيه تقول : أرأيتَك عالماً بفلان . وتقول للمثنّى : أرأيتماكما عالمين بفلان ، وللجمع أرأيتُموكُم وللمؤنثة أرأيتِك بكسر التاء .وقرأه نافع في المشهور بتسهيل الهمزة ألفاً ؛ وعنه رواية بجعلها بين الهمزة والألف . وقرأه الكسائي بإسقاط الهمزة التي هي عين الكلمة ، فيقول : { أرَيْت } وهي لغة . وقرأه الباقون بتحقيق الهمزة .وجملة : { إن أتاكم عذاب الله } الخ معترضة بني مفعولي فعل الرؤية ، وهي جملة شرطية حذف جوابها لدلالة جملة المفعول الثاني عليه .وإتيان العذاب : حلوله وحصوله ، فهو مجاز لأن حقيقة الإتيان المجيء ، وهو الانتقال من موضع بعيد إلى الموضع الذي استقر فيه مفعول الإتيان ، فيطلق مجازاً على حصول شيء لم يكن حاصلاً . وكذلك القول في إتيان الساعة سواء .ووجه إعادة فعل { أتتكم الساعة } مع كون حرف العطف مغنياً عن إعادة العامل بأن يقال : إن أتاكم عذاب الله أو الساعة ، هو ما يوجَّه به الإظهار في مقام الإضمار من إرادة الاهتمام بالمُظْهَر بحيث يعاد لفظه الصريح لأنّه أقوى استقراراً في ذهن السامع .والاهتمام هنا دعا إليه التهويل وإدخال الروع في ضمير السامع بأن يصرّح بإسناد هذا الإتيان لاسم المسند إليه الدّالّ على أمر مهول ليدلّ تعلّق هذا الفعل بالمفعول على تهويله وإراعته .وقد استشعر الاحتياجَ إلى توجيه إعادة الفعل هنا الشيخ محمد بن عَرفة في درس تفسيره ، ولكنَّه وجّهه بأنَّه إذا كان العاملان متفاوتين في المعنى لكون أحدهما أشدّ يعاد العامل بعد حرف العطف إشعاراً بالتفاوت ، فإنّ إتيان العذاب أشدّ من إتيان الساعة ( أي بناء على أنّ المراد بعذاب الله عذاب الآخرة ) أو كان العاملان متباعدين ، فإن أريد بالساعة القيامة وبعذاب الله المحْقُ والرزايا في الدنيا فيعقبه بعد مهلة تامَّة .وإن أريد بالساعة المدّة فالمحق الدنيوي كثير ، منه متقدّم ومنه متأخِّر إلى الموت ، فالتقدّم ظاهر اه . وفي توجيهه نظر إذ لا يشهد له الاستعمال .وإضافة العذاب إلى اسم الجلالة لتهويله لصدوره من أقدر القادرين . والمراد عذاب يحصل في الدنيا يضرعون إلى الله لرفعه عنهم بدليل قوله { أغير الله تدعون } ، فإنّ الدعاء لا يكون بطلب رفع عذاب الجزاء . وهذا تهديد وإنذار .والساعة : علَم بالغلبة على ساعة انقراض الدنيا ، أي إن أدركتْكم الساعة .وتقديم { أغير الله } على عامله وهو { تدعون } لتكون الجملة المستفهم عنها جملة قصر ، أي أتعرضون عن دعاء الله فتدعون غيره دونه كما هو دأبكم الآن ، فالقصر لحكاية حالهم لا لقصد الردّ على الغير . وقد دلّ الكلام على التعجّب ، أي تستمرّون على هذه الحال . والكلام زيادة في الإنذار .وجمل : ة { إن كنتم صادقين } مستأنفة ، وجوابها محذوف دلّ عليه قوله : { أرأيتكم } الذي هو بمعنى التقرير . فتقدير الجواب : إن كنتم صادقين فأنتم مقرّون بأنَّكم لا تدعون غير الله . ذَكّرهم في هذه الآية وألجأهم إلى النظر ليعلموا أنّه إذا أراد الله عذابهم لا تستطيع آلهتهم دفعه عنهم ، فهم إن توخّوا الصدق في الخبر عن هذا المستقبل أعادوا التأمّل فلا يسعهم إلاّ الاعتراف بأنّ الله إذا شاء شيئاً لا يدفعه غيرُه إلاّ بمشيئته ، لأنّهم يعترفون بأنّ الأصنام إنَّما تقرّبهم إلى الله زلفى ، فإذا صدقوا وقالوا : أندعوا الله ، فقد قامت الحجّة عليهم من الآن لأنّ من لا يغني في بعض الشدائد لا ينبغي الاعتماد عليه في بعض آخر .ولذلك كان موقع { بَل إيّاه تدعون } عقب هذا الاستفهام موقع النتيجة للاستدلال .\n\n",
      "translations": [
        {
          "translation": "(Say: Can ye see yourselves) what you are saying, people of Mecca, (if the punishment of Allah come upon you) such was the case on the Day of Badr, Uhud or the Confederates (or the Hour come upon you) or if torment comes upon you on the Day of Judgement, (calling upon other than Allah? Do ye then call (for help) to any other than Allah) to lift the torment from you? ((Answer that) if ye are truthful) that the idols are His partners.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم يا أكمل الرسل إمحاضاً للنصح: { أَرَءَيْتَكُمْ } أي: أخبروني صريحاً { إِنْ أَتَـٰكُمْ عَذَابُ ٱللَّهِ } في يوم الجزاء { أَوْ أَتَتْكُمُ ٱلسَّاعَةُ } التي تحشرون فيها إلى الله تعالى هائمين حائرين { أَغَيْرَ ٱللَّهِ } المنقذ من العذاب\n والمنجي من الحيرة والهيما { تَدْعُونَ } أم تدعونه تضرعاً وتلجئون نحوه استعاذة؟ بينوا إليَّ أمركم في حالة اضطراركم { إِن كُنتُمْ صَـٰدِقِينَ } [الأنعام: 40] في الأقوال والأخبار\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقال في المشارق: أرأيتك: معناه: الاستخبار والاستفهام\n أي: أخبرني عن كذا\n وهو بفتح التاء في المذكر والمؤنث والواحد والجمع\n تقول: أرأيتك وأرأيتكما وأرأيتكم\n ولم تُثَن ما قبل علامة المخاطب ولم تَجمعَهُ\n فإذا أردت معنى الرؤية ـ أي البصرية ـ ثَنيت وجمعت وأنثت\n فقلت: أرأيتك قائمًا\n وأرأيتُكِ قائمة\n وأرأيتكما وأرأيتموكم وأرأيتيكن\n هـ\n وقال في الإتقان: إذا دخلت الهمزة على \" رأيت \" امتنع أن يكون من رؤية العين والقلب\n وصار المعنى: أخبرني\n وهو خلاف ما قال في المشارق\n فانظره وانظر الحاشية الفاسية\n قال البيضاوي: { أرأيتكم }: استفهام تعجب\n والكاف: حرف خطاب\n أكد به الضمير للتأكيد\n لكن لا محل له من الإعراب\n لأنك تقول: أرأيتك زيدًا ما شأنه\n فلو جعلت الكاف مفعولاً ـ كما قاله الكوفيون ـ لعدَّيت الفعل إلى ثلاثة مفاعيل\n ولزم في الآية أن يقول: أرأيتكموكم\n بل الفعل معلق\n أو المفعول محذوف\n وتقديره: أرأيتكم آلهتكم تنفعكم إذ تدعونها إن أتاكم عذاب الله\n ويدل عليه: { أغير الله تدعون }\n هـ\n وجواب { إنْ }: محذوف أي: إن أتاكم عذاب الله أو أتتكم الساعة فمن تدعون؟ وجواب { إن كنتم }: محذوف أيضًا أي: إنَّ كنتم صادقين في أنَّ غير الله ينفعكم فادعوه\n ثم وصفهم بأنهم لا يدعون حينئذٍ إلا الله\n يقول الحقّ جلّ جلاله: { قل } لهم يا محمد: { أرأيتكم } أي: أخبروني { إن أتاكم عذاب الله } في الدنيا كما أتى من قبلكم\n { أو أتتكم الساعة } وأهوالها\n { أغير الله تدعون } وتلتجئون إليه في كشف ما نزل بكم { إن كنتم صادقين } أن الأصنام آلهة\n لا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:14",
      "similarity": 0.4340952702720536
    },
    {
      "verse": "34:30",
      "similarity": 0.3838321518166559
    },
    {
      "verse": "40:59",
      "similarity": 0.3788475310753162
    },
    {
      "verse": "45:27",
      "similarity": 0.3176182885920916
    },
    {
      "verse": "33:63",
      "similarity": 0.3164946394261595
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006040.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006040.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:40.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}