{
  "chapter": "الأنعام",
  "text": "بل اياه تدعون فيكشف ما تدعون اليه ان شاء وتنسون ما تشركون",
  "translations": [
    {
      "translation": "It is Him you call on and, if He wills, He will deliver you from whatever it was that made you call on Him; and you will forget what you associated with Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No: You will call to Him alone; and He will, if He please, remove (the distress) for which you had called Him; and forget those you associate as compeers (with Him)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo, it is to Him alone that you cry and then, if He so wills, He removes the distress for which you had cried to Him. Then you forget the partners you had set up with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You will certainly ask Him for help. He will save you from hardship if He decides to do so and you will forget all about your gods.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“In fact you will only call upon Him, and if He wills, He may remove that because of which you prayed to Him, and you will forget the partners (you ascribe to Him).”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! To Him alone you call, and, if He willed, He would remove that (distress) for which you call upon Him, and you forget at that time whatever partners you joined with Him (in worship)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, Him you call upon, so He clears away that for which you pray if He pleases and you forget what you set up (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No; upon Him you will call, and He will remove that for which you call upon Him if He Will, and you will forget that you associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but unto Him ye call, and He removeth that because of which ye call unto Him, if He will, and ye forget whatever partners ye ascribed unto Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, it is on Him that you would call, and He could remove that [affliction] which made you call on Him, if He will, and then you would forget [the false deities] which you associate with Him!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! unto Him alone ye would cry, and He would remove that where for ye cried unto Him, if He will, and ye would forget that which ye associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No, Him you will supplicate, and He will remove that for which you supplicated Him, if He wishes, and you will forget what you ascribe [to Him] as [His] partners.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay,- On Him would ye call, and if it be His will, He would remove (the distress) which occasioned your call upon Him, and ye would forget (the false gods) which ye join with Him!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! To Him Alone you call, and, if He will, He would remove that (distress) for which you call upon Him, and you forget at that time whatever partners you joined with Him (in worship)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No, on Him alone you will call, and He will remove that for which you call upon Him, if He will. Then you will forget what you associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact, it is Him you will call upon; and if He wills, he will remove what you called Him for, and you will forget what you idolized.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No, it is Him [alone] you would invoke, and He would remove that for which you invoked Him if He willed, and you would forget what you associate [with Him].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:41] Nay; upon Him, and upon none other, you will call, in [times of] tribulation, and He will remove that which you call upon Him, to remove from you, such things as suffering, if He wills, to remove it, and you will forget, you will neglect, what you associate with Him, of idols and will not call them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay, but unto Him ye call) meaning that they will not call anyone except Allah to lift the torment from them, (and He removeth that because of which you call unto Him, if He will, and you forget) you leave (whatever partners ye ascribed unto Him) you leave the idols and do not call unto them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بَلْ إِيَّاهُ تَدْعُونَ } إذ لا ملجأ ولا ملاذ حينئذ إلا هو { فَيَكْشِفُ } عنكم { مَا تَدْعُونَ إِلَيْهِ } من الضرر والبلاء { إِنْ شَآءَ } أي: إن تعلقت مشيئته وإرادته { وَتَنسَوْنَ } حينئذ { مَا تُشْرِكُونَ } [الأنعام: 41] له من الأظلال الباطلة والتماثيل العاطلة، وقل لهم أيضاً: إذ سمعتم مآل أمركم وعاقبة حالكم وشأنكم، فتضرعوا إلى الله في جميع أحوالكم، والتجئوا نحوه، ومع ذلك لم يقبلوا منك قولك ونصحك البتة لخبث باطنهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}