{
  "chapter": "الأنعام",
  "text": "فلما نسوا۟ ما ذكروا۟ به فتحنا عليهم ابوب كل شىء حتى اذا فرحوا۟ بما اوتوا۟ اخذنهم بغتة فاذا هم مبلسون",
  "translations": [
    {
      "translation": "When they forgot what they had been reminded of, We opened up for them the doors to everything, until, when they were exulting in what they had been given, We suddenly seized them and at once they were in despair.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they had become oblivious of what they were warned, We opened wide the gates of everything to them; yet as they rejoiced at what they were given, We caught them unawares, and they were filled with despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they forgot what they had been reminded of, We opened the gates of all things so that while they rejoiced in what they had been granted We seized them suddenly and they were plunged into utter despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they forgot (all) the advice that they had received, We granted them all means of happiness but they were left in despair when We suddenly took Our bounties back from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they forgot the advices made to them, We opened the gates of all things for them; to the extent that when they were rejoicing for what they had received, We seized them suddenly, hence they remained dejected.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they forgot (the warning) with which they had been reminded, We opened to them the gates of every (pleasant) thing, until in the midst of their enjoyment in that which they were given, all of a sudden, We took them to punishment, and lo! They were plunged into destruction with deep regrets and sorrows.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they neglected that with which they had been admonished, We opened for them the doors of all things, until when they rejoiced in what they were given We seized them suddenly; then lo! they were in utter despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they forgot what they were reminded of; We opened unto them the gates of everything until; when they rejoiced in what they were given, We seized them suddenly, and behold, they were sore confounded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they forgot that whereof they had been reminded, We opened unto them the gates of all things till, even as they were rejoicing in that which they were given, We seized them unawares, and lo! they were dumbfounded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they had forgotten Our admonition, We granted them all that they desired; but just as they were rejoicing in what they were given, We seized them suddenly and they were plunged into despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they forgot that whereof they were reminded We opened upon them the doors of everything, until when they boasted of that which they were given, We laid hold of them on a sudden, and lo! they were dumbfounded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they forgot what they had been admonished of, We opened for them the gates of all [good] things. When they became proud of what they were given, We seized them suddenly, whereat, behold, they were despondent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they forgot the warning they had received, We opened to them the gates of all (good) things, until, in the midst of their enjoyment of Our gifts, on a sudden, We called them to account, when lo! they were plunged in despair!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they forgot (the warning) with which they had been reminded, We opened to them the gates of every (pleasant) thing, until in the midst of their enjoyment in that which they were given, all of a sudden, We took them to punishment, and lo! They were plunged into destruction with deep regrets and sorrows.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they had forgotten that with which they have been admonished, We opened the gates of everything to them, until just as they were rejoicing in what they were given, We suddenly seized them and they were in utter despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they disregarded what they were reminded of, We opened for them the gates of all things. Until, when they delighted in what they were given, We seized them suddenly; and at once, they were in despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they forgot that by which they had been reminded, We opened to them the doors of every [good] thing until, when they rejoiced in that which they were given, We seized them suddenly, and they were [then] in despair.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:44] So, when they forgot, [when] they neglected, that whereof they were reminded, that with which they were admonished and threatened, in the way of misery and hardship; and they did not heed the admonition, We opened (read fatahnā or fattahnā) to them the gates of all things, in the way of graces, in order to draw them on by degrees, until, when they rejoiced in what they were given, a wanton rejoicing, We seized them suddenly, with chastisement, and lo! they were confounded, despairing of anything good.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then, when they forgot that whereof they had been reminded) when they turned their backs on that which they had been commanded with in the Scripture, (We opened unto them the gates of all things) vegetation, land fertility and comfort (till, even as they were rejoicing in that which they were given) vegetation, land fertility and comfort, (We seized them unawares) with punishment, (and lo! they were dumbfounded) despairing of any good.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَإِذَا هُمْ مُّبْلِسُونَ } معناه نَادِمُونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd when they are in despair, they will realize that they have sinned.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا نَسُواْ مَا ذُكِّرُواْ بِهِ } من البأساء والضراء ولم يتعظوا بها { فَتَحْنَا عَلَيْهِمْ } ابتلاء وفتنة { أَبْوَابَ كُلِّ شَيْءٍ } نافع وخير وأمهلناهم عليها { حَتَّىٰ إِذَا فَرِحُواْ } أعجبوا { بِمَآ أُوتُوۤاْ } مترفهين متنعمين بطرين مغرورين بالنعم ناسين المنعم بالمرة { أَخَذْنَاهُمْ } بانواع البلاء { بَغْتَةً } فجأة { فَإِذَا هُمْ مُّبْلِسُونَ } [الأنعام: 44] متحسرون آيسون خائبون محرومون",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فلما نسوا ما ذكروا به } أي: تركوا الاتعاظ بما ذُكروا به من البأساء والضراء\n ولم ينزجروا\n { فتحنا عليهم أبواب كل شيء } من أنواع الرزق وضروب النعم\n مراوحة عليهم بين نوبَتي الضراء والسراء\n وامتحانًا لهم بالشدة والرخاء\n إلزامًا للحجة وازاحة للعلة\n أو مكرًا بهم\n لما روي أنه صلى الله عليه وسلم قال:\n \" مُكر بالقوم ورب الكعبة \" \n{ حتى إذا فرحوا } أي: أعجبوا { بما أوتوا } من النعم\n ولم يزيدوا على البطر والاشتغال بالنعم عن المنعم والقيام بحقه\n { أخذناهم بغتة } أي: فجأة { فإذا هم مبسلون } مُتحيرون آيسون من كل خير",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:77",
      "similarity": 0.7431820086919985
    },
    {
      "verse": "30:49",
      "similarity": 0.6004816569987234
    },
    {
      "verse": "30:12",
      "similarity": 0.57170559857576
    },
    {
      "verse": "43:75",
      "similarity": 0.4021900565070817
    },
    {
      "verse": "26:202",
      "similarity": 0.282436407786293
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/6:44.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/6:44.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:44.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}