{
  "chapter": "الأنعام",
  "text": "فقطع دابر القوم الذين ظلموا۟ والحمد لله رب العلمين",
  "translations": [
    {
      "translation": "So the last remnant of the people who did wrong was cut off. Praise belongs to Allah, the Lord of all the worlds!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus were the wicked people rooted out of existence to the last. All praise be to God, the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus the last remnant of those wrongdoing people was cut off. All praise is for Allah, the Lord of the entire universe, (for having punished them so).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus, the transgressing people were destroyed. It is only God, the Lord of creation who deserves all praise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The origins of the unjust people were therefore cut off; and all praise is to Allah, Lord Of The Creation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the roots of the people who did wrong were cut off. And all the praises and thanks be to Allah, the Lord of the all that exists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the roots of the people who were unjust were cut off; and all praise is due to Allah, the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the last remnant of the people who did evil was cut off. Praise belongs to God the Lord of all Being.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So of the people who did wrong the last remnant was cut off. Praise be to Allah, Lord of the Worlds!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wrongdoers were thus annihilated. All praise be to God, the Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the people who committed wrong were cut off completely. And all praise is unto Allah, the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus the wrongdoing lot were rooted out, and all praise belongs to Allah, the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of the wrong-doers the last remnant was cut off. Praise be to Allah, the Cherisher of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the roots of the people who did wrong were cut off. And all the praises and thanks be to Allah, the Lord of the 'Alamin (mankind, jinns, and all that exists).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As such the harmdoers were annihilated. Praise be to Allah, Lord of the Worlds!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus the last remnant of the people who did wrong was cut off. And praise be to God, Lord of the Worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the people that committed wrong were eliminated. And praise to Allah, Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:45] So the last remnant of the people who did evil was cut off, by having them annihilated. Praise be to God, Lord of the Worlds, for giving victory to the messengers and destroying the disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So of the people who did wrong) who ascribed partners to Allah, they were exterminated through punishment (the last remnant was cut off. Praise be to Allah) say praise and thanks be to Allah, (Lord of the Worlds!) for their extermination.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَقُطِعَ دَابِرُ ٱلْقَوْمِ } معناهُ آخِرُهُمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {then cut off the end of the people}, means their end.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَقُطِعَ } واستؤصل { دَابِرُ ٱلْقَوْمِ ٱلَّذِينَ ظَلَمُواْ } بحيث لم يبقَ من خلفهم من استخلفهم واستدبرهم { وَٱلْحَمْدُ للَّهِ رَبِّ ٱلْعَالَمِينَ } [الأنعام: 45] على هلاكهم واستئصالهم إلى حيث لم يبقَ من شؤمهم على وجه الأرض\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:72",
      "similarity": 0.6491927966486591
    },
    {
      "verse": "15:66",
      "similarity": 0.5771523460921059
    },
    {
      "verse": "79:5",
      "similarity": 0.4516233444939247
    },
    {
      "verse": "21:93",
      "similarity": 0.44940564217579104
    },
    {
      "verse": "37:90",
      "similarity": 0.43577880739956654
    }
  ]
}