{
  "chapter": "الأنعام",
  "text": "قل ارءيتم ان اخذ الله سمعكم وابصركم وختم على قلوبكم من اله غير الله ياتيكم به انظر كيف نصرف الءايت ثم هم يصدفون",
  "translations": [
    {
      "translation": "Say: 'What do you think? If Allah took away your hearing and your sight and sealed up your hearts, what god is there, other than Allah, who could give them back to you?' Look how We vary the Signs, yet still they turn away!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Imagine if God takes away your hearing and sight, and sets a seal on your hearts, what deity other than God will restore them to you?\" See how We inflect Our signs: Even then they turn aside.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad!): What do you think? If Allah should take away your hearing and your sight and seal your hearts - who is the god, other than Allah, who could restore them to you? Behold, how We put forth Our signs in diverse forms, and yet they turn away from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), ask them, \"Have you ever considered that if God was to disable your hearing and vision and veil your hearts, could anyone besides Him restore them?\" Look at how plainly We show them the evidence (of the Truth) but they always ignore it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “What is your opinion – if Allah were to take away your hearing and your sight and seal your hearts, then is there a God besides Allah who could restore it for you?” Observe how We explain the verses to them, yet they turn away!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Tell me, if Allah took away your hearing and your sight, and sealed up your hearts, is there a god other than Allah who could restore them to you\" See how variously We explain the Ayat, yet they turn aside.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Have you considered that if Allah takes away your hearing and your sight and sets a seal on your hearts, who is the god besides Allah that can bring it to you? See how We repeat the communications, yet they turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What think you? If God seizes your hearing and sight, and sets a seal upon your hearts, who is a god other than God to give it back to you?' Behold how We turn about the signs! Yet thereafter they are turning away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Have ye imagined, if Allah should take away your hearing and your sight and seal your hearts, Who is the Allah Who could restore it to you save Allah? See how We display the revelations unto them! Yet still they turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If God should take away your hearing and your sight and seal your hearts, who is the deity who could restore it to you save God?\" See how We explain the signs to them in diverse ways, yet they turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: look ye were Allah to take away your hearing and your sight and seal up your hearts, what god, other than Allah, shall bring them unto you? Behold! how variously We propound the signs, yet they turn aside.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Tell me, should Allah take away your hearing and your sight and set a seal on your hearts, which god other than Allah can bring it [back] to you?’ Look, how We paraphrase the signs variously; nevertheless they turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Think ye, if Allah took away your hearing and your sight, and sealed up your hearts, who - a god other than Allah - could restore them to you?\" See how We explain the signs by various (symbols); yet they turn aside.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (to the disbelievers): \"Tell me, if Allah took away your hearing and your sight, and sealed up your hearts, who is there - an ilah (a god) other than Allah who could restore them to you?\" See how variously We explain the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), yet they turn aside.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'What would you see if Allah took away your hearing and your sight, and set a seal upon your hearts, who is a god, other than Allah, to bring it back to you' Look how We make plain to them Our verses, and yet they turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Have you considered? If God took away your hearing and your sight, and set a seal on your hearts, what god other than God would restore them to you?” Note how We explain the revelations in various ways, yet they still turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Have you considered: if Allah should take away your hearing and your sight and set a seal upon your hearts, which deity other than Allah could bring them [back] to you?\" Look how we diversify the verses; then they [still] turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:46] Say, to the people of Mecca: ‘Have you considered, inform me, if God were to seize your hearing, [if] He were to make you deaf, and your sight, [if] He were to make you blind, and set, stamp, a seal upon your hearts, so that you no longer knew anything, who is the god other than God to give it back to you?’, that which He took away from you, as you [are wont to] claim? See how We dispense, [how] We make clear, the signs, the proofs of Our Oneness! Yet thereafter they are turning away, they reject them and do not believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say: Have ye imagined) what you are saying, people of Mecca, (if Allah should take away your hearing) such that you do not hear any admonition or guidance (and your sight) such that you do not see the Truth (and seal your hearts) such that you do not perceive the Truth or guidance, (who is the God) referring here to the idols (who could restore it to you) that which Allah has taken away from you (save Allah? See) Muhammad (how We display the revelations unto them) how We explain the Qur'an to them? (Yet still they turn away) they deny the revelations. 137\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ثُمَّ هُمْ يَصْدِفُونَ } معناهُ يَعْرِضُونَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Then they will be presented,\" means they will be brought forth.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتارة عبرة واعتباراً { ثُمَّ هُمْ يَصْدِفُونَ } [الأنعام: 46] أي: ثم انظر كيف يعرضون عن جميعها من قساوة قلوبهم وخبث طينتهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { قل } لهم أيضًا: { أرأيتم إن أخذ الله سمعكم وأبصاركم } أي: أصمَّكم وأعماكم\n { وختم على قلوبكم } بأن غطى عليها بما يزول به عقلكم وفهمُكم\n { مَن إله غير الله يأتيكم به } أي: بذلك المأخوذ\n { انظر كيف نُصرف الآيات } أي: نُكررها على جهات مختلفة\n كتصريف الرياح\n تارة من جهة المقدمات العقلية\n وتارة من جهة الترغيب والترهيب\n وتارة بالتنيبة والتذكير بأحوال المتقدمين\n { ثم هم يصدفون } أي: يعرضون عنها ولم يلتفتوا إليها\n و { ثُم }: لاستبعاد الإعراض بعد تصريف الآيات وظهورها\n و { قل } لهم أيضًا: { أرأيتكم إن أتاكم عذاب الله بغتة } من غير مقدمة { أو جهرة } بتقديمها\n فالبغتة: ما لم يتقدم لهم به شعور\n والجهرة: ما قدمت لهم مخايله\n وقيل: بغتة بالليل\n وجهرة بالنهار",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:157",
      "similarity": 0.6946253499069912
    },
    {
      "verse": "18:96",
      "similarity": 0.45124180707540174
    },
    {
      "verse": "45:23",
      "similarity": 0.38771147266411105
    },
    {
      "verse": "2:7",
      "similarity": 0.3867726441313199
    },
    {
      "verse": "83:26",
      "similarity": 0.3417171146418259
    }
  ]
}