{
  "chapter": "الأنعام",
  "text": "فقد كذبوا۟ بالحق لما جاءهم فسوف ياتيهم انۢبؤا۟ ما كانوا۟ به يستهزءون",
  "translations": [
    {
      "translation": "They deny the truth each time it comes to them but news of what they were mocking will certainly reach them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they disbelieved the truth when it came to them; but they will soon come to know the reality of what they had ridiculed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and thus they gave the lie to the Truth that has now come to them. Soon they will come upon some news concerning what they had mocked at.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have refused the Truth (Muhammad's message) that has come to them but they will soon learn the consequences of their mocking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So indeed they denied the truth* when it came to them; so now the tidings of the thing they used to mock at, will come to them. (Prophet Mohammed -peace and blessings be upon him, or the Holy Qur’an).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, they rejected the truth when it came to them, but there will come to them the news of that which they used to mock at.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So they have indeed rejected the truth when it came to them; therefore the truth of what they mocked at will shine upon them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They cried lies to the truth when it came to them, but there shall come to them news of that they were mocking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they denied the truth when it came unto them. But there will come unto them the tidings of that which they used to deride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have rejected truth whenever it came to them, yet [more] news will reach them concerning what they have been making a mockery of.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely they have belied the truth when it came unto them; so presently there cometh unto them the tidings of that whereat they have been mocking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have certainly denied the truth when it came to them, but soon there will come to them the news of what they have been deriding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And now they reject the truth when it reaches them: but soon shall they learn the reality of what they used to mock at.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, they rejected the truth (the Quran and Muhammad SAW) when it came to them, but there will come to them the news of that (the torment) which they used to mock at.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They belied the truth when it came to them, but there shall come to them news of that they were mocking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They denied the truth when it has come to them; but soon will reach them the news of what they used to ridicule.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For they had denied the truth when it came to them, but there is going to reach them the news of what they used to ridicule.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:5] They denied the truth, the Qur’ān, when it came to them, but there shall come to them the news, the consequences, of what they were mocking.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالفاء فصيحة على الأظهر أفصحت عن كلام مقدّر نشأ عن قوله : { إلا كانوا عنها معرضين } ، أي إذا تقرّر هذا الإعراض ثبت أنّهم كذّبوا بالحقّ لمّا جاءهم من عند الله ، فإنّ الإعراض علامة على التكذيب ، كما قدّمته آنفاً ، فما بعد فاء الفصيحة هو الجزاء . ومعناه أنّ من المعلوم سوء عواقب الذين كذّبوا بالحق الآتي من عند الله فلمّا تقرّر في الآية السابقة أنّهم أعرضوا آيات الله فقد ثبت أنّهم كذّبوا بالحقّ الوارد من الله ، ولذلك فرّع عليه قوله : { فسوف يأتيهم أنباء ما كانوا به يستهزئون } تأكيداً لوعد المؤمنين بالنصر وإظهار الإسلام على الدين كلّ وإنذار للمشركين بأن سيحلّ بهم ما حلّ بالأمم الذين كذّبوا رسلهم ممّن عرفوا مثل عاد وثمود وأصحاب الرسّ .وبهذا التقدير لم تكن حاجة إلى جعل الفاء تفريعاً محضاً وجعل ما بعدها علّة لجزاء محذوف مدلول عليه بعلّته كما هو ظاهر «الكشاف» ، وهي مضمون { فقد كذّبوا } بأن يقدّر : فلا تعجب فقد كذّبوا بالقرآن ، لأنّ من قدّر ذلك أوهمه أنّ تكذيبهم المراد هو تكذيبهم بالآيات التي أعرضوا عنها ما عدا آية القرآن . وهذا تخصيص لعموم قوله : { من آية } بلا مخصّص ، فإنّ القرآن من جملة الآيات بل هو المقصود أولاً ، وقد علمت أنّ { فقد كذّبوا } هو الجزاء وأنّ له موقعاً عظيماً من بلاغة الإيجاز ، على أنّ ذلك التقدير يقتضي أن يكون المراد من الآيات في قوله : { من آيات ربّهم } ما عدا القرآن . وهو تخصيص لا يناسب مقام كون القرآن أعظمها .والفاء في قوله : { فسوف } فاء التسبّب على قوله : { كذّبوا بالحقّ } ، أي يترتّب على ذلك إصابتهم بما توعّدهم به الله .وحرف التسويف هنا لتأكيد حصول ذلك في المستقبل . واستعمل الإتيان هنا في الإصابة والحصول على سبيل الاستعارة . والأنباء جمع نبأ ، وهو الخبر الذي ب أهميّة . وأطلق تحقّق نبئِه ، لأنّ النبأ نفسه قد علم من قبل .و { ما كانوا به يستهزئون } هو القرآن ، كقوله تعالى : { ذلكم بأنّكم اتَّخذتم آيات الله هزؤاً } فإنّ القرآن مشتمل على وعيدهم بعذاب الدنيا بالسيف ، وعذاب الآخرة . فتلك أنباءٌ أنبأهم بها فكذبّوه واستهزؤا به فتوعّدهم الله بأنّ تلك الأنباء سيصيبهم مضمونها . فلمّا قال لهم : { ما كانوا به يستهزئون } علموا أنّها أنباء القرآن لأنّهم يعلمون أنّهم يستهزئون بالقرآن وعلم السامعون أنّ هؤلاء كانوا مستهزئين بالقرآن . وتقدّم معنى الاستهزاء عند قوله تعالى في سورة البقرة : { إنّما نحن مستهزئون }.\n\n",
      "translations": [
        {
          "translation": "(And they) the people of Mecca (denied the Truth) the Qur'an and the sign (when it came unto them) when Muhammad (pbuh) came to them. (But there will) this is a threat of punishment (come unto them the tidings of that which they used to deride) the news of their derision and the punishment of their derision on the Day of Badr and the Day of Uhud as well as on the Day of the Confederates.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَنْبَاءُ مَا كَانُواْ بِهِ يَسْتَهْزِءُونَ } معناهُ أَخْبَارٌ\n\n",
      "translations": [
        {
          "translation": " The meaning of the saying of the Almighty: {What they used to mock} is news.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن غاية إعراضهم وإلحادهم عن طريق الرشاد { فَقَدْ كَذَّبُواْ بِٱلْحَقِّ } المطابق المواقع الذي هو القرآن الجامع { لَمَّا جَآءَهُمْ } بلسان من هو أعلى مرتبة ومكانة عند الله\n وأكمل ديناً وأقوم طريقاً فكذبوه واستهزءوا به { فَسَوْفَ يَأْتِيهِمْ } وسيظهر لهم في النشأة الأولى والأخرى { أَنْبَاءُ مَا كَانُواْ بِهِ يَسْتَهْزِءُونَ } [الأنعام: 5] حين نزول العذاب عليهم في الدنيا بضرب الذلة والمسكنة والجزية والصغار\n وفي الآخرة العذاب والنكال المخلد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فقد كذبوا بالحق } وهو القرآن { لمَّا جاءهم } \n وهو كالدليل لِما قبله\n لأنهم لمّا كذبوا بالقرآن ـ وهو أعظم الآيات ـ فكيف لا يُعرضون عن غيره من الآيات؟ ثم هدَّدهم بقوله: { فسوف يأتيهم أنباء } أي: أخبار { ما كانوا به يستهزئون } أي: سيظهر لهم\n عند نزول العذاب بهم في الدنيا والآخرة\n ما كانوا يستهزئون به من البعث والحساب\n أو عند ظهور الإسلام وارتفاعه\n الإشارة: مَن سبق له الخُذلان لا تنفعه الأدلة وتواتُر البرهان\n ولا تزيده ظهور المعجزات أو الكرامات إلا التحاسد وظهور العداوات\n ولا يزيده الدعاء إلى الله والتناد\n إلاَّ الإعراض عنه والبعاد\n نعوذ بالله من الشقاء وسوء القضاء\n ثم أمر الإنكار بالنظر والاعتبار\n فقال: { أَلَمْ يَرَوْاْ كَمْ أَهْلَكْنَا مِن قَبْلِهِم مِّن قَرْنٍ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:6",
      "similarity": 0.6756810066538769
    },
    {
      "verse": "43:7",
      "similarity": 0.6383624218181466
    },
    {
      "verse": "15:11",
      "similarity": 0.5555290912492653
    },
    {
      "verse": "30:10",
      "similarity": 0.48449035985054634
    },
    {
      "verse": "40:70",
      "similarity": 0.4724756252893277
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006005.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006005.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:5.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}