{
  "chapter": "الأنعام",
  "text": "وانذر به الذين يخافون ان يحشروا۟ الى ربهم ليس لهم من دونه ولى ولا شفيع لعلهم يتقون",
  "translations": [
    {
      "translation": "Warn by it those who fear they will be gathered to their Lord, having no protector or intercessor apart from Him, so that hopefully they will have taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn those who fear, through this (Qur'an), that they will be gathered before their Lord, and they will have none to protect or intercede for them apart from Him. They may haply take heed for themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn with this (revealed message) those who fear that they shall be mustered to their Lord, that there will be none apart from Allah to act as their protector and intercessor; then maybe they will become God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Preach the Quran to those who are concerned about the Day of Judgment at which time they will be brought before their Lord. Tell them that their only guardian and intercessor is God so that they may become pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And with this Qur’an warn those who fear, that they will be raised towards their Lord in a state when, except Allah, there will be no protector for them nor an intercessor, so that they may be pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn therewith those who fear that they will be gathered before their Lord, when there will be neither a protector nor an intercessor for them besides Him, so that they may have Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn with it those who fear that they shall be gathered to their Lord-- there is no guardian for them, nor any intercessor besides Him-- that they may guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn therewith those who fear they shall be mustered to their Lord; they have, apart from God, no protector and no intercessor; haply they will be godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn hereby those who fear (because they know) that they will be gathered unto their Lord, for whom there is no protecting ally nor intercessor beside Him, that they may ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Warn by it those who fear to be gathered before their Lord, when they have no guardian or intercessor besides God, so that they may become God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn thou therewith those who fear that they shall be gathered unto their Lord, when there shall be for them no patron nor intercessor beside Him; haply they may become God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn by its means those who fear being mustered toward their Lord, besides whom they shall have neither any guardian nor any intercessor, so that they may be Godwary.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Give this warning to those in whose (hearts) is the fear that they will be brought (to judgment) before their Lord: except for Him they will have no protector nor intercessor: that they may guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn therewith (the Quran) those who fear that they will be gathered before their Lord, when there will be neither a protector nor an intercessor for them besides Him, so that they may fear Allah and keep their duty to Him (by abstaining from committing sins and by doing all kinds of good deeds which He has ordained).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn with it those who fear to be brought before their Lord that they have no guardian or intercessor, other than Allah, in order that they are cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn with it those who fear to be gathered before their Lord—they have no protector or intercessor apart from him—perhaps they will grow in piety.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And warn by the Qur'an those who fear that they will be gathered before their Lord - for them besides Him will be no protector and no intercessor - that they might become righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:51] And warn, threaten, therewith, that is, [with] the Qur’ān, those who fear they shall be gathered to their Lord: apart from Him, other than Him, they have no protector, to help them, and no intercessor, to intercede for them (the negative sentence stands as a circumstantial qualifier referring to the subject of [the verb] yuhsharū, ‘they shall be gathered’, and constitutes the object of [what they] fear) — the sinning believers are meant here; so that they might be wary, of God, by desisting from what they engage in and performing deeds of obedience.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالأظهر أنَّه عطف على قوله : { قل هل يستوي الأعمى والبصير } \\[ الأنعام : 50 \\] لأنّ ذلك مقدّمة لذكر مَن مثّلت حالهم بحال البصير وهم المؤمنون .وضمير { به } عائد إلى { ما يوحى إليّ } \\[ الأنعام : 50 \\] وهو القرآن وما يُوحى به إلى الرسول صلى الله عليه وسلم غير مراد به الإعجاز .و { والذين يخافون أن يحشروا إلى ربهم } هم المؤمنون الممثّلون بحال البصير . وعُرّفوا بالموصول لما تدلّ عليه الصلة من المدح ، ومن التعليل بتوجيه إنذاره إليهم دون غيرهم ، لأنّ الإنذار للذين يخافون أن يحشروا إنذار نافع ، خلافاً لحال الذين ينكرون الحشر ، فلا يخافونه فضلاً عن الاحتياج إلى شفعاء .و { أن يحشروا } مفعول { يخافون } ، أي يخافون الحشر إلى ربِّهم فهم يقدّمون الأعمال الصالحة وينتهون عمَّا نهاهم خيفة أن يَلقَوا الله وهو غير راض عنهم . وخوفُ الحشر يقتضي الإيمان بوقوعه . ففي الكلام تعريض بأنّ المشركين لا ينجع فيهم الإنذار لأنَّهم لا يؤمنون بالحشر فكيف يخافونه . . ولذلك قال فيهم { إنّ الذين كفروا سواء عليهم ءَأنذرتهم أم لم تنذرهم لا يؤمنون } \\[ البقرة : 6 \\].وجملة : { ليس لهم من دونه ولي ولا شفيع } حال من ضمير { أن يحشروا } ، أي يحشروا في هذه الحالة ، فهذه الحال داخلة في حيّز الخوف . فمضمون الحال معتقد لهم ، أي ليسوا ممَّن يزعمون أنّ لهم شفعاء عند الله لا تردّ شفاعتهم ، فهم بخلاف المشركين الذين زعموا أصنامهم شفعاء لهم عند الله .وقوله { من دونه } حال من { ولي } و { شفيع } ، والعامل في الحال فعل { يخافون } ، أي ليس لهم ولي دون الله ولا شفيع دون الله ذلك بأنّ الله مولى الذين آمنوا . وهو تعريض بالمشركين الذين اتَّخذوا شفعاء وأولياء غير الله .وفي الآية دليل على ثبوت الشفاعة بإذن الله كما قال تعالى : { من ذا الذي يشفع عنده إلاّ بإذنه } \\[ البقرة : 255 \\]. ولصاحب «الكشاف» هنا تكلّفات في معنى { يخافون أن يحشروا } وفي جعل الحال من ضمير { يحشروا } حالاً لازمة ، ولعلّه يرمي بذلك إلى أصل مذهبه في إنكار الشفاعة .وقوله : { لعلّلهم يتَّقون } رجاء مسوق مساق التعليل للأمر بإنذار المؤمنين لأنَّهم يرجى تقواهم ، بخلاف من لا يؤمنون بالبعث .\n\n",
      "translations": [
        {
          "translation": "(Warn hereby) warn by the Qur'an; it is also said that this means: warn by Allah (those who fear) those who know and have certainty, among them Bilal Ibn Rabah, Suhayb Ibn Sinan, Mihja' Ibn Salih, 'Ammar Ibn Yasir, Salman al-Farisi, 'Amir Ibn Fuhayrah, Khabbab Ibn al-Aratt and Salim, the client of Abu Hudhayfah, (that they will be gathered unto their Lord) after death, (for whom there is no protecting friend) to protect them (nor intercessor beside Him) to interceded for them or save them from the torment, (that they may ward off (evil)) ward off transgressions, and this will help them perform works of obedience.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وأنذر به الذين يخافون } أي: أنذر بما أوحي إليك المستعدّين الذين هم أهل الخوف والرجاء\n وأعرض عن الذين قست قلوبهم فإنه لا ينجع فيهم كما قال في أوّل الكتاب:\n[البقرة\n الآية: 2]\n { أن يُحْشَروا إلى ربّهم ليس لهم من دونه وليّ ولا شفيع } أي: يعلمون بصفاء استعدادهم أنه لا بد من الرجوع إلى الله\n فيخافون أن يحشروا إليه في حال كونهم محجوبين عنه بحجب صفاتهم وأفعالهم لا وليّ ينصرهم غير الله فينقذهم من ذلّة البعد وعذاب الحرمان\n ولا شفيع يشفع لهم فيقرّبهم منه\n ويكرّمهم لفناء الذوات والقدر كلها في الله\n وقهره إياهم\n كما قال تعالى:\n[غافر\n الآية: 16]\n فيتعظون بسماعهم له ويحدث فيهم الرجاء فيشمرون في السلوك بالجدّ والاجتهاد { لعلهم يتّقون } لكي يحذروا حجب افعالهم وصفاتهم وذواتهم\n ويتجرّدوا عنها بالمحو والفناء في الله\n ويتجه أن يكون الوليّ القلب\n والشفيع الروح\n أي: لم يصلوا إلى مقام القلب الذي هو وليّ النفس فينقذها من العذاب وينصرها من الحرمان\n ولا إلى مقام الروح فتشفع لهم بإمداد مدد القرب لها واستمدادها من الله وتتوسل بينهم وبين الله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَنذِرْ بِهِ } أي: أنذر بما يوحى إليك يا أكمل الرسل { ٱلَّذِينَ يَخَافُونَ أَن يُحْشَرُوۤاْ إِلَىٰ رَبِّهِمْ } مع كونهم معتقدون أن { لَيْسَ لَهُمْ مِّن دُونِهِ وَلِيٌّ } يولي أمرهم غيره { وَلاَ شَفِيعٌ } يشفع لهم عنده حتى ينقذهم من عذابه { لَّعَلَّهُمْ يَتَّقُونَ } [الأنعام: 51] لكي يتقوا ويحسنوا العمل لرضاه\n\n\n{ وَ } بعدما أرسلناك يا أكمل الرسل\n لتزويج الحق وتقوية أهله { لاَ تَطْرُدِ } لا تبعد عن عندك { ٱلَّذِينَ يَدْعُونَ رَبَّهُمْ بِٱلْغَدَاةِ } أي: في جميع أوقات النهار { وَٱلْعَشِيِّ } أي: في جميع أوقات الليل",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: الضمير في { به }: يعود على { ما يوحى } وجملة { ليس }: حال من ضمير { يُحشروا }. يقول الحقّ جلّ جلاله: { وأنذر } أي: خوِّف بما أوحي إليك، المؤمنين المقصرين في العمل { الذين يخافون أن يُحشروا إلى ربهم } بالبعث للحساب، حال كونهم في ذلك الوقت { ليس لهم من دونه وليٌّ } ينصرهم من عذابه، { ولا شفيع } يرده عنهم بشفاعته، { لعلهم يتقون } أي: كي يصيروا بإنذارك متقين، وإنما خص الإنذار هنا بالذين يخافون لأنه تقدم في الكلام ما يقتضى اليأس من إيمان غيرهم، فكأنه يقول: أنذر الخائفين لأنه ينفعهم الإنذار، وأعرض عمن تقدم ذكرهم من الذين لا يسمعون ولا يعقلون، أو: أنذر من يتوقع البعث والحساب، أو يتردد فيه مؤمنًا أو كافرًا. قاله البيضاوي. الإشارة: لا ينفع الوعظ والتذكير إلا من سبق له الخوف من الملك القدير إذ هو الذي ينهضه الخوف المزعج أو الشوق المقلق، وأما من سَوّدت قلبَه الخطايا، وانطبعت في مرآته صور الأشياء، فلا ينفع فيه زاجر ولا واعظ، بل ران على قلبه ما اقترفه من المآثم، والعياذ بالله. ثم أمره بالدنو ممن ينفعه التذكير، ونهاه عن ضده، فقال: { وَلاَ تَطْرُدِ ٱلَّذِينَ يَدْعُونَ رَبَّهُمْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:86",
      "similarity": 0.49107936709095407
    },
    {
      "verse": "26:100",
      "similarity": 0.48272250354345125
    },
    {
      "verse": "30:13",
      "similarity": 0.4560463516426749
    },
    {
      "verse": "39:43",
      "similarity": 0.4289248290474189
    },
    {
      "verse": "74:48",
      "similarity": 0.42183773622069104
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006051.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006051.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:51.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}