{
  "chapter": "الأنعام",
  "text": "ولا تطرد الذين يدعون ربهم بالغدوة والعشى يريدون وجهه ما عليك من حسابهم من شىء وما من حسابك عليهم من شىء فتطردهم فتكون من الظلمين",
  "translations": [
    {
      "translation": "Do not chase away those who call on their Lord morning and evening, seeking His Face. Their reckoning is in no way your responsibility and your reckoning is in no way their responsibility. Indeed if you did chase them away, you would be among the wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not turn away those who supplicate their Lord morning and evening, seeking His magnificence. You are not accountable for them in the least, nor they for you at all. If you drive them away you will only be unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not drive away those who invoke their Lord in the morning and the evening, seeking His pleasure all the time. You are by no means accountable for them just as they are by no means accountable for you. If you still drive them away, you will become among the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not disregard those who pray to their Lord in the mornings and evenings, seeking their Lord's pleasure. You will not be held responsible for them nor will they be held responsible for you. Do not disregard them lest you become unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not repel those who call upon their Lord in the morning and evening, seeking His pleasure; you are not responsible for their account nor are they responsible for your account – then your repelling them would be far from justice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And turn not away those who invoke their Lord, morning and evening seeking His Face. You are accountable for them in nothing, and they are accountable for you in nothing, that you may turn them away, and thus become of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not drive away those who call upon their Lord in the morning and the evening, they desire only His favor; neither are you answerable for any reckoning of theirs, nor are they answerable for any reckoning of yours, so that you should drive them away and thus be of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not drive away those who call upon their Lord at morning and evening desiring His countenance; nothing of their account falls upon thee, and nothing of thy account falls upon them, that thou shouldst drive them away, and so become one of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Repel not those who call upon their Lord at morn and evening, seeking His Countenance. Thou art not accountable for them in aught, nor are they accountable for thee in aught, that thou shouldst repel them and be of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not send away those who call upon their Lord in the morning and in the evening, seeking only His grace. You are not by any means accountable for them, nor are they accountable for you. If you turn them away, you yourself will become one of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And drive not away those who call upon their Lord morning and evening, seeking His countenance. Not on thee is aught of their reckoning, nor on them aught of thine reckoning, so that thou mayest drive them away and thus become of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not drive away those who supplicate their Lord morning and evening desiring His face. Neither are you accountable for them in any way, nor are they accountable for you in any way, so that you may drive them away and thus become one of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Send not away those who call on their Lord morning and evening, seeking His face. In naught art thou accountable for them, and in naught are they accountable for thee, that thou shouldst turn them away, and thus be (one) of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And turn not away those who invoke their Lord, morning and afternoon seeking His Face. You are accountable for them in nothing, and they are accountable for you in nothing, that you may turn them away, and thus become of the Zalimun (unjust).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not drive away those who call on their Lord morning and evening, seeking only His Face. Nothing of their account falls upon you, and nothing of your account falls upon them, that you should drive them away and so become one of the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not drive away those who call upon their Lord, morning and evening, seeking His attention. You are not accountable for them in any way, nor are they accountable for you in any way. If you drive them away, you would be one of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not send away those who call upon their Lord morning and afternoon, seeking His countenance. Not upon you is anything of their account and not upon them is anything of your account. So were you to send them away, you would [then] be of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:52] And do not drive away those who call upon their Lord at morning and evening desiring, through their worship, His countenance, exalted be He, and not [desiring] any of the transient things of this world — and these are the poor. The idolaters had reviled them and demanded that he [the Prophet] expel them, so that they could sit with him. The Prophet (s) wanted [to do] this, because of his desire that they become Muslims. You are not accountable for them in anything (min shay’in: min is extra), if what they hide in themselves be displeasing; nor are they accountable for you in anything, that you should drive them away (this is the response to the negative sentence) and be of the evildoers, if you do this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على قوله : { وأنذر به الذين يخافون أن يحشروا إلى ربّهم } \\[ الأنعام : 51 \\] لأنّه في معنى أنذرهم ولازمهم وإن كره ذلك متكبّرو المشركين . فقد أجريت عليهم هنا صلة أخرى هي أنسب بهذا الحكم من الصلة التي قبلها ، كما أنّ تلك أنسبُ بالحكم الذي اقترنت معه منها بهذا ، فلذلك لم يُسلك طريق الإضمار ، فيقال : ولا تَطْردْهُم ، فإنّ النبي صلى الله عليه وسلم جاء داعياً إلى الله فأولى الناس بملازمته الذين هجيّراهم دعاء الله تعالى بإخلاص فكيف يطردهم فإنّهم أولى بذلك المجلس ، كما قال تعالى : { إنّ أولى الناس بإبراهيم للّذين اتَّبعوه } \\[ آل عمران : 68 \\].روى مسلم عن سعد بن أبي وقَّاص قال : كنَّا مع النَّبيء ستة نفر ، فقال المشركون للنبيء : أطرد هؤلاء لا يَجْتَرئُون علينا . قال : وكنت أنا ، وابن مسعود ، ورجل من هُذيل ، وبلال ، ورجلان ، لست أسمِّيهما ، فوقع في نفس رسول الله صلى الله عليه وسلم ما شاء الله أن يقع ، فحدّث نفسه فأنزل الله تعالى : { ولا تطرد الذين يدعون ربّهم بالغداة والعشي يريدون وجهه } اه . وسمّى الواحدي بقيّة الستَّة : وهم صهيب ، وعمّار بن ياسر ، والمقدادُ بن الأسود ، وخبّاب بن الأرتّ . وفي قول ابن مسعود «فوقع في نفس رسول الله ما شاء الله» إجمال بيِّنه ما رواه البيهقي أنّ رؤساء قريش قالوا لرسول الله : لو طردت هؤلاء الأعْبُدَ وأرواحَ جِبَابِهم ( جمع جُبّة ) جَلَسْنا إليك وحادثناك . فقال : ما أنا بطارد المؤمنين . فقالوا : فأقمهم عنّا إذا جئنا فإذا قمنا فأقعدهم معك إن شئت ، فقال : نعم ، طَعماً في إيمانهم . فأنزل الله هذه الآية . ووقع في «سنن» ابن ماجة عن خبَّاب أنّ قائل ذلك للنبيء صلى الله عليه وسلم الأقْرعُ بن حابس وعُبَيْنَةُ بن حِصْن ، وأنّ ذلك سبب نزول الآية ، وقال ابن عطية : هو بعيد لأنّ الآية مكية . وعيينة والأقرع إنَّما وفَدا مع وفد بني تميم بالمدينة سنة الوفود . اه . قلت : ولعلّ ذلك وقع منهما فأجابهم رسول الله صلى الله عليه وسلم بهذه الآية التي نزلت في نظير اقتراحهما .وفي سنده أسباط بن نصر أو نضر ، ولم يكن بالقوي ، وفيه السديّ ضعيف . وروي مثله في بعض التفاسير عن سلمان الفارسي ، ولا يعرف سنده . وسمّى ابنُ إسحاق أنَّهم المستضعفون من المؤمنين وهم : خبَّاب ، وعمَّار ، وأبُو فُكيهة ، يسار مَولى صفوان بن أمية بن مُحرّث ، وصهيب وأشباههم ، وأنّ قريشاً قالوا : { أهؤلاء منّ الله عليهم من بيننا } \\[ الأنعام : 53 \\] وذكر الواحدي في «أسباب النزول» : أنّ هذه الآية نزلت في حياة أبي طالب . فعن عكرمة قال : جاء عتبة بن ربيعة ، وشيبة بن ربيعة ، ومُطعِم بن عدي ، والحارثُ بن نوفل ، في أشراف بني عبد مناف إلى أبي طالب فقالوا : لو أنّ ابن أخيك محمداً يَطرد عنه موالينا وعبيدنا وعتقاءنا كان أعظم من صدورنا وأطمع له عندنا وأرجى لاتِّبَاعِنا إيَّاه وتصديقنا له .فأتى أبو طالب إلى النبي صلى الله عليه وسلم فحدّثه بالذي كلَّموه ، فقال عمر بن الخطاب : لو فعلت ذلك حتَّى ننظر ما الذي يريدون وإلامَ يصيرون من قولهم ، فأنزل الله هذه الآية . فلمّا نزلت أقبل عمر يعتذر .والمعنى أنّ رسول الله صلى الله عليه وسلم لحرصه على إيمان عظماء قريش ليكونوا قدوة لقومهم ولعلمه بأنّ أصحابه يحرصون حرصه ولا يوحشهم أن يقاموا من المجلس إذا حضره عظماء قريش لأنّهم آمنوا يريدون وجه الله لا للرياء والسمعة ولكن الله نهاه عن ذلك . وسمَّاه طرداً تأكيداً لمعنى النهي ، وذلك لحكمة : وهي كانت أرجح من الطمع في إيمان أولئك ، لأنّ الله اطّلع على سرائرهم فعلم أنّهم لا يؤمنون ، وأراد الله أن يظهر استغناء دينه ورسوله عن الاعتزاز بأولئك الطغاة القساة ، وليظهر لهم أنّ أولئك الضعفاء خير منهم ، وأنّ الحرص على قربهم من الرسول صلى الله عليه وسلم أولى من الحرص على قرب المشركين ، وأنّ الدين يرغب الناس فيه وليس هو يرغب في الناس كما قال تعالى : { يمنّون عليك أنْ أسلموا قُل لا تَمنُوا عليّ إسلامكم بلْ اللّهُ يَمُنّ عَلَيْكم أن هداكم للإيمان إن كنتم صادقين } \\[ الحجرات : 17 \\].ومعنى { يدعون ربّهم } يعلنون إيمانهم به دون الأصنام إعلاناً بالقول ، وهو يستلزم اعتقاد القائل بما يقوله ، إذ لم يكن يومئذٍ نفاق وإنَّما ظهر المنافقون بالمدينة .والغداة : أوّل النهار . والعشيّ من الزوال إلى الصباح . والباء للظرفية . والتعريف فيهما تعريف الجنس . والمعنى أنّهم يدعون الله اليوم كلّه . فالغداة والعشي قصد بهما استيعاب الزمان والأيام كما يقصد بالمشرق والمغرب استيعاب الأمكنة . وكما يقال : الحمد لله بكرة وأصيلاً ، وقيل : أريد بالدعاء الصلاة . وبالغداة والعشي عموم أوقات الصلوات الخمس . فالمعنى ولا تطرد المصلّين ، أي المؤمنين .وقرأ الجمهور { بالغَداة } بفتح الغين وبألف بعد الدال . وقرأه ابن عامر بضمّ الغين وسكون الدال وبواو ساكنة بعد الدال وهي لغة في الغَدَاة .وجملة { يريدون وجهه } حال من الضمير المرفوع في { يدعون } ، أي يدعون مخلصين يريدون وجه الله ، أي لا يريدون حظاً دنيوياً .والوجه حقيقة الجزء من الرأس الذي فيه العينان والأنف والفم . ويطلق الوجه على الذات كلّها مجازاً مرسلاً .والوجه هنا مستعار للذات على اعتبار مضاف ، أي يريدون رضى الله ، أي لا يريدون إرضاء غيره . ومنه قوله تعالى : { إنّما نطعمكم لوجه الله لا نريد منكم جزاء ولا شكوراً } \\[ الإنسان : 9 \\] ، وقوله : { فأينما تولّوا فثمّ وجهُ الله } ، وتقدّم في سورة \\[ البقرة : 115 \\]. فمعنى { يريدون وجهه } أنَّهم آمنوا ودعوا الله لا يريدون بذلك عرضاً من الدنيا . وقد قيل : إنّ قريشاً طعنوا في إيمان الضعفاء ونسبوهم إلى النفاق ، إلاّ أنّ هذا لم يرد به أثر صحيح ، فالأظهر أنّ قوله { يريدون وجهه } ثناء عليهم بكمال إيمانهم ، وشهادة لهم بأنَّهم مجرّدون عن الغايات الدنيوية كلّها ، وليس المقصود به الرّدّ على المشركين .وجملة { ما عليك من حسابهم من شيء } تعليل للنهي عن طردهم ، أو إبطال لعلّة الهَمّ بطردهم ، أو لعلَّة طلب طردهم . فإنّ إبطال علَّة فعل المنهي عنه يؤول إلى كونه تعليلاً للنهي ، ولذا فصلت هذه الجملة .والحسابُ : عَدّ أفراد الشيء ذي الأفراد ويطلق على إعمال النظر في تمييز بعض الأحوال عن بعض إذا اشتبهت على طريقة الاستعارة بتشبيه تتبّع الأحوال بعَدّ الأفراد . ومنه جاء معنى الحِسْبةَ بكسر الحاء ، وهي النظر في تمييز أحوال أهل السوق من استقامة وضدّها . ويقال : حاسبَ فلاناً على أعماله إذا استقراها وتتبّعها . قال النابغة: ... يُحاسِبُ نفسه بِكَمْ اشتراهافالحساب هنا مصدر حاسب . والمراد به تتبّع الأعمال والأحوال والنظر فيما تقابل به من جزاء .وضمير الجمع في قوله : { من حسابهم } وقوله { وما من حسابك عليهم } يجوز أن يكونا عائدين إلى { الذين يَدْعون ربّهم } وهو مَعَاد مَذْكور ، وهو المناسب لتناسق الضمائر مع قوله { فتطردهم }.فالمعنى أنَّهم أهل الحقّ في مجلسك لأنَّهم مؤمنون فلا يطردون عنه وما عليك أن تحسب ما عدا ذلك من الأمور العارضة لهم بزعم المشركين ، وأنّ حضور أولئك في مجلسك يصدّ كبراء المشركين عن الإيمان ، أي أنّ ذلك مدحوض تجاه حقّ المؤمنين في مجلس رسولهم وسماع هديه .وقيل معنى : { ما عليك من حسابهم } أنّ المشركين طعنوا في إخلاص هؤلاء النفر ، قالوا : يا محمد إنّ هؤلاء إنّما اجتمعوا عندك وقبلوا دينك لأنَّهم يجدون مأكولاً وملبوساً عندك ، فقال الله تعالى : ما يلزمك إلاّ اعتبار ظاهرهم وإن كان لهم باطن يخالفه فحسابهم على الله ، أي إحصاء أحوالهم ومناقشتهم عليها على نحو قول نوح { إنْ حسابُهم إلاّ على ربِّي لو تَشعرون } \\[ الشعراء : 113 \\]. فمعنى حسابهم على هذا الوجه تمحيص نياتهم وبواطنهم . والقصد من هذا تبكيتُ المشركين على طريقة إرخاء العنان ، وليس المراد استضعاف يقين المؤمنين . و { حسابهم } على هذا الوجه من إضافة المصدر إلى مفعوله .ويجوز أن يكون الضميران عائدين إلى غير مذكور في الكلام ولكنّه معلوم من السياق الذي أشار إليه سبب النزول ، فيعود الضميران إلى المشركين الذين سألوا طَرد ضعفاء المؤمنين من مجلس النبي صلى الله عليه وسلم فيكون ضمير { فتطردهم } عائداً إلى المؤمنين . ويختلف معاد الضميرين اعتماداً على ما يعيِّنه سياق الكلام ، كقوله تعالى : { وعَمَرُوها أكثر ممَّا عمروها } \\[ الروم : 9 \\] ، وقول عباس بن مرداس في وقعة حنين: ... عُدْنَا ولولا نَحْنُ أحْدَقَ جَمعُهمبالمسلمين وأَحرَزُوا ما جَمَّعُوا ... أي أحرز المشركون ما جمعه المسلمون من الغنائم .والمعنى : ما عليك من حساب المشركين على الإيمان بِك أو على عدم الإيمان شيء ، فإنّ ذلك موكول إليّ فلا تظلم المؤمنين بحرمانهم حقّاً لأجل تحصيل إيمان المشركين ، فيكون من باب قوله تعالى :{ إن يكن غنياً أو فقيراً فالله أوْلَى بهما فلا تتَّبعوا الهوى أن تعدلوا } \\[ النساء : 135 \\].وعلى هذا الوجه يجوز كون إضافة { حسابهم } من إضافة المصدر إلى مفعوله ، أي محاسبتك إيّاهم . ويجوز كونها من إضافته إلى فاعله ، أي من حساب المشركين على هؤلاء المؤمنين فقرَهم وضعفهم .و { عليك } خبر مقدّم . و ( على ) فيه دالّة على معنى اللزوم والوجوب لأنّ الرسول عليه الصلاة والسلام همّ أو كان بحيث يهمّ بإجابة صناديد قريش لما سألوه ، فيكون تنبيهاً على أنّ تلك المصلحة مدحوضة .و ( منْ ) في قوله : { من شيء } زائدة لتوكيد النفي للتنصيص على الشمول في سياق النفي ، وهو الحرف الذي بتقديره بُني اسم ( لا ) على الفتح للدلالة على إرادة نفي الجنس .وتقديم المسنَدَين على المسند إليهما في قوله { ما عليك من حسابهم من شيء وما من حسابك عليهم من شيء } تقديم غير واجب لأنّ للابتداء بالنكرتين هنا مسوّغاً ، وهو وقوعهما في سياق النفي ، فكان تقديم المجرورين هنا اختيارياً فلا بدّ له من غرض . والغرض يحتمل مجرّدَ الاهتمام ويحتمل الاختصاص . وحيث تأتّى معنى الاختصاص هنا فاعتباره أليق بأبلغ كلام ، ولذلك جرى عليه كلام «الكشاف» . وعليه فمعنى الكلام قصر نفي حسابهم على النبي صلى الله عليه وسلم ليفيد أنّ حسابهم على غيره وهو الله تعالى . وذلك هو مفاد القصر الحاصل بالتقديم إذا وقع في سياق النفي ، وهو مفاد خِفي على كثير لقلّة وقوع القصر بواسطة التقديم في سياق النفي . ومثالُه المشهور قوله تعالى : { لا فيها غوْل } \\[ الصافات : 47 \\] فإنَّهم فسّروه بأنّ عدم الغول مقصور على الاتِّصاف بفِي خمور الجنَّة ، فالقصر قصر قلب .وقد اجتمع في هذا الكلام خمسة مؤكِّدات . وهي ( مِنْ ) البيانية ، و ( مِنْ ) الزّائدة ، وتقديم المعمول ، وصيغة الحصر في قوله : { ما عليك من حسابهم من شيء } ، والتأكيدُ بالتَّتميم بنفي المقابل في قوله : { وما من حسابك عليهم من شيء } ، فإنَّه شبيه بالتوكيد اللفظي . وكلّ ذلك للتنصيص على منتهى التبرئة من محاولة إجابتهم لاقتراحهم .ويُفيد هذا الكلام التعريضَ برؤساء قريش الذين سألوا إبعاد الفقراء عن مجلس الرسول عليه الصلاة والسلام حين ما يحضرون وأوهموا أنّ ذلك هو الحائل لهم دون حضور مجلس الرسول عليه الصلاة والسلام والإيمان به والكون من أصحابه ، فخاطب الله رسوله بهذا الكلام إذ كان الرسول هو المسؤول أن يقضي أصحابَه عن مجلسه ليعلم السائلون أنّهم سألوه ما لا يقع ويعلموا أنّ الله أطْلَع رسوله صلى الله عليه وسلم على كذبهم ، وأنّهم لو كانوا راغبين في الإيمان لما كان عليهم حساب أحوال الناس ولاشتغلوا بإصلاح خُوَيْصتِهم ، فيكون الخطاب على نحو قوله تعالى : { لئن أشركتَ ليحبطنّ عَمَلُك } \\[ الزمر : 65 \\]. وقد صرّح بذلك في قوله بعدُ{ ولتستبين سبيل المجرمين } \\[ الأنعام : 55 \\]. وإذ كان القصر ينحلّ على نسبتي إثبات ونفي فالنسبة المقدّرة مع القصر وهي نسبة الإثبات ظاهرة من الجمع بين ضمير المخاطب وضمير الغائبين ، أي عدم حسابهم مقصور عليك ، فحسابهم على أنفسهم إذ كلّ نفس بما كسبت رهينة .وقد دلّ على هذا أيضاً قوله بعده { ومَا من حسابك عليهم من شيء } فإنّه ذُكر لاستكمال التعليل ، ولذلك عطف على العلّة ، لأنّ مجموع مدلول الجملتين هو العلّة ، أي حسابهم ليس عليك كما أنّ حسابك ليس عليهم بل على نفسك ، إذ كلّ نفس بما كسبت رهينة ، ولا تزر وازرة وزْر أخرى . فكما أنّك لا تنظُر إلاّ إلى أنَّهم مؤمنون ، فهم كذلك لا يطلب منهم التفريط في حق من حقوق المؤمنين لتسديد رغبة منك في شيء لا يتعلّق بهم أو لتحصيل رغبة غيرهم في إيمانه . وتقديم المسند على المسند إليه هنا كتقديمه في نظيره السابق .وفي قوله : { وما من حسابك عليهم من شيء } تعريض بالمشركين بأنَّهم أظهروا أنّهم أرادوا بطرد ضعفاء المؤمنين عن مجلس الرسول صلى الله عليه وسلم النصح له ليكتسب إقبال المشركين عليه والإطماع بأنَّهم يؤمنون به فيكثر متَّبعوه .ثم بهذا يظهر أن ليس المعنى : بل حسابهم على الله وحسابك على الله ، لأنّ هذا غير مناسب لسياق الآية ، ولأنَّه يصير به قوله : { وما من حسابك عليهم من شيء } مستدركاً في هذا المقام ، ولذلك لم يتكرّر نظير هذه الجملة الثانية مع نظير الجملة الأولى فيما حكى الله عن نوح { إن حسابهم إلاّ على ربِّي } في سورة \\[ الشعراء : 113 \\] لأنّ ذلك حكي به ما صدر من نوح وما هنا حكي به كلام الله تعالى لرسوله ، فتنبّهْ .ويجوز أن يكون تقديم المسند في الموضعين من الآية لمجرّد الاهتمام بنفي اللزوم والوجوب الذي دلّ عليه حرف ( على ) في الموضعين لا سيما واعتبار معنى القصر في قوله وَمَا مِن حسابك عليهم من شيء } غيرُ واضح ، لأنَّنا إذا سلَّمنا أن يكون للرسول عليه الصلاة والسلام شِبْه اعتقاد لزوممِ تتَّبع أحوالهم فقُلب ذلك الاعتقاد بالقصر ، لا نجد ذلك بالنسبة إلى { الذين يدعون ربَّهم بالغداة والعشي } إذ لا اعتقاد لهم في هذا الشأن .وقدّم البيان على المبيَّن في قوله : { وما من حسابك عليهم من شيء } لأنّ الأهمّ في المقامين هو ما يختصّ بالمخاطب المعرِّضُ فيه بالذين سألوه الطرد لأنَّه المقصود بالذات ، وإنَّما جيء بالجملة الثانية لاستكمال التعليل كما تقدّم .وقوله : { فتطردهم } منصوب في جواب النهي الذي في قوله : { ولا تطرُد الذين يدعون ربَّهم }.وإعادة فعل الطرد دون الاقتصار على قوله : { فتكونَ من الظالمين } ، لإفادة تأكيد ذلك النهي وليبنى عليه قوله { فتكون من الظالمين } لوقوع طول الفصل بين التفريع والفرّع عليه . فحصل بإعادة فعل { فتطردهم } غرضان لفظي ومعنوي .على أنَّه يجوز أن يجعل { فتطردهم } منصوباً في جواب النفي من قوله : { ما عليك من حسابهم من شيء وما من حسابك عليهم من شيء } ، أي لا تطردهم إجابة لرغبة أعدائهم .وقوله : { فتكون من الظالمين } عطف على { فتطردهم } متفرّع عليه ، أي فتكون من الظالمين بطردهم ، أي فكونه من الظالمين منتف تبعاً لانتفاء سببه وهو الطرد .وإنَّما جُعل طردهم ظلماً لأنَّه لما انتفى تكليفه بأن يحاسبهم صار طردهم لأجل إرضاء غيرهم ظلماً لهم . وفيه تعريض بالذين سألوا طردهم لإرضاء كبريائهم بأنَّهم ظالمون مفطرون على الظلم؛ ويجوز أن يجعل قوله : { فتكون من الظالمين } منصوباً في جواب النهي ، ويجعل قوله { فتطردهم } جيء به على هذا الأسلوب لتجديد ربط الكلام لطول الفصل بين النهي وجوابه بالظرف والحال والتعليل؛ فكان قوله { فتطردهم } كالمقدّمة لقوله { فتكون من الظالمين } وليس مقصودٌ بالذات للجوابية؛ فالتقدير : فتكون من الظالمين بطردهم .\n\n",
      "translations": [
        {
          "translation": "(Repel not) Muhammad, because of what 'Uyaynah Ibn Hisn al-Fazari has said-he said: \"repel these from you so that the nobles of Mecca come to you, hear you and believe in you\"-and these nobles also asked 'Umar to request the Prophet (pbuh) to allocate one day for them and another for weak believers, but Allah rejected this and warned them against such a deed, (those who call upon their Lord) Salman and his fellow believers, among the clients, who worship their Lord (at morn and evening) through performing the five daily prayers, (seeking His Countenance) and by doing so they only seek Allah's Countenance and good pleasure. (Thou art not accountable for them) for their provision (in aught, nor are they accountable for you) for your provision (in aught, that thou shouldst repel them and be of the wrong-doers) of those who harm themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ولا تَطْرد الذين يدعون } أي: لا تزجرهم به\n وهم أهل الوحدة الكاملون الواصلون\n فإن الإنذار كما لا ينجع في الذين قست قلوبهم لا ينفع في الذين طاشت قلوبهم في الله وتلاشت { ربّهم بالغداة والعشيّ } أي: يخصونه بالعبادة دائماً بحضور القلب وشهود الروح وتوجه السرّ إليه\n لا يريدون بالعبادة إلا ذاته بالمحبة الأزلية لا يجعلون عبادتهم معللة بغرض من توقع ثواب جنة أو خوف عقاب أو نقمة\n ولا يريدونه بمحبة الصفات فتتغير إرادتهم باختلاف تجلياتها ولا يستحلون توسيط ذاته في مقصد أو مطلب بل شاهدوا فناء الوسائط والوسائل فيه ولم يبق في شهودهم شيء يقع نظرهم عليه حتى ذواتهم { ما عليك من حِسَابهم } فيما يعملون من شيء\n أي: لا واسطة بينهم وبين ربّهم من ملك أو نبيّ فلست من دعوتهم إلى طاعة أو إلى جهاد أو إلى غير ذلك في شيء\n فحسابهم على الله إذ عملهم ليس إلا بالله وفي الله { وما من حسابك عليهم من شيء } أي: لا يخوضون في أمور دعوتك بنصر وإعانة للإسلام ولا بدفع وقمع للكفر لاشتغالهم بالله عما سواه ودوام حضورهم كما قال تعالى:\n[المعارج\n الآية: 23] لا يعنيهم شأن من أمرك ونبوّتك { فتطردهم } عما هم عليه من دوام الحضور بإنهاضهم لشغل ديني أو مصلحة أو تشوّش وقتهم وجمعيتهم { فتكون من الظالمين }  { وكذلك فتنّا } أي: مثل ذلك الفتن والابتلاء العظيم فتنّا { بعضهم } وهم المحجوبون بالبعض\n فإن المحجوبين لما لم يروا منهم إلا صورتهم وسوء حالهم في الظاهر وفقرهم ومسكنتهم\n ولم يروا قدرهم ومرتبتهم وحسن حالهم في الباطن\n استحقروهم وازدرتهم أعينهم بالنسبة إلى ما هم فيه من المال والجاه والتنعم وخفض العيش فقالوا فيهم:",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وبالجملة: يستغرقون جميع أوقاتهم بالتوجه نحوه سبحانه إنما { يُرِيدُونَ } بتوجههم غير أن يطالعوا { وَجْهَهُ } الكريم بسبب ميلك إلى أيمان أهل الأهواء ومصاحبتهم ومجالستهم\n مع أنهم ليسوا من أهل الفلاح ولا قابلين له بل { مَا عَلَيْكَ مِنْ حِسَابِهِم } وإيمانهم { مِّن شَيْءٍ } يعود إليه نفعه { وَمَا مِنْ حِسَابِكَ } وإيمانك { عَلَيْهِمْ مِّن شَيْءٍ } بل كل منك\n ومنهم مجزي بما عمل ومسئول عما فعل { فَتَطْرُدَهُمْ } أي: هؤلاء المؤمنين المريدين وجه الكله في جميع أوقاتهم وحالاتهم\n لأجل أولئك المنهمكين في الضلال { فَتَكُونَ } بواسطة طردهم وتبعيدهم { مِنَ ٱلظَّالِمِينَ } [الأنعام: 52] الخارجين عن مقتضى العقل والشرع والمرءوة\n\n\n \" روي أن قريشاً قالوا: لو طردت يا محمد هؤلاء السلفة - أرادوا عماراً وصهيباً وسلمان وغيرهم - جلسنا إليك وحدثنا معك فقال صلى الله عليه وسلم: \" وما أنا بطارد المؤمنين \"\n \n \n قالوا: فأقمهم من مجلسنا إن جلسنا معك\n \n \n قال له عمر رضي الله عنه: لو فعلت حتى تنظر ماذا يصيرون\n فقبل صلى الله عليه وسلم\n \n \n قالوا: فاكتب بذلك كتاباً\n فدعا بالصحيفة وبعلي ليكتب فنزلت \" \n ",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { فتطردهم }: جواب النفي\n و { فتكون }: جواب النهي\n أي: ولا تطرد فتكون من الظالمين\n فليس عليك من حسابهم شيء فتطردهم\n يقول الحقّ جلّ جلاله: لنبيه ـ عليه الصلاة والسلام ـ\n حين طلب منه صناديدُ قريش أن يطرد عنه ضعفاء المسلمين ليجالسوه\n فَهَمَّ بذلك طمعًا في إسلامهم\n فنزلت: { ولا تطرد الذين يدعون ربهم } أي: يعبدونه بالذكر وغيره\n أو يدعونه بالتضرع والابتهال\n { بالغداة والعشي } أي: على الدوام\n وخص الوقتين بالذكر لشرفهما\n وفي الخبر:\n \" يا ابنَ آدمَ\n اذكُرني أول النهار وآخره\n أكفِكَ ما بينهما \" \nوقيل: صلاة الصبح والعصر\n وقيل: الصلاة بمكة قبل فرض الخمس\n قال البيضاوي: بعد ما أمره بإنذار غير المتقين ليتقوا ـ أي: على التفسير الثاني في الآية المتقدمة ـ أمره بإكرام المتقين وتقريبهم\n وألاَّ يطردَهم\n ترضية لقريش\n رُوِي أنهم قالوا: لو طَردتَ هؤلاء الأعبُدِ ـ يُعنُون فقراء المُسلِمِينَ\n كعمَّار وصُهَيب وخبَّاب وبِلال وسَلمان ـ جلَسنا إليك\n فقال:\n \" ما أنا بطاردِ المؤمنين \" \nقالوا: فأقمهُم عنا\n قال:\n \" نَعَم \" \n[ رُوِي أن عمر قال له: لَو فَعَلتَ حتَّى تنظرَ إلى ما يَصِيرُونَ؟] قالوا: فاكتُب بِذَلِكَ كِتَابًا\n فدَعَا بالصَّحِيفَةِ وبَعَليٍّ ليَكتُبَ\n فنزلت\n هـ\n وفي ذكر سلمان معهم نظر لتأخر إسلامه بالمدينة\n ثم وصفهم بالإخلاص فقال: { يريدون وجهه } أي: يدعونه مخلصين طالبين النظر لوجهه\n وفيه تنبيه على أن الإخلاص شرط في الأعمال\n ورتب النهي عليه إشعارًا بأنه يقتضي إكرامهم\n وينافي إبعادهم\n ثم علل عدم طردهم فقال: { ما عليك من حسابهم من شيء وما من حسابك عليهم من شيء فتطردهم } أي: أنت لا تحاسب عنهم\n وهم لا يحاسبون عنك\n فلأي شيء تطردهم؟ وقيل: الضمير: للكفار\n أي: أنت لا تحاسب عنهم\n وهم لا يحاسبون عنك\n فلا تهتم بأمرهم\n حتى تطرد هؤلاء من أجلهم\n { فتكون من الظالمين } بطردهم\n لكنه ـ عليه الصلاة والسلام ـ لم يفعل\n فلا ظلم يلحقه في ذلك لسابق العناية والعصمة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:114",
      "similarity": 0.7322113782408698
    },
    {
      "verse": "11:30",
      "similarity": 0.714793377336703
    },
    {
      "verse": "11:29",
      "similarity": 0.6460881048949831
    },
    {
      "verse": "40:46",
      "similarity": 0.4091336398806939
    },
    {
      "verse": "18:28",
      "similarity": 0.3714846326779634
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006052.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006052.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:52.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}