{
  "chapter": "الأنعام",
  "text": "ولا تطرد الذين يدعون ربهم بالغدوة والعشى يريدون وجهه ما عليك من حسابهم من شىء وما من حسابك عليهم من شىء فتطردهم فتكون من الظلمين",
  "translations": [
    {
      "translation": "Do not turn away those who supplicate their Lord morning and evening, seeking His magnificence. You are not accountable for them in the least, nor they for you at all. If you drive them away you will only be unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not drive away those who invoke their Lord in the morning and the evening, seeking His pleasure all the time. You are by no means accountable for them just as they are by no means accountable for you. If you still drive them away, you will become among the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not disregard those who pray to their Lord in the mornings and evenings, seeking their Lord's pleasure. You will not be held responsible for them nor will they be held responsible for you. Do not disregard them lest you become unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not repel those who call upon their Lord in the morning and evening, seeking His pleasure; you are not responsible for their account nor are they responsible for your account – then your repelling them would be far from justice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And turn not away those who invoke their Lord, morning and evening seeking His Face. You are accountable for them in nothing, and they are accountable for you in nothing, that you may turn them away, and thus become of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not drive away those who call upon their Lord in the morning and the evening, they desire only His favor; neither are you answerable for any reckoning of theirs, nor are they answerable for any reckoning of yours, so that you should drive them away and thus be of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not drive away those who call upon their Lord at morning and evening desiring His countenance; nothing of their account falls upon thee, and nothing of thy account falls upon them, that thou shouldst drive them away, and so become one of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Repel not those who call upon their Lord at morn and evening, seeking His Countenance. Thou art not accountable for them in aught, nor are they accountable for thee in aught, that thou shouldst repel them and be of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not send away those who call upon their Lord in the morning and in the evening, seeking only His grace. You are not by any means accountable for them, nor are they accountable for you. If you turn them away, you yourself will become one of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And drive not away those who call upon their Lord morning and evening, seeking His countenance. Not on thee is aught of their reckoning, nor on them aught of thine reckoning, so that thou mayest drive them away and thus become of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not drive away those who supplicate their Lord morning and evening desiring His face. Neither are you accountable for them in any way, nor are they accountable for you in any way, so that you may drive them away and thus become one of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Send not away those who call on their Lord morning and evening, seeking His face. In naught art thou accountable for them, and in naught are they accountable for thee, that thou shouldst turn them away, and thus be (one) of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And turn not away those who invoke their Lord, morning and afternoon seeking His Face. You are accountable for them in nothing, and they are accountable for you in nothing, that you may turn them away, and thus become of the Zalimun (unjust).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not drive away those who call on their Lord morning and evening, seeking only His Face. Nothing of their account falls upon you, and nothing of your account falls upon them, that you should drive them away and so become one of the harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not drive away those who call upon their Lord, morning and evening, seeking His attention. You are not accountable for them in any way, nor are they accountable for you in any way. If you drive them away, you would be one of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do not send away those who call upon their Lord morning and afternoon, seeking His countenance. Not upon you is anything of their account and not upon them is anything of your account. So were you to send them away, you would [then] be of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:52] And do not drive away those who call upon their Lord at morning and evening desiring, through their worship, His countenance, exalted be He, and not [desiring] any of the transient things of this world — and these are the poor. The idolaters had reviled them and demanded that he [the Prophet] expel them, so that they could sit with him. The Prophet (s) wanted [to do] this, because of his desire that they become Muslims. You are not accountable for them in anything (min shay’in: min is extra), if what they hide in themselves be displeasing; nor are they accountable for you in anything, that you should drive them away (this is the response to the negative sentence) and be of the evildoers, if you do this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Repel not) Muhammad, because of what 'Uyaynah Ibn Hisn al-Fazari has said-he said: \"repel these from you so that the nobles of Mecca come to you, hear you and believe in you\"-and these nobles also asked 'Umar to request the Prophet (pbuh) to allocate one day for them and another for weak believers, but Allah rejected this and warned them against such a deed, (those who call upon their Lord) Salman and his fellow believers, among the clients, who worship their Lord (at morn and evening) through performing the five daily prayers, (seeking His Countenance) and by doing so they only seek Allah's Countenance and good pleasure. (Thou art not accountable for them) for their provision (in aught, nor are they accountable for you) for your provision (in aught, that thou shouldst repel them and be of the wrong-doers) of those who harm themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { ولا تَطْرد الذين يدعون } أي: لا تزجرهم به، وهم أهل الوحدة الكاملون الواصلون، فإن الإنذار كما لا ينجع في الذين قست قلوبهم لا ينفع في الذين طاشت قلوبهم في الله وتلاشت { ربّهم بالغداة والعشيّ } أي: يخصونه بالعبادة دائماً بحضور القلب وشهود الروح وتوجه السرّ إليه، لا يريدون بالعبادة إلا ذاته بالمحبة الأزلية لا يجعلون عبادتهم معللة بغرض من توقع ثواب جنة أو خوف عقاب أو نقمة، ولا يريدونه بمحبة الصفات فتتغير إرادتهم باختلاف تجلياتها ولا يستحلون توسيط ذاته في مقصد أو مطلب بل شاهدوا فناء الوسائط والوسائل فيه ولم يبق في شهودهم شيء يقع نظرهم عليه حتى ذواتهم { ما عليك من حِسَابهم } فيما يعملون من شيء، أي: لا واسطة بينهم وبين ربّهم من ملك أو نبيّ فلست من دعوتهم إلى طاعة أو إلى جهاد أو إلى غير ذلك في شيء، فحسابهم على الله إذ عملهم ليس إلا بالله وفي الله { وما من حسابك عليهم من شيء } أي: لا يخوضون في أمور دعوتك بنصر وإعانة للإسلام ولا بدفع وقمع للكفر لاشتغالهم بالله عما سواه ودوام حضورهم كما قال تعالى:\n\n[المعارج، الآية: 23] لا يعنيهم شأن من أمرك ونبوّتك { فتطردهم } عما هم عليه من دوام الحضور بإنهاضهم لشغل ديني أو مصلحة أو تشوّش وقتهم وجمعيتهم { فتكون من الظالمين }  { وكذلك فتنّا } أي: مثل ذلك الفتن والابتلاء العظيم فتنّا { بعضهم } وهم المحجوبون بالبعض، فإن المحجوبين لما لم يروا منهم إلا صورتهم وسوء حالهم في الظاهر وفقرهم ومسكنتهم، ولم يروا قدرهم ومرتبتهم وحسن حالهم في الباطن، استحقروهم وازدرتهم أعينهم بالنسبة إلى ما هم فيه من المال والجاه والتنعم وخفض العيش فقالوا فيهم:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما أرسلناك يا أكمل الرسل، لتزويج الحق وتقوية أهله { لاَ تَطْرُدِ } لا تبعد عن عندك { ٱلَّذِينَ يَدْعُونَ رَبَّهُمْ بِٱلْغَدَاةِ } أي: في جميع أوقات النهار { وَٱلْعَشِيِّ } أي: في جميع أوقات الليل، وبالجملة: يستغرقون جميع أوقاتهم بالتوجه نحوه سبحانه إنما { يُرِيدُونَ } بتوجههم غير أن يطالعوا { وَجْهَهُ } الكريم بسبب ميلك إلى أيمان أهل الأهواء ومصاحبتهم ومجالستهم، مع أنهم ليسوا من أهل الفلاح ولا قابلين له بل { مَا عَلَيْكَ مِنْ حِسَابِهِم } وإيمانهم { مِّن شَيْءٍ } يعود إليه نفعه { وَمَا مِنْ حِسَابِكَ } وإيمانك { عَلَيْهِمْ مِّن شَيْءٍ } بل كل منك، ومنهم مجزي بما عمل ومسئول عما فعل { فَتَطْرُدَهُمْ } أي: هؤلاء المؤمنين المريدين وجه الكله في جميع أوقاتهم وحالاتهم؛ لأجل أولئك المنهمكين في الضلال { فَتَكُونَ } بواسطة طردهم وتبعيدهم { مِنَ ٱلظَّالِمِينَ } [الأنعام: 52] الخارجين عن مقتضى العقل والشرع والمرءوة\n\n\n\n\n \" روي أن قريشاً قالوا: لو طردت يا محمد هؤلاء السلفة - أرادوا عماراً وصهيباً وسلمان وغيرهم - جلسنا إليك وحدثنا معك فقال صلى الله عليه وسلم: \" وما أنا بطارد المؤمنين \"\n \n\n \n\n قالوا: فأقمهم من مجلسنا إن جلسنا معك\n \n\n \n\n قال له عمر رضي الله عنه: لو فعلت حتى تنظر ماذا يصيرون، فقبل صلى الله عليه وسلم\n \n\n \n\n قالوا: فاكتب بذلك كتاباً، فدعا بالصحيفة وبعلي ليكتب فنزلت \" \n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { فتطردهم }: جواب النفي، و { فتكون }: جواب النهي، أي: ولا تطرد فتكون من الظالمين، فليس عليك من حسابهم شيء فتطردهم\n يقول الحقّ جلّ جلاله: لنبيه ـ عليه الصلاة والسلام ـ، حين طلب منه صناديدُ قريش أن يطرد عنه ضعفاء المسلمين ليجالسوه، فَهَمَّ بذلك طمعًا في إسلامهم، فنزلت: { ولا تطرد الذين يدعون ربهم } أي: يعبدونه بالذكر وغيره، أو يدعونه بالتضرع والابتهال، { بالغداة والعشي } أي: على الدوام\n وخص الوقتين بالذكر لشرفهما\n وفي الخبر:\n\n \" يا ابنَ آدمَ، اذكُرني أول النهار وآخره، أكفِكَ ما بينهما \" \n\nوقيل: صلاة الصبح والعصر، وقيل: الصلاة بمكة قبل فرض الخمس\n قال البيضاوي: بعد ما أمره بإنذار غير المتقين ليتقوا ـ أي: على التفسير الثاني في الآية المتقدمة ـ أمره بإكرام المتقين وتقريبهم، وألاَّ يطردَهم، ترضية لقريش، رُوِي أنهم قالوا: لو طَردتَ هؤلاء الأعبُدِ ـ يُعنُون فقراء المُسلِمِينَ، كعمَّار وصُهَيب وخبَّاب وبِلال وسَلمان ـ جلَسنا إليك، فقال:\n\n \" ما أنا بطاردِ المؤمنين \" \n\nقالوا: فأقمهُم عنا، قال:\n\n \" نَعَم \" \n\n[ رُوِي أن عمر قال له: لَو فَعَلتَ حتَّى تنظرَ إلى ما يَصِيرُونَ؟] قالوا: فاكتُب بِذَلِكَ كِتَابًا، فدَعَا بالصَّحِيفَةِ وبَعَليٍّ ليَكتُبَ، فنزلت\n هـ\n وفي ذكر سلمان معهم نظر لتأخر إسلامه بالمدينة\n ثم وصفهم بالإخلاص فقال: { يريدون وجهه } أي: يدعونه مخلصين طالبين النظر لوجهه، وفيه تنبيه على أن الإخلاص شرط في الأعمال، ورتب النهي عليه إشعارًا بأنه يقتضي إكرامهم، وينافي إبعادهم، ثم علل عدم طردهم فقال: { ما عليك من حسابهم من شيء وما من حسابك عليهم من شيء فتطردهم } أي: أنت لا تحاسب عنهم، وهم لا يحاسبون عنك، فلأي شيء تطردهم؟ وقيل: الضمير: للكفار، أي: أنت لا تحاسب عنهم، وهم لا يحاسبون عنك، فلا تهتم بأمرهم، حتى تطرد هؤلاء من أجلهم، { فتكون من الظالمين } بطردهم، لكنه ـ عليه الصلاة والسلام ـ لم يفعل، فلا ظلم يلحقه في ذلك لسابق العناية والعصمة",
      "translations": []
    }
  ]
}