{
  "chapter": "الأنعام",
  "text": "وكذلك فتنا بعضهم ببعض ليقولوا۟ اهؤلاء من الله عليهم منۢ بيننا اليس الله باعلم بالشكرين",
  "translations": [
    {
      "translation": "In this way We try some of them by means of others so that they say, 'Are these the people among us to whom Allah has shown His favour?' Does not Allah know best those who are thankful?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We try men through one another so that they may ask: \"Are these the ones of all of us who have been favoured by God?\" Does God not know who are the grateful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have made some of them a means for testing others so that they should say: 'Are these theones among us upon whom Allah has bestowed His favour?' Yes, does Allah not know well who are the thankful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We test some of them by the conditions of the others so that the rich and proud ones (seeing your poor and humble followers) would say, \"Are these the ones from among all of us whom God has chosen to favor?\" Does not God know those who give thanks (much better than others do).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And similarly We have made some as a trial for others – that the wealthy disbelievers upon seeing the needy Muslims say, “Are these whom Allah has favoured among us?” Does not Allah recognise those who are thankful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have tried some of them with others, that they might say: \"Is it these (poor believers) that Allah has favored from amongst us\" Does not Allah know best those who are grateful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We try some of them by others so that they say: Are these they upon whom Allah has conferred benefit from among us? Does not Allah best know the grateful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even so We have tried some of them by others that they may say, Are these the ones God has been gracious to among us?' Knows not God very well the thankful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even so do We try some of them by others, that they say: Are these they whom Allah favoureth among us? Is not Allah best Aware of the thanksgivers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this way We try some of them by means of others, so that they may ask, \"Are these [lowly ones] whom God has singled out for His favours from among us? Does God not know best who are the grateful ones?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Thus We have tried some of them by means of others, that they might say: are those they whom God hath favoured amongst us? Is not Allah the Best Knower of the thankful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We test them by means of one another so that they should say, ‘Are these the ones whom Allah has favoured from among us?!’ Does not Allah know best the grateful?!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus did We try some of them by comparison with others, that they should say: \"Is it these then that Allah hath favoured from amongst us?\" Doth not Allah know best those who are grateful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have tried some of them with others, that they might say: \"Is it these (poor believers) that Allah has favoured from amongst us?\" Does not Allah know best those who are grateful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As such We have made some of them a means for testing others, so that they should say: 'Are those whom Allah favors amongst us' But does not Allah best know the thankful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We try some of them by means of others, that they may say, “Are these the ones whom God has favored from among us?” Is God not aware of the appreciative?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have tried some of them through others that the disbelievers might say, \"Is it these whom Allah has favored among us?\" Is not Allah most knowing of those who are grateful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:53] And even so We have tried, We have tested, some of them by others, that is, the noble one by the commoner, the rich man by the poor man, preferring the [latter] one by giving [him] precedence in [attaining] faith, so that they, the noble ones and the rich, may say, in disavowal, ‘Are these, the poor, the ones whom God has favoured from among us?’, with guidance? In other words [so that they may say]: if what they follow is [true] guidance, they would not have preceded us [in attaining it]. God, exalted be He, says: Is God not best aware of those who are thankful?, to Him, to guide them? Indeed [He is].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And even so) thus (do We try) test (some of them by others) the Arab by the client and the noble by the lowly person. This was revealed about 'Uyaynah Ibn Hisn al-Fazari, 'Utbah and Shaybah the sons of Rabi'ah, Umayyah Ibn Khalaf al-Jumahi, al-Walid Ibn al-Mughirah al-Makhzumi, Abu Jahl Ibn Hisham, Suhayl Ibn 'Amr and their likes among the leaders of the Quraysh who were tested by the clients, (that they) i.e. 138 'Uyaynah Ibn Hisn al-Fazari and his lot (say: Are these) i.e. Salman and his fellow believers (they whom Allah favoureth) with faith (among us? Is not Allah best aware of the thanksgivers) of the believers, those who deserve such favour?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أهؤلاء منّ الله عليهم من بيننا } بالهداية استخفافاً وهم والله الأطيبون عيشاً، الأرفعون حالاً ومنزلاً، الأعظمون قدراً ورتبة عند الله وعند من يعرفهم كما قال نوح عليه السلام:\n\n[هود، الآية: 31] بل الخير كل الخير ما آتاهم الله { أليس الله بأعلم بالشاكرين } الذين يشكرونه بالحقيقة باستعمال نعمة وجودهم وصفاتهم وجوارحهم وما يقوم به من أرزاقهم ومعايشهم في طاعة الله فشكروه بإزاء النعمة الخارجية بالعبادة وتصوّرها من المنعم وصرفها في مراضي الله، وبإزاء نعمة الجوارح باستعمالها في عبادته وسلوك طريقه وتحصيل معرفته ومعرفة صفاته، وبإزاء نعمة الصفات بمحوها في الله والاعتراف بالعجز عن معرفته وشكره وعبادته، وبإزاء نعمة الوجود بالفناء في عين الشهود حتى شكر الله سعيهم بالوجود الموهوب الحقاني، وعلمهم أنه الشاكر المشكور لنفسه بنفسه، لا يقدر على شكره أحد إلا هو، فقالوا: سبحانك ما عرفناك حق معرفتك، سبحانك ما عبدناك حق عبادتك، وذلك هو علمه بشكرهم وجزاؤه منه\n\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَذٰلِكَ فَتَنَّا بَعْضَهُمْ بِبَعْضٍ } أي: مثلما فتنا بعض الناس ببعض في الأمور المتعلقة بمعاش الدنيا من المال والجاه والرئاسة، فتناهم في أمور دنيهم أيضاً { لِّيَقُولوۤاْ } من غاية استبعادهم واستحقارهم: { أَهَـٰؤُلاۤءِ } الضعفاء الفقراء { مَنَّ ٱللَّهُ عَلَيْهِم مِّن بَيْنِنَآ } قال سبحانه توبيخاً وتقريعاً لهم: بل هم أولئك الفقراء الصابرون على بلاء الله، الشاكرون لنعمائه { أَلَيْسَ ٱللَّهُ } العالم بضمائر عباده { بِأَعْلَمَ بِٱلشَّٰكِرِينَ } [الأنعام: 53] الصابرين منهم ومنكم أيها لشرفاء الكافرون لنعمه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكذلك فتنا بعضهم ببعض } أي: ومثل ذلك الاختبار، وهو اختلاف أحوال الناس في أمر الدنيا، { فتنا بعضهم ببعض } أي: ابتلينا بعضهم ببعض في أمر الدين، فقدّمنا هؤلاء الضعفاء على أشراف قريش بالسبق إلى الإيمان { ليقولوا أهؤلاء مَنَّ الله عليهم من بيننا } أي: أهؤلاء من أنعم الله عليهم بالهداية والتوفيق دوننا، ونحن الأكابر والرؤساء، وهم المساكين والضعفاء، فنحن أحق منهم به إن كان حقًا، وهذا إنكار منهم لأن يخص هؤلاء من بينهم بإصابة الحق والسبق إلى الخير، كقولهم\n\n[الأحقاف:11]\n واللام في { ليقولوا }: للعاقبة\n قال تعالى في الرد عليهم: { أليس الله بأعلم بالشاكرين } أي: بمن يقع منهم الإيمان والشكر فيوفقهم، وبمن لا يقع منه فيخذُله\n\n\nوبالله التوفيق\n الإشاره: في صحبة الفقراء خيرٌ كثير وسرٌ كبير، وخصوصًا أهل الصفاء والوفاء منهم، وفي ذلك يقول الشيخ أبو مدين رضي الله عنه:\n\nإلى آخر كلامه\n فلا يحصل كمال التربية والتهذيب إلا بصحبتهم، ولا تصفوا المعاني إلا بمجالستهم والمذاكرة معهم، والمراد من دخل منهم بلاد المعاني، وحصَّل مقام الفناء في الذات، فالجلوس مع هؤلاء ساعة تعدل عبادة الثقلين سِنين، ومن شأن شيوخ التربية: العطف على الفقراء والمساكين وتقريبهم، ولا يطردون أحدًا منهم ولو عمل ما عمل، اقتداء بما أمر به نبيهم صلى الله عليه وسلم\n بل شأنهم الإقبال على من أقبل إليهم، عصاة كانوا أو طائعين وإقبالهم على العصاة المذنبين أكثر، جبرًا لكسرهم، وتألفًا لهم، وسوقًا لهم إلى الله بملاطفة الإحسان\n وبالله التوفيق\n ولما أمره بتقريب الضعفاء من المؤمنين، أمره بإكرامهم بالسلام والبشارة بغفران الآثام، فقال: { وَإِذَا جَآءَكَ ٱلَّذِينَ يُؤْمِنُونَ بِآيَاتِنَا }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:6",
      "similarity": 0.5072958898773965
    },
    {
      "verse": "68:3",
      "similarity": 0.4789464895158539
    },
    {
      "verse": "49:17",
      "similarity": 0.4600172242259212
    },
    {
      "verse": "41:8",
      "similarity": 0.451190144204704
    },
    {
      "verse": "84:25",
      "similarity": 0.44834599507479767
    }
  ]
}