{
  "chapter": "الأنعام",
  "text": "وكذلك فتنا بعضهم ببعض ليقولوا۟ اهؤلاء من الله عليهم منۢ بيننا اليس الله باعلم بالشكرين",
  "translations": [
    {
      "translation": "In this way We try some of them by means of others so that they say, 'Are these the people among us to whom Allah has shown His favour?' Does not Allah know best those who are thankful?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We try men through one another so that they may ask: \"Are these the ones of all of us who have been favoured by God?\" Does God not know who are the grateful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have made some of them a means for testing others so that they should say: 'Are these theones among us upon whom Allah has bestowed His favour?' Yes, does Allah not know well who are the thankful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We test some of them by the conditions of the others so that the rich and proud ones (seeing your poor and humble followers) would say, \"Are these the ones from among all of us whom God has chosen to favor?\" Does not God know those who give thanks (much better than others do).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And similarly We have made some as a trial for others – that the wealthy disbelievers upon seeing the needy Muslims say, “Are these whom Allah has favoured among us?” Does not Allah recognise those who are thankful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have tried some of them with others, that they might say: \"Is it these (poor believers) that Allah has favored from amongst us\" Does not Allah know best those who are grateful\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We try some of them by others so that they say: Are these they upon whom Allah has conferred benefit from among us? Does not Allah best know the grateful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even so We have tried some of them by others that they may say, Are these the ones God has been gracious to among us?' Knows not God very well the thankful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even so do We try some of them by others, that they say: Are these they whom Allah favoureth among us? Is not Allah best Aware of the thanksgivers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this way We try some of them by means of others, so that they may ask, \"Are these [lowly ones] whom God has singled out for His favours from among us? Does God not know best who are the grateful ones?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Thus We have tried some of them by means of others, that they might say: are those they whom God hath favoured amongst us? Is not Allah the Best Knower of the thankful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We test them by means of one another so that they should say, ‘Are these the ones whom Allah has favoured from among us?!’ Does not Allah know best the grateful?!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus did We try some of them by comparison with others, that they should say: \"Is it these then that Allah hath favoured from amongst us?\" Doth not Allah know best those who are grateful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We have tried some of them with others, that they might say: \"Is it these (poor believers) that Allah has favoured from amongst us?\" Does not Allah know best those who are grateful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As such We have made some of them a means for testing others, so that they should say: 'Are those whom Allah favors amongst us' But does not Allah best know the thankful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We try some of them by means of others, that they may say, “Are these the ones whom God has favored from among us?” Is God not aware of the appreciative?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We have tried some of them through others that the disbelievers might say, \"Is it these whom Allah has favored among us?\" Is not Allah most knowing of those who are grateful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:53] And even so We have tried, We have tested, some of them by others, that is, the noble one by the commoner, the rich man by the poor man, preferring the [latter] one by giving [him] precedence in [attaining] faith, so that they, the noble ones and the rich, may say, in disavowal, ‘Are these, the poor, the ones whom God has favoured from among us?’, with guidance? In other words [so that they may say]: if what they follow is [true] guidance, they would not have preceded us [in attaining it]. God, exalted be He, says: Is God not best aware of those who are thankful?, to Him, to guide them? Indeed [He is].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالواو استئنافية كما هي في نظائره . والجملة مستأنفة استئنافاً بيانياً لأنّ السامع لمَّا شعر بقصّة أومأ إليها قوله تعالى : { ولا تطرد الذين يدعون ربَّهم } \\[ الأنعام : 52 \\] الآية يأخذه العجب من كبرياء عظماء أهل الشرك وكيف يرضَوْن البقاء في ضلالة تكبّراً عن غشيَان مجلس فيه ضعفاء الناس من الصالحين ، فأجيب بأنّ هذا الخلق العجيب فتنة لهم خلقها الله في نفوسهم بسوء خلُقهم .وقعت هذه الجملة اعتراضاً بين الجملتين المتعاطفتين تعجيلاً للبيان ، وقرنت بالواو للتنبيه على الاعتراض ، وهي الواو الاعتراضية ، وتسمَّى الاستئنافية؛ فبيَّن الله أنّ داعيهم إلى طلب طردهم هو احتقار في حسد؛ والحسد يكون أعظم ما يكون إذا كان الحاسد يرى نفسه أولى بالنعمة المحسود عليها ، فكان ذلك الداعي فتنة عظيمة في نفوس المشركين إذ جمعتْ كبراً وعُجباً وغروراً بما ليس فيهم إلى احتقار للأفاضل وحسد لهم ، وظلم لأصحاب الحق ، وإذ حالت بينهم وبين الإيمان والانتفاع بالقرب من مجلس الرسول صلى الله عليه وسلموالتشبيه مقصود منه التعجيب من المشبّه بأنَّه بلغ الغاية في العجب .واسم الإشارة عائد إلى الفتون المأخوذ من «فتنّا» كما يعود الضمير على المصدر في نحو { اعدلوا هو أقرب للتقوى } ، أي فتنّا بعضهم ببعض فتوناً يرغب السامع في تشبيهه وتمثيله لتقريب كنهه فإذا رام المتكلّم أن يقرّبه له بطريقة التشبيه لم يجد له شبيهاً في غرائبه وفظاعته إلاّ أن يشبّهه بنفسه إذ لا أعجب منه ، على حدّ قولهم : والسفاعة كاسمها .وليس ثمّة إشارة إلى شيء متقدّم مغاير للمشبّه . وجيء باسم إشارة البعيد للدلالة على عظم المشار إليه . وقد تقدّم تفصيل مثل هذا التشبيه عند قوله تعالى : { وكذلك جعلناكم أمّة وسطاً } في سورة \\[ البقرة : 143 \\].والمراد بالبعض المنصوب المشركون فهم المفتونون ، وبالبعض المجرور بالباء المؤمنون ، أي فتنَّا عظماءَ المشركين في استمرار شركهم وشِرْك مقلِّديهم بحال الفقراء من المؤمنين الخالصين كما دلّ عليه قوله : { لِيَقولوا أهؤلاء منّ الله عليهم من بيننا } \\[ الأنعام : 53 \\] فإنّ ذلك لا يقوله غير المشركين ، وكما يؤيِّده قوله تعالى في تذييله { أليس الله بأعلمَ بالشاكرين }.والقول يحتمل أن يكون قولاً منهم في أنفسهم أو كلاماً قالوه في مَلئهم . وأيّاً ما كان فهم لا يقولونه إلاّ وقد اعتقدوا مضمونه ، فالقائلون { أهؤلاء مَنّ الله عليهم } هم المشركون .واللام في قوله : { ليقولوا } لام التعليل ، ومدخولها هو أثرُ العلّة دالّ عليها بعد طيِّها على طريقة الإيجاز . والتقدير : فتنَّاهم ليَرَوْا لأنفسهم شفوفاً واستحقاقاً للتقدّم في الفضائل اغتراراً بحال الترفّه فيعجبوا كيف يُدعى أنّ الله يمنّ بالهدى والفضل على ناس يرونهم أحطّ منهم ، وكيف يُعَدّونهم دونَهم عند الله ، وهذا من الغرور والعُجب الكاذب . ونظيره في طيّ العلَّة والاقتصار على ذكر أثرها قول إياس بن قبيصة الطائي :وأقدمتُ والخَطِّيُّ يَخطِرُ بَيْنَنَا ... لأعْلَمَ مَنْ جَبَانُهَا من شُجاعهاأي ليظهر الجَبَان والشجاع فأعلَمَهُمَا .والاستفهام مستعمل في التعجّب والإنكار ، كما هو في قوله { أألقي الذكرُ عليه من بيننا } \\[ القمر : 25 \\]. والإشارة مستعملة في التحقير أو التعجيب كما هي في قوله تعالى حكاية عن قول المشركين { أهذا الذي يذكر آلهتكم } في سورة \\[ الأنبياء : 36 \\].وتقديم المسند إليه على الخبر الفعلي لقصد تقوية الخبر .وقولهم : مَنّ الله عليهم } قالوه على سبيل التهكّم ومجاراة الخصم ، أي حيث اعتقد المؤمنون أنّ الله منّ عليهم بمعرفة الحق وحَرم صناديد قريش ، فلذلك تعجَّب أولئك من هذا الاعتقاد ، أي كيف يُظنّ أنّ الله يمنّ على فقراء وعبيد ويترك سادة أهل الوادي . وهذا كما حكى الله عنهم { وقالوا لولا نُزّل هذا القرآن على رجل من القريتين عظيم } \\[ الزخرف : 31 \\]. وهذه شنشنة معروفة من المستكبرين والطغاة . وقد حدث بالمدينة مثل هذا . روى البخاري أنّ الأقرع بن حابس جاء إلى رسول الله صلى الله عليه وسلم فقال : إنّما بايعَك سُرّاقُ الحجيج مِنْ أسْلَمَ وغِفار ومُزَيْنَة وجُهَيْنَة فقال له رسول الله : أرأيْتَ إنْ كانت أسْلَمُ وغِفَارُ ومزينةُ وجهينةُ خيراً من بني تميم وبني عامر وأسد وغطفانُ أخابوا وخسروا ( أي أخاب بنو تميم ومن عُطف عليهم ) فقال : نعم قال : فَوالذي نفسي بيده إنّهم لَخير منهم .وفي الآية معنى آخر ، وهو أن يكون القول مضمراً في النفس ، وضميرُ { ليقولوا } عائداً إلى المؤمنين الفقراء ، فيكونوا هم البعض المفتونين ، ويكون البعض المجرور بالباء صادقاً على أهل النعمة من المشركين ، وتكون إشارة { هؤلاء } راجعة إلى عظماء المشركين ويكون المراد بالمَنّ إعطاء المال وحُسْن حال العيش ، ويكون الاستفهام مستعملاً في التحيّر على سبيل الكناية ، والإشارةُ إلى المشركين معتبر فيها ما عرفوا به من الإشراك وسوء الاعتقاد في الله . والمعنى : وكذلك الفتوننِ الواقع لِعظماء المشركين ، وهو فتون الإعجاب والكبرياء حين ترفّعوا عن الدخول فيما دخل فيه الضعفاء والعبيد من تصديق محمد صلى الله عليه وسلم وصحبته استكباراً عن مساواتهم ، كذلك كان فتون بعض آخر وهم بعض المؤمنين حين يشاهدون طيب عيش عظماء المشركين في الدنيا مع إشراكهم بربِّهم فيعجبون كيف منّ الله بالرزق الواسع على من يكفرون به ولم يمُنّ بذلك على أوليائه وهم أولى بنعمة ربِّهم . وقد أعرض القرآن عن التصريح بفساد هذا الخاطر النفساني اكتفاء بأنَّه سمَّاه فتنة ، فعلم أنّه خاطر غير حقّ ، وبأنّ قوله : { أليس الله بأعلم بالشاكرين } مشير إلى إبطال هذه الشبهة . ذلك بأنَّها شبهة خلطت أمر شيئين متفارقين في الأسباب ، فاشتبه عليهم الجزاء على الإيمان وما أعدّ الله لأهله من النعيم الخالد في الآخرة ، المترتِّب عليه ترتّب المسبّب على السبب المجعول عن حكمة الله تعالى ، بالرزق في الدنيا المترتِّب على أسباب دنيوية كالتجارة والغزو والإرث والهبات .فالرزق الدنيوي لا تسبّب بينه وبين الأحوال القلبية ولكنّه من مسبّبات الأحوال الماديَّة فالله أعلم بشكر الشاكرين ، وقد أعدّ لهم جزاء شكرهم ، وأعلمُ بأسباب رزق المرزوقين المحْظوظين . فالتخليط بين المقامين من ضعف الفكر العارض للخواطر البشرية والناشىء عن سوء النظر وترك التأمّل في الحقائق وفي العلل ومعلولاتها . وكثيراً ما عرضت للمسلمين وغيرهم شُبه وأغلاط في هذا المعنى صرفتهم عن تطلّب الأشياء من مظانّها وقعدت بهم عن رفْو أخْلالهم في الحياة الدنيا أو غرّتْهُم بالتفريط فيما يجب الاستعداد له كل ذلك للتخليط بين الأحوال الدينية الأخروية وبين السنن الكونية الدنيوية ، كما عرض لابن الراوندي من حيرة الجهل في قوله :كَمْ عالممٍ عَالم أعْيَتْ مذاهبُه ... وجَاهللٍ جاهللٍ تلقّاه مرزوقاًهَذا الذي ترك الأوْهَامَ حائِرَةً ... وصَيَّرَ العالم النِّحْرير زنديقاًولا شكّ أنّ الذين استمعوا القرآن ممّن أنزل عليه صلى الله عليه وسلم قد اهتدوا واستفاقوا ، فمن أجل ذلك تأهَّلوا لامتلاك العالم ولاَقُوا .و { مِنْ } في قوله { مِنْ بيننا } ابتدائية . و ( بين ) ظرف يدلّ على التوسّط ، أي مَنّ الله عليهم مختاراً لهم من وسطنا ، أي منّ عليهم وتركنا ، فيؤول إلى معنى من دوننا .وقوله : { أليس الله بأعلمَ بالشاكرين } تذييل للجملة كلّها ، فهو من كلام الله تعالى وليس من مقول القول ، ولذلك فصل . والاستفهام تقريري . وعديّ { أعلَمَ } بالباء لأنَّه بصيغة التفضيل صار قاصراً . والمعنى أنّ الله أعلم بالشاكرين من عباده فلذلك منّ على الذين أشاروا إليه بقولهم : { أهؤلاء مَنّ الله عليهم } بمنَّة الإيمان والتوفيق .ومعنى علمه تعالى بالشاكرين أنَّه أعلم بالذين جاءوا إلى الرسول صلى الله عليه وسلم مستجيبين لدعوته بقريحة طالبين النجاة من الكفر راغبين في حسن العاقبة ، فهو يلطف بهم ويسهِّل لهم الإيمان ويحبِّبه إليهم ويزيّنه في قلوبهم ويزيدهم يوماً فيوماً تمكّناً منه وتوفيقاً وصلاحاً ، فهو أعلم بقلوبهم وصدقهم من الناس الذين يحسبون أنّ رثاثة حال بعض المؤمنين تطابق حالة قلوبهم في الإيمان فيأخذون الناس ببزّاتهم دون نيَّاتهم . فهذا التذييل ناظر إلى قوله : { إنّما يستجيب الذين يسمعون } \\[ الأنعام : 36 \\].وقد عُلم من قوله : { أليس الله بأعلم بالشاكرين } أنَّه أيضاً أعلم بأضدادهم . ضدّ الشكر هو الكفر ، كما قال تعالى : { لئن شكرتم لأزيدنَّكم ولئن كفرتم إنّ عذابي لشديد } \\[ إبراهيم : 7 \\] فهو أعلم بالذين يأتون الرسول عليه الصلاة والسلام مستهزئين متكبِّرين لا هَمّ لهم إلاّ تحقير الإسلام والمسلمين ، وقد استفرغوا وسعهم ولبّهم في مجادلة الرسول صلى الله عليه وسلم وتضليل الدهماء في حقيقة الدين . ففي الكلام تعريض بالمشركين .\n\n",
      "translations": [
        {
          "translation": "(And even so) thus (do We try) test (some of them by others) the Arab by the client and the noble by the lowly person. This was revealed about 'Uyaynah Ibn Hisn al-Fazari, 'Utbah and Shaybah the sons of Rabi'ah, Umayyah Ibn Khalaf al-Jumahi, al-Walid Ibn al-Mughirah al-Makhzumi, Abu Jahl Ibn Hisham, Suhayl Ibn 'Amr and their likes among the leaders of the Quraysh who were tested by the clients, (that they) i.e. 138 'Uyaynah Ibn Hisn al-Fazari and his lot (say: Are these) i.e. Salman and his fellow believers (they whom Allah favoureth) with faith (among us? Is not Allah best aware of the thanksgivers) of the believers, those who deserve such favour?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أهؤلاء منّ الله عليهم من بيننا } بالهداية استخفافاً وهم والله الأطيبون عيشاً\n الأرفعون حالاً ومنزلاً\n الأعظمون قدراً ورتبة عند الله وعند من يعرفهم كما قال نوح عليه السلام:\n[هود\n الآية: 31] بل الخير كل الخير ما آتاهم الله { أليس الله بأعلم بالشاكرين } الذين يشكرونه بالحقيقة باستعمال نعمة وجودهم وصفاتهم وجوارحهم وما يقوم به من أرزاقهم ومعايشهم في طاعة الله فشكروه بإزاء النعمة الخارجية بالعبادة وتصوّرها من المنعم وصرفها في مراضي الله\n وبإزاء نعمة الجوارح باستعمالها في عبادته وسلوك طريقه وتحصيل معرفته ومعرفة صفاته\n وبإزاء نعمة الصفات بمحوها في الله والاعتراف بالعجز عن معرفته وشكره وعبادته\n وبإزاء نعمة الوجود بالفناء في عين الشهود حتى شكر الله سعيهم بالوجود الموهوب الحقاني\n وعلمهم أنه الشاكر المشكور لنفسه بنفسه\n لا يقدر على شكره أحد إلا هو\n فقالوا: سبحانك ما عرفناك حق معرفتك\n سبحانك ما عبدناك حق عبادتك\n وذلك هو علمه بشكرهم وجزاؤه منه",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَذٰلِكَ فَتَنَّا بَعْضَهُمْ بِبَعْضٍ } أي: مثلما فتنا بعض الناس ببعض في الأمور المتعلقة بمعاش الدنيا من المال والجاه والرئاسة\n فتناهم في أمور دنيهم أيضاً { لِّيَقُولوۤاْ } من غاية استبعادهم واستحقارهم: { أَهَـٰؤُلاۤءِ } الضعفاء الفقراء { مَنَّ ٱللَّهُ عَلَيْهِم مِّن بَيْنِنَآ } قال سبحانه توبيخاً وتقريعاً لهم: بل هم أولئك الفقراء الصابرون على بلاء الله\n الشاكرون لنعمائه { أَلَيْسَ ٱللَّهُ } العالم بضمائر عباده { بِأَعْلَمَ بِٱلشَّٰكِرِينَ } [الأنعام: 53] الصابرين منهم ومنكم أيها لشرفاء الكافرون لنعمه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكذلك فتنا بعضهم ببعض } أي: ومثل ذلك الاختبار\n وهو اختلاف أحوال الناس في أمر الدنيا\n { فتنا بعضهم ببعض } أي: ابتلينا بعضهم ببعض في أمر الدين\n فقدّمنا هؤلاء الضعفاء على أشراف قريش بالسبق إلى الإيمان { ليقولوا أهؤلاء مَنَّ الله عليهم من بيننا } أي: أهؤلاء من أنعم الله عليهم بالهداية والتوفيق دوننا\n ونحن الأكابر والرؤساء\n وهم المساكين والضعفاء\n فنحن أحق منهم به إن كان حقًا\n وهذا إنكار منهم لأن يخص هؤلاء من بينهم بإصابة الحق والسبق إلى الخير\n كقولهم\n[الأحقاف:11]\n واللام في { ليقولوا }: للعاقبة\n قال تعالى في الرد عليهم: { أليس الله بأعلم بالشاكرين } أي: بمن يقع منهم الإيمان والشكر فيوفقهم\n وبمن لا يقع منه فيخذُله\n\nوبالله التوفيق\n الإشاره: في صحبة الفقراء خيرٌ كثير وسرٌ كبير\n وخصوصًا أهل الصفاء والوفاء منهم\n وفي ذلك يقول الشيخ أبو مدين رضي الله عنه:\nإلى آخر كلامه\n فلا يحصل كمال التربية والتهذيب إلا بصحبتهم\n ولا تصفوا المعاني إلا بمجالستهم والمذاكرة معهم\n والمراد من دخل منهم بلاد المعاني\n وحصَّل مقام الفناء في الذات\n فالجلوس مع هؤلاء ساعة تعدل عبادة الثقلين سِنين\n ومن شأن شيوخ التربية: العطف على الفقراء والمساكين وتقريبهم\n ولا يطردون أحدًا منهم ولو عمل ما عمل\n اقتداء بما أمر به نبيهم صلى الله عليه وسلم\n بل شأنهم الإقبال على من أقبل إليهم\n عصاة كانوا أو طائعين وإقبالهم على العصاة المذنبين أكثر\n جبرًا لكسرهم\n وتألفًا لهم\n وسوقًا لهم إلى الله بملاطفة الإحسان\n وبالله التوفيق\n ولما أمره بتقريب الضعفاء من المؤمنين\n أمره بإكرامهم بالسلام والبشارة بغفران الآثام\n فقال: { وَإِذَا جَآءَكَ ٱلَّذِينَ يُؤْمِنُونَ بِآيَاتِنَا }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:6",
      "similarity": 0.5072958898773965
    },
    {
      "verse": "68:3",
      "similarity": 0.4789464895158539
    },
    {
      "verse": "49:17",
      "similarity": 0.4600172242259212
    },
    {
      "verse": "41:8",
      "similarity": 0.451190144204704
    },
    {
      "verse": "84:25",
      "similarity": 0.44834599507479767
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006053.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006053.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:53.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}