{
  "chapter": "الأنعام",
  "text": "واذا جاءك الذين يؤمنون بـايتنا فقل سلم عليكم كتب ربكم على نفسه الرحمة انه من عمل منكم سوءۢا بجهلة ثم تاب منۢ بعده واصلح فانه غفور رحيم",
  "translations": [
    {
      "translation": "When those who have iman in Our Signs come to you, say, 'Peace be upon you!' Your Lord has made tawba and puts things right, He is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who believe in Our revelations come to you, say to them: \"Peace on you.\" Your Lord has prescribed grace for Himself, so that in case one of you commits evil out of ignorance, then feels repentant and reforms, He may be forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who believe in Our signs come to you, say to them: 'Peace be upon you. Your Lord has made mercy incumbent upon Himself so that if anyone of you does a bad deed out of ignorance and thereafter repents and makes amends, surely you will find Him All-Forgiving, AllCompassionate.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the faithful come to you, say to them, \"Peace be upon you. Your Lord has decreed for Himself to be All-merciful. Anyone of you who commits a sin out of ignorance, then repents, and reforms himself will find that God is All-forgiving and All-merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who believe in Our signs come humbly in your presence, say to them, “Peace be upon you – your Lord has prescribed mercy for Himself by His grace – that whoever among you commits a sin by folly and thereafter repents and reforms (himself), then indeed Allah is Oft Forgiving, Most Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who believe in Our Ayat come to you, say: \"Salamun `Alaykum\" (peace be on you); your Lord has written mercy for Himself, so that, if any of you does evil in ignorance, and thereafter repents and does righteous good deeds, then surely, He is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who believe in Our communications come to you, say: Peace be on you, your Lord has ordained mercy on Himself, (so) that if any one of you does evil in ignorance, then turns after that and acts aright, then He is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who believe in Our signs come to thee, say, 'Peace be upon you. Your Lord has prescribed for Himself mercy. Whosoever of you does evil in ignorance, and thereafter repents and makes amends, He is All-forgiving, All-compassionate.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who believe in Our revelations come unto thee, say: Peace be unto you! Your Lord hath prescribed for Himself mercy, that whoso of you doeth evil through ignorance and repenteth afterward thereof and doeth right, (for him) lo! He is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who believe in Our revelations come to you, say, \"Peace be upon you. Your Lord has taken it upon Himself to be merciful. So that if any one among you does evil in ignorance and repents thereafter and makes amends, then He is most forgiving and ever merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those who believe in Our signs come unto them, say thou: peace be on you; your Lord hath prescribed mercy for Himself; so that whosoever of you doeth an evil through Ignorance, then repenteth thereafter and amendeth, then verily He is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who have faith in Our signs come to you, say, ‘Peace to you! Your Lord has made mercy incumbent upon Himself: whoever of you commits an evil [deed] out of ignorance and then repents after that and reforms, then He is indeed all-forgiving, all-merciful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those come to thee who believe in Our signs, Say: \"Peace be on you: Your Lord hath inscribed for Himself (the rule of) mercy: verily, if any of you did evil in ignorance, and thereafter repented, and amend (his conduct), lo! He is Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who believe in Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) come to you, say: \"Salamun 'Alaikum\" (peace be on you); your Lord has written Mercy for Himself, so that, if any of you does evil in ignorance, and thereafter repents and does righteous good deeds (by obeying Allah), then surely, He is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who believe in Our verses come to you, say: 'Peace be upon you. Your Lord has decreed Mercy on Himself, if any one of you commits evil through ignorance, and then repents, and mends his ways, then He is Forgiving, the Most Merciful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who believe in Our revelations come to you, say, “Peace be upon you, your Lord has prescribed mercy for Himself. Whoever among you does wrong out of ignorance, and then repents afterwards and reforms—He is Forgiving and Merciful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when those come to you who believe in Our verses, say, \"Peace be upon you. Your Lord has decreed upon Himself mercy: that any of you who does wrong out of ignorance and then repents after that and corrects himself - indeed, He is Forgiving and Merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:54] And when those who believe in Our signs come to you, say, to them: ‘Peace be upon you. Your Lord has prescribed, He has decreed, for Himself mercy, to the effect that, truly (innahu, ‘truly’, may also be read as annahu, ‘that’, as a substitution for al-rahma, ‘mercy’) whoever of you does evil in ignorance, of it when he did it, and repents thereafter, after his [evil] deed, [repents] of it, and makes amends, in his actions — truly He, God, is Forgiving, Merciful’, towards him (a variant reading [for innahu, ‘truly He’] has annahu, ‘then He’), in other words, forgiveness shall be for him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when those who believe in Our revelations) in our Book and Messenger; the reference here is to 'Umar Ibn al-Khattab (come unto thee, say) Muhammad: (Peace be unto you!) Allah has accepted your repentance and excuse (Your Lord hath prescribed for Himself mercy) for anyone who repents, (that whoso of you doeth evil) sins (through ignorance) intentionally even though he did not know its due punishment (and repenteth afterward thereof) and repents of this sin (and doeth right) in relation to that which is between him and his Lord, ((for him) lo! Allah is Forgiving) He overlooks sins, (Merciful) towards him who repents.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِذَا جَآءَكَ } يا أكمل الرسل { ٱلَّذِينَ يُؤْمِنُونَ بِآيَاتِنَا } ويتمثلون بها بالغداة والعشي وهم يريدون وجهنا { فَقُلْ } لهم قبل تسليمهم: { سَلَٰمٌ عَلَيْكُمْ } أيها المقبولون عند الله الراضون المرضيون وبشرهم بأنه { كَتَبَ } أي: قضى وحبب { رَبُّكُمْ } لأجلكم { عَلَىٰ نَفْسِهِ ٱلرَّحْمَةَ } الشفقة والرحمة إلى حيث { أَنَّهُ مَن عَمِلَ مِنكُمْ سُوۤءًا } به يسيء نفسه عند الله صادراً عنه { بِجَهَٰلَةٍ } لا عند قصد وإصرار { ثُمَّ } بعدما علم وخامة عاقبته { تَابَ مِن بَعْدِهِ } واستغفر ربه { وَأَصْلَحَ } بالتوبة ما أفسد بالجهالة { فَأَنَّهُ غَفُورٌ } يستر تلك المعصية عنكم { رَّحِيمٌ } [الأنعام: 54] يقبل توبتكم بسبب إخلاصكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:119",
      "similarity": 0.8597418177324543
    },
    {
      "verse": "4:17",
      "similarity": 0.6826930030871494
    },
    {
      "verse": "7:153",
      "similarity": 0.5410754419404338
    },
    {
      "verse": "39:64",
      "similarity": 0.4880242166222431
    },
    {
      "verse": "3:89",
      "similarity": 0.44170521345103586
    }
  ]
}