{
  "chapter": "الأنعام",
  "text": "وكذلك نفصل الءايت ولتستبين سبيل المجرمين",
  "translations": [
    {
      "translation": "In that way We make the Signs plain so that you may clearly see the path of the evildoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus distinctly do We explain Our signs that the way of sinners may become distinct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We clearly set forth Our signs so that the way of the wicked might become distinct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We explain Our revelations so that the sinful way can be plainly discerned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is how We explain Our verses clearly and so that the way of the criminals become well exposed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We explain the Ayat in detail, that the way of the criminals, may become manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We make distinct the communications and so that the way of the guilty may become clear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We distinguish Our signs, that the sinners' way may be manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We expound the revelations that the way of the unrighteous may be manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We make plain Our signs, so that the path of the evil-doers might be laid bare.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Thus We expound revelations so that the way of the culprits may be shown up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We elaborate the signs, so that the way of the guilty may be exposed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We explain the signs in detail: that the way of the sinners may be shown up.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We explain the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) in detail, that the way of the Mujrimun (criminals, polytheists, sinners), may become manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As such We make plain Our verses, so that the path of the wicked will be clear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We explain the revelations, and expose the path of the unrighteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We detail the verses, and [thus] the way of the criminals will become evident.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:55] And thus, in the same way that We have explained what has been mentioned, We distinguish, We expound, the signs, the Qur’ān, so that truth becomes manifest and is implemented in [people’s] deeds, and that the way, the path, of the sinners may be become clear, evident, and hence avoided (wa-li-yastabīna may also be read wa-li-tastabīna, ‘that you may discern’, with sabīla, ‘the way’, read in the accusative [as opposed to the nominative, sabīlu], implying a direct address to the Prophet [s]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thus do We expound the revelations) We expound the Qur'an, explaining commands, prohibitions as well as their events (that the way of the unrighteous may be manifest) the way of the idolaters, 'Uyaynah and his folk, why it is that they do not believe?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَكَذَلِكَ نفَصِّلُ ٱلآيَاتِ } معناهُ نُميِّزُها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَذَلِكَ نفَصِّلُ } ونوضح { ٱلآيَاتِ } ليظهر طريق التوحيد { وَلِتَسْتَبِينَ } ويتميز { سَبِيلُ ٱلْمُجْرِمِينَ } [الأنعام: 55] المنحرفين عن منهج الرشاد ومسلك السداد عن طريق أهل الحق\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}