{
  "chapter": "الأنعام",
  "text": "قل انى نهيت ان اعبد الذين تدعون من دون الله قل لا اتبع اهواءكم قد ضللت اذا وما انا۠ من المهتدين",
  "translations": [
    {
      "translation": "Say: 'I am forbidden to worship those you call upon besides Allah.' Say: 'I do not follow your whims and desires. If I did I would go astray and not be among the guided.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"I am forbidden to worship those you invoke apart from God.\" And say: \"I will not follow your wishes. If I do, I shall be lost and not be one of those who follow the right path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhanimad!): 'I have been forbidden to serve those to whom you call other than Allah.' Say: 'I do not follow your desires, for were I to do that, I would go astray and would not be of those who are rightly guided.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), tell them, \"I am commanded not to worship the idols instead of God. I do not follow your desires lest I go astray and miss the true guidance\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I have been forbidden to worship those whom you worship other than Allah”; say, “I do not follow your desires – if it were, I would then go astray and not be on the right path.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I have been forbidden to worship those whom you invoke (worship) besides Allah.\" Say: \"I will not follow your vain desires. If I did, I would go astray, and I would not be one of the rightly guided.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: I am forbidden to serve those whom you call upon besides Allah. Say: I do not follow your low desires. for then indeed I should have gone astray and I should not be of those who go aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I am forbidden to serve those you call on apart from God.' Say: 'I do not follow your caprices, or else I had gone astray, and would not be of the right-guided.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: I am forbidden to worship those on whom ye call instead of Allah. Say: I will not follow your desires, for then should I go astray and I should not be of the rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I am forbidden to worship those you call upon besides God.\" Say, \"I do not follow your whims and desires. If I did, I would go astray and cease to be rightly guided.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: verily I am forbidden to worship those whom ye call upon beside Allah. Say thou: I shall not follow your vain desires, for then I shall be gone astray, and shall not remain of the guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘I have been forbidden to worship those whom you invoke besides Allah.’ Say, ‘I do not follow your desires, for then I will have gone astray, and I will not be among the [rightly] guided.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I am forbidden to worship those - others than Allah - whom ye call upon.\" Say: \"I will not follow your wain desires: If I did, I would stray from the path, and be not of the company of those who receive guidance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"I have been forbidden to worship those whom you invoke (worship) besides Allah.\" Say: \"I will not follow your vain desires. If I did, I would go astray, and I would not be one of the rightly guided.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I am forbidden to worship whom you call upon instead of Allah' Say: 'I will not yield to your wishes, for then I should have strayed and should not be of those guided'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I am forbidden from worshiping those you pray to besides God.” Say, “I will not follow your desires; else I would be lost and not be of those guided.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Indeed, I have been forbidden to worship those you invoke besides Allah.\" Say, \"I will not follow your desires, for I would then have gone astray, and I would not be of the [rightly] guided.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:56] Say: ‘Truly I have been forbidden to worship those whom you call upon, [those whom] you worship, besides God.’ Say: ‘I shall not follow your whims, by worshipping them, for then, if I did follow them, verily I would have gone astray and I would not be of the rightly guided’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad to 'Uyaynah and his folk: (I am forbidden) in the Qur'an (to worship those on whom you call) you worship (instead of Allah) i.e. idols. (Say) Muhammad to 'Uyaynah and his folk: (I will not follow your desires) by worshipping idols and repelling Salman and his fellow believers from me, (for then) for if I do that (should I go astray) from guidance (and I should not be of the rightly guided) to that which is right if I were to do so.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فلا { أتبع أهواءَكُم } بعبادتها فأضلّ إذاً باحتجابي بها فلا أهتدي إلى التوحيد ومعنى الماضي أنه تحقق ضلالي على هذا التقدير وما أنا من الهدى في شيء",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n الصارفة عن الميل والتوجه إلى الغير والسوى مطلقاً { أَنْ أَعْبُدَ ٱلَّذِينَ تَدْعُونَ } وتسمون { مِن دُونِ ٱللَّهِ } آلهة باطلة بأهويتكم الفاسدة { قُلْ لاَّ أَتَّبِعُ أَهْوَآءَكُمْ } التي اخترعتموها من تلقاء أنفسكم\n وإن ابتعت بمتابعتكم تلك التماثيل العاطلة { قَدْ ضَلَلْتُ إِذاً وَ } بعدما ظللت { مَآ أَنَاْ مِنَ ٱلْمُهْتَدِينَ } [الأنعام: 56] أصلاً\n أي: في شيء من الهداية كمثلكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { قل } يا محمد: { إني نُهيتُ } أي: نهاني ربي { أن أعبدَ الذين تدعُون } أي: تعبدون { من دون الله } \n أو ما تدعونها آلهة أي: تسمونها بذلك\n وتخضعون لها من دون الله\n { قل } لهم: { لا أتبع أهواءكم } الفاسدة وعقائدكم الزائغة\n { قد ضللتُ } عن الحق { إذًا } أي: إذا اتبعت أهواءكم\n { وما أنا من المهتدين } أي: ما أنا في شيء من الهدى حتى أكون من عدادهم إن اتبعت أهواءكم\n وفيه تعريض بهم\n وأنهم ضالون حائدون عن طريق الهدى\n ليسوا على شيء منها\n { قل إني على بيّنة } أي: طريق واضحة { من ربي } تُوصلني إلى تحقيق معرفته\n واستجلاب رضوانه\n أنا ومن اتبعني",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:29",
      "similarity": 0.5577038451562611
    },
    {
      "verse": "79:40",
      "similarity": 0.5369975160512017
    },
    {
      "verse": "28:50",
      "similarity": 0.5311772685989363
    },
    {
      "verse": "40:66",
      "similarity": 0.5075349906307848
    },
    {
      "verse": "2:145",
      "similarity": 0.4617368309576129
    }
  ]
}