{
  "chapter": "الأنعام",
  "text": "قل انى على بينة من ربى وكذبتم به ما عندى ما تستعجلون به ان الحكم الا لله يقص الحق وهو خير الفصلين",
  "translations": [
    {
      "translation": "Say: 'I stand on a Clear Sign from my Lord and yet you have denied it. I do not have in my possession what you are in such haste to bring about. Jurisdiction over it belongs to Allah alone. He tells the truth and He is the Best of Deciders.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"A clear proof has come to me from my Lord, and Him you deny. But what you wish to be hastened is not within my power. The judgement is only God's. He unfolds the Truth, and is the best of judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I take stand upon a clear evidence from my Lord and it is that which you have given the lie to. That which you desire to be hastened is not within my power. Judgement lies with Allah alone. He declares the Truth, and He is the best judge.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I have received enough authoritative evidence from my Lord but you have rejected it. Whatever (torment that God has threatened you with for your disbelief) and that which you insist on to experience without delay, is not in my hands. The (final) Judgment is in the hands of God. He reveals the Truth and He is the best Judge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I am on the clear proof from my Lord, whereas you deny Him; I do not have what you are impatient for; there is no command except that of Allah; He states the truth and He is the Best of Judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I am on clear proof from my Lord, but you deny it. I do not have what you are hastily seeking (the torment). The decision is only for Allah, He declares the truth, and He is the best of judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Surely I have manifest proof from my Lord and you call it a lie; I have not with me that which you would hasten; the judgment is only Allah's; He relates the truth and He is the best of deciders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I stand upon a clear sign from my Lord, and you have cried lies to it. Not with me is that you seek to hasten; the judgment is God's alone. He relates the truth, and He is the Best of deciders.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: I am (relying) on clear proof from my Lord, while ye deny Him. I have not that for which ye are impatient. The decision is for Allah only. He telleth the truth and He is the Best of Deciders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I stand by the clear evidence from my Lord, yet you deny it. What you seek to hasten is not within my power. Judgement is for God alone. He declares the truth. He is the best of judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: verily stand upon an evidence from my Lord, and ye belie it; not with me is that which ye fain would hasten on. The judgement is not but of Allah. He counteth the truth, and He is the Best of deciders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Indeed I stand on a manifest proof from my Lord and you have denied it. What you seek to hasten is not up to me. Judgement belongs only to Allah; He expounds the truth and He is the best of judges.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"For me, I (work) on a clear sign from my Lord, but ye reject Him. What ye would see hastened, is not in my power. The command rests with none but Allah: He declares the truth, and He is the best of judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"I am on clear proof from my Lord (Islamic Monotheism), but you deny (the truth that has come to me from Allah). I have not gotten what you are asking for impatiently (the torment). The decision is only for Allah, He declares the truth, and He is the Best of judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I am upon a clear proof from my Lord, yet you belie Him. I do not have that which you seek to hasten; judgement is for Allah alone. He narrates the truth and He is the Best of deciders'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I stand on clear evidence from my Lord, and you have rejected Him. I do not possess what you seek me to hasten; the decision belongs solely to God. He states the truth, and He is the Best of Judges.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Indeed, I am on clear evidence from my Lord, and you have denied it. I do not have that for which you are impatient. The decision is only for Allah. He relates the truth, and He is the best of deciders.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:57] Say: ‘I am upon a clear proof, a [clear] statement, from my Lord, and you have, already, denied Him, my   Lord, when you associated others with Him. I do not have that which you seek to hasten, of the chastisement; the judgement, in this matter and in [all] others, is God’s alone. He decrees the, judgement of, truth, and He is the Best of Deciders’, [the Best of] Judges (a variant reading [for yaqdī, ‘He decrees’] has yaqussu, that is, ‘He relates [the truth]’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad to al-Nadr Ibn al-Harith and his folk: (I am (relying) on clear proof from my Lord) and I have full insight of my matter and religion, (while you deny Him) you deny the Qur'an and Allah's divine Oneness. (I have not that for which ye are impatient) i.e. your punishment. (The decision) to send a punishment on you (is for Allah only. He telleth the Truth) His judgement is just and He commands only that which is right (and He is the Best of Deciders) the best of Judges.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { عَلَىٰ بَيِّنَةٍ مِّن رَّبِّي } معناهُ عَلَى بَيانٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Upon a clear sign from my Lord\" - this means upon a clear explanation.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ إِنِّي عَلَىٰ بَيِّنَةٍ } واضحة { مِّن } معرفة { رَّبِّي } وتوحيده { وَكَذَّبْتُم بِهِ } وبتوحيده\n وأشركتم له غيره واستوجبتم العقوبة العظيمة يشرككم\n ومع ذلك استهزأتم باستعجال العذاب { مَا عِندِي مَا تَسْتَعْجِلُونَ بِهِ } من العذاب والنكال { إِنِ ٱلْحُكْمُ إِلاَّ للَّهِ } أي: ما الحكم إلا له باستعجال العذاب { يَقُصُّ ٱلْحَقَّ } أي: يقضي فيه ويدمغ الباطل { وَهُوَ خَيْرُ ٱلْفَٰصِلِينَ } [الأنعام: 57] الحاكمين في الوقائع\n\n\n{ قُل لَّوْ أَنَّ عِندِي } وتحت قدرتي ومكنتي { مَا تَسْتَعْجِلُونَ بِهِ } من نزول العذاب والعقاب { لَقُضِيَ ٱلأَمْرُ } أي: لأهلككم بالمرة وارتفع النزاع { بَيْنِي وَبَيْنَكُمْ } ولكن ليس لي هذه القدرة والمكنة { وَٱللَّهُ } المطلع لسرائر عباده { أَعْلَمُ بِٱلظَّالِمِينَ } [الأنعام: 58] المستوجين للعذاب والنكال بأخذهم بظلمهم تعقلت إرادته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل إني على بيّنة } أي: طريق واضحة { من ربي } تُوصلني إلى تحقيق معرفته، واستجلاب رضوانه، أنا ومن اتبعني، { و } أنتم { كذبتم به } أي: بربي حيث أشركتم به وعبدتم غيره، أو كذبتم بطريقه حيث أعرضتم عنها، واستعجلتم عقابه في الدنيا، { ما عندي ما تستعجلون به } من العذاب أو المعجزات، { إن الحكم إلا لله } في تعجيل العذاب وتأخيره، أو في إظهار الآيات وعدم إظهارها، { يقَصُّ } القصص { الحق } وهو القرآن، أي: ينزله عليّ لأنذركم به، أو يقضي القضاء الحق من تعجيل ما يعجل وتأخير ما يؤخر، فيحكم بيني وبينكم إن شاء، { وهو خير الفاصلين } أي: القاضين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:62",
      "similarity": 0.5768958091245237
    },
    {
      "verse": "7:7",
      "similarity": 0.45284145071053494
    },
    {
      "verse": "4:164",
      "similarity": 0.42946848338965765
    },
    {
      "verse": "18:13",
      "similarity": 0.38003015615179075
    },
    {
      "verse": "12:3",
      "similarity": 0.372552714241306
    }
  ]
}