{
  "chapter": "الأنعام",
  "text": "قل انى على بينة من ربى وكذبتم به ما عندى ما تستعجلون به ان الحكم الا لله يقص الحق وهو خير الفصلين",
  "translations": [
    {
      "translation": "Say: 'I stand on a Clear Sign from my Lord and yet you have denied it. I do not have in my possession what you are in such haste to bring about. Jurisdiction over it belongs to Allah alone. He tells the truth and He is the Best of Deciders.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"A clear proof has come to me from my Lord, and Him you deny. But what you wish to be hastened is not within my power. The judgement is only God's. He unfolds the Truth, and is the best of judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I take stand upon a clear evidence from my Lord and it is that which you have given the lie to. That which you desire to be hastened is not within my power. Judgement lies with Allah alone. He declares the Truth, and He is the best judge.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I have received enough authoritative evidence from my Lord but you have rejected it. Whatever (torment that God has threatened you with for your disbelief) and that which you insist on to experience without delay, is not in my hands. The (final) Judgment is in the hands of God. He reveals the Truth and He is the best Judge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I am on the clear proof from my Lord, whereas you deny Him; I do not have what you are impatient for; there is no command except that of Allah; He states the truth and He is the Best of Judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I am on clear proof from my Lord, but you deny it. I do not have what you are hastily seeking (the torment). The decision is only for Allah, He declares the truth, and He is the best of judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Surely I have manifest proof from my Lord and you call it a lie; I have not with me that which you would hasten; the judgment is only Allah's; He relates the truth and He is the best of deciders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I stand upon a clear sign from my Lord, and you have cried lies to it. Not with me is that you seek to hasten; the judgment is God's alone. He relates the truth, and He is the Best of deciders.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: I am (relying) on clear proof from my Lord, while ye deny Him. I have not that for which ye are impatient. The decision is for Allah only. He telleth the truth and He is the Best of Deciders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I stand by the clear evidence from my Lord, yet you deny it. What you seek to hasten is not within my power. Judgement is for God alone. He declares the truth. He is the best of judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: verily stand upon an evidence from my Lord, and ye belie it; not with me is that which ye fain would hasten on. The judgement is not but of Allah. He counteth the truth, and He is the Best of deciders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Indeed I stand on a manifest proof from my Lord and you have denied it. What you seek to hasten is not up to me. Judgement belongs only to Allah; He expounds the truth and He is the best of judges.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"For me, I (work) on a clear sign from my Lord, but ye reject Him. What ye would see hastened, is not in my power. The command rests with none but Allah: He declares the truth, and He is the best of judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"I am on clear proof from my Lord (Islamic Monotheism), but you deny (the truth that has come to me from Allah). I have not gotten what you are asking for impatiently (the torment). The decision is only for Allah, He declares the truth, and He is the Best of judges.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I am upon a clear proof from my Lord, yet you belie Him. I do not have that which you seek to hasten; judgement is for Allah alone. He narrates the truth and He is the Best of deciders'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I stand on clear evidence from my Lord, and you have rejected Him. I do not possess what you seek me to hasten; the decision belongs solely to God. He states the truth, and He is the Best of Judges.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Indeed, I am on clear evidence from my Lord, and you have denied it. I do not have that for which you are impatient. The decision is only for Allah. He relates the truth, and He is the best of deciders.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:57] Say: ‘I am upon a clear proof, a [clear] statement, from my Lord, and you have, already, denied Him, my   Lord, when you associated others with Him. I do not have that which you seek to hasten, of the chastisement; the judgement, in this matter and in [all] others, is God’s alone. He decrees the, judgement of, truth, and He is the Best of Deciders’, [the Best of] Judges (a variant reading [for yaqdī, ‘He decrees’] has yaqussu, that is, ‘He relates [the truth]’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي انتقل به الكلام من إبطال الشرك بدليل الوحي الإلهي المؤيِّد للأدلَّة السابقة إلى إثبات صدق الرسالة بدليل من الله مؤيِّد للأدلّة السابقة أيضاً ، لييأسوا من محاولة إرجاع الرسول عليه الصلاة والسلام عن دعوته إلى الإسلام وتشكيكه في وحيه بقولهم : ساحر ، مجنون ، شاعر ، أساطيرُ الأولين ، ولييأسوا أيضاً من إدخال الشكّ عليه في صدق إيمان أصحابه ، وإلقاء الوحشة بينه وبينهم بما حاولوا من طرده أصحابَه عن مجلسه حين حضور خصومه ، فأمره الله أن يقول لهم إنَّه على يقين من أمر رَبِّه لا يتزعزعُ . وعطف على ذلك جواب عن شبهة استدلالهم على تكذيب الوعيد بما حلّ بالأمم من قبلهم بأنَّه لو كان صدقاً لعجّل لهم العذاب ، فقد كانوا يقولون : { اللهم إن كان هذا هو الحقّ من عندك فأمطر علينا حجارة من السماء أو ائتِنا بعذاب أليم } \\[ الأنفال : 32 \\] ويقولون : { ربَّنا عجِّل لنا قطّنا قبل يوم الحساب } \\[ ص : 16 \\] ، فقال الله لرسوله صلى الله عليه وسلم { قُل لو أنّ عندي ما تستعجلون به لقضي الأمر بيني وبينكم } \\[ الأنعام : 58 \\] ، وأكَّد الجملة بحرف التأكيد لأنَّهم ينكرون أن يكون على بيِّنه من ربِّه .وإعادة الأمر بالقول لتكرير الاهتمام الذي تقدّم بيانه عند قوله تعالى : { قل أرأيتكم إن أتاكم عذاب الله أو أتتكم الساعة } \\[ الأنعام : 40 \\].والبيِّنة في الأصل وصف مُؤنّثُ بَيِّن ، أي الواضحة ، فهي صفة جرت على موصوف محذوف للعلم به في الكلام ، أي دلالة بيِّنة أو حجّة بيِّنة . ثم شاع إطلاق هذا الوصف فصار اسماً للحجّة المثبِتة للحقّ التي لا يعتريها شك ، وللدلالة الواضحة ، وللمعجزة أيضاً ، فهي هنا يجوز أن تكون بمعنى الدلالة البيِّنة ، أي اليقين . وهو أنسب ب { على } الدالة على التمكّن ، كقولهم : فلان على بصيرة ، أي أنّي متمكِّن من اليقين في أمر الوحي .ويجوز أن يكون المراد بالبيِّنة القرآن ، وتكون ( على ) مستعملة في الملازمة مجازاً مرسلاً لأنّ الاستعلاء يستلزم الملازمة ، أي أنِّي لا أخالف ما جاء به القرآن .و { مِن ربِّي } صفة ل { بيّنة } يفيد تعظيمها وكمالها . و ( مِنْ ) ابتدائية ، أي بيّنة جائية إليّ من ربّي ، وهي الأدلَّة التي أوحاها الله إليه وجاء بها القرآن وغيرُه . ويجوز أن تكون ( مِنْ ) اتّصالية ، أي على يقين متّصل بربِّي ، أي بمعرفته توحيده ، أي فلا أتردّد في ذلك فلا تطمعوا في صرفي عن ذلك ، أي أنِّي آمنتُ بإله واحد دلَّت على وجوده ووحدانيته دلائل خلقه وقدرته ، فأنا موقن بما آمنت به لا يتطرّقني شك . وهذا حينئذٍ مسوق مساق التعريض بالمشركين في أنَّهم على اضطراب من أمر آلهتهم وعلى غير بصيرة .وجملة { وكذّبتم به } في موضع الحال من { بيّنة }.وهي تفيد التعجّب منهم أنْ كذّبوا بما دلَّت عليه البيّنة .ويجوز أن تكون معطوفة على جملة { إنِّي على بيِّنة من ربِّي } ، أي أنا على بيِّنة وأنتم كذّبتم بما دلَّت عليه البيِّنات فشتَّان بيني وبينكم .والضمير في قوله : { به } يعود إلى البيِّنة باعتبار تأويلها بالبيان أو باعتبار أن ماصْدَقَها اليقين أو القرآن على وجه جَعْل ( مِنْ ) ابتدائية ، أي وكذّبتم باليقين مكابرة وعناداً ، ويعود إلى ربِّي على وجه جعل ( مِنْ ) اتِّصالية ، أي كنت أنا على يقين في شأن ربّي وكذّبتم به مع أنّ دلائل توحيده بيِّنة واضحة . ويعود إلى غير مذكور في الكلام ، وهو القرآن لشهرة التداول بينهم في شأنه فإذا أطلق ضمير الغائب انصرف إليه بالقرينة .والباء التي عدّي بها فعل { كذّبتم } هي لتأكيد لصوق معنى الفعل بمفعوله ، كما في قوله تعالى : { وامسحوا برؤوسكم } \\[ المائدة : 6 \\]. فلذلك يدلّ فعل التكذيب إذا عدّي بالباء على معنى الإنكار ، أي التكذيب القويّ . ولعلّ الاستعمال أنّهم لا يُعدّون فعل التكذيب بالباء إلاّ إذا أريد تكذيب حجّة أو برهان ممّا يحسب سببَ تصديق ، فلا يقال : كذّبتُ بفلان ، بل يقال : كذّبت فلاناً قال تعالى : { لَمَّا كذبوا الرسل } \\[ الفرقان : 37 \\] وقال : { كذّبت ثمودُ بالنُذُر } \\[ القمر : 23 \\].والمعنى التعريضيّ بهم في شأن اعتقادهم في آلهتهم باق على ما بيَّنّاه .وقوله : { ما عندي ما تستعجلون به } استئناف بياني لأنّ حالهم في الإصرار على التكذيب ممّا يزيدهم عناداً عند سماع تسفيه أحلامهم وتنقّص عقائدهم فكانوا يقولون : لو كان قولك حقّاً فأين الوعيد الذي تَوعّدتنا . فإنّهم قالوا : { اللهم إن كان هذا هو الحقّ من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم } \\[ الأنفال : 32 \\] وقالوا : { أو تُسْقِط السماء علينا كما زعمت كِسَفا } \\[ الإسراء : 92 \\] فأمر بأن يجيب أن يقول { ما عندي ما تستعجلون به }.والاستعجال طلب التعجيل بشيء ، فهو يتعدّى إلى مفعول واحد ، وهو المطلوب منه تعجيل شيء . فإذا أريد ذكر الأمر المعجّل عدّي إليه بالباء . والباء فيه للتعدية . والمفعول هنا محذوف دلّ عليه قوله : { ما عندي }.والتقدير : تستعجلونني به . وأمّا قوله تعالى : { أتى أمر الله فلا تستعجلوه } \\[ النحل : 1 \\] فالأظهرُ أنّ ضمير الغائب عائد لاسم الجلالة ، وسيأتي في أوّل سورة النحل .ومعنى { ما عندي } أنّه ليس في مقدرتي ، كما يقال : ما بيدي كذا . فالعندية مجاز عن التصرّف بالعلم والمقدرة . والمعنى : أنِّي لست العليم القدير ، أي لست إلهاً ولكنّني عبد مرسل أقف عند ما أرسلتُ به .وحقيقة ( عندَ ) أنَّها ظرف المكان القريب . وتستعمل مجازاً في استقرار الشيء لشيء وملكه إيَّاه ، كقوله : { وعنده مفاتح الغيب } \\[ الأنعام : 59 \\]. وتستعمل مجازاً في الاحتفاظ بالشيء ، كقوله : { وعنده علم الساعة } \\[ الزخرف : 85 \\] { وعند الله مَكْرُهم } \\[ إبراهيم : 46 \\] ولا يحسن في غير ذلك .والمراد ب { ما تستعجلون به } العذاب المتوعَّد به . عبَّر بطريق الموصولية لما تنبىء به الصلة من كونه مؤخّراً مدّخراً لهم وأنّهم يستعجلونه وأنّه واقع بهم لا محالة ، لأنّ التعجيل والتأخير حالان للأمر الواقع؛ فكان قوله : { تستعجلون } في نفسه وعيداً .وقد دلّ على أنَّه بيد الله وأنّ الله هو الذي يقدّر وقته الذي ينزل بهم فيه ، لأنّ تقديم المسند الظرف أفاد قصر القلب ، لأنّهم توهّموا من توعّد النبي صلى الله عليه وسلم إيَّاهم أنّه توعّدهم بعقاب في مقدرته . فجعلوا تأخّره إخلافاً لتوعّده ، فردّ عليهم بأنّ الوعيد بيد الله ، كما سيصرّح به في قوله : { إننِ الحكم إلاّ لله }.فقوله : { إن الحكم إلاّ لله } تصريح بمفهوم القصر ، وتأكيد له . وعلى وجه كون ضمير { به } للقرآن ، فالمعنى كذّبتهم بالقرآن وهو بيِّنة عظيمة ، وسألتم تعجيل العذاب تعجيزاً لي وذلك ليس بيدي .وجملة { يقصّ الحقّ } حال من اسم الجلالة أو استئناف ، أي هو أعلم بالحكمة في التأخير أو التعجيل .وقرأ نافع ، وابن كثير ، وعاصم ، وأبو جعفر { يقُصّ } بضمّ القاف وبالصاد المهملة فهو من الاقتصاص ، وهو اتِّباع الأثر ، أي يجري قدره على أثر الحقّ ، أي على وفقه؛ أو هو من القصص ، وهو الحكاية أي يحكي بالحق ، أي أنّ وعده واقع لا محالة فهو لا يخبر إلاّ بالحق . و { الحقّ } منصوب على المفعولية به على الاحتمالين .وقرأ الباقيون { يَقْض } بسكون القاف وبضاد معجمة مكسورة على أنَّه مضارع ( قضى ) ، وهو في المصحف بغير ياء . فاعتُذر عن ذلك بأنّ الياء حُذفت في الخطّ تبعاً لحذفها في اللفظ في حال الوصل ، إذ هو غير محلّ وقف ، وذلك ممّا أجري فيه الرسم على اعتبار الوصل على النادر كما كتب { سندعُ الزبانيةُ } \\[ العلق : 18 \\]. قال مكِّي قراءة الصّاد ( أي المهملة ) أحبّ إليّ لاتّفاق الحرمييْن ( أي نافع وابن كثير ) عليها ولأنَّه لو كان من القضاء للزمت الباء الموحَّدة فيه ، يعني أن يقال : يقص بالحق . وتأويله بأنّه نصب على نزع الخافض نادر . وأجاب الزّجاج بأنّ { الحقّ } منصوب على المفعولية المطلقة ، أي القضاء الحقّ ، وعلى هذه القراءة ينبغي أن لا يوقف عليه لئلاّ يضطرّ الواقف إلى إظهار الياء فيخالف الرسم المصحفي .وجملة : { وهو خير الفاصلين } أي يقصّ ويخبر بالحقّ ، وهو خير من يفصل بين الناس ، أو يقضي بالحقّ ، وهو خير من يفصل القضاء .والفصْل يطلق بمعنى القضاء . قال عُمر في كتابه إلى أبي موسى «فإنّ فصْل القضاء يورث الضغائن» . ويطلق بمعنى الكلام الفاصل بين الحقّ والباطل ، والصواب والخطأ ، ومنه قوله تعالى : { وآتيناه الحكمة وفصْلَ الخطاب } \\[ ص : 20 \\] وقوله : { إنَّه لَقَوْل فصْل } \\[ الطارق : 13 \\]. فمعنى { خير الفاصلين } يشمل القول الحقّ والقضاء العدل .\n\n",
      "translations": [
        {
          "translation": "(Say) Muhammad to al-Nadr Ibn al-Harith and his folk: (I am (relying) on clear proof from my Lord) and I have full insight of my matter and religion, (while you deny Him) you deny the Qur'an and Allah's divine Oneness. (I have not that for which ye are impatient) i.e. your punishment. (The decision) to send a punishment on you (is for Allah only. He telleth the Truth) His judgement is just and He commands only that which is right (and He is the Best of Deciders) the best of Judges.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { عَلَىٰ بَيِّنَةٍ مِّن رَّبِّي } معناهُ عَلَى بَيانٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Upon a clear sign from my Lord\" - this means upon a clear explanation.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ إِنِّي عَلَىٰ بَيِّنَةٍ } واضحة { مِّن } معرفة { رَّبِّي } وتوحيده { وَكَذَّبْتُم بِهِ } وبتوحيده\n وأشركتم له غيره واستوجبتم العقوبة العظيمة يشرككم\n ومع ذلك استهزأتم باستعجال العذاب { مَا عِندِي مَا تَسْتَعْجِلُونَ بِهِ } من العذاب والنكال { إِنِ ٱلْحُكْمُ إِلاَّ للَّهِ } أي: ما الحكم إلا له باستعجال العذاب { يَقُصُّ ٱلْحَقَّ } أي: يقضي فيه ويدمغ الباطل { وَهُوَ خَيْرُ ٱلْفَٰصِلِينَ } [الأنعام: 57] الحاكمين في الوقائع\n\n\n{ قُل لَّوْ أَنَّ عِندِي } وتحت قدرتي ومكنتي { مَا تَسْتَعْجِلُونَ بِهِ } من نزول العذاب والعقاب { لَقُضِيَ ٱلأَمْرُ } أي: لأهلككم بالمرة وارتفع النزاع { بَيْنِي وَبَيْنَكُمْ } ولكن ليس لي هذه القدرة والمكنة { وَٱللَّهُ } المطلع لسرائر عباده { أَعْلَمُ بِٱلظَّالِمِينَ } [الأنعام: 58] المستوجين للعذاب والنكال بأخذهم بظلمهم تعقلت إرادته\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { و } أنتم { كذبتم به } أي: بربي حيث أشركتم به وعبدتم غيره\n أو كذبتم بطريقه حيث أعرضتم عنها\n واستعجلتم عقابه في الدنيا\n { ما عندي ما تستعجلون به } من العذاب أو المعجزات\n { إن الحكم إلا لله } في تعجيل العذاب وتأخيره\n أو في إظهار الآيات وعدم إظهارها\n { يقَصُّ } القصص { الحق } وهو القرآن\n أي: ينزله عليّ لأنذركم به\n أو يقضي القضاء الحق من تعجيل ما يعجل وتأخير ما يؤخر\n فيحكم بيني وبينكم إن شاء\n { وهو خير الفاصلين } أي: القاضين\n { قل لو أن عندي } أي: في قدرتي وطوقي { ما تستعجلون به } من العذاب { لقُضي الأمر بيني وبينكم } أي: لأهلكتكم عاجلاً غضبًا لربي\n وانقطع ما بيني وبينكم\n ولكن الأمر بيد خالقكم الذي هو عالم بأحوالكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:62",
      "similarity": 0.5768958091245237
    },
    {
      "verse": "7:7",
      "similarity": 0.45284145071053494
    },
    {
      "verse": "4:164",
      "similarity": 0.42946848338965765
    },
    {
      "verse": "18:13",
      "similarity": 0.38003015615179075
    },
    {
      "verse": "12:3",
      "similarity": 0.372552714241306
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006057.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006057.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:57.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}