{
  "chapter": "الأنعام",
  "text": "قل لو ان عندى ما تستعجلون به لقضى الامر بينى وبينكم والله اعلم بالظلمين",
  "translations": [
    {
      "translation": "Say: 'If I did have in my possession what you are in such haste to bring about, the affair between me and you would have been decided. Allah has greatest knowledge of the wrongdoers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If what you wish to be hastened were in my power, all matters between you and me would have been settled; God is cognisant of those who are unjust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If what you demand so hastily were in my power, the matter between me and you would have been long decided. But Allah knows best how to judge the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If I had in my hands what you demand to experience without delay, the matter would have been ended all together. God knows best about the unjust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “If I had the thing for which you are impatient, then the matter between me and you would have already been decided”; and Allah is Well Aware of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If I had that which you are asking for impatiently (the torment), the matter would have been settled at once between you and I, but Allah knows best the wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If that which you desire to hasten were with me, the matter would have certainly been decided between you and me; and Allah best knows the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If what you seek to hasten were with me, the matter between you and me would be decided; and God knows very well the evildoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: If I had that for which ye are impatient, then would the case (ere this) have been decided between me and you. Allah is Best Aware of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If what you seek to hasten were within my power, the matter would be settled between you and me. God best knows the evil-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: if that which ye fain would hasten on be with me, the affair would have been decided between me and you; and Allah is the Best Knower of you the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘If what you seek to hasten were with me, the matter would surely have been decided between you and me, and Allah knows best the wrongdoers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If what ye would see hastened were in my power, the matter would be settled at once between you and me. But Allah knoweth best those who do wrong.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"If I had that which you are asking for impatiently (the torment), the matter would have been settled at once between me and you, but Allah knows best the Zalimun (polytheists and wrong-doers, etc.).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'If what you seek to hasten were with me, the matter between you and me would be decided, and Allah knows very well the harmdoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “If I possessed what you seek me to hasten, the matter between you and me would have been settled. God is well aware of the unjust.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"If I had that for which you are impatient, the matter would have been decided between me and you, but Allah is most knowing of the wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:58] Say, to them: ‘If I did have what you seek to hasten, the matter between you and me would have been decided, by my hastening it for you, so that I might find rest; but God has it; and God knows best the evildoers’, and when to punish them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad: (If I had that for which ye are impatient) i.e. punishment, (then would the case (ere this) have been decided between me and you) you would have already been destroyed. (Allah is best aware of the wrong-doers) of the punishment of the idolaters: al-Nadr Ibn al-Harith and his folk. Then, the punishment for which al-Nadr Ibn al-Harith asked happened: he was killed in captivity on the Day of Badr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والله أعلم بالظالمين } أي: عالم بما ينبغي أن يؤخذ عاجلاً\n وبمن ينبغي أن يمهل\n فمفاتح الغيب كلها عنده\n كما سيذكره\n الإشارة: قل\n أيها العارف\n المتوجه إلى الله\n المنقطع كليته إلى مولاه\n الغائب عن كل ما سواه: إني نهيت أن أعبد الذين تدعون من دون الله من حب الدنيا\n ومن الرياسة والجاه\n قل: لا أتبع أهواءكم لأني قد اجتمعت أهوائي في محبوب واحد\n حين وصلت إلى حضرته\n وتنعمت بشهود طلعته\n فانحصرت محبتي في محبوب واحد\n وفي ذلك يقول القائل:\nوقال آخر:\n{ قل إني على بينة من ربي } أي: بصيرة نافذة في مشاهدة أسرار ربي\n فقد كذَّبتم بخصوصيتي\n وطلبتم دلائل ولايتي\n ما عندي ما تستعجلون به من الكرامات\n { إن الحكم إلا لله } \n يقضي القضاء الحق\n فيُظهر ما يشاء\n ويُخفي مَن يشاء\n { وهو خير الفاصلين } أي: الحاكمين بين عبادة\n قل لو أن عندي ما تستعجلون به من نفوذ دعوتي في إظهار كرامتي\n لقٌضي الأمر بيني وبينكم\n والله أعلم بالمكذبين بأوليائه\n ثم قال تعالى: { وَعِندَهُ مَفَاتِحُ ٱلْغَيْبِ لاَ يَعْلَمُهَآ إِلاَّ هُوَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:204",
      "similarity": 0.490560634808874
    },
    {
      "verse": "37:176",
      "similarity": 0.490560634808874
    },
    {
      "verse": "2:92",
      "similarity": 0.48708771080701246
    },
    {
      "verse": "20:114",
      "similarity": 0.47861458663617684
    },
    {
      "verse": "20:83",
      "similarity": 0.45183837393448667
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006058.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006058.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:58.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}