{
  "chapter": "الأنعام",
  "text": "وعنده مفاتح الغيب لا يعلمها الا هو ويعلم ما فى البر والبحر وما تسقط من ورقة الا يعلمها ولا حبة فى ظلمت الارض ولا رطب ولا يابس الا فى كتب مبين",
  "translations": [
    {
      "translation": "The keys of the Unseen are in His possession. No one knows them but Him. He knows everything in the land and sea. No leaf falls without His knowing it. There is no seed in the darkness of the earth, and nothing",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has the keys of the Unknown. No one but He has knowledge; He knows what is on the land and in the sea. Not a leaf falls without His knowledge, nor a grain in the darkest (recess) of the earth, nor any thing green or seared that is not recorded in the open book (of nature).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has the keys to the realm that lies beyond the reach of human perception; none knows them but He. And He knows what is on the land and in the sea; there is not a leaf which falls that He does not know about and there is not a grain in the darkness of the earth or anything green or dry which has not been recorded in a Clear Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has with Him the keys to the unseen which no one knows besides Him. He knows all that is in the land and the sea. Not a single leaf falls which He would not know. No single seed exists even in the darkest places of the land, nor anything in the world either wet or dry, that is not kept recorded in the self-evident Book (the tablet preserved in the heavens).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who has the keys of the hidden – only He knows them; and He knows all that is in the land and the sea; and no leaf falls but He knows it – and there is not a grain in the darkness of the earth, nor anything wet or dry, which is not recorded in a clear Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And with Him are the keys of the Ghayb (all that is hidden), none knows them but He. And He knows whatever there is on the land and in the sea; not a leaf falls, but he knows it. There is not a grain in the darkness of the earth nor anything fresh or dry, but is written in a Clear Record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And with Him are the keys of the unseen treasures-- none knows them but He; and He knows what is in the land and the sea, and there falls not a leaf but He knows it, nor a grain in the darkness of the earth, nor anything green nor dry but (it is all) in a clear book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With Him are the keys of the Unseen; none knows them but He. He knows what is in land and sea; not a leaf falls, but He knows it. Not a grain in the earth's shadows, not a thing, fresh or withered, but it is in a Book Manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And with Him are the keys of the Invisible. None but He knoweth them. And He knoweth what is in the land and the sea. Not a leaf falleth but He knoweth it, not a grain amid the darkness of the earth, naught of wet or dry but (it is noted) in a clear record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He holds the keys to the unseen; none knows them but He. He has knowledge of all that land and sea contain. No leaf falls without His knowledge, nor is there a single grain in the darkness of the earth, or anything, wet or dry, but is recorded in a clear Record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And with Him are the keys of the unseen; none knoweth them but he. And He knoweth whatsoever is in the land and the sea. Not a leaf falleth but he knoweth it, nor a seed-grain groweth in the darkness of the earth, nor aught of fresh or dry but is in a Book luminous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With Him are the treasures of the Unseen; no one knows them except Him. He knows whatever there is in land and sea. No leaf falls without His knowing it, nor is there a grain in the darkness of the earth, nor anything fresh or withered but it is in a manifest Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With Him are the keys of the unseen, the treasures that none knoweth but He. He knoweth whatever there is on the earth and in the sea. Not a leaf doth fall but with His knowledge: there is not a grain in the darkness (or depths) of the earth, nor anything fresh or dry (green or withered), but is (inscribed) in a record clear (to those who can read).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And with Him are the keys of the Ghaib (all that is hidden), none knows them but He. And He knows whatever there is in (or on) the earth and in the sea; not a leaf falls, but he knows it. There is not a grain in the darkness of the earth nor anything fresh or dry, but is written in a Clear Record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With Him are the keys of the unseen, none knows them but He. He knows that which is in the land and sea. No leaf falls except He knows it, and there is no grain in the darkness of the earth, fresh or withered, but is recorded in a clear Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "With Him are the keys of the unseen; none knows them except He. And He knows everything on land and in the sea. Not a leaf falls but He knows it; and there is not a single grain in the darkness of earth, nor is there anything wet or dry, but is in a clear record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And with Him are the keys of the unseen; none knows them except Him. And He knows what is on the land and in the sea. Not a leaf falls but that He knows it. And no grain is there within the darknesses of the earth and no moist or dry [thing] but that it is [written] in a clear record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:59] And with Him, exalted be He, are the keys of the Unseen, its treasure houses, or the paths that lead to knowledge of it; none but He knows them, and these are the five things mentioned in His saying: Surely God, He has knowledge of the Hour [and He sends down the rain and He knows what is in the wombs. And no soul knows what it has earned for the morrow; nor does any soul know in what land it will die. Truly God is Knowing, Aware, Q. 31:34], as reported by al-Bukhārī. He knows what is, happening, on land, [in] the deserts, and in the waters, [in] the towns along the rivers; and not a leaf (min waraqatin: min is extra) falls, but He knows it. Not a grain in the shadows of the earth, nothing of wet or dry ([this entire clause] wa-lā habbatin fī zulumāti l-ardi wa-lā ratbin wa-lā yābisin is a supplement to waraqatin, ‘a leaf’) but it is in a clear book, namely, the Preserved Tablet (al-lawh al-mahfūz). The exceptive clause [illā fī kitābin mubīn, ‘but it is in a clear book’] constitutes an inclusive substitution for the previous exceptive clause [illā ya‘lamuhā, ‘but He knows it’].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And with Him are the keys of the invisible) the stores of the unseen: rain, vegetation, fruits, and the descent of punishment you asked for on the Day of Badr. (None but He knoweth them) no one knows the keys of the unseen: when the punishment for which you are impatient will come down on you. (And He knoweth what is in the land and the sea) of created beings and marvels; it is also said that this means: Allah knows what He destroys in the land and in the sea. (Not a leaf falleth) from a tree (but He knoweth it) He knows how many times it spins in the air before it falls, (not a grain amid the darkness of the earth) under a rock at the bottom of the earth except that He knows it, (naught of wet) i.e. water (or dry) steppe (but (it is noted) in a) written (clear record) all of it is in the Guarded Tablet: with their precise measure and time.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَعِندَهُ } وتحت قدرته وإرادته { مَفَاتِحُ ٱلْغَيْبِ } ومقاليد السرائر والخفيات { لاَ يَعْلَمُهَآ } وأوقات ظهروها من الغيب إلى الشهادة { إِلاَّ هُوَ } إذ هو المحيط بجميع ما كان ويكون\n لا يعرب عن علمه شيء\n ثم لما كانت الأفهام قاصرة عن إدراك الغيب تنزل عن تلك المرتبة إلى ما هو أقرب إلى الأفهام فقال: { وَيَعْلَمُ } بعلمه الحضوري جميع { مَا فِي ٱلْبَرِّ وَٱلْبَحْرِ } من الكائنات والفاسدات\n وتنزل منها أيضاً فقال: { وَمَا تَسْقُطُ مِن وَرَقَةٍ } من أغصان الشجر { إِلاَّ يَعْلَمُهَا } كيف ينزل\n ومن أين ينزل\n وإلى أين { وَلاَ حَبَّةٍ } ساقطة { فِي ظُلُمَٰتِ ٱلأَرْضِ } أي: كموناتها ويروزاتها إلى أن تصل إلى مرتبتها الأصلية التي كانت عليها قبل سقوطها { وَ } بالجملة: { لاَ رَطْبٍ وَلاَ يَابِسٍ } من الكوائن والفواسد { إِلاَّ فِي كِتَٰبٍ مُّبِينٍ } [الأنعام: 59] هو علمه الحضوري المتحد بعينه وذاته الظاهرة في نفسه المظهرة لنفسه\n إذ لا هو إلا هو\n ولا شيء سواه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { مفَاتِح }: جمعِ مفتح ـ بكسر الميم ـ مقصور، من مفتاح، وهو آلة الفتح، وهو مستعار لما يتوصل به إلى الغيوب، أو يفتحها، وهو المخزن\n يقول الحقّ جلّ جلاله: { وعنده مفاتح الغيب } أي: علم المغيبات، لا يعلمها غيره، إلا من ارتضى من خلقه، أو: عنده خزائن علم الغيوب لا يعلمها غيره، والمراد بها الخمسة التي ذكرها الحق تعالى في سورة لقمان:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:25",
      "similarity": 0.42022650492618036
    },
    {
      "verse": "20:77",
      "similarity": 0.28644110304642273
    },
    {
      "verse": "18:19",
      "similarity": 0.2652882855709486
    },
    {
      "verse": "20:121",
      "similarity": 0.19791342324951663
    },
    {
      "verse": "7:22",
      "similarity": 0.18696361326866281
    }
  ]
}