{
  "chapter": "الأنعام",
  "text": "الم يروا۟ كم اهلكنا من قبلهم من قرن مكنهم فى الارض ما لم نمكن لكم وارسلنا السماء عليهم مدرارا وجعلنا الانهر تجرى من تحتهم فاهلكنهم بذنوبهم وانشانا منۢ بعدهم قرنا ءاخرين",
  "translations": [
    {
      "translation": "Have they not seen how many generations We destroyed before them which We had established on the earth far more firmly than We have established you? We sent down heaven upon them in abundant rain and after them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see how many generations We laid low before them, whom We had firmly established in the land as We have not established you, and showered abundant rain on them, and made rivers lap at their feet, yet whom We destroyed for their sins, and raised new generations after them?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how many a people We have destroyed before them? People whom We had made more powerful in the earth than you are and upon them We showered from the heavens abundant rains, and at whose feet We caused the rivers to flow? And then (when they behaved ungratefully) We destroyed them for their sins, and raised other peoples in their place.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why do they not consider how many generations living before them We have destroyed. We established those nations in the land with abilities far beyond those given to you. We sent down plenty of rain from the sky for them and made streams flow therein, but, then, We destroyed them for their sins and established other nations after them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not see how many civilisations We destroyed before them, whom We had established more firmly in the earth than We have established you, and We sent on them abundant rain from the sky, and made the rivers flow beneath them? So we destroyed them because of their sins, and created another civilisation after them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how many a generation before them We have destroyed whom We had established on the earth such as We have not established you And We poured out on them rain from the sky in abundance, and made the rivers flow under them. Yet We destroyed them for their sins, and created after them other generations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not consider how many a generation We have destroyed before them, whom We had established in the earth as We have not established you, and We sent the clouds pouring rain on them in abundance, and We made the rivers to flow beneath them, then We destroyed them on account of their faults and raised up after them another generation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not regarded how We destroyed before them many a generation We established in the earth, as We never established you, and how We loosed heaven upon them in torrents, and made the rivers to flow beneath them? Then We destroyed them because of their sins, and raised up after them another generation;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not how many a generation We destroyed before them, whom We had established in the earth more firmly than We have established you, and We shed on them abundant showers from the sky, and made the rivers flow beneath them. Yet we destroyed them for their sins, and created after them another generation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how many generations We destroyed before them? We established them on the earth more firmly than you, and We sent the clouds over them, pouring down abundant rain; and made the rivers flow at their feet. Yet We destroyed them for their sins, and raised up other generations after them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Observe they not how many a generation before them We have destroyed whom We had established on the earth as We have not established you, and upon whom We had sent the rains of heaven pouring and under whom We had made the rivers flow; yet We destroyed them for their sins and We produced after them a generation of others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not regarded how many a generation We have destroyed before them whom We had granted power in the land in respects that We did not grant you, and We sent abundant rains for them from the sky and made streams run for them? Then We destroyed them for their sins, and brought forth another generation after them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See they not how many of those before them We did destroy?- generations We had established on the earth, in strength such as We have not given to you - for whom We poured out rain from the skies in abundance, and gave (fertile) streams flowing beneath their (feet): yet for their sins We destroyed them, and raised in their wake fresh generations (to succeed them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how many a generation before them We have destroyed whom We had established on the earth such as We have not established you? And We poured out on them rain from the sky in abundance, and made the rivers flow under them. Yet We destroyed them for their sins, and created after them other generations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how many generations We have destroyed before them whom We had established in the land in a way We never established you, sending down for them abundant water from the sky and made the rivers to flow underneath them? Yet because they sinned, We destroyed them and raised up other generations after them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not considered how many generations We destroyed before them? We had established them on earth more firmly than We established you, and We sent the clouds pouring down abundant rain on them, and We made rivers flow beneath them. But We destroyed them for their sins, and established other civilizations after them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not seen how many generations We destroyed before them which We had established upon the earth as We have not established you? And We sent [rain from] the sky upon them in showers and made rivers flow beneath them; then We destroyed them for their sins and brought forth after them a generation of others.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:6] Have they not seen, in their travels to Syria and to other places, how many, (kam is predicative [and not interrogative], meaning ‘many’) a generation, [how many] a community of past communities, We destroyed before them; We established them, We assigned them an [established] place, in the earth, through strength and abundance, as We have not established, [as] We have [not] assigned, you (there is a shift in the address here from third person [to second]); and how We unleashed the heaven, the rain, upon them in torrents, one torrent after another, and made the rivers to flow beneath them?, beneath their dwellings. Then We destroyed them because of their sins, because of their denial of the prophets; and We raised up after them another generation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(See they not) were the people of Mecca not informed in the Qur'an (how many a generation) past nations (We destroyed before them, whom We had established) We gave them sovereignty and respite (in the earth more firmly than We have established you) than the sovereignty and respite We have given you, people of Mecca, (and We shed on them abundant showers from the sky) whenever they needed it, (and made the rivers flow beneath them) beneath their fields, plantations and trees. (Yet We destroyed them for their sins) We destroyed them because of denying the prophets, (and created after them another generation) a different people who were better than they.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مِن قَبْلِهِم مِّن قَرْنٍ } معناه من أمَّةٍ\n\n\n\n\nوقوله تعالى: { مَّكَّنَّٰهُمْ فِي ٱلأَرْضِ } معناه جَعَلنَا لَهُم مَنَازِلَ\n\n\n\n\nوقوله تعالى: { وَأَنْشَأْنَا } معناه ابتَدَأَنَا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"From before them, from a generation\" means from a nation.\n\n\nAnd His saying, {He has made them firm on the earth}, means that We have made them have places on the earth.\n\n\nAnd His saying, \"And We have created,\" means \"We have begun.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَ } يشكون في نزول العذاب ويترددون و { لَمْ يَرَوْاْ كَمْ أَهْلَكْنَا مِن قَبْلِهِم مِّن قَرْنٍ } من أهل القرون الماضية كعاد وثمود وغيرهما مع أنا { مَّكَّنَّٰهُمْ فِي ٱلأَرْضِ } أي: قدرناهم فيها قادرين على أمور عظام وآثام جسام { مَا لَمْ نُمَكِّن لَّكُمْ } ولم نجعل في وسعكم من السعة وطول الملك والترفه والاستيلاء { وَ } مع ذلك { أَرْسَلْنَا ٱلسَّمَآءَ } المطر { عَلَيْهِم مِّدْرَاراً } مغزاراً كثيرة { وَجَعَلْنَا ٱلأَنْهَارَ تَجْرِي مِن تَحْتِهِمْ } دائماً متجدداً\n وبالجملة: أمهلناهم زماناً طويلاً متنعمين مترفهين { فَأَهْلَكْنَٰهُمْ } بالمرة { بِذُنُوبِهِمْ } التي صدرت عنهم من تكذيب الأنبياء وما جاءوا به\n وإفسادهم في الأرض بأنواع الفسادات { وَأَنْشَأْنَا مِن بَعْدِهِمْ قَرْناً آخَرِينَ } [الأنعام: 6]\n\n\nولا تبالِ يا أكرم الرسل بتكذيبهم واقتراحاتهم\n ولا ترجُ منهم الإيمنا بلك وبكتابك\n لأنهم من غاية انهماكهم في الضلال\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { كم }: خبرية، مفعول { أهلكنا } ، أي: كثيرًا أهلكنا من القرون، والقرن مدة من الزمان تهلك أشياخُها وتقوم أطفالُها، واخُتلف في حدِّها، قيل: مائة، وقيل: سبعون، وقيل: ثمانون، وقيل القرن: أهل زمان فيه نبي أو فائق في العلم، قلَّت المدةُ أو كثُرَت، مشتق من قرين الرجل. والمطر المِدرار هو الغزير، وهي من أمثلة المبالغة، كمِذكار وميناث. يقول الحقّ جلّ جلاله: { ألم يروا } ببصائرهم رؤيةَ اعتبار، { كم أهلكنا من قبلهم } من أهل عصر { مكنّاهم في الأرض } أي: جعلناهم متمكّنين فيها بالقرار والسُّكنَى والطمأنينة فيها، أو أعطيناهم من القوة والآلات ما تمكَّنُوا بها من أنواع التصرف فيها فقد { مكّناهم ما لم نمكّن لكم } يا أهل مكة، فقد جعلنا لهم من السعة وطول المقام ما لم نجعله لكم، أو أعطيناهم من القوة والسَّعة في المال والاستظهار على الناس بالعُدَّة والعدَد وتَهَيُّؤ الأسباب ما لم نجعله لكم. { وأرسلنا السماء } أي: المطر أو السحاب { عليهم مِدرَاراً } أي: مِعزارًا على قدر المنفعة بحسب الحاجة، { وجعلنا الأنهار تجري من تحتهم } أي: أجرينا الأودية من تحت ديارهم وأراضيهم، فعاشوا في الخصب والريف، بين الأنهار والثمار، فعَصوا وطَغوا وبَطرُوا النعمة، فلم يُغنِ ذلك عنهم شيئًا. { فأهلكناهم بذنوبهم وأنشأنا } أي: أحدثنا، { من بعدهم قرنًا آخرين } بدلاً منهم. والمعنى: أنه تعالى كما قدَّر أن يُهلك مَن تقدم مِن القُرون، بعد أن مكَّنهم في البلاد واستظهروا على العباد، كعاد وثمود، وأنشأ بعدهم آخرين عمَّر بهم بلاده، يقدر أن يفعل ذلك بكم يا معشر الكفار المعاصرين لمحمد صلى الله عليه وسلم. الإشارة: النظر والاعتبار يُوجب للقلب الرقَّة والانكسار. وهي عبادة كبرى عند العُباد والزهاد. أُولي العزم والاجتهاد. وفوقها: فكرة الشهود والعيان، وهي الفكرة التي تطوى وجود الأكوان. وتُغيب الأواني بظهور المعاني، أو تريها حاملة لها قائمة بها، فالأُولى فكرة تصديق وإيمان، والثانية فكرة شُهُود وعِيان. وبالله التوفيق. ثم ذكَر عِنادهم، وأنهم لا تنفع فيهم المعجزة، فقال: { وَلَوْ نَزَّلْنَا عَلَيْكَ كِتَاباً فِي قِرْطَاسٍ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "71:11",
      "similarity": 0.632923492925618
    },
    {
      "verse": "11:52",
      "similarity": 0.5676941571037711
    },
    {
      "verse": "17:17",
      "similarity": 0.32872274129025075
    },
    {
      "verse": "36:31",
      "similarity": 0.31410153495850773
    },
    {
      "verse": "32:26",
      "similarity": 0.2823602466456079
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/6:6.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/6:6.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:6.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}