{
  "chapter": "الأنعام",
  "text": "وهو الذى يتوفىكم باليل ويعلم ما جرحتم بالنهار ثم يبعثكم فيه ليقضى اجل مسمى ثم اليه مرجعكم ثم ينبئكم بما كنتم تعملون",
  "translations": [
    {
      "translation": "It is He indeed who sends you to death at night, and knows what you do in the day, then makes you rise with it again in order that the fixed term of life be fulfilled. Then to Him you will be returned when He will tell you what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He recalls your souls by night, and knows what you do by day; and then He raises you back each day in order that the term appointed by Him is fulfilled. Then to Him you will return whereupon He will let you know what you have been doing..\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who keeps you alive in your sleep at night and knows all that you do during the day. He wakes you up from your sleep to complete your worldly life, after which you will all return to Him. He will let you know all about what you had done in your worldly life.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who removes your souls at night (while asleep) and knows whatever you commit by day; then He raises you again during the day, to complete the term appointed (for you); then it is to Him that you are to return – He will then inform you of what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He, Who takes your souls by night (when you are asleep), and has knowledge of all that you have done by day, then he raises (wakes) you up again, that a term appointed be fulfilled, then (in the end), unto Him will be your return. Then He will inform you of what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who takes your souls at night (in sleep), and He knows what you acquire in the day, then He raises you up therein that an appointed term may be fulfilled; then to Him is your return, then He will inform you of what you were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who recalls you by night, and He knows what you work by day; then He raises you up therein, that a stated term may be determined; then unto Him shall you return, then He will tell you of what you have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who gathereth you at night and knoweth that which ye commit by day. Then He raiseth you again to life therein, that the term appointed (for you) may be accomplished. And afterward unto Him is your return. Then He will proclaim unto you what ye used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who gathers you in at night and knows all that you do by day; then He raises you up during the day so that an appointed term may be completed. Then to Him you shall return and He will declare to you all that you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is who taketh your souls by night, and knoweth that which ye earn by day. Then He raiseth you therein, that there may be fulfilled the term allotted. Thereafter unto Him shall be your return; and then He shall declare unto you that which ye have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who takes your souls by night, and He knows what you do by day, then He reanimates you therein so that a specified term may be completed. Then to Him will be your return, whereat He will inform you concerning what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who doth take your souls by night, and hath knowledge of all that ye have done by day: by day doth He raise you up again; that a term appointed be fulfilled; In the end unto Him will be your return; then will He show you the truth of all that ye did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He, Who takes your souls by night (when you are asleep), and has knowledge of all that you have done by day, then he raises (wakes) you up again that a term appointed (your life period) be fulfilled, then in the end unto Him will be your return. Then He will inform you what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who makes you to die by night, knowing what you have gained by day, and then resurrects you so that an ordained term is realized. To Him you shall return, and He will tell you of what you have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who takes you by night, and He knows what you earn by day. Then He raises you up in it, until a fixed term is fulfilled. Then to Him is your return, then He will inform you of what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who takes your souls by night and knows what you have committed by day. Then He revives you therein that a specified term may be fulfilled. Then to Him will be your return; then He will inform you about what you used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:60] It is He Who takes you at night, seizing your spirits during sleep, and He knows what you commit, [what] you earn, by day. Then He raises you up therein, that is, in the daytime, by restoring your spirits, so that an appointed term, namely, the term of life, may be accomplished; and afterward to Him is your return, through resurrection. Then He will inform you of what you used to do, and so requite you for it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "139 (He it is Who gathereth you at night) He takes your souls away in your sleep (and knoweth that which ye commit) you earn (by day. Then He raiseth you again to life) He returns to you again your souls (therein) in the day, (that the term appointed (for you) may be accomplished) that your lifespan and provisions reach their terms. (And afterward unto Him is your return) after you die. (Then He will proclaim unto you what ye used to do) of good and evil.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { جَرَحْتُم بِٱلنَّهَارِ } معناهُ كَسَبْتُم\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كيف يخرج عن حيطة علمه شيء من الكائنات والفاسدات؛ ذ { هُوَ ٱلَّذِي يَتَوَفَّٰكُم } أي: يغيب استعداداتكم { بِٱلَّيلِ } أي: في مقر البطون والغيب { وَ } في تلك المرتبة { يَعْلَمُ } بعلمه الحضوري { مَا جَرَحْتُم } أي شيء كسبتم واكتسبتم باستعداداتكم { بِٱلنَّهَارِ } أي: في قضاء الظهور والشهادة من المعارف والحقائق المقتضية للظهور والإظهار لو ظهرتم فيه { ثُمَّ يَبْعَثُكُمْ } ويظهركم { فِيهِ } أي: في فضاء الظهور والشهادة { لِيُقْضَىٰ أَجَلٌ مُّسَمًّى } عنده لاكتسابكم ما في استعدادكم { ثُمَّ } بعد انقطاع الأجل المسمى { إِلَيْهِ } لا إلى غيره { مَرْجِعُكُمْ } رجوع الظل إلى ذير الظل { ثُمَّ } بعدما رجعتم إليه { يُنَبِّئُكُم } يخبركم ويحاسبكم { بِمَا كُنتُمْ تَعْمَلُونَ } [الأنعام: 60] وتكسبون في نشأة ظهوركم وشهادتكم من الأعمال الصالحة للقبول، والفاسدة الموجبة للرد:\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}