{
  "chapter": "الأنعام",
  "text": "وهو القاهر فوق عباده ويرسل عليكم حفظة حتى اذا جاء احدكم الموت توفته رسلنا وهم لا يفرطون",
  "translations": [
    {
      "translation": "He is the Absolute Master over His slaves. He sends angels to watch over you. Then when death comes to one of you, Our messengers take him, and they do not fail in their task.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He has power over His creatures, and appoints guardians to watch over them. When death comes to one of you, Our messengers take away his soul, and do not falter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He alone holds sway over His servants and sets guardians over you till death approaches any of you and Our deputed angels take his soul, neglecting no part of their task.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Dominant over all His creatures and He sends guards to watch over you until death approaches you. Then His angelic Messengers will, without fail, take away your souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is Omnipotent over His bondmen and sends guardians over you; to the extent that when death comes to one of you, Our angels remove his soul, and they do not err.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Qahir over His servants, and He sends guardians over you, until when death approaches one of you, Our messengers take his soul, and they never neglect their duty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is the Supreme, above His servants, and He sends keepers over you; until when death comes to one of you, Our apostles cause him to die, and they are not remiss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Omnipotent over His servants. He sends recorders over you till, when any one of you is visited by death, Our messengers take him and they neglect not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Omnipotent over His slaves. He sendeth guardians over you until, when death cometh unto one of you, Our messengers receive him, and they neglect not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Absolute Master over His servants. He sends forth guardians [angels] who watch over you until, when death approaches one of you, Our angels take his soul, and they never fail in their duty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is the supreme over His creatures, and He sendeth guardians over you until when death cometh unto one of you Our messengers take his soul, and they fail not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the All-dominant over His servants, and He sends guards to [protect] you. When death approaches anyone of you, Our messengers take him away and they do not neglect [their duty].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the irresistible, (watching) from above over His worshippers, and He sets guardians over you. At length, when death approaches one of you, Our angels take his soul, and they never fail in their duty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Irresistible, Supreme over His slaves, and He sends guardians (angels guarding and writing all of one's good and bad deeds) over you, until when death approaches one of you, Our Messengers (angel of death and his assistants) take his soul, and they never neglect their duty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Conqueror over His worshipers. He sends forth guardians who watch over you until death comes to one of you, when Our messengers take him, and they are not neglectful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Conqueror over His servants, and He sends guardians over you, until, when death overtakes one of you, Our envoys take him away, and they never fail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He is the subjugator over His servants, and He sends over you guardian-angels until, when death comes to one of you, Our messengers take him, and they do not fail [in their duties].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:61] He is the Vanquisher, Superior, over His servants. And He sends guardians over you, angels, to record your deeds, until, when death approaches one of you, Our messengers, the angels charged with the seizing of the spirits, take him (tawaffathu; a variant reading has tawaffāhu) and they neglect not, they do not fall short of what they have been commanded.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He is the Omnipotent) the All-Conquering (over His slaves. He sendeth guardians) angels: two angels during the day and two at night; they record your good and bad deeds (over you until, when death cometh unto one of you, Our messengers) i.e. the angel of death and his assistants (receive him, and they neglect not) they do not delay the time of death by even a fraction of a second.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَهُمْ لاَ يُفَرِّطُونَ } معناهُ لا يَخَلُونَ شَيئاً\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And they do not neglect} means they do not leave anything.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } عليكم أيها الأطفال الهالكة ألا تغفلوا عن مقتضيات توحيد الله، ولا تخرجوا عن امتثال أحكامه الجارية على ألسنة رسله؛ إذ { هُوَ ٱلْقَاهِرُ } القادر الغالب { فَوْقَ عِبَادِهِ } الرقيب المحافظ لهم يحفظهم عما لا يعنيهم { وَ } من حفظه أنه { يُرْسِلُ عَلَيْكُم حَفَظَةً } من الملائكة يكتبون ويحصرون ما صدر عنكم { حَتَّىٰ إِذَا جَآءَ أَحَدَكُمُ ٱلْمَوْتُ } أي: الوقت الذي قدره الله لانقضاء الأجل المسمى { تَوَفَّتْهُ } أي: وفى عليه حسابه { رُسُلُنَا } أي: الموكلون عليكم { وَهُمْ } أي: الرسل { لاَ يُفَرِّطُونَ } [الأنعام: 61] ولا يفرطون أصلاً فيما صدر عنكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:18",
      "similarity": 0.5331985656977205
    },
    {
      "verse": "20:45",
      "similarity": 0.5047775633904581
    },
    {
      "verse": "38:65",
      "similarity": 0.43836458618013624
    },
    {
      "verse": "7:127",
      "similarity": 0.41307183277406695
    },
    {
      "verse": "39:56",
      "similarity": 0.41228952503202143
    }
  ]
}