{
  "chapter": "الأنعام",
  "text": "ثم ردوا۟ الى الله مولىهم الحق الا له الحكم وهو اسرع الحسبين",
  "translations": [
    {
      "translation": "Then they are returned to Allah, their Master, the Real. Jurisdiction belongs to Him alone and He is the Swiftest of Reckoners.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they are taken to God, their real lord and master. His indeed is the judgement; and He is swift at reckoning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then all are restored to Allah, their true protector. Behold, His is the judgement. He is the swiftest of those who take account.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(After death) you will all be returned to God, your true Guardian. Know that judgment will be in His Hands and that His reckoning is swift.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (the souls) are then returned towards their True Lord – Allah; pay heed! Only His is the command; and He is the Swiftest At Taking Account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they are returned to Allah, their Master, the Just Lord. Surely, His is the judgment and He is the swiftest in taking account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then are they sent back to Allah, their Master, the True one; now surely His is the judgment and He is swiftest in taking account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they are restored to God their Protector, the True. Surely His is the judgment; He is the swiftest of reckoners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then are they restored unto Allah, their Lord, the Just. Surely His is the judgment. And He is the most swift of reckoners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they will all be returned to God, their true Lord. The Judgement is His alone. He is the swiftest reckoner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they all shall be taken back unto Allah, their true Master. Lo! His shall be the judgement. And he is the Most Swift of reckoners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they are returned to Allah, their real master. Look! All judgement belongs to Him, and He is the swiftest of reckoners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then are men returned unto Allah, their protector, the (only) reality: Is not His the command? and He is the swiftest in taking account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they are returned to Allah, their Maula [True Master (God), the Just Lord (to reward them)]. Surely, His is the judgement and He is the Swiftest in taking account.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, they are returned to Allah their Guardian, the True. Surely, the judgement is for Him, He is the Swiftest of reckoners'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they are brought back to God, their True Master. Unquestionably, His is the judgment, and He is the Swiftest of reckoners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they His servants are returned to Allah, their true Lord. Unquestionably, His is the judgement, and He is the swiftest of accountants.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:62] Then they, creatures, are restored to God their Protector, their Possessor, the True, the Eternal, the Just, so that He might requite them. Surely His is the judgement, the decree that will be carried out in their case. He is the swiftest of reckoners, reckoning with the whole of creation in half a day of the days of this world, on the basis of a hadīth to this effect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then are they restored unto Allah) on the Day of Judgement, (their Lord, the Just) Who is in charge of their right and just reward and punishment; it is also said (their Lord, the Just) means: their true God whom they ought to have worshipped, but they did not worship Him truly as He ought to have been worshipped. However, objects of worship other than Allah are void. (Surely His is the judgement) between people on the Day of Judgement. (And He is the most swift of reckoners) when He takes people to task, He does so swiftly.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { رُدُّوۤاْ إِلَىٰ ٱللَّهِ } معناهُ إِلى رَبِّهمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Return to Allah,\" means to return to their Lord.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n والردّ أيضاً يكون في عين الجمع المطلق فإنه للجزاء { وهو أسرع الحاسبين } لوقوع حسابهم في آن وهو: توفيهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بعدما وفى الرسل حسابكم { رُدُّوۤاْ } للجزاء { إِلَىٰ ٱللَّهِ } الذي هو { مَوْلاَهُمُ ٱلْحَقِّ } العدل القائم بالقسط\n العالم بجميع أحوال عباده\n ليجازي كلاً على مقتضى علمه وخبرته { أَلاَ لَهُ ٱلْحُكْمُ } والأمر والجزاء { وَهُوَ أَسْرَعُ ٱلْحَاسِبِينَ } [الأنعام: 62]\n إذ لا يغيب عن حفظه شيء من أعمالهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ثم رُدّوا إلى الله } أي: إلى حُكمه وجزائه\n أو مشاهدته وقربه\n { مولاهم } الذي يتولى أمرهم\n { الحقِّ } أي: المتحقق وجوده\n وما سواه باطل\n { ألا له الحُكم } يومئذٍ\n لا حكم لغيره فيه\n { وهو أسرع الحاسبين } يحاسب الخلائق في مقدار حلب شاة\n لا يشغله حساب عن حساب\n ولا شأن عن شأن\n سبحانه لا إله إلا هو\n الإشارة: وهو الذي يتوفاكم\n أي: يخلصكم بليل القبض\n ويعلم ما كسبتم في نهار البسط\n ثم يبعثكم من ليل القبض إلى نهار البسط\n وهكذا ليقضى أجل مسمى للإقامة فيهما\n ثم إليه مرجعكم بالخروج عنهما لتكونوا لله لا شيء دونه\n وفي الحكم: \" بسطك كي لا يبقيك مع القبض\n وقبضك كي لا يتركك مع البسط\n وأخرجك عنهما\n كي لا تكون لشيء دونه \"\n وقال فارس رضي الله عنه: القبض أولاً ثم البسط\n ثم لا قبض ولا بسط لأن القبض والبسط يقعان في الوجود أي في وجود النفس\n وأما مع الفناء والبقاء فلا\n هـ\n أي: فلا قبض ولا بسط لأن العارف الواصل مقبوض في بسطه\n مبسوط في قبضه\n لا تؤثر فيه هواجم الأحوال لأنه مالك غير مملوك\n والله تعالى أعلم\n ومن علم أن الله قاهر فوق عباده\n انسلخ من حوله وقوته\n وانعزل عن تدبيره واختياره لإحاطة القهرية به\n ومن تحقق عموم قهاريته تعالى\n علم أنه لا حجاب حسي بينه وبينه\n إذ لو حجبه شيء لستره ما حجبه\n ولو كان له ساتر لكان لوجوده حاصر\n وكل حاصر لشيء فهو له قاهر\n  وهو القاهر فوق عباده\n وإنما المحجوب: العبد عن ربه بوجود وهمه وجهله\n ومن تحقق أن الملائكة تحفظ أعماله استحيا من ارتكاب القبائح\n لئلا تعرض على رؤوس الأشهاد\n ثم أمرهم بالرجوع إليه عند الشدائد\n فقال: { قُلْ مَن يُنَجِّيكُمْ مِّن ظُلُمَاتِ ٱلْبَرِّ وَٱلْبَحْرِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:51",
      "similarity": 0.5224302986247573
    },
    {
      "verse": "40:17",
      "similarity": 0.5028762172129935
    },
    {
      "verse": "2:202",
      "similarity": 0.4787690430087523
    },
    {
      "verse": "3:19",
      "similarity": 0.4421923907663563
    },
    {
      "verse": "23:61",
      "similarity": 0.4413699767827195
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006062.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006062.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:62.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}