{
  "chapter": "الأنعام",
  "text": "قل من ينجيكم من ظلمت البر والبحر تدعونه تضرعا وخفية لئن انجىنا من هذه لنكونن من الشكرين",
  "translations": [
    {
      "translation": "Say: 'Who rescues you from the darkness of the land and sea? You call on Him humbly and secretly: \"If you rescue us from this, we will truly be among the thankful.'\"",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask: \"Who is it who comes to your rescue in the darkness of the desert and the sea, and whom you supplicate humbly and unseen: 'If You deliver us from this, we shall indeed he grateful?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them (O Muhammad!): 'Who is it that delivers you from dangers in the deep darknesses of the land and the sea, and to whom do you call in humility and in the secrecy of your hearts? To whom do you pray: \"If He will but save us from this distress, we shall most certainly be among the thankful?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), ask them, \"Who would save you from the darkness of the land and sea if you were to pray humbly and secretly saying, 'Would that we were saved from this, for we would certainly then give thanks\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Who rescues you from the calamities of the land and the sea – Whom you call upon crying loudly and in whispers that, ‘If we are saved from this we will surely be grateful’?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who rescues you from the dark recesses of the land and the sea, when you call upon Him begging and in secret (saying): `If He (Allah) only saves us from these (dangers), we shall truly be grateful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Who is it that delivers you from the dangers of the land and the sea (when) you call upon Him (openly) humiliating yourselves, and in secret: If He delivers us from this, we should certainly be of the grateful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Who delivers you from the shadows of land and sea? You call upon Him humbly and secretly, \"Truly, if Thou deliverest from these, we shall be among the thankful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Who delivereth you from the darkness of the land and the sea? Ye call upon Him humbly and in secret, (saying): If we are delivered from this (fear) we truly will be of the thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who is it who delivers you from the dark depths of land and sea when you call out to Him humbly and in secret, saying, \"If He rescues us from this, we shall most certainly be among the grateful.\"?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: who delivereth you from the darknesses of the land and the sea, when ye cry unto Him in humility and in secrecy: if He delivered us from this, we shall surely be of the thankful?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Who delivers you from the darkness of land and sea, [when] You invoke Him suppliantly and secretly: ‘‘If He delivers us from this, we will surely be among the grateful’’?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who is it that delivereth you from the dark recesses of land and sea, when ye call upon Him in humility and silent terror: 'If He only delivers us from these (dangers), (we vow) we shall truly show our gratitude'?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Who rescues you from the darkness of the land and the sea (dangers like storms), when you call upon Him in humility and in secret (saying): If He (Allah) only saves us from this (danger), we shall truly be grateful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Who saves you from the darkness of the land and sea, when you call out to Him humbly and in secret, (saying:) \"If You save us from this, we will be among the thankful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Who delivers you from the darkness of land and sea?” You call upon Him humbly and inwardly: “If He delivers us from this, We will surely be among the thankful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who rescues you from the darknesses of the land and sea [when] you call upon Him imploring [aloud] and privately, 'If He should save us from this [crisis], we will surely be among the thankful.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:63] Say, O Muhammad (s), to the people of Mecca: ‘Who delivers you from the darkness of the land and the sea, [from] their terrors, during your journeys? When, you call upon Him openly and secretly, saying: “Verily, if (la-in, the lām is for oaths) You, God, deliver us (anjaytanā, is also read anjānā, ‘[if] He delivers us’), from this, darkness and hardship, we shall truly be among the thankful”’, the believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad to the disbelievers of Mecca: (Who delivereth you from the darkness) from the hardships and tumults (of the land and the sea? Ye call upon Him humbly and in secret) openly and in secret, ((saying): If we are delivered from this) from these hardships and tumults (we truly will be of the thankful) of the believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ قل من ينجيكم من ظلمات البرّ } التي هي حجب الغواشي البدنية والصفات النفسانية { و } ظلمات { البحر } التي هي حجب صفات القلوب وفكر العقول { تدعونه } إلى كشفها { تضرّعاً } في نفوسكم { وخفية } في أسراركم { لئن أنجيتنا من هذه } الحجب { لنكوننّ من } الذين شكروا نعمة الإنجاء بالاستقامة والتمكين { قل الله ينجيكم منها } بكشف تلك الحجب بأنوار تجليات صفاته { ومن كل كرب } أي: ما بقي في استعدادكم بالقوة من كمالاتكم بإبرازها حتى لو كانت بقية من بقايا وجودكم كرباً لكم لاستعدادكم للفناء والخلاص منها بالكلية لقوة الاستعداد وكمال الشوق لأنجاكم منها { ثم أنتم } بعد علمكم بهذا المقام الشريف وما ادّخر لكم { تشركون } به أنفسكم وأهواءكم فتعبدونها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ مَن يُنَجِّيكُمْ مِّن ظُلُمَاتِ ٱلْبَرِّ وَٱلْبَحْرِ } أي: شدائدها وأهوالها حين { تَدْعُونَهُ تَضَرُّعاً } متضرعين معلنين { وَخُفْيَةً } مناجين مسرين قائلين: { لَّئِنْ أَنجَانَا } الله بلطفه { مِنْ هَـٰذِهِ } الأهوال والمخاوف { لَنَكُونَنَّ } لنعمه الصارفين لها إلى مقتضى ما امره الحق ورضي عنه { مِنَ ٱلشَّاكِرِينَ } [الأنعام: 63]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { قل من ينجيكم } أي: يُخلصكم { من ظلمات البر والبحر } أي: من شدائدهما\n استعير الظلمة للشدة\n لمشاركتهما في الهول\n فقيل لليوم الشديد: يوم مظلم\n أو: من الخسف في البر والغرق في البحر\n حال كونكم { تدعونه تضرعًا وخُفية } أي: جهرًا وسرًا\n قائلين: { لئن أنجيتنا من هذه } الظلمة\n أي: الشدة\n { لنكونن من الشاكرين } بإقرارنا بوحدانيتك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:55",
      "similarity": 0.7238542945749062
    },
    {
      "verse": "88:6",
      "similarity": 0.5880577192856874
    },
    {
      "verse": "6:42",
      "similarity": 0.5595078190488516
    },
    {
      "verse": "7:94",
      "similarity": 0.5357467325698777
    },
    {
      "verse": "6:43",
      "similarity": 0.39149497231009966
    }
  ]
}