{
  "chapter": "الأنعام",
  "text": "قل هو القادر على ان يبعث عليكم عذابا من فوقكم او من تحت ارجلكم او يلبسكم شيعا ويذيق بعضكم باس بعض انظر كيف نصرف الءايت لعلهم يفقهون",
  "translations": [
    {
      "translation": "Say: 'He possesses the power to send you punishment from above your heads or from beneath your feet, or to confuse you in sects and make you taste one another's violence.' Look how We vary the Signs so that hopefully they will understand.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"He has power to send you retribution from the skies above, or the earth beneath your feet, or confound you with divisions among you, and give one the taste of the vengeance of the other.\" See, how distinctly We explain Our signs that they may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It is He Who has the power to send forth chastisement upon you from above you, or from beneath your feet, or split you into hostile groups and make some of you taste each others' violence. Behold, how We set forth Our signs in diverse forms, so that maybe they will understand the Truth\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"God has the power to send torment on you from above or below your feet, or to divide you into different groups quite hostile to one another, and make you suffer from each other's animosity.\" Consider how plainly We show them a variety of evidence (of the Truth) so that they may have understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “He is Able to send punishment upon you from above you or from beneath your feet, or to cause you to fight each other by dividing you into different groups, and make you taste the harshness of one another”; observe how We explain the verses so that they may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"He has the power to send torment on you from above or from under your feet, or to Yalbisakum in party strife, and make you taste the violence of one another.\" See how variously We explain the Ayat, so that they may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: He has the power that He should send on you a chastisement from above you or from beneath your feet, or that He should throw you into confusion, (making you) of different parties; and make some of you taste the fighting of others. See how We repeat the communications that they may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'He is able to send forth upon you chastisement, from above you or from under your feet, or to confuse you in sects and to make you taste the violence of one another.' Behold how We turn about the signs; haply they will understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: He is able to send punishment upon you from above you or from beneath your feet, or to bewilder you with dissension and make you taste the tyranny one of another. See how We display the revelations so that they may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"He has the power to send punishment on you from above your heads or from beneath your feet, or to divide you in sects and make you taste one another's violence.\" See how We explain Our revelations in various ways, so that they may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: He is Able to stir up torment on you from above you or from beneath your feet or to confound you by factions and make you taste the violence of one anot her. Behold! how variously We propound the signs that haply they may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘He is able to send upon you a punishment from above you or from under your feet, or confound you as [hostile] factions, and make you taste one another’s violence.’ Look, how We paraphrase the signs variously so that they may understand!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"He hath power to send calamities on you, from above and below, or to cover you with confusion in party strife, giving you a taste of mutual vengeance - each from the other.\" See how We explain the signs by various (symbols); that they may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"He has power to send torment on you from above or from under your feet, or to cover you with confusion in party strife, and make you to taste the violence of one another.\" See how variously We explain the Ayat (proofs, evidences, lessons, signs, revelations, etc.), so that they may understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'He is Able to send forth upon you punishment from above you or beneath your feet, or to divide you into discordant factions, and to make some of you taste the affliction of the other' Look how We make plain Our verses, in order that they understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “He is Able to send upon you an affliction, from above you, or from under your feet. Or He can divide you into factions, and make you taste the violence of one another. Note how We explain the revelations, so that they may understand.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"He is the [one] Able to send upon you affliction from above you or from beneath your feet or to confuse you [so you become] sects and make you taste the violence of one another.\" Look how We diversify the signs that they might understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:65] Say: ‘He has the power to send forth upon you a chastisement from above you, from the heaven, such as stones [cf. Q. 8:32] or a Cry [cf. Q. 11:67], or from beneath your feet, such as the causing of the earth to cave in [cf. Q. 29:40], or to confound you, to confuse you, in parties, sects with differing whims, and to make you taste the violence of one another’, through fighting. When this [verse] was revealed, the Prophet (s) said, ‘This [chastisement etc.] is easier and lighter’; but when the last statement was revealed, he said, ‘I seek refuge with Your Countenance!’, as reported by al-Bukhārī. Muslim reports the [following] hadīth: ‘I requested from my Lord not to make my community violent towards each other, but He denied me this [request]’. In another hadīth, when it was revealed, he [is reported to have] said, ‘As for this, it will surely come to pass, even though its proper meaning has not yet come’. See how We dispense, [how] We clarify for them, the signs, the proofs of Our power, that perhaps they might understand, that they might realise that what they follow is falsehood.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ هُوَ القادر على أَن يَبْعَثَ عَلَيْكُمْ عَذَاباً مِّن فَوْقِكُمْ أَوْ مِن تَحْتِ أَرْجُلِكُمْ أَوْ يَلْبِسَكُمْ شِيَعاً وَيُذِيقَ بَعْضَكُمْ بَأْسَ بَعْضٍ }.استئناف ابتدائي عُقّب به ذكرُ النعمة التي في قوله : { قل من يُنجّيكم } بذكر القدرة على الانتقام ، تخويفاً للمشركين . وإعادة فعل الأمر بالقول مثل إعادته في نظائره للاهتمام المبيَّن عند قوله تعالى : { قل أرأيتكم إن أتاكم عذاب الله أو أتتكم الساعة } \\[ الأنعام : 40 \\]. والمعنى قل للمشركين ، فالمخاطب بضمائر الخطاب هم المشركون . والمقصود من الكلام ليس الإعلام بقدرة الله تعالى فإنَّها معلومة ، ولكن المقصود التهديد بتذكيرهم بأنّ القادر من شأنه أن يُخاف بأسُه فالخبر مستعمل في التعريض مجازاً مرسلاً مركّباً ، أو كناية تركيبية . وهذا تهديد لهم ، لقولهم { لولا أنزل عليه آية من ربِّه } \\[ يونس : 20 \\].وتعريف المسند والمسند إليه أفاد القصر ، فأفاد اختصاصه تعالى بالقدرة على بعث العذاب عليهم وأنّ غيره لا يقدر على ذلك فلا ينبغي لهم أن يخشوا الأصنام ، ولو أرادوا الخير لأنفسهم لخافوا الله تعالى وأفردوه بالعبادة لمرضاته ، فالقصر المستفاد إضافي . والتعريف في { القادر } تعريف الجنس ، إذ لا يقدر غيره تعالى على مثل هذا العذاب .والعذاب الذي من فوق مثل الصواعق والريح ، والذي من تحت الأرجل مثل الزلازل والخسف والطوفان .و { يلبسكم } مُضارع لَبَسَه بالتحريك أي خلطه ، وتعدية فعل { يلبسكم } إلى ضمير الأشخاص بتقدير اختلاط أمرهم واضطرابه ومَرجه ، أي اضطراب شؤونهم ، فإنّ استقامة الأمور تشبه انتظام السلك ولذلك سمَّيت استقامة أمور الناس نظاماً . وبعكس ذلك اختلال الأمور والفوضى تشبه اختلاط الأشياء ، ولذلك سمّي مَرَجاً ولَبْساً . وذلك بزوال الأمن ودخول الفساد في أمور الأمّة ، ولذلك يقرن الهَرْج وهو القتل بالمَرْج ، وهو الخلط فيقال : هم في هَرْج ومَرْج ، فسكون الراء في الثاني للمزاوجة .وانتصب { شِيَعاً } على الحال من الضمير المنصوب في { يَلْبِسَكم }.والشيَع جمع شيعة بكسر الشين وهي الجماعة المتَّحدة في غرض أو عقيدة أو هوى فهم متّفقون عليه ، قال تعالى : { إنّ الذين فرّقوا دينهم وكانوا شيَاً لست منهم في شيء } \\[ الأنعام : 159 \\]. وشيعة الرجل أتباعه والمقتدون به قال تعالى : { وإنّ من شيعته لإبراهيم } \\[ الصافات : 83 \\] أي من شيعة نوح .وتشتّت الشيع وتعدّد الآراء أشدّ في اللبس والخلط ، لأنّ اللبس الواقع كذلك لبس لا يرجى بعده انتظام .وعطف عليه { ويذيق بعضَكم بأس بعض } لأنّ من عواقب ذلك اللبس التقاتل . فالبأس هو القتل والشرّ ، قال تعالى : { وسرابيل تقيكم بأسكم } \\[ النحل : 81 \\]. والإذاقة استعارة للألم .وهذا تهديد للمشركين كما قلنا بطريق المجاز أو الكناية . وقد وقع منه الأخير فإنّ المشركين ذاقوا بأس المسلمين يومَ بدر وفي غزوات كثيرة .في «صحيح البخاري» عن جابر بن عبد الله قال : \" لما نزلتْ { قُلْ هو القادر على أن يبعث عليكم عذاباً من فوقكم } قال رسول صلى الله عليه وسلم أعوذُ بوجهك . قال : { أوْ من تحت أرجلكم } قال : أعوذ بوجهك قال : { أو يلبِسكم شيعاً ويذيق بعضكم بأس بعض } قال رسول الله : هذا أهون ، أو هذا أيسر \"اه . واستعاذة النبي صلى الله عليه وسلم من ذلك خشية أن يعمّ العذاب إذا نزل على الكافرين مَن هو بجوارهم من المسلمين لقوله تعالى : { واتَّقُوا فتنة لا تصيبنّ الذين ظلموا منكم خاصّة } \\[ الأنفال : 25 \\] وفي الحديث قالوا : « يا رسول الله أنهلك وفينا الصالحون قال : نعم إذا كثر الخبث » وفي الحديث الآخر « ثم يُحْشَرُون على نيّاتهم » ومعنى قوله : هذه أهون ، أنّ القتل إذا حلّ بالمشركين فهو بيد المسلمين فيلحق المسلمين منه أذى عظيم لكنَّه أهون لأنَّه ليس فيه استئصال وانقطاع كلمة الدين ، فهو عذاب للمشركين وشهادة وتأييد للمسلمين . وفي الحديث : « لا تتمنَّوا لقاء العدوّ واسألوا الله العافية » وبعض العلماء فسّر الحديث بأنَّه استعاذ أن يقع مثل ذلك بين المسلمين . ويتَّجه عليه أن يقال : لماذا لم يستعذ الرسول صلى الله عليه وسلم من وقوع ذلك بين المسلمين ، فلعلّه لأنه أوحي إليه أنّ ذلك يقع في المسلمين ، ولكن الله وعده أن لا يسلِّط عليهم عدوّاً من غير أنفسهم . وليست استعاذته بدالة على أنّ الآية مراد بها خطاب المسلمين كما ذهب إليه بعض المفسّرين ، ولا أنَّها تهديد للمشركين والمؤمنين ، كما ذهب إليه بعض السلف؛ إلاّ على معنى أنّ مفادها غيرَ الصريح صالح للفريقين لأنّ قدرة الله على ذلك صالحة للفريقين ، ولكن المعنى التهديدي غير مناسب للمسلمين هنا . وهذا الوجه يناسب أن يكون الخبر مستعملاً في أصل الإخبار وفي لازمه فيكون صريحاً وكناية ولا يناسب المجاز المركّب المتقدّم بيانه .{ انظر كَيْفَ نُصَرِّفُ الايات لَعَلَّهُمْ يَفْقَهُونَ }.استئناف وردَ بعد الاستفهامين السابقين . وفي الأمر بالنظر تنزيل للمعقول منزلة المحسوس لقصد التعجيب منه ، وقد مضى في تفسير قوله تعالى : { انظر كيف يفترون على الله الكذب } في سورة \\[ النساء : 50 \\]وتصريف الآيات تنويعها بالترغيب تارة والترهيب أخرى . فالمراد بالآيات آيات القرآن . وتقدّم معنى التصريف عند قوله تعالى : { انظر كيف نصرّف الآيات ثم هم يصدفون } في هذه السورة \\[ 46 \\].{ ولعلّهم يفقهون } استئناف بياني جواب لسؤال سائل عن فائدة تصريف الآيات ، وذلك رجاء حصول فهمهم لأنَّهم لعنادهم كانوا في حاجة إلى إحاطة البيان بأفهامهم لعلَّها تتذكَّر وترعوي .وتقدّم القول في معنى ( لعلّ ) عند قوله تعالى : { لعلّكم تتّقون } في سورة \\[ البقرة : 21 \\].وتقدّم معنى الفقه عند قوله تعالى : { فما لهؤلاء القوم لا يكادون يفقهون حديثاً } في سورة \\[ النساء : 78 \\].\n\n",
      "translations": [
        {
          "translation": "(Say) to them, Muhammad: (He is able to send punishment upon you from above you) as He did on the people of Noah and the people of Lot (or from beneath your feet) or make the earth swallow you as it swallowed Korah, (or to bewilder you with dissension) make divide into conflicting sects as He did with the Children of Israel after the prophets (and make you taste the tyranny) the sword of (one of another. See) Muhammad (how We display the revelations) how We expound in the Qur'an the events of past nations and that which We did with them (so that they may understand) so that they may understand Allah's commands and His divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوْ يَلْبِسَكُمْ شِيَعاً } معناهُ أَو يَخْلِطكُمْ شِيعاً أي فِرقاً واحدُهَا شِيعَةٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Or He will mix you together as a group,\" means that He will mix you together as a group, that is, as one faction.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { قل هو القادر على أن يبعث عليكم عذاباً من فوقكم } باحتجابكم بالمعقولات والحجب الروحانيات { أو من تحت أرجلكم } باحتجابكم بالحجب الطبيعية { أو يلبسكم شيعاً } أو يخلطكم فرقاً متفرقة كل فرقة على دين قوة من قواكم هي أمامهم تقابل الفرقة الأخرى فيقع بينكم الهرج والمرج والقتال\n أو فرقاً مختلفة العقائد كل فرقة على دين دجال أو شيطان أنسيّ أو جنيّ هو إمامهم\n أو يجعل أنفسكم شيعاً باستيلاء كل قوة من قواكم على القلب بطلب لذتها المخصوصة بها\n إحداها تجذبه إلى غضب والأخرى إلى شهوة أو طمع أو غير ذلك\n فيغرق القلب عاجزاً فيما بينهم\n أسيراً في قبضتهم\n كلما همّ بتحصيل لذة هذه منعته الأخرى\n ويقع بينهم الهرج والمرج في وجودكم لعدم ارتياضهم بسياسة رئيس واحد قاهر يقهرهم ويسوسهم بأمر وحدانيّ يقيم كلاًّ منهم في مقامها\n مطيعة منقادة فتستقيم مملكة الوجود ويستقرّ الملك على رئيس القلب\n وعلى هذا التأويل يكون كل واحد منهم فرقة أو فرقاً متفرقة على أديان شتى لا شخصاً واحداً",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ هُوَ ٱلْقَادِرُ } المقتدر { عَلَىٰ أَن يَبْعَثَ عَلَيْكُمْ عَذَاباً } نازلاً { مِّن فَوْقِكُمْ } مثل الرعد والبرق والصواعق الكائنة في الجو { أَوْ } حادثاً { مِن تَحْتِ أَرْجُلِكُمْ } مثل الزلزلة والغرق وغير ذلك { أَوْ يَلْبِسَكُمْ } ويخلط عليكم أهواءكم ويجعلكم { شِيَعاً } فرقاً متخالفة متقابلة { وَيُذِيقَ بَعْضَكُمْ بَأْسَ بَعْضٍ } بالقتل والسبي والإجلاء { ٱنْظُرْ } أيها الرائي { كَيْفَ نُصَرِّفُ } نجدد ونكرر لهم { ٱلآيَاتِ } أي: دلائل توحيدنا وشواهده { لَعَلَّهُمْ يَفْقَهُونَ } الأنعام: 65] رجاء أن يتفطنوا إلى سر توحيدنا وسريان هويتنا في مظاهرنا\n ومع ذلك لم ينتبهوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { قل } يا محمد: { هو القادر على أن يبعث عليكم عذابًا من فوقكم } \n كما فعل بقوم نوح ولوط وأصحاب الفيل\n { أو من تحت أرجُلِكُم } \n كما أغرق فرعون وخسف بقارون\n وقيل: من فوقكم: بتسليط أكابركم وحكامكم عليكم\n ومن تحت أرجلكم: سفلتكم وعبيدكم\n { أو يَلبسكم } أي: يَخلطكم { شيعًا } أي: فِرَقًا متحزبين على أهواء شتى\n فينشب القتال بينكم\n { ويُذيق بعضكم بأس بعض } \n بقتال بعضكم بعضًا\n وفي الحديث عنه صلى الله عليه وسلم: أنه لما نزلت: { أن يبعث عليكم عذابًا من فوقكم } قال:\n \" أعُوذُ بِوَجهِكَ \" \n\n ولما نزلت: { أو من تحت أرجلكم } قال أيضًا:\n \" أعُوذُ بِوَجهِكَ \" \nولما نزلت: { أو يلبسكم شيعًا } قال:\n \" هذَا أهوَنُ \" \n\n فقضى الله على هذه الأمة بالقتل والقتال إلى يوم القيامة\n نعوذ بالله من الفتن\n قال تعالى: { انظر كيف نُصرف الآيات } أي: نُقبلها بورود الوعد والوعيد { لعلهم يفقهون } ما نزل إليهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:83",
      "similarity": 0.365323329454254
    },
    {
      "verse": "15:10",
      "similarity": 0.36524529166318487
    },
    {
      "verse": "54:51",
      "similarity": 0.35296123579029304
    },
    {
      "verse": "9:127",
      "similarity": 0.34905770196997127
    },
    {
      "verse": "24:19",
      "similarity": 0.3320151991028519
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006065.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006065.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:65.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}