{
  "chapter": "الأنعام",
  "text": "وكذب به قومك وهو الحق قل لست عليكم بوكيل",
  "translations": [
    {
      "translation": "This (Book) has been called by your people a falsehood though it is the truth. Say: \"I am not a warden over you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your people have denied it even though it is the Truth. Say: \"I am not a guardian over You.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Some of) your people have rejected the Quran, although it is the Truth. Tell them that you are not their guardian\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your people (O dear Prophet Mohammed – peace and blessings be upon him) denied it whereas this is undoubtedly the truth; say, “I am not responsible for you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But your people have denied it (the Qur'an) though it is the truth. Say: \"I am not responsible for your affairs.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your people call it a lie and it is the very truth. Say: I am not placed in charge of you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy people have cried it lies; yet it is the truth. Say: 'I am not a guardian over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy people (O Muhammad) have denied it, though it is the Truth. Say: I am not put in charge of you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your people have rejected the message We have sent through you, though it is the truth. Say \"I am not your keeper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thy people belie it, while it is certain to befall. Say thou: I am not over you a trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your people have denied it, though it is the truth. Say, ‘It is not my business to watch over you.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But thy people reject this, though it is the truth. Say: \"Not mine is the responsibility for arranging your affairs;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But your people (O Muhammad SAW) have denied it (the Quran) though it is the truth. Say: \"I am not responsible for your affairs.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your nation has belied it (the Koran), although it is the truth. Say: 'I am not a guardian over you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But your people rejected it, though it is the truth. Say, “I am not responsible for you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But your people have denied it while it is the truth. Say, \"I am not over you a manager.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:66] Your people have denied it, the Qur’ān. Yet it is the truth. Say, to them: ‘I am not a guardian over you, to requite you. I am only a warner and your affair is left to God — this was [revealed] before the command to fight [the idolaters].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Your people) the Quraysh ((0 Muhammad) have denied it) the Qur'an, (though it) the Qur'an (is the Truth. Say) Muhammad: (I am not put in charge of you) I do not guarantee to take you to Allah as believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من عدم تفطنهم وتنبههم { كَذَّبَ بِهِ } أي: بما جاء من عندنا إليك من الكتاب الجامع للكتب السالفة { قَوْمُكَ } يعني: قريشاً، ونسبوه لا ما لا يليق بجنابنا { وَ } الحال أنه { هُوَ ٱلْحَقُّ } المطابق للواقع نزوله منا إليك { قُل } لهم في مقابلة تكذيبهم: { لَّسْتُ عَلَيْكُمْ بِوَكِيلٍ } [الأنعام: 66] موكل لحفظكم ليحفظكم عما يضركم بل ما علي إلا البلاغ والحفظ والوقاية بيد الله\nط\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكذَّب به قومك } أي: بالعذاب، أو بالقرآن، { وهو الحق } أي: الواقع لا محالة، أو الصدق في أخباره وأحكامه، { قل لست عليكم بوكيل } أي: وكُل إليَّ أمركم فأمنعكم من التكذيب، أو أجازيكم، إنما أنا منذر، والله هو الحفيظ",
      "translations": []
    }
  ]
}