{
  "chapter": "الأنعام",
  "text": "واذا رايت الذين يخوضون فى ءايتنا فاعرض عنهم حتى يخوضوا۟ فى حديث غيره واما ينسينك الشيطن فلا تقعد بعد الذكرى مع القوم الظلمين",
  "translations": [
    {
      "translation": "Their reckoning is in no way the responsibility of those who have taqwa. But remind them so that hopefully they themselves will gain taqwa.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you see them argue about Our messages, withdraw from their company until they begin to talk of other things. In case the Devil makes you forget, leave the company of these unjust people the moment you remember this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you see those who are engaged in blasphemy against Our signs, turn away from them until they begin to talk of other things; and should Satan ever cause you to forget, then do not remain, after recollection, in the company of those wrong-doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you see people mocking Our revelations, turn away from them so that they may change the subject. If Satan causes you to forget this, do not sit with the unjust people when you remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O listener (followers of this Prophet) when you see those who argue in Our verses, turn away from them until they engage in another topic; and if the devil causes you to forget, then do not sit with the unjust after remembering.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you see those who engage in false conversation about Our verses (of the Qur'an) by mocking at them, stay away from them till they turn to another topic. And if Shaytan causes you to forget, then after the remembrance, sit not you in the company of those people who are the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you see those who enter into false discourses about Our communications, withdraw from them until they enter into some other discourse, and if the Shaitan causes you to forget, then do not sit after recollection with the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When thou seest those who plunge into Our signs, turn away from them until they plunge into some other talk; or if Satan should make thee forget, do not sit, after the reminding, with the people of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thou seest those who meddle with Our revelations, withdraw from them until they meddle with another topic. And if the devil cause thee to forget, sit not, after the remembrance, with the congregation of wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you see people engaged in finding fault with Our revelations, withdraw from them until they turn to some other topic. Should Satan cause you to forget this, take leave of the wrongdoers as soon as you remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thou seest those who plunge in Our revelations keep away from them until they plunge in a discourse other than that; and if the Satan causeth thee to forget, then sit not thou, after the recollection, with the wrong-doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you see those who gossip impiously about Our signs, avoid them until they engage in some other discourse; but if Satan makes you forget, then, after remembering, do not sit with the wrongdoing lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When thou seest men engaged in vain discourse about Our signs, turn away from them unless they turn to a different theme. If Satan ever makes thee forget, then after recollection, sit not thou in the company of those who do wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you (Muhammad SAW) see those who engage in a false conversation about Our Verses (of the Quran) by mocking at them, stay away from them till they turn to another topic. And if Shaitan (Satan) causes you to forget, then after the remembrance sit not you in the company of those people who are the Zalimun (polytheists and wrong-doers, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you see those who plunge (scoffing) into Our verses, withdraw from them till they plunge into some other talk. If satan causes you to forget, leave the wrongdoing people as soon as you remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you encounter those who gossip about Our revelations, turn away from them, until they engage in another topic. But should Satan make you forget, do not sit after the recollection with the wicked people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you see those who engage in [offensive] discourse concerning Our verses, then turn away from them until they enter into another conversation. And if Satan should cause you to forget, then do not remain after the reminder with the wrongdoing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:68] When you see those who engage in discourse about Our signs, the Qur’ān, in mockery, turn away from them, and do not sit with them, until they discourse on some other topic. And if (immā: the letter nūn of the conditional particle in has been assimilated with the extra mā) Satan should make you forget (read yunsiyannaka or yunassiyannaka), and you sit with them, then do not sit, after the reminder, that is, [after] you remember, with the evildoing folk (the overt noun [al-qawm al-zālimīn, ‘the evildoing folk’] replaces the [third person] pronominalisation).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when thou seest those who meddle with Our revelations) those who mock you and mock the Qur'an, (withdraw from them) leave their assembly (until they meddle with another topic) such that they talk about something other than the Qur'an and such that they cease mocking you. (And if the devil cause thee to forget) after being warned against it, (sit not, after the remembrance) after being reminded, (with the congregation of wrong-doers) the idolaters. Allah commanded His Prophet with this in Mecca, but the prophetic Companions found it hard to implement. They were later given dispensation to sit with the idolaters so as to admonish and warn them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِذَا رَأَيْتَ } يا أكمل الرسل { ٱلَّذِينَ يَخُوضُونَ فِيۤ ءَايَاتِنَا } يالطعن والتكذيب { فَأَعْرِضْ عَنْهُمْ } ولا تصاحبهم، وأخرج من بينهم { حَتَّىٰ } لا تكومن سبباً لاستهزائهم و { يَخُوضُواْ فِي حَدِيثٍ غَيْرِهِ } أي: غير القدح والطعن في القرآن { وَإِمَّا يُنسِيَنَّكَ ٱلشَّيْطَٰنُ } الخروج بعد وقوفك بأباطيلهم { فَلاَ تَقْعُدْ بَعْدَ ٱلذِّكْرَىٰ } والتذكير البتة { مَعَ ٱلْقَوْمِ ٱلظَّٰلِمِينَ } [الأنعام: 68] الطاعنين على الله بما لا يليق بجانابه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وَإِذَا رَأَيْتَ ٱلَّذِينَ يَخُوضُونَ فِيۤ آيَاتِنَا فَأَعْرِضْ عَنْهُمْ حَتَّىٰ يَخُوضُواْ فِي حَدِيثٍ غَيْرِهِ وَإِمَّا يُنسِيَنَّكَ ٱلشَّيْطَانُ فَلاَ تَقْعُدْ بَعْدَ ٱلذِّكْرَىٰ مَعَ ٱلْقَوْمِ ٱلظَّالِمِينَ وَمَا عَلَى ٱلَّذِينَ يَتَّقُونَ مِنْ حِسَابِهِم مِّن شَيْءٍ وَلَـٰكِن ذِكْرَىٰ لَعَلَّهُمْ يَتَّقُونَ وَذَرِ الَّذِينَ ٱتَّخَذُواْ دِينَهُمْ لَعِباً وَلَهْواً وَغَرَّتْهُمُ ٱلْحَيَاةُ ٱلدُّنْيَا\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:140",
      "similarity": 0.7048779848587847
    },
    {
      "verse": "74:45",
      "similarity": 0.58505496245783
    },
    {
      "verse": "52:12",
      "similarity": 0.5039600038905709
    },
    {
      "verse": "43:83",
      "similarity": 0.4843313203841834
    },
    {
      "verse": "70:42",
      "similarity": 0.4843313203841834
    }
  ]
}