{
  "chapter": "الأنعام",
  "text": "وما على الذين يتقون من حسابهم من شىء ولكن ذكرى لعلهم يتقون",
  "translations": [
    {
      "translation": "Abandon those who have turned their deen into a game and a diversion and who have been deluded by the life of this world. Remind by it lest a person is delivered up to destruction for what he has earned with no protector or intercessor besides Allah. Were he to offer every kind of compensation, it would not be accepted from him. Such people are delivered up to destruction for what they have earned. They will have scalding water to drink and a painful punishment because they were kafir.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for the heedful and devout, they are not accountable for them, but should give advice: They may haply come to fear God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who are God-fearing are by no means accountable for the others except that it is their duty to adinonish them; maybe then, they will shun evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who observe piety (commit no sin) by sitting with the (unbelievers) in order to preach (the Truth) so that they, too, may become pious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the pious are not accountable for them in the least, apart from the giving of advice so that they may avoid.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is no responsibility for them upon those who have Taqwa, but (their duty) is to remind them, that they may (attain) Taqwa.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And nought of the reckoning of their (deeds) shall be against those who guard (against evil), but (theirs) is only to remind, haply they may guard.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nothing of their account falls upon those that are godfearing; but a reminding; haply they will be godfearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who ward off (evil) are not accountable for them in aught, but the Reminder (must be given them) that haply they (too) may ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The God-fearing are not in any way held accountable for the wrongdoers; their only duty is to remind them, so that they may fear God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And naught on their account shall be on those who fear but admonition that haply they also may become God-fearing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are Godwary are in no way accountable for them, but this is merely for admonition’s sake, so that they may beware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On their account no responsibility falls on the righteous, but (their duty) is to remind them, that they may (learn to) fear Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who fear Allah, keep their duty to Him and avoid evil are not responsible for them (the disbelievers) in any case, but (their duty) is to remind them, that they may avoid that (mockery at the Quran). [The order of this Verse was cancelled (abrogated) by the Verse 4:140].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are cautious are not accountable for them in anything, but it is a reminder in order that they be cautious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The righteous are in no way accountable for them; it is only a reminder, that they may be careful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who fear Allah are not held accountable for the disbelievers at all, but [only for] a reminder - that perhaps they will fear Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:69] The Muslims then said, ‘If we get up [and leave] every time they delve [into the matter of the Qur’ān], we would never be able to sit in the Mosque or perform circumambulations. Therefore, the following was revealed: Those who fear God, are not accountable for them, [for] those who discourse [in mockery], in anything (min shay’in: min is extra), if they should sit with them; but it is the reminder, that they are accountable for; [a reminder given] to make them remember and to admonish them, so that perhaps they will be wary, of discoursing thus.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who ward off (evil)) those who ward off disbelief, idolatry, indecencies and mockery (are not accountable for them) for their sins, disbelief and mockery towards the believers (in aught, but the Reminder) by means of the Qur'an ((must be given them) that haply they (too) may ward off (evil)) disbelief, idolatry, indecencies and mocking the Qur'an and Muhammad (pbuh).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أن اتفق مجالسة المؤمنين معهم أحياناً { مَا } يلزم ويعود { عَلَى ٱلَّذِينَ يَتَّقُونَ } عن محارم الله { مِنْ حِسَابِهِم } الذين يحاسبون عليها و معاقبون لأجلها { مِّن شَيْءٍ } أي: بشيء من الخطر والتزلزل { وَلَـٰكِن } إن أتفق جمعهم لزمهم { ذِكْرَىٰ } والموعظة الحسنة الناشئة عن محض الحكمة { لَعَلَّهُمْ يَتَّقُونَ } [الأنعام: 69] ينتهوون عما هم عليه من الاستهزاء والتكذيب تأثراً واستحياء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n }  قلت: { ولكن ذكرى }: مفعول بمحذوف، أي: يذكرونهم ذكرى، أو مبتدأ، أي: عليهم ذِكرَى\n يقول الحقّ جلّ جلاله: { وإذا رأيتَ الذين يخوضون في آياتنا } أي: القرآن بالتكذيب والاستهزاء بها والطعن فيها { فأعرض عنهم } ولا تجالسهم، بل قُم عنهم { حتى يخوضوا في حديث غيره } أي: غير القرآن، { وإما يُنسينكَ الشيطانُ } النهيَ عن مجالستهم، وجلست نسيانًا، { فلا تقعد بعد الذكرى } أي: بعد أن تذكر النهي، { مع القوم الظالمين } ، ونسبة النسيان إلى الشيطان أدبًا مع الحضرة،\n\n[النِّساء:78]، ووضع المظهر موضع المضمر، أي: معهم، للدلالة على أنهم ظلموا بوضع التكذيب والاستهزاء موضع التصديق والتعظيم\n { وما على الذين يتقون من حسابهم من شيء } أي: ما على المتقين الذين يجالسونهم شيء من حسابهم، بل عقابهم على الخوض خاصٌّ بهم، { ولكن } عليهم { ذِكرَى } أي: تذكيرهم ووعظهم ومنعهم من الخوض إن قدروا، وكراهية ذلك إن لم يقدروا، فيعظونهم { لعلهم يتقون } ، فَيجتَنِبُون ذلك الخوض حياء أو كراهية مُساءتهم، وإنما أبيح للمؤمنين القعود مع الكفار الخائضين ومخالطتهم لأن ذلك يشق عليهم، إذ لا بد لهم من مخالطتهم في طلب المعاش وفي الطواف، وغير ذلك بخلافه ـ عليه الصلاة والسلام ـ لأن الله أغناه عنهم به، فنهاه عن مخالطة أهل الخوض مطلقًا",
      "translations": []
    }
  ]
}