{
  "chapter": "الأنعام",
  "text": "قل اندعوا۟ من دون الله ما لا ينفعنا ولا يضرنا ونرد على اعقابنا بعد اذ هدىنا الله كالذى استهوته الشيطين فى الارض حيران له اصحب يدعونه الى الهدى ائتنا قل ان هدى الله هو الهدى وامرنا لنسلم لرب العلمين",
  "translations": [
    {
      "translation": "Say: 'Should we call in place of God one who can neither help nor do us harm, and turn back after having been guided by God, like a man beguiled by the devils who wanders perplexed in the wilderness while his friends call him back to the right path, saying: 'Come to us, this way?' Say: \"God's guidance is (true) guidance, and we have been commanded to submit to the Lord of all the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them (O Muharnmad!): \"Shall we invoke, apart from Allah, something that can neither benefit nor harm us, and thus be turned back on our heels after Allah has guided us? Like the one whom the evil ones have lured into bewilderment in the earth, even though he has friends who call him to true guidance saying: \"Come to us.\" Say: \"Surely Allah's guidance is the only true guidance, and we have been commanded to submit ourselves to the Lord of the entire universe,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them, \"Should we, instead of asking for God's help, seek help from that which can neither benefit nor harm us, but would only turn us back to disbelief after God had granted us guidance? To do so would be to act like (those who have been) seduced by Satan, leaving them wandering aimlessly here and there, even though their friends call them, 'Come to the right guidance that has come to us.' \" Say, \"God's guidance is the only true guidance and we are commanded to submit ourselves to the Lord of the Universe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Shall we worship, other than Allah, that which neither benefits us nor harms us, and (therefore) be turned back after Allah has guided us, like one whom the devils have led astray in the earth – bewildered?; his companions call him to the path (saying), ‘Come here’”; say, “Indeed only the guidance of Allah is (the true) guidance; and we are commanded to submit to the Lord Of The Creation.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Shall we invoke others besides Allah (false deities), that can do us neither good nor harm, and shall we turn on our heels after Allah has guided us -- Like one whom the Shayatin (devils) have made to go astray, confused (wandering) through the land, his companions calling him to guidance (saying): `Come to us.\"' Say: \"Verily, Allah's guidance is the only guidance, and we have been commanded to submit (ourselves) to the Lord of all that exists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Shall we call on that besides Allah, which does not benefit us nor harm us, and shall we be returned back on our heels after Allah has guided us, like him whom the Shaitans have made to fall down perplexed in the earth? He has companions who call him to the right way, (saying): Come to us. Say: Surely the guidance of Allah, that is the (true) guidance, and we are commanded that we should submit to the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Shall we call, apart from God, on that which neither profits nor hurts us, and shall we be turned back on our heels after that God has guided us? -- Like one lured to bewilderment in the earth by Satans, though he has friends who call him to guidance, \"Come to us!\" Say: 'God's guidance is the true guidance, and we are commanded to surrender to the Lord of all Being,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Shall we cry, instead of unto Allah, unto that which neither profiteth us nor hurteth us, and shall we turn back after Allah hath guided us, like one bewildered whom the devils have infatuated in the earth, who hath companions who invite him to the guidance (saying): Come unto us? Say: Lo! the guidance of Allah is Guidance, and we are ordered to surrender to the Lord of the Worlds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Instead of God, shall we call upon that which can neither benefit us nor harm us? Are we to turn upon our heels after God has guided us, like one who, beguiled by devils in the land, wanders bewildered, his companions calling him to the right path, saying, \"Come to us\"?\" Say, \"God's guidance is the only guidance. We are commanded to surrender ourselves to the Lord of the Universe,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: shall we call upon, beside Allah, that which can neither profit us nor hurt us, and shall we turn on our heels after Allah hath guided us, like unto one whom the Satans have be guiled to wander bewildered in the land, his: fellows calling him unto the right path: come unto us? Say thou: verily the guidance of Allah, that is the Guidance, and we are commanded to submit ourselves to the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Shall we invoke besides Allah that which can neither benefit us nor harm us, and turn back on our heels after Allah has guided us, like someone seduced by the devils and bewildered on the earth, who has companions that invite him to guidance, [saying,] ‘‘Come to us!’’?’ Say, ‘Indeed it is the guidance of Allah which is [true] guidance. And we have been commanded to submit to the Lord of all the worlds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Shall we indeed call on others besides Allah,- things that can do us neither good nor harm,- and turn on our heels after receiving guidance from Allah? - like one whom the evil ones have made into a fool, wandering bewildered through the earth, his friends calling, come to us', (vainly) guiding him to the path.\" Say: \"Allah's guidance is the (only) guidance, and we have been directed to submit ourselves to the Lord of the worlds;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Shall we invoke others besides Allah (false deities), that can do us neither good nor harm, and shall we turn on our heels after Allah has guided us (to true Monotheism)? - like one whom the Shayatin (devils) have made to go astray, confused (wandering) through the earth, his companions calling him to guidance (saying): 'Come to us.' \" Say: \"Verily, Allah's Guidance is the only guidance, and we have been commanded to submit (ourselves) to the Lord of the 'Alamin (mankind, jinns and all that exists);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Are we to call, other than Allah, what can neither help nor harm us? Are we to turn on our heels after Allah has guided us like him, who, being bewitched by devils, blunders aimlessly in the earth, although his friends call him to the guidance, (saying) 'Come to us' Say: 'The guidance of Allah is the Guidance. We are commanded to submit to the Lord of the Worlds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Shall we invoke besides God something that can neither benefit us nor harm us, and turn back on our heels after God has guided us; like someone seduced by the devils and confused on earth, who has friends calling him to guidance: 'Come to us'?” Say, “The guidance of God is the guidance, and we are commanded to surrender to the Lord of the Universe.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Shall we invoke instead of Allah that which neither benefits us nor harms us and be turned back on our heels after Allah has guided us? [We would then be] like one whom the devils enticed [to wander] upon the earth confused, [while] he has companions inviting him to guidance, [calling], 'Come to us.' \" Say, \"Indeed, the guidance of Allah is the [only] guidance; and we have been commanded to submit to the Lord of the worlds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:71] Say: ‘Shall we call upon, shall we worship, instead of God, that which neither profits us, if we worship them, nor hurts us, if we neglect [to worship] them — these are the idols; and so be turned back, [and so] return to idolatry, after God has guided us, to Islam? — Like one whom the devils have lured, led astray, in the earth, bewildered, confused, not knowing where to go (hayrān, ‘bewildered’, is a circumstantial qualifier referring to the [suffixed pronoun] hā’ [of istahwat-hu, ‘whom they have lured’]); he has companions, a group, who call him to guidance, that is to say, [they are there] in order to guide him to the [right] path, saying to him: “Come to us!”’, but he does not respond to them, and he perishes (the interrogative statement is meant as a disavowal; the comparative statement [beginning with ka’lladhī, ‘like one whom’] is a circumstantial qualifier referring to the subject [of the verb] nuraddu, ‘be turned back’). Say: ‘Truly, God’s guidance, which is Islam, is [the true] guidance, everything else being error, and we have been commanded to submit to the Lord of the Worlds,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad, to 'Uyaynah and his folk: (Shall we cry) do you ask us to worship (instead of unto Allah, unto that which neither profiteth us) if we worshipped it, neither in this world nor in the Hereafter (nor hurteth us) if we did not worship it, neither in this world nor in the Next, (and shall we turn back) to idolatry (after Allah hath guided us) has honoured us with His religion, (like) if we were to do so, we would be like (one bewildered) erred from guidance (whom the devils have infatuated) lured down (in the earth, who hath companions) 'Uyaynah has friends, the prophetic Companions (who invite him to the guidance) to Islam ((saying): Come unto us) obey us? While 'Uyaynah was inviting them to idolatry. It is also said that this verse was revealed about Abu Bakr and his son 'Abd al-Rahman. Prior to embracing Islam, 'Abd al-Rahman used to invite his parents to his religion. Allah said to his Prophet: tell Abu Bakr to say to his son 'Abd al- Rahman: are you asking us 'Abd al-Rahman, to worship, instead of Allah, that which does not benefit us in this world in our provision or livelihood or in the Hereafter if we were to worship it, nor hurt us, if we did not worship it? Are you really asking us to return to our old religion after Allah has guided us to the religion of Muhammad (pbuh). If we were to do as you ask us, we would be like 'Abd al-Rahman who erred and whom the devils lured away from Allah's religion. The parents of 'Abd al-Rahman-Abu Bakr and his wife-invited him to Islam and repentance, while he invited them to idolatry. His parents say to him: obey us and embrace Islam. (Say) Muhammad: (Lo! the guidance of Allah is Guidance) the religion of Allah is Islam and our Qiblah is the Ka'bah, (and we are ordered to surrender) to make our worship and confession of Allah's divine Oneness sincere (to the Lord of the Worlds) to Allah, Lord of the Worlds,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كَٱلَّذِي ٱسْتَهْوَتْهُ ٱلشَّيَاطِينُ } معناه حَيَّرتهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } لهم يا أكمل الرسل تعليماً لمن اتبعك: { أَنَدْعُواْ } ونعبد { مِن دُونِ ٱللَّهِ } الخالق الرزاق الفاعل المختار { مَا لاَ } يقدر على جلب ما { يَنفَعُنَا وَلاَ } على دفع ما { يَضُرُّنَا وَنُرَدُّ } بعبادته { عَلَىٰ أَعْقَابِنَا } التي كنا عليه من الشرك والعصيان { بَعْدَ إِذْ هَدَانَا ٱللَّهُ } بنور التوحيد والعرفان؟ { كَٱ } الشخص { لَّذِي ٱسْتَهْوَتْهُ } أي: ذهبت به { ٱلشَّيَاطِينُ } والأغوال وطرحه { فِي ٱلأَرْضِ } أي: المهاوي والمهامه { حَيْرَانَ } قلقاً حائراً تائهاً، وكان { لَهُ أَصْحَابٌ } ورفقة { يَدْعُونَهُ إِلَى ٱلْهُدَى } أي: الطريق الواضح المستقيم صائحاً عليه قائلاً: { ٱئْتِنَا } حتى تهتدي إلى الطريق، ونحن فيها، لم يسمع كلامهم ولم يقبل قولهم، واقفتى أثر الغول المغوي حتى يضل ويهلك { قُلْ إِنَّ هُدَى ٱللَّهِ } الهادي لعباده إلى توحيده الذاتي { هُوَ ٱلْهُدَىٰ } أي: مقصور على الإسلام الموصل إليه { وَأُمِرْنَا } أيضاً من عنده بمقتضى توحيده الذاتي { لِنُسْلِمَ } ونفوض جميع أمورنا { لِرَبِّ ٱلْعَالَمِينَ } [الأنعام: 71] إذ هو مستقل بتربية مظاهره؛ لأنه لا يجزي في ملكه إلا ما يشاء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ونُردُّ }: عطف على { ندعو } والهمزة للإنكار، والرد على العقب: الرجوع إلى وراء، لعلَّةٍ في المشي، واستعير للمعاني، و { كالذي استهوته }: الكاف في موضع نصب على الحال من الضمير في { نُردّ } أي: كيف نرجع مشبهين بمن استهوته الشياطين، أو نعت لمصدر محذوف، أي: ردًا كرد الذي\n\n\nالخ\n واستهوى: استفعل، من هَوَى في الأرض إذا ذهب، وقال الفارسي: استهوى بمعنى أهوى، مثل استزل بمعنى أزل، و { حيران }: حال من مفعول استهوى\n و { أن أقيموا }: عطف على { لنُسلم } ، أو { أمرنا }",
      "translations": []
    }
  ]
}