{
  "chapter": "الأنعام",
  "text": "وهو الذى خلق السموت والارض بالحق ويوم يقول كن فيكون قوله الحق وله الملك يوم ينفخ فى الصور علم الغيب والشهدة وهو الحكيم الخبير",
  "translations": [
    {
      "translation": "His speech is Truth. The Kingdom will be His on the Day the Trumpet is blown, the Knower of the Unseen and the Visible. He is the All-Wise, the All-Aware.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the heavens and the earth with a definite purpose. The day He will say \"Be, \" it will be. His word is the truth, His alone the power on the Day when the blast of the trumpet will be sounded. He knows the hidden and the visible. He is all-prudent and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has created the heavens and the earth in truth; and the very day He will say: \"Be!\" (resurrection) there will be. His word is the Truth and His will be the dominion on the day when the-Trumpet is blown. He knows all that lies beyond the reach of human perception as well as all that is visible to man; He is the All-Wise, the All-Aware.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has created the heavens and the earth for a genuine purpose. When He commands the Day of Judgment to take place, it will come into existence. His Word is the Truth. The kingdom will be His alone on the day when the trumpet will be sounded. He has all knowledge of the unseen as well as the seen. He is All-wise and All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who perfectly created the heavens and the earth; and when He will say “Be” on the Day (of resurrection) to all the extinct things, it will happen immediately; His Word is true; and it will be His kingship on the day when the Trumpet is blown; All Knowing of all the hidden and the revealed; and He only is the Wise, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has created the heavens and the earth in truth, and on the Day He will say: \"Be!\" it shall become. His Word is the truth. His will be the dominion on the Day when the Sur will be blown. All-Knower of the unseen and the seen. He is the All-Wise, Well-Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has created the heavens and the earth with truth, and on the day He says: Be, it is. His word is the truth, and His is the kingdom on the day when the trumpet shall be blown; the Knower of the unseen and the seen; and He is the Wise, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the heavens and the earth in truth; and the day He says 'Be', and it is; His saying is true, and His is the Kingdom the day the Trumpet is blown; He is Knower of the Unseen and the visible; He is the All-wise, the All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who created the heavens and the earth in truth. In the day when He saith: Be! it is. His Word is the Truth, and His will be the Sovereignty on the day when the trumpet is blown. Knower of the Invisible and the Visible, He is the Wise, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was He who created the heavens and the earth for a true purpose. On the Day when He says, \"Be,\" it shall be: His word is the truth. All sovereignty shall be His on the Day when the trumpet is sounded. The Knower of the unseen and the visible, He is the Wise, the Aware One.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who hath created the heavens and the earth in truth. And the Day when He saith: be, it shall become. His saying is the Reality. And His will be the dominion the Day the Trumpet will be blown. Knower of the Unseen and the seen, is the Wise, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the heavens and the earth with reason, and the day He says [to something], ‘Be!’ it is. His word is the truth, and to Him belongs all sovereignty on the day when the Trumpet will be blown. Knower of the sensible and the Unseen, He is the All-wise, the All-aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the heavens and the earth in true (proportions): the day He saith, \"Be,\" behold! it is. His word is the truth. His will be the dominion the day the trumpet will be blown. He knoweth the unseen as well as that which is open. For He is the Wise, well acquainted (with all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has created the heavens and the earth in truth, and on the Day (i.e. the Day of Resurrection) He will say: \"Be!\", - and it shall become. His Word is the truth. His will be the dominion on the Day when the trumpet will be blown. All-Knower of the unseen and the seen. He is the All-Wise, Well-Aware (of all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was He who created the heavens and the earth in truth. On the Day when He says: 'Be' it shall be. His Word is the truth. His shall be the Kingdom on the Day when the Horn is blown. The Knower of the unseen and the visible, and He is the Wise, the Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created the heavens and the earth in truth. On the Day when He says: “Be,” it will be. His saying is the truth, and His is the sovereignty on the Day when the trumpet is blown. The Knower of secrets and declarations. He is the Wise, the Expert.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who created the heavens and earth in truth. And the day He says, \"Be,\" and it is, His word is the truth. And His is the dominion [on] the Day the Horn is blown. [He is] Knower of the unseen and the witnessed; and He is the Wise, the Acquainted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:73] He it is Who created the heavens and the earth in truth, that is to say, with the purpose of [manifesting] truth. And, mention, the day He says, to a thing, ‘Be’, and it is — this is the Day of Resurrection, when He says to creatures, ‘Rise up’, and they do. His words are the truth, the truth that will doubtless come to pass; and His is the Kingdom the day when the trumpet, the horn, is blown, the second blast by [the angel] Isrāfīl, when there shall be no kingdom for any other than Him: ‘Whose is the Kingdom today? God’s’ [Q. 40:16]. He is the Knower of the Unseen and the visible, what is hidden and what may be seen. He is the Wise, in His creation, the Aware, of things inwardly hidden and outwardly manifest.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He it is Who created the heavens and the earth in truth) to expound the Truth and expose falsehood; it is also said that this means: to show that they are ephemeral and evanescent. (In that day when He saith) to the wall: (Be! it is) i.e. the heavens will become a wall which will be blown into, like one blows into a horn. Then the heaven will be changed into a different heaven; it is also said that (Be! it is) means: when He says to the Day of Judgement: \"Be\", and it will be. (His word) regarding the resurrection (is the Truth, and His will be the Sovereignty) the judgement between the servants (on the Day when the trumpet is blown. Knower of the invisible) that which will happen in the future (and the visible) that which has already happened; it is also said that the 'invisible' refers to that which is unseen by people while 'the visible' refers to that which Allah's servants see, (He is the Wise) in His command and decree, (the Aware) of His created beings and of their works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَوْمَ يُنفَخُ فِي ٱلصُّورِ } فالصُّورُ: القِرنُ، والصُّورُ: جَمعُ صُورةٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {the day when the trumpet is blown in the image}, the image is the horn, and the image is the gathering of a picture.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فإن التعينات تتأخر عن مطلق الهوية المحضة عقلاً وحقيقة وظهورها بالإرادة المسماة بقوله: { كن فيكونُ } بلا فصل وتأخير يعبر عنه بـ: يكون\n لأنها لم تكن في الأزل فكانت { قوله الحق } أي: في ذلك الوقت سيما سرمديّ إرادته التي اقتضت وجود المبدعات على ما هي عليه ثابتة في حالها غير متغيرة\n اقتضت ما اقتضت وجود المبدعات على ما هي عليه ثابتة في حالها غير متغيرة\n اقتضت ما اقتضت على أحسن ما يكون من النظام والترتيب وأعدل ما يكون من الهيئة والتركيب\n { يوم ينفخ في الصور } وقت نفخه في الصور أي: إحياء صور المكوّنات بإفاضة أرواحها عليها لا ملك إلا له فإنها بنفسها ميتة لا وجود لها ولا حياة فضلاً عن المالكية { عالم الغيب } أي: حقائق عالم الأرواح التي هي ملكوته { والشهادة } أي: صور عالم الأجسام التي هي ملكه { وهو الحكيم } الذي أوجدها ورتبها بحكمته فأفاض على كل صورة ما يليق بها من الأرواح { الخبير } الذي علم أسرارها وعلانيتها وخواصها وأفعالها\n تلخيصه: هو مبدع الأرواح والجسم المطلق بإرادته القديمة الأزلية الثابتة التي لا تغير فيها أبداً إبداعاً على وجه العدل والحكمة الذي اقتضاه ذاته ومكوّن الكائنات بإنشائها في عالم الملك الذي هو مالكه لا غير\n كيف شاء عالماً بما يجب أن يكون عليها حكيماً في اتقانها ونظامها وترتيبها\n خبيراً بما يحدث فيها من الأحوال الحادثة على حسب إرادته بذاته لا شريك له في ذلك كله",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nكيف لا { وَهُوَ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } أي: أوجدهما وأظهرهما ملتبساً { بِٱلْحَقِّ } على مقتضى الحكمة المتقنة التي ما ترى فيها من فطور وفتور { وَ } ذلك { يَوْمَ } حين { يَقُولُ } بعد تعلق إرادته ومشيئته بتكوينهما { كُن فَيَكُونُ } على الفور بلا تراخٍ ومهلة تنفيذاً لسرعة قضائه { قَوْلُهُ } لإعدامها أيضاً في الساعة { ٱلْحَقُّ } المطابق للواقع بلا تخلف { وَ } كيف يتصور التخلف في قوله\n إذ { لَهُ } لا لغيره { ٱلْمُلْكُ } أي: المظاهر كلها وله التصرف فيها بالاستقلال إيجاداً وإعداماً { يَوْمَ يُنفَخُ فِي ٱلصُّورِ } لإعدام ما في الوجود وإفنائها إظهاراً لقدرته\n إذ هو { عَٰلِمُ ٱلْغَيْبِ } وما يجري فيها { وَٱلشَّهَٰدَةِ } وما يترتب عليها { وَهُوَ } بذاته { ٱلْحَكِيمُ } في إبداء مظاهره من الغيب { ٱلْخَبِيرُ } [الأنعام: 3] بما ترتب عيليها في الشهادة بعد إعادتها",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قوله الحق }: مبتدأ\n و { يوم يقول }: خبر مقدم\n أي: قوله الحق حاصل يوم يقول: { كن فيكون } \n وفاعل { يكون }: ضمير فاعل كن\n أي: حين يقول للشيء: كن فيكون ذلك الشيء\n و { يوم ينفخ }: ظرف لقوله: { الملك } \n كقوله:\n[غَافر:16]\n يقول الحقّ جلّ جلاله: { قل } لهم يا محمد { أندعو من دون الله } أي: نعبد { ما لا ينفعنا ولا يضرنا } من الأصنام الجامدة\n { ونُرد على أعقابنا } أي: نرجع إلى الشرك { بعد إذ هدانا الله } وأنقذنا\n ورزقنا الإسلام\n وهذا على الصحابة\n وأما النبي صلى الله عليه وسلم فلم يتقدم له شرك لعصمته\n أي: كيف نرد على أعقابنا ردًا { كالذي استهوته الشياطين } \n أي: أضلته مَرَدَةُ الجن عن الطريق المستقيم\n فذهب { في الأرض حيران } متحيرًا ضالاً عن الطريق\n { له أصحاب } أي: رفقة { يدعونه إلى الهدى } أي: إلى الطريق المستقيم\n يقولون له: { ائتنا } وكن معنا لئلا تتلف\n وهو مثال لمن ترك الإسلام وضل عنه\n { قل } لهم: { إن هدى الله } \n وهو الإسلام\n { هو الهدى } وحده\n وما عداه ضلال\n { و } قد { أمرنا لنسلم لرب العالمين } نكون على الجادة من الهدى\n { و } أُمرنا { أن أقيموا الصلاة واتقوه }: أي: أُمرنا بإقامة الصلاة والتقوى\n رُوِي أن عبد الرحمن بن أبي بكر دعا أباه إلى عبادة الأوثان\n فنزلت\n وعلى هذا أُمِر الرسول بهذا القول إجابة عن الصديق تعظيمًا لشأنه\n وإظهارًا للاتحاد الذي كان بينهما\n قاله البيضاوي\n وقال ابن جزي: ويبُطل هذا قول عائشة: ما نزل في آل أبي بكر شيء من القرآن إلا برائتي\n هـ\n قلت: ليس بحجة لصغر سنِّها وقت نزول الآية بمكة\n والإسلام يمحو ما قبله\n ثم قال جل جلاله: { وهو الذي إليه تحشرون } يوم القيامة فيظهر من تبع الحق من الباطل\n { وهو الذي خلق السماوات والأرض بالحق }\n أي: قائمًا بالحق والحكمة\n فهو أحق بالعبادة وحده\n { ويوم يقول كن فيكون قوله الحق } أي: قوله العدل حاصل يوم يقول للبعث والحشر: كن فيكون\n { وله الملك يوم ينفخ في الصور } أي: انفرد الملك له يوم ينفخ في الصور فيقول: لمن الملك اليوم؟ فلا يُجاب\n فيقول: لله الواحد القهار\n { عالم الغيب والشهادة } أي: هو عالم بما غاب وما ظهر\n { وهو الحكيم } في صنعه\n { الخبير } بأمر عباده\n\nالإشاره: إذا توجه العبد إلى مولاه\n وانقطع بكليته إلى الله\n طالبًا منه معرفته ورضاه\n قد يمتحن بشيء من شدائد الزمان كالفاقة وإيذاء الخلق والأحزان\n فيقال اختبارًا له: تعلق في دفع ما نزل بك بشيء من السِّوى\n فيجب عليه أن يقول: { أندعوا من دون الله ما لا ينفعنا ولا يضرنا ونُردُّ على أعقابنا } بالالفتات إلى غير ربنا\n بعد إذ هدانا الله إلى توحيده ومعرفته\n ونكون كالذي استهوته الشياطين في الأرض\n حيران بالتفاته إلى غير الكريم المنان\n { قل إن هدى الله } أي: هدايته الخاصة\n وهي الإنقطاع إليه وحده في الشدائد\n { هو الهدى } \n وقد أُمرنا بالانقياد بكليتنا إلى ربنا\n وأُمرنا إذا حزبنا شيء بإقامة الصلاة لأنها مفتاح الفرج\n وبالتقوى لأنها سبب النصر { إنَّ اللهَ مَعَ الَّذِينَ اتَّقَوا } \n وآخر أمرنا الموت والحشر إلى ربنا\n والاستراحة إلى الروح والريحان\n وبالله التوفيق\n ثم ذكر قصة إبراهيم إبطالاً لدعوى الشرك\n فقال: { وَإِذْ قَالَ إِبْرَاهِيمُ لأَبِيهِ آزَرَ أَتَتَّخِذُ أَصْنَاماً آلِهَةً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "50:20",
      "similarity": 0.7429398273504598
    },
    {
      "verse": "69:13",
      "similarity": 0.7138920511934552
    },
    {
      "verse": "39:68",
      "similarity": 0.5538361464891226
    },
    {
      "verse": "64:3",
      "similarity": 0.4810637723589647
    },
    {
      "verse": "78:18",
      "similarity": 0.4618406736092692
    }
  ]
}