{
  "chapter": "الأنعام",
  "text": "واذ قال ابرهيم لابيه ءازر اتتخذ اصناما ءالهة انى ارىك وقومك فى ضلل مبين",
  "translations": [
    {
      "translation": "Remember when Ibrahim said to his father, Azar. 'Do you take idols as gods? I see that you and your people are clearly misguided.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when Abraham said to Azar, his father: \"Why do you take idols for God? I certainly find you and your people in error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when Abraham said to his father, Azar: 'Do you take idols for gods? I see you and your people in obvious error.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Consider when Abraham asked his father, Azar, \"Why do you believe idols to be your gods? I find you and your people in absolute error\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when Ibrahim said to his father (paternal uncle) Azar, “What! You appoint idols as Gods? Indeed I find you and your people in open error.” (Prophet Ibrahim was rightly guided since birth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Ibrahim said to his father Azar: \"Do you take idols as gods Verily, I see you and your people in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Ibrahim said to his sire, Azar: Do you take idols for gods? Surely I see you and your people in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Abraham said to his father Azar, 'Takest thou idols for gods? I see thee, and thy people, in manifest error.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Remember) when Abraham said unto his father Azar: Takest thou idols for gods? Lo! I see thee and thy folk in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember when Abraham said to his father, Azar, \"Do you take idols as your gods? I see that you and your people have clearly gone astray.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time Ibrahim said unto his father Azar: takest thou idols for gods! Verily I see thee and thy people in error manifest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Abraham said to Azar, his father, ‘Do you take idols for gods? Indeed I see you and your people in manifest error.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Abraham said to his father Azar: \"Takest thou idols for gods? For I see thee and thy people in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when Ibrahim (Abraham) said to his father Azar: \"Do you take idols as aliha (gods)? Verily, I see you and your people in manifest error.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(And remember) when Abraham said to his father Azar: 'Will you take idols for gods, surely I see you and your people are in clear error'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Abraham said to his father Azar, “Do you take idols for gods? I see that you and your people are in evident error.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention, O Muhammad], when Abraham said to his father Azar, \"Do you take idols as deities? Indeed, I see you and your people to be in manifest error.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:74] And, mention, when Abraham said to his father Āzar, which was his cognomen, his [first] name being Terah (Tārikh): ‘Do you take idols as gods, to worship? (an interrogative meant as a rebuke). I see you and your people, by [this act of] taking them [as gods], in manifest error’, far from the truth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Remember) when Abraham said unto his father Azar) who was Terah the son of Nahur: (Takest thou idols) do you worship idols (for gods) so many gods: small and large, male and female? (Lo! I see thee) my father (and thy folk in error manifest) in manifest disbelief and wrong in so worshipping idols.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل لمن تبعك من المؤمنين وقت { إِذْ قَالَ إِبْرَاهِيمُ } حين تيقظ عن منام الغفلة وتنبه عن سنة النسيان { لأَبِيهِ } المسمى { آزَرَ } العابد للأصنام { أَتَتَّخِذُ أَصْنَاماً } تنحتها { آلِهَةً } مستحقة للعبادة قاردة للإيجاد والإعدام { إِنِّيۤ } بعدما تنبهت وتفطنت بعدم قابليتها للألوهية بل الإله لا بدَّ أن يكون متصفاً بجميع أوصاف الكمال بلا تغيير وزوال وانتقال { أَرَاكَ } يا أبت { وَقَوْمَكَ فِي ضَلاَلٍ مُّبِينٍ } [الأنعام: 74] بعبادة هذه التماثيل الباطلة واعتقادها معبودات حقه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { آزر }: عطف بيان، أو بدل من أبيه، ومنع من الصرف للعلمية والعجمة\n وقرأ يعقوب بالضم ـ على النداء، وقيل: إن آزر اسم صنم لأنه ثبت أن اسم أبي إبراهيم تارخ\n فعلى هذا يحتمل أن يكون لقب به لملازمته له، وقيل: هما عَلمَانِ له كإسرائيل ويعقوب\n يقول الحقّ جلّ جلاله: { و } أذكر { إذ قال إبراهيم لأبيه آزر } ، حين دعاه إلى التوحيد: { أتتخذ أصنامًا آلهة } تعبدها من دون الله، وهي لا تنفع ولا تضر، { إني أراك وقومك في ظلال مبين }: بيِّن الضلالة، ظاهر الخطأ\n الإشارة: كل من سكن إلى شيء دون الله، أو مال إليه بالعشق والمحبة، فهو صنم في حقه، فإن لم ينزع عن محبته، ولم يقلع عن السكون إليه، كان حجابًا بينه وبين شهود أسرار التوحيد\n وفي الحِكَم: \" ما أحببت شيئًا إلا وكنت عبدًا له، وهو لا يحب أن تكون لغيره عبدًا \"\n وفي الحديث:\n\n \" تَعِس عبدُ الدينار والدرهم \" \n\n\n\n أي: خاب وخسر، فإذا اطلع الحق تعالى على قلب عبده فرآه مائلاً لغيره، حجب عنه أنوار قدسه، وفي ذلك يقول الششتري رضي الله عنه:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:35",
      "similarity": 0.2792552158270526
    },
    {
      "verse": "26:71",
      "similarity": 0.2513103103433966
    },
    {
      "verse": "21:57",
      "similarity": 0.24575863648106674
    },
    {
      "verse": "7:138",
      "similarity": 0.21633335152926794
    },
    {
      "verse": "43:26",
      "similarity": 0.04898752963158464
    }
  ]
}