{
  "chapter": "الأنعام",
  "text": "وكذلك نرى ابرهيم ملكوت السموت والارض وليكون من الموقنين",
  "translations": [
    {
      "translation": "Because of that We showed Ibrahim the dominions of the heavens and the earth so that he might be one of the people of certainty.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We showed to Abraham the visible and invisible world of the heavens and the earth, that he could be among those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus We showed Abraham the kingdom of the heavens and the earth, so that he might become one of those who have sure faith.. The adversaries are told that they can observe God's signs in the phenomena of the universe, just as Abraham could. The difference is that they see nothing, as if they were blind, whereas Abraham saw with open eyes. The sun, moon and stars which rise and set before their eyes day after day and night after night witness them as misguided at their setting as at their rising. Yet the same signs were observed by the perceptive Abraham, and the physical phenomena helped him arrive at the Truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also, We showed (Abraham) the kingdom of the heavens and the earth to strengthen his faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And likewise We showed Ibrahim the entire kingdom of the heavens and the earth and so that he be of those who believe as eyewitnesses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus did we show Ibrahim the kingdom of the heavens and the earth that he be one of those who have faith with certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus did We show Ibrahim the kingdom of the heavens and the earth and that he might be of those who are sure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We were showing Abraham the kingdom of the heavens and earth, that he might be of those having sure faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus did We show Abraham the kingdom of the heavens and the earth that he might be of those possessing certainty:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In this way We showed Abraham Our kingdom of the heavens and the earth, so that he might have certainty of faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in this wise We showed unto Ibrahim the governance of the heavens and the earth, and that he might become of the convinced.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus did We show Abraham the dominions of the heavens and the earth, that he might be of those who possess certitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So also did We show Abraham the power and the laws of the heavens and the earth, that he might (with understanding) have certitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus did we show Ibrahim (Abraham) the kingdom of the heavens and the earth that he be one of those who have Faith with certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so We showed Abraham the kingdom of the heavens and the earth, so that he might be of those who are certain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus We showed Abraham the empire of the heavens and the earth, that he might be one of those with certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus did We show Abraham the realm of the heavens and the earth that he would be among the certain [in faith]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:75] And so, just as We show him the misguidance of his father and his people, We show Abraham the kingdom of the heavens and the earth, that he might infer thereby [the truth of] Our Oneness, and that he might be of those knowing, it, with certainty (the sentence beginning with wa-kadhālika, ‘and so’, and what follows it, is a parenthetical statement and a supplement to [the one beginning with] qāla, ‘he said’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thus did We show Abraham the kingdom of the heavens and the earth) that which is between the heavens and the earth: the sun, the moon and the stars when he came out of the hole into which he was thrown (that he might be of those possessing certainty) that he might be of those who acknowledge that Allah is One, the Creator of the heavens and the earth and all that which is in them; it is also said that Allah showed him this on the night He made him ascend to heaven. He saw up to the seventh heaven and the seventh earth, so that he may have the certitude of inspiration:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَلَكُوتَ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } معناه مَلِكُهَا\n ويقال سُلْطانُها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَذَلِكَ } أي: مثل ما نوقظه من منام الغفلة في أمر الأصنام { نُرِيۤ إِبْرَاهِيمَ مَلَكُوتَ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } أي: عجائبهما وغرائبهما المودعة فيهما؛ ليتأمل فيها ويتفكر في تدبيراتها وتصريفاتها حتى ينكشف بمبدعها { وَلِيَكُونَ مِنَ ٱلْمُوقِنِينَ } [الأنعام: 75] في أمرها لا من المنتظرين المترددين المتخذين بعضها آلهة كعبدة الكواكب والمجسمة وغيرهما\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: المُلك: ما ظهر في عالم الشهادة من المحسوسات، والملكوت: ما غاب فيها من معاني أسرار الربوبية، والجبروت: ما لم يدخل عالم التكوين من أسرار المعاني الأزلية\n يقول الحقّ جلّ جلاله: { وكذلك } أي: مثل ذلك التبصر الذي بَصَّرنا به إبراهيم حتى اهتدى للرد على أبيه، نُريه { ملكوت السماوات والأرض } أي: نكشف له عن أسرار التوحيد فيهما، حتى يشاهد فيهما صانعهما، ولا يقف مع ظاهر حسهما، وإنما فعلنا له ذلك { ليكون من الموقنين } بمعرفتنا، عارفًا بأسرار قدسنا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "44:7",
      "similarity": 0.7105639470827039
    },
    {
      "verse": "26:24",
      "similarity": 0.7062589344920723
    },
    {
      "verse": "51:20",
      "similarity": 0.6845238844220214
    },
    {
      "verse": "69:51",
      "similarity": 0.6471016636862947
    },
    {
      "verse": "56:95",
      "similarity": 0.6443933485145412
    }
  ]
}