{
  "chapter": "الأنعام",
  "text": "فلما جن عليه اليل رءا كوكبا قال هذا ربى فلما افل قال لا احب الءافلين",
  "translations": [
    {
      "translation": "When night covered him he saw a star and said, 'This is my Lord!' Then when it set he said, 'I do not love what sets.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the night came with her covering of darkness he saw a star, and (Azar, his father) said: \"This is my Lord.\" But when the star set, (Abraham) said: \"I love not those that wane.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when the night outspread over him, he beheld a star, and said: 'This is my Lord.' But when it went down, he said: 'I do not love the things that go down.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When it became dark at night, he (Abraham) saw a star and said, \"This is my lord.\" But when it disappeared, he said, \"I do not love those who fade away\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the night became dark upon him he saw a star; he said (to Azar / the people), “(You portray that) this is my Lord?”; then when it set he said, “I do not like the things that set.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the night overcame him he saw a Kawkab. He said: \"This is my lord.\" But when it Afala, he said: \"I like not those that set.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the night over-shadowed him, he saw a star; said he: Is this my Lord? So when it set, he said: I do not love the setting ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When night outspread over him he saw a star and said, 'This is my Lord.' But when it set he said, 'I love not the setters.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the night grew dark upon him he beheld a star. He said: This is my Lord. But when it set, he said: I love not things that set.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When night descended on him, he saw a star. He said, \"This is my Lord!\" Then when it set he said, \"I do not love things that set.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when the night darkened on him, he beheld a star. He said: this is mine Lord. Then when it set, he said. I love not the setting ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When night darkened over him, he saw a star and said, ‘This is my Lord!’ But when it set, he said, ‘I do not like those who set.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the night covered him over, He saw a star: He said: \"This is my Lord.\" But when it set, He said: \"I love not those that set.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the night covered him over with darkness he saw a star. He said: \"This is my lord.\" But when it set, he said: \"I like not those that set.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When night drew over him, he saw a planet. 'This' he said: 'is surely my Lord' But when it set he said: 'I do not like the setting ones'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the night fell over him, he saw a planet. He said, “This is my lord.” But when it set, he said, “I do not love those that set.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the night covered him [with darkness], he saw a star. He said, \"This is my lord.\" But when it set, he said, \"I like not those that disappear.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:76] When night descended, [when] it darkened, upon him he saw a star — said to have been Venus — and said, to his people, who were astrologers: ‘This is my Lord’, as you [are wont to] claim. But when it set, when it disappeared, he said, ‘I love not those that set’, to take them as lords, because it is not possible for a [true] Lord to be transformed or to change place, as such [attributes] pertain to accidents — but this had no effect on them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(When the night grew dark upon him) in the hole (he beheld a star) the planet Venus. (He said: This is my Lord) could this be my Lord? (But when it set) when its colour changed to red and it disappeared, (he said: I love not things that set) I do not love a lord that is not lasting.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلَمَّا جَنَّ عَلَيْهِ ٱلْلَّيْلُ } معناهُ غَطّاهُ\n\n\n\n\nوقوله تعالى: { فَلَمَّآ أَفَلَ } معناه غَابَ وزَالَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - Exalted is He - \"Then when the night {covered} him\" - its meaning is that it enveloped him.\n\n\nAnd when the {afala} came, it meant that he had gone and disappeared.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّا جَنَّ } أظلم { عَلَيْهِ ٱلْلَّيْلُ رَأَى كَوْكَباً } استنار بنوره وانكشف عنه الظلمة بسببه، وظن أنه انكشافه ذاتي مطلق دائم { قَالَ } على مقتضى ظنه به: { هَـٰذَا رَبِّي } إذ هو نور يتجلى في الظلمة فيستحق الربوبية والعبودية { فَلَمَّآ أَفَلَ } غاب وانمحق { قَالَ لاۤ أُحِبُّ ٱلآفِلِينَ } [الأنعام: 76] فكيف أعبده وأخص العبادة له؛ إذ الأفول والتغيير من أمارات الحدوث، والحادث لا يستحق العبودية ولا يليق بالألوهية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولما كان أبوه وقومه يعبدون الأصنام والكواكب والقمر والشمس، أراد أن يرشدهم إلى التوحيد من طريق النظر والاستدلال { فلما جن عليه الليل } أي: ستره بظلامه، { رأى كوكبًا } وهو الزهرة أو المشتري، { قال هذا ربي } على سبيل التنزل إلى قول الخصم، وإن كان فاسدًا فإن المستدل على فساد قول يحكيه على ما يقوله الخصم، ثم يَكرّ عليه بالفساد لأن ذلك أدعى إلى الحق، وأقرب إلى رجوع الخصم، { فلما أفل } أي: غاب، { قال لا أحب الآفلين } فضلاً عن عبادتهم فإن التغير بالاستتار والانتقال يقتضي الإمكان والحدوث وينافي الألوهية\n { فلما رأى القمر بازغًا }: متبدئًا في الطلوع، { قال هذا ربي فلما أفل قال لئن لم يهدني ربي لأكونن من القوم الظالمين }\n استعجزَ نفسه واستعان ربه في دَرك الحق، وأنه لا يهتدي إليه إلا بتوفيقه إرشادًا لقومه\n وتنبيهًا لهم على أن القمر أيضًا لتغيُّر حاله، لا يَصلح للألوهية، وأن من اتخذه إلهًا، فهو ضالٌّ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:6",
      "similarity": 0.49134766098638916
    },
    {
      "verse": "6:77",
      "similarity": 0.4688170063524738
    },
    {
      "verse": "6:78",
      "similarity": 0.4606830162716146
    },
    {
      "verse": "12:4",
      "similarity": 0.42028658635693317
    },
    {
      "verse": "82:2",
      "similarity": 0.3588249144669739
    }
  ]
}