{
  "chapter": "الأنعام",
  "text": "فلما رءا القمر بازغا قال هذا ربى فلما افل قال لئن لم يهدنى ربى لاكونن من القوم الضالين",
  "translations": [
    {
      "translation": "Then when he saw the moon come up he said, 'This is my Lord!' Then when it set he said, 'If my Lord does not guide me, I will be one of the misguided people.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When (Azar) saw the moon rise all aglow, he said: \"This is my Lord.\" But even as the moon set, (Abraham) said: \"If my Lord had not shown me the way I would surely have gone astray.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he beheld the moon rising, he said: 'This is my Lord!' But when it went down, he said: 'Were that my Lord did not guide me, I surely would have become among the people who have gone astray.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Abraham saw the rising moon, he said, \"This is my lord.\" But when it faded away, he said, \"If my Lord does not guide me I shall certainly go astray.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when he saw the moon shining, he said, “(You proclaim that) this is my Lord?”; then when it set, he said, “If my Lord had not guided me*, I too would be one of these astray people.” (* Prophet Ibrahim was rightly guided before this event).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw the moon rising up, he said: \"This is my lord.\" But when it set, he said: \"Unless my Lord guides me, I shall surely be among the misguided people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when he saw the moon rising, he said: Is this my Lord? So when it set, he said: If my Lord had not guided me I should certainly be of the erring people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw the moon rising, he said, 'This is my Lord.' But when it set he said, 'If my Lord does not guide me I shall surely be of the people gone astray.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he saw the moon uprising, he exclaimed: This is my Lord. But when it set, he said: Unless my Lord guide me, I surely shall become one of the folk who are astray.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw the moon rise and spread its light, he said, \"This is my Lord.\" But when it set, he said, \"If my Lord does not guide me, I will be one of the misguided people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when he beheld the moon uprise, he said: this is mine Lord. Then when it set, he said: were it not that my Lord kept me guiding, surely I must have been of the erring people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he saw the moon rising, he said, ‘This is my Lord!’ But when it set, he said, ‘Had my Lord not guided me, I would surely have been among the astray lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw the moon rising in splendour, he said: \"This is my Lord.\" But when the moon set, He said: \"unless my Lord guide me, I shall surely be among those who go astray.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw the moon rising up, he said: \"This is my lord.\" But when it set, he said: \"Unless my Lord guides me, I shall surely be among the erring people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw the rising moon, he said: 'This is my Lord' But when it set, he said: 'If my Lord does not guide me, I shall surely be amongst the astray nation'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he saw the moon rising, he said, “This is my lord.” But when it set, he said, “If my Lord does not guide me, I will be one of the erring people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he saw the moon rising, he said, \"This is my lord.\" But when it set, he said, \"Unless my Lord guides me, I will surely be among the people gone astray.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:77] And when he saw the moon rising, appearing, he said, to them: ‘This is my Lord.’ But when it set he said, ‘Unless my Lord guides me, [unless] He establishes me within [true] guidance, I shall surely become one of   the folk who are astray’ — an intimation to his people that they are astray, but still this had no effect on them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله : { فلمّا رأى القمر بازغاً } الخ عطف على جملة محذوفة دلّ عليها الكلام . والتقدير : فطلع القمر فلَّما رآه بازغاً ، فحذفت الجملة للإيجاز وهو يقتضي أنّ القمر طلع بعد أفول الكوكب ، ولعلّه اختار لمحاجّة قومه الوقت الذي يغرب فيه الكوكب ويطلع القمر بقرب ذلك ، وأنَّه كان آخر اللَّيل ليعقبهما طلوع الشمس .وأظْهِر اسمُ { القمر } لأنَّه حذف معاد الضمير . والبازغ : الشارق في ابتداء شروقه ، والبُزُوغ ابتداء الشروق .وقوله { هذا ربِّي } أفاد بتعريف الجزأين أنَّه أكثر ضوءاً من الكوكب فإذا كان استحقاق الإلهية بسبب النّور فالذي هو أشدّ نوراً أولى بها من الأضعف . واسم الإشارة مستعمل في معناه الكنائي خاصّة وهو كون المشار إليه مطلوباً مبحوثاً عنه كما تقدّم آنفاً .وقوله : { فلَّما أفل قال لَئن لم يهدني ربِّي لأكونَنّ من القوم الضالِّين } قصد به تنبيه قومه للنظر في معرفة الربّ الحقّ وأنَّه واحد ، وأنّ الكوكب والقمر كليهما لا يستحقَّان ذلك مع أنَّه عَرّض في كلامه بأنّ له ربّا يهديه وهم لا ينكرون عليه ذلك لأنَّهم قائلون بعدّة أرباب . وفي هذا تهيئة لنفوس قومه لما عزم عليه من التصريح بأنّ له ربّاً غير الكواكب . ثم عَرّض بقومه أنَّهم ضالّون وهيّأهم قبل المصارحة للعلم بأنَّهم ضالّون ، لأنّ قوله : { لأكونَنّ من القوم الضالّين } يُدخِل على نفوسهم الشكّ في معتقدهم أن يكون ضلالاً ، ولأجل هذا التعريض لم يقل : لأكوننّ ضالاّ ، وقال { لأكوننّ من القوم الضالّين } ليشير إلى أنّ في النَّاس قوماً ضالّين ، يعني قومه .وإنَّما تريَّث إلى أفول القمر فاستدلّ به على انتفاء إلهيته ولم ينفها عنه بمجرّد رؤيته بازغاً مع أنّ أفوله محقّق بحسب المعتاد لأنَّه أراد أن يقيم الاستدلال على أساس المشاهدة على ما هو المعروف في العقول لأنّ المشاهدة أقوى .\n\n",
      "translations": [
        {
          "translation": "(And when he saw the moon uprising, he exclaimed: This my Lord) could this be my Lord? This is bigger than the first one. (But when it set, he said: Unless my Lord guide me) unless my Lord makes me firm on guidance, (I surely shall become one of the folk who are astray) from guidance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلَمَّآ رَأَى ٱلْقَمَرَ بَازِغاً } معناهُ طَالِعٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {When the moon is eclipsed} means it is {eclipsed}.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n المتسترين بظلمة الإمكان والاحتياج إلى الغير { فلما رأى } قمر القلب بازغاً بوصوله إلى مقام القلب وطلوعه من أفق النفس بظهوره عليه ورأى فيضه بمكاشفات الحقائق وعلمه وربوبيته منه\n إذ كان الله تعالى يريه حينئذ باسمه العالم والحكيم { قال هذا ربي فلما افل } باحتجابه عنه وعبوره عن طوره وشعوره بأن نوره مستفاد من شمس الروح وإنه قد يتغيب في ظلمة النفس وصفاتها فيحتجب بها ولا نور له أعرض عن مقامه سالكاً طريق تجلي الروح قائلاً: { لئن لم يهدني ربّي } إلى نور وجهه { لأكونن من القوم الضّالين } الذين يحتجبون بالبواطن عنه كالنصارى الواقفين مع الحجب النورانية\n { فلما رأى الشمس } الروح { بازِغَة } بتجليها عليه وظهور نورها وجد فيضه وشهوده وربوبيته منها إذ كان الله تعالى يريه حينئذ باسمه الشهيد والعلي العظيم { قال هذا ربي هذا أكبر } لعظمته وشدّة نورانيته { فلما أفلت } باستيلاء أنوار تجلي الحق وطلوع سبحات الوجه الباقي\n وانكشاف حجاب الذات بوصوله إلى مقام الوحدة رأى النظر إلى الروح وإلى وجوده مشركاً فقال: { يا قوم إني بريء مما تُشْركون } به أي: أيّ شيء كان إذ لا وجود لغيره { إني وجهت وجهي } أي: أسلمت ذاتي ووجودي { للذي } أوجد سموات الأرواح وأرض النفس مائلاً عن كل ما سواه حتى عن وجودي بالفناء فيه { وما أنا من المُشْركين } أي: لست من الشرك في شيء\n كوجود البقية وظهورها وغير ذلك",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:78",
      "similarity": 0.9233621522815788
    },
    {
      "verse": "6:76",
      "similarity": 0.46881700635247386
    },
    {
      "verse": "29:61",
      "similarity": 0.08395567504764341
    },
    {
      "verse": "91:2",
      "similarity": 0.08006108354769706
    },
    {
      "verse": "74:32",
      "similarity": 0.07919363385387218
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006077.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006077.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:77.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}