{
  "chapter": "الأنعام",
  "text": "فلما رءا الشمس بازغة قال هذا ربى هذا اكبر فلما افلت قال يقوم انى برىء مما تشركون",
  "translations": [
    {
      "translation": "Then when he saw the sun come up he said, 'This is my Lord! This is greater!' Then when it set he said, 'My people, I am free of what you associate with Allah!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When (Azar) saw the sun rise all resplendent, he said: \"My Lord is surely this, and the greatest of them all.\" But the sun also set, and (Abraham) said: \"O my people, I am through with those you associate (with God).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when he beheld the sun rising, he said: 'This is my Lord. This is the greatest of all.' Then, when it went down, he said: 'O my people! Most certainly I am quit of those whom you associate with Allah in His divinity.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw the rising sun, he said, \"This is my Lord for it is greater (than the others).\" But when this too faded away, (Abraham) said, \"My people, I disavow whatever you consider equal to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when he saw the sun shining brightly, he said, “(You say that) this is my Lord? This is the biggest of them all!”; then when it set he said, “O people! I do not have any relation with the whatever you ascribe as partners (to Him).”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw the sun rising up, he said: \"This is my lord. This is greater.\" But when it Afalat, he said: \"O my people! I am indeed free from all that you join as partners in worship with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when he saw the sun rising, he said: Is this my Lord? Is this the greatest? So when it set, he said: O my people! surely I am clear of what you set up (with Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw the sun rising, he said, 'This is my Lord; this is greater!' But when it set he said, 'O my people, surely I am quit of that you associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he saw the sun uprising, he cried: This is my Lord! This is greater! And when it set he exclaimed: O my people! Lo! I am free from all that ye associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he saw the sun shining, he said, \"This is my Lord! This is the greatest of all!\" Then when it set, he said, \"My people, I disown all that you worship besides God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when he beheld the sun uprise, he said: this is mine Lord; this is the greatest. Then when it set, he said: O my people! verily I am quit of that which ye associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he saw the sun rising, he said, ‘This is my Lord! This is bigger!’ But when it set, he said, ‘O my people, indeed I disown what you take as [His] partners.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw the sun rising in splendour, he said: \"This is my Lord; this is the greatest (of all).\" But when the sun set, he said: \"O my people! I am indeed free from your (guilt) of giving partners to Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When he saw the sun rising up, he said: \"This is my lord. This is greater.\" But when it set, he said: \"O my people! I am indeed free from all that you join as partners in worship with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he saw the sun rise, shining, he said: 'This must be my Lord, it is larger' But when it set, he said: 'O nation I am quit of what you associate (with Allah, the Creator),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when he saw the sun rising, he said, “This is my lord, this is bigger.” But when it set, he said, “O my people, I am innocent of your idolatry.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when he saw the sun rising, he said, \"This is my lord; this is greater.\" But when it set, he said, \"O my people, indeed I am free from what you associate with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:78] And when he saw the sun rising, he said, ‘This is my Lord; this is greater!’ than the star and the moon (the masculine [demonstrative pronoun] hādhā, ‘this’, is used [for the feminine shams, ‘sun’] because the predicate [rabbī, ‘my Lord’] is masculine). But when it set, and the argument against them had become stronger and they still had not repented, he said, ‘O my people, surely I am innocent of what you associate, with God, in the way of idols and accidental bodies, which require an originator. They then asked him, ‘What do you worship?’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when he saw the sun uprising) filling everything [with its light], (he cried: This is my Lord!) Could this be my Lord? (This is greater!) This is bigger than the first and the second. (And when it set) when it disappeared, Abraham said: I do not love a lord who is not lasting. If Allah does not guide me, I shall be of those who err. It is also said that Abraham said 'this is my Lord' mocking his people, for his people worshipped the sun, the moon and the stars. He therefore objected to such worship by mocking them, saying to them: could the like of these be a Lord? When he emerged from the hole and went to his people- he was then 17 years old-he looked at the sky and the earth and then said: my Lord is Him Who has created this. He then proceeded until he found a group of his people attending with devotion to their idols, (he exclaimed: my people! Lo! I am free from all that ye associate (with Him)) of idols. 142\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وصيانةً للرب عن شبهة التأنيث { هذا أكبر } لكبر النور وسطوعه أكثر\n { فلما أفلت قال يا قوم إني بريء مما تشركون } من الأجرام المحدثة المحسوسة\n المحتاجة إلى محدث يحدثها\n ومخصص يخصصها\n ولما تبرأ من عبادتها توجه إلى موجدها ومبدعها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:77",
      "similarity": 0.9233621522815787
    },
    {
      "verse": "6:76",
      "similarity": 0.4606830162716146
    },
    {
      "verse": "6:19",
      "similarity": 0.10102463092813792
    },
    {
      "verse": "59:16",
      "similarity": 0.08929472815633112
    },
    {
      "verse": "9:3",
      "similarity": 0.08849762496672495
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006078.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006078.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:78.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}