{
  "chapter": "الأنعام",
  "text": "انى وجهت وجهى للذى فطر السموت والارض حنيفا وما انا۠ من المشركين",
  "translations": [
    {
      "translation": "I have turned my face to Him Who brought the heavens and earth into being, a pure natural believer. I am not one of the mushrikun.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have truly turned my face towards Him who created the heavens and the earth: I have chosen one way and am not an idolater.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold, I have turned my face in exclusive devotion to the One Who originated the heavens and the earth, and I am certainly not one of those who associate others with Allah in His divinity.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have up-rightly submitted myself to the One who has created the heavens and the earth and I am not an idol worshipper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“I have directed my attention towards Him Who has created the heavens and the earth, am devoted solely to Him, and am not of the polytheists.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, I have turned my face towards Him Who has created the heavens and the earth, Hanifan, and I am not of the idolators.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely I have turned myself, being upright, wholly to Him Who originated the heavens and the earth, and I am not of the polytheists.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have turned my face to Him who originated the heavens and the earth, a man of pure faith; I am not of the idolaters.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! I have turned my face toward Him Who created the heavens and the earth, as one by nature upright, and I am not of the idolaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have set my face with single-minded devotion, towards Him who has created the heavens and the earth, and I am not one of the polytheists.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily I have set my countenance towards Him who hath created the heavens and the earth, upright, and am not of the associaters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Indeed I have turned my face toward Him who originated the heavens and the earth, as a Hanif, and I am not one of the polytheists.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For me, I have set my face, firmly and truly, towards Him Who created the heavens and the earth, and never shall I give partners to Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, I have turned my face towards Him Who has created the heavens and the earth Hanifa (Islamic Monotheism, i.e. worshipping none but Allah Alone) and I am not of Al-Mushrikun (see V. 2:105)\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have turned my face to Him who has created the heavens and the earth, uprightly, and I am not among the idolaters'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I have directed my attention towards Him Who created the heavens and the earth—a monotheist—and I am not of the idolaters.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, I have turned my face toward He who created the heavens and the earth, inclining toward truth, and I am not of those who associate others with Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:79] He said: Verily I have turned my face to, I am seeking in worship, Him Who originated, created, the heavens and the earth, namely, God; a hanīf, inclining towards the upright religion, and I am not of those that associate others’, with Him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When they asked him: who do you worship? He said: (Lo! I have turned my face towards) I have made my religion and works sincere to (him Who created the heavens and the earth, as one by nature upright) Muslim, (and I am not of the idolaters) who follows their religion.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنِّي } بعدما اجتهدت في طريق التوحيد\n وبذلت جهدي في مسالكه { وَجَّهْتُ وَجْهِيَ } أي: وجه قلبي الذي هو يلي الحق نحوه بتوفيق منه\n وجذب من جانبه وتوجهت { لِلَّذِي فَطَرَ } قدره وأظهره بلا مادة ومدة { ٱلسَّمَٰوَٰتِ وَٱلأَرْضَ } أي: العالم العلوي والسفلي { حَنِيفاً } مائلاً عن جميع الأديان الباطلة والآراء الفاسدة { وَ } بعدما تحققت بما تحققت { مَآ أَنَاْ مِنَ ٱلْمُشْرِكِينَ } [الأنعام: 79] بإثبات الوجود لغير الحق بل الوجود منحصر به وما سواه أظلال أوصافه وعكوس تجلياته\n لا إله إلا هو\n وكل شيء هالك إلا وجهه\n له الحكم وإليه ترجعون رجوع الظل إلى ذي الظل\n\n\n{ وَحَآجَّهُ قَوْمُهُ } أي: خاصموا في توحيد الله قالوا: أتترك ما يعبد آباؤنا بتسويلات نفسك يا إبراهيم؟ { قَالَ أَتُحَٰجُّوۤنِّي } وتخاصموني { فِي } حق { ٱللَّهِ } وتجادلونني في توحيده وتخوفونني بهذه التماثيل الزائفة\n! { وَ } الحال أنه { قَدْ هَدَانِ } بلطفه إلى مقر توحيده { وَ } بعدما كوشفت بتوحيد الله واستقلاله بالتصرف في مظاهره { لاَ أَخَافُ مَا تُشْرِكُونَ بِهِ } إذ لا نفع منه ولا ضر { إِلاَّ أَن يَشَآءَ رَبِّي شَيْئاً } مكروهاً يلحقني من جهتها\n لأنه من جملة مظاهره إذ { وَسِعَ } وأحاط { رَبِّي كُلَّ شَيْءٍ عِلْماً أَفَلاَ تَتَذَكَّرُونَ } [الأنعام: 80] وتتفكرون\n لتميزوا بين المظهر والظاهر والعاجز والقادر\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فقال: { إني وجهت وجهي للذي فطر } أي: أبدع { السماوات والأرض } حال كوني { حنيفًا } أي: مائلاً عن دينكم { وما أنا من المشركين } مثلكم\n وإنما احتج بالأفول دون البزوغ\n مع أنه تغير لأن الأفول أظهر في الدلالة لأنه انتقال مع اختفاء واحتجاب\n ولأنه رأى الكوكب الذي يعبدونه في وسط السماء حين حاول الاستدلال\n وقيل: إن هذا الاستدلال والاحتجاج كان في حال طفولته قبل التكليف\n فقد رُوِي أنه لما ولدته أمه في غار\n خوفًا من نمرود إذ كان يقتل الأطفال لأن المنجمين أخبروه أن هلاكه على يد صبي يُولد في هذا العصر\n فكان يستدل بما رأى على توحيد ربه\n وهو في الغار\n وهذا ضعيف لأن قوله: { إني بريء مما تشركون } يقتضي المحاججة والمخاصمة لقومه\n وقوله عليه السلام: { هذا ربي }  مع قوله:\n\n[الصَّافات:89]\n و\n[الأنبياء:63]\n ليس بكذب للعصمة\n وإنما هو تورية\n وفي الحديث:\n \" ليس بكاذبٍ من كاذَب ظالمًا\n أو دفع ضررًا\n أو رعى حقًا\n أو حفظ قلبًا \" \nوفي رواية أخرى:\n \" ليس بكاذب\n من قال خيرًا أو نواه \" \nوأما اعتذاره في حديث الشفاعة فلهول المطلع\n فيقع الحذر من أدنى شيء\n والله تعالى أعلم\n الإشارة: لمَّا كوشف إبراهيم بعالم الملكوت\n رأى الله في الأشياء كلها\n كما ورد في بعض الأثر: ما رأيت شيئًا إلا رأيت الله فيه\n وإنما قال: { لا أحب الآفلين } حذرًا من الوقوف مع الحس دون شهود المعنى\n إذ بحر المعاني متصل دائم ليس فيه تغيير ولا انتقال\n وإنما تتغير الأواني دون المعاني\n فشمس المعاني مشرقة على الدوام ليس لها مغيب ولا تغير ولا انتقال\n ولذلك قيل:\nأي: طلعت شمس نهارعرفانهم على ليل وجودهم\n فامتحت ظلمة وجودهم في شهود محبوبهم\n وفي الحِكَم: \" أنا الظواهر بأنوار آثاره\n وأنار السرائر بأنوار أوصافه\n لأجل ذلك أفَلَت أنوار الظواهر\n ولم تأفل أنوار القلوب والسرائر \"\n قال الجَوزِي: لما بدا لإبراهيم نجم العلم\n وطلع قمر التوحيد\n وأشرقت شمس المعرفة ـ قال: { إني بريء مما تشركون إني وجهت وجهي\n\n\n } الآية\n هـ\n قيل: لما نظر إبراهيم عليه السلام بعيون رأسه إلى نور النجم والشمس والقمر الحسي\n نودي في سره: يا إبراهيم\n لا تنظر ببصرك إلى الجهة الحسية\n وانظر ببصيرتك إلى الحقيقة المعنوية لأن الوجود كله عين الأحدية\n فافهم معاني الأسماء\n ولا تقف مع جرم الأرض والسماء\n فإن الوقوف مع الحس حجاب عن المعنى\n فقال إبراهيم: { إني وجهت وجهي للذي فطر السماوات والأرض حنيفًا وما أنا من المشركين }\n هـ\n وفي ذلك يقول الششتري أيضًا:\nولما احتج إبراهيم عليه السلام على قومه خاصموه في ذلك كما قال تعالى: { وَحَآجَّهُ قَوْمُهُ قَالَ أَتُحَاجُّوۤنِّي فِي ٱللَّهِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:30",
      "similarity": 0.7943184832879702
    },
    {
      "verse": "10:105",
      "similarity": 0.7232479773404039
    },
    {
      "verse": "3:67",
      "similarity": 0.5525885050238943
    },
    {
      "verse": "3:95",
      "similarity": 0.5224006930385354
    },
    {
      "verse": "16:123",
      "similarity": 0.5055762510379662
    }
  ]
}