{
  "chapter": "الأنعام",
  "text": "وقالوا۟ لولا انزل عليه ملك ولو انزلنا ملكا لقضى الامر ثم لا ينظرون",
  "translations": [
    {
      "translation": "They say. 'Why has an angel not been sent down to him?' If We were to send down an angel, that would be the end of the affair and they would have no reprieve.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"How is it no angel was sent down to him?\" Had We sent an angel down the matter would have come to end, and they would have had no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They also say: 'Why has no angel been sent down to this Prophet?' Had We sent down an angel, the matter would surely have long been decided and no respite would have been granted them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have said, \"Why has not an angel come to him (Muhammad)?\" Had We sent an angel to them, the matter would have inevitably been out of their hands, and they would have been given no more time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “Why has not an angel been sent down to him?” And had We sent down an angel, then the matter would have been finished, and they would not get any respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"Why has not an angel been sent down to him\" Had We sent down an angel, the matter would have been judged at once, and no respite would be granted to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Why has not an angel been sent down to him? And had We sent down an angel, the matter would have certainly been decided and then they would not have been respited.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why has an angel not been sent down on him?' they say; yet had We sent down an angel, the matter would have been determined, and then no respite would be given them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: Why hath not an angel been sent down unto him? If We sent down an angel, then the matter would be judged; no further time would be allowed them (for reflection).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask, \"Why has an angel not been sent down to him?\" If We did send down an angel, the matter would be settled and they would not have been granted any respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: wherefore hath not an angel been sent down unto him? Were We to send down an angel, the affair would have been decreed and they would not be respited.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, ‘Why has not an angel been sent down to him?’ Were We to send down an angel, the matter would surely be decided, and then they would not be granted any respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"Why is not an angel sent down to him?\" If we did send down an angel, the matter would be settled at once, and no respite would be granted them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"Why has not an angel been sent down to him?\" Had We sent down an angel, the matter would have been judged at once, and no respite would be granted to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask: 'Why has no angel been sent down to him' If We had sent down an angel, their fate would have been determined and they would never have been respited.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “Why was an angel not sent down to him.” Had We sent down an angel, the matter would have been settled, and they would not have been reprieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"Why was there not sent down to him an angel?\" But if We had sent down an angel, the matter would have been decided; then they would not be reprieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:8] And they say, ‘Why has an angel not been sent down to him?’, to Muhammad (s), to confirm his truthfulness; yet had We sent down an angel, as they have requested and if they then did not believe, the matter, that they be destroyed, would have been decreed, and then they would not be given any respite, they would [not] be given any extra time for repentance or an excuse, as is God’s custom [in dealing] with those before them, destroying them when they disbelieve after their request is granted.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على قوله : { ولو نزّلنا عليك كتاباً } ، لأنّ هذا خبر عن تورّكهم وعنادهم ، وما قبله بيان لعدم جدوى محاولة ما يقلع عنادهم ، فذلك فُرض بإنزال كتاب عليهم ، من السماء فيه تصديق النبي صلى الله عليه وسلم وهذا حكاية لاقتراح منهم آية يصدّقونه بها . وفي سيرة ابن إسحاق أنّ هذا القول واقع ، وأنّ من جملة من قال هذا زمعة بن الأسود ، والنضر بن الحارث بن كَلدة ، وعبدة بن عبد يغوث؛ وأبَي ابن خلف ، والعاصي بن وائل ، والوليد بن المغيرة ، وعتبة بن ربيعة ، وشيبة بن ربيعة ، ومن معهم ، أرسلوا إلى النبي صلى الله عليه وسلم سل ربّك أن يبعث معك ملكاً يصدّقك بما تقول ويراجعنا عنك .فقوله : { وقالوا لولا أنزل عليه ملك } أي لولا أنزل عليه ملك نشاهده ويخبرنا بصدقه ، لأنّ ذلك هو الذي يتطلّبه المعاند . أمّا نزول الملك الذي لا يرونه فهو أمر واقع ، وفسّره قوله تعالى في الآية الأخرى : { لولا أنزل إليه ملك فيكونَ معه نذيراً } في سورة الفرقان ( 7 ).والضمير عائد إلى الذين كفروا } وإن كان قاله بعضهم ، لأنّ الجميع قائلون بقوله : وموافقون عليه .و { لولا } للتحضيض بمعنى ( هلاً ). والتحضيض مستعمل في التعجيز على حسب اعتقادهم . وضمير { عليه } للنبيء صلى الله عليه وسلم ومعاد الضمير معلوم من المقام ، لأنّه إذا جاء في الكلام ضمير غائب لم يتقدّم له معاد وكان بين ظهرانيهم من هو صاحب خبر أو قصة يتحدّث الناس بها تعيّن أنَّه المراد من الضمير . ومنه قول النبي صلى الله عليه وسلم لعمر بن الخطاب حين استأذنه في قتل ابن صيّاد : «إن يكْنه فلن تسلّط عليه وإلاّ يكْنه فلا خير لك في قتلة» . يريد من مائر الغيبة الثلاثة الأولى الدجّال لأنّ الناس كانوا يتحدّثون أنّ ابن صيّاد هو الدجّال . ومثل الضمير اسم الإشارة إذا لم يذكر في الكلام اسم يشار إليه . كما ورد في حديث أبي ذرّ أنّه قال لأخيه عند بعثة محمد صلى الله عليه وسلم \" اذهب فاستعلم لنا علم هذا الرجل \" وفي حديث سؤال القبر \" فيقال له ( أي للمقبور ) : ما علمك بهذا الرجل \" يعني أنّ هذا قولهم فيما بينهم ، أو قولهم للذي أرسلوه إلى النبي أن يسأل الله أن يبعث معه ملكاً . وقد افهوه به مرة أخرى فيما حكاه الله عنهم : { وقالوا يا أيّها الذي نزل عليه الذكر إنك لمجنون لو ما تأتينا بالملائكة إن كنت من الصادقين } فإنّ ( لَوْما ) أخت ( لولا ) في إفادة التحضيض .وقوله : { ولو أنزلنا ملكاً لقضي الأمر ثم لا ينظرون } معناه : لو أنزلنا ملكاً على الصفة التي اقترحوها يكلّمهم لقضي الأمر ، أي أمرهم؛ فاللام عوض عن المضاف إليه بقرينة السياق ، أي لقضي أمر عذابهم الذي يتهدَّدهم به .ومعنى : { قُضي } تُمّم ، كما دلّ عليه قوله : { ثم لا ينظرون } ؛ ذلك أنّه لا تنزل ملائكة غير الذين سخّرهم الله للأمور المعتادة مثللِ الحفظة ، وملك الموت ، والملك الذي يأتي بالوحي؛ إلاّ ملائكة تنزل لتأييد الرسل بالنصر على من يكذّبهم ، مثل الملائكة التي نزلت لنصر المؤمنين في بدر . ولا تنزل الملائكة بين القوم المغضوب عليهم إلاّ لإنزال العذاب بهم ، كما نزلت الملائكة في قوم لوط . فمشركو مكة لمّا سألوا النبي أن يريهم ملكاً معه ظنّوا مقترحهم تعجيزاً ، فأنبأهم الله تعالى بأنّهم اقترحوا أمراً لو أجيبوا إليه لكان سبباً في مناجزة هلاكهم الذي أمهلهم إليه فيه رحمة منه .ولعلّ حكمة ذلك أنّ الله فطر الملائكة على الصلابة والغضب للحقّ بدون هوادة ، وجعل الفطرة الملكية سريعة لتنفيذ الجزاء على وفق العمل ، كما أشار إليه قوله تعالى : { ولا يشفعون إلاّ لمن ارتضى } ، فلذلك حجزهم الله عن الاتّصال بغير العباد المكرّمين الذين شابهن نفوسهم الإنسانية النفوس الملكية ، ولذلك حجبهم الله عن النزول إلى الأرض إلاّ في أحوال خاصّة ، كما قال تعالى عنهم : { وما تتنزّل إلاّ بأمر ربّك } ، وكما قال : { ما تنزّل الملائكة إلاّ بالحقّ } فلو أنّ الله أرسل ملائكة في الوسط البشري لما أمهلوا أهل الضلال والفساد ولنا جزوهم جزاء العذاب ، ألا ترى أنّ الملائكة الذين أرسلهم الله لقوم لوط لمّا لقوا لوطاً قالوا : { يا لوط إنّا رسل ربّك لن يصلوا إليك فأسر بأهلك بقطع من الليل }.ولمّا جادلهم إبراهيم في قوم لوط بعد أن بشّروه واستأنس بهم { قالوا يا إبراهيم أعرض عن هذا إنّه قد جاء أمر ربّك } وهو نزول الملائكة؛ فليس للملائكة تصرف في غير ما وجهّوا إليه .فمعنى الآية أنّ ما اقترحوه لو وقع لكان سيء المغبّة عليهم من حيث لا يشعرون . وليس المراد أنّ سبب عدم إنزال الملك رحمة بهم بل لأنّ الله ما كان ليظهر آياته عن اقتراح الضاليّن ، إذ ليس الرسول صلى الله عليه وسلم بصدد التصدّي لرام كلّ من عُرضت عليه الدعوة أن تظهر له آية حسب مقترحه فيصير الرسول صلى الله عليه وسلم مضيّعاً مدّة الإرشاد وتلتفّ عليه الناس التفافهم على المشعوذين ، وذلك ينافي حرمة النبوة ، ولكن الآيات تأتي عن محض اختيار من الله تعالى دون مسألة . وأنّما أجاب الله اقتراح الحواريّين إنزال المائدة لأنّهم كانوا قوماً صالحين ، وما أرادوا إلاّ خيراً . ولكنّ الله أنبأهم أنّ إجابتهم لذلك لحكمة أخرى وهي تستتبع نفعاً لهم من حيث لا يشعرون ، فكانوا أحرياء بأن يشكروا نعمة الله عليهم فيما فيه استبقاء لهم لو كانوا موفّقين . وسيأتي عند قوله تعالى : { وقالوا لولا نزّل عليه آية من ربّه قل إنّ الله قادر على أن ينزلّ آية } زيادة بيان لهذا .ومن المفسّرين من فسّر { قضي الأمر } بمعنى هلاكهم من هول رؤية الملك في صورته الأصبية . وليس هذا بلازم لأنّهم لم يسألوا ذلك . ولا يتوقّف تحقّق ملكيّته عندهم على رؤية صورة خارقة للعادة ، بل يكفي أن يروه نازلاً من السماء مثلاً حتى يصاحب النبي صلى الله عليه وسلم حين يدعوهم إلى الإسلام ، كما يدلّ عليه قوله الآتي : { ولو جعلناه ملكاً لجعلناه رجلاً }.\n\n",
      "translations": [
        {
          "translation": "(They say) i.e. 'Abdullah Ibn Umayyah al-Makhzumi: (Why hath not an angel been sent down unto him?) to testify for what he is saying. (If We sent down an angel) as they are asking you, (then the matter would be judged) he would come down to punish them and take away their souls; it is also said that this means: if the angel comes down, he would destroy all of them; (no further time would be allowed them (for reflection)) they would not be allowed any delay. 132\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَالُواْ } من غاية شقاقهم ونفاقهم معك: إن كان نبياً { لَوْلاۤ } هلا { أُنزِلَ عَلَيْهِ مَلَكٌ } ويصدقه بنبوته فنصدقه\n قل لهم في جوابهم نيابة عنا: { وَلَوْ أَنزَلْنَا مَلَكاً } على مقتضى سنتنا في الأمم الماضية { لَّقُضِيَ ٱلأَمْرُ } أي: لتحقق أمر إهلاكهم البتة { ثُمَّ } بعد نزول الملك بل تعذبون كالأمم السالفة { لاَ يُنظَرُونَ } [الأنعام: 8] ولا يمهلون ساعة ولينكرون ويعذبون البتة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقالوا لولا أُنزل عليه ملك } يكلمنا أنه نبي\n { أو يكون معه نذيرًا } أو شهيدًا له بالرسالة\n رُوِي أن العاص بن وائل والنضر بن الحارث وزمعة بن الأسود هم الذين سألوا ذلك\n قال تعالى: { ولو أنزلنا ملكًا } \n كما طلبوا { لقُضي الأمر } بهلاكهم\n فإنَّ سُنة الله جرَت بذلك فيمن قبلهم مهما اقترحوا آية\n فظهرت ثم كفروا\n عجَّل الله هلاكهم\n { ثم لا يُنظرون } أي: لا يُمهلون بعد نزولها ساعة\n وعلى تقدير لو أنزلنا عليهم الملك ـ كما اقترحوا ـ فلا يمكن أن يظهر إلا على صورة البشر ليُطيقوا رؤيته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:20",
      "similarity": 0.4686057468826497
    },
    {
      "verse": "6:58",
      "similarity": 0.4316544327412707
    },
    {
      "verse": "40:68",
      "similarity": 0.4289359927003101
    },
    {
      "verse": "15:8",
      "similarity": 0.39529422739795894
    },
    {
      "verse": "29:50",
      "similarity": 0.37045241809340024
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006008.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006008.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:8.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}