{
  "chapter": "الأنعام",
  "text": "وقالوا۟ لولا انزل عليه ملك ولو انزلنا ملكا لقضى الامر ثم لا ينظرون",
  "translations": [
    {
      "translation": "They say. 'Why has an angel not been sent down to him?' If We were to send down an angel, that would be the end of the affair and they would have no reprieve.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"How is it no angel was sent down to him?\" Had We sent an angel down the matter would have come to end, and they would have had no respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They also say: 'Why has no angel been sent down to this Prophet?' Had We sent down an angel, the matter would surely have long been decided and no respite would have been granted them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have said, \"Why has not an angel come to him (Muhammad)?\" Had We sent an angel to them, the matter would have inevitably been out of their hands, and they would have been given no more time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “Why has not an angel been sent down to him?” And had We sent down an angel, then the matter would have been finished, and they would not get any respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"Why has not an angel been sent down to him\" Had We sent down an angel, the matter would have been judged at once, and no respite would be granted to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: Why has not an angel been sent down to him? And had We sent down an angel, the matter would have certainly been decided and then they would not have been respited.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why has an angel not been sent down on him?' they say; yet had We sent down an angel, the matter would have been determined, and then no respite would be given them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: Why hath not an angel been sent down unto him? If We sent down an angel, then the matter would be judged; no further time would be allowed them (for reflection).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask, \"Why has an angel not been sent down to him?\" If We did send down an angel, the matter would be settled and they would not have been granted any respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: wherefore hath not an angel been sent down unto him? Were We to send down an angel, the affair would have been decreed and they would not be respited.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, ‘Why has not an angel been sent down to him?’ Were We to send down an angel, the matter would surely be decided, and then they would not be granted any respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say: \"Why is not an angel sent down to him?\" If we did send down an angel, the matter would be settled at once, and no respite would be granted them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: \"Why has not an angel been sent down to him?\" Had We sent down an angel, the matter would have been judged at once, and no respite would be granted to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask: 'Why has no angel been sent down to him' If We had sent down an angel, their fate would have been determined and they would never have been respited.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, “Why was an angel not sent down to him.” Had We sent down an angel, the matter would have been settled, and they would not have been reprieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say, \"Why was there not sent down to him an angel?\" But if We had sent down an angel, the matter would have been decided; then they would not be reprieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:8] And they say, ‘Why has an angel not been sent down to him?’, to Muhammad (s), to confirm his truthfulness; yet had We sent down an angel, as they have requested and if they then did not believe, the matter, that they be destroyed, would have been decreed, and then they would not be given any respite, they would [not] be given any extra time for repentance or an excuse, as is God’s custom [in dealing] with those before them, destroying them when they disbelieve after their request is granted.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They say) i.e. 'Abdullah Ibn Umayyah al-Makhzumi: (Why hath not an angel been sent down unto him?) to testify for what he is saying. (If We sent down an angel) as they are asking you, (then the matter would be judged) he would come down to punish them and take away their souls; it is also said that this means: if the angel comes down, he would destroy all of them; (no further time would be allowed them (for reflection)) they would not be allowed any delay. 132\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَقَالُواْ } من غاية شقاقهم ونفاقهم معك: إن كان نبياً { لَوْلاۤ } هلا { أُنزِلَ عَلَيْهِ مَلَكٌ } ويصدقه بنبوته فنصدقه، قل لهم في جوابهم نيابة عنا: { وَلَوْ أَنزَلْنَا مَلَكاً } على مقتضى سنتنا في الأمم الماضية { لَّقُضِيَ ٱلأَمْرُ } أي: لتحقق أمر إهلاكهم البتة { ثُمَّ } بعد نزول الملك بل تعذبون كالأمم السالفة { لاَ يُنظَرُونَ } [الأنعام: 8] ولا يمهلون ساعة ولينكرون ويعذبون البتة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:20",
      "similarity": 0.4686057468826497
    },
    {
      "verse": "6:58",
      "similarity": 0.4316544327412707
    },
    {
      "verse": "40:68",
      "similarity": 0.4289359927003101
    },
    {
      "verse": "15:8",
      "similarity": 0.39529422739795894
    },
    {
      "verse": "29:50",
      "similarity": 0.37045241809340024
    }
  ]
}