{
  "chapter": "الأنعام",
  "text": "وحاجه قومه قال اتحجونى فى الله وقد هدىن ولا اخاف ما تشركون به الا ان يشاء ربى شيـا وسع ربى كل شىء علما افلا تتذكرون",
  "translations": [
    {
      "translation": "His people argued with him. He said, 'Are you arguing with me about Allah when He has guided me? I have no fear of any partner you ascribe to Him unless my Lord should will such a thing to happen. My Lord encompasses all things in His knowledge so will you not pay heed?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people argued, and he said: \"Do you argue with me about God? He has guided me already, and I fear not what you associate with Him, unless my Lord wills, for held within the knowledge of my Lord is everything. Will you not reflect?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His. people remonstrated with him whereupon Abraharn said: 'Do you remonstrate with me concerning Allah Who has guided me to the right way? I do not fear those whom you associate with Allah in His divinity. Only that which my Lord wills, indeed that alone will come by. My Lord embraces all things within His knowledge. Will you not take heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In an argument with his people, (Abraham) asked them, \"Why do you argue with me about God who has given me guidance? Your idols can do no harm to me unless God wills. God knows all things. Why, then, do you not consider this?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people argued with him; he said, “What! You dispute with me concerning Allah? So He has guided me; and I do not have any fear of whatever you ascribe as partners, except what my Lord wills (to happen); my Lord’s knowledge encompasses all things; so will you not accept advice?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people disputed with him. He said: \"Do you dispute with me about Allah while He has guided me, and I fear not those whom you associate with Allah in worship. (Nothing can happen to me) except when my Lord wills something. My Lord comprehends in His knowledge all things. Will you not then remember\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people disputed with him. He said: Do you dispute with me respecting Allah? And He has guided me indeed; and I do not fear in any way those that you set up with Him, unless my Lord pleases; my Lord comprehends all things in His knowledge; will you not then mind?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people disputed with him. He said, 'Do you dispute with me concerning God, and He has guided me? I fear not what you associate with Him, except my Lord will aught. My Lord embraces all things in His knowledge; will you not remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people argued with him. He said: Dispute ye with me concerning Allah when He hath guided me? I fear not at all that which ye set up beside Him unless my Lord willeth aught. My Lord includeth all things in His knowledge. Will ye not then remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people argued with him. He said, \"Are you arguing with me about God, while He has guided me? I have no fear of any partner you ascribe to Him, unless my Lord should wish otherwise. My Lord encompasses all things in His knowledge, so will you not pay heed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people contended with him. He said; contend ye with me concerning Allah when He hath surely guided me? I fear not that which ye associate with Him save aught that mine Lord may will. My Lord comprehendeth everything in His Knowledge. Will ye not then be admonished?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people argued with him. He said, ‘Do you argue with me concerning Allah, while He has guided me for certain? I do not fear what you ascribe to Him as [His] partners, excepting anything that my Lord may wish. My Lord embraces all things in [His] knowledge. Will you not then take admonition?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people disputed with him. He said: \"(Come) ye to dispute with me, about Allah, when He (Himself) hath guided me? I fear not (the beings) ye associate with Allah: Unless my Lord willeth, (nothing can happen). My Lord comprehendeth in His knowledge all things. Will ye not (yourselves) be admonished?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people disputed with him. He said: \"Do you dispute with me concerning Allah while He has guided me, and I fear not those whom you associate with Allah in worship. (Nothing can happen to me) except when my Lord (Allah) wills something. My Lord comprehends in His Knowledge all things. Will you not then remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His nation argued with him. He said: 'Will you argue with me about Allah, indeed He guided me! Except by His will, I do not fear those you associate with Him. My Lord embraces all things in knowledge, will you not remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people argued with him. He said, “Do you argue with me about God, when He has guided me? I do not fear what you associate with Him, unless my Lord wills it. My Lord comprehends all things in knowledge. Will you not reconsider?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And his people argued with him. He said, \"Do you argue with me concerning Allah while He has guided me? And I fear not what you associate with Him [and will not be harmed] unless my Lord should will something. My Lord encompasses all things in knowledge; then will you not remember?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:80] But his people disputed with him, they argued with him about his religion and threatened him that the idols would strike him with evil if he abandoned them. He said, ‘Do you dispute with me (read a-tuhājjūnnī, or atuhājūnī where one of the two letters nūn is omitted, the nūn which grammarians refer to as nūn al-raf‘, ‘the nūn of [modal] independence’, and which the Qur’ānic reciters refer to as nūn al-wiqāya, ‘the nūn of preservation’); do you argue with me, concerning, the Oneness of, God when He, exalted be He, has guided me, to it? I have no fear of what you associate with Him, in the way of idols, that they might strike me with some evil, since they have no power to do anything, unless my Lord wills something, harmful to befall me and it does. My Lord encompasses all things through His knowledge; will you not remember, this and believe?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(His people argued with him) regarding their gods and threatened him by them so that he would leave the religion of Allah. (He) Abraham (said: Dispute ye with me concerning Allah) do you argue with me in favour of your gods and threaten me so that I might leave the religion of my Lord (when He hath guided me) to His religion? (I fear not at all that which ye set beside Him) i.e. idols (unless my Lord willeth aught) to take away the knowledge from my heart such that I fear what you do. (My Lord includeth all things in His knowledge) my Lord knows that you do not follow the Truth: (Will ye not then remember) take admonition from the warning I am telling you about?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وحاجه قَوْمه } في نفي التأثير عن الأجرام والأكون وترك تعبّد كل ما سوى الله { قال أتحاجوني في الله وقد هدان } إلى توحيده { ولا أخاف ما تشركون } وتقولون بتأثيره أبداً { إلا } وقت { أن يشاء ربي شيئاً } من جهتها بي من مكروه أو ضرّ يلحقني من جهتها وذلك منه وبعلمه لا منها\n { وسع ربي كل شيء عِلْماً } يعلم حالي وما فيه صلاحي\n إن علم إضراري من جهتها أولى بي فعل { أفلا تتذكرون } فتميزوا بين العاجز والقادر\n { الذين آمنوا } بالتوحيد الذاتي { ولم } يخلطوا { إيمانهم بظلم } من ظهور نفس القلب أو وجود بقية فإنها شرك خفيّ { أولئك لهم الأمْن } الحقيقي الذي لا خوف معه { وهم مُهْتَدون } بالحقيقة إلى الحق { وتِلكَ حجتنا } أي: حجة التوحيد التي احتجّ بها إبراهيم على قومه { كل من الصالحين } الذين يقومون بصلاح العالم وضبط نظامه وتدبيره لاستقامتهم بالوجود الموهوب الحقاني بعد فناء الوجود البشري { وكلاًّ فضلنا على } عالمي زمانهم\n { وما قدروا الله حق قدره إذ قالوا ما أنزل الله على بَشَر من شيء } أي: ما عرفوه حق معرفته إذ بالغوا في تنزيهه حتى جعلوه بعيداً من عباده بحيث لا يمكن أن يظهر من علمه وكلامه عليهم شيء ولو عرفوه حق معرفته لعلموا أن لا وجود لعباده ولا لشيء آخر إلا به\n والكل موجود بوجوده لا وجود إلا له جميع عالم الشهادة ظاهره وعالم الغيب باطنه\n ولكل باطن ظاهر\n فأيّ حرج من ظهور بعض صفاته على مظهر بشري بل لا مظهر لكمال علمه الباطن وحكمته إلا الإنسان الكامل\n فالنبي من حيث الصورة ظاهره\n ومن حيث المعنى باطنه ينزل علمه على قلبه ويظهر على لسانه ويدعو به عباده إلى ذاته ولا إثنينية إلا باعتبار تفاصيل صفاته\n وأما باعتبار الجمع فلا أحد موجود إلا هو لا النبيّ ولا غيره\n فإذا اعتبرنا تفاصيل صفاته وأسمائه يظهر النبي تبعية الخاص في ذاته تعالى ببعض صفاته فيصير اسماً من أسمائه\n وإذا كان كاملاً في نبوّته يكون الأعظم الذي لا تنفتح أبواب خزائن غيبه ووجوده وحكمته إلا به كما سمعت\n فلا تنكر إن عجبت وحرمت من فهمه وبهت\n فعسى أن يفتح الله عين بصيرتك فترى ما لا عين رأت أو سمع قلبك\n فتسمع ما لا أذن سمعت أو ينوّر قلبك فتدرك ما لا خطر على قلب بشر",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وَحَآجَّهُ قَوْمُهُ قَالَ أَتُحَآجُّونّيِ فيِ اللهِ وقد هَدَآنِ\n\n\n }  يقول الحقّ جلّ جلاله: { وحاجه قومه } أي: خاصموه في التوحيد\n فقال لهم: { أتحاجُّوني في الله } أي: في وحدانيته\n أو في الإيمان به\n وقد هداني إلى توحيده وأرشدني إلى معرفته\n فلا ألتفت إلى غيره\n ولا أعبأ بمن خاصمني فيه\n والأصل: تحاجونني\n فحذف نافع وابن عامر نون الرفع\n وأبقى نون الوقاية\n وقيل: العكس\n وأدغم الباقون أحدى النونين في الأخرى\n الإشارة: مخاصمة العموم لأهل الخصوصية سُنَّة ماضية\n[الأحزاب:62] لأنَّ من أنكر شيئًا عاداه\n فأهل الخصوصية يَعذرون من أنكر عليهم لأن ذلك مبلغهم من العلم\n والعامة لا يعذرون أهل الخصوصية لخروجهم عن بلادهم فلا يعرفون ما هم فيه\n والله تعالى أعلم\n ولما خاصموا إبراهيم عليه السلام فلم يلتفت إليهم\n خوفوه بأصنامهم\n فقال لهم: {\n\n\n وَلاَ أَخَافُ مَا تُشْرِكُونَ بِهِ إِلاَّ أَن يَشَآءَ رَبِّي شَيْئاً وَسِعَ رَبِّي كُلَّ شَيْءٍ عِلْماً أَفَلاَ تَتَذَكَّرُونَ وَكَيْفَ أَخَافُ مَآ أَشْرَكْتُمْ وَلاَ تَخَافُونَ أَنَّكُمْ أَشْرَكْتُم بِٱللَّهِ مَا لَمْ يُنَزِّلْ بِهِ عَلَيْكُمْ سُلْطَاناً فَأَيُّ ٱلْفَرِيقَيْنِ أَحَقُّ بِٱلأَمْنِ إِن كُنتُمْ تَعْلَمُونَ ٱلَّذِينَ آمَنُواْ وَلَمْ يَلْبِسُوۤاْ إِيمَانَهُمْ بِظُلْمٍ أُوْلَـٰئِكَ لَهُمُ ٱلأَمْنُ وَهُمْ مُّهْتَدُونَ }  قلت: الاستثناء في قوله: { إلا أن يشاء }: منقطع\n قاله ابن جزي\n وظاهر كلام البيضاوي: أنه متصل\n وهو المتبادر\n أي: ولا أخاف ما تشركون في حال من الأحوال إلا أن يشاء ربي أن يصيبني بمكروه من جهتها استدراجًا لكم\n وفتنة\n وقال الواحدي: لا أخاف إلا مشيئة ربي أن يعذبني\n يقول الحقّ جلّ جلاله: حاكيًا عن خليله إبراهيم: { ولا أخاف ما تُشركون به } أي: لا أخاف معبوداتكم أن تصيبني بشيء لأنها جوامد لا تضر ولا تنفع\n { إلا أن يشاء ربي شيئًا } يصيبني بقدَره وقضائه\n فإنه يصيبني لا محالة\n لا بسببها\n { وَسِعَ ربي كل شيء علمًا } \n كأنه علَّة الاستثناء\n أي: لا أخاف إلا ما سبق في مشيئة الله\n لأنه أحاط بكل شيء علمًا\n فلا يبعد أن يكون في علمه وقدره أن يحيق بي مكروه من جهتها\n { أفلا تتذكرون } فتُمَيزوا بين الصحيح والفاسد\n والقادر والعاجز؟",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:73",
      "similarity": 0.632725141000588
    },
    {
      "verse": "20:98",
      "similarity": 0.543538157716862
    },
    {
      "verse": "3:66",
      "similarity": 0.4939053012941517
    },
    {
      "verse": "6:149",
      "similarity": 0.48185476471182376
    },
    {
      "verse": "2:139",
      "similarity": 0.44244197961350845
    }
  ]
}