{
  "chapter": "الأنعام",
  "text": "وكيف اخاف ما اشركتم ولا تخافون انكم اشركتم بالله ما لم ينزل به عليكم سلطنا فاى الفريقين احق بالامن ان كنتم تعلمون",
  "translations": [
    {
      "translation": "Why should I fear what you have associated with Him when you yourselves apparently have no fear of associating partners with Allah for which He has sent down no authority to you? Which of the two parties is",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should I fear those you associate with Him when you fear not associating others with God for which He has sent down no sanction? Tell me, whose way is the way of peace, if you have the knowledge?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should I fear those whom you have associated (with Allah in His divinity) when you do not fear associating others with Allah in His divinity - something for which He has sent down to you no authority. Then, which of the two parties has better title to security? Tell us, if you have any knowledge!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should I be afraid of your idols when you are not afraid of worshipping them without any authority from heaven? Would that you knew which of us is more deserving to receive amnesty\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And how should I fear whatever you ascribe as partners, whilst you do not fear that you have ascribed partners to Allah – for which He has not sent down on you any proof? So which of the two groups has more right to refuge, if you know?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how should I fear those whom you associate in worship with Allah, while you fear not that you have joined in worship with Allah things for which He has not sent down to you any Sultan. (So) which of the two parties has more right to be in security If you but know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how should I fear what you have set up (with Him), while you do not fear that you have set up with Allah that for which He has not sent down to you any authority; which then of the two parties is surer of security, if you know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How should I fear what you have associated, seeing you fear not that you have associated with God that whereon He has not sent down on you any authority?' Which of the two parties has better title to security, if you have any knowledge?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How should I fear that which ye set up beside Him, when ye fear not to set up beside Allah that for which He hath revealed unto you no warrant? Which of the two factions hath more right to safety? (Answer me that) if ye have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why should I fear what you associate with Him, while you do not fear to associate with God that for which He has sent down to you no authority? Tell me, if you know the truth, which side has more right to feel secure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how should I fear that which ye have associated, while ye fear not to have associated with Allah that for which He hath sent down unto you no warranty? Which, then, of the two parties, is more worthy of security, if ye but knew?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How could I fear what you ascribe [to Him] as [His] partners, when you do not fear ascribing to Allah partners for which He has not sent down any authority to you? So [tell me,] which of the two sides has a greater right to safety, if you know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How should I fear (the beings) ye associate with Allah, when ye fear not to give partners to Allah without any warrant having been given to you? Which of (us) two parties hath more right to security? (tell me) if ye know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how should I fear those whom you associate in worship with Allah (though they can neither benefit nor harm), while you fear not that you have joined in worship with Allah things for which He has not sent down to you any authority. (So) which of the two parties has more right to be in security? If you but know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how should I fear what you have associated when you yourselves are not afraid that you have associated with Allah that which He did not send down for it upon you an authority. Which of the two parties is more deserving of safety, if you know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And why should I fear those you associate with Him, and you do not fear associating others with God for which He sent down to you no authority? Which side is more entitled to security, if you are aware?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how should I fear what you associate while you do not fear that you have associated with Allah that for which He has not sent down to you any authority? So which of the two parties has more right to security, if you should know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:81] How should I fear what you have associated, with God, when it can neither profit nor harm, and you fear not, God [in], that you have associated with God, in worship, that for which He has not revealed to you any warrant?’, [any] argument or proof, when He has power over all things. Which of the two parties has more right to security, is it us or you, if you have any knowledge, of who has more right? In other words: it is us, so follow Him. God, exalted be He, says:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(How should I fear that which ye set up beside Him) of idols, (when ye fear not) Allah (to set up beside Allah that for which He hath revealed unto you no warrant) no Scripture or proof? They threatened him with their gods, saying: we fear that if you vilify our gods, they will take away your sanity. (Which of the two factions) which of the adherents of the two religions: you or I (hath more right to safety) from the God Whom he worships? ((Answer me that) if ye have knowledge) of this.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَيْفَ أَخَافُ } من { مَآ أَشْرَكْتُمْ } مع أنه لا ضرر يتوقع منه { وَلاَ تَخَافُونَ } أنتم من غضب الله مع { أَنَّكُمْ أَشْرَكْتُم بِٱللَّهِ } المتوحد بالألوهية المنزه في ذاته عن الشريك والنظير { مَا لَمْ يُنَزِّلْ } الله { بِهِ } بشركته { عَلَيْكُمْ سُلْطَٰناً } حجة وبرهاناً { فَأَيُّ ٱلْفَرِيقَيْنِ } أي: الموحدون والمشركون { أَحَقُّ بِٱلأَمْنِ }؟ بينوا { إِن كُنتُمْ تَعْلَمُونَ } [الأنعام: 81] أي: من ذوي العلوي والعقول",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكيف أخافُ ما أشركتم } وهو جامد عاجز لا يتعلق به ضرر ولا نفع؟ { ولا تخافون أنكم أشركتم بالله } وهو أحق أن يُخاف منه كل الخوف\n لأنه القادر على الانتقام ممن أشرك معه غيره\n وسوَّى بينه وبين مصنوع عاجز\n لا يضر ولا ينفع\n فأنتم أحق بالخوف لأنكم { أشركتم بالله ما لم يُنزِّل به عليكم سلطانًا } أي: لم يُنَزل بإشراكه كتابًا\n ولم ينصب عليه دليلاً\n { فأيُّ الفريقين أحق بالأمن }: أهل التوحيد والإيمان\n أو أهل الشرك والعصيان؟ { إن كنتم تعلمون } ما يَحق أن يُخاف منه\n\nثم أجاب عن الاستفهام: الحق تعالى أو خليلهُ\n فقال: { الذين آمنوا ولم يلبسوا } أي: يخلطوا { إيمانهم بظلم } أي: بشرك\n بل آمنوا بالله ولم يعبدوا معه غيره",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:100",
      "similarity": 0.5353980912268997
    },
    {
      "verse": "30:35",
      "similarity": 0.5205352534423298
    },
    {
      "verse": "22:71",
      "similarity": 0.44722565234632866
    },
    {
      "verse": "44:19",
      "similarity": 0.43253524191698967
    },
    {
      "verse": "11:96",
      "similarity": 0.4202545453377415
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006081.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006081.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:81.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}