{
  "chapter": "الأنعام",
  "text": "الذين ءامنوا۟ ولم يلبسوا۟ ايمنهم بظلم او۟لئك لهم الامن وهم مهتدون",
  "translations": [
    {
      "translation": "Those who have iman and do not mix up their iman with any wrongdoing, they are the ones who are safe; it is they who are guided.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They alone have peace who believe and do not intermix belief with denial, and are guided on the right path.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and did not tarnish their faith with wrong-doing for them there is security, and it is they who have been guided to the right way.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have accepted the faith and have kept it pure from injustice, have achieved security and guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believed and did not mix it with injustice (disbelief), the refuge is only for them, and only they are on guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is those who believe and confuse not their belief with Zulm (wrong), for them (only) there is security and they are the guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and do not mix up their faith with iniquity, those are they who shall have the security and they are those who go aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and have not confounded their belief with evildoing -- to them belongs the true security; they are rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and obscure not their belief by wrongdoing, theirs is safety; and they are rightly guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is those who have faith, and do not mix their faith with wrongdoing, who will be secure, and it is they who are rightly guided.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is those who believe and confound not their belief with wrong doing. These! theirs is the security and they are the guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have faith and do not taint their faith with wrongdoing—for such there shall be safety, and they are the [rightly] guided.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is those who believe and confuse not their beliefs with wrong - that are (truly) in security, for they are on (right) guidance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is those who believe (in the Oneness of Allah and worship none but Him Alone) and confuse not their belief with Zulm (wrong i.e. by worshipping others besides Allah), for them (only) there is security and they are the guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe and have not confounded their belief with harm security belongs to them; and they are guided'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who believe, and do not obscure their faith with wrongdoing—those will have security, and they are guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They who believe and do not mix their belief with injustice - those will have security, and they are [rightly] guided.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:82] Those who believe and have not confounded, mixed, their belief with evildoing, that is, idolatry — explained as such by a hadīth in the two Sahīhs [of Bukhārī and Muslim] — theirs is security, from chastisement; and they are rightly guided.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "When they did not answer what Abraham asked them, He said: (Those who believe and obscure not their belief by wrong-doing) have not mixed their belief with idolatry, and are not hypocrites, (theirs is safety) from their Lord; (and they are rightly guided) to that which is right; it is also said that this means: those they are who have safety from punishment and are guided to the proof [of faith].\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلَّذِينَ آمَنُواْ } بتوحيد الله { وَ } بعدما آمنوا { لَمْ يَلْبِسُوۤاْ } أي: لم يخلطوا ولم يستروا { إِيمَانَهُمْ بِظُلْمٍ } أي: بخروجهم عن مقتضى الإيمان والتوحيد { أُوْلَـٰئِكَ } السعداء المقبولون عند الكله { لَهُمُ ٱلأَمْنُ } في مأمن التوحيد { وَهُمْ مُّهْتَدُونَ } [الأنعام: 82] مقصرون على الهداية لا خوف عليهم ولا هم يحزنون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أولئك لهم الأمن } في الآخرة\n { وهم مهتدون } في الدنيا\n أما الطائع فأمنه ظاهر\n وأما العاصي فيؤمن من الخلود وتحريم الجنة عليه\n ولمَّا نزلت الآية أشفق منها أصحاب رسول الله صلى الله عليه وسلم\n فقالوا: أينا لم يظلم نفسه؟ لأنهم فهموا عموم الظلم فقال رسول الله صلى الله عليه وسلم:\n \" ليس ما تظنون\n إنما هو ما قال لقمانُ لابنه: { يَا بُنَيَّ لاَ تُشْرِكْ بِاللهِ إَنَّ الشِرْكِ لَظُلْمٌ } [لقمَان:13] \" \nوقد كان المشركون يُقِرُّون بالصانع ويخلطون معه التصديق بربوية الأصنام\n فقد آمنوا بوجود الصانع\n ولكنهم لبسوا إيمانهم بالشرك\n فلا آمن لهم ولا هداية\n وبهذا يرد جهالة الزمخشري في إنكاره الحديث الصحيح\n ولو بقي الظلم على عمومه ـ أي: ولم يخلطوا إيمانه بمعصية ـ لصَحَّ\n ويكون المراد بالأمن أمنًا خاصًا وهداية خاصة\n لكن ما قاله ـ عليه الصلاة والسلام ـ يُوقف عنده\n الإشارة: العارف بالله\n المتحقق بوحدانية الله\n لا يسكن خوفْ الخلق في قلبه\n ولا ينظر إلا إلى ما يبرُز من عند ربه\n فإن وعدَه بالعصمة أو الحفظ لم يترك بذلك التضرعَ والالتجاء إلى ربه لسعة علمه تعالى\n وقد يكون ذلك متوقفًا على أسباب وشروط\n أخفاها الحق تعالى إظهارًا لقهريته\n ولذلك قال الخليل عليه السلام: { ولا أخاف ما تُشركون به إلا أن يشاء ربي شيئًا وسع ربي كل شيء علمًا }\n وقال سيدنا شعيب عليه السلام:\n[الأعراف:89]\n فالعارف لا يزول اضطرارهُ\n ولا يكون مع غير الله قراره\n وأما الأمن من التحويل والانقلاب\n فاختلف فيه فقال بعضهم: يحصُل للوليِّ الأمنُ\n إذا تحقق بمقام القُرب\n وحصل له الفناء والبقاء\n متمسكًا بقوله تعالى: { الَّذِين آمَنُوا وَلَم يَلبِسُوا إيمَانَهُم بِظُلمٍ أُولَئِكَ لَهُمُ الأمن }\n وقال بعضهم: لا يحصل الأمن إلا للأنبياء ـ عليهم السلام ـ للعصمة\n قال الورتجبي: مقام الأمن لا يحصل لأحد\n ما دام هو بوصف الحدثَية\n وكيف يكون آمنًا منه وهو في رِقِّ العبودية ويعرف نفسه بها\n ويعرف الحق بوصف القدم والبقاء وقهر الجبروت؟ وقال تعالى:\n[الأعراف:99]\n فإذا رأى الله تعالى بوصف المحبة والعشق والشوق\n وذاق طعم الدنو\n واتّصف بصفات الحق\n بدا له أوائل الأمن\n لأن في صفة القدم لا يكون علة الخوف والرجاء\n لأن هناك جنة القرب والوصال\n وهم فيها آمنون من طوارق القهر\n وهم مهتدون ما داموا متصفين بصفاته\n وإن كانوا في تسامح من مناقشة الله بدقائق خفايا مكره\n\nهـ\n فظاهر كلامه\n أن المتحقق بمقام الفناء والبقاء\n يحصل له الأمن من الشقاء\n وكذلك قال أبو المواهب: من رجع إلى البقاء أمِنَ من الشقاء\n وقال في نوادر الأصول: مَن حَظُّه من أهل التقريب: الجلال والجمال\n وقد أقيم في الهيبة والأنس\n قد غاب عن خوف العقوبة\n ولكنه يخاف التحويل والهُوِي والسقوط\n لِما رُكب في نفوس بني آدم من الشهوات\n فهن أبدًا يُهوِين بصاحبهن عن الله إلى الإخلاد والبُطء\n وإنما يسكن خوف التحويل إذا خلَص إلى الفردانية وتعلَّق بالوحدانية لتلاشِي الهوى منه والشهوة بكشف الغطاء\n ولا يذهب خوف ذلك بالكُلِّية عنه\n وإن سكن لبقاء خيال ذلك في حق غير الأنبياء\n وأما هُم فلم يبقَ لهم ظِلُّ الهوى\n فبُشِّروا بالنجاة فلَم تَغُرهم البُشرى لأنهم لم يبق لهم نفوس\n فتستبدّ وتجور إذا أمِنَت السقوط\n ومَن بعَدَهم بَقِي لهم في نفوسهم شيء فمُنعوا البشرى\n وأُبهم عليهم الأمر صنعًا بهم ونظرًا لهم\n لتكون نفوسهم منقمعة بخوف الزوال\n هـ\n هذا هو الأصل فافهمه\n هـ\n وحاصل كلامه: أن غير الأنبياء لا ينقطع عنه خوفُ التحويل\n بل يسكن خوفه فقط\n ولا يُبَشِّر بالأمن إلا الأنبياء\n وهو الصواب\n لبقاء قهر الربوبية فوق ضعف العبودية\n قال تعالى:\n[الأنعَام:18]\n والله تعالى أعلم\n ثم مدح خليله بما أظهر على يديه من الحُجة والعلم\n فقال: { وَتِلْكَ حُجَّتُنَآ آتَيْنَاهَآ إِبْرَاهِيمَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:10",
      "similarity": 0.7714816858792372
    },
    {
      "verse": "6:9",
      "similarity": 0.6946945661633823
    },
    {
      "verse": "2:42",
      "similarity": 0.5069893482000452
    },
    {
      "verse": "3:71",
      "similarity": 0.47546849635123994
    },
    {
      "verse": "21:80",
      "similarity": 0.3445479427552159
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/6:82.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/6:82.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:82.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}