{
  "chapter": "الأنعام",
  "text": "وتلك حجتنا ءاتينها ابرهيم على قومه نرفع درجت من نشاء ان ربك حكيم عليم",
  "translations": [
    {
      "translation": "This is the argument We gave to Ibrahim against his people. We raise in rank anyone We will. Your Lord is All-Wise, All-Knowing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the argument We gave to Abraham against his people. We exalt whosoever We please in rank by degrees. Your Lord is wise and all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was Our argument which We gave to Abraham against his people. We raise in ranks whom We will. Truly your lord is All-Wise, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such was the authoritative reasoning that We gave Abraham over his people. We raise whomever We want to a higher rank. Your Lord is All-wise and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is Our argument, which We gave Ibrahim against his people; We raise to high ranks whomever We will; indeed your Lord is Wise, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that was Our proof which We gave Ibrahim against his people. We in degrees raise whom We will. Certainly your Lord is All-Wise, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this was Our argument which we gave to Ibrahim against his people; We exalt in dignity whom We please; surely your Lord is Wise, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Our argument, which We bestowed upon Abraham as against his people. We raise up in degrees whom We will; surely thy Lord is All-wise, All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Our argument. We gave it unto Abraham against his folk. We raise unto degrees of wisdom whom We will. Lo! thy Lord is Wise, Aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the reasoning We gave to Abraham against his people, We raise in rank anyone We please, your Lord is wise and aware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this was Our argument which We vouchsafed unto Ibrahim against his people. We raise in degrees whomsoever We list; verily thy Lord is Wise, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This was Our argument that We gave to Abraham against his people. We raise in rank whomever We wish. Indeed your Lord is all-wise, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was the reasoning about Us, which We gave to Abraham (to use) against his people: We raise whom We will, degree after degree: for thy Lord is full of wisdom and knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that was Our Proof which We gave Ibrahim (Abraham) against his people. We raise whom We will in degrees. Certainly your Lord is All-Wise, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the argument that We gave Abraham against his nation. We raise whom We will to an exalted rank. Your Lord is Wise, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That was Our argument which We gave to Abraham against his people. We elevate by degrees whomever We will. Your Lord is Wise and Informed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that was Our [conclusive] argument which We gave Abraham against his people. We raise by degrees whom We will. Indeed, your Lord is Wise and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:83] That (tilka is the subject [of the sentence] and is substituted by [the following hujjatunā]) argument of Ours, with which Abraham inferred God’s Oneness, as in the case of the setting stars and what came afterwards; (the predicate is [what follows]) We bestowed upon Abraham, We guided him to it, as an argument, against his people. We raise up in degrees whom We will (read this as [a genitive] annexation, darajāti man nashā’, or as [accusative] nunation, darajātin man nashā’), [degrees] in knowledge and wisdom; surely your Lord is Wise, in His actions, Knowing, of His creation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That is Our argument. We gave it) We inspired it (unto Abraham against his folk. We raise unto degrees) merits, by bestowing upon him power, status, argument and the knowledge of Allah's divine Oneness (of wisdom whom We will) whoever is fit for it. (Lo! thy Lord is Wise) in inspiring His friend with clear arguments, (Aware) of the argument of His friends and of the punishment of His enemies.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَتِلْكَ } القصة التي سمعت { حُجَّتُنَآ } ودليل توحيدنا { ءَاتَيْنَٰهَآ إِبْرَٰهِيمَ } امتناناً له وإرشاداً\n ليغلب بها { عَلَىٰ قَوْمِهِ } ومن سنتنا أنَّا { نَرْفَعُ دَرَجَٰتٍ مَّن نَّشَآءُ } من عبادنا في العلم والحكمة والإيقان والمعرفة { إِنَّ رَبَّكَ } أيها المظهر الجامع { حَكِيمٌ } في رفع درجات بعض عباده { عَلِيمٌ } [الأنعام: 83] باستعداداتهم وقابلياتهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:15",
      "similarity": 0.5374747492898734
    },
    {
      "verse": "4:96",
      "similarity": 0.4684118717050894
    },
    {
      "verse": "6:165",
      "similarity": 0.4543940826309452
    },
    {
      "verse": "20:75",
      "similarity": 0.4534110746092908
    },
    {
      "verse": "3:163",
      "similarity": 0.44947822342124033
    }
  ]
}