{
  "chapter": "الأنعام",
  "text": "ذلك هدى الله يهدى به من يشاء من عباده ولو اشركوا۟ لحبط عنهم ما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "This is God's guidance: He gives among His creatures whom He will. If they had associated others with Him, surely vain would have been all they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Allah's guidance wherewith He guides those of His servants whom He wills. But if they ever associated others with Allah in His divinity, then all that they had done would have gone to waste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the guidance of God by which He guides whichever of His servants He wants. If people worship idols, their deeds will be turned devoid of all virtue.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the guidance of Allah, which He may give to whomever He wills among His bondmen; and had they ascribed partners (to Allah), their deeds would have been wasted.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the guidance of Allah with which He guides whomsoever He wills of His servants. But if they had joined in worship others with Allah, all that they used to do would have been of no benefit to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is Allah's guidance, He guides thereby whom He pleases of His servants; and if they had set up others (with Him), certainly what they did would have become ineffectual for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is God's guidance; He guides by it whom He will of His servants; had they been idolaters, it would have failed them, the things they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the guidance of Allah wherewith He guideth whom He will of His bondmen. But if they had set up (for worship) aught beside Him, (all) that they did would have been vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the guidance of God: He gives that guidance to whichever of His servants He pleases. If they had associated other deities with Him, surely all they did would have been of no avail.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the guidance of Allah whereby He guideth whomsoever of His bondmen He listeth. And if they had associated, to naught would have come all that they were wont to work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is Allah’s guidance: with it, He guides whomever He wishes of His servants. But were they to ascribe any partners [to Allah], what they used to do would not avail them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the guidance of Allah: He giveth that guidance to whom He pleaseth, of His worshippers. If they were to join other gods with Him, all that they did would be vain for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is the Guidance of Allah with which He guides whomsoever He will of His slaves. But if they had joined in worship others with Allah, all that they used to do would have been of no benefit to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is the guidance of Allah by it He guides whom He will of His worshipers. Had they associated (others with Him), their labors would have indeed been annulled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such is God’s guidance. He guides with it whomever He wills of His servants. Had they associated, their deeds would have gone in vain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is the guidance of Allah by which He guides whomever He wills of His servants. But if they had associated others with Allah, then worthless for them would be whatever they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:88] That, religion to which they were guided, is God’s guidance wherewith He guides whom He will of His servants; had they, hypothetically speaking, been idolaters, all that they did would have been in vain.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Such) the straight path (is the guidance of Allah) the religion of Allah (wherewith He guideth whom He will) whoever is fit for it (of His bondmen. But if they had set up (for worship) aught beside Him) had these prophets associated anyone or anything with Allah, ((all) that they did) of works (would have been vain).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ذٰلِكَ } أي: سبب تقرب هؤلاء الكرام { هُدَى ٱللَّهِ } أي: هدايته وعنايته تفضلاً عليهم وامتناناً { يَهْدِي بِهِ مَن يَشَآءُ مِنْ عِبَادِهِ } إرادة واختياراً { وَلَوْ أَشْرَكُواْ } بالله، هؤلاء المهديون بأن أثبتوا الوجود لغيره { لَحَبِطَ } واضمحل وضاع { عَنْهُمْ } ثواب { مَّا كَانُواْ يَعْمَلُونَ } [الأنعام: 88] من الخيرات والمبرات، وكانوا في حبوط الأعمال كسائر المشركين، نعتصم بك من إنزال قهرك يا ذا القوة المتين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ذلك هُدَى الله } أي: ذلك الدين الذي دانوا به هو هدى الله { يهدي به } أي: بسببه، { من يشاء من عباده ولو أشركوا لحبط عنهم ما كانوا يعملون } ، تحذيرًا من الشرك، وإن كانوا معصومين منه",
      "translations": []
    }
  ]
}