{
  "chapter": "الأنعام",
  "text": "او۟لئك الذين ءاتينهم الكتب والحكم والنبوة فان يكفر بها هؤلاء فقد وكلنا بها قوما ليسوا۟ بها بكفرين",
  "translations": [
    {
      "translation": "They are the ones to whom We gave the Book, Judgement and Prophethood. If these people reject it We have already entrusted it to a people who did not.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those were the people to whom We gave the Book and the Law and the Prophethood. But if they reject these things We shall entrust them to a people who will not deny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the ones to whom We gave the Book, and judgement and prophethood. And if they refuse to believe in it now, We will bestow this favour on a people who do believe in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These were the people to whom We gave the Book, Authority, and Prophesy. If some people do not accept Our guidance, it should not grieve you, (Muhammad), for We have made others who accept and protect Our guidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are the ones whom We gave the Book and the wisdom and the Prophethood; so if these people do not believe in it, We have then kept ready for it a nation who do not reject (the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those whom We gave the Book, Al-Hukm, and prophethood. But if they disbelieve therein, then, indeed We have entrusted it to a people who are not disbelievers therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These are they to whom We gave the book and the wisdom and the prophecy; therefore if these disbelieve in it We have already entrusted with it a people who are not disbelievers in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they to whom We gave the Book, the Judgment, the Prophethood; so if these disbelieve in it, We have already entrusted it to a people who do not disbelieve in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they unto whom We gave the Scripture and command and prophethood. But if these disbelieve therein, then indeed We shall entrust it to a people who will not be disbelievers therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the ones to whom We gave the Scripture, wisdom, and prophethood. If these people [the Makkans] reject it, We shall entrust it to a people who will never refuse to acknowledge it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they unto whom We vouchsafed the Book and judgement and prophethood. Wherefore if those disbelieve therein, We have surely entrusted its unto a people who are not disbelievers therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are the ones whom We gave the Book, judgement and prophethood. So if these disbelieve in them, We have certainly entrusted them to a people who will never disbelieve in them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These were the men to whom We gave the Book, and authority, and prophethood: if these (their descendants) reject them, Behold! We shall entrust their charge to a new people who reject them not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They are those whom We gave the Book, Al-Hukm (understanding of the religious laws), and Prophethood. But if these disbelieve therein (the Book, Al-Hukm and Prophethood), then, indeed We have entrusted it to a people (such as the Companions of Prophet Muhammad SAW) who are not disbelievers therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those, We have given them the Book, judgment, and prophethood. If these disbelieve it, We have entrusted it to others who do not disbelieve in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are they to whom We gave the Book, and wisdom, and prophethood. If these reject them, We have entrusted them to others who do not reject them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those are the ones to whom We gave the Scripture and authority and prophethood. But if the disbelievers deny it, then We have entrusted it to a people who are not therein disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:89] They are the ones to whom We gave the Scripture, meaning the Books [of God], judgement, wisdom, and prophethood; so if these, people of Mecca, disbelieve therein, that is, in these three, then indeed We have entrusted it to, We have set aside for it, a people who do not disbelieve in it, namely, the Emigrants (Muhājirūn) and the Helpers (Ansār).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those are they) We told you about of the prophets (unto whom We gave the Scripture) which Gabriel brought down from heaven (and command) knowledge and understanding (and prophethood. But if these) the people of Mecca (disbelieve therein) in their way and religion, (then indeed We shall entrust it to) We have given success to follow the way and religion of the prophets to (a people) in Medina (who will not be disbelievers therein) in the way and religion of the prophets.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَقَدْ وَكَّلْنَا بِهَا قَوْماً } معناهُ فَقدْ رَزَقْنَاهَا قَوماً\n\n",
      "translations": [
        {
          "translation": " And His saying, {So We have made it a heritage for a people} [means that] We have provided it for a people as sustenance.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أُوْلَـٰئِكَ } السعداء الأمناء { ٱلَّذِينَ آتَيْنَاهُمُ ٱلْكِتَابَ } الجامع المبين لهم طريق تهذيب الظاهر والباطن { وَٱلْحُكْمَ } الفارق بين الحق والباطل في والوقائع على مقتضى الحكمة الإلهية { وَٱلنُّبُوَّةَ } والرسالة المقتضية لأهداء التائهين في بيدان الغفلة والضلال إل طريق التوحيد { فَإِن يَكْفُرْ بِهَا هَـٰؤُلاۤءِ } المضلون من طريق الحق يعني قريشاً { فَقَدْ وَكَّلْنَا بِهَا } وبمراعاتها { قَوْماً لَّيْسُواْ بِهَا بِكَافِرِينَ } [الأنعام: 89] من أهل العناية والتوفيق\n\n\n{ أُوْلَـٰئِكَ } المذكورون من الأنبياء هم { ٱلَّذِينَ هَدَى ٱللَّهُ } إياهم إلى توحيده تفضلاً عليهم { فَبِهُدَاهُمُ ٱقْتَدِهْ } إذ مقصد أهل التوحيد واحد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والحُكم } أي: الحكمة\n أو الفصل بين العباد\n على ما يقتضيه الحق\n { والنبوة } الرسالة { فإن يكفر بها هؤلاء }: أهل مكة\n { فقد وكَّلنا بها } أي: بالإيمان بها والقيام بحقوقها\n { قومًا ليسوا بها بكافرين } وهُم الأنبياء المذكورون\n وتابعوهم\n وقيل: الصحابة المهاجرون والأنصار\n وهو الأظهر\n\nوقيل: كل مؤمن\n وقيل: الفرس\n والأول أرجح لدلالة ما بعده عليه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:66",
      "similarity": 0.6277253240433431
    },
    {
      "verse": "16:99",
      "similarity": 0.5068076345724543
    },
    {
      "verse": "95:8",
      "similarity": 0.45376301658473
    },
    {
      "verse": "64:13",
      "similarity": 0.42768328352709784
    },
    {
      "verse": "27:79",
      "similarity": 0.42386482086313404
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/6:89.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/6:89.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/6:89.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}