{
  "chapter": "الأنعام",
  "text": "وما قدروا۟ الله حق قدره اذ قالوا۟ ما انزل الله على بشر من شىء قل من انزل الكتب الذى جاء به موسى نورا وهدى للناس تجعلونه قراطيس تبدونها وتخفون كثيرا وعلمتم ما لم تعلموا۟ انتم ولا ءاباؤكم قل الله ثم ذرهم فى خوضهم يلعبون",
  "translations": [
    {
      "translation": "They do not measure Allah with His true measure when they say, 'Allah would not send down anything to a mere human being.' Say: 'Who, then, sent down the Book which Musa brought as a Light and Guidance for the people?' You put it down on sheets of paper to display it while concealing much. You were taught things you did not know, neither you nor your forefathers. Say: 'Allah!' Then leave them engrossed in playing their games.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they failed to make a just estimation of God when they said: \"He did not reveal to any man any thing.\" Ask them: \"Who then revealed the Book that Moses brought, -- a guidance and light for men, -- which you treat as sheafs of paper, which you display, yet conceal a great deal, though through it you were taught things you did not know before, nor even your fathers knew?\" Say: \"God,\" and leave them to the sport of engaging in vain discourse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They did not form any proper estimate of Allah when they said: 'Allah has not revealed anything to any man.' Ask them: 'The Book which Moses brought as a light and guidance for men and which you keep in bits and scraps, some of which you disclose while the rest you conceal, even though through it you were taught that which neither you nor your forefathers knew -who was it who revealed it?' Say: 'Allah!'- and then leave them to sport with their argumentation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have no true respect of God when they say, \"God has not sent anything to a mortal being.\" (Muhammad), tell them, \"Who revealed the Book containing a light and guidance for the people which Moses brought? You wrote down only some parts of the original on paper and hid much, even after having learnt from it, that which neither you nor your fathers knew.\" Tell them, \"God has (revealed the Quran),\" and then leave them alone to pursue their useless investigations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they (the Jews) did not realise (or appreciate) the importance of Allah as was required when they said, “Allah has not sent down anything upon any human being”; say, “Who has sent down the Book which Moosa brought, a light and guidance for mankind, which you have divided into different papers, some which you show and hide most of them? And (by which) you are taught what you did not know nor did your forefathers?” Say, “Allah” – then leave them playing in their indecency.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They did not estimate Allah with an estimation due to Him when they said: \"Nothing did Allah send down to any human being (by inspiration).\" Say: \"Who then sent down the Book which Musa brought, a light and a guidance to mankind which you (the Jews) have made into (separate) papersheets, disclosing (some of it) and concealing much. And you were taught that which neither you nor your fathers knew.\" Say: \"Allah (sent it down).\" Then leave them to play in their vain discussions.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they do not assign to Allah the attributes due to Him when they say: Allah has not revealed anything to a mortal. Say: Who revealed the Book which Musa brought, a light and a guidance to men, which you make into scattered writings which you show while you conceal much? And you were taught what you did not know, (neither) you nor your fathers. Say: Allah then leave them sporting in their vain discourses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They measured not God with His true measure when they said, 'God has not sent down aught on any mortal.' Say: 'Who sent down the Book that Moses brought as a light and a guidance to men? You put it into parchments, revealing them, and hiding much; and you were taught that you knew not, you and your fathers.' Say: 'God.' Then leave them alone, playing their game of plunging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they measure not the power of Allah its true measure when they say: Allah hath naught revealed unto a human being. Say (unto the Jews who speak thus): Who revealed the Book which Moses brought, a light and guidance for mankind, which ye have put on parchments which ye show, but ye hide much (thereof), and (by which) ye were taught that which ye knew not yourselves nor (did) your fathers (know it)? Say: Allah. Then leave them to their play of cavilling.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not make a just estimate of God, when they say, \"God has not revealed anything to any human being.\" Say, \"Who revealed the Book which Moses brought, a light and guidance for the people, which you made into separate sheets, showing some but hiding many? You have been taught things that neither you nor your forefathers had known before.\" Say, \"God has sent it;\" then leave them toying away with their speculation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they estimated not Allah with an estimation due unto Him when they said: on no human being hath God sent down aught. Say thou: who sent down the Books wherewith Musa came, a light and a guidance unto mankind, which ye have made into separate parchments. Some of it ye disclose and much thereof ye conceal. And ye were taught that which ye knew not: neither ye nor your fathers. Say thou: Allah, and let them alone, sporting in their vain discourse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They did not regard Allah with the regard due to Him when they said, ‘Allah has not sent down anything to any human.’ Say, ‘Who had sent down the Book that was brought by Moses as a light and guidance for the people, which you make into parchments that you display, while you conceal much of it, and [by means of which] you were taught what you did not know, [neither] you nor your fathers?’ Say, ‘Allah!’ Then leave them to play around in their impious gossip.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No just estimate of Allah do they make when they say: \"Nothing doth Allah send down to man (by way of revelation)\" Say: \"Who then sent down the Book which Moses brought?- a light and guidance to man: But ye make it into (separate) sheets for show, while ye conceal much (of its contents): therein were ye taught that which ye knew not- neither ye nor your fathers.\" Say: \"Allah (sent it down)\": Then leave them to plunge in vain discourse and trifling.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (the Jews, Quraish pagans, idolaters, etc.) did not estimate Allah with an estimation due to Him when they said: \"Nothing did Allah send down to any human being (by inspiration).\" Say (O Muhammad SAW): \"Who then sent down the Book which Musa (Moses) brought, a light and a guidance to mankind which you (the Jews) have made into (separate) papersheets, disclosing (some of it) and concealing (much). And you (believers in Allah and His Messenger Muhammad SAW), were taught (through the Quran) that which neither you nor your fathers knew.\" Say: \"Allah (sent it down).\" Then leave them to play in their vain discussions. (Tafsir Al-Qurtubi, Vol. 7, Page 37).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They have not valued Allah with His true value, when they said 'Allah has never sent down anything to a mortal' Say: 'Who, then sent down the Book which Moses brought, a light and guidance for people? You put it on to parchments, revealing them and hiding much, you have now been taught what neither you nor your fathers knew before' Say: 'Allah' Then leave them, playing in their plunging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They do not value God as He should be valued, when they say, “God did not reveal anything to any human being.” Say, “Who revealed the Scripture which Moses brought—a light and guidance for humanity?” You put it on scrolls, displaying them, yet concealing much. And you were taught what you did not know—neither you, nor your ancestors. Say, “God;” then leave them toying away in their speculation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they did not appraise Allah with true appraisal when they said, \"Allah did not reveal to a human being anything.\" Say, \"Who revealed the Scripture that Moses brought as light and guidance to the people? You [Jews] make it into pages, disclosing [some of] it and concealing much. And you were taught that which you knew not - neither you nor your fathers.\" Say, \"Allah [revealed it].\" Then leave them in their [empty] discourse, amusing themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:91] They, that is, the Jews, measured not God with His true measure, that is, they have not extended Him the grandeur that truly befits Him, or [it means] they have not attained the true knowledge of Him, when they said, to the Prophet (s), disputing with him about the Qur’ān: ‘God has not revealed anything to any mortal.’ Say, to them: ‘Who revealed the Book which Moses brought, a light and guidance for mankind? You put it (in all three instances [the verbs may be] read either in the third person plural [yaj‘alūnahu, ‘they put it’; yubdūnahā, ‘they reveal it’; wa-yukhfūna, ‘and they hide’] or in the second person plural [taj‘alūnahu, ‘you put it’; tubdūnahā, ‘you reveal it’; wa-tukhfūna, ‘and you hide’]) on parchments, that is, you write it down on fragments of notes, which you disclose, that is, what you choose to disclose thereof, but you hide much, of what is in them, as in [the case of] the descriptions of Muhammad (s); and you have been taught, O Jews, in the Qur’ān, what you did not know, neither you nor your fathers’, in the Torah, through the elucidation therein of what you were confused about and in disagreement over. Say: ‘God’, revealed it — and if they do not say it, there is no other response — then leave them to play in their discourse, their falsehood.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they measure not the power of Allah its true measure) they do not glorify Allah as He should be glorified (when they say: Allah hath naught) no Scripture (revealed unto a human being) among the prophets. This verse was revealed about Malik Ibn al-Sayf, the Jew, who claimed that Allah did not reveal any Scripture to human beings. (Say) Muhammad, to Malik: (Who revealed the Book which Moses brought, a light) an exposition and enlightenment (and guidance for mankind) from error, (which ye have put) written (on parchments which ye show) many things which do not contain the traits and description of the Prophet (pbuh) (but ye hide much (thereof)) you hide many portions of it which contain the traits and description of Muhammad (pbuh) (and by which ye were taught) of legal rulings, punishment, the lawful and the unlawful as well as the traits and description of Muhammad (pbuh) in the Scripture (that which ye knew not yourselves nor (did) your fathers (know it)) before the revelation of legal rulings and punishments? If they answer and say it was Allah, then fine, if they do not, (Say: Allah) revealed it. (Then leave them to their play of cavilling) let them indulge in their falsehood: quibbling and lying.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَا قَدَرُواْ ٱللَّهَ حَقَّ قَدْرِهِ } معناهُ مَا عَرَفوا الله حَقَّ مَعْرِفَتِهِ وَلاَ عَظَّمُوهُ حَقَّ عَظَمتِهِ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, the Most High, {And they have not honored Allah with the honor due to Him} means they did not know Allah with the knowledge due to Him nor did they magnify Him with the magnification due to Him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } القوم الذين أنكروا بعثتك وكذبوا موعظتك { مَا قَدَرُواْ ٱللَّهَ حَقَّ قَدْرِهِ } أي: ما عرفوا ظهوره في الآفاق واستقلاقه بالتصرف فيها { إِذْ قَالُواْ مَآ أَنزَلَ ٱللَّهُ عَلَىٰ بَشَرٍ مِّن شَيْءٍ قُلْ } لهم تبكيتاً وإلزاماً: { مَنْ أَنزَلَ ٱلْكِتَٰبَ } أي: التوراة { ٱلَّذِي جَآءَ بِهِ مُوسَىٰ } من عند ربه وكان { نُوراً وَهُدًى لِّلنَّاسِ } يستنيرون ويستكشفون منه\n ويهتدون به إلى توحيد الله مع أنكم { تَجْعَلُونَهُ قَرَاطِيسَ } وكانت ألواحاً { تُبْدُونَهَا } أي: تظهرون منها ما يصلح لكم ويعين على مدعاكم { وَتُخْفُونَ كَثِيراً } مما لايصلحكم عناداً ومكابرة { وَ } كيف تنكرون إنزاله\n إذ { عُلِّمْتُمْ } منه { مَّا لَمْ تَعْلَمُوۤاْ أَنتُمْ وَلاَ ءَابَآؤُكُمْ } من الأمور المتعلقة بالظاهر وبالباطن { قُلِ } يا أكمل الرسل في الجواب بعدما بهتوا: { ٱللَّهُ } إذ هو المتعين للجواب ولا شيء غيره { ثُمَّ ذَرْهُمْ فِي خَوْضِهِمْ } أباطيلهم وأراجيفهم { يَلْعَبُونَ } [الأنعام: 91] يترددون فلا عليك بعد التبليغ والتكبيت\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلَ جلاله: في الرد على اليهود: { وما قدروا الله حق قدره } أي: ما عَرفُوه حق معرفته في الرحمة والإنعام على العباد بالوحي وغيره، إذ لو عرفوه لَهابُوا أن يُنكروا بعثة الرسل، أو ما جَسَرُوا على هذه المقالة، أو ما عظموه حق تعظيمه. حيث كذَّبوا رسله وأنكروا أن يكون أنزل عليهم كتابًا، إذ لو عظِّموه حق تعظيمه لصدَّقوا الرسول الوارد عنه، وهو معنى قوله: { إذ قالوا ما أنزل الله على بَشَرٍ من شيء } ، والقائلون هم اليهود، كفنحاص ومالك بن الصيف وغيرهما، قالوا ذلك مبالغة في إنكار إنزال القرآن ونبوة محمد صلى الله عليه وسلم، فردَّ الله عليهم بما لا بدَّ لهم من الإقرار به وهو إنزال التوراة على موسى فقال: { قل من أنزل الكتاب الذي جاء به موسى نورًا وهُدًى للناس } ، فالنور للبواطن، والهداية للظواهر، { تجعلونه } أي: التوارة، { قراطيسَ } أي: تُجَزِّؤُونه أجزاء متفرقة، ما وافقَ أهواءكم أظهرتموه وكتبتموه في ورقات متفرقة، وما خالف أهواءكم كتمتموه وأخفيتموه. رُوِي أنَّ مَالك بنَ الصَّيفِ قاله، لَمّا أغضَبَهُ النبي صلى الله عليه وسلم بقوله:\n \" أُنشدُكُ الله الذي أنزَلَ التَّورَاة عَلَى مُوسَى، هَل تجِد فيها أنَّ الله يبغضَ الحَبرَ السَّمِين، فَأنتَ الحَبرُ السّمِين \" \n، فغَضب، وقال: ما أنزَلَ الله علَى بَشَرٍ مِن شَيء، فَرَّدّ الله عَلَيهِ بِما تقَّدم. وقيل: القائلون ذلك: المشركون، وإلزامهُم بإنزال التوراة لأنه كان مشهورًا عندهم يُقِرُّون به، ولذلك قالوا:\n[الأنعَام:157]. { وعُلِّمتُم } على لسان محمد صلى الله عليه وسلم { ما لم تعلموا أنتم ولا آباؤكم } ، زيادة على ما في التوراة وبيانًا لما التبس عليكم وعلى آبائكم الذين كانوا أعلم منكم. ونظيرهُ:\n[النَّمل:76] أو: وعُلِّمتم من التوراة ما لم تكونوا تعلَّمتم أنتم ولا آباؤكم قبل إنزاله، وإن كان الخطاب لقريش فالذي عُلِّموه: ما سمعوا من النبي صلى الله عليه وسلم من القَصص والأخبار. ثم أجاب عن استفهامه بقوله: { قُل اللهُ } أي: أنزلَه الله، أو الله أنزله. قال البيضاوي: أمره بأن يجيب عنهم إشعارًا بأن الجواب بهذا مُتَعيّن لا يمكن غيرُه، وتنبيهًا على أنهم بُهتُوا بأنهم لا يقدرون على الجواب هـ. { ثم ذَرهُم في خوضهم يلعبون } في أباطيلهم. فلا عليك بعد التبليغ وإلزام الحجة، وأصلُ الخَوض في الماء، ثم أستُعير للمعاني المُشكِلة، وللقلوب المتفرقة في أودية الخواطر. الإشارة: يُفهَم من الآية أنَّ من أقَرَّ بإنزال الكتب وآمن بجميع الرسل، فقد قَدَر الله حق قدره وعظَّمه حق تعظيمه. وهذا باعتبار ضعف العبد وعجزه وجهله وإلاَّ فتعظيم الحق حق تعظيمه، ومعرفته حق معرفته، لا يمكن انتهاؤها، ولا الوصول إلى عشر العشر منها.\nقال تعالى\n[طه:110]، وقال:\n[عَبَسَ:23] فلو بقي العبد يترقى في المعرفة أبدًا سرمدًا، ما عرف الله حق معرفته، حتى ينتهي إلى غايتها، ولو بقي يعبد أبد الأبد ما قام بواجب حقه. وقوله تعالى: { قل الله } استشهد به الصوفيةُ، في طريق الإشارة، على الانفراد والانقطاع إلى الله، وعدم الالفتات إلى ما عليه الناس من الخوض والاشتغال بالأغيار والأكدار، والخروج عنهم إلى مقام الصفا، وهو شهود الفردانية، والعكوف في أسرار الوحدانية. قال ابن عطاء الله ـ لما تكلم على أهل الشهود ـ قال: لأنهم لله لا لشيء دونه، { قل الله ثم ذرهم في خوضهم يلعبون } . وقد يُنكِر عليهم من لم يفهم إشارتهم، تجمدًا ووقوفًا مع الظاهر، وللقرآن ظاهر وباطن لا يعرفه إلا الربانيون. نفعنا الله بهم، آمين. ثم قرر صحة إنزال كتابه به، فقال: { وَهَـٰذَا كِتَابٌ أَنزَلْنَاهُ مُبَارَكٌ مُّصَدِّقُ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:7",
      "similarity": 0.6414326813923792
    },
    {
      "verse": "43:83",
      "similarity": 0.3522037879034067
    },
    {
      "verse": "70:42",
      "similarity": 0.3522037879034067
    },
    {
      "verse": "52:12",
      "similarity": 0.3237053715255738
    },
    {
      "verse": "9:65",
      "similarity": 0.3098169536709892
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/6:91.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/6:91.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:91.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}