{
  "chapter": "الأنعام",
  "text": "وهذا كتب انزلنه مبارك مصدق الذى بين يديه ولتنذر ام القرى ومن حولها والذين يؤمنون بالءاخرة يؤمنون به وهم على صلاتهم يحافظون",
  "translations": [
    {
      "translation": "This is a Book We have sent down and blessed, confirming what came before it, so that you can warn the salat.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this (Qur'an) is another Book that We have revealed, blessed, affirming the earlier (revelations), so that you may warn the people of (Makkah) the town of towns, and those who live around it. Those who believe in the life to come shall believe in it and be watchful of their moral obligations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Like that Book) this too is a Book which We have revealed; full of blessing, confirming what was revealed before it so that you might warn the people of the Mother of Cities (Makka) and those around it. Those who believe in the Hereafter believe in it, and are evermindful of their Prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have blessed this Book (the Quran) and revealed it to confirm that which was revealed to the Prophets who lived before you and to warn the people of the mother land (Mecca) and those living around it. Those who believe in the Day of Judgment accept this and are steadfast in their prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is the blessed Book which We have sent down, confirming the Books preceding it, and in order that you may warn the leader of all villages and all those around it in the entire world; and those who believe in the Hereafter accept faith in this Book, and guard their prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is a blessed Book which We have sent down, confirming what came before it, so that you may warn the Mother of Towns and all those around it. Those who believe in the Hereafter believe in it, and they are constant in guarding their Salah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is a Book We have revealed, blessed, verifying that which is before it, and that you may warn the metropolis and those around her; and those who believe in the hereafter believe in it, and they attend to their prayers constantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a Book We have sent down, blessed and confirming that which was before it, and for thee to warn the Mother of Cities and those about her; and those who believe in the world to come believe in it, and watch over their prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is a blessed Scripture which We have revealed, confirming that which (was revealed) before it, that thou mayst warn the Mother of Villages and those around her. Those who believe in the Hereafter believe herein, and they are careful of their worship.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a blessed Book which We have revealed, confirming what came before it, so that you may warn the Mother of Cities [Makkah] and the people around it. Those who believe in the Hereafter do believe in it, and they are ever-mindful of their prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is a Book We have sent down, blest, and confirming that which hath been before it. And it is sent that thou mayest warn thereby the mother of towns and those around it. And those who believe in the Hereafter believe in it, and they guard their prayer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Blessed is this Book, which We have sent down, confirming what was [revealed] before it, so that you may warn the Mother of Cities and those around it. Those who believe in the Hereafter believe in it, and they are watchful of their prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is a Book which We have sent down, bringing blessings, and confirming (the revelations) which came before it: that thou mayest warn the mother of cities and all around her. Those who believe in the Hereafter believe in this (Book), and they are constant in guarding their prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this (the Quran) is a blessed Book which We have sent down, confirming (the revelations) which came before it, so that you may warn the Mother of Towns (i.e. Makkah) and all those around it. Those who believe in the Hereafter believe in (the Quran), and they are constant in guarding their Salat (prayers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is a Blessed Book which We have sent down, confirming what came before it, in order that you warn the Mother of the Villages (Mecca) and those who (live) around it. Those who believe in the Everlasting Life believe in it and preserve their prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This too is a Scripture that We revealed—blessed—verifying what preceded it, that you may warn the Mother of Cities and all around it. Those who believe in the Hereafter believe in it, and are dedicated to their prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is a Book which We have sent down, blessed and confirming what was before it, that you may warn the Mother of Cities and those around it. Those who believe in the Hereafter believe in it, and they are maintaining their prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:92] And this, Qur’ān, is a blessed Book We have revealed, confirming that which was before it, of scriptures, and that you may warn (li-tundhira, or read li-yundhira, ‘that it may warn’, as supplement to the import of the preceding statement [sc. ‘to confirm that which was before it and to warn’]), in other words, We have revealed it for [the] blessings [it gives], as a vindication [of previous scripture] and for you to warn therewith, the Mother of Towns and those around it, that is, the inhabitants of Mecca and all other people; and those who believe in the Hereafter believe in it, and they observe their prayers, fearing the punishment thereof.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And this) i.e. the Qur'an (is a blessed Scripture) contains mercy and forgiveness for him who believes in it (which We have revealed) which Gabriel brought down, (confirming that which (was revealed) before it) agreeing with the Torah, the Gospel, the Psalms and with all earlier Scriptures as regard Allah's divine Oneness and the traits and description of Muhammad (pbuh) (that thou mayst warn) by means of the Qur'an (the Mother of Villages) i.e. the people of Mecca; it is also said that (the Mother of Villages) means: the largest of villages; it is also said that it was called (the Mother of Villages) because the earth was 144 levelled from beneath it (and those around her) of the rest of lands. (Those who believe in the Hereafter) those who believe in resurrection after death and in the bliss of Paradise (believe herein) believe in Muhammad and the Qur'an, (and they are careful of their worship) and they observe the appointed time for the five daily prayers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { وَهَـٰذَا كِتَٰبٌ } جامع لما في الكتب السالفة على أبلغ وجه وآكده مع زيادات شريفة { أَنزَلْنَٰهُ } إليك يا أكمل الرسل { مُبَارَكٌ } كثير الخير والبركة لك ولمن تبعك { مُّصَدِّقُ } للكتاب { ٱلَّذِي } أحكامه { بَيْنَ يَدَيْهِ } أي: التوراة والإنجيل وجميع الكتف النازلة من عند الله، وإنما أنزلناه { وَلِتُنذِرَ } به { أُمَّ ٱلْقُرَىٰ } أي: أهل مكة { وَمَنْ حَوْلَهَا } أي: جميع أقطار الأرض؛ إذ دُحيت الأرضْ من تحتها على ما قيل لذلك صار قبلة لجميع أهل الأرض، وفرض حجها وطوافها { وَٱلَّذِينَ يُؤْمِنُونَ بِٱلأَخِرَةِ } من أهل الكتاب { يُؤْمِنُونَ بِهِ } أي: بالقرآن { وَ } سبب إيمانهم أنه { هُمْ عَلَىٰ صَلاَتِهِمْ يُحَافِظُونَ } [الأنعام: 92] أي: يراقبون ويداومون على الميل والتوجه نحو الحق بجميع شؤونه وتجلياته، ومن جملتها بل من أجلها: إنزال القرآن البالغ على درجات اليقين في تبيين أحوال النشأة الأولى والأخرى، إذ هو منتخب منهما على وجه يعجز عنه أرباب اللسن من البشر، ومن له أدنى مسكنة من ذوي العقول لا بدَّ أن يؤمن به وبإعجازه إلا من أضله الله وختم على قلبه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "27:8",
      "similarity": 0.47179817534478513
    },
    {
      "verse": "46:27",
      "similarity": 0.38151306906623406
    },
    {
      "verse": "25:1",
      "similarity": 0.37177348470147137
    },
    {
      "verse": "44:3",
      "similarity": 0.3671745674198178
    },
    {
      "verse": "67:1",
      "similarity": 0.3552223421795489
    }
  ]
}