{
  "chapter": "الأنعام",
  "text": "ومن اظلم ممن افترى على الله كذبا او قال اوحى الى ولم يوح اليه شىء ومن قال سانزل مثل ما انزل الله ولو ترى اذ الظلمون فى غمرت الموت والملئكة باسطوا۟ ايديهم اخرجوا۟ انفسكم اليوم تجزون عذاب الهون بما كنتم تقولون على الله غير الحق وكنتم عن ءايته تستكبرون",
  "translations": [
    {
      "translation": "Who could do greater wrong than someone who invents lies against Allah or who says, 'It has been revealed to me,' when nothing has been revealed to him, or someone who says, 'I will send down the same as Allah has sent down'? If you could only see the wrongdoers in the throes of death when the angels are stretching out their hands, saying, 'Disgorge your own selves! Today you will be repaid with the punishment of humiliation for saying something other than the truth about Allah, and being arrogant about His Signs.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more vile than he who slanders God of falsehood, or says: \"Revelation came to me,\" when no such revelation came to him; or one who claims: \"I can reveal the like of what has been sent down by God?\" If you could see the evil creatures in the agony of death with the angels thrusting forward their hands (saying): \"Yield up your souls: This day you will suffer ignominious punishment for uttering lies about God and rejecting His signs with arrogance.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who can be more unjust than he who places a lie on Allah and who says: 'Revelation has come to me' when in fact nothing was revealed to him, and who says: 'I will produce the like of what Allah has revealed?' If you could but see the wrongdoers in the agonies of death, and the angels stretching out their hands (saying): 'Yield up your souls! Today you will be recompensed with the chastisement of humiliation for the lie you spoke concerning Allah, and for you waxing proud against His signs.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who are more unjust than those who ascribe lies to God or say that God has sent them revelations when nothing has been sent to them, or those who say that they can also bring down (from heaven) a book like that which God has revealed? Would that you could see the unjust in the agonies of death when the angels will come forward with their hands outstretched to take their souls out of their bodies and say, \"This is the day when you will face humiliating torment for the falsehood that you ascribed to God and for your contemptuously disregarding of His revelations.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more unjust than one who fabricates lies against Allah or says, “I have received divine inspiration”, whereas he has not been inspired at all – and one who says, “I will now reveal something similar to what Allah has sent down”? And if you see when the unjust are in the throes of death and the angels are with their hands outstretched; (saying) “Surrender your souls; this day you shall be given a disgraceful punishment – the recompense of your fabricating lies against Allah, and your scorning His signs.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who can be more unjust than he who invents a lie against Allah, or says: \"I have received inspiration,\" whereas he is not inspired in anything; and who says, \"I will reveal the like of what Allah has revealed.\" And if you could but see when the wrongdoers are in the agonies of death, while the angels are stretching forth their hands (saying): \"Deliver your souls! This day you shall be recompensed with the torment of degradation because of what you used to utter against Allah other than the truth. And you used to reject His Ayat with disrespect!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than he who forges a lie against Allah, or says: It has been revealed to me; while nothing has been revealed to him, and he who says: I can reveal the like of what Allah has revealed? and if you had seen when the unjust shall be in the agonies of death and the angels shall spread forth their hands: Give up your souls; today shall you be recompensed with an ignominious chastisement because you spoke against Allah other than the truth and (because) you showed pride against His communications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does greater evil than he who forges against God a lie, or says,, 'To me it has been revealed', when naught has been revealed to him, or he who says, 'I will send down the like of what God has sent down'? If thou couldst only see when the evildoers are in the agonies of death, and the angels are stretching out their hands: 'Give up your souls! Today you shall be recompensed with the chastisement of humiliation for what you said untruly about God, waxing proud against His signs.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is guilty of more wrong than he who forgeth a lie against Allah, or saith: I am inspired, when he is not inspired in aught; and who saith: I will reveal the like of that which Allah hath revealed? If thou couldst see, when the wrong-doers reach the pangs of death and the angels stretch their hands out (saying): Deliver up your souls. This day ye are awarded doom of degradation for that ye spake concerning Allah other than the truth, and used to scorn His portents.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who could do greater wrong than someone who invents a lie against God or who says, \"It has been revealed to me,\" while nothing has been revealed to him, or someone who says, \"I will send down the like of what God has sent down\"? If you could only see the wrongdoers in the throes of death when the angels are stretching out their hands, saying, \"Give up your souls. Today you will be repaid with a humiliating punishment for saying false things about God and being arrogant about His signs.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is a greater wrong-doer than one who fabricateth a lie against Allah, or saith: a Revelation hath came to me, whereas no Revelation hath come to him in aught, and one who saith: I shall send down the like of that which God hath sent down? Would that thou souldst see what time the wrong-doers are in the pangs of death while the angels are stretching forth their hands saying: yield up your souls; to-day ye will be awarded a torment of ignomity for that which ye have been saying of Allah other than the truth, and against His signs ye were wont to be stiff-necked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is a greater wrongdoer than him who fabricates a lie against Allah, or says, ‘It has been revealed to me,’ while nothing was revealed to him, and he who says, ‘I will bring the like of what Allah has sent down?’ Were you to see when the wrongdoers are in the throes of death, and the angels extend their hands [saying]: ‘Give up your souls! Today you shall be requited with a humiliating punishment because of what you used to attribute to Allah untruly, and for your being disdainful towards His signs.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who can be more wicked than one who inventeth a lie against Allah, or saith, \"I have received inspiration,\" when he hath received none, or (again) who saith, \"I can reveal the like of what Allah hath revealed\"? If thou couldst but see how the wicked (do fare) in the flood of confusion at death! - the angels stretch forth their hands, (saying),\"Yield up your souls: this day shall ye receive your reward,- a penalty of shame, for that ye used to tell lies against Allah, and scornfully to reject of His signs!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who can be more unjust than he who invents a lie against Allah, or says: \"I have received inspiration,\" whereas he is not inspired in anything; and who says, \"I will reveal the like of what Allah has revealed.\" And if you could but see when the Zalimun (polytheists and wrong-doers, etc.) are in the agonies of death, while the angels are stretching forth their hands (saying): \"Deliver your souls! This day you shall be recompensed with the torment of degradation because of what you used to utter against Allah other than the truth. And you used to reject His Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) with disrespect!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more harmful than he who invents a lie about Allah, or says: \"It has been revealed to me,\" when nothing has been revealed to him? Or he who says: 'I will send down the like of what Allah has sent down' Would that you could see the harmdoers when death overwhelms them! With hands outstretched, the angels (will say): 'Yield up your souls. You shall be recompensed with a humiliating punishment this Day, for you have said of Allah what is untrue and you grew proud against His verses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who does greater wrong than someone who invents falsehood against God, or says, “It was revealed to me,” when nothing was revealed to him, or says, “I will reveal the like of what God revealed”? If only you could see the wrongdoers in the floods of death, as the angels with arms outstretched: “Give up your souls. Today you are being repaid with the torment of shame for having said about God other than the truth, and for being too proud to accept His revelations.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than one who invents a lie about Allah or says, \"It has been inspired to me,\" while nothing has been inspired to him, and one who says, \"I will reveal [something] like what Allah revealed.\" And if you could but see when the wrongdoers are in the overwhelming pangs of death while the angels extend their hands, [saying], \"Discharge your souls! Today you will be awarded the punishment of [extreme] humiliation for what you used to say against Allah other than the truth and [that] you were, toward His verses, being arrogant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:93] And who, that is, none, does greater evil than he who invents lies against God, by claiming prophethood when he has not been called to it, or who says, ‘It is revealed to me’, when nothing has been revealed to him — this was revealed regarding [the false prophet] Musaylama [al-Kadhdhāb] — or he who says, ‘I will reveal the like of what God has revealed’? — these were the mockers who would say: If we wish we can speak the like of this [Q. 8:31]; If you could only see, O Muhammad (s), when the, mentioned, evildoers are in the agonies, the throes, of death and the angels extend their hands, against them, beating and torturing them, saying to them in stern censure: ‘Give up your souls!, to us that we may seize them. Today you shall be requited with the chastisement of humiliation because you used to say about God other than the truth, of claiming prophethood and inspiration falsely, and that you used to scorn His signs’, disdaining to believe in them. The response to the conditional [statement beginning with] law, ‘if [you could only see]’, is: ‘you would be seeing a terrifying thing’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who is guilty) who is more tyrannical and more daring (of more wrong than he who forgeth a lie against Allah, or saith) Allah did not reveal anything, this is Malik Ibn al-Sayf, or him who says: (I am inspired) with a Scripture, (when he is not inspired in aught) with any Scripture, this is Musaylimah, the liar; (and who saith: I will reveal the like of that which Allah hath revealed) I will say the like of what Muhammad (pbuh) is saying: this is 'Abdullah Ibn Sa'd Ibn Abi Sarh. (If thou couldst see) Muhammad, (when the wrong-doers) the idolaters and the hypocrites, on the Day of Badr (reach the pangs of death and the angels stretch their hands out) to take out their souls, (saying: Deliver up your souls) your spirits. (This day) the Day of Badr, as it is said it is the Day of Judgement (ye are awarded doom of degradation) a severe doom (for that ye spake concerning Allah other than the Truth, and scorned) you thought yourselves too great to believe in Muhammad (pbuh) and the Qur'an, (His portents) Muhammad (pbuh) and the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تُجْزَوْنَ عَذَابَ ٱلْهُونِ } معناه الهَوَانُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ومن أظلم ممن افترى على الله كَذِباً } بادّعاء الكمال والوصول إلى التوحيد والخلاص عن كثرة صفات النفس وازدحامها مع بقائها فيه فيكون في أقواله وأفعاله بالنفس وهو يدعي أنه بالله { أو قال أوحي إليّ ولم يوح إليه شيء } أي: حسب مفتريات وهمه وخياله ومخترعات عقله وفكره وحياً من عند الله وفيضاً من الروح القدسي فتنبأ { ومن قال سأنزل مثل ما أنزل الله } أي: تفرعن بوجود أنائيته وتوهم التوحيد العلمي عينياً، فادعى الإلهية { ولو ترى إذ الظالمون } أي: هؤلاء الظلمة من المدّعين للكمال المحجوبين الذين يزعمون كون أفعالهم إلهية وهي نفسانية والمتنبئين والمتفرعنين { في غمرات الموت } أي: شدائده وسكراته لافتقادهم في دعواهم وغلطهم في حسبانهم أنهم قد فنوا عن أنفسهم وتجرّدوا عن ملابس أبدانهم مع شدّة تعلقهم بها وقوة محبة الدنيا ورسوخ الهوى فيهم لأنهم ما ماتوا بالموت الإراديّ والتجرّد عن الشهوات واللذات البدنية، وما فنوا عن صفات نفوسهم ودواعيها حتى يسهل عليهم الموت الطبيعي { والملائكة } أي: قوى العالم التي كانت تمدّ قواهم النفسانية من النفوس الكوكبية والفلكية وتأثيراتها التي كانت تستولي عليهم في حياتهم مع ظنهم أنهم تخلصوا منها بالتجرّد كما أشرنا إليه { باسطو أيديهم } قوية التأثير فيهم، بالغة فيه كنه قواها وقدرها { أخرجوا أنفسكم } أي: تعنفهم وتقهرهم لشدّة تعكفهم وكثرة تحسرهم وصعوبة مفارقة الأبدان عليهم { اليوم تُجْزون عذاب الهون } والصغار بوجود صفات نفوسكم وهيآتها المظلمة المؤذية وحجب أنائيتكم وتفرعنكم كما قال:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَنْ أَظْلَمُ مِمَّنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ كَذِباً } بأن قال: بعثني الله نبياً كمسيلمة والأسود العنسي { أَوْ قَالَ أُوْحِيَ إِلَيَّ وَلَمْ يُوحَ إِلَيْهِ شَيْءٌ } كعبدالله بن أبي سرح { وَمَن قَالَ } من كفار قريش: { سَأُنزِلُ مِثْلَ مَآ أَنَزلَ ٱللَّهُ } ولو نشاء لقلنا مثل هذا { وَلَوْ تَرَىۤ } أيها الرائي { إِذِ ٱلظَّالِمُونَ } المفترون على الله المكذبون لكتبه ورسله { فِي غَمَرَاتِ ٱلْمَوْتِ } وسكراته وأهواله { وَٱلْمَلاۤئِكَةُ } قائمون عليهم { بَاسِطُوۤاْ أَيْدِيهِمْ } كالمتقاضي قائلين لهم: { أَخْرِجُوۤاْ أَنْفُسَكُمُ } أيها المفترون الكاذبون بأيديكم حتى تخلصوا عن أيدينا واعلموا أن { ٱلْيَوْمَ تُجْزَوْنَ عَذَابَ ٱلْهُونِ } المشتمل على الهوان والمذلة { بِمَا كُنتُمْ تَقُولُونَ عَلَى ٱللَّهِ غَيْرَ ٱلْحَقِّ وَكُنْتُمْ عَنْ آيَاتِهِ تَسْتَكْبِرُونَ } [الأنعام: 93] عتواً وعناداً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ]
}