{
  "chapter": "الأنعام",
  "text": "ان الله فالق الحب والنوى يخرج الحى من الميت ومخرج الميت من الحى ذلكم الله فانى تؤفكون",
  "translations": [
    {
      "translation": "Allah is He Who splits the seed and kernel. He brings forth the living from the dead, and produces the dead out of the living. That is Allah, so how are you perverted?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed it is God who splits up the seed and the kernel, and brings forth the living from the dead, the dead from the living. This is God: So whither do you stray?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly it is Allah Who causes the grain and the fruit-kernel to sprout. He brings forth the living from the dead and brings forth the dead from the living. Such is Allah. So whither are you tending in error?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who makes all kinds of seeds grow, brings forth the living from the dead, and the dead from the living. It is God who does such things, so how can you turn away from Him?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed it is Allah Who splits the grain and the seed; it is He Who brings forth living from the dead, and it is He Who brings forth dead from the living; such is Allah; so where are you reverting?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! It is Allah Who causes the seed grain and the fruit stone to split and sprout. He brings forth the living from the dead, and it is He Who brings forth the dead from the living. Such is Allah, then how are you deluded away from the truth\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely Allah causes the grain and the stone to germinate; He brings forth the living from the dead and He is the bringer forth of the dead from the living; that is Allah! how are you then turned away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who splits the grain and the date-stone, brings forth the living from the dead; He brings forth the dead too from the living. So that then is God; then how are you perverted?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Allah (it is) Who splitteth the grain of corn and the date-stone (for sprouting). He bringeth forth the living from the dead, and is the bringer-forth of the dead from the living. Such is Allah. How then are ye perverted?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who splits the seed and the fruit-stone. He brings forth the living from the dead, and the dead from the living. That is God. How then can you, deluded, turn away from the truth?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily Allah is the Cleaver of the seed-grain and the date- stone. He bringeth forth the living from the lifeless, and He is the Bringer-forth of the lifeless from the living. Such is Allah: whither away then are ye deviating?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed Allah is the splitter of the grain and the pit. He brings forth the living from the dead and He brings forth the dead from the living. That is Allah! Then where do you stray?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah Who causeth the seed-grain and the date-stone to split and sprout. He causeth the living to issue from the dead, and He is the one to cause the dead to issue from the living. That is Allah: then how are ye deluded away from the truth?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily! It is Allah Who causes the seed-grain and the fruit-stone (like date-stone, etc.) to split and sprout. He brings forth the living from the dead, and it is He Who brings forth the dead from the living. Such is Allah, then how are you deluded away from the truth?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is Allah who splits the grain and the datestone. He brings forth the living from the dead, and the dead from the living. So, that is Allah; how then are you perverted?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God Who splits the grain and the seed. He brings the living from the dead, and He brings the dead from the living. Such is God. So how could you deviate?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, Allah is the cleaver of grain and date seeds. He brings the living out of the dead and brings the dead out of the living. That is Allah; so how are you deluded?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:95] God it is Who splits the grain, from the plants, and the date-stone, from the palm-trees. He brings forth the living from the dead, such as the human being from the sperm, and the bird from the egg; and is the Bringer-forth of the dead, the sperm and the egg, from the living. That, Splitter and Bringer-forth, is God. How then are you deluded?, so how then are you turned away from faith, despite the proof being established?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! Allah (it is) who spliteth the grain) i.e. He creates all kinds of grains; it is also said that this means: He creates that which is in the grains (of corn and the date-stone (for sprouting)) just as He creates all that which contains stones. (He bringeth forth the living from the dead) He brings forth living creatures and beasts from sperm drops; it is also said that this means: He creates birds from eggs; and it is said that this means: He creates a spike of grain and fruits from grains and stones, (and is the bringer forth of the dead from the living) He brings forth sperms from living creatures and beasts; it is also said that this means: He creates eggs from birds; and it is said that this means: He creates grains from corn and fruits. (Such) who does this (is Allah) and not any other god. (How then are you perverted) why then do you lie?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَالِقُ ٱلْحَبِّ وَٱلنَّوَىٰ } معناهُ خالِقُهُمَا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {So the originator of the heavens and the earth} - He is their Creator.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إن الله فالق } حبة القلب بنور الروح عن العلوم والمعارف ونوى النفس بنور القلب عن الأخلاق والمكارم { يُخْرج } حيّ القلب عن ميت النفس تارة باستيلاء نور الروح عليها { ومُخْرج } ميت النفس عن حيّ القلب أخرى بإقباله عليها واستيلاء الهوى وصفات النفس عليه\n { ذلكم الله } القادر على تقليب أحوالكم وتغليبكم في أطواركم { فأنى } تصرفون منه إلى غيره { فَالِق الإصْبَاح } أي: فالق ظلمة صفات النفس عن القلب بإصباح نور شمس الروح وإشراقه عليها { وجاعل } ظلمة النفس سكن القلب يسكن إليها للارتفاق والاسترواح أحياناً أو سكناً تسكن فيه القوى البدنية وتستقرّ عن الاضطراب وشمس الروح وقمر القلب محسوبين في عداد الموجودات الباقية الشريفة\n معتدّاً بهما",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقل يا أكمل الرسل للمنكرين البعث والحشر المستبعدين الممتنعين إحياء الأموات من العظام الرفات: { إِنَّ ٱللَّهَ } القادر على ما أراد وشاء { فَالِقُ ٱلْحَبِّ وَٱلنَّوَىٰ } أي: الحبة والنطفة { يُخْرِجُ ٱلْحَيَّ مِنَ ٱلْمَيِّتِ وَمُخْرِجُ ٱلْمَيِّتِ } أي: الحبة والنطفة { مِنَ ٱلْحَيِّ } أي: الحيوان والنبات { ذٰلِكُمُ ٱللَّهُ } المحيي المميت الحي القيوم المستحق للألوهية وللعبودية والربوبية { فَأَنَّىٰ تُؤْفَكُونَ } [الأنعام: 95] تصرفون عنه إلى غيره من الأظلال الباطلة أيها الحمقى\n\n\nوكيف تصرفون عنه وهو { فَالِقُ ٱلإِصْبَاحِ } أي: شاق ظلام الليل ينبلج الصبح لتكتسبوا فيه أقواتكم ومعاشكم { وَجَعَلَ ٱلْلَّيْلَ سَكَناً } لتستريحوا فيه من تعب الكد",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { ومُخرج }: معطوف على { فالق } \n على المختار لأنَّ { يُخرج الحي } ـ واقع موقع البيان له",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "113:1",
      "similarity": 0.3003096350118522
    },
    {
      "verse": "6:96",
      "similarity": 0.2864262057950974
    },
    {
      "verse": "26:63",
      "similarity": 0.1798333901941034
    },
    {
      "verse": "40:62",
      "similarity": 0.10075071727474373
    },
    {
      "verse": "43:87",
      "similarity": 0.10046700751337526
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/6:95.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/6:95.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/6:95.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}