{
  "chapter": "الأنعام",
  "text": "فالق الاصباح وجعل اليل سكنا والشمس والقمر حسبانا ذلك تقدير العزيز العليم",
  "translations": [
    {
      "translation": "It is He Who splits the sky at dawn, and appoints the night as a time of stillness and the sun and moon as a means of reckoning. That is what the Almighty, the All-Knowing has ordained.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He ushers in the dawn, and made the night for rest, the sun and moon a computation. Such is the measure appointed by Him, the omnipotent and all-wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who causes the dawn to split forth, and has ordained the night for repose, and the sun and the moon for reckoning time. All this is determined by Allah the Almighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who kindles the light of dawn, and has made the night for you to rest, and the sun and moon as a means of calculation. This is the design of the Majestic and All-knowing God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who breaks dawn (by splitting the dark); and He has made the night a calmness, and the sun and the moon a count (for time); this is the command set by the Almighty, the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He is the) Cleaver of the daybreak. He has appointed the night for resting, and the sun and the moon for reckoning. Such is the measuring of the Almighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He causes the dawn to break; and He has made the night for rest, and the sun and the moon for reckoning; this is an arrangement of the Mighty, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He splits the sky into dawn, and has made the night for a repose, and the sun and moon for a reckoning. That is the ordaining of the All-mighty, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Cleaver of the Daybreak, and He hath appointed the night for stillness, and the sun and the moon for reckoning. That is the measuring of the Mighty, the Wise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He causes the break of day, and has made the night for rest and He made the sun and the moon to a precise measure. That is the measure determined by the All Mighty and the All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Cleaver of the dawn; and He hath appointed the night as a rest, and appointed the sun and the moon according to a reckoning that is the disposition of the Mighty, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Splitter of the dawn, He has made the night for rest, and the sun and the moon for calculation. That is the ordaining of the All-mighty, the All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is that cleaveth the day-break (from the dark): He makes the night for rest and tranquillity, and the sun and moon for the reckoning (of time): Such is the judgment and ordering of (Him), the Exalted in Power, the Omniscient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He is the) Cleaver of the daybreak. He has appointed the night for resting, and the sun and the moon for reckoning. Such is the measuring of the All-Mighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He splits the sky into dawn. He has ordained the night for rest and the sun, and the moon for reckoning. Such is the ordinance of the Almighty, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who breaks the dawn. And He made the night for rest, and the sun and the moon for calculation. Such is the disposition of the Almighty, the All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[He is] the cleaver of daybreak and has made the night for rest and the sun and moon for calculation. That is the determination of the Exalted in Might, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:96] He is the Cleaver of the daybreak (al-isbāh is the verbal noun, meaning al-subh, ‘dawn’), in other words, He splits the morning shaft, the first light that appears after the darkness of night, and He has appointed the night for stillness, in which creatures rest from toil, and the sun and the moon (read both in the accusative, wa’l-shamsa wa’l-qamara, as a supplement to the [syntactical] status of al-layla, ‘the night’) for reckoning, for the calculation of [periods of] time (or [if the prefixed preposition] bā’ is [considered to have been] omitted [bi-husbān], making it [husbān] a circumstantial qualifier referring to an implied verb [such as yajriyān, ‘they follow courses’], that is, ‘they follow courses precisely calculated [bi-husbān]’, as is stated in the verse of [sūrat] al-Rahmān [Q. 55:5]).That, mentioned, is the ordaining of the Mighty, in His kingdom, the Knowing, of His creation.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He is the Cleaver of the Daybreak) He is the Creator of the morning of the day, (and He hath appointed the night for stillness) for created beings, (and the sun and the moon) and He has created the sun and the moon (for reckoning) i.e. their phases change according to precise measures; it is also said that this means: the sun and the moon are suspended between the sky and the earth, rotating. (That is the measuring of the Mighty) i.e. through the providence of the Mighty in retribution vis-a-vis whoever does not believe in him, (the Wise) in His providence and who knows those who believe in Him and those who do not.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱلشَّمْسَ وَٱلْقَمَرَ حُسْبَاناً } وَهَو جَمعُ حِسابٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف تصرفون عنه وهو { فَالِقُ ٱلإِصْبَاحِ } أي: شاق ظلام الليل ينبلج الصبح لتكتسبوا فيه أقواتكم ومعاشكم { وَجَعَلَ ٱلْلَّيْلَ سَكَناً } لتستريحوا فيه من تعب الكد، وهما من أقوى أسباب حياتكم { وَ } أيضاً جعل لكم ولمعاشكم { ٱلشَّمْسَ وَٱلْقَمَرَ حُسْبَاناً } ذا أدوار وأطوار مختلفة وأوضاع متفاوتة شتاء وصيفاً ربيعاً وخريفاً تتميماً لأرزاقكم وأقواتكم { ذٰلِكَ تَقْدِيرُ } تدبير وتدوير { ٱلْعَزِيزِ } القادر الغالب على جميع صور التدابير والتداوير { ٱلْعَلِيمِ } [الأنهام: 96] بفنع التدوير المخصوص والوضع المتعارف لمعاش عباده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}