{
  "chapter": "الأنعام",
  "text": "وهو الذى جعل لكم النجوم لتهتدوا۟ بها فى ظلمت البر والبحر قد فصلنا الءايت لقوم يعلمون",
  "translations": [
    {
      "translation": "It is He Who has appointed the stars for you so you might be guided by them in the darkness of the land and sea. We have made the Signs clear for people who have knowledge.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the stars by which you reckon your way through the darkness of the desert and the sea. Distinct have We made Our signs for those who recognise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has made for you the stars that you may follow the right direction in the darkness of the land and the sea. We have indeed spelled out signs for the people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is God who created the stars so that you could find your way thereby in the darkness of the land and sea. We have explained Our evidence to the people of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who has created the stars for you, so that you may find your way by them in the darkness of the land and the sea; indeed We have explained Our verses in detail for the people of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has set the stars for you, so that you may guide your course with their help through the darkness of the land and the sea. We have (indeed) explained in detail Our Ayat for people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has made the stars for you that you might follow the right way thereby in the darkness of the land and the sea; truly We have made plain the communications for a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has appointed for you the stars, that by them you might be guided in the shadows of land and sea. We have distinguished the signs for a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who hath set for you the stars that ye may guide your course by them amid the darkness of the land and the sea. We have detailed Our revelations for a people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has set up for you the stars so that you might be guided by them in the midst of the darkness of land and sea. We have made the signs clear for people who want to understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who hath appointed for you the stars that ye may be guided thereby in the darknesses of the land and the sea. Surely We have expounded the signs unto a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who made the stars for you, so that you may be guided by them in the darkness of land and sea. We have certainly elaborated the signs for a people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who maketh the stars (as beacons) for you, that ye may guide yourselves, with their help, through the dark spaces of land and sea: We detail Our signs for people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has set the stars for you, so that you may guide your course with their help through the darkness of the land and the sea. We have (indeed) explained in detail Our Ayat (proofs, evidences, verses, lessons, signs, Revelations, etc.) for people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has created for you the stars, so that you can be guided by them in the darkness of land and sea. We have made plain Our verses to a nation who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who created the stars for you, that you may be guided by them in the darkness of land and sea. We thus explain the revelations for people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who placed for you the stars that you may be guided by them through the darknesses of the land and sea. We have detailed the signs for a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:97] And He it is Who appointed for you the stars that you may guide your course by them amid the darkness of land and sea, when travelling. Verily We have distinguished, We have elucidated, the signs, the proofs of Our power, for a people who have knowledge, [a people] who reflect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على جملة : { وجاعل اللّيل سكناً } \\[ الأنعام : 96 \\] ، وهذا تذكير بوحدانيّة الله ، وبعظيم خلقة النّجوم ، وبالنّعمة الحاصلة من نظام سيرها إذ كانت هداية للنّاس في ظلمات البرّ والبحر يهتدون بها . وقد كان ضبط حركات النّجوم ومطالعها ومغاربها من أقدم العلوم البشريّة ظهر بين الكلدانيّين والمصريّين القدماء . وذلك النّظام هو الّذي أرشد العلماء إلى تدوين علم الهيئة .والمقصود الأوّل من هذا الخبر الاستدلال على وحدانيّة الله تعالى بالإلهيّة ، فلذلك صيغ بصيغة القصر بطريق تعريف المسند والمسند إليه ، لأنّ كون خلق النّجوم من الله وكونها ممّا يهتدَى بها لا ينكره المخاطبون ولكنّهم لم يَجْرُوا على ما يقتضيه من إفراده بالعبادة .والنّجُوم جمع نجم ، وهو الكوكب ، أي الجسم الكروي المضيء في الأفق ليْلاً الّذي يبدو للعين صغيراً ، فليس القمر بنجْم .و { جَعَل } هنا بمعنى خَلَق ، فيتعّدى إلى مفعول واحد و { لكُم }.متعلّق ب { جعل } ، والضّمير للبشر كلّهم ، فلام { لكم } للعلّة .وقوله : { لتهتدوا بها } علّة ثانية لِ { جعَل } فاللاّم للعلّة أيضاً ، وقد دلّت الأولى على قصد الامتنان ، فلذلك دخلت على ما يدلّ على الضّمير الدالّ على الذّوات ، كقوله : { ألم نشرح لك صدرك } \\[ الشرح : 1 \\] ، واللاّم الثّانية دلّت على حكمة الجعل وسبب الامتنان وهو ذلك النّفع العظيم . ولمّا كان الاهتداء من جملة أحوال المخاطبين كان موقع قوله : { لتهتدوا } قريباً من موقع بدل الاشتمال بإعادة العامل ، وقد تقدّم ذلك عند قوله تعالى : { تكون لنا عيداً لأوّلنا وآخرنا } في سورة \\[ المائدة : 114 \\].والمراد بالظلمات : الظلمة الشّديدة ، فصيغة الجمع مستعملة في القوّة . وقد تقدّم أنّ الشّائع أن يقال : ظلمات ، ولا يقال : ظلمة ، عند قوله تعالى : { وتَركهم في ظلمات لا يبصرون } في سورة \\[ البقرة : 17 \\].وإضافة ظلمات } إلى { البرّ والبحر } على معنى ( في ) لأنّ الظّلمات واقعة في هذين المكانين ، أي لتهتدوا بها في السّير في الظّلمات . ومن ينفي الإضافة على معنى ( في ) يجعلها إضافة على معنى اللاّم لأدنى ملابسة كما في «كوكب الخرقاء» . والإضافة لأدنى ملابسة ، إمّا مجاز لغوي مبني على المشابهة ، فهو استعارة على ما هو ظاهر كلام «المفتاح» في مبحث البلاغة والفصاحة إذ جعل في قوله تعالى : { يأرض ابلعي ماءك } \\[ هود : 44 \\] إضافة الماء إلى الأرض على سبيل المجاز تشبيهاً لاتّصال الماء بالأرض باتّصال المِلك بالمالك اه . فاستُعمل فيه الإضافة الّتي هي على معنى لام الملك فهو استعارة تبعيّة؛ وإمّا مجاز عقليّ على رأي التفتزاني في موضع آخر إذ قال في «كوكب الخرقاء» «حقيقة الإضافة اللاّميّة الاختصاص الكامل ، فالإضافة لأدنى ملابسة تكون مجازاً حُكمياً» . ولعلّ التفتزاني يرى الاختلاف في المجاز باختلاف قرب الإضافة لأدنى ملابسة من معنى الاختصاص وبعدها منه كما يظهر الفرق بين المثالين ، على أنّ قولهم : لأدنى ملابسة ، يؤذن بالمجاز العقلي لأنّه إسناد الحكم أو معناه إلى ملابسسٍ لما هُوَ لَهُ .وجملة : { قد فصّلنا الآيات } مستأنفة للتّسجيل والتّبليغ وقطع معذرة من لم يؤمنوا . واللاّم للتّعليل متعلّق ب { فصّلنا } كقوله: ... ويوم عَقرت للعذاري مطيّتيأي فصّلنا لأجل قوم يعلمون .وتفصيل الآيات تقدّم عند قوله تعالى : { وكذلك نفصّل الآيات } في هذه السّورة \\[ 55 \\]. وجعل التّفصيل لقوم يعلمون تعريضاً بمَن لم ينتفعوا من هذا التّفصيل بأنّهم قوم لا يعلمون .والتّعريف في الآيات } للاستغراق فيشمل آية خلق النّجوم وغيرها . والْعِلم في كلام العرب إدْراك الأشياء على ما هي عليه قال السّمَوْأل أو عبد الملك الحارثي: ... فليس سواء عالم وجهولوقال النّابغة: ... ولَيْسَ جاهِلُ شيءٍ مثلَ مَنْ عَلِماوالّذين يعلمون هم الّذين انتفعوا بدلائل الآيات . وهم الّذين آمنوا بالله وحده ، كما قال تعالى : { إنّ في ذلكم لآيات لقوم يؤمنون } \\[ الأنعام : 99 \\].\n\n",
      "translations": [
        {
          "translation": "(And He it is Who hath set for you the stars that ye may guide) that you may know (your course by them amid the darkness of the land and the sea) and their terror when you travel by land or sea. (We have detailed Our revelations) We have exposited the Qur'an and the signs of divine Oneness (for a people who have knowledge) that it is from Allah, i.e. the genuine believers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { وهو الذي جعل لكم النجوم لتهتدوا بها } أي: ببعضها { في ظلمات البر والبحر } أي: في ظلمات الليل في البر والبحر، وأضاف الظلمات إليهما لملابستها بهما، أو في مشتبهات الطرق في البر والبحر، وسماها ظلمات على الاستعارة، { قد فصلنا الآيات } بيناها { لقوم يعلمون } فإنهم المنتفعون بها. الإشارة: جعل الحق ـ جل جلاله ـ نجوم العلم يهتدي السائرون بها في مشكلات أمور الشريعة وأمور الحقيقة، فلبر الشريعة علم يسير به أهلُه إلى جنته ورضوانه، ولبحر الحقيقة علم يسير به أهلها الطالبون لها إلى معرفة ذاته وصفاته، وشهودها في حال جلاله وجماله، ولله در المجذوب رضي الله عنه، حيث قال:\nثم ذكر دليلاً آخر، فقال: { وَهُوَ ٱلَّذِيۤ أَنشَأَكُم مِّن نَّفْسٍ وَاحِدَةٍ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:16",
      "similarity": 0.6318856037395423
    },
    {
      "verse": "37:88",
      "similarity": 0.5839393620254582
    },
    {
      "verse": "53:1",
      "similarity": 0.5400602245573742
    },
    {
      "verse": "52:49",
      "similarity": 0.5081999703800828
    },
    {
      "verse": "55:6",
      "similarity": 0.5026126381352483
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006097.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006097.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:97.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}