{
  "chapter": "الأنعام",
  "text": "وهو الذى انشاكم من نفس وحدة فمستقر ومستودع قد فصلنا الءايت لقوم يفقهون",
  "translations": [
    {
      "translation": "It is He Who first produced you from a single self, then from a resting-place and a repository. We have",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who produced you from a single cell, and appointed a place of sojourning, (the womb of the mother), and a place of depositing, (the grave). How clear have We made Our signs for those who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who created you out of a single being, and appointed for each of you a time-limit and a resting place. We have indeed spelled out Our signs for those who can understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has created you from a single soul. Some of you are settled (on earth) and some are still in the depository system of (their parents). We have shown the evidence (of Our existence) to the people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who has created you from a single soul – then you have to stop over* in one place and stay entrusted** in another; indeed We have explained Our verses in detail for people of understanding. (* This earth. ** The grave.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has created you from a single person, and has given you a place of residing and a place of storage. Indeed, We have explained in detail Our revelations for people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who has brought you into being from a single soul, then there is (for you) a resting-place and a depository; indeed We have made plain the communications for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who produced you from one living soul, and then a lodging-place, and then a repository. We have distinguished the signs for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who hath produced you from a single being, and (hath given you) a habitation and a repository. We have detailed Our revelations for a people who have understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who first produced you from a single soul, then gave you a place to stay [in life] and a resting place [after death]. We have made Our revelations clear to those who are men of understanding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who hath produced you from one person, and thenceforth provided for you an abode and a depository. Surely We have expounded the signs unto a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who created you from a single soul, then there is the [enduring] abode and the place of temporary lodging. We have certainly elaborated the signs for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who hath produced you from a single person: here is a place of sojourn and a place of departure: We detail Our signs for people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who has created you from a single person (Adam), and has given you a place of residing (on the earth or in your mother's wombs) and a place of storage [in the earth (in your graves) or in your father's loins]. Indeed, We have explained in detail Our revelations (this Quran) for people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who originated you from one soul, then a lodging (place), and then a repository. We have made plain the verses to a nation that understands.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who produced you from a single person, then a repository, then a depository. We have detailed the revelations for people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who produced you from one soul and [gave you] a place of dwelling and of storage. We have detailed the signs for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:98] And He it is Who produced you, created you, from a single soul, namely, Adam, such that some, of you, are established, in the womb, and some, of you, are deposited, in the loins (a variant reading [of mustaqirrun, ‘established’] has mustaqarrun, that is, a resting place for you). Verily We have distinguished the signs for a people who understand, what is being said to them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "145 (And He it is Who hath produced) created (you from a single being) from Adam, (and (hath given you) a habitation) in the wombs (and a repository) in the loins; it is also said this means: He has given you a habitation in the loins and repository in the wombs. (We have detailed Our revelations for a people who have understanding) of Allah's command and His divine Oneness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَمُسْتَقَرٌّ وَمُسْتَوْدَعٌ } معناهُ فَمُسْتَقَرٌ فِي صُلْبِ الأَبِ ومُسْتَودعٌ فِي رَحمِ الأُمِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً كيف يصرفون عنه سبحانه مع أنه { هُوَ } القادر { ٱلَّذِيۤ أَنشَأَكُم } وأظهركم بالتجلي الحبي { مِّن نَّفْسٍ وَٰحِدَةٍ } هي طبيعة العدم { فَمُسْتَقَرٌّ وَمُسْتَوْدَعٌ } أي: فكلكم أطوار مختلفة، وشؤون متفاوتة، لبعض قرار واستقرار، ولبعض استيداع واستتار، تتبدلون وتتحولون من حال إلى حال على مقتضى تطوراتها وتجلياتها { قَدْ فَصَّلْنَا } وأوضحنا { ٱلآيَٰتِ } الدالة على ألا وجود لغيرنا من الأظلال، والإقرار ولا مراد لها أصلاً { لِقَوْمٍ يَفْقَهُونَ } [الأنعام: 98] يتأملون ويتدبرون لينكشفوا بكيفية سريان الهوية الإلهية في المظاهر الكونية والكيانية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: من قرأ مستقر بفتح القاف، فمصدر، أو اسم مكان ومن قرأه بالكسر، فاسم فاعل، وعلى كل ـ هو مبتدأ، حذف خبره الجار والمجرور، أي: لكم مستقر\n يقول الحقّ جلّ جلاله: { وهو الذي أنشأكم من نفس واحدة } آدم عليه السلام { فمستقر ومستودع } أي: فلكم استقرار في الأصلاب أو فوق الأرض، واستيداع في الأرحام أو تحت الأرض، أو موضع استقرار واستيداع فيهما، أو: فمنكم مُستَقِّر في الأصلاب أو في الأرض، أي: قارٌّ فيهما، ومنكم مستودَع في الأرحام أو تحت الأرض\n وقيل: الاستقرار: في الأرحام، والاستيداع: في الصلب، بدليل قوله:\n",
      "translations": []
    }
  ]
}