{
  "chapter": "الأنعام",
  "text": "وهو الذى انزل من السماء ماء فاخرجنا به نبات كل شىء فاخرجنا منه خضرا نخرج منه حبا متراكبا ومن النخل من طلعها قنوان دانية وجنت من اعناب والزيتون والرمان مشتبها وغير متشبه انظروا۟ الى ثمره اذا اثمر وينعه ان فى ذلكم لءايت لقوم يؤمنون",
  "translations": [
    {
      "translation": "It is He Who sends down water from the sky from which We bring forth growth of every kind, and from that We bring forth the green shoots and from them We bring forth close-packed seeds, and from the spathes of the date palm date clusters hanging down, and gardens of grapes and olives and pomegranates, both similar and dissimilar. Look at their fruits as they bear fruit and ripen. There are Signs in that for people who have iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down water from the skies, and brings out of it everything that grows, the green foliage, the grain lying close, the date palm trees with clusters of dates, and the gardens of grapes, and of olives and pomegranates, so similar yet so unlike. Look at the fruits, how they appear on the trees, and they ripen. In all these are signs for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who has sent down water from the heavens, and thereby We have brought vegetation of every kind, and out of this We have brought forth green foliage and then from it close-packed ears of corn, and out of the palm-tree from the sheath of it - thick clustered dates, hanging down with heaviness, and gardens of vines, and the olive tree, and the pomegranate - all resembling one another and yet so different. Behold their fruit when they bear fruit and ripen! Surely, in all this there are signs for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who has sent water down from the sky to let all kinds of plants grow; the vegetables with accumulated grains; palm-trees from which appear clusters of dates within easy reach; vineyards, olive groves, and pomegranates of all types. See the fruits when they are growing and when they are ripe. This, too, is evidence (of the existence of God) for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He Who sends down water from the sky; so with it We produced all things that grow; hence We produce from it vegetation from which We bring forth grains in clusters; and from the pollen of dates, dense bunches – and gardens of grapes and olives and pomegranates, similar in some ways and unlike in some; look at its fruit when it bears yield, and its ripening; indeed in it are signs for the people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who sends down water from the sky, and with it We bring forth vegetation of all kinds, and out of it We bring forth green stalks, from which We bring forth thick clustered grain. And out of the date-palm and its sprouts come forth clusters of dates hanging low and near, and gardens of grapes, olives and pomegranates, each similar, yet different. Look at their fruits when they begin to bear, and Yan`ih. Verily! In these things there are signs for people who believe.) Allah said,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He it is Who sends down water from the cloud, then We bring forth with it buds of all (plants), then We bring forth from it green (foliage) from which We produce grain piled up (in the ear); and of the palm-tree, of the sheaths of it, come forth clusters (of dates) within reach, and gardens of grapes and olives and pomegranates, alike and unlike; behold the fruit of it when it yields the fruit and the ripening of it; most surely there are signs in this for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sent down out of heaven water, and thereby We have brought forth the shoot of every plant, and then We have brought forth the green leaf of it, bringing forth from it close-compounded grain, and out of the palm-tree, from the spathe of it, dates thick-lustered, ready to the hand, and gardens of vines, olives, pomegranates, like each to each, and each unlike to each. Look upon their fruits when they fructify and ripen! Surely, in all this are signs for a people who do believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He it is Who sendeth down water from the sky, and therewith We bring forth buds of every kind; We bring forth the green blade from which We bring forth the thick-clustered grain; and from the date-palm, from the pollen thereof, spring pendant bunches; and (We bring forth) gardens of grapes, and the olive and the pomegranate, alike and unlike. Look upon the fruit thereof, when they bear fruit, and upon its ripening. Lo! herein verily are portents for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down water from the sky. With it We produce vegetation of all kinds; out of green foliage, We produce clustered grain; and from the date-palm, out of its sheath, We produce bunches of dates hanging low. We produce vineyards and olive groves and pomegranates, alike yet different. Look at their fruit as He causes it to grow and ripen. In this are signs for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who hath sent down rain from heaven and We have thereby brought forth growth of every kind, and thereout We have brought forth green stalks from which We bring forth close-growing seed- grain. And from the date-stone: from the spathe thereof come forth clusters of dates lowhanging; and gardens of grapes, and the olive, and the pomegranate, like unto one anot her and unlike. Look at the fruit thereof when it fruiteth and the reforming thereof. Verily therein are signs unto a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He who sends down water from the sky, and brings forth with it every kind of growing thing. Then from it We bring forth vegetation from which We produce the grain, in clusters, and from the palm-tree, from the spathes of it, low-hanging clusters [of dates], and gardens of grapes, olives and pomegranates, similar and dissimilar. Look at its fruit as it fructifies and ripens. Indeed, there are signs in that for a people who have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who sendeth down rain from the skies: with it We produce vegetation of all kinds: from some We produce green (crops), out of which We produce grain, heaped up (at harvest); out of the date-palm and its sheaths (or spathes) (come) clusters of dates hanging low and near: and (then there are) gardens of grapes, and olives, and pomegranates, each similar (in kind) yet different (in variety): when they begin to bear fruit, feast your eyes with the fruit and the ripeness thereof. Behold! in these things there are signs for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is He Who sends down water (rain) from the sky, and with it We bring forth vegetation of all kinds, and out of it We bring forth green stalks, from which We bring forth thick clustered grain. And out of the date-palm and its spathe come forth clusters of dates hanging low and near, and gardens of grapes, olives and pomegranates, each similar (in kind) yet different (in variety and taste). Look at their fruits when they begin to bear, and the ripeness thereof. Verily! In these things there are signs for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He sends down water from the sky, and with it We bring forth the plant of every thing. From these We bring forth green foliage and composite grain, palmtrees laden with clusters of dates within reach, vineyards and olive groves and pomegranates alike and unlike. Behold their fruits when they bear fruit and ripen. Surely, in these there are signs for a nation who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who sends down water from the sky. With it We produce vegetation of all kinds, from which We bring greenery, from which We produce grains in clusters. And palm-trees with hanging clusters, and vineyards, and olives, and pomegranates—similar and dissimilar. Watch their fruits as they grow and ripen. Surely in this are signs for people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And it is He who sends down rain from the sky, and We produce thereby the growth of all things. We produce from it greenery from which We produce grains arranged in layers. And from the palm trees - of its emerging fruit are clusters hanging low. And [We produce] gardens of grapevines and olives and pomegranates, similar yet varied. Look at [each of] its fruit when it yields and [at] its ripening. Indeed in that are signs for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[6:99] And He it is Who sent down water from the heaven and therewith, with the water, We bring forth (there is a shift away from the third [to the second person in this address]) plants of every kind, that produces shoots, and therefrom, from the shoots, We bring forth, some, verdure, meaning ‘the greens’ [in other words, vegetation], bringing forth from it, from the verdure, thick-clustered grain, in dense clusters — such as the spikes of wheat and the like — and from the palm-tree (wa-mina’l-nakhli is the predicate, and is substituted by [the following, min tal‘ihā, ‘from its pollen’]) from its pollen — that which is the first to be produced by it — spring bunches of dates (qinwānun is the subject of the sentence), stalks with date clusters, bunched up, one near the other, and, We bring forth from it, gardens, orchards, of grapes, and olives, and pomegranates, the leaves of both [of these] being, similar (mushtabihan is a circumstantial qualifier), but, the fruits of which are, not alike. Look, O you addressed, in reflection, upon their fruits (read thamarihi or thumurihi, the plural of thamara, like shajara, ‘tree’, [as plural of] shajar, and khashaba, ‘[a piece of] wood’, for khashab) when they have borne fruit, when this first begins, how it looks, and, [look] upon, their ripening, after they have reached full growth, and the state to which they return. Surely, in all that are signs, proofs of His power, exalted be He, to resurrect and to do all other things, for a people who believe: it is these [people] that are specifically mentioned because they are the ones to profit from those [signs] by their believing in them, in contrast to the disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالقول في صيغة القصر من قوله : { وهو الذي أنزل } إلخ كالقول في نظيره السّابق . و ( مِن ) في قوله : { مِن السّماء } ابتدائية لأنّ ماء المطر يتكوّن في طبقات الجوّ العُليا الزمهريرية عند تصاعد البخار الأرضي إليها فيصير البخار كثيفاً وهو السّحاب ثمّ يستحيل ماء . فالسّماء اسم لأعلى طبقات الجوّ حيث تتكوّن الأمطار . وتقدّم في قوله تعالى : { أو كَصيّب من السّماء في سورة البقرة . وعُدل عن ضمير الغيبة إلى ضمير التكلّم في قوله : فأخرجْنا } على طريقة الإلتفات . والباء للسّببيّة جَعل الله الماء سبباً لخروج النّبات ، والضّمير المجرور بالباء عائد إلى الماء .والنّباتُ اسم لما يَنبت ، وهو اسم مصدر نَبَتَ ، سمّي به النّابت على طريقة المجاز الّذي صار حقيقة شائعة فصار النَّبات اسماً مشتركاً مع المصدر .و { شيء } مراد به صِنف من النّبات بقرينة إضافة { نباتَ } إليه . والمعنى : فأخرجنا بالماء ما ينبت من أصناف النّبت . فإنّ النبت جنس له أنواع كثيرة؛ فمنه زرع وهو ما له ساق ليّنة كالقَصَب؛ ومنه شجر وهو ما له ساق غليظة كالنّخل ، والعنب؛ ومنه نَجْم وأبّ وهو ما ينبت لاصِقاً بالتّراب ، وهذا التّعميم يشير إلى أنّها مختلفة الصّفات والثّمرات والطبائع والخصوصيات والمذاق ، وهي كلّها نابتة من ماء السّماء الّذي هو واحد ، وذلك آية على عظم القدرة ، قال تعالى : { تُسقَى بماء واحد ونُفضّل بعضَها على بعضضٍ في الأكل } \\[ الرعد : 4 \\] وهو تنبيه للنّاس ليعتبروا بدقائق ما أودعه الله فيها من مختلف القوى الّتي سبّبتْ اختلاف أحوالها .والفاء في قوله : { فأخرجنا به نبات كلّ شيء } فاء التّفريع .وقوله : { فأخرجنا منه خضراً } تفصيل لمضمون جملة { فأخرجْنا به نبات كلّ شيء } ، فالفاء للتّفصيل ، و ( من ) ابتدائية أو تبعيضيّة ، والضّمير المجرور بها عائد إلى النّبات ، أي فكان من النبت خضر ونَخْل وجنّات وشجر ، وهذا تقسيم الجنس إلى أنواعه .والخَضِر : الشّيء الّذي لونه أخضر ، يقال : أخْضر وخَضِر كما يقال : أعور وعَور ، ويطلق الخضر اسماً للنّبت الرّطب الّذي ليس بشجر كالقصيل والقضب . وفي الحديث : « وإنّ ممّا يُنبت الرّبيعُ لَمَا يَقْتُل حَبَطا أو يُلِمّ إلاّ آكِلَةَ الخَضِر أكلتْ حتّى إذا امتَدّتْ خاصرتاها » الحديث . وهذا هو المراد هنا لقوله في وصفه { نخرج منه حبّاً متراكباً } ، فإنّ الحبّ يخرج من النّبت الرّطب .وجملة : { نخرج منه } صفة لقوله { خضرا } لأنّه صار اسماً ، و ( من ) اتِّصاليّة أو ابتدائيّة ، والضّمير المجرور بها عائد إلى { خَضِرا }.والحَبّ : هو ثمر النّبات ، كالبُرّ والشّعير والزّراريع كلّها .والمتراكب : الملتصق بعضه على بعض في السنبلة ، مثل القَمح وغيره ، والتّفاعل للمبالغة في ركوب بعضه بعضاً .وجملة : { ومن النّخل من طلعها قنوان دانية } عطف على { فأخرجنا منه خضراً }.ويجوز أن تكون معترضة والواو اعتراضيّة ، وقوله : { من النّخل } خبر مقدّم و { قنوان } مبتدأ مؤخّر .والمقصود بالإخبار هنا التّعجيب من خروج القنوان من الطلع وما فيه من بهجةٍ ، وبهذا يظهر وجه تغيير أسلوب هذه الجملة عن أساليب ما قبلها وما بعدها إذ لم تعطف أجزاؤها عطف المفردات ، على أنّ موقع الجملة بين أخواتها يفيد ما أفادته أخواتها من العبرة والمنّة .والتّعريف في { النّخل } تعريف العهد الجنسي ، وإنّما جيء بالتّعريف فيه للإشارة إلى أنّه الجنس المألوف المعهود للعرب ، فإنّ النّخل شجرهم وثَمره قُوتُهم وحوائطه منبَسَط نفوسهم ، ولك أن تجعله حالاً من { النّخل } اعتداداً بالتّعريف اللّفظي كقوله { والزّيتونَ والرّمَّان مشتبهاً } ، ويجوز أن يكون { من طلعها } بدل بعض من { النّخل } بإعادة حرف الجرّ الدّاخل على المبدل منه .و { قِنوان } بكسر القاف جمع قِنو بكسر القاف أيضاً على المشهور فيه عند العرب غيرَ لغة قيس وأهل الحجاز فإنّهم يضمّون القاف . فقنوان بالكسر جمع تكسير . وهذه الصّيغة نادرة ، غير جمع فُعَل ( بضمّ ففتح ) وفُعْل ( بضمّ فسكون ) وفَعْل ( بفتح فسكون ) إذا كانا واويي العين وفُعال .والقِنو : عرجون التّمر ، كالعنقود للعنب ، ويسمّى العِذق بكسر العين ويسمّى الكِبَاسة بكسر الكاف .والطَّلْع : وعاء عرجون التّمر الّذي يبدو في أوّل خروجه يكون كشكل الأترُجَّة العظيمة مغلقاً على العرجون ، ثمّ ينفتح كصورة نعلين فيخرج منه العنقود مجتمعاً ، ويسمّى حينئذٍ الإغريض ، ثمّ يصير قِنوا .و { دانية } قريبة . والمراد قريبة التّناول كقوله تعالى : { قطوفها دانية } \\[ الحاقة : 23 \\]. والقنوان الدانية بعض قنوان النّخل خصّت بالذّكر هنا إدماجاً للمنّة في خلال التّذكير بإتّقان الصنعة فإنّ المنّة بالقنوان الدّانية أتمّ ، والدّانية هي الّتي تكون نخلتها قصيرة لم تتجاوز طول قامة المتناول ، ولا حاجة لذكر البعيدة التّناول لأنّ الذّكرى قد حصلت بالدّانية وزادت بالمنّة التّامّة .و { جنّاتٍ } بالنّصب عطف على { خِضرا }.وما نسب إلى أبي بكر عن عاصم من رفْع { جنّات } لم يصحّ .وقوله : { من أعناب } تمييز مجرور ب { مِن } البيانيّة لأنّ الجنّات للأعناب بمنزلة المقادير كما يقال جريت تَمراً ، وبهذا الاعتبار عُدّي فعل الإخراج إلى الجنّات دون الأعناب ، فلم يقل وأعناباً في جنّات . والأعناب جمع عِنَب ، وهو جمع عِنَبَة ، وهو في الأصل ثمر شجر الكَرْم . ويطلق على شجرة الكرم عِنب على تقدير مضاف ، أي شجرة عنب ، وشاع ذلك فتنوسي المضاف . قال الرّاغب : «العِنب يقال لثمرة الكرم وللكرم نفسه» اه . ولا يعرف إطلاق المفرد على شجرة الكرم ، فلم أر في كلامهم إطلاق العنبة بالإفراد على شجرة الكرم ولكن يطلق بالجمع ، يقال : عنب ، مراد به الكرم ، كما في قوله تعالى : { فأنبتنا فيها حَبّاً وعنباً } \\[ عبس : 27 ، 28 \\] ، ويقال : أعناب كذلك ، كما هنا ، وظاهر كلام الرّاغب أنّه يقال : عِنبة لشجرة الكرم ، فإنّه قال : «العنب يقال لثمرة الكرم وللكرم نفسه الواحدة عنبة» .{ والزّيتون والرمّان } بالنّصب عطف على { جنّات } والتّعريف فيهما الجنس كالتّعريف في قوله : { ومن النّخل }.والمراد بالزّيتون والرمّان شجرهما . وهما في الأصل اسمان للثمرتين ثمّ أطلقا على شجرتيهما كما تقدّم في الأعناب . وهاتان الشّجرتان وإن لم تكونا مثل النّخل في الأهميّة عند العرب إلاّ أنّهما لعزّة وجودهما في بلاد العرب ولتنافس العرب في التّفكّه بثمرهما والإعجاب باقتنائهما ذُكرا في مقام التّذكير بعجيب صنع الله تعالى ومنّته . وكانت شجرة الزّيتون موجودة بالشّام وفي سينا ، وشجرة الرمّان موجودة بالطّائف .وقوله : { مشتبهاً وغير متشابه } حال ومعطوف عليه ، والواو للتّقسيم بقرينة أنّ الشيء الواحد لا يكون مشتبهاً وغير متشابه ، أي بعضه مشتبه وبعضه غير متشابه . وهما حالان من «الزّيتون والرمّان» معاً ، وإنّما أفرد ولم يجمع اعتباراً بإفراد اللّفظ . والتّشابه والاشتباه مترادفان كالتساوي والاستواء ، وهما مشتقّان من الشبَه . والجمع بينهما في الآية للتّفنّن كراهيّة إعادة اللّفظ ، ولأنّ اسم الفاعل من التّشابه أسعد بالوقف لما فيه من مدّ الصّوت بخلاف { مُشتبه }.وهذا من بديع الفصاحة .والتّشابه : التماثل في حالة مع الاختلاف في غيرها من الأحوال ، أي بعض شجره يشبه بعضاً وبعضه لا يشبه بعضاً ، أو بعض ثمره يشبه بعضاً وبعضه لا يشبه بعضاً ، فالتّشابه ممّا تقارب لونه أو طعمه أو شكله ممّا يتطلّبه النّاس من أحواله على اختلاف أميالهم ، وعدم التّشابه ما اختلف بعضه عن البعض الآخر فيما يتطلّبه النّاس من الصّفات على اختلاف شهواتهم ، فمن أعواد الشّجر غليظ ودقيق ، ومن ألوان ورقه قاتم وداكن ، ومن ألوان ثمره مختلف ومن طعمه كذلك ، وهذا كقوله تعالى : { ونفضّل بعضها على بعض الأكل } \\[ الرعد : 4 \\]. والمقصود من التّقييد بهذه الحال التّنبيه على أنّها مخلوقة بالقصد والاختيار لا بالصدفة .ويجوز أن تجعل هذه الحال من جميع ما تقدّم من قوله : { نخرج منه حبّاً متراكباً } ، فإنّ جميع ذلك مشتبه وغير متشابه . وجعله الزمخشري حالاً من { الزّيتون } لأنّه المعطوف عليه وقدّر ل { الرمّان } حالاً أخرى تدلّ عليها الأولى ، بتقدير : والرمّان كذلك . وإنّما دعاه إلى ذلك أنّه لا يَرى تعدّدَ صاحب الحال الواحدة ولا التّنازع في الحال ونظره بإفراد الخبر بعد مبتدأ ومعطوففٍ في قول الأزرق بن طَرفة الباهلي ، جواباً لبعض بني قشير وقد اختصما في بئر فقال القُشيري : أنتَ لِصّ ابنُ لِصّ: ... رَمَاني بأمر كنتُ منه ووالديبَريئاً ومن أجللِ الطَّوِي رَماني ... ولا ضير في هذا الإعراب من جهة المعنى لأنّ التّنبيه إلى ما في بعض النّبات من دلائل الاختيار يوجّه العقول إلى ما في مماثله من أمثالها .وجملة : { انظروا إلى ثمره } بيان للجمل الّتي قبلها المقصودِ منها الوصول إلى معرفة صنع الله تعالى وقدرته ، والضّمير المضاف إليه في { ثمره } عائد إلى ما عاد إليه ضمير { مشتبهاً } من تخصيص أو تعميم . والمأمور به هو نظر الاستبصار والاعتبار بأطواره .والثَمَر : الجَنَى الّذي يُخرجه الشّجر . وهو بفتح الثّاء والميم في قراءة الأكثر ، جمع ثَمَرة بفتح الثّاء والميم وقرأه حمزة والكسائي وخلَف بضمّ الثّاء والميم وهو جمع تَكسير ، كما جمعت : خَشبة على خُشُب ، وناقة على نُوق .واليَنْعُ : الطِّيبُ والنّضج . يقال : يَنَع بفتح النّون يَيْنع بفتح النّون وكسرها ويقال : أيْنَع يُونِع يَنْعا بفتح التّحتيّة بعدها نون ساكنة .و { إذا } ظرف لحدوث الفعل ، فهي بمعنى الوقت الّذي يبتدىء فيه مضمون الجملة المضاف إليها ، أي حين ابتداء أثماره . وقوله : { وينعه } لم يقيّد بإذا أينع لأنّه إذَا ينع فقد تمّ تطوّره وحان قطافه فلم تبق للنّظر فيه عبرة لأنّه قد انتهت أطواره .وجملة : { إنّ في ذلكم لآيات } علّة للأمر بالنّظر . وموقع ( إنّ ) فيه موقع لام التّعليل ، كقول بشّار: ... إنّ ذاك النّجَاحَ في التّبْكيروالإشارة ب { ذلكم } إلى المذكور كلّه من قوله { وهو الّذي أنزل من السّماء ماء فأخرجنا به نبات كلّ شيء إلى قوله ويَنْعه } فتوحيد اسم الإشارة بتأويل المذكور ، كما تقدّم في قوله تعالى : { عوان بين ذلك } في سورة \\[ البقرة : 68 \\].ولقوم يؤمنون } وصف للآيات . واللاّم للتّعليل ، والمعلّل هو ما في مدلول الآيات من مضمّن معنى الدّلالة والنّفع . وقد صرّح في هذا بأنّ الآيات إنّما تنفع المؤمنين تصريحاً بأنّهم المقصود في الآيتين الأخريين بقوله : { لقوم يعلمون } \\[ الأنعام : 97 \\] وقوله { لقوم يفقهون } \\[ الأنعام : 98 \\] ، وإتماماً للتّعريض بأنّ غير العالمين وغير الفاقهين هم غير المؤمنين يعني المشركين .\n\n",
      "translations": [
        {
          "translation": "(He it is Who sendeth down water) rain (from the sky, and therewith We bring forth) by means of the rain (buds of every kind) of grains and other things; (We bring forth) from the earth by means of the rain (the green blade) green vegetation (from, which) from this green vegetation (we bring forth the thick clustered grain) clustered in spikes of grain and in other vegetations; (and from the date-palm, from the pollen thereof, spring pendant) close by, accessible to anyone standing or sitting (bunches; and (We bring forth) Gardens of grapes, and the) trees of (olive and the pomegranate) trees, (alike) in colour, referring here to pomegranates (and unlike) in taste. (Look upon the fruit thereof, when they bear fruit, and upon its ripening. Lo! Herein) in the difference of their colour (verily are portents) signs (for a people who believe) that they are from Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قِنْوَانٌ دَانِيَةٌ } فالقِنو: هو العِذقُ\n والاثْنَانُ: قنوَانُ\n ودَانيةٌ: معناه قَريبَةٌ\n\n\n\n\nوقوله تعالى: { وَيَنْعِهِ } معناهُ مَدرَكَهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Qinwanun daniyah} - the Qinw is the Udhq.\n\n\nAnd the two: the Qanun\n\n\nWadiya: This means \"nearby\" or \"close by\".\n\n\nAnd His saying, \"Be!\" - that is, His command - it is comprehended.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وهو الذي أنزل } من سماء الروح ماء العلم { فأخرجنا به نبات } كل صنف من الأخلاق والفضائل { فأخرجنا } من النبات هيئة خضرة النفس وزينة حسنة جميلة وبهجة بالعلم والخلق { نخرج } من تلك الهيئة والنفس الطرية الغضة أعمالاً مترتبة شريفة مرضية\n ونيّات صادقة يتقوّى بها القلب\n ومن نخل العقل من ظهور تعلقها معارف وحقائق قريبة التناول لظهورها بنور الروح كأنها بديهية { وجنّات من أعْنَاب } الأحوال والأذواق وخصوصاً أنواع المحبة القلبية المسكر عصيرها وسلافها\n وزيتون التفكّر\n ورمّان التوهمات الصادقة التي هي الهمم الشريفة\n والعزائم النفيسة { مشتبهاً } بعضها ببعض كالتعقلات والتفكرات والمعارف والحقائق والأعمال والنيّات وكمحبة الذات ومحبة الصفات { وغير متشابه } كأنواع المحبة مع الأعمال مثلاً\n أو مشتبهاً في رتبتها وقوتها وضعفها وجلائها وخفائها وغير متشابه فيه { انظُروا إلى ثمره إذا أثمر } وراعوه بالمراقبة عند السلوك وبدء الحال\n وليكن نظركم من اللذات إلى هذه الثمرات { وينعه } وكماله عند الوصول بالحضور { إن في ذلكم لآيات لقوم يؤمنون } بالإيمان العلميّ\n ويوقنون هذه الآيات والأحوال التي عدّدناها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَهُوَ ٱلَّذِيۤ أَنزَلَ مِنَ } جانب { ٱلسَّمَآءِ مَآءً فَأَخْرَجْنَا بِهِ } أي: بالماء - التفت لئلا يتوهم إسناد الإخراج إلى الماء - { نَبَاتَ كُلِّ شَيْءٍ } نبت كل صنف من أصناف النباتات { فَأَخْرَجْنَا مِنْهُ } أي: من النبات { خَضِراً } وهو السارق { نُّخْرِجُ مِنْهُ } من الخضر { حَبّاً مُّتَرَاكِباً } وهو السنبلة { وَ } أخرجنا { مِنَ ٱلنَّخْلِ } طلعها { مِن طَلْعِهَا قِنْوَانٌ } عنقود { دَانِيَةٌ } متلفة بعضها ببعض { وَ } أيضاً أخرجنا { جَنَّٰتٍ مِّنْ أَعْنَابٍ وَ } كذا أخرجنا { ٱلزَّيْتُونَ وَٱلرُّمَّانَ } من أشجارها { مُشْتَبِهاً } بعضها ببعض { وَغَيْرَ مُتَشَٰبِهٍ } أي: أنواع مختلفة { ٱنْظُرُوۤاْ } أيها الناظرون { إِلِىٰ ثَمَرِهِ } أي: ثمر كل من المذكورات { إِذَآ أَثْمَرَ } حين أخرج أولاً صغيراً بلا لذة وانتفاع (وَ) انظر إلى { وَيَنْعِهِ } نضجعه وبدو صلاحه ونفعه وكبره قليلاً قليلاً { إِنَّ فِي ذٰلِكُمْ لأَيَٰتٍ لِّقَوْمٍ يُؤْمِنُونَ } [الأنعام: 99] دلائل واضحات على وجود الفاعل المختار الحكيم\n المتقن في فعله بلا مشاركة أحد وممانعة ضد وند\n العليم الخبير بتطوراتها وتبديلاتها من حال إلى حال متدرجاً من كمال إلى أكمل\n العربي لها في كل مرتبة بما يناسبها ويلائمها على الاعتدال إلى أن يعود إلى ما بدأ\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: الضمير في { منه }: يعود على النبات، و { خَضِرًا }: نعت لمحذوف، أي: شيئًا خضرًا، و { قِنوَانٌ }: مبتدأ، و { من النخل }: خبر، و { مِن طَلعها }: بدل، والطَّلع: أول ما يخرج من التمر في أكمامه، والقنوان: جمع قنو، وهو العنقود من التمر، و { مُشتبهًا }: حال من الزيتون والرمان، أو من كل ما تقدم من النبات، و { جنات }: عطف على { نبات كل شيء }. و { ينعِهِ } أي: نضجه وطيبه، يقال: يَنَعتِ الثمرة، إذا أدركت وطابت. يقول الحقّ جلّ جلاله: { وهو الذي أنزل من السماء } أي: السحاب أو جانب السماء، { ماء فأخرجنا } ، فيه الالتفات من الغيبة إلى التكلم، { به } أي: بذلك الماء، { نبات كل شيء } أي: نبات كل صنف من النبات على اختلاف أنواعه، فالماء واحد والزهر ألوان، { فأخرجنا منه } أي: من النبات، شيئًا { خَضِرًا } وهو ما يتولد من أصل النبات من الفراخ، { نُخرجُ منه } أي: من الخَضِر، { حبًّا مُترَاكبًا } وهو السنبل لأن حبه بعضه فوق بعض، وكذلك الرمان والذرة وشبهها، { ومن النخل من طلعها قِنوانٌ دانية } أي: ويخرج من طلع النخل عناقيد متدانية قريبة من المتناول، أو ملتفة، قريب بعضها من بعض، وإنما اقتصر على المتداني دون العالي لزيادة النعمة والتمكن من النظر فيه، دون ضده. { و } أخرجنا أيضًا بذلك الماء، { جناتٍ } أي: بساتين، { من أعناب } مختلفة الألوان والأصناف { و } أخرجنا به { الزيتونَ والرمانَ } على اختلاف أصنافها، { مُشتبِهًا وغير مُتشَابه } أي: من النبات والثمار ما يُشبه بعضه بعضًا، في اللون والطعم والصورة، ومنه ما لا يُشبه بعضُه بعضًا، وفي ذلك دليل قاطع على الصانع المختار القدير العليم المريد، ولذلك أمر بالنظر والاعتبار فقال: { انظروا إلى ثمره } أي: انظروا إلى ثمرة كل واحد من ذلك { إذا أثمر } ، { و } انظروا إلى { يَنعِه } إذا ينع، أي: طاب ونضج، والمعنى: انظروا إلى ثمره أول ما يخرج ضعيفًا لا منفعة، فيه، ثم ينتقل من طَور إلى طور، حتى يينع ويطيب. { إنَّ في ذلكم لآياتٍ } دالة على وجود الحكيم ووحدانيته، فإن حدوث الأجناس المختلفة والأنواع المتفننة، ونقلها من حال إلى حال، لا يكون إلا بإحداث قادر، يعلم تفاصيلها، ويُرجَّح ما تقتضيه حكمته مما يمكن من أحوالها، ولا يعوقه عن فعله ند يعارضه، أو ضد يعانده، ولذلك عقبه بتوبيخ من أشرك فقال: { وجعلوا لله شركاء... } الخ. قاله البيضاوي. الإشارة: مَن كحَّل عينه بإثمد التوحيد، غرق الكائنات كلها في بحر التوحيد والتفريد، فكل ما يبرز لنا من المظاهر والمطالع ففيه نور من جمال الحضرة ساطع، ولذلك قال ابن الفارض رضي الله عنه:\nوقال الششتري رضي الله عنه:\nوقال صاحبُ العَينية:\nفما برز في عالم الشهادة هو من عالم الغيب على التحقيق، فرياض الملكوت فائضة من بحر الجبروت، كان الله ولا شيء معه، وهو الآن على ما عليه كان، ولا يعرف هذا ذوقًا إلا أهل العيان، الذين وحدوا الله في وجوده، وتخلصوا من الشرك جليه وخفيه، الذي أشار إليه بقوله: { وَجَعَلُواْ للَّهِ شُرَكَآءَ ٱلْجِنَّ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:141",
      "similarity": 0.34113248958641124
    },
    {
      "verse": "16:11",
      "similarity": 0.2185374302379323
    },
    {
      "verse": "55:68",
      "similarity": 0.21265331059361176
    },
    {
      "verse": "80:29",
      "similarity": 0.12779971630756604
    },
    {
      "verse": "16:67",
      "similarity": 0.10810128927983484
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/006099.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/006099.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/6:99.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}