{
  "chapter": "المعارج",
  "text": "يبصرونهم يود المجرم لو يفتدى من عذاب يومئذۭ ببنيه",
  "translations": [
    {
      "translation": "even though they can see each other. An evildoer will wish he could ransom himself from the punishment of that Day, by means of his sons,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though within sight of one another. The sinner would like to ransom himself from the torment of that Day by offering his sons,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "although they shall be within sight of one another. The guilty one would fain ransom himself from the torment of that Day by offering his children,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "though they may see each other. A sinner will wish that he could save himself from the torment of that day by sacrificing his children,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be seeing them; the guilty will wish if only he could redeem himself from the punishment of that day, by offering his sons.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though they shall be made to see one another, the criminal would desire to ransom himself from the punishment of that Day by his children.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Though) they shall be made to see each other. The guilty one would fain redeem himself from the chastisement of that day by (sacrificing) his children,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as they are given sight of them. The sinner will wish that he might ransom himself from the chastisement of that day even by his sons,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though they will be given sight of them. The guilty man will long to be able to ransom himself from the punishment of that day at the price of his children\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "though they shall be within sight of each other. The guilty one will gladly ransom himself from the torment of that Day by sacrificing his own children,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though they shall be made to see one another. Fain would the guilty ransom himself from the torment of that Day by his children.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[though] they will be placed within each other’s sight. The guilty one will wish he could ransom himself from the punishment of that day at the price of his children,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though they will be put in sight of each other,- the sinner's desire will be: Would that he could redeem himself from the Penalty of that Day by (sacrificing) his children,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though they shall be made to see one another [(i.e. on the Day of Resurrection), there will be none but see his father, children and relatives, but he will neither speak to them nor will ask them for any help)], - the Mujrim, (criminal, sinner, disbeliever, etc.) would desire to ransom himself from the punishment of that Day by his children.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "though they are in sight of each other. To ransom himself from the punishment of that Day, the sinner will wish that he might even ransom himself by his sons,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be shown each other. The criminal wishes he would be redeemed from the punishment of that Day by his children.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be shown each other. The criminal will wish that he could be ransomed from the punishment of that Day by his children\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[70:11] They will [however] be made to see them, that is, friends will catch sight of one another, recognising one another but refraining from speaking [to one another] (the sentence [yubassarūnahum] is a new [independent] one). The guilty one will desire, the disbeliever will yearn, to ransom himself from the chastisement of that day (read [min ‘adhābi] yawmi’dhin or [min ‘adhābin] yawma’idhin) at the price of his children,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Though they will be given sight of them) but will not recognise them as a result of their preoccupation with their own selves. (The guilty man) the idolater, i.e. Abu Jahl and his host; and it is said: al-Nadr Ibn al- Harith and his host (will long be able to ransom himself from the punishment of that day) the Day of Judgement (at the price of his children\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: لا يلتفت أحد إلى أحد من شدة هوله وشغله بحاله إلى حيث { يُبَصَّرُونَهُمْ } وينبهون عليهم من حال أقاربهم؛ ليرقوا لهم، وهم لا يتلفتون إليهم ولا يرقون لهم، بل { يَوَدُّ } ويحب { ٱلْمُجْرِمُ } حينئذٍ متمنياً { لَوْ يَفْتَدِي مِنْ عَذَابِ يَوْمِئِذٍ بِبَنِيهِ } [المعارج: 11] الذين هم أحب وأعز عليه من نفسه في دار الدنيا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n  { يُبَصَّرُونَهم } أي: يبصر الأحماءُ قرباءهم، فلا يخفون عنهم، وما يمنعهم من السؤال إلا اشتغالهم بحال أنفسهم\n والجملة صفة لحميم، أي: حميماً مبصَّرين، أو: استئناف بياني، كأنه قيل: لعله لا يبصّر به، فقيل: يبصّرونهم ولكن لتشاغلهم لم يتمكنوا من التساؤل عنهم، وإنما جمع الضميران، وهما للحميمين لعموم الحميم، ولأن فعيلاً يقع على الجمع\n { يَودُّ المجرمُ } أي: يتمنى الكافر، وقيل: كل مذنب، { لو يفتدي من عذابِ يومئذٍ } أي: العذاب الذي ابتلي به يومئذ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:36",
      "similarity": 0.6014277301190417
    },
    {
      "verse": "39:47",
      "similarity": 0.5313087135117883
    },
    {
      "verse": "3:91",
      "similarity": 0.4955954350542274
    },
    {
      "verse": "57:15",
      "similarity": 0.4801219312405752
    },
    {
      "verse": "37:107",
      "similarity": 0.4379881515530475
    }
  ]
}