{
  "chapter": "المعارج",
  "text": "تدعوا۟ من ادبر وتولى",
  "translations": [
    {
      "translation": "It will summon whoever turns his back and flees,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall insistently summon him who turned his back and retreated,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and drag into it anyone who has turned away (from obeying God),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It calls out to him who reverted and turned away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Calling (all) such as turn their backs and turn away their faces.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall claim him who turned and fled (from truth),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "calling him who drew back and turned away,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It calleth him who turned and fled (from truth),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and it will claim all those who turned their backs [on the true faith] and turned away [from the truth],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall calll him who turneth back and backslideth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It invites him, who has turned back [from the truth] and forsaken [it],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Inviting (all) such as turn their backs and turn away their faces (from the Right).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Calling: \"[O Kafir (O disbeliever in Allah, His angels, His Book, His Messengers, Day of Resurrection and in Al-Qadar (Divine Preordainments), O Mushrik (O polytheist, disbeliever in the Oneness of Allah)] (all) such as turn their backs and turn away their faces (from Faith) [picking and swallowing them up from that great gathering of mankind (on the Day of Resurrection) just as a bird picks up a food-grain from the earth with its beak and swallows it up] [Tafsir Al-Qurtubi, Vol. 18, Page 289]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and it shall call him who withdrew and turned his back\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It invites him who once turned his back and fled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It invites he who turned his back [on truth] and went away [from obedience]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[70:17] it will call him who turned his back and ignored, faith, saying [to him]: ‘To me ! to me [come hither]!’,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "693 (It calleth) to itself: \"come to me, disbeliever!\", \"come to me, hypocrite\" (him who turned) from Allah's divine Oneness (and fled) from faith and did not repent of disbelief,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n ألا ترى إلى قوله: { تدعو من أدبر وتولّى } فإن لظى نار الطبيعة السفلية ما استدعت إلا المدبر عن الحق المعرض عن جناب القدس وعالم النور المقبل بوجهه إلى معدن الظلمة المؤثر بمحبته الجواهر الفاسقة السفلية المظلمة فانجذب بطبعه إلى مواد النيران الطبيعية واستدعته وجذبته إلى نفسها للجنسية فاحترق بنارها الروحانية المستولية على الأفئدة، فكيف يمكن الإنجاء منها وقد طلبها بداعي الطبع ودعاها بلسان الاستعداد",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { تَدْعُواْ } وتجذب إلى نفسها { مَنْ أَدْبَرَ } عن الإيمان، ولم يقبل عن قبول الدعوى { وَتَوَلَّىٰ } [المعارج: 17] أي: انصرف عن الطاعة وإطاعة الدَّاعي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { تَدعو } أي: تجذبُ، وتخطف، أو: تدعوهم بأسمائهم: يا كافر يا منافق إليَّ، وقيل: تدعو المنافقين بلسان فصيح، ثم تلتقطهم التقاط الحب، أو: تُهْلِك، من قولهم: دعاك الله، أي: أهلكك، أو: لمّا كان مصيره إليها جُعلت كأنها دعته\n وقيل: تدعو زبانيتها، ومفعول تدعو: { مَنْ أدبرَ } عن الحق { وتولَّى } أعرض عن الطاعة، { وجمع } المال { فأوْعى } جعله في وعاء، وكَنَزَه ولم يؤدِّ حق الله فيه، أو تشاغل به عن الدين، وزهى باقتنائه حرصاً وتأميلاً، عائذاً بالله من ذلك\n الإشارة: سال إلى قلوب أهل الغفلة والإنكار سايل من بحر الهوى، بعذاب واقع نازل بقلوبهم من الجزع والهلع والشكوك والخواطر، أو: سأ سائل عن عذاب واقع لأهل الإنكار، وهو غم الحجاب، وسوء الحساب، ليس له دافع من جهته تعالى لأنه حكم به على أهل البُعد والإنكار\n وهو تعالى ذو المعارج، أي: ذو المراقي، تترقى إليه الأرواح والأسرار، من مقام إلى مقام، من مقام الإسلام إلى الإيمان، ومن الإيمان إلى الإحسان، أو: من عالَمٍ إلى عالَمٍ، من عالَم المُلك إلى الملكوت، ومن عالَم الملكوت إلى الجبروت، ومن عالَم الجبروت إلى الرحموت\n تعرج الملائكة والروح إليه، أمّا الملائكة فتنتهي إلى الدهش والهيمان، وأما الروح الصافية فتنتهي إلى شهود الذات بالصحو والتمكين، وهذا مقام خاصة الخاصة من النبيين والصدِّيقين، تنتهي إلى هذا المقام في زمن يسير، إن سبقت العناية واتصل صاحبها بالخبير، وفي زمن طويل إن لم يتصل بالخبير، ولذلك قال تعالى: { في يوم كان مقداره خمسين ألف سنة } أي: يقطع ذلك في يوم كان مقداره لو صار بنفسه خمسن ألف سنة\n واعلم أنَّ الحق تعالى لا يتصف بقُرب ولا بُعد، هو أقرب إلى كل شيء من كل شيء، وإنما بعّد النفوسَ جهلُها به تعالى ووهْمُها وغفلتها، فإذا ارتفع الجهل والوهم، وَجَدت الحقّ كان قريباً وهي لا تشعر\n قال الورتجبي: ليس للحق مكان ومنتهى، حتى أن الخلق يعرجون إليه، بل إنَّ ظهور عزته وجلاله في كل ذرة عيانٌ، فإذا رَفَعْتَ القربَ والبُعدَ من حيث المسافة، وأدرجت الأوهام والأفهام لم يكن بين الحق والروح فصل، وصول الحق لأهل الحق بأقل طرفة، فإنَّ الوصل منه، وهو قريب غير بعيد\n هـ\n فاصبر أيها السائر صبراً جميلاً لتظفر بالوصل الدائم، إنهم ـ أي أهل الغفلة ـ يرونه بعيداً، ونراه قريباً لمن قربتُه عليه، يوم تكون السماء كالمُهل، أي: وقت الوصول هو حين تتلطّف العوالم وتذوب الكائنات، فيتصل بحر الأزل بما لم يزل، فلم يبقَ إلاَّ الأزل، قال بعض المحققين: حقيقة المشاهدة: تكثيف اللطيف، وحقيقة المعاينة: تلطيف الكثيف، فافهم\n\n\nولا يسأل حميمٌ حميماً، أي: لا مودة بين أهل البُعد وأهل القرب، ولو كان مِن أقرب الناس إليه نسباً، وهذا مثل قوله:\n\n[المجادلة:22] الآية\n يَوَدُّ المجرمُ، حين يرى ما خص اللهُ به أولياءه من العز والقُرب، لو يفتدي بجميع مَا يملك، بل بجميع أهل الأرض مما نزل به من عذابِ القطيعة والبُعد، كلاّ إنها، أي: نار القطيعة، لَظَى، نزاعةَ لرِفْعَةِ الرؤوس، بل تحطها عن مراتب المقربين، تدعوا مَن أدبر عن المجاهدة والتربية، وجَمَعَ الدنيا فأوعاها، وهذا هو الهلوع الذي أشار إليه بقوله: { إِنَّ ٱلإِنسَانَ خُلِقَ هَلُوعاً }\n\n",
      "translations": []
    }
  ]
}