{
  "chapter": "المعارج",
  "text": "الا على ازوجهم او ما ملكت ايمنهم فانهم غير ملومين",
  "translations": [
    {
      "translation": "Are free of blame,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except in regard to their spouses and those whom their right hands possess, for in regard to them they are not reproachable,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except from their wives and slave girls, in which case they are not to be blamed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except with their wives and the bondwomen in their possession, for there is no reproach on them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except from their wives or their right hand possessions -- for (then) they are not blameworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except in the case of their wives or those whom their right hands possess-- for these surely are not to be blamed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save from their wives and what their right hands own, then not being blameworthy\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save with their wives and those whom their right hands possess, for thus they are not blameworthy;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except from their spouses and those whom they rightfully possess [through wedlock], for which they incur no blame --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save in regard to their spouses or those whom their right hands own; so verily they are not blameworthy -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(apart from their spouses and their slave women, for then they are not blameworthy;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except with their wives and the (captives) whom their right hands possess,- for (then) they are not to be blamed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except with their wives and the (women slaves and captives) whom their right hands possess, for (then) they are not to be blamed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except from their wives and what their right hands own, for these they are not blameworthy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except from their spouses or those living under their control, for then they are free of blame.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except from their wives or those their right hands possess, for indeed, they are not to be blamed -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[70:30] except from their wives and those whom their right hands own, in the way of slavegirls, for in that case they are not blameworthy;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Save with their) four (wives and those whom their right hands possess) of slaves without limitation, (for thus they are not blameworthy) nor sinful; they are not reproached for indulging in that which is lawful;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ عَلَىٰ أَزْوَاجِهِمْ أَوْ مَا مَلَكَتْ أَيْمَانُهُمْ } من السراري { فَإِنَّهُمْ غَيْرُ مَلُومِينَ } [المعارج: 30] عليهن، إلاَّ أن المؤمن المخلص لو لم يبالغ في إتِّباع الشهوات المباحة أيضاً لكان له خيراً كثيراً، وأجراً عظيماً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}