{
  "chapter": "المعارج",
  "text": "تعرج الملئكة والروح اليه فى يوم كان مقداره خمسين الف سنة",
  "translations": [
    {
      "translation": "The angels and the Spirit ascend to Him in a day whose length is fifty thousand years.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To whom the angels and the soul take a day to ascend, whose length is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "by which the angels and the Spirit ascend to Him in one Day the duration of which is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day (of Judgment), long as fifty thousand years, the angels and the Spirit will ascend to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and Jibreel, ascend towards Him – the punishment will befall on a day which spans fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and the Ruh ascend to Him in a Day the measure whereof is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him ascend the angels and the Spirit in a day the measure of which is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him the angels and the Spirit mount up, in a day whereof the measure is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Whereby) the angels and the Spirit ascend unto Him in a Day whereof the span is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "by which the angels and the Spirit will ascend to Him in one Day which will last for fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whereby the angels ascend Unto Him and also the spirit, On a Day whereof the measure is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and the Spirit ascend to Him in a day whose span is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and the spirit ascend unto him in a Day the measure whereof is (as) fifty thousand years:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and the Ruh [Jibrael (Gabriel)] ascend to Him in a Day the measure whereof is fifty thousand years,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him the angels and the Spirit (Gabriel) ascend in a day, the measure of which is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Him the angels and the Spirit ascend on a Day the duration of which is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and the Spirit will ascend to Him during a Day the extent of which is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[70:4] To Him, to the place in the heaven to which His command descends, ascend (read [feminine person] ta‘ruju or [masculine person] ya‘ruju) the angels and the Spirit, Gabriel, in a day (fī yawmin is semantically connected to an omitted clause, that is to say, ‘[in a day] in which the chastisement befalls them’, on the Day of Resurrection) whose span is fifty thousand years, from the perspective of the disbeliever, on account of the calamities he will encounter in it — but as for the believer, it [the mentioned day] will be easier for him than an obligatory prayer which he performs in this world, as stated in hadīth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Whereby) the angels and the Spirit) i.e. Gabriel (ascend unto Him) unto Allah (in a Day whereof the span) the span of ascending it for other than the angels (is fifty thousand years) it is also said that this means: it is from Allah that the punishment of the disbelievers comes in a day whose span is 50,000 years; and it is also said that this means: if anyone, other than Allah, were given the reckoning of people, such reckoning would not finish in 50,000 years.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تَعْرُجُ ٱلْمَلاَئِكَةُ } أي: حوامل آثار الأسماء والصفات الإلهية من مجردات العالم السفلي { وَٱلرُّوحُ } الفائض من لدنه سبحانه على هياكل الهويات من ماديات عالم الطبيعة، والأركان القابلة لآثار العلويات من الأسماء والصفات المسمَّاة بالأعيان الثابتة { إِلَيْهِ } أي: إلى الذات البحث الخالص عن مطلق القيود والإضافات بعدما جذبه الحق، وأدركته العناية الإلهية مترقياً من درجة إلى درجة { فِي يَوْمٍ } وشأن لا كأيام الدنيا وشئونها، وإن قسته إلى أيام الدنيا، وأضفتشه إلى المسافة الدنيَّة الدنيوية { كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ } [المعارج: 4] من سَني الدنيا، إلاَّ أنهم يقطعونها بعد ورود الجذبة الإلهية، كالبرق الخاطف في أقصر من لمحة وطرفة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { تعرُجُ الملائكةُ والرُّوحُ } أي: جبريل عليه السلام، أُفرد بالذكر لتميُّزه وفضله، أو الروح: خلقٌ من الملائكة هم حفظة على الملائكة، كما أنَّ الملائكة حفظةٌ علينا، أو: أرواح المؤمنين عند الموت، فإنها تعرج إلى سدرة المنتهى، فتُحاسَب، ثم تدخل الجنة لترى مقعدها، ثم ترجع للسؤال في القبر، وقوله تعالى: { إِليه } أي: إلى عرشه ومهبط أمره { في يوم كان مقدارُه خمسين ألفَ سنةٍ } مما يعده الناس، وهو بيان لغاية ارتفاع تلك المعارج وبُعد مداها، على منهاج التمثيل والتخييل\n\n\nوالمعنى: أنها من الارتفاع بحيث لو قدر قطعها في زمان لكان ذلك الزمان مقدار خمسين ألف سنة من سِنيِّ الدنيا، وقيل: معناه: تعرج الملائكة والروح إلى عرشه تعالى في كل يوم كان مقداره خمسين ألف سنة، أي: يقطعون في يوم ما يقطعه الإنسان في خمسين ألف سنة\n وقد تقدّم الجواب في سورة السجدة عن المعارضة بين ما هنا وبين قوله هناك:\n\n[السجدة:5]، وحاصله: أنَّ الحق تعالى موجود في كل زمان ومكان، فلا يخلو منه مكان ولا زمان، فحيث علّق العروج بتدبير الأمر قرَّب المسافة، وحيث علّقه بذاته، بحيث جعل العروج إليها، بعَّدها تنبيهاً على علو شأنه وارتفاع عظمته\n وقيل: هو من [صلة] قوله: { واقع } أي: يقع ذلك العذاب في يوم طويل، مقداره خمسون ألف سنة، وهو يوم القيامة، فإمّا أن يكون استطالته كناية عن شدته على الكفار، أو لأنه يطول حقيقة، فقد قيل: فيه خمسون موطناً، كل موطن ألف سنة، وما قّدْر ذلك على المؤمن إلاَّ كما بين الظهر والعصر أو أقل، على قدر التخفيف اليوم، وفي حديث أبي سعيد الخدري: قيل: يا رسول الله، ما أطول هذا اليوم؟ فقال عليه السلام:\n\n \" إنه ليخف على المؤمن، حتى يكون أخف من صلاة مكتوبة يُصلّيها في الدنيا \"\n \n\nوقال عبد الحق في العاقبة: إنَّ طول اليوم ذلك المقدار، ولكن مِن الناس مَن يطول قيامه وحبسه إلى آخر اليوم، ومنهم مَن ينفصل في مقدار يوم من أيام الدنيا، وفي ساعة من ساعته، وفي أقل من ذلك، يكون رائحاً في ظل كسبه، وعرش ربه، ومنهم مَن يؤمر به للجنة من غير حساب ولا عذاب، كما أنَّ منهم مَن يُؤمر به إلى النار في أول الأمر، من غير وقوف ولا انتظار، أو بعد يسير من ذلك\n هـ\n وقال القشيري ما معناه: يحاسب الخلق في يوم قصير ووقت يسير، ما لو كان الناس يشتغلون به لكان ذلك خمسين ألف سنة، والله يُجري ذلك ويُمْضِيه في يوم واحد\n هـ\n بعيد",
      "translations": []
    }
  ]
}