{
  "chapter": "المعارج",
  "text": "تعرج الملئكة والروح اليه فى يوم كان مقداره خمسين الف سنة",
  "translations": [
    {
      "translation": "The angels and the Spirit ascend to Him in a day whose length is fifty thousand years.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To whom the angels and the soul take a day to ascend, whose length is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "by which the angels and the Spirit ascend to Him in one Day the duration of which is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day (of Judgment), long as fifty thousand years, the angels and the Spirit will ascend to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and Jibreel, ascend towards Him – the punishment will befall on a day which spans fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and the Ruh ascend to Him in a Day the measure whereof is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him ascend the angels and the Spirit in a day the measure of which is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him the angels and the Spirit mount up, in a day whereof the measure is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Whereby) the angels and the Spirit ascend unto Him in a Day whereof the span is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "by which the angels and the Spirit will ascend to Him in one Day which will last for fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whereby the angels ascend Unto Him and also the spirit, On a Day whereof the measure is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and the Spirit ascend to Him in a day whose span is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and the spirit ascend unto him in a Day the measure whereof is (as) fifty thousand years:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and the Ruh [Jibrael (Gabriel)] ascend to Him in a Day the measure whereof is fifty thousand years,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Him the angels and the Spirit (Gabriel) ascend in a day, the measure of which is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unto Him the angels and the Spirit ascend on a Day the duration of which is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The angels and the Spirit will ascend to Him during a Day the extent of which is fifty thousand years.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[70:4] To Him, to the place in the heaven to which His command descends, ascend (read [feminine person] ta‘ruju or [masculine person] ya‘ruju) the angels and the Spirit, Gabriel, in a day (fī yawmin is semantically connected to an omitted clause, that is to say, ‘[in a day] in which the chastisement befalls them’, on the Day of Resurrection) whose span is fifty thousand years, from the perspective of the disbeliever, on account of the calamities he will encounter in it — but as for the believer, it [the mentioned day] will be easier for him than an obligatory prayer which he performs in this world, as stated in hadīth.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Whereby) the angels and the Spirit) i.e. Gabriel (ascend unto Him) unto Allah (in a Day whereof the span) the span of ascending it for other than the angels (is fifty thousand years) it is also said that this means: it is from Allah that the punishment of the disbelievers comes in a day whose span is 50,000 years; and it is also said that this means: if anyone, other than Allah, were given the reckoning of people, such reckoning would not finish in 50,000 years.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ تَعْرُجُ ٱلْمَلاَئِكَةُ } أي: حوامل آثار الأسماء والصفات الإلهية من مجردات العالم السفلي { وَٱلرُّوحُ } الفائض من لدنه سبحانه على هياكل الهويات من ماديات عالم الطبيعة\n والأركان القابلة لآثار العلويات من الأسماء والصفات المسمَّاة بالأعيان الثابتة { إِلَيْهِ } أي: إلى الذات البحث الخالص عن مطلق القيود والإضافات بعدما جذبه الحق\n وأدركته العناية الإلهية مترقياً من درجة إلى درجة { فِي يَوْمٍ } وشأن لا كأيام الدنيا وشئونها\n وإن قسته إلى أيام الدنيا\n وأضفتشه إلى المسافة الدنيَّة الدنيوية { كَانَ مِقْدَارُهُ خَمْسِينَ أَلْفَ سَنَةٍ } [المعارج: 4] من سَني الدنيا\n إلاَّ أنهم يقطعونها بعد ورود الجذبة الإلهية\n كالبرق الخاطف في أقصر من لمحة وطرفة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "32:5",
      "similarity": 0.6882899156044932
    },
    {
      "verse": "29:14",
      "similarity": 0.5382047432891814
    },
    {
      "verse": "24:7",
      "similarity": 0.4688478976853391
    },
    {
      "verse": "24:9",
      "similarity": 0.4497389604370635
    },
    {
      "verse": "70:3",
      "similarity": 0.448631074600269
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/070004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/070004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/70:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}