{
  "chapter": "نوح",
  "text": "وجعل القمر فيهن نورا وجعل الشمس سراجا",
  "translations": [
    {
      "translation": "and placed the moon as a light in them and made the sun a blazing lamp?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And has placed the moon therein, an illumination, and has placed the sun, a lighted lamp?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and has placed the moon in them as a light, and the sun as a radiant lamp?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and placed therein the moon as a light\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘And in them, has illuminated the moon, and made the sun a lamp?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And has made the moon a light therein, and made the sun a lamp\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And made the moon therein a light, and made the sun a lamp?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and set the moon therein for a light and the sun for a lamp?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hath made the moon a light therein, and made the sun a lamp?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and made the moon therein a light, and made the sun a lamp,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And hath placed the moon therein for a light, and hath made the sun a lamp?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and has made therein the moon for a light and the sun for a lamp?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And made the moon a light in their midst, and made the sun as a (Glorious) Lamp?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And has made the moon a light therein, and made the sun a lamp?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "setting in them the moon as a light and the sun as a lantern?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He set the moon in their midst for light, and He made the sun a lamp.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And made the moon therein a [reflected] light and made the sun a burning lamp?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[71:16] and made the moon therein — that is to say, within their totality, [but] which is [effectively] true in the case of the heaven of this world — as a light and made the sun as a lamp?, as an illuminating lantern, more powerful than the light of the moon.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَجَعَلَ الْقَمَرَ فِيهِنَّ نُورًا وَجَعَلَ الشَّمْسَ سِرَاجًا (16)وقوله : { وجعل القمر فيهن نوراً } صالح لاعتبار القمر من السماوات ، أي الكواكب على الاصطلاح القديم المبني على المشاهدة ، لأن ظرفية ( في ) تكون لوقوع المحوي في حاويه مثل الوعاء ، وتكون لوقوع الشيء بين جماعته ، كما في حديث الشفاعة « وتبقى هذه الأمة فيها منافقوها » ، وقول النميري :تَضوَّعَ مسكاً بطن نَعْمَانَ أنْ مشتْبه زينب في نِسْوَةٍ خَفِرَاتِو { القمر } كائن في السماء المماسة للأرض وهي المسماة بالسماء الدنيا ، والله أعلم بأبعادها .وقوله : { وجعل الشمس سراجاً } هو بتقدير : وجعل الشمس فيهن سراجاً ، والشمس من الكواكب .والإِخبار عن القمر بأنه نور مبالغة في وصفه بالإِنارة بمنزلة الوصف بالمصدر . والقمر ينير ضوؤُه الأرضَ إنارة مفيدة بخلاف غيره من نجوم الليل فإن إنارتها لا تجدي البشر .والسراج : المصباح الزاهر نورُه الذي يوقد بفتيلة في الزيت يُضيء التهابُها المعدَّلُ بمقدار بقاء مادة الزيت تغمرها .والإِخبار به عن الشمس من التشبيه البليغ وهو تشبيه ، والقصد منه تقريب المشبه من إدراك السامع ، فإن السراج كان أقصى ما يستضاء به في الليل وقلّ من العرب من يتخذه وإنما كانوا يرونه في أديرة الرُهبان أو قصور الملوك وأضرابهم ، قال امرؤ القيسيضي سناه أو مصابيح راهبٍ ... أمال الذُّبَال بالسليط المفتلووصفوا قصر غُمْدان بالإِضاءة على الطريق ليلاً .ولم يخبر عن الشمس بالضياء كما في آية سورة يونس ( 5 ) { هو الذي جعل الشمس ضياء } ، والمعنى واحد وهو الإضاءة ، فلعل إيثار السراج هنا لمقاربة تعبير نوح في لغته ، مع ما فيه من الرعاية على الفاصلة ، لأن الفواصل التي قبلها جاءت على حروف صحيحة ولو قيل : ضياء لصارت الفاصلة همزة والهمزة قريبة من حروف العلة فيثقل الوقف عليها .وفي جعل القمر نوراً إيماء إلى أن ضوء القمر ليس من ذاته فإن القمر مظلم وإنما يستضيء بانعكاس أشعة الشمس على ما يستقبلها من وجهه بحسب اختلاف ذلك الاستقبال من تبعُّض وتمام هو أثر ظهوره هلالاً ثم اتساع استنارته إلى أن يصير بدراً ، ثم ارتجاع ذلك ، وفي تلك الأحوال يضيء على الأرض إلى أن يكون المحاق . وبعكس ذلك جعلت الشمس سراجاً لأنها ملتهبة وأنوارها ذاتية فيها صادرة عنها إلى الأرض وإلى القمر مثل أنوار السراج تملأ البيت وتُلمع أوانيَ الفضة ونحوها مما في البيت من الأشياء المقابلة .وقد اجتمع في قوله : وجعل القمر فيهن نوراً وجعل الشمس سراجاً } استدلال وامتنان .\n\n",
      "translations": [
        {
          "translation": "(And hath made the moon) along with them (a light therein) a shining light therein, (and made the sun a lamp) a radiance for the children of Adam?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ألم تروا كيف خلق الله سبع سماوات طباقاً } من مراتب الغيوب السبعة المذكورة ذات طباق بعضها فوق بعض { وجعل } قمر القلب { فيهنّ نوراً } زائداً نوره على نور النفس ونجوم القوى { وجعل } شمس الروح { سراجاً } باهراً نوره\n { والله أنبتكم } من أرض البدن { نباتاً * ثم يعيدكم فيها } بميلكم إليها وتلبسكم بشهواتها ولذاتها وبهيئات نفوسكم الجسمانية وغواشيكم الهيولانية { ويخرجكم } بالبعث منه في مقام القلب عند الموت الإرادي { والله جعل لكم } تلك { الأرض بساطاً * لتسلكوا منها } سبل الحواس { فجاجاً } خروقاً واسعة أو من جهتها سبل سماء الروح إلى التوحيد\n كما قال أمير المؤمنين عليه السلام: \" سلوني عن طرق السماء فإني أعلم بها من طرق الأرض \" \n أراد الطرق الموصلة إلى الكمال من المقامات والأحوال كالزهد والعبادة والتوكل والرضا وأمثال ذلك\n ولهذا كان معراج النبي صلى الله عليه وسلم بالبدن\n { واتبعوا من لم يزده ماله وولده إلا خساراً } من رؤسائهم المتبوعين أهل المال والجاه المحجوبين عن الحق الهالكين الذين خسروا نور استعدادهم بالاحتجاب بهما وبالأولاد والأتباع أو المحجوبين بأموال العلوم الحاصلة بالعقل الشيطاني المشوب بالوهم ونتائج فكرهم المقتضية لمحبة البدن والمال { لا تذرنّ آلهتكم } أي:معبوداتكم التي عكفتم بهواكم عليها من ودّ البدن الذي عبدتموه بشهواتكم وأحببتموه وسواع النفس ويغوث الأهل ويعوق المال ونسر الحرص",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَجَعَلَ ٱلْقَمَرَ فِيهِنَّ } أي: في السماوات { نُوراً } مقتبساً من شمس الذات { وَجَعَلَ ٱلشَّمْسَ } المشرقة المنيرة { سِرَاجاً } [نوح: 16] واضحاً\n ودليلاً لائحاً على شروق شمس الذات على مظاهر عموم الذرات المنعكسة منها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وجعلَ القمرَ فيهن نوراً } أي: يُنور وجه الأرض في ظلمة الليل\n ونسبتُه إلى الكل مع أنه في سماء الدنيا لأنَّ بين السموات ملابسة\n من حيث إنها طباق\n فجاز أن يقال: فيهن\n وإن لم يكن في جميعهن\n كما يُقال: في المدينة كذا\n وهو في بعض جوانبها\n وعن ابن عباس وابن عمر رضي الله عنهم: إن الشمس والقمر وجوههما مما يلي السموات\n وظهورهما مما يلي الأرض\n فيكون نور القمر سارياً في جميع السموات لأنها لطيفة لاتحجب نوره\n { وجعل الشمسَ سِراجاً } مصباحاً يزيل ظلمة الليل\n ويُبصر أهلُ الدنيا في ضوئها وجه الأرض\n ويُشاهدون الآفاق\n كما يُبصر أهل البيت في ضوء السراج ما يحتاجون إلى إبصاره\n وليس القمر بهذه المثابة\n إنما هو نور في الجملة\n فنور الشمس أقوى\n ومنه يستمد نور القمر\n وأجمعوا أنَّ الشمس في السماء الرابعة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "33:46",
      "similarity": 0.8461240900813647
    },
    {
      "verse": "25:61",
      "similarity": 0.7195245596467504
    },
    {
      "verse": "75:9",
      "similarity": 0.343855763358694
    },
    {
      "verse": "55:5",
      "similarity": 0.3420118055297808
    },
    {
      "verse": "78:13",
      "similarity": 0.3201355939035713
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/071016.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/071016.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/71:16.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}