{
  "chapter": "نوح",
  "text": "انا ارسلنا نوحا الى قومه ان انذر قومك من قبل ان ياتيهم عذاب اليم",
  "translations": [
    {
      "translation": "We sent Nuh to his people: 'Warn your people before a painful punishment comes to them.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "SENT NOAH to his people to warn them before the painful punishment came upon them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people (and directed him): “Warn your people before a grievous chastisement comes upon them.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people telling him, \"Warn your people before a painful torment approaches them\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We sent Nooh towards his people saying that, “Warn your people before the painful punishment comes upon them.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We sent Nuh to his people (saying): \"Warn your people before there comes to them a painful torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We sent Nuh to his people, saying: Warn your people before there come upon them a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people, saying, 'Warn thy people, ere there come on them a painful chastisement.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We sent Noah unto his people (saying): Warn thy people ere the painful doom come unto them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah forth to his people, saying, \"Warn your people before there comes upon them a grievous punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We sent Nuh Unto his people saying: warn thy people ere there come Unto them torment afflictive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We sent Noah to his people, [saying,] ‘Warn your people before a painful punishment overtakes them.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his People (with the Command): \"Do thou warn thy People before there comes to them a grievous Penalty.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We sent Nuh (Noah) to his people (Saying): \"Warn your people before there comes to them a painful torment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his nation, saying: 'Give warning to your nation before a painful punishment overtakes them'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sent Noah to his people: “Warn your people before there comes upon them a painful punishment.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We sent Noah to his people, [saying], \"Warn your people before there comes to them a painful punishment.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[71:1] Verily We sent Noah to his people [saying]: ‘Warn your people before there come on them — should they not believe — a painful chastisement’, in this world and in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Lo! We sent): '(Lo! We sent Noah unto his people (saying): Warn your people) from Allah's wrath and punishment (ere the painful doom come unto them) in the form of drowning.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّآ } من قمام جودنا { أَرْسَلْنَا } أخاك يا أكمل الرسل { نُوحاً إِلَىٰ قَوْمِهِ } حين انحرفوا عن جادة العدالة والقسط الإلهي، ووصينا له { أَنْ أَنذِرْ } أي: بأن خوف وحذر { قَوْمَكَ مِن قَبْلِ أَن يَأْتِيَهُمْ عَذَابٌ أَلِيمٌ } [نوح: 1] مؤلم في غاية الإيلام، وهو عذاب الطوفان بعد نزول الوحي عليه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنَّا أرسلنا نوحاً } وهو أول أُلي العزم\n قيل: معناه بالسريانية: الساكن، وقيل: سمي له لكثرة نوحه شوقاً إلى ربه، { أنْ أَنْذِر قَوْمَكَ } أي: بأن أنذر، فحذف الجار وأوصل الفعل، ومحله عند الخليل: الجر: وعند غيره: نصب، أو: \" أنْ \" مفسرة لأنَّ الإرسال فيه معنى القول، فلا يكون للجملة محل، وقُرىء: \" أنذر \" بغير \" أنْ \" ، أي: خوّف قومك { مِن قبل أن يأتيهم عذابٌ أليم } عذاب الآخرة، أو الطوفان، لئلا يبقى لهم عذر أصلاً",
      "translations": []
    }
  ]
}