{
  "chapter": "نوح",
  "text": "وقالوا۟ لا تذرن ءالهتكم ولا تذرن ودا ولا سواعا ولا يغوث ويعوق ونسرا",
  "translations": [
    {
      "translation": "saying, \"Do not abandon your gods. Do not abandon Wadd or Suwa' or Yaghuth or Ya'uq or Nasr.\"*",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said: 'Do not abandon your gods, and do not abandon Wadda or Suwa', or Yaghuth, Ya'uq or Nasr.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: “Do not abandon your deities; do not abandon Wadd, nor Suwa, nor Yaghuth, nor Yauq, nor Nasr.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and have said to each other, 'Do not give-up your idols. Do not renounce Wadd, Suwa`, Yaghuth, Ya`uq and Nasr (names of certain idols).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And they said, ‘Do not ever abandon your Gods – and never abandon Wadd, or Suwa – or Yaghuth or Yauq or Nasr.’”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have said: `You shall not leave your gods, nor shall you leave Wadd, nor Suwa`, nor Yaghuth, and Ya`uq and Nasr.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they say: By no means leave your gods, nor leave Wadd, nor Suwa; nor Yaghus, and Yauq and Nasr.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and have said, \"Do not leave your gods, and do not leave Wadd, nor Suwa', Yaghuth, Ya'uq, neither Nasr.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have said: Forsake not your gods. Forsake not Wadd, nor Suwa', nor Yaghuth and Ya'uq and Nasr.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they said [to their followers], \"Do not ever abandon your deities: abandon neither Wadd, nor Suwa', and neither Yaghuth, nor Yauq nor Nasr!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who have said: ye shall not leave your gods; nor Shall ye leave Wadd nor Suwa', nor Yaghuth, nor Ya'uq nor Nasr.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say, ‘‘Do not abandon your gods. Do not abandon Wadd, nor Suwa, nor Yaghuth, Ya‘uq and Nasr,’’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have said (to each other), 'Abandon not your gods: Abandon neither Wadd nor Suwa', neither Yaguth nor Ya'uq, nor Nasr';-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they have said: 'You shall not leave your gods, nor shall you leave Wadd, nor Suwa', nor Yaghuth, nor Ya'uq, nor Nasr (names of the idols);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and said: 'Do not renounce your gods, do not leave waddan or suwa'an or yaghutha, or ya'uqa, or nasra'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And they said, “Do not give up your gods; do not give up Wadd, nor Souwa, nor Yaghoos, and Yaooq, and Nassr.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said, 'Never leave your gods and never leave Wadd or Suwa' or Yaghuth and Ya'uq and Nasr.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[71:23] and have said, to the riffraff: “Do not abandon your gods, and do not abandon Wadd (read Wadd or Wudd) nor Suwā‘, nor Yaghūth and Ya‘ūq and Nasr” — these being the names of their idols.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And they have said) i.e. the chieftains said to the communality of the people: (Forsake not your gods) forsake not the worship of your Lord. (Forsake not Wadd) forsake not the worship of Wadd, (nor Suwa') nor the worship of Suwa', (nor Yaghuth and Ya'uq and Nasr) nor the worship of Yaghuth and Ya'uq and Nasr. These were idols which Noah's folk worshipped.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَقَالُواْ لاَ تَذَرُنَّ آلِهَتَكُمْ وَلاَ تَذَرُنَّ وَدّاً وَلاَ سُوَاعاً وَلاَ يَغُوثَ وَيَعُوقَ وَنَسْراً } قال الإِمامُ زيد بن علي عليهما السّلامُ هذه أسماءُ أَلهةٍ كانوا يَعبدُونَها قَومُ نُوحٍ\n ثم عَبدَتها العَربُ\n فكان وِدٌّ لكَلبٍ بدَومةِ الجَندلِ\n وكان سُواعٌ لهذَيلٍ\n وكان يغوثُ لبني غَطيفٍ من مُرادٍ بالجَوفِ\n وكان يَعوقُ لهَمدان\n وكان نَسْرٌ لدى الكلاعِ من حِمير\n وروَى الإِمامُ زيد بن علي عليهما السّلامُ بإسنادِه الشَّريفِ عن أبيهِ علي بن الحسين عن جده الحسين بن علي عليهم السّلامُ\n قال: رأيتُ يَغوث صنماً من رُصاصٍ يُحملُ عَلَى جَملٍ أجردٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوذلك احتيالهم على الناس إلى حيث لم يقبلوا دعوة نوح عليه السلام، مع كونه مؤيَّداً بأنواع المعجزات، بل سفهوه، واستهزءوا متمسرخين مستهزئين { وَقَالُواْ } لهم في نصحهم وتذكيرهم: { لاَ تَذَرُنَّ آلِهَتَكُمْ } أي: عبادتها، سيما بقول هذا السفيه المختبط، المختل الرأي والعقل { وَلاَ تَذَرُنَّ } خصوصاً { وَدّاً وَلاَ سُوَاعاً وَلاَ يَغُوثَ وَيَعُوقَ وَنَسْراً } [نوح: 23] فإنها غرانيق عظام تُرتجى منها الشفاعة على عصاة العباد، فعليكم ألاَّ تتركوا عبادة آلهتكم بقول هذا الطريد السفيه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقالوا لا تَذَرُنَّ آلهتكم } أي: لا تتركوا عبادتها على العموم إلى عبادة رب نوح، { ولا تَذَرُنَّ وَدًّا } بفتح الواو، وضمها لغتان: صنم على صورة رجل، { ولا سُوَاعاً } صنم على صورة امرأة، { ولا يَغُوثَ } صنم على صورة أسد، { وَيَعُوقَ } صنم على صورة فرس، وهما لا ينصرفان للتعريف ووزن الفعل إن كانا عربيين، والتعريف والعُجمة إن كانا عجميين، { ونَسْراً } صنم على صورة النسر، وخصُّوا بالذكر مع اندراجهم فيما سبق لأنها كانت أكبر أصنامهم وأعظمها عندهم، وقد انتقلت هذه الأصنام عنهم إلى العرب، فكان وَدّ لكلب، وسُواع لهمدان، ويغوث لمَذْحِج، ويَعُوق لمُراد، ونَسْر لحمير\n وقيل: هي أسماء رجال صالحين، كان الناس يقتدون بهم، بين آدم ونوح عليهما السلام، وقيل: أولاد آدم، فلما ماتوا، قال إبليس لمَن بعدهم: لو صوّرتم صورهم، فكنتم تنظرون إليهم، وتتبرّكون بهم، ففعلوا، فلمّا مات أولئك، قال لمَن بعدهم: إنهم كانوا يعبدونهم، فعبدوهم\n وقال ابن عباس رضي الله عنه: أول ما عُبِدَ من الأصنام في زمن مَهْلائِل بن غَيْنَان بن أنوش بن شيت بن آدم عليه السلام، وذلك لمّا مات آدم جعله بنو شيت في مغارة بأرض الهند، في جبل سرنديب، لموضع يسمى نوره، وهو أخصب جبل في الأرض، ثم كانوا يزورونه، ويترحّمون عليه، ويُعطمونه، فلما قَتَل قابيلُ أخاه هابيل نفوه من الأرض، فكان بمعزل عنهم هو وبنوه، فجاء الشيطانُ في صورة رجل ناصح، فقال لهم: إنَّ بني شيت يتبرّكون بآدم، وأنتم لا تلحقونه، فانحتوا صورته، وتبرَّكوا بها، ففعلوا، ثم كان لشيت ولد صالح، اسمه يغوث، فتُوفي، فكانوا يتبرّكون بقبره، فنحتَ أولادُ قابيل على صورة يغوث صورة أخرى، ثم يعوق، ثم ود، ثم سواع، ثم نسر، كلهم من أولاد شيت قوم صالحون، كانوا يتبرّكون بهم في المحْيا والممات، ولم يكن لأولاد قابيل سبيل إليهم، فنحتوا صورهم، وصاروا يُعظِّمونها، ويتبرّكون بها مثلهم، فلما طال بهم الزمان صاروا يعبدونهم دون الله، إلى أن بعث الله نوح عليه السلام فنهاهم عنها، فلم ينتهوا، فلما أهلك الله الأرض ومَن عليها بالطوفان، قذف الطوفانُ تلك الأصنام إلى أرض جُدة وما والاها من مكة، وأخفتها الرمال هناك\n\n\nقال الكلبي: وكان عَمرو بن لُحي كاهناً، يُكنّى أبا تمامة وكان يتراءى له الجن، فتراءى له يوماً جنِّي، وقال له: عَجِّل أبا تمامة بالسعد والسلامة إلى صف جدة، واستخرج ما فيها من الأصنام، وأوردها ماء تهامة، ولا تسأم ولا تهب، وادْع العرب إلى عبادتها تُجَب، فأتى عمرُو بن لُحي ساحلَ جدة، حيث وصف له الجني، واستخرج الأصنام في خِفية عنهم، وأرودها ماء تهامة، فلما حضر الحج، واجتمع الناس إلى الموسم، دعا الناس إلى عبادتها، فأجابته العرب قاطبة، وأول مَن أجابته بنو عوف بن عُزرة، فدفع لهم ودًّا، فنصبوه بواد القرى بدومة الجندل، ولم يزل عندهم إلى الإسلام، فكسره خالد بن الوليد، لَمَّا بعثه الرسولُ صلى الله عليه وسلم في غزوة تبوك لهدم دومة الجندل فحالت بينه وبينها العرب فقاتلهم وكسَّر صنمهم\n قال: الكلبي: قلت لمالك بن الحارث: صف لي ودًّا، وكان قد رآها مراراً، قال: تمثال رجل أعظم ما يكون من الرجال، مؤتزر بحُلة، مرتدٍ بأخرى، مقلَّداً سيفاً، راكباً فرساً، وفي يده حربة فيها لواء، ومعه قوس، ونبل في جعبة\n هـ\n ثم دفع عمرو لمُضر سُواعاً، فعكفت على عبادته مع هُذيل، ثم فرّق تلك الأصنام على القبائل على حسب ما تقدّم\n قال رسول الله صلى الله عليه وسلم:\n\n \" رأيتُ عمْرو بن لُحي ليلة أُسري بي رجلاً أحمر، قصيراً أزرق، وهو يَجُرُّ قُصْبَهُ في النار، لأنه أول مَن بَحَّرَ البَحيرة، ووصل الوصيلة، وحمى الحام، وغيّر دين إسماعيل \" \n\n، وهو من خزاعة، كان يسكن مكة، فولد بها أولاداً فكثروا، فنفوا مَن كان منها من العماليق\n انظر اللباب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:73",
      "similarity": 0.02490623022641962
    },
    {
      "verse": "85:14",
      "similarity": 0.02296008021498491
    },
    {
      "verse": "60:7",
      "similarity": 0.022817817975571097
    },
    {
      "verse": "4:42",
      "similarity": 0.022799423510966015
    },
    {
      "verse": "19:96",
      "similarity": 0.022798279646960958
    }
  ]
}