{
  "chapter": "نوح",
  "text": "انك ان تذرهم يضلوا۟ عبادك ولا يلدوا۟ الا فاجرا كفارا",
  "translations": [
    {
      "translation": "If You leave any they will misguide Your slaves and spawn nothing but more dissolute kafirun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you leave them, they will lead Your creatures astray, and beget but iniquitous and ungrateful offspring.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "for certainly if You should leave them (alive), they will mislead Your servants, and will beget none but sinners and utter unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "if You do, they will mislead Your servants and will only give birth to ungrateful sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Indeed, if You spare them, they will mislead your bondmen – and their descendants, if any, will be none except the wicked, very ungrateful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If You leave them, they will mislead Your servants, and they will beget none but wicked disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For surely if Thou leave them they will lead astray Thy servants, and will not beget any but immoral, ungrateful (children)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, if Thou leavest them, they will lead Thy servants astray, and will beget none but unbelieving libertines.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Thou shouldst leave them, they will mislead Thy slaves and will beget none save lewd ingrates.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "if You leave any, they will misguide Your servants, and they will beget none but sinners and deniers of truth --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily if Thou shouldst leave them, they Will mislead Thine bondmen and will beget not save sinning infidels,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If You leave them, they will lead astray Your servants, and will beget none except vicious ingrates.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For, if Thou dost leave (any of) them, they will but mislead Thy devotees, and they will breed none but wicked ungrateful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If You leave them, they will mislead Your slaves, and they will beget none but wicked disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, if You leave them they will mislead Your worshipers and father none but the immoral, and unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If You leave them, they will mislead your servants, and will breed only wicked unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, if You leave them, they will mislead Your servants and not beget except [every] wicked one and [confirmed] disbeliever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[71:27] Assuredly if You leave them, they will lead Your servants astray, and will beget only disbelieving profligates (fājir and kaffār derive [respectively] from yafjuru and yakfuru): he said this on account of the mentioned revelation that had been given to him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "If Thou shouldst leave them, they will mislead Thy slaves) they will mislead from Your religion those who believe in You and those who wish to believe in You, (and will beget none save lewd ingrates) and will not beget save offspring who are sinful and disbelievers when they reach the age of reason; and it is also said this means: save those upon whom You have decreed disbelief and lewdness when they reach the age of reason; and it is also said that they did not have among them any children because Allah stopped their women from conceiving, and thus they had only adults amongst them, and the latter were all lewd disbelievers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إنك إن تذرهم يضلوا عبادك ولا يلدوا إلاَّ فاجراً كفّاراً } ملّ عن دعوة قومه وضجر واستولى عليه الغضب ودعا ربّه لتدمير قومه وقهرهم وحكم بظاهر الحال أن المحجوب الذي غلب عليه الكفر لا يلد إلا مثله\n فإن النطفة التي تنشأ من النفس الخبيثة المحجوبة وتتربى بهيئتها المظلمة لا تقبل إلا نفساً مثلها\n كالبذر الذي لا ينبت إلا من صنفه وسنخه\n وغفل أن الولد سر أبيه\n أي: حاله الغالبة على الباطن فربما كان الكافر باقي الاستعداد\n صافي الفطرة\n نقيّ الأصل بحسب الاستعداد الفطري وقد استولى على ظاهره العادة ودين آبائه وقومه الذين نشأ هو بينهم فدان بدينهم ظاهراً وقد سلم باطنه فيلد المؤمن على حاله النورية كولادة أبي إبراهيم إياه فلا جرم تولد من تلك الهيئة الغضبية الظلمانية التي غلبت على باطنه وحجبته في تلك الحالة عما قال مادة ابنه كنعان\n فكان عقوبة لذنب حاله\n { ربّ اغفر لي } أي: استرني بنورك بالفناء في التوحيد ولروحي ونفسي اللذين هما أبوا القلب { ولمن دخل بيتي } أي: مقامي في حضرة القدس { مؤمناً } بالتوحيد العلمي ولأزواج الذين آمنوا بي",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّكَ } يا ذا الحكمة المتقنة البالغة { إِن تَذَرْهُمْ } على الأرض على ما كانوا { يُضِلُّواْ عِبَادَكَ } المؤمنين بك\n المصدقين بفردانيتك ووحدانيتك { وَلاَ يَلِدُوۤاْ } ولا يتناسلوا { إِلاَّ فَاجِراً } خارجاً عن مقتضى الحدود الإلهية الموضوعة\n لحفظ العدالة { كَفَّاراً } [نوح: 27] ستاراً للحق بترويج الباطل عليه\n إنما دعا عليهم بهذا بعدما جربهم ألف سنة إلاَّ خمسين سنة\n فعرف منهم جميع خصائلهم المذمومة\n\n\nثمَّ ناجى ربه لنفسه ولوالديه\n ولمن اهتدى بهدايته وإرشاده فقال: { رَّبِّ } يا من ربَّاني بمقتضى كرمك وجودك لحكمة معرفتك وتوحيدك { ٱغْفِرْ لِي } بفضلك وإحسانك { وَلِوَالِدَيَّ } - اسم أبيه: لمك بن متوشلخ\n واسم أمه: شمخا بنت أنوش - وكانا مؤمنين موحدين { وَ } اغفر أيضاً بفضلك { لِمَن دَخَلَ بَيْتِيَ } سفينتي وحرزي",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنك إِن تَذَرْهُم } ولا تهلكهم { يُضلُّوا عبادك } عن طريق الحق\n يدعوهم إلى الضلال\n { ولا يلدوا إِلاَّ فاجراً كفاراً } أي: إلاّ مَن إذا بلغ جحد وكفر\n وإنما قال ذلك لاستحكام علمه بما يكون منهم ومن أعقابهم\n بعدما خبرهم واستقرأ أحوالهم قريباً من ألف سنة\n أو: يكون بعد إخباره تعالى له بقوله:\n[هود:36]\n { رَبِّ اغفر لي ولوالدي } وكانا مسلمَين\n واسم أبيه: لَمَك بن مُتَوشْلح\n واسم أمه: شمخاء بنت أنوش\n وقيل: المراد: آدم وحواء\n قال ابن عباس: لم يكفر بنوح والد بينه وبين آدم عليه السلام\n وقُرىء: \" ولولديّ \" يريد ساماً وحاماً\n { ولِمَنْ دَخَلَ بيتي } أي: منزلي\n أو مسجدي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "80:42",
      "similarity": 0.6652642051577469
    },
    {
      "verse": "89:1",
      "similarity": 0.652419047240319
    },
    {
      "verse": "82:3",
      "similarity": 0.5496290898134568
    },
    {
      "verse": "75:5",
      "similarity": 0.5417351988849571
    },
    {
      "verse": "76:6",
      "similarity": 0.525174793696982
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/71:27.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/71:27.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/71:27.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}