{
  "chapter": "نوح",
  "text": "رب اغفر لى ولولدى ولمن دخل بيتى مؤمنا وللمؤمنين والمؤمنت ولا تزد الظلمين الا تبارۢا",
  "translations": [
    {
      "translation": "My Lord! forgive me and my parents and all who enter my house as muminun, and all the men and women of the muminun. But do not increase the wrongdoers except in ruin!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Lord, forgive me, my parents, and any one who enters my house as a believer, and all believing men and women, and do not give the evil-doers increase save in ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord, forgive me and my parents, and whoever enters my house as a believer, and forgive all believers, both men and women, and do not increase the wrong-doers in anything except perdition.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord, forgive me, my parents, the believers who have entered my home and all believing men and women. Give nothing to the unjust but destruction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“O my Lord! Forgive me, and my parents, and the believers who are in my house, and all other Muslim men and Muslim women; and do not increase anything for the unjust except ruin.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! Forgive me, and my parents, and him who enters my home as a believer, and all the believing men and women. And to the wrongdoers grant You no increase but destruction!\") Allah says,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! forgive me and my parents and him who enters my house believing, and the believing men and the believing women; and do not increase the unjust in aught but destruction!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord, forgive me and my parents and whosoever enters my house as a believer, and the believers, men and women alike; and do Thou not increase the evildoers save in ruin!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! Forgive me and my parents and him who entereth my house believing, and believing men and believing women, and increase not the wrong-doers in aught save ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord! Forgive me and my parents and every true believer who enters my house, forgive all the believing men and believing women; and bestow no increase upon the wrongdoers except in ruin?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! forgive me and my parents and him who entereth my house as a believer, and believing men and believing women, and increase not the wrong-doers in aught save ruin!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! Forgive me and my parents, and whoever enters my house in faith, and the faithful men and women, and do not increase the wrongdoers in anything but ruin.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O my Lord! Forgive me, my parents, all who enter my house in Faith, and (all) believing men and believing women: and to the wrong-doers grant Thou no increase but in perdition!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! Forgive me, and my parents, and him who enters my home as a believer, and all the believing men and women. And to the Zalimun (polytheists, wrong-doers, and disbelievers, etc.) grant You no increase but destruction!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forgive me, My Lord, and my parents, and whosoever seeks refuge in my house as a believer, and the believers men and women alike, and do not increase the harmdoers except in ruin'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord! Forgive me and my parents, and anyone who enters my home in faith, and all the believing men and believing women; and do not increase the wrongdoers except in perdition.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Lord, forgive me and my parents and whoever enters my house a believer and the believing men and believing women. And do not increase the wrongdoers except in destruction.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[71:28] My Lord, forgive me and my parents — both of whom were believers — and whoever enters my house, my dwelling or my place of worship, as a believer, and believing men and believing women, to the Day of Resurrection, and do not increase the evildoers except in ruin’, in destruction — and thus they were destroyed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(My Lord!) my Lord! (Forgive me and my parents) and forgive my believing parents (and him who entereth my house) my religion; and it is also said: my mosque; and it is also said: my ship (believing, and believing men and believing women) who are true in their faith and who will come after me, (and increase not the wrong-doers) the disbelieving idolaters (in aught save ruin) loss and destruction, like the destruction of those people whose Prophet received the revelation but refused to believe in him'. And of the surah in which the jinn are mentioned, which is all Meccan and consists of 28 verses, 285 words and 870 letters: Surah 72: The Jinn (al- Jinn) And of the surah in which the jinn are mentioned, which is all Meccan and consists of 28 verses, 285 words and 870 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِناً } معناه مَسجدي\n\n\n\n\nوقوله تعالى: { وَلاَ تَزِدِ ٱلظَّالِمِينَ إِلاَّ تَبَاراً } معناه هَلاكٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, \"And whoever enters my house as a believer\" means my mosque.\n {And do not let the oppressors add to anything except destruction.} Its meaning is destruction.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n أي: ونفوسهم فبلغهم إلى مقام الفناء في التوحيد { ولا تزد الظالمين } الذين نقصوا حظهم بالاحتجاب بظلمة نفوسهم عن عالم النور { إلاَّ تباراً } هلاكاً بالغرق في بحر الهيولى وشدّة الاحتجاب\n والله تعالى أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n أو ديني ومذهبي { مُؤْمِناً } موقناً بإرشادي وتكميلي { وَلِلْمُؤْمِنِينَ وَٱلْمُؤْمِنَاتِ } من الأمم السابقة واللاحقة إلى يوم القيامة { وَلاَ تَزِدِ ٱلظَّالِمِينَ } الخارجين عن عروة عبوديتك\n وربقة رقيتك { إِلاَّ تَبَاراً } [نوح: 28] إهلاكاً وخسارا\n عذاباً وبواراً\n\nونحن ندعو أيضاً على الكافرين المصرين بكفرهم وشركهم\n الظاهرين على أهل التوحيد بأنواع الجدال والمراء بما دعا به نوح عليه السلام ونرجو أيضاً أن نكون من الناجين ببركة دعائه\n ودعاء نبينا صلى الله عليه وسلم\n\n\nخاتمة السورة\n\nعليك أيها الموحد المحمدي\n الداخل في سفينة الشريعة المصطفوية المنجية لنفسك عن طوفان القوى البشرية\n وطغيان اللذة البهيمية المانعة عن التلذذ باللذات المعنوية الروحانية أن تتشبث بذيل همَّة المرشد الكامل\n المكمل الذي يرشدك إلى سرائر الشريعة وحكم الأحكام الموردة فيها\n مصالح الأوامر والنواهي بإرادة صادقة\n وعزيمة خالصة عن شوب الرياء والرعونات العائقة عن الميل الفطري\n والفطنة الجبلية التي جبل الناس عليها\n إذا خلى طبعه بلا تصرف من شياطين الوهم والخيال\n وجنود الأمارة على مقتضى القوى\n\n\nوفقنا الله لما يجب ويرضى\n وجنبنا عن إلميل إلى البدع والهوى",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n أو سفينتي { مؤمناً } \n ولعله قد علم أنَّ مَن دخل بيته مؤمناً لا يعد إلى الكفر\n وبهذا القيد خرجت امرأته وابنه كنعان\n ولم يجزم عليه السلام بخروجه إلاَّ بعدما قيل له:\n[هود:46]\n { وللمؤمنين والمؤمنات } إلى يوم القيامة\n خصَّ أولاً مَن يتصل به لأنهم أولى وأحق بدعائه\n ثم عمَّم\n { ولا تزد الظالمين } أي: الكافرين { إلاَّ تباراً } إهلاكاً\n قال ابن عباس رضي الله عنه: دعا نوح عليه السلام بدعوتين\n إحداهما: للمؤمنين بالمغفرة\n وأخرى على الكفارين بالتبار\n فاستجيب على الكافرين\n فاستحال ألاَّ تُجاب دعوته في حق المؤمنين\n واختلف في صبيانهم: هل أُغرقوا؟ فقيل: أعقم اللهُ أرحامَ نسائهم قبل الطوفان بأربعين سنة\n فلم يكن منهم صبي حين أُغرقوا\n وقيل: أهلك أطفالهم بغير عذاب\n ثم أغرق كبارهم\n وقيل: غرقوا معهم كما غرق سائر الحيوانات\n وهو المشهور لأنّ المصيبة تعم\n ثم يُبعثون على نياتهم\n\nوالله تعالى أعلم\n الإشارة: وقال نوحُ الروح\n أي: شكت الروح إلى ربها\n وقالت: إنَّ النفس وجنودها عَصَوني\n واتبعوا حال المنهمكين في الدنيا\n الفانين في أموالهم وأولادهم\n فلم يزدهم ذلك إلاّ خساراً\n ومكروا بي\n حيث راموا مني الميل إليهم\n مكراً كُبَّاراً\n وقالوا: لا تَذَرُنَّ آلهتكم من الدنانير والدراهم\n ولا تَذَرُنَّ ود الدنيا ومحبتها\n ولا سُواع الهوى والحظوظ\n ولا يغوث الرياسة والجاه\n ولا يَعوق العلائق والشواغل\n ولا طيور الهواجس والخواطر\n يعني: لا تستعملوا ما يُخرجكم عن هذه الأشياء\n مِن خرق العوائد\n والزهد\n والورع\n بل أقيموا على تنمية دنياكم\n وتوفير هواكم\n وقد أضلُّوا كثيراً ممن يقتدي بهم\n وقالت أيضاً: لا تزد الظالمين من هؤلاء إلاّ ضلالاً هلاكها وانقطاعاً\n مما خطيئاتهم أُغرقوا في بحر الدنيا\n فأُدخلوا نار القطيعة\n فلم يجدوا لهم من دون الله أنصاراً\n وقال نوح الروح أيضاً: لا تَذرْ على أرض البشرية من الكافرين من القواطع التي تقطعني عن السير بظلمتها ديّاراً ممن يدور بها\n ويُقوي حسها\n إنك إن تذرهم يدورون بها ويقطعونها عن السير\n ويُضلوا عبادك عن الوصول إليك\n ولا يلدوا منها إلاَّ خاطراً فاجراً كفّاراً\n رَبِّ اغفر لي\n خطابٌ من الروح ودعاء\n ولوالدي من العقل الكلي\n والنفس الكلي\n وهو الروح الأعظم\n ولِمن دخل بيتي\n أي: تمسّك بطريقتي\n ودخل في زمرتي\n ولأرواح المؤمنين والمؤمنات\n ولا تزد الظالين الخارجين عن طريقتي إلاَّ تباراً\n وبالله التوفيق\n وهو الهادي إلى سواء الطريق\n وصلّى الله على سيدنا محمد وآله وصحبه\n وسلّم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:39",
      "similarity": 0.8354115350430447
    },
    {
      "verse": "7:139",
      "similarity": 0.8200445949571935
    },
    {
      "verse": "17:7",
      "similarity": 0.7408802545445629
    },
    {
      "verse": "24:27",
      "similarity": 0.14689054448582406
    },
    {
      "verse": "71:21",
      "similarity": 0.14652058998903233
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/71:28.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/71:28.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/71:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}