{
  "chapter": "نوح",
  "text": "قال نوح رب انهم عصونى واتبعوا۟ من لم يزده ماله وولده الا خسارا",
  "translations": [
    {
      "translation": "Nuh said, 'My Lord, they have disobeyed me and followed those whose wealth and children have only increased them in loss.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they did not listen to me,\" Noah said, \"and followed him whose wealth and children only added to his ruin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah said: “My Lord, they did not pay heed to what I said, and followed those (nobles) whose possession of wealth and children has led them to an even greater loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah said, \"Lord, they have disobeyed me and followed those whose wealth and children will only bring about destruction for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Prayed Nooh, “O my Lord! They have disobeyed me, and they follow the one whose wealth and children increase nothing for him except ruin.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nuh said: \"My Lord! They have disobeyed me, and followed one whose wealth and children give him no increase but loss.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nuh said: My Lord! surely they have disobeyed me and followed him whose wealth and children have added to him nothing but loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah said, 'My Lord, they have rebelled against me, and followed him whose wealth and children increase him only in loss,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah said: My Lord! Lo! they have disobeyed me and followed one whose wealth and children increase him in naught save ruin;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah supplicated, \"Lord, they have disobeyed me, and followed those whose wealth and children have only added to their ruin;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nuh said. my Lord! verily they have disobeyed me and followed them whose riches and children have only increased them in loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah said, ‘My Lord! They have disobeyed me, following someone whose wealth and children only add to his loss,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah said: \"O my Lord! They have disobeyed me, but they follow (men) whose wealth and children give them no increase but only Loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nuh (Noah) said: \"My Lord! They have disobeyed me, and followed one whose wealth and children give him no increase but only loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah said: 'My Lord, they have rebelled against me and followed he whose wealth and offspring increase him only in loss,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah said, “My Lord, they have defied me, and followed him whose wealth and children increase him only in perdition.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Noah said, \"My Lord, indeed they have disobeyed me and followed him whose wealth and children will not increase him except in loss.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[71:21] Noah said, ‘My Lord, they have disobeyed me and followed, that is, the riffraff and the paupers [among them have followed], those whose wealth and children, namely, their leaders who have been blessed with such things (read wulduhu or waladuhu, ‘whose children’, the first of which is said to be the plural of walad, similar [in pattern] to khasab, khushb, or in fact [it is said to be] of the same meaning [as walad, but an alternative form] as in the case of bukhl or bakhal, ‘niggardliness’), only add to their loss, [to] their insolence and disbelief.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Noah said: My Lord!) my Lord! (They have disobeyed me) regarding repentance and faith in Allah's divine Oneness (and followed) and obeyed (one whose) abundant (wealth and children increase him in naught save ruin) in the Hereafter; this refers to the chieftains of his folk;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: كلما بالغ نوح عليه السلام في دعوتهم بالغوا في الإصرار والعناد\n وبعدما اضطر { قَالَ نُوحٌ رَّبِّ إِنَّهُمْ عَصَوْنِي } في جميع ما أمرتهم به\n وانصرفوا عني وعن دعوتي\n واستهزءوا معي { وَٱتَّبَعُواْ مَن لَّمْ يَزِدْهُ مَالُهُ وَوَلَدُهُ إِلاَّ خَسَاراً } [نوح: 21] أي: اتبعوا سادتهم ورؤساءهم المعروفين\n المشهورين بكثرة الأموال والأولاد الموجبة للثروة والجاهة عند الناس\n وإن كان أموالهم وأولادهم لم يزدهم إلاَّ خساراً وبواراً في النشأة الأخرى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { قال نوحٌ ربِّ } أي: يارب { إِنهم عَصَوْنِي } أي: داموا على عصياني فيما أمرتهم\n مع ما بلغت في إرشادهم بالعظة والتذكير\n ولمّا كان عصيانهم مستبعداً لكونه منكراً فظيعاً لأنَّ طاعة الرسول واجبة\n فأصرُّوا على عصيانه\n وعاملوه بأقبح الأحوال والأفعال\n أكّد الجملة بإنَّ\n { واتَّبعوا } أي: اتبع فقراؤهم { مَن لم يزده مالُه وولدُه إِلاَّ خساراً } \n وهم رؤساؤهم\n أي: استمروا على اتباع رؤسائهم\n الذين أبطرتهم أموالُهم\n وغرّتهم أولادُهم\n وصار ذلك سبباً لزيادة خسارهم في الآخرة\n فصاروا أسوة لهم في الخسران\n وفي وصفهم بذلك إشعار بأنهم إنما ابتعوهم لوجَاهتهم الحاصلة لهم بسبب الأموال والأولاد\n لِما شاهدوا فيهم من شبهة مصحِّحة للاتباع في الجملة\n ومَن قرأ بسكون اللام فجمع ولد\n كأسَد\n وأُسْد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:63",
      "similarity": 0.5906523602029204
    },
    {
      "verse": "20:93",
      "similarity": 0.4326374455086724
    },
    {
      "verse": "14:36",
      "similarity": 0.4171583949782209
    },
    {
      "verse": "79:21",
      "similarity": 0.38618014520823973
    },
    {
      "verse": "6:15",
      "similarity": 0.3678859307763126
    }
  ]
}