{
  "chapter": "نوح",
  "text": "مما خطيـتهم اغرقوا۟ فادخلوا۟ نارا فلم يجدوا۟ لهم من دون الله انصارا",
  "translations": [
    {
      "translation": "Because of their errors they were drowned and put into the Fire. They found no one to help them besides Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were drowned because of their habitual sinfulness, and sent to Hell, and did not find any helper other than God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so they were drowned on account of their sins, and then cast into the Fire, and did not find any other than Allah, to come forth to their help.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of their sins, they were drowned and made to enter hell. They could find no one to help them besides God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of their sins they were drowned and then put into the fire; so they did not find any supporter for themselves against Allah. (Punishment in the grave is proven by this verse.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of their sins they were drowned, then were made to enter the Fire. And they found none to help them instead of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of their wrongs they were drowned, then made to enter fire, so they did not find any helpers besides Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And because of their transgressions they were drowned, and admitted into a Fire, for they found not, apart from God, any to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of their sins they were drowned, then made to enter a Fire. And they found they had no helpers in place of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were drowned and sent to Hell for their misdeeds; they found no one to help them against God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And because of their misdeeds they were drowned, and then they were made to enter a Fire. Then they found not for themselves, beside Allah, any helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were drowned because of their iniquities, then made to enter a Fire, and they did not find any helpers for themselves besides Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of their sins they were drowned (in the flood), and were made to enter the Fire (of Punishment): and they found- in lieu of Allah- none to help them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of their sins they were drowned, then were made to enter the Fire, and they found none to help them instead of Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So because of their sins they were drowned and admitted into the Fire. They found none to help them other than Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of their wrongs, they were drowned, and were hurled into a Fire. They did not find apart from God any helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Because of their sins they were drowned and put into the Fire, and they found not for themselves besides Allah [any] helpers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[71:25] Because of (mimmā: mā indicates a relative clause) their iniquities (khatāyāhum: a variant reading has khatī’ātihim) they were drowned, by the Flood, then made to enter the Fire, with which they were punished underwater after drowning. And they did not find for themselves besides, that is to say, other than, God any helpers, to protect them against the chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Because of their sins they were drowned) by the flood in the life of the world, (then made to enter) in the Hereafter (a Fire. And they found they had no helpers in place of Allah) they had no helpers to defend them against Allah's chastisement.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه بعدما بالغ نوح عليه السلام في التضرع والمناجاة: { مِّمَّا خَطِيۤئَاتِهِمْ } أي: من أجل وفور خطيئاتهم وكثرتها { أُغْرِقُواْ } بالطوفان أولاً { فَأُدْخِلُواْ نَاراً } نوعاً من عذاب النار عقيب عذاب الطوفان في البرزخ { فَلَمْ يَجِدُواْ لَهُمْ } حين طغيانن الماء وطوافه عليهم { مِّن دُونِ ٱللَّهِ } القادر المقتدر على دفع المضار { أَنصَاراً } [نوح: 25] شفعاء من الأصنام كما زعموا، فلم ينصرهم الله فهلكوا بالغرق\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n \" وما \" مزيدة للتوكيد والتفخيم، { أُغرقوا } بالطوفان\n وتقديم \" مما \" لبيان أن إغراقهم ودخولهم النار، إنما كان لأجل خطاياهم، لا لسبب آخر، { فأُدْخِلوا ناراً } عظيمة، والمراد: إمّا عذاب القبر لأنه عقب الإغراق، أو حين كانوا في الماء، فقد رُوي أنهم كانوا يغرقون من جانب، ويُحرقون من جانب\n أو: عذاب جهنم، والتعقيب لقربه باعتبار تحقُّق وقوعه\n وتنكير \" النار \" إما لتعظيمها وتهويلها، أو لأنه تعالى أعدّ لهم نوعاً من العذاب على حسب خطيئاته، { فلم يجدوا لهم من دون اللهِ أنصاراً } ينصرونهم ويمنعونهم من عذاب الله، وفيه تعريض بعدم نفع آلهتهم، وعدم قدرتهم على نصرهم\n قيل: كان قوم نوح أهل وُسع في الزرق، فطَغوا، وكانوا يؤذون نوحاً، ويحرشون عليه ويضربونه، حتى ربما يغشى عليه، فإذا أفاق قال: \" اللهم اغفر لقومي فإنهم لا يعلمون \"\n كما في الحديث",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "69:37",
      "similarity": 0.4985087950856787
    },
    {
      "verse": "21:77",
      "similarity": 0.4805115749894808
    },
    {
      "verse": "26:66",
      "similarity": 0.4596556608138652
    },
    {
      "verse": "37:82",
      "similarity": 0.4596556608138652
    },
    {
      "verse": "29:12",
      "similarity": 0.4380560433992933
    }
  ]
}