{
  "chapter": "نوح",
  "text": "يغفر لكم من ذنوبكم ويؤخركم الى اجل مسمى ان اجل الله اذا جاء لا يؤخر لو كنتم تعلمون",
  "translations": [
    {
      "translation": "He will forgive you your wrong actions and defer you until a specified time. When Allah's time comes it cannot be deferred, if you only knew.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may forgive some of your sins and prolong your term till an appointed time. Surely when God's appointed time is come it will not be put off, if only you knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will forgive your sins and will grant you respite until an appointed term. Indeed when Allah's appointed term comes, it cannot be deferred; if you only knew!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will forgive your sins and give you a respite for an appointed time. When the time which God has appointed arrives, none will be able to postpone it. Would that you knew this!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“He will forgive you some of your sins, and give you respite up to an appointed term; indeed the promise of Allah cannot be averted when it arrives; if only you knew.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will forgive you of your sins and respite you to an appointed term. Verily, the term of Allah when it comes, cannot be delayed, if you but know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will forgive you some of your faults and grant you a delay to an appointed term; surely the term of Allah when it comes is not postponed; did you but know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and He will forgive you your sins, and defer you to a stated term; God's term, when it comes, cannot be deferred, did you but know.\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may forgive you somewhat of your sins and respite you to an appointed term. Lo! the term of Allah, when it cometh, cannot be delayed, if ye but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will forgive your sins and will grant you respite till an appointed time. When the time appointed by God arrives, it cannot be postponed, if you only knew.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will forgive you your sins, and will defer you to an appointed term. Verily the term of Allah when it cometh shall not be deferred, if ye but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that He may forgive you some of your sins and respite you until a specified time. Indeed when Allah’s [appointed] time comes, it cannot be deferred, if you know.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He may forgive you your sins and give you respite for a stated Term: for when the Term given by Allah is accomplished, it cannot be put forward: if ye only knew.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Allah) will forgive you of your sins and respite you to an appointed term. Verily, the term of Allah when it comes, cannot be delayed, if you but knew.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will forgive you your sins and respite you till an appointed term. When the term of Allah arrives it cannot be deferred; if you but knew'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He will forgive you of your sins, and reprieve you until a stated term. God’s term cannot be deferred once it has arrived, if you only knew.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will forgive you of your sins and delay you for a specified term. Indeed, the time [set by] Allah, when it comes, will not be delayed, if you only knew.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[71:4] that He may forgive you some of your sins (min dhunūbikum, ‘some of your sins’: min may be taken as extra, because submission to God (islām) expunges everything [of sin that was committed] previous to it; or it [min] may be understood as partitive, to point out that which is due to [those who were already God’s] servants) and defer you, without chastising [you], until an appointed term, the term for death. Indeed when   God’s term, for your chastisement — should you not believe — comes, it cannot be deferred, if only you knew’, this, you would believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيَغْفِرْ لَكُمْ مِنْ ذُنُوبِكُمْ وَيُؤَخِّرْكُمْ إِلَى أَجَلٍ مُسَمًّى إِنَّ أَجَلَ اللَّهِ إِذَا جَاءَ لَا يُؤَخَّرُ لَوْ كُنْتُمْ تَعْلَمُونَ (4)، فقوله : { يغفر لكم من ذنوبكم } ينصرف بادىء ذي بدء إلى ذنوب الإِشراك اعتقاداً وسجوداً .وجَزْمُ { يغفر لكم من ذنوبكم } في جواب الأوامر الثلاثة { اعبدوا الله واتقوه وأطيعون } ، أي إن تفعلوا ذلك يغفر الله لكم من ذنوبكم . وهذا وعد بخير الآخرة .وحرف { مِن } زائد للتوكيد ، وهذا من زيادة { مِن } في الإيجاب على رأي كثير من أيمة النحو مثل الأخفش وأبي علي الفارسي وابن جنيّ من البصريين وهو قول الكسائي وجميععِ نحاة الكوفة . فيفيد أن الإيمان يَجُبُّ ما قبله في شريعة نوح مثل شريعة الإِسلام .ويجوز أن تكون { مِن } للتبعيض ، عند من أثبت ذلك وهو اختيار التفتزاني ، أي يغفر لكم بعض ذنوبكم ، أي ذنوب الإِشراك وما معه ، فيكون الإيمان في شرع نوح لا يقتضي مغفرة جميع الذنوب السابقة ، وليس يلزم تماثل الشرائع في جميع الأحكام الفرعية ، ومغفرةُ الذنوب من تفاريع الدين وليست من أصوله . وقال ابن عطية : معنى التبعيض : مغفرة الذنوب السابقة دون ما يذنبون من بعد . وهذا يتم ويحسن إذا قدرنا أن شريعة نوح تشتمل على أوامر ومنهيات عملية فيكون ذكر { مِن } التبعيضية اقتصاداً في الكلام بالقدر المحقق .وأما قوله : { ويؤخركم إلى أجل مسمى } فهو وعد بخير دنيوي يستوي الناس في رغبته ، وهو طول البقاء فإنه من النعم العظيمة لأن في جبلة الإِنسان حُب البقاء في الحياة على ما في الحياة من عوارضَ ومكدرات . وهذا ناموس جعله الله تعالى في جبلة الإِنسان لتجري أعمال الناس على ما يعين على حفظ النوع . قال المعري :وكلّ يريدُ العيشَ والعيشُ حَتفُه ويستعْذِبُ اللذاتتِ وهي سِمَام ... والتأخيرُ : ضد التعجيل ، وقد أطلق التأخير على التمديد والتوسيع في أجل الشيء .وقد أشعر وعدُه إياهم بالتأخير أنه تأخير مجموعهم ، أي مجموع قومه لأنه جُعل جزاءً لكل من عَبدَ الله منهم واتقاه وأطاع الرسول ، فدل على أنه أنذرهم في خلال ذلك باستئصال القوم كلهم ، وأنهم كانوا على علم بذلك كما أشار إليه قوله : { أن أنذر قومك من قبل أن يأتيهم عذاب أليم } \\[ نوح : 1 \\] كما تقدم آنفاً ، وكما يفسره قوله تعالى في سورة هود ( 38 ) { ويصنَعُ الفلك وكلَّما مرّ عليه ملأ من قومه سَخِروا منه } أي سخروا من الأمر الذي يصنع الفلك للوقاية منه وهو أمر الطوفان ، فتعين أن التأخير المراد هنا هو عدم استئصالهم . والمعنى : ويؤخر القوم كلهم إلى أجل مسمى وهو آجال إشخاصهم وهي متفاوتة .والأجل المسمى : هو الأجل المعين بتقدير الله عند خلقةِ كل أحد منهم ، فالتنوين في { أجل } للنوعية ، أي الجنس ، وهو صادق على آجال متعددة بعدد أصحابها كما قال تعالى :{ ومنكم من يتوفى ومنكم من يُرَدّ إلى أرذل العمر } \\[ الحج : 5 \\] .ومعنى { مسمى } أنه محدد معيّن وهو ما في قوله تعالى : { وأجل مسمى عنده } في سورة الأنعام ( 2 ) .فالأجل المسمى : هو عمر كل واحد ، المعيّنُ له في سَاعةِ خلْقه المشار إليه في الحديث أن المَلَك يؤمر بكتب أجل المخلوق عندما يَنفُخ فيه الروحَ ، واستعيرت التسمية للتعيين لشَبه عدم الاختلاط بين أصحاب الآجال .والمعنى : ويؤخركم فلا يعجل بإهلاككم جميعاً فيؤخر كل أحد إلى أجله المعيّن له على تفاوت آجالهم .فمعنى هذه الآية نظير معنى آية سورة هود ( 3 ) { وأن استغفروا ربكم ثم توبوا إليه يمتّعْكم متاعاً حسناً إلى أجللٍ مسمّى } وهي على لسان محمد صلى الله عليه وسلم .{ إِنَّ أَجَلَ الله إِذَا جَآءَ لاَ يُؤَخَّرُ لَوْ كُنتُمْ } .يحتمل أن تكون هذه الجملة تعليلاً لقوله : { ويؤخرْكم إلى أجل مسمى ، } أي تعليلاً للربط الذي بين الأمر وجزائه من قوله : { أن اعبدوا الله } إلى قوله : { ويؤخِّركم } الخ لأن الربط بين الأمْر وجوابِه يعطي بمفهومه معنى : إِنْ لا تعبدوا الله ولا تتقوه ولا تطيعوني لا يغفر لكم ولا يؤخركم إلى أجل مسمى ، فعُلل هذا الربط والتلازم بين هذا الشرط المقدر وبين جزائه بجملة { إنّ أجل الله إذا جاء لا يؤخر } ، أي أن الوقت الذي عيّنه الله لحلول العذاب بكم إن لم تعبدوه ولم تطيعون إذا جاء إِبَّانه باستمراركم على الشرك لا ينفعكم الإِيمان ساعتئذٍ ، كما قال تعالى : { فلولا كانت قرية آمنت فنفعها إيمانها إلاّ قوم يونس لما ءامنوا كشفنا عنهم عذاب الخزي في الحياة الدنيا ومتعناهم إلى حين } \\[ يونس : 98 \\] ، فيكون هذا حثاً على التعجيل بعبادة الله وتقواه .فالأجَل الذي في قوله : { إن أجل الله إذا جاء لا يؤخر } غير الأجل الذي في قوله : { ويؤخركم إلى أجللٍ مسمى } ويُناسِب ذلك قولُه عقبه { لو كنتم تعلمون } المقتضي أنهم لا يعلمون هذه الحقيقة المتعلقة بآجال الأمم المعيَّنة لاستئصالهم ، وأما عدم تأخير آجال الأعمار عند حلولها فمعلوم للناس مشهور في كلام الأولين . وفي إضافة { أجل } إلى اسم الجلالة في قوله : { إن أجل الله إذا جاء لا يؤخر } إيماء إلى أنه ليس الأجل المعتاد بل هو أجل عيّنه الله للقوم إنذاراً لهم ليؤمنوا بالله . ويحتمل أن تكون الجملة استئنافاً بيانياً ناشئاً عن تحديد غاية تأخيرهم إلى أجل مسمى ، أي دون تأخيرهم تأخيراً مستمراً فيسأل السامع في نفسه عن علة تنهية تأخيرهم بأجل آخر فيكون أجل الله غير الأجل الذي في قوله : { إلى أجل مسمى } .ويحتمل أن تكون الجملة تعليلاً لكلا الأجلين : الأجل المفاد من قوله : { من قبل أن يَأتيهُم عذابٌ أليم } \\[ نوح : 1 \\] فإن لفظ { قبل } يؤذن بأن العذاب موقت بوقت غير بعيد فله أجل مُبْهم غير بعيد ، والأجَل المذكورِ بقوله : { ويؤخركم إلى أجل مسمى } فيكون أجل الله صادقاً على الأجل المسمى وهو أجل كل نفس من القوم .وإضافته إلى الله إضافة كشف ، أي الأجل الذي عينه الله وقدره لكل أحد .وبهذا تعلم أنه لا تعارض بين قوله : { ويؤخركم إلى أجل مسمى } وبين قوله : { إن أجل الله إذا جاء لا يؤخر } إما لاختلاف المراد بلفظيّ ( الأجل ) في قوله : { إلى أجل مسمى } وقوله : { إن أجل الله إذا جاء لا يؤخر ، } وإما لاختلاف معنيي المجيء ومعنيي التأخير في قوله : { إذا جاءَ لا يؤخر } فانفكت جهة التعارض .أما مسألة تأخير الآجال والزيادة في الأعمار والنقص منها وتوحيد الأجل عندنا واضطراب أقوال المعتزلة في هل للإِنسان أجل واحد أو أجلان فتلك قضية أخرى ترتبط بأصلين : أصل العلم الإلهي بما سيكون ، وأصل تقدير الله للأسباب وترتُّب مسبباتها عليها .فأما ما في علم الله فلا يتغير قال تعالى : { وما يعمَّر من معمَّر ولا يُنقص من عمره إلاّ في كتاب } \\[ فاطر : 11 \\] أي في علم الله ، والناس لا يطلعون على ما في علم الله .وأما وجودُ الأسباب كلها كأسباب الحياة ، وترتبُ مسبباتها عليها فيتغير بإيجاد الله مغيِّراتتٍ لم تكن موجودة إكراماً لبعض عباده أو إهانة لبعض آخر . وفي الحديث صدقة المرء المُسلم تزيد في العُمر . وهو حديث حسن مقبول . وعن علي عن النبي صلى الله عليه وسلم من سره أن يُمد في عمره فليتق الله وليصِل رحمه . وسنده جيد . فآجال الأعمار المحددة بالزمان أو بمقدار قوة الأعضاء وتناسب حركاتها قابلة للزيادة والنقص . وآجال العقوبات الإلهية المحددة بحصول الأعمال المعاقب عليها بوقت قصير أو فيه مُهلة غير قابلة للتأخير وهي ما صْدَقُ قوله : { إن أجل الله إذا جاء لا يؤخر } وقد قال الله تعالى : { يمحو الله ما يشاء ويثبت وعنده أم الكتاب } \\[ الرعد : 39 \\] على أظهر التأويلات فيه وما في علم الله من ذلك لا يخالف ما يحصل في الخارج .فالذي رغَّب نوحٌ قومَه فيه هو سبب تأخير آجالهم عند الله فلو فعلوه تأخرتْ آجالهم وبتأخيرها يتبين أن قد تقرر في علم الله أنهم يعملون ما يدعوهم إليه نوح وأن آجالهم تطول ، وإذ لم يفعلوه فقد كُشف للناس أن الله علم إنهم لا يفعلون ما دعاهم إليه نوح وأن الله قاطع آجالهم ، وقد أشار إلى هذا المعنى قول النبي صلى الله عليه وسلم « اعملُوا فكل مُيسَّر إلى ما خُلق له » وقد استعصى فهم هذا على كثير من الناس فخلطوا بين ما هو مقرر في علم الله وما أظهره قدر الله في الخارج الوجودي .وفي إقحام فعل { كنتم } قبل { تعلمون } إيذان بأن علمهم بذلك المنتفيَ لوقوعه شرطاً لحرف { لو } محقق انتفاؤه كما بيناه في قوله تعالى : { أكان للناس عجباً أن أوحينا إلى رجل منهم } في سورة يونس ( 2 ) .وجواب لو } محذوف دل عليه قوله : { لا يؤخَّر } . والتقدير : لأيقنتم أنه لا يؤخر .\n\n",
      "translations": [
        {
          "translation": "696 (That He may forgive you somewhat of your sins) He will forgive your sins through your repentance and belief in Allah's divine Oneness (and respite you) without sending a punishment on you (to an appointed term) until you die. (Lo! the term of Allah) the torment of Allah, (when it cometh, cannot be delayed, if ye but knew) if you believe in what I say to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَغْفِرْ لَكُمْ } سبحاه { مِّن ذُنُوبِكُمْ } إن استغفرتم منه سبحانه\n وتبتم إليه مخلصين نادمين { وَيُؤَخِّرْكُمْ إِلَىٰ } أقصى { أَجَلٍ مُّسَمًّى } مقدر عنده سبحانه بشرط أن تتصفوا بالإيمان والعمل الصالح { إِنَّ أَجَلَ ٱللَّهِ } المقدر لآجال عباده على مقتضى الحكمة المتقنة { إِذَا جَآءَ } على الوجه المقدر المقرر عنده { لاَ يُؤَخَّرُ } عن وقته\n ولا يقدم عليه { لَوْ كُنتُمْ تَعْلَمُونَ } [نوح: 4] وتعتقدون حكمة الحكيم\n وكمال قدرته ومشيئته لعلمتم يقيناً أن الأجل المقدر لا يُبدل ولا يُغير\n\n\nوبعدما بالغ نوح عليه السلام في دعوتهم وإرشادهم فلم يهتدوا\n بل ما زادوا إلاَّ إصراراً وإضراراً",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يغفرْ لكم من ذنوبكم } أي: بعض ذنوبكم وهو ما سلف في الجاهلية\n فإنَّ الإسلام يَجُبُّه\n إلاّ حقوق العباد فإنه يؤديها\n وقيل: \" مَن \" لبيان الجنس\n كقوله:\n[الحج:30]\n قال ابن عطية: وكونها للتبعيض أبين لكونه لو قال: يغفر لكم ذنوبكم لعَمّ هذا اللفظ ما تقدّم به من الذنوب وما تأخر عن إيمانهم\n والإسلام إنما يَجُب ما قبله\n هـ\n قال القشيري: ولأنه لو أخبرهم بغفران ما تقدّم وما تأخّر لكان إغراءً لهم\n وذلك لا يجوز\n هـ\n { ويُؤخِّرْكُم إِلى أَجَلٍ مُسَمَّى } وهو وقت موتكم\n فتموتون عند انقضاء آجالكم الذي تعرفونه من غير غرق ولا هلاك استئصال\n فإن لم تؤمنوا عاجَلَكم بالعذاب\n فيكون هو آجالكم\n ولمّا كان ربما يتوهم أنَّ الأجل قد يتقدّم\n رَفَعَه بقوله: { إنَّ أَجَلَ اللهِ } وهو الموت عند تمام الأجل { إِذا جاء لا يُؤخَّرُ لو كنتم تعلمون } أي: لو كنتم تعلمون لسارعتم إلى الإيمان قبل مجيئه\n فلا حُجة فيه للمعتزلة\n وانظر ابن جزي\n الإشارة: قال القشيري: إنَّا أرسلنا الروح إلى قومه\n وهم: النفس والهوى وصفاتهم الظلمانية الطبيعية أن أنذرهم عن المخالفة الشرعية\n مِن قبل أن يأتيهم عذاب القطيعة\n قال: يا قوم إني لكم نذير بيِّن الإنذار\n أن اعبُدوا الله\n بأن تُحبوه وحده\n ولا تُحبُّوا معه غيره\n من الدنيا\n وشهواتها وزخارفها\n واتقوا بأن لا تروا معه سواه\n وأطيعوني في أقوالي وأفعالي وأخلاقي وصفاتي\n يغفر لكم ذنوب وجودكم\n فيُغطيه بنور وجوده\n ويُؤخركم إلى أجلٍ مسمى\n بتسْمية الأزل\n إنَّ أجل الله بالموت الحسي والمعنوي\n لا يُؤخَّر\n لو كنتم تعلمون\n لكن انهماككم في حب الدنيا بعّد عنكم الأجل\n هـ\n بالمعنى\n ثم أخبر عن نوح وما لقي من قومه\n فقال: { قَالَ رَبِّ إِنِّي دَعَوْتُ قَوْمِي }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:16",
      "similarity": 0.5143527347251287
    },
    {
      "verse": "3:31",
      "similarity": 0.5113995706422882
    },
    {
      "verse": "81:9",
      "similarity": 0.46863760732605036
    },
    {
      "verse": "26:14",
      "similarity": 0.441399000686616
    },
    {
      "verse": "63:11",
      "similarity": 0.43494695348690326
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/071004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/071004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/71:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}