{
  "chapter": "نوح",
  "text": "يغفر لكم من ذنوبكم ويؤخركم الى اجل مسمى ان اجل الله اذا جاء لا يؤخر لو كنتم تعلمون",
  "translations": [
    {
      "translation": "He will forgive you your wrong actions and defer you until a specified time. When Allah's time comes it cannot be deferred, if you only knew.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may forgive some of your sins and prolong your term till an appointed time. Surely when God's appointed time is come it will not be put off, if only you knew!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will forgive your sins and will grant you respite until an appointed term. Indeed when Allah's appointed term comes, it cannot be deferred; if you only knew!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will forgive your sins and give you a respite for an appointed time. When the time which God has appointed arrives, none will be able to postpone it. Would that you knew this!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“He will forgive you some of your sins, and give you respite up to an appointed term; indeed the promise of Allah cannot be averted when it arrives; if only you knew.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will forgive you of your sins and respite you to an appointed term. Verily, the term of Allah when it comes, cannot be delayed, if you but know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will forgive you some of your faults and grant you a delay to an appointed term; surely the term of Allah when it comes is not postponed; did you but know!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and He will forgive you your sins, and defer you to a stated term; God's term, when it comes, cannot be deferred, did you but know.\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may forgive you somewhat of your sins and respite you to an appointed term. Lo! the term of Allah, when it cometh, cannot be delayed, if ye but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will forgive your sins and will grant you respite till an appointed time. When the time appointed by God arrives, it cannot be postponed, if you only knew.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will forgive you your sins, and will defer you to an appointed term. Verily the term of Allah when it cometh shall not be deferred, if ye but knew.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that He may forgive you some of your sins and respite you until a specified time. Indeed when Allah’s [appointed] time comes, it cannot be deferred, if you know.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So He may forgive you your sins and give you respite for a stated Term: for when the Term given by Allah is accomplished, it cannot be put forward: if ye only knew.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Allah) will forgive you of your sins and respite you to an appointed term. Verily, the term of Allah when it comes, cannot be delayed, if you but knew.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will forgive you your sins and respite you till an appointed term. When the term of Allah arrives it cannot be deferred; if you but knew'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He will forgive you of your sins, and reprieve you until a stated term. God’s term cannot be deferred once it has arrived, if you only knew.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will forgive you of your sins and delay you for a specified term. Indeed, the time [set by] Allah, when it comes, will not be delayed, if you only knew.' \"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[71:4] that He may forgive you some of your sins (min dhunūbikum, ‘some of your sins’: min may be taken as extra, because submission to God (islām) expunges everything [of sin that was committed] previous to it; or it [min] may be understood as partitive, to point out that which is due to [those who were already God’s] servants) and defer you, without chastising [you], until an appointed term, the term for death. Indeed when   God’s term, for your chastisement — should you not believe — comes, it cannot be deferred, if only you knew’, this, you would believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "696 (That He may forgive you somewhat of your sins) He will forgive your sins through your repentance and belief in Allah's divine Oneness (and respite you) without sending a punishment on you (to an appointed term) until you die. (Lo! the term of Allah) the torment of Allah, (when it cometh, cannot be delayed, if ye but knew) if you believe in what I say to you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَغْفِرْ لَكُمْ } سبحاه { مِّن ذُنُوبِكُمْ } إن استغفرتم منه سبحانه، وتبتم إليه مخلصين نادمين { وَيُؤَخِّرْكُمْ إِلَىٰ } أقصى { أَجَلٍ مُّسَمًّى } مقدر عنده سبحانه بشرط أن تتصفوا بالإيمان والعمل الصالح { إِنَّ أَجَلَ ٱللَّهِ } المقدر لآجال عباده على مقتضى الحكمة المتقنة { إِذَا جَآءَ } على الوجه المقدر المقرر عنده { لاَ يُؤَخَّرُ } عن وقته، ولا يقدم عليه { لَوْ كُنتُمْ تَعْلَمُونَ } [نوح: 4] وتعتقدون حكمة الحكيم، وكمال قدرته ومشيئته لعلمتم يقيناً أن الأجل المقدر لا يُبدل ولا يُغير\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يغفرْ لكم من ذنوبكم } أي: بعض ذنوبكم وهو ما سلف في الجاهلية، فإنَّ الإسلام يَجُبُّه، إلاّ حقوق العباد فإنه يؤديها، وقيل: \" مَن \" لبيان الجنس، كقوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:16",
      "similarity": 0.5143527347251287
    },
    {
      "verse": "3:31",
      "similarity": 0.5113995706422882
    },
    {
      "verse": "81:9",
      "similarity": 0.46863760732605036
    },
    {
      "verse": "26:14",
      "similarity": 0.441399000686616
    },
    {
      "verse": "63:11",
      "similarity": 0.43494695348690326
    }
  ]
}