{
  "chapter": "نوح",
  "text": "وانى كلما دعوتهم لتغفر لهم جعلوا۟ اصبعهم فى ءاذانهم واستغشوا۟ ثيابهم واصروا۟ واستكبروا۟ استكبارا",
  "translations": [
    {
      "translation": "Indeed, every time I called them to Your forgiveness, they put their fingers in their ears, wrapped themselves up in their clothes and were overweeningly arrogant.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every time I called them that You may forgive them, they thrust their fingers into their ears, and covered themselves with their garments, and became wayward, and behaved with downright insolence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every time I called them so that You might forgive them, they thrust their fingers into their ears and wrapped up their faces with their garments and obstinately clung to their attitude, and waxed very proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evert time I invite them to Your (guidance) so that You can forgive them, they put their fingers into their ears, cover their heads with their clothes, persist in their disbelief and display extreme arrogance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And whenever I called them, so that You may forgive them, they always thrust their fingers into their ears, and covered themselves with their clothes, and remained stubborn and were extremely haughty.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, every time I called unto them that You might forgive them, they thrust their fingers into their ears, covered themselves up with their garments, and persisted, and magnified themselves in pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever I have called them that Thou mayest forgive them, they put their fingers in their ears, cover themselves with their garments, and persist and are puffed up with pride:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever I called them, that Thou mightest forgive them, they put their fingers in their ears, and wrapped them in their garments, and persisted, and waxed very proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And lo! whenever I call unto them that Thou mayst pardon them they thrust their fingers in their ears and cover themselves with their garments and persist (in their refusal) and magnify themselves in pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Every time I have called to them, so that You might forgive them, they have only thrust their fingers into their ears, covered themselves up with their garments, grown obstinate, and given themselves up to arrogance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily so oft as I call them, that Thou mayest forgive them, they place their fingers into their ears, and wrap themselves with their garments, and persist, and are stiff-necked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed whenever I have summoned them, so that You might forgive them, they would put their fingers into their ears and draw their cloaks over their heads, and they were persistent [in their unfaith], and disdainful in [their] arrogance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every time I have called to them, that Thou mightest forgive them, they have (only) thrust their fingers into their ears, covered themselves up with their garments, grown obstinate, and given themselves up to arrogance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily! Every time I called unto them that You might forgive them, they thrust their fingers into their ears, covered themselves up with their garments, and persisted (in their refusal), and magnified themselves in pride.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Each time I called them so that You might forgive them, they thrust their fingers in their ears and wrapped themselves in their garments, and persisted becomingvery proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever I called them to Your forgiveness, they thrust their fingers into their ears, and wrapped themselves in their garments, and insisted, and became more and more arrogant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed, every time I invited them that You may forgive them, they put their fingers in their ears, covered themselves with their garments, persisted, and were arrogant with [great] arrogance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[71:7] And indeed whenever I summoned them, so that You might forgive them, they put their fingers in their ears, in order not to hear what I say, and draw their cloaks over themselves, they cover their heads with them in order not to catch sight of me, and they persist, in their disbelief, and act in great arrogance, disdaining faith.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And lo! Whenever I call unto them) to repentance and belief in Allah's divine Oneness (that Thou mayst pardon them) through their repentance and faith in Allah's divine Oneness (they thrust their fingers in their ears) so as not to hear my words and invitation (and cover themselves with their garments) and cover their heads with their garments so that they do not hear my voice or see me (and persist (in their refusal)) and they remain firm in their disbelief and worship of idols; it is also said that they all shouted in unison: \"0 Noah! We will not believe in you\", (and magnify themselves in pride) and feel too proud to accept faith or repent, because of their arrogance.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قالَ: حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { جَعَلُوۤاْ أَصَابِعَهُمْ فِيۤ آذَانِهِمْ وَٱسْتَغْشَوْاْ ثِيَابَهُمْ } معناه غَطُّوا بهَا رُءوسَهُمْ\n\n\n\n\nوقوله تعالى: { وَأَصَرُّواْ وَٱسْتَكْبَرُواْ ٱسْتِكْبَاراً } وأصروا: معناه وأقاموا عليه واستكبروا: معناه تعظموا وتجبروا\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\n{He} said: {We} were told by {Ali ibn Ahmad}\n\n\nHe said: It was narrated to us by 'Ata' ibn al-Sa'ib from Abu Khalid from Zayd ibn 'Ali, may Allah be pleased with them both, regarding the statement of Allah, Most High, {They make their fingers into their ears to keep out the thunderclaps}, meaning that they cover their heads with them.\n\n\nAnd they persisted in their rebellion and arrogance, refusing to submit.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بل { ٱسْتَغْشَوْاْ } أي: غطوا ولفوا على رءوسهم { ثِيَابَهُمْ } لئلا يروا صورتي\n ولا يسمعوا قولي من شدة كراهتهم عن دعوتي\n وشكيمتهم معي { وَ } بالجملة: { أَصَرُّواْ } على ما هم عليه كانوا { وَٱسْتَكْبَرُواْ } عليَّ { ٱسْتِكْبَاراً } [نوح: 7] عظيماً إلى حيث شتموني شتماً قبيحاً\n وضربوني ضرباً مؤلماً فجيعاً\n\n\n{ ثُمَّ } بعدما جرى منهم ما جرى { إِنِّي دَعَوْتُهُمْ } بمقتضى أمرك وحكمك إياي يا ربّ { جِهَاراً } [نوح: 8] على رءوس الملأ\n\n\n{ ثُمَّ إِنِّيۤ أَعْلَنْتُ لَهُمْ } وصرحت بدعوتهم { وَأَسْرَرْتُ لَهُمْ } أيضاً في الخلوات { إِسْرَاراً } [نوح: 9] على سبيل الكناية والإشارة\n وبالجملة: دعوتهم مرة بعد مرة\n وكرة بعد كرة في المحافظ والخلوات\n وبالصرائح والكنايات\n\n\n{ فَقُلْتُ } لهم في دعوتي إياهم: { ٱسْتَغْفِرُواْ رَبَّكُمْ } وتوبوا إليه { إِنَّهُ كَانَ غَفَّاراً } [نوح: 10] يغفر لكم ذنبوكم\n ويعفو عنكم زلاتكم\n\n\nوبعدما بالغوا في الإنكار والإصرار حبس الله عليهم القطر أربعين سنة\n وأعقم أرحام نسائهم\n فقال نوح: { ٱسْتَغْفِرُواْ رَبَّكُمْ إِنَّهُ كَانَ غَفَّاراً } [نوح: 10]",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واستَغْشوا ثيابَهُم } أي: وتغطُّوا بثيابهم لئلا يُبصروني\n كراهة النظر إلى وجه مَن ينصحهم في دين الله\n { وأصَرُّوا } أقاموا على كفرهم { واسْتَكْبَروا استكباراً } أي: تعاظموا عن إجابتي تعاظماً كبيراً\n وذِكْرُ المصدر دليل على فرط استكبارهم\n { ثم إِني دَعَوتهم جِهاراً } أي: مجاهراً\n فيكون حالاً\n أو: مصدر \" دعوت \" \n كقعد القرفصاء لأنّ الجهار أحد نوعَي الدعاء\n يعني: أظهرت الدعوة في المحافل والمجالس\n { ثم إِني أعلنتُ لهم وأَسررتُ لهم إِسراراً } أي: جَمَعْتُ لهم بين دعاء العلانية والسر\n فكنتُ أدعو كل مَن لقيت\n فرداً وجماعة\n والحاصل: أنه دعاهم ليلاً ونهاراً في السر\n ثم دعاهم جِهاراً\n ثم دعاهم في السر والعلن\n وهكذا يفعل المذكِّر في الأمر بالمعروف\n يبتدىء بالأهون فالأشد\n افتتح بالمناصحة بالسر\n فلما لم يُطيعوا ثنّى بالمجاهرة\n فلما لم تؤثر ثلّث بالجمع بين الإسرار والإعلان\n و \" ثم \" تدل على تباعد الأحوال لأنَّ الجِهار أغلظ من الإسرار\n والجمع بين الأمرين أغلظ من إفراد أحدهما\n { فقلتُ استغفِروا ربكم } بالتوبة من الكفر والمعاصي فالاستغفار: طلب المغفرة\n فإن كان المستغفِر كافراً فهو من الكفر\n وإن كان مؤمناً فهو من الذنوب\n { إِنه كان غفَّاراً } لم يزل غَفَّار الذنوب لمَن يُنيب إليه\n { يُرسل السماءَ } بالمطر { عليكم مِدراراً } كثير الدُّرور\n أي: البروز\n و \" مِفعال \" يستوي فيه المذكر والمؤنث\n { ويُمددكم بأموال وبنينَ } أي: يزدكم أمولاً وبنين على ما عندكم\n { ويجعل لكم جنات } بساتين { ويجعل لكم أنهاراً } جارية لمزارعكم وبساتينكم\n وكانوا يُحبون الأموال والأولاد\n فحرّكوا بهذا على الإيمان\n وقيل: لمّا كذّبوه بعد طول تكرار الدعوة حبس الله عنهم القطر\n وأعقم نساءهم أربعين سنة\n أو سبعين\n فوعدهم نوح أنهم إن آمنوا رزقهم الله الخِصب\n ورفع عنهم ما كانوا فيه\n وعن عمر رضي الله عنه: أنه خرج يستسقي فما زاد على الاستغفار\n فمُطر فقيل له: ما رأيناك استسقيت؟ فقال: لقد استقيت بمجاديح السماء التي لا تخطىء\n ثم قرأ الآية\n\nوفي القاموس: ومجاديح السماء: أنواؤها\n هـ\n وشكى رجلٌ إلى الحسن الجدوبة\n فقال له: استغفِر الله\n وشكى إليه آخر الفقر\n وآخر قلة النسل\n وآخر قلة غلة أرضه\n فأمرهم كلّهم بالاستغفار\n فقيل له في ذلك\n فقال: ما قلت من عندي شيئاً\n ثم تلا الآية\n { ما لكم لا ترجون لله وَقَاراً } أي: لا تخافون لله عظمةً\n قال الأخفش: الرجاء هنا: الخوف لأنّ مع الرجاء طرفاً من الخوف واليأس\n والوقار: العظمة\n وقال أبو السعود: الرجاء هنا بمعنى الاعتقاد\n وجملة ترجون: حال من ضمير المخاطبين\n و \" لله \" متعلق بمضمر\n حال من وقارا\n ولو تأخر لكان صفة له\n أي: أيُّ سبب حصل لكم حال كونكم غير معتقدين لله تعالى عظمة موجبة للتعظيم بالإيمان والطاعة\n هـ\n أو: لا تأملون له توقيراً\n أي: تعظيماً\n والمعنى: ما لكم لا تكونون على حال تأملون فيه تعظيم الله إياكم في دار الثواب\n { وقد خَلَقَكم أطواراً } في موضع الحال\n أي: ما لكم لا تؤمنون بالله\n والحال أنكم على حال منافية لِما أنتم عليه بالكلية\n وهي أنكم تعلمون أنه خلقكم أطواراً\n أي: أحوالاً مختلفة\n خَلَقَكم أولاً نُطفاً\n ثم خلقكم علقاً ثم مُضغاً\n ثم عظاماً ولحماً\n ثم إنساناً\n ثم خلقاً آخر\n وبعد ظهوره إلى هذا العالم يكون شباباً\n ثم كهلاً\n ثم شيخاً\n بالتقصير في توقير مَن هذه شؤونه من القدرة القاهرة والإحسان التام\n مع العلم بها\n مما لا يكاد يصدر عن العاقل\n والله تعالى أعلم\n الإشارة: ينبغي للداعي أن يكون على قدم أولي العزم\n لا يمل من التذكير والدعاء إلى الله\n ويكرر ذلك ليلاً ونهاراًن ولو قُوبل بالرد والإنكار\n فلأن يهدي الله به رجلاً واحداً خير له مما طلعت عليه الشمس\n وقوله تعالى: { وأصَرُّوا واستكبروا } \n قال القشيري: ويقال: لَمَّا دام إصرارهُم تَولَّدَ منه استكبارُهم\n قال تعالى:\n[الحديد:16]\n وقال الورتجبي: مَن أصرَّ على المعصية أورثه التمادي على الضلالة\n حتى يرى قبيح أفعاله مستحسناً\n فإذا رآه مستحسناً يستكبر\n ويعلو على أولياء الله\n ولا يقبل بعد ذلك نصحتهم\n قال سهل: الإصرار على الذنب يورث الاستكبار\n والاستكبار يورث الجهل\n والجهل يورث التخطي في الباطل\n وذلك يورث قساوة القلب\n وهي تورث النفاق\n والنفاق يورث الكفر\n هـ\n وقوله تعالى: { استغفِروا ربكم } قال القشيري: ليعلم العاملون أنَّ الاستغفار قَرْعُ أبوابِ النعمة\n ومَن وقعت له إلى الله حاجة فلا يَصِل إلى مرادِه إلاّ بتقديم الاستغفار\n ويقال: مَن أراد التفضُّل فعليه بالعُذْر والتنصُّل\n هـ\n وقوله: { ما لكم لا ترجون لله وقاراً } أي: ما لكم لا تعتقدون لله تعظيماً وإجلالاً\n فلا تراقبونه\n ولا تخافون سطوته\n فإنَّ المشاهدة على قدر المراقبة\n فمَن لم يُحْكِم أمر المراقبة لم يظفر بغاية المشاهدة\n وقد خلقكم أطواراً\n أي: درّج بشريتكم في أطوار مُختلفة\n وهي سبعة: النطفة\n ثم العلقة\n ثم المضغة\n ثم الجنين\n ثم الطفولية\n ثم الكهولة\n ثم الشيخوخة\n ثم يرتحل إلى دار الدوام\n وكذلك الروح لها سبعة أطوار: التوبة ثم الورع\n ثم الزهد\n ثم التوكُّل\n ثم الرضاء والتسليم\n ثم المراقبة\n ثم المشاهدة\n والله تعالى أعلم\n ولمّا نبههم إلى النظر في أنفسهم\n أمره بالنظر إلى العوالم العلوية والسفلية\n وما فيها من العجائب\n فقالِ: { أَلَمْ تَرَوْاْ كَيْفَ خَلَقَ ٱللَّهُ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:19",
      "similarity": 0.47366795448500254
    },
    {
      "verse": "3:135",
      "similarity": 0.323358895332134
    },
    {
      "verse": "45:8",
      "similarity": 0.30737229255127135
    },
    {
      "verse": "3:117",
      "similarity": 0.2905934338457694
    },
    {
      "verse": "56:46",
      "similarity": 0.22841626179277935
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/71:7.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/71:7.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/71:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}