{
  "chapter": "الجن",
  "text": "لنفتنهم فيه ومن يعرض عن ذكر ربه يسلكه عذابا صعدا",
  "translations": [
    {
      "translation": "so that We could test them by it. Whoever turns aside from the remembrance of his Lord, He will introduce him to an arduous punishment.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order to try them through it. But whoever turns away from the remembrance of his Lord, will be given increasing torment by Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that We might try them through this bounty. Whoso turns away from the remembrance of his Lord, He will cause him to suffer a grievous chastisement;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as a trial for them. God will make those who disregard the guidance from their Lord suffer increasing torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘In order to test them with it; and whoever turns away from the remembrance of his Lord – He will put him in a punishment that keeps on increasing.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We might try them thereby. And whosoever turns away from the Reminder of his Lord, He will cause him to enter in a Sa`ad torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that We might try them with respect to it; and whoever turns aside from the reminder of his Lord, He will make him enter into an afflicting chastisement:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that We might try them therein. And whosoever turns away from the Remembrance of his Lord, He will thrust him into chastisement rigorous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We may test them thereby, and whoso turneth away from the remembrance of his Lord; He will thrust him into ever-growing torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that We may test them by it -- whoever turns away from the remembrance of his Lord shall be sternly punished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We might try them there by. And whosoever turneth aside from the remembrance of his Lord, him He shall thrust into a torment vehement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that We may test them therein, and whoever turns away from the remembrance of his Lord, He will let him into an escalating punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We might try them by that (means). But if any turns away from the remembrance of his Lord, He will cause him to undergo a severe Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That We might try them thereby. And whosoever turns away from the Reminder of his Lord (i.e. this Quran, and practice not its laws and orders), He will cause him to enter in a severe torment (i.e. Hell).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and tested them with it. And whosoever turns away from his Lord's Remembrance, He will hurl him into a stern punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To test them with it. Whoever turns away from the remembrance of his Lord, He will direct him to torment ever mounting.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We might test them therein. And whoever turns away from the remembrance of his Lord He will put into arduous punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:17] so that We may try them, test them, therein, and so know, through knowledge outwardly manifested, the nature of their gratitude. And whoever turns away from the remembrance of his Lord, [from] the Qur’ān, We will admit him (naslukhu, or read [first person] yaslukhu, ‘He will admit him’) into a tortuous chastisement.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That We may test them thereby) in order that they may revert to that which I have ordained for them, (and whoso turneth away from the remembrance of his Lord) and whoever turns away from believing in the divine Oneness and Scripture of his Lord, i.e. the Qur'an-this refers to al-Walid Ibn al-Mughirah al-Makhzumi; (He will thrust him into ever growing torment) climbing a mountain of smooth stones; and it is said this means: climbing a mountain of copper in the Fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لِّنَفْتِنَهُمْ فِيهِ } أي لنَبتلِيهِمْ\n\n\n\n\nوقوله تعالى: { يَسْلُكْهُ عَذَاباً صَعَداً } معناه أشدُّ العَذابِ ويقال: الصَّعدُ: جَبلٌ في جَهنمَ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنما فعلنا معهم ذلك { لِّنَفْتِنَهُمْ } ونختبرهم { فِيهِ } أي: في التنعم والترفه، كيف يشكرون للنعم؟ وكيف يواظبون على أداء حقوق الكرم؟ ومن شكر فإنما يشكر لنفسه ويزيد عليها { وَمَن يُعْرِضْ عَن ذِكْرِ رَبِّهِ } وينصرف عن طاعته وعبادته، ويكفر بنعمه، ولم يواظب بأداء حقوق كرمه { يَسْلُكْهُ } ويدخله { عَذَاباً صَعَداً } [الجن: 17] يصعد عليه، ويعلو فوقه، وبالجملة: عذاباً شاقاً شديداً، قاهراً عليه عالياً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وذكر الماء الغَدَق لأنه سبب سعة الرزق، { لِنفتنَهم فيه } لنختبرهم فيه كيف يشكرون ما خُوِّلوا منه\n وفي الحديث القدسي يقول الله عزّ وجل:\n\n \" لَوْ أنَّ عِبادِي أطاعوني لأسْقَيتُهم المطرَ باللَّيْل، وأَطْلَعتُ عليهمُ الشمس بالنهار، ولم أًسمِعهم صوت الرعد \" \n\n، وهذا كقوله تعالى:\n\n[الأعراف:96]، وقيل: المعنى: وأن لو استقاموا على طريقة الكفر لأسقيناهم ماءً غدقاً، استدراجاً، { لِنفتنَهم فيه } فإذا لم يشكروا أهلكناهم، وهذا كقوله تعالى:\n\n[الزخرف:33] الخ\n والأول أظهر، بدليل قوله: { ومَن يُعرض عن ذكر ربه } القرآن أو التوحيد أو العبادة، { نسلكه } ندخله أو يدخله الله { عذاباً صعداً } شاقًّا صعباً، يعلو المعذّب ويغلبه ويصعد عليه، ومنه قول عمر رضي الله عنه: ما تصَعَّدني شيءٌ ما تصعّدتني خِطبة النكاح، أي: ما شقَّ عليّ\n وهو مصدر وصف به، مبالغة، فعلى قول ابن عطية أنَّ قوله تعالى: { فمَن أسلم } من مخاطبة الله لنبيه عليه السلام، فيكون قوله: { وأن لو استقاموا } من تتمة الخطاب، فلا تقدير، وإذا قلنا: هو من قول الجن، فالتقدير: وأوحي إليَّ أن لو استقاموا\n\n\n الخ\n الإشارة: تقدّم أنَّ الجن فيهم الصالحون والعارفون، إلاّ أنَّ معرفة الآدمي أكمل لاعتداله، وأما دوائر الأولياء من الأقطاب، والأوتاد، والنقباء، والنجباء، وغير ذلك، فلا تكون إلاّ من الإنس لشرفهم\n قوله تعالى: { وأنا ظننا ألن نُعجز اللهَ في الأرض\n\n\n } الخ، أي: تيقَّنا ألاّ مهرب منه، فرجعنا إليه اختباراً، فنحن ممن انقاد إليه بملاطفة الإحسان، لا بسلاسل الامتحان، { وأنَّا لمّا سمعنا الهُدى آمنا } أي: أجبنا الداعي بلا تلَعْثم ولا تردد، وكذا في كل داعٍ بعد الداعي الأكبر، فيكون السابقون في كل زمان، وهؤلاء سابِقو الجن ومقربوهم، فمَن يؤمن بربه، ويتوجه إليه، فلا يخاف نقصاً ولا ذُلاًّ، بل كمالاً وعِزًّا، من أي فريق كان، وأنّا منا المسلمون المنقادون لأحكامه تعالى، التكليفية والتعريفية، وهي الأحكام القهرية، فمَن استسلم ورَضِي فقد تحرّى رشداً، ومَن قنط وسخط كان لجهنم حطباً، وأن لو استقاموا على الطريقة المرضية بالرضا والتسليم، وترك الاختيار لأسقيناهم من خمرة الأزل، ومن ماء الحياة، ماءً غدقاً، تحيا به قلوبهم وأرواحهم، فيتنعّمون في شهود الذات الأقدس في الحياة وبعد الممات\n قال القشيري: الاستقامة تقتضي إكمالَ النعمةِ وإكساب الراحة، والإعراضُ عن الله يُجب تَنَقُّصَ النعمة ودوام العقوبة\n هـ\n وقوله: { لِنفتنهم } لنختبرهم، مَن يعرف قدرها فيشكر، أو لا يعرف قدرها فيُنكر، فيُسلب من حيث لا يشعر\n والله تعالى أعلم\n ومن جملة ما أوحي إليه صلى الله عليه وسلم قوله تعالى: { وَأَنَّ ٱلْمَسَاجِدَ لِلَّهِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:17",
      "similarity": 0.4859549578056924
    },
    {
      "verse": "15:12",
      "similarity": 0.4841244745140798
    },
    {
      "verse": "26:200",
      "similarity": 0.4841244745140798
    },
    {
      "verse": "35:10",
      "similarity": 0.3184166827572538
    },
    {
      "verse": "72:27",
      "similarity": 0.31756530365438734
    }
  ]
}