{
  "chapter": "الجن",
  "text": "وانا لما سمعنا الهدى ءامنا به فمن يؤمنۢ بربه فلا يخاف بخسا ولا رهقا",
  "translations": [
    {
      "translation": "and when we heard the guidance, we had iman in it. Anyone who has iman in his Lord need fear neither belittlement nor tyranny.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when we heard the guidance we believed in it; and he who believes in his Lord will neither fear loss nor force.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that “when we heard the teaching of the Right Way we came to believe in it; he who believes in His Lord shall have no fear of suffering loss or being subjected to any injustice”;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now that we have listened to the guidance, we believe in it. Whoever believes in his Lord does not need to fear loss or oppression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘And that when we heard the guidance, we accepted faith in it; so whoever accepts faith in his Lord, has no fear – neither of any loss nor of any injustice.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "`And indeed when we heard the Guidance, we believed therein, and whosoever believes in his Lord shall have no fear, either of a decrease in the reward of his good deeds or an increase in the punishment for his sins.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that when we heard the guidance, we believed in it; so whoever believes in his Lord, he should neither fear loss nor being overtaken (by disgrace):\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When we heard the guidance, we believed in it; and whosoever believes in his Lord, he shall fear neither paltriness nor vileness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when we heard the guidance, we believed therein, and whoso believeth in his Lord, he feareth neither loss nor oppression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When we heard the call to guidance, we believed in it. He who believes in his Lord has no fear of loss or of injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when we heard the Message of guidance, we believed therein; and whosoever believeth in his Lord, he shall fear neither diminution nor wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When we heard the [message of] guidance, we believed in it. Whoever that has faith in his Lord will fear neither privation nor oppression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And as for us, since we have listened to the Guidance, we have accepted it: and any who believes in his Lord has no fear, either of a short (account) or of any injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed when we heard the Guidance (this Quran), we believed therein (Islamic Monotheism), and whosoever believes in his Lord shall have no fear, either of a decrease in the reward of his good deeds or an increase in punishment for his sins.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When we heard the Guidance, we believed in it, and whosoever believes in his Lord shall fear neither shortage nor injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when we heard the guidance, we believed in it. Whoever believes in his Lord fears neither loss, nor burden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when we heard the guidance, we believed in it. And whoever believes in his Lord will not fear deprivation or burden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:13] And that when we heard the guidance, the Qur’ān, we believed in it. For whoever believes in his Lord (read an implied huwa, ‘he’, [before fa-lā yakhāfu]) shall fear neither loss, a diminishing of his good deeds, nor oppression, [nor] injustice, by having his evil deeds increased.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when we heard the guidance) and when we heard the recitation of the Qur'an by Muhammad (pbuh) (we believed therein) we believed in the Qur'an and Muhammad (pbuh) (and whoso believeth in his Lord, he feareth neither loss) of all his works (nor oppression) nor decrease of his works.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلاَ يَخَافُ بَخْساً وَلاَ رَهَقاً } معناه نُقصانٌ ولا سَفهٌ، ولا طُغيانٌ، ولا خَطيئةٌ، ولا إِثمٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {There is no fear for them, nor shall they grieve} means there is no loss or difficulty, no oppression or wrongdoing, and no sin.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَنَّا لَمَّا سَمِعْنَا ٱلْهُدَىٰ } أي: القرآن الموضح لطريق التوحيد { آمَنَّا بِهِ } واهتدينا بهدايته { فَمَن يُؤْمِن بِرَبِّهِ } ويوقن بوحدانيته { فَلاَ يَخَافُ } أي: فهو لا يخاف { بَخْساً } نقصاً في الجزاء والثواب { وَلاَ رَهَقاً } [الجن: 13] ذلة تذله في الدارين؛ لأن من آمن اعتدل، ولم يبخص حق أحد، ولم يذله بظلم، فكذلك لا يبخص ولا يظلم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأنَّا لمَّا سمعنا الهُدى } القرآن { آمنا به } بالقرآن، أو بالله تعالى، { فمَن يؤمن بربه فلا يخافُ } أي: فهو لا يخاف { بَخْساً } نقصاً { ولا رَهَقَا } أي: ولا ترهقه ذلة، كقوله:\n\n[يونس:26]، وفيه دليل على أنَّ العمل ليس من الإيمان، وأنَّ المؤمن لا يخلد في النار",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:15",
      "similarity": 0.5941063085710974
    },
    {
      "verse": "26:183",
      "similarity": 0.4445293853970028
    },
    {
      "verse": "72:6",
      "similarity": 0.4315511832841263
    },
    {
      "verse": "18:73",
      "similarity": 0.4104326735038733
    },
    {
      "verse": "74:17",
      "similarity": 0.40461503390870124
    }
  ]
}