{
  "chapter": "الجن",
  "text": "وانه لما قام عبد الله يدعوه كادوا۟ يكونون عليه لبدا",
  "translations": [
    {
      "translation": "When the devotee of God stood up to invoke Him (the jinns) crowded upon him (to listen).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when Allah's servant stood up to call on Him, they well-nigh swarmed him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not prostrate before anyone other than Him. When the servant of God (Muhammad) preached (his message) the jinn would all crowd around him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘And that when Allah’s bondman stood up to worship Him, the jinns had almost crowded upon him.’”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the servant of Allah stood up invoking Him in prayer they just made round him a dense crowd as if sticking one over the other.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that when the servant of Allah stood up calling upon Him, they wellnigh crowded him (to death).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the servant of God stood calling on Him, they were wellnigh upon him in swarms.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the slave of Allah stood up in prayer to Him, they crowded on him, almost stifling.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "when God's servant stood up to pray to Him, they pressed close to him in great numbers, almost stifling him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the bondman of Allah stood calling upon Him, they well nigh pressed on him stifling.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the servant of Allah rose to pray to Him, they almost crowded around him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when the Devotee of Allah stands forth to invoke Him, they just make round him a dense crowd.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It has been revealed to me that) When the slave of Allah (Muhammad SAW) stood up invoking (his Lord Allah) in prayer to Him they (the jinns) just made round him a dense crowd as if sticking one over the other (in order to listen to the Prophet's recitation).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the worshiper of Allah stood supplicating to Him, they swarmed around him (Prophet Muhammad).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the servant of God got up calling on Him, they almost fell on him in a mass.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that when the Servant of Allah stood up supplicating Him, they almost became about him a compacted mass.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:19] And that (annahu; or innahu as a new sentence, the pronoun being that of the matter) when the servant of God, the Prophet Muhammad (s), rose to invoke Him, to worship Him, at Batn Nakhla, they, that is, the jinn listening to his recitation, were almost upon him in heaps (libadan or lubadan, the plural of libda [or lubda], like felt in the way they were heaped on top of one another, crowding in their eagerness to listen to the Qur’ān).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when the slave of Allah) Muhammad (pbuh) (stood up) in Batn Nakhl (in prayer to Him) to worship 701 Allah through prayer, (they crowded on him, almost stifling) the jinn almost fell on him because of their love of the Qur'an and Muhammad (pbuh) when they heard him recite the Qur'an in Batn Nakhl.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { كَادُواْ يَكُونُونَ عَلَيْهِ لِبَداً } أي جماعاتٍ واحدُها لِبْدَةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما علمتم هذا بتعليم الله إياكم اعلموا { أَنَّهُ لَمَّا قَامَ عَبْدُ ٱللَّهِ } أي: النبي المؤيَّد من عنده سبحانه بأنواع العناية والكرامة المستلزمة لأنواع العبادة والإطاعة في المسجد الحرام المعدّ؛ لعباده العليم العلاَّم، القدوس السلام { يَدْعُوهُ } ويعبده، ويتذلل نحوه { كَادُواْ } وقاربوا مشركي الجن والإنس { يَكُونُونَ عَلَيْهِ } ويزدحمون حوله متعجبين { لِبَداً } [الجن: 19] متراكمين، كلبدة الأسد، وهو مستغرق في صلاته بلا التفات منه إليهم إلى أن أوحى إليه بما هم عليه من التعجب والتحير من أمرهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأنه } أي: ومما أوحي إليّ أن الشأن { لمَّا قام عبدُ الله } ، وهو محمد صلى الله عليه وسلم { يدعوه } يعبده في الصلاة، ويقرأ القرآن في صلاة الفجر، كما تقدم في الأحقاف، ولم يقل: نبي الله، أو رسول الله لأنَّ العبودية من أشرف الخصال، أو: لأنه لمّا كان واقعاً في كلامه صلى الله عليه وسلم عن نفسِه جيء به على ما يقتضيه التواضع، أو: لأنَّ عبادة عبد الله ليست بأمر مستبعد حتّى يجتمعوا عليه، كما قال: { كادوا } أي: كاد الجن { يكونون عليه لِبداً } جماعات متراكبين من ازدحامهم عليه، تعجُّباً مما رأوا من عبادته، واقتداء أصحابه به، أو إعجاباً مما تلي من القرآن لأنهم رأوا ما لم يروا مثله، وسمعوا ما لم يسمعوا بنظيره\n وقيل: معناه: لمَّا قام عليه السلام يعبد اللهَ وحدَه مخالفاً للمشركين، كادوا يزدحمون عليه متراكبين\n واللبدّ: جمع لبدة، وهي ما تلبّد بعضه على بعض\n وعن قتادة: تلبّدت الإنس والجن على أن يُطفئوا نوره، فأبى اللهُ إلاَّ أن يُظهره على مَن ناوأه\n قال ابن عطية: قوله تعالى: وأنه\n\n\n الخ، يحتمل أن يكون خطاباً من الله تعالى، وأن يكون إخباراً عن الجن",
      "translations": []
    }
  ]
}