{
  "chapter": "الجن",
  "text": "وانا لا ندرى اشر اريد بمن فى الارض ام اراد بهم ربهم رشدا",
  "translations": [
    {
      "translation": "We have no idea whether evil is intended for those on the earth, or whether their Lord intends them to be rightly guided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not know if this means ill for the dwellers of the earth, or their Lord wishes guidance for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that “we do not know whether evil is intended for those on the earth, or whether their Lord intends to direct them to the Right Way”;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not know whether by this arrangement God intends benefit and guidance for the people of the earth or only evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘And we do not know whether harm is intended for those on the earth, or whether their Lord intends goodness for them.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "`And we know not whether evil is intended for those on the earth, or whether their Lord intends for them guidance.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that we know not whether evil is meant for those who are on earth or whether their Lord means to bring them good:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so we know not whether evil is intended for those in the earth, or whether their Lord intends for them rectitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we know not whether harm is boded unto all who are in the earth, or whether their Lord intendeth guidance for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "we cannot tell if this bodes evil to those who dwell on earth or whether their Lord intends to guide them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we know not whether evil is boded for those who are on the earth, or whether their Lord intendeth for them a right direction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not know whether ill is intended for those who are on the earth, or whether their Lord intends good for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we understand not whether ill is intended to those on earth, or whether their Lord (really) intends to guide them to right conduct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we know not whether evil is intended for those on earth, or whether their Lord intends for them a Right Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so we do not know whether evil is intended for those on earth, or whether their Lord intends to guide them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not know whether ill is intended for those on earth, or if their Lord intends goodness for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we do not know [therefore] whether evil is intended for those on earth or whether their Lord intends for them a right course.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:10] And we do not know, by not being able to eavesdrop by stealth, whether ill is intended for those who are in the earth, or whether their Lord intends for them good.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And we know not whether) in preventing us from listening (harm is boded unto all who are in the earth, or whether their Lord intendeth guidance for them) or whether their Lord intends guidance, goodness and the correct course for them; it is also said that this means: we do not know whether evil is intended for the people of the earth by the advent of Muhammad (pbuh) such that if they do not believe in him they will be destroyed or it is good, guidance and the correct course that their Lord intends for them if they believe in 700 him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { وأنّا لا ندري أشرّ أُريد بمن في الأرض } أرض البدن من القوى فتبقى في المجاهدة والرياضة، ممنوعة من لذاتها، محجوبة عن مشتهياتها وما تهواها { أم أراد بهم ربهم } بالأحكام الشرعية والمناهي الدينية والأوامر التكليفية { رشداً } استقامة وصواباً وما يوجب صلاحها، فإن مقصد الشرع وكمال النفس أمر وراء مبالغ إدراك هذه القوى",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَنَّا } اليوم { لاَ نَدْرِيۤ } ونعلم { أَشَرٌّ } وفتنة { أُرِيدَ بِمَن فِي ٱلأَرْضِ } أي: بالساكنين عليها بحراسة السماء، ومنع أخبارها عنهم { أَمْ أَرَادَ بِهِمْ رَبُّهُمْ رَشَداً } [الجن: 10] يهديهم إلى التوكل والتسليم، وكمال تفويض أمورهم إلى العليم الحكيم، بحيث لا يحترزون عمَّا جرى عليهم من قضائه بأخبار السماويين؟\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأنَّا لا ندري أَشَرٌّ أُريد بمَن في الأرض } بحراسة السماء، { أم أراد بهم ربُّهم رشداً } خيراً ورحمة، ونسبة الخير إلى الله تعالى دون الشر من الآداب الشريفة القرآنية، كقوله تعالى:\n\n[الشعراء:80] وقوله:\n\n[النساء:79] بعد أن ذكر ما في نفس الأمر بقوله:\n\n[النساء:78]\n الإشارة: إذا كان اللهُ تعالى قد حفظ السماء من استراق السمع، فقلوب أوليائه أولى بأن يحفظها من خواطر السوء، فإذا تَوَلَّى عبداً حَفِظ قلبه من طوارق الشك، وخواطر التدبير، وسوء الأدب مع الربوبية، فيملؤه باليقين والطمأنينة، ويهبُّ عليه برد الرضا ونسيم التسليم، فيخرج عن مراد نفسه إلى مراد مولاه، في كل وجهة وعلى كل حال\n جعلنا الله مِن أهل هذا القبيل، بمنِّه وكرمه\n ثم قالوا: { وَأَنَّا مِنَّا ٱلصَّالِحُونَ وَمِنَّا دُونَ ذَلِكَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "72:21",
      "similarity": 0.48203502267021475
    },
    {
      "verse": "40:38",
      "similarity": 0.47323215810090546
    },
    {
      "verse": "21:51",
      "similarity": 0.47131136189295975
    },
    {
      "verse": "18:66",
      "similarity": 0.4695215814908211
    },
    {
      "verse": "72:2",
      "similarity": 0.45865381792314375
    }
  ]
}