{
  "chapter": "الجن",
  "text": "وان المسجد لله فلا تدعوا۟ مع الله احدا",
  "translations": [
    {
      "translation": "All mosques belong to Allah so do not call on anyone else besides Allah.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All places of worship are for God; so do not invoke any one with God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that “mosques belong to Allah, so do not invoke anyone with Him”;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All the parts of the body to be placed on the ground during prostration belong to God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘And that the mosques are for Allah only – therefore do not worship anyone along with Allah.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the Masjids are for Allah, so invoke not anyone along with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that the mosques are Allah's, therefore call not upon any one with Allah:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The places of worship belong to God; so call not, along with God, upon anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the places of worship are only for Allah, so pray not unto anyone along with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The mosques are for God's worship -- so do not invoke anyone else along with God --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the prostrations are for Allah; wherefore call not along with Allah anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The places of worship belong to Allah, so do not invoke anyone along with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the places of worship are for Allah (alone): So invoke not any one along with Allah;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the mosques are for Allah (Alone), so invoke not anyone along with Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mosques belong to Allah, so do not call to anyone else, other than Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The places of worship are for God. So do not call, besides God, upon anyone else.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [He revealed] that the masjids are for Allah, so do not invoke with Allah anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:18] And [it has been revealed to me] that the places of prayer belong to God, so do not invoke, in them, anyone along with God, by associating others with Him, like the Jews and Christians do, who, when they enter their churches and temples, they ascribe partners to God.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the places of worship are only for Allah) they are built for the remembrance of Allah, (so pray not unto) so worship not (anyone along with Allah) in mosques; it is also said that the places of worship refer to the different parts of a person that touch the ground upon prostrating in prayer: the forehead, the knees, the hands and the feet.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على سبيل التوجيه والتعليم لخُلَّص عباده المؤمنين، والتوبيخ والتعريض للمشركين: { وَ } اعلموا أيها المكلفون من الثقلين { أَنَّ ٱلْمَسَاجِدَ } المبنية؛ للميل والتقرب نحو الحق مختصة { لِلَّهِ } خاصة خالصة { فَلاَ تَدْعُواْ } وتعبدوا فيها { مَعَ ٱللَّهِ } الواحد الأحد الصمد، المنزه عن الشريك والولد { أَحَداً } [الجن: 18] عن مظاهره ومربوباته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وَأَنَّ ٱلْمَسَاجِدَ لِلَّهِ فَلاَ تَدْعُواْ مَعَ ٱللَّهِ أَحَداً وَأَنَّهُ لَّمَا قَامَ عَبْدُ ٱللَّهِ يَدْعُوهُ كَادُواْ يَكُونُونَ عَلَيْهِ لِبَداً قُلْ إِنَّمَآ أَدْعُو رَبِّي وَلاَ أُشْرِكُ بِهِ أَحَداً قُلْ إِنِّي لاَ أَمْلِكُ لَكُمْ ضَرّاً وَلاَ رَشَداً قُلْ إِنِّي لَن يُجِيرَنِي مِنَ ٱللَّهِ أَحَدٌ وَلَنْ أَجِدَ مِن دُونِهِ مُلْتَحَداً إِلاَّ بَلاَغاً مِّنَ ٱللَّهِ وَرِسَالاَتِهِ\n\n\n }  يقول الحق جلّ جلاله: { وأنَّ المساجدَ لله } أي: ومن جملة ما أُوحي إليَّ: أنَّ المساجد، أي: البيوت المبنية للصلاة فيها هي لله، وقيل: معناه: ولأنّ المساجد لله { فلا تدعوا } ، على أنَّ اللام متعلّقة بـ \" تدعوا \" ، أي: فلا تدعوا { مع الله أحداً } في المساجد لأنها خالصة لله ولعبادته، فلا تعبدوا فيها غيره تعالى، ولا تفعلوا فيها إلا ما هو عبادة\n وقيل: المراد: المسجد الحرام، والجمع لأن كل ناحية منه مسجد له قبلة مخصوصة، أو لأنه قبلة المساجد، وقيل: الأرض كلها لأن جُعلت للنبي صلى الله عليه وسلم مسجداً وطهوراً، وقيل: أعضاء السجود السبعة التي يسجد عليها العبد، وهي: القدمان، والركبتان، واليدان، والوجه، يقول: هذه الأعضاء أنعم الله بها عليك، فلا تسجد عليها لغيره، فتجحد نِعَمه، ولا تذلها لغير خالقها\n فإن جعلت المساجد المواضع، فواحدها مسجِد بكسر الجيم، وإن جعلت الأعضاء، فبفتح الجيم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "72:20",
      "similarity": 0.5388937936329857
    },
    {
      "verse": "53:62",
      "similarity": 0.47893151443201304
    },
    {
      "verse": "112:1",
      "similarity": 0.4742694585751277
    },
    {
      "verse": "26:213",
      "similarity": 0.4445550501846078
    },
    {
      "verse": "89:25",
      "similarity": 0.4307710200639622
    }
  ]
}