{
  "chapter": "الجن",
  "text": "قل اوحى الى انه استمع نفر من الجن فقالوا۟ انا سمعنا قرءانا عجبا",
  "translations": [
    {
      "translation": "Say: 'It has been revealed to me that a band of the jinn listened and said, \"We have heard a most amazing Recitation.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "SAY: \"I HAVE been informed that a number of jinns had listened; then said: 'We have heard the wondrous Qur'an,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, (O Prophet), it was revealed to me that a band of jinn attentively listened to (the recitation of the Qur'an) and then (went back to their people) and said:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"It has been revealed to me that a party of jinn has listened (to the recitation) of the Quran and has told (their people), \"We heard an amazing reading\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Proclaim (O dear Prophet Mohammed – peace and blessings be upon him), “I have received the divine revelation that some jinns attentively listened to my recitation, so they said, ‘We have heard a unique Qur’an.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"It has been revealed to me that a group of Jinn listened. They said: `Verily, we have heard a wonderful Recitation!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: It has been revealed to me that a party of the jinn listened, and they said: Surely we have heard a wonderful Quran,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'It has been revealed to me that a company of the jinn gave ear, then they said, \"We have indeed heard a Koran wonderful,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): It is revealed unto me that a company of the Jinn gave ear, and they said: Lo! we have heard a marvellous Qur'an,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"It has been revealed to me that a band of the jinn listened [to the Quran] and they said, \"We have heard a really wonderful recital,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: it hath been revealed Unto me that a company of the Jinn listened, and said, verily we have listened to a Recitation wondrous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘It has been revealed to me that a team of the jinn listened [to the Quran] and they said, “Indeed we heard a wonderful Quran,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: It has been revealed to me that a company of Jinns listened (to the Qur'an). They said, 'We have really heard a wonderful Recital!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"It has been revealed to me that a group (from three to ten in number) of jinns listened (to this Quran). They said: 'Verily! We have heard a wonderful Recital (this Quran)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'It is revealed to me that a party of jinn listened then said: \"We have indeed heard a wonderful Koran,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “It was revealed to me that a band of jinn listened in, and said, ‘We have heard a wondrous Quran.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"It has been revealed to me that a group of the jinn listened and said, 'Indeed, we have heard an amazing Qur'an.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:1] Say, O Muhammad (s), to people: ‘It has been revealed to me, that is to say, I have been informed by way of revelation from God, exalted be He, that (annahu: the [suffixed] pronoun is that of the matter) a company of the jinn, the jinn of Nasībīn. This was at the time of the morning prayer at Batn Nakhla, a location between Mecca and Tā’if — these [jinn] being those mentioned in God’s saying, And when We sent a company of jinn your way…’ [Q. 46:29] — listened, to my recitation, then said, to their people upon returning to them: “We have indeed heard a marvellous Qur’ān, whose clarity, the richness of its meanings and other aspects one marvels at,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآَنًا عَجَبًا (1) افتتاح السورة بالأمر بالقول يشير إلى أن ما سيذكر بعده حدث غريب وخاصة بالنسبة للمشركين الذين هم مظنة التكذيب به كما يقتضيه قوله : { كما ظننتم أن لن يبعث الله أحداً } \\[ الجن : 7 \\] حسبما يأتي .أمر الله رسوله صلى الله عليه وسلم بأن يُعلم المسلمين وغيرهم بأن الله أوحَى إليه وقوع حدث عظيم في دعوته أقامه الله تكريماً لنبيئه وتنويهاً بالقرآن وهو أن سخر بعضاً من النوع المسمى جنّاً لاستماع القرآن وألهمهم أو علَّمهم فهم ما سمعوه واهتداءهم إلى مقدار إرشاده إلى الحق والتوحيد وتنزيه الله والإِيمان بالبعث والجزاء فكانت دعوة الإسلام في أصولها بالغة إلى عالم من العوالم المغيبة لا علاقة لموجوداته بالتكاليف ولا بالعقائد بل هو عالم مجبول أهله على ما جبلوا عليه من خير أو شر لا يعدُو أحدُهم في مدة الدنيا جِبلتَه فيكون على معيارها مصيرُه الأبدي في الحياة الآخرة ولذلك لم يَبعث إليهم بشرائع .وقد كشف الله لهذا الفريق منهم حقائق من عقيدة الإِسلام وهديه ففهموه .هذا العالَم هو عالم الجنّ وهو بحسب ما يستخلص من ظواهر القرآن ومن صحاح الأخبار النبوية وحَسَنها نوع من المجردات أعني الموجودات اللطيفة غير الكثيفة ، الخفية عن حاسة البصر والسمع ، منتشرة في أمكنة مجهولة ليست على سطح الأرض ولا في السماوات بل هي في أجواء غير محصورة وهي من مقولة الجوهر من الجواهر المجردات أي ليست أجساماً ولا جسمانيات بل هي موجودات روحانية مخلوقة من عنصر ناري ولها حياة وإرَادة وإدراك خاص بها لا يُدرى مَداه . وهذه المجردات النارية جنس من أجناس الجواهر تحتوي على الجن وعلى الشياطين فهما نوعان لجنس المجردات النارية لها إدراكات خاصة وتصرفات محدودة وهي مغيبة عن الأنظار ملحقة بعالم الغيب لا تراها الأبصار ولا تدركها أسماع الناس إلاّ إذا أوصل الله الشعور بحركاتها وإراداتها إلى البشر على وجه المعجزة خرقاً للعادة لأمر قضاه الله وأراده .وبتعاضد هذه الدلائل وتناصرها وإن كان كل واحد منها لا يعدو أنه ظني الدلالة وهي ظواهر القرآن ، أو ظني المتن والدلالة وهي الأحاديث الصحيحة ، حصل ما يقتضي الاعتقاد بوجود موجودات خفية تسمى الجن فتفسَّر بذلك معاني آيات من القرآن وأخبار من السنة .وليس ذلك مما يدخل في أصول عقيدة الإِسلام ولذلك لم نكفر منكري وجود موجودات معيّنة من هذا النوع إذ لم تثبت حقيقتها بأدلة قطعية ، بخلاف حال من يقول : إن ذكر الجن لم يذكر في القرآن بعد عِلْمِه بآيات ذكره .وأما ما يروى في الكتب من أخبار جزئية في ظهورهم للناس وإتيانهم بأعمال عجيبة فذلك من الروايات الخيالية .وإنا لم نلق أحداً من أثبات العلماء الذين لقيناهم من يقول : إنه رأى أشكالهم أو آثارهم وما نجد تلك القصص إلاّ على ألسنة الذين يسرعون إلى التصديق بالأخبار أو تغلب عليهم التخيلات .وإن كان فيهم من لا يتهم بالكذب ولكنه مما يضرب له مثل قول المعري :ومثلُككِ من تخيل ثم خالا ... فظهور الجن للنبيء صلى الله عليه وسلم تارات كما في حديث الجني الذي تفلت ليفسد عليه صلاته هو من معجزاته مثل رؤيته الملائكة ورؤيته الجنة والنار في حائط القبلة وظهور الشيطان لأبي هريرة في حديث زكاة الفطر .وقد مضى ذكر الجن عند قوله : { وجعلوا لله شركاء الجن } في سورة الأنعام ( 100 ) ، وقوله : { ولقد ذرأنا لجهنم كثيراً من الجن والإنس } في سورة الأعراف ( 179 ) .والذين أمر الرسول بأن يقول لهم أنه أوحي إليه بخبر الجن : هم جميع الناس الذين كان النبي يبلغهم القرآن من المسلمين والمشركين أراد الله إبلاغهم هذا الخبر لما له من دلالة على شرف هذا الدين وشرف كتابه وشرف من جاء به ، وفيه إدخال مسرة على المسلمين وتعريض بالمشركين إذ كان الجن قد أدركوا شرف القرآن وفهموا مقاصده وهم لا يعرفون لغته ولا يدركون بلاغته فأقبلوا عليه ، والذين جاءهم بلسانهم وأدركوا خصائص بلاغته أنكروه وأعرضوا عنه .وفي الإِخبار عن استماع الجن للقرآن بأنه أوحي إليه ذلك إيماء إلى أنه ما علم بذلك إلاّ بإخبار الله إياه بوقوع هذا الاستماع ، فالآية تقتضي أن الرسول لم يعلم بحضور الجن لاستماع القرآن قبل نزول هذه الآية .وأما آية الأحقاف ( 29 ) { وإذ صرفنا إليك نفراً من الجن يستمعون القرآن } الآيات فتذكير بما في هذه الآية أو هي إشارة إلى قصة أخرى رواها عبد الله بن مسعود وهي في صحيح مسلم } في أحاديث القراءة في الصلوات ولا علاقة لها بهذه الآية .وقوله : { أنه استمع نفر من الجن } في موضع نائب فاعل { أوحي } أي أوحي إلي استماع نفر . وتأكيد الخبر الموحَى بحرف ( أن ) للاهتمام به لغرابته .وضمير { أنه } ضمير الشأن وخبره جملة { استمع نفر من الجن } وفي ذلك زيادة اهتمام بالخبر الموحى به .ومفعول { استمع } محذوف دل عليه { إنَّا سمعنا قرآنا } ، أي استمع القرآن نفر من الجن .والنفَر : الجماعة من واحد إلى عشرة وأصله في اللغة لجماعة من البشر فأطلق على جماعة من الجن على وجه التشبيه إذ ليس في اللغة لفظ آخر كما أطلق رجال في قوله : { يعوذون برجال من الجن } \\[ الجن : 6 \\] على شخوص الجن . وقولهم : { إنا سمعنا قرآنا عجباً } قالوه لبعض منهم لم يحضر لاستماع القرآن ألهمهم الله أن ينذروهم ويرشدوهم إلى الصلاح قال تعالى في سورة الأحقاف ( 29 ، 30 ) { وإذ صرفنا إليك نفراً من الجن يستمعون القرآن فلما حضروه قالوا أنصتوا فلما قضي ولّوا إلى قومهم منذرين قالوا يا قومنا إنا سمعنا كتاباً } الآيات .ومعنى القَول هنا : إبلاغُ مرادهم إلى من يريدون أن يبلِّغوه إليهم من نوعهم بالكيفية التي يتفاهمون بها ، إذ ليس للجن ألفاظ تجري على الألسن فيما يظهر ، فالقول هنا مستعار للتعبير عما في النفس مثل قوله تعالى :{ قالت نملة يا أيها النمل ادخلوا مساكنكم } \\[ النمل : 18 \\] فيكون ذلك تكريماً لهذا الدِّين أن جعل الله له دعاة من الثقلين .ويجوز أن يكون قولاً نفسياً ، أي خواطر جالت في مدركاتهم جولان القول الذي ينبعث عن إرادةِ صاحب الإِدراك به إبلاغَ مدركاته لغيره ، فإن مثل ذلك يعبر عنه بالقول كما في بيت النابغة يتحدث عن كلب صيد :قالتْ له النفسُ إني لا أرى طمعاً ... وإن مولاك لم يَسلم ولم يَصِدومنه قوله تعالى : { ويقولون في أنفسهم لولا يعذبنا الله بما نقول } \\[ المجادلة : 8 \\] .وتأكيد الخبر ب ( أنَّ ) لأنهم أخبروا به فريقاً منهم يشكون في وقوعه فأتوا في كلامهم بما يفيد تحقيق ما قالوه وهو الذي يعبر عن مثله في العربية بحرف ( إن ) .ووصف القرآن بالعجب وصف بالمصدر للمبالغة في قوة المعنى ، أي يعجب منه ، ومعنى ذلك أنه بديع فائق في مفاده .وقد حصل لهم العلم بمزايا القرآن بانكشاف وهبهم الله إياه . قال المازري في «شرح صحيح مسلم» «لا بد لمن آمن عند سماع القرآن أن يعلم حقيقة الإِعجاز وشروط المعجزة ، وبعد ذلك يقع العلم بصدق الرسول؛ فإما أن يكون الجن قد علموا ذلك أو عَلِموا من كتب الرسل المتقدمة ما دلهم على أنه هو النبي الأمّي الصادق المبشر به» اه . وأنا أقول : حصل للجن علم جديد بذلك بإلهام من الله لأدلة كانوا لا يشعرون بها إذ لم يكونوا مطالبين بمعرفتها ، وأن فهمهم للقرآن من قبيل الإِلهام خلقه الله فيهم على وجه خرق العادة كرامة للرسول صلى الله عليه وسلم وللقرآن .\n\n",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Say (0 Muhammad): It is revealed unto me): '(Say (0 Muhammad): It is revealed unto me) say, Muhammad, to the disbelievers of Mecca that Gabriel has come down and informed me (that a company of the jinn) nine of the jinn of Nusaybin which is near Yemen (gave ear, and they said) after accepting faith and returning to their folk: our folk! (Lo! it is a marvellous Qur'an) we have listened to the recitation of a marvellous, illustrious and noble Qur'an which resembles the Scripture of Moses, this is because they were followers of the Torah,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nقد مرّ أن في الوجود نفوساً أرضية قوية لا في غلظ النفوس السبعية والبهيمية وكثافتها وقلة إدراكها ولا على هيئات النفوس الإنسانية واستعداداتها ليلزم تعلقها بالأجرام الكثيفة الغالب عليها الأرضية ولا في صفاء النفوس المجرّدة ولطافتها لتتصل بالعالم العلوي وتتجرّد أو تتعلق ببعض الأجرام السماوية متعلقة بأجرام عنصرية لطيفة غلبت عليها الهوائية أو النارية أو الدخانية على اختلاف أحوالها\n سماها بعض الحكماء: الصور المعلقة\n ولها علوم وإدراكات من جنس علومنا وإدراكاتنا\n ولما كانت قريبة بالطبع إلى الملكوت السماوية أمكنها أن تتلقى من عالمها بعض الغيب فلا تستبعد أن ترتقي إلى أفق السماء فتسترق السمع من كلام الملائكة أي: النفوس المجرّدة\n ولما كانت أرضية ضعيفة بالنسبة إلى القوى السماوية تأثرت بتأثير تلك القوى فرجمت بتأثيرها عن بلوغ شأوها وإدراك مداها من العلوم\n ولا تنكر أن تشتعل أجرامها الدخانية بأشعة الكواكب فتحترق وتهلك أو تنزجر من الارتقاء إلى الأفق السماوي فتتسفل\n فإنها أمور ليست بخارجة عن الإمكان\n وقد أخبر عنها أهل الكشف والعيان الصادقون من الأنبياء والأولياء خصوصاً أكملهم نبينا محمد صلى الله عليه وسلم\n وإن شئت التطبيق\n فاعلم: أن القلب إذا استعدّ لتلقي الوحي وكلام الغيب استمع إليه القوى النفسانية من المتخيلة والوهم والفكر والعاقلة النظرية والعملية وجميع المدركات الباطنة التي هي جنّ الوجود الإنساني\n ولما لم يكن الكلام الإلهي الوارد على القلب بواسطة روح القدس من جنس الكلام المصنوع المتلقف بالفكر والتخيل أو المستنتج من القياسات العقلية والمقدّمات الوهمية والتخيلية\n قالوا: { إنّا سمعنا قرآناً عجباً * يهدي إلى الرشد } أي: الصواب وذلك هو تأثرها بنور الروح وانتعاشها بمعاني الوحي وتنوّرها بنوره وتأثيرها في سائر القوى من الغضبية والشهوية وجميع القوى البدنية { فآمنا به } تنوّرنا بنوره واهتدينا إلى جناب القدس { ولن نُشْرك بربّنا أحداً } أي: لن تمثله بمثال من جنس مدركاتنا فنشبه به غيره\n بل نشايع السرّ في التوجه إلى جناب الوحدة\n ولن ننزوي إلى عالم الكثرة لنعبد الشهوات بهوى النفس وتحصيل مطالبها من عالم الرجس فنعبد غيره",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل لمن أنكر رسالتك على الثقلين: { أُوحِيَ إِلَيَّ } من قِبَل الحق { أَنَّهُ ٱسْتَمَعَ } عند قراءتك القرآن { نَفَرٌ } طائفة\n وهو يطلق على ما بين الثلاثة إلى العشرة { مِّنَ ٱلْجِنِّ } وهو جنس من جنود الحق ومظاهره\n كجنس الملك\n لا مناسبة بيننا وبينهم حتى ندركهم ونعرف حقيقتهم\n وما لنا إلاَّ الإيمان بوجودهم وبأمثالهم\n إذ ما يعلم جنود الحق إلاَّ هو\n ولا يسع لنا الإنكار\n سيما بعد ورود القرآن على وجودهم وتحققهم\n\n\nوبعدما سمعوا القرآن\n ورجعوا إلى أصحابهم { فَقَالُوۤاْ إِنَّا سَمِعْنَا } من إنسان { قُرْآناً } كتاباً { عَجَباً } [الجن: 1] بديعاً نظماً وأسلوباً\n غريباً معنى ودلالة\n حاوياً للمعارف والحقائق الإلهية\n محتوياً على دقائق طريق التوحيد والعرفان\n ما هو من جنس كلام البشر\n بل هو خارج عن مداركهم\n متعالٍ عن مشاعرهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: قد أجمعوا على فتح  أنه لأنه نائب فاعل \" أوحى \" \n و\n[الجن:16] و\n[الجن:18] للعطف على { أنه استمع } فـ \" أن \" مخففة\n و\n[الجن:28] لتعدّي \" يعلم \" إليها\n وكسر ما بعد فاء الجزاء\n وبعد القول\n نحو:\n[الجن:23] و { قالوا إنّا سمعنا } لأنه مبتدأ محكي بعد القول\n واختلفوا في فتح الهمزة وكسرها من { أنه تعالى جَدٌ ربنا } إلى: { وأنَّا منا المسلمون } \n ففتحها الشامي والكوفيّ [غير] أبي بكر عطفاً على { أنه استمع } ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:41",
      "similarity": 0.5247479377716305
    },
    {
      "verse": "25:60",
      "similarity": 0.5008103701312663
    },
    {
      "verse": "9:39",
      "similarity": 0.43365332968656994
    },
    {
      "verse": "50:2",
      "similarity": 0.4054679346119232
    },
    {
      "verse": "10:2",
      "similarity": 0.3935269977389452
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/072001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/072001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/72:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}