{
  "chapter": "الجن",
  "text": "وانا لا ندرى اشر اريد بمن فى الارض ام اراد بهم ربهم رشدا",
  "translations": [
    {
      "translation": "We have no idea whether evil is intended for those on the earth, or whether their Lord intends them to be rightly guided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not know if this means ill for the dwellers of the earth, or their Lord wishes guidance for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that “we do not know whether evil is intended for those on the earth, or whether their Lord intends to direct them to the Right Way”;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not know whether by this arrangement God intends benefit and guidance for the people of the earth or only evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘And we do not know whether harm is intended for those on the earth, or whether their Lord intends goodness for them.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "`And we know not whether evil is intended for those on the earth, or whether their Lord intends for them guidance.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that we know not whether evil is meant for those who are on earth or whether their Lord means to bring them good:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so we know not whether evil is intended for those in the earth, or whether their Lord intends for them rectitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we know not whether harm is boded unto all who are in the earth, or whether their Lord intendeth guidance for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "we cannot tell if this bodes evil to those who dwell on earth or whether their Lord intends to guide them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we know not whether evil is boded for those who are on the earth, or whether their Lord intendeth for them a right direction.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not know whether ill is intended for those who are on the earth, or whether their Lord intends good for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we understand not whether ill is intended to those on earth, or whether their Lord (really) intends to guide them to right conduct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we know not whether evil is intended for those on earth, or whether their Lord intends for them a Right Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And so we do not know whether evil is intended for those on earth, or whether their Lord intends to guide them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We do not know whether ill is intended for those on earth, or if their Lord intends goodness for them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we do not know [therefore] whether evil is intended for those on earth or whether their Lord intends for them a right course.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:10] And we do not know, by not being able to eavesdrop by stealth, whether ill is intended for those who are in the earth, or whether their Lord intends for them good.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَأَنَّا لَا نَدْرِي أَشَرٌّ أُرِيدَ بِمَنْ فِي الْأَرْضِ أَمْ أَرَادَ بِهِمْ رَبُّهُمْ رَشَدًا (10)قرأه الجمهور وأبو جعفر بكسر الهمزة وهو ظاهر المعنى ، وقرأ ابن عامر وحمزة والكسائي وحفص وخلف بفتحها عطفاً على المجرور بالباء كما تقدم فيكون المعنى : وآمنا بأنا انتفى علمنا بما يراد بالذين في الأرض ، أي الناس ، أي لأنهم كانوا يسترقون علم ذلك فلما حرست السماء انقطع علمهم بذلك . هذا توجيه القراءة بفتح همزة { أنا } ومحاولة غير هذا تكلف .وهذه نتيجة ناتجة عن قولهم : { وإنا كنا نقعد منها مقاعد للسمع } \\[ الجن : 9 \\] الخ لأن ذلك السمع كان لمعرفة ما يجري به الأمر من الله للملائكة ومما يُخْبِرُهُمْ به مما يريد إعلامهم به فكانوا على علم من بعض ما يتلقفونه فلما منعوا السمع صاروا لا يعلمون شيئاً من ذلك فأخبروا إخوانهم بهذا عساهم أن يعتبروا بأسباب هذا التغير فيؤمنوا بالوحي الذي حرسه الله من أن يطلع عليه أحد قبل الذي يوحَى به إليه والذي يحمله إليه .فحاصل المعنى : إنا الآن لا ندري ماذا أريد بأهل الأرض من شر أو خير بعد أن كنا نتجسس الخبر في السماء .وهذا تمهيد لما سيقولونه من قوله : { وإنا منا الصالحون } \\[ الجن : 11 \\] ثم قولهم : { وإنا ظننا أن لن نعجز الله في الأرض } \\[ الجن : 12 \\] ثم قولهم : { وإنا لما سمعنا الهدى آمنا به } إلى قوله : { فكانوا لجهنم حَطباً } \\[ الجن : 13 15 \\] .ومفعول { ندري } هو ما دل عليه الاستفهام بعده من قوله : { أشرّ أريد بمن في الأرض أم أراد بهم ربهم رشداً } وهو الذي علَّق فعل { ندري } عن العمل ، والاستفهام حقيقي وعادة المعربين لمثله أن يقدروا مفعولاً يستخلص من الاستفهام تقديره : لا ندري جواب هذا الاستفهام ، وذلك تقديرُ معنًى لا تقديرُ إعراب . هذا هو تفسير الآية على المعنى الأكمل وهي من قبيل قوله تعالى : { وما أدري ما يفعل بي ولا بكم } \\[ الأحقاف : 9 \\] .وليس المراد منها فيما نرى أنهم ينفون أن يعلموا ماذا أراد الله بهذه الشهب ، فإن ذلك لا يناسب ما تقدم من أنهم آمنوا بالقرآن إذ قالوا : { إنا سمعنا قرآناً عجباً يهدي إلى الرشد فآمنا به } \\[ الجن : 1 ، 2 \\] وقولهم : { فمن يستمع الآن يجد له شهاباً رصداً } \\[ الجن : 9 \\] فذلك صريح في أنهم يدرون أن الله أراد بمن في الأرض خيراً بهذا الدّين وبصرف الجن عن استراق السمع .وتكرير ( إنّ ) واسمها للتأكيد لكون هذا الخبر معرضاً لشك السامعين من الجن الذين لم يختبروا حراسة السماء .والرشَد : إصابة المقصود النافع وهو وسيلة للخير ، فلهذا الاعتبار جعل مقابلاً للشر وأسند فعل إرادة الشر إلى المجهول ولم يسند إلى الله تعالى مع أن مقابله أسند إليه بقوله : { أم أراد بهم ربهم رشداً ، } جرياً على واجب الأدب مع الله تعالى في تحاشي إسناد الشر إليه .\n\n",
      "translations": [
        {
          "translation": "(And we know not whether) in preventing us from listening (harm is boded unto all who are in the earth, or whether their Lord intendeth guidance for them) or whether their Lord intends guidance, goodness and the correct course for them; it is also said that this means: we do not know whether evil is intended for the people of the earth by the advent of Muhammad (pbuh) such that if they do not believe in him they will be destroyed or it is good, guidance and the correct course that their Lord intends for them if they believe in 700 him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n محجوبة عن مشتهياتها وما تهواها { أم أراد بهم ربهم } بالأحكام الشرعية والمناهي الدينية والأوامر التكليفية { رشداً } استقامة وصواباً وما يوجب صلاحها\n فإن مقصد الشرع وكمال النفس أمر وراء مبالغ إدراك هذه القوى",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ومنع أخبارها عنهم { أَمْ أَرَادَ بِهِمْ رَبُّهُمْ رَشَداً } [الجن: 10] يهديهم إلى التوكل والتسليم\n وكمال تفويض أمورهم إلى العليم الحكيم\n بحيث لا يحترزون عمَّا جرى عليهم من قضائه بأخبار السماويين؟\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { أم أراد بهم ربُّهم رشداً } خيراً ورحمة\n ونسبة الخير إلى الله تعالى دون الشر من الآداب الشريفة القرآنية\n كقوله تعالى:\n[الشعراء:80] وقوله:\n[النساء:79] بعد أن ذكر ما في نفس الأمر بقوله:\n[النساء:78]\n الإشارة: إذا كان اللهُ تعالى قد حفظ السماء من استراق السمع\n فقلوب أوليائه أولى بأن يحفظها من خواطر السوء\n فإذا تَوَلَّى عبداً حَفِظ قلبه من طوارق الشك\n وخواطر التدبير\n وسوء الأدب مع الربوبية\n فيملؤه باليقين والطمأنينة\n ويهبُّ عليه برد الرضا ونسيم التسليم\n فيخرج عن مراد نفسه إلى مراد مولاه\n في كل وجهة وعلى كل حال\n جعلنا الله مِن أهل هذا القبيل\n بمنِّه وكرمه\n ثم قالوا: { وَأَنَّا مِنَّا ٱلصَّالِحُونَ وَمِنَّا دُونَ ذَلِكَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "72:21",
      "similarity": 0.48203502267021475
    },
    {
      "verse": "40:38",
      "similarity": 0.47323215810090546
    },
    {
      "verse": "21:51",
      "similarity": 0.47131136189295975
    },
    {
      "verse": "18:66",
      "similarity": 0.4695215814908211
    },
    {
      "verse": "72:2",
      "similarity": 0.45865381792314375
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/072010.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/072010.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/72:10.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}