{
  "chapter": "الجن",
  "text": "وانا ظننا ان لن نعجز الله فى الارض ولن نعجزه هربا",
  "translations": [
    {
      "translation": "We realised we would never thwart Allah on earth and would never thwart Him by flight,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We realised that we could not weaken the power of God on earth, nor outpace Him by running away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that “we thought that we will neither be able to frustrate Allah on earth, nor frustrate Him by flight”;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We knew that we could never challenge God whether we stayed on earth or fled elsewhere.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘And we are certain that we cannot defeat Allah in the earth, nor can we run out of His grasp.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "`And we think that we cannot escape Allah in the earth, nor can we escape Him by flight.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that we know that we cannot escape Allah in the earth, nor can we escape Him by flight:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, we thought that we should never be able to frustrate God in the earth, neither be able to frustrate Him by flight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we know that we cannot escape from Allah in the earth, nor can we escape by flight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have realized that we could never thwart God on earth and that we would never be able to thwart Him by flight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we known that we cannot frustrate Allah in the earth, nor can we frustrate Him by flight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know that we cannot frustrate Allah on the earth, nor can we frustrate Him by fleeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But we think that we can by no means frustrate Allah throughout the earth, nor can we frustrate Him by flight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we think that we cannot escape (from the punishment of) Allah in the earth, nor can we escape (from the punishment) by flight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We know that we cannot frustrate Allah in the earth, nor can we frustrate Him by flight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We realized that we cannot defeat God on earth, and that we cannot escape Him by fleeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we have become certain that we will never cause failure to Allah upon earth, nor can we escape Him by flight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:12] And we assume that (an: softened in place of the hardened form, that is to say, annahu) we will never be able to elude God in the earth, nor will we be able to elude Him by fleeing — we will not be able to escape Him, whether we are on earth or, fleeing from it, in the heavens.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And we know) and are certain (that we cannot escape from Allah in the earth) for He can reach us wherever we might be, (nor can we escape by flight) nor can we escape from Him by running away.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَأَنَّا } بعدما كوشفنا بهداية القرآن، ورسالة محمد صلى الله عليه وسلم تركنا ما كنا علين من الضرر والإضرار لعباد الله؛ إذ { ظَنَنَّآ } بل علمنا يقيناً { أَن لَّن نُّعْجِزَ ٱللَّهَ } القادر المقتدر على أنواع الانتقام كائنين { فِي ٱلأَرْضِ وَلَن نُّعْجِزَهُ } أيضاً { هَرَباً } [الجن: 12] منه سبحانه إلى السماء، أو إلى أيّ مكان شئنا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأنَّا ظننا } أي: تيقَّنَّا { أن لن نُّعْجِزَ اللهَ } أي: أن الشأن لن نفوت الله ونسبقه، و { في الأرض }: حال، أي: لن نعجزه كائنين في الأرض أينما كنا فيها، { ولن نُّعجِزَه هَرَباً }: مصدر في موضع الحال، هاربين منها إلى السماء، أي: فلا مهرب منه تعالى إن طلبنا، لا في أرضه ولا في سمائه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "42:31",
      "similarity": 0.07729133119560175
    },
    {
      "verse": "29:22",
      "similarity": 0.07709897243919857
    },
    {
      "verse": "11:20",
      "similarity": 0.07445756708842033
    },
    {
      "verse": "46:32",
      "similarity": 0.07445392549645605
    },
    {
      "verse": "11:33",
      "similarity": 0.0727670184354366
    }
  ]
}