{
  "chapter": "الجن",
  "text": "حتى اذا راوا۟ ما يوعدون فسيعلمون من اضعف ناصرا واقل عددا",
  "translations": [
    {
      "translation": "So that when they see what they were promised, they will know who has less support and smaller numbers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until they see what they are promised, when they will understand who is weaker in aid and poorer in numbers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They shall not change their ways) until they see that against which they had been warned, and then they will know whose helpers are weaker and whose supporters are fewer in number.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(On the Day of Judgment) when the disbelievers witness that with which they have been threatened, they will then know whose helpers are weaker and fewer in number.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till the time when they will see what they are promised – so they will now come to know whose aide is weak, and who is lesser in number.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when they see that which they are promised, then they will know who it is that is weaker concerning helpers and less important concerning numbers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until when they see what they are threatened with, then shall they know who is weaker in helpers and fewer in number.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when they see that which they are promised, then they will know who is weaker in helpers and fewer in numbers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till (the day) when they shall behold that which they are promised (they may doubt); but then they will know (for certain) who is weaker in allies and less in multitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they are confronted by what they have been promised, they will realize who is weaker in helpers and fewer in numbers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall go on denying until they; behold that which they are promised wherefore then they shall know who were weaker in protectors and fewer in number.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they see what they are promised, they will know who is weaker in supporters and fewer in numbers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "At length, when they see (with their own eyes) that which they are promised,- then will they know who it is that is weakest in (his) helper and least important in point of numbers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till, when they see that which they are promised, then they will know who it is that is weaker concerning helpers and less important concerning numbers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they see that which they were promised they shall know who is weaker in helpers and fewer in numbers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Until, when they see what they were promised, they will know who is weaker in helpers, and fewer in numbers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The disbelievers continue] until, when they see that which they are promised, then they will know who is weaker in helpers and less in number.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:24] Such that when they see (hattā is for inceptiveness, [but] also entailing a purposive sense to an implied preceding clause, that is to say, they persist in their disbelief until they come to see …) what they are promised, of chastisement, they will then know, at the moment that it befalls them, [either] on the day of Badr or on the Day of Resurrection, who is weaker in supporters and fewer in numbers, in assistants: is it them or the believers — according to the former [reading]? Or, is it Me or them, according to the latter. Some of them said, ‘When will this promise be [fulfilled]?’, whereupon the following was revealed:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Till (the day)) He says: wait for them until the day (when they shall behold that which they are promised) of chastisement; (but then they will know for certain) this is a threat from Allah to them (who is weaker in allies and less in multitude) who has less helpers.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وقوله: { ومن يعص الله ورسوله } منكم فلم يقبل نوره ولم يسمع ما يبلغه رسول العقل { فإنّ له نار } الطبيعة المحرقة باستيلائها عليه أبداً { حتى إذا رأوا } أي: يكونون عليه لبداً يستولون عليه بالازدحام حتى إذا رأوا { ما يُوعدون } في الرسالات من وقوع القيامة الصغرى بالموت أو الوسطى بظهور نور الفطرة واستيلاء القلب عليها، أو الكبرى بظهور نور الوحدة فسيظهر ضعفهم وقلّة عددهم وخمود نارهم وانطفاؤها وكلالة حدّهم وشوكتهم بإحدى الأحوال الثلاث ولا ينصر بعضهم بعضاً لانقهارهم وعجزهم وفنائهم فيعلمون { أنهم أضعف ناصراً } من القلب { وأقل عدداً } وإن كادوا أن يقهروه بالكثرة واستقلّوه بالنسبة إلى عددهم فإن الواحد المؤيد من عند الله أقوى وأكثر\n\n[الصافات، الآيات:171 - 172]،\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوهم لا يزالون لى عصيانهم بالله، مستظهرين بما معهم من الجاه والثروة، وكثرة الأموال والأولاد في نشأتهم الأولى { حَتَّىٰ إِذَا رَأَوْاْ مَا يُوعَدُونَ } في النشأة الأخرى { فَسَيَعْلَمُونَ } حينئذٍ { مَنْ أَضْعَفُ نَاصِراً وَأَقَلُّ عَدَداً } [الجن: 24] النبي وأتباعه، أم المشركون ومن معهم؟\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { حتى إِذا رَأَوا ما يوعدون } ، متعلق بمحذوف، يدل عليه الحال من استضعاف الكفار لأمره صلى الله عليه وسلم، واستقلالهم لعدده، كأنه قيل: لا يزالون على ما هم عليه، { حتى إّذا رَأَوا ما يُوعدون } من فنون العذاب في الآخرة { فسيعلمون } عند حلول العذاب بهم { مَن أَضْعَفْ ناصراً وأقلُّ عدداً } أهم أم المؤمنون؟ بل الكفار لا ناصر لهم يؤمئذ، والمؤمنون ينصرهم الله ويُعزّهم",
      "translations": []
    }
  ]
}