{
  "chapter": "الجن",
  "text": "الا من ارتضى من رسول فانه يسلك منۢ بين يديه ومن خلفه رصدا",
  "translations": [
    {
      "translation": "except a Messenger with whom He is well pleased, and then He posts sentinels before him and behind him,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Other than an apostle He has chosen, when He makes a sentinel walk in front of him and a sentinel behind,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "other than to a Messenger whom He chooses (for the bestowal of any part of the knowledge of the Unseen), whereafter He appoints guards who go before him and behind him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He causes angelic guards to march before and after him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except to His chosen Noble Messengers – so He appoints guards in front and behind him. (Allah gave the knowledge of the hidden to the Holy Prophet – peace and blessings be upon him.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except to a Messenger whom He has chosen, and then He makes a band of watching guards to march before him and behind him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except to him whom He chooses as an apostle; for surely He makes a guard to march before him and after him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "save only to such a Messenger as He is well-pleased with; then He despatches before him and behind him watchers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save unto every messenger whom He hath chosen, and then He maketh a guard to go before him and a guard behind him\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except the messenger whom He has chosen. He sends down guardians who walk before them and behind them,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Save Unto an apostle chosen. And then He causeth to go before him and behind him a guard.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except to an apostle He approves of. Then He dispatches a sentinel before and behind him\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except a messenger whom He has chosen: and then He makes a band of watchers march before him and behind him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except to a Messenger (from mankind) whom He has chosen (He informs him of unseen as much as He likes), and then He makes a band of watching guards (angels) to march before him and behind him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except only to a Messenger that He has chosen, and He sends guardians before him and behind him,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except to a Messenger of His choosing. He then dispatches guards before him and behind him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except whom He has approved of messengers, and indeed, He sends before each messenger and behind him observers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:27] except to a messenger of whom He approves. Then, in addition to disclosing to him what He will [to disclose] of it, by way of [making it] a miracle for him, He despatches, He appoints and sends forth, before him, namely, the Messenger, and behind him watchers, angels to preserve him until He has conveyed [it] to him as part of the [entire] revelation,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِلَّا مَنِ ارْتَضَى مِنْ رَسُولٍ فَإِنَّهُ يَسْلُكُ مِنْ بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ رَصَدًا (27) فقوله : { ارتضى } مستثنى من عموم { أحداً } . والتقدير : إلاّ أحداً ارتضاه ، أي اختاره للاطلاع على شيء من الغيب لحكمة أرادها الله تعالى .والإِتيان بالموصول والصلة في قوله : { إلاّ مَن ارتضَى مِن رسول } لقصد ما تؤذن به الصلة من الإِيماء إلى تعليل الخبر ، أي يطلع الله بعض رسله لأجل ما أراده الله من الرسالة إلى النّاس ، فيُعْلم من هذا الإِيمان أن الغيب الذي يطلع الله عليه الرسل هو من نوع ما له تعلق بالرسالة ، وهو غيب ما أراد الله إبلاغه إلى الخلق أن يعتقدوه أو أن يفعلوه ، وما له تعلق بذلك من الوعد والوعيد من أمور الآخرة ، أو أمور الدنيا ، وما يؤيد به الرسل عن الإِخبار بأمور مغيبة كقوله تعالى : { غلبت الروم في أدنى الأرض وهم من بعد غلبهم سيغلبون في بضع سنين } \\[ الروم : 24 \\] .والمراد بهذا الإِطلاعُ المحقق المفيد علماً كعلم المشاهدة . فلا تشمل الآية ما قد يحصل لبعض الصالحين من شرح صدر بالرؤيا الصادقة ، ففي الحديث : « الرؤيا الصالحة من الرجل الصالح جزء من ستة وأربعين جزءاً من النبوءة ، أو بالإِلهام » قال النبي صلى الله عليه وسلم « قد كان يكون في الأمم قبلكم محدِّثون فإن يَكُنْ في أمتِي منهم أحد فإن عمر بن الخطاب منهم » رواه مسلم . قال مسلم : قال ابن وهب : تفسير محدثون : ملهِمون .وقد قال مالك في الرؤيا الحسنة : أنها تسرُّ ولا تغرُّ ، يريد لأنها قد يقع الخطأ في تأويلها .و { مِن رسول } بيان لإِبهام { مَنْ } الموصولة ، فدل على أن مَا صْدَقَ { مَن } جماعةٌ من الرسل ، أي إلاّ الرسل الذين ارتضاهم ، أي اصطفاهم .وشمل { رسول } كلّ مرسل من الله تعالى فيشمل الملائكة المرسلين إلى الرسل بإبلاغ وحي إليهم مثل جبريل عليه السلام . وشمل الرسل من البشر المرسلين إلى الناس بإبلاغ أمر الله تعالى إليهم من شريعة أو غيرها مما به صلاحهم .وهنا أربعة ضمائر غيبة :الأول ضمير { فإنه } وهو عائد إلى الله تعالى .والثاني الضمير المستتِر في { يسلك } وهو لا محالة عائد إلى الله تعالى كما عاد إليه ضمير { فإنه } .والثالث والرابع ضميرَا { من بين يديه ومن خلفه } ، وهما عائدان إلى { رسول } أي فإن الله يسلك أي يرسل للرسول رصَداً من بين يدي الرسول صلى الله عليه وسلم ومن خلفه رصداً ، أي ملائكة يحفظون الرسول صلى الله عليه وسلم من إلقاء الشياطين إليه ما يخلط عليه ما أطلعه الله عليه من غيبه .والسّلْك حقيقته : الإِدخال كما في قوله تعالى : { كذلك نسْلكه في قلوب المجرمين } في سورة الحجر ( 12 ) .وأطلق السَّلك على الإِيصال المباشر تشبيهاً له بالدخول في الشيء بحيث لا مصرف له عنه كما تقدم آنفاً في قوله : { ومن يعرض عن ذكر ربه نسلكه عذاباً صعَدَاً } \\[ الجن : 17 \\] أي يرسل إليه ملائكة متجهين إليه لا يبتعدون عنه حتى يَبْلُغَ إليه ما أُوحي إليه من الغيب ، كأنّهم شبه اتصالهم به وحراستهم إياه بشيء داخل في أجزاء جسم . وهذا من جملة الحفظ الذي حفظ الله به ذكره في قوله : { إنا نحن نزلنا الذّكر وإنا له لحافظون } \\[ الحجر : 9 \\] .والمراد ب { مِن بين يديه ومن خلفه } الكناية عن جميع الجهات ، ومن تلك الكناية ينتقل إلى كناية أخرى عن السلامة من التغيير والتحريف .والرصد : اسم جمع كما تقدم آنفاً في قوله : { يجد له شهاباً رصداً } \\[ الجن : 9 \\] . وانتصب { رصداً } على أنه مفعول به لفعل { يسلك .ويتعلق ليعلم } بقوله : { يسلك ، } أي يفعل الله ذلك ليبلّغ الغيب إلى الرسول كما أرسل إليه لا يخالطه شيء مما يلبس عليه الوحي فيعلم الله أن الرسُل أبلغوا ما أوحي إليه كما بعثَه دون تغيير ، فلما كان علم الله بتبليغ الرسول الوحي مفرعاً ومسبباً عن تبليغ الوحي كما أنزل الله ، جعل المُسَبب علّة وأقيم مقام السَّبب إيجازاً في الكلام لأن علم الله بذلك لا يكون إلاّ على وفق ما وقع ، وهذا كقول إياس بن قبيصة :وأقبلتُ والخطّيُّ يخطِر بيننَا ... لأعلَمَ مَنْ جَبَانُها مِن شجاعهاأي ليظهر من هو شجاع ومن هو جبان فأعلمَ ذلك . وهذه العلة هي المقصد الأهم من اطلاع من ارتضى من رسول على الغيب ، وذكر هذه العلة لا يقتضي انحصار علل الاطلاع فيها .وجيء بضمير الإِفراد في قوله : { من بين يديه ومن خلفه } مراعاة للفظ { رَسول ، }\n\n",
      "translations": [
        {
          "translation": "Save unto every messenger whom he hath chosen) He reveals to them some instances of the Unseen, (and then He maketh a guard) angels (to go before him) before the messenger (and a guard behind him) to protect him from the jinn, devils and human beings so that they do not hear Gabriel reciting the revelations.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَإِنَّهُ يَسْلُكُ مِن بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ رَصَداً } معناه الملائكةُ يَحفَظُونَ رُسلَ الله صلواتُ الله عليهم مِنْ بينِ أَيديهِم ومِنْ خَلْفِهِم في الأَداءِ عن الله تعالى إلى خَلْقِهِ وحيهِ وأمرهِ ونَهيهِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah, {Indeed, He is mounted over their shoulders. And He is watching over them from before them and from behind them}, means that the angels are guarding the messengers of Allah and the prayers of Allah upon them, from before them and from behind them, in their performance for Allah, the Exalted, to His creation, and His life, and His command, and His prohibition.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ } أي: يطلع من بعض غيوبه على { مَنِ ٱرْتَضَىٰ مِن رَّسُولٍ } مأمور على غيبه\n له قابلية الخلافة والنيابة عنه سبحانه { فَإِنَّهُ } يطلعه من غيبه على سبيل الوحي والإلهام حين { يَسْلُكُ } ويوكل سبحانه\n لحفظه وحراسته { مِن بَيْنِ يَدَيْهِ } أي: بين يدي المرتضى { وَمِنْ خَلْفِهِ رَصَداً } [الجن: 27] حراساً من الملائكة يحرسونه من استراق الشياطين\n واختطافهم وتخليطهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإنه يَسْلُكُ } يدخل { مِن بين يديه } أي: الرسول\n { ومِن خلفه } عند إظهاره على غيبه\n { رَصَداً } حفظة وحَرَساً من الملائكة يحفظونه من تعرُّض الشيطان\n لما أظهره عليه من الغيوب\n ويعصمونه من وساوسهم\n وتخاليطهم حتى يُبلغ الوحي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:14",
      "similarity": 0.7259594248668718
    },
    {
      "verse": "78:21",
      "similarity": 0.7081819753917908
    },
    {
      "verse": "9:107",
      "similarity": 0.4796686131693425
    },
    {
      "verse": "15:12",
      "similarity": 0.4142530970464627
    },
    {
      "verse": "26:200",
      "similarity": 0.4142530970464627
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/072027.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/072027.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/72:27.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}