{
  "chapter": "الجن",
  "text": "الا بلغا من الله ورسلته ومن يعص الله ورسوله فان له نار جهنم خلدين فيها ابدا",
  "translations": [
    {
      "translation": "only in transmitting from Allah and His Messages. As for him who disobeys Allah and His Messenger, he will have the Fire of Hell, remaining in it timelessly, for ever and ever.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unless I convey from God and deliver His message.\" For those who disobey God and His Apostle is the fire of Hell, where they will abide for ever;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(My task is no more than) to deliver Allah's proclamation and His messages. And whoever disobeys Allah and His Messenger, surely the Fire of Hell awaits him; therein he will abide in perpetuity.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My only (means of protection) is to convey the message of God. Whoever disobeys God and His Messenger will go to hell, wherein he will live forever\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“I only convey the commands from Allah, and His messages; and whoever disobeys the commands of Allah and His Noble Messenger – then indeed for him is the fire of hell, in which they will remain for ever and ever.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Mine is) but conveyance from Allah and His Messages, and whosoever disobeys Allah and His Messenger, then verily, for him is the fire of Hell, he shall dwell therein forever.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It is) only a delivering (of communications) from Allah and His messages; and whoever disobeys Allah and His Apostle surely he shall have the fire of hell to abide therein for a long time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "excepting a Deliverance from God and His Messages. And whoso rebels against God and His messenger, for him there awaits the Fire of Gehenna; therein they shall dwell forever.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Mine is) but conveyance (of the Truth) from Allah, and His messages; and whoso disobeyeth Allah and His messenger, lo! his is fire of hell, wherein such dwell for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My duty is only to convey that which I receive from Him and His messages.\" For those who disobey God and His Messenger there is the fire of hell, wherein they will abide forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Mine is but the publishing from Allah and His messages; and whosoever disobeyeth Allah and His apostle, his portion verily is the Hell-Fire as abiders therein for evermore.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[I have no duty] except to transmit from Allah, and [to communicate] His messages; and whoever disobeys Allah and His apostle, there will indeed be for him the fire of hell, to remain in it forever.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Unless I proclaim what I receive from Allah and His Messages: for any that disobey Allah and His Messenger,- for them is Hell: they shall dwell therein for ever.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Mine is) but conveyance (of the truth) from Allah and His Messages (of Islamic Monotheism), and whosoever disobeys Allah and His Messenger, then verily, for him is the Fire of Hell, he shall dwell therein forever.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "except a deliverance from Allah and His Messages. He who disobeys Allah and His Messenger, for him is the Fire of Gehenna, which he will be in for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Except for a proclamation from God and His messages. He who defies God and His Messenger—for him is the Fire of Hell, in which they will dwell forever.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But [I have for you] only notification from Allah, and His messages.\" And whoever disobeys Allah and His Messenger - then indeed, for him is the fire of Hell; they will abide therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:23] [I have power to bring you] only a communication (illā balāghan is excepted from the direct object clause of amliku, ‘I have power [to bring]’, that is to say, I have power only to communicate [the Message] to you, from God, that is, on His behalf, and His Messages (wa-risālātihi is a supplement to balāghan, ‘a communication’; what comes between the excepted clause and the clause from which it is excepted is a parenthetical statement intended to emphasise the preclusion of [the Prophet’s] ‘ability [to bring them anything else]’). And whoever disobeys God and His Messenger, concerning the affirmation of [His] Oneness, and hence does not believe — indeed there will be for him the fire of Hell, abiding (khālidīna is a circumstantial qualifier referring to the person indicated by man, ‘whoever’, in lahu, ‘for him’, taking into account its [plural] import; it [khālidīna] is also an implied circumstantial qualifier, in other words, they shall enter it with their abiding having been preordained) therein forever’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Mine is) but conveyance (of the Truth) from Allah) he says: nothing can save me except conveyance on behalf of Allah, (and His messages; and whoso disobeyeth Allah) regarding Allah's divine Oneness (and His messenger) in his conveyance of the message, (lo! His) in the Hereafter (is fire of hell, wherein such dwell forever) never to die or leave it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إلاّ بلاغاً } أي: أن أبلغكم بلاغاً صادراً من الله { و } أبلغكم { رسالاته } من معاني الوحي وأحكام الحق\n أي: لا أملك إلاّ التبليغ والرسالات فهو استثناء من معمول أملك\n وقوله: { ومن يعص الله ورسوله } منكم فلم يقبل نوره ولم يسمع ما يبلغه رسول العقل { فإنّ له نار } الطبيعة المحرقة باستيلائها عليه أبداً { حتى إذا رأوا } أي: يكونون عليه لبداً يستولون عليه بالازدحام حتى إذا رأوا { ما يُوعدون } في الرسالات من وقوع القيامة الصغرى بالموت أو الوسطى بظهور نور الفطرة واستيلاء القلب عليها\n أو الكبرى بظهور نور الوحدة فسيظهر ضعفهم وقلّة عددهم وخمود نارهم وانطفاؤها وكلالة حدّهم وشوكتهم بإحدى الأحوال الثلاث ولا ينصر بعضهم بعضاً لانقهارهم وعجزهم وفنائهم فيعلمون { أنهم أضعف ناصراً } من القلب { وأقل عدداً } وإن كادوا أن يقهروه بالكثرة واستقلّوه بالنسبة إلى عددهم فإن الواحد المؤيد من عند الله أقوى وأكثر\n[الصافات\n الآيات:171 - 172]\n\n[آل عمران\n الآية:160]\n { قل إن أدري أقريب ما توعدون } في القيامة الصغرى من الفناء والدخول في نار الطبيعة عند البعث لعدم الوقوف على قدر الله أو في الأخريين من الموت الإرادي والفناء الحقيقي لعدم الوقوف على قوة الاستعداد وضعفه فيقع عاجلاً\n أم ضرب الله له غاية وأجلاً هو { عالم الغيب } وحده { فلا } يطلع { على غيبه أحداً * إلاَّ من ارتضى من رسول } أي: أعدّه في الفطرة الأولى وزكّاه وصفّاه من رسول القوة القدسية { فإنه يسلك من بين يديه } أي: من جانبه الإلهي { ومن خلفه } وجهته البدنية { رصداً } حفظة أما من جهة الله التي إليها وجهه فروح القدس والأنوار الملكوتية والربانية\n وأما من جهة البدن فالملكات الفاضلة والهيئات النورية الحاصة من هياكل الطاعات والعبادات يحفظونه من تخبيط الجنّ وخلط كلامهم من الوساوس والأوهام والخيالات بمعارفها اليقينية ومعانيها القدسية والواردات الغيبية والكشوف الحقيقية\n { ليعلم أن قد أبلغوا } ليظهر علمه تعالى في مظاهر الرسل مما كان مكنوناً في استعدادهم فيكملوا وكملوا بما أمكنهم حمله من رسالاته وإبلاغه { وأحاط بما لديهم } من العقل الفرقاني والمعاني المكنونة في فطرتهم أزلاً فأظهرها { وأحصى كل شيء } أي: ضبط كل شيء بالعقل الفرقاني وإبراز الكمال التام جملة وتفصيلاً كلياً وجزئياً\n أو ضبط عدد كل شيء مطلقاً في القضاء والقدر كلياً وجزئياً\n والله تعالى أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِلاَّ بَلاَغاً } وتبليغاً { مِّنَ ٱللَّهِ } ما أوحى إليَّ { وَ } سوى أداء { رِسَالاَتِهِ } التي أرسلني بها\n وما لي سوى الإبلاغ والتبليغ { وَ } من جملة ما أُوحي ليَّ: إنه { مَن يَعْصِ ٱللَّهَ } ويعرض عنه وعن عبادته من عباده { وَ } لم يصدق { رَسُولَهُ } المستخلف منه\n القائم بأمره { فَإِنَّ لَهُ } أي: حق وثبت له { نَارَ جَهَنَّمَ } في النشأة الأخرى\n وبالجملة: صار العاصون المعرضون { خَالِدِينَ فِيهَآ أَبَداً } [الجن: 23] لا نجاة لهم منها أصلاً\n\n\nوهم لا يزالون لى عصيانهم بالله\n مستظهرين بما معهم من الجاه والثروة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله: { ورسالاته }: عطف على \" بلاغاً \" \n كأنه قيل: لا أملك لكم إلا التبليغ والرسالات\n أي: إلاّ أن أُبلغ عن الله\n فأقول قال الله كذا\n ناسباً قوله إليه\n وأن أُبلّغ رسالاته التي أرسلني بها\n بلا زيادة ولا نقصان ومِن ليست صلة للتبليغ\n إنما هي بمنزلة مِن في قوله:\n[التوبة:1] أي: بلاغاً كائناً من الله وتبليغ رسالاته قاله النسفي\n والله تعالى أعلم\n الإشارة: وأنَّ مساجد الحضرة لله\n والحضرة: شهود الذات الأقدس وحدها\n فلا تدعوا مع الله أحداً\n أي: لا تَروا معه غيره\n فتخرجوا من حضرته\n وأنه لمّا قام عبدُ الله\n وهو الداعي إلى الله في كل زمان يدعوه\n ويدعو إليه\n كادوا يكونون عليه لِبداً\n إمّا متعجبين منه\n أو مقتبسين من أنواره\n قال: إنما أدعو ربي ولا أُشرك به شيئاً قل يا أيها الداعي لتلك اللبد\n لا أملك لكم من الله غيًّا ولا رشداً\n إلاَّ بلاغاً\n أي إنذاراً وتبليغ ما كُلفت به\n فإنما أنا أدعو\n والله يهدي على يدي مَن يشاء إلى صراط مستقيم\n قل يا أيها الداعي: إني لن يُجيرني من الله أحد إن قَصّرت في الدعوة أو أسأت الأدب\n ولن أجد من دونه ملتجأ\n وبالله التوفيق\n ثم ذكر وبال مَن ردّ الرسالة\n فقال: {\n\n\nوَمَن يَعْصِ ٱللَّهَ وَرَسُولَهُ فَإِنَّ لَهُ نَارَ جَهَنَّمَ خَالِدِينَ فِيهَآ أَبَداً حَتَّىٰ إِذَا رَأَوْاْ مَا يُوعَدُونَ فَسَيَعْلَمُونَ مَنْ أَضْعَفُ نَاصِراً وَأَقَلُّ عَدَداً قُلْ إِنْ أَدْرِيۤ أَقَرِيبٌ مَّا تُوعَدُونَ أَمْ يَجْعَلُ لَهُ رَبِّيۤ أَمَداً عَالِمُ ٱلْغَيْبِ فَلاَ يُظْهِرُ عَلَىٰ غَيْبِهِ أَحَداً إِلاَّ مَنِ ٱرْتَضَىٰ مِن رَّسُولٍ فَإِنَّهُ يَسْلُكُ مِن بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ رَصَداً لِّيَعْلَمَ أَن قَدْ أَبْلَغُواْ رِسَالاَتِ رَبِّهِمْ وَأَحَاطَ بِمَا لَدَيْهِمْ وَأَحْصَىٰ كُلَّ شَيْءٍ عَدَداً }\n\nيقول الحق جلّ جلاله: { ومَن يعص اللهَ ورسولَه } في رد رسالته\n وعدم قبول ما جاء به الرسول\n { فإِنَّ له نارَ جهنمَ } \n وقُرىء بفتح الهمزة\n أي: فحقه\n أو فجزاؤه أنّ له نار جهنم\n { خالدين فيها } أي: في النار { أبداً } \n وحّد في قوله \" له \" وجمع في \" خالدين \" للفظ من ومعناه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:22",
      "similarity": 0.5154013970095487
    },
    {
      "verse": "33:65",
      "similarity": 0.5093049478194215
    },
    {
      "verse": "4:169",
      "similarity": 0.4245583675774405
    },
    {
      "verse": "79:21",
      "similarity": 0.41458145584808825
    },
    {
      "verse": "65:11",
      "similarity": 0.38767104544936026
    }
  ]
}