{
  "chapter": "الجن",
  "text": "علم الغيب فلا يظهر على غيبه احدا",
  "translations": [
    {
      "translation": "He is the Knower of the Unseen, and does not divulge His Unseen to anyone -",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the knower of the Unknown, and He does not divulge His secret to any one\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Knower of the Unseen, and He does not disclose His Unseen to anyone\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He knows the unseen and He does not allow anyone to know His secrets except those of His Messengers whom He chooses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The All Knowing of all the hidden does not give anyone the control over His secrets.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The All-Knower of the Unseen, and He reveals to none His Unseen.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Knower of the unseen! so He does not reveal His secrets to any,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knower He of the Unseen, and He discloses not His Unseen to anyone,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He is) the Knower of the Unseen, and He revealeth unto none His secret,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He alone has knowledge of what is hidden. He reveals this to none,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Knower of the unseen, and He discloseth not His unseen Unto anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Knower of the Unseen, He does not disclose His [knowledge of the] Unseen to anyone,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (alone) knows the Unseen, nor does He make any one acquainted with His Mysteries,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He Alone) the All-Knower of the Gha'ib (unseen), and He reveals to none His Gha'ib (unseen).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Knower of the Unseen and does not disclose His Unseen to anyone,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Knower of the Invisible; He does not disclose His Invisible to anyone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[He is] Knower of the unseen, and He does not disclose His [knowledge of the] unseen to anyone\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:26] Knower [He is] of the Unseen, what is hidden from servants, and He does not disclose, He [does not] reveal, His Unseen to anyone, from mankind,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He is) the knower of the Unseen) He knows when the chastisement will happen, (and He revealeth unto none His secret,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nإذ هو { عَٰلِمُ ٱلْغَيْبِ } حسب حكمته { فَلاَ يُظْهِرُ } ولا يطلع { عَلَىٰ غَيْبِهِ } المختص به { أَحَداً } [الجن: 26] من خلقه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وحُمل { ما يوعدون } على ما رأوه يوم بدر، ويُبعده قوله تعالى: { قل إِن أدرِي أقريب ما تُوعَدُون } من العذاب، { أم يجعل له ربي أمداً } غاية بعيدة يعني: أنكم معذَّبون قطعاً، ولكن لا أدري أهو حالّ أم مؤجّل؟ { عالِمُ الغيبِ } أي: هو عالم الغيب، { فلا يُظْهِر } فلا يُطلع { على غيبه أحداً إِلاّ مَن ارتضى من رسولٍ } أي: إلاَّ رسولاً قد ارتضاه لِعلْمِ بعض الغيب ليكون إخباره عن الغيب معجزةً له، والولي إذا أخبر بشيء فظهر فهو غير جازم به، وإنما أخبر به بناءً على رؤيا، أو بالفراسة، أو بتجلِّ قلبي، على أنّ كل كرامة لوليّ فهي معجزة لنبيه\n قال بعضهم: وفي هذه الآية دلالة على تكذيب المنجّمة، وليس كذلك، فإنَّ فيهم مَن يَصدق خبره، وكذلك المتطببة، فإنهم يعرفون طبائع النبات، وذا لا يُعرف بالتأمُّل، فعلم بأنهم وقفوا على علمه من جهة رسول انقطع أثره، وبقي علمه في الخلق\n قاله النسفي\n فتحصّل: أنّ إطلاع النبي على الغيب قطعي، وغيره ظني\n وقال أبو السعود: وليس في الآية ما يدلّ على نفي كرامات الأولياء المتعلقة بالكشف، فإنّ اختصاص الغاية القاصية من مراتب الكشف بالرسل لا يستلزم عدم حصول مرتبةٍ ما من تلك المراتب لغيرهم أصلاًن ولا يدعي أحدٌ لأحدٍ من الأولياء ما في رتبة الرسل عليهم السلام من الكشف الكامل الحاصل بالوحي الصريح\n هـ\n وفيه تعريض بالزمخشري، فإنه استدل بالآية على نفي كرامات الأولياء، قال: لأنَّ الله خصّ الاطلاع على الغيب بالرسل دون غيرهم\n قال بعض العلماء: ولا غرابة في إنكار معظم المعتزلة لكرامات الأولياء إذ هم لم يُشاهدوا في جماعتهم الضالة المضلة ولياً لله تعالى قط، فكيف يعرفون الكرامة؟!!\n هـ",
      "translations": []
    }
  ]
}