{
  "chapter": "الجن",
  "text": "ليعلم ان قد ابلغوا۟ رسلت ربهم واحاط بما لديهم واحصى كل شىء عددۢا",
  "translations": [
    {
      "translation": "so that He may know that they have indeed transmitted the Messages of their Lord. He encompasses what is in their hands and has counted the exact number of everything.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that He may know if they have delivered their Lord's messages. He comprehends all that has been given them, and keeps count of everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He may know that they have delivered the messages of their Lord. He encompasses in His knowledge their surroundings and keeps a count of all things.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Messenger) so that He would know that the Messengers have conveyed the message of their Lord. He encompasses all that is with them and He keeps a precise account of all things\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In order to see that they have conveyed the messages of their Lord – and His knowledge encompasses all whatever they have, and He has kept all things accounted for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Till he knows that they have conveyed the Messages of their Lord. And He surrounds all that which is with them, and He keeps count of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that He may know that they have truly delivered the messages of their Lord, and He encompasses what is with them and He records the number of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that He may know they have delivered the Messages of their Lord; and He encompasses all that is with them, and He has numbered everything in numbers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may know that they have indeed conveyed the messages of their Lord. He surroundeth all their doings, and He keepeth count of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He may know that the messengers have delivered the messages of their Lord. He encompasses all that is with them and He keeps count of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may know that they have preached the message of their Lord. And He comprehendeth whatever is with them, and He keepeth count of everything numbered.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He may ascertain that they have communicated the messages of their Lord, and He encompasses all that is with them, and He keeps an count of all things.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may know that they have (truly) brought and delivered the Messages of their Lord: and He surrounds (all the mysteries) that are with them, and takes account of every single thing.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[He (Allah) protects them (the Messengers)], till He sees that they (the Messengers) have conveyed the Messages of their Lord (Allah). And He (Allah) surrounds all that which is with them, and He (Allah) keeps count of all things (i.e. He knows the exact number of everything).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "so that He may know that they have delivered the Messages of their Lord and He encompasses all that is with them, and He has counted everything innumbers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That He may know that they have conveyed the messages of their Lord. He encompasses what they have, and has tallied everything by number.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That he may know that they have conveyed the messages of their Lord; and He has encompassed whatever is with them and has enumerated all things in number.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:28] so that He, God, may know, by knowledge outwardly manifested, that (an: softened in place of the hardened form, that is to say, annahu) they, that is, the messengers, have conveyed the Messages of their Lord (the plural person [of the verb ablaghū, ‘they have conveyed’] takes into account [the plural] implication of man, ‘whom’), and He encompasses all that is with them (wa-ahāta bimā ladayhim is a supplement to an implied clause, that is to say: so He has knowledge of that) and keeps count of all things’ (‘adadan, ‘count’, is for specification; it is transformed from a direct object [sc. ‘adada], originally: ahsā ‘adada kulli shay’in, ‘He keeps count of all things’). Meccan, except for verse 20, which is Medinese; it consists of 20 verses.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(That He) that Muhammad (pbuh) (may know that they) i.e. the messengers (have indeed conveyed the messages of their Lord) the angels protected them just as they are protecting you; it is also said that this means: so that the messengers, Muhammad and other messengers, know that the angels have conveyed the message from Allah; and it is also said that this means: so that the jinn and human beings know that the messengers have conveyed the messages of their Lord. (He surroundeth all their doings) He has full knowledge of all the angels that surround them, (and He keepeth count of all things) it is also said that He 702 knows their number just as He knows the state of the one who is wrapped up in his raiment'. And of the surah in which the Enshrouded One is mentioned, which is all Meccan-except for His saying (Leave Me to deal with the deniers, lords of ease and comfort (in this life); and do thou respite them awhile) which is Medinan-and consists of 19 verses, 285 words and 838 letters: Surah 73: The Enshrouded One (al-Muzzammil) And of the surah in which the Enshrouded One is mentioned, which is all Meccan-except for His saying (Leave Me to deal with the deniers, lords of ease and comfort (in this life); and do thou respite them awhile) which is Medinan— and consists of 19 verses, 285 words and 838 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإنما فعل كذللك عند إطلاعه ووحيه إلى رسوله { لِّيَعْلَمَ } الرسول الموحى إليه { أَن } أي: إنه { قَدْ أَبْلَغُواْ } أي: حاملو الوحي مطلقاً { رِسَالاَتِ رَبِّهِمْ } على وجهها مصونة محروسة عن اختطاف الشياطين\n وتخليطاتهم المغيرة لها { وَ } الحال إنه سبحانه قد { أَحَاطَ بِمَا لَدَيْهِمْ } أي: لدى لارسل والملائكة جميعاً علماً وحضوراً\n بل { وَ } قد { أَحْصَىٰ كُلَّ شَيْءٍ } دخل في حيطة الوجود { عَدَداً } [الجن: 28] بحيث لاي يعزب عن حيطة علمه وإحاطته شيء مما لمع عليه برق الوجود\n\n\nخاتمة السورة\n\nعليك أيها المحقق المنكشف بإحاطة العلم الإلهي ولوح قضائه\n وقلم تصويره وتخطيطه أن تعتقد وتذعن أن عمومم ما رجى في ملكه وملكوته إنما هو بأمره ووحيه\n ونفوذ قضائه ومضاء حكمه على حسب الحضور\n بحيث يجتمع عند حضوره الأزل والأبد\n والأولى والأخرى\n والغيب والشهادة\n إذ لا انقضاء دونه\n ولا انصرام ولا تجدد لديه\n ولا انخرام\n بل الكل بالنسبة إلى قدرته وإرادته على سواء بلا تفاوت وتخالف\n\n\nجعلنا الله من المنكشفين بحضور الحق وشهوده\n مع كل شيء ودونه بمنِّه وجوده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ليعلم } اللهُ عِلْمَ شهادة { أن قد أَبلغوا } أي: الرسل { رسالات ربهم } كاملة\n بلا زيادة ولا نقصان\n إلى المرسَل إليهم\n أي: ليعلم ذلك على ظهور\n وقد كان يعلم ذلك قبل وجوده\n\nووحّد الضمير في \" يديه وخلفه \" مراعاة للفظ مَن\n وجمع في أَبلَغوا لمعناه\n و \" أن \" مخففة من الثقيلة\n واسمها: ضمير الشأن\n والجملة خبرها\n { وأحاط } الله تعالى { بما لديهم } أي: بما عند الرسل من العلم { وأحْصَى كُلَّ شيءٍ عَدَداً } \n من القطر\n والرمل\n وورق الأشجار\n وزبد البحر\n فكيف لا يحيط بما عند الرسل من وحيه وكلامه؟! و \" عدداً \": حال\n أي: علم كلّ شيءٍ معدوداً محصوراً\n أو مصدر\n أي: أحصاه إحصاءً\n الإشارة: ومَن يعص اللهَ ورسولَه\n أو خليفته الداعي إلى الله بطريق التربية النبوية\n فإنَّ له نار القطيعة\n خالدين فيها أبداً\n وقد كانوا في حال حياتهم يستظهرون عليه بالدعاوى الفارغة\n وكثرة الأتباع\n حتى إذا رأوا ما يُوعدون من أمارات الموت\n فسيعلمون مَن أضعف ناصراً وأقل عدداً\n قل: إن أدري أقريب ما تُوعدون من الموت\n أم يجعل له ربي أمداً\n ولا بد أن ينتهي\n ويقع الرحيل إلى دار تنكشف فيها السرائر\n ويُفضح فيها الموعود\n عالم الغيب\n أي: يعلم ما غاب عن الحس من أسرار ذاته وأنوار ملكوته\n أي: يعلم أسرار المعاني القائمة بالأواني\n فلا يظهر على غيبه أحداً\n أي: لا يكشف عن اسرار ذاته في دار الدنيا إلاّ لمَن ارتضى من رسول\n أو نائبه\n وهو العارف الحقيقي\n فإنه يسلك من بين يديه ومن خلفه رَصَداً\n أي: يحفظه من جميع القواطع\n من كل جهاته\n حتى يوصله إلى حضرة أسرار ذاته\n ليظهر أن قد أبلغوا رسالات ربهم\n ودعوا الناس إلى معرفة ذاته\n وقد أحاط تعالى بكل شيء علماً\n وأحصى كل شيء عدداً\n وبالله التوفيق\n وصلّى الله على سيدنا محمد وآله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:94",
      "similarity": 0.6735980170398528
    },
    {
      "verse": "16:18",
      "similarity": 0.6305085484721931
    },
    {
      "verse": "14:34",
      "similarity": 0.6228532149084222
    },
    {
      "verse": "78:29",
      "similarity": 0.5930026973378372
    },
    {
      "verse": "18:91",
      "similarity": 0.5268269278930586
    }
  ]
}