{
  "chapter": "الجن",
  "text": "وانه تعلى جد ربنا ما اتخذ صحبة ولا ولدا",
  "translations": [
    {
      "translation": "He - exalted be the Majesty of our Lord ! - has neither wife nor son.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted is the glory of our Lord; He has neither wife nor son.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that “He – exalted be His Majesty – has not taken to Himself either a wife or a son”;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "our Lord is too exalted to have either a wife or son.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘And that our Lord’s Majesty is Supreme – He has neither chosen a wife nor a child.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "`And He, exalted be the Jadd of our Lord, has taken neither a wife nor a son.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He-- exalted be the majesty of our Lord-- has not taken a consort, nor a son:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He -- exalted be our Lord's majesty! has not taken to Himself either consort or a son.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (we believe) that He - exalted be the glory of our Lord! - hath taken neither wife nor son,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and exalted is the majesty of our Lord, He has taken neither a wife nor a son.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He - exalted be the majesty of our Lord!-hath taken neither a spouse nor a son.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted be the majesty of our Lord; He has taken neither any spouse nor son.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Exalted is the Majesty of our Lord: He has taken neither a wife nor a son.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And exalted be the Majesty of our Lord, He has taken neither a wife, nor a son (or offspring or children).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He exalted be the Majesty of our Lord, who has neither taken to Himself a wife, nor a son!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Exalted is the Grandeur of our Lord—He never had a mate, nor a child.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [it teaches] that exalted is the nobleness of our Lord; He has not taken a wife or a son\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:3] And [we believe] that (annahu: the pronoun in this and in the next two instances is that of the matter) — exalted be the majesty of our Lord, transcendent is His majesty and magnificence above what is ascribed to Him — He has taken neither spouse nor son.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَأَنَّهُ تَعَالَى جَدُّ رَبِّنَا مَا اتَّخَذَ صَاحِبَةً وَلَا وَلَدًا (3)هذا محكي عن كلام الجن ، قرأه الجمهور بكسر همزة { إنه } على اعتباره معطوفاً على قولهم : { إنَّا سمعنا قرآنا عجباً } \\[ الجن : 1 \\] إذ يجب كسر همزة ( إنَّ ) إذا حكيت بالقول .وقرأه ابن عامر وحمزة والكسائي وحفص وأبو جعفر وخلف بفتح الهمزة على أنه معطوف على الضمير المجرور بالباء في قوله : { فآمنَّا به } \\[ الجن : 2 \\] أي وآمنا بأنه تعالى جَد ربنا . وعدم إعادة الجار مع المعطوف على المجرور بالحرف مستعمل ، وجوزه الكوفيون ، على أن حرف الجر كثير حذفه مع ( أنّ ) فلا ينبغي أن يختلف في حذفه هنا على هذا التأويل .قال في «الكشاف» : { أنه استمع } \\[ الجن : 1 \\] بالفتح لأنه فاعل أوحي ( أي نائب الفاعل ) { وإنَّا سَمِعنا } بالكسر لأنه مبتدأ محكي بعد القول ثم تحمل عليهما البواقي فما كان من الوحي فُتح وما كان من قول الجن كُسر ، وكُلّهن من قولهم ، إلاّ الثنتين الأخريين : { وأن المساجد لله } \\[ الجن : 18 \\] ، { وأنه لما قام عبد الله } \\[ الجن : 19 \\] ومن فتح كُلهن فعطفاً على محل الجار والمجرور في { ءامنا به } \\[ الجن : 2 \\] كأنه قيل : صدقناه وصدقنا أنه تعالى جَدّ ربنا ، وأنه كان يقول سفيهنا ، وكذلك البواقي اه .والتعالي : شدة العلوّ ، جعل شديد العلوّ كالمتكلف العلوّ لخروج علوّه عن غالب ما تعارفه الناس فأشبه التكلُف .والجَدّ : بفتح الجيم العظمة والجلال ، وهذا تمهيد وتوطئة لقوله : { ما اتخذ صاحبة ولا ولَداً } ، لأن اتخاذ الصاحبة للافتقار إليها لأنسها وعونها والالتذاذ بصحبتها ، وكل ذلك من آثار الاحتياج ، والله تعالى الغني المطلق ، وتعالِي جَدّه بغناه المطلق ، والولد يرغب فيه للاستعانة والأنس به ، مع ما يقتضيه من انفصاله من أجزاء والديه وكل ذلك من الافتقار والانتقاص .وضمير { إنه } ضمير شأن وخبره جملة { تعالى جد ربنا .وجملة ما اتخذ صاحبة } إلى آخرها بَدل اشتمال من جملة { تعالى جد ربنا .وتأكيد الخبر ب ( إن ) سواء كانت مكسورة أو مفتوحة لأنه مسوق إلى فريق يعتقدون خلاف ذلك من الجن .والاقتصار في بيان تَعالِي جدِ الله على انتفاء الصاحبة عنه والولد ينبىء بأنه كان شائعاً في علم الجن ما كان يعتقده المشركون أن الملائكة بنات الله من سروات الجن وما اعتقاد المشركين إلاّ ناشىء عن تلقين الشيطان وهو من الجن ، ولأن ذلك مما سمعوه من القرآن مثل قوله تعالى : { سبحانه أنّى يكون له ولد ولم تكن له صاحبة } في سورة الأنعام ( 101 ) .وإعادة لا } النافية مع المعطوف للتأكيد للدلالة على أن المعطوف منفي باستقلاله لدفع توهم نفي المجموع .وضمير الجماعة في قوله : { ربنا } عائد إلى كل متكلم مع تشريك غيره ، فعلى تقدير أنه من كلام الجن فهو قول كل واحد منهم عن نفسه ومن معه من بقية النفر .\n\n",
      "translations": [
        {
          "translation": "(And (we believe) that He-exalted be the glory of our Lord-) and that the dominion of our Lord is exalted; it is also said this means: the tremendousness, sovereignty, absoluteness and attributes of our Lord are far exalted, and He (hath taken neither wife nor son) as the disbelievers claim,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قال: عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { وَأَنَّهُ تَعَالَىٰ جَدُّ رَبِّنَا } معناه عَلاَ ملكُ ربِّنا وسُلطانُهُ\n ويقال: جلالُ ربِّنا ويقال: غِنى ربّنا\n ويقال: عَظمةُ ربِّنا\n ويقال: أمرُ ربِّنا ويقال: ذِكرُ ربَّنا\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\nHe said: \"Ali ibn Ahmad told us...\"\n\n\nQaala 'Ataa ibn As-Sa'ib an-Nakhaa'i from Zayd ibn 'Ali, may Allah be pleased with them both, that the meaning of Allah's saying {And that He is the Most High, our Lord} is that He is above the kingship and dominion of our Lord.\n\n\nIt is said: \"The glory of our Lord,\" and it is said: \"Our Lord is rich.\"\n\n\nIt is said: The greatness of our Lord\n It is said: The command of our Lord, and it is said: The mention of our Lord.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وأنه تعالى } عظمة { ربّنا } من أن نتصوّره مدركة فتكيفه فيدخل تحت جنس فيتخذ { صاحبة } من صنف تحته أو { ولداً } من نوع يماثله { وأنه كان يقول سفيهنا } الذي هو الوهم { على الله شططاً } بأن كان يتوهمه في جهة ويجعله من جنس الموجودات المحفوفة باللواحق المادية فيماثل المخلوقات صنفاً أو نوعاً { وأنّ ظننا أن لن تقول } إنس الحواس الظاهرة ولا جنّ القوى الباطنة { على الله كذباً } فيما أدركوا منه فتوهمنا أن البصر يدرك شكله ولونه والأذن تسمع صوته والوهم والخيال يتوهمه ويتخيله حقاً مطابقاً لما هو عليه قبل الاهتداء والتنوّر\n فعلمنا من طريق الوحي أن ليست في شيء من إدراكه بل هو يدركها ويدرك ما تدركه ولا تدركه\n { وأنه كان رجال من الإنس يعوذون } أي: تستند القوى الظاهرة إلى القوى الباطنة وتتقوّى بها { فزادوهم } غشيان المحارم وإتيان المناهي بالدواعي الوهمية والنوازع الشهوية والغضبية والخواطر النفسانية\n { وأنهم ظنّوا كما ظننتم } قبل التنوّر بنور الهدى { أن لن يبعث الله } عليهم العقل المنوّر بنور الشرع فيهذبهم ويزكيهم ويؤدّبهم بالآداب الحسنة فيأتون ما يشتهون بمقتضى طباعهم ويعملون على حسب غرائزهم وأهوائهم ويتركون سدى بلا رياضة ويهملون هملاً بلا مجاهدة\n { وأنّا لمسنا } أي: طلبنا سماء العقل لنستفيد من مدركاته ما نتوصل به إلى لذاتنا ونسترق من مدركاته ما يعين في تحصيل مآربنا كما كان قبل التأدّب بالشرائع { فوجدناها ملئت حرساً شديداً } معاني حاجزة عن بلوغنا مقاصدنا وحكماً مانعة لنا عن مشتهياتنا قوية { وشُهباً } وأنواراً قدسية وإشراقات نورية تمنعنا من إدراك المعاني التي صفت عن شوب الوهم والوصول إلى طور العقل المنوّر بنور القدس\n فإن العقل قبل الهداية كان مشوباً بالوهم\n قريباً من أفق الخيال والفكر\n مقصوراً على تحصيل المعاش مناسباً للنفس وقواها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مع { أَنَّهُ تَعَالَىٰ } تبارك وتقدس { جَدُّ رَبِّنَا } أي: عظمته وكبرياؤه من أن يكون له شريك في ملكه وملكوته\n مع أنه الصمد الذي { مَا ٱتَّخَذَ صَاحِبَةً وَلاَ وَلَداً } [الجن: 3] فيكف يتخذ شريكاً\n مع أ\nه هو الواحد الأحد الصمد على الإطلاق\n لم يكن له شريك في الملك ونظير في الوجود؟! فكبره تكبيراً\n ونزه ذاته عمَّا يقول الظالمون علواً كبيراً\n\n\n{ وَ } بعدما آمنا بوحدة الحق وعرفناه وحيداً فريداً بلا شبيه ولا نظير\n ولا وزير ولا مشير",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأنه تعالى جَدُّ ربِّنا } أي: ارتفع أو تنَزّه عظمة ربنا\n أو سلطانه أو غناه\n يُقال: جَدّ فلان في عيني إذا عَظُم ومنه قول عمر: كان الرجل إذا قرأ البقرة وآل عمران جَدَّ في عيننا\n أي: عظم في عيوننا\n { ما اتخذَ صاحبةً } زوجة { ولا ولداً } كما يقول كفار الجن والإنس\n والمعنى: وصفوه بالاستغناء عن الصاحبة والولد لعظمته وسلطانه\n أو لغناه\n وقُرىء \" جَدًّا \" على التمييز\n أي: أنه تعالى ربنا جَداً\n وقُرىء بكسر الجيم أي: تنزّه صِدق ربوبيته\n وحق إلهيته عن اتخاذ الصاحبة والولد\n وذلك أنهم لمَّا سمعوا القرآن\n واهتدوا للتوحيد والإيمان\n تنبّهوا للخطأ فيما اعتقده كفرة الجن من تشبيهه تعالى بخلقه في اتخاذ الصاحبة والولد فاستعظموه ونزّهوه تعالى عنه\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:16",
      "similarity": 0.7303576785820359
    },
    {
      "verse": "32:10",
      "similarity": 0.7088673477749917
    },
    {
      "verse": "14:19",
      "similarity": 0.6903984492959788
    },
    {
      "verse": "13:5",
      "similarity": 0.3957327207839747
    },
    {
      "verse": "17:49",
      "similarity": 0.2564117421920167
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/072003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/072003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/72:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}