{
  "chapter": "الجن",
  "text": "وانه تعلى جد ربنا ما اتخذ صحبة ولا ولدا",
  "translations": [
    {
      "translation": "He - exalted be the Majesty of our Lord ! - has neither wife nor son.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted is the glory of our Lord; He has neither wife nor son.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that “He – exalted be His Majesty – has not taken to Himself either a wife or a son”;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "our Lord is too exalted to have either a wife or son.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘And that our Lord’s Majesty is Supreme – He has neither chosen a wife nor a child.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "`And He, exalted be the Jadd of our Lord, has taken neither a wife nor a son.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that He-- exalted be the majesty of our Lord-- has not taken a consort, nor a son:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He -- exalted be our Lord's majesty! has not taken to Himself either consort or a son.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (we believe) that He - exalted be the glory of our Lord! - hath taken neither wife nor son,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and exalted is the majesty of our Lord, He has taken neither a wife nor a son.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And He - exalted be the majesty of our Lord!-hath taken neither a spouse nor a son.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Exalted be the majesty of our Lord; He has taken neither any spouse nor son.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Exalted is the Majesty of our Lord: He has taken neither a wife nor a son.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And exalted be the Majesty of our Lord, He has taken neither a wife, nor a son (or offspring or children).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He exalted be the Majesty of our Lord, who has neither taken to Himself a wife, nor a son!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Exalted is the Grandeur of our Lord—He never had a mate, nor a child.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [it teaches] that exalted is the nobleness of our Lord; He has not taken a wife or a son\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:3] And [we believe] that (annahu: the pronoun in this and in the next two instances is that of the matter) — exalted be the majesty of our Lord, transcendent is His majesty and magnificence above what is ascribed to Him — He has taken neither spouse nor son.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (we believe) that He-exalted be the glory of our Lord-) and that the dominion of our Lord is exalted; it is also said this means: the tremendousness, sovereignty, absoluteness and attributes of our Lord are far exalted, and He (hath taken neither wife nor son) as the disbelievers claim,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قال: عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { وَأَنَّهُ تَعَالَىٰ جَدُّ رَبِّنَا } معناه عَلاَ ملكُ ربِّنا وسُلطانُهُ\n ويقال: جلالُ ربِّنا ويقال: غِنى ربّنا\n ويقال: عَظمةُ ربِّنا\n ويقال: أمرُ ربِّنا ويقال: ذِكرُ ربَّنا\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n\n\nHe said: \"Ali ibn Ahmad told us...\"\n\n\nQaala 'Ataa ibn As-Sa'ib an-Nakhaa'i from Zayd ibn 'Ali, may Allah be pleased with them both, that the meaning of Allah's saying {And that He is the Most High, our Lord} is that He is above the kingship and dominion of our Lord.\n\n\nIt is said: \"The glory of our Lord,\" and it is said: \"Our Lord is rich.\"\n\n\nIt is said: The greatness of our Lord\n It is said: The command of our Lord, and it is said: The mention of our Lord.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مع { أَنَّهُ تَعَالَىٰ } تبارك وتقدس { جَدُّ رَبِّنَا } أي: عظمته وكبرياؤه من أن يكون له شريك في ملكه وملكوته\n مع أنه الصمد الذي { مَا ٱتَّخَذَ صَاحِبَةً وَلاَ وَلَداً } [الجن: 3] فيكف يتخذ شريكاً\n مع أ\nه هو الواحد الأحد الصمد على الإطلاق\n لم يكن له شريك في الملك ونظير في الوجود؟! فكبره تكبيراً\n ونزه ذاته عمَّا يقول الظالمون علواً كبيراً\n\n\n{ وَ } بعدما آمنا بوحدة الحق وعرفناه وحيداً فريداً بلا شبيه ولا نظير\n ولا وزير ولا مشير",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأنه تعالى جَدُّ ربِّنا } أي: ارتفع أو تنَزّه عظمة ربنا، أو سلطانه أو غناه، يُقال: جَدّ فلان في عيني إذا عَظُم ومنه قول عمر: كان الرجل إذا قرأ البقرة وآل عمران جَدَّ في عيننا، أي: عظم في عيوننا، { ما اتخذَ صاحبةً } زوجة { ولا ولداً } كما يقول كفار الجن والإنس، والمعنى: وصفوه بالاستغناء عن الصاحبة والولد لعظمته وسلطانه، أو لغناه، وقُرىء \" جَدًّا \" على التمييز، أي: أنه تعالى ربنا جَداً، وقُرىء بكسر الجيم أي: تنزّه صِدق ربوبيته، وحق إلهيته عن اتخاذ الصاحبة والولد، وذلك أنهم لمَّا سمعوا القرآن، واهتدوا للتوحيد والإيمان، تنبّهوا للخطأ فيما اعتقده كفرة الجن من تشبيهه تعالى بخلقه في اتخاذ الصاحبة والولد فاستعظموه ونزّهوه تعالى عنه\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "35:16",
      "similarity": 0.7303576785820359
    },
    {
      "verse": "32:10",
      "similarity": 0.7088673477749917
    },
    {
      "verse": "14:19",
      "similarity": 0.6903984492959788
    },
    {
      "verse": "13:5",
      "similarity": 0.3957327207839747
    },
    {
      "verse": "17:49",
      "similarity": 0.2564117421920167
    }
  ]
}