{
  "chapter": "الجن",
  "text": "وانه كان يقول سفيهنا على الله شططا",
  "translations": [
    {
      "translation": "Certainly the foolish among us say preposterous things of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that “the foolish among us have been wont to say outrageous things about Allah”;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The dimwit one (the devil) among us has been telling confused lies about God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘And that the fool among us used to utter false exaggerations against Allah.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "`And that the foolish among us used to utter against Allah that which was an enormity in falsehood.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that the foolish amongst us used to forge extravagant things against Allah:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The fool among us spoke against God outrage,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that the foolish one among us used to speak concerning Allah an atrocious lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [now we know] that the foolish among us have been saying outrageous things about God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the foolish among us were wont to forge lie against Allah exceedingly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The foolish ones among us used to speak atrocious lies concerning Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There were some foolish ones among us, who used to utter extravagant lies against Allah;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that the foolish among us [i.e. Iblis (Satan) or the polytheists amongst the jinns] used to utter against Allah that which was wrong and not right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The ignorant fool among us has spoken outrageously against Allah,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the fools among us used to say nonsense about God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that our foolish one has been saying about Allah an excessive transgression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:4] And that the fool among us, the ignorant one among us, used to utter atrocious lies against God, extreme calumny by attributing to Him a spouse and a son.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And that the foolish one among us) i.e. the devil (used to speak concerning Allah an atrocious lie.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَأَنَّهُ كَانَ يَقُولُ سَفِيهُنَا عَلَى ٱللَّهِ شَطَطاً } معناه جَورٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما آمنا بوحدة الحق وعرفناه وحيداً فريداً بلا شبيه ولا نظير، ولا وزير ولا مشير، عرفنا { أَنَّهُ } ما { كَانَ يَقُولُ سَفِيهُنَا } إبليس المردود المطرود { عَلَى ٱللَّهِ } المقدس ذاته عن مطلق المماثلة والمشاكلة في الوجود القيومية، وسائر الصفات الذاتية المصححة للألوهية والربوبية قولاً { شَطَطاً } [الجن: 4] باطلاً بعيداً عن الحق بمراحل، مجاوزاً عن الحد في الإفراط، تعالى شأنه عما ينسب إليه المبطلون المفرطون\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وأنه كان يقول سفيهُنا } أي: جاهلنا من مردة الجن، أو إبليس إذ ليس فوقه سفيه، { على الله شططاً } أي: قولاً ذا شطط أي: بُعدٍ وجورٍ، وهو الكفر لبُعده عن الصواب، من: شطت الدار: بَعُدت، أو: قولاً مجاوزاً للحدّ، بعيداً عن القصد، أو هو شطط في نفسه لفرط بُعده عن الحق، وهو نسبة الصاحبة والولد لله تعالى\n والشطط: مجاوزة الحدِّ في الظلم وغيره",
      "translations": []
    }
  ]
}