{
  "chapter": "الجن",
  "text": "وانه كان رجال من الانس يعوذون برجال من الجن فزادوهم رهقا",
  "translations": [
    {
      "translation": "Certain men from among mankind used to seek refuge with certain men from among the jinn but they increased them in wickedness.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But some men used to seek refuge with some jinns, and this increased their waywardness;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that “some from among the humans used to seek protection of some among the jinn, and thus they increased the arrogance of the jinn”;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certain human beings sought refuge with certain jinn and this increased the rebelliousness of those jinn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘And indeed some men among humans used to take the protection of some men among jinns, so it further increased their haughtiness.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "`And verily, there were men among mankind who took shelter with the males among the Jinn, but they increased them in Rahaq.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that persons from among men used to seek refuge with persons from among jinn, so they increased them in wrongdoing:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But there were certain men of mankind who would take refuge with certain men of the jinn, and they increased them in vileness,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed (O Muhammad) individuals of humankind used to invoke the protection of individuals of the jinn, so that they increased them in revolt against Allah);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some men used to seek refuge with the jinn in the past, but that only increased their insolence.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And persons among humankind have been seeking refuge with persons of the Jinn, so that they increased them in evil disposition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed some persons from the humans would seek the protection of some persons from the jinn, thus only adding to their rebellion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "True, there were persons among mankind who took shelter with persons among the Jinns, but they increased them in folly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, there were men among mankind who took shelter with the masculine among the jinns, but they (jinns) increased them (mankind) in sin and disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But there were certain men from mankind who would take refuge with certain males from the jinn and they increased them in tyranny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some individual humans used to seek power through some individual jinn, but they only increased them in confusion.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there were men from mankind who sought refuge in men from the jinn, so they [only] increased them in burden.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:6]   And that certain individuals of mankind used to seek the protection of certain individuals of the jinn, when they stopped over in dangerous places during their journeys — whereat every man would say, ‘I seek the protection of the lord of this place against the evil of the insolent ones in it’ — so that they increased them, by their seeking their protection, in oppressiveness, such that they would say, ‘We are now lords of jinn and humans!’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Allah then said: (And indeed (0 Muhammad) individuals of humankind used to invoke the protection of individuals of the jinn so that they increased them) because of that (in revolt (against Allah)) in pride, arrogance, sedition, and corruption. This is because they were afraid of them whenever they travelled, caught a game or camped in a valley. And to avoid their harm they used to say: \"we seek refuge in the master of this valley from the foolish ones of his folk\" after which they felt safe. As a result, the masters of these places increased in nothing but pride and arrogance towards the communality among their folk. There are three kinds of jinn: one kind flies in the air; another kind ascends and descends wherever they wish; and a third kind resembles dogs and snakes;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } كنا من قبل انكشافنا بوحدة الحق { أَنَّهُ } أي: الشأن { كَانَ رِجَالٌ مِّنَ ٱلإِنسِ يَعُوذُونَ بِرِجَالٍ مِّنَ ٱلْجِنِّ } عند مرورهم بقفر، إذا أمسوا فيها كانوا يقولون: أعوذ بسيد هذا الوادي من سفهاء قومه، ومع استعاذتهم واستعانتهم { فَزَادُوهُمْ } أي: الجن والإنس { رَهَقاً } [الجن: 6] كبراً وعتواً، يختطفون عليهم ويخطبونهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأنه كان رجالٌ من الإِنس يعوذون برجالٍ من الجن } ، كان الرجل من العرب إذا نزل بوادٍ قفرٍ وخافَ على نفسه، يقول: أعوذ بسيد هذا الوادي من سفهاء قومه، يريد الجن وكبيرهم، فإذا سمعوا بذلك استكبروا وقالوا: سُدنا الإنس والجنّ، وذلك قوله تعالى: { فزادوهم } زاد الإنسُ والجنَّ باستعاذتهم بهم { رَهَقاً }: طغياناً وسفهاً وتكبُّراً وعتواً، أو: فزاد الجنُّ والإنسَ رهقاً: إثماً وغيًّا بأن أضلوهم، حتى استعاذوا بهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "18:73",
      "similarity": 0.475763892324748
    },
    {
      "verse": "74:17",
      "similarity": 0.4730018272793331
    },
    {
      "verse": "70:44",
      "similarity": 0.4707071529837942
    },
    {
      "verse": "114:1",
      "similarity": 0.4687697561260402
    },
    {
      "verse": "68:43",
      "similarity": 0.4529009165496995
    }
  ]
}