{
  "chapter": "الجن",
  "text": "وانا كنا نقعد منها مقعد للسمع فمن يستمع الءان يجد له شهابا رصدا",
  "translations": [
    {
      "translation": "We used to sit there on special seats to listen in. But anyone listening now finds a fiery meteor in wait for him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We sat in observatories to listen; but any one who listened found a shooting star in wait for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and that “we would take up stations in the heaven to try to hear but anyone who now attempts to listen finds a shooting meteor in wait for him”;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We used to sit near by and try to listen to the heavens, but shooting flames now await those who try to do that.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘And that we sometimes used to sit in some places in the sky, to listen; so whoever now listens finds a fiery comet waiting for him.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "`And verily, we used to sit there in stations, to (steal) a hearing, but any who listens now will find a flaming fire watching him in ambush.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that we used to sit in some of the sitting-places thereof to steal a hearing, but he who would (try to) listen now would find a flame lying in wait for him:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We would sit there on seats to hear; but any listening now finds a meteor in wait for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we used to sit on places (high) therein to listen. But he who listeneth now findeth a flame in wait for him;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "we used to take up a position to listen, but whoever listens now finds a flaming fire lying in wait for him --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we were wont to sit on seats therein to listen; but whosoever listeneth now findeth for him a dartin meteor in wait.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We used to sit in its positions to eavesdrop, but anyone listening now finds a flame waiting for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We used, indeed, to sit there in (hidden) stations, to (steal) a hearing; but any who listen now will find a flaming fire watching him in ambush.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And verily, we used to sit there in stations, to (steal) a hearing, but any who listens now will find a flaming fire watching him in ambush.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There, we would sit to eavesdrop, but now an eavesdropper finds a flame in wait for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We used to take up positions to listen in; but whoever listens now finds a projectile in wait for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And we used to sit therein in positions for hearing, but whoever listens now will find a burning flame lying in wait for him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[72:9] And we used to, that is to say, before his Mission, sit in [certain] places therein to listen in; but anyone listening now will find a meteor lying in wait for him, aimed at him, ready to strike him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَأَنَّا كُنَّا نَقْعُدُ مِنْهَا مَقَاعِدَ لِلسَّمْعِ فَمَنْ يَسْتَمِعِ الْآَنَ يَجِدْ لَهُ شِهَابًا رَصَدًا (9)وإنما أعيد معه كلمة { وإنا } للدلالة على أن الخبر الذي تضمنه هو المقصود وأن ما قبله كالتوطئة له فإعادة { وإنا } توكيد لفظي .وحقيقة القعود الجلوس وهو ضد القيام ، أي هو جعل النصف الأسفل مباشراً للْارض مستقراً عليها وانتصاب النصف الأعلى . وهو هنا مجاز في ملازمة المكان زمناً طويلاً لأن ملازمة المكان من لوازم القعود ومنه قوله تعالى : { واقْعدوا لهم كل مرصد } \\[ التوبة : 5 \\] .والمقاعد : جمع مقعد وهو مفعل للمكان الذي يقع فيه القعود ، وأطلق هنا على مكان الملازمة فإن القعود يطلق على ملازمة الحصول كما في قول امرىء القيس :فقلت يمين الله أبرح قاعداً ... واللام في قوله : { للسمع } لام العلة أي لأجل السمع ، أي لأن نسمع ما يجري في العالم العلوي من تصاريف الملائكة بالتكوين والتصريف ، ولعل الجن منساقون إلى ذلك بالجبلة كما تنساق الشياطين إلى الوسوسة ، وضمير { منها } للسماء .و ( من ) تبعيضية ، أي من ساحاتها وهو متعلق ب { نقعد } ، وليس المجرور حالاً من { مَقاعَد } مقدَّماً على صاحبه لأن السياق في الكلام على حالهم في السماء فالعناية بمتعلق فعل القعود أولى ، ونظيره قول كعب :يمشي القراد عليها ثم يزلقه ... مِنْها لبان وأقرب زهاليلفقوله ( منها ) متعلق بفعل ( يُزلقه ) وليس حالاً من ( لَبان ) .وأعلم أنه قد جرى على قوله تعالى : { مقاعد للسمع } مبحث في مَباحِث فصاحة الكلمات نسبه ابن الأثير في «المثل السائر» إلى ابن سنان الخفاجي فقال : إنه قد يجيء من الكلام ما معه قرينُهُ فأوجبَ قبحه كقول الرضي في رثاء الصابي :أعزِزْ عليَّ بأن أراك وقد خَلا ... عن جانبيْكَ مَقَاعِدُ العُوَّادفإن إيراد هذه اللفظة ( أي مقاعد ) في هذا الموضع صحيح إلاّ أنه يوافق ما يُكره ذكره لا سيما وقد أضافه إلى من يُحتمل إضافته ( أي ما يكره ) إليه وهم العُواد . ولو انفرد لكان الأمر فيه سهلاً . قال ابن الأثير : هذه اللفظة المعيبة في شعر الرضي قد جاءت في القرآن فجاءت حسنة مرضية في قوله تعالى : { تُبوِّىء المؤمنين مقاعد للقتال } \\[ آل عمران : 121 \\] وقوله : { وأنَّا كنا نقعد منها مقاعد للسمع } ، ألا ترى أنها في هاتين الآيتين غير مضافة إلى من تقبح إضافتها إليه ولو قال الشاعر بدلاً من مقاعد العُواد مقاعد الزيارة لزالت تلك الهجنة اه . وأقول : إن لمصطلحات الناس في استعمال الكلمات أثراً في وقع الكلمات عند الأفهام .والفاء التي فرعت { من يستمع الآن يَجِدْ له شهاباً رصداً } تفريع على محذوف دل عليه فعل { كنا } وترتب الشرط وجزائه عليه وتقديرُه : كنا نقعد منها ( أي من السماء ) مقاعد للسمع فنستمع أشياء فمن يستمعْ الآن لا يتمكَّن من السماع .وكلمة { الآن } مقابل كلمة { كنا } ، أي كان ذلك ثم انقضى .وجيء بصيغة الشرط وجوابه في التفريع لأن الغرض تحذير إخوانهم من التعرض للاستماع لأن المستمع يتعرض لأذى الشهب .والجنُّ لا تنكف عن ذلك لأنهم منساقون إليه بالطبع مع ما ينالهم من أذى الرجم والاحتراق ، شأنَ انسياق المخلوقات إلى ما خُلقت له مثل تهافت الفَراش على النار ، لاحتمال ضعف القوة المفكرة في الجن بحيث يغلب عليها الشهوة ، ونحن نرى البشر يقتحمون الأخطار والمهالك تبعاً للهوى مثل مغامرات الهُواة في البحار والجبال والثلوج .ووقع { شهاباً } في سياق الشرط يفيد العموم لأن سياق الشرط بمنزلة سياق النفي في إفادة عموم النكرة .والرصدَ : اسم جمع راصد وهو الحافظ للشيء وهو وصف ل { شهاباً } ، أي شهباً راصدة ، ووصفها بالرصْد استعارة شبهت بالحراس الراصدين . وهذا إشارة إلى انقراض الكهانة إذ الكاهن يتلقى من الجني أنباء مجملة بما يتلقفه الجنيّ من خبر الغيب تلقف اختطاف ناقصاً فيكمله الكاهن بحدْسه بما يناسب مجاري أحوال قومه وبلده . وفي الحديث «فيزيد على تلك الكلمة مائة كَذْبة» .وأما اتصال نفوس الكهان بالنفوس الشيطانية فيجوز أن يكون من تناسببٍ بين النفوس ، ومعظمُه أوهام . وسئل رسول الله صلى الله عليه وسلم عن الكهان فقال : «ليسوا بشيء» .أخرج البخاري عن ابن عباس قال «كان الجن يستمعون الوحي» ( أي وحي الله إلى الملائكة بتصاريف الأمور ) فلما بعث رسول الله صلى الله عليه وسلم مُنعوا ، فقالوا : ما هذا إلاّ لأمر حدث فضربوا في الأرض يتحسسون السبب فلما وجدوا رسول الله قائماً يصلي بمكة قالوا : هذا الذي حدث في الأرض فقالوا لقومهم : { إنا سمعنا قرآنا عجباً } \\[ الجن : 1 \\] الآية وأنزل على نبيئه { قُل أوحي إليه أنه استمع نفر من الجن } \\[ الجن : 1 \\] وإنما أوحي إليه قول الجن اه .ولعل كيفية حدوث رجم الجن بالشهب كان بطريقة تصريف الوحي إلى الملائكة في مجارٍ تمُرّ على مواقع انقضاض الشهب حتى إذا اتصلت قوى الوحي بموقع أحد الشهب انفصل الشهاب بقوَّة ما يغطه من الوحي فسقط مع مجرى الوحي ليحرسه من اقتراب المستَرِق حتى يبلغ إلى المَلك الموحى إليه فلا يجد في طريقه قوة شيطانية أو جنية إلاّ أحرقَها وبَخرها فهلكت أو استطيرت وبذلك بطلت الكهانة وكان ذلك من خصائص الرسالة المحمدية .\n\n",
      "translations": [
        {
          "translation": "(And we used to sit on places (high) therein) in heaven (to listen) before the advent of Muhammad (pbuh). (But he who listened now) after the advent of Muhammad (pbuh) (findeth a flame) a shining star (in wait for him) from the angels in order to prevent them from listening;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nفلما تنوّر بنور القدس بعد عن منازل القوى ومبالغ علمها وإدراكها\n وهذا معنى قوله: { وأنّا كنا نقعد منها مقاعد للسمع فمن يستمع الآن يجد له شهاباً رصداً } أي: نوراً ملكوتياً وحجة عقلية تطردنا عن الأفق العقلي وتحفظ العقل عن أن يميل إلى النفس فتختلط بنا وتنزل إلى ما ارتقينا إليه من المقاعد فنكتسب منه الآراء القياسية المؤدّية إلى موافقات البدن وأمان النفس\n { وأنّا لا ندري أشرّ أُريد بمن في الأرض } أرض البدن من القوى فتبقى في المجاهدة والرياضة\n ممنوعة من لذاتها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { أَنَّا كُنَّا نَقْعُدُ مِنْهَا } أي: من السماء { مَقَاعِدَ } صالحة { لِلسَّمْعِ } والاستماع { فَمَن يَسْتَمِعِ ٱلآنَ } بعد نزول القرآن في تلك المقاعد { يَجِدْ لَهُ } وعنده { شِهَاباً رَّصَداً } [الجن: 9] راصداً قاصداً له\n يرجمه ويمنعه من الاستماع\n\n\n{ وَأَنَّا } اليوم { لاَ نَدْرِيۤ } ونعلم { أَشَرٌّ } وفتنة { أُرِيدَ بِمَن فِي ٱلأَرْضِ } أي: بالساكنين عليها بحراسة السماء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وأنَّا كنا نقعُدُ منه } أي: من السماء\n قبل هذا الوقت\n { مقاعِدَ للسمعِ } \n لاستماع أخبار السماء\n يعني: كنَّا نجد بعض السماء خالية من الحرس والشُهب قبل المبعث\n فنقعد نسترق\n وقد فسّر في الحديث صفة قعود الجن\n وأنهم كانوا واحداً فوق واحد\n فمتى احترق الأعلى طلع الذي تحته مكانه\n فكانوا يسترقون الكلمة\n فيُلقونها إلى الكُهان\n ويزيدون معها\n ثم يزيد الكُهانُ للكلمة مائة كذبة\n هذا قبل المبعث\n وأمّا بعده فأشار إليه بقوله: { فمَن يستمعِ } يريد الاستماع { الآنَ } بعد المبعث { يجدْ له شِهَاباً رصداً } أي: شهاباً راصداً له ولأجله\n يصده عن الاستماع\n أو هو اسم جمع لراصد\n على معنى: ذوي شهاب راصدين بالرجم\n وهم الملائكة الذين يرجمونهم بالشُهب\n ويمنعونهم من الاستماع\n والجمهور على أن ذلك لم يكون قبل مبعث نبينا صلى الله عليه وسلم\n وقيل: كان الرجم في الجاهلية\n ولكن الشياطين كانت تسترق في بعض الأوقات\n فمُنعوا من الاستراق أصلاً بعد مبعث النبي صلى الله عليه وسلم\n قلت: وهذا هو الظاهر\n وأنّ الرمي كان موجوداً قبل البعثة\n إلاَّ أنه قليل\n وأشعار الجاهلية محشوة بذلك\n انظر الثعلبي\n ورُوي في بعض الأخبار: أنّ إبليس كان يسترق السمع من السموات\n فلما وُلد عيسى عليه السلام وبُعث\n حُجبت الشياطين عن ثلاث سموات\n فلما وُلد محمد صلى الله عليه وسلم حُجبت عن السموات كلها\n وقُذفت بالنجوم\n هـ\n وذكر أبو جعفر العقيلي\n بإسناد له إلى لهب بن مالك\n قال: حضرت مع رسول الله صلى الله عليه وسلم فذكرت عنده الكهانة\n فقلت: بأبي أنت وأمي نحن أول مَن عرف حراسة السماء\n ورصد الشياطين\n ومنعهم من استراق السمع عند قذف النجوم\n وذلك أنا جئنا إلى كاهن لنا\n يُقال له \" خطل \" \n وكان شيخاً كبيراً\n قد أتت عليه مائتا سنة وثمانون سننة\n فقلنا: يا خطل هل عندك علم بهذا النجوم التي يُرمى بها\n فإنّا قد فزعنا منها\n وخفنا سوءَ عاقبتها\n فقال: ائتوني بسَحَر أُخبركم الخبر\n ألِخَيْر أم ضرر\n أم لأمن أو حذر\n فأتيناه غداً عند السحَر\n فإذا هو قائم على قدميه\n شَاخص إلى السماء بعينيه\n فناديناه: يا خطل\n فأومأ إلينا: أن أمسكوا\n فأنقضّ نجم عظيم من السماء\n وصرخ الكاهن رافعاً صوته: أصابه إصابة\n خامره عقابه\n عاجله عذابه\n أحرقه شهابه\n ثم قال: يا معشر قحطان\n أخبركم بالحق والبيان\n أُقسم بالكعبة والأركان\n لمُنع السمع عُتَاةٌ الجان\n لِمولود عظيم الشأن\n يُبعث بالتنزيل والقرآن\n وبالهدى وفاصل الفرقان\n يَمنع من عبادة الأوثان\n\nفقلنا: ما ترى لقومك؟ فقال: أرى لقومي ما أرى لنفسي\n أن يتبعوا خير نبي الإنس\n برهانه مثل شعاع الشمس\n يُبعث من مكة دارَ الحُمْس\n يحكم بالتنزيل غير اللبس\n فقلنا: وممَّن هو؟ فقال: والحياة والعيش\n إنه لمن قريش\n ما في حلمه طيش\n ولا في خَلقه هيش\n يكون في جيش\n وأيّ جيش!! فقلنا: بَيِّن لنا مِن أي قريش هو؟ فقال: والبيت ذي الدعائم\n والديار والحمائم\n إنه لمن نجل هاشم\n من معشرٍ أكارم\n يُبعث بالملاحم\n وقتلِ كل ظالم\n هذا البيان\n أخبرني به رئيس الجان\n ثم قال: الله أكبر\n جاء الحق وظهر\n وانقطع عن الجن الخبر\n هـ\n { وأنَّا لا ندري أَشَرٌّ أُريد بمَن في الأرض } بحراسة السماء",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:14",
      "similarity": 0.4649084249848126
    },
    {
      "verse": "78:21",
      "similarity": 0.45824023673562353
    },
    {
      "verse": "15:18",
      "similarity": 0.4552597805774516
    },
    {
      "verse": "72:27",
      "similarity": 0.3987993995638744
    },
    {
      "verse": "10:91",
      "similarity": 0.34358490850006757
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/072009.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/072009.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/72:9.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}