{
  "chapter": "المزمل",
  "text": "فكيف تتقون ان كفرتم يوما يجعل الولدن شيبا",
  "translations": [
    {
      "translation": "How will you safeguard yourselves, if you are kafir, against a Day which will turn children grey,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How then, if you disbelieve, will you preserve yourselves on the day which will even turn the children hoary?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you persist in disbelieving, how will you guard yourself against the (woe of the) Day that will turn children grey-haired,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you, disbelieve, how will you be able to protect yourselves from the hardships of the day which would even turn children grey-headed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So how will you save yourselves, if you disbelieve, on a day that will turn children old?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then how can you protect yourselves from the punishment, if you disbelieve, on a Day that will make the children gray-headed\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How, then, will you guard yourselves, if you disbelieve, on the day which shall make children grey-headed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If therefore you disbelieve, how will you guard yourselves against a day that shall make the children grey-headed?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then how, if ye disbelieve, will ye protect yourselves upon the day which will turn children grey,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you persist in denying the truth how will you escape the Day that will turn the children's hair grey.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How then, if ye disbelieve, shall ye escape, on a Day which shall make children grey-headed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, if you disbelieve, how will you avoid the day, which will make children white-headed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then how shall ye, if ye deny (Allah), guard yourselves against a Day that will make children hoary-headed?-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then how can you avoid the punishment, if you disbelieve, on a Day that will make the children grey-headed (i.e. the Day of Resurrection)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you disbelieve, how will you guard yourself against the Day that will make children gray haired,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So how will you, if you persist in unbelief, save yourself from a Day which will turn the children gray-haired?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then how can you fear, if you disbelieve, a Day that will make the children white- haired?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[73:17] So, if you disbelieve, in this world, how will you guard against a day (yawman is the direct object of tattaqūna, ‘you guard against’) that is, against the chastisement thereof, by what defence will you defend yourselves against the chastisement of a day, that will make the children grey-haired (shīb is the plural of ashyab) by the severity of its terrors, this being the Day of Resurrection (the shīn of shīb should actually have a damma, but it is given a kasra because of its [phonetic] affinity with the yā’) — a distressing day is described as being ‘a day that makes the forelocks of children turn grey’, which is [usually] understood figuratively; but it may be that in the case of this verse it is meant literally —\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفَكَيْفَ تَتَّقُونَ إِنْ كَفَرْتُمْ يَوْمًا يَجْعَلُ الْوِلْدَانَ شِيبًا (17) الاستفهام ب ( كيف ) مستعمل في التعجيز والتوبيخ وهو متفرع بالفاء على ما تضمنه الخطاب السابق من التهديد على تكذيب الرسول صلى الله عليه وسلم وما أدمج فيه من التسجيل بأن الرسول صلى الله عليه وسلم شاهد عليهم فليس بعد الشهادة إلاّ المؤاخذة بما شهد به ، وقد انتقل بهم من التهديد بالأخذ في الدّنيا المستفاد من تمثيل حالهم بحال فرعون مع موسى إلى الوعيد بعقاب أشد وهو عذاب يوم القيامة وقد نشأ هذا الاستفهام عن اعتبارهم أهل اتِّعاظ وخوف من الوعيد بما حلّ بأمثالهم مما شأنُه أن يثير فيهم تفكيراً من النجاة من الوقوع فيما هُدِّدوا به ، وأنهم إن كانوا أهل جلادة على تحمل عذاب الدّنيا فماذا يصنعون في اتقاء عذاب الآخرة ، فدلّت فاء التفريع واسم الاستفهام على هذا المعنى .فالمعنى : هبكم أقدمتم على تحمل عذاب الدنيا فكيف تتقون عذاب الآخرة ، ففعل الشرط من قوله : { إِنْ كفرتم } مستعمل في معنى الدوام على الكفر لأن ما يقتضيه الشرط من الاستقبال قرينة على إرادة معنى الدّوام من فعل { كفرتم } وإلاّ فإن كفرهم حاصل من قبل نزول هذه الآية .و { يوماً } منصوب على المفعول به ل { تتقون } . واتقاء اليوم باتقاء ما يقع فيه من عذاب أي على الكفر .ووصف اليوم بأنه { يجعل الولدان شيباً } وصف له باعتبار ما يقع فيه من الأهوال والأحزان ، لأنه شاع أن الهم مما يسرع به الشيب فلما أريد وصف همّ ذلك اليوم بالشدة البالغة أقواها أسند إليه يشيب الولدان الذين شعرهم في أول سواده . وهذه مبالغة عجيبة وهي من مبتكرات القرآن فيما أحسب ، لأني لم أر هذا المعنى في كلام العرب وأما البيت الذي يذكر في شواهد النحو وهو :إذن والله نَرميهم بحرب ... تُشيب الطفل من قبل المشيبفلا ثبوت لنسبته إلى من كانوا قبل نزول القرآن ولا يعرف قائله ، ونسبه بعض المؤلفين إلى حسان بن ثابت . وقال العيني : لم أجده في ديوانه . وقد أخذ المعنى الصمّة ابن عبد الله القشيري في قوله :دَعانيَ من نجدٍ فإن سنينه ... لَعِبْنَ بنا شِيباً وشيبننا مرداوهو من شعراء الدولة الأموية وإسناد { يجعل الولدان شيباً } إلى اليوم مجاز عقلي بمرتبتين لأن ذلك اليوم زمَن الأهوال التي تشيب لمثلها الأطفال ، والأهوال سبب للشيب عرفاً .والشيب كناية عن هذا الهول فاجتمع في الآية مجازان عقليان وكناية ومبالغة في قوله : { يجعل الولدان شيباً .\n\n",
      "translations": [
        {
          "translation": "(Then how) will you ward off disbelief, idolatry and indecencies, people of Mecca (if ye disbelieve) in the life of the world, (will ye protect yourselves upon the day) the Day of Judgement (which will turn children grey) when they hear Allah say to Adam: \"0 Adam! Send a group from your progeny to the Fire\". Adam will say: \"0 Lord! How many?\" Allah will say: \"From every one thousand, send 999 to the Fire and one person to the Garden\",\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وتعريضاً: { فَكَيْفَ تَتَّقُونَ } وتحفظون أنفسكم أيها المنهمكون في أنواع الغفلات والجهالات { إِن كَفَرْتُمْ } وبقيتم على الكفر\n ومتم عليه\n مع أنكم ستسقبلون وتقعون يوماًن وأيّ يوم { يَوْماً يَجْعَلُ ٱلْوِلْدَانَ شِيباً } [المزمل: 17] من غاية طوله\n وشدة أهواله وأحزانه؟!\n\nهذا على وجه التمثيل والتشبيه بحسب متفاهم العرف\n وإلاَّ فلا يكتنه هول ذلك اليوم وشدته بالوصف والبيان\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فكيف تتقون إِن كفرتم } أي: بقيتم على كفركم { يوماً } أي: عذاب يوم { يجعلُ الوِلْدان } من شدة هوله\n وفظاعة ما فيه من الدواهي { شِيباً } جمع أشيب\n أي: شيوخاً\n إمّا حقيقة\n أو تمثيلاً\n وذلك أنَّ الهموم والأحزان إذا تفاقمت على المرء ضعفت قواه وأسرع فيه الشيب\n فإذا قلنا: هو من باب التمثيل\n يكون كقولهم في اليوم الشديد: يوم تشيب فيه نواصي الأطفال\n وإذا قلنا حقيقة فلعله ممن بلغ الحلم\n وصَحِبه تفريط\n وهذا الوقت الذي يُشيب الولدان هو حين يُقال لآدم عليه السلام: \" أخْرِج بعثَ النار من ذريتك\n\n\n \" الحديث\n فـ \" يوماً \" مفعول بكفرتم\n أي: جحدتم\n أو: بـ \" تتقون \" \n أي: كيف تتقون عذاب يوم كذا إن كفرتم بالله\n أو: ظرف\n أي: فكيف لكم التقوى في يوم القيامة إن كفرتم في الدنيا\n و \" يجعل \" صفة ليوم\n والعائد محذوف\n أي: فيه\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:54",
      "similarity": 0.860951338703362
    },
    {
      "verse": "19:4",
      "similarity": 0.33535012734968833
    },
    {
      "verse": "31:33",
      "similarity": 0.07762522569180347
    },
    {
      "verse": "14:41",
      "similarity": 0.07413606310970611
    },
    {
      "verse": "10:14",
      "similarity": 0.07410518693560454
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/073017.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/073017.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/73:17.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}