{
  "chapter": "المزمل",
  "text": "واصبر على ما يقولون واهجرهم هجرا جميلا",
  "translations": [
    {
      "translation": "Be steadfast in the face of what they say and cut yourself off from them - but courteously.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear with patience what they say, and gracefully come away from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And bear patiently the vain things they utter, and gracefully forsake them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear patiently whatever they say, do not yield to them and keep on preaching decently to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And patiently endure upon what the disbelievers say, and leave them for good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be patient with what they say, and keep away from them in a good way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And bear patiently what they say and avoid them with a becoming avoidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And bear thou patiently what they say, and forsake them graciously.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And bear with patience what they utter, and part from them with a fair leave-taking.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear patiently with what they say, and ignore them politely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And bear thou with patience whatsoever they say, and depart from them with a becoming departure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and be patient over what they say, and distance yourself from them in a graceful manner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And have patience with what they say, and leave them with noble (dignity).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be patient (O Muhammad SAW) with what they say, and keep away from them in a good way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Bear patiently with what they say and with a fine abandonment forsake them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And endure patiently what they say, and withdraw from them politely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And be patient over what they say and avoid them with gracious avoidance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[73:10] and bear patiently what they say, that is, the disbelievers of Mecca, in the way of their maltreatment [of you], and part with them in a gracious manner, without any anguish — this was [revealed] before the command to fight them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And bear with patience) Muhammad (what they utter) of vilification and denial, (and part from them with a fair leave-taking) steer clear of them in a fair way, neither grieving nor reciprocating with indecency.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وجعلته حسيباً وكفيلاً { ٱصْبِرْ عَلَىٰ مَا يَقُولُونَ } أي: المشركون المسرفون من الخرافات والجزافات التي لا تليق بشأنك\n إن شق عليك الصبر والتحمل { وَٱهْجُرْهُمْ } اتركهم وانصرف عنهم { هَجْراً جَمِيلاً } [المزمل: 10] بشَّاشاً بسَّاماً بلا التفات إلى هذياناتهم الباطلة\n وبلا مبالاة بهم وبكلامهم\n وتوكل على الله\n وفوض أمر انتقامهم إليه\n فإنه يكفيك مؤنة شرورهم واستهزائهم\n\nثمَّ قال سبحانه على سبيل التسلية لحيبيه صلى الله عليه وسلم: { وَ } بعدما بالغوا في قدحك وطعنك يا أكمل الرسل { ذَرْنِي وَٱلْمُكَذِّبِينَ } يعني: دعني معهم\n وفوض أمر انتقامهم إليّ\n فإني أنتقم عنهم من قبلك\n وأدفع أذاهم عنك\n وأغلبك عليهم\n وإن كانوا { أُوْلِي ٱلنَّعْمَةِ } وذوي الثروة والسيادة\n وأصحاب التنعم والوجاهة - يريد صناديد قريش - { وَ } لا تستعجل في انتقامهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { واصبرْ على ما يقولون } في جانبي من الصاحِبة والولد، وفيك مِن الساحر والشاعر، { واهجرهم هَجْراً جميلاً } بأن تُجانبهم وتداريَهم ولا تجافهم، بل كِلْ أمرهم إلى ربهم، كما يُعرب عنه ما بعده، أون: جانبهم بقلبك وخالطِهم بجسمك مع حسن المخالطة وترك المكافأة، وقيل: هو منسوخ بآية القتال\n\n\nالإشارة: يا أيها المتزمّل بالعلوم والمعارف والأسرار، قُم الليل شكراً لِما أُسدي إليك من النعم الغزار، ولذلك لمّا امتثل هذا الأمر بغاية جهده حتى تفطّرت قدماه، قال:\n\n \" أفلا أكون عبداً شكوراً \" \n\n، وقيام الليل لا يخص بالصلاة، بل لكل مقام مقال، فقيام العُبَّاد والزُهَّاد للتهجد والتلاوة والأذكار والاستغفار بالأسحار، وقيام العارفين لفكرة الشهود والاستبصار، وهي صلاة القلوب الدائمة\n وقوله تعالى: { ورتِّل القرآنَ ترتيلا } خطاب لأهل التهجُّد، وهم ألوان مختلفة، فمنهم مَن يقطع الليل في سورة أو آية يُرددها، وهم أهل الخوف المزعِج، أو الشوق المقلِق، ومنهم مَن يختم القرآن في مدة قليلة، فمنهم مَن كان يختمه في كل ليلة في ركعة، ومنهم مَن كان يختمه في ليلة مرتين، ومنهم مَن كان يختمه بين الظهر والعصر، أو بين المغرب والعشاء\n وكان أبو حنيفة والشافعي يختمانه في رمضان ستين مرة، وابن القاسم صاحب مالك تسعين مرة،وابن عباس مائة مرة، وكان سليمان بن عمير يختمه ثلاث ختمات في كل ليلة، ويجامع أهله بعد كل ختمة\n وكان رجل بالمشرق، يُقال له \" أبو عيسى التلمساني \" ، يختم القرآن بين اليوم والليلة اثنتي عشرة ألف مرة، فذكر ذلك بمدينة سبتة، بحضور الفقيه العزفي، فقال الفقيه: لون كان يقول: القرآن القرآن ما أتمّ اثنتي عشر ألف مرة، فاغتاظ الرجل الذي نقل ذلك، فخرج إلى المشرق، فأتى ببينةٍ مُصحِّحة من قاض إلى قاض بصحة ذلك\n قلت: وهذا من باب الخوارق التي تكون للصالحين، تطوي لهم مسافة الكلام كما تُطوى لهم مسافة الزمان والمكان، وقد كان داود عليه السلام تُسرج له دابته، فيقرأ الزبور قبل أن تُسرج، كما في الصحيح، وذكر الفرغاني في شرح التائية: أنَّ رجلاً كان يختم القرآن بين الحِجر إلى الركن اليماني، فأنكر بعضٌ ذلك عليه، فأخذ بأذنه وقرأ فيها من الفاتحة إلى الختم، وهو يسمع حرفاً حرفاً، فسبحان القادر على كل شيء؟!\n وقوله تعالى: { إِنَّا سنُلقي عليك قولاً ثقيلا } ، قال القشيري: ثقيلاً أي: له خطْر ويقال: لا يقوى عليه إلاَّ مَن أيّد بقوة سماوية، ورُبّي في حجر التقريب\n هـ\n قال الورتجبي: وكيف لا يثقل قولهُ سبحانه وهو قديم، وأجدر أن تذوب تحت سطوات عزيته الأرواح والأشباح والأكوان والحدثان، بل هو بذاته يحمل صفاته لا غير، وكان عليه السلام مؤيداَ بالاتصاف بالحق، فكان يحمل الحق بالحق\n هـ\n المراد منه\n إنَّ ناشئة الليل أي: نشأة الفكرة في الليل هي أشد وطأً، أي: موافقة، وغرقاً في بحر الذات، وتيار الصفات لتفرغ القلب حينئذ من شواغل الحس\n\n\nوكان الشيخ \" أبو يزيد \" يخرج كل ليلة إلى الصحراء، ويبيت واقفاً على أطراف قدميه، شاخصاً ببصره إلى السماء، فقال لمَن رآه كذلك: دَوَّرَني الحق تعالى في الفلك العلوي والسفلي، وأطلعني على عجائب ملكوته\n\n\n الخ كلامه، وما كانت إلاَّ فكرته غاصت في بحر الذات، ودارت مع التجليات العلوية والسفلية ووقوفه في ذلك لغلبة الحال، ولله رجال في زماننا هذا يقلبون الوجود، ويَدُورون معه، وهم على فُرشهم، لتمكُّنهم من الشهود بلا تعب\n وقوله تعالى: { إن لك في النهار سَبْحاً طويلا } السَبح هو العوم، أي: إنَّ لك في النهار عوماً طويلاً في بحار الأحدية، فاستغرق ليلك ونهارك في ذلك، واذكر اسم ربك بقلبك وروحك وسرك، وهو عين السَبْح المتقدم، وتبتّل إليه تبتيلاً في الظاهر والباطن، فبالتبتُّل يحصل الوصول، وبذكر الاسم باللسان يحصل الذكر للجنان، ثم يسبح في بحر العيان\n رب المشرق والمغرب، أي: مشرق العيان ومغرب قمر الإيمان، بسطوع شمس العيان\n لا إله إلا هو فاتخذه وكيلاً، وثِقْ به كفيلاً يعطك عطاءً جزيلاً، ويمنحك فخراً جليلاً، واصبر على ما يقولون في جانبك، فإنَّ الداخل على الله منكور، والراجع إلى الناس مبرور\n { واهجرهم هجراً جميلاً } ، قال القشيري: أي: عاشِرهم بظاهرك، وبايِنْهم بسرِّك وقلبك، ويُقال: الهجرُ الجميل: ما يكون بحق ربك، لا بحظِّ نفسك\n هـ\n وإذا هَجَرْتَ أهل الإنكار، فكِلْ أمرهم إلى الواحد القهّار، كما قال تعالى: { وَذَرْنِي وَٱلْمُكَذِّبِينَ أُوْلِي ٱلنَّعْمَةِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:5",
      "similarity": 0.8361669581876144
    },
    {
      "verse": "15:85",
      "similarity": 0.4367206220927271
    },
    {
      "verse": "77:33",
      "similarity": 0.38980965395618145
    },
    {
      "verse": "16:110",
      "similarity": 0.3826730976474842
    },
    {
      "verse": "16:6",
      "similarity": 0.3775171178328103
    }
  ]
}