{
  "chapter": "المزمل",
  "text": "وذرنى والمكذبين او۟لى النعمة ومهلهم قليلا",
  "translations": [
    {
      "translation": "Leave the deniers, who live a life of ease, to Me, alone, and tolerate them a little longer.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave those to Me who deny, the lovers of ease and comfort; and bear with them for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave it to Me to deal with the affluent ones who give the lie (to the Truth), and bear with them for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave the prosperous disbelievers to Me and give them respite for a little while;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And leave them to Me – these wealthy deniers – and give them some respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And leave Me alone to deal with the deniers, those who are in possession of good things of life. And give them respite for a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And leave Me and the rejecters, the possessors of ease and plenty, and respite them a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave Me to those who cry lies, those prosperous ones, and respite them a little,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave Me to deal with the deniers, lords of ease and comfort (in this life); and do thou respite them awhile.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave it to Me to deal with the deniers, who live a life of comfort, and bear with them a little longer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And let Me alone with the beliers, owners of ease: and respite thou them a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave Me [to deal] with the deniers, the opulent, and give them a little respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And leave Me (alone to deal with) those in possession of the good things of life, who (yet) deny the Truth; and bear with them for a little while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And leave Me Alone to deal with the beliers (those who deny My Verses, etc.), and those who are in possession of good things of life. And give them respite for a little while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave to Me those who belie, those who lead a life of pleasure, and bear with them yet a little while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And leave Me to those who deny the truth, those of luxury, and give them a brief respite.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And leave Me with [the matter of] the deniers, those of ease [in life], and allow them respite a little.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[73:11] And leave Me [to deal] with the deniers (wa’l-mukadhdhibīna is a supplement to the direct object, or [it is] an object of accompaniment; the meaning is: ‘I will avail you of them’, they being the doughty [leaders] of Quraysh), those enjoying affluence, and respite them a little, while — they were killed soon afterwards at Badr.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Leave Me to deal with the deniers) of the Qur'an-this is a threat to them; and the ones specifically meant by this threat are those who fed the army of the disbelievers on the Day of Badr-, (lords of ease and comfort (in this life)) those who have wealth and richness; (and do thou respite them awhile) until the Day of Badr.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه على سبيل التسلية لحيبيه صلى الله عليه وسلم: { وَ } بعدما بالغوا في قدحك وطعنك يا أكمل الرسل { ذَرْنِي وَٱلْمُكَذِّبِينَ } يعني: دعني معهم، وفوض أمر انتقامهم إليّ، فإني أنتقم عنهم من قبلك، وأدفع أذاهم عنك، وأغلبك عليهم، وإن كانوا { أُوْلِي ٱلنَّعْمَةِ } وذوي الثروة والسيادة، وأصحاب التنعم والوجاهة - يريد صناديد قريش - { وَ } لا تستعجل في انتقامهم، بل { مَهِّلْهُمْ } إمهالاً { قَلِيلاً } [المزمل: 11] أو زماناً قليلاً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { وَذَرْنِي والمكذِّبينَ } أي: دعني وإيّاهم وكِلْ أمرَهم إليّ، فإني أكفيكهم، والمراد رؤساء قريش، و \" المكذِّبين \": مفعول معه، أو: عطف على الياء\n { أُولِي النَّعْمَةِ } أي: أرباب التنعُّم وهم صناديد الكفرة، فالنَّعمة بالفتح: التنعُّم، وبالكسر: ما يتنعّم به، وبالضم: المسرة\n { ومَهِّلْهُمْ قليلاً } أي: إمهالاً قليلاً، أو زمناً قليلاً إلى يوم بدر، أو يوم القيامة",
      "translations": []
    }
  ]
}