{
  "chapter": "المزمل",
  "text": "يوم ترجف الارض والجبال وكانت الجبال كثيبا مهيلا",
  "translations": [
    {
      "translation": "On the day the earth and mountains will rock violently, and the mountains turn to a heap of poured-out sand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(They will come across all this) on the Day when the earth and the mountains shall tremble violently and the mountains shall crumble into heaps of scattered sand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day, the earth and the mountains will be violently shaken, and the mountains will be turned into heaps of moving sand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On a day when the earth and the mountains will tremble, and the mountains turn into dunes of flowing sand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the earth and the mountains will (Tarjufu) shake, and the mountains will be a heap of sand poured out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the earth and the mountains shall quake and the mountains shall become (as) heaps of sand let loose.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "upon the day when the earth and the mountains shall quake and the mountains become a slipping heap of sand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the earth and the hills rock, and the hills become a heap of running sand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on the Day the earth and mountains shall shake and the mountains crumble into shifting sand dunes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On a Day whereon the earth and the mountains shall quake, and the mountains shall become a sand-heap poured forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the day when the earth and the mountains will quake, and the mountains will be like dunes of shifting sand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "One Day the earth and the mountains will be in violent commotion. And the mountains will be as a heap of sand poured out and flowing down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the earth and the mountains will be in violent shake, and the mountains will be a heap of sand poured out and flowing down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the earth with all its mountains quake and the mountains become heaps of shifting sand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the earth and the mountains tremble, and the mountains become heaps of sand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day the earth and the mountains will convulse and the mountains will become a heap of sand pouring down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[73:14]   on the day when the earth and the mountains will quake and the mountains will be like heaps of shifting sand (mahīl derives from hāla, yahīlu; it is actually mahyūl, but the damma sound is considered too heavy for the yā’ and is therefore transposed onto the hā’, while the wāw, the second of two unvocalised consonants, is omitted on account of it being extra, and the damma is replaced by a kasra because of its [phonetic] affinity the [letter] yā’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then Allah explained when this will take place, saying: (On the day when the earth and the hills rock) on the day when the earth and the mountains will quake, (and the hills become a heap of running sand.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَكَانَتِ ٱلْجِبَالُ كَثِيباً مَّهِيلاً } معناه رَملٌ ينهَالُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nاذكر لهم يا أكمل الرسل، وإن لم يصدقوا { يَوْمَ تَرْجُفُ } تضطرب وتتزلزل { ٱلأَرْضُ وَٱلْجِبَالُ وَكَانَتِ ٱلْجِبَالُ } من شدة الحركة والاضطراب اندكت وتناثرت فصارت { كَثِيباً } رملاً مجتمعاً { مَّهِيلاً } [المزمل: 14] منثوراً، تذروه الرياح حيث شاء، كسائر الرمال الآن في البراري والبوادي\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وهذا العذاب واقع { يَوْمَ ترجُف الأرضُ والجبالُ } أي: تتحرّك حركةً شديدة مع صلابتها وارتفاعها، فالظرف منصوب بما في \" لدينا \" من معنى الفعل، أي: استقر للكفار كذا وكذا يوم ترجف\n\n\nالخ\n { وكانت الجبالُ كَثِيباً } رملاً مجتمعاً\n من: كثب الشيء إذ جمعه، كأنه فعيل بمعنى مفعول\n { مَّهِيلاً } سائلاً بعد اجتماعه",
      "translations": []
    }
  ]
}