{
  "chapter": "المزمل",
  "text": "انا ارسلنا اليكم رسولا شهدا عليكم كما ارسلنا الى فرعون رسولا",
  "translations": [
    {
      "translation": "We have sent you a Messenger to bear witness against you just as We sent Pharaoh a Messenger.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent an Apostle to you as a witness against you, as We had sent an apostle to the Pharaoh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have sent to you a Messenger as a witness over you, just as We had sent a Messenger to Pharaoh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent you a Messenger, who will witness your deeds, just as We sent a Messenger to the Pharaoh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed sent a Noble Messenger towards you, a present witness over you – the way We had sent a Noble Messenger towards Firaun.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have sent to you a Messenger to be a witness over you, as We did send a Messenger to Fir`awn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have sent to you an Apostle, a witness against you, as We sent an apostle to Firon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have sent unto you a Messenger as a witness over you, even as We sent to Pharaoh a Messenger,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We have sent unto you a messenger as witness against you, even as We sent unto Pharaoh a messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent a messenger who is a witness over you, just as We sent a messenger to Pharoah before you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We have sent Unto you an apostle, a witness over you, even as We sent Unto Fir'awn an apostle.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We have sent to you an apostle, to be a witness to you, just as We sent an apostle to Pharaoh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent to you, (O men!) a messenger, to be a witness concerning you, even as We sent a messenger to Pharaoh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have sent to you (O men) a Messenger (Muhammad SAW) to be a witness over you, as We did send a Messenger [Musa (Moses)] to Fir'aun (Pharaoh).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have sent to you a Messenger as a witness over you, just as We sent a Messenger to Pharaoh.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have sent to you a messenger, a witness over you, as We sent to Pharaoh a messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have sent to you a Messenger as a witness upon you just as We sent to Pharaoh a messenger.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[73:15] We have indeed sent to you, O people of Mecca, a Messenger, namely, Muhammad (s), to be a witness against you, on the Day of Resurrection to any disobedience that you engage in, just as We sent to Pharaoh a messenger, namely, Moses, peace be upon him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّا أَرْسَلْنَا إِلَيْكُمْ رَسُولًا شَاهِدًا عَلَيْكُمْ كَمَا أَرْسَلْنَا إِلَى فِرْعَوْنَ رَسُولًا (15) نقل الكلام إلى مخاطبة المشركين بعد أن كان الخطاب موجهاً إلى النبي صلى الله عليه وسلموالمناسبة لذلك التخلصُ إلى وعيدهم بعد أن أمره بالصبر على ما يقولون وهجرهم هجراً جميلاً إذ قال له { وذرني والمكذبين } إلى قوله : { وعذاباً أليماً } \\[ المزمل : 1113 \\] .فالكلام استئناف ابتدائي ، ولا يُعد هذا الخطاب من الالتفات لأن الكلام نقل إلى غرض غير الغرض الذي كان قبله .فالخطاب فيه جار على مقتضى الظاهر على كلا المذهبين : مذهب الجمهور ومذهب السكاكي .والمقصود من هذا الخبر التعريض بالتهديد أن يصيبهم مثل ما أصاب أمثالهم ممن كذبوا الرسل فهو مثَل مضروب للمشركين .وهذا أول مثَل ضربه الله للمشركين للتهديد بمصير أمثالهم على قول الجمهور في نزول هذه السورة .واختير لهم ضرب المثل بفرعون مع موسى عليه السلام ، لأن الجامع بين حال أهل مكة وحال أهل مصر في سبب الإِعراض عن دعوة الرسول هو مجموع ما هم عليه من عبادة غير الله ، وما يملأ نفوسهم من التكبر والتعاظم على الرسول المبعوث إليهم بزعمهم أن مثلهم لا يطيع مِثله كما حكى الله تعالى عنهم بقوله : { فقالوا أنؤمن لبشرين مثِلنا وقومُهما لنا عابدون } \\[ المؤمنون : 47 \\] وقد قال أهل مكة { لولا نُزِّل هذا القرءان على رجل من القريتين عظيم } \\[ الزخرف : 31 \\] وقد حكى الله عنهم أنهم قالوا { لولا أنزل علينا الملائكة أو نرى ربّنا لقد استكبروا في أنفسهم وعتَوْا عُتُوّاً كبيراً } \\[ الفرقان : 21 \\] . وقد تكرر في القرآن ضرب المثل بفرعون لأبي جهل وهو زعيم المناوين للنبيء صلى الله عليه وسلم والمؤلبين عليه وأشد صناديد قريش كفراً .وأُكد الخبر ب ( إنَّ ) لأن المخاطبين منكرون أن الله أرسل إليهم رسولاً .ونكر { رسولاً } لأنهم يعلمون المعنيَّ به في هذا الكلام ، ولأن مناط التهديد والتنظير ليس شخص الرسول صلى الله عليه وسلم بل هو صفة الإِرسال .وأدمج في التنظير والتهديدِ وصفُ الرسول صلى الله عليه وسلم بكونه شاهداً عليهم .والمراد بالشهادة هنا : الشهادة بتبليغ ما أراده الله من الناس وبذلك يكون وصف { شاهداً } موافقاً لاستعمال الوصف باسم الفاعل في زمن الحال ، أي هو شاهد عليكم الآن بمعاودة الدعوة والإِبلاغ .وأما شهادة الرسول صلى الله عليه وسلم يوم القيامة فهي شهادة بصدق المسلمين في شهادتهم على الأمم بأن رسلهم أبلغوا إليهم رسالات ربّهم ، وذلك قوله تعالى : { وكذلك جعلناكم أمة وسطاً لتكونوا شهداء على الناس ويكون الرسول عليكم شهيداً } كما ورد تفصيل تفسيرها في الحديث الصحيح ، وقد تقدم في سورة البقرة ( 143 ) .{ وتنكير رسولاً } المرسَل إلى فرعون لأن الاعتبار بالإِرسال لا بشخص المرسل إذ التشبيه تعلق بالإِرسال في قوله : { كما أرسلنا إلى فرعون } إذ تقديره كإرسالنا إلى فرعون رسولاً .\n\n",
      "translations": [
        {
          "translation": "Lo! We have sent unto you a messenger) i.e. Muhammad (pbuh) (as witness against you) that he has conveyed the message, (even as We sent unto Pharaoh a messenger) i.e. Moses.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولا نعذبهم بأنواع العذاب { إِنَّآ أَرْسَلْنَآ إِلَيْكُمْ } يا أهل مكة بعدما انحرفتهم عن جادة العدالة على مقتضى سنتنا في الأمم السالفة { رَسُولاً } ناشئاً منكم\n يعني: محمداً صلى الله عليه وسلم { شَاهِداً } يشهد { عَلَيْكُمْ } يوم القيامة بالإجابة والامتناع بعدما أمرنا له\n وأوحينا إليه أن يدعوكم إلى الإيمان\n ويأمركم بالطاعات والإحسان { كَمَآ أَرْسَلْنَآ إِلَىٰ فِرْعَوْنَ } الطاغي الباغي { رَسُولاً } [المزمل: 15] يعني: موسى الكليم عليه السلام\n ليدعوه إلى الإيمان\n وبأمره بلوازمه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إنَّا أرسلنا إِليكم } يا أهل مكة { رسولاً } وهو محمد صلى الله عليه وسلم { شاهداً عليكم } يشهد يوم القيامة بما صدر منكم من الكفر والعصيان\n { كما أرسلنا إِلى فرعون رسولاً } وهو موسى عليه السلام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:16",
      "similarity": 0.631654511079654
    },
    {
      "verse": "26:23",
      "similarity": 0.5987534031458992
    },
    {
      "verse": "7:104",
      "similarity": 0.548607576100134
    },
    {
      "verse": "26:11",
      "similarity": 0.5313493859705474
    },
    {
      "verse": "20:79",
      "similarity": 0.5202266467008956
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/073015.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/073015.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/73:15.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}