{
  "chapter": "المزمل",
  "text": "ان ربك يعلم انك تقوم ادنى من ثلثى اليل ونصفه وثلثه وطائفة من الذين معك والله يقدر اليل والنهار علم ان لن تحصوه فتاب عليكم فاقرءوا۟ ما تيسر من القرءان علم ان سيكون منكم مرضى وءاخرون يضربون فى الارض يبتغون من فضل الله وءاخرون يقتلون فى سبيل الله فاقرءوا۟ ما تيسر منه واقيموا۟ الصلوة وءاتوا۟ الزكوة واقرضوا۟ الله قرضا حسنا وما تقدموا۟ لانفسكم من خير تجدوه عند الله هو خيرا واعظم اجرا واستغفروا۟ الله ان الله غفور رحيمۢ",
  "translations": [
    {
      "translation": "Your Lord knows that you stay up nearly two-thirds of the night - or half of it, or a third of it - and a group of those with you. Allah determines the night and day. He knows you will not keep count of it, so He has turned towards you. Recite as much of the Qur'an as is easy for you. He knows that some of you are ill and that others are travelling in the land seeking Allah's bounty, and that others are fighting in the Way of Allah. So recite as much of it as is easy for you. And establish salat and pay zakat and lend a generous loan to Allah. Whatever good you send ahead for yourselves you will find it with Allah as something better and as a greater reward. And seek forgiveness from Allah. Allah is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord surely knows that you are occupied with your devotions for nearly two-thirds of the night, or half the night, or one-third of it, as do many others with you. Yet God prescribes the measure of night and day. He knows you cannot calculate it, and so turns to you in benevolence. So recite as much of the Qur'an as you can easily. He knows some among you will be sick, and some will be travelling over the earth in search of the bounty of God, and some fighting in the way of God. So read as much from it as you can easily, and be firm in devotion, pay the zakat, and lend a goodly loan to God. And what you send for yourself of the good, you will find it with God better and greater in reward. So ask for God's forgiveness. Indeed God is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), your Lord knows that you sometimes stand up in Prayer nearly two-thirds of the night, and sometimes half or one-third of it, and so does a party of those with you; Allah measures the night and the day. He knows that you cannot keep an accurate count of it, so He has shown mercy to you. So now recite as much of the Qur'an as you can. He knows that there are among you those who are sick and others who are journeying in the land in quest of Allah's bounty, and still others who are fighting in the cause of Allah. So recite as much of the Qur'an as you easily can, and establish Prayer, and pay Zakah, and give Allah a goodly loan. Whatever good you send forth for yourselves, you shall find it with Allah. That is better and its reward is greater. And ask for Allah's forgiveness; surely He is Most Forgiving, Most Compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows that you and a group of those who are with you get up for prayer sometimes for less than two-thirds of the night, sometimes half and sometimes one-third of it. God determines the duration of the night and day. He knew that it would be hard for you to keep an exact account of the timing of the night prayers, so He turned to you with forgiveness. Thus, recite from the Quran as much as possible. He knew that some of you would be sick, others would travel in the land to seek God's favors, and still others would fight for the cause of God. Thus, recite from the Quran as much as possible, be steadfast in prayer, pay the zakat, and give virtuous loans to God. Whatever good deeds you save for the next life, you will certainly find them with God. This is the best investment, and for this you will find the greatest reward. Ask forgiveness from God. God is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed your Lord knows that you stand up in prayer, sometimes almost two-thirds of the night, and sometimes half the night or sometimes a third of it – and also a group of those along with you; Allah keeps measure of the night and day; He knows that you, O Muslims, will not be able to measure the night, so He has inclined towards you with mercy – therefore recite from the Qur’an as much as is easy for you; He knows that soon some of you will fall ill, and some will travel in the land seeking the munificence of Allah, and some will be fighting in Allah’s cause; therefore recite from the Qur’an as much as is easy for you, and establish prayer and pay the obligatory charity, and lend an excellent loan to Allah; and whatever good you send ahead for yourselves, you will find it with Allah, better and having a great reward; and seek forgiveness from Allah; indeed Allah is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, your Lord knows that you do stand a little less than two-thirds of the night, or half the night, or a third of the night, and also a party of those with you. And Allah measures the night and the day. He knows that you are unable to pray the whole night, so He has turned to you. So, recite you of the Qur'an as much as may be easy for you. He knows that there will be some among you sick, others traveling through the land, seeking of Allah's bounty, yet others fighting in Allah's cause. So recite as much of the Qur'an as may be easy,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely your Lord knows that you pass in prayer nearly two-thirds of the night, and (sometimes) half of it, and (sometimes) a third of it, and (also) a party of those with you; and Allah measures the night and the day. He knows that you are not able to do it, so He has turned to you (mercifully), therefore read what is easy of the Quran. He knows that there must be among you sick, and others who travel in the land seeking of the bounty of Allah, and others who fight in Allah's way, therefore read as much of it as is easy (to you), and keep up prayer and pay the poor-rate and offer to Allah a goodly gift, and whatever of good you send on beforehand for yourselves, you will find it with Allah; that is best and greatest in reward; and ask forgiveness of Allah; surely Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy Lord knows that thou keepest vigil nearly two-thirds of the night, or a half of it, or a third of it, and a party of those with thee; and God determines the night and the day. He knows that you will not number it, and He has turned towards you. Therefore recite of the Koran so much as is feasible. He knows that some of you are sick, and others journeying in the land, seeking the bounty of God, and others fighting in the way of God. So recite of it so much as is feasible. And perform the prayer, and pay the alms, and lend to God a good loan. Whatever good you shall forward to your souls' account, you shall find it with God as better, and mightier a wage. And ask God's forgiveness; God is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! thy Lord knoweth how thou keepest vigil sometimes nearly two-thirds of the night, or (sometimes) half or a third thereof, as do a party of those with thee. Allah measureth the night and the day. He knoweth that ye count it not, and turneth unto you in mercy. Recite, then, of the Qur'an that which is easy for you. He knoweth that there are sick folk among you, while others travel in the land in search of Allah's bounty, and others (still) are fighting for the cause of Allah. So recite of it that which is easy (for you), and establish worship and pay the poor-due, and (so) lend unto Allah a goodly loan. Whatsoever good ye send before you for your souls, ye will find it with Allah, better and greater in the recompense. And seek forgiveness of Allah. Lo! Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows that you stand up praying for nearly two-thirds of the night, or one-half of it and sometimes one third of it, as do others among your followers. God determines the measure of night and day. He knows that you will not be able to do it, so He has turned to you in mercy. Recite, then, as much of the Quran as is easy for you. He knows that there will be some among you who may be sick and others who will be travelling throughout the land seeking God's bounty, and yet others who may be fighting for the cause of God. So, recite, then as much of it as you are able, and be constant in prayer, and spend in charity, and give to God a goodly loan. For whatever good deed you send on before you for your souls, you will find it with God. It will be improved and richly rewarded by Him. Seek God's forgiveness, He is most forgiving, most merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily thy Lord knoweth that thou stayest up near two- thirds of the night, Or half thereof, or a third thereof, and also a party of those who are with thee. And Allah measureth the night and the day. He knoweth that ye can compute it not, He hath relented toward you. Wherefore recite now of the Qur'an, so much as is easy. He knoweth that there will be among you some diseased, and others shall be travelling in the land seeking grace of Allah, and others shall be fighting in the way of Allah. Wherefore recite thereof so much as is easy; and establish the prayer and give the poor-rate and lend Unto Allah a goodly loan. Whatsoever good ye shall send on for your souls, ye shall find it with Allah, better and greater in reward. And ask forgiveness of Allah; verily Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed your Lord knows that you stand vigil for nearly two thirds of the night—or [at times] a half or a third of it—along with a group of those who are with you. Allah measures the night and the day. He knows that you cannot calculate it [exactly], and so He was lenient toward you. So recite as much of the Quran as is feasible. He knows that some of you will be sick, while others will travel in the land seeking Allah’s bounty, and yet others will fight in the way of Allah. So recite as much of it as is feasible, and maintain the prayer and pay the zakat and lend Allah a good loan. Whatever good you send ahead for your souls you will find it with Allah [in a form] that is better and greater with respect to reward. And plead to Allah for forgiveness; indeed Allah is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thy Lord doth know that thou standest forth (to prayer) nigh two-thirds of the night, or half the night, or a third of the night, and so doth a party of those with thee. But Allah doth appoint night and day in due measure He knoweth that ye are unable to keep count thereof. So He hath turned to you (in mercy): read ye, therefore, of the Qur'an as much as may be easy for you. He knoweth that there may be (some) among you in ill-health; others travelling through the land, seeking of Allah's bounty; yet others fighting in Allah's Cause, read ye, therefore, as much of the Qur'an as may be easy (for you); and establish regular Prayer and give regular Charity; and loan to Allah a Beautiful Loan. And whatever good ye send forth for your souls ye shall find it in Allah's Presence,- yea, better and greater, in Reward and seek ye the Grace of Allah: for Allah is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, your Lord knows that you do stand (to pray at night) a little less than two-thirds of the night, or half the night, or a third of the night, and so do a party of those with you, And Allah measures the night and the day. He knows that you are unable to pray the whole night, so He has turned to you (in mercy). So, recite you of the Quran as much as may be easy for you. He knows that there will be some among you sick, others travelling through the land, seeking of Allah's Bounty; yet others fighting in Allah's Cause. So recite as much of the Quran as may be easy (for you), and perform As-Salat (Iqamat-as-Salat) and give Zakat, and lend to Allah a goodly loan, and whatever good you send before you for yourselves, (i.e. Nawafil non-obligatory acts of worship: prayers, charity, fasting, Hajj and 'Umrah, etc.), you will certainly find it with Allah, better and greater in reward. And seek Forgiveness of Allah. Verily, Allah is Oft-Forgiving, Most-Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows that you keep vigil nearly two thirds of the night and sometimes half or onethird of it, and a party of those with you. Allah measures thenight and the day. He knows that you cannot count it, and turns to you. Therefore, recite from the Koran as much as is easy (for you); He knows that among youthere are the sick and others traveling the road seeking the bounty of Allah; and others fighting in the Way of Allah. So then, recite from it as much as is easy. Establish your prayers, pay the obligatory charity, and lend Allah a generous loan. Whatever good you shall forward to your souls' account, you surely will find it better with Allah, and a mightier wage. And supplicate for the forgiveness of Allah. Allah is the Forgiving, the Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord knows that you stay up nearly two-thirds of the night, or half of it, or one-third of it, along with a group of those with you. God designed the night and the day. He knows that you are unable to sustain it, so He has pardoned you. So read of the Quran what is possible for you. He knows that some of you may be ill; and others travelling through the land, seeking God’s bounty; and others fighting in God’s cause. So read of it what is possible for you, and observe the prayers, and give regular charity, and lend God a generous loan. Whatever good you advance for yourselves, you will find it with God, better and generously rewarded. And seek God’s forgiveness, for God is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, your Lord knows, [O Muhammad], that you stand [in prayer] almost two thirds of the night or half of it or a third of it, and [so do] a group of those with you. And Allah determines [the extent of] the night and the day. He has known that you [Muslims] will not be able to do it and has turned to you in forgiveness, so recite what is easy [for you] of the Qur'an. He has known that there will be among you those who are ill and others traveling throughout the land seeking [something] of the bounty of Allah and others fighting for the cause of Allah. So recite what is easy from it and establish prayer and give zakah and loan Allah a goodly loan. And whatever good you put forward for yourselves - you will find it with Allah. It is better and greater in reward. And seek forgiveness of Allah. Indeed, Allah is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[73:20] Assuredly your Lord knows that you stand vigil less than two thirds of the night, or [at times] a half of it or a third of it (if read wa-nisfihi wa-thuluthihi, then these constitute a supplement to thuluthay, ‘two thirds’; if read wa-nisfahu wa-thuluthahu, then a supplement to adnā, ‘less than’) — his keeping vigil in the way mentioned is in accordance with what was enjoined on him at the beginning of this sūra — along with a group of those with you (wa-tā’ifatun mina’lladhīna ma‘aka constitutes a supplement to the subject [of the verb] taqūmu, ‘you stand vigil’, but it may also constitute, although it is not certain, a separating clause). The keeping vigil by some of his companions in this way indicates their emulation of him. Some of them could not tell how much of the night they had spent in prayer and how much of it had remained, and would therefore keep vigil all night as a precaution; and so they used to keep vigil [in this way] for a whole year or more with their feet swollen, until God alleviated matters for them. He, exalted be He, says: and God keeps measures, He keeps count of, the night and the day. He knows that (an: softened in place of the hardened form, its subject having been omitted, that is to say, annahu) you will not be able to keep count of it, that is, the [length of the] night, so that you may perform the vigil at the time in which it is required unless you stay up all night, which is hard on you, and so He has relented to you, making you revert to what is easier. So recite as much as is feasible of the Qur’ān, during prayer, by performing as much prayer as is feasible. He knows that (an: softened in place of the hardened form, that is to say, annahu) some of you will be sick, while others will be travelling in the land, seeking the bounty of God, seeking of His provision through   commerce and otherwise, and others will be fighting in the way of God: for each of the three groups mentioned the keeping of nightly vigil is hard, and so God has alleviated things for them by [enjoining on them] what is feasible. Later this was abrogated by the five [daily] prayers. So recite as much as is feasible of it (as [explained] above) and perform, obligatory, prayer and pay alms and lend God, by expending in the way of good in addition to what is due from your wealth [as alms], a goodly loan, out of the goodness of [your] hearts. For whatever good you send ahead for [the sake of] your souls, you will find that, with God, it will be better, than what you left behind (huwa khayran: huwa is for separation; what follows it [khayran, ‘better’] is comparable to a definite, even if it is not [actually] so, on account of the impossibility of it being given [the al- of] definition) and greater in terms of reward. And seek forgiveness from God; assuredly God is Forgiving, Merciful, to believers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّ رَبَّكَ يَعْلَمُ أَنَّكَ تَقُومُ أَدْنَى مِنْ ثُلُثَيِ اللَّيْلِ وَنِصْفَهُ وَثُلُثَهُ وَطَائِفَةٌ مِنَ الَّذِينَ مَعَكَ وَاللَّهُ يُقَدِّرُ اللَّيْلَ وَالنَّهَارَ عَلِمَ أَنْ لَنْ تُحْصُوهُ فَتَابَ عَلَيْكُمْ فَاقْرَءُوا مَا تَيَسَّرَ مِنَ الْقُرْآَنِ عَلِمَ أَنْ سَيَكُونُ مِنْكُمْ مَرْضَى وَآَخَرُونَ يَضْرِبُونَ فِي الْأَرْضِ يَبْتَغُونَ مِنْ فَضْلِ اللَّهِ وَآَخَرُونَ يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ فَاقْرَءُوا مَا تَيَسَّرَ مِنْهُ وَأَقِيمُوا الصَّلَاةَ وَآَتُوا الزَّكَاةَ وَأَقْرِضُوا اللَّهَ قَرْضًا حَسَنًا وَمَا تُقَدِّمُوا لِأَنْفُسِكُمْ مِنْ خَيْرٍ تَجِدُوهُ عِنْدَ اللَّهِ هُوَ خَيْرًا وَأَعْظَمَ أَجْرًا وَاسْتَغْفِرُوا اللَّهَ إِنَّ اللَّهَ غَفُورٌ رَحِيمٌ (20)من هنا يبتدىء ما نزل من هذه السورة بالمدينة كما تقدم ذكره في أول السورة .وصريح هذه الآية ينادي على أن النبي صلى الله عليه وسلم كان يقوم من الليل قبل نزول الآية وأن طائفة من أصحابه كانوا يقومون عملاً بالأمر الذي في أول السورة من قوله : { قم الليل إلاّ قليلاً } الآية \\[ المزمل : 2 \\] ، فتعين أن هذه الآية نزلت للتخفيف عنهم جميعاً لقوله فيها : { فتاب عليكم } فهي ناسخة للأمر الذي في أول السورة .واختلف السلف في وقت نزولها ومكانه وفي نسْبة مقتضاها من مقتضى الآية التي قبلها . والمشهور الموثوق به أن صدر السورة نزل بمكة .ولا يغتر بما رواه الطبري عن أبي سلمة بن عبد الرحمان عن عائشة مما يوهم أن صدر السورة نزل بالمدينة . ومثلُه ما روي عن النخعي في التزمل بمرط لعائشة .ولا ينبغي أن يطال القول في أنَّ القيام الذي شُرع في صدر السورة كان قياماً واجباً على النبي صلى الله عليه وسلم خاصة ، وأن قيام من قام من المسلمين معه بمكة إنما كان تأسياً به وأقرهم النبي صلى الله عليه وسلم عليه ولكن رأت عائشة أن فرض الصلوات الخمس نسَخ وجوب قيام الليل ، وهي تريد أن قيام الليل كان فرضاً على المسلمين ، وهو تأويل ، كما لا ينبغي أن يختلف في أن أول ما أوجب الله على الأمة هو الصلوات الخمس التي فرضت ليلة المعراج وأنها لم يكن قبلها وجوب صلاة على الأمة ولو كان لجَرى ذكر تعويضه بالصلوات الخمس في حديث المعراج ، وأن جوب الخمس على النبي صلى الله عليه وسلم مثل وجوبها على المسلمين . وهذا قول ابن عباس لأنه قال : إن قيام الليل لم ينسخه إلاّ آية : { إن ربك يعلم أنك تقوم أدنى من ثلثي الليل } الآية ، ولا أن يختلف في أن فرض الصلوات الخمس لم ينسخ فرض القيام على النبي صلى الله عليه وسلم سوى أنه نسخ استيعاب نصف الليل أو دونه بقليل فنسخه { فاقرءوا ما تيسر من القرآن } .وقد بين ذلك حديث ابن عباس ليلةَ بات في بيت خالته ميمونة أم المؤمنين قال فيه : «نام رسول الله صلى الله عليه وسلم وأهله حتى إذا كان نصف الليل أو قبله بقليل أو بعدَه بقليل استيقظ رسول الله» ثم وصف وُضوءه وأنه صلى ثلاث عشرة ركعة ثم نام حتى جاءه المنادي لصلاة الصبح . وابن عباس يومئذٍ غلام فيكون ذلك في حدود سنة سبع أو ثمان من الهجرة .ولم ينقل أن المسلمين كانوا يقومون معه إلاّ حين احتجز موضعاً من المسجد لقيامه في ليالي رمضان فتسامع أصحابه به فجعلوا يَنْسِلون إلى المسجد ليصلّوا بصلاة نبيئهم صلى الله عليه وسلم حتى احتبس عنهم في إحدى الليالي وقال لهم :\" لقد خشيت أن تفرض عليكم \" وذلك بالمدينة وعائشة عنده كما تقدم في أول السورة .وهو صريح في أن القيام الذي قاموه مع الرسول صلى الله عليه وسلم لم يكن فرضاً عليهم وأنهم لم يدوموا عليه وفي أنه ليس شيء من قيام الليل بواجب على عموم المسلمين وإلاّ لما كان لخشية أن يفرض عليهم موقع لأنه لو قُدر أن بعض قيام الليل كان مفروضاً لكان قيامهم مع النبي صلى الله عليه وسلم أداء لذلك المفروض ، وقد عضد ذلك حديث ابن عمر «أن رسول الله صلى الله عليه وسلم قال لحفصة وقد قصَّت عليه رؤيا رآها عبد الله بن عمر أن عبد الله رجل صالح لو كان يقوم في الليل» .وافتتاح الكلام ب { إن ربك يعلم أنك تقوم } يشعر بالثناء عليه لوفائه بحق القيام الذي أُمر به وأنه كان يبسط إليه ويهتم به ثم يقتصر على القدرِ المعين فيه النصففِ أو أنقصَ منه قليلاً أو زائدٍ عليه بل أخذ بالأقصى وذلك ما يقرب من ثُلثي الليل كما هو شأن أولي العزم كما قال النبي صلى الله عليه وسلم في قوله تعالى : { فلما قضى موسى الأجل } \\[ القصص : 29 \\] أنه قضى أقصَى الأجلين وهو العشر السنون .وقد جاء في الحديث : \" أن النبي صلى الله عليه وسلم كان يقوم من الليل حتى تورمت قدماه \"وتأكيد الخبر ب { إِنَّ } للاهتمام به ، وهو كناية عن أنه أرضى ربّه بذلك وتوطئة للتخفيف الذي سيذكر في قوله : { فتاب عليكم } ليعلم أنه تخفيف رحمة وكرامة ولإفراغ بعض الوقت من النهار للعمل والجهاد .ولم تزل تكثر بعد الهجرة أشغال النبي صلى الله عليه وسلم بتدبير مصالح المسلمين وحماية المدينة وتجهيز الجيوش ونحو ذلك ، فلم تبق في نهاره من السعة ما كان له فيه أيامَ مقامه بمكة ، فظهرت حكمة الله في التخفيف عن رسوله صلى الله عليه وسلم من قيام الليل الواجِب منه والرغيبةِ .وفي حديث علي بن أبي طالب \" أنه سئل عن النبي صلى الله عليه وسلم إذا أوى إلى منزله فقال : كان إذا أوَى إلى منزله جزَّأ دخوله ثلاثة أجزاء : جُزءاً لله ، وجزءاً لأهله ، وجزءاً لنفسه ، ثم جزَّأ جزأه بينه وبين الناس فيرد ذلك بالخاصة على العامة ولا يدخر عنهم شيئاً فمنهم ذو الحاجة ومنهم ذو الحاجتين ومنهم ذو الحوائج فيتشاغل بهم ويشغلهم فيما يصلحهم والأمةَ من مسألته عنهم وإخبارهم بالذي ينبغي لهم \"وإيثار المضارع في قوله : { يعلم } للدلالة على استمرار ذلك العلم وتجدده وذلك إيذان بأنه بمحل الرضى منه .وفي ضده قوله : { قد يعلم الله المعوقين منكم } \\[ الأحزاب : 18 \\] لأنه في معرض التوبيخ ، أي لم يزل عالماً بذلك حيناً فحيناً لا يخفى عليه منه حصة .و { أدْنى } أصله أقرب ، من الدنُوّ ، استعير للأَقَلّ لأن المسافة التي بين الشيء والأدنى منه قليلة ، وكذلك يستعار الأبعد للأكثر .وهو منصوب على الظرفيّة لفعل { تقوم } ، أي تقوم في زمان يقدر أقل من ثلثي الليل وذلك ما يزيد على نصف الليل وهو ما اقتضاه قوله تعالى : { أو زد عليه } \\[ المزمل : 4 \\] .وقرأ الجمهور : { ثُلثي } بضم اللام على الأصل . وقرأه هشام عن ابن عامر بسكون اللام على التخفيف لأنه عرض له بعض الثقل بسبب التثنية .وقرأ نافع وابن عامر وأبو عمرو وأبو جعفر ويعقوب { ونصفَه وثلثَه } بخفضهما عطفاً على { ثلثي الليل } ، أي أدنى من نصفه وأدنى من ثلثه .وقرأ ابن كثير وعاصم وحمزة والكسائي وخلف بنصب { ونصفه وثلثه } على أنهما منصوبان على المفعول ل { تقومُ } ، أي تقوم ثلثي الليل ، وتقوم نصف الليل ، وتقوم ثلثَ الليل ، بحيث لا ينقص عن النصف وعن الثلث . وهذه أحوال مختلفة في قيام النبي صلى الله عليه وسلم بالليل تابعة لاختلاف أحوال الليالي والأيام في طول بعضها وقصر بعض وكلها داخلة تحت التخيير الذي خيره الله في قوله { قم الليل إلاّ قليلاً } \\[ المزمل : 2 \\] إلى قوله : { أو زد عليه } \\[ المزمل : 4 \\] .وبه تظهر مناسبة تعقيب هذه الجملة بالجملة المعترضة ، وهي جملة { والله يقدر الليل والنهار } أي قد علمها الله كلها وأنبأه بها . فلا يختلف المقصود باختلاف القراءات . فمن العجاب قول الفرّاء أن النصب أشبه بالصواب .و { طائفة } عطف على اسم { إنَّ } بالرفع وهو وجه جائز إذا كان بعدَ ذكرِ خبرِ { إنّ } لأنه يقدر رفعه حينئذٍ على الاستئناف كما في قوله تعالى : { أن الله بريء من المشركين ورسوله } \\[ التوبة : 3 \\] . وهو من اللطائف إذا كان اتصاف الاسم والمعطوف بالخبر مختلفاً فإن بين قيام النبي صلى الله عليه وسلم وقيام الطائفة التي معه تفاوتاً في الحكم والمقدار ، وكذلك براءة الله من المشركين وبراءة رسوله . فإن الرسول صلى الله عليه وسلم يدعوهم ويقرأ عليهم القرآن ويعاملهم ، وأما الله فغاضب عليهم ولاَعنُهم . وهذا وجه العدول عن أن يقول : إنَّ الله يعلم أنكم تقومون . إلى قوله : { أنك تقوم } ثم قوله : { وطائفة } الخ .ووُصف { طائفة } بأنهم ( من الذين معه ) ، فإن كان المراد بالمعية المعية الحقيقية ، أي المصاحبة في عمل مما سيق له الكلام . أي المصاحبين لك في قيام الليل ، لم يكن في تفسيره تعيين لناس بأعيانهم ، ففي حديث عائشة في «صحيح البخاري» «أن رسول الله صلى الله عليه وسلم صلَّى ذات ليلة في المسجد فصلى بصلاته ناس ثم صلى من القابلة فكثر الناس ثم اجتمعوا من الليلة الثالثة أو الرابعة فلم يخرج إليهم رسول الله صلى الله عليه وسلم فلما أصبح قال : قد رأيتُ الذي صنعتم ولم يمنعني من الخروج إليكم إلاّ أني خشِيت أن تُفرض عليكم ، وذلك في رمضان» .وإن كانت المعية معية مجازية وهي الانتساب والصحبة والموافقة فقد عَدَدْنا منهم : عبدَ الله بن مسعود ، وعبد الله بن عَمْرو ، وسلمان الفارسي وأبا الدرداء ، وزينبَ بنتَ جحش ، وعبدَ الله بن عُمَرَ ، والحَولاء بنتَ تُوَيْت الأسدية ، فهؤلاء ورد ذكرهم مفرقاً في أحاديث التهجد من «صحيح البخاري» .واعلم أن صدر هذه الآية إيماء إلى الثناء على النبي صلى الله عليه وسلم في وفائه بقيام الليل حق الوفاء وعلى الطائفة الذين تابعوه في ذلك .فالخبر بأن الله يعلم أنك تقوم مراد به الكناية عن الرضى عنهم فيما فعلوا .والمقصود : التمهيد لقوله : { علم أن لن تحصوه } إلى آخر الآية .ولأجل هذا الاعتبار أعيد فعل { عَلِم } في جملة { علم أن سيكون منكم مرضى } الخ ولم يقل : وأن سيكون منكم مرضى بالعطف .وجملة { والله يقدر الليل والنهار } معترضة بين جملتي { إن ربّك يعلم أنك تقوم } وجملة { علم أن لن تحصوه } وقد علمت مناسبة اعتراضها آنفاً .وجملة { علم أن لن تحصوه } يجوز أن تكون خبراً ثانياً عن { إنَّ } بعد الخبر في قوله : { يعلم أنك تقوم أدنى من ثلثي الليل } الخ .ويجوز أن تكون استئنافاً بيانياً لما ينشأ عن جملة { إن ربّك يعلم أنك تقوم } من ترقب السامع لمعرفة ما مُهّد له بتلك الجملة ، فبعد أن شكرهم على عملهم خفف عنهم منه .والضمير المنصوب في { تحصوه } عائد إلى القيام المستفاد من { أنك تقوم .والإِحصاء حقيقته : معرفة عدد شيء معدود مشتق من اسم الحصى جمع حصاة لأنهم كانوا إذا عدّوا شيئاً كثيراً جعلوا لكل واحد حصاة وهو هنا مستعار للإِطاقة . شُبهت الأفعال الكثيرة من ركوع وسجود وقراءة في قيام الليل ، بالأشياء المعدودة ، وبهذا فسر الحسن وسفيان ، ومنه قوله في الحديث استقيموا ولن تُحصوا أي ولن تطيقوا تمام الاستقامة ، أي فخذوا منها بقدر الطاقة .وأنْ } مخففة من الثقيلة ، واسمها ضمير شأن محذوف وخبره الجملة ، وقد وقع الفصل بين { أنْ } وخبرها بحرف النفي لكون الخبر فعلاً غير دعاء ولا جامد حسب المتبع في الاستعمال الفصيح .و { أنْ } وجملتها سادة مسد مفعولي { علم } إذ تقديره علم عَدَم إحصائِكُمُوه واقعاً .وفرع على ذلك { فتاب عليكم } وفعل { تاب } مستعار لعدم المؤاخذة قبل حصول التقصير لأن التقصير متوقع فشابه الحاصل فعبر عن عدم التكليف بما يتوقع التقصير فيه ، بفعل { تاب } المفيد رفع المؤاخذة بالذنب بعد حصوله .والوجه أن يكون الخطاب في قوله : { تحصوه } وما بعده موجهاً إلى المسلمين الذين كانوا يقومون الليل : إِما على طريقة الالتفات من الغيبة إلى الخطاب بعد قوله : { وطائفة من الذين معك ، } وإِما على طريقة العام المراد به الخصوص بقرينة أن النبي صلى الله عليه وسلم لا يُظن تعذر الإِحصاء عليه ، وبقرينة قوله : { أن سيكونُ منكم مرضى } الخ .ومعنى { فاقرأوا ما تيسر من القرآن } فصلُّوا ما تيسر لكم ، ولما كانت الصلاة لا تخلو عن قراءة القرآن أُتبع ذلك بقوله هنا : { فاقرأوا ما تيسر من القرآن } ، أي صلوا كقوله تعالى :{ وقرآنَ الفجر } \\[ الإسراء : 78 \\] أي صلاة الفجر وفي الكناية عن الصلاة بالقرآن جمع بين الترغيب في القيام والترغيب في تلاوة القرآن فيه بطريقة الإِيجاز .والمراد القرآن الذي كان نزل قبل هذه الآية المدنيّة وهو شيء كثير من القرآن المكيُّ كله وشيء من المدني ، وليس مثل قوله في صدر السورة { ورتل القرءان ترتيلاً } \\[ المزمل : 4 \\] كما علمت هنالك .وقوله : { ما تيسر من القرءان } أي ما تيسر لكم من صلاة الليل فلا دلالة في هذه الآية على مقدار ما يجزىء من القراءة في الصلاة إذ ليس سياقها في هذا المهيع ، ولئن سلمنا ، فإن ما تيسر مجمل وقد بينه قول النبي صلى الله عليه وسلم \" لا صَلاة لمن لم يقرأ بفاتحة الكتاب \" ، وأما السورة مع الفاتحة فإنه لم يرو عنه أنه قرأ في الصلاة أقلَّ من سورة ، وهو الواجب عند جمهور الفقهاء ، فيكره أن يَقرأ المصلي بعضَ سورة في الفريضة . ويجوز في القيام بالقرآن في الليل وفي قيام رمضان ، وعند الضرورة ، ففي «الصحيح» «أن النبي صلى الله عليه وسلم كان يقرأ فأخذته بُحَّة فركع» ، أي في أثناء السّورة .وقال أبو حنيفة وأحمد في رواية عنه : تجزىء قراءة آية من القرآن ولو كانت قصيرة ومثَّله الحنفية بقوله تعالى : { مُدْهامَّتَان } \\[ الرحمن : 64 \\] ولا تتعين فاتحة الكتاب وخالفه صاحباه في الأمرين .وتعيين من تجب عليه القراءة من منفرد وإمام ومأموم مُبين في كتب الفقه .وفعلُ ( تاب ) إذا أريد به قبول توبة التائب عدي بحرف ( على ) لتضمينه معنى مَنَّ وإذا كان بمعنى الرجوع عن الذنب والندم منه عدي بما يناسب .وقد نسخت هذه الآية تحديدَ مدة قيام الليل بنصفه أو أزيد أو أقل من ثلثه ، وأصحاب التحديد بالمقدار المتيسر من غير ضبط ، أما حكم ذلك القيام فهو على ما تقدم شرحه .هذه الجملة بدل اشتمال من جملة { عَلِمَ أنْ لَنْ تُحصوه ، } وهذا تخفيف آخر لأجل أحوال أخرى اقتضت التخفيف .وهذه حكمة أخرى لنسخ تحديد الوقت في قيام الليل وهي مراعاة أحوال طرأت على المسلمين من ضروب ما تدعو إليه حالة الجماعة الإِسلامية . وذكر من ذلك ثلاثة أضرب هي أصول الأعذار :الضرب الأول : أعذار اختلال الصحة وقد شملها قوله : { أن سيكون منكم مرضى .الضرب الثاني } : الأشغال التي تدعو إليها ضرورة العيش من تجارة وصناعة وحراثة وغير ذلك ، وقد أشار إليها قوله : { وآخرون يضربون في الأرض يبتغون من فضل الله } وفضل الله هو الرزق .الضرب الثالث : أعمال لمصالح الأمة وأشار إليها قوله : { وآخرون يقاتلون في سبيل الله } ودخل في ذلك حراسة الثغور والرِباط بها ، وتدبير الجيوش ، وما يرجع إلى نشر دعوة الإِسلام من إيفاد الوفود وبعث السفراء .وهذا كله من شؤون الأمة على الإِجمال فيدخل في بعضها النبي صلى الله عليه وسلم كما في القتال في سبيل الله ، والمرض ففي الحديث : اشتكى رسول الله صلى الله عليه وسلم فلم يقم ليلة أو ليلتين .وإذا كانت هذه الآية مما نزل بمكة ففيها بشارة بأن أمر المسلمين صائر إلى استقلال وقترة على أعدائهم فيقاتلون في سبيل الله وإن كانت مدنية فهو عذر لهم بما ابتدأوا فيه من السرايا والغزوات .وقد كان بعض الصحابة يتأول من هذه الآية فضيلة التجارة والسفر للتجر حيث سوى الله بين المجاهدين والمكتسبين المال الحلال ، يعني أن الله ما ذكر هذين السببين لنسخ تحديد القيام إلاّ تنويهاً بهما لأن في غيرهما من الأعذار ما هو أشبه بالمرض ، ودقائق القرآن ولطائفه لا تنحصر .روي عن ابن مسعود أنه قال «أيما رجل جلب شيئاً إلى مدينة من مدائن المسلمين محتسباً فباعه بسعر يومه كان له عند الله منزلة الشهداء ، وقرأ { وآخرون يضربون في الأرض يبتغون من فضل الله وآخرون يقاتلون في سبيل الله } .وعن ابن عمر : «ما خلق الله موتة بعد الموت في سبيل الله أحب إليَّ من أن أموت بين شُعْبَتَي رَحْلي أبتغي من فضل الله ضارباً في الأرض» .فإذا كانت هذه الآية مما نزل بمكة ففيها بشارة بأن أمر المسلمين صائر إلى قترة على عدوهم وإن كانت مدنية فهي عذر لهم بما عرض لهم .ومعنى { يضربون في الأرض } يسيرون في الأرض .وحقيقة الضرب : قرع جسم بجسم آخر ، وسُمّي السير في الأرض ضرباً في الأرض لتضمين فعل { يضربون } معنى يسيرون فإن السير ضرب للأرض بالرجلين لكنه تنوسي منه معنى الضرب وأريد المشي فلذلك عدي بحرف { في } لأن الأرض ظرف للسير كما قال تعالى : { فسيروا في الأرض } \\[ آل عمران : 137 \\] وقد تقدم عند قوله تعالى : { وإذا ضربتم في الأرض فليس عليكم جناح أن تقصروا من الصلاة } في سورة النساء ( 101 ) .والابتغاء من فضل الله طلب الرزق قال تعالى : { ليس عليكم جناح أن تبتغوا فضلاً من ربّكم } \\[ البقرة : 198 \\] أي التجارة في مدة الحج ، فقوله تعالى : { يضربون في الأرض يبتغون من فضل الله } مراد بالضرب في الأرض فيه السفر للتجارة لأن السير في الأسفار يكون في الليل كثيراً ويكون في النهار فيحتاج المسافر للنوم في النهار .وفُرع عليه مثل ما فرع على الذي قبله فقال : { فاقرأوا ما تيسر منه } أي من القرآن .وقد نيط مقدار القيام بالتيسير على جميع المسلمين وإن اختلفت الأعذار .وهذه الآية اقتضت رفع وجوب قيام الليل عن المسلمين إن كان قد وجب عليهم من قبل على أحد الاحتمالين ، أو بيانَ لم يوجب عليهم وكانوا قد التزموه فبين لهم أن ما التزموه من التأسّي بالنبي صلى الله عليه وسلم في ذلك غير لازم لهم .وعلل عدم وجوبه عليهم بأن الأمة يكثر فيها أصحاب الأعذار التي يشق معها قيام الليل فلم يجعله الله واجباً عليهم أو رفَع وجوبه . ولولا اعتبار المظنة العامة لأبقِيَ حكمُ القيام ورُخص لأصحاب العذر في مدة العذر فقط فتبين أن هذا تعليل الحكم الشرعي بالمظنة والحكم هنا عدمي ، أي عدم الإِيجاب فهو نظير قصر الصلاة في السفر على قول عائشة أم المؤمنين : «إن الصلاة فرضت ركعتين ثم زيد في ثلاث من الصلوات في الحضر وأبقيت صلاة السفر» ، وعلة بقاء الركعتين هو مظنة المشقة في السفر .وأوجب الترخص في قيام الليل أنه لم يكن ركناً من أركان الإِسلام فلم تكن المصلحة الدينية قوية فيه .وأما حكم القيام فهو ما دلّ عليه قوله : { قم الليل إلاّ قليلاً } \\[ المزمل : 2 \\] وما دلت عليه أدلة التحريض عليه من السنة . وقد مضى ذلك كله . فهذه الآية صالحة لأن تكون أصلاً للتعليل بالمظنة وصالحة لأن تكون أصلاً تقاس عليه الرخص العامة التي تراعى فيها مشقة غالب الْأمة مثل رخصة بيع السلم دون الأحوال الفردية والجزئية .وقوله : { وأقيموا الصلاة } تذكير بأن الصلوات الواجبة هي التي تحرصون على إقامتها وعدم التفريط فيها كما قال تعالى : { إن الصلاة كانت على المؤمنين كتاباً موقوتاً } \\[ النساء : 103 \\] .وفي هذا التعقيب بعطف الأمر بإقامة الصلاة إيماء إلى أن في الصلوات الخمس ما يرفع التبعة عن المؤمنين وأن قيام الليل نافلة لهم وفيه خير كثير وقد تضافرت الآثار على هذا ما هو في كتب السنة .وعطف { وءاتوا الزكاة } تتميم لأن الغالب أنه لم يَخلُ ذكر الصلاة من قرن الزكاة معها حتى استنبط أبو بكر رضي الله عنه من ذلك أن مانع الزكاة يقاتل عليها ، فقال لعمر رضي الله عنه «لأقاتلن من فرّق بين الصلاة والزكاة» .وإقراض الله هو الصدقات غير الواجبة ، شبه إعطاء الصدقة للفقير بقرض يُقرضه الله لأن الله وعد على الصدقة بالثواب الجزيل فشابه حالُ معطي الصدقة مستجيباً رغبة الله فيه بحال من أقرض مستقرضاً في أنه حقيق بأن يُرجع إليه ما أقرضه ، وذلك في الثواب الذي يُعطاه يوم الجزاء .ووصف القرض بالحسن يفيد الصدقة المراد بها وجه الله تعالى والسالمة من المنّ والأذى ، والحُسن متفاوت .والحَسن في كل نوع هو ما فيه الصفات المحمودة في ذلك النوع في بابه ، ويعرف المحمود من الصدقة من طريق الشرع بما وصفه القرآن في حسن الصدقات وما ورد في كلام النبي صلى الله عليه وسلم من ذلك .وقد تقدم في سورة البقرة ( 245 ) قوله : { من ذا الذي يُقرض الله قرضاً حسناً فيضاعفه له ضعافاً كثيرة } وفي سورة التغابن ( 17 ) { إن تقرضوا الله قرضاً حسناً يضاعفْه لكم }وَمَا تُقَدِّمُواْ لاَِنفُسِكُمْ مِّنْ خَيْرٍ تَجِدُوهُ عِندَ الله هُوَ خَيْراً وَأَعْظَمَ أَجْراً } .تذييل لما سبق من الأمر في قوله : { فاقرأوا ما تيسر منه وأقيموا الصلاة وآتوا الزكاة وأقرضوا الله قرضاً حسناً } ، فإن قوله : { من خير } يعم جميع فعل الخير .وفي الكلام إيجازُ حَذْف . تقدير المحذوف : وافعلوا الخير وما تقدموا لأنفسكم منه تجدوه عند الله ، فاستغني عن المحذوف بذكر الجزاء على الخير .و { ما } شرطية . ومعنى تقديم الخير : فعله في الحياة ، شُبِّه فعل الخير في مدة الحياة لرجاء الانتفاع بثوابه في الحياة الآخرة بتقديم العازم على السفر ثَقَلَه وأدوَاتِه وبعضَ أهله إلى المحل الذي يروم الانتهاء إليه ليجد ما ينتفع به وقت وصوله .و { من خير } بيان لإِبهام { ما } الشرطية .والخير : هو ما وصفه الدين بالحُسْن ووعد على فعله بالثواب .ومعنى { تجدوه } تجدوا جزاءه وثوابه ، وهو الذي قصده فاعله ، فكأنه وجد نفس الذي قدَّمه ، وهذا استعمال كثير في القرآن والسنة أن يعبر عن عوض الشيء وجزائِه باسم المعوض عنه والمجازَى به ، ومنه قول النبي صلى الله عليه وسلم في الذي يَكنز المال ولا يؤدي حقه «مُثِّل له يوم القيامة شُجاعاً أقْرَعَ يأخذ بلِهْزِمَتَيْه يقول : أنا مالك أنا كنزك» .وضمير الغائب في { تجدوه } هو المفعول الأول ل ( تجدوا ) ومفعوله الثاني { خيراً } .والضمير المنفصل الذي بينهما ضمير فعل ، وجاز وقوعه بين معرفة ونكرة خلافاً للمعروف في حقيقة ضمير الفصل من وجوب وقوعه بين معرفتين لأنَّ أفْعَلَ مِن كَذا ، أشبه المعرفة في أنه لا يجوز دخول حرف التعريف عليه .و { خيراً } : اسم تفضيل ، أي خيراً مما تقدمونه إذ ليس المراد أنكم تجدونه من جنس الخير ، بل المراد مضاعفة الجزاء ، لما دل عليه قوله تعالى : { إن تقرضوا الله قرضاً حسناً يُضاعفه لكم } \\[ التغابن : 17 \\] وغير ذلك من كثير من الآيات .وأفاد ضمير الفصل هنا مجرد التأكيد لتحقيقه .وعُطف { وأعظمَ أجراً } على { خيراً } أو هو منسحب عليه تأكيد ضمير الفصل .وانتصب { أجراً } على أنه تمييز نسبة ل { أعظمَ } لأنه في معنى الفعل . فالتقدير : وأعظم أجره ، كما تقول : وجدته مُنبسطاً كفاً ، والمعنى : أن أجره خيرٌ وأعظمُ ممّا قدمتوه .يجوز أن تكون الواو للعطف فيكون معطوفاً على جملة { وما تقدموا لأنفسكم } الخ ، فيكون لها حكم التذييل إرشاداً لتدارك ما عسى أن يعرض من التفريط في بعض ما أمره الله بتقديمه من خير فإن ذلك يشمل الفرائض التي يقتضي التفريط في بعضها توبةً منه .ويجوز أن تكون الواو للاستئناف وتكون الجملة استئنافاً بيانياً ناشئاً عن الترخيص في ترك بعض القيام إرشاداً من الله لما يسُدّ مسدّ قيام الليل الذي يعرض تركه بأن يستغفر المسلم ربّه إذا انتبه من أجزاء الليل ، وهو مشمول لقوله تعالى : { وبالأسحار هم يستغفرون } \\[ الذاريات : 18 \\] ، وقال النبي صلى الله عليه وسلم «ينزل ربّنا كل ليلة إلى سماء الدنيا حين يبقى ثلث الليل الآخر فيقول : من يدعوني فأستجيبَ له ، من يسألني فأعْطيَه ، من يستغفرني فأغفرَ له» . وقال : «من تَعَارَّ من الليل فقال : لا إله إلاّ الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير ، الحمد لله وسبحان الله ولا إله إلاّ الله والله أكبر ولا حول ولا قوة إلاّ بالله ثم قال اللهم اغفر لي أوْ دعا استجيب له» .وجملة { إن الله غفور رحيم } تعليل للأمر بالاستغفار ، أي لأن الله كثير المغفرة شديد الرحمة . والمقصود من هذا التعليل الترغيبُ والتحريض على الاستغفار بأنه مرجوّ الإِجابة . وفي الإِتيان بالوصفين الدّالين على المبالغة في الصفة إيماء إلى الوعد بالإِجابة .\n\n",
      "translations": [
        {
          "translation": "(Lo! thy Lord) Muhammad (knoweth how thou keepest vigil sometimes nearly) less than (two thirds of the night) up to half of the night, (or (sometimes) half) and sometimes you keep vigil half of the night (or a third thereof) and you keep vigil a third of the night; it is also said this means: and sometimes less than half of the night, (as do a party of those with thee) and a group of believers with you who keep vigil of the night in prayer. (Allah measureth the night and the day) Allah knows the hours of the day and night. (He knoweth that ye count it not) i.e. keep track of the hours of the night; it is also said that this means: He knows you will not be able to persevere in that which you are commanded of prayer in the night, (and turneth unto you in mercy) and so He forgives you if you do not pray at night. (Recite, then, of the Qur'an) when you perform the prayers (that which is easy for you) 100 verses and more; and it is also said this means: whatever you wish to recite of the Qur'an. (He knoweth that there are sick folk among you) wounded people among you who cannot pray at night, (while others travel in the land) fleeing from something or (in search of Allah's bounty) of Allah's provision and other things, and it is hard on them to pray at night, (and others (still) are fighting for the cause of Allah) for the obedience of Allah who will find it hard to pray at night. (So recite of it) of the Qur'an in your prayers (that which is easy (for you), and establish worship) complete the five daily prayers including what is required for its validity of ritual ablution, bowings, prostrations and the observation of their due times (and pay the poor-due) from your wealth (and (so) lend unto Allah) by giving to charity; and it is also said: by doing righteous works (a goodly loan) truly and sincerely from your hearts. (Whatsoever good) alms or righteous works (ye send before you for your souls, ye will surely find it) find its reward (with Allah) in Paradise preserved for you, neither stolen, drowned, burnt or eaten by borer, (better) than what you have left in the life of the world (and greater in the recompense) than that which you have. (And seek forgiveness of Allah) from your sins. (Lo! Allah is Forgiving) He forgives whoever repents, (Merciful) towards he who dies repentant, because of the mercy of he who is enveloped in his cloak'. And of the surah in which the Cloaked One is mentioned, which is all Meccan and consists of 56 verses, 255 words and 1,010 letters: Surah 74: The Cloaked One (al-Muddaththir) And of the surah in which the Cloaked One is mentioned, which is all Meccan and consists of 56 verses, 255 words and 1,010 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { عَلِمَ أَن لَّن تُحْصُوهُ } معناه أن لَنْ تَطيقوهُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His statement, { He knows that you will not be able to } - this means that you will not be able to bear it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "وبعدما أمر سبحانه حبيبه صلى الله عليه وسلم بقيام الليل على الوجه المذكور، وحثه عليه، ورغبه على وجه المبالغة والتأكيد بأن علله بعلمه سبحانه إياه على أيّ وجه، فقال: { إِنَّ رَبَّكَ } يا أكمل الرسل { يَعْلَمُ } بعلمه الحضوري { أَنَّكَ تَقُومُ } إلى التهجد { أَدْنَىٰ } وأقل { مِن ثُلُثَيِ ٱلَّيْلِ } وأعلى، وأكثر من نصفه تارة { وَ } تارة أخرى أدنى من { نِصْفَهُ } السياق يدل على أن التفسير جرى على قراءة ابن عامر ونافع وغيرهما: { وَنِصْفَهُ } تارة أدنى من { ثُلُثَهُ } السياق يدل على أن التفسير جرى على قراءة ابن عامر ونافع وغيرهما: { ثُلُثَهُ } وأكثر من ربعه، وهذا أدنى تاراتك، وأعلاها: ما هو أدنى من ثلثي الليل؛ إذ هي أقرب إلى قيام الكل الذي فرض أولاً، ثمَّ الثانية، ثمَّ الثالثة.\n\n{ وَطَآئِفَةٌ } أي: ويعلم سبحانه أيضاً قيام طائفة { مِّنَ } المؤمنين { ٱلَّذِينَ } يقومون { مَعَكَ } ويوافقون لك في تهجدك وقيامك؛ يعين: علمه سبحانه محيط بهذه الأوقات الثلاثة الواقعة منك ومنهم، بخلاف علمك فإنه؛ أي: علمك لا يقدر بتعيينها على وجهها { وَ } بالجملة: { ٱللَّهُ } العليم الحكيم الذي { يُقَدِّرُ } بمقتضى علمه وإرادته { ٱلَّيْلَ وَٱلنَّهَارَ } على سبيل التجدد والتتابع، والاختلاف طولاً وقصراً، وإيلاج بعض أجزاء كل منهما على الآخر، وإخراجهما منه، وضبط أجزائهما وساعاتهما وآنائمها، إنما هي بعلمه لا بعلم غيره من مظاهره ومصنوعاته، وهو سبحانه { عَلِمَ } منك { أَن } أي: إنه { لَّن تُحْصُوهُ } أي: ليس ي وسعكم وطاقتكم تقدير الأوقات، وضبط الأحيان والساعات، وإحصاء الآناء الواقعة في الليل والنهار، وقيامكم في كلها أو بعضها على وجه التعيين والتخصيص.\n\nوبعدما ظهر عنده سبحانه عدم طاقتكم ووسعكم { فَتَابَ } أي: عاد { عَلَيْكُمْ } ورجع عمَّا ألزمكم، وأزال تعبكم بالرخصة في ترك القيام المقدر المعين على الوجوه المذكورة؛ إذ لا يسع لكم ضبطها، وبعدما رخصكم سبحانه، وخفف عنكم تفضلاً وامتناناً، قوموا في خلال الليل مقدار ما يسّر الله لكم ووفقكم عليه { فَٱقْرَءُواْ } أي: صلوا التهجد بقراءة { مَا تَيَسَّرَ } لكم { مِنَ ٱلْقُرْآنِ } المقرون بصلاتكم.\n\nقيل: كان التهجد واجباً على التخيير المذكور، ثمَّ رخص بترك التقدير والتعيين، ثمَّ نسخ هذا أيضاً بالصلوات الخمس المقدرة في الأوقات الخمسة، وإنما نسخه سبحانه؛ إذ { عَلِمَ } بمقتضى حضرة علمه وحكمته { أَن } أي: إنه { سَيَكُونُ } بعضاً { مِنكُمْ مَّرْضَىٰ } من السهر المفرط؛ إذ الأبدان متفاوتة في تحمل المشاق، سيما ترك النوم المعدّ؛ لاستراحة البدن في الليل { وَ } أيضاً { آخَرُونَ } منكم { يَضْرِبُونَ } ويسافرون { فِي ٱلأَرْضِ } سفراً مباحاً { يَبْتَغُونَ } ويطلبون بسفرهم { مِن فَضْلِ ٱللَّهِ } وسعة جوده وكرمه مزيد رزق، أو طلب علم، أو صلة رحم، أو زيارة صديق إلى غير من الأسفار المشروعة، فيتحرجون بقيام الليل والتهجد فيه { وَآخَرُونَ } أيضاً { يُقَٰتِلُونَ } مع أعداء الله { فِي سَبِيلِ ٱللَّهِ } ترويجاً لدينه، وإعلاءً لكلمة توحيده، فإنهم لو تهجدوا لضعفوا ألبتة فشق عليهم أمر القتال.\nوبعدما أزال عنكم سبحانه حرجكم وتعبكم بمقتضى حكمته المتقنة البالغة، فعليكم ألاَّ تتركوا التهجد رأساً، ولا تنسوه جملةً، بل قوموا في خلال الليل؛ للتهجد إن استطعتم { فَٱقْرَءُواْ } فيه { مَا تَيَسَّرَ } لكم { مِنْهُ } أي: من القرآن { وَأَقِيمُواْ ٱلصَّلَٰوةَ } المفروضة، وواظبوا على أدائها وقيامها حق المواظبة، وراعوا أركانها وأبعاضها وهيئاتها على وجوهها، وبالجملة: أدوها على وجه يرضى عنكم مولاكم، ولا تهاونوا عليها، ولا تقصروا فيها.\n\nواعلموا أيها المؤمنون أن الفارق بين الإيمان والكفر، والهداية والضلال إنما هي الصلاة التي هي أقوى أعمدة الدين وأقومها { وَ } أيضاً { آتُواْ ٱلزَّكَٰوةَ } المأمورة لكم على سبيل الوجوب؛ تزكيةً لأنفسكم عن الشح، وأموالكم عن الفضلات، وتمريناً لأنفسكم على الإنفاق وفعل الخيرات { وَ } بعد أداء الواجب من الزكاة { أَقْرِضُواْ ٱللَّهَ } القادر المقتدر على وجوه الإنعامات بإعداء فواضل الصدقات، وأنواع الخيرات وبناء المساجد والرباطات، وغير ذلك مما يتعلق بمصالح المسلمين من المنافع الحاصلة بالمال { قَرْضاً حَسَناً } بلا شوب المنِّ والأذى، والسمعة والرياء، والعجب وأنواع الهوى.\n\n{ وَ } اعلموا أيها المؤمنون أن { مَا تُقَدِّمُواْ } وتؤخروا { لأَنفُسِكُمْ مِّنْ خَيْرٍ } موجب لأجر مستلزم لثواب، سواء كان مالياً أو بدنياً، قبل حلول الأجل وهجوم الموت { تَجِدُوهُ عِندَ ٱللَّهِ } المفضل المنعم { هُوَ خَيْراً وَأَعْظَمَ أَجْراً } وأكرم محلاً، وأعز درجةً ومنزلاً من الذي يؤخرونه إلى الوصية حين حلول الأجل { وَ } إن جرى عليكم ي سالف زمانكم ما جرى من ترك الاستغفار { ٱسْتَغْفِرُواْ ٱللَّهَ } المفضل المكرم لما صدر عنكم، واشتغلوا لامتثال أوامره في بقية أعماركم تلافياً لما مضى { إِنَّ ٱللَّهَ } المطلع على إنابتكم ونياتكم فيها { غَفُورٌ } يغفر زلتكم الماضية أيضاً { رَّحِيمٌ } [المزمل: 20] يقبل توبتكم اللاحقة لها بمنِّه وجوده.\n\nخاتمة السورة\n\nعليك أيها السالك لسلوك التوحيد، والقاصد نحو مقصد الفناء أن تبذل وسعك في طريق التوحيد ببدنك ومالك، وجميع أحوالك وأطوارك، وتجتهد في تصفية ظاهرك وباطنك، وتخلية قلبك عن الشواغل العائقة عن التوجه التام والالتفات الخالص.\n\nفلك أن تلازم العزلة، وتداوم الخلوة، وتواظب على الاتصاف بالأطوار والأخلاق الموروثة لك من النبي المختار، والمأثورة منه من الآثار، وامتثال ما في كتاب الله من الأوامر والنواهي والأحكام الموردة فيه؛ لتصفية الخاطر عن الميل إلى ما سوى الحق من الأغيار الساقطة عن درجة الاعتبار؛ لتكون من الأبرار الأخيار الموسومين بأولي العبرة والأبصار، وتفوزوا بما فاز من الرموز والأسرار.\n\nوإياك إياك ومصابحة الأشرار المغترين بلذات الدنيا الغدارة، وشهوات الحياة المستعارة المستلزمة لأنواع الخسار والبوار.\n\nجعلنا الله الغفور الغفار من ذوي العبرة والاستبصار بفضله وطوله.\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحق جلّ جلاله: { إِنَّ ربك يعلمُ أنك تقومُ أدْنَى } أي: أقل { من ثلثي الليل } ، استعير الأدنى ـ وهو الأقرب، للأقل لأنَّ المسافة بين الثلثين إذا دنت قلَّ ما بينهما من الأحيان، وإذا بعدت كثر ذلك، { ونِصْفَهُ وثُلُثَهُ } ، مَن نَصَبَهما عَطَفَهما على \" أدنى \" ومَن جرهما عطفهما على \" ثُلثي \" ، أي: عَلِمَ أنك تقوم تارة أدنى من ثلثي الليل، وتارة نصفَه، وتارة ثلثه، أو أدنى من ثلثه بحسب ما تيسر، { وطائفةٌ من الذين معك } أي: ويقوم ذلك المقدار طائفة مِن أصحابك. قيل: وفيه دليل على أنه لم يكن فرضاً على الجميع، وإلاَّ لقال: والذين معك، إلاّ أن يُقال: كان فيهم مَن يقوم في بيته، ومنهم مَن يقوم معه، فيمكن إذ ذاك الفرضية على الجميع، وعلى كل حال فالمراد بالطائفة: الجماعة الكثيرة من الصحابة لأنها في معرض الثناء، على أنه لا يتصور الحرج على الفرد النادر، فـ \" طائفة \" عطف على ضمير \" يقوم \" ، وجاز بلا توكيد لوجود الفصل. { والله يُقَدِّرُ الليلَ والنهارَ } أي: لايَقدر على تقدير الليل والنهار ولا يعلم مقادير ساعاتها إلاَّ الله وحده، وتقديم اسمه عزّ وجل يُؤذن بالاختصاص. ثم إنهم قاموا حتى انتفحت أقدامهم، فنزل التخفيف بقوله: { عَلِمَ أن لن تُحْصُوهُ } لن تطيقوا قيامه على المقادير المأمور بها أول السورة إلاَّ بشدة وحرج. { فتابَ عليكم } فخفف عنكم، وأسقط عنكم فرض قيام الليل، { فأقرؤوا ما تيسَّرَ من القرآن } أي: فصَلُّوا ما تيسّر لكم من صلاة الليل، عبّر عن الصلاة بالقراءة لأنها بعض أركانها. قيل: كان التهجُّد واجباً على التخيير المذكور، ثم نسخ بما تيسّر منه، ثم نسخ بالصلوات الخمس. وقيل: المراد بقوله: { فاقرؤوا ما تيسَّر } أي: في صلاة الفرض، فيكون الأمر للوجوب، وعيّنَ مالك قولَه: { ما تيسّر } بالفاتحة، وتركه أبو حنيفة على ظاهره، فأي آية قرأ كفت في الفرض وغيره، والمشهور: أن الآية في قيام الليل، وقيل: في مطلق التلاوة في كل ليلة. قال القشيري: يقال: من خمس آيات فما زاد، ويُقال: من عشر آيات فما زاد. هـ. ونقل ابن عطية عن بعضهم: أن الركعتين بعد العشاء مع الوتر داخله في أمثال هذا الأمر، ومَن زاده الله. هـ. وقال الثعلبي: ما خفّ وسهل من غير مقدار من القراءة والمدة. وقيل هو فرض على أهل القرآن دون غيرهم، أي: فيجب عليهم تلاوة القرآن كل ليلة. قال الحسن: مَن قرأ مائة آية لم يحجّه القرآن، أي: لم يغلبه بالحجة. هـ. فمَن قرأ كل ليلة حزباً فقد كفاه ولم يحاسَب عليه. ورَوى أبو حنيفة عن أبي هريرة رضي الله عنه: أن رسول الله صلى الله عليه وسلم قال:\n\n \" مَنْ قرأَ مائة آية في لَيْلةٍ لم يُكْتَب مِن الغَافلين، ومَن قَرأَ مائتي آية كُتب من القَانتين... \" \nالحديث. ثم بيّن الحكمة في النسخ، وهي تعذُّر القيام على المرضى والمسافرين والمجاهدين، فقال: { عَلِمَ أن سيكونُ منكم مَّرْضَى } فيشق عليهم قيام الليل، و \" أن \" مخففة، والسين دالة على ذلك لأنها تلي \" أن \" المصدرية، { وآخرون يضربون في الأرض } يُسافرون فيها للتجارة { يَبتغون من فضل الله } الريح، ويدخل في ابتغاء الفضل: تحصيل العلم وزيادة الأولياء. { وآخرون يُقاتلون في سبيل الله } لإعلاء كلمة الله، سَوَّى بين المجاهِد والمكتسِب لأنَّ كسب الحلال جهاد، قال ابن مسعود رضي الله عنه: أيُّما رجل جَلَبَ شيئاً إلى مدينة من مدائن المسلمين، صابراً محتسباً، فباعه بسعر يومه كان عند الله من الشهداء، وقال ابن عمر رضي الله عنه: ما خلق اللهُ موتة أموتها بعد القتل في سبيل الله أحب إليَّ من أن أموت بين شِقيْ رحْلي، أضرب في الأرض، أبتغي من فضل الله. هـ. { فاقرؤوا ما تيسّر منه } من غير تحمُّل المشاق. كرّر الأمر بالتيسير لشدة احتياجهم. { وأقيموا الصلاةَ } المفروضة، { وآتوا الزكاةَ } الواجبة. وهذا يؤيد أنّ الآية مدنية. { وأَقْرِضوا اللهَ قرضاً حسناً } ، أريد الإنفاقات في سبيل الله من الحلال بالإخلاص، فالقرض لغة: القطع، وفي الاصطلاح: السلف، فالمنفِق يقطع ذلك القدر من ماله فيدفعه إلى غيره، وكذلك المتصدِّق يقطع ذلك القدر من ماله فيجعله لله، وأنما أضافه تعالى إلى نفسه لئلا يَمُنّ على الفقير فيما يتصدّق به عليه لأنّ الفقير مُعين له في تلك القُربة، فلا تكون له عليه مِنَّة بل المِنَّة للفقير عليه، حيث قَبِلَه منه. { وما تُقدِّموا لأنفسكم من خيرٍ تجدوه } أي: ثوابه، وهو جواب الشرط { عند الله هو خيراً } مما خلفتم، أو أخّرتم إلى الوصية عند الموت. وأخيراً مفعول ثان بتجدوه، وهو ضمير فصل، وجاز وإن لم يقع بين معرفتين لأنّ \" أفعل \" في حكم المعرفة، ولذلك امتنع من حرف التعريف، { وأعظمَ أجراً } وأجزل ثواباً، { واستغفِرُوا الله } في كافة أحوالكم، فإنَّ الإنسان لا يخلو من تفريط، { إِن الله غفور } يستر على أهل الذنوب والعصيان، { رحيم } يخفّف عن أهل الجهد والتشمير. الإشارة: أُعطي صلى الله عليه وسلم القوة في الجهتين، فكان قوي الظاهر والباطن ليقتدي به الجميع، فالعُبَّاد والزُهَّاد أخذوا من عبادة الظاهر، من الصيام والقيام، والعارفون المسلكون أخذوا منه عبادةَ الباطن من الفكرة والنظرة، والعكوف في الحضرة، فتهجُّد العُبّاد والزُهّاد والصالحين بالركوع والسجود، وتَهَجُّد العارفين بعكوف القلب في شهود الملك الودود، ومناجاته، والتملُّق بين يديه، وهكذا كانت الصحابة ـ رضي الله عنهم ـ كان فيهم مَن يقوم بالصلاة، ومنهم مَن يقطع ليله في الفكرة، كالصدّيق وأمثاله، \" والله يُقدِّر الليل والنهار \" قال القشيري: يعني يُقدِّر السلوك من ليل الطبيعة إلى نهار الحقيقة، بتقدير الله لا بتقدير السالك.\nعَلِمَ أن لن تحصوه، أي: لن تقدروا على مدة ذلك بالوصول إلى الله، والوصول مترتب على فضل الله ورحمته، لا على سلوككم وسيركم، فكم مِن سالك انقطع في الطريق، ورجع القهقرى، كما قيل: ليس كل مَن سلك وصل، ولا كل مَن وصل اتصل، ولا كل مَن اتصل انفصل. هـ. { فاقرؤوا ما تيسّر من القرآن } ، ولا تستغرقوا أوقاتكم في تلاوة حروفه حتى تستكملوا تصفية قلوبكم بذكر الله، لتتهيأ لإشراق أنوار معانيه وأسراره فيها، وأمّا ما دامت القلوب محشوة بصور الألوان، مكدّرة بصدى الهوى والحظوظ، فلا تتمتع بحلاوة أسراره، ولا تتمكن من تدبُّر خطابه، ولأجل هذا كانت الأشياخ تأمر المريد أولاً بمجرد الذكر والرياضة والاستغراق في الاسم المفرد، حتى يتجوهر عقله، وتصفو مرآة قلبه، ويتمكن من مقام الفناء والبقاء، وحينئذ يرجع لتلاوة القرآن، ليجد حلاوته، ولذلك قال تعالى: { عَلِمَ أن سيكونُ منكم مَرْضى } أي: مرضى القلوب بحجب الأنانية، والاشتغال بحب الدنيا وشهواتها فلا يظهر عليها مِن أسرار القرآن وحقائقه شيء، { وآخرون يضربون في الأرض يبتغون من فضل الله } وهم الطالبون من العُبَّاد والزُهَّاد، فلا ينالون من باطن القرآن شيئاً، { وآخرون يقاتلون في سبيل الله } ، مشتغلون بجهاد أنفسهم، فلا يتفرّغون لتدبُّر كلامه تعالى، فيقال لهم: اقرؤوا ما تيسّر منه، وأقيموا صلاة القلوب، بعُكوف الهم على ذكر واحد، وآتوا الزكاة، زكاة أبدانكم بالرياضة والمجاهدة، وأَقرِضوا الله قرضاً حسناً، بأن تقطعوا حب الدنيا من قلوبكم فمَن زهد الدنيا أحبّه الله. وما تُقدموا لأنفسكم من خير، كالمجاهدة والمكابدة تجدوه عند الله في الدنيا والآخرة هو خيراً وأعظم أجراً، فتدوم المشاهدة، وتصحبها المكالمة. واستغفِروا الله من الالتفات لوجودكم إن وقع، إن الله غفور رحيم. وصلّى الله على سيدنا محمد وآله وصحبه وسلّم.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "57:11",
      "similarity": 0.32680455690405585
    },
    {
      "verse": "57:18",
      "similarity": 0.32334814705716713
    },
    {
      "verse": "64:17",
      "similarity": 0.3031875718547644
    },
    {
      "verse": "73:3",
      "similarity": 0.27477042216741415
    },
    {
      "verse": "2:245",
      "similarity": 0.2609293181490691
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/073020.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/073020.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/73:20.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}