{
  "chapter": "المزمل",
  "text": "رب المشرق والمغرب لا اله الا هو فاتخذه وكيلا",
  "translations": [
    {
      "translation": "He is the Lord of the East and the West. There is no god but He. So take Him alone as your protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Lord of the East and the West; there is no god but He. So take Him alone for your Guardian,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the only Lord, so choose Him as your guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the East and Lord of the West – there is no God except Him, therefore make Him your sole Trustee of affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the east and the west; La ilaha illa Huwa, so take Him as a trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord of the East and the West-- there is no god but He-- therefore take Him for a protector.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the East and the West; there is no god but He; so take Him for a Guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the East and the West; there is no Allah save Him; so choose thou Him alone for thy defender -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Lord of the east and the west, there is no deity but Him, so take Him as your Guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the east and the west! No God is there but He! Wherefore take Him for thy trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the east and the west, there is no god except Him; so take Him for your trustee,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He is) Lord of the East and the West: there is no god but He: take Him therefore for (thy) Disposer of Affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(He Alone is) the Lord of the east and the west, La ilaha illa Huwa (none has the right to be worshipped but He). So take Him Alone as Wakil (Disposer of your affairs).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Lord of the East and the West; there is no god except Him. Take Him for your Guardian.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the East and the West. There is no god but He, so take Him as a Trustee.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[He is] the Lord of the East and the West; there is no deity except Him, so take Him as Disposer of [your] affairs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[73:9] He is, Lord of the east and the west; there is no god except Him, so take Him for a Guardian, entrusting your affairs to Him,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lord of the East and the West) is Allah; (there is no God save Him; so choose you Him alone for thy defender) worship Him as a Lord; it is also said this means: take Him as a Guardian regarding that which He promised you of help, supremacy and reward.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا تنقطع إليه ولا تتجرد نحوه، مع أنه سبحانه { رَّبُّ ٱلْمَشْرِقِ وَٱلْمَغْرِبِ } أي: جنس المشارق والمغارب التي هي ذرائر الكائنات باعتبار ظهور شمس الذات منها، وشروقها عليها، وباعتبار بطونها وخفائها فيها؛ إذ { لاَ إِلَـٰهَ } أي: لا موجود في الوجود { إِلاَّ هُوَ } ولا شيء سواه { فَٱتَّخِذْهُ وَكِيلاً } [المزمل: 9] سيما بعدما لم يوجد في الوجود غيره أصيلاً؟!\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ربُّ المشرقِ والمعربِ } أي: هو رب، أو: مبتدأ خبره: { لا إِله إلاّ هو } ، ومَن قرأه بالجر فبدل من \" ربك \" ، وقيل: على إضمار القسم، وجوابه: لا إله إلاّ هو، أي: وربِّ المشرق لا إله إلا هو، كقولك: والله لا أحد في الدار\n { فاتَّخِذْه وَكِيلا } أي: وليًّا وكفيلاً بما وعدك من النصر والعز\n والفاء لترتيب ما قبله، أي: إذا علمت أنه ملك المشرق والمغرب، وأن لا إله إلا هو، فاتخذه كفيلاً لأمورك",
      "translations": []
    }
  ]
}