{
  "chapter": "المدثر",
  "text": "ذرنى ومن خلقت وحيدا",
  "translations": [
    {
      "translation": "Leave the person I created on his own to Me alone,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave him to Me whom I created alone,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave Me with him whom I alone have created,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave to Me the one, whom I have created all by Myself,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave him to Me, the one whom I created single.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave Me alone (to deal) with whom I created lonely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave Me and him whom I created alone,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave Me with him whom I created alone,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave Me (to deal) with him whom I created lonely,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave Me alone [to deal] with him whom I have created alone,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Let Me alone with him whom I created lonely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave Me [to deal] with him whom I created alone,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave Me alone, (to deal) with the (creature) whom I created (bare and) alone!-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave Me Alone (to deal) with whom I created Alone (without any means, i.e. Al-Walid bin Al-Mughirah Al-Makhzumi)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave Me alone with he whom I created\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave Me to him whom I created alone.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Leave Me with the one I created alone\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[74:11] Leave Me [to deal] with him whom I created (wa-man khalaqtu is a supplement to the direct object, or [it is] an object of accompaniment) lonely (wahīdan is a circumstantial qualifier referring to the man, ‘whom’, or to the pronoun referring to it but omitted from khalaqtu [sc. khalaqtuhu]), alone, without family or wealth — this was al-Walīd b. al-Mughīra al-Makhzūmī —\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Leave Me) Muhammad ((to deal) with him whom I created lonely) without wealth, children or spouse, this is a threat from Allah to al-Walid Ibn al-Mughirah al-Makhzumi.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ذَرْنِي وَمَنْ خَلَقْتُ وَحِيداً } معناه خَلقتُهُ وحدَهُ ليسَ مَعهُ مالٌ ولا ولدٌ\n وهو الوَليدُ بن المُغيرة المَخزومي\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Leave Me and whoever I have created alone} means that I have created him alone, without wealth or children.\n\n\nAnd he is the son of al-Mughirah al-Makhzumi.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما سمعت قيام يوم القيامة وتنقيد الأعمال فيها، والجزاء عليها، لا تستعجل يا أكمل الرسل لانتقام المشركين المسرفين، ولا تعجل عليهم، بل { ذَرْنِي } يا أكمل الرسل { وَمَنْ خَلَقْتُ } أي: مع شخص خلقته { وَحِيداً } [المدثر: 11] متفرداً من أهل عصره، مفروزاً منهم بكثرة الأموال والأولاد، والثروة والجاه، إلى حيث لُقب بين قومه بريحانة قريش؛ يعني: وليد بن المغيرة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ذَرْنِي ومَنْ خلقتُ } أي: كِلْ أمره إليَّ فأنا أكفيك أمره، وهو الوليد بن المغيرة، وقوله: { وحيداً }: حال من عائد الموصول، أي: خلقته منفرداً، لا مال له ولا ولداً، أو من الياء، أي: ذرني وحدي معه، فأنا أكفيكه، أو من التاء، اي: خلقته وحدي ولم يشاركني في خلقه أحد، والأول أنسب بقوله: { وجعلتُ له مالاً ممدوداً } مبسوطاً كثيراً، أو ممدوداً بالنماء، وكان له الزرع والضرع والتجارة، وعن مجاهد: له مائة ألف دينار، وكان له أرض بالطائف، لا تنقطع ثمارها صيفاً وشتاءً، { وبنينَ شُهوداً } حضوراً معه بمكة لغناهم، يتمتع بشهودهم، لا يفارقونه لعمل، لكونهم مكُفيين، أو حضوراً في الأندية والمحامل لوجاهتهم، واعتيادهم، وكانوا عشرة، وقيل: ثلاثة عشر، وقيل: سبعة، كلهم رجال، الوليد بن الوليد، وخالد، وعمار ة، وهشام، والعاصي، وقيس، وعبد شمس، أسلم منهم خالد وهشام وعمارة، وجعل السهيلي بدل عمارة الوليدَ بن الوليد، وهو الصحيح، وفيه قال عليه السلام:\n\n \" اللهم أنج الوليد بن الوليد \" \n\nحين كان يُعذّب بمكة على الإسلام، والوليد هذا كان سبب إسلام أخيه خالد، وكان خالد فارًّا منه صلى الله عليه وسلم، فسمع الوليدُ النبيَّ صلى الله عليه وسلم يقول:\n\n \" لو أتانا لأكرمناه \" \n\n، فكتب إليه، فوقع الإسلام في قلبه، وسمّاه سيفاً من سيوف الله، به فتح الله كثيراً من البلدان، وأما عُمارة فذكر غيرُ واحد أنه مات مشركاً عند النجاشي، ويروى أنَّ النجاشي قتله بسبب اختلافه إلى زوجته، ووشى به عَمْرُو بن العاص، كما ذكره الطيبي\n انظر المحشي\n { ومَهَّدتُ له تمهيداً } أي: بسطت له الجاه العريض، والرياسة، حتى كان يُلقَّب ريحانة قريش، فأتممت عليه نعمتَي الجاه والمال، واجتماعهما هو الكمال عند أهل الدنيا، { ثم يطمعُ أن أزيدَ } على ما أوتيه من المال والولد والجاه من غير شكر، وهور استبعاد واستنكارٌ لطمعه وحرصه\n وعن الحسن: يطمع أن أزيده الجنة، فأعطيه فيها مالاً وولداً، كما قال العاصي:\n\n[مريم:77]، وكان من فرط جهله يقول: إن كان محمد صادقاً فما خُلقت الجنة إلاَّ ليَ\n { كلاَّ }: ردع وزجر عن طمعه الفارغ، وقطع لرجائه الخائب، أي: لا نجمع له بعد اليوم بين الكفر والمزيد من النِّعم، فلم يزل بعد نزول الآية في نقصان من المال والجاه، وانتكاس، حتى هلك، { إِنه كان لآياتنا } القرآن { عنيداً } معانداً جاحداً، وهو تعليل للردع على وجه الاستئناف، كأنّ قائلاً قال: لِمَ لا يُزاد؟ فقال: إنه عاند آيات المنعِم، مع وضوحها، وكَفَرَ نعمته مع سُبُوغها، وهو مما يوجب حرمانها بالكلية، مع أن ما أوتيه إنما هو استدراج يوجب مزيد العذاب، كما قال تعالى: { سأُرهقه صَعوداً } سأُغشيه بدل ما يطمعه من الجنة عقبة شاقة المصْعد، وهو مثل لِما يلقى من العذاب الصعب الذي لا يُطاق، وفي الحديث:\n\n\n\n \" الصعود: جبل من نار يصعد فيه سبعين خريفاً، ثم يهوي فيه كذلك أبداً \"\n \n\nثم علّل استحقاقه لهذا العذاب بقوله: { إِنه فَكَّر } ما يقول في شأن القرآن، { وقَدَّر } في نفسه ما يقوله وهياه، كأنه تعالى عاجله بالفقر والذل بعد الغنى والعز لعناده، ويُعاقبه في الآخرة بأشد العذاب، لبلوغه بالعناد غايته، حيث قال في كلامه تعالى المعجِز: سحراً، وفي رسوله عليه السلام: ساحراً، { فقُتل } أي: لُعن { كيف قَدَّر ثم قُتل كيف قَدَّر }؟ كرّر للتأكيد، و \" ثم \" للإشعار بأنَّ الدعاء الثاني أبلغ، وقيل: هو تعجيب من تقديره وإصابته فيه الغرض الذي كان ينتحيه قريش، قاتلهم الله، كما يقال: قاتله الله ما أشجعه، وأخزاه الله ما أشعره! رُوي أنه سمع النبي صلى الله عليه وسلم يقرأ \" حم \" غافر، أو فُصلت، ثم رجع إلى بني مخزوم فقال: والله لقد سمعتُ من محمد كلاماً ما هو من كلام الإنس ولا من كلام الجن، وإنَّ له لحلاوة، وإنَّ عليه لَطلاوة، وإنَّ أعلاه لمُثمر، وإنَّ أسفله لمُغدق، وإنه يعلو ولا يُعلى عليه، فقالت قريش: صبأ والله الوليد، لتَصْبُوَنّ قريش كلها، فقال ابن أخيه أو جهل: أنا أكفيكموه، فانطلق إليه حزيناً، فقال له: ما لي أراك حزيناً؟ فقال: وما لي لا أحزن، وهذه قريش يجمعون لك نفقة يعينونك على كِبر سنك، يزعمون أنك زيّنت كلام محمد، تدخل على ابن أبي كبشة وأبي قحافة، لِتنال من طعامهم، فغضب الوليد، وقصدهم، وقال: تزعمون أنَّ محمداً مجنون، فهل رأيتموه يُخْنِقُ قط؟ قالوا: لا، قال: تزعمون أنه شاعر، فهل رأيتموه ينطق بشعر قط؟ قالو: لا، قال: تزعمون أنه كاهن، فهل رأيتموه يتكهّن قط؟ قالوا: لا، قال: تزعمون أنه كذّاب، فهل جريتم عليه من الكذب قط؟ قالوا: اللهم لا، ثم قالوا له: فما هو؟ ففكَّر فقال: ما هو إلاَّ ساحر، أمّا رأيتموه يُفرّق بين الرجل وأهله وولده ومواليه؟ وما الذي يقوله إلاّ سحر يأثره عن أهل بابل، فارتجّ النادي فرحاً، وتفرّقوا معْجبين بقوله متعجبين منه، وهذا معنى قوله: { إنه فكَّر\n\n\n } الخ\n { ثم نَظَرَ } أي: في القرآن مرة بعد مرة، أو نظر بأي شيء يَرُدُّ الحقَّ، أو فيما قدّر، { ثم عَبَسَ } قطَّب وجهه لمَّا لم يجد فيه مطعناً، ولم يدرِ ماذا يقول، وقيل: نظر في وجوه الناس، ثم قطَّب وجه، { وبَسَرَ } زاد في العبوسة والكلوح، { ثم أدبرَ } عن الحق، أو عن رسول الله صلى الله عليه وسلم، { واستكبر } عن اتباعه، و { ثم نظر }: عطف على قَدَّر، والدعاء اعتراض، وإيراد \" ثم \" في المعطوفات لبيان أنَّ بين الأفعال والمعطوفة تراخياً أو تفاوتاً، { فقال إِنْ هذا إِلاّ سِِحْر يُؤثَرُ } أي: يُروى ويُتعلم، والفاء للدلالة على أنَّ هذه الكلمة لمّا خطرت بباله تفوَّه بها من غير تَلعثم ولا تلبُّث وقوله: { إِنْ هذا إِلاَّ قولُ البشرِ } تأكيد لِما قبله، ولذلك أخلى عن العاطف\n\n\nقال تعالى: { سأُصليه } سأُدخله { سَقَر } ، وهو بدل من { سأُرهقه صَعُوداً } وسقر: علم لجهنم، ولم ينصرف للتعريف والتأنيث، { وما أدراك ما سَقَرُ } ، تهويل لشأنها، { لا تُبقي ولا تَذرُ } ، بيان لحالها، أي: لا تُبقي شيئاً يُلقى فيها إلاَّ أهلكته، وإذا هلك لم تذره هالكاً حتى يُعاد، أو: لا تُبقي لحماً، ولا تّذرُ عظماً، أو: لا تُبقي لحماً إلاّ أكلته، ولا تدع أن تعود عليه أشد ما كانت، وقال الضحاك: إذا أخذت فيهم لم تُبق منهم شيئاً، وإذا أُعيدوا لم تذرهم حتى تفنيهم، ولكل شيء فترة ومَلالة إلاّ جهنم\n هـ\n { لوَّحاةٌ للبَشرِ } أي: مغيّرة للجلود حتى تُسوّدها، تقول العرب: لاحته الشمس ولوَّحته، أي: غيَّرته، قيل: تلفح الجلد لفحة، فتدعه أشد سواداً من الليل، وقال الحسن: تلوح لهم جهنم حتى يرونها عياناً، نظيره:\n\n[الشعراء:91] والبشر: اسم، جمع بشرة، وهي ظاهر جلد الإنسان، ويجمع أيضاً على أبشار، { عليها تسعةَ عشرَ } أي: على أمرها تسعة عشر ملكاً، خزنتُها، وقيل: تسعة عشر صِنفاً من الملائكة، وقيل: صفًّا، وقيل: نقيباً\n قيل: الحكمة في تخصيص هذا العدد لخزنة جهنم أن ذكرهم الذي يتقوَّون به البسلمة، وذلك عدد حروفها\n هـ\n والله تعالى أعلم\n الإشارة: هذه الآية تَجُر ذيلها على كل مَن آتاه الله المالَ والجاه البنين، ثم جعل ينتقد على أولياء الله، ويحتقر أهل النسبة، بل على كل مَن يُطلق لسانه في أهل النسبة يناله ما نال الوليد لأنه كان لآيات الله ـ وهم خاصة أوليائه ـ عنيداً جاحد القلب، وحاسداً، سأُرهقه صَعُوداً، أي: عذاباً متعباً له، في الدنيا بالحرص والطمع، وفقر القلب، وكذا العيش في الآخرة بسدل الحجاب، والطرد عن ساحة المقربين، إنه فَكَّر فيما يكيد به أولياءه، وقَدّر ذلك، فلُعن كيف قَدّر، ثم نظر إليهم فعبس وبسر\n قلت: وقد رأيتُ بعض المتفقهة المتجمدين، إذا رأوا أحداً من أهل التجريد، عبسوا وقطَّبوا وجوههم، ولووا رؤوسهم، لشدة حَنقهم على هذه الطائفة، نعوذ بالله من الحرمان\n وكل ما رُمي به صلى الله عليه وسلم من السحر وغيره قد رُمي به خلفاؤه، فيُقال لمَن رماهم وعابهم: سأُصليه سقر، نار القطيعة والبُعد، لا تٌبقي له رتبة، ولا تذر له مقاماً ولا جاهاً عند الله، تُزيل عنه سيما العارفين ومهجة المحبين وتغير بشريته بالكآبة والحسرة، والتأسُّف عن التخلُّف عن مقام المقربين، عليها، أي: على النار المحيطة بهم، تسعة عشر حجاباً حجاب المعاصي القلبية والقالبية، ثم حجاب الغفلة، ثم حُب الدنيا، ثم حب الهوى، ثم الحسد، ثم الكفر، ثم الحقد، ثم الغضب، ثم حب الظهور، ثم حب الجاه، ثم الطمع، ثم الحرص، ثم خوف الفقر، ثم هَم الزرق، ثم خوف الخلق، ثم التدبير والاختيار، ثم العَجَلة، ثم الرعونة، ثم حجاب الحسد والوهم\n والله تعالى أعلم\n ثم ذكر حكمة جعل الخزنةَ تسعة عشر، فقال: { وَمَا جَعَلْنَآ أَصْحَابَ ٱلنَّارِ إِلاَّ مَلاَئِكَةً }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:21",
      "similarity": 0.6591524567082436
    },
    {
      "verse": "7:70",
      "similarity": 0.6301124593985682
    },
    {
      "verse": "26:166",
      "similarity": 0.5241321363779883
    },
    {
      "verse": "37:4",
      "similarity": 0.4999273549626645
    },
    {
      "verse": "2:163",
      "similarity": 0.46648348514520377
    }
  ]
}