{
  "chapter": "المدثر",
  "text": "قالوا۟ لم نك من المصلين",
  "translations": [
    {
      "translation": "They will say, 'We were not among those who did salat",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will answer: \"We did not fulfil our devotional obligations,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will answer: “We were not among those who observed Prayer,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will reply, \"We did not pray,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “We never used to offer the prayer.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"We were not of those who used to offer the Salah,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say: We were not of those who prayed;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They shall say, 'We were not of those who prayed, and\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will answer: We were not of those who prayed\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and they shall reply, \"We were not among those who prayed;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say. 'we have not been of those who prayed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will answer, ‘We were not among those who prayed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"We were not of those who prayed;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say: \"We were not of those who used to offer their Salat (prayers)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will reply: 'We were not among those who prayed\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, “We were not of those who prayed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will say, \"We were not of those who prayed,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[74:43] They will say, ‘We were not of those who prayed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "They will answer) the dwellers of the Fire will answer: (We were not of those who prayed) the five daily prayers, i.e. we were not among the Muslims.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالُواْ } أي: المجرمون في جوابهم متحسرين متأسفين: { لَمْ نَكُ } في دار الاختبار ونشأة الاعتبار { مِنَ ٱلْمُصَلِّينَ } [المدثر: 43] المتوجهين نحو الحق في الأوقات المكتوبة علينا\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قالوا } أي: المجرمين مجيبين للسائلين: { لم نكُ من المصلِّين } للصلوات الواجبة، { ولم نك نُطعم المسكين } كما يُطعم المسلمون، وفيه دلالة على أنّ الكفار مخاطبون بالفروع في حق المؤاخذة، { وكنا نخوض مع الخائضين } أي: نشرع في الباطل مع الشارعين فيه، فنقول الباطل والزور في آيات الله، { وكنا نُكذِّب بيوم الدين } بيوم الجزاء والحساب\n وتأخير ذكر جنايتهم هذه مع كونها أعظم من الكل لتفخيمها، كأنهم قالوا: وكنا بعد ذلك مكذِّبين بيوم الدين، ولبيان كون تكذيبهم به مقارناً لسائر جناياتهم المعدودة مستمراً إلى آخر عمرهم، حسبما نطق به قوله تعالى: { حتى أتانا اليقينُ } الموت ومقدماته، { فما تنفعهم شفاعةُ الشافعين } من الملائكة والنبيين والأولياء والصالحين، لأنها خاصة بالمؤمنين، وفيه دلالة على ثبوت الشفاعة للمؤمنين، وفي الحديث:\n\n\n\n \" إن من أمتي مَن يدخل الجنة بشفاعته أكثر من ربيعة ومضر \"\n \n\n{ فما لهم عن الذكرةِ } عن التذكير والوعظ بالقرآن { معرِضين } مولّين، والفاء لترتيب ما قبلها من موجبات الإقبال عليه، والاتعاظ به من سوء حال المعرضين، و \" معرضين \": حال من الضمير الواقع خبراً لـ \" ما \" الاستفهامية، كقولك: ما لك قائماً؟ أي: فإذا كان حال المكذّبين به على ما ذكر من سوء الحال\n فإيُّ شيء حصل لكم حال كونكم معرضين عن القرآن، مع تعاضد الدواعي إلى الإيمان؟ { كأنهم حُمُرٌ } أي حُمر الوحش { مُستنفِرَةٌ } شديدة النفار، كأنها تطلب النفار من نفوسها\n وقرأ نافع والشامي بفتح الفاء، أي: استنفرها غيرُها، وجملة التشبيه حال من ضمير \" معرضين \" أي: مشبّهين بحُمر نافرة { فرّتْ من قسورة } أي: من أسد فَعْولة من القَسر، وهو القهر، وقيل: هي جماعة الرماة الذين يصطادونها، شُبِّهوا في إعراضهم عن القرآن، واستماع ما فيه من المواعظ، وشرودهم عنه بحُمر حدث في نفارها ما أفزعها\n وفيه مِن ذمهم وتهجين حالهم من تشبيههم بالحُمر ما لا يخفى\n { بل يُريد كل امرىءٍ منهم أن يُؤتَى صُحفاً مُنَشَّرةً }: عطف على مُقدّر يقتضيه الكلام، كأنه قيل: لم يكتفوا بتلك التذكرة، ولم يَرضوا بها، بل يُريد كل امرىء منهم أن يُؤتى { صُحفاً مُنشَّرة } قراطيس تُنشر وتٌقرأ، وذلك أنهم قالوا للرسول صلى الله عليه وسلم: لن نتبعك حتى تأتي كلَّ واحدٍ منا بكتاب من السماء، عنوانها: من رب العالمين إلى فلان بن فلان، يؤمر فيها باتباعك، وهذا كقوله:\n\n[الإسراء:93]\n وقيل: قالوا: إن كان محمد صادقاً فليصبح عند رأس كل واحد منا صحيفة، فيها براءته وأمنه من النار\n { كَلاَّ } ، ردع لهم عن تلك الجرأة، وزجر عن اقتراح الآيات، { بل لا يخافون الآخرة } فلذلك يُعرضون عن التذكرة، لاَ لامتناع إيتاء الصُحف\n { كَلاَّ إِنه تذكرةٌ } زجَرهم عن إعراضهم عن التذكرة، وقال: إن القرآن تذكرة بليغة كافية، { فمَن شاءَ ذكرَه } أي: فمَن شاء أن يذكره ذكره، وحاز سعادة الدارين، { وما يَذْكُرُون } بمجرد مشيئتهم { إِلاّ أن يشاء اللهُ } هدايتهم فيذكرون، والاستثناء مفرغ من أعم الأحوال، أي: وما يذكرون لِعلةٍ من العلل، وفي حال من الأحوال، إلاَّ أن يشاء الله ذلك، وهو تصريح بأنَّ أفعال العباد كلها بمشيئة الله تعالى، وقرأ نافع ويعقوب بتاء الخطاب للكفرة\n { هو أهلُ التقوى } أي: حقيق با، يُتقى عقابه، ويؤمن به ويُطاع، { وأهلُ المغفرةِ } حقيق بأن يَغفر لمَن آمن به وأطاعه، وعنه عليه السلام في تفسيرها: \" هو أهل أن يُتّقى، وأهل أن يغفر لمن اتقاه \"\n\n\nوفي رواية ابن ماجه والترمذي:\n\n \" قال الله تعالى: أنا أهل أن أُتَّقَى، فلا يُجعل معي إله آخر، فمَن اتقى ذلك فأنا أهل أن أغْفر له \" \n\nقال ذلك عليه السلام لَمّا قرأ الآية\n هـ\n الإشارة: قال الورتجبي: قوله تعالى: { كل نفس بما كسبت رهينة\n\n\n } الخ، كلُّ واقفٍ مع حال، وملاحظ لمقام، فهو مرتهن، إلاّ مَن تجرّد مما دون الله، وهم أصحاب يمين مشاهدة الحق، فإنهم في جنان قُربه ووصاله\n هـ\n أي: كل نفس واقفة مع حالها أو مقامها مرتهنة معه، إلاّ مَن ينفذ إلى شهود الحق، إنه يكون من قبضة اليمين الذين اختارهم الله بمحض الفضل، فهم في جنات المعارف يتساءلون عن الغافلين: ما سلككم في سقر السقوط من درجة القُرب والوصال؟ قالوا: لم نك من المُصلِّين الصلاة الدائمة، ولم نك نُطعم المسكين، بل كنا بُخلاء بأموالنا وأنفسنا، وكنا نخوض في أودية الدنيا مع الخائفين، وكنا نُكذّب بيوم الدين لأنَّ أفعالهم كانت فعل مَن لا يُصدّق بيوم الحساب، حتى أتانا اليقين بعد الموت، فندمنا، فلم ينفع الندم وقد زلّت القَدَم، فما تنفع فيهم شفاعة الشافعين، حيث ماتوا غافلين لأنَّ الشفاعة لا تقع في مقام القُرب والاصطفاء، فمَن مات بعيداً بسبب الغفلة لا يصير قريباً، ولو شفع فيه ألف نبي وألف وَلِيّ، إذ القُرب على قدر الكشف، وكشف الحجاب عن الروح إنما يحصل في هذه الدار، لقوله عليه السلام:\n\n \" يموت المرء على ما عاش عليه، ويُبعث على ما مات عليه \" \n\nوإنما تقع الشفاعة في النجاة، أو في الدرجة الحسية، والله تعالى أعلم\n فما لهم، أي: لأهل الإعراض عن المذكِّر، عن التذكرة منه مُعرضين، كأنهم حُمر الوحش فرّت من قسورة، وتشبيههم بالحُمر في البلادة والجهل، وكل مَن طلب الكرامة من الأولياء فهو كاذب في الطلب، إذ لو صدق في الطلب لأراه الله الكرامات على أيديهم كالسحاب، كلاَّ بل لا يخافون الآخرة، ولو خافوها وجعلوها نُصب أعينهم لما توقّفوا على كرامة ولا معجزة، والأمر كله بيد الله، هو أهل التقوى وأهل المغفرة\n وبالله التوفيق، وصلّى الله سيدنا محمد وآله وصحبه وسلّم\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "70:22",
      "similarity": 0.7728016976298487
    },
    {
      "verse": "96:10",
      "similarity": 0.6556928791898408
    },
    {
      "verse": "75:31",
      "similarity": 0.6192279651824228
    },
    {
      "verse": "87:15",
      "similarity": 0.6182830774345426
    },
    {
      "verse": "2:157",
      "similarity": 0.6134111798514352
    }
  ]
}