{
  "chapter": "المدثر",
  "text": "بل يريد كل امرئ منهم ان يؤتى صحفا منشرة",
  "translations": [
    {
      "translation": "In fact each one of them wants to be given an unfurled scroll.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In fact every one of them wants to be given open books (like the prophets).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No indeed; each one of them desires that open letters be sent to each of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it that everyone of them wants to receive a heavenly book addressed to him personally?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather each one of them desires that he should be given open Books.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, everyone of them desires that he should be given pages spread out.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay; every one of them desires that he may be given pages spread out;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, every man of them desires to be -- given -- scrolls unrolled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, but everyone of them desireth that he should be given open pages (from Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, everyone of them desires to have sheets of revelations unfolded before them --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Aye! every one of them desireth that: he should be vouchsafed scrolls expanded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But everyone of them desires to be given unrolled scriptures [from Allah]!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Forsooth, each one of them wants to be given scrolls (of revelation) spread out!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, everyone of them desires that he should be given pages spread out (coming from Allah with a writing that Islam is the right religion, and Muhammad SAW has come with the truth from Allah the Lord of the heavens and earth, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, each one of them desires to be given unrolled scrolls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet every one of them desires to be given scrolls unrolled.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Rather, every person among them desires that he would be given scriptures spread about.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[74:52] Nay, but everyone of them desires to be given unrolled scrolls, from God, exalted be He, [enjoining them] to follow the Prophet (s), as they said [before], ‘And [even then] we will not believe your ascension until you bring down for us a book that we may read’ [Q. 17:93].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Nay, but everyone of them desireth that he should be given open pages (from Allah)) a book wherein is written his crimes and repentance, for they said: \"bring us a book in which is written our crimes and repentance and we will believe in you\".\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بَلْ يُرِيدُ كُلُّ ٱمْرِىءٍ مِّنْهُمْ أَن يُؤْتَىٰ صُحُفاً مُّنَشَّرَةً } قال الإِمام زيد بن علي عليهما السلامُ: معناه أنَّ الكُفارَ قالوا: إن كانَ محمدٌ صادقاً، فليَصبح تَحتَ كُلِّ واحدٍ صَحيفةٌ أنَّ لَهُ الجَنةَ وأَنهُ آمنٌ مِنَ النَّارِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ بَلْ يُرِيدُ كُلُّ ٱمْرِىءٍ مِّنْهُمْ أَن يُؤْتَىٰ } له من قِبَل الحق { صُحُفاً } قراطيس مدونة { مُّنَشَّرَةً } [المدثر: 52] تنشر وقت القراءة، ثمَّ تُطوى، كالصكوك والسجلات؛ لذلك قالوا للنبي صلى الله عليه وسلم: لن نتبعك حتى تأتي كلاًّ منَّا بكتاب من السماء مكتوب فيها: من الله إلى فلان، اتَّبع محمداً، فإنه نبي صادق\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}