{
  "chapter": "المدثر",
  "text": "فذلك يومئذ يوم عسير",
  "translations": [
    {
      "translation": "that Day will be a difficult day,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be a day of distress,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that will surely be a hard day,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "it will be a hard day\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So that is a tough day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, that Day will be a Hard Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That, at that time, shall be a difficult day,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that day will be a harsh day,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely that day will be a day of anguish,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that Day will be a hard and distressing Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That shall be - that Day-a day hard.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that will be a day of hardship,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That will be- that Day - a Day of Distress,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Truly, that Day will be a Hard Day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "that shall be a Harsh Day\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Day will be a difficult day.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That Day will be a difficult day\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[74:9] that day, that is to say, the time of the sounding (yawma’idhin is a substitution for the preceding subject,   and is not declined because it is annexed to something that cannot be declined; the predicate of the subject [is the following]) will be a harsh day (idhā is operated by what is indicated by the statement: ishtadda’lamru, ‘[for when the trumpet is sounded] the situation will be terrible’),\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Surely that day) i.e. the Day of Judgement (will be a day of anguish) will be a severe day,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَذَلِكَ يَوْمَئِذٍ يَوْمٌ عَسِيرٌ } معناه شَديدٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"That Day will be a hard day,\" means it will be very difficult.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَذَلِكَ } أي: وقت النقر الثاني للحشر والوقوف بين يدي الله { يَوْمَئِذٍ } أي: يوم القيامة { يَوْمٌ عَسِيرٌ } [المدثر: 9]\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فإِذا نُقِرَ في الناقور } أي: نُفخ في الصور، وهو فَاعُول من النقر، بمعنى التصويت، وأصله: القرع، الذي هو سبب الصوت، والفاء سببية، كأنه قيل: اصبر على أذاهم، فبين أيديهم يوم هائل، يلْقون فيه عاقبة أذاهم، وتلقى عاقبة صبرك، والعامل في \" إِذا \" قوله: { فذلك يومئذٍ يومٌ عسيرٌ } ، فإنَّ معناه: عسر الأمر على الكافرين إذا نُقر في الناقور، و \" ذلك \" إشارة إلى وقت النقر، وهو مبتدأ، و { يومئذ }: مرفوع المحل بدل منه، و { يوم عسير }: خبر، كأنه قيل: يوم النقر يوم عسير { على الكافرين } ، وأكّده بقوله: { غيرُ يسير } ليؤذن بأنه يَسيرٌ على المؤمنين، أو عسيرٌ لا يُرجى أن يرجع يسيراً، كما يرجى تيسير العسير من أمور الدنيا\n واختُلف في أن المراد به: يوم النفخة الأولى أو الثانية، والحق إنها الثانية إذ هي التي يختص عسرها بالكافرين، وأما النفخة الأولى، فحكمها ـ الذي هو الإصعاق ـ يعم البر والفاجر، على أنها مختصة بمَن كان حيًّا عند وقوعها، وقد جاء في الأخبار: أن في الصور ثُقْباً بعدد الأرواح، وأنها تجمع في تلك الثُقب في النفخة الثانية، فتخرج عند النفخ من كل ثقبة روح، فترجع إلى الجسد الذي نزعت منه، فيعود الجسد كما كان حيًّا، بإذن الله تعالى\n الإشارة: يا أيها المتدثر بالعلوم والأسرار والمعارف قُم فأنذر الناسَ، والخطاب للداعي الأكبر صلى الله عليه وسلم، ويتوجه لخليفته في كل زمان، وهو مَن وجَّهه الله لتذكير العباد ليحيي به الدين في أول كل عصر، كما في الأثر\n قال الورتجبي: يا أيها المدثر، أي: يا أيها الغريق في قَلزوم القِدم، قُم لدعوى محبتي، وأنذر أحبائي عن الاشتغال بغيري، وأَظْهِر جواهر حقائب بحر غيبي للمقبلين إلينا\n ثم قال على قوله: وربك فَكَبِّر، عن الحُسيْن: عَظِّم قدره عن احتياجه إليك في الدعوة إليه، فإنَّ إجابة دعوتك ممن سبقت له الهداية مني\n هـ\n قال القشيري: كبِّر ربك عن احتياجه إلى تكبير أحد، فإنَّ كبرياءه ذاتيٌّ له، قائم بنفسه، لا بغيره من المكبِّرين\n هـ\n والمتبادر أنه أمَرَ الداعي بتعظيم الله وإجلاله دون غيره من سائر المنذرين، فلا تمنعه جلالة أحد من العظماء والمتكبرين عن التصدَّي لإنذاره وتذكيره\n وقوله تعالى: { وثيابك فطهِّر } أي: نَزّه ثياب إيمانك وعرفانك عن لوث الطمع في الخلق، وخصوصاً عند الدعوة، فلا تسأل عليه أجراً، ولا تؤمّل في جانبه عوضاً، فتُحرم بركة إنذارك، ويقلّ الانتفاع به\n\n\nوقال الشيخ أبو الحسن الشاذلي رضي الله عنه: رأيت النبيَّ صلى الله عليه وسلم في المنام، فقال: يا علي، طَهِّر ثيابك من الدنس، تَحْظَ بمدد الله في كل نَفَس، فقلتُ: وما ثيابي يا رسول الله؟ فقال: إنَّ الله كساك حُلة المعرفة، ثم حُلة المحبة، ثم حُلة التوحيد، ثم حُلة الإيمان، ثم حُلة الإسلام، فمَن عرف الله صَغُر لديه كل شيء، ومَن أحبّ الله هان عليه كل شيء، ومَن وحّد الله لم يشرك به شيئاً، ومَن آمن بالله أَمِن من كل شيء، ومَن أسلم لله قلّما يعصيه، وإن عصاه اعتذر إليه، وإذا اعتذر إليه قَبِل عُذره\n قال: ففهمتُ حينئذ قوله تعالى: { وثيابك فَطَهّر }\n هـ\n والرُّجز: كلُّ ما يشغل عن الله، فيُهجر اشتغالاً بالله، ولا تمنن ببذل مُهجتك على ربك، مستكثراً لذلك، فإنَّ قيمة وجودك لا تُساوي عُشر العشر من عظمة وجوده، الذي يمنحك بدلاً من وجودك الذي أعطيته، أو: ولا تمنن عليه بوجودك تطلب وجوده، فإنَّ وجوده إنما يُنال بكرمه، لا بشيء من العلل، ولربك فاصبر، أي: ولأجل الوصول إلى ربك فاصبر على مشاق السير، أو: ولربك فاصبر على إذاية الخلق في حال الدعوة\n قال الورتجبي: ولربك فاصبر في بذل وجودك في جريان تقديره، أو مع ربك، وفي ربك، حين انكشف لك أنوار أسراره، وخاصيتُكَ في النظر إلى جلاله وجماله، ولا تنزعج، فتسقط عن درجة التمكين\n وقال القاسم: ولربك فاصبر تحت القضاء والقدر\n هـ\n فإذا نُقر في الناقور: نُفخ في صور الفناء، فتندك السموات والأرض، بإظهار ما فيها من الأسرار، فتُطوى عن نظر العارف، فيفنى مَن لم يكن، ويبقى مَن لم يزل، فذلك يوم عسير على الكافرين بطريق الخصوص إذ لا تنهدم العوالم لعين البصيرة إلاَّ لمَن هدم عوائد نفسه، وخالف هواه\n وبالله التوفيق\n ثم ذكر بعض رؤساء الكفرة الذين يعسر عليهم ذلك اليوم، فقال: { ذَرْنِي وَمَنْ خَلَقْتُ وَحِيداً }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:26",
      "similarity": 0.9083349369439776
    },
    {
      "verse": "94:5",
      "similarity": 0.8101538780096519
    },
    {
      "verse": "94:6",
      "similarity": 0.8074825712275854
    },
    {
      "verse": "92:10",
      "similarity": 0.8054517135109617
    },
    {
      "verse": "2:280",
      "similarity": 0.7196620485677011
    }
  ]
}