{
  "chapter": "القيامة",
  "text": "لا تحرك به لسانك لتعجل به",
  "translations": [
    {
      "translation": "Do not move your tongue trying to hasten it.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not forestall (the revelation before its completion) by acting in haste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(O Prophet), do not stir your tongue hastily (to commit the Revelation to memory).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), do not move your tongue too quickly to recite the Quran.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O dear Prophet (Mohammed – peace and blessings be upon him), do not cause your tongue to move along with the Qur’an in order to learn it faster.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Move not your tongue concerning to make haste therewith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not move your tongue with it to make haste with it,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Move not thy tongue with it to hasten it;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Stir not thy tongue herewith to hasten it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Prophet], do not move your tongue too fast in your attempt to learn this revelation:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Move not thy tongue therewith that thou mayest hasten therewith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not move your tongue with it to hasten it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Move not thy tongue concerning the (Qur'an) to make haste therewith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Move not your tongue concerning (the Quran, O Muhammad SAW) to make haste therewith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not move your tongue with it (the Revelation) to hasten it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not wag your tongue with it, to hurry on with it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Move not your tongue with it, [O Muhammad], to hasten with recitation of the Qur'an.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[75:16] God, exalted be He, says to His Prophet: Do not move your tongue with it, with the Qur’ān, before Gabriel is through with [reciting] it, to hasten it, fearing to lose it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Stir not thy tongue) to read the Qur'an, Muhammad, (herewith to hasten it) to hasten the recitation of the Qur'an before Gabriel finishes reciting it to you. This is because the Prophet (pbuh) used to repeat whatever revelations of the Qur'an Gabriel brought down to him before the latter finished a sentence of the Qur'an, out of fear of forgetting what was revealed to him. Allah warned him against doing so.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ } قال: كان نبيُ الله صلَى الله عليهِ وعَلَى آلِهِ وسَلّمَ يقرأُ القُرآنَ فيُكثر مَخافةَ أنْ ينسى\n\n",
      "translations": [
        {
          "translation": "\nAnd the saying of Allah, {Do not move your tongue with it to hasten it} He said: The Prophet (peace and blessings of Allaah be upon him) used to read the Qur'an and be afraid that he would forget it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ لمَّا استعجل رسول الله صلى الله عليه وسلم، وبادر بالتقاط الوحي من فيّ جبريل عليه السلام، إلى حيث سبق عليه بالتلفظ خوفاً من أن ينفلت منه شيء، نهى سبحانه حبيبه صلى الله عليه وسلم عن ذلك تأديباً وإرشاداً فقال: { لاَ تُحَرِّكْ } يا أكمل الرسل { بِهِ } أي: بالقرآن { لِسَانَكَ } حين التقاطك من حامل الوحي؛ يعني: جبريل عليه السلام، قبل أن يتم وحيُّه وإلقاؤه لك { لِتَعْجَلَ بِهِ } [القيامة: 16] أي: لتأخذه على عجلة خوفاً من إفلاته عنك\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: اختلف المفسرون في وجه المناسبة في هذه الآية، فقال بعضهم: ما تضمنه من الاقتدار على حفظه وإبقائه في قلبه، بإخراجه عن كسبه وإمساكه وحفظه، فالقادر على ذلك قادر على إحياء الموتى وجمع عظامها، وتسوية بنانها\n ونَقَل الطيبي عن الإمام الفخر: أنه تعالى لمّا أخبر عن الكفار أنهم يُحبون العاجلة، وذلك قوله: { بل يُريد الإنسان لِيفجُر أَمامه } بيَّن أنَّ العَجَلة مذمومة، ولو فيما هو أهم الأمور وأصل الدين، بقوله: { لا تُحرِّكْ به لسانَك } فاعترض به، ليؤكد التوبيخ على حب العاجلة بالطريق الأولى\n هـ\n وقيل: اعترض نزولُها في وسطِ السورة قبل أن تكمل، فوُضعت في ذلك المحل، كمَن كان يسرد كتاباً ثم جاء سائل يسأل عن نازلةٍ، فيطوي الكتابَ حتى يُجيبه، ثم يرجع إلى تمام سرده\n انظر الإتقان\n يقول الحق جلّ جلاله: { لا تُحرِّكْ به } بالقرآن { لسانَكَ لِتعجَلَ به } ، وقد كان عليه الصلاة والسلام يأخذ في القراءة قبل فراغ جبريل، كراهة أن يتفلّت منه، فقيل له: لا تُحرك لسانك بقراءة الوحي، ما دام جبريل يقرأ، { لِتعجَلَ به } لتأخذه على عجلة، لئلا يتفلّت منك، ثم ضَمِنَه له بقوله: { إِنَّ علينا جَمْعَه } في صدرك، { وقرآنه } وإثبات قراءته في لسانك، فالمراد بالقرآن هنا: القراءة، وهذا كقوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:84",
      "similarity": 0.07480172307419472
    },
    {
      "verse": "14:4",
      "similarity": 0.0743510589757486
    },
    {
      "verse": "44:58",
      "similarity": 0.07360442001287264
    },
    {
      "verse": "24:24",
      "similarity": 0.07347154333438145
    },
    {
      "verse": "26:195",
      "similarity": 0.07300520583908103
    }
  ]
}