{
  "chapter": "القيامة",
  "text": "ولو القى معاذيره",
  "translations": [
    {
      "translation": "in spite of any excuses he might offer.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever the excuses he may offer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "even though he might make up excuses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "even though they make excuses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And even if he presents all the excuses he has, none will be listened to.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though he may put forth his excuses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though he puts forth his excuses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "even though he offer his excuses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Although he tender his excuses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "in spite of all the excuses he may offer.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Although he may put forth his pleas.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "though he should offer excuses [to justify his failings].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even though he were to put up his excuses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Though he may put forth his excuses (to cover his evil deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "even though he offers his excuses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even as he presents his excuses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Even if he presents his excuses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[75:15] though he should offer his excuses (ma‘ādhīr is the plural of ma‘dhira, but following a different pattern [from the usual ma‘dhira, ma‘ādhir]) that is to say, whatever excuse he offers will not be accepted from him.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Although he tender his excuses) and says: I have not done this and have not said that; it is also said that this means: every soul is aware of the faults of others, ignorant of and oblivious to its own faults.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nبحيث { وَلَوْ أَلْقَىٰ مَعَاذِيرَهُ } [القيامة: 15] أي: جميع ما يعتذر به من الأعذار الكاذبة، لم يسمع مع حضور الشهود والعدول التي هي أعضاؤه وجوارحه، بل يعامل معه بمقتضى ما يحاسب عليه، إن خيراً فخير وإن شراً فشر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n و \" بصيرة \": مبتدأ، و \" على نفسه \": خبر مقدّم، والجملة: خبر \" الإنسان \" ، { ولو أَلْقَى معاذِيرَه }: حال من الضمير في \" بصيرة \" ، أو: من مرفوع ينبأ أي: ولو جاء بكل معذرة يعتذر بها عن نفسه أي: هو بصيرة على نفسه، تشهد عليه جوارحُه، ويُعمل بشهادتها، ولو اعتذر بكل معذرة، أو يُنبأ بأعماله ولو اعتذر\n\nالخ\n والمعاذير: اسم جمع للمعذرة، كالمناكير اسم جمع للمنكَر، لا جمع لأنّ جمعها معاذِر بالقصر، وقيل: جمع \" مِعْذار \" وهو: الستر، أي: ولو أرخى ستوره\n وقيل: الجملة استئنافية، أي: لو ألقى معاذيره ما قُبلت منه، لأنَّ عليه مَن يُكذِّب عُذره، وهي جوارحه\n والله تعالى أعلم\n الإشارة: قد قرن الله تعالى قسَمَه بالنفس اللوّامة بِقسَمِه بيوم القيامة، لمشاركتها له في التعظيم، بل النفس اللوَّامة أعظم رتبة عند الله، لأنها تكون لوّامة تلوم صاحبها على القبائح، ثم تكون لهَّامة تُلهمه الخيرات والعلوم اللدنية، ثم تكون مطمئنة، حين تطمئن بشهود الحق بلا واسطة، بل تستدل بالله على غيره، فلا ترى سواه، فحينئذ ترجع إلى أصلها، وتُرجع الأشياء كلها إلى أصولها، وهو القِدَم والأبد، فيتلاشى الحادث ويبقى القديم وحده، كما كان وحده\n فالنفوس أربعة: أمّارة، ولوّامة، ولهّامة، ومطمئنة، وهي في الحقيقة نفس واحدة، تتطور وتتقلب من حال إلى حال، باعتبار التخلية والتحلية، والترقية والتردية فأصلها الروح، فلما تظلّمت سميت نفساً أمّارة ثم لوّامة، ثم لهّامة، ثم مطمئنة\n قال القشيري: أيحسب الإنسان، أي: الإنسان المحجوب بنفسه وهواه، ألَّن نجمع عِظامه أعماله الحسنة والسيئة، بلى قادرين على أن نُسَوِّي بنانه، أي: صغار أفعاله الحسنة والسيئة، بل يُريد الإنسان المحجوب لِيَفْجُرَ أمامه، بحسب الاعتقاد والنية، قبل الإتيان بالفعل، أي: يعزم على المعاصي في المستقبل قبل أن يفعل، يسأل أيَّان يوم القيامة؟ لطول أمله، ونسيان آخرته، ولو فُتحت بصيرتُه لَشَاهد القيامة في كل ساعة ولحظة، بتعاقب تجلي الإفناء والإبقاء\n فإذا بَرِقَ البصرُ: تحيّر من سطوات أشعة سبحات التجلِّي الأحدي الجمعي، وخسَف القمر أي: ستر نور قمر القلب بنور شمس الروح، وجُمع الشمس والقمر، أي: جُمع شمس الروح وقمر القلب، بالتجلِّي الأحدي الجمعي، يعني: فيغيب نور قمر الإيمان في شعاع شمس العرفان، يقول الإنسان يومئذ: أين المفر؟ من خوف الاضمحلال والاستهلاك، وليس عنده حينئذ قوة التمكين فيخاف من الاصطلام، إلى ربك يومئذ المستقر بالرسوخ والتمكين، بعد الفرار إلى الله، قال تعالى:\n\n\n\n[الذاريات:50]\n هـ\n بالمعنى\n يُنبأ الإنسانُ يومئذٍ بما قَدَّم من المجاهدة، حيث يرى ثمرتها، وما أَخَّرَ، حيث يرى شؤم تفريطه فيها، فالمشاهدة على قدر المجاهدة، فبقدر ما يُقَدِّم منها تعظم مشاهدته، وبقدر ما يُؤخِّر منها تَقِلّ\n بل الإنسان على نفسه بصيرة، يرى ما ينقص من قلبه وما يزيد فيه، ويشعر بضعفه وقوته، إن صحّت بصيرته، وطهرت سريرته، فإذا فرط في حال سيره لا يقبل عذره، ولو ألقى معاذيره\n وبالله التوفيق\n ولَمَّا كان رسولُ الله صلى الله عليه وسلم إذا نزل الوحي يتلقاه من جبريل قبل أن يقضي نزوله، فإذا قرأ عليه جبريلُ لم يفرغ من الآية حتى يقرأها النبيُّ صلى الله عليه وسلم مخافة أن يتفلّت من صدره، فنزل قوله تعالى: { لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ }\n\n",
      "translations": []
    }
  ]
}