{
  "chapter": "القيامة",
  "text": "ولا اقسم بالنفس اللوامة",
  "translations": [
    {
      "translation": "No! I swear by the self-reproaching self.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I call the reprehensive soul to witness:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and nay, I swear by the self-reproaching soul!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and by the self accusing soul (that you will certainly be resurrected).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And by oath of the soul that reproaches itself.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And nay! I swear by An-Nafs Al-Lawwamah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay! I swear by the self-accusing soul.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No! I swear by the reproachful soul.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nay, I swear by the accusing soul (that this Scripture is true).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and by the self-reproaching soul!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I swear by the self-reproaching soul.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I swear by the self-critical soul!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I do call to witness the self-reproaching spirit: (Eschew Evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I swear by the self-reproaching person (a believer).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "No! I swear by the reproachful soul!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I swear by the blaming soul.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I swear by the reproaching soul [to the certainty of resurrection].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[75:2] And, nay, I swear by the (self-)reproaching soul, the one that reproaches itself, even if it should expend great effort in being virtuous (the response to the oath has been omitted, that is to say, la-tub‘athunna, ‘you shall indeed be resurrected!’, as indicated by [what follows]):\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "710 (Nay, I swear by the accusing soul (that this Scripture is true)) and I swear by every righteous and sinful soul that will blame itself on the Day of Resurrection. As for the righteous soul, it will say: if only I did more righteous works. And as for the sinful soul, it will say: if only I abstained from committing sins. Both souls will say this upon seeing the reward and punishment awaiting each one of them respectively. It is also said that the accusing soul in question is the soul that reproaches itself; and it is also said: it is the soul that repents of its sins and reproaches itself for what it had committed; and it is also said it is the sinful, disbelieving soul.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n { وَلاَ أُقْسِمُ بِٱلنَّفْسِ ٱللَّوَّامَةِ } معناه أُقسِمُ\n واللوَّامَةُ: التي تَلومُ على الخَيرِ والشَّرِ\n\n",
      "translations": [
        {
          "translation": "\n\nI do not swear by the self-reproaching soul.\n\n\nAnd the One who is blameworthy is the one who censures (or reproaches) for good and for evil.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلاَ أُقْسِمُ } أيضاً { بِٱلنَّفْسِ ٱللَّوَّامَةِ } [القيامة: 2] أي: وكذا لا حاجة إلى القسم بظهور النفس اللوامة في عالم الكون الفساد؛ إذ كل نفس من النفوس الكائنة تعلم أن العالم ما هو إلاَّ سراب باطل وعكس زائل عاطل، لا قرار له، ولا مدار لها فيه، وتلوم دائماً نفسها عليها، إلاَّ أنها لا تتنبه على سلطنة الوحدة، ولا تتفطن بسرايتها واستيلائها على عموم ما ظهر وبطن، وغاب وشهد، حتى تصير لوَّامة، مطمئنة راضية، وراضيته مرضية، مرضيته فقيرة، وفقيرته فانية، وفانيته باقية، وليس وراء ذلك مرمى ومنتهى\n\n\n\n\nأدركنا بلطفك الخفي يا خفي الألطاف\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولا أٌقسم بالنفس اللوّامة } ، الجمهور على أنه قسم آخر، وقال الحسن: الثانية نفي، أي: أُقسم بيوم القيامة لا بالنفس اللوّامة، فيكون ذمًّا لها، وعلى أنه قسم يكون مدحاً لها، أي: أقسم بالنفس المتقية، التي تلوم صاحبها على التقصير، وإن اجتهدت في الطاعة\n أو: بالنفس المطمئنة اللائمة للنفس الأمّارة، وقيل: المراد الجنس، لِما رُوي أنه عليه السلام قال:\n\n \" مَا مِنْ نَفْسٍ بَرَّةٍ ولا فَاجِرَةٍ إِلاَّ وتلُومُ نفسها يوم القِيامَة، إنْ عَملت خَيْراً، قالت: كيف لم أزدْ؟! وإِنْ عملت شرًّا قالت: ليتني كُنتُ قصرتُ \" \n\nوذكره الثعلبي من كلام البراء: قال أبو السعود: ولا يخفى ضعفه لأنِّ هذا القدر من اللوم لا يكون مدراراً للإعظام بالإقسام، وإن صدَر عن النفس المؤمنة المحسنة، فكيف من الكافرة المندرجة تحت الجنس، وقيل: بنفس آدم عليه السلام فإنها لا تزال تتلوَّم على فعلها الذي خرجت به من الجنة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "51:54",
      "similarity": 0.786486605327638
    },
    {
      "verse": "68:30",
      "similarity": 0.7549934308581052
    },
    {
      "verse": "23:6",
      "similarity": 0.6536541115330059
    },
    {
      "verse": "70:30",
      "similarity": 0.6536541115330059
    },
    {
      "verse": "75:1",
      "similarity": 0.42568552365002044
    }
  ]
}