{
  "chapter": "القيامة",
  "text": "اليس ذلك بقدر على ان يحى الموتى",
  "translations": [
    {
      "translation": "Is He who does this not able to bring the dead to life?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cannot such as He bring the dead to life?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does He, then, not have the power to bring back the dead to life?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does He then not have the power to bring the dead back to life?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So will He, Who has done all this, not be able to revive the dead?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not so then, that He would be able to give life to the dead\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He able to give life to the dead?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, is He not able to quicken the dead?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He (Who doeth so) Able to bring the dead to life?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then is He not able to bring the dead back to life?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not That One then Able to quicken the dead?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not [someone like] that able to revive the dead?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has not He, (the same), the power to give life to the dead?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not He (Allah Who does that), Able to give life to the dead? (Yes! He is Able to do all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What, is He then unable to revive the dead?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is He not Able to revive the dead?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is not that [Creator] Able to give life to the dead?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[75:40] Is not such, a Doer of [all] these things, able to revive the dead? — the Prophet (s) would say, ‘Yes, indeed!’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Is not He (who doeth so) able to bring the dead to life) for the resurrection? Indeed, our Lord is Able to do so; He is Able to bring the dead back to life just as He did create Adam from dust'. And of the surah in which Time is mentioned, which is all Meccan and consists of 30 verses, 240 words and 1054 letters: Surah 76: Time or Man (al-Dahr , Al-lnsan) And of the surah in which Time is mentioned, which is all Meccan and consists of 30 verses, 240 words and 1054 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه موبخاً مقرعاً على وجه الاستبعاد عن كفران الإنسان، وإصراره على إنكار البعث والحشر، وإعادة الأموات أحياءً كما كان: { أَلَيْسَ ذَلِكَ } القادر المقتدر الذي قدر على خلق هذه الصور المهينة الخبيثة وتبديلها، صوّرها عجيبة بديعة، قابلة لفيضان أنواع الكمالات، لائقة للخلافة والنيابة الإلهية { بِقَادِرٍ عَلَىٰ أَن يُحْيِـيَ ٱلْمَوْتَىٰ } [القيامة: 40] مرة بعد أخرى، مع أن الإعادة أهون من الإبداء؟!\n\n\n\nبلى، لك الإعادة والإبداء أيها القادر المقتدر على خلق الأشياء، أنت تفعل ما تشاء، وتحكم ما تريد لا تُسأل عن فعلك، إنك حميد مجيد\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها الموحد المتحقق بحيطة الحق وشموله، واستقلاله في تصرفات ملكه وملكوته، وجبروته ولاهوته أن تعتقد أن قدرته الكاملة لا يعتريها كلال، ولا يعرضها فطرة ولا زوال، بل له أن يظهر ويوجد بمقتضى قدرته جميع ما ثبت وتحقق في حضرة علمه، ولوح قضائه من الصور البديعة التي لا يخطر ببالك مطلقاً، فله أن يكون ويوجد من كل ذرة عوالم ما شاء الله، وكذا يدرج العوالم الغير المحصورة في كل ذرة من ذرائر الكائنات\n\n\n\n\nوبالجملة: من وصل إلى سعة قلب الإنسان، وساحة صدره ظهر عنده أنه لا يمتنع، ولا يستحيل في جنب قدرته سبحانه وإرادته شيء من مقدوراته ومراداته مطلقاً\n\n\n\n\nفهيهات هيهات لو نظرت إلى أجزاء العالم بنظر العبرة والاستبصار، بل إلى نفسك ورقائق أعضائك وجوارحك، ودفعت الألفة والعادة عن البين، لرأيت من كل شيء وفي كل ذرة من ذرائر العالم عجائب وغرائب، لا تُعدّ ولا تُحصى\n\n\n\n\nغاية ما في الباب: إن ألفك حجبك عن هذا الإدراك، وعادتك عاقتك عن رؤية البدائع الإلهية، ولو تنوَّر بصر بصيرتك، ونظر سرك وسريرتك بكحل الاستبصار والاعتبار، لرأيت من عجائب قدرة الله، وبدائع صنعه وحكمته في كل طرفة ولمحة ما بجنبه أمر الحشر والنشر، وإعادة الأموات أحياء سهل يسير\n\n\n\n\nحققنا بحقيتك وقيوميتك يا ذا القوة المتين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}