{
  "chapter": "الانسان",
  "text": "فوقىهم الله شر ذلك اليوم ولقىهم نضرة وسرورا",
  "translations": [
    {
      "translation": "So Allah has safeguarded them from the evil of that Day and has made them meet with radiance and pure joy.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So God will protect them from the evil of that day, and grant them happiness and joy,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah shall guard them against the woe of that Day, and will procure them freshness and joy,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will certainly rescue them from the terror of that day and will meet them with joy and pleasure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah saved them from the evil of that day, and gave them freshness and joy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, Allah saved them from the evil of that Day, and gave them Nadrah (a light of beauty) and joy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore Allah win guard them from the evil of that day and cause them to meet with ease and happiness;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So God has guarded them from the evil of that day, and has procured them radiancy and gladness,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefor Allah hath warded off from them the evil of that day, and hath made them find brightness and joy;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, God will ward off from them the woes of that Day, and make them find brightness and joy,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore Allah shall preserve them from the evil of that Day, and shall cause them to meet brightness and joy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah saved them from that day’s ills and graced them with freshness [on this faces] and joy [in their hearts].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Allah will deliver them from the evil of that Day, and will shed over them a Light of Beauty and (blissful) Joy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah saved them from the evil of that Day, and gave them Nadratan (a light of beauty) and joy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah will save them from the evil of that Day and has secured for them radiance and joyfulness,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So God will protect them from the ills of that Day, and will grant them radiance and joy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So Allah will protect them from the evil of that Day and give them radiance and happiness\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[76:11] God has therefore shielded them from the evil of that day, and has granted them radiance, fairness and resplendence in their faces, and joy.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therefore Allah hath warded from them the evil of that day) the torment of that day, (and hath made them find) and has given them (brightness) bright and beautiful faces (and joy) in their hearts;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَقَّاهُمْ نَضْرَةً وَسُرُوراً } معناه نضارةٌ في الوجوهِ، وسُرورٌ في الصّدورِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أخلصوا لله، وخافوا من عذابه { فَوَقَٰهُمُ ٱللَّهُ } الحكيم الحفيظ { شَرَّ ذَلِكَ ٱلْيَومِ } أي: فرفع عنهم شره، وأبدله لهم خيراً { وَلَقَّاهُمْ } أي: لقى لهم يومهم { نَضْرَةً } طراوة وصفاء في وجوههم { وَسُرُوراً } [الإنسان: 11] وبهجة في قلوبهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فوقاهم اللهُ شَرَّ ذلك اليوم } صانهم من شدائده، لسبب خوفهم وتحفُّظهم منه، { ولَّقاهم } أي: أعطاهم بدل عبوس الفجار { نضرةً } حُسناً في الوجوه { وسُروراً } في القلب، { وجزاهم بما صبروا } بصبرهم على مشاق الطاعات، ومهاجرة المحرمات، وإيثار الغير بالعطاء في الأزمات، { جنةً } بستاناً يأكلون منه ما يشاؤون { وحَرِيراً } يلبسونه ويتزينون به\n وعن ابن عباس رضي الله عنه: أنّ الحسن والحسين ـ رضي الله عنهما ـ مَرِضا فعادهما النبيُّ صلى الله عليه وسلم في أّناس معه، فقالوا لعليّ رضي الله عنه: لو نذرت على ولدك، فنذر عليّ وفاطمةُ وجاريتهما ـ يقال لها: فِضة ـ إن برئا مما بهما أن يصوموا ثلاثة أيام، فشُفيا، فاستقرض عليّ من يهودي ثلاث أصُوع من الشعير فطحنت ـ رضي الله عنها ـ صاعاً، واختبزت خمسة أقراص على عددهم، فوضعوها بين أيديهم ليفطروا، فوقف عليهم سائل، فقال: السلام عليكم أهل بيت محمد، مسكين من مساكين المسلمين، أطعموني، أطعمكم اللهُ من موائد الجنة، فآثروه، وباتوا لم يذوقوا إلا الماء، وأصبحوا صياماً، فلما أمسوا وضعوا الطعام بين أيديهم، فوقف عليهم يتيم، فأثروه، ثم وقف عليهم في الثالثة أسير، ففعلوا مثل ذلك، فلما أصبحوا أخذ بيد الحسن والحسين، وأقبلوا إلى النبي صلى الله عليه وسلم، فلما أبصرهم وهم يرتعشون، كالفراخ من شدة الجوع، قال عليه السلام:\n\n\n\n \" ما أشد ما يسوؤني مما أرى بكم \" \n\n، وقام فانطلق معهم، فرأى فاطمة في محرابها قد التصق ظهرها ببطنها، وغارت عيناها، فساءه ذلك، فنزل جبريل عليه السلام وقال: يا محمد هنّاك الله في بيتك، فأقرأه السورة\n هكذا ذكر القصة الزمخشري وجمهور المفسرين، وأنكر ذلك الترمذي الحكيم في نوادره، وجزم بعدم صحتها لمخالفتها لأصول الشريعة، وعدم جريه على ما تقتضيه من إنفاق العفو، وكذا \" ابْدَأ بمَن تَعُولُ \" و \" كفى بالمرء إثماً أن يَضيّع مَن يقوت \" ، وغير ذلك\n هـ\n قلت: ويُجاب بأنَّ هذا من باب الأحوال، وللصحابة في الإيثار أحوال خاصة بهم لشدة يقينهم رضي الله عنهم، وقد خرج الصدّيق رضي الله عنه عن ماله مِراراً، وقال:تركت لأهلي الله ورسوله، وكذلك فعل الصحابي الذي قال لامرأته: نوِّمِي صبيانك ليتعشّى ضيف رسول الله صلى الله عليه وسلم الذي نزل فيه،\n\n[الحشر:9] الآية، وصاحب الأحوال معذور، غير أنه لا يُقتدى به في مثل تلك الحال، فإنكار الترمذي بما ذَكَر غير صحيح",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "75:22",
      "similarity": 0.8833776742030331
    },
    {
      "verse": "83:24",
      "similarity": 0.8569343341626969
    },
    {
      "verse": "113:2",
      "similarity": 0.1496284097100295
    },
    {
      "verse": "12:77",
      "similarity": 0.14853958588038826
    },
    {
      "verse": "38:62",
      "similarity": 0.14153155187567415
    }
  ]
}