{
  "chapter": "الانسان",
  "text": "قواريرا۟ من فضة قدروها تقديرا",
  "translations": [
    {
      "translation": "crystalline silver - they have measured them very exactly.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And crystal clear bottles of silver, of which they will determine the measure themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "goblets bright as crystal but made of silver, filled to exact measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also there will be crystal clear goblets of silver containing the exact measure of drink which they desire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Glass made from silver, which the servers have filled up to the measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Qawarir) Crystal-clear, made of silver. They will determine the measure thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Transparent as) glass, made of silver; they have measured them according to a measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "crystal of silver that they have measured -- very exactly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Bright as) glass but (made) of silver, which they (themselves) have measured to the measure (of their deeds).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and gleaming silver goblets which have been filled to the exact measure,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Godblets of silver, they shall have filled them to exact measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—crystal of silver— [from] which they will dispense in a precise measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Crystal-clear, made of silver: they will determine the measure thereof (according to their wishes).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Crystal-clear, made of silver. They will determine the measure thereof according to their wishes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "goblets of silver that they have precisely measured.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Crystal of silver—they measured them exactly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Clear glasses [made] from silver of which they have determined the measure.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[76:16] crystal of silver, that is, they are made of silver which is transparent like crystal — which they, that is, the ones passing around them [in service], have measured in a precise measure, according to the measure required by the one drinking it, neither more nor less, which makes for a most delightful drink.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nقَوَارِيرَ مِنْ فِضَّةٍ قَدَّرُوهَا تَقْدِيرًا (16)والقوارير : جمع قارورة ، وأصل القارورة إناء شبه كوز ، قيل : لا تسمى قارورة إلاّ إذا كانت من زجاج ، وقيل مطلقاً وهو الذي ابتدأ به صاحب «القاموس» .وسميت قارورة اشتقاقاً من القَرار وهو المكث في المكان وهذا وزن غريب .والغالب أن اسم القارورة للإِناء من الزجاج ، وقد يطلق على ما كان من زجاج وإن لم يكن إناء كما في قوله تعالى : { قَال إنه صرح ممرّد من قوارير } \\[ النمل : 44 \\] وقد فسر قوله : { قواريراً } في هذه الآية بأنها شبيهة بالقوارير في صفاء اللون والرقة حتى كأنها تشفّ عما فيها .والتنافس في رقة آنية الخمر معروف عند شاربيها قال الأعشى :تريك القذى من دونها وهي دونه ... إذا ذاقها من ذاقها يتمطقوفعل { كانت } هنا تشبيه بليغ ، والمعنى : إنها مثل القوارير في شفيفها ، وقرينة ذلك قوله : { من فضة } ، أي هي من جنس الفضة في لون القوارير لأن قوله { من فضة } حقيقة فإنه قال قبله { بآنية من فضة } .ولفظ { قواريرا } الثاني ، يجوز أن يكون تأكيداً لفظياً لنظيره لزيادة تحقيق أن لها رقة الزجاح فيكون الوقف على { قواريرا } الأول .ويجوز أن يكون تكريراً لإِفادة التصنيف فإن حسن التنسيق في آنية الشراب من مكملات رونق مجلسه ، فيكون التكرير مثل ما في قوله تعالى : { والمَلكُ صَفّاً صفّاً } \\[ الفجر : 22 \\] وقول الناس : قرأت الكتاب باباً باباً فيكون الوقف على { قواريراً } الثاني .وكتب في المصحف { قواريرا قواريرا } بألف في آخر كلتا الكلمتين التي هي علامة تنوين .وقرأ نافع والكسائي وأبو بكر عن عاصم وأبو جعفر { قواريرا } الأول والثاني منونين وتنوين الأول لمراعاة الكلمات الواقعة في الفواصل السابقة واللاحقةِ من قوله { كافوراً } \\[ الإنسان : 5 \\] إلى قوله { تقديرا } وتنوين الثاني للمزاوجة مع نظيره وهؤلاء وقفوا عليهما بالألف مثل أخواتهما وقد تقدم نظيره في قوله تعالى : { سلاسلا وأغلالاً } \\[ الإنسان : 4 \\] .وقرأ ابن كثير وخلف ورويس عن يعقوب { قوايراً } الأول بالتنوين ووقفوا عليه بالألف وهو جار على التوجيه الذي وجهنا به قراءة نافع والكسائي . وقرآ { قواريرا } الثاني بغير تنوين على الأصل ولم تراع المزاوجة ووقفا عليه بالسكون .وقرأ ابن عامر وأبو عمرو وحمزة وحفص عن عاصم بترك التنوين فيهما لمنع الصرف وعدم مراعاة الفواصل ولا المزاوجة .والقراءات روايةٌ متواترة لا يناكدها رسم المصحف فلعلّ الذين كتبوا المصاحف لم تبلغهم إلاّ قراءة أهل المدينة .وحدّث خلف عن يحيى بن آدم عن ابن إدريس قال : في المصاحف الأول ثبتَ { قواريرا } الأول بالألف والثاني بغير ألف ، يعني المصاحف التي في الكوفة فإن عبد الله ابن إدريس كوفي .وقال أبو عبيد : لرأيتُ في مصحف عثمان { قواريرا } الأول بالألف وكان الثاني مكتوباً بالألف فحُكَّت فرأيتُ أثرها هناك بيناً اه . وهذا كلام لا يفيد إذ لو صحّ لما كان يُعرف من الذي كتَبه بالألف ، ولا مَن الذي مَحا الألف ولا متى كان ذلك فيما بين زمن كتابة المصاحف وزمن أبي عبيد ، ولا يُدرى ماذا عنى بمصحف عثمان أهو مصحفه الذي اختص به أم هو مصحف من المصاحف التي نسخت في خلافته ووزعها على الأمصار؟ .وقرأ يعقوب بغير تنوين فيهما في الوصل .وأما في الوقف فحمزة وقف عليهما بدون ألف . وهشام عن ابن عامر وقفا عليهما بالألف على أنه صلة للفتحة ، أي إشباع للفتحة ووقف أبو عمرو وحفص وابن ذكوان عن ابن عامر ورويس عن يعقوب على الأول بالألف وعلى الثاني بدون ألف ووجهه ما وجهت به قراءة ابن كثير وخلف .وقوله : { قدّروها تقديراً } يجوز أن يكون ضمير الجمع عائداً إلى { الأبرار } \\[ الإنسان : 5 \\] أو { عباد الله } \\[ الإنسان : 6 \\] الذي عادت إليه الضمائر المتقدمة من قوله { يفجرونها } \\[ الإنسان : 6 \\] و { يوفون } \\[ الإنسان : 7 \\] إلى آخر الضمائر فيكون معنى التقدير رغبتَهم أن تجيء على وفق ما يشتهون .ويجوز أن يكون الضمير عائداً إلى نائب الفاعل المحذوف المفهوم من بناء { يطاف } للنائب ، أي الطائفون عليهم بها قدَّروا الآنية والأكوابَ ، أي قدروا ما فيها من الشراب على حسب ما يطلبه كل شارب منهم ومآله إلى معنى الاحتمال الأول . وكان مما يعد في العادة من حِذق الساقي أن يعطِيَ كلَّ أحد من الشَّرْب ما يناسب رغبته .و { تقديراً } مفعول مطلق مؤكد لعامله للدلالة على وفاء التقدير وعدم تجاوزه المطلوب ولا تقصيره عنه .\n\n",
      "translations": [
        {
          "translation": "((Bright as) glass but (made) of silver, which they (themselves) have measured) in the hands of slave youths (to the measure (of their deeds)) it is also said that the drink is so measured that it is neither more nor less than what is required.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قَدَّرُوهَا تَقْدِيراً } معناه قُدِّرَتْ عَلَى قَدرِ رَيهِم لَيسَ فيها زِيادةٌ ولا نُقصانٌ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {They have valued it [the world] with an estimation}. Its meaning is that it is valued according to their estimation, there is neither increase nor decrease in it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n الآية:35] أي: في صفاء الزجاجة وضياء الكوكب فكذلك ها هنا قال: { قوارير من فضة } أي: هي في صفاء الزجاجة وشفيفها وبياض الفضة وبريقها { قدّروها تقديراً } أي: على حسب استعداداتهم ومبالغ ربهم على قدر أشواقهم وإرادتهم كما قدّروا في أنفسهم وجدوها كما قيل: لا تغيض ولا تفيض",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n لذلك { قَدَّرُوهَا تَقْدِيراً } [الإنسان: 16] بمقتضى ما راعوا في الاعتدال في الأطوار والأخلاق\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قواريرا من فِضةٍ }: بدل من الأول أي: مخلوقة من فضة قال ابن عطية: يقتضي أنها من زجاج ومن فضة وذلك ممكن لكونه من زجاج في شفوفه\n ومن فضة في جوهره\n وكذلك فضة الجنة شفافة\n هـ\n فهي جامعة لبياض الفضة وحُسنها\n وصفاء القوارير وشفيفها\n حتى يُرى ما فيها من الشراب من خارجها\n قال ابن عباس: قوارير كل أرض من تربتها\n وأرض الجنة فضة\n هـ\n و \" قوارير \" ممنوع من الصرف\n ومَن نَوّنه فلتناسب الآي المتقدّمة والمتأخّرة\n { قدَّروها تقديراً } صفة للقوارير\n يعني: أنَّ أهل الجنة قدَّروها في أنفسهم\n وتمنوها\n وأرادوا أن تكون على مقادير وأشكال معينة\n موافقة لشهواتهم\n فجاءت حسبما قدَّروها\n تكرمةً لهم\n أو: السُّقاة جعلوها على قّدْر ريّ شاربها لتكون ألذّ لهم وأخف عليهم\n وعن مجاهد: لا تُفيض ولا تَغيض\n أو: قَدَّروها بأعمالهم الصالحة\n فجاءت على حسبها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "63:7",
      "similarity": 0.5195684145110996
    },
    {
      "verse": "62:11",
      "similarity": 0.4346781348087884
    },
    {
      "verse": "76:15",
      "similarity": 0.40075384001269915
    },
    {
      "verse": "43:33",
      "similarity": 0.31446566014685423
    },
    {
      "verse": "75:12",
      "similarity": 0.2961976126822378
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/076016.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/076016.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/76:16.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}