{
  "chapter": "الانسان",
  "text": "ويطوف عليهم ولدن مخلدون اذا رايتهم حسبتهم لؤلؤا منثورا",
  "translations": [
    {
      "translation": "And boys of everlasting youth will go about attending them. Looking at them you would think that they were pearls dispersed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There boys of everlasting youth shall go about attending them: when you see them, you would think that they are scattered pearls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be served by immortal youths who look like scattered pearls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Immortal youths shall surround them, waiting upon them; when you see them, you would think they are scattered pearls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And round about them will (serve) boys of everlasting youth. If you see them, you would think them scattered pearls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And round about them shall go youths never altering in age; when you see them you will think them to be scattered pearls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Immortal youths shall go about them; when thou seest them, thou supposest them scattered pearls,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There wait on them immortal youths, whom, when thou seest, thou wouldst take for scattered pearls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be attended by youths who will not age -- when you see them you will think them to be like sprinkled pearls --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there shall go round Unto them youths ever-young. When thou seest them thou wouldst deem them pearls unstrung.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will be waited upon by immortal youths, whom, were you to see them, you will suppose them to be scattered pearls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And round about them will (serve) youths of perpetual (freshness): If thou seest them, thou wouldst think them scattered Pearls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And round about them will (serve) boys of everlasting youth. If you see them, you would think them scattered pearls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Immortal youths will go about them, when you see them, you would suppose them to be scattered pearls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Passing among them are eternalized youths. If you see them, you would think them sprinkled pearls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will circulate among them young boys made eternal. When you see them, you would think them [as beautiful as] scattered pearls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[76:19] And they will be waited upon by immortal youths, [immortally] in the form of youths, never ageing, whom, when you see them you will suppose them, because of their beauty and the way in which they are scattered about [offering] service, to be scattered pearls, [strewn] from their string, or from their shells, in which they are fairer than [when they, the pearls, are] otherwise [not in their shells].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "There wait on them youths of immortal youths) in Paradise who never die or are taken out of it; it is also said this means: youths wearing beautiful garments, (whom, when you see) Muhammad, (thou wouldst take for scattered pearls) because of their brightness; and it is also said this means: because of their scatteredness.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَيَطُوفُ عَلَيْهِمْ وِلْدَانٌ مُّخَلَّدُونَ } أي مُسورون\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَيَطُوفُ عَلَيْهِمْ } تأنيساً لهم وتصحيباً { وِلْدَانٌ } حسان، مصورون من أعمالهم وأحوالهم { مُّخَلَّدُونَ } دائمون على صباحتهم وحسنهم، بحيث { إِذَا رَأَيْتَهُمْ } إيها المعتبر الرائي { حَسِبْتَهُمْ لُؤْلُؤاً مَّنثُوراً } [الإنسان: 19] من صفاء ألوانهم، ومقبولية هيكالهم، وصباحة خدهم، ورشاقة قدَّهم، وانعكاس أشعة وجوههم من كمال اللطافة والطراوة والصفاء المفرط\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { ويطوفُ عليه ولدان } أي: غلمان ينشئهم اللهُ لخدمة المؤمنين\n أو: ولدان الكفرة يجعلهم الله تعالى خدماً لأهل الجنة\n { مخلَّدون } لا يموتون، أو: دائمون على ما هم عليه من الطراوة والبهاء، { إِذا رأيتهم حَسِبْتَهُم لؤلؤاً منثوراً } لحُسْنهم، وصفاء ألوانهم، وإشراق وجوههم، وانبثاثِهم في مجالسهم ومنازلهم\n وتخصيص المنثور لأنه أزين في المنظر من المنظوم",
      "translations": []
    }
  ]
}