{
  "chapter": "الانسان",
  "text": "متكـين فيها على الارائك لا يرون فيها شمسا ولا زمهريرا",
  "translations": [
    {
      "translation": "Reclining in it on couches, they will experience there neither burning sun nor bitter cold.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Where they will recline on couches feeling neither heat of the sun nor intense cold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There they will recline on elevated couches and will be subjected neither to the burning heat of the sun nor to bitter cold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will recline therein on couches and they will find neither excessive heat nor cold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining in it, upon thrones; they will not see the hot sunshine in it, nor the bitter cold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining therein on raised couches, they will see there neither the excessive heat, nor the excessive cold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining therein on raised couches, they shall find therein neither (the severe heat of) the sun nor intense cold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "therein they shall recline upon couches, therein they shall see neither sun nor bitter cold;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining therein upon couches, they will find there neither (heat of) a sun nor bitter cold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining upon couches, they will find therein neither the heat of the sun nor bitter, biting cold,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining therein upon couches, they shall behold therein neither sun nor hurting cold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "reclining therein on couches, without facing any [scorching] sun, or [biting] cold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining in the (Garden) on raised thrones, they will see there neither the sun's (excessive heat) nor (the moon's) excessive cold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining therein on raised thrones, they will see there neither the excessive heat of the sun, nor the excessive bitter cold, (as in Paradise there is no sun and no moon).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining there upon couches, they shall see neither the sun nor the moon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reclining therein on the thrones; experiencing therein neither sun, nor frost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[They will be] reclining therein on adorned couches. They will not see therein any [burning] sun or [freezing] cold.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[76:13] reclining (muttaki’īna is a circumstantial qualifier referring to the subject of the implicit [verb] udkhilūhā, ‘they are admitted into it’) therein upon couches (arā’ik are beds inside canopies). They will not find (lā yarawna is a second circumstantial qualifier) therein either sun or bitter cold, neither heat nor cold; but it is also said that zamharīr means ‘the moon’, and so, in other words, it [means that it] will be bright without any sun or moon.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Reclining therein) sitting comfortably in the Garden (upon couches) in curtained canopies, (they will find there neither (heat of) a sun nor bitter cold) He says: they are touched neither by the heat of the sun nor by cold.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ يَرَوْنَ فِيهَا شَمْساً وَلاَ زَمْهَرِيراً } فالشَّمسُ: الحَرُّ\n والزَّمهريرُ: البَردُ",
      "translations": [
        {
          "translation": " { They will not see therein any sun or moon } The sun: the heat\n\n\nAnd the Zemzem well: the cold.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ مُّتَّكِئِينَ فِيهَا عَلَىٰ ٱلأَرَائِكِ } يعني: مستظهرين فيها بالألطاف الإلهية، مستظلين بكنف حفظه وجواره، بحيث { لاَ يَرَوْنَ فِيهَا شَمْساً } أي: حرارتها المؤذية لهم { وَلاَ زَمْهَرِيراً } [الإنسان: 13] أي: البرودة المضرة، بل تعتدل فيها الهواء والأهواء؛ لتعديلهم الأخلاق والأعمال والأحوال\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { متكئين فيها } في الجنة، حال من \" جزاهم \" ، والعامل جزاء، { على الأرائك } على الأسِرة في الحجال، { لا يَرَون فيها شمساً ولا زمهريراً } لأنه لا شمس فيها ولا زمهرير ـ أي: بردٌ ـ فظِلها دائم وهواها معتدل، لا حرَّ شمس يحمي، ولا شدّة بردٍ يؤذي، فالزمهرير: البرد الشديد، وقيل: القمر، في لغة طيء، أي: الجنة مضيئة لا يُحتاج فيها إلى شمس ولا قمر\n وجملة النفي إمّا حال ثانية، أو: من المستكن في متكئين",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "36:56",
      "similarity": 0.3513828923052731
    },
    {
      "verse": "83:23",
      "similarity": 0.2614767232319134
    },
    {
      "verse": "83:35",
      "similarity": 0.2614767232319134
    },
    {
      "verse": "18:31",
      "similarity": 0.1972090116210177
    },
    {
      "verse": "56:16",
      "similarity": 0.12890559837359655
    }
  ]
}