{
  "chapter": "الانسان",
  "text": "نحن خلقنهم وشددنا اسرهم واذا شئنا بدلنا امثلهم تبديلا",
  "translations": [
    {
      "translation": "We created them and made their joints strong, and if We wish We can replace them with others like them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created them and fixed their bones and joints; and We could replace them when We like with others like them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created them and strengthened their joints; and whenever We wish, We can change their faces entirely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created them and have given them strength. Had We wanted, We could have replaced them with another people like them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is We Who created them, and strengthened their skeleton; and We can replace them with others like them, whenever We will.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is We Who created them, and We have made them of strong build. And when We will, We can replace them with others like them with a complete replacement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created them and made firm their make, and when We please We will bring in their place the likes of them by a change.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created them, and We strengthened their joints; and, when We will, We shall exchange their likes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We, even We, created them, and strengthened their frame. And when We will, We can replace them, bringing others like them in their stead.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It was We who created them and made their constitution strong, but if We wish we can replace them with others like them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It it We Who creared them and made them firm of make. And whenever We list, We can replace them with others like Unto them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created them and strengthened their joints, and We will replace them with others like them whenever We like.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is We Who created them, and We have made their joints strong; but, when We will, We can substitute the like of them by a complete change.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is We Who created them, and We have made them of strong built. And when We will, We can replace them with others like them with a complete replacement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created them, and We strengthened their joints, but, when We will, We shall indeed exchange their likes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created them, and strengthened their frame; and whenever We will, We can replace them with others like them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created them and strengthened their forms, and when We will, We can change their likenesses with [complete] alteration.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[76:28] We created them and made firm their frames, their limbs and their joints, and, whenever We will, We can completely replace them with others like them, in terms of their created form, in place of them, by destroying them (tabdīlan, ‘completely’, is for emphasis; idhā, ‘when’, functions in the sense of in, ‘if’, similar to [where God says in several places], in yasha’ yudhhibkum, If He will, He can take you away [cf. Q. 14:19]; but because He, exalted be He, has not willed this, it has not happened thus far).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We, even We, created them) i.e. the people of Mecca, (and strengthened their frame) and made their constitution strong. (And when We will, We can replace them, bringing others like them) i.e. We destroy them (in their stead) He says: if We had willed, We would have destroyed these sinful and disbelieving people and brought instead of them people who are better and more obedient.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { نَّحْنُ خَلَقْنَاهُمْ وَشَدَدْنَآ أَسْرَهُمْ } معناه خَلقُهُم والأَسْرُ: المَفاصِلُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"We have created them and strengthened their joints\" [Qur'an 51:47], means that He created them and the joints are the joints between their bones.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { نحن خلقناهم } بتعيين استعداداتهم { وشددنا أسرهم } قوّيناهم بالميثاق الأزلي والاتصال الحقيقي { وإذا شئنا بدّلنا أمثالهم } بأن نسلب أفعالهم بأفعالنا ونمحو صفاتهم بصفاتنا\n ونفني ذواتهم بذواتنا فيكون أبدالاً",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { نَّحْنُ } بمقتضى قدرتنا { خَلَقْنَاهُمْ } وقدرنا وجودهم أولاً من أهون الأشياء\n وأخسها وأرذلها { وَشَدَدْنَآ أَسْرَهُمْ } أي: عدلنا أركانهم وجوارحهم\n وأحكمنا مفاصلهم وأوصالهم\n وبالجملة: سويناهم أشخاصاً قوابل للتكليف\n ليترتب عليهم الإيمان والتصديق بجميع المعتقدات الدينية { وَ } بعدما لم يؤمنوا\n ولم يصدقوا عناداً وكابرةً { إِذَا شِئْنَا } وعلق مشيئتنا على إهلاكهم واستئصالهم أهلكناهم واستأصلناهم\n و { بَدَّلْنَآ أَمْثَالَهُمْ } في الخلقة وجميع لوازمها { تَبْدِيلاً } [الإنسان: 28] حسناً\n بحيث يكون المبدل خيراً\n وأحسن وأكمل من المبدل منه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { نحن خلقناهم } لا غيرنا\n { وشَدَدْنا أسْرَهُم } أي: قوّينا خِلقتهم حتى صاروا أقوياء يُقال: رجل حسن الأسر: الخلق\n وفرس شديد الأسر\n أي: الخلقة\n ومنه قوله لبيد:\n\nأو: أحكمنا ربط مفاصلهم بالأعصاب\n أو: أخذنا ميثاقهم على الإقرار\n { وإِذا شئنا بدّلنا أمثالهم تبديلاً } أي: إذا شئنا إهلاكهم أهلكناهم وبدّلنا أمثالهم في الخلقة ممن يطيع ولا يعصي\n أو: بدلنا أمثالهم تبديلاً بديعاً لا ريب فيه\n وهو البعث كما ينبىء عنه كلمة إذا لدلالتها على تحقُّق القدرة وقوة الداعية",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "8:70",
      "similarity": 0.7600714998720774
    },
    {
      "verse": "76:8",
      "similarity": 0.6914337007286623
    },
    {
      "verse": "2:85",
      "similarity": 0.4649946021197037
    },
    {
      "verse": "8:67",
      "similarity": 0.3500530587099334
    },
    {
      "verse": "56:61",
      "similarity": 0.21646180104508125
    }
  ]
}