{
  "chapter": "الانسان",
  "text": "يدخل من يشاء فى رحمته والظلمين اعد لهم عذابا اليمۢا",
  "translations": [
    {
      "translation": "He admits whoever He wills into His mercy. But He has prepared a painful punishment for the wrongdoers",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He admits whosoever He will to His benevolence. But for the evil-doers He has prepared a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He admits to His Mercy whomsoever He pleases. As for the wrong-doers, He has prepared for them a grievous chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He admits to His mercy whomever He wants. For the unjust He has prepared a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He admits into His mercy, whomever He wills; and for the unjust He has kept prepared a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will admit to His mercy whom He wills and as for the wrongdoers -- He has prepared a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He makes whom He pleases to enter into His mercy; and (as for) the unjust, He has prepared for them a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For He admits into His mercy whomsoever He will; as for the evildoers, He has prepared for them a painful chastisement.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He maketh whom He will to enter His mercy, and for evil-doers hath prepared a painful doom.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He admits whoever He will into His grace and has prepared a painful punishment for the evil doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He maketh whomsoever He listeth to enter His mercy. And the wrong-doers! for them He hath gotten ready a torment afflective.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He admits whomever He wishes into His mercy, and He has prepared a painful punishment for the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will admit to His Mercy whom He will; But the wrong-doers,- for them has He prepared a grievous Penalty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will admit to His Mercy whom He will and as for the Zalimun, (polytheists, wrong-doers, etc.) He has prepared a painful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is Merciful to whom He will; but, for the harmdoers He has prepared for them a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He admits into His mercy whomever He wills. But as for the wrongdoers, He has prepared for them a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He admits whom He wills into His mercy; but the wrongdoers - He has prepared for them a painful punishment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[76:31] He admits whomever He will into His mercy, His Paradise, namely, the believers; and as for the evildoers (alzālimīna is in the accusative because of an implied verb, that is to say, a‘adda, ‘He has prepared’, as explained by [what follows]), He has prepared for them a painful chastisement — these are the disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He maketh whom He will to enter His mercy) He honours whoever deserves it with the religion of Islam, (and for evil-doers) the disbelieving idolaters (hath prepared) soon in the Hereafter (a painful doom) whose pain extends to their hearts'. And of the surah in which the Emissaries are mentioned, which is all Meccan and consists of 50 verses, 181 words and 816 letters: Surah 77: The Emissaries (al-Mursalat) 717 And of the surah in which the Emissaries are mentioned, which is all Meccan and consists of 50 verses, 181 words and 816 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يُدْخِلُ } بمقتضى هدايته ولطفه { مَن يَشَآءُ فِي رَحْمَتِهِ } التي هي سبعة وحدته { وَ } لكن { ٱلظَّالِمِينَ } الخارجين عن مقتضى الحدود الإلهية، المحرومين عن نظر العناية والتوفيق مطلقاً { أَعَدَّ لَهُمْ عَذَاباً أَلِيماً } [الإنسان: 31] لا عذاب أشد منه إيلاماً، وأفزع انتقاماً، وهو حرمانهم عن ساحة عز القبول، نعوذ بك يا ذا القوة المتين\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها المريد المترصد لمشيئة الله وتيسيره - وفقك الله على ما أملك، وأعانك على إنجاحه - أن نفرغ همك، وتخلي قلبك عن الالتفات إلى الدينا معرضاً عن آمالها وأمانيها، متوجهاً إلى الآخرة وما فيها، متعرضاً لنفحات الحق، مستنشقاً من روائح روحه ورحمته، راجياً من سعة لطفه وجوده أن ييسر لك، ويوفقك في عموم أوقاتك وحالاتك على ما هو خير لك في أولاك وأخراك، ويدفع عنك شرور بشريتك، ومقتضيات بهيميتك وقواك\n\n\n\n\nوبالجملة: فاتخذه وكيلاً، وثق إليه، واجعله حسيباً وكفيلاً؛ إذ هو أعلم بما ينبغي لك منك، ويليق بحالك، فلك التفويض والتكلان، والأمر بيد الله الحكيم المستعان\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والظالمين } وهم الذين صرفوا مشيئَتهم إلى خلاف ما ذكر { أعدَّ لهم عذاباً أليماً } متناهياً في الإيلام، و \" الظالمين \" منصوب بمضمر يُفسره معنى ما بعده، أي: أهان الظالمين أعدّ لهم عذاباً أليماً\n الإشارة: إنّا أنزلنا عليك أيها الخليفة القرآن، أي: الجمع على ربك في قلبك وسرك تنزيلاً مترتباً شيئاً فشيئاً على حسب التهذيب والتدريب، فاصبرْ لحُكم ربك، أي: ما حَكَم به عليك من قهرية الجلال، وارتكاب الأهوال، ومقاسات الأحوال، فإنَّ العاقبةَ شهودُ الكبير المتعالي، وبذلُ المُهج والأرواح قليل في حقه، ولا تُطع في حال سيرك آثماً يريد أن يميلك عن قصد السبيل، أو كفوراً بطريق الخصوص يريد أن يصرفك عنها، واذكر اسم ربك، أي: استغرق أنفاسك في ذكر اسمه الأعظم، وهو الاسم المفرد الله الله، فتكثر منه بكرة وأصيلاً، وآناء الليل والنهار ومن الليل فاسجدْ له وسبَّحه ليلاً طويلاً، أي: ومن أجل ليل القطيعة اخضع وتضرَّع وسَبِّح في الأسحار، خوفاً من أن يقطعك عنه، فيظلم عليك ليل وجودك، فتحجب به عن ربك إنَّ هؤلاء المحجوبين بوجودهم وحظوظِ نفوسهم، يُحبون العاجلة، فيؤثرون هواهم على محبة مولاهم، ويذرون وراءهم يوماً ثقيلاً، يوم يُساق أهل التخفيف من المريدين إلى مقعد صدق زُمراً، ويتخلّف أهل النفوس في موقف الحساب\n إنَّ هذه تذكرة لمَن فتحت بصيرته وأبصر الحق وأهله، فمَن شاء اتخذ إلى ربه سبيلاً، بإيثار صحبته أهل الحق والتحقيق، حتى يردون به حضرة التحقُّق، لكن الأمر كله بيد الله، وما تشاؤون إلاَّ أن يشاء الله، فمَن شاء عنايته أدخله في رحمة هدايته، ومَن شاء خذلانه سلك به مسلك الضلالة، والعياذ بالله، ولا حول ولا قوة إلا بالله\n وصلّى الله على سيدنا محمد وآله وصحبه وسلّم\n\n",
      "translations": []
    }
  ]
}