{
  "chapter": "الانسان",
  "text": "انا هدينه السبيل اما شاكرا واما كفورا",
  "translations": [
    {
      "translation": "We guided him on the Way, whether he is thankful or unthankful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We surely showed him the way that he may either be grateful or deny.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We showed him the Right Path, regardless of whether he chooses to be thankful or unthankful (to his Lord).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We showed him the right path whether he would be grateful or ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed shown him the way – whether he is grateful or ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We guided him to the way, whether he be grateful or ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have shown him the way: he may be thankful or unthankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We guided him upon the way whether he be thankful or unthankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We have shown him the way, whether he be grateful or disbelieving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We showed him the way, whether he be grateful or ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We shewed him the way; then he becometh either thankful or ingrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We have guided him to the way, be he grateful or ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We showed him the Way: whether he be grateful or ungrateful (rests on his will).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We showed him the way, whether he be grateful or ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have guided him to the path, he is either grateful or ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We guided him to the way, be he appreciative or unappreciative.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We guided him to the way, be he grateful or be he ungrateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[76:3] Verily We have guided him to the way, We have pointed out to him the path of guidance by sending messengers [to mankind], whether he be grateful, that is to say, [whether he be] a believer, or ungrateful (both [shākiran and kafūran] are circumstantial qualifiers referring to the direct object; in other words, We have pointed out to him in both presupposed states, whether his gratefulness or his unthankfulness; immā is used to list the ‘states’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! We have shown him the way) of faith and disbelief, good and evil, (whether he be grateful) accepting faith (or disbelieving) it is also said this means: We have shown him the way to be either grateful or ungrateful.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّا هَدَيْنَاهُ ٱلسَّبِيلَ } معناه بَيّنا لَهُ سُبلَ الخَيرِ والشَّرِ\n فمنهم شَاكرٌ لِنعمِ الله تعالى ومنهُم كَافرٌ بِهَا\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Indeed, We have shown him the way} [means that] We have made clear to him the way of good and evil.\n\n\nSome of them are grateful to Allah for His blessings, while others deny them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومع إعطاء تلك الكرامات العظيمة إياه { إِنَّا هَدَيْنَاهُ ٱلسَّبِيلَ } يعني: أودعنا فيه العقل الفطري المنشعب من العقل الكلي الذي هو حضرة علمنا\n وبواسطته هديناه إلينا سبيلاً بأن أرسلنا الرسل المنبِّهين عليه\n الموقظين له من نعاس النسيان\n المنهين له إلى ما أودعنا فيه من الوديعة\n وأيدناهم بالآيات المبيِّنة المنبِّة\n النازلة من لدنا\n والبينات الواضحة الموضحة الطريق توحيدنا\n وسبيل شهودنا\n وبعدما وضح الحق\n واتضح السبيل على الوجه الأبلغ الأكمل\n\n\nفعليه الاختيار { إِمَّا شَاكِراً } أي: إمَّا أن يكون شاكراً مشتغلاً بشكر النعم\n مواظباً على أداء حقوق الكرم\n صارفاً عنان عزمه واختياره إلى صوب الهداية والرشاد حتى يكون من أرباب العناية والسداد\n المتنعمين في جنة الرضا والتسليم { وَإِمَّا كَفُوراً } [الإنسان: 3] للنعم\n كافراً لمنعمها\n مقتفياً أثر أصحاب الغفلة والعناد\n واللدد والفساد حتى يكون من أصحاب الجحيم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { نبتليهِ } حال، أي: خلقناه مبتلين له، أي: مريدين ابتلاءه بالأمر والنهي في المستقبل، { فجعلناه سميعاً بصيراً } ليتمكن من سماع الآيات التنزيلية، ومشاهدة الآيات التكوينية، فهو كالمسبب عن الابتلاء، فلذلك عطف على الخلق بالفاء، ورتّب عليه قوله: { إِنَّا هديناه السبيلَ } بيَّنَّا له الطريق، بإنزال الآيات، ونصب الأدلة العقلية والسمعية، { إِمَّا شاكراً وإِمَّا كفوراً }: حال من مفعول { هديناه } ، أي: مكّنّاه وأقدرناه على سلوك الطريق الموصل إلى البُغية، في حالتي الشكر والكفر، أي: إن شكر أو كفر فقد هديناه السبيل في الحالين، فإن شكر نفع نفسه، وإن كفر رجع وبال كفره عليه، أو: حال من \" السبيل \" ، أي: عرفناه السبيل، إمّا سبيلاً شاكراً، وإمّا سبيلاً كفوراً\n\n\nووصف السبيل بالشكر والكفر مجاز، والمراد: سالكه\n الإشارة: قد أتى على الإنسان حين من الدهر، وهو قبل وقوع التجلِّي به، لم يكن شيئاً مذكوراً، بل كان شيئاً معلوماً موجوداً في المعنى دون الحس، غير مذكور في الحس، فلمّا وقع به التجلِّي صار شيئاً مذكوراً، يذكر بالخطاب والتكليف، ويمكن أن يكون الاستفهام إنكارياً، أي: هل أتى عليه زمان لم نذكره فيه، بل لم يأتِ عليه وقت إلاَّ وكان مذكوراً لي\n ويُقال: هل غفلتُ ساعة عن حفظك؟ هل ألقيتُ ساعة حبلك على غاربك؟ هل أخليتك ساعة من رعاية جديدة، وحماية مزيدة\n هـ\n من الحاشية\n ثم بيَّن كيفية التجلِّي به فقال: { إنَّا خلقنا الإنسان } أي: بشريته { من نُطفة أمشاج } أي: من نطفة من أخلاط الأرض، فلذلك كانت تنزع إلى أصلها، وتخلد إلى أرض الحظوظ والهوى، نبتليه بذلك، ليظهر الصادق في طلب الحق بمجاهدة نفسه في إخراجها عن طبعها الأصلى، والمُعرض عن الطلب باسترساله مع طبعها البشري، ويقال: خلقته من أمشاج النطفتين فينزع طبعُ الولد إلى الإغلب منهما، فإن غَلَبَ ماء الرجل نزع إلى طبع أبيه، خيراً كان أو شرًّا، وإن غلب ماء المرأة، نزع إلى طبع أمه كذلك، ابتلاء من الله وقهرية، فلا بد أن يغلب الطبع، ولو جاهد جهده، ولذلك قال عليه ا لسلام:\n\n \" إذا سمعتم أنَّ الجبال انتقلت فصَدِّقوا، وإذا سمعتم أنَّ الطباع انتقلت فلا تُصَدِّقوا \" \n\nوفائدة الصُحبة والمجاهدة: خمود الطبع وقهر صولته، لا نزعه بكليته، فيقع الرجوع إلى الله من الطبع الدنيء، ولا يقدح في خصوصيته إن رجع إلى الله في الحين، ولذلك تلونت أحوال الأولياء بعد مجاهدتهم ورياضتهم\n والله تعالى أعلم\n فجعلناه سميعاً بصيراً، ونفخنا فيه روحاً سماوية وقدسية، تحن دائماً إلى أصلها، فمنها مَن غلبت عليه النطفةُ الطينية، فأخلدت بها إلى الأرض، فبقيت مسجونة في هيكلها، محجوبة عن ربها، ومنها: مَن غلبت روحانيتها على الطينية، فعرجت بها إلى الحضرة القدسية، حتى رجعت إلى أصلها وإلى هذا أشار بقوله: { إنا هديناه السبيل } أي: بيَّنَّا له الطريق الموصل إلى الحضرة، فصار إمّا شاكراً بسلوكها أو كافراً بالإعراض عنها، وعدم الدخول تحت تربية العارف بها\n ثم ذكر ما أعدَّ للفريقين، فقال: { إِنَّآ أَعْتَدْنَا لِلْكَافِرِينَ سَلاَسِلاَ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:93",
      "similarity": 0.7304115708643271
    },
    {
      "verse": "7:115",
      "similarity": 0.7256290152184323
    },
    {
      "verse": "20:65",
      "similarity": 0.6888735735593738
    },
    {
      "verse": "9:106",
      "similarity": 0.5596614445068507
    },
    {
      "verse": "40:77",
      "similarity": 0.5512100724363688
    }
  ]
}