{
  "chapter": "الانسان",
  "text": "انا اعتدنا للكفرين سلسلا۟ واغللا وسعيرا",
  "translations": [
    {
      "translation": "We have made ready for the kafirun shackles and chains and a Searing Blaze.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have prepared for unbelievers chains and collars and a blazing fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the unbelievers, We have kept ready chains and fetters and a Blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have prepared chains, shackles, and flaming fire (for the disbelievers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed kept prepared chains, and shackles and a blazing fire for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have prepared for the disbelievers iron chains, iron collars, and Sa`ir.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have prepared for the unbelievers chains and shackles and a burning fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have prepared for the unbelievers chains, fetters, and a Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We have prepared for disbelievers manacles and carcans and a raging fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Now,] behold, for those who deny the truth, We have prepared chains, iron collars and a blazing fire, but\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We have gotten ready for the infidels chains and collars and a Blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed for the faithless We have prepared chains, iron collars, and a blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For the Rejecters we have prepared chains, yokes, and a blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have prepared for the disbelievers iron chains, iron collars, and a blazing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, for the unbelievers We have prepared chains, fetters and a Blazing (Fire).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have prepared for the faithless chains, and yokes, and a Searing Fire.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have prepared for the disbelievers chains and shackles and a blaze.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[76:4] We have assuredly prepared for the disbelievers chains, with which they are dragged through the Fire, and fetters, around their necks to which the chains will be attached, and a hell-fire, a fire set ablaze, burning fiercely, in which they shall be chastised.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإِنَّا أَعْتَدْنَا لِلْكَافِرِينَ سَلَاسِلَ وَأَغْلَالًا وَسَعِيرًا (4)أريد التخلص إلى جزاء الفريقين الشاكر والكفور .والجملة مُستأنفة استئنافاً بيانياً لأن قوله : { إمّا شاكراً وإمّا كفوراً } \\[ الإنسان : 3 \\] يثير تطلع السامعين إلى معرفة آثار هذين الحالين المترددِ حالُه بينَهما ، فابتدىء بجزاء الكافر لأن ذكره أقرب .وأكد الخبر عن الوعيد بحرف التأكيد لإِدخال الروْع عليهم لأن المتوعِّد إذا أكَّد كلامه بمؤكِّد فقد آذن بأنه لا هوادة له في وعيده .وأصل { أعتَدْنا } أعدَدنا ، بدالين ، أي هيأنا للكافرين ، يقال : اعتدّ كما يقال : أعَدَّ ، قال تعالى : { وَأعَتدتْ لهن متّكَأً } \\[ يوسف : 31 \\] .وقد تردد أيمة اللغة في أن أصل الفعل بدالين أو بتاء ودال فلم يجزموا بأيهما الأصل لكثرة ورود فعل : أعدّ ، وفعل اعْتَدَّ في الكلام والأظهر أنهما فعلان نشآ من لغتين غير أن الاستعمال خصّ الفعل ذا التاء بعُدة الحرب فقالوا : عَتَاد الحرب ولم يقولوا عدَاد .وأما العُدة بضم العين فتقع على كل ما يعد ويهيأ ، يقال : أعد لكل حال عُدة . ويطلق العَتاد على ما يُعدّ من الأمور .والأكثر أنه إذا أريد الإِدغام جيء بالفعل الذي عينه دال وإذا وجد مقتضى فك الإِدغام لموجب مثل ضمير المتكلم جيء بالفعل الذي عينه تاء .والسلاسل : القيود المصنوعة من حَلق الحديد يقيد بها الجناة والأسرى .والأغلال : جمع غُلّ بضم الغين ، وهو حلقة كبيرة من حديد توضع في رقبة المقيَّد ، وتناط بها السلسلة قال تعالى : { إذ الأغلال في أعناقهم والسلاسل } \\[ غافر : 71 \\] فالأغلال والسلاسل توضع لهم عند سَوْقهم إلى جهنم .والسعير : النار المسعرة ، أي التي سعَّرها الموقِدون بزيادة الوَقود ليشتد التهابها فهو في الأصل وصف بمعنى اسم المفعول جعل علماً على جهنم . وقد تقدم عند قوله : { كلَّما خبَتْ زدناهم سعيراً } في سورة الإسراء ( 97 ) .وكتب سلاسلا } في المصحف الإِماممِ في جميع النسخ التي أرسلت إلى الأمصار بألف بعد اللام الثانية ولكن القراء اختلفوا في قراءته ، فنافع والكسائي وهشام عن ابن عامر وأبو بكر عن عاصم وأبو جعفر قرأوا { سَلاسلاً } منوناً في الوصل ووقفوا عليه كما يوقف على المنون المنصوب ، وإذ كان حقه أن يمنع من الصرف لأنه على صيغة منتهى الجمع تعين أن قراءته بالتنوين لمراعاة مزاوجته مع الاسمين اللذيْن بعده وهما { أغلالاً } و { سعيراً } ، والمزاوجة طريقة في فصيح الكلام ، ومنها قول النبي صلى الله عليه وسلم لنساءٍ \" ارجِعْنَ مَأزورات غير مأجورات \" فجعل «مأزورات» مهموزاً وحقه أن يكون بالواو لكنه هُمز لمزاوجة مأجورات ، وكذلك قوله في حديث سؤال الملكين الكافر «فيقال له : لاَ درَيْت ولا تلَيْت» ، وكان الأصل أن يقال : ولا تَلوت . ومنه قول ابن مُقْبِل أو القَلاَّحُ :هتَّاكُ أخْبيَةٍ وَلاَّجُ أبْوِبَةٍ ... يُخَالطُ البِرُّ منه الجِدَّ واللِّينافقوله ( أبوبة ) جمع باب وحقه أن يَقول أبواب .وهذه القراءة متينة يعضدها رسم المصحف وهي جارية على طريقة عربية فصيحة .وقرأه الباقون بدون تنوين في الوصل .واختلفوا في قراءته إذا وقفوا عليه فأكثرهم قرأه في الوقف بدون ألف فيقول { سلاسلْ } في الوقف . وقرأه أبو عمرو ورويس عن يعقوب بالألف على اعتباره منوناً في الوصل .قرأه البَزي عن ابن كثير وابنُ ذكوان عن ابن عامر وحفصٌ عن عاصم في الوقف بجواز الوجهين بالألف وبتركها .فأما الذين لم ينونوا { سلاسلا } في الوصل ووقفوا عليه بألف بعد لامه الثانية . وهما أبو عمرو ورويس عن يعقوب فمخالفة روايتهم لرسم المصحف محمولة على أن الرسم جرى على اعتبار حالة الوقف وذلك كثير فكتابة الألف بعد اللام لقصد التنبيه على إشباع الفتحة عند الوقف لمزاوجة الفواصل في الوقف لأن الفواصل كثيراً ما تعطى أحكام القوافي والأسجاع .وبعدُ فالقراءات روايات مسموعة ورسم المصحف سُنة مَخصوصة به وذكر الطيبي : أن بعض العلماء اعتذر عن اختلاف القراء في قوله : { سَلاسلا } بأنه من الاختلاف في كيفية الأداء كالمَدّ والإِمالة وتخفيف الهمزة وأن الاختلاف في ذلك لا ينافي التواتر .\n\n",
      "translations": [
        {
          "translation": "(Lo! We have prepared for disbelievers) Abu Jahl and his followers (manacles and carcans) in the Fire (and a raging fire.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّا هديناه } سبيل الحق بأدلة العقل والسمع في حالتي كونه شاكراً مهتدياً مستعملاً لنعم المشاعر والآلات والوسايط فيما ينبغي أن يستعمل من الطاعات متوصلاً بها إلى المنعم { أو كفوراً } محتجباً بالنعم عن المنعم مستعملاً لها في غير ما يحب أن يستعمل من المعاصي { إنّا أعتدنا للكافرين } المحتجبين بالنعم { سلاسل } الميول والمحبات إلى المشتهيات الجسمانية الموجبة لتقيدهم بها والحرمان عن المقاصد الحقيقية في النيران وأغلال الصور والهيئات المانعة عن الحركة في طلب المراد وسعير التعذيب في قعر الطبيعة وقهر الحرمان",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة { إِنَّآ } بمقتضى قهرنا وجلالنا { أَعْتَدْنَا } وهيَّأنا { لِلْكَافِرِينَ } الساترين بغيوم هوياتهم الباطلة شمس الحق المشرقة\n الظاهرة على صفائح ذرائر الكائنات\n لذلك خرجوا عن ربقة ربقيته\n وعروة عبوديته\n وأعرضوا عن مقتضى حدوده الموضوعة بين عباده { سَلاَسِلاَ } أي: سلاسل الحرص وطول الأمل\n يُقادون ويُسحبون بها نحو نيران الإمكان\n وجحيم الطرد والحرمان بأنواع الخيبة والخسران { وَأَغْلاَلاً } أي: أغلال الأماني والشهوات\n يُقيَّدون بها { وَسَعِيراً } [الإنسان: 4] مسعراً مملوءاً بنيران الافتقار والاحتياج\n والأماني والآمال\n يُطرحون فيها طول دهرهم بأنواع الخذلان والهوان أبداً\n ويُسجنون خالدين مخلدين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنَّا أعتدْنا } أعددنا { للكافرين سلاسلاً } يُقادون بها إلى النار { وأغلالاً } يُقيَّدون بها { وسعيراً } يُحرقون بها\n و \" سلاسل \" لا ينصرف لصيغة منتهى الجموع\n ومَن صرفه فليناسب أغلالاً\n إذ يجوز صرف غير المنصرف للتناسب\n وتقديم وعيد الكفرة مع تأخرهم في الجمع على طريق اللف والنشر المعكوس\n كقوله:\n[آل عمران:106] الآية ليتخلّص إلى الكلام على الفريق الأول بطريق الإطناب",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:71",
      "similarity": 0.716910603317952
    },
    {
      "verse": "69:32",
      "similarity": 0.536890732689563
    },
    {
      "verse": "48:13",
      "similarity": 0.3615512666562892
    },
    {
      "verse": "25:11",
      "similarity": 0.34072381732139007
    },
    {
      "verse": "67:5",
      "similarity": 0.29150900036236893
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/076004.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/076004.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/76:4.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}