{
  "chapter": "الانسان",
  "text": "ان الابرار يشربون من كاس كان مزاجها كافورا",
  "translations": [
    {
      "translation": "The truly good will drink from a cup mixed with the coolness of camphor,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the devotees will drink cups flavoured with palm blossoms\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The virtuous shall drink from a cup tempered with camphor water.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The virtuous ones will drink from a cup containing camphor\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the virtuous will drink from a cup, containing a mixture of Kafoor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, the Abrar (righteous believers) shall drink of a cup mixed with Kafur.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the righteous shall drink of a cup the admixture of which is camphor\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the pious shall drink of a cup whose mixture is camphor,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! the righteous shall drink of a cup whereof the mixture is of Kafur,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the righteous shall drink from a cup mixed with the coolness of kafur,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily the pious shall drink of a cup whereof the admixture is like Unto camphor.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed the pious will drink from a cup seasoned with Kafur,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As to the Righteous, they shall drink of a Cup (of Wine) mixed with Kafur,-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, the Abrar (pious, who fear Allah and avoid evil), shall drink a cup (of wine) mixed with water from a spring in Paradise called Kafur.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the righteous shall drink of a goblet mixed with camphor;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the righteous will drink from a cup whose mixture is aroma.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, the righteous will drink from a cup [of wine] whose mixture is of Kafur,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[76:5] Truly the righteous (abrār is the plural of barr or bārr), namely, the obedient ones, will drink from a cup (ka’s is a vessel for drinking wine and this [wine] will be in it; what is meant is [that they will drink] from ‘wine’, [a case where] the actuality is referred to by the name of the locus [in which it is found]; min, ‘from, is partitive) whose mixture, that with which it is mixed, is camphor;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Lo! the righteous) who are true in their faith and obey Allah (shall drink of a cup) shall drink wine in Paradise (whereof the mixture is of water of Kafur,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّ ٱلأَبْرَارَ يَشْرَبُونَ مِن كَأْسٍ } معناه من خَمرٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إنّ الأبرار } أي: السعداء الذين برزوا عن حجاب الآثار والأفعال واحتجبوا بحجب الصفات غير واقفين معها بل متوجهين إلى عين الذات مع البقاء في عالم الصفات وهم المتوسطون في السلوك { يشربون من كأس } محبة حسن الصفات لا صرفاً بل كان في شرابهم مزج من لذة محبة الذات وهي العين الكافورية المفيدة للذة برد اليقين وبياض النورية وتفريح القلب المحترق بحرارة الشوق وتقويته، فإن للكافور خاصية التبريد والتفريح والبياض",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ أردف سبحاه الوعيد بالوعد على مقتضى سنته المستمرة فقال: { إِنَّ ٱلأَبْرَارَ } الأخيار، البارين المبرورين ذوي الأيدي والأبصار، المستغرقين في بحار المعارف والأسرار { يَشْرَبُونَ } لدى الملك الجبار خمور الشهو والاعتبار { مِن كَأْسٍ } أي: من كؤوس ذرائر العالم المستعار؛ ولذلك { كَانَ مِزَاجُهَا } أي: ما يمزج بها ويخلط { كَافُوراً } [الإنسان: 5] هو برد اليقين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n[آل عمران:106] الآية ليتخلّص إلى الكلام على الفريق الأول بطريق الإطناب، فقال: { إِنَّ الأبرارَ } جمع بر وبار، كرب وأرباب، وشاهد وأشهاد، وهو مَن يبر خالقه، أي: يُطيعه وقيل: الأبرار هم الصادقون في الإيمان، أو: الذين لا يؤذون الذر، ولا يعمدون الشر\n { يشربون من كأس } وهو الزجاجة إذا كان فيها خمر، ويُطلق على نفس الخمر، فـ \" مِن \" على الأول ابتدائية، وعلى الثاني تبعيضية، { كان مِزاجُها } أي: ما تمزج به { كافوراً } أي: ماءٌ كافورٌ، وهو عين في الجنة، ماؤها في بياض الكافور ورائحتِه وبردِه\n وفي القاموس: الكافور: نبت طيب، نَوره كنَور الأُقحوان، وطِيب معروف، يكون من شجر بجبال بحر الهند والصين، يُظل خلقاً كثيراً، وتألفه النمور، وخشبه أبيض هش، ويوجد في أجوافه الكافور، وهو أنواع، ولونها أحمر، وإنما يبيّض بالتصعيد، والتصعيد: الإذابة\n هـ",
      "translations": []
    }
  ]
}