{
  "chapter": "الانسان",
  "text": "عينا يشرب بها عباد الله يفجرونها تفجيرا",
  "translations": [
    {
      "translation": "a spring from which Allah's slaves will drink, making it gush forth at will abundantly.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From a spring of which the votaries of God will drink and make it flow in abundance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This will be a gushing spring wherefrom Allah's servants shall drink wine, a spring from which they will take out channels wherever they wish.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "which flows from a spring from which the servants of God will drink.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Kafoor is a spring, from which the chosen bondmen of Allah will drink, causing it to flow wherever they wish inside their palaces.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A spring wherefrom the servants of Allah will drink, causing it to gush forth abundantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A fountain from which the servants of Allah shall drink; they make it to flow a (goodly) flowing forth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "a fountain whereat drink the servants of God, making it to gush forth plenteously.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A spring wherefrom the slaves of Allah drink, making it gush forth abundantly,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "a spring from which God's servants will drink, making it gush forth in branches.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From a fountain whence the bondmen of Allah will drink, causing it to gush abundantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "a spring where Allah’s servants will drink, making it gush forth as they please.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Fountain where the Devotees of Allah do drink, making it flow in unstinted abundance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A spring wherefrom the slaves of Allah will drink, causing it to gush forth abundantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "a fountain at which the worshipers of Allah drink and make it gush forth abundantly;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A spring from which the servants of God will drink, making it gush abundantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A spring of which the [righteous] servants of Allah will drink; they will make it gush forth in force [and abundance].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[76:6] a spring (‘aynan substitutes for kāfūran), containing the scent thereof, from which the servants of God, His friends, drink, making it gush forth plenteously, directing it to wherever they wish of their dwellings.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "A spring wherefrom the slaves of Allah) the friends of Allah (drink, making it gush forth abundantly) whenever they wish, from the Garden into their own habitations and palaces; it is also said that this means: they make it into a mixture;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُفَجِّرُونَهَا تَفْجِيراً } معناه يَقودُونَها حَيثُ شَاءوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n والكافور عين { يشرب بها } صرفة { عباد الله } الذين هم خاصته من أهل الوحدة الذاتية المخصوص محبتهم بعين الذات دون الصفات، لا يفرقون بين القهر واللطف والرفق والعنف والبلاء والشدة والرخاء بل تستقر محبتهم مع الأضداد وتستمر لذاتهم في النعماء والسراء والرحمة والزحمة كما قال أحدهم:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nيعني: { عَيْناً } معيناً هي ينبوع بحر الوجود { يَشْرَبُ بِهَا } ومنها { عِبَادُ ٱللَّهِ } الواصلون إلى عالم اللاهوت، والفانون في فضاء الجبروت، الباقون ببقاء حضرة الرحموت؛ لذلك { يُفَجِّرُونَهَا } ويجرونها { تَفْجِيراً } [الإنسان: 6] وإجراءً حيث شاءوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وقوله تعالى: { عيناً }: بدل من \" كافور \" ، وعن قتادة: تمزج لهم بالكافور، وتختم لهم بالمسك، وقيل: يخلق فيها رائحة الكافور وبياضه ويرده، فكأنها مزجت بالكافور، وهذا أنسب بأحوال الجنة، فـ \" عيناً \" على هذين القولين: بدل من محل من كأس على حذف مضاف، أي: يشربون خمر عين، أو: نصب على الاختصاص، وقوله تعالى: { يشرب بها عبادُ الله }: صفة لعين، أي: يشربون منها، أو: الباء زائدة، ويعضده قراءة ابن أبي عبلة: \" يشربها \" ، أو: هو محمول على المعنى، أي: يتلذذون بها، أو يروون بها، وإنما عبّر أولاً بحرف \" من \" وثانياً بحرف الباء لأنَّ الكأس مبتداً شرابهم وأول غايته، وأمّا العين فيها يمزجون شرابهم\n قاله النسفي\n وقيل: الضمير للكأس، أي: يشربون العين بتلك الكأس، { يُفجِّرُونها تفجيراً } أي: يُجْرُونَها حيث شاؤوا من منازلهم إجراءاً سهلاً، لا يمتنع عليهم، بل يجري جرياً بقوة واندفاع",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:1",
      "similarity": 0.6521718480317783
    },
    {
      "verse": "80:42",
      "similarity": 0.639183625116528
    },
    {
      "verse": "54:12",
      "similarity": 0.6199440377032702
    },
    {
      "verse": "83:28",
      "similarity": 0.5911476700077533
    },
    {
      "verse": "82:3",
      "similarity": 0.5490512427892508
    }
  ]
}