{
  "chapter": "الانسان",
  "text": "يوفون بالنذر ويخافون يوما كان شره مستطيرا",
  "translations": [
    {
      "translation": "They fulfil their vows and fear a Day whose evil will spread far and wide.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who fulfil their vows and fear the Day whose evil shall be diffused far and wide,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "These will be the ones who fulfil their vows and dread the Day whose woe shall be spread far and wide;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The servants of God fulfill their vows and are afraid of the day in which there will be widespread terror.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They fulfil their pledges, and fear a day the evil of which is widespread.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They fulfill (their) vows, and they fear a Day whose evil will be wide-spreading.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They fulfill vows and fear a day the evil of which shall be spreading far and wide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They fulfil their vows, and fear a day whose evil is upon the wing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Because) they perform the vow and fear a day whereof the evil is wide-spreading,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They keep their vows and fear a day the woe of which will spread far and wide;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They fulfill their vow and dread a Day the evil whereof shall be widespreading.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They fulfill their vows and fear a day whose ill will be widespread.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They perform (their) vows, and they fear a Day whose evil flies far and wide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (are those who) fulfill (their) vows, and they fear a Day whose evil will be wide-spreading.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "they who keep their vows and fear a Day whose evil is spread;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They fulfill their vows, and dread a Day whose ill is widespread.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They [are those who] fulfill [their] vows and fear a Day whose evil will be widespread.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[76:7] They fulfil their vows, [pledged] in obedience to God, and fear a day the evil of which will be widespread.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيُوفُونَ بِالنَّذْرِ وَيَخَافُونَ يَوْمًا كَانَ شَرُّهُ مُسْتَطِيرًا (7)اعتراض بين جملة { يَشْربون من كأس } \\[ الإنسان : 5 \\] الخ وبين جملة { ويطاف عليهم بآنية من فضة } \\[ الإنسان : 15 \\] الخ . وهذا الاعتراض استئناف بياني هو جواب عن سؤال من شأن الكلام السابق أن يثيره في نفسه السامع المغتبِط بأن ينال مثل ما نالوا من النعيم والكرامة في الآخرة . فيهتم بأن يفعل مثل ما فعلوا ، فذكر بعض أعمالهم الصالحة التي هي من آثار الإِيمان مع التعريض لهم بالاستزادة منها في الدنيا .والكلام إخبار عنهم صادر في وقت نزول هذه الآيات ، بعضُه وصف لحالهم في الآخرة وبعضه وصف لبعض حالهم في الدنيا الموجب لنوال ما نالوه في الآخرة ، فلا حاجة إلى قول الفراء : إن في الكلام إضماراً وتقديره : كانوا يُوفُون بالنذر .وليست الجملة حالاً من { الأبرار } \\[ الإنسان : 5 \\] وضميرهم لأن الحال قيد لعاملها فلو جعلت حالاً لكانت قيداً ل { يشربون } \\[ الإنسان : 5 \\] ، وليس وفاؤهم بالنذر بحاصل في وقت شربهم من خمر الجنة بل هو بما أسلفوه في الحياة الدنيا .والوفاء : أداء ما وجب على المؤدي وافياً دون نقص ولا تقصير فيه .والنذر : ما يعتزمه المرء ويعقد عليه نِيته ، قال عنترة :والنَّاذِرَيْننِ إذا لم ألْقهما دَمي ... والمراد به هنا ما عقدوا عليه عزمهم من الإِيمان والامتثال وهو ما استحقوا به صفة { الأبرار } \\[ الإنسان : 5 \\] .ويجوز أن يراد { بالنذر } ما ينذرونه من فعل الخير المتقرَّب به إلى الله ، أي ينشئون النذور بها ليوجبوها على أنفسهم .وجيء بصيغة المضارع للدلالة على تجدد وفائهم بما عقدوا عليه ضمائرهم من الإِيمان والعمل الصالح ، وذلك مشعر بأنهم يكثرون نذر الطاعات وفعل القربات ولولا ذلك لما كان الوفاء بالنذر موجباً الثناء عليهم .والتعريف في ( النذر ) تعريف الجنس فهو يعم كل نذر .وعطف على { يوفون بالنذر } قوله : { ويخافون يوماً كان شرّه مستطيراً } لأنهم لما وصفوا بالعمل بما ينذرونه أتبع ذلك بذكر حسن نيتهم وتحقق إخلاصهم في أعمالهم لأن الأعمال بالنيات فجمع لهم بهذا صحة الاعتقاد وحسن الأعمال .وخوفهم اليوم مجاز عقلي جرى في تعلق اليوم بالخوف لأنهم إنما يخافون ما يجري في ذلك اليوم من الحساب والجزاء على الأعمال السيئة بالعقاب فعلق فعل الخوْف بزمان الأشياء المخوفة .وانتصب { يوماً } على المفعول به ل { يخافون } ولا يصح نصبه على الظرفية لأن المراد بالخوف خوفهم في الدنيا من ذنوب تجر إليهم العقاب في ذلك اليوم ، وليس المراد أنهم يخافون في ذلك اليوم فإنهم في ذلك اليوم آمنون .ووُصِف اليومُ بأن له شرّاً مستطيراً وصفاً مشعراً بعلة خوفهم إياه . فالمعنى : أنهم يخافون شر ذلك اليوم فيتجنبون ما يُفضي بهم إلى شره من الأعمال المتوعد عليها بالعقاب .والشر : العذاب والجزاء بالسوء .والمستطير : هو اسم فاعل من استطار القاصر ، والسين والتاء في استطار للمبالغة وأصله طار مثل استكبر . والطيران مجازي مستعار لانتشار الشيء وامتداده تشبيهاً له بانتشار الطير في الجو ، ومنه قولهم : الفجر المستطير ، وهو الفجر الصادق الذي ينتشر ضوؤه في الأفق ويقال : استطار الحريق إذا انتشر وتلاحق .وذكر فعل { كان } للدلالة على تمكن الخبر من المخبر عنه وإلاّ فإن شر ذلك اليوم ليس واقعاً في الماضي وإنما يقع بعد مستقبل بعيد ، ويجوز أن يجعل ذلك من التعبير عن المستقبل بلفظ الماضي تنبيهاً على تحقق وقوعه .وصيغة { يخافون } دالة على تجدد خوفهم شّر ذلك اليوم على نحو قوله : { يوفون بالنذر } .\n\n",
      "translations": [
        {
          "translation": "Allah then described their traits when they were in the life of the world, saying: (Because they perform the vow) because they fulfil their pledges and oath by Allah; it is also said this means: they perform the obligations (and fear a day) and fear the torment of a day (whereof the evil) the torment (is wide spreading,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يُوفُونَ بِٱلنَّذْرِ } معناه بمَا نَذرُوا مِن طَاعةِ الله وحَقِّهِ { وَيَخَافُونَ يَوْماً كَانَ شَرُّهُ مُسْتَطِيراً } معناه فَاشٍ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {They will fulfill their vow} means, according to what they vowed of obedience to Allah and His right {And they fear a day whose evil is widespread}, meaning great.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { يوفون بالنذر } أي:الأبرار يوفون العهد الذي كان بينهم وبين الله صبيحة يوم الأزل بأنهم إذا وجدوا التمكن بالآلات والأسباب أبرزوا ما في مكامن استعداداتهم وغيوب فطرتهم من الحقائق والمعارف والعلوم والفضائل وأخرجوها إلى الفعل بالتزكية والتصفية { ويخافون } يوم تجلي صفة القهر والسخط والانتقام لكونهم وصفيين { يوماً كان شرّه } فاشياً منتشراً بالغاً أقصى المبالغ باستيلاء الهيئات المظلمة والحجب الساترة للنور من صفات النفس على القلب وهو نهاية مبالغ الشرّ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوصاروا من كمال وصولهم واتصالهم { يُوفُونَ بِٱلنَّذْرِ } ويوفرون على المنذور { وَ } كيف لا يوفون أولئك الموفقون\n مع أنهم { يَخَافُونَ يَوْماً } وأيّ يوم\n يوماً { كَانَ شَرُّهُ } شدائده وأهواله { مُسْتَطِيراً } [الإنسان: 7] طائراً منتشراً بين عموم العباد؟!\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n فكيف بما أوجبه اللهُ عليهم؟ { ويخافون يوماً كان شَرُّه } شدائده أو عذابه { مُسْتَطِيراً } منتشراً فاشياً في أقطار الأرض غاية الانتشار\n من: استطار الفجر: انتشر",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "113:2",
      "similarity": 0.4408134146738208
    },
    {
      "verse": "27:47",
      "similarity": 0.4343951111073888
    },
    {
      "verse": "17:11",
      "similarity": 0.38121220075338713
    },
    {
      "verse": "36:19",
      "similarity": 0.37021471477704615
    },
    {
      "verse": "38:62",
      "similarity": 0.36795046094124484
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/076007.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/076007.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/76:7.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}