{
  "chapter": "الانسان",
  "text": "انما نطعمكم لوجه الله لا نريد منكم جزاء ولا شكورا",
  "translations": [
    {
      "translation": "'We feed you only out of desire for the Face of Allah. We do not want any repayment from you or any thanks.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Saying): \"We feed you for the sake of God, desiring neither recompense nor thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(saying): “We feed you only for Allah's sake; we do not seek of you any recompense or thanks,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We only feed you for the sake of God and we do not want any reward or thanks from you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They say to them, “We give you food, only for the sake of Allah – we do not seek any reward or thanks from you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Saying): \"We feed you seeking Allah's Face only. We wish for no reward, nor thanks from you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We only feed you for Allah's sake; we desire from you neither reward nor thanks:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We feed you only for the Face of God; we desire no recompense from you, no thankfulness;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Saying): We feed you, for the sake of Allah only. We wish for no reward nor thanks from you;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "saying, \"We feed you for the sake of God alone, we seek neither recompense nor thanks from you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Saying: we feed you only for the sake of Allah; we desire not from you any recompense or thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[saying,] ‘We feed you only for the sake of Allah. We desire no reward from you, nor thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Saying),\"We feed you for the sake of Allah alone: no reward do we desire from you, nor thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Saying): \"We feed you seeking Allah's Countenance only. We wish for no reward, nor thanks from you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(saying): 'We feed you only desirous of the Face of Allah; we seek of you neither recompense nor thanks,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“We only feed you for the sake of God. We want from you neither compensation, nor gratitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Saying], \"We feed you only for the countenance of Allah. We wish not from you reward or gratitude.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[76:9] ‘We feed you only for the sake of God, seeking His reward. We do not desire any reward from you, nor any thanks: this contains the reason for the giving of the food. Now, do they actually say this, or is it that God knows this [to be true] of them and has thus praised them by [mentioning] it? The two are different opinions [regarding this matter].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Saying)) that is inwardly, because they did not utter this openly but Allah informed us about the genuineness of their hearts: (We feed you, for the sake of Allah only) we feed you for the sake of Allah's reward and beneficence only. (We wish for no reward) with which to pay us back (nor thanks from you) nor gratitude from you;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّمَا نُطْعِمُكُمْ لِوَجْهِ ٱللَّهِ } قال الإِمامُ زيد بن علي عليهما السلام: أما إنهُم لَم يَتكلموا بهِ\n ولكنْ عَلِمَ الله تعالى مَا في قلوبِهِم فأثنى عَلَيهم، ليرغبَ فيهِ رَاغبٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of Allah {Innama Nut'imukum Liwajhi Allahi} - Imam Zaid bin Ali said: They did not speak of it with their own mouths.\n\n\nBut Allah knows what is in their hearts, so He praised them, so that a desiring one may desire it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n نزل في حقهم على وفق ما نووا: { إِنَّمَا نُطْعِمُكُمْ } أي: ما نطعمكم أيها المحتاجون إلاَّ { لِوَجْهِ ٱللَّهِ } الكريم\n وطلباً لمرضاته\n إذ { لاَ نُرِيدُ مِنكُمْ جَزَآءً } ليصير عوضاً\n لإطعامنا لوجه الله الكريم { وَلاَ شُكُوراً } [الإنسان: 9] ما لنا من الشكر والجزاء أمر\n\n\nوكيف يتأتى منَّا طلب الشكر والجزاء\n إذ قدرتنا على إطعامكم إنما هي بإقدار الله إيانا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nثم علّلوا إطعامهم فقالوا: { إِنما نُطعمكم لوجه الله } أي: لطلب ثوابه، أو: هو بيان من الله تعالى عما في ضمائرهم من الإخلاص، لأنَّ الله تعالى عَلِمه منهم فأثنى عليهم وإن لم يقولوا شيئاً، وفيه نظر إذ لو كان كذلك لقال: \" يطعمهم \" بضمير الغيب، فالجملة على الأول محكية بقول محذوف، حال من فاعل \" يُطعمون \" أي: قائلين بلسان الحال أو المقال لإزاحة توهم المنّ المبطل للصدقة، وتوقع المكافآت المنقصة للأجر: { إنما نُطعمكم\n\n\n } الخ\n وعن الصدّيقة ـ رضي الله عنها ـ كانت تبعث بالصدقة، ثم تسأل الرسولَ ما قالوا، فإذا ذكر دعاءهم دعت لهم بمثله، ليبقى لها ثواب الصدقة خالصاً\n { لا نُريد منكم جزاءً ولا شُكوراً } أي: لا نطلب على طعامنا مكافأة هدية ولاثناءً، وهو مصدر: شكر شكراً وشُكوراً",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "51:57",
      "similarity": 0.5738020246482053
    },
    {
      "verse": "80:24",
      "similarity": 0.4393506713562245
    },
    {
      "verse": "54:35",
      "similarity": 0.4216742494105268
    },
    {
      "verse": "74:44",
      "similarity": 0.41814367779530465
    },
    {
      "verse": "44:44",
      "similarity": 0.3990002808520583
    }
  ]
}