{
  "chapter": "المرسلات",
  "text": "ويل يومئذ للمكذبين",
  "translations": [
    {
      "translation": "Alas the woe that day for those who deny!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that Day to those that give the lie to the Truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day, woe upon those who have rejected God's revelations!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ruin is for the deniers on that day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe that Day to the deniers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that day to the rejecters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe that day unto those who cry it lies!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe unto the repudiators on that day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that Day to those who reject the truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that day Unto the beliers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe to the deniers on that day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ah woe, that Day, to the Rejecters of Truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe that Day to the deniers (of the Day of Resurrection)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that Day to those who belied it!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that Day to the rejecters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe, that Day, to the deniers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[77:19] Woe to the deniers on that day! — [reiterated] for emphasis.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Woe) severe punishment (unto the repudiators) to the deniers of resurrection after death from among the people of your folk (on that day) the Day of Judgement!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nلذلك { وَيْلٌ } عظيم { يَوْمَئِذٍ لِّلْمُكَذِّبِينَ } [المرسلات: 19]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ألم نَخْلُقْكُمْ من ماءٍ مهينٍ } حقير، وهو النطفة، { فجعلناه في قرارٍ مكينٍ } أي: مقرّ يتمكّن فيه، وهو الرحم، { إِلى قَدَرٍ معلوم } إلى مقدار معلوم من الوقت، قدّره اللهُ تعالى في أزله، لا يتقدّم عليه ولا يتأخر عنه، وهو تسعة أشهر في الغالب، أو أكثر أو أقل على حسب المشيئة، { فقدّرنا } ذلك تقديراً لا يتبدل أو: فَقَدرْنا على ذلك { فَنِعْمَ القادرون } أي: المقدِّرون له نحن، أو: فنعم القادرون على أمثال ذلك، { ويل يومئذ للمُكذِّبين } لقدرتنا على ذلك، أو: على الإعادة، أو: بنعمة الفطرة من النشأة الدالة على صدق الوعيد بالبعث\n { ألم نجعل الأرضَ كِفَاتاً }\n\n\n وجامعة، والكِفَات: اسم ما يَجمع ويضم، من: كَفَتَ شعره: إذا ضمه بخرقة، كالضمام والجماع لما يَضُمّ ويجمع، أي: ألم نجعلها كفاتاً تكفت { أحياءً } كثيرة في ظهرها { وأمواتاً } غير محصورة في بطنها\n ونظر الشعبي إلى الجبانة فقال: هذه كِفَاتُ الموتى، ثم نظر إلى البيوت فقال: هذه كِفَات الأحياء\n هـ\n ولمّا كان القبر كفاتاً كالبيت قُطع مَن سَرق منه\n و \" أحياء وأمواتاً \" منصوبان بـ \" كِفاتاً \" لأنه في معنى اسم الفاعل، أي: كافتة أحياء وأمواتاً، أو: بفعل محذوف، أي: تكفت على الحال، أي: تكفتهم في حال حياتهم ومماتهم\n { وجعلنا فيها رواسيَ } ، أي: جبالاً ثوابت { شامخاتٍ } طوالاً شواهق، ووصْفُ جمع المذكر بجمع المؤنث في غير العقلاء مطرد، وتنكيرها للتفخيم، وللإشعار بأنَّ فيها ما لم يُعرف، { وأسقيانكم ماءً } بأن خلقنا فيها أنهاراً ومنابع { فُراتاً } عذباً صافياً { ويل يومئذ للمُكذِّبين } بأمثال هذه النِعم العظيمة\n الإشارة: ألم نُهلك الجبابرة الأولين، المتكبرين على الضعفاء والمساكين، ثم نُتبعهم الآخرين كذلك نفعل بالمجرمين في كل زمان، أو: ألم نُهلك الغافلين المتقدمين والمتأخرين، بموت قلوبهم وأرواحهم، بالانهماك في الشهوات، كذلك نفعل بالطغاة المتكبرين، ويل يومئذ للمكذِّبين الشاكّين في وقوع هذا الوعيد\n ألم نخلقكم من ماء مهين حقير؟ فكيف تتكبّرون وأصلكم حقير، وآخركم لحم منتن عقير؟ ولعليّ كرّم الله وجهه: ما لابن آدم والفخر، وأوله نطفة مذرة، وآخره جيفة قذرة، وهو فيما بينهما يحمل العذرة\n\n\nهـ\n هذا في الصورة البشرية وأمّا الروح السارية فيها، فأصلها عز وشرف، فمَن غلبت روحُه على بشريته، وعقله على هواه، التحق بالملائكة الكرام في الشرف والنزاهة، ومَن غلبت بشريتُه على روحانيته، وهواه على عقله، التحق بالبهائم في الخسة والدناءة\n ألم نجعل أرض البشرية جامعة للقلوب والأرواح والأحياء بالعلم والمعرفة، حين غلبت الروح والعقل على البشرية والهوى، وللنفوس والقلوب الميتة، حين غلب الهوى\n وجعلنا فيها رواسي من العقول الثابتة، لتميز بين النافع الضار، وأسقيانكم من ماء العلوم التي تحيا به القلوب والأرواح، ماءً عذباً لمَن وفّقه اللهُ لشُربه على أيدي الرجال\n ويل يومئذ للمكذِّبين بها، فإنه يعيش ظمآناً، ويموت عطشاناً، والعياذ بالله\n ثم ذكر مآل المكذّبين، فقال: { ٱنطَلِقُوۤاْ إِلَىٰ مَا كُنتُمْ بِهِ تُكَذِّبُونَ }\n\n",
      "translations": []
    }
  ]
}