{
  "chapter": "المرسلات",
  "text": "ويل يومئذ للمكذبين",
  "translations": [
    {
      "translation": "On that Day, woe to the deniers!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alas the woe that day for those who deny!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that Day to those that give the lie to the Truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day, woe would be upon those who have rejected God's revelations!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ruin is for the deniers on that day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe that Day to the deniers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that day to the rejecters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe that day unto those who cry it lies!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe unto the repudiators on that day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that Day to those who reject the truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that day Unto the beliers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe to the deniers on that day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ah woe, that Day, to the Rejecters of Truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe that Day to the deniers (of the Day of Resurrection)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that Day to those who belied it!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that Day to the rejecters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe, that Day, to the deniers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[77:49] Woe to the deniers on that day!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Woe) severe punishment (unto the repudiators) to the disbelievers in Allah, His Messenger, Scripture and the resurrection (on that day) the day of Judgement!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nلذلك يحل عليهم { وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ } [المرسلات: 49] المستهزئين مع رسل الله، الظاهرين عليهم بالإشارة والاستكبار، المتكبرين بما نزل عليهم من الكتب المبيِّنة لمعالم الدين، ومراسم التوحيد واليقين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ويل يومئذ للمكذِّبين } بأمره ونهيه\n وفيه دلالة على أنَّ الكفار مخاطبون بالفروع\n { فبأيِّ حديث بعده } أي: بعد القرآن الناطق بأحاديث الدارين، وأخبار النشأتين، على نمط بديع، ولفظ بليغ مُعجِز، مؤسس على حُجج قاطعة، وأنوار ساطعة، فإذا لم يؤمنوا به { فبأي حديثٍ بعده يؤمنون } أي: إن لم يؤمنوا بالقرآن، مع أنه آية مبصرة، ومعجزة باهرة، من بين الكتب السماوية، فبأي كتاب بعده يؤمنون؟ فينبغي للقارىء أن يقول: آمنت بالله وملائكته وكتبه ورسله واليوم الآخر\n الإشارة: إنَّ المتقين ما سوى الله في ظلال التقريب، وبرد التسليم، ونسيم الوصال، فما أطيب نسيمهم وما ألذ مشربهم، كما قال الشاعر:\n\n{ وعيون } أي: مناهل الشرب من رحيق الوجدان، وفواكه النظر، مما يشتهون، أي: وقت يشتهون، كُلوا من رزق أرواحكم وأسراركم، وهو الترقي في معاريج العرفان، وأشربوا من رحيق أذواقكم، هنيئاً بما كنتم تعملون أيام مجاهدتكم، إنَّا كذلك نجزي المحسنين المتقين علومَهم وأعمالَهم\n\n\nويل يومئذ للمكذِّبين بطريق هذا المقام الرفيع، يُقال لهم: كُلوا وتمتّعوا وانهمكوا في الشهوات أياماً قلائل، إنكم مجرمون، وسيندم المفرّط إذا حان وقت الحصاد\n وإذا قيل لهم: اخضعوا لمَن يُربيكم ويُرقيكم إلى تلك المراتب العلية المتقدمة للمتقين، لا يخضعون، فالويل لهم على تكذيبهم، فبأي حديث وأيّ طريق بعد هذا يؤمنون، وأيّ طريق يسلكون، وبأيّ كتاب يهتدون؟ إن حادوا عن طريق السلوك على أيدي الرجال، فماذا بعد الحق إلاّ الضلال\n وبالله التوفيق، وصلّى الله على سيدنا محمد وآله وصحبه، وسلّم\n\n",
      "translations": []
    }
  ]
}