{
  "chapter": "المرسلات",
  "text": "ويل يومئذ للمكذبين",
  "translations": [
    {
      "translation": "On that Day, woe to the deniers!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alas the woe that day for those who deny!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that Day to those that give the lie to the Truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day, woe would be upon those who have rejected God's revelations!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ruin is for the deniers on that day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe that Day to the deniers (of the Day of Resurrection)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that day to the rejecters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe that day unto those who cry it lies!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe unto the repudiators on that day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that Day to those who reject the truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on the day Unto the beliers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe to the deniers on that day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ah woe, that Day, to the Rejecters of Truth!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe that Day to the deniers (of the Day of Resurrection)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that Day to those who belied it!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe on that Day to the falsifiers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Woe, that Day, to the deniers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[77:40] Woe to the deniers on that day!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Woe) severe punishment (unto the repudiators) of faith and the resurrection (on that day) the Day of Judgement!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإلاَّ { وَيْلٌ يَوْمَئِذٍ لِّلْمُكَذِّبِينَ } [المرسلات: 40] حتماً؛ لأنه من أين يتأتى بينهم المكر والكيد، والحيلة والخداع مع الله في التخلص من العذاب، سيما في تلك الحالة؟!\n\n\n\nوبالجملة: سوقوا نحو النار، وطُرحوا فيها مهانين، وعُذبوا بها صاغرين خالدين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وهذا تقريع لهم على كيدهم للمؤمنين في الدنيا، وإظهار لعجزهم هناك، { ويل يومئذٍ للمكذِّبين } بهذا، حيث أظهر ألاَّ حِيلة لهم في الخلاص من العذاب\n الإشارة: انطلِقوا إلى ضد ما كنتم به تُكذِّبونن مِن رفع درجات المجتهدين المقربين وسقوط درجة البطالين، فانحطوا إلى نار البُعد والحجاب\n وتكذيبهم بذلك هو من حيث لم يعملوا بمقتضاه\n انطلقوا إلى ظل الحجاب، ذي ثلاث شُعب، تشعب عليه الحجاب، وانسدل عليه ثلاث مرات، ظِل حجاب الغفلة، وظِل حجاب الهوى، وظِل حجاب حس الكائنات\n لا ظليل ليس فيه نسيم القُرب، ولا برد الرضا والتسليم، ولا يُغني من لهب حر القطيعة والبُعد، أو حرّ التدبير والاختيار، إنها ترمي بشررٍ، مَن كان باطنه في نار القطيعة رمَى بشررها على ظاهره، فيظهر منه الغضب والقسوة والغِلظة والفظاظة\n قال القشيري: يُشير إلى ما يترتب على هذه الشُعب من الأوصاف البهيمية والسبُعية والشيطانية، وأنَّ كل صفة منها بحسب الغلظة والشدة كالقصور المرتفعة، والبروج المشيّدة، كأنه جمالات عظيمة الهيكل، طويلة الأثر صُفر من شدة قوة النارية في ذلك الشرر، وهي القوة الغضبية\n ويل يومئذ للمكذِّبين بهذه التشبيهات اللطيفة والإشعارات الظريفة، المنبئة عن الحقائق والدقائق\n هـ\n هذا يوم لا ينطقون من شدة تحيرهم، وقوة دهشهم، ولا يُؤذن لهم فيعتذرون عن بطالتهم وتقصيرهم وقلة استعدادهم لهذا اليوم\n { ويل يومئذ للمكذِّبين } قال القشيري: لأنهم أفسدوا الاستعداد، بالركون إلى الدنيا وشهواتها والميل عن الآخرة ودرجاتها\n هـ\n هذا يوم الفصل بين أهل الجد والاجتهاد، وأهل البطالة والفساد، أو بين أهل القرب والوصال، وبين أهل البُعد والانفصال، أو بين أهل الشهود والعيان وأهل الدليل والبرهان، أو: بين المقربين وعامة أهل اليمين، جمعناكم والأولين، فيقع التمييز بين الفريقين من المتقدمين والمتأخرين، فإن كان لكم كيد وحيلة ترتفعون بها إلى درجات المقربين، فكيدونن ولا قُدرة على ذلك، حيث فاتهم ذلك في الدنيا\n ويل يومئذ للمكذَّبين بهذا الفصل والتمييز\n ثم ذكر أهل الجد والتشمير، فقال: { إِنَّ ٱلْمُتَّقِينَ فِي ظِلاَلٍ وَعُيُونٍ }\n\n",
      "translations": []
    }
  ]
}