{
  "chapter": "المرسلات",
  "text": "فباى حديثۭ بعده يؤمنون",
  "translations": [
    {
      "translation": "In what other lore after this will they then believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In what discourse after this (Qur'an) will they, then, believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In which word other than the Quran will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So after this, in what matter will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then in what statement after this will they believe\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In what announcement, then, after it, will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In what discourse after this will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In what statement, after this, will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In which word then, after this, will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In what discourse, then, after it, will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So what discourse will they believe after this?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then what Message, after that, will they believe in?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then in what statement after this (the Quran) will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After this, in what discourse will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In what message, beyond this, will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then in what statement after the Qur'an will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[77:50] In what discourse, then, after this, namely, the Qur’ān, will they believe? In other words, they cannot believe in any other of God’s Scriptures after having denied this [Qur’ān], since it comprises that inimitability (i‘jāz) which none of the others do.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(In what statement) in what Scripture, (after this) after the Book of Allah, (will they believe) if they do not believe in these tidings?' And of the surah in which the Tidings are mentioned, which is all Meccan and consists of 40 verses, 130 words and 690 letters: Surah 78: The Tidings (al-Naba') And of the surah in which the Tidings are mentioned, which is all Meccan and consists of 40 verses, 130 words and 690 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما لم يؤمنوا بهذا الكتاب المبين المبيِّن لطريق الحق، ومنهج الصدق والصواب { فَبِأَيِّ حَدِيثٍ بَعْدَهُ } أي: بعد القرآن { يُؤْمِنُونَ } [المرسلات: 50] أولئك المنكرون المعاندون المسرفون؟!\n\n\n\nجعلنا الله ممن آمن به، وامتثل بما فيهن وتفطن برموزه وإشاراته بمنِّه وجوده\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها الموحد المحمدي، القاصد لسلوك طريق الهداية والتوفيق، العازم على التحقق والتمكن في مقعد صدق التوحيد والتحقيق - يسَّر الله عليك مبتغاك - أن تتمسك بحبل المتين القرآني، و تتشبث بأذيال هدايته وإرشاده، وتمتثل بما فيه من الأوامر والنواهي والأحكام الموردة فيه، وتتفطن بما رمز له، وأُشير إليه من المعارف والحقائق المصفِّية لسرك على الالتفات إلى ما سوى الحق، المعدَّة لقلبك لفيضان الكشف والشهود، فلك أن تتبتل على الله حسب استعدادك، وتتخلق بالأخلاق المحمدية التي هي القرآن\n\n\n\n\nوالتوفيق بيد الله، والهداية عنده، يهدي من يشاء إلى صراط مستقيم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}