{
  "chapter": "النبإ",
  "text": "عم يتساءلون",
  "translations": [
    {
      "translation": "About what are they asking one another?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "OF WHAT ARE they asking one another?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "About what are they asking one another?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What do they quarrel about?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What are they questioning each other about?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What are they asking about\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of what do they ask one another?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of what do they question one another?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whereof do they question one another?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What are they asking each other about?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Of what ask they?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What is it that they are questioning each other about?!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Concerning what are they disputing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What are they asking (one another)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What do they question each other about!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What are they asking one another about?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "About what are they asking one another?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[78:1] About what, about what thing, are they, the people of Quraysh, questioning one another?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said regarding the interpretation of Allah's saying (Whereof do they question one another?): He says: 'what are they-meaning the people of Quraysh- talking about?'\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قال: حدّثنا عطاء بن السائب عن أبي خالد عن زيد بن علي عليهما السلامُ في قولهِ تعالى: { عَمَّ يَتَسَآءَلُونَ عَنِ ٱلنَّبَإِ ٱلْعَظِيمِ } معناه عَنْ القُرآنِ { ٱلَّذِي هُمْ فِيهِ مُخْتَلِفُونَ } معناه مُكذبٌ لَهُ، ومُصدقٌ لَهُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ عمّ يتساءلون * عن النبأ العظيم } النبأ العظيم هو القيامة الكبرى، ولذلك قيل في أمير المؤمنين علي عليه السلام:\n\nأي: الجمع والتفصيل باعتبار الحقيقة والشريعة لكونه جامعاً لهما\n { إنّ يوم الفصل } أي: يوم يفصل بين الناس ويفرق السعداء من الأشقياء وبين كل طائفة من الفريقين باعتبار تفاوت الهيئات والصور والأخلاق والأعمال وتناسبها { كان } عند الله وفي علمه وحكمه { ميقاتاً } حدّاً معيناً ووقتاً موقتاً ينتهي الخلق إليه\n { يوم يُنفخ في الصور } باتصال الأرواح بالأجساد ورجوعها بها إلى الحياة { فتأتون أفواجاً } فرقاً مختلفة كل فرقة مع إمامهم على حسب تباين عقائدهم وأعمالهم وتوافقها\n\n\n \" وعن معاذ رضي الله عنه أنه سأل عنه رسول الله صلى الله عليه وسلم فقال: \" يا معاذ! سألت عن أمر عظيم من الأمور \" ثم أرسل عينيه وقال: \" يحشر عشرة أصناف من أمتي بعضهم على صورة القردة وبعضهم على صورة الخنازير وبعضهم منكسون أرجلهم فوق وجوههم يسحبون عليها، وبعضهم عمياً وبعضهم صمّاً بكماً وبعضهم يمضغون ألسنتهم فهي مدلاة على صدورهم يسيل القيح من أفواههم يتقذرهم أهل الجمع، وبعضهم مقطّعة أيديهم وأرجلهم، وبعضهم مصلّبون على جذوع من نار، وبعضهم أشدّ نتناً من الجيف، وبعضهم ملبسون جباباً سابغة من قطران لازقة بجلودهم\n فأما الذين على صورة القردة فالقتات من الناس، وأما الذين على صورة الخنازير فأهل السحت، وأما المنكسون على وجههم فأكلة الربا، وأما العمي فالذين يجورون في الحكم، وأما الصمّ والبكم فالمعجبون بأعمالهم، وأما الذين يمضغون ألسنتهم فالعلماء والقصّاص الذين خالف قولهم أعمالهم، وأما الذين قطعت أيديهم وأرجلهم فهم الذين يؤذون الجيران، وأما المصلّبون على جذوع من نار فالسعاة بالناس إلى السلطان، وأما الذين هم أشدّ نتناً من الجيف فالذين بتعبون الشهوات واللذات ومنعوا حق الله في أموالهم، وأما الذين يلبسوا الجباب فأهل الكبر والفخر والخيلاء \" \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ عَمَّ } يعني: عن ما، وعن أيّ شيء وأمر { يَتَسَآءَلُونَ } [النبأ: 1] ويتقاولون فيما بينهم مراءً ومجادلةً؟\n\n\n\n\n{ عَنِ ٱلنَّبَإِ ٱلْعَظِيمِ * ٱلَّذِي هُمْ فِيهِ مُخْتَلِفُونَ } [النبأ: 2-3] أي: يختلفون في قام الساعة الموعودة؛ لتنقيد أعمال العباد، والجزاء عليهم على وفقها، مع أن أمره أظهر من أن يشك فيه ويسأل عنه، ويستهزأ به، ويختلف فيه وفي وقوعه\n\n\n\n\n{ كَلاَّ } أي: من أين يتأتى لهم إنكاره والتساؤل فيه على وجه المراء، مع أنهم { سَيَعْلَمُونَ } [النبأ: 4] عن قريب، بل قربه كلمح البصر، بل هو أقرب؟!\n\n\n\n{ ثُمَّ كَلاَّ سَيَعْلَمُونَ } [النبأ: 5] حين ألم عليهم بغتة، وهم لا يشعرون\n\n\n\n\nوبالجملة: من أين يتأتى لهم إنكار يوم البعث والجزاء، هل ينكرون قدرتنا الكاملة على أمثاله؟!\n\n\n\n{ أَلَمْ نَجْعَلِ ٱلأَرْضَ مِهَٰداً } [النبأ: 6] لهم، ممهدة مبسوطة، ينتشرون عليه ويستريحون؟!\n\n\n\n{ وَ } لم نجعل { ٱلْجِبَالَ أَوْتَاداً } [النبأ: 7] عليها تقريراً لها وتثبيتاً\n\n\n\n\n{ وَخَلَقْنَاكُمْ } أي: قدَّرنا أشباحكم أيها المكلفون { أَزْوَاجاً } [النبأ: 8] أصنافاً ذكراً وأنثى؛ لتتأنسوا وتناسلوا؟!\n\n\n\n{ وَجَعَلْنَا نَوْمَكُمْ } في الليالي { سُبَاتاً } [النبأ: 9] قطعاً عن الإحساس والحركة؛ ليحصل إرخاء الأعصاب والعضلات؛ لتستريحوا، وزالت كلا القوى وفتورها فتشتد بالاستراحة، وتشتغل بأفعالها في النهار بجرأة تامة، وقوة كاملة\n\n\n\n\n{ وَجَعَلْنَا ٱلَّيلَ } لكم { لِبَاساً } [النبأ: 10] غطاءً وغشاءً تستترون فيه، وتختفون به فيما فيه الإخفاء مطلوبكم\n\n\n\n\n{ وَجَعَلْنَا ٱلنَّهَارَ مَعَاشاً } [النبأ: 11] وقتاً تطلبون فيه ما تعيشون من حوائجكم ومطعوماتكم وملبوساتكم\n\n\n\n\n{ وَبَنَيْنَا } بكمال قدرتنا، ومتانة حكمتنا { فَوْقَكُمْ سَبْعاً } سبع سماوات طباقاً { شِدَاداً } [النبأ: 12] أقوياء محكمات، مستحكمات لا يتأثرن بمر الدهور، وكر الإعصار كسائر الأبنية\n\n\n\n\n{ وَجَعَلْنَا } في خلالها { سِرَاجاً } مضيئاً متلألئ، مشتعشعاً { وَهَّاجاً } [النبأ: 13] حاراً سخيناً في غاية السخونة عند الانعكاس؛ لتنضج ما تحتاجون إليه في أمور معاشكم\n\n\n\n\n{ وَأَنزَلْنَا } أيضاً تتميماً لتربيتكم، وترتيب معيشتكم { مِنَ } السحب { ٱلْمُعْصِرَاتِ } بالرياح { مَآءً ثَجَّاجاً } [النبأ: 14] مطراً كثيراً الانصباب، متتالي القطر\n\n\n\n\n{ لِّنُخْرِجَ بِهِ } أي: بالماء { حَبّاً } تقتاتون به { وَنَبَاتاً } [النبأ: 15] تعلف به مواشيكم\n\n\n\n\n{ وَجَنَّاتٍ } متنزهات لكم وبساتين { أَلْفَافاً } [النبأ: 16] ملتفات أشجارها وثمارها من كثرتها وكثفاتها\n\n\n\n\nكل ذلك من المقدروات التي يتفطن منها العاقل المنصف على وقوع الحشر والنشر، وجميع الأمور الغيبية الموعودة في يوم الجزاء، بل جميع المقدورات الداخلة تحت قبضة القدرة الإلهية؛ إذ نسبة القدرة الكاملة الإلهية إلى هذه المقدورات وأمثالها، وإلى الأمور الموعودة فيها على السواء، والإرادة الكاملة الإلهية ترجع كلاًّ منها عند حلول ما قدَّر الله له من الوقت والأجل\n\n\n\n\nوبالجملة: من ترقى إدراكه عن مضيق الأُلف، وخرق حجب الرسوم والعادات، وخلص من ظلمات الأوهام والخيالات العائقة عن الوصول إلى وحدة الذات التي هي منيع عمم الخيرات، ومنشأ جميع الكمالات، انكشف له ولاح عنده أن أمر النشأة الأولى والأخرى وأمثالها، بل أضعافها وآلافهما في جنب القدرة الغالية الإلهية سهل يسير، لكن المحجوب المحبوس في عالم المحسوس المقيَّد بعقال العقل المبهوت، المشوب بالوهم المنحوس، والخيال المزور المنكوس، يتخيل حصر المظاهر والمجالي الإلهية بسراب عالم الطبيعة والهيولي؛ لذلك وقع فيما وقع من البلوى، وزلت نعله في سبيل القرب من المولى\n\n\n\n\nهب لنا من لدنك رحمة تنجينا من أمثال هذه المهالك، إنك أنت الوهاب\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { عَمّ يتساءلون } ، وأصله: \" عمّا \" فحذفت الألف، كما قال في الألفية:\n\nوحذفها إمّا للفرق بين الاستفهامية والموصولة، أو للتخفيف، لكثرة الاستعمال، وقُرىء بالألف على الأصل، أي: عن شيءٍ يتساءلون\n والضمير لأهل مكة، وكانوا يتساءلون عن البعث فيما بينهم، يسأل بعضُهم بعضاً، ويخوضون فيه إنكاراً واستهزاءً، وليس السؤال عن حقيقته، بل عن وقوعه، الذي هو حال من أحواله، ووصف من أوصافه، فإنَّ \" ما \" كما يُسأل بها عن الحقيقة يُسأل بها عن الصفة، فتقول: ما زيد؟ فيقال: عالم أو طبيب\n وقيل: النبأ العظيم هو القرآن، عجب من تساؤلهم واختلافهم وتجادلهم فيه\n والاستفهام للتفخيم والتهويل والتعجيب من الجدال فيه، مع وضوح حقه وإعجازه الدالّ على صدق ما جاء به، وأنه من عند الله، فكان ينبغي ألاّ يجادل فيه، ولا يتساءل عنه، بل يقطع به ولا يشك فيه، وقد قال تعالى:\n\n[صۤ:67] الآية\n وقال الورتجبي: النبأ العظيم: كلامه القديم عظيم بعظم الله القديم، لا يَنال بركته إلاّ أهل الله وخاصته\n هـ\n وقيل: كانوا يسألون المؤمنين، فالتفاعل قد يكون من واحد متعدد، كما في قولك: تراؤوا الهلال\n انظر أبا السعود",
      "translations": []
    }
  ]
}