{
  "chapter": "النبإ",
  "text": "وكل شىء احصينه كتبا",
  "translations": [
    {
      "translation": "We have recorded all things in writing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have kept account of everything in a book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And everything have We recorded in a Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "However, We have recorded everything in a book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have kept recorded everything in a Book, accounted for.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all things We have recorded in a Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have recorded everything in a book,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and everything We have numbered in a Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Everything have We recorded in a Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but We have recorded everything in a Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And everything We have recorded in a book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We have figured everything in a Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all things have We preserved on record.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And all things We have recorded in a Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and everything We have numbered in a Book.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But We have enumerated everything in writing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But all things We have enumerated in writing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[78:29] and everything, in the way of deeds, have We kept count of, have We recorded precisely, in a Book, as [individual] written records in the Preserved Tablet, in order to requite [creatures] in accordance with them, including [the record of] their denial of the Qur’ān.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Everything) regarding the works of the children of Adam (have We recorded in a Book) We wrote it down in the Guarded or Preserved Tablet.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَكُلَّ شَيْءٍ أَحْصَيْنَاهُ كِتَاباً } أي عِلماً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وكلَّ شيءٍ } من الأشياء، ومِن جملتها أعمالهم الخبيثة، { أحصيناه } أي: حفظناه وضبطناه { كِتاباً } ، مصدر مؤكد لأحصينا لأنَّ الإحصاء والكتابة من وادٍ واحد، أو: حال بمعنى مكتوب في اللوح المحفوظ أو في صحف الحفظة، والجملة اعتراض، وقولة تعالى: { فذُوقوا فلن نزيدكم إِلاَّ عذاباً } مسبب عن كفرهم بالحساب، وتكذيبهم بالآيات، أي: فذوقوا جزاء تكذيبكم والالتفات شاهد على شدّة الغضب\n\n\nروي عنه صلى الله عليه وسلم أنه قال:\n\n \" إنَّ هذه الآية أشدُّ ما في القرآن على أهل النار \"\n \n\nالإشارة: إنَّ يوم الفصل بين العمومية والخصوصية، أو تقول: بين الانتقال من مقام أهل اليمين إلى مقام المقربين، كان في علم الله ميقاتاً، أي: مؤقتاً، وهو يوم انتقاله من شهود الأكوان إلى شهود المكوِّن، أو من مقام البرهان إلى مقام العيان\n يوم يُنفخ في صور الأرواح التي سبقت لها العناية، فيُزعجها شوق مقلق أو خوف مزعج، فتأتون إلى حضرة القدس، تسيرون إليها على يد الخبير أفواجاً، وفُتحت سماء الأرواح ليقع العروج إليها من تلك الأرواح السائرة، فكانت أبواباً، وسُيرت جبال العقل حين سطوع أنوار الحقائق، فكانت سراباً، فلا يبقى من نور العقل إِلاّ ما يميز به بين الحس والمعنى، وبين الشريعة والحقيقة\n إنَّ جهنم البُعد كانت مِرصاداً، للطاغين المتكبرين عن حط رؤوسهم للخبير، الباقين مع عامة أهل اليمين، مآباً لا يبرحون عنها، لابثين فيها أحقاباً مدة عمرهم وما بعد موتهم، لا يذوقون فيها برد الرضا، ولا شراب نسيم التسليم، إلاَّ حميماً: حر التدبير والاختيار، وغساقاً: نتن حب الدنيا وهمومها، جزاءً موافقاً لميلهم إلى الحظوظ والهوى، إنهم كانوا لا يرجون حِساباً، فلم يحاسبوا نفوسهم، ولا التفتوا إلى إخلاصها، وكذّبوا بأهل الخصوصية، وهم الأولياء الدالون على الله، ثم يقال لهم: ذّوقوا وبال القطيعة، فلن نزيدكم إلاّ تعباً وحرصاً وجزعاً\nعائذاً بالله من سوء القضاء، وشماتة الأعداء\n ثم شفع بضدهم، فقال: { إِنَّ لِلْمُتَّقِينَ مَفَازاً }\n\n",
      "translations": []
    }
  ]
}