{
  "chapter": "النبإ",
  "text": "حدائق واعنبا",
  "translations": [
    {
      "translation": "Gardens and grape vines,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Orchards and vineyards,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "gardens and vineyards,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will have gardens and vineyards,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens and grapes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hada'iq and vineyards,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens and vineyards,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "gardens and vineyards\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens enclosed and vineyards,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "theirs shall be gardens and vineyards,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens enclosed and vineyards,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "gardens and vineyards,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens enclosed, and grapevines;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens and grapeyards;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and gardens and vineyards,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens and vineyards.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Gardens and grapevines\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[78:32] gardens, orchards (hadā’iqa is either a substitution for, or an explication of, mafāzan, ‘a triumph’) and vineyards (wa-a‘nāban is a supplement to mafāzan, ‘a triumph’),\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Gardens) of trees and palm-trees (enclosed and vineyards,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ حَدَآئِقَ } ذت بهجة ونضارة ونزاهة { وَأَعْنَاباً } [البنأ: 32] معروشات وغير معروشات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { إِنَّ للمتقين مفازاً } أي: فوزاً ونجاة من كل مكروه، وظفراً بكل محبوب، وهو مَفْعَلٌ من الفوز، يصلح أن يكون مصدراً ومكاناً، وهو الجنة، ثم أبدل البعض من الكل، فقال: { حدائقَ } بساتين فيها أنواع الشجر المثمر، جمع حديقة وأبدل من المفرد، لأنَّ المصدر لا يجمع بل يصلح للقليل والكثير، { وأعناباً } ، كرر لشرفه، لأنه يخرج منه أصناف مِن النِعم، { وكواعبَ } نساء نواهِد، وهي مَن لم تسقط ثديها لصغرٍ، { أتراباً } أي: لَدَاتٍ مستوياتٍ في السنّ، { وكأساً دِهاقاً } مملوءة\n { لا يسمعون فيها } في الجنة، حال من ضمير خبر \" إن \" ، { لَغْواً } باطلاً، { ولا كِذَّاباً } أي: لا يكذّب بعضهم بعضاً، وقرأ الكسائي بالتخفيف من المكاذبة، أي: لا يُكاذبه أحد، { جزاءً من ربك }: مصدر مؤكد منصوب بمعنى: إنَّ للمتقين مفازاً، فإنه في قوة أن يقال: جازى المتقين بمفاز جزاء كائناً من ربك\n والتعرُّض لعنوان الربوبية، المنبئة عن التبليغ إلى الكمال شيئاً فشيئاً مع الإضافة إلى ضميره صلى الله عليه وسلم مزيد تشريف له عليه الصلاة والسلام، { عَطاءً } أي: تفضُّلاً منه تعالى وإحساناً، إذ لا يجب عليه شيء، وهو بدل مِن \" جزاء \" ، { حِساباً } أي: مُحسِباً، أي: كافياً، على أنه مصدر أقيم مقام الوصف، أو بولغ فيه، من: أحسبه إذا كفاه حتى قال حسبي أو: على حسب أعمالهم\n { ربِّ السماواتِ والأرضِ وما بينهما } بدل من \" ربك \"  { الرحمن }: صفة له أو للأول فمَن جَرَّهما فبدل من \" ربك \"\n ومَن رفعهما فـ \" رب \" خبر متبدأ محذوف، أو متبدأ خبره \" الرحمن \" ، أو \" الرحمن \" صفة، و \" لا يملكون \" خبر، أو هما خبران، وأيًّا ما كان ففي ذكر ربوبيته تعالى للكل ورحمته الواسعة إشعار بمدار الجزاء المذكور، { لا يملكون } أي: أهل السماوات والأرض { منه خِطاباً } معذرة أو شفاعة أو غيرهما إلاَّ بإذنه، وهو استئناف مقرر لما أفادته الربوبية العامة، من غاية العظمة والكبرياء، واستقلاله تعالى بما ذكر من الجزاء والعطاء، من غير أن يكون لأحد قدرة عليه، والتنكير في للتقليل والنوعية\n قال القشيري: كيف يكون للمكوَّن المخلوق المسكين مُكْنةٌ أن يملك منه خِطاباً، أو يتنفَّسَ بدونه نفساً؟ كلاَّ، بل هو الله الواحدُ الجبّار\n ثم قال: إنما تظهر الهيبةُ على العموم لأهل الجمع في ذلك اليوم\n وأمّا الخصوص فهم أبداً بمشهدِ العز بنعت الهيبة\n هـ\n { يومَ يقومَ الرُّوحُ } جبريل عليه السلام عند الجمهور، وقيل: مَلكٌ عظيم، ما خلق الله تعالى بعد العرش أعظم منه، يكون وحده صفًّا، { والملائكةُ صفاً }: حال، أي: مصطفين { لا يتكلمون } أي: الخلائق خوفاً، { إِلاَّ مَن أّذِنَ له الرحمنُ } في الكلام أو الشفاعة، { وقال صَواباً } أي: حقًّا\n\n\nقال الطيبي عن الإمام: فإن قيل: لَمَّا أذن له الرحمن في التكلم عَلِمَ أنه حق وصواب، فما الفائدة في قوله: { وقا صواباً }؟ فالجواب من وجهين، أحدهما: أنَّ التقدير: لا ينطقون إلاَّ بعد ورود الإذن والصواب، ثم يجتهدون في ألاَّ ينطقوا إلاَّ بالحق والصواب، وهذا مبالغة في وصفهم بالطاعة\n وثانيهما: أنَّ التقدير: لا يتكلمون إلاَّ في محضر إذن الرحمن في شفاعته والمشفوع له ممن قال صواباً، وهو قول لا إله إلاّ الله\n هـ\n قلت: والمعنى: أن يُراد بالصواب: استعمال الأدب في الخطاب، بمراعاة التعظيم، كما هو شأن الكلام مع الملوك\n ثم قال تعالى: { ذلك اليومُ الحق } أي: الثابت المحقَّق لا محالة، من غير صارف يلويه، ولا عاطف يثنيه\n والإشارة إلى يوم قيامهم على الوجه المذكور، وما فيه من معنى البُعد مع قرب العهد بالمشار أليه للإيذان بعلو درجته، وبُعد منزلته في الهول والفخامة\n وهو مبتدأ، و \" اليوم \" خبره، أي: ذلك اليوم العظيم الذي يقوم الروح والملائكة مصطفين، غير قادرين على التكلم عنهم ولا عن غيرهم من الهيبة والجلال، هو اليوم الحق، { فمَن شاء اتخذ إَلى ربه مآباً } مرجعاً بالعمل الصالح\n والفاء فصيحة تفصح عن شرط محذوف، أي: إذا كان الأمر كذلك من تحقُّق اليوم المذكور لا محالة، فمَن شاء أن يتخذ إلى ربه مرجعاً، أي: إلى ثواب ربه الذي ذكر شأنه العظيم، فليفعل ذلك بالإيمان والطاعة، و \" إلى ربه \" يتعلق بـ \" مآب \" قُدّم اهتماماً وللفواصل\n { إِنَّا أنذرناكم } بما ذكر في السورة من الآيات الناطقة بالبعث وما بعده من الدواعي، أو بسائر القوارع الواردة في القرآن، أي: خوفناكم { عذاباً قريباً } هو عذاب الآخرة، وقُربه لتحقُّق وقوعه، وكل آتٍ قريب،\n\n[النازعات:46]، وعن قتادة هو قتل قريش يوم بدر ويأباه قوله تعالى: { يوم ينظر المرء ما قدمت يداه } فإنه بدل من \" عذاب \" أو ظرف لمُضمر هو صفة له، أي: عذاباً كائناً يوم ينظر المرء، أي: يُشاهد ما قدَّمه من خير وشر\n و \" ما \" موصولة، والعائد محذوف، أو استفهامية، أي: ينظر الذي قدمته يداه، أو: أي شيء قدمت يداه وقيل: المراد بالمرء: الكافر\n وقوله: { ويقول الكافرُ يا ليتني كنتُ تراباً } ، وضع الظاهرَ موضع الضمير، لزيادة الذّم، أي: يا ليتني كنتُ تراباً لم أُخلق ولم أُكلّف أو: ليتني كنت تراباً في هذا اليوم فلم أُبعث\n وقيل: يحشر اللّهُ تعالى الحيوان حتى يقتص للجماء من القرناء، ثم يرده تراباً، فيود الكافرُ أن يكون تراباً مثله، وقيل: الكافر: إبليس يرى آدم وولده وثوابهم، فيتمنى أن يكون من الشيء الذي احتقره حين قال:\n\n\n\n[الأعراف:12 و صۤ:76]\n قال الطيبي: والعموم في المرء هو الذي يساعده النظم\n ثم قال عن الإمام: فإن قلتَ: لِمَ خصّ بعد العموم قول الكافر دون المؤمن؟ قلت: دلّ قول الكافر على غاية التحسُّر، ودلّ حذف قول المؤمن على غاية التبجُّح ونهاية الفرح بما لا يَحصُره الوصف\n هـ\n قال المحشي: والظاهر أنه اقتصر على قول الكافر بعد العموم في المرء، لأنه المناسب للنذارة التي اقتضاها المقام\n هـ\n قلتُ: ولو ذكر قول المؤمن لقال: ويقول المؤمن هاؤم اقرؤوا كتابيه، تبجُّحاً وفرحاً\n والله تعالى أعلم\n الإشارة: إنَّ للمتقين الله حق تقاته مفازاً، وهو التخلُّص من رؤية الأكوان، والإفضاء إلى رؤية الشهود والعيان، وهو دخول حدائق العرفان، واقتطاف ثمار الوجدان، ونكاح أبكار الحقائق، وهنّ أتراب، لاستوائها غالباً في لذة الشهود لمَن تمكن منها\n ويشربون كأس الخمرة الأزلية، لا يسمعون في حضرة القدس لغواً ولا كِذاباً، لغاية أدبهم، جزاء من ربك على مكابدتهم في أيام سيرهم، عطاءً كافياً مغنياً من الرحمن، لا يملكون منه خِطاباً، لغاية هيبتهم، وهذا لقوم أقامهم مقام الهيبة، وثَمَّ آخرون أقامهم مقام البسط والإدلال، وهم المتمكنون في معرفته، ينبسطون معه، ويشفعون في عباده في الدارين\n قال الورتجبي: مَن كان كلامه في الدنيا من حيث الكشف والمعاينة، فهو مأذون في الدنيا والآخرة، يتكلم مع الحق على بساط الحرمة والهيبة، يُنقذ الله به الخلائق من ورطة الهلاك\n هـ\n يوم يقوم الروح، أي: جنس الروح، وهي الأرواح الصافية، التي التحقت بالملائكة، فتقوم معهم صفاً في مقام العبودية التي شرفت بها، لا يتكلمون هيبةً لمقام الحضرة، إلاَّ مَن أّذِنَ له الرحمنُ في الشفاعة، على قدر مقامه، وقال صواباً، أي: استعمل الأدب في مخاطبته فإذا استعمل الأدب شفع، ولو قصر مقامه عن عدد المشفوع فيه\n حُكي أنّ بعض الأولياء قال عند موته: يا رب شفِّعني في أهل زماني، فقال له الهاتف من قِبل الله تعالى: لم يبلغ مقامك هذا، فقال: يا رب إذا كان ذلك بعملي واجتهادي فلعَمري إنه لم يبلغ ذلك، وإذا كان ذلك بكرمك وَجُودك، فهو أعظم من ذلك، فشَفَّعه الحقُّ تعالى في الوجود\n هكذا سمعتُ الحكاية من شيخنا الفقيه العالم، سيدي \" التاودي بن سودة \" رحمه الله، فحُسن خطاب هذا الرجل بلّغه ما لم يبلغه قدره\n ذلك اليوم الحق، تحِق فيه الحقائق، وتبطل فيه الدعاوى ويفتضح أهلها، فمَن شاء اتخذ إلى ربه مآباً، يرجع به إلى ربه، وهو حُسن التوجه إليه، برفض كل ما سواه\n { إنَّا أنذرناكم عذاباً قريباً } قال القشيري: أي: عذاب الالتفات إلى النفس والدنيا والهوى، يوم ينظر المرءُ ما قدَّمت يداه من الإساءة والإحسان هـ\n ويقول الكافر الجاحد لطريق الخصوصية، حتى مات محجوباً: يا ليتني كنتُ تُراباً، تحسُّراً على ما قاته من مقام المقربين\n وبالله التوفيق\n وصلّى الله على سيدنا محمد وآله وصحبه وسلّم\n\n",
      "translations": []
    }
  ]
}