{
  "chapter": "النبإ",
  "text": "يوم يقوم الروح والملئكة صفا لا يتكلمون الا من اذن له الرحمن وقال صوابا",
  "translations": [
    {
      "translation": "On the Day when the Spirit and the angels stand in ranks, no one will speak, except for him who is authorised by the All-Merciful and says what is right.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day the Spirit takes its stand, with the angels ranged in rows. None will speak except who is permitted by Ar-Rahman and says what is right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day when the Spirit and the angels are ranged row on row. None shall speak save he whom the Merciful Lord will permit; and he too will speak what is right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day, the Spirit and the angels who stand in lines will not speak except those whom the Beneficent God has permitted, and he will speak the right words.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when Jibreel and all the angels will stand in rows; none will be able to speak except one whom the Most Gracious commands and who spoke rightly. (Prophet Mohammed – peace and blessings be upon him – will be the first to be granted permission to intercede.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day that Ar-Ruh and the angels will stand forth in rows, they will not speak except him whom Ar-Rahman allows, and he will speak what is right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day on which the spirit and the angels shall stand in ranks; they shall not speak except he whom the Beneficent Allah permits and who speaks the right thing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Upon the day when the Spirit and the angels stand in ranks they shall speak not, save him to whom the All-merciful has given leave, and who speaks aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when the angels and the Spirit stand arrayed, they speak not, saving him whom the Beneficent alloweth and who speaketh right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the Spirit and the angels stand in ranks, no one will speak, except for those to whom the Lord of Mercy gives permission, and who will say only what is right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day whereon the spirits and the angels will stand arrayed, they will not be able to speak save him whom the Compassionate giveth leave and who speaketh aright.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "on the day when the Spirit and the angels stand in an array: none shall speak except someone who is permitted by the All-beneficent and says what is rightful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day that the Spirit and the angels will stand forth in ranks, none shall speak except any who is permitted by (Allah) Most Gracious, and He will say what is right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day that Ar-Ruh [Jibrael (Gabriel) or another angel] and the angels will stand forth in rows, none shall speak except him whom the Most Beneficent (Allah) allows, and he will speak what is right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day, when the Spirit (Gabriel) and the angels stand in ranks they shall not speak, except he to whom the Merciful has given permission, and sayswhat is right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when the Spirit and the angels stand in row. They will not speak, unless it be one permitted by the Most Merciful, and he will say what is right.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day that the Spirit and the angels will stand in rows, they will not speak except for one whom the Most Merciful permits, and he will say what is correct.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[78:38] on the day (yawma is the adverbial qualifier for lā yamlikūna, ‘they will not be able to’) when the Spirit, Gabriel, or God’s hosts, and the angels stand arrayed (saffan is a circumstantial qualifier, in other words, mustaffīna). They, creatures, will not speak, except him whom the Compassionate One permits, to speak, and who says what is right, from among the believers and the angels: as if [meaning] that they will intercede for he whom He approves of.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the day when the angels and the Spirit) Gabriel; and it is also said: this is a created being whose tremendousness only Allah knows; Ibn Mas'ud also said: the Spirit is an angel greater than every thing save the Throne, and this angel glorifies Allah each day 12,000 formulas of glorification, and which each glorification he utters Allah creates an angel who seeks forgiveness for the believers until the Day of Judgement; it is also said this refers to a group of angels who have feet and hands like those of humans (stand arrayed, they speak not) to intercede, (saving him whom the Beneficent alloweth) to intercede (and who speaketh right) truly \"there is no deity save Allah\".\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَوْمَ يَقُومُ ٱلرُّوحُ وَٱلْمَلاَئِكَةُ صَفّاً } معناه مَلكٌ أَعظمُ من المَلائكةِ خَلقاً\n ويقال: الرُّوحُ: بنو آدم ويقال: هم عَلَى صُورةِ بَني آدم، وهم في السَّماءِ يأكلونَ، ولهم أيدٍ وأرجلٌ ورءوسٌ، وليسوا بملائكةِ\n\n\n\n\nوقوله تعالى: { إِلاَّ مَنْ أَذِنَ لَهُ ٱلرَّحْمَـٰنُ وَقَالَ صَوَاباً } معناه حَقٌ وشهادةُ أن لاَ إلهَ إلاّ الله مُنتهى الصَّوابِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {The day the Spirit and the angels stand in ranks} means that there is a king greater than the angels in creation.\n\nIt is said: The spirit: the sons of Adam, and it is said: They are in the image of the sons of Adam, and they are in the sky eating, and they have hands and feet and heads, and they are not angels.\n\nAnd His saying, {Except for those whom the Most Merciful has allowed and said, \"Righteous\"} [means] the truth and [the] testimony that there is no god but Allah, the Most Righteous.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { يوم يقوم الروح } الإنساني وملائكة القوى في مراتبهم صافين أي: مرتبة كل في مقامه كقوله:\n[الصافات\n الآية:164] { لا يتكلمون إلاَّ من أذن له الرحمن } يسر له بأن هيأ له استعداد المكالمة في الأزل ووفقه لإخراج ذلك الاستعداد إلى الفعل بالتزكية { وقال صواباً } قولاً حقاً لا باطلاً",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n مع أنه { يَوْمَ يَقُومُ ٱلرُّوحُ } أي: الوجودات الإضافية الفائضة على هياكل الهويات من أشعة نور الوجود المطلق { وَٱلْمَلاَئِكَةُ } أي: الأسماء والصفات الإلهية المجردات عن التعلقيات مطلقاً { صَفّاً } صافين مصطفين\n سكاتين صامتين من كمال دهشتهم عن سطوة سلطنة الذات القاهرة الغالبة { لاَّ يَتَكَلَّمُونَ } حنيئذٍ\n ولا يقدرون على التفوه بالحال أو المقال { إِلاَّ مَنْ أَذِنَ لَهُ ٱلرَّحْمَـٰنُ } بالشفاعة والسؤال فتكلم بإذنه { وَقَالَ صَوَاباً } [النبأ: 38] مرضيّاً عند الله مستجاباً؟!\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { يومَ يقومَ الرُّوحُ } جبريل عليه السلام عند الجمهور\n وقيل: مَلكٌ عظيم\n ما خلق الله تعالى بعد العرش أعظم منه\n يكون وحده صفًّا\n { والملائكةُ صفاً }: حال\n أي: مصطفين { لا يتكلمون } أي: الخلائق خوفاً\n { إِلاَّ مَن أّذِنَ له الرحمنُ } في الكلام أو الشفاعة\n { وقال صَواباً } أي: حقًّا\n\nقال الطيبي عن الإمام: فإن قيل: لَمَّا أذن له الرحمن في التكلم عَلِمَ أنه حق وصواب\n فما الفائدة في قوله: { وقا صواباً }؟ فالجواب من وجهين\n أحدهما: أنَّ التقدير: لا ينطقون إلاَّ بعد ورود الإذن والصواب\n ثم يجتهدون في ألاَّ ينطقوا إلاَّ بالحق والصواب\n وهذا مبالغة في وصفهم بالطاعة\n وثانيهما: أنَّ التقدير: لا يتكلمون إلاَّ في محضر إذن الرحمن في شفاعته والمشفوع له ممن قال صواباً\n وهو قول لا إله إلاّ الله\n هـ\n قلت: والمعنى: أن يُراد بالصواب: استعمال الأدب في الخطاب\n بمراعاة التعظيم\n كما هو شأن الكلام مع الملوك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:22",
      "similarity": 0.6945338008243999
    },
    {
      "verse": "37:165",
      "similarity": 0.681255319537473
    },
    {
      "verse": "37:1",
      "similarity": 0.6807775853877115
    },
    {
      "verse": "20:64",
      "similarity": 0.5093050623345963
    },
    {
      "verse": "24:41",
      "similarity": 0.4901854193980316
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/078038.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/078038.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/78:38.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}