{
  "chapter": "النبإ",
  "text": "رب السموت والارض وما بينهما الرحمن لا يملكون منه خطابا",
  "translations": [
    {
      "translation": "Lord of the heavens and earth and everything between them, the All-Merciful. They will not have the power to speak to Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord of the heavens and the earth, and all that lies between them, most benevolent, to whom none may dare address a word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "from the Lord of the heavens and the earth and of that which is between them; the Most Merciful Lord before Whom none dare utter a word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He is the Lord of the heavens and the earth and all that is between them. He is the Beneficent God and no one will be able to address Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the heavens and the earth, and all whatever is between them – the Most Gracious – with Whom no one will have the right to talk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord of the heavens and the earth, and whatsoever is in between them, the Most Gracious, with Whom th- ey cannot dare to speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord of the heavens and the earth and what is between them, the Beneficent Allah, they shall not be able to address Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the heavens and earth, and all that between them is, the All-merciful of whom they have no power to speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the heavens and the earth, and (all) that is between them, the Beneficent; with Whom none can converse.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Sustainer of the heavens and the earth and all that lies between them, the most Gracious [and] none shall have it in their power to raise their voices to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From the Lord of the heavens and the earth and of whatsoever is in bet-ween them, the Compassionate with Whom they can demand not audience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the All-beneficent, the Lord of the heavens and the earth and whatever is between them. They will not be able to address Him\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(From) the Lord of the heavens and the earth, and all between, (Allah) Most Gracious: None shall have power to argue with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(From) the Lord of the heavens and the earth, and whatsoever is in between them, the Most Beneficent, none can dare to speak with Him (on the Day of Resurrection except after His Leave).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the Lord of the heavens and earth, and all that is between them, the Merciful, of whom they are unable to speak.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lord of the heavens and the earth, and everything between them—The Most Merciful—none can argue with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[From] the Lord of the heavens and the earth and whatever is between them, the Most Merciful. They possess not from Him [authority for] speech.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[78:37] [from] the Lord of the heavens and the earth (read rabbi, ‘[from] the Lord of’, or rabbu, ‘[He is] the Lord of’) and all that is between them, the Compassionate One (likewise [read rahmāni or rahmānu], or read rahmānu with rabbi [for the preceding]), Whom, exalted be He, they, that is, creatures, will not be able to address, that is to say, not one of them will be able to address Him for fear of Him,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lord of the heavens and the earth, and (all) that is between them) of creation and marvels, (the Beneficent) He is the Beneficent; (with Whom none) none of His slaves, i.e. the angels as well as others (can converse) with regard to intercession until Allah gives them permission to do so.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ يَمْلِكُونَ مِنْهُ خِطَاباً } معناه كَلامٌ\n\n",
      "translations": [
        {
          "translation": " And His saying, {They do not own of it [the right to] speech} - its meaning is [that they have] no speech.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ربّ السموات والأرض وما بينهما الرحمن } أي: ربّهم المعطي إياهم ذلك العطاء هو الرحمن لأن عطاياهم من النعم الظاهرة الجليلة دون الباطنة الدقيقة، فمشربهم من اسم الرحمن دون غيره { لا يملكون منه خطاباً } لأنهم لم يصلوا إلى مقام الصفات فلا حظ لهم من المكالمة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوكيف لا يتفضل سبحانه على أوليائه، مع كونه { رَّبِّ ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } السياق يدل على أن التفسير جرى على قراءة نافع وابن كثير وغيرهما: \" رَبُّ \" أي: مربِّي العلويات والسفليات { وَمَا بَيْنَهُمَا } من الممتزجات { ٱلرَّحْمَـٰنِ } السياق يدل على أن التفسير جرى على قراءة نافع وابن كثير وغيرهما: \" الرَّحْمَنُ \" المستوي على عروش الكل بالرحمة العامة، والاستيلاء التام، والسلطنة القاهرة، والبسطة الغالبة بالإرادة والاختيار، بحيث { لاَ يَمْلِكُونَ } ولا يقدرون؛ أي: أهل السماوات والأرض { مِنْهُ } سبحانه { خِطَاباً } [النبأ: 37] أي: لا يسع لهم أن يخاطبوه، ويطالبوا منه شيئاً من زيادة ثواب ونقص عقاب، بل هو بذاته فقال لكل ما يريد من مقتضيات أسمائه وصفاته بالإرادة والاختيار، لا يُسئل عن فعله، إنه حكيم حميد؟!\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:57",
      "similarity": 0.8671519176403732
    },
    {
      "verse": "51:31",
      "similarity": 0.8671519176403732
    },
    {
      "verse": "38:20",
      "similarity": 0.7652340073344699
    },
    {
      "verse": "25:63",
      "similarity": 0.5274859798195479
    },
    {
      "verse": "11:37",
      "similarity": 0.47081550151921797
    }
  ]
}