{
  "chapter": "النبإ",
  "text": "انا انذرنكم عذابا قريبا يوم ينظر المرء ما قدمت يداه ويقول الكافر يليتنى كنت تربۢا",
  "translations": [
    {
      "translation": "We have warned you of an imminent punishment on the Day when a man will see what he has done, and the kafir will say, 'Oh, if only I were dust!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed warned you of a calamity near at hand, a day when man will see what he had sent (of his deeds) ahead, and the unbeliever will say: \"Woe alas. Ah would that I were dust!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We warn you of a chastisement near at hand; the Day when a man will look on what his own hands have sent forth, and the unbelievers shall say: “Oh would that I were utter dust.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have warned you of the approaching torment. On that day, a person will see what his hands have committed. A disbeliever will say, \"Would that I had been dust\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We warn you of a punishment that has come near; a day on which man will see what his own hands have sent ahead, and the disbeliever will say, “Alas – if only I were dust!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have warned you of a near torment -- the Day when man will see that which his hands have sent forth, and the disbeliever will say: \"Woe to me! Would that I were dust!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have warned you of a chastisement near at hand: the day when man shall see what his two hands have sent before, and the unbeliever shall say: O! would that I were dust!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo, We have warned you of a nigh chastisement, upon the day when a man shall behold what his hands have forwarded, and the unbeliever shall say, 'O would that I were dust!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We warn you of a doom at hand, a day whereon a man will look on that which his own hands have sent before, and the disbeliever will cry: \"Would that I were dust!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have warned you of a chastisement which is near at hand, on the Day when man shall [clearly] see what his hands have sent ahead, and when he who has denied the truth shall say, \"Oh, would that I were dust!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We have warned you of a torment nigh at hand, a Day whereon a man shall behold that which his hands have sent forth, and the infidel will say: would that I were dust!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We have warned you of a punishment near at hand—the day when a person will observe what his hands have sent ahead and the faithless one will say, ‘I wish I were dust!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have warned you of a Penalty near, the Day when man will see (the deeds) which his hands have sent forth, and the Unbeliever will say, \"Woe unto me! Would that I were (metre) dust!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have warned you of a near torment, the Day when man will see that (the deeds) which his hands have sent forth, and the disbeliever will say: \"Woe to me! Would that I were dust!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have forewarned you of an imminent punishment, the Day when the person will look upon his works and the unbelievers will say: 'Would that I were dust'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have warned you of a near punishment—the Day when a person will observe what his hands have produced, and the faithless will say, “O, I wish I were dust.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have warned you of a near punishment on the Day when a man will observe what his hands have put forth and the disbeliever will say, \"Oh, I wish that I were dust!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[78:40] Lo! We have warned you, O disbelievers of Mecca, of a chastisement that is near, the chastisement of the impending Day of Resurrection — for anything that is impending is [also] near — the day (yawma adverbially qualifies ‘adhāban, ‘a chastisement’, by describing it) when a person, [when] every person, will behold what his hands have sent ahead, of good and evil, and the disbeliever will say, ‘O (yā is a particle   used to call attention to something) would that I were dust!’, in other words, and not be chastised. He says this when God, exalted be He, says to the beasts, after each of them has retaliated against the other, ‘Be dust!’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Lo! We warn you) people of Mecca (of a doom at hand) which will surely happen, (a day whereon a man will look) when the believer will look; and it is also said: when the disbeliever will look (on that which his own hands have sent before) have earned of good or evil, (and the disbeliever will cry: \"Would that I were 725 dust!\") with the beasts. Because of the horrors, severity and torment of that day, the disbeliever will wish to be turned into dust along with beasts. This will occur on the day when the first trumpet resounds'. And of the surah in which Those Who Drag Forth are mentioned, which is all Meccan and consists of 45 verses, 173 words and 953 letters: Surah 79: Those Who Drag Forth (al-Nazi'at) And of the surah in which Those Who Drag Forth are mentioned, which is all Meccan and consists of 45 verses, 173 words and 953 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { إِنَّآ أَنذَرْنَاكُمْ } أيها المعرضون عن الله، المنصرفون عن طاعاته وعباداته { عَذَاباً قَرِيباً } سليحقكم بغتة، وأنتم لا تشعرون بأماراته ومقدماته { يَوْمَ يَنظُرُ ٱلْمَرْءُ } ويرجى جميع { مَا قَدَّمَتْ يَدَاهُ } خيراً كان أو شراً، نفعاً كان أو ضراً { وَ } بعدما رأى الكل يومئذٍ ما رأى من المصالح والمقابح الصادرة منه، الجارية عليه { يَقُولُ ٱلْكَافِرُ } الرائي قوابح أفعاله، وفواسد أعماله، متأسفاً متحسراً متمنياً هلاكه على سبيل المبالغة: { يٰلَيْتَنِي كُنتُ تُرَاباً } [النبأ: 40] لم أُخلق ولم أُكلف؛ حتى لا أستحق هذا الويل والثبور\n\n\nهب لنا من لدنك رحمة، إنك أنت الحريم الغفور\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها الموحد المحمدي أن تتزود ليوم الجزاء بالتقوى عن محارم الله، والاجتناب عن منهياته، والامتثال بأوامره، والتخلق بأخلاقه؛ حتى لا تستحي من الله في يوم الجزاء، ولا تتمنى مقتك وهلاكك مثل من كفر وعصى\n\n\n\n\nفلك أن تلازم على أداء الواجبات والمستحبات، والمسنونات من الصلوات والزكوات وأنواع الطاعات، والتقرب نحوه بالنوافل من الطاعات والصلوات والصدقات، والخدمة بالجوارح والآلات لعموم عباد الله، والسعي إلى مطلق الخيرات والمبرات، والاجتهاد في طريق الحسنات وترك السيارات ومطلق المنكرات؛ حتى تتخلص من كؤود العقبات، وتصل إلى روضات الجنات، وتفوز بالفوز بالسعادات وأنواع الكرامات\n\n\n\n\nجعلنا الله من أرباب الهداية والتوفيق، ويسر لنا الوصول إلى مقر التوحيد والتحقيق بمنِّه وجوده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}