{
  "chapter": "النبإ",
  "text": "انا انذرنكم عذابا قريبا يوم ينظر المرء ما قدمت يداه ويقول الكافر يليتنى كنت تربۢا",
  "translations": [
    {
      "translation": "We have warned you of an imminent punishment on the Day when a man will see what he has done, and the kafir will say, 'Oh, if only I were dust!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have indeed warned you of a calamity near at hand, a day when man will see what he had sent (of his deeds) ahead, and the unbeliever will say: \"Woe alas. Ah would that I were dust!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We warn you of a chastisement near at hand; the Day when a man will look on what his own hands have sent forth, and the unbelievers shall say: “Oh would that I were utter dust.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have warned you of the approaching torment. On that day, a person will see what his hands have committed. A disbeliever will say, \"Would that I had been dust\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We warn you of a punishment that has come near; a day on which man will see what his own hands have sent ahead, and the disbeliever will say, “Alas – if only I were dust!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have warned you of a near torment -- the Day when man will see that which his hands have sent forth, and the disbeliever will say: \"Woe to me! Would that I were dust!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely We have warned you of a chastisement near at hand: the day when man shall see what his two hands have sent before, and the unbeliever shall say: O! would that I were dust!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo, We have warned you of a nigh chastisement, upon the day when a man shall behold what his hands have forwarded, and the unbeliever shall say, 'O would that I were dust!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! We warn you of a doom at hand, a day whereon a man will look on that which his own hands have sent before, and the disbeliever will cry: \"Would that I were dust!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have warned you of a chastisement which is near at hand, on the Day when man shall [clearly] see what his hands have sent ahead, and when he who has denied the truth shall say, \"Oh, would that I were dust!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We! We have warned you of a torment nigh at hand, a Day whereon a man shall behold that which his hands have sent forth, and the infidel will say: would that I were dust!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed We have warned you of a punishment near at hand—the day when a person will observe what his hands have sent ahead and the faithless one will say, ‘I wish I were dust!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have warned you of a Penalty near, the Day when man will see (the deeds) which his hands have sent forth, and the Unbeliever will say, \"Woe unto me! Would that I were (metre) dust!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, We have warned you of a near torment, the Day when man will see that (the deeds) which his hands have sent forth, and the disbeliever will say: \"Woe to me! Would that I were dust!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have forewarned you of an imminent punishment, the Day when the person will look upon his works and the unbelievers will say: 'Would that I were dust'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have warned you of a near punishment—the Day when a person will observe what his hands have produced, and the faithless will say, “O, I wish I were dust.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, We have warned you of a near punishment on the Day when a man will observe what his hands have put forth and the disbeliever will say, \"Oh, I wish that I were dust!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[78:40] Lo! We have warned you, O disbelievers of Mecca, of a chastisement that is near, the chastisement of the impending Day of Resurrection — for anything that is impending is [also] near — the day (yawma adverbially qualifies ‘adhāban, ‘a chastisement’, by describing it) when a person, [when] every person, will behold what his hands have sent ahead, of good and evil, and the disbeliever will say, ‘O (yā is a particle   used to call attention to something) would that I were dust!’, in other words, and not be chastised. He says this when God, exalted be He, says to the beasts, after each of them has retaliated against the other, ‘Be dust!’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Lo! We warn you) people of Mecca (of a doom at hand) which will surely happen, (a day whereon a man will look) when the believer will look; and it is also said: when the disbeliever will look (on that which his own hands have sent before) have earned of good or evil, (and the disbeliever will cry: \"Would that I were 725 dust!\") with the beasts. Because of the horrors, severity and torment of that day, the disbeliever will wish to be turned into dust along with beasts. This will occur on the day when the first trumpet resounds'. And of the surah in which Those Who Drag Forth are mentioned, which is all Meccan and consists of 45 verses, 173 words and 953 letters: Surah 79: Those Who Drag Forth (al-Nazi'at) And of the surah in which Those Who Drag Forth are mentioned, which is all Meccan and consists of 45 verses, 173 words and 953 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { إنّا أنذرناكم عذاباً } هو عذاب الهيئات الفاسقة من الأعمال الفاسدة دون ما هو أبعد منه من عذاب القهر والسخط وهو ما قدّمت أيدهم\n والله تعالى أعلم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبالجملة: { إِنَّآ أَنذَرْنَاكُمْ } أيها المعرضون عن الله\n المنصرفون عن طاعاته وعباداته { عَذَاباً قَرِيباً } سليحقكم بغتة\n وأنتم لا تشعرون بأماراته ومقدماته { يَوْمَ يَنظُرُ ٱلْمَرْءُ } ويرجى جميع { مَا قَدَّمَتْ يَدَاهُ } خيراً كان أو شراً\n نفعاً كان أو ضراً { وَ } بعدما رأى الكل يومئذٍ ما رأى من المصالح والمقابح الصادرة منه\n الجارية عليه { يَقُولُ ٱلْكَافِرُ } الرائي قوابح أفعاله\n وفواسد أعماله\n متأسفاً متحسراً متمنياً هلاكه على سبيل المبالغة: { يٰلَيْتَنِي كُنتُ تُرَاباً } [النبأ: 40] لم أُخلق ولم أُكلف\n حتى لا أستحق هذا الويل والثبور\n\nهب لنا من لدنك رحمة\n إنك أنت الحريم الغفور\n\n\nخاتمة السورة\n\nعليك أيها الموحد المحمدي أن تتزود ليوم الجزاء بالتقوى عن محارم الله\n والاجتناب عن منهياته\n والامتثال بأوامره\n والتخلق بأخلاقه\n حتى لا تستحي من الله في يوم الجزاء\n ولا تتمنى مقتك وهلاكك مثل من كفر وعصى\n\n\nفلك أن تلازم على أداء الواجبات والمستحبات\n والمسنونات من الصلوات والزكوات وأنواع الطاعات\n والتقرب نحوه بالنوافل من الطاعات والصلوات والصدقات\n والخدمة بالجوارح والآلات لعموم عباد الله\n والسعي إلى مطلق الخيرات والمبرات\n والاجتهاد في طريق الحسنات وترك السيارات ومطلق المنكرات\n حتى تتخلص من كؤود العقبات\n وتصل إلى روضات الجنات\n وتفوز بالفوز بالسعادات وأنواع الكرامات\n\n\nجعلنا الله من أرباب الهداية والتوفيق\n ويسر لنا الوصول إلى مقر التوحيد والتحقيق بمنِّه وجوده",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إِنَّا أنذرناكم } بما ذكر في السورة من الآيات الناطقة بالبعث وما بعده من الدواعي\n أو بسائر القوارع الواردة في القرآن\n أي: خوفناكم { عذاباً قريباً } هو عذاب الآخرة\n وقُربه لتحقُّق وقوعه\n وكل آتٍ قريب\n\n[النازعات:46]\n وعن قتادة هو قتل قريش يوم بدر ويأباه قوله تعالى: { يوم ينظر المرء ما قدمت يداه } فإنه بدل من \" عذاب \" أو ظرف لمُضمر هو صفة له\n أي: عذاباً كائناً يوم ينظر المرء\n أي: يُشاهد ما قدَّمه من خير وشر\n و \" ما \" موصولة\n والعائد محذوف\n أو استفهامية\n أي: ينظر الذي قدمته يداه\n أو: أي شيء قدمت يداه وقيل: المراد بالمرء: الكافر\n وقوله: { ويقول الكافرُ يا ليتني كنتُ تراباً } \n وضع الظاهرَ موضع الضمير\n لزيادة الذّم\n أي: يا ليتني كنتُ تراباً لم أُخلق ولم أُكلّف أو: ليتني كنت تراباً في هذا اليوم فلم أُبعث\n وقيل: يحشر اللّهُ تعالى الحيوان حتى يقتص للجماء من القرناء\n ثم يرده تراباً\n فيود الكافرُ أن يكون تراباً مثله\n وقيل: الكافر: إبليس يرى آدم وولده وثوابهم\n فيتمنى أن يكون من الشيء الذي احتقره حين قال:\n\n[الأعراف:12 و صۤ:76]\n قال الطيبي: والعموم في المرء هو الذي يساعده النظم\n ثم قال عن الإمام: فإن قلتَ: لِمَ خصّ بعد العموم قول الكافر دون المؤمن؟ قلت: دلّ قول الكافر على غاية التحسُّر\n ودلّ حذف قول المؤمن على غاية التبجُّح ونهاية الفرح بما لا يَحصُره الوصف\n هـ\n قال المحشي: والظاهر أنه اقتصر على قول الكافر بعد العموم في المرء\n لأنه المناسب للنذارة التي اقتضاها المقام\n هـ\n قلتُ: ولو ذكر قول المؤمن لقال: ويقول المؤمن هاؤم اقرؤوا كتابيه\n تبجُّحاً وفرحاً\n والله تعالى أعلم\n الإشارة: إنَّ للمتقين الله حق تقاته مفازاً\n وهو التخلُّص من رؤية الأكوان\n والإفضاء إلى رؤية الشهود والعيان\n وهو دخول حدائق العرفان\n واقتطاف ثمار الوجدان\n ونكاح أبكار الحقائق\n وهنّ أتراب\n لاستوائها غالباً في لذة الشهود لمَن تمكن منها\n ويشربون كأس الخمرة الأزلية\n لا يسمعون في حضرة القدس لغواً ولا كِذاباً\n لغاية أدبهم\n جزاء من ربك على مكابدتهم في أيام سيرهم\n عطاءً كافياً مغنياً من الرحمن\n لا يملكون منه خِطاباً\n لغاية هيبتهم\n وهذا لقوم أقامهم مقام الهيبة\n وثَمَّ آخرون أقامهم مقام البسط والإدلال\n وهم المتمكنون في معرفته\n ينبسطون معه\n ويشفعون في عباده في الدارين\n قال الورتجبي: مَن كان كلامه في الدنيا من حيث الكشف والمعاينة\n فهو مأذون في الدنيا والآخرة\n يتكلم مع الحق على بساط الحرمة والهيبة\n يُنقذ الله به الخلائق من ورطة الهلاك\n هـ\n يوم يقوم الروح\n أي: جنس الروح\n وهي الأرواح الصافية\n التي التحقت بالملائكة\n فتقوم معهم صفاً في مقام العبودية التي شرفت بها\n لا يتكلمون هيبةً لمقام الحضرة\n إلاَّ مَن أّذِنَ له الرحمنُ في الشفاعة\n على قدر مقامه\n وقال صواباً\n أي: استعمل الأدب في مخاطبته فإذا استعمل الأدب شفع\n ولو قصر مقامه عن عدد المشفوع فيه\n حُكي أنّ بعض الأولياء قال عند موته: يا رب شفِّعني في أهل زماني\n فقال له الهاتف من قِبل الله تعالى: لم يبلغ مقامك هذا\n فقال: يا رب إذا كان ذلك بعملي واجتهادي فلعَمري إنه لم يبلغ ذلك\n وإذا كان ذلك بكرمك وَجُودك\n فهو أعظم من ذلك\n فشَفَّعه الحقُّ تعالى في الوجود\n هكذا سمعتُ الحكاية من شيخنا الفقيه العالم\n سيدي \" التاودي بن سودة \" رحمه الله\n فحُسن خطاب هذا الرجل بلّغه ما لم يبلغه قدره\n ذلك اليوم الحق\n تحِق فيه الحقائق\n وتبطل فيه الدعاوى ويفتضح أهلها\n فمَن شاء اتخذ إلى ربه مآباً\n يرجع به إلى ربه\n وهو حُسن التوجه إليه\n برفض كل ما سواه\n { إنَّا أنذرناكم عذاباً قريباً } قال القشيري: أي: عذاب الالتفات إلى النفس والدنيا والهوى\n يوم ينظر المرءُ ما قدَّمت يداه من الإساءة والإحسان هـ\n ويقول الكافر الجاحد لطريق الخصوصية\n حتى مات محجوباً: يا ليتني كنتُ تُراباً\n تحسُّراً على ما قاته من مقام المقربين\n وبالله التوفيق\n وصلّى الله على سيدنا محمد وآله وصحبه وسلّم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "89:24",
      "similarity": 0.6029859103947158
    },
    {
      "verse": "69:27",
      "similarity": 0.4894074509666435
    },
    {
      "verse": "36:26",
      "similarity": 0.48844824435145523
    },
    {
      "verse": "33:66",
      "similarity": 0.46866835192560463
    },
    {
      "verse": "69:25",
      "similarity": 0.3655273503020396
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/78:40.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/78:40.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/78:40.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}