{
  "chapter": "النبإ",
  "text": "وجعلنا نومكم سباتا",
  "translations": [
    {
      "translation": "We made your sleep a break.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And made sleep for you to rest,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and made your sleep a means of repose,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "made sleep for you to rest,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And made your sleep a rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made your sleep as a thing for rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made your sleep to be rest (to you),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We appointed your sleep for a rest;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And have appointed your sleep for repose,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and gave you repose in sleep,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have made your sleep as a rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and make your sleep for rest?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And made your sleep for rest,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And have made your sleep as a thing for rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We made your sleep a rest,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And made your sleep for rest?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And made your sleep [a means for] rest\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[78:9] and made your sleep for rest?, repose for your bodies,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And have appointed your sleep for repose) a repose for your bodies; and it is said this means: nice and beautiful,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَجَعَلْنَا نَوْمَكُمْ سُبَاتاً } معناه مَسبوتٌ وفِيهِ رُوحٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وجعلنا نَومكم سُباتاً } أي: راحة لكم، أو: قطعاً للأعمال والتصرُّف، فتريحون أبدانكم به من التعب\n والسبْت: القطع\n أو: موتاً لِما بينهما من المشاكلة التامة في انقطاع أحكام الحياة، وعليه قوله تعالى:\n\n[الأنعام:60] وقوله:\n\n[الزمر:42]\n { وجعلنا الليلَ لباساً } يستركم بظلامه، كما يستركم اللباس، شبّهه بالثياب التي تلبس، لأنه يستر عن العيون، وقيل: المراد به ما يستتر به عند النوم من اللحاف ونحوه\n { وجلعنا النهارَ معاشاً } أي: وقت حياة تتمعشون فيه من نومكم، الذي هو أخو الموت، كقوله:\n\n[الفرقان:47] أي: تنتشرون فيه من نومكم، أو تطلبون فيه معاشكم، وتتقلبون في حوائجكم، على حذف مضاف، أي: ذا معاش\n { وبنينا فوقكم سَبْعاً شِداداً } أي: سبع سموات، قوية الخلق، محكمة البناء، لا يؤثّر فيها مرّ الدهور، ولا المرور والكرور\n والتعبير عنها بالبناء مبني على تنزيلها منزلة القبة المضروبة على الخلق، وهو يؤيد كونها الأفلاك المحيطة\n { وجعلنا } فيها { سِراجاً وهَّاجاً } أي: مضيئاً وقّاداً، أي: جامعاً للنور والحرارة، وهو الشمس، والوهَّاج: الوقّاد المتلألىء، من: وهجت النار إذا أضاءت، أو البالغ في الحرارة، من: الوهج، وهو الحر\n والتعبير عنها بالسراج مناسب للتعبير عن السموات بالبناء، فالدنيا بيت وسراجه الشمس بالنهار والقمر والنجوم بالليل\n والجعل هنا بمعنى الإنشاء والإبداع، كالخلق، غير أنَّ الجعل مختص بالإنشاء التكويني، وفيه معنى التقدير والتسوية\n { وأنزلنا من المُعْصِرات } أي: السحاب إذا أعصرت، أي: شارفت أن يعصرها الرياح فتمطر، ومنه: أعصرت الجارية: إذا دنت أن تحيض، والرياح: إذا حان لها أن تعصر السحاب، وقد جاء: أنَّ الله تعالى يبعث الرياح، فتحمل الماء إلى السحاب فتعصره كما يعصر الماء من الجفافة، أي: أنزلنا من السحاب { ماءً ثَجَّاجاً } أي: منصباً بكثرة، يقال: ثج الدم، أي: أساله، ومنه قوله صلى الله عليه وسلم:\n\n\n\n \" أفضل الحج العجّ والثج \" \n\nأي: رفع الصوت بالتلبية، وصب دم الهَدْي\n { لنُخرج به } بذلك الماء { حباً } يُقتات به، كالحنطة والشعير، ونحوهما { ونباتاً } يُعلف، كالتبن والحشيش\n قال الطيبي: النبات أريد به النابت\n وتقديم الحب مع تأخره في الإخراج لشرفه لأنَّ غالبة قوت الإنسان\n { وجناتٍ } بساتين، من: جنّة إذا ستره، فالجنة تطلق على ما فيه النخل والشجر المتكاثف لأنه يستر الأرض بظل أشجاره، وقال الفراء: الجنة ما فيه النخل، والفردوس مافيه الكرم\n و { ألفافاً } صفة، أي: ملتفّةَ الأشجار، واحدها: \" لِفّ \" ككِن وأكنان، أو: لَفيف، كشريف وأشراف، أو: لا واحد له، كأوْزاع وأضياف، أو جمع الجمع، فألفاف جمع \" لُفّ \" بالضم، و \" لُفّ \" ـ جمع \" لَفَّاء \" كخُضر وخضراء، واللِّفُ: الشجر الملتف\n قال أبو السعود: اعلم أنَّ فيما ذكر تعالى من أفعاله ـ عزّ وجل ـ دلالة على صحة البعث من ثلاثة أوجه: الأول: باعتبار قدرته تعالى، فإنَّ مَن قَدَر على إنشاء هذه الأفعال البديعة، من غير مثال يحتذيه ولا قانون ينتحيه، كان على الإعادة أقدر وأقوى\n الثاني: باعتبار علمه وحكمته، فإنَّ مَن أبدع هذه المصنوعات على نمط رائع، مستتبع لغايات جليلة، ومنافع جميلة، عائدة إلى الخلق يستحيل أن يخليها من الحكمة بالكلية، ولا يجعل لها عاقبة باقية\n والثالث: باعتبار نفس الفعل، فإنَّ في اليقظة بعد النوم أنموذجاً للبعث بعد الموت، يشاهدونها كل يوم، وكذا إخراج الحب والنبات من الأرض الميتة، يعاينونه كل حين، شاهد على إخراج الموتى من القبور بعد الفناء والدثور، كأنه قيل: ألم يفعل هذه الأفعال الآفاقية والأنفسية، الدالة بفنون الدلالات على حقيّة البعث، الموجبة للإيمان به، فما لكم تخوضون فيه إنكاراً، وتتساؤلون عنه استهزاءً؟ هـ\n الإشارة: ألم نجعل أرضَ البشرية مِهاداً للعبودية والقيام بآداب الربوبية، وجبالَ العقل أوتاداً، يسكنونها لئلا يميلها الهوى عن الاعتدال في الاستقامة وخلقناكم أزواجاً أصنافاً عارفين وعلماء، وعُبَّاداً وزُهَّاداً، وصالحين وجاهلين، وعصاة وكافرين، وجعلنا نومَكم، اي: سِنَتكم عن الشهود بالميل إلى شيء من الحس في بعض الأوقات، سُباتاً، أي: راحة للقلوب، لأنَّ دوام التجلَّي يمحقُ البشرية، وفي الأثر: \" رَوِّحوا قلوبكم بشيءٍ من المباحات \" أو كما قال عليه الصلاة والسلام\n أو: نومَكم الحسي راحة للأبدان، لتنشط للعبادة، وجعلنا ليل القطيعة لباساً ساتراً عن الشهود وجعلنا نهارَ العيان معاشاً حياة للأرواح والأسرار، وبنينا فوقكم سبعَ مقامات شِداداً صعاباً، فإذا قطعتموها وترقيتم عنها أفضيتم إلى فضاء الشهود، وهي التوبة النصوح والورع، والزهد، والصبر على مجاهدة النفس، وخرق عوائدها، والتوكُّل، والرضا، والتسليم، وجعلنا في قلوبكم بعد هذه المقامات سِراجاً وهّاجاً، وهي شمس العرفان لا تغرب أبداً، وأنزلنا من سماء الغيوب ماء ثجّاجاً، تحيى به الأوراح والأسرار، وهو ماء الواردات الإلهية، والعلوم اللدنية، لنُخرج به حبًّا حِكماً لقوت الأرواح، ونباتاً علوماً لقوت النفوس، وجنات: بساتين التوحيد، مشتملة على أشجار ثمار الأذواق وظلال التقريب\n ثم ذكر أحوال البعث الذي وقع التساؤل عنه، فقال: { إِنَّ يَوْمَ ٱلْفَصْلِ كَانَ مِيقَاتاً }\n\n",
      "translations": []
    }
  ]
}