{
  "chapter": "النازعات",
  "text": "والنزعت غرقا",
  "translations": [
    {
      "translation": "By those who pluck out harshly,",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I CALL TO WITNESS those who dive and drag,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By those (angels) that pluck out the soul from depths,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the angels who violently tear-out the souls of the disbelievers from their bodies,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By oath of those who harshly pull out the soul. (Of the disbeliever)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By those who pull out, drowning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I swear by the angels who violently pull out the souls of the wicked,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By those that pluck out vehemently\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By those who drag forth to destruction,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By [the winds] that pluck out vehemently\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the angels who drag forth vehemently.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By those [angels] who wrest [the soul] violently,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the (angels) who tear out (the souls of the wicked) with violence;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By those (angels) who pull out (the souls of the disbelievers and the wicked) with great violence;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the pluckers (the angels of death), violently plucking (the souls of the unbelievers),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By those who snatch violently.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By those [angels] who extract with violence\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[79:1] By those that wrest, [by] the angels who wrest the souls of disbelievers, violently;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوَالنَّازِعَاتِ غَرْقًا (1) ابتدئت بالقسَم بمخلوقات ذات صفات عظيمة قَسَماً مراداً منه تحقيقُ ما بعده من الخبر وفي هذا القسَم تهويل المقسم به .وهذه الأمور الخمسة المقسم بها جُموع جَرى لفظها على صيغة الجمع بألف وتاء لأنها في تأويل جَماعات تتحقق فيها الصفات المجموعة ، فهي جماعات ، نازعات ، ناشطات ، سابحات ، سابقات ، مدبِّرات ، فتلك صفات لموصوفات محذوفة تدلّ عليها الأوصاف الصالحة لها .فيجوز أن تكون صفاتتٍ لموصوفات من نوع واحد له أصناف تميزها تلك الصفات .ويجوز أن تكون صفات لموصوفات مختلفة الأنواع بأن تكون كل صفة خاصيَّةً من خواصّ نوع من الموجودات العظيمة قوامُه بتلك الصفة .والذي يقتضيه غالب الاستعمال أن المتعاطفات بالواو صفات مستقلة لموصوفات مختلفة أنواع أو أصناف ، أو لموصوف واحد له أحوال متعددة ، وأنَّ المعطوفاتتِ بالفاء صفات متفرعة عن الوصف الذي عُطفت عليه بالفاء ، فهي صفات متعددة متفرّع بعضها عن بعض لموصوف واحد فيكون قَسماً بتلك الأحوال العظيمة باعتبار موصوفاتها .وللسلف من المفسرين أقوال في تعيين موصوفات هذه الأوصاف وفي تفسير معاني الأوصاف . وأحسن الوجوه على الجملةِ أن كلّ صفة مما عُطف بالواو مراداً بها موصوف غير المراد بموصوف الصفة الأخرى ، وأن كل صفة عطفت بالفاء أن تكون حالةً أخرى للموصوف المعطوف بالواو كما تقدم . وسنتعمد في ذلك أظهر الوجوه وأنظَمها ونذكر ما في ذلك من الاختلاف ليكون الناظر على سعَةِ بصيرةٍ .وهذا الإِجمال مقصود لتذهب أفهام السامعين كلَّ مذهب ممكن ، فتكثر خطور المعاني في الأذهان ، وتتكرر الموعظة والعبرة باعتبار وقْع كل معنى في نفس له فيها أشدُّ وقْععٍ وذلك من وفرة المعاني مع إيجاز الألفاظ .فالنازعات : وصف مشتق من النزع ومعاني النزع كثيرة كلها ترجع إلى الإِخراج والجذب فمنه حقيقة ومنه مجاز .فيحتمل أن يكون { النازعات } جماعات من الملائكة وهم الموكّلون بقبض الأرواح ، فالنزع هو إخراج الروح من الجسد شبه بنزع الدلو من البئر أو الركية ، ومنهم قولهم في المحْتضَر هو في النزع . وأجريت صفتهم على صيغة التأنيث بتأويل الجماعة أو الطوائف كقوله تعالى : { قالت الأعراب آمنا } \\[ الحجرات : 14 \\] .وروي هذا عن علي وابن مسعود وابن عباس ومجاهد ومسروق وابن جبير والسدّي فأقسم الله بالملائكة لأنها من أشرف المخلوقات ، وخصها بهذا الوصف الذي هو من تصرفاتها تذكيراً للمشركين إذ هم في غفلة عن الآخرة وما بعد الموت ، ولأنهم شديدٌ تعلقهم بالحياة كما قال تعالى لمَّا ذكر اليهود : { ولتجدنهم أحرص الناس على حياة ومن الذين أشركوا } \\[ البقرة : 96 \\] فالمشركين مَثَل في حب الحياة ففي القسم بملائكة قبض الأرواح عظة لهم وعبرة .والقسَم على هذا الوجه مناسب للغرض الأهم من السورة وهو إثبات البعث لأن الموت أول منازل الآخرة فهذا من براعة الاستهلال .وغرقا : اسم مصدر أغرق ، وأصله إغراقاً ، جيء به مجرداً عن الهمزة فعومل معاملة مصدر الثلاثي المتعدّي مع أنه لا يوجد غرِق متعدياً ولا أن مصدره مفتوح عين الكلمة لكنه لما جعل عوضاً عن مصدر أغرق وحذفت منه الزوائد قدّر فعله بعد حذف الزوائد متعدياً .ولو قلنا : إنه سكنت عينه تخفيفاً ورعياً للمزاوجة مع { نشطاً } ، و { سبحا } ، و { سبقاً } ، و { أمراً } لكان أرقب لأن متحرك الوسط يخفف بالسكون ، وهذا مصدر وصف به مصدر محذوف هو مفعول مطلق للنازعات ، أي نَزْعاً غَرقاً ، أي مغرقاً ، أي تنزع الأرواح من أقاصي الأجساد .ويجوز أن تكون { النازعات } صفة للنجوم ، أي تنزع من أفق إلى أفق ، أي تسير ، يقال : ينزع إلى الأمر الفلاني ، أي يميل ويشتاق .وغرقاً : تشبيه لغروب النجوم بالغَرْق في الماء وقاله الحسن وقتادة وأبو عبيدة وابن كيسان والأخفش ، وهو على هذا متعين لأن يكون مصدر غَرِق وأن تسكين عينه تخفيف .والقَسَم بالنجوم في هذه الحالة لأنها مَظهر من مظاهر القدرة الربانية كقوله تعالى : { والنجم إذا هوى } \\[ النجم : 1 \\] .ويحتمل أن تكون { النازعات } جماعات الرّماة بالسهام في الغزو يقال : نزع في القوس ، إذا مدَّها عند وضع السهم فيها . وروي هذا عن عكرمة وعطاء .والغَرف : الإِغراق ، أي استيفاء مدّ القوس بإغراق السهم فيها فيكون قسماً بالرماة من المسلمين الغزاة لشرفهم بأن غزوهم لتأييد دين الله ، ولم تكن للمسلمين وهم بمكة يومئذٍ غزوات ولا كانوا يرجونها ، فالقَسَم بها إنذار للمشركين بغزوة بدر التي كان فيها خضْد شوكتهم ، فيكون من دلائل النبوءة ووعد وعده الله رسوله صلى الله عليه وسلم\n\n",
      "translations": [
        {
          "translation": "And from his narration on the authority of Ibn 'Abbas that he said concerning the interpretation of Allah's saying (By those who drag forth): '(By those who drag forth) He says: Allah swears by the angels who take away the souls of the disbelievers (to destruction) the souls of the disbelievers,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأخبرنا أبو جعفر\n قال: حدّثنا علي بن أحمد\n قال: حَدَّثَنَا عطاء بن السائب عن أبي خالد، عن زيد بن علي عليهما السّلامُ في قولهِ تعالى: { وَٱلنَّازِعَاتِ غَرْقاً } معناه النّجومُ تَنزعُ: أي تَغيبُ هوناً وتَشرقُ هَوناً\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us.\n He said: Ali bin Ahmad narrated to us.\n\n\nAt-Tirmidhi said: It was narrated from 'Ata' bin Abu Rabah that Zayd bin 'Ali said, regarding the statement of Allah, {And the stars are thrown} [Qur'an, 67: 5], \"The stars {are thrown} means they disappear here and appear there.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nأقسم بالنفوس المشتقاة التي غلب عليها النزوع إلى جناب الحق\n غريقة في بحر الشوق والمحبة التي تنشط من مقرّ النفس وأسر الطبيعة أي: تخرج من قيود صفاتها وعلائق البدن كقوله: ثور ناشط إذا خرج من بلد إلى بلد\n أو من قولهم: نشط من عقاله\n والتي تسبح في بحار الصفات فتسبق إلى عين الذات ومقام الفناء في الوحدة فتدبر بالرجوع إلى الكثرة أمر الدعوة إلى الحق والهداية وأمر النظام في مقام التفصيل بعد الجمع\n وبالكواكب السيارة التي تنزع من المشرق إلى المغرب مفرقة في سيرها إلى أقصى المغرب وتخرج من برج إلى برج وتسبح في أفلاكها فيسبق بعضها بعضاً في السير وتدبر أمر العالم فيما نيط بها وبسيرها\n أو بالملائكة من النفوس الفلكية التي تنزع الأرواح البشرية من الأجساد إغراقاً في النزع من أقاصي البدن\n أنامله وأظفاره\n والتي تخرجها من الأبدان من قولهم: نشط الدلو من البئر\n إذا أخرجها\n والتي تسبح في جريها فيما أمرت به فتسبق إليه فتدبر المأمور به على الوجه الذي أمر به\n والمقسم عليه محذوف كما ذكر غير مرة أي: لتبعثنّ",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } حق { ٱلنَّازِعَاتِ } المخلِّصات أرواح عموم العباد عن محابس الطبائع والأركان { غَرْقاً } النازعات: 1] لاستغراقهم في لوازم الناسوت\n ومقتضياتها المغشية صفاء عالم اللاهوت\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nفإنَّ جواب القسم: لتُبعثن ثم لتعذِّبن\n يقول الحق جلّ جلاله: { والنازعاتِ } أي: والملائكة التي تنزع الأرواح من أجسادها\n كما قال ابن عباس أو أرواح الكفرة\n كما قاله هو أيضاً وابن مسعود\n { غَرْقاً } أي: إغراقاً\n من: أَغرق في الشيء: بالغ فيه غايةً\n فإنها تُبالغ في نزعها فتخرجها من أقاصي الجسد\n قال ابن مسعود: تنزع روح الكافر مِن جسده من تحت كل شعرة\n ومِن تحت الأظافر\n ومن أصول القدمين\n ثم تفرقها في جسده\n ثم تنزعها حتى إذا كادت تخرج تردها في جسده\n فهذا عملها بالكفار دون المؤمنين\n أو: تُغرقها في جهنم\n فهو مصدر مؤكد",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:66",
      "similarity": 0.6026135908913525
    },
    {
      "verse": "37:82",
      "similarity": 0.6026135908913525
    },
    {
      "verse": "20:62",
      "similarity": 0.5366158042247778
    },
    {
      "verse": "21:77",
      "similarity": 0.5144607481522291
    },
    {
      "verse": "26:120",
      "similarity": 0.4528945241665445
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/079001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/079001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/79:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}