{
  "chapter": "النازعات",
  "text": "فاما من طغى",
  "translations": [
    {
      "translation": "As for him who overstepped the bounds",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he who had been rebellious\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then he who transgressed\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who have rebelled\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So for one who rebelled,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then for him who transgressed\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then as for him who is inordinate,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then as for him who was insolent\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, as for him who rebelled\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "anyone who has acted arrogantly\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then as for him who waxed exorbitant,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "as for him who has been rebellious\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, for such as had transgressed all bounds,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, for him who Tagha (transgressed all bounds, in disbelief, oppression and evil deeds of disobedience to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then as for whosoever was insolent\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for him who was defiant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So as for he who transgressed\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[79:37] as for him who was rebellious, [who] disbelieved,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then, as for him who rebelled) him who was too arrogant and proud and disbelieved in Allah, i.e. al-Nadr Ibn al-Harith Ibn 'Alqamah\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَأَمَّا مَن طَغَىٰ } معناه من عَصى\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قسم الناس حينئذٍ قسمين: { فَأَمَّا مَن طَغَىٰ } [النازعات: 37] في النشأة الأولى\n\n\n\n\n{ وَآثَرَ ٱلْحَيَاةَ ٱلدُّنْيَا } [النازعات: 38] أي: اختار الحياة المستعارة، الدنيَّة الدنيوية ولوازمها من اللذات والشهوات الفانية على الحياة الأخروية، وما يترتب عليها من اللذات اللدنيَّة الباقية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأمَّا مَن طَغَى } أي: جاوز الحدّ في العصيان { وآثر الحياةَ الدنيا } الفانية، فانهمك فيما متع به فيها، ولم يستعد للحياة الآخرة الأبدية بالإيمان والطاعة، { فإِنَّ الجحيم } التي ذكر شأنها { هي المأوى } أي: مأواه\n فاللام سادّة مسد الإضافة للعلم بأنَّ صاحب المأوى هو الطاغي، وجملة \" فأمّا \": جواب \" إذا \" على طريقة:\n\n[البقرة:38]، وقيل: جواب \" إذا \" محذوف، وهي تفصيل له، أي: إذا جاءت انقسم الناس على قسمين، فأمّا مَن طغى\n\n الخ، والذي يستدعيه فخامة التنزُّل، ويقتضيه مقام التهويل أنَّ الجواب المحذوف تقديره: يكون من عظائم الشؤون ما لم تُشاهده العيون، ثم فصَّل أحوال الناس بقوله: فأمّا\n\n الخ\n { وأمّا مَن خاف مَقامَ ربه } أي: مُقامه بين يدي مالك أمره يوم الطامة الكبرى، يوم يتذكر الإنسانُ ما سعى\n { ونهى النفسَ عن الهوى } المُرْدِيِّ، أي: زجرها عن اتّباع الشهوات الفانية، ولم يعتد بمتاع الحياة الدنيا وزهرتها، ولم يغتر بزخارفها وزينتها، علماً منه بوَخَامة عاقبتها، وقيل: هو الرجل يهم بالمعصية فيتذكّر مقامه للحساب فيتركها\n\n\nوالهوى: ميل النفس إلى ما تهوى من غير تقييد بالشريعة، { فإِنَّ الجنة هي المأوى } له لا لغيره، وسيأتي تحقيقه في الإشارة\n الإشارة: فإذا جاءت الطامة، وهو التجلَّي الجلالي الذي لايعرفه فيه إلاّ الرجال، يومئذ يتذكر الإنسان ما سعى فيه من علم التوحيد، فمَن كان عارفاً بالله في جميع الأشياء عرفه في جميع التجليات، كيفما تلوّنت، ومَن كان قاصراً في المعرفة في البعض وأنكره في البعض، كما في حديث القيامة، حيث يتجلّى لبعض عباده في صورة لا يعرفونها، فيُنكرونه، ويقولون، هذا موضعنا حتى يأتينا ربنا، ثم يتجلّى لهم في صورة يعرفونها، فيُقرونه، وهذا لقصورهم في المعرفة، ولو عرفوا الله في جميع تجلياته ما أنكروه في شيء منها، وبُرّزت الجحيم لمَن يرى، أي: وبُرّزت حينئذ نار القطيعة لمَن يرى\n قال القشيري: أي: ظهرت جحيم الحجاب لمَن يراه غيرَ الأشياء، فإنه عين الأشياء في جميع التجليات، الجمالية والجلالية، العلوية والسفلية، الصورية والمعنوية\n هـ\n فأمَّا مَن طغى وتبع هواه، وآثر الحياة الدنيا، والاشتغال بها عن الإقبال على الله، فإنَّ الجحيم هي المأوى، أي: جحيم الحرمان عن مشاهدة الرحمن، وأمّا مَن خاف مقام ربه، أي: قيام ربه بالأشياء، أو على الأشياء، واطلاعه عليها، أو قيامه بين يدي الله غداً للحساب، فالأول لأهل المشاهدة، والثاني لأهل المراقبة، والثالث لأهل المحاسبة، ونهى النفسَ عن الهوى، عن كل ما يشغل عن الله، ويُقسي القلبَ عن ذكر مولاه، مما تهواه النفوس، فإنّ الجنة هي المأوى، جنة المعارف لمَن ترك ما تهوى نفسُه من المباحات، وجنة الزخارف لمَن ترك ما تهواه من المحرّمات\n قال الورتجبي: خاطب تعالى العبادَ بهذه الآية في أوائل مقاماتهم، حين وجب عليهم ترك النفوس، وشرَه هواها، والميل إلى حظوظها، لأنهم في وقت قصودهم إلى الله لا يجوز لهم الرخص والرفاهية، فقد وجب عليهم الإعراض عن حظوظ أنفسهم، خوفاً من الاحتجاب عن الوصول إلى الله تعالى، ولعلمهم بأنه محيط بحركات شهوات نفوسهم الخفية، حين تميل بخفاياها إلى مرادها دون الله، فإذا جادوها وقهروها بتأييد الله أوصلهم الله مقامَ مشاهدته، وهي جنة العارفين، فإذا ترقُّوا إلى درجات المعرفة لم يحتاجوا إلى قهر النفس عن الهوى، فإنّ نفوسهم وأجسامهم وشياطينهم صارت روحانية، فجانست الأرواح الملكوتية، فشهوات نفوسهم هناك من تواثير حلاوة أرواحهم في مشاهدة الحق، فتشتهي الأنفسُ ما تشتهي الأرواحُ في الغيوب والعقول والقلوب، فيضطرهم هناك إلى كل شيء يكون للنفوس والأرواح، جنات تظهر فيها أنوار شهود الحق، وأين الكافر والمعطِّل والمدّعِي من هذا المقام؟ وهم خلقوا من الجهالة، فيموتون في الضلالة، وأصحاب القلوب والمعارف عيش أرواحهم عيش الربانيين، وعيش نفوسهم عيش الجنّانيين ـ أي أهل الجنة الحسية ـ والله قادر بذلك يختص برحمته مَن يشاء، ولهذا قال عليه الصلاة والسلام:\n\n \" أسلم شيطاني \" \n\nوقال:\n\n \" نحن معاشر الأنبياء أجسادنا روح \" \n\nثم قال عن سهل: لا يَسلم من الهوى إلاَّ الأنبياء وبعض الصدّيقين، ليس كلهم، وإنما يسلم من الهوى مَن ألزم نفسه الأدب\n هـ\n قلت: الذي يُلزم نفسه الأدب هو الذي ينزل إلى سماء الحقوق أو أرض الحظوظ بالإذن والتمكين والرسوخ في اليقين، وقليل ما هم\n ذم ذكر سؤالهم عن الطامة، فقال: { يَسْأَلُونَكَ عَنِ ٱلسَّاعَةِ أَيَّانَ مُرْسَاهَا }\n\n",
      "translations": []
    }
  ]
}