{
  "chapter": "النازعات",
  "text": "كانهم يوم يرونها لم يلبثوا۟ الا عشية او ضحىها",
  "translations": [
    {
      "translation": "On the Day they see it, it will be as if they had only lingered for the evening or the morning of a single day.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day they see it, it will seem they had stayed in the world but only an evening or its turning into dawn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day they see it, they will feel as though they had stayed (in the grave) no more than one evening or one morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when they see it, it will seem to them as though they had only lived in the world for a morning and an afternoon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day when they will see it, it will seem as if they had not stayed on earth except for an evening or its morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day they see it (it will be) as if they had not tarried (in this world) except an (`Ashiyyah) afternoon or its (Duha) morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day that they see it, it will be as though they had not tarried but the latter part of a day or the early part of it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It shall be as if; on the day they see it, they have but tarried for an evening, or its forenoon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the day when they behold it, it will be as if they had but tarried for an evening or the morn thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when they see it, they will feel as if they had tarried in this world for only one evening or one morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day whereon they behold it, it will appear to them as though they had not tarried save an evening or the morn thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The day they see it, it shall be as if they had not stayed [in the world] except for an evening or forenoon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day they see it, (It will be) as if they had tarried but a single evening, or (at most till) the following morn!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Day they see it, (it will be) as if they had not tarried (in this world) except an afternoon or a morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when they behold it, it will be as if they had lingered but an evening, or, a morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On the Day when they witness it—as though they only stayed an evening, or its morning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It will be, on the Day they see it, as though they had not remained [in the world] except for an afternoon or a morning thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[79:46] The day they see it, it will be as if they had only tarried, in their graves, for an evening or the morning thereof, that is to say, [as if only] one evening of a day or its morning (the annexation of duhā, ‘morning’, to ‘ashiyya, ‘evening’, is valid, on the basis of their contiguity, since both constitute either side of the day; the annexation has also allowed for the word to fall in harmony with the end-rhyme of the verses).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(On the day when they behold it) i.e. the Hour, (it will be as if they had but tarried) in the graves (for an evening) the duration of an evening (or the morn thereof) or the duration of one morning'. And of the surah in which the Blind Man is mentioned, which is all Meccan and consists of 40 verses, 133 words and 533 letters: Surah 80: The Frowned ('Abasa) And of the surah in which the Blind Man is mentioned, which is all Meccan and consists of 40 verses, 133 words and 533 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "93:1",
      "similarity": 0.6432229336536291
    },
    {
      "verse": "91:1",
      "similarity": 0.600944949093595
    },
    {
      "verse": "20:59",
      "similarity": 0.5739441086569713
    },
    {
      "verse": "7:98",
      "similarity": 0.5270673643426351
    },
    {
      "verse": "20:119",
      "similarity": 0.36629465829149643
    }
  ]
}