{
  "chapter": "النازعات",
  "text": "يسـلونك عن الساعة ايان مرسىها",
  "translations": [
    {
      "translation": "They ask you: \"When will the Hour be? When is its time fixed?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the Hour: “When will it be?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), they ask you, \"When will the Hour of Doom come?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They (the disbelievers) ask you regarding the Last Day, as to when is its appointed time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the Hour when will be its appointed time\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the hour, when it will come.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will question thee concerning the Hour, when it shall berth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee of the Hour: when will it come to port?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will ask you [Prophet] about the Hour, saying, \"When it will come to pass?\",\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They question thee of the Hour:'when will its arrival be?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you concerning the Hour, “When will it set in,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee about the Hour,-'When will be its appointed time?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you (O Muhammad (Peace be upon him)) about the Hour, - when will be its appointed time?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will question you about the Hour: 'When shall it be'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the Hour, “When will it take place?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you, [O Muhammad], about the Hour: when is its arrival?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[79:42] They, that is, the disbelievers of Mecca, will ask you about the Hour: when will it set in?, when will it come to pass and when will it begin?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They ask thee) the disbelievers of Mecca ask you, Muhammad, (of the Hour) about the advent of the Hour: (when will it come to port?) When is it going to happen? Because they disbelieved in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَسْأَلُونَكَ عَنِ ٱلسَّاعَةِ أَيَّانَ مُرْسَاهَا } معناه متى زمانُها؟ ويقالُ: مُنتهاها\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { يَسْأَلُونَكَ } يا أكمل الرسل { عَنِ ٱلسَّاعَةِ } وقيامها التي هي من جملة الغيوب التي لا نطلع عن درجاتها ومقاماتها أحداً عليها: { أَيَّانَ مُرْسَٰهَا } [النازعات: 42] أي: متى إرساؤها وإقامتها، وفي أيّ آن إتيانها وقيامها، عيِّن لناوقتها؟\n\n\n\n\n{ فِيمَ أَنتَ مِن ذِكْرَٰهَا } [النازعات: 43] أي: أنت في أيّ شيء وشأن منها أن تذكر لهم وقتها، أو تعينها، مع أنَّا لا نطلعك على وقتها، سوى أنَّا أوحينا لك آنيتها وثبوتها، وتحقق قيامها، فما لك إلاَّ تبليغ ما يُوحى إليك؟!\n\n\n\nبل { إِلَىٰ رَبِّكَ مُنتَهَٰهَآ } [النازعات: 44] أي: منتهى علمها، وتعيين وقتها إنما هو مفوّض إلى حضرة علم الله، موكول إلى لوح قضائه\n\n\n\n\n{ إِنَّمَآ أَنتَ مُنذِرُ مَن يَخْشَٰهَا } [النازعات: 45] أي: أنت ما تُبعث إلاَّ؛ لإنذار الخائفين الموفقين على الخوف من أهوالها وأفزاعها، لا من المقدِّرين المعيِّنين لوقتها،\n\n\n\nكيف يسع لك هذا التعيين التقدير؛ إذ هي من جملة الغيوب التي استأثر الله بها، ولم يطلع أحداً عليها؟!\n\n\n\nثمَّ قال سبحانه تهويلاً على المنكرين: { كَأَنَّهُمْ يَوْمَ يَرَوْنَهَا } ويعاينون قيامها تيقنوا حينئذٍ على سبيل الجزم أنهم { لَمْ يَلْبَثُوۤاْ } ولم يمكثوا في دار الدنيا { إِلاَّ عَشِيَّةً } أي: يوم { أَوْ ضُحَٰهَا } [النازعات: 46] أي: ضحى تلك المعيشة؛ يعني: يستقصرون مدة لبثهم في الدنيا بالنسبة إلى هو يوم القيامة وطولها\n\n\n\n\nنعوذ بك من النار وما قرب إليها يا غفَّار\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها المحمدي المحقق، الموقِن بقيام الساعة وما فيها من الثواب والعقاب والجنة والنار أن تزرع في محرثك هذا ما ستحصده هناك من بذور الأعمال الصالحة، والأخلاق المرضية، والأطوار المحمودة، وسائر السنن والآداب المقبولة المأثورة من النبي المختار، وعترته الأخيار الأطهار، لا بدَّ لك أن تكون على ذكر من قيامها وأهوالها في عموم أحوالك\n\n\n\n\nوإياك إياك الاغترار بالحياة المستعارة، والالتفات إلى مزخرفات الدنيا الغدارة المكارة، فإنها تمكر بك وتغويك، وتضلك عن طريق الحق وترديك\n\n\n\n\nفعليك ألاَّ تتبع بغوائلها، ولا تنخدع بمخائلها؛ حتى لا تكون من زمرة الخاسرين الذين خسروا أنفسهم وأهليهم يوم القيامة\n\n[الزمر: 15]\n\n\n\n\nجعلنا الله من زمة الآمنين الفائزين، المستبشرين الذين لا خوف عليهم ولا هم يحزنون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحق جلّ جلاله: { يسألونك عن الساعةِ أيّان مُرْسَاها } أي: متى إرساؤها، أي: إقامتها، يُريدون: متى يُقيمها الله تعالى ويكوّنها، وقيل: إيّان منتهاها ومستقرها، كما أنّ مرسى السفينة المحل التي تنتهي إليه وتستقر فيه، { فِيمَ أنتَ مِن ذِكراها } أيّ: في أي شيء أنت مِن أن تذكر وقتها لهم وتعلمهم به؟ أي: ما أنت من ذكراها وتبيين وقتها لهم في شيءٍ حتى يسألونك بيانها، إنما أنت نذير بها، كقولك: ليس فلان من العلم في شيءٍ وهو إنكار ورد لسؤال المشركين عنها، لأنَّ علمها مما استأثر به علاّم الغيوب وقيل: كان رسولُ الله صلى الله عليه وسلم لم يزل يذكر الساعة ويسأل عنها حتى نزلت، فكفّ، فهو على هذا تعجيب من كثرة ذكره لها، أي: أنت في شُغل وأي شغل أنت من الاهتمام بالسؤال عنها\n وقالت عائشة رضي الله عنها: كان صلى الله عليه وسلم يسأل عن الساعة كثيراً، فما نزلت هذه الآية انتهى عن ذلك\n ولا يرده قوله:\n\n[الأعراف:187] أي: إنهم يزعمون أنك مُبالغ في السؤال عنها حتى علمتها ولست كما يزعمون، لأنّا نقول هذه الآية نزلت قبل تلك، وأنه كان أولاً يسأل عنها حتى نُهي بهذه الآية فانتهى، كما ذكر في الحديث المذكور، فنزلت تلك مخبرة عن حاله بعد انتهائه\n والله أعلم\n قال القشيري: من أين لك علمها ولم نعلمك بذلك، وقيل: يوقف على قوله: \" فِيمَ \" أي: هذا السؤال الذي يسألونك فيم، أي: في أي شيء هو، فيكون إنكاراً لسؤالهم، ثم ابتدأ: \" مِن ذكراها \" أي: إن ظهورك وبعثك وأنت خاتم النبيين من جملة ذكراها، أي: أشراطها وعلامتها، ومؤذن بقيامها، فلا حاجة لسؤالهم عنها، ويرده: عدم الإتيان بهاء السكت، ويجاب: بأنه ليس بلازم، وإنما تَلزمُ فيما جرّ بإضافة اسم، لبقائه على حرف واحد، كما هو مقرر في محله، مع عدم ثبوته في المصحف\n ثم أومأ تعالى إلى أنه مختص بحقيقة علمها، فقال: { إِلى ربك منتهاها } منتهى علمها متى يكون، لا يعلمها غيره، { إِنما أنت منذرُ من يخشاها } أي: لم تُبعث لتُعلمهم وقت الساعة، وإنما بُعثت لتُخوّف مِن أهوالها مَن يخاف شدائدها، { كأنهم يوم يرونها } أي: الساعة { لم يَلبثوا } في الدنيا { إِلاَّ عشيةً أو ضُحاها } أي: ضحى العشية، استقلُّوا مدّة لبثهم في الدنيا لما عاينوا من الهول، كقوله:\n\n[الأحقاف:35] وإنما صحّ إضافة الضحى إلى العشية للملابسة، لاجتماعهما في نهارٍ واحد، والمراد: أن مدة لبثهم لم تبلغ يوماً كاملاً، ولكن أحد طرفي النهار عشية يومٍ واحدٍ أوضحاه\n وقال أبو السعود: الآية إما تقرير وتأكيد لما يُنبىء عنه الإنذار من سرعة مجيء المنذَر به، أي: كأنهم يوم يرونها لم يلبثوا بعد الإنذار إلاّ عشية يوم واحد أو ضحاه، فلما ترك اليوم أضيف ضحاه إلى عشيته\n\n\nوإمّا رد لما أدمجوه في سؤالهم فإنهم كانوا يسألون عنها بطريق الاستهزاء مسعجلين لها، فالمعنى: كأنهم يوم يرونها لم يلبثوا بعد الوعيد بها إلاّ عشية أو ضُحاها، واعتبار كون اللبث في القبور أو في الدنيا لا يقتضيه المقام، وإنما الذي يقتضيه اعتبار كونه بعد الإنذار، أو بعد الوعيد، تحقيقاً للإنذار، وردًّا لاستبطائهم\n والجملة على الأول: حال من الموصول، فإنه على تقدير الإضافة وعلى عدمها مفعول لمُنذر، كما أنَّ قوله تعالى:\n\n[يونس:45] حال من الضمير في \" نحشرهم \" أي: نحشرهم مشبّهين بمَن لم يلبث في الدنيا إلاّ ساعة من النهار، خلا أن التشبيه هناك في الأحوال الظاهرة من الزي والهيئة، وفيما نحن فيه من الاعتقاد، كأنه قيل: عِدْهم مشبهين يوم يرونها في الاعتقاد بمَن لم يلبث بعد الإنذار بها إلاّ تلك المدة اليسيرة، وعلى الثاني: مستأنفة، لا محل لها من الإعراب\n هـ\n الإشارة: يسألونك أيها العارف عن الساعة التي يفتح الله فيها على المتوجِّه بالدخول في مقام الفناء في الذات، أيَّان مُرْساها، إنما أنت منذر مَن يخشى فواتها، أي: إنما أنت مُبَيّن الطريق التي توصل إليها، وتُخوِّف من العوائق التي تعوق عنها، وليس مِن وظيفتك الإعلام بوقتها، لأنها موهبة من الكريم الوهّاب كأنهم يوم يرونها لم يلبثوا إلاّ عشية أو ضحاها، أي: يستصغرون مدة مجاهدتهم وسيرهم في جانب عظمها\n وبالله التوفيق، وصلى الله على سيدنا محمد وآله وصحبه، وسلّم\n\n",
      "translations": []
    }
  ]
}