{
  "chapter": "النازعات",
  "text": "فالسبقت سبقا",
  "translations": [
    {
      "translation": "Then outpace the others swiftly\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and vie with the others (in carrying out their Lord's behests);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "by the angels who hasten along\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who quickly present themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And by the racers, racing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then those who are foremost going ahead,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and those that outstrip suddenly\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "By the angels hastening,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "by those that outstrip them suddenly,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And then they speed with foremost speed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "by those who, racing, take the lead,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then press forward as in a race,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And by those that press forward as in a race (i.e. the angels or stars or the horses, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and the outstrippers (angels), outstripping,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who race swiftly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who race each other in a race\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[79:4] by those that race forward, [by] the angels who race forward to Paradise with the souls of believers;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(By the angels hastening) and He swears by the angels who hasten to Paradise with the souls of the believers and to the Fire with the souls of the disbelievers; it is also said this refers to the souls of the believers that hasten to Paradise,\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n ويقالُ: هي السّفنُ { فَٱلسَّابِقَاتِ سَبْقاً } معناه الخَيلُ { فَٱلْمُدَبِّرَاتِ أَمْراً } معناه المَلائكةُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَٱلسَّابِقَاتِ } أي: النفوس الفانية في الله، الباقية ببقائه، المبادرة إلى الخروج قبل نزول النازعات { سَبْقاً } [النازعات: 4] لكمال شوقهم وانبعاثهم، وتجرُّدهم عن ملابس عالم الناسوت، وانخلاعهم عن مقتضيات الطبيعة والأركان قبل حلول الأجل، وهجوم المخرجات المخلِّصات\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n شبّه سرعة سيرهم بسبح الهوام، أو يسبحون في إخراجها سبح الغواص الذي يخرج من البحر ما يخرج، { فالسابقاتِ سبقًا } فيسبقون بأرواح الكفرة إلى النار، وبأرواح المؤمنين إلى الجنة، { فالمُدبراتِ أَمْراً } تُدبر أمر عقَابها وثوابها، بأن تهيئها لإدراك ما أعدّ لها من الآلام والثواب، أو السابحات التي تسبح في مضيها، فتسبق إلى ما أمروا به، فتدبر أمراً من أمور العباد، مما يصلحهم في دينهم ودنياهم كما رُسم لهم\n أو: يكون تعالى أَقْسَم بالنجوم التي تنزع من المشرق إلى المغرب، غرقاً في النزع، بأن تقطع الفلك حتى تنحطّ في أقصى المغرب، وتنشط من برج إلى برج، أي: تخرج، من: نَشط الثور: إذا خرج من بلد إلى بلد، وتَسْبح في الفلك فتسبق بعضها بعضاً فتُدبر أمراً نِيط بها، كاختلاف الفصول، وتقدير الأزمنة، وتدبير مواقيت العبادة، وحيث كانت حركاتها من المشرق إلى المغرب قسرية ـ أي: قهرية - وحركاتها من برج إلى برج ملائمةً عبَّر عن الأولى بالنزع، وعن الثانية بالنشط\n أو: بأنفس الغُزاة، أو: بأيديهم التي تنزع القِسي، بإغراق السهام، وينشطون بالسهم إلى الرمي، ويَسْبحون في البر والبحر، فيسبقون إلى حرب العدو، فيُدبرون أمرها، أو: بصفات خيلهم، فإنها تنزع في أعنّتها نزعاً تغرق فيه الأعنّة لطول أعناقها، لأنها عراب، وتخرج من دار الإسلام إلى دار الحرب، وتَسْبح في جريها، فتسبق إلى العدو فتدبر أمر الظفر والغلبة\n وسيأتي في الإشارة أحسن هذه الأقوال إن شاء الله\n وانتصاب \" نشطاً \" و \" سَبْحاً \" و \" سبقاً \" على المصدرية، وأما \" أمراً \" فمفعول به، وتنكيره للتهويل والتفخيم\n والعطف مع اتحاد الكل لتنزيل التغاير العنواني منزلة المتغاير الذاتي للإشعار بأنَّ كل واحدٍ من الأوصاف المعدودة من معظّمات الأمور، حقيق بأن يكون حياله مناطاً لاستحقاق موصوفه للإجلال والإعظام بالإقسام من غير انضمام أوصاف الآخر إليه\n\n\nوالفاء في الأخيرين للدلالة على ترتيبهما على ما قبلهما بلا مهلة\n والمقسم عليه محذوف، تعويلاً على إشارة ما قبله من المقسم به إليه، ودلالة ما بعد من أحوال القيامة عليه، فإنَّ الإقسام بمَن يتولى نزع الأرواح، ويقوم بتدبيرها، يلُوح بكون المقسم عليه مِن قبل تلك الأمور لا محالة، ففيه من الجزالة ما لا يخفى",
      "translations": []
    }
  ]
}