{
  "chapter": "النازعات",
  "text": "قلوب يومئذ واجفة",
  "translations": [
    {
      "translation": "hearts that Day will be pounding",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hearts will pound loudly on that day,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day some hearts shall tremble (with fright),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "hearts will undergo terrible trembling,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many a heart will flutter on that day!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hearts that Day will tremble.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hearts on that day shall palpitate,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "hearts upon that day shall be athrob\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that day hearts beat painfully\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "hearts will be throbbing,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hearts on that Day will be throbbing;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "hearts will be trembling on that day,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hearts that Day will be in agitation;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Some) hearts that Day will shake with fear and anxiety.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "hearts will throb on that Day\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hearts on that Day will be pounding.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hearts, that Day, will tremble,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[79:8] on that day hearts will be trembling, frightened and anxious,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "726 (On that day) which is the Day of Judgement (hearts beat painfully) the hearts are fearful\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { قُلُوبٌ يَوْمَئِذٍ وَاجِفَةٌ } معناه خَائفةٌ { أَبْصَارُهَا خَاشِعَةٌ } أي مُتواضعةٌ ذَليلةٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nومن شدة الهول ونهاية الفزع { قُلُوبٌ يَوْمَئِذٍ وَاجِفَةٌ } [النازعات: 8] قلقة حائرة، شديدة الاضطراب\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قلوبٌ يومئذٍ } ، وهي قلوب منكري البعث، { واجفةٌ } مضطربة، من: الوجيف، وهو الاضطراب، { أبصارُها } أي: أبصار أصحابها { خاشعةٌ } ذليلة لهول ما ترى، { يقولون } أي: منكرو البعث في الدنيا استهزاءً وإنكاراً للبعث: { أئنا لمردودون في الحافرة } ، استفهام بمعنى الإنكار، أي: أنُردّ بعد موتنا إلى أول الأمر، فنعود أحياءً كما كنا؟ والحافرة: الحالة الأولى، يُقال لمَن كان في أمر فخرج منه ثم عاد إليه: رجع إلى حافرته، أي: إلى حالته الأولى، يُقال: لمَن كان في أمر فخرج منه ثم عاد إليه: رجع إلى حافرته أي: إلى حالته الأولى ويُقال: رجع في حافرته، أي: طريقته التي جاء فيها، فحفر فيها، أي: أثر فيها بمشيه، وتسميتها حافرة مع أنها محفورة، كقوله:\n\n[الحاقة:21] على تسمية القابل بالفاعل\n أنكروا البعث ثم زادوا استبعاداً فقالوا: { أئذا كنا عظاماً نخرةً } بالية\n ونخرة أبلغ من ناخرة لأنَّ \" فَعِلٌ \" أبلغ من فاعل، يقال: نَخِرَ العظم فهو نَخِرٌ وناخر: بِلَى، فالنَخِر هو البالي الأجوف الذي تمر به الريح فيسمع له نخير، أي: أنُرد إلى البعث بعد أن صرنا عظاماً بالية؟\n و \" إذا \" منصوب بمحذوف، وهو: أنُبعث إذا كنا عظاماً بالية مع كونها أبعد شيء في الحياة\n { قالوا } أي: منكروا البعث، وهو حكاية لكفر آخر، متفرع على كفرهم السابق، ولعل توسيط \" قالوا \" بينهما للإيذان بأنّ صدور هذا الكفر عنه ليس بطريق الاطراد والاستمرار مثل كفرهم الأول المستمر صدوره عنهم في كافة أوقاتهم، حسبما يُنبىء عنه حكايته بصيغة المضارع، أي: قالوا بطريق الاستهزاء، مُشيرين إلى ما أنكروه من الرد في الحافرة، مشعرين بغاية بُعدها من الوقوع: { تلك إِذاً كرةٌ خاسرةٌ } أي: رجفة ذات خسران، أو خاسر أصحابها، والمعنى: أنها إن صحّت وبُعثنا فنحن إذاً خاسرون لتكذيبنا بها، وهذا استهزاءُ منهم\n قال تعالى في إبطال ما أنكروه: { فإِنما هي زجرةٌ واحدة } أي: لا تحسبوا تلك الكرّة صعبة على الله، بل هي أسهل شيء، فما هي إلاّ صيحة واحدة، يُريد النفخة الثانية من قولهم: زَجَر البعير: إذا صاح عليه\n\n\n{ فإِذا هم بالسَّاهرةِ } أي: فإذا هم أحياء على وجه الأرض، بعدما كانوا أمواتاً في جوفها\n والساهرة: الأرض البيضاء المستوية، سُميت بذلك، لأنَّ السراب يجري فيها، من قولهم: عين ساهرة جارية، وفي ضدها: عين نائمة، وقيل: إنَّ سالكها لا ينام خوف الهلكة، وقيل: أرض بعينها بالشام إلى جنب بيت المقدس، وقيل: أرض مكة\n وقيل: اسم لجهنّم\n وعن ابن عباس: أنَّ الساهرة: أرض مِن فضة، لم يُعص اللهَ تعالى عليها قط، خلقها حينئذ\n وقيل: أرض يُجددها الله تعالى يوم القيامة\n وقيل: الأرض السابعة، يأتي الله بها يوم القيامة فيُحاسب عليها الخلائق، وذلك حين تُبدل الأرض غير الأرض، وقيل: الساهرة: أرض صحراء على شفير جهنم\n والله تعالى أعلم\n الإشارة: والأرواح النازعات عن ملاحظة السِّوى غرقاً في بحار الأحدية\n والناشطات من علائق الدنيا ومتابعة الهوى نشطاً، والسابحات بأفكارها في بحر أنوار الملكوت، وأسرار الجبروت، سبحاً، فالسابقات إلى حضرة القدس سبقاً، فالمدبرات أمر الكون، بالتصرُّف فيه بالنيابة عن الحق، وهو مقام القطبانية، أو النازعات عن الحظوظ والشهوات غرقاً في التجرُّد إلى العبادات بأنواع الطاعات\n وهذه أنفس العُبّاد، والناشطات عن الدنيا، وأهلها فراراً إلى الله نشطاً، وهي أنفس الزُهّاد والسابحات بعقولها في أسرار العلوم، فتستخرج من الكتاب والسنة درراً ويواقيت، يقع النفع بها إلى يوم الدين، وهي أنفس العلماء الجهابذة، فالسابقات إلى الله بأنواع المجاهدات والسير في المقامات، حتى أفضت إلى شهود الحق عياناً، سبقاً، وهي أنفس الأولياء العارفين، فالمُدبرات أمر الخلائق بقسم أرزاقها وأقواتها ورتبها، وهي أنفس الأقطاب والغوث\n وقال البيضاوي: هذه صفات النفوس وحال سلوكها، فإنها تنزع من الشهوات، وتنشط إلى عالم القدس، فتسْبَح في مراتب الارتقاء، فتسبق إلى الكمالات، حتى تصير من المكمِّلات، زاد الإمام: فتُدبْر أمر الدعوة إلى الله\n وقال الورتجبي: إشارة النازعات إلى صولات صدمات تجلي العظمة، فتنزع الأرواح العاشقة عن معادن الحدوثية\n ثم قال: والناشطات: الأرواح الشائقة تخرج من أشباحها بالنشاط، حين عاينت جمال الحق بالبديهة وقت الكشف\n ثم قال: والسابحات تسْبَح في بحار ملكوته وقاموس كبرياء جبروته، تطلب فيها أسرار الأولية والآخرية والظاهرية والباطنية، فالسابقات في مصاعدها عالم الملكوت وجنات الجبروت، تُسابق كل همة فالمدبِّرات هي العقول القدسية تُدَبّر أمور العبودية بشرائط إلهام الحقيقة\n هـ\n والمقسَم عليه: ليبعَثن اللهُ الأرواحَ الميتة بالجهل والغفلة، حين تنتبه إلى السير بالذكر والمجاهدة، فإذا حييت بمعرفة الله كانت حياة أبدية\n وذلك يوم ترجف النفس الراجفة، وذلك حين تتقدّم لخرق عوائدها ومخالفة هواها، تتبعها الرادفة، وهي ظهور أنوار المشاهدة، فحينئذ تُبعث من موتها، وتحيا حياة لا موت بعدها، وأمّا الموت الحسي فإنما هو انتقال من مقام إلى مقام\n قلوب يومئذ ـ أي: يوم المجاهدة والمكابدة ـ واجفة، لا تسكن حتى تُشاهد الحبيب، أبصارُها في حال السير خاشعة لا يُخلع عليها خلعُ العز حتى تصل\n\n\nيقول أهل الإنكار لهذه الطريق: أئِنا لمردودون إلى الحالة الأولى، التي كانت الأرواح عليها في الأزل، بعد أن كنا ميتين بالجهالة، مُرْمى بنا في مزابل الغفلة، كعِظام الموتى، قالوا: تلك كرة خاسرة، لزعمهم أنهم إذا صاروا إلى هذا المقام لم يبقَ لهم تمتُّع بشيء أصلاً، مع أنَّ العارف إذا تحقق وصوله تمتع بالنعيمين نعيم الأشباح ونعيم الأرواح\n قال تعالى في رد ما استحالوه: فإنما هي زجرة واحدة من همة عارف، أو نظرة وليّ كامل، فإذا هم في أرض الحضرة القدسية\n قال الشيخ أو العباس: والله ما بيني وبين الرجل إلاَّ أن أنظر إليه وقد أغنيته\n قلت: والله لقد بقي في زماننا هذا مَن يفوق أبا العباس والشاذلي وأضرابهما في الإغناء بالنظرة والملاحظة، والحمد لله\n ولمّا تَقَدّم إنكارهم البعثَ وتمردهم على الرسول، قصَّ عليه قصةَ موسى وتمردَ فرعون على الله، حتى ادّعى الألوهية، تسلية له عليه الصلاة والسلام، فقال: { هَلْ أَتَاكَ حَدِيثُ مُوسَىٰ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "59:6",
      "similarity": 0.7094323446504068
    },
    {
      "verse": "37:84",
      "similarity": 0.03702047527008843
    },
    {
      "verse": "33:12",
      "similarity": 0.03095869915003575
    },
    {
      "verse": "9:77",
      "similarity": 0.030184827830094383
    },
    {
      "verse": "9:45",
      "similarity": 0.0296750249453806
    }
  ]
}