{
  "chapter": "الأعراف",
  "text": "المص",
  "translations": [
    {
      "translation": "Alif Lam Mim Sad.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Mim Sad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Lam-Mim-Sad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif. Lam. Mim. Sad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Laam-Meem-Saad. (Alphabets of the Arabic language; Allah and to whomever He reveals, know their precise meanings.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Lam-Mim-Sad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Mim Suad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Mim Sad\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif. Lam. Mim. Sad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif Lam Mim Sad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Lam-Mim-Suad,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif, Lam, Mim, Suad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif, Lam, Mim, Sad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif-Lam-Mim-Sad. [These letters are one of the miracles of the Quran and none but Allah (Alone) knows their meanings].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "AlifLaamMeemSaad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif, Lam, Meem, Saad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Alif, Lam, Meem, Sad.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:1] Alif Lām Mīm Sād: God knows best what He means by these [letters].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذه الحروف الأربعة المقطّعة التي افتتحت بها هاته السّورة ، يُنطَق بأسمائها ( ألِفْ لاَمْ مِيمْ صَادْ ) كما يَنْطِق بالحروف ملقِّن المتعلّمين للهجاء في المكتب ، لأنّ المقصود بها أسماء الحروف لا مسميّاتها وأشكالها ، كما أنّك إذا أخبرت عن أحد بخبر تذكر اسم المخبر عنه دون أن تَعْرِض صورته أو ذاته ، فتقولُ مثلاً : لقيت زيداً ، ولا تقول : لقيت هذه الصورة ، ولا لقيتُ هذه الذات .فالنّطق بأسماء الحروف هو مقتضَى وقوعها في أوائل السّور التي افتتحت بها ، لقصد التّعريض بتعجيز الذين أنكروا نزول القرآن من عند الله تعالى ، أي تعجيزِ بلغائهم عن معارضته بمثله كما تقدّم في سورة البقرة .وإنّما رسموها في المصاحف بصور الحروف دون أسمائها ، أي بمسمّيات الحروف التي يُنطق بأسمائها ولم يرسموها بما تُقْرأ به أسماؤُها ، مراعاة لحالة التّهجي ( فيما أحسب ) ، أنّهم لو رسموها بالحروف التي يُنطق بها عند ذكر أسمائها خَشُوا أن يلتبس مجموعُ حروف الأسماءِ بكلمات مثل ( يَاسين ) ، لو رسمت بأسماء حروفها أن تلتبس بنداء من اسمه سين .فعدلوا إلى رسم الحروف علماً بأنّ القارىء في المصحف إذا وجد صورة الحرف نَطق باسم تلك الصّورة . على معتادهم في التّهجي طرداً للرسم على وتيرة واحدة .على أنّ رسم المصحف سنّة سنّها كُتاب المصاحف فأقِرّت . وإنّما العمدة في النّطق بالقرآن على الرّواية والتّلقي ، وما جُعلت كتابة المصحف إلاّ تذكرة وعوناً للمتلقّي .وتقدّم هذا في أوّل سورة البقرة وفيما هنا زيادة عليه .\n\n",
      "translations": [
        {
          "translation": "And on his authority from Ibn 'Abbas who said concerning Allah's saying (Alif. Lam Mim. Sad) Allah says: I am Allah Who knows best and is best; it is also said that this is an oath by which Allah swore.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nأَخبرنا أَبو جعفر، قالَ: حدّثنا علي بن أحمد، قال: أخبرنا عطاء بن السائب عن أبي خالد الواسطي عن زيد بن علي عليهما السلام في قولِه تعالى: { الۤمۤصۤ } معناه أنا الله أفصلُ و:\n\n[البقرة: 1] [آل عمران: 1] أنا الله أعلمُ و:\n\n[يونس: 1] أنا الله أَرى\n\n",
      "translations": [
        {
          "translation": "\n\nAbu Ja'far told us that Ali ibn Ahmad said that Ata' ibn al-Sa'ib told us on the authority of Abu Khalid al-Wasiti that Zayd ibn Ali said regarding the verse {al-Mis't}, \"It means that I am Allah, I am the One who separates.\"\n\n\n[The Qur'an: 1] [Al-'Imran: 1] I am Allah, I know best.\n\n\n\"I am God, I see.\"",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ المص كتاب أُنزل إليكَ } - إلى قوله - { ذكرى للمؤمنين } ا إشارة إلى الذات الأحدية\n و ل إلى الذات مع صفة العلم كما مرّ\n و م إلى التميمة الجامعة التي هي معنى محمد\n أي: نفسه وحقيقته\n و ص إلى الصورة المحمدية التي هي جسده وظاهره\n وعن ابن عباس\n أنه قال صلى الله عليه وسلم:\n \" جبل بمكة كان عليه عرش الرحمن حين لا ليل ولا نهار \" \n\n أشار بالجبل إلى جسد محمد\n وبعرش الرحمن إلى قلبه\n كما ورد في الحديث:\n \" قلب المؤمن عرش الله \" \nوجاء:\n \" لا يسعني أرضي ولا سمائي\n ويسعني قلب عبدي المؤمن \" \nوقوله:\n \" حين لا ليل ولا نهار \" \nإشارة منه إلى الوحدة\n لأن القلب إذا وقع في ظل أرض النفس واحتجب بظلمة صفاتها كان في الليل\n وإذا طلع عليه نور شمس الروح واستضاء بضوئه كان في النهار\n وإذا وصل إلى الوحدة الحقيقية بالمعرفة والشهود الذاتي واستوى عنده النور والظلمة كان وقته لا ليلاً ولا نهاراً\n ولا يكون عرش الرحمن إلا في هذا الوقت\n فمعنى الآية: إنّ وجود الكلّ من أوله إلى آخره { كتاب أُنْزِل إليك } أي: أنزل إليك علمه { فلا يكن في صدرك حرج منه } أي: ضيق من حمله\n فلا يسعه لعظمته فيتلاشى بالفناء في الوحدة والاستغراق في عين الجمع والذهول عن التفصيل\n إذ كان عليه السلام في مقام الفناء محجوباً بالحق عن الخلق كلما رد عليه الوجود\n وحجب عنه الشهود الذاتي وظهر عليه بالتفصيل\n ضاق عنه وعاؤه وارتكب عليه وزر وثقل\n ولهذا خوطب بقوله تعالى:\n[الشرح\n الآيات:1-2] بالوجود الموهوب الحقاني\n والاستقامة في البقاء بعد الفناء بالتمكين ليسع صدرك الجمع والتفصيل والحق والخلق",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ الۤمۤصۤ } [الأعراف: 1] أيها الإنسان الكامل اللائق لتكميل الخلائق المكرم المؤيد لإهدائهم إلى توحيد الذات والصفات والأفعال\n الصادق الصفي في نفسه عن كدورات أهل الزيع والضلال\n هذه الآثار والآيات اللطيفة اللائحة اللائقة لأن يسترشد منها ويستكشف عنها أرباب الذوق والكمال\n المنزهه عن شوائب الشكوك وظلمات الأوهام الصافية عن تخليطات العقول وتخمينات الأحلام الصالحة لأن يستبصر بها ويستشهد منها إلى توحيد العليم العلام المقدس السلام\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "إما أن تكون مختصرة من المصطفى، على عادة العشاق يرمزون إلى ذكر بعض حروف المحبوب، اتقاء الرقباء، أي: يا أيها المصطفى المختار لرسالتنا هذا كتاب أنزل إليك، وإما أن تشير إلى العوالم الثلاثة: الجبروت والملكوت والملك. وزاد هنا الصاد، إشارة إلى صدقه فيما يُخبر به من علم الغيوب، ولذلك ذكر هنا جملة من القصص والأخبار. وقال الورتجبي: كان الله ـ تبارك وتعالى ـ إذا أراد أن يتكلم مع نبيه محمد صلى الله عليه وسلم بقصص الأنبياء، وما جرى عليهم في الدهور والأعصار، وشأنه معهم في الأسرار والحقائق والشرائع، وأراد أن يخصه صلى الله عليه وسلم بشريعته، وما يكون من طريقته الخاصة إلى حضرته، ويخبره بما كان وما يكون، أشار إلى هذه الأشياء بحروف التهجي، واعلمه سر ذلك بخفي الإشارة ولطيف الخطاب، وعلم تعالى أنه ـ عليه الصلاة والسلام ـ يعرف بتلك الإشارة مراده من علم سابق، ونبأٍ صادق، وعلم تعالى أن عموم أمته لا تعرف تلك الإشارة، فعبَّر عنها بسورة طويلة من القرآن ليعرفوا مراده سبحانه من خطابه، وخواص أمته ربما تطلع على سر بعضها، كالصحابة والتابعين والمتقدمين من العلماء والأولياء، كأنَّ حروف المقطعات رموز ومعاني سور القرآن، لا يعرف تلك الرموز إلا الربانيون والأحبار من الصديقين. هـ. ثم ذكر حكمة إنزال الكتاب، فقال: { كِتَابٌ أُنزِلَ إِلَيْكَ فَلاَ يَكُنْ فِي صَدْرِكَ حَرَجٌ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007001.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007001.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:1.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}