{
  "chapter": "الأعراف",
  "text": "اولم يهد للذين يرثون الارض منۢ بعد اهلها ان لو نشاء اصبنهم بذنوبهم ونطبع على قلوبهم فهم لا يسمعون",
  "translations": [
    {
      "translation": "Is it not clear to those who have inherited the earth after these people that, if We wanted to, We could strike them for their wrong actions, sealing up their hearts so that they cannot hear?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do not the people who inherited the earth from the (earlier) inhabitants perceive that We could afflict them too for their sins if We pleased, and put seals on their hearts that they may not hear (the voice of truth)?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has it not, then, become plain to those who have inherited the earth in the wake of the former generations that, had We so willed, We could have afflicted them for their sins, (they, however, are heedless to basic facts and so) We seal their hearts so that they hear nothing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not a lesson for the successors of the past generations that had We wanted, We could have punished them for their sins, sealed their hearts and deprived them of hearing?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or did not those who inherited the land after its owners, get enough guidance that if We will, We can afflict them with calamity for their sins? And We set seals upon their hearts so they do not hear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not a guidance for those who inherit the earth from its previons inhabitants that had We willed, We would have punished them for their sins. And We seal up their hearts so that they hear not\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not clear to those who inherit the earth after its (former) residents that if We please We would afflict them on account of their faults and set a seal on their hearts so they would not hear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not a guidance to those who inherit the earth after those who inhabited it that, did We will, We would smite them because of their sins, sealing their hearts so they do not hear?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not an indication to those who inherit the land after its people (who thus reaped the consequence of evil-doing) that, if We will, We can smite them for their sins and print upon their hearts so that they hear not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does it not guide the people who inherit the land from former people that We can punish them for their sins if We will? And seal up their hearts so that they would not be able to lend an ear to words of guidance?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Guideth it not those who inherit the land after the people thereof, that, had We willed, We would have afflicted them for their sins? And We have put a seal upon their hearts, so that they hearken not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Does it not dawn upon those who inherited the earth after its [former] inhabitants that if We wish We will punish them for their sins, and set a seal on their hearts so they would not hear?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those who inherit the earth in succession to its (previous) possessors, is it not a guiding, (lesson) that, if We so willed, We could punish them (too) for their sins, and seal up their hearts so that they could not hear?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not clear to those who inherit the earth in succession from its (previous) possessors, that had We willed, We would have punished them for their sins. And We seal up their hearts so that they hear not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not plain to those who inherit the earth after its inhabitants that if We willed We could smite them for their sins and set a seal upon their hearts, so that they do not hear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Is it not guidance for those who inherit the land after its inhabitants, that if We willed, We could strike them for their sins? And seal up their hearts, so that they would not hear?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Has it not become clear to those who inherited the earth after its [previous] people that if We willed, We could afflict them for their sins? But We seal over their hearts so they do not hear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:100] Has it not been shown, [has it not] become clear, to those who inherit the earth, as a [place of] habitation, after, the destruction of, those who inhabited it that, (an is the softened form and constitutes the subject [of the verb], its noun having been omitted, in other words [understand it as] annahu), if We will, We could smite them, with chastisement, for their sins?, as We smote those before them? (the hamza in the four instances are meant to indicate rebuke, and the [particles] fa, ‘so’, and wa, ‘and’, which have been inserted in two instances [each], are meant to indicate a supplement; a variant reading [for a-wa-amina] has aw amina, ‘or do [they] feel secure’, in the [second] instance, as a supplement). And, We, seal up their hearts so that they do not hear, the admonition, in a way so as to reflect.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "168 (Is it not an indication) is it not clear (to those who inherit the land) the land of Mecca (after its people) after the destruction of its people (that, if We will, We can smite them) punish them (for their sins) as We punished nations before them (and print upon) such that We seal (their hearts so that they hear not) guidance and believe not in Muhammad (pbuh) or the Qur'an?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَوَلَمْ يَهْدِ لِلَّذِينَ يَرِثُونَ ٱلأَرْضَ } معناه أَوَلَمْ نُبيِّن لَهُمْ\n\n\n\n\nوقوله تعالى: { وَنَطْبَعُ عَلَىٰ قُلُوبِهِمْ } معناهُ نَخْتِمُ عَلَيهَا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Has He not shown guidance to those who inherit the earth?} This means, have We not shown them guidance?\n\n\nAnd His saying - {And We will imprint on their hearts} - means that We will seal them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوَلَمْ يَهْدِ } أي: ألم يذكروا ولم يبين الغيور أحوال الأمم الهالكة\n وأخذنا إياهم بما صدر عنهم من تكذيب الأنبياء؟ وما جاءوا به من عندنا من الأوامر والنواهي { لِلَّذِينَ يَرِثُونَ ٱلأَرْضَ } خلفاْ { مِن بَعْدِ أَهْلِهَآ } الهالكين بالجرائم المذكورة { أَن لَّوْ نَشَآءُ } بمقتضى قهرنا وجلالنا { أَصَبْنَاهُمْ } أي: الخلفاء أيضاً { بِذُنُوبِهِمْ } التي صدرت عنهم مثل أسلافهم\n بل بأضعاهم وآلافهم { وَ } من علامات أخذنا وانتقامنا عنهم: أنا { نَطْبَعُ } ونختم { عَلَىٰ قُلُوبِهِمْ } كيلا يفهموا\n ليعتبروا { فَهُمْ لاَ يَسْمَعُونَ } [الأعراف: 100] بسبب ذلك حتى يتعظوا به\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أن لو نشاء }: \" أن \" مخففة\n وهي وما بعدها: فاعل { يَهدِ } أي: أو لم يتبين لهم قدرتنا على إهلاكهم لو نشاء ذلك؟ وإنما عدى \" يهدي \" باللام لأنه بمعنى يتبين\n و { نطبع }: استئناف\n أي: ونحن نطبع على قلوبهم\n يقول الحقّ جلّ جلاله: { أوَ لم يهدِ } أي: يتبين { للذين يرثون الأرضَ من بعد أهلها } أي: يخلفون من قبلهم ويرثون ديارهم وأموالهم\n { أن لو نشاء أصبناهم } أي: أهلكناهم { بذنوبهم } بسبب ذنوبهم\n كم أهلكنا من قبلهم\n لكن أمهلناهم ولم نهملهم\n { و } نحن { نَطبَعُ على قلوبهم } بالغفلة والانهماك في العصيان\n { فهم لا يسمعون } سماع تدبر واعتبار",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "30:59",
      "similarity": 0.6223673638487276
    },
    {
      "verse": "16:108",
      "similarity": 0.5899892112721906
    },
    {
      "verse": "10:74",
      "similarity": 0.5567502982802373
    },
    {
      "verse": "63:3",
      "similarity": 0.5423352990283404
    },
    {
      "verse": "9:93",
      "similarity": 0.534988937926148
    }
  ]
}