{
  "chapter": "الأعراف",
  "text": "ولقد مكنكم فى الارض وجعلنا لكم فيها معيش قليلا ما تشكرون",
  "translations": [
    {
      "translation": "We have established you firmly on the earth and granted you your livelihood in it. What little thanks you show!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We settled you on the earth, and provided means of livelihood for you in it; but little are the thanks you give.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We assuredly established you in the earth and arranged for your livelihood in it. Little do you give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have made you inhabit the land and provided you with the means of sustenance. Only a few of you give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We established you in the earth and in it created for you the means of livelihood; very little thanks do you offer!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely, We gave you authority on the earth and appointed for you therein livelihoods. Little thanks do you give.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We have established you in the earth and made in it means of livelihood for you; little it is that you give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have established you in the earth and there appointed for you livelihood; little thanks you show.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have given you (mankind) power in the earth, and appointed for you therein livelihoods. Little give ye thanks!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We established you in the land and provided you with a means of livelihood there: yet you are seldom thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We established you in the earth and appointed for you livelihoods therein; yet little thanks ye return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We have established you on the earth, and made in it [various] means of livelihood for you. Little do you thank.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is We Who have placed you with authority on earth, and provided you therein with means for the fulfilment of your life: small are the thanks that ye give!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely, We gave you authority on the earth and appointed for you therein provisions (for your life). Little thanks do you give.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We established you in the earth and made for you a livelihood but little is it that you give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have established you firmly on earth, and made for you in it livelihood—but rarely do you give thanks.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have certainly established you upon the earth and made for you therein ways of livelihood. Little are you grateful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:10] And We have given you power, O Children of Adam, in the earth, and have appointed for you therein livelihoods (ma‘āyish is the plural of ma‘īsha), that is, the means by which you [are able to] subsist; little (qalīlan mā: mā is to emphasise the ‘littleness’) thanks you show, for this.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We have given you (mankind) power in the earth, and appointed for you therein) in the earth (a livelihood) that from which you eat, drink and clothe yourselves. (Little give you thanks!) you do not give thanks for what is great nor for the small; it is also said that this means: you give little thanks for all that is done for you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ خلقتني من نار وخلقته من طين } خلقت القوّة الوهمية من ألطف أجزاء الروح الحيوانية التي تحدث في القلب من بخارية الأخلاط ولطافتها وترتقي إلى الدماغ، وتلك الروح هي أحرّ ما في البدن فلذلك سمّاها ناراً\n والحرارة توجب الصعود والترّفع، وقد مرّ أن كل قوة ملكوتية تطلع على خواص ما تحتها دون ما فوقها وعلى الكمالات البدنية وخواصها وكمالات الروح الحيوانية وخواصها، واحتجابها عن الكمالات الإنسانية الروحانية والقلبية هو صورة إنكارها وعلة إبائها واستكبارها، وتعديها عن طورها بالحكم في المعاني المعقولة والمجرّدات والامتناع عن قبول حكم العقل هو صورة إبائها عن السجود\n { فما يكون لك أن تتكبر فيها } إذ التكبر، وهو التظاهر بما ليس فيه من الفضيلة من صفات النفس، فلا يليق بالحضرة الروحانية التي تزعم أنك من أهلها بالترفع على العقل، { فأخرج } ، فلست من أهلها الذين هم الأعزة { إنك من الصاغرين } من القوى النفسانية الملازمة للجهة السفلية الدائمة الهوان بملازمة الأبدان { إلى يوم يبعثون } من قبور الأبدان وأجداث صفات النفس بعد الموت الإرادي في القيامة الوسطى بحياة القلب وخلاص الفطرة من حجب النشأة، أو يبعثون بعد الفناء في الوحدة في القيامة الكبرى بالوجود الموهوب الحقاني والحياة الحقيقية، والمبعوث الأول هو المخلِص بكسر اللام، والثاني هو المخلَص بالفتح ولا سبيل لإبليس إلى إغوائهما { فبما أغويتني } إقسام وإبليس محجوب عن الذات الأحدية دون الصفات والأفعال، فشهوده للأفعال وتعظيمه لها إقسام بها كما أقسم بعزّته في قوله:\n\n[ص، الآية: 82]\n { لأقعدنّ لهم صراطك } أي: أعترضنّ لهم في طريق التوحيد الذاتي وأمنعنّهم عن سلوكها بأن أشغلهم بما سواك، ولآتينهم من الجهات الأربع التي يأتي منها العدوّ في الشاهد لأن إتيانه من أسفل، أي: من جهة الأحكام الحسيّة والتدابير الجزئية من باب المصالح الدنيوية غير موجب للضلالة، بل قد ينتفع به في العلوم الطبيعية والرياضية وبه يستعين العقل فيها كما مرّ في تأويل قوله:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من غاية جودنا ولطفنا إياكم يا بني إدم إنا { لَقَدْ مَكَّنَّاكُمْ فِي } مستقر { ٱلأَرْضِ وَجَعَلْنَا لَكُمْ فِيهَا مَعَايِشَ } من الملائمات كي يعيشوا بها مترفهين متنعمين شاكرين لنعمنا، صارفين إلى ما خلقناها لأجله، ومع ذلك الفضل العظيم واللطف الجسيم { قَلِيلاً مَّا } أي: في غاية القلة منكم { تَشْكُرُونَ } [الأعراف: 10] نعمنا بل تكفرونها وتصرفونها أكثركم إلى مقتضى أهويتكم الفاسدة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ولقد مكناكم في الأرض } تتصرفون فيها بالبناء والسكن، وبالغرس والحرث والزرع، وغير ذلك من أنواع التصرفات، { وجعلنا لكم فيها معايش }: أسبابًا تعيشون بها كالتجارة وسائر الحرف، { قليلاً ما تشكرون } على هذه النعم، فتقابلون المنعم بالكفر والعصيان، فأنتم جديرون بسلبها عنكم، وإبدالها بالنقم، لولا فضله ورحمته\n الإشارة: نعمة التمكين في الأرض متحققة في أهل التجريد، والمنقطعين إلى الله تعالى، فهم يذهبون في الأرض حيث شاءوا، ومائدتهم ممدودة يأكلون منها حيث شاؤوا، فهم متمكّنون من أمر دينهم لقلة عوائدهم، ومن أمر دنياهم لأنها قائمة بالله، تجري عليهم أرزاقهم من حيث لا يحتسبون، تخدمهم ولا يخدمونها \" يا دنياي اخدمي من خدمني، وأتعبي من خدمك \"\n فمن قصّر منهم في الشكر توجه إليه العتاب بقوله: { ولقد مكناكم في الأرض } إلى قوله: { قليلاً ما تشكرون } ، ومن تحقق شكره قيل له:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "78:11",
      "similarity": 0.7067398928562767
    },
    {
      "verse": "15:20",
      "similarity": 0.6870439494528425
    },
    {
      "verse": "69:21",
      "similarity": 0.684277718370565
    },
    {
      "verse": "101:7",
      "similarity": 0.684277718370565
    },
    {
      "verse": "43:32",
      "similarity": 0.4423296603631473
    }
  ]
}