{
  "chapter": "الأعراف",
  "text": "ثم بعثنا منۢ بعدهم موسى بـايتنا الى فرعون وملاي۟ه فظلموا۟ بها فانظر كيف كان عقبة المفسدين",
  "translations": [
    {
      "translation": "And then, after them, We sent Musa with Our Signs to Pharaoh and his ruling circle but they wrongfully rejected them. See the final fate of the corrupters!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We sent Moses with miracles after (these apostles) to the Pharaoh and his nobles, but they behaved with them high-handedly. See then the end of the authors of evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After those We sent forth Moses with Our signs to Pharaoh and his nobles, but they dealt with Our signs unjustly. Observe, then, what happened to the mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After the time of those people, We sent Moses with Our miracles to Pharaoh and his people, but they too rejected Our miracles. Consider, how terrible the end of the evil-doers is!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after them, We sent Moosa with our signs to Firaun and his court members, but they did injustice to those signs; therefore see what sort of fate befell the mischievous!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after them We sent Musa with Our signs to Fir`awn and his chiefs, but they wrongfully rejected them. So see how was the end of the mischief-makers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then we raised after them Musa with Our communications to Firon and his chiefs, but they disbelieved in them; consider then what was the end of the mischief makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent, after them, Moses with Our signs to Pharaoh and his Council, but they did them wrong; so behold thou, how was the end of the workers of corruption!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, after them, We sent Moses with our tokens unto Pharaoh and his chiefs, but they repelled them. Now, see the nature of the consequence for the corrupters!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After them We sent Moses with Our signs to Pharaoh and his chiefs. But they willfully rejected them. Consider the end of the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent, after them, Musa with Our signs unto Fir'awn and his chiefs, but they wronged them. Behold that wise was the end of the corrupters!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after them We sent Moses with Our signs to Pharaoh and his elite, but they wronged them. So observe how was the fate of the agents of corruption!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after them We sent Moses with Our signs to Pharaoh and his chiefs, but they wrongfully rejected them: So see what was the end of those who made mischief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after them We sent Musa (Moses) with Our Signs to Fir'aun (Pharaoh) and his chiefs, but they wrongfully rejected them. So see how was the end of the Mufsidun (mischief-makers, corrupts, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After those We sent forth Moses with Our signs to Pharaoh and his assembly, but with it they harmed. Look at the end of the corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, after them, We sent Moses with Our miracles to Pharaoh and his establishment, but they denounced them. So consider the end of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then We sent after them Moses with Our signs to Pharaoh and his establishment, but they were unjust toward them. So see how was the end of the corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:103] Then We sent, after them, that is, [after] the messengers mentioned, Moses with Our, nine, signs to Pharaoh and his council, his folk, but they mistreated, they disbelieved in, them. So behold what was the end of those who work corruption, by way of disbelief, when they were destroyed.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then, after them) after these messengers, (We sent Moses with our) nine (tokens unto Pharaoh and his chiefs) his people, (but they repelled them) they denied the tokens. (Now, see the nature of the consequence for the corrupters) see how destruction was the end result of the idolaters!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ بَعَثْنَا مِن بَعْدِهِم } أي: بعد انقراض الغواة الطغاة الهالكين بأنواع العذاب والنكال نبينا { مُّوسَىٰ } المخوص بتشريف تكليمنا { بِآيَٰتِنَآ } الدالة على توحيدنا مع تأييدنا إياه بالمعجزات الباهرة { إِلَىٰ فِرْعَوْنَ } المبالغ في العتو والاستكبار إلى حيث يدعي الألوهية والربوبية لنفسه { وَمَلإِيْهِ } المعاونين له المصدقين لدعواه الكاذب\n وبعدما ادعى النبوة وأظهر الآيات { فَظَلَمُواْ بِهَا } أي: أنكروا بالآيات وكذبوا من جاء بها { فَٱنْظُرْ } أيها المعتبر الرائي { كَيْفَ كَانَ عَٰقِبَةُ ٱلْمُفْسِدِينَ } [الأعراف: 103] في أرض الله\n الخارجين عن مقتضى أوامره ونواهيه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { ثم بعثنا } من بعد الرسل المتقدمين { موسى } بن عمران { بآياتنا }: بمعجزاتنا الدالة على صدقه، { إلى فرعون ومَلَئِهِ فظلموا بها } أي: طغوا بسببها، وزادوا عتوًا على عتوهم، { فانظر كيف كان عاقبة المفسدين } كيف غرقوا عن آخرهم، وأكلهم البحر. الإشارة: إذا أراد الله ـ تعالى ـ أن يُهلك قومًا بعث إليهم من يُذكرهم، فإذا زادوا في العتو والطغيان عاجلهم بالعقوبة. ذكر الشعراني: أن مدينة بالمشرق صنعوا وليمة يتنزهون فيها، فخرجوا إلى بستان، فلما صنعوا الطعام دخل عليهم فقير، فقال: أعطوني، فأعطوه، ثم قال: أعطوني فزادوه، ثم قال أعطوني، فجروه حتى أخرجوه، فأرسل عليهم مَن أخرجهم من تلك المدينة وخربها، فهي خربة إلى اليوم. سبحان المدبر الحكيم الواحد القهار!. ثم ذكر دعوة موسى إلى فرعون وما كان من أمره معه، فقال: { وَقَالَ مُوسَىٰ يٰفِرْعَوْنُ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:75",
      "similarity": 0.5360874331474159
    },
    {
      "verse": "43:46",
      "similarity": 0.5303652729654541
    },
    {
      "verse": "23:46",
      "similarity": 0.425918889466956
    },
    {
      "verse": "7:109",
      "similarity": 0.4028793204340513
    },
    {
      "verse": "37:73",
      "similarity": 0.39689041600172226
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007103.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007103.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:103.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}