{
  "chapter": "الأعراف",
  "text": "قال القوا۟ فلما القوا۟ سحروا۟ اعين الناس واسترهبوهم وجاءو بسحر عظيم",
  "translations": [
    {
      "translation": "He said, 'You throw.' And when they threw, they cast a spell on the people's eyes and caused them to eel great fear of them. They produced an extremely powerful magic.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You cast it first,\" answered Moses. When they cast their spell, they bewitched the eyes of the people and petrified them by conjuring up a great charm.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: 'You throw.' So when they threw [their rods], they enchanted the eyes of the people, and struck them with awe, and produced a mighty sorcery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied, \"Throw yours first.\" Their great magic bewitched people's eyes and terrified them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “You throw”; when they threw, they cast a magic spell upon the people’s eyes and terrified them, and they brought a great magic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Musa] said: \"Throw you (first).\" So when they threw, they bewitched the eyes of the people, and struck terror into them, and they displayed a great trick.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Cast. So when they cast, they deceived the people's eyes and frightened them, and they produced a mighty enchantment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'You cast.' And when they cast they put a Spell upon the people's eyes, and called forth fear of them, and produced a mighty sorcery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Throw! And when they threw they cast a spell upon the people's eyes, and overawed them, and produced a mighty spell.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"You throw [first]!\" When they made their cast, they bewitched the eyes of the people and struck them with awe, for they showed a great [feat of] magic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: cast ye. Then when they cast clown, they enchanted the eyes of the people, and terrified them and brought mighty magic to bear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Throw [yours].’ So when they threw, they bewitched the people’s eyes and overawed them, producing a tremendous magic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Moses: \"Throw ye (first).\" So when they threw, they bewitched the eyes of the people, and struck terror into them: for they showed a great (feat of) magic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He [Musa (Moses)] said: \"Throw you (first).\" So when they threw, they bewitched the eyes of the people, and struck terror into them, and they displayed a great magic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Throw' he replied. And when they threw, they bewitched the people's eyes and terrified them, and produced great sorcery.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “You throw!” And when they threw, they beguiled the eyes of the people, and intimidated them, and produced a mighty magic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Throw,\" and when they threw, they bewitched the eyes of the people and struck terror into them, and they presented a great [feat of] magic.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:116] He said, ‘Cast!’, this is a command permitting them to cast first, as a means to manifesting the truth. And when they cast, their ropes and staffs, they put a spell upon the people’s eyes, misleading them from perceiving the real state of these [ropes and staffs], and overawed them, scared them, by making them appear to be slithering snakes, and produced a mighty sorcery.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He) Moses (said: Throw) first whatever you are going to throw! (And when they threw) 70 staffs and 70 ropes (they cast a spell upon the people's eyes, and overawed them) scared them, (and produced a mighty spell) it is also said that this means: a clear lie.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱسْتَرْهَبُوهُمْ } معناهُ خَوَّفوهُم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And they were frightened of them}, means that they feared them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } موسى بإلهام الله إياه: بل { أَلْقُوْاْ } ما جئتم بإلقائه أيها الساحرون المبطلون { فَلَمَّآ أَلْقَوْاْ } أي: أرادوا الإلقاء { سَحَرُوۤاْ أَعْيُنَ ٱلنَّاسِ } حتى لا يتخيلوا أنها أمور غير مطابقة للواقع\n بل اعتقدوا مطابقتها { وَٱسْتَرْهَبُوهُمْ } أي: بني إسرائيل المنتظرين لغلبة موسى\n ليخلصوا من يد العدو إرهاباً شديداً\n لأنهم ألقوا حبالاً غلاظاً وخشباً طوالاً صارت الكل حيات متراكمة متراكبة بعضها فوق بعض { وَ } بالجملة: { جَآءُوا بِسِحْرٍ عَظِيمٍ } [الأعراف: 116] متناه في فنِّه أقضى غاية",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "59:13",
      "similarity": 0.5223878996939253
    },
    {
      "verse": "16:51",
      "similarity": 0.5008314163483297
    },
    {
      "verse": "2:40",
      "similarity": 0.46273302366241925
    },
    {
      "verse": "10:80",
      "similarity": 0.3768613818988866
    },
    {
      "verse": "43:30",
      "similarity": 0.3122870808988065
    }
  ]
}