{
  "chapter": "الأعراف",
  "text": "ولقد خلقنكم ثم صورنكم ثم قلنا للملئكة اسجدوا۟ لءادم فسجدوا۟ الا ابليس لم يكن من السجدين",
  "translations": [
    {
      "translation": "We created you and then formed you and then We said to the angels, 'Prostrate before Adam,' and they prostrated - except for Iblis. He was not among those who prostrated.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily We created you and gave you form and shape, and ordered the angels to bow before Adam in homage; and they all bowed but Iblis who was not among those who bowed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We initiated your creation, then We gave you each a shape, and then We said to the angels: 'Prostrate before Adam.') They all prostrated except Iblis: he was not one of those who fell Prostrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created and shaped you, then told the angels to prostrate themselves before Adam. All the angels obeyed except Satan who did not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We created you, then designed you and then ordered the angels, “Prostrate before Adam”; so they all prostrated, except Iblis (Satan); he did not become of those who prostrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely, We created you and then gave you shape; then We told the angels, \"Prostrate yourselves to Adam,\" and they prostrated, except Iblis (Shaytan), he refused to be of those who prostrated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We created you, then We fashioned you, then We said to the angels: Prostrate to Adam. So they did prostrate except Iblis; he was not of those who prostrated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created you, then We shaped you, then We said to the angels: 'Bow yourselves to Adam'; so they bowed themselves, save Iblis -- he was not of those that bowed themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We created you, then fashioned you, then told the angels: Fall ye prostrate before Adam! And they fell prostrate, all save Iblis, who was not of those who make prostration.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created you, then We shaped you and then We said to the angels, \"Prostrate yourselves before Adam,\" and they all prostrated themselves, except Satan. He was not among those who prostrated themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We created you, thereafter We fashioned you, and thereafter We said to the angels: prostrate yourselves before Adam; then they fell prostrate; not so Iblis: he was not of those who fell prostrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We created you, then We formed you, then We said to the angels, ‘Prostrate before Adam.’ So they [all] prostrated, but not Iblis: he was not among those who prostrated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It is We Who created you and gave you shape; then We bade the angels prostrate to Adam, and they prostrate; not so Iblis; He refused to be of those who prostrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely, We created you (your father Adam) and then gave you shape (the noble shape of a human being), then We told the angels, \"Prostrate to Adam\", and they prostrated, except Iblis (Satan), he refused to be of those who prostrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created you then We shaped you, then We said to the angels: 'Prostrate yourselves before Adam' They all prostrated themselves except iblis he was not among the prostrated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created you, then We shaped you, then We said to the angels, “Bow down before Adam;” so they bowed down, except for Satan; he was not of those who bowed down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have certainly created you, [O Mankind], and given you [human] form. Then We said to the angels, \"Prostrate to Adam\"; so they prostrated, except for Iblees. He was not of those who prostrated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:11] And We created you, that is, your father Adam, then shaped you, that is, We shaped him with you [deposited] in his back, then said to the angels: ‘Prostrate yourselves before Adam!’, a prostration that is a bow of salutation. So they fell prostrate, all save Iblīs, the father of the jinn, who was among the angels — he was not of those who make prostration.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We created you) from Adam and Adam is from dust, (then fashioned you) in wombs, and We fashioned Adam between Mecca and Ta'if, (then told the angels) who were on the earth: (Fall ye prostrate before Adam) a prostration of greeting! (And they fell prostrate, all save Iblis) their leader, (who was not of those who make prostration) to Adam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَقَدْ خَلَقْنَاكُمْ ثُمَّ صَوَّرْنَاكُمْ } قال زيد بن علي عليهما السَّلامُ: خلقناكُم فِي أَصلابِ الرِّجالِ، وصوّرناكُمْ فِي أَرحامِ النِّساءِ\n\n",
      "translations": [
        {
          "translation": "\nAnd {the words of the Most High: \"And We have created you, then We have shaped you\"} Zayd bin Ali, may peace be upon him, said: We have created you in the wombs of men, and We have shaped you in the wombs of women.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من عموم وجودنا أيضاً أنا { لَقَدْ خَلَقْنَاكُمْ } أي: قدرنا تعيناتكم وأظهرنا هوياتكم من كتم العدم { ثُمَّ صَوَّرْنَاكُمْ } أي: زيناكم بصورنا وخلقناكم بأخلاقنا { ثُمَّ قُلْنَا لِلْمَلاۤئِكَةِ } المهيمين المستغرقين بمطالعة جمالنا: { ٱسْجُدُواْ } تذللوا، تواضعوا { لأَدَمَ } المصور على صورتنا تعظيماً لنا وتكريماً له؛ إذ هو مرآة مجلوة تحاكي جميع أوصافنا وأسمائنا، وترشدكم إلى وحدة ذاتنا، وبعدما شهدوا آثار جميع أوصافنا وأسمائنا منه { فَسَجَدُوۤاْ } جميعاً متذللين { إِلاَّ إِبْلِيسَ } الذي هو رأس جواسيس النفوس الخبيثة { لَمْ يَكُنْ مِّنَ ٱلسَّاجِدِينَ } [الأعراف: 11] مع كونه من زمرتهم حين أرموا، ثم لما امتنع إبليس عن السجود\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ولقد خلقناكم } أي: خلقنا أباكم آدم طينًا غير مصور، { ثم صوّرناكم } أي: صوّرنا خلقة أبيكم آدم\n نزَّل خلقه وتصويره منزلة خلق الكل وتصويره لأنه المادة الأصلية، أي: ابتدأنا خلقكم ثم تصويركم بأن خلقنا أباكم آدم، ثم صورناه، { ثم قلنا للملائكة اسجدوا لآدم } تعظيمًا له، حيث وجد فيه ما لم يوجد فيهم، واختبارًا له ليظهر من يخضع ممن لم يخضع، { فسجدوا إلا إبليس لم يكن من الساجدين } لآدم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:61",
      "similarity": 0.6661635157544383
    },
    {
      "verse": "20:116",
      "similarity": 0.6548740532847133
    },
    {
      "verse": "2:34",
      "similarity": 0.646406745553884
    },
    {
      "verse": "15:32",
      "similarity": 0.6149497864517554
    },
    {
      "verse": "18:50",
      "similarity": 0.5972002348891531
    }
  ]
}