{
  "chapter": "الأعراف",
  "text": "قال ما منعك الا تسجد اذ امرتك قال انا۠ خير منه خلقتنى من نار وخلقته من طين",
  "translations": [
    {
      "translation": "He said, 'What prevented you from prostrating when I commanded you to?' He replied, 'I am better than him. You created me from fire and You created him from clay.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What prevented you\" (said God), \"from bowing (before Adam) at My bidding?\" \"I am better than him,\" said he. \"You created me from fire, and him from clay.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: 'What prevented you from prostrating, when I commanded you to do so?' He said: 'I am better than he. You created me from fire, and him You created from clay.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God asked, \"What made you disobey Me?\" Satan replied, \"I am better than Adam, for You have created me out of fire and Adam out of clay.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Allah, “What prevented you, that you did not prostrate when I commanded you?” Answered Iblis, “I am better than him; You created me from fire whereas You created him from clay.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"What prevented you (O Iblis) that you did not prostrate, when I commanded you\" Iblis said: \"I am better than him (Adam), You created me from fire, and him You created from clay.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: What hindered you so that you did not prostrate when I commanded you? He said: I am better than he: Thou hast created me of fire, while him Thou didst create of dust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said He, 'What prevented thee to bow thyself, when I commanded thee?' Said he, 'I am better than he; Thou createdst me of fire, and him Thou createdst of clay.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: What hindered thee that thou didst not fall prostrate when I bade thee? (Iblis) said: I am better than him. Thou createdst me of fire while him Thou didst create of mud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God asked, \"What prevented you from prostrating yourself when I commanded you to?\" He replied, \"I am better than he is; You created me from fire, while You created him from clay.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: what prevented thee, that thou shouldst not prostrate thyself, when I bade thee? He said. I am better than he; me Thou createdest me from fire, and him Thou createdest from clay.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said He, ‘What prevented you from prostrating, when I commanded you? ’‘I am better than him,’ he said. ‘You created me from fire and You created him from clay.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"What prevented thee from prostrating when I commanded thee?\" He said: \"I am better than he: Thou didst create me from fire, and him from clay.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"What prevented you (O Iblis) that you did not prostrate, when I commanded you?\" Iblis said: \"I am better than him (Adam), You created me from fire, and him You created from clay.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Allah) asked: 'What prevented you to prostrate, when I commanded you' 'I am better than he' he replied. 'You created me of fire and You created him of clay'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “What prevented you from bowing down when I have commanded you?” He said, “I am better than he; You created me from fire, and You created him from mud.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah] said, \"What prevented you from prostrating when I commanded you?\" [Satan] said, \"I am better than him. You created me from fire and created him from clay.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:12] He, exalted be He, said, ‘What prevented you from falling prostrate (allā is [made up of] an-lā, the lā being extra) when I commanded you?’ He [Iblīs] said, ‘I am better than him. You created me from fire, while him You created from clay’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوالجواب في قوله : { قال ما منعك ألا تسجد إذ أمرتك } ابتداء المحاورة ، لأنّ ترك إبليس السّجود لآدم بمنزلة جواب عن قول الله : { أسجدوا لآدم } ، فكان بحيث يتوجّه إليه استفسار عن سبب تركه السّجود ، وضمير : { قال } عائد إلى معلوم من المقام أي قال اللَّهُ تعالى بقرينة قوله : { ثم قلنا للملائكة اسجدوا } ، وكان مقتضى الظاهر أن يقال : قُلنا ، فكان العدول إلى ضمير الغائب التفاتاً ، نكتته تحويل مقام الكلام ، إذ كان المقامُ مقام أمرٍ للملائكة ومن في زمرتهم فصار مقام توبيخ لإبليس خاصة .و { مَا } للاستفهام ، وهو استفهام ظاهره حقيقي ، ومشوب بتوبيخ ، والمقصود من الاستفهام إظهار مقصد إبليس للملائكة .و { منعك } معناه صدّك وكفّك عن السجود فكان مقتضى الظاهر أن يقال : ما منعك أن تسجد لأنّه إنّما كفّ عن السّجود لا عن نفي السجود فقد قال تعالى في الآية الأخرى : { ما منعك أن تسجد لما خلقت بيدي } \\[ ص : 75 \\] ، فلذلك كان ذكر ( لا ) هنا على خلاف مقتضى الظاهر ، فقيل هي مزيدة للتّأكيد ، ولا تفيد نفياً ، لأنّ الحرف المزيد للتّأكيد لا يفيد معنى غيرَ التّأكيد . و ( لاَ ) من جملة الحروف التي يؤكّد بها الكلام كما في قوله تعالى : { لا أقسم بهذا البلد } \\[ البلد : 1 \\] وقوله { لئلا يعلم أهل الكتاب أن لا يقدرون على شيء من فضل الله } \\[ الحديد : 29 \\] أي ليعلم أهل الكتاب علماً محقّقاً . وقوله تعالى : { وحرام على قرية أهلكناها أنّهم لا يرجعون } \\[ الأنبياء : 95 \\] أي ممنوع أنّهم يرجعون منعاً محقّقاً ، وهذا تأويل الكسائي ، والفراء ، والزّجاج ، والزّمخشري ، وفي توجيه معنى التّأكيد إلى الفعل مع كوننِ السّجود غير واقععٍ فلا ينبغي تأكيده خفاءٌ لأنّ التّوكيد تحقيق حصول الفعل المؤكّد ، فلا ينبغي التّعويل على هذا التّأويل .وقيل ( لا ) نافية ، ووجودها يؤذن بفعل مقدر دلّ عليه { منعك } لأنّ المانع من شيء يدعو لضدّه ، فكأنّه قيل : ما منعك أن تسجد فدعاك إلى أن لا تسجد ، فإمّا أن يكون { منعك } مستعملاً في معنى دعَاك ، على سبيل المجاز ، و ( لا ) هي قرينة المجاز ، وهذا تأويل السكاكي في «المفتاح» في فصل المجاز اللّغوي ، وقريبٌ منه لعبد الجبّار فيما نقله الفخر عنه ، وهو أحسن تأويلاً ، وإمّا أن يكون قد أريد الفعلان ، فذُكر أحدهما وحذف الآخر ، وأشير إلى المحذوف بمتعلّقه الصّالح له فيكون من إيجاز الحذف ، وهو اختيار الطّبري ومن تبعه .وانظر ما قلتُه عند قوله تعالى : { قال يا هارون ما منعك إذ رأيتهم ضلوا أن لا تتبعني } في سورة طه ( 92 ، 93 ).وقوله : { إذ أمرتك } ظرف ل { تسجد } ، وتعليق ضميره بالأمر يقتضي أن أمر الملائكة شامل له ، إمّا لأنّه صنف من الملائكة ، فخلق الله إبليس أصلاً للجنّ ليجعل منه صنفاً مُتَمِّيزاً عن بقيّة الملائكة بقبوله للمعصية ، وهذا هو ظاهر القرآن ، وإليه ذهب كثير من الفقهاء ، وقد قال الله تعالى : { إلا إبليس كانَ من الجنّ } \\[ الكهف : 50 \\] الآية ، وإما لأنّ الجنّ نوع آخر من المجردات ، وإبليس أصل ذلك النّوع ، جعله الله في عداد الملائكة ، فكان أمرهم شاملاً له بناء على أن الملائكة خلقوا من النّور وأنّ الجنّ خلقوا من النّار ، وفي «صحيح مسلم» ، عن عائشة رضي الله عنها : أنّ رسول الله صلى الله عليه وسلم قال : \" خلقت الملائكة من نور وخُلق الجان من مارج من نار \" وإلى هذا ذهب المعتزله وبعض الأشاعرة ، وقد يكون المراد من النّار نوراً مخلوطاً بالمادة ، ويكون المراد بالنّور نوراً مجرداً ، فيكون الجنّ نوعاً من جنس الملائكة أحطّ ، كما كان الإنسان نوعاً من جنس الحيوان أرقى .وفُصِل : { قال أنا خير منه } لوقوعه على طريقة المحاورات .وبَيّن مانعه من السّجود بأنّه رأى نفسه خيراً من آدم ، فلم يمتثل لأمر الله تعالى إياه بالسّجود لآدم ، وهذا معصية صريحة ، وقوله : { أنا خير منه } مسوق مساق التّعليل للامتناع ولذلك حذف منه اللام .وجملة : { خلقتني من نار } بيان لجملة : { أنا خير منه } فلذلك فصلت ، لأنّها بمنزلة عطف البيان من المبيّن .وحصَل لإبليس العلم بكونه مخلوقاً من نار ، بإخبار من الملائكة الذين شهدوا خلقَه ، أو بإخبار من الله تعالى .وكونه مخلوقاً من النّار ثابت قال تعالى : { خلق الإنسان من صلصال كالفخار وخلق الجان من مارج من نار } \\[ الرحمن : 14 ، 15 \\] وإبليس من جنس الجنّ قال تعالى في سورة الكهف ( 50) : { فسجدوا إلا إبليس كان من الجنّ ففسق عن أمر ربّه } واستند في تفضيل نفسه إلى فضيلة العنصر الذي خلق منه على العنصر الذي خلق منه آدم .والنّار هي الحرارة البالغة لشدّتها الالتهاب الكائنة في الأجسام المصهورة بأصل الخلقة ، كالنّار التي في الشّمس ، وإذا بلغت الحرارة الالتهام عرضت النّارية للجسم من معدن أو نبات أو تراب مثل النّار الباقية في الرّماد .والنار أفضل من التّراب لقوّة تأثيرها وتسلّطها على الأجسام التي تلاقيها ، ولأنّها تضيء ، ولأنّها زكيّة لا تلصق بها الأقذار ، والتّراب لا يشاركها في ذلك وقد اشتركا في أن كليهما تتكوّن منه الأجسام الحيّة كلّها .وأمّا النّور الذي خُلق منه الملَكُ فهو أخلَص من الشّعاع الذي يبيّن من النّار مجرّدا عن ما في النّار من الأخلاط الجثمانيّه .والطّينُ التّراب المختلط بالماء ، والماءُ عنصر آخر تتوقّف عليه الحياة الحيوانيّة مع النّار والتّراب ، وظاهر القرآن في آيات هذه القصة كلّها أنّ شرف النّار على التّراب مقرّر ، وأنّ إبليس أُوخذ بعصيان أمر الله عصياناً باتّاً ، والله تعالى لمّا أمر الملائكه بالسّجود لآدم قد عَلِم استحقاق آدمَ ذلك بما أوْدع الله فيه من القوّة التي قد تبلغ به إلى مبلغ الملائكة في الزّكاء والتّقديس ، فأمّا إبليس فغرّه زكاء عنصره وذلك ليس كافياً في التّفضيل وحده ، ما لم يَكن كِيَانُه من ذلك العنصر مهيّئاً إياه لبلوغ الكمالات ، لأنّ العبرة بكيفيّة التّركيب ، واعتبار خصائص المادة المركّب منها بعد التّركيب ، بحسب مقصد الخالق عند التّركيب ، ولا عبرة بحالة المادة المجرّدة ، فاللَّه تعالى ركب إبليس من عنصر النّار على هيئة تجعله يستخدم آثار القوّة العنصريّة في الفساد والاندفاع إليه بالطّبع دون نظر ، بحسب خصائص المادة المركّب هو منها ، وركّب آدم من عنصر التّراب على هيئة تجعله يستخدم آثار القوّة العنصريّة في الخبر والصّلاح والاندفاع إلى ازدياد الكمال بمحض الاختيار والنّظر ، بحسب ما تسمح به خصائص المادّة المركّب هو منها ، وكلّ ذلك منوط بحكمة الخالق للتّركيب ، وركّب الملائكة من عنصر النّور على هيئة تجعلهم يستخدمون قواهم العنصرية في الخيرات المحضة ، والاندفاع إلى ذلك بالطّبع دون اختيار ولا نظر ، بحسب خصايص عنصرهم ، ولذلك كان بلوغ الإنسان إلى الفضائل الملكيّة أعلى وأعجب ، وكان مبلغه إلى الرّذائل الشّيطانيّة أحطّ وأسهل ، ومن أجل ذلك خوطب بالتّكليف .ولأجل هذا المعنى أمر الله الملائكة بالسّجود لآدم أصل النّوع البشري لأنّه سجود اعتراف لله تعالى بمظهر قدرته العظيمة ، وأمر إبليس بالسّجود له كذلك ، فأمّا الملائكة فامتثلوا أمر الله ولم يعلموا حكمته ، وانتظروا البيان ، كما حكى عنهم بقوله : { قالوا سبحانك لا عِلْم لنا إلا ما علمتنا إنّك أنت العليم الحكيم } \\[ البقرة : 32 \\] فجاءهم البيان مجملاً بقوله : { إنّي أعلَمُ ما لا تعلمون } \\[ البقرة : 30 \\] ثمّ مفصّلا بقصّة قوله : { ثم عرضهم على الملائكة فقال أنبئوني بأسماء هؤلاء إن كنتم صادقين } \\[ البقرة : 31 \\] إلى قوله { وما كنتم تكتمون } في سورة البقرة ( 33 ).\n\n",
      "translations": [
        {
          "translation": "(He said: What hindered thee) Allah said to Iblis: what prevents you (that thou didst not fall prostrate) to Adam (when I bade thee) to prostrate? ((Iblis) said: I am better than him. Thou createdst me of fire while him Thou didst create of mud) I am made of fire while he is made of mud, and fire devours mud.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } سبحانه إظهاراً لما تحقق في علمه وكمن في غيبه من خبث طينة إبليس: { مَا مَنَعَكَ } يا أبليس { أَلاَّ تَسْجُدَ } لخليفتي { إِذْ أَمَرْتُكَ } مع رفقائك؟ { قَالَ } إبليس في الجواب بمقتضى هويته الباطلة وأهويته الفاسدة: { أَنَاْ خَيْرٌ مِّنْهُ } وأفضل { خَلَقْتَنِي مِن نَّارٍ } منير { وَخَلَقْتَهُ مِن طِينٍ } [الأعراف: 12] مظلم كدر\n ولا يحسن تذلل الفاضل للمفضول\n\n\nلما امتنع عن مقتضى الأمر الوجوبي\n ولم يتفطن بسره الذي هو التوحيد الذاتي\n إذ الأمر سجود المظهر الجامع والظل الكامل\n أمر بالتوجه نحو الذات الأحدية والمعبود الحقيقي المتجلي عليه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال } له الحق تبارك وتعالى: { ما منعك ألا تسجد } أي: تسجد\n فلا: زائدة\n مؤكدة معنى الفعل الذي دخلت عليه\n ومنبهة على أن الموبَّخ عليه ترك السجود\n وقيل: الممنوع من الشيء كالمضطر إلى خلافه\n فكأنه قال: ما اضطرك إلى ترك السجود { إذ أمرتك }\n وفيه دليل على أن مطلق الأمر للوجوب والفور\n فأجاب بقوله: { قال أنا خيرٌ منه } \n أي: المانع لي من السجود هو كوني أنا خير منه\n ولا يحسُنُ للفاضل أن يسجد للمفضول\n فكيف يحسُن أن يؤمر به\n فإبليس هو الذي سنَّ التكبر\n وقال بالتحسين والتقبيح العقليين أولاً\n وبهذا الاعتراض كفر إبليس إذ ليس كفره كفر جحود\n ثم بيَّن وجه الأفضلية\n فقال: { خلقتني من نار وخلقته من طين } \n فاعتقد أن النار خيرٌ من الطين\n وقد غلط في ذلك\n فإن الأفضلية إنما تظهر باعتبار النتائج والثمرات\n لا باعتبار العنصر والمادة فقط\n ولا شك أن الطين ينشأ منه ما لا يحصى من الخيرات كالثمار والحبوب وأنواع الفواكه\n قال البيضاوي: رأى الفضل كله باعتبار العنصر\n وغفل عما يكون باعتبار الفاعل\n كما أشار إليه بقوله تعالى:\n[صَ:75] أي: بغير واسطة\n وباعتبار الصورة\n كما نبه عليه بقوله تعالى: { ونفخت فيه من روحي } وباعتبار الغاية\n وهو ملاكه\n ولذلك أمر الملائكة بالسجود له لما تبين لهم أنه أعلم منهم\n وأنه له خواصًا ليست لغيره\n هـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:76",
      "similarity": 0.7115101589709493
    },
    {
      "verse": "38:71",
      "similarity": 0.6365439144342031
    },
    {
      "verse": "51:33",
      "similarity": 0.5151733892478748
    },
    {
      "verse": "32:7",
      "similarity": 0.4958791317775685
    },
    {
      "verse": "17:61",
      "similarity": 0.49066455729260133
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007012.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007012.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:12.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}