{
  "chapter": "الأعراف",
  "text": "وقال الملا من قوم فرعون اتذر موسى وقومه ليفسدوا۟ فى الارض ويذرك وءالهتك قال سنقتل ابناءهم ونستحى نساءهم وانا فوقهم قهرون",
  "translations": [
    {
      "translation": "The ruling circle of Pharaoh's people said, 'Are you going to leave Musa and his people to cause corruption in the earth and abandon you and your gods?' He said, 'We will kill their sons and let their women live. We have absolute power over them!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the leaders of Pharaoh's people said to him: \"Would you allow Moses and his people to create disorder in the land and discard you and your gods?\" He replied: \"We shall now slay their sons and spare their women, and subdue them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The elders of Pharaoh's people said: 'Will you leave alone Moses and his people to spread mischief in the land, and forsake you and your gods?' Pharaoh replied: 'We will kill their male children and spare their female ones. For indeed we hold irresistible sway over them.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Some of the Pharaohs people said, \"Will you let Moses and his people destroy the land and disregard you and your gods?\" The Pharaoh said, \"We will kill their sons and leave their women alive; they are under our domination.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chieftains of Firaun’s people said, “Are you releasing Moosa and his people to cause turmoil in the land, and for Moosa to abandon you and your appointed deities?” He said, “We shall now slay their sons and spare their women; and indeed we have power over them.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs of Fir`awn's people said: \"Will you leave Musa and his people to spread mischief in the land, and to abandon you and your gods\" He said: \"We will kill their sons, and let their women live, and we have indeed irresistible power over them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the chiefs of Firon's people said: Do you leave Musa and his people to make mischief in the land and to forsake you and your gods? He said: We will slay their sons and spare their women, and surely we are masters over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then said the Council of the people of Pharaoh, 'Wilt thou leave Moses and his people to work corruption in the land, and leave thee and thy gods?' Said he, 'We shall slaughter their sons and spare their women; surely we are triumphant over them!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs of Pharaoh's people said: (O King), wilt thou suffer Moses and his people to make mischief in the land, and flout thee and thy gods? He said: We will slay their sons and spare their women, for lo! we are in power over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs of Pharaoh's people said, \"Will you allow Moses and his people to spread corruption in the land, and to forsake you and your gods?\" He replied, \"We shall kill their male children and spare only the females. We have complete power over them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the chiefs of the people of Fir'awn said: wilt thou leave alone Musa and his people to act corruptly in the land and to leave alone thee and thy gods! He said: soon we shall slay their sons and let live their women, and we are masters over them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The elite of Pharaoh’s people said, ‘Will you leave Moses and his people to cause corruption in the land, and to abandon you and your gods?’ He said, ‘We will kill their sons and spare their women, and indeed we are dominant over them.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said the chiefs of Pharaoh's people: \"Wilt thou leave Moses and his people, to spread mischief in the land, and to abandon thee and thy gods?\" He said: \"Their male children will we slay; (only) their females will we save alive; and we have over them (power) irresistible.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs of Fir'aun's (Pharaoh) people said: \"Will you leave Musa (Moses) and his people to spread mischief in the land, and to abandon you and your gods?\" He said: \"We will kill their sons, and let live their women, and we have indeed irresistible power over them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The assembly of Pharaoh's nation said: 'Will you allow Moses and his nation to corrupt in the land and to forsake you and your gods' He replied: 'We will put their sons to death and spare their women, indeed we are conquerors over them'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The chiefs of Pharaoh's people said, “Will you let Moses and his people cause trouble in the land, and forsake you and your gods?” He said, “We will kill their sons, and spare their women. We have absolute power over them.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the eminent among the people of Pharaoh said,\" Will you leave Moses and his people to cause corruption in the land and abandon you and your gods?\" [Pharaoh] said, \"We will kill their sons and keep their women alive; and indeed, we are subjugators over them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:127] Then the council of Pharaoh’s folk said, to him [to Pharaoh]: ‘Will you leave Moses and his people to work corruption in the land, by calling to disobedience against you, and flout you and your gods?’ — he had fashioned small idols for them to worship, and had said to them, ‘I am your lord and their lord’, which is why he says, I am your lord the highest [Q. 79:24]. He said, ‘We shall slaughter (read nuqattilu or naqtulu) their, new-born, sons and spare their women, keeping them alive [for us], as we did with them before. For surely we have [irresistible] power over them!’, and they did this to them, and so the Children of Israel grieved.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(The chiefs of Pharaoh's people said: (0 King), wilt thou) not kill them and (suffer Moses and his people to make mischief in the land) by changing the religion and worship, (and flout thee) and abandon you (and thy gods) and the worship of your gods; it is also said that this means, according to a different reading: and leave worshipping you as a god? (He) Pharaoh (said: We will slay their sons) their young sons, as we did the first time (and spare) and use (their women) their grown up women, (for lo! we are in power over them) we have dominance and supremacy over them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ويوقعوا الفتن بين رعايا بلادك { وَ } بالجملة: أدى أمرهم وإيقاعهم إلى أن { يَذَرَكَ } أي: كل واحد منهم عبادتك { وَ } عبادة { آلِهَتَكَ } التي وضعتها لعبادة عبادك من الأصنام والتماثيل لتتخذوها معبودات وتتوجهوا نحوها { قَالَ } فرعون: لا ندعهم بعد اليوم على ما كانوا عليه من قبل\n ولا نستأصلهم أيضاً\n لئلا ينسب الظلم والعجز إلينا\n بل نستضعفهم على التدرج { سَنُقَتِّلُ } بعد اليوم { أَبْنَآءَهُمْ } أي: ذكور أولادهم\n لئلا يتكثروا { وَنَسْتَحْيِـي نِسَآءَهُمْ } أي: إناث أولادهم حتى نتزوجهن وينزجروا بلحوق العار\n وإذا مضى زمان على هذا انقرضوا واستؤصلوا\n وكيف لا نفعل بهم ما نقول { وَإِنَّا فَوْقَهُمْ قَاهِرُونَ } [الأعراف: 127] قادرين غالبون\n\n\nوبالجملة: لما فعلنا بهم من قبل فيما مضى\n هكذا أيضاً الآن حتى لا يتوهم أن موسى هو المولود الذي زعم الكهنة والمنجمون أن ذهاب ملكنا على يده\n\n\nثم لما سمع بنو إسرائيل تهديد فرعون تفزعوا منه وتضجروا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { وقال الملأُ من قوم فرعون أَتذَرُ موسى وقومَه } أي: تتركهم يخالفون دينك { ليُفسدوا في الأرض } أي: يخربوا ملكك بتغيير دينك ودعوتهم إلى مخالفتك، { ويَذَرك وآلهتك } أي: يترك موسى دينك ومعبوداتك التي تعبد، قيل: كان يعبد الكواكب، وقيل: صنع لقومه أصنامًا وأمرهم أن يعبدوها تقربًا إليه\n ولذلك قال:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "6:18",
      "similarity": 0.5834725627780195
    },
    {
      "verse": "38:65",
      "similarity": 0.5092319444747695
    },
    {
      "verse": "93:9",
      "similarity": 0.4544563417515698
    },
    {
      "verse": "6:61",
      "similarity": 0.4130718327740671
    },
    {
      "verse": "39:4",
      "similarity": 0.4030279476987824
    }
  ]
}