{
  "chapter": "الأعراف",
  "text": "قالوا۟ اوذينا من قبل ان تاتينا ومنۢ بعد ما جئتنا قال عسى ربكم ان يهلك عدوكم ويستخلفكم فى الارض فينظر كيف تعملون",
  "translations": [
    {
      "translation": "They said, 'We suffered harm before you came to us and after you came to us.' He said, 'It may well be that your Lord is going to destroy your enemy and make you the successors in the land so that He can see how you behave.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We were oppressed before you came, and have been since you have come to us.\" He answered: \"It may well be that soon God may destroy your enemy and make you inherit the land, and then see how you behave.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Moses replied: 'We were oppressed before your coming to us and after it.' Moses said: 'Your Lord will soon destroy your enemy and make you rulers in the land. Then He will see how you act.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "His people said, \"We suffered a great deal before you came and we are still suffering even after you have come.\" Moses (tried to encourage them) by saying, \"There is hope that your Lord will destroy your enemies and make you (their) successors in the land. So consider how you act.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “We have been oppressed before you came to us, and after you have come to us”; he said, “It is likely that your Lord may destroy your enemy and in his place make you the rulers of the earth, and then see what deeds you perform.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We suffered troubles before you came to us, and since you have come to us.\" He said: \"It may be that your Lord will destroy your enemy and make you successors on the earth, so that He may see how you act\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: We have been persecuted before you came to us and since you have come to us. He said: It may be that your Lord will destroy your enemy and make you rulers in the land, then He will see how you act.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'We have been hurt before thou camest to us, and after thou camest to us.' He said, 'Perchance your Lord will destroy your enemy, and will make you successors in the land, so that He may behold how you shall do.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: We suffered hurt before thou camest unto us, and since thou hast come unto us. He said: It may be that your Lord is going to destroy your adversary and make you viceroys in the earth, that He may see how ye behave.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They replied, \"We were being persecuted before you came to us, and we are still being persecuted.\" He said, \"Your Lord may well destroy your enemy and make you successors to the land. Then He will see how you conduct yourselves.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: oppressed we have been ere thou camest unto us and since thou hast come unto us. He said: belike your Lord will destroy your enemy and establish yougs in their stead in the land, thathe may see what wise ye act.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘We were tormented before you came to us and [also] after you came to us.’ He said, ‘Maybe your Lord will destroy your enemy and make you successors in the land, and then He will see how you act.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We have had (nothing but) trouble, both before and after thou camest to us.\" He said: \"It may be that your Lord will destroy your enemy and make you inheritors in the earth; that so He may try you by your deeds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"We (Children of Israel) had suffered troubles before you came to us, and since you have come to us.\" He said: \"It may be that your Lord will destroy your enemy and make you successors on the earth, so that He may see how you act?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They replied: 'We were hurt before you came to us, and after you came to us' He said: 'Your Lord may destroy your enemies and make you inheritors in the land. Then He will see how you conduct yourselves'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “We were persecuted before you came to us, and after you came to us.” He said, “Perhaps your Lord will destroy your enemy, and make you successors in the land; then He will see how you behave.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"We have been harmed before you came to us and after you have come to us.\" He said, \"Perhaps your Lord will destroy your enemy and grant you succession in the land and see how you will do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:129] They said, ‘We suffered harm before you came to us, and since you have come to us.’ He said, ‘Perhaps your Lord will destroy your enemy and make you successors in the land, that He may observe how you shall act’, in it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ قالوا } حكاية جواب قوم موسى إياه ، فلذلك فصلت جملة القول على طريقة المحاورة ، وهذا الخبر مستعمل في الشكاية واستئثارتهم موسى ليدعو ربه أن يفرج كربهم .والإيذاء : الإصابة بالأذى ، والأذى ما يؤلم ويحزن من قول أو فعل ، وقد تقدم عند قوله تعالى : { لن يضروكم إلاّ أذى } في سورة آل عمران ( 111 ) ، وقوله : { فصَبروا على ما كُذبوا وأوذوا } في سورة الأنعام ( 34 ) ، وهو يكون ضعيفاً وقوياً ، ومرادهم هنا القوي منه ، وهو ما لحقهم من الاستعباد وتكليفهم الأعمال الشاقة عليهم في خدمة فرعون وما توعدهم به فرعون بعد بعثة موسى من القطع والصلب وقتل الأبناء ، وكأنهم أرادوا التعريض بنفاد صبرهم وأن الأذى الذي مسهم بعد بعثة موسى لم يكن بداية الأذى ، بل جاء بعد طول مدة في الأذى ، فلذلك جمعوا في كلامهم ما لحقهم قبل بعثة موسى .وقد توهم بعض المفسرين أن هذا امتعاض منهم مما لحقهم بسبب موسى وبواسطته مستنداً إلى أن قتل الذكور منهم كان قبل مجيء موسى بسبب توقع ولادة موسى ، وكان الوعيد بمثله بعد مجيئه بسبب دعوته ، وليس ذلك بمتجه لأنه لو كان هو المراد لما كان للتعبير بقوله : { من قبل أن تأتينا } موقع ، والإتيان والمجيء مترادفان ، فذكر المجيء بعد الإتيان ليس لاختلاف المعنى ، ولكنه للتفنن وكراهية إعادة اللفظ .والإتيان والمجيء مدلولهما واحد ، وهو بعثة موسى بالرسالة ، فجعل الفعل المعبّر عنه حين عُلق به ( قبل ) بصيغة المضارع المقترن ب ( أن ) الدالة على الاستقبال والمصدرية لمناسبة لفظ ( قبل ) لأن ما يضاف إلى ( قبل ) مستقبل بالنسبة لمدلولها ، وجُعل حين علق به ( بعد ) بصيغة الماضي المقترن بحرف ( مّا ) المصدرية لأن ( ما ) المصدرية لا تفيد الاستقبال ليناسب لفظ ( بعد ) لأن مضاف كلمة ( بعد ) ماض بالنسبة لمدلولها .فأجابهم موسى بتقريب أن يكونوا هم الذين يرثون مُلك الأرض والذين تكون لهم العاقبة .وجاء بفعل الرجاء دون الجزم تأدباً مع الله تعالى ، وإقصاء للاتكال على أعمالهم ليزدادوا من التقوى والتعرض إلى رضى الله تعالى ونصره . فقوله : { عسى ربكم أن يهلك عدوكم } ناظر إلى قوله : { إن الأرض لله } \\[ الأعراف : 128 \\] وقوله : { ويَسْتخلفَكم في الأرض } ناظر إلى قوله { والعاقبة للمتقين } \\[ الأعراف : 128 \\].والمراد بالعدو ، فرعون وحزبه ، فوصفُ عدو يوصف به الجمع قال تعالى : { هم العدو } \\[ المنافقون : 4 \\].والمراد بالاستخلاف : الاستخلاف عن الله في مُلك الأرض . والاستخلاف إقامة الخليفة ، فالسين والتاء لتأكيد الفعل مثل استجاب له ، أي جعلهم أحراراً غالبين ومؤسسين ملكاً في الأرض المقدسة .ومعنى { فينظر كيف تعملون } التحذير من أن يعملوا ما لا يرضي الله تعالى ، والتحريض على الاستكثار من الطاعة ليستحقوا وصف المتقين ، تذكيراً لهم بأنه عليم بما يعملونه .فالنظر مستعمل في العلم بالمرئيات ، والمقصود بما { تعملون } عملهم مع الناس في سياسة ما استخلفوا فيه ، وهو كله من الأمور التي تشاهد إذ لا دخل للنيات والضمائر في السياسة وتدبير الممالك ، إلاّ بمقدار ما تدفع إليه النيات الصالحة من الأعمال المناسبة لها ، فإذا صدرت الأعمال صالحة كما يرضي الله ، وما أوصى به ، حصل المقصود ، ولا يضرها ما تكنه نفس العامل .و ( كيف ) يجوز كونها استفهاماً فهي معلّقة لفعل ( ينظرُ ) عن المفعول ، فالتقدير فينظر جواب السؤال ب { كيف تعملون } ، ويجوز كونها مجردة عن معنى الاستفهام دالة على مجرد الكيفية ، فهي مفعول به ل { ينظرَ } كما تقدم في قوله تعالى : { هو الذي يصوركم في الأرحام كيف يشاء } في سورة آل عمران ( 6 ) ، وقوله تعالى : { انظْر كيف نبين لهم الآيات } في سورة المائدة ( 75 ) وقد تقدم .\n\n",
      "translations": [
        {
          "translation": "(They said:) Moses, (We suffered hurt) we were tormented by the killing of our sons, the use of our women and also by working (before thou earnest unto us, and since thou hast come unto us) with the message. (He) Moses (said: it may be) the expression 'may be' ['asa] when used in relation to Allah denotes categoricalness (that your Lord is going to destroy your adversary) Pharaoh and by means of drought and hunger (and make you vicegerents in the earth) make you in the inhabitants of the land of Egypt, (that He may see how ye behave) with regard to obeying Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالُوۤاْ } يعني: بنو إسرائيل: { أُوذِينَا } من أجلك يا موسى { مِن قَبْلِ أَن تَأْتِينَا } بالرسالة بقتل الأبناء واستحياء النساء { وَمِن بَعْدِ مَا جِئْتَنَا } أيضاً كذلك { قَالَ } موسى: لا تيأسوا من نصرف الله وإنجاز وعده\n بل { عَسَىٰ رَبُّكُمْ أَن يُهْلِكَ عَدُوَّكُمْ } أي: قرب أمر ربكم وإنجاز وعده بإهلاك عدوكم { وَ } بعد أهلاكهم { يَسْتَخْلِفَكُمْ فِي ٱلأَرْضِ } التي هم فيها { فَيَنظُرَ كَيْفَ تَعْمَلُونَ } [الأعراف: 129] هل تشكرون نعمه أم تكفرونها أو تعلمون من الصالحات أم تفسدون فيها مثلهم؟",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قالوا } أي: بنوا إسرائيل: { أُوذينا من قبل أن تأتينا } بقتل الأبناء\n { ومن بعد ما جئتنا } بإعادته\n فلم يرتفع عنا الذل بمجيئك\n { قال عسى ربُّكم أن يُهلك عدوكم ويستخلِفَكم في الأرض } \n تصريحًا بما كِنّى عنه أولاً\n لما رأى أنهم لم يتسلوا بذلك\n ولعله أتى بحرف الطمع\n أي: الترجي لعدم جزمه بأنهم المستخلَفون بأعيانهم\n أو أولادهم\n وقد رُوِي أن مصر إنما فتح لهم في زمن داود عليه السلام\n قاله البيضاوي\n { فينظرَ كيف تعملون } أي: فإذا استخلفكم يرى ما تعملون من شكر أو كفران\n أو طاعة أو عصيان\n فيجازيكم على حسب ما يُوجد منكم من كفر أو إحسان\n الإشارة: ما وقع للأنبياء مع قومهم وقع مثله لأشياخ هذه الأمة وفقرائها مع أهل زمانهم\n ولما كثرت الأحوال من الفقر أو خرق العوائد\n وظهروا بتخريب ظواهرهم\n وقعت بهم الشكاية إلى السلطان\n وقالوا له: هؤلاء يخربون ملكك\n فآل على نفسه إنَّ مكنه الله منهم لا يترك منهم أحدًا\n فكفى الله بأسه\n فاستعانوا بالله وصبروا\n واشتغلوا بذكر الله\n وغابوا عمن سواه\n فكانت العاقبة للمتقين\n ثم ذكر ابتلاءه لقوم فرعون\n فقال: { وَلَقَدْ أَخَذْنَآ آلَ فِرْعَونَ بِٱلسِّنِينَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:14",
      "similarity": 0.3876529627052207
    },
    {
      "verse": "4:16",
      "similarity": 0.3834046991767059
    },
    {
      "verse": "6:34",
      "similarity": 0.37650631951288577
    },
    {
      "verse": "14:12",
      "similarity": 0.37358806403645306
    },
    {
      "verse": "9:61",
      "similarity": 0.36386912548851197
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007129.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007129.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:129.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}