{
  "chapter": "الأعراف",
  "text": "وما تنقم منا الا ان ءامنا بـايت ربنا لما جاءتنا ربنا افرغ علينا صبرا وتوفنا مسلمين",
  "translations": [
    {
      "translation": "You are only avenging yourself on us because we had iman in our Lord's Signs when they came to us. Our Lord, pour down steadfastness upon us and take us back to You as Muslims.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The only reason you have to hate us is that we believed in the signs of our Lord as they came to us. O our Lord, give us sufficient endurance that we may die submitting (to You).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will you punish us just because we believed in the signs of our Lord when they came to us? Our Lord! Shower us with perseverance and cause us to die as those who have submitted [to You].'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You only take revenge on us because we believed in the Lord when we saw His miracles. Lord, grant us patience and let us die Muslims (submitted to God).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And what did you dislike in us, except that we believed in the signs of our Lord when they came to us? Our Lord! Pour (bestow abundantly) patience on us, and bestow us death as Muslims.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you take vengeance on us only because we believed in the Ayat of our Lord when they reached us! Our Lord! pour out on us patience, and cause us to die as Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you do not take revenge on us except because we have believed in the communications of our Lord when they came to us! Our Lord: Pour out upon us patience and cause us to die in submission.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou takest vengeance upon us only because we have believed in the signs of our Lord when they came to us. Our Lord, pour out upon us patience, and gather us unto Thee surrendering.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thou takest vengeance on us only forasmuch as we believed the tokens of our Lord when they came unto us. Our Lord! Vouchsafe unto us steadfastness and make us die as men who have surrendered (unto Thee).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You would punish us only because we believed in the signs of our Lord when they were shown to us. Our Lord, pour patience upon us, and cause us to die in a state of submission to You.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And what is it for which thou takest vengeance on us save that we have believed in the signs of our Lord when they came unto us? Our Lord! pour out upon us perseverance and cause us to die as Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You are vindictive toward us only because we have believed in the signs of our Lord, when they came to us.’ ‘Our Lord! Pour patience upon us, and grant us to die as Muslims.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But thou dost wreak thy vengeance on us simply because we believed in the Signs of our Lord when they reached us! Our Lord! pour out on us patience and constancy, and take our souls unto thee as Muslims (who bow to thy will)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you take vengeance on us only because we believed in the Ayat (proofs, evidences, lessons, signs, etc.) of our Lord when they reached us! Our Lord! pour out on us patience, and cause us to die as Muslims.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "You would take revenge on us only because we believed in the signs of our Lord when they came to us. Lord, pour patience upon us and let us die as submitters (Muslims)'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“You are taking vengeance on us only because we have believed in the signs of our Lord when they have come to us.” “Our Lord! Pour out patience upon us, and receive our souls in submission.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you do not resent us except because we believed in the signs of our Lord when they came to us. Our Lord, pour upon us patience and let us die as Muslims [in submission to You].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:126] You are vindictive, spiteful, towards us only because we have believed in the signs of our Lord when they came to us. Our Lord, pour out onto us patience (and constancy), when that with which he has threatened us comes to pass, lest we revert to unbelief; and take us to You as men who have submitted’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thou takest vengeance on us) you are censuring and punishing us (only forasmuch as we believed the tokens of our Lord when they came unto us. Our Lord! Vouchsafe unto us steadfastness) honour us with steadfastness when we are crucified and mutilated and make it that we do not return to disbelief (and make us die as men who have surrendered (unto Thee)) sincerely, following the religion of Moses.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَمَا تَنقِمُ مِنَّآ } أيها الطاغي المتجبر المتكبر وتنكر عليها { إِلاَّ أَنْ آمَنَّا } أيقنا وأذعنا { بِآيَاتِ رَبِّنَا } الذي أظهرنا من كتم العدم\n وربانا بأنواع اللطف والكرم { لَمَّا } أي: حين { جَآءَتْنَا } تلك الآيات\n وانكشفنا بحقيتها بتوفيق منه وجذب من جانبه\n ولو كوشفت أيضاً بما انكشفنا\n ارتفع غطاء التعامي وغشاوة الغفلة عن بصرك وبصيرتك\n فتشهد بما شهدنا إلا أن الحق سبحانه ختم على قبلك وبصرك وسمعك بالغشاوة الغليظة والحجب الكثيفة\n لذلك استكبرت واستنكرت\n وبالجملة:\n[النور: 40]\n\n\nثم انصروا نحو الحق واشتغلوا بالمناجاة معه سبحانه\n فقالوا متضرعين: { رَبَّنَآ } يا من ربانا بلطفك وكرمك إلى أن جعلتنا من زمرة شهدائك الذين بذلوا مهجهم في سبيلك طائعين راغبين { أَفْرِغْ } أفض واصبب { عَلَيْنَا صَبْراً } من عندك متوالياً متتابعاً حين اشتغل هذا الطاغي على قضاء ما هددنا به بحيث لا يغيب عنا شوقك\n ولا يغلب على قلوبنا ألم ناسوتنا اصلآً { وَ } حين انقطعت أنفاسنا وخرجت أرواحنا { تَوَفَّنَا مُسْلِمِينَ } [الأعراف: 126] مستقرين على الرضا والتسليم\n ثابتين على جادة التوحيد والعرفان بلا تزلزل وتمايل\n\n\nثبت أقدامنا على دينك وتوحيدك يا خير الناصرين\n\n\n{ وَ } بعدما فعل فرعون بالسحرة أنار الله براهينهم ما هددهم به { قَالَ ٱلْمَلأُ مِن قَوْمِ فِرْعَونَ أَتَذَرُ مُوسَىٰ وَقَوْمَهُ } يعني: بني إسرائيل { لِيُفْسِدُواْ فِي ٱلأَرْضِ } سيما بعدما انتشر في أقطار الأرض غلبتهما عليك\n ويغيروا طباع الناس عنك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "94:7",
      "similarity": 0.6837062912393893
    },
    {
      "verse": "55:31",
      "similarity": 0.6713399144360347
    },
    {
      "verse": "28:10",
      "similarity": 0.39843835835231617
    },
    {
      "verse": "85:8",
      "similarity": 0.36368806339280785
    },
    {
      "verse": "2:250",
      "similarity": 0.3569093144137588
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007126.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007126.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:126.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}