{
  "chapter": "الأعراف",
  "text": "فانتقمنا منهم فاغرقنهم فى اليم بانهم كذبوا۟ بـايتنا وكانوا۟ عنها غفلين",
  "translations": [
    {
      "translation": "Then We took revenge on them and drowned them in the sea because they denied Our Signs and paid no attention to them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We took vengeance on them, and drowned them in the sea for rejecting Our signs and not heeding them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We inflicted Our retribution on them, and caused them to drown in the sea because they gave the lie to Our signs and were heedless of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We took revenge on them for their rejecting Our miracles, by drowning them in the sea, but they were not aware of (reality).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We therefore took revenge from them; so We drowned them in the sea for they used to deny Our signs and were ignoring them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We took retribution from them. We drowned them in the sea, because they belied Our Ayat and were heedless with them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore We inflicted retribution on them and drowned them in the sea because they rejected Our signs and were heedless of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We took vengeance on them, and drowned them in the sea, for that they cried lies to Our signs and heeded them not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore We took retribution from them; therefore We drowned them in the sea: because they denied Our revelations and were heedless of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We exacted retribution from them and drowned them in the sea, because they rejected Our signs and paid no heed to them;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Wherefore We took vengeance on them and drowned them in the sea, for they belied Our signs and were neglectful of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We took vengeance on them and drowned them in the sea, for they denied Our signs and were oblivious to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We exacted retribution from them: We drowned them in the sea, because they rejected Our Signs and failed to take warning from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We took retribution from them. We drowned them in the sea, because they belied Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) and were heedless about them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We punished them and drowned them in the sea, for they had belied Our signs and gave no heed to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We took vengeance on them, and drowned them in the sea—because they rejected Our signs, and paid no heed to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We took retribution from them, and We drowned them in the sea because they denied Our signs and were heedless of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:136] So We exacted retribution from them and therefore We drowned them in the sea (al-yamm denotes salty waters) for, the reason, that they denied Our signs and were heedless of them, not reflecting upon them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Therefore We took retribution from them) once and for all; (therefore We drowned them in the sea: because they denied Our) nine (revelations and were heedless of them) they were disbelievers in them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فِي ٱلْيَمِّ } معناهُ فِي البَحْرِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {in the sea}, means in the ocean.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما بالغوا في أمر النقض والنكث وخالفوا أمرنا وكذبوا نبينا { فَٱنْتَقَمْنَا مِنْهُمْ } أي: أردنا انتقامهم وأخذهم { فَأَغْرَقْنَاهُمْ فِي ٱلْيَمِّ } أي: البحر العميق لانهماكهم في بحر الغفلة والطغيان { بِأَنَّهُمْ كَذَّبُواْ بِآيَاتِنَا } الدالة الموصلة إلى توحيدنا الذاتي { وَكَانُواْ } بسبب استغراقهم في بحر الغفلة والضلا { عَنْهَا غَافِلِينَ } [الأعراف: 136] محجوبين لا يهتدون بأهداء الرسل والإنبياء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والمعنى: ادع الله متوسلاً إليه بما عهد عندك من النبوة والجاه، أو بدعائك إليه ووسائلك، { لئن كشفت عنا الرجز }: العذاب { لنُؤمنن لك } أي: أقسمنا بعهد الله لئن كشفت عنا الرجز لنؤمن لك { ولنرسلنَّ معك بني إسرائيل } كما طلبت، قال تعالى: { فلما كشفنا عنهم الرِّجزَ إلى أجل هم بالغوه } إلى حد من الزمان هم بالغوه ثم يُهلكون، وهو وقت الغرق أو الموت، وقيل: إلى أجل عينوه لإيمانهم، { إذا هم ينكُثُون } جواب \" لَمَّا \" أي: فلما كشفنا عنهم جاؤوا بالنكث من غير تأمل ولا توقف، { فانتقمنا منهم } أي: فأردنا الانتقام منهم، { فأغرقناهم في اليم } أي: البحر الذي لا يدرك قعره أو لجته، { بأنهم } أي: بسبب أنهم { كذَّبوا بآياتنا } التي أرسلناها عليهم\n { وكانوا عنها غافلين } أي: أغرقناهم بسبب تكذيبهم بالآيات وعدم فكرهم فيها حتى صاروا كالغافلين عنها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:78",
      "similarity": 0.4555539229233707
    },
    {
      "verse": "28:40",
      "similarity": 0.4004971597960649
    },
    {
      "verse": "15:79",
      "similarity": 0.39608971445819496
    },
    {
      "verse": "43:25",
      "similarity": 0.39069553165339643
    },
    {
      "verse": "85:8",
      "similarity": 0.3827819513924029
    }
  ]
}