{
  "chapter": "الأعراف",
  "text": "وجوزنا ببنى اسرءيل البحر فاتوا۟ على قوم يعكفون على اصنام لهم قالوا۟ يموسى اجعل لنا الها كما لهم ءالهة قال انكم قوم تجهلون",
  "translations": [
    {
      "translation": "We conveyed the tribe of Israel across the sea and they came upon some people who were devoting themselves to some idols which they had. They said. 'Musa, give us a god just as these people have gods.' He said, 'You are indeed an ignorant people.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We brought the children of Israel across the sea, and they came to a people who were devoted to their idols, they said: \"O Moses, make us also a god like theirs.\" \"You are ignorant,\" he replied.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We led the Children of Israel across the sea; and then they came upon a people who were devoted to the worship of their idols. They said: 'O Moses, make for us a god even as they have gods.' Moses said: 'You are indeed an ignorant people.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We helped the children of Israel to cross the sea. They came to a people who worshipped idols. The Israelites demanded Moses to make gods for them like those of the idol-worshippers. Moses told them, \"You are an ignorant people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We transported the Descendants of Israel across the sea – so they came across a people who used to squat in seclusion in front of their idols; they said, “O Moosa! Make a God for us, the way they have so many Gods!” He said, “You are indeed an ignorant people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We brought the Children of Israel (with safety) across the sea, and they came upon a people devoted to some of their idols (in worship). They said: \"O Musa! Make for us a god as they have gods.\" He said: \"Verily, you are an ignorant people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made the children of Israel to pass the sea; then they came upon a people who kept to the worship of their idols They said: O Musa! make for us a god as they have (their) gods He said: Surely you are a people acting ignorantly:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We brought the Children of Israel over the sea, and they came upon a people cleaving to idols they had. They said, 'Moses, make for us a god, as they have gods.' Said he, 'You are surely a people who are ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We brought the Children of Israel across the sea, and they came unto a people who were given up to idols which they had. They said: O Moses! Make for us a god even as they have gods. He said: Lo! ye are a folk who know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We brought the children of Israel across the sea and they came upon a people who were devoted to their idols. They said, \"Moses, give us a god just like the gods these people have.\" He said, \"You are indeed an ignorant people:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We led the Children of Isra'il across the sea. Then they came upon a people cleaving to the idols they had. T'hev said: Musa! make for us a god even as they have gods. He said: verily ye are a people given to ignorance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We carried the Children of Israel across the sea, whereat they came upon a people cleaving to certain idols that they had. They said, ‘O Moses, make for us a god like the gods that they have.’ He said, ‘You are indeed an ignorant lot.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We took the Children of Israel (with safety) across the sea. They came upon a people devoted entirely to some idols they had. They said: \"O Moses! fashion for us a god like unto the gods they have.\" He said: \"Surely ye are a people without knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We brought the Children of Israel (with safety) across the sea, and they came upon a people devoted to some of their idols (in worship). They said: \"O Musa (Moses)! Make for us an ilahan (a god) as they have aliha (gods).\" He said: \"Verily, you are a people who know not (the Majesty and Greatness of Allah and what is obligatory upon you, i.e. to worship none but Allah Alone, the One and the Only God of all that exists).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and We moved the Children of Israel from one side of the sea to the other, and they came upon a nation zealously devoted to the idols they had. They said to Moses: 'Make a god for us, as they have gods' Moses replied: 'You are indeed an ignorant nation.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We delivered the Children of Israel across the sea. And when they came upon a people who were devoted to some statues of theirs, they said, “O Moses, make for us a god, as they have gods.” He said, “You are truly an ignorant people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We took the Children of Israel across the sea; then they came upon a people intent in devotion to [some] idols of theirs. They said, \"O Moses, make for us a god just as they have gods.\" He said, \"Indeed, you are a people behaving ignorantly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:138] And We brought the Children of Israel across the sea, and they came upon, they passed by, a people cleaving in devotion (read ya‘kufūn or ya‘kifūn) to idols they had, constantly worshipping them. They said, ‘O Moses, make for us a god, an idol for us to worship, just as they have gods.’ He said, ‘Truly you are an ignorant folk, for repaying God’s grace to you with what you have said.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We brought the Children of Israel across the sea, and they came unto a people) called al-Raqim, remnants of the people of Abraham, (who were given up to idols which they had) who worshipped idols. (They said: Moses! Make for us a god) show us a god to worship (even as they have gods) to worship. 172 (He) Moses (said: Lo! ye are a folk who know not) the command of Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { يَعْكُفُونَ } معناهُ يُقيمونَ\n\n",
      "translations": [
        {
          "translation": " And His saying, {they perform al-`itikaf}, its meaning is they perform al-`itikaf.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم أشار إلى قبح صنيع بني إسرائيل وخبث طينتهم وجهلهم المركون في جبلتهم وسخافة طبعهم، وركاكة فطنتهم؛ تسية لرسول الله صلى الله عليه وسلم وتذكيراً للمؤمنين ليحترزوا عن أمثال ما أتوا به، فقال: { وَجَاوَزْنَا بِبَنِيۤ إِسْرَآئِيلَ } أي: عبرناهم سالمين غانمين { ٱلْبَحْرَ } الذي أهل عدوهم { فَأَتَوْاْ } أي: مروا في طريقهم { عَلَىٰ قَوْمٍ } من بقية العمالقة { يَعْكُفُونَ } يعبدون ويقيمون { عَلَىٰ أَصْنَامٍ } تماثيل كانت معبودات { لَّهُمْ } من دون الله\n\n\n\n\n{ قَالُواْ } من قسوة قلوبهم وضعف يقينهم بالله المنزه عن الأشياء والأمثال { يٰمُوسَىٰ } المبعوث المرسل إلينا من الله الواحد الأحد { ٱجْعَلْ لَّنَآ إِلَـٰهاً } مثالاً واحداً مشابهاً لله نبعده ونتقرب نحوه { كَمَا لَهُمْ آلِهَةٌ } يعبدونها ويتقربون نحوها، ونحن كيف نعبد نتقرب إلى إله موهوم لا نراه ولا نشاهده؟ وكيف نتضرع إليه ونتوجه نحوه ونستحي منه ونخاف عنه؟ ثم لما تفرس منهم موسى ما تفرس من الحجاب الكثيف والغشاوة الغليظة { قَالَ إِنَّكُمْ قَوْمٌ تَجْهَلُونَ } [الأعراف: 138] تستمرون على جهلكم الجبلي، لم يؤثر فيكم الآيات الكبرى والبراهين العظمى، ولم تتفطنوا بالتوحيد الذاتي مع وضوحه في ذاته سيما بعد الإيضاح بالآيات الظاهرة والمعجزات الباهرة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:71",
      "similarity": 0.6356393425587538
    },
    {
      "verse": "10:90",
      "similarity": 0.457162369041175
    },
    {
      "verse": "46:16",
      "similarity": 0.4508751131070042
    },
    {
      "verse": "14:35",
      "similarity": 0.4392237650190894
    },
    {
      "verse": "21:57",
      "similarity": 0.39427684212514247
    }
  ]
}