{
  "chapter": "الأعراف",
  "text": "فلما كشفنا عنهم الرجز الى اجل هم بلغوه اذا هم ينكثون",
  "translations": [
    {
      "translation": "But when We removed the plague from them - for a fixed term which they fulfilled - they broke their word.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But no sooner was the punishment withdrawn for a time to enable them to make good their promise than they broke it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when We removed the scourge from them until a term - a term which they were bound to reach - they at once broke their promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when We relieved them from the torment for a given time, they again broke their promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Consequently whenever We lifted the punishment from them for a term which they must reach, they used to then turn away.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when We removed the punishment from them for a fixed term, which they had to reach, behold! They broke their word!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when We removed the plague from them till a term which they should attain lo! they broke (the promise).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when We removed from them the wrath unto a term that they should come to, lo, they broke their troth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when We did remove from them the terror for a term which they must reach, behold! they broke their covenant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but whenever We removed the plague from them, giving them time to make good their promise, they would break their word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then whensoever We removed the plague from them, till a term which they were to reach, lo! they were breaking faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when We had removed the plague from them until a term that they should have completed, behold, they broke their promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But every time We removed the penalty from them according to a fixed term which they had to fulfil,- Behold! they broke their word!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when We removed the punishment from them to a fixed term, which they had to reach, behold! They broke their word!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when We had lifted the plague from them for a term which they had to reach, they broke their promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when We lifted the plague from them, for a term they were to fulfill, they broke their promise.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when We removed the punishment from them until a term which they were to reach, then at once they broke their word.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:135] But when We removed, through the supplication of Moses, the terror from them to a term which they should reach, lo! they were already reneging, breaking their covenant and persisting in their disbelief.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But when We did remove from them the terror) the punishment (for a term which they must reach) i.e. the drowning, (behold! they broke their covenant) they broke their pledge to Moses.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَماَّ كَشَفْنَا عَنْهُمُ ٱلرِّجْزَ } بدعائه { إِلَىٰ أَجَلٍ هُم بَالِغُوهُ } عينوه لأيمانهم وإرسالهم حتى يتأملوا ويتفكروا فيها { إِذَا هُمْ يَنكُثُونَ } [الأعراف: 135] أي: بعدما وصل وقت الوفاء والإيفاء بالعهود والمواثيق، بادروا إلى النقض والنكث\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "43:50",
      "similarity": 0.7528651140712953
    },
    {
      "verse": "7:134",
      "similarity": 0.4922121529866428
    },
    {
      "verse": "48:10",
      "similarity": 0.447143419206005
    },
    {
      "verse": "45:11",
      "similarity": 0.42899465789743957
    },
    {
      "verse": "74:5",
      "similarity": 0.42601031830332753
    }
  ]
}