{
  "chapter": "الأعراف",
  "text": "قال فاهبط منها فما يكون لك ان تتكبر فيها فاخرج انك من الصغرين",
  "translations": [
    {
      "translation": "He said, 'Descend from Heaven. It is not for you to be arrogant in it. So get out! You are one of the abased.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So God said: \"Descend. You have no right to be insolent here. Go, and away; you are one of the damned.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: 'Then get you down from here. It does not behove you to be arrogant here. So be gone. You will be among the humiliated.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord ordered Satan to get out (of Paradise) saying, \"This is no place for you to be proud. Get out of this place, for you are worthless\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Allah, “Therefore go down from here – it does not befit you to stay here and be proud – exit, you are of the degraded.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"(O Iblis) get down from this (Paradise), it is not for you to be arrogant here. Get out, for you are of those humiliated and disgraced.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Then get forth from this (state), for it does not befit you to behave proudly therein. Go forth, therefore, surely you are of the abject ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said He, 'Get thee down out of it; it is not for thee to wax proud here, so go thou forth; surely thou art among the humbled.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Then go down hence! It is not for thee to show pride here, so go forth! Lo! thou art of those degraded.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God said, \"Get down from here! This is no place for your arrogance. Get out! You are contemptible!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: then get thee down from hence; not for thee is it to be stiff-necked herein. So go thou forth; verily thou art of the abject ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘Get down from it!’ He said. ‘It is not for you to be arrogant therein. Begone! You are indeed among the degraded ones.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"Get thee down from this: it is not for thee to be arrogant here: get out, for thou art of the meanest (of creatures).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"(O Iblis) get down from this (Paradise), it is not for you to be arrogant here. Get out, for you are of those humiliated and disgraced.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He (Allah) said: 'Descend from it! This is no place for you to be proud. Begone, you are of the humiliated'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Get down from it! It is not for you to act arrogantly in it. Get out! You are one of the lowly!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah] said, \"Descend from Paradise, for it is not for you to be arrogant therein. So get out; indeed, you are of the debased.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:13] Said He, ‘Then go down from it, that is, from the Garden — it is also said, [go down] from the heavens — it is not, right, for you to show pride here, so go forth, out of it! Surely you are among the abased!’, the contemptible!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "157 (He said) Allah said to him: (Then go down hence!) go down from heaven; it is also said this means: come out of angelic form. (It is not for thee) you ought not (to show pride here) demonstrate pride, in the form of an angel, to the Children of Adam, (so go forth!) leave your angelic form; it is also said that this means: go forth from the earth; (Lo! thou art of those degraded) you are of those who are humiliated in that you are punished.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nلما امتنع عن مقتضى الأمر الوجوبي، ولم يتفطن بسره الذي هو التوحيد الذاتي؛ إذ الأمر سجود المظهر الجامع والظل الكامل، أمر بالتوجه نحو الذات الأحدية والمعبود الحقيقي المتجلي عليه، طرده سبحانه عن ساحة عز حضوره حيث { قَالَ } مبعداً: { فَٱهْبِطْ } أيها المطرود الملعون { مِنْهَا } أي: من ساحة عز التوحيد المقتضية للتذلل التشخع، ورفض الالفتات إلى الغير والسوى مطلقاً { فَمَا يَكُونُ } يجوز ويصح { لَكَ أَن تَتَكَبَّرَ فِيهَا } بادعاء التفضل والتفوق المتقضي للإضافات الناشئة من أنانيتك الباطلة { فَٱخْرُجْ } منها مطروداً مخذولاً { إِنَّكَ } حيث كنتن وأين كنت { مِنَ ٱلصَّاغِرِينَ } [الأعراف: 13] الذليلين المحرومين، بل أنت سبب صغار سائر الأذلاء\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ولما تبين عناده قال له تعالى: { فاهبط منها } أي: من السماء أو من الجنة، { فما يكونُ لك } أي: فما يصح لك { أن تتكبَّر فيها } وتعصى فإنها موطن الخاشع المطيع، وفيه دليل على أن الكبر لا يليق بأهل الجنة، فإنه تعالى إنما أنزله وأهبطه لتكبره لا لمجرد عصيانه، { فاخرج إنك من الصاغرين } أي: ممن أهانه الله لتكبره\n قال صلى الله عليه وسلم:\n\n \" مَن تَوَاضَعَ للهِ رَفَعَهُ الله، ومَن تَكَبَّر وَضَعَه الله \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:24",
      "similarity": 0.5684468173863914
    },
    {
      "verse": "2:38",
      "similarity": 0.5386379170495554
    },
    {
      "verse": "20:123",
      "similarity": 0.5257465967655013
    },
    {
      "verse": "11:48",
      "similarity": 0.5137874090638576
    },
    {
      "verse": "54:53",
      "similarity": 0.45129163318173926
    }
  ]
}