{
  "chapter": "الأعراف",
  "text": "قال يموسى انى اصطفيتك على الناس برسلتى وبكلمى فخذ ما ءاتيتك وكن من الشكرين",
  "translations": [
    {
      "translation": "He said, 'Musa, I have chosen you over all mankind for My Message and My Word. Take what I have given you and be among the thankful.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said (the Lord): \"O Moses, I raised you above all men by sending My messages and speaking to you; so receive what I give you, and be grateful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'O Moses! I have indeed preferred you to all others by virtue of the Message I have entrusted to you and by virtue of My speaking to you. Hold fast therefore, to whatever I have granted you, and give thanks.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord said to Moses, \"I have given you distinction above the people by speaking to you and giving you My Message. Receive what I have given to you and give Us thanks.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said Allah, “O Moosa! I have chosen you from mankind by (bestowing) My messages and by My speech; so accept what I have bestowed upon you and be among the thankful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"O Musa I have chosen you above men by My Messages, and by My speaking (to you). So hold that which I have given you and be of the grateful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O Musa! surely I have chosen you above the people with My messages and with My words, therefore take hold of what I give to you and be of the grateful ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said He, 'Moses, I have chosen thee above all men for My Messages and My Utterance; take what I have given thee, and be of the thankful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O Moses! I have preferred thee above mankind by My messages and by My speaking (unto thee). So hold that which I have given thee, and be among the thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He replied, \"Moses, I have chosen you of all mankind for My messages and My Words. Hold fast to what I have given you, and be among the grateful!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: O Musa! verily I have chosen thee above mankind by My messages and by My speaking; so hold fast thou that which I have given thee, and be of the thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘O Moses, I have chosen you over the people with My messages and My speech. So take what I give you, and be among the grateful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"O Moses! I have chosen thee above (other) men, by the mission I (have given thee) and the words I (have spoken to thee): take then the (revelation) which I give thee, and be of those who give thanks.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"O Musa (Moses) I have chosen you above men by My Messages, and by My speaking (to you). So hold that which I have given you and be of the grateful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'Moses, I have chosen you from all mankind with My Messages and My Words. Therefore, take what I have given you, and be among the thankful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “O Moses, I have chosen you over all people for My messages and for My Words. So take what I have given you, and be one of the thankful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah] said, \"O Moses, I have chosen you over the people with My messages and My words [to you]. So take what I have given you and be among the grateful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:144] He, God, said, to him: ‘O Moses, I have elected you, chosen you, from among mankind, the people of your time, for My Messages (read plural, bi-risālātī, or singular, bi-risālatī, ‘for My Message’) and My Speech, that is, [for] My having spoken to you. So take what I have given you, of bounty, and be of the thankful’, of My favours.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said : Moses! I have preferred thee above mankind) above the Children of Israel (by My messages and by My speaking (unto thee). So hold that which I have given thee) act upon that which I have given you, (and be among the thankful) that I chose to speak to you from among all people.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولا تبادر إلى سؤل ما لا طاقة لك { وَكُنْ مِّنَ ٱلشَّاكِرِينَ } [الأعراف: 144] لنعمه\n واصرفها على الوجه الذي أمرناك به من المصارف ووفقناك عليه ولا تكن من الكفارين لنعمنا\n المنصرفين عن أوامرنا وأحكامنا\n لتفوز منا بالرضا الذي هو أحسن أحوال أرباب الكشف والشهود\n\n{ وَكَتَبْنَا } من جملة اصطفائنا وإنعامنا إياه إنا كتبنا { لَهُ } أي: أثبتنا لأجل تربيته وإرشاده { فِي ٱلأَلْوَاحِ } أي: ألواح التوراة { مِن كُلِّ شَيْءٍ } يتعلق بتهذيب الظهر والباطن { مَّوْعِظَةً } تذكره وتبياناً يتعظ بها هو ومن تبعة { وَتَفْصِيلاً } توضيحاً وتبييناً متعلقاً { لِّكُلِّ شَيْءٍ } أي: لكل حكم من الأحكام المتعلقة بأمور معاشهم { فَخُذْهَا } أي: فقلنا له: خذها أيها الداعي للخلق إلى الحق { بِقُوَّةٍ } عزيمة صادقة وجزم خالص { وَأْمُرْ قَوْمَكَ } أيضاً { يَأْخُذُواْ بِأَحْسَنِهَا } يعني: بعزائمها دون رخصها حتى تستعد نفوسهم لأن يفيض عليها من المعارف والحقائق والمكاشفات والمشاهدات التي هي عبارة ع الجنة المأوى والمرتبة العليا عند العارف",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الرُّشد والرَّشَد: لغتان\n قُرىء بهما\n يقول الحقّ جلّ جلاله: { قال يا موسى إني اصطفيتُك } اخترتك { على الناس } الموجودين في زمانك\n وهارون\n وإن كان نبيًا\n كان مأمورًا باتباعه\n ولم يكن كليما ولا صاحب شرع\n فقد اصطفيتك على أهل زمانك { برسالتي } لك إليهم\n ومن قرأ بالجمع فالمراد: أوقات التبليغ بأنواع الأحكام أو أسفار التوراة\n { و } خصصتك { بكلامي } \n وقد شاركه نبينا محمد صلى الله عليه وسلم مع زيادة الرؤية\n { فخُذ ما آتيتك } أي: أعطيتك من الرسالة والتكليم\n وأقنع بهما ولا تطلب غير ذلك\n { وكن من الشاكرين } على هذه النعمة\n وفيه نوع تأديب له\n رُوِي أن سؤال الرؤية كان يوم عرفة\n وأعطاه التوراة يوم النحر\n قال تعالى: { وكتبنا له في الألواح من كل شيءٍ } يحتاجون إليه { موعظةً } أي: تذكيرًا { وتفصيلاً لكل شيءٍ } يتوقفون عليه في الأحكام والوعظ\n واختلف في الألواح: هل كانت سبعة أو عشرة أو اثنين\n وهل كانت من زمرد أو زبرجد أو ياقوت أحمر\n أو خشب\n أو صخرة صماء\n شقها الله تعالى لموسى عليه السلام فقطعها بيده\n وكان فيها التوراة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "22:75",
      "similarity": 0.6703558247315279
    },
    {
      "verse": "37:153",
      "similarity": 0.6665075866948692
    },
    {
      "verse": "43:16",
      "similarity": 0.6640563166631269
    },
    {
      "verse": "38:47",
      "similarity": 0.6598015500442796
    },
    {
      "verse": "17:40",
      "similarity": 0.5574922831675002
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/7:144.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/7:144.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/7:144.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}