{
  "chapter": "الأعراف",
  "text": "ووعدنا موسى ثلثين ليلة واتممنها بعشر فتم ميقت ربه اربعين ليلة وقال موسى لاخيه هرون اخلفنى فى قومى واصلح ولا تتبع سبيل المفسدين",
  "translations": [
    {
      "translation": "We set aside thirty nights for Musa and then completed them with ten, so the appointed time of his Lord was forty nights in all. Musa said to his brother Harun, 'Be my khalif among my people. Keep order and do not follow the way of the corrupters.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made an appointment of thirty nights with Moses (On Mount Sinai) to which We added ten more; so the term set by the Lord was completed in forty nights. Moses said to Aaron, his brother: \"Deputise for me among my people. Dispose rightly, and do not follow the way of the authors of evil.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We appointed for Moses thirty nights, to which We added ten, whereby the term of forty nights set by his Lord was fulfilled. And Moses said to Aaron, his brother: 'Take my place among my people, act righteously, and do not follow the path of those who create mischief.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We told Moses to stay with Us for thirty nights (in the mountains) but added ten nights more so his appointment with his Lord came to an end after forty nights. Moses had appointed his brother Aaron as his deputy among his people during his absence saying, \"Try to reform them and do not follow the way of the evil-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We agreed with Moosa a covenant for thirty nights (of solitude) and completed it by adding ten to them, so the covenant of His Lord amounted to forty nights in full; and Moosa said to his brother Haroon, “Be my deputy over my people and make reform and do not allow the ways of the mischievous to enter.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We appointed for Musa thirty nights and added ten, and he completed the term, appointed by his Lord, of forty nights. And Musa said to his brother Harun: \"Replace me among my people, act in the right way and follow not the way of the mischief-makers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We appointed with Musa a time of thirty nights and completed them with ten (more), so the appointed time of his Lord was complete forty nights, and Musa said to his brother Haroun: Take my place among my people, and act well and do not follow the way of the mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We appointed with Moses thirty nights and We completed them with ten, so the appointed time of his Lord was forty nights; and Moses said to his brother Aaron, 'Be my successor among my people, and put things right, and do not follow the way of the workers of corruption.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We did appoint for Moses thirty nights (of solitude), and added to them ten, and he completed the whole time appointed by his Lord of forty nights; and Moses said unto his brother, Aaron: Take my place among the people. Do right, and follow not the way of mischief-makers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We appointed thirty nights for Moses, then added ten more: the term set by his Lord was fulfilled in forty nights. Moses said to his brother Aaron, \"Take my place among my people: act rightly and do not follow the way of those who spread corruption.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We treated with Musa thirty nights, and We completed them with ten; so the appointment of his Lord was completed by forty nights. And Musa said unto his brother Harun: act thou in my place among my people, and rectify, and follow not the way of the corrupters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We made an appointment with Moses for thirty nights, and completed them with ten [more]; thus the tryst of his Lord was completed in forty nights. And Moses said to Aaron, his brother, ‘Be my successor among my people, and set things right and do not follow the way of the agents of corruption.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We appointed for Moses thirty nights, and completed (the period) with ten (more): thus was completed the term (of communion) with his Lord, forty nights. And Moses had charged his brother Aaron (before he went up): \"Act for me amongst my people: Do right, and follow not the way of those who do mischief.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We appointed for Musa (Moses) thirty nights and added (to the period) ten (more), and he completed the term, appointed by his Lord, of forty nights. And Musa (Moses) said to his brother Harun (Aaron): \"Replace me among my people, act in the Right Way (by ordering the people to obey Allah and to worship Him Alone) and follow not the way of the Mufsidun (mischief-makers).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We appointed for Moses thirty nights, and We completed them with ten more; so that the appointment with his Lord took forty nights. Moses said to Aaron, his brother: 'Take my place among my nation. Do what is right and do not follow the path of the corrupt doers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We appointed to Moses thirty nights, and completed them with ten; and thus the time appointed by his Lord was forty nights. And Moses said to his brother Aaron: “Take my place among my people, and be upright, and do not follow the way of the mischief-makers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We made an appointment with Moses for thirty nights and perfected them by [the addition of] ten; so the term of his Lord was completed as forty nights. And Moses said to his brother Aaron, \"Take my place among my people, do right [by them], and do not follow the way of the corrupters.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:142] And We appointed (read wa-wā‘adnā or wa-wa‘adnā) for Moses thirty nights, at the end of which We would speak to him, after he has fasted [during that period]; that was the month of Dhū’l-Qa‘da. He completed the fast. But when it came to an end, he disliked the [bad] odour of his mouth and so cleaned his teeth. God then commanded him [to fast for] another ten nights so that He may speak to him despite the odour in his mouth: as God says, and completed them with ten, nights of Dhū’l-Hijja. Thus was the time appointed by his Lord concluded, the time at which God had promised him to speak to him, as forty (arba‘īna is a circumstantial qualifier) nights (laylatan is for specification); and Moses said to his brother Aaron, when he was departing to the Mount for the communion [with his Lord]: ‘Succeed me, be my deputy, over my people, and be righteous, [among them] with regard to their affair, and do not follow the way of the agents of corruption’, by consenting with them to acts of disobedience.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعَوْد إلى بقية حوادث بني إسرائيل ، بعد مجاوزتهم البَحر ، فالجملة عطف على جملة : { وجاوزنا ببني إسرائيل البحر } \\[ الأعراف : 138 \\].وقد تقدم الكلام على معنى المواعدة في نظير هذه الآية في سورة البقرة ، وقرأ أبو عمرو : وَوَعَدْنَا . وحذف الموعود به اعتماداً على القرينة في قوله : { ثلاثين ليلة } الخ ، و { ثلاثين } منصوب على النيابة عن الظرف ، لأن تمييزه ظرف للمواعد به وهو الحضور لتلقي الشريعة ، ودل عليه { واعدنا } لأن المواعدة للقاء فالعامل { واعدنا } باعتبار المقدر ، أي حضوراً مدة ثلاثين ليلة .وقد جعل الله مدة المناجاة ثلاثين ليلة تيسيراً عليه ، فلما قضاها وزادت نفسه الزكية تعلقاً ورغبة في مناجاة الله وعبادته ، زاده الله من هذا الفضل عشر ليال ، فصارت مدة المناجاة أربعين ليلة ، وقد ذكر بعض المفسرين قصة في سبب زيادة عشر ليال ، لم تصح ، ولم يزده على أربعين ليلة : إما لأنه قد بلغ أقصى ما تحتمله قوته البشرية فباعَدهُ الله من أن تعرض له السّآمة في عبادة ربه ، وذلك يُجنّب عنه المتقون بَله الأنبياء ، وقد قال النبي صلى الله عليه وسلم \" عليكم من الأعمال بما تطيقون فإن الله لا يمل حتى تملوا \" وإما لأن زيادة مغيبه عن قومه تفضي إلى أضرار ، كما قيل : إنهم عبدوا العجل في العشر الليالي الأخيرة من الأربعين ليلة ، وسميت زيادةُ الليالي العشر إتماماً إشارة إلى أن الله تعالى أراد أن تكون مناجاة موسى أربعين ليلة ، ولكنه لما أمره بها أمره بها مفرقة ، إما لحكمة الاستيناس ، وإما لتكون تلك العشر عبادة أخرى فيتكرر الثواب ، والمراد الليالي بأيامها فاقتصر على الليالي؛ لأن المواعدة كانت لأجل الانقطاع للعبادة وتلقي المناجاة .والنفس في الليل أكثر تجرداً للكمالات النفسانية ، والأحوال المَلَكية ، منها في النهار ، إذ قد اعتادت النفوس بحسب أصل التكوين الاستيناسُ بنور الشمس والنشاط به للشغل ، فلا يفارقها في النهار الاشتغال بالدنيا ولو بالتفكر وبمشاهدة الموجودات ، وذلك ينحّط في الليل والظلمة ، وتنعكس تفكرات النفس إلى دَاخلها ، ولذلك لم تزل الشريعة تحرض على قيام الليل وعلى الابتهال فيه إلى الله تعالى ، قال : { تتجافى جنوبهم عن المضاجع يدعون ربهم خوفاً وطمعاً } \\[ السجدة : 16 \\] الآية ، وقال : { وبالأسحار هم يستغفرون } ، وفي الحديث : \" ينزل ربّنا كل ليلة إلى السماء الدنيا في ثلث الليل الأخير فيقول هل من مستغفر فأغفر له ، هل من داع فأستجيب له \" ولم يزل الشغل في السهر من شعار الحكماء والمرتاضين لأن السهر يلطف سلطان القوة الحيوانية كما يلطفها الصوم قال في «هياكل النور» «النّفوسُ الناطقة من عالم الملكوت ، وإنما شغَلها عن عالَمها القوى البدنية ومشاغَلتُها فإذا قويتْ النفس بالفضائل الرُوحانية وضعُف سلطان القُوى البدنية بتقليل الطعام وتكثير السهر تتخلص أحياناً إلى عالم القُدس وتتصل بربها وتتلقى منه المعارف» .على أن الغالب في الكلام العربي التوقيتُ بالليالي ، ويُريدون أنها بأيامها ، لأن الأشهر العربية تُبتدأ بالليالي إذ هي منوطة بظهور الأهلة .وقوله { فَتَم ميقاتُ ربه أربعينَ ليلة } فذلكةُ الحساب كما في قوله : { فصيام ثلاثة أيام في الحج وسبعة إذا رجعتم تلكَ عشرة كاملة } \\[ البقرة : 196 \\] ، فالفاء للتفريع .والتمام الذي في قوله : { فتم ميقات ربه } مستعمل في معنى النماء والتفوق فكان ميقاتاً أكمل وأفضل كقوله تعالى : { تماماً على الذي أحسنَ } \\[ الأنعام : 154 \\] إلى قوله : { وأتممت عليكم نعمتي } \\[ المائدة : 3 \\] إشارة إلى أن زيادة العشر كانت لحكمة عظيمة تكون مدة الثلاثين بدونها غير بالغة أقصى الكمال ، وأن الله قدر المناجاة أربعين ليلة ، ولكنه أبرز الأمر لموسى مفرقاً وتيسيراً عليه ، ليكون إقبالُه على إتمام الأربعين باشتياق وقوة .وانتصب { أربعين } على الحال بتأويل : بالغاً أربعين .والميقات قيل : مرادف للوقت ، وقيل هو وقت قدّر فيه عمل مّا ، وقد تقدم في قوله تعالى : { قل هي مواقيت للناس والحج } في سورة البقرة ( 189 ).وإضافته إلى { ربه } للتشريف ، وللتعريض بتحميق بعض قومه حين تأخر مغيب موسى عنهم في المناجاة بعد الثلاثين ، فزعموا أن موسى هلَك في الجبَل كما رواه ابن جُريج ، ويشهد لبعضه كلام التوراة في الإصحاح الثاني والثلاثين من سفر الخروج .أي : قال موسى لأخيه عند العزم على الصعود إلى الجبل للمناجاة فإنه صعد وحدَه ومعه غلامُهْ يُوشعُ بنُ نَون .ومعنى { اخلْفني } كُنْ خلَفاً عني وخليفة ، وهو الذي يتولى عمل غيره عند فقده فتنتهي تلك الخلافة عند حضور المستخلَف ، فالخلافة وكالة ، وفعْلُ خَلَف مشتق من الخَلْف بسكون اللام وهو ضد الإمام ، لأن الخليفة يقوم بعمل مَن خَلَفَه عند مغيبه ، والغائِب يَجعل مكانَه وراءَه .وقد جمع له في وصيته ملاك السياسة بقوله : { وأصلح ولا تتبع سبيل المفسدين } فإن سياسة الأمة تدور حول مِحور الإصلاح ، وهو جعل الشيء صالحاً ، فجميعُ تصرفات الأمة وأحوالها يجب أن تكون صالحة ، وذلك بأن تكون الأعمال عائدة بالخير والصلاح لفاعلها ولغيره ، فإن عادت بالصلاح عليه وبضده على غيره لم تعتبر صلاحاً ، ولا تلبث أن تؤول فساداً على مَن لاحت عنده صلاحاً ، ثم إذا تردد فعلٌ بين كونه خيراً من جهة وشراً من جهة أخرى وجب اعتبار أقوى حالتيه فاعتُبر بها إن تعذر العدول عنه إلى غيره مما هو أوفرُ صلاحاً ، وإن استوى جهتاه ألغي إن أمكَنَ إلغاؤُه وإلاّ تخيّر ، وهذا أمر لهارون جامع لما يتعين عليه عمله من أعماله في سياسة الأمة .وقوله : { ولا تتبع سبيل المفسدين } تحذير من الفساد بأبلغ صيغة لأنها جامعة بين نَهي والنهي عن فعل تنصرف صيغته أول وهلة إلى فساد المنهي عنه وبينَ تعليق النهي باتباع سبيل المفسدين .والإتباع أصله المشي على حلف ماش ، وهو هنا مستعار للمشاركة في عمل المفسد ، فإن الطريق مستعار للعمل المؤدي إلى الفساد والمفسِد من كان الفساد صفتَه ، فلما تعلق النهي بسلوك طريق المفسدين كان تحذيراً من كل ما يستروح منه مآل إلى فساد ، لأن المفسدين قد يعملون عملاً لا فساد فيه ، فنُهي عن المشاركة في عمل من عُرف بالفساد ، لأن صدوره عن المعروف بالفساد ، كاففٍ في توقع إفضائه إلى فساد . ففي هذا النهي سد ذريعة الفساد ، وسَد ذرائع الفساد من أصول الإسلام ، وقد عني بها مالك بن أنس وكررها في كتابه واشتهرت هذه القاعدة في أصول مذهبه .فلا جرم أن كان قوله تعالى : { ولا تتبع سبيل المفسدين } جامعاً للنهي عن ثلاث مراتب من مراتب الإفضاء إلى الفساد وهو العمل المعروف بالانتساب إلى المفسد ، وعمل المفسد وإن لم يكن مما اعتاده ، وتجنبُ الاقتراب من المفسد ومخالطته .وقد أجرى الله على لسان رسوله موسى ، أو أعلمه ، ما يقتضي أن في رعية هارون مفسدين ، وإنه يوشك إن سلكوا سبيل الفساد أن يسايرهم عليه لما يعلم في نفس هارون من اللين في سياسته ، والاحتياط من حدوث العصيان في قومه ، كما حكى الله عنه في قوله : { إن القوم استضعفوني وكادوا يقتُلونني } \\[ الأعراف : 150 \\] وقوله : { إني خشيت أن تقول فرقت بين بني إسرائيل } \\[ طه : 94 \\].فليست جملة : { ولا تتبع سبيل المفسدين } مجرد تأكيد لمضمون جملة { وأصلح } تأكيداً للشيء بنفي ضده مثل قوله : { أموات غير أحياء } \\[ النحل : 21 \\] لأنها لو كان ذلك هو المقصَد منها لجُرّدت من حرف العطف ، ولاقتصر على النهي عن الإفساد فقيل : وأصلح لا تفسد ، نعم يحصل من معانيها ما فيه تأكيد لمضمون جملة : { وأصلح }.\n\n",
      "translations": [
        {
          "translation": "(And when We did appoint for Moses) to spend in the mountain (thirty nights (of solitude)) the month of the Dhu'l-Qa'dah, (and added to them ten) days from the month of Dhu'l-Hijjah, (and he completed the whole time appointed by his Lord of forty nights) as he promised; (and Moses said unto his brother: Take my place) be my deputy (among the people. Do right) enjoin them to do right, (and follow not the way of mischief-makers) by committing transgressions.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ووَاعَدْنا موسى ثلاثين ليلة } قيل: أمره بصوم ثلاثين فلما أتمّ أنكر خلوف فمه\n فتسوّك فعاتبه الله على ذلك وأمره بزيادة عشر\n وقيل: أمره بأن يتقرب إليه بما تقرّب به في الثلاثين\n وأنزل إليه التوراة في العشر الأخير تتمة الأربعين\n فالأول: إشارة إلى أنه خلص عن حجاب الأفعال والصفات والذات في الثلاثين لكن بقي منه بقية ما خلص عن وجودها\n واستعمال السواك إشارة إلى ظهور تلك البقية عند قوله: { رب أرِني أنظر إليك }\n والثاني: إشارة إلى أنه بلغ الشهود الذاتي التام في الثلاثين بالسلوك إلى الله ولم يبق منه بقية\n بل فنى بالكلية\n وتمّ في العشر الأخير سلوكه في الله حتى رزق البقاء بالله بعد الفناء بالإفاقة\n وعلى هذا ينبغي أن يكون قوله: { رب أرني أنظر إليك } كان قد صدر عنه في الثلاثين\n والإفاقة بعدها في تتمة الأربعين\n وكلمة ربه\n التكليم في مقام تجلي الصفات\n وقوله: { رب أرني أنظر إليك } بدر عن إفراط شوق منه إلى شهود الذات في مقام فناء الصفات مع وجود البقية\n و { لن تراني } إشارة إلى استحالة الإثنينية وبقاء الأنية في مقام المشاهدة كقوله:",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n إذ { وَاعَدْنَا مُوسَىٰ } قبل إهلاكنا فرعون بأن أخلص لنا { ثَلاَثِينَ لَيْلَةً } من ذي القعدة بأن صام فيها وصلى بعد هلاك عدوه\n ننزل عليه من عندنا كتاباً نبيِّن له فيه التدابير المتعلقة لأمور معاش بني إسرائيل ومعادهم\n ثم لما أهلكنا العدو فذهب موسى إلى ميقاتنا إنجازاً لوعدنا { وَ } قبل ما تم المدة المذكورة أنكر خلوف فمه فتسوك قالت الملائكة: كنا نشم منك رائحة المسك فأفسدته بالسواك لذلك { أَتْمَمْنَاهَا } أي: مدة ميقاتها بأن أمر موسى كفارة لما فوت بالسواك { بِعَشْرٍ } أي: بعشرة أيام من ذي الحجة { فَتَمَّ مِيقَاتُ رَبِّهِ أَرْبَعِينَ لَيْلَةً } وبعدما أتمها فأنزلنا إنجازاً لوعدنا التوراة المبين لهم الأحكام الدنيوية والأخروية\n وذلك من أعظم النعم\n\n\n{ وَ } اذكر أيضاً\n إذ { قَالَ مُوسَىٰ لأَخِيهِ هَارُونَ ٱخْلُفْنِي } عني { فِي قَوْمِي } واذكر لهم مما يتعلق بأمور معاشهم ومعادهم نيابة عني { وَأَصْلِحْ } بينهم\n واحفظ عن زيغ أهل الضلال { وَلاَ تَتَّبِعْ } أنت ومن معك { سَبِيلَ ٱلْمُفْسِدِينَ } [الأعراف: 142] الذين يفسدون عقائد ضعفاء الأنام بالتمويهات الباطلة\n ومع ذلك اتبعتم السامري من خبث طينتكم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { وواعدنا موسى } لإنزال الكتاب { ثلاثين ليلة } من ذي القعدة، { وأتممناها بعشر } من ذي الحجة، { فتمَّ ميقاتُ ربه } بالغًا { أربعين ليلة } ، رُوِي أنه عليه السلام وعد بني إسرائيل، بمصر، أن يأتيهم بعد مهلك فرعون بكتاب الله تعالى، فيه بيان ما يأتون وما يذرون، فلما هلك فرعون سأل ربه فأمره بصوم ثلاثين، فلما أتم أنكر خلوف فيه فتسوك، فقالت الملائكة: كنا نشم منك رائحة المسك فأفسدتَه بالسواك، فأمره الله تعالى أن يزيد عليه عشرًا، ثم أنزل عليه التوراة. { وقال موسى لأخيه هارون } ، عند ذهابه إلى الطور للمناجاة: { أخلُفني في قومي } أي: كن خليفتي فيهم { وأصلح } ما يجب أن يصلح من أمورهم، أو كن مصلحًا، { ولا تتبع سبيلَ المفسدين } أي: لا تتبع سبيل من يسلك الإفساد، ولا تطع من دعاك إليه. الإشارة: كل من انقطع إلى الله تعالى بكليته واعتزل عن الخلق، وأخلى قلبه عما سوى الحق، حصلت له المناجاة والمكالمة، كما وقعت للكليم عليه السلام، وكل ما منحه الله للأنبياء يكون منه نصيب للأولياء من هذه الأمة، والله تعالى أعلم. وفي الحديث:\n \" مَن أخلَصَ أربَعِينَ صبَاحًا ظَهَرَت يَنابِيعُ الحِكمَةِ مِن قَلبِهِ عَلَى لِسَانِه \". \nقال بعض الحكماء: والسر في ذلك أن الله تعالى أمر بطينة آدم فخمرت في الماء أربعين يومًا، فتربى فيها أربعون حجابًا، فلولا تلك الحجب ما استطاع المقام في الأرض، فمن أيده الله على زوالها تشبه بالملأ الأعلى، وخرقت له العوائد، وأشرق النور من قلبه. ولهذا المعنى بقي داود عليه السلام ساجدًا أربعين يومًا، فقبلت توبته، ومكث إبراهيم عليه السلام في نار النمرود أربعين يومًا، فاتخذه الله خليلاً، وكان بعد ذلك يقول: ما رأيت أحلى من تلك الأيام، فمن أخلص في عبادته وأزال تلك الحجب عن قلبه كان ربانيًا. قال تعالى:\n[آل عِمرَان:79]. انظر الشطيبي. ويؤخذ من الآية أن الشيخ إذ أراد أن يسافر من زاويته ينبغي له أن يخلف خليفة عنه ليقوم له بنظام الزاوية، إذ لا خير في قوم ليس فيهم من يعظهم في الله. وبالله التوفيق. ولما سمع سيدنا موسى عليه السلام كلامَ الحق بلا واسطة، طمع في الرؤية بلا واسطة، كما قال تعالى: { وَلَمَّا جَآءَ مُوسَىٰ لِمِيقَاتِنَا }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:11",
      "similarity": 0.32508822225479433
    },
    {
      "verse": "15:38",
      "similarity": 0.32401207551809913
    },
    {
      "verse": "38:81",
      "similarity": 0.32401207551809913
    },
    {
      "verse": "56:50",
      "similarity": 0.31896015100181424
    },
    {
      "verse": "26:38",
      "similarity": 0.3115155555700662
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007142.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007142.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:142.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}