{
  "chapter": "الأعراف",
  "text": "واذ انجينكم من ءال فرعون يسومونكم سوء العذاب يقتلون ابناءكم ويستحيون نساءكم وفى ذلكم بلاء من ربكم عظيم",
  "translations": [
    {
      "translation": "Remember when We rescued you from Pharaoh's people who were inflicting an evil punishment on you, killing your sons and letting your women live. In that there was a terrible trial from your Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember (the day) when He saved you from the people of Pharaoh who oppressed and afflicted you, and slew your sons and spared your women. In this was a great trial from your Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And call to mind when We delivered you from Pharaoh's people who perpetrated on you a terrible torment, putting your males to death and sparing your females. Surely in it there was an awesome trial for you from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Israel, when I saved you from the Pharaoh and his people who made you suffer the worst kinds of torment, killing your sons and keeping your women alive, it was a great trial for you from your Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when We rescued you from Firaun’s people who were afflicting you with a dreadful torment; slaughtering your sons and sparing your daughters; and in it was a great favour from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We rescued you from Fir`awn's people, who were afflicting you with the worst torment, killing your sons and letting your women live. And in that was a great trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We delivered you from Firon's people who subjected you to severe torment, killing your sons and sparing your women, and in this there was a great trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We delivered you from the folk of Pharaoh who were visiting you with evil chastisement, slaying your sons, and sparing your women -- and in that was a grievous trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We did deliver you from Pharaoh's folk who were afflicting you with dreadful torment, slaughtering your sons and sparing your women. That was a tremendous trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We delivered you from Pharaoh's people, who afflicted you with dreadful torment, slaying your male children and sparing only your daughters. That was surely a great trial for you by your Lord.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time We delivered you from the house of Fir'awn perpetrating on you terrible torment, slaying your sons and letting your women live, and therein was a trial from your Lord, tremendous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We delivered you from Pharaoh’s clan who inflicted on you a terrible torment, slaughtering your sons and sparing your women, and there was a great test in that from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember We rescued you from Pharaoh's people, who afflicted you with the worst of penalties, who slew your male children and saved alive your females: in that was a momentous trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We rescued you from Fir'aun's (Pharaoh) people, who were afflicting you with the worst torment, killing your sons and letting your women live. And in that was a great trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And that We saved you from Pharaoh's family, who had oppressed you cruelly, putting your sons to death and sparing your women. Surely, that was a great trial from your Lord'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember how We saved you from Pharaoh’s people, who subjected you to the worst of sufferings—killing your sons and sparing your women. In that was a tremendous trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [recall, O Children of Israel], when We saved you from the people of Pharaoh, [who were] afflicting you with the worst torment - killing your sons and keeping your women alive. And in that was a great trial from your Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:141] And, remember, when We delivered you (anjaynākum: a variant reading has anjākum, ‘He delivered you’) from Pharaoh’s folk who were inflicting upon you, [who were] burdening you and making you taste, terrible chastisement, the worst kind [of chastisement], namely, slaying your sons and sparing, retaining, your women; and therein, [in that] deliverance or chastisement, was a tremendous trial, [either] a grace or a   tribulation, from your Lord, so will you not heed the admonition and desist from what you are saying?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (remember) when We did deliver you from Pharaoh's folk) from Pharaoh and his people (who were afflicting you with dreadful torment, slaughtering your sons) your little sons (and sparing) and using (your women) your grown up women. (That) your deliverance (was a tremendous trial) blessing (from your Lord) it is also said that this means: there is in His punishment a tremendous test.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكروا { إِذْ أَنْجَيْنَاكُمْ مِّنْ آلِ فِرْعَونَ } حين { يَسُومُونَكُمْ سُوۤءَ ٱلْعَذَابِ } أي: يعلمونكم به\n وذلك إنهم { يُقَتِّلُونَ أَبْنَآءَكُمْ } حتى لا تستكثروا وتستظهروا بهم { وَ } أقبح منه أنهم { يَسْتَحْيُونَ نِسَآءَكُمْ } ليلحق العار عليكم بتزوجهن بلا نكاح { وَ } لكم { فِي ذٰلِكُمْ } المذكور من العذاب { بَلاۤءٌ } اختبار وابتلاْ { مِّن رَّبِّكُمْ عَظِيمٌ } [الأعراف: 141] فأنجيناكم منه\n لتقيموا بذكرنا وتواظبوا بشكر نعمنا وتتفطنوا بتوحيدنا واستلائنا\n ومع ذلك لم تنتبهوا\n\n\n{ وَ } اذكروا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم بينَّه بقوله: { يقتلون أبناءَكم } ذكورهم { ويستحيون نساءَكم } أي: بناتكم\n { وفي ذلكم بلاءٌ من ربكم عظيم } أي: وفي ذلك القتل امتحان عظيم\n أو في ذلك الإنجاء نعمة عظيمة وامتنان عظيم\n الإشارة: من جاوز بحر التوحيد وحاد عنه\n ولم يغرق فيه\n لا يخلو من طلب شرك جلي أو خفي لأن النفس ما دامت لم تغرق في بحر الوحدة\n ولم تسبها جمال المعاني\n قطعًا تميل إلى شيء من جمال الحس\n لأن الروح في أصلها عشاقة\n إن لم تعشق جمال الحضرة تعشق جمال الحس\n ومن ركن إلى شيء مما سوى الله فهو شرك عند الموحدين من المحققين\n ويؤخذ من الآية أن شكر النعم هو تلخيص التوحيد\n وانفراد الوجهة إلى الله تعالى لأن بني إسرائيل لمَّا أنعم الله عليهم بالإنجاء وفلق البحر قابلوا ذلك بطلب الشرك\n فسقطوا من عين الله واستمر ذلهم إلى يوم القيامة\n والله تعالى أعلم\n ولما استقر بنو إسرائيل بالشام طلبو من نبيهم نزول الكتاب وتقرير الشرائع\n كما أشار إلى ذلك الحق تعالى بقوله: { وَوَاعَدْنَا مُوسَىٰ ثَلاَثِينَ لَيْلَةً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:49",
      "similarity": 0.759632768061588
    },
    {
      "verse": "14:6",
      "similarity": 0.7263036466751617
    },
    {
      "verse": "11:83",
      "similarity": 0.49106325837446313
    },
    {
      "verse": "51:34",
      "similarity": 0.43022132627394677
    },
    {
      "verse": "7:167",
      "similarity": 0.42893090343409473
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/7:141.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/7:141.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/7:141.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}