{
  "chapter": "الأعراف",
  "text": "والذين كذبوا۟ بـايتنا ولقاء الءاخرة حبطت اعملهم هل يجزون الا ما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "As for those who denied Our Signs and the encounter of the Next World, their actions will come to nothing. Will they be repaid except for what they did?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vain are the acts of those who deny Our signs and the meeting in the Hereafter. Can they ever be rewarded for anything but what they did?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vain are the deeds of those who reject Our signs as false and to the meeting of the Hereafter. Shall they be recompensed, except according to their deeds?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The deeds of those who have called Our revelations and belief in the Day of Judgment mere lies, will be turned devoid of all virtue. Can they expect to receive a reward for their deeds other than that which is the result of their deeds?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who denied Our signs and the confronting of the Hereafter – all their deeds are wasted; what recompense will they get, except what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny Our Ayat and the meeting in the Hereafter, vain are their deeds. Are they requited with anything except what they used to do\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as to) those who reject Our communications and the meeting of the hereafter, their deeds are null. Shall they be rewarded except for what they have done?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who cry lies to Our signs, and the encounter in the world to come -- their works have failed; shall they be recompensed, except according to the things they have done?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny Our revelations and the meeting of the Hereafter, their works are fruitless. Are they requited aught save what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The actions of those who denied Our signs and the Meeting of the Hereafter will come to nothing -- they shall be requited only, according to their deeds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who belie Our signs and the meeting of the Hereafter- vain shall be their Work. They shall be requited not save for that which they wrought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny Our signs and the encounter of the Hereafter, their works have failed. Shall they not be requited for what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Our signs and the meeting in the Hereafter,- vain are their deeds: Can they expect to be rewarded except as they have wrought?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) and the Meeting in the Hereafter (Day of Resurrection,), vain are their deeds. Do they expect to be rewarded with anything except what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vain are the deeds of those who belie Our signs and the Everlasting Life. Shall they not be recompensed except for what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny Our revelations and the meeting of the Hereafter—their deeds will come to nothing. Will they be repaid except according to what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who denied Our signs and the meeting of the Hereafter - their deeds have become worthless. Are they recompensed except for what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:147] Those who deny Our signs and the encounter in the Hereafter, the Resurrection and so on. their works, the good deeds they performed in the world, such as the maintenance of kinship ties or voluntary almsgivings, have failed, are invalid, and will not be rewarded, since they are not binding [in this case]. Shall they, they shall not, be requited anything but, the requital [for], what they used to do?’, in the way of denial and acts of disobedience?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who deny Our revelations) those who disbelieve in Our Scripture and Messenger (and the meeting of the Hereafter) and disbelieve in resurrection after death, (their works are fruitless) their good deeds are nullified due to their idolatry. (Are they requited) that which they are requited of in the Hereafter (aught save what they used to do) and say of evil in the life of this world?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ والذين كذّبوا بآياتنا ولقاء الآخرة } أي: ستروا بصفاتهم صفاتنا وبأفعالهم أفعالنا فوقفوا مع الآثار وعموا عن لقاء الآخرة وجنة النفوس والأفعال { حبطت أعمالهم } ولو كان التكذيب بالصفات مجرداً عن التكذيب بلقاء الآخرة لما حبطت أعمالهم، وإن عذبوا حيناً بنوع من العذاب { سبعين رجلاً } من أشرافهم ونجبائهم أهل الاستعداد وصفاء النفس والإرادة والطلب والسلوك وهم المصعوقون في قوله تعالى:\n\n[الذاريات، الآية: 44]\n { فلما أخذتهم الرجفة } أي: رجفة جبل البدن التي هي من مبادئ صعقة الفناء عند طيران بوارق الأنوار وظهور طوالع تجليات الصفات من اقشعرار الجسد وتأثره وارتعاده بها، ولهذا قال موسى عليه السلام عندها: { رب لو شئت أهلكتهم من قبل وإياي } إذ لا قول لموسى عليه السلام عند الصعقة ولا لهم لفنائهم عندها، وقوله عليه السلام: { ربّ لو شئت } ، كلمة ضجر وفقدان صبر من غلبة الشوق عند ألم الفراق، كما قال محمد صلى الله عليه وسلم في مثل هذه الحالة:\n\n \" ليت أمي لم تَلدني، وكذا ليت ربّ محمد لم يخلق محمداً \" \n\n، وهمّ بإلقاء نفسه عن الجبل\n ولو هذه للتمني\n { أتُهلِكنا } بطول الحجاب وعذاب الحرمان وألم الفراق { بما فعل السفهاء منّا } من عبادة عجل هوى النفس والاحتجاب بصفاتها أو بما صدر منا حالة السفه قبل التيقظ والاستبصار وإرادة السلوك وظهور نور البصيرة والاعتبار من الوقوف مع النفس وصفاتها { إن هي إلا فتنتك } أي: ما هذا الابتلاء بصفات النفس وعبادة الهوى إلا ابتلاؤك لا مدخل فيها لغيرك { تضلّ من تشاء } من أهل الحجب والشقاوة والجهل والعمى { وتهدي من تشاء } من أهل السعادة والعناية والعلم والهدى، قالها في مقام تجلي الأفعال\n { أنت } متولي أمورنا القائم بها { فاغفر لنا } ذنوب صفاتنا وذواتنا كما غفرت لنا ذنوب أفعالنا { وارحمنا } بإفاضة أنوار شهودك ورفع حجاب الأينية بوجودك { وأنت خير الغافرين } بالمغفرة التامة\n { واكتب لنا في هذه الدنيا حسنة } العدالة والاستقامة بالبقاء بعد الفناء { وفي الآخرة حسنة } المشاهدة والزيادة { إنّا هدْنَا } رجعنا { إليك } عن ذنوب وجودنا { قال عذابي } أي: عذاب الشوق المخصوص بي الحاصل من جهتي، وإن كان أليماً لشدّة ألم الفراق، لكنه أمر عزيز خطير { أُصِيب به من أشاء } من أهل العناية من عبادي الخاصة بي { ورحمتي وسعت كل شيء } لا تختص بأحد دون أحد غيره وشيء دون شيء، ففي هذا العذاب رحمة لا يبلغ كنهها ولا يقدر قدرها من رحمة لذة الوصول التي قال فيها:\n\n[السجدة، الآية: 17] مع كونه لذيذاً لا يقاس بلذّته لذّة، كما قال أحدهم:\n\nولعمري إنّ هذا العذاب أعزّ من الكبريت الأحمر\n\n\nوأما الرحمة فلا يخلو من حظ منها أحد { فَسَأكتُبها } تامة كاملة رحيمية كتبة خاصة { للذين يتّقون } الحجب كلها ويفيضون مما رزقوا من الأموال والأخلاق والعلوم والأحوال على مستحقيها { والذين هم } بجميع صفاتنا يتصفون وهم { الذين يتبعون الرسول النبيّ الأميّ } في آخر الزمان، أي: المحمديون الذين اتّبعوا في التقوى وصفه بقوله تعالى له:\n\n[الأنفال، الآية: 17]، وبقوله تعالى:\n\n[النجم، الآية: 3]، وقوله تعالى:\n\n[النجم، الآية: 17]\n وفي إيتاء الزكاة قوله تعالى:\n\n[الضحى، الآيات: 10-11]، وفي الإيمان بالآيات قوله صلى الله عليه وسلم:\n\n \" أوتيت جوامع الكِلَم، وبُعِثت لأتمم مكارم الأخلاق \"\n \n",
      "translations": [
        {
          "translation": "\n\nThose who deny our signs and the meeting of the hereafter {their deeds are nullified} because they have denied our attributes and deeds and have refused to stand with the evidence and have abandoned the meeting of the hereafter and the Garden of the souls and deeds {their deeds are nullified}. If the denial of the attributes was merely denial of the meeting of the hereafter, their deeds would not have been nullified.,\n\nAnd if they are punished a certain type of punishment {seventy men} from their elders and their nobles of the people of the preparation and purity of the soul and the desire and the request and the behavior, and they are the ones who are killed in the saying of Allah:\n The fleeing,\n\n\n\nAnd take in your hand a small portion of {the soil}, and strike therewith {the soil of the grave}, and do not touch {the soil of the grave} with your hand; for {striking the soil of the grave} is {an act of defiance against God}.\n\n\n{When the earthquake took them} meaning: the earthquake of Mount Beden which is one of the principles of the darkness of the sky at the flight of the bird of light and the appearance of the tall light of the attributes from the body's light and its reaction and its return to it.,\n\nAnd so Moses said to God, \"If you had wanted, you could have destroyed them long ago, {and me with them}. But Moses said nothing about being struck by lightning, nor did they say anything about their destruction when they were struck.,\n\nAnd the saying of Ali (peace be upon him): \"O my Lord, if You willed, { }\", A word of regret and loss of patience from the majority of longing at the pain of separation.,\n\nAs Muhammad (peace be upon him) said in a similar situation:\n\n\n\"I wish my mother had not given birth to me, \"And as my Lord {Muhammad} has not created {Muhammad}, so {Muhammad} is not a thing.\"\n\n\n{It is not permissible for a Muslim to hate his Muslim brother}\n\nIt is not permissible for a Muslim to hate his Muslim brother.,\n\nAnd they were about to cast themselves down from the mountain.\n\n\nIf only this were for the sake of love!\n\nWe are {destroyed} by the length of the veil and the punishment of being forbidden, and the pain of separation, {because of what the ignorant among us have done} by worshipping the hasty desires of the self and retreating to its qualities or what has come out of us in a state of ignorance before awakening and vision and the desire to act and the appearance of the light of awareness and consideration from standing with the self and its qualities. {It is nothing but a trial for you} that is, what is this trial of the qualities of the self and the worship of desire but a trial for you, with no entrance for anyone but you. {You go astray as you wish} from the people of veiling and deprivation and ignorance and blindness. {And you guide as you wish} from the people of happiness and care and knowledge and guidance.,\n\nShe said in a position of action disclosure\n\n\nYou are our protector and guardian. Forgive us our sins and our shortcomings, as you have forgiven us our transgressions. Show us your mercy by illuminating our hearts with your light, and lifting the veil of ignorance with your presence. You are the best of those who forgive.\n\n\n{And write for us in this world good} justice and {staying upright after death} watching and increasing {We are guided} we return {to you} for our sins and being {my punishment} that is, the punishment of longing that is specifically mine from both sides,\n\nAnd if the pain of separation is so great,\n\nBut it is a dangerous {affliction that strikes whomever I please} from among my close attendants and {my mercy and power extend to all things}, not just to one person or another, and to one thing or another.,\n\nThis punishment is a mercy that cannot be comprehended or measured, from the mercy of the blissful arrival that is mentioned in it.\n\n\nThe Prostration, {It is} a verse {in which} he {i.e. the speaker} {mentions that} it {i.e. the thing being described} is {something} good {to have}, {and} {that} its {i.e. the thing's} {pleasure / enjoyment} {cannot be} measured {i.e. is immeasurable}.,\n\nOne of them said:\n\n\nAnd to me, this punishment is more honorable than red { }\n\n\nAnd as for mercy, no one is deprived of its share. { I will write it } in full, complete, Rahimah (merciful) writing, { for those who fear } (God), who are completely obedient and who spend from what they have been given in terms of money, ethics, knowledge and status on those who deserve it. { And those who are } with all of our qualities, they are the ones who { follow the Messenger, the Prophet Muhammad } in the Last Days.,\n\n{Those who follow the Messenger, the unlettered Prophet, whom they find mentioned in their own (scriptures),- in the Torah and the Gospel;- for he commands them what is just and forbids them what is evil; he allows them as lawful what is good (and pure) and prohibits them from what is bad (and impure);- he releases them from their heavy burdens and from the yokes that are upon them. So it is those who believe in him, honour him, help him, and follow the light which is sent down with him,- it is they who will prosper.}\n\n\nThe Losses,\n\n17] But as for those who disbelieve and reject Our signs, they will be the companions of the Hellfire, dwelling therein forever.,\n\nAnd with His words, the Most High said:\n The Star\n\nالنجم هو كوكب أو كواكب يتبع نجم ويحتوي على ماء ساخن أو بارد ويعتبر واحد من أكبر الكواكب في الكون. وتشمل النجوم الشمس والكواكب الأخرى كالمريخ والجوزاء والستارة. يحتوي النجم على غازات تحت درجة حرارة كبيرة وتدفق بسرعات كبيرة وتنتج تيارات كهربائية تسببت في تشكيل الأجسام الكبيرة في الكون.\n\nThe star is a planet or planets that orbit a star and contain hot or cold water and is one of the largest planets in the universe. Stars include the sun and other planets like Mercury, Jupiter, and Sirius. The star contains gases at very high temperatures and flows at high speeds and produces electric currents that caused the formation of large bodies in the universe.,\n\n{In the name of God, the Most Merciful, the Most Compassionate}\n\nPraise be to God, Lord of the Worlds,\nthe Most Merciful, the Most Compassionate,\nKing of the Day of Judgment!\nYou alone we worship, and to You alone we turn for help.\nGuide us to the straight path,\nthe path of those who have received Your grace;\nnot the path of those who have brought down Your wrath, nor of those who wander astray.,\n\nAnd His saying, \"Exalted is He who took charge of His servants for Himself and did not take to Himself any associates.\"\n The Star\n\nالنجم هو كوكب أو كواكب في الفلك. وتسمى النجوم الكبيرة الكواكب. يحتوي الكوكب الأرضي على ستة أنجماء كبيرة: الشمس والقمر والمريخ وجبال الديون وسترس ونيقون. وتسمى النجمات الصغيرة الكواكب الصغيرة.\n\nThe star is a planet or planets in the sky. Large stars are called planets. The Earth has six large stars: the Sun, the Moon, Mercury, Venus, Mars, and Saturn. Small stars are called asteroids.,\n\n\"And give the relatives their due rights, as [required by] law; and [also] the needy and the traveler, for indeed, Allah does not like those who are self-deluding and boastful.\"\n\n17] وَأَطِيعُوا اللَّهَ وَالرَّسُولَ وَأَعْرِضُوا عَنِ الْمُشْرِكِينَ\n\nAnd obey Allah and the Messenger, and turn away from the polytheists.\n\n\nAnd regarding the giving of charity, Allah says:\n\n\nThe dawn.,\n\nAnd We have certainly sent messengers before you. Of them are those {we told} their stories, and of them are those {we did not tell} their stories. And it was not for any messenger to bring a sign except by permission of Allah . So when the command of Allah comes, it will be concluded in truth, and the falsehood will disappear. Indeed, Allah is Knowing and Wise.,\n\nAnd in believing in the verses, the Prophet Muhammad (peace and blessings of Allah be upon him) said:\n I got universities of words,\n\nI was sent to complete the virtues.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { ٱلَّذِينَ كَذَّبُواْ بِآيَاتِنَا } الظاهرة عن أوصافنا الذاتية في النشأة الأولى { وَلِقَآءِ ٱلآخِرَةِ } أي: كذبوا برجوع الكل إلينا في النشاة الأخرى، أولئك الأشقياء المردودون هم الذين { حَبِطَتْ أَعْمَالُهُمْ } وضاعت وخسروا فيها في الأولى والأخرى { هَلْ يُجْزَوْنَ } بإحباط الأعمال { إِلاَّ مَا كَانُواْ يَعْمَلُونَ } [الأعراف: 147] أي: جزاء ما يقترفون ويكتسبون لأنفسهم من تكذيب الآيات والرسل المنبهين لها المبينين لمقتضاها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ والذين كذَّبوا بآياتنا ولقاءِ الآخرة } أي: وبلقائهم الدار الآخرة، أو: ما وعد الله في الآخرة، { حَبِطَت أعمالُهم } لا ينتفعون بها، { هل يُجزَون إلا ما كانوا يعملون } أي: لا يجزون إلا مقدار أعمالهم\n\n[الكهف:49]\n الإشارة: كل من أقامه الله في مقام من المقامات، أو حال من الأحوال، كيفما كان، يقال له: خذ ما آتيتك، واقنع بما أوليتك، وكن من الشاكرين عليه، وإلا سلبناك ما أعطيناك، فالرضا بالقسمة واجب، وطلب باب الفضل والكرم لازب، والأمر مُبهم، والعواقب مُغيبة، ومنتهى المقام على التعيين لا يعلم إلا بعد الموت\n وقوله تعالى: { فخذها بقوة } أي: بجد واجتهاد\n قال في الإحياء: الأخذ بالجد أن يكون القارىء متجردًا لله عند قراءته، منصرف الهمّة إليه عن غيره، وهو يشير للحضور\n وقول تعالى: { يأخذوا بأحسنها } قال الورتجبي: يأخذون بأبينها لهم، وهي المحكمات التي توجب العبودية، ويأخذون بمتشابهها التي هي وصف الصفات بحسن الاعتقاد والتسليم فيها، لأن علومها وحقائقها لا تكشف إلا للربانيين\n قال تعالى:\n\n[آل عِمرَان:7] الآية\n هـ\n وقوله تعالى: { سأصرف عن آياتي الذين يتكبرون في الأرض }\n قال القشيري: سأحرِمُ المتكبرين بركة الاتباع، حتى لا يتلقوا الآيات التي يُكاشَفَون بها بالقبول، ولا يسمعوا ما يُخَاطَبُون به بسمع الإيمان\n هـ\n ثم شرع في ذكر مساوئ بني إسرائيل فبدأ بعبادتهم العجل، فقال: { وَٱتَّخَذَ قَوْمُ مُوسَىٰ مِن بَعْدِهِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:22",
      "similarity": 0.7256909914224813
    },
    {
      "verse": "6:88",
      "similarity": 0.6687918093290753
    },
    {
      "verse": "47:9",
      "similarity": 0.6328218045937446
    },
    {
      "verse": "18:105",
      "similarity": 0.6327526628498514
    },
    {
      "verse": "39:65",
      "similarity": 0.5947224624657705
    }
  ]
}