{
  "chapter": "الأعراف",
  "text": "قال اغير الله ابغيكم الها وهو فضلكم على العلمين",
  "translations": [
    {
      "translation": "He said, 'Should I seek something other than Allah as a god for you when He has favoured you over all other beings?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do you want me to seek for you,\" he said, \"a god other than God, when He has exalted you over all the nations of the world?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses said: 'Should I seek any god for you other than Allah although it is He who has exalted you above all?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should I choose for you a lord other than God who has favored you above all other people?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Shall I seek for you a God other than Allah, whereas He has given you superiority above the entire world?” (By sending His message towards you).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Shall I seek for you an ilah (a god) other than Allah, while He has given you superiority over the nations.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: What! shall I seek for you a god other than Allah while He has made you excel (all) created things?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, 'What, shall I seek a god for you other than God, who has preferred you above all beings?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Shall I seek for you a god other than Allah when He hath favoured you above (all) creatures?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Shall I seek a deity for you other than God, while it is He who has exalted you above all peoples?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: shall I seek for you a god other than Allah, whereas He hath preferred you above the worlds?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Shall I find you a god other than Allah, while He has graced you over all the nations?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Shall I seek for you a god other than the (true) Allah, when it is Allah Who hath endowed you with gifts above the nations?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Shall I seek for you an Ilahan (a God) other than Allah, while He has given you superiority over the 'Alamin (mankind and jinns of your time).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should I seek any god for you except Allah? He has exalted you above the nations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Shall I seek for you a god other than God, when He has favored you over all other people?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Is it other than Allah I should desire for you as a god while He has preferred you over the worlds?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:140] He said, ‘Shall I seek other than God as a god for you, to worship (abghīkum, ‘[shall] I seek for you’, is originally abghī lakum), when He has favoured you above all the worlds?’, of your time, in the ways He has mentioned in His sayings?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He) Moses (said: Shall I seek for you a god other than Allah) shall I command you to worship another lord (when He hath favoured you above (all) creatures) of your time, through surrender unto Him?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَبْغِيكُمْ إِلَـٰهاً } معناه أَجعَلُ لَكم إِلهاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم: { قَالَ } موسى متأسفاً مقرعاً: { أَغَيْرَ ٱللَّهِ } الواحد الأحد الصمد، الذي ليس كمثله شيء أصلاً { أَبْغِيكُمْ } وأطلب لكم أيها الحمقى العمي، الضالون في تيه الغفلة { إِلَـٰهاً } من مصنوعاته يعبد له بالحق ويتقرب إليه { وَ } الحال إنه { هُوَ } سبحانه { فَضَّلَكُمْ عَلَى ٱلْعَالَمِينَ } [الأعراف: 140] إذ لا مظهر له أكمل منكم، فكيف تعبدون المفضول المرذول، وما عرض عليكم أيها الجاهلون لم تعرفوا مرتبتكم الجامعة الكاملة، وعليكم أن تعدوا نعم الله التي أنعمها عليكم لعلكم تنبهون على توحيد المنعم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "49:8",
      "similarity": 0.42528373053321167
    },
    {
      "verse": "42:42",
      "similarity": 0.4096543412613359
    },
    {
      "verse": "26:211",
      "similarity": 0.40784927446376873
    },
    {
      "verse": "17:87",
      "similarity": 0.38495471192758174
    },
    {
      "verse": "33:47",
      "similarity": 0.36209478746541923
    }
  ]
}