{
  "chapter": "الأعراف",
  "text": "والذين كذبوا۟ بـايتنا ولقاء الءاخرة حبطت اعملهم هل يجزون الا ما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "As for those who denied Our Signs and the encounter of the Next World, their actions will come to nothing. Will they be repaid except for what they did?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vain are the acts of those who deny Our signs and the meeting in the Hereafter. Can they ever be rewarded for anything but what they did?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vain are the deeds of those who reject Our signs as false and to the meeting of the Hereafter. Shall they be recompensed, except according to their deeds?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The deeds of those who have called Our revelations and belief in the Day of Judgment mere lies, will be turned devoid of all virtue. Can they expect to receive a reward for their deeds other than that which is the result of their deeds?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who denied Our signs and the confronting of the Hereafter – all their deeds are wasted; what recompense will they get, except what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny Our Ayat and the meeting in the Hereafter, vain are their deeds. Are they requited with anything except what they used to do\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as to) those who reject Our communications and the meeting of the hereafter, their deeds are null. Shall they be rewarded except for what they have done?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who cry lies to Our signs, and the encounter in the world to come -- their works have failed; shall they be recompensed, except according to the things they have done?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny Our revelations and the meeting of the Hereafter, their works are fruitless. Are they requited aught save what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The actions of those who denied Our signs and the Meeting of the Hereafter will come to nothing -- they shall be requited only, according to their deeds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who belie Our signs and the meeting of the Hereafter- vain shall be their Work. They shall be requited not save for that which they wrought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny Our signs and the encounter of the Hereafter, their works have failed. Shall they not be requited for what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Our signs and the meeting in the Hereafter,- vain are their deeds: Can they expect to be rewarded except as they have wrought?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) and the Meeting in the Hereafter (Day of Resurrection,), vain are their deeds. Do they expect to be rewarded with anything except what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vain are the deeds of those who belie Our signs and the Everlasting Life. Shall they not be recompensed except for what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who deny Our revelations and the meeting of the Hereafter—their deeds will come to nothing. Will they be repaid except according to what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who denied Our signs and the meeting of the Hereafter - their deeds have become worthless. Are they recompensed except for what they used to do?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:147] Those who deny Our signs and the encounter in the Hereafter, the Resurrection and so on. their works, the good deeds they performed in the world, such as the maintenance of kinship ties or voluntary almsgivings, have failed, are invalid, and will not be rewarded, since they are not binding [in this case]. Shall they, they shall not, be requited anything but, the requital [for], what they used to do?’, in the way of denial and acts of disobedience?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who deny Our revelations) those who disbelieve in Our Scripture and Messenger (and the meeting of the Hereafter) and disbelieve in resurrection after death, (their works are fruitless) their good deeds are nullified due to their idolatry. (Are they requited) that which they are requited of in the Hereafter (aught save what they used to do) and say of evil in the life of this world?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ والذين كذّبوا بآياتنا ولقاء الآخرة } أي: ستروا بصفاتهم صفاتنا وبأفعالهم أفعالنا فوقفوا مع الآثار وعموا عن لقاء الآخرة وجنة النفوس والأفعال { حبطت أعمالهم } ولو كان التكذيب بالصفات مجرداً عن التكذيب بلقاء الآخرة لما حبطت أعمالهم، وإن عذبوا حيناً بنوع من العذاب { سبعين رجلاً } من أشرافهم ونجبائهم أهل الاستعداد وصفاء النفس والإرادة والطلب والسلوك وهم المصعوقون في قوله تعالى:\n\n[الذاريات، الآية: 44]\n { فلما أخذتهم الرجفة } أي: رجفة جبل البدن التي هي من مبادئ صعقة الفناء عند طيران بوارق الأنوار وظهور طوالع تجليات الصفات من اقشعرار الجسد وتأثره وارتعاده بها، ولهذا قال موسى عليه السلام عندها: { رب لو شئت أهلكتهم من قبل وإياي } إذ لا قول لموسى عليه السلام عند الصعقة ولا لهم لفنائهم عندها، وقوله عليه السلام: { ربّ لو شئت } ، كلمة ضجر وفقدان صبر من غلبة الشوق عند ألم الفراق، كما قال محمد صلى الله عليه وسلم في مثل هذه الحالة:\n\n \" ليت أمي لم تَلدني، وكذا ليت ربّ محمد لم يخلق محمداً \" \n\n، وهمّ بإلقاء نفسه عن الجبل\n ولو هذه للتمني\n { أتُهلِكنا } بطول الحجاب وعذاب الحرمان وألم الفراق { بما فعل السفهاء منّا } من عبادة عجل هوى النفس والاحتجاب بصفاتها أو بما صدر منا حالة السفه قبل التيقظ والاستبصار وإرادة السلوك وظهور نور البصيرة والاعتبار من الوقوف مع النفس وصفاتها { إن هي إلا فتنتك } أي: ما هذا الابتلاء بصفات النفس وعبادة الهوى إلا ابتلاؤك لا مدخل فيها لغيرك { تضلّ من تشاء } من أهل الحجب والشقاوة والجهل والعمى { وتهدي من تشاء } من أهل السعادة والعناية والعلم والهدى، قالها في مقام تجلي الأفعال\n { أنت } متولي أمورنا القائم بها { فاغفر لنا } ذنوب صفاتنا وذواتنا كما غفرت لنا ذنوب أفعالنا { وارحمنا } بإفاضة أنوار شهودك ورفع حجاب الأينية بوجودك { وأنت خير الغافرين } بالمغفرة التامة\n { واكتب لنا في هذه الدنيا حسنة } العدالة والاستقامة بالبقاء بعد الفناء { وفي الآخرة حسنة } المشاهدة والزيادة { إنّا هدْنَا } رجعنا { إليك } عن ذنوب وجودنا { قال عذابي } أي: عذاب الشوق المخصوص بي الحاصل من جهتي، وإن كان أليماً لشدّة ألم الفراق، لكنه أمر عزيز خطير { أُصِيب به من أشاء } من أهل العناية من عبادي الخاصة بي { ورحمتي وسعت كل شيء } لا تختص بأحد دون أحد غيره وشيء دون شيء، ففي هذا العذاب رحمة لا يبلغ كنهها ولا يقدر قدرها من رحمة لذة الوصول التي قال فيها:\n\n[السجدة، الآية: 17] مع كونه لذيذاً لا يقاس بلذّته لذّة، كما قال أحدهم:\n\nولعمري إنّ هذا العذاب أعزّ من الكبريت الأحمر\n\n\nوأما الرحمة فلا يخلو من حظ منها أحد { فَسَأكتُبها } تامة كاملة رحيمية كتبة خاصة { للذين يتّقون } الحجب كلها ويفيضون مما رزقوا من الأموال والأخلاق والعلوم والأحوال على مستحقيها { والذين هم } بجميع صفاتنا يتصفون وهم { الذين يتبعون الرسول النبيّ الأميّ } في آخر الزمان، أي: المحمديون الذين اتّبعوا في التقوى وصفه بقوله تعالى له:\n\n[الأنفال، الآية: 17]، وبقوله تعالى:\n\n[النجم، الآية: 3]، وقوله تعالى:\n\n[النجم، الآية: 17]\n وفي إيتاء الزكاة قوله تعالى:\n\n[الضحى، الآيات: 10-11]، وفي الإيمان بالآيات قوله صلى الله عليه وسلم:\n\n \" أوتيت جوامع الكِلَم، وبُعِثت لأتمم مكارم الأخلاق \"\n \n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بالجملة: { ٱلَّذِينَ كَذَّبُواْ بِآيَاتِنَا } الظاهرة عن أوصافنا الذاتية في النشأة الأولى { وَلِقَآءِ ٱلآخِرَةِ } أي: كذبوا برجوع الكل إلينا في النشاة الأخرى، أولئك الأشقياء المردودون هم الذين { حَبِطَتْ أَعْمَالُهُمْ } وضاعت وخسروا فيها في الأولى والأخرى { هَلْ يُجْزَوْنَ } بإحباط الأعمال { إِلاَّ مَا كَانُواْ يَعْمَلُونَ } [الأعراف: 147] أي: جزاء ما يقترفون ويكتسبون لأنفسهم من تكذيب الآيات والرسل المنبهين لها المبينين لمقتضاها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ والذين كذَّبوا بآياتنا ولقاءِ الآخرة } أي: وبلقائهم الدار الآخرة، أو: ما وعد الله في الآخرة، { حَبِطَت أعمالُهم } لا ينتفعون بها، { هل يُجزَون إلا ما كانوا يعملون } أي: لا يجزون إلا مقدار أعمالهم\n\n[الكهف:49]\n الإشارة: كل من أقامه الله في مقام من المقامات، أو حال من الأحوال، كيفما كان، يقال له: خذ ما آتيتك، واقنع بما أوليتك، وكن من الشاكرين عليه، وإلا سلبناك ما أعطيناك، فالرضا بالقسمة واجب، وطلب باب الفضل والكرم لازب، والأمر مُبهم، والعواقب مُغيبة، ومنتهى المقام على التعيين لا يعلم إلا بعد الموت\n وقوله تعالى: { فخذها بقوة } أي: بجد واجتهاد\n قال في الإحياء: الأخذ بالجد أن يكون القارىء متجردًا لله عند قراءته، منصرف الهمّة إليه عن غيره، وهو يشير للحضور\n وقول تعالى: { يأخذوا بأحسنها } قال الورتجبي: يأخذون بأبينها لهم، وهي المحكمات التي توجب العبودية، ويأخذون بمتشابهها التي هي وصف الصفات بحسن الاعتقاد والتسليم فيها، لأن علومها وحقائقها لا تكشف إلا للربانيين\n قال تعالى:\n\n[آل عِمرَان:7] الآية\n هـ\n وقوله تعالى: { سأصرف عن آياتي الذين يتكبرون في الأرض }\n قال القشيري: سأحرِمُ المتكبرين بركة الاتباع، حتى لا يتلقوا الآيات التي يُكاشَفَون بها بالقبول، ولا يسمعوا ما يُخَاطَبُون به بسمع الإيمان\n هـ\n ثم شرع في ذكر مساوئ بني إسرائيل فبدأ بعبادتهم العجل، فقال: { وَٱتَّخَذَ قَوْمُ مُوسَىٰ مِن بَعْدِهِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:22",
      "similarity": 0.7256909914224813
    },
    {
      "verse": "6:88",
      "similarity": 0.6687918093290753
    },
    {
      "verse": "47:9",
      "similarity": 0.6328218045937446
    },
    {
      "verse": "18:105",
      "similarity": 0.6327526628498514
    },
    {
      "verse": "39:65",
      "similarity": 0.5947224624657705
    }
  ]
}