{
  "chapter": "الأعراف",
  "text": "وكتبنا له فى الالواح من كل شىء موعظة وتفصيلا لكل شىء فخذها بقوة وامر قومك ياخذوا۟ باحسنها ساو۟ريكم دار الفسقين",
  "translations": [
    {
      "translation": "We wrote about everything for him on the Tablets as an admonition and making all things clear. 'Seize hold of it vigorously and command your people to adopt the best in it. I will show you the home of the deviators!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We wrote down on tablets admonitions and clear explanations of all things for Moses, and ordered him: \"Hold fast to them, and command your people to observe the best in them. I will show you the abode of the wicked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We ordained for Moses in the Tablets all manner of admonition, and instruction concerning all things, and said to him: Hold to these, with all your strength. and bid your people to follow them in accord with their best understanding. I shall soon show you the habitation of the wicked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We wrote advice and laws for him on Tablets about all kinds of things, saying, \"Follow them and command your people to follow the good advice therein, and I will show you the dwellings of the evil-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We wrote for him on the tablets, the advice for all things and the details of all things; and commanded “Accept it firmly and command your people to choose its good advices; soon I shall show you people the destination of the disobedient.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We wrote for him on the Tablets the exhortation all things and the explanation for all things (and said): Hold unto these with firmness, and enjoin your people to take the better therein. I shall show you the home of the rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We ordained for him in the tablets admonition of every kind and clear explanation of all things; so take hold of them with firmness and enjoin your people to take hold of what is best thereof; I will show you the abode of the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We wrote for him on the Tablets of everything an admonition, and a distinguishing of everything: 'So take it forcefully, and command thy people to take the fairest of it. I shall show you the habitation of the ungodly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We wrote for him, upon the tablets, the lesson to be drawn from all things and the explanation of all things, then (bade him): Hold it fast; and command thy people (saying): Take the better (course made clear) therein. I shall show thee the abode of evil-livers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We wrote for him upon the Tablets an admonition and details of all things, then [bade him], \"Hold fast to them; and command your people to follow them in their best sense. Soon I shall show you the home of the wicked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We wrote for him in the tablets of everything an exhortation, and and a detail of everything. So hold thou fast with firmness, and bid thy people follow the best thereof anonl will shew you the dwelling of the ungodly people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We wrote for him in the tablets advice concerning all things and an elaboration of all things, [and We said], ‘Hold on to them with power, and bid your people to hold on to the best of [what is in] them. Soon I shall show you the abode of the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We ordained laws for him in the tablets in all matters, both commanding and explaining all things, (and said): \"Take and hold these with firmness, and enjoin thy people to hold fast by the best in the precepts: soon shall I show you the homes of the wicked,- (How they lie desolate).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We wrote for him on the Tablets the lesson to be drawn from all things and the explanation of all things (and said): Hold unto these with firmness, and enjoin your people to take the better therein. I shall show you the home of Al-Fasiqun (the rebellious, disobedient to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We inscribed for him upon the Tablets all kinds of exhortation and clear explanations of all things. So take it forcefully, and order your nation to take what is best of it. I shall show you the home of the wicked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We inscribed for him in the Tablets all kinds of enlightenments, and decisive explanation of all things. “Hold fast to them, and exhort your people to adopt the best of them. I will show you the fate of the sinners.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We wrote for him on the tablets [something] of all things - instruction and explanation for all things, [saying], \"Take them with determination and order your people to take the best of it. I will show you the home of the defiantly disobedient.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:145] And We inscribed for him in the Tablets, that is, the Tablets of the Torah — these were made from the Lotetree of Paradise, or of chrysolite or emerald, and they were either seven or ten — about all things, one needs in religion, as an admonition and a detailing, an explanation, of all things (li-kulli shay’in substitutes for the previous genitive construction [min kulli shay’, ‘about all things’]). ‘Take it then (there is an implicit qulnā, ‘We said’, before this [fa-kudhhā, ‘take it then’]) firmly, seriously and earnestly, and enjoin your people to adhere to the fairest [precepts] in it. I shall show you the abode of the wicked, [of] Pharaoh and his followers, and that is Egypt, that you may take an example from them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And We wrote for him, upon the tablets, the lesson) the prohibition (to be drawn from all things and the explanation of all things) of the lawful and the unlawful, commands and prohibitions, (then (bade him): Hold it fast) act upon it seriously and diligently; (and command your people (saying): Take the better (course made clear) therein) act upon that which is unambiguous and believe in that which is ambiguous. (I shall show thee the abode of evil-livers) the abode of the transgressors which is hell; it is also said that this refers to Iraq, just as it is said that it refers to Egypt.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ في الألواح } أي: الألواح تفاصيل وجود موسى من روحه وقلبه وعقله وفكره وخياله\n وإلقاؤها عند الغضب هو الذهول عنها والتجافي عن حكم ما فيها كما يحكم أحدنا بحسن الحلم والتحمّل للأذى\n ثم ينسى عند سورة الغضب ولا يتذكر شيئاً مما في عقله من علمه عند ظهور نفسه { فخذها بقوّة } أي: بعزيمة لتكون من أولي العزم { وأمر قومك يأخذوا بأحسنها } أي: بالعزائم دون الرخص { سأريكم دار الفاسقين } أي: عاقبة الذين لا يأخذون بها\n { سأصرف عن آياتي الذين يتكبرون في الأرض بغير الحق } لأن التكبر من صفات النفس\n فهم في مقام النفس محجوبون عن آيات الصفات التي تكون في مقام القلب دون المتكبرين بالحق الذين اتّصفوا بصفة الكبرياء في مقام المحو والفناء\n فقام كبرياؤه تعالى مقام تكبّرهم\n كما قال جعفر الصادق عليه السلام في جواب من قال له: فيك كل فضيلة إلا أنك متكّبر! فقال: \" لست بِمُتَكّبر\n ولكن كبرياء الله تعالى قام مني مقام التكّبر \"",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولا تميلوا عنها وعن أحكامها حتى لا يلحقوا بزمرة الفساق المنحطين عن مرتبة الإنسانية { سَأُوْرِيكُمْ } في النشأة الأخرى أيها المائلون عن مقتضى الأحكام الإلهية التي هي صراط الله الأقوم { دَارَ ٱلْفَاسِقِينَ } [الأعراف: 145] التي هي جهنم الحرمان وجحيم الخذلان",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى لموسى عليه السلام: { فخُذهَا } أي: الألواح أو الرسالة { بقوة } أي: بجد واجتهاد\n { وأْمُرْ قومكَ يأخذوا بأحسنها } بأحسن ما فيها\n فإن فيها ما هو حسن وأحسن منه كالقصاص مع العفو\n أو بواجباتها\n فإن الواجب أفضل من المندوب\n وهذا كقوله في كتابنا:\n[الزُّمَر:55]\n ويجوز أن يراد بالأحسن: البالغ في الحسن مطلقًا\n لا بالإضافة إلى غيره\n كقولهم: الصيف أحر من الشتاء\n فيكون الأمر بأخذ كل ما فيها لأنه بالغ الحسن\n ثم بشرهم بخراب ملك عدوهم\n فقال: { سأُريكُم دارَ الفاسقين } أي: دار فرعون وقومه خاوية على عروشها\n أي: أريكم كيف أقفَرَت منهم لمّا هلكوا\n وقيل: منازل عاد وثمود ومن هلك من الأمم\n لتعتبروا بها\n وقيل: جهنم\n وقرأ ابن عباس: \" سأورثكم \" بالثاء المثلثة\n كقوله:\n[الشُّعَرَاء:59]\n { سَأصرِفُ عن آياتي } المنصوبة في الآفاق والأنفس الدالة على قدرتنا ووحدانيتنا من عجائب المصنوعات فلا يتفكرون فيها\n أو القرآن وغيره من الكتب\n أصرفُ عنها { الذين يتكبّرون في الأرض } بالطبع على قلوبهم فلا يتفكرون فيها\n ولا يعتبرون\n ولا يؤمنون بها\n عقوبة لهم على تكبرهم\n وقيل: الصرف: منعهم من إبطالها وإطفاء نورها\n وإن اجتهدوا\n كما فعل فرعون وغيره\n فعاد عليهم بإعلائها وإظهار نورها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "74:29",
      "similarity": 0.6556394607099116
    },
    {
      "verse": "85:22",
      "similarity": 0.6367676986937288
    },
    {
      "verse": "4:66",
      "similarity": 0.24696016940164037
    },
    {
      "verse": "54:13",
      "similarity": 0.21828139305016073
    },
    {
      "verse": "3:138",
      "similarity": 0.21589825319558495
    }
  ]
}