{
  "chapter": "الأعراف",
  "text": "ولما سقط فى ايديهم وراوا۟ انهم قد ضلوا۟ قالوا۟ لئن لم يرحمنا ربنا ويغفر لنا لنكونن من الخسرين",
  "translations": [
    {
      "translation": "When they took full stock of what they had done and saw they had been misled, they said, 'If our Lord does not have mercy on us and forgive us, we will certainly be among the lost.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they were filled with remorse and saw that they had erred and said: \"If our Lord does not forgive us we will surely be lost.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they were afflicted with remorse and realized that they had fallen into error, they said: 'If our Lord does not have mercy on us and does not pardon us, we shall be among the losers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they found that they had believed in the wrong thing, they regretfully said, \"If our Lord will not have mercy on us and forgive us, we will certainly be lost.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they repented and realised that they had gone astray, they said, “If our Lord does not have mercy on us and forgive us, we are ruined.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they regretted and saw that they had gone astray, they said: \"If our Lord have not mercy upon us and forgive us, we shall certainly be of the losers\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they repented and saw that they had gone astray, they said: If our Lord show not mercy to us and forgive us we shall certainly be of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they smote their hands, and saw that they had gone astray, they said, 'If our Lord has not mercy on us, and forgives us not, surely we shall be of the lost.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they feared the consequences thereof and saw that they had gone astray, they said: Unless our Lord have mercy on us and forgive us, we verily are of the lost.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they were afflicted with remorse, and realized that they had indeed gone astray, they said, \"If our Lord does not have mercy on us and forgive us, we shall be among the lost.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they repented and saw that they had strayed, they said: if our Lord have not mercy on us and forgive us not, we shall surely be of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they became remorseful and realised they had gone astray, they said, ‘Should our Lord have no mercy on us, and forgive us, we will be surely among the losers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they repented, and saw that they had erred, they said: \"If our Lord have not mercy upon us and forgive us, we shall indeed be of those who perish.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they regretted and saw that they had gone astray, they (repented and) said: \"If our Lord have not mercy upon us and forgive us, we shall certainly be of the losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when it landed in their hands and saw that they had strayed, they said: 'If our Lord does not have mercy on us and forgive us, we shall be lost'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they regretted, and realized that they had erred, they said, “Unless our Lord extends His mercy to us, and forgives us, we will be among the losers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when regret overcame them and they saw that they had gone astray, they said, \"If our Lord does not have mercy upon us and forgive us, we will surely be among the losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:149] And when they became at a loss, that is, [when] they became remorseful for having worshipped it, and saw, [and] realised, that they had gone astray, thereby, and this was after Moses’s return [from the communion], they said, ‘Unless our Lord is merciful to us and forgives us (read both [verbs] either in the third person singular or in the second person singular), verily we shall be among the losers’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nكان مقتضى الظاهر في ترتيب حكاية الحوادث أن يتأخر قوله : { ولما سُقط في أيديهم } الآية ، عن قوله : { ولما رَجع موسى إلى قومه غضبانَ أسِفاً } \\[ الأعراف : 150 \\] لأنهم ما سُقط في أيديهم إلاّ بعد أن رجع موسى ورأوا فَرْط غضبه وسمعوا توبيخه أخاه وإيّاهم ، وإنما خولف مقتضى الترتيب تعجيلاً بذكر ما كان لاتخاذهم العجل من عاقبة الندامة وتبين الضلالة ، موعظة للسامعين لكيلا يعجلوا في التحول عن سنتهم ، حتى يتبينوا عواقب ما هم متحولون إليه .و { سُقط في أيديهم } مبني للمجهول ، كلمة أجراها القرآن مجرى المثل إذا أُنظمت على إيجاز بديع وكناية واستعارة ، فإن اليد تستعار للقوة والنصرة إذ بها يُضرب بالسيففِ والرمح ، ولذلك حين يَدْعون على أنفسهم بالسوء يقولون : «شَلّتْ من يديّ الأنامل» ، وهي آلةُ القدرة قال تعالى : { ذَا الأيد } \\[ ص : 17 \\] ، ويقال : ما لي بذلك يدٌ ، أوْ ما لي بذلك يَداننِ أي لا أستطيعه ، والمرء إذا حصل له شلل في عضد ولم يستطع تحريكه يحسن أن يقال : سَقط في يده ساقط ، أي نزل به نازل .ولما كان ذكر فاعل السقوط المجهول لا يزيد على كونه مشتقاً من فعله ، ساغ أن يُبنى فعله للمجهول فمعنى «سُقط في يده» سَقط في يده ساقِط فأبطل حركة يده ، إذ المقصود أن حركة يده تعطلت بسبب غير معلوم ، إلاّ بأنه شيء دخل في يده فصيّرها عاجزة عن العمل وذلك كناية عن كونه قد فجأه ما أوجب حيرته في أمره ، كما يقال : فُتَ في ساعده .وقد استعمل في الآية في معنى الندم وتبيُّن الخطأ لهم ، فهو تمثيل لحالهم بحال من سُقط في يده حين العمل . فالمعنى أنهم تبين لهم خطأهم وسوء معاملتهم ربهم ونبيهم ، فالندامة هي معنى التركيب كله ، وأما الكناية فهي في بعض أجزاء المركب وهو سقط في اليد ، قال ابن عطية «وحُدثت عن أبي مروان بن سراج» أنه كان يقول قول العرب : سقط في يده مما أعياني معناه ، وقال الزجاح هو نظم لم يُسمع قبل القرآن ، ولم تعرفه العرب .قلت وهو القول الفصل ، فإني لم أره في شيء من كلامهم قبل القرآن ، فقول ابن سراج : قول العرب سقط في يده ، لعله يريد العرب الذين بعدَ القرآن .والمعنى لما رجع موسى إليهم وهددهم وأحرق العجل كما ذكر في سورة طه ، وأوجز هنا إذ من المعلوم أنهم ما سقط في أيديهم ورأوا أنهم ضلوا بعد تصميمهم وتصلبهم في عبادة العجل وقولهم : { لن نبرح عليه عاكفين } \\[ طه : 91 \\] ، إلاّ بسبب حادث حدث ينكشف لهم بسببه ضلالهم ، فطيّ ذلك من قبيل الإيجاز ليبنى عليه أن ضلالهم لم يلبث أن انكشف لهم ، ولذلك قرن بهذا حكاية اتخاذهم العجل للمبادرة ببيان انكشاف ضلالهم تنهية لقصة ضلالهم ، وكأنه قيل : فسقط في أيديهم ورأوا أنهم قد ضلوا ثم قيل ولما سقط أيديهم قالوا .وقولهم : { لئن لم يرْحمنْا ربنا ويغفر لنا لنكونن من الخاسرين } توبة وإنابة ، وقد علموا أنهم أخطأوا خطيئة عظيمة ، ولذلك أكدوا التعليق الشرطي بالقسم الذي وطَأتْه اللامُ . وقدموا الرحمة على المغفرة؛ لأنها سببها .ومجيء خبر كان مقترناً بحرف ( مِن ) التبعيضية؛ لأن ذلك أقوى في إثبات الخسارة من لنكونن خاسرين كما تقدم في قوله تعالى : { قد ضللتُ إذاً وما أنا من المهتدين } \\[ الأنعام : 55 \\] وقرأه الجمهور { يرحمنا ربنا ويغفر } بياء الغيبة في أول الفعلين وبرفع ربُّنا ، وقرأ حمزة والكسائي وخلف بتاء الخطاب في أول الفعلين ونصب ربّنا على النداء ، أي قالوا ذلك كله لأنهم دعوا ربهم وتداولوا ذلك بينهم .\n\n",
      "translations": [
        {
          "translation": "(And when they feared the consequences thereof) and when they regretted having worshipped the calf (and saw) and knew and were certain (that they had gone astray) from the Truth and guidance, (they said: Unless our Lord have mercy on us and forgive us) and hence torment us, (we verily are of the lost) by receiving the punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَمَّا سُقِطَ فِيۤ أَيْدِيهِمْ } معناهُ نَدِمُوا\n\n",
      "translations": [
        {
          "translation": "\n\nAnd when they fell into their hands, they regretted it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولاح عندهم قبح صنيعهم هذا { وَ } بالجملة: { رَأَوْاْ } وعلموا { أَنَّهُمْ قَدْ ضَلُّواْ } بهذه الغفلة القبيحة عن مقتضى العقل والنقل { قَالُواْ } متضرعين مسترجعين خائفين\n خجلين: { لَئِن لَّمْ يَرْحَمْنَا رَبُّنَا } بسعة رحمته وجوده { وَ } لم { يَغْفِرْ لَنَا } ما جئتنا به ولم يتجاوز عنا ما فرطنا فيه { لَنَكُونَنَّ مِنَ ٱلْخَاسِرِينَ } [الأعراف: 149] خسراناً عظيماً في الدنيا والآخرة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ورأوا } أي: علموا { أنهم قد ضلّوا } باتخاذ العجل\n { قالوا لئن لم يرحمنا ربنا ويغفر لنا } بالتجاوز عن خطيئتنا\n { لنكونَنّ من الخاسرين } دنيًا وأخرى\n الإشارة: كلّ مَن ركن إلى شيء وعكف على محبته من دون الله فهو في حقه عجل يعبده من دون الله\n \" ما أحببت شيئًا إلا وكنت عبدًا له\n وهو لا يحب أن تكون عبدًا لغيره \"\n عافانا الله من ذلك\n ثم ذكر رجوع موسى عليه السلام من الطور\n فقال: { وَلَمَّا رَجَعَ مُوسَىٰ إِلَىٰ قَوْمِهِ غَضْبَانَ أَسِفاً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "9:49",
      "similarity": 0.5943359578443269
    },
    {
      "verse": "26:187",
      "similarity": 0.4792275596644193
    },
    {
      "verse": "17:92",
      "similarity": 0.41518748041669057
    },
    {
      "verse": "34:9",
      "similarity": 0.3792596676904457
    },
    {
      "verse": "7:23",
      "similarity": 0.31715761791496855
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007149.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007149.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:149.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}