{
  "chapter": "الأعراف",
  "text": "ولما جاء موسى لميقتنا وكلمه ربه قال رب ارنى انظر اليك قال لن ترىنى ولكن انظر الى الجبل فان استقر مكانه فسوف ترىنى فلما تجلى ربه للجبل جعله دكا وخر موسى صعقا فلما افاق قال سبحنك تبت اليك وانا۠ اول المؤمنين",
  "translations": [
    {
      "translation": "When Moses arrived at the appointed time and his Lord spoke to him, he said: \"O Lord, reveal Yourself to me that I may behold You.\" \"You cannot behold Me,\" He said. \"But look at the mountain: If it remains firm in its place you may then behold Me.\" But when his Lord appeared on the mountain in His effulgence, it crumbled to a heap of dust, and Moses fell unconscious. When he came to, he said: \"All glory to You. I turn to You in repentance, and I am the first to believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses came at Our appointment, and his Lord spoke to him, he said: 'O my Lord! Reveal Yourself to me, that I may look upon You!' He replied: 'Never can you see Me. However, behold this mount; if it remains firm in its place, only then you will be able to see Me.' And as soon as his Lord unveiled His glory to the mount, He crushed it into fine dust, and Moses fell down in a swoon. And when he recovered, he said: 'Glory be to You! To You I turn in repentance, and I am the foremost among those who believe.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "During the appointment, the Lord spoke to Moses. He asked the Lord to show Himself so that he could look at Him. The Lord replied, \"You can never see Me. But look at the mountain. If the mountain remains firm only then will you see Me.\" When the Lord manifested His Glory to the mountain, He turned it into dust and Moses fell down upon his face senseless. After regaining his senses, Moses said, \"Lord, You are all Holy. I repent for what I asked you to do and I am the first to believe in You.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moosa presented himself upon Our promise, and his Lord spoke to him, he said, “My Lord! Show me Your Self, so that I may see You”; He said, “You will never be able to see Me, but look towards the mountain – if it stays in its place, then you shall soon see Me”; so when his Lord directed His light on the mountain, He blew it into bits and Moosa fell down unconscious; then upon regaining consciousness he said, “Purity is to You! I incline towards You, and I am the first Muslim.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Musa came at the time and place appointed by Us, and his Lord (Allah) spoke to him; he said: \"O my Lord! Show me (Yourself), that I may look upon You.\" Allah said: \"You cannot see Me, but look upon the mountain; if it stands still in its place then you shall see Me.\" So when his Lord appeared to the mountain, He made it collapse to dust, and Musa fell down unconscious. Then when he recovered his senses he said: \"Glory be to You, I turn to You in repentance and I am the first of the believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Musa came at Our appointed time and his Lord spoke to him, he said: My Lord! show me (Thyself), so that I may look upon Thee. He said: You cannot (bear to) see Me but look at the mountain, if it remains firm in its place, then will you see Me; but when his Lord manifested His glory to the mountain He made it crumble and Musa fell down in a swoon; then when he recovered, he said: Glory be to Thee, I turn to Thee, and I am the first of the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses came to Our appointed time and his Lord spoke with him, he said, 'Oh my Lord, show me, that I may behold Thee!' Said He, 'Thou shalt not see Me; but behold the mountain -- if it stays fast in its place, then thou shalt see Me.' And when his Lord revealed Him to the mountain He made it crumble to dust; and Moses fell down swooning. So when he awoke, he said, 'Glory be to Thee! I repent to Thee; I am the first of the believers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses came to Our appointed tryst and his Lord had spoken unto him, he said: My Lord! Show me (Thy Self), that I may gaze upon Thee. He said: Thou wilt not see Me, but gaze upon the mountain! If it stand still in its place, then thou wilt see Me. And when his Lord revealed (His) glory to the mountain He sent it crashing down. And Moses fell down senseless. And when he woke he said: Glory unto Thee! I turn unto Thee repentant, and I am the first of (true) believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses came at Our appointed time and his Lord spoke to him, he said, \"My Lord, show Yourself to me so that I may look at You.\" He replied, \"You cannot see Me, but look at the mountain; if it remains firmly in its place, then only will you see Me.\" And when his Lord manifested Himself on the mountain, He broke it into pieces and Moses fell down unconscious. And when he recovered, he said, \"Glory be to You, I turn towards You, and I am the first to believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Musa came at Our appointment, and his Lord spake unto him, he said my Lord! shew Thyself unto me, that I may look at Thee! He said: thou canst not see Me: but look at the yonder mount; if it stands in its place, then thou wilt see Me. Then when his Lord unveiled His glory unto the mount, it turned it to dust, and Musa tell down thunderstruck. Then when he recovered, he said: hallowed be Thou! I turn unto Thee repentant, and I am the first of the believers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses arrived at Our tryst and his Lord spoke to him, he said, ‘My Lord, show [Yourself] to me, that I may look at You!’ He said, ‘You shall not see Me. But look at the mountain: if it abides in its place, then you will see Me.’ So when his Lord disclosed Himself to the mountain, He levelled it, and Moses fell down swooning. When he recovered, he said, ‘Immaculate are You! I turn to You in penitence, and I am the first of the faithful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses came to the place appointed by Us, and his Lord addressed him, He said: \"O my Lord! show (Thyself) to me, that I may look upon thee.\" Allah said: \"By no means canst thou see Me (direct); But look upon the mount; if it abide in its place, then shalt thou see Me.\" When his Lord manifested His glory on the Mount, He made it as dust. And Moses fell down in a swoon. When he recovered his senses he said: \"Glory be to Thee! to Thee I turn in repentance, and I am the first to believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Musa (Moses) came at the time and place appointed by Us, and his Lord spoke to him, he said: \"O my Lord! Show me (Yourself), that I may look upon You.\" Allah said: \"You cannot see Me, but look upon the mountain if it stands still in its place then you shall see Me.\" So when his Lord appeared to the mountain, He made it collapse to dust, and Musa (Moses) fell down unconscious. Then when he recovered his senses he said: \"Glory be to You, I turn to You in repentance and I am the first of the believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses came at the appointed time and his Lord spoke to him, he said: 'Lord, let me see, that I can look at You' He replied: 'You shall not see Me. But look at the mountain; if it remains firm in its place, then shall you see Me' And when his Lord was revealed to the mountain and caused it to be crushed and leveled whereupon Moses fell down senseless, and when he recovered, he said: 'Exaltations to You! I repent to You. I am the first of believers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses came to Our appointment, and his Lord spoke to him, he said, “My Lord, allow me to look and see You.” He said, “You will not see Me, but look at the mountain; if it stays in its place, you will see Me.” But when his Lord manifested Himself to the mountain, He turned it into dust, and Moses fell down unconscious. Then, when he recovered, he said, “Glory be to you, I repent to you, and I am the first of the believers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses arrived at Our appointed time and his Lord spoke to him, he said, \"My Lord, show me [Yourself] that I may look at You.\" [Allah] said, \"You will not see Me, but look at the mountain; if it should remain in place, then you will see Me.\" But when his Lord appeared to the mountain, He rendered it level, and Moses fell unconscious. And when he awoke, he said, \"Exalted are You! I have repented to You, and I am the first of the believers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:143] And when Moses came at Our appointed time, that is, the time at which We had promised to speak to him, and his Lord spoke with him, without any intermediary, with speech which he heard from all directions, he said, ‘My Lord! Show me, Yourself, that I may behold You!’ Said He, ‘You shall not see Me, that is to say, you do not have the power to see me, the use of this expression [lan tarānī, ‘you shall not see Me’] instead of lan urā, ‘I shall not be seen’, implies that it is possible to see God, exalted be He; but behold the mountain, which is stronger than you are, and if it remains, stays fixed, in its place, then you shall see Me’, that is, [then] you shall remain fixed [able] to see Me, otherwise, you will not have the capacity [for it]. And when his Lord revealed Himself, that is, [when] He manifested of His Light the equivalent of half a nail of a little finger, as stated in one hadīth verified by al-Hākim, to the mountain He levelled it to the ground (read dakkan or dakkā’a, meaning madkūkan) and Moses fell down senseless, having lost consciousness at the awesomeness of what he had seen. And when he recovered his senses he said, ‘Glory be to You!, in Your transcendence. I repent to You, for having asked You what I was not commanded [to ask], and I am the first of the believers’, of my time.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when Moses came to Our appointed tryst) in Midian (and his Lord had spoken unto him, he said: My Lord! Show me (Thy self)) he wished to see Allah, (that I may gaze upon Thee. He) Allah (said: Thou wilt not see Me) you will not be able to see me in the life of this world, Moses, (but gaze upon the mountain) the highest mountain in Midian! (If it stand still in its place) if the mountain stands still when seeing Me, (then thou wilt see Me) then may be you will see Me. (And when his Lord revealed (His) glory to the mountain) to Mount Zubayr (He sent it crashing down. And Moses fell down senseless) he passed out. (And when he woke) from his fainting (he said: Glory unto Thee!) he glorified His Lord (I turn unto Thee repentant) from asking to see You, (and I am the first of (true) believers) that you will not be seen in the life of this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { جَعَلَهُ دَكّاً } معناهُ مُستوٍ مع وَجهِ الأَرضِ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\nوقوله: رأيت ربي بعين ربّي { ولكن أنظر إلى الجبل } أي: جبل وجودك { فإنْ استقرّ مكانه } أمكنت رؤيتك إياي، وذلك من باب التعليق بالمحال { جعله دكّاً } أي: متلاشياً لا وجود له أصلاً { وخرّ موسى } عن درجة الوجود فانياً { فلما أفاق } بالوجود الموهوب الحقاني عند البقاء بعد الفناء { قال سبحانك } أن تكون مرئياً لغيرك، مدركاً لأبصار الحدثان { تُبْت إليك } عن ذنب البقية { وأنا أوّل المؤمنين } بحسب الرتبة لا بحسب الزمان، أي: أنا في الصف الأول من صفوف مراتب الأرواح الذي هو مقام أهل الوحدة وذلك مقام الاصطفاء المحض",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكروا { لَمَّا } أي: حين { جَآءَ مُوسَىٰ لِمِيقَاتِنَا } المبعوث إليكم لإصلاح حالكم ليناجي معنا { وَ } من غاية اللطف والجود { كَلَّمَهُ رَبُّهُ } أي: كلم معه مرتبته التي حصل له وانكشف بها من الله؛ إذ لكل أحد بل لكل ذرة من ذرائر المظاهر مرتبة خاصة وظن مخصوص بالنسبة إلى الله؛ لذلك قال سبحانه:\n\n \" أنا عند ظن عبدي بي \"\n \n\n \n\nوأعلى المراتب وأسناها مرتبة النبوة والرسالة على تفاوت طبقاتها، ثم الأمثل فالأمثل، كما انبسط موسى وانكشف من ربه بما اكشف، حيث سمع كلامه من جميع الجوانب بلا واسطة ووسيلة من مَلَك وغيرها، بلا تلفظ وتقطيع حروف، اضطرب ووله ومن غاية ولهه وسكره تسارعه إلى انكشاف أجلى منه { قَالَ } بعد سماع كلامه سبحانه: { رَبِّ أَرِنِيۤ } يا ربي، فإنك تنزهت عن المقابلة والمحاذاة والمماثلة والمحاكاة، كما أسمعتني كلامك المنزه عن الحروف والأصوات وتقطيع الكلمات { أَنظُرْ إِلَيْكَ } ببصري كما سمعت كلامك بسمعي\n\n\n\n\n{ قَالَ } سبحانه: { لَن تَرَانِي } يا موسى ما دمت في جلباب تعينك وغشاوة هويتك { وَلَـٰكِنِ } إن أردت أن تعرف استعدادك لرؤيتي { انْظُرْ إِلَى الْجَبَلِ } حي تجليت عليه بهويتي المسقطة لهوياتها مطلقاً { فَإِنِ اسْتَقَرَّ } وثبت عندك { مَكَانَهُ } بعدما أتجلى عليه بذاتي، وإن بقي على هويته التي هويته هو فيها قبل التجلي { فَسَوْفَ تَرَانِي } أي: فيمكنك أن تراني لهويتك { فَلَمَّا تَجَلَّىٰ رَبُّهُ لِلْجَبَلِ جَعَلَهُ دَكّاً } مدكوكاً مفتتاً متلاشياً كأن لم يكن أصلاً حيث اضمحلت جميع تعيناته الباطلة { وَ } بعدما رأى الكليم ما رأى { خَرَّ } أي: سقط { موسَىٰ } بعدما نظر نحوه فلم يره { صَعِقاً } جائزا هائماً قلقاً مغشياً، كأنه انفصل عن لوازم هويته { فَلَمَّآ أَفَاقَ } موسى عن ولهه وسكره وانكشف من ربه بما انكشف أنه لا يرى الله إلا الله { قَالَ } مستحيياً منيباً خائفاً مستنزهاً: { سُبْحَانَكَ } أن يحيط بك أحد من مصنوعاتك { تُبْتُ } ورجعت { إِلَيْكَ } يا ربي بما اجترأت من سؤل ما ليس في وسعي وطاقتي { وَ } بعدما عرفتك الآن عرفاناً أكمل وانكشفت منك يا ربي ما لم انكشف لو من قبل { أَنَاْ أَوَّلُ ٱلْمُؤْمِنِين } [الأعراف: 143] الموقنين بعظمتك وجلالك؛ إذ لا اعتداد لإيماني من قبل\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ولما جاء موسى لميقاتنا } الذي وقتنا له { وكلَّمه ربه } من غير واسطة كما يكلم الملائكة\n وفيما رُوِي: أنه كان يسمع ذلك الكلام من كل جهة، وفيه تنبيه على أن سماع كلامه القديم ليس من جنس كلام المحدثين\n قاله البيضاوي\n وقال الورتجبي: أي أسمع عجائب كلامه كليمه ليعرفه بكلامه لأن كلامه مفاتيح كنوز الصفات والذات\n هـ\n وقال ابن جزي: لما سمع موسى كلام الله طمع في رؤيته، فسألها، كما قال الشاعر:\n\n{ قال ربِّ أرني أنظر إليك } أي: أرني نفسك أنظر إليك، بأن تكشف الحجب عني، حتى أنظر إلى ذاتك المقدسة من غير واسطة، كما أسمعتني كلامك من غير واسطة\n قال البيضاوي: وهو دليل على أن رؤيته تعالى جائزة في الجملة لأن طلب المستحيل من الأنبياء محال، وخصوصًا ما يقتضي الجهل بالله، ولذلك رده بقوله تعالى: { لن تراني } دون لن أُرِى ولن أريك، ولن تنظر إليّ، تنبيهًا على أنه قاصر عن رؤيته لتوقفها على حال في الرائي، لم توجد فيه بعدُ، وجعلُ السؤال لتبكيت قومه الذين قالوا:\n\n[النَّساء:153] خطأ، إذ لو كانت الرؤية ممتنعة لوجب أن يجهلهم ويزيح شبههم، كما فعل بهم حين قالوا:\n\n[الأعرَاف:138]، والاستدلال بالواجب على استحالتها أشد خطأ، إذ لا يدل الإخبار عن عدم رؤيته أياه على أنه لا يراه أبدًا، وألا يراه غيره أصلاً، فضلاً عن أن يدل على استحالتها\n ودعوى الضرورة فيه مكابرة وجهالة بحقيقة الرؤية\n هـ\n وهو تعريض بالزمخشري وردُّ عليه، فإنه أطلق لسانه في أهل السنة ـ عفا الله عنه ـ\n والتحقيق: أن رؤيته تعالى برداء الكبرياء ـ وهي أنوار الصفات ـ جائرة واقعة ـ، وأما رؤية أسرار الذات ـ وهي المعاني الأزلية، التي هي كنه الربوبية ـ فغير جائزة إذ لو ظهرت تلك الأسرار لتلاشت الأكوان واضمحلت، ولعل هذا المعنى هو الذي طلب سيدنا موسى عليه السلام، فلذلك قال له: { لن تراني ولكن انظر إلى الجبل فإن استقرَّ مكانه } عند تجلي هذه الأسرار له، { فسوف تراني فلما تجلى ربُّه للجبل } أي: أظهر له شيئًا من أنوار الربوبية التي هي أسرار المعاني الأزلية، { جعله دكًا } أي: مدكوكًا مفتتًا، والدك والدق واحد، وقرأ حمزة: \" دكاء \" بالمد، أي: أرضًا مستوية، ومنه: ناقة دكاء لا سنم لها\n { وخرَّ موسى صَعِقًا } مغشيًا عليه من هول ما رأى، { فلما أفاق قال } تعظيمًا لما رأى: { سبحانك تُبت إليك } من الجرأة والإقدام على السؤال بغير إذن، وقال بعضهم: تُبتُ إليك من عدم الاكتفاء بقوله: { لن تراني } حتى نظر إلى الجبل، { وأنا أولُ المؤمنين } أنك لا تُرى بلا واسطة نور الصفات، أو أول أهل زماني إيمانًا\n\n\nالإشارة: رؤية الحق جائزة واقعة عند الصوفية في الدارين، ولكن لا ينالها في هذه الدار إلا خواص الخواص، ويُعبّرون عنها بالشهود والعيان، ولا يكون ذلك إلا بعد الفناء، وفناء الفناء بعد موت النفس وقتلها، ثم الغيبة عن حسها ورسمها، تكون بعد التهذيب والتدريب والتربية على يد شيخ كامل، لا يزال يسير به ويقطع به في المقامات، ويغيبه عن نفسه ورؤية وجوده، حتى يقول له: ها أنت وربك، وذلك أن الحق جل جلاله تجلى لعباده بأسرار المعاني خلف رداء الأواني، وهو حس الأكوان، فأسرار المعاني لا يمكن ظهورها إلا بواسطة الأواني، أو تقول: أسرار الذات لا تظهر إلا في أنوار الصفات، فلو ظهرت أسرار الذات بلا واسطة لاضمحلت الأشياء واحترقت، كما في الحديث:\n\n \" حِجَابُهُ النُّورُ، لَو كشَفَهُ لأحرقَت سُبُحَاتُ وَجههِ ما أنتَهَى إلَيه بَصَرُهُ من خلَقِهِ \"\n \n\nفالمراد بالنور نور الصفات، وهو الأواني الحاملة للمعاني، لو كشف ذلك النور حتى تظهر أسرار الذات لأحرقت كل شيء أدركه بصره\n والواسطة عند المحققين هي عين عين الموسوط، فلا يزال المريد يفنى عن عين الواسطة في شهود الموسوط حتى يغيب عن الواسطة بالكلية، أو تقول: لا يزال يغيب عن الأواني بشهود المعاني حتى تشرق شمس العرفان، فتغيب الأواني في ظهور المعاني، فيقع العيان على فقد الأعيان، \" كان الله ولا شيء معه، وهو الآن على ما عليه كان \" ، \" ما حجبك عن الحق وجود موجود معه، إذ لا شيء معه، وإنما حجبك توهم موجود معه \"\n والحاصل: أن الحق تعالى تكون رؤيته أولاً بالبصيرة دون البصر، لأن البصيرة تدرك المعاني، والبصر يدرك الحسيات، فإذا انفتحت البصيرة استولى نورها على نور البصر، فلا يرى البصر حينئذٍ إلا ما تراه البصيرة\n قال بعض العارفين: هذه المزية العظمى ـ وهي رؤية الحق تعالى ـ في الدنيا على هذا الوجه: خاص بخواص الأمة المحمدية ـ دون سائر الأمم ـ وراثة عن نبيهم صلى الله عليه وسلم، فإنه خص بالرؤية دون غيره من الأنبياء\n وإلى ذلك أشار ابن الفارص في تائيته، مترجمًا بلسان الحقيقة المحمدية، حيث قال:\n\nقال شارحه القاشاني: أراد بهذا البحر: الرؤية التي مُنع منها موسى عليه السلام، وخص بها محمد ـ عليه الصلاة والسلام ـ وأفراد من أتباعه\n ثم قال: ورد في الخبر: أنه لما أفاق موسى عليه السلام من صعقته قيل له: ليس ذلك لك، ذلك ليتيم يأتي من بعدك، ثم قال: سبحانك تبتُ إليك عما تعديتُ لما ليس لي، وأنا أول المؤمنين بتخصيص محمد صلى الله عليه وسلم بهذا المقام\n\n\nهـ\n وقيل في قوله: { فلما تجلى ربُّه للجبل } أي: جبل العقل، بحيث طمس نوره بنور شمس العرفان، وخر موسى صعقًا، أي: ذهب وجوده في وجود محبوبه، وحصل له الزوال في مكان الفناء والسكر، فلما أفاق ورجع إلى البقاء تمسك بمقام العبودية والأدب مع الربوبية فقال: { سبحانك تبتُ إليك } من رؤية جبل الحس قبل شهود نور المعنى، وأنا أول المؤمنين بأن نور المعاني خلف رداء الأواني، لا يدرك إلا بعد الصعقة، والله تعالى أعلم\n ثم ذكر نزول التوراة، فقال: { قَالَ يٰمُوسَىٰ إِنِّي ٱصْطَفَيْتُكَ عَلَى ٱلنَّاسِ }\n\n",
      "translations": []
    }
  ]
}