{
  "chapter": "الأعراف",
  "text": "واتخذ قوم موسى منۢ بعده من حليهم عجلا جسدا له خوار الم يروا۟ انه لا يكلمهم ولا يهديهم سبيلا اتخذوه وكانوا۟ ظلمين",
  "translations": [
    {
      "translation": "After he left, Musa's people adopted a calf made from their ornaments, a form which made a lowing sound. Did they not see that it could not speak to them or guide them to any way? They adopted it and so they were wrongdoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In the absence of Moses his people prepared the image of a calf from their ornaments, which gave out the mooing of a cow. Yet they did not see it could neither speak to them nor guide them to the right path. Even then they took it (for a deity) and did wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And in the absence of Moses his people made the image of a calf from their ornaments, which lowed. Did they not observe that it could neither speak nor give them any guidance? And still they made it an object of worship. They were indeed wrong-doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In Moses' absence, his people manufactured a hollow sounding calf out of their ornaments. Could they not see that it could not speak to them or provide them with any guidance? They gained only evil by worshipping the calf.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And behind Moosa, his people moulded a calf from their ornaments – a lifeless body making sounds like a cow; did they not see that it neither speaks to them nor guides them in any way? They chose it (for worship), and were unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of Musa made in his absence, out of their ornaments, the image of a calf (for worship). It had a sound. Did they not see that it could neither speak to them nor guide them to the way They took it (for worship) and they were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa's people made of their ornaments a calf after him, a (mere) body, which gave a mooing sound. What! could they not see that it did not speak to them nor guide them in the way? They took it (for worship) and they were unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of Moses took to them, after him, of their ornaments a Calf -- a mere body that lowed. Did they not see it spoke not to them, neither guided them upon any way? Yet they took it to them, and were evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the folk of Moses, after (he left them), chose a calf (for worship), (made) out of their ornaments, of saffron hue, which gave a lowing sound. Saw they not that it spake not unto them nor guided them to any way? They chose it, and became wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In his absence, the people of Moses made a calf from their ornaments, an image which made a lowing sound. Could they not see that it did not speak to them or guide them in any way? Yet they took to worshipping it: they were evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ehe people of Musa, after him, took of their trinkets a calf: a body with a low. Saw they not that it spake nor unto them nor could guide them to a way? They took it, and became wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Moses took up in his absence a calf [cast] from their ornaments—a body that gave out a lowing sound. Did they not regard that it did not speak to them, nor did it guide them to any way? They took it up [for worship] and they were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of Moses made, in his absence, out of their ornaments, the image of calf, (for worship): it seemed to low: did they not see that it could neither speak to them, nor show them the way? They took it for worship and they did wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of Musa (Moses) made in his absence, out of their ornaments, the image of a calf (for worship). It had a sound (as if it was mooing). Did they not see that it could neither speak to them nor guide them to the way? They took it for worship and they were Zalimun (wrong-doers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In his absence, the nation of Moses made a calf from their ornaments, a body with a hollow sound. Did they not see that it could neither speak to them, nor guide them to a path? Yet they took it in worship and were harmdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In his absence, the people of Moses adopted a calf made from their ornaments—a body which lowed. Did they not see that it could not speak to them, nor guide them in any way? They took it for worship. They were in the wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of Moses made, after [his departure], from their ornaments a calf - an image having a lowing sound. Did they not see that it could neither speak to them nor guide them to a way? They took it [for worship], and they were wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:148] And the people of Moses, after him, that is, after he had departed for the communion [with God], made of their ornaments, which they had borrowed from Pharaoh’s folk on the pretext of a wedding celebration, and which remained in their possession, a calf, which the Samaritan had fashioned for them therefrom; a [mere] living body (jasadan is a substitution [for ‘ijlan, ‘a calf’]), of flesh and blood, which lowed, that is, [which] made audible sounds [like a cow]: it [the calf] was transformed in this way when the dust, which he [the Samaritan] had collected from [where] the hoof of Gabriel’s steed [had trodden], was placed in its mouth, for it has the effect of [giving] life to that in which it is placed (the second direct object of the verb ittakhadha, ‘[they] made’, has been omitted, but it would be ilāhan, ‘[as] a god’). Did they not see that it spoke not to them, nor guided them to any way?, so how can it be taken as a god? Yet they took it as such, a god, and were evildoers, for taking it so.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the folk of Moses, after (he had left them)) to go in retreat in the mountain, (chose) made (a calf (for worship), (made) out of their ornaments, of saffron hue) of their gold, (which gave a lowing sound) a sound that the Samiri made for them. (Saw they not) did the people of Moses not know (that it spake not unto them) i.e. the calf (nor guided them to any way? They chose it) they worshipped the calf out of ignorance, (and became wrong-doers) and they harmed themselves by worshipping it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { خُوَارٌ } معناهُ لَهُ صوتٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - {khawārun} - its meaning for him is a sound.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من جملة الأسباب الموجبة لإحباط أعمالهم: اتخاذهم العجل إلهاً\n وذلك أنه { ٱتَّخَذَ قَوْمُ مُوسَىٰ مِن بَعْدِهِ } أي: من بعد ذهابه إلى الميقات عنده ربه { مِنْ حُلِيِّهِمْ } التي ورثوها من القبط بتعليم السامري أياهم { عِجْلاً } صورة عجل\n وبعدها أذابوا الحلي وصاغوها ألغى السامري عليها ما قبض من تراب حافر فرس جبريل فصارت { جَسَداً لَّهُ خُوَارٌ } صوت كصوت البقر\n فقال السامري: هذا إلهكم وإله موسى فاتخذوها إلهاً\n مع أنهم صاغوها بأيديهم من حليهم\n أيأخذون العجل المصنوع إلهاً أولئك الهالكون في تيه الغفلة والنسيان\n\n\n{ أَلَمْ يَرَوْاْ } أي: لم يعلموا ولم يتفطنوا { أَنَّهُ لاَ يُكَلِّمُهُمْ } أي: المصوغ المصنوع لا يكلمهم بكلامٍ دال على إصلاح حالهم { وَلاَ يَهْدِيهِمْ } ويرشدهم { سَبِيلاً } أي: الخير والصواب حتى يستحق للعبودية\n بل { ٱتَّخَذُوهُ } معبوداً ظلماً وزوراً { وَكَانُواْ } في أنفسهم { ظَالِمِينَ } [الأعراف: 148] خارجين مجاوزين عن مقتضى العقل والنقل\n\n\n{ وَلَمَّا سُقِطَ فِيۤ أَيْدِيهِمْ } أي: ظهر ندمهم عن فعلهم\n واشتد فيهم تجهيل نفوسهم وتخطئة عقولهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { عِجلاً }: مفعول أول لاتخذ\n و { جسدًا }: بدل منه\n وحذف الثاني ـ أي: \" إلهًا \" ـ لدلالة أوله\n و { له خوار }: نعت له\n يقول الحقّ جلّ جلاله: { واتخذ قُوم موسى من بعده } أي: من بعد ذهابه للميقات\n { من حُليَّهم } التي كانوا استعاروها من القبط\n حين هموا بالخروج من مصر\n وإضافتها إليهم لأنها كانت تحت أيديهم\n فصنع لهم منها السامري { عِجلاً جسدًا } بلا روح\n فألقى في جوفه من تراب أثر فرس جبريل\n فصار { له خُوارٌ } \n فقال لهم: { هذا إلهكم وإله موسى } \n فعكفوا على عبادته\n واتخذوه إلهًا\n قال تعالى: { ألم يروا أنه لا يكلمهم ولا يهديهم سبيلاً } أي: ألم يروا\n حين اتخذوه إلهًا\n أنه لا يقدر على كلام\n ولا على إرشاد سبيل\n كآحاد البشر\n حتى حسبوا أنه خالق الأجسام والقوى والقدر\n وهذا تقريع على فرط ضلالتهم وإخلالهم بالنظر\n قال تعالى: { اتخذوه } إلهًا { وكانوا ظالمين } في اتخاذه\n وضعوا الأشياء في غير محلها\n أي: كانت عادتهم الظلم\n فلم يكن اتخاذ العجل بدعًا منهم\n { ولما سُقِطَ في أيديهم } كناية عن اشتداد ندمهم\n فإن النادم المتحسر يعض يده غمًا\n فتصير يده مسقوطًا فيها\n أو يسقط رأسه\n أي: يطأطئها لبعض يده\n وقال الدمياميني: العرب تضرب الأمثال بالأعضاء\n ولا تريد أعيانها\n تقول للنادم: يُسقط في يده\n وفي الذليل: رغم أنفه\n هـ\n أي: ولَمَّا ندموا على ما فعلوا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:88",
      "similarity": 0.8870763870620634
    },
    {
      "verse": "21:8",
      "similarity": 0.40516714250703656
    },
    {
      "verse": "38:34",
      "similarity": 0.27215422169499337
    },
    {
      "verse": "43:18",
      "similarity": 0.19554524340212565
    },
    {
      "verse": "22:23",
      "similarity": 0.14759686149116996
    }
  ]
}