{
  "chapter": "الأعراف",
  "text": "ساصرف عن ءايتى الذين يتكبرون فى الارض بغير الحق وان يروا۟ كل ءاية لا يؤمنوا۟ بها وان يروا۟ سبيل الرشد لا يتخذوه سبيلا وان يروا۟ سبيل الغى يتخذوه سبيلا ذلك بانهم كذبوا۟ بـايتنا وكانوا۟ عنها غفلين",
  "translations": [
    {
      "translation": "I will divert from My Signs all those who are arrogant in the earth without any right. If they see every Sign, they will not believe in it. If they see the way of right guidance, they will not take it as a way. But if they see the way of error, they will take that as a way. That is because they denied Our Signs and paid no attention to them.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will turn those away from My signs who behave unjustly with arrogance in the land so that even though they see all the signs they will not believe in them; and if they see the path of rectitude, will not take it to be a way; and if they see the way of error take it to be the (right) path. This is so for they have called Our messages lies, and have been heedless of them.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I shall turn away from My signs those who, without any right, behaved haughtily in the earth, even if they may, witness each and every, sign, they shall not believe therein. And even if they see the right path, they shall still not follow it; but if they see the path of error. they shall choose it for their path. This is because they rejected Our signs as false and were heedless to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will deprive those who are wrongly proud in the land of the blessing of revelations. Even if they would see all kinds of miracles, they would not have faith, or even to see the right path, they would not follow it. They would follow the rebellious way if they were to find one; in their ignorance, they have called Our revelations mere lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And I shall turn away from My signs the people who unjustly wish to be admired in the earth; and if they see all the signs, they would not believe them; and if they see the path of guidance, they would not prefer to tread it; and if they see the way of error, they would present themselves to tread it; that is because they denied Our signs and were ignoring them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I shall turn away from My Ayat those who behave arrogantly on the earth, without a right, and (even) if they see all the Ayat, they will not believe in them. And if they see the way of righteousness, they will not adopt it as the way, but if they see the way of error, they will adopt that way, that is because they have rejected Our Ayat and were heedless of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will turn away from My communications those who are unjustly proud in the earth; and if they see every sign they will not believe in It; and if they see the way of rectitude they do not take It for a way, and if they see the way of error. they take it for a way; this is because they rejected Our communications and were heedless of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I shall turn from My signs those who wax proud in the earth unjustly; though they see every sign, they will not believe in it, and though they see the way of rectitude they will not take it for a way, and though they see the way of error, they will take it for a way. That, because they have cried lies to Our signs and heeded them not.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I shall turn away from My revelations those who magnify themselves wrongfully in the earth, and if they see each token believe it not, and if they see the way of righteousness choose it nor for (their) way, and if they see the way of error choose if for (their) way. That is because they deny Our revelations and are used to disregard them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will turn away from My signs all those who are arrogant in the land without any right, so that even if they see all the signs they will not believe in them. If they see the right path, they shall not walk upon it: but if they see the path of error, they shall choose it for their path, because they have given the lie to Our signs and paid no heed to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I shall turn away from My signs those who are big with pride on the earth, without justice, and although they may see every sign, they will not believe therein; and if they see the path of rectitude they will not take it as their path, and if they see the path of error they will take it for their path. This is because they belied Our signs, and they were ever negligent thereof.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Soon I shall turn away from My signs those who are unduly arrogant in the earth: [even] though they should see every sign, they will not believe in it, and if they see the way of rectitude they will not take it as [their] way, and if they see the way of error they will take it as [their] way. That is because they deny Our signs and are oblivious to them.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who behave arrogantly on the earth in defiance of right - them will I turn away from My signs: Even if they see all the signs, they will not believe in them; and if they see the way of right conduct, they will not adopt it as the way; but if they see the way of error, that is the way they will adopt. For they have rejected our signs, and failed to take warning from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I shall turn away from My Ayat (verses of the Quran) those who behave arrogantly on the earth, without a right, and (even) if they see all the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), they will not believe in them. And if they see the way of righteousness (monotheism, piety, and good deeds), they will not adopt it as the Way, but if they see the way of error (polytheism, crimes and evil deeds), they will adopt that way, that is because they have rejected Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) and were heedless (to learn a lesson) from them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "From My signs I will turn away the unrightfully, arrogant in the land, so that even if they witness every sign they would not believe it. If they see the path of righteousness, they shall not take it as a path; but if they see the path of error, they shall take it for their path because they belied Our signs and were inattentive towards them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will turn away from My revelations those who behave proudly on earth without justification. Even if they see every sign, they will not believe in it; and if they see the path of rectitude, they will not adopt it for a path; and if they see the path of error, they will adopt it for a path. That is because they denied Our revelations, and paid no attention to them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I will turn away from My signs those who are arrogant upon the earth without right; and if they should see every sign, they will not believe in it. And if they see the way of consciousness, they will not adopt it as a way; but if they see the way of error, they will adopt it as a way. That is because they have denied Our signs and they were heedless of them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:146] I shall turn away from My signs, the proofs of My power, in the way of creations and otherwise, those who behave arrogantly in the earth without right, by humiliating them so that they do not magnify themselves; and if they see every sign do not believe in it, and if they see the way, the path, of rectitude, the guidance that has come from God, do not adopt it as a way, to follow, and if they see the way of error, misguidance, adopt it as a way. That, turning [of them] away, is because they have denied Our signs and were heedless of them. A similar statement has been made above.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيجوز أن تكون هذه الآية تكملة لما خاطب الله به موسى وقومه ، فتكون جملة { سأصرف } الخ بأسهم ، استئنافاً بيانياً ، لأن بني إسرائيل كانوا يهابون أولئك الأقوام ويخْشوْن ، فكأنهم تساءلوا كيف تُرينا دارهم وَتعدُنا بها ، وهلْ لا نهلك قبل الحلول بها ، كما حكى الله عنهم { قالوا يا موسى إن فيها قوماً جبّارين } الآية في سورة العقود ( 22 ) وقد حكى ذلك في الإصحاح الرابع عشر من سفر العدد ، فاجيبوا بأن الله سيصرف أولئك عن آياتِه .والصرف الدفع أي سَأَصُدُّ عن آياتي ، أي عن تعطيلها وإبطالها .والآيات الشريعة ، ووعد الله أهلها بأن يورثهم أرض الشام ، فيكون المعنى سأتَوَلّى دفعهم عنكم ، ويكون هذا مثل ما ورد في التوراة في الإصحاح الرابع والثلاثين «ها أنا طاردٌ من قُدَّامِك الأُموريين الخ» ، فالصرف على هذا الوجه عناية من الله بموسى وقومِه بما يُهيء لهم من أسباب النصر على أولئك الأقوام الأقوياء ، كإلقاء الرعببِ في قلوبهم ، وتشتيت كلمتهم ، وإيجاد الحوادث التي تفت في ساعد عُدتهم أو تكونُ الجملة جواباً لسؤال من يقول : إذا دخلنا أرض العدو فلعلهم يؤمنون بهدينا ، ويتبعون ديننا ، فلا نحتاج إلى قتالهم ، فأجيبوا بأن الله يَصرفهم عن إتباع آياته؛ لأنهم جُبلوا على التكبر في الأرض ، والإعراضضِ عن الآيات ، فالصرف هنا صرف تكويني في نفوس الأقوام ، وعن الحسن : أن من الكفار من يبالغ في كفره وينتهي إلى حد إذا وصل إليه مَات قلبه .وفي قَصِّ الله تعالى هذا الكلامَ على محمد صلى الله عليه وسلم تعريض بكفار العرب بأن الله دافِعُهم عن تعطيل آياته ، وبأنه مانع كثيراً منهم عن الإيمان بها لما ذكرناه آنفاً .ويجوز أن تكون جملة { سأصرف عن آياتي } من خطاب الله تعالى لرسوله محمد صلى الله عليه وسلم رَوى الطبري ذلك عن سفيان بن عيينة ، فتكون الجملة معترضة في أثناء قصة بني إسرائيل بمناسبة قوله : { سأُريكم دار الفاسقين } \\[ الأعراف : 145 \\] تعريضاً بأن حال مشركي العرب كحال أولئك الفاسقين ، وتصريحاً بسبب إدامتهم العناد والإعراض عن الإيمان ، فتكون الجملة مستأنفة استينافاً ابتدائياً ، وتأتي في معنى الصرف عن الآيات الوجوه السابقة واقتران فعل { سأصرف } بسين الاستقبال القريب تنبهه على أن الله يُعجل ذلك الصرف .وتقديم المجرور على مفعول { أصرف } للاهتمام بالآيات ، ولأن ذكره عقب الفعل المتعلق هو به أحسنُ .وتعريف المصروفين عن الآيات بطريق الموصولية للإيماء بالصلة إلى علة الصرف . وهي ما تضمنته الصلات المذكورة ، لأن من صارت تلك الصفات حالات له يَنصره الله ، أو لأنه إذا صار ذلك حاله رين على قلبه ، فصرف قلبه عن إدراك دلالة الآيات وزالت منه الأهلية لذلك الفهم الشريف .والأوصاف التي تضمنتها الصلات في الآية تنطبق على مشركي أهل مكة أتَمّ الانطباق .والتكبر الاتصاف بالكبر . وقد صيغ له الصيغة الدالة على التكلف ، وقد بينا ذلك عند قوله تعالى : { أبَى واستكبر } \\[ البقرة : 34 \\] وقوله : { استكْبرتم } في سورة البقرة ( 87 ) ، والمعنى : أنهم يُعْجبَون بأنفسهم ، ويعُدون أنفسهم عظماءَ فلا يأتمرون لآمر ، ولا ينتصحون لناصح .وزيادة قوله : في الأرض } لتفضيح تكبرهم ، والتشهير بهم بأن كبرهم مظروف في الأرض ، أي ليس هو خفياً مقتصراً على أنفسهم ، بل هو مبثوث في الأرض ، أي مبثوث أثره ، فهو تكبر شائع في بقاع الأرض كقوله : { يبغون في الأرض بغير الحق } \\[ يونس : 23 \\] وقوله : { ويفسدون في الأرض أولئك هم الخاسرون } \\[ البقرة : 27 \\] وقوله : { ولا تمش في الأرض مَرحاً } \\[ الإسراء : 37 \\] وقولُ مرة بن عَدّاءَ الفقعسي :فهلاّ أعدوني لِمثلي تفاقَدوا ... وفي الأرْض مبثوثٌ شجاعٌ وعقربوقوله : { بغير الحق } زيادة لتشنيع التكبر بذكر ما هو صفة لازمة له ، وهو مغايرة الحق ، أي : باطل وهي حال لازمة للتكبر ، كاشفة لوصفه ، إذ التكبر لا يكون بحق في جانب الخلق ، وإنما هو وصف لله بحق؛ لأنه العظيم على كل موجود ، وليس تكبر الله بمقصود أن يحترز عنه هنا حتى يجعل القيد { بغير الحق } للاحتراز عنه ، كما في «الكشاف» .ومن المفسرين من حاول جعل قوله : { بغير الحق } قيداً للتكبر ، وجعل من التكبر ما هو حق ، لأن للمحق أن يتكبر على المبطل ، ومنه المقالة الشمهورة «الكِبْر على المتكبر صدقة» وهذه المقالة المستشهد بها جرت على المجاز أو الغلط .وقوله : { وإن يَروا كل آية لا يؤمنوا بها } عطف على قوله : { يتكبرون } فهو في حكم الصلة ، والقول فيه كالقول في قوله : { لا يؤمنون ولو جاءتهم كل آية } في سورة يونس ( 96 ، 97 ) وكل مستعملة في معنى الكثرة ، كما تقدم في قوله تعالى : { ولئن أتيتَ الذين أوتوا الكتاب بكل آية } في سورة البقرة ( 145 ).والسبيل مستعار لوسيلة الشيء بقرينة إضافته إلى الرشد وإلى الغي . والرؤية مستعارة للإدراك .والاتخاذ حقيقته مطاوع أخّذه بالتشديد ، إذا جعله آخذاً ، ثم أطلق على أخذ الشيء ولو لم يعطه إياه غيرُه ، وهوَ هنا مستعار للملازمة ، أي لا يلازمون طريق الرشد ، ويلازمون طريق الغي .والرشد الصلاح وفعل النافع ، وقد تقدم في قوله تعالى : { فإن آنستم منهم رشداً } في سورة النساء ( 6 ) والمراد به هنا : الشيء الصالح كله من الإيمان والأعمال الصالحة .والغي الفساد والضلال ، وهو ضد الرشد بهذا المعنى ، كما أن السفه ضد الرشد بمعنى حسن النظر في المال ، فالمعنى : أن يدركوا الشيءَ الصالح لم يعملوا به . لغلبة الهوى على قلوبهم ، وإن يدركوا الفساد عملوا به لغلبة الهوى ، فالعمل به حمل للنفس على كلفة ، وذلك تأباه الأنفس التي نشأت على متابعة مَرغوبها ، وذلك شأن الناس الذين لم يروّضوا أنفسهم بالهدى الإلهي ، ولا بالحكمة ونصائح الحكماء والعقلاء ، بخلاف الغي ، فإنه ما ظهر في العالم إلاّ من آثار شهوات النفوس ودعواتها التي يزيَن لها الظاهر العاجل ، وتجهل عواقب السوء الآجلة ، كما جاء في الحديث : { حفّت الجنة بالمكاره وُحفّت النار بالشهوات }.والتعبير في الصلات الأربع بالأفعال المضارعة : لإفادة تجدد تلك الأفعال منهم واستمرارهم عليها .وقرأ الجمهور : { الرُشد } بضم فسكون وقرأه حمزة ، والكسائي ، وخلف : بفتحتين ، وهما لغتان فيه .وجملة : { ذلك بأنهم كذبوا بآياتنا } مستأنفة استئنافاً بيانياً ، لأن توسيمهم بتلك الصلات يثير سؤالاً .والمشار إليه بذلك ما تضمنه الكلام السابق ، نُزّل منزلة الموجود في الخارج وهو ما تضمنه قوله : { سأصرف عن آياتي } إلى آخر الآية ، واستعمل له اسم إشارة المفرد؛ لتأويل المشار إليه بالمذكور كقوله تعالى : { والذين لا يدعون مع الله إلهاً آخر ولا يقتلون النفس التي حرم الله إلاّ بالحق ولا يزنون ومن يفعل ذلك يلق أثاماً } \\[ الفرقان : 68 \\] أي من يفعل المذكور ، وهذا الاستعمال كثير في اسم الإشارة ، وألحق به الضمير كما تقدم في قوله تعالى : { ذلك بأنهم كانوا يكفرون بآيات الله } في سورة البقرة ( 61 ).والباء السببية أي : كِبْرُهم . وعدمُ إيمانهم ، واتباعُهم سبيل الغي ، وإعراضُهم عن سبيل الرشد سببه تَكذيبهم بالآيات ، فأفادت الجملة بيان سبب الكبر ، وما عطف عليه من الأوصاف التي هي سبب صرفهم عن الآيات ، فكان ذلك سبب السبب ، وهذا أحسن من إرجاع الإشارة إلى الصرف المأخوذة من { سأصرف } لأن هذا المحمل يجعل التكذيب سبباً ثانياً للصرف ، وجعله سبباً للسبب أرشق .واجتلبت ( أن ) الدالة على المصدرية والتوكيد؛ لتحقيق هذا التسبب وتأكيده ، لأنه محل عرابة .وجعل المسند فعلاً ماضياً ، لإفادة أن وصف التكذيب قديم راسخ فيهم ، فكان رسوخ ذلك فيهم سبباً في أن خُلق الطبعُ والختمُ على قلوبهم فلا يشعرون بنقائصهم ، ولا يصلحون أنفسهم ، فلا يزالون متكبرين معرضين غاوين .ومعنى { كذبوا بآياتنا } إنهم ابتدأوا بالتكذيب ، ولم ينظروا ، ولم يهتموا بالتأمل في الآيات فداموا على الكبر وما معه ، فصرف الله قلوبهم عن الانتفاع بالآيات ، وليس المراد الإخبار بأنهم حصل منهم التكذيب ، لأن ذلك قد علم من قوله : { وإن يروا كل آية لا يؤمنوا بها }.والغفلة انصراف العقل والذهن عن تذكر شيء بقصدٍ أو بغير قصد ، وأكثر استعماله في القرآن فيما كان عن قصد بإعراض وتشاغل ، والمذموم منها ما كان عن قصد ، وهو مناط التكليف والمؤاخذة ، فأما الغفلة عن غير قصد فلا مؤاخذة عليها ، وهي المقصود من قول علماء أصول الفقه : يمتنع تكليف الغافل .وللتنبيه على أن غفلتهم عن قصد صيغ الإخبار عنهم بصيغة { كانوا عنها غافلين } للدلالة على استمرار غفلتهم . وكونها دأباً لهم ، وإنما تكون كذلك إذا كانوا قد التزموها ، فأما لو كانت عن غير قصد . فإنها قد تعتريهم وقد تفارقهم .\n\n",
      "translations": [
        {
          "translation": "173 (I shall turn away from My revelations) from believing in My revelations (those who magnify themselves wrongfully) without any right (in the earth) it is also said that this means: I will show you, Muhammad, the abode of evil-doers: the abode of Badr, and it is said that this is the abode of Mecca, (and if they) i.e. Pharaoh and his folk; it is also said that it refers to Abu Jahl and his folk (see each token believe it not, and if they see the way of righteousness) the way of Islam and goodness (choose it not for (their) way) they would not consider it a way, (and if they see the way of error) the way of disbelief and idolatry (choose it for (their) way) they would consider it a way. (That is because they deny Our revelations) Our Scripture and Messenger (and are used to disregard them) disbelieving in them.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { سَأَصْرِفُ } أي: أميل وأغفل { عَنْ آيَاتِي } الظاهرة في الآفاق والأنفس الدالة على توحيدي واستقلالي في التصرفات الكائنة في الآفاق\n القوم { ٱلَّذِينَ يَتَكَبَّرُونَ } ويمشون خيلاً { فِي ٱلأَرْضِ } ويظلمون فيها { بِغَيْرِ ٱلْحَقِّ } لخبث طينتهم ورداءة فطرتهم { وَ } هم من نهاية جهلهم المركوز في جبلتهم { إِن يَرَوْاْ كُلَّ آيَةٍ } دالة على الصدق والصواب { لاَّ يُؤْمِنُواْ بِهَا } عتواً وعناداً { وَ } بالجلمة { إِن يَرَوْاْ سَبِيلَ ٱلرُّشْدِ } الصدق والصواب { لاَ يَتَّخِذُوهُ سَبِيلاً } لعدم موافقة طباعهم { وَإِن يَرَوْاْ سَبِيلَ ٱلْغَيِّ } والضلال { يَتَّخِذُوهُ سَبِيلاً } لميل نفوسهم نحوه بالطبع\n كل { ذٰلِكَ } أي: الصرف والانحراف والأهواء الباطلة والآراء الفاسدة { بِأَنَّهُمْ } من غاية انهماكهم في الضلال { كَذَّبُواْ بِآيَاتِنَا } الدالة على توحيدنا المنزلة على رسلنا { وَكَانُواْ } من غاية جهلهم { عَنْهَا } وعن الامتثال بها والعمل بمقتضاها والتدبير في معناها { غَافِلِينَ } [الأعراف: 146] غفلة لا تيقظ لهم منها أصلاً\n نبهنا بلطفك عن نومة الغالفين\n\n\n{ وَ } بالجملة: { ٱلَّذِينَ كَذَّبُواْ بِآيَاتِنَا } الظاهرة عن أوصافنا الذاتية في النشأة الأولى { وَلِقَآءِ ٱلآخِرَةِ } أي: كذبوا برجوع الكل إلينا في النشاة الأخرى",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n وذلك التكبر صدر منهم { بغير الحق } أي: تكبروا بما ليس بحق\n وهو دينهم الباطل\n { وإن يروا كل آية } مُنزلةٍ أو معجزة { لا يُؤمنوا بها } لعنادهم\n واختلال نظرهم\n بسبب انهماكهم في الهوى وحب الجاه\n { وإن يَرَوا سبيل الرُّشد }  أي: طريق الصواب والحق { لا يتخذوه سبيلاً } لاستيلاء الشيطان عليهم\n { وإن يَرَوا سبيلَ الغيِّ } أي: الظلال { يتخذوه سبيلاً } أي: يسلكونه ويتبعونه\n لأن سجيتهم الضلال\n { ذلك بأنهم كذبوا بآياتنا وكانوا عنها غافلين } أي: ذلك الصرف بسبب تكذيبهم وعدم تدبرهم الآيات\n\n{ والذين كذَّبوا بآياتنا ولقاءِ الآخرة } أي: وبلقائهم الدار الآخرة\n أو: ما وعد الله في الآخرة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "40:38",
      "similarity": 0.3972315075036967
    },
    {
      "verse": "37:32",
      "similarity": 0.3928368732127811
    },
    {
      "verse": "53:2",
      "similarity": 0.3647322983303594
    },
    {
      "verse": "38:82",
      "similarity": 0.36187141747925644
    },
    {
      "verse": "15:39",
      "similarity": 0.36163193890913553
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007146.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007146.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:146.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}