{
  "chapter": "الأعراف",
  "text": "والذين عملوا۟ السيـات ثم تابوا۟ منۢ بعدها وءامنوا۟ ان ربك منۢ بعدها لغفور رحيم",
  "translations": [
    {
      "translation": "But as for those who do evil actions and then subsequently make tawba and have iman, in that case your Lord is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet those who do wrong, then repent and believe, are forgiven, for your Lord is forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who do evil, and later repent and have faith, such shall find their Lord All-Forgiving, All-Compassionate after (they repent and believe)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those who commit bad deeds, but, then, repent and believe (in God), Your Lord will certainly be All-forgiving and All-merciful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who performed misdeeds and then repented and accepted faith – so after that, your Lord is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who committed evil deeds and then repented afterwards and believed, verily, your Lord after (all) that is indeed Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as to) those who do evil deeds, then repent after that and believe, your Lord after that is most surely Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who do evil deeds, then repent thereafter and believe, surely thereafter thy Lord is All-forgiving, All-compassionate.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who do ill-deeds and afterward repent and believe - lo! for them, afterward, Allah is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who committed evils, and thereafter repented and believed, they shall find your Lord forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who committed evils, and repented thereafter and believed --verily thy Lord is thereafter Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet [to] those who commit misdeeds but repent after that, and believe—indeed, after that, your Lord shall surely be all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who do wrong but repent thereafter and (truly) believe,- verily thy Lord is thereafter Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who committed evil deeds and then repented afterwards and believed, verily, your Lord after (all) that is indeed Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who do evil and later repent and believe, your Lord is Forgiving, the Most Merciful thereafter.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who commit sins, and then repent afterwards and believe—your Lord, thereafter, is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who committed misdeeds and then repented after them and believed - indeed your Lord, thereafter, is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:153] But those who commit evil deeds and repent, desist from them, thereafter and believe, in God — indeed your Lord thereafter, that is, after repentance, is truly Forgiving, Merciful’, towards them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "174 (But those who do ill deeds) while ascribing partners to Allah (and afterward repent) after their idolatry; it is also said that this means: after committing transgressions (and believe) profess Allah's divine Oneness and believe in Allah (lo! for them, afterward) after repentance and accepting faith, (your Lord) Moses; and it is also said: Muhammad (is Forgiving) He overlooks sins, (Merciful).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه { وَٱلَّذِينَ عَمِلُواْ ٱلسَّيِّئَاتِ } قصداً وخطأً { ثُمَّ تَابُواْ } ورجعوا نحونا نادمين { مِن بَعْدِهَا } أي: من بعد توتبهم { وَ } الحال أنه قد كان توبتهم مقرونة بالإيمان بأن { آمَنُوۤاْ } بالله وملائكته وكتبه، ورسله { إِنَّ رَبَّكَ } يا أكمل الرسل { مِن بَعْدِهَا } أي: من بعد ما جاءوا بالتوبة عن ظهر القلب { لَغَفُورٌ } لما صدر عنهم من الذنوب { رَّحِيمٌ } [الأعراف: 153] يقبل توبتهم بعدما وفقتهم بها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم ذكر توبتهم، فقال: { والذين عَمِلُوا السيئات } من الكفر والمعاصي، { ثم تابوا من بعدها } من بعد السيئات { وآمنوا } واشتغلوا بما يقتضيه الإيمان من الأعمال الصالحات، { إنَّ ربك من بعدها } من بعد التوبة { لغفورٌ رحيم } وإن عَظُم الذنب كجريمة عَبَدَة العجل ـ وكَثُر كجرائم بني إسرائيل\n الإشارة: الغضب لله وبالله، والأسف على دين الله، من أمارة الغَيرة على دين الله، لكنَّ صاحب هذا المقام مالك نفسه، يظهر الغلظة ويبطن الرحمة، قيامًا بشهود الحكمة والقدرة، وأما ما صدر من سيدنا موسى ـ عليه السلام ـ فتشريع لأهل التشريع، لئلا يقع التساهل في تغيير المناكر\n\n\nوساق الإمام الهروي هذه الآية في منازل السائرين في باب المراد، وهو المخصوص من ربه بما لم يُرِده هو ولا خطر بباله، والإشارة بذلك إلى الضَّنَائِن الذين وَرَدَ فيهم الخبر:\n\n \" إنَّ للهِ ضَنَائِن من خَلقِه، ألبَسَهُم النُور السَّاطِع، وغذاهُم فِي رَحَمِتِه، وفَعَلَ بِهم وفَعَلَ\n\n\n \" \n\nأورده الإمام أو نعيم في الحلية\n وحاصله: أن المُرادين هم قوم مخصوصون، ملطوف بهم، محمول عنهم، ومنه:\n\n[القَصَص:86] فقد خُص ـ عليه الصلاة والسلام ـ بما لم يخطر على باله قبل النبوة\n قال الهروي: والمراد: ثلاث درجات: الدرجة الأولى: أن يُعصمَ العبد وهو مستشرف للجفا اضطرارًا بتنغيص الشهوات وتعويق الملاذ، وسد مسالك المعاطب عليه، إكرامًا، والدرجة الثانية: أن توضع عن العبد عوارض النقص، ويعافيه من سمة اللائمة، ويملكه عواقب الهفوات، كما فعل لسليمان عليه السلام في قتل الخيل حمله على الريح الرُخاء، فأغناه عن الخيل، وكما فعل لموسى عليه السلام حين ألقى الألواح وأخذ برأس أخيه لم يعتب عليه كما عتب على آدم ونوح وداود ويونس ـ عليهم السلام ـ\n هـ\n قال شارحه الإمام عبد المعطي السكندري: وهذه الدرجة أتم في الحمل على الأعمال وركوب الأهوال، والتلطف في تعليم الإقبال مما قبلها، فإن ما قبلها منعٌ من الشهوات وصيانة عن الآفات جبرًا وقهرًا وحفظًا، وهذا حفظ عنها بإظهار صفح برفق وإكرام ولطف، فتقوى المحبة في القلب، فيحمل ذلك على سرعة الموافقة، ومتى عرف العبد تقصيره في حق مولاه، ورأى مع ذلك تجاوزه عنه، وإحسانه إليه، فضلاً عن ترك مؤاخذته بما جناه، انغرس في قلبه محبته، وقوى بذلك نشاطه، وخفت عليه الأعمال، وقويت منه الأحوال، فكلاهما محفوظ مُعَان، إلا أن الأول قهر مع تعلقه، وهذا إكرام ولطف بعد جريان هفوته، ثم ذكر الدرجة الثالثة، فانظره\n هـ\n بنقل المحشي\n ثم كمَّل القصة، فقال: { وَلَماَّ سَكَتَ عَن مُّوسَى ٱلْغَضَبُ }\n\n",
      "translations": []
    }
  ]
}