{
  "chapter": "الأعراف",
  "text": "الذين يتبعون الرسول النبى الامى الذى يجدونه مكتوبا عندهم فى التورىة والانجيل يامرهم بالمعروف وينهىهم عن المنكر ويحل لهم الطيبت ويحرم عليهم الخبئث ويضع عنهم اصرهم والاغلل التى كانت عليهم فالذين ءامنوا۟ به وعزروه ونصروه واتبعوا۟ النور الذى انزل معه او۟لئك هم المفلحون",
  "translations": [
    {
      "translation": "Who follow the messenger, the gentile Prophet, described in the Torah and the Gospel, who bids things noble and forbids things vile, makes lawful what is clean, and prohibits what is foul, who relieves them of their burdens, and the yoke that lies upon them. Those who believe and honour and help him, and follow the light sent with him, are those who will attain their goal.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[To-day this mercy is for] those who follow the ummi Prophet, whom they find mentioned in the Torah and the Gospel with them. He enjoins upon them what is good and forbids them what is evil. He makes the clean things lawful to them and prohibits all corrupt things, and removes from them their burdens and the shackles that were upon them. So those who believe in him and assist him, and succour him and follow the Light which has been sent down with him, it is they who shall prosper.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There are those who follow the Messengers, the illiterate Prophet (not conventionally educated), whose description they find written in the Torah and the Gospel. [He (the Messengers) enjoins them to do good and forbids them to do all that is unlawful, makes lawful for them all that is pure and unlawful all that is filthy, removes their burdens and the entanglements in which they are involved]. Those who believe in him, honor and help him, and follow the light which is sent down to him, will have everlasting happiness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Those who will obey this Noble Messenger (Prophet Mohammed – peace and blessings be upon him), the Herald of the Hidden who is untutored* (except by Allah), whom they will find mentioned in the Taurat and the Injeel with them; he will command them to do good and forbid them from wrong, and he will make lawful for them the good clean things and prohibit the foul for them, and he will unburden the loads and the neck chains which were upon them; so those who believe in him, and revere** him, and help him, and follow the light which came down with him – it is they who have succeeded.\" (*The Holy Prophet was taught by Allah Himself – see Surah 55 Al-Rahman. **To honour the Holy Prophet – peace and blessings be upon him – is part of faith. To disrespect him is blasphemy.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who follow the Messenger, the Prophet who can neither read nor write whom they find written of with them in the Tawrah and the Injil, -- he commands them to do good; and forbids them from evil; he makes lawful for them the good things, and forbids them from the evil things, he releases them from their heavy burdens and from the fetters that were upon them. So those who believe in him, honor him, help him, and follow the light which has been sent down with him, it is they who will be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who follow the Apostle-Prophet, the Ummi, whom they find written down with them in the Taurat and the Injeel (who) enjoins them good and forbids them evil, and makes lawful to them the good things and makes unlawful to them impure things, and removes from them their burden and the shackles which were upon them; so (as for) those who believe in him and honor him and help him, and follow the light which has been sent down with him, these it is that are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "those who follow the Messenger, 'the Prophet of the common folk, whom they find written down with them in the Torah and the Gospel, bidding them to honour, and forbidding them dishonour, making lawful for them the good things and making unlawful for them the corrupt things, and relieving them of their loads, and the fetters that were upon them. Those who believe in him and succour him and help him, and follow the light that has been sent down with him -- they are the prosperers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who follow the messenger, the Prophet who can neither read nor write, whom they will find described in the Torah and the Gospel (which are) with them. He will enjoin on them that which is right and forbid them that which is wrong. He will make lawful for them all good things and prohibit for them only the foul; and he will relieve them of their burden and the fetters that they used to wear. Then those who believe in him, and honour him, and help him, and follow the light which is sent down with him: they are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Also for those who follow the Messenger, the unlettered prophet they find described in the Torah that is with them, and in the Gospel, who commands them to do right and forbids them to do wrong, who makes good things lawful to them and bad things unlawful, who will relieve them of their burdens and of the shackles that weigh upon them. Those that believe in him and honour him, those that aid him and follow the light sent down with him, shall surely triumph.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who follow the apostle, the unlettered prophet. Whom they find written down with them in the Taurat and the Injil; he biddeth them to the seemly and prohibiteth unto them the unseemly, alloweth unto them things clean and forbiddeth unto them things unclean and relieveth them of their burthen and the shackles which have been upon them. Those who believe in him and side with him and succour him and follow the light which hath been sent down with him; those: they shall fare well.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "—those who follow the Apostle, the untaught prophet, whose mention they find written with them in the Torah and the Evangel, who bids them to do what is right and forbids them from what is wrong, makes lawful to them all the good things and forbids them from all vicious things, and relieves them of their burdens and the shackles that were upon them—those who believe in him, honour him, and help him and follow the light that has been sent down with him, they are the felicitous.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who follow the messenger, the unlettered Prophet, whom they find mentioned in their own (scriptures),- in the law and the Gospel;- for he commands them what is just and forbids them what is evil; he allows them as lawful what is good (and pure) and prohibits them from what is bad (and impure); He releases them from their heavy burdens and from the yokes that are upon them. So it is those who believe in him, honour him, help him, and follow the light which is sent down with him,- it is they who will prosper.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who follow the Messenger, the Prophet who can neither read nor write (i.e. Muhammad SAW) whom they find written with them in the Taurat (Torah) (Deut, xviii, 15) and the Injeel (Gospel) (John xiv, 16), - he commands them for Al-Ma'ruf (i.e. Islamic Monotheism and all that Islam has ordained); and forbids them from Al-Munkar (i.e. disbelief, polytheism of all kinds, and all that Islam has forbidden); he allows them as lawful At-Taiyibat [(i.e. all good and lawful) as regards things, deeds, beliefs, persons, foods, etc.], and prohibits them as unlawful Al-Khaba'ith (i.e. all evil and unlawful as regards things, deeds, beliefs, persons, foods, etc.), he releases them from their heavy burdens (of Allah's Covenant), and from the fetters (bindings) that were upon them. So those who believe in him (Muhammad SAW), honour him, help him, and follow the light (the Quran) which has been sent down with him, it is they who will be successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and to those who shall follow the Messenger the Unlettered Prophet (Muhammad) whom they shall find written with them in the Torah and the Gospel. He will order kindness upon them and forbid them to do evil. He will make good things lawful to them and prohibit all that is foul. He will relieve them of their burdens and of the shackles that weigh upon them. Those who believe in him and honor him, those who aid him and follow the light sent forth with him, shall surely prosper'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who follow the Messenger, the Unlettered Prophet, whom they find mentioned in the Torah and the Gospel in their possession. He directs them to righteousness, and deters them from evil, and allows for them all good things, and prohibits for them wickedness, and unloads the burdens and the shackles that are upon them. Those who believe in him, and respect him, and support him, and follow the light that came down with him—these are the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who follow the Messenger, the unlettered prophet, whom they find written in what they have of the Torah and the Gospel, who enjoins upon them what is right and forbids them what is wrong and makes lawful for them the good things and prohibits for them the evil and relieves them of their burden and the shackles which were upon them. So they who have believed in him, honored him, supported him and followed the light which was sent down with him - it is those who will be the successful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:157] those who follow the Messenger, the uninstructed Prophet, Muhammad (s) whom they will find inscribed in their Torah and Gospel, in name and description, enjoining them to decency and forbidding them indecency, making lawful for them the good things, which were forbidden [to them] by their Law, and making unlawful for them the vile things, such as carrion and the like, and relieving them of their burden, their onus, and the shackles, the hardships, that they used to bear, such as [the requirement] to kill oneself as a repentance and the severing of that part that had come into contact with any impurity. Then those who believe in him, from among them, and honour, revere, him, and help him, and follow the light that has been revealed with him, namely, the Qur’ān, they are the ones who will prosper’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Those who follow the messenger) the religion of the Messenger, (the Prophet who can neither read nor write) i.e. Muhammad (pbuh) (whom they will find) with his traits and description (described in the Torah and the Gospel (which are) with them. He will enjoin on them that which is right) Allah's divine Oneness and moral excellence (and forbid them that which is wrong) disbelief and hurting others. (He will make lawful for them all good things) he explains to them the lawfulness of that which is in the Scripture such as the meat and milk of camels, sheep and others (and prohibit for them only the foul) he explains to them the unlawfulness of what is in the Scripture such as carrion, the meat of swine and other things; (and he will relieve them of their burden) their pledges the breaking of which made good things unlawful for them (and the fetters) the hardships (that they used to wear) such as tearing up their clothes and other things. (Then those who believe in him) in Muhammad (pbuh) i.e. 'Abdullah Ibn Salam and his followers, (and honour him) and assist him (and help him) with the sword, (and follow the light) the Qur'an (which is sent down with him) which was sent with Gabriel: that which is lawful, they declared lawful, and that which unlawful, they declared unlawful: (they are the successful) who are saved from Allah's wrath and torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوهم: { ٱلَّذِينَ يَتَّبِعُونَ ٱلرَّسُولَ } المرسل بالتوحيد الذاتي { ٱلنَّبِيَّ } المتمم لمكارم الأخلاق { ٱلأُمِّيَّ } المتحقق، المخصوص بالعلم اللدني الملقاة له من ربه بلا واسطة كسب وتعيم من معلم، وهو { ٱلَّذِي يَجِدُونَهُ } أي: جميع أهل الكتاب { مَكْتُوباً } في كتبهم بعثته ودينه، واسمه وحليته وجميع أوصافه ثابتاً { عِندَهُمْ فِي ٱلتَّوْرَاةِ وَٱلإِنْجِيلِ } بأنه إذا بعث { يَأْمُرُهُم بِٱلْمَعْرُوفِ وَيَنْهَاهُمْ عَنِ ٱلْمُنْكَرِ وَيُحِلُّ لَهُمُ ٱلطَّيِّبَاتِ } التي يحرمونها على نفوسهم { وَيُحَرِّمُ عَلَيْهِمُ ٱلْخَبَآئِثَ } التي يحللونها\n\n\n\n\n{ وَ } أيضاً { يَضَعُ عَنْهُمْ إِصْرَهُمْ } أي: ثقلهم الذي يترهبون ويتزهدون فيه فوق طاقتهم كقطع الأعضاء والجوارح التي يخطئون بها، وقطع موضع النجاسة من الثباب وغير ذلك { وَ } يضع أيضاَ { ٱلأَغْلاَلَ } أي: التكاليف الشاقة { ٱلَّتِي كَانَتْ عَلَيْهِمْ فَٱلَّذِينَ آمَنُواْ بِهِ } حين ظهوره ودعوته { وَعَزَّرُوهُ } أي: وقروه حق توقيره وتعظيمة { وَنَصَرُوهُ } تقويةً لدينه { وَٱتَّبَعُواْ ٱلنُّورَ } أي: القرآن { ٱلَّذِيۤ أُنزِلَ مَعَهُ } من عند الله تأييداً له وتصديقاً { أُوْلَـٰئِكَ } السعداء المقبلون عند الله، الموفقون من عنده باتباعه { هُمُ ٱلْمُفْلِحُونَ } [الأعراف: 157] المقصرون من عنده على الفلاح والفوز بالنجاح\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { الذين يتبعون الرسول } صلى الله عليه وسلم { النبي الأميَّ } وهو نبينا ومولانا محمد صلى الله عليه وسلم، وكونه أُميًّا شرفٌ له، إذ الكتابة وسيلة للعلوم، وقد أُعطي منها ما لم يُعطَ أحَدٌ من العالمين، من غير تعب تعلمها، ولارتفاع الارتياب في نبوته صلى الله عليه وسلم، فهي من جملة معجزاته قال تعالى:\n\n\n\n[العَنكبوت:48] الآية\n قال بعضهم: لما قال الله تعالى: { ورحمتي وسعت كل شيء } طمع فيها كل أحد، حتى إبليس، فلما قال: { فسأكتبها للذين يتقون } يئس إبليس، وبقيت اليهود والنصارى، فلما قال: { الذين يتبعون الرسول النبي الأميّ } يئس اليهود والنصارى\n هـ\n { الذي يجدونه مكتوبًا عندهم في التوراة والإنجيل } اسمًا وصفة، ونص ما في التوراة على ما في صحيح البخاري، عن عبد الله بن سلام:\n\n \" يا أيُّهَا النَبِيُّ إنَّا أرسلَنَاكَ شَاهِدًا ومُبَشَّرًا ونَذِيرًا، وحِرزًا للأمِّيينَ، أنتَ عَبدِي ورَسُولِي، سَمَّيتُكَ المُتَوكلَ، لِيسَ بفظٍ ولا غليظ ولا صَخَّابِ في الأسوَاقُ، ولا يُجَازِي بالسَّيِّئةَ السَّيِّئة، ولكِن يَعَفُو ويَصفَحُ، ولَن يَقبِضَهُ الله حَتَّى يُقِيمَ بِهِ المِلَّةَ العَوجاءَ بِأن يَقُولُوا: لا إله إلاَّ الله، فَيفَتَح بِها أعيُنًا عُميًا، وآذانًا صُمًّا، وقُلُوبًا غُلفًا \"\n \n\nومما في التوراة أيضًا، وهو مما أجمع عليه أهل الكتاب، وهو باق في أيديهم إلى الآن أن الملك قد نزل على إبراهيم، فقال له: في هذا العام يولد لك غلام اسمه إسحاق، فقال إبراهيم: يا رب ليت إسماعيل يعيش يخدمك، فقال الله لإبراهيم: ذلك لك، قد استجيب لك في إسماعيل، وأنا أباركه، وأنميه، وأكثره، وأعظمه بما ذماذ، وتفسيره: محمد صلى الله عليه وسلم\n ومن ذلك مما في التوراة أيضًا: أن الرب ـ تعالى ـ جاء من طور سيناء، وطلع على \" ساغين \" ، وظهر من جبل فاران، ويعني طور سيناء: موضع مناجاة موسى، وساغين موضع عيسى، وفاران هي مكة، موضع مولد نبينا محمد صلى الله عليه وسلم، وفي التوراة أيضًا: أن هاجر أم إسماعيل لما غضبت عليها سارة، تراءى لها ملكٌ، فقال لها: يا هاجر، أين تريدين، ومن أين أقبلتِ؟ فقالت: أهرب من سيدتي سارة، فقال لها: يا هاجر، ارجعي إلى سارة، وستحملين وتلدين ولدًا اسمه إسماعيل، وهو يكون عَين الناس، وتكون يده فوق الجميع، وتكون يد الجميع مبسوطة إليه بالخضوع\n هـ\n وهذا الذي وعدها الملك إنما ظهر بمبعث النبي صلى الله عليه وسلم وظهور دينه وعلو مكانه، ولم يكن ذلك لإسماعيل ولا لغيره من أولاده، لكن الأصل يشرف بشرف فرعه، وفي التوراة أيضًا: أن الله أوحى إلى إبراهيم عليه السلام: قد أجبت دعاءك في إسماعيل، وباركت عليه، وسيلد اثني عشر عظيمًا، وأجعله لأمة عظيمة\n وفي بعض كتبهم: لقد تقطعت السماء من بهاء مُحمدٍ المحمود، وامتلأت الأرض من حمده، لأنه ظهر بخلاص أمته\n هـ\n ونص ما في الإنجيل: أن المسيح قال للحواريين: إني ذاهب عنكم، وسيأتيكم الفارقَليط، الذي لا يتكلم من قِبل نفسه، إنما يقول كما يقال له\n هـ\n والفارقليط بالعبرانية: اسم محمد صلى الله عليه وسلم، وقيل معناه: الشافع المشفع\n\n\nوعن شَهر بن حَوشبٍ ـ في قصة إسلام كعب الأحبار، وهو من اليمن من حميرـ: أن كعبًا أخبره بأمره، وكيف كان ذلك، وكان أبوه من مؤمني أهل التوراة برسول الله صلى الله عليه وسلم، قبل ظهوره، قال كعب: وكان أبي من أعلم الناس بالتوراة وكُتب الأنبياء، ولم يكن يدخر عني شيئًا مما كان يعلم، فلما حضرته الوفاة دعاني فقال: يا بني، قد علمتَ أني لم أكن أدخر عنك شيئًا مما كنتُ أعلم، إلا أني حَبَستُ عنك ورقتين فيهما ذكر نبي يُبعث، وقد أطل زمانه، فكرهت أن أخبرك بذلك، فلا آمن عليك بعد وفاتي أن يخرج بعض هؤلاء الكاذبين فتتبعه، وقد قطعتهما من كتابي، وجعلتهما في هذه الكوة التي ترى، وطينت عليهما، فلا تتعرض لهما حتى يخرج هذا النبي، فإذا خرج فاتبعه وانظر فيهما، فإن الله تعالى يزيدك بهذا خيرًا، فلما مات والدي لم يكن شيء أحب إليّ من أن ينقضي المأتم حتى أنظر ما في الورقتين، فإذا فيهما:\n\n \" محمد رسول الله صلى الله عليه وسلم، خاتم النبيين لا نبي بعده، مولده بمكة، ومهاجره طيبة، ليس بفظ ولا غليظ ولا صخاب في الأسواق، ولا يجزي بالسيئة السيئة، ولكن يجزي بالسيئة الحسنة، ويعفو ويغفر ويصفح، أمته الحمَّادون، الذين يحمدون الله على كل شرف وعلى كل حال، وتُذلل ألسنتهم بالتكبير، وينصر الله نبيهم على كل من ناوأه، يغسلون فروجهم بالماء، ويتأزرون على أوساطهم، وأنَاجِيلُهُم في صدورهم، ويأكلون قربانهم في بطونهم، ويؤجرون عليها، وتراحمهم بينهم تراحم بني الأم والأب، وهم أول من يدخل الجنة يوم القيامة من الأمم، وهم السابقون المقربون، والشافعون المشفع فيهم \" \n\nثم أسلم على يد عمر بن الخطاب رضي الله عنه\n يقول الحقّ جلّ جلاله: في بقية أوصاف نبينا ـ عليه الصلاة والسلام ـ: { يأمرهم بالمعروف وينهاهم عن المنكر ويُحِلُّ لهم الطيبات } مما حرم على اليهود كالشحوم وغيرها، { ويُحرَّم عليهم الخبائث } كالدم والحم الخنزير وسائر الخبائث، أو كالربا والرشوة وغيرهما من المحرمات\n قال ابن جزي: مذهب مالك أن الطيبات هي الحلال، وأن الخبائث هي الحرام\n ومذهب الشافعي: أن الطيبات هي المستلذات، إلا ما حرمه الشرع منها، كالخمر والخنزير، وأن الخبائث هي المستقذرات كالخنافس والعقارب\n هـ\n { ويضعُ عنهم إصرَهم } أي: الثقل الذي عليهم، وهو مثال لما كُلفوا به ـ أي: بنو إسرائيل ـ في شرعهم من المشقات كقتل الأنفس في التوبة، وقطع موضع النجاسة من الثوب، وتعيين القصاص في العمد والخطأ\n { والأغلآل التي كانت عليهم } عبارة عما منعت منه شريعتهم، كتحريم الشحوم، وتحريم العمل يوم السبت وشبه ذلك\n { فالذين آمنوا به وعزّرُوه } أي: منعوه وحفظوه من عدوه، حتى لا يقوى عليه، أو عظموه بالتقوية حتى انتصر، وأصله: المنع، ومنه التعزير، { ونصروه } حتى أظهروا دينه في حياته وبعد مماته، { واتبعوا النورَ الذي أُنزل معه } وهو القرآن، وإنما سماه نورًا لأنه بإعجازه ظاهر أمره ومظهر غيره، أو لأنه كاشف للحقائق مظهر لها\n\n\n{ أولئك هم المفلحون } الفائزون بالرحمة الأبدية، وهذا آخر جواب سيدنا موسى عليه السلام\n الإشارة: قوله تعالى { ورحمتي وسعت كل شيء } ، قال القشيري: لم يُعَلَّقها بالمشيئة ـ يعني: كما قال في العذاب ـ لأنها نفس المشيئة، ولأنها قديمة، والإرادة لا تتعلق بالقديم، فلمَّا كان العذاب من صفات الفعل علَّقه بالمشيئة، بعكس الرحمة لأنها من صفات الذات\n ويقال في قوله تعالى: { وسعت كل شيء }: مجالٌ لآمال العُصَاة لأنهم، وإن لم يكونوا من جملة المطيعين العابدين والعارفين، فهم \" شيء \"\n هـ\n قلت: وبهذا العموم تشبث إبليس في قضية له مع سهل، وذلك أنه لما تراءى له، ضحك، فقال له: كيف تضحك وقد أبلست من رحمة الله؟ فقال له: قال تعالى: { ورحمتي وسعت كل شيء } وأنا شيء فسكت سهل، ثم تذكر تمام الآية، فقال: قال تعالى: { فسأكتبها للذين يتقون } ، فهي مُقيدة لا مطلقة، فقال له: التقوى فعل العبد، والرحمة صفة الرب، ولا يتغير وصف الحق بفعل العبد، فعجز سهل\n قلت: والجواب: أن إبليس جاء من جهة الفرق، ولو نظر للجمع لوجد الرحمة وصفه، والتقوى فعله، وفعله يغير وصفه، والكل منه وإليه\n والله تعالى أعلم\n وقال الورتجبي: جميع الخلائق مستغرقون في بحر الرحمة، لأن إيجاد الحق إياهم، على أي: وصف كانوا، عين رحمته، حيث دخلوا تحت نظره وسلطانه وربوبيته، ومباشرة قدرته فيهم، ثم إن الخلق بالتفاوت في الرحمة فالجمادات مستغرقة في نور فعله، وهي الرحمة الفعلية، والحيوانات مستغرفة في نور صفاته، وهي الرحمة الصفاتية، والعقلاء من الجن والإنس والملائكة مستغرقون في نور ذاته، وهي الرحمة القديمة الذاتية من جهة تعريفهم ربوبيته ووحدانيته، وهم من جهة الأجسام وما يجري عليها، في الرحمة العامة، ومن جهة الأرواح وما يجري عليها، في الرحمة الخاصة، وهم فيها بالتفاوت، فبعضهم في رؤية العظمة ذابوا، وبعضهم في رؤية القدم والبقاء تاهوا، وبعضهم في رؤية الجلال والجمال عشقوا وطاشوا، ومن خرج من مقام الرحمة إلى أصل الصفة، ومن الصفة إلى أصل الذات استغرق في الراحم، وفنى عن الرحمة، فصار رحمة للعالمين، وهذا وصف نبينا ـ عليه الصلاة والسلام ـ، لأنه وصل بالكل إلى الكل، فوصفه برحمة الكل بقوله:\n\n[الأنبيَاء:107]، ثم خص رحمته الخاصة الصفاتية، بعد أن عم الكل برحمته العامة للمنفردين بالله عن غير الله، القانتين بعظمته في عظمة الذين بذلوا وجوههم لحق ربوبيته عليهم بقوله: { فسأكتبها للذين يتقون\n\n\n }\n هـ\n قال في الحاشية: واعتبر قوله: { فسأكتبها } ، فإنه يقتضي كون الرحمة السابقة مطلقة، والتغيير طارىء، والطارىء لا ينافي الذات\n\n\nهـ\n قلت: فتكون على هذا الرحمة التي وسعت كل شيء رحمة عامة، إذ لا يخلو مخلوق من رحمته في الدنيا والآخرة، أما في الدنيا فالخلق كلهم مرحومون إيجادًا وإمدادًا، وأما في الآخرة فما من عذاب إلا والله أشد منه في قدرته، والرحمة التي كتبت للمتقين رحمة خاصة، ويدل على هذا ما في القوت على قوله: { فسأكتبها للذين يتقون } ، قال: معناه خصوص الرحمة وصفوها لا كلها، إذ لا نهاية للرحمة، لأنها صفة الراحم الذي لا حد له، ولأنه لم يخرج من رحمته شيء، كما لم يخرج من حكمته وقدرته شيء\n هـ\n وقال السيوطي: فسأكتبها في الآخرة، ووجه تخصيصها في الآخرة بالمؤمنين: تمحضها هنالك من غير شوب بضد، ولا كذلك في الدنيا، وإن كانت غالبة، والكافر عمته في الدنيا عمومًا ظاهرًا، وسلب منها في الآخرة بحسب الظاهر، وإن لم يخل عنها في الجملة، لأن عضبه تعالى لا حدّ له لولا رحمته\n وحاصله: أنه لم تفي جهنم بغضبه، لأنه لا يفي المتناهي بغير المتناهي ورحمته عمت الكافر في الدنيا لإمهاله وبسط نعمه عليه، وفي الإمهال فسحة في الحال وأمل الإقلاع في المآل، وقد يتفق كثيرًا، أي: الإقلاع، فلا يتعين أن يكون الإمهال استدراجًا، على أنه إنما يتجلى تجليًا أوليًا ذاتيًا برحمة مطلقة من غير تفصيل، إذ لا تعدد في الذات، وإنما يظهر التفصيل بالصفات، وإن كان يسري إليها من الذات، ولكن الرحمة تظهر أولاً من الذات، مع قطع النظر عن الصفات لظهورها، ولا تظهر النقمة إلا من الصفات، وهي خفية في تجلي الذات المطلق، ولذلك قال: { ورحمتي وسعت كل شيء } ، وعلق العذاب على المشيئة، فخص به دونها\n هـ\n من الحاشية مع زيادة بيان\n ثم أمره بالدعاء إلى الإيمان، فقال: { قُلْ يٰأَيُّهَا ٱلنَّاسُ إِنِّي رَسُولُ ٱللَّهِ إِلَيْكُمْ جَمِيعاً }\n\n",
      "translations": []
    }
  ]
}