{
  "chapter": "الأعراف",
  "text": "واكتب لنا فى هذه الدنيا حسنة وفى الءاخرة انا هدنا اليك قال عذابى اصيب به من اشاء ورحمتى وسعت كل شىء فساكتبها للذين يتقون ويؤتون الزكوة والذين هم بـايتنا يؤمنون",
  "translations": [
    {
      "translation": "Prescribe good for us in this world and the Next World. We have truly turned to You.' He said, 'As for My punishment, I strike with it anyone I will. My mercy extends to all things but I will prescribe it for those who have taqwa and pay zakat, and those who believe in Our Signs:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enjoin for us good in the world, and good in the world to come. We turn to You alone.\" And the Lord said: \"I punish only those whom I will, but My mercy enfolds everything. I shall enjoin it for those who take heed for themselves, who pay the zakat and believe in My signs,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ordain for us what is good in this world and in the World to Come for to You have we turned.'He replied: 'I afflict whomsoever I wish with My chastisement. As for My mercy, it encompasses everything. will show mercy to those who abstain from evil, pay Zakat and have faith in Our signs.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Grant us well-being in this life and in the life hereafter for we have turned ourselves to You.\" The Lord replied, \"My torment only afflicts those whom I want to punish, but My mercy encompasses all things. I shall grant mercy to those who maintain piety, pay their religious tax, and those who have faith in Our revelations.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And destine good for us in this world and in the Hereafter – We have indeed inclined towards You”; He said, “I give My punishment to whomever I will; and My mercy encompasses all things; so I shall soon destine favours for those who fear and pay the charity, and they believe in Our signs.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ordain for us good in this world, and in the Hereafter. Certainly we have Hudna unto You.\" He said: (As to) My punishment I afflict therewith whom I will and My mercy embraces all things. That (mercy) I shall ordain for those who have Taqwa, and give Zakah; and those who believe in Our Ayat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ordain for us good in this world's life and in the hereafter, for surely we turn to Thee. He said: (As for) My chastisement, I will afflict with it whom I please, and My mercy encompasses all things; so I will ordain it (specially) for those who guard (against evil) and pay the poor-rate, and those who believe in Our communications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And prescribe for us in this world good, and in the world to come; we have repented unto Thee.' Said He, 'My chastisement -- I smite with it whom I will; and My mercy embraces all things, and I shall prescribe it for those who are godfearing and pay the alms, and those who indeed believe in Our signs,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ordain for us in this world that which is good, and in the Hereafter (that which is good), Lo! We have turned unto Thee. He said: I smite with My punishment whom I will, and My mercy embraceth all things, therefore I shall ordain it for those who ward off (evil) and pay the poor-due, and those who believe Our revelations;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Grant us good things, both in this life and in the hereafter. To You alone we turn.\" He replied, \"As for My punishment, I smite with it anyone I will. But My mercy encompasses all things. I shall prescribe it for those who do their duty, pay the zakat and who believe in Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ordain for us good in the world and in the Hereafter; verily we have been guided unto Thee. Allah said: as to My chastisement, therewith afflict whomsoever I Will and as to My mercy, it comprehendeth everything. Wherefore I shall ordain it for those who fear an give poor- rate and those who believe in Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And appoint goodness for us in this world and the Hereafter, for indeed we have come back to You.’ Said He, ‘I visit My punishment on whomever I wish, but My mercy embraces all things. Soon I shall appoint it for those who are Godwary and give the zakat and those who believe in Our signs\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ordain for us that which is good, in this life and in the Hereafter: for we have turned unto Thee.\" He said: \"With My punishment I visit whom I will; but My mercy extendeth to all things. That (mercy) I shall ordain for those who do right, and practise regular charity, and those who believe in Our signs;-\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ordain for us good in this world, and in the Hereafter. Certainly we have turned unto You.\" He said: (As to) My Punishment I afflict therewith whom I will and My Mercy embraces all things. That (Mercy) I shall ordain for those who are the Muttaqun (pious - see V. 2:2), and give Zakat; and those who believe in Our Ayat (proofs, evidences, verses, lessons, signs and revelations, etc.);\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Write for us what is good in this life and in the Everlasting Life. To You alone we turn' He replied: 'I will smite with My punishment whom I will; yet My Mercy embraces all things. I will write it (My Mercy) to those who are cautious, give the obligatory charity, and believe in Our verses;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“And inscribe for us goodness in this world, and in the Hereafter. We have turned to You.” He said, “My punishment—I inflict it upon whomever I will, but My mercy encompasses all things. I will specify it for those who act righteously and practice regular charity, and those who believe in Our signs.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And decree for us in this world [that which is] good and [also] in the Hereafter; indeed, we have turned back to You.\" [Allah] said, \"My punishment - I afflict with it whom I will, but My mercy encompasses all things.\" So I will decree it [especially] for those who fear Me and give zakah and those who believe in Our verses -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:156] And prescribe for us, grant [us], in this world good and in the Hereafter, good. We have turned, repented, to You’. He, God, says: ‘My chastisement — I smite with it whom I will, to chastise, and My mercy embraces, subsumes, all things, in this world, and so I shall prescribe it, in the Hereafter, for those who are Godfearing and pay the alms, and those who believe in Our signs;\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And ordain for us in this world that which is good) knowledge, worship and protection from sins, (and in the Hereafter (that which is good)) the good of Paradise and its bliss, (Lo! We have turned unto Thee) we have repented to You; it is also said this means: we are betaking ourselves to You. (He) Allah (said: I smite with) I single out with (My punishment whom I will, and My mercy embraceth all things) whether the person is righteous or sinner. Iblis seized this opportunity and said: \"I am of the things\", but Allah excluded him from this by saying: (therefore I shall ordain it for those who ward off (evil)) disbelief, idolatry and indecencies (and pay the poor-due) and give from their wealth what is due to the poor, (and those who believe Our revelations) believe in Our Scripture and Messenger. The people of the Book seized this opportunity and said: \"we are the people of God-fearingness and Scripture\", but Allah excluded them from this and explained to whom this mercy is ordained, saying:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّا هُدْنَـآ إِلَيْكَ } معناهُ تُبنَا إِليكَ\n\n\n\n\nوقوله تعالى: { وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ } [معناهُ] فِي الدّنيا البِرُّ والفَاجِرُ\n وفي الآخرةِ المتقون خاصة\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Indeed, We have guided you,\" means that We have chosen you.\n\n\nAnd His mercy encompasses all things. This refers to both the good and the evil in the world.\n\n\nAnd in the Hereafter, the righteous will have a special status.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱكْتُبْ لَنَا } يا ربنا { فِي هَـٰذِهِ ٱلدُّنْيَا حَسَنَةً } لا توقعنا في فتنتك { وَفِي ٱلآخِرَةِ } أيضاً حسنة توصلنا إلى رزق توحيدك { إِنَّا } بعدما تحققنا بعلو شأنك وسمو برهانك { هُدْنَـآ } أي: تبنا ورجعنا { إِلَيْكَ } من أن نسأل منك ما ليس لنا علم به\n سيما بعدما يتعلق بذاتك { قَالَ } سبحانه منفرداً برداء العظمة والكبرياء: { عَذَابِيۤ } ونكالي { أُصِيبُ بِهِ مَنْ أَشَآءُ } من عصاة عبادي { وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ } من المطيعين والعاصين وغيرهم { فَسَأَكْتُبُهَا } وأثبتها حتماً { لِلَّذِينَ يَتَّقُونَ } عن المحارم مطلقاً\n طلباً لمرضاتي { وَيُؤْتُونَ ٱلزَّكَـاةَ } تطهيراً لنفوسهم عن الشح المطاع\n الموجب للقسوة والغفلة { وَٱلَّذِينَ هُم بِآيَاتِنَا } أي: بجميعها { يُؤْمِنُونَ } [الأعراف: 156] يوقونون ويمتثلون بمقتضاها\n\n\nوهم: { ٱلَّذِينَ يَتَّبِعُونَ ٱلرَّسُولَ } المرسل بالتوحيد الذاتي { ٱلنَّبِيَّ } المتمم لمكارم الأخلاق { ٱلأُمِّيَّ } المتحقق\n المخصوص بالعلم اللدني الملقاة له من ربه بلا واسطة كسب وتعيم من معلم\n وهو { ٱلَّذِي يَجِدُونَهُ } أي: جميع أهل الكتاب { مَكْتُوباً } في كتبهم بعثته ودينه\n واسمه وحليته وجميع أوصافه ثابتاً { عِندَهُمْ فِي ٱلتَّوْرَاةِ وَٱلإِنْجِيلِ } بأنه إذا بعث { يَأْمُرُهُم بِٱلْمَعْرُوفِ وَيَنْهَاهُمْ عَنِ ٱلْمُنْكَرِ وَيُحِلُّ لَهُمُ ٱلطَّيِّبَاتِ } التي يحرمونها على نفوسهم { وَيُحَرِّمُ عَلَيْهِمُ ٱلْخَبَآئِثَ } التي يحللونها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إنا هُدنا إليك } أي: تبنا إليك\n من هادَ يهود: إذا رجع\n أي: رجعنا إليك بالتوبة مما سلف منا\n\nالإشارة: السلامة من العطب هو في مقام الهيبة والأدب\n ولذلك قيل: قف بالبساط\n وإياك والانبساط\n وأما مقام الإدلال فلا يصح إلا من أكابر الأنبياء\n والأولياء المحققين بمقام المحبوبية\n المتحَفين بغاية الخصوصية\n ومنه قول سيدنا موسى عليه السلام: { أتهلكنا بما فعل السفهاء منا } \n كما قال في الإحياء\n والإدلال: هو انبساط يثور من مقام الأنس والتحقق بالمحبة الخاصة\n ولا يتفق إلا من محبوب مأخوذ عنه\n ليس عليه بغية من نفسه\n ولا شعور بوجوده وأنانيته\n وإلا ردّ في وجهه وكان سبب عطبه\n ومن الإدلال: ما وقع لأبي الحسن الشاذلي رضي الله عنه في حزبه الكبير\n من قوله: وليس من الكرم إلا تحسن إلا لمن أحسن إليك\n\n\nالخ\n وقد وقع لغيره من المحبوبين\n والله تعالى أعلم\n ثم أجاب الحق ـ سبحانه وتعالى ـ سؤال موسى عليه السلام في قوله: { واكتب لنا في هذه الدنيا حسنة } فقال: {\n\n\nقَالَ عَذَابِيۤ أُصِيبُ بِهِ مَنْ أَشَآءُ وَرَحْمَتِي وَسِعَتْ كُلَّ شَيْءٍ فَسَأَكْتُبُهَا لِلَّذِينَ يَتَّقُونَ وَيُؤْتُونَ ٱلزَّكَـاةَ وَٱلَّذِينَ هُم بِآيَاتِنَا يُؤْمِنُونَ ٱلَّذِينَ يَتَّبِعُونَ ٱلرَّسُولَ ٱلنَّبِيَّ ٱلأُمِّيَّ ٱلَّذِي يَجِدُونَهُ مَكْتُوباً عِندَهُمْ فِي ٱلتَّوْرَاةِ وَٱلإِنْجِيلِ يَأْمُرُهُم بِٱلْمَعْرُوفِ وَيَنْهَاهُمْ عَنِ ٱلْمُنْكَرِ وَيُحِلُّ لَهُمُ ٱلطَّيِّبَاتِ وَيُحَرِّمُ عَلَيْهِمُ ٱلْخَبَآئِثَ وَيَضَعُ عَنْهُمْ إِصْرَهُمْ وَٱلأَغْلاَلَ ٱلَّتِي كَانَتْ عَلَيْهِمْ فَٱلَّذِينَ آمَنُواْ بِهِ وَعَزَّرُوهُ وَنَصَرُوهُ وَٱتَّبَعُواْ ٱلنُّورَ ٱلَّذِيۤ أُنزِلَ مَعَهُ أُوْلَـٰئِكَ هُمُ ٱلْمُفْلِحُونَ }  يقول الحقّ جلّ جلاله: في جواب سيدنا موسى عليه السلام: { قال عذابي أُصيب به من أشاءُ } ممن أخذّته الرجفة وغيرهم\n { ورحمتي وَسِعت كلَّ شيء } في الدنيا للمؤمنين والكافرين\n وفي الآخرة مخصوصة بالمؤمنين\n { فسأكتبها } كتابة خاصة لا تليق بكم يا بني إسرائيل\n إنما تليق بالأمة المحمدية الموسومة بالآداب المرضية\n الذين { يتقون } الكفر والمعاصي\n وإن وقعت هفوة بادروا إلى التوبة\n { ويُؤتون الزكاة } \n خصصها بالذكر لأنها كانت أشق عليهم\n { والذين هم بآياتنا يؤمنون } فلا يكفرون بشيء منها\n بل يؤمنون بجميع الكتب والأنبياء\n وليس ذلك لغيرهم\n ولذلك خصهم الله بهذه الرحمة فَنَصرَهم على جميع الأمم\n وأعلى دينهم على جميع الأديان\n ومكّن لهم ما لم يمكن لغيرهم\n { الذين يتبعون الرسول } صلى الله عليه وسلم { النبي الأميَّ } وهو نبينا ومولانا محمد صلى الله عليه وسلم\n وكونه أُميًّا شرفٌ له\n إذ الكتابة وسيلة للعلوم\n وقد أُعطي منها ما لم يُعطَ أحَدٌ من العالمين\n من غير تعب تعلمها\n ولارتفاع الارتياب في نبوته صلى الله عليه وسلم\n فهي من جملة معجزاته قال تعالى:\n\n[العَنكبوت:48] الآية\n قال بعضهم: لما قال الله تعالى: { ورحمتي وسعت كل شيء } طمع فيها كل أحد\n حتى إبليس\n فلما قال: { فسأكتبها للذين يتقون } يئس إبليس\n وبقيت اليهود والنصارى\n فلما قال: { الذين يتبعون الرسول النبي الأميّ } يئس اليهود والنصارى\n هـ\n { الذي يجدونه مكتوبًا عندهم في التوراة والإنجيل } اسمًا وصفة\n ونص ما في التوراة على ما في صحيح البخاري\n عن عبد الله بن سلام:\n \" يا أيُّهَا النَبِيُّ إنَّا أرسلَنَاكَ شَاهِدًا ومُبَشَّرًا ونَذِيرًا\n وحِرزًا للأمِّيينَ\n أنتَ عَبدِي ورَسُولِي\n سَمَّيتُكَ المُتَوكلَ\n لِيسَ بفظٍ ولا غليظ ولا صَخَّابِ في الأسوَاقُ\n ولا يُجَازِي بالسَّيِّئةَ السَّيِّئة\n ولكِن يَعَفُو ويَصفَحُ\n ولَن يَقبِضَهُ الله حَتَّى يُقِيمَ بِهِ المِلَّةَ العَوجاءَ بِأن يَقُولُوا: لا إله إلاَّ الله\n فَيفَتَح بِها أعيُنًا عُميًا\n وآذانًا صُمًّا\n وقُلُوبًا غُلفًا \"\n \nومما في التوراة أيضًا\n وهو مما أجمع عليه أهل الكتاب\n وهو باق في أيديهم إلى الآن أن الملك قد نزل على إبراهيم\n فقال له: في هذا العام يولد لك غلام اسمه إسحاق\n فقال إبراهيم: يا رب ليت إسماعيل يعيش يخدمك\n فقال الله لإبراهيم: ذلك لك\n قد استجيب لك في إسماعيل\n وأنا أباركه\n وأنميه\n وأكثره\n وأعظمه بما ذماذ\n وتفسيره: محمد صلى الله عليه وسلم\n ومن ذلك مما في التوراة أيضًا: أن الرب ـ تعالى ـ جاء من طور سيناء\n وطلع على \" ساغين \" \n وظهر من جبل فاران\n ويعني طور سيناء: موضع مناجاة موسى\n وساغين موضع عيسى\n وفاران هي مكة\n موضع مولد نبينا محمد صلى الله عليه وسلم\n وفي التوراة أيضًا: أن هاجر أم إسماعيل لما غضبت عليها سارة\n تراءى لها ملكٌ\n فقال لها: يا هاجر\n أين تريدين\n ومن أين أقبلتِ؟ فقالت: أهرب من سيدتي سارة\n فقال لها: يا هاجر\n ارجعي إلى سارة\n وستحملين وتلدين ولدًا اسمه إسماعيل\n وهو يكون عَين الناس\n وتكون يده فوق الجميع\n وتكون يد الجميع مبسوطة إليه بالخضوع\n هـ\n وهذا الذي وعدها الملك إنما ظهر بمبعث النبي صلى الله عليه وسلم وظهور دينه وعلو مكانه\n ولم يكن ذلك لإسماعيل ولا لغيره من أولاده\n لكن الأصل يشرف بشرف فرعه\n وفي التوراة أيضًا: أن الله أوحى إلى إبراهيم عليه السلام: قد أجبت دعاءك في إسماعيل\n وباركت عليه\n وسيلد اثني عشر عظيمًا\n وأجعله لأمة عظيمة\n وفي بعض كتبهم: لقد تقطعت السماء من بهاء مُحمدٍ المحمود\n وامتلأت الأرض من حمده\n لأنه ظهر بخلاص أمته\n هـ\n ونص ما في الإنجيل: أن المسيح قال للحواريين: إني ذاهب عنكم\n وسيأتيكم الفارقَليط\n الذي لا يتكلم من قِبل نفسه\n إنما يقول كما يقال له\n هـ\n والفارقليط بالعبرانية: اسم محمد صلى الله عليه وسلم\n وقيل معناه: الشافع المشفع\n\nوعن شَهر بن حَوشبٍ ـ في قصة إسلام كعب الأحبار\n وهو من اليمن من حميرـ: أن كعبًا أخبره بأمره\n وكيف كان ذلك\n وكان أبوه من مؤمني أهل التوراة برسول الله صلى الله عليه وسلم\n قبل ظهوره\n قال كعب: وكان أبي من أعلم الناس بالتوراة وكُتب الأنبياء\n ولم يكن يدخر عني شيئًا مما كان يعلم\n فلما حضرته الوفاة دعاني فقال: يا بني\n قد علمتَ أني لم أكن أدخر عنك شيئًا مما كنتُ أعلم\n إلا أني حَبَستُ عنك ورقتين فيهما ذكر نبي يُبعث\n وقد أطل زمانه\n فكرهت أن أخبرك بذلك\n فلا آمن عليك بعد وفاتي أن يخرج بعض هؤلاء الكاذبين فتتبعه\n وقد قطعتهما من كتابي\n وجعلتهما في هذه الكوة التي ترى\n وطينت عليهما\n فلا تتعرض لهما حتى يخرج هذا النبي\n فإذا خرج فاتبعه وانظر فيهما\n فإن الله تعالى يزيدك بهذا خيرًا\n فلما مات والدي لم يكن شيء أحب إليّ من أن ينقضي المأتم حتى أنظر ما في الورقتين\n فإذا فيهما:\n \" محمد رسول الله صلى الله عليه وسلم\n خاتم النبيين لا نبي بعده\n مولده بمكة\n ومهاجره طيبة\n ليس بفظ ولا غليظ ولا صخاب في الأسواق\n ولا يجزي بالسيئة السيئة\n ولكن يجزي بالسيئة الحسنة\n ويعفو ويغفر ويصفح\n أمته الحمَّادون\n الذين يحمدون الله على كل شرف وعلى كل حال\n وتُذلل ألسنتهم بالتكبير\n وينصر الله نبيهم على كل من ناوأه\n يغسلون فروجهم بالماء\n ويتأزرون على أوساطهم\n وأنَاجِيلُهُم في صدورهم\n ويأكلون قربانهم في بطونهم\n ويؤجرون عليها\n وتراحمهم بينهم تراحم بني الأم والأب\n وهم أول من يدخل الجنة يوم القيامة من الأمم\n وهم السابقون المقربون\n والشافعون المشفع فيهم \" \nثم أسلم على يد عمر بن الخطاب رضي الله عنه\n يقول الحقّ جلّ جلاله: في بقية أوصاف نبينا ـ عليه الصلاة والسلام ـ: { يأمرهم بالمعروف وينهاهم عن المنكر ويُحِلُّ لهم الطيبات } مما حرم على اليهود كالشحوم وغيرها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:10",
      "similarity": 0.4197555982073452
    },
    {
      "verse": "20:98",
      "similarity": 0.38788002192310456
    },
    {
      "verse": "26:124",
      "similarity": 0.35600418211749263
    },
    {
      "verse": "5:51",
      "similarity": 0.3423525878128869
    },
    {
      "verse": "7:65",
      "similarity": 0.3308332829677668
    }
  ]
}