{
  "chapter": "الأعراف",
  "text": "ان الذين اتخذوا۟ العجل سينالهم غضب من ربهم وذلة فى الحيوة الدنيا وكذلك نجزى المفترين",
  "translations": [
    {
      "translation": "As for those who adopted the Calf, anger from their Lord will overtake them together with abasement in the life of the dunya. That is how we repay the purveyors of falsehood.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who have taken the calf (as a god) will suffer the anger of their Lord, and disgrace in the world. That is how We requite those who fabricate lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "In reply they were told: 'Verily those who worshipped the calf will certainly incur indignation from their Lord, and will be abased in the life of this world. Thus do We reward those who fabricate lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(The Lord said), \"Those who worshipped the calf will be afflicted by the wrath of their Lord and disgraced in their worldly life. Thus, We will recompense those who invent falsehood.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who took the calf – the punishment from their Lord, and humiliation will reach them in the life of this world; and this is the way We reward those who fabricate lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly, those who took the calf (for worship), wrath from their Lord and humiliation will come upon them in the life of this world. Thus do We recompense those who invent lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(As for) those who took the calf (for a god), surely wrath from their Lord and disgrace in this world's life shall overtake them, and thus do We recompense the devisers of lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who took to themselves the Calf -- anger shall overtake them from their Lord, and abasement in this present life; so We recompense those who are forgers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! Those who chose the calf (for worship), terror from their Lord and humiliation will come upon them in the life of the world. Thus do We requite those who invent a lie.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who took to worshipping the calf will be afflicted by their Lord's wrath, and be disgraced in the life of this world. This is the way We requite those who invent falsehoods.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who took the calf, anon will overtake them indignation from their Lord and abasement in the life of the World. Thus We require the fabricators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who took up the calf [for worship] shall be overtaken by their Lord’s wrath and abasement in the life of the world.’ Thus do We requite the fabricators [of lies].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who took the calf (for worship) will indeed be overwhelmed with wrath from their Lord, and with shame in this life: thus do We recompense those who invent (falsehoods).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly, those who took the calf (for worship), wrath from their Lord and humiliation will come upon them in the life of this world. Thus do We recompense those who invent lies.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who worshipped the calf incurred the Anger of their Lord and abasement in this life, and as such We recompense the forgers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who idolized the calf have incurred wrath from their Lord, and humiliation in this life. We thus requite the innovators.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who took the calf [for worship] will obtain anger from their Lord and humiliation in the life of this world, and thus do We recompense the inventors [of falsehood].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:152] God, exalted be He, says, ‘Surely those who chose the calf, as a god. wrath, chastisement, and abasement shall come upon them from their Lord in the life of this world: and so they were punished [for this deed] by the command to slay themselves, and abasement was stamped upon them until the Day of Resurrection. Even, as We have requited them, so We requite those who invent lies, against God by way of idolatry and otherwise.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيجوز أن قوله : { إن الذين اتخذوا العجل } إلى قوله : { الدنيا } من تمام كلام موسى ، فبعد أن دعا لأخيه بالمغفرة أخبر أن الله غضب على الذين عبدوا العجل . وأنه سيظهر أثر عضبه عليهم ، وستنالهم ذلة في الدنيا وذلك بوحي تلقاه ، وانتهى كلام موسى عند قوله : { في الحياة الدنيا } ، وأن جملة : { وكذلك نجزي المفترين } خطاب من جانب الله في القرآن ، فهو اعتراض والواو اعتراضية ذيل الله بهذا الاعتراض حكاية كلام موسى فأخبر بأنه يجازي كل مفتر بمثل ما أخبر به موسى عن مفتري قومه ، وأن جملة : { والذين عملوا السيئات } إلى آخر الآية تكملة للفائدة ببيان حالة أضداد المتحدث عنهم وعن أمثالهم .ويجوز أن تكون جملة : { إن الذين اتخذوا العجل } إلى آخرها خطاباً من الله لموسى ، جواباً عن دعائه لأخيه بالمغفرة بتقدير فعللِ قول محذوف : أي قلنا إن الذين اتخذوا العجل إلى آخره ، مثل ما حكى الله تعالى عن إبراهيم في قوله تعالى : { وإذ قال إبراهيم رب اجعل هذا بلداً آمنا وارزق أهله من الثمرات من آمن منهم بالله واليوم الآخر قال ومن كفر فأمتعه قليلاً } \\[ البقرة : 126 \\] الآية .و { ينالهم } يصيبهم .والنول والنّيْل : الأخذُ وهو هنا استعارة للإصابة والتلبس كما في قوله تعالى : { أولئك ينالهم نصيبهم من الكتاب } في هذه السورة ( 37 ) ، والذين اتخذوا العجل هم الذين عبدوه فالمفعول الثاني { لاتخذوا } محذوف اختصاراً ، أي اتخذوه إلاهاً .وتعريفهم بطريق الموصولية ، لأنها أخصر طريق في استحضارهم بصفة عرفوا بها ، ولأنه يؤذن بسببية ما نالهم من العقاب ، والمراد بالغضب ظهور أثره من الخذلان ومنع العناية ، وأما نفس الغضب فهو حاصل في الحال .وغضب الله تعالى إرادته السوء بعبده وعقابه في الدنيا والآخرة أو في إحداهما .والذلة : خضوع في النفس واستكانة من جرّاء العجز عن الدفع ، فمعنى : نيل الذلّة إياهم أنهم يصيرون مغلوبين لمن يغلبهم ، فقد يكون ذلك بتسليط العدو عليهم ، أو بسلب الشجاعة من نفوسهم . بحيث يكونون خائفين العدو ، ولو لم يسلّط عليهم ، أو ذلّة الاغتراب إذ حرمهم الله ملك الأرض المقدسة فكانوا بلا وطن طول حياتهم حتى انقرض ذلك الجيل كله ، وهذه الذلّة عقوبة دنيوية قد لا تمحوها التوبة ، فإن التوبة إنما تقتضي العفو عن عقاب التكليف ، ولا تقتضي ترك المؤاخذة بمصائب الدنيا ، لأن العقوبات الدنيوية مسببات تنشأ عن أسبابها ، فلا يلزم أن ترفعها التوبة إلا بعناية إلهية خاصة ، وهذا يشبه التفرقة بين خطاب الوضع وخطاب التكليف كما يؤخذ من حديث الإسراء لما أُتي رسول الله صلى الله عليه وسلم بإناءَيْن أحدهما من لبن والآخر من خمر ، فاختار اللبن ، فقال جبريل : الحمد لله الذي هداك للفطرة لو أخذت الخمر لغَوَتْ أمتك ، هذا وقد يمحو الله العقوبة الدنيوية إذا رَضي عن الجاني والله ذو فضل عظيم .والقول في الإشارة من قوله : { وكذلك } تقدم في قوله { وكذلك جعلناكم أمة وسطاً } في سورة البقرة ( 143 ) ، أي ومثل ذلك الجزاء العظيم نجزي المفترين .والافتراء الكذب الذي لا شبهة لكاذبه في اختلاقه ، وقد مضى في قوله تعالى : { ولكن الذين كفروا يفترون على الله الكذب وأكثرهم لا يعقلون } في سورة المائدة ( 103 ).والمراد بالافتراء الاختلاق في أصول الدين بوضع عقائِدَ لا تستند إلى دليل صحيح من دلالة العقل أو من دلالة الوحي ، فإن موسى عليه السلام كان حذرهم من عبادة الأصنام كما حكاه الله فيما مضى في قوله تعالى : { وجاوزنا ببني إسرائيل البحر فأتوا على قوم يعكفون على أصنام لهم . . . } \\[ الأعراف : 138 140 \\] الآيات الثلاث المتقدمة آنفاً ، فجعل الله جزاءهم على الافتراء الغضبَ والذلة ، وذلك إذا فعلوا مثله بعد أن جاءتهم الموعظة من الله ، ولذلك لم يكن مشركو العرب أذلاّء ، فلما جاء محمد صلى الله عليه وسلم وهداهم فاستمروا على الافتراء عاقبهم الله بالذلة ، فأزال مهابتهم من قلوب العرب ، واستأصلهم قتلاً وأسراً ، وسلَب ديارهم ، فلما أسلم منهم من أسلموا صاروا أعزة بالإسلام .ويؤخذ من هذه الآية أن الكذاب يُرمى بالمذلّة .\n\n",
      "translations": [
        {
          "translation": "(Lo! those who chose) worshipped (the calf) and whoever emulates them, (terror) wrath (from their Lord and humiliation) through the imposition of the capitation tax (will come upon them in the life of the world. Thus do We requite those who invent a lie) against Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nقال سبحانه { إِنَّ ٱلَّذِينَ ٱتَّخَذُواْ ٱلْعِجْلَ } المصوغ إلهاً بمجرد الخوار الذي صدر منه { سَيَنَالُهُمْ } وينزل عليهم في النشأة الأخرى { غَضَبٌ مِّن رَّبِّهِمْ } يطردهم ويبعدهم عن ساحة عز حضوره { وَذِلَّةٌ } صغار وهوان { فِي ٱلْحَياةِ ٱلدُّنْيَا وَكَذَلِكَ } في النشأة الأولى والآخرى { نَجْزِي ٱلْمُفْتَرِينَ } [الأعراف: 152] المشركين لنا غيرنا من مخلوقاتنا\n افتراءً ومراءً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { إن الذين اتخذوا العِجلَ سينالُهم غضبٌ من ربهم } وهو ما أمرهم من قتل أنفسهم\n أو الطاعون الذي سلط عليهم\n { وذلةٌ في الحياة الدنيا } وهي ضرب الجزية والهوان إلى يوم القيامة\n { وكذلك نجزي المفترين } على الله\n ولا فرية أعظم من فريتهم\n حيث { قالوا هذا إلهكم وإله موسى } \n ولعله لم يفترِ أحدٌ مثلها قبلهم ولا بعدهم\n حيث جعلوا البقر إلههم وإله الرسول\n نسأل الله الحفظ\n ثم ذكر توبتهم\n فقال: { والذين عَمِلُوا السيئات } من الكفر والمعاصي",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:92",
      "similarity": 0.4424844717033641
    },
    {
      "verse": "7:49",
      "similarity": 0.43649567279310186
    },
    {
      "verse": "7:37",
      "similarity": 0.4195297216937861
    },
    {
      "verse": "2:124",
      "similarity": 0.36149317488722515
    },
    {
      "verse": "33:25",
      "similarity": 0.3469641607996794
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007152.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007152.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:152.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}