{
  "chapter": "الأعراف",
  "text": "ولما رجع موسى الى قومه غضبن اسفا قال بئسما خلفتمونى منۢ بعدى اعجلتم امر ربكم والقى الالواح واخذ براس اخيه يجره اليه قال ابن ام ان القوم استضعفونى وكادوا۟ يقتلوننى فلا تشمت بى الاعداء ولا تجعلنى مع القوم الظلمين",
  "translations": [
    {
      "translation": "When Musa returned to his people in anger and great sorrow, he said, 'What an evil thing you did in my absence after I left! Did you want to hasten your Lord's command?' He threw down the Tablets and seized hold of his brother's head, dragging him towards him. Harun said, 'Son of my mother, The people oppressed wrongdoing people.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses returned to his people, indignant and grieved, he said: \"How wickedly you behaved in my absence. Why must you hasten the decree of your Lord?\" And he cast aside the tablets, and pulled his brother by the hair. \"O son of my mother,\" said (Aaron), \"these people took advantage of my weakness and almost killed me. Do not let my enemies rejoice at my plight, and do not put me down among transgressors.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses returned to his people, full of wrath and sorrow, he said: 'Vile is the course you have followed in my absence. Could you not patiently wait for the decree of your Lord?' And he threw down the Tablets [of the Law] and took hold of his brother's head, dragging him to himself. Aaron said: 'My mother's son, the people overpowered me and almost killed me. So let not my enemies gloat over me, and do not number me among the wrong-doing folk.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses returned to his people with anger and sorrow, he said, \"What you have done in my absence is certainly evil. Why were you hasty about the commandments of your Lord?\" He threw away the Tablets (which contained the commandments of God), grabbed his brother and started to pull him to himself. His brother begged him saying, \"Son of my mother, the people suppressed me and almost killed me. Do not humiliate me before the enemies or call me unjust\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moosa returned to his people, angry and upset, he said, “What an evil way you have handled affairs on my behalf, behind me; did you hasten upon the command of your Lord?” And he cast down the stone tablets, and catching hold of his brothers hair, began pulling him towards him; said Haroon said, “O the son of my mother! The people thought I was weak and would have probably killed me; so do not make my enemies laugh at me and do not identify me with the unjust.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Musa returned to his people, angry and grieved, he said: \"What an evil thing is that which you have done during my absence. Did you hasten in matter of your Lord\" And he threw down the Tablets and seized his brother by (the hair of) his head and dragged him towards him. He (Harun) said: \"O son of my mother! Indeed the people judged me weak and were about to kill me, so make not the enemies rejoice over me, nor put me among the people who are wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Musa returned to his people, wrathful (and) in violent grief, he said: Evil is it that you have done after me; did you turn away from the bidding of your Lord? And he threw down the tablets and seized his brother by the head, dragging him towards him. He said: Son of my mother! surely the people reckoned me weak and had well-nigh slain me, therefore make not the enemies to rejoice over me and count me not among the unjust people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses returned to his people, angry and sorrowful, he said, 'Evilly have you done in my place, after me; what, have you outstripped your Lord's commandment?' And he cast down the Tablets, and laid hold of his brother's head, dragging him to him. He said, 'Son of my mother, surely the people have abased me, and well nigh slain me. Make not my enemies to gloat over me, and put me not among the people of the evildoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses returned unto his people, angry and grieved, he said: Evil is that (course) which ye took after I had left you. Would ye hasten on the judgment of your Lord? And he cast down the tablets, and he seized his brother by the head, dragging him toward him. He said: Son of my mother! Lo! the folk did judge me weak and almost killed me. Oh, make not mine enemies to triumph over me and place me not among the evil-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses returned to his people in anger and great sorrow, he said, \"What an awful sin you have committed in my absence. Did you want to hasten your Lord's command?\" He threw down the Tablets and seized his brother by the head, pulling him towards himself. Aaron said, \"Son of my mother, the people oppressed me and almost killed me. Do not give my enemies cause to gloat over me. Do not number me among the wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Musa returned unto his people indignant and sorrowing, he said: ill is that which ye have acted as my successors, after me Anticipated ye the command of you Lord! And he cast down the tablets and took hold of the head of his brother dragging him unto himself. Aaron said: son of my mother! the people held me weak and well- nigh slew me, so cause not the enemies rejoice over me, and place me not with the wrong-doing people\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses returned to his people, angry and indignant, he said, ‘Evil has been your conduct in my absence! Would you hasten on the edict of your Lord?’ He threw down the tablets and seized his brother by the head, pulling him towards himself. He said, ‘Son of my mother, indeed this people thought me to be weak, and they were about to kill me. So do not let the enemies gloat over me, and do not take me with the wrongdoing lot.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses came back to his people, angry and grieved, he said: \"Evil it is that ye have done in my place in my absence: did ye make haste to bring on the judgment of your Lord?\" He put down the tablets, seized his brother by (the hair of) his head, and dragged him to him. Aaron said: \"Son of my mother! the people did indeed reckon me as naught, and went near to slaying me! Make not the enemies rejoice over my misfortune, nor count thou me amongst the people of sin.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Musa (Moses) returned to his people, angry and grieved, he said: \"What an evil thing is that which you have done (i.e. worshipping the calf) during my absence. Did you hasten and go ahead as regards the matter of your Lord (you left His worship)?\" And he threw down the Tablets and seized his brother by (the hair of) his head and dragged him towards him. Harun (Aaron) said: \"O son of my mother! Indeed the people judged me weak and were about to kill me, so make not the enemies rejoice over me, nor put me amongst the people who are Zalimun (wrong-doers).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses returned to his nation, angry and sorrowful, he said: 'Evil is what you have done in my absence! Would you hasten the retribution of your Lord' He threw down the Tablets, and seizing his brother by the head, dragged him towards him. 'Son of my mother' said (Aaron), 'the nation weakened me, and almost killed me. Do not let my enemies rejoice over me; do not number me among the harmdoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses returned to his people, angry and disappointed, he said, “What an awful thing you did in my absence. Did you forsake the commandments of your Lord so hastily?” And he threw down the tablets; and he took hold of his brother’s head, dragging him towards himself. He said, “Son of my mother, the people have overpowered me, and were about to kill me; so do not allow the enemies to gloat over me, and do not count me among the unjust people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses returned to his people, angry and grieved, he said, \"How wretched is that by which you have replaced me after [my departure]. Were you impatient over the matter of your Lord?\" And he threw down the tablets and seized his brother by [the hair of] his head, pulling him toward him. [Aaron] said, \"O son of my mother, indeed the people oppressed me and were about to kill me, so let not the enemies rejoice over me and do not place me among the wrongdoing people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:150] And when Moses returned to his people, angry, because of them, and bitterly grieved, he said, to them: ‘Evil is that, that is, evil is the [manner of] succession, which you have followed in my place, after I had gone, this idolatry of yours. Would you hasten on the judgement of your Lord?’ And he cast down the Tablets, the Tablets of the Torah, angry for the sake of his Lord, and they were broken into pieces, and he seized his brother by the head, that is, by the hair, with his right hand, and [seized him] by the beard, with his left hand, dragging him toward him, in anger. He said, ‘O, son of my mother! (read either ibna ummi or ibna umma, by which he meant [the standard form of saying ‘my mother’] ummī: the mention of her is more affectionate [in appealing] to his heart), Truly the people judged me weak and they were close to killing me. Do not make my enemies gloat over my misfortune, to rejoice thereat, by your humiliating me, and do not count me among the folk who have done evil’, by worshipping the calf, in [your] reproach [of them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nجُعل رجوع موسى إلى قومه غضبان كالأمر الذي وقع الإخبار عنه من قبلُ على الأسلوب المبين في قوله : { ولما جاء موسى لميقاتنا } \\[ الأعراف : 143 \\] وقوله : { ولما سُقط في أيديهم } \\[ الأعراف : 149 \\]. فرجوع موسى معلوم من تَحقق انقضاء المدة الموعود بها ، وكونُه رجع في حالة غضب مشعر بأن الله أوحى إليه فأعلمه بما صنع قومُه في مغيبه ، وقد صرح بذلك في سورة طه ( 85 ) { قال فإنّا قد فتنّا قومك من بَعدِك وأضلهم السامري } ف { غضبان أسِفاً حَالان من موسى ، فهما قيداننِ لرجع } فعلم أن الغضب والأسف مقارنان للرجوع .والغْضب تقدم في قوله : { قال قد وقع عليكم من ربكم رجس وغضب } في هذه السورة ( 71 ).والأَسِف بدون مد ، صيغة مبالغة للآسف بالمد الذي هو اسم فاعل للذي حل به الأسف وهو الحزن الشديد ، أي رجع غضْبان من عصْيان قومه حزيناً على فساد أحوالهم ، وبئسما ضد نِعمّا ، وقد مضى القول عليه في قوله تعالى : { قل بئسما يأمركم به إيمانكم } في سورة البقرة ( 93 ) ، والمعنى بئست خلافة خلفتمونيها خِلاَفتُكم .وتقدم الكلام على فعل خَلف في قوله : { اخلُفْني في قومي } \\[ الأعراف : 142 \\] قريباً .وهذا خطاب لهارون ووجوه القوم ، لأنهم خلفاء موسى في قومهم فيكون { خلفتموني } مستعملاً في حقيقته ، ويجوز أن يكون الخطاب لجميع القوم ، فأما هارون فلأنه لم يُحسن الخلافة بسياسة الأمة كما كان يسوسها موسى ، وأما القوم فلأنهم عبدوا العجل بعد غيبة موسى ، ومن لوازم الخلافة فعل ما كان يفعله المخلُوف عنه ، فهم لما تركوا ما كان يفعله موسى من عبادة الله وصاروا إلى عبادة العجل فقد انحرفوا عن سيرته فلم يخلفوه في سيرته ، وإطلاق الخلافة على هذا المعنى مجاز فيكون فعل { خلفتموني } مستعملاً في حقيقته ومجازه .وزيادة { مِن بعدي } عقب { خلفتموني } للتذكير بالبَون الشاسع بين حال الخلف وحال المخلوفَ عنه تصوير لفظاعة ما خلفوه به أي بعدما سمعتم مني التحذير من الإشراك وزجركم عن تقليد المشركين حين قلتم : اجعل لنا إلهاً كما لهم آلهة ، فيكون قيد { من بعدي } للكشف وتصوير الحالة كقوله تعالى : { فخَر عليهم السقُف من فوقِهم } \\[ النحل : 26 \\] ، ومعلوم أن السقف لا يكون إلاّ من فوق ، ولكنه ذكر لتصوير حالة الخرور وتهويلها ، ونظيره قوله تعالى ، بعد ذكر نفر من الأنبياء وصفاتهم ، { فخلف من بعدهم خَلْف } \\[ الأعراف : 169 \\] أي من بعد أولئك الموصوفين بتلك الصفات .و«عَجلَ» أكثرَ ما يستعمل قاصراً ، بمعنى فعل العجلة أي السرعة ، وقد يتعدى إلى المعمول «بعن» فيقال : عجلَ عن كذا بمعنى لم يتمّه بعد أن شَرع فيه ، وضده تَم على الأمر إذا شرع فيه فأتمّه ، ويستعمل عَجِل مضمناً معنى سَبَق فعّدَيَ بنفسه على اعتبار هذا المعنى ، وهو استعمال كثير .ومعنى «عَجِل» هنا يَجوز أن يكون بمعنى لم يُتّمَ ، وتكون تعديته إلى المفعول على نزع الخافض .والأمرُ يكون بمعنى التكليف وهو ما أمرهم الله به : من المحافظة على الشريعة ، وانتظار رجوعه ، فلم يتموا ذلك واستعجلوا فبدلوا وغيروا ، ويجوز أن يكون بمعنى سَبق أي بادرتم فيكون الأمر بمعنى الشأن أي الغضب والسخط كقوله : { أتى أمر الله فلا تستعجلوه } \\[ النحل : 1 \\] وقوله : { حتى إذا جاء أمرنا وفار التنور } \\[ هود : 40 \\] فالأمر هو الوعيد ، فإن الله حذرهم من عبادة الأصنام وتوعدهم ، فكان الظن بهم إن وقع منهم ذلك إن يقع بعد طول المدة ، فلما فعلوا ما نُهوا عنه بحدثان عهد النهي ، جُعلوا سابقين له على طريقة الاستعارة : شبهوا في مبادرتهم إلى أسباب الغضب والسخط بسبق السابق المسبوقَ ، وهذا هو المعنى الأوضح ، ويوضحه قوله ، في نظير هذه القصة في سورة طه ( 86 ) ، حكاية عن موسى : { قال يا قوم ألم يَعدْكم ربكم وعداً حسناً أفطال عليكم العهد أم أردتم أن يحل عليكم غضب من ربكم فأخلفتم موعدي } وقد تعرضت التوراة إلى شيء من هذا المعنى في الإصحاح الثاني والثلاثين من سفر الخروج «وقال الله لموسى رأيتُ هذا الشّعْب فإذا هو شعب صلْب الرقبة فالآن اتركني ليحميَ غَضبي عليهم فأفنيهم» .وإلقاء الألواح رَميُها من يده إلى الأرض ، وقد تقدم بيان الإلقاء آنفاً . وذلك يؤذن بأنه لما نزل من المناجاة كانت الألواح في يده كما صرح به في التوراة .ثم إن إلقاءه إياها إنما كان إظهاراً للغضب ، أو أثراً من آثار فوران الغضب لما شاهدهم على تلك الحالة ، وما ذكر القرآن ذلك الإلقاءَ إلاّ للدلالة على هذا المعنى إذ ليس فيه من فوائد العبرة في القصة إلاّ ذلك ، فلا يستقيم قول من فسرها بأن الإلقاء لأجل إشغال يده بجرّ رأس أخيه ، لأن ذكر ذلك لا جرور فيه ، ولأنه لو كان كذلك لعطف ، وأخذ برأس أخيه بالفاء .وروي أن موسى عليه السلام كان في خلقه ضيق ، وكان شديداً عند الغضب ، ولذلك وكزَ القبطي فقضى عليه ، ولذلك أخذ برأس أخيه يجره إليه ، فهو دليل على فظاعة الفعل الذي شاهده من قومه ، وذلك علامة على الفظاعة ، وتشنيع عليهم ، وليس تأديباً لهم ، لأنه لا يكون تأديبهم بإلقاء ألواح كُتب فيها ما يصلحهم ، لأن ذلك لا يناسب تصرف النبوءة ( ولذلك جزمنا بأن إعراض رسول الله صلى الله عليه وسلم عن كتابة الكتاب الذي هَمَّ بكتابته قبيل وفاته لم يكن تأديباً للقوم على اختلافهم عنده ، كما هو ظاهر قول ابن عباس ، بل إنما كان ذلك لِما رأى من اختلافهم في ذلك ، فرأى أن الأوْلى ترك كتابته ، إذ لم يكن الدين محتاجاً إليه ) ووقع في التوراة أن الألواح تكسرت حين ألقاها ، وليس في القرآن ما يدل على ذلك سوى أن التعبير بالإلقاء الذي هو الرمي ، ومَا روي من أن الألواح كانت من حجر ، يقتضي أنها اعتراها انكسار ، ولكن ذلك الانكسار لا يُذهب ما احتوت عليه من الكتابة ، وأما ما روي أنها لما تكسرت ذهب ستة أسباعها ، أو ذهب تفصيلها وبقيت موعظتها ، فهو من وضع القصّاصين والله تعالى يقول :{ ولما سكت عن موسى الغضبْ أخذ الألواح وفي نسختها هدى ورحمة للذين هم لربهم يرهبون } \\[ الأعراف : 154 \\].وأما أخذه برأس أخيه هارون يجره إليه ، أي إمساكه بشعر رأسه ، وذلك يولمه ، فذلك تأنيب لهارون على عدم أخذه بالشدة على عَبدَة العجل ، واقتصاره على تغيير ذلك عليهم بالقول ، وذلك دليل على أنه غير معذور في اجتهاده الذي أفصح عنه بقوله : { إني خشيت أن تقول فرقْت بين بني إسرائيل ولم تَرْقُب قولي } \\[ طه : 94 \\] لأن ضعف مستنده جعله بحيث يستحق التأديب ، ولم يكن له عذراً ، وكان موسى هو الرسول لبني إسرائيل ، وما هارون إلاّ من جملة قومه بهذا الاعتبار ، وإنما كان هارون رسولاً مع موسى لفرعون خاصة ، ولذلك لم يسَعْ هارونَ إلاّ الاعتذارُ والاستصفاح منه .وفي هذا دليل على أن الخطأ في الاجتهاد مع وضوح الأدلة غير معذور فيه صاحبه في إجراء الأحكام عليه ، وهو ما يسميه الفقهاء بالتأويل البَعيد ولا يظن بأن موسى عاقب هارون قبل تحقق التقصير .وفصلت جملةٌ : { قال ابن أم } لوقوعها جوابها لحوار مقدر دل عليه قوله { وأخذ برأس أخيه يجره إليه } لأن الشأن أن ذلك لا يقع إلاّ مع كلام توبيخ ، وهو ما حكي في سورة طه ( 92 ، 93 ) بقوله : { قال يا هارون ما منعك إذ رأيتهم ضَلوا ألاَّ تتبعننِ أفعصيت أمري } على عادة القرآن في توزيع القصة ، واقتصاراً على موقع العبرة؛ ليخالف أسلوبُ قصَصه الذي قصد منه الموعظة أساليبَ القصّاصين الذين يقصدون الخبر بكل ما حدث .و { ابنَ أم } منادى بحذف حرف النداء ، والنداء بهذا الوصف للترقيق والاستشفاع ، وحذف حرف النداء لإظهار ما صاحب هارون من الرعب والاضطراب ، أو لأن كلامه هذا وقع بعد كلام سبقه فيه حرف النداء وهو المحكي في سورة طه ( 94 ) { قال يا بن أم لا تأخذ بلحيتي } ثم قال ، بعد ذلك { ابنَ أم إن القوم استضعفوني } فهما كلامان متعاقبان ، ويظهر أن المحكي هنا هو القول الثاني ، وأن ما في سورة طه هو الذي ابتدأ به هارون ، لأنه كان جواباً عن قول موسى : { ما منعك إذ رأيتهم ضَلوا أن لا تتبعن } \\[ طه : 92 ، 93 \\].واختيار التعريف بالإضافة؛ لتضمن المضاف إليه معنى التذكير بصلة الرحم ، لأن إخوة الأم أشد أواصر القرابة؛ لاشتراك الأخوين في الألف من وقت الصبا والرضاع .وفتح الميم في { ابن أم } قراءة نافع ، وابن كثير ، وأبي عَمرو ، وحفص عن عاصم ، وهي لغة مشهورة في المنادى المضاف إلى أم أو عَم ، وذلك بحذف ياء المتكلم وتعويض ألف عنها في آخر المنادى ، ثم يحذف ذلك الألف تخفيفاً ، ويجوز بقاء كسرة الميم على الأصل ، وهي لغة مشهورة أيضاً ، وبها قرأ ابن عامر ، وحمزة ، والكسائي ، وأبو بكر عن عاصم ، وخلفٌ .وتقدم الكلام على الأم عند قوله تعالى : { حرمت عليكم أمهاتكم } في سورة النساء ( 23 ).وتأكيد الخبر ب { إن } لتحقيقه لدى موسى ، لأنه بحيث يتردد فيه قبل إخبار المخبر به ، والتأكيدُ يستدعيه قبولُ الخبر للتردد من قِبَل إخبار المخبر به ، وإن كان المخبر لا يُظن به الكذب ، أو لئلا يظن به أنه تَوهم ذلك من حال قومه ، وكانت حالهم دون ذلك .والسين والتاء في { استضعفوني } للحسبان أي حسبوني ضعيفاً لا ناصر لي ، لأنهم تمالؤوا على عبادة العجل ولم يخالفهم إلا هارون في شرذمة قليلة .وقوله : { وكادوا يقتلونني } يدل على أنه عارضهم معارضة شديدة ثم سلّم خشيةَ القتل .والتفريع في قوله : { فَلا تُشمت بي الأعداء ولا تجعلني مع القوم الظالمين } تفريع على تبين عذره في إقرارهم على ذلك ، فطلب من أخيه الكف عن عقابه الذي يَشْمت به الأعداء لأجله ، ويجعله مع عداد الظالمين فطلبُ ذلك كنايةٌ عن طلب الإعراض عن العقاب .والشماتة : سُرور النفس بما يصيب غيرها من الإضرار ، وإنما تحصل من العداوة والحسد . وفعلَها قاصر كفرح ، ومصدرها مخالف للقياس ، ويتعدى الفعل إلى المفعول بالباء يقال : شَمتَ به : أي : كان شامتاً بسببه ، وأشمته به جعله شامتاً به ، وأراد بالأعداء الذين دعوا إلى عبادة العجل ، لأن هارون أنكره عليهم فكرهوه لذلك ، ويجوز أن تكون شماتةُ الأعداء كلمة جرت مجرى المثل في الشيء الذي يُلحق بالمرءِ سوءاً شديداً ، سواء كان للمرء أعداء أو لم يكونوا ، جرياً على غالب العرْف .ومعنى { ولا تجعلْني مع القوم الظالمين } لا تحسبني واحداً منهم ، ف ( جعل ) بمعنى ظن كقوله تعالى : { وجعلوا الملائكة الذين هم عند الرحمان إناثاً } \\[ الزخرف : 19 \\]. والقوم الظالمون هم الذين أشركوا بالله عبادة العجل ، ويجوز أن يكون المعنى : ولا تجعلني في العقوبة معهم ، لأن مُوسى قد أمر بقتل الذين عَبدوا العجل ، ف ( جعل ) على أصلها .\n\n",
      "translations": [
        {
          "translation": "(And when Moses returned unto his people, angry and grieved) when he heard the voice of sedition, (he said: Evil is that (course) which ye took after I had left you) evil is what you did by worshipping the calf after I went to the mountain. (Would ye hasten on the judgement of your Lord) would you hasten by worshipping the calf the promise of your Lord? (And he cast down the tablets) from his hand and two of them were broken, (and he seized his brother by the head) i.e. by Aaron's hair, (dragging him towards him. He) Aaron (said: Son of my mother!) they were full brothers, but he mentioned their mother so that Moses might be gentle with him (Lo! the folk did judge me weak) humiliated me (and almost killed me) due to my opposition. (Oh, make not mine enemies to triumph over me) make not the enemy, the folk of the calf, spite me (and place me not among the evil-doers!) do not harm me because of the folk of the calf.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { غَضْبَانَ أَسِفاً } معناهُ مَتغضِبٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"I am angry, frustrated,\" means He is angry.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَمَّا رَجَعَ مُوسَىٰ إِلَىٰ قَوْمِهِ } بعدما وقع فيه ما وقع\n وسمع ما سمع صار { غَضْبَٰنَ } أي: استولى عليه غضبه حمية وغيرة { أَسِفاً } متأسفاً متحزناً\n لضلال قومه { قَالَ } مغاضباً: { بِئْسَمَا } أي: بئس شيئاً { خَلَفْتُمُونِي } أي: أبدعتم خلفي { مِن بَعْدِيۤ } أي: من بعد ذهابي إلى ربي\n لأزيد صلاحكم وإصلاحكم أيها المسرفون المفرطون فازددتم الضلال\n واستوجتبم النكال { أَعَجِلْتُمْ } أيها الحمقى { أَمْرَ رَبِّكُمْ } أي: عذابه وعقابه { وَأَلْقَى } من غضبه { ٱلأَلْوَاحَ } التي كانت بيده من التوراة فانكسر منها واضمحل ما يتعلق بتفصيل الاحكام\n وبقي المواعظ { وَأَخَذَ بِرَأْسِ أَخِيهِ } هارون\n أي: من شعر رأسه\n من غاية غضبه وغيظه { يَجُرُّهُ إِلَيْهِ } أي: إلى نفسه\n زجراً له وتشدداً عليه كيف لا يحفظهم\n ولا ينكر عليهم\n حتى لا يضلوا ولا يكفروا باتخاذ العجل لها؟ { قَالَ } هارون معتذراً متحزناً: { ٱبْنَ أُمَّ } أضافه إلى الأم استعطافاً { إِنَّ ٱلْقَوْمَ ٱسْتَضْعَفُونِي } حين أظهرت الإنكار عليهم\n وأردت أن أصرفهم عمَّا هم عليه\n وصاروا بأجمعهم أعدائي\n بل { وَكَادُواْ يَقْتُلُونَنِي } لشدة غيظهم عليَّ وعداوتهم معي\n وأنت أيضاً تغضب عليَّ وتجر رأسي\n وهم يفرحون ويضحكون ببغضك عليَّ وزجرك إياي { فَلاَ تُشْمِتْ } ولا تٌفرح يا أخي { بِيَ ٱلأَعْدَآءَ وَلاَ تَجْعَلْنِي } شريكاً { مَعَ ٱلْقَوْمِ ٱلظَّٰلِمِينَ } [الأعراف: 150] الخارجين عن مقتضى العقل والنقل\n\n\nثمَّ لمَّا سمع موسى من هارون ما سمع ندم عن فعله وعن سوء الأدب مع أخيه\n لأنه أكبر منه سناً\n واسترجع إلى الله حيث { قَالَ رَبِّ ٱغْفِرْ لِي } عمَّا صنعت مع أنه بريء مما نسبت إأليه { وَ } اغفر أيضاً { لأَخِي } فلم يتقاعد ويتقاصر عن إنكار هؤلاء المضلين المتخذين لك شريكاً من أدنى مخلوقاتك { وَأَدْخِلْنَا } بفضلك وجودك { فِي رَحْمَتِكَ وَأَنتَ أَرْحَمُ ٱلرَّاحِمِينَ } [الأعراف: 151]",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nالإشارة: { بئسما }: \" ما \" نكرة موصوفة: تمييز\n تفسير للضمير المستكن في بئس\n والمخصوص: محذوف\n أي: بئس شيئًا خلفتموني خلافتكم هذه\n و { ابن أم }: منادى مضاف\n منصوب بفتحة مقدرة قبل ياء المتكلم\n وأصله: ابن أمي\n فحذفت الياء\n وفتحت الميم تخفيفًا\n يقول الحقّ جلّ جلاله: { ولما رجعَ موسى } من ميقاته { إلى قومه غضبان } على قومه\n { أسِفًا } أي: حزينًا عليهم حيث ضلوا\n { قال } لهم\n أو لأخيه ومن معه من المؤمنين: { بئسما خلفتُموني من بعدي } أي: من بعد انطلاقي إلى المناجاة\n { أعَجِلتُم أمرَ ربكم } أي: أسابقتم قضاء ربكم ووعده\n واستعجلتم إتياني قبل الوقت الذي قدَّر فيه\n أو أعجلتم عقوبة ربكم وإهلاكه لكم حيث عبدتم غيره\n { وألقى الألواحَ } طرحها من شدة الغضب حمية للدين\n رُوِي أن التوراة كانت سبعة أسفار في سبعة ألواح\n فلما ألقاها انكسرت\n فرفع ستةَ أسبَاعِها\n وكان فيها تفصيل كل شيء\n وبقي سُبعٌ كان فيه المواعظ والأحكام\n { وأخذَ برأسِ أخيه }: بشعر رأسه { يَجرُّه إليه } توهمًا في أنه قصَّر في زجرهم\n وهارونُ كان أكبر منه بثلاث سنين\n وكان حمولاً لَيِّنًا\n ولذلك كان أحبَّ إلى بني إسرائيل\n ولما رأى هارونُ ما يفعل به أخروه { قال ابنَ أُمَّ } ذكر الأم ليرقّقه\n وكان شقيقًا له\n { إنَّ القوم استضعفوني وكادوا يقتلونني } حين أنكرتُ عليهم\n فقد بذلتُ جهدي في كفهم\n وقهروني حتى قاربوا قتلي\n فلم أُقَصِّر\n { فلا تُشمت بي الأعداء } فلا تفعل بي ما يشمتون بي\n أي: يستشفون بي لأجله\n { ولا تجعلني مع القوم الظالمين } معدودًا في عدادهم بالمؤاخذة\n أو نسبة التقصير\n { قال } موسى: { ربِّ أغفر لي } ما صنعتُ بأخي\n { ولأخي } إن فرَّط في كفَّهم\n { وأدخلنا في رحمتك } بمزيد الإنعام علينا",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:86",
      "similarity": 0.17788512241284346
    },
    {
      "verse": "43:55",
      "similarity": 0.13735352186108502
    },
    {
      "verse": "12:84",
      "similarity": 0.12473925234709721
    },
    {
      "verse": "7:145",
      "similarity": 0.11785006900500149
    },
    {
      "verse": "74:29",
      "similarity": 0.11615362941379125
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007150.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007150.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:150.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}