{
  "chapter": "الأعراف",
  "text": "ولما سكت عن موسى الغضب اخذ الالواح وفى نسختها هدى ورحمة للذين هم لربهم يرهبون",
  "translations": [
    {
      "translation": "When Musa's anger abated he picked up the Tablets and in their inscription was guidance and mercy for all of them who feared their Lord.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his anger subsided Moses picked up the tablets. Inscribed on them was guidance and grace for those who fear their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the anger of Moses was stilled, he took up the Tablets again, the text of which comprised guidance and mercy to those who fear their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses' anger calmed down, he collected the Tablets. On one of them was written, \"God's mercy and guidance are for those who have fear of Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the anger of Moosa abated, he picked up the stone tablets; and in their texts are guidance and mercy for those who fear their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the anger of Musa calmed, he took up the Tablets; and in their inscription was guidance and mercy for those who fear their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Musa's anger calmed down he took up the tablets, and in the writing thereof was guidance and mercy for those who fear for the sake of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Moses' anger abated in him, he took the Tablets and in the inscription of them was guidance, and mercy unto all those who hold their Lord in awe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when the anger of Moses abated, he took up the tablets, and in their inscription there was guidance and mercy for all those who fear their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his anger had subsided, Moses took up the Tablets upon which was inscribed a pledge of guidance and mercy for those who fear their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the indignation of Musa was appeased, he took up the tablets, and in the inscription thereon were guidance and mercy unto these who dread their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When Moses’ indignation abated, he picked up the tablets whose inscriptions contained guidance and mercy for those who are in awe of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the anger of Moses was appeased, he took up the tablets: in the writing thereon was guidance and Mercy for such as fear their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the anger of Musa (Moses) was appeased, he took up the Tablets, and in their inscription was guidance and mercy for those who fear their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When his anger abated, Moses took up the Tablets upon which was inscribed guidance and mercy to those who fear their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the anger abated in Moses, he took up the tablets. In their transcript is guidance and mercy for those in awe of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the anger subsided in Moses, he took up the tablets; and in their inscription was guidance and mercy for those who are fearful of their Lord.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:154] And when Moses’s anger abated, subsided, he took the Tablets, which he had cast down, and in their copy, that is, [in] what was inscribed upon them — in other words, it was written that: there was guidance, from error, and mercy for all those who hold their Lord in awe, [who] have fear [of Him] (the lām [in li-rabbihim, ‘their Lord’] has been inserted into the direct object because it [the direct object] has preceded [the verb]).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then, when the anger of Moses abated, he took up the tablets, and in their inscription) in what remained in them; it is also said: in what was returned to him of the two tablets (there was guidance) from error (and mercy) preventing from torment (for all those who fear their Lord).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَلَماَّ سَكَتَ عَن مُّوسَى ٱلْغَضَبُ } معناهُ سَكنٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd when Moses was silent in anger, it meant he was calm.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَماَّ سَكَتَ } أي: سكن وذهب { عَن مُّوسَى ٱلْغَضَبُ } الذي استولى عليه إلى حيث ألقى ألواح التوارة\n وأخذ شعر أخيه يجره { أَخَذَ ٱلأَلْوَاحَ } المنكسرة المتلاشية وإن انكسر ما فيها تفصيل كل شيء { وَ } قد بقي منها ما { فِي نُسْخَتِهَا } أي: ما نسخ ورقم عنها سالمة عن الانكسار { هُدًى } أي: أوامر ونواهي توصلهم إلى توحيد الحق إن امتثلوا به وقبلوا { وَرَحْمَةٌ } تنجيهم عن الضلال إن اتصفوا بها\n كل ذلك حاصل { لِّلَّذِينَ هُمْ لِرَبِّهِمْ يَرْهَبُونَ } [الأعراف: 154] أي: يخافون من الله\n طلباً لرضاه لا لغرض آخر من الرياء والسمعة\n بل من طلب الجنة وخوف العذاب أيضاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { لما سكت } أي: سكن { عن موسى الغضبُ } لَمَّا كان الغضب هو الحامل له على ما فعل صار كأنه كان يأمره به ويغريه عليه، حتى عبَّر عن سكونه بالسكوت، أي: لما سكن غضبه { أخذَ الألواحَ } التي ألقاها، { وفي نُسختها } أي: وفيما نسخ فيها، أي: كُتب { هُدَىً ورحمة } أي: بيان للحق وإرشاد إلى الصلاح والخير، { للذين هم لربهم يرهبون } أي: للذين يخافون ربهم ويهابونههم المنتفعون بها، ودخلت اللام في المفعول لضعف العامل بتأخره. الإشارة: الغضب لأجل النفس يُفسد الإيمان، كالحنظل مع العسل، ولذلك قال ـ عليه الصلاة والسلام ـ للذي قال له: أوصني، قال: \" لا تَغضَب \" ، ثم كرر عليه: أوصني، قال: \" لا تَغضَب \" ، ثلاثًا، لأن الغضب المفرط يغطي نور العقل، فيصدر من صاحبه أمور منكرة، قد يخرج بها عن الإيمان بالكلية، وقد يؤدي إلى قتل نفسه والعياذ بالله، والغضب معيار الصوفية قال بعضهم: إذا أردت أن تعرف الرجل فغضبه وانظر ما يخرج منه، إلى غير ذلك مما ورد فيه، فإن كان غضبه لله أو بالله فلا كلام عليه، وهو حال الأنبياء وأكابر الأولياء ـ رضي الله عنهم ـ. ولما انقضت قضية العجل أراد سيدنا موسى عليه السلام أن يذهب بقوم، يعتذرون عن عبادة العجل، كما قال تعالى: { وَٱخْتَارَ مُوسَىٰ قَوْمَهُ سَبْعِينَ رَجُلاً }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:106",
      "similarity": 0.2630873307451495
    },
    {
      "verse": "22:52",
      "similarity": 0.25979849481897177
    },
    {
      "verse": "45:29",
      "similarity": 0.2583914735266593
    },
    {
      "verse": "74:29",
      "similarity": 0.19068727619562717
    },
    {
      "verse": "85:22",
      "similarity": 0.18916316106208006
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/7:154.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/7:154.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/7:154.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}