{
  "chapter": "الأعراف",
  "text": "واختار موسى قومه سبعين رجلا لميقتنا فلما اخذتهم الرجفة قال رب لو شئت اهلكتهم من قبل وايى اتهلكنا بما فعل السفهاء منا ان هى الا فتنتك تضل بها من تشاء وتهدى من تشاء انت ولينا فاغفر لنا وارحمنا وانت خير الغفرين",
  "translations": [
    {
      "translation": "Musa chose seventy men from his people for Our appointed time and when the earthquake seized them he said, 'My Lord, if You had willed, You could have destroyed them previously and me as well. Would you destroy us for what the fools among us did? It was only a trial from You by which You misguided those You willed and guided those You willed. You are our Protector so forgive us and have mercy on us. You are the Best of Forgivers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses chose seventy of his people for the appointment (on Mount Sinai). When they arrived they were seized by a tremor. (Moses) said: \"O Lord, if You had so pleased You could have annihilated them and me before this. Will You destroy us for something the foolish among us have done? This is but a trial from You whereby You will lead whom You will astray and guide whom You please. You are our saviour, so forgive us and have mercy on us, for You are the best of forgivers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And out of his people Moses singled out seventy men for Our appointment. Then, when violent shaking seized them, he addressed his Lord: 'Had You willed, O my Lord, You could have destroyed them and me long ago. Will You destroy us for what the fools amongst us did? That was nothing but a trial from You whereby You mislead whom You will and guide whom You will. You alone are our guardian. Forgive us, then, and have mercy upon us. You are the best of those who forgive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses selected seventy men from his people to attend Our appointment. (In Our presence). When an earthquake jolted them to death, Moses said, \"Lord, had You wanted to destroy them, why did You not destroy them and me before. Are You destroying us for what the fools among us have done? This (destruction) is only a trial through which You cause some to go astray and guide others. You are our Guardian. Forgive us and have mercy on us; You are the best of those who forgive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moosa chose seventy men from his people for Our promise; therefore when the earthquake seized them, he submitted, “My Lord! If You had willed You could have destroyed them and me, even earlier! Will You destroy us for the deeds which the ignorant among us did? That is not but Your testing us; with it You send astray whomever You will and guide whomever You will; You are our Master, so forgive us and have mercy on us, and You are the Best of the Forgiving.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa chose out of his people seventy (of the best) men for Our appointed time and place of meeting, and when they were seized with a violent earthquake, he said: \"O my Lord, if it had been Your Will, You could have destroyed them and me before; would You destroy us for the deeds of the foolish among us It is only Your trial by which You lead astray whom You will, and keep guided whom You will. You are our protector, so forgive us and have mercy on us: for You are the best of those who forgive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa chose out of his people seventy men for Our appointment; so when the earthquake overtook them, he said: My Lord! if Thou hadst pleased, Thou hadst destroyed them before and myself (too); wilt Thou destroy us for what the fools among us have done? It is naught but Thy trial, Thou makest err with it whom Thou pleasest and guidest whom Thou pleasest: Thou art our Guardian, therefore forgive us and have mercy on us, and Thou art the best of the forgivers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses chose of his people seventy men for Our appointed time; and when the earthquake seized them, he said, 'My Lord, hadst Thou willed Thou wouldst have destroyed them before, and me. Wilt Thou destroy us for what the foolish ones of us have done? It is only Thy trial, whereby Thou leadest astray whom Thou wilt, and guidest whom Thou wilt. Thou art our Protector; so forgive us, and have mercy on us, for Thou art the best of forgivers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses chose of his people seventy men for Our appointed tryst and, when the trembling came on them, he said: My Lord! If Thou hadst willed Thou hadst destroyed them long before, and me with them. Wilt thou destroy us for that which the ignorant among us did? It is but Thy trial (of us). Thou sendest whom Thou wilt astray and guidest whom Thou wilt: Thou art our Protecting Friend, therefore forgive us and have mercy on us, Thou, the Best of all who show forgiveness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses chose from his people seventy men for Our appointment. When they were seized with violent quaking, he prayed, \"O my Lord! If it had been Your will, You could have destroyed both them and me long ago. But would You destroy us for the deeds of the foolish ones among us? This is no more than Your trial: by it You cause whom You will to stray, and You lead whom You will to the right path. You are our Protector. Forgive us, therefore, and have mercy on us, for You are the best of those who forgive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa singled out of his people seventy men for Our appointment, then when the earthquake laid hold of them he said. O my Lord! hadst Thou willed, Thou wouldst have destroyed them afore and me also. wilt Thou destroy Us for that which the foolish ones amongst us have done! lt is only thy trial, whereby thou sendest astray whomsoever Thou wilt and keepest guided whomsoever Thou wilt. Thou art our patron. So forgive us Thou and have mercy on us; and thou art the Best of the forgivers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses chose seventy men from his people for Our tryst, and when the earthquake seized them, he said, ‘My Lord, had You wished, You would have destroyed them and me before. Will You destroy us because of what the fools amongst us have done? It is only Your test, by which You lead astray whomever You wish and guide whomever You wish. You are our master, so forgive us and have mercy on us, for You are the best of those who forgive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses chose seventy of his people for Our place of meeting: when they were seized with violent quaking, he prayed: \"O my Lord! if it had been Thy will Thou couldst have destroyed, long before, both them and me: wouldst Thou destroy us for the deeds of the foolish ones among us? this is no more than Thy trial: by it Thou causest whom Thou wilt to stray, and Thou leadest whom Thou wilt into the right path. Thou art our Protector: so forgive us and give us Thy mercy; for Thou art the best of those who forgive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Musa (Moses) chose out of his people seventy (of the best) men for Our appointed time and place of meeting, and when they were seized with a violent earthquake, he said: \"O my Lord, if it had been Your Will, You could have destroyed them and me before; would You destroy us for the deeds of the foolish ones among us? It is only Your Trial by which You lead astray whom You will, and keep guided whom You will. You are our Wali (Protector), so forgive us and have Mercy on us, for You are the Best of those who forgive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Moses chose from among his nation seventy men for Our appointment, and when the quake seized them, Moses said: 'My Lord, had it been Your Will, You would have destroyed them before, and me. Will You destroy us for that which the fools amongst us did? It is only Your trial by which You leave in error whom You will, and guide whom You will. You alone are our Guardian. Forgive us and have mercy on us, You are the Best of those who forgive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses chose from his people seventy men for Our appointment. When the tremor shook them, he said, “My Lord, had You willed, You could have destroyed them before, and me too. Will you destroy us for what the fools among us have done? This is but Your test—with it You misguide whomever You will, and guide whomever You will. You are our Protector, so forgive us, and have mercy on us. You are the Best of Forgivers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Moses chose from his people seventy men for Our appointment. And when the earthquake seized them, he said, \"My Lord, if You had willed, You could have destroyed them before and me [as well]. Would You destroy us for what the foolish among us have done? This is not but Your trial by which You send astray whom You will and guide whom You will. You are our Protector, so forgive us and have mercy upon us; and You are the best of forgivers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:155] And Moses chose of his people seventy men, from among those who had not worshipped the calf, by God’s command, for Our appointed time, that is, for the time at which We promised him that they should come and apologise for their comrades’ worship of the calf. He [Moses] then departed with them; but when the Trembling, a violent earthquake, seized them, Ibn ‘Abbās said, ‘[That earthquake was] because they did not separate themselves from their people when the latter took to worshipping the calf’; he [Ibn ‘Abbās] added, ‘These [people] were not the same ones who asked to see God and were struck by the thunderbolt [cf. Q. 2:55]’, he, Moses, said, ‘My Lord, had You willed You would have destroyed them long before, that is, before my departure with them, so that the Children of Israel might see this and not make [false] accusations against me, and me [with them]. Will You destroy us for what the foolish ones among us have done? (this interrogative is meant as a plea for compassion, in other words, ‘Do not punish us for the sins of others’). It, that is, the trial which the ignorant ones underwent, is but Your trial, Your test, whereby You send astray whom You will, to lead stray, and guide whom You will, to guide. You are our Protector, looking after our affairs, so forgive us and have mercy on us, for You are the Best of all who show forgiveness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطفت جملة { واختار موسى } على جملة : { واتخذ قوم موسى } \\[ الأعراف : 148 \\] عطَف القصة على القصة : لأن هذه القصة أيضاً من مواقع الموعظة والعبرة بين العبَر المأخوذة من قصة موسى مع بني إسرائيل ، فإن في هذه عبرة بعظمة الله تعالى ورحمته ، ودعاء موسى بما فيه جُماع الخيرات والبشارة بمحمد صلى الله عليه وسلم وملاك شريعته .والاختيار تمييز المرغوب من بين ما هو مخلوط من مرغوب وضده ، وهو زنة افتعال من الخير صيغ الفعل من غير دلالة على مطاوعة لفعل ( خار ).وقوله : { سبعين رجلا } بدل من { قَوْمَه } بدلَ بعض من كل ، وقيل إنما نُصب قوَمه على حذف حرف الجر ، والتقدير : اختار من قومه ، قالوا وحذْفُ الجار من المتعلق الذي هو في رتبة المفعول الثاني شائِع في ثلاثة أفعال : اختار ، واستغفر وأمر ، ومنه أمْرُتك الخير وعلى هذا يكون قوله : { سبعين } مفعولاً أول . وأيّاً مَّا كان فبناء نظم الكلام على ذكر القوم ابتداء دون الاقتصار على سبعين رجلاً اقتضاه حال الإيجاز في الحكاية ، وهو من مقاصد القرآن .وهذا الاختيار وقع عندما أمره الله بالمجيىء للمناجاة التي تقدم ذكرها في قوله تعالى : { وواعدنا موسى ثلاثين ليلة } \\[ الأعراف : 142 \\] الآية ، فقد جاء في التوراة في الإصحاح الرابع والعشرين من سفر الخروج : إن الله أمر موسى أن يصعد طور سينا هو وهارون و ( ناداب ) و ( أبيهو ) و ( يشوع ) وسبعون من شيوخ بني إسرائيل ويكون شيوخ بني إسرائيل في مكان معين من الجبل ويتقد موسى حتى يدخل في السحاب ليسمع كلام الله وأن الله لما تجلى للجبل ارتجف الجبل ومكث موسى أربعين يوماً . وجاء في الإصحاح الثاني والثلاثين والذي يعده ، بعدَ ذكر عبادتهم العجل وكسر الألواح ، أن الله أمر موسى بأن ينحت لوحين من حجر مثل الأولين ليكتب عليهما الكلمات العشر المكتوبة على اللوحين المنكسرين وأن يصعد إلى طور سينا وذكرتْ صفة صعود تقارب الصفة التي في الإصحاح الرابع والعشرين ، وأن الله قال لموسى من أخطأ أمحُوه من كتابي ، وأن موسى سجد لله تعالى واستغفر لقومه قلة امتثالهم وقال فإن عفرْتَ خطيئتهم وإلا فامحُني من كتابك . وجاء في الإصحاح التاسع من سفر التثنية : أن موسى لما صعد الطور في المناجاة الثانية صام أربعين يوماً وأربعين ليلة لا يأكل طعاماً ولا يشرب ماء استغفاراً لخطيئة قومه وطلباً للعفو عنهم .فتبين مما في التوراة أن الله جعل لموسى ميقاتين للمناجاة ، وأنه اختار سبعين رجلاً للمناجاة الأولى ولم تَذْكر اختيارهم للمناجاة الثانية ، ولما كانت المناجاة الثانية كالتكملة للأولى تعيّن أن موسى استصحب معه السبعين المختارين ، ولذلك وقعت فيها الرجفة مثل المرة الأولى ، ولم يذكر القرآن أن الرجفة أخذتهم في المرة الأولى ، وإنما ذكر أن موسى خَرَّ صعقاً ، ويتعين أن يكون السبعون قد أصابهم ما أصاب موسى لأنهم كانوا في الجبل أيضاً ، وذكر الرجفة في المرة الثانية ولم تذكرها التوراة .والضمير في أخذتهم الرجفة للسبعين . فالظاهر أن المراد في هذه الآية هو حكاية حال ميقات المناجاة الثانية التي وقع فيها الاستغفار لقومه ، وأن الرجفة المحكية هنا رجفة أخذتهم مثل الرجفة التي أخذتهم في المناجاة الأولى ، لأن الرجفة تكون من تجلي أثر عظيم من آثار الصفات الإلهية كما تقدم ، فإن قول موسى { اتهلكنا بما فعل السفهاء منا } يؤذن بأنه يعني به عبادتهم العجل ، وحضورَهم ذلك . وسكوتهم ، وهي المعنيُ بقوله : { إن هي إلا فتنتك } وقد خشي موسى أن تلك الرجفة مقدمة عذاب كما كان محمد صلى الله عليه وسلم يخشى الريح أن يكون مبدأ عذاب .ويجوز أن يكون ذلك في المناجاة الأولى وأن قوله : { بما فعل السفهاء منا } يعني به ما صدر من بني إسرائيل من التصلب قبل المناجاة ، كقولهم { لن نصبر على طعام واحد } \\[ البقرة : 61 \\] ، وسؤالهم رؤية الله تعالى . لكن الظاهر أن مثل ذلك لا يطلق عليه ( فَعَل ) في قوله : { بما فعل السفهاء منا }. والحاصل أن موضع العبرة في هذه القصة هو التوقي من غضب الله ، وخوف بطشه ، ومقامُ الرسل من الخشية ، ودعاء موسى ، إلخ .وقد صيغ نظم الكلام في قوله : { فلما أخذتهم الرجفة } على نحو ما صيغ عليه قوله : { ولما رجع موسى إلى قومه غضبانَ أسفا } \\[ الأعراف : 150 \\] كما تقدم .والأخذ مجاز في الإصابة الشديدة المتمكنة تمكن الآخذ من المأخوذ .و ( لو ) في قوله : { لو شئت أهلكتهم } يجوز أن تكون مستعملة في التمني وهو معنى مجازي ناشىء من معنى الامتناع الذي هو معنى ( لو ) الأصلي ومنه قول المثل ( لو ذات سوار لطمتني ) إذ تقدير الجواب . لو لطمتني لكان أهون علي ، وقد صرح بالجواب في الآية وهو { شئت أهلكتهم } أي ليتك أردت إهلاكهم أي السبعين الذين معه . فجملة أهلكتهم بدل اشتمال من جملة { شئت } من قبل خطيئة القوم التي تسبب عنها الرجوع إلى المناجاة .وعلى هذا التقدير في ( لو ) لا يكون ، في قوله { أهلكتهم } حذف اللام التي من شأنها أن تقترن بجواب ( لو ) وإنما قال : { أهلكتهم } وإياي ولم يقل : أهلكتنا ، للتفرقة بين الإهلاكين لأن إهلاك السبعين لأجل سكوتهم على عبادة العجل ، وإهلاك موسى ، قد يكون لأجل أن لا يشهد هلاك القوم ، قال تعالى :{ فلما جاء أمرنا نجينا هوداً } \\[ هود : 58 \\] الآية ونظائرها كثيرة ، وقد خشي موسى أن الله يهلك جميع القوم بتلك الرجفة لأن سائر القوم أجدر بالإهلاك من السبعين ، وقد أشارت التوراة إلى هذا في الإصحاح «فرجع موسى إلى الله وقال إن الشعب قد أخطأ خطيئة عظيمة وصنعوا لأنفسهم آلهة فان غفرت لهم خطيئتهم وإلا فامحني من كتابك الذي كتبت . فقال الله لموسى من أخطأ إليّ أمحوه من كتابي» فالمحو من الكتاب هو محو تقدير الله له الحياةَ محوَ غضب ، وهو المحكي في الآية بقوله { لو شئت أهلكتهم من قبل وإياي أتهلكنا بما فعل السفهاء منا } وقد خشي موسى أن تكون تلك الرجفة إمارة غضب ومقدمة إهلاك عقوبة على عبادتهم العجل ، فلذلك قال { اتهلكنا بما فعل السفهاء منا } فالسفهاء هم الذين عبدوا العجل وسمي شركهم سفهاً؛ لأنه شرك مشوب بخسة عقل إذ جعلوا صورة صنعوها بأنفسهم إلهاً لهم .ويجوز أن يكون حرف ( لو ) مستعملاً في معناه الأصلي : من امتناع جوابه لامتناع شرطه ، فيتجه أن يتساءل عن موجب حذف اللام من جواب ( لو ) ولم يقل : لأهلكتهم مع أن الغالب في جوابها الماضي المثبت أن يقترن باللام فحذف اللام هنا لنكتة أن التلازم بين شرط لو وجوابها هنا قوي لظهور أن الإهلاك من فعل الله وحده فهو كقوله تعالى : { لو نشاء جعلناه أجاجاً } سورة الواقعة ( 70 ) وسيأتي بيانه . ويكون المعنى اعترافاً بمنة العفو عنهم فيما سبق ، وتمهيداً للتعريض بطلب العفو عنهم الآن ، وهو المقصود من قوله { أتهلكنا بما فعل السفهاء } أي أنك لم تشأ إهلاكهم حين تلبسوا بعبادة العجل فلا تهلكهم الآن .والاستفهام في قوله : { أتهلكنا } مستعمل في التفجع أي : أخشى ذلك ، لأن القوم استحقوا العذاب ويخشى أن يشمل عذابُ الله من كان مع القوم المستحقين وإن لم يشاركهم في سبب العذاب ، كما قال : { واتقوا فتنة لا تصيبن الذين ظلموا منكم خاصة } \\[ الأنفال : 25 \\] وفي حديث أم سلمة أنها قالت : \" يا رسول الله أنهلك وفينا الصالحون قال نعم إذا كثر الخبثُ \" وفي حديث آخر ، \" ثم يحشرون على نياتهم \" وقد خشي موسى سوء الظنة لنفسه ولأخيه وللبراء من قومه أن يُظنهم الأمم التي يبلغها خبرهم أنهم مجرمون .وإنما جمع الضمير في قوله : { أتهلكنا } لأن هذا الإهلاك هو الإهلاك المتوقع من استمرار الرجفة ، وتوقعه واحد في زمن واحد ، بخلاف الإهلاك المتقدم ذكره فسببه مختلف فناسب توزيع مفعوله .وجملة : { أتهلكنا } مستأنفة على طريقة تقطيع كلام الحزين الخائف السائل . وكذلك جملة : { إن هي إلا فتنتك } وجملة { أنت ولينا }.وضمير { إن هي } راجع إلى ما فعل السفهاء لأن ما صْدقَ ما فعل السفهاء هو الفتنة ، والمعنى : ليست الفتنةُ الحاصلة بعبادة العجل إلا فتنة منك ، أي من تقديرك وخلْق أسباببِ حدوثها ، مثل سخافة عقول القوم ، وإعجابهم بأصنام الكنعانيين ، وعيبة موسى ، وليننِ هارون ، وخشيته من القوم ، وخشية شيوخ إسرائيل من عامتهم ، وغير ذلك مما يعلمه الله وأيقن موسى به إيقاناً إجمالياً .والخبر في قوله : { إن هي إلا فتنتك } الآية : مستعمل في إنشاء التمجيد بسعة العلم والقدرة ، والتعريض بطلب استبقائهم وهدايتهم ، وليس مستعملاً في الاعتذار لقومه بقرينة قوله : { تضل بها من تشاء } الذي هو في موضع الحال من { فتنتك } فالإضلال بها حال من أحْوالها .ثم عرَّض بطلب الهداية لهم بقوله : { وتهدي من تشاء } والمجرور في قوله { بها } متعلق بفعل { تضل } وحده ولا يتنازعه معه فعل { تهدي } لأن الفتنة لا تكون سبب هداية بقرينة تسميتها فتنة ، فمن قدر في التفسير : وتهدي بها أو نحوه ، فقد غفل .والباء : إما للملابسة ، أي تضل من تشاء ملابساً لها ، وإما للسببية ، أي تضل بسبب تلك الفتنة ، فهي من جهة فتنة ، ومن جهة سبب ضلال .والفتنة ما يقع به اضطراب الأحوال ، ومرجها ، وتشتت البال ، وقد مضى تفسيرها عند قوله تعالى : { وما يعلّمان من أحد حتى يقولا إنما نحن فتنة } في سورة البقرة ( 102 ). وقوله : { وحسبوا أن لا تكون فتنة } في سورة العقود ( 71 ) وقوله : { ثم لم تكن فتنتهم إلا أن قالوا والله ربنا ما كنا مشركين } في سورة الأنعام ( 23 ).والقصد من جملة : { أنت ولينا } الاعتراف بالانقطاع لعبادة الله تعالى ، تمهيداً لمطلب المغفرة والرحمة ، لأن شأن الولي أن يرحم مولاه وينصره .والولي : الذي له وَلاية على أحد ، والوَلايةِ حلف أو عتق يقتضي النصرة والإعانة ، فإن كان من جانبين متكافئين فكلا المتعاقدين يقال له مَولى ، وإن كان أحد الجانبين أقوى قيل للقوي ( ولي ) وللضعيف ( مَولى ) وإذ قد كانت الولاية غير قابلة للتعدد ، لأن المرء لا يتولى غيرَ مواليه ، كان قوله : { أنتَ ولينا } مقتضياً عدم الانتصار بغير الله . وفي صريحه صيغة قصر .والتفريع عن الولاية في قوله : { فاغفر لنا } تفريع كلام على كلام وليس المراد أن الولي يتعين عليه الغفران .وقدم المغفرة على الرحمة لأن المغفرة سبب لرحمات كثيرة ، فإن المغفرة تنهية لغضب الله المترتب على الذنب ، فإذا انتهى الغضب تسنى أن يخلفه الرضا . والرضا يقتضي الإحسان .و { وخيرُ الغافرين } الذي يغفر كثيراً ، وقد تقدم قريب منه في قوله تعالى : { بل الله مولاكم وهو خير الناصرين } في سورة آل عمران ( 150 ).وإنما عطف جملة : { وأنت خير الغافرين } لأنه خبر في معنى طلب المغفرة العظيمة ، فعطف على الدعاء ، كانه قيل : فاغفر لنا وارحمنا واغفر لنا جميع ذنوبنا ، لأن الزيادة في المغفرة من آثار الرحمة .\n\n",
      "translations": [
        {
          "translation": "(And Moses chose of his people seventy men for Our appointed tryst and, when the trembling came on them) and killed them, (he said: My Lord! If Thou hadst willed Thou hadst destroyed them long before) before this day, (and me with them) when I killed the Copt. (Wilt Thou destroy us for that which the ignorant among us did) when they worshipped the calf-here Moses thought they were destroyed because of their worship of the calf? (It is but Thy trial (of us)) Your affliction upon us. (Thou sendest whom Thou wilt astray and guidest whom Thou wilt) to avoid the sedition. (Thou art our Protecting Friend) You have better right to have mercy on us, (therefore forgive us and have mercy on us) and do not punish us, (Thou, the Best of all who show forgiveness) overlook sins.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر يا أكمل الرسل لمن تبعك قصة الكليم حين { ٱخْتَارَ مُوسَىٰ قَوْمَهُ } أي: اختار وانتخب موسى ب إذن منا من قومه { سَبْعِينَ رَجُلاً لِّمِيقَاتِنَا } فانتخب من كل سبط من الأسباط الاثني عشر ستة نفر فزاد على المبلغ اثنين\n فأمر موسى بتقاعدهما فتخاصموا وتشاجروا في تعيينهما\n إلى أن قال موسى: إن أجر من قعد مثل أجر من صعد\n بل أكثر فقعد كالب ويوشع\n وذهب موسى معهم\n فلما دخلوا شعب الجبل وأرادوا الصعود غشيته غمام كثيف مظلم\n قد خلوا الغمام وخروا سجداً\n فسمعوا يتكلم سبحانه مع موسى يأمره وينهاه\n وهو يناجي ربه\n\n\nفلمَّا تم الكلام وانكشف الغمام قالوا بعدما سمعوا كلامه سبحانه مستكشفين عن ذاته: لن نؤمن لك حتى نرى الله جهرةً ظاهرة\n منكشفة ذاته لأبصارنا\n كما انكشف كلامه لأسماعنا\n فأخذتهم الرجفة\n بسبب سؤالهم هذا { فَلَمَّا أَخَذَتْهُمُ ٱلرَّجْفَةُ } الصاعة النازلة من قهر الله وغضبه\n لطلبهم ما ليس في وسعهم واستعدادهم { قَالَ } موسى مشتكياً إلى الله: { رَبِّ لَوْ شِئْتَ أَهْلَكْتَهُمْ } أي: لو تعلقت مشيتئك لإهلاكهم لِمَ لَمْ تهلكهم { مِّن قَبْلُ } أي: من قبل إسماعهم كلامك؟ { وَإِيَّايَ } أيضاً\n أي: لِمَ لَمْ تهلكني\n حتى لاتنسب إليَّ إهلاكهم عند عوام بني إسرائيل وتشأمهم بي من غاية اضطرابه؟ { أَتُهْلِكُنَا } بالصاعقة الشديدة يا رب { بِمَا فَعَلَ } أي: بسبب سؤال سائل { ٱلسُّفَهَآءُ مِنَّآ } صدر عنهم هفوة بلا علم لهم بعظمتك وجلالك وحق قدرك وعزك\n\nبل { إِنْ هِيَ } أي: هل هي { إِلاَّ فِتْنَتُكَ } اختبارك\n ابتلاؤك إياهم\n بأن أسمعت لهم كلامك فأوقعتهم بهذه الفتنة\n إذ أنت { تُضِلُّ بِهَا } أي: بفتنتك { مَن تَشَآءُ } من عبادك\n بأن اجترءوا بعد انكشافك عليهم نوع انكشاف إلى انكشاف أعلى منه وأجلى فضلوا وكفوا بلا علم لهم إلى مقتضى استعدادهم { وَتَهْدِي } بها { مَن تَشَآءُ } بأن سكتوا عن السؤال مطلقاً\n وفوضوا أمورهم كلها إليك ولا يسألون عنك ما لم يستأذنوا منك\n والكل بيدك { أَنتَ وَلِيُّنَا } ومولي أمورنا\n ومولى نعمنا { فَٱغْفِرْ لَنَا } ما جرى علينا من المعاصي والآثام { وَٱرْحَمْنَا } برحمتك الواسعة تفضلاً علينا وامتناناً\n واعف عنا بفضلك وجودك { وَأَنتَ خَيْرُ ٱلْغَافِرِينَ } [الأعراف: 155] الساترين ذنوب العصاة المسرفين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n{ وَٱخْتَارَ مُوسَىٰ قَوْمَهُ سَبْعِينَ رَجُلاً لِّمِيقَاتِنَا فَلَمَّا أَخَذَتْهُمُ ٱلرَّجْفَةُ قَالَ رَبِّ لَوْ شِئْتَ أَهْلَكْتَهُمْ مِّن قَبْلُ وَإِيَّايَ أَتُهْلِكُنَا بِمَا فَعَلَ ٱلسُّفَهَآءُ مِنَّآ إِنْ هِيَ إِلاَّ فِتْنَتُكَ تُضِلُّ بِهَا مَن تَشَآءُ وَتَهْدِي مَن تَشَآءُ أَنتَ وَلِيُّنَا فَٱغْفِرْ لَنَا وَٱرْحَمْنَا وَأَنتَ خَيْرُ ٱلْغَافِرِينَ وَٱكْتُبْ لَنَا فِي هَـٰذِهِ ٱلدُّنْيَا حَسَنَةً وَفِي ٱلآخِرَةِ إِنَّا هُدْنَـآ إِلَيْكَ\n\n\n } يقول الحقّ جلّ جلاله: { واختارَ موسى قومه } من قومه { سبعين رجلاً } يعتذرون عن قومهم في عبادة العجل\n { لميقاتنا } الذي وقتنا لهم يأتون إليه\n وقيل: إن الله تعالى أمره به بأن يأتيه في سبعين من بني إسرائيل\n فاختار من كل سبط ستةً\n فزاد على السبعين اثنان\n فقال: يتخلف منكم رجلان\n فتشاجروا\n فقال: إن لِمن قعد أجر من خرج\n فقعد كالب ويوشع\n وذهب معه الباقون\n فلما دنوا من الجبل غشية غمام\n فدخل موسى بهم الغمام وخروا سُجدًا\n فسمعوه يكلم موسى\n يأمره وينهاه\n ثم انكشف الغمام\n فأقبلوا إليه\n وقالوا:\n[البَقَرَة:55]\n { فأخذتهم الرجفة } أي: الصعقة\n أو رجفة الجبل\n عقابًا لهم على قولهم\n فصعقوا منها\n يحتمل أن تكن رجفة موت أو إغماء\n والأول أظهر لقوله:\n[البَقَرَة:56]\n { فلما أخذتهُم الرّجفَةُ قال } موسى: { ربِّ لو شئتَ أهلكتَهم من قبل وإيّايَ } \n تمنى هلاكهم وهلاكه قبل ذلك الوقت\n لأنه خاف من تشغيب بني إسرائيل عليه\n إن رجع إليهم دون هؤلاء السبعين\n ربما قالوا: عرّضهم للهلاك\n أو يكون قال ذلك على وجه الاستسلام والانقياد للقضاء\n أي: لو شئت أن تُهلكنا من قبل ذلك لفعلت\n فإنا عبيدك وتحت قهرك تفعل بنا ما تشاء\n أو يكون قاله على وجه التضرع والرغبة\n أي: لو ئشت أن تهلكنا قبل اليوم لفعلت\n لكنك عافيتنا وأنقذتنا وأغرقت عدونا\n فافعل بنا الآن كما عودتنا\n وأحيي هؤلاء الذي أمتهم\n إذ ليس ببعيد من عميم إحسانك\n { أَتُهلِكُنا بما فعلَ السفهاءُ منّا } من العناد والتجاسر على طلب الرؤية\n أو بما فعل السفهاء من عبادة العجل\n { إن هي إلا فتنتُك } أي: ابتلاؤك حين أسمعتهم كلامك\n حتى طمعوا في الرؤية\n أو فتنتك لهم بأن أجريت الصوت من العجل حتى افتتنوا به\n وهذا اعتراف بالقدر\n ورجوع إلى قوله:\n[طه:85] الآية\n ولذلك قيل: إنه قال له تعالى: نعم هي فتنتي يا حكيم الحكماء\n هـ\n أي: ما هذه الأمور كلها التي صدرت من بني إسرائيل إلا فتنتك { تُضلَّ بها من تشاء } ضلالته\n باتباع المخايل\n { وتهدي من تشاء } هدايته\n فيقوي بها إيمانه\n وهو اعتذار عن فعل السفهاء فإنه كان بقضاء الله ومشيئته\n { أنت وليُّنا } القائم بأمرنا\n أو ناصرنا من الوقوع في أسباب المهالك\n { فاغفر لنا } ما قارفنا من الذنوب\n { وارحمنا } أي: اعصمنا من الوقوع في مثله\n { وأنت خير الغافرين } تغفر السيئة وتبدلها بالحسنة\n { واكتب لنا في هذه الدنيا حسنة } أي:حالة حسنة من حسن معيشة وتوفيق طاعة\n { وفي الآخرة } حسنة نعيم الجنة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "79:6",
      "similarity": 0.4230313904809267
    },
    {
      "verse": "7:78",
      "similarity": 0.32042107162284533
    },
    {
      "verse": "7:91",
      "similarity": 0.32042107162284533
    },
    {
      "verse": "29:37",
      "similarity": 0.3190740448478815
    },
    {
      "verse": "7:67",
      "similarity": 0.31689930641805003
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007155.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007155.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:155.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}