{
  "chapter": "الأعراف",
  "text": "وقطعنهم اثنتى عشرة اسباطا امما واوحينا الى موسى اذ استسقىه قومه ان اضرب بعصاك الحجر فانۢبجست منه اثنتا عشرة عينا قد علم كل اناس مشربهم وظللنا عليهم الغمم وانزلنا عليهم المن والسلوى كلوا۟ من طيبت ما رزقنكم وما ظلمونا ولكن كانوا۟ انفسهم يظلمون",
  "translations": [
    {
      "translation": "We divided them up into twelve tribes - communities. We revealed to Musa, when his people asked him for water: 'Strike the rock with your staff.' Twelve fountains flowed out from it and all the people knew their drinking place. And We shaded them with clouds and sent down manna and quails to them: 'Eat of the good things We have provided you with.' They did not wrong Us; rather it was themselves they wronged.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We divided them into twelve (different) tribes. When his people asked for water, We said to Moses: \"Strike the rock with your staff;\" and behold, twelve springs of water gushed forth, so that each of the tribes had a place of its own to drink; and We made the clouds spread shade over them and sent for them manna and quails (and said): \"Eat of the good things We have provided for you.\" But (by disobeying) they did not harm Us, they harmed themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We divided them into twelve tribes, forming them into communities. When his people asked Moses for water We directed him: 'Smite the rock with your rod.' Then twelve springs gushed forth from the rock and every people knew their drinking-places. And We caused thick clouds to provide them shade, and We sent down upon them manna and quails, saying: 'Eat of the clean things that We have provided you.' They wronged not Us, but it was themselves that they wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We divided the descendants of Israel into twelve tribes and told Moses to strike the rock with his staff to let twelve fountains gush out therefrom; his people had asked him to supply them with water. The twelve flowing springs were divided among them (a spring for each tribe) and each tribe knew its drinking place well. We provided them with shade from the clouds, sent down manna and quails to them for food, and told them to eat the pure things which We had given them. They did not do injustice to Us but they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We divided them into twelve tribes, as separate groups; and when his people asked him for water, We revealed to Moosa, “Strike the rock with your staff”; so twelve springs gushed forth from it; each group recognised its drinking-place; and We made the clouds a canopy over them and sent down the Manna and the Salwa (birds) on them; “Eat of the good things we have provided you”; and they did not wrong Us in the least, but they used to wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We divided them into twelve tribes (as distinct) nations. We revealed to Musa when his people asked him for water (saying): \"Strike the stone with your stick,\" and there gushed forth out of it twelve springs, each group knew its own place for water. We shaded them with the clouds and sent down upon them the manna and the quail (saying): \"Eat of the good things with which We have provided you.\" They harmed Us not but they used to harm themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We divided them into twelve tribes, as nations; and We revealed to Musa when his people asked him for water: Strike the rock with your staff, so outnowed from it twelve springs; each tribe knew its drinking place; and We made the clouds to give shade over them and We sent to them manna and quails: Eat of the good things We have given you. And they did not do Us any harm, but they did injustice to their own souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We cut them up into twelve tribes, nations. And We revealed to Moses, when his people asked him for water: 'Strike with thy staff the rock'; and there gushed forth from it twelve fountains all the people knew now their drinking-place. And We outspread the cloud to overshadow them, and We sent down manna and quails upon them: 'Eat of the good things wherewith We have supplied you.' And they worked no wrong upon Us, but themselves they wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We divided them into twelve tribes, nations; and We inspired Moses, when his people asked him for water, saying: Smite with thy staff the rock! And there gushed forth therefrom twelve springs, so that each tribe knew their drinking-place. And we caused the white cloud to overshadow them and sent down for them the manna and the quails (saying): Eat of the good things wherewith we have provided you. They wronged Us not, but they were wont to wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We divided them up into twelve tribes, each a whole community, and We revealed Our will to Moses, when his people asked for water, saying, \"Strike the rock with your staff.\" Twelve springs gushed from it and each tribe knew its drinking place. We caused the clouds to draw their shadow over them and sent down for them manna and quails, saying, \"Eat the good things We have given you.\" They did not wrong Us; rather it was themselves they wronged.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We cut them up into twelve tribes as communities. And We revealed unto Musa, when his people asked him for drink: Smite the rock with thy rod. Then gushed forth therefrcm twelve springs: every people already knew their drinking-places. And We shaded them with thick clouds, and We sent down upon them the manna and the quails, saying: eat of the clean things wherewith We have provided you. And they wronged not Us, but themselves they were wont to wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We split them up into twelve tribal communities, and We revealed to Moses, when his people asked him for water, [saying], ‘Strike the rock with your staff,’ whereat twelve fountains gushed forth from it. Every tribe came to know its drinking-place. And We shaded them with clouds, and We sent down to them manna and quails: ‘Eat of the good things We have provided you.’ And they did not wrong Us, but they used to wrong [only] themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We divided them into twelve tribes or nations. We directed Moses by inspiration, when his (thirsty) people asked him for water: \"Strike the rock with thy staff\": out of it there gushed forth twelve springs: Each group knew its own place for water. We gave them the shade of clouds, and sent down to them manna and quails, (saying): \"Eat of the good things We have provided for you\": (but they rebelled); to Us they did no harm, but they harmed their own souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We divided them into twelve tribes (as distinct) nations. We directed Musa (Moses) by inspiration, when his people asked him for water, (saying): \"Strike the stone with your stick\", and there gushed forth out of it twelve springs: each group knew its own place for water. We shaded them with the clouds and sent down upon them Al-Manna and the quails (saying): \"Eat of the good things with which We have provided you.\" They harmed Us not but they used to harm themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We divided them into twelve tribes, each a nation. And when his people demanded drink, We revealed to Moses: 'Strike the rock with your staff' Thereupon twelve springs gushed from the rock and each tribe knew its drinkingplace. We caused the clouds to cast their shadow over them, and sent down for them manna and quails, saying: 'Eat of the good things We have provided for you' Indeed, they did Us no wrong, but they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We divided them into twelve tribal communities. And We inspired Moses, when his people asked him for something to drink: “Strike the rock with your staff.” Whereupon twelve springs gushed from it. Each group recognized its drinking-place. And We shaded them with clouds, and We sent down upon them manna and quails: “Eat of the good things We have provided for you.” They did not wrong Us, but they used to wrong their own selves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We divided them into twelve descendant tribes [as distinct] nations. And We inspired to Moses when his people implored him for water, \"Strike with your staff the stone,\" and there gushed forth from it twelve springs. Every people knew its watering place. And We shaded them with clouds and sent down upon them manna and quails, [saying], \"Eat from the good things with which We have provided you.\" And they wronged Us not, but they were [only] wronging themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:160] And We divided them, We separated the Children of Israel, into twelve (ithnatay ‘asharata is a circumstantial qualifier) tribes (asbātan substitutes for this [previous circumstantial qualifier]) communities (umaman substitutes for the preceding [asbātan, ‘tribes’). And We revealed to Moses, when his people asked him for water, in the wilderness, [saying]: ‘Strike the rock with your staff’, and he struck it, and there gushed forth, burst forth, from it twelve fountains, equal to the number of tribes, each people, [each] tribe among them, now knew their drinking-place. And We made the cloud overshadow them, in the wilderness, from the heat of the sun, and We sent down to them manna and quails — which are [respectively, a type of citrus] turunjabīn, and the quail and We said to them: ‘Eat of the good things We have provided for you.’ And they did not wrong Us, but they wronged themselves.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(We divided them into twelve tribes, nations) tribe by tribe: nine tribes and a half towards the East, where the sun rises, beyond China, on the river al-Raml (also called Jordan), and two tribes and a half all over the world; (and We inspired Moses) We commanded Moses, (when his people asked him for water) in the wilderness, (saying: Smite with thy staff) which is with you (the rock! And there gushed forth therefrom) from the rock (twelve springs) rivers, (so that each tribe knew their drinking place) from the river. (And we caused the white cloud to overshadow them) in the wilderness: in the day it protected them from the sun and in the night, it lit for them like a lamp (and sent down for them the manna and the quails) in the wilderness ((saying): Eat of the good things wherewith We have provided you): the manna and the quails. (They wronged Us not) they did not hurt or harm Us because of what they committed, (but they were wont to wrong themselves) to harm and hurt themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱنبَجَسَتْ } معناه انفَجرتْ\n\n\n\n\nوقوله تعالى: { أَسْبَاطاً } معناهُ قَبَائلُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Then it burst forth}, its meaning is that it erupted.\n\n\nAnd His saying, {Asbaatan}, means the tribes.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "ثمَّ قال سبحانه: { وَقَطَّعْنَاهُمُ } أي: جزأناهم وصيرناهم { ٱثْنَتَيْ عَشْرَةَ } أضراباً على عدد أبناء يعقوب { أَسْبَاطاً } لهم كل حزبٍ سبط لواحد منهم؛ لذلك صاروا { أُمَماً } مختلفة، وإن كان الكل مسمى ببني إسرائيل { وَ } من جملة نعمنا إياهم: إنَّا { أَوْحَيْنَآ } من مقام جودنا { إِلَىٰ مُوسَىٰ إِذِ ٱسْتَسْقَاهُ قَوْمُهُ } أي: حين صاروا تائهين حائرين، عطاشاً هائمين { أَنِ ٱضْرِب } يا موسى { بِّعَصَاكَ } التي استعنت بها في الأمور { ٱلْحَجَرَ } الذي بين يديك فضرب { فَٱنبَجَسَتْ } أي: خرجت وجرت على الفور بلا تراخ ومهلة { مِنْهُ ٱثْنَتَا عَشْرَةَ عَيْناً } جارية بضربة واحدة على عدد الأسباط والفرق؛ بحيث { قَدْ عَلِمَ كُلُّ أُنَاسٍ } من كل سبط { مَّشْرَبَهُمْ } المخصوص لهم؛ لئلا يقع الخصومة والنزاع بينهم.\n\n{ وَ } من جملة نعمنا إياهم: إنَّا { ظَلَّلْنَا عَلَيْهِمُ ٱلْغَمَامَ } أي: أمرنا بأن يظل عليهم في التيه؛ لئلا يتضرروا من شدة الحر فيستريحوا { وَ } أيضاً { أَنْزَلْنَا عَلَيْهِمُ ٱلْمَنَّ } الترنجبين لشربهم؛ تبريداً لمزاجهم { وَٱلسَّلْوَىٰ } السماني؛ لغذائهم، وقلنا لهم: { كُلُواْ مِن طَيِّبَاتِ مَا رَزَقْنَاكُمْ } لتقويم مزاجكم { وَمَا ظَلَمُونَا } أولئك الخارجون عن أوارمنا { وَلَـٰكِن كَانُوۤاْ أَنْفُسَهُمْ يَظْلِمُونَ } [الأعراف: 160] أي: يظلمون أنفسهم بما اقترفوا من المعاصي والآثام ويلقونها بذلك في عذاب الدنيا والآخرة، ومع قبح صنيعهم معنا راعيناهم وأنعمنا عليهم.\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { أسباطًا }: بدل لا تمييز لأن تمييز العدد يكون مفردًا، والتمييز محذوف، أي: فرقة أسباطًا. وقال الزمخشري: يصح تمييزًا لأن كل قبيلة أسباطٌ لا سبط. هـ. فكأنه قال: وقطعناهم اثنتي عشر سبطًا سبطا. والسبط في بني إسرائيل كالقبيلة عند العرب، و { أُممًا }: بدل بعد بدل على الأول، وعلى الثاني بدل من أسباط. يقول الحقّ جلّ جلاله: { وقطَّعناهم } أي: بني إسرائيل: فرقناهم { أثنتي عشر أسباطًا } أثني عشر سبطًا، { أُممًا }: متميزة، كل سبط أمة مستقلة، { وأوحينا إلى موسى إذ استسقاه قومه } في التيه، { أن اضرب بعصاك الحجر فانبجَست } انفجرت، إلا أن الانبجاس أخف من الانفجار، أي: فضرب فانبجست، وحذفه للإيماء إلى أن موسى لم يتوقف في الامتثال، وأن ضربه لم يكن مؤثرًا يتوقف عليه الفعل ذاته، بل سبب عادي وحكمة جارية، والفعل إنما هو القدرة الإلهية، أي: نبعت { منه اثنتا عشرةَ عينًا قد علم كلُّ أُناس } كل سبط { مشربهم وظلّلنا عليهم الغمام } لتقيهم من حرّ الشمس، { وأنزلنا عليهم المنَّ والسلوى } ، وقلنا لهم: { كلوا من طيبات ما رزقناكم وما ظلمونا ولكن كانوا أنفسهم يظلمون } سبق في سورة البقرة، وكذلك الإشارة. ثم قال: { وَإِذْ قِيلَ لَهُمُ ٱسْكُنُواْ هَـٰذِهِ ٱلْقَرْيَةَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:57",
      "similarity": 0.41504524728516623
    },
    {
      "verse": "20:80",
      "similarity": 0.27676014593640896
    },
    {
      "verse": "2:60",
      "similarity": 0.26170879690863574
    },
    {
      "verse": "2:136",
      "similarity": 0.15919495810535358
    },
    {
      "verse": "3:84",
      "similarity": 0.15873017125018316
    }
  ]
}