{
  "chapter": "الأعراف",
  "text": "فلما نسوا۟ ما ذكروا۟ به انجينا الذين ينهون عن السوء واخذنا الذين ظلموا۟ بعذابۭ بـيسۭ بما كانوا۟ يفسقون",
  "translations": [
    {
      "translation": "Then when they forgot what they had been reminded of, We rescued those who had forbidden the evil and seized those who did wrong with a harsh punishment because they were deviators.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they forgot to remember the warning, We saved those who prohibited evil, but inflicted on the wicked a dreadful punishment -- requital for their disobedience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they forgot what they had been exhorted, We delivered those who forbade evil and afflicted the wrong-doers with a grievous chastisement because of their evildoing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they (the unjust people) forgot what was preached to them, We saved the preachers from evil and afflicted the unjust for their evil deeds, with a dreadful torment.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they forgot the advices they had been given, We rescued those who forbade evil, and seized the unjust with a dreadful punishment – the recompense of their disobedience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they forgot the reminder that had been given to them, We rescued those who forbade evil, but with a severe torment We seized those who did wrong, because they used to rebel against Allah's command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they neglected what they had been reminded of, We delivered those who forbade evil and We overtook those who were unjust with an evil chastisement because they transgressed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when they forgot that they were reminded of; We delivered those who were forbidding wickedness, and We seized the evildoers with evil chastisement for their ungodliness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they forgot that whereof they had been reminded, We rescued those who forbade wrong, and visited those who did wrong with dreadful punishment because they were evil-livers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore when they forgot what they had been reminded of, We saved those who had tried to prevent the doing of evil. And We meted out a severe punishment to the transgressors because they were rebellious.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when they forgot that wherewith they had been exhorted, We delivered those who restrained from evil, and We laid hold of those who did wrong with a distressing torment for they were wont to transgress.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they forgot what they had been reminded of, We delivered those who forbade evil [conduct] and seized the wrongdoers with a terrible punishment because of the transgressions they used to commit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they disregarded the warnings that had been given them, We rescued those who forbade Evil; but We visited the wrong-doers with a grievous punishment because they were given to transgression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they forgot the remindings that had been given to them, We rescued those who forbade evil, but We seized those who did wrong with a severe torment because they used to rebel (disobey Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore, when they forgot that of which they were reminded, We saved those who were forbidding evil, and seized the evildoers with an evil punishment for that which they used to do of evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they neglected what they were reminded of, We saved those who prohibited evil, and We seized those who did wrong with a terrible punishment, because of their sinfulness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they forgot that by which they had been reminded, We saved those who had forbidden evil and seized those who wronged, with a wretched punishment, because they were defiantly disobeying.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:165] And when they forgot, when they overlooked, that whereof they had been reminded, [that for which they had been] admonished, and did not desist, We delivered those who forbade evil, and seized those who did wrong, through transgression, with a grievous, terrible, chastisement for their wickedness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when they forgot that whereof they had been reminded) and when they left what they were commanded to do, (We rescued those who forbade wrong) i.e. catching fish on the Sabbath, (and visited those who did wrong) by catching fish on the Sabbath (with dreadful) a severe (punishment because they were evil-livers) because they were transgressors.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بِعَذَابٍ بَئِيسٍ } معناهُ شَديدٌ\n ويقالُ وجيعٌ أليمٌ\n\n",
      "translations": [
        {
          "translation": " The meaning of the verse {with a severe punishment} is severe.\n\n\nIt is said that pain is severe.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَماَّ نَسُواْ } واعرضوا عن { مَا ذُكِّرُواْ بِهِ } أي: من العظة والتذكير { أَنجَيْنَا ٱلَّذِينَ يَنْهَوْنَ عَنِ ٱلسُوۤءِ } متعظين بما ذكروا به { وَأَخَذْنَا ٱلَّذِينَ ظَلَمُواْ } بالإعراض عنه { بِعَذَابٍ بَئِيسٍ } شديد فظيع { بِمَا كَانُواْ يَفْسُقُونَ } [الأعراف: 165] بسبب فسقهم وإعراضهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فلما نَسُوا ما ذُكِّروا به } أي: تركوا ما وُعظوا به ترك الناسي، { أنجينا الذين ينهون عن السوءِ وأخذنا الذين ظلموا } بالاعتياد ومخالفة أمر الله، { بعذابٍ بئيس }: شديد، من بؤس يبؤس بؤسًا، وقرىء بيْئَسٍ على وزن ضيغم، و \" بِئْس \" بالكسر والسكون، كحذر، وبيس بتخفيف الهمزة، ومعناها واحد، أي: بما عاقبناهم بالمسخ، { بما كانوا يفسقون } أي: بسبب فسقُهم\n قال ابن عباس: لا أدري ما فعل بالفرقة الساكتة؟ وقال عكرمة: لم تهلك لأنها كرهت ما فعلوه\n ورجع إليه ابن عباس وأعجبه، لأن كراهيتها تغيير المنكر في الجملة، مع قيام الفرقة الناهية به لأنه فرض كفاية\n قال تعالى: { فلما عتوا عما نُهوا عنه } تكبرًا عن ترك ما نُهوا عنه، { قلنا لهم كونوا قردة خاسئين } أذلاء صاغرين\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "59:19",
      "similarity": 0.525942673016611
    },
    {
      "verse": "5:79",
      "similarity": 0.36621097579489925
    },
    {
      "verse": "20:126",
      "similarity": 0.3387915140585758
    },
    {
      "verse": "9:67",
      "similarity": 0.3256909394996389
    },
    {
      "verse": "32:14",
      "similarity": 0.32417555874894716
    }
  ]
}