{
  "chapter": "الأعراف",
  "text": "فخلف منۢ بعدهم خلف ورثوا۟ الكتب ياخذون عرض هذا الادنى ويقولون سيغفر لنا وان ياتهم عرض مثله ياخذوه الم يؤخذ عليهم ميثق الكتب ان لا يقولوا۟ على الله الا الحق ودرسوا۟ ما فيه والدار الءاخرة خير للذين يتقون افلا تعقلون",
  "translations": [
    {
      "translation": "An evil generation has succeeded them, inheriting the Book, taking the goods of this lower world, and saying, 'We will be forgiven.' But if similar goods come to them again they still take them. Has not a covenant been made with them in the Book, that they should only say the truth about Allah and have they not studied what is in it? The Final Abode is better for those who have taqwa. Will you not use your intellect?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after them a new generation inherited the Book. They took to the things of this base world, and said: \"We shall (surely) be forgiven this.\" Yet they will accept similar things if they came their way again. Had they not been covenanted in the Book to say nothing in the name of God but the truth? And they have read this in it. The abode of the life to come is better for those who fear God. Can they not comprehend?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then others succeeded them who inherited the scriptures, and yet kept themselves occupied in acquiring the goods of this world and kept saying: 'We shall be forgiven.' And when there comes to them an opportunity for acquiring more of those goods, they seize it. Was not the covenant of the Book taken from them that they would not ascribe to Allah anything but the truth? And they have read what is in the Book and know that the abode of the Hereafter is better for the God-fearing. Do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Their descendants who inherited the Book gained (by bribery only) worthless things from the worldly life saying, \"We shall be forgiven (for what we have done). They would have even doubled such gains if they could have received more. Did they not make a covenant (with God) in the Book not to speak any thing other than the Truth about God and to study its contents well? The life hereafter is much better for the pious ones. Will you not then think?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And after them in their place, came those unworthy successors who inherited the Books – they accept the goods of this world (as bribes) and say, “We shall soon be forgiven”; and if similar goods come to them again, they would accept it; was not the covenant taken from them in the Book, that they must not relate anything to Allah except the truth, and they have studied it? And indeed the abode of the Hereafter is better for the pious; so do you not have sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after them succeeded an (evil) generation, which inherited the Book, but they chose (for themselves) the goods of this low life saying: \"(Everything) will be forgiven to us.\" And if (again) the offer of the like (evil pleasures of this world) came their way, they would (again) seize them (would commit those sins). Was not the covenant of the Book taken from them that they would not say about Allah anything but the truth And they have studied what is in it (the Book). And the home in the Hereafter is better for those who have Taqwa. Do not you then understand\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there came after them an evil posterity who inherited the Book, taking only the frail good of this low life and saying: It will be forgiven us. And if the like good came to them, they would take it (too). Was not a promise taken from them in the Book that they would not speak anything about Allah but the truth, and they have read what is in it; and the abode of the hereafter is better for those who guard (against evil). Do you not then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there succeeded after them a succession who inherited the Book, taking the chance goods of this lower world, and saying, 'It will be forgiven us'; and if chance goods the like of them come to them, they will take them. Has not the compact of the Book been taken touching them, that they should say concerning God nothing but the truth? And they have studied what is in it; and the Last Abode is better for those who are godfearing. Do you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a generation hath succeeded them who inherited the scriptures. They grasp the goods of this low life (as the price of evil-doing) and say: It will be forgiven us. And if there came to them (again) the offer of the like, they would accept it (and would sin again). Hath not the covenant of the Scripture been taken on their behalf that they should not speak aught concerning Allah save the truth? And they have studied that which is therein. And the abode of the Hereafter is better, for those who ward off (evil). Have ye then no sense?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were succeeded by generations who inherited the Scripture and took to the fleeting gains of this world, saying, \"We shall certainly be forgiven.\" If there came to them similar fleeting gains again, they would take them. Was a pledge not taken from them, written in the Scripture, that they would not say anything but the truth about God? And they have studied whatever is in it. Surely the Home of the Hereafter is better for those who fear Him. Will you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then there succeeded them a posterity; they inherited the Book taking this near world's gear and saying surety it will be forgiven, And if there cometh unto them anot her gear like thereunto they shall take it. Hath there not lain upon them the bond of the Book that they shall not say of God aught but the truth? And they have read that which is therein. And the abode of the Hereafter is better for those who fear. Understand then ye not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then they were succeeded by an evil posterity, which inherited the Book: they grab the transitory gains of this lower world, and say, ‘It will be forgiven us.’ And if similar transitory gains were to come their way, they would grab them too. Was not the covenant of the Book taken with them that they shall not attribute anything to Allah except the truth? They have studied what is in it, and [know that] the abode of the Hereafter is better for those who are Godwary. Do you not exercise your reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "After them succeeded an (evil) generation: They inherited the Book, but they chose (for themselves) the vanities of this world, saying (for excuse): \"(Everything) will be forgiven us.\" (Even so), if similar vanities came their way, they would (again) seize them. Was not the covenant of the Book taken from them, that they would not ascribe to Allah anything but the truth? and they study what is in the Book. But best for the righteous is the home in the Hereafter. Will ye not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then after them succeeded an (evil) generation, which inherited the Book, but they chose (for themselves) the goods of this low life (evil pleasures of this world) saying (as an excuse): \"(Everything) will be forgiven to us.\" And if (again) the offer of the like (evil pleasures of this world) came their way, they would (again) seize them (would commit those sins). Was not the covenant of the Book taken from them that they would not say about Allah anything but the truth? And they have studied what is in it (the Book). And the home of the Hereafter is better for those who are Al-Muttaqun (the pious - see V. 2:2). Do not you then understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then others succeeded them who inherited the Book and availed themselves of the vanities of this lower world, saying: 'It will be forgiven us' But if similar vanities came their way, they would again take them. Have they not taken the covenant of the Book, which they have studied, to tell nothing of Allah except what is true? Surely, the Everlasting Life is better for the cautious, do you not understand!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They were succeeded by generations who inherited the Scripture and chose the materials of this world, saying, “We will be forgiven.” And should similar materials come their way, they would again seize them. Did they not make a covenant to uphold the Scripture, and to not say about God except the truth? Did they not study its contents? But the Home of the Hereafter is better for the cautious; will you not understand?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And there followed them successors who inherited the Scripture [while] taking the commodities of this lower life and saying, \"It will be forgiven for us.\" And if an offer like it comes to them, they will [again] take it. Was not the covenant of the Scripture taken from them that they would not say about Allah except the truth, and they studied what was in it? And the home of the Hereafter is better for those who fear Allah, so will you not use reason?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:169] And there succeeded after them a generation who inherited the Scripture, the Torah, from their forefathers, choosing the transient things of this inferior [life], that is, the ephemeral aspects of this lowly thing that the world is, in the way of what is lawful and what is unlawful, and saying, ‘It will be forgiven us’, what we have done; and yet if similar transient things were to come to them, they would take them (wa-in ya’tihim ‘aradun mithluhu ya’khudhūhu: this sentence is a circumstantial qualifier), in other words, they hope for forgiveness whilst committing the same offence again and persisting in it: and in the Torah there is no [such] promise about forgiveness for persistence [in sin]. Has not the covenant of the Scripture (mīthāqu l-kitābi, the annexation functions in place of fī, ‘in’ [sc. ‘the covenant in the Scripture’]) been taken (a-lam yu’khadh, ‘has [it] not been taken’, is an interrogative meant as an affirmative) from them that they should not say about God anything but the truth? And they have studied (wa-darasū, is a supplement to yu’khadh, ‘has it [not] been taken?’), they have read, what is in it, so why do they impute lies to it [the Scripture] by ascribing to it [the idea of] forgiveness for persistence [in sin]? And the Abode of the Hereafter is better for those who are wary, of what is unlawful. Do they not understand? (ya‘qilūn, may also be read as ta‘qilūn, ‘[do] you [not] understand?’) that it is better and so prefer it to [the abode of] this world?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And a generation hath succeeded them) a generation of people succeeded the righteous ones, but their successors, among the Jews, were evil (who inherited the Scriptures) they took the Scripture and concealed the traits and description of Muhammad (pbuh) that is in it. (They grasp the goods of this low life (as the price of evil doing)) they take bribes and other unlawful stuff of this world in exchange for concealing the traits and description of Muhammad (pbuh) (and say: It will be forgiven us) the sins we commit at night shall be forgiven during the day, and the sins we commit in the day shall be forgiven at night. (And if there came to them (again)) today (the offer of the like) similar to the unlawful that had come to them before, (they would accept it) and declaring to be lawful. (Hath not the covenant of the Scripture been taken on their behalf that they should not speak aught concerning Allah save the Truth? And they have studied that which is therein) of the traits and attributes of Muhammad (pbuh); it is also said that this means: they studied what is in it of the lawful and the unlawful but did not act upon it. (And the abode of the Hereafter) i.e. Paradise (is better, for those who ward off (evil)) ward off disbelief, idolatry, indecencies, bribery and changing the traits and description of the Prophet (pbuh) in the Torah. Warding off these is better than the abode of the life of this world. (Have ye then no sense?) do you not realise that the life of this world is vanishing and the Hereafter is everlasting?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { عَرَضَ هَـٰذَا ٱلأَدْنَىٰ } والعَرَضُ: الطَّمعُ\n والأَدنى: الأَقربُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما بلونهام بما بلوناهم { فَخَلَفَ } واستخلف { مِن بَعْدِهِمْ } أي: بعد انقراضهم خلق { خَلْفٌ } خلفاء منهم يدعون أنهم { وَرِثُواْ ٱلْكِتَٰبَ } أي: علم التوراة منهم، مع أنهم { يَأْخُذُونَ عَرَضَ هَـٰذَا ٱلأَدْنَىٰ } أي: الدنيا مولعين بجمعها { وَيَقُولُونَ سَيُغْفَرُ لَنَا } لن يأخذنا الله أبداً بأخذها وجمعها { وَ } من غاية حرصهم { إِن يَأْتِهِمْ عَرَضٌ مِّثْلُهُ } بل أضعافه وآلافه { يَأْخُذُوهُ } بلا مبالاة؛ اتكاءً على مغفرة الله مع أنهم لم يستغفروا إيه { أَلَمْ يُؤْخَذْ عَلَيْهِمْ مِّيثَٰقُ } الله المنزل في { ٱلْكِتَٰبِ } الذي ادعوا علمه ووراثة، بل يؤخذ عليهم الميثاق في كتابهم { أَن لاَّ يِقُولُواْ عَلَى ٱللَّهِ } ولا ينسبوا إليه { إِلاَّ ٱلْحَقَّ } الصادق الثابت الذي ورد عليه الأمر من عندهز\n\n\n\n{ وَ } كيف لم يعلموا أخذ الله ميثاقه مع أنهم { دَرَسُواْ } من معلمهم { مَا فِيهِ } من الأحكام والمواعظ، والأوامر والنواهي؛؟ { وَ } بالجملة: { ٱلدَّارُ ٱلآخِرَةُ خَيْرٌ لِّلَّذِينَ يَتَّقُونَ } من حطام الدنيا، ويجتنبون عن آثامها { أَفَلاَ تَعْقِلُونَ } [الأعراف: 169] خيريتها، أولئك المنغمسون في قاذورات الدنيا ولذاتها وشهواتها مع أنها لا مدار لها، ولا قرار للذاتها ومشتهياتها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أُمَمًا }: مفعول ثانٍ لقطَّعنا، أو حال، وجملة { منهم الصالحون }: صفة، وجملة { يأخذون }: حال من فاعل ورثوا، و { يقولون } عطف على { يأخذون } ، أو حال، والفعل من { سيغفر }: مسند إلى الجار والمجرور، أو إلى مصدر { يأخذون } ، و { أن لا يقولوا }: عطف بيان من { ميثاق الكتاب } ، أو تفسير له، أو متعلق به، أي: لأن لا يقولوا، و { درسوا }: عطف على { ألم يُؤخذ } من حيث المعنى، أي: ألم يؤخذ عليهم ميثاق الكتاب ولم يدرسوا ما فيه، أو حال، أي: وقد درسوا، و { الذين يُمَسِّكُون }: مبتدأ، وجملة: { إنا لا نضيع أجر المصلحين }: خبر، والرابط: ما في المصلحين من العموم، فوضع موضع الضمير تنبيهًا على أن الإصلاح كالمانع من التضييع، أو حذف العائد، أي: منهم، ويحتمل أن يكون عطفًا على { الذين يتقون } أي: خير للمتقين والذين يتمسكون بالكتاب\n يقول الحقّ جلّ جلاله: { وقطَّعناهم } أي: فرقناهم { في الأرض أُممًا }: فرقًا، ففي كل بلد من البلدان فرقة منهم، فليس لهم إقليم يملكونه، تتمةً لإذلالهم، حتى لا تكون لهم شوكة قط، { منهم الصالحون } وهو من تمسك بدين التوراة، ولم يحرف، ولم يفرق، أو من آمن منهم بالنبي صلى الله عليه وسلم في زمانه وبعده، { ومنهم دون ذلك } أي: ومنهم ناس دون ذلك، أي: منحطون عن الصلاح، وهم كفرتهم وفسقتهم، { وبلوناهم } أي: اختبرناهم { بالحسنات والسيئات } أي: بالنعم والنقم، { لعلهم يرجعون } ينتبهون فينزجرون عمًّا هُم عليه\n { فخلَفَ من بعدهم خلفٌ } أي: فخلف، من بعد الأولين، خلف، أي: بدل سوء، وهو مصدر نعت به، فالخلف، بالسكون، شائع في الشر، يقال: جعل الله منك خلفًا صالحًا\n والمراد بالخلف في الآية: اليهود الذين أدركوا النبي صلى الله عليه وسلم، { وَرِثوا الكتابَ } التوراة، من أسلافهم، يقرؤونها ويقفون على ما فيها، { يأخذون عَرَضَ هذا الأدنى } حطام هذا الشيء الحقير، من الدنو، أو من الدناءة، وهو ما كانوا يأخذون من الرشا في الأحكام، وعلى تحريف الكلام، { ويقولون سيُغفرُ لنا } لا يؤاخذنا الله بذلك ويتجاوز عنه، اغترارًا وحمقًا\n { وإن يأتهم عَرَضٌ مثلُه يأخذوه } أي: يرجون المغفرة، والحال أنهم مصرون على الذنب، عائدون إلى مثله، غير تائبين منه، { ألم يُؤخذْ عليهم ميثاقُ الكتاب } أي: في الكتاب، وهو التوراة، { أن لا يقولوا على الله إِلا الحق } ، وهو تكذيب لهم في قولهم: { سيُغفر لنا } ، والمراد: توبيخهم على القطع بالمغفرة مع عدم التوبة، والدلالة على أنه افتراء على الله وخروج عن ميثاق الكتاب، { ودَرَسُوا ما فيه } أي: وقد درسوا ما فيه، وعلموا ما أُخذ عليهم فيه من المواثيق، ثم تجرأوا على الله، { والدارُ الآخرة خير للذين يتقون } مما يأخذ هؤلاء من العرض الفاني\n\n\n{ أفلا يعقلون } فيعلموا ذلك، ولا يستبدلوا الأدنى الحقير المؤدي إلى العقاب بالنعيم الكبير المخلد في دار الثواب، ومن قرأ بالخطاب فهو لهم، من باب التلوين في الكلام",
      "translations": []
    }
  ]
}