{
  "chapter": "الأعراف",
  "text": "وسـلهم عن القرية التى كانت حاضرة البحر اذ يعدون فى السبت اذ تاتيهم حيتانهم يوم سبتهم شرعا ويوم لا يسبتون لا تاتيهم كذلك نبلوهم بما كانوا۟ يفسقون",
  "translations": [
    {
      "translation": "Ask them about the town which was by the sea when they broke the Sabbath - when their fish came to them near the surface on their Sabbath day but did not come on the days which were not their Sabbath. In this way We put them to the test because they were deviators.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enquire of them about the town situated by the sea where, when they did not keep the Sabbath, the fish came up to the surface of the water for them; but on days other than the Sabbath the fish did not come. We tried them in this way, for they were disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask the people of Moses concerning the town situated along the sea how its people profaned the Sabbath when fish came to them breaking the water's surface on Sabbath days, and would not come to them on other than Sabbath-days. Thus did We try them because of their disobedience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), ask them about the (people of the) towns on the seashore. They had transgressed by catching fish on the Sabbath. Each Sabbath the fish came openly within their reach but not so on other days. Thus, We were testing them because of their evil deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask them (O dear Prophet Mohammed – peace and blessings be upon him) of the township that was by the sea; when they used to exceed in the matter of the Sabbath – when their fish used to come swimming atop the water in front of them on the day of Sabbath and not come on the days it was not Sabbath; this is how We used to test them, due to their disobedience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask them about the town that was by the sea; when they transgressed in the matter of the Sabbath: when their fish came to them openly on the Sabbath day, and did not come to them on the day they had no Sabbath. Thus We made a trial for them, for they used to rebel against Allah's command.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask them about the town which stood by the sea; when they exceeded the limits of the Sabbath, when their fish came to them on the day of their Sabbath, appearing on the surface of the water, and on the day on which they did not keep the Sabbath they did not come to them; thus did We try them because they transgressed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And question them concerning the township which was bordering the sea, when they transgressed the Sabbath, when their fish came to them on the day of their Sabbath, swimming shorewards, but on the day they kept not Sabbath, they came not unto them. Even so We were trying them for their ungodliness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them (O Muhammad) of the township that was by the sea, how they did break the Sabbath, how their big fish came unto them visibly upon their Sabbath day and on a day when they did not keep Sabbath came they not unto them. Thus did We try them for that they were evil-livers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them about the town which was by the sea and what befell its people when they broke the Sabbath. On their Sabbath the fish came to them near the surface, but on week-days they never came near them -- thus We tried them because of their disobedience.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask thou them concerning the town that was close on the sea, when they transgressed in the matter of the sabt, when their fish came unto them openly on their sabt day, while they came not on the day whereon they kept not We proved them for the sabt. Thus they were wont to transgress.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them about the town that was situated on the seaside, when they violated the Sabbath, when their fish would come to them on the Sabbath day, visibly on the shore, but on days when they were not keeping Sabbath they would not come to them. Thus did We test them because of the transgressions they used to commit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them concerning the town standing close by the sea. Behold! they transgressed in the matter of the Sabbath. For on the day of their Sabbath their fish did come to them, openly holding up their heads, but on the day they had no Sabbath, they came not: thus did We make a trial of them, for they were given to transgression.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask them (O Muhammad SAW) about the town that was by the sea, when they transgressed in the matter of the Sabbath (i.e. Saturday): when their fish came to them openly on the Sabbath day, and did not come to them on the day they had no Sabbath. Thus We made a trial of them for they used to rebel (see the Quran: V. 4:154).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them about the village that overlooked the sea and what befell (its people) when they broke the Sabbath. Each Sabbath, their fish came swimming towards the shore, but on other days they did not come to them. As such We tempted them (the people) because they had done wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them about the town by the sea, when they violated the Sabbath. When they observed the Sabbath, their fish would come to them abundantly. But when they violated the Sabbath, their fish would not come to them. Thus We tried them because they disobeyed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And ask them about the town that was by the sea - when they transgressed in [the matter of] the sabbath - when their fish came to them openly on their sabbath day, and the day they had no sabbath they did not come to them. Thus did We give them trial because they were defiantly disobedient.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:163] And question them, O Muhammad (s), in rebuke, about the city that was by the sea, bordering the Red Sea (bahr al-qulzum), and this was Eilat, [about] what befell its inhabitants, how they would transgress, violate, the Sabbath, by fishing, which they had been commanded not to do on that [day]; how (idh is an adverbial qualifier of ya‘dūn, ‘they [would] transgress’) their fish would come to them on the day of their Sabbath floating at the surface, visible at the surface of the water; but on the day they did not observe the Sabbath, when they would not consecrate the Sabbath over the other days, they would not come to them, as a trial from God. Thus were We trying them for their wickedness. And when they went to fish, the city split into three: one third joined the fishing party, another prohibited them, while a third abstained from both fishing and prohibiting.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nغُيّر أسلوب الخبر عن بني إسرائيل هُنا : فابتدىءَ ذِكرُ هذه القصة بطلب أن يسأل سائل بني إسرائيل الحاضرين عنها ، فنعلم من ذلك أن لهذه القصص الآتية شأناً غير شأن القصص الماضية ، ولا أحسب ذلك إلاّ من أجل أن هذه القصة ليست مما كُتب في توراة اليهود ولا في كتب أنبيائهم ، ولكنها مما كان مروياً عن أحبارهم ، ولذلك افتتحت بالأمر بسؤالهم عنها ، لإشعار يهود العصر النبوي بأن الله أْطلع نبيّه عليه الصلاة والسلام عليها ، وهم كانوا يكتمونها ، وذلك أن الحوادث التي تكون مواعظ للأمة فيما اجترحته من المخالفات والمعاصي تبقي لها عَقب الموعظة أثراً قد تعيّر الأمة به ، ولكن ذلك التعيير لا يؤبه به في جانب ما يحصل من النفع لها بالموعطة ، فالأمة في خُوَيْصّتها لا يهتم قادتها ونصحاؤها إلاّ بإصلاح الحال ، وإن كان في ذكر بعض تلك الأحوال غضاضة عندها وامتعاض ، فإذا جاء حكم التاريخ العام بين الأمم تناولتْ الأمم أحوال تلك الأمة بالحكم لها وعليها ، فبقيت حوادث فلتاتها مغمزاً عليها ومعرّة تُعير بها ، وكذلك كان شَأن اليهود لما أضاعوا مُلكهم ووطنهم وجاوروا أمماً أخرى فأصبحوا يكتمون عن أولئك الجيرة مَسَاوي تاريخهم ، حتى أرسل الله محمداً صلى الله عليه وسلم فعلّمه من أحوالهم ما فيه معجزة لأسلافهم ، وما بقي معرّة لأخلافهم ، وذلك تَحدّ لهم ، ووخز على سوء تلقيهم الدعوة المحمدية بالمكر والحسد .فالسؤال هنا في معنى التقرير لتقريع بني إسرائيل وتوبيخهم وَعد سوابق عصيانهم أي ليس عصيانهم إياك ببدع ، فإن ذلك شنشنة قديمة فيهم ، وليس سؤالَ الاستفادة لأن الرسول صلى الله عليه وسلم قد أعلم بذلك من جانب ربه تعالى ، وهو نظير همزة الاستفهام التقريري فوزان { وأسألهم عن القرية } وزان : أعدَوْتُم في السَبْت ، فإن السؤال في كلام العرب على نوعين أشهرهما أن يسأل السائِل عما لا يعلمه ليعلمه ، والآخران يسأل على وجه التقرير حين يكون السائِل يعلم حصول المسؤول عنه ، ويعلم المسؤول أن السائل عالم وأنه إنما سأله ليقرره .وجملة : { واسألهم } عطف على جملة : { وإذْ قيل لهم اسكنوا هذه القرية } \\[ الأعراف : 161 \\] واقعة معترضة بين قصص الامتنان وقصص الانتقام الآتية في قوله : { وقَطّعنْاهم } \\[ الأعراف : 168 \\] ، ومناسبة الانتقال إلى هذه القصة إن في كلتا القصتين حديثا يتعلق بأهل قرية من قرى بني إسرائيل .وتقدم ذكر القرية عند قوله تعالى : { ولقد علمتم الذين اعتدوا منكم في السبت } الآية من سورة البقرة ( 65 ).وهذه القرية قيل : ( أْيلة ) وهي المسماة اليوم ( العقبة ) وهي مدينة على ساحل البحر الأحمر قرب شبه جزيرة طور سينا ، وهي مبدأ أرض الشام من جهة مصر ، وكانت من مملكة إسرائيل في زمان داود عليه السلام ، ووصفت بأنها حاضرة البحر بمعنى الاتصال بالبحر والقرببِ منه ، لأن الحضور يستلزم القرب ، وكانت ( أيلة ) متصلة بخليج من البحر الأحمر وهو القلزم .وقيل هي ( طبرية ) وكانت طبرية تدعى بحيرة طبرية ، وقد قال المفسرون : إن هذه القصة التي أشير إليها في هذه الآية كانت في مدة داود .وأطلقت القرية على أهلها بقرينة قوله : إذ يعْدُون } أي أهلها .والمراد السؤال عن اعتدائهم في السبت بقرينة قوله : { إذ يعدون في السبت } الخ فقوله : { إذ يعدون في السبت } بدل اشتمال من القرية وهو المقصود بالحكم . فتقدير الكلام : وأسألهم إذ يعدُو أهل القرية في السبت و { إذْ } فيه اسم زمان للماضي ، وليست ظرفاً .والعدوان الظلم ومخالفة الحق ، وهو مشتق من العدوْ وبسكون الدال وهو التجاوز .والسبت علم لليوم الواقع بعد يوم الجمعة ، وتقدم عند قوله تعالى : { وقُلنا لهم لا تَعدُوا في السبت } في سورة النساء ( 154 ).واختيار صيغة المضارع للدلالة على تكرر ذلك منهم .وتعدية فعل يعدون } إلى { في السبت } مؤذن بأن العدوان لأجل يوم السبت ، نظراً إلى ما دلت عليه صيغة المضارع من التكرير المقتضي أن عدوانهم يتكرر في كل سبت ، ونظراً إلى أن ذكر وقت العدوان لا يتعلق به غرض البليغ ما لم يكن لذلك الوقت مزيد اختصاص بالفعل فيعلم أن الاعتداء كان مَنوطاً بحق خاص بيوم السبت ، وذلك هو حق عدم العمل فيه ، إذ ليس ليوم السبت حق في شريعة موسى سوى أنه يحرم العمل فيه ، وهذا العمل هو الصيد كما تدل عليه بقية القصة .وهدف { في } للظرفية ، لأن العدوان وقع في شأن نقص حرمة السبت .وقوله : { إذ تأتيهم حيتانهم } ظرف ل { يعْدُون } أي يَعْدون حين تأتيهم حيتانهم .والحيتان جمع حوت ، وهو السمكة ، ويطلق الحوت على الجمع فهو مما استوى فيه المفرد والجمع مثل فُلْك ، وأكثر ما يطلق الحوت على الواحد ، والجمعُ حيتان .وقوله : { شُرّعاً } هو جمع شارع ، صفة للحوت الذي هو المفرد ، قال ابن عباس : أي ظاهرة على الماء ، يعني أنها قريبة من سطح البحر آمنة من أن تصاد ، أي أن الله ألهمها ذلك لتكون آية لبني إسرائيل على أن احترام السبت من العمل فيه هو من أمر الله ، وقال الضحاك : { شُرَعاً } متتابعة مصطفة ، أي فهو كناية عن كثرة ما يَرد منها يومَ السبت .وأحسب أن ذلك وصف من شَرَعَتْ الإبل نحو الماء أي دخلتْ لتشرب ، وهي إذا رعها الرعاة تسابقت إلى الماء فاكتظت وتراكمت وربما دخلت فيه ، فمثلت هيئة الحيتان ، في كثرتها في الماء بالنعم الشارعة إلى الماء وحسّن ذلك وجود الماء في الحالتين ، وهذا أحسن تفسيراً .والمعنى : أنهم يَعْدون في السبت ولم يمتثلوا أمر الله بترك العمل فيه ، ولا اتعظوا بآية إلهام الحوت أن يكون آمناً فيه .وقوله : { يوم سبتهم } يجوز أن يكون لفظ سبت مصدَر سبتَ إذا قطع العمل بقرينة ظاهر قوله : { ويوم لا يسبتون } فإنه مضارع سَبت ، فيتطابق المثبت والمنفي فيكون المعنى : إنهم إذا حفظوا حرمة السبت ، فأمسكوا عن الصيد في يوم السبت ، جاءت الحيتان يومئذٍ شُرعاً آمنة ، وإذا بعثهم الطمع في ورفة الصيد فأعدُّوا له آلاته ، وعزموا على الصيد لم تأتهم .ويجوز أن يكون لفظ { سبتهم } بمعنى الاسم العلم لليوم المعروف بهذا الاسم من أيام الأسبوع ، وإضافته إلى ضميرهم اختصاصه بهم بما أنهم يهود ، تعريضاً بهم لاستحلالهم حرمة السبت فإن الاسم العلم قد يضاف بهذا القصد ، كقول أحد الطائينَ :عَلاَ زيدْنا يوم النّقا رأسَ زيدِكم ... بأبيض ماضي الشفرتين يَمانِوقول ربيعة بن ثابت الأسدي :لشتان ما بين اليزيدين في النّدى ... يَزيدِ سُليْم والأغَرّ ابننِ حاتموعلى الوجهين يجوز في قوله : { ويوم لا يسبتون } أن يكون المعنى والأيامَ التي لا يحرم العمل فيها ، أي أيام الأسبوع ، لا تأتي فيها الحيتان ، وأن يكون المعنى وأيامَ السبوت التي استحلوها فلم يكفوا عن الصيد فيها يَنقطع فيها إتيان الحيتان ، ولا يخفى أن لا يثار هذا الأسلوب في التعبير عن السبت خصوصية بلاغية ، ترمي إلى إرادة كلا المعنيين .فالمقصود من الآية الموعظة والعبرة وليست منة عليهم ، وقرينته قوله تعالى : { كذلك نبلوهم بما كانوا يفسقون } أي نمتحن طاعتهم بتعريضهم لداعي العصيان وهو وجود المشتهى الممنوع .وجملة { كذلك نبلوهم } مستأنفة استئنافاً بيانياً لجواب سؤال من يقول : ما فائدة هذه الآية مع علم الله بأنهم لا يَرعوون عن انتهاك حرمة السبت .والإشارة إلى البلوى الدال عليها { نبلوهم } أي مثل هذا الابتلاء العظيم نبلوهم ، وقد تقدم القول في نظيره من قوله تعالى : { وكذلك جعلناكم أمة وسطاً } في سورة البقرة ( 143 ).وأصل البلوى الاختبار ، والبلوى إذا أسندت إلى الله تعالى كانت مجازاً عقلياً أي ليبلَو الناس تمسكهم بشرائِع دينهم .والباء للسببية و ( ما ) مصدرية ، أي بفسقهم ، أي توغلهم في العصيان أضراهم على الزيادة منه ، فإذا عرض لهم داعِيهِ خفُّوا إليه ولم يرقبوا أمر الله تعالى .\n\n",
      "translations": [
        {
          "translation": "(Ask them) the Jews, Muhammad (of the township) about the story of the township called Aylah (that was by the sea, how they did break the Sabbath) they used to transgress on the Sabbath by taking the fish, (how their big fish came unto them visibly) scores and scores of them, from deep inside up to the shore (upon their Sabbath day and on a day when they did not keep Sabbath came they not unto them. Thus did We try them) test them (for that they were evil-livers) transgressors.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِذْ يَعْدُونَ فِي ٱلسَّبْتِ } معناهُ يَتَعدون فيهِ\n\n\n\n\nوقوله تعالى: { شُرَّعاً } معناهُ ظاهرٌ\n ويقالُ بيضٌ سِمَانٌ\n\n",
      "translations": [
        {
          "translation": " And His saying, {When they are about to} Saturday, means they are about to it.\n\n\nAnd His saying, \"It is {legislated}\" - its meaning is apparent.\n\n\nAnd it is said that an egg is a white {simaan} (type of stone).",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } أيضاً من جملة ظلمهم على نفوسهم: حيلهم وخداعهم في نقض العهد\n إن شئت أن تعرف { سْئَلْهُمْ عَنِ ٱلْقَرْيَةِ } أي: سلْ خداعهم وحيلهم عن أ÷ل القرية { ٱلَّتِي كَانَتْ حَاضِرَةَ ٱلْبَحْرِ } قريبة منه\n قيل: إيلة\n وقيل: طبرية الشام\n وقيل: مدين\n وقت { إِذْ يَعْدُونَ } يتجاوزون عن حدودنا وعهودنا { فِي ٱلسَّبْتِ } أي: العهد الذي عهدوا معنا ألاَّ يصطادوا\n بل أخلصوا لعبادتنا والتوبة نحونا فابتليناهم بمحافظة العهد { إِذْ تَأْتِيهِمْ حِيتَانُهُمْ يَوْمَ سَبْتِهِمْ } المعهود المحرم { شُرَّعاً } متابعة متوالية\n\n\n{ وَيَوْمَ لاَ يَسْبِتُونَ } ولا يعهدون فيه { لاَ تَأْتِيهِمْ كَذَلِكَ } أي: مثل سبتهم\n فاحتالوا بتعليم شياطينهم حياضاً وأخاديد\n فأرسلوا الماء عليها في يوم السبت\n واجتمعت الحيتان فيها واصطادوها يوم الأحد والإثنين\n وبسبب خداعهم معنا واختلافهم الحيلة لنقض عهدنا { نَبْلُوهُم } ببلاء المسخ { بِمَا كَانُوا يَفْسُقُونَ } [الأعراف: 163] بسبب فسقهم وخروجهم عن مقتضى العهد\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { إذ يَعْدُون }: بدل من { القرية } \n بدل اشتمال\n أو منصوب بكانت\n أو بحاضرة و { إذ تأتيهم }: منصوب بيعدون\n و { سبتهم }: مصدر مضاف للفاعل\n يقال: سبت اليهود سبتًا: إذا عظم يوم السبت وقطع شغله فيه\n و { شُرَّعًا }: حال\n ومعناه: ظاهرة قريبة منهم\n يقال: شرع منه فلان إذا دنا منه\n يقول الحقّ جلّ جلاله: { واسألهم عن القرية } أي: اليهود\n سؤال تقرير وتوبيخ على تقديم عصيانهم وعما هو من معلومهم\n الذي لا يعلم إلا بتعليم أو وحي\n وقد تحققوا أنك أُمي\n فيكون ذلك معجزة وحجة عليهم\n { عن القرية } أي: عن خبرها وما وقع لها\n { التي كانت حاضرةَ البحر } قريبة منه\n وهي \" إيلة \" \n قرية بين مدين والطور\n على شاطىء البحر\n وقيل: مدين\n وقيل: طبرية\n { إذ يَعدُون في السّبِت }: يتجاوزون حدود الله بالاصطياد في يوم السبت\n وكان حرامًا عليهم لاشتغالهم عنه بالعبادة\n { إذ تأتيهم حيتانُهم يوم سبتهم شُرّعًا }: ظاهرة على وجه الماء\n دانية منهم\n { ويوم لا يَسبِتُون لا تأتيهم } بل تغوص كلها في البحر\n { كذلك } أي: مثل هذا البلاء الشديد { نَبلوهم بما كانوا يفسقون } أي: بسبب فسقهم\n وقيل \" كذلك \": متصل بما قبله\n أي: لا تأتيهم مثل ذلك الإتيان الذي تأتيه يوم السبت\n ثم افترقت بنو إسرائيل ثلاث فرق: فرقة عصت بالصيد يوم السبت\n وفرقة نهت عن ذلك واعتزلت القوم\n وفرقة سكتت واعتزلت فلم تنه ولم تعص",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "45:18",
      "similarity": 0.419979559509841
    },
    {
      "verse": "42:21",
      "similarity": 0.38546144277281824
    },
    {
      "verse": "68:48",
      "similarity": 0.3683590004393728
    },
    {
      "verse": "18:61",
      "similarity": 0.3595581651407891
    },
    {
      "verse": "16:124",
      "similarity": 0.3364305686087475
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007163.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007163.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:163.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}