{
  "chapter": "الأعراف",
  "text": "واذ تاذن ربك ليبعثن عليهم الى يوم القيمة من يسومهم سوء العذاب ان ربك لسريع العقاب وانه لغفور رحيم",
  "translations": [
    {
      "translation": "Then your Lord announced that He would send against them until the Day of Rising people who would inflict an evil punishment on them. Your Lord is Swift in Retribution. And He is Ever-Forgiving, Most Merciful.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And your Lord declared He would send men against them who would inflict dreadful suffering on them till the Day of Doom, for your Lord is swift in retribution, though He is certainly forgiving and kind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when Your Lord proclaimed that 'He would continually set in authority over them, till the Day of Judgement, those who would ruthless oppress thern.' Surely, your Lord is swift in chastising; and yet He is All-Forgiving, All-Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), consider, when your Lord declared to the (Israelites) His decision to raise a people above them who would make them suffer the worst kinds of torments until the Day of Judgment. Certainly your Lord's retribution is swift. He is All-forgiving and All-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when your Lord announced the command that till the Day of Resurrection I will certainly send such oppressors against them, who will inflict them with a dreadful punishment; indeed your Lord is swift in meting out punishment; and indeed He is Oft Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when your Lord declared that He would certainly keep on sending against them, till the Day of Resurrection, those who would afflict them with a humiliating torment. Verily, your Lord is quick in retribution and certainly He is Oft-Forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when your Lord announced that He would certainly send against them to the day of resurrection those who would subject them to severe torment; most surely your Lord is quick to requite (evil) and most surely He is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Thy Lord proclaimed He would send forth against them, unto the Day of Resurrection, those who should visit them with evil chastisement. Surely thy Lord is swift in retribution; surely He is All-forgiving, All-compassionate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when thy Lord proclaimed that He would raise against them till the Day of Resurrection those who would lay on them a cruel torment. Lo! verily thy Lord is swift in prosecution and lo! verily He is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then your Lord declared that, until the Day of Resurrection, He would send others against them to inflict terrible suffering on them. Your Lord is swift in retribution; yet surely He is most forgiving and merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time thy Lord proclaimed that he would surely raise upon them, till the Day of Resurrection, someone perpetrating upon them worst oppression. Verily thy Lord is swift in chastising, and verily He is Forgiving, Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when your Lord proclaimed that He would surely send against them, until the Day of Resurrection, those who would inflict on them a terrible punishment. Indeed your Lord is swift in retribution, and indeed, He is all-forgiving, all-merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! thy Lord did declare that He would send against them, to the Day of Judgment, those who would afflict them with grievous penalty. Thy Lord is quick in retribution, but He is also Oft-forgiving, Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when your Lord declared that He would certainly keep on sending against them (i.e. the Jews), till the Day of Resurrection, those who would afflict them with a humiliating torment. Verily, your Lord is Quick in Retribution (for the disobedient, wicked) and certainly He is Oft-Forgiving, Most Merciful (for the obedient and those who beg Allah's Forgiveness).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then your Lord declared He would send against them he who would oppress them cruelly till the Day of Resurrection. Swift is the retribution of your Lord, yet surely He is Forgiving, the Most Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Your Lord has announced that, He would send against them, until the Day of Resurrection, those who would inflict terrible suffering upon them. Your Lord is swift in retribution, yet He is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] when your Lord declared that He would surely [continue to] send upon them until the Day of Resurrection those who would afflict them with the worst torment. Indeed, your Lord is swift in penalty; but indeed, He is Forgiving and Merciful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:167] And when your Lord proclaimed, made it known, that He would send against them, that is, the Jews, to the Day of Resurrection, those who would inflict on them grievous torment, through humiliation and the exacting of the jizya-tax [from them]. Thus, God sent Solomon against them, and after him, Nebuchadnezzar, who slaughtered [some of] them and took [others among] them captive, and imposed the jizya-tax on them. They continued to pay this [tax] to the Magians up until the [time of the] sending of our Prophet (s), who [also] imposed it on them. Lo! verily your Lord is swift in requital, of those who disobey Him. And lo! verily He is Forgiving, to those who obey Him, Merciful, [in dealing] with them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (remember) when thy Lord proclaimed that He would raise against them till the Day of Resurrection those who would lay on them a cruel torment) those who would severely torment them by the imposition of the capitation tax and other things, the reference here is to Muhammad (pbuh) and his Community. (Lo! verily your Lord is swift in prosecution) He has a severe punishment for those who do not believe in Him (and lo! verily He is Forgiving, Merciful) vis-a-vis those who believe in Him.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اتل على من تبعك منهم\n واذكر لهم يا أكمل الرسل: ويتنبهوا وقت { إِذْ تَأَذَّنَ رَبُّكَ } أي: عزم وكتب على نفسه\n كأنه أقسم { لَيَبْعَثَنَّ } وليسلطنَّ { عَلَيْهِمْ إِلَىٰ يَوْمِ ٱلْقِيَامَةِ } مستمراً دائماً { مَن يَسُومُهُمْ } يعلمهم { سُوۤءَ ٱلْعَذَابِ } لذلك ما ترى يهودياً في أقطار الأرض إلا عليه مذلة وهوان { إِنَّ رَبَّكَ } يا أكمل الرسل { لَسَرِيعُ ٱلْعِقَابِ } على من أراد عقابه { وَإِنَّهُ } أيضاً { لَغَفُورٌ } لمن تاب وأخلص { رَّحِيمٌ } [الأعراف: 167] يقبل توبته ويمحو معيته\n\n\n{ وَ } من غاية إذلالنا إياهم { قَطَّعْنَاهُمْ } أي: فرقناهم { فِي ٱلأَرْضِ أُمَماً } فرقاً فرقاً { مِّنْهُمُ ٱلصَّالِحُونَ } المؤمنون بالله وبملائكته وكتبه ورسله { وَمِنْهُمْ دُونَ ذٰلِكَ } أي: الطالحون الخارجون عن مقتضى الإيمان { وَ } بالجملة: { بَلَوْنَاهُمْ } أي: اختبرناهم وجربناهم { بِٱلْحَسَنَاتِ } أي: بالعطاء والإنعام { وَٱلسَّيِّئَاتِ } بالأخذ والانتقام { لَعَلَّهُمْ يَرْجِعُونَ } [الأعراف: 168] رجاء أن ينتبهوا بنا فيرجعوا إلينا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { تأذن }: أعلم، وهي تفعل، وهي من الإيذان بمعنى الإعلام، كتوعّد وأوعد، أو: عزم، لأن العازم على الشيء يؤذن نفسه بفعله، وأجرى مجرى القسم كعَلِم الله وشهد الله، ولذلك أجيب باللام القسمية\n يقول الحقّ جلّ جلاله: { و } اذكروا { إذ تأَذَّن ربُّك } أي: أعلم وأظهر ذلك في عالم الشهادة، { ليبعثنَّ } على بني إسرائيل، أي: ليسلطن { عليهم إلى يوم القيامة مَن يسومُهم سُوءَ العذابِ } كالإذلال وضرب الجزية، وقد بعث الله عليهم بعد سليمان عليه السلام بُختنصر، فخرب ديارهم، وقتل مقاتلتهم، وسبى نساءهم وذراريهم، وضرب الجزية على من بقي منهم، وكانوا يؤدونها إلى المجوس، حتى بعث الله نبينا محمدًا صلى الله عليه وسلم ففعل بهم ما فعل، في بني قريظة والنضير وخبير، ثم ضرب الله عليهم الجزية إلى آخر الدهر، { إن ربك لسريع العقاب } فعاقبهم في الدنيا، { وإنه لغفور رحيم } لمن تاب وآمن، وإنما أكد هنا الخبر باللام دون ما في آخر الأنعام، لأن ما هنا في اليهود، وما في آخر الأنعام في المؤمنين، فأكد ما هنا باللام، فقال: { لسريع العقاب } زيادة في توبيخهم ونكالهم\n الإشارة: مواطن الذل والهوان هو الانهماك في المخالفة والعدوان، وقد ينسحب ذلك في الذرية إلى آخر الزمان، فإن الله تعالى يقول: أنا الملك الودود، أعاقب الأحفاد بمعاصي الجدود، ومواطن العز والحرمة والأمان: هو الطاعة والتعظيم والإحسان، ينسحب ذلك على الأحفاد، إلى منتهى الزمان، فإن الله تعالى يحفظ الأولاد ببركة الأجداد\n وقد تذاكر بعض التابعين ما يكون في آخر الزمان من الفتن والفساد، فقال بعضهم: يا ليتني كنت عقيمًا أو لم أتزوج، فقال له من هو أكبر منه: ألا أدلك على ما يحفظ الله عقبك؟ قال: نعم، دلني، قال: قوله تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:83",
      "similarity": 0.5105829954273254
    },
    {
      "verse": "51:34",
      "similarity": 0.44518825524168865
    },
    {
      "verse": "7:141",
      "similarity": 0.4289309034340948
    },
    {
      "verse": "16:10",
      "similarity": 0.391556611513473
    },
    {
      "verse": "7:48",
      "similarity": 0.3847266582255043
    }
  ]
}