{
  "chapter": "الأعراف",
  "text": "واذ قالت امة منهم لم تعظون قوما الله مهلكهم او معذبهم عذابا شديدا قالوا۟ معذرة الى ربكم ولعلهم يتقون",
  "translations": [
    {
      "translation": "When a group of them said, 'Why do you rebuke a people whom Allah is going to destroy or severely punish?' they said, 'So that we have an excuse to present to your Lord, and so that hopefully they will gain taqwa.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a Section of them said: \"Why do you admonish a people whom God is about to destroy or to punish severely?\" They replied: \"To clear ourselves of blame before your Lord, and that they may fear God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when a party of them said: 'Why do you admonish a people whom Allah is about to destroy or punish severely?' They said: 'We admonish them in order to be able to offer an excuse before Your Lord, and in the hope that they will guard against disobedience.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a group of them questioned another group saying, \"Why do you preach to those whom God has decided to destroy or punish by a severe torment?\" they replied, \"We preach to them for we are responsible in the sight of your Lord and so that perhaps they may have fear of God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a group among them said, “Why do you preach to a people whom Allah is going to destroy or mete out a severe punishment?” They said, “To have an excuse before your Lord, and that perhaps they may fear.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a community among them said: \"Why do you preach to a people whom Allah is about to destroy or to punish with a severe torment\" (The preachers) said: \"In order to be free from guilt before your Lord (Allah), and perhaps they may fear Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a party of them said: Why do you admonish a with a severe chastisement? They said: To be free from blame before your Lord, and that haply they may guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a certain nation of them said, 'Why do you admonish a people God is about to destroy or to chastise with a terrible chastisement?' They said, 'As an excuse to your Lord; and haply they will be godfearing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a community among them said: Why preach ye to a folk whom Allah is about to destroy or punish with an awful doom, they said: In order to be free from guilt before your Lord, and that haply they may ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When some of them asked, \"Why do you admonish a people whom God is going to destroy or to afflict with a severe punishment?\" They answered, \"In order to be free from blame before your Lord, and that they may perhaps fear Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time a community of them said Why exhort ye a people whom Allah is going to destroy or chastise with a severe chastisenent They said: to justify us before your Lord, and that haply they may fear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a group of them said, ‘Why do you advise a people whom Allah will destroy, or punish with a severe punishment?’ They said, ‘As an excuse before your Lord, and [with the hope] that they may be Godwary.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When some of them said: \"Why do ye preach to a people whom Allah will destroy or visit with a terrible punishment?\"- said the preachers:\" To discharge our duty to your Lord, and perchance they may fear Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a community among them said: \"Why do you preach to a people whom Allah is about to destroy or to punish with a severe torment?\" (The preachers) said: \"In order to be free from guilt before your Lord (Allah), and perhaps they may fear Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when some asked: 'Why do you admonish a nation whom Allah will destroy or sternly punish' They replied: '(Seeking) a pardon from your Lord, and in order that they may be cautious'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a group of them said, “Why do you counsel a people whom God will annihilate, or punish with a severe punishment?” They said, “As an excuse to your Lord, and so that they may become righteous.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a community among them said, \"Why do you advise [or warn] a people whom Allah is [about] to destroy or to punish with a severe punishment?\" they [the advisors] said, \"To be absolved before your Lord and perhaps they may fear Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:164] And when (wa-idh is a supplement to the preceding idh, ‘how’) a community among them, who neither fished nor prohibited it, said, to those who prohibited it: ‘Why do you preach [admonition] to a folk whom God is about to destroy or chastise with a severe chastisement?’ They said, our admonishing [them] is, ‘As an exculpation, by which we excuse ourselves, before your Lord, lest we are reproached for failing to prohibit [them] in any way; and so that they might be wary, of fishing’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when a community) a group (among them said: Why preach ye to a folk whom Allah is about to destroy) by turning them into animals (and punish with an awful doom) with the Fire, (they said: In order to be free from guilt before your Lord) in order to have an argument before your Lord, (and that haply they may ward off (evil)) ward off taking the fish on the Sabbath. These were three people who used to catch fish on the Sabbath and encouraged others to do so too. There was another group of people who did not catch fish on the Sabbath but did not warn others against doing so. And lastly there was another group of people who did not catch the fish on the Sabbath and warned others against doing so. Allah turned those 176 who caught fish on the Sabbath and enjoined others to do so into animals and spared the others.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكروا { إِذْ قَالَتْ أُمَّةٌ مِّنْهُمْ } أي: جماعة من صلحائهم، حين قال الصلحاء للمحتالين المناقضين على وجه العظة والتذكير: لِمَ تحتالون وتخادعون مع الله كأنكم لم تخافوا من بطشه وانتقامه { لِمَ تَعِظُونَ } أيها المذكرون المصلحون { قَوْماً } منهمكين في الغفلة الضلال { ٱللَّهُ مُهْلِكُهُمْ أَوْ مُعَذِّبُهُمْ عَذَاباً شَدِيداً } أي: أراد الله إهلاكهم وتعذيبهم بأشد العذاب بشؤم حيلهم وخداعهم هذا { قَالُواْ } أي: المذكرون المصلحون تذكيرنا ونصحنا إياهم: { مَعْذِرَةً } منَّا { إِلَىٰ رَبِّكُمْ } الذي أمرنا بنهي المنكر على وجه المبالغة { وَلَعَلَّهُمْ يَتَّقُونَ } [الأعراف: 164] أي: ونرجو من كرم الله أن ينتهوا بتذكيرنا عمَّا هم عليه من الغفلة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإذ قالت أُمةٌ منهم } ، وهي التي لم تنه ولم تعص\n لَمَّا رأت مهاجرة الناهية وطغيان العاصية: { لِمَ تَعِظُون قومًا اللهُ مهلكهم } بالموت بصاعقة، { أو معذبهم عذابًا شديدًا } في الآخرة؟ { قالوا }: نهينا لهم { معذرة إلى ربكم } أي: عذرًا إلى الله تعالى، حتى لا ننسب إلى تفريط في النهي عن المنكر، { ولعلهم يتقون } فينزجرون عن العصيان، إذ اليأس منهم لا يحصل إلا بالهلاك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:6",
      "similarity": 0.6320565179473193
    },
    {
      "verse": "77:36",
      "similarity": 0.6057580622065676
    },
    {
      "verse": "75:15",
      "similarity": 0.6035321330078083
    },
    {
      "verse": "66:7",
      "similarity": 0.5780158249475954
    },
    {
      "verse": "40:52",
      "similarity": 0.4943353784360108
    }
  ]
}