{
  "chapter": "الأعراف",
  "text": "قال فبما اغويتنى لاقعدن لهم صرطك المستقيم",
  "translations": [
    {
      "translation": "He said, 'By Your misguidance of me, I will lie in ambush for them on your straight path.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Since You led me into error,\" said Iblis, \"I shall lie in wait for them along Your straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan said: 'Since You have led me astray, I shall surely sit in ambush for them on Your Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan said, \"Because you have made me go astray, I shall certainly try to seduce people into straying from the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Hence I swear by the fact that You sent me astray, I will certainly lay in wait for them on Your Straight Path.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Iblis) said: \"Because You have `Aghwaytni', surely, I will sit in wait against them (human beings) on Your straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: As Thou hast caused me to remain disappointed I will certainly lie in wait for them in Thy straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said he, 'Now, for Thy perverting me, I shall surely sit in ambush for them on Thy straight path;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Now, because Thou hast sent me astray, verily I shall lurk in ambush for them on Thy Right Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan said, \"Because You have put me in the wrong, I will lie in ambush for them on Your straight path:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: because Thou hast seduced me, I will beset for them Thy straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘As You have consigned me to perversity,’ he said, ‘I will surely lie in wait for them on Your straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: \"Because thou hast thrown me out of the way, lo! I will lie in wait for them on thy straight way:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Iblis) said: \"Because You have sent me astray, surely I will sit in wait against them (human beings) on Your Straight Path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "he answered: 'Because You have caused me to go astray, I will waylay them as they walk on Your Straight Path,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Because you have lured me, I will waylay them on Your straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Satan] said, \"Because You have put me in error, I will surely sit in wait for them on Your straight path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:16]   Said he, ‘Now, because You have sent me astray (fa-bi-mā aghwaytanī means bi-ighwā’ik, ‘for Your sending me astray’: the bā’ is for oaths, and the response of the oath is [the following]) verily I shall sit in ambush for them, that is, for the Children of Adam, on Your straight path, that is, on the path that leads to You.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He) Iblis (said: Now, because Thou hast sent me astray) just as You made me err from guidance, (verily I shall lurk in ambush for them) for the children of Adam (on Thy Right Path) the religion of Islam.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ فَبِمَآ أَغْوَيْتَنِي } أي: فبسبب ما بعدتني وأطردتني لأجلهم { لأَقْعُدَنَّ } وألزمن البتة { لَهُمْ } لإغوائهم وإضلالهم { صِرَاطَكَ ٱلْمُسْتَقِيمَ } [الأعراف: 16] أي: على دينك وطريقتك الموصل لهم إلى توحيدك\n أغويهم وأوسوسهم بأنواع الوسوسة بعضهمب بالفسق والظلم\n وبعضهم بالرياء والسمعة\n وبعضهم بالمخائل الفاسدة من اللذات الوهمية والخيالية\n وبالجملة: أوسوسهم وأخرجهم بأنواع الحيل عن جادة توحيدك\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n[الحِجر:38] وهو نفخ الصور النخة الأولى، { قال فبِمَا أغويتني } أي: بعد أن أمهلتني لأجتهدن في إغوائهم بأي طريق يمكنني، بسبب إغوائك إياي، والله { لأقعدنّ لهم صراطك المستقيم } ، وهو الطريق الذي يوصلهم إليك، فأقعد فيه، وأردهم عنه، { ثم لآتينّهم من بين أيديهم ومن خلفهم وعن أيمانهم وعن شمائلهم } فآتيهم من الجهات الأربع، وذلك عبارة عن تسلطه على بني آدم كيفما أمكنه",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:82",
      "similarity": 0.6115439096988168
    },
    {
      "verse": "37:32",
      "similarity": 0.6110107535525268
    },
    {
      "verse": "53:2",
      "similarity": 0.5626240732864723
    },
    {
      "verse": "15:39",
      "similarity": 0.5616525120813755
    },
    {
      "verse": "26:224",
      "similarity": 0.5231337346854824
    }
  ]
}