{
  "chapter": "الأعراف",
  "text": "وقطعنهم فى الارض امما منهم الصلحون ومنهم دون ذلك وبلونهم بالحسنت والسيـات لعلهم يرجعون",
  "translations": [
    {
      "translation": "And We divided them into nations in the earth. Some of them are righteous and some are other than that. We tried them with good and evil so that hopefully they would return.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We dispersed them in groups over the earth, some righteous, some otherwise; and We tried them with good things and bad, that they may haply turn back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We dispersed them through the earth in communities - some were righteous, others were not -and We tested them with prosperity and adversity that they may turn back (to righteousness).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We divided them into nations on the earth; some are righteous and others are not. We tested them with well-being and hardship so that they might return (to the right path).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We divided them in the earth as separate groups; some of them are righteous and some are the other type; and We tested them with good (favours) and evil things (adversities) so that they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have broken them (the Jews) up into various separate groups on the earth: some of them are righteous and some are away from that. And We tried them with good (blessings) and evil (calamities) in order that they might turn (to Allah).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We cut them up on the earth into parties, (some) of them being righteous and (others) of them falling short of that, and We tried them with blessings and misfortunes that they might turn.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We cut them up into nations in the earth, some of them righteous, and some of them otherwise; and We tried them with good things and evil, that haply they should return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have sundered them in the earth as (separate) nations. Some of them are righteous, and some far from that. And We have tried them with good things and evil things that haply they might return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We split them up into sections on the earth. Some of them are righteous while some of them are otherwise, and We tested them with blessings and misfortunes, so that they might return to the right path.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We cut them up into communities on the earth; some of them righteous, and some of them otherwise; and We proved them wifh good and evil that haply they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We dispersed them into communities around the earth: some of them were righteous, and some of them otherwise, and We tested them with good and bad [times] so that they may come back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We broke them up into sections on this earth. There are among them some that are the righteous, and some that are the opposite. We have tried them with both prosperity and adversity: In order that they might turn (to us).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have broken them (i.e. the Jews) up into various separate groups on the earth, some of them are righteous and some are away from that. And We tried them with good (blessings) and evil (calamities) in order that they might turn (to Allah's Obedience).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We dispersed them through the earth in nations some were righteous, others were not, and tested them with good and evil in order that they return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We scattered them into communities on earth. Some of them righteous, and some of them short of that. And We tested them with fortunes and misfortunes, so that they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We divided them throughout the earth into nations. Of them some were righteous, and of them some were otherwise. And We tested them with good [times] and bad that perhaps they would return [to obedience].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:168] And We divided them, We separated them, into communities, sects, in the earth. Some of them are righteous, and some of them, people [who], are otherwise, disbelievers and wicked individuals. And We tried them with good things, with graces, and evil things, with misfortunes, so that they might revert, from their wickedness.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف قصة على قصة ، وهو عود إلى قصص الإخبار عن أحوالهم ، فيجوز أن يكون الكلام إشارة إلى تفرقهم بعد الاجتماع ، والتقطيع التفريق ، فيكون محموداً مثل { وقطّعناهم اثنتي عشرة أسباطاً } \\[ الأعراف : 160 \\] ، ويكون مذموماً ، فالتعويل على القرينة لا على لفظ التقطيع .فالمراد من الأرض الجنس أي في أقطار الأرض .و { أمماً } جمع أمّة بمعنى الجماعة ، فيجوز أن يكون المراد هنا تقطيعاً مذموماً أي تفريقاً بعد اجتماع أمتهم فيكون إشارة إلى أسر بني إسرائيل عندما غزا مملكة إسرائيل ( شلمناصرُ ) مَلك بابل . ونقلهم إلى جبال انشور وأرض بابل سنة 721 قبل الميلاد . ثم أسر ( بُخْتنصّر ) مملكة يهوذا وملكها سنة 578 قبل الميلاد ، ونقل اليهود من ( أرشليم ) ولم يبق إلاّ الفقراء والعجّز . ثم عادوا إلى أرشليم سنة 530 ، وَبَنوْا البيت المقدس إلى أن أجلاهم ( طيطوس ) الروماني ، وخرّب بيت المقدس في أوائل القرن الثاني بعد الميلاد ، فلم تجتمع أمتهم بعد ذلك فتمزقوا أيدي سبأ .ووصف الأمم بأنهم { منهم الصالحون } إيذان بأن التفريق شمل المذنبين وغيرهم ، وأن الله جعل للصالحين منزلة إكرام عند الأمم التي حلّوا بينها ، كما دل عليه قوله : { وبلوناهم بالحسنات والسيّئات }.وشمل قوله : { ومنهم دون ذلك } كل من لم يكن صالحاً على اختلاف مراتب فقدان الصلاح منهم .و { الصالحون } هم المتمسكون بشريعة موسى والمصدقون للأنبياء المبعوثين من بعده والمؤمنون بعيسى بعد بعثته ، وأن بني إسرائيل كانوا بعد بعثة عيسى غير صالحين إلاّ قليلاً منهم : الذين آمنوا به ، وزادوا بعد بعثة محمد صلى الله عليه وسلم وعدم إيمانهم به ، بُعداً عن الصلاح إلاّ نفراً قليلاً منهم مثل عبد لله بن سَلام ، ومخيريق .وانتصب { دونَ ذلك } على الظرفية وصفاً لمحذوف دل عليه قوله : { منهم } أي ومنهم فريق دون ذلك ، ويجوز أن تكون ( مِن ) بمعنى بعض اسماً عند من يجوّز ذلك ، فهي مبتدأ ، و { دون } خبر عنه .ويحتمل أن تكون الآية تشير إلى تفريقهم في الأرض في مدة ملوك بابل ، وإنهم كانوا في مدة إقامتهم ببابل { منهم الصالحون } مثل ( دانيال ) وغيره ، ومنهم دون ذلك ، لأن التقسيم بمِنهم مشعر بوفرة كلا الفريقين .وقوله : { وبلوناهم بالحسنات والسيئات } أي أظهرنا مختلف حال بني إسرائيل في الصبر والشكر ، أو في الجزع والكفر ، بسبب الحسنات والسيئات ، فهي جمع حسنة وسيئة بمعنى التي تَحسن والتي تَسوء ، كما تقدم في قوله : { فإذا جاءتهم الحسنة قالوا لنا هذه وإن تصبهم سيئةٌ يطيّروا بموسى ومن معه } \\[ الأعراف : 131 \\] وعلى هذا يكون الحسنات والسيئات تفصيلاً للبلوى ، فالحسنات والسيئات من فعل الله تعالى ، أي بالتي تحسن لفريق الصالحين وبالتي تسوء فريق غيرهم ، توزيعاً لحال الضمير المنصوب في قوله : { بلوناهم }.وجملة : { لعلهم يرجعون } استئناف بياني أي رجاء أن يتوبوا أي حين يذكرون مدة الحسنات والسيئات ، أو حين يرون حسن حال الصالحين وسوء حال من هم دون ذلك ، على حسب الوجهين المتقدمين .والرجوع هنا الرجوع عن نقض العهد وعن العصيان ، وهو معنى التوبة .هذا كله جري على تأويل المفسرين الآية في معنى { قَطّعناهم }.ويجوز عندي أن يكون قوله : { وقطعناهم في الأرض أمماً } ، عوداً إلى أخبار المنن عليهم ، فيكون كالبناء على قوله : { وقطعناهم اثنتي عشرة أسباطاً أمماً } \\[ الأعراف : 160 \\] ، فيكون تقطيعاً محموداً ، والمراد بالأرض : أرض القدس الموعودة لهم أي لكثرناهم فعمروها جميعها ، فيكون ذكر الأرض هنا دون آية { وقطعناهم اثنتي عشرة أسباطاً أمماً } \\[ الأعراف : 160 \\] للدلالة على أنهم عمروها كلها ، ويكون قوله : { منهم الصالحون } إنصافاً لهم بعد ذكر أحوال عدوان جماعاتهم وصم آذانهم عن الموعظة ، وقوله : { وبلوناهم } إشارة إلى أن الله عاملهم مرة بالرحمة ومرة بالجزاء على أعمال دهمائهم .\n\n",
      "translations": [
        {
          "translation": "(And We have sundered them) We have divided them (in the earth as (separate) nations) tribes, distinctly from each other. (Some of them are righteous) nine tribes and a half, beyond the River al-Raml, (and some far from that) the rest of the believers from among the Children of Israel; it is also said that this means: and far from that are the disbelievers of the Children of Israel. (And We have tried them with good things) and We have tested them with land fertility, abundance and comfort (and evil things) drought, lack of harvest and hardship (that haply they might return) they might repent of their transgression and disbelief.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَقَطَّعْنَاهُمْ فِي ٱلأَرْضِ أُمَماً } معناهُ فَرّقنَاهُم فِرقاً\n\n\n\n\nوقوله تعالى: { وَبَلَوْنَاهُمْ بِٱلْحَسَنَاتِ وَٱلسَّيِّئَاتِ } فالحَسَناتُ: الخِصْبُ\n والسَّيِّئاتُ: الجَدبُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {And We have divided them on the earth into nations} means that We have divided them into different groups.\n\n\nAnd His saying, {We will test them with good and with evil} - the good being abundance.\n And the most evil of things is the breaking of {promises}.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { أُمَمًا }: مفعول ثانٍ لقطَّعنا\n أو حال\n وجملة { منهم الصالحون }: صفة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "21:93",
      "similarity": 0.4629077841100164
    },
    {
      "verse": "23:30",
      "similarity": 0.41699515992721675
    },
    {
      "verse": "37:106",
      "similarity": 0.4045385358777973
    },
    {
      "verse": "18:7",
      "similarity": 0.40170686030037356
    },
    {
      "verse": "44:33",
      "similarity": 0.39954803057695687
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007168.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007168.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:168.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}