{
  "chapter": "الأعراف",
  "text": "فلما عتوا۟ عن ما نهوا۟ عنه قلنا لهم كونوا۟ قردة خسـين",
  "translations": [
    {
      "translation": "When they were insolent about what they had been forbidden to do, We said to them, 'Be apes, despised, cast out!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they persisted in doing what they had been forbidden, We said to them: \"Become (like) apes despised.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they persisted in pursuing that which had been forbidden We said: 'Become despised apes.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they crossed the limit of the prohibition, We made them turn into detested apes.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Consequently when they rebelled against the command to refrain, We said to them, “Be apes, despised!”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they exceeded the limits of what they were prohibited, We said to them: \"Be you monkeys, despised.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Therefore when they revoltingly persisted in what they had been forbidden, We said to them: Be (as) apes, despised and hated.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they turned in disdain from that forbidding We said to them, 'Be you apes, miserably slinking!'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they took pride in that which they had been forbidden, We said unto them: Be ye apes despised and loathed!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And then, when they disdainfully persisted in doing what they had been forbidden to do, We said to them, \"Be as apes, despised!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they exceeded the bounds of that which they were prohibited We said unto them: be ye apes despised.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they defied [the command pertaining to] what they were forbidden from, We said to them, ‘Be you spurned apes.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When in their insolence they transgressed (all) prohibitions, We said to them: \"Be ye apes, despised and rejected.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they exceeded the limits of what they were prohibited, We said to them: \"Be you monkeys, despised and rejected.\" (It is a severe warning to the mankind that they should not disobey what Allah commands them to do, and be far away from what He prohibits them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they had scornfully persisted in what they had been forbidden, We said to them: 'Be apes, despised'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then, when they rebelled against the commands to refrain, We said to them, “Be despicable apes.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when they were insolent about that which they had been forbidden, We said to them, \"Be apes, despised.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:166]   And when they disdained, to desist from, that which was prohibited to them, We said to them, ‘Be apes, despised!’, abased, and they became so: this is an explication of what preceded [with regard to the details of their ‘grievous chastisement’]. Ibn ‘Abbās said, ‘I do not know what befell the group that abstained’. ‘Ikrima said, ‘That group was not destroyed because they had been averse to what the others did and had said, ‘Why do you preach (admonition) …’ Al-Hākim reported [in a hadīth] that he [‘Ikrima] referred this opinion to Ibn ‘Abbās, who was delighted by it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(So when they took pride in) when they refused to refrain from (that which they had been forbidden, We said unto them: Be ye apes despised and loathed!) humiliated and abominated!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَماَّ عَتَوْاْ عَن مَّا نُهُواْ عَنْهُ } أي: فالحاصل أنهم لمَّا تكبروا عن امتثال أوامرنا واجتناب نواهينا { قُلْنَا لَهُمْ } على لسان نبيهم داود: { كُونُواْ } أيها المتكبرون المنهمكون في الغي والضلال { قِرَدَةً خَاسِئِينَ } [الأعراف: 166] صاغرين مهانين؛ لاستكباركم عن أوامر الله وتكيلفاته، مع أنكم مجبولون على تحمل التكاليف التي هي من أمارات الإنسان فلمَّا امتنعوا أنفسهم عنها مُسخوا لن لوازم الإنسانية بالمرة، ولُحقوا بأخس الحيوانات وأرذل الأعاجم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقال البيضاوي: { قلنا لهم كونوا } ، وهو كقوله:\n\n[النحل:40]، والظاهر يقتضي أن الله تعالى عذَّبهم أولاً بعذاب شديد فعتوا بعد ذلك، فمسخهم قردة وخنازير، ويجوز أن تكون الآية الثانية تقريرًا وتفصيلاً للأولى\n رُوِي أن الناهين لما أيسوا عن اتعاظ المعتدين، كرهوا مساكنتهم، فقسموا القرية بجدار فيه باب مطروق، فأصبحوا يومًا ولم يخرج إليهم أحد من المعتدين، فقالوا: إن لهم شأنًا، فدخلوا عليهم فإذا هم قردة، فلم يعرفوا أنسباءهم، ولكن القردة تعرفهم، فجعلت تأتي أنسباءهم وتشم ثيابهم، وتدور باكية حولهم، ثم ماتوا بعد ثلاثة أيام\n هـ\n الإشارة: المسخ على ثلاثة أقسام: مسخ الأشباح، ومسخ القلوب، ومسخ الأرواح، فمسخ الأشباح هو الذي وقع لبني إسرائيل، قيل: إنه مرفوع عن هذه الآمة، والصحيح: أنه يقع في آخر الزمان، ومسخ القلوب يكون بالانهماك في الذنوب، والإصرارعلى المعاصي، وعلامته: الفرح بتيسير العصيان، وعدم التأسف على ما فاته من الطاعة والإحسان، ومسخ الأرواح: الانهماك في الشهوات، والوقوف مع ظواهر الحسيات، أو تكثيف الحجاب، والوقوف مع العوائد والأسباب، دون مشاهدة رب الأرباب\n والله تعالى أعلم\n ثم ذكر عقوبة بني إسرائيل في الدنيا، فقال: { وَإِذْ تَأَذَّنَ رَبُّكَ لَيَبْعَثَنَّ عَلَيْهِمْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:65",
      "similarity": 0.7965801058941439
    },
    {
      "verse": "23:108",
      "similarity": 0.505824445329774
    },
    {
      "verse": "5:60",
      "similarity": 0.45050085553633956
    },
    {
      "verse": "67:4",
      "similarity": 0.3988933890235779
    },
    {
      "verse": "25:21",
      "similarity": 0.2413372811326454
    }
  ]
}