{
  "chapter": "الأعراف",
  "text": "فبدل الذين ظلموا۟ منهم قولا غير الذى قيل لهم فارسلنا عليهم رجزا من السماء بما كانوا۟ يظلمون",
  "translations": [
    {
      "translation": "But those of them who did wrong substituted words other than those they had been given. So We sent a plague on them from heaven for their wrongdoing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wicked among them changed and perverted the word We had spoken to a word unpronounced; so We sent from heaven retribution on them for all their wickedness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the wrong-doers among them substituted another word in place of the one told them. So We sent upon them a scourge from the heaven as a punishment for their Wrong-doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the unjust among them changed the words which they were told to say (in the prayer). Therefore, We sent upon them torment from the sky for their wrong deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So the unjust among them changed the words, contrary to what they had been commanded – consequently We sent down upon them a punishment from the sky – the recompense of their injustice.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those among them who did wrong, changed the word that had been told to them. So We sent on them a torment from the heaven in return for their wrongdoings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who were unjust among them changed it for a saying other than that which had been spoken to them; so We sent upon them a pestilence from heaven because they were unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the evildoers of them substituted a saying other than that which had been said to them; so We sent down upon them wrath out of heaven for their evildoing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those of them who did wrong changed the word which had been told them for another saying, and We sent down upon them wrath from heaven for their wrongdoing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "the transgressors among them substituted something else for the word they had been given. So We sent them a punishment from heaven for their wrongdoing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then those of them who did wrong changed the word that had been told them for anot her, whereupon We sent upon them a scourge from the heaven for they were wont to transgress.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the wrongdoers changed the saying with other than what they had been told. So We sent against them a plague from the sky because of the wrongs they used to commit.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the transgressors among them changed the word from that which had been given them so we sent on them a plague from heaven. For that they repeatedly transgressed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those among them who did wrong changed the word that had been told to them. So We sent on them a torment from heaven in return for their wrong-doings.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The wicked amongst them changed what was said for other words. Therefore We sent down upon them from heaven a punishment for their evil doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the wicked among them substituted other words for the words given to them; so We sent down upon them a plague from the sky, because of their wrongdoing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who wronged among them changed [the words] to a statement other than that which had been said to them. So We sent upon them a punishment from the sky for the wrong that they were doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:162] But the evildoers among them substituted a saying other than that which had been said to them, they said instead, ‘A grain inside a hair’ and entered [the gate] dragging themselves on their rears. So We sent down upon them terror, a chastisement, from the heaven for their evildoing.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nووقع في هذه الآية { فبدل الذين ظلموا منهم } ولم يقع لفظ { منهم } في سورة البقرة ، ووجه زيادتها هنا التصريحُ بأن تبديل القول لم يصدر من جميعهم ، وأجمل ذلك في سورة البقرة لأن آية البقرة لما سيقت مساق التوبيخ ناسب إرهابهم بما يوهم أن الذين فعلوا ذلك هم جميع القوم ، لأن تبعات بعض القبيلة تحمل على جماعتها .وقدم في سورة البقرة ( 58 ) قوله : { وادخلوا الباب سجداً } على قوله : { وقولوا حطة } \\[ البقرة : 58 \\] وعُكس هنا وهو اختلاف في الإخبار لمجرد التفنن ، فإن كلا القولين واقع قُدّم أو أُخّر .وذكر في البقرة ( 58) : { وكلوا منها حيث شئتم رَغَداً } ولم يذكر وصف رغداً هنا ، وإنما حكي في سورة البقرة ، لأن زيادة المنة أدخل في تقوية التوبيخ .وجملة سنزيد المحسنين } مستأنفة استئنافاً بيانياً لأن قوله : { تُغفرْ لكم } في مقام الامتنان بإعطاء نعم كثيرة مما يثير سؤال سائِل يقول : وهل الغفران هو قصارىَ جزائِهم؟ فأجيب بأن بعده زيادة الأجر على الإحسان ، أي على الامتثال .وفي نظير هذه الآية من سورة البقرة ( 58 ) ذكرت جملة { وسنزيد المحسنين } معطوفة بالواو على تقدير : قلنا لهم ذلك وقلنا لهم سنزيد المحسنين ، فالواو هنالك لحكاية الأقوال ، فهي من الحكاية لا من المحكي أي قلنا وقلنا سنزيد .وقرأ نافع ، وأبو جعفر ، ويعقوب { تُغفر } بمثناة فوقية مبنياً للمجهول ، و { خطيئاتُكم } بصيغة جمع السلامة للمؤنث وقرأه ابن كثير ، وعاصم ، وحمزة ، والكسائي ، وخلف : { نَغْفر } بالنون مبنياً للفاعل و { خطيئاتِكم } بصيغة جمع المؤنث السالم أيضاً وقرأه أبو عمرو { نغفر } بالنون و { خطاياكم } بصيغة جمع التكسير ، مثل آية البقرة ، وقرأ ابن عامر : { تُغفر } بالفوقية وخطيئتكم بالإفراد .والاختلاف بينها وبين آية البقرة في قراءة نافع ومن وافقه : تفنن في حكاية القصة .\n\n",
      "translations": [
        {
          "translation": "(But those of them who did wrong) the sinning people (changed the word which had been told them for another saying) they were commanded to say \"hittah [there is no deity except Allah; or as in the other meaning: forgive our sins\"] but instead said \"hintah [wheat]\", (and We sent down upon them wrath from heaven) We sent upon them the plague from heaven (for their wrong-doing) for changing what they were commanded to say.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَبَدَّلَ ٱلَّذِينَ ظَلَمُواْ مِنْهُمْ } أنفسهم بالخروج عمَّا أمرناهم { قَوْلاً } صداقاً صواباً قلنا لهم\n لإصلح حالهم { غَيْرَ ٱلَّذِي قِيلَ لَهُمْ } على لسان رسلنا\n بل حرفوها لفظاً ومعنى\n كما مر بيانه في سورة البقرة { فَأَرْسَلْنَا عَلَيْهِمْ } بسبب تبديلهم وتحريفهم { رِجْزاً مِّنَ ٱلسَّمَآءِ } أي: عذاباً نازلاً من جانب السماء { بِمَا كَانُواْ يَظْلِمُونَ } [الأعراف: 162] أي: بشؤم خروجهم عن مقتضى أوامرنا وأحكامنا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فأرسلنا عليهم رجزًا من السماء بما كانوا يظلمون } قد مر تفسيره\n وإشارته\n في سورة البقرة\n تنبيه: وقع اختلاف كثير في اللفظ بين هذا الموضع من هذه السورة وبين سورة البقرة\n في { انفجرت } و { انبجست } \n وقوله: { وإذ قلنا ادخلوا } و { إذا قيل لهم اسكنوا } \n وقوله هنا: { وكُلُوا } \n وهناك { فكُلُوا }\n فقال الزمخشري: لا بأس باختلاف العبارتين\n إذا لم يكن هناك تناقض\n ووجّه بعضهم الفرق بأن ما في هذه السورة سيق في محل الغضب والعقاب على عبادة العجل\n وما في سورة البقرة سيق في محل الامتنان\n فلذلك عبَّر هنا بانبجست لأنه أقل من انفجرت\n وعبَّر هنا بقيل مبنيًا للمجهول تحقيرًا لهم أن يذكر نفسه لهم\n وعبَّر هنا بالسكنى لأنه أشق من الدخول ويستلزمه\n وعبَّر هنا بالواو لأن السكنى تجامع الأكل\n بخلاف الدخول\n فإن الأكل مسبب عنه\n فعبَّر بالفاء\n وزاد في البقرة الواو في: { سنزيد } \n كأنه نعمة أخرى\n بخلاف هذا\n وزاد هنا { منهم } لتقدم ذكرهم في قوله: { وإذ قيل لهم } \n وعبّر هنا بالظلم لأنه أعم من الفسق وغيره\n والله تعالى أعلم\n ثم ذكر اعتداءهم في السبت وما ترتب عليه\n فقال: { وَسْئَلْهُمْ عَنِ ٱلْقَرْيَةِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:59",
      "similarity": 0.9260905705752228
    },
    {
      "verse": "45:11",
      "similarity": 0.7559550559957738
    },
    {
      "verse": "74:5",
      "similarity": 0.7298676021243216
    },
    {
      "verse": "29:34",
      "similarity": 0.7162545002811005
    },
    {
      "verse": "34:5",
      "similarity": 0.6153746195432294
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007162.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007162.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:162.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}