{
  "chapter": "الأعراف",
  "text": "ولقد ذرانا لجهنم كثيرا من الجن والانس لهم قلوب لا يفقهون بها ولهم اعين لا يبصرون بها ولهم ءاذان لا يسمعون بها او۟لئك كالانعم بل هم اضل او۟لئك هم الغفلون",
  "translations": [
    {
      "translation": "We created many of the jinn and mankind for Hell. They have hearts they do not understand with. They have eyes they do not see with. They have ears they do not hear with. Such people are like cattle. No, they are even further astray! They are the unaware.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many of the jinns and human beings have We destined for Hell, who possess hearts but do not feel, have eyes but do not see, have ears but do not hear, like cattle, even worse than them. They are people unconcerned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We have created for Hell many of the jinn and mankind; they have hearts with which they fail to understand; and they have eyes with which they fail to see; and they have ears with which they fail to hear. They are like cattle - indeed, even more astray. Such are utterly heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have destined many men and jinn for hell. They have hearts but do not understand, eyes but do not see. They have ears but do not hear. They are worse than lost cattle. These are the heedless ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have created many jinns and men for hell; they have hearts in which their is no understanding; and the eyes they do not see with; and the ears they do not hear with; they are like cattle – in fact more astray; it is they who are the neglectful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely, We have created many of the Jinn and mankind for Hell. They have hearts wherewith they understand not, and they have eyes wherewith they see not, and they have ears wherewith they hear not (the truth). They are like cattle, nay even more astray; those! They are the heedless ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We have created for hell many of the jinn and the men; they have hearts with which they do not understand, and they have eyes with which they do not see, and they have ears with which they do not hear; they are as cattle, nay, they are in worse errors; these are the heedless ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created for Gehenna many jinn and men: they have hearts, but understand not with them; they have eyes, but perceive not with them; they have ears, but they hear not with them. They are like cattle; nay, rather they are further astray. Those -- they are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Already have We urged unto hell many of the jinn and humankind, having hearts wherewith they understand not, and having eyes wherewith they see not, and having ears wherewith they hear not. These are as the cattle - nay, but they are worse! These are the neglectful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created many of the jinn and mankind for hell. They have hearts they do not understand with; they have eyes they do not see with; and they have ears they do not hear with. Such people are like cattle -- no, they are even more misguided. Such are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have created for Hell many of the genii and mankind; they have hearts wherewith they understand not, and they have eyes wherewith they see not, and they have ears wherewith they hearken not; they are like unto cattle; nay, they are further astray; those! they are the negligent ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We have winnowed out for hell many of the jinn and humans: they have hearts with which they do not understand, they have eyes with which they do not see, they have ears with which they do not hear. They are like cattle; indeed, they are more astray. It is they who are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many are the Jinns and men we have made for Hell: They have hearts wherewith they understand not, eyes wherewith they see not, and ears wherewith they hear not. They are like cattle,- nay more misguided: for they are heedless (of warning).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely, We have created many of the jinns and mankind for Hell. They have hearts wherewith they understand not, they have eyes wherewith they see not, and they have ears wherewith they hear not (the truth). They are like cattle, nay even more astray; those! They are the heedless ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For Gehenna, We have created many jinn and many humans. They have hearts, with which they cannot understand; eyes, with which they do not see; and ears, with which they do not hear. They are like cattle, rather, they are the more misguided. Such are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have destined for Hell multitudes of jinn and humans. They have hearts with which they do not understand. They have eyes with which they do not see. They have ears with which they do not hear. These are like cattle. In fact, they are further astray. These are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have certainly created for Hell many of the jinn and mankind. They have hearts with which they do not understand, they have eyes with which they do not see, and they have ears with which they do not hear. Those are like livestock; rather, they are more astray. It is they who are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:179] And We have indeed urged unto Hell many of the jinn and mankind, having hearts wherewith they do not understand, the truth, and having eyes wherewith they do not perceive, the proofs of God’s power with a perception that entails reflection, and having ears wherewith they do not hear, the signs or the admonitions, in a way so as to reflect and take heed. These, they are like cattle, in their failure to understand, perceive or listen — nay, rather they are further astray, than cattle, because [at least] they [cattle] seek what is beneficial to them and stay away from what is harmful to them: these individuals, on the other hand, are proceeding towards the Fire, out of [sheer] obstinacy. These — they are the heedless.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Already have We urged unto) We created for (hell many of the jinn and humankind, having hearts wherewith they understand not) the Truth, (and having eyes wherewith they see not) the Truth, (and having ears wherewith they hear not) the Truth. (These are as the cattle) in relation to understanding the Truth (nay, but they are worse!) because they are disbelievers (These are the neglectful) those who are oblivious to the matter of the Hereafter, deniers of it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أولئك كالأنعام } لفقدان إدراك الحقائق والمعارف التي تقرّبهم من الله بالقلوب وعدم الاعتبار بالأعين والإذكار بالأسماع { بل هم أضلّ } لوجود الشيطنة فيهم الموجبة للبعد بفساد العقائد وكثرة المكايد { ولله الأسماء الحسنى } قد مرّ أن كل اسم هو الذات مع صفة",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { وَلَقَدْ ذَرَأْنَا } أوجدنا وأظهرنا { لِجَهَنَّمَ } البعد والخذلان ونيران الإمكان والحرمان { كَثِيراً مِّنَ ٱلْجِنِّ وَٱلإِنْسِ } مع أن { لَهُمْ قُلُوبٌ } هي مناط التكاليف ومحال الإيمان والإيقان\n وهم { لاَّ يَفْقَهُونَ بِهَا } ليحصل لهم مرتبة اليقين العلمي واللدني { وَلَهُمْ } أيضاً { أَعْيُنٌ } هي سبب مشاهدة الآثار والاستدلال منها على الأوصاف الموجدة لها\n المرتبة على الذات الإلهي\n وهم { لاَّ يُبْصِرُونَ بِهَا } ليحصل لهم مرتبة اليقين العيني\n\n\n{ وَلَهُمْ } أيضاً { آذَانٌ } وهي آلات السماع كلمة الحق ووسائق إلى اكتساب الفاضائل المنبهة على ما في نفوسهم من الأسرار المكنونة الإلهية\n وهم { لاَّ يَسْمَعُونَ بِهَآ } ليحصل لهم الترقي إلى مرتبة اليقين العيني إلى اليقين الحقي\n وبالجملة: { أُوْلَـٰئِكَ } الحمقاء الجهلاء\n المتصفون بأوصاف العقلاء\n العرفاء { كَٱلأَنْعَامِ } في عدم الشعور والتنبه { بَلْ هُمْ } بسبب تضييع استعدادهم { أَضَلُّ } من الأنعام بمراتب\n وبالجملة: { أُوْلَـٰئِكَ هُمُ ٱلْغَافِلُونَ } [الأعراف: 179] المقصرون على الغفلة المؤبدة\n المتناهون فيها أقصى الغاية\n\n\n{ وَ } اعلموا أيها الفضلاء العرفاء",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { ولقد ذرأنا } خلقنا { لجهنم كثيرًا من الجن والإنس } كتبنا عليهم الشقاء في سابق الأزل، فهم من قبضة أهل النار، كما قال:\n \" هؤلاء إلى الجنة ولا أُبالي، وهؤلاء إلى النار ولا أبالي \". \nثم ذكر علامتهم فقال: { لهم قلوبٌ لا يفقهون بها } المواعظ والتذكير للأكنة التي جعلت عليها، { ولهم أعين لا يبصرون بها } دلائل وحدانيتنا وكمال قدرتنا، فلا ينظرون بها نظر اعتبار، { ولهم آذان لا يسمعون بها } الآيات والمواعظ، سماع تأمل وتدبير، { أولئك كالأنعام } في عدم التفقه والاستبصار، أو في أن هممهم ومشاعرهم متوجهة إلى أسباب التعيش، مقصورة عليها، فهممهم في بطونهم وفروجهم، { بل هم أضلُّ } من الأنعام، لأنها تطلب منافعها وتهرب من مضارها، وهؤلاء يقدمون على النار معاندة، وأيضًا: الأنعام رُفع عنها التكليف فلا تعذب، يخلاف الكافر، وأيضًا: البهائم تقبل الرياضة والتأديب لِمَا يراد بها، والكافر عاص على الدوام، { أولئك هم الغافلون } الكاملون في الغفلة المنهمكون فيها. الإشارة: النار على قسمين: حسية ومعنوية، كما أن الجنة كذلك، فالنار الحسية لتعذيب الأشباح، والنار المعنوية لتعذيب الأرواح، والجنة الحسية لنعيم الأشباح، والمعنوية لنعيم الأرواح. النار الحسية معلومة. والنار المعنوية هي نار القطيعة وغم الحجاب، وأهلها هم أهل الغفلة، وهم كثير من الجن والإنس، ليس لهم قلوب تجول في معاني التوحيد، وليس لم أعين تنظر بعين الاعتبار، وليس لهم آذان تسمع المواعظ والتذكار، إن هم إلا كالأنعام، غير أن الله تعالى تفضل عليهم برسم الإسلام. والجنة الحسية هي جنة الزخارف، والجنة المعنوية هي جنة المعارف، وأعدها الله لقلوب تجول في الأنوار والأسرار، ولأعين تنظر بعين الأعتبار والاستبصار، حتى تشاهد أنوار الواحد القهار، ولآذان تسمع المواعظ والتذكار، وتعي ما تسمع من الحكم والأسرار، وبالله التوفيق. ثم عرَّف بذاته بتعريف أسمائه، فقال: { وَللَّهِ ٱلأَسْمَآءُ ٱلْحُسْنَىٰ فَٱدْعُوهُ بِهَا }.\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:79",
      "similarity": 0.6114609572424065
    },
    {
      "verse": "67:24",
      "similarity": 0.6106532585655019
    },
    {
      "verse": "42:11",
      "similarity": 0.5982011849514018
    },
    {
      "verse": "16:13",
      "similarity": 0.4940328059821663
    },
    {
      "verse": "6:136",
      "similarity": 0.42053212675784823
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/7:179.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/7:179.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/7:179.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}