{
  "chapter": "الأعراف",
  "text": "ساء مثلا القوم الذين كذبوا۟ بـايتنا وانفسهم كانوا۟ يظلمون",
  "translations": [
    {
      "translation": "How evil is the metaphor of those who deny Our Signs. It is themselves that they have badly wronged.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil is the case of those who deny Our signs and wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil is the example of the people who reject Our signs as false and perpetrate wrong against their own selves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How terrible is the example of those who have rejected Our revelations and have done injustice only to themselves!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "What an evil example is of those who denied Our signs and used to wrong only their own souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil is the parable of the people who rejected Our Ayat, and used to wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil is the likeness of the people who reject Our communications and are unjust to their own souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "An evil likeness is the likeness of the people who cried lies to Our signs, and themselves were wronging.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil as an example are the folk who denied Our revelations, and were wont to wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How evil is the case of those who deny Our signs. They only wrong themselves:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Vile is the likeness of the people who belie Our signs, and their own souls they are wont to wrong.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil is the parable of the people who deny Our signs and wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil as an example are people who reject Our signs and wrong their own souls.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil is the likeness of the people who reject Our Ayat (proofs, evidences, verses and signs, etc.), and used to wrong their ownselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil is the example of those who belied Our verses; they wronged themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Evil is the metaphor of the people who reject Our signs and wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How evil an example [is that of] the people who denied Our signs and used to wrong themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:177] Evil as an example are the people, evil is the example of the people, who denied Our signs, and were wont to wrong themselves, through denial.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Evil as an example are the folk who denied Our revelations) Muhammad (pbuh) and the Qur'an, if their example is as that of a dog, (and were wont to wrong themselves) to harm themselves by being tortured.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ سَآءَ مَثَلاً ٱلْقَوْمُ } أي: بئس المثل مثل القوم { ٱلَّذِينَ كَذَّبُواْ بِآيَاتِنَا } وأعرضوا عنها منكرين عليها { وَأَنفُسَهُمْ كَانُواْ يَظْلِمُونَ } [الأعراف: 177] أي: وما يظلمون بالإعراض والإنكار إلا أنفسهم؛ إذ عاد عليهم وباله ونكاله، ولكن لا يشعرون؛ لفساد قلوبهم وخبث طينتهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ساءَ } أي: قبح { مثلاً } مثل { القومُ الذين كذَّبوا بآياتنا } حيث شُبهوا بالكلاب اللاهثة، { وأنفسَهم كانوا يظلمون } بتعريضها للهلاك\n قال البيضاوي: إما أن يكون داخلاً في الصلة، معطوفًا على { الذين كذبوا } ، بمعنى: الذين جمعوا بين تكذيب الآيات وظلم أنفسهم، أو منقطعًا عنها، بمعنى: وما ظلموا بالتكذيب إلا أنفسهم، فإن وباله لا يتخطاها ولذلك قدّم المفعول\n هـ\n { مَن يهد الله فهو المهتدي ومن يضلل فأولئك هم الخاسرون } ، هو تصريح بأن الهدى والضلال بيد الله تعالى، وأنَّ هداية الله يخص بها بعضًا دون بعض، وأنها مستلزمة للاهتداء، والإفراد في الأول والجمع في الثاني لاعتبار اللفظ والمعنى، تنبيهًا على أن المهتدين كواحد لاتحاد طريقهم، بخلاف الضالين\n والاقتصار في الإخبار عمّن هداه الله بالمهتدي: تعظيمٌ لشأن الاهتداء، وتنبيه على أنه، في نفسه، كمال جسيم، ونفع عظيم، لو لم يحصلُ له غيره لكفاه، وأنه المستلزم للفوز بالنعم الآجلة والعنوان لها\n قاله البيضاوي\n الإشارة: في الحديث:\n\n \" أشَدُّ النَّاس عَذَابًا يَومَ القِيَامَةِ عَالِمٌ لَم يَنفَعهُ عِلمُه \" \n\nوالعلم النافع هو الذي تصحبه الخشية والمراقبة والتعظيم والإجلال، ويوجب لصاحبه الزهد والسخاء والتواضع والأنكسار، وهو علم التوحيد الخاص، الذي هو مشاهدة الحق\n وقال الورتجبي في قوله: { آتيناه آياتنا فانسلخ منها }: ذكر أنه تعالى أعطاه أياته، ولو أعطاه قرب مشاهدته ما انسلخ منه، لأن من رآه أحبه، ومن أحب استأنس به واستوحش مما سواه، فمن ذلك تبين أنه كان مستدرجًا بوجدان آياته، وتصديق ذلك ما أخبر سبحانه من ارتداده عن دينه، واشتغاله بهواه وعداوة كليمه بقوله: { فأتبعه الشيطان فكان من الغاوين } ، ولو ذاق طعم حبه لم يلتفت إلى غيره، مُكِرَ به في الأزل، فكان مكره مستدامًا إلى الأبد، فالكرامات الظاهرة عارضه للامتحان بين الأزل والأبد، وعند الأصل القديم لا يعتبر العرض الطارىء\n\n\nهـ\n وقال في الإحياء: إن بلعم أوتي كتاب الله تعالى فأخلد إلى الشهوات، فشُبه بالكلب، أي: سواء أوتي الحكمة أو لم يؤتها فهو يلهث إلى الشهوات\n هـ\n وفي ذكر قصته تحذير لعلماء هذه الأمة وصلحائها\n وقال الشيخ أبو الحسن رضي الله عنه: من أخلدت نفسه إلى أرض الشهوات، وغلبته عن النهوض إلى الطاعات، فدواؤه في حرفين، أحدهما: أن يذكر منّة الله عليه بنعمة الإيمان والإسلام، ويقيد هذه النعمة بالشكر، لئلا تفلت من يده، والثاني: أن يتوجه إلى الله بالتضرع والاضطرار، آناء الليل والنهار، وفي رمضان راجيًا الإجابة، قائلاً: اللهم سَلِّم سَلِّم\n فإن أهمل هاتين الخصلتين فالشقاوة لازمة له\n هـ\n بالمعنى لطول العهد به\n وبالله التوفيق\n ثم ذكر علامة أهل الضلالة والخسران، فقال: { وَلَقَدْ ذَرَأْنَا لِجَهَنَّمَ كَثِيراً مِّنَ ٱلْجِنِّ وَٱلإِنْسِ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:46",
      "similarity": 0.4755817106466373
    },
    {
      "verse": "4:110",
      "similarity": 0.37377740431311696
    },
    {
      "verse": "16:60",
      "similarity": 0.37275533774556463
    },
    {
      "verse": "36:15",
      "similarity": 0.35175988715817286
    },
    {
      "verse": "78:28",
      "similarity": 0.3475084883996421
    }
  ]
}