{
  "chapter": "الأعراف",
  "text": "ثم لءاتينهم منۢ بين ايديهم ومن خلفهم وعن ايمنهم وعن شمائلهم ولا تجد اكثرهم شكرين",
  "translations": [
    {
      "translation": "Then I will come at them, from in front of them and behind them, from their right and from their left. You will not find most of them thankful.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And I shall come upon them from the front and behind, right and left; and You will not find among them many who would give thanks.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then I will come upon them from the front and from the rear, and from their right and from their left. And You will not find most of them thankful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "I shall attack them from all directions and You will not find many of them giving You thanks\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Then I will certainly approach them – from their front and from behind them and from their right and from their left; and You will find most of them not thankful.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then I will come to them from before them and behind them, from their right and from their left, and You will not find most of them to be thankful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then I will certainly come to them from before them and from behind them, and from their right-hand side and from their left-hand side; and Thou shalt not find most of them thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then I shall come on them from before them and from behind them, from their right hands and their left hands; Thou wilt not find most of them thankful.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then I shall come upon them from before them and from behind them and from their right hands and from their left hands, and Thou wilt not find most of them beholden (unto Thee).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "then I will surely come upon them from before them and from behind them and from their right and from their left, and then You will find most of them ungrateful.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then surely I will come upon them from before them and from behind them and from their right and from their left, and Thou shalt not find the most of them thankful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then I will come at them from their front and from their rear, and from their right and their left, and You will not find most of them to be grateful.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then will I assault them from before them and behind them, from their right and their left: Nor wilt thou find, in most of them, gratitude (for thy mercies).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then I will come to them from before them and behind them, from their right and from their left, and You will not find most of them as thankful ones (i.e. they will not be dutiful to You).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and come upon them from the front and from the rear, from their right and from their left. Then, You shall find most of them ungrateful'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then I will come at them from before them, and from behind them, and from their right, and from their left; and you will not find most of them appreciative.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then I will come to them from before them and from behind them and on their right and on their left, and You will not find most of them grateful [to You].\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:17] Then I shall come upon them from before them and from behind them and from their right and from their left, that is to say, from every side, and prevent them from following it [that path]. Ibn ‘Abbās said, ‘However, he cannot come upon them from above, lest he come between the servant and the mercy of God, exalted be He’. And You will not find most of them thankful’, believing.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then I shall come upon them from before them) with regard to the Hereafter that there is no hell, Paradise, resurrection or reckoning (and from behind them) that the life of this world is everlasting and I shall bid them to amass and withhold out of stinginess and I will order them to commit corruption (and from their right hands) vis-a-vis the religion: I shall confuse those who are guided until they leave the guidance, and I shall make it seem fair to those who are misguided such that they remain misguided (and from their left hands) as regard pleasures and delights, (and Thou wilt not find most of them) all of them (beholden (unto Thee)) believers in You.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ثُمَّ } بعدما أرد وسوستي في نفوسههم { لآتِيَنَّهُمْ مِّن } جميع جهاتهم { بَيْنِ أَيْدِيهِمْ } أي: يضلهم بالمعاصي الحاصلة من قدامهم { وَمِنْ خَلْفِهِمْ } أي: بالمعاصي الحاصلة منه { وَ } أيضاً { عَنْ أَيْمَانِهِمْ وَعَن شَمَآئِلِهِمْ وَ }  بالجملة: استسخرهم وأحيط عليهم بإغوائي ووسوستي إلى حيث { لاَ تَجِدُ } يا معز كل ذليل\n ومدل كل دليل { أَكْثَرَهُمْ شَاكِرِينَ } [الأعراف: 17] بعد رجوعهم إليك شاكرين\n صارفين ما آتيتهم من النعم إلى ما أمرتهم به\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال ابن عباس: { من بين أيديهم }: الدنيا يُزيّنها لهم\n { ومن خلفهم }: الآخرة يُنسيها لهم\n { وعن أيمانهم }: الحسنات يُثبطهم عنها\n { وعن شمائلهم }: السيئات يُزينها في أعينهم\n هـ\n ولم يجعل له سبيلاً من فوقهم\n ولا من تحت أرجلهم لأن الرحمة تنزل من أعلى\n فلم يحل بينهم وبينها\n والإتيان من تحت موحش\n وأيضًا: السفليات محل للتواضع والخشوع\n فتكثر فيه الأنوار فيحترق بها\n وقال الشيخ أبو العباس المرسي رضي الله عنه:  لإنَّ فوق: التوحيد\n وتحت: الإسلام\n ولا يمكن أن يأتي من توحيد ولا إسلام\n ثم قال تعالى: { ولا تجدُ أكثرَهم شاكرين } مطيعين\n قال بعض الصوفية:  لو كان ثم مقام أعظم من الشكر لذكره إبليس فالشكر أعظم المقامات\n وهو الطريق المستقيم الذي قعد عليه إبليس\n والشكر: هو ألا يُعصى الله بنعمه\n أو: صرف الجوارح كلها في طاعة الله\n أو رؤية المنعم في النعمة\n وإنما قال إبليس ذلك ظنًا لقوله:\n[سَبَأ:20]\n وسيأتي في الإشارة حقيقته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:41",
      "similarity": 0.6747876425483579
    },
    {
      "verse": "50:17",
      "similarity": 0.6712194449202096
    },
    {
      "verse": "69:25",
      "similarity": 0.5160107013067485
    },
    {
      "verse": "16:48",
      "similarity": 0.29112592307932317
    },
    {
      "verse": "34:15",
      "similarity": 0.2716951811949003
    }
  ]
}