{
  "chapter": "الأعراف",
  "text": "واذ اخذ ربك منۢ بنى ءادم من ظهورهم ذريتهم واشهدهم على انفسهم الست بربكم قالوا۟ بلى شهدنا ان تقولوا۟ يوم القيمة انا كنا عن هذا غفلين",
  "translations": [
    {
      "translation": "When your Lord took out all their descendants from the loins of the children of Adam and made them testify against themselves 'Am I not your Lord?' they said, 'We testify that indeed You are!' Lest you say on the Day of Rising, 'We knew nothing of this.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your Lord brings forth from their loins the offspring of the children of Adam, He makes them witnesses over themselves, (and asks): \"Am I not your Lord?\" 'Indeed,' they reply. 'We bear witness,' -- lest you should say on the Day of Resurrection: \"We were not aware of this;\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall (O Prophet) when your Lord brought forth descendants from the loins of the sons of Adam, and made them witnesses against their ownselves. asking them: 'Am I not your Lord?' They said: 'Yes, we do testify.' We did so lest you claim on the Day of Resurrection: 'We were unaware of this.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your Lord asked all the offspring of Adam (before their birth), \"Am I not your Lord?\" All of them testified and bore witness to their testimony that on the Day of Judgment they would not say, \"We were not aware of this (fact),\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember when your Lord brought forth the generations from the backs of the Descendants of Adam, and made them their own witness; “Am I not your Lord?”; they all said, “Yes surely You are, why not? We testify”; for you may say on the Day of Resurrection that, “We were unaware of this.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when your Lord brought forth from the Children of Adam, from their loins, their seed and made them testify as to themselves (saying): \"Am I not your Lord\" They said: \"Yes! We testify,\" lest you should say on the Day of Resurrection: \"Verily, we were unaware of this.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when your Lord brought forth from the children of Adam, from their backs, their descendants, and made them bear witness against their own souls: Am I not your Lord? They said: Yes! we bear witness. Lest you should say on the day of resurrection: Surely we were heedless of this.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thy Lord took from the Children of Adam, from their loins, their seed, and made them testify touching themselves, 'Am I not your Lord?' They said, 'Yes, we testify'-- lest you should say on the Day of Resurrection, 'As for us, we were heedless of this,'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when thy Lord brought forth from the Children of Adam, from their reins, their seed, and made them testify of themselves, (saying): Am I not your Lord? They said: Yea, verily. We testify. (That was) lest ye should say at the Day of Resurrection: Lo! of this we were unaware;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your Lord brought forth offspring from the loins of the Children of Adam and made them bear witness about themselves, He said, \"Am I not your Lord?\" They replied, \"We bear witness that You are.\" This He did, lest you should say on the Day of Resurrection, \"We had no knowledge of that.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time thy Lord took from the children of Adam their posterity from their backs, and made them testify as to them selves saying: am I not your lord? They said: Yea! we testify. That was lest ye should say on the Day of Resurrection verily of this we have been unaware.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your Lord took from the Children of Adam, from their loins, their descendants and made them bear witness over themselves, [He said to them,] ‘Am I not your Lord?’ They said, ‘Yes indeed! We bear witness.’ [This,] lest you should say on the Day of Resurrection, ‘Indeed we were unaware of this,’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When thy Lord drew forth from the Children of Adam - from their loins - their descendants, and made them testify concerning themselves, (saying): \"Am I not your Lord (who cherishes and sustains you)?\"- They said: \"Yea! We do testify!\" (This), lest ye should say on the Day of Judgment: \"Of this we were never mindful\":\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when your Lord brought forth from the Children of Adam, from their loins, their seed (or from Adam's loin his offspring) and made them testify as to themselves (saying): \"Am I not your Lord?\" They said: \"Yes! We testify,\" lest you should say on the Day of Resurrection: \"Verily, we have been unaware of this.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When your Lord brought forth descendants from the loins of Adam's children, and made them testify concerning themselves (He said): 'Am I not your Lord.' They replied: 'We bear witness (that You are)' Lest you should say on the Day of Resurrection: 'We had no knowledge of this'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when Your Lord summoned the descendants of Adam, and made them testify about themselves. “Am I not your Lord?” They said, “Yes, we testify.” Thus you cannot say on the Day of Resurrection, “We were unaware of this.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] when your Lord took from the children of Adam - from their loins - their descendants and made them testify of themselves, [saying to them], \"Am I not your Lord?\" They said, \"Yes, we have testified.\" [This] - lest you should say on the day of Resurrection, \"Indeed, we were of this unaware.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:172] And, remember, when your Lord took from the Children of Adam, from their loins (min zuhūrihim, is an inclusive substitution for the preceding [clause: min banī Ādama, ‘from the Children of Adam’], with the same preposition [min, ‘from’]) their seed, by bringing forth one from the loins of the other, [all] from the loins of Adam, offspring after offspring, in the way that they multiply, [looking] like small ants at [the valley of] Na‘mān on the Day of ‘Arafa [because of their multitude]. God set up proofs of His Lordship for them and endowed them with [the faculty of] reason, and made them testify against themselves, saying, ‘Am I not your Lord?’ They said, ‘Yea, indeed, You are our Lord, we testify’, to this, and this [taking of] testimony is, lest they should say (in both instances, read third person [yaqūlū, ‘they say’] or second person [taqūlū, ‘you say’]) on the Day of Resurrection, ‘Truly, of this, Oneness of God, we were unaware’, not knowing it!\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (remember) when thy Lord) Muhammad (brought forth) on the Day of the Covenant (from the Children of Adam, from their reins, their seed) He brought forth the seeds from their reins, (and made them testify of themselves, (saying): Am I not your Lord? They said: Yea, verily We testify) we know and acknowledge that You are our Lord. Allah then said to the angels: be witnesses over them; and let you be witnesses over one another. ((That was) lest ye should say) so that you do not say (at the Day of Resurrection: Lo! of this) covenant (we were unaware) we were not made to make pledge;\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n بل من الديدنة القديمة لبني آدم وقت { إِذْ أَخَذَ رَبُّكَ } يا أكمل الرسل { مِن بَنِيۤ ءَادَمَ } حيث أخرجهم { مِن ظُهُورِهِمْ } من ظهور آبائهم وأصلابهم على التوليد المتعارف { ذُرِّيَّتَهُمْ } أي: أولادهم بطناً بعد بطن { وَأَشْهَدَهُمْ } أي: أحضرهم وأطلعهم { عَلَىٰ أَنفُسِهِمْ } أي: أرواحهم الفائظة لهم\n المنفوخة فيهم من روحنا\n ثمَّ قلنا لهم بعدما شهدوا منشأهم وعلموا أصلهم: { أَلَسْتُ بِرَبِّكُمْ } الذي أوجدكم وأظهركم من كتم العدم بنفخ روحي فيكم؟\n\n{ قَالُواْ } بألسنة استعداداتهم: { بَلَىٰ شَهِدْنَآ } بعدما أشهدتنا أنت ربنا\n لا رب لنا سواك\n ولا مظهر لنا غيرك فأخذ سبحانه منهم الميثاق حينئذٍ\n وإنما أخذ منهم الميثاق على هذا\n كراهة { أَن تَقُولُواْ } على سبيل المجادلة والمراء حين أخذهم { يَوْمَ ٱلْقِيَامَةِ } بجرائمهم الصادرة عنهم\n المقتضية لنقض العهد: { إِنَّا كُنَّا عَنْ هَـٰذَا } أي: عن ربوبيتك واستقلالك فيها { غَافِلِينَ } [الأعراف: 172] غير عاليمن بها ولا منبهين عليها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { من ظهورهم }: بدل من { بني آدم } \n أي: من ظهور بني آدم\n و { ذريتهم }: مفعول به\n و { بلى }: حرف جواب\n يُجاب بها عن الهمزة إذا دخلت على منفي\n فخرجت عن الاستفهام إلى التقرير\n وهو حمل المخاطب على الإقرار بما بعد النفي\n نحو:\n[الشّرح:1]\n فيجاب ببلى\n أي: شرحت\n وكذا نظائرها\n ومنه: { إلست بربكم\n\n\n } الآية\n وقد يجاب بها الاستفهام المجرد عن النفي\n كما في الحديث:\n \" أتَرْضَوْنَ أَنْ تَكُونُوا رُبُعَ أهْلِ الجَنَّةِ؟ قالوا: بلى \" \nولكنه قليل\n فلا يُقاس عليه\n بل يوقف على ما سمع\n والكثر: أنها جواب للنفي\n ومعناها: إثبات ما نفي\n ورفع النفي\n لا إثباته وتقريره\n بخلاف \" نعم \" فإنها تقرر ما قبلها من إثبات أو نفي\n ولذا قال ابن عباس: ولو قالوا: نعم\n لكفروا\n وقد تقدم الفرق بينهما في سورة البقرة\n ثم الكثير: مراعاة صورة النفي\n فيجاب ببلى\n وقد ينظر للمعنى وما يفيده الاستفهام الإنكاري من نفيه للنفي\n فيصير الكلام إيجابًا\n فيصح الجواب بنعم في الجملة\n لكن لمَّا كان محتملاً امتنع في الآية: انظر المغني\n وقوله: { أن تقولوا }: مفعول من أجله\n يقول الحقّ جلّ جلاله: { و } اذكروا { إِذْ أخذ ربُّك من بني آدم من ظهورهم } من ظهور بني آدم { ذريَّتهم } وذلك أن الله تعالى لَمَّا خلق آدم\n وأهبطه إلى الأرض\n أخرج من صلبه نسيم بنيه\n بعضهم من صلب بعض\n على نحو ما يتوالدون\n قرنًا بعد قرن كالذر\n وكان آدم بنَعمان\n وهو جبل يواجه عرفة\n وقال لهم حين أخرجهم: { ألستُ بربكم }؟ فأقروا كلهم\n و { قالوا بلى } أنت ربنا\n { شهِدْنا } بذلك على أنفسنا\n لأن الأرواح حينئذٍ كانت كلها على الفطرة\n علاّمة دَرَّاكة\n فلما ركبت في هذا القالب نسيت الشهادة\n فبعث اللهُ الأنبياءَ والرسل يُذكِّرون الناس ذلك العهد\n فمن أقرّ به نجا\n ومن أنكره هلك\n ويحتمل أن يكون ذلك من باب التمثيل\n وأن أخذ الذرية من الظهر عبارة عن أيجادهم في الدنيا\n وأما إشهادهم فمعناه: أن الله نصب لبني آدم الأدلة على ربوبيته\n وشهدت بها عقولهم\n فكأنه أشهدهم على أنفسهم\n وقال: { ألست بربكم }؟ وكأنهم قالوا بلسان الحال: أنت ربنا\n والأول هو الصحيح لتواتر الأخبار به\n فقوله: { شَهِدنا }: هو من تمام الجواب\n فهو تحقيق لربوبيته وأداء لشهادتهم بذلك\n فينبغي أن يوقف عليه\n وقيل: إنَّ { شهدنا }: من قول الله أو الملائكة\n فيوقف على { بلى } \n لكنه ضعيف\n ثم ذكر حكمة هذا الأخذ\n فقال: { إن تقولوا } أي: فعلنا ذلك كراهة أن تقولوا { يوم القيامة إِنا كنا عن هذا غافلين } \n أو كراهية أن تقولوا: { إنما أشرك آباؤنا من قبلُ وكنا ذرية من بعدهم } فاقتدينا بهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "46:34",
      "similarity": 0.41844255636312394
    },
    {
      "verse": "36:81",
      "similarity": 0.4092930437979837
    },
    {
      "verse": "84:15",
      "similarity": 0.35762579986855997
    },
    {
      "verse": "30:7",
      "similarity": 0.3472294584631074
    },
    {
      "verse": "40:50",
      "similarity": 0.3430005063019359
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007172.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007172.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:172.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}