{
  "chapter": "الأعراف",
  "text": "واذ نتقنا الجبل فوقهم كانه ظلة وظنوا۟ انه واقعۢ بهم خذوا۟ ما ءاتينكم بقوة واذكروا۟ ما فيه لعلكم تتقون",
  "translations": [
    {
      "translation": "The day We shook the mountain above them like an awning, and they feared it would fall over them, (We said): \"Hold fast to what We have given you, and bear in mind what is (said) therein so that you may take heed.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall when We shook the mountain over them as though it were a canopy, and they thought that it was going to fall over them; and We said: 'Hold firmly to that which We have given you, and remember what is in it, that you may guard against evil.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We raised the mount above them as a shadow and made it speak to them, they thought that it would fall on them. We told them to devote themselves decisively to what was given to them and follow its guidance so that they would have fear of God.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We raised the Mount (Sinai) above them as if it were a canopy, and they thought that it would fall upon them; “Accept firmly what We have given you, and remember what is in it, so that you may become pious.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We Nataqna the mountain over them as if it had been a canopy, and they thought that it was going to fall on them. (We said): \"Hold firmly to what We have given you [the Tawrah], and remember that which is therein (act on its commandments), so that you may fear Allah and obey Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We shook the mountain over them as if it were a covering overhead, and they thought that it was going to fall down upon them: Take hold of what We have given you with firmness, and be mindful of what is in it, so that you may guard (against evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We shook the mountain above them as if it were a canopy, and they supposed it was about to fall on them: 'Take forcefully what We have given you, and remember what is in it; haply you will be godfearing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We shook the Mount above them as it were a covering, and they supposed that it was going to fall upon them (and We said): Hold fast that which We have given you, and remember that which is therein, that ye may ward off (evil).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We suspended the mountain over them as if it were a canopy, and they thought it was going to fall down on them, We said, \"Hold on firmly to what We have given you and remember what is in it, so that you may remain conscious of God.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And recall what time We shook the mountain over them as though it were a canopy, and they imagined that it was going to fall on them; and We said: hold with firmness that which We have vouchsafed you, and remember that which is therein, that haply ye may fear.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We plucked the mountain [and held it] above them as if it were a canopy (and they thought it was about to fall on them): ‘Hold on with power to what We have given you and remember that which is in it, so that you may be Godwary.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We shook the Mount over them, as if it had been a canopy, and they thought it was going to fall on them (We said): \"Hold firmly to what We have given you, and bring (ever) to remembrance what is therein; perchance ye may fear Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (remember) when We raised the mountain over them as if it had been a canopy, and they thought that it was going to fall on them. (We said): \"Hold firmly to what We have given you [i.e. the Taurat (Torah)], and remember that which is therein (act on its commandments), so that you may fear Allah and obey Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When We suspended the mountain over them as though it were a shadow and they feared that it was falling down on them: (We said): 'Take forcefully that which We have given you and remember what it contains, in order that you keep from evil'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when We suspended the mountain over them, as if it was an umbrella, and they thought it would fall on them: “Hold fast to what We have given you, and remember what it contains, so that you may be saved.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And [mention] when We raised the mountain above them as if it was a dark cloud and they were certain that it would fall upon them, [and Allah said], \"Take what We have given you with determination and remember what is in it that you might fear Allah.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:171] And, mention, when We wrenched the mountain above them, We lifted it up [unearthing it] from its root, as if it were a canopy, and they thought, they were certain, that it was about to fall upon them, because of God’s threat to them that it would fall upon them if they refused to accept the rulings contained in the Torah, they had [initially] refused [to accept] them because of their being burdensome, but then accepted them, and We said to them: ‘Take firmly, seriously and earnestly, what We have given you, and remember   what is in it, by acting in accordance with it, that you might be God-fearing’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when We shook the Mount) when We extracted, raised and fixed the Mount (above them) above their heads (as it were a covering) for comfort, (and they supposed) they knew and were certain (that it was going to fall upon them) if they did not accept the Scripture ((and We said): Hold fast that which We have given you) act according to it seriously and diligently, (and remember that which is therein) of reward and punishment; it is also said that this means: recall what is therein of commands and prohibitions; and it is also said that this means: act upon that which is therein of the lawful and the unlawful, (that ye may ward off (evil)) that you may ward off Allah's wrath and torment and that you may believe in Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِذ نَتَقْنَا ٱلْجَبَلَ فَوْقَهُمْ } معناهُ رَفعناهُ فَوقَهُمْ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اذكر وقت { إِذ نَتَقْنَا } أي: قطعنا { ٱلْجَبَلَ } من مكانه، ورفعنا { فَوْقَهُمْ } يظل عليهم { كَأَنَّهُ ظُلَّةٌ } يسقف فوق رءوسهم { وَظَنُّوۤاْ } من قبح صنيعهم { أَنَّهُ وَاقِعٌ بِهِمْ } إلى أن قلنا لهم: { خُذُواْ مَآ ءَاتَيْنَٰكُم } من مأمورات التوراة { بِقُوَّةٍ } عزيمة صادقة وعزم خالص في أوامره وأحكامه { وَٱذْكُرُواْ } أيك اتعظوا وتذكروا { مَا فِيهِ } من الموعظة والتذكيرات { لَعَلَّكُمْ تَتَّقُونَ } [الأعراف: 171] تنتهون عن قبائح أعمالكم ورذائل أخلاقكم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}