{
  "chapter": "الأعراف",
  "text": "او تقولوا۟ انما اشرك ءاباؤنا من قبل وكنا ذرية منۢ بعدهم افتهلكنا بما فعل المبطلون",
  "translations": [
    {
      "translation": "Or lest you say, 'Our forefathers associated others with Allah before our time, and we are merely descendants coming after them. So are You going to destroy us for what those purveyors of falsehood did?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or, lest they should say: \"It were our fathers who had ascribed compeers to God; we are only their offspring. Will You destroy us for the deeds of those who dealt in vanities?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or say: 'Our forefathers before us who associated others with Allah in His divinity; we were merely their offspring who followed them. And would You destroy us for that which the unrighteous did?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or say, \"Our fathers worshipped idols before us and we as their descendants followed them. Would you then destroy us because of what the followers of falsehood have done?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or you may say, “It is our ancestors who first ascribed partners (to Allah) and we were (their) children after them; so will You destroy us on account of the deeds of the followers of falsehood?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or lest you should say: \"It was only our fathers aforetime who took others as partners in worship along with Allah, and we were (merely their) descendants after them; will You then destroy us because of the deeds of men who practiced falsehood\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or you should say: Only our fathers associated others (with Allah) before, and we were an offspring after them: Wilt Thou then destroy us for what the vain doers did?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or lest you say, 'Our fathers were idolaters aforetime, and we were seed after them. What, wilt Thou then destroy us for the deeds of the vain-doers?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or lest ye should say: (It is) only (that) our fathers ascribed partners to Allah of old and we were (their) seed after them. Wilt Thou destroy us on account of that which those who follow falsehood did?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or lest you say, \"Our forefathers associated others with God before our time, and we are only the descendants who came after them. So are You going to destroy us for what those inventors of falsehood did?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or lest ye should say: it Was only our fathers who associated afore, and we have been a posterity after them; wilt Thou then destroy us for that which the followers of falsehood did?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or lest you should say, ‘Our fathers ascribed partners [to Allah] before [us] and we were descendants after them. Will You then destroy us because of what the falsifiers have done?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or lest ye should say: \"Our fathers before us may have taken false gods, but we are (their) descendants after them: wilt Thou then destroy us because of the deeds of men who were futile?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or lest you should say: \"It was only our fathers afortime who took others as partners in worship along with Allah, and we were (merely their) descendants after them; will You then destroy us because of the deeds of men who practised Al-Batil (i.e. polytheism and committing crimes and sins, invoking and worshipping others besides Allah)?\" (Tafsir At-Tabari).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "or you say: 'Our forefathers were idolaters before, and we were the descendants after them, will You destroy us for the deeds of the vaindoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Nor can you Say, “Our ancestors practiced idolatry before; and we are their descendants who came after them; will you destroy us for what the falsifiers did?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or [lest] you say, \"It was only that our fathers associated [others in worship] with Allah before, and we were but descendants after them. Then would You destroy us for what the falsifiers have done?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:173] Or lest you should say, ‘It is merely that our fathers were idolaters before, that is, before our time, and we were descendants of theirs, and so we followed their example. Will You then destroy us, chastise us, for that which those who follow falsehood did?’, from among our forefathers, by [their] establishing idolatry? The meaning is: they cannot use such arguments when they have been made to testify before their very selves to God’s Oneness. To effect this reminder by the tongue of the bearer of the miracle [Muhammad (s)] equally serves [as a reminder] for every soul to remember this within itself.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Or lest ye should say) and so that you do not say: ((It is) only (that) our fathers ascribed partners to Allah of old) before us, and it is them who broke the covenant and pledge before us (and we were (their) seed) small and weak (after them) and we just emulated them. (Wilt Thou destroy us) will you punish us (on account of that which those who follow falsehood did?) on account of what the idolaters did before us in terms of breaking the covenant?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ أَوْ تَقُولُوۤاْ } لو لم يأخذ سبحانه العهد من جميعهم: { إِنَّمَآ أَشْرَكَ آبَاؤُنَا مِن قَبْلُ وَكُنَّا ذُرِّيَّةً } ضعافاً { مِّن بَعْدِهِمْ } فنقلدهم { أَفَتُهْلِكُنَا } وتأخذنا يا ربنا { بِمَا فَعَلَ ٱلْمُبْطِلُونَ } [الأعراف: 173] أي: بفعل آبائنا ا لذين أشركوا بك، مع أنَّا لم نكن حينئذٍ من أصحاب الرأي؟! وأخذك بجرائمهم ظلم علينا؛ لذلك أخذ سبحانه الميثاق من جميع بني آدم؛ حتى لا يبقى لهم حجة عليه سبحانه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "14:40",
      "similarity": 0.3707546079055371
    },
    {
      "verse": "47:33",
      "similarity": 0.3455850891573399
    },
    {
      "verse": "3:34",
      "similarity": 0.3406205163431769
    },
    {
      "verse": "22:62",
      "similarity": 0.3284328215396327
    },
    {
      "verse": "31:30",
      "similarity": 0.3284328215396327
    }
  ]
}