{
  "chapter": "الأعراف",
  "text": "وكذلك نفصل الءايت ولعلهم يرجعون",
  "translations": [
    {
      "translation": "That is how We make the Signs clear so that hopefully they will return.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "That is how We explain Our signs distinctly so that they may come back (to the right path).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We expound the signs that they may turn back (to the right path).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We explain Our revelations so that they might return to (the right path).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And this is how We explain the verses in different ways, and so that they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We explain the Ayat in detail, so that they may turn (unto the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We make clear the communications, and that haply they might return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So We distinguish the signs; and haply they will return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus we detail the revelations, that haply they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We explain Our signs in detail thus, so that perhaps they may return to Us.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Thus We detail the revelations, that haply they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We elaborate the signs, so that they may come back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We explain the signs in detail; and perchance they may turn (unto Us).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus do We explain the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) in detail, so that they may turn (unto the truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As such We make plain Our verses in order that they return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We thus elaborate the revelations, so that they may return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And thus do We [explain in] detail the verses, and perhaps they will return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:174] Thus We detail the signs, We explain them even as We have explained the covenant, that they might reflect on them, and that they might revert, from their disbelief.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thus We detail Our revelations) We explain in the Qur'an the story of the Covenant, (that haply they may return) from disbelief and idolatry to the initial Covenant.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَكَذٰلِكَ نُفَصِّلُ } نبيٍّن ونوضح على وجه الخصوص والعموم { ٱلآيَاتِ } الدالة على توحيدنا على اليهود { وَلَعَلَّهُمْ يَرْجِعُونَ } [الأعراف: 174] رجاء أن يتنبهوا فيرجعوا نحونا، ومع ذلك لم يرجعوا ولم يتنبهوا أصلاً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال البيضاوي: والمقصود من إيراد هذا الكلام ها هنا: إلزام اليهود مقتضى الميثاق العام، بعد ما ألزمهم بالميثاق المخصوص بهم، والاحتجاج عليهم بالحجج السمعية والعقلية، ومنعهم من التقليد، وحملهم على النظر والاستدلال، كما قال تعالى: { وكذلك نفصل الآيات } الدالة على وحدانيتنا سمعاً وعقلاً، { ولعلهم يرجعون } عن التقليد واتباع الباطل\n الإشارة: أَخَذَ الحقّ جلّ جلاله العهد على الأرواح أن تعرفه وتُوحده مرتين، أحدهما: قبل ظهور الكائنات، والثاني: بعد ظهورها\n والأول أخذه عليها في معرفة الربوبية، والثاني تجديدًا له مع القيام بآداب العبودية\n قال بعضهم: أخذ الأول على الأرواح يوم المقادير، وذلك قبل السماوات والأرض بخمسين ألف سنة، ثم أخذ الثاني على النفوس بعد ظهورها في عالم الأشباح، كما نبهت عليه الآية والأحاديث\n وقال ابن الفارض في تائيته:\n\nقال القاشاني: أراد بالعهد السابق: ما أخذه الله على الأرواح والإنسانية المستخرجة من صلب الروح الأعضم، الذي هو آدم الكبير، في صور المثل، قبل تعلقها بالأشباح، وهو عقد المحبة بين الرب والمربوب، في قوله سبحانه: { وإذ أخذ ربك\n\n\n } الآية\n وبالعهد اللاحق: ما أخذه عليهم بواسطة الأنبياء، من عقد الإسلام بعد التعلق بالأبدان، وهو توكيدٌ للعهد الأول، وتوثيقه بالتزام أحكام الربوبية والتزامها\n هـ\n وقال في الحاشية: كلام ابن الفارض ينظر إلى العهد الأول، الروحاني، وكلام غيره ينظر إلى الثاني النفساني، وهو ظاهر الآية\n هـ\n قلت: وفيه نظر، فإن كلام ابن الفارض مشتمل على العهدين معًا، الروحاني في الشطر الأولى، والنفساني في الشطر الثاني\n والحاصل مما تقدم: أن العهد أخذ على الأرواح ثلاث مرات، أحدها: حين استخرجت من صلب الروح الأعظم الذي هو آدم الكبير، وهو معنى القبضة النورانية، التي آخذت من عالم الجبروت\n والثاني: حينن استخرجت من صلب آدم الأصغر، كالذر، والثالث: حيث دخلت في عالم الأشباح، على ألسنة الرسل، ومن ناب عنهم، فالمذكور في الآية هو الثاني، وهو أحسن من حَملِ القاشاني الآية على الأول\n فالحاصل: أن الأخذ الأول كان على الأرواح مجردة عن مادة التطوير والتمثيل، بإقرارها إقرار النفوس، لا إقرار الألسنة، والأخذ الثاني كان على الأرواح بعد خروجها من الوجود العلمي إلى الوجود العيني، فتطورت الأرواح بصفاتها الذاتية، من سمع وبصر ولسان وغيرها، في عالم المثال، بصور مقالية لتُبصر بها ظهور الرب، وتسمع خطابه، وتجيب سؤاله، بإقرارها حينئذٍ إقرار الألسنة، وهو الذي يقتضيه ظاهر الآية\n\n\nوأما العهد الذي أخذه بواسطة الأنبياء في ظهور عالم الأشباح فإنما هو تذكير للعهدين وتجديد لهما وهو الذي تقوم به الحجة عليها، فلا بد من انضمامه إِلى الأوَّلَين في قيام الحجة، كما تقدم\n  فالموجدات ثلاث: علمي، ثم خيالي مثالي، ثم نوعي حسي\n فَأُخِذَ على كل واحد عهد من الأَوَّلَيْنِ بلا واسطة، والثالث بواسطة الرسل\n والله تعالى أعلم\n ثم ذكر وبال من نقض هذا العهد، مع تمكنه من العلم به، فقال: { وَٱتْلُ عَلَيْهِمْ نَبَأَ ٱلَّذِيۤ ءَاتَيْنَاهُ ءَايَاتِنَا }\n\n",
      "translations": []
    }
  ]
}