{
  "chapter": "الأعراف",
  "text": "ولو شئنا لرفعنه بها ولكنه اخلد الى الارض واتبع هوىه فمثله كمثل الكلب ان تحمل عليه يلهث او تتركه يلهث ذلك مثل القوم الذين كذبوا۟ بـايتنا فاقصص القصص لعلهم يتفكرون",
  "translations": [
    {
      "translation": "If We had wanted to, We would have raised him up by them. But he gravitated towards the earth and pursued his whims and base desires. His metaphor is that of a dog: if you chase it away, it lolls out its tongue and pants, and if you leave it alone, it lolls out its tongue and pants. That is the metaphor of those who deny Our Signs. So tell the story so that hopefully they will reflect.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We wished to exalt him, but he loved baseness and followed his lust. His likeness is that of a dog who hangs out his tongue if you drive him away, and still hangs it out if you leave him alone. Such is the case of the people who deny Our signs. Narrate this history to them; they may haply reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Now had We so willed We could indeed have exalted him through those signs, but he clung to earthly life and followed his carnal desires. Thus his parable is that of the dog who lolls out his tongue whether you attack him or leave him alone. Such is the parable of those who reject Our signs as false. Narrate to them these parables that they may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We wanted, We could have raised him to an exalted position but he clung to his earthly life and followed his own (evil) desires. Such person's bad habits are like those of a lazy dog (in a warm climate) who always has its tongue hanging out whether you chase it away or leave it alone. Such are the people who have called Our revelations mere lies. (Muhammad), tell them such stories so that perhaps they will think.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We willed We could have raised him because of the revelations, but he clung to the earth and followed his own desires; his condition therefore is like that of a dog; if you attack him he hangs out his tongue and if you leave him he hangs out his tongue; this is the state of the people who denied Our signs; therefore preach, so that they may give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We willed, We would surely have elevated him therewith, but he clung to the earth and followed his own vain desires. So his parable is the parable of a dog: if you drive him away, he pants, or if you leave him alone, he (still) pants. Such is the parable of the people who reject Our Ayat. So relate the stories, perhaps they may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had pleased, We would certainly have exalted him thereby; but he clung to the earth and followed his low desire, so his parable is as the parable of the dog; if you attack him he lolls out his tongue; and if you leave him alone he lolls out his tongue; this is the parable of the people who reject Our communications; therefore relate the narrative that they may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We willed, We would have raised him up thereby; but he inclined towards the earth and followed his lust. So the likeness of him is as the likeness of a dog; if thou attackest it it lolls its tongue out, or if thou leavest it, it lolls its tongue out. That is that people's likeness who cried lies to Our signs. So relate the story; haply they will reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We willed We could have raised him by their means, but he clung to the earth and followed his own lust. Therefor his likeness is as the likeness of a dog: if thou attackest him he panteth with his tongue out, and if thou leavest him he panteth with his tongue out. Such is the likeness of the people who deny Our revelations. Narrate unto them the history (of the men of old), that haply they may take thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "if it had been Our will, We could have used these signs to exalt him, but instead he clung to the earth and followed his own desires, he was like a dog that pants whether you chase it away or leave it alone. Such are those who reject Our signs. Tell them this story so that they may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We willed We would surely have lifted him thereby, but he clung to the earth and followed his desire, wherefore his case became like unto the case of a dog, who, if thou attackest him, lolleth out his tongue and if thou leavest him alone, lolleth out his tongue. Such is the likeness of the people who belie Our sign; so recount thou the narratives, that haply they may refelect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We wished, We would have surely raised him by their means, but he clung to the earth and followed his [base] desires. So his parable is that of a dog: if you make for it, it lolls out its tongue, and if you let it alone, it lolls out its tongue. Such is the parable of the people who deny Our signs. So recount these narratives, so that they may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If it had been Our will, We should have elevated him with Our signs; but he inclined to the earth, and followed his own vain desires. His similitude is that of a dog: if you attack him, he lolls out his tongue, or if you leave him alone, he (still) lolls out his tongue. That is the similitude of those who reject Our signs; So relate the story; perchance they may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And had We willed, We would surely have elevated him therewith but he clung to the earth and followed his own vain desire. So his description is the description of a dog: if you drive him away, he lolls his tongue out, or if you leave him alone, he (still) lolls his tongue out. Such is the description of the people who reject Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.). So relate the stories, perhaps they may reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had it been Our will We would have raised with it, but he clung to this earthly life and succumbed to his fancies. His likeness was that of a dog, whether you chase it away or let it alone it pants. Such is the example of a nation who belie Our signs. Recount to them these narratives, in order that they reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Had We willed, We could have elevated him through them; but he clung to the ground, and followed his desires. His metaphor is that of a dog: if you chase it, it pants; and if you leave it alone, it pants. Such is the metaphor of the people who deny Our signs. So tell the tale, so that they may ponder.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if We had willed, we could have elevated him thereby, but he adhered [instead] to the earth and followed his own desire. So his example is like that of the dog: if you chase him, he pants, or if you leave him, he [still] pants. That is the example of the people who denied Our signs. So relate the stories that perhaps they will give thought.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:176] And had We willed, We would have raised him up, to the ranks of the scholars, thereby, by facilitating his way to [good] deeds; but he was disposed to, at peace [in], the earth — that is, this world — and inclined to it, and followed his whims, by calling [others] to them, and so We abased him. Therefore his likeness, his description, is as the likeness of a dog: if you attack it, by driving it away or curbing it, it lolls its tongue out, and if you leave it, it lolls its tongue out, and no other animal is like it in this way (both conditional sentences constitute a circumstantial qualifier, that is to say, it has its tongue lolling out despicably in all circumstances. The purpose here is to point out the similarity [between the one who follows his whims and a dog] in terms of condition and vileness, judging by the [contextualising] fā’ [of fa-mathaluhu, ‘therefore his likeness’], which relates what comes after it to what came before it in the way of ‘inclining towards this world and following whims’, and judging by God’s saying: That, likeness, is the likeness of those people who deny Our signs. So recount the tale, to the Jews, that they might reflect, upon it and so believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nوقوله تعالى : { ولو شئنا لرَفَعْناه بها } أفاد أن تلك الآيات شأنها أن تكون سبباً للهداية والتزكية ، لو شاء الله له التوفيق وعصمه من كيد الشيطان وفتنته فلم ينسلخ عنها ، وهذه عبرة للموفقين ليعلموا فضل الله عليهم في توفيقهم ، فالمعنى : ولو شئنا لزاد في العمل بما آتيناه من الآيات فلرَفعه الله بعلمه .والرفعة مستعارة لكمال النفس وزكائها ، لأن الصفات الحميدة تُخيل صاحبها مرتفعاً على من دونه ، أي لو شئنا لاكتسب بعمله بالآيات فضلاً وزكاء وتميزاً بالفضل ، فمعنى لرفعناه ليسرّنا له العمل بها الذي يشرُف به .وقد وقع الاستدراك على مضمون قوله : { ولو شئنا لرفعناه بها } بذكر ما يناقض تلك المشيئة الممتنعة ، وهو الاستدراك بأنه انعكست حاله فأخلد إلى الأرض ، أي ركن ومال إلى الأرض ، والكلام تمثيل لحال المتلبس بالنقائص والكفر بعد الإيمان والتقوى ، بحال من كان مرتفعاً عن الأرض فنزل من اعتلاء إلى أسفل ، فبذكر الأرض عُلمَ أن الإخلاد هنا ركون إلى السفل أي تلبس بالنقائص والمفاسد .واتباع الهوى ترجيح ما يحسن لدى النفس من النقائص المحبوبة ، على ما يدعو إليه الحق والرشد ، فالاتباع مستعار للاختيار والميل ، والهوى شاع في المحبة المذمومة الخاسرة عاقبتها .وقد تفرع على هذه الحالة تمثيله بالكلب اللاهث ، لأن اتصافه بالحالة التي صيرته شبيهاً بحال الكلب اللاهث تفرع على إخلاده إلى الأرض واتباع هواه ، فالكلام في قوة أن يقال : ولكنه أخلد إلى الأرض فصار في شَقاء وعناد ، كمثل الكلب إلخ .واستعمال القرآن لفظ المثل بعد كاف التشبيه مألوف بأنه يراد به تشبيه الحالة بالحالة ، وتقدم قوله تعالى؛{ مثلهم كمثل الذي استوقد ناراً } في سورة البقرة ( 17 ) ، فلذلك تعين أن التشبيه هنا لا يخرج عن المتعارف في التشبيه المركب ، فهذا الضال تحمل كلفة اتباع الدين الصالح وصار يطلبه في حينَ كان غير مكلف بذلك في زمن الفترة فلقي من ذلك نصباً وعناء ، فلما حان حين اتباع الحق ببعثة محمد تحمل مشقة العناد والإعراض عنه في وقت كان جديراً فيه بأن يستريح من عنائه؛ لحصول طلبته فكانت حالته شبيهة بحالة الكلب الموصوف باللّهث ، فهو يلهث في حالة وجود أسباب اللهث من الطرد والإرهاب والمشقة وهي حالة الحمل عليه ، وفي حالة الخلو عن ذلك السبب وهي حالة تركه في دعة ومسالمة ، والذي ينبه على هذا المعنى هو قوله { أو تَتْركه }.وليس لشيء من الحيوان حالة تصلح للتشبيه بها في الحالتين غير حالة الكلب اللاهث ، لأنه يلهث إذا أتْعب وإذا كان في دعة ، فاللهث في أصل خلقته .وهذا التمثيل من مبتكرات القرآن فإن اللهث حالة تؤذن بحرج الكلب من جراء عسر تنفسه عن اضطراب باطنه وإن لم يكن لاضطراب باطنه ، سبب آت من غيره فمعنى { إن تحمل عليه } إن تُطارده وتُهاجمه . مشتق من الحَمل الذي هو الهجوم على أحد لقتاله ، يقال حمل فلانٌ على القوم حملة شعواء أو حملة منكرة . وقد أغفل المفسرون توضيحه ، وأغفل الراغب في «مفردات القرآن» هذا المعنى لهذا الفعل .فهذا تشبيهُ تمثيل مُركب منتزعةٌ فيه الحالة المشبهة والحالةُ المشبه بها من متعدد ، ولما ذُكر { تحمل عليه يلهث أو تتركه يلهث } في شق الحالة المشبه بها ، تعين أن يكون لها مقابل في الحالة المشبهة ، وتتقابل أجزاءُ هذا التمثيل بأن يشبّه الضال بالكلب ، ويشبه شقاؤُه واضطرابُ أمره في مدة البحث عن الدين بلهث الكلب في حالة تركه في دعة ، تشبيهَ المعقول بالمحسوس ، ويشبّه شقاؤه في إعراضه عن الدين الحق عند مجيئه بلهث الكلب في حالة طرده وضربه تشبيه المعقول بالمحسوس . وقد أغفل هذا الذين فسروا هذه الآية فقرروا التمثيل بتشبيه حالة بسيطة بحالة بسيطة في مجرد التشويه أو الخسة . فيؤول إلى أن الغرض من تشبيهه بالكلب إظهار خسة المشبه ، كما درج عليه في «الكشاف» ، ولو كان هذا هو المراد لما كان لذكر { إنْ تحمل عليه يلهث أو تتركه يلهث } كبير جدوى ، بل يقتصر على أنه لتشويه الحالة المشبه بها ، لتكتسب الحالةُ المشبهة تشويها ، وذلك تقصير في حق التمثيل .والكلب حيوان من ذوات الأربع ذو أنياب وأظفار كثير النبح في الليل قليل النوم فيه كثير النوم في النهار ، يألف من يعاشره ويحرس مكانه من الطارقين الذين لا يألفهم ، ويحرس الأنعام التي يعاشرها ، ويعدو على الذئاب ، ويقبل التعليم ، لأنه ذكي .ويلهث إذا أتعب أو اشتد عليه الحر ، ويلهث بدون ذلك ، لأن في خلقته ضيقاً في مجاري النفس يرتاح له باللهث .وجملة : { إن تحمل عليه يلهث أو تتركه يلهث } في موضع الحال من الكلب والخطاب في { تَحْمل } وتترك لمخاطب غير معيّن ، والمعنى إن يحمل عليه حامل ، أو يتركه تارك .واللهث : سرعة التنفس مع امتداد اللسان لضيق النفس ، وفعله بفتح الهاء وبكسرها ، ومضارعه بفتحها لا غير ، والمصدر اللهث بفتح اللام والهاء ويقال اللهاث بضم اللام ، لأنه من الأدواء ، وليس بصوت .جملة مبيّنة لجملة : { واتْلُ عليهم نبأ الذي آتيناه آياتنا } الآيتين ، والمثال الحال أي ذلك التمثيل مثل للمشركين المكذبين بالقرآن ، تشبيه بليغ ، لأن حالة الكلب المشتبه شبيهة بحال المكذبين وليست عينها .والإشارة بذلك إلى { الذي آتيناه آياتنا } ، وهو صاحب القصة ، هو مَثل المشركين ، لأنهم شابهوه في أنهم أتوا القرآن فكذبوا به ، فكانت حالهم كحال ذلك المكذب ، والأظهر أن تكون الإشارة إلى المثَل في قوله : { كمثل الكلب } أي حالُ الكلب المذكورة كحال المشركين المكذبين في أنهم كانوا يودون معرفة دين إبراهيم ، ويتمنون مساواة أهل الكتاب في العلم والفضل ، فكانوا بذلك في عناء وحيرة في الجاهلية فلما جاءهم رسول منهم بكتاب مبين انتقلوا إلى عناء معاندته كقوله تعالى : { أو تقولوا لو أنا أنْزل علينا الكتاب لكنا أهدى منهم } \\[ الأنعام : 157 \\] وهذا تأويل ما روي عن عبادة بن الصامت أن آية { واتل عليهم نبأ الذي آتيناه آياتنا } إلى آخرها نزلت في قريش .وفُرع على ذلك الأمرُ بقوله : { فاقْصص القصصَ لعلهم يتفكرون } أي اقصص هذه القصة وغيرها ، وهذا تذييل للقصة الممثل بها يشملها وغيرها من القصص التي في القرآن ، فإن في القصص تفكراً وموعظة ، فيرجى منه تفكرهم وموعظتهم ، لأن للأمثال واستحضار النظائر شاناً عظيماً في اهتداء النفوس بها وتقريب الأحوال الخفية إلى النفوس الذاهلة أو المتغافلة ، لما في التنظير بالقصة المخصوصة من تذكر مشاهدة الحالة بالحواس ، بخلاف التذكير المجرد عن التنظير بالشيء المحسوس .\n\n",
      "translations": [
        {
          "translation": "(And had We willed We could have raised him by their means) We could have raised him by means of the greatest name to heaven and made him sovereign over the people of this world, (but he clung to the earth) he inclined to the wealth of this world (and followed his own lust) the lust of leadership; it is also said that this means: the lust of his ego by engaging in evil things. (Therefore his likeness) the likeness of Bal'am; and it is said: the likeness of Umayyah Ibn al-Salt (is as the likeness of a dog; if thou attackest him) and drive him away from you (he panteth with his tongue out, and if thou leavest him) and do not drive him away (he panteth with his tongue out) such is the case with Bal'am and Umayyah, when they were admonished they did not take any heed and when they were left alone, they did not understand anything. (Such is the likeness of the people who deny Our revelations) Muhammad (pbuh) and the Qur'an. These people are the Jews. (Narrate unto them the history (of the men of old)) recite to them the Qur'an, (that haply they may take thought) that haply they may reflect on the similes of the Qur'an. 178\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { أَخْلَدَ إِلَى ٱلأَرْضِ } معناهُ نَزَعَ وَرَكَنَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His statement, \"He shall remain on the earth\" - meaning He will take root and establish Himself.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَلَوْ شِئْنَا } أي: تعلق مشيئتنا\n لإهدائه إلى أقصى غايات التوحيد وأعلى مرابته { لَرَفَعْنَاهُ بِهَا } أي: بتلك الآيات { وَلَـٰكِنَّهُ } لم يتعلق\n لذلك { أَخْلَدَ } أي: انخفض ومال { إِلَى ٱلأَرْضِ } الأنزل الأرذل { وَٱتَّبَعَ هَوَاهُ } لينزل عليها\n ومع ذلك يتمسك بها وأراد أن يتشبث بمقتضاها { فَمَثَلُهُ } في هذا التمسك والتشبث { كَمَثَلِ ٱلْكَلْبِ إِن تَحْمِلْ عَلَيْهِ } حملاً موجباً\n لإلهائه واندلاع لسانه { يَلْهَثْ } يخرج لسانه بسببه { أَوْ تَتْرُكْهُ } خفيفاً ولم تحمل عليها ما يوجب إلهائه { يَلْهَث } أيضاً\n لرسوخ الديدنة القبيحة في ذاته { ذَّلِكَ } الكل بعينه { مَثَلُ ٱلْقَوْمِ ٱلَّذِينَ كَذَّبُواْ بِآيَاتِنَا فَٱقْصُصِ } يا أكمل الرسل لليهود { ٱلْقَصَصَ } المذكورة { لَعَلَّهُمْ يَتَفَكَّرُونَ } [الأعراف: 176] ويتأملون فيما هم عليه من الإعراض والإنكار فيتنبهوا على صبح صنعيهم\n وسوء فعالهم مع الله\n\n\nقيل: ذلك هو بلام بن باعوراء\n وقصته مشهورة\n وقيل: أمية بن الصلت كان قد قرأ اكتر المنزلة ووجد فيها وصف النبي صلى الله عليه وسلم\n ورجا أن يكون هو\n فلمَّا بعث رسول الله صلى الله عليه وسلم حسد وكفر وكان من الغاوين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n قال تعالى: { ولو شئنا لرفعناه } إلى منازل الأبرار { بها } أي: بسبب تلك الآيات وملازمتها\n { ولكنه أخلد إلى الأرض } أي: مال إلى الدنيا وحطامها\n أي: أخلد إلى أرض الشهوات\n { واتبع هواه } في إيثار الدنيا واسترضاء قومه\n أو صيانة رئاسته وجاهه\n قال البيضاوي: وكان من حقه أن يقول: ولكنه أعرض عنها\n فأوقع موقعه: { أخلد إلى الأرض واتبع هواه } مبالغةً وتنبيهًا على ما حمله عليه\n وأن حب الدنيا رأس كل خطيئة\n هـ\n { فمثله } أي: فصفته التي هي مثلٌ في الخسة\n { كمَثَل الكلب } أي: كصفته في أخس أحواله\n وهو { إن تحمل عليه يلهث أو تتركه يلهث } أي: يلهث دائمًا\n سواء حمل عليه بالزجر والطرد\n أو ترك ولم يتعرض له\n بخلاف سائر الحيوانات لضعف فؤاده\n واللهث: إدلاع اللسان من التنفس الشدد\n والمراد: لازم اللهث\n وهو نفي الرفع ووضع المنزلة\n قال ابن جزي: اللهث: هو تنفس بسرعة\n وتحريك أعضاء الفم\n وخروج اللسان\n وأكثر ما يعتري ذلك الحيوانات عند الحر والتعب\n وهي حالة دائمة للكلب\n ومعنى \" إن تحمل عليه \": أن تفعل معه ما يشق عليه\n من طرد أو غيره\n أو تتركه دون أن تحمل عليه\n فهو يلهث على كل حال\n\nووجه تشبيه ذلك الرجل به أنه إن وعظته فهو ضال\n وإن لم تعظه فهو ضال\n فضلالته على كل حال\n هـ\n وقال الواحدي: وذلك أنه زجر في المنام عن الدعاء على موسى\n فلم ينزجر\n وترك عن الزجر\n فلم يهتد\n هـ\n وقيل\n هـ\n أن ذلك الرجل خرج لسانه على صدره\n فصار مثل الكلب\n وصورته ولهثه حقيقة\n هـ\n وفعل به ذلك حين دعا على موسى عليه السلام\n وفي ابن عطية: ذكر \" المعتمد \" أن موسى قتله\n قال تعالى: { ذلك مَثَل القوم الذين كذَّبوا بآياتنا } صفتهم كصفة الكلب في لهثه وخسته\n أو كصفة الرجل المشبه به\n لأنهم إن أنذروا لم يهتدوا\n وإن تركوا لم يهتدوا\n أو شبههم بالرجل في أنهم رأوا الآيات فلم تنفعهم\n كما أن الرجل لم ينفعه ما عنده من الآيات\n وقال الواحدي: يعني: أهل مكة كانوا متمنين هادياً يهديهم\n فلما جاءهم من لا يشكُّون في صدقه كذبوه\n فلم يهتدوا لمَّا تُركوا\n ولم يهتدوا أيضًا لما دعوا بالرسول\n فكانوا ضالين عن الرسول في الحالتين\n هـ\n { فاقصص القصَصَ } المذكور على اليهود\n فإنها نحو قصصهم\n { لعلهم يتفكرون } تفكرًا يُؤدي إلى الاتعاظ\n فيؤمنوا به\n فإنَّ هذه القصص لا توجد عند من لم يقرأ إلا بوحي\n فيتيقنوا نبوتك",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:4",
      "similarity": 0.22553596224951583
    },
    {
      "verse": "18:22",
      "similarity": 0.19316341692631206
    },
    {
      "verse": "18:18",
      "similarity": 0.11631259164284713
    },
    {
      "verse": "59:21",
      "similarity": 0.07968259013292754
    },
    {
      "verse": "16:44",
      "similarity": 0.07820154738918972
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007176.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007176.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:176.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}