{
  "chapter": "الأعراف",
  "text": "ولقد ذرانا لجهنم كثيرا من الجن والانس لهم قلوب لا يفقهون بها ولهم اعين لا يبصرون بها ولهم ءاذان لا يسمعون بها او۟لئك كالانعم بل هم اضل او۟لئك هم الغفلون",
  "translations": [
    {
      "translation": "We created many of the jinn and mankind for Hell. They have hearts they do not understand with. They have eyes they do not see with. They have ears they do not hear with. Such people are like cattle. No, they are even further astray! They are the unaware.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many of the jinns and human beings have We destined for Hell, who possess hearts but do not feel, have eyes but do not see, have ears but do not hear, like cattle, even worse than them. They are people unconcerned.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We have created for Hell many of the jinn and mankind; they have hearts with which they fail to understand; and they have eyes with which they fail to see; and they have ears with which they fail to hear. They are like cattle - indeed, even more astray. Such are utterly heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have destined many men and jinn for hell. They have hearts but do not understand, eyes but do not see. They have ears but do not hear. They are worse than lost cattle. These are the heedless ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And indeed We have created many jinns and men for hell; they have hearts in which their is no understanding; and the eyes they do not see with; and the ears they do not hear with; they are like cattle – in fact more astray; it is they who are the neglectful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely, We have created many of the Jinn and mankind for Hell. They have hearts wherewith they understand not, and they have eyes wherewith they see not, and they have ears wherewith they hear not (the truth). They are like cattle, nay even more astray; those! They are the heedless ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And certainly We have created for hell many of the jinn and the men; they have hearts with which they do not understand, and they have eyes with which they do not see, and they have ears with which they do not hear; they are as cattle, nay, they are in worse errors; these are the heedless ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have created for Gehenna many jinn and men: they have hearts, but understand not with them; they have eyes, but perceive not with them; they have ears, but they hear not with them. They are like cattle; nay, rather they are further astray. Those -- they are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Already have We urged unto hell many of the jinn and humankind, having hearts wherewith they understand not, and having eyes wherewith they see not, and having ears wherewith they hear not. These are as the cattle - nay, but they are worse! These are the neglectful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We created many of the jinn and mankind for hell. They have hearts they do not understand with; they have eyes they do not see with; and they have ears they do not hear with. Such people are like cattle -- no, they are even more misguided. Such are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And assuredly We have created for Hell many of the genii and mankind; they have hearts wherewith they understand not, and they have eyes wherewith they see not, and they have ears wherewith they hearken not; they are like unto cattle; nay, they are further astray; those! they are the negligent ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Certainly We have winnowed out for hell many of the jinn and humans: they have hearts with which they do not understand, they have eyes with which they do not see, they have ears with which they do not hear. They are like cattle; indeed, they are more astray. It is they who are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Many are the Jinns and men we have made for Hell: They have hearts wherewith they understand not, eyes wherewith they see not, and ears wherewith they hear not. They are like cattle,- nay more misguided: for they are heedless (of warning).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And surely, We have created many of the jinns and mankind for Hell. They have hearts wherewith they understand not, they have eyes wherewith they see not, and they have ears wherewith they hear not (the truth). They are like cattle, nay even more astray; those! They are the heedless ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For Gehenna, We have created many jinn and many humans. They have hearts, with which they cannot understand; eyes, with which they do not see; and ears, with which they do not hear. They are like cattle, rather, they are the more misguided. Such are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We have destined for Hell multitudes of jinn and humans. They have hearts with which they do not understand. They have eyes with which they do not see. They have ears with which they do not hear. These are like cattle. In fact, they are further astray. These are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have certainly created for Hell many of the jinn and mankind. They have hearts with which they do not understand, they have eyes with which they do not see, and they have ears with which they do not hear. Those are like livestock; rather, they are more astray. It is they who are the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:179] And We have indeed urged unto Hell many of the jinn and mankind, having hearts wherewith they do not understand, the truth, and having eyes wherewith they do not perceive, the proofs of God’s power with a perception that entails reflection, and having ears wherewith they do not hear, the signs or the admonitions, in a way so as to reflect and take heed. These, they are like cattle, in their failure to understand, perceive or listen — nay, rather they are further astray, than cattle, because [at least] they [cattle] seek what is beneficial to them and stay away from what is harmful to them: these individuals, on the other hand, are proceeding towards the Fire, out of [sheer] obstinacy. These — they are the heedless.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Already have We urged unto) We created for (hell many of the jinn and humankind, having hearts wherewith they understand not) the Truth, (and having eyes wherewith they see not) the Truth, (and having ears wherewith they hear not) the Truth. (These are as the cattle) in relation to understanding the Truth (nay, but they are worse!) because they are disbelievers (These are the neglectful) those who are oblivious to the matter of the Hereafter, deniers of it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ أولئك كالأنعام } لفقدان إدراك الحقائق والمعارف التي تقرّبهم من الله بالقلوب وعدم الاعتبار بالأعين والإذكار بالأسماع { بل هم أضلّ } لوجود الشيطنة فيهم الموجبة للبعد بفساد العقائد وكثرة المكايد { ولله الأسماء الحسنى } قد مرّ أن كل اسم هو الذات مع صفة، والله يدبر كل أمر باسم من أسمائه { فادعوه } عند الافتقار إلى ذلك الاسم به إما بلسان الحال كما أن الجاهل إذا طلب العلم يدعوه باسمه العليم، والمريض إذا طلب الشفاء يدعوه باسمه الشافي، والفقير إذا طلب الغِنى يدعوه باسمه المغني، كل بتحصيل الاستعداد الذي استلزم قبوله لتأثير ذلك الاسم وأثر تلك الصفة\n وأما بلسان القال كما إذا قال الأول: يا رب، يريد به يا عليم، لاختصاص ربوبيته بذلك الاسم\n والثاني: يريد بيا رب يا شافي\n والثالث: يا مغني\n وأما بلسان الفعل كما يدعوه الطالب السالك باتصافه بتلك الصفة فإذا فنى عن علمه بعلمه دعاه باسمه العليم، وإذا وجد شفاء دائه منه وطلب منه أن يشفي غيره باتصافه بصفة الشفاء دعاه باسمه: الشافي، وإذا استغنى عن فقره به دعاه باسمه: الغني\n وهذه هي الدعوة المأمور بها الموحدون من المؤمنين فليمتثلوا\n { وذروا الذين يلحدون في أسمائه } يطلبون هذه الصفات من غيره ويضيفونها إليه فيشركون به\n المراد بالساعة: وقت ظهور القيامة الكبرى، أي: الوحدة الذاتية بوجود المهدي ولا يعلم وقتها إلا الله كما قال النبيّ عليه الصلاة والسلام في وقت خروج المهدي:\n\n \" كذب الوقاتون \" \n\n، ولعمري ما يعلمها عند وقوعها أيضاً إلا الله كما هي قبل وقوعها\n { ثقلت في السموات والأرض } إذ لا يسع أهلها علمها\n { إنّ الذين تدعون من دون الله } كائنين من كانوا، ناساً كانوا أو غيرهم { عباد أمثالكم } في العجز وعدم التأثير { فادْعُوهم } إلى أمر لا ييسره الله لكم { فليستجيبوا لكم } إلى تيسيره { إن كنتم صادقين } في نسبة التأثير إلى الغير، كما قال النبيّ عليه الصلاة والسلام لابن عباس:\n",
      "translations": [
        {
          "translation": "\n\n{Those} are like {cattle} in that they have lost awareness of the truths and knowledge that would bring them closer to Allah in their hearts, and do not consider or remember Allah with their eyes or their ears. {Rather, they are astray}, due to the presence of Satan within them, which leads them to evil deeds and false beliefs. {To Allah belong the most beautiful names}. Every name is, in truth, a reflection of His attributes.,\nAnd God manages every matter by one of His Names. So call upon Him by that name when you are in need of it, either in the state of the tongue as the ignorant [person] when he seeks knowledge, calls upon Him by His Name, the All-Knowing.,\n\nAnd the patient, if he requests healing, invokes him by his healing name.,\n\nAnd the poor man, when he seeks wealth, invokes it in the name of the singer.,\n\n{All} that is required for admission to the effect of that name and the effect of that attribute.\n\n\nAs for the tongue of the speaker, when the first person says, \"O Lord,\",\n\nHe wants it, O wise one.,\n\nHis rubber ball is specifically named after him.\n\n\nAnd the second: He wants by my Lord, O my healer!\n\n\nAnd the third: O singer\n\n\nAnd as for the language of the verb, as the student who has mastered it calls it by its proper name, if he is expert in his knowledge of it, he calls it by its name, the knowledgeable.,\n\nAnd if he finds a cure for his own illness and seeks to cure others with it, he is called by his name: the healer.,\n\nAnd if he is freed from poverty through his own efforts, he calls on Him by His name: the Independent.\n\n\nThis is the call to action for the believing Muslims to unite.\n\n\n{And leave those who take their religion as a game and sport} They seek these attributes from others and add them to him, so they associate with him.\n\n\nThe hour referred to in the Quran is the time of the great resurrection.,\n\n{The Mahdi} will appear when the time is right, and only Allah knows when that will be. As the Prophet Muhammad (peace be upon him) said when asked about the Mahdi's appearance:\n\n\n\"They are lying about the times.\"\n\n\nأَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ\n\nI seek refuge in Allah from the accursed Satan.,\n\n{I don't know what will happen to me when it happens, just as I don't know what happened before it happened.}\n\n\nThe heavens and the earth are burdened with His knowledge, for its inhabitants cannot comprehend it.\n\n\nThose whom you call upon instead of God are nothing but creatures like yourselves.,\n\nThere were people like you {servants} who were powerless and unable to influence {so you should call on them}. Allah will not make it easy for you to {so they should respond to you} in order to make it easier for you {if you are truthful} in terms of influencing others.,\n\nThe Prophet (peace and blessings be upon him) said to Ibn Abbas:",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { وَلَقَدْ ذَرَأْنَا } أوجدنا وأظهرنا { لِجَهَنَّمَ } البعد والخذلان ونيران الإمكان والحرمان { كَثِيراً مِّنَ ٱلْجِنِّ وَٱلإِنْسِ } مع أن { لَهُمْ قُلُوبٌ } هي مناط التكاليف ومحال الإيمان والإيقان، وهم { لاَّ يَفْقَهُونَ بِهَا } ليحصل لهم مرتبة اليقين العلمي واللدني { وَلَهُمْ } أيضاً { أَعْيُنٌ } هي سبب مشاهدة الآثار والاستدلال منها على الأوصاف الموجدة لها، المرتبة على الذات الإلهي، وهم { لاَّ يُبْصِرُونَ بِهَا } ليحصل لهم مرتبة اليقين العيني\n\n\n\n\n{ وَلَهُمْ } أيضاً { آذَانٌ } وهي آلات السماع كلمة الحق ووسائق إلى اكتساب الفاضائل المنبهة على ما في نفوسهم من الأسرار المكنونة الإلهية، وهم { لاَّ يَسْمَعُونَ بِهَآ } ليحصل لهم الترقي إلى مرتبة اليقين العيني إلى اليقين الحقي، وبالجملة: { أُوْلَـٰئِكَ } الحمقاء الجهلاء، المتصفون بأوصاف العقلاء، العرفاء { كَٱلأَنْعَامِ } في عدم الشعور والتنبه { بَلْ هُمْ } بسبب تضييع استعدادهم { أَضَلُّ } من الأنعام بمراتب، وبالجملة: { أُوْلَـٰئِكَ هُمُ ٱلْغَافِلُونَ } [الأعراف: 179] المقصرون على الغفلة المؤبدة، المتناهون فيها أقصى الغاية\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ولقد ذرأنا } خلقنا { لجهنم كثيرًا من الجن والإنس } كتبنا عليهم الشقاء في سابق الأزل، فهم من قبضة أهل النار، كما قال:\n\n \" هؤلاء إلى الجنة ولا أُبالي، وهؤلاء إلى النار ولا أبالي \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "23:79",
      "similarity": 0.6114609572424065
    },
    {
      "verse": "67:24",
      "similarity": 0.6106532585655019
    },
    {
      "verse": "42:11",
      "similarity": 0.5982011849514018
    },
    {
      "verse": "16:13",
      "similarity": 0.4940328059821663
    },
    {
      "verse": "6:136",
      "similarity": 0.42053212675784823
    }
  ]
}