{
  "chapter": "الأعراف",
  "text": "يسـلونك عن الساعة ايان مرسىها قل انما علمها عند ربى لا يجليها لوقتها الا هو ثقلت فى السموت والارض لا تاتيكم الا بغتة يسـلونك كانك حفى عنها قل انما علمها عند الله ولكن اكثر الناس لا يعلمون",
  "translations": [
    {
      "translation": "They will ask you about the Hour: when is it due? Say: 'Knowledge of it rests with my Lord alone. He alone will reveal it at its proper time. It hangs heavy in the heavens and the earth. It will not come upon you except suddenly.' They will ask you as if you had full knowledge of it. Say: 'Knowledge of it rests with Allah alone. But most people do not know that.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the Hour: \"When is its determined time?\" Say: \"Only my Lord has the knowledge. No one can reveal it except He. Oppressive will it be for the heavens and the earth. When it comes, it will come unawares.\" They ask you about it as if you were in the know. You tell them: \"Only God has the knowledge.\" But most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you concerning the Hour, when will its coming be? Say: 'The knowledge of it is with my Lord alone: none but He will disclose it at its time. That will weigh heavily on the heavens and the earth; and it shall not come to you other than all of a sudden.' They ask you - as if you are eagerly inquisitive about it - concerning it. Say to them: 'The knowledge of it is with none except Allah. But most people are unaware of this reality.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you (Muhammad), \"When will the Day of Judgment be?\" Tell them, \"My Lord knows best. It is He who has appointed its time. It will be a grave hour both in the heavens and the earth. It will only approach you suddenly.\" They say, \"It seems that you know about the coming of the Day of Judgment.\" Tell them, \"Only God knows about it and most people do not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the Resurrection, as to when it is destined; say, “Indeed its knowledge is with my Lord; only He will manifest it at its time; it is proving cumbersome in the heavens and the earth; it will not come to you except suddenly”; they question you as if you have researched it deeply; say, “Indeed its knowledge is with Allah only but most people do not know.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the Hour (Day of Resurrection): \"When will be its appointed time\" Say: \"The knowledge thereof is with my Lord (Alone). None can reveal its time but He. Heavy is its burden through the heavens and the earth. It shall not come upon you except all of a sudden.\" They ask you as if you have a good knowledge of it. Say: \"The knowledge thereof is with Allah (Alone), but most of mankind know not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the hour, when will be its taking place? Say: The knowledge of it is only with my Lord; none but He shall manifest it at its time; it will be momentous in the heavens and the earth; it will not come on you but of a sudden. They ask you as if you were solicitous about it. Say: Its knowledge is only with Allah, but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will question thee concerning the Hour, when it shall berth. Say: 'The knowledge of it is only with my Lord; none shall reveal it at its proper time, but He. Heavy is it in the heavens and the earth; it will not come on you but suddenly!' They will question thee, as though thou art well-informed of it. Say: 'The knowledge of it is only with God, but most men know not.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee of the (destined) Hour, when will it come to port. Say: Knowledge thereof is with my Lord only. He alone will manifest it at its proper time. It is heavy in the heavens and the earth. It cometh not to you save unawares. They question thee as if thou couldst be well informed thereof. Say: Knowledge thereof is with Allah only, but most of mankind know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you [Prophet] about the Last Hour, \"When will it come?\" Say, \"Knowledge about it rests only with my Lord; He alone will reveal when its time will come, it lies heavy on the heavens and the earth: it will suddenly overtake you.\" They will put questions to you as though you had full knowledge of it. Say, \"Knowledge about it rests only with God, though most people do not realize it.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee concerning the Hour, when will its coming be? Say thou: knowledge thereof is with my Lord only: none shall disclose it at its time buthe; heavy it is in the heavens and the earth; it shall not come upon you except on a sudden. They ask thee as though thou wert familiar therewith. Say thou: knowledge thereof is with Allah only; but most of men know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They question you concerning the Hour, when will it set in? Say, ‘Its knowledge is only with my Lord: none except Him shall manifest it at its time. It will weigh heavy on the heavens and the earth. It will not overtake you but suddenly.’ They ask you as if you were in the know of it. Say, ‘Its knowledge is only with Allah, but most people do not know.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask thee about the (final) Hour - when will be its appointed time? Say: \"The knowledge thereof is with my Lord (alone): None but He can reveal as to when it will occur. Heavy were its burden through the heavens and the earth. Only, all of a sudden will it come to you.\" They ask thee as if thou Wert eager in search thereof: Say: \"The knowledge thereof is with Allah (alone), but most men know not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the Hour (Day of Resurrection): \"When will be its appointed time?\" Say: \"The knowledge thereof is with my Lord (Alone). None can reveal its time but He. Heavy is its burden through the heavens and the earth. It shall not come upon you except all of a sudden.\" They ask you as if you have a good knowledge of it. Say: \"The knowledge thereof is with Allah (Alone) but most of mankind know not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the Hour and when it is to come. Say: 'None knows except my Lord. He alone will reveal it at the appointed time. It is heavy in the heavens and earth. It will not come to you but suddenly' They will question you, as though you had full knowledge of it. Say: 'Its knowledge is with Allah, though most people are unaware'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you about the Hour, “When will it come?” Say, “Knowledge of it rests with my Lord. None can reveal its coming except He. It weighs heavily on the heavens and the earth. It will not come upon you except suddenly.” They ask you as if you are responsible for it. Say, “Knowledge of it rests with God,” but most people do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They ask you, [O Muhammad], about the Hour: when is its arrival? Say, \"Its knowledge is only with my Lord. None will reveal its time except Him. It lays heavily upon the heavens and the earth. It will not come upon you except unexpectedly.\" They ask you as if you are familiar with it. Say, \"Its knowledge is only with Allah, but most of the people do not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:187] They, that is the people of Mecca, will question you about the Hour, the Resurrection, when it shall come to pass. Say, to them: ‘The knowledge of, when, it, shall be, is only with my Lord. He alone shall reveal it, manifest it, at its proper time (li-waqtihā: the lām here functions as fī, ‘at’). It weighs heavily, tremendously, in the heavens and the earth, upon their inhabitants, because of its awesomeness. It will not come on you save all of a sudden’. They will question you, as if you were preoccupied with, obsessed with inquiring about, it, such that you have come to acquire knowledge of it. Say: ‘Knowledge of it is only with God (innamā ‘ilmuhā ‘inda’Llāhi is for emphasis), but most people do not know’, that knowledge of it lies with God, exalted be He.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(They) the people of Mecca (ask thee) Muhammad (of the (destined) Hour) about the timing and occurrence of the Last Hour, (when will it come to port. Say: Knowledge thereof) the knowledge of its timing and occurrence (is with my Lord only) is from my Lord. (He alone will manifest it at its proper time) none but He manifests its occurrence and timing. (It is heavy in the heavens and the earth) the knowledge of its occurrence and timing is heavy on the dwellers of the heavens and earth. (It cometh not to you save unawares) except all of a sudden. (They question thee) Muhammad about the Hour (as if thou couldst be well informed thereof) as if you have knowledge of its timing; it is also said that this means: as if you are ignorant of it; as it is said that this means: as if you are oblivious to it. (Say) Muhammad: (Knowledge thereof) knowledge of its occurrence and timing (is with Allah only) from Allah only, (but most of mankind) the people of Mecca (know not) nor believe in it.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لاَ يُجَلِّيهَا لِوَقْتِهَآ إِلاَّ هُوَ } معناهُ لا يُظهرُهَا\n\n\n\n\nوقوله تعالى: { ثَقُلَتْ فِي ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } معناهُ عَظمُ ذِكرهَا\n\n\n\n\nوقوله تعالى: { أَيَّانَ مُرْسَاهَا } معناه مَتَى ذَاكَ\n\n\n\n\nوقوله تعالى: { ثَقُلَتْ فِي ٱلسَّمَٰوَٰتِ وَٱلأَرْضِ } معناهُ كَبُرتْ وعَظمَتْ فَثَقُلَ عِلْمُها عَلَى أَهلِ السَّمواتِ والأَرضِ أَنهم لاَ يَعلمونَ\n\n\n\n\nوقوله تعالى: { كَأَنَّكَ حَفِيٌّ عَنْهَا } معناهُ بَارٌ بِها\n ويقالُ عَالِمٌ بِهَا، وأَنتَ لاَ تَعلمُهَا\n\n",
      "translations": [
        {
          "translation": " The saying of the Most High: {He does not reveal it at its time, but He} means that He does not reveal it.\n The saying of the Most High: {It is He who has made the earth firm, placed mountains on it, and placed rivers in it} means the greatness of His remembrance.\n\nAnd His saying, {When will that be?} Its meaning is, when is that?\n\n\nAnd His saying, {It has been made heavy in the heavens and the earth}, means that it is great and vast, so the knowledge of it is heavy upon the people of the heavens and the earth, that they do not know.\n\n\nAnd His saying, {as if you are detached from it} means complete detachment from it.\n\n\nIt is said that someone is knowledgeable about something if you do not know about it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَسْأَلُونَكَ } يا أ:مل الرسل { عَنِ ٱلسَّاعَةِ } التي تخوفهم منها ومن شدة أهوالها وأفزاعها: { أَيَّانَ مُرْسَٰهَا } أي: في أي آن من الآنات وزمان من الأزمنة قيامها ووقوعها حتى نؤمن لها قبل قيامها؟ { قُلْ } يا أكمل الرسل في جوابهم: { إِنَّمَا عِلْمُهَا } أي: علم قيامها { عِنْدَ رَبِّي } مما استأثر بها سبحانه لا يطلع عليها أحد\n بحيث { لاَ يُجَلِّيهَا } أي: لا يظهرها ولا يكشف أمرها { لِوَقْتِهَآ } الذي عيّن { إِلاَّ هُوَ } إذ هو من الغيوب الخمسة التي خصصها سبحانه لنفسه في قوله:\n[لقمان: 34] وإنما أخفاها وأبْهَم وقتها\n ولم يطلع أحداً عليها\n لأن الحكمة تقتضي ذلك\n لأن سبحانه لو أظهر أمرها على عباده { ثَقُلَتْ } عظُمت وشقت أمرها\n واشتدت هولها { فِي ٱلسَّمَٰوَٰتِ } على أهلها وساكنيها من الملائكة { وَٱلأَرْضِ } عن من أسكنها وعاش عليها من الثقلينز\n\nولذلك { لاَ تَأْتِيكُمْ } الساعة عند إتيانها { إِلاَّ بَغْتَةً } فجأة وعلى غفلة بحيث لا يسع ترك ما كنتم فيه من الأمور\n كما أخبر النبي صلى الله عليه وسلم:\n \" إن الساعة تهيج ب النال\n والرجل يصلح حوضه\n والرجل يسقي ماشيته\n والرجل يقوم سلعته في سوقه\n والرجل يخفض ميزانه ويرفعه \" \n\n وإنما { يَسْأَلُونَكَ } عن الساعة وقيامها لظنهم فيك\n لنجابة طينتك { كَأَنَّكَ حَفِيٌّ عَنْهَا } خبير لوقتها\n عليم بشانها\n مذكر لها دائماً\n مفتش عن أحوالها وأهوالها مستمراً { قُلْ } لهم: { إِنَّمَا عِلْمُهَا } وقت ظهورها { عِندَ ٱللَّهِ } وفي خزانة قدره ولوح قضائه\n وعالم سمائه وغيب ذاته { وَلَـٰكِنَّ أَكْثَرَ ٱلنَّاسِ لاَ يَعْلَمُونَ } [الأعراف: 187] أنه سبحانه مختص بها\n لا يُطلع أحداً عليها\n\n\n{ قُل } يا أكمل الرسل لمن ظن بك أنك حفي عليم بسرائر الأمور ومخفياتها\n خبير بحقائق الموجودات وماهياته\n اعترافاً بالعبودية وسلباً للاختيار عن نفسك: { لاَّ أَمْلِكُ لِنَفْسِي نَفْعاً } أي: جلب نفع { وَلاَ ضَرّاً } أي: دفع ضر { إِلاَّ مَا شَآءَ ٱللَّهُ } إيصاله إليَّ من النفع والضر",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: إنما سميت القيامة ساعة: لسرعة حسابها، أو وقوعها، لقوله:\n[النّحل:77]. يقول الحقّ جلّ جلاله: { يسألونك } أي: قريش، { عن الساعة } أي: قيام الناس من قبورهم للحساب، { أيَّان مُرسَاها } أي: متى إرساؤها، أي: ثبوتها ووقوعها؟ { قل إنما علمها عند ربي } استأثر بعلمها، لم يطلع عليها ملكًا مقربًا، ولا نبيًا مرسلاً { لا يُجلِّيها لوقتها } أي: لا يُظهرها عند وقت وقوعها، { إلا هو } ، والمعنى إن إخفاءها يستمر إلى وقت وقوعها، { ثَقُلَت في السماوات والأرض } عظمت على أهلها من الملائكة والثقلين لهولها، وكأنه إشارة إلى الحكمة في إخفائها. أو ثَقُلَت على السماوات والأرض أنفسهما لتبدلهما وتغير حالهما، { لا تأتيكم إلا بغتةً }: فجأة على غفلة، كما قال صلى الله عليه وسلم\n \" إنَّ الساعَة تَهِيجُ بالنَّاسِ، والرَّجُلُ يُصلِحُ حَوضَهُ، والرَّجُلُ يَسقِي مَاشِيتَهُ، والرَّجلُ يُقَوَّم سِلعَته في سُوقِه، والرَّجُل يَخفِضُ مِيزَانَهُ ويرفعه \" \nوالمراد: النفخ في الصور للصعق، لأن الساعة مُرَتَّبة عليه وقريبة منه. { يسألونك كأنك حَفِيٌّ عنها } أي: عالم بها، من حفى على الشيء: إذا سأل عنه، فإنَّ من بالغ في السؤال عن الشيء، والبحث عنه، استحكم علمه فيه، أي: يسألونك عن وقت قيامها، كأنك بليغ في السؤال عنها فعلمتها، وليس كما يزعمون، وأما قوله:\n[النَّازعَات:43]: فقيل: معناه: التعجب عن كثرة اهتمامه بالسؤال، أي: في أي شغل أنت من ذكراها والسؤال عنها؟ ولا يُعارض ما هنا لأنه استغنى عن ذلك بتلك الآية، وبعدها نزلت هذه، والله أعلم. وقيل: \" عنها \": يتعلق بـ { يسألونك } ، أي: يسألونك عنها كأنك حفي بهم، أي: شفيق بهم، قيل: إن قريشًا قالوا: إنَّ بيننا وبينك قرابة، فقل لنا: متى الساعة؟ فقال له الحق تعالى: { قل إنما علمها عند الله } لا يعلمها غيره، وكرره لتكرر \" يسألونك \". { ولكن أكثر الناس لا يعلمون } أن علمها عند الله لم يؤته أحدًا من خلقه. الإشارة: إذا أشرق نور اليقين في القلب صارت الأمور المستقبلة حاصلة، والغائبة حاضرة، والآجلة عاجلة، فأهل اليقين الكبير قدّموا ما كان آتيًا، فحاسبوا أنفسهم قبل أن يُحاسبوا، ووزنوا أعمالهم قبل أن تُوزن عليهم، وجازوا الصراط بسلوكهم المنهاج المستقيم، ودخلوا جنة المعارف قبل حصول جنة الزخارف، فالموت في حقهم إنما هو انتقال من حال إلى حال، ومن مقام إلى مقام، ومن دار الغرور إلى دار الهناء والسرور. وفي الحِكم: \" لو أشرق لك نور اليقين في قلبك، لرأيت الآخرة أقرب إليك من أن ترحل إليها، ولرأيت محاسن الدنيا قد ظهرت كسفة الفَنَاء عليها \". قال الشيخ ابن عباد رضي الله عنه: نور اليقين تتراءىء به حقائق الأمور على ما هي عليه، فيحق به الحق، ويبطل به الباطل، والآخرة حق، والدنيا باطل، فإذا أشرق نور اليقين في قلب العبد أبصر به الآخرة التي كانت غائبة عنه حاضرة لديه، حتى كأنها لم تزل، فكانت أقرب إليه من أن يرتحل إليها، فحق بذلك حقها عنده، وأبصر الدنيا الحاضرة لديه، قد انكسف نورها وأسرع إليها الفناء والذهاب، فغابت عن نظره بعد أن كانت حاضرة، فظهر له بطلانها، حتى كأنها لم تكن، فيوجب له هذا النظر اليقيني الزهادة في الدنيا والتجافي في زهرتها، والإقبال على الآخرة، والتهيؤ لنزول حضرتها، ووجدان العبد لهذا هو علامة انشراح صدره بذلك النور.\nكما قال النبي صلى الله عليه وسلم:\n \" إنَّ النورَ إذا دَخَلَ القلبَ انشرحَ له الصَّدرُ وانفسَحَ \" \n،وقِيلَ يا رَسُولَ اللهِ: هَل لذلكَ مِن عَلامَةٍ يُعرَفُ بِها؟ قال:\n \" نعَمَ. التَّجَافي عَن دَارِ الغُرُورِ، والإنَابَةُ إلى دَارِ الخُلُودِ، والاستِعدَادُ للمَوتِ قَبل نُزُولهِ \" \nأو كما قال ـ صلى الله عليه وسلم ـ. وعند ذلك تموت شهواته وتذهب دواعي نفسه، فلا تأمره بسوء، ولا تطالبه بارتكاب منهي، ولا تكون لهم همة إلا المسارعة إلى الخيرات، والمبادرة لاغتنام الساعات والأوقات، وذلك لاستشعاره حلول الأجل، وفوات صالح العمل، وإلى هذا الإشارة بحديثي حارثة ومعاذ ـ رضي الله عنهما ـ. رَوى أنس بن مالك رضي الله عنه قال: بينما رسول الله صلى الله عليه وسلم يمشي إذ استقبله شابٌ من الأنصار، فقال له النبي صلى الله عليه وسلم:\n \" كَيْفَ أصبحَتَ يا حارثةٌ؟ \" \nقال: أصبحت مؤمنًا بالله حقًا، قال:\n \" انظر ما تقول، فإن لكلِّ قَولٍ حقيقة؟ \" \nفقال: يا رسولَ الله عَزَفت نَفسِي عن الدنيا فأسهَرْتُ لَيلي وأظمَأتُ نهاري، وكأني بعَرش ربي بارزًا، وكأني أنظر إلى أهلِ الجنّةِ يَتَزَاوَرُون فيها، وكأني أنظرُ إلى أهل النار يتعاوون فيها، فقال:\n \" أبصَرتَ فالزَم، عَبدٌ نور اللهُ الإيمانَ في قلبه.. \" \nإلى آخر الحديث. وروى أنس رضي الله عنه أيضًا: أن معاذَ بن جبل دخل على النبي صلى الله عليه وسلم وهو يبكي، فقال له:\n \" كيف أصبحتَ يا معاذ؟ \" \nفقال: أصبحتُ بالله مؤمنًا، قال النبي صلى الله عليه وسلم:\n \" إنَّ لكل قول مصداقًا، ولكل حق حقيقة، فما مصداق ما تقول؟ \" \nفقال: يا نبيَّ اللهِ، ما أصبحتُ صباحًا قط إلا ظننتُ أني لا أُمسي، ولا أمسَيتُ قط إلا ظننت إني لا أُصبِح، ولا خَطَوتُ خطوةً قط إلا ظننتُ أني لا أُتبِعُها أُخرَى، وكأني أنظرُ إلى كل أمةٍ جاثية تُدعى إلى كتابها، معها نبيُها وأوثَانُها التي كانت تعبدُ من دون اللهِ، وكأني أنظرُ إلى عُقُوبَةِ أهلِ النَّارِ وثوابِ أهلِ الجنة. قال رسول الله صلى الله عليه وسلم:\n \" عَرَفَت فالزَم \" \nانظر بقية كلامه رضي الله عنه. ثم أمر نبيه صلى الله عليه وسلم بالاعتراف بالتقصير عن علم الغيب، الذي اختص الله به كعلم الساعة وغيرها، فقال: { قُل لاَّ أَمْلِكُ لِنَفْسِي نَفْعاً وَلاَ ضَرّاً }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:47",
      "similarity": 0.4700251195909399
    },
    {
      "verse": "79:42",
      "similarity": 0.4051731591765842
    },
    {
      "verse": "47:37",
      "similarity": 0.33216170900287745
    },
    {
      "verse": "91:3",
      "similarity": 0.312499852884847
    },
    {
      "verse": "92:2",
      "similarity": 0.312499852884847
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/7:187.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/7:187.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:187.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}