{
  "chapter": "الأعراف",
  "text": "والذين كذبوا۟ بـايتنا سنستدرجهم من حيث لا يعلمون",
  "translations": [
    {
      "translation": "But as for those who deny Our Signs, We will lead them, step by step, into destruction from where they do not know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall punish those who deny Our revelations slowly in a way that they will not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who reject Our signs as false, We shall lead them, step by step, to their ruin without their even perceiving it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We gradually lead those who have called Our revelations mere lies, to destruction. Their destruction will be such that they will not even notice how it seized them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who denied Our signs – We shall soon steadily lead them towards the punishment, from the place they will not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Our Ayat, We shall gradually seize them with punishment in ways they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as to) those who reject Our communications, We draw them near (to destruction) by degrees from whence they know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who cry lies to Our signs We will draw them on little by little whence they know not;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who deny Our revelations - step by step We lead them on from whence they know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall gradually seize those who reject Our signs from a place they do not recognize.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who belie Our signs, step by step We lead them on in a way they know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who deny Our signs, We will draw them imperceptibly [into ruin], whence they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Our signs, We shall gradually visit with punishment, in ways they perceive not;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.), We shall gradually seize them with punishment in ways they perceive not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who belie Our verses, We will draw them on little by little, from where they cannot tell;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who reject Our messages, We will gradually lead them from where they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who deny Our signs - We will progressively lead them [to destruction] from where they do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:182] And those who deny Our signs — the Qur’ān — from among the people of Mecca, We will draw them on by degrees, We will lead them on gradually, whence they do not know.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And those who deny Our revelations) Muhammad (pbuh) and the Qur'an. These are Abu Jahl and his followers as well as all those who make a mockery of any punishment inflicted on them (step by step We lead them on) We will punish them (from whence they know not) that the punishment is being sent to them. And indeed Allah destroyed them in one day, each of which with a different type of destruction.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَٱلَّذِينَ كَذَّبُواْ بِآيَاتِنَا سَنَسْتَدْرِجُهُمْ مِّنْ حَيْثُ لاَ يَعْلَمُونَ } الاْستِدْرَاجُ: أَن يَأتِيهِ الشَّيءُ مِنْ حَيثُ لاَ يَعْلَمُ وَلاَ يَشْعُرُ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ كَذَّبُواْ بِآيَٰتِنَا } الدالة على توحيدنا، المنزلة على رسلنا { سَنَسْتَدْرِجُهُمْ } سنستضلهم ونستزلهم قليلاً قليلا إلى أن نهلكهم بالمرة، وندخلهم في جنهم البعد وسعير الإمكان { مِّنْ حَيْثُ لاَ يَعْلَمُونَ } [الأعراف: 182] ولا يفهمون كيف وقعوا فيها\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: أصل الاستدراج: الاستصعاد، أو الاستنزال درجة بعد درجة، ومعناه: نسوقهم إلى الهلاك شيئًا فشيئًا\n يقول الحقّ جلّ جلاله: { والذين كذَّبوا بآياتنا } ، وألحدوا في أسمائنا، { سَنَسْتَدْرِجُهُم } أي: ندرجهم إلى الهلاك شيئًا فشيئًا، { من حيث لا يعلمون } ما نريد بهم، وذلك أَن تتواتر النعم عليهم، فيظنوا أنها لطفٌ من الله بهم، فيزدادوا بطرًا وانهماكًا في الغي، حتى تحق عليه كلمة العذاب\n { وأُملي لهم } أي: وأمهلهم، أي: وأمدهم بالأموال والبنين والعُدة والعَدد، حتى نأخذهم بغتة، { إنَّ كيدي متين } أي: أخذي شديد، وإنما سماه كيدًا لأن ظاهره إحسان وباطنه خذلان\n الإشارة: قال الشيخ زروق رضي الله عنه: الاستدراج: هو كُمون المحنة في عين المنة، وهو من درج الصبي إذا أخذ في المشي شيئًا بعد شيء، ومنه: الدرج الذي يرتقي عليه إلى العلو، كذلك المستدرج هو الذي تُؤخذ منه النعمة شيئًا بعد شيء وهو لا يشعر\n قال تعالى: { سَنَسْتدرِجُهُم من حيث لا يعلمون }\n هـ\n فالاستدراج ليس خاصًا بالكفار، بل يكون في المؤمنين خواصهم وعوامهم\n قال في الحكم: \" خف من وجود إحسانه إليك، ودوام إساءتك معه، أن يكون ذلك استدراجًا لك { سَنَسْتَدرِجُهُم من حيث لا يعلمون } \"\n وقال سهل بن عبدالله رضي الله عنه: نمدهم بالنعم، وننسيهم الشكر عليها، فإذا ركنوا إلى النعمة وحجبوا عن المنعم: أُخذوا\n وقال ابن عطاء رضي الله عنه: كلما أحدثوا خطيئة جددنا لهم نعمة، وأنسيناهم الاستغفار من تلك الخطيئة\n وقال الشيخ ابن عباد رضي الله عنه: الخوف من الاستدراج بالنعم من صفة المؤمنين، وعدم الخوف منه مع الدوام على الإساءة من صفة الكافرين\n يقال: من أمارات الاستدراج: ركوب السيئة والاغترار بزمن المُهلة، وحمل تأخير العقوبة على استحقاق الوصلة، وهذا من المكر الخفي\n قال تعالى: { سَنَسْتدرِجُهُم من حيث لا يعلمون } أي: لا يشعرون بذلك، وهو أن يلقي في أوهامهم أنهم على شيء، وليسوا كذلك، يستدرجهم في ذلك شيئًا فشيئًا، حتى يأخذهم بغتة، كما قال تعالى: { فلما نسوا ما ذُكروا به } إشارة إلى مخالفتهم وعصيانهم، بعدما رأوا من الشدة، { فتحنا عليهم أبواب كل شيء } أي: فتحنا عليهم أسباب العوافي وأبواب الرفاهية، { حتى إذا فرحوا بما أُوتوا } من الحظوظ الدنيوية، ولم يشكروا عليها برجوعهم منها إلينا، { أخذناهم بغتة } أي: فجأة،\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "68:44",
      "similarity": 0.7770250883777196
    },
    {
      "verse": "4:96",
      "similarity": 0.620981491535419
    },
    {
      "verse": "3:163",
      "similarity": 0.5957382041679362
    },
    {
      "verse": "46:19",
      "similarity": 0.5702352998831609
    },
    {
      "verse": "20:75",
      "similarity": 0.5460302223750431
    }
  ]
}