{
  "chapter": "الأعراف",
  "text": "قال اخرج منها مذءوما مدحورا لمن تبعك منهم لاملان جهنم منكم اجمعين",
  "translations": [
    {
      "translation": "He said, 'Get out of it, reviled and driven out. As for those of them who follow you, I will fill up Hell with every one of you.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Begone,\" said (God), \"contemptible and rejected! As for those who follow you, I shall fill up Hell with all of you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: 'Go away from here - disgraced and expelled. I shall fill the Hell with all those that follow you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord told Satan, \"Get out of this garden, for you are banished and despised. Hell will be filled with all of those who follow you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Exit from here, rejected, outcast; indeed whoever among them follows your bidding, I will fill hell with all of you.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said (to Iblis): \"Get out from this (Paradise), Madh'uman Madhura. Whoever of them (mankind) will follow you, then surely, I will fill Hell with you all.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Get out of this (state), despised, driven away; whoever of them will follow you, I will certainly fill hell with you all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said He, 'Go thou forth from it, despised and banished. Those of them that follow thee -- I shall assuredly fill Gehenna with all of you.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Go forth from hence, degraded, banished. As for such of them as follow thee, surely I will fill hell with all of you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Get out of here, despised, and rejected! I shall fill Hell with all of those who follow you.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: go thou forth from hence, scorned, driven away. Whosoever of them followeth thee, I will of a surety fill Hell with you all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said He, ‘Begone hence, blameful and banished! Whoever of them follows you, I will surely fill hell with you all.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"Get out from this, disgraced and expelled. If any of them follow thee,- Hell will I fill with you all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said (to Iblis) \"Get out from this (Paradise) disgraced and expelled. Whoever of them (mankind) will follow you, then surely I will fill Hell with you all.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Begone' said He, 'despised and outcast. (As for) those of them that follow you, I shall fill Gehenna (Hell) with all of you'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Get out of it, despised and vanquished. Whoever among them follows you—I will fill up Hell with you all.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah] said, \"Get out of Paradise, reproached and expelled. Whoever follows you among them - I will surely fill Hell with you, all together.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:18] Said He, ‘Go forth from it, degraded (read madh’ūman) disgraced or despised, and banished, removed from mercy. As for those of them, of people, who follow you (la-man, ‘as for those who’: the lām is for inceptiveness; or it is for introducing the oath, which is [the following]) I shall assuredly fill Hell with all of you’, that is, with you, through your seed, and with people — herein [in this address] those present have predominance over those absent (this [last] sentence [of the verse] expresses the sense of ‘the requital’ [suggested] in the conditional man, ‘who’: in other words, ‘whoever follows you, then I shall punish him’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(He said: Go forth from hence, degraded) rebuked, (banished) far from good. (As for such of them) from the jinn and humans (as follow thee) obey you, (surely I will fill hell with all of you) of the disbelievers among the jinn and humans.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { ٱخْرُجْ مِنْهَا مَذْءُوماً } معناهُ معيبٌ مرجومٌ { مَّدْحُوراً } معناه مُبعدٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"Leave it abased, despised,\" means abandoned. { مَّدْحُوراً } means isolated.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم لما طرده الحق وأبعده وأنظره ابتلاء لعباده { قَالَ } سبحانه: { ٱخْرُجْ } أيها المردود المطرود { مِنْهَا } أي: من عرصة أهل التوحيد { مَذْءُوماً } حاملاً للمذمة { مَّدْحُوراً } مطروداً مستوجباً للعنة وافعل بهم ما شئت\n والله { لَّمَن تَبِعَكَ مِنْهُمْ } بعدما أظهرتهم على صورتي\n وكرمتهم بكرامتي على جميع خليقتي\n ونخفت فيهم من روحي وتجليت عليهم بجميع أسمائي وأوصافي\n وأرسلت إليهم أنبيائي ورسولي\n وأنزلت عليهم كتبي لتبيين طريق توحيدي\n لأطردنهم البتة عن عز حضوري\n وأخرجهم عن جنة سروري\n واعلموا يا بني آدم { لأَمْلأَنَّ جَهَنَّمَ } البعد الخذلان { مِنكُمْ أَجْمَعِينَ } [الأعراف: 18] إن ابتعتم عدوي وعدوكم\n فعليكم أن تجتنبوا عن غوائله",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال } تعالى لإبليس: { اخرج منها } من السماء أو الجنة\n { مذءومًا } أي: مذمومًا\n من ذامه\n أي: ذمه\n { مدحورًا } أي: مطرودًا\n والله { لمن تَبِعَكَ منهم } في الكفر { لأملانَّ جهنم منكم أجمعين } أي: منك وممن تبعك\n تنبيه: ذكر الفخر الرازي\n في تفسيره\n عن الشهرستاني أن إبليس جرت بينه وبين الملائكة مناظرة بعد الأمر بالسجود لآدم\n فقال لهم: إني أسلم أن الله خالقي وموجدي\n وهو موجد الخلق\n ولكن لي على حكمته أسئلة: الأول: ما الحكمة في إيجاد خلقه\n لا سيما وكان عالمًا بأن الكافر لا يستوجب عند خلقه الآلام؟ الثاني: ما الفائدة في التكليف\n مع أنه لا يعود عليه نفع ولا ضرر\n وكل ما يعود إلى المكلفين فهو قادر على تحصيله لهم من غيره واسطة التكليف؟ الثالث: هب أنه كلفني بطاعته ومعرفته\n فلماذا كلفني بالسجود لآدم؟ الرابع: لما عصيته فلمَ لعنني وأوجب عقابي\n مع أنه لا فائدة له ولا لغيره منه\n وفيه أعظم الضرر؟ الخامس: لما فعل ذلك فلِمَ مكنني من الدخول إلى الجنة ووسوسة آدم؟ السادس: ثم لما فعل ذلك\n فلم سلطني على أولاده\n ومكنني من إغوائهم وإظلالهم؟ السابع: ثم لما استمهلته بالمدة الطويلة في ذلك فلم أمهلني\n ومعلوم أن العالم لو كان خاليًا من الشر لكان ذلك خيرًا\n هـ\n قال شارح الأناجيل: فأوحى الله إليه من سرادقات الكبرياء: إنك ما عرفتني\n ولو عرفتني لعلمت أنه لا اعتراض عليَّ في شيء من أفعالي\n فأنا الله لا إله إلا أنا لا أُسألُ عما أفعل\n\nقال الشهرستاني: اعلم أنه لو اجتمع الأولون والآخرون\n وحكموا بتحسين العقل وتقبيحه لم يجدوا عن هذه الشبهات تخلصًا\n أما إذا أجبنا بما أجاب به الحق ـ سبحانه ـ زالت الشبهات واندفعت الاعتراضات\n هـ\n قلت: من تشمرت فكرته بنور المعرفة\n وعرف أسرار الحكمة والقدرة\n لم يصعب عليه مثل هذه الشبهات\n وسأذكر الجواب عنها على سبيل الاختصار: أما الحكمة في أيجاد خلقه فخلقهم ليعرف بهم\n وفي الحديث القدسي:\n \" كنت كنزًا لم أعرف\n فأحببت أن أعرف\n فخلقت خلقًا لأعرف بهم \" \n\n وليظهر بهم آثار قدرته وأسرار حكمته\n وأما تعذيب الكافر بالآلام فليظهر فيه مقتضى اسمه المنتقم\n أما فائدة التكليف فلتقوم الحجة على العبيد\n وليتميز من يستحق الإحسان ممن يستحق العذاب\n فإذا عذبه لم يكن ظالمًا له\n[الكهف:49]\n ولتظهر صورة العدل في الجملة\n وأما تكليفه بالسجود لآدم فلأنه ادعى المحبة\n ومقتضاها الطاعة للحبيب في كل ما يشير إليه\n ولا تصعب إلا في الخضوع للجنس\n أو مَن دونه\n فأمره بالسجود لمن دُونه في زعمه ليظهر كذبه في دعوى محبته\n وأما لعنه وطرده فهو جزاء من كذب وعصى\n وهذا الطرد كان في علمه تعالى\n ولكن حكمته تعالى اقتضت ترتيب الأسباب وارتباطها بالمسببات\n فكان امتناعه واعتراضه سببًا لإظهار ما سبق له في علم الله\n كما كانت وسوسته لآدم سببًا في إظهار خروجه من الجنة السابق في علم الله\n وأما تمكينه من دخول الجنة فليتسبب عنه هبوط آدم الذي سبق في علمه لأن الحكمة اقتضت أن لكل شيء سببًا\n أما تسلطه على أولاده\n فليكون منديلاً تمسح به أوساخ الأقدار إذا إن الكفر والإيمان والطاعة والعصيان إنما هو بمشيئة الواحد القهار\n ولا فعل لغيره\n لكن الحق تعالى علمنا الأدب\n فخلق الشيطان والنفس والهوى مناديل\n فما كان فيه كمال نسبه لله\n وما كان فيه نقص نسبه للشيطان والنفس أدبًا مع الحضرة\n وأما إمهاله فليدوم هذا المنديل عندهم\n يمسحون فيه أوساخ المقادير التي تجري عليهم إلى انقضاء وجودهم\n وقوله:  معلوم أن العالم لو كان خاليًا من الشر لكان ذلك خيرًا\n مغالطة لأن حكمته تعالى اقتضت وجود الضدين: الخير الشر\n وبهما وقع التجلي والظهور ليظهر آثار أسمائه تعالى فإن اسمه المنتقم والقهار يقتضي وجود الشر\n فيما نفهم\n وليظهر انتقامه وبطشه للعيان\n ومعلوم أن الملك إذا وصف بوصف جلالي أو جمالي لا يظهر شرف ذلك الاسم إلا بظهور آثاره في مملكته\n وقوله:  إنك ما عرفتني\n\n\n الخ\n\n يقتضي أنه لو عرف الله حق معرفته لفهم أسرار هذه الأشياء التي اعترض بها على ما بيناها\n والله تعالى أعلم\n الإشارة: الأكوان ظاهرها أغيار\n وباطنها أنوار وأسرار\n فمن وقف مع ظاهرها لزمه الاعتراض والإنكار\n ومن نفذ إلى شهود باطنها لزمه المعرفة والإقرار\n ولعل إبليس لم يرَ ـ في حال الأمر بالسجود ـ من آدم إلا الأغيار\n ولو رأى باطنه لكان أول ساجد لله الواحد القهار\n ثم ذكر دخول آدم الجنة وخروجه منها\n فقال: { وَيَآءَادَمُ ٱسْكُنْ أَنتَ وَزَوْجُكَ ٱلْجَنَّةَ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "17:39",
      "similarity": 0.3083710832208396
    },
    {
      "verse": "17:18",
      "similarity": 0.28336931969956375
    },
    {
      "verse": "37:9",
      "similarity": 0.24200099634273392
    },
    {
      "verse": "38:85",
      "similarity": 0.08500184206734798
    },
    {
      "verse": "32:13",
      "similarity": 0.07496862797321215
    }
  ],
  "audio": [
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hafs/7:18.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/warsh/7:18.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://raw.githubusercontent.com/mohammedterryjack/quran-audio-api/main/hamza/7:18.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}