{
  "chapter": "الأعراف",
  "text": "اولم ينظروا۟ فى ملكوت السموت والارض وما خلق الله من شىء وان عسى ان يكون قد اقترب اجلهم فباى حديثۭ بعده يؤمنون",
  "translations": [
    {
      "translation": "Have they not looked into the dominions of the heavens and the earth and what Allah has created, and seen that it may well be that their appointed time is near? In what discourse after this will they have iman?",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not contemplated the kingdom of the heavens and the earth and everything created by God, (to educe) that perhaps their own term is drawing to a close? In what lore after this would they then believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not observed the kingdom of the heavens and the earth, and all that Allah has created and that their term of life might have drawn near After this warning from the Prophet, what will it be that will make them believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not considered the Kingdom of the heavens and the earth and everything that God has created? Perhaps death approaches them. In what kind of guidance can they have faith besides that of the Quran?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered deeply regarding the kingdom of the heavens and the earth, and whatever things Allah created? And that possibly their promise (of death) may have come near? So after this*, in what will they believe? (*Advent of the Last Prophet and the Holy Qur’an.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not look in the dominion of the heavens and the earth and all things that Allah has created; and that it may be that the end of their lives is near. In what message after this will they then believe\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not consider the kingdom of the heavens and the earth and whatever things Allah has created, and that may be their doom shall have drawn nigh; what announcement would they then believe in after this?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Or have they not considered the dominion of the heaven and of the earth, and what things God has created, and that it may be their term is already nigh? In what manner of discourse then will they after this believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not considered the dominion of the heavens and the earth, and what things Allah hath created, and that it may be that their own term draweth nigh? In what fact after this will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not looked into the realms of the heavens and the earth and all that God created, and seen that the end of their time might be near? What will they believe in if they do not believe in this?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Look they not at the governance of the heaven and the earth and whatsoever Allah hath created of aught, and at the fact that their term may have drawn nigh? In what discourse then will they, thereafter, believe!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not contemplated the dominions of the heavens and the earth, and whatever things Allah has created, and that maybe their time has already drawn near? So what discourse will they believe after this?!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they see nothing in the government of the heavens and the earth and all that Allah hath created? (Do they not see) that it may well be that their terms is nigh drawing to an end? In what message after this will they then believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not look in the dominion of the heavens and the earth and all things that Allah has created, and that it may be that the end of their lives is near. In what message after this will they then believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Will they not ponder upon the kingdom of the heavens and the earth, and all that Allah created, and that it may be that their term is drawing near? So, in which speech will they believe thereafter?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not observed the government of the heavens and the earth, and all the things that God created, and that their time may have drawn near? Which message, besides this, will they believe in?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not look into the realm of the heavens and the earth and everything that Allah has created and [think] that perhaps their appointed time has come near? So in what statement hereafter will they believe?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:185] And have they not reflected upon the dominion, the kingdom (malakūt is mulk) of the heaven and of the earth, and, upon, what things God has created (min shay’in is an explication of the preceding mā, ‘what’), so that they are able to infer the power of their Creator and His Oneness, and, upon, that, [upon] the fact that, it may be that their term is already near, so that they might hasten to believe, lest they die as disbelievers and move towards the Fire? In what fact then after this, that is, the Qur’ān, will they believe?\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nترق في الإنكار والتعجيب من حالهم في إعراضهم عن النظر في حال رسولهم . إلى الإنكار والتعجيب من إعراضهم عن النظر فيما هو أوضح من ذلك وأعم ، وهو ملكوت السموات والأرض ، وما خلق الله من شيء مما هو آيات من آيات وحدانية اللَّه تعالى التي دعاهم الرسول صلى الله عليه وسلم إلى الإيمان بها . والمناسبة بين الكلامين : أن دعوة الرسول إلى التوحيد وإبطال الشرك هو من أكبر بواعثهم على تكذيبهِ { أجعل الآلهة إلهاً واحداً إن هذا لشيءٌ عُجابٌ } \\[ ص : 5 \\].وعُدِّي فعل ( النظر ) إلى متعلِّقه بحرف الظرفية ، لأن المراد التامل بتدبر ، وهو التفكر كقوله تعالى : { وفي أنفسكم أفلا تبصرون } \\[ الذاريات : 21 \\] وتقول نظرت في شأني ، فدل بحرف الظرفية على أن هذا التفكر عميق متغلغل في أصناف الموجودات وهي ظرفية مجازية .والملكوت المُلك العظيم ، وقد مضى عند قوله تعالى : { وكذلك نري إبراهيم ملكوت السماوات والأرض } في سورة الأنعام ( 75 ).وإضافته إلى السماء والأرض بيانية أي الملك الذي هو السماوات والأرض أي مُلك الله لهما ، فالمراد السماء بمجموعها والأرض بمجموعها الدالين على عظم ملك الله تعالى .وعطف { وما خلق الله من شيء } على { ملكوت } فقسّم النظر إلى نظر في عظيم مُلك الله تعالى ، وإلى نظر في مخلوقاته ودقائق أحوالها الدالة على عظيم قدرة الله تعالى ، فالنظر إلى عظمة السموات والأرض دليل على عظم ملك الله تعالى فهو الحقيق بالإلهية دون غيره ، والنظر إلى المخلوقات دليل على عظم قدرته تعالى ، وأنه المنفرد بالصنع فهو الحقيق بالإلهية ، فلو نظروا في ذلك نظر اعتبار؛ لعلموا أن صانع ذلك كله ليس إلا إله واحد ، فلزال إنكارهم دعوة رسول الله صلى الله عليه وسلم إلى إبطال الشرك .وقوله : { وأن عسى أن يكون قد اقترب أجلهم } معطوف على { وما خلق الله من شيء }.و { أنْ } هذه هي أن المفتوحه الهمزة المشددة النون خففت ، فكان اسمها ضمير شأن مقدراً . وجملة : { عسى أن يكون } إلخ خبر ضمير الشأن .و { أن } التي بعد عسى مصدرية هي التي تزاد بعد عسى غالباً في الاستعمال .واسمُ { يكون } ضمير شأن أيضاً محذوف ، لأن ما بعد ( يكون ) غير صالح لأن يعتبر اسماً لكان ، والمعنى ألم ينظروا في توقع قرب أجلهم .وصيغ الكلامُ على هذا النظم؛ لإفادة تهويل الأمر عليهم وتخويفهم ، بجعل متعلق النظر من معنى الإخبار للدلالة على أنه أمر من شأنه أن يخْطر في النفوس ، وأن يتحدث به الناس ، وأنه قد صار حديثاً وخبراً فكأنه أمر مسلم مقرر .وهذا موقع ضمير الشان حيثما ورد ، ولذلك يسمى : ضميرَ القصة اعتداداً بأن جملة خبره قد صارت شيئاً مقرراً ومما يقصه الناس ويتحدثون به .ومعنى النظر في توقع اقتراب الأجل ، التخوفُ من ذلك .والأجل المضاف إلى ضمير المكذبين هو أجل الأمة لا أجل الأفراد ، لأن الكلام تهديد بأجل غير متعارف ، نبههم إلى التفكر في توقع حلول الاستئصال بهم وإهلاكهم كما هلك المكذبون من قبلهم ، لأنهم إذا تفكروا في أن صاحبهم ليس بمجنون حصل لهم العلم بأنه من العقلاء ، فما كان العاقل بالذي يُحدث لقومه حادثاً عظيماً مثل هذا ، ويحدث لنفسه عناء كهذا العناء لغير أمر عظيم جاء به ، وما كان ليدع الكذب على الناس ويكذب على الله ، وإذا نظروا في ملكوت السماوات والأرض وما خلق الله من شيء علموا أن الله الملك الأعظم ، وأنه خالق المخلوقات ، فأيقنوا بأنه الإله الواحد ، فآل ذلك إلى تصديق الرسول عليه الصلاة والسلام ، وإبطال معتقدهم تعدد الآلهة أو آل في أقل الاحتمالات إلى الشك في ذلك ، فلا جرم أن يفضي بهم إلى النظر في توقع مصير لهم مثل ما صار إليه المكذبون من قبلهم .ويجوز أن يكون المراد بالأجل مجيء الساعة ، وانقراض هذا العالم ، فهو أجلهم وأجل غيرهم من الناس فيكون تخويفاً من يوم الجزاء .ومن بديع نظم هذه الآيات : أنه لما أريد التبصر والتفكر في ثبوت الحقائق والنِّسب في نفس الأمر جيء مع فعلى القلب بصيغة القضية والخبر في قوله : { أولم يتفكروا ما بصاحبهم من جنة } \\[ الأعراف : 184 \\] وقوله : { وأن عسى أن يكون قد اقترب أجلهم } ولما أريد التبصر والتفكر في صفات الذات جعل فعل القلب متعلقاً بأسماء الذوات في قوله : { أولم ينظروا في ملكوت السماوات والأرض وما خلق الله من شيء }.ثم فرع على التهديد والوعيد توبيخهم والإنكارُ عليهم بطريقة الاستفهام التعجيبي المفيد للاستبعاد بقوله : { فبأي حديث بعده يؤمنون } فهو تعجيب مشوب باستبعاد للإيمان بما أبلغ إليهم الله بلسان رسوله عليه الصلاة والسلام ، وما نصب لهم من الآيات في أصناف المخلوقات ، فإن ذلك كله قد بلغ منتهى البيان قولاً ودلالة بحيث لا مطمع أن يكون غيره أدل منه .و ( أي ) هنا اسم أُشربَ معنى الاستفهام ، وأصله اسم مبهم يفسره ما يضاف هو إليه ، وهو اسم لحصة متميزة عما يشاركها في نوع من جنس أو صفة ، فإذا أُشرب ( أي ) معنى الاستفهام ، كان للسؤال عن تعييننِ مشارك لغيره في الوصف المدلول عليه بما تضاف إليه ( أي ) طلباً لتعيينه ، فالمسؤول عنه بها مُساو لمماثل له معروف فقوله : { فبأي حديث } سؤال عن الحديث المجهول المماثل للحديث المعروف بين السائل والمسؤول وسيأتي الكلام على ( أي ) عند قوله تعالى : { فستبصر ويبصرون بأيكم المفتون } في سورة القلم ( 5 ، 6 ).والاستفهام هنا مستعمل في الإنكار ، أي لا يؤمنون بشيء من الحديث بعد هذا الحديث .وحقيقة الحديث أنه الخبر والقصة الحادثة { هل أتاك حديثُ ضيف إبراهيم } \\[ الذاريات : 24 \\] ويطلق مجازاً على الأمر الذي من شأنه أن يصير حديثاً وهو أعم من المعنى الحقيقي .ف«الحديث» هنا إن حُمل على حقيقته جاز أن يراد به القرآن ، كما في قوله تعالى : { فليأتوا بحديثثٍ مثله } \\[ الطور : 34 \\] فيكون الضمير في قوله : { بعده } بمعنى بعد القرآن ، أي بعدَ نزوله ، وجاز أن يراد به دعوى محمد صلى الله عليه وسلم الرسالة من عند الله ، وكلا الاحتمالين يناسب قوله : { أولم يتفكروا ما بصاحبهم من جنة } \\[ الأعراف : 184 \\].والباء في قوله : { فبأي حديث } على هذا باء التعدية لتعدية فعل { يؤمنون } ، وإن حمل على المجاز شمل القرآن وغيره من دلائل المصنوعات باعتبار أنها من شأنها أن يتحدث الناس بها كما في قوله : { فبأي حديثثٍ بعد الله وآياته يؤمنون } \\[ الجاثية : 6 \\] فيكون الضمير في قوله : { بعده } عائداً على معنى المذكور أي ما ذُكر من ملكوت السموات والأرض ، وما خلق الله من شيء ، وأن عسى أن يكون قد اقترب أجلهم ، وأفرد الضمير لتأويله بالمذكور كما في قوله تعالى : { وآتوا النساء صدقاتهن نحلةً فإن طبن لكم عن شيءٍ منه نفْساً } في سورة النساء ( 4 ) أي فبأي شيء يستدل عليهم غير ما ذكر بعدَ أن لم ينتفعوا بدلالة ما ذكر ، ولم يؤمنوا له فلا يرجى منهم إيمان بعد ذلك .والباء على هذا الوجه للسببية متعلقة بيؤمنون } و ( بَعد ) هنا مستعارة لمعنى غير ، لأن الظروف الدالة على المباعدة والمفارقة تستعمل استعمال المغاير قال تعالى : { فمن يهديه من بعد الله } \\[ الجاثية : 23 \\] وحمل ( بعد ) على حقيقتها هنا يحوج إلى تأويل ، ويخرج الكلام عن سواء السبيل .\n\n",
      "translations": [
        {
          "translation": "(Have they not considered) i.e. the people of Mecca (the dominion of the heavens) the sun, moon, stars and clouds (and the earth) and the dominion of the earth: the trees, mountains, oceans and beasts, (and what things Allah hath created) and all the things that Allah created, (and that it may be) 'may be' ['asa] when used in relation to Allah denotes a requisite (that their own term draweth nigh) their destruction draws near? (In what fact after this) in what Scripture after Allah's Scripture (will they believe) if they do not believe in 179 this Scripture?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلأَرْضِ } وما عليها من تلالها ووهادها\n وأنهارها وبحارها\n ورياضها وأزهارها\n وغرائبها وبدائعها المكنونة والمتكونة فيها\n بل { وَ } في جميع { مَا خَلَقَ ٱللَّهُ } وأظهره من كتم العدم إظهاراً إبداعياً { مِن شَيْءٍ } أي: مما يطلق عليه اسم الشيء\n تدهق وتتحير في ظهور فحول العقلاء إلى حيث لم يفهموا كيفية ظهور ذرة صغيرة من ذرائر العالم\n فيكف لميتها\n لذلك قال صلى الله عليه وسلم دعائه:\n \" الله أرنا الأشياء كما هي \" \n\n وقال أيضاً صلى الله عليه وسلم:\n \" رب زدني تحيراً \"\n \n \nهذا في الآفاق الخارجة عنهم { وَ } أمَّا في أنفسهم فلم ينظروا { أَنْ عَسَىۤ أَن يَكُونَ قَدِ ٱقْتَرَبَ أَجَلُهُمْ } المقدر المسمى لهم\n وهم لا يفهمونه\n وإن اجتمع جميع العقلاء في تعيين أجل شخص واحد\n ومع قصور نظرهم وسخافة عقلهم ينسبون الجنون إلى المكاشفين المناظرين بنور الله\n المطالعين المشاهدين دائماً صفاء وجهه الكريم\n وهم الذين انخلعوا عن لوازم البشرية مطلقاً\n وشقوا جلباب الناسوت رأساً\n وخرقوا الحجب المسدولة بالكلية وصاروا ما صاروا\n لا إله إلا هو\n كل شيء هالك إلا وجهه\n وبعدما سقط العقل عن درجة الاعتبار\n واضمحل مدركاته عن الاعتماد فلا تعويل إلا على الوحي والإلهام الملقى من عند العليم العلام { فَبِأَيِّ حَدِيثٍ } من الأحاديث المهمة والموحى به { بَعْدَهُ } أي: بعد نزول القرآن { يُؤْمِنُونَ } [الأعراف: 185] أي: المؤمنون المصدقون بالوحي والإلهام\n\nوبالجملة: { مَن يُضْلِلِ ٱللَّهُ } الهادي إلى سبيل الرشاد { فَلاَ هَادِيَ لَهُ } يرشده فعليك ألاَّ تجتهد يا أكمل الرسل في إهدائهم\n ولا تصغي أيضاً إلى أباطيلهم\n إذ أمرهم مفوض إلى الله { وَ } كيف تجتهد وتسعى في إيمانهم\n إذ هم قوم { يَذَرُهُمْ } ويتركهم الله باسمه المضل المذل { فِي طُغْيَانِهِمْ } المتجاوز عن الحد { يَعْمَهُونَ } [الأعراف: 186] يترددون وتحيرون إلى أن يأخذهم بما يأخذهم\n دعهم وأباطيلهم فيها يترددون وفي سكراتهم يعمهون",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { وما خلق }: عطف على { ملكوت } \n و { أن عسى }: مخففة\n و { أن يكون }: مصدرية\n أو عطف على { ملكوت } أيضًا\n يقول الحقّ جلّ جلاله: { أوَ لم يتفكروا } في أمر محمد صلى الله عليه وسلم حتى يتحققوا أنه { ما بصاحبهم من جِنَّة } يعني: نبينا محمدًا صلى الله عليه وسلم\n رُوِي أنه صلى الله عليه وسلم لما أُمر بالإنذار صعد الصَّفا\n فدعاهم\n فَخْذًا فخذًا\n يُحذّرهم بأس الله تعالى\n فقال قائلهم: إن صاحبكم لمجنون\n بات يُصوِّت إلى الصباح\n فنزلت\n { إن هو إِلا نذير مبين } أي: بيّن الإنذار واضح أمره\n لا يخفى على ناظر\n { أو لم ينظروا } نظر استدلال { في ملكوت السماوات والأرض } أي: في عظمتهما وما اشتملتا عليه من العجائب\n { وما خَلَق الله من شيء } أي: وينظروا فيما خلق الله من شيء من الأجناس التي لا يمكن حصرها\n لتدلهم على كمال قدرة صانعها ووحدة مبدعها\n وعظم شأن مالكها ومتولي أمرها\n ليظهر لهم صحة ما يدعوهم إليه\n { وأن عسى أن يكون قد اقترب أجلُهم } أي: أوَ لم ينظروا أيضًا في اقتراب أجلهم وتوقع حلول الموت بهم\n فيسارعوا إلى طلب الحق\n والتوجه إلى ما ينجيهم من عذابه\n قبل مفاجأة الموت ونزول العذاب\n { فبأي حديث بعده } أي: بعد القرآن\n { يُؤمنون } إن لم يؤمنوا به\n وهو النهاية في البيان؟ كأنه إخبار عنهم بالطبع على القلوب والتصميم على الكفر\n بعد إلزام الحجة والإرشاد إلى النظر\n وقيل: هو متعلق بقوله: { وأن عسى أن يكون قد اقترب أجلُهم } كأنه قيل: لعل أجلهم قد اقترب\n فما لهم لا يُبادرون بالإيمان بالقرآن\n وماذا ينتظرون بعد وضوحه؟ وإن لم يؤمنوا به فبأي حديث أحق منه يريدون أن يؤمنوا به؟!\n\n قاله البيضاوي\n ثم بيَّن أن أمرهم بيده\n فقال: { من يُضلل الله فلا هاديَ له } أصلاً\n ولا يقدر أحد عليه\n { ونذرهم في طُغيانهم يعمهون }: يتحيرون",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "77:50",
      "similarity": 0.4075967973842899
    },
    {
      "verse": "45:6",
      "similarity": 0.3702107255803145
    },
    {
      "verse": "7:129",
      "similarity": 0.36102584164949353
    },
    {
      "verse": "18:24",
      "similarity": 0.35341428613498327
    },
    {
      "verse": "4:99",
      "similarity": 0.3515582573907701
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007185.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007185.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:185.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}