{
  "chapter": "الأعراف",
  "text": "قل لا املك لنفسى نفعا ولا ضرا الا ما شاء الله ولو كنت اعلم الغيب لاستكثرت من الخير وما مسنى السوء ان انا۠ الا نذير وبشير لقوم يؤمنون",
  "translations": [
    {
      "translation": "Say: 'I possess no power to help or harm myself, except as Allah wills. If I had had knowledge of the Unseen, I would have sought to gain much good and no evil would have touched me. I am only a warner and a bringer of good news to people who have iman.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"I am not master of my own gain or loss but as God may please. If I had the knowledge of the Unknown I would have enjoyed abundance of the good, and no evil would have touched me. I am only a bearer of warnings and bringer of happy news for those who believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them [O Muhammad]: 'I have no power to benefit or harm myself except as Allah may please. And had I knowledge of the unseen, I should have amassed all kinds of good, and no evil would have ever touched me. I am merely a warner and the herald of glad tidings to those who have faith.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), say, \"I have no control over my benefits or sufferings, without the will of God. Had I known about the unseen, I would have gained much good and would have faced no suffering. I am only a warner and I preach the glad news to the believing people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I have no autonomy to benefit or hurt myself, except what Allah wills; and were I to procure knowledge of the hidden on my own, it would be that I had accumulated a lot of good; and no misfortune would touch me; I am purely a Herald of Warning and Glad Tidings to the people who believe.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I possess no power over benefit or harm to myself except as Allah wills. If I had the knowledge of the Ghayb (Unseen), I should have secured for myself an abundance of wealth, and no evil should have touched me. I am but a warner, and a bringer of glad tidings unto people who believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: I do not control any benefit or harm for my own soul except as Allah please; and had I known the unseen I would have had much of good and no evil would have touched me; I am nothing but a warner and the giver of good news to a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I have no power to profit for myself; or hurt, but as God will. Had I knowledge of the Unseen I would have acquired much good, and evil would not have touched me. I am only a warner, and a bearer of good tidings, to a people believing.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: For myself I have no power to benefit, nor power to hurt, save that which Allah willeth. Had I knowledge of the Unseen, I should have abundance of wealth, and adversity would not touch me. I am but a warner, and a bearer of good tidings unto folk who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I myself have no power to benefit or do harm, save as God pleases. If I had knowledge of the unseen, I would have availed myself of an abundance of good, and no harm would have touched me. I am but a warner and a bearer of good tidings for those who will believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: I possess no power over benefit or hurt to myself save as Allah willeth; and had I knowledge of the unseen I would have amassed ample good, and evil would not have touched me. I am naught but a warner and a bringer of tidings unto a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘I have no control over any benefit for myself, nor [over] any harm except what Allah may wish. Had I known the Unseen, I would have acquired much good, and no ill would have befallen me. I am only a warner and bearer of good news to a people who have faith.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"I have no power over any good or harm to myself except as Allah willeth. If I had knowledge of the unseen, I should have multiplied all good, and no evil should have touched me: I am but a warner, and a bringer of glad tidings to those who have faith.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"I possess no power of benefit or hurt to myself except as Allah wills. If I had the knowledge of the Ghaib (unseen), I should have secured for myself an abundance of wealth, and no evil should have touched me. I am but a warner, and a bringer of glad tidings unto people who believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'I do not have the power to acquire benefits or to avert harm from myself, except by the Will of Allah. Had I possessed knowledge of the unseen, I would have availed myself of much that is good, and no harm would have touched me. But I am only a warner and a bearer of glad tidings for a nation who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “I have no control over any benefit or harm to myself, except as God wills. Had I known the future, I would have acquired much good, and no harm would have touched me. I am only a warner, and a herald of good news to a people who believe.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"I hold not for myself [the power of] benefit or harm, except what Allah has willed. And if I knew the unseen, I could have acquired much wealth, and no harm would have touched me. I am not except a warner and a bringer of good tidings to a people who believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:188] Say: ‘I have no power to bring benefit, to attract it to, myself, or hurt, to repel it, except as God wills. Had I knowledge of the Unseen — that which is hidden from me, I would have acquired much good, and adversity, in the way of impoverishment and otherwise, would not touch me, since I would take precautions against such [adversity] by avoiding what is harmful. I am but a warner, to disbelievers, of the Fire, and a bearer of good tidings, of Paradise, to a people who believe’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad, to the people of Mecca: (For myself I have no power to benefit) to bring benefit, (nor power to hurt) to drive away harm, (save that which Allah willeth) to do with me of benefit or harm. (Had I knowledge of the Unseen) benefit and harm, (I should have abundance of wealth) of benefit, (and adversity) harm (would not touch me) it is also said that this means: if I knew when punishment would descend upon you, I would do good in abundance out of gratitude and no grief or sadness for you would touch me because of it; it is also said that this means: If I knew when I was to die, I would do good and perform righteous works in abundance and hardship would not touch me; it is also said that this means: If I knew the timing of droughts, lack of harvest and of rises in prices, I would amass good in abundance and hardship would not touch me. (I am but a warner) of the Fire, (and a bearer of good tidings) of Paradise (unto folk who believe) in Paradise and hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ولا أعلم الغيب إلا ما أوحى الله إليَّ { وَلَوْ كُنتُ أَعْلَمُ ٱلْغَيْبَ } يعني: لو تعلق علمي بعواقب أموري { لاَسْتَكْثَرْتُ مِنَ ٱلْخَيْرِ وَ } صرت إلى حيث { مَا مَسَّنِيَ ٱلسُّوۤءُ } أصلاً { إِنْ أَنَاْ } أي: بل ما أنا { إِلاَّ نَذِيرٌ } أنذر بإذن ربي وعلى مقتضى وحيه إياي { وَبَشِيرٌ } أيضاً أبشر على مقتضى الوحي { لِّقَوْمٍ يُؤْمِنُونَ } [الأعراف: 188] بوحي الله وإلهامه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "5:76",
      "similarity": 0.45849085244358906
    },
    {
      "verse": "20:89",
      "similarity": 0.4358903535230009
    },
    {
      "verse": "21:66",
      "similarity": 0.4311849972616211
    },
    {
      "verse": "26:73",
      "similarity": 0.40402561262921055
    },
    {
      "verse": "22:12",
      "similarity": 0.3891676512261081
    }
  ]
}