{
  "chapter": "الأعراف",
  "text": "ولله الاسماء الحسنى فادعوه بها وذروا۟ الذين يلحدون فى اسمئه سيجزون ما كانوا۟ يعملون",
  "translations": [
    {
      "translation": "To Allah belong the Most Beautiful Names, so call on Him by them and abandon those who desecrate His Names. They will be repaid for what they did.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All the names of God are beautiful, so call Him by them; and leave those alone who act profanely towards His names: They will be retributed for their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah has the most excellent names. So call on Him by His names and shun those who distort them. They shall soon be requited for their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has the most blessed Names. You should address Him in your worship by these Names and keep away from those who pervert them. They will be recompensed for their (evil) deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for Allah only are the best names, so invoke Him by them; and abandon those who depart from the truth regarding His names; they will soon receive the reward of their deeds.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (all) the Most Beautiful Names belong to Allah, so call on Him by them, and leave the company of those who belie His Names. They will be requited for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And Allah's are the best names, therefore call on Him thereby, and leave alone those who violate the sanctity of His names; they shall be recompensed for what they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belong the Names Most Beautiful; so call Him by them, and leave those who blaspheme His Names -- they shall assuredly be recompensed for the things they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah's are the fairest names. Invoke Him by them. And leave the company of those who blaspheme His names. They will be requited what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God has the Most Excellent Names. Call on Him by His Names and keep away from those who distort them. They shall be requited for what they do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah's are the excellent names; so call on Him thereby; and leave alone those who profane His names. Anon will they be requitcd for that which they were wont to work.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belong the Best Names, so supplicate Him by them, and abandon those who commit sacrilege in His names. Soon they shall be requited for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The most beautiful names belong to Allah: so call on him by them; but shun such men as use profanity in his names: for what they do, they will soon be requited.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (all) the Most Beautiful Names belong to Allah, so call on Him by them, and leave the company of those who belie or deny (or utter impious speech against) His Names. They will be requited for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Allah belongs the Finest Names, so call Him by them, and keep away from those who pervert them. They shall be recompensed for the things they did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To God belong the Most Beautiful Names, so call Him by them, and disregard those who blaspheme His names. They will be repaid for what they used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And to Allah belong the best names, so invoke Him by them. And leave [the company of] those who practice deviation concerning His names. They will be recompensed for what they have been doing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:180] And to God belong the, ninety nine, Most Beautiful Names — mentioned in hadīth — (al-husnā is the feminine for al-ahsan) so invoke, name, Him by them, and leave those who blaspheme His Names (yulhidūn, ‘they blaspheme’, from [fourth form] alhada or [first form] lahada, meaning ‘those who incline away from the truth’), by deriving from them names for their gods, as in the case of al-Lāt, from Allāh (‘God’), al-‘Uzzā, from al-‘Azīz (‘Mighty’), and Manāt, from al-Mannān (‘Lord of Favours’). They will be requited, in the Hereafter, the requital, for what they did — this was [revealed] before the command to fight [them].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Allah's are the fairest names) the loftiest attributes: knowledge, power, hearing, sight, and the like. (Invoke Him by them) recite by them. (And leave the company of those who blaspheme His names) those who deny His names and attributes; and according to a different reading this means: those who are disinclined to acknowledge His names; and it is also said that this means: those who liken His names to al-Lat, al-'Uzza, and Manat. (They will be requited) in the Hereafter for (what they do) and say in the life of this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَذَرُواْ ٱلَّذِينَ يُلْحِدُونَ فِيۤ أَسْمَآئِهِ } معناهُ اترُكُوا المُلحِدينَ\n وهُمْ الحَائِرونَ فِي الحَقِّ الّذِينَ لاَ يستقيمونَ للواجِبِ عَلَيهِمْ\n\n\n\n\nوقوله تعالى: { وَللَّهِ ٱلأَسْمَآءُ ٱلْحُسْنَىٰ فَٱدْعُوهُ بِهَا } معناهُ فَلَهُ تِسعةٌ وتِسعونَ اسماً قَدْ أَمَرَ أَن يُدْعى بِهَا\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {And leave those who take other than His name} [means] leave the polytheists.\n\n\nAnd they are those who are in doubt about the truth, who do not follow the right path.\n\nAnd His saying - the Most High: {And to Allah belong the most beautiful names, so call on Him by them} His meaning - He has ninety-nine names that He has ordered to be called by them.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلموا أيها الفضلاء العرفاء، الموحدون أن { للَّهِ } المتوحد المتفرد في ذاته { ٱلأَسْمَآءُ ٱلْحُسْنَىٰ } التي تترتب عليها الصفات العليا، المترتبة عليها الآثار الحادثة في عالم الكون والفساد، والشهادة والغيب، والنشأة الأولى والأخرى { فَٱدْعُوهُ } سبحانه أيها الموحدون { بِهَا } وأسندوا الحوادث الكائنة إليها أولاً وبالذات { وَذَرُواْ } أي: دعوا واتركوا أقوال { ٱلَّذِينَ يُلْحِدُونَ } يميلون ويشركون { فِيۤ أَسْمَآئِهِ } بنسبة الحوادث إلى الأسباب أولاً وباللذات، واهجروا مذاهبهم، واعتزلوا عنه وعن مجالستهم، واعلموا أن كل أحد { سَيُجْزَوْنَ } على مقتضى { مَا كَانُواْ يَعْمَلُونَ } [الأعراف: 180] إن خيراً فخير وإن شراً فشر\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ولله الأسماءُ الحسنى } تسعة وتسعين، { فادعوه بها } أي: سموه بها\n قال ابن جزي: أي: سموه بأسمائه، وهذا إباحة لإطلاق الأسماء على الله سبحانه، فأما ما ورد منها في القرآن والحديث فيجوز إطلاقه على الله إجماعًا، وأما ما لم يرد، وفيه مدح ولا تتعلق به شُبهة، فأجاز أبو بكر بن الطيب إطلاقه على الله، ومنع ذلك أبو الحسن الأشعري وغيره، ورأوا أن أسماء الله تعالى موقوفة على ما ورد في القرآن والحديث\n وقد ورد في حديث الترمذي عدتها، أعني: تعيين التسعة والتسعين\n واختلفت أهل الحديث: هل هي مرفوعة أو موقوفة على أبي هريرة؟ والذي في الصحيح:\n\n \" إنَّ للهِ تِسعَةً وتِسعِينَ اسمًا، مائَةً إلاَ وَاحِدًا، مَن أحصَاهَا دَخَلَ الجَنَّةَ \" \n\nوهل الإحصاء بالحفظ أو بالعلم أو بالتخلق أو بالتعلق أو بالتحقق؟ أقوال\n قلت: كونها موقوفة بعيد جدًا إذ ليس هذا مما يقال بالرأي\n وسبب نزول الآية: إن أبا جهل سمع بعض الصحابة يقرأ، فيذكر الله مرة، والرحمن أخرى، فقال: يزعم محمد أن الإله واحد، وها هو يعبد آلهة كثيرة، فنزلت الآية مُبيِّنة أن تلك الأسماء الكثيرة هي لمسمى واحد، { الحسنى }: مصدر وُصف به، أو تأنيث أحسن، وحسن أسماء الله هي أنها صفة مدح وتعظيم وتحميد، وقيل: الدعاء بها: التوسل بكل واحد منها\n قال تعالى: { وذَرُوا } أي: اتركوا { الذين يُلحدون } أي: يميلون { في أسمائه } عن الكمال إما بتعطيلها، أو إنكار شيء منها، وإما بزيادة فيها، مما يوهم نقصًا أو فسادًا\n قال القشيري: الإلحاد: هو الميل عن القصد، وذلك على وجهين: بالزيادة والنقصان فأهل التمثيل زادوا فألحدوا، وأهل التعطيل نقصوا فألحدوا\n هـ\n قال البيضاوي: أي: اتركوا تسمية الزائغين فيها، الذين يسمونه بما لا توقيف فيه، إذ ربما يوهم معنىً فاسدًا، كقولهم: يا أبا المكارم، يا أبيض الوجه، أو لا تبالُوا بإنكارهم ما سمى به نفسه، كقولهم ما نعرف إلا رحمان اليمامة، أو: وذروهم وإلحادهم فيها بإطلاقها على الأصنام، واشتقاقها منه كاللات من الله، والعزى من العزيز، فلا توافقوهم عليه، أو أعرضوا عنهم ولا تحاوروهم\n هـ\n قال ابن جزي: قيل: معنى { ذروا }: اتركوهم فلا تجادلوهم ولا تتعرضوا لهم، فالآية، على هذا، منسوخة بالقتال، وقيل: معنى { ذروا } للوعيد والتهديد، كقوله:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:40",
      "similarity": 0.713040514345409
    },
    {
      "verse": "18:27",
      "similarity": 0.6680780198336587
    },
    {
      "verse": "72:22",
      "similarity": 0.6217329845065389
    },
    {
      "verse": "22:25",
      "similarity": 0.5062667468295818
    },
    {
      "verse": "16:103",
      "similarity": 0.40093004942248855
    }
  ]
}