{
  "chapter": "الأعراف",
  "text": "اولم يتفكروا۟ ما بصاحبهم من جنة ان هو الا نذير مبين",
  "translations": [
    {
      "translation": "Have they not bethought themselves their companion is not mad? He is only a plain admonisher.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not pondered that their companion [i.e. the Prophet Muhammad] is not afflicted with insanity? He is only a plain warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Why will they not understand that their companion (Muhammad) is not possessed by jinn. (Muhammad) is only a (Divinely) authorized preacher.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not ponder that their companion is far removed from insanity? In fact he is clearly a Herald of Warning.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not reflect There is no madness in their companion. He is but a plain warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not reflect that their companion has not unsoundness in mind; he is only a plain warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not reflected? No madness is in their comrade; he is naught but a plain warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not bethought them (that) there is no madness in their comrade? He is but a plain warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not reflected that their companion is not mad? He is only a plain warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Reflect they not that in their companions there is no madness! he is naught but a manifest warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not reflected that there is no madness in their companion, [and that] he is just a manifest warner?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not reflect? Their companion is not seized with madness: he is but a perspicuous warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not reflect? There is no madness in their companion (Muhammad SAW). He is but a plain warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have they not reflected? There is no madness in their companion, he is but a plain warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Do they not think? There is no madness in their friend. He is but a plain warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then do they not give thought? There is in their companion [Muhammad] no madness. He is not but a clear warner.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:184] Have they not considered, and so realised that, that there is no madness in their comrade, Muhammad (s)? He is but a clear warner, one whose warning is evident.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Have they not bethought them) among themselves that Muhammad (pbuh) was not a sorcerer, soothsayer or a madman. Then Allah, Exalted is He, said: ((that) there is no madness) there is no touch of madness whatsoever (in their comrade) in their Prophet? (He is but a plain warner) and Messenger who explains to them in a language they understand.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { مَا بِصَاحِبِهِمْ مِّن جِنَّةٍ } معناهُ من جنونٍ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ أشار سبحانه إلى توبيخ المسرفين المسفهين لرسول الله صلى الله عليه وسلم عناداً ومكابرةً فقال: أما تستحيون من الله أولئك المسرفون، المفرطون في نسبته الجنون إلى من فاق على جميع العقلاء بالرشد والهداية؟ { أَوَلَمْ يَتَفَكَّرُواْ } ويتدبروا أنه { مَا بِصَاحِبِهِمْ مِّن جِنَّةٍ } خفة عقل موجب للخيط، وما لم يفهموا من كلامه إلى أن صدر عنهم هفوة لا عن قصد، ويسمونه مجنوناً لذلك { إِنْ هُوَ } أي: بل ما هو صلى الله عليه وسلم عند التحقيق { إِلاَّ نَذِيرٌ } ينذرهم بإذن الله ووحيه، ويخوفهم بما يخوفهم الله به { مُّبِينٌ } [الأعراف: 184] عظيم الشأن، ظاهر في أمر الإنذار\n\n\n\n\nرُوي أنه صلى الله عليه وسلم صعد الصفا يوماً فدعاهم فخذاً فخذاً، يحذرهم عن بأس الله بطشه فقال قائلهم: إن صاحبكم لمجنون، فزلت\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}