{
  "chapter": "الأعراف",
  "text": "فلما ءاتىهما صلحا جعلا له شركاء فيما ءاتىهما فتعلى الله عما يشركون",
  "translations": [
    {
      "translation": "Then when He granted them a healthy, upright child, they associated what He had given them with Him. But Allah is far above what they associate with Him!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when they were given a healthy son, they started ascribing to other powers a share in what God had bestowed on them. But God is above what they ascribe to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He vouchsafes them a healthy child, they attribute to Him partners regarding what Allah had bestowed upon them. Subliminally exalted is Allah above that which they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they were given a healthy son, they began to love him as much as they loved God. God is too exalted to be loved equally to anything else.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when He bestowed them a normal child, they ascribed partners (to Him) in respect of what He had bestowed upon them; therefore Supreme is Allah, above all that they ascribe as partners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He gave them a Salih child, they ascribed partners to Him (Allah) in that which He has given to them. High be Allah, Exalted above all that they ascribe as partners to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He gives them a good one, they set up with Him associates in what He has given them; but high is Allah above what they associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thereafter, when He gave them a righteous son, they assigned Him associates in that He had given them; but God is high exalted above that they associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He gave unto them aright, they ascribed unto Him partners in respect of that which He had given them. High is He Exalted above all that they associate (with Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "yet when He grants them a healthy child, they begin to ascribe to others a share in the gift they have received. But God is far above what they associate with Him!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He vouchsafeth the twain a goodly child they set up unto Him associates in respect of that which He hath vouchsafed to them. Exalted be Allah far from that which they associate!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then when He gave them a healthy [child], they ascribed partners to Him in what He had given them. Exalted is Allah above [having] any partners that they ascribe [to Him]!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He giveth them a goodly child, they ascribe to others a share in the gift they have received: but Allah is exalted high above the partners they ascribe to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He gave them a Salih (good in every aspect) child, they ascribed partners to Him (Allah) in that which He has given to them. High be Allah, Exalted above all that they ascribe as partners to Him. (Tafsir At-Tabari, Vol. 9, Page 148).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Yet when He gave both of them (the parents) a goodly child, they set up associates with Him, in return for what He had given them. Exalted be Allah above that they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He has given them a good child, they attribute partners to Him in what He has given them. God is exalted above what they associate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But when He gives them a good [child], they ascribe partners to Him concerning that which He has given them. Exalted is Allah above what they associate with Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:190] But when He gave them a sound one, [a sound] child, they ascribed to Him associates (shurakā’a: a variant reading has shirkan, meaning sharīkan, ‘an associate’) in that which He had given them, by naming it ‘Abd al-Hārith, ‘servant of al-Hārith’, when it is not right to be a ‘servant’ (‘abd) of any one but ‘God’ [sc. ‘Abd Allāh], but this [namesake ‘Abd] is not an association [of another with God] in terms of servitude, for Adam was immune [from a sin such as associating others in worship with God]. Samura [b. Jundub] reported that the Prophet (s) said, ‘On one occasion when Eve gave birth — all the children she bore had failed to survive — Satan visited her and said [to her], “Name it [the child] ‘Abd al-Hārith, and it will live.” She named it so and it lived. This [affair] was the result of Satan’s inspiration and his doings’: reported by al-Hākim, who deemed it [the report] ‘sound’ (sahīh), and [also reported] by al-Tirmidhī, who considered it ‘fair-uncommon’ (hasan gharīb); but exalted is God above what they, the people of Mecca, associate, in the way of idols (this sentence is consequent, a supplement to [the one beginning with] khalaqakum, ‘He created you’, so that what comes between the two is a parenthetical statement).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But when He gave unto them aright) a sound human being, (they ascribed unto Him partners) they made Iblis a partner (about that which He had given them) in naming that which he had given them of offspring: they called him 'Abdullah and 'Abd al-Harth. (High is He exalted above) Allah absolves Himself from (all that they associate (with Him)) of idols.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَلَمَّآ آتَاهُمَا صَالِحاً } بعد صالح، وطالحاً بعد طالح، بطناً بعد بطن { جَعَلاَ } موضع الشكر { لَهُ شُرَكَآءَ } بإغواء الشيطان إياهما { فِيمَآ آتَاهُمَا } من الأولاد فسمياهم بعبد الحارث وعبد العزى، وعبد المناة، بتعليم الشيطان إياهما { فَتَعَالَى ٱللَّهُ } المنزه بذاته عن الشريك مطلقاً، سيما { عَمَّا يُشْرِكُونَ } [الأعراف: 190] هما وغيرهما من المشركين\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n والثاني: أنَّ جمع الضمير في قوله: { فتعالى الله عما يشركون } ، يقتضي أن الشرك وقع من أولادهما، لا منهما\n الثالث: أن هذه القصة تفتقر إلى نقل صحيح، وهو غير موجود\n انظر: ابن جزي\n الإشارة: قال الورتجبي: في قوله { ليسكن إليها }: لم يجد آدم عليه السلام في الجنة إلا سنًا تجلى الحق، فكاد أن يضمحل بنور التجلي، لتراكمه عليه، فعلم الله ـ سبحانه ـ أنه لا يتحمل أثقال التجلي، وعرف أنه يذوب في نور حسنه، وكل ما في الجنة مستغرق في ذلك النور، فيزيد عليه ضوء الجبروت والملكوت، فخلق منه حواء ليسكن آدم إليها، ويستوحش بها سُوَيعات من سطوات التجلي، ولذلك قال صلى الله عليه وسلم لعائشة ـ رضي الله عنها ـ:\n\n \" كلميني يا حُميراء \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "16:3",
      "similarity": 0.5895349162093823
    },
    {
      "verse": "28:68",
      "similarity": 0.5297069902999714
    },
    {
      "verse": "23:92",
      "similarity": 0.5203294474094147
    },
    {
      "verse": "16:1",
      "similarity": 0.49535255029397274
    },
    {
      "verse": "79:24",
      "similarity": 0.49192892849421915
    }
  ]
}