{
  "chapter": "الأعراف",
  "text": "ان ولى الله الذى نزل الكتب وهو يتولى الصلحين",
  "translations": [
    {
      "translation": "My Protector is Allah who sent down the Book. He takes care of the righteous.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My saviour is God who has revealed this Book; and He protects those who are upright;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My guardian is Allah Who has revealed the Book, and it is He Who protects the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The (true) Guardian is certainly God who has revealed the Book and is the Guardian of the righteous ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Indeed my Protector is Allah Who has sent down the Book; and He befriends the righteous.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, my protector is Allah Who has revealed the Book (the Qur'an), and He protects the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely my guardian is Allah, Who revealed the Book, and He befriends the good.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Protector is God who sent down the Book, and He takes into His protection the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! my Protecting Friend is Allah Who revealeth the Scripture. He befriendeth the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My protector is God who sent down the Book, for it is He who protects the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily my protector is Allah who hath revealed the Book, and He protecteth the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My guardian is indeed Allah who sent down the Book, and He takes care of the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For my Protector is Allah, Who revealed the Book (from time to time), and He will choose and befriend the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, my Wali (Protector, Supporter, and Helper, etc.) is Allah Who has revealed the Book (the Quran), and He protects (supports and helps) the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "My Guardian is Allah, who has sent down the Book. He guards the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“My Master is God, He Who sent down the Book, and He takes care of the righteous.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, my protector is Allah, who has sent down the Book; and He is an ally to the righteous.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:196] Truly my Protector, the One in charge of my affairs, is God Who reveals the Book, the Qur’ān, and He takes charge of the righteous, by protecting them.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! my Protecting Friend is Allah) my Protector and Helper is Allah (who revealeth the Scripture) Who sent Gabriel to me with the Scripture. (He befriendeth the righteous) He protects the righteous.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ وَلِيِّـيَ } وحافظي، ومولي جميع أموري { ٱللَّهُ } القادر القيوم { ٱلَّذِي نَزَّلَ ٱلْكِتَابَ } أي: القرآن؛ لنصري وتأييدي { وَ } من غاية لطفه { هُوَ } سبحانه بنفسه { يَتَوَلَّى ٱلصَّالِحِينَ } [الأعراف: 196] من عباده ويحفظهم من مكر المكارين، سيما الأنبياء الذين هم في كنف جواره وحوزة حفظه، يحفظهم عن جميع ما يؤذيهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}