{
  "chapter": "الأعراف",
  "text": "ويـادم اسكن انت وزوجك الجنة فكلا من حيث شئتما ولا تقربا هذه الشجرة فتكونا من الظلمين",
  "translations": [
    {
      "translation": "'Adam, live in the Garden, you and your wife, and eat of it wherever you like. But do not go near this tree lest you become wrongdoers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you, O Adam, and your spouse, live in the Garden and eat your fill wheresoever you like, but do not approach this tree, or you will become iniquitous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Adam! Live you and your spouse in the Garden and both of you eat from it wherever you will, but never approach the tree or you shall become wrongdoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Lord said, \"Adam, stay in the garden with your spouse and eat whatever you want therein, but do not go near this tree lest you transgress\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said, “O Adam! You and your wife dwell in Paradise – therefore eat from it from wherever you wish, and do not approach this tree for you will become of those who transgress.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O Adam! Dwell you and your wife in Paradise, and eat thereof as you both wish, but approach not this tree otherwise you both will be of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (We said): O Adam! Dwell you and your wife in the garden; so eat from where you desire, but do not go near this tree, for then you will be of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Adam, inherit, thou and thy wife, the Garden, and eat of where you will, but come not nigh this tree, lest you be of the evildoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (unto man): O Adam! Dwell thou and thy wife in the Garden and eat from whence ye will, but come not nigh this tree lest ye become wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Adam He said, \"You and your wife, dwell in the Garden and eat and drink there from wherever you wish, but do not approach this tree, lest you become wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And: O Adam: dwell thou and thy spouse in the Garden and eat ye twain thereof Whence ye will, and approach not yonder tree lest ye twain become of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Then He said to Adam,] ‘O Adam, dwell with your mate in paradise, and eat thereof whence you wish; but do not approach this tree, lest you should be among the wrongdoers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Adam! dwell thou and thy wife in the Garden, and enjoy (its good things) as ye wish: but approach not this tree, or ye run into harm and transgression.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O Adam! Dwell you and your wife in Paradise, and eat thereof as you both wish, but approach not this tree otherwise you both will be of the Zalimun (unjust and wrong-doers).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Adam dwell with your wife in Paradise, and eat from whatever you please; but never approach this tree or you shall both become harmdoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you, Adam, inhabit the Garden, you and your wife, and eat whatever you wish; but do not approach this tree, lest you become sinners.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And \"O Adam, dwell, you and your wife, in Paradise and eat from wherever you will but do not approach this tree, lest you be among the wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:19] And, He said, ‘O Adam, dwell, you (anta: this is reiterated in order to emphasise the subject of the verb uskun, ‘dwell’, and to supplement to it [what follows]) and your wife, Eve (read Hawwā’), in the Garden, and eat from whence you will, but do not come near this tree, to eat of it — and this was wheat — lest you become evildoers’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nالواو من قوله : { ويا آدم } عاطفة على جملة : { أخرج منها مذءوماً مدحوراً } \\[ الأعراف : 18 \\] الآية ، فهذه الواوُ من المحكي لا من الحكاية ، فالنّداء والأمرُ من جملة المقول المحكي يقال : أي قال الله لإبليس اخرج منها وقال لآدم { ويا آدم اسكن } ، وهذا من عطف المتكلِّم بعض كلامه على بعض ، إذا كان لبعض كلامه اتّصال وتناسب مع بعضه الآخر ، ولم يكن أحدُ الكلامين موجّهاً إلى الذي وجّه إليه الكلام الآخَر ، مع اتّحاد مقام الكلام ، كما يفعل المتكلّم مع متعدِّدين في مجلس واحد فيُقبل على كل مخاطب منهم بكلام يخصه ومنه قول النبيّء صلى الله عليه وسلم في قضيّة الرّجل والأنصاري الذي كان ابنُ الرّجل عسيفاً عليه : « والذي نفسي بيده لأقضين بينكما بكتاب الله عزّ وجلّ أما الغنم والجارية فرَدٌ عليك وعلى ابنك جلدُ مائة وتغريب عام ، واغْدُ يا أنَيْسُ على زوجة هذا فإن اعترفت فارْجُمْها » ومن أسلوب هذه الآية ما في قوله تعالى : { قال إنه من كيدكن إن كيدكن عظيم يوسف أعْرِض عن هذا واستغفري لذنبك } \\[ يوسف : 28 ، 29 \\] حكاية لكلام العزيز ، أي العزيز عطفَ خطابّ امرأته على خطابه ليوسف .فليست الواو في قوله : { ويا آدم اسكن } بعاطفة على أفعال القَوْل التي قبلها حتّى يَكون تقدير الكلام : وقُلنا يا آدم اسكن ، لأنّ ذلك يفيت النّكت التي ذكرناها ، وذلك في حضرة واحدة كان فيها آدم والملائكة وإبليس حضوراً .وفي توجيه الخطاب لآدم بهذه الفضيلة بحضور إبليس بعد طرده زيادة إهانة ، لأنّ إعطاء النّعم لمرضي عليه في حين عقاب من استأهل العقاب زيادة حسرة على المعاقَب ، وإظهاراً للتّفاوت بين مستحقّ الإنعام ومستحقّ العقوبة فلا يفيد الكلام من المعاني ما أفاده العطف على المقول المحكي ، ولأنّه لو أريد ذلك لأعيد فعل القول . ثمّ إن كان آدم خُلق في الجنّة ، فكان مستقراً بها من قبل ، فالأمر في قوله : { اسكن } إنّما هو أمر تقرير : أي أبق في الحنّة ، وإن كان آدم قد خُلق خارج الجنّة فالأمر للإذن تكريماً له ، وأيّاً مّا كان ففي هذا الأمر ، بمسمع من إبليس ، مقمعة لإبليس ، لأنّه إن كان إبليس مستْقراً في الجنّة من قبل فالقمع ظاهر إذ أطرده الله وأسكن الذي تكبَّر هو عن السّجود إليه في المكان المشرّف الذي كان له قبل تكبّره ، وإن لم يكن إبليس ساكناً في الجنّة قبلُ فإكرام الذي احتقره وترفع عليه قمع له ، فقد دلّ موقع هذا الكلام ، في هذه السّورة ، على معنى عظيم من قمع إبليس ، زائد على ما في آية سورة البقرة ، وإن كانتا متماثلتين في اللّفظ ، ولكن هذا المعنى البديع استفيد من الموقع وهذا من بدائع إعجاز القرآن .ووجد إيثار هذه الآية بهذه الخصوصية إنّ هذا الكلام مسوق إلى المشركين الذين اتخذوا الشّيطان ولياً من دون الله ، فأمّا ما في سورة البقرة فإنّه لموعظة بني إسرائيل ، وهم ممّن يحذر الشّيطان ولا يتّبع خطواته .والنّداء للإقبال على آدم والتّنويهِ بذكره في ذلك الملا . والإتيانُ بالضّمير المنفصل بعد الأمر ، لقصد زيادة التّنكيل بإبليس لأن ذكر ضميره في مقام العطف يذكر غيره بأنّه ليس مثله ، إذ الضّمير وإن كان من قبيل اللقب وليس له مفهومُ مخالفةٍ فإنّه قد يفيد الاحتراز عن غير صاحب الضّمير بالقرينة على طريقة التعريض ولا يمنع من هذا الاعتبار في الضمير كون إظهاره لأجل تحسيننِ أو تصحيح العطف على الضّمير المرفوع المستتر ، لأن تصحيحَ أو تحسين العطف يحصل بكلّ فاصل بين الفعل الرافع للمستتر وبين المعطوف ، لا خصوص الضّمير ، كأن يقال : ويا آدم اسكن الجنّةَ وزوجُك ، فما اختير الفصل بالضّمير المنفصل إلاّ لما يفيد من التّعريض بغيره . وهذه نكتة فاتني العلم بها في آية سورة البقرة فضُمّها إليها أيضاً .والكلام على قوله : { اسكن أنت وزوجك الجنة فكلا من حيث شئتما ولا تقربا هذه الشجرة فتكونا من الظالمين } يعلم ممّا مضى من الكلام على نظيره من سورة البقرة .سوى أن الذي وقع في سورة البقرة ( 35 ) { وكلا } بالواو وهنا بالفاء ، والعطف بالواو أعم ، فالآية هنا أفادت أنّ الله تعالى أذن آدم بأن يتمتّع بثمار الجنّة عقب أمره بسكنى الجنّة . وتلك منّة عاجلة تؤذن بتمام الإكرام ، ولما كان ذلك حاصلاً في تلك الحضرة ، وكان فيه زيادة تنغيص لإبليس ، الذي تكبّر وفضل نفسه عليه ، كان الحال مقتضياً إعلام السّامعين به في المقام الذي حُكي فيه الغضب على إبليس وطردُه ، وأما آية البقرة فإنّما أفادت السّامعين أنّ الله امتن على آدم بمنّة سكنى الجنّة والتّمتّع بثمارها ، لأنّ المقام هنالك لتذكير بني إسرائيل بفضل آدم وبذنبه وتوبته ، والتّحذير من كيد الشّيطان ذلك الكيد الذي هم واقعون في شيء منه عظيم .على أنّ آية البقرة ( 35 ) لم تخل عن ذكر ما فيه تكرمة له وهو قوله : { رغداً } لأنه مدح للمُمْتن به أو دعاء لآدم ، فحصل من مجموع الآيتين عدة مكارم لآدم ، وقد وزعت على عادة القرآن في توزيع أغراض القصص على مواقعها ، ليحصل تجديد الفائدة ، تنشيطاً للسّامع ، وتفنّناً في أساليب الحكاية ، لأنّ الغرض الأهمّ من القصص في القرآن إنّما هو العبرة والموعظة والتأسي .وقوله : { ولا تقربا هذه الشجرة } أشدّ في التّحذير من أن يُنهى عن الأكل منها ، لأنّ النّهي عن قربانها سد لذريعة الأكل منها وقد تقدّم نظيره في سورة البقرة .والنّهي عن قربان شجرة خاصة من شجر الجنّة : يحتمل أن يكون نهي ابتلاء . جعل الله شجرة مستثناة من شجر الجنّة من الإذن بالأكل منها تهيئة للتكليف بمقاومة الشّهوة لامتثال النّهي .فلذلك جعل النّهي عن تناولها محفوفة بالأشجار المأذون فيها ليلتفت إليها ذهنهما بتركها ، وهذا هو الظّاهر ليتكّون مختلف القوى العقليّة في عقل النّوع بتأسيسها في أصل النّوع ، فتنتقل بعده إلى نسله ، وذلك من اللّطف الإلهي في تكوين النّوع ومن مظاهر حقيقة الربوبيّة والمربوبيّة ، حتى تحصل جميع القوى بالتدريج فلا يشقّ وضعها دفعة على قابليّة العقل ، وقد دلّت الآيات على أن آدم لمّا ظهر منه خاطر المخالفة أكل من الشّجرة المنهي عنها ، فأعقبه الأكلُ حدوث خاطر الشّعور بما فيه من نقايصَ أدركها بالفطرة ، فمعناه أنّه زالت منه البساطة والسّذاجة . ويحتمل أن يكون ذلك لِخصوصيّة في طبع تلك الشّجرة أن تثير في النّفس علم الخير والشرّ كما جاء في التّوراة أنّ الله نهاه عن أكل شجرة معرفة الخير والشرّ ، وهذا عندي بعيد ، وإنّما حكى الله لنا هيئة تطوّر العقل البشري في خلقة أصل النّوع البشري نظيرَ صنعه في قوله : { وعلّم آدم الأسماء كلّها } \\[ البقرة : 31 \\].والإشارة إلى شجرة مشاهدة وقد رويت روايات ضعيفة في تعيين نوعها وذلك ممّا تقدّم في سورة البقرة .وانتصب : { فتكونا } على جواب النّهي ، والكون من الظّالمين متسبّب على القرب المنهي عنه ، لا على النّهي ، وذلك هو الأصل في النّصب في جواب النّهي كجواب النّفي ، أن يعتبر التّسبّب على الفعل المنفي أو المنهي ، بخلاف الجزم في جواب النّهي فإنّه إنّما يجزم المسبَّب على إنشاء النّهي لا على الفعل المنهي ، والفرق بينهما : أنّ النّصب على اعتبار التسبب ، والتسبب ينشأ عن الفعل لا عن الإخبار والإنشاء بخلاف الجزم فإنه على اعتبار الجواب ، تشبيهاً بالشّرط ، فاعتبر فيه معنى إنشاء النّهي تشبيهاً للإنشاء بالاشتراط .والمراد ب { الظّالمين } الذين يحقّ عليهم وصف الظلم : إما لظلمهم أنفسهم وإلقائها في العواقب السيّئة ، وإمّا لاعتدائهم على حقّ غيرهم فإنّ العصيان ظلم لحقّ الربّ الواجب طاعته .\n\n",
      "translations": [
        {
          "translation": "(And (unto man): Adam! Dwell thou and thy wife) Eve (in the Garden and eat from whence) in Paradise (ye will) and whenever you will, (but come not nigh this tree) do not eat from this tree: the tree of knowledge (lest ye become wrong-doers) lest you become of those who harm themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ليبدي لهما ما وري عنهما من سوآتهما } أي: ليظهر عليهما بالميل إلى الطبيعة ما حجب عنهما عند التجرّد من الأمور الطبيعية واللذات البدنية والرذائل الخلقية والأفعال الحيوانية والصفات السبعية والبهيمية التي يستحيي الإنسان من إظهارها ويستهجن إفشاءها وتحمله المروءة على إخفائها لكونها عورات عند العقل يأنف منها ويستقبحها { وقال ما نهاكما ربكما عن هذه الشجرة إلا أن تكونا ملكين } أي: أوهمهما أن في الاتصال بالطبيعة الجسمانية والمادة الهيولانية لذات ملكية وإدراكات وأفعالاً وخلوداً فيها أو ملكاً ورياسة على القوى وسائر الحيوانات دائماً بغير زوال إن قرئ ملكين بكسر اللام كما قال:\n[طه\n الآية: 120]\n وزيّن لها من المصالح الجزئية والزخارف الحسيّة التي لا تنال إلا بالآلات البدنية في صورة الناصح الأمين\n  { فدلاهما } أي: فنزلهما إلى التعلق بها والسكون إليها بما غرّهما من التزيي بزي الناصحين وإفادة توهم دوام اللذات البدنية والرياسة الإنسية وسوّل لهما من المنافع البدنية والشهوات النفسية { وطفَقَا يَخْصِفان عليهما من ورق الجنة } أي: يكتمان الغواشي الطبيعية بالآداب الحسنة والعادات الجميلة التي هي من تفاريع الآراء العقلية ومستنبطات القوّة العاقلة العملية ويخفيانها بالحيل العلمية { وناداهما ربّهما ألم أنْهَكُما } صورة النهي هو ما ركز في العقول من الميل إلى التجرّد وإدراك المعقولات والتجافي عن المواد والمحسوسات وقوله لهما: { إن الشيطان لكما عدوّ مبين } ما ألهم العقل من منافات أحكام الوهم ومضادّة مدركاته والوقوف على مخالفاته ومكابراته إياه ونداؤه إياهما بذلك هو التنبيه على ذلك المعنى على سبيل الخاطر والتذكير له بعد التعلق والانغمار في اللذات الطبيعية عند البلوغ وظهور أنواع العقل والفهم عليهما\n وقولهما: { ربنا ظلمنا أنفسنا } هو لتنبه النفس الناطقة على نقصانها من جهة الطبيعة وانطفاء نورها وانكسار قوتها وحصول الداعي فيها على طلب الكمال بالتجرّد { وإن لم تغفر لنا } بإلباسنا الأنوار الروحانية وإفاضتها مشرقة علينا { وترحمنا } بإفاضة المعارف الحقيقية { لنكوننّ من } الذين أتلفوا الاستعداد الأصلي الذي هو مادة السعادة والبقاء بصرفها في دار الفناء\n وحرموا عن الكمال التجرّدي بملازمة النقص الطبيعي",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما طرد سبحانه إبليس حين امتنع عن السجود قال لآدم اختباراً وابتلاء وتوصية لحفظ مرتبته: { يَآءَادَمُ } المكرم المسجود { ٱسْكُنْ أَنتَ } بمتابعة عقلك الموهوب لك من العقل الكلي { وَزَوْجُكَ } بمتابعة نفسها الفائظة عليها من النفس الكلية { ٱلْجَنَّةَ } التي هي مقر أهل التوحيد\n ومنزل أهل الولاء والتجريد من أرباب الوصول الفائزين بشرف القبول { فَكُلاَ } منها\n واحظاظا من لذاتها الروحانية من حقائقها ومعارفها وشهوداتها وكشوفاتها رغداً { مِنْ حَيْثُ شِئْتُمَا وَلاَ تَقْرَبَا هَـٰذِهِ ٱلشَّجَرَةَ } التي هي من أغذية نفوسكم وأهوية هوياتكم { فَتَكُونَا } بتقربها وتناولها { مِنَ ٱلظَّالِمِينَ } [الأعراف: 19] الخارجين عن مقتضى أمرنا وحكمنا المستحقين لطردنا ومقتنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ويا آدمُ اسكُن أنت وزوجُك } حواء { الجنة فكُلاَ من حيث شئتما } من ثمارها\n { ولا تقربَا هذه الشجرة } التين أو العنب أو الحنطة\n { فتكونا من الظالمين } لأنفسكما بمخالفتكما",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:35",
      "similarity": 0.5223037327161519
    },
    {
      "verse": "20:117",
      "similarity": 0.3758668010670981
    },
    {
      "verse": "7:27",
      "similarity": 0.36856189252714805
    },
    {
      "verse": "5:27",
      "similarity": 0.330577780994755
    },
    {
      "verse": "2:31",
      "similarity": 0.32940781542480235
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007019.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007019.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:19.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}