{
  "chapter": "الأعراف",
  "text": "وان تدعوهم الى الهدى لا يسمعوا۟ وترىهم ينظرون اليك وهم لا يبصرون",
  "translations": [
    {
      "translation": "If you call them to guidance, they do not hear. You see them looking at you, yet they do not see.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you call upon them for guidance, they do not hear. When you think they are looking at you, (in fact) they cannot see.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you were to call them to true guidance, they will not hear; and you observe them looking at you whereas they have no power to see.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), if you invite them to the right guidance, they will not listen to you. You will see them looking at you but they do not really see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you call them to guidance they do not listen; and you (Prophet Mohammed – peace and blessings be upon him) observe them looking towards you, whereas they do not perceive anything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you call them to guidance, they hear not and you will see them looking at you, yet they see not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you invite them to guidance, they do not hear; and you see them looking towards you, yet they do not see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you call them to the guidance they do not hear; and thou seest them looking at thee, unperceiving.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye (Muslims) call them to the guidance they hear not; and thou (Muhammad) seest them looking toward thee, but they see not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you call them to the right path, they will not hear you. You find them looking towards you, but they do not see you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye Call them towards guidance they will not hear and thou wilt behold them looking at thee, but they see not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you call them to guidance, they will not hear. You see them facing you, but they do not see.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou callest them to guidance, they hear not. Thou wilt see them looking at thee, but they see not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you call them to guidance, they hear not and you will see them looking at you, yet they see not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you call them to guidance, they will not hear you. You see them looking towards you, but they cannot see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you call them to guidance, they will not hear. And you see them looking at you, yet they do not see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you invite them to guidance, they do not hear; and you see them looking at you while they do not see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:198] And if you call upon them, that is, the idols, to guidance, they do not hear; and you see them, that is, the idols, O Muhammad (s), staring at you, looking toward you, as a person looks, but they do not perceive.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And if ye (Muslims) call them to the Guidance) to the Truth (they hear not) nor answer because they are not living but dead; (and thou seest them) Muhammad (looking towards you) with their eyes open as if they are looking at you, (but they see not) because they are not living but dead.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } من خبث طينتهم وشدة شكيمتهم وضغينتهم { إِن تَدْعُوهُمْ } أيها المؤمنون أولئك المشركين الضالين { إِلَى ٱلْهُدَىٰ } ودين الإسلام { لاَ يَسْمَعُواْ } ولا يقبلوا مع ورود هذه الدلائل الواضحة { وَتَرَٰهُمْ } أيها المتبر الرائي { يَنظُرُونَ إِلَيْكَ } ويسعون ويسمعون منك الأدلة القاطعة { وَهُمْ } من خبث طينتهم وجهل جبلتهم { لاَ يُبْصِرُونَ } [الأعراف: 198] إلى أصنامهم، ولا يتأملون ولا يتفطنون أن ما ينسبون إلى هؤلاء من الشفاعة والشركة وهم زائل وخيال باطل، وخروج عن مقتضى العقل الفطري، بل يصرون على ما هم عليه؛ عتواً وعناداً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}