{
  "chapter": "الأعراف",
  "text": "خذ العفو وامر بالعرف واعرض عن الجهلين",
  "translations": [
    {
      "translation": "Make allowances for people, command what is right, and turn away from the ignorant.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Cultivate tolerance, enjoin justice, and avoid the fools.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[O Prophet!] Show forgiveness, enjoin equity, and avoid the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Have forgiveness, preach the truth, and keep away from the ignorant ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O dear Prophet (Mohammed – peace and blessings be upon him) adopt forgiveness, and enjoin virtue, and turn away from the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Show forgiveness, enjoin Al-'Urf (the good), and turn away from the foolish (don't punish them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take to forgiveness and enjoin good and turn aside from the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take the abundance, and bid to what is honourable, and turn away from the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Keep to forgiveness (O Muhammad), and enjoin kindness, and turn away from the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be tolerant; enjoin what is right; and avoid the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Use thou indulgence and enjoin seemliness and turn away from the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Adopt [a policy of] excusing [the faults of people], bid what is right, and turn away from the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Hold to forgiveness; command what is right; But turn away from the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Show forgiveness, enjoin what is good, and turn away from the foolish (i.e. don't punish them).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Accept the easing, order with fine jurisprudence, and avoid the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Be tolerant, and command decency, and avoid the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Take what is given freely, enjoin what is good, and turn away from the ignorant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:199] Indulge [people] with forgiveness, [accepting] what issues spontaneously from people’s manners [of behaviour], and do not scrutinise them, and enjoin kindness, decency, and turn away from the ignorant, and do not counter their stupidity with the like.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Keep to forgiveness (0 Muhammad)) take the surplus of your family and dependents. But this was abrogated. It is also said that this means: forgive the one who transgresses against you, and give to him who withholds from you and keep ties with him who severs his ties with you, (and enjoin kindness) and benevolence, (and turn away from the ignorant) Abu Jahl and his folk who mock you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { خُذِ ٱلْعَفْوَ [وَأْمُرْ بِٱلْعُرْفِ] } معناهُ الفَضلُ\n والعُرفُ: المَعروفُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, {Take the {grace} [and command the {pardon}]} its meaning is the favor.\n And the 'Uruf: The Ma'ruf.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوإذا كان حالهم هذه وإصرارهم بهذه الغاية { خُذِ ٱلْعَفْوَ } أي: اختر يا أكمل الرسل طريق العفو واللين، واترك الغضب والخشونة على مقتضى شفقة النبوة { وَأْمُرْ بِٱلْعُرْفِ } أي: ادع إلى سبيل ربك بالحكملة والموعظة الحسنة القوم الذين تفرست منهم الرشد بنور النبوة والولاية { وَأَعْرِضْ عَنِ ٱلْجَاهِلِينَ } [الأعراف: 199] المصرين، وإن جادلوك جادلهم بالتي هي أحسن، إن ربك أعلم منهم بمن ظل عن سبيله، وهو أعلم أيضاً بالمهتدين منهم\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: لنبيه صلى الله عليه وسلم: { خُذ العفوَ } أي: اليسر من أخلاق الناس ولا تبحث عنها، أو: خذ من الناس، في أخلاقهم وأموالهم ومعاشرتهم، ما سهل وتيسر مما لا يشق عليهم لئلا ينفروا\n فهو كقول الشاعر:\n\nأو: خذ في الصدقات ما سهل على الناس من أموالهم وهو الوسط، ولا تأخذ كرائم أموالهم مما يشق عليهم، أو تمسك بالعفو عمن ظلمك ولا تُعاقبه، وهذا أوفق لتفسير جبريل الآتي، { وأْمر بالعُرْفِ } أي: المعروف، وهو أفعال الخير، أو العرف الجاري بين الناس\n واحتج المالكية بذلك على الحكم بالعرف الذي يجري بين الناس\n { وأعرض عن الجاهلين } أي: لا تكافىء السفهاء على قولهم أو فعلهم، واحلم عليهم\n ولمّا نَزَلَت سأل رسولُ الله صلى الله عليه وسلم جبريلَ عنها، فقال: \" لا أَدري حَتَّى أسأَلَ، فعرج، ثم رَجَعَ فَقَالَ: يا مُحَمَدَّ، إِنَّ الله يَأمُركَ أن تَصِلَ مَن قَطَعَك، وتُعطِي مَن حَرَمَكَ، وتَعفُو عَمَّن ظَلَمَكَ \"\n وعن جعفر الصادق:  أمر الله نبيه صلى الله عليه وسلم فيها بمكارم الأخلاق ، وهي على هذا ثابتة الحكم، وهو الصحيح\n وقيل: كانت مداراة للكفار، ثم نسخت بالقتال",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "39:64",
      "similarity": 0.5133478746151826
    },
    {
      "verse": "46:23",
      "similarity": 0.434954992464201
    },
    {
      "verse": "6:35",
      "similarity": 0.4306618813241652
    },
    {
      "verse": "16:119",
      "similarity": 0.4089744194470723
    },
    {
      "verse": "4:17",
      "similarity": 0.4065729498195325
    }
  ]
}