{
  "chapter": "الأعراف",
  "text": "وان تدعوهم الى الهدى لا يتبعوكم سواء عليكم ادعوتموهم ام انتم صمتون",
  "translations": [
    {
      "translation": "If you call them to guidance they will not follow you. It makes no difference if you call them or stay silent.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you call them to guidance they will not follow you. It is all the same if you call them or hold your tongue.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you call them to true guidance, they will not follow you. It is all the same for you whether you call them to true guidance or keep silent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Believers, even if you invite them to true guidance, they will not follow you. It makes no difference whether you invite them or whether you keep quiet.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you call the disbelievers to guidance, they do not follow you; it is the same for you, whether you invite them or remain silent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you call them to guidance, they follow you not. It is the same for you whether you call them or you keep silent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you invite them to guidance, they will not follow you; it is the same to you whether you invite them or you are silent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you call them to guidance they will not follow you; equal it is to you whether you call them, or whether you are silent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye call them to the Guidance, they follow you not. Whether ye call them or are silent is all one for you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "It makes no difference whether you call on them or remain silent. If you call them to the right path, they will not follow you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if ye call them toward guidance they follow you not: it is the same to you whether ye call them or are silent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you call them to guidance, they will not follow you: it is the same to you whether you call them or whether you are silent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If ye call them to guidance, they will not obey: For you it is the same whether ye call them or ye hold your peace!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you call them to guidance, they follow you not. It is the same for you whether you call them or you keep silent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you call them to guidance, they will not follow you. It is the same whether you call them or you are silent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you invite them to guidance, they will not follow you. It is the same for you, whether you invite them, or remain silent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you [believers] invite them to guidance, they will not follow you. It is all the same for you whether you invite them or you are silent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:193] And if you call them, that is, the idols, to guidance, they will not follow you (read yatba‘ūkum or yattabi‘ūkum). It will be the same [response] for you, whether you call them, to it, or whether you are silent, [refraining] from calling them, they will not follow it, because they cannot hear.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nيجوز أن يكون عطفاً على جملة { أيشركون ما لا يخلق شيئاً } \\[ الأعراف : 191 \\] زيادة في التعجيب من حال المشركين بذكر تصميمهم على الشرك على ما فيه من سخافة العقول ووهن الدليل ، بعد ذكر ما هو كاف لتزييفه .فضمير الخطاب المرفوع في { وإن تدعوهم } موجه إلى المسلمين مع الرسول صلى الله عليه وسلم وضمير جمع الغائب المنصوب عائد إلى المشركين كما عاد ضمير { أيشركون } \\[ الأعراف : 191 \\] فبعد أن عجّب الله المسلمين من حال أهل الشرك أنبأهم بأنهم لا يقبلون الدعوة إلى الهدى .ومعنى ذلك أنه بالنظر إلى الغالب منهم ، وإلا فقد آمن بعضهم بعد حين وتلاحقوا بالإيمان ، عَدا من ماتوا على الشرك .وهذا الوجه هو الأليق بقوله تعالى بعد ذلك { وإن تدعوهم إلى الهدى لا يسمعوا } \\[ الأعراف : 198 \\] الآية ليكون المخبر عنهم في هذه الآية غير المخبر عنهم في الآية الآتية ، لظهر تفاوت الموقع بين { لا يتبعوكم } وبين { لا يسمعوا } \\[ الأعراف : 198 \\].ويجوز أن تكون جملة { وإن تدعوهم إلى الهدى } إلخ معطوفة على جملة الصلة في قوله : { لا يخلق شيئاً وهم يخلقون } \\[ الأعراف : 191 \\] فيكون ضمير الخطاب في { تدعوهم } خطابا للمشركين الذين كان الحديث عنهم بضمائر الغيبة من قوله : { فتعالى الله عما يشركون } \\[ الأعراف : 190 \\] إلى هنا ، فمُقتضى الظاهر أن يقال : وإن يدعوهم إلى الهدى لا يتبعوهم ، فيكون العدول عن طريق الغيبه إلى طريق الخطاب التفاتا من الغيبة إلى الخطاب توجهاً إليهم بالخطاب ، لأن الخطاب أوقع في الدمغ بالحجة .و { الهدى } على هذا الوجه ما يُهتدى إليه ، والمقصود من ذكره أنهم لا يستجيبون إذا دعوتموهم إلى ما فيه خيرهم فيُعلم أنهم لو دعوهم إلى غير ذلك لكان عدم اتباعهم دعوتهم أولى .وجملة : { سواء عليكم أدعوتموهم أم أنتم صامتون } مؤكدة لجملة { وإن تدعوهم إلى الهدى لا يتبعوكم } فلذلك فُصلت .و { سواء } اسم للشيء المساوي غيره أي ليس أولى منه في المعنى المسوق له الكلام والهمزة التي بعد { سواء } يقال لها همزة التسوية ، وأصلها همزة الاستفهام استعملت في التسوية ، كما تقدم عند قوله تعالى : { سواءً عليهم آنذرتهم أم لم تنذرهم } في سورة البقرة ( 6 ) ، أي سواء دعوتُكُم إياهم وصُمتكم عن الدعوة .و ( على ) فيها للاستعلاء المجازي وهي بمعنى العندية أي : سواء عندهم . وإنما جعل الأمران سواء على المخاطبين ولم يجعلا سواء على المدعوين فلم يقل سواء عليهم ، وإن كان ذلك أيضاً سواء عليهم ، لأن المقصود من الكلام هو تأييس المخاطبين من استجابة المدعوين إلى ما يدعونهم إليه لا الإخبار ، وإن كان المعنيان متلازمين كما أنهما في قوله { سواء عليهم آنذرتهم أم لم تنذرهم } \\[ البقرة : 6 \\] متلازمان فإن الإنذار وعدمه سواء : على المشركين ، وعلى المؤمنين ، ولكن الغرض هنالك بيان انعدام انتفاعهم بالهدى .وهذا هو القانون للتفرقة بين ما يصح أن يسند فيه فعل التسويه إلى جانبين وبين ما يتعين أن يسند فيه إلى جانب واحد إذا كانت التسوية لا تهُم إلا جانباً واحداً ، كما في قوله تعالى :{ اصلوها فاصبروا أو لا تصبروا سواءً عليكم } \\[ الطور : 16 \\] فإنه يتعين أن تجعل التسوية بالنسبة للمخاطبين ، ولا يحسن أن يقال سواء علينا وكقوله : { سواءً علينا أجزعنا أم صبرنا ما لنا من محيصٍ } \\[ إبراهيم : 21 \\] فإنه يتعين أن تكون التسوية بالنسبة إلى المتكلمين .ووقع قوله : { أم أنتم صامتون } مُعادل أدعوتموهم مع اختلاف الاسلوب بين الجملتين بالفعلية والاسمية ، فلم يقل : أم صمتم ، ففي «تفسير القرطبي» ، عن ثعلب : أن ذلك لأنه رأس آية ( أي لمجرد الرعاية على الفاصلة ) قال : وصامتون وصمتم عند سيبويه واحد ، ( أي الفعل والوصف المشتق منه سواء ) يريد لا تفاوت بينهما في أصل المعنى ، لأن ما بعد همزة التسوية لما كان في قوة المصدر لم يكن فيه أثر للفرق بين الفعل والاسم إذ التقدير : سواء عليكم دعوتُكم إياهم وصمتكم عنهم ، فيكون العدول إلى الجملة الاسمية ليس له مقتض من البلاغة بل هما عند البليغ سيان ، ولكن العدول إلى الاسمية من مقتضى الفصاحة ، لأن الفواصل والأسجاع من أفانين الفصاحة ، وفيهما تظهر براعة الكلام إذْ يكون فيه إيفاء بحق الفاصلة مع السلامة من التكلف ، كما تظهر براعة الشاعر في توفيته بحق القافية إذا سلم مع ذلك من التكلف ، قال المرزوقي في ديباجة «شرحه على الحماسة» «والقافية يجب أن تكون كالموعود به المنتظر يتشوقها المعنى بحقه ، واللفظ بقسطه ، وإلا كانت قلقة في مقرها مجتلبة لمستغن عنها» .والتحقيق أن الجملة الاسمية دلت على ثبوت الوصف المتضمنة ، مع عدم تقييد بزمان ولا إفادة تجدد ، بخلاف الفعلية ، وهو صريح كلام الشيخ في «دلائل الاعجاز» ، والسكاكي في «المفتاح» ، لكن كلام الزمخشري في هذه الآية ينادي على أن جملة : { أم أنتم صامتون } دالة على استمرار صمتهم ، وكذلك كلام السكاكي في إبداء الفرق بين الجملتين في قوله تعالى : { ومن الناس من يقول آمنا بالله وباليوم الآخر وما هم بمؤمنين } \\[ البقرة : 8 \\] وفي قوله تعالى : { قالوا آمنا } \\[ البقرة : 14 \\] مع قوله عقبه : { قالوا إنا معكم } \\[ البقرة : 14 \\] ، وظاهر كلام الشيرازي في «شرح المفتاح» أن الثبوت يستلزم الاستمرار ، وقال الشارح التفتازاني ، في «شرح المفتاح» : الحق أن الجملة الاسمية التي تكون عُدولاً عن الفعلية تفيد الدوام الذي هو كالثبوت ، وفسر في «شرح تلخيص المفتاح» الثبوتَ بمقارنة الدوام ، وأما السيد في «شرح المفتاح» ، و«حاشيته على المطول» ، فقد جعل الجملة الاسمية قد يقصد بها الدوام إثباتاً ونفيا بحسب المقامات .وعندي أن الجملة الاسمية لا تفيد أكثر من الثبوت المقابل للتجدد ، وأما الاستمرار والدوام فهو معنى كنائي لها يُحتاج في استفادته إلى القرينة المعيّنة وهي منفية هنا ، فالمعنى : سواء عليكم أدعوتموهم دعوة متجددة أم لازمتم الصمت ، وليس المعنى على الدوام ، وقد احتاج صاحب «الكشاف» إلى بيانه بطريقة الدقة بإيراد السؤال والجواب على عادته ، وأيَّاً ما كان فالعدول عن الجملة الفعلية في معادل التسوية اقتضاه الحال البلاغي خلافاً لثعلب .\n\n",
      "translations": [
        {
          "translation": "(And if ye call them) Muhammad, i.e. the disbelievers (to the Guidance) to Allah's divine Oneness, (they follow you not) they will not answer you. (Whether you call them) to Allah's divine Oneness (or are silent is all one to them) the disbelievers will not follow you regarding Allah's divine Oneness; it is also said: group of disbelievers, if you call the idols to the Truth, they will not answer: it is the same whether you call them or not, because they are not living but dead.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه: { وَإِن تَدْعُوهُمْ } أيها المؤمنون\n الموحدون المشركين المصريين على الشرك { إِلَى ٱلْهُدَىٰ } أي: الإسلام الموصل لهم إلى توحيد الحق { لاَ يَتَّبِعُوكُمْ } لخبث طينتهم\n بل { سَوَآءٌ عَلَيْكُمْ } أيها المؤمنون المريدون إهداء هؤلاء الغواة { أَدَعَوْتُمُوهُمْ } أي: دعوتكم إياهم إلى الإسلام { أَمْ أَنْتُمْ صَٰمِتُونَ } [الأعراف: 193] ساكتون عن الدعوة\n بل عن الالتفات إليهم مطلقاً\n لشدة قساوتهم وغلظة غشاوتهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِن تدعوهم إلى الهُدى لا يتبعوكم } أي: وإن تدعو الأصنام إلى الهدى لا تجيبكم\n فلا تهتدي إلى ما دعيت إليه لأنها جمادات\n أو: وإن تدعوهم إلى أن يهدوكم إلى الحق لا تجيبكم\n { سواءٌ عليكم أدَعوتُموهم أم أنتم صامتون } عن دعائهم\n فالدعاء في حقهم وعدمه سواء\n وإنما لم يقل: أم صمتم ليفيد الاستمرار على عدم إجابتهم: لأن الجملة الاسمية تقتضي الاستمرار",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "63:6",
      "similarity": 0.05195041477286012
    },
    {
      "verse": "2:6",
      "similarity": 0.04590393818464814
    },
    {
      "verse": "36:10",
      "similarity": 0.0454968301918333
    },
    {
      "verse": "26:136",
      "similarity": 0.042800012110314686
    },
    {
      "verse": "21:109",
      "similarity": 0.04252118484023576
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007193.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007193.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:193.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}