{
  "chapter": "الأعراف",
  "text": "ان الذين تدعون من دون الله عباد امثالكم فادعوهم فليستجيبوا۟ لكم ان كنتم صدقين",
  "translations": [
    {
      "translation": "Those you call on besides Allah are slaves just like yourselves. Call on them and let them respond to you if you are telling the truth.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom you invoke besides God are created beings like you. So call on them and let them answer your call, if what you say is true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom you invoke other than Allah are creatures like you. So invoke them. and see if they answer your call, if what you claim is true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom you (pagans) worship besides God, are themselves servants just like yourselves. If your claim was true, they should answer your prayers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those whom you (the disbelievers) worship besides Allah are slaves like you – so call them and they may answer you, if you are truthful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those whom you call upon besides Allah are servants like you. So call upon them and let them answer you if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those whom you call on besides Allah are in a state of subjugation like yourselves; therefore call on them, then let them answer you if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those on whom you call apart from God, are servants the likes of you; call them and let them answer you, if you speak truly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those on whom ye call beside Allah are slaves like unto you. Call on them now, and let them answer you, if ye are truthful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom you call on besides God are but creatures like yourselves. Call upon them, then, and let them respond to you, if what you say is true.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those whom ye call upon beside Allah are creatures like unto you; so call on them, and let them answer you if ye say sooth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those whom you invoke besides Allah are creatures like you. So invoke them: they should answer you, if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those whom ye call upon besides Allah are servants like unto you: Call upon them, and let them listen to your prayer, if ye are (indeed) truthful!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those whom you call upon besides Allah are slaves like you. So call upon them and let them answer you if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those whom you invoke, other than Allah, are worshipers like yourselves. Call them, and let them answer you, if what you say is true!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those you call upon besides God are servants like you. So call upon them, and let them answer you, if you are truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those you [polytheists] call upon besides Allah are servants like you. So call upon them and let them respond to you, if you should be truthful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:194] Truly those on whom you call, [whom] you worship, besides God are servants, owned, like you; call them then and let them answer you, your call, if you are truthful, in [claiming] that they are gods: God then illustrates their utter incapacity and the superiority which their worshippers possess over them, saying:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nهذه الجملة على الوجه الأول في كون المخاطب ، بقوله : { وإن تَدعوهم إلى الهدى لا يتبعوكم } \\[ الأعراف : 193 \\] الآية ، النبي عليه الصلاة والسلام والمسلمين أن تكون استئنافاً ابتدائياً انتُقل به إلى مخاطبة المشركين ، ولذلك صدر بحرف التوكيد لأن المشركين ينكرون مساواة الأصنام إياهم في العبودية ، وفيه الالتفات من الغيبة إلى الخطاب .والمراد بالذين تدعون من دون الله : الأصنام ، فتعريفها بالموصول لتنبيه المخاطبين على خطأ رأيهم في دعائهم إياها من دون الله ، في حين هي ليست أهلا لذلك ، فهذا الموصول كالموصول في قول عبدة بن الطبيب :إن الذين تُرْوَنُهم إخوانكم ... يشفي غليل صدورهم أن تُصرعواويجيء على الوجه الثاني في الخطاب السابق : أن تكون هذه الجملة بياناً وتعليلاً لجملة { وإن تدعوهم إلى الهدى لا يتبعوكم } \\[ الأعراف : 193 \\] أي لأنهم عباد أي مخلوقون .و ( العبد ) أصله المملوك ، ضد الحر ، كما في قوله تعالى : { الحر بالحر والعبد بالعبد } \\[ البقرة : 178 \\] وقد أطلق في اللسان على المخلوق : كما في قوله تعالى : { إن كل من في السماوات والأرض إلا آتي الرحمن عبداً } \\[ مريم : 93 \\] ولذلك يطلق العبد على الناس ، والمشهور أنه لا يطلق إلا على المخلوقات من الآدميين فيكون إطلاقُ العباد على الأصنام كإطلاق ضمير جمع العقلاء عليها بناء على الشائع في استعمال العرب يومئذ من الإطلاق ، وجعله صاحب «الكشاف» اطلاقَ تهكم واستهزاء بالمشركين ، يعني أن قصارى أمرهم أن يكونوا أحياء عقلاء فلو بلغوا تلك الحالة لما كانوا إلا مخلوقين مثلكم ، قال ولذلك أبطل أن يكونوا عباداً بفوله { ألهم أرجل } \\[ الأعراف : 195 \\] إلى آخره .والأحسن عندي أن يكون إطلاق العباد عليهم مجازاً بعلاقة الإطلاق عن التقييد روعي في حسنة المشاكلة التقديرية لأنه لما ماثلهم بالمخاطبين في المخلوقية وكان المخاطبون عباد الله أطلق العباد على مماثليهم مشاكلة .وفرع على المماثلة أمر التعجيز بقوله { فادعوهم } فإنه مستعمل في التعجيز باعتبار ما تفرع عليه من قوله { فليستجيبوا لكم } المضمن إجابة الأصنام إياهم ، لأن نفس الدعاء ممكن ولكن استجابته لهم ليست ممكنة ، فإذا دعوهم فلم يستجيبوا لهم تبين عجز الآلهة عن الاستجابة لهم ، وعجز المشركين عن تحصيلها مع حرصهم على تحصيلها لانهاض حجتهم ، فئال ظهور عجز الأصنام عن الاستجابة لعبادها إلى إثبات عجز المشركين عن نهوض حجتهم لتلازم العجزين ، قال تعالى : { أن تدعوهم لا يسمعوا دعاءكم ولو سمعوا ما استجابوا لكم } \\[ فاطر : 14 \\].والأظهر أن المراد بالدعوة المأمور بها الدعوة للنصر والنجدة كما قال وذاك المازني إذا استنجدوا لم يسألوا من دعاهم لأيّة حرب أم بأي مكان .وبهذا يظهر أن أمر التعجيز كناية عن ثبوت عجز الأصنام عن إجابتهم ، وعجز المشركين عن إظهار دعاء للأصنام تعقبة الاستجابة .والأمر باللام في قوله : { فليستجيبوا } أمرُ تعجيز للأصنام ، وهو أمر الغائب فإن طريق أمر الغائب هو الأمر .ومعنى توجيه أمر الغائب السامع أنه مأمور بأن يبلِّغ الأمر للغائب .وهذا أيضاً كناية عن عجز الأصنام عن الاستجابه لعجزها عن تلقي التبليغ من عبدتها .\n\n",
      "translations": [
        {
          "translation": "(Lo! those on whom ye call) worship (beside Allah) of idols (are slaves like unto you) are created like you. (Call on them) i.e. the idols (now, and let them answer you) let them hear your call and answer, (if ye are truthful!) that they can benefit you.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه تبكيتاً للمشركين: { إِنَّ ٱلَّذِينَ تَدْعُونَ } وتعبدون أيها الضالون المشركون { مِن دُونِ ٱللَّهِ } المتفرد بالألوهية\n المتوحد بالربوبية { عِبَادٌ أَمْثَالُكُمْ } أي: هم مخلوقون أمثالكم\n بل أسوء حالاً منكم\n لكونهم جمادات لا شعور لها\n كيف سميتوها معبودات تعبدونها كعبادة الله\n وإن اعتقدتم إلهيتهم وتأثيرهم { فَٱدْعُوهُمْ } بإنزال العذاب على مخالفيكم { فَلْيَسْتَجِيبُواْ لَكُمْ } ألبتة\n لكونكم عباداً لهم { إِن كُنتُمْ صَادِقِينَ } [الأعراف: 194] في أنهم آلهة\n فكيف تعتقدون أيها الحمقى إلهية هؤلاء الجمادات التي تنحتونها بأيديكم من الأحجار والأخشاب\n والإله منزه عنها\n متعال عن أمثالها\n وأيضاً كيف تعتقدون تأثير هؤلاء؟!\n\n\n{ أَلَهُمْ أَرْجُلٌ يَمْشُونَ بِهَآ } فيؤثرون بسببها { أَمْ لَهُمْ أَيْدٍ يَبْطِشُونَ بِهَآ أَمْ لَهُمْ أَعْيُنٌ يُبْصِرُونَ بِهَآ أَمْ لَهُمْ آذَانٌ يَسْمَعُونَ بِهَا } والتأثير مسبوق بهذه القوى\n كيف وشرط التأثير الحياة؟ ولا حياة لهم أصلاً\n فكيف يؤثرون؟ وأنتم كيف تثبتون لهم التأثير",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم قال تعالى: { إن الذين تدعون من دون الله } أي: تعبدونهم وتسمونهم آلهة من دون الله\n هم { عبادٌ أمثالُكم } من حيث أنها مسخرة مملوكة\n فكيف يعبد العبد مع ربه\n { فادعوهم فليستجيبوا لكم إن كنتم صادقين } في أنها تستحق أن تُعبد\n والأمر للتعجيز لأن الأصنام لا تقدر أن تجيب فلا تستحق أن تعبد\n ثم عاد عليهم بالنقض فقال: { ألهُم أرجلٌ يمشون بها أم لهم أيدٍ يبشطون بها أم لهم أعينٌ يبصرون بها أم لهم آذانٌ يسمعون بها } \n ومعناه: أن الأصنام جمادات عادمة للحس والجوارح والحياة\n ومن كان كذلك لا يكون إلهًا\n فإنَّ من وصف الإله الإدراك والحياة والقدرة\n وإنما جاء هذا البرهان بلفظ الاستفهام لأن المشركين مقرون أن أصنامهم لا تمشي\n ولا تبطش\n ولا تبصر\n ولا تُسمع\n فلزمتهم الحجة",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "46:5",
      "similarity": 0.544662307982607
    },
    {
      "verse": "10:89",
      "similarity": 0.5433753945612072
    },
    {
      "verse": "28:64",
      "similarity": 0.5355412767833617
    },
    {
      "verse": "35:14",
      "similarity": 0.504610604228719
    },
    {
      "verse": "46:32",
      "similarity": 0.4608737479813761
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007194.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007194.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:194.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}