{
  "chapter": "الأعراف",
  "text": "ويـادم اسكن انت وزوجك الجنة فكلا من حيث شئتما ولا تقربا هذه الشجرة فتكونا من الظلمين",
  "translations": [
    {
      "translation": "'Adam, live in the Garden, you and your wife, and eat of it wherever you like. But do not go near this tree lest you become wrongdoers.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you, O Adam, and your spouse, live in the Garden and eat your fill wheresoever you like, but do not approach this tree, or you will become iniquitous.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Adam! Live you and your spouse in the Garden and both of you eat from it wherever you will, but never approach the tree or you shall become wrongdoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Lord said, \"Adam, stay in the garden with your spouse and eat whatever you want therein, but do not go near this tree lest you transgress\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And said, “O Adam! You and your wife dwell in Paradise – therefore eat from it from wherever you wish, and do not approach this tree for you will become of those who transgress.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O Adam! Dwell you and your wife in Paradise, and eat thereof as you both wish, but approach not this tree otherwise you both will be of the wrongdoers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (We said): O Adam! Dwell you and your wife in the garden; so eat from where you desire, but do not go near this tree, for then you will be of the unjust.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Adam, inherit, thou and thy wife, the Garden, and eat of where you will, but come not nigh this tree, lest you be of the evildoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (unto man): O Adam! Dwell thou and thy wife in the Garden and eat from whence ye will, but come not nigh this tree lest ye become wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To Adam He said, \"You and your wife, dwell in the Garden and eat and drink there from wherever you wish, but do not approach this tree, lest you become wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And: O Adam: dwell thou and thy spouse in the Garden and eat ye twain thereof Whence ye will, and approach not yonder tree lest ye twain become of the wrong-doers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Then He said to Adam,] ‘O Adam, dwell with your mate in paradise, and eat thereof whence you wish; but do not approach this tree, lest you should be among the wrongdoers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Adam! dwell thou and thy wife in the Garden, and enjoy (its good things) as ye wish: but approach not this tree, or ye run into harm and transgression.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O Adam! Dwell you and your wife in Paradise, and eat thereof as you both wish, but approach not this tree otherwise you both will be of the Zalimun (unjust and wrong-doers).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Adam dwell with your wife in Paradise, and eat from whatever you please; but never approach this tree or you shall both become harmdoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And you, Adam, inhabit the Garden, you and your wife, and eat whatever you wish; but do not approach this tree, lest you become sinners.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And \"O Adam, dwell, you and your wife, in Paradise and eat from wherever you will but do not approach this tree, lest you be among the wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:19] And, He said, ‘O Adam, dwell, you (anta: this is reiterated in order to emphasise the subject of the verb uskun, ‘dwell’, and to supplement to it [what follows]) and your wife, Eve (read Hawwā’), in the Garden, and eat from whence you will, but do not come near this tree, to eat of it — and this was wheat — lest you become evildoers’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And (unto man): Adam! Dwell thou and thy wife) Eve (in the Garden and eat from whence) in Paradise (ye will) and whenever you will, (but come not nigh this tree) do not eat from this tree: the tree of knowledge (lest ye become wrong-doers) lest you become of those who harm themselves.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ ليبدي لهما ما وري عنهما من سوآتهما } أي: ليظهر عليهما بالميل إلى الطبيعة ما حجب عنهما عند التجرّد من الأمور الطبيعية واللذات البدنية والرذائل الخلقية والأفعال الحيوانية والصفات السبعية والبهيمية التي يستحيي الإنسان من إظهارها ويستهجن إفشاءها وتحمله المروءة على إخفائها لكونها عورات عند العقل يأنف منها ويستقبحها { وقال ما نهاكما ربكما عن هذه الشجرة إلا أن تكونا ملكين } أي: أوهمهما أن في الاتصال بالطبيعة الجسمانية والمادة الهيولانية لذات ملكية وإدراكات وأفعالاً وخلوداً فيها أو ملكاً ورياسة على القوى وسائر الحيوانات دائماً بغير زوال إن قرئ ملكين بكسر اللام كما قال:\n[طه\n الآية: 120]\n وزيّن لها من المصالح الجزئية والزخارف الحسيّة التي لا تنال إلا بالآلات البدنية في صورة الناصح الأمين\n  { فدلاهما } أي: فنزلهما إلى التعلق بها والسكون إليها بما غرّهما من التزيي بزي الناصحين وإفادة توهم دوام اللذات البدنية والرياسة الإنسية وسوّل لهما من المنافع البدنية والشهوات النفسية { وطفَقَا يَخْصِفان عليهما من ورق الجنة } أي: يكتمان الغواشي الطبيعية بالآداب الحسنة والعادات الجميلة التي هي من تفاريع الآراء العقلية ومستنبطات القوّة العاقلة العملية ويخفيانها بالحيل العلمية { وناداهما ربّهما ألم أنْهَكُما } صورة النهي هو ما ركز في العقول من الميل إلى التجرّد وإدراك المعقولات والتجافي عن المواد والمحسوسات وقوله لهما: { إن الشيطان لكما عدوّ مبين } ما ألهم العقل من منافات أحكام الوهم ومضادّة مدركاته والوقوف على مخالفاته ومكابراته إياه ونداؤه إياهما بذلك هو التنبيه على ذلك المعنى على سبيل الخاطر والتذكير له بعد التعلق والانغمار في اللذات الطبيعية عند البلوغ وظهور أنواع العقل والفهم عليهما\n وقولهما: { ربنا ظلمنا أنفسنا } هو لتنبه النفس الناطقة على نقصانها من جهة الطبيعة وانطفاء نورها وانكسار قوتها وحصول الداعي فيها على طلب الكمال بالتجرّد { وإن لم تغفر لنا } بإلباسنا الأنوار الروحانية وإفاضتها مشرقة علينا { وترحمنا } بإفاضة المعارف الحقيقية { لنكوننّ من } الذين أتلفوا الاستعداد الأصلي الذي هو مادة السعادة والبقاء بصرفها في دار الفناء\n وحرموا عن الكمال التجرّدي بملازمة النقص الطبيعي",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما طرد سبحانه إبليس حين امتنع عن السجود قال لآدم اختباراً وابتلاء وتوصية لحفظ مرتبته: { يَآءَادَمُ } المكرم المسجود { ٱسْكُنْ أَنتَ } بمتابعة عقلك الموهوب لك من العقل الكلي { وَزَوْجُكَ } بمتابعة نفسها الفائظة عليها من النفس الكلية { ٱلْجَنَّةَ } التي هي مقر أهل التوحيد\n ومنزل أهل الولاء والتجريد من أرباب الوصول الفائزين بشرف القبول { فَكُلاَ } منها\n واحظاظا من لذاتها الروحانية من حقائقها ومعارفها وشهوداتها وكشوفاتها رغداً { مِنْ حَيْثُ شِئْتُمَا وَلاَ تَقْرَبَا هَـٰذِهِ ٱلشَّجَرَةَ } التي هي من أغذية نفوسكم وأهوية هوياتكم { فَتَكُونَا } بتقربها وتناولها { مِنَ ٱلظَّالِمِينَ } [الأعراف: 19] الخارجين عن مقتضى أمرنا وحكمنا المستحقين لطردنا ومقتنا\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { ويا آدمُ اسكُن أنت وزوجُك } حواء { الجنة فكُلاَ من حيث شئتما } من ثمارها\n { ولا تقربَا هذه الشجرة } التين أو العنب أو الحنطة\n { فتكونا من الظالمين } لأنفسكما بمخالفتكما",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:35",
      "similarity": 0.5223037327161519
    },
    {
      "verse": "20:117",
      "similarity": 0.3758668010670981
    },
    {
      "verse": "7:27",
      "similarity": 0.36856189252714805
    },
    {
      "verse": "5:27",
      "similarity": 0.330577780994755
    },
    {
      "verse": "2:31",
      "similarity": 0.32940781542480235
    }
  ]
}