{
  "chapter": "الأعراف",
  "text": "كتب انزل اليك فلا يكن فى صدرك حرج منه لتنذر به وذكرى للمؤمنين",
  "translations": [
    {
      "translation": "It is a Book sent down to you - so let there be no constriction in your breast because of it so that you can give warning by it and as a reminder to the muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Book has been sent down to you; so do not hesitate to warn (the unbelievers) through it, and remind the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a Book revealed to you. Let there be no impediment in your heart about it. (It has been revealed to you) that you may thereby warn [the unbelievers], that it may be a reminder to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A book has been revealed to you, (Muhammad). You should not hesitate to convey its warning and its good advice to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O dear Prophet (Mohammed – peace and blessings be upon him), a Book has been sent down upon you, therefore may not your heart be disinclined towards it, so that you may give warning with it, and as an advice for the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is the) Book (the Qur'an) sent down unto you, so let not your breast be narrow therefrom, that you warn thereby; and a reminder unto the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Book revealed to you-- so let there be no straitness in your breast on account of it-- that you may warn thereby, and a reminder close to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Book sent down to thee -- so let there be no impediment in thy breast because of it -- to warn thereby, and as a reminder to believers:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It is) a Scripture that is revealed unto thee (Muhammad) - so let there be no heaviness in thy heart therefrom - that thou mayst warn thereby, and (it is) a Reminder unto believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Book has been sent down to you, let there be no heaviness in your heart about it, so that you may warn by means of it and it is a reminder to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a Book sent down toward thee: so let there be no straitness in thy breast therefor: that thou mayest warn thereby! and this is an admonition unto the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This is] a Book that has been sent down to you—so let there be no disquiet in your heart on its account that you may warn thereby—and as an admonition for the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Book revealed unto thee,- So let thy heart be oppressed no more by any difficulty on that account,- that with it thou mightest warn (the erring) and teach the Believers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is the) Book (the Quran) sent down unto you (O Muhammad SAW), so let not your breast be narrow therefrom, that you warn thereby, and a reminder unto the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Book has been sent down to you; so let your chest have no constriction because of it, in order to warn thereby and as a reminder to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Scripture was revealed to you, so let there be no anxiety in your heart because of it. You are to warn with it—and a reminder for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This is] a Book revealed to you, [O Muhammad] - so let there not be in your breast distress therefrom - that you may warn thereby and as a reminder to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:2] This is, a Book that is revealed to you — addressing the Prophet (s) — so let there be no inhibition, [no] constraint, in your breast because of it, to convey it — for fear that you might be called a liar — that you may warn thereby (li-tundhira, ‘that you may warn’, is semantically connected to unzila, ‘is revealed’, that is to say, ‘[it is revealed] for [the purposes of] warning’) and as a reminder for those who believe, in it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nذكرنا في طالعة سورة البقرة أنّ الحروف المقطّعة في أوائل السّور أعقبت بذكر القرآن أو الوحي أو ما في معنى ذلك ، وذلك يرجح أن المقصود من هذه الحروف التّهجي ، إبلاغاً في التّحدي للعرب بالعجز عن الإتيان بمثل القرآن وتخفيفاً للعبء عن النّبيء صلى الله عليه وسلم فتلك جملة مستقلّة وهي هنا معدودة آية ولم تعدّ في بعض السّور .فقوله : { كتب } مبتدأ ووقع الابتداء ، بالنّكرة إمّا لأنّها أريد بها النّوع لا الفرد فلم يكن في الحكم عليها إبهام وذلك كقولهم : رجلٌ جاءني ، أي لا امرأة ، وتمرة خيرٌ من جرادة ، وفائدة إرادة النّوع الردّ على المشركين إنكارهم أن يكون القرآن من عند الله ، واستبعادهم ذلك ، فذكّرهم الله بأنّه كتاب من نوع الكُتب المنزّلة على الأنبياء ، فكما نزلت صحف إبراهيم وكتاب موسى كذلك نَزَل هذا القرآن ، فيكون تنكير النّوعية لدفع الاستبعاد ، ونظيره قوله تعالى : { قالوا لا تخف خَصْمَان بغى بعضنا على بعض } \\[ ص : 22 \\] فالتّنكير للنّوعيّة .وإما لأن التّنكير أريد به التّعظيم كقولهم : «شرّ أهَرّ ذَا نَاب» أي شرٌ عظيم . وقول عُوَيْف القوافي :خَبَرٌ أتَانِي عن عُيَيْنَةَ موجِع ... كادَت عليه تَصَدعّ الأكْبَادُأي هو كتاب عظيم تنويهاً بشأنه فصار التنكير في معنى التوصيف .وإمّا لأنّه أريد بالتّنكير التعجيب من شأن هذا الكتاب في جميع ما حفّ به من البلاغة والفصاحة والإعجاز والإرشاد ، وكونه نازلاً على رجل أمّيّ .وقوله : { أنزل إليك } يجوز أن يكون صفة ل { كتاب } فيكون مسوغاً ثانياً للابتداء بالنّكرة ويجوز أن يكون هو الخبر فيجُوز أن يكون المقصود من الأخبار تذكير المنكرين والمكابرين ، لأنّ النّبي صلى الله عليه وسلم والمؤمنين يعلمون أنّه أنزل من عند الله ، فلا يحتاجون إلى الإخبار به ، فالخبر مستعمل في التّعريض بتغليط المشركين والمكابرين والقاصدين إغاظة الرّسول عليه الصّلاة والسّلام بالإعراض ، ويجوز أن يكون المقصود من الخبر الامتنان والتّذكير بالنّعمة ، فيكون الخبر مستعملاً في الامتنان على طريقة المجاز المرسل المركب .ويجوز أن يجعل الخبر هو قوله : { أنزل إليك } مع ما انضمّ إليه من التّفريع والتّعليل ، أي هو كتاب أنزل إليك فكن منشرح الصّدر به ، فإنّه أنزل إليك لتنذر به الكافرين وتذكِّر المؤمنين ، والمقصود : تسكين نفس النّبي صلى الله عليه وسلم وإغاظة الكافرين ، وتأنيس المؤمنين ، أي : هو كتاب أنزل لفائدة ، وقد حصلت الفائدة فلا يكن في صرك حرج إن كذّبوا . وبهذه الاعتبارات وبعدم منافاة بعضها لبعض يحمل الكلام على إرادة جميعها وذلك من مطالع السّور العجيبة البيان .ومن المفسّرين من قدّروا مبتدأ محذوفاً ، وجعلوا { كتب } خبراً عنه ، أي هذا كتاب ، أي أنّ المشار إليه القرآن الحاضر في الذّهن ، أو المشار إليه السّورة أطلق عليها كتاب ، ومنهم من جعل { كتاب } خبراً عن كلمة{ آلمص } \\[ الأعراف : 1 \\] وكلّ ذلك بمعزل عن متانة المعنى .وصِيغ فعل : { أنزل } بصيغة النائب عن الفاعل اختصاراً ، للعِلم بفاعل الإنزال ، لأنّ الذي يُنزل الكتب على الرّسل هو الله تعالى ، ولما في مادة الإنزال من الإشعار بأنّه من الوحي لملائكة العوالم السّماوية .والفاء في قوله : { فلا يكن في صدرك } اعتراضية إذ الجملة معترضة بين فعل { أنزل } ومتعلّقة وهو { لتنذر به } ، فإنّ الاعتراض يكون مقترناً بالفاء كما يكون مقترناً بالواو كما في قوله تعالى : { هذا فليذوقوه حميم وغساف } \\[ ص : 57 \\] وقوله : { إن يكن غنياً أو فقيراً فالله أولى بهما فلا تتّبعوا الهوى } \\[ النساء : 135 \\]. وقول الشّاعر وهو من الشّواهد :اعْلَمْ فعِلْمُ المرء يَنْفَعُه ... أنْ سَوف يأتي كُلّ ما قُدّراوقول بشّار بن برد :كقائلة إنّ الحمار فَنَحِّه ... عن القتّ أهلُ السّمسم المُتهذّبِوليست الفاء زائدة للاعتراض ولكنّها ترجع إلى معنى التّسبّب ، وإنّما الاعتراض حصل بتقديم جملتها بين شيئين متّصلين مبادرة من المتكلّم بإفادته لأهمّيته ، وأصل ترتيب الكلام هنا : كتاب أنزل إليك لتنذر به وذِكْرَى للمؤمنين فلا يكن في صدرك حرج منه ، وقد ذكَر في «مغني اللّبيب» دخول الفاء في الجملة المعترضة ولم يذكر ذلك في معاني الفاء فتوهّم متوهّمون أنّ الفاء لا تقع في الجملة المعترضة .والمعنى أنّ الله أنزله إليك لا ليكون في صدرك حرج ، بل لينشرح صدرك به . ولذلك جاء في نفي الحرج بصيغة نَهْي الحرج عن أن يحصل في صدر النّبيء صلى الله عليه وسلم ليكون النّهي نهي تكوين ، بمعنى تكوين النّفي ، عكس أمر التّكوين الذي هو بمعنى تكوين الإثبات . مُثِّلَ تكوين نفي الحرج عن صدره بحالة نهي العاقل المدرِك للخطاب ، عن الحصول في المكان . وجَعَل صاحب «الكشاف» النّهي متوجّهاً في الحقيقة إلى النبي صلى الله عليه وسلم أي نهيه عن المبالاة بالمكذّبين بالقرآن ، والغمّ من صنيعهم ، وجعل النّهي في ظاهر اللّفظ متوجّهاً إلى الحرج للمبالغة في التّكليف ، باقتلاعه من أصله على طريقة قول العرب : «لاَ أرَيَنَّكَ ههنا» أي لا تحضر فأراك ، وقولهم : «لا أعْرِفَنَّك تفعل كذا» أي لا تفعلْه فأعرّفَك به ، نهياً بطريق الكناية ، وأيّاً ما كان فالتّفريع مناسب لمعاني التّنكير المفروض في قوله : { كتاب } ، أي فلا يكن في صدرك حرج منه من جهة ما جَرّه نزوله إليك من تكذيب قومك وإنكارهم نزوله ، فلا يكن في صدرك حرج منه من عظم أمره وجلالتِه ، ولا يكن في صدرك حرج منه فإنّه سبب شرح صدرك بمعانيه وبلاغته .و ( مِنْ ) ابتدائيّة ، أي حرج ينشأ ويسري من جرّاء المذكور ، أي من تكذيب المكذّبين به ، فلمّا كان التّكذيب به من جملة شؤونه ، وهو سبب الحرج ، صح أن يجعل الحرج مسبّباً عن الكتاب بواسطة . والمعنى على تقدير مضاف أي حرج من إنكاره أي إنكار إنزاله من الله .والحرج حقيقته المكان الضيّق من الغَابات الكثيرة الأشجار ، بحيث يعسر السلوك فيه ، ويستعار لِحالة النّفس عند الحزن والغضب والأسف ، لأنّهم تخيّلوا للغاضب والآسِف ضيقاً في صدره لما وجدوه يعسر منه التّنفّس من انقباض أعْصاب مجاري النفَس ، وفي معنى الآية قوله تعالى :{ فلعلك تارك بعض ما يوحى إليك وضائق به صدرك أن يقولوا لولا أنزل عليه كنز أو جاء معه ملك إنما أنت نذير } \\[ هود : 12 \\].و { لتنذر } متعلّق ب { أنزل } على معنى المفعول لأجله ، واقترانه بلام التعليل دون الإتيان بمصدر منصوب لاختلاف فاعل العامل وفاعِل الإنذار . وجعل الإنذار به مقدّماً في التّعليل لأنّه الغرض الأهم لإبطال ما عليه المشركون من الباطل وما يخلفونه في النّاس من العوائد الباطلة التي تُعاني أزالتها من النّاس بعدَ إسلامهم .{ ذكرى } يجوز أن يكون معطوفاً على { لتنذر به } ، باعتبار انسباكه بمصدر فيكون في محلّ جرّ ، ويجوز أن يكون العطف عطف جملة ، ويكون { ذكرى } مصدراً بدلاً من فعله ، والتّقدير : وذَكِّرْ ذكرى للمؤمنين ، فيكون في محلّ نصب فيكون اعتراضاً .وحذف متعلّق { تنذر } ، وصرح بمتعلّق { ذكرى } لظهور تقدير المحذوف من ذكر مقابله المذكور ، والتّقدير : لتنذر به الكافرين ، وصرح بمتعلّق الذّكرى دون متعلّق { تنذر } تنويها بشأن المؤمنين وتعريضاً بتحقِير الكافرين تجاه ذكر المؤمنين .\n\n",
      "translations": [
        {
          "translation": "((It is) a Scripture) this Scripture, i.e. the Qur'an (that is revealed unto thee (Muhammad)) that Gabriel brought to you (so let there be no heaviness in thy heart) let there be no doubt in your heart (therefrom) i.e. there can be no doubt about the Qur'an being from Allah (that thou mayst warn thereby) that you may warn the people of Mecca through the Qur'an in order that they believe, (and (it is) a Reminder unto believers).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلاَ يَكُنْ فِي صَدْرِكَ حَرَجٌ مِّنْهُ } معناهُ ضِيقٌ ويقالُ: شكٌ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - {There should not be any difficulty in your heart regarding him} - its meaning is [that there should be] no anxiety, and it is said: [this is] doubt.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n فلم يبق عليك وزر في عين الجمع ولا حجاب بأحدهما عن الآخر { لتُنْذر به } وتذكر تذكيراً { للمؤمنين } بالإيمان الغيبي\n أي: لا يضق صدرك منه ليمكنك الإنذار والتذكير\n إذ لو ضاق لبقي في حال الفناء\n لا يرى إلا الحق في الوجود وينظر إلى الحق بنظر العدم المحض فكيف ينذر ويذكر ويأمر وينهى\n على تقدير القسم\n فمعناه بالكل من أوّله إلى آخره\n أو باسم الله الأعظم إذ ص حامل العرش والعرش يسع الذات والصفات والمجموع هو الاسم الأعظم\n لهو كتاب أُنزل إليك علمه\n أو: لهذا القرآن كتاب أنزل إليك",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كِتَابٌ } جامع لجميع فوائد الكتب المنزلة وأحكامها وإشاراتها\n ناطق بجميع الأحوال الواقعة في النشأة الأولى والأخرى { أُنزِلَ إِلَيْكَ } يا هادي المضلين تقوية لك وترويجاً لما أمرت به { فَلاَ يَكُنْ فِي صَدْرِكَ حَرَجٌ } ضيق وتعب حاصل { مِّنْهُ } أي: من نشره وتبيلغه مخافة الأعداء بل إنما أنزل إليك { لِتُنذِرَ بِهِ } أي: بإنذاراته وتخوفاته كم ضل عن طريق الحق\n وأعرض عنه جهلاً وعناداً { وَ } تذكر بمواعيده وتبشيراته من وفق بتذكر الموطن الأصلي والمنزل الحقيقي\n إذ هو { ذِكْرَىٰ لِلْمُؤْمِنِينَ } [الأعراف: 2] الموقنين بوحدة الحق المتوجهين نحوه بالعزيمة الصحيحة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { كتاب }: خبر، أي: هذا كتاب، و { أُنزل }: صفته، والحرج: الضيق، و { لتنذر }: متعلق بأُنزل، أو بلا يكن، لأنه إذا أيقن أنه من عند الله جسر على الإنذار، وكذا إذا لم يخفهم، و { ذكرى }: يحتمل النصب بإضمار فعل، أي: لتُنذر ولتذكر ذكرى، والجر عطف على { لتنذر } ، أي: للإنذار والتذكير، والرفع عطف على { كتاب }. يقول الحقّ جلّ جلاله: هذا { كتابٌ أُنزل إليك } من ربك، { فلا يكن في صدرك حرجٌ منه } أي: ضيق وثقل من أجل تبليغه لمن يُكذب به، مخافة أن تكذّب فيه، أو مخافة أن تقصر على القيام بتبليغه، أو بحقوقه، وتوجيه النهي إلى الحرج للمبالغة، كقولك: لا أرينك ها هنا، كأنه قال: فلا يحرج صدرك منه، وإنما أنزلناه إليك لتُنذر به من بلغه، { وذكرى للمؤمنين } أي: وتذكيرًا وموعظة للمؤمنين لأنهم هم المنتفعون بمواعظة. الإشارة: تذكير أهل الإنكار ووعظهم يحتاج إلى سياسة كبيرة وحلم كبير وصبر عظيم، لا يطيقه إلا الأكابر من أهل العلم بالله كالأنبياء والصديقين، لسعة معرفتهم، واتساع صدورهم لحمل الجفاء وتحمل الأذى، ونهيه تعالى لنبيه ـ عليه الصلاة والسلام ـ عن ضيق صدره: تشريع لورثته من بعده الداعون إلى الله ـ عز وجل ـ وإلاَّ فهو صلى الله عليه وسلم بحر واسع، لا تكدره الدِّلاءُ، كما قال البوصيري.\nوالله تعالى أعلم. ثم حضَّ على الإتباع، فقال: { ٱتَّبِعُواْ مَآ أُنزِلَ إِلَيْكُمْ مِّن رَّبِّكُمْ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "4:65",
      "similarity": 0.5693073767076422
    },
    {
      "verse": "33:38",
      "similarity": 0.43112349555001195
    },
    {
      "verse": "9:91",
      "similarity": 0.4110743447388337
    },
    {
      "verse": "48:17",
      "similarity": 0.35108580566651004
    },
    {
      "verse": "22:78",
      "similarity": 0.3040954665890867
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007002.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007002.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:2.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}