{
  "chapter": "الأعراف",
  "text": "كتب انزل اليك فلا يكن فى صدرك حرج منه لتنذر به وذكرى للمؤمنين",
  "translations": [
    {
      "translation": "It is a Book sent down to you - so let there be no constriction in your breast because of it so that you can give warning by it and as a reminder to the muminun.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Book has been sent down to you; so do not hesitate to warn (the unbelievers) through it, and remind the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a Book revealed to you. Let there be no impediment in your heart about it. (It has been revealed to you) that you may thereby warn [the unbelievers], that it may be a reminder to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A book has been revealed to you, (Muhammad). You should not hesitate to convey its warning and its good advice to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O dear Prophet (Mohammed – peace and blessings be upon him), a Book has been sent down upon you, therefore may not your heart be disinclined towards it, so that you may give warning with it, and as an advice for the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is the) Book (the Qur'an) sent down unto you, so let not your breast be narrow therefrom, that you warn thereby; and a reminder unto the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Book revealed to you-- so let there be no straitness in your breast on account of it-- that you may warn thereby, and a reminder close to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Book sent down to thee -- so let there be no impediment in thy breast because of it -- to warn thereby, and as a reminder to believers:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(It is) a Scripture that is revealed unto thee (Muhammad) - so let there be no heaviness in thy heart therefrom - that thou mayst warn thereby, and (it is) a Reminder unto believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This Book has been sent down to you, let there be no heaviness in your heart about it, so that you may warn by means of it and it is a reminder to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "This is a Book sent down toward thee: so let there be no straitness in thy breast therefor: that thou mayest warn thereby! and this is an admonition unto the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This is] a Book that has been sent down to you—so let there be no disquiet in your heart on its account that you may warn thereby—and as an admonition for the faithful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Book revealed unto thee,- So let thy heart be oppressed no more by any difficulty on that account,- that with it thou mightest warn (the erring) and teach the Believers).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(This is the) Book (the Quran) sent down unto you (O Muhammad SAW), so let not your breast be narrow therefrom, that you warn thereby, and a reminder unto the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Book has been sent down to you; so let your chest have no constriction because of it, in order to warn thereby and as a reminder to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A Scripture was revealed to you, so let there be no anxiety in your heart because of it. You are to warn with it—and a reminder for the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[This is] a Book revealed to you, [O Muhammad] - so let there not be in your breast distress therefrom - that you may warn thereby and as a reminder to the believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:2] This is, a Book that is revealed to you — addressing the Prophet (s) — so let there be no inhibition, [no] constraint, in your breast because of it, to convey it — for fear that you might be called a liar — that you may warn thereby (li-tundhira, ‘that you may warn’, is semantically connected to unzila, ‘is revealed’, that is to say, ‘[it is revealed] for [the purposes of] warning’) and as a reminder for those who believe, in it.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((It is) a Scripture) this Scripture, i.e. the Qur'an (that is revealed unto thee (Muhammad)) that Gabriel brought to you (so let there be no heaviness in thy heart) let there be no doubt in your heart (therefrom) i.e. there can be no doubt about the Qur'an being from Allah (that thou mayst warn thereby) that you may warn the people of Mecca through the Qur'an in order that they believe, (and (it is) a Reminder unto believers).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَلاَ يَكُنْ فِي صَدْرِكَ حَرَجٌ مِّنْهُ } معناهُ ضِيقٌ ويقالُ: شكٌ\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ المص كتاب أُنزل إليكَ } - إلى قوله - { ذكرى للمؤمنين } ا إشارة إلى الذات الأحدية، و ل إلى الذات مع صفة العلم كما مرّ، و م إلى التميمة الجامعة التي هي معنى محمد، أي: نفسه وحقيقته، و ص إلى الصورة المحمدية التي هي جسده وظاهره\n وعن ابن عباس، أنه قال صلى الله عليه وسلم:\n\n \" جبل بمكة كان عليه عرش الرحمن حين لا ليل ولا نهار \" \n\n، أشار بالجبل إلى جسد محمد، وبعرش الرحمن إلى قلبه\n كما ورد في الحديث:\n\n \" قلب المؤمن عرش الله \" \n\nوجاء:\n\n \" لا يسعني أرضي ولا سمائي، ويسعني قلب عبدي المؤمن \" \n\nوقوله:\n\n \" حين لا ليل ولا نهار \" \n\nإشارة منه إلى الوحدة، لأن القلب إذا وقع في ظل أرض النفس واحتجب بظلمة صفاتها كان في الليل، وإذا طلع عليه نور شمس الروح واستضاء بضوئه كان في النهار، وإذا وصل إلى الوحدة الحقيقية بالمعرفة والشهود الذاتي واستوى عنده النور والظلمة كان وقته لا ليلاً ولا نهاراً، ولا يكون عرش الرحمن إلا في هذا الوقت\n فمعنى الآية: إنّ وجود الكلّ من أوله إلى آخره { كتاب أُنْزِل إليك } أي: أنزل إليك علمه { فلا يكن في صدرك حرج منه } أي: ضيق من حمله، فلا يسعه لعظمته فيتلاشى بالفناء في الوحدة والاستغراق في عين الجمع والذهول عن التفصيل، إذ كان عليه السلام في مقام الفناء محجوباً بالحق عن الخلق كلما رد عليه الوجود، وحجب عنه الشهود الذاتي وظهر عليه بالتفصيل، ضاق عنه وعاؤه وارتكب عليه وزر وثقل، ولهذا خوطب بقوله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ كِتَابٌ } جامع لجميع فوائد الكتب المنزلة وأحكامها وإشاراتها، ناطق بجميع الأحوال الواقعة في النشأة الأولى والأخرى { أُنزِلَ إِلَيْكَ } يا هادي المضلين تقوية لك وترويجاً لما أمرت به { فَلاَ يَكُنْ فِي صَدْرِكَ حَرَجٌ } ضيق وتعب حاصل { مِّنْهُ } أي: من نشره وتبيلغه مخافة الأعداء بل إنما أنزل إليك { لِتُنذِرَ بِهِ } أي: بإنذاراته وتخوفاته كم ضل عن طريق الحق، وأعرض عنه جهلاً وعناداً { وَ } تذكر بمواعيده وتبشيراته من وفق بتذكر الموطن الأصلي والمنزل الحقيقي؛ إذ هو { ذِكْرَىٰ لِلْمُؤْمِنِينَ } [الأعراف: 2] الموقنين بوحدة الحق المتوجهين نحوه بالعزيمة الصحيحة\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { كتاب }: خبر، أي: هذا كتاب، و { أُنزل }: صفته، والحرج: الضيق، و { لتنذر }: متعلق بأُنزل، أو بلا يكن، لأنه إذا أيقن أنه من عند الله جسر على الإنذار، وكذا إذا لم يخفهم، و { ذكرى }: يحتمل النصب بإضمار فعل، أي: لتُنذر ولتذكر ذكرى، والجر عطف على { لتنذر } ، أي: للإنذار والتذكير، والرفع عطف على { كتاب }\n يقول الحقّ جلّ جلاله: هذا { كتابٌ أُنزل إليك } من ربك، { فلا يكن في صدرك حرجٌ منه } أي: ضيق وثقل من أجل تبليغه لمن يُكذب به، مخافة أن تكذّب فيه، أو مخافة أن تقصر على القيام بتبليغه، أو بحقوقه، وتوجيه النهي إلى الحرج للمبالغة، كقولك: لا أرينك ها هنا، كأنه قال: فلا يحرج صدرك منه، وإنما أنزلناه إليك لتُنذر به من بلغه، { وذكرى للمؤمنين } أي: وتذكيرًا وموعظة للمؤمنين لأنهم هم المنتفعون بمواعظة\n الإشارة: تذكير أهل الإنكار ووعظهم يحتاج إلى سياسة كبيرة وحلم كبير وصبر عظيم، لا يطيقه إلا الأكابر من أهل العلم بالله كالأنبياء والصديقين، لسعة معرفتهم، واتساع صدورهم لحمل الجفاء وتحمل الأذى، ونهيه تعالى لنبيه ـ عليه الصلاة والسلام ـ عن ضيق صدره: تشريع لورثته من بعده الداعون إلى الله ـ عز وجل ـ وإلاَّ فهو صلى الله عليه وسلم بحر واسع، لا تكدره الدِّلاءُ، كما قال البوصيري\n\n",
      "translations": []
    }
  ]
}