{
  "chapter": "الأعراف",
  "text": "واذا لم تاتهم بـاية قالوا۟ لولا اجتبيتها قل انما اتبع ما يوحى الى من ربى هذا بصائر من ربكم وهدى ورحمة لقوم يؤمنون",
  "translations": [
    {
      "translation": "If you do not bring them a Sign, they say, 'Why have you not come up with one?' Say, 'I follow only what has been revealed to me from my Lord.' This is clear insight from your Lord, and guidance and mercy, for people who have iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you do not bring a (Qur'anic) verse to them, they say: \"Why don't you make one up?\" Say: \"I follow only what my Lord reveals to me.\" These (revelations) are an evident proof from your Lord, and a guidance and grace for those who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[O Prophet!] When you do not produce before them any miracle, they say: 'Why do you not choose for yourself a miracle?' Say to them: 'I follow only what is revealed to me by my Lord. This is nothing but a means of insight into the truth, and guidance and mercy from your Lord to the people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you, (Muhammad), do not show them a miracle, they will keep on insisting that you must show them one. Say, \"I only follow what is revealed to me from my Lord. This (Quran) contains wisdom for you from your Lord. It contains guidance and mercy for those who have faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O dear Prophet (Mohammed – peace and blessings be upon him) when you do not bring to them a verse, they say, “Why did you not fabricate it?” Say, “I follow only what is divinely revealed to me from my Lord”; this (the Holy Qur’an) is an enlightenment from your Lord, and a guidance and a mercy for the Muslims.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you do not bring them a miracle, they say: \"Why have you not brought it\" Say: \"I but follow what is revealed to me from my Lord. This (the Qur'an) is nothing but evidences from your Lord, and a guidance and a mercy for a people who believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you bring them not a revelation they say: Why do you not forge it? Say: I only follow what is revealed to me from my Lord; these are clear proofs from your Lord and a guidance and a mercy for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thou bringest them not a sign, they say, 'Why hast thou not chosen one?' Say: 'I follow only what is revealed to me from my Lord; this is clear testimony from your Lord, guidance, and mercy for a people of believers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when thou bringest not a verse for them they say: Why hast thou not chosen it? Say: I follow only that which is inspired in me from my Lord. This (Qur'an) is insight from your Lord, and a guidance and a mercy for a people that believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you do not bring them a sign, they say, \"Why do you not invent one?\" Say, \"I follow only what is revealed to me by my Lord. This Book is an enlightenment from your Lord and a guide and mercy to true believers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever thou bringest not unto them, as a sign, they say: wherefore hast not thou selected it? Say thou: I only follow that which hath been revealed unto me by my Lord. This is an enlightenment from your Lord and a guidance and a mercy unto a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you do not bring them a sign, they say, ‘Why do you not improvise one?’ Say, ‘I only follow what is revealed to me from my Lord; these are insights from your Lord, and a guidance and mercy for a people who have faith.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If thou bring them not a revelation, they say: \"Why hast thou not got it together?\" Say: \"I but follow what is revealed to me from my Lord: this is (nothing but) lights from your Lord, and Guidance, and mercy, for any who have faith.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if you do not bring them a miracle [according to their (i.e. Quraish-pagans') proposal], they say: \"Why have you not brought it?\" Say: \"I but follow what is revealed to me from my Lord. This (the Quran) is nothing but evidences from your Lord, and a guidance and a mercy for a people who believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When you do not bring them a verse, they say, 'Why have you not chosen one' Say: 'I follow only what is revealed to me from my Lord. This (Koran) is a veritable proof from your Lord, guidance and mercy for people who believe'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you do not produce a miracle for them, they say, “Why don’t you improvise one.” Say, “I only follow what is inspired to me from my Lord.” These are insights from your Lord, and guidance, and mercy, for a people who believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when you, [O Muhammad], do not bring them a sign, they say, \"Why have you not contrived it?\" Say, \"I only follow what is revealed to me from my Lord. This [Qur'an] is enlightenment from your Lord and guidance and mercy for a people who believe.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:203] And when you do not bring them, that is, the people of Mecca, a sign, from among those which they request, they say, ‘Why have you not chosen one?’, [why have you not] produced one [all by] yourself? Say, to them: ‘I follow only that which is revealed to me from my Lord, and it is not for me to bring anything from myself; this, Qur’ān, is insight, proofs, from your Lord, and a guidance and a mercy for a people who believe’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when thou bringest not a verse for them) i.e. the people of Mecca, as they request (they say: Why hast thou not chosen it?) why not take it upon yourself to bring it from Allah?; It is also said that this means: why do you not invent it yourself? (Say) to them, Muhammad: (I follow only that which is inspired in me from my Lord) I do and say only that which is revealed to me from my Lord. (This) Qur'an (is insight) an exposition (from your Lord) detailing commands and prohibitions, (and a guidance) and a guidance from error (and a mercy) preventing from punishment (for a people that believe) in the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { لَوْلاَ ٱجْتَبَيْتَهَا } معناهُ هلاَّ تَلقيتَها مِن رَبِّكَ\n ويقالُ هلاّ جِئتَ بِهَا مِن رَبِّكَ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Were it not that I have chosen her} [means]: Would you not have found her [to be] from your Lord?\n\n\n{Welcome!} Did you bring it with you from your lord?",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n ونهاية غراقتهم فيه { إِذَا لَمْ تَأْتِهِمْ } يا أكمل الرسل { بِآيَةٍ } اقترحوها منك\n عناداً { قَالُواْ } على سبيل التهكم والاستهزاء: { لَوْلاَ ٱجْتَبَيْتَهَا } أي: هل انتخبتها من الأقوال وأنشأئها كسائر منشآتك\n أعجزت فيها؟ فإن أعجزت لِمَ لَمْ تطلبها من ربك على مقتضى دعوانك\n كما طلبت غيرها منه؟\n\n{ قُلْ } في جوابهم: ما أنا مختلق\n بل رسول مبلغ إِنَّمَآ أَتَّبِعُ مَا يِوحَىٰ إِلَيَّ مِن رَّبِّي { } الذي هو مرسلي ومبلغي\n ما لي صنع في نظمه وتأليفه\n وبلاغته وفصاحته وإعجازه\n بل { هَـٰذَا } أي: القرآن وما فيه من الرموز والإشارات { بَصَآئِرُ } للمستبصرين المستكشفين بمقتضى الودائع الفطرية التي أودعها الله في قلوب عباده\n ومتى انكشفتهم بودائعكم علمتم أنها { مِن رَّبِّكُمْ وَهُدًى } يوصلكم إلى ما جبلتم لأجله\n وهو التوحيد والعرفان { وَرَحْمَةً } نازلة لكم من الله يوفظكم عن نومه الغفلة والنسيان\n كل ذلك { لِّقَوْمٍ يُؤْمِنُونَ } [الأعراف: 203] أي: يتحققون بمرتبة اليقين العلمي\n ويطلبون الترقي منها إلى العين والحق\n\n\nحققنا بلطفك بحقيتك\n وخلصنا من هويتنا الباطلة بفضلك وجودك يا أرحم الراحمين",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "يقول الحقّ جلّ جلاله: { وإذا لم تأْتِهم } أي: الكفار، { بآية } بمعجزة مما اقترحوا، أو من القرآن حين يتأخر الوحي، { قالوا لولا } هلا { اجتبيتها } أي: تخيرتها وطلبتها من ربك، أو هلا اخترعتها وتقولتها من نفسك كسائر ما تقرأ؟ { قل إِنما أَتبع ما يُوحى إليَّ من ربي } فلا أطلب منه آية،\n[الكهف:29]، أو: لا أخترع القرآن من عند نفسي، بل أَتبع ما يُوحى إليَّ من ربي. { هذا } القرآن { بصائرُ } للقلوب { من ربكم } ، أي: من عند ربكم، بها تُبصر الحق وتُدرك الصواب، { وهُدىً ورحمةٌ لقوم يؤمنون } وإرشاد أو طمأنينة لقلوب المؤمنين. الإشارة: قد تقدم مرارًا ما في طلب الآيات من ضعف اليقين، وعدم الصدق بطريق المقربين، وإنما على الأولياء أن يقولوا: { هذا بصائر من ربكم وهدى ورحمة لقوم يُؤمنون } بطريق المخصوصين. وبالله التوفيق. ثم أمر بالإنصات للقرآن، الذي هو أعظم الآيات، فقال: { وَإِذَا قُرِىءَ ٱلْقُرْآنُ فَٱسْتَمِعُواْ لَهُ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "68:50",
      "similarity": 0.6849525649408851
    },
    {
      "verse": "20:122",
      "similarity": 0.6784562069528238
    },
    {
      "verse": "16:121",
      "similarity": 0.6302776268324155
    },
    {
      "verse": "6:87",
      "similarity": 0.5749571001846304
    },
    {
      "verse": "12:6",
      "similarity": 0.35025777118202883
    }
  ],
  "audio": [
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hafs/7:203.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/warsh/7:203.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:203.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}