{
  "chapter": "الأعراف",
  "text": "واما ينزغنك من الشيطن نزغ فاستعذ بالله انه سميع عليم",
  "translations": [
    {
      "translation": "If an evil impulse from Shaytan provokes you, seek refuge in Allah. He is All-Hearing, All-Seeing.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If you are instigated by the Devil to evil seek refuge in God, for God hears all and knows everything.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if it happens that a prompting from Satan should stir you up, seek refuge with Allah. He is All-Hearing, All-Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If Satan will try to seduce you, seek refuge from God. God is All-hearing and All-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And O listener! If the devil provokes you, seek the refuge of Allah; indeed He is All Hearing, All Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if an evil whisper comes to you from Shaytan, then seek refuge with Allah. Verily, He is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a false imputation from the Shaitan afflict you, seek refuge in Allah; surely He is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a provocation from Satan should provoke thee, seek refuge in God; He is All-hearing, All-seeing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if a slander from the devil wound thee, then seek refuge in Allah. Lo! He is Hearer, Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If an evil impulse from Satan provokes you, seek refuge with God; He is all hearing, and all knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if there prompt thee a prompting from the Satan, see refugee with Allah; verily He is Hearing, Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Should a temptation from Satan disturb you, invoke the protection of Allah; indeed He is all-hearing, all-knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If a suggestion from Satan assail thy (mind), seek refuge with Allah; for He heareth and knoweth (all things).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if an evil whisper comes to you from Shaitan (Satan) then seek refuge with Allah. Verily, He is All-Hearer, All-Knower.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When satan provokes you seek refuge in Allah; He is the Hearing, the Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when a suggestion from Satan assails you, take refuge with God. He is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And if an evil suggestion comes to you from Satan, then seek refuge in Allah. Indeed, He is Hearing and Knowing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:200] And if (immā: the letter nūn of the conditional particle in, ‘if’, has been assimilated with the extra mā, ‘any’) any insinuation from Satan should provoke you, that is, if anything should turn you away from that which you have been commanded to do, then, seek refuge in God (fa’sta‘idh bi’Llāh is the response to the conditional clause, with the response to the command being omitted), and He will ward it off from you, He is Hearing, of what is said, Seeing, of what is done.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "This turning away from the ignorant was then abrogated, (And if a slander) whispering or doubt (from the devil wound thee) befalls you, (then seek refuge in Allah) seek Allah's protection from his whispering. (Lo! He is Hearer) of your seeking refuge in Him, (Knower) of his whispering.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَإِماَّ يَنَزَغَنَّكَ مِنَ ٱلشَّيْطَانِ نَزْغٌ } معناهُ يَسَخِفنَّكَ مَنهُ خِفةً وعَجلةً\n ونَزَغَ الشَّيطانِ: الإِفْسادُ بَينَ النَّاسِ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the saying of the Most High: {And if the devil should tempt you with a temptation} means that he will tempt you with fear and haste.\n\n\nAnd Satan sows discord: corruption between people.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِماَّ يَنزَغَنَّكَ } ينخسنَّك ويشوشنَّك { مِنَ ٱلشَّيْطَٰنِ } المثير للقوى الغضبية والحمية الجاهلية { نَزْغٌ } وسوسة وإغراء يحملك على الغضب\n ويخرجك عن مقتضى ما أمرت به من الحلم والملاينة { فَٱسْتَعِذْ بِٱللَّهِ } من غوائله\n وارجع إليه من وسوسته وتحايله يكفيك سبحانه مؤمنة شروره وإغوائه { إِنَّهُ } سبحانه بذاته { سَمِيعٌ } لمناجاتك { عَلِيمٌ } [الأعراف: 200] بحاجاتك",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإِمَا يَنزَغَنَّك من الشيطان نَزغٌ } ينخسنك منه نخس، أي: وسوسة تحملك على خلاف ما أمرت به كاعتراء غضب، ومقابلة سفيه، { فاستعذ بالله } والتجىء إليه { إنه سميعٌ عليمٌ } يسمع استعاذتك، ويعلم ما فيه صلاح أمرك، فالاستعاذة عند تحريك النفس مشروعة، وفي الحديث: أن رجلاً اشتد غضبه، فقال صلى الله عليه وسلم:\n\n \" إنّي لأَعلَمُ كلِمة لو قالَهَا لذَهَبَ عنهُ ما به أعُوذُ باللهِ من الشَّيْطَانِ الرَّجِيمِ \"\n \n\nالإشارة: كل ما أمر به الرسول صلى الله عليه وسلم تُؤمر به أمته، وخصوصًا ورثته من الصوفية، فهم مطالبون بالتخلق بأخلاقه صلى الله عليه وسلم أكثر من غيرهم، لأن غيرهم لم يبلغ درجتهم\n وقال الورتجبي: { خذ العفو }: أي: فاعف عنهم من قلة عرفانهم حقك، { وأمر العُرف } أي: تلطف عليهم في أمرك ونهيك لهم، فإنهم ضعفاء عن حمل وارد أحكام شرائعك وحقائقك، { وأعرِض عن الجاهلين } الذي ليس لهم استعداد النظر إليك، ولا يعرفون حقوقك، فإنَّ منكر معجزات أنبيائي وكرامات أوليائي لا يبلغ إلى درجة القوم\n قال بعض المشايخ ـ حين ذكر أهل الظاهرـ: دع هؤلاء الثقلاء\n هـ\n فوصف علماء الظاهر بالثقلاء لثقل ظهورهم بعلم الرسوم، فلم ينهضوا إلى حقائق العلوم ودقائق الفهوم، وفي تائية ابن الفارض:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "41:36",
      "similarity": 0.9145242430190984
    },
    {
      "verse": "17:53",
      "similarity": 0.8372092788094889
    },
    {
      "verse": "12:100",
      "similarity": 0.48500883261113165
    },
    {
      "verse": "19:18",
      "similarity": 0.29709560848924593
    },
    {
      "verse": "16:98",
      "similarity": 0.2963248902973658
    }
  ]
}