{
  "chapter": "الأعراف",
  "text": "واذكر ربك فى نفسك تضرعا وخيفة ودون الجهر من القول بالغدو والءاصال ولا تكن من الغفلين",
  "translations": [
    {
      "translation": "Remember your Lord in yourself humbly and fearfully, without loudness of voice, morning and evening. Do not be one of the unaware.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Meditate on your Lord inwardly with humility and trepidation, reciting His Book softly, morning and evening, and be not negligent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember [O Prophet] your Lord in your mind, with humility and fear, and without raising your voice; remember Him in the morning and evening, and do not become of those who are negligent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember your Lord deep within yourselves, humbly and privately - instead of shouting out loud - (in prayer) in the mornings and evenings and do not be of the heedless ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember your Lord within your hearts humbly and with fear, and softly with your tongues, morning and evening, and do not be of the neglectful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember your Lord within yourself, humbly and with fear and without loudness in words in the mornings and in the afternoons, and be not of those who are neglectful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember your Lord within yourself humbly and fearing and in a voice not loud in the morning and the evening and be not of the heedless ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember thy Lord in thy soul, humbly and fearfully, not loud of voice, at morn and eventide. Be not thou among the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do thou (O Muhammad) remember thy Lord within thyself humbly and with awe, below thy breath, at morn and evening. And be not thou of the neglectful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember your Lord deep in your very soul, in all humility and awe, without raising your voice, morning and evening, do not be one of the heedless,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember thou thy Lord within thyself with humility and fear, without loudness in word, in the morning and evenings; and be thou not of the negligent.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember your Lord within your heart beseechingly and reverentially, without being loud, morning, and evening, and do not be among the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And do thou (O reader!) Bring thy Lord to remembrance in thy (very) soul, with humility and in reverence, without loudness in words, in the mornings and evenings; and be not thou of those who are unheedful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember your Lord by your tongue and within yourself, humbly and with fear without loudness in words in the mornings, and in the afternoons and be not of those who are neglectful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Remember your Lord in your soul with humility and fear, and not with a loud voice, morning and evening, and do not be among the inattentive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember your Lord within yourself, humbly and fearfully, and quietly, in the morning and the evening, and do not be of the neglectful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And remember your Lord within yourself in humility and in fear without being apparent in speech - in the mornings and the evenings. And do not be among the heedless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:205] And remember your Lord within yourself, that is, secretly, humbly, submissively, and fearfully, in awe of Him, and, louder than [speaking] in secret, more quietly than speaking out loud, that is, a middle way between the two, at morning and evening, at the beginning of the day and at its end. And do not be among the heedless, of God’s remembrance.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nإقبال بالخطاب على النبي صلى الله عليه وسلم فيما يختص به ، بعد أن أمر بما أمر بتبليغه من الآيات المتقدمة ، والمناسبة في هذا الانتقال أن أمر الناس باستماع القرآن يستلزم أمر الرسول عليه الصلاة والسلام بقراءة القرآن عليهم قراءة جهرية يسمعونها ، فلما فرغ الكلام من حظ الناس نحو قراءة الرسول عليه الصلاة والسلام ، أقبل على الكلام في حظ الرسول صلى الله عليه وسلم من القرآن وغيره ، وهو التذكر الخاص به ، فأمر بأن يذكر الله ما استطاع وكيفما تسنى له ، وفي أوقات النهار المختلفة ، فجملة { واذكر ربك } معطوفة على الجمل السابقة من قوله : { إن وليي الله } \\[ الأعراف : 196 \\] إلى هنا .والنفس اسم للقوة التي بها الحياة ، فهي مرادفة الروح ، وتطلق على الذات المركبة من الجسد والروح ، ولكون مقر النفس في باطن الإنسان أطلقت على أمور باطن الإنسان من الإدراك والعقل كما في قوله تعالى حكاية عن عيسى { تعلم ما في نفسي } \\[ المائدة : 116 \\] وقد مضى في سورة المائدة ، ومن ذلك يتطرق إلى إطلاقها على خويصة المرء ، ومنه قوله في الحديث القدسي في «صحيح البخاري» \" وإن ذكرني في نفسه ذكرتُه في نفسي وإن ذكرني في ملإٍ ذكرته في ملإٍ خيرِ منهم \" فقابل قوله : في نفسه بقوله : في ملإ .والمعنى : اذكر ربك وأنت في خلوتك كما تذكره في مجامع الناس .والذكر حقيقة في ذكر اللسان ، وهو المراد هنا ، ويعضده قوله : { ودونَ الجهر من القول } وذلك يشمل قراءة القرآن وغيرَ القرآن من الكلام الذي فيه تمجيد الله وشكره ونحو ذلك ، مثل كلمة التوحيد والحوقلة والتسبيح والتكبير والدعاء ونحو ذلك .و«التضرع» التذلل ولما كان التذلل يستلزم الخطاب بالصوت المرتفع في عادة العرب كني بالتضرع عن رفع الصوت مراداً به معناه الأصلي والكنائي ، ولذلك قوبل بالخُفيه في قوله { ادعوا ربكم تضرعاً وخفيةً } في أوائل هذه السورة ( 55 ) وقد تقدم .وقوبل التضرع هنا بالخيفة وهي اسم مصدر الخوف ، فهو من المصادر التي جاءت على صيغة الهيئة وليس المراد بها الهيئة ، مثل الشدة ، ولما كانت الخيفة انفعالا نفسياً يجده الإنسان في خاصة نفسه كانت مستلزمة للتخافت بالكلام خشية أن يَشعُر بالمرء من يخافه . فلذلك كني بها هنا عن الإسرار بالقول مع الخوف من الله ، فمقابلتُها بالتضرع طباق في معنيي اللفظين الصريحين ومعنييهما الكناءين ، فكأنه قيل تضرعاً وإعلاناً وخيفة وإسراراً .وقوله : ودون الجهر من القول } هو مقابل لكل من التضرع والخيفة وهو الذكر المتوسط بين الجهر والإسرار ، والمقصود من ذلك استيعاب أحوال الذكر باللسان ، لأن بعضها قد تكون النفس أنشط إليه منها إلى البعض الآخر .و ( الغُدو ) اسم لزمن الصباح وهو النصف الأول من النهار .و ( الآصال ) جمع أصيل وهو العشي وهو النصف الثاني من النهار إلى الغروب .والمقصود استيعاب أجزاء النهار بحسب المتعارف ، فأما الليل فهو زمن النوم ، والأوقات التي تحصل فيها اليقظة خصت بأمر خاص مثل قوله تعالى : { قم الليل إلا قليلاً } \\[ المزمل : 2 \\] على أنها تدخل في عموم قوله : { ولا تكن من الغافلين }.فدل قوله : { ولا تكن من الغافلين } على التحذير من الغفلة عن ذكر الله ولاحد للغفلة ، فإنها تحدد بحال الرسول صلى الله عليه وسلم وهو أعلم بنفسه . فإن له أوقاتاً يتلقى فيها الوحي وأوقات شؤون جِبِلّية كالطعام .وهذا الأمر خاص بالرسول عليه الصلاة والسلام ، وكل ما خص به الرسول عليه الصلاة والسلام من الوجوب يستحسن للأمة اقتداؤهم به فيه إلا ما نهوا عنه مثل الوصال في الصوم .وقد تقدم أن نحو { ولا تكن من الغافلين } أشد في الانتفاء وفي النهي من نحو : ولا تغفل ، لأنه يفرض جماعة يحق عليهم وصف الغافلين فيحذر من أن يكون في زمرتهم وذلك أبْين للحالة المنهي عنها .\n\n",
      "translations": [
        {
          "translation": "(And do thou (0 Muhammad) remember thy Lord within thyself) recite alone by yourself, O Muhammad, if you are leading the prayer (humbly and with awe, below your breath) avoiding to raise your voice too loudly or lowering it too much, (at morn and evening) during the morning prayer and in evening prayer: Maghrib and 'Isha'. (And be you not of the neglectful) of reciting the Qur'an in prayers whether you are praying alone or leading the prayer.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n فقال: { وَٱذْكُر } أي: تذكر وتحقق { رَّبَّكَ } الذي أظهرك على صورته { فِي نَفْسِكَ } إذ أنت ظاهره { تَضَرُّعاً وَخِيفَةً } متضرعاً متجنباً\n خائفاً عن غفلة الناسوت { وَدُونَ ٱلْجَهْرِ مِنَ ٱلْقَوْلِ } إخفاءً من المحجوبين الجاهلين برتبتك\n وغيرةً عليه سبحانه { بِٱلْغُدُوِّ وَٱلآصَالِ } أي: بجميع أوقاتك التي جرى عليك على مقتضى بشرتيك { وَ } بالجملة: { لاَ تَكُنْ مِّنَ ٱلْغَافِلِينَ } [الأعراف: 205] لتحققك في مقام الشهود\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: لنبيه صلى الله عليه وسلم ولمن تبعه: { واذكر ربك في نفسك } أي: في قلبك بحركة لسان القلب\n أو في نفسك سرًا بحركة لسان الحس\n { تضرُّعًا وخِيفَةً } أي: متضرعًا وخائفًا\n { ودونَ الجهر من القول } أي: متكلمًا كلامًا فوق السر ودون الجهر\n فإنه أدخل في الخشوع والإخلاص\n ولا حجة فيه لمن منع الذكر جهرًا لأن الآية مكية حين كان الكفر غالبًا\n فكانوا يسبون الذاكر والمذكور\n ولما هاجر المصطفى ـ عليه الصلاة والسلام ـ إلى المدينة\n جهر الصحابةُ بالتكبير والذكر\n فالآية منسوخة\n انظر: الحاوي في الفتاوى للإمام السيوطي\n فقد أجاب عن الآية بأجوبة\n فقوله: { بالغُدوِّ والآصال } أي: في الصباح والعشي\n حين تتيقظ من نومك الشبيه بالبعث\n وحين تريد النوم الشبيه بالموت\n وقيل: المراد صلاةَ العصر والصبح\n وقيل: صلاةَ المسلمين\n قبل فرض الخمس\n وقيل: للاستغراق\n وإنما خص الوقتين لأنهما محل الاشتغال\n فأولى غيرهما\n { ولا تكن من الغافلين } عن ذكر الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "24:36",
      "similarity": 0.508834973612299
    },
    {
      "verse": "13:15",
      "similarity": 0.49577112338231655
    },
    {
      "verse": "88:6",
      "similarity": 0.43585259870820336
    },
    {
      "verse": "7:55",
      "similarity": 0.42456080155533954
    },
    {
      "verse": "6:42",
      "similarity": 0.42207401829498964
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007205.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007205.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:205.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}