{
  "chapter": "الأعراف",
  "text": "ان الذين عند ربك لا يستكبرون عن عبادته ويسبحونه وله يسجدون",
  "translations": [
    {
      "translation": "Those who are in the presence of your Lord do not consider themselves too great to worship Him. They glorify His praise and they prostrate to Him.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who are in the presence of your Lord are never too proud to worship and celebrate His praises, and bow in homage to Him'.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[The angels] who are near to Your Lord, never turn away from His service out of arrogance; they rather glorify Him and prostrate themselves before Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are near to your Lord do not disdain from worshipping Him. They glorify Him and prostrate themselves (in obedience to Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who are with your Lord are not conceited towards worshipping Him, and they proclaim His Purity and it is to Him they prostrate. (Command of Prostration # 1)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, those who are with your Lord (angels) are never too proud to perform acts of worship to Him, but they glorify His praise and prostrate themselves before Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who are with your Lord are not too proud to serve Him, and they declare His glory and prostrate in humility before Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who are with thy Lord wax not too proud to serve Him; they chant His praise, and to Him they bow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who are with thy Lord are not too proud to do Him service, but they praise Him and prostrate before Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[even] the ones [angels] who live in the presence of your Lord are not too proud to worship Him: they glorify Him and prostrate themselves before Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who are with thy Lord are not stiff-necked against His woorship, and they hallow, and unto Him they prostrate themselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who are [stationed] near your Lord do not disdain to worship Him. They glorify Him and prostrate to Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are near to thy Lord, disdain not to do Him worship: They celebrate His praises, and prostrate before Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely, those who are with your Lord (angels) are never too proud to perform acts of worship to Him, but they glorify His Praise and prostrate before Him.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are with your Lord are not too proud to worship Him. They exalt Him and to Him they prostrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are in the presence of your Lord are not too proud to worship Him. They recite His praises, and to Him they bow down.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who are near your Lord are not prevented by arrogance from His worship, and they exalt Him, and to Him they prostrate.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:206] Surely those who are with your Lord, namely, the angels, are not too proud, they do [not] disdain, to worship Him; they glorify Him, exalting Him as being transcendent above what does not befit Him, and to Him they prostrate, that is, they devote their submission and worship exclusively to Him: so be like them! Medinese, except for verses 30 to 36 inclusive, which are Meccan; it consists of 75 or 77 verses, and was revealed after [sūrat] al-Baqara. The Muslims fell into dispute over the spoils of [the battle of] Badr. The young men said, ‘These [spoils] should be ours because we hastened to join the fighting’, while the old men said, ‘We were your support, holding up the banners behind you; had you been exposed, you would have come back to us, so do not claim it as yours exclusively.’ Thus the following was revealed:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Lo! those who are with your Lord) i.e. the angels (are not too proud to do Him service) to obey Him and acknowledge their servitude to Him, (but they praise Him) they obey Him (and adore Him) and pray to Him, and Allah knows best'. And of the surah in which the spoils of war are mentioned, which is Medinan in its entirety-except for His saying: (O Prophet! Allah is sufficient for you and those who follow you of the believers) which was revealed in al-Bayda' at the Battle of Badr but before the fighting started-and consists of 75 verses, 1,130 words and 5,290 letters: Surah 8: The Spoils of War [al-Anfal) And of the surah in which the spoils of war are mentioned, which is Medinan in its entirety— except for His saying: (O Prophet! Allah is sufficient for you and those who follow you of the believers) which was revealed in al-Bayda' at the Battle of Badr but before the fighting started— and consists of 75 verses, 1,130 words and 5,290 letters:\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ إِنَّ ٱلَّذِينَ } حصلوا وتمكنوا { عِندَ رَبِّكَ لاَ يَسْتَكْبِرُونَ عَنْ عِبَادَتِهِ وَ } لا يلتفتون إلى ما سواه، بل { يُسَبِّحُونَهُ } أي: ينزهونه ويقدسونه عمَّا يصور لهم ويوهمهم منه سبحانه ناسوتهم { وَلَهُ يَسْجُدُونَ } [الأعراف: 206] بمقتضى لاهوتهم منسلخين عن هوياتهم الباطلة بلا التفات منه إلى ما خيلتهم ناوستهم أصلاً\n\n\n\n\nربنا اكشف عنا بفضلك حجب ناسوتنا، وحققنا بفضاء لاهوتك بمقتضى لاهوتهم\n\n\n\n\nخاتمة السورة\n\n\n\nعليك أيها المتوجه نحو القبلة الأحمدية والمقصد الأحدية المحمدية - هداك الله إلى سواء سبيله، وأوصلك إلى مقرك من التوحيد - أن تتوجه إلى فضاء قلبك وتتذكر ما فيه من ودائع ربك على وجه الخيرة والاستبصار، مجتنباً عما يشوشك من غبار الأغيار، معيراً بمعيار العبرة والاعتبار؛ بحث لا يلهبك عنها وسوسة الشيطان المكار، وتعزيرات الدنيا الغرار الغدار، لا يتيسر لك هذا إلا بتذكر ما في كتاب الله من المواعظ والأخبار والآثار وامتثال ما فيه من الأوامر والنواهي والتدبر في سرائرها، واستكشاف حكمها وأسرارها\n\n\n\n\nعليك أن تتوسل في استرشادك من كتاب الله إلى أحاديث رسوله صلى الله عليه وسلم؛ إذ هي مبيِّنة له، كاشفة عن سرائره ومرموزاته، موضحة لما فيه من الغوامض، متكفلة لحفظ عقيدتك عن التزلزل والانحراف عن جادة الهداية، موصلة لك بقدر قابليتك إلى مسالك مسائك التوحيد\n\n\n\n\nفلك أن تواظب على الاستفادة ناوياً في استفادتك استخلاص نفسك عن ربقة التقليد مستقبلاً في سلوكك إلى مقر المعرفة والتوحدي، مشمراً ذيلك عن جميع ما يعوقكم ويمنعك من لوازم بشريتك، ملتجئاً نحو الحق في جميع حالاتك، مستمداً في سلوكك هذا عن أرباب الولاء الوالهين في مطالعة جمال الله، والواصلين إلى فضاء وحدته وبقائه منخلعين عن جلباب ناسوتهم بالكلية؛ بحيث لا يلتفتون إلى مقتضيات بشريتهم أصلاً إلا البدلاء وهم الحائرون الحاضرون الوالهون، الواصلون الفانون الباقون، المتبدلون المتحققون\n\n[يونس: 62]\n\n\n\n\nربنا اجعلنا بفضلك من خدامهم وتراب أقدامهم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { إن الذين عند ربك } يعني ملائكة الملأ الأعلى، { لا يستكبرون عن عبادته ويُسبحونه } يُنزهونه عما لا يليق به، { وله يسجدون } أي: يخصونه بالعبادة والتذلل، لا يشركون به غيره، وهو تعريض بالكفار، وتحريض للمؤمنين على التشبه بالملأ الأعلى، ولذلك شرع السجود عند قراءتها\n وعن النبي صلى الله عليه وسلم قال:\n\n \" إذا قَرَأَ ابنُ آدمَ السجدةَ، فَسَجَدَ، اعتَزَلَ الشيْطَانُ يَبْكِي، يَقُولُ: يَا وَيْلهُ، أمِرَ هذا بالسُّجُودِ فَسَجَدَ فَلَهُ الجَنّةُ، وأُمِرْتُ بالسُجُودِ فعصَيت فَلِي النارُ \"\n \n\nالإشارة: اعلم أن الذكر على خمسة أقسام: ذكر اللسان فقط لعوام المسلمين، وذكر اللسان مع القلب، لخواص الصالحين وأول المتوجهين، وذكر القلب فقط للأقوياء من السائرين، وذكر الروح لخواص أهل الفناء من المُوحدين، وذكر السر لأهل الشهود والعيان من المتمكنين، وفي قطع هذه المقامات يقع السير للسائرين، فيترقى من مقام، إلى مقام، حتى يبلغ إلى ذكر السر، فيكون ذكر اللسان في حقه غفلة\n وفي هذا المقام قال الواسطي رضي الله عنه: الذاكرون في حال ذكره أشد غفلة من التاركين لذكره لأن ذكره سواه\n وفيه أيضًا قال الغزالي: ذكر اللسان يُوجب كثرة الذنوب\n وقال الشاعر:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:98",
      "similarity": 0.5685515797878988
    },
    {
      "verse": "53:62",
      "similarity": 0.5304551331267306
    },
    {
      "verse": "17:43",
      "similarity": 0.5002993699665436
    },
    {
      "verse": "50:40",
      "similarity": 0.4536644048287799
    },
    {
      "verse": "37:166",
      "similarity": 0.4290605423510567
    }
  ]
}