{
  "chapter": "الأعراف",
  "text": "فوسوس لهما الشيطن ليبدى لهما ما ورى عنهما من سوءتهما وقال ما نهىكما ربكما عن هذه الشجرة الا ان تكونا ملكين او تكونا من الخلدين",
  "translations": [
    {
      "translation": "Then Shaytan whispered to them, disclosing to them their private parts that had been concealed from them. He said, 'Your Lord has only forbidden you this tree lest you become angels or among those who live for ever.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan suggested (evil) to them, in order to reveal their hidden parts of which they were not aware (till then), and said: \"Your Lord has forbidden you (to go near) this tree that you may not become angels or immortal.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan made an evil suggestion to both of them that he might reveal to them their shame that had remained hidden from them. He said: 'Your Lord has forbidden you to approach this tree only to prevent you from becoming angels or immortals.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan tempted them to reveal that which was kept private from them and said, \"Your Lord has not prohibited you (to eat the fruits of this tree) unless you want to be angels or immortal.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan created apprehensions in their hearts in order to disclose to them matters of their shame which were hidden from them, and said, “Your Lord has forbidden you from this tree, for you may become angels or immortals.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Shaytan whispered suggestions to them both in order to uncover that which was hidden from them of their private parts (before); he said: \"Your Lord did not forbid you this tree save you should become angels or become of the immortals.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Shaitan made an evil suggestion to them that he might make manifest to them what had been hidden from them of their evil inclinations, and he said: Your Lord has not forbidden you this tree except that you may not both become two angels or that you may (not) become of the immortals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan whispered to them, to reveal to them that which was hidden from them of their shameful parts. He said, 'Your Lord has only prohibited you from this tree lest you become angels, or lest you become immortals.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan whispered to them that he might manifest unto them that which was hidden from them of their shame, and he said: Your Lord forbade you from this tree only lest ye should become angels or become of the immortals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan tempted them so that he might reveal to them their nakedness which had been hidden from them. He said, \"Your Lord has forbidden you to approach this tree lest you should become angels or become of the immortals,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Satan whispered unto the twain in order that he might discover unto the twain that which lay hidden from the twain of their shame, and said: your Lord forbade you not vender tree but lest ye twain should become angels or become of the abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan tempted them, to expose to them what was hidden from them of their nakedness, and he said, ‘Your Lord has only forbidden you from this tree lest you should become angels, or lest you become immortal.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then began Satan to whisper suggestions to them, bringing openly before their minds all their shame that was hidden from them (before): he said: \"Your Lord only forbade you this tree, lest ye should become angels or such beings as live for ever.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Shaitan (Satan) whispered suggestions to them both in order to uncover that which was hidden from them of their private parts (before); he said: \"Your Lord did not forbid you this tree save you should become angels or become of the immortals.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But satan whispered to them, so that he might reveal to them their shameful parts which had been hidden from them, he said: 'Your Lord has prohibited you from this tree lest you both become angels or become among the immortal'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan whispered to them, to reveal to them their nakedness, which was invisible to them. He said, “Your Lord has only forbidden you this tree, lest you become angels, or become immortals.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan whispered to them to make apparent to them that which was concealed from them of their private parts. He said, \"Your Lord did not forbid you this tree except that you become angels or become of the immortal.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:20] Then Satan, Iblīs, whispered to them that he might manifest, reveal, to them that which was hidden (wūriya: based on [the verbal form] fū‘ila and [derives] from [the infinitive] al-muwārā) to them of their shameful parts. And he said, ‘Your Lord prohibited you from this tree only, in aversion, lest you become angels (malakayn may also be read malikayn) or become immortals’, in other words, that is the necessary consequence of eating from it, as [is stated] in another verse: Shall I guide you to the Tree of Immortality and a kingdom that does not waste away? [Q. 20:120].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nكانت وسوسة الشّيطان بقرب نهي آدم عن الأكل من الشّجرة ، فعبّر عن القرب بحرف التّعقيب إشارة إلى أنّه قرب قريب ، لأنّ تعقيب كلّ شيء بحسبه .والوسوسة الكلام الخفي الذي لا يسمعه إلاّ المُداني للمتكلّم ، قال رؤبة يصف صائداً :وَسْوَسَ يَدعُو جاهداً ربّ الفلق ... سِرّاً وقد أوّنَ تَأوِينُ العُققوسمي إلقاء الشيطان وسوسة : لأنّه ألقَى إليهما تسويلاً خفياً من كلاممٍ كلمهما أو انفعاللٍ في أنفسهما . كهيئة الغاش الماكر إذْ يُخفِي كلاماً عَن الحاضرين كيلا يفسدوا عليه غشّه بفضح مضاره فألقى لهما كلاماً في صورة التّخافت ليوهمهما أنّه ناصح لهما وأنّه يخافت الكلام ، وقد وقع في الآية الأخرى التّعبير عن تسويل الشّيطان بالقول : { فوسوس إليه الشيطان قال يا آدم هل أدلّك على شجرة الخُلْد وملك لا يبلى } \\[ طه : 120 \\] ثمّ درج اصطلاح القرآن وكلام الرّسول عليه الصّلاة والسّلام على تسمية إلقاء الشّيطان في نفوس النّاس خواطرَ فاسدة ، وسوسة تقريباً لمعنى ذلك الإلقاء للأفهام كما في قوله : { من شر الوسواس الخنّاس } \\[ الناس : 4 \\] وهذا التّفصيل لإلقاء الشّيطان كيده انفردت به هذه الآية عن آية سورة البقرة لأنّ هذه خطاب شامل للمشركين وهم أخلياء عن العلم بذلك فناسب تفظيع أعمال الشّيطان بمسمع منهم .واللاّم في : { ليبدي } لام العاقبة إذا كان الشّيطان لا يعلم أنّ العصيان يفضي بهما إلى حدوث خاطر الشرّ في النّفوس وظهور السوآت ، فشبّه حصول الأثر عقب الفعل بحصول المعلول بعد العلّة كقوله تعالى : { فالتقطه آل فرعون ليكون لهم عدواً وحزناً } \\[ القصص : 8 \\] وإنّما التقطوه ليكون لهم قرّة عين ، وحسن ذلك أن بدوّ سوآتهما ممّا يرضي الشّيطان . ويجوز أن تكون لام العلّة الباعثة إذا كان الشيطان يعلم ذلك بالإلهام أو بالنّظر ، فالشّيطان وسوس لآدم وزوجه لغرض إيقاعهما في المعصية ابتداء ، لأنّ ذلك طبعه الذي جبل على عمله ، ثم لغرض الإضرار بهما ، إذ كان يعلم أنّهما يعصيان الله بالأكل من الشّجرة ، ولمّا كان عدُوّاً لهما كان يسعى إلى مَا يؤذيهما ، ويحسدهما على رضَى الله عنهما ، ويعلم أنّ العصيان يُفضي بهما إلى سوء الحال على الإجمال ، فكان مظهر ذلك السوء إبداءَ السوْآت ، فجُعل مفصِّلُ العلّة المجملة عند الفاعل هو العلّةَ ، وإن لم تخطر بباله ، ويحتمل أن يكون الشّيطان قد علم ذلك بعلم حصل له من قبل . والحاصلُ أنّه أراد الإضْرار ، لأنّه قد استقرّ في طبعه عداوة البشر ، كما سيصرّح به فيما بعدُ ، وفي قوله تعالى : { إن الشّيطان لكم عدو فاتخذوه عدواً } \\[ فاطر : 6 \\].والإبداء ضدّ الإخفاء ، فالإبداء كشف الشّيء وإظهاره ، ويطلق مجازاً على معرفة الشّيء بعد جهله يقال : بدَا لي أنْ أفعل كذا .وأسند إبداءُ السوْآت إلى الشّيطان لأنّه المتسبّب فيه على طريقة المجاز العقلي والسوآت جمعُ سوْأة وهي اسم لما يسوء ويتعيّر به من النّقايص ، ومِن سَب العرب قولهم : سوأةً لك ، ومن تلهّفهم : يا سوْأتَا .ويكنّى بالسوأة عن العورة . ومعنى ووُري عنهما حجب عنهما وأخفي ، مشتقاً من المواراة وهي التّغطيّة والإخفاء وتطلق المواراة مجازاً على صرف المرء عن علم شيء بالكتمان أو التّلبيس .والسّوآت هنا يجوز أن تكون جمع السوأة للخصلة الذّميمة كما في قول أبي زبيد :لَم يَهْب حُرمة النّديم وحُقَّت ... يا لَقَوْمي للسوأةِ السوآءِفتكون صيغة الجمع على حقيقتها ، والسّوآت حينئذٍ مستعمل في صريحه ، ويجوز أن تكون جمع السوأة ، المكنى بها عن العورة ، وقد روي تفسيرها بذلك عن ابن عبّاس كقوله تعالى : { قد أنزلنا عليكم لباساً يواري سوآتكم } \\[ الأعراف : 26 \\] وعلى هذا فصيغة الجمع مستعملة في الاثنين للتّخفيف كقوله تعالى : { فقد صَغَت قلوبكما } \\[ التحريم : 4 \\]. وسيجيء تحقيق معنى هذا الإبداء عند قوله تعالى بعد هذا : { فلما ذاقا الشجرة بدت لهما سوآتهما } \\[ الأعراف : 22 \\].وعطفُ جملة : { وقال ما نهاكما ربكما } على جملة { فوسوس } يدلّ على أنّ الشّيطان وسوس لهما وسوسة غيرَ قوله : { ما نهاكما } إلخ ثمّ ثنى وسوسته بأن قال مَا نهاكما ، ولو كانت جملة : { ما نهاكما } إلى آخرها بياناً لجملة { فوسوس } لكانت جملة : { وقال ما نهاكما } بدون عاطف ، لأنّ البيان لا يعطف على المبيَّن . وفي هذا العطف إشعار بأنّ آدم وزوجه تردّدا في الأخذ بوسوسة الشّيطان فأخذ الشيطان يراودهما . ألا ترى أنّه لم يعطف قوله ، في سورة طه ( 120) : { فوسوس إليه الشيطان قال يا آدم هل أدلك على شجرة الخلد وملك لا يبلى } فإنّ ذلك حكاية لابتداء وسوسته فابتدأ الوسوسة بالإجمال فلم يعيّن لآدم الشّجرة المنهي عن الأكل منها استنزالاً لطاعته ، واستزلالاً لقدمه ، ثمّ أخذ في تأويل نهي الله إياهما عن الأكل منها فقال ما حكي عنه في سورة الأعراف : ما نهاكما ربكما عن هذه الشجرة إلا أن تكونا ملكين } الآية فأشار إلى الشّجرة بعد أن صارت معروفة لهما زيادة في إغرائِهما بالمعصية بالأكل من الشّجرة ، فقد وزّعت الوسوسة وتذييلها على السّورتين على عادة القرآن في الاختصار في سوْق القصص اكتفاء بالمقصود من مغزى القصّة لئلا يصير القصصُ مقصداً أصلياً للتنزيل .والإشارة بقوله : { عن هذه لشجرة } إلى شجرة معيّنة قد تبيّن لآدم بعد أن وسوس إليه الشّيطان أنّها الشّجرة التي نهاه الله عنها ، فأراد إبليس إقدامه على المعصية وإزالة خوفه بإساءة ظنّه في مراد الله تعالى من النّهي .والاستثناء في قوله : { إلا أن تكونا ملكين } استثناء من علل ، أي ما نهاكما لعلّة وغرض إلاّ لغرض أن تكونا مَلكين ، فتعين تقدير لام التّعليل قبل ( أنْ ) وحذف حروف الجرّ الدّاخلة على ( أنْ ) مطرد في كلام العرب عند أمن اللّبس .وكونُهما مَلكين أو خالدَيْن علّة للنّهي : أي كونكما ملَكين هو باعث النّهي ، إلاّ أنّه باعث باعتبار نفي حصوله لا باعتبار حصوله ، أي هو علّة في الجملة ، ولذلك تأوّله سيبويه والزمخشري بتقدير : كراهة أن تكونا .وهو تقدير معنى لا تقدير إعراب ، كما تقدّم في سورة الأنعام ، وقيل حذفت ( لا ) بعد ( أن ) وحذفها موجود ، وبذلك تأوّل الكوفيون وقد تقدم القول فيه . وقد أوهم إبليس آدم وزوجه أنّهما متمكّنان أن يصيرا ملكين من الملائكة ، إذا أكلا من الشّجرة ، وهذا من تدجيله وتلبيسه إذْ ألفى آدم وزوجه غير متبصّريْن في حقائق الأشياء ، ولا عالِمَيْن المقدار الممكن في انقلاب الأعيان وتطوّرِ الموجودات ، وكانا يشاهدان تفضيل الملائكة عند الله تعالى وزلفاهم وسعة مقدرتهم ، فأطمعهما إبليس أن يصيرا من الملائكة إذا أكلا من الشّجرة ، وقيل المراد التشبيهُ البليغ أي إلاّ أن تكونا في القرب والزلفى كالمَلكين ، وقد مثل لهما بما يعرفان من كمال الملائكة .وقوله : { أو تكونا من الخالدين } عطف على : { أن تكونا ملكين } وأصل ( أو ) الدّلالة على التّرْديد بين أحد الشّيئين أو الأشياء ، سواء كان مع تجويز حصول المتعاطفات كلّها فتكون للإباحة بعد الطّلب ، وللتّجويز بعد الخبر أو للشكّ؛ أم كان مع منع البعض عند تجويز البعض فتكون للتّخيير بعد الطّلب وللشكّ أو التّرْديد بعد الخبر ، والتّرديدُ لا ينافي الجزم بأن أحد الأمرين واقع لا محالة كما هنا ، فمعنى الكلام أن الآكل من هذه الشّجرة يكون مَلَكاً وخالداً ، كما قال عنه في سورة طه ( 120) : { هل أدلك على شجرة الخلد وملك لا يبلى } فجعل نهي الله لهما عن الأكل لاَ يَعدو إرادة أحد الأمرين ، ويستفاد من المقام أنّه قد يريد حرمانهما من الأمرين جميعاً بدلالة الفحوى ، ولم يكن آدم قد علم حينئذ أنّ الخلود متعذر ، وأنّ الموت والحشر والبعث مكتوب على النّاس ، فإنّ ذلك يتلقّى من الوحي كما في قوله تعالى لهما في الآية الأخرى : { ولكم في الأرض مستقر ومتاع إلى حين } \\[ البقرة : 36 \\].\n\n",
      "translations": [
        {
          "translation": "(Then Satan whispered to them) to eat from the tree (that he might manifest unto them that which was hidden from them) by the attire of light (of their shame) of their nakedness, (and he said) and Iblis said to them: (Your Lord forbade you) Adam and Eve (from this tree only lest ye should become angels) who teach good and evil in Paradise (or become of the immortals) in Paradise: this is why He forbade you to eat from the tree.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَوَسْوَسَ لَهُمَا ٱلشَّيْطَانُ } أي: أوقعهما في الدغدغة بأمر الشجرة\n وإن كان وسوسة أيضاً عن مقتضيات الحكمة المتقنة الإلهية\n بعدما وصاهما الحق سبحانه ونهاهما عنه\n وليس غرضه إلا نزع لباس الصيانة والتقوى عنهما { لِيُبْدِيَ } أي: يظهر { لَهُمَا مَا وُورِيَ } أي: غطي وسرت { عَنْهُمَا مِن سَوْءَاتِهِمَا } التي هي مقتضيات بشريتهما وهويتهما الباطلة { وَ } بعدما أشربهما الوسوسة { قَالَ } على وجه الشفقة والنصيحة وإرادة الخير: { مَا نَهَاكُمَا رَبُّكُمَا عَنْ هَـٰذِهِ ٱلشَّجَرَةِ } المباركة المزكية عنكم لوث بشريتكم { إِلاَّ } كراهة { أَن تَكُونَا مَلَكَيْنِ } بتناولهما { أَوْ تَكُونَا مِنَ ٱلْخَالِدِينَ } [الأعراف: 20] فيها\n\n\n{ وَ } بعدما نصحهما وأشفقهما وسمعا منه ما سمعا { قَاسَمَهُمَآ } أي: بادر إلى القسم تأكيداً وترويجاً لقوله إياهما قائلاً: { إِنِّي لَكُمَا لَمِنَ ٱلنَّاصِحِينَ } [الأعراف: 21] المشفقين المريدين خيركما\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فوسوس لهما الشيطان } أي: فعل الوسوسة لأجلهما\n وهوة الصوت الخفي\n { ليُبدِي } أي: ليظهر { لهما ما وُورِيَ } أي: ما غطى { عنهما من سَوآتِهما } أي: عوارتهما\n واللام: للعاقبة\n أي: فعل الوسوسة لتكون عاقبتهما كشف عورتهما\n وكانا لا يريانها من أنفسهما\n ولا أحداهما من الآخر\n وفيه دليل على أن كشف العورة\n ولو عند الزوج من غير حاجة ـ قبيح مستهجن في الطباع\n { وقال } لهما: { ما نهاكما ربُّكما عن هذه الشجرة إلا } كراهية { أن تكونا مَلَكين }\n واستدل به من قال بفضل الملائكة على الأنبياء\n وجوابه: أنه كان من المعلوم عندهما أن الحقائق لا تَنقَلب\n وإنما كانت رغبتهما فيما يحصل لهما من الغنى عن لطعام والشراب\n فيمكن لهما الخلود في الجنة\n ولذلك قال: { أو تكونا من الخالدين } الذين يخلدون في الجنة\n ويؤخذ من قوله تعالى: { ما نهاكما ربكما } \n أن آدم عليه السلام لم يكن ناسيًا للنهي\n وإلا لما ذكره بقوله: { ما نهاكما ربكما } \n وقوله في سورة طه: { فنسي } \n أي: نسي أنه عدو له\n ولذلك ركن إلى نصيحته\n وقبل منه حتى تأول أن النهي عن عين الشجرة لا عن جنسهان فأكل من جنسها رغبة في الخلود\n ولكنه غره من حيث الأخذ بالظواهر وترك الاحتياط\n ولم يقصد إبليسُ إخراجهما من الجنة\n وإنما قصد أسقاطهما من مرتبتهما\n وإبعادهما كما بعُد هو\n فلم يلبغ قصده ولا أدرك مراده\n بل ازداد سخينة عين\n وغيظ نفس\n وخيبة ظن\n قال الله تعالى:\n[طه:122]\n فصار عليه السلام خليفة لله في أرضه\n بعد أن كان جارًا له في داره\n فكم بين الخليفة والجار؟ { وقاسَمَهُما } أي: خلف لهما { إني لكما لمنَ الناصحين } فيما قلت لكما\n وذكر قَسَم إبليس بصيغة المفاعلة التي تكون بين اثنين مبالغة لأنه اجتهد فيه\n أو لأنه أقسم لهما\n وأقسما له أن يقبلا نصيحته",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "114:5",
      "similarity": 0.6605021593100048
    },
    {
      "verse": "20:120",
      "similarity": 0.6283827040708924
    },
    {
      "verse": "50:16",
      "similarity": 0.45536617900046655
    },
    {
      "verse": "114:4",
      "similarity": 0.360816993981396
    },
    {
      "verse": "6:28",
      "similarity": 0.22019489613462365
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007020.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007020.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:20.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}