{
  "chapter": "الأعراف",
  "text": "فوسوس لهما الشيطن ليبدى لهما ما ورى عنهما من سوءتهما وقال ما نهىكما ربكما عن هذه الشجرة الا ان تكونا ملكين او تكونا من الخلدين",
  "translations": [
    {
      "translation": "Then Shaytan whispered to them, disclosing to them their private parts that had been concealed from them. He said, 'Your Lord has only forbidden you this tree lest you become angels or among those who live for ever.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan suggested (evil) to them, in order to reveal their hidden parts of which they were not aware (till then), and said: \"Your Lord has forbidden you (to go near) this tree that you may not become angels or immortal.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan made an evil suggestion to both of them that he might reveal to them their shame that had remained hidden from them. He said: 'Your Lord has forbidden you to approach this tree only to prevent you from becoming angels or immortals.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Satan tempted them to reveal that which was kept private from them and said, \"Your Lord has not prohibited you (to eat the fruits of this tree) unless you want to be angels or immortal.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan created apprehensions in their hearts in order to disclose to them matters of their shame which were hidden from them, and said, “Your Lord has forbidden you from this tree, for you may become angels or immortals.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Shaytan whispered suggestions to them both in order to uncover that which was hidden from them of their private parts (before); he said: \"Your Lord did not forbid you this tree save you should become angels or become of the immortals.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the Shaitan made an evil suggestion to them that he might make manifest to them what had been hidden from them of their evil inclinations, and he said: Your Lord has not forbidden you this tree except that you may not both become two angels or that you may (not) become of the immortals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan whispered to them, to reveal to them that which was hidden from them of their shameful parts. He said, 'Your Lord has only prohibited you from this tree lest you become angels, or lest you become immortals.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan whispered to them that he might manifest unto them that which was hidden from them of their shame, and he said: Your Lord forbade you from this tree only lest ye should become angels or become of the immortals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan tempted them so that he might reveal to them their nakedness which had been hidden from them. He said, \"Your Lord has forbidden you to approach this tree lest you should become angels or become of the immortals,\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then the Satan whispered unto the twain in order that he might discover unto the twain that which lay hidden from the twain of their shame, and said: your Lord forbade you not vender tree but lest ye twain should become angels or become of the abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Satan tempted them, to expose to them what was hidden from them of their nakedness, and he said, ‘Your Lord has only forbidden you from this tree lest you should become angels, or lest you become immortal.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then began Satan to whisper suggestions to them, bringing openly before their minds all their shame that was hidden from them (before): he said: \"Your Lord only forbade you this tree, lest ye should become angels or such beings as live for ever.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then Shaitan (Satan) whispered suggestions to them both in order to uncover that which was hidden from them of their private parts (before); he said: \"Your Lord did not forbid you this tree save you should become angels or become of the immortals.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But satan whispered to them, so that he might reveal to them their shameful parts which had been hidden from them, he said: 'Your Lord has prohibited you from this tree lest you both become angels or become among the immortal'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan whispered to them, to reveal to them their nakedness, which was invisible to them. He said, “Your Lord has only forbidden you this tree, lest you become angels, or become immortals.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But Satan whispered to them to make apparent to them that which was concealed from them of their private parts. He said, \"Your Lord did not forbid you this tree except that you become angels or become of the immortal.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:20] Then Satan, Iblīs, whispered to them that he might manifest, reveal, to them that which was hidden (wūriya: based on [the verbal form] fū‘ila and [derives] from [the infinitive] al-muwārā) to them of their shameful parts. And he said, ‘Your Lord prohibited you from this tree only, in aversion, lest you become angels (malakayn may also be read malikayn) or become immortals’, in other words, that is the necessary consequence of eating from it, as [is stated] in another verse: Shall I guide you to the Tree of Immortality and a kingdom that does not waste away? [Q. 20:120].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Then Satan whispered to them) to eat from the tree (that he might manifest unto them that which was hidden from them) by the attire of light (of their shame) of their nakedness, (and he said) and Iblis said to them: (Your Lord forbade you) Adam and Eve (from this tree only lest ye should become angels) who teach good and evil in Paradise (or become of the immortals) in Paradise: this is why He forbade you to eat from the tree.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَوَسْوَسَ لَهُمَا ٱلشَّيْطَانُ } أي: أوقعهما في الدغدغة بأمر الشجرة، وإن كان وسوسة أيضاً عن مقتضيات الحكمة المتقنة الإلهية، بعدما وصاهما الحق سبحانه ونهاهما عنه، وليس غرضه إلا نزع لباس الصيانة والتقوى عنهما { لِيُبْدِيَ } أي: يظهر { لَهُمَا مَا وُورِيَ } أي: غطي وسرت { عَنْهُمَا مِن سَوْءَاتِهِمَا } التي هي مقتضيات بشريتهما وهويتهما الباطلة { وَ } بعدما أشربهما الوسوسة { قَالَ } على وجه الشفقة والنصيحة وإرادة الخير: { مَا نَهَاكُمَا رَبُّكُمَا عَنْ هَـٰذِهِ ٱلشَّجَرَةِ } المباركة المزكية عنكم لوث بشريتكم { إِلاَّ } كراهة { أَن تَكُونَا مَلَكَيْنِ } بتناولهما { أَوْ تَكُونَا مِنَ ٱلْخَالِدِينَ } [الأعراف: 20] فيها\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وقال } لهما: { ما نهاكما ربُّكما عن هذه الشجرة إلا } كراهية { أن تكونا مَلَكين }\n واستدل به من قال بفضل الملائكة على الأنبياء، وجوابه: أنه كان من المعلوم عندهما أن الحقائق لا تَنقَلب، وإنما كانت رغبتهما فيما يحصل لهما من الغنى عن لطعام والشراب، فيمكن لهما الخلود في الجنة، ولذلك قال: { أو تكونا من الخالدين } الذين يخلدون في الجنة\n ويؤخذ من قوله تعالى: { ما نهاكما ربكما } ، أن آدم عليه السلام لم يكن ناسيًا للنهي، وإلا لما ذكره بقوله: { ما نهاكما ربكما } ، وقوله في سورة طه: { فنسي } ، أي: نسي أنه عدو له، ولذلك ركن إلى نصيحته، وقبل منه حتى تأول أن النهي عن عين الشجرة لا عن جنسهان فأكل من جنسها رغبة في الخلود، ولكنه غره من حيث الأخذ بالظواهر وترك الاحتياط\n ولم يقصد إبليسُ إخراجهما من الجنة، وإنما قصد أسقاطهما من مرتبتهما، وإبعادهما كما بعُد هو، فلم يلبغ قصده ولا أدرك مراده، بل ازداد سخينة عين، وغيظ نفس، وخيبة ظن\n قال الله تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "114:5",
      "similarity": 0.6605021593100048
    },
    {
      "verse": "20:120",
      "similarity": 0.6283827040708924
    },
    {
      "verse": "50:16",
      "similarity": 0.45536617900046655
    },
    {
      "verse": "114:4",
      "similarity": 0.360816993981396
    },
    {
      "verse": "6:28",
      "similarity": 0.22019489613462365
    }
  ]
}