{
  "chapter": "الأعراف",
  "text": "ان الذين اتقوا۟ اذا مسهم طئف من الشيطن تذكروا۟ فاذا هم مبصرون",
  "translations": [
    {
      "translation": "As for those who have taqwa, when they are bothered by visitors from Shaytan, they remember and immediately see clearly.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who fear God think of Him when assailed by the instigations of Satan, and lo! they begin to understand,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "If the God-fearing are instigated by any suggestion of Satan, they instantly become alert, whereafter they clearly perceive the right way.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When a satanic thought starts to bother the pious ones, they understand and see the light\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who fear get alerted whenever a temptation from the devil troubles them, and they perceive immediately.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who have Taqwa, when an evil thought comes to them from Shaytan, they remember (Allah), and (indeed) they then see (aright).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely those who guard (against evil), when a visitation from the Shaitan afflicts them they become mindful, then lo! they see.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The godfearing, when a visitation of Satan troubles them, remember, and then see clearly;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! those who ward off (evil), when a glamour from the devil troubleth them, they do but remember (Allah's Guidance) and behold them seers!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When any evil suggestion from Satan touches those who fear God, they are instantly alerted and become watchful;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who fear God when an instigation from the Satan toucheth them, they call to mind land lo! they are enlightened.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When those who are Godwary are touched by a visitation of Satan, they remember [Allah] and, behold, they perceive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who fear Allah, when a thought of evil from Satan assaults them, bring Allah to remembrance, when lo! they see (aright)!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who are Al-Muttaqun (the pious - see V. 2:2), when an evil thought comes to them from Shaitan (Satan), they remember (Allah), and (indeed) they then see (aright).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, when a visitation of satan touches the cautious (worshipers) they remember, and then see clearly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who are righteous—when an impulse from Satan strikes them, they remind themselves, and immediately see clearly.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who fear Allah - when an impulse touches them from Satan, they remember [Him] and at once they have insight.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:201] Truly the God-fearing, when a visitation from Satan touches them, befalls them (tayfun: a variant reading has tā’ifun), that is, [when] something [of the sort] overcomes them, they remember, God’s punishment and His reward, and then see clearly, [distinguishing] the truth from what is other than it, and so they return [to God].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "181 (Lo! those who ward off (evil)) those who ward off the whispering of the devil, (when a glamour) doubt and insinuation (from the devil troubles them) befalls them, (they do but remember) know ((Allah's guidance) and behold them seers) refraining from transgression!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { طَائِفٌ مِّنَ ٱلشَّيْطَانِ } معناهُ جنونٌ\n وطَائِفٌ من الشَّيطانِ\n معناهُ يُريدُ بِهِ الغَضب\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying - {a group from among Satan's} - means madness.\n\n\nA group of Satan's followers\n\n\nThis means that he is angry.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ إنّ الذين اتّقوا } الشرك { إذا مسّهم طائف } لمسة { من الشيطان } بنسبة الفعل إلى الغير { تذكروا } مقام التوحيد ومشاهدة الأفعال من الله { فإذا هم مُبْصِرون } فعالية الله، فلا يبقى شيطان ولا فاعل غير الله في نظرهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثمَّ قال سبحانه تذكيراً لنبيه وعظة: { إِنَّ ٱلَّذِينَ ٱتَّقَواْ } من عبادنا كانوا { إِذَا مَسَّهُمْ } واستولى عليهم { طَائِفٌ } خاطر يطوف حول قلوبهم { مِّنَ } قبل { ٱلشَّيْطَانِ تَذَكَّرُواْ } ما أمروا به ونُهوا عنه من عند الله { فَإِذَا هُم } بتذكير المأمور والمنهي { مُّبْصِرُونَ } [الأعراف: 201] مميزنون مواقع الخطأ فيحترزون منها\n ويتعوذون إلى الله عمَّا يغريهم إليه\n\n\n{ وَ } الذين لم يتقوا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: الطيف ـ بسكون الياء ـ: مصدر طاف به الخيال يطيف طيفًا، أو مخفف من طيّف كهين ولين وميت\n ومن قرأ { طائف }: فاسم فاعل، والمراد به: لَمَّةُ الشيطان ووسوسته\n وحذف مفعول { تذكروا } للعموم على ما يأتي في المعنى\n وقوله: { فإذا هم مبصرون }: أتى بإذا الفجائية ليقتضي سرعة تيقظهم، وبالجملة الاسمية ولم يقل: تذكروا فأبصروا ليفيد أنهم كانوا على البُصرى، وإنما السَّنة طرقتهم ثم رجعوا عنها\n يقول الحقّ جلّ جلاله: { إن الذين اتَّقَوا } الشرك والمعاصي، { إذا مسَّهُم طائفٌ من الشيطان } أي: لَمَّةُ منه، كما في الحديث:\n\n \" إنَّ للشَّيطَانِ لَمّةٌ وللمَلكِ لَمّةَ\n\n\n \" \n\nالخ، فإذا أخذتهم تلك السنة وغفلوا { تذكّروا } عقابَ الله وغضبه، أو ثواب الله وإنعامه، أو مراقبته والحياء منه، أو مننه وإحسانه، أو طرده وإبعاده، أو حجبه وإهماله، أو عدواة الشيطان وإغواءه، كلٌ على قدر مقامه، فلما تذكروا ذلك { فإذا هم مبصرون } بسبب ذلك التذكر، أي: فإذا هم على بصيرة من ربهم التي كانوا عليها قبل المس، أو: فإذا هم مبصرون مواقع الخطأ ومكائد الشيطان فيحترزون منها، ولا يعودون إليها بخلاف المنهمكين في الغفلة، كما قال تعالى: { وإِخوانُهم يَمدُّونهم في الغَي } أي: وإخوان الشياطين، الذين لم يتقوا، يمدونهم، أي: ينصرونهم، ويكونون مددًا لهم في الضلال والغي بالتزيين والحمل عليه، { ثم لا يُقصرون } لا يُمسكون عن إغوائهم حتى يُوردوهم النار، أو: لا يقصر الكفار عن غيهم وضلالهم حتى يهلكوا\n الإشارة: البصيرة حارسة للقلب، الذي هو بيت الرب، فإذا نامت طرقها الشيطان، فإن كان نومها خفيفًا أحست به وطردته، وهذه بصيرة المتقين، الذين ذكرهم الله تعالى بقوله: { إذا مسهم طائف من الشيطان تذكروا } ، وإذا كان نومها ثقيلاً سرق الشيطان ما فيها، ولم تفطن به، وهذه بصيرة الغافلين، الذين هم أخوان الشياطين\n  قال القشيري: إنما يمس المتقين طيفُ الشيطان في ساعات غفلتهم عن ذكر الله، ولو أنهم استداموا ذكر الله بقلوبهم لما مسَّهم طائف الشيطان، فإن الشيطانَ لا يَقَربُ قلبًا في حال شهوده الله لأنه يخنس عند ذلك، ولكل عازمٍ فترة، ولكلِّ عالم هفوة، ولكل عابد شدة، ولكل قاصد فترة، ولكل سائر وقفة، ولكل عارفٍ حجبة\n قال ـ عليه الصلاة والسلام ـ:\n\n \" الحِدَّةُ تعتري خيار أمتي \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "19:45",
      "similarity": 0.4385296120636916
    },
    {
      "verse": "56:17",
      "similarity": 0.4311639496053122
    },
    {
      "verse": "7:87",
      "similarity": 0.4132581928318936
    },
    {
      "verse": "3:72",
      "similarity": 0.340401767020673
    },
    {
      "verse": "15:54",
      "similarity": 0.3090142459197579
    }
  ]
}