{
  "chapter": "الأعراف",
  "text": "واذا قرئ القرءان فاستمعوا۟ له وانصتوا۟ لعلكم ترحمون",
  "translations": [
    {
      "translation": "When the Qur'an is recited listen to it and be quiet so that hopefully you will gain mercy.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Qur'an is recited listen to it in silence. You may perhaps be blessed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the Qur'an is recited, listen carefully to it, and keep silent so that you may, be shown mercy.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whenever the Quran is recited (to you), listen to it quietly so that you may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Qur’an is recited, listen to it attentively and keep silent, so that you receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when the Qur'an is recited, listen to it, and be silent that you may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Quran is recited, then listen to it and remain silent, that mercy may be shown to you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Koran is recited, give you ear to it and be silent; haply so you will find mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the Qur'an is recited, give ear to it and pay heed, that ye may obtain mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Quran is read, listen to it with attention, and hold your peace, so that you may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the Qur'an is recited, listen thereto and keep silence, haply ye may be shewn mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Quran is recited, listen to it and be silent, maybe you will receive [Allah’s] mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Qur'an is read, listen to it with attention, and hold your peace: that ye may receive Mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So, when the Quran is recited, listen to it, and be silent that you may receive mercy. [i.e. during the compulsory congregational prayers when the Imam (of a mosque) is leading the prayer (except Surat Al-Fatiha), and also when he is delivering the Friday-prayer Khutbah]. [Tafsir At-Tabari, Vol. 9, Pages 162-4]\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Koran is recited, listen to it in silence in order that Allah has mercy upon you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When the Quran is recited, listen to it, and pay attention, so that you may experience mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So when the Qur'an is recited, then listen to it and pay attention that you may receive mercy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:204] And when the Qur’ān is recited, listen to it and pay heed, [refraining] from speech, so that you might find mercy: this was revealed regarding [the requirement of] refraining from speech during the [mosque] sermon, which here has been expressed by [the recital of] ‘the Qur’ān’, because it [the sermon] comprises it; others say that it was revealed regarding the [requirement of silence and attention during the] recitation of the Qur’ān in general.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when the Qur'an is recited) during the prescribed prayers, (give ear to it) to its recitation (and pay heed) to it being recited, (that you may obtain mercy) and not be punished.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n وإخوان الشياطين من المحجوبين { يمدّونهم } في نسبة الفعل إلى غيره فلا يقصرون من العناد والمراء والجهل { لولا اجْتَبَيتها } أي: هلا اجتمعتها من تلقاء نفسك { قل إنما أتّبع ما يُوحى إليّ من ربّي } أي: لا افتعل بنفسي، بل أبلغ عن الله ولا أقول إلا ما يوحى إليّ منه به لأني قائم به لا بنفسي { فاستمعوا له } أي: إلى الله ولا تستمعوا إلا منه { وأنصتوا } عن حديث النفس وغيره، فإنّ المتكلم به هو الله { لعلّكم تُرْحَمون } برحمة تجلي المتكلم في كلامه بصفاته وأفعاله { واذكر ربك } حاضراً { في نفسك } كقوله تعالى:\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } بعدما سمعتم من أوصاف القرآن ما سمعتم { إِذَا قُرِىءَ ٱلْقُرْآنُ } عندكم أو قرأتم أنتم { فَٱسْتَمِعُواْ لَهُ } عن صميم قلوبكم، وتأملوا في معناه بقدر وسعكم وطاقتكم { وَأَنصِتُواْ } أي: اسكتوا وأعرضوا عن مقتضيات سائر قواكم، ولا تلتفتوا إليهاأصلا { لَعَلَّكُمْ تُرْحَمُونَ } [الأعراف: 204] تنكشفون وتتحققون بما في نفسوكم من ودائع الله بسببه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}