{
  "chapter": "الأعراف",
  "text": "فدلىهما بغرور فلما ذاقا الشجرة بدت لهما سوءتهما وطفقا يخصفان عليهما من ورق الجنة ونادىهما ربهما الم انهكما عن تلكما الشجرة واقل لكما ان الشيطن لكما عدو مبين",
  "translations": [
    {
      "translation": "So he enticed them to do it by means of trickery. Then when they tasted the tree, their private parts were disclosed to them and they started stitching together the leaves of the Garden in order to cover themselves. Their Lord called out to them, 'Did I not forbid you this tree and say to you, \"Shaytan is an outright enemy to you\"?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And led them (to the tree) by deceit. When they tasted (the fruit) of the tree their disgrace became exposed to them; and they patched the leaves of the Garden to hide it. And the Lord said to them: \"Did I not forbid you this tree? And I told you that Satan was your open enemy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus Satan brought about their fall by deceit. And when they tasted of the tree, their shame became vislible to them, and both began to cover themselves with leaves from the Garden. Then their Lord called out to them: 'Did I not forbid you from that tree, and did I not warn you that Satan 'is your declared enemy?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus, he deceitfully showed them (the tree). When they had tasted (fruits) from the tree, their private parts became revealed to them and they began to cover their private parts with leaves from the garden. Their Lord then called out to them saying, \"Did I not forbid you to eat (fruits) from the tree and tell you that Satan was your sworn enemy?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he brought them down with deception; and when they tasted from that tree, their shame became manifest to them and they began attaching the leaves of Paradise on themselves; and their Lord said to them, “Did I not forbid you from that tree, and tell you that Satan is an open enemy to you?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he misled them with deception. Then when they tasted of the tree, that which was hidden from them of their shame (private parts) became manifest to them and they began to cover themselves with the leaves of Paradise. And their Lord called out to them (saying): \"Did I not forbid you that tree and tell you: Verily, Shaytan is an open enemy unto you\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Then he caused them to fall by deceit; so when they tasted of the tree, their evil inclinations became manifest to them, and they both began to cover themselves with the leaves of the garden; and their Lord called out to them: Did I not forbid you both from that tree and say to you that the Shaitan is your open enemy?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he led them on by delusion; and when they tasted the tree, their shameful parts revealed to them, so they took to stitching upon themselves leaves of the Garden. And their Lord called to them, 'Did not I prohibit you from this tree, and say to you, \"Verily Satan is for you a manifest foe\"?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus did he lead them on with guile. And when they tasted of the tree their shame was manifest to them and they began to hide (by heaping) on themselves some of the leaves of the Garden. And their Lord called them, (saying): Did I not forbid you from that tree and tell you: Lo! Satan is an open enemy to you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus he cunningly seduced them. When they tasted the tree's fruit, their nakedness became exposed to them and they started covering themselves with the leaves of the garden. Their Lord called out to them, \"Did I not forbid you to approach that tree, and did I not say to you that Satan was surely your open enemy?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus with guile he caused the twain to fall. Then when the twain had tasted of the tree, their shame was discovered to them, and the twain began to cover themselves with leaves from the Garden; and their Lord called out unto the twain: forbade I not ye twain yonder tree, and said I not unto you, verily the Satan is unto you twain a manifest enemy?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Thus he brought about their fall by deception. So when they tasted of the tree, their nakedness became exposed to them, and they began to stitch over themselves with the leaves of paradise. Their Lord called out to them, ‘Did I not forbid you from that tree, and tell you, ‘‘Satan is indeed your manifest enemy?’’ ’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So by deceit he brought about their fall: when they tasted of the tree, their shame became manifest to them, and they began to sew together the leaves of the garden over their bodies. And their Lord called unto them: \"Did I not forbid you that tree, and tell you that Satan was an avowed enemy unto you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he misled them with deception. Then when they tasted of the tree, that which was hidden from them of their shame (private parts) became manifest to them and they began to stick together the leaves of Paradise over themselves (in order to cover their shame). And their Lord called out to them (saying): \"Did I not forbid you that tree and tell you: Verily, Shaitan (Satan) is an open enemy unto you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he cheated both by delusion. And when they had tasted the tree, their shameful parts became apparent to them, and they both covered themselves with the leaves of Paradise. (Then) their Lord called to them, saying: 'Did I not prohibit you to approach that tree, and did I not warn you that satan was your clear enemy'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he lured them with deceit. And when they tasted the tree, their nakedness became evident to them, and they began covering themselves with the leaves of the Garden. And their Lord called out to them, “Did I not forbid you from this tree, and say to you that Satan is a sworn enemy to you?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So he made them fall, through deception. And when they tasted of the tree, their private parts became apparent to them, and they began to fasten together over themselves from the leaves of Paradise. And their Lord called to them, \"Did I not forbid you from that tree and tell you that Satan is to you a clear enemy?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:22] Thus did he lead them on, [thus] did he debase them in their status, by delusion, on his part; and when they tasted of the tree, that is, [when] they ate of it, their shameful parts were manifested to them, that is, the front [private part] of each was revealed to the other, as well as their behinds — each of these parts is called saw’a, ‘shameful’, because its exposure ‘shames’ (yasū’u) that person — and they began to piece together, they began to stick, onto themselves some of the leaves of the Garden, to cover themselves up therewith. And their Lord called them: ‘Did I not prohibit you from this tree, and say to you, “Verily Satan is a manifest enemy to you”?’, one whose enmity is evident? (the interrogative is meant as an affirmative).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Thus did he lead them on) to eat from the tree (with guile) with falsehood and lies until they ate from it. (And when they tasted of the tree their shame) their nakedness (was manifest to them and they began) out of shame (to hide (by heaping) on themselves some of the leaves of the Garden) the leaves of the fig tree. (And their Lord called them) Adam and Eve, ((saying): Did I not forbid you from that tree) from eating of that tree (and tell you: Lo! Satan) Iblis (is an open enemy to you) whose enmity is quite manifest?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَطَفِقَا يَخْصِفَانِ عَلَيْهِمَا مِن وَرَقِ ٱلْجَنَّةِ } معناهُ فَجَعَلا يَخْصِفان الورقَ بَعضَهُ إِلى بَعض يُنظِّمانه\n والوَرقُ والوَراقُ واحدٌ\n\n\n\n\nوقوله تعالى: { سَوْءَاتُهُمَا } معناهُ فروجُهُما\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the verse {And they will both fall upon each other with pieces of the Paradise}, its meaning is that they will fall upon each other with pieces of the Paradise, arranged in a orderly fashion.\n\n\nAnd the leaves and the pages are one and the same.\n\n\nAnd His saying, {Their evil deeds} means their private parts.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ فَدَلاَّهُمَا } أي: أسقطهما عن معالي العز إلى مهاوي الذل { بِغُرُورٍ } غرهما به على وجه الانتقام { فَلَمَّا } سمعا قوله وقبلا غروره { ذَاقَا ٱلشَّجَرَةَ } مطمعين على ما أغراهما إليه من الشرف والخلود\n وبعدما ذاقا منها { بَدَتْ } ظهرت { لَهُمَا سَوْءَاتُهُمَا } عوراتهما\n إذ نزع عنهما لباس التقوى وثياب العصمة { وَ } بعدما نزع لباسهما ظهر سواءتهما { طَفِقَا } أخذا { يَخْصِفَانِ } يلصقان ويلزقان { عَلَيْهِمَا مِن وَرَقِ } أشجار { ٱلْجَنَّةِ } قيل: هي التينة\n وقيل: الكرمة { وَ } بعدما ما بدا منهما ما بدا { أَلَمْ أَنْهَكُمَا } موبخاً مقرعاً: { نَادَاهُمَا رَبُّهُمَآ } أيها المعتديان المسرفان { عَن تِلْكُمَا ٱلشَّجَرَةِ وَأَقُل لَّكُمَآ إِنَّ ٱلشَّيْطَآنَ لَكُمَا عَدُوٌ مُّبِينٌ } [الأعراف: 22] ظاهر العداوة\n فلم تسمعا قوله\n وتتبعا أمره؟ فلما سمعا من ربهما ما سمعا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { فدلاّهُما } \n أي: أنزلهما إلى الأكل من الشجرة\n { بغُرور } أي: بما غرهما به من القَسَم\n لأنهما ظنًا أن أحدًا لا يحلف بالله كاذبًا\n { فلما ذَاقَا الشجرة } أي: وجدا طعمها\n آخذين في الأكل منها\n { بدت لهما سَوآتُهما } \n وتهافت عنهما ثيابُهما\n فظهرت لهما عوراتهما أدبًا لهما\n وقيل: كان لباسهما نورًا يحول بينهما وبين النظر\n فلما أكلا انكشف عنهما\n وظهرت عورتهما\n { وطَفِقَا } أي: جعلا { يَخصِفَانِ عليهما من وَرَقِ الجنّة } أي: أهذا يرقعان ويلزقان ورقة فوق ورقة ليستترا به\n قيل: كان ورقَ التين\n فآدم أول من لبس المرقعه\n { وناداهما ربُّهما ألم أنهكُمَا عن تلكما الشجرة وأقل لكُمَا إن الشيطانَ لكما عدوٌ مبين } هذا عتاب على المخالفة\n وتوبيخ على الاغترار بالعدو\n\nوفيه دليل على ان مطلق النهي للتحريم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "20:121",
      "similarity": 0.8357434895638975
    },
    {
      "verse": "38:33",
      "similarity": 0.3271214290852313
    },
    {
      "verse": "18:19",
      "similarity": 0.24448297987511702
    },
    {
      "verse": "6:59",
      "similarity": 0.1869636132686628
    },
    {
      "verse": "20:120",
      "similarity": 0.18599070217087382
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007022.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007022.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:22.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}