{
  "chapter": "الأعراف",
  "text": "قالا ربنا ظلمنا انفسنا وان لم تغفر لنا وترحمنا لنكونن من الخسرين",
  "translations": [
    {
      "translation": "They said, 'Our Lord, we have wronged ourselves. If you do not forgive us and have mercy on us, we will be among the lost.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"O our Lord, we have wronged ourselves. If You do not forgive us and have mercy upon us, we shall certainly be lost.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Both cried out: 'Our Lord! We have wronged ourselves. If You do not forgive us and do not have mercy on us, we shall surely be among the losers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They replied, \"Lord, we have done injustice to our souls. If You will not forgive us and have mercy on us, we shall certainly have incurred a great loss.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They both submitted, “Our Lord! We have wronged ourselves; so if You do not forgive us and have mercy on us, then surely, we are of the losers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Our Lord! We have wronged ourselves. If You forgive us not, and bestow not upon us Your mercy, we shall certainly be of the losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Our Lord! We have been unjust to ourselves, and if Thou forgive us not, and have (not) mercy on us, we shall certainly be of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, 'Lord, we have wronged ourselves, and if Thou dost not forgive us, and have mercy upon us, we shall surely be among the lost.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: Our Lord! We have wronged ourselves. If thou forgive us not and have not mercy on us, surely we are of the lost!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They replied, \"Our Lord, we have wronged our souls: if You do not forgive us and have mercy on us, we shall be among the lost.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The twain said. our Lord! we have wronged our souls, and if Thou forgivest us not and hath not mercy on us, we shall of a surety be of the losers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, ‘Our Lord, we have wronged ourselves! If You do not forgive us and have mercy upon us, we will surely be among the losers.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Our Lord! We have wronged our own souls: If thou forgive us not and bestow not upon us Thy Mercy, we shall certainly be lost.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said: \"Our Lord! We have wronged ourselves. If You forgive us not, and bestow not upon us Your Mercy, we shall certainly be of the losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Both replied: 'Lord, We have harmed ourselves. If You do not forgive us and have mercy on us, we shall surely be among the lost'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, “Our Lord, we have done wrong to ourselves. Unless You forgive us, and have mercy on us, we will be among the losers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They said, \"Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:23] They said, ‘Our Lord, we have wronged ourselves, by our act of disobedience, and if You do not forgive us and have mercy on us, we shall surely be among the lost’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nعطف على جواب ( لَمَّا ) ، فهو ممّا حصل عند ذَوق الشّجرة ، وقد رتب الإخبار عن الأمور الحاصلة عند ذوق الشّجرة على حسب ترتيب حصولها في الوجود . فإنّهما بدت لهما سوآتهما فطفقا يخصفان . وأعقب ذلك نداءُ الله إيّاهما .وهذا أصل في ترتيب الجمل في صناعة الإنشاء ، إلاّ إذا اقتضى المقام العدول عن ذلك ، ونظير هذا الترتيب ما في قوله تعالى : { ولما جاءت رسلنا لوطاً سيء بهم وضاق بهم ذرعاً وقال هذا يوم عصيب } \\[ هود : 77 \\] وقد بيّنته في كتاب «أصول الإنشاء والخطابة» ولم أعلم أنّي سُبقت إلى الاهتداء إليه .وقد تأخّر نداء الربّ إياهما إلى أن بدت لهما سوآتهما ، وتحيَّلا لستر عوراتهما ليكون للتّوبيخ وقْعٌ مكين من نفوسهما ، حين يقع بعد أن تظهر لهما مفاسد عصيانهما ، فيعلما أنّ الخير في طاعة الله ، وأنّ في عصيانه ضرّاً .والنّداء حقيقته ارتفاع الصّوت وهو مشتق من النَّدى بفتح النّون والقصر وهو بُعد الصّوت ، قال مدثار بن شيبان النمري :فَقُلتُ ادعِي وأدْعُوا إنّ أندى ... لِصَوْتتٍ أن يُنادِيَ داعيانوهو مجاز مشهور في الكلام الذي يراد به طلب إقبال أحد إليك ، وله حروف معروفة في العربيّة : تدلّ على طلب الإقبال ، وقد شاع إطلاق النّداء على هذا حتّى صار من الحقيقة ، وتفرّع عنه طلب الإصغاء وإقبال الذّهن من القريب منك ، وهو إقبال مجازي .{ وناداهما ربهما } مستعملٌ في المعنى المشهور : وهو طلب الإقبال ، على أنّ الإقبال مجازي لا محالة فيكون كقوله تعالى : { وزكرياء إذا نادى ربه } \\[ الأنبياء : 89 \\] وهو كثير في الكلام .ويجوز أن يكون مستعملاً في الكلام بصوت مرتفع كقوله تعالى : { كمَثَل الذي ينعق بما لا يسمع إلا دعاءً ونداءً } \\[ البقرة : 171 \\] وقوله : { ونودوا أن تلكم الجنة أورثتموها } \\[ الأعراف : 43 \\] وقول بشّار :نَادَيْت إنّ الحبّ أشْعَرني ... قَتْلاً وما أحدثتُ من ذَنْبورفع الصّوت يكون لأغراض ، ومحمله هنا على أنّه صوت غضب وتوبيخ .وظاهر إسناد النّداء إلى الله أنّ الله ناداهما بكلام بدون واسطة مَلك مرسل ، مثللِ الكلام الذي كلّم الله به موسى ، وهذا واقع قبل الهبوط إلى الأرض ، فلا ينافي ما ورد من أن موسى هو أوّل نبيء كلّمه الله تعالى بلا واسطة ، ويجوز أن يكون نداءُ آدم بواسطة أحد الملائكة .وجملة : { ألم أنهاكما } في موضع البيان لجملة ( ناداهما ) ، ولهذا فصلت الجملة عن التي قبلها .والاستفهام في { ألم أنهاكما } للتّقرير والتّوبيخ ، وأُولِيَ حرفَ النّفي زيادة في التّقرير ، لأنّ نهي الله إياهما واقع فانتفاؤه منتفا ، فإذا أدخلت أداة التّقرير وأقرّ المقرَّر بضد النّفي كان إقرارُه أقوى في المؤاخذة بموجَبه ، لأنّه قد هُييء له سبيل الإنكار ، لو كان يستطيع إنكاراً ، كما تقدّم عند قوله تعالى : { يا معشر الجن والإنس ألم يأتكم رسل منكم } الآية في سورة الأنعام ( 130 ) ، ولذلك اعترفا بأنّهما ظلما أنفسهما .وعطف جملة : وأقل لكما } على جملة : { أنهكما } للمبالغة في التّوبيخ ، لأنّ النّهي كان مشفوعاً بالتّحذير من الشّيطان الذي هو المغري لهما بالأكل من الشّجرة ، فهما قد أضاعا وصيتين . والمقصود من حكاية هذا القول هنا تذكير الأمّة بعداوة الشيطان لأصل نوع البشر ، فيعلموا أنّها عداوة بين النّوعين ، فيحذروا من كلّ ما هو منسوب إلى الشّيطان ومعدود من وسوسته ، فإنّه لما جُبل على الخبث والخري كان يدعو إلى ذلك بطبعه وكان لا يهنأ له بال ما دام عدوّهُ ومحسودُه في حالة حسنة .والمُبين أصله المظهر ، أي للعداوة بحيث لا تخفى على من يتتبّع آثار وسوسته وتغريره ، وما عامل به آدمَ من حين خلقه إلى حين غروره به ففي ذلك كلّه إبَانة عن عداوته ، ووجه تلك العداوة أن طبعه ينافي ما في الإنسان من الكمال الفطري المؤيَّد بالتّوفيق والإرشاد الإلهي ، فلا يحب أن يكون الإنسانُ إلاّ في حالة الضّلال والفساد . ويجوز أن يكون المبين مستعملاً مجازاً في القويّ الشّديد لأنّ شأن الوصف الشّديد أن يظهر للعيان .وقد قالا : { ربنا ظلمنا أنفسنا } اعترافاً بالعصيان ، وبأنّهما علما أن ضر المعصية عاد عليهما ، فكانا ظالمين لأنفسهما إذ جرّا على أنفسهما الدّخولَ في طور ظهور السوآت ، ومشقّة اتّخاذ ما يستر عوراتهما ، وبأنّهما جَرّا على أنفسهما غضب الله تعالى ، فهما في توقع حقوق العذاب ، وقد جزما بأنّهما يكونان من الخاسرين إن لم يغفر الله لهما ، إمّا بطريق الإلهام أو نوع من الوحي ، وإمّا بالاستدلال على العَواقب بالمبادىء ، فإنّهما رأيا من العصيان بوادِىء الضر والشّر ، فعلما أنّه من غضب الله ومن مخالفة وصايته ، وقد أكدا جملة جواب الشّرط بلام القسم ونون التّوكيد إظهاراً لتحقيق الخسران استرحاما واستغفاراً من الله تعالى .\n\n",
      "translations": [
        {
          "translation": "(They said : Our Lord! We have wronged ourselves) we have harmed ourselves by transgressing. (If Thou forgive us not) if You do not overlook our transgression (and have not mercy on us) by not punishing us, (surely we are of the lost!) we shall be of those duped into receiving punishment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالاَ } متضرعين متذللين معترفين على زلتهما: { رَبَّنَا } يا من ربانا على الكرامة لمقتضى فضلك وجودك { ظَلَمْنَآ أَنفُسَنَا } بمتابعة عدوا { وَإِن لَّمْ تَغْفِرْ لَنَا } لم تتجاوز عنا { وَ } لم { تَرْحَمْنَا } بفضلك { لَنَكُونَنَّ مِنَ ٱلْخَاسِرِينَ } [الأعراف: 23] خسراناً عظيماً\n\n\nثم لما صدر منما ما صدر بوسوسة عدوهما\n أمر سبحانه بإخراجهما عن دار السرور إلى دار الابتلاء والغرور",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n ثم صرّحا بالتوبة فقالا: { ربنا ظلمنا أنفسنا } حين صدّرناها للمعصية\n وتعرضنا للإخراج من الجنة\n { وإن لم تغفر لنا وترحَمنا لنكُوننَّ من الخاسرين } وهذه هي الكلمات التي تلقاها من ربه فتاب عليه بها\n قال البيضاوي: فيه دليل على أن الصغائر يُعاقب عليها إن لم تغفر\n وقالت المعتزلة: لا يجوز المعاقبة عليها مع اجتناب الكبائر\n ولذلك قالوا: إنما قالا ذلك على عادة المقربين في تعظيم الصغير من السيئات\n واستحقار العظيم من الحسنات\nهـ",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:95",
      "similarity": 0.6123115520882351
    },
    {
      "verse": "28:16",
      "similarity": 0.5766303302226842
    },
    {
      "verse": "103:2",
      "similarity": 0.5360994592604433
    },
    {
      "verse": "7:178",
      "similarity": 0.4746229136087548
    },
    {
      "verse": "6:12",
      "similarity": 0.46402806864998686
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007023.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007023.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:23.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}