{
  "chapter": "الأعراف",
  "text": "قال اهبطوا۟ بعضكم لبعض عدو ولكم فى الارض مستقر ومتع الى حين",
  "translations": [
    {
      "translation": "He said, 'Go down from here as enemies to each other! You will have residence on the earth and enjoyment for a time.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Go,\" said God, \"one the antagonist of the other, and live on the earth for a time ordained, and fend for yourselves.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: 'Go down; you are enemies one of the other. For you there is dwelling and provision on the earth for a while.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Lord told them to leave the garden as each other's enemies and go to earth to dwell and benefit from the means therein for an appointed time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Go down, one of you is a foe unto the other; and for a fixed time you shall stay on earth and feed in it.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"Get down, one of you an enemy to the other. On earth will be a dwelling place for you and an enjoyment for a time.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Get forth, some of you, the enemies of others, and there is for you in the earth an abode and a provision for a time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Said He, 'Get you down, each of you an enemy to each. In the earth a sojourn shall be yours, and enjoyment for a time.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: Go down (from hence), one of you a foe unto the other. There will be for you on earth a habitation and provision for a while.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, \"Go down from here as enemies to each other. For a while, there is an abode for you and a provision on earth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah said: get ye down, one of you an enemy unto anot her; and for you on the earth there shall be a habitation and provision for a season.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, ‘Get down, being enemies of one another! On the earth shall be your abode and sustenance for a time.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"Get ye down. With enmity between yourselves. On earth will be your dwelling-place and your means of livelihood,- for a time.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) said: \"Get down, one of you an enemy to the other [i.e. Adam, Hawwa (Eve), and Shaitan (Satan), etc.]. On earth will be a dwelling-place for you and an enjoyment, - for a time.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said: 'Descend, each of you an enemy to each other. The earth will be a dwelling place for you and an enjoyment for a time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He said, “Fall, some of you enemies to one another. On earth you will have residence and livelihood for a while.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah] said, \"Descend, being to one another enemies. And for you on the earth is a place of settlement and enjoyment for a time.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:24] Said He, ‘Go down, that is, Adam and Eve, with all those you comprise of your seed, each of you, each seed, an enemy to the other, on account of the wrong each does to the another. There will be for you on earth an abode, a place of settlement, and enjoyment for a while’, [until] your terms [of life] are fulfilled.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nطوَى القرآن هنا ذكر التّوبة على آدم : لأنّ المقصود من القصّة في هذه السّورة التّذكير بعداوة الشّيطان وتحذير النّاس من اتّباع وسوسته ، وإظهار ما يُعقبه اتّباعه من الخسران والفساد ، ومقام هذه الموعظة يقتضي الإعراض عن ذكر التّوبة للاقتصار على أسباب الخسارة ، وقد ذكرت التّوبة في آية البقرة المقصودِ منها بيان فضل آدم وكرامته عند ربّه ، ولكلّ مقامً مَقال . والخطابُ لآدم وزوجه وإبليسَ . والأمر تكويني ، وبه صار آدم وزوجه وإبليسُ من سكّان الأرض .وجملة : { بعضكم لبعض عدو } في موضع الحال من ضمير : { اهبطوا } المرفوععِ بالأمر التّكويني فهذه الحال أيضاً تفيد معنى تكوينياً وهو مقارنة العداوة بينهم لوجودهما في الأرض ، وهذا التّكوين تأكّدت به العداوة الجبلية السّابقة فرسخت وزادت ، والمراد بالبعض البعض المخالف في الجنس ، فأحد البعضين هو آدم وزوجه ، والبعض الآخر هو إبليس ، وإذ قد كانت هذه العداوة تكوينيّة بين أصلي الجنسين ، كانت موروثة في نسليهما ، والمقصود تذكير بني آدم بعداوة الشّيطان لهم ولأصلهم ليتّهموا كلّ وسوسة تأتيهم من قِبله ، وقد نشأت هذه العداوة عن حَسد إبليس ، ثمّ سَرت وتشجرت فصارت عداوة تامة في سائر نواحي الوجود ، فهي منبثّة في التّفكير والجسد ، ومقتضية تمام التّنافر بين النّوعين .وإذ قد كانت نفوس الشّياطين داعية إلى الشرّ بالجبلة تعين أن عقل الإنسان منصرف بجبلته إلى الخير ، ولكنّه معرّض لوسوسة الشّياطين فيقع في شذوذ عن أصل فطرته ، وفي هذا ما يكون مفتاحاً لمعنى كون النّاس يولدون على الفطرة ، وكون الإسلام دين الفطرة ، وكون الأصل في النّاس الخير . أمَّا كون الأصل في النّاس العدالة أو الجرح فذلك منظور فيه إلى خشية الوقوع في الشّذوذ ، من حيث لا يدري الحاكم ولا الراوي ، لأنّ أحوال الوقوع في ذلك الشّذوذ مبهمة فوجب التّبصّر في جميع الأحوال .وعطفت جملة : { ولكم في الأرض مستقر } على جملة : { بعضكم لبعض عدو }.والمستقرّ مصدر ميمي والاستقرار هو المكث وقد تقدّم القول فيه عند قوله تعالى : { لكل نبإ مستقر } \\[ الأنعام : 67 \\] وقوله { فمستقر ومستودع } في سورة الأنعام ( 98 ).والمراد به الوجود أي وجود نوع الإنسان وبخصائصه وليس المراد به الدفن كما فسر به بعض المفسرين لأنّ قوله ومتاع يُصد عن ذلك ولأنّ الشّياطين والجنّ لا يُدفنون في الأرض .والمتاع والتّمتّع : نيل الملذّات والمرغوبات غير الدّائمة ، ويطلق المتاع على ما يُتمتّع به وينتفع به من الأشياء ، وتقدّم في قوله تعالى : { لو تغفلون عن أسلحتكم وأمتعتكم } في سورة النّساء ( 102 ).والحِين المدّة من الزّمن ، طويلة أو قصيرة ، وقد نكر هنا ولم يحدّد لاختلاف مقداره باختلاف الأجناس والأفراد ، والمراد به زمن الحياة التي تخول صاحبها إدراك اللّذّات ، وفيه يحصل بقاء الذّات غير متفرّقة ولا متلاشية ولا معدومة ، وهذا الزّمن المقارن لحالة الحياة والإدراك هو المسمّى بالأجل ، أي المدّة التي يبلغ إليها الحيّ بحياته في علم الله تعالى وتكوينِه ، فإذا انتهى الأجل وانعدمت الحياة انقطع المستقَر والمتاع ، وهذا إعلام من الله بما قدّره للنّوعين ، وليس فيه امتنان ولا تنكيل بهم .\n\n",
      "translations": [
        {
          "translation": "(He said: Go down (from hence)) from Paradise, (one of you a foe unto the other) meaning: Adam, Eve, the serpent and the peacock. (There will be for you on earth a habitation) a dwelling and shelter (and provision for a while) until death.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَمَتَاعٌ إِلَىٰ حِينٍ } معناهُ إِلى وَقتٍ\n والمَتاعُ: الزَّادُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \" {And a provision for a while} \" means until a time.\n\n\nThe term \"mata'\" refers to anything that is of temporary use or enjoyment.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ لباساً يواري سوآتكم } أي: شريعة تستر قبائح أوصافكم وفواحش أفعالكم { وريشاً } أي: جمالاً يبعدكم عن شبه الأنعام المهملة ويزينكم بالأخلاق الحسنة والأعمال الجميلة { ولباس التقوى } أي: صفة الورع والحذر من صفة النفس { ذلك خير } من جملة أركان الشرائع لأنه أصل الدين وأساسه كالحمية في العلاج { ذلك من آيات الله } أي: من أنوار صفاته\n إذ الاجتناب عن صفات النفس لا يحصل ولا يتيسر إلا بظهور تجليات صفات الحق\n وإلى هذا أشار القوم بقولهم: إن الله لا يتصرّف في شيء من العبد إلا ويعوّضه أحسن منه من جنسه { لعلكم تذكرون } عند ظهور تجليات لباسكم النوري الأصلي أو جوار الحق الذي كنتم تسكنون فيه بهداية أنوار الصفات { لا يفتنكم الشيطان } عن دخول الجنة وملازمتها بنزع لباس الشريعة والتقوى عنكم { كما أخرج أبويكم } منها بنزع اللباس الفطري النوري",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n حيث { قَالَ ٱهْبِطُواْ } انزلوا وانحطوا أيها المتجاوزون عن حدودنا أصلاً وفرعاً\n تابعاً ومتبوعاً عن مقر العز ومرتبة الإطلاق والتجريد الخالي عن جميع الإضافات\n والتقييد إلى محل الكون والفساد\n ومنزل البغي والعناد\n إذ { بَعْضُكُمْ } في دار الدنيا التي هي نشأة الاختبار والابتلاء { لِبَعْضٍ عَدُوٌّ } أبداً لا يرتفع الخصومة عنكم أصلاً { وَلَكُمْ } أيها المتخاصمون { فِي ٱلأَرْضِ } أي: مرتع الطبيعة { مُسْتَقَرٌّ } موضع قرار { وَمَتَاعٌ } تمتع من لذاتها وشهواتها { إِلَىٰ حِينٍ } [الأعراف: 24] أي: على انقضاء آجالكم وانقطاع مآلكم\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قال اهبطوا } الخطاب لآدم وحواء وذريتهما\n أو: لهما ولإبليس\n وكرر الأمر له تبعًا ليعلم أنهم قرناء له أبدًا\n حال كونكم { بعضُكم لبعض عدوٌ } أي: متعادين\n { ولكم في الأرض مستقر } أي: استقرار\n { ومتاعٌ } أي: تمتع\n { إلى حين } انقضاء آجالكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:36",
      "similarity": 0.6229217361268475
    },
    {
      "verse": "20:123",
      "similarity": 0.6040949221592328
    },
    {
      "verse": "11:48",
      "similarity": 0.5696350200861378
    },
    {
      "verse": "7:13",
      "similarity": 0.5684468173863914
    },
    {
      "verse": "2:38",
      "similarity": 0.529979133665944
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007024.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007024.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:24.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}