{
  "chapter": "الأعراف",
  "text": "يبنى ءادم قد انزلنا عليكم لباسا يورى سوءتكم وريشا ولباس التقوى ذلك خير ذلك من ءايت الله لعلهم يذكرون",
  "translations": [
    {
      "translation": "Children of Adam! We have sent down clothing to you to conceal your private parts, and fine apparel, but the garment of taqwa - that is best! That is one of Allah's Signs, so that hopefully you will pay heed.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O sons of Adam, We have revealed to you a dress that would both hide your nakedness and be an adornment, but the raiment of piety is best. This is one of the tokens of God: You may haply reflect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! Indeed We have sent down to you a garment which covers your shame and provides protection and adornment. But the finest of all is the garment of piety. That is one of the signs of Allah so that they may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam, We have given you clothing to cover your private parts and for beauty, but the robe of piety is the best. Thus is the guidance of God so that you may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Descendants of Adam! We have sent down to you a garment to conceal your shame, and another garment for your elegance; and the garment of piety – that is the best; this is among the signs of Allah, so that they may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! We have bestowed Libas (raiment) upon you to cover yourselves with, and as Rish (adornment); and the Libas (raiment) of Taqwa, that is better. Such are among the Ayat of Allah, that they may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O children of Adam! We have indeed sent down to you clothing to cover your shame, and (clothing) for beauty and clothing that guards (against evil), that is the best. This is of the communications of Allah that they may be mindful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam! We have sent down on you a garment to cover your shameful parts, and feathers; and the garment of godfearing -- that is better; that is one of God's signs; haply they will remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! We have revealed unto you raiment to conceal your shame, and splendid vesture, but the raiment of restraint from evil, that is best. This is of the revelations of Allah, that they may remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O children of Adam! We have sent down to you clothes to cover your nakedness, and to be pleasing to the eye; but the raiment of righteousness is the best. That is one of the signs of God. So that people may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! verily We have sent down unto you a garment covering your shame and as an adornment; and the garment of piety --that is the best. That is of the signss of Allah, that haply they may be admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘O Children of Adam! We have certainly sent down to you garments to cover your nakedness, and for adornment. Yet the garment of Godwariness—that is the best.’ That is [one] of Allah’s signs, so that they may take admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye Children of Adam! We have bestowed raiment upon you to cover your shame, as well as to be an adornment to you. But the raiment of righteousness,- that is the best. Such are among the Signs of Allah, that they may receive admonition!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! We have bestowed raiment upon you to cover yourselves (screen your private parts, etc.) and as an adornment, and the raiment of righteousness, that is better. Such are among the Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) of Allah, that they may remember (i.e. leave falsehood and follow truth).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam! We have sent down to you clothing that covers your nakedness, and feathers. But the clothing of piety that is better. That is one of the signs of Allah, in order that they remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O children of Adam! We have provided you with clothing to cover your bodies, and for luxury. But the clothing of piety—that is best. These are some of God’s revelations, so that they may take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O children of Adam, We have bestowed upon you clothing to conceal your private parts and as adornment. But the clothing of righteousness - that is best. That is from the signs of Allah that perhaps they will remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:26] O Children of Adam! We have sent down on you a garment, that is, We have created it for you, to conceal, to cover up, your shameful parts, and feathers, meaning all that one adorns oneself with of garments, and the garment of God-fearing, righteous deeds and virtuous traits (read as libāsa’l-taqwā, ‘the garment of Godfearing’, as a supplement to the preceding libāsan, ‘a garment’; or read as libāsu’l-tawqā as the subject, the predicate of which is the [following] sentence) that is best; that is one of God’s signs, the proofs of His power; perhaps they will remember, and believe (the address shifts from the second [to the third] person).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 Children of Adam! We have revealed unto you) We have created and given you (raiment) clothes of cotton, wool and fur (to conceal your shame) your nakedness, (and splendid vesture) properties and stuff, that is the furniture of the house, (but the raiment of restraint from evil) the raiment of profession of Allah's divine Oneness and of abstinence, (that is best) better than the raiment of cotton. (This) the raiment of cotton (is of the revelations of Allah) of the marvels of Allah, (that they may remember) take admonition.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَرِيشاً وَلِبَاسُ ٱلتَّقْوَىٰ } والرِّيشُ والرِّياشُ: ما ظَهَرَ من اللباسِ\n والرِّياشُ أيضاً: المعاشُ والخِصْبُ\n\n\n\n\nوقوله تعالى: { وَلِبَاسُ ٱلتَّقْوَىٰ } الحياءُ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"And {with clothes of righteousness},\" and the riyash and the riyash: what is apparent of the clothing.\n\n\nAnd the reed also: the livelihood and the sustenance.\n\n\nAnd His saying, {And the clothing of taqwa} is modesty.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه منادياً لكم في مقام الامتنان وتعديد النعم والإحسان؛ لتواظبوا شكر نعمه، وتداوموا على انقياده وإطاعته بعدما صدر عنكم الكفر والخروج عن مقتضى أمره ونهيه: { يَٰبَنِيۤ ءَادَمَ } المجبولين على فطرة الخلافة والنيابة { قَدْ أَنزَلْنَا } من مقام جودنا { عَلَيْكُمْ لِبَاساً } عقلاً مدبراً { يُوَارِي } ويستر بتدبيره { سَوْءَاتِكُمْ } مقتضيات بشريتكم وبهيميتكم { وَ } أيضاً وهبنا لكم من غاية لطفنا { رِيشاً } معارف وحقائق نزينكم ونميزكم بها عن جميع المخلوقات، ونستخلفكم بسببها من بين سائر البريات { وَلِبَاسُ ٱلتَّقْوَىٰ } عن محارم الله، والاجتناب عن منهياته خير لكم وحقيق لفطرتكم، فعليكم أن تلبسوها وتتحفظوا بها عما لا يليق بمرتبتكم وفطرتكم { ذٰلِكَ } أي: التقوى { خَيْرٌ } لكم إن أردتم أن تصلوا إلى مرتبة التوحيد التي جبلتم لأجلها { ذٰلِكَ } أي: المذكور { مِنْ آيَاتِ ٱللَّهِ } الدالة على استقلاله في ألوهيته وربوبيته، إنما أنزلها عليهم { لَعَلَّهُمْ يَذَّكَّرُونَ } [الأعراف: 26] رجاء أن يتذكروا نعمه فيعرفوا المنعم وينكشفوا بتوحيده\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: من قرأ: { لباس } بالرفع، فهو متبدأ، والجملة: خبر، والرابط: الإشارة، والريش: لباس الزينة، مستعار من ريش الطير\n يقول الحقّ جلّ جلاله: { يا بني آدم قد أنزلنا عليكم لباسًا } أي: خلقناه لكم بتدبيرات سماوية وأسباب نازلة، ونظيره: قوله تعالى:\n\n[الزُّمر:6]، وقوله تعالى:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:27",
      "similarity": 0.14850021729466525
    },
    {
      "verse": "7:35",
      "similarity": 0.08629461777704252
    },
    {
      "verse": "6:82",
      "similarity": 0.08387674385742687
    },
    {
      "verse": "6:9",
      "similarity": 0.08211287947974769
    },
    {
      "verse": "5:27",
      "similarity": 0.08192323914675353
    }
  ]
}