{
  "chapter": "الأعراف",
  "text": "يبنى ءادم لا يفتننكم الشيطن كما اخرج ابويكم من الجنة ينزع عنهما لباسهما ليريهما سوءتهما انه يرىكم هو وقبيله من حيث لا ترونهم انا جعلنا الشيطين اولياء للذين لا يؤمنون",
  "translations": [
    {
      "translation": "Children of Adam! do not let Shaytan tempt you into trouble as He expelled your parents from the Garden, stripping them of their covering and disclosing to them their private parts. He and his tribe see you from where you do not see them. We have made the shaytans friends of those who have no iman.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O sons of Adam, let not Satan beguile you as he did your parents out of Eden, and made them disrobe to expose their disgrace to them. For he and his host can see you from where you cannot see them. We have made the devils the friends of those who do not believe,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam! Let not Satan deceive you in the manner he deceived your parents out of Paradise, pulling off from them their clothing to reveal to them their shame. He and his host surely see you from whence you do not see them. We have made satans the guardians of those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam, do not let Satan seduce you, as he caused your parents to be expelled from the garden and made them take off their clothes in order to show them their private parts. Satan and those like him see you but you do not see them. We have made the Satans as friends for those who have no faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Descendants of Adam, beware! Do not let Satan put you in trial the way he removed your parents from Paradise and had their garments removed so that their shame become visible to them; indeed he and his tribe see you from where you do not see them; indeed We have made the devils the friends of those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! Let not Shaytan deceive you, as he got your parents out of Paradise, stripping them of their raiment, to show them their private parts. Verily, he and his tribe see you from where you cannot see them. Verily, We made the Shayatin friends of those who believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O children of Adam! let not the Shaitan cause you to fall into affliction as he expelled your parents from the garden, pulling off from them both their clothing that he might show them their evil inclinations, he surely sees you, he as well as his host, from whence you cannot see them; surely We have made the Shaitans to be the guardians of those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam! Let not Satan tempt you as he brought your parents out of the Garden, stripping them of their garments to show them their shameful parts. Surely he sees you, he and his tribe, from where you see them not. We have made the Satans the friends of those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! Let not Satan seduce you as he caused your (first) parents to go forth from the Garden and tore off from them their robe (of innocence) that he might manifest their shame to them. Lo! he seeth you, he and his tribe, from whence ye see him not. Lo! We have made the devils protecting friends for those who believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam, do not let Satan seduce you, just as he turned your parents out of the Garden: he deprived them of their garment in order to make them aware of their nakedness. He and his forces watch you from where you do not see them! We have made the devils friends of those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! let not the Satan tempt you even as he drave forth your parents from the Garden, divesting the twain of their garment that he might discover unto the twain their shame. Verily he beholdeth you, he and his tribe, in such wise that ye behold them not. Verily We have made the Satans patrons of those only who believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "‘O Children of Adam! Do not let Satan tempt you, like he expelled your parents from paradise, stripping them of their garments to expose to them their nakedness. Indeed he sees you—he and his hosts—whence you do not see them. We have indeed made the devils friends of those who have no faith.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye Children of Adam! Let not Satan seduce you, in the same manner as He got your parents out of the Garden, stripping them of their raiment, to expose their shame: for he and his tribe watch you from a position where ye cannot see them: We made the evil ones friends (only) to those without faith.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! Let not Shaitan (Satan) deceive you, as he got your parents [Adam and Hawwa (Eve)] out of Paradise, stripping them of their raiments, to show them their private parts. Verily, he and Qabiluhu (his soldiers from the jinns or his tribe) see you from where you cannot see them. Verily, We made the Shayatin (devils) Auliya' (protectors and helpers) for those who believe not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam! Do not let satan tempt you, as he brought your parents out of Paradise. He stripped them of their garments to show them their shameful parts. Indeed he and his descendants see you from where you cannot see them. We have made the satans supporters of those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! Do not let Satan seduce you, as he drove your parents out of the Garden, stripping them of their garments, to show them their nakedness. He sees you, him and his clan, from where you cannot see them. We have made the devils friends of those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O children of Adam, let not Satan tempt you as he removed your parents from Paradise, stripping them of their clothing to show them their private parts. Indeed, he sees you, he and his tribe, from where you do not see them. Indeed, We have made the devils allies to those who do not believe.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:27] O Children of Adam! Let not Satan tempt you, lead you astray, that is, do not follow him, lest you fall into temptation, as he caused your parents to go forth from the Garden, by tempting them, stripping (yanzi‘u is a circumstantial qualifier) them of their garments to manifest to them their shameful parts. Surely he, Satan, sees you, he and his tribe, his army, from where you do not see them — because of their ethereal bodies or their being colourless. We have made the devils friends, helpers and companions, of those who do not believe.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 Children of Adam! Let not Satan) Iblis (seduce you) make you slip with regard to obeying Me (as he caused your (first) parents) Adam and Eve (to go forth from the Garden and tore off) took away (from them their robe) the robe of light (that he might manifest their shame to them. Lo! he) Iblis (seeth you, he and his tribe) his soldiers, (from whence ye see him not) because your breasts are their dwellings. (Lo! We have made the devils protecting friends) helpers (for those who believe not) in Muhammad (pbuh) and in the Qur'an.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { إِنَّهُ يَرَاكُمْ هُوَ وَقَبِيلُهُ } [معناه] هو وأَمرُهُ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, “Indeed, He sees you, He and His angels” [means that] He and His affair",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم ناداهم وأوصاهم ثانياً بقوله: { يَابَنِيۤ ءَادَمَ } مقتضى خلافتكم ونيابتكم أن { لاَ يَفْتِنَنَّكُمُ ٱلشَّيْطَانُ } أي: لا يوقعنكم في الغي والضلال بغتة ووسوسة { كَمَآ أَخْرَجَ أَبَوَيْكُمْ } بالفتنة والغرور { مِّنَ ٱلْجَنَّةِ } هي دال السرور\n وأهبطهما بوسوسته إلى الأرض التي هي محل الفساد ومنشأ الشرور حين { يَنزِعُ عَنْهُمَا لِبَاسَهُمَا } أي: تسبب للنزع حين تغريرهما وإغرائهما إلى تناول المنهي { لِيُرِيَهُمَا سَوْءَاتِهِمَآ } انتقاماً منهما\n\n\nفعليكم أيها الأبناء أن تجتنبوا عن غوائله وتعوذوا إلى الله عن جميع مخايله\n وتتخذوه وقاية ووكيلاً حتى تتخلصوا عن وسوسة شياطين الأهواء المضلة\n وعليكم ألا تغفلوا عنه\n إذ { إِنَّهُ } دائماً { يَرَاكُمْ } ويراقبكم { هُوَ } إذ الشيطان نفسه { وَقَبِيلُهُ } جنوده الأمارة بالسوء رؤية صادرة عن محض العداوة { مِنْ حَيْثُ لاَ تَرَوْنَهُمْ } إذ هم متركزون في نفوسكم التي بين جنبيكم\n يضلكم ويغويكم على صورة الهداية والإرشاد\n فعليكم أن تخالفوا أهواء نفوسكم وتجانبوا مناها ومشتهياتها\n ومع ذلك تضرعوا نحونان وتعوذوا بنا { إِنَّا جَعَلْنَا } مقتضى حكتمنا المتقنة { ٱلشَّيَاطِينَ أَوْلِيَآءَ } مسلطين { لِلَّذِينَ لاَ يُؤْمِنُونَ } [الأعراف: 27] بتوحيدنا واستقلال استيلائنا",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:19",
      "similarity": 0.368561892527148
    },
    {
      "verse": "36:60",
      "similarity": 0.32895484004224207
    },
    {
      "verse": "78:10",
      "similarity": 0.31642827433758286
    },
    {
      "verse": "6:82",
      "similarity": 0.3135916929061909
    },
    {
      "verse": "6:9",
      "similarity": 0.30691485231914645
    }
  ]
}