{
  "chapter": "الأعراف",
  "text": "واذا فعلوا۟ فحشة قالوا۟ وجدنا عليها ءاباءنا والله امرنا بها قل ان الله لا يامر بالفحشاء اتقولون على الله ما لا تعلمون",
  "translations": [
    {
      "translation": "Whenever they commit an indecent act, they say, 'We found our fathers doing it and Allah commanded us to do it too.' Say: 'Allah does not command indecency. Do you say things about Allah you do not know?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who say when they commit shameful acts: \"Our ancestors used to do so, and God has enjoined us to do the same.\" Say to them: \"God never enjoins a conduct that is shameful. You impute such lies to God as you do not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when such people commit an indecent act they say: 'We found our fathers doing that, and Allah has enjoined it on us. Say: 'Surely Allah never enjoins any indecency. Do you say things regarding Allah that you do not know?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When (The faithless) commit indecent acts they say, \"We found our fathers doing this and God has commanded us to do the same.\" (Muhammad) tell them that God does not command anyone to commit indecency. Do you speak for God, saying things of which you have no knowledge?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they commit any shameful act they say, “We found our forefathers on it and Allah has commanded it to us”; say, “Indeed Allah does not ordain shamelessness; what! You attribute things to Allah, which you do not know?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they commit a Fahishah, they say: \"We found our fathers doing it, and Allah has commanded it for us.\" Say: \"Nay, Allah never commands Fahishah. Do you say about Allah what you know not\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they commit an indecency they say: We found our fathers doing this, and Allah has enjoined it on us. Say: Surely Allah does not enjoin indecency; do you say against Allah what you do not know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever they commit an indecency they say, 'We found our fathers practising it, and God has commanded us to do it.' Say: 'God does not command indecency; what, do you say concerning God such things as you know not?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they do some lewdness they say: We found our fathers doing it and Allah hath enjoined it on us. Say: Allah, verily, enjoineth not lewdness. Tell ye concerning Allah that which ye know not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they commit an indecency, they say, \"This is what our fathers used to do and God has enjoined it on us.\" Say, \"God does not enjoin what is indecent. Would you attribute to God something of which you have no knowledge?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they commit an indecency, they say: we found our fathers thereon, and God hath enjoined it on us. Say thou. verily Allah enjoineth not an indecency; say ye falsely of Allah that which ye know not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they commit an indecency, they say, ‘We found our fathers practising it, and Allah has enjoined it upon us.’ Say, ‘Indeed Allah does not enjoin indecencies. Do you attribute to Allah what you do not know?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they do aught that is shameful, they say: \"We found our fathers doing so\"; and \"Allah commanded us thus\": Say: \"Nay, Allah never commands what is shameful: do ye say of Allah what ye know not?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they commit a Fahisha (evil deed, going round the Ka'bah in naked state, every kind of unlawful sexual intercourse, etc.), they say: \"We found our fathers doing it, and Allah has commanded us of it.\" Say: \"Nay, Allah never commands of Fahisha. Do you say of Allah what you know not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they commit an indecency, they say: 'This is what we found our fathers practicing, and with it Allah has ordered us' Say: 'Allah does not order indecency. Would you tell of Allah what you do not know'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they commit an indecency, they say, “We found our parents doing this, and God has commanded us to do it.” Say, “God does not command indecencies. Are you attributing to God what you do not know?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they commit an immorality, they say, \"We found our fathers doing it, and Allah has ordered us to do it.\" Say, \"Indeed, Allah does not order immorality. Do you say about Allah that which you do not know?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:28] And when they commit any indecency, such as idolatry, or circumambulating the [Sacred] House naked, saying, ‘We cannot perform the circumambulations wearing clothes in which we were disobedient to God’ — and so they forbade this [wearing of clothes] — they say, ‘We found our fathers practising it, and so we followed their example, and God has, also, enjoined it on us’. Say, to them: ‘God does not enjoin indecency. Do you say concerning God that which you do not know?’, that He has said? (the interrogative is meant as a repudiation).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when they do some lewdness) when they forbid al-Bahirah, al-Sa'ibah, al-Wasilah and al-Ham, (they say: We found our fathers doing it) forbidding it (and Allah hath enjoined it on us) i.e. to forbid al-Bahirah, al-Sa'ibah, al-Wasilah and al-Ham. (Say) Muhammad: (Allah, verily, enjoineth not lewdness) transgressions and the forbidding of cattle and crops. (Tell ye) indeed you are saying (concerning Allah that which you know not) to be the case?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِذَا فَعَلُواْ } أي: هؤلاء الكافرون بوسوسة الشياطين { فَاحِشَةً } فعله ذميمة قبيحة متناهية في القبح { قَالُواْ } في الجواب: { وَجَدْنَا عَلَيْهَآ آبَاءَنَا } وهم يقولون: { وَٱللَّهُ أَمَرَنَا بِهَا } فيما أنزل علينا على لسان نبينا { قُلْ } يا أكمل الرسل { إِنَّ ٱللَّهَ } الهادي لعباده { لاَ يَأْمُرُ بِٱلْفَحْشَآءِ أَتَقُولُونَ } أيها المفترون { عَلَى ٱللَّهِ مَا لاَ تَعْلَمُونَ } [الأعراف: 28] لياقته بجنابه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: في وصف المشركين: { وإذا فعلوا فاحشة } أي: فعلة متناهية في القبح كعبادة الصنم، وكشف العورة في الطواف، احتجوا بفعل آبائهم فقالوا: { وجَدنَا عليها آباءنا واللهُ أمرنَا بها } فاعتذروا بعذرين باطلين: أحدهما: تقليد آبائهم، والآخر: افتراؤهم على الله، فأعرض عن الأول لظهور فساده، ورد الثاني بقوله: { قل إنَّ الله لا يأمرُ بالفحشاء } لأن الله تعالى جرت عادته على الأمر بمحاسن الأفعال ومكارم الخلال\n ولا حجة فيه للمعتزلة\n انظر البيضاوي\n والآية كأنها جواب سؤالين مترتبين كأنه قيل لهم: لِمَ فعلتم هذه الفواحش؟ قالوا: وجدنا عليها آباءنا، فقيل: ومن أين أخذها آباؤكم؟ قالوا: الله أمرنا بها، فكذبهم الله بقوله: { إن الله لا يأمر بالفحشاء أتقولون على الله ما لا تعلمون } ، أي: أتتقولون على الله ما لا علم لكم به إنكار يتضمن النهي عن الافتراء على الله",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:169",
      "similarity": 0.7213477567884082
    },
    {
      "verse": "27:54",
      "similarity": 0.5006635493581449
    },
    {
      "verse": "26:74",
      "similarity": 0.4588728117906977
    },
    {
      "verse": "7:80",
      "similarity": 0.44089466300356106
    },
    {
      "verse": "29:28",
      "similarity": 0.4298071234553325
    }
  ]
}