{
  "chapter": "الأعراف",
  "text": "واذا فعلوا۟ فحشة قالوا۟ وجدنا عليها ءاباءنا والله امرنا بها قل ان الله لا يامر بالفحشاء اتقولون على الله ما لا تعلمون",
  "translations": [
    {
      "translation": "Whenever they commit an indecent act, they say, 'We found our fathers doing it and Allah commanded us to do it too.' Say: 'Allah does not command indecency. Do you say things about Allah you do not know?'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who say when they commit shameful acts: \"Our ancestors used to do so, and God has enjoined us to do the same.\" Say to them: \"God never enjoins a conduct that is shameful. You impute such lies to God as you do not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when such people commit an indecent act they say: 'We found our fathers doing that, and Allah has enjoined it on us. Say: 'Surely Allah never enjoins any indecency. Do you say things regarding Allah that you do not know?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When (The faithless) commit indecent acts they say, \"We found our fathers doing this and God has commanded us to do the same.\" (Muhammad) tell them that God does not command anyone to commit indecency. Do you speak for God, saying things of which you have no knowledge?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they commit any shameful act they say, “We found our forefathers on it and Allah has commanded it to us”; say, “Indeed Allah does not ordain shamelessness; what! You attribute things to Allah, which you do not know?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they commit a Fahishah, they say: \"We found our fathers doing it, and Allah has commanded it for us.\" Say: \"Nay, Allah never commands Fahishah. Do you say about Allah what you know not\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they commit an indecency they say: We found our fathers doing this, and Allah has enjoined it on us. Say: Surely Allah does not enjoin indecency; do you say against Allah what you do not know?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And whenever they commit an indecency they say, 'We found our fathers practising it, and God has commanded us to do it.' Say: 'God does not command indecency; what, do you say concerning God such things as you know not?'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they do some lewdness they say: We found our fathers doing it and Allah hath enjoined it on us. Say: Allah, verily, enjoineth not lewdness. Tell ye concerning Allah that which ye know not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they commit an indecency, they say, \"This is what our fathers used to do and God has enjoined it on us.\" Say, \"God does not enjoin what is indecent. Would you attribute to God something of which you have no knowledge?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they commit an indecency, they say: we found our fathers thereon, and God hath enjoined it on us. Say thou. verily Allah enjoineth not an indecency; say ye falsely of Allah that which ye know not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they commit an indecency, they say, ‘We found our fathers practising it, and Allah has enjoined it upon us.’ Say, ‘Indeed Allah does not enjoin indecencies. Do you attribute to Allah what you do not know?’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they do aught that is shameful, they say: \"We found our fathers doing so\"; and \"Allah commanded us thus\": Say: \"Nay, Allah never commands what is shameful: do ye say of Allah what ye know not?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they commit a Fahisha (evil deed, going round the Ka'bah in naked state, every kind of unlawful sexual intercourse, etc.), they say: \"We found our fathers doing it, and Allah has commanded us of it.\" Say: \"Nay, Allah never commands of Fahisha. Do you say of Allah what you know not?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When they commit an indecency, they say: 'This is what we found our fathers practicing, and with it Allah has ordered us' Say: 'Allah does not order indecency. Would you tell of Allah what you do not know'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they commit an indecency, they say, “We found our parents doing this, and God has commanded us to do it.” Say, “God does not command indecencies. Are you attributing to God what you do not know?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they commit an immorality, they say, \"We found our fathers doing it, and Allah has ordered us to do it.\" Say, \"Indeed, Allah does not order immorality. Do you say about Allah that which you do not know?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:28] And when they commit any indecency, such as idolatry, or circumambulating the [Sacred] House naked, saying, ‘We cannot perform the circumambulations wearing clothes in which we were disobedient to God’ — and so they forbade this [wearing of clothes] — they say, ‘We found our fathers practising it, and so we followed their example, and God has, also, enjoined it on us’. Say, to them: ‘God does not enjoin indecency. Do you say concerning God that which you do not know?’, that He has said? (the interrogative is meant as a repudiation).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\n{ وإذا فعلوا فاحشة } معطوف على { للذين لا يؤمنون } \\[ الأعراف : 27 \\] فهو من جملة الصّلة ، وفيه إدماج لكشف باطلهم في تعلّلاتهم ومعاذيرهم الفاسدة ، أي للذين لا يقبلون الإيمان ويفعلون الفواحش ويعتذرون عن فعلها بأنّهم اتّبعوا آباءهم وأنّ الله أمرهم بذلك ، وهذا خاص بأحوال المشركين المكذّبين ، بقرينة قوله : { قل إن الله لا يأمر بالفحشاء } والمقصود من جملتي الصّلة : تفظيع حال دينهم بأنّه ارتكاب فواحش ، وتفظيع حال استدلالهم لها بما لا ينتهض عند أهل العقول . وجاء الشّرط بحرف { إذا } الذي من شأنه إفادة اليقين بوقوع الشّرط ليشير إلى أنّ هذا حاصل منهم لا محالة .والفاحشة في الأصل صفة لموصوف محذوف أي : فَعْلَة فاحشة ثمّ نزل الوصف منزلة الاسم لكثرة دورانه ، فصارت الفاحشة اسماً للعمل الذّميم ، وهي مشتقّة من الفُحْش بضمّ الفاء وهو الكثرة والقوّة في الشّيء المذموم والمكروه ، وغلبت الفاحشة في الأفعال الشّديدة القبح وهي التي تنفر منها الفطرة السّليمة ، أو ينشأ عنها ضرّ وفساد بحيث يأباها أهل العقول الرّاجحة ، وينكرها أولو الأحلام ، ويستحيي فاعلها من النّاس ، ويتستر من فعلها مثل البغاء والزّنى والوأد والسّرقة ، ثمّ تنهى عنها الشّرائع الحقّة ، فالفعل يوصف بأنّه فاحشة قبل ورود الشّرع ، كأفعال أهل الجاهليّة ، مثل السّجود للتّماثيل والحجارة وطلب الشّفاعة منها وهي جماد ، ومثل العراء في الحجّ ، وترك تسمية الله على الذّبائح ، وهي من خَلق الله وتسخيره ، والبغاء ، واستحلال أموال اليتامى والضّعفاء ، وحرمان الأقارب من الميراث ، واستشارة الأزلام في الإقدام على العمل أو تركه ، وقتل غير القاتل لأنّه من قبيلة القاتل ، وتحريمهم على أنفسهم كثيراً من الطيّبات التي أحلّها الله وتحليلهم الخبائث مثل الميتة والدّم . وقد روي عن ابن عبّاس أنّ المراد بالفاحشة في الآية التّعري في الحجّ ، وإنّما محمل كلامه على أنّ التّعرّي في الحجّ من أوّل ما أريد بالفاحشة لاقصرها عليه فكأن أيمّة الشّرك قد أعدوا لأتباعهم معاذير عن تلك الأعمال ولقنوها إياهم ، وجِماعها أن ينسبوها إلى آبائهم السالِفين الذين هم قدوة لخلفهم ، واعتقدوا أنّ آباءهم أعلم بما في طي تلك الأعمال من مصالح لو اطّلع عليها المنكرون لعرفوا ما أنكروا ، ثمّ عطفوا على ذلك أنّ الله أمر بذلك يعنون أنّ آباءهم ما رسموها من تلقاء أنفسهم ، ولكنّهم رسموها بأمر من الله تعالى ، ففهم منه أنّهم اعتذروا لأنفسهم واعتذروا لآبائهم ، فمعنى قولهم : { والله أمرنا بها } ليسَ ادّعاءَ بلوغ أمر من الله إليهم ولكنّهم أرادوا أنّ الله أمر آباءهم الذين رسموا تلك الرّسوم وسنّوها فكان أمرُ الله آباءَهم أمراً لهم ، لأنّه أراد بقاء ذلك في ذريّاتهم ، فهذا معنى استدلالهم ، وقد أجمله إيجاز القرآن اعتماداً على فطنة المخاطبين .وأسند الفعل والقول إلى ضمير الذين لا يؤمنون في قوله : { وإذا فعلوا فاحشة قالوا } : على معنى الإسناد إلى ضمير المجموع ، وقد يكون القائل غير الفاعل ، والفاعل غير قائل ، اعتداداً بأنّهم لما صَدّق بعضهم بعضاً في ذلك فكأنّهم فعلوه كلّهم واعتذروا عنه كلّهم .وأفاد الشّرط رَبْطاً بين فعلهم الفاحشة وقولهم : { وجدنا عليها آباءنا } باعتبا إيجاز في الكلام يدلّ عليه السّياق ، إذ المفهوم أنّهم إذا فعلوا فاحشة فأنكِرَتْ عليهم أو نُهوا عنها قالوا وجدنا عليها آباءنا ، وليس المراد بالإنكار والنّهي خصوص نهي الإسلام إياهم عن ضلالهم ، ولكن المراد نهيُ أيّ ناه وإنكارُ أيّ منكر ، فقد كان ينكر عليهم الفواحش من لا يوافقونهم عليها من القبائل ، فإنّ دين المشركين كان أشتاتاً مختلفاً ، وكان ينكر عليهم ذلك من خلعوا الشّرك من العرب مثل زيد بن عمرو بن نفيل ، وأمّيةَ ابن أبي الصَّلْت ، وقد قال لهم زيد بن عمرو : «إنّ الله خلق الشّاة وأنزل لها الماء من السّماء وأنبت لها العشب ثمّ أنتم تذبحونها لغيره» وكان ينكر عليهم من يتحَرج من أفعالهم ثمّ لا يسعه إلاّ اتّباعهم فيها إكراهاً .وكان ينكر عليهم من لا توافق أعمالُهم هواه : كما وقع لامرىء القيس ، حيث عزم على قتال بني أسد بعد قتلهم أباه حُجْراً ، فقصد ذا الخَلَصة صنمَ خَثْعَمَ واستقسم عنده بالأزلام فخرج له النّاهي فكسر الأزلام وقال :لو كنتَ يا ذا الخَلَص الموتورا ... مِثْلي وكان شيخُك المقبورالَمْ تنهَ عن قتل العُداة زُوراً ... ثمّ جاء الإسلام فنعى عليهم أعمالهم الفاسدة ، وأسمعهم قوارع القرآن فحينئذ تصدّوا للاعتذار . وقد علم من السّياق تشنيع معذرتهم وفساد حجّتهم .ودلّت الآية على إنكار ما كان مماثلاً لهذا الاستدلال وهو كلّ دليل توكأ على اتّباع الآباء في الأمور الظّاهر فسادها وفحشها ، وكلّ دليل استند إلى ما لا قبل للمستدل بعلمه ، فإنّ قولهم : { والله أمرنا بها } دعوى باطلة إذ لم يبلغهم أمر الله بذلك بواسطة مبلّغ ، فإنّهم كانوا ينكرون النّبوءة ، فمن أين لهم تلقي مراد الله تعالى .وقد ردّ الله ذلك عليهم بقوله لرسوله : { قل إن الله لا يأمرنا بالفحشاء } فَأعْرَضَ عن ردّ قولهم : { وجدنا عليها آباءنا } لأنّه إن كان يراد ردّه من جهة التّكذيب فهم غير كاذبين في قولهم ، لأنّ آباءهم كانوا يأتون تلك الفواحش ، وإن كان يراد ردّه من جهة عدم صلاحيته للحجّة فإنّ ذلك ظاهر ، لأنّ الإنكار والنّهي ظاهر انتقالهما إلى آبائهم ، إذ ما جاز على المثل يجوز على المماثل ، فصار ردّ هذه المقدّمة من دليلهم بديهياً وكان أهمّ منه ردّ المقدّمة الكبرى ، وهي مناط الاستدلال ، أعني قولهم : { والله أمرنا بها }.فقوله : { قل إن الله لا يأمر بالفحشاء } نقض لدعواهم أنّ الله أمَرهم بها أي بتلك الفواحش ، وهو ردّ عليهم ، وتعليم لهم ، وإفاقة لهم من غرورهم ، لأنّ الله متّصف بالكمَال فلا يأمر بما هو نقص لم يرضه العقلاء وأنكروه ، فكون الفعل فاحشة كاف في الدّلالة على أنّ الله لا يأمر به لأنّ الله له الكمال الأعلى ، وما كان اعتذارهم بأنّ الله أمر بذلك إلاّ عن جهل ، ولذلك وبَّخهم الله بالاستفهام التّوبيخي بقوله : { أتقولون على الله ما لا تعلمون } أي ما لا تعلمون أنّ اللهأمر به ، فحُذف المفعول لدلالة ما تقدّم عليه ، لأنّهم لم يعلموا أنّ الله أمرهم بذلك إذ لا مستند لهم فيه ، وإنّما قالوه عن مجرّد التّوهّم ، ولأنّهم لم يعلموا أنّ الله لا يليق بجلاله وكماله أن يأمر بمثل تلك الرّذائل .وضمن : { تقولون } معنى تكذيون أو معنى تتقَوّلون ، فلذلك عُدّي بعَلى ، وكان حقّه أن يعدى بعَنْ لو كان قولاً صحيح النّسبة ، وإذ كان التّوبيخ وارداً على أن يقولوا على الله ما لا يعلمون كان القول على الله بما يُتحقّق عدمُ وروده من الله أحرى .وبهذا الرد تمحض عملهم تلك الفواحش للضّلال والغرور واتّباع وحي الشّياطين إلى أوليائهم أيمّة الكفر ، وقادة الشّرك : مثل عَمْرو بن لُحَي ، الذي وَضَعَ عبادة الأصنام ، ومثل أبي كَبشة ، الذي سنّ عبادة الشّعري من الكواكب ، ومثل ظالم بن أسْعد ، الذي وضع عبادة العُزى ، ومثل القلَمَّسسِ ، الذي سنّ النَّسيء إلى ما اتّصل بذلك من موضوعات سدنة الأصنام وبيوتتِ الشّرك .واعلم أن ليس في الآية مستند لإبطال التّقليد في الأمور الفرعيّة أو الأصول الدّينيّة لأنّ التّقليد الذي نعاه الله على المشركين هو تقليدهم مَن ليسوا أهلاً لأنّ يقلَّدوا ، لأنّهم لا يرتفعون عن رتبة مقلِّديهم ، إلاّ بأنّهم أقدم جيلاً ، وأنّهم آباؤهم ، فإنّ المشركين لم يعتذروا بأنّهم وجدوا عليه الصّالحين وهداة الأمّة ، ولا بأنّه ممّا كان عليه إبراهيم وأبناؤه ، ولأنّ التّقليد الذي نعاه الله عليهم تقليد في أعمال بديهيّة الفساد ، والتّقليد في الفساد يستوي ، هو وتسنينه ، في الذّم ، على أنّ تسنين الفساد أشدّ مذمّة من التّقليد فيه كما أنبأ عنه الحديث الصّحيح : « مَا من نفس تُقتل ظُلماً إلاّ كان على ابنِ آدم الأولِ كِفْل من دمها ذلك لأنّه أوّلُ من سَنّ القتل » وحديث : « مَن سَنّ سُنّة سَيِّئة فعليه وزرها ووزر من عَمِل بها إلى يوم القيامة » . فما فرضه الذين ينزعون إلى علم الكلام من المفسّرين في هذه الآية من القول في ذمّ التّقليد ناظر إلى اعتبار الإشراك داخلاً في فعل الفواحش .\n\n",
      "translations": [
        {
          "translation": "(And when they do some lewdness) when they forbid al-Bahirah, al-Sa'ibah, al-Wasilah and al-Ham, (they say: We found our fathers doing it) forbidding it (and Allah hath enjoined it on us) i.e. to forbid al-Bahirah, al-Sa'ibah, al-Wasilah and al-Ham. (Say) Muhammad: (Allah, verily, enjoineth not lewdness) transgressions and the forbidding of cattle and crops. (Tell ye) indeed you are saying (concerning Allah that which you know not) to be the case?\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِذَا فَعَلُواْ } أي: هؤلاء الكافرون بوسوسة الشياطين { فَاحِشَةً } فعله ذميمة قبيحة متناهية في القبح { قَالُواْ } في الجواب: { وَجَدْنَا عَلَيْهَآ آبَاءَنَا } وهم يقولون: { وَٱللَّهُ أَمَرَنَا بِهَا } فيما أنزل علينا على لسان نبينا { قُلْ } يا أكمل الرسل { إِنَّ ٱللَّهَ } الهادي لعباده { لاَ يَأْمُرُ بِٱلْفَحْشَآءِ أَتَقُولُونَ } أيها المفترون { عَلَى ٱللَّهِ مَا لاَ تَعْلَمُونَ } [الأعراف: 28] لياقته بجنابه\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: في وصف المشركين: { وإذا فعلوا فاحشة } أي: فعلة متناهية في القبح كعبادة الصنم\n وكشف العورة في الطواف\n احتجوا بفعل آبائهم فقالوا: { وجَدنَا عليها آباءنا واللهُ أمرنَا بها } فاعتذروا بعذرين باطلين: أحدهما: تقليد آبائهم\n والآخر: افتراؤهم على الله\n فأعرض عن الأول لظهور فساده\n ورد الثاني بقوله: { قل إنَّ الله لا يأمرُ بالفحشاء } لأن الله تعالى جرت عادته على الأمر بمحاسن الأفعال ومكارم الخلال\n ولا حجة فيه للمعتزلة\n انظر البيضاوي\n والآية كأنها جواب سؤالين مترتبين كأنه قيل لهم: لِمَ فعلتم هذه الفواحش؟ قالوا: وجدنا عليها آباءنا\n فقيل: ومن أين أخذها آباؤكم؟ قالوا: الله أمرنا بها\n فكذبهم الله بقوله: { إن الله لا يأمر بالفحشاء أتقولون على الله ما لا تعلمون } \n أي: أتتقولون على الله ما لا علم لكم به إنكار يتضمن النهي عن الافتراء على الله\n { قل أمرَ ربي بالقسط } أي: العدل\n وهو الوسط من كل أمر\n المتجافي عن طرفي الإفراط والتفريط",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:169",
      "similarity": 0.7213477567884082
    },
    {
      "verse": "27:54",
      "similarity": 0.5006635493581449
    },
    {
      "verse": "26:74",
      "similarity": 0.4588728117906977
    },
    {
      "verse": "7:80",
      "similarity": 0.44089466300356106
    },
    {
      "verse": "29:28",
      "similarity": 0.4298071234553325
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007028.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007028.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:28.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}