{
  "chapter": "الأعراف",
  "text": "قل امر ربى بالقسط واقيموا۟ وجوهكم عند كل مسجد وادعوه مخلصين له الدين كما بداكم تعودون",
  "translations": [
    {
      "translation": "Say: 'My Lord has commanded justice. Stand and face Him in every mosque and call on Him, making your deen sincerely His. As He originated you, so you will return.' One group He guided; but another group got the misguidance they deserved. They took the shaytans as friends instead of Allah and thought that they were guided.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Tell them: \"My Lord has enjoined piety, devotion in all acts of worship, and calling upon Him with exclusive obedience. For you will be reverted back to what you were (when) created first.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say to them (O Muhammad): 'My Lord enjoins justice; and that you set your faces aright at the time of every Prayer; and that you call upon Him, exclusively dedicating your faith to Him. You shall return to Him as you were created.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"My Lord has ordered me to maintain justice. (People), pay due attention (when worshipping God). Pray to Him sincerely and be devoted in your religion. Just as He gave you life, He will bring you back to life again (after you die.)\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “My Lord has ordained justice; and set your attention straight every time you offer pray and worship Him, as only His devoted worshippers; the way He brought you into being, in the same manner will you return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"My Lord has commanded justice and that you should face Him only, in every Masjid and invoke Him only, making your religion sincere to Him. As He brought you (into being) in the beginning, so shall you be brought into being again.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: My Lord has enjoined justice, and set upright your faces at every time of prayer and call on Him, being sincere to Him in obedience; as He brought you forth in the beginning, so shall you also return.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'My Lord has commanded justice. Set your faces in every place of worship and call on Him, making your religion sincerely His. As He originated you so you will return;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: My Lord enjoineth justice. And set your faces upright (toward Him) at every place of worship and call upon Him, making religion pure for Him (only). As He brought you into being, so return ye (unto Him).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"My Lord has commanded you to act justly. Turn your faces up toward Him at every time and place of worship, and call upon Him, making yourselves sincere towards Him in religion. As He brought you into being, so shall you return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou; my Lord hath enjoined equity, and that ye shall set your faces aright at every prostration, and call on Him, making religion pure for Him. Even as He began you; ye shall be brought back.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘My Lord has enjoined justice,’ and [He has enjoined,] ‘Set your heart [on Him] at every occasion of prayer, and invoke Him, putting your exclusive faith in Him. Even as He brought you forth in the beginning, so will you return.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"My Lord hath commanded justice; and that ye set your whole selves (to Him) at every time and place of prayer, and call upon Him, making your devotion sincere as in His sight: such as He created you in the beginning, so shall ye return.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): My Lord has commanded justice and (said) that you should face Him only (i.e. worship none but Allah and face the Qiblah, i.e. the Ka'bah at Makkah during prayers) in each and every place of worship, in prayers (and not to face other false deities and idols), and invoke Him only making your religion sincere to Him by not joining in worship any partner to Him and with the intention that you are doing your deeds for Allah's sake only. As He brought you (into being) in the beginning, so shall you be brought into being (on the Day of Resurrection) [in two groups, one as a blessed one (believers), and the other as a wretched one (disbelievers)].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'My Lord ordered justice. Turn your faces to Him in every place of prayer and supplicate to Him, making the religion sincerely to Him. As He originated you, you shall return'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “My Lord commands justice, and to stand devoted at every place of worship. So call upon Him, and dedicate your faith to Him alone. Just as He originated you, so you will return.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, [O Muhammad], \"My Lord has ordered justice and that you maintain yourselves [in worship of Him] at every place [or time] of prostration, and invoke Him, sincere to Him in religion.\" Just as He originated you, you will return [to life] -\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:29] Say: ‘My Lord enjoins justice, fairness. And set (wa-aqīmū is a supplement to the [syntactical] significance of bi’l-qist, ‘justice’, that is to say, [it is as if] He said, ‘Be just and set [your faces]’, or read [wa-aqīmū] with an implied fa-aqbilū, ‘so turn’ towards it) your faces, towards God, in every place of worship, performing your prostrations purely for Him, and call upon Him, worship Him, devoting your religion to Him, [free] of any idolatry. As He brought you into being, [as] He created you, when you were nothing, so you will return, that is, [so] He will bring you back to life on the Day of Resurrection.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad: (My Lord enjoineth justice) the confession of Allah's divine Oneness, that there is no god save Allah. (And set your faces) turn with your faces, (upright (towards Him) at every place of worship) upon every prayer (and call upon Him) worship Him, (making religion pure for Him (only)) sincere in your worship of Him and in professing His divine Oneness. (As He brought you into being) on the Day of the 159 Covenant: felicitous and damned, knower and denier, believer and disbeliever, (so return you (unto Him)) in that state.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ أَمَرَ رَبِّي } بمقتضى فضله وعدله على من أمر منه خلص عباده { بِٱلْقِسْطِ } أي: العدل السوي في جميع مأموراته بلا ميل إلى جانبي الإفراط والتفريط { وَ } عليكم أيها المؤمنون أن { أَقِيمُواْ } واستقيموام { وُجُوهَكُمْ } التي بها ميلكم وتوجهاتكم نحو الحق بلا ميل إلى ما سواه { عِندَ كُلِّ مَسْجِدٍ } ومقام تتذللون فيه وتتوجهون نحوه { وَ } بالجملة: { ٱدْعُوهُ } وتوجهوا نحوه حال كونكم مستقيمين فيه { مُخْلِصِينَ لَهُ ٱلدِّينَ } أي: الطاعة والانقياد بلا شوب الغير والسوى مطلقاً، واعلموا أيها الأظلال { كَمَا بَدَأَكُمْ } الله أي: أنشأكم وأظهركم من كتم العدم بمد ظله ورش نوره عليكم { تَعُودُونَ } [الأعراف: 29] إليه بقبض الظل وطيه في نشأتكم الأولى\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { قل أمرَ ربي بالقسط } أي: العدل، وهو الوسط من كل أمر، المتجافي عن طرفي الإفراط والتفريط، وأمر بأن قال: { وأقيموا وجوهَكم عند كل مسجد } أي: افعلوا الصلاة في كل مكان يمكن في السجود إذا حضرتكم، ولا تؤخروها حتى تعودوا إلى مساجدكم\n والمعنى: إباحة الصلاة في كل موضع، فهو كقوله صلى الله عليه وسلم:\n\n \" جُعِلَت لِيَ الأرضُ مَسجدًا وَطَهورًا \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "85:13",
      "similarity": 0.5522616096099545
    },
    {
      "verse": "30:11",
      "similarity": 0.5213463198825038
    },
    {
      "verse": "10:4",
      "similarity": 0.5149654234239862
    },
    {
      "verse": "34:49",
      "similarity": 0.5023138114186758
    },
    {
      "verse": "29:19",
      "similarity": 0.4730100095065263
    }
  ]
}