{
  "chapter": "الأعراف",
  "text": "اتبعوا۟ ما انزل اليكم من ربكم ولا تتبعوا۟ من دونه اولياء قليلا ما تذكرون",
  "translations": [
    {
      "translation": "Follow what has been sent down to you from your Lord and do not follow any protectors apart from Him. How little you remember!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what has been revealed to you by your Lord, and do not follow any other lord apart from Him. Yet little do you care to remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[O men!] Follow what has been revealed to you from your Lord and follow no masters other than Him. Little are you admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(People), follow whatever is revealed to you from your Lord and do not follow other guardians besides Him. However, you pay very little attention (to Our words)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, follow what has been sent down to you from your Lord, and do not follow other administrators, abandoning this (the Holy Qur’an); very little do you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what has been sent down unto you from your Lord, and follow not any Awliya' (protectors), besides Him (Allah). Little do you remember!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what has been revealed to you from your Lord and do not follow guardians besides Him, how little do you mind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what has been sent down to you from your Lord, and follow no friends other than He; little do you remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Saying): Follow that which is sent down unto you from your Lord, and follow no protecting friends beside Him. Little do ye recollect!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what has been sent down to you by your Lord and do not follow any protector other than Him. How seldom you take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow that which is sent down toward you from your Lord, and follow not any patrons beside Him; yet little ye are admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what has been sent down to you from your Lord, and do not follow any masters besides Him. Little is the admonition that you take!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow (O men!) the revelation given unto you from your Lord, and follow not, as friends or protectors, other than Him. Little it is ye remember of admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Say (O Muhammad SAW) to these idolaters (pagan Arabs) of your folk:] Follow what has been sent down unto you from your Lord (the Quran and Prophet Muhammad's Sunnah), and follow not any Auliya' (protectors and helpers, etc. who order you to associate partners in worship with Allah), besides Him (Allah). Little do you remember!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow that which is sent down to you from your Lord and do not follow guardians other than Him; little do you remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what is revealed to you from your Lord, and do not follow other masters beside Him. Little you recollect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow, [O mankind], what has been revealed to you from your Lord and do not follow other than Him any allies. Little do you remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:3] Say to them: Follow what has been revealed to you from your Lord, namely, the Qur’ān, and do not follow, [do not] take, beside Him, namely, God, in other words, other than Him, any patrons, obeying them in disobedience of Him, exalted be He. Little do you remember (read tadhakkarūn or yadhakkarūn, ‘[little] are you or they admonished’; the original tā’ [of tatadhakkarūn] has been assimilated with the dhāl; a variant reading has tadhkurūn; the mā [of qalīlan mā, ‘little’] is extra, merely emphasising the ‘littleness’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nبيان لجملة : { لتنذر به } \\[ الأعراف : 2 \\] بقرينة تذييلها بقوله : قليلاً ما تذكرون . فالخطاب موجّه للمشركين ويندرج فيه المسلمون بالأولى ، فبعد أن نوّه الله بالكتاب المنزّل إلى الرّسول صلى الله عليه وسلم وبيّن أن حكمة إنزاله للإنذار والذّكرى ، أمر النّاس أن يتّبعوا ما أنزل إليهم ، كلٌ يتبع ما هو به أعلق ، والمشركون أنزل إليهم الزّجر عن الشّرك والاحتجاج على ضلالهم ، والمسلمون أنزل إليهم الأمر والنّهي والتّكليف ، فكلٌ مأمور باتّباع ما أنزل إليه ، والمقصود الأجْدَر هم المشركون تعريضاً بأنّهم كفروا بنعمة ربّهم ، فوصْفُ ( الرب ) هنا دون اسم الجلالة : للتّذكير بوجوب اتّباع أمره ، لأنّ وصف الربوبيّة يقتضي الامتثال لأوامره ، ونهاهم عن اتّباع أوليائهم الذين جعلوهم آلهة دونه ، والموجه إليهم النّهي هم المشركون بقرينة قوله : { قليلاً ما تذكرون }.والاتِّباع حقيقته المشي وراء ماششٍ ، فمعناه يقتضي ذاتين : تابعاً ومتوبعاً ، يقال : اتَّبع وتَبِع ، ويستعار للعمل بأمر الآمر نحو : { ما منعك إذ رأيتهم ضلوا أن لا تتبعني أفعصيت أمري } \\[ طه : 92 ، 93 \\] وهو استعارة تمثيليّة مبنيّة على تشبيه حالتين ، ويستعار للاقتداء بسيرة أو قَوْل نحو : { ولا تَتّبعوا خطوات الشيطان } \\[ البقرة : 168 \\] وهو استعارة مصرّحة تنبني على تشبيه المحسوس بالمعقول مثل قوله تعالى : { إن أتَّبِع إلاّ مَا يُوحى إليّ } \\[ الأنعام : 50 \\] ، ومنه قوله هنا : { اتبعوا ما أنزل إليكم من ربكم }.والمراد بما أنزل هو الكتاب المذكور بقوله : { كتاب أنزل إليك } \\[ الأعراف : 2 \\].وقوله : { ولا تتبعوا من دونه أولياء } تصريح بما تضمّنه : { اتبعوا ما أنزل إليكم من ربكم } لأنّ فيما أنزل إليهم من ربّهم أنّ الله إلهٌ واحد لا شريك له ، وأنّه الولي ، وأنّ الذين اتَّخذوا من دونه أولياء اللَّهُ حفيظ عليهم ، أي مجازيهم لا يخفى عليه فعلَهم ، وغيرَ ذلك من آي القرآن؛ والمقصود من هذا النّهي تأكيد مقتضى الأمر باتّباع ما أنزل إليهم اهتماماً بهذا الجانب ممّا أنزل إليهم ، وتسجيلاً على المشركين ، وقطعاً لمعاذيرهم أن يقولوا إنّنا اتَّبعنا ما أنزل إلينا ، وما نرى أولياءنا إلاّ شفعاءَ لنا عند الله فما نعبدهم إلاّ ليقرّبونا إلى الله زلفى ، فإنّهم كانوا يموهون بمثل ذلك ، ألا ترى أنّهم كانوا يقولون في تلبيتهم : «لبّيك لا شريك لك إلاّ شريكاً هو لك تملكه وما ملك» فموقع قوله : { اتبعوا ما أنزل إليكم } موقع الفَصل الجامع من الحد ، وموقع { ولا تتبعوا } موقع الفصل المانع في الحَدّ .والأولياء جمع ولي ، وهو المُوالي ، أي الملازم والمعاون ، فيطلق على النّاصر ، والحليف ، والصاحب الصّادق المودّة ، واستعير هنا للمعبود وللإله : لأنّ العبادة أقوى أحوال الموالاة ، قال تعالى : { أم اتّخذوا من دونه أولياء فالله هو الولي } \\[ الشورى : 9 \\] وقد تقدّم عند قوله تعالى : { قل أغير الله أتّخذ ولياً } في سورة الأنعام ( 14 ) ، وهذا هو المراد هنا .والاتّباع في قوله : ولا تتبعوا من دونه أولياء } يجوز أن يكون مستعملاً في المعنى الذي استعمل فيه الاتّباع في قوله : { اتبعوا ما أنزل إليكم من ربكم } وذلك على تقدير : لا تتّبعوا ما يأتيكم من أولياء دون الله ، فإن المشركين ينسبون ما هم عليه من الدّيانة الضّالة إلى الآلهة الباطلة ، أو إلى سدنة الآلهة وكُهّانها ، كما تقدّم عند قوله تعالى :{ وكذلك زَيّن لكثير من المشركين قتلَ أولادهم شركاؤهم } \\[ الأنعام : 137 \\] ، وقوله : { فقالوا هذا لله بزعمهم وهذا لشركائنا } كما في سورة الأنعام ( 136 ) ، وعلى تلك الاعتبارات يجري التّقدير في قوله : أولياء } أي لا تمتثلوا للأولياء أو أمرهم أو لدعاة الأولياء وسدنتهم .ويجوز أن يكون الاتّباع مستعاراً للطّلب والاتّخاذ ، أي ولا تتّخذوا أولياء غيره نحو قولهم : هو يتّبع زلة فلان . وفي الحديث : « يتّبع بها شَعَف الجبال ومواقعَ القطر » أي يتطلبها .و ( مِنْ ) في قوله : { من دونه } ابتدائيّة ، و ( دون ) ظرف للمكان المجاوز المنفصل ، وقد جرّ بمن الجارة للظروف ، وهو استعارة للترك والإعراض . والمجرور في موضع الحال من فاعل { تتّبعوا } ، أي لا تتّبعوا أولياء متّخذينَها دونه ، فإنّ المشركين وإن كانوا قد اعترفوا لله بالإلهيّة واتبعوا أمره بزعمهم في كثير من أعمالهم : كالحج ومناسكه ، والحَلِف باسمه ، فهم أيضاً اتّبعوا الأصنام بعبادتها أو نسبةِ الدّين إليها ، فكلّ عمل تقرّبوا به إلى الأصنام ، وكلّ عمل عملوه امتثالا لأمر ينسب إلى الأصنام ، فهم عند عمله يكونون متّبعين اتِّباعاً فيه اعراض عن الله وترك للتّقرب إليه ، فيكون اتّباعاً من دون الله ، فيدخل في النّهي ، وبهذا النّهي قد سُدت عليهم أبواب الشّرك وتأويلاته كقولهم : { ما نعبدهم إلاّ ليقرّبونا إلى الله زلفى } \\[ الزمر : 3 \\] فقد جاء قوله : { ولا تتبعوا من دونه أولياء } في أعلى درجة من الايجاز واستيعاب المقصود .وأفاد مجموع قوله : { اتبعوا ما أنزل إليكم من ربكم ولا تتبعوا من دونه أولياء } مفاد صيغة قصر ، كأنّه قال : لا تتّبعوا إلاّ ما أمر به ربّكم ، أي دون ما يأمركم به أولياؤكم ، فعُدل عن طريق القصر لتكون جملة : { ولا تتبعوا من دونه أولياء } مستقلّة صريحة الدّلالة اهتماماً بمضمونها على نحو قول السَّمَوْأل أوْ الحَارثي :تَسيِلُ على حد الظُّبات نفوسنا ... وليست على غير الظبَات تسيلوجملة : { قليلاً ما تذكرون } هي في موضع الحال من { لا تَتَّبعوا } ، وهي حال سببيّة وكاشفة لصاحبها ، وليست مقيِّدَة للنّهي : لظهور أنّ المتّبعين أولياءَ من دون الله ليسوا إلاّ قليلي التذكر . ويجوز جعل الجملة اعتراضاً تذييلياً . ولفظ ( قليلاً ) يجوز أن يحمل على حقيقته لأنّهم قد يتذكّرون ثمّ يعرضون عن التّذكّر في أكثر أحوالهم فهم في غفلة معرضون ، ويجوز أن يكون ( قليلاً ) مستعاراً لمعنى النّفي والعدم على وجه التّلميح كقوله تعالى : { فقليلاً ما يؤمنون } \\[ البقرة : 88 \\] ( فإنّ الإيمان لا يوصف بالقلّة والكثرة ).والتّذكّر مصدر الذّكر بضمّ الذال وهو حضور الصورة في الذّهن .وقليل مستعمل في العدم على طريقة التّهكّم بالمضيع للأمر النّافع يقال له : إنّك قليل الإتيان بالأمر النّافع ، تنبيهاً له على خطئه ، وإنّه إن كان في ذلك تفريط فلا ينبغي أن يتجاوز حدّ التّقليل دون التّضييع له كلّه .و ( ما ) مصدريّة والتّقدير : قليلاً تَذَكُّركم ، ويجوز أن يكون { قليلاً } صفة مصدر محذوف دلّ عليه { تذكرون } و ( ما ) مزيدة لتوكيد القلّة ، أي نوع قلّة ضعيف ، نحو قوله تعالى : { أنْ يضرِبَ مثلا مَّا } \\[ البقرة : 26 \\]. وتقدّم القول في نظيره عند قوله تعالى : { فقليلاً ما يؤمنون } في سورة البقرة ( 88 ). والمعنى : لو تذكّرتم لما اتّبعتم من دونه أولياء ولما احتجتم إلى النّهي عن أن تتّبعوا من دونه أولياء ، وهذا نداء على إضاعتهم النّظر والاستدلال في صفات الله وفي نقائص أوليائهم المزعومين .وقرأ الجمهور : { ما تذّكرون } بفوقية واحدة وتشديد الذال على أنّ أصله تَتَذكّرون بتاءين فوقيتين فقلبت ثانيتُهما ذالاً لتقارب مخرجيهما ليتأتى تخفيفه بالإدغام .وقرأه حمزة ، والكسائي ، وحفص عن عاصم ، وخلف بتخفيف الذال على حذف إحدى التاءين اختصاراً . وقرأه ابن عامر : { يتذكّرون } بتحتيّة في أوّله ثمّ فوقيّة ، والضّمير عائد إلى المشركين على طريقة الالتفات من الخطاب إلى الغيبة ، أعرض عنهم ووجَّه الكلام على غيرهم من السّامعين : إلى النّبيء صلى الله عليه وسلم والمسلمين .\n\n",
      "translations": [
        {
          "translation": "((Saying): Follow that which is sent down unto you from your Lord) i.e. the Qur'an: uphold as lawful that which it makes lawful and unlawful that which it makes unlawful, (and follow) and worship (no protecting friends) idols as lords (beside Him. Little do you recollect) you do not take admonition neither much nor a 156 little!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱتَّبِعُواْ } أيها المؤمنون المتوجهون نحو التوحيد { مَآ أُنزِلَ إِلَيْكُمْ مِّن رَّبِّكُمْ } على لسان نبيكم { وَلاَ تَتَّبِعُواْ } بعد بعثته ودعته { مِن دُونِهِ } سبحانه { أَوْلِيَآءَ } توالونهم وترجعون إليهم في أموركم من الجن الإنس\n إذ هو خاتم النبوة فعليكم أن تتبعوه\n وإن كان منكم { قَلِيلاً مَّا } شرذمة قليلة { تَذَكَّرُونَ } [الأعراف: 3] وتتعظون بتذكيره وعظته ليملكم إلى أهوية نفوسكم من الجاه والمال والرئاسة المستلزمة للتفوق على القرآن والأقران\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "قلت: { قليلاً }: صفة لمصدرٍ، أو زمانٍ محذوف، أي: تتذكرون تذكرًا قليلاً، أو زمانًا قليلاً، والعامل فيه: تذكرون، و { ما }: زائدة لتأكيد القلة. يقول الحقّ جلّ جلاله: { اتَّبِعُوا } أيها الناس { ما أُنزل إليكم من ربكم } من أحكام القرآن والسنة إذ كله وحي يوحى،\n[النّجْم:3]، { ولا تتبعوا من دونه } أي: الله، { أولياءَ } من الجن والإنس يضلونكم عن دينه، أو: ولا تتبعوا من دون ما أنزل إليكم أولياء، تتبعونهم فيما يأمرونكم به وينهونكم، وتتركون ما أنزل إليكم من ربكم، { قليلاً ما تذكَّرون }: تتعظون حيث تتركون دين الله وتتبعون غيره، بعد كمال إنذاره ووضوح تذكاره، وذلك لانطماس البصيرة وعمي القلوب، والعياذ بالله. الإشارة: اتباع الحبيب في أمره ونهيه يدل على صحة دعوى المحبة، ومخالفته يدل على بطلانها.\nوجمع المحبة في محبوب واحد يدل على كمالها، وتفرق المحبة يدل على ضعفها، ولذلك قال الشاعر:\nفلا تجتمع المحبة في محبوب واحد إلا بعد كمال معرفة المحبوب، وشهود أنوار جماله وكمال أسراره. والله تعالى أعلم. ثم ذكر وبال من لم يتبع، فقال: { وَكَم مِّن قَرْيَةٍ أَهْلَكْنَاهَ }.",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "56:14",
      "similarity": 0.4510946933893116
    },
    {
      "verse": "73:2",
      "similarity": 0.3673655241216894
    },
    {
      "verse": "42:46",
      "similarity": 0.33390156703272716
    },
    {
      "verse": "69:41",
      "similarity": 0.331904616006495
    },
    {
      "verse": "2:107",
      "similarity": 0.3293390412490094
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007003.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007003.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:3.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}