{
  "chapter": "الأعراف",
  "text": "اتبعوا۟ ما انزل اليكم من ربكم ولا تتبعوا۟ من دونه اولياء قليلا ما تذكرون",
  "translations": [
    {
      "translation": "Follow what has been sent down to you from your Lord and do not follow any protectors apart from Him. How little you remember!",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what has been revealed to you by your Lord, and do not follow any other lord apart from Him. Yet little do you care to remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[O men!] Follow what has been revealed to you from your Lord and follow no masters other than Him. Little are you admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(People), follow whatever is revealed to you from your Lord and do not follow other guardians besides Him. However, you pay very little attention (to Our words)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O mankind, follow what has been sent down to you from your Lord, and do not follow other administrators, abandoning this (the Holy Qur’an); very little do you understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what has been sent down unto you from your Lord, and follow not any Awliya' (protectors), besides Him (Allah). Little do you remember!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what has been revealed to you from your Lord and do not follow guardians besides Him, how little do you mind.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what has been sent down to you from your Lord, and follow no friends other than He; little do you remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Saying): Follow that which is sent down unto you from your Lord, and follow no protecting friends beside Him. Little do ye recollect!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what has been sent down to you by your Lord and do not follow any protector other than Him. How seldom you take heed.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow that which is sent down toward you from your Lord, and follow not any patrons beside Him; yet little ye are admonished.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what has been sent down to you from your Lord, and do not follow any masters besides Him. Little is the admonition that you take!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow (O men!) the revelation given unto you from your Lord, and follow not, as friends or protectors, other than Him. Little it is ye remember of admonition.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Say (O Muhammad SAW) to these idolaters (pagan Arabs) of your folk:] Follow what has been sent down unto you from your Lord (the Quran and Prophet Muhammad's Sunnah), and follow not any Auliya' (protectors and helpers, etc. who order you to associate partners in worship with Allah), besides Him (Allah). Little do you remember!\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow that which is sent down to you from your Lord and do not follow guardians other than Him; little do you remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow what is revealed to you from your Lord, and do not follow other masters beside Him. Little you recollect.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Follow, [O mankind], what has been revealed to you from your Lord and do not follow other than Him any allies. Little do you remember.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:3] Say to them: Follow what has been revealed to you from your Lord, namely, the Qur’ān, and do not follow, [do not] take, beside Him, namely, God, in other words, other than Him, any patrons, obeying them in disobedience of Him, exalted be He. Little do you remember (read tadhakkarūn or yadhakkarūn, ‘[little] are you or they admonished’; the original tā’ [of tatadhakkarūn] has been assimilated with the dhāl; a variant reading has tadhkurūn; the mā [of qalīlan mā, ‘little’] is extra, merely emphasising the ‘littleness’).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "((Saying): Follow that which is sent down unto you from your Lord) i.e. the Qur'an: uphold as lawful that which it makes lawful and unlawful that which it makes unlawful, (and follow) and worship (no protecting friends) idols as lords (beside Him. Little do you recollect) you do not take admonition neither much nor a 156 little!\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱتَّبِعُواْ } أيها المؤمنون المتوجهون نحو التوحيد { مَآ أُنزِلَ إِلَيْكُمْ مِّن رَّبِّكُمْ } على لسان نبيكم { وَلاَ تَتَّبِعُواْ } بعد بعثته ودعته { مِن دُونِهِ } سبحانه { أَوْلِيَآءَ } توالونهم وترجعون إليهم في أموركم من الجن الإنس؛ إذ هو خاتم النبوة فعليكم أن تتبعوه، وإن كان منكم { قَلِيلاً مَّا } شرذمة قليلة { تَذَكَّرُونَ } [الأعراف: 3] وتتعظون بتذكيره وعظته ليملكم إلى أهوية نفوسكم من الجاه والمال والرئاسة المستلزمة للتفوق على القرآن والأقران\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { قليلاً }: صفة لمصدرٍ، أو زمانٍ محذوف، أي: تتذكرون تذكرًا قليلاً، أو زمانًا قليلاً، والعامل فيه: تذكرون، و { ما }: زائدة لتأكيد القلة\n يقول الحقّ جلّ جلاله: { اتَّبِعُوا } أيها الناس { ما أُنزل إليكم من ربكم } من أحكام القرآن والسنة إذ كله وحي يوحى،\n\n[النّجْم:3]، { ولا تتبعوا من دونه } أي: الله، { أولياءَ } من الجن والإنس يضلونكم عن دينه، أو: ولا تتبعوا من دون ما أنزل إليكم أولياء، تتبعونهم فيما يأمرونكم به وينهونكم، وتتركون ما أنزل إليكم من ربكم، { قليلاً ما تذكَّرون }: تتعظون حيث تتركون دين الله وتتبعون غيره، بعد كمال إنذاره ووضوح تذكاره، وذلك لانطماس البصيرة وعمي القلوب، والعياذ بالله\n الإشارة: اتباع الحبيب في أمره ونهيه يدل على صحة دعوى المحبة، ومخالفته يدل على بطلانها\n\n\nوجمع المحبة في محبوب واحد يدل على كمالها، وتفرق المحبة يدل على ضعفها، ولذلك قال الشاعر:\n",
      "translations": []
    }
  ]
}