{
  "chapter": "الأعراف",
  "text": "يبنى ءادم خذوا۟ زينتكم عند كل مسجد وكلوا۟ واشربوا۟ ولا تسرفوا۟ انه لا يحب المسرفين",
  "translations": [
    {
      "translation": "Say: 'Who has forbidden the fine clothing Allah has produced for His slaves and the good kinds of provision?' Say: 'On the Day of Rising such things will be exclusively for those who had iman during their life in this world.' In this way We make the Signs clear for people who know.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O sons of Adam, attire yourselves at every time of worship; eat and drink, but do not be wasteful, for God does not like the prodigals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam! Take your adornment at every time of Prayer; and eat and drink without going to excesses. For Allah does not like those who go to excess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam, dress well when attending the mosques, eat and drink but do not be excessive for God does not love those who are excessive (in what they do).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Descendants of Adam! Adorn yourself when you go to the mosque, and eat and drink, and do not cross limits; indeed He does not like the transgressors.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! Take your adornment to every Masjid, and eat and drink, but waste not by extravagance, certainly He (Allah) likes not the wasteful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O children of Adam! attend to your embellishments at every time of prayer, and eat and drink and be not extravagant; surely He does not love the extravagant.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam! Take your adornment at every place of worship; and eat and drink, but be you not prodigal; He loves not the prodigal.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! Look to your adornment at every place of worship, and eat and drink, but be not prodigal. Lo! He loveth not the prodigals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam, dress yourself properly whenever you are at worship: and eat and drink but do not be wasteful: God does not like wasteful people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! take your adornment at every worship: and eat and drink, and waste not; verily He approveth not the wasters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! Put on your adornment on every occasion of prayer, and eat and drink, but do not waste; indeed, He does not like the wasteful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! wear your beautiful apparel at every time and place of prayer: eat and drink: But waste not by excess, for Allah loveth not the wasters.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! Take your adornment (by wearing your clean clothes), while praying and going round (the Tawaf of) the Ka'bah, and eat and drink but waste not by extravagance, certainly He (Allah) likes not Al-Musrifun (those who waste by extravagance).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam, take your adornment at every place of prayer. Eat and drink, and do not waste. He does not love the wasteful.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! Dress properly at every place of worship, and eat and drink, but do not be excessive. He does not love the excessive.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O children of Adam, take your adornment at every masjid, and eat and drink, but be not excessive. Indeed, He likes not those who commit excess.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:31]   O Children of Adam! Don your adornment, that which covers your nakedness, at every place of worship, at prayer and at the circumambulation, and eat and drink, what you want, but do not be excessive; He truly does not love those who are excessive.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 Children of Adam! Look to your adornment) wear your clothes (at every place of worship) at the time of every prayer and upon circumambulation of the Ka'bah, (and eat) of meat and fat (and drink) of milk, (but be not prodigal) do not declare unlawful wholesome foods, meat and fat. (Lo! He loveth not the prodigals) those who transgress by leaving the lawful and going after the unlawful..\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَابَنِيۤ ءَادَمَ } المجبولين على زي التقوى ولباس السلامة { خُذُواْ زِينَتَكُمْ } التي زينكم الله بها من الحقائق والمعارف والمكاشفات والمشاهدات { عِندَ كُلِّ مَسْجِدٍ } ومقام تميلون فيه نحو الحق وجوهكم التي يلي الحق { و } لا تهملوا أمر مراكبكم التي هي نفوسكم وهوياتكم؛ لئلا تبطلوا صنع الله ولا تخربوا بيته، بل { كُلُواْ } مقدار سد الجوعة { وَٱشْرَبُواْ } قدر دفع العطشة { وَلاَ تُسْرِفُوۤاْ } فيهما إلى حيث يؤدي إلى تقوية القوى البهيمية { إِنَّهُ } سبحانه { لاَ يُحِبُّ ٱلْمُسْرِفِينَ } [الأعراف: 31] ولا يرضى عن فعلهم لإخلائهم بإسراف الأكل والشرب على الميل الذي جبلوا لأجله؛ إذ الشبع يميت القلب وينقص الغريزة الإنسانية، ويزيد القوى البهيمية\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { يا بني آدم خُذوا زينتكم } أي: ثيابكم التي تستر عورتكم، { عند كل مسجدٍ } لطواف أو صلاة، واحتج به من أوجب ستر العورة في الصلاة، ومن السًّنة أن يأخذ الرجل أحسن ثيابه للصلاة، وقيل: المراد بالزينة: زيادة على الستر، كالتجمل للجمعة بأحسن الثياب وبالسواك والطيب، { وكُلوا واشربوا } أمر إباحة لِمَا رُوِي أن بني عامر، في أيام الحج، كانوا لا يأكلون من الطعام إلا قوتًا، ولا يأكون دسمًا يعظمون بذلك حجهم، وهَمَّ المسلمون بذلك، فنزلت\n { ولا تُسرفوا } بتحريم الحلال، أو بالتقدم إلى الحرام، أو بإفراط الطعام والشره إليه، وقد عَدَّ في الإحياء من المهلكات: شره الطعام، وشره الوقاع، أي: الجماع؟ { إنه لا يحب المسرفين } لا يرتضي فعلهم\n وعن ابن عباس رضي الله عنه:  كُل ما شئت، والبس ما شئت، ما أخطأتك خصلتان: سَرفٌ ومخيلة  أي: تكبر\n وقال علي بن الحسين بن واقد: جمع الله الطب في نصف آية فقال: { كلوا واشربوا ولا تسرفوا }\n الإشارة: إنما أمر الحقّ ـ جلّ جلاله ـ بالتزين للصلاة والطواف لأن فيهما الوقوف بين يدي ملك الملوك، وقد جرت عادة الناس في ملاقاة الملوك: التهيىء لذلك بما يقدرون عليه من حسن الهيئة لأن ذلك زيادة تعظيم للملك، وتزيين البواطن بالمحبة والوداد أحسن من تزيين الظواهر وخراب البواطن\n\n \" إنَّ اللهَ لا يَنظُرُ إلَى صُوَرِكُم ولاَ إلى أموَالِكُم، وإنَّمَا يَنظُرُ إلَى قُلوبِكُم وأعمَالِكُم \" \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:151",
      "similarity": 0.37661228532541924
    },
    {
      "verse": "44:31",
      "similarity": 0.34934162776327776
    },
    {
      "verse": "51:34",
      "similarity": 0.33320671360684845
    },
    {
      "verse": "21:9",
      "similarity": 0.324850791480452
    },
    {
      "verse": "36:60",
      "similarity": 0.3241831432244908
    }
  ]
}