{
  "chapter": "الأعراف",
  "text": "قل من حرم زينة الله التى اخرج لعباده والطيبت من الرزق قل هى للذين ءامنوا۟ فى الحيوة الدنيا خالصة يوم القيمة كذلك نفصل الءايت لقوم يعلمون",
  "translations": [
    {
      "translation": "Say: 'My Lord has forbidden indecency, both open and hidden, and wrong action, and unrightful tyranny, and associating anything with Allah for which He has sent down no authority, and saying things about Allah you do not know.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Ask them: \"Who forbids you attire that God has given to His creatures, and the good things that He has provided?\" Tell them: \"They are (meant) for believers in the world, and will be theirs on the Day of Judgement.\" That is how We explain Our signs to those who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad): 'Who has forbidden the adornment which Allah has brought forth for His creatures or the good things from among the means of sustenance?' Say: 'These are for the enjoyment of the believers in this world, and shall be exclusively theirs on the Day of Resurrection.' Thus do We clearly expound Our revelations for those who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Muhammad), ask them, \"Who has made it unlawful to maintain beauty and to eat the pure foods which God has created for His servants? They are made for the believers in this world and are exclusively for them in the life hereafter.\" Thus do We explain Our revelations to the people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Who has forbidden the adornment of Allah which He has brought forth for His bondmen, and the good food?” Say, “That is for the believers in this world, and on the Day of Resurrection it will be for them only”; this is how We explain Our verses in detail for people of knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: \"Who has forbidden the adornment with clothes given by Allah, which He has produced for His servants, and At-Tayyibat (good things) of sustenance\" Say: \"They are, in the life of this world, for those who believe, (and) exclusively for them (believers) on the Day of Resurrection.\" Thus We explain the Ayat in detail for people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Who has prohibited the embellishment of Allah which He has brought forth for His servants and the good provisions? Say: These are for the believers in the life of this world, purely (theirs) on the resurrection day; thus do We make the communications clear for a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Who has forbidden the ornament of God which He brought forth for His servants, and the good things of His providing?' Say: 'These, on the Day of Resurrection, shall be exclusively for those who believed in this present life. So We distinguish the signs for a people who know.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Who hath forbidden the adornment of Allah which He hath brought forth for His bondmen, and the good things of His providing? Say: Such, on the Day of Resurrection, will be only for those who believed during the life of the world. Thus do we detail Our revelations for people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who has forbidden the adornment of God, which He has brought forth for His servants and good things, clean and pure, which God has provided for His servants?\" Say, \"They are [lawful] for the believers in the present life but they shall be exclusively for them on the Day of Resurrection.\" Thus We explain Our signs for a people who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say thou: who hath forbidden the adornment which Allah hath produced for His servants and the clean things of food? Say thou: these on the Day of Judgement, shall be for those alone who in the life of this world have believed. Thus We expound the signs unto a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, ‘Who has forbidden the adornment of Allah which He has brought forth for His servants, and the good things of [His] provision?’ Say, ‘These are for the faithful in the life of this world, and exclusively for them on the Day of Resurrection.’ Thus do We elaborate the signs for a people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: Who hath forbidden the beautiful (gifts) of Allah, which He hath produced for His servants, and the things, clean and pure, (which He hath provided) for sustenance? Say: They are, in the life of this world, for those who believe, (and) purely for them on the Day of Judgment. Thus do We explain the signs in detail for those who understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say (O Muhammad SAW): \"Who has forbidden the adoration with clothes given by Allah, which He has produced for his slaves, and At-Taiyibat [all kinds of Halal (lawful) things] of food?\" Say: \"They are, in the life of this world, for those who believe, (and) exclusively for them (believers) on the Day of Resurrection (the disbelievers will not share them).\" Thus We explain the Ayat (Islamic laws) in detail for people who have knowledge.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say: 'Who has forbidden the adornment that Allah has brought for His worshipers and the good provision' Say: 'They are in this life for those who believe, and purely theirs on the Day of Resurrection' As such We distinguish the verses to people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, “Who forbade God’s finery which He has produced for His servants, and the delights of livelihood?” Say, “They are for those who believe, in this present world, but exclusively theirs on the Day of Resurrection.” We thus detail the revelations for people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Say, \"Who has forbidden the adornment of Allah which He has produced for His servants and the good [lawful] things of provision?\" Say, \"They are for those who believe during the worldly life [but] exclusively for them on the Day of Resurrection.\" Thus do We detail the verses for a people who know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:32] Say, in disavowal of them, ‘Who has forbidden the adornment of God which He has brought forth for His servants, in the way of garments, and the good things, the delicious foods, of [God’s] sustenance?’ Say: ‘These, on the Day of Resurrection, shall be exclusively (read khālisatun meaning ‘exclusively theirs’, or khālisatan as a circumstantial qualifier) for those who believed during the life of this world, deservedly, even if others should share it with them. Thus We detail the signs, We explain them in such detail, for a people who know’, [who] reflect, for they are the ones to profit from these [signs].\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Say) Muhammad to the people of Mecca: (Who hath forbidden the adornment of Allah) the wearing of clothes during the days of pilgrimage, in the Sacred Precinct and upon circumambulation of the Ka'bah (which He hath brought forth) i.e. the adornment which He created (for His bondmen, and the good things of His providing?) of meat and fat, for in the pre-Islamic days they used to forbid themselves meat and fat during the days of pilgrimage, and entered the Sacred Precinct completely naked: the men during the day and the women during the night. Allah made these practices unlawful. (Say) Muhammad: (Such) the good things, (on the Day of Resurrection, will be only for those who believed during the life of the world) in Muhammad (pbuh) and the Qur'an, while both believer and sinner will enjoy them during the life of this world. (Thus do We detail Our revelations) We elucidate the Qur'an by explaining the lawful and the unlawful (for people who have knowledge) for people who believe it is from Allah.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { والطيبات } من رزق علوم الإخلاص وعلوم مقام التوكل والرضا والتمكين { خالصة يوم القيامة } عن شوب التلوينات وظهور شيء من بقايا الأفعال والصفات والذات\n  { قل إنما حرّم ربي الفواحش } أي: رذائل القوة البهيمية { والإثم والبغي } أي: رذائل القوّة السبعية { وأن تشركوا } إلى آخره\n أي: رذائل القوّة النطقية الملكية لأنها صفات نفسانية مانعة عن الزينة المذكورة التي هي الكمالات الإنسانية مضادة لها",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قُلْ } يا أكمل الرسل للمحجوبين من أهل المظاهر المحرومين عن الرزق المعنوي\n المحرومين عن التوجه نحو التوحيد في هذه النشأة: { مَنْ حَرَّمَ زِينَةَ ٱللَّهِ ٱلَّتِيۤ أَخْرَجَ } وأظهر { لِعِبَادِهِ } الخلص من ذرائر الكائنات بتجليات الأسماء والصفات { وَالْطَّيِّبَاتِ مِنَ ٱلرِّزْقِ } المعنوي والمستلذات الروحانية { قُلْ } لهم: { هِي } حاصلة { لِلَّذِينَ آمَنُواْ } بالتوحيد الإلهي { فِي ٱلْحَيَاةِ ٱلدُّنْيَا } والنشأة الأولى حال كونهم مشوبة بالقوى البشرية والكدورات البهيمية { خَالِصَةً } لهم { يَوْمَ ٱلْقِيَامَةِ } بلا شوب كدورة حين انخلعوا من جلباب الهويات الباطلة والتعيينات العاطلة { كَذَلِكَ نُفَصِّلُ ٱلآيَاتِ } الدالة على توحيدنا { لِقَوْمٍ يَعْلَمُونَ } [الأعراف: 32] يذعنون بالإيمان وتوجهون نحو الكشف والعيان\n\n\n{ قُلْ } يا أكمل الرسل المولي لتدبير مصالح العباد: { إِنَّمَا حَرَّمَ رَبِّيَ ٱلْفَوَاحِشَ } القبائح الصادرة من أولي الأحلام السخيفة { مَا ظَهَرَ مِنْهَا } من الظلم وشهادة الزور ورمي المحصن والغيبة والنميمة",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: من قرأ: { خالصة } بالرفع\n فخبر بعد خبر\n أو خبر عن مضمر\n ومن قرأ بالنصب\n فحال\n يقول الحقّ جلّ جلاله: { قل } لهم: { مَن حرَّم زينةَ اللهِ } وهي ما يتجمل به من الثياب وغيرها\n { التي أخرج لعباده } من النبات كالقطن والكتان\n أو الحيوان كالحرير والصوف والوبر\n والمعادن كالدروع والحلي\n { و } قل أيضًا: من حرم { الطيبات مِنَ الرزقِ } أي: المستلذات من المآكل والمشارب\n ويدخل فيها المناكح إذ هي من أعظم الطيبات\n وفيه دليل على أن الأصل في المطاعم والملابس وأنواع التجملات: الإباحة لان الاستفهام للإنكار\n وبه رد مالك ـ رحمه الله ـ على من أنكر عليه من الصوفية\n وقال له: اتق الله يا مالك بلغني أنك تلبس الرقيق\n وتأكل الرقاق\n فكتب إليه بالآية\n قال تعالى: { قل هي للذين آمنوا في الحياة الدنيا } \n ويشاركهم فيها الكفار\n ويوم القيامة تكون { خالصة } لهم دون غيرهم\n { كذلك نُفصّل الآياتِ } أي: كتفصيلنا هذا الحكم نُفصل سائر الأحكام { لقوم يعلمون } فينزلونها في محلها بخلاف الجهال\n { قل إنما حرَّم ربي الفواحشَ } وهي ما تزايد قبحها من المعاصي\n وقيل: ما يتعلق بالفروج",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "37:169",
      "similarity": 0.37313319425156244
    },
    {
      "verse": "37:40",
      "similarity": 0.36886152610395706
    },
    {
      "verse": "37:74",
      "similarity": 0.36886152610395706
    },
    {
      "verse": "37:128",
      "similarity": 0.36886152610395706
    },
    {
      "verse": "37:160",
      "similarity": 0.36886152610395706
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007032.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007032.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:32.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}