{
  "chapter": "الأعراف",
  "text": "ولكل امة اجل فاذا جاء اجلهم لا يستاخرون ساعة ولا يستقدمون",
  "translations": [
    {
      "translation": "Children of Adam! if Messengers come to you from among yourselves, recounting My Signs to you, those who have taqwa and put things right, will feel no fear and will know no sorrow.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A term is fixed for every people; and when their appointed time is come there will neither be a moment's delay nor haste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every community there is an appointed term; and when its term arrives, they cannot tarry behind a moment, nor can they get ahead.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All people can only live for an appointed time. When their term ends, they will not remain (alive) even for a single hour, nor will they die before the appointed time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every group has a promise; so when its promise comes, it cannot be postponed for a moment or brought forward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every Ummah has its appointed term; when their term comes, neither can they delay it nor can they advance it an hour (or a moment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for every nation there is a doom, so when their doom is come they shall not remain behind the least while, nor shall they go before.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To every nation a term; when their term comes they shall not put it back by a single hour nor put it forward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every nation hath its term, and when its term cometh, they cannot put it off an hour nor yet advance (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For all people a term has been set: and when [the end of] their term approaches, they can neither delay it by a single moment, nor can they advance it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for every community there is an appointed term; then when its term shall arrive, not an hour will they stay behind or go in advance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a [preordained] time for every nation: when their time comes, they shall not defer it by a single hour nor shall they advance it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To every people is a term appointed: when their term is reached, not an hour can they cause delay, nor (an hour) can they advance (it in anticipation).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every nation has its appointed term; when their term is reached, neither can they delay it nor can they advance it an hour (or a moment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To every nation a term; when their term comes they shall not delay it by a single hour, nor yet hasten it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every nation is an appointed time. When their time has come, they cannot delay it by one hour, nor can they advance it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for every nation is a [specified] term. So when their time has come, they will not remain behind an hour, nor will they precede [it].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:34] Every community has a term, a [finite] period of time. When their term comes they shall not delay it a single hour nor bring it forward.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And every nation) every people that have a religion (hath its term) an appointed time for its destruction, (and when its term) the time of their destruction (cometh, they cannot put it off an hour) they are not given reprieve one fraction of a second after their appointed time (nor yet advance (it)) they are not destroyed before the appointed time, even if it be by one fraction of a second.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلموا أن { لِكُلِّ أُمَّةٍ } من الأمم العاصية الضالة { أَجَلٌ } مقدر من عند الله لمقتهم وهلاكهم { فَإِذَا جَآءَ أَجَلُهُمْ } المقدر المبرم { لاَ يَسْتَأْخِرُونَ سَاعَةً وَلاَ يَسْتَقْدِمُونَ } [الأعراف: 34] أي: لا يسع لهم فيه طلب التأخير على مقتضى أهويتهم ولا طلب التقديم تخليصاً لنفوسهم من الأذى، بل أمرهم حتم نازل في وقته وحينه بلا تخلل تقدم وتأخير؛ لكمال قدرته ومتانة حكمته\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولكل أمة أجل } أي: مدة ووقت لنزول العذاب بها إن لم يؤمنوا، وهو تهديد لأهل مكة، { فإذا جاء أجَلُهم } أي: انقرضت مدتهم، أو دنى وقت هلاكهم، { لا يستأخرون ساعةَ } عنه { ولا يستقدمون } أي: لا يتأخرون ولا يتقدمون عنه أقصَر وقت، أو لا يطيقون التقدم والتأخر لشدة الهول، وجعل بعضهم: { ولا يستقدمون } استئنافًا لأن الأجل إذا جاء لا يتصور التقدم، وحينئذٍ يوقف على: { ساعة } ، ثم يقول: ولا هم يستقدمون عنه قبل وصوله\n الإشارة: قال شيخنا البوزيدي رضي الله عنه: زينة الله التي أظهر لعباده هي لباس المعرفة، وهو نور التجلي، والطيبات من الرزق هي حلاوة الشهود\n هـ\n وهي لمن كمل إيمانه وصِدقه في الحياة الدنيا، وتصفو له إلى يوم القيامة، فهي حلال على أهل التجريد يتمتعون بها في الدارين، وإنما حرّم عليهم ما يشغلهم عن ربهم من جهة الظاهر، وما يقطعهم عن شهوده من جهة الباطن، وسوء الأدب مع الله، والتعرض لعباد الله، والشرك بالله بأن يشهدوا معه سواه، وأن يقولوا على الله ما يوهم نقصًا أو خللاً في أنوار جماله وسناه\n\n\nوالله تعالى أعلم\n ثم إن العباد والزهاد وأهل البداية من المريدين السائرين ـ ينبغي لهم أن يزهدوا في زينة الدنيا وطيباتها لئلا تركن إليها نفوسهم، فيثبط سيرهم، وأما الواصلون فهم مع الله، لا مع شيء سواه، يأخذون من الله بالله، ويدفعون بالله، وقد اتسعت دائرة علمهم، فليسوا مع لباس ولا أكل ولا شرب ولا جوع ولا شبع، هم مع ما يبرز في الوقت من المقدورات\n والله تعالى أعلم\n ثم وصّاهم على الإيمان بالرسل، عند ظهورهم، فقال: { يَابَنِيۤ ءَادَمَ إِمَّا يَأْتِيَنَّكُمْ رُسُلٌ مِّنكُمْ }\n\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:49",
      "similarity": 0.7823857583424426
    },
    {
      "verse": "34:30",
      "similarity": 0.6505622924748778
    },
    {
      "verse": "16:61",
      "similarity": 0.5469603094593551
    },
    {
      "verse": "15:5",
      "similarity": 0.4514110532947477
    },
    {
      "verse": "23:43",
      "similarity": 0.4514110532947477
    }
  ]
}