{
  "chapter": "الأعراف",
  "text": "ولكل امة اجل فاذا جاء اجلهم لا يستاخرون ساعة ولا يستقدمون",
  "translations": [
    {
      "translation": "Children of Adam! if Messengers come to you from among yourselves, recounting My Signs to you, those who have taqwa and put things right, will feel no fear and will know no sorrow.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A term is fixed for every people; and when their appointed time is come there will neither be a moment's delay nor haste.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every community there is an appointed term; and when its term arrives, they cannot tarry behind a moment, nor can they get ahead.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "All people can only live for an appointed time. When their term ends, they will not remain (alive) even for a single hour, nor will they die before the appointed time.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every group has a promise; so when its promise comes, it cannot be postponed for a moment or brought forward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every Ummah has its appointed term; when their term comes, neither can they delay it nor can they advance it an hour (or a moment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for every nation there is a doom, so when their doom is come they shall not remain behind the least while, nor shall they go before.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To every nation a term; when their term comes they shall not put it back by a single hour nor put it forward.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every nation hath its term, and when its term cometh, they cannot put it off an hour nor yet advance (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For all people a term has been set: and when [the end of] their term approaches, they can neither delay it by a single moment, nor can they advance it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for every community there is an appointed term; then when its term shall arrive, not an hour will they stay behind or go in advance.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There is a [preordained] time for every nation: when their time comes, they shall not defer it by a single hour nor shall they advance it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To every people is a term appointed: when their term is reached, not an hour can they cause delay, nor (an hour) can they advance (it in anticipation).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And every nation has its appointed term; when their term is reached, neither can they delay it nor can they advance it an hour (or a moment).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To every nation a term; when their term comes they shall not delay it by a single hour, nor yet hasten it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For every nation is an appointed time. When their time has come, they cannot delay it by one hour, nor can they advance it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And for every nation is a [specified] term. So when their time has come, they will not remain behind an hour, nor will they precede [it].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:34] Every community has a term, a [finite] period of time. When their term comes they shall not delay it a single hour nor bring it forward.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاعتراض بين جملة : { يا بني آدم خذوا زينتكم } \\[ الأعراف : 31 \\] وبين جملة : { يا بني آدم إما يأتينكم رسل منكم } \\[ الأعراف : 35 \\] لمّا نعى الله على المشركين ضلالهم وتمرّدهم . بعد أن دعاهم إلى الإيمان ، وإعراضَهم عنه ، بالمجادلة والتّوبيخ وإظهارِ نقائصهم بالحجّة البيّنة ، وكان حالهم حال من لا يقلع عمّا هم فيه ، أعقَب ذلك بإنذارهم ووعيدهم إقامةً للحجّة عليهم وإعذاراً لهم قبل حلول العذاب بهم .وهذه الجملة تؤكّد الغرض من جملة : { وكم من قرية أهلكناها } \\[ الأعراف : 4 \\] وتحتمل معنيين :أحدهما : أن يكون المقصود بهذا الخبر المشركين ، بأن أقبل الله على خطابهم أو أمر نبيئه بأن يخاطبهم ، لأنّ هذا الخطاب خطاب وعيد وإنذار .والمعنى الثّاني : أن يكون المقصود بالخبر النبي صلى الله عليه وسلم فيكون وعداً له بالنّصر على مكذّبيه ، وإعلاماً له بأنّ سنّته سنّةُ غيره من الرّسل بطريقة جعل سنّة أمّته كسنّة غيرها من الأمم .وذكْرُ عموم الأمم في هذا الوعيد ، مع أنّ المقصود هم المشركون من العرب الذين لم يؤمنوا ، إنّما هو مبالغة في الإنذار والوعيد بتقريب حصوله كما حصل لغيرهم من الأمم على طريقة الاستشهاد بشواهد التّاريخ في قياس الحاضر على الماضي فيكون الوعيد خبراً معضوداً بالدّليل والحجّة ، كما قال تعالى في آيات كثيرة منها : { قد خلت من قبلكم سنن فسيروا في الأرض فانظروا كيف كان عاقبة المكذبين } \\[ آل عمران : 137 \\] أي : ما أنتم إلاّ أمة من الأمم المكذّبين ولكلّ أمّة أجل فأنتم لكم أجل سيحين حينه .وذِكر الأجل هنا ، دون أن يقول لكلّ أمّة عذاب أو استئصال ، إيقاظاً لعقولهم من أن يغرّهم الإمهال فيحسبوا أنّ الله غيرُ مؤاخذهم على تكذيبهم ، كما قالوا : { اللهم إن كان هذا هو الحق من عندك فأمطر علينا حجارة من السماء أو ائتنا بعذاب أليم } \\[ الأنفال : 32 \\] ، وطمأنةً للرسول عليه الصّلاة والسلام بأنّ تأخير العذاب عنهم إنّما هو جري على عادة الله تعالى في إمهال الظّالمين على حدّ قوله : { حتى إذا استيأس الرسل وظنوا أنهم قد كُذّبوا جاءهم نصرنا } \\[ يوسف : 110 \\] وقوله { لا يغرنَّك تقلب الذين كفروا في البلاد متاع قليل } \\[ آل عمران : 196 ، 197 \\].ومعنى : { لكل أمة أجل } لكلّ أمّة مكذّبة إمهال فحذف وصف أمّة أي : مكذّبة .وجعل لذلك الزّمان نهاية وهي الوقت المضروب لانقضاء الإمهال ، فالأجل يطلق على مدّة الإمهال ، ويُطلق على الوقت المحدّد به انتهاء الإمهال ، ولا شكّ أنّه وُضع لأحد الأمرين ثمّ استعمل في الآخرة على تأويل منتهى المدّة أو تأخير المنتهى وشاع الاستعمالان . فعلى الأوّل يقال قَضى الأجلَ أي المدّة كما قال تعالى : { أيَّما الأجلين قضيت } \\[ القصص : 28 \\] وعلى الثّاني يقال : «دنا أجل فلان» وقوله تعالى : { وبلغنا أجلنا الذي أجلت لنا } \\[ الأنعام : 128 \\] والواقع في هذه الآية يصحّ للاستعمالين بأن يكون المراد بالأجل الأوّل المدّة ، وبالثّاني الوقت المحدّد لفعللٍ مَّا .والمراد بالأمّة هنا الجماعة التي اشتركت في عقيدة الإشراك أو في تكذيب الرّسل ، كما يدلّ عليه السّياق من قوله تعالى : { وأن تشركوا بالله } \\[ الأعراف : 33 \\] إلخ وليس المراد بالأمّة ، الجماعةَ التي يجمعها نسب أو لغة إذ لا يتصوّر انقراضها عن بكرة أبيها ، ولم يقع في التّاريخ انقراض إحداها ، وإنّما وقع في بعض الأمم أن انقرض غالب رجالها بحوادث عظيمة مثل ( طَسْمٍ ) و ( جَدِيس ) و ( عَدْوَان ) فتندمج بقاياها في أمم أخرى مجاورة لها فلا يقال لأمّة إنّ لها أجلا تنقرض فيه ، إلاّ بمعنى جماعة يجمعها أنّها مُرسل إليها رسول فكذّبته ، وكذلك كان ما صْدَق هذه الآية ، فإنّ العرب لمّا أرسل محمّد صلى الله عليه وسلم ابتدأ دعوته فيهم ولهم ، فآمن به من آمن ، وتَلاحق المؤمنون أفواجاً ، وكذّب به أهل مكّة وتبعهم مَن حولهم ، وأمهل الله العربَ بحكمته وبرحمة نبيّه صلى الله عليه وسلم إذ قال : « لعل الله أن يخرج من أصلابهم من يعبده » فلطف الله بهم إذ جعلهم مختلطين مؤمنهم ومشركهم ، ثمّ هاجر المؤمنون فبقيت مكّة دار شرك وتمحّض مَنْ عَلِم الله أنّهم لا يؤمنون فأرسل الله عليهم عبادَهُ المؤمنين فاستأصلوهم فوْجاً بعد فوح ، في يوم بدر وما بعده من أيّام الإسلام ، إلى أن تَم استئصال أهل الشّرك بقتل بقيّة من قتل منهم في غزوة الفتح ، مثل عبد الله بن خَطَل ومن قُتل معه ، فلمّا فتحت مكّة دان العرب للإسلام وانقرض أهل الشّرك ، ولم تقم للشّرك قائمة بعد ذلك ، وأظهر الله عنايته بالأمّة العربيّة إذ كانت من أوّللِ دعوة الرّسول غير متمحّضة للشّرك ، بل كان فيها مسلمون من أوّل يوم الدّعوة ، وما زالوا يتزايدون .وليس المراد في الآية ، بأجل الأمّة ، أجلَ أفرادها ، وهو مدّة حياة كلّ واحد منها ، لأنّه لا علاقة له بالسّياق ، ولأنّ إسناده إلى الأمّة يعيّن أنّه أجل مجموعها لا أفرادها ، ولو أريد آجال الأفراد لقال لكلّ أحد أو لكلّ حَيّ أجل .و { إذا } ظرف زمان للمستقبل في الغالب ، وتتضمّن معنى الشّرط غالباً ، لأنّ معاني الظّروف قريبَة من معاني الشّرط لما فيها من التّعليق ، وقد استُغني بفاء تفريع عامل الظرّف هنا عن الإتيان بالفاء في جواب ( إذا ) لظهور معنى الرّبط والتّعليق بمجموع الظّرفية والتّفريع ، والمفرعُ هو : { جاء أجلهم } وإنّما قدم الظّرف على عامله للاهتمام به ليتأكدّ بذلك التّقديممِ معنى التّعليق . والمجيء مجاز في الحلول المقدَّر له كقولهم جاء الشّتاء .وإفراد الأجل في قوله : { إذا جاء أجلهم } مراعى فيه الجنس ، الصّادق بالكثير ، بقرينة إضافته إلى ضمير الجمع .وأُظهر لفظ أجل في قوله : { إذا جاء أجلهم } ولم يُكتف بضميره لزيادة تقرير الحكم عليه ، ولتكون هذه الجملة مستقلّة بنفسها غير متوقّفة عن سماع غيرها لأنّها بحيث تَجْري مَجرى المثل ، وإرسالُ الكلام الصّالح لأن يكون مَثلا طريق مِن طُرق البلاغة .و { يستأخرون } : و { يستقدمون } بمعنى : يتأخّرون ويتقدّمون ، فالسّين والتّاء فيهما للتّأكيد مثل استجاب .والمعنى : إنّهم لا يتجاوزونه بتأخير ولا يتعجّلونه بتقديم . والمقصود أنّهم لا يؤخّرون عنه ، فَعَطْفُ { ولا يستقدمون } لبيان أن ما علمه الله وقدّره على وفق علمه لا يَقْدِر أحد على تغييره وصَرفه ، فكان قوله : { ولا يستقدمون } لا تعلّق له بغرض التّهديد . وقريب من هذا قول أبي الشيص :وقف الهوى بي حيثُ أنتتِ فليس لي ... مُتَأخَّرٌ عَنْهُ وَلاَ مُتَقَدَّموكلّ ذلك مبني على تمثيل حالة الذي لا يستطيع التّخلّص من وعيد أو نحوه بهيئة من احتُبس بمكان لا يستطيع تجاوزه إلى الأمام ولا إلى الوراء .\n\n",
      "translations": [
        {
          "translation": "(And every nation) every people that have a religion (hath its term) an appointed time for its destruction, (and when its term) the time of their destruction (cometh, they cannot put it off an hour) they are not given reprieve one fraction of a second after their appointed time (nor yet advance (it)) they are not destroyed before the appointed time, even if it be by one fraction of a second.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } اعلموا أن { لِكُلِّ أُمَّةٍ } من الأمم العاصية الضالة { أَجَلٌ } مقدر من عند الله لمقتهم وهلاكهم { فَإِذَا جَآءَ أَجَلُهُمْ } المقدر المبرم { لاَ يَسْتَأْخِرُونَ سَاعَةً وَلاَ يَسْتَقْدِمُونَ } [الأعراف: 34] أي: لا يسع لهم فيه طلب التأخير على مقتضى أهويتهم ولا طلب التقديم تخليصاً لنفوسهم من الأذى\n بل أمرهم حتم نازل في وقته وحينه بلا تخلل تقدم وتأخير\n لكمال قدرته ومتانة حكمته\n\n\n{ يَابَنِيۤ ءَادَمَ } المستكملين القابلين للإرشاد والتكميل المستعدين لفيضان كمال التوحيد { إِمَّا يَأْتِيَنَّكُمْ } أي: أن يأتينكم ويرسلن إليكم { رُسُلٌ مِّنكُمْ } من جنسكم وبني نوعكم\n إذ هم أدخل لنصحكم وإرشادكم وأنسب لجذب قلوبكم\n وأشفق عليكم من الأجانب حال كونهم { يَقُصُّونَ عَلَيْكُمْ آيَاتِي } المنزلة من عندي",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { ولكل أمة أجل } أي: مدة ووقت لنزول العذاب بها إن لم يؤمنوا\n وهو تهديد لأهل مكة\n { فإذا جاء أجَلُهم } أي: انقرضت مدتهم\n أو دنى وقت هلاكهم\n { لا يستأخرون ساعةَ } عنه { ولا يستقدمون } أي: لا يتأخرون ولا يتقدمون عنه أقصَر وقت\n أو لا يطيقون التقدم والتأخر لشدة الهول\n وجعل بعضهم: { ولا يستقدمون } استئنافًا لأن الأجل إذا جاء لا يتصور التقدم\n وحينئذٍ يوقف على: { ساعة } \n ثم يقول: ولا هم يستقدمون عنه قبل وصوله\n الإشارة: قال شيخنا البوزيدي رضي الله عنه: زينة الله التي أظهر لعباده هي لباس المعرفة\n وهو نور التجلي\n والطيبات من الرزق هي حلاوة الشهود\n هـ\n وهي لمن كمل إيمانه وصِدقه في الحياة الدنيا\n وتصفو له إلى يوم القيامة\n فهي حلال على أهل التجريد يتمتعون بها في الدارين\n وإنما حرّم عليهم ما يشغلهم عن ربهم من جهة الظاهر\n وما يقطعهم عن شهوده من جهة الباطن\n وسوء الأدب مع الله\n والتعرض لعباد الله\n والشرك بالله بأن يشهدوا معه سواه\n وأن يقولوا على الله ما يوهم نقصًا أو خللاً في أنوار جماله وسناه\n\nوالله تعالى أعلم\n ثم إن العباد والزهاد وأهل البداية من المريدين السائرين ـ ينبغي لهم أن يزهدوا في زينة الدنيا وطيباتها لئلا تركن إليها نفوسهم\n فيثبط سيرهم\n وأما الواصلون فهم مع الله\n لا مع شيء سواه\n يأخذون من الله بالله\n ويدفعون بالله\n وقد اتسعت دائرة علمهم\n فليسوا مع لباس ولا أكل ولا شرب ولا جوع ولا شبع\n هم مع ما يبرز في الوقت من المقدورات\n والله تعالى أعلم\n ثم وصّاهم على الإيمان بالرسل\n عند ظهورهم\n فقال: { يَابَنِيۤ ءَادَمَ إِمَّا يَأْتِيَنَّكُمْ رُسُلٌ مِّنكُمْ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "10:49",
      "similarity": 0.7823857583424426
    },
    {
      "verse": "34:30",
      "similarity": 0.6505622924748778
    },
    {
      "verse": "16:61",
      "similarity": 0.5469603094593551
    },
    {
      "verse": "15:5",
      "similarity": 0.4514110532947477
    },
    {
      "verse": "23:43",
      "similarity": 0.4514110532947477
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007034.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007034.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:34.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}