{
  "chapter": "الأعراف",
  "text": "يبنى ءادم اما ياتينكم رسل منكم يقصون عليكم ءايتى فمن اتقى واصلح فلا خوف عليهم ولا هم يحزنون",
  "translations": [
    {
      "translation": "But as for those who reject Our Signs and are arrogant regarding them, they are the Companions of the Fire, remaining in it timelessly, for ever.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O sons of Adam, when apostles come to you from among you, who convey My messages, then those who take heed and amend will have neither fear nor regret.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam! If Messengers come to you from amongst yourselves who rehearse to you My signs, then those who shun disobedience and mend their ways shall have nothing to fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam, when Messengers from among your own people come to you to preach My revelations, those who choose piety and reform themselves will have nothing to fear nor will they be grieved.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Descendants of Adam! If Noble Messengers from among you come to you narrating My verses – so whoever practices piety and reforms – upon him shall be no fear nor shall he grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! If there come to you Messengers from among you, reciting to you My Ayat, then whosoever has Taqwa and becomes righteous, on them shall be no fear nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O children of Adam! if there come to you apostles from among you relating to you My communications, then whoever shall guard (against evil) and act aright-- they shall have no fear nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam! If there should come to you Messengers from among you, relating to you My signs, then whosoever is godfearing and makes amends -- no fear shall be on them, neither shall they sorrow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! When messengers of your own come unto you who narrate unto you My revelations, then whosoever refraineth from evil and amendeth - there shall no fear come upon them neither shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam! If messengers come to you from among yourselves, reciting My revelations to you, then those that take warning and mend their ways, on such shall come no fear nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! if there come unto you apostles from amongst you recounting My signs unto you, then whosoever shall fear God and amend, on them no fear shall come nor they shall grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! If there come to you apostles from among yourselves, recounting to you My signs, then those who are Godwary and righteous will have no fear, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O ye Children of Adam! whenever there come to you messengers from amongst you, rehearsing My signs unto you,- those who are righteous and mend (their lives),- on them shall be no fear nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! If there come to you Messengers from amongst you, reciting to you, My Verses, then whosoever becomes pious and righteous, on them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Children of Adam, when Messengers of your own come to narrate to you My verses, those who are cautious and mend their ways will have nothing to fear neither shall they be saddened,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O Children of Adam! When messengers from among you come to you, relating to you My revelations—whoever practices piety and reforms—upon them shall be no fear, nor shall they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "O children of Adam, if there come to you messengers from among you relating to you My verses, then whoever fears Allah and reforms - there will be no fear concerning them, nor will they grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:35] O Children of Adam! If (immā: the nūn of the conditional particle in has been assimilated with the extra mā) there should come to you messengers from among you, narrating to you My signs, then whoever fears, associating others with God, and makes amends, in his actions — no fear shall befall them, neither shall they grieve, in the Hereafter.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(0 Children of Adam! If messengers of your own) human beings like you (come unto you who narrate) recite (unto you My revelations) explaining commands and prohibitions, (then whosoever refraineth from evil) whosoever believes in the Scripture and messenger (and amendeth) that which is between him and his Lord (there shall no fear) regarding torment (come upon them neither shall they grieve) about missing Paradise.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ يَابَنِيۤ ءَادَمَ } المستكملين القابلين للإرشاد والتكميل المستعدين لفيضان كمال التوحيد { إِمَّا يَأْتِيَنَّكُمْ } أي: أن يأتينكم ويرسلن إليكم { رُسُلٌ مِّنكُمْ } من جنسكم وبني نوعكم؛ إذ هم أدخل لنصحكم وإرشادكم وأنسب لجذب قلوبكم، وأشفق عليكم من الأجانب حال كونهم { يَقُصُّونَ عَلَيْكُمْ آيَاتِي } المنزلة من عندي، الدالة على وحدة ذاتي فعليكم أن تصدقوهم ونؤمنوا لهم وبما جاءوا به من عندي من الأوامر والنواهي { فَمَنِ ٱتَّقَىٰ } منكم عن محارم الله بواسطة رسله وآياته { وَأَصْلَحَ } أي: أخلص أعماله لله بلا ترقب على الجزاء { فَلاَ خَوْفٌ عَلَيْهِمْ } لا في النشأة الأولى ولا في الأخرى { وَلاَ هُمْ يَحْزَنُون } [الأعراف: 35] عن سوء المنقلب والمثوى\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:7",
      "similarity": 0.44032076625128636
    },
    {
      "verse": "5:27",
      "similarity": 0.42006366864160505
    },
    {
      "verse": "6:48",
      "similarity": 0.4169072120165612
    },
    {
      "verse": "4:164",
      "similarity": 0.39337376246324124
    },
    {
      "verse": "3:62",
      "similarity": 0.39169121345108643
    }
  ]
}