{
  "chapter": "الأعراف",
  "text": "والذين كذبوا۟ بـايتنا واستكبروا۟ عنها او۟لئك اصحب النار هم فيها خلدون",
  "translations": [
    {
      "translation": "Who could do greater wrong than someone who invents lies against Allah or denies His Signs? Such people's portion of the Book will catch up with them so that when Our messengers come to them to take them in death, saying, 'Where are those you called upon besides Allah?' they will say, 'They have forsaken us,' testifying against themselves that they were kuffar.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who deny Our signs and disdain them, shall belong to Hell, where they will abide for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who reject Our revelations as false and turn away from them in arrogance, they shall be the inmates of Hell; and there shall they abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who have rejected Our revelations out of pride will be the dwellers of hell fire wherein they will live forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who denied Our signs and were conceited towards them, are the people of hell-fire; they will remain in it forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who reject Our Ayat and treat them with arrogance, they are the dwellers of the Fire, they will abide therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who reject Our communications and turn away from them haughtily-- these are the inmates of the fire they shall abide in it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those that cry lies to Our signs, and wax proud against them -- those shall be the inhabitants of the Fire, therein dwelling forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But they who deny Our revelations and scorn them - each are rightful owners of the Fire; they will abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who deny and scorn Our revelations shall be the inmates of Hell, where they shall remain forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who shall belie Our signs and shall be stiff- necked against them--they shall be fellows of the Fire; therein they shall be abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who deny Our signs and are disdainful of them, they shall be the inmates of the Fire and they shall remain in it [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who reject Our signs and treat them with arrogance,- they are companions of the Fire, to dwell therein (for ever).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who reject Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) and treat them with arrogance, they are the dwellers of the (Hell) Fire, they will abide therein forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "but, those who belie and grow proud against Our verses shall be the inhabitants of the Fire, and there they shall remain for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But as for those who reject Our revelations, and are too proud to accept them—these are the inmates of the Fire, where they will remain forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But the ones who deny Our verses and are arrogant toward them - those are the companions of the Fire; they will abide therein eternally.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:36] And those who deny Our signs and scorn them, not believing in them — those shall be the inhabitants of the Fire, abiding therein.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "160 (But they who deny Our revelations) Our Scripture and messenger (and scorn them) scorn believing in them (such are rightful owners of the Fire; they will abide therein) forever, never to die or be removed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n { والذين كذّبوا بآياتنا } أي: أخفوا صفاتنا بصفات أنفسهم { واستكبروا عنها } بالشيطنة { أولئك أصحاب } نار الحرمان { وبينهما حجاب } أي: بين أصحاب الجنة وبين أصحاب النار حجاب به كل منهم محجوب عن صاحبه\n والمراد بأصحاب الجنة ههنا: أهل ثواب الأعمال من الأبرار والزهاد والعباد الذين جنتهم جنة النفوس\n وإلا فأهل جنة القلوب والأرواح لا يحجبون عن أصحاب النار { وعلى الأعراف } أي: على أعالي ذلك الحجاب الذي هو حجاب القلب الفارق بين الفريقين هؤلاء عن يمينه وهؤلاء عن شماله { رجال } هم العرفاء أهل الله وخاصته { يعرفون كلاًّ } من الفريقين { بسيماهم } يسلمون على أهل الجنة بإمداد أسباب التزكية والتحلية والأنوار القلبية وإفاضة الخيرات والبركات عليهم\n لم يدخلوا الجنة لتجرّدهم عن ملابس صفات النفوس وطيباتها وترقيهم عن طورهم فلا يشغلهم عن الشهود الذاتي ومطالعة التجلي الصفاتي نعيم { وهم } أي: أصحاب الجنة { يطمعون } في دخولهم ليقتبسوا من نورهم ويستضيئوا بأشعة وجوههم\n ويستأنسوا بحضورهم",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَٱلَّذِينَ كَذَّبُواْ بِآيَٰتِنَا } المنزلة على رسلنا { وَٱسْتَكْبَرُواْ عَنْهَآ } وعمن أنزلت عليه عتواً وعناداً { أُوْلَـٰئِكَ } المكذبون المستكبرون { أَصْحَٰبُ ٱلنَّارِ } المعدة لجزاء المخذولين من أ÷ل الضلال { هُمْ فِيهَا خَٰلِدُونَ } [الأعراف: 36] لا نجاة لهم منها أصلا:\n\n\nنعوذ بك من سخطك يا ذا القوة المتين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { والذين كذّبوا بآياتنا واستكبرُوا عنها أولئك أصحاب النار هم فيها خالدون } \n فمِن كمال الإيمان: أن يقدر الإنسان نفسه أن لو كان في زمان كل رسول\n لكان أول من تبعه\n ولكان من خواص أصحابه\n هكذا يسير بعقله مع كل رسول من زمان آدم عليه السلام إلى مبعث رسولنا محمد صلى الله عليه وسلم\n والله تعالى أعلم\n الإشارة: قد جعل الله لكل نبي خلفاء يخلفونه في تبليغ أحكامه الظاهرة والباطنة\n وهم العلماء الأتقياء\n والأولياء العارفون الأصفياء\n فمن أراد أن يكون ممن لا خوف عليهم ولا هم يحزنون\n فليتبع علماء أهل زمانه في الشريعة\n وأولياء أهل عصره في تربية الحقيقة\n وبالله التوفيق\n ثم ذكر وعيد من استكبر\n فقال: { فَمَنْ أَظْلَمُ مِمَّنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ كَذِباً }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:39",
      "similarity": 0.872558355492374
    },
    {
      "verse": "2:82",
      "similarity": 0.587264069730681
    },
    {
      "verse": "64:10",
      "similarity": 0.5585651289156055
    },
    {
      "verse": "46:14",
      "similarity": 0.5582308739977523
    },
    {
      "verse": "2:257",
      "similarity": 0.507225786303977
    }
  ]
}