{
  "chapter": "الأعراف",
  "text": "فمن اظلم ممن افترى على الله كذبا او كذب بـايته او۟لئك ينالهم نصيبهم من الكتب حتى اذا جاءتهم رسلنا يتوفونهم قالوا۟ اين ما كنتم تدعون من دون الله قالوا۟ ضلوا۟ عنا وشهدوا۟ على انفسهم انهم كانوا۟ كفرين",
  "translations": [
    {
      "translation": "He will say, 'Enter the Fire together with the nations of jinn and men who have passed away before you.' Each time a nation enters, it will curse its sister nation, until, when they are all gathered together in it, the last of them will say to the first, 'Our Lord, those are the ones who misguided us, so give them a double punishment in the Fire.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who could be more wicked than he who imputes lies to God or denies His revelations? Such as these will receive what is declared in the Book, and when Our angels come to draw out their souls and ask: \"Where are they you worshipped other than God?\" They will answer: \"They have left us and fled;\" and bear witness against themselves for being infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more unjust then he who invents a falsehood, ascribing it to Allah, or who rejects His revelation as false? Their full portion of God's Decree shall reach them, until Our deputed angels come to them to take charge of their souls, and say: 'Where are the deities now, those whom you invoked besides Allah?' They will say: 'They are all gone away from us.' And they shall bear witness against themselves that they were unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who are more unjust than those who invent falsehoods against God and reject His revelations? These will have their share (of torment) which is ordained for them and when Our (angelic) Messengers come to them to cause them to die and ask them, \"Where are those whom you had been worshipping besides God?\" they will reply, \"We had gone astray from the path of God.\" Thus, they will testify against their own souls by confessing their disbelief.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So who is more unjust than one who fabricated a lie against Allah or denied His signs? Their written fate will reach them; until when Our sent angels come to remove their souls, hence they say to them, “Where are they whom you used to worship besides Allah?” They say, “We have lost them” and they testify against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more unjust than one who invents a lie against Allah or rejects His Ayat For such their appointed portion will reach them from the Book (of Decrees) until Our messengers (the angel of death and his assistants) come to them to take their souls, they (the angels) will say: \"Where are those whom you used to invoke and worship besides Allah,\" they will reply, \"They have vanished and deserted us.\" And they will bear witness against themselves, that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is then more unjust than he who forges a lie against Allah or rejects His communications? (As for) those, their portion of the Book shall reach them, until when Our apostles come to them causing them to die, they shall say: Where is that which you used to call upon besides Allah? They would say: They are gone away from us; and they shall bear witness against themselves that they were unbelievers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who does greater evil than he who forges against God a lie, or cries lies to His signs? Those - their portion of the Book shall reach them; till, when Our messengers come to them, to take them away, they say, 'Where is that you were calling on, beside God?' They will say, 'They have gone astray from us, and they will bear witness against themselves that they were unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who doeth greater wrong than he who inventeth a lie concerning Allah or denieth Our tokens. (For such) their appointed portion of the Book (of destiny) reacheth them till, when Our messengers come to gather them, they say: Where (now) is that to which ye cried beside Allah? They say: They have departed from us. And they testify against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who does a greater wrong than he who invents lies against God or rejects His revelations? Such people will have what has been decreed for them. And when Our messengers come to them to take away their souls, they shall ask them, \"Where are those you used to call upon besides God?\" They will answer, \"They have deserted us;\" and they will bear witness against themselves that they were disbelievers?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who doth greater wrong than he who fabricateth a lie against Allah or belieth His sign? These: their full portion from the Book shall reach them until when Our messengers come unto them causing them to die, and say: where is that which ye were wont to call upon beside Allah? They will say: they have strayed from us. And they shall testify against themselves that they have been infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "So who is a greater wrongdoer than him who fabricates a lie against Allah, or denies His signs? Their share, as decreed in the Book, shall reach them. When Our messengers come to take them away, they will say, ‘Where is that which you used to invoke besides Allah?’ They will say, ‘They have forsaken us,’ and they will testify against themselves that they were faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more unjust than one who invents a lie against Allah or rejects His Signs? For such, their portion appointed must reach them from the Book (of decrees): until, when our messengers (of death) arrive and take their souls, they say: \"Where are the things that ye used to invoke besides Allah?\" They will reply, \"They have left us in the lurch,\" And they will bear witness against themselves, that they had rejected Allah.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more unjust than one who invents a lie against Allah or rejects His Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.)? For such their appointed portion (good things of this worldly life and their period of stay therein) will reach them from the Book (of Decrees) until, when Our Messengers (the angel of death and his assistants) come to them to take their souls, they (the angels) will say: \"Where are those whom you used to invoke and worship besides Allah,\" they will reply, \"They have vanished and deserted us.\" And they will bear witness against themselves, that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who is more harmful than he who invents a lie about Allah or belies His verses? Such shall have their share of the Book, and when Our Messengers come to take them away, they shall say to them: 'Where now are those whom you invoked, other than Allah' 'They have forsaken us' they will answer, and will bear witness against themselves that they were unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who does greater wrong than he who invents lies about God, or denies His revelations? These—their share of the decree will reach them. Until, when Our envoys come to them, to take their souls away, they will say, “Where are they whom you used to pray to besides God?” They will say, “They have abandoned us,” and they will testify against themselves that they were faithless.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And who is more unjust than one who invents about Allah a lie or denies His verses? Those will attain their portion of the decree until when Our messengers come to them to take them in death, they will say, \"Where are those you used to invoke besides Allah?\" They will say, \"They have departed from us,\" and will bear witness against themselves that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:37] And who — that is, none — does greater evil than he who invents a lie against God, by ascribing to Him a partner or a child, or denies His signs?, the Qur’ān. Those — their portion, their lot, of the Scripture, of what has been inscribed as theirs in the Preserved Tablet (al-lawh al-mahfūz), in the way of provision, term [of life] and other matters, shall reach them until, when Our messengers, the angels, come to them, to take their souls, they say, to them, in reprimand: ‘Where is that which you were calling upon, worshipping, beside God?’ They will say, ‘They have gone astray from us’, they are not present [before us], and so we cannot see them; and they will bear witness against themselves, upon death, that they were disbelievers.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who doeth greater wrong) who is more insolent and bolder vis-a-vis Allah (than he who inventeth a lie concerning Allah or denieth Our tokens) Muhammad (pbuh) and the Qur'an. ((For such) their appointed portion of the Book (of destiny) reacheth them) that which they were promised in the Book such as turning their faces black and their eyes blue. Give them respite, Muhammad, (till, when Our messengers) i.e. the angel of death and his helpers (come to gather them) to take away their souls, (they say) upon taking away their souls: (Where (now) is that to which ye cried) worshipped (beside Allah) so that they can help you? (They say: They have departed from us) they are too occupied with themselves to pay attention to us. (And they testify against themselves that they were disbelievers) in Allah and the messengers in the life of this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nوبعدما أرسل الرسل وأنزل الكتب { فَمَنْ أَظْلَمُ مِمَّنِ ٱفْتَرَىٰ عَلَى ٱللَّهِ كَذِباً } أي: نسب إليه ما لم يصدر عنه افتراء وكذباً { أَوْ كَذَّبَ بِآيَاتِهِ } الصادرة عنه عناداً ومكابرة { أُوْلَـٰئِكَ } المفترون المكذبون { يَنَالُهُمْ نَصِيبُهُم مِّنَ ٱلْكِتَابِ } أي: مما كتب في اللوح وثبت فيه من العذاب والنكال لذوي الجرائم العظام { حَتَّىٰ إِذَا جَآءَتْهُمْ رُسُلُنَا } أي: ملائكتنا الموكلون { يَتَوَفَّوْنَهُمْ } لتوفية حساب العصاة { قَالُوۤاْ } أي: الملائكة لهم توبيخاً وتقريعاً: { أَيْنَ مَا كُنتُمْ تَدْعُونَ } وتعبدون { مِن دُونِ ٱللَّهِ } من الآلهة الباطلة وتعتقدونهم شفعاء { قَالُواْ } متضرعين مضطرين { ضَلُّواْ عَنَّا } أي: غابوا عنا بعدما أضلونا عن طريق الحق { وَشَهِدُواْ } واعترفوا { عَلَىٰ أَنْفُسِهِمْ أَنَّهُمْ كَانُواْ } في مدة حياتهم { كَافِرِينَ } [الأعراف: 37] ضالين\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { فمن أظلمُ ممن افترى على الله كذبًا } بأن نسب إليه الولد والشريك، { أو كذَّب بآياته } التي جاءت بها الرسل من عنده، أي: لا أحد أظلم منه، أو تَقوَّل على الله ما لم يقله، وكذّب بما قاله، { أولئك ينالُهم نصيبُهم من الكتاب } أي: يلحقهم نصيبهم مما كتب في اللوح المحفوظ من الأرزاق والآجال، { حتى إذا } انقضت أعمارهم و { جاءتُهم رسلُنا يَتوفَّونهم } أي: يتوفون أرواحهم، { قالوا } لهم توبيخًا: { أين ما كنتم تدّعون من دون الله } أي: أين الآلهة التي كنتم تعبدونها من دون الله لتدفع عنكم العذاب؟ { قالوا ضلُّوا عنا } غابوا عنا { وشهدوا على أنفسهم أنهم كانوا كافرين } ، اعترفوا بأنهم كانوا ضالين فيما كانوا عليه، وندموا حيث لم ينفع الندم، وقد زلت بهم القدم\n الإشارة: كل من أعرض عن خصوص أهل زمانه واشتغل بمتابعة حظوظه وهواه، ينال نصيبه من الدنيا الفانية وما قُسِم له فيها فإذا جاءت منيته ندم وتحسر، وقيل له: أين ما تمتعت به وشغلك عن مولاك؟ فيقول: قد غاب ذلك وفنى وانقضى، وكأنما كان برقًا سَرَى، أو طَيفَ كَرَى، والدهر كله هكذا لمن سدد نظرًا، وعند الصباح يحمد القوم السُّرَى، وستعلم، إذا انجلى الغبار، أفرس تحتك أم حمار\n وقد قال صلى الله عليه وسلم في بعض خطبه:\n\n \" لا تَخدَعَنَّكُم زخارفُ دُنيا دَنِيَّة، عن مَراتب جَنَّاتٍ عَالِية فكان قد كِشفَ القِناع، وارتفع الارتياب، ولاقى كل امرىءٍ مستقَرِّه، وعرف مثواه ومُنَقَلَبه \" \n\nوفي حديث آخر:\n\n \" مَن بدأ بَنَصِيبه من الدنيا فَاتَه نصيبُه من الآخرة، ولم يُدرك منها ما يريد، ومن بدأ بنصيبه من الآخرة، وصل إليه نصيبه من الدنيا، وأدرك من الآخرة ما يريد \"\n \n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "3:92",
      "similarity": 0.46108691263621754
    },
    {
      "verse": "7:49",
      "similarity": 0.4234462358949686
    },
    {
      "verse": "7:152",
      "similarity": 0.419529721693786
    },
    {
      "verse": "2:124",
      "similarity": 0.36009018569878853
    },
    {
      "verse": "33:25",
      "similarity": 0.3464496827956469
    }
  ]
}