{
  "chapter": "الأعراف",
  "text": "قال ادخلوا۟ فى امم قد خلت من قبلكم من الجن والانس فى النار كلما دخلت امة لعنت اختها حتى اذا اداركوا۟ فيها جميعا قالت اخرىهم لاولىهم ربنا هؤلاء اضلونا فـاتهم عذابا ضعفا من النار قال لكل ضعف ولكن لا تعلمون",
  "translations": [
    {
      "translation": "He will say, 'Each will receive double. But you do not know it.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Enter then the Fire,\" will God say, \"with the past generations of jinns and men.\" On entering each batch will condemn the other; and when all of them shall have entered one after the other, the last to come will say of those who had come before them: \"O our Lord, they are the ones who led us astray; so give them double chastisement in the Fire.\" He will answer: \"For all it will be double; but this you do not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah ivill say: 'Enter the fire of Hell and join the nations of jinn and men that have gone before You.' As a nation enters Hill, it will curse the one that went before it, and when all are gathered there, the last of them shall say of the first: 'Our Lord! These are the ones who led us astray. Let their torment be doubled in Hell-Fire.' He will answer: 'Each will have a doubled torment; although you do not know.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(On the Day of Judgment) the Lord will say to them, \"Join the group of jinn and people who lived before you, in hell.\" Each group, on entering hell, will curse the other dwellers, until all of them are brought together therein. The last group will accuse the first saying, \"Lord, they made us go astray. Therefore, double their torment in the Fire.\" The Lord will reply, \"For everyone of you there is a double torment, but you do not know it\".\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah says to them, “Join the groups of jinns and mankind who have entered hell before you”; when a group enters, it curses the other; until when they have all gone in, the latter groups will say regarding the former, “Our Lord! It is these who led us astray, so give them double the punishment of the fire”; He will say, “For each one is double – but you do not know.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) will say: \"Enter you in the company of nations who passed away before you, of men and Jinn, into the Fire.\" Every time a new nation enters, it curses its sister nation (that went before) until they are all together in the Fire. The last of them will say to the first of them: \"Our Lord! These misled us, so give them a double torment of the Fire.\" He will say: \"For each one there is double (torment), but you know not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: Enter into fire among the nations that have passed away before you from among jinn and men; whenever a nation shall enter, it shall curse its sister, until when they have all come up with one another into it; the last of them shall say with regard to the foremost of them: Our Lord! these led us astray therefore give them a double chastisement of the fire. He will say: Every one shall have double but you do not know.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say, 'Enter among nations that passed away before you, jinn and mankind, into the Fire.' Whenever any nation enters, it curses its sister-nation; till, when they have all successively come there, the last of them shall say to the first of them, 'O our Lord, these led us astray; so give them a double chastisement of the Fire.' He will say, 'Unto each a double, but you know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He saith: Enter into the Fire among nations of the jinn and humankind who passed away before you. Every time a nation entereth, it curseth its sister (nation) till, when they have all been made to follow one another thither, the last of them saith unto the first of them: Our Lord! These led us astray, so give them double torment of the Fire. He saith: For each one there is double (torment), but ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "God will say, \"Enter the Fire and join the bands of jinn and men that have gone before you.\" Every time a host enters [the fire], it will curse its fellow-host, then, when they are all gathered there, the last of them will say of the first, \"Our Lord, it was they who led us astray: give them double punishment in the Fire,\" -- God will say, \"Every one of you will have double punishment, though you do not know it\" --\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Allah will say. enter the Fire among the communities who have passed away before you, of genii and mankind. So oft as a community will enter it, it shall curse its sister, until, when all shall have arrived one after anot her therein, the last of them shall say of the first of them: our Lord! these led us astray; so mete out unto them and double torment of the Fire, He will say: to each, double; but ye know not.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say, ‘Enter the Fire, along with the nations of jinn and humans who passed before you!’ Every time that a nation enters [hell], it will curse its sister [nation]. When they all rejoin in it, the last of them will say about the first of them, ‘Our Lord, it was they who led us astray; so give them a double punishment of the Fire.’ He will say, ‘It is double for each [of you], but you do not know.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: \"Enter ye in the company of the peoples who passed away before you - men and jinns, - into the Fire.\" Every time a new people enters, it curses its sister-people (that went before), until they follow each other, all into the Fire. Saith the last about the first: \"Our Lord! it is these that misled us: so give them a double penalty in the Fire.\" He will say: \"Doubled for all\": but this ye do not understand.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Allah) will say: \"Enter you in the company of nations who passed away before you, of men and jinns, into the Fire.\" Every time a new nation enters, it curses its sister nation (that went before), until they will be gathered all together in the Fire. The last of them will say to the first of them: \"Our Lord! These misled us, so give them a double torment of the Fire.\" He will say: \"For each one there is double (torment), but you know not.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say: 'Enter the Fire and join the nations of jinn and humans that have gone before you' As they enter, every nation will curse its sisternation, and when all are gathered in the pit, the last of them will say of the first: 'These, Lord, are those who led us astray. Give them a double punishment of the Fire. He will answer: 'For each double, although you do not know it'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "He will say, “Join the crowds of jinn and humans who have gone into the Fire before you.” Every time a crowd enters, it will curse its sister-crowd. Until, when they are all in it, the last of them will say to the first of them, “Our Lord, these are the ones who misled us, so inflict on them a double punishment in the Fire.” He will say, “Each will have a double, but you do not know.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah] will say, \"Enter among nations which had passed on before you of jinn and mankind into the Fire.\" Every time a nation enters, it will curse its sister until, when they have all overtaken one another therein, the last of them will say about the first of them \"Our Lord, these had misled us, so give them a double punishment of the Fire. He will say, \"For each is double, but you do not know.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:38] He, exalted be He, will say, to them, on the Day of Resurrection: ‘Enter into the Fire among, the number of, communities of jinn and mankind who passed away before you’ (fī’l-nār, ‘into the Fire’, is semantically connected to udkhulū, ‘enter’). Every time a community enters, the Fire, it curses its sister-community, [the one] that came before it, because of its having gone astray on account of it, until, when they have all followed, caught up with, one another there, the last of them, those who were the followers, shall say to the first of them, those whom they revered and followed: ‘Our Lord, these led us astray; so give them a double   chastisement of the Fire.’ He, exalted be He, will say, ‘For each, of you and them, will be a double, chastisement, but you do not know’ (read ta‘lamūn, or ya‘lamūn, ‘they [do not] know’), what will be for each party.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nفأمّا قوله : { قال ادخلوا في أمم } فهذا قول آخر ، ليس هو من المحاورة السّابقة ، لأنّه جاء بصيغة الإفراد ، والأقوالُ قبله مسندة إلى ضمائر الجمع ، فتعيّن أنّ ضمير ( قال ) عائد إلى الله تعالى بقرينة المقام ، لأنّ مثل هذا القول لا يصدر من أحد غير الله تعالى ، فهو استيناف كلام نشأ بمناسبة حكاية حال المشركين حينَ أوّل قدومهم على الحياة الآخرة ، وهي حالة وفاة الواحد منهم فيَكون خطاباً صدر من الله إليهم بواسطة أحد ملائكته ، أو بكلام سمعوه وعلموا أنّه من قِبَل الله تعالى بحيث يوقنون منه أنّهم داخلون إلى النار ، فيكون هذا من أشدّ ما يرون فيه مقعدهم من النّار عقوبة خاصّة بهم . والأمر مستعمل للوعيد فيتأخّر تنجيزه إلى يوم القيامة .ويجوز أن يكون المحكي به ما يصدر من الله تعالى يوم القيامة من حكم عليهم بدخول النّار مع الأمم السّابقة ، فذُكر عقب حكاية حال قبض أرواحهم إكمالاً لذكر حال مصيرهم ، وتخلّصاً إلى وصف ما ينتظرهم من العذاب ولذكر أحوال غيرهم . وأيَّاً مّا كان فالإتيان بفعل القول ، بصيغه الماضي : للتنبيه على تحقيق وقوعه على خلاف مقتضى الظاهر .ويجوز أن تكون جملة : { قال ادخلوا في أمم } في موضع عطف البيان لجملة { ينالهم نصيبهم من الكتاب } أي : قال الله فيما كتبه لهم { ادخلوا في أمم قد خلت من قبلكم }\\[ الأعراف : 34 \\] أي أمثالكم ، والتّعبير بفعل المضي جرَى على مقتضى الظّاهر .والأمم جمع الأمّة بالمعنى الذي تقدّم في قوله : { ولكل أمة أجل }.و ( في ) من قوله : { في أمم } للظّرفية المجازيّة ، وهي كونهم في حالة واحدة وحكممٍ واحد ، سواء دخلوا النّار في وسطهم أم دخلوا قبلهم أو بَعدهم ، وهي بمعنى ( مع ) في تفسير المعنى ، ونقل عن صاحب «الكشاف» أنه نظَّر ( في ) التي في هذه الآية بفي التي في قول عروة بن أذينة :إنْ تَكُنْ عن حسن الصّنيعة مأفُو ... كاً ففي آخرينَ قد أُفِكُواومعنى : { قد خلت } قد مضت وانقرضت قبلكم ، كما في قوله تعالى : { تلك أمة قد خلت } في سورة البقرة ( 134 ) ، يعني : أنّ حالهم كحال الأمم المكذّبين قبلَهم ، وهذا تذكير لهم بما حاق بأولئك الأمم من عذاب الدّنيا كقوله : { وتبين لكم كيف فعلنا بهم } \\[ إبراهيم : 45 \\] وتعريض بالوعيد بأن يحل بهم مثل ذلك ، وتصريح بأنّهم في عذاب النّار سواء .جملة : { كلما دخلت أمة لعنت أختها } مستأنفة استئنافاً ابتدائياً ، لوصف أحوالهم في النّار ، وتفظيعها للسّامع ، ليتّعظ أمثالهم ويستبشر المؤمنين بالسّلامة ممّا أصابهم فتكون جملة { حتى إذا اداركوا } داخلة في حيز الاستيناف .ويجوز أن تكون جملة : { كلما دخلت أمة } معترضة بين جملة : { قال ادخلوا في أمم قد خلت من قبلكم من الجن والإنس في النار } وبين جملة : { حتى إذا أداركوا فيها } إلخ . على أن تكون جملة { حتى إذا اداركوا } مرتبطة بجملة { ادخلوا في أمم } بتقدير محذوف تقديره : فيدخلون حتّى إذا اداركوا .و ( ما ) في قوله : { كلّما } ظرفية مصدريّة ، أي كلّ وقت دخول أمّة لعنت أختها . والتّقدير : لعنت كلّ أمّة منهم أختها في كلّ أوقات دخول الأمّة منهم ، فتفيد عموم الأزمنة .و { أمّة } نكرة وقعت في حيز عموم الأزمنة ، فتفيد العموم ، أي كلّ أمة دخلت ، وكذلك : { أختَها } نكرة لأنّه مضاف إلى ضمير نكرة فلا يتعرّف فتفيد العموم أيضاً ، أي كل أمة تدخل تلعن كل أخت لها ، والمراد بأختها المماثِلة لها في الدّين الذي أوجب لها الدّخول في النّار ، كما يقال : هذه الأمّة أخت تلك الأمّة إذا اشتركتا في النّسب ، فيقال : بَكْر وأختها تغلب ، ومنه قول أبي الطبيّب :وكطَسْم وأُخْتِها في البعاد ... يريد : كَطَسم وجَدِيس .والمقام يعيّن جهة الأخوّة ، وسبَبُ اللّعن أنّ كل أمّة إنّما تدخل النّار بعد مناقشة الحساب ، والأمر بإدخالهم النّار ، وإنّما يقع ذلك بعد أن يتبيّن لهم أنّ ما كانوا عليه من الدّين هو ضلال وباطل ، وبذلك تقع في نفوسهم كراهية ما كانوا عليه ، لأنّ النّفوس تكره الضّلال والباطل بعد تبيُّنه ، ولأنّهم رأوا أن عاقبة ذلك كانت مجلبة العقاب لهم فيزدادون بذلك كراهيّة لدينهم ، فإذا دخلوا النّار فرأوا الأمم التي أدخلت النّار قبلهم علموا ، بوجه من وجوه العلم ، أنّهم أُدخلوا النّار بذلك السّبب فلعنوهم لكراهيّة دينهم ومن اتّبعوه .وقيل : المراد بأختها أسلافها الذين أضلّوها .وأفادت { كلّما } لما فيها من معنى التّوقيت : أنّ ذلك اللّعن يقع عند دخول الأمّة النّار ، فيتعيّن إذن أن يكون التّقدير : لعنت أختها السّابقة إياها في الدّخول في النّار ، فالأمّة التي تدخل النّار أوّل مرّة قبل غيرها من الأمم لا تَلْعن أختها ، ويعلم أنّها تلعن من يدخل بعدَها الثّانيةَ ، ومن بعدها بطريق الأوْلى ، أو ترُدّ اللّعن على كلّ أخت لاعنة . والمعنى : كلّما دخلت أمّة منهم بقرينة قوله : { لعنت أختها }.و ( حتّى ) في قوله : { حتى إذا اداركوا } ابتدائيّة ، فهي جملة مستأنفة وقد تقدّم في الآية قبل هذه أن ( حتّى ) الابتدائيّة تفيد معنى التّسبّب ، أي تسبّب مضمون ما قبلها في مضمون ما بعدها ، فيجوز أن تكون مترتِبَة في المعنى على مضمون قوله : { قال أدخلوا في أمم قد خلت } إلخ ، ويجوز أن تكون مترتّبة على مضمون قوله : { كلما دخلت أمة لعنت أختها }.و { اداركوا } أصله تَداركوا فقلبت التّاء دَالا ليتأتى إدغامها في الدّال للتّخفيف ، وسُكنت ليتحقّق معنى الإدغام المتحركين ، لثقل واجتلبت همزة الوصل لأجل الابتداء بالسّاكن ، وهذا قلْب ليس بمتعيّن ، وإنّما هو مستحسن ، وليس هو مثل قلب التّاء في ادّان وازْداد وادّكر : ومعناه : أدرك بعضهم بعضاً ، فصيغ من الإدراك وزن التّفاعل ، والمعنى : تلاحقوا واجتمعوا في النّار . وقوله : { جميعاً } حال من ضمير { اداركوا } لتحقيق استيعاب الاجتماع ، أي حتى إذا اجتمعت أمم الضّلال كلّها .والمراد : ب { أخراهم } : الآخِرة في الرّتبة ، وهم الأتباع والرّعيّة من كلّ أمّة من تلك الأمم ، لأنّ كلّ أمّة في عصر لا تخلو من قادة ورَعاع ، والمراد بالأولى : الأولى في المرتبة والاعتبار ، وهم القادة والمتبوعون من كلّ أمّة أيضاً ، فالأخرى والأولى هنا صفتان جرتا على موصوفَين محذوفين ، أي أخرى الطّوائف لأولاهم ، وقيل : أريد بالأخرى المتأخّرة في الزّمان ، وبالأولى أسلافهم ، لأنّهم يقولون : { إنّا وجدنا آباءنا على أمة } \\[ الزخرف : 23 \\]. وهذا لا يلائم ما يأتي بعده .واللاّم في : { لأولاَهم } لام العلّة ، وليست اللاّم التي يتعدّى بها فعل القَول ، لأنّ قول الطائفة الأخيرة موجَّه إلى الله تعالى ، بصريح قولهم : { ربنا هؤلاء أضلونا } إلخ ، لا إلى الطّائفة الأولى ، فهي كاللاّم في قوله تعالى : { وقال الذين كفروا للذين آمنوا لو كان خيراً ما سبقونا إليه } \\[ الأحقاف : 11 \\].والضعف بكسر الضّاد المِثْل لمقدار الشّيء ، وهو من الألفاظ الدّالة على معنى نسبي يقتضي وجودَ معنى آخر ، كالزّوج والنِّصف ، ويختص بالمقدار والعدد ، هذا قول أبي عبيدة والزّجاج وأيمّة اللّغة ، وقد يستعمل فعله في مطلق التّكثير وذلك إذا أسند إلى ما لا يدخل تحت المقدار ، مثل العذاب في قوله تعالى : { يُضَاعَفْ له العذاب يوم القيامة } \\[ الفرقان : 69 \\] وقوله { يضاعف لها العذاب ضعفين } \\[ الأحزاب : 30 \\] أراد الكثرة القويّة فقولهم هنا { فآتهم عذاباً ضعفا } أي أعطهم عذاباً هو ضِعف عذاببٍ آخر ، فعُلم أنّه ، آتاهم عذاباً ، وهم سألوا زيادة قوّة فيه تبلغ ما يعادل قوّته ، ولذلك لما وصف بضعف علم أنّه مِثْلٌ لعذاببٍ حصل قبله إذ لا تقول : أكرمت فلان ضِعفاً ، إلاّ إذا كان إكرامك في مقابلة إكراممٍ آخر ، فأنت تزيده ، فهم سألوا لهم مضاعفة العذاب لأنّهم علموا أنّ الضّلال سبب العذاب ، فعلموا أنّ الذين شرعوا الضّلال هم أولى بعقوبة أشدّ من عقوبة الذين تقلّدوه واتبعوهم ، كما قال تعالى في الآية الآخرى :{ يقول الذين استضعفوا للذين استكبروا لولا أنتم لكنا مؤمنين } \\[ سبأ : 31 \\].وفعل : { قال } حكاية لجواب الله إياهم عن سُؤالهم مضاعفةَ العذاب لقادتهم ، فلذلك فصل ولم يعطف جريا على طريقة حكاية الأقوال في المحاورات ، والتّنوينُ في قوله : { لكلّ } عوض عن المضاف إليه المحذوف ، والتّقدير : لكلّ أمّة ، أو لكلّ طائفة ضعف ، أي زيادة عذاب مثل العذاب الذي هي معذّبه أولَ الأمر ، فأمّا مضاعفة العذاب للقادة فلأنّهم سنّوا الضّلال أو أيّدوه ونصروه وذبّوا عنه بالتّمويه والمغالطات فأضلوا ، وأمّا مضاعفته للأتباع فلأنَهم ضلّوا بإضلال قادتهم ، ولأنّهم بطاعتهم العمياء لقادتهم ، وشكرهم إياهم على ما يرسمون لهم ، وإعطائِهم إياهم الأموال والرّشى ، يزيدونهم طغياناً وجراءة على الإضلال ويغرّونهم بالازدياد منه .والاستدراك في قوله : { ولكن لا تعلمون } لرفع ما تُوهِمه التّسوية بين القادة والأتباع في مضاعفة العذاب : أنّ التّغليظ على الأتباع بلا موجب ، لأنّهم لولا القادة لما ضلّوا ، والمعنى : أنّكم لا تعلمون الحقائق ولا تشعرون بخفايا المعاني ، فلذلك ظننتم أنّ موجب مضاعفة العذاب لهم دونكم هو أنّهم علّموكم الضّلال ، ولو علمتم حقّ العلم لاطّلعتم على ما كان لطاعتكم إياهم من الأثر في إغرائهم بالازدياد من الإضلال . ومفعول { تعلمون } محذوف دلّ عليه قوله : { لكلٍ ضِعف } ، والتّقدير : لا تعلمون سبب تضعيف العذاب لكلّ من الطّائفتين ، يعني لا تعلمون سبب تضعيفه لكم لظهور أنّهم علموا سبب تضعيفه للذين أضلّوهم .وقرأ الجمهور : { لا تَعلمون } بتاء الخطاب على أنّه من تمام ما خاطب الله به الأمّة الأخرى ، وقرأه أبو بكر عن عاصم بياء الغيبة فيكون بمنزلة التّذييل خطاباً لسامعي القرآن ، أي قال الله لهم ذلك وهم لا يَعلمون أنّ لكلّ ضعفاً فلذلك سألوا التّغليظ على القادة فأجيبوا بأنّ التّغليظ قد سُلّط على الفريقين .\n\n",
      "translations": [
        {
          "translation": "(He saith) Allah says to them: (Enter into the Fire among nations) of the disbelievers (of the jinn and humankind who passed away before you. Every time a nation) the adherents of a religion (entereth, it curseth its sister (nation)) that went in before it (till, when they have all) from the first to the last (been made to follow one another thither) and all gather in the Fire, (the last of them) the last of nations (saith unto the first of them) the first of nations: (Our Lord! These) i.e. the leaders (led us astray) from Your religion and obedience, (so give them double torment of the Fire) torment them with double what you inflict on us. (He says) Allah says to them: (For each one there is double (torment), but ye know not) because of the severity of the torment.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { حَتَّىٰ إِذَا ٱدَّارَكُواْ فِيهَا جَمِيعاً } معناهُ اجتمعوا فِيها\n\n\n\n\nوقوله تعالى: { عَذَاباً ضِعْفاً } معناهُ عَذابين\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {Until they reach it all together} means that they will all gather in it.\n\n\nAnd His statement, {a punishment double} [refers to] two punishments.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ قَالَ } سبحانه من وراء سرادقات العز والجلال على مقتضى عدله: { ٱدْخُلُواْ } أيها الضالون المكذبون { فِيۤ } زمرة { أُمَمٍ } عاصية كافرة { قَدْ خَلَتْ } مضت { مِن قَبْلِكُمْ } على الكفر والضلال أمثالكم { مِّن ٱلْجِنِّ وَٱلإِنْسِ فِي ٱلنَّارِ } المعدة لجزاء العصاة الغواة الكفرة\n وبعد صدرو الأمر الوجوبي منه سبحانه صاروا بحث { كُلَّمَا دَخَلَتْ أُمَّةٌ } في نار الخذلان { لَّعَنَتْ أُخْتَهَا } التي أضلتها { حَتَّىٰ إِذَا ٱدَّارَكُواْ } وتلاحقوا { فِيهَا جَمِيعاً } مجتمعين { قَالَتْ أُخْرَاهُمْ } أي: مستأخرهم { لأُولاَهُمْ } أي: لأجل مستقدميهم وفي حقهم\n متضرعين إلى ربهم: { رَبَّنَا هَـٰؤُلاۤءِ } الضالون المضلون { أَضَلُّونَا } عن طريقك بوضع سنن الضلال بيننا فاقتيدنا بهم\n فضللنا { فَآتِهِمْ } الآن وأنزل عليهم { عَذَاباً ضِعْفاً مِّنَ ٱلنَّارِ } أي: مثل عذابنا\n لأنهم ضالون مضلون { قَالَ } سبحانه على مقتضى عدله: { لِكُلٍّ } منكم أيها الأتباع ومن متبوعيكم { ضِعْفٌ } من النار\n أمَّا المتبوعون فلضلالهم وإضلالهم\n وأمَّا التابعون فلضلالهم وتقليدهم بهؤلاء المضلين لا بالأنبياء { وَلَـٰكِن لاَّ تَعْلَمُونَ } [الأعراف: 38] استحقاقكم واستحقاقهم",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nيقول الحقّ جلّ جلاله: { قال } الله تعالى أي: يوم القيامة للكفارٍ\n بواسطة ملك\n أو بغيرها: { ادخلوا في } جملة { أممٍ } كاانوا من قبلكم { من الجن والإنس } متفقين معكم في الكفر والضلال\n فادخلوا مصاحبين معهم { في النار }\n قال تعالى\n مخبرًا عن حالهم: { كلما دخلت أمةٌ } منهم في النار { لعنت أختها } التي ضلت بالاقتداء بها\n { حتى إذا أدَّاركوا } أي: تداركوا وتلاحقوا\n { فيها جميعًا قالت أُخراهم } دخولاً أو منزلة\n وهم الأتباع السفلة\n { لأُولاهم } وهم المتبوعون الرؤساء ـ أي: قالت لأجلهم لأن الخطاب مع الله لا معهم\n قالوا: { ربنا هؤلاء } الرؤساء { أضلونا } حيث سنُّوا لنا الضلال فاقتدينا بهم\n { فآتِهم عذابًا ضِعفًا } أي: مضاعفًا { من النار } لأنهم ضلوا وأضلوا\n { قال } تعالى: { لكلٍّ } واحد منكم { ضِعفٌ } أي: عذابًا مضعفًا\n أما القادة فلكفرهم وتضليلهم\n وأما الأتباع فلكفرهم وتقليدهم\n { ولكن لا تعلمون } ما لكم\n أو ما لكل فريق منكم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "26:61",
      "similarity": 0.48099092538066995
    },
    {
      "verse": "27:66",
      "similarity": 0.39494463121424334
    },
    {
      "verse": "4:145",
      "similarity": 0.3662883446508785
    },
    {
      "verse": "6:103",
      "similarity": 0.3459801666327218
    },
    {
      "verse": "36:40",
      "similarity": 0.33737594392888176
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007038.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007038.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:38.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}