{
  "chapter": "الأعراف",
  "text": "وكم من قرية اهلكنها فجاءها باسنا بيتا او هم قائلون",
  "translations": [
    {
      "translation": "Many a habitation have We laid low before: Our retribution came upon them in the night or in the midst of siesta at noon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a township We have destroyed! Our scourge fell upon them at night, or when they were taking midday rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many cities have We destroyed! Our wrath struck their people at night or during their midday siesta.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And many a township did We destroy – so Our punishment came to them at night or while they were sleeping at noon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a great number of towns We destroyed. Our torment came upon them by night or while they were taking their midday nap.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a town that We destroyed, so Our punishment came to it by night or while they slept at midday.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a city We have destroyed! Our might came upon it at night, or while they took their ease in the noontide,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a township have We destroyed! As a raid by night, or while they slept at noon, Our terror came unto them.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many towns We have destroyed. Our scourge fell upon them by night or at midday when they were resting:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many a township We have destroyed, upon them Our violence came at night or while they were taking their midday rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a town We have destroyed! Our punishment came to it at night, or while they were taking a midday nap.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many towns have We destroyed (for their sins)? Our punishment took them on a sudden by night or while they slept for their afternoon rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And a great number of towns (their population) We destroyed (for their crimes). Our torment came upon them (suddenly) by night or while they were sleeping for their afternoon rest.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a village have We laid in ruin! In the night Our Might fell upon it, or at midday when they were drowsy.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "How many a town have We destroyed? Our might came upon them by night, or while they were napping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And how many cities have We destroyed, and Our punishment came to them at night or while they were sleeping at noon.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:4] How many (kam is predicative and is the direct object [of the main verb, ahlaknāhā, ‘We have destroyed’]) a city, meaning its inhabitants, have We destroyed, have We willed its destruction! So Our might, Our chastisement, came upon it at night or while they slept at noon (qā’ilūn: al-qaylūla is a rest taken halfway during the day, even if it does not involve sleep), in other words, sometimes it came upon it at night, and sometimes it came during the day.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(How many a township) people of townships (have We destroyed) We tormented! (As a raid by night) or day, (or while they slept at noon, Our terror) Our punishment (came unto them).\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَجَآءَهَا بَأْسُنَا بَيَاتاً } أي ليلاً بيتهم بياتاً وهم نيامٌ\n\n\n\n\nوقوله تعالى: { أَوْ هُمْ قَآئِلُونَ } أي نَهاراً إِذا أَقالُوا\n\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَ } عليكم ألا تغتروا بها بل تذكروا { كَم } كثير { مِّن } أهل { قَرْيَةٍ } ذوي بطر ورفاهية { أَهْلَكْنَاهَا } بإنزال قهرنا إليها حتى استحقوا الهلاك بسبب كفرهم وظلمهم { فَجَآءَهَا بَأْسُنَا } قهرنا { بَيَاتاً } حال كونهم راقدين رقود البطر والغفلة { أَوْ هُمْ قَآئِلُونَ } [الأعراف: 4] مستريحون وقت الضحوة الكبرى تنعماً وحضوراً\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { كم }: خبرية، مفعول { أهلكنا } ، وهو على حذف الإرادة، أي: في الحال أردنا إهلاكها، و { بياتًا أو هم قائلون }: حالان، أي: بائتين أو قائلين، وأغنى الضمير في { هم } عن واو الحال\n يقول الحقّ جلّ جلاله: كثيرًا من القرى { أهلكناها } لما عصت أمرنا، وخالفت ما جاءت به رسلنا، { فجاءها بأسُنَا } أي: عذابنا { بياتًا } أي: ليلاً، كقوم لوط قلبت مدينتهم، عاليها سافلها، وأرسلت عليهم الحجارة بالسَّحَر، { أو هم قائلون } نصف النهار، كقوم شعيب، نزلت عليهم نار فأحرقتهم، وهو عذاب يوم الظلمة، وإنما خص الوقتين لأنهما وقت دعة واستراحة، فيكون مجيء العذاب فيهما أفظع",
      "translations": []
    }
  ]
}