{
  "chapter": "الأعراف",
  "text": "ان الذين كذبوا۟ بـايتنا واستكبروا۟ عنها لا تفتح لهم ابوب السماء ولا يدخلون الجنة حتى يلج الجمل فى سم الخياط وكذلك نجزى المجرمين",
  "translations": [
    {
      "translation": "As for those who deny Our Signs and are arrogant regarding them, the Gates of Heaven will not be opened for them, and they will not enter the Garden until a camel goes through a needle's eye. That is how We repay the evildoers.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily for those who deny Our signs and turn away in haughtiness from them, the gates of heaven shall not be opened, nor will they enter Paradise, not till the camel passes through the needle's eye. That is how We requite the transgressors:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely the gates of Heaven shall not be opened for those who reject Our signs as false and turn away ' from them in arrogance; nor shall they enter Paradise until a camel passes through the eye of a needle. Thus do We reward the guilty ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "For those who have rejected Our revelations out of pride, no door to the heavens will be opened, nor will they be admitted into Paradise until a camel passes through the eye of a sewing needle. Thus do We recompense the criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed those who denied Our signs and were conceited towards them – the gates of the heavens will not be opened for them nor will they enter Paradise until the camel goes through the needle’s eye*; and this is the sort of reward We give the guilty. (* Which will never happen.)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who belie Our Ayat and treat them with arrogance, for them the gates of the heavens will not be opened, and they will not enter Paradise until the Jamal goes through the eye of the needle. Thus do We recompense the criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Surely (as for) those who reject Our communications and turn away from them haughtily, the doors of heaven shall not be opened for them, nor shall they enter the garden until the camel pass through the eye of the needle; and thus do We reward the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those that cry lies to Our signs and wax proud against them the gates of heaven shall not be opened to them, nor shall they enter Paradise until the camel passes through the eye of the needle. Even so We recompense the sinners;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Lo! they who deny Our revelations and scorn them, for them the gates of heaven will nor be opened not will they enter the Garden until the camel goeth through the needle's eye. Thus do We requite the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The gates of Heaven shall not be opened for those who rejected Our signs and arrogantly spurned them; nor shall they enter Paradise until a camel shall pass through the eye of a needle. That is how We repay the evil-doers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily those who belie Our signs and are stiff-necked against them, for them will not be opened the portals of heaven, nor shall they enter the Garden until a camel passeth through the eye of a needle. And Thus We requite the guilty ones.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who deny Our signs and are disdainful of them—the gates of the heaven will not be opened for them, nor shall they enter paradise until the camel passes through the needle’s eye, and thus do We requite the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "To those who reject Our signs and treat them with arrogance, no opening will there be of the gates of heaven, nor will they enter the garden, until the camel can pass through the eye of the needle: Such is Our reward for those in sin.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Verily, those who belie Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.) and treat them with arrogance, for them the gates of heaven will not be opened, and they will not enter Paradise until the camel goes through the eye of the needle (which is impossible). Thus do We recompense the Mujrimun (criminals, polytheists, sinners, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The gates of heaven shall not be opened for those who have belied and grew proud against Our verses; nor shall they enter Paradise until a camel shall pass through the eye of a needle. As such We shall recompense the sinners.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who reject Our revelations and are too arrogant to uphold them—the doors of Heaven will not be opened for them, nor will they enter Paradise, until the camel passes through the eye of the needle. Thus We repay the guilty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Indeed, those who deny Our verses and are arrogant toward them - the gates of Heaven will not be opened for them, nor will they enter Paradise until a camel enters into the eye of a needle. And thus do We recompense the criminals.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:40] Those who deny Our signs and scorn them, not believing in them, indeed the gates of heaven shall not be opened for them, when their spirits are carried up to it after death, for instead they are taken down into Sijjīn [cf. Q. 83:7f.] — in contrast to the believer, for whom the gates are opened, and his spirit is carried up into the seventh heaven, as is stated in one hadīth — nor shall they enter Paradise until the camel passes through the eye of the needle, which is impossible, and so is their entry [into Paradise]. So, with this requital, We requite those who are sinful, through disbelief.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nاستئناف ابتدائي مسوق لتحقيق خلود الفريقين في النّار ، الواقععِ في قوله : { والذين كذبوا بآياتنا واستكبروا عنها أولئك أصحاب النار هم فيها خالدون } \\[ الأعراف : 36 \\] فأخبر الله بأنّه حرمهم أسباب النّجاة ، فَسَدّ عليهم أبواب الخير والصّلاح ، وبأنّه حرّمهم من دخول الجنّة .وأكّد الخبر ب { إنّ } لتأييسهم من دخول الجنّة ، لدفع توهّم أن يكون المراد من الخلود المتقدّم ذكرُه الكنايةَ عن طول مدّة البقاء في النّار فإنّه ورد في مواضع كثيرة مراداً به هذا المعنى .ووقع الإظهار في مقام الإضمار لدفع احتمال أن يكون الضّمير عائداً إلى إحدى الطّائفتين المتحاورتين في النّار ، واختير من طرق الإظهار طريق التّعريف بالموصول إيذاناً بما تومىء إليه الصّلة من وجه بناءِ الخبر ، أي : إنّ ذلك لأجل تكذيبهم بآيات الله واستكبارهم عنها ، كما تقدّم في نظيرها السّابق آنفاً .والسّماءُ أطلقت في القرآن على معاننٍ ، والأكثر أن يراد بها العوالم العليا غير الأرضيّة ، فالسّماء مجموع العوالم العليا وهي مَراتب وفيها عوالم القُدس الإلهيّةُ من الملائكة والرّوحانيات الصّالحة النّافعة ، ومصدرُ إفاضة الخيرات الرّوحيّة والجثمانيّة على العالم الأرضي ، ومصدَرُ المقادير المقدّرة قال تعالى : { وفي السماء رزقكم وما توعدون } \\[ الذاريات : 22 \\] ، فالسّماء هنا مراد بها عالم القدس .وأبوابُ السّماء أسبابُ أمور عظيمة أطلق عليها اسم الأبواب لتقريب حقائقها إلى الأذهان فمنها قبول الأعمال ، ومسالكُ وصول الأمور الخيّريّة الصّادرة من أهل الأرض ، وطرق قبولها ، وهو تمثيل لأسباب التّزكية ، قال تعالى : { والعمل الصالح يرفعه } \\[ فاطر : 10 \\] ، وما يعلم حقائقها بالتّفصيل إلاّ الله تعالى ، لأنّها محجوبة عنّا ، فكما أنّ العفاة والشّفعاء إذا وَرَدُوا المكان قد يُقبلون ويُرضى عنهم فتُفْتَح لهم أبواب القصور والقباب ويُدخلون مُكرّمين ، وقد يردّون ويُسخطون فتوصد في وجوههم الأبوابُ ، مُثِّل إقصاء المكذّبين المستكبرين وعدمُ الرّضا عنهم في سائر الأحوال ، بحال من لا تفتَح له أبواب المنازل ، وأضيفت الأبواب إلى السّماء ليظهر أنّ هذا تمثيل لحرمانهم من وسائل الخيرات الإلهيّة الروحية ، فيشمل ذلك عدم استجابة الدّعاء ، وعدم قبول الأعمال والعبادات ، وحرمان أرواحهم بعد الموت مشاهدة مناظر الجنّة ومقاعد المؤمنين منها ، فقوله : { لا نفتح لهم أبواب السماء } كلمة جامعة لمعنى الحرمان من الخيرات الإلهيّة المحضة ، وإن كانوا ينالون من نِعم الله الجثمانية ما يناله غيرهم ، فيغاثون بالمَطَر ، ويأتيهم الرّزق من الله ، وهذا بيان لحال خذلانهم في الدّنيا الحائل بينهم وبين وسائل دخول الجنّة . كما قال النّبي صلى الله عليه وسلم « كلّ ميسَّر لِمّا خُلِق له » وقال تعالى : { فأما من أعطى واتقى وصدق بالحسنى فسنيسره لليسرى وأما من بخل واستغنى وكذب بالحسنى فسنيسره للعسرى } \\[ الليل : 5 10 \\].وقرأ نافع ، وابن كثير ، وعاصم ، وابن عامر ، وأبو جعفر ، ويعقوبُ : { لا تُفَتَّح } بضمّ التّاء الأولى وفتح الفاء والتّاءِ الثّانية مشدّدة وهو مبالغة في فَتح ، فيفيد تحقيق نفي الفتح لهم ، أو أشير بتلك المبالغة إلى أن المنفي فتح مخصوص وهو الفتح الذي يفتح للمؤمنين ، وهو فتح قوي ، فتكون تلك الإشارة زيادة في نكايتهم .وقرأ أبو عَمرو بضمّ التّاء الأولى وسكون الفاء وفتح التّاء الثّانية مخفّفة . وقرأ حمزة ، والكسائي ، وخلَف { لا يُفتَحُ } بمثنّاة تحتيّة في أوّله مع تخفيف المثنّاة الفوقيه مفتوحة على اعتبار تذكير الفعل لأجل كون الفاعل جمعاً لمذكّر .وقوله : { ولا يدخلون الجنّة } اخبار عن حالهم في الآخرة وتحقيق لخلودهم في النّار .وبعد أن حُقّق ذلك بتأكيد الخبر كلّه بحرف التّوكيد ، زيد تأكيداً بطريق تأكيد الشّيء بما يشبه ضدّه ، المشتهرِ عند أهل البيان بتأكيد المدح بما يُشْبه الذّم ، وذلك بقوله تعالى : { حتى يلج الجمل في سم الخياط } فقد جعل لانتفاء دخولهم الجنّة امتداداً مستمراً ، إذْ جعل غايته شيئاً مستحيلاً ، وهو أن يَلج الجمل في سَمّ الخياط ، أي لو كانت لانتفاء دخولهم الجنّة غايةٌ لكانت غايتُه ولوجَ الجْمل وهو البعير في سَمّ الخِياط ، وهو أمر لا يكون أبداً .والجَمَل : البعير المعروف للعرب ، ضُرب به المثل لأنّه أشهر الأجسام في الضّخامة في عرف العرب . والخِياط هو المِخْيَط بكسر الميم وهو آلة الخياطة المسمّى بالإبْرَة ، والفِعال وَرَدَ اسماً مرادفاً للمِفعَل في الدّلالة على آلةِ الشّيء كقولهم حِزَام ومِحْزم ، وإزار ومِئْزر ، ولِحاف ومِلحَف ، وقِناع ومِقنع .والسَمّ : الخَرْت الذي في الإبرة يُدخل فيه خيط الخائط ، وهو ثقب ضيّق ، وهو بفتح السّين في الآية بلغة قريش وتضمّ السّين في لغة أهل العالية . وهي ما بين نجد وبين حدود أرض مكّة .والقرآن أحال على ما هو معروف عند النّاس من حقيقة الجَمل وحقيقة الخِياط ، ليعلم أنّ دخول الجمل في خَرْت الإبرة محال متعذّر ما داما على حاليهما المتعارفين .والإشارة في قوله : { وكذلك } إشارة إلى عدم تفتّح أبواب السّماء الذي تضمّنه قوله : { لا تفتح لهم أبواب السماء ولا يدخلون الجنة } أي ، ومثل ذلك الانتفاء ، أي الحرمان نجزي المجرمين لأنّهم بإجرامهم ، الذي هو التّكذيب والإعراض ، جعلوا أنفسهم غير مكترثين بوسائل الخير والنّجاة ، فلم يتوخّوها ولا تطلبوها ، فلذلك جزاهم الله عن استكبارهم أن أعرض عنهم ، وسدّ عليهم أبواب الخيرات .وجملة { وكذلك نجزي المجرمين } تذييل يؤذن بأنّ الإجرام هو الذي أوقعهم في ذلك الجزاء ، فهم قد دخلوا في عموم المجرمين الذين يجْزون بمثل ذلك الجزاء ، وهم المقصود الأوّل منهم ، لأنّ عقاب المجرمين قد شُبّه بعقاب هؤلاء ، فعلم أنّهم مجرمون ، وأنّهم في الرّعيل الأوّل من المجرمين ، حتّى شُبِّه عقاب عموم المجرمين بعقاب هؤلاء وكانوا مثَلا لذلك العموم .والإجرام : فعل الجُرْم بضمّ الجيم وهو الذنْب ، وأصل : أجرم صار ذا جُرم ، كما يقال : ألْبَنَ وأتمر وأخْصَب .\n\n",
      "translations": [
        {
          "translation": "(Lo! they who deny Our revelations) Muhammad (pbuh) and the Qur'an (and scorn them) scorn believing in them, (for them the gates of Heaven will not be opened) to receive their works or souls (nor will they enter the Garden until the camel goeth through the needle's eye) they will not enter Paradise just as a camel cannot pass through the eye of a needle; it is also said that this means: they will not enter Paradise until a rope goes through a needle's eye. (Thus do We requite the guilty) the idolaters.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { حَتَّىٰ يَلِجَ ٱلْجَمَلُ فِي سَمِّ ٱلْخِيَاطِ } والجَمَلُ: وَلَدُ النَّاقةِ والجُمَّلُ: حِبال القَلْسِ\n وَيلِجُ: يَدخُلُ\n والخِيَاطُ: الإِبرَةُ\n وسَمُّها: ثَقْبُهَا، والجمعُ سُمُومٌ\n وكلُّ ثَقبٍ مِن أُذنٍ أَو عَينٍ أو أنفٍ أو غَيرِ ذَلِكَ فَهو سَمٌّ\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying - the Most High: {Until the camel goes through the eye of the needle} and the camel: the offspring of the female camel and the camel: the cords of the reed mat.\n\n\nAnd he enters: he enters\n\n\nThe needle: the {ibra}\n\n\nAnd her name is: {Thaqbuhaha}, and the plural is {sumoomun}.\n\nAnd every {gap or opening} of an ear or an eye or a nose or anything else, it is {a sign or indication}.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه: { إِنَّ ٱلَّذِينَ كَذَّبُواْ بِآيَٰتِنَا } الدالة على توحيدنا { وَٱسْتَكْبَرُواْ عَنْهَا } ولم يؤمنوا لها عتواً وعناداً { لاَ تُفَتَّحُ لَهُمْ أَبْوَابُ ٱلسَّمَآءِ } أي: الفيوضات والفتوحات من سماء الأسماء والصفات حتى ينكشفوا بوحدة الذات { وَلاَ يَدْخُلُونَ ٱلْجَنَّةَ } أي: مقر التوحيد { حَتَّىٰ يَلِجَ ٱلْجَمَلُ فِي سَمِّ ٱلْخِيَاطِ } أي: دخولهم في مقر التوحيد في الاستحالة كولوج الجمل في سم الخياط بل أشد استحالة\n هذا مثل يُضرب في الممتنعات والمستحيلات { وَكَذٰلِكَ نَجْزِي ٱلْمُجْرِمِينَ } [الأعراف: 40] المخرجين عن ساحة عز التوحيد بجرائم أهوية هوايتهم الباطلة\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: { سَمّ الخياط }: عين الإبره\n وفي السين: الفتح والكسر والضم\n والخياط: ما يخاط به\n على وزن حِزام",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:27",
      "similarity": 0.37417307300771624
    },
    {
      "verse": "56:42",
      "similarity": 0.3592359658746738
    },
    {
      "verse": "52:27",
      "similarity": 0.3589085565098575
    },
    {
      "verse": "2:187",
      "similarity": 0.32980279362679177
    },
    {
      "verse": "22:61",
      "similarity": 0.18311215663857885
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007040.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007040.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:40.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}