{
  "chapter": "الأعراف",
  "text": "والذين ءامنوا۟ وعملوا۟ الصلحت لا نكلف نفسا الا وسعها او۟لئك اصحب الجنة هم فيها خلدون",
  "translations": [
    {
      "translation": "As for those who have iman and do right actions - We impose on no self any more than it can bear - they are the Companions of the Garden, remaining in it timelessly, for ever.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do good, We never burden a soul beyond capacity. They are men of Paradise where they will abide for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe and do good - We do not impose upon any of them a burden beyond his capacity. They are the people of Paradise. And there they shall abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The righteously striving believers - We do not impose on any soul that which is beyond its ability - are the dwellers of Paradise wherein they will live forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who accepted faith and performed good deeds according to their capacity – We do not burden any one, except within its capacity – are the people of Paradise; they shall abide in it forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believed, and worked righteousness -- We burden not any person beyond his scope -- such are the dwellers of Paradise. They will abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And (as for) those who believe and do good We do not impose on any soul a duty except to the extent of its ability-- they are the dwellers of the garden; in it they shall abide.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believe, and do deeds of righteousness -- We charge not any soul, save according to its capacity; those are the inhabitants of Paradise, therein dwelling forever;\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But (as for) those who believe and do good works - We tax not any soul beyond its scope - Such are rightful owners of the Garden. They abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believed and did good deeds, and We do not burden any soul with more than it can bear, such are the heirs of the Garden and there they will remain forever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And those who believed and worked righteous works-We burthen not a soul except according to its capacity, they shall be fellows of the Garden; therein they shell be abiders.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who have faith and do righteous deeds—We task no soul except according to its capacity—they shall be the inhabitants of paradise, and they shall remain in it [forever].\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believe and work righteousness,- no burden do We place on any soul, but that which it can bear,- they will be Companions of the Garden, therein to dwell (for ever).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believed (in the Oneness of Allah - Islamic Monotheism), and worked righteousness - We tax not any person beyond his scope, such are the dwellers of Paradise. They will abide therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do good works We never charge a soul with more than it can bear they are the companions of Paradise, and there they shall live for ever.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "As for those who believe and do righteous works—We never burden any soul beyond its capacity—these are the inhabitants of the Garden; abiding therein eternally.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "But those who believed and did righteous deeds - We charge no soul except [within] its capacity. Those are the companions of Paradise; they will abide therein eternally.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:42] And those who believe and perform righteous deeds (wa’lladhīna āmanū wa-‘amilū’l-sālihāti is the subject) We do not charge any soul beyond its scope, its capacity for action (lā nukallifu nafsan illā wus‘ahā, ‘We do not charge any soul beyond its scope’, constitutes a parenthetical statement, intervening between it [the above subject] and its predicate, which is [the following]) those are the inhabitants of Paradise, abiding therein.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(But (as for) those who believe) in Muhammad, Allah give him peace, and the Qur'an (and do good works) between them and their Lord (We tax not any soul) in its effort (beyond its scope) its capability. (Such) i.e. the believers (are rightful owners of the Garden) the folk of Paradise. (They abide therein) forever, never to die or be removed.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nثم قال سبحانه على مقتضى سنته من تعقيب الوعيد بالوعد: { وَٱلَّذِينَ آمَنُواْ } بتوحيد الله { وَعَمِلُواْ ٱلصَّالِحَاتِ } المقربة نحوه على مقتضى استعداداتهم وقابليتهم ومقدار وسعهم وطاقتهم\n إذ { لاَ نُكَلِّفُ نَفْساً إِلاَّ وُسْعَهَا أُوْلَـٰئِكَ } السعداء الباذلون جهدهم في سلوك طريق الفناء { أَصْحَابُ ٱلْجَنَّةِ } المعدة لأرباب الولاء\n المتمكنون في مقام الرضا بما جرى عليهم ن القضاء { هُمْ فِيهَا خَالِدُونَ } [الأعراف: 42] ما شاء الله\n إذ لا حول ولا قوة فيها إلا بالله\n\n\n{ وَ } بعدما دخلوا جنة التوحيد { نَزَعْنَا مَا فِي صُدُورِهِم مِّنْ غِلٍّ } مشعر بالاثنينية والأنانية\n إذ { تَجْرِي مِن تَحْتِهِمُ ٱلأَنْهَٰرُ } أي: جداول المعارف والحقائق المتشرحة من بحر الوحدة { وَ } بعدما كوشفوا بفناء تعيناتهم وفازوا بالبقاء السرمي الإلهي { قَالُواْ } بلسان استعداداتهم بإلقاء الله إياهم ليتحققوا بمقام الشكر: { ٱلْحَمْدُ } والثناء المنبعث من محض التسليم والرضا { للَّهِ ٱلَّذِي هَدَانَا لِهَـٰذَا } أي: أوصلنا بمقام الرضا وشرف البقاء واللقاء { وَمَا كُنَّا لِنَهْتَدِيَ } بأنفسنا لو بقينا في مجلس هوياتنا ومضيق تعيناتنا { لَوْلاۤ أَنْ هَدَانَا ٱللَّهُ } بلطفه وسعة جوده ورحمته",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\nقلت: جملة { لا نُكلف }: معترضة بين المبتدأ والخبر للترغيب في اكتساب النعيم المقيم\n بما تسعه طاقتهم\n ويسهل عليهم\n و { ما كنا لنهتدي }: اللام لتأكيد النفي\n وجواب \" لولا \": محذوف\n أي: لولا هدايته إيانا ما اهتدينا\n يقول الحقّ جلّ جلاله: { والذين آمنوا } بالرسل\n { وعملوا } الأعمال { الصالحات } على قدر طاقتهم\n { لا نكلِّف نفسًا إلا وُسعَها } أي: ما تسعه طاقتها\n فمن فعل ذلك فـ { أولئك أصحاب الجنة هم فيها خالدون ونزعنا ما في صدورهم من غِلٍّ } أي: نُخرج مِن قلوبهم كل غل وعدواة\n ونطهرها منه\n حتى لا يكون بينهم إلا التودد\n فيصيرون أحبابًا وإخوانًا\n وإما عبّر بالماضي لتحقق وقوعه\n كأنه وقع ومضى\n وكذلك ما يجيء بعدها\n ثم وصف الجنة فقال: { تجري من تحتهم } أي: من تحت قصورهم",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "38:86",
      "similarity": 0.7095625882641503
    },
    {
      "verse": "23:62",
      "similarity": 0.6350631947203147
    },
    {
      "verse": "65:7",
      "similarity": 0.6157849516413703
    },
    {
      "verse": "6:152",
      "similarity": 0.41312773449830187
    },
    {
      "verse": "2:82",
      "similarity": 0.33365653797798805
    }
  ]
}