{
  "chapter": "الأعراف",
  "text": "ونزعنا ما فى صدورهم من غل تجرى من تحتهم الانهر وقالوا۟ الحمد لله الذى هدىنا لهذا وما كنا لنهتدى لولا ان هدىنا الله لقد جاءت رسل ربنا بالحق ونودوا۟ ان تلكم الجنة اورثتموها بما كنتم تعملون",
  "translations": [
    {
      "translation": "We will strip away any rancour in their hearts. Rivers will flow under them and they will say, 'Praise be to Allah who has guided us to this! We would not have been guided, had Allah not guided us. The Messengers of our Lord came with the Truth.' It will be proclaimed to them: 'This is your Garden which you have inherited for what you did.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Whatever the rancour they may have in their hearts We shall (cleanse and) remove. Streams of running water shall ripple at their feet, and they will say: \"We are grateful to God for guiding us here. Never would we have been guided if God had not shown us the way. The apostles of our Lord had indeed brought the truth.\" And the cry shall resound: \"This is Paradise you have inherited as meed for your deeds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall strip away all rancour from their hearts, and rivers shall flow beneath them, and they shall say: 'All praise be to Allah Who has guided us on to this. Had it not been for Allah Who granted us guidance, we would not be on the Right Path. Surely the Messengers of our Lord did indeed come down with truth.' Then a voice will cry out to them: 'This is the Paradise which you are made to inherit as a reward for your deeds.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall remove all grudges from their hearts. They will enjoy the flowing streams in the garden and will say, \"God who guided us to this, deserves all praise. Had He not guided us, we would never have been able to find the right direction. The (angelic) Messengers of our Lord came to us with the Truth.\" They shall be told, 'This is the Paradise which you have inherited because of your good deeds.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We have removed resentment from their hearts – rivers will flow beneath them; and (while entering Paradise) they will say, “All praise is to Allah, Who guided us to this; we would not have attained the right path if Allah had not guided us; indeed the Noble Messengers of our Lord brought the truth”; and it is proclaimed, “You have received this Paradise as an inheritance for what you used to do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall remove from their breasts any Ghill; rivers flowing under them, and they will say: \"All the praises and thanks be to Allah, Who has guided us to this, and never could we have found guidance, were it not that Allah had guided us! Indeed, the Messengers of our Lord did come with the truth.\" And it will be cried out to them: \"This is the Paradise which you have inherited for what you used to do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will remove whatever of ill-feeling is in their breasts; the rivers shall flow beneath them and they shall say: All praise is due to Allah Who guided us to this, and we would not have found the way had it not been that Allah had guided us; certainly the apostles of our Lord brought the truth; and it shall be cried out to them that this is the garden of which you are made heirs for what you did.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall strip away all rancour that is in their breasts; and underneath them rivers flowing; and they will say, 'Praise belongs to God, who guided us unto this; had God not guided us, we had surely never been guided. Indeed, our Lord's Messengers came with the truth.' And it will be proclaimed: 'This is your Paradise; you have been given it as your inheritance for what you did.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We remove whatever rancour may be in their hearts. Rivers flow beneath them. And they say: The praise to Allah, Who hath guided us to this. We could not truly have been led aright if Allah had not guided us. Verily the messengers of our Lord did bring the Truth. And it is cried unto them: This is the Garden. Ye inherit it for what ye used to do.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall remove whatever rancour may be in their hearts. At their feet shall flow rivers. And they shall say, \"All praise belongs to God who has guided us to this. Had God not guided us, we would never have found the way. The messengers of our Lord brought the Truth.\" A voice will call out to them, \"This is the Garden which you have inherited by your labours.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall extract whatsoever of rancour there may be in their breasts, rivers flowing beneath them, and they will say all praise unto Allah who hath guided us onto this; we were not such as to find guidance were it not that Allah had guided us; assuredly the aspotles of our Lord came with truth. And they shall be cried unto: this is the Garden, it ye inherit for that which ye have been working.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will remove whatever rancour there is in their breasts, and streams will run for them. They will say, ‘All praise belongs to Allah, who guided us to this. We would have never been guided had not Allah guided us. Our Lord’s apostles had certainly brought the truth.’ And the call would be made to them: ‘This is paradise, which you have been given to inherit because of what you used to do!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall remove from their hearts any lurking sense of injury;- beneath them will be rivers flowing;- and they shall say: \"Praise be to Allah, who hath guided us to this (felicity): never could we have found guidance, had it not been for the guidance of Allah: indeed it was the truth, that the messengers of our Lord brought unto us.\" And they shall hear the cry: \"Behold! the garden before you! Ye have been made its inheritors, for your deeds (of righteousness).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We shall remove from their breasts any (mutual) hatred or sense of injury (which they had, if at all, in the life of this world); rivers flowing under them, and they will say: \"All the praises and thanks be to Allah, Who has guided us to this, never could we have found guidance, were it not that Allah had guided us! Indeed, the Messengers of our Lord did come with the truth.\" And it will be cried out to them: \"This is the Paradise which you have inherited for what you used to do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We shall strip away all rancor from their chests. Rivers shall flow underneath them, and they shall say: 'Praise be to Allah who has guided us to this. Had Allah not given us guidance we should not have been guided. The Messengers of our Lord surely came with the truth' Then they are called: 'This is the Paradise which you have inherited for what you did'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "We will remove whatever rancor is in their hearts. Rivers will flow beneath them. And they will say, “Praise be to God, who has guided us to this. Had God not guided us, we would never be guided. The messengers of our Lord did come with the truth.” And it will be proclaimed to them, “This is the Garden you are made to inherit, on account of what you used to do.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And We will have removed whatever is within their breasts of resentment, [while] flowing beneath them are rivers. And they will say, \"Praise to Allah, who has guided us to this; and we would never have been guided if Allah had not guided us. Certainly the messengers of our Lord had come with the truth.\" And they will be called, \"This is Paradise, which you have been made to inherit for what you used to do.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:43] We shall strip away all rancour, [all] spite that existed between them in the world, that is in their breasts; and beneath them, beneath their palaces, flow rivers; and they will say, once they have settled in their dwellings: ‘Praise be to God, Who guided us to this, action, the reward of which is this [Paradise]; for we would surely never have been guided if God had not guided us (the response to the [conditional] law lā, ‘if … not’ is omitted, because it is indicated by the preceding [clause]). Verily the messengers of our Lord did bring the truth.’ And it is cried to them: (an is read softened, that is, [understand it as] annahu; alternatively, it is an explicative particle in all five places [here and the four to follow]) ‘This is your Paradise; you have inherited it for what you used to do’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nانتساق النّظم يقتضي أن تكون جملة : { تجري من تحتهم الأنهار } حالاً من الضّمير في قوله : { هم فيها خالدون } \\[ الأعراف : 42 \\] ، وتكونَ جملة : { ونزعنا } مُعترضة بين جملة : { أولئك أصحاب الجنة هم فيها خالدون } \\[ الأعراف : 42 \\] ، وجملة : { وقالوا الحمد لله } إلخ ، اعترضاً بُيِّنَ به حال نفوسهم في المعاملة في الجنّة ، ليقابِل الاعتراض الذي أُدمِج في أثناءِ وصف عذاب أهل النّار ، والمبيّن به حال نفوسهم في المعاملة بقوله : { كلما دخلت أمة لعنت أختها } \\[ الأعراف : 38 \\].والتّعبير عن المستقبل بلفظ الماضي للتّنبيه على تحقّق وقوعه ، أي : وننزع ما في صدورهم من غِل ، وهو تعبير معروف في القرآن كقوله تعالى : { أتى أمر الله } \\[ النحل : 1 \\].والنّزْع حقيقته قلع الشّيء من موضعه وقد تقدّم عند قوله تعالى : { وتنزع الملك ممن تشاء } في آل عمران ( 26 ) ، ونَزْع الغِل من قلوب أهل الجنّة : هو إزالة ما كان في قلوبهم في الدّنيا من الغِلّ عند تلقي ما يسوء من الغَيْر ، بحيث طَهّر الله نفوسهم في حياتها الثّانية عن الانفعال بالخواطر الشرّية التي منها الغِلّ ، فزال ما كان في قلوبهم من غِلّ بعضهم من بعض في الدّنيا ، أي أزال ما كان حاصلاً من غلّ وأزال طباع الغلّ التي في النّفوس البشريّة بحيث لا يخطر في نفوسهم .والغِلّ : الحقد والإحْنَة والضِغْن ، التي تحصل في النّفس عند إدراك ما يسوؤها من عمل غيرها ، وليس الحسد من الغِلّ بل هو إحساس باطني آخر .وجملة : تجري من تحتهم الأنهار } في موضع الحال ، أي هم في أمكنة عالية تشرف على أنهار الجنّة .وجملة : { وقالوا الحمد لله } معطوفة على جملة : { أولئك أصحاب الجنة هم فيها خالدون } \\[ الأعراف : 42 \\].والتّعبير بالماضي مراد به المستقبل أيضاً كما في قوله : { ونزعنا } وهذا القول يحتمل أن يكونوا يقولونه في خاصتهم ونفوسهم ، على معنى التّقرب إلى الله بحمده ، ويحتمل أن يكونوا يقولونه بينهم في مجامعهم .والإشارة في قولهم : { لهذا } إلى جميع ما هو حاضر من النّعيم في وقت ذلك الحمد ، والهداية له هي الإرشاد إلى أسبابه ، وهي الإيمان والعمل الصّالح ، كما دلّ عليه قوله : { والذين آمنوا وعملوا الصالحات } \\[ الأعراف : 42 \\] ، وقال تعالى : { يهديهم ربهم بإيمانهم } \\[ يونس : 9 \\] الآية ، وجعل الهداية لنفس النّعيم لأنّ الدّلالة على ما يوصل إلى الشّيء إنّما هي هداية لأجل ذلك الشّيء ، وتقدّم الكلام على فعل الهداية وتعديته في سورة الفاتحة ( 6 ).والمراد بهَدْي الله تعالى إياهم إرساله محمّداً صلى الله عليه وسلم إليهم فأيقظهم من غفلتهم فاتَّبعوه ، ولم يعاندوا ، ولم يستكبروا ، ودلّ عليه قولهم : { لقد جاءت رسل ربنا بالحق } مع ما يسّر الله لهم من قبولهم الدّعوة وامتثالهم الأمر ، فإنّه من تمام المنّة المحمود عليها ، وهذا التّيسير هو الذي حُرّمه المكذّبون المستكبرون لأجل ابتدائهم بالتّكذيب والاستكبار ، دون النّر والاعتبار .وجملة { وما كنا لنهتدي } في موضع الحال من الضّمير المنصوب ، أي هدانا في هذه الحال حال بعدنا عن الاهتداء ، وذلك ممّا يؤذن بكبر منّة الله تعالى عليهم ، وبتعظيم حمدهم وتجزيله ، ولذلك جاءوا بجملة الحمد مشتملة على أقصى ما تشتمل عليه من الخصائص التي تقدّم بيانها في سورة الفاتحة ( 6 ).ودلّ قوله : { وما كنا لنهتدي } على بعد حالهم السّالفة عن الاهتداء ، كما أفاده نفي الكَون مع لام الجحود ، حسبما تقدّم عند قوله تعالى : { ما كان لبشر أن يؤتيه الله الكتاب والحكم والنبوءة } الآية في سورة آل عمران ( 79 ) ، فإنّهم كانوا منغمسين في ضلالات قديمة قد رسخت في أنفسهم ، فأمّا قادتهم فقد زيّنها الشّيطان لهم حتى اعتقدوها وسنّوها لمن بعدهم ، وأمّا دَهْمَاؤُهم وأخلافهم فقد رأوا قدوتهم على تلك الضّلالات . وتأصّلت فيهم ، فما كان من السّهل اهتداؤُهم ، لولا أنْ هداهم الله ببعثة الرّسل وسياستهم في دعوتهم ، وأن قذف في قلوبهم قبول الدّعوة .ولذلك عقبوا تحميدهم وثناءهم على الله بقولهم : لقد جاءت رسل ربنا بالحقّ } فتلك جملة مستأنفة ، استئنافاً ابتدائياً ، لصدورها عن ابتهاج نفوسهم واغتباطهم بما جاءتهم به الرّسل ، فجعلوا يتذكّرون أسباب هدايتهم ويعتبرون بذلك ويغتبطون . تلذذاً بالتّكلّم به ، لأن تذكّر الأمر المحبوب والحديثَ عنه ممّا تلذّ به النّفوس ، مع قصد الثّناء على الرّسل .وتأكيد الفعل بلام القسم وبقَدْ ، مع أنهم غير منكرين لمجيء الرسل : إما لأنّه كناية عن الإعجاب بمطابقة ما وعدهم به الرّسل من النّعيم لما وجدوه مثل قوله تعالى : { وفيها ما تشتهيه الأنفس وتلذ الأعين } \\[ الزخرف : 71 \\] وقول النّبي صلى الله عليه وسلم قال الله تعالى : « أعددت » . وإمّا لأنّهم أرادوا بقولهم هذا الثّناء على الرّسل والشّهادة بصدقهم جمعاً مع الثّناء على الله ، فأتَوا بالخبر في صورة الشّهادة المؤكّدة التي لا تردّد فيها .وقرأ ابن عامر : { ما كنّا لنهتدي } بدون واو قبل ( ما ) وكذلك كتبت في المصحف الإمام الموجّه إلى الشّام ، وعلى هذه القراءة تكون هذه الجملة مفصولة عن التي قبلها ، على اعتبار كونها كالتّعليل للحمد ، والتّنويه بأنّه حمد عظيم على نعمة عظيمة ، كما تقدّم بيانه .وجملة : { ونودوا } معطوفة على جملة : { وقالوا } فتكون حالاً أيضاً ، لأنّ هذا النّداء جواب لثنائهم ، يدلّ على قبول ما أثْنَوا به ، وعلى رضى الله عنهم ، والنّداء من قبل الله ، ولذلك بُني فعله إلى المجهول لظهور المقصود . والنّداء إعلان الخطاب ، وهو أصل حقيقته في اللّغة ، ويطلق النّداء غالباً على دعاء أحد ليقبل بذاته أو بفهمه لسماع كلام ، ولو لم يكن برفع صوت : { إذ نادى ربَّه نداء خفياً } \\[ مريم : 3 \\] ولهذا المعنى حروف خاصة تدلّ عليه في العربيّه ، وتقدّم عند قوله تعالى : { وناداهما ربهما } في هذه السّورة ( 22 ).و ( أنْ ) تفسير { لنودوا } ، لأنّ النّداء فيه معنى القول . والإشارة إلى الجنّة ب { تلكم } ، الذي حقّه أن يستعمل في المشار إليه البعيد ، مع أنّ الجنّة حاضرة بين يديهم ، لقصد رفعة شأنها وتعظيم المنّة بها .والإرث حقيقته مصير مال الميت إلى أقرب النّاس إليه ، ويقال : أورثَ الميّت أقرباءه ماله ، بمعنى جعلهم يرثونه عنه ، لأنّه لما لم يصرفه عنهم بالوصيّة لغيره فقد تركه لهم ، ويطلق مجازاً على مصير شيء إلى حد بدون عوض ولا غصب تشبيهاً بإرث الميّت ، فمعنى قوله : { أورثتموها } أعطيتموها عطيّة هنيئة لا تعب فيها ولا منازعة .والباء في قوله : { بما كنتم تعملون } سببيّة أي بسبب أعمالكم ، وهي الإيمان والعمل الصّالح ، وهذا الكلام ثناء عليهم بأنّ الله شكر لهم أعمالهم ، فأعطاهم هذا النّعيم الخالد لأجل أعمالهم ، وأنّهم لما عملوا ما عملوه من العمل ما كانوا ينوون بعملهم إلا السّلامة من غضب ربّهم وتطلبَ مرضاته شكراً له على نعمائه ، وما كانوا يمُتون بأن توصلهم أعمالهم إلى ما نالوه ، وذلك لا ينافي الطّمع في ثوابه والنّجاة من عقابه ، وقد دلّ على ذلك الجمعُ بين { أورثتموها } وبين باء السّببيّة .فالإيراث دلّ على أنّها عطيّة بدون قصد تعاوُضضٍ ولا تعاقُد ، وأنّها فضلٌ محض من الله تعالى ، لأنّ إيمان العبد بربّه وطاعته إياه لا يوجب عقلاً ولا عدْلاً إلاّ نجاتَه من العقاب الذي من شأنه أن يترتّب على الكفران والعصيان ، وإلاّ حُصولَ رضى ربّه عنه ، ولا يوجب جزاء ولا عطاء ، لأنّ شكر المنعم واجب ، فهذا الجزاء وعظمته مجرّد فضل من الرّب على عبده شكراً لإيمانه به وطاعته ، ولكن لما كان سبب هذا الشّكر عند الرّب الشّاكر هو عمل عبده بما أمره به ، وقد تفضّل الله به فوعد به من قبللِ حصوله . فمن العجب قول المعتزلة بوجوب الثّواب عقلاً ، ولعلّهم أوقعهم فيه اشتباه حصول الثّواب بالسّلامة من العقاب ، مع أنّ الواسطة بين الحالين بيّنة لأولي الألباب . وهذا أحسن ممّا يطيل به أصحابنا معهم في الجواب .وباء السّببيّة اقتضت الذي أعطاهم منازل الجنّة أراد به شكر أعمالهم وثوابها من غير قصد تعاوض ولا تقابل فجعلها كالشيء الذي استحقّه العامل عوضاً عن عمله فاستعار لها باء السّببيّة .\n\n",
      "translations": [
        {
          "translation": "(And We remove whatever rancour) resentful envy or enmity (may be in their hearts) in the life of this 161 world. (Rivers) of wine, water, honey and milk (flow beneath them) beneath their habitations and beds in the Hereafter. (And they say) when they reach their habitations; and it is said: when they reach the source of life: (The praise to Allah) gratitude and benevolence are Allah's, (Who hath guided us to this) to this habitation and source. (We could not truly have been led aright if Allah had not guided us) to it; it is also said that when they see Allah's favour when He bestowed faith upon them, they said: praise and thanks are due to Allah Who has guided us to the religion of Islam, and we would not have been guided to the religion of Islam had not Allah guided us to it. (Verily the messengers of our Lord did bring the Truth) they brought truth, glad tiding, reward and favour. (And it is cried unto them: This is the Garden. Ye inherit it) you were given it (for what ye used to do) and say of good things in the life of this world.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n وحين تمكنوا في مقام الكشف والشهود أقسموا بالله { لَقَدْ جَآءَتْ رُسُلُ رَبِّنَا } لإرشادنا ملتبساً { بِٱلْحَقِّ } المطابق للواقع في جميع ما جاءوا به { وَ } بعدما تحققوا بمقام الشكر واعترفوا بما اعترفوا { نُودُوۤاْ } من وراء سرادقات العز ولاجلاء: { أَن تِلْكُمُ ٱلْجَنَّةُ } أي: التوحيد الذاتي { أُورِثْتُمُوهَا } أعطيتم بها ومكنتم فيها { بِمَا كُنتُمْ تَعْمَلُونَ } [الأعراف: 43] بمقتضى أوامر الله ونواهيه وإرشاد رسله وتذكير كتبه",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { الأنهارُ } من عسل وخمر وماء ولبن زيادة في لذتهم وسرورهم\n فالقصور مرتفعة في الهواء\n والأنهار تجري تحتها\n { وقالوا } حينئذٍ: { الحمد لله الذي هدانا لهذا } أي: لما جزاؤه هذا النعيم من الإيمان في الدنيا والعمل الصالح\n { وما كنا لنهتدي } بأنفسنا { لولا أن هدانا الله } بتوفيقه وإرادته\n { لقد جاءت رُسلُ ربنا بالحق } فاهتدينا بإرشادهم\n يقولون ذلك اغتباطًا وتبجحًا بأن ما عملوه في الدنيا يقينًا\n صار لهم عين اليقين في الآخرة\n { ونُودوا } أي: نادتهم الملائكة\n أو الحق تعالى: { أن تلكُم الجنةُ } أي: هذه الجنة { أُورِثتُموها } أي: أُعطِيتموها { بما كنتم تعملون } أي: بسبب أعمالكم\n وهذا باعتبار الشريعة\n وأما باعتبار الحقيقة فكل شيء منه وإليه\n ولذلك قال صلى الله عليه وسلم:\n \" لَن يُدخِلَ الجنَّةَ أحدَكم عَمُلهُ\n قالوا: ولا أنت\n قال: ولا أنا\n إلاَّ أن يَتَغَمَّدَنِيَ الله برحمَتِه \" \nفالشريعة تنسب العمل للعبد\n والحقيقة تعزله عنه\n وقد آذنت بها الآية قبله بقوله: { وما كنا لنهتدي لولا أن هدانا الله } \n فقد نطقوا بما تحققوا به يوم القيامة\n وقال القشيري: إنما قال: { أورثتموها بما كنتم تعملون } تسكينًا لقلوبهم\n وتطييبًا لهم\n وَإلاَّ\n فإذا رأوا تلك الدرجات\n علموا أن أعمالهم المشوبة لم تبلغ تلك الدرجات\n هـ\n وعن ابن مسعود أنه قال: يجوزون الصراط بعفو الله\n ويدخلون الجنة برحمة الله\n ويقتسمون المنازل بأعمالهم\n هـ\n الإشارة: والذين آمنوا بطريق الخصوص\n وعملوا الأعمال التي تناسبها\n من خرق العوائد واكتساب الفوائد\n والتخلية من الرذائل والتحلية بأنواع الفضائل على حسب الطاقة أولئك أصحاب جنة المعارف\n هم فيها خالدون في الدنيا والآخرة\n قد نزع الله من قلوبهم المساوىء والأكدار\n وطَهَّرها من جملة الأغيار\n حتى صاروا إخوانًا متحابين لا لَغوَ بينهم ولا تأثيم\n تجري من تحت أفكارهم أنهار العلوم\n وتفتح لهم مخازن الفهوم\n فإذا تمكنوا من هذه الحضرة قالوا الحمد لله الذي هدانا لهذا وما كنا لنهتدي لولا أن هدانا الله\n تحققوا أنهم محمولون بسابق العناية\n محفوفون بعين الرعاية\n فتحققوا بما جاءت به الرسل من عند الله\n وما نالوه على يد أولياء الله من الذوق والوجدان\n وكشف الغطاء عن عين العيان\n منحنا الله من ذلك حظًا وافرًا\n بمنِّه وكرمه\n ثم ذكر تبجح أهل الجنة على أهل النار\n فقال: { وَنَادَىۤ أَصْحَابُ ٱلْجَنَّةِ أَصْحَابَ ٱلنَّارِ }",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "15:47",
      "similarity": 0.6058657004102926
    },
    {
      "verse": "69:30",
      "similarity": 0.3932165041075383
    },
    {
      "verse": "3:161",
      "similarity": 0.3612038170107103
    },
    {
      "verse": "59:10",
      "similarity": 0.318915062802619
    },
    {
      "verse": "10:9",
      "similarity": 0.3182510359664887
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007043.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007043.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:43.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}