{
  "chapter": "الأعراف",
  "text": "وبينهما حجاب وعلى الاعراف رجال يعرفون كلۢا بسيمىهم ونادوا۟ اصحب الجنة ان سلم عليكم لم يدخلوها وهم يطمعون",
  "translations": [
    {
      "translation": "There will be a dividing wall between them and on the ramparts there will be men who recognise everyone by their mark. They will call out to the people of the Garden: 'Peace be upon you!' They will not enter it for all their ardent desire to do so.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will be a veil between them, and on the wall will be the men (of al-A'raf) who will recognise everyone by their distinguishing marks, and will call to the inmates of Paradise: \"Peace on you,\" without having entered it themselves though hoping to do so.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And between the two there will be a barrier, and on the Heights will be men who will recognize each person by his mark and will cry, out to the people of Paradise: 'Peace be to you.'These will be the ones who had not yet joined them in Paradise, though they long to do so.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will be a barrier between the people of Paradise and hell. There will be people on the heights who know everyone by their faces and who will say to the people of Paradise, \"Peace be upon you.\" They hope to enter Paradise but are not yet therein.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Between Paradise and Hell is a veil; and on the Heights will be some men who will recognise them all by their foreheads; and they call to the people of Paradise, “Peace be upon you”; they have not entered Paradise and they yearn for it.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And between them will be a (barrier) screen and on Al-A`raf will be men, who would recognize all, by their marks. And they will call out to the dwellers of Paradise, \"Peace be on you\" and at that time they will not yet have entered it (Paradise), but they will hope to enter (it).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And between the two there shall be a veil, and on the most elevated places there shall be men who know all by their marks, and they shall call out to the dwellers of the garden: Peace be on you; they shall not have yet entered it, though they hope.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And between them is a veil, and on the Ramparts are men knowing each by their mark, who shall call to the inhabitants of Paradise: 'Peace be upon you! They have not entered it, for all their eagerness.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Between them is a veil. And on the Heights are men who know them all by their marks. And they call unto the dwellers of the Garden: Peace be unto you! They enter it not although they hope (to enter).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "A barrier will divide the two groups, and on the heights there will be men who recognize each group by their marks. They will call out to the people of the Garden, \"Peace be with you.\" They will not have yet entered, but they will be hoping [to do so],\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And betwixt the twain there will be a veil, and, on the heights will be men recognising them all by their mark, and they will cry unto the fellows of the Garden; peace be unto you! They will not have entered it yet, while they shall be longing.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "There will be a veil between them. And on the Elevations will be certain men who recognize each of them by their mark. They will call out to the inhabitants of paradise, ‘Peace be to you!’ (They will not have entered it, though they would be eager to do so.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Between them shall be a veil, and on the heights will be men who would know every one by his marks: they will call out to the Companions of the Garden, \"peace on you\": they will not have entered, but they will have an assurance (thereof).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And between them will be a barrier screen and on Al-A'raf (a wall with elevated places) will be men (whose good and evil deeds would be equal in scale), who would recognise all (of the Paradise and Hell people), by their marks (the dwellers of Paradise by their white faces and the dwellers of Hell by their black faces), they will call out to the dwellers of Paradise, \"Salamun 'Alaikum\" (peace be on you), and at that time they (men on Al-A'raf) will not yet have entered it (Paradise), but they will hope to enter (it) with certainty.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And between them is a veil, and on the ramparts there shall stand men who will know each by their marks. To the companions of Paradise they shall call: 'Peace be upon you' Yet they did not enter it on account of their eagerness.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And between them is a partition, and on the Elevations are men who recognize everyone by their features. They will call to the inhabitants of the Garden, “Peace be upon you.” They have not entered it, but they are hoping.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And between them will be a partition, and on [its] elevations are men who recognize all by their mark. And they call out to the companions of Paradise, \"Peace be upon you.\" They have not [yet] entered it, but they long intensely.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:46]   And between them, that is, [between] the inhabitants of Paradise and those of the Fire, is a veil, a barrier, said to be the wall of the Heights, and on the Heights, which is, the wall of Paradise, are men, whose good deeds and evil deeds are equal, as [is stated] in the hadīth, who know each, of the inhabitants of Paradise and those of the Fire, by their mark — glowing faces in the case of the believers and blackened [ones] in the case of the disbelievers, for they are able to see them, their position being high — and they call to the inhabitants of Paradise: ‘Peace be upon you!’ God, exalted be He, says: They, that is, those men of the Heights, have not entered it, Paradise, although they aspire, to enter it. Al-Hasan [al-Basrī] said, ‘God causes them to have this aspiration only because He desires to be generous to them’. Al-Hākim reported that Hudhayfa [b. al-Yamān] said, ‘While they are in this situation, God appears to them and says “Get up and enter Paradise, for I have forgiven you”.’\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "\nتقديم { وبينهما } وهو خبر على المبتدأ للاهتمام بالمكان المتوسّط بين الجنّة والنّار وما ذكر من شأنه . وبهذا التّقديم صحّ تصحيح الابتداء بالنّكرة ، والتّنكير للتّعظيم .وضمير { بينهما } يعود إلى لفظي الجنّة والنّار الواقعين في قوله { ونادى أصحاب الجنة أصحاب النار } \\[ الأعراف : 44 \\] وهما اسما مكان ، فيصلح اعتبار التّوسّط بينهما . وجُعل الحجاب فصلاً بينهما . وتثنية الضّمير تُعيِّن هذا المعنى ، ولو أريد من الضّمير فريقَا أهللِ الجنّة وأهل النّار ، لقال : بينهم ، كما قال في سورة الحديد ( 13 ) { فضرب بينهم بسور } الآية .والحجاب : سور ضُرب فاصلاً بين مكان الجنّة ومكان جهنّم ، وقد سمّاه القرآن سوراً في قوله : { فضرب بينهم بسور له باب } في سورة الحديد ( 13 ) ، وسمّي السور حجاباً لأنّه يقصد منه الحجب والمنع كما سمّي سوراً باعتبار الإحاطة .والأعراف : جمع عُرْف بِضّم العين وسكون الرّاء ، وقد تضمّ الرّاء أيضاً وهو أعلى الشّيء ومنه سمّي عُرف الفرس ، الشّعر الذي في أعلى رقبته ، وسمّي عُرف الدّيك . الرّيش الذي في أعلى رأسه .و ( أل ) في الأعراف } للعهد . وهي الأعراف المعهودة التي تكون بارزة في أعالي السّور . ليرقب منها النظَّارة حركات العد وليشعروا به إذا داهمهم . ولم يسبق ذكر للأعراف هنا حتّى تعرّف بلام العهد ، فتعيّن أنّها ما يعهده النّاس في الأسوار . أو يجعل ( ألْ ) عوضاً عن المضاف إليه : أي وعلى أعراف السّور . وهما وجهان في نظائر هذا التّعريف كقوله تعالى : { فإن الجنة هي المأوى } \\[ النازعات : 41 \\] وأيّاً مّا كان فنظم الآية يأبى أن يكون المراد من الأعراف مكاناً مخصوصاً يتعرّف منه أهل الجنّة وأهل النّار ، إذ لا وجه حينئذٍ لتعريفه مع عدم سبق الحديث عنه .وتقديم الجار والمجرور لتصحيح الابتداء بالنّكرة ، إذ اقتضى المقام الحديث عن رجال مجهولين يكونون على أعراف هذا الحجاب ، قبل أن يدخلوا الجنّة ، فيشهدون هنالك أحوال أهل الجنّة وأحوال أهل النّار ، ويعرِفون رجالاً من أهل النّار كانوا من أهل العزّة والكبرياء في الدّنيا ، وكانوا يكذّبون وعد الله المؤمنين بالجنّة ، وليس تخصيص الرّجال بالذّكر بمقتض أن ليس في أهل الأعراف نساء ، ولا اختصاص هؤلاء الرّجال المتحدّث عنهم بذلك المكان دون سواهم من الرّجال ، ولكن هؤلاء رجال يقع لهم هذا الخبر ، فذكروا هنا للاعتبار على وجه المصادفة ، لا لقصد تقسيم أهل الآخرة وأمكنتهم ، ولعلّ توهّم أنّ تخصيص الرّجال بالذّكر لقصد التّقسيم قد أوقع بعض المفسّرين في حيرة لتطلّب المعنى لأنّ ذلك يقتضي أن يكون أهل الأعراف قد استحقّوا ذلك المكان لأجل حالة لاحظّ للنّساء فيها ، فبعضهم حمل الرّجال على الحقيقة فتطلب عملاً يعمله الرّجال لاحظ للنّساء فيه في الإسلام ، وليس إلاّ الجهاد ، فقال بعض المفسرين : هؤلاء قوم جاهدوا وكانوا عاصين لآبائهم ، وبعض المفسّرين حمل الرّجال على المجاز بمعنى الأشخاص من الملائكة ، أطلق عليهم الرّجال لأنّهم ليسوا إناثاً كما أطلق على أشخاص الجنّ في قوله تعالى :{ وأنه كان رجال من الإنس يعوذون برجال من الجن } \\[ الجن : 6 \\] فيظهر وجه لتخصيص الرّجال بالذّكر تبعاً لما في بعض تلك الأحاديث التي أشرنا إليها .وأمّا ما نقل عن بعض السّلف أنّ أهل الأعراف هم قوم اسْتوت موازين حسناتهم مع موازين سيّئاتهم ، ويكون إطلاق الرّجال عليهم تغليباً ، لأنّه لا بدّ أن يكون فيهم نساء ، ويروى فيه أخبار مسندة إلى النّبيء صلى الله عليه وسلم لم تبلغ مبلغ الصّحيح ولم تنزل إلى رتبة الضّعيف : روى بعضَها ابنُ ماجة ، وبعضَها ابنُ مردويه ، وبعضَها الطّبري ، فإذا صحت فإنّ المراد منها أن من كانت تلك حالتهم يكونون من جملة أهل الأعراف المخبر عنهم في القرآن بأنّهم لم يدخلوا الجنّة وهم يطمعون . وليس المراد منها أنّهم المقصودُ من هذه الآية كما لا يخفى على المتأمّل فيها .والذي ينبغي تفسير الآية به : أنّ هذه الأعراف جعلها الله مكاناً يوقف به من جعله الله من أهل الجنّة قبل دخوله إياها ، وذلك ضرب من العقاب خفيف ، فجعل الدّاخلين إلى الجنّة متفاوتين في السبق تفاوتاً يعلم الله أسبابه ومقاديره ، وقد قال تعالى : { لا يستوي منكم من أنفق من قبل الفتح وقاتل أولئك أعظم درجة من الذين أنفقوا من بعدُ وقاتلوا وكلاً وعد الله الحسنى } \\[ الحديد : 10 \\] وخصّ الله بالحديث في هذه الآيات رجالاً من أصحاب الأعراف . ثمّ يحتمل أن يكون أصحاب الأعراف من الأمّة الإسلاميّة خاصّة . ويحتمل أن يكونوا من سائر الأمم المؤمنين برسلهم ، وأيّاما كان فالمقصود من هذه الآيات هم من كان من الأمّة المحمّديّة .وتنوين { كلاً } عوضٌ عن المضاف إليه المعروف من الكلام المتقدّم . أي كلّ أهل الجنّة وأهل النّار .والسيما بالقصر السمة أي العلامة ، أي بعلامة ميَّز الله بها أهل الجنّة وأهل النّار ، وقد تقدّم بيانها واشتقاقها عند قوله تعالى : { تعرفهم بسيماهُم } في سورة البقرة ( 273 ).ونداؤهم أهلَ الجنّة بالسّلام يؤذن بأنّهم في اتّصال بعيد من أهل الجنّة ، فجعل الله ذلك أمارة لهم بحسن عاقبتهم ترتاح لها نفوسهم . ويعلمون أنّهم صائرون إلى الجنّة ، فلذلك حكى الله حالهم هذه للنّاس إيذاناً بذلك وبأن طمعهم في قوله : لم يدخلوها وهم يطمعون } هو طمع مستند إلى علامات وقوع المطموع فيه ، فهو من صنف الرّجاء كقوله : { والذي أطمع أن يغفر لي خطيئتي يوم الدين } ( الشعراء 82 ).و { أن } تفسير للنّداء ، وهو القول { سلام عليكم }. و { سلام عليكم } دعاءُ تحيّة وإكرام .وجملة : { لم يدخلوها وهم يطمعون } مستأنفة للبيان ، لأنّ قوله { ونادوا أصحاب الجنّة } يثير سؤالاً يبحث عن كونهم صائرين إلى الجنّة أو إلى غيرها . وجملة : { وهم يطمعون } حال من ضمير { يدخلوها } والجملتان معاً معترضتان بين جملة : { ونادوا أصحاب الجنة } وجملة { وإذا صرفت أبصارهم }.\n\n",
      "translations": [
        {
          "translation": "(Between them) between Paradise and hell (is a veil) a wall. (And on the Heights are men) on the wall are men-whose good deeds are of the same amount as their evil deeds; it is also said these are men of knowledge and experts in law but who held doubts about provision (who know them all) all those who enter hell and those who enter Paradise (by their marks) they know those who enter hell by their darkened faces and blue eyes and those who enter Paradise by their lightened faces: at once handsome and radiant. (And they) the people on the wall (call unto the dwellers of the Garden: Peace be unto you) people of Paradise! (They enter it not) yet (although they hope (to enter)) i.e. the people on the wall.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { وَعَلَى ٱلأَعْرَافِ رِجَالٌ } قالَ زيدُ بن علي عليهما السَّلامُ هو سورٌ بين الجَنةِ والنَّارِ\n والأَعرافُ: كُلُّ موضعٍ مُرتفعٍ مُشرفٍ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd the words of the Almighty: {And on the mountains are men} Zayd ibn `Ali, peace be upon him, said that it is a barrier between Paradise and Hell.\n\n\nAnd the mountains: every high and elevated place.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَبَيْنَهُمَا } أي: بين الموحدين المتمكنين في نعيم الجنان\n المشرفين بشرف لقاء الرحمن\n والمشركين المحبوسين في سجِّين الإمكان\n المتحرقين بنيران الخذلان والحرمان { حِجَابٌ } لا يدرك كنهه إلا العليم العلام { وَعَلَى ٱلأَعْرَافِ } أي: البرزخ { رِجَالٌ } من الأبرار { يَعْرِفُونَ كُلاًّ } من الفريقين { بِسِيمَاهُمْ } أي: بوجوههم التي يلي الحق والباطل وهم متقربون في البرزخ لا إلى هؤلاء ولا إلى هؤلاء { وَنَادَوْاْ } أهل البرزخ { أَصْحَابَ ٱلْجَنَّةِ أَن سَلاَمٌ عَلَيْكُمْ } هنيئاً لكم\n ما تتنعمون فيها وتتمتعون بها حال كونهم { لَمْ يَدْخُلُوهَا وَهُمْ يَطْمَعُونَ } [الأعراف: 46] دخولها من فضل الله وسعة رحمته وجوده\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وبينهما } أي: بين الفريقين { حجابٌ } \n أو بين الجنة والنار حجاب\n يمنع دخول أثر أحدهما للأخرى\n { وعلى الأعراف } وهو السور المضروب بين الجنة والنار\n { رجالٌ } طائفة من الموحدين استوت حسناتهم وسيئاتهم\n كما في الحديث\n وقال في الإحياء: يشبه أن يكونوا من لم تبلغهم الدعوة في أطراف البلاد\n فلم تكن لهم معرفة ولا جحود ولا طاعة ولا معصية\n فلا وسيلة تقربهم\n ولا جناية تبعدهم\n ولهم السلامة فقط\n لا تقريب ولا تبعيد\n هـ\n قلت: لكن سيأتي أنهم يدخلون الجنة\n ثم وصفهم بقوله: { يعرفون كُلاًّ } من أهل الجنة والنار\n { بسيماهم }: بعلامتهم التي أعلمهم الله بها كبياض الوجوه من أهل الجنة\n وسوادها في أهل النار\n أو غير ذلك من العلامات\n { ونادوا أصحابَ الجنة } \n إذا نظروا إليهم\n فقالوا لهم: { أن سلامٌ عليكم } \n أي: نادوهم بالسلام عليهم\n { لم يدخلوها } أي: الجنة\n { وهم يطمعون } في دخولها",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "7:48",
      "similarity": 0.48719569388677036
    },
    {
      "verse": "83:15",
      "similarity": 0.46735315441771147
    },
    {
      "verse": "19:17",
      "similarity": 0.4476423764060516
    },
    {
      "verse": "38:32",
      "similarity": 0.4475501017726392
    },
    {
      "verse": "42:51",
      "similarity": 0.4148953289652494
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007046.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007046.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:46.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}