{
  "chapter": "الأعراف",
  "text": "واذا صرفت ابصرهم تلقاء اصحب النار قالوا۟ ربنا لا تجعلنا مع القوم الظلمين",
  "translations": [
    {
      "translation": "When they turn their eyes towards the Companions of the Fire, they will say, 'Our Lord, do not place us with the people of the wrongdoers!'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their eyes fall on the inmates of Hell they will say: \"O Lord, do not place us in the crowd of the vile.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when the eyes of the people of the Heights will be turned towards the people of Hell they will say: 'Our Lord! Do not cast us among the wrongdoing people.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their eyes turn to the dwellers of hell, they will pray, \"Lord, do not place us among the unjust.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when their eyes turn towards the people of hell, they will say, “Our Lord! Do not put us along with the unjust.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when their eyes will be turned towards the dwellers of the Fire, they will say: \"Our Lord! Place us not with the people who are wrongdoers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when their eyes shall be turned towards the inmates of the fire, they shall say: Our Lord! place us not with the unjust\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when their eyes are turned towards the inhabitants of the Fire they shall say, 'Our Lord, do not Thou assign us with the people of the evildoers.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when their eyes are turned toward the dwellers of the Fire, they say: Our Lord! Place us not with the wrong-doing folk.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "and when they turn their eyes towards the inmates of the Fire, they will say, \"Our Lord, do not include us among the wrongdoers!\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when their eyes Will be turned toward the fellows of the Fire, they will say: our Lord! place us not with these wrong-doing people.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when their look is turned toward the inmates of the Fire, they will say, ‘Our Lord, do not put us among the wrongdoing lot!’)\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "When their eyes shall be turned towards the Companions of the Fire, they will say: \"Our Lord! send us not to the company of the wrong-doers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when their eyes will be turned towards the dwellers of the Fire, they will say: \"Our Lord! Place us not with the people who are Zalimun (polytheists and wrong-doers).\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when they turn their eyes towards the companions of the Fire, they will say: 'Lord, do not cast us among the harmdoers'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when their eyes are directed towards the inmates of the Fire, they will say, “Our Lord, do not place us among the wrongdoing people.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And when their eyes are turned toward the companions of the Fire, they say, \"Our Lord, do not place us with the wrongdoing people.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:47] And when their eyes, those of the men of the Heights, are turned towards, in the direction of, the inhabitants of the Fire, they shall say, ‘Our Lord, do not assign us, to the Fire, with the evildoing folk’.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And when their eyes are turned towards) when they look at (the dwellers of the Fire, they say: Our Lord!) our Lord (Place us not with the wrong-doing folk) with the disbelievers in hell.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { تِلْقَآءَ أَصْحَابِ ٱلنَّارِ } معناه حِيالُهم\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, {The companions of the Fire will be brought to Him} means that they will be brought before Him.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n{ وإذا صرفت أبصارهم تلقاء أصحاب النار } أي: لا ينظرون إليهم طوعاً ورأفة ورحمة ورضا، بل كراهة واعتباراً كأن صارفاً صرف أبصارهم إليهم { ربنا لا تجعلنا مع القوم الظالمين } أي: لا تزغ قلوبنا بعد إذ هديتنا، كما قال أمير المؤمنين علي عليه السلام: \" أعوذ بالله من الضلالة بعد الهدى \"\n وقال النبي صلى الله عليه وسلم:\n\n \" اللهم ثَبت قلبي على دينك، فقيل له: أما غفر الله لك ما تقدّم من ذنبك وما تأخر؟ قال صلى الله عليه وسلم: أو ما يؤمنني أنّ مثل القلب كمثل ريشة في فلاة، تقلبها الرياح كيف شاءت\n \" \n\n{ ولقد جئناهم بكتاب فصلناه على علم } أي: البدن الإنساني المفصل غلى أعضاء وجوارح وآلات وحواس تصلح للاستكمال على ما يقتضيه العلم الإلهي وتأويله ما يؤول إليه أمره في العاقبة من الانقلاب إلى ما لا يصلح لذلك عند البعث من هيئات وصور وأشكال تناسب صفاتهم وعقائدهم على مقتضى قوله تعالى:\n\n[الأنعام، الآية: 139]، كما قال تعالى:\n",
      "translations": [
        {
          "translation": "\n{And if their eyes are averted from them} That is, they do not look at them voluntarily, with kindness, mercy and approval.,\n\nNo, on the contrary, it would be as if the person who {Our Lord, do not make us among the unjust people} had their eyes diverted from them, that is, do not let our hearts be corrupted after you have guided us., \"I seek refuge in Allah from being misguided after being shown the truth\"\n The Prophet (ﷺ) said:\n\n\n\"Oh Allah, keep my heart firm on Your religion.\",\n\n{He was told}, \"Will Allah forgive you for what you have done and what you have not done?\" The Prophet Muhammad (peace be upon him) said, \"Or will he believe me that the heart is like a feather in a {flask}?\",\n\nThe wind blew it as it pleased.\n\n\n\"In the name of God, the Most Merciful, the Most Compassionate.\n\nPraise be to God, the Lord of all creation, and may the peace and blessings of God be upon our Prophet Muhammad.\n\nMy brothers and sisters in Islam, I am honored to be here with you today.Islam is a religion of peace, and it is our duty as Muslims to spread that peace to the world. We must stand united against those who would seek to harm us or our way of life.\n\nMay God guide us all to the straight path, and may He grant us the strength to persevere in the face of adversity. Amen.\"\n\n\nWe have brought them a Book, which We have divided into sections, in accordance with the knowledge {of the human body} - that is, the human body that is divided into limbs, organs, and senses that are suitable for the completion of the divine knowledge and the interpretation of what is incumbent upon him in the hereafter from the revolution to what is not suitable for that at the resurrection of bodies and shapes and forms that befit their attributes and beliefs according to the saying of Almighty:\n The livestock\n\nالأنعام هي الحيوانات التي يستخدمها البشر من أجل الغذاء والمواد الأساسية. وتشمل الأنعام البقر والغنم والحمام والإبل والأسد والذباب وغيرها.,\n\n\"Do you then think that most of them listen or heed? They are nothing but like cattle; nay, they are even farther astray.\",\n\nAs the Almighty has said:",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَإِذَا صُرِفَتْ أَبْصَارُهُمْ } أي: أبصروا بذلك البرزخ { تِلْقَآءَ أَصْحَابِ ٱلنَّارِ قَالُواْ } متضرعين متخشعين: { رَبَّنَا } وإن صدر عنا من التقصير ما صدر { لاَ تَجْعَلْنَا } بلطفك { مَعَ ٱلْقَوْمِ ٱلظَّالِمِينَ } [الأعراف: 47] الخارجين عن حدودك مطلقاً عناداً وإصراراً\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n { وإذا صُرِفت أبصارُهم تلقاءَ أصحابِ النار } أي: التفتوا إليهم على وجه القلة، تعوذوا من حالهم، { قالوا ربنا لا تجعلنا مع القوم الظالمين } في النار\n الإشارة: إذا وصل أهل الجد والتشمير إلى حضرة العي الكبير نادوا أهلَ البطالة والتقصير، فقالوا لهم: قد وجدنا ما وعدنا ربنا من كشف الحجاب والدخول مع الأحباب، حقًا فهل وجدتم ما وعد ربكم حقًا كما وجدنا نحن؟ قالوا على وجه الدعوى والغلط: نعم، فأذن مؤذن بينهم، بلسان الحال: أن لعنة الله على الظالمين الذين بقوا مع حظوظ أنفسهم، ولم يخرقوا شيئًا من عوائدهم، مع تراميهم على مراتب الرجال، وادعائهم بلوغ غاية الكمال، الذين يصدون عن طريق الخصوص ويبغونها عوجًا، وهم بالخصلة الآخرة ـ وهي إشراق نور الحقيقة على أهل التربية ـ هم كافرون، وبينما حجاب كبير، وهو حجاب الغفلة، فلا يعرفون أهل اليقظة، وهم أهل مقام الإحسان، بل بينهما مفاوز ومهَامِه، كما قال الشاعر:\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "25:19",
      "similarity": 0.4504947250546775
    },
    {
      "verse": "6:16",
      "similarity": 0.3956962851598476
    },
    {
      "verse": "12:34",
      "similarity": 0.3731593086865918
    },
    {
      "verse": "18:53",
      "similarity": 0.3601936799046626
    },
    {
      "verse": "18:54",
      "similarity": 0.3490895752061294
    }
  ]
}