{
  "chapter": "الأعراف",
  "text": "ونادى اصحب الاعراف رجالا يعرفونهم بسيمىهم قالوا۟ ما اغنى عنكم جمعكم وما كنتم تستكبرون",
  "translations": [
    {
      "translation": "The Companions of the Ramparts will call out to men they recognise by their mark, saying, 'What you amassed was of no use to you, nor was your arrogance.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Recognising them by their marks the men of al-A'raf will call (to the inmates of Hell): \"Of what use was your amassing (of wealth) of which you were proud?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of the Heights will cry out to the men whom they would recognize by their marks. saving: 'Neither your numbers nor the riches of which you were proud availed you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of the Heights will say to those (in hell) whose faces they recognize, \"Why did your supporters and your pride not help you?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the men on the Heights will call to some men whom they recognise by their foreheads, and say, “What benefit did your derive from your populace and from what you prided in?”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the men on Al-A`raf will call unto the men whom they would recognize by their marks, saying: \"Of what benefit to you was your gathering, and your arrogance\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the dwellers of the most elevated places shall call out to men whom they will recognize by their marks saying: Of no avail were to you your amassings and your behaving haughtily:\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the dwellers on the Battlements shall call to certain men they know by their sign: 'Your amassing has not availed you, neither your waxing proud.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the dwellers on the Heights call unto men whom they know by their marks, (saying): What did your multitude and that in which ye took your pride avail you?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of the heights will call out to men they recognize by their marks, \"What use have your great numbers and your false pride been?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the fellows of the heights will cry unto the men whom they would recognise by their mark, and say: your multitude availed you naught nor that over which ye were wont to be stiff-necked.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The occupants of the Elevations will call out to certain men whom they recognize by their marks, ‘Your rallying did not avail you, nor what you used to disdain.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The men on the heights will call to certain men whom they will know from their marks, saying: \"Of what profit to you were your hoards and your arrogant ways?\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the men on Al-A'raf (the wall) will call unto the men whom they would recognise by their marks, saying: \"Of what benefit to you were your great numbers (and hoards of wealth), and your arrogance against Faith?\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the companions of the ramparts call to men whose marks they recognize: 'Neither your amassing nor your pride have availed you.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the dwellers of the Elevations will call to men they recognize by their features, saying, “Your hoardings did not avail you, nor did your arrogance.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the companions of the Elevations will call to men [within Hell] whom they recognize by their mark, saying, \"Of no avail to you was your gathering and [the fact] that you were arrogant.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:48] And those of the Heights call to men, from among the inhabitants of the Fire, whom they know by their mark, [saying]: ‘Your masses, of property, or your multitude, and your haughtiness, that is, your disdaining of belief, have not availed you, [as protection against] the Fire. And they also say to them, pointing to those [formerly] oppressed Muslims:\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the dwellers on the Heights call unto men) among the disbelievers (whom they know) that is before they entered hell (by their marks) by their darkened faces and blue eyes, ((saying)) Walid Ibn al- Mughirah! Abu Jahl Ibn Hisham! Umayyah Ibn Khalaf! Ubayy Ibn Khalaf al-Jumahi! Aswad Ibn 'Abd al-Muttalib! leaders! (What did your multitude) of wealth and servants (and that in which ye took your pride) which made you scorn belief in Muhammad (pbuh) and the Qur'an (avail you?)\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { بِسِيمَاهُمْ } معناه بِعَلاماتِهِمْ\n\n",
      "translations": [
        {
          "translation": "\n\nAnd His saying, \"With their {attributes}\" means with their signs.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَنَادَىٰ أَصْحَابُ ٱلأَعْرَافِ } على وجه التوبيخ والتقريع { رِجَالاً } من صناديدهم كانوا { يَعْرِفُونَهُمْ بِسِيمَاهُمْ } بوجوههم الباطلة من المال والجاه والرئاسة والتفوق وغيرها { قَالُواْ } لهم متهكمين: { مَآ أَغْنَىٰ عَنكُمْ جَمْعُكُمْ } أي: ما أسقط جمعكم المال وجمعيتكم بسببب الجاه شيئاً من عذاب الله { وَمَا كُنْتُمْ تَسْتَكْبِرُونَ } [الأعراف: 48] أي: ما يفيد لكم استكباركم على خلق الله وعن آياته اليوم؟!\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "11:83",
      "similarity": 0.5546600155886122
    },
    {
      "verse": "7:46",
      "similarity": 0.48719569388677036
    },
    {
      "verse": "51:34",
      "similarity": 0.47073121257869227
    },
    {
      "verse": "16:10",
      "similarity": 0.41484955089271836
    },
    {
      "verse": "7:167",
      "similarity": 0.3847266582255043
    }
  ]
}