{
  "chapter": "الأعراف",
  "text": "اهؤلاء الذين اقسمتم لا ينالهم الله برحمة ادخلوا۟ الجنة لا خوف عليكم ولا انتم تحزنون",
  "translations": [
    {
      "translation": "Are these the people you swore that Allah's mercy would never reach?' 'Enter the Garden. You will feel no fear and know no sorrow.'",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "(Then pointing to the inmates of Paradise, they will say): \"Are they not those of whom you had sworn and said: 'God will not have mercy on them?' (And yet they have been told,) 'Enter Paradise where you will have no fear or regret.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are these not the ones of whom you swore that Allah shall grant them nothing of His mercy?' To such it will be said: 'Enter Paradise. You have no cause to fear, nor shall you grieve.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "They will also say, \"Are these (the people of Paradise) the ones of whom you swore would receive no mercy from God?\" They will continue, \" People of Paradise, live therein without any fear or grief.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Are these the people (Muslims) regarding whom you swore that Allah would not have mercy on them at all? Whereas to the Muslims it has been said ‘Enter Paradise; you shall have no fear nor any grief.’”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they those, of whom you swore that Allah would never show them mercy (Behold! It has been said to them): `Enter Paradise, no fear shall be on you, nor shall you grieve.\"'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are these they about whom you swore that Allah will not bestow mercy on them? Enter the garden; you shall have no fear, nor shall you grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are these the ones that you swore God would never reach with mercy?' 'Enter Paradise; no fear upon you, nor shall you sorrow.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are these they of whom ye swore that Allah would not show them mercy? (Unto them it hath been said): Enter the Garden. No fear shall come upon you nor is it ye who will grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "See! are these not the people you swore would never earn God's mercy? 'Enter the Garden! No fear shall come upon you nor shall you grieve.'\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are these the ones of whom ye sware that Allah would not reach them with His mercy? Unto them it hath been said enter the Garden; on you shall come no fear nor shall ye grieve.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are these the ones concerning whom you swore that Allah will not extend them any mercy?’ ‘Enter paradise! You shall have no fear, nor shall you grieve.’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Behold! are these not the men whom you swore that Allah with His Mercy would never bless? Enter ye the Garden: no fear shall be on you, nor shall ye grieve.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are they those, of whom you swore that Allah would never show them mercy. (Behold! It has been said to them): \"Enter Paradise, no fear shall be on you, nor shall you grieve.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Are these whom you swore that Allah would never have mercy upon them' (To them it will be said:) 'Enter Paradise. You have nothing to fear neither will you be saddened'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "“Are these the ones you swore God will not touch with mercy?” “Enter the Garden; you have nothing to fear, and you will not grieve.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[Allah will say], \"Are these the ones whom you [inhabitants of Hell] swore that Allah would never offer them mercy? Enter Paradise, [O People of the Elevations]. No fear will there be concerning you, nor will you grieve.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:49] Are these the ones of whom you swore that God would never grant them mercy?’: it has already been said to them, ‘Enter Paradise; no fear shall come upon you, nor shall you grieve’ (a variant reading [for udkhulū, ‘enter’ (imperative, second person plural)] has the passive udkhilū, ‘they have been admitted’, or dakhalū, ‘they entered’; the negation clause [‘no fear shall come upon you, nor shall you grieve’] is a circumstantial qualifier, in other words, [they enter Paradise] while this is being said to them).\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "Then, they looked at the dwellers of Paradise: Salman al-Farisi, Suhayb [al-Rumi], 'Ammar [Ibn Yasir] and all the other meek and weak believers, and said: (Are these) weak people (they of whom ye swore) in the life of this world, group of disbelievers (that Allah would not show them mercy?) that Allah would not enter them to Paradise. They have indeed entered Paradise in spite of you. Allah then says to the people of the Heights: ((Unto them it hath been said) Enter the Garden. No fear) from the torment (shall come upon you nor is it ye who will grieve.) 162\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": []
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\nانظروا أيها الحمقى { أَهَـۤؤُلاۤءِ } المترفهون المتنعمون في مقر العز والتمكن هم { ٱلَّذِينَ أَقْسَمْتُمْ } في النشأة الأولى أنهم { لاَ يَنَالُهُمُ ٱللَّهُ بِرَحْمَةٍ } في النشأة الأخرى، كيف قبل لهم من قبل الحق تفضلاً وامتناناً عليهم: { ٱدْخُلُواْ ٱلْجَنَّةَ } التي هي دار الأمن والأمان { لاَ خَوْفٌ عَلَيْكُمْ } بعدما دخلتم فيها { وَلاَ أَنتُمْ تَحْزَنُونَ } [الأعراف: 49] أصلاً من فوت شيء وتعويقه\n\n\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "\n",
      "translations": []
    }
  ]
}