{
  "chapter": "الأعراف",
  "text": "ونادى اصحب النار اصحب الجنة ان افيضوا۟ علينا من الماء او مما رزقكم الله قالوا۟ ان الله حرمهما على الكفرين",
  "translations": [
    {
      "translation": "The Companions of the Fire will call out to the Companions of the Garden, 'Throw down some water to us or some of what Allah has given you as provision.' They will say, 'Allah has forbidden them to the kafirun:",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those in Hell will call to the inmates of Paradise: \"Pour a little water over us, or give us a little of what God has given you.\" They will answer: \"God has verily forbidden these to those who denied the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of the Fire will cry out to the people of Paradise: 'Pour out some water on us or throw at us something of what Allah has bestowed upon you.' They will reply: 'Allah has forbidden them to the deniers of the truth,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The dwellers of the fire will ask the people of Paradise to give them some water or other things which God has granted to them. They will reply, \"God has deprived the unbelievers of the blessings of Paradise.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the people of hell will cry out to the people of Paradise, “Provide us some benefit from your water or from the food Allah has provided you”; they will say, “Indeed Allah has forbidden both to the disbelievers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the dwellers of the Fire will call to the dwellers of Paradise: \"Pour on us some water or anything that Allah has provided you with.\" They will say: \"Both (water and provision) Allah has forbidden for the disbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the inmates of the fire shall call out to the dwellers of the garden, saying: Pour on us some water or of that which Allah has given you. They shall say: Surely Allah has prohibited them both to the unbelievers.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The inhabitants of the Fire shall call to the inhabitants of Paradise: 'Pour on us water, or of that God has provided you!' They will say: 'God has forbidden them to the unbelievers\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the dwellers of the Fire cry out unto the dwellers of the Garden: Pour on us some water or some wherewith Allah hath provided you. They say: Lo! Allah hath forbidden both to disbelievers (in His guidance),\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The people of the Fire shall call out to the people of heaven, \"Pour out some water on us, or give us something out of that which God has bestowed upon you.\" But the blessed will reply, \"God has forbidden all that to those who denied the truth.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the fellows of the Fire will cry unto the fellows of the Garden: pour out on us water or aught wherewith Allah hath provided you. They will say verily Allah hath forbidden it unto infidels.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The inmates of the Fire will call out to the inhabitants of paradise, ‘Pour on us some water, or something of what Allah has provided you.’ They will say, ‘Allah has indeed forbidden these two to the faithless!’\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The Companions of the Fire will call to the Companions of the Garden: \"Pour down to us water or anything that Allah doth provide for your sustenance.\" They will say: \"Both these things hath Allah forbidden to those who rejected Him.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the dwellers of the Fire will call to the dwellers of Paradise: \"Pour on us some water or anything that Allah has provided you with.\" They will say: \"Both (water and provision) Allah has forbidden to the disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The companions of the Fire will call out to the companions of Paradise: 'Pour upon us some water, or some of that which Allah has provided you' But they shall reply: 'Allah has forbidden both to the unbelievers,\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "The inmates of the Fire will call on the inhabitants of the Garden, “Pour some water over us, or some of what God has provided for you.” They will say, “God has forbidden them for the disbelievers.”\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "And the companions of the Fire will call to the companions of Paradise, \"Pour upon us some water or from whatever Allah has provided you.\" They will say, \"Indeed, Allah has forbidden them both to the disbelievers.\"\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:50] And the inhabitants of the Fire call out to the inhabitants of Paradise [saying]: ‘Pour on us some water, or some of that, food, which God has provided you!’ They say: ‘God has forbidden, He has prohibited, both to the disbelievers,\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(And the dwellers of the Fire cry out unto the dwellers of the Garden; Pour on us some water or some of that wherewith Allah hath provided you) of the fruits of Paradise. (They) i.e. the dwellers of Paradise (say: Lo! Allah hath forbidden both) water and the fruits of Paradise (to disbelievers (in His guidance)),\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\n",
      "translations": [
        {
          "translation": "",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ وَنَادَىٰ أَصْحَابُ ٱلنَّارِ أَصْحَابَ ٱلْجَنَّةِ } متمنين منهم متحسرين: { أَنْ أَفِيضُواْ } صبوا { عَلَيْنَا } رشحة { مِنَ ٱلْمَآءِ } الذي هو سبب حياتكم الحقيقي وبقائكم السرمدي { أَوْ مِمَّا رَزَقَكُمُ ٱللَّهُ } من الرزق المعنوي { قَالُوۤاْ } في جوابهم بإلهام الله إياهم: { إِنَّ ٱللَّهَ } المطلع الاستعدادات عباده { حَرَّمَهُمَا عَلَى ٱلْكَافِرِينَ } [الأعراف: 50]\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "2:199",
      "similarity": 0.6424000835238971
    },
    {
      "verse": "24:14",
      "similarity": 0.6132020504823287
    },
    {
      "verse": "46:8",
      "similarity": 0.5888348867367955
    },
    {
      "verse": "2:198",
      "similarity": 0.5747402329202097
    },
    {
      "verse": "5:83",
      "similarity": 0.27559703253958934
    }
  ],
  "audio": [
    {
      "path": "https://everyayah.com/data/Alafasy_64kbps/007050.mp3",
      "style": "حفص",
      "recitor": "مشاري بن راشد العفاسي"
    },
    {
      "path": "https://everyayah.com/data/warsh/warsh_yassin_al_jazaery_64kbps/007050.mp3",
      "style": "ورش",
      "recitor": "ياسين الجزائري"
    },
    {
      "path": "https://github.com/mohammedterryjack/quran-audio-api/raw/main/hamza/7:50.mp3",
      "style": "خلف عن حمزة",
      "recitor": "يوسف بن نوح أحمد"
    }
  ]
}