{
  "chapter": "الأعراف",
  "text": "الذين اتخذوا۟ دينهم لهوا ولعبا وغرتهم الحيوة الدنيا فاليوم ننسىهم كما نسوا۟ لقاء يومهم هذا وما كانوا۟ بـايتنا يجحدون",
  "translations": [
    {
      "translation": "those who took their deen as a diversion and a game, and were deluded by the life of the dunya.' Today We will forget them just as they forgot the encounter of this Day and denied Our Signs.",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who made a sport and frolic of their faith and were lured by the life of the world.\" As they had forgotten the meeting of this Day so shall We neglect them today for having rejected Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who have made their religion a sport and play. and whom the life of the world has beguiled. So on that Day We shall forget them in the manner they forget their meeting of this Day with Us and persist in denying Our revelations.'\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "On that Day We will neglect those who were deceived by the worldly life and who treated their religion as a useless game, because they had forgotten such a day and rejected Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "People who made their religion a sport and pastime, and whom the worldly life deceived; so this day We will disregard them, the way they had neglected their confronting of this day, and the way they used to deny Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who took their religion as amusement and play, and the life of the world deceived them.\" So this Day We shall forget them as they forgot their meeting of this Day, and as they used to reject Our Ayat.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who take their religion for an idle sport and a play and this life's world deceives them; so today We forsake them, as they neglected the meeting of this day of theirs and as they denied Our communications.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who have taken their religion as a diversion and a sport, and whom the present life has deluded.' -- Therefore today We forget them as they forgot the encounter of this their day, and that they denied Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who took their religion for a sport and pastime, and whom the life of the world beguiled. So this day We have forgotten them even as they forgot the meeting of this their Day and as they used to deny Our tokens.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who treated religion as a pastime and an idle sport and whom the life of the world had beguiled.\" On that Day We shall forget them, as they forgot their meeting of that Day with Us, for they denied Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who took their religion as a sport and a play and whom the life of the world beguiled. So today We will forget them even as they forget the meeting of this their Day and as they were ever gainsaying Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who took their religion for diversion and play and whom the life of the world had deceived. So today, We will forget them as they forgot the encounter of this day of theirs, and as they used to impugn Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Such as took their religion to be mere amusement and play, and were deceived by the life of the world.\" That day shall We forget them as they forgot the meeting of this day of theirs, and as they were wont to reject Our signs.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who took their religion as an amusement and play, and the life of the world deceived them.\" So this Day We shall forget them as they forgot their meeting of this Day, and as they used to reject Our Ayat (proofs, evidences, verses, lessons, signs, revelations, etc.).\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "who made their religion an amusement and play, and who were beguiled by their worldly life' On this Day We will forget them as they forgot the meeting of that Day; for they denied Our verses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Those who took their religion lightly, and in jest, and whom the worldly life deceived. Today We will ignore them, as they ignored the meeting on this Day of theirs, and they used to deny Our revelations.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "Who took their religion as distraction and amusement and whom the worldly life deluded.\" So today We will forget them just as they forgot the meeting of this Day of theirs and for having rejected Our verses.\n",
      "language": "english",
      "translator": ""
    },
    {
      "translation": "[7:51] those who took their religion for a diversion and a game, and whom the life of this world has deluded.’ Therefore today We have forgotten them, We have left them in the Fire, just as they forgot the encounter of this day of theirs, when they neglected to perform [good] deeds for it, and because they used to deny Our signs.\n",
      "language": "english",
      "translator": ""
    }
  ],
  "commentaries": [
    {
      "author": "ابن عباس",
      "year": "68",
      "text": "",
      "translations": [
        {
          "translation": "(Who took their religion for a sport) for falsehood (and pastime) merriment; it is also said this means: a joke and mockery, (and whom the life of the world beguiled) the comfort and luxury of the life of the world beguiled them. (So this day) the Day of Judgement (We have forgotten them) We leave them in hell (even as they forgot) they left (the meeting of this Day) the belief in this Day of theirs (and as they used to deny Our tokens) Our Scripture and Messenger.\n",
          "language": "english",
          "translator": "Mr. Mokrane Guezzou"
        }
      ]
    },
    {
      "author": "زيد بن علي",
      "year": "120",
      "text": "\nوقوله تعالى: { فَٱلْيَوْمَ نَنسَاهُمْ } معناهُ نُؤخِرهُم ونتركُهمْ من الرَّحمةِ\n\n\n\n\nوقوله تعالى: { كَمَا نَسُواْ لِقَآءَ يَوْمِهِمْ هَـٰذَا } معناهُ تَكُوهُ وجَحَدُوهُ ولَمْ يُؤمنوا بِه\n\n",
      "translations": [
        {
          "translation": "\nAnd His saying, \"Today We will forget them\" - meaning We will postpone their punishment and leave them out of mercy.\n\nAnd His saying, {As they forgot the appointment of this their day}, its meaning is their denial and their rejection, and they did not believe in it.",
          "language": "english",
          "translator": "chatGPT"
        }
      ]
    },
    {
      "author": "ابن عربي",
      "year": "638",
      "text": "\n",
      "translations": []
    },
    {
      "author": "الجيلاني",
      "year": "713",
      "text": "\n{ ٱلَّذِينَ ٱتَّخَذُواْ دِينَهُمْ } الذي هو سبب الحياة الحقيقية في حياتهم الصورية ونشأتهم الدنيوية { لَهْواً وَلَعِباً } يلهون ويلعبون به ويكذبون من أرسل إليهم وأنزل عليهم الكتب لتبيينه { وَ } ما ذلك إلا أن { غَرَّتْهُمُ ٱلْحَيَٰوةُ ٱلدُّنْيَا } بمزخرفاتها من اللذات الجسمانية والشهوات النفسانية، وصاروا بسبب تغريراتها ناسين العهود والمواثيق التي جرت بيننا وبينهم في بدء فطرتهم { فَٱلْيَوْمَ } أي: حين كشف السرائر وارتفعت الحجب { نَنسَـٰهُمْ } ولم نلتفت نحوهم { كَمَا نَسُواْ } في النشأة الأولى { لِقَآءَ يَوْمِهِمْ هَـٰذَا } في النشاة الأخرى مع ورود الإنذارات التخويفات الجارية على ألسنة الرسل و الكتب { وَمَا } أي: وكما { كَانُواْ بِآيَٰتِنَا } الدالة على أمثال هذه الإنعامات { يَجْحَدُونَ } [الأعراف: 51] ينكرون ويصرون كذلك يخدلون في النار وينسون\n\n",
      "translations": []
    },
    {
      "author": "ابن عجيبة",
      "year": "1224",
      "text": "",
      "translations": []
    }
  ],
  "most_similar_verses": [
    {
      "verse": "29:64",
      "similarity": 0.5491458989902679
    },
    {
      "verse": "47:36",
      "similarity": 0.5285453524567139
    },
    {
      "verse": "6:32",
      "similarity": 0.5136406508264867
    },
    {
      "verse": "29:47",
      "similarity": 0.433004769594214
    },
    {
      "verse": "40:63",
      "similarity": 0.40574201011065864
    }
  ]
}